[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Dukamātikāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1-6"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samānadesaggahaṇānaṃ"
      },
      " ekasmiṃyeva vatthusmiṃ gahetabbānaṃ, ekavatthuvisayānaṃ vā. Atha vā samānadesānaṃ ekavatthukattā samānagahetabbabhāvānaṃ ekuppāditoti attho. Ye dhammā hetusahagatā, te hetūhi saha saṅgayhanti. Yo ca tesaṃ sahetukabhāvo, so sahajātādīhi hetūhi katoti katvā vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘samā…pe… sabbhāva’’"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādi"
      },
      "-saddena cettha suppatiṭṭhitabhāvasādhanādihetubyāpāre pariggaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekībhāvūpagamana"
      },
      "nti ekakalāpabhāvena pavattamānānaṃ cittacetasikānaṃ saṃsaṭṭhatāya samūhaghanabhāvena duviññeyyanānākaraṇataṃyeva sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammanānattābhāvepī"
      },
      "ti sabhāvatthabhedābhāvepi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padatthanānattenā"
      },
      "ti nānāpadābhidheyyatābhedena. Etena pakārantarāpekkhaṃ dukantaravacananti dasseti. Anekappakārā hi dhammā. Teneva ‘‘sabbe dhammā sabbākārena buddhassa bhagavato ñāṇamukhe āpāthaṃ āgacchantī’’ti (mahāni. 156; cūḷani. mogharājamāṇavapucchāniddesa 85) vuttaṃ. Ayañca attho tikesupi daṭṭhabbo. Yesaṃ vineyyānaṃ yehi pakāravisesehi dhammānaṃ vibhāvane kate paṭivedho hoti, tesaṃ tappakārabhedehi dhammānaṃ vibhāvanaṃ. Yesaṃ pana yena ekeneva pakārena vibhāvane paṭivedho hoti, tesampi taṃ vatvā dhammissarattā tadaññaniravasesappakāravibhāvanañca desanāvilāsoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘desetabbappakārajānana’’"
      },
      "ntiādi. Nanu ekena pakārena jānantassa tadaññappakāravibhāvanaṃ aphalaṃ ",
      " hotīti? Na hoti paṭisambhidāppabhedassa upanissayattā. Te pakārā etesanti tappakārā, tabbhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tappakāratā"
      },
      ". Iminā dhammānaṃ vijjamānasseva pakāravisesassa vibhāvanaṃ desanāvilāsoti dasseti."
    ],
    "innerText": "1-6.Samānadesaggahaṇānaṃ ekasmiṃyeva vatthusmiṃ gahetabbānaṃ, ekavatthuvisayānaṃ vā. Atha vā samānadesānaṃ ekavatthukattā samānagahetabbabhāvānaṃ ekuppāditoti attho. Ye dhammā hetusahagatā, te hetūhi saha saṅgayhanti. Yo ca tesaṃ sahetukabhāvo, so sahajātādīhi hetūhi katoti katvā vuttaṃ ‘‘samā…pe… sabbhāva’’nti. Ādi-saddena cettha suppatiṭṭhitabhāvasādhanādihetubyāpāre pariggaṇhāti. Ekībhāvūpagamananti ekakalāpabhāvena pavattamānānaṃ cittacetasikānaṃ saṃsaṭṭhatāya samūhaghanabhāvena duviññeyyanānākaraṇataṃyeva sandhāya vuttaṃ. Dhammanānattābhāvepīti sabhāvatthabhedābhāvepi. Padatthanānattenāti nānāpadābhidheyyatābhedena. Etena pakārantarāpekkhaṃ dukantaravacananti dasseti. Anekappakārā hi dhammā. Teneva ‘‘sabbe dhammā sabbākārena buddhassa bhagavato ñāṇamukhe āpāthaṃ āgacchantī’’ti (mahāni. 156; cūḷani. mogharājamāṇavapucchāniddesa 85) vuttaṃ. Ayañca attho tikesupi daṭṭhabbo. Yesaṃ vineyyānaṃ yehi pakāravisesehi dhammānaṃ vibhāvane kate paṭivedho hoti, tesaṃ tappakārabhedehi dhammānaṃ vibhāvanaṃ. Yesaṃ pana yena ekeneva pakārena vibhāvane paṭivedho hoti, tesampi taṃ vatvā dhammissarattā tadaññaniravasesappakāravibhāvanañca desanāvilāsoti āha ‘‘desetabbappakārajānana’’ntiādi. Nanu ekena pakārena jānantassa tadaññappakāravibhāvanaṃ aphalaṃ hotīti? Na hoti paṭisambhidāppabhedassa upanissayattā. Te pakārā etesanti tappakārā, tabbhāvo tappakāratā. Iminā dhammānaṃ vijjamānasseva pakāravisesassa vibhāvanaṃ desanāvilāsoti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññatthāpī"
      },
      "ti ‘‘ahetukā ceva dhammā na ca hetū’’tiādīsu. Yathā paṭhamadukekadese gahetvā dutiyatatiyadukehi saddhiṃ chaṭṭhadukanaye yojanā ‘‘hetū dhammā sahetukāpi ahetukāpī’’tiādayo tayo dukā labbhanti, evaṃ dutiyatatiyadukekadese gahetvā paṭhamadukena saddhiṃ yojanāya ‘‘sahetukā dhammā hetūpi na hetūpi, ahetukā dhammā hetūpi na hetūpi, hetusampayuttā dhammā hetūpi na hetūpi, hetuvippayuttā dhammā hetūpi na hetūpī’’ti cattāro dukā ",
      " labbhanti, te pana vuttanayeneva sakkā dassetunti na dassitāti daṭṭhabbā. Atha vā pāḷiyaṃ vuttehi catutthapañcamehi aṭṭhakathāyaṃ dassitehi purimehi dvīhi ninnānākaraṇato ete na vuttā. Sannivesavisesamattameva hettha visesoti. Teneva hi ninnānatthattā pāḷiyaṃ āgatadukesu yathāniddhāritadukānaṃ yathāsambhavaṃ avarodhanena avuttataṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘etesu panā’’"
      },
      "tiādimāha."
    ],
    "innerText": "Aññatthāpīti ‘‘ahetukā ceva dhammā na ca hetū’’tiādīsu. Yathā paṭhamadukekadese gahetvā dutiyatatiyadukehi saddhiṃ chaṭṭhadukanaye yojanā ‘‘hetū dhammā sahetukāpi ahetukāpī’’tiādayo tayo dukā labbhanti, evaṃ dutiyatatiyadukekadese gahetvā paṭhamadukena saddhiṃ yojanāya ‘‘sahetukā dhammā hetūpi na hetūpi, ahetukā dhammā hetūpi na hetūpi, hetusampayuttā dhammā hetūpi na hetūpi, hetuvippayuttā dhammā hetūpi na hetūpī’’ti cattāro dukā labbhanti, te pana vuttanayeneva sakkā dassetunti na dassitāti daṭṭhabbā. Atha vā pāḷiyaṃ vuttehi catutthapañcamehi aṭṭhakathāyaṃ dassitehi purimehi dvīhi ninnānākaraṇato ete na vuttā. Sannivesavisesamattameva hettha visesoti. Teneva hi ninnānatthattā pāḷiyaṃ āgatadukesu yathāniddhāritadukānaṃ yathāsambhavaṃ avarodhanena avuttataṃ dassetuṃ ‘‘etesu panā’’tiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā ‘‘etena vā gatidassanenā’’tiādinā vakkhamānanayena ‘‘hetū ceva dhammā ahetukā cā’’tiādīnaṃ sambhavantānaṃ dukānaṃ saṅgahe sati etesampi saṅgaho siyā. Yato vā dukato padaṃ niddhāretvā dukantaraṃ vuccati, tena sati ca nānatte dukantaraṃ labbhati, na cettha koci viseso yathāvuttadukehīti saṃvaṇṇanāsu na dassitanti daṭṭhabbaṃ. Ettha ca yathā sahetukadukato hetusampayuttadukassa, hetusahetukadukato ca hetuhetusampayuttadukassa padatthamattato nānattaṃ, na sabhāvatthato. Evaṃ santepi sahetukahetusahetukaduke vatvā itarepi vuttā, evaṃ hetusampayuttahetuhetusampayuttadukādīhi sabhāvatthanānattābhāvepi padatthanānattasambhavato dhammanānattābhāvepi padatthanānattena dukantaraṃ vuccatīti vuttattā ‘‘hetusahagatā dhammā, na hetusahagatā dhammā, hetusahajātā dhammā, na hetusahajātā dhammā. Hetusaṃsaṭṭhā dhammā, hetuvisaṃsaṭṭhā dhammā. Hetusamuṭṭhānā dhammā, na hetusamuṭṭhānā dhammā. Hetusahabhuno dhammā, na hetusahabhuno dhammā’’tiādīnaṃ, tathā ‘‘hetū ceva dhammā hetusahagatā cā’’tiādīnaṃ, ‘‘na hetū kho pana dhammā hetusahagatāpi, na hetusahagatāpī’’tiādīnañca sambhavantānaṃ anekesaṃ dukānaṃ saṅgaho anuññāto viya dissati. Tathā hi vakkhati ‘‘etena vā gatidassanenā’’tiādi. Evaṃ āsavagocchakādīsupi ayamattho yathāsambhavaṃ vattabbo. Dhammānaṃ vā sabhāvakiccādiṃ bodhetabbākārañca ",
      " yāthāvato jānantena dhammasāminā yattakā dukā vuttā, tattakesu ṭhātabbaṃ. Addhā hi te dukā na vattabbā, ye bhagavatā na vuttāti veditabbaṃ. Na hetuhetusampayuttaduko chaṭṭhadukena ninnānatthoti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesū"
      },
      "ti paṭhamadukatatiyadukesu. Yadi dukantarehi dukantarapadehi ca samānatthattā etesaṃ dukānaṃ dukantarapadānañca avacanaṃ ",
      ", evaṃ sati chaṭṭhaduke paṭhamapadampi na vattabbaṃ catutthaduke dutiyapadena samānatthattā. Tathā ca chaṭṭhadukoyeva na hotīti codanaṃ sandhāyāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘catutthaduke’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukapūraṇattha"
      },
      "nti idaṃ samānatthataṃyeva sandhāya vuttaṃ, desanāviseso pana vijjatiyeva. Atthantaratābhāvepi pakārabhedahetukaṃ dukantaravacananti dassito hi ayamatthoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etena gatidassanenā"
      },
      "ti atthavisesābhāvepi chaṭṭhadukapūraṇasaṅkhātena nayadassanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamaduke…pe… dassito"
      },
      " pāḷiyaṃ vuttehi catutthapañcamehi, aṭṭhakathāyaṃ dassitehi purimehi dvīhi, idha dassitehi catūhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesū"
      },
      "ti dutiyatatiyadukesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamadukapakkhepena dassito"
      },
      " pāḷiyaṃ chaṭṭhadukena itaratra ca itaradukehīti veditabbaṃ."
    ],
    "innerText": "Atha vā ‘‘etena vā gatidassanenā’’tiādinā vakkhamānanayena ‘‘hetū ceva dhammā ahetukā cā’’tiādīnaṃ sambhavantānaṃ dukānaṃ saṅgahe sati etesampi saṅgaho siyā. Yato vā dukato padaṃ niddhāretvā dukantaraṃ vuccati, tena sati ca nānatte dukantaraṃ labbhati, na cettha koci viseso yathāvuttadukehīti saṃvaṇṇanāsu na dassitanti daṭṭhabbaṃ. Ettha ca yathā sahetukadukato hetusampayuttadukassa, hetusahetukadukato ca hetuhetusampayuttadukassa padatthamattato nānattaṃ, na sabhāvatthato. Evaṃ santepi sahetukahetusahetukaduke vatvā itarepi vuttā, evaṃ hetusampayuttahetuhetusampayuttadukādīhi sabhāvatthanānattābhāvepi padatthanānattasambhavato dhammanānattābhāvepi padatthanānattena dukantaraṃ vuccatīti vuttattā ‘‘hetusahagatā dhammā, na hetusahagatā dhammā, hetusahajātā dhammā, na hetusahajātā dhammā. Hetusaṃsaṭṭhā dhammā, hetuvisaṃsaṭṭhā dhammā. Hetusamuṭṭhānā dhammā, na hetusamuṭṭhānā dhammā. Hetusahabhuno dhammā, na hetusahabhuno dhammā’’tiādīnaṃ, tathā ‘‘hetū ceva dhammā hetusahagatā cā’’tiādīnaṃ, ‘‘na hetū kho pana dhammā hetusahagatāpi, na hetusahagatāpī’’tiādīnañca sambhavantānaṃ anekesaṃ dukānaṃ saṅgaho anuññāto viya dissati. Tathā hi vakkhati ‘‘etena vā gatidassanenā’’tiādi. Evaṃ āsavagocchakādīsupi ayamattho yathāsambhavaṃ vattabbo. Dhammānaṃ vā sabhāvakiccādiṃ bodhetabbākārañca yāthāvato jānantena dhammasāminā yattakā dukā vuttā, tattakesu ṭhātabbaṃ. Addhā hi te dukā na vattabbā, ye bhagavatā na vuttāti veditabbaṃ. Na hetuhetusampayuttaduko chaṭṭhadukena ninnānatthoti adhippāyo. Tesūti paṭhamadukatatiyadukesu. Yadi dukantarehi dukantarapadehi ca samānatthattā etesaṃ dukānaṃ dukantarapadānañca avacanaṃ , evaṃ sati chaṭṭhaduke paṭhamapadampi na vattabbaṃ catutthaduke dutiyapadena samānatthattā. Tathā ca chaṭṭhadukoyeva na hotīti codanaṃ sandhāyāha ‘‘catutthaduke’’tiādi. Dukapūraṇatthanti idaṃ samānatthataṃyeva sandhāya vuttaṃ, desanāviseso pana vijjatiyeva. Atthantaratābhāvepi pakārabhedahetukaṃ dukantaravacananti dassito hi ayamatthoti. Etena gatidassanenāti atthavisesābhāvepi chaṭṭhadukapūraṇasaṅkhātena nayadassanena. Paṭhamaduke…pe… dassito pāḷiyaṃ vuttehi catutthapañcamehi, aṭṭhakathāyaṃ dassitehi purimehi dvīhi, idha dassitehi catūhi. Tesūti dutiyatatiyadukesu. Paṭhamadukapakkhepena dassito pāḷiyaṃ chaṭṭhadukena itaratra ca itaradukehīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7-13"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccayabhāvamattena…pe… atthita"
      },
      "nti etena na paṭiladdhattatāsaṅkhātā sasabhāvatāva atthitā, atha kho paṭipakkhena anirodho appahīnatā anipphāditaphalatā kāraṇāsamugghātena phalanibbattanārahatā cāti imamatthaṃ dasseti. Tathā hi ‘‘imasmiṃ sati idaṃ hotī’’ti ettha ‘‘satī’’ti iminā vacanena yena vinā yaṃ na hoti, taṃ atītādipi kāraṇaṃ saṅgahitamevāti. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na sahetu…pe… kālānamevā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Same…pe… dīpeti"
      },
      " samecca sambhūya paccayehi katanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅkhata"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayametesaṃ viseso"
      },
      "ti ayaṃ paccayanibbattānaṃ paccayavantatā anekapaccayanipphāditatā ca dukadvaye purimapadatthānaṃ bhedo, itaresaṃ pana purimapadasaṅgahitadhammavidhurasabhāvatāyāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avini…pe… ṭhapanato"
      },
      "ti ‘‘ettakā’’ti pabhedaparicchedaniddhāraṇavasena abhidhammamātikāyaṃ dhammānaṃ avuttattā vuttaṃ. Suttantamātikāyaṃ pana niddhāritasarūpasaṅkhāvisesattā vinicchitatthaparicchedāyeva avijjādayo vuttāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Pathavīādi rūpa’’"
      },
      "nti etasmiṃ atthavikappe anekahetukesu cittuppādesu hetūnaṃ sahetukabhāvo viya sabbesaṃ pathavīādīnaṃ rūpibhāvo siddhoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘purima…pe… pajjatī’’"
      },
      "ti. Na hi tesu niyato katthaci saṃsāmibhāvoti. Aniccānupassanāya vā lujjati chijjati vinassatīti gahetabbo lokoti taṃgahaṇarahitānaṃ lokuttarānaṃ natthi lokatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tenevā"
      },
      "ti dukkhasaccabhāvena pariññeyyabhāvenāti attho."
    ],
    "innerText": "7-13.Paccayabhāvamattena…pe… atthitanti etena na paṭiladdhattatāsaṅkhātā sasabhāvatāva atthitā, atha kho paṭipakkhena anirodho appahīnatā anipphāditaphalatā kāraṇāsamugghātena phalanibbattanārahatā cāti imamatthaṃ dasseti. Tathā hi ‘‘imasmiṃ sati idaṃ hotī’’ti ettha ‘‘satī’’ti iminā vacanena yena vinā yaṃ na hoti, taṃ atītādipi kāraṇaṃ saṅgahitamevāti. Tenevāha ‘‘na sahetu…pe… kālānamevā’’ti. Same…pe… dīpeti samecca sambhūya paccayehi katanti saṅkhatanti. Ayametesaṃ visesoti ayaṃ paccayanibbattānaṃ paccayavantatā anekapaccayanipphāditatā ca dukadvaye purimapadatthānaṃ bhedo, itaresaṃ pana purimapadasaṅgahitadhammavidhurasabhāvatāyāti. Avini…pe… ṭhapanatoti ‘‘ettakā’’ti pabhedaparicchedaniddhāraṇavasena abhidhammamātikāyaṃ dhammānaṃ avuttattā vuttaṃ. Suttantamātikāyaṃ pana niddhāritasarūpasaṅkhāvisesattā vinicchitatthaparicchedāyeva avijjādayo vuttāti. ‘‘Pathavīādi rūpa’’nti etasmiṃ atthavikappe anekahetukesu cittuppādesu hetūnaṃ sahetukabhāvo viya sabbesaṃ pathavīādīnaṃ rūpibhāvo siddhoti āha ‘‘purima…pe… pajjatī’’ti. Na hi tesu niyato katthaci saṃsāmibhāvoti. Aniccānupassanāya vā lujjati chijjati vinassatīti gahetabbo lokoti taṃgahaṇarahitānaṃ lokuttarānaṃ natthi lokatā. Tenevāti dukkhasaccabhāvena pariññeyyabhāvenāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukabahutā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āpajjatī"
      },
      "ti kasmā vuttaṃ, nanu vīsati dukā vibhattā, ‘‘avuttopi yathālābhavasena veditabbo’’ti ca vakkhatīti dukabahutā ",
      " icchitā evāti? Saccametaṃ, taṃyeva pana dukabahutaṃ anicchanto evamāha. Apica dukabahutā āpajjati, sā ca kho viññāṇabhedānusārinī, tatrāpi kāmāvacarakusalato ñāṇasampayuttāni, tathā mahākiriyato manodvārāvajjananti evaṃpakārānaṃ sabbadhammārammaṇaviññāṇānaṃ anāmasanato na byāpinīti dasseti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dukabahutā’’"
      },
      "tiādinā. Abyāpibhāve pana dosaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tathā ca…pe… siyā’’"
      },
      "ti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niddesena ca viruddha"
      },
      "nti ‘‘ye te dhammā cakkhuviññeyyā, na te dhammā sotaviññeyyā’’tiādinā rūpāyatanādīnaṃ paccekacakkhuviññāṇādinā kenaci viññeyyataṃ, sotaviññāṇādinā kenaci naviññeyyatañca dassentena nikkheparāsiniddesena ‘‘dvinnampi padānaṃ atthanānattato duko hotī’’ti idaṃ vacanaṃ viruddhaṃ, tathā atthuddhāraniddesenapi atthato na sametīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti tassaṃ nikkheparāsisaṃvaṇṇanāyaṃ. Yo ca paṭisedho kato atthanānattato dukaṃ dassetunti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na hi sama…pe… sedhetu"
      },
      "nti etena ‘‘ye te dhammā cakkhuviññeyyā, na te dhammā sotaviññeyyā’’ti ettakesu niddesapadesu dukapadadvayappavatti pāḷito eva viññāyatīti dasseti."
    ],
    "innerText": "Dukabahutāāpajjatīti kasmā vuttaṃ, nanu vīsati dukā vibhattā, ‘‘avuttopi yathālābhavasena veditabbo’’ti ca vakkhatīti dukabahutā icchitā evāti? Saccametaṃ, taṃyeva pana dukabahutaṃ anicchanto evamāha. Apica dukabahutā āpajjati, sā ca kho viññāṇabhedānusārinī, tatrāpi kāmāvacarakusalato ñāṇasampayuttāni, tathā mahākiriyato manodvārāvajjananti evaṃpakārānaṃ sabbadhammārammaṇaviññāṇānaṃ anāmasanato na byāpinīti dasseti ‘‘dukabahutā’’tiādinā. Abyāpibhāve pana dosaṃ dassento ‘‘tathā ca…pe… siyā’’ti āha. Niddesena ca viruddhanti ‘‘ye te dhammā cakkhuviññeyyā, na te dhammā sotaviññeyyā’’tiādinā rūpāyatanādīnaṃ paccekacakkhuviññāṇādinā kenaci viññeyyataṃ, sotaviññāṇādinā kenaci naviññeyyatañca dassentena nikkheparāsiniddesena ‘‘dvinnampi padānaṃ atthanānattato duko hotī’’ti idaṃ vacanaṃ viruddhaṃ, tathā atthuddhāraniddesenapi atthato na sametīti attho. Tatthāti tassaṃ nikkheparāsisaṃvaṇṇanāyaṃ. Yo ca paṭisedho kato atthanānattato dukaṃ dassetunti adhippāyo. Na hi sama…pe… sedhetunti etena ‘‘ye te dhammā cakkhuviññeyyā, na te dhammā sotaviññeyyā’’ti ettakesu niddesapadesu dukapadadvayappavatti pāḷito eva viññāyatīti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathevā"
      },
      "ti ubhinnaṃ kecina-saddānaṃ aniyamato cakkhusotādinissayavohārena cakkhusotaviññāṇādiko bhinnasabhāvoyeva dhammo atthoti dassanavasena. Rūpāyatanameva hi cakkhusotaviññāṇehi viññeyyāviññeyyabhāvato ‘‘kenaci viññeyyaṃ kenaci naviññeyya’’nti ca vuccatīti. Yadi evaṃ imasmimpi pakkhe dukabahutā āpajjatīti codanaṃ manasi katvā āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na cetthā’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viññātabbabhedenā"
      },
      "ti viññātabbavisesena, viññeyyekadesenāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukabhedo"
      },
      "ti dukaviseso, kenaci viññeyyaduko, tappabhedoyeva vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samatto"
      },
      " pariyatto paripuṇṇoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yattakā viññātabbā tattakā dukā"
      },
      "ti dukabhedāpajjanappakāradassanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evañca satī"
      },
      "tiādinā imissā saṃvaṇṇanāya laddhaguṇaṃ dasseti. ‘‘Ye te dhammā cakkhuviññeyyā, na te dhammā sotaviññeyyā’’ti rūpāyatanasseva vuttattā atthabhedābhāvato kathamayaṃ duko hotīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘viññāṇanānattenā’’"
      },
      "tiādi. Yadi pana sabbaviññātabbasaṅgahe dukosamatto hoti, nikkheparāsiniddeso kathaṃ nīyatīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘etassa panā’’"
      },
      "tiādi."
    ],
    "innerText": "Tathevāti ubhinnaṃ kecina-saddānaṃ aniyamato cakkhusotādinissayavohārena cakkhusotaviññāṇādiko bhinnasabhāvoyeva dhammo atthoti dassanavasena. Rūpāyatanameva hi cakkhusotaviññāṇehi viññeyyāviññeyyabhāvato ‘‘kenaci viññeyyaṃ kenaci naviññeyya’’nti ca vuccatīti. Yadi evaṃ imasmimpi pakkhe dukabahutā āpajjatīti codanaṃ manasi katvā āha ‘‘na cetthā’’tiādi. Viññātabbabhedenāti viññātabbavisesena, viññeyyekadesenāti attho. Dukabhedoti dukaviseso, kenaci viññeyyaduko, tappabhedoyeva vā. Samatto pariyatto paripuṇṇoti attho. Yattakā viññātabbā tattakā dukāti dukabhedāpajjanappakāradassanaṃ. Evañca satītiādinā imissā saṃvaṇṇanāya laddhaguṇaṃ dasseti. ‘‘Ye te dhammā cakkhuviññeyyā, na te dhammā sotaviññeyyā’’ti rūpāyatanasseva vuttattā atthabhedābhāvato kathamayaṃ duko hotīti āha ‘‘viññāṇanānattenā’’tiādi. Yadi pana sabbaviññātabbasaṅgahe dukosamatto hoti, nikkheparāsiniddeso kathaṃ nīyatīti āha ‘‘etassa panā’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ",
      " pana yathā viññāṇanānattena viññātabbaṃ bhinditvā duke vuccamāne satipi viññātabbānaṃ ",
      " bahubhāve yattakā viññātabbā, tattakā dukāti natthi dukabahutā dukasaṅgahitadhammekadesesu dukapadadvayappavattidassanabhāvato. Evaṃ dvinnampi padānaṃ atthanānattena duke vuccamānepi yattakāni viññāṇāni, tattakā dukāti natthi dukabahutā dukasaṅga…pe… bhāvato eva. Na hi ekaṃyeva viññāṇaṃ ‘‘kenaci kenacī’’ti vuttaṃ, kintu aparampīti sabbaviññāṇasaṅgahe duko samatto hoti, na ca katthaci dukassa pacchedo atthi indriyaviññāṇānaṃ viya manoviññāṇassapi visayassa bhinnattā. Na hi atītārammaṇaṃ viññāṇaṃ anāgatādiārammaṇaṃ hoti, anāgatārammaṇaṃ vā atītādiārammaṇaṃ, tasmā yathāladdhavisesena visiṭṭhesu manoviññāṇabhedesu tassa tassa visayassa ālambanānālambanavasena dukapadadvayappavatti na sakkā nivāretuṃ. Teneva ca aṭṭhakathāyaṃ ‘‘manoviññāṇena pana kenaci viññeyyañceva aviññeyyañcāti ayamattho atthi, tasmā so avuttopi yathālābhavasena veditabbo’’ti bhūmibhedavasena yathālābhaṃ dassessati. ‘‘Vavatthānābhāvato’’ti idampi anāmaṭṭhavisesaṃ manoviññāṇasāmaññameva gahetvā vuttaṃ. Pāḷi pana indriyaviññāṇehi nayadassanavasena āgatāti daṭṭhabbaṃ. Evañca katvā imissāpi atthavaṇṇanāya ‘‘kenacī’’ti padaṃ aniyamena sabbaviññāṇasaṅgāhakanti siddhaṃ hoti, niddesena ca na koci virodho. Cakkhuviññeyyanasotaviññeyyabhāvehi dukapadadvayappavatti dassitā, na pana cakkhuviññeyyācakkhuviññeyyabhāvehi visesakāraṇābhāvato. Kiñca ‘‘ye vā panā’’ti padantarasampiṇḍanatopi ‘‘ye te dhammā cakkhuviññeyyā…pe… na te dhammā cakkhuviññeyyā’’ti (dha. sa. 1101) ettāvatā dukapadadvayappavatti dassitāti viññāyati. Padantarabhāvadassanattho hi yevāpana-saddo yathā ‘‘ye keci kusalā dhammā, sabbe te kusalamūlā. Ye vā pana kusalamūlā, sabbe te dhammā kusalā’’tiādīsu (yama. 1.mūlayamaka.1). Aññathā ‘‘ye te dhammā cakkhuviññeyyā, na te dhammā sotaviññeyyā. Ye te dhammā sotaviññeyyā, na te dhammā cakkhuviññeyyā’’ti pāḷi abhavissa. Yaṃ pana vadanti ‘‘ye te dhammā cakkhuviññeyyā…pe… na te dhammā cakkhuviññeyyāti iminā atthato dve ",
      " dukā vuttā hontī’’ti, tadapi cakkhuviññeyyācakkhuviññeyyataṃ sotaviññeyyāsotaviññeyyatañca sandhāya vuttaṃ, na pana ‘‘cakkhuviññeyyanasotaviññeyyataṃ sotaviññeyyanacakkhuviññeyyatañcā’’ti daṭṭhabbaṃ. Etena pāḷipaṭisedhanañca nivāritaṃ daṭṭhabbaṃ paṭisedhanasseva abhāvato. Tathā yassa ārammaṇassa vijānanabhāvena yo attho vuccamāno aniyamadassanatthaṃ ‘‘kenacī’’ti vutto, soyeva tato aññassa avijānanabhāvena vuccamāno aniyamadassanatthaṃ puna ‘‘kenacī’’ti vuttoti ",
      " tadatthadassane tenevāti ayaṃ padattho na sambhavatīti na sakkā vattunti. Evamettha yathā aṭṭhakathā avaṭṭhitā, tathā attho yujjatīti veditabbaṃ."
    ],
    "innerText": "Ettha pana yathā viññāṇanānattena viññātabbaṃ bhinditvā duke vuccamāne satipi viññātabbānaṃ bahubhāve yattakā viññātabbā, tattakā dukāti natthi dukabahutā dukasaṅgahitadhammekadesesu dukapadadvayappavattidassanabhāvato. Evaṃ dvinnampi padānaṃ atthanānattena duke vuccamānepi yattakāni viññāṇāni, tattakā dukāti natthi dukabahutā dukasaṅga…pe… bhāvato eva. Na hi ekaṃyeva viññāṇaṃ ‘‘kenaci kenacī’’ti vuttaṃ, kintu aparampīti sabbaviññāṇasaṅgahe duko samatto hoti, na ca katthaci dukassa pacchedo atthi indriyaviññāṇānaṃ viya manoviññāṇassapi visayassa bhinnattā. Na hi atītārammaṇaṃ viññāṇaṃ anāgatādiārammaṇaṃ hoti, anāgatārammaṇaṃ vā atītādiārammaṇaṃ, tasmā yathāladdhavisesena visiṭṭhesu manoviññāṇabhedesu tassa tassa visayassa ālambanānālambanavasena dukapadadvayappavatti na sakkā nivāretuṃ. Teneva ca aṭṭhakathāyaṃ ‘‘manoviññāṇena pana kenaci viññeyyañceva aviññeyyañcāti ayamattho atthi, tasmā so avuttopi yathālābhavasena veditabbo’’ti bhūmibhedavasena yathālābhaṃ dassessati. ‘‘Vavatthānābhāvato’’ti idampi anāmaṭṭhavisesaṃ manoviññāṇasāmaññameva gahetvā vuttaṃ. Pāḷi pana indriyaviññāṇehi nayadassanavasena āgatāti daṭṭhabbaṃ. Evañca katvā imissāpi atthavaṇṇanāya ‘‘kenacī’’ti padaṃ aniyamena sabbaviññāṇasaṅgāhakanti siddhaṃ hoti, niddesena ca na koci virodho. Cakkhuviññeyyanasotaviññeyyabhāvehi dukapadadvayappavatti dassitā, na pana cakkhuviññeyyācakkhuviññeyyabhāvehi visesakāraṇābhāvato. Kiñca ‘‘ye vā panā’’ti padantarasampiṇḍanatopi ‘‘ye te dhammā cakkhuviññeyyā…pe… na te dhammā cakkhuviññeyyā’’ti (dha. sa. 1101) ettāvatā dukapadadvayappavatti dassitāti viññāyati. Padantarabhāvadassanattho hi yevāpana-saddo yathā ‘‘ye keci kusalā dhammā, sabbe te kusalamūlā. Ye vā pana kusalamūlā, sabbe te dhammā kusalā’’tiādīsu (yama. 1.mūlayamaka.1). Aññathā ‘‘ye te dhammā cakkhuviññeyyā, na te dhammā sotaviññeyyā. Ye te dhammā sotaviññeyyā, na te dhammā cakkhuviññeyyā’’ti pāḷi abhavissa. Yaṃ pana vadanti ‘‘ye te dhammā cakkhuviññeyyā…pe… na te dhammā cakkhuviññeyyāti iminā atthato dve dukā vuttā hontī’’ti, tadapi cakkhuviññeyyācakkhuviññeyyataṃ sotaviññeyyāsotaviññeyyatañca sandhāya vuttaṃ, na pana ‘‘cakkhuviññeyyanasotaviññeyyataṃ sotaviññeyyanacakkhuviññeyyatañcā’’ti daṭṭhabbaṃ. Etena pāḷipaṭisedhanañca nivāritaṃ daṭṭhabbaṃ paṭisedhanasseva abhāvato. Tathā yassa ārammaṇassa vijānanabhāvena yo attho vuccamāno aniyamadassanatthaṃ ‘‘kenacī’’ti vutto, soyeva tato aññassa avijānanabhāvena vuccamāno aniyamadassanatthaṃ puna ‘‘kenacī’’ti vuttoti tadatthadassane tenevāti ayaṃ padattho na sambhavatīti na sakkā vattunti. Evamettha yathā aṭṭhakathā avaṭṭhitā, tathā attho yujjatīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14-19"
      },
      ". Santānassa ajaññamalīnabhāvakaraṇato kaṇhakammavipākahetuto ca aparisuddhattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘asucibhāvena sandantī’’"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti vaṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paggharaṇaka…pe… saddo"
      },
      "ti etena āsavo viya āsavoti ayampi attho dassitoti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gotrabhu…pe… vuttānī"
      },
      "ti etena gotrabhuggahaṇaṃ upalakkhaṇaṃ yathā ‘‘kākehi sappi rakkhitabba’’nti dasseti. Gotrabhusadisā gotrabhūti pana atthe sati guṇappadhānatthānaṃ ekena saddena avacanīyattā vodānādayova vuttā bhaveyyuṃ. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gotrabhū"
      },
      "ti ekasesena sāmaññena vā ayaṃ niddesoti veditabbaṃ. Abhividhivisayaṃ avadhinti vibhattiṃ pariṇāmetvā vattabbaṃ."
    ],
    "innerText": "14-19. Santānassa ajaññamalīnabhāvakaraṇato kaṇhakammavipākahetuto ca aparisuddhattā ‘‘asucibhāvena sandantī’’ti vuttaṃ. Tatthāti vaṇe. Paggharaṇaka…pe… saddoti etena āsavo viya āsavoti ayampi attho dassitoti daṭṭhabbaṃ. Gotrabhu…pe… vuttānīti etena gotrabhuggahaṇaṃ upalakkhaṇaṃ yathā ‘‘kākehi sappi rakkhitabba’’nti dasseti. Gotrabhusadisā gotrabhūti pana atthe sati guṇappadhānatthānaṃ ekena saddena avacanīyattā vodānādayova vuttā bhaveyyuṃ. Atha vā gotrabhūti ekasesena sāmaññena vā ayaṃ niddesoti veditabbaṃ. Abhividhivisayaṃ avadhinti vibhattiṃ pariṇāmetvā vattabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampayuttehi"
      },
      " āsavehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṃsahitatā"
      },
      " āsavasahitatā. Idaṃ vuttaṃ hoti – yathā sahetukānaṃ sampayuttehi hetūhi sahetukatā, na evaṃ sāsavāti vuttadhammānaṃ sampayuttehi āsavehi sāsavatā, atha kho vippayuttehīti. Dukantare avuttapadabhāvoyevettha dukayojanāya ñāyāgatatā. Yadi evaṃ hetugocchake kathanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘hetugocchake panā’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhame duke dutiyassa pakkhepe eko"
      },
      "ti catutthadukamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhame duke tatiyassa pakkhepe dve"
      },
      "ti ‘‘āsavā ceva dhammā āsavavippayuttā ca, āsavavippayuttā ceva dhammā no ca āsavā’’ti iminā saddhiṃ pañcamadukamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamassa dutiye duke pakkhepe eko"
      },
      "ti ‘‘no āsavā dhammā sāsavāpi anāsavāpī’’ti ayameko. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatiye paṭhamassa pakkhepe dve"
      },
      "ti ‘‘āsavā dhammā āsavasampayuttāpi ",
      " āsavavippayuttāpi, no āsavādhammā āsavasampayuttāpi āsavavippayuttāpī’’ti ime dve. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatiye dutiyassa pakkhepe eko"
      },
      "ti ‘‘sāsavā dhammā āsavasampayuttāpi āsavavippayuttāpī’’ti eko. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dutiye tatiyassa pakkhepe eko"
      },
      "ti chaṭṭhadukamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tīhī"
      },
      "ti catutthapañcamachaṭṭhehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itare"
      },
      "ti tadavasiṭṭhā pañca. Te pana paṭhame tatiyadukadutiyapadapakkhepe eko, dutiye paṭhamadukadutiyapadapakkhepe eko, tatiye paṭhamassa ekekapadapakkhepe dve, tatiye dutiyadukapaṭhamapadapakkhepe ekoti evaṃ veditabbā. ‘‘Sāsavā dhammā āsavāpi no āsavāpi. Āsavasampayuttā dhammā āsavāpi no āsavāpi. Āsavavippayuttā dhammā āsavāpi no āsavāpī’’ti etesampi, ‘‘āsavasahagatā dhammā no āsavasahagatā dhammā’’ti evamādīnañca aggahaṇe kāraṇaṃ gahaṇanayo ca pubbe vuttanayeneva veditabbaṃ."
    ],
    "innerText": "Sampayuttehi āsavehi taṃsahitatā āsavasahitatā. Idaṃ vuttaṃ hoti – yathā sahetukānaṃ sampayuttehi hetūhi sahetukatā, na evaṃ sāsavāti vuttadhammānaṃ sampayuttehi āsavehi sāsavatā, atha kho vippayuttehīti. Dukantare avuttapadabhāvoyevettha dukayojanāya ñāyāgatatā. Yadi evaṃ hetugocchake kathanti āha ‘‘hetugocchake panā’’tiādi. Paṭhame duke dutiyassa pakkhepe ekoti catutthadukamāha. Paṭhame duke tatiyassa pakkhepe dveti ‘‘āsavā ceva dhammā āsavavippayuttā ca, āsavavippayuttā ceva dhammā no ca āsavā’’ti iminā saddhiṃ pañcamadukamāha. Paṭhamassa dutiye duke pakkhepe ekoti ‘‘no āsavā dhammā sāsavāpi anāsavāpī’’ti ayameko. Tatiye paṭhamassa pakkhepe dveti ‘‘āsavā dhammā āsavasampayuttāpi āsavavippayuttāpi, no āsavādhammā āsavasampayuttāpi āsavavippayuttāpī’’ti ime dve. Tatiye dutiyassa pakkhepe ekoti ‘‘sāsavā dhammā āsavasampayuttāpi āsavavippayuttāpī’’ti eko. Dutiye tatiyassa pakkhepe ekoti chaṭṭhadukamāha. Tīhīti catutthapañcamachaṭṭhehi. Itareti tadavasiṭṭhā pañca. Te pana paṭhame tatiyadukadutiyapadapakkhepe eko, dutiye paṭhamadukadutiyapadapakkhepe eko, tatiye paṭhamassa ekekapadapakkhepe dve, tatiye dutiyadukapaṭhamapadapakkhepe ekoti evaṃ veditabbā. ‘‘Sāsavā dhammā āsavāpi no āsavāpi. Āsavasampayuttā dhammā āsavāpi no āsavāpi. Āsavavippayuttā dhammā āsavāpi no āsavāpī’’ti etesampi, ‘‘āsavasahagatā dhammā no āsavasahagatā dhammā’’ti evamādīnañca aggahaṇe kāraṇaṃ gahaṇanayo ca pubbe vuttanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Esa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nayo"
      },
      "ti yo esa paṭhamaduke dutiyadukapakkhepādiko upāyo idha āsavagocchake vutto, esa nayo saṃyojanagocchakādīsu dukantaraniddhāraṇeti attho. Tattha pāḷiyaṃ anāgatadukā saṃyojanagocchake tāva ‘‘saṃyojanā ceva dhammā saṃyojanavippayuttā ca, saṃyojanavippayuttā ceva dhammā no ca saṃyojanā, saṃyojanā dhammā saṃyojanasampayuttāpi saṃyojanavippayuttāpi, no saṃyojanā dhammā saṃyojanasampayuttāpi saṃyojanavippayuttāpi, no saṃyojanā dhammā saṃyojaniyāpi asaṃyojaniyāpi, saṃyojaniyā dhammā saṃyojanasampayuttāpi saṃyojanavippayuttāpī’’ti pañca. Evaṃ ganthaoghayogaupādānagocchakesu paccekaṃ pañca. Nīvaraṇagocchake pana nīvaraṇānaṃ nīvaraṇavippayuttabhāvābhāvato ‘‘no nīvaraṇā dhammā nīvaraṇiyāpi anīvaraṇiyāpi, no nīvaraṇā dhammā nīvaraṇasampayuttāpi nīvaraṇavippayuttāpi, nīvaraṇiyā dhammā nīvaraṇasampayuttāpi nīvaraṇavippayuttāpī’’ti tayo. Tathā parāmāsagocchake ‘‘no parāmāsā dhammā parāmaṭṭhāpi aparāmaṭṭhāpi, no parāmāsā dhammā parāmāsasampayuttāpi parāmāsavippayuttāpi, parāmaṭṭhā dhammā parāmāsasampayuttāpi parāmāsavippayuttāpī’’ti. Kilesagocchake ‘‘no kilesā dhammā saṃkilesikāpi asaṃkilesikāpi, no kilesā dhammā saṃkiliṭṭhāpi asaṃkiliṭṭhāpi, no kilesā dhammā kilesasampayuttāpi kilesavippayuttāpi, saṃkilesikā dhammā ",
      " saṃkiliṭṭhāpi asaṃkiliṭṭhāpi, saṃkilesikā dhammā kilesasampayuttāpi kilesavippayuttāpi, asaṃkiliṭṭhā dhammā saṃkilesikāpi asaṃkilesikāpī’’ti cha dukāti evaṃ veditabbā. Sesaṃ vuttanayameva."
    ],
    "innerText": "Esanayoti yo esa paṭhamaduke dutiyadukapakkhepādiko upāyo idha āsavagocchake vutto, esa nayo saṃyojanagocchakādīsu dukantaraniddhāraṇeti attho. Tattha pāḷiyaṃ anāgatadukā saṃyojanagocchake tāva ‘‘saṃyojanā ceva dhammā saṃyojanavippayuttā ca, saṃyojanavippayuttā ceva dhammā no ca saṃyojanā, saṃyojanā dhammā saṃyojanasampayuttāpi saṃyojanavippayuttāpi, no saṃyojanā dhammā saṃyojanasampayuttāpi saṃyojanavippayuttāpi, no saṃyojanā dhammā saṃyojaniyāpi asaṃyojaniyāpi, saṃyojaniyā dhammā saṃyojanasampayuttāpi saṃyojanavippayuttāpī’’ti pañca. Evaṃ ganthaoghayogaupādānagocchakesu paccekaṃ pañca. Nīvaraṇagocchake pana nīvaraṇānaṃ nīvaraṇavippayuttabhāvābhāvato ‘‘no nīvaraṇā dhammā nīvaraṇiyāpi anīvaraṇiyāpi, no nīvaraṇā dhammā nīvaraṇasampayuttāpi nīvaraṇavippayuttāpi, nīvaraṇiyā dhammā nīvaraṇasampayuttāpi nīvaraṇavippayuttāpī’’ti tayo. Tathā parāmāsagocchake ‘‘no parāmāsā dhammā parāmaṭṭhāpi aparāmaṭṭhāpi, no parāmāsā dhammā parāmāsasampayuttāpi parāmāsavippayuttāpi, parāmaṭṭhā dhammā parāmāsasampayuttāpi parāmāsavippayuttāpī’’ti. Kilesagocchake ‘‘no kilesā dhammā saṃkilesikāpi asaṃkilesikāpi, no kilesā dhammā saṃkiliṭṭhāpi asaṃkiliṭṭhāpi, no kilesā dhammā kilesasampayuttāpi kilesavippayuttāpi, saṃkilesikā dhammā saṃkiliṭṭhāpi asaṃkiliṭṭhāpi, saṃkilesikā dhammā kilesasampayuttāpi kilesavippayuttāpi, asaṃkiliṭṭhā dhammā saṃkilesikāpi asaṃkilesikāpī’’ti cha dukāti evaṃ veditabbā. Sesaṃ vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20-25"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccayabhāvenā"
      },
      "ti saṃyojanatthaṃ dasseti. Yathāsakaṃ paccayabhāvo eva hi kāmarāgādīnaṃ vaṭṭasaṃyojananti. Yadi evaṃ kathaṃ kāmarāgādīnaṃyeva saṃyojanabhāvoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘satipī’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññesa"
      },
      "nti saṃyojanehi aññesaṃ kilesābhisaṅkhārādīnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tappaccayabhāve"
      },
      "ti tesaṃ kilesakammavipākavaṭṭānaṃ paccayabhāve. Orambhāgiyuddhaṃbhāgiyabhāvena saṅgahitā paricchinnā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ora…pe… saṅgahitā,"
      },
      " tehi kāmarāgādīhi visesapaccayabhūtehi. Kāmakammabhavādīnaṃ kāmūpapattibhavādinipphādanepi niyamoti katvā āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘taṃtaṃ…pe… hotī’’"
      },
      "ti. Tena saṃyojanānaṃ bhāve yathāvuttaniyamānaṃ kammūpapattibhavānaṃ bhāvaṃ dassetvā tadabhāve abhāvaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na cā’’"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bandhanaṃ"
      },
      " aseribhāvakaraṇaṃ andubandhanādayo viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ganthakaraṇaṃ"
      },
      " avacchinnatākaraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkalakaṃ"
      },
      " pādapuñchanarajjumaṇḍalaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na codetabba"
      },
      "nti paññācakkhunā pacurajanassa passituṃ asakkuṇeyyattā yathāvuttavisesassa saddheyyataṃ āha. Tividho hi attho koci ",
      " paccakkhasiddho yo rūpādidhammānaṃ paccattavedanīyo aniddisitabbākāro, sabbadhammānaṃ sabhāvalakkhaṇanti vuttaṃ hoti. Koci anumānasiddho yo ghaṭādīsu paṭādīsu ca pasiddhena paccayāyattabhāvena ghaṭapaṭa-saddādīnaṃ aniccatādiākāro, koci okappanasiddho yo pacurajanassa accantamadiṭṭho saddhāvisayo sagganibbānādi. Tattha yassa satthuno vacanaṃ paccakkhasiddhe anumānasiddhe ca atthe na visaṃvādeti aviparītappavattiyā, tassa vacanena saddheyyatthasiddhīti tathārūpo ca bhagavāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dhammānaṃ sabhāva…pe… na codetabba’’"
      },
      "nti vuttaṃ. Esa nayo ito paresupi evarūpesu."
    ],
    "innerText": "20-25.Paccayabhāvenāti saṃyojanatthaṃ dasseti. Yathāsakaṃ paccayabhāvo eva hi kāmarāgādīnaṃ vaṭṭasaṃyojananti. Yadi evaṃ kathaṃ kāmarāgādīnaṃyeva saṃyojanabhāvoti āha ‘‘satipī’’tiādi. Aññesanti saṃyojanehi aññesaṃ kilesābhisaṅkhārādīnaṃ. Tappaccayabhāveti tesaṃ kilesakammavipākavaṭṭānaṃ paccayabhāve. Orambhāgiyuddhaṃbhāgiyabhāvena saṅgahitā paricchinnā ora…pe… saṅgahitā, tehi kāmarāgādīhi visesapaccayabhūtehi. Kāmakammabhavādīnaṃ kāmūpapattibhavādinipphādanepi niyamoti katvā āha ‘‘taṃtaṃ…pe… hotī’’ti. Tena saṃyojanānaṃ bhāve yathāvuttaniyamānaṃ kammūpapattibhavānaṃ bhāvaṃ dassetvā tadabhāve abhāvaṃ dassento ‘‘na cā’’tiādimāha. Bandhanaṃ aseribhāvakaraṇaṃ andubandhanādayo viya. Ganthakaraṇaṃ avacchinnatākaraṇaṃ. Cakkalakaṃ pādapuñchanarajjumaṇḍalaṃ. Na codetabbanti paññācakkhunā pacurajanassa passituṃ asakkuṇeyyattā yathāvuttavisesassa saddheyyataṃ āha. Tividho hi attho koci paccakkhasiddho yo rūpādidhammānaṃ paccattavedanīyo aniddisitabbākāro, sabbadhammānaṃ sabhāvalakkhaṇanti vuttaṃ hoti. Koci anumānasiddho yo ghaṭādīsu paṭādīsu ca pasiddhena paccayāyattabhāvena ghaṭapaṭa-saddādīnaṃ aniccatādiākāro, koci okappanasiddho yo pacurajanassa accantamadiṭṭho saddhāvisayo sagganibbānādi. Tattha yassa satthuno vacanaṃ paccakkhasiddhe anumānasiddhe ca atthe na visaṃvādeti aviparītappavattiyā, tassa vacanena saddheyyatthasiddhīti tathārūpo ca bhagavāti ‘‘dhammānaṃ sabhāva…pe… na codetabba’’nti vuttaṃ. Esa nayo ito paresupi evarūpesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26-37"
      },
      ". Yathā sarabhehi atikkamitabbā pabbatarāji sarabhaniyā, evaṃ oghaniyāti saddasiddhīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tenā’’"
      },
      "tiādi."
    ],
    "innerText": "26-37. Yathā sarabhehi atikkamitabbā pabbatarāji sarabhaniyā, evaṃ oghaniyāti saddasiddhīti āha ‘‘tenā’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50-54"
      },
      ". Vipariyesaggāho parāmasananti ‘‘parato’’ti ettha na dhammasabhāvato aññathāmattaṃ paranti adhippetaṃ, atha kho tabbipariyāyoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paratoti niccādito’’"
      },
      "ti."
    ],
    "innerText": "50-54. Vipariyesaggāho parāmasananti ‘‘parato’’ti ettha na dhammasabhāvato aññathāmattaṃ paranti adhippetaṃ, atha kho tabbipariyāyoti āha ‘‘paratoti niccādito’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "55-68"
      },
      ". Yadi ",
      " sabhāvato avijjamānaṃ, kathamārammaṇabhāvoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vicittasaññāya saññita’’"
      },
      "nti, parikappanāmattasiddhanti attho. Duviññeyyanānattatāya nirantarabhāvūpagamanaṃ saṃsaṭṭhabhāvoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘suviññeyyanānattattā na saṃsaṭṭhatā’’"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesaṃ"
      },
      " arūpakkhandhānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itarehi"
      },
      " rūpanibbānehi. Kiṃ pana kāraṇaṃ samānuppādanirodhānaṃ ekakalāpabhūtānaṃ arūpadhammānameva aññamaññaṃ saṃsaṭṭhatā vuccati, na pana tathābhūtānampi rūpadhammānanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘esa hi tesaṃ sabhāvo’’"
      },
      "ti. Tena yadipi keci arūpadhammā visuṃ ārammaṇaṃ honti, dandhappavattikattā pana rūpadhammānaṃyeva suviññeyyanānattaṃ, na arūpadhammānanti tesaṃ saṃsaṭṭhabhāvo tadabhāvo ca itaresaṃ sabhāvasiddhoti dasseti. Samūhaghanatāya vā dubbibhāgatarattā natthi arūpadhammānaṃ visuṃ ārammaṇabhāvoti duviññeyyanānattattā tesaṃyeva saṃsaṭṭhatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amuñcitvā"
      },
      " tadadhīnavuttitāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gahetabbato"
      },
      " buddhiyā."
    ],
    "innerText": "55-68. Yadi sabhāvato avijjamānaṃ, kathamārammaṇabhāvoti āha ‘‘vicittasaññāya saññita’’nti, parikappanāmattasiddhanti attho. Duviññeyyanānattatāya nirantarabhāvūpagamanaṃ saṃsaṭṭhabhāvoti ‘‘suviññeyyanānattattā na saṃsaṭṭhatā’’ti vuttaṃ. Tesaṃ arūpakkhandhānaṃ. Itarehi rūpanibbānehi. Kiṃ pana kāraṇaṃ samānuppādanirodhānaṃ ekakalāpabhūtānaṃ arūpadhammānameva aññamaññaṃ saṃsaṭṭhatā vuccati, na pana tathābhūtānampi rūpadhammānanti āha ‘‘esa hi tesaṃ sabhāvo’’ti. Tena yadipi keci arūpadhammā visuṃ ārammaṇaṃ honti, dandhappavattikattā pana rūpadhammānaṃyeva suviññeyyanānattaṃ, na arūpadhammānanti tesaṃ saṃsaṭṭhabhāvo tadabhāvo ca itaresaṃ sabhāvasiddhoti dasseti. Samūhaghanatāya vā dubbibhāgatarattā natthi arūpadhammānaṃ visuṃ ārammaṇabhāvoti duviññeyyanānattattā tesaṃyeva saṃsaṭṭhatā. Amuñcitvā tadadhīnavuttitāya gahetabbato buddhiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "83-100"
      },
      ". Kāmataṇhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmo"
      },
      " uttarapadalopena yathā rūpabhavo rūpaṃ. Evaṃ sesesupi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇakaraṇavasenā"
      },
      "ti etena kāmarūpārūpataṇhānaṃ visayabhāvo yathākkamaṃ kāmarūpārūpāvacaratāya kāraṇanti dasseti. Avassañcetamevaṃ sampaṭicchitabbaṃ, aññathā kāmāvacarādibhāvo ",
      " aparipuṇṇavisayo siyā. Yadi hi ālambitabbadhammavasena bhūmiparicchedo, evaṃ sati anārammaṇānaṃ saṅgaho na siyā. Atha vipākadānavasena, evampi avipākānaṃ saṅgaho na siyā, tasmā ārammaṇakaraṇavasena pariyāpannānaṃ bhūmiparicchedo kātabbo. Evañhi sati kāmāvacarādibhāvo paripuṇṇavisayo siyā. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evañhi satī’’"
      },
      "tiādi. Apariyāpannānaṃ pana lokato uttiṇṇabhāvena anuttarabhūmitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akāmāvacarāditā nāpajjatī"
      },
      "ti abyāpitadosaṃ pariharati, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmāvacarāditā nāpajjatī"
      },
      "ti atibyāpitadosaṃ. Nanu ca imasmiṃ pakkhe kāmataṇhā katamā, kāmāvacaradhammārammaṇā taṇhā, kāmāvacaradhammā katame, kāmataṇhāvisayāti itarītaranissayatā dosoti? Na, avīciādiekādasokāsaninnatāya kiñci taṇhaṃ kāmataṇhābhāvena gahetvā taṃsabhāvāya visayabhāvena kāmāvacaradhammānaṃ upalakkhetabbattā."
    ],
    "innerText": "83-100. Kāmataṇhā kāmo uttarapadalopena yathā rūpabhavo rūpaṃ. Evaṃ sesesupi. Ārammaṇakaraṇavasenāti etena kāmarūpārūpataṇhānaṃ visayabhāvo yathākkamaṃ kāmarūpārūpāvacaratāya kāraṇanti dasseti. Avassañcetamevaṃ sampaṭicchitabbaṃ, aññathā kāmāvacarādibhāvo aparipuṇṇavisayo siyā. Yadi hi ālambitabbadhammavasena bhūmiparicchedo, evaṃ sati anārammaṇānaṃ saṅgaho na siyā. Atha vipākadānavasena, evampi avipākānaṃ saṅgaho na siyā, tasmā ārammaṇakaraṇavasena pariyāpannānaṃ bhūmiparicchedo kātabbo. Evañhi sati kāmāvacarādibhāvo paripuṇṇavisayo siyā. Tenevāha ‘‘evañhi satī’’tiādi. Apariyāpannānaṃ pana lokato uttiṇṇabhāvena anuttarabhūmitā. Akāmāvacarāditā nāpajjatīti abyāpitadosaṃ pariharati, kāmāvacarāditā nāpajjatīti atibyāpitadosaṃ. Nanu ca imasmiṃ pakkhe kāmataṇhā katamā, kāmāvacaradhammārammaṇā taṇhā, kāmāvacaradhammā katame, kāmataṇhāvisayāti itarītaranissayatā dosoti? Na, avīciādiekādasokāsaninnatāya kiñci taṇhaṃ kāmataṇhābhāvena gahetvā taṃsabhāvāya visayabhāvena kāmāvacaradhammānaṃ upalakkhetabbattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni yathāvuttamatthaṃ pāṭhena samatthento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘nikkhepakaṇḍepī’’"
      },
      "tiādimāha. Tattha hi kāmataṇhāya ālambitabbattā kāmadhātupariyāpannadhammā ca kāmabhavasaṅkhāte ",
      " kāme ogāḷhā hutvā caranti, nāññatthāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "etthāvacarā"
      },
      "ti vuttanti. Visesatthinā viseso anupayujjatīti imamatthaṃ dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘lokassa vasena pariyāpannanicchayato’’"
      },
      "ti. Tena lokiyadhammesu pariyāpanna-saddassa niruḷhataṃ dasseti bhagavato taduccāraṇānantaraṃ vineyyānaṃ tadatthapaṭipattito. Paricchedakāpekkhā paricchinnatāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paricchedakārikāya taṇhāyā’’"
      },
      "ti vuttaṃ. Sā hi dhammānaṃ kāmāvacarādibhāvaṃ paricchindati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pari"
      },
      "-saddo cettha ‘‘upādinnā’’tiādīsu upa-saddo viya sasādhanaṃ kiriyaṃ dīpetīti ayamattho vuttoti daṭṭhabbaṃ."
    ],
    "innerText": "Idāni yathāvuttamatthaṃ pāṭhena samatthento ‘‘nikkhepakaṇḍepī’’tiādimāha. Tattha hi kāmataṇhāya ālambitabbattā kāmadhātupariyāpannadhammā ca kāmabhavasaṅkhāte kāme ogāḷhā hutvā caranti, nāññatthāti etthāvacarāti vuttanti. Visesatthinā viseso anupayujjatīti imamatthaṃ dassento āha ‘‘lokassa vasena pariyāpannanicchayato’’ti. Tena lokiyadhammesu pariyāpanna-saddassa niruḷhataṃ dasseti bhagavato taduccāraṇānantaraṃ vineyyānaṃ tadatthapaṭipattito. Paricchedakāpekkhā paricchinnatāti ‘‘paricchedakārikāya taṇhāyā’’ti vuttaṃ. Sā hi dhammānaṃ kāmāvacarādibhāvaṃ paricchindati. Pari-saddo cettha ‘‘upādinnā’’tiādīsu upa-saddo viya sasādhanaṃ kiriyaṃ dīpetīti ayamattho vuttoti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Niyyānakaraṇasīlā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niyyānikā"
      },
      " yathā ‘‘apūpabhakkhanasīlo āpūpiko’’ti, niyyānasīlā eva vā. Rāgadosamohāva gahitāti ñāyati, itarathā pahānekaṭṭhatāvacanaṃ nippayojanaṃ siyā. ‘‘Raṇohatā na jotanti, candasūriyā satārakā’’tiādīsu raṇa-saddassa reṇupariyāyatā daṭṭhabbā. Sampahārapariyāyattā yuddha-saddassa sampahāro ca paharitabbādhāroti akusalasenāva ‘‘saraṇā’’ti vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhādīna"
      },
      "nti phalabhūtānaṃ dukkhavighātaupāyāsapariḷāhānaṃ sabhāgabhūtāya ca micchāpaṭipadāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tannibbattakasabhāvānaṃ akusalāna"
      },
      "nti etena sabbesampi akusalānaṃ saraṇataṃ dasseti."
    ],
    "innerText": "Niyyānakaraṇasīlā niyyānikā yathā ‘‘apūpabhakkhanasīlo āpūpiko’’ti, niyyānasīlā eva vā. Rāgadosamohāva gahitāti ñāyati, itarathā pahānekaṭṭhatāvacanaṃ nippayojanaṃ siyā. ‘‘Raṇohatā na jotanti, candasūriyā satārakā’’tiādīsu raṇa-saddassa reṇupariyāyatā daṭṭhabbā. Sampahārapariyāyattā yuddha-saddassa sampahāro ca paharitabbādhāroti akusalasenāva ‘‘saraṇā’’ti vuttā. Dukkhādīnanti phalabhūtānaṃ dukkhavighātaupāyāsapariḷāhānaṃ sabhāgabhūtāya ca micchāpaṭipadāya. Tannibbattakasabhāvānaṃ akusalānanti etena sabbesampi akusalānaṃ saraṇataṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhidhammadukamātikāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Suttantikadukamātikāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "101-108"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijjāsabhāgatāya"
      },
      ", na saṅkappādayo viya vijjāya upakārakabhāvato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Abhejjaṃ…pe… ruhatī’’"
      },
      "ti ubhayampi anavasesappahānameva sandhāya vuttaṃ. Kiñcāpi hi heṭṭhimamaggehipi pahīyamānā kilesā tena tena odhinā anavasesameva pahīyanti, ye pana avasiṭṭhā bhinditabbā, te lobhādikilesabhāvasāmaññato puna viruḷhā viya honti. Arahattamagge pana uppanne na evaṃ avasiṭṭhābhāvato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadupacārena"
      },
      " nissayavohārena. Kusalehi tāpetabbāti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tapaniyā,"
      },
      " tadaṅgādivasena bādhitabbā pahātabbāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samānatthāni"
      },
      " adhivacanādīnaṃ saṅkhādibhāvato. ‘‘Sabbeva dhammā adhivacanapathā’’tiādinā adhivacanādīnaṃ visayabhāve na koci dhammo vajjito, vacanabhāvo eva ca ",
      " adhivacanādīnaṃ vakkhamānena nayena yujjatīti adhippāyenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sabbañca vacanaṃ adhivacanādibhāvaṃ bhajatī’’"
      },
      "ti."
    ],
    "innerText": "101-108.Vijjāsabhāgatāya, na saṅkappādayo viya vijjāya upakārakabhāvato. ‘‘Abhejjaṃ…pe… ruhatī’’ti ubhayampi anavasesappahānameva sandhāya vuttaṃ. Kiñcāpi hi heṭṭhimamaggehipi pahīyamānā kilesā tena tena odhinā anavasesameva pahīyanti, ye pana avasiṭṭhā bhinditabbā, te lobhādikilesabhāvasāmaññato puna viruḷhā viya honti. Arahattamagge pana uppanne na evaṃ avasiṭṭhābhāvato. Tadupacārena nissayavohārena. Kusalehi tāpetabbāti vā tapaniyā, tadaṅgādivasena bādhitabbā pahātabbāti attho. Samānatthāni adhivacanādīnaṃ saṅkhādibhāvato. ‘‘Sabbeva dhammā adhivacanapathā’’tiādinā adhivacanādīnaṃ visayabhāve na koci dhammo vajjito, vacanabhāvo eva ca adhivacanādīnaṃ vakkhamānena nayena yujjatīti adhippāyenāha ‘‘sabbañca vacanaṃ adhivacanādibhāvaṃ bhajatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "109-118"
      },
      ". Aññaṃ anapekkhitvā sayameva attano nāmakaraṇasabhāvo nāmakaraṇaṭṭhoti, tena arūpadhammānaṃ viya opapātikanāmatāya pathavīādīnampi nāmabhāvo siyāti āsaṅkāya nivattanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘nāmantarānāpajjanato’’"
      },
      "ti āha. Na hi vinā pathavīādināmenapi rūpadhammā viya kesādināmehi vinā vedanādināmehi aññena nāmena arūpadhammā piṇḍākārato voharīyantīti. Yaṃ pana parassa nāmaṃ karoti, tassa aññāpekkhaṃ nāmakaraṇanti nāmakaraṇasabhāvatā natthīti sāmaññanāmādikaraṇānaṃ nāmabhāvo nāpajjati. Yassa caññehi nāmaṃ karīyati, tassa nāmakaraṇasabhāvatāya abhāvoyevāti natthi nāmabhāvo. Ye pana anāpannanāmantarā sabhāvasiddhanāmā ca, te vedanādayova nāmaṃ nāmāti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘attanāvā’’"
      },
      "tiādimāha. Phassādīnaṃ ārammaṇābhimukhatā taṃ aggahetvā appavattiyevāti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘avinābhāvato’’"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhivacanasamphasso"
      },
      " manosamphasso, so nāmamantarena gahetuṃ asakkuṇeyyatāya pākaṭoti nidassanabhāvena vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ruppanasabhāvenā"
      },
      "ti nidassanamattaṃ daṭṭhabbaṃ. Pakāsakapakāsitabbabhāvenapi hi vināpi nāmena rūpadhammā pākaṭā hontīti. Atha vā pakāsakapakāsitabbabhāvo visayivisayabhāvo cakkhurūpādīnaṃ sabhāvo, so ruppanasabhāve sāmaññe antogadhoti daṭṭhabbaṃ."
    ],
    "innerText": "109-118. Aññaṃ anapekkhitvā sayameva attano nāmakaraṇasabhāvo nāmakaraṇaṭṭhoti, tena arūpadhammānaṃ viya opapātikanāmatāya pathavīādīnampi nāmabhāvo siyāti āsaṅkāya nivattanatthaṃ ‘‘nāmantarānāpajjanato’’ti āha. Na hi vinā pathavīādināmenapi rūpadhammā viya kesādināmehi vinā vedanādināmehi aññena nāmena arūpadhammā piṇḍākārato voharīyantīti. Yaṃ pana parassa nāmaṃ karoti, tassa aññāpekkhaṃ nāmakaraṇanti nāmakaraṇasabhāvatā natthīti sāmaññanāmādikaraṇānaṃ nāmabhāvo nāpajjati. Yassa caññehi nāmaṃ karīyati, tassa nāmakaraṇasabhāvatāya abhāvoyevāti natthi nāmabhāvo. Ye pana anāpannanāmantarā sabhāvasiddhanāmā ca, te vedanādayova nāmaṃ nāmāti dassento ‘‘attanāvā’’tiādimāha. Phassādīnaṃ ārammaṇābhimukhatā taṃ aggahetvā appavattiyevāti dassetuṃ ‘‘avinābhāvato’’ti vuttaṃ. Adhivacanasamphasso manosamphasso, so nāmamantarena gahetuṃ asakkuṇeyyatāya pākaṭoti nidassanabhāvena vutto. Ruppanasabhāvenāti nidassanamattaṃ daṭṭhabbaṃ. Pakāsakapakāsitabbabhāvenapi hi vināpi nāmena rūpadhammā pākaṭā hontīti. Atha vā pakāsakapakāsitabbabhāvo visayivisayabhāvo cakkhurūpādīnaṃ sabhāvo, so ruppanasabhāve sāmaññe antogadhoti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "119-123"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ito pubbe parikamma"
      },
      "ntiādinā samāpattivuṭṭhānakusalatā viya samāpattikusalatāpi ",
      " jhānalābhīnaṃyeva hotīti vuttaṃ viya dissati. ‘‘Itaresampi anussavavasena samāpattīnaṃ appanāparicchedapaññā labbhatī’’ti vadanti. ‘‘Evaṃ sīlavisodhanādinā samāpattiṃ appetīti jānanakapaññā saha parikammena appanāparicchedajānanakapaññā’’ti keci. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuṭṭhāne kusalabhāvo"
      },
      " vuṭṭhānavasitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbe"
      },
      "ti samāpajjanato pubbe."
    ],
    "innerText": "119-123.Ito pubbe parikammantiādinā samāpattivuṭṭhānakusalatā viya samāpattikusalatāpi jhānalābhīnaṃyeva hotīti vuttaṃ viya dissati. ‘‘Itaresampi anussavavasena samāpattīnaṃ appanāparicchedapaññā labbhatī’’ti vadanti. ‘‘Evaṃ sīlavisodhanādinā samāpattiṃ appetīti jānanakapaññā saha parikammena appanāparicchedajānanakapaññā’’ti keci. Vuṭṭhāne kusalabhāvo vuṭṭhānavasitā. Pubbeti samāpajjanato pubbe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "124-134"
      },
      ". Sobhane rato surato, tassa bhāvo soraccanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sobhanakammaratatā’’"
      },
      "ti. Suṭṭhu vā orato virato sorato ",
      ", tassa bhāvo soraccanti. Ayaṃ panattho aṭṭhakathāyaṃ vutto eva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaṭisaṅkhānaṃ"
      },
      " moho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalabhāvanā"
      },
      " bodhipakkhiyadhammānaṃ vaḍḍhanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saññāṇaṃ"
      },
      " upalakkhaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saviggahaṃ"
      },
      " sabimbakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upalakkhetabbākāraṃ"
      },
      " dhammajātaṃ, ārammaṇaṃ vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avikkhepo"
      },
      "ti cittavikkhepapaṭipakkho. Ujuvipaccanīkatāya hi pahānavuṭṭhānena ca avikkhepo vikkhepaṃ paṭikkhipati, pavattituṃ na detīti."
    ],
    "innerText": "124-134. Sobhane rato surato, tassa bhāvo soraccanti āha ‘‘sobhanakammaratatā’’ti. Suṭṭhu vā orato virato sorato , tassa bhāvo soraccanti. Ayaṃ panattho aṭṭhakathāyaṃ vutto eva. Appaṭisaṅkhānaṃ moho. Kusalabhāvanā bodhipakkhiyadhammānaṃ vaḍḍhanā. Saññāṇaṃ upalakkhaṇaṃ. Saviggahaṃ sabimbakaṃ. Upalakkhetabbākāraṃ dhammajātaṃ, ārammaṇaṃ vā. Avikkhepoti cittavikkhepapaṭipakkho. Ujuvipaccanīkatāya hi pahānavuṭṭhānena ca avikkhepo vikkhepaṃ paṭikkhipati, pavattituṃ na detīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "135-142"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāraṇasīlaṃ"
      },
      " lokiyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phalasīlaṃ"
      },
      " lokuttaraṃ tena sijjhatīti katvā, lokiyassapi vā sīlassa kāraṇaphalabhāvo pubbāparabhāvena daṭṭhabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampannasamudāyassa"
      },
      " paripuṇṇasamūhassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akusalā sīlā"
      },
      " akusalā samācārā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlasampadā"
      },
      " sīlasampatti sīlaguṇāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahottappaṃ ñāṇa"
      },
      "nti ottappassa ñāṇappadhānataṃ āha, na pana ñāṇassa ottappasahitatāmattaṃ. Na hi ottapparahitaṃ ñāṇaṃ atthīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhimuttatā"
      },
      " abhirativasena nirāsaṅkāpavatti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nissaṭatā"
      },
      " visaṃyuttatā. Ettha ca adhimuttatānissaṭatāvacanehi tadubhayapariyāyā dve vimuttiyo ekasesanayena idha ‘‘vimuttī’’ti vuttāti dasseti. Tathā hi vuttaṃ ‘‘cittassa ca adhimutti nibbānañcā’’ti. Uppajjati etenāti uppādo, na uppādoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anuppādo,"
      },
      " tabbhūte anuppādapariyosāne vimokkhante anuppādassa ariyamaggassa kilesānaṃ vā anuppajjanassa pariyosāneti ṭhānaphalehi ariyaphalameva upalakkhīyatīti daṭṭhabbaṃ."
    ],
    "innerText": "135-142.Kāraṇasīlaṃ lokiyaṃ. Phalasīlaṃ lokuttaraṃ tena sijjhatīti katvā, lokiyassapi vā sīlassa kāraṇaphalabhāvo pubbāparabhāvena daṭṭhabbo. Sampannasamudāyassa paripuṇṇasamūhassa. Akusalā sīlā akusalā samācārā. Sīlasampadā sīlasampatti sīlaguṇāti attho. Sahottappaṃ ñāṇanti ottappassa ñāṇappadhānataṃ āha, na pana ñāṇassa ottappasahitatāmattaṃ. Na hi ottapparahitaṃ ñāṇaṃ atthīti. Adhimuttatā abhirativasena nirāsaṅkāpavatti. Nissaṭatā visaṃyuttatā. Ettha ca adhimuttatānissaṭatāvacanehi tadubhayapariyāyā dve vimuttiyo ekasesanayena idha ‘‘vimuttī’’ti vuttāti dasseti. Tathā hi vuttaṃ ‘‘cittassa ca adhimutti nibbānañcā’’ti. Uppajjati etenāti uppādo, na uppādoti anuppādo, tabbhūte anuppādapariyosāne vimokkhante anuppādassa ariyamaggassa kilesānaṃ vā anuppajjanassa pariyosāneti ṭhānaphalehi ariyaphalameva upalakkhīyatīti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mātikāpadavaṇṇanā niṭṭhitā."
  }
]