[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "11. Maggaṅgavibhaṅgo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Suttantabhājanīyavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "486"
      },
      ". Idāni ",
      " tadanantare maggavibhaṅge ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyo aṭṭhaṅgiko maggo"
      },
      "tiādi sabbaṃ saccavibhaṅge dukkhanirodhagāminīpaṭipadāniddese vuttanayeneva veditabbaṃ. Bhāvanāvasena pāṭiyekkaṃ dassite dutiyanayepi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammādiṭṭhiṃ bhāveti vivekanissita"
      },
      "ntiādi sabbaṃ bojjhaṅgavibhaṅge vuttanayeneva veditabbaṃ. Evamidaṃ dvinnampi nayānaṃ vasena suttantabhājanīyaṃ lokiyalokuttaramissakameva kathitaṃ."
    ],
    "innerText": "486. Idāni tadanantare maggavibhaṅge ariyo aṭṭhaṅgiko maggotiādi sabbaṃ saccavibhaṅge dukkhanirodhagāminīpaṭipadāniddese vuttanayeneva veditabbaṃ. Bhāvanāvasena pāṭiyekkaṃ dassite dutiyanayepi sammādiṭṭhiṃ bhāveti vivekanissitantiādi sabbaṃ bojjhaṅgavibhaṅge vuttanayeneva veditabbaṃ. Evamidaṃ dvinnampi nayānaṃ vasena suttantabhājanīyaṃ lokiyalokuttaramissakameva kathitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Abhidhammabhājanīyavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "490"
      },
      ". Abhidhammabhājanīye ‘ariyo’ti avatvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhaṅgiko maggo"
      },
      "ti vuttaṃ. Evaṃ avuttepi ayaṃ ariyo eva. Yathā hi muddhābhisittassa rañño muddhābhisittāya deviyā kucchismiṃ jāto putto rājaputtoti avuttepi rājaputtoyeva hoti, evamayampi ariyoti avuttepi ariyo evāti veditabbo. Sesamidhāpi saccavibhaṅge vuttanayeneva veditabbaṃ."
    ],
    "innerText": "490. Abhidhammabhājanīye ‘ariyo’ti avatvā aṭṭhaṅgiko maggoti vuttaṃ. Evaṃ avuttepi ayaṃ ariyo eva. Yathā hi muddhābhisittassa rañño muddhābhisittāya deviyā kucchismiṃ jāto putto rājaputtoti avuttepi rājaputtoyeva hoti, evamayampi ariyoti avuttepi ariyo evāti veditabbo. Sesamidhāpi saccavibhaṅge vuttanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "493"
      },
      ". Pañcaṅgikavārepi aṭṭhaṅgikoti avuttepi aṭṭhaṅgiko eva veditabbo. Lokuttaramaggo hi pañcaṅgiko nāma natthi. Ayamettha ācariyānaṃ samānatthakathā. Vitaṇḍavādī panāha – ‘‘lokuttaramaggo aṭṭhaṅgiko nāma natthi, pañcaṅgikoyeva hotī’’ti. So ‘‘suttaṃ āharāhī’’ti vutto addhā aññaṃ apassanto imaṃ mahāsaḷāyatanato suttappadesaṃ āharissati ‘‘yā tathābhūtassa diṭṭhi, sāssa hoti sammādiṭṭhi. Yo tathābhūtassa saṅkappo, vāyāmo, sati, yo ",
      " tathābhūtassa samādhi, svāssa hoti sammāsamādhi. Pubbeva kho panassa kāyakammaṃ vacīkammaṃ ājīvo suparisuddho hotī’’ti."
    ],
    "innerText": "493. Pañcaṅgikavārepi aṭṭhaṅgikoti avuttepi aṭṭhaṅgiko eva veditabbo. Lokuttaramaggo hi pañcaṅgiko nāma natthi. Ayamettha ācariyānaṃ samānatthakathā. Vitaṇḍavādī panāha – ‘‘lokuttaramaggo aṭṭhaṅgiko nāma natthi, pañcaṅgikoyeva hotī’’ti. So ‘‘suttaṃ āharāhī’’ti vutto addhā aññaṃ apassanto imaṃ mahāsaḷāyatanato suttappadesaṃ āharissati ‘‘yā tathābhūtassa diṭṭhi, sāssa hoti sammādiṭṭhi. Yo tathābhūtassa saṅkappo, vāyāmo, sati, yo tathābhūtassa samādhi, svāssa hoti sammāsamādhi. Pubbeva kho panassa kāyakammaṃ vacīkammaṃ ājīvo suparisuddho hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato ‘‘etassa anantaraṃ suttapadaṃ āharā’’ti vattabbo. Sace āharati iccetaṃ kusalaṃ, no ce āharati sayaṃ āharitvā ‘‘evamassāyaṃ ariyo aṭṭhaṅgiko maggo bhāvanāpāripūriṃ gacchatī’’ti (ma. ni. 3.431) ‘‘iminā ",
      " te satthusāsanena vādo bhinno; lokuttaramaggo pañcaṅgiko nāma natthi, aṭṭhaṅgikova hotī’’ti vattabbo."
    ],
    "innerText": "Tato ‘‘etassa anantaraṃ suttapadaṃ āharā’’ti vattabbo. Sace āharati iccetaṃ kusalaṃ, no ce āharati sayaṃ āharitvā ‘‘evamassāyaṃ ariyo aṭṭhaṅgiko maggo bhāvanāpāripūriṃ gacchatī’’ti (ma. ni. 3.431) ‘‘iminā te satthusāsanena vādo bhinno; lokuttaramaggo pañcaṅgiko nāma natthi, aṭṭhaṅgikova hotī’’ti vattabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Imāni pana tīṇi aṅgāni pubbe parisuddhāni vattanti, lokuttaramaggakkhaṇe parisuddhatarāni honti. Atha ‘pañcaṅgiko maggo’ti idaṃ kimatthaṃ gahitanti? Atirekakiccadassanatthaṃ. Yasmiñhi samaye micchāvācaṃ pajahati, sammāvācaṃ pūreti, tasmiṃ samaye sammākammantasammāājīvā natthi. Imāni pañcakārāpakaṅgāneva micchāvācaṃ pajahanti; sammāvācā pana sayaṃ virativasena pūreti. Yasmiṃ samaye micchākammantaṃ pajahati, sammākammantaṃ pūreti, tasmiṃ samaye sammāvācāsammāājīvā natthi. Imāni pañca kārāpakaṅgāneva micchākammantaṃ pajahanti; sammākammanto pana sayaṃ virativasena pūreti. Yasmiṃ samaye micchāājīvaṃ pajahati, sammāājīvaṃ pūreti, tasmiṃ samaye sammāvācāsammākammantā natthi. Imāni pañca kārāpakaṅgāneva micchāājīvaṃ pajahanti; sammāājīvo pana sayaṃ virativasena pūreti. Imaṃ etesaṃ pañcannaṃ kārāpakaṅgānaṃ kiccātirekataṃ dassetuṃ pañcaṅgiko maggoti gahitaṃ. Lokuttaramaggo pana aṭṭhaṅgikova hoti, pañcaṅgiko nāma natthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yadi sammāvācādīhi saddhiṃ aṭṭhaṅgikoti vadatha, catasso sammāvācācetanā, tisso sammākammantacetanā, satta sammāājīvacetanāti imamhā cetanābahuttā kathaṃ muccissatha? Tasmā pañcaṅgikova lokuttaramaggo’’ti. ‘‘Cetanābahuttā ca pamuccissāma; aṭṭhaṅgikova lokuttaramaggoti ca vakkhāma’’. ‘‘Tvaṃ tāva mahācattārīsakabhāṇako hosi, na hosī’’ti pucchitabbo. Sace ‘‘na homī’’ti vadati, ‘‘tvaṃ abhāṇakattā na jānāsī’’ti vattabbo. Sace ‘‘bhāṇakosmī’’ti vadati, ‘‘suttaṃ āharā’’ti vattabbo. Sace suttaṃ āharati iccetaṃ kusalaṃ, no ce āharati sayaṃ uparipaṇṇāsato āharitabbaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Katamā ",
      " ca, bhikkhave, sammāvācā? Sammāvācaṃpahaṃ, bhikkhave, dvāyaṃ vadāmi – atthi, bhikkhave, sammāvācā sāsavā puññabhāgiyā upadhivepakkā; atthi, bhikkhave, sammāvācā ariyā anāsavā lokuttarā maggaṅgā."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, sammāvācā? Sammāvācaṃpahaṃ, bhikkhave, dvāyaṃ vadāmi – atthi, bhikkhave, sammāvācā sāsavā puññabhāgiyā upadhivepakkā; atthi, bhikkhave, sammāvācā ariyā anāsavā lokuttarā maggaṅgā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Katamā ca, bhikkhave, sammāvācā sāsavā ",
      " puññabhāgiyā upadhivepakkā? Musāvādā veramaṇī, pisuṇāya vācāya veramaṇī, pharusāya ",
      " vācāya veramaṇī, samphappalāpā veramaṇī – ayaṃ, bhikkhave, sammāvācā sāsavā puññabhāgiyā upadhivepakkā."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, sammāvācā sāsavā puññabhāgiyā upadhivepakkā? Musāvādā veramaṇī, pisuṇāya vācāya veramaṇī, pharusāya vācāya veramaṇī, samphappalāpā veramaṇī – ayaṃ, bhikkhave, sammāvācā sāsavā puññabhāgiyā upadhivepakkā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, sammāvācā ariyā anāsavā lokuttarā maggaṅgā? Yā kho, bhikkhave, ariyacittassa anāsavacittassa ariyamaggasamaṅgino ariyamaggaṃ bhāvayato catūhi vacīduccaritehi ārati virati paṭivirati veramaṇī – ayaṃ, bhikkhave, sammāvācā ariyā anāsavā lokuttarā maggaṅgā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, sammākammanto? Sammākammantaṃpahaṃ, bhikkhave, dvayaṃ vadāmi…pe… upadhivepakko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, sammākammanto ariyo anāsavo lokuttaro…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, sammāājīvo? Sammāājīvaṃpahaṃ, bhikkhave, dvāyaṃ vadāmi…pe… upadhivepakko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, sammāājīvo ariyo anāsavo lokuttaro maggaṅgo? Yā kho, bhikkhave, ariyacittassa anāsavacittassa ariyamaggasamaṅgino ariyamaggaṃ bhāvayato micchāājīvā ārati virati paṭivirati veramaṇī – ayaṃ, bhikkhave, sammāājīvo ariyo anāsavo lokuttaro maggaṅgo’’ti (ma. ni. 3.138 ādayo)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evamettha ",
      " catūhi vacīduccaritehi, tīhi kāyaduccaritehi, micchājīvato cāti ekekāva virati ariyā anāsavā lokuttarā maggaṅgāti vuttā. ‘‘Kuto ettha cetanābahuttaṃ? Kuto pañcaṅgiko maggo? Idaṃ te suttaṃ akāmakassa lokuttaramaggo aṭṭhaṅgikoti dīpeti’’. Sace ettakena sallakkheti iccetaṃ kusalaṃ, no ce sallakkheti aññānipi kāraṇāni āharitvā saññāpetabbo. Vuttañhetaṃ bhagavatā –"
    ],
    "innerText": "Evamettha catūhi vacīduccaritehi, tīhi kāyaduccaritehi, micchājīvato cāti ekekāva virati ariyā anāsavā lokuttarā maggaṅgāti vuttā. ‘‘Kuto ettha cetanābahuttaṃ? Kuto pañcaṅgiko maggo? Idaṃ te suttaṃ akāmakassa lokuttaramaggo aṭṭhaṅgikoti dīpeti’’. Sace ettakena sallakkheti iccetaṃ kusalaṃ, no ce sallakkheti aññānipi kāraṇāni āharitvā saññāpetabbo. Vuttañhetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Yasmiṃ kho, subhadda, dhammavinaye ariyo aṭṭhaṅgiko maggo na upalabbhati, samaṇopi tattha na upalabbhati…pe… imasmiṃ kho, subhadda, dhammavinaye ariyo aṭṭhaṅgiko maggo upalabbhati; idheva ",
      ", subhadda, samaṇo…pe… suññā parappavādā samaṇehi aññehīti (dī. ni. 2.214)."
    ],
    "innerText": "‘‘Yasmiṃ kho, subhadda, dhammavinaye ariyo aṭṭhaṅgiko maggo na upalabbhati, samaṇopi tattha na upalabbhati…pe… imasmiṃ kho, subhadda, dhammavinaye ariyo aṭṭhaṅgiko maggo upalabbhati; idheva , subhadda, samaṇo…pe… suññā parappavādā samaṇehi aññehīti (dī. ni. 2.214)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Aññesupi anekesu suttasatesu aṭṭhaṅgikova maggo āgato. Kathāvatthuppakaraṇepi vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Maggānaṃ aṭṭhaṅgiko seṭṭho, saccānaṃ caturo padā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Virāgo seṭṭho dhammānaṃ, dvipadānañca cakkhumā’’ti (kathā. 872) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Attheva ",
      " suttantoti’’? ‘‘Āmantā’’‘‘tena hi aṭṭhaṅgiko maggo’’ti. Sace pana ettakenāpi saññattiṃ na gacchati, ‘‘gaccha, vihāraṃ pavisitvā yāguṃ pivāhī’’ti uyyojetabbo. Uttarimpana kāraṇaṃ vakkhatīti aṭṭhānametaṃ. Sesamettha uttānatthameva."
    ],
    "innerText": "‘‘Attheva suttantoti’’? ‘‘Āmantā’’‘‘tena hi aṭṭhaṅgiko maggo’’ti. Sace pana ettakenāpi saññattiṃ na gacchati, ‘‘gaccha, vihāraṃ pavisitvā yāguṃ pivāhī’’ti uyyojetabbo. Uttarimpana kāraṇaṃ vakkhatīti aṭṭhānametaṃ. Sesamettha uttānatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nayā panettha gaṇetabbā. Aṭṭhaṅgikamaggasmiñhi ekato pucchitvā ekato vissajjane catūsu maggesu cattāri nayasahassāni vibhattāni. Pañcaṅgikamagge ekato pucchitvā ekato vissajjane cattāri; pāṭiyekkaṃ pucchitvā pāṭiyekkaṃ vissajjane cattāri cattārīti pañcasu aṅgesu vīsati. Iti purimāni aṭṭha imāni ca vīsatīti sabbānipi maggavibhaṅge aṭṭhavīsati nayasahassāni vibhattāni. Tāni ca kho nibbattitalokuttarāni kusalāneva. Vipāke pana kusalato tiguṇā nayā kātabbāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhidhammabhājanīyavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Pañhāpucchakavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "504"
      },
      ". Pañhāpucchake ",
      " pāḷianusāreneva maggaṅgānaṃ kusalādibhāvo veditabbo. Ārammaṇattikesu pana sabbānipetāni appamāṇaṃ nibbānaṃ ārabbha pavattito appamāṇārammaṇāneva, na maggārammaṇāni. Neva hi maggo na phalaṃ maggaṃ ārammaṇaṃ karoti. Sahajātahetuvasena panettha kusalāni maggahetukāni; vīriyaṃ vā vīmaṃsaṃ vā jeṭṭhakaṃ katvā maggabhāvanākāle maggādhipatīni; chandacittajeṭṭhikāya maggabhāvanāya na vattabbāni maggādhipatīnīti; phalakālepi na vattabbāneva."
    ],
    "innerText": "504. Pañhāpucchake pāḷianusāreneva maggaṅgānaṃ kusalādibhāvo veditabbo. Ārammaṇattikesu pana sabbānipetāni appamāṇaṃ nibbānaṃ ārabbha pavattito appamāṇārammaṇāneva, na maggārammaṇāni. Neva hi maggo na phalaṃ maggaṃ ārammaṇaṃ karoti. Sahajātahetuvasena panettha kusalāni maggahetukāni; vīriyaṃ vā vīmaṃsaṃ vā jeṭṭhakaṃ katvā maggabhāvanākāle maggādhipatīni; chandacittajeṭṭhikāya maggabhāvanāya na vattabbāni maggādhipatīnīti; phalakālepi na vattabbāneva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atītādīsu ",
      " ekārammaṇabhāvenapi na vattabbāni; nibbānassa pana bahiddhādhammattā bahiddhārammaṇāni nāma hontīti evametasmiṃ pañhāpucchakepi nibbattitalokuttarāneva maggaṅgāni kathitāni. Sammāsambuddhena hi suttantabhājanīyasmiṃyeva lokiyalokuttarāni maggaṅgāni kathitāni; abhidhammabhājanīye pana pañhāpucchake ca lokuttarānevāti evamayaṃ maggavibhaṅgopi teparivaṭṭaṃ nīharitvāva bhājetvā dassitoti."
    ],
    "innerText": "Atītādīsu ekārammaṇabhāvenapi na vattabbāni; nibbānassa pana bahiddhādhammattā bahiddhārammaṇāni nāma hontīti evametasmiṃ pañhāpucchakepi nibbattitalokuttarāneva maggaṅgāni kathitāni. Sammāsambuddhena hi suttantabhājanīyasmiṃyeva lokiyalokuttarāni maggaṅgāni kathitāni; abhidhammabhājanīye pana pañhāpucchake ca lokuttarānevāti evamayaṃ maggavibhaṅgopi teparivaṭṭaṃ nīharitvāva bhājetvā dassitoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sammohavinodaniyā vibhaṅgaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Maggaṅgavibhaṅgavaṇṇanā niṭṭhitā."
  }
]