[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "6. Saṅkhārayamakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Paṇṇattivāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Idāni ",
      " tesaññeva mūlayamake desitānaṃ kusalādidhammānaṃ labbhamānavasena ekadesaṃ saṅgaṇhitvā saccayamakānantaraṃ desitassa saṅkhārayamakassa vaṇṇanā hoti. Tatthāpi heṭṭhā vuttanayeneva paṇṇattivārādayo tayo mahāvārā, antaravārādayo ca avasesapabhedā veditabbā. Ayaṃ panettha viseso – paṇṇattivāre tāva yathā heṭṭhā khandhādayo dhamme uddisitvā ‘‘rūpaṃ rūpakkhandho; cakkhu cakkhāyatanaṃ; cakkhu cakkhudhātu; dukkhaṃ dukkhasacca’’nti padasodhanavāro āraddho. Tathā anārabhitvā ‘‘assāsapassāsā kāyasaṅkhāro’’ti paṭhamaṃ tayopi saṅkhārā vibhajitvā dassitā."
    ],
    "innerText": "1. Idāni tesaññeva mūlayamake desitānaṃ kusalādidhammānaṃ labbhamānavasena ekadesaṃ saṅgaṇhitvā saccayamakānantaraṃ desitassa saṅkhārayamakassa vaṇṇanā hoti. Tatthāpi heṭṭhā vuttanayeneva paṇṇattivārādayo tayo mahāvārā, antaravārādayo ca avasesapabhedā veditabbā. Ayaṃ panettha viseso – paṇṇattivāre tāva yathā heṭṭhā khandhādayo dhamme uddisitvā ‘‘rūpaṃ rūpakkhandho; cakkhu cakkhāyatanaṃ; cakkhu cakkhudhātu; dukkhaṃ dukkhasacca’’nti padasodhanavāro āraddho. Tathā anārabhitvā ‘‘assāsapassāsā kāyasaṅkhāro’’ti paṭhamaṃ tayopi saṅkhārā vibhajitvā dassitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " kāyassa saṅkhāro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyasaṅkhāro"
      },
      ". ‘‘Assāsapassāsā kāyikā, ete dhammā kāyappaṭibaddhā’’ti (ma. ni. 1.463; saṃ. ni. 4.348 atthato samānaṃ) hi vacanato kāraṇabhūtassa karajakāyassa phalabhūto eva saṅkhāroti kāyasaṅkhāro. Aparo nayo – saṅkhariyatīti saṅkhāro. Kena saṅkhariyatīti? Kāyena. Ayañhi vāto viya bhastāya karajakāyena ",
      " saṅkhariyatīti. Evampi kāyassa saṅkhāroti kāyasaṅkhāro. Kāyena kato assāsapassāsavātoti attho. ‘‘Pubbeva kho, āvuso visākha, vitakketvā vicāretvā pacchā vācaṃ bhindati, tasmā vitakkavicārā vacīsaṅkhāro’’ti (ma. ni. 1.463; saṃ. ni. 4.348) vacanato pana saṅkharotīti saṅkhāro. Kiṃ saṅkharoti? Vaciṃ. Vaciyā saṅkhāroti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vacīsaṅkhāro"
      },
      ". Vacībhedasamuṭṭhāpakassa vitakkavicāradvayassetaṃ nāmaṃ. ‘‘Saññā ca vedanā ca cetasikā ete dhammā cittapaṭibaddhā’’ti (ma. ni. 1.463; saṃ. ni. 4.348) vacanatoyeva pana tatiyapadepi saṅkhariyatīti saṅkhāro. Kena saṅkhariyati? Cittena. Karaṇatthe sāmivacanaṃ katvā cittassa saṅkhāroti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cittasaṅkhāro"
      },
      ". Sabbesampi cittasamuṭṭhānānaṃ cetasikadhammānametaṃ adhivacanaṃ. Vitakkavicārānaṃ pana vacīsaṅkhārabhāvena visuṃ gahitattā ‘‘ṭhapetvā vitakkavicāre’’ti vuttaṃ."
    ],
    "innerText": "Tattha kāyassa saṅkhāro kāyasaṅkhāro. ‘‘Assāsapassāsā kāyikā, ete dhammā kāyappaṭibaddhā’’ti (ma. ni. 1.463; saṃ. ni. 4.348 atthato samānaṃ) hi vacanato kāraṇabhūtassa karajakāyassa phalabhūto eva saṅkhāroti kāyasaṅkhāro. Aparo nayo – saṅkhariyatīti saṅkhāro. Kena saṅkhariyatīti? Kāyena. Ayañhi vāto viya bhastāya karajakāyena saṅkhariyatīti. Evampi kāyassa saṅkhāroti kāyasaṅkhāro. Kāyena kato assāsapassāsavātoti attho. ‘‘Pubbeva kho, āvuso visākha, vitakketvā vicāretvā pacchā vācaṃ bhindati, tasmā vitakkavicārā vacīsaṅkhāro’’ti (ma. ni. 1.463; saṃ. ni. 4.348) vacanato pana saṅkharotīti saṅkhāro. Kiṃ saṅkharoti? Vaciṃ. Vaciyā saṅkhāroti vacīsaṅkhāro. Vacībhedasamuṭṭhāpakassa vitakkavicāradvayassetaṃ nāmaṃ. ‘‘Saññā ca vedanā ca cetasikā ete dhammā cittapaṭibaddhā’’ti (ma. ni. 1.463; saṃ. ni. 4.348) vacanatoyeva pana tatiyapadepi saṅkhariyatīti saṅkhāro. Kena saṅkhariyati? Cittena. Karaṇatthe sāmivacanaṃ katvā cittassa saṅkhāroti cittasaṅkhāro. Sabbesampi cittasamuṭṭhānānaṃ cetasikadhammānametaṃ adhivacanaṃ. Vitakkavicārānaṃ pana vacīsaṅkhārabhāvena visuṃ gahitattā ‘‘ṭhapetvā vitakkavicāre’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2-7"
      },
      ". Idāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyo kāyasaṅkhāro"
      },
      "ti padasodhanavāro āraddho. Tassa anulomanaye tīṇi, paṭilomanaye tīṇīti cha yamakāni. Padasodhanamūlacakkavāre ekekasaṅkhāramūlakāni dve dve katvā anulomanaye cha, paṭilomanaye chāti dvādasa yamakāni. Suddhasaṅkhāravāre pana yathā suddhakhandhavārādīsu ‘‘rūpaṃ khandho, khandhā rūpaṃ; cakkhu āyatanaṃ, āyatanā cakkhū’’tiādinā nayena yamakāni vuttāni. Evaṃ ‘‘kāyo saṅkhāro, saṅkhārā kāyo’’ti avatvā ‘‘kāyasaṅkhāro vacīsaṅkhāro, vacīsaṅkhāro kāyasaṅkhāro’’tiādinā nayena kāyasaṅkhāramūlakāni dve, vacīsaṅkhāramūlakaṃ ekanti anulome tīṇi, paṭilome tīṇīti sabbānipi suddhikavāre cha yamakāni vuttāni. Kiṃ kāraṇā? Suddhikaekekapadavasena atthābhāvato. Yathā hi khandhayamakādīsu rūpādivisiṭṭhānaṃ khandhānaṃ cakkhādivisiṭṭhānañca āyatanādīnaṃ adhippetattā ‘‘rūpaṃ khandho ",
      ", khandhā rūpaṃ, cakkhu āyatanaṃ, āyatanā cakkhū’’ti suddhikaekekapadavasena attho atthi. Evamidha ‘‘kāyo saṅkhāro, saṅkhārā kāyo’’ti natthi. Kāyasaṅkhāroti pana dvīhipi padehi ekova attho labbhati. Assāso vā passāso vāti suddhikaekekapadavasena atthābhāvato ‘‘kāyo saṅkhāro, saṅkhārā kāyo’’ti na vuttaṃ. ‘‘Kāyo kāyasaṅkhāro’’tiādi pana vattabbaṃ siyā. Tampi kāyavacīcittapadehi idha adhippetānaṃ saṅkhārānaṃ aggahitattā na yujjati. Suddhasaṅkhāravāro hesa. Padasodhane pana vināpi atthena vacanaṃ yujjatīti tattha so nayo gahitova. Idha pana kāyasaṅkhārassa vacīsaṅkhārādīhi, vacīsaṅkhārassa ca cittasaṅkhārādīhi, cittasaṅkhārassa ca kāyasaṅkhārādīhi, aññattā ‘‘kāyasaṅkhāro vacīsaṅkhāro, vacīsaṅkhāro, kāyasaṅkhāro’’ti ",
      " ekekasaṅkhāramūlakāni dve dve katvā cha yamakāni yujjanti. Tesu aggahitaggahaṇena tīṇeva labbhanti. Tasmā tāneva dassetuṃ anulomanaye tīṇi, paṭilomanaye tīṇīti cha yamakāni vuttāni. Suddhasaṅkhāramūlacakkavāro panettha na gahitoti. Evaṃ paṇṇattivārassa uddesavāro veditabbo."
    ],
    "innerText": "2-7. Idāni kāyo kāyasaṅkhāroti padasodhanavāro āraddho. Tassa anulomanaye tīṇi, paṭilomanaye tīṇīti cha yamakāni. Padasodhanamūlacakkavāre ekekasaṅkhāramūlakāni dve dve katvā anulomanaye cha, paṭilomanaye chāti dvādasa yamakāni. Suddhasaṅkhāravāre pana yathā suddhakhandhavārādīsu ‘‘rūpaṃ khandho, khandhā rūpaṃ; cakkhu āyatanaṃ, āyatanā cakkhū’’tiādinā nayena yamakāni vuttāni. Evaṃ ‘‘kāyo saṅkhāro, saṅkhārā kāyo’’ti avatvā ‘‘kāyasaṅkhāro vacīsaṅkhāro, vacīsaṅkhāro kāyasaṅkhāro’’tiādinā nayena kāyasaṅkhāramūlakāni dve, vacīsaṅkhāramūlakaṃ ekanti anulome tīṇi, paṭilome tīṇīti sabbānipi suddhikavāre cha yamakāni vuttāni. Kiṃ kāraṇā? Suddhikaekekapadavasena atthābhāvato. Yathā hi khandhayamakādīsu rūpādivisiṭṭhānaṃ khandhānaṃ cakkhādivisiṭṭhānañca āyatanādīnaṃ adhippetattā ‘‘rūpaṃ khandho , khandhā rūpaṃ, cakkhu āyatanaṃ, āyatanā cakkhū’’ti suddhikaekekapadavasena attho atthi. Evamidha ‘‘kāyo saṅkhāro, saṅkhārā kāyo’’ti natthi. Kāyasaṅkhāroti pana dvīhipi padehi ekova attho labbhati. Assāso vā passāso vāti suddhikaekekapadavasena atthābhāvato ‘‘kāyo saṅkhāro, saṅkhārā kāyo’’ti na vuttaṃ. ‘‘Kāyo kāyasaṅkhāro’’tiādi pana vattabbaṃ siyā. Tampi kāyavacīcittapadehi idha adhippetānaṃ saṅkhārānaṃ aggahitattā na yujjati. Suddhasaṅkhāravāro hesa. Padasodhane pana vināpi atthena vacanaṃ yujjatīti tattha so nayo gahitova. Idha pana kāyasaṅkhārassa vacīsaṅkhārādīhi, vacīsaṅkhārassa ca cittasaṅkhārādīhi, cittasaṅkhārassa ca kāyasaṅkhārādīhi, aññattā ‘‘kāyasaṅkhāro vacīsaṅkhāro, vacīsaṅkhāro, kāyasaṅkhāro’’ti ekekasaṅkhāramūlakāni dve dve katvā cha yamakāni yujjanti. Tesu aggahitaggahaṇena tīṇeva labbhanti. Tasmā tāneva dassetuṃ anulomanaye tīṇi, paṭilomanaye tīṇīti cha yamakāni vuttāni. Suddhasaṅkhāramūlacakkavāro panettha na gahitoti. Evaṃ paṇṇattivārassa uddesavāro veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8-18"
      },
      ". Niddesavāre panassa anulome tāva yasmā na kāyādayova kāyasaṅkhārādīnaṃ nāmaṃ, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "no"
      },
      "ti paṭisedho kato. Paṭilome ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na kāyo na kāyasaṅkhāro"
      },
      "ti yo na kāyo so kāyasaṅkhāropi na hotīti pucchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyasaṅkhāro na kāyo kāyasaṅkhāro"
      },
      "ti ",
      " kāyasaṅkhāro kāyo na hoti, kāyasaṅkhāroyeva panesoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avasesa"
      },
      "nti na kevalaṃ sesasaṅkhāradvayameva. Kāyasaṅkhāravinimuttaṃ pana sesaṃ sabbampi saṅkhatāsaṅkhatapaṇṇattibhedaṃ dhammajātaṃ neva kāyo, na kāyasaṅkhāroti iminā upāyena sabbavissajjanesu attho veditabboti."
    ],
    "innerText": "8-18. Niddesavāre panassa anulome tāva yasmā na kāyādayova kāyasaṅkhārādīnaṃ nāmaṃ, tasmā noti paṭisedho kato. Paṭilome na kāyo na kāyasaṅkhāroti yo na kāyo so kāyasaṅkhāropi na hotīti pucchati. Kāyasaṅkhāro na kāyo kāyasaṅkhāroti kāyasaṅkhāro kāyo na hoti, kāyasaṅkhāroyeva panesoti attho. Avasesanti na kevalaṃ sesasaṅkhāradvayameva. Kāyasaṅkhāravinimuttaṃ pana sesaṃ sabbampi saṅkhatāsaṅkhatapaṇṇattibhedaṃ dhammajātaṃ neva kāyo, na kāyasaṅkhāroti iminā upāyena sabbavissajjanesu attho veditabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṇṇattivāravaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Pavattivāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ". Pavattivāre panettha paccuppannakāle puggalavārassa anulomanaye ‘‘yassa kāyasaṅkhāro uppajjati, tassa vacīsaṅkhāro uppajjatī’’ti kāyasaṅkhāramūlakāni dve, vacīsaṅkhāramūlakaṃ ",
      " ekanti tīṇeva yamakāni labbhanti; tāni gahitāneva. Tassa paṭilomanayepi okāsavārādīsupi eseva nayo. Evamettha sabbavāresu tiṇṇaṃ tiṇṇaṃ yamakānaṃ vasena yamakagaṇanā veditabbā."
    ],
    "innerText": "19. Pavattivāre panettha paccuppannakāle puggalavārassa anulomanaye ‘‘yassa kāyasaṅkhāro uppajjati, tassa vacīsaṅkhāro uppajjatī’’ti kāyasaṅkhāramūlakāni dve, vacīsaṅkhāramūlakaṃ ekanti tīṇeva yamakāni labbhanti; tāni gahitāneva. Tassa paṭilomanayepi okāsavārādīsupi eseva nayo. Evamettha sabbavāresu tiṇṇaṃ tiṇṇaṃ yamakānaṃ vasena yamakagaṇanā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atthavinicchaye panettha idaṃ lakkhaṇaṃ – imasmiñhi saṅkhārayamake ‘‘assāsapassāsānaṃ uppādakkhaṇe vitakkavicārānaṃ uppādakkhaṇe’’tiādivacanato paccuppannādikālabhedo pavattivasenāpi gahetabbo, na cutipaṭisandhivaseneva. ‘‘Dutiyajjhāne tatiyajjhāne tattha kāyasaṅkhāro ",
      " uppajjatī’’tiādivacanato ca jhānampi okāsavasena gahitanti veditabbaṃ. Evamettha yaṃ yaṃ labbhati, tassa tassa vasena atthavinicchayo veditabbo."
    ],
    "innerText": "Atthavinicchaye panettha idaṃ lakkhaṇaṃ – imasmiñhi saṅkhārayamake ‘‘assāsapassāsānaṃ uppādakkhaṇe vitakkavicārānaṃ uppādakkhaṇe’’tiādivacanato paccuppannādikālabhedo pavattivasenāpi gahetabbo, na cutipaṭisandhivaseneva. ‘‘Dutiyajjhāne tatiyajjhāne tattha kāyasaṅkhāro uppajjatī’’tiādivacanato ca jhānampi okāsavasena gahitanti veditabbaṃ. Evamettha yaṃ yaṃ labbhati, tassa tassa vasena atthavinicchayo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatridaṃ nayamukhaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinā vitakkavicārehī"
      },
      "ti dutiyatatiyajjhānavasena vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesa"
      },
      "nti tesaṃ dutiyatatiyajjhānasamaṅgīnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmāvacarāna"
      },
      "nti kāmāvacare uppannasattānaṃ. Rūpāvacaradevānaṃ pana assāsapassāsā natthi. Arūpāvacarānaṃ rūpameva natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinā assāsapassāsehī"
      },
      "ti rūpārūpabhavesu nibbattasattānaṃ vitakkavicāruppattiṃ sandhāya vuttaṃ."
    ],
    "innerText": "Tatridaṃ nayamukhaṃ – vinā vitakkavicārehīti dutiyatatiyajjhānavasena vuttaṃ. Tesanti tesaṃ dutiyatatiyajjhānasamaṅgīnaṃ. Kāmāvacarānanti kāmāvacare uppannasattānaṃ. Rūpāvacaradevānaṃ pana assāsapassāsā natthi. Arūpāvacarānaṃ rūpameva natthi. Vinā assāsapassāsehīti rūpārūpabhavesu nibbattasattānaṃ vitakkavicāruppattiṃ sandhāya vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamajjhāne kāmāvacare"
      },
      "ti kāmāvacarabhūmiyaṃ uppanne paṭhamajjhāne. Aṅgamattavasena cettha paṭhamajjhānaṃ gahetabbaṃ, na appanāvaseneva. Anappanāpattepi hi savitakkasavicāracitte idaṃ saṅkhāradvayaṃ uppajjateva."
    ],
    "innerText": "21.Paṭhamajjhāne kāmāvacareti kāmāvacarabhūmiyaṃ uppanne paṭhamajjhāne. Aṅgamattavasena cettha paṭhamajjhānaṃ gahetabbaṃ, na appanāvaseneva. Anappanāpattepi hi savitakkasavicāracitte idaṃ saṅkhāradvayaṃ uppajjateva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhaṅgakkhaṇe"
      },
      "ti idaṃ kāyasaṅkhārassa ekantacittasamuṭṭhānattā vuttaṃ. Uppajjamānameva hi cittaṃ rūpaṃ vā arūpaṃ vā samuṭṭhāpeti, na bhijjamānaṃ."
    ],
    "innerText": "24.Cittassabhaṅgakkhaṇeti idaṃ kāyasaṅkhārassa ekantacittasamuṭṭhānattā vuttaṃ. Uppajjamānameva hi cittaṃ rūpaṃ vā arūpaṃ vā samuṭṭhāpeti, na bhijjamānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suddhāvāsānaṃ dutiye citte vattamāne"
      },
      "ti paṭisandhito dutiye bhavaṅgacitte. Kāmañcetaṃ paṭisandhicittepi vattamāne tesaṃ tattha nuppajjittheva. Yāva pana abbokiṇṇaṃ vipākacittaṃ vattati, tāva nuppajjittheva nāmāti dassanatthametaṃ vuttaṃ. Yassa vā jhānassa vipākacittena te nibbattā, taṃ satasopi sahassasopi uppajjamānaṃ paṭhamacittameva. Vipākacittena pana visadisaṃ bhavanikantiyā āvajjanacittaṃ dutiyacittaṃ nāma. Taṃ sandhāyetaṃ vuttanti veditabbaṃ."
    ],
    "innerText": "37.Suddhāvāsānaṃ dutiye citte vattamāneti paṭisandhito dutiye bhavaṅgacitte. Kāmañcetaṃ paṭisandhicittepi vattamāne tesaṃ tattha nuppajjittheva. Yāva pana abbokiṇṇaṃ vipākacittaṃ vattati, tāva nuppajjittheva nāmāti dassanatthametaṃ vuttaṃ. Yassa vā jhānassa vipākacittena te nibbattā, taṃ satasopi sahassasopi uppajjamānaṃ paṭhamacittameva. Vipākacittena pana visadisaṃ bhavanikantiyā āvajjanacittaṃ dutiyacittaṃ nāma. Taṃ sandhāyetaṃ vuttanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchimacittasamaṅgīna"
      },
      "nti ",
      " sabbapacchimena appaṭisandhikacittena samaṅgībhūtānaṃ khīṇāsavānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avitakkaavicāraṃ pacchimacitta"
      },
      "nti rūpāvacarānaṃ dutiyajjhānikādicuticittavasena, arūpāvacarānañca catutthajjhānikacuticittavasenetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesa"
      },
      "nti tesaṃ pacchimacittasamaṅgīādīnaṃ."
    ],
    "innerText": "44.Pacchimacittasamaṅgīnanti sabbapacchimena appaṭisandhikacittena samaṅgībhūtānaṃ khīṇāsavānaṃ. Avitakkaavicāraṃ pacchimacittanti rūpāvacarānaṃ dutiyajjhānikādicuticittavasena, arūpāvacarānañca catutthajjhānikacuticittavasenetaṃ vuttaṃ. Tesanti tesaṃ pacchimacittasamaṅgīādīnaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "79"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa kāyasaṅkhāro nirujjhati, tassa cittasaṅkhāro nirujjhatī"
      },
      "ti ettha niyamato kāyasaṅkhārassa cittasaṅkhārena saddhiṃ ekakkhaṇe nirujjhanato āmantāti paṭivacanaṃ dinnaṃ. Na cittasaṅkhārassa ",
      " kāyasaṅkhārena saddhiṃ. Kiṃ kāraṇā? Cittasaṅkhāro hi kāyasaṅkhārena vināpi uppajjati ca nirujjhati ca. Kāyasaṅkhāro pana cittasamuṭṭhāno assāsapassāsavāto. Cittasamuṭṭhānarūpañca cittassa uppādakkhaṇe uppajjitvā yāva aññāni soḷasacittāni uppajjanti, tāva tiṭṭhati. Tesaṃ soḷasannaṃ sabbapacchimena saddhiṃ nirujjhatīti yena cittena saddhiṃ uppajjati, tato paṭṭhāya sattarasamena saddhiṃ nirujjhati. Na kassaci cittassa uppādakkhaṇe vā ṭhitikkhaṇe vā nirujjhati, nāpi ṭhitikkhaṇe vā bhaṅgakkhaṇe vā uppajjati. Esā cittasamuṭṭhānarūpassa dhammatāti niyamato cittasaṅkhārena saddhiṃ ekakkhaṇe nirujjhanato āmantāti vuttaṃ. Yaṃ pana vibhaṅgappakaraṇassa sīhaḷaṭṭhakathāyaṃ ‘‘cittasamuṭṭhānaṃ rūpaṃ sattarasamassa cittassa uppādakkhaṇe nirujjhatī’’ti vuttaṃ, taṃ imāya pāḷiyā virūjjhati. Aṭṭhakathāto ca pāḷiyeva balavatarāti pāḷiyaṃ vuttameva pamāṇaṃ."
    ],
    "innerText": "79.Yassa kāyasaṅkhāro nirujjhati, tassa cittasaṅkhāro nirujjhatīti ettha niyamato kāyasaṅkhārassa cittasaṅkhārena saddhiṃ ekakkhaṇe nirujjhanato āmantāti paṭivacanaṃ dinnaṃ. Na cittasaṅkhārassa kāyasaṅkhārena saddhiṃ. Kiṃ kāraṇā? Cittasaṅkhāro hi kāyasaṅkhārena vināpi uppajjati ca nirujjhati ca. Kāyasaṅkhāro pana cittasamuṭṭhāno assāsapassāsavāto. Cittasamuṭṭhānarūpañca cittassa uppādakkhaṇe uppajjitvā yāva aññāni soḷasacittāni uppajjanti, tāva tiṭṭhati. Tesaṃ soḷasannaṃ sabbapacchimena saddhiṃ nirujjhatīti yena cittena saddhiṃ uppajjati, tato paṭṭhāya sattarasamena saddhiṃ nirujjhati. Na kassaci cittassa uppādakkhaṇe vā ṭhitikkhaṇe vā nirujjhati, nāpi ṭhitikkhaṇe vā bhaṅgakkhaṇe vā uppajjati. Esā cittasamuṭṭhānarūpassa dhammatāti niyamato cittasaṅkhārena saddhiṃ ekakkhaṇe nirujjhanato āmantāti vuttaṃ. Yaṃ pana vibhaṅgappakaraṇassa sīhaḷaṭṭhakathāyaṃ ‘‘cittasamuṭṭhānaṃ rūpaṃ sattarasamassa cittassa uppādakkhaṇe nirujjhatī’’ti vuttaṃ, taṃ imāya pāḷiyā virūjjhati. Aṭṭhakathāto ca pāḷiyeva balavatarāti pāḷiyaṃ vuttameva pamāṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "128"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa kāyasaṅkhāro uppajjati, tassa vacīsaṅkhāro nirujjhatī"
      },
      "ti ettha yasmā kāyasaṅkhāro cittassa uppādakkhaṇe uppajjati, na ca tasmiṃ khaṇe ",
      " vitakkavicārā nirujjhanti, tasmā noti paṭisedho katoti. Iminā nayamukhena sabbattha atthavinicchayo veditabbo. Pariññāvāro pākatikoyevāti."
    ],
    "innerText": "128.Yassa kāyasaṅkhāro uppajjati, tassa vacīsaṅkhāro nirujjhatīti ettha yasmā kāyasaṅkhāro cittassa uppādakkhaṇe uppajjati, na ca tasmiṃ khaṇe vitakkavicārā nirujjhanti, tasmā noti paṭisedho katoti. Iminā nayamukhena sabbattha atthavinicchayo veditabbo. Pariññāvāro pākatikoyevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pavattivāravaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṅkhārayamakavaṇṇanā niṭṭhitā."
  }
]