[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "11. Ekādasamavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1-3. Tissopi anusayakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "605-613"
      },
      ". Idāni ",
      " anusayā abyākatā, ahetukā, cittavippayuttāti tissopi anusayakathā nāma honti. Tattha yasmā puthujjano kusalābyākate citte vattamāne ‘‘sānusayo’’ti vattabbo, yo cassa tasmiṃ khaṇe hetu, na tena hetunā anusayā sahetukā, na tena cittena sampayuttā, tasmā ‘‘te abyākatā, ahetukā, cittavippayuttā’’ti yesaṃ laddhi, seyyathāpi mahāsaṃghikānañceva sammitiyānañca; te sandhāya tīsupi kathāsu pucchā sakavādissa, paṭiññā itarassa. Sesaṃ heṭṭhā vuttanayattā sakkā pāḷimaggeneva jānitunti, tasmā na vitthāritanti."
    ],
    "innerText": "605-613. Idāni anusayā abyākatā, ahetukā, cittavippayuttāti tissopi anusayakathā nāma honti. Tattha yasmā puthujjano kusalābyākate citte vattamāne ‘‘sānusayo’’ti vattabbo, yo cassa tasmiṃ khaṇe hetu, na tena hetunā anusayā sahetukā, na tena cittena sampayuttā, tasmā ‘‘te abyākatā, ahetukā, cittavippayuttā’’ti yesaṃ laddhi, seyyathāpi mahāsaṃghikānañceva sammitiyānañca; te sandhāya tīsupi kathāsu pucchā sakavādissa, paṭiññā itarassa. Sesaṃ heṭṭhā vuttanayattā sakkā pāḷimaggeneva jānitunti, tasmā na vitthāritanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tissopi anusayakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Ñāṇakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "614-615"
      },
      ". Idāni ",
      " ñāṇakathā nāma hoti. Tattha maggañāṇena aññāṇe vigatepi puna cakkhuviññāṇādivasena ñāṇavippayuttacitte vattamāne yasmā taṃ maggacittaṃ na pavattati, tasmā ‘‘na vattabbaṃ ñāṇī’’ti yesaṃ laddhi, seyyathāpi mahāsaṃghikānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘yadi aññāṇe vigate ‘ñāṇī’ti paññatti na siyā, rāgādīsu vigatesu vītarāgādipaññattipi na siyāti puggalapaññattiyaṃ akovidosī’’ti codetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rāge vigate"
      },
      "tiādimāha. Itaro tesu vigatesu sarāgādibhāve yuttiṃ ",
      " apassanto paṭikkhipati. Pariyosāne yasmā ñāṇapaṭilābhena so ñāṇīti vattabbataṃ arahati, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na heva"
      },
      "nti paṭikkhepo sakavādissāti."
    ],
    "innerText": "614-615. Idāni ñāṇakathā nāma hoti. Tattha maggañāṇena aññāṇe vigatepi puna cakkhuviññāṇādivasena ñāṇavippayuttacitte vattamāne yasmā taṃ maggacittaṃ na pavattati, tasmā ‘‘na vattabbaṃ ñāṇī’’ti yesaṃ laddhi, seyyathāpi mahāsaṃghikānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘yadi aññāṇe vigate ‘ñāṇī’ti paññatti na siyā, rāgādīsu vigatesu vītarāgādipaññattipi na siyāti puggalapaññattiyaṃ akovidosī’’ti codetuṃ rāge vigatetiādimāha. Itaro tesu vigatesu sarāgādibhāve yuttiṃ apassanto paṭikkhipati. Pariyosāne yasmā ñāṇapaṭilābhena so ñāṇīti vattabbataṃ arahati, tasmā na hevanti paṭikkhepo sakavādissāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ñāṇakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Ñāṇaṃ cittavippayuttantikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "616-617"
      },
      ". Idāni ",
      " ñāṇaṃ cittavippayuttantikathā nāma hoti. Tattha yasmā arahā cakkhuviññāṇādisamaṅgī paṭiladdhaṃ maggañāṇaṃ sandhāya ‘‘ñāṇī’’ti vuccati, na cassa taṃ tena cittena sampayuttaṃ, tasmā ‘‘ñāṇaṃ cittavippayutta’’nti yesaṃ laddhi, seyyathāpi pubbaseliyānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘yadi te ñāṇaṃ cittavippayuttaṃ cittavippayuttesu rūpādīsu aññataraṃ siyā’’ti codetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpa"
      },
      "ntiādimāha. Itaro paṭikkhipati. Sesaṃ heṭṭhā vuttanayameva. Pariyosāne pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññavā"
      },
      "ti puṭṭho paṭilābhavasena taṃ pavattiṃ icchati, tasmā paṭijānātīti."
    ],
    "innerText": "616-617. Idāni ñāṇaṃ cittavippayuttantikathā nāma hoti. Tattha yasmā arahā cakkhuviññāṇādisamaṅgī paṭiladdhaṃ maggañāṇaṃ sandhāya ‘‘ñāṇī’’ti vuccati, na cassa taṃ tena cittena sampayuttaṃ, tasmā ‘‘ñāṇaṃ cittavippayutta’’nti yesaṃ laddhi, seyyathāpi pubbaseliyānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘yadi te ñāṇaṃ cittavippayuttaṃ cittavippayuttesu rūpādīsu aññataraṃ siyā’’ti codetuṃ rūpantiādimāha. Itaro paṭikkhipati. Sesaṃ heṭṭhā vuttanayameva. Pariyosāne pana paññavāti puṭṭho paṭilābhavasena taṃ pavattiṃ icchati, tasmā paṭijānātīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ñāṇaṃ cittavippayuttantikathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Idaṃ dukkhantikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "618-820"
      },
      ". Idāni ",
      " idaṃ dukkhantikathā nāma hoti. Tattha yesaṃ ‘‘lokuttaramaggakkhaṇe yogāvacaro idaṃ dukkhanti vācaṃ bhāsati, evamassa idaṃ dukkhanti vācaṃ bhāsato ca idaṃ dukkhanti ñāṇaṃ pavattatī’’ti laddhi, seyyathāpi andhakānaṃ; te sandhāya pucchā sakavādissa, maggakkhaṇe tathā vācābhāsanaṃ ñāṇappavattiñca sandhāya paṭiññā itarassa. Yasmā pana so sesasaccapaṭisaṃyuttaṃ vācaṃ puthujjanova bhāsati ",
      ", na ca tassa tathā ñāṇappavattīti icchati, tasmā samudayādipañhesu paṭikkhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpaṃ anicca"
      },
      "ntiādi dukkhapariyāyadassanavasena vuttaṃ. Itaro pana sakasamaye tādisaṃ vohāraṃ apassanto paṭikkhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iti ca danti cā"
      },
      "tiādi yadi tassa dukkhe ñāṇaṃ pavattati, i-kāra daṃ-kāra du-kāra kha-kāresu paṭipāṭiyā catūhi ñāṇehi pavattitabbanti dassetuṃ vuttaṃ. Itaro pana tathā na icchati, tasmā paṭikkhipati."
    ],
    "innerText": "618-820. Idāni idaṃ dukkhantikathā nāma hoti. Tattha yesaṃ ‘‘lokuttaramaggakkhaṇe yogāvacaro idaṃ dukkhanti vācaṃ bhāsati, evamassa idaṃ dukkhanti vācaṃ bhāsato ca idaṃ dukkhanti ñāṇaṃ pavattatī’’ti laddhi, seyyathāpi andhakānaṃ; te sandhāya pucchā sakavādissa, maggakkhaṇe tathā vācābhāsanaṃ ñāṇappavattiñca sandhāya paṭiññā itarassa. Yasmā pana so sesasaccapaṭisaṃyuttaṃ vācaṃ puthujjanova bhāsati , na ca tassa tathā ñāṇappavattīti icchati, tasmā samudayādipañhesu paṭikkhipati. Rūpaṃ aniccantiādi dukkhapariyāyadassanavasena vuttaṃ. Itaro pana sakasamaye tādisaṃ vohāraṃ apassanto paṭikkhipati. Iti ca danti cātiādi yadi tassa dukkhe ñāṇaṃ pavattati, i-kāra daṃ-kāra du-kāra kha-kāresu paṭipāṭiyā catūhi ñāṇehi pavattitabbanti dassetuṃ vuttaṃ. Itaro pana tathā na icchati, tasmā paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Idaṃ dukkhantikathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Iddhibalakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "621-624"
      },
      ". Idāni ",
      " iddhibalakathā nāma hoti. Tattha iddhipādabhāvanānisaṃsassa atthaṃ ayoniso gahetvā ‘‘iddhibalena samannāgato kappaṃ tiṭṭheyyā’’ti yesaṃ laddhi, seyyathāpi mahāsaṃghikānaṃ; te sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iddhibalena samannāgato kappaṃ tiṭṭheyyā"
      },
      "ti pucchā sakavādissa. Tattha kappo nāma mahākappo, kappekadeso, āyukappoti tividho. ‘‘Cattārimāni, bhikkhave, kappassa asaṅkhyeyyānī’’ti (a. ni. 4.156) ettha hi mahākappova kappoti vutto. ‘‘Brahmakāyikānaṃ devānaṃ kappo āyuppamāṇa’’nti (a. ni. 4.123) ettha kappekadesā. ‘‘Kappaṃ nirayamhi paccati, kappaṃ saggamhi modatī’’ti (cūḷava. 354) ettha āyukappo. Āyukappanaṃ āyuvidhānaṃ kammassa vipākavasena vā vassagaṇanāya vā āyuparicchedoti attho. Tesu mahākappaṃ sandhāya pucchati, itaro paṭijānāti."
    ],
    "innerText": "621-624. Idāni iddhibalakathā nāma hoti. Tattha iddhipādabhāvanānisaṃsassa atthaṃ ayoniso gahetvā ‘‘iddhibalena samannāgato kappaṃ tiṭṭheyyā’’ti yesaṃ laddhi, seyyathāpi mahāsaṃghikānaṃ; te sandhāya iddhibalena samannāgato kappaṃ tiṭṭheyyāti pucchā sakavādissa. Tattha kappo nāma mahākappo, kappekadeso, āyukappoti tividho. ‘‘Cattārimāni, bhikkhave, kappassa asaṅkhyeyyānī’’ti (a. ni. 4.156) ettha hi mahākappova kappoti vutto. ‘‘Brahmakāyikānaṃ devānaṃ kappo āyuppamāṇa’’nti (a. ni. 4.123) ettha kappekadesā. ‘‘Kappaṃ nirayamhi paccati, kappaṃ saggamhi modatī’’ti (cūḷava. 354) ettha āyukappo. Āyukappanaṃ āyuvidhānaṃ kammassa vipākavasena vā vassagaṇanāya vā āyuparicchedoti attho. Tesu mahākappaṃ sandhāya pucchati, itaro paṭijānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha naṃ sakavādī ‘‘sace te iddhibalena samannāgato, ‘yo ciraṃ jīvati, so vassasataṃ appaṃ ",
      " vā bhiyyo’ti (saṃ. ni. 2.143) evaṃ paricchinnā āyukappā uddhaṃ mahākappaṃ vā mahākappekadesaṃ vā jīveyya iddhimayikenassa āyunā bhavitabba’’nti codetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iddhimayiko so āyū"
      },
      "tiādimāha. Itaro ‘‘jīvitindriyaṃ nāma iddhimayikaṃ natthi, kammasamuṭṭhānamevā’’ti vuttattā paṭikkhipati. Ko panettha iddhimato viseso, nanu aniddhimāpi āyukappaṃ ",
      " tiṭṭheyyāti? Ayaṃ viseso – iddhimā hi yāvatāyukaṃ jīvitappavattiyā antarāyakare dhamme iddhibalena paṭibāhitvā antarā akālamaraṇaṃ nivāretuṃ sakkoti, aniddhimato etaṃ balaṃ natthi. Ayametesaṃ viseso."
    ],
    "innerText": "Atha naṃ sakavādī ‘‘sace te iddhibalena samannāgato, ‘yo ciraṃ jīvati, so vassasataṃ appaṃ vā bhiyyo’ti (saṃ. ni. 2.143) evaṃ paricchinnā āyukappā uddhaṃ mahākappaṃ vā mahākappekadesaṃ vā jīveyya iddhimayikenassa āyunā bhavitabba’’nti codetuṃ iddhimayiko so āyūtiādimāha. Itaro ‘‘jīvitindriyaṃ nāma iddhimayikaṃ natthi, kammasamuṭṭhānamevā’’ti vuttattā paṭikkhipati. Ko panettha iddhimato viseso, nanu aniddhimāpi āyukappaṃ tiṭṭheyyāti? Ayaṃ viseso – iddhimā hi yāvatāyukaṃ jīvitappavattiyā antarāyakare dhamme iddhibalena paṭibāhitvā antarā akālamaraṇaṃ nivāretuṃ sakkoti, aniddhimato etaṃ balaṃ natthi. Ayametesaṃ viseso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atītaṃ anāgata"
      },
      "nti idaṃ avisesena kappaṃ tiṭṭheyyāti paṭiññātattā codeti. Dve ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kappe"
      },
      "tiādi ‘‘yadi iddhimā jīvitaparicchedaṃ atikkamituṃ sakkoti, na kevalaṃ ekaṃ anekepi kappe tiṭṭheyyā’’ti codanatthaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppanno phasso"
      },
      "tiādi na sabbaṃ iddhiyā labbhati, iddhiyā avisayopi atthīti dassetuṃ vuttaṃ. Sesamettha uttānatthamevāti."
    ],
    "innerText": "Atītaṃ anāgatanti idaṃ avisesena kappaṃ tiṭṭheyyāti paṭiññātattā codeti. Dve kappetiādi ‘‘yadi iddhimā jīvitaparicchedaṃ atikkamituṃ sakkoti, na kevalaṃ ekaṃ anekepi kappe tiṭṭheyyā’’ti codanatthaṃ vuttaṃ. Uppanno phassotiādi na sabbaṃ iddhiyā labbhati, iddhiyā avisayopi atthīti dassetuṃ vuttaṃ. Sesamettha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iddhibalakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Samādhikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "625-626"
      },
      ". Idāni ",
      " samādhikathā nāma hoti. Tattha yesaṃ ekacittakkhaṇe uppannāpi ekaggatā samādhānaṭṭhena samādhīti aggahetvā ‘‘satta rattindivāni ekantasukhapaṭisaṃvedī viharitu’’ntiādivacanaṃ (ma. ni. 1.180) nissāya ‘‘cittasantati samādhī’’ti laddhi, seyyathāpi sabbatthivādānañceva uttarāpathakānañca; te sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cittasantatī"
      },
      "ti pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘yadi cittasantati samādhi, cittasantati nāma atītāpi atthi, anāgatāpi atthi. Na hi ekaṃ paccuppannacittameva cittasantati nāma hoti, kiṃ te sabbāpi sā samādhī’’ti codetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atītā"
      },
      "tiādimāha, itaro tathā anicchanto paṭikkhipati."
    ],
    "innerText": "625-626. Idāni samādhikathā nāma hoti. Tattha yesaṃ ekacittakkhaṇe uppannāpi ekaggatā samādhānaṭṭhena samādhīti aggahetvā ‘‘satta rattindivāni ekantasukhapaṭisaṃvedī viharitu’’ntiādivacanaṃ (ma. ni. 1.180) nissāya ‘‘cittasantati samādhī’’ti laddhi, seyyathāpi sabbatthivādānañceva uttarāpathakānañca; te sandhāya cittasantatīti pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘yadi cittasantati samādhi, cittasantati nāma atītāpi atthi, anāgatāpi atthi. Na hi ekaṃ paccuppannacittameva cittasantati nāma hoti, kiṃ te sabbāpi sā samādhī’’ti codetuṃ atītātiādimāha, itaro tathā anicchanto paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nanu"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atītaṃ niruddha"
      },
      "ntiādi ‘‘cittasantatiyaṃ paccuppannameva cittaṃ kiccakaraṃ, atītānāgataṃ niruddhattā anuppannattā ca natthi, kathaṃ taṃ samādhi nāma hotī’’ti dassetuṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekacittakkhaṇiko"
      },
      "ti pucchā paravādissa. Tato yā sakasamaye ‘‘samādhiṃ, bhikkhave, bhāvethā’’tiādīsu paccuppannakusalacittasampayuttā ekaggatā samādhīti vuttā, taṃ sandhāya paṭiññā sakavādissa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhuviññāṇasamaṅgī"
      },
      "tiādi ‘‘ekacittakkhaṇiko’’ti vacanamattaṃ gahetvā chalena vuttaṃ, teneva sakavādinā paṭikkhittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nanu vuttaṃ bhagavatā"
      },
      "ti suttaṃ purimapacchimavasena pavattamānassa ",
      " samādhissa abbokiṇṇataṃ sādheti, na santatiyā samādhibhāvaṃ, tasmā asādhakanti."
    ],
    "innerText": "Nanuatītaṃ niruddhantiādi ‘‘cittasantatiyaṃ paccuppannameva cittaṃ kiccakaraṃ, atītānāgataṃ niruddhattā anuppannattā ca natthi, kathaṃ taṃ samādhi nāma hotī’’ti dassetuṃ vuttaṃ. Ekacittakkhaṇikoti pucchā paravādissa. Tato yā sakasamaye ‘‘samādhiṃ, bhikkhave, bhāvethā’’tiādīsu paccuppannakusalacittasampayuttā ekaggatā samādhīti vuttā, taṃ sandhāya paṭiññā sakavādissa. Cakkhuviññāṇasamaṅgītiādi ‘‘ekacittakkhaṇiko’’ti vacanamattaṃ gahetvā chalena vuttaṃ, teneva sakavādinā paṭikkhittaṃ. Nanu vuttaṃ bhagavatāti suttaṃ purimapacchimavasena pavattamānassa samādhissa abbokiṇṇataṃ sādheti, na santatiyā samādhibhāvaṃ, tasmā asādhakanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Samādhikathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Dhammaṭṭhitatākathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "627"
      },
      ". Idāni dhammaṭṭhitatākathā nāma hoti. Tattha ‘‘ṭhitāva sā dhātū’’ti vacanaṃ nissāya ‘‘paṭiccasamuppādasaṅkhātā dhammaṭṭhitatā nāma ekā atthi, sā ca parinipphannā’’ti yesaṃ laddhi, seyyathāpi andhakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘yadi parinipphannānaṃ avijjādīnaṃ aññā ",
      " dhammaṭṭhitatā nāma parinipphannā atthi, tāyapi ca te dhammaṭṭhitatāya aññā ṭhitatā parinipphannā āpajjatī’’ti codetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tāya ṭhitatā"
      },
      "tiādimāha. Paravādī evarūpāya laddhiyā abhāvena paṭikkhipati. Dutiyaṃ puṭṭho anantarapaccayatañceva aññamaññapaccayatañca sandhāya paṭijānāti. Sesaṃ heṭṭhā vuttanayattā uttānatthamevāti."
    ],
    "innerText": "627. Idāni dhammaṭṭhitatākathā nāma hoti. Tattha ‘‘ṭhitāva sā dhātū’’ti vacanaṃ nissāya ‘‘paṭiccasamuppādasaṅkhātā dhammaṭṭhitatā nāma ekā atthi, sā ca parinipphannā’’ti yesaṃ laddhi, seyyathāpi andhakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘yadi parinipphannānaṃ avijjādīnaṃ aññā dhammaṭṭhitatā nāma parinipphannā atthi, tāyapi ca te dhammaṭṭhitatāya aññā ṭhitatā parinipphannā āpajjatī’’ti codetuṃ tāya ṭhitatātiādimāha. Paravādī evarūpāya laddhiyā abhāvena paṭikkhipati. Dutiyaṃ puṭṭho anantarapaccayatañceva aññamaññapaccayatañca sandhāya paṭijānāti. Sesaṃ heṭṭhā vuttanayattā uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhammaṭṭhitatākathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Aniccatākathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "628"
      },
      ". Idāni ",
      " aniccatākathā nāma hoti. Tattha ‘‘aniccānaṃ rūpādīnaṃ aniccatāpi rūpādayo viya parinipphannā’’ti yesaṃ laddhi, seyyathāpi andhakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘yadi te rūpādayo viya aniccatā parinipphannā, tassāpi aññāya parinipphannāya aniccatāya bhavitabba’’nti codetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tāya aniccatāyā"
      },
      "tiādimāha. Itaro dvinnaṃ aniccatāya ekato abhāvena paṭikkhipitvā puna yasmā sā aniccatā niccā na hoti, teneva aniccena saddhiṃ antaradhāyati, tasmā paṭijānāti. Athassa sakavādī lesokāsaṃ adatvā yā tena dutiyā aniccatā paṭiññātā ",
      ", tāyapi tato parāyapīti paramparavasena anupacchedadosaṃ āropento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tāya tāyevā"
      },
      "tiādimāha. Jarā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parinipphannā"
      },
      "tiādi yasmā uppannassa jarāmaraṇato aññā aniccatā nāma natthi, tasmā aniccatāvibhāgānuyuñjanavasena vuttaṃ. Tatrāpi paravādino purimanayeneva paṭiññā ca paṭikkhepo ca veditabbo."
    ],
    "innerText": "628. Idāni aniccatākathā nāma hoti. Tattha ‘‘aniccānaṃ rūpādīnaṃ aniccatāpi rūpādayo viya parinipphannā’’ti yesaṃ laddhi, seyyathāpi andhakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘yadi te rūpādayo viya aniccatā parinipphannā, tassāpi aññāya parinipphannāya aniccatāya bhavitabba’’nti codetuṃ tāya aniccatāyātiādimāha. Itaro dvinnaṃ aniccatāya ekato abhāvena paṭikkhipitvā puna yasmā sā aniccatā niccā na hoti, teneva aniccena saddhiṃ antaradhāyati, tasmā paṭijānāti. Athassa sakavādī lesokāsaṃ adatvā yā tena dutiyā aniccatā paṭiññātā , tāyapi tato parāyapīti paramparavasena anupacchedadosaṃ āropento tāya tāyevātiādimāha. Jarā parinipphannātiādi yasmā uppannassa jarāmaraṇato aññā aniccatā nāma natthi, tasmā aniccatāvibhāgānuyuñjanavasena vuttaṃ. Tatrāpi paravādino purimanayeneva paṭiññā ca paṭikkhepo ca veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "629"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpaṃ parinipphanna"
      },
      "ntiādi yesaṃ sā aniccatā, tehi saddhiṃ saṃsandanatthaṃ vuttaṃ. Tattha ‘‘yathā parinipphannānaṃ rūpādīnaṃ aniccatājarāmaraṇāni atthi, evaṃ parinipphannānaṃ aniccatādīnaṃ tāni natthī’’ti maññamāno ekantena paṭikkhipatiyevāti."
    ],
    "innerText": "629.Rūpaṃ parinipphannantiādi yesaṃ sā aniccatā, tehi saddhiṃ saṃsandanatthaṃ vuttaṃ. Tattha ‘‘yathā parinipphannānaṃ rūpādīnaṃ aniccatājarāmaraṇāni atthi, evaṃ parinipphannānaṃ aniccatādīnaṃ tāni natthī’’ti maññamāno ekantena paṭikkhipatiyevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aniccatākathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ekādasamo vaggo."
  }
]