[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Pucchāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paccayānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ekamūlakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(1.) Kusalapadaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". Siyā ",
      " kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā. Siyā kusalaṃ dhammaṃ paṭicca akusalo dhammo uppajjeyya hetupaccayā. Siyā kusalaṃ dhammaṃ paṭicca abyākato dhammo uppajjeyya hetupaccayā. Siyā kusalaṃ dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalaṃ dhammaṃ paṭicca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalaṃ dhammaṃ paṭicca kusalo ca akusalo ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalaṃ dhammaṃ paṭicca kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā."
    ],
    "innerText": "25. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā. Siyā kusalaṃ dhammaṃ paṭicca akusalo dhammo uppajjeyya hetupaccayā. Siyā kusalaṃ dhammaṃ paṭicca abyākato dhammo uppajjeyya hetupaccayā. Siyā kusalaṃ dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalaṃ dhammaṃ paṭicca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalaṃ dhammaṃ paṭicca kusalo ca akusalo ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalaṃ dhammaṃ paṭicca kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(2) Akusalapadaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". Siyā akusalaṃ dhammaṃ paṭicca akusalo dhammo uppajjeyya hetupaccayā. Siyā akusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā. Siyā akusalaṃ dhammaṃ paṭicca abyākato dhammo uppajjeyya hetupaccayā ",
      ". Siyā akusalaṃ dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā akusalaṃ dhammaṃ paṭicca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā ",
      ". Siyā akusalaṃ dhammaṃ paṭicca kusalo ca akusalo ca dhammā uppajjeyyuṃ hetupaccayā. Siyā akusalaṃ dhammaṃ paṭicca kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā."
    ],
    "innerText": "26. Siyā akusalaṃ dhammaṃ paṭicca akusalo dhammo uppajjeyya hetupaccayā. Siyā akusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā. Siyā akusalaṃ dhammaṃ paṭicca abyākato dhammo uppajjeyya hetupaccayā . Siyā akusalaṃ dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā akusalaṃ dhammaṃ paṭicca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā . Siyā akusalaṃ dhammaṃ paṭicca kusalo ca akusalo ca dhammā uppajjeyyuṃ hetupaccayā. Siyā akusalaṃ dhammaṃ paṭicca kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(3) Abyākatapadaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      ". Siyā abyākataṃ dhammaṃ paṭicca abyākato dhammo uppajjeyya hetupaccayā. Siyā abyākataṃ ",
      " dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā. Siyā abyākataṃ dhammaṃ paṭicca akusalo dhammo uppajjeyya hetupaccayā. Siyā abyākataṃ dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā abyākataṃ dhammaṃ paṭicca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā abyākataṃ dhammaṃ paṭicca kusalo ca akusalo ca dhammā uppajjeyyuṃ hetupaccayā. Siyā abyākataṃ dhammaṃ paṭicca kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā."
    ],
    "innerText": "27. Siyā abyākataṃ dhammaṃ paṭicca abyākato dhammo uppajjeyya hetupaccayā. Siyā abyākataṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā. Siyā abyākataṃ dhammaṃ paṭicca akusalo dhammo uppajjeyya hetupaccayā. Siyā abyākataṃ dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā abyākataṃ dhammaṃ paṭicca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā abyākataṃ dhammaṃ paṭicca kusalo ca akusalo ca dhammā uppajjeyyuṃ hetupaccayā. Siyā abyākataṃ dhammaṃ paṭicca kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(4) Kusalābyākatapadaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      ". Siyā kusalañca abyākatañca dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā. Siyā kusalañca abyākatañca dhammaṃ paṭicca akusalo dhammo uppajjeyya hetupaccayā. Siyā kusalañca abyākatañca dhammaṃ paṭicca abyākato dhammo uppajjeyya hetupaccayā. Siyā kusalañca abyākatañca dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca abyākatañca ",
      " dhammaṃ paṭicca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca abyākatañca dhammaṃ paṭicca kusalo ca akusalo ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca abyākatañca dhammaṃ paṭicca kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā."
    ],
    "innerText": "28. Siyā kusalañca abyākatañca dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā. Siyā kusalañca abyākatañca dhammaṃ paṭicca akusalo dhammo uppajjeyya hetupaccayā. Siyā kusalañca abyākatañca dhammaṃ paṭicca abyākato dhammo uppajjeyya hetupaccayā. Siyā kusalañca abyākatañca dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca abyākatañca dhammaṃ paṭicca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca abyākatañca dhammaṃ paṭicca kusalo ca akusalo ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca abyākatañca dhammaṃ paṭicca kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(5) Akusalābyākatapadaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "29"
      },
      ". Siyā ",
      " akusalañca abyākatañca dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā. Siyā akusalañca abyākatañca dhammaṃ paṭicca akusalo dhammo uppajjeyya hetupaccayā. Siyā akusalañca abyākatañca dhammaṃ paṭicca abyākato dhammo uppajjeyya hetupaccayā. Siyā akusalañca abyākatañca dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā akusalañca abyākatañca dhammaṃ paṭicca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā akusalañca abyākatañca dhammaṃ paṭicca kusalo ca akusalo ca dhammā uppajjeyyuṃ hetupaccayā. Siyā akusalañca abyākatañca dhammaṃ paṭicca kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā."
    ],
    "innerText": "29. Siyā akusalañca abyākatañca dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā. Siyā akusalañca abyākatañca dhammaṃ paṭicca akusalo dhammo uppajjeyya hetupaccayā. Siyā akusalañca abyākatañca dhammaṃ paṭicca abyākato dhammo uppajjeyya hetupaccayā. Siyā akusalañca abyākatañca dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā akusalañca abyākatañca dhammaṃ paṭicca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā akusalañca abyākatañca dhammaṃ paṭicca kusalo ca akusalo ca dhammā uppajjeyyuṃ hetupaccayā. Siyā akusalañca abyākatañca dhammaṃ paṭicca kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(6) Kusalākusalapadaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ". Siyā ",
      " kusalañca akusalañca dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā. Siyā kusalañca akusalañca dhammaṃ paṭicca akusalo dhammo uppajjeyya hetupaccayā. Siyā kusalañca akusalañca dhammaṃ paṭicca abyākato dhammo uppajjeyya hetupaccayā. Siyā kusalañca ",
      " akusalañca dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca akusalañca dhammaṃ paṭicca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca akusalañca dhammaṃ paṭicca kusalo ca akusalo ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca akusalañca dhammaṃ paṭicca kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā."
    ],
    "innerText": "30. Siyā kusalañca akusalañca dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā. Siyā kusalañca akusalañca dhammaṃ paṭicca akusalo dhammo uppajjeyya hetupaccayā. Siyā kusalañca akusalañca dhammaṃ paṭicca abyākato dhammo uppajjeyya hetupaccayā. Siyā kusalañca akusalañca dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca akusalañca dhammaṃ paṭicca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca akusalañca dhammaṃ paṭicca kusalo ca akusalo ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca akusalañca dhammaṃ paṭicca kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(7) Kusalākusalābyākatapadaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ". Siyā kusalañca akusalañca abyākatañca dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā. Siyā kusalañca akusalañca abyākatañca dhammaṃ paṭicca akusalo dhammo uppajjeyya hetupaccayā. Siyā kusalañca akusalañca abyākatañca dhammaṃ paṭicca abyākato dhammo uppajjeyya ",
      " hetupaccayā. Siyā kusalañca akusalañca abyākatañca dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca akusalañca abyākatañca dhammaṃ paṭicca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca akusalañca abyākatañca dhammaṃ paṭicca kusalo ca akusalo ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca akusalañca abyākatañca dhammaṃ paṭicca kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā."
    ],
    "innerText": "31. Siyā kusalañca akusalañca abyākatañca dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā. Siyā kusalañca akusalañca abyākatañca dhammaṃ paṭicca akusalo dhammo uppajjeyya hetupaccayā. Siyā kusalañca akusalañca abyākatañca dhammaṃ paṭicca abyākato dhammo uppajjeyya hetupaccayā. Siyā kusalañca akusalañca abyākatañca dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca akusalañca abyākatañca dhammaṃ paṭicca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca akusalañca abyākatañca dhammaṃ paṭicca kusalo ca akusalo ca dhammā uppajjeyyuṃ hetupaccayā. Siyā kusalañca akusalañca abyākatañca dhammaṃ paṭicca kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Hetupaccayavāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "32"
      },
      ". Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya ārammaṇapaccayā ",
      "."
    ],
    "innerText": "32. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya ārammaṇapaccayā ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Yathā hetupaccayo vitthārito, evaṃ ārammaṇapaccayopi vitthāretabbo vācanāmaggena.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "33"
      },
      ". Siyā ",
      " kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya adhipatipaccayā… anantarapaccayā… samanantarapaccayā… sahajātapaccayā… aññamaññapaccayā… nissayapaccayā… upanissayapaccayā… purejātapaccayā… pacchājātapaccayā… āsevanapaccayā… kammapaccayā… vipākapaccayā… āhārapaccayā… indriyapaccayā… jhānapaccayā… maggapaccayā… sampayuttapaccayā… vippayuttapaccayā… atthipaccayā… natthipaccayā… vigatapaccayā."
    ],
    "innerText": "33. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya adhipatipaccayā… anantarapaccayā… samanantarapaccayā… sahajātapaccayā… aññamaññapaccayā… nissayapaccayā… upanissayapaccayā… purejātapaccayā… pacchājātapaccayā… āsevanapaccayā… kammapaccayā… vipākapaccayā… āhārapaccayā… indriyapaccayā… jhānapaccayā… maggapaccayā… sampayuttapaccayā… vippayuttapaccayā… atthipaccayā… natthipaccayā… vigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "34"
      },
      ". Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya avigatapaccayā…pe… akusalaṃ dhammaṃ paṭicca… abyākataṃ dhammaṃ paṭicca… kusalañca abyākatañca dhammaṃ paṭicca… akusalañca abyākatañca dhammaṃ paṭicca… kusalañca akusalañca dhammaṃ paṭicca… kusalañca akusalañca abyākatañca dhammaṃ paṭicca kusalo dhammo uppajjeyya… akusalo dhammo uppajjeyya… abyākato dhammo uppajjeyya… kusalo ca abyākato ca dhammā uppajjeyyuṃ… akusalo ",
      " ca abyākato ca dhammā uppajjeyyuṃ… kusalo ca akusalo ca dhammā uppajjeyyuṃ… kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ avigatapaccayā."
    ],
    "innerText": "34. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya avigatapaccayā…pe… akusalaṃ dhammaṃ paṭicca… abyākataṃ dhammaṃ paṭicca… kusalañca abyākatañca dhammaṃ paṭicca… akusalañca abyākatañca dhammaṃ paṭicca… kusalañca akusalañca dhammaṃ paṭicca… kusalañca akusalañca abyākatañca dhammaṃ paṭicca kusalo dhammo uppajjeyya… akusalo dhammo uppajjeyya… abyākato dhammo uppajjeyya… kusalo ca abyākato ca dhammā uppajjeyyuṃ… akusalo ca abyākato ca dhammā uppajjeyyuṃ… kusalo ca akusalo ca dhammā uppajjeyyuṃ… kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ avigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Yathā hetupaccayo vitthārito, evaṃ avigatapaccayopi vitthāretabbo vācanāmaggena.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ekamūlakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Dumūlakādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetumūlakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ". Siyā ",
      " kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā ārammaṇapaccayā…pe… siyā kusalañca akusalañca abyākatañca dhammaṃ paṭicca kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā ārammaṇapaccayā."
    ],
    "innerText": "35. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā ārammaṇapaccayā…pe… siyā kusalañca akusalañca abyākatañca dhammaṃ paṭicca kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā ārammaṇapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ". Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā adhipatipaccayā ",
      " …pe… hetupaccayā anantarapaccayā… hetupaccayā samanantarapaccayā…pe… hetupaccayā avigatapaccayā."
    ],
    "innerText": "36. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā adhipatipaccayā …pe… hetupaccayā anantarapaccayā… hetupaccayā samanantarapaccayā…pe… hetupaccayā avigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dumūlakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ". Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā ārammaṇapaccayā adhipatipaccayā…pe… hetupaccayā ārammaṇapaccayā anantarapaccayā…pe… hetupaccayā ārammaṇapaccayā avigatapaccayā."
    ],
    "innerText": "37. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā ārammaṇapaccayā adhipatipaccayā…pe… hetupaccayā ārammaṇapaccayā anantarapaccayā…pe… hetupaccayā ārammaṇapaccayā avigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Timūlakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "38"
      },
      ". Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā ārammaṇapaccayā adhipatipaccayā anantarapaccayā…pe… hetupaccayā ārammaṇapaccayā adhipatipaccayā avigatapaccayā."
    ],
    "innerText": "38. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā ārammaṇapaccayā adhipatipaccayā anantarapaccayā…pe… hetupaccayā ārammaṇapaccayā adhipatipaccayā avigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catumūlakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Pañcamūlakādikā saṃkhittā. Ekamūlakaṃ, dumūlakaṃ, timūlakaṃ, catumūlakaṃ, pañcamūlakaṃ, sabbamūlakaṃ asammuyhantena vitthāretabbaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Hetumūlakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ārammaṇamūlakādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "39"
      },
      ". Siyā ",
      " kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya ārammaṇapaccayā hetupaccayā… ārammaṇapaccayā adhipatipaccayā…pe… ārammaṇapaccayā avigatapaccayā."
    ],
    "innerText": "39. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya ārammaṇapaccayā hetupaccayā… ārammaṇapaccayā adhipatipaccayā…pe… ārammaṇapaccayā avigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya adhipatipaccayā… anantarapaccayā… samanantarapaccayā… sahajātapaccayā… aññamaññapaccayā…pe… avigatapaccayā ",
      " hetupaccayā… avigatapaccayā ārammaṇapaccayā… avigatapaccayā adhipatipaccayā…pe… avigatapaccayā vigatapaccayā."
    ],
    "innerText": "Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya adhipatipaccayā… anantarapaccayā… samanantarapaccayā… sahajātapaccayā… aññamaññapaccayā…pe… avigatapaccayā hetupaccayā… avigatapaccayā ārammaṇapaccayā… avigatapaccayā adhipatipaccayā…pe… avigatapaccayā vigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dumūlakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ". Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya avigatapaccayā hetupaccayā ārammaṇapaccayā… avigatapaccayā hetupaccayā adhipatipaccayā… avigatapaccayā hetupaccayā anantarapaccayā…pe… avigatapaccayā hetupaccayā vigatapaccayā."
    ],
    "innerText": "40. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya avigatapaccayā hetupaccayā ārammaṇapaccayā… avigatapaccayā hetupaccayā adhipatipaccayā… avigatapaccayā hetupaccayā anantarapaccayā…pe… avigatapaccayā hetupaccayā vigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ". Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya avigatapaccayā hetupaccayā ārammaṇapaccayā adhipatipaccayā… avigatapaccayā hetupaccayā ārammaṇapaccayā anantarapaccayā…pe… vigatapaccayā."
    ],
    "innerText": "41. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya avigatapaccayā hetupaccayā ārammaṇapaccayā adhipatipaccayā… avigatapaccayā hetupaccayā ārammaṇapaccayā anantarapaccayā…pe… vigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Ekekassa padassa ekamūlakaṃ, dumūlakaṃ, timūlakaṃ, catumūlakaṃ, pañcamūlakaṃ, sabbamūlakaṃ asammuyhantena vitthāretabbaṃ. )"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "(Ka) tikañca paṭṭhānavaraṃ dukuttamaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dukaṃ tikañceva tikaṃ dukañca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tikaṃ tikañceva dukaṃ dukañca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cha anulomamhi nayā sugambhīrāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Paccayapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42"
      },
      ". Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya nahetupaccayā ",
      "."
    ],
    "innerText": "42. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya nahetupaccayā ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "(Yathā ",
      " anulome hetupaccayo vitthārito, evaṃ paccanīyepi nahetupaccayo vitthāretabbo.)"
    ],
    "innerText": "(Yathā anulome hetupaccayo vitthārito, evaṃ paccanīyepi nahetupaccayo vitthāretabbo.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "43"
      },
      ". Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya naārammaṇapaccayā… naadhipatipaccayā… naanantarapaccayā… nasamanantarapaccayā… nasahajātapaccayā… naaññamaññapaccayā… nanissayapaccayā… naupanissayapaccayā… napurejātapaccayā… napacchājātapaccayā ",
      " … naāsevanapaccayā… nakammapaccayā… navipākapaccayā… naāhārapaccayā… naindriyapaccayā… najhānapaccayā… namaggapaccayā… nasampayuttapaccayā… navippayuttapaccayā… noatthipaccayā… nonatthipaccayā… novigatapaccayā… noavigatapaccayā."
    ],
    "innerText": "43. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya naārammaṇapaccayā… naadhipatipaccayā… naanantarapaccayā… nasamanantarapaccayā… nasahajātapaccayā… naaññamaññapaccayā… nanissayapaccayā… naupanissayapaccayā… napurejātapaccayā… napacchājātapaccayā … naāsevanapaccayā… nakammapaccayā… navipākapaccayā… naāhārapaccayā… naindriyapaccayā… najhānapaccayā… namaggapaccayā… nasampayuttapaccayā… navippayuttapaccayā… noatthipaccayā… nonatthipaccayā… novigatapaccayā… noavigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44"
      },
      ". Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya nahetupaccayā naārammaṇapaccayā…."
    ],
    "innerText": "44. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya nahetupaccayā naārammaṇapaccayā…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Yathā anulome ekekassa padassa ekamūlakaṃ, dumūlakaṃ, timūlakaṃ, catumūlakaṃ, yāva tevīsatimūlakaṃ evaṃ paccanīyepi vitthāretabbaṃ. )"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "(Kha) tikañca paṭṭhānavaraṃ dukuttamaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dukaṃ tikañceva tikaṃ dukañca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tikaṃ tikañceva dukaṃ dukañca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cha paccanīyamhi nayā sugambhīrāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Paccayānulomapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "45"
      },
      ". Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā naārammaṇapaccayā… siyā kusalaṃ dhammaṃ paṭicca akusalo dhammo uppajjeyya hetupaccayā naārammaṇapaccayā."
    ],
    "innerText": "45. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā naārammaṇapaccayā… siyā kusalaṃ dhammaṃ paṭicca akusalo dhammo uppajjeyya hetupaccayā naārammaṇapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "(Yathā anulome hetupaccayo vitthārito, evaṃ anulomapaccanīyepi padaṃ ",
      " vitthāretabbaṃ.)"
    ],
    "innerText": "(Yathā anulome hetupaccayo vitthārito, evaṃ anulomapaccanīyepi padaṃ vitthāretabbaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "46"
      },
      ". Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā naadhipatipaccayā… hetupaccayā naanantarapaccayā…pe… hetupaccayā noavigatapaccayā."
    ],
    "innerText": "46. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā naadhipatipaccayā… hetupaccayā naanantarapaccayā…pe… hetupaccayā noavigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "47"
      },
      ". Siyā ",
      " kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā ārammaṇapaccayā naadhipatipaccayā… hetupaccayā ārammaṇapaccayā naanantarapaccayā…pe… hetupaccayā ārammaṇapaccayā noavigatapaccayā."
    ],
    "innerText": "47. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā ārammaṇapaccayā naadhipatipaccayā… hetupaccayā ārammaṇapaccayā naanantarapaccayā…pe… hetupaccayā ārammaṇapaccayā noavigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hetupaccayā ",
      " ārammaṇapaccayā adhipatipaccayā naanantarapaccayā…pe… hetupaccayā ārammaṇapaccayā adhipatipaccayā noavigatapaccayā."
    ],
    "innerText": "Hetupaccayā ārammaṇapaccayā adhipatipaccayā naanantarapaccayā…pe… hetupaccayā ārammaṇapaccayā adhipatipaccayā noavigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetupaccayā ārammaṇapaccayā adhipatipaccayā anantarapaccayā nasamanantarapaccayā…pe… hetupaccayā ārammaṇapaccayā adhipatipaccayā anantarapaccayā noavigatapaccayā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetupaccayā ārammaṇapaccayā adhipatipaccayā anantarapaccayā samanantarapaccayā sahajātapaccayā aññamaññapaccayā nissayapaccayā upanissayapaccayā purejātapaccayā pacchājātapaccayā āsevanapaccayā kammapaccayā vipākapaccayā āhārapaccayā indriyapaccayā jhānapaccayā maggapaccayā sampayuttapaccayā vippayuttapaccayā atthipaccayā natthipaccayā vigatapaccayā noavigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "48"
      },
      ". Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya ārammaṇapaccayā… adhipatipaccayā… anantarapaccayā…pe… avigatapaccayā nahetupaccayā ",
      "… avigatapaccayā naārammaṇapaccayā…pe… avigatapaccayā novigatapaccayā."
    ],
    "innerText": "48. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya ārammaṇapaccayā… adhipatipaccayā… anantarapaccayā…pe… avigatapaccayā nahetupaccayā … avigatapaccayā naārammaṇapaccayā…pe… avigatapaccayā novigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Avigatapaccayā hetupaccayā naārammaṇapaccayā…pe… avigatapaccayā hetupaccayā novigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Avigatapaccayā hetupaccayā ārammaṇapaccayā naadhipatipaccayā…pe… avigatapaccayā hetupaccayā ārammaṇapaccayā novigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Avigatapaccayā hetupaccayā ārammaṇapaccayā adhipatipaccayā anantarapaccayā samanantarapaccayā sahajātapaccayā…pe… novigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "(Ga) tikañca paṭṭhānavaraṃ dukuttamaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dukaṃ tikañceva tikaṃ dukañca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tikaṃ tikañceva dukaṃ dukañca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cha anulomapaccanīyamhi nayā sugambhīrāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Paccayapaccanīyānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "49"
      },
      ". Siyā ",
      " kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya nahetupaccayā ārammaṇapaccayā. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya nahetupaccayā adhipatipaccayā…pe… nahetupaccayā avigatapaccayā."
    ],
    "innerText": "49. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya nahetupaccayā ārammaṇapaccayā. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya nahetupaccayā adhipatipaccayā…pe… nahetupaccayā avigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50"
      },
      ". Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya nahetupaccayā naārammaṇapaccayā adhipatipaccayā…pe… avigatapaccayā."
    ],
    "innerText": "50. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya nahetupaccayā naārammaṇapaccayā adhipatipaccayā…pe… avigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nahetupaccayā naārammaṇapaccayā naadhipatipaccayā…pe… avigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nahetupaccayā naārammaṇapaccayā naadhipatipaccayā naanantarapaccayā nasamanantarapaccayā…pe… noatthipaccayā nonatthipaccayā novigatapaccayā avigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "51"
      },
      ". Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya naārammaṇapaccayā ",
      " hetupaccayā."
    ],
    "innerText": "51. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya naārammaṇapaccayā hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "52"
      },
      ". Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya naārammaṇapaccayā adhipatipaccayā…pe… naārammaṇapaccayā avigatapaccayā…pe… noavigatapaccayā hetupaccayā… noavigatapaccayā ārammaṇapaccayā…pe… noavigatapaccayā vigatapaccayā."
    ],
    "innerText": "52. Siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya naārammaṇapaccayā adhipatipaccayā…pe… naārammaṇapaccayā avigatapaccayā…pe… noavigatapaccayā hetupaccayā… noavigatapaccayā ārammaṇapaccayā…pe… noavigatapaccayā vigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Noavigatapaccayā nahetupaccayā ārammaṇapaccayā…pe… noavigatapaccayā nahetupaccayā vigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Noavigatapaccayā nahetupaccayā naārammaṇapaccayā naadhipatipaccayā…pe… noatthipaccayā nonatthipaccayā vigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "(Gha) tikañca ",
      " paṭṭhānavaraṃ dukuttamaṃ,"
    ],
    "innerText": "(Gha) tikañca paṭṭhānavaraṃ dukuttamaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dukaṃ tikañceva tikaṃ dukañca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tikaṃ tikañceva dukaṃ dukañca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cha paccanīyānulomamhi nayā sugambhīrāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pucchāvāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niddesavāre tevīsatipaccayā."
  }
]