[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Dhātukathāmātikā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " vibhaṅgamātikānantaraṃ –"
    ],
    "innerText": "Idāni vibhaṅgamātikānantaraṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ayaṃ dhātukathādīnaṃ, sampattā atthavaṇṇanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mātikānaṃ yato tasmā, pañcannampi yathārahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Anuttānatthato ceva, saṅkhepenatthanicchayā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vibhaṅganayato ceva, hoti saṃvaṇṇanānayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha dhātukathāmātikāya tāva saṃvaṇṇanā hoti. Sā panesā nikkhepato pañcadhā ṭhitā – nayamātikā abbhantaramātikā nayamukhamātikā lakkhaṇamātikā bāhiramātikāti. Tattha ‘‘saṅgaho, asaṅgaho…pe… vippayuttena saṅgahitaṃ asaṅgahita’’nti ayaṃ cuddasahi padehi nikkhittā saṅgahādikena nayena dhātukathāya dhammā vibhattāti dassetuṃ ṭhapitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nayamātikā"
      },
      " nāma, yā ‘‘mūlamātikā’’tipi vuccati."
    ],
    "innerText": "Tattha dhātukathāmātikāya tāva saṃvaṇṇanā hoti. Sā panesā nikkhepato pañcadhā ṭhitā – nayamātikā abbhantaramātikā nayamukhamātikā lakkhaṇamātikā bāhiramātikāti. Tattha ‘‘saṅgaho, asaṅgaho…pe… vippayuttena saṅgahitaṃ asaṅgahita’’nti ayaṃ cuddasahi padehi nikkhittā saṅgahādikena nayena dhātukathāya dhammā vibhattāti dassetuṃ ṭhapitattā nayamātikā nāma, yā ‘‘mūlamātikā’’tipi vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcakkhandhā…pe… manasikāro’’ti ayaṃ pañcavīsādhikena padasatena nikkhittā saṅgahādinayena vibhajitabbabhāvena dhātukathāya abbhantare eva ṭhapitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abbhantaramātikā"
      },
      " nāma, yā ‘‘dhātukathāmātikā’’tipi vuccati."
    ],
    "innerText": "‘‘Pañcakkhandhā…pe… manasikāro’’ti ayaṃ pañcavīsādhikena padasatena nikkhittā saṅgahādinayena vibhajitabbabhāvena dhātukathāya abbhantare eva ṭhapitattā abbhantaramātikā nāma, yā ‘‘dhātukathāmātikā’’tipi vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tīhi saṅgaho, tīhi asaṅgaho, catūhi sampayogo, catūhi vippayogo’’ti ayaṃ catūhi padehi nikkhittā khandhādīsu ca kusalattikādīsu ca mātikādhammesu tīhi khandhāyatanadhātupadeheva ",
      " saṅgaho asaṅgaho ca, tathā catūhi arūpakkhandhehi sampayogo, vippayogo cāti imesaṃ saṅgahāsaṅgahādīnaṃ nayānaṃ mukhānīti dassetuṃ ṭhapitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nayamukhamātikā"
      },
      " nāma."
    ],
    "innerText": "‘‘Tīhi saṅgaho, tīhi asaṅgaho, catūhi sampayogo, catūhi vippayogo’’ti ayaṃ catūhi padehi nikkhittā khandhādīsu ca kusalattikādīsu ca mātikādhammesu tīhi khandhāyatanadhātupadeheva saṅgaho asaṅgaho ca, tathā catūhi arūpakkhandhehi sampayogo, vippayogo cāti imesaṃ saṅgahāsaṅgahādīnaṃ nayānaṃ mukhānīti dassetuṃ ṭhapitattā nayamukhamātikā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sabhāgo ",
      " visabhāgo’’ti ayaṃ dvīhi padehi nikkhittā sabhāgavisabhāgalakkhaṇavaseneva saṅgahāsaṅgahanayā ceva sampayogavippayoganayā ca hontīti dassetuṃ ṭhapitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lakkhaṇamātikā"
      },
      " nāma. Sabbāpi dhammasaṅgaṇī dhātukathāya mātikāti ayaṃ chasaṭṭhi tikapadāni, dve ca dukapadasatāni saṅkhipitvā nikkhittā dhātukathā mātikāto bahi ṭhapitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bāhiramātikā"
      },
      " nāma. Evametissā pañcavidhāya mātikāya ayamanuttānatthavaṇṇanā."
    ],
    "innerText": "‘‘Sabhāgo visabhāgo’’ti ayaṃ dvīhi padehi nikkhittā sabhāgavisabhāgalakkhaṇavaseneva saṅgahāsaṅgahanayā ceva sampayogavippayoganayā ca hontīti dassetuṃ ṭhapitattā lakkhaṇamātikā nāma. Sabbāpi dhammasaṅgaṇī dhātukathāya mātikāti ayaṃ chasaṭṭhi tikapadāni, dve ca dukapadasatāni saṅkhipitvā nikkhittā dhātukathā mātikāto bahi ṭhapitattā bāhiramātikā nāma. Evametissā pañcavidhāya mātikāya ayamanuttānatthavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅgaho"
      },
      "tiādīsu hi saṅgaho tāva jātisañjātikiriyāgaṇanavasena catubbidho. Tattha ‘‘sabbe khattiyā āgacchantu, yā cāvuso visākha, sammāvācā, yo ca sammākammanto, yo ca sammāājīvo, ime dhammā sīlakkhandhe saṅgahitā’’ti (ma. ni. 1.462) ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jātisaṅgaho"
      },
      " nāma. ‘‘Sabbe kosalakā āgacchantu, yo cāvuso visākha, sammāvāyāmo, yā ca sammāsati, yo ca sammāsamādhi, ime dhammā samādhikkhandhe saṅgahitā’’ti (ma. ni. 1.462) ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sañjātisaṅgaho"
      },
      " nāma, ekaṭṭhāne jātisambandhabhāvena saṅgahoti attho. ‘‘Sabbe hatthārohā āgacchantu, yā cāvuso visākha, sammādiṭṭhi, yo ca sammāsaṅkappo, ime dhammā paññākkhandhe saṅgahitā’’ti (ma. ni. 1.462) ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiriyāsaṅgaho"
      },
      " nāma. ‘‘Hañci cakkhāyatanaṃ rūpakkhandhagaṇanaṃ gacchati, tena vata re vattabbe ‘cakkhāyatanaṃ rūpakkhandhena saṅgahita’’’nti (kathā. 471) ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gaṇanasaṅgaho"
      },
      " nāma, ayamidha adhippeto. Tappaṭipakkhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asaṅgaho"
      },
      " veditabbo. Tesaṃ vikappato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅgahitena asaṅgahitādīni,"
      },
      " ekuppādekanirodhaekavatthukaekārammaṇatāvasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampayogo,"
      },
      " tappaṭipakkhato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vippayogo,"
      },
      " tesaṃ vikappato sampayuttena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vippayuttādīni,"
      },
      " tadubhayasaṃsaggavikappato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅgahitena sampayuttaṃ vippayutta"
      },
      "ntiādīni ca ",
      " veditabbāni. Sesaṃ vuttatthameva. Ayaṃ tāvettha anuttānapadattho."
    ],
    "innerText": "Saṅgahotiādīsu hi saṅgaho tāva jātisañjātikiriyāgaṇanavasena catubbidho. Tattha ‘‘sabbe khattiyā āgacchantu, yā cāvuso visākha, sammāvācā, yo ca sammākammanto, yo ca sammāājīvo, ime dhammā sīlakkhandhe saṅgahitā’’ti (ma. ni. 1.462) ayaṃ jātisaṅgaho nāma. ‘‘Sabbe kosalakā āgacchantu, yo cāvuso visākha, sammāvāyāmo, yā ca sammāsati, yo ca sammāsamādhi, ime dhammā samādhikkhandhe saṅgahitā’’ti (ma. ni. 1.462) ayaṃ sañjātisaṅgaho nāma, ekaṭṭhāne jātisambandhabhāvena saṅgahoti attho. ‘‘Sabbe hatthārohā āgacchantu, yā cāvuso visākha, sammādiṭṭhi, yo ca sammāsaṅkappo, ime dhammā paññākkhandhe saṅgahitā’’ti (ma. ni. 1.462) ayaṃ kiriyāsaṅgaho nāma. ‘‘Hañci cakkhāyatanaṃ rūpakkhandhagaṇanaṃ gacchati, tena vata re vattabbe ‘cakkhāyatanaṃ rūpakkhandhena saṅgahita’’’nti (kathā. 471) ayaṃ gaṇanasaṅgaho nāma, ayamidha adhippeto. Tappaṭipakkhena asaṅgaho veditabbo. Tesaṃ vikappato saṅgahitena asaṅgahitādīni, ekuppādekanirodhaekavatthukaekārammaṇatāvasena sampayogo, tappaṭipakkhato vippayogo, tesaṃ vikappato sampayuttena vippayuttādīni, tadubhayasaṃsaggavikappato saṅgahitena sampayuttaṃ vippayuttantiādīni ca veditabbāni. Sesaṃ vuttatthameva. Ayaṃ tāvettha anuttānapadattho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Saṅgahāsaṅgahapadatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthavinicchayato"
      },
      " pana yasmā abbhantaramātikāya rūpakkhandhādīni, bāhiramātikāya kusalādīni ca ‘‘saṅgaho asaṅgaho’’tiādikehi nayamātikāpadehi ‘‘tīhi saṅgaho, tīhi asaṅgaho’’tiādinayamukhamātikāvasena ",
      " yathārahaṃ niddesatthāya bhagavatā ṭhapitāni, tasmā khandhādīnaṃ saṅgahādīnaṃ pāḷiyaṃ vuttānusāreneva saṅkhepato atthavinicchayo hoti. Iminā nayena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhaṅganayo"
      },
      " sakkā ñātunti taṃ visuṃ na vakkhāma."
    ],
    "innerText": "Atthavinicchayato pana yasmā abbhantaramātikāya rūpakkhandhādīni, bāhiramātikāya kusalādīni ca ‘‘saṅgaho asaṅgaho’’tiādikehi nayamātikāpadehi ‘‘tīhi saṅgaho, tīhi asaṅgaho’’tiādinayamukhamātikāvasena yathārahaṃ niddesatthāya bhagavatā ṭhapitāni, tasmā khandhādīnaṃ saṅgahādīnaṃ pāḷiyaṃ vuttānusāreneva saṅkhepato atthavinicchayo hoti. Iminā nayena vibhaṅganayo sakkā ñātunti taṃ visuṃ na vakkhāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha saṅgahāsaṅgahavāre khandhānaṃ tāva ayaṃ niddese nayo – rūpakkhandho ekena khandhena ekādasahi āyatanehi ekādasahi dhātūhi saṅgahito. Catūhi khandhehi ekenāyatanena sattahi dhātūhi asaṅgahito. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekādasahī"
      },
      "ti manāyatanavajjehi. Dhammāyatanenāpi hi keci rūpadhammā saṅgahitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekādasahī"
      },
      "ti sattaviññāṇadhātuvajjāhi. Sesaṃ suviññeyyameva."
    ],
    "innerText": "Tattha saṅgahāsaṅgahavāre khandhānaṃ tāva ayaṃ niddese nayo – rūpakkhandho ekena khandhena ekādasahi āyatanehi ekādasahi dhātūhi saṅgahito. Catūhi khandhehi ekenāyatanena sattahi dhātūhi asaṅgahito. Tattha ekādasahīti manāyatanavajjehi. Dhammāyatanenāpi hi keci rūpadhammā saṅgahitā. Ekādasahīti sattaviññāṇadhātuvajjāhi. Sesaṃ suviññeyyameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vedanādayo tayo khandhā yathāsakaṃ ekena khandhena ekenāyatanena ekāya dhātuyā saṅgahitā, catūhi khandhehi ekādasahi āyatanehi sattarasahi dhātūhi asaṅgahitā, tathā viññāṇakkhandhopi. Kevalaṃ panettha sattahi viññāṇadhātūhi saṅgahito, ekādasahi dhātūhi asaṅgahitoti ettakameva viseso. Tattha hi vedanādīnaṃ tiṇṇaṃ khandhānaṃ ekena dhammāyatanena ca ekāya dhammadhātuyā ca saṅgahitatā veditabbā. Pāḷiyaṃ panettha khandhapadaniddese, upari āyatanādiniddesesu ca ‘‘rūpakkhandho ca vedanākkhandho ca dvīhi khandhehi ekādasahāyatanehi ekādasahi ",
      " dhātūhi saṅgahitā’’tiādinā (dhātu. 15) dvimūlakādinayenāpi vitthāranayo vibhatto, sopi iminā ekamūlanayānusārena sabbattha suviññeyyoti na vitthārayimhā. Ayaṃ khandhapadaniddesanayo."
    ],
    "innerText": "Vedanādayo tayo khandhā yathāsakaṃ ekena khandhena ekenāyatanena ekāya dhātuyā saṅgahitā, catūhi khandhehi ekādasahi āyatanehi sattarasahi dhātūhi asaṅgahitā, tathā viññāṇakkhandhopi. Kevalaṃ panettha sattahi viññāṇadhātūhi saṅgahito, ekādasahi dhātūhi asaṅgahitoti ettakameva viseso. Tattha hi vedanādīnaṃ tiṇṇaṃ khandhānaṃ ekena dhammāyatanena ca ekāya dhammadhātuyā ca saṅgahitatā veditabbā. Pāḷiyaṃ panettha khandhapadaniddese, upari āyatanādiniddesesu ca ‘‘rūpakkhandho ca vedanākkhandho ca dvīhi khandhehi ekādasahāyatanehi ekādasahi dhātūhi saṅgahitā’’tiādinā (dhātu. 15) dvimūlakādinayenāpi vitthāranayo vibhatto, sopi iminā ekamūlanayānusārena sabbattha suviññeyyoti na vitthārayimhā. Ayaṃ khandhapadaniddesanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Āyatanadhātupadānampi khandhapade vuttānusāreneva tīhi saṅgaho, tīhi asaṅgaho ca yathāyogaṃ yojetvā ñātabbo. Kevalaṃ panettha dhammāyatanadhammadhātūsu asaṅkhatassa khandhasaṅgahābhāvā taṃ ṭhapetvā sesānaṃ khandhesu saṅgaho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saccesu dukkhasaccaṃ sabbehi khandhāyatanadhātūhi. Samudayamaggasaccāni saṅkhārakkhandhena, dhammāyatanadhammadhātūhi ca saṅgahitāni. Nirodhasaccaṃ khandhena asaṅgahitaṃ, dhammāyatanadhammadhātūhi eva saṅgahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Indriyesu jīvitindriyaṃ dvīhi rūpakkhandhasaṅkhārakkhandhehi. Sukhindriyādīni pañca vedanākkhandhena ",
      ", saddhādīni saṅkhārakkhandhena, sabbāni cetāni jīvitindriyādīni, itthindriyapurisindriyādīnipi dhammāyatanadhammadhātūhi saṅgahitāni. Sesindriyāni suviññeyyāni."
    ],
    "innerText": "Indriyesu jīvitindriyaṃ dvīhi rūpakkhandhasaṅkhārakkhandhehi. Sukhindriyādīni pañca vedanākkhandhena , saddhādīni saṅkhārakkhandhena, sabbāni cetāni jīvitindriyādīni, itthindriyapurisindriyādīnipi dhammāyatanadhammadhātūhi saṅgahitāni. Sesindriyāni suviññeyyāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭiccasamuppādesu nāmarūpaṃ viññāṇavajjitehi catūhi khandhehi, ekādasahi āyatanadhātūhi ca saṅgahitaṃ. Ettha hi pavattiyaṃ nāmarūpassāpi gahitattā saddāyatanampi gahitanti veditabbaṃ. Saḷāyatanaṃ dvīhi khandhehi, pasādaviññāṇabhūtehi chahi āyatanehi, dvādasahi dhātūhi saṅgahitaṃ. Upapattibhavo pana kāmabhavabhūto pañcahi khandhehi, saddāyatanavajjitehi ekādasahi āyatanehi, sattarasahi dhātūhi. Rūpabhavo pañcahi khandhehi, saddādicatukkaghānādittayatabbiññāṇavajjehi pañcahāyatanehi, aṭṭhahi dhātūhi ",
      " saṅgahito. Asaññībhavo ekena rūpakkhandhena, rūpadhammavasena dvīhi āyatanadhātūhi saṅgahito. Ghānādittayaṃ panettha āyatanādikiccākaraṇato āyatanadhātūhi asaṅgahitampi rūpakkhandhena saṅgahitanti daṭṭhabbaṃ. Bhavassa ca ekantamupādinnattā pavattivipākānaṃ cakkhuviññāṇādīnaṃ gahaṇepi anupādinnasaddāyatanassa idha aggahaṇaṃ daṭṭhabbaṃ. Arūpabhavo catūhi khandhehi dvīhi āyatanadhātūhi. Jātijarāmaraṇāni nāmarūpadhammānaṃ lakkhaṇattā dvīhi rūpakkhandhasaṅkhārakkhandhehi. Sokadukkhadomanassāni vedanākkhandhena. Upāyāso saṅkhārakkhandhena, dhammāyatanadhammadhātūhi ca saṅgahito. Paridevo rūpakkhandhasaddāyatanasaddadhātūhi. Sesāni panettha paṭiccasamuppādaṅgāni, satipaṭṭhānasammappadhānā ca suviññeyyāva."
    ],
    "innerText": "Paṭiccasamuppādesu nāmarūpaṃ viññāṇavajjitehi catūhi khandhehi, ekādasahi āyatanadhātūhi ca saṅgahitaṃ. Ettha hi pavattiyaṃ nāmarūpassāpi gahitattā saddāyatanampi gahitanti veditabbaṃ. Saḷāyatanaṃ dvīhi khandhehi, pasādaviññāṇabhūtehi chahi āyatanehi, dvādasahi dhātūhi saṅgahitaṃ. Upapattibhavo pana kāmabhavabhūto pañcahi khandhehi, saddāyatanavajjitehi ekādasahi āyatanehi, sattarasahi dhātūhi. Rūpabhavo pañcahi khandhehi, saddādicatukkaghānādittayatabbiññāṇavajjehi pañcahāyatanehi, aṭṭhahi dhātūhi saṅgahito. Asaññībhavo ekena rūpakkhandhena, rūpadhammavasena dvīhi āyatanadhātūhi saṅgahito. Ghānādittayaṃ panettha āyatanādikiccākaraṇato āyatanadhātūhi asaṅgahitampi rūpakkhandhena saṅgahitanti daṭṭhabbaṃ. Bhavassa ca ekantamupādinnattā pavattivipākānaṃ cakkhuviññāṇādīnaṃ gahaṇepi anupādinnasaddāyatanassa idha aggahaṇaṃ daṭṭhabbaṃ. Arūpabhavo catūhi khandhehi dvīhi āyatanadhātūhi. Jātijarāmaraṇāni nāmarūpadhammānaṃ lakkhaṇattā dvīhi rūpakkhandhasaṅkhārakkhandhehi. Sokadukkhadomanassāni vedanākkhandhena. Upāyāso saṅkhārakkhandhena, dhammāyatanadhammadhātūhi ca saṅgahito. Paridevo rūpakkhandhasaddāyatanasaddadhātūhi. Sesāni panettha paṭiccasamuppādaṅgāni, satipaṭṭhānasammappadhānā ca suviññeyyāva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iddhipādā dvīhi khandhehi, āyatanehi, dhātūhi saṅgahitā. Ettha ca cittiddhipādassa dhammadhātumanoviññāṇadhātuniyamato soḷasahi dhātūhi asaṅgaho veditabbo. Jhānāni dvīhi vedanāsaṅkhārakkhandhehi, ekenāyatanena, ekāya dhātuyā ca saṅgahitāni. Appamaññā ekena khandhena, ekena āyatanena, ekāya dhātuyā saṅgahitā. Evaṃ pañcindriyādīnipi. Kevalaṃ pana cittaṃ sattahi viññāṇadhātūhi saṅgahitanti ettakameva viseso. Sabbesampi cesa vuttāvasesehi khandhāyatanadhātūhi asaṅgahitabhāvo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iminā nayena bāhiramātikāyapi ‘‘kusalā dhammā, akusalā dhammā catūhi khandhehi, dvīhi āyatanehi, dhātūhi saṅgahitā. Abyākatā pana asaṅkhataṃ khandhato ṭhapetvā pañcahi khandhehi dvādasahi āyatanehi aṭṭhārasahi dhātūhi saṅgahitā’’tiādinā yojetvā saṅgahāsaṅgaho ñātabboti ",
      " ayamettha saṅkhepo, vitthāro pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhātukathāpāḷiaṭṭhakathāsu"
      },
      " (dhātu. 77 ādayo; dhātu. aṭṭha. 77) gahetabboti."
    ],
    "innerText": "Iminā nayena bāhiramātikāyapi ‘‘kusalā dhammā, akusalā dhammā catūhi khandhehi, dvīhi āyatanehi, dhātūhi saṅgahitā. Abyākatā pana asaṅkhataṃ khandhato ṭhapetvā pañcahi khandhehi dvādasahi āyatanehi aṭṭhārasahi dhātūhi saṅgahitā’’tiādinā yojetvā saṅgahāsaṅgaho ñātabboti ayamettha saṅkhepo, vitthāro pana dhātukathāpāḷiaṭṭhakathāsu (dhātu. 77 ādayo; dhātu. aṭṭha. 77) gahetabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niṭṭhito ‘‘saṅgaho asaṅgaho’’ti padassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Atthavinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Saṅgahitenaasaṅgahitapadatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Saṅgahitenaasaṅgahitapade sabbesaṃ rūpakkhandhādipadānaṃ niddeso na sambhavati. Yāni panettha padāni rūpekadesaṃ, arūpena asammissaṃ viññāṇekadesañca aññena asammissaṃ dīpenti, tesamidha niddeso. Tāni pana manāyatanadhammāyatanavajjitānaṃ dasāyatanānaṃ, dhammadhātuvajjitānaṃ sattarasannaṃ dhātūnaṃ, sattarūpindriyānañca vasena veditabbāni, na rūpakkhandhādīnaṃ. Teneva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāḷiyaṃ"
      },
      " –"
    ],
    "innerText": "Saṅgahitenaasaṅgahitapade sabbesaṃ rūpakkhandhādipadānaṃ niddeso na sambhavati. Yāni panettha padāni rūpekadesaṃ, arūpena asammissaṃ viññāṇekadesañca aññena asammissaṃ dīpenti, tesamidha niddeso. Tāni pana manāyatanadhammāyatanavajjitānaṃ dasāyatanānaṃ, dhammadhātuvajjitānaṃ sattarasannaṃ dhātūnaṃ, sattarūpindriyānañca vasena veditabbāni, na rūpakkhandhādīnaṃ. Teneva pāḷiyaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dasāyatanā sattarasa dhātuyo,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sattindriyā asaññābhavo ekavokārabhavo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Paridevo sanidassanasappaṭighaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anidassanaṃ punadeva sappaṭighaṃ upādā’’ti. (dhātu. 178) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ uddānagāthā vuttā. Rūpakkhandhena hi rūpakkhandhova saṅgahito, evaṃ vedanākkhandhādīhi ca vedanākkhandhādayova. Tepi ca yehi kehici āyatanadhātūhi asaṅgahitā nāma natthīti tesaṃ saṅgahitena asaṅgahitattābhāvā yathāvuttāyatanānaṃ vasenevettha atthavinicchayo hoti. Idaṃ hettha lakkhaṇaṃ – yaṃ khandhapadena saṅgahitaṃ hutvā āyatanadhātupadehi asaṅgahitaṃ, khandhāyatanapadehi vā saṅgahitaṃ hutvā dhātupadena asaṅgahitaṃ, tassa khandhāyatanadhātūhi asaṅgaho ",
      " vuccati. Kathaṃ? Cakkhāyatanena ye dhammā khandhasaṅgahena saṅgahitā, āyatanasaṅgahena, dhātusaṅgahena ca asaṅgahitā, te dhammā katihi khandhehi, āyatanehi, dhātūhi asaṅgahitā? Te dhammā catūhi khandhehi dvīhi āyatanehi ",
      " aṭṭhahi dhātūhi asaṅgahitā. Evaṃ rūpāyatanādīsupi pasādavisayabhūtesu dhātūsu, rūpindriyādīsu ca yojanakkamo veditabbo."
    ],
    "innerText": "Evaṃ uddānagāthā vuttā. Rūpakkhandhena hi rūpakkhandhova saṅgahito, evaṃ vedanākkhandhādīhi ca vedanākkhandhādayova. Tepi ca yehi kehici āyatanadhātūhi asaṅgahitā nāma natthīti tesaṃ saṅgahitena asaṅgahitattābhāvā yathāvuttāyatanānaṃ vasenevettha atthavinicchayo hoti. Idaṃ hettha lakkhaṇaṃ – yaṃ khandhapadena saṅgahitaṃ hutvā āyatanadhātupadehi asaṅgahitaṃ, khandhāyatanapadehi vā saṅgahitaṃ hutvā dhātupadena asaṅgahitaṃ, tassa khandhāyatanadhātūhi asaṅgaho vuccati. Kathaṃ? Cakkhāyatanena ye dhammā khandhasaṅgahena saṅgahitā, āyatanasaṅgahena, dhātusaṅgahena ca asaṅgahitā, te dhammā katihi khandhehi, āyatanehi, dhātūhi asaṅgahitā? Te dhammā catūhi khandhehi dvīhi āyatanehi aṭṭhahi dhātūhi asaṅgahitā. Evaṃ rūpāyatanādīsupi pasādavisayabhūtesu dhātūsu, rūpindriyādīsu ca yojanakkamo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatrāyaṃ nayo – cakkhāyatanena ye rūpadhammā khandhasaṅgahena rūpakkhandhoti saṅgahitā, āyatanadhātusaṅgahena cakkhāyatanena asaṅgahitā, cakkhudhātuyā asaṅgahitā, cakkhāyatanacakkhudhātūhi ekassevetassa cakkhussa visuṃ āyatanadhātūsu saṅgahitattā te cakkhāyatanavirahitā sabbe rūpadhammā catūhi arūpakkhandhehi cakkhāyatanaṃ manāyatananti dvīhi āyatanehi cakkhudhātu sattaviññāṇadhātūti aṭṭhahi dhātūhi asaṅgahitā. Upari rūpāyatanādīsupi eseva nayo. Imasmiṃ hi vāre cakkhāyatanassa attano tīhipi khandhāyatanadhātusaṅgahehi saṅgahitatāya asaṅgahitattābhāvā khandhasaṅgahena saṅgahitaṃ, āyatanasaṅgahena asaṅgahitaṃ, dhātusaṅgahena asaṅgahitanti evaṃ tīhipi saṅgahitāsaṅgahitavisesanehi visiṭṭhasseva ‘‘katihi khandhehī’’tiādinā khandhādīhi asaṅgahassa vuccamānattā ca arūpakkhandhehi saha bahibhūtatā veditabbā. Yathā cettha cakkhāyatanena upalakkhitānaṃ rūpadhammānaṃyeva saṅgahitena asaṅgahitatā, na cakkhāyatanassa, evaṃ upari rūpāyatanādīhi upalakkhitavārepi yathārahaṃ ñātabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sesesu pana cakkhuviññāṇadhātuyā ye dhammā khandhasaṅgahena saṅgahitā, āyatanasaṅgahena saṅgahitā, dhātusaṅgahena asaṅgahitā, te dhammā catūhi khandhehi ekādasahi āyatanehi ",
      " dvādasahi dhātūhi asaṅgahitā. Evaṃ sesaviññāṇadhātūsupi. Paṭiccasamuppādaṅgesu asaññībhavena ye dhammā…pe… te dhammā catūhi khandhehi dasahāyatanehi soḷasahi dhātūhi asaṅgahitā. Upādādhammehi ye dhammā…pe… te dhammā catūhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitāti ime cattāro vārā apubbavisesā samāyeva. Tattha cakkhuviññāṇavāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvādasahī"
      },
      "ti cha viññāṇadhātuyo vajjetvā avasesāhi dhātūhi sesā cha viññāṇadhātuyova khandhāyatanasaṅgahehi saṅgahitā, dhātusaṅgaheneva asaṅgahitā. Avasesāhi dvādasahi dhātūhi asaṅgahitāti. Esa nayo sesaviññāṇadhātūsupi."
    ],
    "innerText": "Sesesu pana cakkhuviññāṇadhātuyā ye dhammā khandhasaṅgahena saṅgahitā, āyatanasaṅgahena saṅgahitā, dhātusaṅgahena asaṅgahitā, te dhammā catūhi khandhehi ekādasahi āyatanehi dvādasahi dhātūhi asaṅgahitā. Evaṃ sesaviññāṇadhātūsupi. Paṭiccasamuppādaṅgesu asaññībhavena ye dhammā…pe… te dhammā catūhi khandhehi dasahāyatanehi soḷasahi dhātūhi asaṅgahitā. Upādādhammehi ye dhammā…pe… te dhammā catūhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitāti ime cattāro vārā apubbavisesā samāyeva. Tattha cakkhuviññāṇavāre dvādasahīti cha viññāṇadhātuyo vajjetvā avasesāhi dhātūhi sesā cha viññāṇadhātuyova khandhāyatanasaṅgahehi saṅgahitā, dhātusaṅgaheneva asaṅgahitā. Avasesāhi dvādasahi dhātūhi asaṅgahitāti. Esa nayo sesaviññāṇadhātūsupi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tīhāyatanehī"
      },
      "ti rūpāyatanadhammāyatanamanāyatanehi. Asaññibrahmaloke hi rūpāyatanadhammāyatanavasena dve āyatanāni upapattibhavabhāvena pāḷiyaṃ āgatāni, te pana khandhehi saṅgahitāni, āyatanadhātūsu asaṅgahitāni. Tadavasesāni nava rūpāyatanāni, tāni teheva ",
      " ca dvīhi manāyatanadhammāyatanehi ca asaṅgahitāni nāma honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navahi dhātūhī"
      },
      "ti rūpadhātudhammadhātūhi saddhiṃ sattahi viññāṇadhātūhi."
    ],
    "innerText": "Dutiye tīhāyatanehīti rūpāyatanadhammāyatanamanāyatanehi. Asaññibrahmaloke hi rūpāyatanadhammāyatanavasena dve āyatanāni upapattibhavabhāvena pāḷiyaṃ āgatāni, te pana khandhehi saṅgahitāni, āyatanadhātūsu asaṅgahitāni. Tadavasesāni nava rūpāyatanāni, tāni teheva ca dvīhi manāyatanadhammāyatanehi ca asaṅgahitāni nāma honti. Navahi dhātūhīti rūpadhātudhammadhātūhi saddhiṃ sattahi viññāṇadhātūhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dasahī"
      },
      "ti rūpāyatanadhammāyatanavajjehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Soḷasahī"
      },
      "ti rūpadhātudhammadhātuvajjāhi. Anidassanasappaṭighāni nāma nava oḷārikāyatanāni, tāni tehi khandhasaṅgahena saṅgahitāni, āyatanadhātusaṅgahehi ca asaṅgahitāni, rūpāyatanadhammāyatanāni dvepi sesehi āyatanadhātūhi asaṅgahitāni nāma honti."
    ],
    "innerText": "Tatiye dasahīti rūpāyatanadhammāyatanavajjehi. Soḷasahīti rūpadhātudhammadhātuvajjāhi. Anidassanasappaṭighāni nāma nava oḷārikāyatanāni, tāni tehi khandhasaṅgahena saṅgahitāni, āyatanadhātusaṅgahehi ca asaṅgahitāni, rūpāyatanadhammāyatanāni dvepi sesehi āyatanadhātūhi asaṅgahitāni nāma honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekādasahī"
      },
      "ti phoṭṭhabbāyatanavajjehi phoṭṭhabbāyatanassa upādādhammehi āyatanādīsu asaṅgahitattā. Sesaṃ ",
      " suviññeyyameva. Ayaṃ saṅgahitenaasaṅgahitapade nayo."
    ],
    "innerText": "Catutthe ekādasahīti phoṭṭhabbāyatanavajjehi phoṭṭhabbāyatanassa upādādhammehi āyatanādīsu asaṅgahitattā. Sesaṃ suviññeyyameva. Ayaṃ saṅgahitenaasaṅgahitapade nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Asaṅgahitenasaṅgahitapadatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Asaṅgahitenasaṅgahitapade pana yāni padāni viññāṇena vā oḷārikarūpena vā asammissaṃ dhammāyatanekadesaṃ dīpenti, tāneva niddisīyanti, tāni pana vedanādīnaṃ tiṇṇaṃ khandhānaṃ, dukkhasaccavajjitānaṃ tiṇṇaṃ saccānaṃ, pasādamanovajjitānaṃ soḷasannaṃ indriyānaṃ, avijjāsaṅkhāraphassavedanātaṇhupādānakammabhavajātijarāmaraṇasokadukkhadomanassupāyāsavasena cuddasapaccayākārapadānañca vasena veditabbāni, na rūpakkhandhādīnaṃ. Teneva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathāyaṃ"
      },
      " –"
    ],
    "innerText": "Asaṅgahitenasaṅgahitapade pana yāni padāni viññāṇena vā oḷārikarūpena vā asammissaṃ dhammāyatanekadesaṃ dīpenti, tāneva niddisīyanti, tāni pana vedanādīnaṃ tiṇṇaṃ khandhānaṃ, dukkhasaccavajjitānaṃ tiṇṇaṃ saccānaṃ, pasādamanovajjitānaṃ soḷasannaṃ indriyānaṃ, avijjāsaṅkhāraphassavedanātaṇhupādānakammabhavajātijarāmaraṇasokadukkhadomanassupāyāsavasena cuddasapaccayākārapadānañca vasena veditabbāni, na rūpakkhandhādīnaṃ. Teneva aṭṭhakathāyaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tayo khandhā tathā saccā, indriyāni ca soḷasa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Padāni paccayākāre, cuddasūpari cuddasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Samatiṃsa padā honti, gocchakesu dasasvatha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duve cūḷantaradukā, aṭṭha honti mahantarā’’ti. (dhātu. aṭṭha. 179) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ uddānagāthā vuttā. Idaṃ hettha lakkhaṇaṃ – yaṃ khandhapadena asaṅgahitaṃ, āyatanadhātupadehi saṅgahitaṃ, tasseva tīhi visesanehi visiṭṭhassa khandhādīhi saṅgaho vuccati. Kathaṃ? Vedanākkhandhena ye dhammā khandhasaṅgahena asaṅgahitā, āyatanadhātusaṅgahehi saṅgahitā, te dhammā katihi ",
      " khandhehi, āyatanehi, dhātūhi saṅgahitā? Te dhammā asaṅkhataṃ khandhato ṭhapetvā tīhi khandhehi ekenāyatanena ekāya dhātuyā saṅgahitāti."
    ],
    "innerText": "Evaṃ uddānagāthā vuttā. Idaṃ hettha lakkhaṇaṃ – yaṃ khandhapadena asaṅgahitaṃ, āyatanadhātupadehi saṅgahitaṃ, tasseva tīhi visesanehi visiṭṭhassa khandhādīhi saṅgaho vuccati. Kathaṃ? Vedanākkhandhena ye dhammā khandhasaṅgahena asaṅgahitā, āyatanadhātusaṅgahehi saṅgahitā, te dhammā katihi khandhehi, āyatanehi, dhātūhi saṅgahitā? Te dhammā asaṅkhataṃ khandhato ṭhapetvā tīhi khandhehi ekenāyatanena ekāya dhātuyā saṅgahitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ nayo – vedanākkhandhena hi nibbānaṃ, sukhumarūpaṃ, saññāsaṅkhārā ca khandhasaṅgahena asaṅgahitā hutvā dhammāyatanadhammadhātusaṅgahena saṅgahitā. Tesu nibbānaṃ khandhasaṅgahaṃ na ",
      " gacchati, sesā tīhi rūpasaññāsaṅkhārakkhandhehi saṅgahaṃ gacchanti, āyatanadhātuyo panettha dhammāyatanadhammadhātūnaṃ vaseneva sabbattha veditabbā itarāsaṃ asambhavā, imesu ca nibbānampi saṅgahaṃ gacchati. Teneva hi ‘‘asaṅkhataṃ khandhato ṭhapetvā’’ti vuttaṃ. Tassāyamattho – khandhasaṅgahe eva asaṅkhataṃ ṭhapetvā, na itarasaṅgahesūti evaṃ saññākkhandhādīsupi yojanā veditabbā. Ayaṃ pana viseso – jīvitindriyena ye dhammā…pe… te dhammā dvīhi vedanāsaññākkhandhehi saṅgahitā, rūpārūpajīvitindriyehi nibbānavedanāsaññāviññāṇakkhandhā khandhasaṅgahena asaṅgahitā, tesu ca nibbānavedanāsaññāva āyatanadhātusaṅgahena saṅgahitāti. Sesaṃ suviññeyyameva. Ayaṃ asaṅgahitenasaṅgahitapade nayo."
    ],
    "innerText": "Tatrāyaṃ nayo – vedanākkhandhena hi nibbānaṃ, sukhumarūpaṃ, saññāsaṅkhārā ca khandhasaṅgahena asaṅgahitā hutvā dhammāyatanadhammadhātusaṅgahena saṅgahitā. Tesu nibbānaṃ khandhasaṅgahaṃ na gacchati, sesā tīhi rūpasaññāsaṅkhārakkhandhehi saṅgahaṃ gacchanti, āyatanadhātuyo panettha dhammāyatanadhammadhātūnaṃ vaseneva sabbattha veditabbā itarāsaṃ asambhavā, imesu ca nibbānampi saṅgahaṃ gacchati. Teneva hi ‘‘asaṅkhataṃ khandhato ṭhapetvā’’ti vuttaṃ. Tassāyamattho – khandhasaṅgahe eva asaṅkhataṃ ṭhapetvā, na itarasaṅgahesūti evaṃ saññākkhandhādīsupi yojanā veditabbā. Ayaṃ pana viseso – jīvitindriyena ye dhammā…pe… te dhammā dvīhi vedanāsaññākkhandhehi saṅgahitā, rūpārūpajīvitindriyehi nibbānavedanāsaññāviññāṇakkhandhā khandhasaṅgahena asaṅgahitā, tesu ca nibbānavedanāsaññāva āyatanadhātusaṅgahena saṅgahitāti. Sesaṃ suviññeyyameva. Ayaṃ asaṅgahitenasaṅgahitapade nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Saṅgahitenasaṅgahitapadatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saṅgahitenasaṅgahitapade pana yāni padāni saṅkhārekadesaṃ aññena asammissaṃ dīpenti vedanekadesaṃ vā sukhumarūpaṃ vā saddekadesaṃ vā, tāneva niddisīyanti. Khandhāyatanadhātūsu ekampi koṭṭhāsaṃ sakalena gahetvā ṭhitapadāni na yujjanti. Tāni pana dvinnaṃ samudayamaggasaccānaṃ, pannarasindriyānaṃ, ekādasapaṭiccapadādīnañca vasena veditabbāni. Idaṃ hettha lakkhaṇaṃ – yaṃ attanā khandhādivasena saṅgahitehi khandhādito saṅgahitaṃ, tasseva paṭhamaṃ uddhaṭapadassa puna khandhādīhi saṅgaho vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ ādipade nayo – samudayasaccena ye dhammā khandhādīhi tīhi saṅgahehipi saṅgahitā, tehi dhammehi ye dhammā khandhādīhi tīhipi saṅgahitā, te dhammā ",
      " ekena khandhena ekenāyatanena ekāya dhātuyā saṅgahitāti. Samudayasaccena hi taṇhāvajjā sesā saṅkhārā khandhādīhi saṅgahehi saṅgahitā, puna tehi ca taṇhāva saṅgahitā, sā ca puna saṅkhārakkhandhadhammāyatanadhammadhātūhi ",
      " saṅgahitā. Sesesupi eseva nayo. Ayaṃ saṅgahitenasaṅgahitapade nayo."
    ],
    "innerText": "Tatrāyaṃ ādipade nayo – samudayasaccena ye dhammā khandhādīhi tīhi saṅgahehipi saṅgahitā, tehi dhammehi ye dhammā khandhādīhi tīhipi saṅgahitā, te dhammā ekena khandhena ekenāyatanena ekāya dhātuyā saṅgahitāti. Samudayasaccena hi taṇhāvajjā sesā saṅkhārā khandhādīhi saṅgahehi saṅgahitā, puna tehi ca taṇhāva saṅgahitā, sā ca puna saṅkhārakkhandhadhammāyatanadhammadhātūhi saṅgahitā. Sesesupi eseva nayo. Ayaṃ saṅgahitenasaṅgahitapade nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Asaṅgahitenaasaṅgahitapadatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Asaṅgahitenaasaṅgahitapade pana yāni padāni pañcakkhandhagāhakehi dukkhasaccādīhi, viññāṇena saddhiṃ sukhumarūpagāhakehi acetasikādīhi ca padehi vivajjitāni rūpakkhandhādīni, tāneva niddisīyanti. Idaṃ hettha lakkhaṇaṃ – yaṃ paṭhamaṃ uddhaṭena rūpakkhandhādipadena khandhādito asaṅgahitaṃ, yaṃ tehi asaṅgahitaṃ, tasseva puna khandhādīhi asaṅgaho vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatrāyaṃ ekapadayojanā – rūpakkhandhena ye dhammā khandhādīhi tīhipi asaṅgahehi asaṅgahitā, tehi dhammehi ye dhammā khandhādīhi tīhi asaṅgahitā, te dhammā ekena khandhena ekenāyatanena sattahi dhātūhi asaṅgahitā. Rūpakkhandhena hi cattāro khandhā, nibbānañca khandhasaṅgahena asaṅgahitā, āyatanādīhi pana viññāṇameva ṭhapetvā vedanādayo dhammāyatanena rūpakkhandhekadesena saṅgahitāti viññāṇameva tīhipi khandhasaṅgahādīhi rūpakkhandhena asaṅgahitaṃ nāma. Tena puna viññāṇena saddhiṃ sanibbānā cattāro khandhā khandhādīhi asaṅgahitā, te sabbepi puna viññāṇabhūtena ekena khandhena ekenāyatanena sattahi dhātūhi asaṅgahitāti. Ayaṃ asaṅgahitenaasaṅgahitapade nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sampayogavippayogapadatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sampayogavippayogapade ",
      " pana yāni padāni nibbānena, rūpena vā missesu sattasu viññāṇadhātūsu ekāyapi avippayutte arūpadhamme pakāsenti, tesaṃ dhammāyatanadukkhasaccādīnaṃ niddeso na sambhavati. Kāhici pana viññāṇadhātūhi vippayuttānaṃ rūpamissārūpadhammānaṃ, kevalānārammaṇānaṃ vā sakalarūpakkhandhānaṃ vā pakāsakānaṃ rūpabhavarūpakkhandhakusalādipadānaṃ sampayogapade eva niddeso na sambhavati, vippayogapade pana sambhavati. Arūpakkhandhānaṃ pana paccekaṃ, dvinnaṃ, tiṇṇaṃ, tadekadesānaṃ vā tadubhayepi sambhavati. ‘‘Catūhi sampayogo, catūhi vippayogo, sabhāgo visabhāgo’’ti hi vacanato catūhi arūpakkhandheheva sabhāgānaṃ ekasantāne ekakkhaṇeva uppannānaṃ arūpakkhandhānaṃ eva aññamaññaṃ sampayogo labbhati. Rūpadhammānaṃ ",
      " pana rūpena, nibbānena vā, nibbānassa ca rūpena saddhiṃ sampayogo nāma natthi, tathā rūpanibbānānaṃ arūpakkhandhehi. Visabhāgā hi te tesaṃ yathā arūpakkhandhānaṃ rūpanibbānehi, evaṃ bhinnasantānikehi nānakkhaṇikehi arūpadhammehipi saddhiṃ natthiyeva. Tepi hi tesaṃ santānakkhaṇavisabhāgatāya visabhāgā eva. Ayaṃ pana visabhāgatā idha sāmaññato na gahitā tesaṃ avisesena sampayogassāpi sambhavā. Yattha pana visesetvā cakkhuviññāṇataṃsampayuttādayo nikkhittā, tatthāyampi visabhāgatā gahitā. Yattha pana ye aniddhāritavisesanā, tatthāpi sabbathā sampayogalakkhaṇaṃ na sambhavati. So ca tassa ekantena visabhāgoti idha gayhati."
    ],
    "innerText": "Sampayogavippayogapade pana yāni padāni nibbānena, rūpena vā missesu sattasu viññāṇadhātūsu ekāyapi avippayutte arūpadhamme pakāsenti, tesaṃ dhammāyatanadukkhasaccādīnaṃ niddeso na sambhavati. Kāhici pana viññāṇadhātūhi vippayuttānaṃ rūpamissārūpadhammānaṃ, kevalānārammaṇānaṃ vā sakalarūpakkhandhānaṃ vā pakāsakānaṃ rūpabhavarūpakkhandhakusalādipadānaṃ sampayogapade eva niddeso na sambhavati, vippayogapade pana sambhavati. Arūpakkhandhānaṃ pana paccekaṃ, dvinnaṃ, tiṇṇaṃ, tadekadesānaṃ vā tadubhayepi sambhavati. ‘‘Catūhi sampayogo, catūhi vippayogo, sabhāgo visabhāgo’’ti hi vacanato catūhi arūpakkhandheheva sabhāgānaṃ ekasantāne ekakkhaṇeva uppannānaṃ arūpakkhandhānaṃ eva aññamaññaṃ sampayogo labbhati. Rūpadhammānaṃ pana rūpena, nibbānena vā, nibbānassa ca rūpena saddhiṃ sampayogo nāma natthi, tathā rūpanibbānānaṃ arūpakkhandhehi. Visabhāgā hi te tesaṃ yathā arūpakkhandhānaṃ rūpanibbānehi, evaṃ bhinnasantānikehi nānakkhaṇikehi arūpadhammehipi saddhiṃ natthiyeva. Tepi hi tesaṃ santānakkhaṇavisabhāgatāya visabhāgā eva. Ayaṃ pana visabhāgatā idha sāmaññato na gahitā tesaṃ avisesena sampayogassāpi sambhavā. Yattha pana visesetvā cakkhuviññāṇataṃsampayuttādayo nikkhittā, tatthāyampi visabhāgatā gahitā. Yattha pana ye aniddhāritavisesanā, tatthāpi sabbathā sampayogalakkhaṇaṃ na sambhavati. So ca tassa ekantena visabhāgoti idha gayhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ nayo – rūpakkhandho kenaci sampayuttoti? Natthi. Katihi vippayutto? Catūhi khandhehi ekenāyatanena sattahi ",
      " dhātūhi vippayutto, ekenāyatanena ekāya dhātuyā kehici vippayutto. Esa nayo cakkhāyatanādianārammaṇesupi. Sārammaṇesu pana vedanākkhandho tīhi khandhehi ekenāyatanena sattahi dhātūhi sampayutto, ekenāyatanena ekāya dhātuyā kehici sampayutto. Ekena khandhena dasahi āyatanehi dasahi dhātūhi vippayutto, ekenāyatanena ekāya dhātuyā kehici vippayutto. Esa nayo saññākkhandhādīsupi."
    ],
    "innerText": "Tatrāyaṃ nayo – rūpakkhandho kenaci sampayuttoti? Natthi. Katihi vippayutto? Catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayutto, ekenāyatanena ekāya dhātuyā kehici vippayutto. Esa nayo cakkhāyatanādianārammaṇesupi. Sārammaṇesu pana vedanākkhandho tīhi khandhehi ekenāyatanena sattahi dhātūhi sampayutto, ekenāyatanena ekāya dhātuyā kehici sampayutto. Ekena khandhena dasahi āyatanehi dasahi dhātūhi vippayutto, ekenāyatanena ekāya dhātuyā kehici vippayutto. Esa nayo saññākkhandhādīsupi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekenā"
      },
      "ti manāyatanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattahī"
      },
      "ti viññāṇadhātūhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kehicī"
      },
      "ti dhammāyatanadhammadhātupariyāpannehi vedanāsaññāsaṅkhārehi. Dutiyanaye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tīhī"
      },
      "ti attānaṃ ṭhapetvā sesehi arūpakkhandhehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kehici vippayutto"
      },
      "ti dhammāyatanadhammadhātūsu saññāsaṅkhārehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kehici vippayutto"
      },
      "ti rūpanibbānehi. Evaṃ uparipi sabbattha yathānurūpaṃ ñātabbaṃ. Sesaṃ vuttanayameva. Ayaṃ pana viseso ‘‘samudayamaggasaccādayo ekāya manoviññāṇadhātuyā sampayuttā, adhimokkho pana manodhātumanoviññāṇadhātūhi dvīhevā’’ti. Ayaṃ sampayogavippayogapade nayo."
    ],
    "innerText": "Tattha ekenāti manāyatanena. Sattahīti viññāṇadhātūhi. Kehicīti dhammāyatanadhammadhātupariyāpannehi vedanāsaññāsaṅkhārehi. Dutiyanaye tīhīti attānaṃ ṭhapetvā sesehi arūpakkhandhehi. Kehici vippayuttoti dhammāyatanadhammadhātūsu saññāsaṅkhārehi. Kehici vippayuttoti rūpanibbānehi. Evaṃ uparipi sabbattha yathānurūpaṃ ñātabbaṃ. Sesaṃ vuttanayameva. Ayaṃ pana viseso ‘‘samudayamaggasaccādayo ekāya manoviññāṇadhātuyā sampayuttā, adhimokkho pana manodhātumanoviññāṇadhātūhi dvīhevā’’ti. Ayaṃ sampayogavippayogapade nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sampayuttenavippayuttapadatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sampayuttenavippayuttapade pana sampayogārahapadesu yāni padāni dhammadhātuyā sampayutte dhamme, viññāṇañca aññena asammissaṃ dīpenti, tesameva niddeso. Tāni pana catunnaṃ arūpakkhandhapadānaṃ, manāyatanassa, sattannaṃ viññāṇadhātūnaṃ, manopekkhāvasena dvinnaṃ indriyānaṃ, viññāṇaphassavedanānaṃ ",
      " tiṇṇaṃ paṭiccasamuppādapadānaṃ, phassasattakassa, adukkhamasukhasavitakkasavicāraupekkhāsahagatānaṃ vasena tiṇṇaṃ tikapadānaṃ, sattamahantaradukapadādīnañca vasena veditabbāni, na itaresaṃ asambhavā. Teneva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathāyaṃ"
      },
      " –"
    ],
    "innerText": "Sampayuttenavippayuttapade pana sampayogārahapadesu yāni padāni dhammadhātuyā sampayutte dhamme, viññāṇañca aññena asammissaṃ dīpenti, tesameva niddeso. Tāni pana catunnaṃ arūpakkhandhapadānaṃ, manāyatanassa, sattannaṃ viññāṇadhātūnaṃ, manopekkhāvasena dvinnaṃ indriyānaṃ, viññāṇaphassavedanānaṃ tiṇṇaṃ paṭiccasamuppādapadānaṃ, phassasattakassa, adukkhamasukhasavitakkasavicāraupekkhāsahagatānaṃ vasena tiṇṇaṃ tikapadānaṃ, sattamahantaradukapadādīnañca vasena veditabbāni, na itaresaṃ asambhavā. Teneva aṭṭhakathāyaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Cattāro ",
      " khandhāyatanañca ekaṃ,"
    ],
    "innerText": "‘‘Cattāro khandhāyatanañca ekaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dve indriyā dhātupadāni satta;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tayo paṭiccā atha phassasattakaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Tike tayo satta mahantare ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Ekaṃ savitakkaṃ savicāramekaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yuttaṃ upekkhāya ca ekamevā’’ti. (dhātu. aṭṭha. 306) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Uddānagāthā vuttā. Idaṃ hettha lakkhaṇaṃ – ye dhammā paṭhamaṃ uddhaṭapadena sampayuttā, tehi ye dhammā vippayuttā, tesaṃ khandhādīhi vippayogo vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatrāyaṃ nayo – vedanākkhandhena ye dhammā sampayuttā, tehi dhammehi ye dhammā vippayuttā, te dhammā catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā, ekenāyatanena ekāya dhātuyā kehici vippayuttā. Cakkhuviññāṇadhātuyā ye dhammā sampayuttā, tehi dhammehi ye dhammā vippayuttā, te dhammā na kehici khandhāyatanehi vippayuttā, ekāya pana dhātuyā vippayuttāti evaṃ sabbattha yojanā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "te dhammā"
      },
      "ti rūpanibbānadhammā, te vedanāya sampayuttehi vippayuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekenā"
      },
      "ti manāyatanena. Dutiyanaye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "te dhammā"
      },
      "ti sappītikā te dhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na kehicī"
      },
      "ti paṭhamaṃ uddhaṭaṃ cakkhuviññāṇadhātuṃ ṭhapetvā sesā chaviññāṇadhātū, taṃsampayuttā, rūpaṃ, nibbānañca. Tehi sabbesaṃ khandhāyatanānaṃ saṅgahitattā na kehici khandhehi, āyatanehi vā vippayuttā. Na hi sayaṃ attanā vippayujjati, sampayujjati vāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekāyā"
      },
      "ti cakkhuviññāṇadhātuyā. Sesaṃ suviññeyyameva. Ayaṃ sampayuttenavippayuttapade nayo."
    ],
    "innerText": "Tattha te dhammāti rūpanibbānadhammā, te vedanāya sampayuttehi vippayuttā. Ekenāti manāyatanena. Dutiyanaye te dhammāti sappītikā te dhammā. Na kehicīti paṭhamaṃ uddhaṭaṃ cakkhuviññāṇadhātuṃ ṭhapetvā sesā chaviññāṇadhātū, taṃsampayuttā, rūpaṃ, nibbānañca. Tehi sabbesaṃ khandhāyatanānaṃ saṅgahitattā na kehici khandhehi, āyatanehi vā vippayuttā. Na hi sayaṃ attanā vippayujjati, sampayujjati vāti. Ekāyāti cakkhuviññāṇadhātuyā. Sesaṃ suviññeyyameva. Ayaṃ sampayuttenavippayuttapade nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Vippayuttenasampayuttapadatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vippayuttenasampayuttapade ",
      " pana vippayuttena sampayutto nāma dhammo natthi, desanāsampadamattāya pana moghampetaṃ padaṃ uddhaṭaṃ, teneva pāḷiyaṃ sabbavāresupi ‘‘natthi natthi’’ icceva vuttaṃ. Rūpakkhandhādianārammaṇadhammehi vippayuttā cattāro khandhā, tesañca aññehi sampayogo natthi. Vedanādīhipi rūpanibbānādīni vippayuttāni, tesañca kenaci sampayogova natthīti. Ayaṃ vippayuttenasampayuttapade nayo."
    ],
    "innerText": "Vippayuttenasampayuttapade pana vippayuttena sampayutto nāma dhammo natthi, desanāsampadamattāya pana moghampetaṃ padaṃ uddhaṭaṃ, teneva pāḷiyaṃ sabbavāresupi ‘‘natthi natthi’’ icceva vuttaṃ. Rūpakkhandhādianārammaṇadhammehi vippayuttā cattāro khandhā, tesañca aññehi sampayogo natthi. Vedanādīhipi rūpanibbānādīni vippayuttāni, tesañca kenaci sampayogova natthīti. Ayaṃ vippayuttenasampayuttapade nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sampayuttenasampayuttapadatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sampayuttenasampayuttapade pana yāni padāni rūpena asammissaṃ arūpakkhandhekadesameva dīpenti, tesameva niddeso, na rūpārūpasammissānaṃ, sabbarūpakkhandhadīpakānaṃ tesaṃ sampayuttatāyogābhāvā. Sabbārūpakkhandhenāpi hi kusalādinā añño sampayutto nāma natthi. Idaṃ hettha lakkhaṇaṃ – ye dhammā paṭhamaṃ uddhaṭā, attanā sampayuttena puna sampayuttā, tesaññeva khandhādīhi sampayogo vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatrāyaṃ nayo – vedanākkhandhena ye dhammā sampayuttā, tehi dhammehi ye dhammā sampayuttā, te dhammā tīhi khandhehi ekenāyatanena sattahi dhātūhi sampayuttā, ekenāyatanena…pe… kehici sampayuttā. Samudayasaccena ye dhammā sampayuttā, tehi dhammehi ye dhammā sampayuttā, te dhammā tīhi khandhehi ekenāyatanena ekāya manoviññāṇadhātuyā sampayuttā, ekena khandhena ekenāyatanena ekāya dhātuyā kehici sampayuttāti. Sesaṃ suviññeyyameva. Ayaṃ sampayuttenasampayuttapade nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Vippayuttenavippayuttapadatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vippayuttenavippayuttapade ",
      " pana sampayogapade vuttapadāneva niddisīyanti. Idaṃ hettha lakkhaṇaṃ – ye dhammā paṭhamaṃ uddhaṭapadena vippayuttehi puna vippayuttā, tesaṃ khandhādīhi vippayogo vuccati."
    ],
    "innerText": "Vippayuttenavippayuttapade pana sampayogapade vuttapadāneva niddisīyanti. Idaṃ hettha lakkhaṇaṃ – ye dhammā paṭhamaṃ uddhaṭapadena vippayuttehi puna vippayuttā, tesaṃ khandhādīhi vippayogo vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ ",
      " nayo – rūpakkhandhena ye dhammā vippayuttā, tehi dhammehi ye dhammā vippayuttā, te dhammā catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā, ekenāyatanena…pe… kehici vippayuttā. Vedanākkhandhena ye dhammā vippayuttā, tehi dhammehi ye dhammā vippayuttā, te dhammā ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā, ekena…pe… kehici vippayuttāti. Sesaṃ suviññeyyameva. Ayaṃ vippayuttenavippayuttapade nayo."
    ],
    "innerText": "Tatrāyaṃ nayo – rūpakkhandhena ye dhammā vippayuttā, tehi dhammehi ye dhammā vippayuttā, te dhammā catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā, ekenāyatanena…pe… kehici vippayuttā. Vedanākkhandhena ye dhammā vippayuttā, tehi dhammehi ye dhammā vippayuttā, te dhammā ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā, ekena…pe… kehici vippayuttāti. Sesaṃ suviññeyyameva. Ayaṃ vippayuttenavippayuttapade nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Saṅgahitenasampayuttavippayuttapadatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saṅgahitenasampayuttavippayuttapade pana saṅgahitenasaṅgahitapade niddiṭṭhāni samudayasaccādipadāneva niddisīyanti. Idaṃ hettha lakkhaṇaṃ – ye dhammā paṭhamaṃ uddhaṭapadena khandhādīhi tīhipi saṅgahitā, tesaṃ khandhādīhi sampayogo, vippayogo ca vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ nayo – samudayasaccena ye dhammā khandhādīhi tīhipi saṅgahehi saṅgahitā, te dhammā tīhi khandhehi ekenāyatanena sattahi dhātūhi sampayuttā, ekena khandhena ekenāyatanena ekāya dhātuyā kehici sampayuttā. Ekena khandhena dasahāyatanadhātūhi vippayuttā, ekenāyatanena ekāya dhātuyā kehici vippayuttā. Itthindriyena ye dhammā khandhādīhi tīhipi saṅgahitā, te dhammā ",
      " na kehici sampayuttā, catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā, ekena…pe… kehici vippayuttāti."
    ],
    "innerText": "Tatrāyaṃ nayo – samudayasaccena ye dhammā khandhādīhi tīhipi saṅgahehi saṅgahitā, te dhammā tīhi khandhehi ekenāyatanena sattahi dhātūhi sampayuttā, ekena khandhena ekenāyatanena ekāya dhātuyā kehici sampayuttā. Ekena khandhena dasahāyatanadhātūhi vippayuttā, ekenāyatanena ekāya dhātuyā kehici vippayuttā. Itthindriyena ye dhammā khandhādīhi tīhipi saṅgahitā, te dhammā na kehici sampayuttā, catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā, ekena…pe… kehici vippayuttāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekenā"
      },
      "ti manāyatanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekena khandhenā"
      },
      "ti saṅkhārakkhandhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kehicī"
      },
      "ti saṅkhārakkhandhe taṇhāya dhammāyatanadhammadhātūsu taṇhāvedanāsaññāhi. Sesaṃ suviññeyyameva. Ayaṃ saṅgahitenasampayuttavippayuttapade nayo."
    ],
    "innerText": "Tattha ekenāti manāyatanena. Ekena khandhenāti saṅkhārakkhandhena. Kehicīti saṅkhārakkhandhe taṇhāya dhammāyatanadhammadhātūsu taṇhāvedanāsaññāhi. Sesaṃ suviññeyyameva. Ayaṃ saṅgahitenasampayuttavippayuttapade nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sampayuttenasaṅgahitāsaṅgahitapadatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sampayuttenasaṅgahitāsaṅgahitapade pana sampayuttenasampayuttapade niddiṭṭhāni vedanākkhandhādipadāneva niddisīyanti. Idaṃ hettha lakkhaṇaṃ – ye dhammā paṭhamaṃ uddhaṭapadena sampayuttā, tesaṃ khandhādīhi saṅgaho, asaṅgaho ca vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ ",
      " nayo – vedanākkhandhena ye dhammā sampayuttā, te dhammā tīhi khandhehi dvīhi āyatanehi aṭṭhahi dhātūhi saṅgahitā, sesehi asaṅgahitā. Viññāṇakkhandhena ye dhammā sampayuttā, te dhammā tīhi khandhehi ekenāyatanena ekāya dhātuyā saṅgahitā, sesehi asaṅgahitāti."
    ],
    "innerText": "Tatrāyaṃ nayo – vedanākkhandhena ye dhammā sampayuttā, te dhammā tīhi khandhehi dvīhi āyatanehi aṭṭhahi dhātūhi saṅgahitā, sesehi asaṅgahitā. Viññāṇakkhandhena ye dhammā sampayuttā, te dhammā tīhi khandhehi ekenāyatanena ekāya dhātuyā saṅgahitā, sesehi asaṅgahitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tīhī"
      },
      "ti saññākkhandhādīhi tīhi. Tehi vedanāya sampayuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvīhī"
      },
      "ti dhammāyatanamanāyatanehi. Sesaṃ suviññeyyameva. Ayaṃ sampayuttenasaṅgahitāsaṅgahitapade nayo."
    ],
    "innerText": "Tattha tīhīti saññākkhandhādīhi tīhi. Tehi vedanāya sampayuttā. Dvīhīti dhammāyatanamanāyatanehi. Sesaṃ suviññeyyameva. Ayaṃ sampayuttenasaṅgahitāsaṅgahitapade nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Asaṅgahitenasampayuttavippayuttapadatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Asaṅgahitenasampayuttavippayuttapade pana yāni padāni sukhumarūpaṃ aviññāṇaṃ, arūpaṃ saviññāṇaṃ vā, kevalaṃ arūpaṃ vā thūlarūpassapi kevalaṃ vā, sukhumarūpaṃ dīpenti, tesameva niddeso ",
      ". Idaṃ hettha lakkhaṇaṃ – ye dhammā paṭhamaṃ uddhaṭadhammehi khandhādīhi tīhipi asaṅgahitā, tesaṃ khandhādīhi sampayogo, vippayogo ca vuccati."
    ],
    "innerText": "Asaṅgahitenasampayuttavippayuttapade pana yāni padāni sukhumarūpaṃ aviññāṇaṃ, arūpaṃ saviññāṇaṃ vā, kevalaṃ arūpaṃ vā thūlarūpassapi kevalaṃ vā, sukhumarūpaṃ dīpenti, tesameva niddeso . Idaṃ hettha lakkhaṇaṃ – ye dhammā paṭhamaṃ uddhaṭadhammehi khandhādīhi tīhipi asaṅgahitā, tesaṃ khandhādīhi sampayogo, vippayogo ca vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatrāyaṃ nayo – rūpakkhandhena ye dhammā khandhādīhi asaṅgahitā, te dhammā tīhi khandhehi sampayuttā, ekenāyatanena ekāya dhātuyā kehici sampayuttā, ekena khandhena dasahi āyatanadhātūhi vippayuttā, ekenāyatanena ekāya dhātuyā kehici vippayuttā. Evaṃ dhammāyatanaitthindriyādīsupi yojanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Arūpabhavena ye dhammā khandhādīhi asaṅgahitā, te sampayuttāti natthi. Te catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā, ekenāyatanena ekāya dhātuyā kehici vippayuttā. Evaṃ iddhipādakusalādipadesupi yojanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha rūpakkhandhena viññāṇasseva tīhipi asaṅgahitattā tassa tīhi vedanādīhi sampayogo, itarehi ca vippayogo ñātabbo. Sesaṃ suviññeyyameva. Ayaṃ asaṅgahitenasampayuttavippayuttapade nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Vippayuttenasaṅgahitāsaṅgahitapadatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vippayuttenasaṅgahitāsaṅgahitapade ",
      " pana yāni padāni kevalānaṃ sārammaṇānaṃ, anārammaṇānaṃ vā dhammānaṃ pakāsakāni ca sabhāvajātibhūmikālasantānavasena bhinnatāya kehici arūpakkhandhehi vippayuttānaṃ anārammaṇadhammamissārūpakkhandhānaṃ pakāsakāni dukkhasaccaabyākataparittaatītaajjhattādipadāni, tesameva niddeso itaresaṃ dhammāyatanajīvitindriyanāmarūpasaḷāyatanajātijarāmaraṇaajjhattabahiddhāanidassanaappaṭighanahetuādīnaṃ tesaṃ kenaci vippayogāsambhavā. Idaṃ hettha lakkhaṇaṃ – ye dhammā paṭhamaṃ uddhaṭapadena ",
      " vippayuttā, tesaṃ khandhādīhi saṅgaho, asaṅgaho ca vuccati."
    ],
    "innerText": "Vippayuttenasaṅgahitāsaṅgahitapade pana yāni padāni kevalānaṃ sārammaṇānaṃ, anārammaṇānaṃ vā dhammānaṃ pakāsakāni ca sabhāvajātibhūmikālasantānavasena bhinnatāya kehici arūpakkhandhehi vippayuttānaṃ anārammaṇadhammamissārūpakkhandhānaṃ pakāsakāni dukkhasaccaabyākataparittaatītaajjhattādipadāni, tesameva niddeso itaresaṃ dhammāyatanajīvitindriyanāmarūpasaḷāyatanajātijarāmaraṇaajjhattabahiddhāanidassanaappaṭighanahetuādīnaṃ tesaṃ kenaci vippayogāsambhavā. Idaṃ hettha lakkhaṇaṃ – ye dhammā paṭhamaṃ uddhaṭapadena vippayuttā, tesaṃ khandhādīhi saṅgaho, asaṅgaho ca vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ nayo – rūpakkhandhena ye dhammā vippayuttā, te dhammā catūhi khandhehi dvīhāyatanehi aṭṭhahi dhātūhi saṅgahitā, ekena khandhena dasahi āyatanadhātūhi asaṅgahitā. Dukkhasaccena ye dhammā vippayuttā, te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Tattha dukkhasaccena vippayuttā nāma lokuttaracittacetasikāni, te ca dhammā vedanākkhandhādicatukkhandhehi manoviññāṇadhammadhātuvasena dvīhi dhātūhi saṅgahitāti. Sesaṃ suviññeyyameva. Ayaṃ vippayuttenasaṅgahitāsaṅgahitapade nayo. Ayamettha saṅkhepato vibhaṅganayena saddhiṃ atthanicchayo, vitthāro pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhātukathāpāḷiaṭṭhakathāsu"
      },
      " (dhātu. 12; dhātu. aṭṭha. 1-2) gahetabboti."
    ],
    "innerText": "Tatrāyaṃ nayo – rūpakkhandhena ye dhammā vippayuttā, te dhammā catūhi khandhehi dvīhāyatanehi aṭṭhahi dhātūhi saṅgahitā, ekena khandhena dasahi āyatanadhātūhi asaṅgahitā. Dukkhasaccena ye dhammā vippayuttā, te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Tattha dukkhasaccena vippayuttā nāma lokuttaracittacetasikāni, te ca dhammā vedanākkhandhādicatukkhandhehi manoviññāṇadhammadhātuvasena dvīhi dhātūhi saṅgahitāti. Sesaṃ suviññeyyameva. Ayaṃ vippayuttenasaṅgahitāsaṅgahitapade nayo. Ayamettha saṅkhepato vibhaṅganayena saddhiṃ atthanicchayo, vitthāro pana dhātukathāpāḷiaṭṭhakathāsu (dhātu. 12; dhātu. aṭṭha. 1-2) gahetabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mohavicchedaniyā abhidhammamātikatthavaṇṇanāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhātukathāmātikatthavaṇṇanā niṭṭhitā."
  }
]