[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "8. Satipaṭṭhānakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "301"
      },
      ". Sabbe dhammā satipaṭṭhānāti? Āmantā. Sabbe dhammā sati satindriyaṃ satibalaṃ sammāsati satisambojjhaṅgo ekāyanamaggo khayagāmī bodhagāmī ",
      " apacayagāmī anāsavā asaṃyojaniyā ",
      " aganthaniyā anoghaniyā ayoganiyā anīvaraṇiyā aparāmaṭṭhā anupādāniyā asaṃkilesikā, sabbe dhammā buddhānussati dhammānussati saṅghānussati sīlānussati cāgānussati devatānussati ānāpānassati maraṇānussati kāyagatāsati upasamānussatīti? Na hevaṃ vattabbe…pe…."
    ],
    "innerText": "301. Sabbe dhammā satipaṭṭhānāti? Āmantā. Sabbe dhammā sati satindriyaṃ satibalaṃ sammāsati satisambojjhaṅgo ekāyanamaggo khayagāmī bodhagāmī apacayagāmī anāsavā asaṃyojaniyā aganthaniyā anoghaniyā ayoganiyā anīvaraṇiyā aparāmaṭṭhā anupādāniyā asaṃkilesikā, sabbe dhammā buddhānussati dhammānussati saṅghānussati sīlānussati cāgānussati devatānussati ānāpānassati maraṇānussati kāyagatāsati upasamānussatīti? Na hevaṃ vattabbe…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbe dhammā satipaṭṭhānāti? Āmantā. Cakkhāyatanaṃ satipaṭṭhānanti? Na hevaṃ vattabbe…pe… cakkhāyatanaṃ satipaṭṭhānanti ",
      "? Āmantā. Cakkhāyatanaṃ sati satindriyaṃ satibalaṃ sammāsati satisambojjhaṅgo ekāyanamaggo khayagāmī bodhagāmī apacayagāmī anāsavaṃ asaṃyojaniyaṃ…pe… asaṃkilesikaṃ, cakkhāyatanaṃ buddhānussati dhammānussati saṅghānussati sīlānussati cāgānussati devatānussati ānāpānassati maraṇānussati kāyagatāsati upasamānussatīti? Na ",
      " hevaṃ vattabbe…pe… sotāyatanaṃ… ghānāyatanaṃ… jivhāyatanaṃ… kāyāyatanaṃ… rūpāyatanaṃ… saddāyatanaṃ… gandhāyatanaṃ… rasāyatanaṃ… phoṭṭhabbāyatanaṃ… rāgo… doso… moho… māno… diṭṭhi… vicikicchā… thinaṃ… uddhaccaṃ… ahirikaṃ… anottappaṃ satipaṭṭhānanti? Na hevaṃ vattabbe…pe… anottappaṃ satipaṭṭhānanti? Āmantā. Anottappaṃ sati satindriyaṃ satibalaṃ sammāsati…pe… kāyagatāsati upasamānussatīti? Na hevaṃ vattabbe…pe…."
    ],
    "innerText": "Sabbe dhammā satipaṭṭhānāti? Āmantā. Cakkhāyatanaṃ satipaṭṭhānanti? Na hevaṃ vattabbe…pe… cakkhāyatanaṃ satipaṭṭhānanti ? Āmantā. Cakkhāyatanaṃ sati satindriyaṃ satibalaṃ sammāsati satisambojjhaṅgo ekāyanamaggo khayagāmī bodhagāmī apacayagāmī anāsavaṃ asaṃyojaniyaṃ…pe… asaṃkilesikaṃ, cakkhāyatanaṃ buddhānussati dhammānussati saṅghānussati sīlānussati cāgānussati devatānussati ānāpānassati maraṇānussati kāyagatāsati upasamānussatīti? Na hevaṃ vattabbe…pe… sotāyatanaṃ… ghānāyatanaṃ… jivhāyatanaṃ… kāyāyatanaṃ… rūpāyatanaṃ… saddāyatanaṃ… gandhāyatanaṃ… rasāyatanaṃ… phoṭṭhabbāyatanaṃ… rāgo… doso… moho… māno… diṭṭhi… vicikicchā… thinaṃ… uddhaccaṃ… ahirikaṃ… anottappaṃ satipaṭṭhānanti? Na hevaṃ vattabbe…pe… anottappaṃ satipaṭṭhānanti? Āmantā. Anottappaṃ sati satindriyaṃ satibalaṃ sammāsati…pe… kāyagatāsati upasamānussatīti? Na hevaṃ vattabbe…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sati satipaṭṭhānā, sā ca satīti? Āmantā. Cakkhāyatanaṃ satipaṭṭhānaṃ, tañca satīti? Na hevaṃ vattabbe…pe… sati satipaṭṭhānā, sā ca satīti? Āmantā. Sotāyatanaṃ…pe… kāyāyatanaṃ… rūpāyatanaṃ…pe… phoṭṭhabbāyatanaṃ… rāgo… doso… moho…pe… anottappaṃ satipaṭṭhānaṃ, tañca satīti? Na hevaṃ vattabbe…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cakkhāyatanaṃ satipaṭṭhānaṃ, tañca na satīti? Āmantā. Sati satipaṭṭhānā, sā ca na satīti? Na hevaṃ vattabbe…pe… sotāyatanaṃ…pe… kāyāyatanaṃ… rūpāyatanaṃ…pe… phoṭṭhabbāyatanaṃ… rāgo ",
      "… doso… moho…pe… anottappaṃ satipaṭṭhānaṃ, tañca na satīti? Āmantā ",
      ". Sati satipaṭṭhānā, sā ca na satīti? Na hevaṃ vattabbe…pe…."
    ],
    "innerText": "Cakkhāyatanaṃ satipaṭṭhānaṃ, tañca na satīti? Āmantā. Sati satipaṭṭhānā, sā ca na satīti? Na hevaṃ vattabbe…pe… sotāyatanaṃ…pe… kāyāyatanaṃ… rūpāyatanaṃ…pe… phoṭṭhabbāyatanaṃ… rāgo … doso… moho…pe… anottappaṃ satipaṭṭhānaṃ, tañca na satīti? Āmantā . Sati satipaṭṭhānā, sā ca na satīti? Na hevaṃ vattabbe…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "302"
      },
      ". Na ",
      " vattabbaṃ – ‘‘sabbe dhammā satipaṭṭhānā’’ti? Āmantā. Nanu sabbe dhamme ārabbha ",
      " sati santiṭṭhatīti? Āmantā. Hañci sabbe dhamme ārabbha sati santiṭṭhatīti, tena vata re vattabbe – ‘‘sabbe dhammā satipaṭṭhānā’’ti."
    ],
    "innerText": "302. Na vattabbaṃ – ‘‘sabbe dhammā satipaṭṭhānā’’ti? Āmantā. Nanu sabbe dhamme ārabbha sati santiṭṭhatīti? Āmantā. Hañci sabbe dhamme ārabbha sati santiṭṭhatīti, tena vata re vattabbe – ‘‘sabbe dhammā satipaṭṭhānā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sabbaṃ dhammaṃ ārabbha sati santiṭṭhatīti sabbe dhammā satipaṭṭhānāti? Āmantā. Sabbaṃ dhammaṃ ārabbha phasso santiṭṭhatīti sabbe dhammā phassapaṭṭhānāti? Na hevaṃ vattabbe…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sabbaṃ dhammaṃ ārabbha sati santiṭṭhatīti sabbe dhammā satipaṭṭhānāti? Āmantā. Sabbaṃ dhammaṃ ārabbha vedanā santiṭṭhati… saññā santiṭṭhati… cetanā santiṭṭhati… cittaṃ santiṭṭhatīti sabbe dhammā cittapaṭṭhānāti? Na hevaṃ vattabbe…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sabbe dhammā satipaṭṭhānāti? Āmantā. Sabbe sattā upaṭṭhitasatino satiyā samannāgatā satiyā samohitā; sabbesaṃ sattānaṃ sati paccupaṭṭhitāti? Na hevaṃ vattabbe…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "303"
      },
      ". Sabbe dhammā satipaṭṭhānāti? Āmantā. Nanu vuttaṃ bhagavatā – ‘‘amataṃ te, bhikkhave, na paribhuñjanti ye kāyagatāsatiṃ na paribhuñjanti. Amataṃ te, bhikkhave, paribhuñjanti ye kāyagatāsatiṃ paribhuñjantī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[a. ni. 1.600]"
      },
      ". Attheva suttantoti? Āmantā. Sabbe sattā kāyagatāsatiṃ paribhuñjanti paṭilabhanti āsevanti bhāventi bahulīkarontīti? Na ",
      " hevaṃ vattabbe…pe…."
    ],
    "innerText": "303. Sabbe dhammā satipaṭṭhānāti? Āmantā. Nanu vuttaṃ bhagavatā – ‘‘amataṃ te, bhikkhave, na paribhuñjanti ye kāyagatāsatiṃ na paribhuñjanti. Amataṃ te, bhikkhave, paribhuñjanti ye kāyagatāsatiṃ paribhuñjantī’’ti [a. ni. 1.600]. Attheva suttantoti? Āmantā. Sabbe sattā kāyagatāsatiṃ paribhuñjanti paṭilabhanti āsevanti bhāventi bahulīkarontīti? Na hevaṃ vattabbe…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbe dhammā satipaṭṭhānāti? Āmantā. Nanu vuttaṃ bhagavatā – ‘‘ekāyano ayaṃ, bhikkhave, maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya yadidaṃ cattāro satipaṭṭhānā’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dī. ni. 2.373; ma. ni. 1.106; saṃ. ni. 5.367]"
      },
      "! Attheva suttantoti? Āmantā? Sabbe dhammā ekāyanamaggoti? Na hevaṃ vattabbe…pe…."
    ],
    "innerText": "Sabbe dhammā satipaṭṭhānāti? Āmantā. Nanu vuttaṃ bhagavatā – ‘‘ekāyano ayaṃ, bhikkhave, maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya yadidaṃ cattāro satipaṭṭhānā’’ti [dī. ni. 2.373; ma. ni. 1.106; saṃ. ni. 5.367]! Attheva suttantoti? Āmantā? Sabbe dhammā ekāyanamaggoti? Na hevaṃ vattabbe…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbe dhammā satipaṭṭhānāti? Āmantā. Nanu vuttaṃ bhagavatā – ‘‘rañño, bhikkhave, cakkavattissa pātubhāvā sattannaṃ ratanānaṃ pātubhāvo hoti. Katamesaṃ sattannaṃ? Cakkaratanassa pātubhāvo hoti, hatthiratanassa pātubhāvo hoti, assaratanassa… maṇiratanassa… itthiratanassa ",
      "… gahapatiratanassa… pariṇāyakaratanassa pātubhāvo hoti ",
      ". Rañño, bhikkhave, cakkavattissa pātubhāvā imesaṃ sattannaṃ ratanānaṃ pātubhāvo hoti."
    ],
    "innerText": "Sabbe dhammā satipaṭṭhānāti? Āmantā. Nanu vuttaṃ bhagavatā – ‘‘rañño, bhikkhave, cakkavattissa pātubhāvā sattannaṃ ratanānaṃ pātubhāvo hoti. Katamesaṃ sattannaṃ? Cakkaratanassa pātubhāvo hoti, hatthiratanassa pātubhāvo hoti, assaratanassa… maṇiratanassa… itthiratanassa … gahapatiratanassa… pariṇāyakaratanassa pātubhāvo hoti . Rañño, bhikkhave, cakkavattissa pātubhāvā imesaṃ sattannaṃ ratanānaṃ pātubhāvo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tathāgatassa, bhikkhave, pātubhāvā arahato sammāsambuddhassa sattannaṃ bojjhaṅgaratanānaṃ pātubhāvo hoti. Katamesaṃ sattannaṃ? Satisambojjhaṅgaratanassa pātubhāvo hoti, dhammavicayasambojjhaṅgaratanassa ",
      " pātubhāvo hoti, vīriyasambojjhaṅgaratanassa pātubhāvo hoti, pītisambojjhaṅgaratanassa pātubhāvo hoti, passaddhisambojjhaṅgaratanassa pātubhāvo hoti, samādhisambojjhaṅgaratanassa pātubhāvo hoti, upekkhāsambojjhaṅgaratanassa pātubhāvo hoti. Tathāgatassa, bhikkhave, pātubhāvā arahato sammāsambuddhassa imesaṃ sattannaṃ bojjhaṅgaratanānaṃ pātubhāvo hotī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṃ. ni. 5.223]"
      },
      ". Attheva suttantoti? Āmantā. Tathāgatassa pātubhāvā arahato sammāsambuddhassa sabbe dhammā satisambojjhaṅgaratanāva hontīti? Na hevaṃ vattabbe…pe… sabbe ",
      " dhammā satipaṭṭhānāti? Āmantā. Sabbe dhammā sammappadhānā… iddhipādā… indriyā… balā… bojjhaṅgāti? Na hevaṃ vattabbe…pe…."
    ],
    "innerText": "‘‘Tathāgatassa, bhikkhave, pātubhāvā arahato sammāsambuddhassa sattannaṃ bojjhaṅgaratanānaṃ pātubhāvo hoti. Katamesaṃ sattannaṃ? Satisambojjhaṅgaratanassa pātubhāvo hoti, dhammavicayasambojjhaṅgaratanassa pātubhāvo hoti, vīriyasambojjhaṅgaratanassa pātubhāvo hoti, pītisambojjhaṅgaratanassa pātubhāvo hoti, passaddhisambojjhaṅgaratanassa pātubhāvo hoti, samādhisambojjhaṅgaratanassa pātubhāvo hoti, upekkhāsambojjhaṅgaratanassa pātubhāvo hoti. Tathāgatassa, bhikkhave, pātubhāvā arahato sammāsambuddhassa imesaṃ sattannaṃ bojjhaṅgaratanānaṃ pātubhāvo hotī’’ti [saṃ. ni. 5.223]. Attheva suttantoti? Āmantā. Tathāgatassa pātubhāvā arahato sammāsambuddhassa sabbe dhammā satisambojjhaṅgaratanāva hontīti? Na hevaṃ vattabbe…pe… sabbe dhammā satipaṭṭhānāti? Āmantā. Sabbe dhammā sammappadhānā… iddhipādā… indriyā… balā… bojjhaṅgāti? Na hevaṃ vattabbe…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Satipaṭṭhānakathā niṭṭhitā."
  }
]