[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "7. Paṭṭhānamātikatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " paṭṭhānamātikāya atthasaṃvaṇṇanānayo hoti. Kenaṭṭhena paṭṭhānanti? Nānappakārapaccayaṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pa"
      },
      "-saddo hi nānappakāratthaṃ dīpeti, ṭhāna-saddo paccayatthaṃ. Atha vā vibhajanaṭṭhena paṭṭhānaṃ. Yathā hi paññāpanā paṭṭhapanā vivaraṇā vibhajanā uttānīkammanti āgataṭṭhāne vibhajanaṭṭho paṭṭhānasaddasamānattho paṭṭhapanā-saddo dissati, evamidhāpi kusalādīnaṃ dhammānaṃ hetupaccayādīhi vibhajanato vibhajanaṭṭhena paṭṭhānaṃ nāma. Atha vā paṭṭhitaṭṭhena paṭṭhānaṃ, gamanaṭṭhenāti attho. Sabbadhammesu hi asaṅgagamanassa sabbaññutaññāṇassa hetupaccayādibhedabhinnesu kusalādīsu vitthāritanayalābhato nissaṅgavasena pavattagamanattā gamanaṭṭhena paṭṭhānaṃ nāma, iti nānappakārapaccayaṭṭhena, vibhajanaṭṭhena, gamanaṭṭhena ca tikapaṭṭhānādīsu catuvīsatiyā paṭṭhānesu ekekampi paṭṭhānaṃ nāma, tesaṃ pana samūhato pakaraṇaṃ paṭṭhānaṃ nāma, tesaṃ paṭṭhānānaṃ mātikā. Sayampi vā paṭṭhānabhūtā mātikā, sabbampetaṃ paṭṭhānamātikā. Yā sā ‘‘hetupaccayo, ārammaṇapaccayo…pe… avigatapaccayo’’ti evaṃ tikapaṭṭhānādicatuvīsatippabhedasamantapaṭṭhānadesanāya mūlabhūtapaccayabhedassa vasena bhagavatā pakaraṇassa ādimhi ṭhapitā, ayaṃ idha paṭṭhānamātikā nāma."
    ],
    "innerText": "Idāni paṭṭhānamātikāya atthasaṃvaṇṇanānayo hoti. Kenaṭṭhena paṭṭhānanti? Nānappakārapaccayaṭṭhena. Pa-saddo hi nānappakāratthaṃ dīpeti, ṭhāna-saddo paccayatthaṃ. Atha vā vibhajanaṭṭhena paṭṭhānaṃ. Yathā hi paññāpanā paṭṭhapanā vivaraṇā vibhajanā uttānīkammanti āgataṭṭhāne vibhajanaṭṭho paṭṭhānasaddasamānattho paṭṭhapanā-saddo dissati, evamidhāpi kusalādīnaṃ dhammānaṃ hetupaccayādīhi vibhajanato vibhajanaṭṭhena paṭṭhānaṃ nāma. Atha vā paṭṭhitaṭṭhena paṭṭhānaṃ, gamanaṭṭhenāti attho. Sabbadhammesu hi asaṅgagamanassa sabbaññutaññāṇassa hetupaccayādibhedabhinnesu kusalādīsu vitthāritanayalābhato nissaṅgavasena pavattagamanattā gamanaṭṭhena paṭṭhānaṃ nāma, iti nānappakārapaccayaṭṭhena, vibhajanaṭṭhena, gamanaṭṭhena ca tikapaṭṭhānādīsu catuvīsatiyā paṭṭhānesu ekekampi paṭṭhānaṃ nāma, tesaṃ pana samūhato pakaraṇaṃ paṭṭhānaṃ nāma, tesaṃ paṭṭhānānaṃ mātikā. Sayampi vā paṭṭhānabhūtā mātikā, sabbampetaṃ paṭṭhānamātikā. Yā sā ‘‘hetupaccayo, ārammaṇapaccayo…pe… avigatapaccayo’’ti evaṃ tikapaṭṭhānādicatuvīsatippabhedasamantapaṭṭhānadesanāya mūlabhūtapaccayabhedassa vasena bhagavatā pakaraṇassa ādimhi ṭhapitā, ayaṃ idha paṭṭhānamātikā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha anuttānatthādisahito saṅkhepatthavinicchayo tāva evaṃ veditabbo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetupaccayo"
      },
      "tiādīsu hi hetu ca so paccayo cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetupaccayo,"
      },
      " hetu hutvā paccayo hetupaccayo, hetubhāvena paccayoti vuttaṃ hoti. Tattha hetūti vacanāvayavakāraṇamūlānametaṃ adhivacanaṃ. ‘‘Paṭiññāhetū’’tiādīsu hi loke vacanāvayavo ‘‘hetū’’ti vuccati, sāsane pana ‘‘ye dhammā hetuppabhavā’’tiādīsu ",
      " (mahāva. 60; apa. thera 1.1.286) kāraṇaṃ, ‘‘tayo kusalā hetū, tayo akusalā hetū’’tiādīsu (dha. sa. 1059) mūlaṃ, idaṃ idha adhippetaṃ ",
      ", taṃ paṭicca etasmā etīti paccayo, apaccakkhāya naṃ vattatīti attho. Yo hi dhammo yaṃ dhammaṃ paṭicca apaccakkhāya tiṭṭhati vā uppajjati vā, so tassa upakārakalakkhaṇena paccayo nāma. Iti mūlaṭṭhena hetu, upakārakaṭṭhena paccayoti saṅkhepato mūlaṭṭhena upakārako dhammo hetupaccayo, kusalādīnaṃ kusalādibhāvasādhakoti keci, evaṃ sante pana taṃsamuṭṭhānarūpesu hetupaccayatā na sampajjati, ahetukacittānañca vinā etehi abyākatabhāvo siddho, sahetukānampi ca yonisomanasikārādipaṭibaddho kusalādibhāvo, na sampayuttahetupaṭibaddho. Yadi ca siyā, hetūsupi kusalādibhāvasādhakena aññena bhavitabbaṃ, kusalādibhāvasādhanavasena pana hetūnaṃ mūlaṭṭhaṃ aggahetvā suppatiṭṭhitabhāvasādhanavasena gayhamāne na kiñci virujjhati. Laddhahetupaccayā hi dhammā viruḷhamūlā viya pādapā thirā honti suppatiṭṭhitā, itare pana tilabījakādisevālā viya na suppatiṭṭhitā, iti mūlaṭṭhena upakārakoti suppatiṭṭhitabhāvasādhanena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetupaccayo"
      },
      "ti veditabbo."
    ],
    "innerText": "Tattha anuttānatthādisahito saṅkhepatthavinicchayo tāva evaṃ veditabbo – hetupaccayotiādīsu hi hetu ca so paccayo cāti hetupaccayo, hetu hutvā paccayo hetupaccayo, hetubhāvena paccayoti vuttaṃ hoti. Tattha hetūti vacanāvayavakāraṇamūlānametaṃ adhivacanaṃ. ‘‘Paṭiññāhetū’’tiādīsu hi loke vacanāvayavo ‘‘hetū’’ti vuccati, sāsane pana ‘‘ye dhammā hetuppabhavā’’tiādīsu (mahāva. 60; apa. thera 1.1.286) kāraṇaṃ, ‘‘tayo kusalā hetū, tayo akusalā hetū’’tiādīsu (dha. sa. 1059) mūlaṃ, idaṃ idha adhippetaṃ , taṃ paṭicca etasmā etīti paccayo, apaccakkhāya naṃ vattatīti attho. Yo hi dhammo yaṃ dhammaṃ paṭicca apaccakkhāya tiṭṭhati vā uppajjati vā, so tassa upakārakalakkhaṇena paccayo nāma. Iti mūlaṭṭhena hetu, upakārakaṭṭhena paccayoti saṅkhepato mūlaṭṭhena upakārako dhammo hetupaccayo, kusalādīnaṃ kusalādibhāvasādhakoti keci, evaṃ sante pana taṃsamuṭṭhānarūpesu hetupaccayatā na sampajjati, ahetukacittānañca vinā etehi abyākatabhāvo siddho, sahetukānampi ca yonisomanasikārādipaṭibaddho kusalādibhāvo, na sampayuttahetupaṭibaddho. Yadi ca siyā, hetūsupi kusalādibhāvasādhakena aññena bhavitabbaṃ, kusalādibhāvasādhanavasena pana hetūnaṃ mūlaṭṭhaṃ aggahetvā suppatiṭṭhitabhāvasādhanavasena gayhamāne na kiñci virujjhati. Laddhahetupaccayā hi dhammā viruḷhamūlā viya pādapā thirā honti suppatiṭṭhitā, itare pana tilabījakādisevālā viya na suppatiṭṭhitā, iti mūlaṭṭhena upakārakoti suppatiṭṭhitabhāvasādhanena upakārako dhammo hetupaccayoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Niddese ‘‘hetū hetusampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ hetupaccayena paccayo’’ti vuttaṃ, tattha ‘‘cittasamuṭṭhānāna’’nti avatvā ‘‘taṃsamuṭṭhānāna’’nti idaṃ acittasamuṭṭhānānampi saṅgaṇhanatthaṃ. Pañhāvārasmiṃ hi ‘‘paṭisandhikkhaṇe vipākābyākatā hetū sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpānaṃ hetupaccayena paccayo’’ti āgataṃ, kasmā panāyaṃ hetu paṭisandhiyameva kaṭattārūpānaṃ hetupaccayena paccayo hoti ",
      ", na pavatteti? Paṭisandhiyaṃ kammajarūpānaṃ cittapaṭibaddhavuttitāya, bhavapaṭhamanipātato cittajāti. Itararūpasantatiuppatthambhābhāvena eva dubbalavatthuṃ cittameva nissāya uppajjati ceva tiṭṭhati ca. Taṃ cittampi hi paṭisandhikkhaṇe kammavegakkhittatāya ceva apurejātavatthukatāya ca appatiṭṭhitaṃ, papāte patitamattako puriso na kiñci sippaṃ kātuṃ viya cittajarūpaṃ janetuṃ na sakkoti, tameva kaṭattārūpaṃ nissāya patiṭṭhāti. Paṭisandhicittāni hi rūpaṃ na janenti, kammajarūpameva pana tesaṃ cittasamuṭṭhānarūpaṭṭhāne tiṭṭhati, pavattiyaṃ pana paṭiladdhupatthambhatāya taṃ rūpaṃ vināpi kammapaṭibaddhāva pavatti, hetupaccayassa panettha kusalādibhedato, bhūmibhedato ca vibhāgo heṭṭhā vuttanayeneva veditabboti ayaṃ hetupaccaye nayo."
    ],
    "innerText": "Niddese ‘‘hetū hetusampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ hetupaccayena paccayo’’ti vuttaṃ, tattha ‘‘cittasamuṭṭhānāna’’nti avatvā ‘‘taṃsamuṭṭhānāna’’nti idaṃ acittasamuṭṭhānānampi saṅgaṇhanatthaṃ. Pañhāvārasmiṃ hi ‘‘paṭisandhikkhaṇe vipākābyākatā hetū sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpānaṃ hetupaccayena paccayo’’ti āgataṃ, kasmā panāyaṃ hetu paṭisandhiyameva kaṭattārūpānaṃ hetupaccayena paccayo hoti , na pavatteti? Paṭisandhiyaṃ kammajarūpānaṃ cittapaṭibaddhavuttitāya, bhavapaṭhamanipātato cittajāti. Itararūpasantatiuppatthambhābhāvena eva dubbalavatthuṃ cittameva nissāya uppajjati ceva tiṭṭhati ca. Taṃ cittampi hi paṭisandhikkhaṇe kammavegakkhittatāya ceva apurejātavatthukatāya ca appatiṭṭhitaṃ, papāte patitamattako puriso na kiñci sippaṃ kātuṃ viya cittajarūpaṃ janetuṃ na sakkoti, tameva kaṭattārūpaṃ nissāya patiṭṭhāti. Paṭisandhicittāni hi rūpaṃ na janenti, kammajarūpameva pana tesaṃ cittasamuṭṭhānarūpaṭṭhāne tiṭṭhati, pavattiyaṃ pana paṭiladdhupatthambhatāya taṃ rūpaṃ vināpi kammapaṭibaddhāva pavatti, hetupaccayassa panettha kusalādibhedato, bhūmibhedato ca vibhāgo heṭṭhā vuttanayeneva veditabboti ayaṃ hetupaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato paresu ārammaṇabhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇapaccayo,"
      },
      " so niddese ‘‘rūpāyatanaṃ cakkhuviññāṇadhātuyā…pe… phoṭṭhabbāyatanaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca ",
      " dhammānaṃ…pe… rūpāyatanaṃ saddagandharasaphoṭṭhabbāyatanaṃ manodhātuyā…pe… sabbe dhammā manoviññāṇadhātuyā…pe… yaṃ yaṃ dhammaṃ ārabbha ye ye dhammā uppajjanti cittacetasikā dhammā, te te dhammā tesaṃ tesaṃ dhammānaṃ ārammaṇapaccayena paccayo’’ti evaṃ niddiṭṭhattā na koci dhammo na hoti. Yathā hi dubbalapuriso daṇḍaṃ vā rajjuṃ vā ālambitvā uṭṭhahati ceva tiṭṭhati ca, evaṃ cittacetasikā dhammā rūpādīsu chasu yaṃ kiñci ālambitvā uppajjanti ceva tiṭṭhanti ca, tasmā lokiyalokuttarādibhedā sabbepi dhammā yathāyogaṃ cittacetasikānaṃ ārammaṇapaccayoti veditabboti ayaṃ ārammaṇapaccaye nayo."
    ],
    "innerText": "Tato paresu ārammaṇabhāvena upakārako dhammo ārammaṇapaccayo, so niddese ‘‘rūpāyatanaṃ cakkhuviññāṇadhātuyā…pe… phoṭṭhabbāyatanaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ…pe… rūpāyatanaṃ saddagandharasaphoṭṭhabbāyatanaṃ manodhātuyā…pe… sabbe dhammā manoviññāṇadhātuyā…pe… yaṃ yaṃ dhammaṃ ārabbha ye ye dhammā uppajjanti cittacetasikā dhammā, te te dhammā tesaṃ tesaṃ dhammānaṃ ārammaṇapaccayena paccayo’’ti evaṃ niddiṭṭhattā na koci dhammo na hoti. Yathā hi dubbalapuriso daṇḍaṃ vā rajjuṃ vā ālambitvā uṭṭhahati ceva tiṭṭhati ca, evaṃ cittacetasikā dhammā rūpādīsu chasu yaṃ kiñci ālambitvā uppajjanti ceva tiṭṭhanti ca, tasmā lokiyalokuttarādibhedā sabbepi dhammā yathāyogaṃ cittacetasikānaṃ ārammaṇapaccayoti veditabboti ayaṃ ārammaṇapaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Jeṭṭhakaṭṭhena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhipatipaccayo,"
      },
      " so niddese ‘‘chandādhipati chandasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca ",
      " rūpānaṃ…pe… vīriyacittavīmaṃsādhipati…pe… adhipatipaccayena paccayo, yaṃ yaṃ dhammaṃ garuṃ katvā ye ye dhammā uppajjanti cittacetasikā dhammā, te te dhammā tesaṃ tesaṃ dhammānaṃ adhipatipaccayena paccayo’’ti evaṃ dvidhā niddiṭṭho. Tattha chandādayo sahajātādhipatibhāvena vuttā, garukātabbaṃ ārammaṇādhipatibhāvena. Tattha ca lokiyakusalabhūto ārammaṇādhipati lokiyakusalānañceva lobhasahagatacittānañca ārammaṇādhipati hoti, nāññassa, akusalabhūto pana lobhasahagatacittuppādoti vuccati itaresu garukātabbatāya abhāvato, so dvihetukāhetukādilokiyavipākarūpakkhandhabhūto ca lobhasahagatasseva, nāññassa, tathā kiriyabhūtopīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathāyaṃ"
      },
      " āgataṃ, taṃ ñāṇasampayuttakiriyānaṃ sabbaññutaññāṇābhiññādipubbavasappavattānaṃ kāmāvacarakusalehi garukātabbabhāvassāvirodhabhāvassa dassanato vīmaṃsitabbaṃ. Lokuttarakusalāni pana kāmāvacarañāṇasampayuttajavanānameva ārammaṇādhipatipaccayā honti, nibbānaṃ pana tesaññeva lokuttarakusalavipākānañcāti veditabbanti ayaṃ adhipatipaccaye nayo."
    ],
    "innerText": "Jeṭṭhakaṭṭhena upakārako dhammo adhipatipaccayo, so niddese ‘‘chandādhipati chandasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ…pe… vīriyacittavīmaṃsādhipati…pe… adhipatipaccayena paccayo, yaṃ yaṃ dhammaṃ garuṃ katvā ye ye dhammā uppajjanti cittacetasikā dhammā, te te dhammā tesaṃ tesaṃ dhammānaṃ adhipatipaccayena paccayo’’ti evaṃ dvidhā niddiṭṭho. Tattha chandādayo sahajātādhipatibhāvena vuttā, garukātabbaṃ ārammaṇādhipatibhāvena. Tattha ca lokiyakusalabhūto ārammaṇādhipati lokiyakusalānañceva lobhasahagatacittānañca ārammaṇādhipati hoti, nāññassa, akusalabhūto pana lobhasahagatacittuppādoti vuccati itaresu garukātabbatāya abhāvato, so dvihetukāhetukādilokiyavipākarūpakkhandhabhūto ca lobhasahagatasseva, nāññassa, tathā kiriyabhūtopīti aṭṭhakathāyaṃ āgataṃ, taṃ ñāṇasampayuttakiriyānaṃ sabbaññutaññāṇābhiññādipubbavasappavattānaṃ kāmāvacarakusalehi garukātabbabhāvassāvirodhabhāvassa dassanato vīmaṃsitabbaṃ. Lokuttarakusalāni pana kāmāvacarañāṇasampayuttajavanānameva ārammaṇādhipatipaccayā honti, nibbānaṃ pana tesaññeva lokuttarakusalavipākānañcāti veditabbanti ayaṃ adhipatipaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anantarabhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantarapaccayo,"
      },
      " sova ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samanantarapaccayo,"
      },
      " byañjanamattameva nānaṃ ‘‘upacayasantatī’’tiādīsu viya. Yampi ‘‘atthānantaratāya anantarapaccayo, kālānantaratāya samanantarapaccayo’’ti ācariyānaṃ mataṃ, taṃ ‘‘nirodhā vuṭṭhahantassa nevasaññānāsaññāyatanakusalaṃ phalasamāpattiyā samanantarapaccayena paccayo’’tiādīhi virujjhati, taṃniddese ‘‘cakkhuviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā…pe… kāyaviññāṇadhātu…pe… manodhātu…pe… manoviññāṇadhātuyā…pe… purimā purimā kusalā ",
      " dhammā pacchimānaṃ pacchimānaṃ ",
      " kusalānaṃ dhammānaṃ…pe… abyākatānaṃ dhammānaṃ…pe… purimā purimā akusalā dhammā pacchimānaṃ pacchimānaṃ akusalānaṃ…pe… abyākatānaṃ…pe… yesaṃ yesaṃ dhammānaṃ anantarā ye ye dhammā uppajjanti cittacetasikā dhammā, te te dhammā tesaṃ tesaṃ dhammānaṃ anantarapaccayena paccayo’’ti iminā anantarapaccayaniddesasamako eva samanantarapaccayo niddiṭṭho aññatra nāmanānāttāti ayaṃ anantarasamanantarapaccayadvaye nayo."
    ],
    "innerText": "Anantarabhāvena upakārako dhammo anantarapaccayo, sova samanantarapaccayo, byañjanamattameva nānaṃ ‘‘upacayasantatī’’tiādīsu viya. Yampi ‘‘atthānantaratāya anantarapaccayo, kālānantaratāya samanantarapaccayo’’ti ācariyānaṃ mataṃ, taṃ ‘‘nirodhā vuṭṭhahantassa nevasaññānāsaññāyatanakusalaṃ phalasamāpattiyā samanantarapaccayena paccayo’’tiādīhi virujjhati, taṃniddese ‘‘cakkhuviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā…pe… kāyaviññāṇadhātu…pe… manodhātu…pe… manoviññāṇadhātuyā…pe… purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ…pe… abyākatānaṃ dhammānaṃ…pe… purimā purimā akusalā dhammā pacchimānaṃ pacchimānaṃ akusalānaṃ…pe… abyākatānaṃ…pe… yesaṃ yesaṃ dhammānaṃ anantarā ye ye dhammā uppajjanti cittacetasikā dhammā, te te dhammā tesaṃ tesaṃ dhammānaṃ anantarapaccayena paccayo’’ti iminā anantarapaccayaniddesasamako eva samanantarapaccayo niddiṭṭho aññatra nāmanānāttāti ayaṃ anantarasamanantarapaccayadvaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Uppajjamānova saha uppajjamānabhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahajātapaccayo,"
      },
      " so niddese ‘‘cattāro khandhā arūpino aññamaññaṃ sahajātapaccayena paccayo, cattāro mahābhūtā aññamaññaṃ…pe… okkantikkhaṇe nāmarūpaṃ aññamaññaṃ…pe… cittacetasikā dhammā cittasamuṭṭhānānaṃ rūpānaṃ…pe… mahābhūtā upādārūpānaṃ…pe… rūpino dhammā arūpīnaṃ dhammānaṃ kiñcikāle sahajātapaccayena paccayo, kiñcikāle nasahajātapaccayena paccayo’’ti evaṃ chabbidho niddiṭṭho. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññamañña"
      },
      "nti iminā tesaṃ dhammānaṃ ekakkhaṇe paccayabhāvañceva paccayuppannabhāvañca dīpeti, paṭisandhikkhaṇe vatthurūpaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpaṃ"
      },
      " nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittacetasikā"
      },
      "ti pavattiyaṃ cattāro khandhā, paṭisandhiyampīti keci tattha kaṭattārūpānampi cittasamuṭṭhāne paviṭṭhattā. Tesaṃ hi paṭisandhicittacetasikā sahajātapaccayā hontiyeva, tāni pana vatthuvirahitāni rūpāni pavattiyaṃ cittasamuṭṭhānānaṃ viya cittacetasikānaṃ paccayatthaṃ na pharanti, tasmā ‘‘aññamañña’’nti na vuttaṃ, tathā bhūtānaṃ upādārūpaṃ. Evaṃ hi agayhamāne paṭisandhiyaṃ kaṭattārūpānaṃ sahajātā nāma nissayatā na vuttāti sahajātapaccayaniddeso aparipuṇṇo eva siyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiñcikāle"
      },
      "ti idampi okkantikkhaṇe hadayavatthumeva sandhāya vuttattā tatiyakoṭṭhāsameva bhajatīti atthato ayaṃ paccayo pañcavidhoti ayaṃ sahajātapaccaye nayo."
    ],
    "innerText": "Uppajjamānova saha uppajjamānabhāvena upakārako dhammo sahajātapaccayo, so niddese ‘‘cattāro khandhā arūpino aññamaññaṃ sahajātapaccayena paccayo, cattāro mahābhūtā aññamaññaṃ…pe… okkantikkhaṇe nāmarūpaṃ aññamaññaṃ…pe… cittacetasikā dhammā cittasamuṭṭhānānaṃ rūpānaṃ…pe… mahābhūtā upādārūpānaṃ…pe… rūpino dhammā arūpīnaṃ dhammānaṃ kiñcikāle sahajātapaccayena paccayo, kiñcikāle nasahajātapaccayena paccayo’’ti evaṃ chabbidho niddiṭṭho. Tattha aññamaññanti iminā tesaṃ dhammānaṃ ekakkhaṇe paccayabhāvañceva paccayuppannabhāvañca dīpeti, paṭisandhikkhaṇe vatthurūpaṃ rūpaṃ nāma. Cittacetasikāti pavattiyaṃ cattāro khandhā, paṭisandhiyampīti keci tattha kaṭattārūpānampi cittasamuṭṭhāne paviṭṭhattā. Tesaṃ hi paṭisandhicittacetasikā sahajātapaccayā hontiyeva, tāni pana vatthuvirahitāni rūpāni pavattiyaṃ cittasamuṭṭhānānaṃ viya cittacetasikānaṃ paccayatthaṃ na pharanti, tasmā ‘‘aññamañña’’nti na vuttaṃ, tathā bhūtānaṃ upādārūpaṃ. Evaṃ hi agayhamāne paṭisandhiyaṃ kaṭattārūpānaṃ sahajātā nāma nissayatā na vuttāti sahajātapaccayaniddeso aparipuṇṇo eva siyā. Kiñcikāleti idampi okkantikkhaṇe hadayavatthumeva sandhāya vuttattā tatiyakoṭṭhāsameva bhajatīti atthato ayaṃ paccayo pañcavidhoti ayaṃ sahajātapaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aññamaññaṃ ",
      " uppādanupatthambhanabhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññamaññapaccayo"
      },
      " tidaṇḍakaṃ viya. So niddese ‘‘cattāro khandhā arūpino aññamaññapaccayena paccayo, cattāro mahābhūtā…pe… okkantikkhaṇe nāmarūpaṃ aññamaññapaccayena paccayo’’ti evaṃ tidhā niddiṭṭhoti ayaṃ aññamaññapaccaye nayo."
    ],
    "innerText": "Aññamaññaṃ uppādanupatthambhanabhāvena upakārako dhammo aññamaññapaccayo tidaṇḍakaṃ viya. So niddese ‘‘cattāro khandhā arūpino aññamaññapaccayena paccayo, cattāro mahābhūtā…pe… okkantikkhaṇe nāmarūpaṃ aññamaññapaccayena paccayo’’ti evaṃ tidhā niddiṭṭhoti ayaṃ aññamaññapaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Adhiṭṭhānākārena, nissayākārena ca upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissayapaccayo"
      },
      " tarucittakammādīnaṃ pathavīpaṭādayo viya, so niddese sahajātapaccaye viya chadhāva niddiṭṭho. Chaṭṭho panettha koṭṭhāso ‘‘cakkhāyatanaṃ ",
      " cakkhuviññāṇadhātuyā, sotaghānajivhākāyāyatanaṃ kāyaviññāṇadhātuyā…pe… yaṃ rūpaṃ nissāya manodhātu ca manoviññāṇadhātu ca vattanti, taṃ rūpaṃ manodhātuyā ca manoviññāṇadhātuyā ca taṃsampayuttakānañca dhammānaṃ nissayapaccayena paccayo’’ti evaṃ purejātanissayadassanavasena vibhatto, sesaṃ tādisameva. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpa"
      },
      "nti hadayavatthu."
    ],
    "innerText": "Adhiṭṭhānākārena, nissayākārena ca upakārako dhammo nissayapaccayo tarucittakammādīnaṃ pathavīpaṭādayo viya, so niddese sahajātapaccaye viya chadhāva niddiṭṭho. Chaṭṭho panettha koṭṭhāso ‘‘cakkhāyatanaṃ cakkhuviññāṇadhātuyā, sotaghānajivhākāyāyatanaṃ kāyaviññāṇadhātuyā…pe… yaṃ rūpaṃ nissāya manodhātu ca manoviññāṇadhātu ca vattanti, taṃ rūpaṃ manodhātuyā ca manoviññāṇadhātuyā ca taṃsampayuttakānañca dhammānaṃ nissayapaccayena paccayo’’ti evaṃ purejātanissayadassanavasena vibhatto, sesaṃ tādisameva. Tattha rūpanti hadayavatthu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Upanissayapaccayoti ettha panāyaṃ vacanattho – tadadhīnavuttitāya attano phalena nissito, nappaṭikkhittoti nissayo, yathā pana bhuso āyāso upāyāso, evaṃ bhuso nissayo upanissayo, balavakāraṇassetaṃ adhivacanaṃ, tasmā balavakāraṇabhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upanissayapaccayo"
      },
      "ti veditabbo. So ārammaṇūpanissayo anantarūpanissayo pakatūpanissayoti tividho hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇūpanissayo"
      },
      " tāva ārammaṇādhipatinā saddhiṃ nānattaṃ akatvā vibhatto. Tattha yaṃ ārammaṇaṃ garuṃ katvā cittacetasikā uppajjanti, taṃ niyamato tesaṃ ārammaṇesu balavārammaṇaṃ hoti, iti garukātabbamattaṭṭhena ārammaṇādhipati, balavakāraṇaṭṭhena ārammaṇūpanissayoti evametesaṃ nānattaṃ veditabbaṃ."
    ],
    "innerText": "Upanissayapaccayoti ettha panāyaṃ vacanattho – tadadhīnavuttitāya attano phalena nissito, nappaṭikkhittoti nissayo, yathā pana bhuso āyāso upāyāso, evaṃ bhuso nissayo upanissayo, balavakāraṇassetaṃ adhivacanaṃ, tasmā balavakāraṇabhāvena upakārako dhammo upanissayapaccayoti veditabbo. So ārammaṇūpanissayo anantarūpanissayo pakatūpanissayoti tividho hoti. Tattha ārammaṇūpanissayo tāva ārammaṇādhipatinā saddhiṃ nānattaṃ akatvā vibhatto. Tattha yaṃ ārammaṇaṃ garuṃ katvā cittacetasikā uppajjanti, taṃ niyamato tesaṃ ārammaṇesu balavārammaṇaṃ hoti, iti garukātabbamattaṭṭhena ārammaṇādhipati, balavakāraṇaṭṭhena ārammaṇūpanissayoti evametesaṃ nānattaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anantarūpanissayopi"
      },
      " anantarapaccayena nānattaṃ akatvāva vibhatto, evaṃ santepi attano attano anantaraṃ anurūpassa cittuppādassa pavattanasamatthatāya anantaratā, purimacittassa pacchimacittuppādane balavatāya anantarūpanissayatā ca veditabbā. Yathā hi hetupaccayādīsu kañci dhammaṃ vināpi cittaṃ uppajjati, na evaṃ anantaracittaṃ vinā cittassa uppatti nāma atthi, tasmā balavapaccayo hoti, iti balavakāraṇaṭṭhena anantarova anantarūpanissayoti evametesaṃ nānattaṃ veditabbaṃ."
    ],
    "innerText": "Anantarūpanissayopi anantarapaccayena nānattaṃ akatvāva vibhatto, evaṃ santepi attano attano anantaraṃ anurūpassa cittuppādassa pavattanasamatthatāya anantaratā, purimacittassa pacchimacittuppādane balavatāya anantarūpanissayatā ca veditabbā. Yathā hi hetupaccayādīsu kañci dhammaṃ vināpi cittaṃ uppajjati, na evaṃ anantaracittaṃ vinā cittassa uppatti nāma atthi, tasmā balavapaccayo hoti, iti balavakāraṇaṭṭhena anantarova anantarūpanissayoti evametesaṃ nānattaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pakato upanissayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pakatūpanissayo,"
      },
      " pakato nāma attano santāne uppādito vā saddhāsīlādiupasevito vā utubhojanādipakatiyāyeva vā upanissayo pakatūpanissayo, iti parūpanissayena amissoti attho. So ca pakatūpanissayo ‘‘saddhaṃ upanissāya dānaṃ deti, sīlaṃ samādiyati, uposathakammaṃ karoti, jhānaṃ uppādeti; vipassanaṃ, maggaṃ, abhiññaṃ, samāpattiṃ uppādeti; sīlaṃ, sutaṃ, cāgaṃ, paññaṃ upanissāya dānaṃ deti…pe… samāpattiṃ uppādetī’’tiādinā imesaṃ saddhādīnaṃ vasena bahudhā vibhatto, evaṃ upanissayapaccayo tividho. Niddese panāyaṃ ‘‘purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ ",
      " …pe… akusalānaṃ kesañci…pe… abyākatānaṃ dhammānaṃ…pe… purimā purimā akusalā dhammā pacchimānaṃ pacchimānaṃ akusalānaṃ…pe… kusalānaṃ kesañci…pe… abyākatānaṃ dhammānaṃ…pe… purimā purimā abyākatā dhammā…pe… abyākatānaṃ, kusalānaṃ, akusalānaṃ upanissayapaccayena paccayo, puggalopi upanissayapaccayena paccayo, senāsanampī’’ti evaṃ niddiṭṭho. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purimā"
      },
      "ti anantarūpanissaye samanantarātītāva labbhanti."
    ],
    "innerText": "Pakato upanissayo pakatūpanissayo, pakato nāma attano santāne uppādito vā saddhāsīlādiupasevito vā utubhojanādipakatiyāyeva vā upanissayo pakatūpanissayo, iti parūpanissayena amissoti attho. So ca pakatūpanissayo ‘‘saddhaṃ upanissāya dānaṃ deti, sīlaṃ samādiyati, uposathakammaṃ karoti, jhānaṃ uppādeti; vipassanaṃ, maggaṃ, abhiññaṃ, samāpattiṃ uppādeti; sīlaṃ, sutaṃ, cāgaṃ, paññaṃ upanissāya dānaṃ deti…pe… samāpattiṃ uppādetī’’tiādinā imesaṃ saddhādīnaṃ vasena bahudhā vibhatto, evaṃ upanissayapaccayo tividho. Niddese panāyaṃ ‘‘purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ …pe… akusalānaṃ kesañci…pe… abyākatānaṃ dhammānaṃ…pe… purimā purimā akusalā dhammā pacchimānaṃ pacchimānaṃ akusalānaṃ…pe… kusalānaṃ kesañci…pe… abyākatānaṃ dhammānaṃ…pe… purimā purimā abyākatā dhammā…pe… abyākatānaṃ, kusalānaṃ, akusalānaṃ upanissayapaccayena paccayo, puggalopi upanissayapaccayena paccayo, senāsanampī’’ti evaṃ niddiṭṭho. Tattha purimāti anantarūpanissaye samanantarātītāva labbhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ārammaṇūpanissayapakatūpanissayesu ",
      " pana nānāvidhivasena purimatarāvāti tayopi rāsī kusalena kusalapade labbhanti. Kusalena panākusale samanantarātītā na labbhanti, tenāha ‘‘kesañcī’’ti. Idaṃ hi ‘‘kusalo dhammo akusalassa dhammassa ārammaṇūpanissayo pakatūpanissayo, ārammaṇūpanissayo pana dānaṃ datvā…pe… taṃ garuṃ katvā rāgo uppajjati…pe… pakatūpanissayo saddhaṃ upanissāya mānaṃ jappetī’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañhāvāre"
      },
      " āgataṃ imaṃ nayaṃ sandhāya vuttaṃ."
    ],
    "innerText": "Ārammaṇūpanissayapakatūpanissayesu pana nānāvidhivasena purimatarāvāti tayopi rāsī kusalena kusalapade labbhanti. Kusalena panākusale samanantarātītā na labbhanti, tenāha ‘‘kesañcī’’ti. Idaṃ hi ‘‘kusalo dhammo akusalassa dhammassa ārammaṇūpanissayo pakatūpanissayo, ārammaṇūpanissayo pana dānaṃ datvā…pe… taṃ garuṃ katvā rāgo uppajjati…pe… pakatūpanissayo saddhaṃ upanissāya mānaṃ jappetī’’tiādinā pañhāvāre āgataṃ imaṃ nayaṃ sandhāya vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Akusalena kusalapade hi samanantarātītā na labbhanti, tenāha ‘‘kesañcī’’ti. Idaṃ pana ‘‘akusalo dhammo kusalassa dhammassa pakatūpanissayo. Rāgaṃ upanissāya dānaṃ deti…pe… pāṇaṃ hantvā tassa paṭighātatthāya dānaṃ detī’’tiādinā nayena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañhāvāre"
      },
      " āgataṃ pakatūpanissayameva sandhāya vuttaṃ. Yathā hi akusalaṃ kusalassa anantarūpanissayo na hoti, tathā ārammaṇūpanissayopi na hoti. Na hi taṃ garuṃ katvā kusalaṃ pavattati."
    ],
    "innerText": "Akusalena kusalapade hi samanantarātītā na labbhanti, tenāha ‘‘kesañcī’’ti. Idaṃ pana ‘‘akusalo dhammo kusalassa dhammassa pakatūpanissayo. Rāgaṃ upanissāya dānaṃ deti…pe… pāṇaṃ hantvā tassa paṭighātatthāya dānaṃ detī’’tiādinā nayena pañhāvāre āgataṃ pakatūpanissayameva sandhāya vuttaṃ. Yathā hi akusalaṃ kusalassa anantarūpanissayo na hoti, tathā ārammaṇūpanissayopi na hoti. Na hi taṃ garuṃ katvā kusalaṃ pavattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalena abyākatapade pana ārammaṇūpanissayova na labbhati. Na hi taṃ abyākatā garuṃ karonti, anantarā panassa honti. Tenevettha ‘‘kesañcī’’ti na vuttaṃ. Sesapadesu tayopi upanissayā labbhanteva. ‘‘Puggalopi, senāsanampī’’ti idampi dvayaṃ pakatūpanissayavasenevettha vuttaṃ, utubhojanādayo cettha saṅgahetabbā. Imasmiñca paccaye ekaccāya paññattiyā saddhiṃ sabbepi catubhūmakā dhammā saṅgahitāti veditabbāti ayaṃ upanissayapaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭhamataraṃ uppajjitvā vattamānabhāvena upakārakā rūpadhammā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purejātapaccayo,"
      },
      " so pasādatabbisayahadayavatthuvasena ekādasavidho. Niddese ca ‘‘cakkhāyatanaṃ cakkhuviññāṇadhātuyā ",
      " taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo…pe… kāyāyatanaṃ kāyaviññāṇadhātuyā ",
      " …pe… rūpāyatanaṃ cakkhuviññāṇadhātuyā…pe… phoṭṭhabbāyatanaṃ kāyaviññāṇadhātuyā…pe… rūpāyatanaṃ saddagandharasaphoṭṭhabbāyatanaṃ manodhātuyā…pe… yaṃ rūpaṃ nissāya…pe… taṃ rūpaṃ manodhātuyā ca manoviññāṇadhātuyā ca kiñcikāle purejātapaccayena paccayo, kiñcikāle na purejātapaccayena paccayo’’ti evaṃ sabbathāpi pañcadvāre vatthārammaṇavasena, manodvāre vatthuvaseneva cāyaṃ niddiṭṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañhāvāre"
      },
      " pana ārammaṇapurejātaṃ ‘‘arahā cakkhuṃ aniccato dukkhato anattato vipassatī’’ti āgatattā manodvārepi aṭṭhārasannaṃ rūpānaṃ vasena ārammaṇapurejātampi labbhatevāti ayaṃ purejātapaccaye nayo."
    ],
    "innerText": "Paṭhamataraṃ uppajjitvā vattamānabhāvena upakārakā rūpadhammā purejātapaccayo, so pasādatabbisayahadayavatthuvasena ekādasavidho. Niddese ca ‘‘cakkhāyatanaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo…pe… kāyāyatanaṃ kāyaviññāṇadhātuyā …pe… rūpāyatanaṃ cakkhuviññāṇadhātuyā…pe… phoṭṭhabbāyatanaṃ kāyaviññāṇadhātuyā…pe… rūpāyatanaṃ saddagandharasaphoṭṭhabbāyatanaṃ manodhātuyā…pe… yaṃ rūpaṃ nissāya…pe… taṃ rūpaṃ manodhātuyā ca manoviññāṇadhātuyā ca kiñcikāle purejātapaccayena paccayo, kiñcikāle na purejātapaccayena paccayo’’ti evaṃ sabbathāpi pañcadvāre vatthārammaṇavasena, manodvāre vatthuvaseneva cāyaṃ niddiṭṭho. Pañhāvāre pana ārammaṇapurejātaṃ ‘‘arahā cakkhuṃ aniccato dukkhato anattato vipassatī’’ti āgatattā manodvārepi aṭṭhārasannaṃ rūpānaṃ vasena ārammaṇapurejātampi labbhatevāti ayaṃ purejātapaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Purejātānaṃ rūpadhammānaṃ upatthambhakaṭṭhena upakārako arūpadhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pacchājātapaccayo"
      },
      " gijjhapotakasarīrānaṃ āhārāsā cetanā viya. Niddesepi cassa ‘‘pacchājātā cittacetasikā dhammā purejātassa imassa kāyassa pacchājātapaccayena paccayo’’ti evaṃ vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "imassa kāyassā"
      },
      "ti catusamuṭṭhānikatisamuṭṭhānikabhūtupādāyarūpakāyassa. Dhammato cāyaṃ ṭhapetvā paṭisandhivipāke āruppavipāke avasesā sabbe catubhūmakā arūpadhammāti veditabbāti ayaṃ pacchājātapaccaye nayo."
    ],
    "innerText": "Purejātānaṃ rūpadhammānaṃ upatthambhakaṭṭhena upakārako arūpadhammo pacchājātapaccayo gijjhapotakasarīrānaṃ āhārāsā cetanā viya. Niddesepi cassa ‘‘pacchājātā cittacetasikā dhammā purejātassa imassa kāyassa pacchājātapaccayena paccayo’’ti evaṃ vuttaṃ. Tattha imassa kāyassāti catusamuṭṭhānikatisamuṭṭhānikabhūtupādāyarūpakāyassa. Dhammato cāyaṃ ṭhapetvā paṭisandhivipāke āruppavipāke avasesā sabbe catubhūmakā arūpadhammāti veditabbāti ayaṃ pacchājātapaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Āsevanaṭṭhena anantarānaṃ paguṇabalavabhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āsevanapaccayo"
      },
      " ganthādipurimābhiyogo viya. So kusalākusalakiriyajavanavasena tividho. Niddese panassa ‘‘purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ…pe… akusalānaṃ dhammānaṃ…pe… kiriyābyākatānaṃ dhammānaṃ āsevanapaccayena paccayo’’ti niddiṭṭho. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purimā purimā"
      },
      "ti sabbattha samanantarātītāva daṭṭhabbā, tatthāpi ",
      " kusalādayo abyākatādīnaṃ bhinnajātikānaṃ samanantarānampi vāsanāsaṅkhātena āsevanena paguṇatarabalavabhāvavisiṭṭhaṃ attano kusalādibhāvasaṅkhātagatiṃ gāhāpetuṃ asamatthatāya āsevanapaccayā na honti, bhūmito, pana ārammaṇato ca bhinnāpi kāmāvacaratihetukakusalakiriyā attanā sadisavedanānameva mahaggatalokuttarakusalakiriyānampi, saṅkhārārammaṇañca anulomakusalaṃ nibbānārammaṇassa gotrabhukusalassa āsevanapaccayā hontiyeva. Lokuttaro pana āsevanapaccayo natthi, tathā vipāko kammapariṇāmitattāti ayaṃ āsevanapaccaye nayo."
    ],
    "innerText": "Āsevanaṭṭhena anantarānaṃ paguṇabalavabhāvena upakārako dhammo āsevanapaccayo ganthādipurimābhiyogo viya. So kusalākusalakiriyajavanavasena tividho. Niddese panassa ‘‘purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ…pe… akusalānaṃ dhammānaṃ…pe… kiriyābyākatānaṃ dhammānaṃ āsevanapaccayena paccayo’’ti niddiṭṭho. Tattha purimā purimāti sabbattha samanantarātītāva daṭṭhabbā, tatthāpi kusalādayo abyākatādīnaṃ bhinnajātikānaṃ samanantarānampi vāsanāsaṅkhātena āsevanena paguṇatarabalavabhāvavisiṭṭhaṃ attano kusalādibhāvasaṅkhātagatiṃ gāhāpetuṃ asamatthatāya āsevanapaccayā na honti, bhūmito, pana ārammaṇato ca bhinnāpi kāmāvacaratihetukakusalakiriyā attanā sadisavedanānameva mahaggatalokuttarakusalakiriyānampi, saṅkhārārammaṇañca anulomakusalaṃ nibbānārammaṇassa gotrabhukusalassa āsevanapaccayā hontiyeva. Lokuttaro pana āsevanapaccayo natthi, tathā vipāko kammapariṇāmitattāti ayaṃ āsevanapaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cittappayogasaṅkhātena kiriyabhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammapaccayo"
      },
      ". So nānakkhaṇikāya ",
      " kusalākusalacetanāya ceva sahajātāya ca sabbāyapi cetanāya vasena duvidho hoti. Niddesepi cassa ‘‘kusalākusalaṃ kammaṃ vipākānaṃ khandhānaṃ kaṭattā ca rūpānaṃ…pe… cetanā sampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ kammapaccayena paccayo’’ti dvidhāva vutto. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kamma"
      },
      "nti cetanākammameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṭattā ca rūpāna"
      },
      "nti kammassa kaṭattā upacitattā nipphāditattā uppannānaṃ kammajānaṃ rūpānaṃ kaṭattā eva, kammampi kālantareyeva avasesapaccayasamāyoge sati attano phalaṃ uppādeti, na tu vinaṭṭhattā ṭhitattā taṃ vā ṭhitaṃ pana kammaṃ na janeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ taṃsamuṭṭhāna"
      },
      "nti iminā paṭisandhiyaṃ kaṭattārūpaggahaṇaṃ daṭṭhabbanti ayaṃ kammapaccaye nayo."
    ],
    "innerText": "Cittappayogasaṅkhātena kiriyabhāvena upakārako dhammo kammapaccayo. So nānakkhaṇikāya kusalākusalacetanāya ceva sahajātāya ca sabbāyapi cetanāya vasena duvidho hoti. Niddesepi cassa ‘‘kusalākusalaṃ kammaṃ vipākānaṃ khandhānaṃ kaṭattā ca rūpānaṃ…pe… cetanā sampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ kammapaccayena paccayo’’ti dvidhāva vutto. Tattha kammanti cetanākammameva. Kaṭattā ca rūpānanti kammassa kaṭattā upacitattā nipphāditattā uppannānaṃ kammajānaṃ rūpānaṃ kaṭattā eva, kammampi kālantareyeva avasesapaccayasamāyoge sati attano phalaṃ uppādeti, na tu vinaṭṭhattā ṭhitattā taṃ vā ṭhitaṃ pana kammaṃ na janeti. Evaṃ taṃsamuṭṭhānanti iminā paṭisandhiyaṃ kaṭattārūpaggahaṇaṃ daṭṭhabbanti ayaṃ kammapaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nirussāhasantabhāvena nirussāhasantabhāvāya upakārako vipākadhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipākapaccayo"
      },
      ". So pavatte cittasamuṭṭhānānaṃ, paṭisandhikkhaṇe kaṭattārūpānaṃ, sabbattha ca sampayuttadhammānaṃ paccayo hoti. Yathāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbapañhāvāre"
      },
      " – ‘‘vipākābyākato ",
      " eko khandho tiṇṇannaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ paṭisandhikkhaṇe…pe… kaṭattā ca rūpānaṃ vipākapaccayena paccayo’’tiādi. Niddese panassa ‘‘vipākā cattāro khandhā arūpino aññamaññaṃ vipākapaccayena paccayo’’ti ettakameva vuttaṃ. Taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañhāvāre"
      },
      " vuttavidhānaṃ sandhāya sāvasesaṃ vuttanti ayaṃ vipākapaccaye nayo."
    ],
    "innerText": "Nirussāhasantabhāvena nirussāhasantabhāvāya upakārako vipākadhammo vipākapaccayo. So pavatte cittasamuṭṭhānānaṃ, paṭisandhikkhaṇe kaṭattārūpānaṃ, sabbattha ca sampayuttadhammānaṃ paccayo hoti. Yathāha sabbapañhāvāre – ‘‘vipākābyākato eko khandho tiṇṇannaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ paṭisandhikkhaṇe…pe… kaṭattā ca rūpānaṃ vipākapaccayena paccayo’’tiādi. Niddese panassa ‘‘vipākā cattāro khandhā arūpino aññamaññaṃ vipākapaccayena paccayo’’ti ettakameva vuttaṃ. Taṃ pañhāvāre vuttavidhānaṃ sandhāya sāvasesaṃ vuttanti ayaṃ vipākapaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rūpārūpānaṃ upatthambhakaṭṭhena upakārakā cattāro āhārā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āhārapaccayo"
      },
      ". Niddese pana ‘‘kabaḷīkāro āhāro imassa kāyassa…pe… arūpino āhārā sampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ āhārapaccayena paccayo’’ti evaṃ niddiṭṭho. Tattha catusamuṭṭhānamupagatā ojā kabaḷīkāro āhāro nāma. So yasmā āhārūpasevīnaññeva ajjhohaṭāhārautujāhārūpatthaddho eva ca kammajādiāhāro imassa kāyassa ṭhitiyā pavattati, na aññathā, tasmā kabaḷīkātabbautujavatthusannissitatādassanatthaṃ kabaḷīkāro āhāroti vutto. Kiñcāpi cāyaṃ ‘‘imassa kāyassā’’ti avisesena vutto, visesato pana āhārajarūpassa janako ceva anupālako ca hutvā sesatisantatisamuṭṭhānarūpassa anupālako eva hutvā āhārapaccayo hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃsamuṭṭhānāna"
      },
      "nti iminā paṭisandhiyaṃ kammasamuṭṭhānāni gahitāneva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañhāvāre"
      },
      " hi ‘‘paṭisandhikkhaṇe vipākābyākatā āhārā sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpānaṃ āhārapaccayena paccayo’’ti vuttanti ayaṃ āhārapaccaye nayo."
    ],
    "innerText": "Rūpārūpānaṃ upatthambhakaṭṭhena upakārakā cattāro āhārā āhārapaccayo. Niddese pana ‘‘kabaḷīkāro āhāro imassa kāyassa…pe… arūpino āhārā sampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ āhārapaccayena paccayo’’ti evaṃ niddiṭṭho. Tattha catusamuṭṭhānamupagatā ojā kabaḷīkāro āhāro nāma. So yasmā āhārūpasevīnaññeva ajjhohaṭāhārautujāhārūpatthaddho eva ca kammajādiāhāro imassa kāyassa ṭhitiyā pavattati, na aññathā, tasmā kabaḷīkātabbautujavatthusannissitatādassanatthaṃ kabaḷīkāro āhāroti vutto. Kiñcāpi cāyaṃ ‘‘imassa kāyassā’’ti avisesena vutto, visesato pana āhārajarūpassa janako ceva anupālako ca hutvā sesatisantatisamuṭṭhānarūpassa anupālako eva hutvā āhārapaccayo hoti. Taṃsamuṭṭhānānanti iminā paṭisandhiyaṃ kammasamuṭṭhānāni gahitāneva. Pañhāvāre hi ‘‘paṭisandhikkhaṇe vipākābyākatā āhārā sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpānaṃ āhārapaccayena paccayo’’ti vuttanti ayaṃ āhārapaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Adhipatiyaṭṭhena ",
      " upakārakā itthindriyapurisindriyavajjā vīsati indriyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "indriyapaccayo"
      },
      ". Itthindriyapurisindriyāni hi kiñcāpi itthipurisaliṅgākappādīnaṃ bījabhūtāni, neva pana tesaṃ, na aññesaṃ indriyādipaccayataṃ pharanti. Suttantikapariyāyena pana ",
      " tesaṃ pakatūpanissayabhāvaṃ pharantīti bāvīsateva indriyāni. Tattha cakkhundriyādayo pañca arūpadhammānameva indriyapaccayo, rūpajīvitindriyaṃ kaṭattārūpānameva, sesā rūpārūpānaṃ. Niddese ‘‘cakkhundriyaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ…pe… kāyaviññāṇadhātuyā…pe… rūpajīvitindriyaṃ kaṭattārūpānaṃ, arūpino indriyā sampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ indriyapaccayena paccayo’’ti evaṃ niddiṭṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃsamuṭṭhānāna"
      },
      "nti etthāpi kaṭattārūpampi saṅgahitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañhāvāre"
      },
      " hi ‘‘paṭisandhikkhaṇe vipākābyākatā indriyā sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpāna’’nti vuttanti ayaṃ indriyapaccaye nayo."
    ],
    "innerText": "Adhipatiyaṭṭhena upakārakā itthindriyapurisindriyavajjā vīsati indriyā indriyapaccayo. Itthindriyapurisindriyāni hi kiñcāpi itthipurisaliṅgākappādīnaṃ bījabhūtāni, neva pana tesaṃ, na aññesaṃ indriyādipaccayataṃ pharanti. Suttantikapariyāyena pana tesaṃ pakatūpanissayabhāvaṃ pharantīti bāvīsateva indriyāni. Tattha cakkhundriyādayo pañca arūpadhammānameva indriyapaccayo, rūpajīvitindriyaṃ kaṭattārūpānameva, sesā rūpārūpānaṃ. Niddese ‘‘cakkhundriyaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ…pe… kāyaviññāṇadhātuyā…pe… rūpajīvitindriyaṃ kaṭattārūpānaṃ, arūpino indriyā sampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ indriyapaccayena paccayo’’ti evaṃ niddiṭṭho. Taṃsamuṭṭhānānanti etthāpi kaṭattārūpampi saṅgahitaṃ. Pañhāvāre hi ‘‘paṭisandhikkhaṇe vipākābyākatā indriyā sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpāna’’nti vuttanti ayaṃ indriyapaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Upanijjhāyanaṭṭhena upakārakāni ṭhapetvā dvipañcaviññāṇesu vedanāttayaṃ, ekaggatañca sesāni kusalādibhedāni satta jhānaṅgāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānapaccayo"
      },
      ". Dvipañcaviññāṇānaṃ hi abhinipātamattattā tesu vedanekaggatā upanijjhāyanākārassa abhāvena jhānaṅgesu na uddhaṭā, niddese panassa ‘‘jhānaṅgāni jhānasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ jhānapaccayena paccayo’’ti niddiṭṭho. Idhāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṃsamuṭṭhānāna"
      },
      "nti iminā ca kaṭattārūpampi gahitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañhāvāre"
      },
      "hi ‘‘paṭisandhikkhaṇe vipākābyākatāni jhānaṅgāni sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpāna’’nti vuttanti ayaṃ jhānapaccaye nayo."
    ],
    "innerText": "Upanijjhāyanaṭṭhena upakārakāni ṭhapetvā dvipañcaviññāṇesu vedanāttayaṃ, ekaggatañca sesāni kusalādibhedāni satta jhānaṅgāni jhānapaccayo. Dvipañcaviññāṇānaṃ hi abhinipātamattattā tesu vedanekaggatā upanijjhāyanākārassa abhāvena jhānaṅgesu na uddhaṭā, niddese panassa ‘‘jhānaṅgāni jhānasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ jhānapaccayena paccayo’’ti niddiṭṭho. Idhāpi taṃsamuṭṭhānānanti iminā ca kaṭattārūpampi gahitaṃ. Pañhāvārehi ‘‘paṭisandhikkhaṇe vipākābyākatāni jhānaṅgāni sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpāna’’nti vuttanti ayaṃ jhānapaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yato tato vā niyyānaṭṭhena upakārakāni kusalādibhedāni dvādasa maggaṅgāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "maggapaccayo"
      },
      ". Niddese pana ‘‘maggaṅgāni maggasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ maggapaccayena paccayo’’ti niddiṭṭho. Etthāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṃsamuṭṭhānāna"
      },
      "nti iminā kaṭattārūpaggahaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañhāvāre"
      },
      " hi ‘‘paṭisandhikkhaṇe vipākābyākatāni maggaṅgāni sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpāna’’nti vuttaṃ, ahetukacittesu cettha vijjamānāni maggaṅgāni maggapaccayā na honti. Ayaṃ maggapaccaye nayo."
    ],
    "innerText": "Yato tato vā niyyānaṭṭhena upakārakāni kusalādibhedāni dvādasa maggaṅgāni maggapaccayo. Niddese pana ‘‘maggaṅgāni maggasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ maggapaccayena paccayo’’ti niddiṭṭho. Etthāpi taṃsamuṭṭhānānanti iminā kaṭattārūpaggahaṇaṃ. Pañhāvāre hi ‘‘paṭisandhikkhaṇe vipākābyākatāni maggaṅgāni sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpāna’’nti vuttaṃ, ahetukacittesu cettha vijjamānāni maggaṅgāni maggapaccayā na honti. Ayaṃ maggapaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekavatthukaekārammaṇaekuppādaekanirodhasaṅkhātena ",
      " sampayuttabhāvena upakārakā arūpino dhammā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampayuttapaccayo"
      },
      ". Niddese pana ‘‘cattāro khandhā arūpino dhammā aññamaññaṃ sampayuttapaccayena paccayo’’ti niddiṭṭhoti ayaṃ sampayuttapaccaye nayo."
    ],
    "innerText": "Ekavatthukaekārammaṇaekuppādaekanirodhasaṅkhātena sampayuttabhāvena upakārakā arūpino dhammā sampayuttapaccayo. Niddese pana ‘‘cattāro khandhā arūpino dhammā aññamaññaṃ sampayuttapaccayena paccayo’’ti niddiṭṭhoti ayaṃ sampayuttapaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekavatthukādibhāvānupagamena upakārakā rūpino dhammā arūpīnaṃ, arūpino dhammā rūpīnaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vippayuttapaccayo,"
      },
      " so sahajātapurejātapacchājātavasena tividho hoti. Vuttaṃ hetaṃ ‘‘sahajātā kusalā khandhā cittasamuṭṭhānānaṃ rūpānaṃ…pe… pacchājātā kusalā khandhā purejātassa imassa kāyassa vippayuttapaccayena paccayo’’tiādi. Purejātaṃ pana chavatthuvaseneva veditabbaṃ. Niddese panassa ‘‘rūpino dhammā arūpīnaṃ…pe… arūpino dhammā rūpīnaṃ dhammānaṃ vippayuttapaccayena paccayo’’ti evaṃ sāmaññato niddiṭṭho. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpino"
      },
      "ti idaṃ chavatthūnaṃ vasena vuttaṃ, rūpādayo pana ārammaṇadhammā sampayogāsaṅkāyābhāvena vippayuttapaccayā na vuttā. Cakkhādīnaṃ hi vatthūnaṃ abbhantarato arūpadhammā nikkhamantā viya uppajjanti, tattha sampayogāsaṅkā hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañhāvārepi"
      },
      " hi ‘‘vatthu kusalānaṃ khandhānaṃ…pe… cakkhāyatanaṃ cakkhuviññāṇadhātuyā’’tiādinā cha vatthūneva uddhaṭāni, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "arūpino dhammā rūpīna"
      },
      "nti etthāpi nibbānaṃ arūpampi samānaṃ rūpassa vippayuttapaccayo na hoti sabbathā sampayogāsaṅkābhāvato, ‘‘catūhi sampayogo catūhi vippayogo’’ti (dhātu. 3) hi vuttanti ayaṃ vippayuttapaccaye nayo."
    ],
    "innerText": "Ekavatthukādibhāvānupagamena upakārakā rūpino dhammā arūpīnaṃ, arūpino dhammā rūpīnaṃ vippayuttapaccayo, so sahajātapurejātapacchājātavasena tividho hoti. Vuttaṃ hetaṃ ‘‘sahajātā kusalā khandhā cittasamuṭṭhānānaṃ rūpānaṃ…pe… pacchājātā kusalā khandhā purejātassa imassa kāyassa vippayuttapaccayena paccayo’’tiādi. Purejātaṃ pana chavatthuvaseneva veditabbaṃ. Niddese panassa ‘‘rūpino dhammā arūpīnaṃ…pe… arūpino dhammā rūpīnaṃ dhammānaṃ vippayuttapaccayena paccayo’’ti evaṃ sāmaññato niddiṭṭho. Tattha rūpinoti idaṃ chavatthūnaṃ vasena vuttaṃ, rūpādayo pana ārammaṇadhammā sampayogāsaṅkāyābhāvena vippayuttapaccayā na vuttā. Cakkhādīnaṃ hi vatthūnaṃ abbhantarato arūpadhammā nikkhamantā viya uppajjanti, tattha sampayogāsaṅkā hoti. Pañhāvārepi hi ‘‘vatthu kusalānaṃ khandhānaṃ…pe… cakkhāyatanaṃ cakkhuviññāṇadhātuyā’’tiādinā cha vatthūneva uddhaṭāni, arūpino dhammā rūpīnanti etthāpi nibbānaṃ arūpampi samānaṃ rūpassa vippayuttapaccayo na hoti sabbathā sampayogāsaṅkābhāvato, ‘‘catūhi sampayogo catūhi vippayogo’’ti (dhātu. 3) hi vuttanti ayaṃ vippayuttapaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paccuppannalakkhaṇena atthibhāvena tādisasseva dhammassa upatthambhakaṭṭhena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthipaccayo,"
      },
      " so niddese ‘‘cattāro khandhā arūpino aññamaññaṃ…pe… cattāro mahābhūtā aññamaññaṃ, okkantikkhaṇe nāmarūpaṃ aññamaññaṃ, cittacetasikā ",
      " dhammā cittasamuṭṭhānānaṃ rūpānaṃ, mahābhūtā upādārūpānaṃ, cakkhāyatanaṃ cakkhuviññāṇadhātuyā…pe… rūpāyatanaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ…pe… rūpāyatanaṃ…pe… phoṭṭhabbāyatanaṃ manodhātuyā…pe… manodhātuyā ca manoviññāṇadhātuyā ca taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo’’ti evaṃ sahajātapurejātavasena ca bahudhā niddiṭṭho, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañhāvāre"
      },
      " pana ‘‘sahajātaṃ purejātaṃ pacchājātaṃ āhāraṃ indriya’’nti imesaṃ pañcannampi vasena āgatattā pacchājātakabaḷīkāraāhārarūpajīvitindriyānaṃ vasenāpi atthipaccayo gahetabbovāti ayaṃ atthipaccaye nayo."
    ],
    "innerText": "Paccuppannalakkhaṇena atthibhāvena tādisasseva dhammassa upatthambhakaṭṭhena upakārako dhammo atthipaccayo, so niddese ‘‘cattāro khandhā arūpino aññamaññaṃ…pe… cattāro mahābhūtā aññamaññaṃ, okkantikkhaṇe nāmarūpaṃ aññamaññaṃ, cittacetasikā dhammā cittasamuṭṭhānānaṃ rūpānaṃ, mahābhūtā upādārūpānaṃ, cakkhāyatanaṃ cakkhuviññāṇadhātuyā…pe… rūpāyatanaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ…pe… rūpāyatanaṃ…pe… phoṭṭhabbāyatanaṃ manodhātuyā…pe… manodhātuyā ca manoviññāṇadhātuyā ca taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo’’ti evaṃ sahajātapurejātavasena ca bahudhā niddiṭṭho, pañhāvāre pana ‘‘sahajātaṃ purejātaṃ pacchājātaṃ āhāraṃ indriya’’nti imesaṃ pañcannampi vasena āgatattā pacchājātakabaḷīkāraāhārarūpajīvitindriyānaṃ vasenāpi atthipaccayo gahetabbovāti ayaṃ atthipaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Attano anantaraṃ uppajjamānānaṃ arūpadhammānaṃ pavattiokāsadānavasena upakārakā samanantaraniruddhā ",
      " arūpadhammā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "natthipaccayo,"
      },
      " niddese pana ‘‘samanantaraniruddhā cittacetasikā dhammā paṭuppannānaṃ cittacetasikānaṃ dhammānaṃ natthipaccayena paccayo’’ti evaṃ sāmaññatova niddiṭṭho. Sabbathā anantarapaccayasadisatāya tattha niddiṭṭhanayenevettha viseso ñātabboti ayaṃ natthipaccaye nayo."
    ],
    "innerText": "Attano anantaraṃ uppajjamānānaṃ arūpadhammānaṃ pavattiokāsadānavasena upakārakā samanantaraniruddhā arūpadhammā natthipaccayo, niddese pana ‘‘samanantaraniruddhā cittacetasikā dhammā paṭuppannānaṃ cittacetasikānaṃ dhammānaṃ natthipaccayena paccayo’’ti evaṃ sāmaññatova niddiṭṭho. Sabbathā anantarapaccayasadisatāya tattha niddiṭṭhanayenevettha viseso ñātabboti ayaṃ natthipaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Natthipaccayadhammāva vigatabhāvena upakārakattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vigatapaccayo"
      },
      "ti saha niddesena natthipaccayasadisovāti."
    ],
    "innerText": "Natthipaccayadhammāva vigatabhāvena upakārakattā vigatapaccayoti saha niddesena natthipaccayasadisovāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avigatapaccayo"
      },
      "pi sabbathā atthipaccayasadisova, desanāvilāsena, veneyyavasena vā ayaṃ duko vuttoti ayaṃ avigatapaccaye nayo."
    ],
    "innerText": "Avigatapaccayopi sabbathā atthipaccayasadisova, desanāvilāsena, veneyyavasena vā ayaṃ duko vuttoti ayaṃ avigatapaccaye nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pakiṇṇakavinicchayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Imesu pana catuvīsatiyā paccayesu ñāṇacārassa visadabhāvatthaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dhammato kālato ceva, ekassānekapaccayā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anekesañca dhammānaṃ, ekapaccayabhāvato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Sabhāgā ",
      " visabhāgā ca, yugaḷā janakādito;"
    ],
    "innerText": "Sabhāgā visabhāgā ca, yugaḷā janakādito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sabbaṭṭhānādibhedā ca, rūpārūpavikappato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhavato saṅgahā ñeyyo, pakiṇṇakavinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammato"
      },
      "ti imesu hi paccayesu hetupaccayo tāva nāmarūpadhammesu nāmadhammekadeso, tathā sahajātādhipatikammajhānamaggapaccayā, tathā āsevanavipākapaccayā, catukkhandhasaṅgahitāpi vipākadhammā anantarasamanantarapacchājātasampayuttanatthivigatapaccayā. Nibbānassa asaṅgahato nāmekadesotipi vattuṃ vaṭṭati. Purejātapaccayo rūpadhammova, sesā yathālābhavasena nāmarūpadhammā. Tattha ca ārammaṇādhipatiārammaṇūpanissayapakatūpanissayesu paññattipi saṅgahitāti ayaṃ dhammato vinicchayo."
    ],
    "innerText": "Tattha dhammatoti imesu hi paccayesu hetupaccayo tāva nāmarūpadhammesu nāmadhammekadeso, tathā sahajātādhipatikammajhānamaggapaccayā, tathā āsevanavipākapaccayā, catukkhandhasaṅgahitāpi vipākadhammā anantarasamanantarapacchājātasampayuttanatthivigatapaccayā. Nibbānassa asaṅgahato nāmekadesotipi vattuṃ vaṭṭati. Purejātapaccayo rūpadhammova, sesā yathālābhavasena nāmarūpadhammā. Tattha ca ārammaṇādhipatiārammaṇūpanissayapakatūpanissayesu paññattipi saṅgahitāti ayaṃ dhammato vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kālato"
      },
      " pana hetusahajātaaññamaññanissayapurejātapacchājātavipākaāhāraindriyajhānamaggasampayuttavippayuttaatthiavigatapaccayā pannarasa paccuppannāva hutvā attano phalassa paccayā honti, anantarasamanantaraāsevananatthivigatapaccayā pañca atītā eva hutvā, kammapaccayo paneko paccuppannopi atītopi hutvā, sesā ārammaṇaadhipatiupanissayapaccayā tayopi tekālikāpi, nibbānapaññattivasena kālavimuttāpi hutvā attano phalassa paccayā hontīti ayaṃ kālato vinicchayo."
    ],
    "innerText": "Kālato pana hetusahajātaaññamaññanissayapurejātapacchājātavipākaāhāraindriyajhānamaggasampayuttavippayuttaatthiavigatapaccayā pannarasa paccuppannāva hutvā attano phalassa paccayā honti, anantarasamanantaraāsevananatthivigatapaccayā pañca atītā eva hutvā, kammapaccayo paneko paccuppannopi atītopi hutvā, sesā ārammaṇaadhipatiupanissayapaccayā tayopi tekālikāpi, nibbānapaññattivasena kālavimuttāpi hutvā attano phalassa paccayā hontīti ayaṃ kālato vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekassānekapaccayā"
      },
      "ti ekadhammassa, ekapaccayassa ca anekapaccayabhāvato. Kathaṃ? Hetupaccaye tāva amoho eko dhammo, so purejātakammaāhārajhānavajjānaṃ vīsatiyā paccayānaṃ vasena anekapaccayo hoti, hetupaccayattaṃ avijahantova adhipatisahajātaaññamaññanissayavipākindriyamaggasampayuttavippayuttaatthiavigatānaṃ aññesaṃ ekādasannaṃ vasena vā anekapaccayo hoti ",
      ", tathā alobhādayo, tesu pana alobhādosā indriyamaggapaccayā na honti, te tayo avipākabhūtā lobhadosamohā vipākapaccayāpi na honti, te pana amohavajjitā pañca adhipatipaccayā na honti, tathā sesāpi avipākabhūtā."
    ],
    "innerText": "Ekassānekapaccayāti ekadhammassa, ekapaccayassa ca anekapaccayabhāvato. Kathaṃ? Hetupaccaye tāva amoho eko dhammo, so purejātakammaāhārajhānavajjānaṃ vīsatiyā paccayānaṃ vasena anekapaccayo hoti, hetupaccayattaṃ avijahantova adhipatisahajātaaññamaññanissayavipākindriyamaggasampayuttavippayuttaatthiavigatānaṃ aññesaṃ ekādasannaṃ vasena vā anekapaccayo hoti , tathā alobhādayo, tesu pana alobhādosā indriyamaggapaccayā na honti, te tayo avipākabhūtā lobhadosamohā vipākapaccayāpi na honti, te pana amohavajjitā pañca adhipatipaccayā na honti, tathā sesāpi avipākabhūtā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ārammaṇapaccaye rūpāyatanaṃ cakkhuviññāṇadhātuyā ārammaṇapurejātaatthiavigatānaṃ catunnaṃ vasena anekapaccayo hoti, tathā manodhātuyā, ahetukamanoviññāṇadhātuyā ca. Sahetukāya pana ārammaṇādhipatiārammaṇūpanissayānampi vasena, saddādīsupi eseva nayo. Dhammāyatanaṃ pana nissayavippayuttānaṃ vasenāpi anekapaccayo hoti, tathā ārammaṇapaccayattaṃ avijahantova ārammaṇādhipatinissayaupanissayapurejātavippayuttaatthiavigatānaṃ vasena aparesampi sattannaṃ vasena anekapaccayo hotīti ayamettha ukkaṭṭhaparicchedo. Tattha arūpānaṃ pana rūpānaṃ vā atītānāgatānaṃ ārammaṇapaccayabhāve sati ārammaṇādhipatiupanissayamattameva uttari labbhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhipatipaccaye"
      },
      " ārammaṇādhipati vuttanayova. Sahajātādhipatīsu cittaṃ hetupurejātakammajhānamaggavajjānaṃ ekūnavīsatiyā paccayānaṃ vasena anekapaccayo hoti, adhipatipaccayattaṃ avijahanto aparesaṃ sahajātaaññamaññanissayavipākāhārindriyasampayuttavippayuttaatthiavigatānaṃ dasannaṃ vaseneva, tathā vīriyaṃ āhārapaccayavajjānaṃ maggapaccayasahitānaṃ ",
      " vasena, chando āhārindriyavajjānaṃ vasena anekapaccayo hoti, vīmaṃsā hetupaccaye vuttanayāva."
    ],
    "innerText": "Adhipatipaccaye ārammaṇādhipati vuttanayova. Sahajātādhipatīsu cittaṃ hetupurejātakammajhānamaggavajjānaṃ ekūnavīsatiyā paccayānaṃ vasena anekapaccayo hoti, adhipatipaccayattaṃ avijahanto aparesaṃ sahajātaaññamaññanissayavipākāhārindriyasampayuttavippayuttaatthiavigatānaṃ dasannaṃ vaseneva, tathā vīriyaṃ āhārapaccayavajjānaṃ maggapaccayasahitānaṃ vasena, chando āhārindriyavajjānaṃ vasena anekapaccayo hoti, vīmaṃsā hetupaccaye vuttanayāva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anantarapaccaye"
      },
      " catūsu khandhesu vedanākkhandho tāva hetupurejātakammāhāramaggapaccayavajjānaṃ ekūnavīsatiyā vasena ",
      ", saññākkhandho tesu indriyajhānavajjānaṃ sattarasannaṃ vasena, saṅkhārakkhandho hetupurejātakammindriyajhānamaggavajjānaṃ aṭṭhārasannaṃ vasena, tathā cetanā kammasahitānaṃ, vitakko hetupurejātakammaāhārindriyavajjānaṃ jhānamaggasahitānaṃ, vicāro, pīti ca ānantariyānaṃ maggavajjānaṃ, ekaggatā hetupurejātakammāhāravajjānaṃ vīsatiyā paccayānaṃ vasena, saddhā, jīvitindriyañca anantarānaṃ hetupurejātakammāhārajhānamaggavajjānaṃ aṭṭhārasannaṃ, sati maggasahitānaṃ ekūnavīsatiyā, hiriottappakāyapassaddhādichayugā, yevāpanakesu adhimokkhamanasikāratatramajjhattatā, karuṇāmuditā ca hetupurejātakammāhārajhānamaggindriyavajjānaṃ sattarasannaṃ, viratiyo pana maggasahitānaṃ aṭṭhārasannaṃ, micchādiṭṭhi tato vipākavajjānaṃ sattarasannaṃ vasena, micchāvācākammantājīvā tehi ceva kammāhārapaccayehi cāti ekūnavīsatiyā paccayānaṃ vasena, ahirikaṃ anottappaṃ māno thinaṃ middhaṃ uddhaccanti ime hetupurejātakammavipākāhārindriyajhānamaggavajjānaṃ soḷasannaṃ, vicikicchā issāmacchariyakukkuccāni tato adhipativajjānaṃ pannarasannaṃ vasena anekapaccayā honti. Anantarapaccayattaṃ avijahantānaṃ panetesaṃ samanantaraupanissayakammanatthivigatānaṃ aparesaṃ channaṃ vasena ca. Viññāṇakkhandhassa adhipatipaccayeneva anekapaccayabhāvo veditabbo."
    ],
    "innerText": "Anantarapaccaye catūsu khandhesu vedanākkhandho tāva hetupurejātakammāhāramaggapaccayavajjānaṃ ekūnavīsatiyā vasena , saññākkhandho tesu indriyajhānavajjānaṃ sattarasannaṃ vasena, saṅkhārakkhandho hetupurejātakammindriyajhānamaggavajjānaṃ aṭṭhārasannaṃ vasena, tathā cetanā kammasahitānaṃ, vitakko hetupurejātakammaāhārindriyavajjānaṃ jhānamaggasahitānaṃ, vicāro, pīti ca ānantariyānaṃ maggavajjānaṃ, ekaggatā hetupurejātakammāhāravajjānaṃ vīsatiyā paccayānaṃ vasena, saddhā, jīvitindriyañca anantarānaṃ hetupurejātakammāhārajhānamaggavajjānaṃ aṭṭhārasannaṃ, sati maggasahitānaṃ ekūnavīsatiyā, hiriottappakāyapassaddhādichayugā, yevāpanakesu adhimokkhamanasikāratatramajjhattatā, karuṇāmuditā ca hetupurejātakammāhārajhānamaggindriyavajjānaṃ sattarasannaṃ, viratiyo pana maggasahitānaṃ aṭṭhārasannaṃ, micchādiṭṭhi tato vipākavajjānaṃ sattarasannaṃ vasena, micchāvācākammantājīvā tehi ceva kammāhārapaccayehi cāti ekūnavīsatiyā paccayānaṃ vasena, ahirikaṃ anottappaṃ māno thinaṃ middhaṃ uddhaccanti ime hetupurejātakammavipākāhārindriyajhānamaggavajjānaṃ soḷasannaṃ, vicikicchā issāmacchariyakukkuccāni tato adhipativajjānaṃ pannarasannaṃ vasena anekapaccayā honti. Anantarapaccayattaṃ avijahantānaṃ panetesaṃ samanantaraupanissayakammanatthivigatānaṃ aparesaṃ channaṃ vasena ca. Viññāṇakkhandhassa adhipatipaccayeneva anekapaccayabhāvo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātapaccaye"
      },
      " mahābhūtāni ārammaṇaārammaṇādhipatisahajātaaññamaññanissayaupanissayapurejātaatthiavigatānaṃ navannaṃ, hadayavatthu tesaññeva vippayuttasahitānaṃ vasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nissayapaccaye"
      },
      " cakkhāyatanādīni ārammaṇaārammaṇādhipatinissayaupanissayapurejātaindriyavippayuttaatthiavigatānaṃ navannaṃ vasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātapaccaye"
      },
      " rūpasaddagandharasāyatanādīni ārammaṇaārammaṇādhipatiupanissayapurejātaatthiavigatānaṃ channaṃ vasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āhārapaccaye"
      },
      " ojā ",
      " ārammaṇaārammaṇādhipatiupanissayāhāraatthiavigatānaṃ channaṃ paccayānaṃ vasena anekadhā paccayo hoti. Taṃtaṃpaccayattaṃ avijahantānaṃ tesaṃ tesaṃ sabbattha ārammaṇādhipatianantarasamanantarūpanissayādipaccayatā vuttanayena veditabbā. Sesaṃ suviññeyyamevāti ayaṃ ekassānekapaccayato vinicchayo."
    ],
    "innerText": "Sahajātapaccaye mahābhūtāni ārammaṇaārammaṇādhipatisahajātaaññamaññanissayaupanissayapurejātaatthiavigatānaṃ navannaṃ, hadayavatthu tesaññeva vippayuttasahitānaṃ vasena. Nissayapaccaye cakkhāyatanādīni ārammaṇaārammaṇādhipatinissayaupanissayapurejātaindriyavippayuttaatthiavigatānaṃ navannaṃ vasena. Purejātapaccaye rūpasaddagandharasāyatanādīni ārammaṇaārammaṇādhipatiupanissayapurejātaatthiavigatānaṃ channaṃ vasena. Āhārapaccaye ojā ārammaṇaārammaṇādhipatiupanissayāhāraatthiavigatānaṃ channaṃ paccayānaṃ vasena anekadhā paccayo hoti. Taṃtaṃpaccayattaṃ avijahantānaṃ tesaṃ tesaṃ sabbattha ārammaṇādhipatianantarasamanantarūpanissayādipaccayatā vuttanayena veditabbā. Sesaṃ suviññeyyamevāti ayaṃ ekassānekapaccayato vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anekesañca"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammānaṃ, ekapaccayabhāvato"
      },
      "ti etesu hi ṭhapetvā kammapaccayaṃ sesesu tevīsatiyā paccayesu aneke anekesaṃ dhammānaṃ ekato ekekaṃ paccayā honti. Kammapaccayo pana cetanā ekadhammovāti ayaṃ anekadhammānaṃ ekapaccayabhāvato vinicchayo."
    ],
    "innerText": "Anekesañcadhammānaṃ, ekapaccayabhāvatoti etesu hi ṭhapetvā kammapaccayaṃ sesesu tevīsatiyā paccayesu aneke anekesaṃ dhammānaṃ ekato ekekaṃ paccayā honti. Kammapaccayo pana cetanā ekadhammovāti ayaṃ anekadhammānaṃ ekapaccayabhāvato vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabhāgā visabhāgā cā"
      },
      "ti etesu hi anantarasamanantaraanantarūpanissayāsevananatthivigatapaccayā sabhāgā, tathā ārammaṇaārammaṇādhipatiārammaṇūpanissayā. Purejātapaccayo panettha pacchājātena visabhāgo, tathā sampayutto vippayuttena, atthi natthinā, vigato avigatenāti ayaṃ sabhāgavisabhāgato vinicchayo."
    ],
    "innerText": "Sabhāgā visabhāgā cāti etesu hi anantarasamanantaraanantarūpanissayāsevananatthivigatapaccayā sabhāgā, tathā ārammaṇaārammaṇādhipatiārammaṇūpanissayā. Purejātapaccayo panettha pacchājātena visabhāgo, tathā sampayutto vippayuttena, atthi natthinā, vigato avigatenāti ayaṃ sabhāgavisabhāgato vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yugaḷā"
      },
      "ti ettha atthasarikkhatāya saddasarikkhatāya kālapaṭipakkhatāya hetuphalatāya aññamaññapaṭipakkhatāyāti imehi kāraṇehi yugaḷaṃ veditabbaṃ. Anantarasamanantarā hi atthasarikkhatāya ekaṃ yugaḷaṃ nāma. Nissayūpanissayā saddasarikkhatāya, purejātapacchājātā kālapaṭipakkhatāya, kammavipākā hetuphalatāya, sampayuttavippayuttā aññamaññapaṭipakkhatāya ekaṃ yugaḷaṃ, tathā atthinatthipaccayā, vigataavigatapaccayāti ayaṃ yugaḷato vinicchayo."
    ],
    "innerText": "Yugaḷāti ettha atthasarikkhatāya saddasarikkhatāya kālapaṭipakkhatāya hetuphalatāya aññamaññapaṭipakkhatāyāti imehi kāraṇehi yugaḷaṃ veditabbaṃ. Anantarasamanantarā hi atthasarikkhatāya ekaṃ yugaḷaṃ nāma. Nissayūpanissayā saddasarikkhatāya, purejātapacchājātā kālapaṭipakkhatāya, kammavipākā hetuphalatāya, sampayuttavippayuttā aññamaññapaṭipakkhatāya ekaṃ yugaḷaṃ, tathā atthinatthipaccayā, vigataavigatapaccayāti ayaṃ yugaḷato vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Janakādito"
      },
      "ti janakopatthambhakato. Etesu hi anantarasamanantarūpanissayapakatūpanissayāsevanapaccayā, nānakkhaṇiko ",
      " kammapaccayo, natthivigatapaccayā cāti ime janakā eva, na upatthambhakā. Pacchājātapaccayo upatthambhako eva, na janako. Sesā janakā ceva upatthambhakā cāti ayaṃ janakādito vinicchayo."
    ],
    "innerText": "Janakāditoti janakopatthambhakato. Etesu hi anantarasamanantarūpanissayapakatūpanissayāsevanapaccayā, nānakkhaṇiko kammapaccayo, natthivigatapaccayā cāti ime janakā eva, na upatthambhakā. Pacchājātapaccayo upatthambhako eva, na janako. Sesā janakā ceva upatthambhakā cāti ayaṃ janakādito vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaṭṭhānādibhedā"
      },
      "ti sabbaṭṭhānikaasabbaṭṭhānikabhedato. Etesu hi sahajātanissayaatthiavigatapaccayā sabbaṭṭhānikā. Sabbesu paccayuppannesu icchitabbā. Etehi vinā uppajjamāno ekadhammopi natthi. Sesā asabbaṭṭhānikā. Tattha ca ārammaṇaārammaṇādhipatianantarasamanantarānantarūpanissayapakatūpanissayapurejātāsevanasampayutta atthinatthivigatapaccayā arūpadhammānaññeva kāraṇato asabbaṭṭhānikā. Tathā pacchājātapaccayo rūpānaññeva kāraṇato, sesā ekaccānaṃ rūpārūpadhammānaṃ kāraṇato asabbaṭṭhānikā. Ayaṃ sabbaṭṭhānādibhedato vinicchayo."
    ],
    "innerText": "Sabbaṭṭhānādibhedāti sabbaṭṭhānikaasabbaṭṭhānikabhedato. Etesu hi sahajātanissayaatthiavigatapaccayā sabbaṭṭhānikā. Sabbesu paccayuppannesu icchitabbā. Etehi vinā uppajjamāno ekadhammopi natthi. Sesā asabbaṭṭhānikā. Tattha ca ārammaṇaārammaṇādhipatianantarasamanantarānantarūpanissayapakatūpanissayapurejātāsevanasampayutta atthinatthivigatapaccayā arūpadhammānaññeva kāraṇato asabbaṭṭhānikā. Tathā pacchājātapaccayo rūpānaññeva kāraṇato, sesā ekaccānaṃ rūpārūpadhammānaṃ kāraṇato asabbaṭṭhānikā. Ayaṃ sabbaṭṭhānādibhedato vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpārūpavikappato"
      },
      "ti ",
      " rūpaṃ rūpassa, rūpaṃ arūpassātiādi vikappato. Etesu hi ekopi paccayo rūpameva hutvā rūpasseva paccayo bhavanto nāma natthi, rūpameva pana arūpasseva atthi, so purejātapaccayo eko eva. Rūpameva hutvā rūpārūpasseva paccayo nāmātipi natthi, arūpameva hutvā arūpasseva paccayopi atthi, so anantarasamanantaraāsevanasampayuttanatthivigatavasena chabbidho. Arūpameva pana rūpasseva paccayopi atthi, so pacchājātapaccayo eko eva. Arūpameva hutvā rūpārūpānampi atthi, so hetukammavipākajhānamaggavasena pañcavidho. Rūpārūpapaññatti hutvā arūpasseva paccayopi atthi, so ārammaṇaupanissayavasena duvidho. Rūpārūpaṃ pana rūpārūpassāpi atthi, so adhipatisahajātaaññamaññanissayāhārindriyavippayuttaatthiavigatavasena navavidhoti ayaṃ rūpārūpavikappato vinicchayo."
    ],
    "innerText": "Rūpārūpavikappatoti rūpaṃ rūpassa, rūpaṃ arūpassātiādi vikappato. Etesu hi ekopi paccayo rūpameva hutvā rūpasseva paccayo bhavanto nāma natthi, rūpameva pana arūpasseva atthi, so purejātapaccayo eko eva. Rūpameva hutvā rūpārūpasseva paccayo nāmātipi natthi, arūpameva hutvā arūpasseva paccayopi atthi, so anantarasamanantaraāsevanasampayuttanatthivigatavasena chabbidho. Arūpameva pana rūpasseva paccayopi atthi, so pacchājātapaccayo eko eva. Arūpameva hutvā rūpārūpānampi atthi, so hetukammavipākajhānamaggavasena pañcavidho. Rūpārūpapaññatti hutvā arūpasseva paccayopi atthi, so ārammaṇaupanissayavasena duvidho. Rūpārūpaṃ pana rūpārūpassāpi atthi, so adhipatisahajātaaññamaññanissayāhārindriyavippayuttaatthiavigatavasena navavidhoti ayaṃ rūpārūpavikappato vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavato"
      },
      "ti ",
      " imesu hi paccayesu pañcavokārabhave tāva na koci paccayo na labbhati nāma, sabbepi labbhanti. Catuvokārabhave pana purejātapacchājātavippayuttapaccaye apanetvā sesā ekavīsatimeva. Ekavokārabhave sahajātaaññamaññanissayakammindriyaatthiavigatavasena satteva. Bāhire pana anindriyabaddharūpe tesu kammindriyavajjā pañceva labbhantīti ayaṃ bhavato vinicchayo."
    ],
    "innerText": "Bhavatoti imesu hi paccayesu pañcavokārabhave tāva na koci paccayo na labbhati nāma, sabbepi labbhanti. Catuvokārabhave pana purejātapacchājātavippayuttapaccaye apanetvā sesā ekavīsatimeva. Ekavokārabhave sahajātaaññamaññanissayakammindriyaatthiavigatavasena satteva. Bāhire pana anindriyabaddharūpe tesu kammindriyavajjā pañceva labbhantīti ayaṃ bhavato vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅgahā"
      },
      "ti sabbepi hi ime catuvīsati paccayā ārammaṇasahajātaupanissayapurejātapacchājātakammāhārindriyesu aṭṭhasu ca paccayesu saṅgahaṃ gacchanti. Kathaṃ? Tesu hi hetuaññamaññavipākajhānamaggasampayuttapaccayā cha sahajātapaccaye saṅgahaṃ gacchanti. Anantarasamanantarāsevananatthivigatapaccayā pañca anantarūpanissaye upanissayapaccaye. Nissayapaccayo sahajātapurejātabhedato duvidho. Tattha sahajāto sahajātapaccaye, purejāto purejātapaccaye. Adhipatipaccayopi ārammaṇabhūto ārammaṇūpanissaye, sahajātabhūto sahajātapaccaye. Vippayuttapaccayopi sahajātapurejātapacchājātabhūtatāya tattha tattha saṅgahaṃ gacchati. Atthiavigatapaccayāpi sahajātapurejātapacchājātāhārindriyabhūtatāya tattha tattha paccayesu saṅgahaṃ gacchanti. Evaṃ imesu paccayesu sabbapaccayānaṃ saṅgaho veditabbo. Teneva tikapaṭṭhānapāḷiyaṃ paccanīyanaye imesaṃ aṭṭhannaṃ paccayānaṃ vaseneva katipayapañhā vissajjitā. Imesaṃ pana aṭṭhannampi aññamaññasaṅgahopi atthiyeva. Tesu hi ārammaṇapaccayo adhipatibhūto upanissaye ",
      ", anadhipatibhūto na katthacīti ārammaṇapaccayo hutvā visuññeva tiṭṭhati. Kammapaccayopi sahajāto sahajāte. Nānakkhaṇiko pana ",
      " balavā vipākadhammānaṃ upanissayo hotīti upanissayapaccaye saṅgahaṃ gacchati. Balavāpi pana kammajarūpānaṃ, dubbalo arūpānaṃ nānakkhaṇikakammapaccayo hutvā visuññeva tiṭṭhati. Āhārapaccayopi arūpabhūto sahajāte, rūpabhūto na katthacīti visuññeva tiṭṭhati, indriyapaccayopi arūpabhūto sahajāte, pasādindriyā purejāte, rūpajīvitindriyaṃ na katthaci saṅgahaṃ gacchatīti indriyapaccayo hutvā visuññeva tiṭṭhatīti evamevaṃ aññamaññasaṅgahopi attheva. Sabbepi panete catuvīsati paccayā ārammaṇaupanissayakammaatthipaccayesu catūsupi saṅgahaṃ gacchantīti ayaṃ saṅgahato vinicchayo. Ayaṃ anuttānapadatthasahito saṅkhepatthavinicchayo."
    ],
    "innerText": "Saṅgahāti sabbepi hi ime catuvīsati paccayā ārammaṇasahajātaupanissayapurejātapacchājātakammāhārindriyesu aṭṭhasu ca paccayesu saṅgahaṃ gacchanti. Kathaṃ? Tesu hi hetuaññamaññavipākajhānamaggasampayuttapaccayā cha sahajātapaccaye saṅgahaṃ gacchanti. Anantarasamanantarāsevananatthivigatapaccayā pañca anantarūpanissaye upanissayapaccaye. Nissayapaccayo sahajātapurejātabhedato duvidho. Tattha sahajāto sahajātapaccaye, purejāto purejātapaccaye. Adhipatipaccayopi ārammaṇabhūto ārammaṇūpanissaye, sahajātabhūto sahajātapaccaye. Vippayuttapaccayopi sahajātapurejātapacchājātabhūtatāya tattha tattha saṅgahaṃ gacchati. Atthiavigatapaccayāpi sahajātapurejātapacchājātāhārindriyabhūtatāya tattha tattha paccayesu saṅgahaṃ gacchanti. Evaṃ imesu paccayesu sabbapaccayānaṃ saṅgaho veditabbo. Teneva tikapaṭṭhānapāḷiyaṃ paccanīyanaye imesaṃ aṭṭhannaṃ paccayānaṃ vaseneva katipayapañhā vissajjitā. Imesaṃ pana aṭṭhannampi aññamaññasaṅgahopi atthiyeva. Tesu hi ārammaṇapaccayo adhipatibhūto upanissaye , anadhipatibhūto na katthacīti ārammaṇapaccayo hutvā visuññeva tiṭṭhati. Kammapaccayopi sahajāto sahajāte. Nānakkhaṇiko pana balavā vipākadhammānaṃ upanissayo hotīti upanissayapaccaye saṅgahaṃ gacchati. Balavāpi pana kammajarūpānaṃ, dubbalo arūpānaṃ nānakkhaṇikakammapaccayo hutvā visuññeva tiṭṭhati. Āhārapaccayopi arūpabhūto sahajāte, rūpabhūto na katthacīti visuññeva tiṭṭhati, indriyapaccayopi arūpabhūto sahajāte, pasādindriyā purejāte, rūpajīvitindriyaṃ na katthaci saṅgahaṃ gacchatīti indriyapaccayo hutvā visuññeva tiṭṭhatīti evamevaṃ aññamaññasaṅgahopi attheva. Sabbepi panete catuvīsati paccayā ārammaṇaupanissayakammaatthipaccayesu catūsupi saṅgahaṃ gacchantīti ayaṃ saṅgahato vinicchayo. Ayaṃ anuttānapadatthasahito saṅkhepatthavinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pakiṇṇakavinicchayo niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vibhaṅganaye panettha pāḷivavatthānaṃ tāva saṅkhepato evaṃ veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭṭhānapāḷiyaṃ"
      },
      " hi ‘‘hetupaccayo…pe… avigatapaccayo’’ti paccayapadāni mātikāvasena nikkhipitvā tesaṃ paccayānaṃ – ‘‘hetū hetusampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ hetupaccayena paccayo’’tiādinā nayena paccayabhājanīyasaṅkhāto niddesavāro paṭhamaṃ vutto. Sopi ca anantarasaṅkhepatthavinicchayo tattha tattha dassito eva. Tadanantaraṃ tesaṃ catuvīsatiyā paccayānaṃ kusalattikādayo dvāvīsatitike, hetudukādayo sataṃ duke ca nissāya nānānayato vibhajanavasena catuvīsatisamantapaṭṭhānasamodhānaṃ anantanayasamantapaṭṭhānaṃ vibhattaṃ. Kathaṃ? Catubbidhaṃ hi paṭṭhānaṃ – anulomapaṭṭhānaṃ, paccanīkapaṭṭhānaṃ, anulomapaccanīkapaṭṭhānaṃ, paccanīkānulomapaṭṭhānanti. Tattha ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjati hetupaccayā’’tiādinā, ‘‘hetuṃ dhammaṃ paṭicca hetudhammo uppajjati hetupaccayā’’tiādinā kusalādīnaṃ, hetuādīnañca dhammānaṃ anulomavasena pavattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anulomapaṭṭhānaṃ"
      },
      " nāma. ‘‘Nakusalaṃ dhammaṃ paṭicca nakusalo dhammo uppajjati hetupaccayā…pe… nahetuṃ dhammaṃ paṭicca nahetudhammo uppajjati hetupaccayā’’tiādinā kusalādīnaṃ, hetuādīnañca ",
      " dhammānaṃ paccanīkavasena pavattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccanīkapaṭṭhānaṃ"
      },
      " nāma. ‘‘Kusalaṃ dhammaṃ paṭicca nakusalo dhammo uppajjati hetupaccayā…pe… hetuṃ dhammaṃ paṭicca nahetudhammo uppajjati hetupaccayā’’tiādinā pavattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anulomapaccanīkapaṭṭhānaṃ"
      },
      " nāma ",
      ". ‘‘Nakusalaṃ dhammaṃ paṭicca kusalo dhammo…pe… nahetuṃ dhammaṃ paṭicca hetudhammo uppajjati hetupaccayā’’tiādinā pavattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccanīkānulomapaṭṭhānaṃ"
      },
      " nāma."
    ],
    "innerText": "Vibhaṅganaye panettha pāḷivavatthānaṃ tāva saṅkhepato evaṃ veditabbaṃ. Paṭṭhānapāḷiyaṃ hi ‘‘hetupaccayo…pe… avigatapaccayo’’ti paccayapadāni mātikāvasena nikkhipitvā tesaṃ paccayānaṃ – ‘‘hetū hetusampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ hetupaccayena paccayo’’tiādinā nayena paccayabhājanīyasaṅkhāto niddesavāro paṭhamaṃ vutto. Sopi ca anantarasaṅkhepatthavinicchayo tattha tattha dassito eva. Tadanantaraṃ tesaṃ catuvīsatiyā paccayānaṃ kusalattikādayo dvāvīsatitike, hetudukādayo sataṃ duke ca nissāya nānānayato vibhajanavasena catuvīsatisamantapaṭṭhānasamodhānaṃ anantanayasamantapaṭṭhānaṃ vibhattaṃ. Kathaṃ? Catubbidhaṃ hi paṭṭhānaṃ – anulomapaṭṭhānaṃ, paccanīkapaṭṭhānaṃ, anulomapaccanīkapaṭṭhānaṃ, paccanīkānulomapaṭṭhānanti. Tattha ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjati hetupaccayā’’tiādinā, ‘‘hetuṃ dhammaṃ paṭicca hetudhammo uppajjati hetupaccayā’’tiādinā kusalādīnaṃ, hetuādīnañca dhammānaṃ anulomavasena pavattaṃ anulomapaṭṭhānaṃ nāma. ‘‘Nakusalaṃ dhammaṃ paṭicca nakusalo dhammo uppajjati hetupaccayā…pe… nahetuṃ dhammaṃ paṭicca nahetudhammo uppajjati hetupaccayā’’tiādinā kusalādīnaṃ, hetuādīnañca dhammānaṃ paccanīkavasena pavattaṃ paccanīkapaṭṭhānaṃ nāma. ‘‘Kusalaṃ dhammaṃ paṭicca nakusalo dhammo uppajjati hetupaccayā…pe… hetuṃ dhammaṃ paṭicca nahetudhammo uppajjati hetupaccayā’’tiādinā pavattaṃ anulomapaccanīkapaṭṭhānaṃ nāma . ‘‘Nakusalaṃ dhammaṃ paṭicca kusalo dhammo…pe… nahetuṃ dhammaṃ paṭicca hetudhammo uppajjati hetupaccayā’’tiādinā pavattaṃ paccanīkānulomapaṭṭhānaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evametesu catūsu paṭṭhānesu yaṃ dhammaṃ anulomapaṭṭhānaṃ nāma, taṃ tāva chabbidhaṃ hoti – tikapaṭṭhānaṃ dukapaṭṭhānaṃ dukatikapaṭṭhānaṃ tikadukapaṭṭhānaṃ tikatikapaṭṭhānaṃ dukadukapaṭṭhānanti. Yathā cetaṃ, evaṃ paccanīkapaṭṭhānādīnipi tīṇi tīṇi paccekanti catuvīsatisamantapaṭṭhānasamodhānaṃ paṭṭhānappakaraṇaṃ veditabbaṃ. Sammāsambuddhena hi anulomapaṭṭhāne dvāvīsatitike nissāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikapaṭṭhānaṃ"
      },
      " nāma niddiṭṭhaṃ. Sataṃ duke nissāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukapaṭṭhānaṃ"
      },
      " nāma. Tato tike dukesu pakkhipitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukatikapaṭṭhānaṃ"
      },
      " nāma. Tato duke tikesu pakkhipitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikadukapaṭṭhānaṃ"
      },
      " nāma. Tike pana tikesuyeva pakkhipitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikatikapaṭṭhānaṃ"
      },
      " nāma. Duke ca dukesu eva pakkhipitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukadukapaṭṭhānaṃ"
      },
      " nāma niddiṭṭhaṃ. Paṭhamaṃ tāvettha anulomapaṭṭhāne tikapaṭṭhānanayo niddiṭṭho. Evaṃ paccanīkapaṭṭhāne, anulomapaccanīkapaṭṭhāne, paccanīkānulomapaṭṭhāneti catuvīsatisamantapaṭṭhānaṃ desitaṃ."
    ],
    "innerText": "Evametesu catūsu paṭṭhānesu yaṃ dhammaṃ anulomapaṭṭhānaṃ nāma, taṃ tāva chabbidhaṃ hoti – tikapaṭṭhānaṃ dukapaṭṭhānaṃ dukatikapaṭṭhānaṃ tikadukapaṭṭhānaṃ tikatikapaṭṭhānaṃ dukadukapaṭṭhānanti. Yathā cetaṃ, evaṃ paccanīkapaṭṭhānādīnipi tīṇi tīṇi paccekanti catuvīsatisamantapaṭṭhānasamodhānaṃ paṭṭhānappakaraṇaṃ veditabbaṃ. Sammāsambuddhena hi anulomapaṭṭhāne dvāvīsatitike nissāya tikapaṭṭhānaṃ nāma niddiṭṭhaṃ. Sataṃ duke nissāya dukapaṭṭhānaṃ nāma. Tato tike dukesu pakkhipitvā dukatikapaṭṭhānaṃ nāma. Tato duke tikesu pakkhipitvā tikadukapaṭṭhānaṃ nāma. Tike pana tikesuyeva pakkhipitvā tikatikapaṭṭhānaṃ nāma. Duke ca dukesu eva pakkhipitvā dukadukapaṭṭhānaṃ nāma niddiṭṭhaṃ. Paṭhamaṃ tāvettha anulomapaṭṭhāne tikapaṭṭhānanayo niddiṭṭho. Evaṃ paccanīkapaṭṭhāne, anulomapaccanīkapaṭṭhāne, paccanīkānulomapaṭṭhāneti catuvīsatisamantapaṭṭhānaṃ desitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca duvidhaṃ anulomaṃ, paccanīkañca dhammānulomaṃ dhammapaccanīkaṃ, paccayānulomaṃ paccayapaccanīkanti. Tattha ‘‘kusalaṃ dhammaṃ ",
      " paṭicca kusalo dhammo’’tiādinā kusalādīnaṃ tikadhammānaṃ, hetuādīnaṃ dukadhammānañca anulomadesanāvasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammānulomaṃ"
      },
      " veditabbaṃ. ‘‘Nakusalaṃ dhammaṃ paṭicca nakusalo dhammo’’tiādinā tikadukadhammānaṃ paccanīkavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammapaccanīkaṃ"
      },
      " veditabbaṃ. ‘‘Hetupaccayā ārammaṇapaccayā’’ti evaṃ catuvīsatiyā paccayānaṃ anulomadesanāvasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccayānulomaṃ"
      },
      " veditabbaṃ. ‘‘Nahetupaccayā nārammaṇapaccayā’’ti evaṃ paccayānaṃ paccanīkavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccayapaccanīkañca"
      },
      " veditabbaṃ. Tatra yadidaṃ dhammānulomaṃ dhammapaccanīkañca, tassa vasena catuvīsatisamantapaṭṭhānaṃ veditabbaṃ. Paccayānulomaṃ paccayapaccanīkañca anulomatikapaṭṭhānādīsu catuvīsatiyā paṭṭhānesu ekekatikadukesu evaṃ labbhati. Tañca upari pāḷinayadassane eva pākaṭaṃ bhavissati. Tatrimāni catuvīsati paṭṭhānāni imesaṃ tikadukānaṃ vasena niddiṭṭhattā tikapaṭṭhānaṃ…pe… dukadukapaṭṭhānanti vuccati."
    ],
    "innerText": "Ettha ca duvidhaṃ anulomaṃ, paccanīkañca dhammānulomaṃ dhammapaccanīkaṃ, paccayānulomaṃ paccayapaccanīkanti. Tattha ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo’’tiādinā kusalādīnaṃ tikadhammānaṃ, hetuādīnaṃ dukadhammānañca anulomadesanāvasena dhammānulomaṃ veditabbaṃ. ‘‘Nakusalaṃ dhammaṃ paṭicca nakusalo dhammo’’tiādinā tikadukadhammānaṃ paccanīkavasena dhammapaccanīkaṃ veditabbaṃ. ‘‘Hetupaccayā ārammaṇapaccayā’’ti evaṃ catuvīsatiyā paccayānaṃ anulomadesanāvasena paccayānulomaṃ veditabbaṃ. ‘‘Nahetupaccayā nārammaṇapaccayā’’ti evaṃ paccayānaṃ paccanīkavasena paccayapaccanīkañca veditabbaṃ. Tatra yadidaṃ dhammānulomaṃ dhammapaccanīkañca, tassa vasena catuvīsatisamantapaṭṭhānaṃ veditabbaṃ. Paccayānulomaṃ paccayapaccanīkañca anulomatikapaṭṭhānādīsu catuvīsatiyā paṭṭhānesu ekekatikadukesu evaṃ labbhati. Tañca upari pāḷinayadassane eva pākaṭaṃ bhavissati. Tatrimāni catuvīsati paṭṭhānāni imesaṃ tikadukānaṃ vasena niddiṭṭhattā tikapaṭṭhānaṃ…pe… dukadukapaṭṭhānanti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesu tikadukesu ekekaṃ tikadukaṃ imesaṃ hetupaccayādīnaṃ catuvīsatiyā paccayānaṃ anulomādinayacatukkavasena sattahi sattahi mahāvārehi vitthārato vibhattaṃ. Katamehi sattahi? Paṭiccavāro sahajātavāro paccayavāro nissayavāro saṃsaṭṭhavāro sampayuttavāro pañhāvāroti imehi ",
      ". Tattha ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo’’tiādinā paṭiccābhidhānena vutto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭiccavāro"
      },
      " nāma. ‘‘Kusalaṃ dhammaṃ sahajāto, kusalaṃ dhammaṃ paccayā, kusalaṃ dhammaṃ nissāya, kusalaṃ dhammaṃ saṃsaṭṭho, kusalaṃ dhammaṃ sampayutto’’ti evaṃ sahajātādiabhidhānehi vuttā pañca vārā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahajātādivārāni"
      },
      ". Parato ca saṃsaṭṭhasampayuttavāresu dvīsu arūpadhammavaseneva paccayapaccayuppannā ca, sesesu catūsu vāresu, sattameva pañhāvāre ca rūpārūpavasena, paccayavāre, nissayavāre ca sahajātapacchājātapurejātavasena, sesesu ",
      " sahajātavasena paccayapaccayuppannā ca kathitāti ayaṃ viseso. Sattamavāre pana yasmā ‘‘kusalo dhammo kusalassa dhammassa hetupaccayena paccayo’’tiādinā nayena te te pañhe uddharitvā puna ‘‘kusalā hetū sampayuttakānaṃ khandhāna’’ntiādinā nayena sabbepi te pañhā nijjaṭā, niggumbā ca katvā vibhattā, tasmā so vāro pañhānaṃ sādhukaṃ vibhattattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañhāvāro"
      },
      "tveva saṅkhaṃ gato. Iti imehi sattahi mahāvārehi catuvīsatiyā samantapaṭṭhānesu sabbepi tikadukā catuvīsatiyā paccayānaṃ anulomādivasena vitthārato vibhattā. Kathaṃ? Anulomapaṭṭhāne hi yadidaṃ dvāvīsatitike nissāya tikapaṭṭhānaṃ nāma sabbapaṭhamaṃ niddiṭṭhaṃ. Tattha kusalattikaṃ tāva imehi paṭiccavārādīhi mahāvārehi paccayānulomādinayacatukkato vibhattaṃ. Tattha yo tāvesa sabbapaṭhamo paṭiccavāro nāma, so uddesaniddesato duvidho hoti."
    ],
    "innerText": "Tesu tikadukesu ekekaṃ tikadukaṃ imesaṃ hetupaccayādīnaṃ catuvīsatiyā paccayānaṃ anulomādinayacatukkavasena sattahi sattahi mahāvārehi vitthārato vibhattaṃ. Katamehi sattahi? Paṭiccavāro sahajātavāro paccayavāro nissayavāro saṃsaṭṭhavāro sampayuttavāro pañhāvāroti imehi . Tattha ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo’’tiādinā paṭiccābhidhānena vutto paṭiccavāro nāma. ‘‘Kusalaṃ dhammaṃ sahajāto, kusalaṃ dhammaṃ paccayā, kusalaṃ dhammaṃ nissāya, kusalaṃ dhammaṃ saṃsaṭṭho, kusalaṃ dhammaṃ sampayutto’’ti evaṃ sahajātādiabhidhānehi vuttā pañca vārā sahajātādivārāni. Parato ca saṃsaṭṭhasampayuttavāresu dvīsu arūpadhammavaseneva paccayapaccayuppannā ca, sesesu catūsu vāresu, sattameva pañhāvāre ca rūpārūpavasena, paccayavāre, nissayavāre ca sahajātapacchājātapurejātavasena, sesesu sahajātavasena paccayapaccayuppannā ca kathitāti ayaṃ viseso. Sattamavāre pana yasmā ‘‘kusalo dhammo kusalassa dhammassa hetupaccayena paccayo’’tiādinā nayena te te pañhe uddharitvā puna ‘‘kusalā hetū sampayuttakānaṃ khandhāna’’ntiādinā nayena sabbepi te pañhā nijjaṭā, niggumbā ca katvā vibhattā, tasmā so vāro pañhānaṃ sādhukaṃ vibhattattā pañhāvārotveva saṅkhaṃ gato. Iti imehi sattahi mahāvārehi catuvīsatiyā samantapaṭṭhānesu sabbepi tikadukā catuvīsatiyā paccayānaṃ anulomādivasena vitthārato vibhattā. Kathaṃ? Anulomapaṭṭhāne hi yadidaṃ dvāvīsatitike nissāya tikapaṭṭhānaṃ nāma sabbapaṭhamaṃ niddiṭṭhaṃ. Tattha kusalattikaṃ tāva imehi paṭiccavārādīhi mahāvārehi paccayānulomādinayacatukkato vibhattaṃ. Tattha yo tāvesa sabbapaṭhamo paṭiccavāro nāma, so uddesaniddesato duvidho hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha uddesavāro kusalādayo paṭicca hetupaccayādivasena kusalādīnaṃ yuttānaṃ, akusalādīnaṃ ayuttakānañca dhammānaṃ uppattipucchanavaseneva pavattattā ‘‘pucchāvāro’’tipi, pucchānaññeva paññāpanato ‘‘paṇṇattivāro’’tipi vuccati. Na hi tattha vissajjanaṃ atthi. Niddesavāro pana pucchāvāre paripucchitesu pañhesu ‘‘siyā akusalaṃ dhammaṃ paṭicca akusalo dhammo uppajjeyyā’’tiādikaṃ ayuttaṃ pañhaṃ anuddharitvā labbhamānānaññeva pañhānaṃ vasena pavatto. Itaresu pana sahajātādīsu, sesesu ca tikesu, sesapaṭṭhānesu ca sabbattha pucchāvāro natthi, labbhamānavasena sabbavissajjanameva dassitanti idamettha saṅkhepato pāḷivavatthānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni panettha ādito paṭṭhāya evaṃ vibhaṅganayo veditabbo. Anulomapaṭṭhānasmiñhi tikapaṭṭhāne kusalattikassa sattasu mahāvāresu paṭhamassa paṭiccavārassa pucchāvāre tāva ",
      " – ‘‘siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā…pe… akusalo dhammo…pe… abyākato…pe… kusalo ca abyākato ca…pe… akusalo ca abyākato ",
      " ca…pe… kusalo ca akusalo ca…pe… kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā’’ti kusalapadamūlā satta pucchā uddhaṭā."
    ],
    "innerText": "Idāni panettha ādito paṭṭhāya evaṃ vibhaṅganayo veditabbo. Anulomapaṭṭhānasmiñhi tikapaṭṭhāne kusalattikassa sattasu mahāvāresu paṭhamassa paṭiccavārassa pucchāvāre tāva – ‘‘siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā…pe… akusalo dhammo…pe… abyākato…pe… kusalo ca abyākato ca…pe… akusalo ca abyākato ca…pe… kusalo ca akusalo ca…pe… kusalo ca akusalo ca abyākato ca dhammā uppajjeyyuṃ hetupaccayā’’ti kusalapadamūlā satta pucchā uddhaṭā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ akusalapadamūlā, abyākatapadamūlā ca. ‘‘Siyā kusalañca abyākatañca dhammaṃ paṭicca akusalo…pe… siyā akusalañca abyākatañca…pe… siyā kusalañca akusalañca…pe… siyā kusalañca akusalañca abyākatañca dhammaṃ paṭiccā’’ti dvimūlakā, timūlakā ca satta satta pucchāti ekūnapaññāsa pucchā hetupaccayamūlakā uddhaṭā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Imināva nayena ‘‘siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya ārammaṇapaccayā…pe… avigatapaccayā’’ti evaṃ sesapaccayamūlakāpi pucchāveditabbā. Ekamūlakanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathā ca ekamūlake, evaṃ ‘‘siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā ārammaṇapaccayā…pe… hetupaccayā avigatapaccayā’’tiādinā dvimūlakepi. ‘‘Hetupaccayā ārammaṇapaccayā adhipatipaccayā…pe… hetupaccayā ārammaṇapaccayā anantarapaccayā…pe… hetupaccayā ārammaṇapaccayā avigatapaccayā’’tiādinā timūlakādīsu sabbamūlakapariyosānesu vāresu nayā veditabbā. Hetupaccayamūlakanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā ca hetumūlake, evaṃ ‘‘siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya ārammaṇapaccayā’’tiādinā sesapaccayamūlakesupi nayo ñātabbo. Paccayānulomavāro. Eteneva upāyena ‘‘siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya nahetupaccayā’’tiādinā sabbappakārayutto ",
      " paccayapaccanīkavāropi. ‘‘Siyā kusalaṃ dhammaṃ…pe… uppajjati hetupaccayā nārammaṇapaccayā’’tiādinā anulomapaccanīkapaccayavāropi. ‘‘Siyā kusalaṃ dhammaṃ…pe… uppajjeyya nahetupaccayā ārammaṇapaccayā’’tiādinā paccanīyānulomavāropi sabbattha netabboti ayaṃ tāvettha pucchāvāre nayo."
    ],
    "innerText": "Yathā ca hetumūlake, evaṃ ‘‘siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya ārammaṇapaccayā’’tiādinā sesapaccayamūlakesupi nayo ñātabbo. Paccayānulomavāro. Eteneva upāyena ‘‘siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya nahetupaccayā’’tiādinā sabbappakārayutto paccayapaccanīkavāropi. ‘‘Siyā kusalaṃ dhammaṃ…pe… uppajjati hetupaccayā nārammaṇapaccayā’’tiādinā anulomapaccanīkapaccayavāropi. ‘‘Siyā kusalaṃ dhammaṃ…pe… uppajjeyya nahetupaccayā ārammaṇapaccayā’’tiādinā paccanīyānulomavāropi sabbattha netabboti ayaṃ tāvettha pucchāvāre nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Niddesavāro pana uddesavāre dassitāsu pucchāsu kusalākusalādīnaṃ sahuppattiyā abhāvato yā etā ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjatī’’tiādikā pucchā sabbaso ",
      " vissajjanaṃ labhanti, tā pahāya yā vissajjanaṃ labhanti, tāsameva vissajjanavasena pavatto. Tatrāyaṃ nayo – ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjati hetupaccayā. Kusalaṃ ekaṃ khandhaṃ paṭicca tayo khandhā. Tayo khandhe paṭicca eko khandho. Dve khandhe paṭicca dve khandhā. Kusalaṃ dhammaṃ paṭicca abyākato dhammo uppajjati hetupaccayā. Kusale khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ. Kusalaṃ dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjanti hetupaccayā. Kusalaṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ. Tayo khandhe paṭicca eko khandho cittasamuṭṭhānañca rūpaṃ. Dve khandhe paṭicca dve khandhā cittasamuṭṭhānañca rūpa’’nti evaṃ kusalapadamūlāsu sattasu pucchāsu tissova labbhamānā vissajjitā. Tathā akusalapadamūlāsupi tissova. Abyākatapadamūlāsu pana ‘‘abyākataṃ dhammaṃ paṭicca abyākato dhammo uppajjati hetupaccayā. Vipākābyākataṃ kiriyābyākataṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe paṭicca dve khandhā cittasamuṭṭhānañca rūpaṃ. Paṭisandhikkhaṇe vipākābyākataṃ ekaṃ khandhaṃ paṭicca tayo khandhā kaṭattā ca rūpaṃ…pe… dve khandhā kaṭattā ca rūpaṃ. Khandhe paṭicca vatthu, vatthuṃ paṭicca khandhā. Ekaṃ mahābhūtaṃ paṭicca tayo mahābhūtā…pe… dve mahābhūte paṭicca ",
      " dve mahābhūtā. Mahābhūte paṭicca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpa’’nti ekāva. Dvimūlikādīsu ca ‘‘kusalañca abyākatañca dhammaṃ paṭicca abyākato dhammo uppajjati hetupaccayā. Kusale khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpa’’nti ekā. Tathā ‘‘akusalañca abyākatañca paṭiccā’’ti, evaṃ hetupaccayamūlikāsu ekūnapaññāsāya pucchāsu naveva labbhamānā vissajjitā. Sesā cattālīsa moghapucchāti na vissajjitā. Evaṃ upari ārammaṇapaccayādīsu vissajjitāvasesā moghapucchāti gahetabbā. Vijānanasukhatthaṃ pana bhagavatā pucchāvāre labbhamānā, alabbhamānā ca sabbāpi tā dassitāti veditabbāti."
    ],
    "innerText": "Niddesavāro pana uddesavāre dassitāsu pucchāsu kusalākusalādīnaṃ sahuppattiyā abhāvato yā etā ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjatī’’tiādikā pucchā sabbaso vissajjanaṃ labhanti, tā pahāya yā vissajjanaṃ labhanti, tāsameva vissajjanavasena pavatto. Tatrāyaṃ nayo – ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjati hetupaccayā. Kusalaṃ ekaṃ khandhaṃ paṭicca tayo khandhā. Tayo khandhe paṭicca eko khandho. Dve khandhe paṭicca dve khandhā. Kusalaṃ dhammaṃ paṭicca abyākato dhammo uppajjati hetupaccayā. Kusale khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ. Kusalaṃ dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjanti hetupaccayā. Kusalaṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ. Tayo khandhe paṭicca eko khandho cittasamuṭṭhānañca rūpaṃ. Dve khandhe paṭicca dve khandhā cittasamuṭṭhānañca rūpa’’nti evaṃ kusalapadamūlāsu sattasu pucchāsu tissova labbhamānā vissajjitā. Tathā akusalapadamūlāsupi tissova. Abyākatapadamūlāsu pana ‘‘abyākataṃ dhammaṃ paṭicca abyākato dhammo uppajjati hetupaccayā. Vipākābyākataṃ kiriyābyākataṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe paṭicca dve khandhā cittasamuṭṭhānañca rūpaṃ. Paṭisandhikkhaṇe vipākābyākataṃ ekaṃ khandhaṃ paṭicca tayo khandhā kaṭattā ca rūpaṃ…pe… dve khandhā kaṭattā ca rūpaṃ. Khandhe paṭicca vatthu, vatthuṃ paṭicca khandhā. Ekaṃ mahābhūtaṃ paṭicca tayo mahābhūtā…pe… dve mahābhūte paṭicca dve mahābhūtā. Mahābhūte paṭicca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpa’’nti ekāva. Dvimūlikādīsu ca ‘‘kusalañca abyākatañca dhammaṃ paṭicca abyākato dhammo uppajjati hetupaccayā. Kusale khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpa’’nti ekā. Tathā ‘‘akusalañca abyākatañca paṭiccā’’ti, evaṃ hetupaccayamūlikāsu ekūnapaññāsāya pucchāsu naveva labbhamānā vissajjitā. Sesā cattālīsa moghapucchāti na vissajjitā. Evaṃ upari ārammaṇapaccayādīsu vissajjitāvasesā moghapucchāti gahetabbā. Vijānanasukhatthaṃ pana bhagavatā pucchāvāre labbhamānā, alabbhamānā ca sabbāpi tā dassitāti veditabbāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kusalaṃ dhammaṃ paṭiccā"
      },
      "ti sahajātesu vedanākkhandhādibhedaṃ ekaṃ kusalaṃ dhammaṃ paṭicca paṭigantvā, sahuppattisaṅkhātena sadisabhāvena patvāti attho. Sadisattho hi ettha paṭisaddo ‘‘paṭipuggalo’’tiādīsu viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalo dhammo"
      },
      "ti saññākkhandhādibhedo sahuppanno kusalo dhammo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppajjatī"
      },
      "ti pākaṭabhāvato uddhaṃ uppādādiṃ pāpuṇāti, attānaṃ vā paṭilabhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hetupaccayā"
      },
      "ti na kevalaṃ kusaladhammamattameva paṭicca uppajjati, atha kho kusalahetunā hetupaccayataṃ sādhentena ca uppajjatīti evamattho gahetabbo."
    ],
    "innerText": "Tattha kusalaṃ dhammaṃ paṭiccāti sahajātesu vedanākkhandhādibhedaṃ ekaṃ kusalaṃ dhammaṃ paṭicca paṭigantvā, sahuppattisaṅkhātena sadisabhāvena patvāti attho. Sadisattho hi ettha paṭisaddo ‘‘paṭipuggalo’’tiādīsu viya. Kusalo dhammoti saññākkhandhādibhedo sahuppanno kusalo dhammo. Uppajjatīti pākaṭabhāvato uddhaṃ uppādādiṃ pāpuṇāti, attānaṃ vā paṭilabhati. Hetupaccayāti na kevalaṃ kusaladhammamattameva paṭicca uppajjati, atha kho kusalahetunā hetupaccayataṃ sādhentena ca uppajjatīti evamattho gahetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evamidaṃ ",
      " ‘‘uppajjeyyā’’ti pucchāya ‘‘uppajjatī’’ti avisesena vissajjanaṃ vatvā idāni yaṃ dhammaṃ paṭicca ye dhammā uppajjanti, te paccayapaccayuppanne khandhavasena visesetvā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kusalaṃ ekaṃ khandha’’"
      },
      "ntiādi vuttaṃ. Yasmā panettha eko khandho ekasseva, dvinnaṃyeva vā, dve vā pana ekasseva paccayā nāma na honti, tasmā te pakārena anāmasitvā ‘‘ekaṃ khandhaṃ paṭicca tayo khandhā’’tiādinā paccayabhāvena gahitāvasesaṃ sabbaṃ paccayuppannaṃ katvā dassitanti veditabbaṃ. Evaṃ uparipi sabbattha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittasamuṭṭhānaṃ rūpa"
      },
      "nti idaṃ paṭiccatthassa sahajātatthattā ",
      " yaṃ kusalena sahajātañceva hetupaccayañca labhati, taṃ dassetuṃ vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vipākābyākataṃ kiriyābyākata’’"
      },
      "nti. Ettha hetupaccayādhikāre ahetukā na gahetabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khandhe paṭicca vatthū"
      },
      "tiādi kaṭattārūpaggahaṇena vatthusmiṃ gahitepi vatthuṃ paṭicca arūpakkhandhānaṃ uppattidassanatthaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekaṃ mahābhūta"
      },
      "ntiādi pana rūpābyākataṃ paṭicca rūpābyākatassa uppattidassanatthaṃ. Hetupaccaye upatthambhakānameva cettha cittajānaṃ, paṭisandhiyaṃ kammajānañca aññamaññaṃ paccayapaccayuppannatā gahetabbā, na ahetukacittajautujādīnaṃ tesaṃ hetupaccayā uppattiyā abhāvato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahābhūte paṭicca cittasamuṭṭhāna"
      },
      "ntiādi mahābhūte paṭicca upādādīnaṃ uppattidassanatthaṃ vuttaṃ. Iminā upāyena ārammaṇapaccayādīsupi vissajjanānaṃ attho veditabbo."
    ],
    "innerText": "Evamidaṃ ‘‘uppajjeyyā’’ti pucchāya ‘‘uppajjatī’’ti avisesena vissajjanaṃ vatvā idāni yaṃ dhammaṃ paṭicca ye dhammā uppajjanti, te paccayapaccayuppanne khandhavasena visesetvā dassetuṃ ‘‘kusalaṃ ekaṃ khandha’’ntiādi vuttaṃ. Yasmā panettha eko khandho ekasseva, dvinnaṃyeva vā, dve vā pana ekasseva paccayā nāma na honti, tasmā te pakārena anāmasitvā ‘‘ekaṃ khandhaṃ paṭicca tayo khandhā’’tiādinā paccayabhāvena gahitāvasesaṃ sabbaṃ paccayuppannaṃ katvā dassitanti veditabbaṃ. Evaṃ uparipi sabbattha. Cittasamuṭṭhānaṃ rūpanti idaṃ paṭiccatthassa sahajātatthattā yaṃ kusalena sahajātañceva hetupaccayañca labhati, taṃ dassetuṃ vuttaṃ ‘‘vipākābyākataṃ kiriyābyākata’’nti. Ettha hetupaccayādhikāre ahetukā na gahetabbā. Khandhe paṭicca vatthūtiādi kaṭattārūpaggahaṇena vatthusmiṃ gahitepi vatthuṃ paṭicca arūpakkhandhānaṃ uppattidassanatthaṃ vuttaṃ. Ekaṃ mahābhūtantiādi pana rūpābyākataṃ paṭicca rūpābyākatassa uppattidassanatthaṃ. Hetupaccaye upatthambhakānameva cettha cittajānaṃ, paṭisandhiyaṃ kammajānañca aññamaññaṃ paccayapaccayuppannatā gahetabbā, na ahetukacittajautujādīnaṃ tesaṃ hetupaccayā uppattiyā abhāvato. Mahābhūte paṭicca cittasamuṭṭhānantiādi mahābhūte paṭicca upādādīnaṃ uppattidassanatthaṃ vuttaṃ. Iminā upāyena ārammaṇapaccayādīsupi vissajjanānaṃ attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ārammaṇapaccaye ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjati ārammaṇapaccayā. Ekaṃ khandhaṃ…pe… dve khandhe paṭicca dve khandhā. Akusalaṃ dhammaṃ paṭicca akusalo dhammo…pe… abyākataṃ dhammaṃ paṭicca abyākato dhammo uppajjati ārammaṇapaccayā. Vipākābyākataṃ kiriyābyākataṃ ekaṃ khandhaṃ…pe… dve khandhā. Paṭisandhikkhaṇe vipākābyākataṃ ekaṃ khandhaṃ…pe… dve khandhā. Vatthuṃ paṭicca khandhā’’ti evaṃ tisso vissajjitā. Sesā rūpamissakattā, rūpassa ca ārammaṇapaccayena anuppattito na gahitā. Teneva ‘‘vatthuṃ paṭicca khandhā’’ti vatvā ‘‘khandhe paṭicca vatthū’’ti na vuttaṃ. Ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇapaccayā"
      },
      "ti sahajātaṃ kusalaṃ dhammaṃ paṭicca uppajjamāno kusalo dhammo tato aññena asahajātena chabbidhena ārammaṇabhūtena paccayenāti evaṃ attho gahetabbo. Na hi attanā sahajātaṃ ārammaṇaṃ katvā cittacetasikā uppajjanti."
    ],
    "innerText": "Ārammaṇapaccaye ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjati ārammaṇapaccayā. Ekaṃ khandhaṃ…pe… dve khandhe paṭicca dve khandhā. Akusalaṃ dhammaṃ paṭicca akusalo dhammo…pe… abyākataṃ dhammaṃ paṭicca abyākato dhammo uppajjati ārammaṇapaccayā. Vipākābyākataṃ kiriyābyākataṃ ekaṃ khandhaṃ…pe… dve khandhā. Paṭisandhikkhaṇe vipākābyākataṃ ekaṃ khandhaṃ…pe… dve khandhā. Vatthuṃ paṭicca khandhā’’ti evaṃ tisso vissajjitā. Sesā rūpamissakattā, rūpassa ca ārammaṇapaccayena anuppattito na gahitā. Teneva ‘‘vatthuṃ paṭicca khandhā’’ti vatvā ‘‘khandhe paṭicca vatthū’’ti na vuttaṃ. Ettha ca ārammaṇapaccayāti sahajātaṃ kusalaṃ dhammaṃ paṭicca uppajjamāno kusalo dhammo tato aññena asahajātena chabbidhena ārammaṇabhūtena paccayenāti evaṃ attho gahetabbo. Na hi attanā sahajātaṃ ārammaṇaṃ katvā cittacetasikā uppajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Adhipatipaccaye hetupaccayasadisaṃ vissajjanaṃ. Anantarasamanantaresu pana rūpābhāvato ārammaṇapaccayasadisaṃ. Sahajātapaccayepi ",
      " hetupaccayasadisaṃ. Abyākataṃ paṭicca abyākatuppattiyā ",
      " pana ‘‘bāhiraṃ ekaṃ mahābhūtaṃ paṭicca…pe… dve mahābhūtā. Mahābhūte paṭicca upādārūpaṃ…pe… āhārasamuṭṭhānaṃ ekaṃ mahābhūtaṃ…pe… dve mahābhūtā…pe… utusamuṭṭhānaṃ ekaṃ…pe… dve mahābhūtā…pe… asaññasattānaṃ ekaṃ mahābhūtaṃ paṭicca…pe… dve mahābhūtā…pe… kaṭattārūpaṃ upādārūpa’’nti idaṃ adhikaṃ. Evaṃ aññamaññapaccayepi. Kevalaṃ tattha kaṭattārūpaṃ upādārūpañca na gahitaṃ tesaṃ aññamaññapaccayattābhāvā. Nissayapaccayepi sahajātapaccayasadisaṃ vissajjanaṃ. Paṭiccatthassa pana sahajātatthattā cakkhādīsu purejātanissayā idha na gahitāti. Upanissayapaccayepi rūpassa upanissayapaccayuppannattābhāvā ārammaṇapaccayasadisameva vissajjanaṃ."
    ],
    "innerText": "Adhipatipaccaye hetupaccayasadisaṃ vissajjanaṃ. Anantarasamanantaresu pana rūpābhāvato ārammaṇapaccayasadisaṃ. Sahajātapaccayepi hetupaccayasadisaṃ. Abyākataṃ paṭicca abyākatuppattiyā pana ‘‘bāhiraṃ ekaṃ mahābhūtaṃ paṭicca…pe… dve mahābhūtā. Mahābhūte paṭicca upādārūpaṃ…pe… āhārasamuṭṭhānaṃ ekaṃ mahābhūtaṃ…pe… dve mahābhūtā…pe… utusamuṭṭhānaṃ ekaṃ…pe… dve mahābhūtā…pe… asaññasattānaṃ ekaṃ mahābhūtaṃ paṭicca…pe… dve mahābhūtā…pe… kaṭattārūpaṃ upādārūpa’’nti idaṃ adhikaṃ. Evaṃ aññamaññapaccayepi. Kevalaṃ tattha kaṭattārūpaṃ upādārūpañca na gahitaṃ tesaṃ aññamaññapaccayattābhāvā. Nissayapaccayepi sahajātapaccayasadisaṃ vissajjanaṃ. Paṭiccatthassa pana sahajātatthattā cakkhādīsu purejātanissayā idha na gahitāti. Upanissayapaccayepi rūpassa upanissayapaccayuppannattābhāvā ārammaṇapaccayasadisameva vissajjanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Purejātapaccaye pana ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjati purejātapaccayā. Kusalaṃ ekaṃ…pe… dve khandhā. Vatthuṃ purejātapaccayā. Akusalaṃ dhammaṃ paṭicca akusalo…pe… abyākataṃ dhammaṃ paṭicca abyākato…pe… purejātapaccayā. Vipākābyākataṃ kiriyābyākataṃ ekaṃ khandhaṃ…pe… dve khandhā. Vatthuṃ purejātapaccayā’’ti evaṃ tisso pucchā vissajjitā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vatthuṃ purejātapaccayā"
      },
      "ti idaṃ ārammaṇapurejātanivattanatthaṃ vuttaṃ. Taṃ hi cakkhuviññāṇādīnaṃyeva purejātapaccayataṃ sādhayati, na manoviññāṇadhātuyāti idha na gahitaṃ."
    ],
    "innerText": "Purejātapaccaye pana ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjati purejātapaccayā. Kusalaṃ ekaṃ…pe… dve khandhā. Vatthuṃ purejātapaccayā. Akusalaṃ dhammaṃ paṭicca akusalo…pe… abyākataṃ dhammaṃ paṭicca abyākato…pe… purejātapaccayā. Vipākābyākataṃ kiriyābyākataṃ ekaṃ khandhaṃ…pe… dve khandhā. Vatthuṃ purejātapaccayā’’ti evaṃ tisso pucchā vissajjitā. Tattha vatthuṃ purejātapaccayāti idaṃ ārammaṇapurejātanivattanatthaṃ vuttaṃ. Taṃ hi cakkhuviññāṇādīnaṃyeva purejātapaccayataṃ sādhayati, na manoviññāṇadhātuyāti idha na gahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pacchājātapaccayo idha arūpadhammesu na labbhati. Rūpadhammesu ca upatthambhakova, na janako, tasmā ‘‘abyākataṃ dhammaṃ paṭicca abyākato dhammo uppajjatī’’tiādi na vattabbovāti ayaṃ na gahito. Āsevanapaccayepi ārammaṇapaccaye viya tissova pucchā vissajjitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kammapaccaye ",
      " ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjati kammapaccayā. Kusalaṃ ekaṃ khandhaṃ…pe… abyākato dhammo uppajjati…pe… cittasamuṭṭhānañca rūpaṃ…pe… kusalo ca abyākato ca dhammā…pe… cittasamuṭṭhānaṃ rūpa’’nti kusalapade tisso, tathā akusalapade. Abyākatapade pana ‘‘abyākataṃ dhammaṃ paṭicca abyākato…pe… vipākābyākataṃ kiriyābyākataṃ ekaṃ khandhaṃ paṭicca…pe… mahābhūte paṭicca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ, asaññasattānaṃ…pe… kaṭattārūpaṃ upādārūpa’’nti evaṃ tisso. ‘‘Kusalañca abyākatañca dhammaṃ paṭicca abyākato…pe… kusale khandhe ca mahābhūte ",
      " ca paṭicca cittasamuṭṭhānaṃ rūpa’’ntiādinā sahajātasadisaṃ vissajjanaṃ. Natthivigatapaccayesu ārammaṇasadisaṃ."
    ],
    "innerText": "Kammapaccaye ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjati kammapaccayā. Kusalaṃ ekaṃ khandhaṃ…pe… abyākato dhammo uppajjati…pe… cittasamuṭṭhānañca rūpaṃ…pe… kusalo ca abyākato ca dhammā…pe… cittasamuṭṭhānaṃ rūpa’’nti kusalapade tisso, tathā akusalapade. Abyākatapade pana ‘‘abyākataṃ dhammaṃ paṭicca abyākato…pe… vipākābyākataṃ kiriyābyākataṃ ekaṃ khandhaṃ paṭicca…pe… mahābhūte paṭicca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ, asaññasattānaṃ…pe… kaṭattārūpaṃ upādārūpa’’nti evaṃ tisso. ‘‘Kusalañca abyākatañca dhammaṃ paṭicca abyākato…pe… kusale khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpa’’ntiādinā sahajātasadisaṃ vissajjanaṃ. Natthivigatapaccayesu ārammaṇasadisaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ sabbapaccayesu labbhamānapañhe vissajjanaṃ dassetvā tato hetuadhipatijhānamaggapaccayā ekasadisā. Ārammaṇānantarasamanantarūpanissayāsevananatthivigatapaccayā ekasadisā. Sahajātaaññamaññanissayaatthiavigatā ekasadisā. Āsevanapaccaye vipāko na labbhati. Aññamaññapaccaye cittajarūpaṃ, upādārūpañca na labbhatītiādinā paccayānaṃ aññamaññasadisattaṃ vatvā puna tesaṃ ‘‘hetuyā nava. Ārammaṇe tīṇi. Adhipatiyā nava. Anantarasamanantaresu tīṇi. Sahajāte nava. Aññamaññe tīṇi. Nissaye nava. Upanissaye tīṇi. Purejāte tīṇi. Āsevane tīṇi. Kamme nava. Vipāke ekaṃ. Āhāre nava. Indriye nava. Jhāne nava. Magge nava. Sampayutte tīṇi. Vippayutte nava. Atthiyā nava. Natthiyā tīṇi. Vigate tīṇi. Avigate navā’’ti evaṃ hetupaccayādīnaṃ ekekasmiṃ pucchāvissajjanavāragaṇanā vuttāti ayaṃ ekamūlakanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā ca ekamūlake, evaṃ ‘‘hetupaccayā ārammaṇapaccayā’’tiādinā dvimūlakādīsupi sabbamūlakapariyosānesu yathānurūpaṃ ",
      " nayo netabbo. Pāḷiyampi vitthāranayaṃ adassetvā ‘‘hetupaccayā ārammaṇe tīṇī’’tiādinā vissajjanavāragaṇanabhedo dassitoti ayaṃ paccayānulome nayo."
    ],
    "innerText": "Yathā ca ekamūlake, evaṃ ‘‘hetupaccayā ārammaṇapaccayā’’tiādinā dvimūlakādīsupi sabbamūlakapariyosānesu yathānurūpaṃ nayo netabbo. Pāḷiyampi vitthāranayaṃ adassetvā ‘‘hetupaccayā ārammaṇe tīṇī’’tiādinā vissajjanavāragaṇanabhedo dassitoti ayaṃ paccayānulome nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paccayapaccanīye pana ‘‘akusalaṃ dhammaṃ paṭicca akusalo dhammo uppajjati nahetupaccayā. Vicikicchāsahagate uddhaccasahagate khandhe paṭicca vicikicchāsahagato uddhaccasahagato moho. Abyākataṃ dhammaṃ paṭicca abyākato dhammo uppajjati nahetupaccayā. Ahetukaṃ vipākābyākataṃ kiriyābyākataṃ ekaṃ khandhaṃ…pe… dve khandhā cittasamuṭṭhānañca rūpaṃ. Ahetukapaṭisandhikkhaṇe vipākābyākataṃ ekaṃ khandhaṃ…pe… dve khandhā kaṭattā ca rūpaṃ…pe… vatthuṃ paṭicca khandhā. Ekaṃ mahābhūtaṃ paṭicca…pe… mahābhūte paṭicca cittasamuṭṭhānaṃ rūpaṃ, kaṭattārūpaṃ upādārūpaṃ…pe… ekaṃ mahābhūtaṃ paṭicca…pe… upādārūpa’’nti imā dve vissajjitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nārammaṇapaccaye ",
      " ‘‘kusalaṃ dhammaṃ paṭicca abyākato…pe… kusale…pe… akusalaṃ dhammaṃ paṭicca abyākato…pe… akusale…pe… abyākataṃ dhammaṃ paṭicca abyākato…pe… kusalañca abyākatañca dhammaṃ paṭicca abyākato…pe… cittasamuṭṭhānaṃ rūpaṃ, akusalañca abyākatañca dhammaṃ paṭicca abyākato…pe… mahābhūte paṭicca cittasamuṭṭhānaṃ rūpa’’nti imā pañca vissajjitā."
    ],
    "innerText": "Nārammaṇapaccaye ‘‘kusalaṃ dhammaṃ paṭicca abyākato…pe… kusale…pe… akusalaṃ dhammaṃ paṭicca abyākato…pe… akusale…pe… abyākataṃ dhammaṃ paṭicca abyākato…pe… kusalañca abyākatañca dhammaṃ paṭicca abyākato…pe… cittasamuṭṭhānaṃ rūpaṃ, akusalañca abyākatañca dhammaṃ paṭicca abyākato…pe… mahābhūte paṭicca cittasamuṭṭhānaṃ rūpa’’nti imā pañca vissajjitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nādhipatipaccaye ‘‘kusalaṃ dhammaṃ paṭicca kusalo…pe… kusalaṃ ekaṃ khandhaṃ…pe… dve khandhā. Kusalaṃ dhammaṃ paṭicca abyākato…pe… kusale khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ. Kusalaṃ dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjanti…pe… akusalaṃ dhammaṃ paṭicca akusalo…pe… dve khandhe paṭicca dve khandhā, akusalaṃ dhammaṃ paṭicca abyākato…pe… akusale khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ. Akusalaṃ dhammaṃ paṭicca akusalo ca abyākato ca dhammā…pe… abyākataṃ dhammaṃ paṭicca abyākato ",
      " …pe… mahābhūte paṭicca…pe… kaṭattārūpaṃ upādārūpaṃ. Kusalañca abyākatañca dhammaṃ paṭicca abyākato…pe… kusale khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ. Akusalañca abyākatañca dhammaṃ paṭicca abyākato…pe… akusale khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpa’’nti nava pucchā vissajjitā. Nānantaranasamanantarapaccayā nārammaṇapaccayasadisā."
    ],
    "innerText": "Nādhipatipaccaye ‘‘kusalaṃ dhammaṃ paṭicca kusalo…pe… kusalaṃ ekaṃ khandhaṃ…pe… dve khandhā. Kusalaṃ dhammaṃ paṭicca abyākato…pe… kusale khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ. Kusalaṃ dhammaṃ paṭicca kusalo ca abyākato ca dhammā uppajjanti…pe… akusalaṃ dhammaṃ paṭicca akusalo…pe… dve khandhe paṭicca dve khandhā, akusalaṃ dhammaṃ paṭicca abyākato…pe… akusale khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ. Akusalaṃ dhammaṃ paṭicca akusalo ca abyākato ca dhammā…pe… abyākataṃ dhammaṃ paṭicca abyākato …pe… mahābhūte paṭicca…pe… kaṭattārūpaṃ upādārūpaṃ. Kusalañca abyākatañca dhammaṃ paṭicca abyākato…pe… kusale khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ. Akusalañca abyākatañca dhammaṃ paṭicca abyākato…pe… akusale khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpa’’nti nava pucchā vissajjitā. Nānantaranasamanantarapaccayā nārammaṇapaccayasadisā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nāññamaññapaccaye ‘‘kusalaṃ dhammaṃ paṭicca abyākato…pe… kusale…pe… cittasamuṭṭhānaṃ rūpaṃ. Akusalaṃ dhammaṃ paṭicca abyākato…pe… akusale…pe… cittasamuṭṭhānaṃ rūpaṃ. Abyākataṃ dhammaṃ paṭicca abyākato…pe… vipākābyākate kiriyābyākate khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe vipākābyākate…pe… kaṭattā rūpaṃ. Mahābhūte paṭicca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Bāhire mahābhūte paṭicca upādārūpaṃ. Āhārasamuṭṭhāne mahābhūte paṭicca upādārūpaṃ. Utusamuṭṭhāne…pe… upādārūpaṃ. Asaññasattānaṃ mahābhūte paṭicca kaṭattārūpaṃ upādārūpaṃ. Kusalañca abyākatañca dhammaṃ paṭicca abyākato…pe… kusale khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ. Akusalañca abyākatañca dhammaṃ paṭicca abyākato…pe… akusale khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpa’’nti pañca vissajjitā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipākābyākate"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khandhe paṭicca kaṭattārūpa"
      },
      "nti hadayavatthuvajjaṃ veditabbaṃ. Naupanissayapaccayo nārammaṇapaccayasadiso."
    ],
    "innerText": "Nāññamaññapaccaye ‘‘kusalaṃ dhammaṃ paṭicca abyākato…pe… kusale…pe… cittasamuṭṭhānaṃ rūpaṃ. Akusalaṃ dhammaṃ paṭicca abyākato…pe… akusale…pe… cittasamuṭṭhānaṃ rūpaṃ. Abyākataṃ dhammaṃ paṭicca abyākato…pe… vipākābyākate kiriyābyākate khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe vipākābyākate…pe… kaṭattā rūpaṃ. Mahābhūte paṭicca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Bāhire mahābhūte paṭicca upādārūpaṃ. Āhārasamuṭṭhāne mahābhūte paṭicca upādārūpaṃ. Utusamuṭṭhāne…pe… upādārūpaṃ. Asaññasattānaṃ mahābhūte paṭicca kaṭattārūpaṃ upādārūpaṃ. Kusalañca abyākatañca dhammaṃ paṭicca abyākato…pe… kusale khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ. Akusalañca abyākatañca dhammaṃ paṭicca abyākato…pe… akusale khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpa’’nti pañca vissajjitā. Tattha vipākābyākatekhandhe paṭicca kaṭattārūpanti hadayavatthuvajjaṃ veditabbaṃ. Naupanissayapaccayo nārammaṇapaccayasadiso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Napurejātapaccaye ‘‘kusalaṃ dhammaṃ paṭicca kusalo…pe… arūpe kusalaṃ…pe… dve khandhā. Kusalaṃ paṭicca abyākato…pe… cittasamuṭṭhānaṃ rūpa’’nti kusalapade dve, tathā akusalapadepi. ‘‘Abyākataṃ paṭicca abyākato…pe… arūpe vipākābyākataṃ kiriyābyākataṃ…pe… bāhiraṃ…pe… upādārūpaṃ. Kusalañca ",
      " abyākatañca dhammaṃ paṭicca abyākato. Kusale khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ. Akusalañca abyākatañca…pe… akusale khandhe ca…pe… rūpa’’nti imā tissoti satta vissajjitā. Napacchājātanāsevanapaccayā nādhipatipaccayasadisā. Tattha kusalākusalakiriyānaṃ paṭhamajavanavasena nāsevanapaccayappavatti veditabbā."
    ],
    "innerText": "Napurejātapaccaye ‘‘kusalaṃ dhammaṃ paṭicca kusalo…pe… arūpe kusalaṃ…pe… dve khandhā. Kusalaṃ paṭicca abyākato…pe… cittasamuṭṭhānaṃ rūpa’’nti kusalapade dve, tathā akusalapadepi. ‘‘Abyākataṃ paṭicca abyākato…pe… arūpe vipākābyākataṃ kiriyābyākataṃ…pe… bāhiraṃ…pe… upādārūpaṃ. Kusalañca abyākatañca dhammaṃ paṭicca abyākato. Kusale khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ. Akusalañca abyākatañca…pe… akusale khandhe ca…pe… rūpa’’nti imā tissoti satta vissajjitā. Napacchājātanāsevanapaccayā nādhipatipaccayasadisā. Tattha kusalākusalakiriyānaṃ paṭhamajavanavasena nāsevanapaccayappavatti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakammapaccaye ‘‘kusalaṃ paṭicca kusalo, kusalā cetanā. Akusalaṃ paṭicca akusalo, akusalā cetanā. Abyākataṃ paṭicca abyākato, vipākakiriyā cetanā. Bāhiraṃ, āhārasamuṭṭhānaṃ, utusamuṭṭhāna’’nti tisso vissajjitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Navipākapaccaye ‘‘kusalaṃ paṭicca kusalo, abyākato. Kusalo ca abyākato cā’’ti kusalapade tisso, tathā akusalapadepi. ‘‘Abyākataṃ paṭicca abyākato…pe… bāhiraṃ āhārasamuṭṭhānaṃ utusamuṭṭhānaṃ asañña…pe… upādārūpaṃ…pe… akusalañca abyākatañca abyākato’’ti imā tissoti nava vissajjitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nāhārapaccaye ‘‘abyākataṃ paṭicca abyākato. Bāhiraṃ utusamuṭṭhānaṃ, asañña…pe… upādārūpa’’nti ekāva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naindriyapaccaye ‘‘abyākataṃ paṭicca abyākato. Bāhiraṃ āhārasamuṭṭhānaṃ…pe… utusamuṭṭhānaṃ…pe… asaññasattānaṃ mahābhūte paṭicca rūpajīvitindriya’’nti ekāva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Najhānapaccaye ",
      " ‘‘abyākataṃ paṭicca abyākato. Pañcaviññāṇasahagataṃ…pe… bāhiraṃ āhārautuasaññaupādārūpa’’nti ekāva."
    ],
    "innerText": "Najhānapaccaye ‘‘abyākataṃ paṭicca abyākato. Pañcaviññāṇasahagataṃ…pe… bāhiraṃ āhārautuasaññaupādārūpa’’nti ekāva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Namaggapaccaye ‘‘abyākataṃ paṭicca abyākato. Ahetukaṃ vipākābyākataṃ kiriyābyākataṃ…pe… cittasamuṭṭhānaṃ…pe… ahetukapaṭisandhikkhaṇe ",
      " vipākā…pe… kaṭattā ca rūpaṃ…pe… bāhiraṃ āhārautuasaññaupādārūpa’’nti ekāva."
    ],
    "innerText": "Namaggapaccaye ‘‘abyākataṃ paṭicca abyākato. Ahetukaṃ vipākābyākataṃ kiriyābyākataṃ…pe… cittasamuṭṭhānaṃ…pe… ahetukapaṭisandhikkhaṇe vipākā…pe… kaṭattā ca rūpaṃ…pe… bāhiraṃ āhārautuasaññaupādārūpa’’nti ekāva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasampayuttapaccayo nārammaṇapaccayasadiso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Navippayuttapaccaye ‘‘kusalaṃ paṭicca kusalo. Arūpe kusalova. Akusalaṃ…pe… arūpe akusalo. Abyākataṃ paṭicca abyākato, arūpe vipākakiriyābyākataṃ. Bāhiraṃ asañña…pe… upādārūpa’’nti imā tissova pucchā vissajjitā. Nonatthinovigatapaccayā nārammaṇapaccayasadisā. Nasahajātananissayanoatthinoavigatapaccayā panettha cattāropi na labbhantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ paccanīke labbhamānapañhavissajjanaṃ dassetvā tato ‘‘nahetuyā dve. Nārammaṇe pañca. Nādhipatiyā nava. Nānantare nasamanantare nāññamaññe naupanissaye pañca. Napurejāte satta. Napacchājāte nāsevane nava. Nakamme tīṇi. Navipāke nava. Nāhāre naindriye najhāne namagge ekaṃ. Nasampayutte pañca. Navippayutte tīṇi. Nonatthinovigatesu pañcā’’ti vissajjanavāragaṇanā vuttāti ayaṃ ekamūlakanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Imināva nayena dvimūlakādīsupi yathānurūpaṃ nayo netabbo, pāḷiyaṃ pana ‘‘nahetupaccayā nārammaṇe eka’’ntiādinā vissajjanavāragaṇanāva dassitāti ayaṃ paccayapaccanīyanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iminā vuttānusāreneva ‘‘kusalaṃ dhammaṃ paṭicca abyākato dhammo uppajjati hetupaccayā nārammaṇapaccayā’’tiādinā anulomapaccanīyanaye, ‘‘akusalaṃ dhammaṃ paṭicca akusalo dhammo uppajjati nahetupaccayā ārammaṇapaccayā’’tiādinā paccanīyānulomanaye pañhavissajjananayo veditabbo ",
      ". Pāḷiyaṃ panettha vissajjanavāragaṇanāva dassitāti ",
      " ayaṃ anulomapaccanīyakusalattike paṭiccavāranayo."
    ],
    "innerText": "Iminā vuttānusāreneva ‘‘kusalaṃ dhammaṃ paṭicca abyākato dhammo uppajjati hetupaccayā nārammaṇapaccayā’’tiādinā anulomapaccanīyanaye, ‘‘akusalaṃ dhammaṃ paṭicca akusalo dhammo uppajjati nahetupaccayā ārammaṇapaccayā’’tiādinā paccanīyānulomanaye pañhavissajjananayo veditabbo . Pāḷiyaṃ panettha vissajjanavāragaṇanāva dassitāti ayaṃ anulomapaccanīyakusalattike paṭiccavāranayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sahajātavārādīsupi chavāresu paṭiccavāre vuttānusārena sabbattha nayo netabbo. Ye pana tattha tattha pāḷivisesā, atthavisesā ca upalabbhanti, te paṭṭhānapāḷiaṭṭhakathāsu eva sabbākārato gahetabbā. Idha pana te sabbe saṅkhepanayato dassiyamānāpi ganthabhāriyaṃ karontīti na dassitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tesu pana vāresu ‘‘kusalaṃ dhammaṃ sahajāto kusalo dhammo uppajjati hetupaccayā. Kusalaṃ dhammaṃ paccayā… kusalaṃ dhammaṃ nissāya… kusalaṃ dhammaṃ saṃsaṭṭho… kusalaṃ dhammaṃ sampayutto kusalo dhammo uppajjati hetupaccayā’’ti evaṃ ādito pañcasu vāresu pāḷigati ñātabbā. Tesu ca paṭiccasahajātā ekatthā, paccayanissayā ekatthā, saṃsaṭṭhasampayuttā ekatthā. Tattha ‘‘kusalaṃ dhammaṃ sahajāto’’tiādīsu kusalaṃ dhammaṃ paṭicca tena sahajāto hutvātiādinā yathānurūpaṃ attho veditabbo. Pacchime pana pañhāvāre ‘‘kusalo dhammo kusalassa dhammassa hetupaccayena paccayo. Kusalā hetū sampayuttakānaṃ khandhānaṃ hetupaccayena paccayo. Kusalo abyākatassa…pe… kusalassa ca abyākatassa ca…pe… kusalā hetū sampayuttakānaṃ khandhānaṃ cittasamuṭṭhānānañcā’’tiādinā hetupaccaye,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kusalo dhammo kusalassa dhammassa ārammaṇapaccayena paccayo. Dānaṃ datvā sīlaṃ samādiyitvā uposathakammaṃ katvā taṃ paccavekkhati. Pubbe suciṇṇāni…pe… jhānā vuṭṭhahitvā jhānaṃ… sekhā gotrabhuṃ vodānaṃ maggaṃ paccavekkhanti. Sekhā vā puthujjanā vā kusalaṃ aniccato dukkhato anattato vipassanti. Cetopariyañāṇena kusalacittasamaṅgissa cittaṃ jānanti ",
      ". Ākāsānañcāyatanakusalaṃ viññāṇañcāyatanakusalassa ārammaṇapaccayena paccayo. Ākiñcaññāyatanakusalaṃ nevasaññānāsaññāyatanakusalassa… kusalā khandhā iddhividhañāṇassa cetopariyapubbenivāsayathākammūpagaanāgataṃsañāṇassa ārammaṇapaccayena paccayo."
    ],
    "innerText": "‘‘Kusalo dhammo kusalassa dhammassa ārammaṇapaccayena paccayo. Dānaṃ datvā sīlaṃ samādiyitvā uposathakammaṃ katvā taṃ paccavekkhati. Pubbe suciṇṇāni…pe… jhānā vuṭṭhahitvā jhānaṃ… sekhā gotrabhuṃ vodānaṃ maggaṃ paccavekkhanti. Sekhā vā puthujjanā vā kusalaṃ aniccato dukkhato anattato vipassanti. Cetopariyañāṇena kusalacittasamaṅgissa cittaṃ jānanti . Ākāsānañcāyatanakusalaṃ viññāṇañcāyatanakusalassa ārammaṇapaccayena paccayo. Ākiñcaññāyatanakusalaṃ nevasaññānāsaññāyatanakusalassa… kusalā khandhā iddhividhañāṇassa cetopariyapubbenivāsayathākammūpagaanāgataṃsañāṇassa ārammaṇapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kusalo akusalassa…pe… dānaṃ datvā…pe… katvā taṃ assādeti abhinandati. Taṃ ārabbha rāgo uppajjati. Diṭṭhi vicikicchā uddhaccaṃ domanassaṃ uppajjati. Pubbe suciṇṇāni assādeti ",
      " …pe… domanassaṃ uppajjati. Jhānā vuṭṭhahitvā jhānaṃ assādeti…pe… uddhaccaṃ uppajjati. Jhāne parihīne vippaṭisārissa domanassaṃ uppajjati."
    ],
    "innerText": "Kusalo akusalassa…pe… dānaṃ datvā…pe… katvā taṃ assādeti abhinandati. Taṃ ārabbha rāgo uppajjati. Diṭṭhi vicikicchā uddhaccaṃ domanassaṃ uppajjati. Pubbe suciṇṇāni assādeti …pe… domanassaṃ uppajjati. Jhānā vuṭṭhahitvā jhānaṃ assādeti…pe… uddhaccaṃ uppajjati. Jhāne parihīne vippaṭisārissa domanassaṃ uppajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kusalo abyākatassa…pe… paccayo. Arahā maggaṃ paccavekkhati. Pubbe suciṇṇāni… kusala…pe… vipassati…pe… vipāko tadārammaṇatā uppajjati. Ākāsānañcāyatanakusalaṃ viññāṇañcāyatanavipākassa…pe… kiriyassa. Ākiñcaññāyatana…pe… vipākassa ca kiriyassa ca. Kusalā khandhā cetopariya…pe… anāgataṃsañāṇassa āvajjanāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalo akusalassa…pe… paccayo. Rāgaṃ assādeti…pe… uddhaccaṃ uppajjati. Akusalo kusalassa…pe… paccayo. Sekhā pahīne kilese…pe… anāgataṃsañāṇassa. Akusalo abyākatassa… arahā pahīne kilese…pe… āvajjanāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākato abyākatassa… arahā phalaṃ paccavekkhati. Nibbānaṃ, cakkhuṃ…pe… phoṭṭhabbaṃ vipassati. Dibbena cakkhunā rūpaṃ passati…pe… ākiñcaññāyatanakiriyaṃ…pe… kiriyassa. Rūpāyatanaṃ cakkhuviññāṇassa…pe… āvajjanāya. Abyākato kusalassa… sekhā phalaṃ…pe… anāgataṃsañāṇassa. Abyākato akusalassa… cakkhuṃ assādetī’’tiādinā ārammaṇapaccaye ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kusalo ",
      " kusalassa adhipatipaccayena paccayo. Ārammaṇādhipati, sahajātādhipati. Ārammaṇādhipati – dānaṃ datvā’’tiādinā adhipatipaccaye ca,"
    ],
    "innerText": "‘‘Kusalo kusalassa adhipatipaccayena paccayo. Ārammaṇādhipati, sahajātādhipati. Ārammaṇādhipati – dānaṃ datvā’’tiādinā adhipatipaccaye ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kusalo kusalassa anantarapaccayena paccayo’’tiādinā vitthārato anantarasamanantarasahajātaaññamaññanissayapaccayesu ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kusalo kusalassa upanissayapaccayena paccayo. Ārammaṇūpanissayo anantarūpanissayo pakatūpanissayo. Ārammaṇūpanissayo – dānaṃ datvā’’tiādinā ārammaṇapaccaye vuttanayena, ‘‘anantarūpanissayo – purimā purimā kusalā khandhā pacchimānaṃ pacchimāna’’ntiādinā ",
      " anantarapaccaye vuttanayeneva, ‘‘pakatūpanissayo – saddhaṃ upanissāya…pe… uposathakammaṃ karoti. Jhānaṃ, vipassanaṃ, maggaṃ, abhiññaṃ, samāpattiṃ uppādeti. Sīlaṃ, sutaṃ, cāgaṃ, paññaṃ upanissāya…pe… paṭhamassa jhānassa parikammaṃ paṭhamassa jhānassa upanissayapaccayena paccayo…pe… ākiñcaññāyatanaṃ nevasaññānāsaññāyatanassa…pe… yathākammūpagañāṇaṃ anāgataṃsañāṇassa…pe… paṭhamassa maggassa parikammaṃ paṭhamassa…pe… tatiyo maggo catutthassa. Maggo sekhānaṃ atthapaṭisambhidāya…pe… ṭhānāṭhānakosallassa upanissaya. Kusalo akusalassa…pe… ārammaṇūpanissayo. Pakatūpa…pe… pakatūpanissayo – saddhaṃ upanissāya mānaṃ jappeti. Diṭṭhiṃ gaṇhāti…pe… saddhā sīlaṃ sutaṃ cāgo paññā rāgassa, dosassa, mohassa, mānassa, diṭṭhiyā. Patthanāya…pe… kusalo abyākatassa…pe… ārammaṇūpanissayo. Anantarūpanissayo. Pakatūpa…pe… pakatūpanissayo – saddhaṃ upanissāya attānaṃ ātāpeti…pe… kāyikassa sukhassa, dukkhassa, phalasamāpattiyā. Kusalaṃ kammaṃ vipākassa…pe… maggo arahato atthapaṭisambhidāya paccayo."
    ],
    "innerText": "‘‘Kusalo kusalassa upanissayapaccayena paccayo. Ārammaṇūpanissayo anantarūpanissayo pakatūpanissayo. Ārammaṇūpanissayo – dānaṃ datvā’’tiādinā ārammaṇapaccaye vuttanayena, ‘‘anantarūpanissayo – purimā purimā kusalā khandhā pacchimānaṃ pacchimāna’’ntiādinā anantarapaccaye vuttanayeneva, ‘‘pakatūpanissayo – saddhaṃ upanissāya…pe… uposathakammaṃ karoti. Jhānaṃ, vipassanaṃ, maggaṃ, abhiññaṃ, samāpattiṃ uppādeti. Sīlaṃ, sutaṃ, cāgaṃ, paññaṃ upanissāya…pe… paṭhamassa jhānassa parikammaṃ paṭhamassa jhānassa upanissayapaccayena paccayo…pe… ākiñcaññāyatanaṃ nevasaññānāsaññāyatanassa…pe… yathākammūpagañāṇaṃ anāgataṃsañāṇassa…pe… paṭhamassa maggassa parikammaṃ paṭhamassa…pe… tatiyo maggo catutthassa. Maggo sekhānaṃ atthapaṭisambhidāya…pe… ṭhānāṭhānakosallassa upanissaya. Kusalo akusalassa…pe… ārammaṇūpanissayo. Pakatūpa…pe… pakatūpanissayo – saddhaṃ upanissāya mānaṃ jappeti. Diṭṭhiṃ gaṇhāti…pe… saddhā sīlaṃ sutaṃ cāgo paññā rāgassa, dosassa, mohassa, mānassa, diṭṭhiyā. Patthanāya…pe… kusalo abyākatassa…pe… ārammaṇūpanissayo. Anantarūpanissayo. Pakatūpa…pe… pakatūpanissayo – saddhaṃ upanissāya attānaṃ ātāpeti…pe… kāyikassa sukhassa, dukkhassa, phalasamāpattiyā. Kusalaṃ kammaṃ vipākassa…pe… maggo arahato atthapaṭisambhidāya paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Akusalo ",
      " akusalassa…pe… pakatūpanissayo – rāgaṃ upanissāya pāṇaṃ hanati…pe… samphaṃ palapati…pe… saṅghaṃ bhindati. Dosaṃ, mohaṃ, mānaṃ, diṭṭhiṃ, patthanaṃ upanissāya…pe… saṅghaṃ bhindati…pe… pāṇātipāto pāṇātipātassa…pe… saṅghabhedakammassa…pe… paccayo."
    ],
    "innerText": "Akusalo akusalassa…pe… pakatūpanissayo – rāgaṃ upanissāya pāṇaṃ hanati…pe… samphaṃ palapati…pe… saṅghaṃ bhindati. Dosaṃ, mohaṃ, mānaṃ, diṭṭhiṃ, patthanaṃ upanissāya…pe… saṅghaṃ bhindati…pe… pāṇātipāto pāṇātipātassa…pe… saṅghabhedakammassa…pe… paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalo kusalassa…pe… pakatūpanissayo – rāgaṃ upanissāya dānaṃ deti…pe… maggaṃ uppādeti…pe… samāpattiṃ uppādeti. Rāgo…pe… patthanā. Saddhāya, sīlassa…pe… paññāya upanissaya. Pāṇaṃ hantvā tassa paṭighātatthāya dānaṃ detī’’tiādinā ca upanissayapaccaye ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Abyākato abyākatassa purejātapaccayena paccayo…pe… ārammaṇapurejātaṃ – arahā cakkhuṃ…pe… phoṭṭhabbe, vatthuṃ vipassati…pe… dibbena cakkhunā rūpaṃ passati…pe… rūpāyatanaṃ cakkhuviññāṇassa…pe… vatthupurejātaṃ – cakkhāyatanaṃ cakkhuviññāṇassa…pe… vatthu vipākābyākatāna’’ntiādinā purejātapaccaye ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kusalo ",
      " abyākatassa…pe… pacchājātā kusalā khandhā purejātassa imassa kāyassā’’tiādinā pacchājātapaccaye ca,"
    ],
    "innerText": "‘‘Kusalo abyākatassa…pe… pacchājātā kusalā khandhā purejātassa imassa kāyassā’’tiādinā pacchājātapaccaye ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kusalo kusalassa…pe… purimā purimā kusalā khandhā’’tiādinā āsevanapaccaye ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sahajātā nānākkhaṇikā, sahajātā kusalā cetanā…pe… sampayuttakānaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ. Nānākkhaṇikā vipākānaṃ khandhānaṃ kaṭattā ca rūpāna’’ntiādinā kammapaccaye ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Abyākato abyākatassa…pe… eko khandho tiṇṇanna’’ntiādinā vipākapaccaye ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kusalo ",
      " kusalassā’’tiādinā āhārapaccayādīsu ca, ‘‘kusalo abyākatassa, sahajātaṃ, pacchājātaṃ, sahajātā cittasamuṭṭhānānaṃ rūpānaṃ. Pacchājātā imassa kāyassa…pe… abyākato kusalassa…pe… purejātaṃ vatthu kusalānaṃ khandhānaṃ vippayuttapaccayena paccayo’’tiādinā vippayuttapaccayādīsu ca pāḷigati veditabbā."
    ],
    "innerText": "‘‘Kusalo kusalassā’’tiādinā āhārapaccayādīsu ca, ‘‘kusalo abyākatassa, sahajātaṃ, pacchājātaṃ, sahajātā cittasamuṭṭhānānaṃ rūpānaṃ. Pacchājātā imassa kāyassa…pe… abyākato kusalassa…pe… purejātaṃ vatthu kusalānaṃ khandhānaṃ vippayuttapaccayena paccayo’’tiādinā vippayuttapaccayādīsu ca pāḷigati veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha kusaladhammo nāmesa yasmā uppajjanto ṭhapetvā pacchājātapaccayaṃ, vipākapaccayañca sesehi dvāvīsatiyā paccayehi uppajjati. Kusalassa ca paccayo honto ṭhapetvā purejātapacchājātavipākavippayuttapaccaye sesehi vīsatiyā paccayehi paccayo hoti. Evaṃ kusalo kusalādīnaṃ, akusalo ca akusalādīnaṃ yathānurūpaṃ paccayā honti, tasmā kusalādīnaṃ taṃtaṃpaccayuppannavibhāgaṃ dassetuṃ pañhāvāro vutto. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sekhā gotrabhu"
      },
      "nti sotāpannaṃ sandhāya vuttaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vodāna"
      },
      "nti sakadāgāmianāgāmino. Tesaṃ hi gotrabhucittaṃ vodānaṃ nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maggā vuṭṭhahitvā"
      },
      "ti maggavīthito vuṭṭhāya. Na hi maggānantarā paccavekkhaṇā nāma atthīti ayaṃ anulomapaṭṭhāne kusalattikanayo."
    ],
    "innerText": "Tattha kusaladhammo nāmesa yasmā uppajjanto ṭhapetvā pacchājātapaccayaṃ, vipākapaccayañca sesehi dvāvīsatiyā paccayehi uppajjati. Kusalassa ca paccayo honto ṭhapetvā purejātapacchājātavipākavippayuttapaccaye sesehi vīsatiyā paccayehi paccayo hoti. Evaṃ kusalo kusalādīnaṃ, akusalo ca akusalādīnaṃ yathānurūpaṃ paccayā honti, tasmā kusalādīnaṃ taṃtaṃpaccayuppannavibhāgaṃ dassetuṃ pañhāvāro vutto. Tattha sekhā gotrabhunti sotāpannaṃ sandhāya vuttaṃ, vodānanti sakadāgāmianāgāmino. Tesaṃ hi gotrabhucittaṃ vodānaṃ nāma. Maggā vuṭṭhahitvāti maggavīthito vuṭṭhāya. Na hi maggānantarā paccavekkhaṇā nāma atthīti ayaṃ anulomapaṭṭhāne kusalattikanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vedanāttikādīsu ‘‘sukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca sukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Sukhāya vedanāya sampayuttaṃ ekaṃ khandhaṃ paṭicca dve khandhā. Dve khandhe ",
      " paṭicca eko khandho’’tiādinā kusalattike vuttānusārena paṭiccavārādīsu pañhāvārapariyosānesu sattasu vāresu ekekasmiṃ paccayānulomādīhi ca ekamūlādīhi nayehi ca sabbattikesu labbhamānapadavasena gaṇanānayo yojetvā ñātabbo. Tattha vedanāttike vedanākkhandhassa alabbhanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ekaṃ khandhaṃ nissāya dve khandhā’’"
      },
      "tiādi vuttaṃ. Sabbattha viseso ",
      " pāḷiaṭṭhakathānusāreneva ñātabboti ayaṃ anulomapaṭilome ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikapaṭṭhānanayo"
      },
      "."
    ],
    "innerText": "Vedanāttikādīsu ‘‘sukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca sukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Sukhāya vedanāya sampayuttaṃ ekaṃ khandhaṃ paṭicca dve khandhā. Dve khandhe paṭicca eko khandho’’tiādinā kusalattike vuttānusārena paṭiccavārādīsu pañhāvārapariyosānesu sattasu vāresu ekekasmiṃ paccayānulomādīhi ca ekamūlādīhi nayehi ca sabbattikesu labbhamānapadavasena gaṇanānayo yojetvā ñātabbo. Tattha vedanāttike vedanākkhandhassa alabbhanato ‘‘ekaṃ khandhaṃ nissāya dve khandhā’’tiādi vuttaṃ. Sabbattha viseso pāḷiaṭṭhakathānusāreneva ñātabboti ayaṃ anulomapaṭilome tikapaṭṭhānanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dukapaṭṭhāne pana ‘‘hetuṃ dhammaṃ paṭicca hetu dhammo uppajjati hetupaccayā. Alobhaṃ paṭicca adoso. Amoho. Adosaṃ amohaṃ paṭicca alobho. Adoso. Lobhaṃ paṭicca moho. Mohaṃ paṭicca lobho. Dosaṃ paṭicca moho. Mohaṃ paṭicca doso. Paṭisandhikkhaṇe hetuṃ dhammaṃ paṭicca nahetu dhammo uppajjati…pe… hetū ca nahetū ca. Nahetuṃ paṭicca nahetu dhammo na…pe… hetū ca nahetū cā’’tiādinā hetuduke,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sahetukaṃ dhammaṃ paṭicca sahetuko dhammo uppajjati hetupaccayā. Sahetukaṃ ekaṃ khandhaṃ…pe… sahetukaṃ dhammaṃ paṭicca. Ahetuko…pe… cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe…pe… sahetuko ca, ahetuko ca…pe… ahetukaṃ khandhaṃ paṭicca ahetuko. Vicikicchāsahagataṃ uddhaccasahagataṃ mohaṃ paṭicca sampayuttakā khandhā…pe… cittasamuṭṭhānaṃ. Āhārasamuṭṭhāna’’ntiādinā sahetukadukādīsu ca kenaciviññeyyadukavajjitesu sabbadukesu paccekaṃ paṭiccavārādīsu sattasu mahāvāresu ekekasmiṃ paccayānulomādīsu catūsu nayesu ekamūlakādīhi sabbavārehi kusalattike vuttānusārena yathānurūpaṃ vibhaṅganayo yojetvā ñātabbo. Sabbasmimpi hi paṭṭhāne kenaciviññeyyadukaṃ na labbhatīti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukapaṭṭhānanayo"
      },
      "."
    ],
    "innerText": "‘‘Sahetukaṃ dhammaṃ paṭicca sahetuko dhammo uppajjati hetupaccayā. Sahetukaṃ ekaṃ khandhaṃ…pe… sahetukaṃ dhammaṃ paṭicca. Ahetuko…pe… cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe…pe… sahetuko ca, ahetuko ca…pe… ahetukaṃ khandhaṃ paṭicca ahetuko. Vicikicchāsahagataṃ uddhaccasahagataṃ mohaṃ paṭicca sampayuttakā khandhā…pe… cittasamuṭṭhānaṃ. Āhārasamuṭṭhāna’’ntiādinā sahetukadukādīsu ca kenaciviññeyyadukavajjitesu sabbadukesu paccekaṃ paṭiccavārādīsu sattasu mahāvāresu ekekasmiṃ paccayānulomādīsu catūsu nayesu ekamūlakādīhi sabbavārehi kusalattike vuttānusārena yathānurūpaṃ vibhaṅganayo yojetvā ñātabbo. Sabbasmimpi hi paṭṭhāne kenaciviññeyyadukaṃ na labbhatīti ayaṃ dukapaṭṭhānanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dukatikapaṭṭhāne pana ‘‘hetuṃ kusalaṃ dhammaṃ paṭicca hetu kusalo dhammo uppajjati hetupaccayā’’tiādinā hetudukena saddhiṃ kusalattike kusalaṃ padaṃ yojetvā paṭiccavārādīsu sattasu vāresu paccayānulomādīnaṃ catunnaṃ nayānaṃ vasena labbhamānakapaccayā ekamūlakādinayehi dassitā ",
      ". Yathā ca kusalaṃ padaṃ, evaṃ akusalaṃ padaṃ, abyākatañca hetudukena yojetvā vuttanayena dassetvā hetukusaladukatikanti ṭhapitaṃ. Pāḷi pana atisaṃkhittā. Yathā kusalattikaṃ, evaṃ ‘‘hetuṃ sukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca hetu sukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā’’tiādinā labbhamānakapadavasena vedanāttikādayopi hetudukena ",
      " yojetvā hetuvedanadukatikādīni ekavīsatidukatikāni dassitānīti. Yathā ca hetudukena saddhiṃ labbhamānakapadavasena dvāvīsatitikā yojitā, evaṃ sahetukadukādīhi sabbehi saddhiṃ paccekaṃ dvāvīsatitikā yojetabbā. Pāḷi panettha ito paresupi sabbattha atisaṃkhittā. Evaṃ dvāvīsatitike gahetvā dukasate pakkhipitvā dukatikapaṭṭhānaṃ desitanti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukatikapaṭṭhānanayo"
      },
      "."
    ],
    "innerText": "Dukatikapaṭṭhāne pana ‘‘hetuṃ kusalaṃ dhammaṃ paṭicca hetu kusalo dhammo uppajjati hetupaccayā’’tiādinā hetudukena saddhiṃ kusalattike kusalaṃ padaṃ yojetvā paṭiccavārādīsu sattasu vāresu paccayānulomādīnaṃ catunnaṃ nayānaṃ vasena labbhamānakapaccayā ekamūlakādinayehi dassitā . Yathā ca kusalaṃ padaṃ, evaṃ akusalaṃ padaṃ, abyākatañca hetudukena yojetvā vuttanayena dassetvā hetukusaladukatikanti ṭhapitaṃ. Pāḷi pana atisaṃkhittā. Yathā kusalattikaṃ, evaṃ ‘‘hetuṃ sukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca hetu sukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā’’tiādinā labbhamānakapadavasena vedanāttikādayopi hetudukena yojetvā hetuvedanadukatikādīni ekavīsatidukatikāni dassitānīti. Yathā ca hetudukena saddhiṃ labbhamānakapadavasena dvāvīsatitikā yojitā, evaṃ sahetukadukādīhi sabbehi saddhiṃ paccekaṃ dvāvīsatitikā yojetabbā. Pāḷi panettha ito paresupi sabbattha atisaṃkhittā. Evaṃ dvāvīsatitike gahetvā dukasate pakkhipitvā dukatikapaṭṭhānaṃ desitanti ayaṃ dukatikapaṭṭhānanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tikadukapaṭṭhānepi ‘‘kusalaṃ hetuṃ dhammaṃ paṭicca kusalo hetu dhammo uppajjati hetupaccayā’’tiādinā kusalattikena saddhiṃ hetupadaṃ yojetvā paṭiccavārādīsu sattasu mahāvāresu paccayānulomādinayacatukkavasena labbhamānakapaccayā ekamūlādīhi sabbavārehi dassitā. Yathā hetupadaṃ, evaṃ nahetupadampi kusalattikena saddhiṃ yojetvā kusalahetu tikadukanti ṭhapitaṃ. Yathā ca kusalattikena saddhiṃ hetudukaṃ, evaṃ ‘‘sukhāya vedanāya sampayuttaṃ hetuṃ kusalaṃ dhammaṃ paṭiccā’’tiādinā vedanāttikādīhipi taṃ yojetvā vedanāttikadukādīni ekavīsatitikadukādīni dassitāni. Yathā ca hetudukaṃ, evaṃ sahetukādayopi sabbe paccekaṃ dvāvīsatiyā tikehi labbhamānapadavaseneva yojitā. Evaṃ dukasataṃ dvāvīsatiyā tikesu pakkhipitvā tikadukapaṭṭhānaṃ desitanti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikadukapaṭṭhānanayo"
      },
      "."
    ],
    "innerText": "Tikadukapaṭṭhānepi ‘‘kusalaṃ hetuṃ dhammaṃ paṭicca kusalo hetu dhammo uppajjati hetupaccayā’’tiādinā kusalattikena saddhiṃ hetupadaṃ yojetvā paṭiccavārādīsu sattasu mahāvāresu paccayānulomādinayacatukkavasena labbhamānakapaccayā ekamūlādīhi sabbavārehi dassitā. Yathā hetupadaṃ, evaṃ nahetupadampi kusalattikena saddhiṃ yojetvā kusalahetu tikadukanti ṭhapitaṃ. Yathā ca kusalattikena saddhiṃ hetudukaṃ, evaṃ ‘‘sukhāya vedanāya sampayuttaṃ hetuṃ kusalaṃ dhammaṃ paṭiccā’’tiādinā vedanāttikādīhipi taṃ yojetvā vedanāttikadukādīni ekavīsatitikadukādīni dassitāni. Yathā ca hetudukaṃ, evaṃ sahetukādayopi sabbe paccekaṃ dvāvīsatiyā tikehi labbhamānapadavaseneva yojitā. Evaṃ dukasataṃ dvāvīsatiyā tikesu pakkhipitvā tikadukapaṭṭhānaṃ desitanti ayaṃ tikadukapaṭṭhānanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tikatikapaṭṭhānepi ",
      " ‘‘kusalaṃ sukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca kusalo sukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā’’tiādinā kusalattikaṃ vedanāttikādīhi sabbattikehi, vedanāttikādayo ca kusalattikādīhi vuttanayena yojetvā paccayā dassitā. Evaṃ tikesu eva tike pakkhipitvā tikatikapaṭṭhānaṃ desitanti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikatikapaṭṭhānanayo"
      },
      "."
    ],
    "innerText": "Tikatikapaṭṭhānepi ‘‘kusalaṃ sukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca kusalo sukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā’’tiādinā kusalattikaṃ vedanāttikādīhi sabbattikehi, vedanāttikādayo ca kusalattikādīhi vuttanayena yojetvā paccayā dassitā. Evaṃ tikesu eva tike pakkhipitvā tikatikapaṭṭhānaṃ desitanti ayaṃ tikatikapaṭṭhānanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dukadukapaṭṭhānepi ‘‘hetuṃ sahetukaṃ dhammaṃ paṭicca hetu sahetuko dhammo uppajjati hetupaccayā’’tiādinā hetudukaṃ sahetukādīhi, sahetukañca hetudukādīhi yojetvā heṭṭhā vuttanayehi paccayā dassitā. Evaṃ dukesu eva duke pakkhipitvā dukadukapaṭṭhānaṃ desitanti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukadukapaṭṭhānanayo"
      },
      ". Evaṃ tāva anulomapaṭṭhāne –"
    ],
    "innerText": "Dukadukapaṭṭhānepi ‘‘hetuṃ sahetukaṃ dhammaṃ paṭicca hetu sahetuko dhammo uppajjati hetupaccayā’’tiādinā hetudukaṃ sahetukādīhi, sahetukañca hetudukādīhi yojetvā heṭṭhā vuttanayehi paccayā dassitā. Evaṃ dukesu eva duke pakkhipitvā dukadukapaṭṭhānaṃ desitanti ayaṃ dukadukapaṭṭhānanayo. Evaṃ tāva anulomapaṭṭhāne –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tikañca paṭṭhānavaraṃ dukuttamaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "children": [
      "Dukatikañceva ",
      " tikadukañca;"
    ],
    "innerText": "Dukatikañceva tikadukañca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tikatikañceva dukadukañca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Cha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anulomamhi"
      },
      " nayā sugambhīrā’’ti. –"
    ],
    "innerText": "Cha anulomamhi nayā sugambhīrā’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Vuttā cha nayā veditabbā. Paccayavasena panetesu chasu ekekasmiṃ paṭṭhāne paccayānulomādīnaṃ catunnaṃ nayānaṃ vasena etena pariyāyena catuvīsatinayapaṭimaṇḍitamidaṃ dhammānulomapaṭṭhānanti veditabbaṃ. Ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anulomapaṭṭhānanayo"
      },
      "."
    ],
    "innerText": "Vuttā cha nayā veditabbā. Paccayavasena panetesu chasu ekekasmiṃ paṭṭhāne paccayānulomādīnaṃ catunnaṃ nayānaṃ vasena etena pariyāyena catuvīsatinayapaṭimaṇḍitamidaṃ dhammānulomapaṭṭhānanti veditabbaṃ. Ayaṃ anulomapaṭṭhānanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paccanīyapaṭṭhāne pana ‘‘nakusalaṃ dhammaṃ paṭicca nakusalo dhammo uppajjati hetupaccayā. Akusalaṃ abyākataṃ ekaṃ khandhaṃ paṭicca…pe… dve khandhā, cittasamuṭṭhānañca rūpa’’ntiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikapaṭṭhāne,"
      },
      " ‘‘nahetuṃ dhammaṃ paṭicca nahetu dhammo uppajjati hetupaccayā. Nahetuṃ ekaṃ khandhaṃ paṭicca…pe… cittasamuṭṭhānañca rūpa’’ntiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukapaṭṭhāne"
      },
      " ca, ‘‘nahetuṃ nakusalaṃ dhammaṃ paṭicca nahetu nakusalo dhammo uppajjati hetupaccayā. Nahetuṃ nakusalaṃ abyākataṃ ",
      " ekaṃ khandhaṃ paṭicca tayo khandhā’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukatikapaṭṭhāne"
      },
      " ca, ‘‘nakusalaṃ nahetuṃ dhammaṃ paṭicca nakusalo nahetu dhammo uppajjatī’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikadukapaṭṭhāne"
      },
      " ca, ‘‘nakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto dhammo uppajjatī’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikatikapaṭṭhāne"
      },
      " ca, ‘‘nahetuṃ nasahetukaṃ dhammaṃ paṭicca nahetu nasahetuko dhammo uppajjati hetupaccayā’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukadukapaṭṭhāne"
      },
      " cāti chasu paccanīyapaṭṭhānesu anulomatikapaṭṭhānādīsu chasu paṭṭhānesu vuttena sabbena pakārena pāḷinayo veditabbo. Idañca kusalādīnaṃ, hetuādīnañca dhammānaṃ paccayuppannabhāvapaṭikkhepavasena pavattattā dhammapaccanīyapaṭṭhānaṃ nāma jātaṃ. Tattha hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nakusalaṃ dhammaṃ paṭiccā"
      },
      "ti kusalassa paccayapaṭikkhepo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nakusalo dhammo uppajjatī"
      },
      "ti kusalassa paccayuppannabhāvapaṭikkhepo. Tathā ‘‘akusalaṃ abyākataṃ ekaṃ khandhaṃ paṭicca…pe… akusalā, abyākatā khandhā cittasamuṭṭhānañca rūpaṃ uppajjatī’’ti evamādinā nayenettha attho veditabbo. Evamettha paccanīyapaṭṭhāne –"
    ],
    "innerText": "Paccanīyapaṭṭhāne pana ‘‘nakusalaṃ dhammaṃ paṭicca nakusalo dhammo uppajjati hetupaccayā. Akusalaṃ abyākataṃ ekaṃ khandhaṃ paṭicca…pe… dve khandhā, cittasamuṭṭhānañca rūpa’’ntiādinā tikapaṭṭhāne, ‘‘nahetuṃ dhammaṃ paṭicca nahetu dhammo uppajjati hetupaccayā. Nahetuṃ ekaṃ khandhaṃ paṭicca…pe… cittasamuṭṭhānañca rūpa’’ntiādinā dukapaṭṭhāne ca, ‘‘nahetuṃ nakusalaṃ dhammaṃ paṭicca nahetu nakusalo dhammo uppajjati hetupaccayā. Nahetuṃ nakusalaṃ abyākataṃ ekaṃ khandhaṃ paṭicca tayo khandhā’’tiādinā dukatikapaṭṭhāne ca, ‘‘nakusalaṃ nahetuṃ dhammaṃ paṭicca nakusalo nahetu dhammo uppajjatī’’tiādinā tikadukapaṭṭhāne ca, ‘‘nakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto dhammo uppajjatī’’tiādinā tikatikapaṭṭhāne ca, ‘‘nahetuṃ nasahetukaṃ dhammaṃ paṭicca nahetu nasahetuko dhammo uppajjati hetupaccayā’’tiādinā dukadukapaṭṭhāne cāti chasu paccanīyapaṭṭhānesu anulomatikapaṭṭhānādīsu chasu paṭṭhānesu vuttena sabbena pakārena pāḷinayo veditabbo. Idañca kusalādīnaṃ, hetuādīnañca dhammānaṃ paccayuppannabhāvapaṭikkhepavasena pavattattā dhammapaccanīyapaṭṭhānaṃ nāma jātaṃ. Tattha hi nakusalaṃ dhammaṃ paṭiccāti kusalassa paccayapaṭikkhepo. Nakusalo dhammo uppajjatīti kusalassa paccayuppannabhāvapaṭikkhepo. Tathā ‘‘akusalaṃ abyākataṃ ekaṃ khandhaṃ paṭicca…pe… akusalā, abyākatā khandhā cittasamuṭṭhānañca rūpaṃ uppajjatī’’ti evamādinā nayenettha attho veditabbo. Evamettha paccanīyapaṭṭhāne –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tikañca paṭṭhānavaraṃ dukuttamaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dukatikañceva tikadukañca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tikatikañceva dukadukañca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Cha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccanīyamhi"
      },
      " nayā sugambhīrā’’ti. –"
    ],
    "innerText": "Cha paccanīyamhi nayā sugambhīrā’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Vuttā ",
      " cha nayā veditabbā. Paccayavasena panetthāpi ekekasmiṃ paccayānulomādīnaṃ catunnaṃ catunnaṃ nayānaṃ vasena catuvīsatinayapaṭimaṇḍitamidaṃ dhammapaccanīyapaṭṭhānanti veditabbanti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccanīyapaṭṭhānanayo"
      },
      "."
    ],
    "innerText": "Vuttā cha nayā veditabbā. Paccayavasena panetthāpi ekekasmiṃ paccayānulomādīnaṃ catunnaṃ catunnaṃ nayānaṃ vasena catuvīsatinayapaṭimaṇḍitamidaṃ dhammapaccanīyapaṭṭhānanti veditabbanti ayaṃ paccanīyapaṭṭhānanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anulomapaccanīyapaṭṭhāne pana ‘‘kusalaṃ dhammaṃ paṭicca nakusalo dhammo uppajjati hetupaccayā. Kusale khandhe paṭicca cittasamuṭṭhānaṃ rūpa’’ntiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikapaṭṭhāne,"
      },
      " ‘‘hetuṃ dhammaṃ paṭicca nahetu ",
      " dhammo uppajjati hetupaccayā’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukapaṭṭhāne"
      },
      " ca, ‘‘hetuṃ kusalaṃ dhammaṃ paṭicca nahetu nakusalo dhammo uppajjatī’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukatikapaṭṭhāne"
      },
      " ca, ‘‘kusalaṃ hetuṃ dhammaṃ paṭicca nakusalo nahetu dhammo uppajjatī’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikadukapaṭṭhāne"
      },
      " ca, ‘‘kusalaṃ sukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto dhammo uppajjatī’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikatikapaṭṭhāne"
      },
      " ca, ‘‘hetuṃ sahetukaṃ dhammaṃ paṭicca nahetu nasahetuko dhammo uppajjatī’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukadukapaṭṭhāne"
      },
      " ca heṭṭhā vuttanayena sabbena pakārena pāḷinayo veditabbo. Idaṃ kusalādīnaṃ dhammānaṃ paccayattaṃ appaṭikkhipitvā paccayuppannānaṃ kusalādibhāvapaṭikkhepavasena pavattattā dhammānulomapaccanīyapaṭṭhānaṃ nāma jātaṃ. Tattha hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kusalaṃ dhammaṃ paṭiccā"
      },
      "ti kusalassa paccayabhāvavidhānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nakusalo dhammo uppajjatī"
      },
      "ti kusalassa paccayuppannabhāvanivāraṇaṃ, tasmā ‘‘kusale khandhe paṭicca cittasamuṭṭhānaṃ rūpa’’ntiādinā vissajjanaṃ vuttanti veditabbanti evamettha anulomapaccanīyapaṭṭhāne –"
    ],
    "innerText": "Anulomapaccanīyapaṭṭhāne pana ‘‘kusalaṃ dhammaṃ paṭicca nakusalo dhammo uppajjati hetupaccayā. Kusale khandhe paṭicca cittasamuṭṭhānaṃ rūpa’’ntiādinā tikapaṭṭhāne, ‘‘hetuṃ dhammaṃ paṭicca nahetu dhammo uppajjati hetupaccayā’’tiādinā dukapaṭṭhāne ca, ‘‘hetuṃ kusalaṃ dhammaṃ paṭicca nahetu nakusalo dhammo uppajjatī’’tiādinā dukatikapaṭṭhāne ca, ‘‘kusalaṃ hetuṃ dhammaṃ paṭicca nakusalo nahetu dhammo uppajjatī’’tiādinā tikadukapaṭṭhāne ca, ‘‘kusalaṃ sukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto dhammo uppajjatī’’tiādinā tikatikapaṭṭhāne ca, ‘‘hetuṃ sahetukaṃ dhammaṃ paṭicca nahetu nasahetuko dhammo uppajjatī’’tiādinā dukadukapaṭṭhāne ca heṭṭhā vuttanayena sabbena pakārena pāḷinayo veditabbo. Idaṃ kusalādīnaṃ dhammānaṃ paccayattaṃ appaṭikkhipitvā paccayuppannānaṃ kusalādibhāvapaṭikkhepavasena pavattattā dhammānulomapaccanīyapaṭṭhānaṃ nāma jātaṃ. Tattha hi kusalaṃ dhammaṃ paṭiccāti kusalassa paccayabhāvavidhānaṃ. Nakusalo dhammo uppajjatīti kusalassa paccayuppannabhāvanivāraṇaṃ, tasmā ‘‘kusale khandhe paṭicca cittasamuṭṭhānaṃ rūpa’’ntiādinā vissajjanaṃ vuttanti veditabbanti evamettha anulomapaccanīyapaṭṭhāne –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tikañca paṭṭhānavaraṃ dukuttamaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dukatikañceva tikadukañca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tikatikañceva dukadukañca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Cha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anulomapaccanīyamhi"
      },
      " nayā sugambhīrā’’ti. –"
    ],
    "innerText": "Cha anulomapaccanīyamhi nayā sugambhīrā’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Vuttā cha nayā veditabbā. Paccayavasena panetthāpi ekekasmiṃ paccayānulomādīnaṃ catunnaṃ catunnaṃ nayānaṃ vasena catuvīsatinayapaṭimaṇḍitamidaṃ dhammānulomapaccanīyapaṭṭhānanti veditabbanti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anulomapaccanīyapaṭṭhānanayo"
      },
      "."
    ],
    "innerText": "Vuttā cha nayā veditabbā. Paccayavasena panetthāpi ekekasmiṃ paccayānulomādīnaṃ catunnaṃ catunnaṃ nayānaṃ vasena catuvīsatinayapaṭimaṇḍitamidaṃ dhammānulomapaccanīyapaṭṭhānanti veditabbanti ayaṃ anulomapaccanīyapaṭṭhānanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paccanīyānulomapaṭṭhāne ‘‘nakusalaṃ dhammaṃ paṭicca akusalo dhammo…pe… nakusalaṃ dhammaṃ paṭicca ",
      " abyākato dhammo uppajjati hetupaccayā’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikapaṭṭhāne,"
      },
      " ‘‘nahetuṃ dhammaṃ paṭicca hetu dhammo uppajjatī’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukapaṭṭhāne"
      },
      " ca, ‘‘nahetuṃ ",
      " nakusalaṃ dhammaṃ paṭicca hetu akusalo dhammo…pe… hetu abyākato dhammo uppajjatīti’’ādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukatikapaṭṭhāne"
      },
      " ca, ‘‘nakusalaṃ nahetuṃ dhammaṃ paṭicca akusalo hetu dhammo…pe… abyākato hetu dhammo uppajjatī’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikadukapaṭṭhāne"
      },
      " ca, ‘‘nakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca akusalo sukhāya vedanāya sampayutto dhammo…pe… abyākato sukhāya vedanāya sampayutto dhammo uppajjatī’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikatikapaṭṭhāne"
      },
      " ca, ‘‘nahetuṃ nasahetukaṃ dhammaṃ paṭicca hetu sahetuko dhammo uppajjatī’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukadukapaṭṭhāne"
      },
      " ca, heṭṭhā vuttena pakārena pāḷinayo veditabbo. Idañca kusalādidhammānaṃ paccayattaṃ paṭikkhipitvā tesaṃ paccayuppannabhāvaappaṭikkhepavasena pavattattā dhammapaccanīyānulomapaṭṭhānaṃ nāma jātaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nakusalaṃ dhamma"
      },
      "nti kusalassa paccayabhāvanivāraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akusalo dhammo uppajjatī"
      },
      "ti akusalassa uppattividhānaṃ. Kusalaṃ pana paṭicca kusalassa uppattiabhāvato ‘‘kusalo dhammo uppajjatī’’ti avatvā ‘‘akusalo dhammo uppajjatī’’ti labbhamānapadavasena vuttaṃ. Kusalaṃ, hi akusalaṃ, abyākataṃ vā sahajātapaccayaṃ katvā uppajjamāno kusalo nāma natthi, tasmā akusalassa ca abyākatassa ca vasena desanā katā. Evamaññattha. Evamettha dhammapaccanīyānulomapaṭṭhāne –"
    ],
    "innerText": "Paccanīyānulomapaṭṭhāne ‘‘nakusalaṃ dhammaṃ paṭicca akusalo dhammo…pe… nakusalaṃ dhammaṃ paṭicca abyākato dhammo uppajjati hetupaccayā’’tiādinā tikapaṭṭhāne, ‘‘nahetuṃ dhammaṃ paṭicca hetu dhammo uppajjatī’’tiādinā dukapaṭṭhāne ca, ‘‘nahetuṃ nakusalaṃ dhammaṃ paṭicca hetu akusalo dhammo…pe… hetu abyākato dhammo uppajjatīti’’ādinā dukatikapaṭṭhāne ca, ‘‘nakusalaṃ nahetuṃ dhammaṃ paṭicca akusalo hetu dhammo…pe… abyākato hetu dhammo uppajjatī’’tiādinā tikadukapaṭṭhāne ca, ‘‘nakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca akusalo sukhāya vedanāya sampayutto dhammo…pe… abyākato sukhāya vedanāya sampayutto dhammo uppajjatī’’tiādinā tikatikapaṭṭhāne ca, ‘‘nahetuṃ nasahetukaṃ dhammaṃ paṭicca hetu sahetuko dhammo uppajjatī’’tiādinā dukadukapaṭṭhāne ca, heṭṭhā vuttena pakārena pāḷinayo veditabbo. Idañca kusalādidhammānaṃ paccayattaṃ paṭikkhipitvā tesaṃ paccayuppannabhāvaappaṭikkhepavasena pavattattā dhammapaccanīyānulomapaṭṭhānaṃ nāma jātaṃ. Tattha nakusalaṃ dhammanti kusalassa paccayabhāvanivāraṇaṃ. Akusalo dhammo uppajjatīti akusalassa uppattividhānaṃ. Kusalaṃ pana paṭicca kusalassa uppattiabhāvato ‘‘kusalo dhammo uppajjatī’’ti avatvā ‘‘akusalo dhammo uppajjatī’’ti labbhamānapadavasena vuttaṃ. Kusalaṃ, hi akusalaṃ, abyākataṃ vā sahajātapaccayaṃ katvā uppajjamāno kusalo nāma natthi, tasmā akusalassa ca abyākatassa ca vasena desanā katā. Evamaññattha. Evamettha dhammapaccanīyānulomapaṭṭhāne –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tikañca paṭṭhānavaraṃ dukuttamaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dukatikañceva tikadukañca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tikatikañceva dukadukañca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Cha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccanīyānulomamhi"
      },
      " nayā sugambhīrā’’ti. –"
    ],
    "innerText": "Cha paccanīyānulomamhi nayā sugambhīrā’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Vuttā cha nayā veditabbā. Paccayavasena panetthāpi tikapaṭṭhānādīsu ekekasmiṃ paccayānulomādīnaṃ catunnaṃ catunnaṃ ",
      " nayānaṃ vasena ekena pariyāyena catuvīsatinayapaṭimaṇḍitamidaṃ dhammapaccanīyānulomapaṭṭhānanti veditabbanti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccanīyānulomapaṭṭhānanayo"
      },
      "."
    ],
    "innerText": "Vuttā cha nayā veditabbā. Paccayavasena panetthāpi tikapaṭṭhānādīsu ekekasmiṃ paccayānulomādīnaṃ catunnaṃ catunnaṃ nayānaṃ vasena ekena pariyāyena catuvīsatinayapaṭimaṇḍitamidaṃ dhammapaccanīyānulomapaṭṭhānanti veditabbanti ayaṃ paccanīyānulomapaṭṭhānanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evamidaṃ bhagavatā anulomapaṭṭhānādīsu catūsu ekekasmiṃ paṭṭhāne tikadukādīnaññeva channaṃ channaṃ nayānaṃ vasena catuvīsatinayapaṭimaṇḍitaṃ samantapaṭṭhānamahāpakaraṇaṃ desitaṃ. Paccayavasena panetesu catuvīsatiyā paṭṭhānesu ekekasmiṃ paccayānulomādīnaṃ catunnaṃ catunnaṃ nayānaṃ ",
      " vasenetaṃ channavutinayapaṭimaṇḍitaṃ hoti, dhammavaseneva cetaṃ pakaraṇaṃ catuvīsatisamantapaṭṭhānaṃ vuttanti ayamettha vibhaṅganayo."
    ],
    "innerText": "Evamidaṃ bhagavatā anulomapaṭṭhānādīsu catūsu ekekasmiṃ paṭṭhāne tikadukādīnaññeva channaṃ channaṃ nayānaṃ vasena catuvīsatinayapaṭimaṇḍitaṃ samantapaṭṭhānamahāpakaraṇaṃ desitaṃ. Paccayavasena panetesu catuvīsatiyā paṭṭhānesu ekekasmiṃ paccayānulomādīnaṃ catunnaṃ catunnaṃ nayānaṃ vasenetaṃ channavutinayapaṭimaṇḍitaṃ hoti, dhammavaseneva cetaṃ pakaraṇaṃ catuvīsatisamantapaṭṭhānaṃ vuttanti ayamettha vibhaṅganayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mohavicchedaniyā abhidhammamātikatthavaṇṇanāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭṭhānamātikatthavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Nigamanakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā ",
      " ca –"
    ],
    "innerText": "Ettāvatā ca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      "."
    ],
    "innerText": "1."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mātikāyābhidhammassa, āraddhā atthavaṇṇanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mohavicchedanī"
      },
      " nāma, yā sā niṭṭhamupāgatā."
    ],
    "innerText": "Mohavicchedanī nāma, yā sā niṭṭhamupāgatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      "."
    ],
    "innerText": "2."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Niṭṭhaṃ yathāyaṃ sampattā, lajjīhi abhipatthitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbe niṭṭhaṃ tathā santā, samentu sumanorathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      "."
    ],
    "innerText": "3."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yo gambhīro sasādīnaṃ, samuddova bhayāvaho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kālesmiṃ dhīmatañcāpi, api ganthāvalokane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      "."
    ],
    "innerText": "4."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Paṭhamantaradhānassa, abhidhammassa tassa yaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Silālekhā nidhīnaṃva, dhammatthānaṃ pakāsikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      "."
    ],
    "innerText": "5."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nāvā viya samuddassa, sukhotaraṇapaddhati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pāḷiaṭṭhakathā cesā, parisuddhā anākulā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      "."
    ],
    "innerText": "6."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Nayatopi ",
      " avikkiṇṇā, asaṃkiṇṇā nikāyato;"
    ],
    "innerText": "Nayatopi avikkiṇṇā, asaṃkiṇṇā nikāyato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yato sakkacca sotabbā, saddhammaṭṭhitiyā satā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      "."
    ],
    "innerText": "7."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Saddhammaṭṭhitikāmena, anattukkaṃsanādito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Mayāpi vaṇṇayantena, racitā suddhacetasā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tettiṃsabhāṇavārāya, parimāṇena tantiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      "."
    ],
    "innerText": "8."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mātikāvaṇṇanā yā sā, yāva niṭṭhaṃ yathābalaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbatthasaṅgahā esā, anākulapadakkamā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      "."
    ],
    "innerText": "9."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yaṃ pattaṃ kusalaṃ tena, patvā sambodhimuttamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Niṭṭhaṃ pāpeyyamakhile, pāṇino hitacetasā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      "."
    ],
    "innerText": "10."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nānājanādhiramaṇīyatarassa,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Coḷaraṭṭhassa"
      },
      " bhāramadhivāhakulandharassa;"
    ],
    "innerText": "Coḷaraṭṭhassa bhāramadhivāhakulandharassa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Kāveripūtasalilena hitālayassa,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rājādhirājavaravaṃsasupīṇitassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      "."
    ],
    "innerText": "11."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Majjhamhi ",
      " coḷakakalaṅkanibhena maggaṃ,"
    ],
    "innerText": "Majjhamhi coḷakakalaṅkanibhena maggaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Pūraṃ visālavibhavehi mahākulehi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Pākāracakkaparikhāhi ca gopurehi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yuttaṃ janākulasusajjitarājamaggaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      "."
    ],
    "innerText": "12."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sabbūpabhogaparibhogadhanehi nānā-"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Vaṇṇehi puṇṇavividhāpaṇikehi sobhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Coḷādhināgapuranandananāthabhūtaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ye tattha sogatavihāravarābhirāmā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      "."
    ],
    "innerText": "13."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Tesaṃ ",
      " mukhe janamanoharasatthubimba-"
    ],
    "innerText": "Tesaṃ mukhe janamanoharasatthubimba-"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sambhāvite mahati sajjanamānanīye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Vijjālayehi udayācalasannibhehi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kelāsakūṭasikharopamacetiyehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      "."
    ],
    "innerText": "14."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pāsādahammiyavarehi ca maṇḍapehi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Jambambatālapanasāditarāvalīhi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Nandopanandabhujagassa varassa bhoga-"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cakkāvalīsamasudhākatagopurehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      "."
    ],
    "innerText": "15."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yutte visālasikatāsitamāḷakehi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Yutte susīlayatisaṅghanisevitamhi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Kalyāṇakammaniratehi haṭūpahāre,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāgajjuna"
      },
      "vhayavihāravare vasanto."
    ],
    "innerText": "Nāgajjunavhayavihāravare vasanto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      "."
    ],
    "innerText": "16."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nāmena yo dhutadharaggasamānanāmo,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Candova pākaṭanabhoditavītapañño;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Satthantaresu nipuṇo piṭakattaye ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vādībhayūthavipine migarājalīlo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      "."
    ],
    "innerText": "17."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Yo ",
      " sāgarova na vilaṅghati sīlavela-"
    ],
    "innerText": "Yo sāgarova na vilaṅghati sīlavela-"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Mappicchatādiguṇasāravibhūsitatto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Joteti sāsanamalaṃ nikhilaṃ jahanto,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sakkacca dhammavinayaṃ paridīpayanto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      "."
    ],
    "innerText": "18."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tenābhidhammapiṭakaṇṇavavippakiṇṇa-"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sārattharatnanikareva samuddharitvā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "children": [
      "Sammāpajānagaḷalaṅkaraṇāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "moha"
      },
      "-"
    ],
    "innerText": "Sammāpajānagaḷalaṅkaraṇāya moha-"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vicchedanī"
      },
      " viracitā ratanāvalī yā."
    ],
    "innerText": "Vicchedanī viracitā ratanāvalī yā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      "."
    ],
    "innerText": "19."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sāyaṃ pabhāsatu sukittivirājamānā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dhammesu mohatimiraṃ vinihacca sammā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Ābhātu tāva jinasāsanajoti yāva,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vattissatissa janatāhitamāvahantī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      "Iti coḷaraṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahākassapattherena"
      },
      " viracitā"
    ],
    "innerText": "Iti coḷaraṭṭhe mahākassapattherena viracitā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mohavicchedanī"
      },
      " nāma"
    ],
    "innerText": "Mohavicchedanī nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhidhammamātikatthavaṇṇanā niṭṭhitā."
  }
]