[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "5-22. Saṅkiliṭṭhattikādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saṅkiliṭṭhasaṅkilesikattike sabbaṃ kusalattike vuttanayānusāreneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "79"
      },
      ". Vitakkattike ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathākammūpagañāṇassa parikamma"
      },
      "nti dibbacakkhuparikammameva tassa uppādanatthāya ",
      " parikammaṃ. Uppannassa pana vaḷañjanakāle parikammaṃ sandhāyetaṃ vuttaṃ. Sesamettha yathāpāḷimeva niyyāti."
    ],
    "innerText": "79. Vitakkattike yathākammūpagañāṇassa parikammanti dibbacakkhuparikammameva tassa uppādanatthāya parikammaṃ. Uppannassa pana vaḷañjanakāle parikammaṃ sandhāyetaṃ vuttaṃ. Sesamettha yathāpāḷimeva niyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "82"
      },
      ".",
      " Ti tadārammaṇabhavaṅgamūlabhavaṅgānaṃ vasena vuttaṃ. Sesamettha sabbaṃ pāḷivaseneva veditabbaṃ."
    ],
    "innerText": "82. Ti tadārammaṇabhavaṅgamūlabhavaṅgānaṃ vasena vuttaṃ. Sesamettha sabbaṃ pāḷivaseneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanattike ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dassanena pahātabbo rāgo uppajjatī"
      },
      "tiādīsu dassanena pahātabbo puthujjanassa uppajjati. Bhāvanāya pahātabbo sotāpannassāpīti evaṃ uparimassa uparimassa heṭṭhimā heṭṭhimā nuppajjantīti veditabbā. Dassanena pahātabbo dhammo bhāvanāya pahātabbassa dhammassa ekenapi paccayena paccayo na hoti. Sesamettha pāḷiṃ anugantvā kusalattike vuttalakkhaṇavaseneva veditabbaṃ."
    ],
    "innerText": "Dassanattike dassanena pahātabbo rāgo uppajjatītiādīsu dassanena pahātabbo puthujjanassa uppajjati. Bhāvanāya pahātabbo sotāpannassāpīti evaṃ uparimassa uparimassa heṭṭhimā heṭṭhimā nuppajjantīti veditabbā. Dassanena pahātabbo dhammo bhāvanāya pahātabbassa dhammassa ekenapi paccayena paccayo na hoti. Sesamettha pāḷiṃ anugantvā kusalattike vuttalakkhaṇavaseneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanenapahātabbahetukattike dassanenapahātabbahetukādīnaṃ vibhāgo aṭṭhakathākaṇḍe vuttanayeneva veditabbo. Vicikicchuddhaccasahagato moho ahetukattā tatiyapade paviṭṭho. Evamettha yesaṃ ",
      " dassanabhāvanāhi pahātabbo hetu atthi, te pahātabbahetukā. Yesaṃ so natthi te nevadassanena nabhāvanāyapahātabbahetukāti imaṃ pahātabbahetukavibhāgaṃ ñatvā sesaṃ dassanenapahātabbattike ceva kusalattike ca dassitalakkhaṇānusāreneva veditabbaṃ."
    ],
    "innerText": "Dassanenapahātabbahetukattike dassanenapahātabbahetukādīnaṃ vibhāgo aṭṭhakathākaṇḍe vuttanayeneva veditabbo. Vicikicchuddhaccasahagato moho ahetukattā tatiyapade paviṭṭho. Evamettha yesaṃ dassanabhāvanāhi pahātabbo hetu atthi, te pahātabbahetukā. Yesaṃ so natthi te nevadassanena nabhāvanāyapahātabbahetukāti imaṃ pahātabbahetukavibhāgaṃ ñatvā sesaṃ dassanenapahātabbattike ceva kusalattike ca dassitalakkhaṇānusāreneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ācayagāmittike ca paṭiccavārasaṃsaṭṭhavāresu anulomaṃ kusalattikasadisameva. Sesaṃ vissajjanato gaṇanato ca yathāpāḷimeva niyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sekkhattike asekkho dhammo sekkhassa dhammassa na kenaci paccayena paccayo. Sekkho asekkhassa anantarapakatūpanissayo pana hoti. Sesamettha yathāpāḷimeva niyyāti, tathā parittattike."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Parittārammaṇattike ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appamāṇārammaṇācetanā"
      },
      "ti sekkhānaṃ gotrabhucetanā, paccavekkhaṇacetanātipi vattuṃ vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipākānaṃ parittārammaṇāna"
      },
      "nti paṭisandhiyaṃ kammaṃ ārammaṇaṃ katvā, pavatte cakkhuviññāṇādivasenarūpādiārammaṇaṃ, tadārammaṇavasena javanena gahitaparittārammaṇañca ",
      " ārammaṇaṃ katvā uppannānaṃ. Ye pana ‘‘gotrabhucittena natthi paṭisandhī’’ti vadanti, te iminā suttena paṭisedhetabbā. Sesamettha pāḷinayeneva veditabbaṃ. Hīnattiko saṅkiliṭṭhattikasadiso."
    ],
    "innerText": "Parittārammaṇattike appamāṇārammaṇācetanāti sekkhānaṃ gotrabhucetanā, paccavekkhaṇacetanātipi vattuṃ vaṭṭati. Vipākānaṃ parittārammaṇānanti paṭisandhiyaṃ kammaṃ ārammaṇaṃ katvā, pavatte cakkhuviññāṇādivasenarūpādiārammaṇaṃ, tadārammaṇavasena javanena gahitaparittārammaṇañca ārammaṇaṃ katvā uppannānaṃ. Ye pana ‘‘gotrabhucittena natthi paṭisandhī’’ti vadanti, te iminā suttena paṭisedhetabbā. Sesamettha pāḷinayeneva veditabbaṃ. Hīnattiko saṅkiliṭṭhattikasadiso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Micchattattike micchattaniyato sammattaniyatassa, sammattaniyato vā micchattaniyatassa kenaci paccayena paccayo na hoti. Micchattaniyato vā sammattaniyato vā sahajātādhipatirahito nāma natthi. Sammattaniyate ekantato ārammaṇapurejātaṃ natthi, micchattaniyate siyā ārammaṇapurejātaṃ. Aniyataṃ cittaṃ ārabbha niyatā micchādiṭṭhi uppajjeyya. Sesā niyataṃ ārabbha niyataṃ nuppajjati, micchattaniyataṃ garuṃ katvā na koci dhammo uppajjati. Kusalo micchattassa upanissayapaccayo na hoti. Sesamettha pāḷiyaṃ vuttanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Maggārammaṇattike paṭiccavārassa anulome vipākapaccayo natthi. Kammapaccayepi imasmiṃ tike nānākkhaṇikaṃ na labbhati, tathā uppannattikaatītattikesu. Paccanīye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ahetukaṃ maggārammaṇa"
      },
      "nti ahetukaṃ maggārammaṇaṃ, āvajjanaṃ sandhāyetaṃ vuttaṃ. Sesamettha pāḷianusāreneva veditabbaṃ."
    ],
    "innerText": "Maggārammaṇattike paṭiccavārassa anulome vipākapaccayo natthi. Kammapaccayepi imasmiṃ tike nānākkhaṇikaṃ na labbhati, tathā uppannattikaatītattikesu. Paccanīye ahetukaṃ maggārammaṇanti ahetukaṃ maggārammaṇaṃ, āvajjanaṃ sandhāyetaṃ vuttaṃ. Sesamettha pāḷianusāreneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Uppannattike ",
      " ca atītattike ca paṭiccavārādayo natthi, pañhāvāramattameva labbhati. Kasmā? Paṭiccavārādayo hi sahajātapurejātānaññeva honti. Ime ca tikā atītānāgatamissakā. Uppannattike cettha anantarabhāgiyāpi paccayā na labbhanti. Kasmā? Uppannattike atītassa abhāvato. Uppanno ca anuppanno cāti ime cettha dve dhammā uppannassa ca anuppannassa cāti imesaṃ dvinnaṃ na kenaci paccayena paccayo. Anuppanno ca uppādī cāti ime pana dve uppannassa ārammaṇūpanissayavasena dvīhi paccayehi paccayo. Sesamettha pāḷiyaṃ āgatanayeneva veditabbaṃ."
    ],
    "innerText": "Uppannattike ca atītattike ca paṭiccavārādayo natthi, pañhāvāramattameva labbhati. Kasmā? Paṭiccavārādayo hi sahajātapurejātānaññeva honti. Ime ca tikā atītānāgatamissakā. Uppannattike cettha anantarabhāgiyāpi paccayā na labbhanti. Kasmā? Uppannattike atītassa abhāvato. Uppanno ca anuppanno cāti ime cettha dve dhammā uppannassa ca anuppannassa cāti imesaṃ dvinnaṃ na kenaci paccayena paccayo. Anuppanno ca uppādī cāti ime pana dve uppannassa ārammaṇūpanissayavasena dvīhi paccayehi paccayo. Sesamettha pāḷiyaṃ āgatanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atītattike paccuppannaṃ atītānāgatassa, atītānāgatañca atītānāgatassa na kenaci paccayena paccayo. Nibbānaṃ pana dvīsupi imesu tikesu neva paccayato na paccayuppannato labbhati. Sesamidhāpi pāḷiyaṃ āgatanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ajjhattattike ",
      " ajjhattabahiddhāpadaṃ na gahitaṃ. Ajjhattabahiddhāsaṅkhātā hi ubho rāsayo neva ekato paccayā honti, na paccayuppannā; tasmā hatthatale ṭhapitassa sāsapassa vaṇṇopi hatthatalavaṇṇena saddhiṃ ekato ārammaṇaṃ na hotīti veditabbo. Yathā ca ajjhattabahiddhāpadaṃ, evamettha ajjhattārammaṇattikepi ajjhattabahiddhārammaṇapadaṃ na labbhati. Sesaṃ yathāpāḷimeva niyyāti."
    ],
    "innerText": "Ajjhattattike ajjhattabahiddhāpadaṃ na gahitaṃ. Ajjhattabahiddhāsaṅkhātā hi ubho rāsayo neva ekato paccayā honti, na paccayuppannā; tasmā hatthatale ṭhapitassa sāsapassa vaṇṇopi hatthatalavaṇṇena saddhiṃ ekato ārammaṇaṃ na hotīti veditabbo. Yathā ca ajjhattabahiddhāpadaṃ, evamettha ajjhattārammaṇattikepi ajjhattabahiddhārammaṇapadaṃ na labbhati. Sesaṃ yathāpāḷimeva niyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sanidassanattikepi pāḷivaseneva attho gahetabbo. Gaṇanāpettha pāḷiyaṃ āgatavāre saṅkhipitvā heṭṭhā vuttanayeneva saṃsandanesu saṃsanditvā veditabbāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhammānulome tikapaṭṭhānavaṇṇanā."
  }
]