[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammāsambuddhassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "book"
    },
    "innerText": "Abhidhammamātikāpāḷi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekaṃ ",
      " samayaṃ bhagavā devesu viharati tāvatiṃsabhavane pāricchattakamūle paṇḍukambalasilāyaṃ. Tatra kho bhagavā devānaṃ tāvatiṃsānaṃ abhidhammakathaṃ kathesi."
    ],
    "innerText": "Ekaṃ samayaṃ bhagavā devesu viharati tāvatiṃsabhavane pāricchattakamūle paṇḍukambalasilāyaṃ. Tatra kho bhagavā devānaṃ tāvatiṃsānaṃ abhidhammakathaṃ kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "1. Dhammasaṅgaṇīmātikā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Tikamātikā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kusalā dhammā (dha. sa. tikamātikā 1-22), akusalā dhammā, abyākatā dhammā. Sukhāya vedanāya sampayuttā dhammā, dukkhāya vedanāya sampayuttā dhammā, adukkhamasukhāya vedanāya sampayuttā dhammā. Vipākā dhammā, vipākadhammadhammā, nevavipākanavipākadhammadhammā. Upādiṇṇupādāniyā ",
      " dhammā, anupādiṇṇupādāniyā dhammā, anupādiṇṇaanupādāniyā dhammā. Saṃkiliṭṭhasaṃkilesikā dhammā, asaṃkiliṭṭhasaṃkilesikā dhammā, asaṃkiliṭṭhaasaṃkilesikā dhammā. Savitakkasavicārā dhammā, avitakkavicāramattā dhammā, avitakkaavicārā dhammā. Pītisahagatā dhammā, sukhasahagatā dhammā, upekkhāsahagatā dhammā. Dassanena pahātabbā dhammā, bhāvanāya pahātabbā dhammā, neva dassanena na bhāvanāya pahātabbā dhammā. Dassanena pahātabbahetukā dhammā, bhāvanāya pahātabbahetukā dhammā, neva dassanena na bhāvanāya pahātabbahetukā dhammā ",
      ". Ācayagāmino dhammā, apacayagāmino dhammā, nevācayagāmināpacayagāmino dhammā. Sekkhā dhammā, asekkhā dhammā, nevasekkhanāsekkhā dhammā. Parittā dhammā, mahaggatā dhammā, appamāṇā dhammā. Parittārammaṇā dhammā, mahaggatārammaṇā dhammā, appamāṇārammaṇā dhammā. Hīnā dhammā, majjhimā dhammā, paṇītā dhammā. Micchattaniyatā dhammā, sammattaniyatā dhammā, aniyatā dhammā. Maggārammaṇā dhammā, maggahetukā dhammā, maggādhipatino dhammā. Uppannā dhammā, anuppannā dhammā, uppādino dhammā. Atītā dhammā, anāgatā dhammā, paccuppannā dhammā. Atītārammaṇā dhammā, anāgatārammaṇā dhammā, paccuppannārammaṇā dhammā. Ajjhattā dhammā, bahiddhā dhammā, ajjhattabahiddhā dhammā. Ajjhattārammaṇā dhammā, bahiddhārammaṇā dhammā, ajjhattabahiddhārammaṇā dhammā. Sanidassanasappaṭighā dhammā, anidassanasappaṭighā dhammā, anidassanaappaṭighā dhammā (dha. sa. tikamātikā 1-22)."
    ],
    "innerText": "Kusalā dhammā (dha. sa. tikamātikā 1-22), akusalā dhammā, abyākatā dhammā. Sukhāya vedanāya sampayuttā dhammā, dukkhāya vedanāya sampayuttā dhammā, adukkhamasukhāya vedanāya sampayuttā dhammā. Vipākā dhammā, vipākadhammadhammā, nevavipākanavipākadhammadhammā. Upādiṇṇupādāniyā dhammā, anupādiṇṇupādāniyā dhammā, anupādiṇṇaanupādāniyā dhammā. Saṃkiliṭṭhasaṃkilesikā dhammā, asaṃkiliṭṭhasaṃkilesikā dhammā, asaṃkiliṭṭhaasaṃkilesikā dhammā. Savitakkasavicārā dhammā, avitakkavicāramattā dhammā, avitakkaavicārā dhammā. Pītisahagatā dhammā, sukhasahagatā dhammā, upekkhāsahagatā dhammā. Dassanena pahātabbā dhammā, bhāvanāya pahātabbā dhammā, neva dassanena na bhāvanāya pahātabbā dhammā. Dassanena pahātabbahetukā dhammā, bhāvanāya pahātabbahetukā dhammā, neva dassanena na bhāvanāya pahātabbahetukā dhammā . Ācayagāmino dhammā, apacayagāmino dhammā, nevācayagāmināpacayagāmino dhammā. Sekkhā dhammā, asekkhā dhammā, nevasekkhanāsekkhā dhammā. Parittā dhammā, mahaggatā dhammā, appamāṇā dhammā. Parittārammaṇā dhammā, mahaggatārammaṇā dhammā, appamāṇārammaṇā dhammā. Hīnā dhammā, majjhimā dhammā, paṇītā dhammā. Micchattaniyatā dhammā, sammattaniyatā dhammā, aniyatā dhammā. Maggārammaṇā dhammā, maggahetukā dhammā, maggādhipatino dhammā. Uppannā dhammā, anuppannā dhammā, uppādino dhammā. Atītā dhammā, anāgatā dhammā, paccuppannā dhammā. Atītārammaṇā dhammā, anāgatārammaṇā dhammā, paccuppannārammaṇā dhammā. Ajjhattā dhammā, bahiddhā dhammā, ajjhattabahiddhā dhammā. Ajjhattārammaṇā dhammā, bahiddhārammaṇā dhammā, ajjhattabahiddhārammaṇā dhammā. Sanidassanasappaṭighā dhammā, anidassanasappaṭighā dhammā, anidassanaappaṭighā dhammā (dha. sa. tikamātikā 1-22)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dvāvīsatitikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Dukamātikā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetugocchakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hetū dhammā, na hetū dhammā. Sahetukā dhammā, ahetukā dhammā. Hetusampayuttā dhammā, hetuvippayuttā dhammā. Hetū ceva dhammā sahetukā ca, sahetukā ceva dhammā na ca hetū. Hetū ceva ",
      " dhammā hetusampayuttā ca, hetusampayuttā ceva dhammā na ca hetū. Na hetū kho pana dhammā sahetukāpi, ahetukāpi. Hetugocchakaṃ."
    ],
    "innerText": "Hetū dhammā, na hetū dhammā. Sahetukā dhammā, ahetukā dhammā. Hetusampayuttā dhammā, hetuvippayuttā dhammā. Hetū ceva dhammā sahetukā ca, sahetukā ceva dhammā na ca hetū. Hetū ceva dhammā hetusampayuttā ca, hetusampayuttā ceva dhammā na ca hetū. Na hetū kho pana dhammā sahetukāpi, ahetukāpi. Hetugocchakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Cūḷantaradukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sappaccayā dhammā, appaccayā dhammā. Saṅkhatā dhammā, asaṅkhatā dhammā. Sanidassanā dhammā, anidassanā dhammā. Sappaṭighā dhammā, appaṭighā ",
      " dhammā. Rūpino dhammā, arūpino dhammā. Lokiyā dhammā, lokuttarā dhammā. Kenaci viññeyyā dhammā, kenaci na viññeyyā dhammā. Cūḷantaradukaṃ."
    ],
    "innerText": "Sappaccayā dhammā, appaccayā dhammā. Saṅkhatā dhammā, asaṅkhatā dhammā. Sanidassanā dhammā, anidassanā dhammā. Sappaṭighā dhammā, appaṭighā dhammā. Rūpino dhammā, arūpino dhammā. Lokiyā dhammā, lokuttarā dhammā. Kenaci viññeyyā dhammā, kenaci na viññeyyā dhammā. Cūḷantaradukaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Āsavagocchakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Āsavā dhammā, no āsavā dhammā. Sāsavā dhammā, anāsavā dhammā. Āsavasampayuttā dhammā, āsavavippayuttā dhammā. Āsavā ceva dhammā sāsavā ca, sāsavā ceva dhammā no ca āsavā. Āsavā ceva dhammā āsavasampayuttā ca, āsavasampayuttā ceva dhammā no ca āsavā. Āsavavippayuttā kho pana dhammā sāsavāpi, anāsavāpi. Āsavagocchakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Saññojanagocchakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saññojanā dhammā, no saññojanā dhammā. Saññojaniyā dhammā, asaññojaniyā dhammā. Saññojanasampayuttā dhammā, saññojanavippayuttā dhammā. Saññojanā ceva dhammā saññojaniyā ca, saññojaniyā ceva dhammā no ca saññojanā. Saññojanā ceva dhammā saññojanasampayuttā ca, saññojanasampayuttā ceva dhammā no ca saññojanā. Saññojanavippayuttā kho pana dhammā saññojaniyāpi, asaññojaniyāpi. Saññojanagocchakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ganthagocchakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ganthā dhammā, no ganthā dhammā. Ganthaniyā dhammā, aganthaniyā dhammā. Ganthasampayuttā dhammā, ganthavippayuttā dhammā. Ganthā ceva dhammā ganthaniyā ca, ganthaniyā ceva dhammā no ca ganthā ",
      ". Ganthā ceva dhammā ganthasampayuttā ca, ganthasampayuttā ceva dhammā no ca ganthā. Ganthavippayuttā kho pana dhammā ganthaniyāpi, aganthaniyāpi. Ganthagocchakaṃ."
    ],
    "innerText": "Ganthā dhammā, no ganthā dhammā. Ganthaniyā dhammā, aganthaniyā dhammā. Ganthasampayuttā dhammā, ganthavippayuttā dhammā. Ganthā ceva dhammā ganthaniyā ca, ganthaniyā ceva dhammā no ca ganthā . Ganthā ceva dhammā ganthasampayuttā ca, ganthasampayuttā ceva dhammā no ca ganthā. Ganthavippayuttā kho pana dhammā ganthaniyāpi, aganthaniyāpi. Ganthagocchakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Oghagocchakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Oghā ",
      " dhammā, no oghā dhammā. Oghaniyā dhammā, anoghaniyā dhammā. Oghasampayuttā dhammā, oghavippayuttā dhammā. Oghā ceva dhammā oghaniyā ca, oghaniyā ceva dhammā no ca oghā. Oghā ceva dhammā oghasampayuttā ca, oghasampayuttā ceva dhammā no ca oghā. Oghavippayuttā kho pana dhammā oghaniyāpi, anoghaniyāpi. Oghagocchakaṃ."
    ],
    "innerText": "Oghā dhammā, no oghā dhammā. Oghaniyā dhammā, anoghaniyā dhammā. Oghasampayuttā dhammā, oghavippayuttā dhammā. Oghā ceva dhammā oghaniyā ca, oghaniyā ceva dhammā no ca oghā. Oghā ceva dhammā oghasampayuttā ca, oghasampayuttā ceva dhammā no ca oghā. Oghavippayuttā kho pana dhammā oghaniyāpi, anoghaniyāpi. Oghagocchakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Yogagocchakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yogā dhammā, no yogā dhammā. Yoganiyā dhammā, ayoganiyā dhammā. Yogasampayuttā dhammā, yogavippayuttā dhammā. Yogā ceva dhammā yoganiyā ca, yoganiyā ceva dhammā no ca yogā. Yogā ceva dhammā yogasampayuttā ca, yogasampayuttā ceva dhammā no ca yogā. Yogavippayuttā kho pana dhammā yoganiyāpi, ayoganiyāpi. Yogagocchakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nīvaraṇagocchakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nīvaraṇā dhammā, no nīvaraṇā dhammā. Nīvaraṇiyā dhammā, anīvaraṇiyā dhammā. Nīvaraṇasampayuttā dhammā, nīvaraṇavippayuttā dhammā. Nīvaraṇā ceva dhammā nīvaraṇiyā ca, nīvaraṇiyā ceva dhammā no ca nīvaraṇā. Nīvaraṇā ceva dhammā nīvaraṇasampayuttā ca, nīvaraṇasampayuttā ceva dhammā no ca nīvaraṇā. Nīvaraṇavippayuttā kho pana dhammā nīvaraṇiyāpi, anīvaraṇiyāpi. Nīvaraṇagocchakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Parāmāsagocchakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Parāmāsā dhammā, no parāmāsā dhammā. Parāmaṭṭhā dhammā, aparāmaṭṭhā dhammā. Parāmāsasampayuttā dhammā, parāmāsavippayuttā dhammā. Parāmāsā ceva dhammā ",
      " parāmaṭṭhā ca, parāmaṭṭhāceva ",
      " dhammā no ca parāmāsā. Parāmāsavippayuttā kho pana dhammā parāmaṭṭhāpi, aparāmaṭṭhāpi. Parāmāsagocchakaṃ."
    ],
    "innerText": "Parāmāsā dhammā, no parāmāsā dhammā. Parāmaṭṭhā dhammā, aparāmaṭṭhā dhammā. Parāmāsasampayuttā dhammā, parāmāsavippayuttā dhammā. Parāmāsā ceva dhammā parāmaṭṭhā ca, parāmaṭṭhāceva dhammā no ca parāmāsā. Parāmāsavippayuttā kho pana dhammā parāmaṭṭhāpi, aparāmaṭṭhāpi. Parāmāsagocchakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Mahantaradukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sārammaṇā dhammā, anārammaṇā dhammā. Cittā dhammā, no cittā dhammā. Cetasikā dhammā, acetasikā dhammā. Cittasampayuttā dhammā, cittavippayuttā dhammā. Cittasaṃsaṭṭhā dhammā, cittavisaṃsaṭṭhā dhammā. Cittasamuṭṭhānā dhammā, no cittasamuṭṭhānā dhammā. Cittasahabhuno dhammā, no cittasahabhuno dhammā. Cittānuparivattino dhammā, no cittānuparivattino dhammā. Cittasaṃsaṭṭhasamuṭṭhānā dhammā, no cittasaṃsaṭṭhasamuṭṭhānā dhammā. Cittasaṃsaṭṭhasamuṭṭhānasahabhuno dhammā, no cittasaṃsaṭṭhasamuṭṭhānasahabhuno dhammā. Cittasaṃsaṭṭhasamuṭṭhānānuparivattino dhammā, no cittasaṃsaṭṭhasamuṭṭhānānuparivattino dhammā. Ajjhattikā dhammā, bāhirā dhammā. Upādā dhammā, no upādā dhammā. Upādiṇṇā dhammā, anupādiṇṇā dhammā. Mahantaradukaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Upādānagocchakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Upādānā dhammā, no upādānā dhammā. Upādāniyā dhammā, anupādāniyā dhammā. Upādānasampayuttā dhammā, upādānavippayuttā dhammā. Upādānā ceva dhammā upādāniyā ca, upādāniyā ceva dhammā no ca upādānā. Upādānā ceva dhammā upādānasampayuttā ca, upādānasampayuttā ceva dhammā no ca upādānā. Upādānavippayuttā kho pana dhammā upādāniyāpi, anupādāniyāpi. Upādānagocchakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Kilesagocchakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kilesā dhammā, no kilesā dhammā. Saṃkilesikā dhammā, asaṃkilesikā dhammā. Saṃkiliṭṭhā dhammā, asaṃkiliṭṭhā dhammā. Kilesasampayuttā dhammā, kilesavippayuttā dhammā. Kilesā ",
      " ceva dhammā saṃkilesikā ca, saṃkilesikā ceva dhammā no ca kilesā. Kilesā ceva dhammā saṃkiliṭṭhā ca, saṃkiliṭṭhā ceva dhammā no ca kilesā. Kilesā ceva dhammā kilesasampayuttā ",
      " ca, kilesasampayuttā ceva dhammā no ca kilesā. Kilesavippayuttā kho pana dhammā saṃkilesikāpi, asaṃkilesikāpi. Kilesagocchakaṃ."
    ],
    "innerText": "Kilesā dhammā, no kilesā dhammā. Saṃkilesikā dhammā, asaṃkilesikā dhammā. Saṃkiliṭṭhā dhammā, asaṃkiliṭṭhā dhammā. Kilesasampayuttā dhammā, kilesavippayuttā dhammā. Kilesā ceva dhammā saṃkilesikā ca, saṃkilesikā ceva dhammā no ca kilesā. Kilesā ceva dhammā saṃkiliṭṭhā ca, saṃkiliṭṭhā ceva dhammā no ca kilesā. Kilesā ceva dhammā kilesasampayuttā ca, kilesasampayuttā ceva dhammā no ca kilesā. Kilesavippayuttā kho pana dhammā saṃkilesikāpi, asaṃkilesikāpi. Kilesagocchakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Piṭṭhidukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbā dhammā, na dassanena pahātabbā dhammā. Bhāvanāya pahātabbā dhammā, na bhāvanāya pahātabbā dhammā. Dassanena pahātabbahetukā dhammā, na dassanena pahātabbahetukā dhammā. Bhāvanāya pahātabbahetukā dhammā, na bhāvanāya pahātabbahetukā dhammā. Savitakkā dhammā, avitakkā dhammā. Savicārā dhammā, avicārā dhammā. Sappītikā dhammā, appītikā dhammā. Pītisahagatā dhammā, na pītisahagatā dhammā. Sukhasahagatā dhammā, na sukhasahagatā dhammā. Upekkhāsahagatā dhammā, na upekkhāsahagatā dhammā. Kāmāvacarā dhammā, na kāmāvacarā dhammā. Rūpāvacarā dhammā, na rūpāvacarā dhammā. Arūpāvacarā dhammā, na arūpāvacarā dhammā. Pariyāpannā dhammā, apariyāpannā dhammā. Niyyānikā dhammā, aniyyānikā dhammā. Niyatā dhammā, aniyatā dhammā. Sauttarā dhammā, anuttarā dhammā. Saraṇā dhammā, araṇā dhammā. Piṭṭhidukaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhidhammadukamātikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Suttantikadukamātikā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vijjābhāgino dhammā, avijjābhāgino dhammā. Vijjūpamā dhammā, vajirūpamā dhammā. Bālā dhammā, paṇḍitā dhammā. Kaṇhā dhammā ",
      ", sukkā dhammā. Tapanīyā dhammā, atapanīyā dhammā. Adhivacanā dhammā, adhivacanapathā dhammā. Nirutti dhammā, niruttipathā dhammā. Paññatti dhammā, paññattipathā dhammā. Nāmañca, rūpañca. Avijjā ca, bhavataṇhā ca. Bhavadiṭṭhi ca, vibhavadiṭṭhi ca. Sassatadiṭṭhi ca, ucchedadiṭṭhi ca. Antavā diṭṭhi ca, anantavā diṭṭhi ca. Pubbantānudiṭṭhi ca, aparantānudiṭṭhi ca. Ahirikañca, anottappañca. Hirī ca, ottappañca. Dovacassatā ca, pāpamittatā ca. Sovacassatā ca, kalyāṇamittatā ca. Āpattikusalatā ca, āpattivuṭṭhānakusalatā ca. Samāpattikusalatā ca, samāpattivuṭṭhānakusalatā ca. Dhātukusalatā ca, manasikārakusalatā ",
      " ca. Āyatanakusalatā ca, paṭiccasamuppādakusalatā ca. Ṭhānakusalatā ca, aṭṭhānakusalatā ca. Ajjavo ca, maddavo ca. Khanti ca, soraccañca. Sākhalyañca, paṭisanthāro ca. Indriyesu aguttadvāratā ca, bhojane amattaññutā ca. Indriyesu guttadvāratā ca, bhojane mattaññutā ca. Muṭṭhassaccañca, asampajaññañca. Sati ca, sampajaññañca. Paṭisaṅkhānabalañca, bhāvanābalañca. Samatho ca, vipassanā ca. Samathanimittañca, paggāhanimittañca. Paggāho ca, avikkhepo ca. Sīlavipatti ca, diṭṭhivipatti ca. Sīlasampadā ca, diṭṭhisampadā ca. Sīlavisuddhi ca, diṭṭhivisuddhi ca. Diṭṭhivisuddhi kho pana, yathādiṭṭhissa ca padhānaṃ. Saṃvego ca saṃvejaniyesu ṭhānesu, saṃviggassa ca yoniso padhānaṃ. Asantuṭṭhitā ca kusalesu dhammesu, appaṭivānitā ca padhānasmiṃ. Vijjā ca, vimutti ca. Khaye ñāṇaṃ, anuppāde ñāṇanti."
    ],
    "innerText": "Vijjābhāgino dhammā, avijjābhāgino dhammā. Vijjūpamā dhammā, vajirūpamā dhammā. Bālā dhammā, paṇḍitā dhammā. Kaṇhā dhammā , sukkā dhammā. Tapanīyā dhammā, atapanīyā dhammā. Adhivacanā dhammā, adhivacanapathā dhammā. Nirutti dhammā, niruttipathā dhammā. Paññatti dhammā, paññattipathā dhammā. Nāmañca, rūpañca. Avijjā ca, bhavataṇhā ca. Bhavadiṭṭhi ca, vibhavadiṭṭhi ca. Sassatadiṭṭhi ca, ucchedadiṭṭhi ca. Antavā diṭṭhi ca, anantavā diṭṭhi ca. Pubbantānudiṭṭhi ca, aparantānudiṭṭhi ca. Ahirikañca, anottappañca. Hirī ca, ottappañca. Dovacassatā ca, pāpamittatā ca. Sovacassatā ca, kalyāṇamittatā ca. Āpattikusalatā ca, āpattivuṭṭhānakusalatā ca. Samāpattikusalatā ca, samāpattivuṭṭhānakusalatā ca. Dhātukusalatā ca, manasikārakusalatā ca. Āyatanakusalatā ca, paṭiccasamuppādakusalatā ca. Ṭhānakusalatā ca, aṭṭhānakusalatā ca. Ajjavo ca, maddavo ca. Khanti ca, soraccañca. Sākhalyañca, paṭisanthāro ca. Indriyesu aguttadvāratā ca, bhojane amattaññutā ca. Indriyesu guttadvāratā ca, bhojane mattaññutā ca. Muṭṭhassaccañca, asampajaññañca. Sati ca, sampajaññañca. Paṭisaṅkhānabalañca, bhāvanābalañca. Samatho ca, vipassanā ca. Samathanimittañca, paggāhanimittañca. Paggāho ca, avikkhepo ca. Sīlavipatti ca, diṭṭhivipatti ca. Sīlasampadā ca, diṭṭhisampadā ca. Sīlavisuddhi ca, diṭṭhivisuddhi ca. Diṭṭhivisuddhi kho pana, yathādiṭṭhissa ca padhānaṃ. Saṃvego ca saṃvejaniyesu ṭhānesu, saṃviggassa ca yoniso padhānaṃ. Asantuṭṭhitā ca kusalesu dhammesu, appaṭivānitā ca padhānasmiṃ. Vijjā ca, vimutti ca. Khaye ñāṇaṃ, anuppāde ñāṇanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Suttantikadukamātikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhammasaṅgaṇīmātikā niṭṭhitā."
  }
]