[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "11. Ekādasamanayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "11. Saṅgahitenasampayuttavippayuttapadaniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "409"
      },
      ". Samudayasaccena ",
      " ye dhammā… maggasaccena ye dhammā khandhasaṅgahena saṅgahitā āyatanasaṅgahena saṅgahitā dhātusaṅgahena saṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttā? Te dhammā tīhi khandhehi ekenāyatanena sattahi dhātūhi sampayuttā; ekena khandhena ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
    ],
    "innerText": "409. Samudayasaccena ye dhammā… maggasaccena ye dhammā khandhasaṅgahena saṅgahitā āyatanasaṅgahena saṅgahitā dhātusaṅgahena saṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttā? Te dhammā tīhi khandhehi ekenāyatanena sattahi dhātūhi sampayuttā; ekena khandhena ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "410"
      },
      ". Itthindriyena ye dhammā… purisindriyena ye dhammā khandhasaṅgahena saṅgahitā āyatanasaṅgahena saṅgahitā dhātusaṅgahena saṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttāti? Natthi. Katihi vippayuttā? Catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
    ],
    "innerText": "410. Itthindriyena ye dhammā… purisindriyena ye dhammā khandhasaṅgahena saṅgahitā āyatanasaṅgahena saṅgahitā dhātusaṅgahena saṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttāti? Natthi. Katihi vippayuttā? Catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "411"
      },
      ". Sukhindriyena ye dhammā… dukkhindriyena ye dhammā… somanassindriyena ye dhammā… domanassindriyena ye dhammā khandhasaṅgahena saṅgahitā āyatanasaṅgahena saṅgahitā dhātusaṅgahena saṅgahitā…pe… te dhammā tīhi khandhehi ekenāyatanena sattahi dhātūhi sampayuttā; ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena ",
      " khandhena dasahāyatanehi dasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
    ],
    "innerText": "411. Sukhindriyena ye dhammā… dukkhindriyena ye dhammā… somanassindriyena ye dhammā… domanassindriyena ye dhammā khandhasaṅgahena saṅgahitā āyatanasaṅgahena saṅgahitā dhātusaṅgahena saṅgahitā…pe… te dhammā tīhi khandhehi ekenāyatanena sattahi dhātūhi sampayuttā; ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "412"
      },
      ". Upekkhindriyena ",
      " ye dhammā khandhasaṅgahena saṅgahitā āyatanasaṅgahena saṅgahitā dhātusaṅgahena saṅgahitā… te dhammā tīhi ",
      " khandhehi ekenāyatanena dvīhi dhātūhi sampayuttā; ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi pannarasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
    ],
    "innerText": "412. Upekkhindriyena ye dhammā khandhasaṅgahena saṅgahitā āyatanasaṅgahena saṅgahitā dhātusaṅgahena saṅgahitā… te dhammā tīhi khandhehi ekenāyatanena dvīhi dhātūhi sampayuttā; ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi pannarasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "413"
      },
      ". Saddhindriyena ",
      " ye dhammā… vīriyindriyena ye dhammā… satindriyena ye dhammā… samādhindriyena ye dhammā… paññindriyena ye dhammā… anaññātaññassāmītindriyena ye dhammā… aññindriyena ye dhammā… aññātāvindriyena ye dhammā… avijjāya ye dhammā… avijjāpaccayā saṅkhārehi ye dhammā… saḷāyatanapaccayā phassena ye dhammā… vedanāpaccayā taṇhāya ye dhammā… taṇhāpaccayā upādānena ye dhammā… kammabhavena ye dhammā khandhasaṅgahena saṅgahitā āyatanasaṅgahena saṅgahitā dhātusaṅgahena saṅgahitā te dhammā tīhi khandhehi ekenāyatanena sattahi dhātūhi sampayuttā; ekena khandhena ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
    ],
    "innerText": "413. Saddhindriyena ye dhammā… vīriyindriyena ye dhammā… satindriyena ye dhammā… samādhindriyena ye dhammā… paññindriyena ye dhammā… anaññātaññassāmītindriyena ye dhammā… aññindriyena ye dhammā… aññātāvindriyena ye dhammā… avijjāya ye dhammā… avijjāpaccayā saṅkhārehi ye dhammā… saḷāyatanapaccayā phassena ye dhammā… vedanāpaccayā taṇhāya ye dhammā… taṇhāpaccayā upādānena ye dhammā… kammabhavena ye dhammā khandhasaṅgahena saṅgahitā āyatanasaṅgahena saṅgahitā dhātusaṅgahena saṅgahitā te dhammā tīhi khandhehi ekenāyatanena sattahi dhātūhi sampayuttā; ekena khandhena ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "414"
      },
      ". Paridevena ",
      " ye dhammā khandhasaṅgahena saṅgahitā āyatanasaṅgahena saṅgahitā dhātusaṅgahena saṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttāti? Natthi. Katihi vippayuttā? Catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
    ],
    "innerText": "414. Paridevena ye dhammā khandhasaṅgahena saṅgahitā āyatanasaṅgahena saṅgahitā dhātusaṅgahena saṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttāti? Natthi. Katihi vippayuttā? Catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "415"
      },
      ". Sokena ye dhammā… dukkhena ye dhammā… domanassena ye dhammā khandhasaṅgahena saṅgahitā āyatanasaṅgahena saṅgahitā dhātusaṅgahena saṅgahitā… te dhammā tīhi khandhehi ekenāyatanena sattahi dhātūhi sampayuttā; ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
    ],
    "innerText": "415. Sokena ye dhammā… dukkhena ye dhammā… domanassena ye dhammā khandhasaṅgahena saṅgahitā āyatanasaṅgahena saṅgahitā dhātusaṅgahena saṅgahitā… te dhammā tīhi khandhehi ekenāyatanena sattahi dhātūhi sampayuttā; ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "416"
      },
      ". Upāyāsena ye dhammā… satipaṭṭhānena ye dhammā… sammappadhānena ",
      " ye dhammā… appamaññāya ye dhammā… pañcahi indriyehi ye dhammā… pañcahi balehi ye dhammā… sattahi bojjhaṅgehi ",
      " ye dhammā… ariyena aṭṭhaṅgikena maggena ye dhammā… phassena ye dhammā… cetanāya ye dhammā… adhimokkhena ye dhammā… manasikārena ye dhammā… hetūhi dhammehi ye dhammā… hetūhi ceva sahetukehi ca dhammehi ye dhammā… hetūhi ceva hetusampayuttehi ca dhammehi ye dhammā… āsavehi dhammehi ye dhammā… āsavehi ceva sāsavehi ca dhammehi ye dhammā… āsavehi ceva āsavasampayuttehi ",
      " ca dhammehi ye dhammā… saṃyojanehi dhammehi ye dhammā… ganthehi dhammehi ye dhammā… oghehi dhammehi ye dhammā… yogehi dhammehi ye dhammā… nīvaraṇehi dhammehi ye dhammā… parāmāsehi dhammehi ye dhammā… upādānehi dhammehi ye dhammā… kilesehi dhammehi ye dhammā… kilesehi ceva saṃkilesikehi ca dhammehi ye dhammā… kilesehi ceva saṃkiliṭṭhehi ca dhammehi ye dhammā… kilesehi ceva kilesasampayuttehi ca dhammehi ye dhammā khandhasaṅgahena saṅgahitā āyatanasaṅgahena saṅgahitā dhātusaṅgahena saṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttā? Te dhammā tīhi khandhehi ekenāyatanena sattahi dhātūhi sampayuttā; ekena khandhena ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
    ],
    "innerText": "416. Upāyāsena ye dhammā… satipaṭṭhānena ye dhammā… sammappadhānena ye dhammā… appamaññāya ye dhammā… pañcahi indriyehi ye dhammā… pañcahi balehi ye dhammā… sattahi bojjhaṅgehi ye dhammā… ariyena aṭṭhaṅgikena maggena ye dhammā… phassena ye dhammā… cetanāya ye dhammā… adhimokkhena ye dhammā… manasikārena ye dhammā… hetūhi dhammehi ye dhammā… hetūhi ceva sahetukehi ca dhammehi ye dhammā… hetūhi ceva hetusampayuttehi ca dhammehi ye dhammā… āsavehi dhammehi ye dhammā… āsavehi ceva sāsavehi ca dhammehi ye dhammā… āsavehi ceva āsavasampayuttehi ca dhammehi ye dhammā… saṃyojanehi dhammehi ye dhammā… ganthehi dhammehi ye dhammā… oghehi dhammehi ye dhammā… yogehi dhammehi ye dhammā… nīvaraṇehi dhammehi ye dhammā… parāmāsehi dhammehi ye dhammā… upādānehi dhammehi ye dhammā… kilesehi dhammehi ye dhammā… kilesehi ceva saṃkilesikehi ca dhammehi ye dhammā… kilesehi ceva saṃkiliṭṭhehi ca dhammehi ye dhammā… kilesehi ceva kilesasampayuttehi ca dhammehi ye dhammā khandhasaṅgahena saṅgahitā āyatanasaṅgahena saṅgahitā dhātusaṅgahena saṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttā? Te dhammā tīhi khandhehi ekenāyatanena sattahi dhātūhi sampayuttā; ekena khandhena ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dve saccā pannarasindriyā, ekādasa paṭiccapadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uddhaṃ puna ekādasa, gocchakapadamettha tiṃsavidhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṅgahitenasampayuttavippayuttapadaniddeso ekādasamo."
  }
]