[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "13. Terasamanayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "13. Asaṅgahitenasampayuttavippayuttapadaniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "448"
      },
      ". Rūpakkhandhena ",
      " ye dhammā khandhasaṅgahena asaṅgahitā āyatanasaṅgahena asaṅgahitā dhātusaṅgahena asaṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttā? Te dhammā tīhi khandhehi sampayuttā; ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
    ],
    "innerText": "448. Rūpakkhandhena ye dhammā khandhasaṅgahena asaṅgahitā āyatanasaṅgahena asaṅgahitā dhātusaṅgahena asaṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttā? Te dhammā tīhi khandhehi sampayuttā; ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "449"
      },
      ". Dhammāyatanena ye dhammā… dhammadhātuyā ye dhammā… itthindriyena ye dhammā… purisindriyena ye dhammā… jīvitindriyena ye dhammā… viññāṇapaccayā nāmarūpena ye dhammā… asaññābhavena ye dhammā… ekavokārabhavena ye dhammā… jātiyā ye dhammā… jarāya ye dhammā… maraṇena ye dhammā khandhasaṅgahena asaṅgahitā āyatanasaṅgahena asaṅgahitā dhātusaṅgahena asaṅgahitā…pe… te dhammā tīhi khandhehi sampayuttā; ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
    ],
    "innerText": "449. Dhammāyatanena ye dhammā… dhammadhātuyā ye dhammā… itthindriyena ye dhammā… purisindriyena ye dhammā… jīvitindriyena ye dhammā… viññāṇapaccayā nāmarūpena ye dhammā… asaññābhavena ye dhammā… ekavokārabhavena ye dhammā… jātiyā ye dhammā… jarāya ye dhammā… maraṇena ye dhammā khandhasaṅgahena asaṅgahitā āyatanasaṅgahena asaṅgahitā dhātusaṅgahena asaṅgahitā…pe… te dhammā tīhi khandhehi sampayuttā; ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "450"
      },
      ". Arūpabhavena ye dhammā… nevasaññānāsaññābhavena ye dhammā… catuvokārabhavena ye dhammā… iddhipādena ye dhammā khandhasaṅgahena asaṅgahitā āyatanasaṅgahena asaṅgahitā dhātusaṅgahena asaṅgahitā ",
      ", te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttāti ",
      "? Natthi? Katihi vippayuttā? Catūhi ",
      " khandhehi ekenāyatanena sattahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
    ],
    "innerText": "450. Arūpabhavena ye dhammā… nevasaññānāsaññābhavena ye dhammā… catuvokārabhavena ye dhammā… iddhipādena ye dhammā khandhasaṅgahena asaṅgahitā āyatanasaṅgahena asaṅgahitā dhātusaṅgahena asaṅgahitā , te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttāti ? Natthi? Katihi vippayuttā? Catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "451"
      },
      ". Kusalehi dhammehi ye dhammā… akusalehi dhammehi ye dhammā… sukhāya vedanāya sampayuttehi dhammehi ye dhammā… dukkhāya vedanāya sampayuttehi dhammehi ye dhammā… adukkhamasukhāya vedanāya sampayuttehi dhammehi ye dhammā… vipākehi dhammehi ye dhammā… vipākadhammadhammehi ye dhammā… anupādinnaanupādāniyehi ",
      " dhammehi ye dhammā… saṃkiliṭṭhasaṃkilesikehi dhammehi ye dhammā… asaṃkiliṭṭhaasaṃkilesikehi dhammehi ye dhammā… savitakkasavicārehi dhammehi ye dhammā… avitakkavicāramattehi dhammehi ye dhammā… pītisahagatehi dhammehi ye dhammā… sukhasahagatehi dhammehi ye dhammā… upekkhāsahagatehi dhammehi ye dhammā… dassanena pahātabbehi dhammehi ye dhammā… bhāvanāya pahātabbehi dhammehi ye dhammā… dassanena pahātabbahetukehi dhammehi ye dhammā… bhāvanāya pahātabbahetukehi dhammehi ye dhammā… ācayagāmīhi dhammehi ye dhammā… apacayagāmīhi dhammehi ye dhammā… sekkhehi dhammehi ye dhammā… asekkhehi dhammehi ye dhammā… mahaggatehi dhammehi ye dhammā… appamāṇehi dhammehi ye dhammā… parittārammaṇehi dhammehi ye dhammā… mahaggatārammaṇehi dhammehi ye ",
      " dhammā… appamāṇārammaṇehi dhammehi ye dhammā… hīnehi dhammehi ye dhammā… paṇītehi dhammehi ye dhammā… micchattaniyatehi dhammehi ye dhammā… sammattaniyatehi dhammehi ye dhammā… maggārammaṇehi dhammehi ye dhammā… maggahetukehi dhammehi ye dhammā… maggādhipatīhi dhammehi ye dhammā… atītārammaṇehi dhammehi ye dhammā… anāgatārammaṇehi dhammehi ye dhammā… paccuppannārammaṇehi dhammehi ye dhammā… ajjhattārammaṇehi dhammehi ye dhammā… bahiddhārammaṇehi dhammehi ye dhammā… ajjhattabahiddhārammaṇehi dhammehi ye dhammā… sahetukehi dhammehi ye dhammā… hetusampayuttehi dhammehi ye dhammā… sahetukehi ceva na ca hetūhi dhammehi ye dhammā… hetusampayuttehi ceva na ca hetūhi dhammehi ye dhammā… na hetusahetukehi ",
      " dhammehi ye dhammā khandhasaṅgahena asaṅgahitā āyatanasaṅgahena asaṅgahitā dhātusaṅgahena asaṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttāti? Natthi. Katihi vippayuttā? Catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
    ],
    "innerText": "451. Kusalehi dhammehi ye dhammā… akusalehi dhammehi ye dhammā… sukhāya vedanāya sampayuttehi dhammehi ye dhammā… dukkhāya vedanāya sampayuttehi dhammehi ye dhammā… adukkhamasukhāya vedanāya sampayuttehi dhammehi ye dhammā… vipākehi dhammehi ye dhammā… vipākadhammadhammehi ye dhammā… anupādinnaanupādāniyehi dhammehi ye dhammā… saṃkiliṭṭhasaṃkilesikehi dhammehi ye dhammā… asaṃkiliṭṭhaasaṃkilesikehi dhammehi ye dhammā… savitakkasavicārehi dhammehi ye dhammā… avitakkavicāramattehi dhammehi ye dhammā… pītisahagatehi dhammehi ye dhammā… sukhasahagatehi dhammehi ye dhammā… upekkhāsahagatehi dhammehi ye dhammā… dassanena pahātabbehi dhammehi ye dhammā… bhāvanāya pahātabbehi dhammehi ye dhammā… dassanena pahātabbahetukehi dhammehi ye dhammā… bhāvanāya pahātabbahetukehi dhammehi ye dhammā… ācayagāmīhi dhammehi ye dhammā… apacayagāmīhi dhammehi ye dhammā… sekkhehi dhammehi ye dhammā… asekkhehi dhammehi ye dhammā… mahaggatehi dhammehi ye dhammā… appamāṇehi dhammehi ye dhammā… parittārammaṇehi dhammehi ye dhammā… mahaggatārammaṇehi dhammehi ye dhammā… appamāṇārammaṇehi dhammehi ye dhammā… hīnehi dhammehi ye dhammā… paṇītehi dhammehi ye dhammā… micchattaniyatehi dhammehi ye dhammā… sammattaniyatehi dhammehi ye dhammā… maggārammaṇehi dhammehi ye dhammā… maggahetukehi dhammehi ye dhammā… maggādhipatīhi dhammehi ye dhammā… atītārammaṇehi dhammehi ye dhammā… anāgatārammaṇehi dhammehi ye dhammā… paccuppannārammaṇehi dhammehi ye dhammā… ajjhattārammaṇehi dhammehi ye dhammā… bahiddhārammaṇehi dhammehi ye dhammā… ajjhattabahiddhārammaṇehi dhammehi ye dhammā… sahetukehi dhammehi ye dhammā… hetusampayuttehi dhammehi ye dhammā… sahetukehi ceva na ca hetūhi dhammehi ye dhammā… hetusampayuttehi ceva na ca hetūhi dhammehi ye dhammā… na hetusahetukehi dhammehi ye dhammā khandhasaṅgahena asaṅgahitā āyatanasaṅgahena asaṅgahitā dhātusaṅgahena asaṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttāti? Natthi. Katihi vippayuttā? Catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "452"
      },
      ". Rūpīhi dhammehi ye dhammā khandhasaṅgahena asaṅgahitā āyatanasaṅgahena asaṅgahitā dhātusaṅgahena ",
      " asaṅgahitā… te dhammā tīhi khandhehi sampayuttā; ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi ",
      " vippayuttā ",
      "; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
    ],
    "innerText": "452. Rūpīhi dhammehi ye dhammā khandhasaṅgahena asaṅgahitā āyatanasaṅgahena asaṅgahitā dhātusaṅgahena asaṅgahitā… te dhammā tīhi khandhehi sampayuttā; ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā ; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "453"
      },
      ". Arūpīhi dhammehi ye dhammā… lokuttarehi dhammehi ye dhammā… anāsavehi dhammehi ye dhammā… āsavasampayuttehi dhammehi ye dhammā… āsavavippayuttehi ceva no ca āsavehi dhammehi ye dhammā… āsavavippayuttehi anāsavehi dhammehi ye dhammā… asaṃyojaniyehi dhammehi ye dhammā… aganthaniyehi dhammehi ye dhammā… anoghaniyehi dhammehi ye dhammā… ayoganiyehi dhammehi ye dhammā… anīvaraṇiyehi dhammehi ye dhammā… aparāmaṭṭhehi dhammehi ye dhammā… parāmāsasampayuttehi dhammehi ye dhammā… parāmāsavippayuttehi aparāmaṭṭhehi dhammehi ye dhammā… sārammaṇehi dhammehi ye dhammā khandhasaṅgahena asaṅgahitā āyatanasaṅgahena asaṅgahitā dhātusaṅgahena asaṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttāti? Natthi. Katihi vippayuttā? Catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
    ],
    "innerText": "453. Arūpīhi dhammehi ye dhammā… lokuttarehi dhammehi ye dhammā… anāsavehi dhammehi ye dhammā… āsavasampayuttehi dhammehi ye dhammā… āsavavippayuttehi ceva no ca āsavehi dhammehi ye dhammā… āsavavippayuttehi anāsavehi dhammehi ye dhammā… asaṃyojaniyehi dhammehi ye dhammā… aganthaniyehi dhammehi ye dhammā… anoghaniyehi dhammehi ye dhammā… ayoganiyehi dhammehi ye dhammā… anīvaraṇiyehi dhammehi ye dhammā… aparāmaṭṭhehi dhammehi ye dhammā… parāmāsasampayuttehi dhammehi ye dhammā… parāmāsavippayuttehi aparāmaṭṭhehi dhammehi ye dhammā… sārammaṇehi dhammehi ye dhammā khandhasaṅgahena asaṅgahitā āyatanasaṅgahena asaṅgahitā dhātusaṅgahena asaṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttāti? Natthi. Katihi vippayuttā? Catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "454"
      },
      ". Anārammaṇehi dhammehi ye dhammā… no cittehi dhammehi ye dhammā… cittavippayuttehi dhammehi ye dhammā ",
      "… cittavisaṃsaṭṭhehi dhammehi ye dhammā… cittasamuṭṭhānehi dhammehi ye dhammā… cittasahabhūhi dhammehi ye dhammā… cittānuparivattīhi dhammehi ye dhammā… bāhirehi dhammehi ye dhammā… upādādhammehi ye dhammā khandhasaṅgahena asaṅgahitā āyatanasaṅgahena asaṅgahitā dhātusaṅgena asaṅgahitā, te dhammā katihi khandhehi ",
      " katihāyatanehi katihi dhātūhi sampayuttā? Te dhammā tīhi khandhehi sampayuttā; ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
    ],
    "innerText": "454. Anārammaṇehi dhammehi ye dhammā… no cittehi dhammehi ye dhammā… cittavippayuttehi dhammehi ye dhammā … cittavisaṃsaṭṭhehi dhammehi ye dhammā… cittasamuṭṭhānehi dhammehi ye dhammā… cittasahabhūhi dhammehi ye dhammā… cittānuparivattīhi dhammehi ye dhammā… bāhirehi dhammehi ye dhammā… upādādhammehi ye dhammā khandhasaṅgahena asaṅgahitā āyatanasaṅgahena asaṅgahitā dhātusaṅgena asaṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttā? Te dhammā tīhi khandhehi sampayuttā; ekenāyatanena ekāya dhātuyā kehici sampayuttā. Katihi vippayuttā? Ekena khandhena dasahāyatanehi dasahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "455"
      },
      ". Anupādāniyehi dhammehi ye dhammā… upādānasampayuttehi dhammehi ye dhammā… upādānasampayuttehi ceva no ca upādānehi dhammehi ye dhammā… upādānavippayuttehi anupādāniyehi dhammehi ye dhammā… asaṃkilesikehi dhammehi ye dhammā… asaṃkiliṭṭhehi dhammehi ye dhammā… kilesasampayuttehi dhammehi ye dhammā… saṃkiliṭṭhehi ceva no ca kilesehi ",
      " dhammehi ye dhammā… kilesasampayuttehi ceva no ca kilesehi dhammehi ye dhammā… kilesavippayuttehi asaṃkilesikehi dhammehi ye dhammā… dassanena pahātabbehi dhammehi ye dhammā… bhāvanāya pahātabbehi dhammehi ye dhammā… dassanena pahātabbahetukehi dhammehi ye dhammā… bhāvanāya pahātabbahetukehi dhammehi ye dhammā… savitakkehi dhammehi ye dhammā… savicārehi dhammehi ye dhammā… sappītikehi dhammehi ye dhammā… pītisahagatehi dhammehi ye dhammā… sukhasahagatehi dhammehi ye dhammā… upekkhāsahagatehi dhammehi ye dhammā… na kāmāvacarehi dhammehi ye dhammā… rūpāvacarehi dhammehi ye dhammā… arūpāvacarehi dhammehi ye dhammā… apariyāpannehi dhammehi ye dhammā… niyyānikehi dhammehi ye dhammā ",
      "… niyatehi dhammehi ye dhammā… anuttarehi dhammehi ye dhammā… saraṇehi dhammehi ye dhammā khandhasaṅgahena asaṅgahitā āyatanasaṅgahena asaṅgahitā dhātusaṅgahena asaṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttāti? Natthi. Katihi ",
      " vippayuttā? Catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
    ],
    "innerText": "455. Anupādāniyehi dhammehi ye dhammā… upādānasampayuttehi dhammehi ye dhammā… upādānasampayuttehi ceva no ca upādānehi dhammehi ye dhammā… upādānavippayuttehi anupādāniyehi dhammehi ye dhammā… asaṃkilesikehi dhammehi ye dhammā… asaṃkiliṭṭhehi dhammehi ye dhammā… kilesasampayuttehi dhammehi ye dhammā… saṃkiliṭṭhehi ceva no ca kilesehi dhammehi ye dhammā… kilesasampayuttehi ceva no ca kilesehi dhammehi ye dhammā… kilesavippayuttehi asaṃkilesikehi dhammehi ye dhammā… dassanena pahātabbehi dhammehi ye dhammā… bhāvanāya pahātabbehi dhammehi ye dhammā… dassanena pahātabbahetukehi dhammehi ye dhammā… bhāvanāya pahātabbahetukehi dhammehi ye dhammā… savitakkehi dhammehi ye dhammā… savicārehi dhammehi ye dhammā… sappītikehi dhammehi ye dhammā… pītisahagatehi dhammehi ye dhammā… sukhasahagatehi dhammehi ye dhammā… upekkhāsahagatehi dhammehi ye dhammā… na kāmāvacarehi dhammehi ye dhammā… rūpāvacarehi dhammehi ye dhammā… arūpāvacarehi dhammehi ye dhammā… apariyāpannehi dhammehi ye dhammā… niyyānikehi dhammehi ye dhammā … niyatehi dhammehi ye dhammā… anuttarehi dhammehi ye dhammā… saraṇehi dhammehi ye dhammā khandhasaṅgahena asaṅgahitā āyatanasaṅgahena asaṅgahitā dhātusaṅgahena asaṅgahitā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi sampayuttāti? Natthi. Katihi vippayuttā? Catūhi khandhehi ekenāyatanena sattahi dhātūhi vippayuttā; ekenāyatanena ekāya dhātuyā kehici vippayuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Rūpañca dhammāyatanaṃ dhammadhātu, itthipumaṃ jīvitaṃ nāmarūpaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dve bhavā jātijarā maccurūpaṃ, anārammaṇaṃ no cittaṃ cittena vippayuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Visaṃsaṭṭhaṃ samuṭṭhānasahabhu, anuparivatti bāhiraṃ upādā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dve visayo esanayo subuddhoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Asaṅgahitenasampayuttavippayuttapadaniddeso terasamo."
  }
]