[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Dhammapaccanīyānulome tikadukapaṭṭhānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-1. Kusalattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Nakusalaṃ ",
      " nahetuṃ dhammaṃ paṭicca akusalo hetu dhammo uppajjati hetupaccayā. Nakusalaṃ nahetuṃ dhammaṃ paṭicca abyākato hetu dhammo uppajjati hetupaccayā. (2)"
    ],
    "innerText": "1. Nakusalaṃ nahetuṃ dhammaṃ paṭicca akusalo hetu dhammo uppajjati hetupaccayā. Nakusalaṃ nahetuṃ dhammaṃ paṭicca abyākato hetu dhammo uppajjati hetupaccayā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naakusalaṃ nahetuṃ dhammaṃ paṭicca kusalo hetu dhammo uppajjati hetupaccayā. Naakusalaṃ nahetuṃ dhammaṃ paṭicca abyākato hetu dhammo uppajjati hetupaccayā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naabyākataṃ nahetuṃ dhammaṃ paṭicca kusalo hetu dhammo uppajjati hetupaccayā. Naabyākataṃ nahetuṃ dhammaṃ paṭicca akusalo hetu dhammo uppajjati hetupaccayā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ nahetuñca naabyākataṃ nahetuñca dhammaṃ paṭicca akusalo hetu dhammo uppajjati hetupaccayā. Naakusalaṃ nahetuñca naabyākataṃ nahetuñca dhammaṃ paṭicca kusalo hetu dhammo uppajjati hetupaccayā. Nakusalaṃ nahetuñca naakusalaṃ nahetuñca dhammaṃ paṭicca abyākato hetu dhammo uppajjati hetupaccayā. Tīṇi. (Saṃkhittaṃ.) Hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Nakusalaṃ nanahetuṃ dhammaṃ paṭicca akusalo nahetu dhammo uppajjati hetupaccayā. Nakusalaṃ nanahetuṃ dhammaṃ paṭicca abyākato nahetu dhammo ",
      " uppajjati hetupaccayā. Nakusalaṃ nanahetuṃ ",
      " dhammaṃ paṭicca akusalo nahetu ca abyākato nahetu ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "2. Nakusalaṃ nanahetuṃ dhammaṃ paṭicca akusalo nahetu dhammo uppajjati hetupaccayā. Nakusalaṃ nanahetuṃ dhammaṃ paṭicca abyākato nahetu dhammo uppajjati hetupaccayā. Nakusalaṃ nanahetuṃ dhammaṃ paṭicca akusalo nahetu ca abyākato nahetu ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naakusalaṃ nanahetuṃ dhammaṃ paṭicca kusalo nahetu dhammo uppajjati hetupaccayā. Naakusalaṃ nanahetuṃ dhammaṃ paṭicca abyākato nahetu dhammo uppajjati hetupaccayā. Naakusalaṃ nanahetuṃ dhammaṃ paṭicca kusalo nahetu ca abyākato nahetu ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naabyākataṃ nanahetuṃ dhammaṃ paṭicca abyākato nahetu dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ nanahetuñca naabyākataṃ nanahetuñca dhammaṃ paṭicca akusalo nahetu dhammo uppajjati hetupaccayā… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naakusalaṃ nanahetuñca naabyākataṃ nanahetuñca dhammaṃ paṭicca kusalo nahetu dhammo uppajjati hetupaccayā… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ nanahetuñca naakusalaṃ nanahetuñca dhammaṃ paṭicca abyākato nahetu dhammo uppajjati hetupaccayā. Ekaṃ… hetuyā aṭṭhārasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-2. Kusalattika-sahetukadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Nakusalaṃ nasahetukaṃ dhammaṃ paṭicca akusalo sahetuko dhammo uppajjati hetupaccayā. Nakusalaṃ nasahetukaṃ dhammaṃ paṭicca abyākato sahetuko dhammo uppajjati hetupaccayā. Naakusalaṃ nasahetukaṃ dhammaṃ paṭicca abyākato sahetuko dhammo uppajjati hetupaccayā. Naabyākataṃ nasahetukaṃ dhammaṃ paṭicca akusalo sahetuko dhammo uppajjati hetupaccayā. Nakusalaṃ nasahetukañca naabyākataṃ nasahetukañca dhammaṃ paṭicca akusalo sahetuko dhammo uppajjati hetupaccayā. Nakusalaṃ nasahetukañca naakusalaṃ nasahetukañca dhammaṃ paṭicca abyākato sahetuko dhammo uppajjati hetupaccayā. Hetuyā ",
      " cha."
    ],
    "innerText": "3. Nakusalaṃ nasahetukaṃ dhammaṃ paṭicca akusalo sahetuko dhammo uppajjati hetupaccayā. Nakusalaṃ nasahetukaṃ dhammaṃ paṭicca abyākato sahetuko dhammo uppajjati hetupaccayā. Naakusalaṃ nasahetukaṃ dhammaṃ paṭicca abyākato sahetuko dhammo uppajjati hetupaccayā. Naabyākataṃ nasahetukaṃ dhammaṃ paṭicca akusalo sahetuko dhammo uppajjati hetupaccayā. Nakusalaṃ nasahetukañca naabyākataṃ nasahetukañca dhammaṃ paṭicca akusalo sahetuko dhammo uppajjati hetupaccayā. Nakusalaṃ nasahetukañca naakusalaṃ nasahetukañca dhammaṃ paṭicca abyākato sahetuko dhammo uppajjati hetupaccayā. Hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Nakusalaṃ naahetukaṃ dhammaṃ paṭicca abyākato ahetuko dhammo uppajjati hetupaccayā. Naakusalaṃ naahetukaṃ dhammaṃ paṭicca abyākato ahetuko dhammo uppajjati hetupaccayā ",
      ". Naabyākataṃ ",
      " naahetukaṃ dhammaṃ paṭicca abyākato ahetuko dhammo uppajjati hetupaccayā. Nakusalaṃ naahetukañca naabyākataṃ naahetukañca dhammaṃ paṭicca abyākato ahetuko dhammo uppajjati hetupaccayā. Naakusalaṃ naahetukañca naabyākataṃ naahetukañca dhammaṃ paṭicca abyākato ahetuko dhammo uppajjati hetupaccayā. Nakusalaṃ naahetukañca naakusalaṃ naahetukañca dhammaṃ paṭicca abyākato ahetuko dhammo uppajjati hetupaccayā. Hetuyā cha."
    ],
    "innerText": "4. Nakusalaṃ naahetukaṃ dhammaṃ paṭicca abyākato ahetuko dhammo uppajjati hetupaccayā. Naakusalaṃ naahetukaṃ dhammaṃ paṭicca abyākato ahetuko dhammo uppajjati hetupaccayā . Naabyākataṃ naahetukaṃ dhammaṃ paṭicca abyākato ahetuko dhammo uppajjati hetupaccayā. Nakusalaṃ naahetukañca naabyākataṃ naahetukañca dhammaṃ paṭicca abyākato ahetuko dhammo uppajjati hetupaccayā. Naakusalaṃ naahetukañca naabyākataṃ naahetukañca dhammaṃ paṭicca abyākato ahetuko dhammo uppajjati hetupaccayā. Nakusalaṃ naahetukañca naakusalaṃ naahetukañca dhammaṃ paṭicca abyākato ahetuko dhammo uppajjati hetupaccayā. Hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-3. Kusalattika-hetusampayuttadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". Nakusalaṃ nahetusampayuttaṃ dhammaṃ paṭicca akusalo hetusampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nahetusampayuttaṃ dhammaṃ paṭicca abyākato hetusampayutto dhammo uppajjati hetupaccayā. Naakusalaṃ nahetusampayuttaṃ dhammaṃ paṭicca abyākato hetusampayutto dhammo uppajjati hetupaccayā… cha. (Sahetukasadisaṃ.)"
    ],
    "innerText": "5. Nakusalaṃ nahetusampayuttaṃ dhammaṃ paṭicca akusalo hetusampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nahetusampayuttaṃ dhammaṃ paṭicca abyākato hetusampayutto dhammo uppajjati hetupaccayā. Naakusalaṃ nahetusampayuttaṃ dhammaṃ paṭicca abyākato hetusampayutto dhammo uppajjati hetupaccayā… cha. (Sahetukasadisaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nakusalaṃ ",
      " nahetuvippayuttaṃ dhammaṃ paṭicca abyākato hetuvippayutto dhammo uppajjati hetupaccayā… cha. (Ahetukasadisaṃ, saṃkhittaṃ.)"
    ],
    "innerText": "Nakusalaṃ nahetuvippayuttaṃ dhammaṃ paṭicca abyākato hetuvippayutto dhammo uppajjati hetupaccayā… cha. (Ahetukasadisaṃ, saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-4-6. Kusalattika-hetusahetukādidukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". Nakusalaṃ nahetuñceva naahetukañca dhammaṃ paṭicca akusalo hetu ceva sahetuko ca dhammo uppajjati hetupaccayā. Nakusalaṃ nahetuñceva naahetukañca dhammaṃ paṭicca abyākato hetu ceva sahetuko ca dhammo uppajjati hetupaccayā. Dve."
    ],
    "innerText": "6. Nakusalaṃ nahetuñceva naahetukañca dhammaṃ paṭicca akusalo hetu ceva sahetuko ca dhammo uppajjati hetupaccayā. Nakusalaṃ nahetuñceva naahetukañca dhammaṃ paṭicca abyākato hetu ceva sahetuko ca dhammo uppajjati hetupaccayā. Dve."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Naakusale dve, naabyākate dve. Paṭhamaṃ gaṇitakena ekaṃ, dutiyaṃ gaṇitakena ekaṃ, tatiyaṃ gaṇitakena ekaṃ, sabbattha nava pañhā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ naahetukañceva na ca hetuṃ dhammaṃ paṭicca akusalo sahetuko ceva na ca hetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". Nakusalaṃ ",
      " nahetuñceva nahetuvippayuttañca dhammaṃ paṭicca akusalo hetu ceva hetusampayutto ca dhammo uppajjati hetupaccayā… hetuyā nava."
    ],
    "innerText": "7. Nakusalaṃ nahetuñceva nahetuvippayuttañca dhammaṃ paṭicca akusalo hetu ceva hetusampayutto ca dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nakusalaṃ ",
      " nahetuvippayuttañceva nanahetuñca dhammaṃ paṭicca akusalo hetusampayutto ceva na ca hetu dhammo uppajjati hetupaccayā… hetuyā nava."
    ],
    "innerText": "Nakusalaṃ nahetuvippayuttañceva nanahetuñca dhammaṃ paṭicca akusalo hetusampayutto ceva na ca hetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ". Nakusalaṃ ",
      " nahetuṃ nasahetukaṃ dhammaṃ paṭicca abyākato nahetu sahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "8. Nakusalaṃ nahetuṃ nasahetukaṃ dhammaṃ paṭicca abyākato nahetu sahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ". Nakusalaṃ nahetuṃ naahetukaṃ dhammaṃ paṭicca akusalo nahetu ahetuko dhammo uppajjati hetupaccayā. (1)"
    ],
    "innerText": "9. Nakusalaṃ nahetuṃ naahetukaṃ dhammaṃ paṭicca akusalo nahetu ahetuko dhammo uppajjati hetupaccayā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naakusalaṃ nahetuṃ naahetukaṃ dhammaṃ paṭicca abyākato nahetu ahetuko dhammo uppajjati hetupaccayā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naabyākataṃ nahetuṃ naahetukaṃ dhammaṃ paṭicca abyākato nahetu ahetuko dhammo uppajjati hetupaccayā. (1) (Gaṇitakena tīṇi pañhā.)… Hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-7-13. Kusalattika-cūḷantaradukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ". Nakusalo nasappaccayo dhammo kusalassa sappaccayassa dhammassa ārammaṇapaccayena paccayo… ārammaṇe cha. (Saṅkhataṃ sappaccayasadisaṃ.)"
    ],
    "innerText": "10. Nakusalo nasappaccayo dhammo kusalassa sappaccayassa dhammassa ārammaṇapaccayena paccayo… ārammaṇe cha. (Saṅkhataṃ sappaccayasadisaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". Nakusalaṃ nasanidassanaṃ dhammaṃ paṭicca abyākato sanidassano dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "11. Nakusalaṃ nasanidassanaṃ dhammaṃ paṭicca abyākato sanidassano dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalo naanidassano dhammo kusalassa anidassanassa dhammassa ārammaṇapaccayena paccayo. (Nava pañhā kātabbā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ". Nakusalaṃ ",
      " nasappaṭighaṃ dhammaṃ paṭicca abyākato sappaṭigho dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "12. Nakusalaṃ nasappaṭighaṃ dhammaṃ paṭicca abyākato sappaṭigho dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nakusalaṃ ",
      " naappaṭighaṃ dhammaṃ paṭicca abyākato appaṭigho dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "Nakusalaṃ naappaṭighaṃ dhammaṃ paṭicca abyākato appaṭigho dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". Nakusalaṃ narūpiṃ dhammaṃ paṭicca abyākato rūpī dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "13. Nakusalaṃ narūpiṃ dhammaṃ paṭicca abyākato rūpī dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nakusalaṃ ",
      " naarūpiṃ dhammaṃ paṭicca abyākato arūpī dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "Nakusalaṃ naarūpiṃ dhammaṃ paṭicca abyākato arūpī dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Nakusalaṃ nalokiyaṃ dhammaṃ paṭicca abyākato lokiyo dhammo uppajjati hetupaccayā… hetuyā pañca."
    ],
    "innerText": "14. Nakusalaṃ nalokiyaṃ dhammaṃ paṭicca abyākato lokiyo dhammo uppajjati hetupaccayā… hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nakusalaṃ nalokuttaraṃ dhammaṃ paccayā kusalo lokuttaro dhammo uppajjati hetupaccayā. Nakusalaṃ nalokuttaraṃ dhammaṃ paccayā abyākato lokuttaro dhammo uppajjati hetupaccayā. (Cha ",
      " pañhā kātabbā.)"
    ],
    "innerText": "Nakusalaṃ nalokuttaraṃ dhammaṃ paccayā kusalo lokuttaro dhammo uppajjati hetupaccayā. Nakusalaṃ nalokuttaraṃ dhammaṃ paccayā abyākato lokuttaro dhammo uppajjati hetupaccayā. (Cha pañhā kātabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". Nakusalaṃ nakenaci viññeyyaṃ dhammaṃ paṭicca akusalo kenaci viññeyyo dhammo uppajjati hetupaccayā… hetuyā aṭṭhārasa."
    ],
    "innerText": "15. Nakusalaṃ nakenaci viññeyyaṃ dhammaṃ paṭicca akusalo kenaci viññeyyo dhammo uppajjati hetupaccayā… hetuyā aṭṭhārasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ nakenaci naviññeyyaṃ dhammaṃ paṭicca akusalo kenaci viññeyyo dhammo uppajjati hetupaccayā… hetuyā aṭṭhārasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-14. Kusalattika-āsavagocchakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". Nakusalaṃ noāsavaṃ dhammaṃ paṭicca akusalo āsavo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "16. Nakusalaṃ noāsavaṃ dhammaṃ paṭicca akusalo āsavo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ nanoāsavaṃ dhammaṃ paṭicca akusalo noāsavo dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ". Nakusalaṃ ",
      " nasāsavaṃ dhammaṃ paṭicca abyākato sāsavo dhammo uppajjati hetupaccayā… hetuyā pañca."
    ],
    "innerText": "17. Nakusalaṃ nasāsavaṃ dhammaṃ paṭicca abyākato sāsavo dhammo uppajjati hetupaccayā… hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ naanāsavaṃ dhammaṃ paccayā kusalo anāsavo dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.) Hetuyā cha…pe… vipāke tīṇi…pe… avigate cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". Nakusalaṃ ",
      " naāsavasampayuttaṃ dhammaṃ paṭicca akusalo āsavasampayutto dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "18. Nakusalaṃ naāsavasampayuttaṃ dhammaṃ paṭicca akusalo āsavasampayutto dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ naāsavavippayuttaṃ dhammaṃ paṭicca akusalo āsavavippayutto dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ". Nakusalaṃ ",
      " naāsavañceva naanāsavañca dhammaṃ paṭicca akusalo āsavo ceva sāsavo ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "19. Nakusalaṃ naāsavañceva naanāsavañca dhammaṃ paṭicca akusalo āsavo ceva sāsavo ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ naanāsavañceva nano ca āsavaṃ dhammaṃ paṭicca akusalo sāsavo ceva no ca āsavo dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". Nakusalaṃ naāsavañceva naāsavavippayuttañca dhammaṃ paṭicca akusalo āsavo ceva āsavasampayutto ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "20. Nakusalaṃ naāsavañceva naāsavavippayuttañca dhammaṃ paṭicca akusalo āsavo ceva āsavasampayutto ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nakusalaṃ naāsavavippayuttañceva nano ca āsavaṃ dhammaṃ paṭicca akusalo ",
      " āsavasampayutto ceva no ca āsavo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "Nakusalaṃ naāsavavippayuttañceva nano ca āsavaṃ dhammaṃ paṭicca akusalo āsavasampayutto ceva no ca āsavo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". Nakusalaṃ āsavavippayuttaṃ nasāsavaṃ dhammaṃ paṭicca abyākato āsavavippayutto sāsavo dhammo uppajjati hetupaccayā… hetuyā pañca."
    ],
    "innerText": "21. Nakusalaṃ āsavavippayuttaṃ nasāsavaṃ dhammaṃ paṭicca abyākato āsavavippayutto sāsavo dhammo uppajjati hetupaccayā… hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-20-54. Kusalattika-saññojanādigocchakāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". Nakusalaṃ nosaññojanaṃ dhammaṃ paṭicca akusalo saññojano dhammo uppajjati hetupaccayā."
    ],
    "innerText": "22. Nakusalaṃ nosaññojanaṃ dhammaṃ paṭicca akusalo saññojano dhammo uppajjati hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". Nakusalaṃ ",
      " noganthaṃ dhammaṃ paṭicca akusalo gantho dhammo uppajjati hetupaccayā."
    ],
    "innerText": "23. Nakusalaṃ noganthaṃ dhammaṃ paṭicca akusalo gantho dhammo uppajjati hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ". Nakusalaṃ nooghaṃ dhammaṃ paṭicca akusalo ogho dhammo uppajjati hetupaccayā."
    ],
    "innerText": "24. Nakusalaṃ nooghaṃ dhammaṃ paṭicca akusalo ogho dhammo uppajjati hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". Nakusalaṃ noyogaṃ dhammaṃ paṭicca akusalo yogo dhammo uppajjati hetupaccayā."
    ],
    "innerText": "25. Nakusalaṃ noyogaṃ dhammaṃ paṭicca akusalo yogo dhammo uppajjati hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". Nakusalaṃ nonīvaraṇaṃ dhammaṃ paṭicca akusalo nīvaraṇo dhammo uppajjati hetupaccayā."
    ],
    "innerText": "26. Nakusalaṃ nonīvaraṇaṃ dhammaṃ paṭicca akusalo nīvaraṇo dhammo uppajjati hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      ". Nakusalaṃ ",
      " noparāmāsaṃ dhammaṃ paṭicca akusalo parāmāso dhammo uppajjati hetupaccayā."
    ],
    "innerText": "27. Nakusalaṃ noparāmāsaṃ dhammaṃ paṭicca akusalo parāmāso dhammo uppajjati hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-55-92. Kusalattika-mahantaradukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      ". Nakusalaṃ nasārammaṇaṃ dhammaṃ paṭicca abyākato sārammaṇo dhammo uppajjati hetupaccayā…pe…."
    ],
    "innerText": "28. Nakusalaṃ nasārammaṇaṃ dhammaṃ paṭicca abyākato sārammaṇo dhammo uppajjati hetupaccayā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-93. Kusalattika-kāmāvacaradukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "29"
      },
      ". Nakusalaṃ ",
      " nakāmāvacaraṃ dhammaṃ paṭicca abyākato kāmāvacaro dhammo uppajjati hetupaccayā… hetuyā pañca."
    ],
    "innerText": "29. Nakusalaṃ nakāmāvacaraṃ dhammaṃ paṭicca abyākato kāmāvacaro dhammo uppajjati hetupaccayā… hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ nanakāmāvacaraṃ dhammaṃ paṭicca abyākato nakāmāvacaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-94. Kusalattika-rūpāvacaradukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ". Nakusalaṃ narūpāvacaraṃ dhammaṃ paṭicca abyākato rūpāvacaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "30. Nakusalaṃ narūpāvacaraṃ dhammaṃ paṭicca abyākato rūpāvacaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ nanarūpāvacaraṃ dhammaṃ paṭicca abyākato narūpāvacaro dhammo uppajjati hetupaccayā… hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-95. Kusalattika-arūpāvacaradukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ". Nakusalaṃ ",
      " naarūpāvacaraṃ dhammaṃ paccayā kusalo arūpāvacaro dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "31. Nakusalaṃ naarūpāvacaraṃ dhammaṃ paccayā kusalo arūpāvacaro dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nakusalaṃ nanaarūpāvacaraṃ dhammaṃ paṭicca abyākato naarūpāvacaro dhammo uppajjati hetupaccayā… hetuyā ",
      " pañca."
    ],
    "innerText": "Nakusalaṃ nanaarūpāvacaraṃ dhammaṃ paṭicca abyākato naarūpāvacaro dhammo uppajjati hetupaccayā… hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-96. Kusalattika-pariyāpannadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "32"
      },
      ". Nakusalaṃ napariyāpannaṃ dhammaṃ paṭicca abyākato pariyāpanno dhammo uppajjati hetupaccayā. Naakusalaṃ napariyāpannaṃ dhammaṃ paṭicca abyākato pariyāpanno dhammo uppajjati hetupaccayā. Naabyākataṃ napariyāpannaṃ dhammaṃ paṭicca abyākato pariyāpanno dhammo uppajjati hetupaccayā… hetuyā pañca."
    ],
    "innerText": "32. Nakusalaṃ napariyāpannaṃ dhammaṃ paṭicca abyākato pariyāpanno dhammo uppajjati hetupaccayā. Naakusalaṃ napariyāpannaṃ dhammaṃ paṭicca abyākato pariyāpanno dhammo uppajjati hetupaccayā. Naabyākataṃ napariyāpannaṃ dhammaṃ paṭicca abyākato pariyāpanno dhammo uppajjati hetupaccayā… hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nakusalaṃ ",
      " naapariyāpannaṃ dhammaṃ paccayā kusalo apariyāpanno dhammo uppajjati hetupaccayā. Nakusalaṃ naapariyāpannaṃ dhammaṃ paccayā abyākato apariyāpanno dhammo uppajjati hetupaccayā. Dve. (Akusalamūle dve, dukamūle dve.)… Hetuyā cha."
    ],
    "innerText": "Nakusalaṃ naapariyāpannaṃ dhammaṃ paccayā kusalo apariyāpanno dhammo uppajjati hetupaccayā. Nakusalaṃ naapariyāpannaṃ dhammaṃ paccayā abyākato apariyāpanno dhammo uppajjati hetupaccayā. Dve. (Akusalamūle dve, dukamūle dve.)… Hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-97. Kusalattika-niyyānikadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "33"
      },
      ". Nakusalaṃ naniyyānikaṃ dhammaṃ paccayā kusalo niyyāniko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "33. Nakusalaṃ naniyyānikaṃ dhammaṃ paccayā kusalo niyyāniko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ naaniyyānikaṃ dhammaṃ paṭicca abyākato aniyyāniko dhammo uppajjati hetupaccayā. Naabyākataṃ naaniyyānikaṃ dhammaṃ paṭicca abyākato aniyyāniko dhammo uppajjati hetupaccayā. Naakusalaṃ naaniyyānikañca naabyākataṃ naaniyyānikañca dhammaṃ paṭicca abyākato aniyyāniko dhammo uppajjati hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-98. Kusalattika-niyatadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "34"
      },
      ". Nakusalaṃ ",
      " naniyataṃ dhammaṃ paccayā kusalo niyato dhammo uppajjati hetupaccayā… (apariyāpannasadisaṃ cha pañhā)."
    ],
    "innerText": "34. Nakusalaṃ naniyataṃ dhammaṃ paccayā kusalo niyato dhammo uppajjati hetupaccayā… (apariyāpannasadisaṃ cha pañhā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ naaniyataṃ dhammaṃ paṭicca abyākato aniyato dhammo uppajjati hetupaccayā. Naakusalaṃ naaniyataṃ dhammaṃ paṭicca abyākato aniyato dhammo uppajjati hetupaccayā. Naabyākataṃ naaniyataṃ dhammaṃ paṭicca abyākato aniyato dhammo uppajjati hetupaccayā. Nakusalaṃ naaniyatañca naabyākataṃ naaniyatañca dhammaṃ paṭicca abyākato aniyato dhammo uppajjati hetupaccayā. Naakusalaṃ naaniyatañca naabyākataṃ naaniyatañca dhammaṃ paṭicca abyākato aniyato dhammo uppajjati hetupaccayā. Hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-99. Kusalattika-sauttaradukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ". Nakusalaṃ nasauttaraṃ dhammaṃ paṭicca abyākato sauttaro dhammo uppajjati hetupaccayā. Naakusalaṃ nasauttaraṃ dhammaṃ paṭicca abyākato sauttaro dhammo uppajjati hetupaccayā. Naabyākataṃ nasauttaraṃ dhammaṃ paṭicca ",
      " abyākato sauttaro dhammo uppajjati hetupaccayā. Naakusalaṃ nasauttarañca naabyākataṃ nasauttarañca dhammaṃ paṭicca abyākato sauttaro dhammo uppajjati hetupaccayā. Nakusalaṃ nasauttarañca naakusalaṃ nasauttarañca dhammaṃ paṭicca abyākato sauttaro dhammo uppajjati hetupaccayā. Hetuyā pañca."
    ],
    "innerText": "35. Nakusalaṃ nasauttaraṃ dhammaṃ paṭicca abyākato sauttaro dhammo uppajjati hetupaccayā. Naakusalaṃ nasauttaraṃ dhammaṃ paṭicca abyākato sauttaro dhammo uppajjati hetupaccayā. Naabyākataṃ nasauttaraṃ dhammaṃ paṭicca abyākato sauttaro dhammo uppajjati hetupaccayā. Naakusalaṃ nasauttarañca naabyākataṃ nasauttarañca dhammaṃ paṭicca abyākato sauttaro dhammo uppajjati hetupaccayā. Nakusalaṃ nasauttarañca naakusalaṃ nasauttarañca dhammaṃ paṭicca abyākato sauttaro dhammo uppajjati hetupaccayā. Hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ naanuttaraṃ dhammaṃ paccayā kusalo anuttaro dhammo uppajjati hetupaccayā… (saṃkhittaṃ.) Hetuyā cha…pe… vipāke tīṇi…pe… avigate cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-100. Kusalattika-saraṇadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ". Nakusalaṃ nasaraṇaṃ dhammaṃ paccayā akusalo saraṇo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "36. Nakusalaṃ nasaraṇaṃ dhammaṃ paccayā akusalo saraṇo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nakusalaṃ ",
      " naaraṇaṃ dhammaṃ paṭicca abyākato araṇo dhammo uppajjati hetupaccayā. Naabyākataṃ ",
      " naaraṇaṃ dhammaṃ paṭicca abyākato araṇo dhammo uppajjati hetupaccayā. Nakusalaṃ naaraṇañca naabyākataṃ naaraṇañca dhammaṃ paṭicca abyākato araṇo dhammo uppajjati hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "Nakusalaṃ naaraṇaṃ dhammaṃ paṭicca abyākato araṇo dhammo uppajjati hetupaccayā. Naabyākataṃ naaraṇaṃ dhammaṃ paṭicca abyākato araṇo dhammo uppajjati hetupaccayā. Nakusalaṃ naaraṇañca naabyākataṃ naaraṇañca dhammaṃ paṭicca abyākato araṇo dhammo uppajjati hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2-1. Vedanāttika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ". Nasukhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca sukhāya vedanāya sampayutto hetu dhammo uppajjati hetupaccayā. Nasukhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca dukkhāya vedanāya sampayutto hetu dhammo uppajjati hetupaccayā. Nasukhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca adukkhamasukhāya vedanāya sampayutto hetu dhammo uppajjati hetupaccayā. Tīṇi."
    ],
    "innerText": "37. Nasukhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca sukhāya vedanāya sampayutto hetu dhammo uppajjati hetupaccayā. Nasukhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca dukkhāya vedanāya sampayutto hetu dhammo uppajjati hetupaccayā. Nasukhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca adukkhamasukhāya vedanāya sampayutto hetu dhammo uppajjati hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nadukkhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca dukkhāya vedanāya sampayutto hetu dhammo uppajjati hetupaccayā… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naadukkhamasukhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca adukkhamasukhāya vedanāya sampayutto hetu dhammo uppajjati hetupaccayā… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nasukhāya ",
      " vedanāya sampayuttaṃ nahetuñca naadukkhamasukhāya vedanāya sampayuttaṃ nahetuñca dhammaṃ paṭicca sukhāya vedanāya sampayutto hetu dhammo uppajjati hetupaccayā… tīṇi (dutiyaṃ gaṇitakena tīṇi). Hetuyā ",
      " ekavīsa."
    ],
    "innerText": "Nasukhāya vedanāya sampayuttaṃ nahetuñca naadukkhamasukhāya vedanāya sampayuttaṃ nahetuñca dhammaṃ paṭicca sukhāya vedanāya sampayutto hetu dhammo uppajjati hetupaccayā… tīṇi (dutiyaṃ gaṇitakena tīṇi). Hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasukhāya vedanāya sampayuttaṃ nanahetuṃ dhammaṃ paṭicca dukkhāya vedanāya sampayutto nahetu dhammo uppajjati hetupaccayā… dve."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nadukkhāya vedanāya sampayuttaṃ nanahetuṃ dhammaṃ paṭicca… (dve pañhāyeva)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naadukkhamasukhāya vedanāya sampayuttaṃ nanahetuṃ dhammaṃ paṭicca… (dveyeva. Paṭhamaṃ gaṇitakena ekaṃ, dutiyaṃ gaṇitakena ekaṃ, tatiyaṃ gaṇitakena ekaṃ kātabbaṃ.) Hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3-1. Vipākattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "38"
      },
      ". Navipākaṃ ",
      " nahetuṃ dhammaṃ paṭicca vipāko hetu dhammo uppajjati hetupaccayā. Navipākaṃ nahetuṃ dhammaṃ paṭicca vipākadhammadhammo hetu dhammo uppajjati hetupaccayā. Navipākaṃ nahetuṃ dhammaṃ paṭicca nevavipākanavipākadhammadhammo hetu dhammo uppajjati hetupaccayā. Tīṇi."
    ],
    "innerText": "38. Navipākaṃ nahetuṃ dhammaṃ paṭicca vipāko hetu dhammo uppajjati hetupaccayā. Navipākaṃ nahetuṃ dhammaṃ paṭicca vipākadhammadhammo hetu dhammo uppajjati hetupaccayā. Navipākaṃ nahetuṃ dhammaṃ paṭicca nevavipākanavipākadhammadhammo hetu dhammo uppajjati hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Navipākadhammadhammaṃ nahetuṃ dhammaṃ paṭicca vipāko hetu dhammo uppajjati hetupaccayā. Navipākadhammadhammaṃ nahetuṃ dhammaṃ paṭicca nevavipākanavipākadhammadhammo hetu dhammo uppajjati hetupaccayā. Dve."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nanevavipākanavipākadhammadhammaṃ nahetuṃ dhammaṃ paṭicca vipāko hetu dhammo uppajjati hetupaccayā. Nanevavipākanavipākadhammadhammaṃ nahetuṃ dhammaṃ paṭicca vipākadhammadhammo hetu dhammo uppajjati hetupaccayā. Dve."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Navipākaṃ nahetuñca nanevavipākanavipākadhammadhammaṃ nahetuñca dhammaṃ paṭicca vipākadhammadhammo hetu dhammo uppajjati hetupaccayā. Ekaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Navipākadhammadhammaṃ nahetuñca nanevavipākanavipākadhammadhammaṃ nahetuñca dhammaṃ paṭicca vipāko hetu dhammo ",
      " uppajjati hetupaccayā. Ekaṃ."
    ],
    "innerText": "Navipākadhammadhammaṃ nahetuñca nanevavipākanavipākadhammadhammaṃ nahetuñca dhammaṃ paṭicca vipāko hetu dhammo uppajjati hetupaccayā. Ekaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Navipākaṃ nahetuñca navipākadhammadhammaṃ nahetuñca dhammaṃ paṭicca vipāko hetu dhammo uppajjati hetupaccayā. Navipākaṃ nahetuñca navipākadhammadhammaṃ nahetuñca ",
      " dhammaṃ paṭicca nevavipākanavipākadhammadhammo hetu dhammo uppajjati hetupaccayā. Dve. (Saṃkhittaṃ.) Hetuyā ekādasa."
    ],
    "innerText": "Navipākaṃ nahetuñca navipākadhammadhammaṃ nahetuñca dhammaṃ paṭicca vipāko hetu dhammo uppajjati hetupaccayā. Navipākaṃ nahetuñca navipākadhammadhammaṃ nahetuñca dhammaṃ paṭicca nevavipākanavipākadhammadhammo hetu dhammo uppajjati hetupaccayā. Dve. (Saṃkhittaṃ.) Hetuyā ekādasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Navipākaṃ nanahetuṃ dhammaṃ paṭicca vipākadhammadhammo nahetu dhammo uppajjati hetupaccayā… hetuyā aṭṭhārasa. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4-1. Upādinnattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "39"
      },
      ". Naupādinnupādāniyaṃ ",
      " nahetuṃ dhammaṃ paṭicca anupādinnupādāniyo hetu dhammo uppajjati hetupaccayā… hetuyā nava."
    ],
    "innerText": "39. Naupādinnupādāniyaṃ nahetuṃ dhammaṃ paṭicca anupādinnupādāniyo hetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naupādinnupādāniyaṃ nanahetuṃ dhammaṃ paṭicca anupādinnupādāniyo nahetu dhammo uppajjati hetupaccayā… hetuyā aṭṭhārasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "5-1. Saṃkiliṭṭhattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ". Nasaṃkiliṭṭhasaṃkilesikaṃ ",
      " nahetuṃ dhammaṃ paṭicca asaṃkiliṭṭhasaṃkilesiko hetu dhammo uppajjati hetupaccayā… hetuyā nava."
    ],
    "innerText": "40. Nasaṃkiliṭṭhasaṃkilesikaṃ nahetuṃ dhammaṃ paṭicca asaṃkiliṭṭhasaṃkilesiko hetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "6-11-1. Vitakkādittikāni-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ". Nasavitakkasavicāraṃ nahetuṃ dhammaṃ paṭicca savitakkasavicāro hetu dhammo uppajjati hetupaccayā… hetuyā pannarasa."
    ],
    "innerText": "41. Nasavitakkasavicāraṃ nahetuṃ dhammaṃ paṭicca savitakkasavicāro hetu dhammo uppajjati hetupaccayā… hetuyā pannarasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42"
      },
      ". Napītisahagataṃ nahetuṃ dhammaṃ paṭicca pītisahagato hetu dhammo uppajjati hetupaccayā… hetuyā aṭṭhavīsa."
    ],
    "innerText": "42. Napītisahagataṃ nahetuṃ dhammaṃ paṭicca pītisahagato hetu dhammo uppajjati hetupaccayā… hetuyā aṭṭhavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "43"
      },
      ". Nadassanena pahātabbaṃ nahetuṃ dhammaṃ paṭicca bhāvanāya pahātabbo hetu dhammo uppajjati hetupaccayā… hetuyā nava."
    ],
    "innerText": "43. Nadassanena pahātabbaṃ nahetuṃ dhammaṃ paṭicca bhāvanāya pahātabbo hetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44"
      },
      ". Nadassanena pahātabbahetukaṃ nahetuṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko hetu dhammo uppajjati hetupaccayā… hetuyā ",
      " nava."
    ],
    "innerText": "44. Nadassanena pahātabbahetukaṃ nahetuṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko hetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "45"
      },
      ". Naācayagāmiṃ nahetuṃ dhammaṃ paṭicca apacayagāmī hetu dhammo uppajjati hetupaccayā… hetuyā nava."
    ],
    "innerText": "45. Naācayagāmiṃ nahetuṃ dhammaṃ paṭicca apacayagāmī hetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "46"
      },
      ". Nasekkhaṃ ",
      " nahetuṃ dhammaṃ paṭicca asekkho hetu dhammo uppajjati hetupaccayā… hetuyā nava."
    ],
    "innerText": "46. Nasekkhaṃ nahetuṃ dhammaṃ paṭicca asekkho hetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "12-13-1. Parittattikadvaya-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "47"
      },
      ". Naparittaṃ nahetuṃ dhammaṃ paṭicca mahaggato hetu dhammo uppajjati hetupaccayā… hetuyā ekādasa."
    ],
    "innerText": "47. Naparittaṃ nahetuṃ dhammaṃ paṭicca mahaggato hetu dhammo uppajjati hetupaccayā… hetuyā ekādasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "48"
      },
      ". Naparittārammaṇaṃ nahetuṃ dhammaṃ paṭicca parittārammaṇo hetu dhammo uppajjati hetupaccayā… hetuyā terasa."
    ],
    "innerText": "48. Naparittārammaṇaṃ nahetuṃ dhammaṃ paṭicca parittārammaṇo hetu dhammo uppajjati hetupaccayā… hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "14-17-1. Hīnādittikāni-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "49"
      },
      ". Nahīnaṃ nahetuṃ dhammaṃ paṭicca majjhimo hetu dhammo uppajjati hetupaccayā… hetuyā nava."
    ],
    "innerText": "49. Nahīnaṃ nahetuṃ dhammaṃ paṭicca majjhimo hetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50"
      },
      ". Namicchattaniyataṃ ",
      " nahetuṃ dhammaṃ paṭicca sammattaniyato hetu dhammo uppajjati hetupaccayā… hetuyā nava."
    ],
    "innerText": "50. Namicchattaniyataṃ nahetuṃ dhammaṃ paṭicca sammattaniyato hetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "51"
      },
      ". Namaggārammaṇaṃ nahetuṃ dhammaṃ paṭicca maggahetuko hetu dhammo uppajjati hetupaccayā… (saṃkhittaṃ.) Hetuyā dasa."
    ],
    "innerText": "51. Namaggārammaṇaṃ nahetuṃ dhammaṃ paṭicca maggahetuko hetu dhammo uppajjati hetupaccayā… (saṃkhittaṃ.) Hetuyā dasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "52"
      },
      ". Naanuppanno nanahetu dhammo uppannassa nahetussa dhammassa hetupaccayena paccayo. Nauppādī nanahetu dhammo uppannassa nahetussa dhammassa hetupaccayena paccayo. Naanuppanno nanahetu ca nauppādī nanahetu ca dhammā uppannassa nahetussa dhammassa hetupaccayena paccayo. Hetuyā tīṇi."
    ],
    "innerText": "52. Naanuppanno nanahetu dhammo uppannassa nahetussa dhammassa hetupaccayena paccayo. Nauppādī nanahetu dhammo uppannassa nahetussa dhammassa hetupaccayena paccayo. Naanuppanno nanahetu ca nauppādī nanahetu ca dhammā uppannassa nahetussa dhammassa hetupaccayena paccayo. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "18-19-1. Atītattikadvaya-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "53"
      },
      ". Naatīto nanahetu dhammo paccuppannassa nahetussa dhammassa hetupaccayena paccayo. Naanāgato nanahetu dhammo paccuppannassa nahetussa dhammassa hetupaccayena paccayo. Naatīto nanahetu ",
      " ca naanāgato nanahetu ca dhammā paccuppannassa nahetussa dhammassa hetupaccayena paccayo. Hetuyā tīṇi."
    ],
    "innerText": "53. Naatīto nanahetu dhammo paccuppannassa nahetussa dhammassa hetupaccayena paccayo. Naanāgato nanahetu dhammo paccuppannassa nahetussa dhammassa hetupaccayena paccayo. Naatīto nanahetu ca naanāgato nanahetu ca dhammā paccuppannassa nahetussa dhammassa hetupaccayena paccayo. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "54"
      },
      ". Naatītārammaṇaṃ ",
      " nahetuṃ dhammaṃ paṭicca atītārammaṇo hetu ",
      " dhammo uppajjati hetupaccayā… hetuyā sattarasa."
    ],
    "innerText": "54. Naatītārammaṇaṃ nahetuṃ dhammaṃ paṭicca atītārammaṇo hetu dhammo uppajjati hetupaccayā… hetuyā sattarasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "20-21-1. Ajjhattattikadvaya-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "55"
      },
      ". Naajjhattaṃ nahetuṃ dhammaṃ paṭicca bahiddhā hetu dhammo uppajjati hetupaccayā."
    ],
    "innerText": "55. Naajjhattaṃ nahetuṃ dhammaṃ paṭicca bahiddhā hetu dhammo uppajjati hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nabahiddhā nahetuṃ dhammaṃ paṭicca ajjhatto hetu dhammo uppajjati hetupaccayā… hetuyā dve."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "56"
      },
      ". Naajjhattārammaṇaṃ nahetuṃ dhammaṃ paṭicca ajjhattārammaṇo hetu dhammo uppajjati hetupaccayā… dve."
    ],
    "innerText": "56. Naajjhattārammaṇaṃ nahetuṃ dhammaṃ paṭicca ajjhattārammaṇo hetu dhammo uppajjati hetupaccayā… dve."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nabahiddhārammaṇaṃ nahetuṃ dhammaṃ paṭicca bahiddhārammaṇo hetu dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-1. Sanidassanattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "57"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " nahetuṃ dhammaṃ paṭicca anidassanaappaṭigho hetu dhammo uppajjati hetupaccayā. Naanidassanasappaṭighaṃ nahetuṃ dhammaṃ paṭicca anidassanaappaṭigho hetu dhammo uppajjati hetupaccayā. Nasanidassanasappaṭighaṃ nahetuñca naanidassanasappaṭighaṃ nahetuñca dhammaṃ paṭicca anidassanaappaṭigho hetu dhammo uppajjati hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "57. Nasanidassanasappaṭighaṃ nahetuṃ dhammaṃ paṭicca anidassanaappaṭigho hetu dhammo uppajjati hetupaccayā. Naanidassanasappaṭighaṃ nahetuṃ dhammaṃ paṭicca anidassanaappaṭigho hetu dhammo uppajjati hetupaccayā. Nasanidassanasappaṭighaṃ nahetuñca naanidassanasappaṭighaṃ nahetuñca dhammaṃ paṭicca anidassanaappaṭigho hetu dhammo uppajjati hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanahetuṃ dhammaṃ paṭicca sanidassanasappaṭigho nahetu dhammo uppajjati hetupaccayā. Nasanidassanasappaṭighaṃ nanahetuṃ dhammaṃ paṭicca anidassanasappaṭigho nahetu dhammo uppajjati hetupaccayā. (Nahetu nanahetu ovattā, tīṇi mūlāni, ekavīsati pañhā kātabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-2. Sanidassanattika-sahetukadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "58"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " nasahetukaṃ dhammaṃ paṭicca anidassanaappaṭigho sahetuko dhammo uppajjati hetupaccayā. Naanidassanasappaṭighaṃ nasahetukaṃ dhammaṃ paṭicca anidassanaappaṭigho sahetuko dhammo uppajjati hetupaccayā ",
      ". Nasanidassanasappaṭighaṃ nasahetukañca naanidassanasappaṭighaṃ nasahetukañca dhammaṃ paṭicca anidassanaappaṭigho sahetuko dhammo uppajjati hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "58. Nasanidassanasappaṭighaṃ nasahetukaṃ dhammaṃ paṭicca anidassanaappaṭigho sahetuko dhammo uppajjati hetupaccayā. Naanidassanasappaṭighaṃ nasahetukaṃ dhammaṃ paṭicca anidassanaappaṭigho sahetuko dhammo uppajjati hetupaccayā . Nasanidassanasappaṭighaṃ nasahetukañca naanidassanasappaṭighaṃ nasahetukañca dhammaṃ paṭicca anidassanaappaṭigho sahetuko dhammo uppajjati hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naahetukaṃ dhammaṃ paṭicca sanidassanasappaṭigho ahetuko dhammo uppajjati hetupaccayā… satta."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naanidassanasappaṭighaṃ naahetukaṃ dhammaṃ paṭicca anidassanasappaṭigho ahetuko dhammo uppajjati hetupaccayā… satta."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naahetukañca naanidassanasappaṭighaṃ naahetukañca dhammaṃ paṭicca anidassanasappaṭigho ahetuko dhammo uppajjati hetupaccayā… satta. Hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-3-6. Sanidassanattika-hetusampayuttādidukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "59"
      },
      ". Nasanidassanasappaṭighaṃ nahetusampayuttaṃ dhammaṃ paṭicca anidassanaappaṭigho hetusampayutto dhammo uppajjati hetupaccayā… hetuyā ",
      " tīṇi."
    ],
    "innerText": "59. Nasanidassanasappaṭighaṃ nahetusampayuttaṃ dhammaṃ paṭicca anidassanaappaṭigho hetusampayutto dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nahetuvippayuttaṃ dhammaṃ paṭicca sanidassanasappaṭigho hetuvippayutto dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "60"
      },
      ". Nasanidassanasappaṭighaṃ nahetuñceva naahetukañca dhammaṃ paṭicca anidassanaappaṭigho hetu ceva sahetuko ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "60. Nasanidassanasappaṭighaṃ nahetuñceva naahetukañca dhammaṃ paṭicca anidassanaappaṭigho hetu ceva sahetuko ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naahetukañceva nana ca hetuṃ dhammaṃ paṭicca anidassanaappaṭigho sahetuko ceva na ca hetu dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "61"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " nahetuñceva nahetuvippayuttañca dhammaṃ paṭicca anidassanaappaṭigho hetu ceva hetusampayutto ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "61. Nasanidassanasappaṭighaṃ nahetuñceva nahetuvippayuttañca dhammaṃ paṭicca anidassanaappaṭigho hetu ceva hetusampayutto ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nasanidassanasappaṭighaṃ ",
      " nahetuvippayuttañceva nana ca hetuṃ dhammaṃ paṭicca anidassanaappaṭigho hetusampayutto ceva na ca hetu dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "Nasanidassanasappaṭighaṃ nahetuvippayuttañceva nana ca hetuṃ dhammaṃ paṭicca anidassanaappaṭigho hetusampayutto ceva na ca hetu dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "62"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " nahetuṃ nasahetukaṃ dhammaṃ paṭicca anidassanaappaṭigho nahetu sahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "62. Nasanidassanasappaṭighaṃ nahetuṃ nasahetukaṃ dhammaṃ paṭicca anidassanaappaṭigho nahetu sahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nahetuṃ naahetukaṃ dhammaṃ paṭicca sanidassanasappaṭigho nahetu ahetuko dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-7-13. Sanidassanattika-cūḷantaradukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "63"
      },
      ". Nasanidassanasappaṭigho nasappaccayo dhammo anidassanaappaṭighassa sappaccayassa dhammassa ārammaṇapaccayena paccayo. (Saṃkhittaṃ.) Ārammaṇe tīṇi, adhipatiyā upanissaye tīṇi."
    ],
    "innerText": "63. Nasanidassanasappaṭigho nasappaccayo dhammo anidassanaappaṭighassa sappaccayassa dhammassa ārammaṇapaccayena paccayo. (Saṃkhittaṃ.) Ārammaṇe tīṇi, adhipatiyā upanissaye tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "64"
      },
      ". Nasanidassanasappaṭighaṃ nasanidassanaṃ dhammaṃ paṭicca sanidassanasappaṭigho sanidassano dhammo uppajjati hetupaccayā… hetuyā pañca."
    ],
    "innerText": "64. Nasanidassanasappaṭighaṃ nasanidassanaṃ dhammaṃ paṭicca sanidassanasappaṭigho sanidassano dhammo uppajjati hetupaccayā… hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naanidassanaappaṭigho nanasanidassano dhammo anidassanaappaṭighassa nasanidassanassa dhammassa ārammaṇapaccayena paccayo. (Saṃkhittaṃ.) Ārammaṇe tīṇi, adhipatiyā upanissaye purejāte atthiyā avigate tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "65"
      },
      ". Nasanidassanasappaṭighaṃ nasappaṭighaṃ dhammaṃ paṭicca sanidassanasappaṭigho sappaṭigho dhammo uppajjati hetupaccayā… hetuyā nava."
    ],
    "innerText": "65. Nasanidassanasappaṭighaṃ nasappaṭighaṃ dhammaṃ paṭicca sanidassanasappaṭigho sappaṭigho dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nasanidassanasappaṭighaṃ ",
      " naappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho appaṭigho dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "Nasanidassanasappaṭighaṃ naappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho appaṭigho dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "66"
      },
      ". Nasanidassanasappaṭighaṃ narūpiṃ dhammaṃ paṭicca sanidassanasappaṭigho rūpī dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
    ],
    "innerText": "66. Nasanidassanasappaṭighaṃ narūpiṃ dhammaṃ paṭicca sanidassanasappaṭigho rūpī dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naarūpiṃ dhammaṃ paṭicca anidassanaappaṭigho arūpī dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "67"
      },
      ". Nasanidassanasappaṭighaṃ nalokiyaṃ dhammaṃ paṭicca sanidassanasappaṭigho lokiyo dhammo uppajjati hetupaccayā… satta."
    ],
    "innerText": "67. Nasanidassanasappaṭighaṃ nalokiyaṃ dhammaṃ paṭicca sanidassanasappaṭigho lokiyo dhammo uppajjati hetupaccayā… satta."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Naanidassanasappaṭighaṃ ",
      " nalokiyaṃ dhammaṃ paṭicca anidassanasappaṭigho lokiyo dhammo uppajjati hetupaccayā… satta. Hetuyā ekavīsa."
    ],
    "innerText": "Naanidassanasappaṭighaṃ nalokiyaṃ dhammaṃ paṭicca anidassanasappaṭigho lokiyo dhammo uppajjati hetupaccayā… satta. Hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nalokuttaraṃ dhammaṃ paccayā anidassanaappaṭigho lokuttaro dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.) Hetuyā tīṇi…pe… avigate tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nalokuttaraṃ dhammaṃ paccayā anidassanaappaṭigho lokuttaro dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.) Hetuyā tīṇi…pe… avigate tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "68"
      },
      ". Nasanidassanasappaṭighaṃ nakenaci viññeyyaṃ dhammaṃ paṭicca sanidassanasappaṭigho kenaci viññeyyo dhammo uppajjati hetupaccayā… hetuyā ",
      " pañcatiṃsa."
    ],
    "innerText": "68. Nasanidassanasappaṭighaṃ nakenaci viññeyyaṃ dhammaṃ paṭicca sanidassanasappaṭigho kenaci viññeyyo dhammo uppajjati hetupaccayā… hetuyā pañcatiṃsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanakenaci viññeyyaṃ dhammaṃ paṭicca sanidassanasappaṭigho nakenaci viññeyyo dhammo uppajjati hetupaccayā… hetuyā pañcatiṃsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-14-19. Sanidassanattika-āsavagocchakāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "69"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " noāsavaṃ dhammaṃ paṭicca anidassanaappaṭigho āsavo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "69. Nasanidassanasappaṭighaṃ noāsavaṃ dhammaṃ paṭicca anidassanaappaṭigho āsavo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanoāsavaṃ dhammaṃ paṭicca sanidassanasappaṭigho noāsavo dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "70"
      },
      ". Nasanidassanasappaṭighaṃ nasāsavaṃ dhammaṃ paṭicca sanidassanasappaṭigho sāsavo dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
    ],
    "innerText": "70. Nasanidassanasappaṭighaṃ nasāsavaṃ dhammaṃ paṭicca sanidassanasappaṭigho sāsavo dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naanāsavaṃ dhammaṃ paccayā anidassanaappaṭigho anāsavo dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.) Hetuyā tīṇi…pe… avigate tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "71"
      },
      ". Nasanidassanasappaṭighaṃ naāsavasampayuttaṃ dhammaṃ paṭicca anidassanaappaṭigho āsavasampayutto dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "71. Nasanidassanasappaṭighaṃ naāsavasampayuttaṃ dhammaṃ paṭicca anidassanaappaṭigho āsavasampayutto dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nasanidassanasappaṭighaṃ ",
      " naāsavavippayuttaṃ dhammaṃ paṭicca sanidassanasappaṭigho āsavavippayutto dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
    ],
    "innerText": "Nasanidassanasappaṭighaṃ naāsavavippayuttaṃ dhammaṃ paṭicca sanidassanasappaṭigho āsavavippayutto dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "72"
      },
      ". Nasanidassanasappaṭighaṃ naāsavañceva naanāsavañca dhammaṃ paṭicca anidassanaappaṭigho āsavo ceva sāsavo ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "72. Nasanidassanasappaṭighaṃ naāsavañceva naanāsavañca dhammaṃ paṭicca anidassanaappaṭigho āsavo ceva sāsavo ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naanāsavañceva nano ca āsavaṃ dhammaṃ paṭicca sanidassanasappaṭigho sāsavo ceva no ca āsavo dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "73"
      },
      ". Nasanidassanasappaṭighaṃ naāsavañceva naāsavavippayuttañca dhammaṃ paṭicca anidassanaappaṭigho āsavo ceva āsavasampayutto ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "73. Nasanidassanasappaṭighaṃ naāsavañceva naāsavavippayuttañca dhammaṃ paṭicca anidassanaappaṭigho āsavo ceva āsavasampayutto ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nasanidassanasappaṭighaṃ ",
      " naāsavavippayuttañceva nano ca āsavaṃ dhammaṃ ",
      " paṭicca anidassanaappaṭigho āsavasampayutto ceva no ca āsavo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "Nasanidassanasappaṭighaṃ naāsavavippayuttañceva nano ca āsavaṃ dhammaṃ paṭicca anidassanaappaṭigho āsavasampayutto ceva no ca āsavo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "74"
      },
      ". Nasanidassanasappaṭighaṃ āsavavippayuttaṃ nasāsavaṃ dhammaṃ paṭicca sanidassanasappaṭigho āsavavippayutto sāsavo dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
    ],
    "innerText": "74. Nasanidassanasappaṭighaṃ āsavavippayuttaṃ nasāsavaṃ dhammaṃ paṭicca sanidassanasappaṭigho āsavavippayutto sāsavo dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ āsavavippayuttaṃ naanāsavaṃ dhammaṃ paccayā anidassanaappaṭigho āsavavippayutto anāsavo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-20-54. Sanidassanattika-saññojanādigocchakāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "75"
      },
      ". Nasanidassanasappaṭighaṃ nosaññojanaṃ dhammaṃ paṭicca anidassanaappaṭigho saññojano dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "75. Nasanidassanasappaṭighaṃ nosaññojanaṃ dhammaṃ paṭicca anidassanaappaṭigho saññojano dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "76"
      },
      ". Nasanidassanasappaṭighaṃ noganthaṃ dhammaṃ paṭicca anidassanaappaṭigho ",
      " gantho dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "76. Nasanidassanasappaṭighaṃ noganthaṃ dhammaṃ paṭicca anidassanaappaṭigho gantho dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "77"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " nooghaṃ dhammaṃ paṭicca anidassanaappaṭigho ogho dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "77. Nasanidassanasappaṭighaṃ nooghaṃ dhammaṃ paṭicca anidassanaappaṭigho ogho dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "78"
      },
      ". Nasanidassanasappaṭighaṃ noyogaṃ dhammaṃ paṭicca anidassanaappaṭigho yogo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "78. Nasanidassanasappaṭighaṃ noyogaṃ dhammaṃ paṭicca anidassanaappaṭigho yogo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "79"
      },
      ". Nasanidassanasappaṭighaṃ nonīvaraṇaṃ dhammaṃ paṭicca anidassanaappaṭigho nīvaraṇo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "79. Nasanidassanasappaṭighaṃ nonīvaraṇaṃ dhammaṃ paṭicca anidassanaappaṭigho nīvaraṇo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "80"
      },
      ". Nasanidassanasappaṭighaṃ noparāmāsaṃ dhammaṃ paṭicca anidassanaappaṭigho ",
      " parāmāso dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "80. Nasanidassanasappaṭighaṃ noparāmāsaṃ dhammaṃ paṭicca anidassanaappaṭigho parāmāso dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-55-68. Sanidassanattika-mahantaradukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "81"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " nasārammaṇaṃ dhammaṃ paṭicca anidassanaappaṭigho sārammaṇo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "81. Nasanidassanasappaṭighaṃ nasārammaṇaṃ dhammaṃ paṭicca anidassanaappaṭigho sārammaṇo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naanārammaṇaṃ dhammaṃ paṭicca sanidassanasappaṭigho anārammaṇo dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "82"
      },
      ". Nasanidassanasappaṭighaṃ nocittaṃ dhammaṃ paṭicca anidassanaappaṭigho citto dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "82. Nasanidassanasappaṭighaṃ nocittaṃ dhammaṃ paṭicca anidassanaappaṭigho citto dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanocittaṃ dhammaṃ paṭicca sanidassanasappaṭigho nocitto dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "83"
      },
      ". Nasanidassanasappaṭighaṃ nacetasikaṃ dhammaṃ paṭicca anidassanaappaṭigho cetasiko dhammo uppajjati hetupaccayā… hetuyā ",
      " tīṇi."
    ],
    "innerText": "83. Nasanidassanasappaṭighaṃ nacetasikaṃ dhammaṃ paṭicca anidassanaappaṭigho cetasiko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naacetasikaṃ dhammaṃ paṭicca sanidassanasappaṭigho acetasiko dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "84"
      },
      ". Nasanidassanasappaṭighaṃ nacittasampayuttaṃ dhammaṃ paṭicca anidassanaappaṭigho cittasampayutto dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "84. Nasanidassanasappaṭighaṃ nacittasampayuttaṃ dhammaṃ paṭicca anidassanaappaṭigho cittasampayutto dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nasanidassanasappaṭighaṃ ",
      " nacittavippayuttaṃ dhammaṃ paṭicca sanidassanasappaṭigho cittavippayutto dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
    ],
    "innerText": "Nasanidassanasappaṭighaṃ nacittavippayuttaṃ dhammaṃ paṭicca sanidassanasappaṭigho cittavippayutto dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "85"
      },
      ". Nasanidassanasappaṭighaṃ nacittasaṃsaṭṭhaṃ dhammaṃ paṭicca anidassanaappaṭigho cittasaṃsaṭṭho dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "85. Nasanidassanasappaṭighaṃ nacittasaṃsaṭṭhaṃ dhammaṃ paṭicca anidassanaappaṭigho cittasaṃsaṭṭho dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nasanidassanasappaṭighaṃ ",
      " nacittavisaṃsaṭṭhaṃ dhammaṃ paṭicca sanidassanasappaṭigho cittavisaṃsaṭṭho dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
    ],
    "innerText": "Nasanidassanasappaṭighaṃ nacittavisaṃsaṭṭhaṃ dhammaṃ paṭicca sanidassanasappaṭigho cittavisaṃsaṭṭho dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "86"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " nocittasamuṭṭhānaṃ dhammaṃ paṭicca sanidassanasappaṭigho cittasamuṭṭhāno dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
    ],
    "innerText": "86. Nasanidassanasappaṭighaṃ nocittasamuṭṭhānaṃ dhammaṃ paṭicca sanidassanasappaṭigho cittasamuṭṭhāno dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanocittasamuṭṭhānaṃ dhammaṃ paṭicca anidassanaappaṭigho nocittasamuṭṭhāno dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "87"
      },
      ". Nasanidassanasappaṭighaṃ nocittasahabhuṃ dhammaṃ paṭicca anidassanaappaṭigho cittasahabhū dhammo uppajjati hetupaccayā… hetuyā pañca."
    ],
    "innerText": "87. Nasanidassanasappaṭighaṃ nocittasahabhuṃ dhammaṃ paṭicca anidassanaappaṭigho cittasahabhū dhammo uppajjati hetupaccayā… hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanocittasahabhuṃ dhammaṃ paṭicca sanidassanasappaṭigho nocittasahabhū dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "88"
      },
      ". Nasanidassanasappaṭighaṃ nocittānuparivattiṃ dhammaṃ paṭicca anidassanaappaṭigho cittānuparivattī dhammo uppajjati hetupaccayā… hetuyā ",
      " pañca."
    ],
    "innerText": "88. Nasanidassanasappaṭighaṃ nocittānuparivattiṃ dhammaṃ paṭicca anidassanaappaṭigho cittānuparivattī dhammo uppajjati hetupaccayā… hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanocittānuparivattiṃ dhammaṃ paṭicca sanidassanasappaṭigho nocittānuparivattī dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "89"
      },
      ". Nasanidassanasappaṭighaṃ nocittasaṃsaṭṭhasamuṭṭhānaṃ dhammaṃ paṭicca anidassanaappaṭigho cittasaṃsaṭṭhasamuṭṭhāno dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "89. Nasanidassanasappaṭighaṃ nocittasaṃsaṭṭhasamuṭṭhānaṃ dhammaṃ paṭicca anidassanaappaṭigho cittasaṃsaṭṭhasamuṭṭhāno dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanocittasaṃsaṭṭhasamuṭṭhānaṃ dhammaṃ paṭicca sanidassanasappaṭigho nocittasaṃsaṭṭhasamuṭṭhāno dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "90"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " nocittasaṃsaṭṭhasamuṭṭhānasahabhuṃ dhammaṃ paṭicca anidassanaappaṭigho cittasaṃsaṭṭhasamuṭṭhānasahabhū dhammo uppajjati hetupaccayā… hetuyā ",
      " tīṇi."
    ],
    "innerText": "90. Nasanidassanasappaṭighaṃ nocittasaṃsaṭṭhasamuṭṭhānasahabhuṃ dhammaṃ paṭicca anidassanaappaṭigho cittasaṃsaṭṭhasamuṭṭhānasahabhū dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanocittasaṃsaṭṭhasamuṭṭhānasahabhuṃ dhammaṃ paṭicca sanidassanasappaṭigho nocittasaṃsaṭṭhasamuṭṭhānasahabhū dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "91"
      },
      ". Nasanidassanasappaṭighaṃ nocittasaṃsaṭṭhasamuṭṭhānānuparivattiṃ dhammaṃ paṭicca anidassanaappaṭigho cittasaṃsaṭṭhasamuṭṭhānānuparivattī dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "91. Nasanidassanasappaṭighaṃ nocittasaṃsaṭṭhasamuṭṭhānānuparivattiṃ dhammaṃ paṭicca anidassanaappaṭigho cittasaṃsaṭṭhasamuṭṭhānānuparivattī dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanocittasaṃsaṭṭhasamuṭṭhānānuparivattiṃ dhammaṃ paṭicca sanidassanasappaṭigho nocittasaṃsaṭṭhasamuṭṭhānānuparivattī dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "92"
      },
      ". Nasanidassanasappaṭighaṃ naajjhattikaṃ dhammaṃ paṭicca anidassanasappaṭigho ajjhattiko dhammo uppajjati hetupaccayā… hetuyā ekādasa."
    ],
    "innerText": "92. Nasanidassanasappaṭighaṃ naajjhattikaṃ dhammaṃ paṭicca anidassanasappaṭigho ajjhattiko dhammo uppajjati hetupaccayā… hetuyā ekādasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nasanidassanasappaṭighaṃ ",
      " nabāhiraṃ dhammaṃ paṭicca sanidassanasappaṭigho bāhiro dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
    ],
    "innerText": "Nasanidassanasappaṭighaṃ nabāhiraṃ dhammaṃ paṭicca sanidassanasappaṭigho bāhiro dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "93"
      },
      ". Nasanidassanasappaṭighaṃ noupādā dhammaṃ paṭicca sanidassanasappaṭigho upādā dhammo uppajjati hetupaccayā… hetuyā pañcatiṃsa."
    ],
    "innerText": "93. Nasanidassanasappaṭighaṃ noupādā dhammaṃ paṭicca sanidassanasappaṭigho upādā dhammo uppajjati hetupaccayā… hetuyā pañcatiṃsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanoupādā dhammaṃ paṭicca anidassanaappaṭigho noupādā dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "94"
      },
      ". Nasanidassanasappaṭighaṃ naanupādinnaṃ dhammaṃ paṭicca sanidassanasappaṭigho anupādinno dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
    ],
    "innerText": "94. Nasanidassanasappaṭighaṃ naanupādinnaṃ dhammaṃ paṭicca sanidassanasappaṭigho anupādinno dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-69-74. Sanidassanattika-upādānādidukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "95"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " noupādānaṃ dhammaṃ paṭicca anidassanaappaṭigho upādāno dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "95. Nasanidassanasappaṭighaṃ noupādānaṃ dhammaṃ paṭicca anidassanaappaṭigho upādāno dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-75-82. Sanidassanattika-kilesādidukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "96"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " nokilesaṃ dhammaṃ paṭicca anidassanaappaṭigho kileso dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "96. Nasanidassanasappaṭighaṃ nokilesaṃ dhammaṃ paṭicca anidassanaappaṭigho kileso dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-83-99. Sanidassanattika-piṭṭhidukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "97"
      },
      ". Nasanidassanasappaṭighaṃ nadassanena pahātabbaṃ dhammaṃ paccayā anidassanaappaṭigho dassanena pahātabbo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "97. Nasanidassanasappaṭighaṃ nadassanena pahātabbaṃ dhammaṃ paccayā anidassanaappaṭigho dassanena pahātabbo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanadassanena pahātabbaṃ dhammaṃ paṭicca sanidassanasappaṭigho nadassanena pahātabbo dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "98"
      },
      ". Nasanidassanasappaṭighaṃ nabhāvanāya pahātabbaṃ dhammaṃ paccayā anidassanaappaṭigho bhāvanāya pahātabbo dhammo uppajjati hetupaccayā… hetuyā ",
      " tīṇi."
    ],
    "innerText": "98. Nasanidassanasappaṭighaṃ nabhāvanāya pahātabbaṃ dhammaṃ paccayā anidassanaappaṭigho bhāvanāya pahātabbo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanabhāvanāya pahātabbaṃ dhammaṃ paṭicca sanidassanasappaṭigho nabhāvanāya pahātabbo dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "99"
      },
      ". Nasanidassanasappaṭighaṃ nadassanena pahātabbahetukaṃ dhammaṃ paṭicca anidassanaappaṭigho dassanena pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "99. Nasanidassanasappaṭighaṃ nadassanena pahātabbahetukaṃ dhammaṃ paṭicca anidassanaappaṭigho dassanena pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanadassanena pahātabbahetukaṃ dhammaṃ paṭicca sanidassanasappaṭigho nadassanena pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "100"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā anidassanaappaṭigho bhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā ",
      " tīṇi."
    ],
    "innerText": "100. Nasanidassanasappaṭighaṃ nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā anidassanaappaṭigho bhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca sanidassanasappaṭigho nabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "101"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " nasavitakkaṃ dhammaṃ paṭicca anidassanaappaṭigho savitakko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "101. Nasanidassanasappaṭighaṃ nasavitakkaṃ dhammaṃ paṭicca anidassanaappaṭigho savitakko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naavitakkaṃ dhammaṃ paṭicca sanidassanasappaṭigho avitakko dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "102"
      },
      ". Nasanidassanasappaṭighaṃ nasavicāraṃ dhammaṃ paṭicca anidassanaappaṭigho savicāro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "102. Nasanidassanasappaṭighaṃ nasavicāraṃ dhammaṃ paṭicca anidassanaappaṭigho savicāro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naavicāraṃ dhammaṃ paṭicca sanidassanasappaṭigho avicāro dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "103"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " nasappītikaṃ dhammaṃ paṭicca anidassanaappaṭigho sappītiko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "103. Nasanidassanasappaṭighaṃ nasappītikaṃ dhammaṃ paṭicca anidassanaappaṭigho sappītiko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naappītikaṃ dhammaṃ paṭicca sanidassanasappaṭigho appītiko dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "104"
      },
      ". Nasanidassanasappaṭighaṃ napītisahagataṃ dhammaṃ paṭicca anidassanaappaṭigho pītisahagato dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "104. Nasanidassanasappaṭighaṃ napītisahagataṃ dhammaṃ paṭicca anidassanaappaṭigho pītisahagato dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nasanidassanasappaṭighaṃ ",
      " nanapītisahagataṃ dhammaṃ paṭicca sanidassanasappaṭigho napītisahagato dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
    ],
    "innerText": "Nasanidassanasappaṭighaṃ nanapītisahagataṃ dhammaṃ paṭicca sanidassanasappaṭigho napītisahagato dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "105"
      },
      ". Nasanidassanasappaṭighaṃ nasukhasahagataṃ dhammaṃ paṭicca anidassanaappaṭigho sukhasahagato dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "105. Nasanidassanasappaṭighaṃ nasukhasahagataṃ dhammaṃ paṭicca anidassanaappaṭigho sukhasahagato dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nasanidassanasappaṭighaṃ nanasukhasahagataṃ dhammaṃ paṭicca sanidassanasappaṭigho nasukhasahagato dhammo uppajjati hetupaccayā… hetuyā ",
      " ekavīsa."
    ],
    "innerText": "Nasanidassanasappaṭighaṃ nanasukhasahagataṃ dhammaṃ paṭicca sanidassanasappaṭigho nasukhasahagato dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "106"
      },
      ". Nasanidassanasappaṭighaṃ naupekkhāsahagataṃ dhammaṃ paṭicca anidassanaappaṭigho upekkhāsahagato dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "106. Nasanidassanasappaṭighaṃ naupekkhāsahagataṃ dhammaṃ paṭicca anidassanaappaṭigho upekkhāsahagato dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nasanidassanasappaṭighaṃ ",
      " nanaupekkhāsahagataṃ dhammaṃ paṭicca sanidassanasappaṭigho naupekkhāsahagato dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
    ],
    "innerText": "Nasanidassanasappaṭighaṃ nanaupekkhāsahagataṃ dhammaṃ paṭicca sanidassanasappaṭigho naupekkhāsahagato dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "107"
      },
      ". Nasanidassanasappaṭighaṃ nakāmāvacaraṃ dhammaṃ paṭicca sanidassanasappaṭigho kāmāvacaro dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
    ],
    "innerText": "107. Nasanidassanasappaṭighaṃ nakāmāvacaraṃ dhammaṃ paṭicca sanidassanasappaṭigho kāmāvacaro dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanakāmāvacaraṃ dhammaṃ paṭicca anidassanaappaṭigho nakāmāvacaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "108"
      },
      ". Nasanidassanasappaṭighaṃ narūpāvacaraṃ dhammaṃ paṭicca anidassanaappaṭigho rūpāvacaro dhammo uppajjati hetupaccayā… hetuyā ",
      " tīṇi."
    ],
    "innerText": "108. Nasanidassanasappaṭighaṃ narūpāvacaraṃ dhammaṃ paṭicca anidassanaappaṭigho rūpāvacaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanarūpāvacaraṃ dhammaṃ paṭicca sanidassanasappaṭigho narūpāvacaro dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "109"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " naarūpāvacaraṃ dhammaṃ paccayā anidassanaappaṭigho arūpāvacaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "109. Nasanidassanasappaṭighaṃ naarūpāvacaraṃ dhammaṃ paccayā anidassanaappaṭigho arūpāvacaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanaarūpāvacaraṃ dhammaṃ paṭicca sanidassanasappaṭigho naarūpāvacaro dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "110"
      },
      ". Nasanidassanasappaṭighaṃ napariyāpannaṃ dhammaṃ paṭicca sanidassanasappaṭigho pariyāpanno dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
    ],
    "innerText": "110. Nasanidassanasappaṭighaṃ napariyāpannaṃ dhammaṃ paṭicca sanidassanasappaṭigho pariyāpanno dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naapariyāpannaṃ dhammaṃ paccayā anidassanaappaṭigho apariyāpanno dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "111"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " naniyyānikaṃ dhammaṃ paccayā anidassanaappaṭigho niyyāniko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "111. Nasanidassanasappaṭighaṃ naniyyānikaṃ dhammaṃ paccayā anidassanaappaṭigho niyyāniko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naaniyyānikaṃ dhammaṃ paṭicca sanidassanasappaṭigho aniyyāniko dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "112"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " naniyataṃ dhammaṃ paccayā anidassanaappaṭigho niyato dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "112. Nasanidassanasappaṭighaṃ naniyataṃ dhammaṃ paccayā anidassanaappaṭigho niyato dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naaniyataṃ dhammaṃ paṭicca sanidassanasappaṭigho aniyato dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "113"
      },
      ". Nasanidassanasappaṭighaṃ nasauttaraṃ dhammaṃ paṭicca sanidassanasappaṭigho sauttaro dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
    ],
    "innerText": "113. Nasanidassanasappaṭighaṃ nasauttaraṃ dhammaṃ paṭicca sanidassanasappaṭigho sauttaro dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nasanidassanasappaṭighaṃ ",
      " naanuttaraṃ dhammaṃ paccayā anidassanaappaṭigho anuttaro dhammo uppajjati hetupaccayā… hetuyā ",
      " tīṇi."
    ],
    "innerText": "Nasanidassanasappaṭighaṃ naanuttaraṃ dhammaṃ paccayā anidassanaappaṭigho anuttaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-100. Sanidassanattika-saraṇadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "114"
      },
      ". Nasanidassanasappaṭighaṃ nasaraṇaṃ dhammaṃ paccayā anidassanaappaṭigho saraṇo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "114. Nasanidassanasappaṭighaṃ nasaraṇaṃ dhammaṃ paccayā anidassanaappaṭigho saraṇo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naaraṇaṃ dhammaṃ paṭicca sanidassanasappaṭigho araṇo dhammo uppajjati hetupaccayā… satta."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naanidassanasappaṭighaṃ naaraṇaṃ dhammaṃ paṭicca sanidassanasappaṭigho araṇo dhammo uppajjati hetupaccayā… satta."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naaraṇañca naanidassanasappaṭighaṃ naaraṇañca dhammaṃ paṭicca sanidassanasappaṭigho araṇo dhammo uppajjati hetupaccayā… satta. Hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Sahajātavārampi paṭiccavārasadisaṃ vitthāretabbaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetuārammaṇapaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "115"
      },
      ". Nasanidassanasappaṭigho naaraṇo dhammo sanidassanasappaṭighassa ",
      " araṇassa dhammassa hetupaccayena paccayo… satta."
    ],
    "innerText": "115. Nasanidassanasappaṭigho naaraṇo dhammo sanidassanasappaṭighassa araṇassa dhammassa hetupaccayena paccayo… satta."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naanidassanasappaṭigho naaraṇo dhammo sanidassanasappaṭighassa araṇassa dhammassa hetupaccayena paccayo… satta."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nasanidassanasappaṭigho ",
      " naaraṇo ca naanidassanasappaṭigho naaraṇo ca dhammā sanidassanasappaṭighassa araṇassa dhammassa hetupaccayena paccayo… satta."
    ],
    "innerText": "Nasanidassanasappaṭigho naaraṇo ca naanidassanasappaṭigho naaraṇo ca dhammā sanidassanasappaṭighassa araṇassa dhammassa hetupaccayena paccayo… satta."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "116"
      },
      ". Nasanidassanasappaṭigho ",
      " naaraṇo dhammo anidassanaappaṭighassa araṇassa dhammassa ārammaṇapaccayena paccayo. Naanidassanasappaṭigho naaraṇo dhammo anidassanaappaṭighassa araṇassa dhammassa ārammaṇapaccayena paccayo. Nasanidassanasappaṭigho naaraṇo ca naanidassanasappaṭigho naaraṇo ca dhammā anidassanaappaṭighassa araṇassa dhammassa ārammaṇapaccayena paccayo."
    ],
    "innerText": "116. Nasanidassanasappaṭigho naaraṇo dhammo anidassanaappaṭighassa araṇassa dhammassa ārammaṇapaccayena paccayo. Naanidassanasappaṭigho naaraṇo dhammo anidassanaappaṭighassa araṇassa dhammassa ārammaṇapaccayena paccayo. Nasanidassanasappaṭigho naaraṇo ca naanidassanasappaṭigho naaraṇo ca dhammā anidassanaappaṭighassa araṇassa dhammassa ārammaṇapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "117"
      },
      ". Hetuyā ekavīsa, ārammaṇe tīṇi…pe… avigate ekavīsa."
    ],
    "innerText": "117. Hetuyā ekavīsa, ārammaṇe tīṇi…pe… avigate ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Yathā kusalattike pañhāvārassa anulomampi paccanīyampi anulomapaccanīyampi paccanīyānulomampi gaṇitaṃ, evaṃ gaṇetabbaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhammapaccanīyānulome tikadukapaṭṭhānaṃ niṭṭhitaṃ."
  }
]