[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Ganthārambhakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Paramanipuṇavicittanayasamannāgataṃ ",
      " sakasamayasamayantaragahanaviggāhaṇasamatthaṃ suvimalavipulapaññāveyyattiyajananaṃ pakaraṇamidamārabhantoyamācariyo paṭhamaṃ tāva ratanattayappaṇāmakaraṇena antarāyanivāraṇañceva paññāpāṭavañca pattheti. Ratanattayappaṇāmo hi atthato paṇāmakiriyābhinipphādikā kusalacetanā. Sā ca vandaneyyavandakānaṃ khettajjhāsayasampadāhi diṭṭhadhammavedanīyabhūtā yathāladdhasampattinimittakassa kammassa anubalappadānavasena tannibbattitavipākasantatiyā antarāyakarāni upapīḷakaupacchedakakammāni paṭibāhitvā tannidānānaṃ yathādhippetasiddhivibandhakānaṃ rogādiantarāyānamappavattiṃ sādheti, rāgādimalavikkhālanena ca cittasantānaṃ parisodhetvā tannissitāya paññāya yathādhippetasiddhisampādakaṃ tikkhavisadabhāvamāvahati. Kiñci āciṇṇametaṃ paṇḍitānaṃ, yadidaṃ ganthasamārambhe ratanattayappaṇāmakaraṇaṃ, tasmā sappurisācārānurakkhaṇatthañca ādimhi ratanattayavandanā āraddhāti evamādinā aññānipi bahūni payojanāni niddhāretabbāni. Tāni pana tattha tattha bahudhā vitthāritānīti taṃ papañcaparissamaṃ ṭhapetvā yathānuppattameva tāva vaṇṇayissāma."
    ],
    "innerText": "1. Paramanipuṇavicittanayasamannāgataṃ sakasamayasamayantaragahanaviggāhaṇasamatthaṃ suvimalavipulapaññāveyyattiyajananaṃ pakaraṇamidamārabhantoyamācariyo paṭhamaṃ tāva ratanattayappaṇāmakaraṇena antarāyanivāraṇañceva paññāpāṭavañca pattheti. Ratanattayappaṇāmo hi atthato paṇāmakiriyābhinipphādikā kusalacetanā. Sā ca vandaneyyavandakānaṃ khettajjhāsayasampadāhi diṭṭhadhammavedanīyabhūtā yathāladdhasampattinimittakassa kammassa anubalappadānavasena tannibbattitavipākasantatiyā antarāyakarāni upapīḷakaupacchedakakammāni paṭibāhitvā tannidānānaṃ yathādhippetasiddhivibandhakānaṃ rogādiantarāyānamappavattiṃ sādheti, rāgādimalavikkhālanena ca cittasantānaṃ parisodhetvā tannissitāya paññāya yathādhippetasiddhisampādakaṃ tikkhavisadabhāvamāvahati. Kiñci āciṇṇametaṃ paṇḍitānaṃ, yadidaṃ ganthasamārambhe ratanattayappaṇāmakaraṇaṃ, tasmā sappurisācārānurakkhaṇatthañca ādimhi ratanattayavandanā āraddhāti evamādinā aññānipi bahūni payojanāni niddhāretabbāni. Tāni pana tattha tattha bahudhā vitthāritānīti taṃ papañcaparissamaṃ ṭhapetvā yathānuppattameva tāva vaṇṇayissāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca ratanattayappaṇāmaṃ kattukāmo tathāgatamūlakattā sesaratanānaṃ paṭhamaṃ tāva tathāgatassa ",
      " thomanāpubbaṅgamaṃ paṇāmamārabhanto āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘anantakaruṇāpañña’’"
      },
      "ntiādi. Thomanāpubbaṅgamena hi paṇāmena satthu guṇātisayayogo, tato cassa anuttaravandanīyabhāvo, tena ca attano vandanāya khettaṅgatabhāvo, khettaṅgatāya ca vandanāya yathādhippetanipphattiyā hetubhāvo ca dassito hoti."
    ],
    "innerText": "Ettha ca ratanattayappaṇāmaṃ kattukāmo tathāgatamūlakattā sesaratanānaṃ paṭhamaṃ tāva tathāgatassa thomanāpubbaṅgamaṃ paṇāmamārabhanto āha ‘‘anantakaruṇāpañña’’ntiādi. Thomanāpubbaṅgamena hi paṇāmena satthu guṇātisayayogo, tato cassa anuttaravandanīyabhāvo, tena ca attano vandanāya khettaṅgatabhāvo, khettaṅgatāya ca vandanāya yathādhippetanipphattiyā hetubhāvo ca dassito hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vanditvā"
      },
      "ti pubbakālakiriyāniddeso. Tassa pana osānagāthāyaṃ ‘‘pavakkhāmī’’ti iminā aparakālakiriyāvacanena saha sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddha"
      },
      "nti vandanakiriyāya kammaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Anantakaruṇāpañña’’"
      },
      "ntiādikaṃ pana tabbisesanaṃ. Tattha kiratīti karuṇā, paradukkhaṃ vikkhipati apanetīti attho. Kirīyati dukkhitesu pasārīyatīti vā karuṇā. Atha vā karotīti karuṇā, paradukkhe sati sādhūnaṃ kampanaṃ hadayakhedaṃ janayatīti attho. Kiṇātīti vā karuṇā, parassa dukkhaṃ paccayavekallakaraṇato hiṃsatīti attho. Pajānātīti paññā, yathāsabhāvaṃ pakārehi paṭivijjhatīti attho. Karuṇā ca paññā ca karuṇāpaññā, natthi etāsaṃ antoti anantā, anantā karuṇāpaññā etassāti anantakaruṇāpañño, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantakaruṇāpaññaṃ"
      },
      "."
    ],
    "innerText": "Tattha vanditvāti pubbakālakiriyāniddeso. Tassa pana osānagāthāyaṃ ‘‘pavakkhāmī’’ti iminā aparakālakiriyāvacanena saha sambandho. Buddhanti vandanakiriyāya kammaniddeso. ‘‘Anantakaruṇāpañña’’ntiādikaṃ pana tabbisesanaṃ. Tattha kiratīti karuṇā, paradukkhaṃ vikkhipati apanetīti attho. Kirīyati dukkhitesu pasārīyatīti vā karuṇā. Atha vā karotīti karuṇā, paradukkhe sati sādhūnaṃ kampanaṃ hadayakhedaṃ janayatīti attho. Kiṇātīti vā karuṇā, parassa dukkhaṃ paccayavekallakaraṇato hiṃsatīti attho. Pajānātīti paññā, yathāsabhāvaṃ pakārehi paṭivijjhatīti attho. Karuṇā ca paññā ca karuṇāpaññā, natthi etāsaṃ antoti anantā, anantā karuṇāpaññā etassāti anantakaruṇāpañño, taṃ anantakaruṇāpaññaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha ca uppādavayantatāvasena ceva santatipariyosānavasena ca satipi bhagavato karuṇāpaññānaṃ sapariyantabhāve anantārammaṇesu pavattanato anantatā veditabbā. Sammāsambuddhassa hi sabbasattānaṃ dukkhāpanayanākārappavattā anaññasādhāraṇā mahākaruṇā kañci sattaṃ avajjetvā sabbesu sattesu niravasesena pavattati, tathā sabbadhammasabhāvabodhanasamatthā sabbaññutaññāṇasaṅkhātā paññāpi sakalañeyyadhammesu anavasesato pavattati, tasmā anantārammaṇappavattakaruṇāñāṇavantatāya anantakaruṇāpañño bhagavā. Karuṇāpaññāggahaṇena cettha bhagavato sabbalokiyalokuttaraguṇasampatti dassitā hoti. Tathā hi karuṇāggahaṇena lokiyesu mahaggatabhāvappattāsādhāraṇaguṇadīpanato sakalalokiyaguṇasampatti dassitā, paññāggahaṇena sabbaññutaññāṇapadaṭṭhānamaggañāṇadīpanato sabbalokuttaraguṇasampatti dassitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica ",
      " sabbabuddhaguṇānaṃ karuṇā ādi, paññā pariyosānaṃ. Mahākaruṇāsañcoditamānaso hi bhagavā saṃsārapaṅkato sattānaṃ samuddharaṇatthāya katābhinīhāro anupubbena pāramiyo pūretvā anuttarasammāsambodhiyā adhigamena sakalabuddhaguṇe paṭilabhi. Iti ",
      " sakalabuddhaguṇānaṃ tannidānabhāvato karuṇā sabbabuddhaguṇānamādi, sabbaññutaññāṇapadaṭṭhānassa pana maggañāṇassa paṭilabhanato uttarikaraṇīyābhāvato paññā pariyosānaṃ. Ādipariyosānadassanena ca sakalabuddhaguṇā nayato dassitā honti. Nayaggāho eva hi sabbabuddhaguṇānaṃ dassanupāyo, itarathā tādisassa sabbaññubuddhassapi vacanapathātītaṃ tathāgataguṇaṃ anupadaṃ vaṇṇento ko nāma pariyosānamāharituṃ sakkuṇeyyāti."
    ],
    "innerText": "Apica sabbabuddhaguṇānaṃ karuṇā ādi, paññā pariyosānaṃ. Mahākaruṇāsañcoditamānaso hi bhagavā saṃsārapaṅkato sattānaṃ samuddharaṇatthāya katābhinīhāro anupubbena pāramiyo pūretvā anuttarasammāsambodhiyā adhigamena sakalabuddhaguṇe paṭilabhi. Iti sakalabuddhaguṇānaṃ tannidānabhāvato karuṇā sabbabuddhaguṇānamādi, sabbaññutaññāṇapadaṭṭhānassa pana maggañāṇassa paṭilabhanato uttarikaraṇīyābhāvato paññā pariyosānaṃ. Ādipariyosānadassanena ca sakalabuddhaguṇā nayato dassitā honti. Nayaggāho eva hi sabbabuddhaguṇānaṃ dassanupāyo, itarathā tādisassa sabbaññubuddhassapi vacanapathātītaṃ tathāgataguṇaṃ anupadaṃ vaṇṇento ko nāma pariyosānamāharituṃ sakkuṇeyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ karuṇāpaññāmukhena saṅkhepato sakalabuddhaguṇehi bhagavantaṃ thometvāpi puna attano buddhaguṇasaṃkittane atittābhāvena ceva paresañca pasādabāhullajananatthaṃ tadantogadhepi visiṭṭhaguṇe padhānabhāvena nīharitvā dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tathāgata’’"
      },
      "ntiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tathāgata’’"
      },
      "nti tathā āgatatādīhi aṭṭhahi kāraṇehi tathāgataṃ. Vuttañhetaṃ (dī. ni. aṭṭha. 1.7; ma. ni. aṭṭha. 1.12; bu. vaṃ. aṭṭha. 1.2 nidānakathā; a. ni. aṭṭha. 1.1.170) –"
    ],
    "innerText": "Evaṃ karuṇāpaññāmukhena saṅkhepato sakalabuddhaguṇehi bhagavantaṃ thometvāpi puna attano buddhaguṇasaṃkittane atittābhāvena ceva paresañca pasādabāhullajananatthaṃ tadantogadhepi visiṭṭhaguṇe padhānabhāvena nīharitvā dassento āha ‘‘tathāgata’’ntiādi. Tattha ‘‘tathāgata’’nti tathā āgatatādīhi aṭṭhahi kāraṇehi tathāgataṃ. Vuttañhetaṃ (dī. ni. aṭṭha. 1.7; ma. ni. aṭṭha. 1.12; bu. vaṃ. aṭṭha. 1.2 nidānakathā; a. ni. aṭṭha. 1.1.170) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Aṭṭhahi kāraṇehi bhagavā tathāgato, tathā āgatoti tathāgato, tathā gatoti tathāgato, tathalakkhaṇaṃ āgatoti tathāgato, tathadhamme yāthāvato abhisambuddhoti tathāgato, tathadassitāya tathāgato, tathavāditāya tathāgato, tathākāritāya tathāgato, abhibhavanaṭṭhena tathāgato’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Kathaṃ ",
      " bhagavā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathā āgatoti tathāgato"
      },
      "? Yathā sabbalokahitāya ussukkamāpannā purimakā sammāsambuddhā āgatā, kiṃ vuttaṃ hoti? Manussattādiaṭṭhaṅgasamannāgatena yena abhinīhārena te bhagavanto āgatā, teneva ca abhinīhārena ayampi bhagavā āgato, yathā ca te bhagavanto samatiṃsa pāramiyo pūretvā pañcamahāpariccāgādīni sampādetvā āgatā, yathā ca te sattatiṃsa bodhipakkhiyadhamme bhāvetvā brūhetvā āgatā, tathā ayampi bhagavā āgatoti evaṃ tāva tathā āgato’’ti tathāgato. (1)"
    ],
    "innerText": "‘‘Kathaṃ bhagavā tathā āgatoti tathāgato? Yathā sabbalokahitāya ussukkamāpannā purimakā sammāsambuddhā āgatā, kiṃ vuttaṃ hoti? Manussattādiaṭṭhaṅgasamannāgatena yena abhinīhārena te bhagavanto āgatā, teneva ca abhinīhārena ayampi bhagavā āgato, yathā ca te bhagavanto samatiṃsa pāramiyo pūretvā pañcamahāpariccāgādīni sampādetvā āgatā, yathā ca te sattatiṃsa bodhipakkhiyadhamme bhāvetvā brūhetvā āgatā, tathā ayampi bhagavā āgatoti evaṃ tāva tathā āgato’’ti tathāgato. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathā gatoti tathāgato"
      },
      "? Yathā sampatijātā te bhagavanto sattapadavītihārena gatā, yathā vā te samathavipassanāmaggehi taṃ taṃ akusalapakkhaṃ vidhamitvā gatā, tathā ayampi bhagavā gato, evaṃ tathā gatoti tathāgato. (2)"
    ],
    "innerText": "‘‘Kathaṃ tathā gatoti tathāgato? Yathā sampatijātā te bhagavanto sattapadavītihārena gatā, yathā vā te samathavipassanāmaggehi taṃ taṃ akusalapakkhaṃ vidhamitvā gatā, tathā ayampi bhagavā gato, evaṃ tathā gatoti tathāgato. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathalakkhaṇaṃ āgatoti tathāgato"
      },
      "? Yasmā tesaṃ tesaṃ dhammānaṃ yaṃ sabhāvasarasalakkhaṇaṃ tathaṃ avitathaṃ, tañcesa tathalakkhaṇaṃ āgato yāthāvato adhigato, tasmā tathalakkhaṇaṃ āgatoti tathāgato gamanatthānaṃ bujjhanatthasambhavato. Tathā hi vadanti ‘ye gatiatthā, te bujjhanatthā. Ye bujjhanatthā, te gatiatthā’ti. (3)"
    ],
    "innerText": "‘‘Kathaṃ tathalakkhaṇaṃ āgatoti tathāgato? Yasmā tesaṃ tesaṃ dhammānaṃ yaṃ sabhāvasarasalakkhaṇaṃ tathaṃ avitathaṃ, tañcesa tathalakkhaṇaṃ āgato yāthāvato adhigato, tasmā tathalakkhaṇaṃ āgatoti tathāgato gamanatthānaṃ bujjhanatthasambhavato. Tathā hi vadanti ‘ye gatiatthā, te bujjhanatthā. Ye bujjhanatthā, te gatiatthā’ti. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathadhamme yāthāvato abhisambuddhoti tathāgato"
      },
      "? Yasmā ‘idaṃ dukkhanti, bhikkhave, tathametaṃ avitathameta’ntiādivacanato (saṃ. ni. 5.1090) ‘avijjāya saṅkhārānaṃ ",
      " paccayaṭṭho saṅkhārānaṃ avijjāpaccayasambhūtasamudāgataṭṭho tatho avitatho anaññatho’tiādivacanato ca tathadhammasaṅkhāte saccapaṭiccasamuppāde yāthāvato āgato abhisambuddho, tasmā tathadhamme yāthāvato abhisambuddhoti tathāgato. (4)"
    ],
    "innerText": "‘‘Kathaṃ tathadhamme yāthāvato abhisambuddhoti tathāgato? Yasmā ‘idaṃ dukkhanti, bhikkhave, tathametaṃ avitathameta’ntiādivacanato (saṃ. ni. 5.1090) ‘avijjāya saṅkhārānaṃ paccayaṭṭho saṅkhārānaṃ avijjāpaccayasambhūtasamudāgataṭṭho tatho avitatho anaññatho’tiādivacanato ca tathadhammasaṅkhāte saccapaṭiccasamuppāde yāthāvato āgato abhisambuddho, tasmā tathadhamme yāthāvato abhisambuddhoti tathāgato. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathadassitāya tathāgato"
      },
      "? Yasmā aparimāṇāsu lokadhātūsu aparimāṇānaṃ sattānaṃ chadvāraggahite ārammaṇe aviparītameva passati jānāti, ñatvā ca panevaṃ ‘katamaṃ taṃ rūpāyatanaṃ, yaṃ catunnaṃ mahābhūtānaṃ upādāyā’tiādinā (dha. sa. 616 ādayo) tathamesa aviparītaṃ vibhajati dasseti, tasmā tathaṃ āgacchati passati jānāti, taṃ vā āgamayati dassetīti tathāgatoti evaṃ tathadassitāya tathāgato. (5)"
    ],
    "innerText": "‘‘Kathaṃ tathadassitāya tathāgato? Yasmā aparimāṇāsu lokadhātūsu aparimāṇānaṃ sattānaṃ chadvāraggahite ārammaṇe aviparītameva passati jānāti, ñatvā ca panevaṃ ‘katamaṃ taṃ rūpāyatanaṃ, yaṃ catunnaṃ mahābhūtānaṃ upādāyā’tiādinā (dha. sa. 616 ādayo) tathamesa aviparītaṃ vibhajati dasseti, tasmā tathaṃ āgacchati passati jānāti, taṃ vā āgamayati dassetīti tathāgatoti evaṃ tathadassitāya tathāgato. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathavāditāya tathāgato"
      },
      "? Yasmā esa abhisambodhito yāva parinibbānā rāgamadādinimmathanavasena ekasadisameva dhammaṃ tathaṃ avitathaṃ bhāsati, tasmā tathaṃ gadati, tatho aviparīto āgadovacanametassāti vā da-kārassa ta-kāraṃ katvā tathāgatoti vuttoti evaṃ tathavāditāya tathāgato. (6)"
    ],
    "innerText": "‘‘Kathaṃ tathavāditāya tathāgato? Yasmā esa abhisambodhito yāva parinibbānā rāgamadādinimmathanavasena ekasadisameva dhammaṃ tathaṃ avitathaṃ bhāsati, tasmā tathaṃ gadati, tatho aviparīto āgadovacanametassāti vā da-kārassa ta-kāraṃ katvā tathāgatoti vuttoti evaṃ tathavāditāya tathāgato. (6)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathākāritāya tathāgato"
      },
      "? Bhagavā hi ‘yathā vādī tathā kārī’ti (a. ni. 4.23; cūḷani. posālamāṇavapucchāniddesa 83) vacanato attano vācāya anurūpameva karoti, tasmā yathā vācā, tathā kāyopi gato pavatto imassāti tathāgatoti evaṃ tathākāritāya tathāgato. (7)"
    ],
    "innerText": "‘‘Kathaṃ tathākāritāya tathāgato? Bhagavā hi ‘yathā vādī tathā kārī’ti (a. ni. 4.23; cūḷani. posālamāṇavapucchāniddesa 83) vacanato attano vācāya anurūpameva karoti, tasmā yathā vācā, tathā kāyopi gato pavatto imassāti tathāgatoti evaṃ tathākāritāya tathāgato. (7)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhibhavanaṭṭhena tathāgato"
      },
      "? Yasmā panesa anupamāya sakalalokiyalokuttaraguṇasampadāya ",
      " samannāgatattā sadevakaṃ lokaṃ abhibhuyya pavattati, tasmā abhibhavanaṭṭhena tathāgatoti vuccatī’’ti."
    ],
    "innerText": "‘‘Kathaṃ abhibhavanaṭṭhena tathāgato? Yasmā panesa anupamāya sakalalokiyalokuttaraguṇasampadāya samannāgatattā sadevakaṃ lokaṃ abhibhuyya pavattati, tasmā abhibhavanaṭṭhena tathāgatoti vuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatrevaṃ padasiddhi veditabbā – agado viyāti agado, desanāvilāso ceva puññussayo ca. Tena hesa mahānubhāvo bhisakko viya dibbāgadena sappe sabbaparappavādino, sadevakañca lokaṃ abhibhavati. Iti sabbalokābhibhavane tatho aviparīto yathāvutto agado etassāti da-kārassa ta-kāraṃ katvā tathāgatoti vuccatīti ayamettha saṅkhepo. Vitthāro pana dīghāgamasaṃvaṇṇanādīsu gahetabbo. Āha cettha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yatheva lokamhi vipassiādayo,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sabbaññubhāvaṃ munayo idhāgatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tathā ayaṃ sakyamunīpi āgato,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathāgato"
      },
      " vuccati tena cakkhumā. (dī. ni. aṭṭha. 1.7; ma. ni. aṭṭha. 1.12; a. ni. aṭṭha. 1.1.170; bu. vaṃ. aṭṭha. 1.2 nidānakathā);"
    ],
    "innerText": "Tathāgato vuccati tena cakkhumā. (dī. ni. aṭṭha. 1.7; ma. ni. aṭṭha. 1.12; a. ni. aṭṭha. 1.1.170; bu. vaṃ. aṭṭha. 1.2 nidānakathā);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pahāya kāmādimale yathā gatā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Samādhiñāṇehi vipassiādayo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Mahesino sakyamunī jutindharo,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Tathā gato tena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathāgato"
      },
      " mato."
    ],
    "innerText": "Tathā gato tena tathāgato mato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tathañca dhātvāyatanādilakkhaṇaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sabhāvasāmaññavibhāgabhedato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Sayambhuñāṇena jinoyamāgato,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathāgato"
      },
      " vuccati sakyapuṅgavo."
    ],
    "innerText": "Tathāgato vuccati sakyapuṅgavo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Tathāni ",
      " saccāni samantacakkhunā,"
    ],
    "innerText": "‘‘Tathāni saccāni samantacakkhunā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Tathā idappaccayatā ca sabbaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "children": [
      "Anaññañeyyena ",
      " yato vibhāvitā,"
    ],
    "innerText": "Anaññañeyyena yato vibhāvitā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Yāthāvato tena jino ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathāgato"
      },
      "."
    ],
    "innerText": "Yāthāvato tena jino tathāgato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Anantabhedāsupi lokadhātusu,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Jinassa rūpāyatanādigocare;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Vicittabhede tathameva dassanaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathāgato"
      },
      " tena samantalocano."
    ],
    "innerText": "Tathāgato tena samantalocano."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yato ca dhammaṃ tathameva bhāsati,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Karoti vācāyanulomamattano;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Guṇehi lokaṃ abhibhuyyirīyati,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathāgato"
      },
      " tenapi lokanāyako’’ti. (itivu. aṭṭha. 38; dī. ni. ṭī. 1.7);"
    ],
    "innerText": "Tathāgato tenapi lokanāyako’’ti. (itivu. aṭṭha. 38; dī. ni. ṭī. 1.7);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kenaci guṇena attano visiṭṭhassa kassaci abhāvato natthi etassa uttaroti anuttaro. Bhagavato hi avīcito paṭṭhāya yāva bhavaggaṃ tiriyaṃ aparimāṇāsu lokadhātūsu na koci kenaci guṇena samasamopi atthi, kuto pana uttaritaro. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Rūpe sīle samādhimhi, paññāya ca asādiso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vimuttiyā samasamo, dhammacakkappavattane’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinditvā"
      },
      "ti tīhi vandanāhi tanninnatādivasena namassitvā. Kāyavacīmanodvāravasena hi tisso vandanā. Yathāha ‘‘tisso imā, bhikkhave, vandanā kāyena vandati, vacasā vandati, manasā vandatī’’ti. Tattha buddhādiguṇārammaṇā kāmāvacarakusalakiriyānamaññatarā cetanā kāyaviññattiṃ samuṭṭhāpetvā kāyadvārappavattivasena uppannā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyavandanā"
      },
      "ti vuccati, sāyeva vacīviññattiṃ samuṭṭhāpetvā vacīdvārappavattivasena uppannā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vacīvandanā"
      },
      "ti, ubhayaviññattiyo pana asamuṭṭhāpetvā kevalaṃ ",
      " manodvārappavattivasena uppannā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manovandanā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sirasā"
      },
      "ti uttamaṅgena karaṇabhūtena. Abujjhi, bodhetīti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddho"
      },
      ". Ayañhi catusaccadhamme sayampi abujjhi, parepi bodheti ",
      ", tasmā bujjhanabodhanaṭṭhena ‘‘buddho’’ti vuccati. Yathāha ‘‘bujjhitā saccānīti buddho, bodhetā pajāyāti buddho’’ti (mahāni. 192; cūḷani. pārāyanatthutigāthāniddesa 97; paṭi. ma. 1.162). Atha vā budha-saddassa jāgaraṇavikasanatthesupi pavattanato abujjhi savāsanasammohaniddāya accantaṃ vigato, buddhiyā vikasitavāti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddho"
      },
      ". Bhagavā hi vatthusabhāvadassanavibandhikāya avijjāsaṅkhātāya niddāya ariyamaggañāṇena saha vāsanāya samucchinnattā tato accantaṃ vigato. Paramarucirasirisobhaggasamāgamena vikasitamiva padumaṃ aparimitaguṇagaṇālaṅkatasabbaññutaññāṇasamāgamena vikasito vikāsamanuppatto, tasmā jāgaraṇavikasanatthavasenapi ‘‘buddho’’ti vuccati."
    ],
    "innerText": "Vinditvāti tīhi vandanāhi tanninnatādivasena namassitvā. Kāyavacīmanodvāravasena hi tisso vandanā. Yathāha ‘‘tisso imā, bhikkhave, vandanā kāyena vandati, vacasā vandati, manasā vandatī’’ti. Tattha buddhādiguṇārammaṇā kāmāvacarakusalakiriyānamaññatarā cetanā kāyaviññattiṃ samuṭṭhāpetvā kāyadvārappavattivasena uppannā kāyavandanāti vuccati, sāyeva vacīviññattiṃ samuṭṭhāpetvā vacīdvārappavattivasena uppannā vacīvandanāti, ubhayaviññattiyo pana asamuṭṭhāpetvā kevalaṃ manodvārappavattivasena uppannā manovandanāti. Sirasāti uttamaṅgena karaṇabhūtena. Abujjhi, bodhetīti vā buddho. Ayañhi catusaccadhamme sayampi abujjhi, parepi bodheti , tasmā bujjhanabodhanaṭṭhena ‘‘buddho’’ti vuccati. Yathāha ‘‘bujjhitā saccānīti buddho, bodhetā pajāyāti buddho’’ti (mahāni. 192; cūḷani. pārāyanatthutigāthāniddesa 97; paṭi. ma. 1.162). Atha vā budha-saddassa jāgaraṇavikasanatthesupi pavattanato abujjhi savāsanasammohaniddāya accantaṃ vigato, buddhiyā vikasitavāti vā buddho. Bhagavā hi vatthusabhāvadassanavibandhikāya avijjāsaṅkhātāya niddāya ariyamaggañāṇena saha vāsanāya samucchinnattā tato accantaṃ vigato. Paramarucirasirisobhaggasamāgamena vikasitamiva padumaṃ aparimitaguṇagaṇālaṅkatasabbaññutaññāṇasamāgamena vikasito vikāsamanuppatto, tasmā jāgaraṇavikasanatthavasenapi ‘‘buddho’’ti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā ca dvīhi ākārehi bhagavato thomanā katā hoti attahitasampattito, parahitapaṭipattito ca. Tāsu attahitasampatti anāvaraṇañāṇādhigamo savāsanasakalasaṃkilesānamaccantappahānaṃ anupādisesanibbānādhigamo ca, parahitapaṭipatti pana āsayappayogavasena duvidhaṃ parahitasamīhanaṃ. Tattha dhammadesanāya abhājanesu devadattādīsu virodhisattesupi niccaṃ hitajjhāsayatā aparipākagatindriyānaṃ indriyaparipākakālāgamanañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āsayo"
      },
      " nāma. Tadaññasattānaṃ pana lābhasakkārādinirapekkhacittassa yānattayamukhena sabbadukkhaniyyānikadhammadesanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "payogo"
      },
      " nāma. Duvidhāsu panetāsu parahitapaṭipattīsu, tividhāsu ca attahitasampattīsu anantakaruṇā-vacanena, tathā āgataṭṭhena ca tathāgata-saddena āsayavasena parahitapaṭipatti dassitā, bodhanaṭṭhena buddha-saddena, tathadassanaṭṭhena ",
      " ca tathāgataṭṭhena ca tathāgatasaddena payogavasena, anantapaññā-vacanena, ñāṇagatidīpakena tathāgata-saddena, bujjhanajāgaraṇavikasanaṭṭhena ca buddha-saddena tividhāpi attahitasampatti, anuttaravacanena ca attahitaparahitasampatti pakāsitāti veditabbā."
    ],
    "innerText": "Ettāvatā ca dvīhi ākārehi bhagavato thomanā katā hoti attahitasampattito, parahitapaṭipattito ca. Tāsu attahitasampatti anāvaraṇañāṇādhigamo savāsanasakalasaṃkilesānamaccantappahānaṃ anupādisesanibbānādhigamo ca, parahitapaṭipatti pana āsayappayogavasena duvidhaṃ parahitasamīhanaṃ. Tattha dhammadesanāya abhājanesu devadattādīsu virodhisattesupi niccaṃ hitajjhāsayatā aparipākagatindriyānaṃ indriyaparipākakālāgamanañca āsayo nāma. Tadaññasattānaṃ pana lābhasakkārādinirapekkhacittassa yānattayamukhena sabbadukkhaniyyānikadhammadesanā payogo nāma. Duvidhāsu panetāsu parahitapaṭipattīsu, tividhāsu ca attahitasampattīsu anantakaruṇā-vacanena, tathā āgataṭṭhena ca tathāgata-saddena āsayavasena parahitapaṭipatti dassitā, bodhanaṭṭhena buddha-saddena, tathadassanaṭṭhena ca tathāgataṭṭhena ca tathāgatasaddena payogavasena, anantapaññā-vacanena, ñāṇagatidīpakena tathāgata-saddena, bujjhanajāgaraṇavikasanaṭṭhena ca buddha-saddena tividhāpi attahitasampatti, anuttaravacanena ca attahitaparahitasampatti pakāsitāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica hetuphalasattūpakārasampadāvasena tīhākārehipi bhagavato thomanā pavattatīti taṃvasenapettha thomanā daṭṭhabbā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetusampadā"
      },
      " nāma mahākaruṇāsamāyogo, bodhisambhārasambharaṇañca tammūlakattā sakalabuddhaguṇānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phalasampadā"
      },
      " pana catubbidhā ñāṇasampadā, pahānasampadā, ānubhāvasampadā, rūpakāyasampadā cāti. Tāsu sabbaññutaññāṇapadaṭṭhānaṃ maggañāṇaṃ, maggañāṇapadaṭṭhānaṃ sabbaññutaññāṇaṃ, tammūlakāni ca dasabalādiñāṇāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñāṇasampadā"
      },
      " nāma. Aggamaggabhāvanāya sabbakilesānaṃ saha vāsanāhi anuppattidhammatāpādanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pahānasampadā"
      },
      ". Acinteyyāparimitānaṃ sabbalokahitānaṃ nipphādane, sadevakalokābhibhavane ca ādhipaccaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānubhāvasampadā"
      },
      ". Sakalalokanayanābhisekabhūtā pana lakkhaṇānubyañjanapaṭimaṇḍitā attabhāvasampatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpakāyasampadā"
      },
      " nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattūpakāro"
      },
      " heṭṭhā vuttaparahitapaṭipattivaseneva veditabbo. Imāsu pana anantakaruṇā-vacanena, tathā āgataṭṭhena ca tathāgata-saddena hetusampadā dassitā. Phalasampadāsu ñāṇasampadā ceva pahānasampadā ca anantapaññā-vacanena, abhisamayaparidīpakena tathāgatasaddena, bujjhanajāgaraṇavikasanaṭṭhena, ca buddha-saddena dassitā, ānubhāvasampadāpi abhibhavanaṭṭhena tathāgata-saddena, anuttara-vacanena ca vibhāvitā, rūpakāyasampadā pana rūpaggappattidīpakena anuttara-saddena dassitāti daṭṭhabbaṃ."
    ],
    "innerText": "Apica hetuphalasattūpakārasampadāvasena tīhākārehipi bhagavato thomanā pavattatīti taṃvasenapettha thomanā daṭṭhabbā. Tattha hetusampadā nāma mahākaruṇāsamāyogo, bodhisambhārasambharaṇañca tammūlakattā sakalabuddhaguṇānaṃ. Phalasampadā pana catubbidhā ñāṇasampadā, pahānasampadā, ānubhāvasampadā, rūpakāyasampadā cāti. Tāsu sabbaññutaññāṇapadaṭṭhānaṃ maggañāṇaṃ, maggañāṇapadaṭṭhānaṃ sabbaññutaññāṇaṃ, tammūlakāni ca dasabalādiñāṇāni ñāṇasampadā nāma. Aggamaggabhāvanāya sabbakilesānaṃ saha vāsanāhi anuppattidhammatāpādanaṃ pahānasampadā. Acinteyyāparimitānaṃ sabbalokahitānaṃ nipphādane, sadevakalokābhibhavane ca ādhipaccaṃ ānubhāvasampadā. Sakalalokanayanābhisekabhūtā pana lakkhaṇānubyañjanapaṭimaṇḍitā attabhāvasampatti rūpakāyasampadā nāma. Sattūpakāro heṭṭhā vuttaparahitapaṭipattivaseneva veditabbo. Imāsu pana anantakaruṇā-vacanena, tathā āgataṭṭhena ca tathāgata-saddena hetusampadā dassitā. Phalasampadāsu ñāṇasampadā ceva pahānasampadā ca anantapaññā-vacanena, abhisamayaparidīpakena tathāgatasaddena, bujjhanajāgaraṇavikasanaṭṭhena, ca buddha-saddena dassitā, ānubhāvasampadāpi abhibhavanaṭṭhena tathāgata-saddena, anuttara-vacanena ca vibhāvitā, rūpakāyasampadā pana rūpaggappattidīpakena anuttara-saddena dassitāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " buddharatanassa thomanāpubbaṅgamaṃ paṇāmaṃ katvā idāni sesaratanānampi paṇāmamārabhanto āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dhammaṃ sādhugaṇampi cā’’"
      },
      "ti. Bhagavato thomanena ca svākkhātatādayo dhammaguṇā, suppaṭipannatādayo saṅghaguṇā ca dassitā honti tappabhavassa anaññathābhāvatoti na tesaṃ visuṃ thomanā katā. Adhigatamagge sacchikatanirodhe puggale yathānusiṭṭhaṃ paṭipajjamāne ca apāyadukkhesu ceva vaṭṭadukkhesu ca apatamāne katvā dhāretīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammo,"
      },
      " so catunnaṃ ariyamaggānaṃ, catunnañca sāmaññaphalānaṃ, nibbānassa, pariyattidhammassa ca vasena dasavidho. Vuttañhetaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chattavimāne"
      },
      " –"
    ],
    "innerText": "Evaṃ buddharatanassa thomanāpubbaṅgamaṃ paṇāmaṃ katvā idāni sesaratanānampi paṇāmamārabhanto āha ‘‘dhammaṃ sādhugaṇampi cā’’ti. Bhagavato thomanena ca svākkhātatādayo dhammaguṇā, suppaṭipannatādayo saṅghaguṇā ca dassitā honti tappabhavassa anaññathābhāvatoti na tesaṃ visuṃ thomanā katā. Adhigatamagge sacchikatanirodhe puggale yathānusiṭṭhaṃ paṭipajjamāne ca apāyadukkhesu ceva vaṭṭadukkhesu ca apatamāne katvā dhāretīti dhammo, so catunnaṃ ariyamaggānaṃ, catunnañca sāmaññaphalānaṃ, nibbānassa, pariyattidhammassa ca vasena dasavidho. Vuttañhetaṃ chattavimāne –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Rāgavirāgamanejamasokaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dhammamasaṅkhatamappaṭikūlaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Madhuramimaṃ paguṇaṃ suvibhattaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammamimaṃ saraṇatthamupehī’’ti. (vi. va. 887);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha hi kāmarāgādibhedo sabbopi rāgo virajjati etenāti ‘‘rāgavirāgo’’ti maggo kathito. Ejāsaṅkhātāya taṇhāya, antonijjhānalakkhaṇassa ca sokassa taduppattiyaṃ sabbaso parikkhīṇattā ‘‘anejamasoka’’nti phalaṃ kathitaṃ. Kenaci paccayena asaṅkhatattā ‘‘dhammamasaṅkhata’’nti nibbānaṃ vuttaṃ. Avirodhadīpanato pana atthabyañjanassa sampannatāya, pakaṭṭhaguṇavibhāvanato suṭṭhu vibhajitattā ca ‘‘appaṭikūla’’ntiādinā sabbopi pariyattidhammo kathito. Tattha ariyamagganibbānāni nippariyāyeneva apāyādito dhāraṇato dhammo, phalapariyattiyo ",
      " pana pariyāyena. Tathā hettha dhāraṇaṃ nāma apāyādinibbattakakilesaviddhaṃsanaṃ. Iti ariyamaggassa kilesasamucchedakatāya, nibbānassa ca ālambaṇabhāvena tassa tadatthasiddhihetutāyapi ubhinnampi ",
      " nippariyāyato labbhati. Itaresu pana ariyaphalassa maggena samucchinnakilesānaṃ paṭipassaddhakiccatāya, maggānukūlappavattito pariyattidhammassa ca tadadhigamahetutāyāti ubhinnampi pariyāyatova labbhatīti."
    ],
    "innerText": "Ettha hi kāmarāgādibhedo sabbopi rāgo virajjati etenāti ‘‘rāgavirāgo’’ti maggo kathito. Ejāsaṅkhātāya taṇhāya, antonijjhānalakkhaṇassa ca sokassa taduppattiyaṃ sabbaso parikkhīṇattā ‘‘anejamasoka’’nti phalaṃ kathitaṃ. Kenaci paccayena asaṅkhatattā ‘‘dhammamasaṅkhata’’nti nibbānaṃ vuttaṃ. Avirodhadīpanato pana atthabyañjanassa sampannatāya, pakaṭṭhaguṇavibhāvanato suṭṭhu vibhajitattā ca ‘‘appaṭikūla’’ntiādinā sabbopi pariyattidhammo kathito. Tattha ariyamagganibbānāni nippariyāyeneva apāyādito dhāraṇato dhammo, phalapariyattiyo pana pariyāyena. Tathā hettha dhāraṇaṃ nāma apāyādinibbattakakilesaviddhaṃsanaṃ. Iti ariyamaggassa kilesasamucchedakatāya, nibbānassa ca ālambaṇabhāvena tassa tadatthasiddhihetutāyapi ubhinnampi nippariyāyato labbhati. Itaresu pana ariyaphalassa maggena samucchinnakilesānaṃ paṭipassaddhakiccatāya, maggānukūlappavattito pariyattidhammassa ca tadadhigamahetutāyāti ubhinnampi pariyāyatova labbhatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Attahitaparahitaṃ sādhentīti sādhū, tesaṃ gaṇo samudāyoti sādhugaṇo, sādhu cāyaṃ gaṇo cāti vā sādhugaṇo, sādhuno vā sammāsambuddhassa āyatto gaṇo tassa orasaputtabhāvatoti sādhugaṇo. So pana catunnaṃ ariyamaggasamaṅgīnaṃ, catunnañca phalasamaṅgīnaṃ vasena aṭṭhavidho ariyasaṅgho, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sādhugaṇaṃ. Picā"
      },
      "ti nipātasamudāyo, eko vā nipāto, tiṇṇaṃ ratanānaṃ vandanakiriyāya sampiṇḍanattho. Keci ‘‘gaṇo’’ti idha pakaraṇatova ariyagaṇapuggalova labbhatīti sādhūti bhāvanapuṃsakavasena ‘‘vanditvā’’ti iminā saha yojenti, tadā pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sādhū"
      },
      "ti bhayalābhādivirahena sakkaccaṃ ādaranti attho."
    ],
    "innerText": "Attahitaparahitaṃ sādhentīti sādhū, tesaṃ gaṇo samudāyoti sādhugaṇo, sādhu cāyaṃ gaṇo cāti vā sādhugaṇo, sādhuno vā sammāsambuddhassa āyatto gaṇo tassa orasaputtabhāvatoti sādhugaṇo. So pana catunnaṃ ariyamaggasamaṅgīnaṃ, catunnañca phalasamaṅgīnaṃ vasena aṭṭhavidho ariyasaṅgho, taṃ sādhugaṇaṃ. Picāti nipātasamudāyo, eko vā nipāto, tiṇṇaṃ ratanānaṃ vandanakiriyāya sampiṇḍanattho. Keci ‘‘gaṇo’’ti idha pakaraṇatova ariyagaṇapuggalova labbhatīti sādhūti bhāvanapuṃsakavasena ‘‘vanditvā’’ti iminā saha yojenti, tadā pana sādhūti bhayalābhādivirahena sakkaccaṃ ādaranti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Evaṃ pakaraṇārambhe yathādhippetaṃ ratanattayappaṇāmaṃ katvā idāni yattha pāṭavatthāya idaṃ pakaraṇaṃ paṭṭhapīyati, taṃ saddhiṃ desakadesapaṭiggāhakasampattīhi vibhāvetvā dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paṇḍukambalanāmāyā’’"
      },
      "tiādi. Tattha devarājassa paṇḍukambalanāmāya silāya vimale sītale tale nisinno atulavikkamo devadevehi pūjito devadevo devapurakkhato devānaṃ devalokasmiṃ yaṃ dhammaṃ desesīti sambandho."
    ],
    "innerText": "2. Evaṃ pakaraṇārambhe yathādhippetaṃ ratanattayappaṇāmaṃ katvā idāni yattha pāṭavatthāya idaṃ pakaraṇaṃ paṭṭhapīyati, taṃ saddhiṃ desakadesapaṭiggāhakasampattīhi vibhāvetvā dassento āha ‘‘paṇḍukambalanāmāyā’’tiādi. Tattha devarājassa paṇḍukambalanāmāya silāya vimale sītale tale nisinno atulavikkamo devadevehi pūjito devadevo devapurakkhato devānaṃ devalokasmiṃ yaṃ dhammaṃ desesīti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayaṃ panettha attho – paṇḍukambalasarikkhavaṇṇatāya ‘‘paṇḍukambala’’nti nāmaṃ samaññā etissāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇḍukambalanāmā"
      },
      ". Sā hi sakkassa tādisapuññānubhāvena nibbattā paṇḍukambalajayasumanapupphasamānena vaṇṇena sabbakālaṃ virocati ",
      ", pamāṇato pana saṭṭhiyojanāyāmā, paññāsayojanavitthārā, pannarasayojanubbedhā ca hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Silāyā"
      },
      "ti avayavasambandhe sāmivacanaṃ. Tulāya sammito tulyo, na tulyo atulyo, atulyo vikkamo balaṃ etassāti atulyavikkamo. Sammāsambuddhassa hi paramapāramitānubhāvasaṃsiddhena hatthigaṇanāya koṭisahassahatthīnaṃ, purisagaṇanāya dasakoṭisahassapurisānaṃ balehi samappamāṇena kāyabalena, appamāṇena ca ñāṇabalena na kassaci devabrahmādīsu aññatarassa balatulanāya upanetabbaṃ atthi ",
      ". Atha vā anaññasādhāraṇattā atulyo parakkamasaṅkhāto aparimāṇaguṇavisesāvahena anaññasādhāraṇena sammappadhānena samannāgatattā vā atulyo sammappadhānasaṅkhāto vikkamo imassāti atulyavikkamo. ‘‘Atulyavikkamo’’ti ca vattabbe gāthābandhavasena ya-kāralopaṃ katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atulavikkamo’’"
      },
      "ti vuttaṃ. Atha vā sammitatthe a-kārapaccayassāpi sambhavato atulo vikkamo assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atulavikkamo’’"
      },
      "ti vuttaṃ."
    ],
    "innerText": "Ayaṃ panettha attho – paṇḍukambalasarikkhavaṇṇatāya ‘‘paṇḍukambala’’nti nāmaṃ samaññā etissāti paṇḍukambalanāmā. Sā hi sakkassa tādisapuññānubhāvena nibbattā paṇḍukambalajayasumanapupphasamānena vaṇṇena sabbakālaṃ virocati , pamāṇato pana saṭṭhiyojanāyāmā, paññāsayojanavitthārā, pannarasayojanubbedhā ca hoti. Silāyāti avayavasambandhe sāmivacanaṃ. Tulāya sammito tulyo, na tulyo atulyo, atulyo vikkamo balaṃ etassāti atulyavikkamo. Sammāsambuddhassa hi paramapāramitānubhāvasaṃsiddhena hatthigaṇanāya koṭisahassahatthīnaṃ, purisagaṇanāya dasakoṭisahassapurisānaṃ balehi samappamāṇena kāyabalena, appamāṇena ca ñāṇabalena na kassaci devabrahmādīsu aññatarassa balatulanāya upanetabbaṃ atthi . Atha vā anaññasādhāraṇattā atulyo parakkamasaṅkhāto aparimāṇaguṇavisesāvahena anaññasādhāraṇena sammappadhānena samannāgatattā vā atulyo sammappadhānasaṅkhāto vikkamo imassāti atulyavikkamo. ‘‘Atulyavikkamo’’ti ca vattabbe gāthābandhavasena ya-kāralopaṃ katvā ‘‘atulavikkamo’’ti vuttaṃ. Atha vā sammitatthe a-kārapaccayassāpi sambhavato atulo vikkamo assāti ‘‘atulavikkamo’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dibbantīti devā, pañcakāmaguṇādīhi kīḷanti, tesu vā viharanti, vijayasamatthatāyogena bāhirabbhantarike paccatthike vijetuṃ icchanti, issariyadhanādisakkāradānaggahaṇaṃ, taṃtaṃatthānusāsanañca karontā voharanti, puññañāṇānubhāvappattāya jutiyā jotenti, yathādhippetañca visayaṃ appaṭighātena gacchanti, yathicchitanipphādane ca sakkontīti attho. Atha vā devanīyā taṃtaṃbyasananittharaṇatthikehi ‘‘saraṇaṃ parāyaṇa’’nti gamanīyā, abhitthavanīyā sobhāvisesayogena kamanīyāti vā devā, te tividhā – sammutidevā upapattidevā visuddhidevāti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammutidevā"
      },
      " nāma mahāsammatādayo khattiyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upapattidevā"
      },
      " nāma ",
      " cātumahārājike upādāya taduttaridevā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visuddhidevā"
      },
      " nāma khīṇāsavā. Idha pana upapattidevā daṭṭhabbā. No ca kho tepi avisesena, ṭhapetvā pana yāmādike cātumahārājikatāvatiṃsavāsinova adhippetā. Tesaṃ catūhi saṅgahavatthūhi rañjanato rājā, devānaṃ rājā issaro devarājā, tassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "devarājassa,"
      },
      " ‘‘sakkassa devarañño’’ti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      " hi aññesaṃ devalokesu nisinno bhagavā abhidhammapiṭakaṃ desesīti."
    ],
    "innerText": "Dibbantīti devā, pañcakāmaguṇādīhi kīḷanti, tesu vā viharanti, vijayasamatthatāyogena bāhirabbhantarike paccatthike vijetuṃ icchanti, issariyadhanādisakkāradānaggahaṇaṃ, taṃtaṃatthānusāsanañca karontā voharanti, puññañāṇānubhāvappattāya jutiyā jotenti, yathādhippetañca visayaṃ appaṭighātena gacchanti, yathicchitanipphādane ca sakkontīti attho. Atha vā devanīyā taṃtaṃbyasananittharaṇatthikehi ‘‘saraṇaṃ parāyaṇa’’nti gamanīyā, abhitthavanīyā sobhāvisesayogena kamanīyāti vā devā, te tividhā – sammutidevā upapattidevā visuddhidevāti. Tattha sammutidevā nāma mahāsammatādayo khattiyā. Upapattidevā nāma cātumahārājike upādāya taduttaridevā. Visuddhidevā nāma khīṇāsavā. Idha pana upapattidevā daṭṭhabbā. No ca kho tepi avisesena, ṭhapetvā pana yāmādike cātumahārājikatāvatiṃsavāsinova adhippetā. Tesaṃ catūhi saṅgahavatthūhi rañjanato rājā, devānaṃ rājā issaro devarājā, tassa devarājassa, ‘‘sakkassa devarañño’’ti adhippāyo. Na hi aññesaṃ devalokesu nisinno bhagavā abhidhammapiṭakaṃ desesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ya"
      },
      "nti aniyamaniddeso, tassa pana ‘‘tatthā’’ti iminā niyamanaṃ veditabbaṃ. Yathāvuttānaṃ tiṇṇampi devānaṃ uttamo devo tehi sabbehi adhikataraṃ kīḷanādiyogatoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "devadevo,"
      },
      " bhagavā. So hi niratisayāya abhiññākīḷāya uttamehi dibbabrahmaariyavihārehi saparasantānasiddhāya pañcavidhamāravijayicchānibbattiyā cittissariyasattadhanādisammāpaṭipattiaveccappasādasakkāradānaggahaṇasaṅkhātena, yathāparādhayathānulomayathādhammānusāsanasaṅkhātena ca vohārātisayena paramāya paññāya ca sarīrappabhāsaṅkhātāya jutiyā anupamāya ñāṇasarīragatiyā māravijayasabbaññutaññāṇaparahitanipphādanesu appaṭihatāya sattiyā ca samannāgatattā sadevakena vā lokena ‘‘saraṇa’’nti gamanīyato, abhitthavanīyato, bhattivasena kamanīyato ca sabbe te deve tehi tehi guṇehi abhibhuyya ṭhitoti sabbadevehi pūjanīyataro devo ",
      ", visuddhidevabhāvasaṅkhātassa vā sabbaññuguṇālaṅkārassa adhigatattā aññesañca devānaṃ atisayena devoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "devadevo. Devāna"
      },
      "nti tadā dhammapaṭiggāhakānaṃ dasasahassacakkavāḷādhivāsīnaṃ mātudevaputtappamukhānaṃ upapattidevānaṃ. Visuddhidevānampettha gahaṇanti vadanti. Te pana upapattidevesveva saṅgahitā manussaarahantānaṃ tattha abhāvato ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devadevehī"
      },
      "ti visuddhidevehi. Visuddhidevā hi vuttanayena itaradevehi sātisayaṃ kīḷanādiyogato idha ‘‘devadevā’’ti adhippetā, tehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pūjito"
      },
      "ti pūjitabbo, pūjituṃ arahoti attho. Etena visuddhidevesupi bhagavato aggapuggalataṃ dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Desesī"
      },
      "ti madhurakaravīkasaddasadisaṃ brahmassaraṃ nicchārento pakāsesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devalokasmi"
      },
      "nti tāvatiṃsadevaloke. Sabhāvasāmaññalakkhaṇaṃ dhāretīti dhammo, kusalādibhedo abhidhammo, idha pana tappakāsakaṃ abhidhammapiṭakaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dhamma’’"
      },
      "nti vuttaṃ. Tathā hi vakkhati ‘‘piṭakuttame’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devapurakkhato"
      },
      "ti dasasahassacakkavāḷavāsidibbabrahmehi purakkhato, parivāritoti attho."
    ],
    "innerText": "3.Yanti aniyamaniddeso, tassa pana ‘‘tatthā’’ti iminā niyamanaṃ veditabbaṃ. Yathāvuttānaṃ tiṇṇampi devānaṃ uttamo devo tehi sabbehi adhikataraṃ kīḷanādiyogatoti devadevo, bhagavā. So hi niratisayāya abhiññākīḷāya uttamehi dibbabrahmaariyavihārehi saparasantānasiddhāya pañcavidhamāravijayicchānibbattiyā cittissariyasattadhanādisammāpaṭipattiaveccappasādasakkāradānaggahaṇasaṅkhātena, yathāparādhayathānulomayathādhammānusāsanasaṅkhātena ca vohārātisayena paramāya paññāya ca sarīrappabhāsaṅkhātāya jutiyā anupamāya ñāṇasarīragatiyā māravijayasabbaññutaññāṇaparahitanipphādanesu appaṭihatāya sattiyā ca samannāgatattā sadevakena vā lokena ‘‘saraṇa’’nti gamanīyato, abhitthavanīyato, bhattivasena kamanīyato ca sabbe te deve tehi tehi guṇehi abhibhuyya ṭhitoti sabbadevehi pūjanīyataro devo , visuddhidevabhāvasaṅkhātassa vā sabbaññuguṇālaṅkārassa adhigatattā aññesañca devānaṃ atisayena devoti devadevo. Devānanti tadā dhammapaṭiggāhakānaṃ dasasahassacakkavāḷādhivāsīnaṃ mātudevaputtappamukhānaṃ upapattidevānaṃ. Visuddhidevānampettha gahaṇanti vadanti. Te pana upapattidevesveva saṅgahitā manussaarahantānaṃ tattha abhāvato . Devadevehīti visuddhidevehi. Visuddhidevā hi vuttanayena itaradevehi sātisayaṃ kīḷanādiyogato idha ‘‘devadevā’’ti adhippetā, tehi. Pūjitoti pūjitabbo, pūjituṃ arahoti attho. Etena visuddhidevesupi bhagavato aggapuggalataṃ dīpeti. Desesīti madhurakaravīkasaddasadisaṃ brahmassaraṃ nicchārento pakāsesi. Devalokasminti tāvatiṃsadevaloke. Sabhāvasāmaññalakkhaṇaṃ dhāretīti dhammo, kusalādibhedo abhidhammo, idha pana tappakāsakaṃ abhidhammapiṭakaṃ ‘‘dhamma’’nti vuttaṃ. Tathā hi vakkhati ‘‘piṭakuttame’’ti. Devapurakkhatoti dasasahassacakkavāḷavāsidibbabrahmehi purakkhato, parivāritoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nanu ca ‘‘devāna’’nti vacaneneva devapurakkhatabhāvo siddhoti kiṃ ‘‘devapurakkhato’’ti vacanena? Nāyaṃ doso. Bhagavā hi kadāci cūḷapanthakattherādīnaṃ viya parammukhepi nisīditvā obhāsaṃ vissajjetvā sattānaṃ sammukhe nisinnaṃ viya dassento dhammaṃ deseti, kadācipi pārāyanikabrāhmaṇādīnaṃ viya sammukhepi nisīditvā aññehi ca parivuto aññesampi dhammaṃ deseti, idha pana na tathā, devehiyeva parivuto devānaṃ desetīti dassanatthaṃ ‘‘devapurakkhato’’tipi vattabbamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Evametasmiṃ pakaraṇe gāravajananatthaṃ tena sampādetabbapāṭavavisayaṃ abhidhammapiṭakaṃ desakādisampattīhi saha vibhāvetvā idāni yathādhippetapakaraṇārambhapayojanābhidhānābhidheyyasotujanasamussāhanakaraṇappakārāni ca vibhāvetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tatthāha’’"
      },
      "ntiādi vuttaṃ. Tattha ‘‘pāṭavatthāyā’’ti iminā pakaraṇārambhapayojanaṃ vuttaṃ. ‘‘Abhidhammāvatāra’’nti iminā abhidhānābhidheyyāni. ‘‘Madhura’’ntiādīhi pakaraṇaṃ viseseti. ‘‘Samāsenā’’ti ca iminā sotujanasamussāhanakaraṇappakārānīti ",
      " daṭṭhabbaṃ. ‘‘Aha’’nti kattubhūtaṃ attānaṃ niddisati. Tathā hi yo paro na hoti, so niyakajjhattasaṅkhāto attā ‘‘aha’’nti vuccati."
    ],
    "innerText": "4. Evametasmiṃ pakaraṇe gāravajananatthaṃ tena sampādetabbapāṭavavisayaṃ abhidhammapiṭakaṃ desakādisampattīhi saha vibhāvetvā idāni yathādhippetapakaraṇārambhapayojanābhidhānābhidheyyasotujanasamussāhanakaraṇappakārāni ca vibhāvetuṃ ‘‘tatthāha’’ntiādi vuttaṃ. Tattha ‘‘pāṭavatthāyā’’ti iminā pakaraṇārambhapayojanaṃ vuttaṃ. ‘‘Abhidhammāvatāra’’nti iminā abhidhānābhidheyyāni. ‘‘Madhura’’ntiādīhi pakaraṇaṃ viseseti. ‘‘Samāsenā’’ti ca iminā sotujanasamussāhanakaraṇappakārānīti daṭṭhabbaṃ. ‘‘Aha’’nti kattubhūtaṃ attānaṃ niddisati. Tathā hi yo paro na hoti, so niyakajjhattasaṅkhāto attā ‘‘aha’’nti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭuno bhāvo pāṭavaṃ, taṃyeva attho payojanaṭṭhenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāṭavattho,"
      },
      " tadatthāya. Taṃ sandhāya vividhanayaggahaṇasamatthassa ",
      " sutamayañāṇassa uppādanatthanti vuttaṃ hoti. Saṃsāre bhayaṃ ikkhanti, bhindanti vā pāpake akusale dhammeti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhikkhū,"
      },
      " tesaṃ. Piṭakañca taṃ uttamañcāti piṭakuttamaṃ, tasmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "piṭakuttame,"
      },
      " abhidhammapiṭaketi adhippāyo. Tañhi pariyattibhājanatthato piṭakaṃ, tīsu piṭakesu visiṭṭhabhāvato uttamañcāti piṭakuttamaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariyattibhājanatthato"
      },
      "ti pariyattiatthena ceva bhājanatthena ca. Tathā hi ‘‘mā piṭakasampadānenā’’tiādīsu (a. ni. 3.66) pariyatti piṭakanti vuccati. ‘‘Atha puriso āgaccheyya kudālapiṭaka’’ntiādīsu (ma. ni. 1.228; a. ni. 3.70) yaṃ kiñci bhājanampi. Tasmā idampi pariyāpuṇitabbaṭṭhena pariyatti, abhidhammatthānamādhāraṇatthena bhājanañcāti pariyattibhājanatthato piṭakanti vuccati. Tenevāhu –"
    ],
    "innerText": "Paṭuno bhāvo pāṭavaṃ, taṃyeva attho payojanaṭṭhenāti pāṭavattho, tadatthāya. Taṃ sandhāya vividhanayaggahaṇasamatthassa sutamayañāṇassa uppādanatthanti vuttaṃ hoti. Saṃsāre bhayaṃ ikkhanti, bhindanti vā pāpake akusale dhammeti bhikkhū, tesaṃ. Piṭakañca taṃ uttamañcāti piṭakuttamaṃ, tasmiṃ piṭakuttame, abhidhammapiṭaketi adhippāyo. Tañhi pariyattibhājanatthato piṭakaṃ, tīsu piṭakesu visiṭṭhabhāvato uttamañcāti piṭakuttamaṃ. Tattha pariyattibhājanatthatoti pariyattiatthena ceva bhājanatthena ca. Tathā hi ‘‘mā piṭakasampadānenā’’tiādīsu (a. ni. 3.66) pariyatti piṭakanti vuccati. ‘‘Atha puriso āgaccheyya kudālapiṭaka’’ntiādīsu (ma. ni. 1.228; a. ni. 3.70) yaṃ kiñci bhājanampi. Tasmā idampi pariyāpuṇitabbaṭṭhena pariyatti, abhidhammatthānamādhāraṇatthena bhājanañcāti pariyattibhājanatthato piṭakanti vuccati. Tenevāhu –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Piṭakaṃ piṭakatthavidū,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Pariyattibbhājanatthato āhu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tena samodhānetvā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tayopi vinayādayo ñeyyā’’ti. (dī. ni. aṭṭha. 1.paṭhamamahāsaṅgītikathā; pārā. aṭṭha. 1.paṭhamamahāsaṅgītikathā; dha. sa. aṭṭha. nidānakathā);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visiṭṭhabhāvo"
      },
      " panassa lokavohāramatikkamma yathāsabhāvavasena desanato, visiṭṭhadhammakkhandhavibhāvanato ca veditabbo. Ettha hi ‘‘satto puggalo bhikkhū’’tiādikaṃ lokavohāramatikkamma ‘‘khandhadhātuāyatana’’ntiādinā yathādhammavaseneva bāhulladesanā pavattā, na itaresu viya ",
      " yathāvuttavohāravasena, yato idaṃ yathādhammasāsananti vuccati. Sabbasaṅkhatadhammavisiṭṭho cettha paññākkhandho visesato vibhāvito, tasmā tiṇṇampi piṭakānaṃ buddhavacanabhāvepi yathāsabhāvānatikkamadesanādito idameva tīsu piṭakesu visiṭṭhanti yuttaṃ. Apica dhammātirekadhammavisesabhāvato cassa visiṭṭhabhāvo veditabbo. Abhidhamme hi nippadesato khandhāyatanādidhammānaṃ vibhattattā itaradvayato atirekatarā, visiṭṭhā ca pāḷi hoti, tasmā atirekassa, visiṭṭhassa ca pāḷidhammassa vasena idameva tīsu piṭakesu uttamanti vattuṃ vaṭṭati. Yathāvuttavisiṭṭhabhāvayogatoyeva cetaṃ ‘‘abhidhammapiṭaka’’nti vuccati abhi-saddassa visiṭṭhabhāvajotanato ",
      ". Apica vuḍḍhimantādidhammānaṃ ettha vuttattā cetaṃ abhidhammapiṭakaṃ. Yathāhu porāṇā –"
    ],
    "innerText": "Visiṭṭhabhāvo panassa lokavohāramatikkamma yathāsabhāvavasena desanato, visiṭṭhadhammakkhandhavibhāvanato ca veditabbo. Ettha hi ‘‘satto puggalo bhikkhū’’tiādikaṃ lokavohāramatikkamma ‘‘khandhadhātuāyatana’’ntiādinā yathādhammavaseneva bāhulladesanā pavattā, na itaresu viya yathāvuttavohāravasena, yato idaṃ yathādhammasāsananti vuccati. Sabbasaṅkhatadhammavisiṭṭho cettha paññākkhandho visesato vibhāvito, tasmā tiṇṇampi piṭakānaṃ buddhavacanabhāvepi yathāsabhāvānatikkamadesanādito idameva tīsu piṭakesu visiṭṭhanti yuttaṃ. Apica dhammātirekadhammavisesabhāvato cassa visiṭṭhabhāvo veditabbo. Abhidhamme hi nippadesato khandhāyatanādidhammānaṃ vibhattattā itaradvayato atirekatarā, visiṭṭhā ca pāḷi hoti, tasmā atirekassa, visiṭṭhassa ca pāḷidhammassa vasena idameva tīsu piṭakesu uttamanti vattuṃ vaṭṭati. Yathāvuttavisiṭṭhabhāvayogatoyeva cetaṃ ‘‘abhidhammapiṭaka’’nti vuccati abhi-saddassa visiṭṭhabhāvajotanato . Apica vuḍḍhimantādidhammānaṃ ettha vuttattā cetaṃ abhidhammapiṭakaṃ. Yathāhu porāṇā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yaṃ ettha vuḍḍhimanto, salakkhaṇā pūjitā paricchinnā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vuttādhikā ca dhammā, abhidhammo tena akkhāto’’ti. (dī. ni. aṭṭha. 1.paṭhamamahāsaṅgītikathā; pārā. aṭṭha. 1.paṭhamamahāsaṅgītikathā; dha. sa. aṭṭha. nidānakathā);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā hettha ‘‘rūpūpapattiyā maggaṃ bhāveti, mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharatī’’tiādinā (dha. sa. 160 ādayo) vuḍḍhimantopi dhammā vuttā, ‘‘rūpārammaṇaṃ vā saddārammaṇaṃ vā’’tiādinā (dha. sa. 1) nayena ārammaṇādīhi lakkhitabbattā salakkhaṇāpi ‘‘sekkhā dhammā asekkhā dhammā, lokuttarā dhammā’’tiādinā nayena pūjitā pūjārahāpi ‘‘phasso hoti, vedanā hotī’’tiādinā (dha. sa. 1) nayena sabhāvaparicchinnattā paricchinnāpi ‘‘mahaggatā dhammā appamāṇā dhammā (dha. sa. tikamātikā 12, dukamātikā 99), anuttarā dhammā’’tiādinā nayena adhikā visiṭṭhāpi dhammā vuttā, tasmā abhi-saddassa vuḍḍhiādiatthesupi pavattanato ‘‘vuḍḍhimanto dhammā etthā’’tiādinā nibbacanena idaṃ piṭakaṃ ",
      " ‘‘abhidhamma’’nti vuccati. Abhidhammaṃ otaranti anenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhidhammāvatāraṃ"
      },
      " nāma pakaraṇaṃ. Iminā panassa atthānugatamabhidhānaṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tu"
      },
      "-saddo padapūraṇe. Ācariyena hi gāthāpadapūraṇatthaṃ yebhuyyena tattha tattha nipātā vuccanti. Yattha pana nesaṃ payojanaviseso dissati, tattheva tamatthaṃ vakkhāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Madhura"
      },
      "nti nippariyāyato madhura-saddoyaṃ jivhāviññeyye rasavisese vattati, idha pana iṭṭhabhāvasāmaññena atthabyañjanasampatti madhurasaddena vuttā. Bhavati hi taṃsadisassa taṃ-saddenābhidhānaṃ yathā ‘‘aggimāṇavo’’ti. Tena pana madhurena yogato idampi madhuraṃ yathā nīlaguṇayogato nīluppalanti. Nipuṇagambhīrāya byañjanasampattiyā ceva atthasampattiyā ca abhidhammavisayaṃ matiṃ vaḍḍhetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mativaḍḍhanaṃ"
      },
      ". Atha vā byañjanasampattiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘madhura’’"
      },
      "nti vuttaṃ, atthasampattiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘mativaḍḍhana’’"
      },
      "nti."
    ],
    "innerText": "Tathā hettha ‘‘rūpūpapattiyā maggaṃ bhāveti, mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharatī’’tiādinā (dha. sa. 160 ādayo) vuḍḍhimantopi dhammā vuttā, ‘‘rūpārammaṇaṃ vā saddārammaṇaṃ vā’’tiādinā (dha. sa. 1) nayena ārammaṇādīhi lakkhitabbattā salakkhaṇāpi ‘‘sekkhā dhammā asekkhā dhammā, lokuttarā dhammā’’tiādinā nayena pūjitā pūjārahāpi ‘‘phasso hoti, vedanā hotī’’tiādinā (dha. sa. 1) nayena sabhāvaparicchinnattā paricchinnāpi ‘‘mahaggatā dhammā appamāṇā dhammā (dha. sa. tikamātikā 12, dukamātikā 99), anuttarā dhammā’’tiādinā nayena adhikā visiṭṭhāpi dhammā vuttā, tasmā abhi-saddassa vuḍḍhiādiatthesupi pavattanato ‘‘vuḍḍhimanto dhammā etthā’’tiādinā nibbacanena idaṃ piṭakaṃ ‘‘abhidhamma’’nti vuccati. Abhidhammaṃ otaranti anenāti abhidhammāvatāraṃ nāma pakaraṇaṃ. Iminā panassa atthānugatamabhidhānaṃ dasseti. Tu-saddo padapūraṇe. Ācariyena hi gāthāpadapūraṇatthaṃ yebhuyyena tattha tattha nipātā vuccanti. Yattha pana nesaṃ payojanaviseso dissati, tattheva tamatthaṃ vakkhāma. Madhuranti nippariyāyato madhura-saddoyaṃ jivhāviññeyye rasavisese vattati, idha pana iṭṭhabhāvasāmaññena atthabyañjanasampatti madhurasaddena vuttā. Bhavati hi taṃsadisassa taṃ-saddenābhidhānaṃ yathā ‘‘aggimāṇavo’’ti. Tena pana madhurena yogato idampi madhuraṃ yathā nīlaguṇayogato nīluppalanti. Nipuṇagambhīrāya byañjanasampattiyā ceva atthasampattiyā ca abhidhammavisayaṃ matiṃ vaḍḍhetīti mativaḍḍhanaṃ. Atha vā byañjanasampattiyā ‘‘madhura’’nti vuttaṃ, atthasampattiyā ‘‘mativaḍḍhana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāḷa"
      },
      "nti kuñcikaṃ, kuñcikāsadisanti attho. Muyhanti tenāti moho, avijjāyetaṃ adhivacanaṃ, mohoyeva abhidhammamahāpuraṃ pavisantānaṃ pavesananivāraṇattā kavāṭabhūtoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mohakavāṭaṃ,"
      },
      " tassa. Vighāṭeti, vighāṭīyati anenāti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vighāṭanaṃ"
      },
      ". Nanu ca avijjākavāṭaṃ paññāya ugghāṭīyati. Sā hi tassā ujuvipaccanīkabhūtāti? Saccaṃ, idampi tassā kāraṇabhāvena ‘‘mohakavāṭavighāṭanakara’’nti vuttaṃ. Kāraṇakāraṇampi hi kāraṇavasena vuccati yathā ‘‘corehi gāmo daḍḍho, tiṇehi bhattaṃ siddha’’nti."
    ],
    "innerText": "5.Tāḷanti kuñcikaṃ, kuñcikāsadisanti attho. Muyhanti tenāti moho, avijjāyetaṃ adhivacanaṃ, mohoyeva abhidhammamahāpuraṃ pavisantānaṃ pavesananivāraṇattā kavāṭabhūtoti mohakavāṭaṃ, tassa. Vighāṭeti, vighāṭīyati anenāti vā vighāṭanaṃ. Nanu ca avijjākavāṭaṃ paññāya ugghāṭīyati. Sā hi tassā ujuvipaccanīkabhūtāti? Saccaṃ, idampi tassā kāraṇabhāvena ‘‘mohakavāṭavighāṭanakara’’nti vuttaṃ. Kāraṇakāraṇampi hi kāraṇavasena vuccati yathā ‘‘corehi gāmo daḍḍho, tiṇehi bhattaṃ siddha’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suduttara"
      },
      "nti dhammatthadesanāpaṭivedhasaṅkhātacatugambhīrabhāvapaṭisaṃyuttatāya mandabuddhīhi tarituṃ asakkuṇeyyattā atiduttaraṃ, teneva cedaṃ mahodadhisamānattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘mahodadhī’’"
      },
      "ti vuttaṃ. Mahaṇṇavopi hi caturāsītiyojanasahassagambhīro na sakkā aññatra sinerupabbatarājato kenaci patiṭṭhaṃ laddhuṃ, evamidampi catugambhīratāpaṭisaṃyuttaṃ aññatra tathāgatā ",
      " na kenaci patiṭṭhaṃ laddhuṃ sakkāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tarantāna"
      },
      "nti atthaggahaṇavasena uttaritukāmānaṃ. Ettha ca ‘‘taraṃvā’’ti adhikāravasena vattabbaṃ, vakkhamānaṃ vā ānetvā sambandhitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tarantāna"
      },
      "nti paratīrasampāpuṇanatthaṃ uttarantānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taraṃvā"
      },
      "ti uḷumpaṃ viya, taṃsamānanti attho. Makarā nāma macchajātikā, tesaṃ ākaro nivāsabhūmīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "makarākaro,"
      },
      " taṃ."
    ],
    "innerText": "6.Suduttaranti dhammatthadesanāpaṭivedhasaṅkhātacatugambhīrabhāvapaṭisaṃyuttatāya mandabuddhīhi tarituṃ asakkuṇeyyattā atiduttaraṃ, teneva cedaṃ mahodadhisamānattā ‘‘mahodadhī’’ti vuttaṃ. Mahaṇṇavopi hi caturāsītiyojanasahassagambhīro na sakkā aññatra sinerupabbatarājato kenaci patiṭṭhaṃ laddhuṃ, evamidampi catugambhīratāpaṭisaṃyuttaṃ aññatra tathāgatā na kenaci patiṭṭhaṃ laddhuṃ sakkāti. Tarantānanti atthaggahaṇavasena uttaritukāmānaṃ. Ettha ca ‘‘taraṃvā’’ti adhikāravasena vattabbaṃ, vakkhamānaṃ vā ānetvā sambandhitabbaṃ. Tarantānanti paratīrasampāpuṇanatthaṃ uttarantānaṃ. Taraṃvāti uḷumpaṃ viya, taṃsamānanti attho. Makarā nāma macchajātikā, tesaṃ ākaro nivāsabhūmīti makarākaro, taṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". Abhidhamme niyuttā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ābhidhammikā,"
      },
      " tesaṃ. Hatthasāraṃ viyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hatthasāraṃ"
      },
      ". Yathā hi manussānaṃ bahūsu ratanādīsu vijjamānesupi āpadāsu ca sukhaparibhogatthaṃ hatthe kayiramānaṃ sāraratanādikaṃ ‘‘hatthasāra’’nti vuccati, evamidampi satipi mahante abhidhammapiṭake tassa sabbaso vittiṇṇatāya pariharituṃ asakkuṇeyyattā tadatthasārasampiṇḍanavasena kayiramānaṃ ābhidhammikabhikkhūnaṃ sukhapariharaṇatthāya sampajjatīti hatthasārasadisattā ‘‘hatthasāra’’nti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavakkhāmī"
      },
      "ti pakārena kathessāmi, anāgatavacanañcetaṃ, vattamānasamīpattā vā anāgate vattamānūpacārato vattamānavacanaṃ, paṭiññānantarameva vakkhatīti. Atthavasena pakārena kathentopi saddavasena saṅkhipitvā kathessāmīti dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘samāsenā’’"
      },
      "ti. Samasanaṃ saṃkhipanaṃ samāso, tena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāsena,"
      },
      " na byāsavasenāti vuttaṃ hoti. Ettāvatā ca payojanābhidhānābhidheyyasotujanasamussāhanakaraṇappakārāni dassetvā idāni yasmā sotujanasamussāhanaṃ nāma tesaṃ sakkaccasavane niyuñjanaṃ, tasmā te tattha niyojento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘taṃ suṇātha samāhitā’’"
      },
      "ti. Sakkaccasavanapaṭibaddhā hi sammāpaṭipattīti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ta"
      },
      "nti taṃ mayā vakkhamānaṃ abhidhammāvatāraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suṇātha"
      },
      " nisāmayatha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samāhitā"
      },
      " sammā āhitā, avikkhittacittāti attho."
    ],
    "innerText": "7. Abhidhamme niyuttā ābhidhammikā, tesaṃ. Hatthasāraṃ viyāti hatthasāraṃ. Yathā hi manussānaṃ bahūsu ratanādīsu vijjamānesupi āpadāsu ca sukhaparibhogatthaṃ hatthe kayiramānaṃ sāraratanādikaṃ ‘‘hatthasāra’’nti vuccati, evamidampi satipi mahante abhidhammapiṭake tassa sabbaso vittiṇṇatāya pariharituṃ asakkuṇeyyattā tadatthasārasampiṇḍanavasena kayiramānaṃ ābhidhammikabhikkhūnaṃ sukhapariharaṇatthāya sampajjatīti hatthasārasadisattā ‘‘hatthasāra’’nti vuttaṃ. Pavakkhāmīti pakārena kathessāmi, anāgatavacanañcetaṃ, vattamānasamīpattā vā anāgate vattamānūpacārato vattamānavacanaṃ, paṭiññānantarameva vakkhatīti. Atthavasena pakārena kathentopi saddavasena saṅkhipitvā kathessāmīti dassento āha ‘‘samāsenā’’ti. Samasanaṃ saṃkhipanaṃ samāso, tena samāsena, na byāsavasenāti vuttaṃ hoti. Ettāvatā ca payojanābhidhānābhidheyyasotujanasamussāhanakaraṇappakārāni dassetvā idāni yasmā sotujanasamussāhanaṃ nāma tesaṃ sakkaccasavane niyuñjanaṃ, tasmā te tattha niyojento āha ‘‘taṃ suṇātha samāhitā’’ti. Sakkaccasavanapaṭibaddhā hi sammāpaṭipattīti. Tattha tanti taṃ mayā vakkhamānaṃ abhidhammāvatāraṃ suṇātha nisāmayatha. Samāhitā sammā āhitā, avikkhittacittāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ganthārambhakathāvaṇṇanā niṭṭhitā."
  }
]