[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "8. Aṭṭhamo paricchedo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pakiṇṇakaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "475-6"
      },
      ". Idāni yathāvuttānaṃ sabbesampi cittānaṃ pākaṭabhāvatthaṃ –"
    ],
    "innerText": "475-6. Idāni yathāvuttānaṃ sabbesampi cittānaṃ pākaṭabhāvatthaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Suttaṃ dovāriko ceva,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Gāmillo ambagoḷiyo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Jaccandho pīṭhasappī ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upanissayamatthaso’’ti. (dha. sa. aṭṭha. 498 vipākuddhārakathā) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhakathāya"
      },
      " āgatamātikāya vasena pakiṇṇakanayaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘idāni panā’’"
      },
      "tiādi āraddhaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manasa"
      },
      "nti cittānaṃ. ‘‘Mānasa’’ntipi paṭhanti, taṃ na sundaraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Panthamakkaṭako"
      },
      "ti pāṇakapaṭaṅgādīnaṃ ",
      " sañcaraṇaṭṭhāne jālaṃ pasāretvā tesaṃ maggarakkhaṇato ‘‘panthamakkaṭako’’ti laddhanāmo uṇṇanābhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Disāsu pana pañcasū"
      },
      "ti upametabbānaṃ pañcapasādānaṃ vasena vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti magge, tattha jālamajjheti vā sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suttaṃ pasāretvā"
      },
      "ti jālabandhanamāha."
    ],
    "innerText": "Aṭṭhakathāya āgatamātikāya vasena pakiṇṇakanayaṃ dassetuṃ ‘‘idāni panā’’tiādi āraddhaṃ. Tattha manasanti cittānaṃ. ‘‘Mānasa’’ntipi paṭhanti, taṃ na sundaraṃ. Panthamakkaṭakoti pāṇakapaṭaṅgādīnaṃ sañcaraṇaṭṭhāne jālaṃ pasāretvā tesaṃ maggarakkhaṇato ‘‘panthamakkaṭako’’ti laddhanāmo uṇṇanābhi. Disāsu pana pañcasūti upametabbānaṃ pañcapasādānaṃ vasena vuttaṃ. Tatthāti magge, tattha jālamajjheti vā sambandho. Suttaṃ pasāretvāti jālabandhanamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "478-80"
      },
      ". Nti rudhiramāha. Disāsu dutiyādīsu sutte…pe… ghaṭṭiteti sambandho.",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": " ‘‘Pasādā pañca daṭṭhabbā’’"
      },
      "tiādi upamāsaṃsandanaṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittaṃ…pe… viyā"
      },
      "ti hadayavatthuṃ nissāya pavattamānacittaṃ jālamajjhe nipannamakkaṭako viya daṭṭhabbaṃ."
    ],
    "innerText": "478-80. Nti rudhiramāha. Disāsu dutiyādīsu sutte…pe… ghaṭṭiteti sambandho. ‘‘Pasādā pañca daṭṭhabbā’’tiādi upamāsaṃsandanaṃ . Cittaṃ…pe… viyāti hadayavatthuṃ nissāya pavattamānacittaṃ jālamajjhe nipannamakkaṭako viya daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "482-5"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pasādaghaṭṭana"
      },
      "nti pasāde ghaṭṭitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavaṅgāvaṭṭana"
      },
      "nti bhavaṅgaṃ āvaṭṭentaṃ. Dhammato aññā kāci kiriyā nāma natthīti dhammameva calanena saha upameti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suttānusāraṃvā"
      },
      "ti suttānusārena gamanaṃ viya. Javanassa ārammaṇarasānubhavanato tassa pavatti yūsapānena saddhiṃ upametvā vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthuṃyevā"
      },
      "ti yathā purimacittāni hadayavatthunissitāni pasādavatthuṃ anugatāni aññārammaṇāni ca honti, na evaṃ bhavaṅgaṃ. Taṃ pana vatthārammaṇantararahitaṃ kevalaṃ hadayavatthumeva nissāya pavattatīti dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parivattana"
      },
      "nti puna bhavaṅgabhāvena parivattanaṃ. Bhavaṅgāvajjanādīnaṃ dhammato bhedepi santativasena ekattaṃ gahetvā ekeneva makkaṭakena upamāsaṃsandanaṃ vuttaṃ."
    ],
    "innerText": "482-5.Pasādaghaṭṭananti pasāde ghaṭṭitaṃ. Bhavaṅgāvaṭṭananti bhavaṅgaṃ āvaṭṭentaṃ. Dhammato aññā kāci kiriyā nāma natthīti dhammameva calanena saha upameti. Suttānusāraṃvāti suttānusārena gamanaṃ viya. Javanassa ārammaṇarasānubhavanato tassa pavatti yūsapānena saddhiṃ upametvā vuttā. Vatthuṃyevāti yathā purimacittāni hadayavatthunissitāni pasādavatthuṃ anugatāni aññārammaṇāni ca honti, na evaṃ bhavaṅgaṃ. Taṃ pana vatthārammaṇantararahitaṃ kevalaṃ hadayavatthumeva nissāya pavattatīti dīpeti. Parivattananti puna bhavaṅgabhāvena parivattanaṃ. Bhavaṅgāvajjanādīnaṃ dhammato bhedepi santativasena ekattaṃ gahetvā ekeneva makkaṭakena upamāsaṃsandanaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "486-90"
      },
      ". Upamā eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "opammaṃ"
      },
      ". Tato pasādavatthuto cittāti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dīpitaṃ"
      },
      " iminā opammena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekekārammaṇa"
      },
      "nti rūpādīsu pañcasu ekekaṃ ārammaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaso"
      },
      "ti sabbesu cakkhādīsu yattha katthacīti attho. Idāni ekekārammaṇassa dvīsu dvīsu āpāthagamanaṃ pakāsetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘rūpaṃ cakkhupasādamhī’’"
      },
      "tiādi vuttaṃ. Khe ākāse gacchatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khago,"
      },
      " pakkhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sākhino"
      },
      "ti rukkhassa."
    ],
    "innerText": "486-90. Upamā eva opammaṃ. Tato pasādavatthuto cittāti sambandho. Dīpitaṃ iminā opammena. Ekekārammaṇanti rūpādīsu pañcasu ekekaṃ ārammaṇaṃ. Sabbasoti sabbesu cakkhādīsu yattha katthacīti attho. Idāni ekekārammaṇassa dvīsu dvīsu āpāthagamanaṃ pakāsetuṃ ‘‘rūpaṃ cakkhupasādamhī’’tiādi vuttaṃ. Khe ākāse gacchatīti khago, pakkhi. Sākhinoti rukkhassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "492-3"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpassā"
      },
      "ti sambandhe sāmivacanaṃ, tassa pana ghaṭṭanaṃ, āpāthagamanampi cāti dvīhi saha sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pasādassā"
      },
      "ti kammatthe sāmivacanaṃ, atthato āpāthagamanampi cāti sambandho. Ārammaṇavasena, āpāthaṃ āgacchantassapi pasādaghaṭṭanena ca bhavaṅgacalanassa paccayabhāvena āpāthaṃ viya upagamananti attho."
    ],
    "innerText": "492-3.Rūpassāti sambandhe sāmivacanaṃ, tassa pana ghaṭṭanaṃ, āpāthagamanampi cāti dvīhi saha sambandho. Pasādassāti kammatthe sāmivacanaṃ, atthato āpāthagamanampi cāti sambandho. Ārammaṇavasena, āpāthaṃ āgacchantassapi pasādaghaṭṭanena ca bhavaṅgacalanassa paccayabhāvena āpāthaṃ viya upagamananti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "494-5"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato"
      },
      "ti ",
      " bhavaṅgacalanato paraṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kusalaṃ javanaṃ citta"
      },
      "nti kāmāvacarakusalajavanacittaṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akusalameva vā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vā"
      },
      "-saddena kiriyābyākatacittampi saṅgaṇhāti. Ettha siyā – ko panetaṃ javanaṃ kusalatāya vā akusalatāya vā niyametīti? Yonisomanasikāro ceva ayonisomanasikāro ca. Yassa hi catucakkasampadāvasena yonisomanasikāro pavattati, āvajjanaṃ, voṭṭhabbanañca yonisova āvaṭṭeti, vavatthāpeti ca, tassa akusaluppatti natthi. Yassa pana vuttavipariyāyena ayonisomanasikāro ca hoti, āvajjanaṃ, voṭṭhabbanañca ayoniso ca āvaṭṭeti, vavatthāpeti ca, tassa kusalajavanuppatti natthi, tasmā yonisomanasikāro kusalatāya, ayonisomanasikāro akusalatāya ca niyametīti daṭṭhabbaṃ. Kiriyājavanaṃ pana arahattameva niyameti. Keci pana ‘‘kiriyājavanaṃ pana manasikāro ca niyameti. Yathā hi āvajjanaṃ kusalākusalānaṃ visuṃ visuṃ paccayo hoti, evaṃ kiriyājavanassāpī’’ti vadanti."
    ],
    "innerText": "494-5.Tatoti bhavaṅgacalanato paraṃ, kusalaṃ javanaṃ cittanti kāmāvacarakusalajavanacittaṃ . Akusalameva vāti vā-saddena kiriyābyākatacittampi saṅgaṇhāti. Ettha siyā – ko panetaṃ javanaṃ kusalatāya vā akusalatāya vā niyametīti? Yonisomanasikāro ceva ayonisomanasikāro ca. Yassa hi catucakkasampadāvasena yonisomanasikāro pavattati, āvajjanaṃ, voṭṭhabbanañca yonisova āvaṭṭeti, vavatthāpeti ca, tassa akusaluppatti natthi. Yassa pana vuttavipariyāyena ayonisomanasikāro ca hoti, āvajjanaṃ, voṭṭhabbanañca ayoniso ca āvaṭṭeti, vavatthāpeti ca, tassa kusalajavanuppatti natthi, tasmā yonisomanasikāro kusalatāya, ayonisomanasikāro akusalatāya ca niyametīti daṭṭhabbaṃ. Kiriyājavanaṃ pana arahattameva niyameti. Keci pana ‘‘kiriyājavanaṃ pana manasikāro ca niyameti. Yathā hi āvajjanaṃ kusalākusalānaṃ visuṃ visuṃ paccayo hoti, evaṃ kiriyājavanassāpī’’ti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "497"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dovārikopamādīnī"
      },
      "ti ettha eko rājā sayanagato niddāyati, tassa paricārako pāde parimajjanto nisīdi, badhiradovāriko dvāre ṭhito, tayo paṭihārā sayanassa, dvārassa ca majjhe paṭipāṭiyā ṭhitā. Atheko paccantavāsī manusso paṇṇākāraṃ ādāya dvāraṃ ākoṭesi, badhiradovāriko saddaṃ na suṇāti, pādaparimajjako saññaṃ akāsi, tāya saññāya dvāraṃ vivaritvā passi, paṭhamapaṭihāro paṇṇākāraṃ gahetvā dutiyassa adāsi, dutiyo tatiyassa, tatiyo rañño, rājā paribhuñji. Tattha rājā viya javanaṃ daṭṭhabbaṃ, pādaparimajjako viya āvajjanaṃ, badhiradovāriko viya cakkhuviññāṇaṃ, tayo paṭihārā ",
      " viya sampaṭicchanādīni tīṇi vīthicittāni, paccantavāsino paṇṇākāraṃ ādāya dvārākoṭanaṃ viya ārammaṇassa pasādaghaṭṭanaṃ, pādaparimajjakena saññāya dinnakālo viya kiriyāmanodhātuyā bhavaṅgassa āvaṭṭitakālo, tena dinnasaññāya badhiradovārikassa dvāravivarakālo viya cakkhuviññāṇassa ārammaṇe dassanakiccasādhanakālo, paṭhamapaṭihārena paṇṇākārassa gahitakālo viya vipākamanodhātuyā ārammaṇassa sampaṭicchitakālo, paṭhamena dutiyassa dinnakālo viya vipākamanoviññāṇadhātuyā ārammaṇassa santīritakālo, dutiyena tatiyassa dinnakālo viya kiriyāmanoviññāṇadhātuyā ārammaṇassa vavatthāpitakālo, tatiyena rañño dinnakālo viya voṭṭhabbanena javanassa niyyātitakālo, rañño paribhogakālo viya javanassa ārammaṇarasānubhavanakāloti ayaṃ dovārikopamā."
    ],
    "innerText": "497.Dovārikopamādīnīti ettha eko rājā sayanagato niddāyati, tassa paricārako pāde parimajjanto nisīdi, badhiradovāriko dvāre ṭhito, tayo paṭihārā sayanassa, dvārassa ca majjhe paṭipāṭiyā ṭhitā. Atheko paccantavāsī manusso paṇṇākāraṃ ādāya dvāraṃ ākoṭesi, badhiradovāriko saddaṃ na suṇāti, pādaparimajjako saññaṃ akāsi, tāya saññāya dvāraṃ vivaritvā passi, paṭhamapaṭihāro paṇṇākāraṃ gahetvā dutiyassa adāsi, dutiyo tatiyassa, tatiyo rañño, rājā paribhuñji. Tattha rājā viya javanaṃ daṭṭhabbaṃ, pādaparimajjako viya āvajjanaṃ, badhiradovāriko viya cakkhuviññāṇaṃ, tayo paṭihārā viya sampaṭicchanādīni tīṇi vīthicittāni, paccantavāsino paṇṇākāraṃ ādāya dvārākoṭanaṃ viya ārammaṇassa pasādaghaṭṭanaṃ, pādaparimajjakena saññāya dinnakālo viya kiriyāmanodhātuyā bhavaṅgassa āvaṭṭitakālo, tena dinnasaññāya badhiradovārikassa dvāravivarakālo viya cakkhuviññāṇassa ārammaṇe dassanakiccasādhanakālo, paṭhamapaṭihārena paṇṇākārassa gahitakālo viya vipākamanodhātuyā ārammaṇassa sampaṭicchitakālo, paṭhamena dutiyassa dinnakālo viya vipākamanoviññāṇadhātuyā ārammaṇassa santīritakālo, dutiyena tatiyassa dinnakālo viya kiriyāmanoviññāṇadhātuyā ārammaṇassa vavatthāpitakālo, tatiyena rañño dinnakālo viya voṭṭhabbanena javanassa niyyātitakālo, rañño paribhogakālo viya javanassa ārammaṇarasānubhavanakāloti ayaṃ dovārikopamā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idaṃ ",
      " pana opammaṃ kiṃ dīpetī’’tiādi ucchuyantūpamāya vuttanayena veditabbā. Sambahulā gāmadārakā antaravīthiyaṃ paṃsuṃ kīḷanti, tatthekassa hatthe kahāpaṇo paṭihaññi. So ‘‘mayhaṃ hatthe paṭihataṃ, kiṃ nu kho eta’’nti āha. Atheko ‘‘paṇḍaraṃ eta’’nti āha. Aparo saha paṃsunā gāḷhaṃ gaṇhi. Añño ‘‘puthulaṃ caturassaṃ eta’’nti āha. Aparo ‘‘kahāpaṇo eso’’ti āha. Atha āharitvā mātu adaṃsu, sā kamme upanesi. Tattha sambahulānaṃ dārakānaṃ antaravīthiyaṃ kīḷantānaṃ sannisinnakālo viya cittappavatti daṭṭhabbā, kahāpaṇassa hatthe paṭihatakālo viya ārammaṇena pasādassa ghaṭṭitakālo, ‘‘kiṃ nu kho eta’’nti vuttakālo viya taṃ ārammaṇaṃ gahetvā kiriyāmanodhātuyā bhavaṅgassa āvaṭṭitakālo, ‘‘paṇḍaraṃ eta’’nti vuttakālo viya cakkhuviññāṇena dassanakiccassa ",
      " sādhitakālo, saha paṃsunā gāḷhaṃ gahitakālo viya vipākamanodhātuyā ārammaṇassa sampaṭicchitakālo, ‘‘puthulaṃ caturassaṃ eta’’nti vuttakālo viya vipākamanoviññāṇadhātuyā ārammaṇassa santīritakālo, ‘‘kahāpaṇo eso’’ti vuttakālo viya kiriyāmanoviññāṇadhātuyā ārammaṇassa vavatthāpitakālo, mātarā kamme upanītakālo viya javanassa ārammaṇarasānubhavanaṃ veditabbanti ayaṃ gāmadārakopamā."
    ],
    "innerText": "‘‘Idaṃ pana opammaṃ kiṃ dīpetī’’tiādi ucchuyantūpamāya vuttanayena veditabbā. Sambahulā gāmadārakā antaravīthiyaṃ paṃsuṃ kīḷanti, tatthekassa hatthe kahāpaṇo paṭihaññi. So ‘‘mayhaṃ hatthe paṭihataṃ, kiṃ nu kho eta’’nti āha. Atheko ‘‘paṇḍaraṃ eta’’nti āha. Aparo saha paṃsunā gāḷhaṃ gaṇhi. Añño ‘‘puthulaṃ caturassaṃ eta’’nti āha. Aparo ‘‘kahāpaṇo eso’’ti āha. Atha āharitvā mātu adaṃsu, sā kamme upanesi. Tattha sambahulānaṃ dārakānaṃ antaravīthiyaṃ kīḷantānaṃ sannisinnakālo viya cittappavatti daṭṭhabbā, kahāpaṇassa hatthe paṭihatakālo viya ārammaṇena pasādassa ghaṭṭitakālo, ‘‘kiṃ nu kho eta’’nti vuttakālo viya taṃ ārammaṇaṃ gahetvā kiriyāmanodhātuyā bhavaṅgassa āvaṭṭitakālo, ‘‘paṇḍaraṃ eta’’nti vuttakālo viya cakkhuviññāṇena dassanakiccassa sādhitakālo, saha paṃsunā gāḷhaṃ gahitakālo viya vipākamanodhātuyā ārammaṇassa sampaṭicchitakālo, ‘‘puthulaṃ caturassaṃ eta’’nti vuttakālo viya vipākamanoviññāṇadhātuyā ārammaṇassa santīritakālo, ‘‘kahāpaṇo eso’’ti vuttakālo viya kiriyāmanoviññāṇadhātuyā ārammaṇassa vavatthāpitakālo, mātarā kamme upanītakālo viya javanassa ārammaṇarasānubhavanaṃ veditabbanti ayaṃ gāmadārakopamā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idaṃ opammaṃ kiṃ dīpeti? Kiriyāmanodhātu adisvāva bhavaṅgaṃ āvaṭṭeti, vipākamanodhātu adisvāva sampaṭicchati, vipākamanoviññāṇadhātu adisvāva santīreti, kiriyāmanoviññāṇadhātu adisvāva vavatthāpeti, javanaṃ adisvāva ārammaṇarasaṃ anubhavati, ekantena pana cakkhuviññāṇameva dassanakiccaṃ sādhetīti dīpeti. Jaccandhapīṭhasappīupamā upari āgamissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "498-509"
      },
      ". Ettakā upamā saṅgahetvā ‘‘dovārikopamādīnī’’ti vatvā ‘‘upanissayamatthaso’’ti ettha upanissayabhāvaṃ pakāsetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘asambhedenā’’"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asambhedenā"
      },
      "ti avinaṭṭhabhāvena, vātapittādīhi anupahatabhāvena ca. Vātapittādiupahatampi hi cakkhuviññāṇassa paccayabhāvānupagamanato sambhinnameva nāma hoti, pañcindriyānaṃ atthikkhaṇeyeva nissayabhāvūpagamanato khaṇavasena asambhedopi yujjati. Esa nayo sotapasādādīsupi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpāpāthagamenā"
      },
      "ti dūre ṭhitassa phalikādīhi antaritassa cakkhuviññāṇuppattiyā paccayo bhavituṃ yogyadese avaṭṭhitavasena rūpassa āpāthagamanena. Evañca ",
      " katvā dūre ṭhitaṃ, parammukhe ṭhitampi dibbacakkhussa āpāthagatameva ",
      " nāma hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ālokanissayenāpī"
      },
      "ti rūpāvabhāsanasamatthaālokasaṅkhātanissayena. Āloke sati sambhavo cettha ālokanissayatā, na ālokassa nissayapaccayattā. Manakkārova hetu manakkārahetu, tena saha vattatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samanakkārahetu"
      },
      ". Tena ālokanissitaṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sametehī"
      },
      "ti saṃyuttehi ekībhūtehi, na ekassapi virahenāti attho."
    ],
    "innerText": "498-509. Ettakā upamā saṅgahetvā ‘‘dovārikopamādīnī’’ti vatvā ‘‘upanissayamatthaso’’ti ettha upanissayabhāvaṃ pakāsetuṃ ‘‘asambhedenā’’tiādimāha. Asambhedenāti avinaṭṭhabhāvena, vātapittādīhi anupahatabhāvena ca. Vātapittādiupahatampi hi cakkhuviññāṇassa paccayabhāvānupagamanato sambhinnameva nāma hoti, pañcindriyānaṃ atthikkhaṇeyeva nissayabhāvūpagamanato khaṇavasena asambhedopi yujjati. Esa nayo sotapasādādīsupi. Rūpāpāthagamenāti dūre ṭhitassa phalikādīhi antaritassa cakkhuviññāṇuppattiyā paccayo bhavituṃ yogyadese avaṭṭhitavasena rūpassa āpāthagamanena. Evañca katvā dūre ṭhitaṃ, parammukhe ṭhitampi dibbacakkhussa āpāthagatameva nāma hoti. Ālokanissayenāpīti rūpāvabhāsanasamatthaālokasaṅkhātanissayena. Āloke sati sambhavo cettha ālokanissayatā, na ālokassa nissayapaccayattā. Manakkārova hetu manakkārahetu, tena saha vattatīti samanakkārahetu. Tena ālokanissitaṃ dasseti. Sametehīti saṃyuttehi ekībhūtehi, na ekassapi virahenāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākāsanissayenā"
      },
      "ti kaṇṇacchiddasaṅkhātaākāsanissayena. Teneva hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathāyaṃ"
      },
      " ‘‘na hi pihitakaṇṇacchiddassa sotaviññāṇaṃ pavattatī’’ti vuttaṃ. Bāhirākāsampi pana icchitameva. Tathā hi avivare gehe nisīditvā vuccamānānaṃ bahi ṭhitā na suṇanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vāyosannissayenā"
      },
      "ti nāsikacchiddaṃ pavisanavāyusannissayena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āposannissayenā"
      },
      "ti kheḷasaṅkhātaāposannissayena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pathavīsannissayenā"
      },
      "ti kāyapasādavatthussa pathavīdhātusannissayena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manoviññāṇa"
      },
      "nti javanamanoviññāṇaṃ."
    ],
    "innerText": "Ākāsanissayenāti kaṇṇacchiddasaṅkhātaākāsanissayena. Teneva hi aṭṭhakathāyaṃ ‘‘na hi pihitakaṇṇacchiddassa sotaviññāṇaṃ pavattatī’’ti vuttaṃ. Bāhirākāsampi pana icchitameva. Tathā hi avivare gehe nisīditvā vuccamānānaṃ bahi ṭhitā na suṇanti. Vāyosannissayenāti nāsikacchiddaṃ pavisanavāyusannissayena. Āposannissayenāti kheḷasaṅkhātaāposannissayena. Pathavīsannissayenāti kāyapasādavatthussa pathavīdhātusannissayena. Manoviññāṇanti javanamanoviññāṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "510-11"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mano…pe… veditabba"
      },
      "nti ‘‘asambhedā manassā’’ti ettha vuttaṃ mano bhavaṅgacittanti veditabbaṃ. Taṃ pana cutivasena niruddhampi kiriyāmayacittassa paccayabhāvaṃ anupagantvā kevalaṃ bhavaṅgappavattivasena mandathāmagataṃ hutvā pavattanampi sambhinnamevāti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāyaṃ sabbattha gacchatī"
      },
      "ti catuvokāre alabbhanato. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bhavaṃ tu pañcavokāra’’"
      },
      "ntiādi. Tattha pañcannaṃ khandhānaṃ vokāro etthāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcavokāro"
      },
      ". Hoti hi bhinnādhikaraṇampi aññapadatthasamāso yathā ‘‘urasilomo’’ti. Atha vā yathāpaccayaṃ pañcahi khandhehi vokarīyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcavokāro"
      },
      ". ‘‘Atthato’’ti evamādikaṃ padaṃ cakkhādīni dassanādikiccānīti ettakameva sandhāya vuttaṃ, na aññaṃ kiñci visesananti na tattha vinicchayo vutto."
    ],
    "innerText": "510-11.Mano…pe… veditabbanti ‘‘asambhedā manassā’’ti ettha vuttaṃ mano bhavaṅgacittanti veditabbaṃ. Taṃ pana cutivasena niruddhampi kiriyāmayacittassa paccayabhāvaṃ anupagantvā kevalaṃ bhavaṅgappavattivasena mandathāmagataṃ hutvā pavattanampi sambhinnamevāti daṭṭhabbaṃ. Nāyaṃ sabbattha gacchatīti catuvokāre alabbhanato. Tenāha ‘‘bhavaṃ tu pañcavokāra’’ntiādi. Tattha pañcannaṃ khandhānaṃ vokāro etthāti pañcavokāro. Hoti hi bhinnādhikaraṇampi aññapadatthasamāso yathā ‘‘urasilomo’’ti. Atha vā yathāpaccayaṃ pañcahi khandhehi vokarīyatīti pañcavokāro. ‘‘Atthato’’ti evamādikaṃ padaṃ cakkhādīni dassanādikiccānīti ettakameva sandhāya vuttaṃ, na aññaṃ kiñci visesananti na tattha vinicchayo vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "512-4"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbānī"
      },
      "ti ",
      " kāmāvacarādibhedaṃ anāmasitvā sabbāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kamma"
      },
      "nti paṭisandhinibbattakā upapajjavedanīyabhūtā, aparāpariyavedanīyabhūtā vā cetanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammanimitta"
      },
      "nti yaṃ vatthuṃ ārammaṇaṃ katvā āyūhanakāle kammaṃ āyūhati, taṃ dānūpakaraṇādikaṃ, pāṇaghātopakaraṇādikañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gatinimitta"
      },
      "nti bhavantaramupapajjitabbabhavapariyāpannavaṇṇāyatanaṃ, taṃ pana sugatiyaṃ manussaloke nibbattantassa rattakambalasadisamātukucchivaṇṇavasena, devaloke nibbattantassa uyyānakapparukkhavaṇṇavasena, duggatiyaṃ nibbattantassa ",
      " aggijālādivaṇṇavasena, petatiracchānayonīsu petatiracchānānaṃ nibaddhasañcaraṇaṭṭhānapariyāpannatāvaṇṇavasena ca daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Tividha’’"
      },
      "nti idaṃ yathāsambhavavasena vuttaṃ, rūpārūpasambandhīnaṃ pana kammanimittameva ārammaṇaṃ hoti. Tathā hi mahaggatavipākāni ekantena kammasadisārammaṇāni vuttāni."
    ],
    "innerText": "512-4.Sabbānīti kāmāvacarādibhedaṃ anāmasitvā sabbāni. Kammanti paṭisandhinibbattakā upapajjavedanīyabhūtā, aparāpariyavedanīyabhūtā vā cetanā. Kammanimittanti yaṃ vatthuṃ ārammaṇaṃ katvā āyūhanakāle kammaṃ āyūhati, taṃ dānūpakaraṇādikaṃ, pāṇaghātopakaraṇādikañca. Gatinimittanti bhavantaramupapajjitabbabhavapariyāpannavaṇṇāyatanaṃ, taṃ pana sugatiyaṃ manussaloke nibbattantassa rattakambalasadisamātukucchivaṇṇavasena, devaloke nibbattantassa uyyānakapparukkhavaṇṇavasena, duggatiyaṃ nibbattantassa aggijālādivaṇṇavasena, petatiracchānayonīsu petatiracchānānaṃ nibaddhasañcaraṇaṭṭhānapariyāpannatāvaṇṇavasena ca daṭṭhabbaṃ. ‘‘Tividha’’nti idaṃ yathāsambhavavasena vuttaṃ, rūpārūpasambandhīnaṃ pana kammanimittameva ārammaṇaṃ hoti. Tathā hi mahaggatavipākāni ekantena kammasadisārammaṇāni vuttāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccuppannamatītaṃ vā"
      },
      "ti khaṇavasena paccuppannamatītaṃ vā. Tattha gatinimittaṃ ekantena paccuppannameva, kammanimittaṃ paccuppannamatītaṃ vā, kammaṃ pana atītameva. Anāgatārammaṇaṃ pana paccuppannakammanimittagatinimittaṃ viya anāpāthagatattā, atītakammakammanimittaṃ viya ananubhūtattā ca vibhūtaṃ hutvā nopatiṭṭhātīti atisantabhāvena pavattamānā paṭisandhi taṃ ārabbha pavattituṃ na sakkotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘natthi anāgata’’"
      },
      "nti. Mahaggatapaṭisandhīnaṃ ekantena kammasadisārammaṇabhāvena kammassa viya atītanavattabbārammaṇattā na tāsaṃ visuṃ ārammaṇaṃ uddhaṭaṃ. Tattha dutiyacatutthārūpapaṭisandhīnaṃ atītameva ārammaṇaṃ itarāsaṃ navattabbanti daṭṭhabbaṃ."
    ],
    "innerText": "Paccuppannamatītaṃ vāti khaṇavasena paccuppannamatītaṃ vā. Tattha gatinimittaṃ ekantena paccuppannameva, kammanimittaṃ paccuppannamatītaṃ vā, kammaṃ pana atītameva. Anāgatārammaṇaṃ pana paccuppannakammanimittagatinimittaṃ viya anāpāthagatattā, atītakammakammanimittaṃ viya ananubhūtattā ca vibhūtaṃ hutvā nopatiṭṭhātīti atisantabhāvena pavattamānā paṭisandhi taṃ ārabbha pavattituṃ na sakkotīti vuttaṃ ‘‘natthi anāgata’’nti. Mahaggatapaṭisandhīnaṃ ekantena kammasadisārammaṇabhāvena kammassa viya atītanavattabbārammaṇattā na tāsaṃ visuṃ ārammaṇaṃ uddhaṭaṃ. Tattha dutiyacatutthārūpapaṭisandhīnaṃ atītameva ārammaṇaṃ itarāsaṃ navattabbanti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "517-20"
      },
      ". Mahāvipākānaṃ paṭisandhādicatukiccavaseneva pavattanato rūpārūpabhave paṭisandhibhavaṅgacutivasena taṃtaṃvipākasseva pavattito, tadārammaṇassa ca abhāvena tattha na labbhatīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘mahāpākā…pe… dvaye’’"
      },
      "ti. Aniṭṭharūpānaṃ ",
      " brahmaloke asambhavepi tattha ṭhatvā idha aniṭṭhārammaṇaṃ passantānaṃ akusalavipākāni na uppajjantīti na vattabbanti rūpabhavepi santīraṇattayaṃ vuttaṃ. Abhidhammatthasaṅgahasaccasaṅkhepādīsupi hi imināva adhippāyena rūpaloke akusalavipākappavatti dassitā. Apare pana ‘‘kāmabhave santīraṇattayaṃ, rūpabhave santīraṇadvayanti yathālābhavasena yojetabba’’nti vadanti."
    ],
    "innerText": "517-20. Mahāvipākānaṃ paṭisandhādicatukiccavaseneva pavattanato rūpārūpabhave paṭisandhibhavaṅgacutivasena taṃtaṃvipākasseva pavattito, tadārammaṇassa ca abhāvena tattha na labbhatīti āha ‘‘mahāpākā…pe… dvaye’’ti. Aniṭṭharūpānaṃ brahmaloke asambhavepi tattha ṭhatvā idha aniṭṭhārammaṇaṃ passantānaṃ akusalavipākāni na uppajjantīti na vattabbanti rūpabhavepi santīraṇattayaṃ vuttaṃ. Abhidhammatthasaṅgahasaccasaṅkhepādīsupi hi imināva adhippāyena rūpaloke akusalavipākappavatti dassitā. Apare pana ‘‘kāmabhave santīraṇattayaṃ, rūpabhave santīraṇadvayanti yathālābhavasena yojetabba’’nti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kadācipī"
      },
      "ti parittārammaṇesu parittajavanānaṃ uppādepi. ‘‘Bījassābhāvato’’ti rūpārūpabhavadvaye tadārammaṇābhāvassa kāraṇaṃ vatvā tameva pakāsetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paṭisandhibīja’’"
      },
      "ntiādi vuttaṃ. Paṭisandhiyeva bījabhūtanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisandhibījaṃ. Tassā"
      },
      "ti tadārammaṇassa."
    ],
    "innerText": "Kadācipīti parittārammaṇesu parittajavanānaṃ uppādepi. ‘‘Bījassābhāvato’’ti rūpārūpabhavadvaye tadārammaṇābhāvassa kāraṇaṃ vatvā tameva pakāsetuṃ ‘‘paṭisandhibīja’’ntiādi vuttaṃ. Paṭisandhiyeva bījabhūtanti paṭisandhibījaṃ. Tassāti tadārammaṇassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "521"
      },
      ". Yadi evaṃ cakkhuviññāṇādīnampi kāmāvacarapaṭisandhibījattā tattha abhāvo āpajjatīti codento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cakkhuviññāṇādīna’’"
      },
      "ntiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Indriyāna"
      },
      "nti cakkhuviññāṇādīnaṃ vatthudvārabhūtānaṃ cakkhādīnamindriyānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavattānubhāvato"
      },
      "ti tesaṃ tattha atthitānubhāvato ",
      ". Ayañhettha adhippāyo – cakkhusotaviññāṇānaṃ vatthubhūtāni cakkhusotindriyāni tattha pavattantīti tesaṃ pavattiānubhāvato cakkhusotaviññāṇāni pavattanti. Sati ca tesaṃ pavattiyaṃ vīthicittuppādo niyatoti cakkhuviññāṇādīnaṃ viya sampaṭicchanasantīraṇānampi tattha sambhavo siddhoti."
    ],
    "innerText": "521. Yadi evaṃ cakkhuviññāṇādīnampi kāmāvacarapaṭisandhibījattā tattha abhāvo āpajjatīti codento āha ‘‘cakkhuviññāṇādīna’’ntiādi. Indriyānanti cakkhuviññāṇādīnaṃ vatthudvārabhūtānaṃ cakkhādīnamindriyānaṃ. Pavattānubhāvatoti tesaṃ tattha atthitānubhāvato . Ayañhettha adhippāyo – cakkhusotaviññāṇānaṃ vatthubhūtāni cakkhusotindriyāni tattha pavattantīti tesaṃ pavattiānubhāvato cakkhusotaviññāṇāni pavattanti. Sati ca tesaṃ pavattiyaṃ vīthicittuppādo niyatoti cakkhuviññāṇādīnaṃ viya sampaṭicchanasantīraṇānampi tattha sambhavo siddhoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "523-4"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akāmāvacaradhamme"
      },
      "ti kāmāvacaradhammato aññe mahaggatalokuttaradhamme. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānubandhatī"
      },
      "ti nānuvattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Janakaṃ…pe… anubandhatī"
      },
      "ti yathā nāma gehato nikkhamitvā bahi gantukāmo taruṇadārako attano janakaṃ pitaraṃ vā aññaṃ vā pitusadisaṃ hitakāmaṃ ñātiṃ aṅguliyaṃ gahetvā anubandhati, na aññaṃ rājapurisādiṃ, tathā etampi ",
      " bhavaṅgārammaṇato bahi nikkhamitukāmasabhāgatāya attano janakaṃ paṭhamakusalādikaṃ sadisaṃ vā dutiyakusalādikāmāvacarajavanameva anubandhati, na aññaṃ mahaggataṃ lokuttaranti ayamettha attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalākusalādi"
      },
      "nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-ggahaṇena kiriyābyākataṃ saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ānandācariyo"
      },
      " pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭṭhāne"
      },
      " ‘‘kusalākusale niruddhe vipāko tadārammaṇatā uppajjatī’’ti (paṭṭhā. 3.1.98) vipākadhammadhammānamevānantaraṃ tadārammaṇaṃ vuttaṃ. Vipphāravantañhi javanaṃ nāvaṃ viya nadīsoto bhavaṅgaṃ anubandhati, na pana chaḷaṅgupekkhāvato santavuttiṃ kiriyājavanaṃ paṇṇapuṭaṃ viya nadīsototi kiriyājavanānantaraṃ tadārammaṇaṃ na icchati, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ācariyajotipāla"
      },
      "ttherādayo pana ‘‘labbhamānassapi kenaci adhippāyena katthaci avacanaṃ dissati, yathā taṃ dhammasaṅgahe akusalaniddese labbhamānopi adhipati na vutto, tasmā yadi abyākatānantarampi tadārammaṇaṃ vucceyya, tadā voṭṭhabbanānantarampi tassa pavattiṃ maññeyyunti kiriyājavanānantaraṃ tadārammaṇaṃ na vuttaṃ, na pana alabbhanato. Yañcettha paṇṇapuṭaṃ nidassitaṃ, taṃ nidassitabbena samānaṃ na hoti, nāvāpaṇṇapuṭānañhi nadīsotassa āvaṭṭanaṃ gati ca visadisīti nāvāyaṃ nadīsotassa anubandhanaṃ, paṇṇapuṭassa ananubandhanañca yujjati, idha pana kiriyājavanetarajavanānaṃ bhavaṅgasotassa āvaṭṭanaṃ gati ca sadisīti etassa ananubandhanaṃ, itarassa anubandhanañca na yujjati, tasmā vicāretabbameva ta’’nti vadanti."
    ],
    "innerText": "523-4.Akāmāvacaradhammeti kāmāvacaradhammato aññe mahaggatalokuttaradhamme. Nānubandhatīti nānuvattati. Janakaṃ…pe… anubandhatīti yathā nāma gehato nikkhamitvā bahi gantukāmo taruṇadārako attano janakaṃ pitaraṃ vā aññaṃ vā pitusadisaṃ hitakāmaṃ ñātiṃ aṅguliyaṃ gahetvā anubandhati, na aññaṃ rājapurisādiṃ, tathā etampi bhavaṅgārammaṇato bahi nikkhamitukāmasabhāgatāya attano janakaṃ paṭhamakusalādikaṃ sadisaṃ vā dutiyakusalādikāmāvacarajavanameva anubandhati, na aññaṃ mahaggataṃ lokuttaranti ayamettha attho. Kusalākusalādinti ādi-ggahaṇena kiriyābyākataṃ saṅgaṇhāti. Ānandācariyo pana paṭṭhāne ‘‘kusalākusale niruddhe vipāko tadārammaṇatā uppajjatī’’ti (paṭṭhā. 3.1.98) vipākadhammadhammānamevānantaraṃ tadārammaṇaṃ vuttaṃ. Vipphāravantañhi javanaṃ nāvaṃ viya nadīsoto bhavaṅgaṃ anubandhati, na pana chaḷaṅgupekkhāvato santavuttiṃ kiriyājavanaṃ paṇṇapuṭaṃ viya nadīsototi kiriyājavanānantaraṃ tadārammaṇaṃ na icchati, ācariyajotipālattherādayo pana ‘‘labbhamānassapi kenaci adhippāyena katthaci avacanaṃ dissati, yathā taṃ dhammasaṅgahe akusalaniddese labbhamānopi adhipati na vutto, tasmā yadi abyākatānantarampi tadārammaṇaṃ vucceyya, tadā voṭṭhabbanānantarampi tassa pavattiṃ maññeyyunti kiriyājavanānantaraṃ tadārammaṇaṃ na vuttaṃ, na pana alabbhanato. Yañcettha paṇṇapuṭaṃ nidassitaṃ, taṃ nidassitabbena samānaṃ na hoti, nāvāpaṇṇapuṭānañhi nadīsotassa āvaṭṭanaṃ gati ca visadisīti nāvāyaṃ nadīsotassa anubandhanaṃ, paṇṇapuṭassa ananubandhanañca yujjati, idha pana kiriyājavanetarajavanānaṃ bhavaṅgasotassa āvaṭṭanaṃ gati ca sadisīti etassa ananubandhanaṃ, itarassa anubandhanañca na yujjati, tasmā vicāretabbameva ta’’nti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "525-6"
      },
      ". Yathā cetaṃ mahaggatalokuttaradhamme nānuvattati, tathā yadā ete kāmāvacaradhammāpi mahaggatānuttaradhammārammaṇā hutvā pavattanti, tadā tepi nānubandhatīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kāmāvacaradhammāpī’’"
      },
      "tiādi. Mahaggatā-ggahaṇena cettha lokuttarānampi saṅgaho daṭṭhabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te cāpī"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca"
      },
      "-saddena ",
      " lokuttarārammaṇānaṃ gahaṇaṃ. Kasmā nānubandhatīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘parittārammaṇattā’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parittārammaṇattā"
      },
      "ti heṭṭhā vuttanayena kāmāvacaravipākānaṃ ekantena parittārammaṇattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathāparicitattā"
      },
      "ti yathā javanaṃ, evaṃ aparicitattā. Idaṃ vuttaṃ hoti – yathā hi so pitaraṃ, pitusadisaṃ vā kañci anubandhanto taruṇadārako gharadvārantaravīthicatukkādimhi pariciteyeva dese anugacchati, na araññaṃ vā rakkhasabhūmiṃ vā gacchantaṃ, evaṃ kāmāvacaradhamme anubandhantampi parittamhi pariciteyeva dese pavattamāne te dhamme anubandhati, na mahaggatalokuttaradhamme ārabbha pavattamānepi."
    ],
    "innerText": "525-6. Yathā cetaṃ mahaggatalokuttaradhamme nānuvattati, tathā yadā ete kāmāvacaradhammāpi mahaggatānuttaradhammārammaṇā hutvā pavattanti, tadā tepi nānubandhatīti āha ‘‘kāmāvacaradhammāpī’’tiādi. Mahaggatā-ggahaṇena cettha lokuttarānampi saṅgaho daṭṭhabbo. Te cāpīti ca-saddena lokuttarārammaṇānaṃ gahaṇaṃ. Kasmā nānubandhatīti āha ‘‘parittārammaṇattā’’tiādi. Parittārammaṇattāti heṭṭhā vuttanayena kāmāvacaravipākānaṃ ekantena parittārammaṇattā. Tathāparicitattāti yathā javanaṃ, evaṃ aparicitattā. Idaṃ vuttaṃ hoti – yathā hi so pitaraṃ, pitusadisaṃ vā kañci anubandhanto taruṇadārako gharadvārantaravīthicatukkādimhi pariciteyeva dese anugacchati, na araññaṃ vā rakkhasabhūmiṃ vā gacchantaṃ, evaṃ kāmāvacaradhamme anubandhantampi parittamhi pariciteyeva dese pavattamāne te dhamme anubandhati, na mahaggatalokuttaradhamme ārabbha pavattamānepi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "527-32"
      },
      ". Idāni kiṃ imāya yuttikathāya, aṭṭhakathāpamāṇato cetaṃ gahetabbanti dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kiṃ tenā’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Javane"
      },
      "ti kāmāvacarajavane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadārammaṇacittāni"
      },
      " ‘‘tadārammaṇa’’nti laddhanāmāni cittāni tadārammaṇabhāvaṃ na gaṇhanti, tadārammaṇabhāvena na pavattantīti attho. Atha vā nāmagottaṃ ārabbha javane javite ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tadārammaṇaṃ"
      },
      " tassa javanassa ārammaṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na gaṇhanti"
      },
      " na labbhantīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpārūpabhavesu vā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vā"
      },
      "-saddena ‘‘javane javitepi tadārammaṇaṃ na gaṇhantī’’ti ākaḍḍhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇṇattiṃ ārabbhā"
      },
      "ti kāmabhavepi paṇṇattiṃ ārabbha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇārammaṇāyā"
      },
      "ti aniccādilakkhaṇattayārammaṇāya, balavavipassanāyāti attho. ‘‘Tīṇi lakkhaṇāni, tisso ca paññattiyo kusalattike na labbhantī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathāya"
      },
      " vuttattā tiṇṇaṃ lakkhaṇānaṃ dhammato abhāvena taṃ ārabbha pavattāya vipassanāya tadārammaṇāni na labbhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭṭhāne"
      },
      " pana ‘‘sekhā vā puthujjanā vā kusalaṃ aniccato dukkhato anattato vipassanti, kusalākusale niruddhe vipāko tadārammaṇatā uppajjatī’’ti (paṭṭhā. 1.1.406) vacanato khandhārammaṇikavipassanāya tadārammaṇaṃ ",
      " labbhatīti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Micchattaniyatesū"
      },
      "ti ‘‘katame dhammā micchattaniyatā? Cattāro diṭṭhigatasampayuttacittuppādā’’ti (dha. sa. 1426) evamāgatesu micchāgāhavasena pavattesu dhammesu javanaṃ hutvā javitesu. Kasmā pana tesu javitesu tadārammaṇaṃ na labbhatīti? Kāmāvacaravipākānañhi niyatamicchādiṭṭhi viya ‘‘attā occhijjatī’’tiādinā attaparikappanāvasena appavattanato niyatamicchādiṭṭhivasappavattesu tesu javitesu tadanantaraṃ tadārammaṇāni na uppajjanti, aniyatamicchādiṭṭhivasappavattesu pana javitesu tadārammaṇaṃ nuppajjatīti natthi. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "micchattaniyatesū"
      },
      "ti micchābhāvaniyatasabhāvesu taṃvisayesūti attho. Micchattaniyatadhammānaṃ dhammasabhāvaṃ aggahetvā micchattaniyatasabhāvasseva gahaṇato, tassa ca vipākānaṃ avibhūtattā micchattaniyatasabhāve ārabbha ",
      " tadārammaṇā na labbhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pi"
      },
      "-saddena sammattaniyatesupīti sampiṇḍeti, ‘‘lokuttaradhamme ārabbhā’’ti vā etena siddhattā na tesaṃ visuṃ uddharaṇaṃ kataṃ. Aṭṭhakathāyaṃ pana micchattaniyatasammattaniyatānaṃ aññamaññapaṭipakkhabhāvena balavabhāvato tadārammaṇassa avatthubhāvadassanatthaṃ micchattaniyatānantaraṃ sammattaniyatāpi uddhaṭā. Micchattaniyatasabhāvassa viya paṭisambhidāsabhāvassapi kāmāvacaravipākānaṃ avibhūtabhāvena paṭisambhidāñāṇāni ārabbha javane javite tadārammaṇaṃ na labbhatīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paṭisambhidāñāṇānī’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manodvārepī"
      },
      "ti na kevalaṃ pañcadvāresuyeva, atha kho manodvārepi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbesa"
      },
      "nti ahetukaduhetukādīnaṃ sabbesaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupubbato"
      },
      "ti heṭṭhā vuttaanukkamato."
    ],
    "innerText": "527-32. Idāni kiṃ imāya yuttikathāya, aṭṭhakathāpamāṇato cetaṃ gahetabbanti dassento āha ‘‘kiṃ tenā’’tiādi. Javaneti kāmāvacarajavane. Tadārammaṇacittāni ‘‘tadārammaṇa’’nti laddhanāmāni cittāni tadārammaṇabhāvaṃ na gaṇhanti, tadārammaṇabhāvena na pavattantīti attho. Atha vā nāmagottaṃ ārabbha javane javite tadārammaṇaṃ tassa javanassa ārammaṇaṃ na gaṇhanti na labbhantīti attho. Rūpārūpabhavesu vāti vā-saddena ‘‘javane javitepi tadārammaṇaṃ na gaṇhantī’’ti ākaḍḍhati. Paṇṇattiṃ ārabbhāti kāmabhavepi paṇṇattiṃ ārabbha. Lakkhaṇārammaṇāyāti aniccādilakkhaṇattayārammaṇāya, balavavipassanāyāti attho. ‘‘Tīṇi lakkhaṇāni, tisso ca paññattiyo kusalattike na labbhantī’’ti aṭṭhakathāya vuttattā tiṇṇaṃ lakkhaṇānaṃ dhammato abhāvena taṃ ārabbha pavattāya vipassanāya tadārammaṇāni na labbhanti. Paṭṭhāne pana ‘‘sekhā vā puthujjanā vā kusalaṃ aniccato dukkhato anattato vipassanti, kusalākusale niruddhe vipāko tadārammaṇatā uppajjatī’’ti (paṭṭhā. 1.1.406) vacanato khandhārammaṇikavipassanāya tadārammaṇaṃ labbhatīti daṭṭhabbaṃ. Micchattaniyatesūti ‘‘katame dhammā micchattaniyatā? Cattāro diṭṭhigatasampayuttacittuppādā’’ti (dha. sa. 1426) evamāgatesu micchāgāhavasena pavattesu dhammesu javanaṃ hutvā javitesu. Kasmā pana tesu javitesu tadārammaṇaṃ na labbhatīti? Kāmāvacaravipākānañhi niyatamicchādiṭṭhi viya ‘‘attā occhijjatī’’tiādinā attaparikappanāvasena appavattanato niyatamicchādiṭṭhivasappavattesu tesu javitesu tadanantaraṃ tadārammaṇāni na uppajjanti, aniyatamicchādiṭṭhivasappavattesu pana javitesu tadārammaṇaṃ nuppajjatīti natthi. Atha vā micchattaniyatesūti micchābhāvaniyatasabhāvesu taṃvisayesūti attho. Micchattaniyatadhammānaṃ dhammasabhāvaṃ aggahetvā micchattaniyatasabhāvasseva gahaṇato, tassa ca vipākānaṃ avibhūtattā micchattaniyatasabhāve ārabbha tadārammaṇā na labbhanti. Pi-saddena sammattaniyatesupīti sampiṇḍeti, ‘‘lokuttaradhamme ārabbhā’’ti vā etena siddhattā na tesaṃ visuṃ uddharaṇaṃ kataṃ. Aṭṭhakathāyaṃ pana micchattaniyatasammattaniyatānaṃ aññamaññapaṭipakkhabhāvena balavabhāvato tadārammaṇassa avatthubhāvadassanatthaṃ micchattaniyatānantaraṃ sammattaniyatāpi uddhaṭā. Micchattaniyatasabhāvassa viya paṭisambhidāsabhāvassapi kāmāvacaravipākānaṃ avibhūtabhāvena paṭisambhidāñāṇāni ārabbha javane javite tadārammaṇaṃ na labbhatīti āha ‘‘paṭisambhidāñāṇānī’’tiādi. Manodvārepīti na kevalaṃ pañcadvāresuyeva, atha kho manodvārepi. Sabbesanti ahetukaduhetukādīnaṃ sabbesaṃ. Anupubbatoti heṭṭhā vuttaanukkamato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "533"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na vijjatī"
      },
      "ti manodvārassa appaṭighabhāvena na vijjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavaṅgato"
      },
      "ti bhavaṅgasantānato, tassa ārammaṇato ",
      " vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuṭṭhāna"
      },
      "nti bhavaṅgasantāne, tassārammaṇe vā sati tassa vuṭṭhānaṃ."
    ],
    "innerText": "533.Na vijjatīti manodvārassa appaṭighabhāvena na vijjati. Bhavaṅgatoti bhavaṅgasantānato, tassa ārammaṇato vā. Vuṭṭhānanti bhavaṅgasantāne, tassārammaṇe vā sati tassa vuṭṭhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "535-6"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satta sattā"
      },
      "ti ekekassa satta sattāti katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpapākā"
      },
      "ti akusalavipākā. ‘‘Dvādasāpuññacittāna’’nti vatvā ‘‘pāpapākā’’ti vacanaṃ ‘‘tatridaṃ sugatassa sugatacīvarappamāṇa’’ntiādīsu viya saññāsaddavasena vuttaṃ. Evaṃ pavattiyaṃ akusalavipākānaṃ pavattiṃ dassetvā idāni paṭisandhiyaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ekādasavidhāna’’"
      },
      "ntiādi vuttaṃ. Uddhaccacetanāya pavattivipākadānamattaṃ vinā paṭisandhidānābhāvato āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘hitvā uddhaccamānasa’’"
      },
      "nti. Kiṃ panettha kāraṇaṃ, adhimokkhavirahena sabbadubbalampi vicikicchāsahagataṃ paṭisandhiṃ ākaḍḍhati, adhimokkhasabhāvato tato balavatarampi uddhaccasahagataṃ nākaḍḍhatīti? Paṭisandhidānasabhāvābhāvato. ‘‘Balavaṃ ākaḍḍhati, dubbalaṃ nākaḍḍhatī’’ti hi ayaṃ vicāraṇā paṭisandhidānasabhāvesuyeva. Yassa pana paṭisandhidānasabhāvo eva natthi, na tassa balavabhāvo paṭisandhiākaḍḍhane kāraṇanti."
    ],
    "innerText": "535-6.Satta sattāti ekekassa satta sattāti katvā. Pāpapākāti akusalavipākā. ‘‘Dvādasāpuññacittāna’’nti vatvā ‘‘pāpapākā’’ti vacanaṃ ‘‘tatridaṃ sugatassa sugatacīvarappamāṇa’’ntiādīsu viya saññāsaddavasena vuttaṃ. Evaṃ pavattiyaṃ akusalavipākānaṃ pavattiṃ dassetvā idāni paṭisandhiyaṃ dassetuṃ ‘‘ekādasavidhāna’’ntiādi vuttaṃ. Uddhaccacetanāya pavattivipākadānamattaṃ vinā paṭisandhidānābhāvato āha ‘‘hitvā uddhaccamānasa’’nti. Kiṃ panettha kāraṇaṃ, adhimokkhavirahena sabbadubbalampi vicikicchāsahagataṃ paṭisandhiṃ ākaḍḍhati, adhimokkhasabhāvato tato balavatarampi uddhaccasahagataṃ nākaḍḍhatīti? Paṭisandhidānasabhāvābhāvato. ‘‘Balavaṃ ākaḍḍhati, dubbalaṃ nākaḍḍhatī’’ti hi ayaṃ vicāraṇā paṭisandhidānasabhāvesuyeva. Yassa pana paṭisandhidānasabhāvo eva natthi, na tassa balavabhāvo paṭisandhiākaḍḍhane kāraṇanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ panetaṃ viññātabbaṃ ‘‘uddhaccasahagatassa paṭisandhidānasabhāvo natthī’’ti? Dassanenapahātabbesu anāgatattā. Tividhā hi akusalā dassanenapahātabbā, bhāvanāyapahātabbā, siyā dassanenapahātabbā siyā bhāvanāyapahātabbāti. Tattha diṭṭhisampayuttavicikicchāsahagatacittuppādā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dassanenapahātabbā"
      },
      " nāma. Yathāha ‘‘katame dhammā dassanenapahātabbā? Cattāro diṭṭhigatasampayuttacittuppādā ",
      " vicikicchāsahagato cittuppādo’’ti (dha. sa. 1408). Te hi paṭhamaṃ nibbānadassanato ‘‘dassana’’nti laddhanāmena sotāpattimaggeneva pahātabbattā ‘‘dassanenapahātabbā’’ti vuccanti. Uddhaccasahagatacittuppādo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhāvanāyapahātabbo"
      },
      " nāma. Yathāha ‘‘katame dhammā bhāvanāyapahātabbā? Uddhaccasahagato cittuppādo’’ti. So hi aggamaggena pahātabbattā ‘‘bhāvanāyapahātabbo’’ti vutto. Uparimaggattayañhi paṭhamamaggena diṭṭhasmiṃyeva bhāvanāvasena uppajjati, na adiṭṭhapubbaṃ kiñci passati, tasmā ‘‘bhāvanā’’ti vuccati. Diṭṭhivippayuttadomanassasahagatacittuppādā pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "siyā dassanenapahātabbā siyā bhāvanāyapahātabbā"
      },
      " nāma. Yathāha ‘‘cattāro diṭṭhigatavippayuttā lobhasahagatacittuppādā dve domanassasahagatacittuppādā. Ime dhammā siyā dassanenapahātabbā siyā bhāvanāyapahātabbā’’ti (dha. sa. 1409). Te hi apāyanibbattakāvatthāya paṭhamamaggena, sesāvatthāya uparimaggehi pahīyamānattā siyā dassanenapahātabbā siyā bhāvanāyapahātabbā nāma. Tattha siyā dassanenapahātabbampi dassanenapahātabbasāmaññena idha ‘‘dassanenapahātabbā’’tveva voharanti. Yadi ca uddhaccasahagataṃ paṭisandhiṃ dadeyya, tadā akusalapaṭisandhiyā sugatiyaṃ asambhavato apāyesveva dadeyya, apāyagamanīyañca ekantena dassanenapahātabbā siyā, itarathā apāyagamanīyassa appahīnattā sekhānaṃ apāyuppatti āpajjati, na ca panetaṃ yuttaṃ, ‘‘catūhapāyehi ca vippamutto (khu. pā. 6.11; su. ni. 234), avinipātadhammo’’tiādivacanehi saha virujjhanato, sati ca panetassa dassanenapahātabbabhāve ‘‘siyā dassanenapahātabbā’’ti imassa vibhaṅge vattabbaṃ siyā, na ca panetaṃ vuttanti. Atha siyā ‘‘apāyagamanīyo rāgo doso moho tadekaṭṭhā ca kilesā’’ti evaṃ dassanenapahātabbesu vuttattā uddhaccasahagatassāpi tattha saṅgaho sakkā kātunti? Taṃ na, tassa niyāmato bhāvanāyapahātabbabhāvena vuttattāti ",
      " tasmā dassanenapahātabbesu avacanameva paṭisandhidānābhāvaṃ sādhetīti."
    ],
    "innerText": "Kathaṃ panetaṃ viññātabbaṃ ‘‘uddhaccasahagatassa paṭisandhidānasabhāvo natthī’’ti? Dassanenapahātabbesu anāgatattā. Tividhā hi akusalā dassanenapahātabbā, bhāvanāyapahātabbā, siyā dassanenapahātabbā siyā bhāvanāyapahātabbāti. Tattha diṭṭhisampayuttavicikicchāsahagatacittuppādā dassanenapahātabbā nāma. Yathāha ‘‘katame dhammā dassanenapahātabbā? Cattāro diṭṭhigatasampayuttacittuppādā vicikicchāsahagato cittuppādo’’ti (dha. sa. 1408). Te hi paṭhamaṃ nibbānadassanato ‘‘dassana’’nti laddhanāmena sotāpattimaggeneva pahātabbattā ‘‘dassanenapahātabbā’’ti vuccanti. Uddhaccasahagatacittuppādo bhāvanāyapahātabbo nāma. Yathāha ‘‘katame dhammā bhāvanāyapahātabbā? Uddhaccasahagato cittuppādo’’ti. So hi aggamaggena pahātabbattā ‘‘bhāvanāyapahātabbo’’ti vutto. Uparimaggattayañhi paṭhamamaggena diṭṭhasmiṃyeva bhāvanāvasena uppajjati, na adiṭṭhapubbaṃ kiñci passati, tasmā ‘‘bhāvanā’’ti vuccati. Diṭṭhivippayuttadomanassasahagatacittuppādā pana siyā dassanenapahātabbā siyā bhāvanāyapahātabbā nāma. Yathāha ‘‘cattāro diṭṭhigatavippayuttā lobhasahagatacittuppādā dve domanassasahagatacittuppādā. Ime dhammā siyā dassanenapahātabbā siyā bhāvanāyapahātabbā’’ti (dha. sa. 1409). Te hi apāyanibbattakāvatthāya paṭhamamaggena, sesāvatthāya uparimaggehi pahīyamānattā siyā dassanenapahātabbā siyā bhāvanāyapahātabbā nāma. Tattha siyā dassanenapahātabbampi dassanenapahātabbasāmaññena idha ‘‘dassanenapahātabbā’’tveva voharanti. Yadi ca uddhaccasahagataṃ paṭisandhiṃ dadeyya, tadā akusalapaṭisandhiyā sugatiyaṃ asambhavato apāyesveva dadeyya, apāyagamanīyañca ekantena dassanenapahātabbā siyā, itarathā apāyagamanīyassa appahīnattā sekhānaṃ apāyuppatti āpajjati, na ca panetaṃ yuttaṃ, ‘‘catūhapāyehi ca vippamutto (khu. pā. 6.11; su. ni. 234), avinipātadhammo’’tiādivacanehi saha virujjhanato, sati ca panetassa dassanenapahātabbabhāve ‘‘siyā dassanenapahātabbā’’ti imassa vibhaṅge vattabbaṃ siyā, na ca panetaṃ vuttanti. Atha siyā ‘‘apāyagamanīyo rāgo doso moho tadekaṭṭhā ca kilesā’’ti evaṃ dassanenapahātabbesu vuttattā uddhaccasahagatassāpi tattha saṅgaho sakkā kātunti? Taṃ na, tassa niyāmato bhāvanāyapahātabbabhāvena vuttattāti tasmā dassanenapahātabbesu avacanameva paṭisandhidānābhāvaṃ sādhetīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nanu ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisambhidāvibhaṅge"
      },
      " –"
    ],
    "innerText": "Nanu ca paṭisambhidāvibhaṅge –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Yasmiṃ samaye akusalaṃ cittaṃ uppannaṃ hoti upekkhāsahagataṃ uddhaccasampayuttaṃ, rūpārammaṇaṃ vā…pe… dhammārammaṇaṃ vā yaṃ yaṃ vā panārabbha, tasmiṃ samaye phasso hoti…pe… avikkhepo hoti, ime dhammā akusalā. Imesu dhammesu ñāṇaṃ dhammapaṭisambhidā, tesaṃ vipāke ñāṇaṃ atthapaṭisambhidā’’ti (vibha. 731) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ ",
      " uddhaccasahagatacittuppādaṃ uddharitvā tassa vipākopi uddhaṭoti kathamassa paṭisandhidānābhāvo sampaṭicchitabboti? Na idaṃ paṭisandhidānaṃ sandhāya uddhaṭaṃ, atha kho pavattivipākaṃ sandhāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭṭhāne"
      },
      " pana –"
    ],
    "innerText": "Evaṃ uddhaccasahagatacittuppādaṃ uddharitvā tassa vipākopi uddhaṭoti kathamassa paṭisandhidānābhāvo sampaṭicchitabboti? Na idaṃ paṭisandhidānaṃ sandhāya uddhaṭaṃ, atha kho pavattivipākaṃ sandhāya. Paṭṭhāne pana –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Sahajātā dassanenapahātabbā cetanā cittasamuṭṭhānānaṃ rūpānaṃ kammapaccayena paccayo, nānakkhaṇikā dassanenapahātabbā cetanā vipākānaṃ khandhānaṃ kaṭattā ca rūpānaṃ kammapaccayena paccayo’’ti (paṭṭhā. 2.8.89) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Dassanenapahātabbacetanāya eva sahajātanānakkhaṇikakammapaccayabhāvaṃ uddharitvāva ‘‘sahajātā bhāvanāyapahātabbā cetanā cittasamuṭṭhānānaṃ rūpānaṃ kammapaccayena paccayo’’ti bhāvanāyapahātabbacetanāya sahajātakammapaccayabhāvova uddhaṭo, na pana nānakkhaṇikakammapaccayabhāvo. Tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccanīyanaye"
      },
      "pi –"
    ],
    "innerText": "Dassanenapahātabbacetanāya eva sahajātanānakkhaṇikakammapaccayabhāvaṃ uddharitvāva ‘‘sahajātā bhāvanāyapahātabbā cetanā cittasamuṭṭhānānaṃ rūpānaṃ kammapaccayena paccayo’’ti bhāvanāyapahātabbacetanāya sahajātakammapaccayabhāvova uddhaṭo, na pana nānakkhaṇikakammapaccayabhāvo. Tathā paccanīyanayepi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Dassanenapahātabbo dhammo nevadassanenanabhāvanāyapahātabbassa dhammassa ārammaṇapaccayena paccayo, sahajāta… upanissaya…pe… pacchājāta… kammapaccayena paccayo’’ti (paṭṭhā. 2.8.98) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Dassanenapahātabbasseva ",
      " kammapaccayabhāvaṃ uddharitvā –"
    ],
    "innerText": "Dassanenapahātabbasseva kammapaccayabhāvaṃ uddharitvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Bhāvanāyapahātabbo dhammo nevadassanenanabhāvanāyapahātabbassa dhammassa ārammaṇapaccayena paccayo, sahajāta… upanissaya… pacchājātapaccayena paccayo’’ti (paṭṭhā. 2.8.99) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Bhāvanāyapahātabbassa dhammassa sahajātādipaccayabhāvova vutto, na pana kammapaccayabhāvo, na ca nānakkhaṇikakammapaccayaṃ vinā paṭisandhiākaḍḍhanaṃ atthi, tasmā natthi tassa sabbathāpi paṭisandhidānaṃ. Pavattivipākaṃ panassa na sakkā nivāretuṃ paṭisambhidāvibhaṅge uddhaccasahagatānampi vipākassa uddhaṭattā, nānakkhaṇikakammapaccayassa ca paṭisandhivipākameva sandhāya anuddhaṭattā. Evañca pana katvā yadeke ācariyā vadanti ‘‘uddhaccacetanā ubhayavipākampi ",
      " na deti paṭṭhāne nānakkhaṇikakammapaccayassa anuddhaṭattā’’ti, taṃ tesaṃ abhinivesamattamevāti daṭṭhabbaṃ."
    ],
    "innerText": "Bhāvanāyapahātabbassa dhammassa sahajātādipaccayabhāvova vutto, na pana kammapaccayabhāvo, na ca nānakkhaṇikakammapaccayaṃ vinā paṭisandhiākaḍḍhanaṃ atthi, tasmā natthi tassa sabbathāpi paṭisandhidānaṃ. Pavattivipākaṃ panassa na sakkā nivāretuṃ paṭisambhidāvibhaṅge uddhaccasahagatānampi vipākassa uddhaṭattā, nānakkhaṇikakammapaccayassa ca paṭisandhivipākameva sandhāya anuddhaṭattā. Evañca pana katvā yadeke ācariyā vadanti ‘‘uddhaccacetanā ubhayavipākampi na deti paṭṭhāne nānakkhaṇikakammapaccayassa anuddhaṭattā’’ti, taṃ tesaṃ abhinivesamattamevāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yadi ca te vadeyyuṃ – yathā ‘‘vipākadhammadhammā’’ti ettha vipāka-saddena vipākārahatā vuccati, evaṃ idhāpi uddhaccasahagatānaṃ vipākārahataṃ sandhāya ‘‘tesaṃ vipāke ñāṇa’’nti vuttaṃ. Yathā saddhindriyavinimuttassa adhimuccanaṭṭhassa abhāvepi saddhindriyassa adhimuccanasattivisesaṃ gahetvā saddhindriyadhammo adhimuccanaṭṭho atthoti vuccati, evamidhāpi dhammavinimuttassa vipākārahabhāvassa abhāvepi dhammānameva vipākārahasāmatthiyaṃ gahetvā tassa atthibhāvo vutto. Yadi ca te pavattivipākaṃ dadeyyuṃ, yathā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Sukhāya vedanāya sampayutto dhammo dukkhāya vedanāya sampayuttassa dhammassa kammapaccayena paccayo, nānakkhaṇikā’’ti (paṭṭhā. 1.2.57) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Pavattivipākassapi ",
      " vasena nānakkhaṇikakammapaccayo vutto, evametthāpi nānakkhaṇikakammapaccayabhāvo vattabbo siyā. Na hi labbhamānassa avacane kāraṇaṃ atthīti tasmā yathādhammasāsane avacanampi abhāvameva dīpeti. Apica yadi uddhaccasahagatassa pavattivipākadānaṃ adhippetaṃ siyā, tadā ‘‘anupādinnupādāniyo dhammo upādinnupādāniyassa dhammassa na kammapaccayena paccayo’’ti paṭisedho na kātabbo siyā. Na hi ṭhapetvā uddhaccaṃ añño koci anupādinnupādāniyo dhammo upādinnupādāniyassa dhammassa paccayo bhavituṃ asamattho atthīti, tayidametesaṃ abhilāpamattaṃ. Tathā hi yaṃ tāva vuttaṃ ‘‘vipākārahabhāvaṃ gahetvā tesaṃ vipāketi vutta’’nti, tadeva tassa vipākasabbhāvaṃ dīpeti. Na hi vipākārahabhāve sati abhiññādīnaṃ viya tassa avipākatāya kāraṇaṃ atthīti. Yampi vuttaṃ ‘‘nānakkhaṇikakammapaccayassa avacanaṃ vipākabhāvaṃ dīpetī’’ti, tampi na sundaraṃ, labbhamānassāpi katthaci kenaci adhippāyena avacanato. Tathā hi dhammasaṅgaṇiyaṃ labbhamānampi hadayavatthu na vuttaṃ. Tasmā yadi pavattivipākaṃ sandhāya nānakkhaṇikakammapaccayabhāvo vucceyya, tadā paṭisandhivipākadānampissa maññeyyunti labbhamānassapi pavattivipākassa vasena nānakkhaṇikakammapaccayabhāvo na vuttoti. Yaṃ pana anupādinnupādāniyassa upādinnupādāniyaṃ pati kammapaccayapaṭikkhepavacanaṃ, taṃ abhiññākusalādike sandhāyāti na ettāvatā uddhaccasahagatassa ",
      " pavattivipākadānaṃ sabbathāpi paṭikkhipituṃ sakkāti. Yampi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathāyaṃ"
      },
      " ‘‘yathā ca abhiññācetanā, evamuddhaccacetanāpi ‘saṅkhārapaccayā viññāṇa’nti ettha apanetabbā’’ti vuttaṃ, tampi uddhaccacetanāya tattha niddisiyamānāya yathā itarā paṭisandhipavattivasena duvidhassapi vipākaviññāṇassa paccayo, evamuddhaccacetanāpīti gaṇheyyunti vuttaṃ, na tassa pavattivipākābhāvatoti."
    ],
    "innerText": "Pavattivipākassapi vasena nānakkhaṇikakammapaccayo vutto, evametthāpi nānakkhaṇikakammapaccayabhāvo vattabbo siyā. Na hi labbhamānassa avacane kāraṇaṃ atthīti tasmā yathādhammasāsane avacanampi abhāvameva dīpeti. Apica yadi uddhaccasahagatassa pavattivipākadānaṃ adhippetaṃ siyā, tadā ‘‘anupādinnupādāniyo dhammo upādinnupādāniyassa dhammassa na kammapaccayena paccayo’’ti paṭisedho na kātabbo siyā. Na hi ṭhapetvā uddhaccaṃ añño koci anupādinnupādāniyo dhammo upādinnupādāniyassa dhammassa paccayo bhavituṃ asamattho atthīti, tayidametesaṃ abhilāpamattaṃ. Tathā hi yaṃ tāva vuttaṃ ‘‘vipākārahabhāvaṃ gahetvā tesaṃ vipāketi vutta’’nti, tadeva tassa vipākasabbhāvaṃ dīpeti. Na hi vipākārahabhāve sati abhiññādīnaṃ viya tassa avipākatāya kāraṇaṃ atthīti. Yampi vuttaṃ ‘‘nānakkhaṇikakammapaccayassa avacanaṃ vipākabhāvaṃ dīpetī’’ti, tampi na sundaraṃ, labbhamānassāpi katthaci kenaci adhippāyena avacanato. Tathā hi dhammasaṅgaṇiyaṃ labbhamānampi hadayavatthu na vuttaṃ. Tasmā yadi pavattivipākaṃ sandhāya nānakkhaṇikakammapaccayabhāvo vucceyya, tadā paṭisandhivipākadānampissa maññeyyunti labbhamānassapi pavattivipākassa vasena nānakkhaṇikakammapaccayabhāvo na vuttoti. Yaṃ pana anupādinnupādāniyassa upādinnupādāniyaṃ pati kammapaccayapaṭikkhepavacanaṃ, taṃ abhiññākusalādike sandhāyāti na ettāvatā uddhaccasahagatassa pavattivipākadānaṃ sabbathāpi paṭikkhipituṃ sakkāti. Yampi aṭṭhakathāyaṃ ‘‘yathā ca abhiññācetanā, evamuddhaccacetanāpi ‘saṅkhārapaccayā viññāṇa’nti ettha apanetabbā’’ti vuttaṃ, tampi uddhaccacetanāya tattha niddisiyamānāya yathā itarā paṭisandhipavattivasena duvidhassapi vipākaviññāṇassa paccayo, evamuddhaccacetanāpīti gaṇheyyunti vuttaṃ, na tassa pavattivipākābhāvatoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ācariyabuddhamittādayo"
      },
      " pana uddhaccasahagataṃ dvidhā vibhajitvā ekassa ubhayavipākadānaṃ, ekassa sabbathāpi vipākābhāvaṃ vaṇṇenti. Tesañhi ayaṃ vinicchayo – atthi uddhaccaṃ bhāvanāyapahātabbampi, atthi nabhāvanāyapahātabbampi. Tesu bhāvanāyapahātabbaṃ sekhasantānappavattaṃ, itaraṃ puthujjanasantānappavattaṃ. Phaladānañca puthujjanasantāne pavattasseva, netarassa. Tathā hi dassanabhāvanānaṃ abhāvepi yesaṃ puthujjanānaṃ, sekhānañca dassanabhāvanāhi bhavitabbaṃ, tesaṃ taduppattikāle tāhi pahātuṃ sakkuṇeyyā akusalā ‘‘dassanenapahātabbā, bhāvanāyapahātabbā’’ti ca vuccanti. Puthujjanānaṃ pana bhāvanāya abhāvato bhāvanāyapahātabbacintā natthi, tena tesaṃ pavattamānā te dassanena pahātuṃ asakkuṇeyyāpi ‘‘bhāvanāyapahātabbā’’ti na vuccanti. Yadi vucceyyuṃ, dassanenapahātabbā bhāvanāyapahātabbānaṃ kesañci keci kadāci ārammaṇārammaṇādhipatiupanissayapaccayehi paccayā bhaveyyuṃ. Sakabhaṇḍe chandarāgādīnañhi kesañci sakkāyadiṭṭhādayo keci atītādīsu kismiñci kāle ārammaṇādhipatiupanissayehi paccayā hontīti natthi, na ca paṭṭhāne ‘‘dassanenapahātabbā bhāvanāyapahātabbānaṃ kenaci paccayena paccayo’’ti vuttā, tasmā natthi puthujjanesu pavattamānānamakusalānaṃ bhāvanāyapahātabbapariyāyo. Yadi tattha avacanameva pamāṇaṃ, evaṃ sati sekhasantānapavattānampi akusalānaṃ bhāvanāyapahātabbapariyāyo natthīti āpajjatīti? Nāpajjati, sekhasantānappavattānaṃ bhāvanāya pahātuṃ sakkuṇeyyattā. Teneva ca kiñci katvā sekhānaṃ dassanenapahātabbānaṃ akusalānaṃ pahīnabhāvena assādanābhinandanānaṃ vatthūni na honti. Pahīnatāya eva somanassassa hetubhūtā, avikkhepahetubhūtā ca na domanassaṃ, uddhaccañca uppādentīti na tesaṃ ārammaṇārammaṇādhipatipakatūpanissayabhāvaṃ ",
      " gacchanti. Na hi pahīnakilese upanissāya ariyā rāgadosavikkhepe uppādenti. Vuttañca ‘‘sotāpattimaggena ye kilesā pahīnā, te kilese na puneti, na pacceti, na paccāgacchatīti sugato, sakadāgāmi…pe… arahattamaggena…pe… sugato’’ti. Puthujjanānaṃ pana dassanena pahātuṃ sakkuṇeyyā ",
      " dassanena pahātuṃ asakkuṇeyyānaṃ kenaci paccayena paccayā na hontīti na sakkā vattuṃ, ‘‘diṭṭhiṃ assādeti abhinandati, taṃ ārabbha rāgo uppajjati, diṭṭhi uppajjati, vicikicchā uppajjati, uddhaccaṃ uppajjati, vicikicchaṃ ārabbha vicikicchā uppajjati, diṭṭhi uppajjati, uddhaccaṃ uppajjatī’’ti (paṭṭhā. 1.1.407) diṭṭhivicikicchānaṃ uddhaccārammaṇabhāvassa vuttattā. Ettha hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddhacca"
      },
      "nti uddhaccasahagataṃ cittuppādaṃ sandhāya vuttaṃ, na dassanenapahātabbesupi labbhamānacetasikaṃ uddhaccaṃ. Evañca katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhipatipaccayaniddese"
      },
      " ‘‘diṭṭhiṃ garuṃ katvā assādeti abhinandati, taṃ garuṃ katvā rāgo uppajjati, diṭṭhi uppajjatī’’ti (paṭṭhā. 1.1.415) ettakameva vuttaṃ, na vuttaṃ ‘‘uddhaccaṃ uppajjatī’’ti, tasmā sekhasantānappavattānamakusalānaṃ dassanenapahātabbānaṃ kenaci paccayena paccayattābhāvato puthujjanānaṃ santāneva dassanenapahātabbānamakusalānaṃ paccayā na hontīti na sakkā vattunti paṭṭhāne dassanenapahātabbānaṃ bhāvanāyapahātabbassa ārammaṇārammaṇādhipatiupanissayapaccayattānuddharaṇaṃ sekhasantānappavattānaṃ bhāvanāyapahātabbapariyāyabhāvaṃ sādheti, puthujjanasantāneyeva nadassanenapahātabbānamakusalānaṃ bhāvanāyapahātabbapariyāyabhāvaṃ na sādheti, tasmā dassanabhāvanāhi pahātabbānaṃ atītādibhāvena navattabbattepi yādisānaṃ tāhi anuppattidhammatā āpādetabbā, te puthujjanesu pavattamānā ",
      " dassanena pahātuṃ sakkuṇeyyā dassanamaggāpekkhāya tadappavattiyampi dassanenapahātabbā nāma. Sekhesu pavattamānā bhāvanāya pahātuṃ sakkuṇeyyā tadappavattiyampi tadapekkhāya bhāvanāyapahātabbā nāma. Dassanena pahātuṃ asakkuṇeyyā pana puthujjanesu pavattamānā heṭṭhā vuttanayena nevadassanenapahātabbā nabhāvanāyapahātabbā, tesu bhāvanāyapahātabbā sahāyavirahato vipākaṃ na janenti. Tathā hi tesaṃ dassanenapahātabbasaṅkhātaṃ sahakārīkāraṇaṃ sahāyabhūtaṃ natthīti bhāvanāyapahātabbacetanāya nānakkhaṇikakammapaccayabhāvo na vutto. Apekkhitabbadassanabhāvanārahitānaṃ pana puthujjanesu uppajjamānānaṃ sakabhaṇḍe chandarāgādīnaṃ, uddhaccasahagatacittuppādassa ca saṃyojanattayatadekaṭṭhakilesānaṃ anupacchinnatāya aparikkhīṇasahāyānaṃ vipākuppādanaṃ na sakkā paṭikkhipitunti uddhaccasahagatadhammānaṃ vipāko vibhaṅge vuttoti."
    ],
    "innerText": "Ācariyabuddhamittādayo pana uddhaccasahagataṃ dvidhā vibhajitvā ekassa ubhayavipākadānaṃ, ekassa sabbathāpi vipākābhāvaṃ vaṇṇenti. Tesañhi ayaṃ vinicchayo – atthi uddhaccaṃ bhāvanāyapahātabbampi, atthi nabhāvanāyapahātabbampi. Tesu bhāvanāyapahātabbaṃ sekhasantānappavattaṃ, itaraṃ puthujjanasantānappavattaṃ. Phaladānañca puthujjanasantāne pavattasseva, netarassa. Tathā hi dassanabhāvanānaṃ abhāvepi yesaṃ puthujjanānaṃ, sekhānañca dassanabhāvanāhi bhavitabbaṃ, tesaṃ taduppattikāle tāhi pahātuṃ sakkuṇeyyā akusalā ‘‘dassanenapahātabbā, bhāvanāyapahātabbā’’ti ca vuccanti. Puthujjanānaṃ pana bhāvanāya abhāvato bhāvanāyapahātabbacintā natthi, tena tesaṃ pavattamānā te dassanena pahātuṃ asakkuṇeyyāpi ‘‘bhāvanāyapahātabbā’’ti na vuccanti. Yadi vucceyyuṃ, dassanenapahātabbā bhāvanāyapahātabbānaṃ kesañci keci kadāci ārammaṇārammaṇādhipatiupanissayapaccayehi paccayā bhaveyyuṃ. Sakabhaṇḍe chandarāgādīnañhi kesañci sakkāyadiṭṭhādayo keci atītādīsu kismiñci kāle ārammaṇādhipatiupanissayehi paccayā hontīti natthi, na ca paṭṭhāne ‘‘dassanenapahātabbā bhāvanāyapahātabbānaṃ kenaci paccayena paccayo’’ti vuttā, tasmā natthi puthujjanesu pavattamānānamakusalānaṃ bhāvanāyapahātabbapariyāyo. Yadi tattha avacanameva pamāṇaṃ, evaṃ sati sekhasantānapavattānampi akusalānaṃ bhāvanāyapahātabbapariyāyo natthīti āpajjatīti? Nāpajjati, sekhasantānappavattānaṃ bhāvanāya pahātuṃ sakkuṇeyyattā. Teneva ca kiñci katvā sekhānaṃ dassanenapahātabbānaṃ akusalānaṃ pahīnabhāvena assādanābhinandanānaṃ vatthūni na honti. Pahīnatāya eva somanassassa hetubhūtā, avikkhepahetubhūtā ca na domanassaṃ, uddhaccañca uppādentīti na tesaṃ ārammaṇārammaṇādhipatipakatūpanissayabhāvaṃ gacchanti. Na hi pahīnakilese upanissāya ariyā rāgadosavikkhepe uppādenti. Vuttañca ‘‘sotāpattimaggena ye kilesā pahīnā, te kilese na puneti, na pacceti, na paccāgacchatīti sugato, sakadāgāmi…pe… arahattamaggena…pe… sugato’’ti. Puthujjanānaṃ pana dassanena pahātuṃ sakkuṇeyyā dassanena pahātuṃ asakkuṇeyyānaṃ kenaci paccayena paccayā na hontīti na sakkā vattuṃ, ‘‘diṭṭhiṃ assādeti abhinandati, taṃ ārabbha rāgo uppajjati, diṭṭhi uppajjati, vicikicchā uppajjati, uddhaccaṃ uppajjati, vicikicchaṃ ārabbha vicikicchā uppajjati, diṭṭhi uppajjati, uddhaccaṃ uppajjatī’’ti (paṭṭhā. 1.1.407) diṭṭhivicikicchānaṃ uddhaccārammaṇabhāvassa vuttattā. Ettha hi uddhaccanti uddhaccasahagataṃ cittuppādaṃ sandhāya vuttaṃ, na dassanenapahātabbesupi labbhamānacetasikaṃ uddhaccaṃ. Evañca katvā adhipatipaccayaniddese ‘‘diṭṭhiṃ garuṃ katvā assādeti abhinandati, taṃ garuṃ katvā rāgo uppajjati, diṭṭhi uppajjatī’’ti (paṭṭhā. 1.1.415) ettakameva vuttaṃ, na vuttaṃ ‘‘uddhaccaṃ uppajjatī’’ti, tasmā sekhasantānappavattānamakusalānaṃ dassanenapahātabbānaṃ kenaci paccayena paccayattābhāvato puthujjanānaṃ santāneva dassanenapahātabbānamakusalānaṃ paccayā na hontīti na sakkā vattunti paṭṭhāne dassanenapahātabbānaṃ bhāvanāyapahātabbassa ārammaṇārammaṇādhipatiupanissayapaccayattānuddharaṇaṃ sekhasantānappavattānaṃ bhāvanāyapahātabbapariyāyabhāvaṃ sādheti, puthujjanasantāneyeva nadassanenapahātabbānamakusalānaṃ bhāvanāyapahātabbapariyāyabhāvaṃ na sādheti, tasmā dassanabhāvanāhi pahātabbānaṃ atītādibhāvena navattabbattepi yādisānaṃ tāhi anuppattidhammatā āpādetabbā, te puthujjanesu pavattamānā dassanena pahātuṃ sakkuṇeyyā dassanamaggāpekkhāya tadappavattiyampi dassanenapahātabbā nāma. Sekhesu pavattamānā bhāvanāya pahātuṃ sakkuṇeyyā tadappavattiyampi tadapekkhāya bhāvanāyapahātabbā nāma. Dassanena pahātuṃ asakkuṇeyyā pana puthujjanesu pavattamānā heṭṭhā vuttanayena nevadassanenapahātabbā nabhāvanāyapahātabbā, tesu bhāvanāyapahātabbā sahāyavirahato vipākaṃ na janenti. Tathā hi tesaṃ dassanenapahātabbasaṅkhātaṃ sahakārīkāraṇaṃ sahāyabhūtaṃ natthīti bhāvanāyapahātabbacetanāya nānakkhaṇikakammapaccayabhāvo na vutto. Apekkhitabbadassanabhāvanārahitānaṃ pana puthujjanesu uppajjamānānaṃ sakabhaṇḍe chandarāgādīnaṃ, uddhaccasahagatacittuppādassa ca saṃyojanattayatadekaṭṭhakilesānaṃ anupacchinnatāya aparikkhīṇasahāyānaṃ vipākuppādanaṃ na sakkā paṭikkhipitunti uddhaccasahagatadhammānaṃ vipāko vibhaṅge vuttoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadi evaṃ, apekkhitabbadassanabhāvanārahitānaṃ akusalānaṃ ‘‘nevadassanenanabhāvanāyapahātabbā’’ti vattabbatā āpajjatīti? Nāpajjati, appahātabbasabhāvānaṃ kusalādīnaṃ ‘‘nevadassanenanabhāvanāyapahātabbā’’ti vuttattā, appahātabbaviruddhasabhāvattā ca akusalānaṃ ",
      ". Yadi evaṃ te imasmiṃ tike navattabbāti vattabbā āpajjantīti? Nāpajjanti, cittuppādakaṇḍe dassitānaṃ dvādasākusalacittuppādānaṃ dvīhi padehi saṅgahitattā. Yathā hi uppannattike dhammavasena sabbesaṃ saṅkhatadhammānaṃ saṅgahitattā kālavasena asaṅgahitāpi atītā ‘‘navattabbā’’ti na ",
      " vuttā cittuppādānurūpena saṅgahitesu navattabbassa abhāvā, evaṃ idhāpi cittuppādabhāvena saṅgahitesu navattabbassa abhāvā ‘‘navattabbā’’ti na vuttā. Sabbena sabbañhi dhammavasena asaṅgahitassa tikadukesu navattabbatāpatti. Yattha hi cittuppādo koci niyogato navattabbo atthi, tattha tesaṃ catuttho koṭṭhāso atthīti yathāvuttapadesu viya tatthāpi bhinditvā bhājetabbe cittuppāde bhinditvā bhājeti ‘‘siyā navattabbāparittārammaṇā’’tiādinā, tadabhāvā uppannattike, idha ca tathā na vuttanti."
    ],
    "innerText": "Yadi evaṃ, apekkhitabbadassanabhāvanārahitānaṃ akusalānaṃ ‘‘nevadassanenanabhāvanāyapahātabbā’’ti vattabbatā āpajjatīti? Nāpajjati, appahātabbasabhāvānaṃ kusalādīnaṃ ‘‘nevadassanenanabhāvanāyapahātabbā’’ti vuttattā, appahātabbaviruddhasabhāvattā ca akusalānaṃ . Yadi evaṃ te imasmiṃ tike navattabbāti vattabbā āpajjantīti? Nāpajjanti, cittuppādakaṇḍe dassitānaṃ dvādasākusalacittuppādānaṃ dvīhi padehi saṅgahitattā. Yathā hi uppannattike dhammavasena sabbesaṃ saṅkhatadhammānaṃ saṅgahitattā kālavasena asaṅgahitāpi atītā ‘‘navattabbā’’ti na vuttā cittuppādānurūpena saṅgahitesu navattabbassa abhāvā, evaṃ idhāpi cittuppādabhāvena saṅgahitesu navattabbassa abhāvā ‘‘navattabbā’’ti na vuttā. Sabbena sabbañhi dhammavasena asaṅgahitassa tikadukesu navattabbatāpatti. Yattha hi cittuppādo koci niyogato navattabbo atthi, tattha tesaṃ catuttho koṭṭhāso atthīti yathāvuttapadesu viya tatthāpi bhinditvā bhājetabbe cittuppāde bhinditvā bhājeti ‘‘siyā navattabbāparittārammaṇā’’tiādinā, tadabhāvā uppannattike, idha ca tathā na vuttanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha vā yathā sappaṭighehi samānasabhāvattā rūpadhātuyaṃ ‘‘tayo mahābhūtā sappaṭighā’’ti vuttā, yathāha ‘‘asaññasattānaṃ anidassanasappaṭighaṃ ekaṃ mahābhūta’’nti, evaṃ puthujjanānaṃ pavattamānā bhāvanāyapahātabbasamānasabhāvā ‘‘bhāvanāyapahātabbā’’ti vucceyyunti natthi navattabbatāpasaṅgo. Evañca sati puthujjanānaṃ pavattamānāpi bhāvanāyapahātabbā sakabhaṇḍe chandarāgādayo parabhaṇḍe chandarāgādīnaṃ upanissayapaccayo, rāgo ca rāgadiṭṭhīnaṃ adhipatipaccayoti ayamattho laddho hoti. Teneva hi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Bhāvanāyapahātabbo dhammo dassanenapahātabbassa dhammassa upanissayapaccayena paccayo, ārammaṇūpanissayo, pakatūpanissayo’’ti (paṭṭhā. 2.8.84) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Imissā niddese dassanenapahātabbānaṃ upanissayapaccayabhāvīdhamme niddisantena bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Pakatūpanissayo – patthanaṃ upanissāya pāṇaṃ hanati…pe… saṅghaṃ bhindati, bhāvanāyapahātabbo rāgo doso moho māno patthanā dassanenapahātabbassa rāgassa dosassa mohassa mānassa diṭṭhiyā patthanāya upanissayapaccayena paccayo ",
      ". Sakabhaṇḍe chandarāgo parabhaṇḍe chandarāgassa upa…pe… sakapariggahe chandarāgo parapariggahe chandarāgassa upanissayapaccayena paccayo’’ti (paṭṭhā. 2.8.84) –"
    ],
    "innerText": "‘‘Pakatūpanissayo – patthanaṃ upanissāya pāṇaṃ hanati…pe… saṅghaṃ bhindati, bhāvanāyapahātabbo rāgo doso moho māno patthanā dassanenapahātabbassa rāgassa dosassa mohassa mānassa diṭṭhiyā patthanāya upanissayapaccayena paccayo . Sakabhaṇḍe chandarāgo parabhaṇḍe chandarāgassa upa…pe… sakapariggahe chandarāgo parapariggahe chandarāgassa upanissayapaccayena paccayo’’ti (paṭṭhā. 2.8.84) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Puthujjanasantāne ",
      " patthanādayo niddiṭṭhā."
    ],
    "innerText": "Puthujjanasantāne patthanādayo niddiṭṭhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evampi yathā aphoṭṭhabbattā rūpadhātuyaṃ tayo mahābhūtā na paramatthato sappaṭighā, evaṃ apekkhitabbabhāvanārahitā puthujjanesu pavattamānā sakabhaṇḍe chandarāgādayo pana paramatthato bhāvanāya pahātabbāti bhāvanāyapahātabbānaṃ nānakkhaṇikakammapaccayatā na vuttā, na ca ‘‘dassanenapahātabbā bhāvanāyapahātabbānaṃ kenaci paccayena paccayo’’ti vuttā. Ye hi dassanenapahātabbapaccayā kilesā, na te dassanato uddhaṃ pavattanti. Dassanenapahātabbapaccayassāpi pana uddhaccasahagatassa sahāyavekallamattameva dassanena kataṃ, na tassa koci bhāvo dassanena anuppattidhammataṃ āpāditoti tassa ekantabhāvanāyapahātabbatā vuttā, tasmā uddhaccabhāvena ekasabhāvasseva tassa sati sahāye vipākuppādanavacanaṃ, asati ca vipākānuppādanavacanaṃ na virujjhati. Tayidaṃ sabbametesaṃ ācariyānaṃ ahopurisikāramattaṃ. Kasmā? Uddhaccasahagatassa ekantabhāvanāyapahātabbabhāvena vuttattā. Evañhi vuttaṃ bhagavatā ‘‘katame dhammā bhāvanāyapahātabbā. Uddhaccasahagato cittuppādo’’ti (dha. sa. 1406). Yadi ca uddhaccasahagataṃ nabhāvanāyapahātabbaṃ abhavissa, yathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atītārammaṇattike"
      },
      " ‘‘niyogā anāgatārammaṇā natthī’’ti (dha. sa. 1433) vatvā vibhajja vuttaṃ, evamidhāpi ‘‘niyogā bhāvanāyapahātabbā natthī’’ti vatvā ‘‘uddhaccasahagato siyā bhāvanāyapahātabbo siyā navattabbo ‘dassanenapahātabbo’tipi ‘bhāvanāyapahātabbo’tipī’’tiādi vattabbaṃ siyā ",
      ", na ca tathā vuttaṃ. Yā ca ‘‘tamatthaṃ paṭipādentehi yadi vucceyyu’’ntiādinā yutti vuttā, sāpi ayutti. Kasmā? Dassanenapahātabbārammaṇānaṃ rāgadiṭṭhivicikicchāuddhaccānaṃ tena tena pahātabbabhāvavasena icchitattā. Yañca ‘‘uddhaccaṃ uppajjatī’’ti uddhaccasahagatacittuppādo vuttoti dassetuṃ adhipatipaccayaniddese uddhaccassa anuddharaṇaṃ kāraṇavasena vuttaṃ, tampi akāraṇaṃ aññatthāpi sāvasesapāṭhānaṃ dassanato. Tathā hi ‘‘atīto dhammo paccuppannassa dhammassa, anāgato dhammo paccuppannassa dhammassa ārammaṇapaccayena paccayo’’ti etesaṃ vibhaṅge cetopariyañāṇaggahaṇaṃ katvā ‘‘paccuppanno dhammo paccuppannassa dhammassā’’ti imassa vibhaṅge labbhamānampi cetopariyañāṇaṃ na gahitaṃ. Yampi bhāvanāyapahātabbassa vipākadānamhi dassanenapahātabbassa sahāyabhāvūpagamanaṃ vuttaṃ, tampi vicāretabbaṃ – kiṃ avijjādi viya dānasīlādīnaṃ upapattiyaṃyeva vipākadānasāmatthiyā ṭhānavasena dassanenapahātabbā bhāvanāyapahātabbānaṃ sahakārīkāraṇaṃ hoti, udāhu kileso viya kammassa paṭisandhidānamhīti ",
      "? Kiñcettha – yadi tāva purimo nayo, sekhasantāne bhāvanāyapahātabbassa akiriyābhāvo āpajjati, pahīnāvijjāmānataṇhānusayasmiṃ santāne dānādi viya sahāyavekallena avipākasabhāvataṃ āpannattā. Atha dutiyo, bhāvanāyapahātabbattena abhimatassāpi dassanenapahātabbabhāvo āpajjati, paṭisandhidāne sati apāyagamanīyasabhāvānativattanato, tasmā amhehi heṭṭhā vuttanayeneva uddhaccasahagatassa vipākadānaṃ sampaṭicchitabbaṃ, na yesaṃ kesañci vacanaṃ. Paṭṭhānānusārīhi bhavitabbanti."
    ],
    "innerText": "Evampi yathā aphoṭṭhabbattā rūpadhātuyaṃ tayo mahābhūtā na paramatthato sappaṭighā, evaṃ apekkhitabbabhāvanārahitā puthujjanesu pavattamānā sakabhaṇḍe chandarāgādayo pana paramatthato bhāvanāya pahātabbāti bhāvanāyapahātabbānaṃ nānakkhaṇikakammapaccayatā na vuttā, na ca ‘‘dassanenapahātabbā bhāvanāyapahātabbānaṃ kenaci paccayena paccayo’’ti vuttā. Ye hi dassanenapahātabbapaccayā kilesā, na te dassanato uddhaṃ pavattanti. Dassanenapahātabbapaccayassāpi pana uddhaccasahagatassa sahāyavekallamattameva dassanena kataṃ, na tassa koci bhāvo dassanena anuppattidhammataṃ āpāditoti tassa ekantabhāvanāyapahātabbatā vuttā, tasmā uddhaccabhāvena ekasabhāvasseva tassa sati sahāye vipākuppādanavacanaṃ, asati ca vipākānuppādanavacanaṃ na virujjhati. Tayidaṃ sabbametesaṃ ācariyānaṃ ahopurisikāramattaṃ. Kasmā? Uddhaccasahagatassa ekantabhāvanāyapahātabbabhāvena vuttattā. Evañhi vuttaṃ bhagavatā ‘‘katame dhammā bhāvanāyapahātabbā. Uddhaccasahagato cittuppādo’’ti (dha. sa. 1406). Yadi ca uddhaccasahagataṃ nabhāvanāyapahātabbaṃ abhavissa, yathā atītārammaṇattike ‘‘niyogā anāgatārammaṇā natthī’’ti (dha. sa. 1433) vatvā vibhajja vuttaṃ, evamidhāpi ‘‘niyogā bhāvanāyapahātabbā natthī’’ti vatvā ‘‘uddhaccasahagato siyā bhāvanāyapahātabbo siyā navattabbo ‘dassanenapahātabbo’tipi ‘bhāvanāyapahātabbo’tipī’’tiādi vattabbaṃ siyā , na ca tathā vuttaṃ. Yā ca ‘‘tamatthaṃ paṭipādentehi yadi vucceyyu’’ntiādinā yutti vuttā, sāpi ayutti. Kasmā? Dassanenapahātabbārammaṇānaṃ rāgadiṭṭhivicikicchāuddhaccānaṃ tena tena pahātabbabhāvavasena icchitattā. Yañca ‘‘uddhaccaṃ uppajjatī’’ti uddhaccasahagatacittuppādo vuttoti dassetuṃ adhipatipaccayaniddese uddhaccassa anuddharaṇaṃ kāraṇavasena vuttaṃ, tampi akāraṇaṃ aññatthāpi sāvasesapāṭhānaṃ dassanato. Tathā hi ‘‘atīto dhammo paccuppannassa dhammassa, anāgato dhammo paccuppannassa dhammassa ārammaṇapaccayena paccayo’’ti etesaṃ vibhaṅge cetopariyañāṇaggahaṇaṃ katvā ‘‘paccuppanno dhammo paccuppannassa dhammassā’’ti imassa vibhaṅge labbhamānampi cetopariyañāṇaṃ na gahitaṃ. Yampi bhāvanāyapahātabbassa vipākadānamhi dassanenapahātabbassa sahāyabhāvūpagamanaṃ vuttaṃ, tampi vicāretabbaṃ – kiṃ avijjādi viya dānasīlādīnaṃ upapattiyaṃyeva vipākadānasāmatthiyā ṭhānavasena dassanenapahātabbā bhāvanāyapahātabbānaṃ sahakārīkāraṇaṃ hoti, udāhu kileso viya kammassa paṭisandhidānamhīti ? Kiñcettha – yadi tāva purimo nayo, sekhasantāne bhāvanāyapahātabbassa akiriyābhāvo āpajjati, pahīnāvijjāmānataṇhānusayasmiṃ santāne dānādi viya sahāyavekallena avipākasabhāvataṃ āpannattā. Atha dutiyo, bhāvanāyapahātabbattena abhimatassāpi dassanenapahātabbabhāvo āpajjati, paṭisandhidāne sati apāyagamanīyasabhāvānativattanato, tasmā amhehi heṭṭhā vuttanayeneva uddhaccasahagatassa vipākadānaṃ sampaṭicchitabbaṃ, na yesaṃ kesañci vacanaṃ. Paṭṭhānānusārīhi bhavitabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "537-8"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ya"
      },
      "nti yaṃ āvajjanadvayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Karaṇamattattā"
      },
      "ti karaṇamattameva ṭhapetvā phaladānābhāvato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vātapupphasama"
      },
      "nti moghapupphasamaṃ, yathā taṃ paṭhamasañjātaṃ acchinnamūlepi rukkhe ",
      " nibbattaṃ purimehi adinnaphalattā phalanibbattakaṃ na hoti, evamidaṃ anupacchinnabhavamūlepi santāne nibbattaṃ anāsevanabhāvena phaladāyakaṃ na hotīti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Javanattaṃ tu sampatta"
      },
      "nti aṭṭhārasavidhaṃ khīṇāsavāveṇikaṃ viññāṇamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiccasādhanato"
      },
      "ti bhavataṇhāmūlassa avocchinnabhāve sati kusalākusalakammakiccassa sādhanato, dānāditaṃtaṃkiccasādhanavasena vā. Idaṃ vuttaṃ hoti – yathā hi chinnamūlassa rukkhassa pupphaṃ pupphanamattaṃ ṭhapetvā aphalameva hoti, evametampi taṃtaṃkiccasādhanamattaṃ ṭhapetvā samucchinnabhavataṇhāmūle santāne pavattanato aphalamevāti."
    ],
    "innerText": "537-8.Yanti yaṃ āvajjanadvayaṃ. Karaṇamattattāti karaṇamattameva ṭhapetvā phaladānābhāvato. Vātapupphasamanti moghapupphasamaṃ, yathā taṃ paṭhamasañjātaṃ acchinnamūlepi rukkhe nibbattaṃ purimehi adinnaphalattā phalanibbattakaṃ na hoti, evamidaṃ anupacchinnabhavamūlepi santāne nibbattaṃ anāsevanabhāvena phaladāyakaṃ na hotīti adhippāyo. Javanattaṃ tu sampattanti aṭṭhārasavidhaṃ khīṇāsavāveṇikaṃ viññāṇamāha. Kiccasādhanatoti bhavataṇhāmūlassa avocchinnabhāve sati kusalākusalakammakiccassa sādhanato, dānāditaṃtaṃkiccasādhanavasena vā. Idaṃ vuttaṃ hoti – yathā hi chinnamūlassa rukkhassa pupphaṃ pupphanamattaṃ ṭhapetvā aphalameva hoti, evametampi taṃtaṃkiccasādhanamattaṃ ṭhapetvā samucchinnabhavataṇhāmūle santāne pavattanato aphalamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "539-40"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭiccā"
      },
      "ti hetudhammassa paṭimukhaṃ gantvā taṃ apaccakkhāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etī"
      },
      "ti pavattati, tiṭṭhati uppajjati vāti vuttaṃ hoti. ‘‘Etī’’ti hi idaṃ uppattiṭṭhitīnaṃ sādhāraṇavasena pavattiparidīpakaṃ. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ṭhitiyuppattiyāpi vā’’"
      },
      "ti. Ekacco hi paccayo ṭhitiyā eva upakārako hoti yathā pacchājātapaccayo, ekacco uppattiyā eva yathā anantarādiko, ekacco ubhayassa yathā hetuādayo. Evaṃ paccaya-saddassa vacanatthaṃ dassetvā idāni paccayalakkhaṇaṃ dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yo dhammo’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo"
      },
      "ti hetudhammo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassā"
      },
      "ti yassa phaladhammassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhitiyuppattiyāpi vā"
      },
      "ti ṭhititthaṃ, uppattitthaṃ vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhitiyā"
      },
      "ti vā ṭhitikkhaṇe, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uppattiyā"
      },
      "ti uppādakkhaṇe. Yassa dhammassa upakāro, yassa dhammassa ṭhitiyuppattiyāti vā sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Upakāro’’"
      },
      "ti iminā dhammena dhammasattiupakārakaṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Sambhavo’’"
      },
      "tiādi paccayasseva pariyāyadassanaṃ. Sambhavati etasmāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sambhavo"
      },
      ". Tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pabhavo"
      },
      ". Hinoti patiṭṭhāti etthāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetu"
      },
      ". Anekatthattā dhātusaddānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hi"
      },
      "-saddo mūla-saddo viya patiṭṭhattho veditabbo ",
      ". Hinoti vā etena kammanidānabhūtena uddhaṃ ojaṃ abhiharantena mūlena ",
      " viya pādapo tappaccayaṃ phalaṃ gacchati, vuddhiṃ viruḷhiṃ āpajjatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetu"
      },
      ". Attano phalaṃ karotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāraṇaṃ. Paccayo mato"
      },
      "ti paccayova ‘‘sambhavo’’tiādito mato. Atthato ete samānā, byañjanamattaṃyeva nesaṃ nānattanti vuttaṃ hoti."
    ],
    "innerText": "539-40.Paṭiccāti hetudhammassa paṭimukhaṃ gantvā taṃ apaccakkhāya. Etīti pavattati, tiṭṭhati uppajjati vāti vuttaṃ hoti. ‘‘Etī’’ti hi idaṃ uppattiṭṭhitīnaṃ sādhāraṇavasena pavattiparidīpakaṃ. Tenevāha ‘‘ṭhitiyuppattiyāpi vā’’ti. Ekacco hi paccayo ṭhitiyā eva upakārako hoti yathā pacchājātapaccayo, ekacco uppattiyā eva yathā anantarādiko, ekacco ubhayassa yathā hetuādayo. Evaṃ paccaya-saddassa vacanatthaṃ dassetvā idāni paccayalakkhaṇaṃ dassento āha ‘‘yo dhammo’’tiādi. Yoti hetudhammo. Yassāti yassa phaladhammassa. Ṭhitiyuppattiyāpi vāti ṭhititthaṃ, uppattitthaṃ vā. Ṭhitiyāti vā ṭhitikkhaṇe, uppattiyāti uppādakkhaṇe. Yassa dhammassa upakāro, yassa dhammassa ṭhitiyuppattiyāti vā sambandho. ‘‘Upakāro’’ti iminā dhammena dhammasattiupakārakaṃ dasseti. ‘‘Sambhavo’’tiādi paccayasseva pariyāyadassanaṃ. Sambhavati etasmāti sambhavo. Tathā pabhavo. Hinoti patiṭṭhāti etthāti hetu. Anekatthattā dhātusaddānaṃ hi-saddo mūla-saddo viya patiṭṭhattho veditabbo . Hinoti vā etena kammanidānabhūtena uddhaṃ ojaṃ abhiharantena mūlena viya pādapo tappaccayaṃ phalaṃ gacchati, vuddhiṃ viruḷhiṃ āpajjatīti hetu. Attano phalaṃ karotīti kāraṇaṃ. Paccayo matoti paccayova ‘‘sambhavo’’tiādito mato. Atthato ete samānā, byañjanamattaṃyeva nesaṃ nānattanti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "541-5"
      },
      ". Evaṃ paṭṭhāne āgatasabbapaccayānaṃ sādhāraṇavasena atthaṃ vatvā idhādhippetassa hetupaccayasseva sarūpaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘lobhādi pana yo dhammo’’"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mūlaṭṭhenā"
      },
      "ti sampayuttānaṃ suppatiṭṭhitabhāvasādhanasaṅkhātamūlaṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chaḷevā"
      },
      "ti mūlaṭṭhenūpakārakabhāvassa tesameva āveṇikabhāvena ete chaḷeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jātito"
      },
      "ti kusalākusalābyākatajātito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navadhā"
      },
      "ti tayo kusalahetū, tayo akusalahetū, tayo abyākatahetūti navadhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammānaṃ…pe… sādhako"
      },
      "ti yathā sālivīhibījādīni sālivīhiādibhāvassa sādhakāni, maṇiādipabhāvatthūnañca nīlādivaṇṇāni nīlādimaṇipabhāya sādhakāni, evaṃ hetupaccayo yathārahaṃ attano sampayuttānaṃ kusalādittasādhakoti kusalākusalābyākatadhammānaṃ yathākkamaṃ kusalākusalābyākatabhāvasādhako mūlaṭṭhoti ayamettha attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eke ācariyā"
      },
      "ti revatācariyaṃ, tassa sissānusisse ca sandhāyāha. Atha vā garumhi bahuvacanampi yujjatīti revatācariyameva sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘eke ācariyā’’"
      },
      "ti vuttaṃ."
    ],
    "innerText": "541-5. Evaṃ paṭṭhāne āgatasabbapaccayānaṃ sādhāraṇavasena atthaṃ vatvā idhādhippetassa hetupaccayasseva sarūpaṃ dassetuṃ ‘‘lobhādi pana yo dhammo’’tiādi vuttaṃ. Mūlaṭṭhenāti sampayuttānaṃ suppatiṭṭhitabhāvasādhanasaṅkhātamūlaṭṭhena. Chaḷevāti mūlaṭṭhenūpakārakabhāvassa tesameva āveṇikabhāvena ete chaḷeva. Jātitoti kusalākusalābyākatajātito. Navadhāti tayo kusalahetū, tayo akusalahetū, tayo abyākatahetūti navadhā. Dhammānaṃ…pe… sādhakoti yathā sālivīhibījādīni sālivīhiādibhāvassa sādhakāni, maṇiādipabhāvatthūnañca nīlādivaṇṇāni nīlādimaṇipabhāya sādhakāni, evaṃ hetupaccayo yathārahaṃ attano sampayuttānaṃ kusalādittasādhakoti kusalākusalābyākatadhammānaṃ yathākkamaṃ kusalākusalābyākatabhāvasādhako mūlaṭṭhoti ayamettha attho. Eke ācariyāti revatācariyaṃ, tassa sissānusisse ca sandhāyāha. Atha vā garumhi bahuvacanampi yujjatīti revatācariyameva sandhāya ‘‘eke ācariyā’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ sante"
      },
      "ti yadi mūlaṭṭho kusalādibhāvasādhako, evaṃ sati. Yathā cittaṃ cittajarūpānaṃ paccayo hoti, evaṃ taṃsampayuttadhammāpīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘taṃsamuṭṭhānarūpisū’’"
      },
      "ti, hetusamuṭṭhānarūpesūti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Neva sampajjatī"
      },
      "ti na sijjhati, ‘‘hetū hetusampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ hetupaccayena ",
      " paccayo’’ti vutto hetupaccayabhāvo na sampajjatīti vuttaṃ hoti. Yathā kusalākusalā hetū taṃsamuṭṭhānarūpassa kusalādibhāvāya na pariyattā, evaṃ abyākatopi hetu taṃsamuṭṭhānassa rūpassa abyākatabhāvāya na pariyatto. Sabhāvena hi taṃ abyākatanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na hī’’"
      },
      "tiādi. Yadi kusalādibhāvaṃ na sādhenti, paccayāpi na hontīti vadeyyāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na tesa’’"
      },
      "ntiādi. ‘‘Hetū hetusampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ hetupaccayena paccayo’’ti (paṭṭhā. 1.1.1) vacanato te alobhādayo tesaṃ rūpānaṃ paccayā na na honti, bhavantevāti attho."
    ],
    "innerText": "Evaṃ santeti yadi mūlaṭṭho kusalādibhāvasādhako, evaṃ sati. Yathā cittaṃ cittajarūpānaṃ paccayo hoti, evaṃ taṃsampayuttadhammāpīti āha ‘‘taṃsamuṭṭhānarūpisū’’ti, hetusamuṭṭhānarūpesūti attho. Neva sampajjatīti na sijjhati, ‘‘hetū hetusampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ hetupaccayena paccayo’’ti vutto hetupaccayabhāvo na sampajjatīti vuttaṃ hoti. Yathā kusalākusalā hetū taṃsamuṭṭhānarūpassa kusalādibhāvāya na pariyattā, evaṃ abyākatopi hetu taṃsamuṭṭhānassa rūpassa abyākatabhāvāya na pariyatto. Sabhāvena hi taṃ abyākatanti āha ‘‘na hī’’tiādi. Yadi kusalādibhāvaṃ na sādhenti, paccayāpi na hontīti vadeyyāti āha ‘‘na tesa’’ntiādi. ‘‘Hetū hetusampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ hetupaccayena paccayo’’ti (paṭṭhā. 1.1.1) vacanato te alobhādayo tesaṃ rūpānaṃ paccayā na na honti, bhavantevāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "546-7"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gantabbo"
      },
      "ti na paccetabbo. Idaṃ vuttaṃ hoti – yadi kusalādihetuyo attano viya attahetukānaṃ dhammānaṃ kusalādibhāvaṃ sādhenti, kusalākusalahetupaccayasambhūtā rūpadhammāpi te viya kusalādayo siyuṃ, hetuyo vā rūpānaṃ paccayā na siyuṃ, na ca panetaṃ ubhayampi atthi, tasmā kusalādīnaṃ kusalādibhāvasādhako mūlaṭṭhoti na viññātabbanti. Apica yadi hetupaṭibaddho kusalādibhāvo, tadā abyākatabhāvopi tappaṭibaddho siyā, ahetukānaṃ abyākatabhāvo na sijjhati. Yadi ca hetupaṭibaddho kusalādibhāvo, hetūnampi kusalādibhāvo appaṭibaddho siyā. Atha tesampi sesahetupaṭibaddho, evampi momūhacittasampayuttassa hetuno akusalabhāvo na sijjheyya. Atha tassa so aññahetuko siyā, evaṃ sati sesahetūnampi taṃhetukova siyā. Yathā ca sesahetūnaṃ, evaṃ avasesasampayuttadhammānampi taṃhetukova siyā. Atha siyā hetūnaṃ sabhāvatova kusalādibhāvo, sampayuttānaṃ pana ",
      " hetupaṭibaddhoti, evaṃ sati alobho kusalo vā siyā abyākato vā. Yadi hi so sabhāvato kusalo, taṃsabhāvattā abyākato na siyā. Atha abyākato, taṃsabhāvattā kusalo na siyā alobhasabhāvassa adosattābhāvo viya. Yasmā pana ubhayathāpi hoti, tasmā yathā ubhayathā hontesu saddhādīsu sampayuttesu hetupaṭibaddhaṃ kusalādibhāvaṃ pariyesatha, na sabhāvato, evaṃ hetūsupi kusalāditā aññapaṭibaddhā pariyesitabbā, na sabhāvato. Sā pana pariyesiyamānā yonisomanasikārādipaṭibaddhā hotīti hetūsu viya hetusampayuttadhammesupi yonisomanasikārādipaṭibaddho kusalādibhāvo, na hetupaṭibaddhoti. Tenevāha –"
    ],
    "innerText": "546-7.Nagantabboti na paccetabbo. Idaṃ vuttaṃ hoti – yadi kusalādihetuyo attano viya attahetukānaṃ dhammānaṃ kusalādibhāvaṃ sādhenti, kusalākusalahetupaccayasambhūtā rūpadhammāpi te viya kusalādayo siyuṃ, hetuyo vā rūpānaṃ paccayā na siyuṃ, na ca panetaṃ ubhayampi atthi, tasmā kusalādīnaṃ kusalādibhāvasādhako mūlaṭṭhoti na viññātabbanti. Apica yadi hetupaṭibaddho kusalādibhāvo, tadā abyākatabhāvopi tappaṭibaddho siyā, ahetukānaṃ abyākatabhāvo na sijjhati. Yadi ca hetupaṭibaddho kusalādibhāvo, hetūnampi kusalādibhāvo appaṭibaddho siyā. Atha tesampi sesahetupaṭibaddho, evampi momūhacittasampayuttassa hetuno akusalabhāvo na sijjheyya. Atha tassa so aññahetuko siyā, evaṃ sati sesahetūnampi taṃhetukova siyā. Yathā ca sesahetūnaṃ, evaṃ avasesasampayuttadhammānampi taṃhetukova siyā. Atha siyā hetūnaṃ sabhāvatova kusalādibhāvo, sampayuttānaṃ pana hetupaṭibaddhoti, evaṃ sati alobho kusalo vā siyā abyākato vā. Yadi hi so sabhāvato kusalo, taṃsabhāvattā abyākato na siyā. Atha abyākato, taṃsabhāvattā kusalo na siyā alobhasabhāvassa adosattābhāvo viya. Yasmā pana ubhayathāpi hoti, tasmā yathā ubhayathā hontesu saddhādīsu sampayuttesu hetupaṭibaddhaṃ kusalādibhāvaṃ pariyesatha, na sabhāvato, evaṃ hetūsupi kusalāditā aññapaṭibaddhā pariyesitabbā, na sabhāvato. Sā pana pariyesiyamānā yonisomanasikārādipaṭibaddhā hotīti hetūsu viya hetusampayuttadhammesupi yonisomanasikārādipaṭibaddho kusalādibhāvo, na hetupaṭibaddhoti. Tenevāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Yoniso, bhikkhave, manasi karoto anuppannā ceva kusalā dhammā uppajjanti, uppannā ca kusalā dhammā abhivaḍḍhantī’’tiādi (a. ni. 1.67)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samayaññunā"
      },
      "ti ābhidhammikamatavedinā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suppatiṭṭhitabhāvassa sādhanenā"
      },
      "ti attahetukānaṃ dhammānaṃ sammā patiṭṭhitabhāvassa thirabhāvassa sādhanena. Laddhahetupaccayā hi dhammā viruḷhamūlā viya pādapā thirā honti suppatiṭṭhitā, ahetukā tilabījādisevālā viya na suppatiṭṭhitāti."
    ],
    "innerText": "Samayaññunāti ābhidhammikamatavedinā. Suppatiṭṭhitabhāvassa sādhanenāti attahetukānaṃ dhammānaṃ sammā patiṭṭhitabhāvassa thirabhāvassa sādhanena. Laddhahetupaccayā hi dhammā viruḷhamūlā viya pādapā thirā honti suppatiṭṭhitā, ahetukā tilabījādisevālā viya na suppatiṭṭhitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "548"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaso"
      },
      "ti kāmāvacarādisabbabhāgena."
    ],
    "innerText": "548.Sabbasoti kāmāvacarādisabbabhāgena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "550-1"
      },
      ". Paṭisandhikkhaṇe ",
      " cittasamuṭṭhānānaṃ rūpānaṃ abhāvato attanā sampayuttānaṃ, kaṭattārūpānameva ca paccayabhāvoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘attanā…pe… jātāna’’"
      },
      "nti. Kammassa katattā eva ca upacitattā ca na issarādihetuno sambhūtāni rūpāni kaṭattārūpāni, kammasamuṭṭhānarūpānīti attho ",
      ", kaṭattārūpāneva jātāni bhūtāni nibbattānīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kaṭattārūpajātāni. Tathevā"
      },
      "ti yathā paṭisandhiyaṃ kaṭattārūpānaṃ, evanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittajānañcā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca"
      },
      "-saddena ‘‘attanā sampayuttāna’’nti ākaḍḍhati."
    ],
    "innerText": "550-1. Paṭisandhikkhaṇe cittasamuṭṭhānānaṃ rūpānaṃ abhāvato attanā sampayuttānaṃ, kaṭattārūpānameva ca paccayabhāvoti āha ‘‘attanā…pe… jātāna’’nti. Kammassa katattā eva ca upacitattā ca na issarādihetuno sambhūtāni rūpāni kaṭattārūpāni, kammasamuṭṭhānarūpānīti attho , kaṭattārūpāneva jātāni bhūtāni nibbattānīti kaṭattārūpajātāni. Tathevāti yathā paṭisandhiyaṃ kaṭattārūpānaṃ, evanti attho. Cittajānañcāti ca-saddena ‘‘attanā sampayuttāna’’nti ākaḍḍhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "553"
      },
      ". Lokuttaravipākānaṃ paṭisandhivasena appavattanato natthi kammasamuṭṭhānassa paccayabhāvoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cittajāna’’"
      },
      "ntiādi."
    ],
    "innerText": "553. Lokuttaravipākānaṃ paṭisandhivasena appavattanato natthi kammasamuṭṭhānassa paccayabhāvoti āha ‘‘cittajāna’’ntiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "555"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hetupaccayasambhavo"
      },
      "ti hetupaccayasambhūtadhammo, hetupaccayato paccayuppannadhammānaṃ sambhavākāro vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sañjātasukhahetunā"
      },
      "ti sañjātañāṇena, sampajaññenāti attho. Ñāṇañhi ‘‘sukhino cittaṃ samādhiyati, samāhito yathābhūtaṃ pajānātī’’tiādivacanato sukhaṃ hetu etassāti,"
    ],
    "innerText": "555.Hetupaccayasambhavoti hetupaccayasambhūtadhammo, hetupaccayato paccayuppannadhammānaṃ sambhavākāro vā. Sañjātasukhahetunāti sañjātañāṇena, sampajaññenāti attho. Ñāṇañhi ‘‘sukhino cittaṃ samādhiyati, samāhito yathābhūtaṃ pajānātī’’tiādivacanato sukhaṃ hetu etassāti,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Diṭṭhe dhamme ca yo attho,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Yo cattho samparāyiko;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Atthābhisamayā dhīro,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paṇḍitoti pavuccatī’’ti. (saṃ. ni. 1.129) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Ādivacanato sukhassa hetūti vā ‘‘sukhahetū’’ti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "556"
      },
      ". Lokassa adhipati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokādhipati,"
      },
      " sakalalokanāyakenāti attho. Attādhīnānaṃ patinoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhipatī. Chandaṃ tu jeṭṭhakaṃ katvā"
      },
      "ti ‘‘chandavato kiṃ nāma na sijjhatī’’tiādikaṃ purimābhisaṅkhārūpanissayaṃ labhitvā uppajjamāne cittuppāde chando jeṭṭhakabhūto sampayuttadhamme vase vattamāno hutvā pavattati, sampayuttadhammā ca tassa vase pavattanti hīnādibhāvena tadanuvattanatoti āha ‘‘chandaṃ tu jeṭṭhakaṃ katvā’’tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katvā dhura"
      },
      "nti sahajātapubbaṅgamavasena ",
      " pubbaṅgamaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chandādhipati nāma so"
      },
      " vā cittuppādo chandādhipati nāma ‘‘chando ",
      " adhipati imassā’’ti katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Esevā"
      },
      "ti ‘‘cittaṃ dhuraṃ katvā…pe… kālasmiṃ cittādhipati nāmā’’tiādinā yathāvuttova nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sesesū"
      },
      "ti cittādīsu. Ettha ca ‘‘chandaṃ…pe… kālasmi’’ntiādinā kālassa niyamitattā cattāropete ekakkhaṇe adhipatī na hontīti daṭṭhabbaṃ. Evañca katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭṭhāne"
      },
      " ‘‘chandādhipati chandasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ adhipatipaccayena paccayo’’tiādinā (paṭṭhā. 1.1.3) catunnampi adhipatīnaṃ paccayabhāvo visuṃ visuṃyeva uddhaṭo. Yadi hi te ekakkhaṇeyeva adhipatipaccayā siyuṃ, tadā yathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetupaccayaniddese"
      },
      " ‘‘hetū hetusampayuttakāna’’ntiādinā avisesena vuttaṃ mūlaṭṭhena upakārakabhāvassa vijjamānena dvinnaṃ, tiṇṇampi hetūnaṃ ekakkhaṇe paccayabhāvūpagamanato, evaṃ ekakkhaṇeyeva bahūnaṃ jeṭṭhakabhāve sati adhipatipaccayaniddesepi ‘‘adhipatī adhipatisampayuttakāna’’ntiādinā vattabbaṃ siyā. Yasmā pana evaṃ avatvā ‘‘chandādhipati chandasampayuttakāna’’ntiādinā cattārova visesetvā vuttā, tasmā ekekadhammoyeva ekakkhaṇe adhipatipaccayo hotīti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jeṭṭhaṭṭhenā"
      },
      "ti pamukhabhāvena."
    ],
    "innerText": "556. Lokassa adhipati lokādhipati, sakalalokanāyakenāti attho. Attādhīnānaṃ patinoti adhipatī. Chandaṃ tu jeṭṭhakaṃ katvāti ‘‘chandavato kiṃ nāma na sijjhatī’’tiādikaṃ purimābhisaṅkhārūpanissayaṃ labhitvā uppajjamāne cittuppāde chando jeṭṭhakabhūto sampayuttadhamme vase vattamāno hutvā pavattati, sampayuttadhammā ca tassa vase pavattanti hīnādibhāvena tadanuvattanatoti āha ‘‘chandaṃ tu jeṭṭhakaṃ katvā’’tiādi. Katvā dhuranti sahajātapubbaṅgamavasena pubbaṅgamaṃ katvā. Chandādhipati nāma so vā cittuppādo chandādhipati nāma ‘‘chando adhipati imassā’’ti katvā. Esevāti ‘‘cittaṃ dhuraṃ katvā…pe… kālasmiṃ cittādhipati nāmā’’tiādinā yathāvuttova nayo. Sesesūti cittādīsu. Ettha ca ‘‘chandaṃ…pe… kālasmi’’ntiādinā kālassa niyamitattā cattāropete ekakkhaṇe adhipatī na hontīti daṭṭhabbaṃ. Evañca katvā paṭṭhāne ‘‘chandādhipati chandasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ adhipatipaccayena paccayo’’tiādinā (paṭṭhā. 1.1.3) catunnampi adhipatīnaṃ paccayabhāvo visuṃ visuṃyeva uddhaṭo. Yadi hi te ekakkhaṇeyeva adhipatipaccayā siyuṃ, tadā yathā hetupaccayaniddese ‘‘hetū hetusampayuttakāna’’ntiādinā avisesena vuttaṃ mūlaṭṭhena upakārakabhāvassa vijjamānena dvinnaṃ, tiṇṇampi hetūnaṃ ekakkhaṇe paccayabhāvūpagamanato, evaṃ ekakkhaṇeyeva bahūnaṃ jeṭṭhakabhāve sati adhipatipaccayaniddesepi ‘‘adhipatī adhipatisampayuttakāna’’ntiādinā vattabbaṃ siyā. Yasmā pana evaṃ avatvā ‘‘chandādhipati chandasampayuttakāna’’ntiādinā cattārova visesetvā vuttā, tasmā ekekadhammoyeva ekakkhaṇe adhipatipaccayo hotīti daṭṭhabbaṃ. Jeṭṭhaṭṭhenāti pamukhabhāvena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sobhanā mati, sobhanaṃ vā mataṃ etesaṃ atthīti sumatino, sammādiṭṭhikāti attho, tesaṃ matiṃ vibodheti pabodhetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sumatimativibodhanaṃ"
      },
      ". Kucchitā mati, kucchitaṃ vā mataṃ etesanti kumatino, micchādiṭṭhikā, tesaṃ matibhūtā matibhāvena parikappitattāti kumatimati, micchādiṭṭhi, sāyeva indhanasadisatāya indhanaṃ tassa pāvakaṃ aggi viyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kumati…pe… pāvakaṃ. Atimadhura"
      },
      "nti nipuṇagambhīrena attharasena ",
      " ceva suvimalasakhilena byañjanarasena ca madhuraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avedī"
      },
      "ti ogāhetvā jānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo yo"
      },
      "ti theranavamajjhimesu yo koci. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jinavacanaṃ sakalaṃ avedī"
      },
      "ti tepiṭakassapi sakalajinavacanassa gahaṇasamatthatāpaṭilābhena taṃ avagacchati."
    ],
    "innerText": "Sobhanā mati, sobhanaṃ vā mataṃ etesaṃ atthīti sumatino, sammādiṭṭhikāti attho, tesaṃ matiṃ vibodheti pabodhetīti sumatimativibodhanaṃ. Kucchitā mati, kucchitaṃ vā mataṃ etesanti kumatino, micchādiṭṭhikā, tesaṃ matibhūtā matibhāvena parikappitattāti kumatimati, micchādiṭṭhi, sāyeva indhanasadisatāya indhanaṃ tassa pāvakaṃ aggi viyāti kumati…pe… pāvakaṃ. Atimadhuranti nipuṇagambhīrena attharasena ceva suvimalasakhilena byañjanarasena ca madhuraṃ. Avedīti ogāhetvā jānāti. Yo yoti theranavamajjhimesu yo koci. Jinavacanaṃ sakalaṃ avedīti tepiṭakassapi sakalajinavacanassa gahaṇasamatthatāpaṭilābhena taṃ avagacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti abhidhammatthavikāsiniyā nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhidhammāvatārasaṃvaṇṇanāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pakiṇṇakaniddesavaṇṇanā niṭṭhitā."
  }
]