[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "16. Soḷasamo paricchedo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Abhiññāniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1043-7"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Para"
      },
      "nti visiṭṭhaṃ katvā, visesatoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catutthajjhānamattepī"
      },
      "ti rūpāvacaracatutthajjhānamattepi, nāvassaṃ arūpajjhānehīti adhippāyo. Arūpāvacarajjhānaṃ appaṭiladdhopi hi katādhikāro bhikkhu abhiññā sampādetuṃ samattho hoti. Ettha catutthajjhānaggahaṇeneva heṭṭhā tīṇi jhānāni gahitāni. Tesu hi aciṇṇavasī catutthajjhānaṃ uppādetumpi na sakkoti. Abhiññāsu anuyogaṃ ",
      " kātuṃ vaṭṭatīti vatvā tattha payojanaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘abhiññā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāmā’’"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niṭṭhaṅgatā"
      },
      "ti adhigatānisaṃsatāya ceva bhāvanāsukhatāya ca niṭṭhaṃ nipphattiṃ gatā. Samādhibhāvanāya hi lokiyābhiññā udayaphalabhāvena pākaṭā. So abhiññāya ca samādhinā ca samannāgato sukheneva paññābhāvanaṃ sampādessati."
    ],
    "innerText": "1043-7.Paranti visiṭṭhaṃ katvā, visesatoti attho. Catutthajjhānamattepīti rūpāvacaracatutthajjhānamattepi, nāvassaṃ arūpajjhānehīti adhippāyo. Arūpāvacarajjhānaṃ appaṭiladdhopi hi katādhikāro bhikkhu abhiññā sampādetuṃ samattho hoti. Ettha catutthajjhānaggahaṇeneva heṭṭhā tīṇi jhānāni gahitāni. Tesu hi aciṇṇavasī catutthajjhānaṃ uppādetumpi na sakkoti. Abhiññāsu anuyogaṃ kātuṃ vaṭṭatīti vatvā tattha payojanaṃ dassetuṃ ‘‘abhiññānāmā’’tiādi vuttaṃ. Niṭṭhaṅgatāti adhigatānisaṃsatāya ceva bhāvanāsukhatāya ca niṭṭhaṃ nipphattiṃ gatā. Samādhibhāvanāya hi lokiyābhiññā udayaphalabhāvena pākaṭā. So abhiññāya ca samādhinā ca samannāgato sukheneva paññābhāvanaṃ sampādessati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1048-9"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dibbānī"
      },
      "tiādi lokiyābhiññānaṃ sarūpato uddisanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dibbāni cakkhusotānī"
      },
      "ti dibbacakkhuñāṇaṃ, dibbasotañāṇañcāti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhī"
      },
      "ti iddhividhañāṇaṃ. Imā pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhiññāyo pattukāmena"
      },
      " ādikammikena yoginā yasmā odātakasiṇapariyantesu aṭṭhasu kasiṇesu catutthajjhānaṃ, tabbasena ca arūpasamāpattiyo nibbattetvā vā na vā kasiṇānulomatādīhi cuddasahi ākārehi cittaṃ dametabbaṃ. Na hi evaṃ adametvā pubbe abhāvitabhāvano ādikammiko yogāvacaro pañca abhiññāyo nipphādessatīti tasmā taṃ cittaparidamanaṃ avassaṃ kātabbanti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kasiṇānulomatādīhī’’"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kasiṇānulomatādīhī"
      },
      "ti kasiṇānulomatā kasiṇapaṭilomatā kasiṇānulomapaṭilomatā jhānānulomatā jhānapaṭilomatā jhānānulomapaṭilomatā jhānukkantikatā kasiṇukkantikatā jhānakasiṇukkantikatā aṅgasaṅkantikatā ārammaṇasaṅkantikatā aṅgārammaṇasaṅkantikatā aṅgavavatthāpanatā ārammaṇavavatthāpanatāti imehi cuddasahi ākārehi."
    ],
    "innerText": "1048-9.Dibbānītiādi lokiyābhiññānaṃ sarūpato uddisanaṃ. Dibbāni cakkhusotānīti dibbacakkhuñāṇaṃ, dibbasotañāṇañcāti dasseti. Iddhīti iddhividhañāṇaṃ. Imā pana abhiññāyo pattukāmena ādikammikena yoginā yasmā odātakasiṇapariyantesu aṭṭhasu kasiṇesu catutthajjhānaṃ, tabbasena ca arūpasamāpattiyo nibbattetvā vā na vā kasiṇānulomatādīhi cuddasahi ākārehi cittaṃ dametabbaṃ. Na hi evaṃ adametvā pubbe abhāvitabhāvano ādikammiko yogāvacaro pañca abhiññāyo nipphādessatīti tasmā taṃ cittaparidamanaṃ avassaṃ kātabbanti dassetuṃ ‘‘kasiṇānulomatādīhī’’tiādi vuttaṃ. Kasiṇānulomatādīhīti kasiṇānulomatā kasiṇapaṭilomatā kasiṇānulomapaṭilomatā jhānānulomatā jhānapaṭilomatā jhānānulomapaṭilomatā jhānukkantikatā kasiṇukkantikatā jhānakasiṇukkantikatā aṅgasaṅkantikatā ārammaṇasaṅkantikatā aṅgārammaṇasaṅkantikatā aṅgavavatthāpanatā ārammaṇavavatthāpanatāti imehi cuddasahi ākārehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha aṭṭhasu kasiṇesu paṭipāṭiyā satakkhattuṃ sahassakkhattumpi samāpajjanaṃ, tatheva uppaṭipāṭiyā, paṭipāṭiuppaṭipāṭivasena ca samāpajjananti imesaṃ tiṇṇaṃ ākārānaṃ vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kasiṇānulomatādayo"
      },
      " vuttā. Paṭhamajjhānato ",
      " paṭṭhāya yāva nevasaññānāsaññāyatanaṃ, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānānulomatā"
      },
      " nāma. Tesaṃ paṭilomato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānapaṭilomatā"
      },
      " nāma. Anulomapaṭilomato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānaanulomapaṭilomatā"
      },
      " nāma."
    ],
    "innerText": "Tattha aṭṭhasu kasiṇesu paṭipāṭiyā satakkhattuṃ sahassakkhattumpi samāpajjanaṃ, tatheva uppaṭipāṭiyā, paṭipāṭiuppaṭipāṭivasena ca samāpajjananti imesaṃ tiṇṇaṃ ākārānaṃ vasena kasiṇānulomatādayo vuttā. Paṭhamajjhānato paṭṭhāya yāva nevasaññānāsaññāyatanaṃ, ayaṃ jhānānulomatā nāma. Tesaṃ paṭilomato jhānapaṭilomatā nāma. Anulomapaṭilomato jhānaanulomapaṭilomatā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pathavīkasiṇe paṭhamajjhānaṃ samāpajjitvā tattheva tatiyaṃ samāpajjati, tato tadeva ugghāṭetvā ākāsānañcāyatanaṃ, tato ākiñcaññāyatananti evaṃ kasiṇaṃ anokkamitvā jhānasseva ekantarikabhāvena ukkamanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānukkantikatā"
      },
      " nāma. Evaṃ āpokasiṇādimūlikāpi yojanā kātabbā. Pathavīkasiṇe paṭhamajjhānaṃ samāpajjitvā puna tadeva tejokasiṇe, tato nīlakasiṇe, tato lohitakasiṇeti jhānaṃ anukkamitvā kasiṇasseva ekantarikabhāvena ukkamanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kasiṇukkantikatā"
      },
      " nāma. Pathavīkasiṇe paṭhamajjhānaṃ samāpajjitvā, tejokasiṇe tatiyaṃ ",
      ", nīlakasiṇaṃ ugghāṭetvā ākāsānañcāyatanaṃ, lohitakasiṇato ākiñcaññāyatananti iminā nayena jhānassa ceva kasiṇassa ca ukkamanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānakasiṇukkantikatā"
      },
      " nāma."
    ],
    "innerText": "Pathavīkasiṇe paṭhamajjhānaṃ samāpajjitvā tattheva tatiyaṃ samāpajjati, tato tadeva ugghāṭetvā ākāsānañcāyatanaṃ, tato ākiñcaññāyatananti evaṃ kasiṇaṃ anokkamitvā jhānasseva ekantarikabhāvena ukkamanaṃ jhānukkantikatā nāma. Evaṃ āpokasiṇādimūlikāpi yojanā kātabbā. Pathavīkasiṇe paṭhamajjhānaṃ samāpajjitvā puna tadeva tejokasiṇe, tato nīlakasiṇe, tato lohitakasiṇeti jhānaṃ anukkamitvā kasiṇasseva ekantarikabhāvena ukkamanaṃ kasiṇukkantikatā nāma. Pathavīkasiṇe paṭhamajjhānaṃ samāpajjitvā, tejokasiṇe tatiyaṃ , nīlakasiṇaṃ ugghāṭetvā ākāsānañcāyatanaṃ, lohitakasiṇato ākiñcaññāyatananti iminā nayena jhānassa ceva kasiṇassa ca ukkamanaṃ jhānakasiṇukkantikatā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pathavīkasiṇe paṭhamajjhānaṃ samāpajjitvā tattheva itaresampi samāpajjanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṅgasaṅkantikatā"
      },
      " nāma. Sabbakasiṇesu ekekasseva samāpajjanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇasaṅkantikatā"
      },
      " nāma. Pathavīkasiṇe paṭhamajjhānaṃ samāpajjitvā, āpokasiṇe dutiyaṃ, tejokasiṇe tatiyaṃ, vāyokasiṇe catutthaṃ, nīlakasiṇaṃ ugghāṭetvā ākāsānañcāyatanaṃ, pītakasiṇato viññāṇañcāyatanaṃ, lohitakasiṇato ākiñcaññāyatanaṃ, odātakasiṇato nevasaññānāsaññāyatananti evaṃ aṅgānaṃ, ārammaṇānañca samatikkamanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṅgārammaṇasaṅkantikatā"
      },
      " nāma."
    ],
    "innerText": "Pathavīkasiṇe paṭhamajjhānaṃ samāpajjitvā tattheva itaresampi samāpajjanaṃ aṅgasaṅkantikatā nāma. Sabbakasiṇesu ekekasseva samāpajjanaṃ ārammaṇasaṅkantikatā nāma. Pathavīkasiṇe paṭhamajjhānaṃ samāpajjitvā, āpokasiṇe dutiyaṃ, tejokasiṇe tatiyaṃ, vāyokasiṇe catutthaṃ, nīlakasiṇaṃ ugghāṭetvā ākāsānañcāyatanaṃ, pītakasiṇato viññāṇañcāyatanaṃ, lohitakasiṇato ākiñcaññāyatanaṃ, odātakasiṇato nevasaññānāsaññāyatananti evaṃ aṅgānaṃ, ārammaṇānañca samatikkamanaṃ aṅgārammaṇasaṅkantikatā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭhamajjhānaṃ nāma pañcaṅgikanti vavatthapetvā dutiyaṃ caturaṅgikaṃ, tatiyaṃ tivaṅgikaṃ, catutthaṃ duvaṅgikaṃ, ākāsānañcāyatanaṃ…pe… nevasaññānāsaññāyatananti ",
      " evaṃ jhānaṅgamattasseva vavatthāpanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṅgavavatthāpanaṃ"
      },
      " nāma. Tathā ‘‘idaṃ pathavīkasiṇaṃ, idaṃ āpokasiṇa’’ntiādinā ārammaṇamattasseva vavatthāpanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇavavatthāpanaṃ"
      },
      " nāma. Aṅgārammaṇavavatthāpanampi eke icchantīti. Aṭṭhakathāsu pana anāgatattā addhā taṃ bhāvanāsukhaṃ na hoti. Imehi pana cuddasahi ākārehi cittaparidamanaṃ kātuṃ aṭṭhasamāpattilābhīnaṃ satesu, sahassesu vā ekova sakkoti."
    ],
    "innerText": "Paṭhamajjhānaṃ nāma pañcaṅgikanti vavatthapetvā dutiyaṃ caturaṅgikaṃ, tatiyaṃ tivaṅgikaṃ, catutthaṃ duvaṅgikaṃ, ākāsānañcāyatanaṃ…pe… nevasaññānāsaññāyatananti evaṃ jhānaṅgamattasseva vavatthāpanaṃ aṅgavavatthāpanaṃ nāma. Tathā ‘‘idaṃ pathavīkasiṇaṃ, idaṃ āpokasiṇa’’ntiādinā ārammaṇamattasseva vavatthāpanaṃ ārammaṇavavatthāpanaṃ nāma. Aṅgārammaṇavavatthāpanampi eke icchantīti. Aṭṭhakathāsu pana anāgatattā addhā taṃ bhāvanāsukhaṃ na hoti. Imehi pana cuddasahi ākārehi cittaparidamanaṃ kātuṃ aṭṭhasamāpattilābhīnaṃ satesu, sahassesu vā ekova sakkoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1050-1"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dante"
      },
      "ti cuddasahi ākārehi dante. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samāhite"
      },
      "ti catutthajjhānasamādhinā samāhite. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suddhe"
      },
      "ti nīvaraṇadūrībhāvena, paccanīkasamanepi abyāvaṭāya tatramajjhattupekkhāya sampāditasatipārisuddhiyā sabbhāvena vā suparisuddhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyodāte"
      },
      "ti sudhantasuvaṇṇassa nighaṃsanena viya parisuddhattāyeva pariyodāte, pabhassareti vuttaṃ hoti. Atha vā vitakkavicārakkhobhavirahavasena pariyodāteti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anaṅgaṇe"
      },
      "ti ‘‘mādisassa samādhisampannassa īdisena bhavitabba’’nti evaṃ jhānapaṭilābhapaccayānaṃ ‘‘aho vata mameva satthā paṭipucchitvā paṭipucchitvā bhikkhūnaṃ dhammaṃ deseyyā’’tiādinayappavattānaṃ pāpakānaṃ icchāvacarānaṃ abhāvena anaṅgaṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupakkilese"
      },
      "ti upagantvā kilissanaṭṭhena upakkilesasaṅkhātānaṃ rāgādīnaṃ, ‘‘abhijjhā cittassa upakkileso, byāpādo, kodho’’tiādinā āgatānaṃ cittupakkilesānaṃ vā vigatattā vigatupakkilese. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mudubhūte"
      },
      "ti paguṇabhāvāpādanena ",
      " subhāvitattā mudubhūte, vasibhāvappatteti vuttaṃ hoti. Vasibhāvappattañhi cittaṃ suparimadditaṃ viya cammaṃ suparikammakatā viya ca lākhā mudūti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammanīye"
      },
      "ti muduttāyeva iddhipādabhāvūpagamanena kammakkhame, vikubbanādiiddhikammayogyeti vuttaṃ hoti. Mudujātañhi cittaṃ kammakkhamaṃ hoti, sudhantamiva suvaṇṇaṃ, ubhayampi ",
      " cetaṃ subhāvitattāyeva hoti. Yathāha – ‘‘nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi, yaṃ evaṃ bhāvitaṃ bahulīkataṃ muduñca hoti kammaniyañca, yathayidaṃ, bhikkhave, citta’’nti (a. ni. 1.47). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhite"
      },
      "ti etesu parisuddhabhāvādīsu niccalaṃ avaṭṭhite, bhāvanāpāripūriyā vā paṇītabhāvaṃ sammasitvā ṭhite. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Acale"
      },
      "ti ṭhitattāyeva akampe, āneñjappatteti vuttaṃ hoti. Mudukammaññabhāvehi vā attano vase ṭhitattā ṭhite, saddhādīhi pariggahitattā assaddhiyādīhi akampanato acale."
    ],
    "innerText": "1050-1.Danteti cuddasahi ākārehi dante. Samāhiteti catutthajjhānasamādhinā samāhite. Suddheti nīvaraṇadūrībhāvena, paccanīkasamanepi abyāvaṭāya tatramajjhattupekkhāya sampāditasatipārisuddhiyā sabbhāvena vā suparisuddhe. Pariyodāteti sudhantasuvaṇṇassa nighaṃsanena viya parisuddhattāyeva pariyodāte, pabhassareti vuttaṃ hoti. Atha vā vitakkavicārakkhobhavirahavasena pariyodāteti vuttaṃ hoti. Anaṅgaṇeti ‘‘mādisassa samādhisampannassa īdisena bhavitabba’’nti evaṃ jhānapaṭilābhapaccayānaṃ ‘‘aho vata mameva satthā paṭipucchitvā paṭipucchitvā bhikkhūnaṃ dhammaṃ deseyyā’’tiādinayappavattānaṃ pāpakānaṃ icchāvacarānaṃ abhāvena anaṅgaṇe. Anupakkileseti upagantvā kilissanaṭṭhena upakkilesasaṅkhātānaṃ rāgādīnaṃ, ‘‘abhijjhā cittassa upakkileso, byāpādo, kodho’’tiādinā āgatānaṃ cittupakkilesānaṃ vā vigatattā vigatupakkilese. Mudubhūteti paguṇabhāvāpādanena subhāvitattā mudubhūte, vasibhāvappatteti vuttaṃ hoti. Vasibhāvappattañhi cittaṃ suparimadditaṃ viya cammaṃ suparikammakatā viya ca lākhā mudūti vuccati. Kammanīyeti muduttāyeva iddhipādabhāvūpagamanena kammakkhame, vikubbanādiiddhikammayogyeti vuttaṃ hoti. Mudujātañhi cittaṃ kammakkhamaṃ hoti, sudhantamiva suvaṇṇaṃ, ubhayampi cetaṃ subhāvitattāyeva hoti. Yathāha – ‘‘nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi, yaṃ evaṃ bhāvitaṃ bahulīkataṃ muduñca hoti kammaniyañca, yathayidaṃ, bhikkhave, citta’’nti (a. ni. 1.47). Ṭhiteti etesu parisuddhabhāvādīsu niccalaṃ avaṭṭhite, bhāvanāpāripūriyā vā paṇītabhāvaṃ sammasitvā ṭhite. Acaleti ṭhitattāyeva akampe, āneñjappatteti vuttaṃ hoti. Mudukammaññabhāvehi vā attano vase ṭhitattā ṭhite, saddhādīhi pariggahitattā assaddhiyādīhi akampanato acale."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhaṅgasampanne"
      },
      "ti ṭhitiacalatānaṃ visuṃ visuṃ aggahaṇena samāhiteti visuṃ ekaṅgaṃ katvā. Tāsaṃ pana visuṃ visuṃ gahaṇe suvisuddhatādīnaṃ samāhitacittassa aṅgabhūtattā samāhiteti imaṃ aṅgabhāvena aggahetvā suvisuddhatādīhi aṭṭhahi aṅgehi sampannatā veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhividhāyā"
      },
      "ti iddhikoṭṭhāsatthāya, iddhippabhedāya vā. Atthato pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iddhividhā"
      },
      " nāma ekassa bahubhāvādianekavidhānapaccayabhūtaṃ abhiññāñāṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhinīharatī"
      },
      "ti abhiññādhigamatthāya parikammacittaṃ kasiṇārammaṇato apanetvā abhiññābhimukhaṃ peseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhivikubbana"
      },
      "nti ettha ijjhatīti iddhi, nipphajjati paṭilabbhatīti vuttaṃ hoti. Yañhi nipphajjati, paṭilabbhati ca, taṃ ijjhatīti vuccati. Yathāha –"
    ],
    "innerText": "Aṭṭhaṅgasampanneti ṭhitiacalatānaṃ visuṃ visuṃ aggahaṇena samāhiteti visuṃ ekaṅgaṃ katvā. Tāsaṃ pana visuṃ visuṃ gahaṇe suvisuddhatādīnaṃ samāhitacittassa aṅgabhūtattā samāhiteti imaṃ aṅgabhāvena aggahetvā suvisuddhatādīhi aṭṭhahi aṅgehi sampannatā veditabbā. Iddhividhāyāti iddhikoṭṭhāsatthāya, iddhippabhedāya vā. Atthato pana iddhividhā nāma ekassa bahubhāvādianekavidhānapaccayabhūtaṃ abhiññāñāṇaṃ. Abhinīharatīti abhiññādhigamatthāya parikammacittaṃ kasiṇārammaṇato apanetvā abhiññābhimukhaṃ peseti. Iddhivikubbananti ettha ijjhatīti iddhi, nipphajjati paṭilabbhatīti vuttaṃ hoti. Yañhi nipphajjati, paṭilabbhati ca, taṃ ijjhatīti vuccati. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "‘‘Kāmaṃ kāmayamānassa, tassa cetaṃ samijjhatī’’tiādi; (Su. ni. 772; mahāni. 1; netti. 5,44);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iddhiyeva vikubbanaṃ pakativaṇṇavijahanakiriyanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iddhivikubbanaṃ,"
      },
      " idaṃ iddhīsu vikubbaniddhiyā padhānabhāvato vuttaṃ, iddhi ca vikubbanañcāti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iddhivikubbanaṃ"
      },
      ". Visuṃ gahaṇampi vuttakāraṇeneva daṭṭhabbaṃ."
    ],
    "innerText": "Iddhiyeva vikubbanaṃ pakativaṇṇavijahanakiriyanti iddhivikubbanaṃ, idaṃ iddhīsu vikubbaniddhiyā padhānabhāvato vuttaṃ, iddhi ca vikubbanañcāti vā iddhivikubbanaṃ. Visuṃ gahaṇampi vuttakāraṇeneva daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1052-4"
      },
      ". Yathā pana taṃ nipphādetabbaṃ, taṃ vidhiṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘abhiññāpādakajjhāna’’"
      },
      "ntiādi ",
      " vuttaṃ. Ettha ca ‘‘anupubbena cattāri ",
      " jhānāni samāpajjitvā catutthajjhānato vuṭṭhāyā’’ti keci, taṃ ayuttaṃ. Yadicchakaṃ samāpajjanatthañhi cittaparidamanaṃ, catutthajjhānameva ca abhiññāpādakaṃ, na itarāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sataṃ…pe… mānasa"
      },
      "nti sace sataṃ icchati, ‘‘sataṃ homi, sataṃ homī’’ti, sace sahassaṃ icchati, ‘‘sahassaṃ homi, sahassaṃ homī’’ti evaṃ parikamma",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mānasaṃ"
      },
      " katvā. ‘‘Parikammamānasa’’nti ca pādakajjhānato vuṭṭhāya ‘‘sataṃ homī’’tiādinā pavattitakāmāvacaracittaṃ, pādakajjhānañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhi…pe… punā"
      },
      "ti ettha pubbe abhiññāpādakajjhānasamāpajjanaṃ parikammacittassa samādhānatthaṃ, puna samāpajjanaṃ adhiṭṭhānacittassa balaggāhatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhiṭṭhātī"
      },
      "ti sataṃ āvajjetvā tato paraṃ pavattānaṃ tiṇṇaṃ, catunnaṃ vā pubbabhāgacittānaṃ anantarā uppannena sanniṭṭhāpanavasena adhiṭṭhānanti laddhanāmena abhiññāñāṇena sanniṭṭhānaṃ karoti, sataṃ nipphādetīti attho. ‘‘Adhiṭṭhāna’’nti hi sabbattha abhiññāñāṇaṃ vuccati."
    ],
    "innerText": "1052-4. Yathā pana taṃ nipphādetabbaṃ, taṃ vidhiṃ dassetuṃ ‘‘abhiññāpādakajjhāna’’ntiādi vuttaṃ. Ettha ca ‘‘anupubbena cattāri jhānāni samāpajjitvā catutthajjhānato vuṭṭhāyā’’ti keci, taṃ ayuttaṃ. Yadicchakaṃ samāpajjanatthañhi cittaparidamanaṃ, catutthajjhānameva ca abhiññāpādakaṃ, na itarāni. Sataṃ…pe… mānasanti sace sataṃ icchati, ‘‘sataṃ homi, sataṃ homī’’ti, sace sahassaṃ icchati, ‘‘sahassaṃ homi, sahassaṃ homī’’ti evaṃ parikammamānasaṃ katvā. ‘‘Parikammamānasa’’nti ca pādakajjhānato vuṭṭhāya ‘‘sataṃ homī’’tiādinā pavattitakāmāvacaracittaṃ, pādakajjhānañca. Abhi…pe… punāti ettha pubbe abhiññāpādakajjhānasamāpajjanaṃ parikammacittassa samādhānatthaṃ, puna samāpajjanaṃ adhiṭṭhānacittassa balaggāhatthaṃ. Adhiṭṭhātīti sataṃ āvajjetvā tato paraṃ pavattānaṃ tiṇṇaṃ, catunnaṃ vā pubbabhāgacittānaṃ anantarā uppannena sanniṭṭhāpanavasena adhiṭṭhānanti laddhanāmena abhiññāñāṇena sanniṭṭhānaṃ karoti, sataṃ nipphādetīti attho. ‘‘Adhiṭṭhāna’’nti hi sabbattha abhiññāñāṇaṃ vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1055-7"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nimittārammaṇa"
      },
      "nti paṭibhāganimittārammaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parikammamanānettha satārammaṇikānī"
      },
      "ti ettha etesu parikammādhiṭṭhānesu parikammamānasāni ‘‘sataṃ homī’’ti pavattāni kāmāvacaramānasāni satārammaṇikāni ekekassa cittassa vasena satārammaṇikāni honti paccekaṃ ‘‘sataṃ homī’’ti pavattanato. Sahassārammaṇādīsupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadādhiṭṭhānacittampī"
      },
      "ti tassa satādikassa adhiṭṭhānacittampi. Satārammaṇikatā ca pana nesaṃ vaṇṇavasena, no sattapaññattivasena. Rūpañhi sataṃ vā sahassaṃ vā katvā dassetabbaṃ, na paññatti. Ettha ca yadi nīlavaṇṇameva sataṃ abhinipphādeti, vaṇṇassa taṃtaṃsantānavasena nānattepi nīlavasena ekattā ekamekaṃ parikammacittaṃ sabbaṃ nīlajātaṃ ālambati."
    ],
    "innerText": "1055-7.Nimittārammaṇanti paṭibhāganimittārammaṇaṃ. Parikammamanānettha satārammaṇikānīti ettha etesu parikammādhiṭṭhānesu parikammamānasāni ‘‘sataṃ homī’’ti pavattāni kāmāvacaramānasāni satārammaṇikāni ekekassa cittassa vasena satārammaṇikāni honti paccekaṃ ‘‘sataṃ homī’’ti pavattanato. Sahassārammaṇādīsupi eseva nayo. Tadādhiṭṭhānacittampīti tassa satādikassa adhiṭṭhānacittampi. Satārammaṇikatā ca pana nesaṃ vaṇṇavasena, no sattapaññattivasena. Rūpañhi sataṃ vā sahassaṃ vā katvā dassetabbaṃ, na paññatti. Ettha ca yadi nīlavaṇṇameva sataṃ abhinipphādeti, vaṇṇassa taṃtaṃsantānavasena nānattepi nīlavasena ekattā ekamekaṃ parikammacittaṃ sabbaṃ nīlajātaṃ ālambati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadi pana nānāvaṇṇanānākiriyaparikammacittānampi bahubhāvo hoti, ekamekaṃ ekekavaṇṇaṃ, ekekavaṇṇesu ca nānākiriyaṃ ",
      " ārammaṇaṃ karoti. Adhiṭṭhānacittaṃ pana vaṇṇasāmaññaṃ gahetvāpi parikammārammaṇaṃ nānāvaṇṇavantaṃ abhinipphādeti acinteyyānubhāvattā iddhivisayassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appanācittaṃ viyā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viya"
      },
      "-ggahaṇaṃ abhiññācittassa, jhānacittassa ca paṭhamuppattiyaṃ sadisabhāvato vuttaṃ, na tassa appanābhāvato. Teneva hi pubbe vuttaggahaṇena visesitanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catutthajjhānika"
      },
      "nti rūpāvacaracatutthajjhānavantaṃ, tena sampayuttaṃ. Yadi evaṃ catutthajjhānassa, imassa ca ko visesoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘parikammavisesovā’’"
      },
      "ti. Na hettha parikammavisesaṃ ",
      " vinā añño viseso atthi. Appanāya pubbabhāgappavattānipi tīṇi cattāri javanāni gahitaggahaṇena, aggahitaggahaṇena vā parikammopacārānulomāni sabbapacchimaṃ gotrabhunāmakantiādi sesaṃ samānameva. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sesaṃ pubbasamaṃ idhā’’"
      },
      "ti. Iddhividhañāṇavaṇṇanā."
    ],
    "innerText": "Yadi pana nānāvaṇṇanānākiriyaparikammacittānampi bahubhāvo hoti, ekamekaṃ ekekavaṇṇaṃ, ekekavaṇṇesu ca nānākiriyaṃ ārammaṇaṃ karoti. Adhiṭṭhānacittaṃ pana vaṇṇasāmaññaṃ gahetvāpi parikammārammaṇaṃ nānāvaṇṇavantaṃ abhinipphādeti acinteyyānubhāvattā iddhivisayassa. Appanācittaṃ viyāti viya-ggahaṇaṃ abhiññācittassa, jhānacittassa ca paṭhamuppattiyaṃ sadisabhāvato vuttaṃ, na tassa appanābhāvato. Teneva hi pubbe vuttaggahaṇena visesitanti. Catutthajjhānikanti rūpāvacaracatutthajjhānavantaṃ, tena sampayuttaṃ. Yadi evaṃ catutthajjhānassa, imassa ca ko visesoti āha ‘‘parikammavisesovā’’ti. Na hettha parikammavisesaṃ vinā añño viseso atthi. Appanāya pubbabhāgappavattānipi tīṇi cattāri javanāni gahitaggahaṇena, aggahitaggahaṇena vā parikammopacārānulomāni sabbapacchimaṃ gotrabhunāmakantiādi sesaṃ samānameva. Tenāha ‘‘sesaṃ pubbasamaṃ idhā’’ti. Iddhividhañāṇavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1058"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dibbasota"
      },
      "nti devatānaṃ pittasemhādīhi apalibuddhehi dūrepi ārammaṇaggahaṇasamatthehi dibbasotapasādehi samānattā, dibbavihāravasena paṭiladdhattā, attanā ca dibbavihārasannissitattā dibbaṃ, savanaṭṭhena sotakiccakaraṇato, taṃsadisatāya ca sotaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ida"
      },
      "nti yaṃ uddese ‘‘dibbāni cakkhusotānī’’ti (abhidha. 1048) dibbasotaṃ uddiṭṭhaṃ, taṃ idanti attho."
    ],
    "innerText": "1058.Dibbasotanti devatānaṃ pittasemhādīhi apalibuddhehi dūrepi ārammaṇaggahaṇasamatthehi dibbasotapasādehi samānattā, dibbavihāravasena paṭiladdhattā, attanā ca dibbavihārasannissitattā dibbaṃ, savanaṭṭhena sotakiccakaraṇato, taṃsadisatāya ca sotaṃ. Idanti yaṃ uddese ‘‘dibbāni cakkhusotānī’’ti (abhidha. 1048) dibbasotaṃ uddiṭṭhaṃ, taṃ idanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1059-64"
      },
      ". Paṭhamaṃ oḷārikasaddaṃ āvajjetvā pacchā sukhumasaddassa āvajjitabbato āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘mahanto sukhumopi cā’’"
      },
      "ti. Paricayakaraṇatthañhi paṭhamaṃ araññe sīhādīnaṃ sadde ādiṃ katvā sabbe oḷārikato paṭṭhāya yathānukkamena sukhumasaddā āvajjitabbā, tathā puratthimādīsu disāsu oḷārikānampi sukhumānampi saddānaṃ saddanimittaṃ manasi ",
      " kātabbaṃ. Tassa te saddā pakaticittassapi pākaṭā honti, parikammacittassa pana ativiya pākaṭā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā"
      },
      "ti tassa yogino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddassa nimitta"
      },
      "nti oḷārikassa, sukhumassa vā saddassa yathāvuttaṃ upādāyupādāya labbhamānaoḷārikasukhumākāraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manasi kubbato"
      },
      "ti ‘‘imissā disāya ayaṃ saddo oḷāriko, sukhumo vā’’ti evaṃ parikammacittena manasi karontassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddesū"
      },
      "ti ye parikammacittassa visayabhūtā oḷārikā, sukhumā vā saddā, tesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññatara"
      },
      "nti yattha parikammakaraṇavasena abhiṇhaṃ manasikāro pavatto, taṃ ekaṃ saddaṃ. Yadi abhiññācittampi parikammena gahitameva ārammaṇaṃ karoti, ko pana tassa, imassa vā visesoti? Vuccate – parikammacittaṃ asutassa gahaṇato saddamattaṃ gaṇhāti, abhiññācittaṃ pana asutampi gaṇhantaṃ savanākārena gahaṇato atthāvabodhassa paccayabhāveneva gaṇhātīti ayametesaṃ viseso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sutakovidā"
      },
      "ti pariyattiyaṃ chekā."
    ],
    "innerText": "1059-64. Paṭhamaṃ oḷārikasaddaṃ āvajjetvā pacchā sukhumasaddassa āvajjitabbato āha ‘‘mahanto sukhumopi cā’’ti. Paricayakaraṇatthañhi paṭhamaṃ araññe sīhādīnaṃ sadde ādiṃ katvā sabbe oḷārikato paṭṭhāya yathānukkamena sukhumasaddā āvajjitabbā, tathā puratthimādīsu disāsu oḷārikānampi sukhumānampi saddānaṃ saddanimittaṃ manasi kātabbaṃ. Tassa te saddā pakaticittassapi pākaṭā honti, parikammacittassa pana ativiya pākaṭā. Tassāti tassa yogino. Saddassa nimittanti oḷārikassa, sukhumassa vā saddassa yathāvuttaṃ upādāyupādāya labbhamānaoḷārikasukhumākāraṃ. Manasi kubbatoti ‘‘imissā disāya ayaṃ saddo oḷāriko, sukhumo vā’’ti evaṃ parikammacittena manasi karontassa. Saddesūti ye parikammacittassa visayabhūtā oḷārikā, sukhumā vā saddā, tesu. Aññataranti yattha parikammakaraṇavasena abhiṇhaṃ manasikāro pavatto, taṃ ekaṃ saddaṃ. Yadi abhiññācittampi parikammena gahitameva ārammaṇaṃ karoti, ko pana tassa, imassa vā visesoti? Vuccate – parikammacittaṃ asutassa gahaṇato saddamattaṃ gaṇhāti, abhiññācittaṃ pana asutampi gaṇhantaṃ savanākārena gahaṇato atthāvabodhassa paccayabhāveneva gaṇhātīti ayametesaṃ viseso. Sutakovidāti pariyattiyaṃ chekā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1065-6"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thāmajāta"
      },
      "nti jātathāmaṃ, daḷhabhāvappattanti attho. Vaḍḍhetabbaṃ pādakajjhānārammaṇaṃ kittakanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘etthantaragata’’"
      },
      "ntiādi. Pādakajjhānassa hi ārammaṇabhūtaṃ ",
      " kasiṇanimittaṃ ‘‘ettakaṃ ṭhānaṃ pharatū’’ti manasi karitvā pādakajjhānaṃ samāpajjantassa kasiṇanimittaṃ tattakaṃ ṭhānaṃ pharitvā tiṭṭhati. So samāpattito vuṭṭhāya puna pādakajjhānaṃ asamāpajjitvāpi anekappabhedepi sadde āvajjati subhāvitabhāvanattā. Tattha aññataraṃ saddaṃ ārabbha uppannāvajjanānantaraṃ cattāri, pañca vā javanāni uppajjanti, tesu pacchimaṃ iddhicittaṃ hoti. Evaṃ yattakaṃ saddaṃ icchati, tattakaṃ tattha gataṃ āvajjitvā abhiññāñāṇena jānāti. Yena pana evaṃ kasiṇanimittaṃ avaḍḍhitaṃ, tena punapi pādakajjhānaṃ samāpajjitabbameva. So hi taṃ ṭhānagatasaddaṃ pādakajjhānaṃ samāpajjitvāva tato ",
      " vuṭṭhāya abhiññācittena suṇāti. Tato eva hi ‘‘pādakārammaṇena…pe… suṇātīti sāsaṅkaṃ vadatī’’ti (visuddhi. mahā. 2.400) vuttaṃ. Iddhividhalābhī pana sesābhiññalābhino viya vijjamānasaddādiārammaṇamattameva akatvā āgantukarūpanimmāpanato sabbathāpi dvikkhattuṃ pādakajjhānaṃ samāpajjitvāva taṃ nipphādeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekaṅguladvaṅgula"
      },
      "-ggahaṇañcettha sukhumasaddāpekkhāya kataṃ."
    ],
    "innerText": "1065-6.Thāmajātanti jātathāmaṃ, daḷhabhāvappattanti attho. Vaḍḍhetabbaṃ pādakajjhānārammaṇaṃ kittakanti āha ‘‘etthantaragata’’ntiādi. Pādakajjhānassa hi ārammaṇabhūtaṃ kasiṇanimittaṃ ‘‘ettakaṃ ṭhānaṃ pharatū’’ti manasi karitvā pādakajjhānaṃ samāpajjantassa kasiṇanimittaṃ tattakaṃ ṭhānaṃ pharitvā tiṭṭhati. So samāpattito vuṭṭhāya puna pādakajjhānaṃ asamāpajjitvāpi anekappabhedepi sadde āvajjati subhāvitabhāvanattā. Tattha aññataraṃ saddaṃ ārabbha uppannāvajjanānantaraṃ cattāri, pañca vā javanāni uppajjanti, tesu pacchimaṃ iddhicittaṃ hoti. Evaṃ yattakaṃ saddaṃ icchati, tattakaṃ tattha gataṃ āvajjitvā abhiññāñāṇena jānāti. Yena pana evaṃ kasiṇanimittaṃ avaḍḍhitaṃ, tena punapi pādakajjhānaṃ samāpajjitabbameva. So hi taṃ ṭhānagatasaddaṃ pādakajjhānaṃ samāpajjitvāva tato vuṭṭhāya abhiññācittena suṇāti. Tato eva hi ‘‘pādakārammaṇena…pe… suṇātīti sāsaṅkaṃ vadatī’’ti (visuddhi. mahā. 2.400) vuttaṃ. Iddhividhalābhī pana sesābhiññalābhino viya vijjamānasaddādiārammaṇamattameva akatvā āgantukarūpanimmāpanato sabbathāpi dvikkhattuṃ pādakajjhānaṃ samāpajjitvāva taṃ nipphādeti. Ekaṅguladvaṅgula-ggahaṇañcettha sukhumasaddāpekkhāya kataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1068"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suṇanto"
      },
      "ti evaṃ paricchinditvā paricchinditvā savanena vasikatābhiñño hutvā yathāvajjite suṇanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṭiyekkampī"
      },
      "ti ekajjhaṃ pavattamānepi yāva brahmalokā ekakolāhalaṃ katvā uṭṭhite saṅkhabherīpaṇavādisadde paccekaṃ vatthubhedena vavatthāpetukāmatāya sati ‘‘ayaṃ saṅkhasaddo, ayaṃ bherīsaddo, ayaṃ paṇavasaddo’’tiādinā paccekaṃyeva vavatthāpetuṃ sakkotiyevāti. Dibbasotañāṇavaṇṇanā."
    ],
    "innerText": "1068.Suṇantoti evaṃ paricchinditvā paricchinditvā savanena vasikatābhiñño hutvā yathāvajjite suṇanto. Pāṭiyekkampīti ekajjhaṃ pavattamānepi yāva brahmalokā ekakolāhalaṃ katvā uṭṭhite saṅkhabherīpaṇavādisadde paccekaṃ vatthubhedena vavatthāpetukāmatāya sati ‘‘ayaṃ saṅkhasaddo, ayaṃ bherīsaddo, ayaṃ paṇavasaddo’’tiādinā paccekaṃyeva vavatthāpetuṃ sakkotiyevāti. Dibbasotañāṇavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1069-73"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cetopariyamānasa"
      },
      "nti pariyātīti pariyaṃ, sarāgādivasena paricchijja jānātīti attho. Yesañhi dhātūnaṃ gati attho, buddhipi tesaṃ attho hotīti. Cetaso pariyaṃ cetopariyaṃ, manasi bhavanti mānasaṃ, ñāṇaṃ, cetopariyañca taṃ mānasañcāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cetopariyamānasaṃ. Dibbacakkhuvasenevā"
      },
      "ti dibbacakkhuupanissayeneva. Tañhi etassa uppādane parikammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      "ti yasmā idaṃ dibbacakkhuvaseneva pavattati, tasmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dibbena cakkhunā"
      },
      "ti dibbasadisatādīhi ‘‘dibbacakkhū’’ti laddhavohārena dibbacakkhuñāṇena disvāti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hadaya"
      },
      "nti na hadayavatthu, atha kho hadayamaṃsapesi. Yaṃ bahi kamalamakuḷasaṇṭhānaṃ anto kosātakīphalasadisanti vuccati. Tañhi nissāya idāni ",
      " vuccamānaṃ lohitaṃ tiṭṭhati. Hadayavatthu pana imaṃ lohitaṃ nissāya pavattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lohitaṃ disvā"
      },
      "ti lohitassa vaṇṇaṃ disvā. Dibbacakkhunopi hi vaṇṇameva dissati. Teneva ",
      " hi taṃ cakkhusadisattā ‘‘cakkhū’’ti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parassā"
      },
      "ti aññassa. Yathā hi yo paro na hoti, so attā, evaṃ yo attā na hoti, so paro. Kathaṃ pana dibbacakkhunā lohitassa vaṇṇadassanena paracittaṃ viññeyyanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘somanassayute’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lohita"
      },
      "nti rattaṃ nigrodhaphalasamānavaṇṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāḷaka"
      },
      "nti jambusadisavaṇṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tilatelūpama"
      },
      "nti anena pasannabhāvamāha."
    ],
    "innerText": "1069-73.Cetopariyamānasanti pariyātīti pariyaṃ, sarāgādivasena paricchijja jānātīti attho. Yesañhi dhātūnaṃ gati attho, buddhipi tesaṃ attho hotīti. Cetaso pariyaṃ cetopariyaṃ, manasi bhavanti mānasaṃ, ñāṇaṃ, cetopariyañca taṃ mānasañcāti cetopariyamānasaṃ. Dibbacakkhuvasenevāti dibbacakkhuupanissayeneva. Tañhi etassa uppādane parikammaṃ. Tasmāti yasmā idaṃ dibbacakkhuvaseneva pavattati, tasmā. Dibbena cakkhunāti dibbasadisatādīhi ‘‘dibbacakkhū’’ti laddhavohārena dibbacakkhuñāṇena disvāti sambandho. Hadayanti na hadayavatthu, atha kho hadayamaṃsapesi. Yaṃ bahi kamalamakuḷasaṇṭhānaṃ anto kosātakīphalasadisanti vuccati. Tañhi nissāya idāni vuccamānaṃ lohitaṃ tiṭṭhati. Hadayavatthu pana imaṃ lohitaṃ nissāya pavattati. Lohitaṃ disvāti lohitassa vaṇṇaṃ disvā. Dibbacakkhunopi hi vaṇṇameva dissati. Teneva hi taṃ cakkhusadisattā ‘‘cakkhū’’ti vuccati. Parassāti aññassa. Yathā hi yo paro na hoti, so attā, evaṃ yo attā na hoti, so paro. Kathaṃ pana dibbacakkhunā lohitassa vaṇṇadassanena paracittaṃ viññeyyanti āha ‘‘somanassayute’’tiādi. Lohitanti rattaṃ nigrodhaphalasamānavaṇṇaṃ. Kāḷakanti jambusadisavaṇṇaṃ. Tilatelūpamanti anena pasannabhāvamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ pana citte somanassa sahagatādimhi sati kammajassa lohitassa vividhavaṇṇabhāvāpattīti? Kiñcāpi hadayavatthusannissitabhūtāni kammajāneva, taṃ pana lohitaṃ kammajamevāti natthi catusantatirūpassapi tattha labbhamānattā. Teneva hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathāyaṃ"
      },
      " ‘‘idaṃ rūpaṃ somanassindriyasamuṭṭhānaṃ, idaṃ domanassindriyasamuṭṭhānaṃ, idaṃ upekkhindriyasamuṭṭhānanti parassa hadayalohitavaṇṇaṃ passitvā’’ti (visuddhi. 2.401) vuttaṃ. Evampi yaṃ tattha acittajaṃ, tassa yathāvuttavaṇṇabhedena na bhavitabbanti? Bhavitabbaṃ sesasantatirūpānaṃ tadanuvattanato. Yathā hi gamanādīsu cittajarūpāni utujakammajāhārajarūpehi anuvattīyanti, aññathā kāyassa desantarappattiyeva na siyāti, evamidhāpi cittajarūpaṃ sesasantatirūpehi anuvattīyati, pasādakodhavelāsu ca cakkhussa vaṇṇabhedāpattiyeva tassatthassa nidassanaṃ daṭṭhabbaṃ, tasmā somanassādiyuttacittānurūpaṃ uppannacittasamuṭṭhānarūpavasena sesatisamuṭṭhānarūpānampi nānāvaṇṇatā hotiyevāti suṭṭhu vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘lohitaṃ lohitaṃ siyā’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Disvā hadayalohita"
      },
      "nti paṭhamaṃ tāva anumānañāṇena ",
      " lohitaṃ disvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kātabbaṃ thāmataṃ gata"
      },
      "nti uppādetvā thāmabhāvaṃ gataṃ kātabbaṃ."
    ],
    "innerText": "Kathaṃ pana citte somanassa sahagatādimhi sati kammajassa lohitassa vividhavaṇṇabhāvāpattīti? Kiñcāpi hadayavatthusannissitabhūtāni kammajāneva, taṃ pana lohitaṃ kammajamevāti natthi catusantatirūpassapi tattha labbhamānattā. Teneva hi aṭṭhakathāyaṃ ‘‘idaṃ rūpaṃ somanassindriyasamuṭṭhānaṃ, idaṃ domanassindriyasamuṭṭhānaṃ, idaṃ upekkhindriyasamuṭṭhānanti parassa hadayalohitavaṇṇaṃ passitvā’’ti (visuddhi. 2.401) vuttaṃ. Evampi yaṃ tattha acittajaṃ, tassa yathāvuttavaṇṇabhedena na bhavitabbanti? Bhavitabbaṃ sesasantatirūpānaṃ tadanuvattanato. Yathā hi gamanādīsu cittajarūpāni utujakammajāhārajarūpehi anuvattīyanti, aññathā kāyassa desantarappattiyeva na siyāti, evamidhāpi cittajarūpaṃ sesasantatirūpehi anuvattīyati, pasādakodhavelāsu ca cakkhussa vaṇṇabhedāpattiyeva tassatthassa nidassanaṃ daṭṭhabbaṃ, tasmā somanassādiyuttacittānurūpaṃ uppannacittasamuṭṭhānarūpavasena sesatisamuṭṭhānarūpānampi nānāvaṇṇatā hotiyevāti suṭṭhu vuttaṃ ‘‘lohitaṃ lohitaṃ siyā’’tiādi. Disvā hadayalohitanti paṭhamaṃ tāva anumānañāṇena lohitaṃ disvā. Kātabbaṃ thāmataṃ gatanti uppādetvā thāmabhāvaṃ gataṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cetopariyañāṇañhi uppādetukāmena yoginā dibbacakkhulābhinā eva satā heṭṭhā vuttanayena rūpāvacaracatutthajjhānaṃ aṭṭhaṅgasamannāgataṃ abhinīhārakkhamaṃ katvā ālokaṃ vaḍḍhetvā dibbena cakkhunā parassa hadayamaṃsapesiṃ nissāya vattamānassa lohitassa vaṇṇadassanena idāni imassa cittaṃ ‘‘somanassasahagata’’nti vā ‘‘domanassasahagata’’nti vā ‘‘upekkhāsahagata’’nti vā nayaggāhavasena vavatthāpetvā pādakajjhānaṃ samāpajjitvā vuṭṭhāya ‘‘imassa cittaṃ jānāmī’’ti parikammaṃ kātabbaṃ. Kālasatampi kālasahassampi punappunaṃ pādakajjhānaṃ samāpajjitvā vuṭṭhāya tatheva paṭipajjitabbaṃ. Tassevaṃ dibbena cakkhunā hadayalohitavaṇṇadassanādividhinā paṭipajjantassa ‘‘idāni cetopariyañāṇaṃ uppajjissatī’’ti yaṃ tadā pavattatīti vavatthāpitaṃ cittaṃ, taṃ ārammaṇaṃ katvā manodvārāvajjanaṃ tīṇi cattāri vā javanāni kāmāvacarāni javanti. Catutthaṃ, pañcamaṃ vā abhiññācittaṃ rūpāvacaracatutthajjhānikaṃ ",
      ". Tattha yaṃ tena appanācittena sampayuttaṃ ñāṇaṃ, idaṃ cetopariyañāṇaṃ. Tañhi yattha anena parikammaṃ kataṃ, taṃ parassa cittaṃ paccakkhato paṭivijjhantaṃ vibhāventameva hutvā pavattati, rūpaṃ viya ca dibbacakkhuñāṇaṃ, saddaṃ viya ca dibbasotañāṇaṃ. Tato paraṃ pana kāmāvacaracittehi sarāgādivavatthāpanaṃ hoti nīlādivavatthāpanaṃ viya."
    ],
    "innerText": "Cetopariyañāṇañhi uppādetukāmena yoginā dibbacakkhulābhinā eva satā heṭṭhā vuttanayena rūpāvacaracatutthajjhānaṃ aṭṭhaṅgasamannāgataṃ abhinīhārakkhamaṃ katvā ālokaṃ vaḍḍhetvā dibbena cakkhunā parassa hadayamaṃsapesiṃ nissāya vattamānassa lohitassa vaṇṇadassanena idāni imassa cittaṃ ‘‘somanassasahagata’’nti vā ‘‘domanassasahagata’’nti vā ‘‘upekkhāsahagata’’nti vā nayaggāhavasena vavatthāpetvā pādakajjhānaṃ samāpajjitvā vuṭṭhāya ‘‘imassa cittaṃ jānāmī’’ti parikammaṃ kātabbaṃ. Kālasatampi kālasahassampi punappunaṃ pādakajjhānaṃ samāpajjitvā vuṭṭhāya tatheva paṭipajjitabbaṃ. Tassevaṃ dibbena cakkhunā hadayalohitavaṇṇadassanādividhinā paṭipajjantassa ‘‘idāni cetopariyañāṇaṃ uppajjissatī’’ti yaṃ tadā pavattatīti vavatthāpitaṃ cittaṃ, taṃ ārammaṇaṃ katvā manodvārāvajjanaṃ tīṇi cattāri vā javanāni kāmāvacarāni javanti. Catutthaṃ, pañcamaṃ vā abhiññācittaṃ rūpāvacaracatutthajjhānikaṃ . Tattha yaṃ tena appanācittena sampayuttaṃ ñāṇaṃ, idaṃ cetopariyañāṇaṃ. Tañhi yattha anena parikammaṃ kataṃ, taṃ parassa cittaṃ paccakkhato paṭivijjhantaṃ vibhāventameva hutvā pavattati, rūpaṃ viya ca dibbacakkhuñāṇaṃ, saddaṃ viya ca dibbasotañāṇaṃ. Tato paraṃ pana kāmāvacaracittehi sarāgādivavatthāpanaṃ hoti nīlādivavatthāpanaṃ viya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1074-5"
      },
      ". Evamadhigatassa pana cetopariyañāṇassa thāmagamanavidhānampi adhigamavidhānasadisameva, tadevettha ācariyena dassitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ thāmagate"
      },
      "tiādi thāmagamanānisaṃsadassanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbamevā"
      },
      "ti idaṃ ‘‘kāmāvacaracittaṃ, rūpārūpesu ",
      " mānasa’’nti ubhayapadenapi sambandhitabbaṃ, catupaṇṇāsavidhaṃ kāmāvacaracittaṃ, pañcadasarūpāvacaracittaṃ, dvādasaarūpāvacaracittanti sabbameva, paccekaṃ sarāgādippabhedakaṃ vijānātīti attho. Puthujjanassa vasenāyaṃ abhiññākathāti lokuttaracittaṃ idha anuddhaṭaṃ. Tampi hi uparimo, sadiso vā ariyo heṭṭhimassa, sadisassa ca cittaṃ jānāti, heṭṭhimo pana uparimassa cittaṃ na jānāti. Yathā cetaṃ, evaṃ arūpāvacarajjhāne akatābhiniveso puthujjano, sekhopi vā arūpāvacaracittaṃ na jānāti. Aṭṭhasamāpattikassa pana vasena idhārūpāvacaracittassāpi jānanaṃ vuttaṃ. Arahā pana āruppe akatābhinivesopi tappaṭicchādakaavijjāya vihatattā tampi jānātiyeva. Cetopariyañāṇavaṇṇanā."
    ],
    "innerText": "1074-5. Evamadhigatassa pana cetopariyañāṇassa thāmagamanavidhānampi adhigamavidhānasadisameva, tadevettha ācariyena dassitaṃ. Evaṃ thāmagatetiādi thāmagamanānisaṃsadassanaṃ. Sabbamevāti idaṃ ‘‘kāmāvacaracittaṃ, rūpārūpesu mānasa’’nti ubhayapadenapi sambandhitabbaṃ, catupaṇṇāsavidhaṃ kāmāvacaracittaṃ, pañcadasarūpāvacaracittaṃ, dvādasaarūpāvacaracittanti sabbameva, paccekaṃ sarāgādippabhedakaṃ vijānātīti attho. Puthujjanassa vasenāyaṃ abhiññākathāti lokuttaracittaṃ idha anuddhaṭaṃ. Tampi hi uparimo, sadiso vā ariyo heṭṭhimassa, sadisassa ca cittaṃ jānāti, heṭṭhimo pana uparimassa cittaṃ na jānāti. Yathā cetaṃ, evaṃ arūpāvacarajjhāne akatābhiniveso puthujjano, sekhopi vā arūpāvacaracittaṃ na jānāti. Aṭṭhasamāpattikassa pana vasena idhārūpāvacaracittassāpi jānanaṃ vuttaṃ. Arahā pana āruppe akatābhinivesopi tappaṭicchādakaavijjāya vihatattā tampi jānātiyeva. Cetopariyañāṇavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1076-7"
      },
      ". Pubbe atītajātīsu nivāsā nivutthā attano santāne pavattā, saparaviññāṇehi gocarāsevanāya āsevitā ca khandhā pubbenivāsā. Paraviññāṇaviññātāpi hi pubbe nivasiṃsu etthāti pubbenivāsāti vuccanti, te pana chinnavaṭumakānussaraṇādīsu buddhānaṃyeva visayā, pubbe nivāsesu sarūpavibhāvakaṃ ñāṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pubbenivāsañāṇaṃ"
      },
      ". Tena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadanussatī"
      },
      "ti tesaṃ pubbenivāsānaṃ anussati. Heṭṭhā tīsu jhānesu yathārahaṃ pītisukhehi kāyacittānaṃ sampīṇanāya cattāri jhānāni samāpajjitabbānīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘jhānāni panā’’"
      },
      "tiādi. Aññathā pādakajjhānaṃ samāpajjitvāyevāti vuttaṃ siyā. Yāya nisajjāya nisinnassa anussaraṇārambho, sā idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbapacchimā nisajjā"
      },
      "."
    ],
    "innerText": "1076-7. Pubbe atītajātīsu nivāsā nivutthā attano santāne pavattā, saparaviññāṇehi gocarāsevanāya āsevitā ca khandhā pubbenivāsā. Paraviññāṇaviññātāpi hi pubbe nivasiṃsu etthāti pubbenivāsāti vuccanti, te pana chinnavaṭumakānussaraṇādīsu buddhānaṃyeva visayā, pubbe nivāsesu sarūpavibhāvakaṃ ñāṇaṃ pubbenivāsañāṇaṃ. Tena. Tadanussatīti tesaṃ pubbenivāsānaṃ anussati. Heṭṭhā tīsu jhānesu yathārahaṃ pītisukhehi kāyacittānaṃ sampīṇanāya cattāri jhānāni samāpajjitabbānīti āha ‘‘jhānāni panā’’tiādi. Aññathā pādakajjhānaṃ samāpajjitvāyevāti vuttaṃ siyā. Yāya nisajjāya nisinnassa anussaraṇārambho, sā idha sabbapacchimā nisajjā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1078-80"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato pabhuti…pe… kkamā"
      },
      "ti tasmiṃ bhave purimabhavādīsu kataṃ sabbampi saṅgahetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbamāvajjitabba"
      },
      "ntiādinā visuṃ visuṃ rattindivādivasena dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Divase"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rattiyaṃ kata"
      },
      "nti sabbapacchimanisajjāto paṭṭhāya āsanapaññāpanaṃ senāsanappavesananti paṭilomena ",
      " sakalaṃ rattindivaṃ katakiccaṃ āvajjitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katamāvajjitabba"
      },
      "nti yaṃ etthantare katakiccaṃ, sabbaṃ taṃ paṭilomakkameneva āvajjitabbanti attho. Ettakaṃ pana pakaticittassapi pākaṭaṃ, parikammacittassa pana atipākaṭameva. Sace panettha kiñci na pākaṭaṃ hoti, puna pādakajjhānaṃ samāpajjitvā vuṭṭhāya āvajjitabbaṃ, ettakena dīpe jalite viya pākaṭaṃ hoti. Pādakajjhānasamāpajjanañhi satthakassa viya nisānasilā satipaññānaṃ nisitabhāvāvahaṃ, tasmā tā taṃsamāpajjanena paramanepakkappattā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purimasmiṃ bhave"
      },
      "ti imamhā bhavā anantare purimasmiṃ bhave."
    ],
    "innerText": "1078-80.Tato pabhuti…pe… kkamāti tasmiṃ bhave purimabhavādīsu kataṃ sabbampi saṅgahetvā sabbamāvajjitabbantiādinā visuṃ visuṃ rattindivādivasena dasseti. Divaserattiyaṃ katanti sabbapacchimanisajjāto paṭṭhāya āsanapaññāpanaṃ senāsanappavesananti paṭilomena sakalaṃ rattindivaṃ katakiccaṃ āvajjitabbaṃ. Katamāvajjitabbanti yaṃ etthantare katakiccaṃ, sabbaṃ taṃ paṭilomakkameneva āvajjitabbanti attho. Ettakaṃ pana pakaticittassapi pākaṭaṃ, parikammacittassa pana atipākaṭameva. Sace panettha kiñci na pākaṭaṃ hoti, puna pādakajjhānaṃ samāpajjitvā vuṭṭhāya āvajjitabbaṃ, ettakena dīpe jalite viya pākaṭaṃ hoti. Pādakajjhānasamāpajjanañhi satthakassa viya nisānasilā satipaññānaṃ nisitabhāvāvahaṃ, tasmā tā taṃsamāpajjanena paramanepakkappattā honti. Purimasmiṃ bhaveti imamhā bhavā anantare purimasmiṃ bhave."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1081"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibbattaṃ nāmarūpañcā"
      },
      "ti attano paccayehi nibbattanāmarūpaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhuka"
      },
      "nti suṭṭhu aparihāpetvā āvajjitabbaṃ. Pahoti hi imissā abhiññāya katādhikāro bhikkhu paṭhamavāreneva paṭisandhiṃ ugghāṭetvā cutikkhaṇe nāmarūpaṃ ārammaṇaṃ kātuṃ, tathā asakkontenāpi dhuranikkhepaṃ akatvā pādakajjhānameva punappunaṃ samāpajjitabbaṃ, tato ca vuṭṭhāya punappunaṃ āvajjitabbaṃ. Āvajjantena ca pana paṭhamaṃ rūpaṃ āvajjitvā pacchā nāmaṃ āvajjitabbanti ācariyā. Apare pana vipariyāyena vadanti."
    ],
    "innerText": "1081.Nibbattaṃ nāmarūpañcāti attano paccayehi nibbattanāmarūpaṃ. Sādhukanti suṭṭhu aparihāpetvā āvajjitabbaṃ. Pahoti hi imissā abhiññāya katādhikāro bhikkhu paṭhamavāreneva paṭisandhiṃ ugghāṭetvā cutikkhaṇe nāmarūpaṃ ārammaṇaṃ kātuṃ, tathā asakkontenāpi dhuranikkhepaṃ akatvā pādakajjhānameva punappunaṃ samāpajjitabbaṃ, tato ca vuṭṭhāya punappunaṃ āvajjitabbaṃ. Āvajjantena ca pana paṭhamaṃ rūpaṃ āvajjitvā pacchā nāmaṃ āvajjitabbanti ācariyā. Apare pana vipariyāyena vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha pacchimanisajjāto pabhuti yāva paṭisandhito ārammaṇaṃ katvā pavattañāṇaṃ atītajātīsu nivutthadhammārammaṇābhāvato pubbenivāsānussatiñāṇaṃ nāma na hoti, taṃ pana parikammañāṇameva. Yadā panassa paṭisandhiṃ atikkamma cutikkhaṇe uppannaṃ nāmarūpaṃ ārammaṇaṃ katvā manodvārāvajjanaṃ uppajjati, tasmiṃ niruddhe vuttanayena appanācittaṃ ",
      " uppajjati, tena sampayuttaṃ ñāṇaṃ pubbenivāsānussatiñāṇaṃ nāma. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yadā panā’’"
      },
      "tiādi."
    ],
    "innerText": "Tattha pacchimanisajjāto pabhuti yāva paṭisandhito ārammaṇaṃ katvā pavattañāṇaṃ atītajātīsu nivutthadhammārammaṇābhāvato pubbenivāsānussatiñāṇaṃ nāma na hoti, taṃ pana parikammañāṇameva. Yadā panassa paṭisandhiṃ atikkamma cutikkhaṇe uppannaṃ nāmarūpaṃ ārammaṇaṃ katvā manodvārāvajjanaṃ uppajjati, tasmiṃ niruddhe vuttanayena appanācittaṃ uppajjati, tena sampayuttaṃ ñāṇaṃ pubbenivāsānussatiñāṇaṃ nāma. Tenāha ‘‘yadā panā’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Etthāha – kiṃ ekeneva abhiññācittena cutikkhaṇe pavattanāmarūpaṃ sabbampi ārammaṇaṃ karoti, udāhu aññena aññenāti. Kiñcettha yadi ekeneva, dūrato cittapaṭaṃ pekkhantassa viya anirūpitarūpena vavatthānaṃ hoti. Yadi ca aññena aññena, visuṃ visuṃ pādakajjhānasamāpajjanādinā bhavitabbanti? Ubhayathāpi na doso. Iddhivisayassa hi acinteyyattā ekenapi abhiññācittena nāmarūpe passanto nirūpitarūpeneva passati, na anirūpitarūpeneva passati, aññenapi vā paṭhamameva pādakajjhānaṃ samāpajjitvā vuṭṭhāya samāhitacittena ",
      " kataparikammassa pavattitattā puna samāpajjanaṃ vinā āvajjitvā ārammaṇaṃ karotiyevāti. Pubbenivāsānussatiñāṇavaṇṇanā."
    ],
    "innerText": "Etthāha – kiṃ ekeneva abhiññācittena cutikkhaṇe pavattanāmarūpaṃ sabbampi ārammaṇaṃ karoti, udāhu aññena aññenāti. Kiñcettha yadi ekeneva, dūrato cittapaṭaṃ pekkhantassa viya anirūpitarūpena vavatthānaṃ hoti. Yadi ca aññena aññena, visuṃ visuṃ pādakajjhānasamāpajjanādinā bhavitabbanti? Ubhayathāpi na doso. Iddhivisayassa hi acinteyyattā ekenapi abhiññācittena nāmarūpe passanto nirūpitarūpeneva passati, na anirūpitarūpeneva passati, aññenapi vā paṭhamameva pādakajjhānaṃ samāpajjitvā vuṭṭhāya samāhitacittena kataparikammassa pavattitattā puna samāpajjanaṃ vinā āvajjitvā ārammaṇaṃ karotiyevāti. Pubbenivāsānussatiñāṇavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1086-8"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dibbacakkhunā"
      },
      "ti dibbasadisattā, dibbavihāravasena paṭilabhitabbattā, attanā ca dibbavihārasannissitattā mahājutikatādīhi vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dibbaṃ,"
      },
      " rūpadassanaṭṭhena cakkhumivāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhu"
      },
      ". Yathā hi maṃsacakkhu viññāṇādhiṭṭhitaṃ samavisamaṃ ācikkhantaṃ viya pavattati, idaṃ pana tato sātisayaṃ cakkhukiccakārīti dibbañca taṃ cakkhu cāti dibbacakkhu, tena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dibbacakkhunā. Kasiṇārammaṇa"
      },
      "nti aṭṭhannampi kasiṇānaṃ vasena kasiṇārammaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhinīhārakkhamaṃ katvā"
      },
      "ti cuddasavidhena cittaparidamanena aṭṭhaṅgasampannatākaraṇena abhinīhārakkhamaṃ dibbacakkhuñāṇābhimukhaṃ pesanārahaṃ pesanayogyaṃ katvā. ‘‘Tejo…pe… kasiṇampi vā āsannaṃ kātabba’’nti pāṭhaseso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsannaṃ kātabba"
      },
      "nti dibbacakkhuñāṇuppattiyā samīpabhūtaṃ kāraṇabhūtaṃ kātabbaṃ, tattha upacārajjhānaṃ paguṇataraṃ katvā ",
      " taṃ vaḍḍhetvā icchitakkhaṇe upaṭṭhānayogyaṃ katvā ṭhapetabbanti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etthā"
      },
      "ti imasmiṃ dibbacakkhunā rūpadassanavisaye. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seṭṭhanti paridīpita"
      },
      "nti ālokakasiṇasseva pabhāvissajjanasabhāvena ālokakaraṇena itarehi visiṭṭhattā visiṭṭhanti paridīpitaṃ."
    ],
    "innerText": "1086-8.Dibbacakkhunāti dibbasadisattā, dibbavihāravasena paṭilabhitabbattā, attanā ca dibbavihārasannissitattā mahājutikatādīhi vā dibbaṃ, rūpadassanaṭṭhena cakkhumivāti cakkhu. Yathā hi maṃsacakkhu viññāṇādhiṭṭhitaṃ samavisamaṃ ācikkhantaṃ viya pavattati, idaṃ pana tato sātisayaṃ cakkhukiccakārīti dibbañca taṃ cakkhu cāti dibbacakkhu, tena dibbacakkhunā. Kasiṇārammaṇanti aṭṭhannampi kasiṇānaṃ vasena kasiṇārammaṇaṃ. Abhinīhārakkhamaṃ katvāti cuddasavidhena cittaparidamanena aṭṭhaṅgasampannatākaraṇena abhinīhārakkhamaṃ dibbacakkhuñāṇābhimukhaṃ pesanārahaṃ pesanayogyaṃ katvā. ‘‘Tejo…pe… kasiṇampi vā āsannaṃ kātabba’’nti pāṭhaseso. Āsannaṃ kātabbanti dibbacakkhuñāṇuppattiyā samīpabhūtaṃ kāraṇabhūtaṃ kātabbaṃ, tattha upacārajjhānaṃ paguṇataraṃ katvā taṃ vaḍḍhetvā icchitakkhaṇe upaṭṭhānayogyaṃ katvā ṭhapetabbanti vuttaṃ hoti. Etthāti imasmiṃ dibbacakkhunā rūpadassanavisaye. Seṭṭhanti paridīpitanti ālokakasiṇasseva pabhāvissajjanasabhāvena ālokakaraṇena itarehi visiṭṭhattā visiṭṭhanti paridīpitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1089-90"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppādetvā"
      },
      "ti paṭhamajjhānaniddese vuttanayena upacārajjhānuppādanena uppādetvā. Upacārajjhānuppattiyā hi saddhiṃ paṭibhāganimittuppatti. Yasmā pādakajjhānaṃ vijjamāneyeva āloke appanāvasena pavattimattaṃ vinā attano balena ālokaṃ pharituṃ na sakkoti, nāpi yathāpatthaṭaṃ thāvaraṃ kātuṃ, parikammaṃ pana tadubhayampi kātuṃ samatthaṃ, tasmā upacārabhūmiyaṃyeva taṃ vaḍḍhetabbanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘upacārabhūmiya’’"
      },
      "ntiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upacārabhūmī"
      },
      "ti cettha ālokassa thāvarakaraṇavasappavattaṃ parikammacittamevāti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appana"
      },
      "nti jhānavasena appanaṃ. Na hi akataparikammassa abhiññāvasena appanā sijjhati. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pādakajjhānanissita’’"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pādakajjhānanissita"
      },
      "nti pādakajjhānārammaṇaṃ hoti, na dibbacakkhussa parikammanissitaṃ parikammārammaṇaṃ hoti, tathā ca sati ālokavaḍḍhanābhāvato rūpadassanaṃ na siyāti adhippāyo."
    ],
    "innerText": "1089-90.Uppādetvāti paṭhamajjhānaniddese vuttanayena upacārajjhānuppādanena uppādetvā. Upacārajjhānuppattiyā hi saddhiṃ paṭibhāganimittuppatti. Yasmā pādakajjhānaṃ vijjamāneyeva āloke appanāvasena pavattimattaṃ vinā attano balena ālokaṃ pharituṃ na sakkoti, nāpi yathāpatthaṭaṃ thāvaraṃ kātuṃ, parikammaṃ pana tadubhayampi kātuṃ samatthaṃ, tasmā upacārabhūmiyaṃyeva taṃ vaḍḍhetabbanti āha ‘‘upacārabhūmiya’’ntiādi. Upacārabhūmīti cettha ālokassa thāvarakaraṇavasappavattaṃ parikammacittamevāti daṭṭhabbaṃ. Appananti jhānavasena appanaṃ. Na hi akataparikammassa abhiññāvasena appanā sijjhati. Tenāha ‘‘pādakajjhānanissita’’nti. Pādakajjhānanissitanti pādakajjhānārammaṇaṃ hoti, na dibbacakkhussa parikammanissitaṃ parikammārammaṇaṃ hoti, tathā ca sati ālokavaḍḍhanābhāvato rūpadassanaṃ na siyāti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1091-3"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anto…pe… bhave"
      },
      "ti antogatameva rūpagataṃ passitabbaṃ bhave, na bahiddhā vikkhepuppattihetubhāvato ",
      " passitabbaṃ dibbacakkhunāti adhippāyo. Na hi āloke pharitepi maṃsacakkhussa āpāthaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parikammassa vāro hi atikkamati tāvade"
      },
      "ti idha parikammaṃ nāma yathāvuttakasiṇārammaṇaṃ upacārajjhānaṃ, taṃ rūpagataṃ passato na pavattati, kasiṇālokavasena ca rūpagatadassanaṃ kasiṇāloko ca parikammavasenāti tadubhayampi parikammassa ",
      " appavattiyā na hoti. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ālokopī’’"
      },
      "tiādi. Tasmiṃ antarahite rūpagatampi na ca dissati, rūpagataṃ passato parikammassa vāro atikkamati, parikammapasutassa kasiṇārammaṇañāṇaṃ hotīti rūpagataṃ dissati, kathaṃ paṭipajjitabbanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tenā’’"
      },
      "tiādi."
    ],
    "innerText": "1091-3.Anto…pe… bhaveti antogatameva rūpagataṃ passitabbaṃ bhave, na bahiddhā vikkhepuppattihetubhāvato passitabbaṃ dibbacakkhunāti adhippāyo. Na hi āloke pharitepi maṃsacakkhussa āpāthaṃ hoti. Parikammassa vāro hi atikkamati tāvadeti idha parikammaṃ nāma yathāvuttakasiṇārammaṇaṃ upacārajjhānaṃ, taṃ rūpagataṃ passato na pavattati, kasiṇālokavasena ca rūpagatadassanaṃ kasiṇāloko ca parikammavasenāti tadubhayampi parikammassa appavattiyā na hoti. Tenāha ‘‘ālokopī’’tiādi. Tasmiṃ antarahite rūpagatampi na ca dissati, rūpagataṃ passato parikammassa vāro atikkamati, parikammapasutassa kasiṇārammaṇañāṇaṃ hotīti rūpagataṃ dissati, kathaṃ paṭipajjitabbanti āha ‘‘tenā’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1094-9"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ anukkamenā"
      },
      "ti punappunaṃ pādakajjhānaṃ samāpajjitvā tato vuṭṭhāya abhiṇhaṃ ālokapharaṇena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āloko thāmavā"
      },
      "ti ālokagato ciraṭṭhāyī siyā, tathā ca sati tattha sucirampi rūpagataṃ passateva. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āloko etthā’’"
      },
      "tiādi. Svāyamattho tiṇukkūpamāya vibhāvetabboti dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tiṇukkāyā’’"
      },
      "tiādi. Eko kira rattiyaṃ tiṇukkāya maggaṃ paṭipajji, tassa sā tiṇukkā vijjhāyi, athassa samavisamāni na paññāyiṃsu, so taṃ tiṇukkaṃ bhūmiyaṃ ghaṃsitvā puna ujjālesi, sā pajjalitvā purimālokato mahantaramālokaṃ akāsi, evaṃ punappunaṃ vijjhātaṃ ujjālayato kamena sūriyo uṭṭhāsi, sūriye uṭṭhite ‘‘ukkāya kammaṃ natthī’’ti taṃ chaḍḍetvā divasampi agamāsi. Tattha ukkāloko viya parikammakāle kasiṇāloko, ukkāya vijjhātāya samavisamānaṃ adassanaṃ viya rūpagataṃ passato parikammassa vārātikkamena āloke antarahite rūpagatānaṃ adassanaṃ, ukkāya ghaṃsanaṃ viya punappunaṃ pādakajjhānasamāpajjanaṃ, ukkāya purimālokato mahantatarālokakaraṇaṃ viya puna parikammaṃ karoto balavatarālokapharaṇaṃ, sūriyuṭṭhānaṃ viya thāmagatālokassa yathāvaḍḍhitaparicchedaṃ pharitvā avaṭṭhānaṃ, tiṇukkaṃ chaḍḍetvā divasampi gamanaṃ viya padittālokaṃ vaḍḍhetvā thāmagatenālokena divasampi rūpadassanaṃ. Ettāvatā ca dibbacakkhussa nānāvajjanaparikammañceva dibbacakkhuñāṇañca dassitaṃ, na tassa uppattikkamoti ",
      " taṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘uppādanakkamopī’’"
      },
      "tiādi vuttaṃ. Taṃ heṭṭhā vuttanayattā suviññeyyameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāni cattāri pañca vā"
      },
      "ti potthakesu likhanti. ‘‘Tīṇi cattāri vā panā’’ti pāṭho."
    ],
    "innerText": "1094-9.Evaṃ anukkamenāti punappunaṃ pādakajjhānaṃ samāpajjitvā tato vuṭṭhāya abhiṇhaṃ ālokapharaṇena. Āloko thāmavāti ālokagato ciraṭṭhāyī siyā, tathā ca sati tattha sucirampi rūpagataṃ passateva. Tena vuttaṃ ‘‘āloko etthā’’tiādi. Svāyamattho tiṇukkūpamāya vibhāvetabboti dassento āha ‘‘tiṇukkāyā’’tiādi. Eko kira rattiyaṃ tiṇukkāya maggaṃ paṭipajji, tassa sā tiṇukkā vijjhāyi, athassa samavisamāni na paññāyiṃsu, so taṃ tiṇukkaṃ bhūmiyaṃ ghaṃsitvā puna ujjālesi, sā pajjalitvā purimālokato mahantaramālokaṃ akāsi, evaṃ punappunaṃ vijjhātaṃ ujjālayato kamena sūriyo uṭṭhāsi, sūriye uṭṭhite ‘‘ukkāya kammaṃ natthī’’ti taṃ chaḍḍetvā divasampi agamāsi. Tattha ukkāloko viya parikammakāle kasiṇāloko, ukkāya vijjhātāya samavisamānaṃ adassanaṃ viya rūpagataṃ passato parikammassa vārātikkamena āloke antarahite rūpagatānaṃ adassanaṃ, ukkāya ghaṃsanaṃ viya punappunaṃ pādakajjhānasamāpajjanaṃ, ukkāya purimālokato mahantatarālokakaraṇaṃ viya puna parikammaṃ karoto balavatarālokapharaṇaṃ, sūriyuṭṭhānaṃ viya thāmagatālokassa yathāvaḍḍhitaparicchedaṃ pharitvā avaṭṭhānaṃ, tiṇukkaṃ chaḍḍetvā divasampi gamanaṃ viya padittālokaṃ vaḍḍhetvā thāmagatenālokena divasampi rūpadassanaṃ. Ettāvatā ca dibbacakkhussa nānāvajjanaparikammañceva dibbacakkhuñāṇañca dassitaṃ, na tassa uppattikkamoti taṃ dassetuṃ ‘‘uppādanakkamopī’’tiādi vuttaṃ. Taṃ heṭṭhā vuttanayattā suviññeyyameva. Tāni cattāri pañca vāti potthakesu likhanti. ‘‘Tīṇi cattāri vā panā’’ti pāṭho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1100"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthasādhakacitta"
      },
      "nti yadatthāyesa paṭipanno, tassa tadatthasādhanato atthasādhakabhūtaṃ ",
      " cittaṃ. Tasmiñhi uppanne maṃsacakkhussa anāpāthayogyaṃ antokucchigataṃ hadayavatthunissitaṃ heṭṭhāpathavītalanissitaṃ tirokuṭṭapabbatapākāragataṃ paracakkavāḷagatanti idaṃ rūpaṃ āpāthaṃ āgacchati, maṃsacakkhunā dissamānaṃ viya hoti. Tadeva cettha rūpaṃ sarūpato vibhāvanasamatthaṃ cakkhuviññāṇaṃ viya. Na pana āvajjanaparikammavasena pavattāni pubbabhāgacittāni. Tāni hi ārammaṇaṃ karontānipi na yāthāvato taṃ vibhāvetvā pavattanti āvajjanasampaṭicchanādicittāni viyāti."
    ],
    "innerText": "1100. Tattha atthasādhakacittanti yadatthāyesa paṭipanno, tassa tadatthasādhanato atthasādhakabhūtaṃ cittaṃ. Tasmiñhi uppanne maṃsacakkhussa anāpāthayogyaṃ antokucchigataṃ hadayavatthunissitaṃ heṭṭhāpathavītalanissitaṃ tirokuṭṭapabbatapākāragataṃ paracakkavāḷagatanti idaṃ rūpaṃ āpāthaṃ āgacchati, maṃsacakkhunā dissamānaṃ viya hoti. Tadeva cettha rūpaṃ sarūpato vibhāvanasamatthaṃ cakkhuviññāṇaṃ viya. Na pana āvajjanaparikammavasena pavattāni pubbabhāgacittāni. Tāni hi ārammaṇaṃ karontānipi na yāthāvato taṃ vibhāvetvā pavattanti āvajjanasampaṭicchanādicittāni viyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1101-2"
      },
      ". Nanu ca anāgataṃsañāṇaṃ yathākammūpagañāṇanti dve abhiññāñāṇāni atthi, kasmā tāni idha na dassitānīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘anāgataṃsañāṇassā’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ijjhanti dibbacakkhunā"
      },
      "ti visuṃ parikammassa abhāvato dibbacakkhuñāṇapaṭilābheneva tassa parivārāni hutvā paṭiladdhāni honti. Tatoyeva hi tāni tassa paribhaṇḍañāṇānīti vuccanti. Yathā hi sinerussa parivāraṭṭhāniyāni taṃsiddhiyā siddhāni mekhalaṭṭhānāni paribhaṇḍānīti vuccanti, evaṃ imānipi dibbacakkhusiddhiyā siddhāni tassa paribhaṇḍānīti veditabbāni."
    ],
    "innerText": "1101-2. Nanu ca anāgataṃsañāṇaṃ yathākammūpagañāṇanti dve abhiññāñāṇāni atthi, kasmā tāni idha na dassitānīti āha ‘‘anāgataṃsañāṇassā’’tiādi. Ijjhanti dibbacakkhunāti visuṃ parikammassa abhāvato dibbacakkhuñāṇapaṭilābheneva tassa parivārāni hutvā paṭiladdhāni honti. Tatoyeva hi tāni tassa paribhaṇḍañāṇānīti vuccanti. Yathā hi sinerussa parivāraṭṭhāniyāni taṃsiddhiyā siddhāni mekhalaṭṭhānāni paribhaṇḍānīti vuccanti, evaṃ imānipi dibbacakkhusiddhiyā siddhāni tassa paribhaṇḍānīti veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hotu tāva evametaṃ, cutūpapātañāṇaṃ pana kiṃ na dassitanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cutūpapātañāṇampī’’"
      },
      "tiādi. Dibbacakkhuñāṇameva hi cutiyaṃ, upapattiyañca rūpaṃ vibhāventaṃ cutūpapāte pavattattā ‘‘cutūpapātañāṇa’’nti vuccati, avasesarūpavibhāvanakāle ",
      " ‘‘dibbacakkhū’’ti vuccati, tasmā paramatthato nāmadvayena āgataṃ ekameva ñāṇaṃ, dibbacakkhuñāṇaṃ cutūpapātañāṇanti pana byañjanatoyeva nānanti. Katthaci manomayañāṇantipi visuṃ abhiññāñāṇaṃ āgataṃ, taṃ atthato iddhividhañāṇameva. Dibbacakkhuñāṇavaṇṇanā."
    ],
    "innerText": "Hotu tāva evametaṃ, cutūpapātañāṇaṃ pana kiṃ na dassitanti āha ‘‘cutūpapātañāṇampī’’tiādi. Dibbacakkhuñāṇameva hi cutiyaṃ, upapattiyañca rūpaṃ vibhāventaṃ cutūpapāte pavattattā ‘‘cutūpapātañāṇa’’nti vuccati, avasesarūpavibhāvanakāle ‘‘dibbacakkhū’’ti vuccati, tasmā paramatthato nāmadvayena āgataṃ ekameva ñāṇaṃ, dibbacakkhuñāṇaṃ cutūpapātañāṇanti pana byañjanatoyeva nānanti. Katthaci manomayañāṇantipi visuṃ abhiññāñāṇaṃ āgataṃ, taṃ atthato iddhividhañāṇameva. Dibbacakkhuñāṇavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1103"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti imasmiṃ sāsane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anena tarenā"
      },
      "ti anena abhidhammāvatāranāmakena tarena."
    ],
    "innerText": "1103.Idhāti imasmiṃ sāsane. Anena tarenāti anena abhidhammāvatāranāmakena tarena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti abhidhammatthavikāsiniyā nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhidhammāvatārasaṃvaṇṇanāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhiññāniddesavaṇṇanā niṭṭhitā."
  }
]