[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "21. Ekavīsatimo paricchedo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Paṭipadāñāṇadassanavisuddhiniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1298"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhañāṇavasenevā"
      },
      "ti ",
      " udayabbayañāṇādīnaṃ aṭṭhannaṃ ñāṇānaṃ vasena. Vipassanācārassa matthakappattiyā saṅkhārupekkhāñāṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sikhāpattā vipassanā"
      },
      ". Sikhāpatti panassā udayabbayañāṇādīnaṃ aṭṭhañāṇānaṃ vasenāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘aṭṭhañāṇavasenā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navama"
      },
      "nti saccānulomikañāṇaṃ. Iti udayabbayādīni aṭṭha, idañca navamañāṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭipadāñāṇadassananti pavuccati"
      },
      ". Paṭipajjati etāya ariyamaggoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭipadā,"
      },
      " udayabbayādīnaṃ jānanaṭṭhena, paccakkhato dassanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñāṇadassana"
      },
      "ñcāti katvā."
    ],
    "innerText": "1298.Aṭṭhañāṇavasenevāti udayabbayañāṇādīnaṃ aṭṭhannaṃ ñāṇānaṃ vasena. Vipassanācārassa matthakappattiyā saṅkhārupekkhāñāṇaṃ sikhāpattā vipassanā. Sikhāpatti panassā udayabbayañāṇādīnaṃ aṭṭhañāṇānaṃ vasenāti āha ‘‘aṭṭhañāṇavasenā’’ti. Navamanti saccānulomikañāṇaṃ. Iti udayabbayādīni aṭṭha, idañca navamañāṇaṃ paṭipadāñāṇadassananti pavuccati. Paṭipajjati etāya ariyamaggoti paṭipadā, udayabbayādīnaṃ jānanaṭṭhena, paccakkhato dassanaṭṭhena ñāṇadassanañcāti katvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1299"
      },
      ". Tāni pana ñāṇāni sarūpato dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘aṭṭha ñāṇānī’’"
      },
      "tiādi vuttaṃ. Tattha udayabbayānupassanāñāṇaṃ kiñcāpi tīraṇapariññāya patiṭṭhaṃ, tathāpi yathāvuttaṭṭhena paṭipadāñāṇadassanampi hotiyevāti tampi idha vuttaṃ. Itarattha pana uppannamattaṃ appaguṇaṃ sandhāya vuttaṃ. Appaguṇañhi niccasaññādipahānasiddhiyā pahānapariññāya adhiṭṭhānabhūtaṃ. Yato tadadhigamena aṭṭhārasasu mahāvipassanāsu ekaccā adhigatāva honti. Na hi udayabbayānaṃ paccakkhato paṭivedhena vinā sāmaññākārānaṃ tīraṇamattena sātisayaṃ paṭipakkhappahānaṃ sambhavati. Asati ca paṭipakkhappahāne kuto ñāṇādīnaṃ vajiramiva avihatavegatā tikhiṇavisadāditā vā, tasmā paguṇabhāvappattaṃ udayabbayañāṇaṃ pahānapariññāpakkhiyameva daṭṭhabbaṃ."
    ],
    "innerText": "1299. Tāni pana ñāṇāni sarūpato dassetuṃ ‘‘aṭṭha ñāṇānī’’tiādi vuttaṃ. Tattha udayabbayānupassanāñāṇaṃ kiñcāpi tīraṇapariññāya patiṭṭhaṃ, tathāpi yathāvuttaṭṭhena paṭipadāñāṇadassanampi hotiyevāti tampi idha vuttaṃ. Itarattha pana uppannamattaṃ appaguṇaṃ sandhāya vuttaṃ. Appaguṇañhi niccasaññādipahānasiddhiyā pahānapariññāya adhiṭṭhānabhūtaṃ. Yato tadadhigamena aṭṭhārasasu mahāvipassanāsu ekaccā adhigatāva honti. Na hi udayabbayānaṃ paccakkhato paṭivedhena vinā sāmaññākārānaṃ tīraṇamattena sātisayaṃ paṭipakkhappahānaṃ sambhavati. Asati ca paṭipakkhappahāne kuto ñāṇādīnaṃ vajiramiva avihatavegatā tikhiṇavisadāditā vā, tasmā paguṇabhāvappattaṃ udayabbayañāṇaṃ pahānapariññāpakkhiyameva daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1300-2"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhaṅge"
      },
      "ti saṅkhārānaṃ bhaṅge. Yathābhūtadassāvī bhāyati etasmāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhayaṃ,"
      },
      " tebhūmakadhammā, tesu bhayato ",
      " upatiṭṭhantesu bhāyitabbākāraggāhiñāṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhayeñāṇaṃ"
      },
      ". Tathā hetaṃ ‘‘bhayatupaṭṭhānañāṇa’’nti vuccati. Muccituṃ icchatīti muccitukamyaṃ, cittaṃ, puggalo vā, tassa bhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "muccitukamyatā,"
      },
      " taṃ pana ñāṇamevāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ñāṇaṃ muccitukamyatā’’"
      },
      "ti. Puna paṭisaṅkhānākārena pavattaṃ ñāṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisaṅkhānupassanāñāṇaṃ"
      },
      ". Nirapekkhatāya saṅkhārānaṃ upekkhanavasena pavattaṃ ñāṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅkhārupekkhāñāṇaṃ"
      },
      ". Gāthābandhatthaṃ pana visandhiniddeso. Oḷārikoḷārikassa saccapaṭicchādakatamassa ",
      " vigamanena saccapaṭivedhānukūlattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saccānulomikaṃ"
      },
      ". Taṃ pana idanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘saccānulomañāṇanti, anulomaṃ pavuccatī’’"
      },
      "ti."
    ],
    "innerText": "1300-2.Bhaṅgeti saṅkhārānaṃ bhaṅge. Yathābhūtadassāvī bhāyati etasmāti bhayaṃ, tebhūmakadhammā, tesu bhayato upatiṭṭhantesu bhāyitabbākāraggāhiñāṇaṃ bhayeñāṇaṃ. Tathā hetaṃ ‘‘bhayatupaṭṭhānañāṇa’’nti vuccati. Muccituṃ icchatīti muccitukamyaṃ, cittaṃ, puggalo vā, tassa bhāvo muccitukamyatā, taṃ pana ñāṇamevāti āha ‘‘ñāṇaṃ muccitukamyatā’’ti. Puna paṭisaṅkhānākārena pavattaṃ ñāṇaṃ paṭisaṅkhānupassanāñāṇaṃ. Nirapekkhatāya saṅkhārānaṃ upekkhanavasena pavattaṃ ñāṇaṃ saṅkhārupekkhāñāṇaṃ. Gāthābandhatthaṃ pana visandhiniddeso. Oḷārikoḷārikassa saccapaṭicchādakatamassa vigamanena saccapaṭivedhānukūlattā saccānulomikaṃ. Taṃ pana idanti āha ‘‘saccānulomañāṇanti, anulomaṃ pavuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1303"
      },
      ". Nanu ca udayabbayañāṇassa pageva siddhattā kimatthaṃ puna tatthāpi abhiyogoti ce? Aniccādilakkhaṇasallakkhaṇatthaṃ. Udayabbayañāṇañhi heṭṭhā dasahi upakkilesehi upakkiliṭṭhaṃ hutvā yāthāvasarasato tilakkhaṇaṃ sallakkhetuṃ nāsakkhi, upakkilesavinimuttaṃ pana sakkoti, tasmā lakkhaṇasallakkhaṇatthaṃ puna tattheva yogo kātabbo. Lakkhaṇāni cassa udayabbayādīnaṃ amanasikārā, santatiiriyāpathaghanachannatāya ca nopaṭṭhahanti, tasmā udayabbayaṃ manasi katvā santatiṃ ugghāṭetvā aniccalakkhaṇaṃ, abhiṇhapīḷanaṃ pariggahetvā iriyāpathaṃ ugghāṭetvā dukkhalakkhaṇaṃ, dhātuyo vinibbhujitvā ghanavinibbhogaṃ katvā anattalakkhaṇañca sallakkhetvā ‘‘aniccā dukkhā anattā’’ti saṅkhārā punappunaṃ sammasitabbā. Tassevaṃ tulayato tīrayato yadā saṅkhāragataṃ attano lahuupaṭṭhānena, ñāṇassa ca tikkhatāya tirohituppādādibhedaṃ bhijjamānameva upaṭṭhāti, bhaṅgeyeva tassa ñāṇaṃ santiṭṭhati, tadā bhaṅgānupassanā nāma vipassanāñāṇaṃ adhigataṃ hoti. Tassa tadeva saṅkhāranirodhārammaṇabhaṅgānupassanaṃ āsevantassa yadā ",
      " sabbabhavayonigatiṭṭhitinivāsesu saṅkhārā bhijjanasabhāvatāya yakkharakkhasādayo viya mahābhayaṃ hutvā upaṭṭhahanti, tadāssa bhayatupaṭṭhānañāṇaṃ adhigataṃ hoti. Kiṃ panidaṃ ñāṇaṃ bhāyatīti? Na bhāyati. Tañhi ‘‘atītā saṅkhārā niruddhā, paccuppannā nirujjhanti, anāgatā nirujjhissantī’’ti tīraṇamattameva hoti, byasanāpannānaṃ pana sabbasaṅkhārānaṃ bhayato upaṭṭhitānaṃ gahaṇena bhayatupaṭṭhānañāṇanti vuccatīti."
    ],
    "innerText": "1303. Nanu ca udayabbayañāṇassa pageva siddhattā kimatthaṃ puna tatthāpi abhiyogoti ce? Aniccādilakkhaṇasallakkhaṇatthaṃ. Udayabbayañāṇañhi heṭṭhā dasahi upakkilesehi upakkiliṭṭhaṃ hutvā yāthāvasarasato tilakkhaṇaṃ sallakkhetuṃ nāsakkhi, upakkilesavinimuttaṃ pana sakkoti, tasmā lakkhaṇasallakkhaṇatthaṃ puna tattheva yogo kātabbo. Lakkhaṇāni cassa udayabbayādīnaṃ amanasikārā, santatiiriyāpathaghanachannatāya ca nopaṭṭhahanti, tasmā udayabbayaṃ manasi katvā santatiṃ ugghāṭetvā aniccalakkhaṇaṃ, abhiṇhapīḷanaṃ pariggahetvā iriyāpathaṃ ugghāṭetvā dukkhalakkhaṇaṃ, dhātuyo vinibbhujitvā ghanavinibbhogaṃ katvā anattalakkhaṇañca sallakkhetvā ‘‘aniccā dukkhā anattā’’ti saṅkhārā punappunaṃ sammasitabbā. Tassevaṃ tulayato tīrayato yadā saṅkhāragataṃ attano lahuupaṭṭhānena, ñāṇassa ca tikkhatāya tirohituppādādibhedaṃ bhijjamānameva upaṭṭhāti, bhaṅgeyeva tassa ñāṇaṃ santiṭṭhati, tadā bhaṅgānupassanā nāma vipassanāñāṇaṃ adhigataṃ hoti. Tassa tadeva saṅkhāranirodhārammaṇabhaṅgānupassanaṃ āsevantassa yadā sabbabhavayonigatiṭṭhitinivāsesu saṅkhārā bhijjanasabhāvatāya yakkharakkhasādayo viya mahābhayaṃ hutvā upaṭṭhahanti, tadāssa bhayatupaṭṭhānañāṇaṃ adhigataṃ hoti. Kiṃ panidaṃ ñāṇaṃ bhāyatīti? Na bhāyati. Tañhi ‘‘atītā saṅkhārā niruddhā, paccuppannā nirujjhanti, anāgatā nirujjhissantī’’ti tīraṇamattameva hoti, byasanāpannānaṃ pana sabbasaṅkhārānaṃ bhayato upaṭṭhitānaṃ gahaṇena bhayatupaṭṭhānañāṇanti vuccatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassa taṃ bhayatupaṭṭhānañāṇaṃ āsevantassa yadā sabbabhavagatesu saṅkhāresu tāṇaṃ vā leṇaṃ vā parāyaṇaṃ vā na paññāyati, ukkhittāsiko viya paccāmitto sādīnavā eva saṅkhārā upaṭṭhahanti, tassa saṅkhārānaṃ ādīnavameva passantassa ādīnavañāṇaṃ nāma uppannaṃ hoti. Tassevaṃ sabbasaṅkhāre ādīnavato passantassa yadā tibhavapariyāpannesu nibbedo uppajjati, ukkaṇṭhā saṇṭhahanti, sabbasaṅkhāravisaṃyutte santipade abhiratiṃ paṭilabhati, tadāssa nibbidānupassanaṃ nāma ñāṇaṃ uppannaṃ hoti. Tassa yadā iminā nibbidāñāṇena sabbasaṅkhāresu nibbindantassa ekasaṅkhārepi cittaṃ na sajjati, sabbasmā saṅkhārato sappamukhagatassa viya maṇḍūkassa muccitukāmatā uppajjati, tadā muccitukamyatāñāṇaṃ nāma uppannaṃ hoti. Tassevaṃ sabbasaṅkhārehi muccitukāmassa niccasukhasubhaattākārena pana upaṭṭhituṃ asamatthataṃ pāpetvā muccanassa ",
      " upāyasampādanatthaṃ aniccantikatādīhi aniccalakkhaṇaṃ, abhiṇhapaṭipīḷanatādīhi dukkhalakkhaṇaṃ, ajaññakatādīhi paṭikkūlataṃ, tucchatādīhi anattalakkhaṇañca āropetvā sabbasaṅkhāragataṃ pariggaṇhantassa paṭisaṅkhānupassanāñāṇaṃ nāma uppannaṃ hoti. Tena panevaṃ pariggahitasaṅkhārena yā sā ‘‘suññamidaṃ attena vā attaniyena vā’’tiādinā dvikoṭikādibhedā suññatā vuttā, sā ",
      " pariggahetabbā. Tassevaṃ suññato disvā tilakkhaṇaṃ āropetvā sammasantassa yadā bhayañca nandiñca vippahāya vissaṭṭhabhariyassa viya saṅkhāragatesu upekkhā santiṭṭhati, tīsu bhavesu cittaṃ na sampasāriyati, tadāssa saṅkhārupekkhāñāṇaṃ nāma uppannaṃ hoti. Taṃ panetaṃ yāva nibbānaṃ na passati, tāva disākāko viya kūpakayaṭṭhiṃ punappunaṃ saṅkhārameva anabhimatampi nissāya saṅkhāravicinanepi majjhattameva hutvā tiṭṭhati. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘etesu pana ñāṇesū’’"
      },
      "tiādi."
    ],
    "innerText": "Tassa taṃ bhayatupaṭṭhānañāṇaṃ āsevantassa yadā sabbabhavagatesu saṅkhāresu tāṇaṃ vā leṇaṃ vā parāyaṇaṃ vā na paññāyati, ukkhittāsiko viya paccāmitto sādīnavā eva saṅkhārā upaṭṭhahanti, tassa saṅkhārānaṃ ādīnavameva passantassa ādīnavañāṇaṃ nāma uppannaṃ hoti. Tassevaṃ sabbasaṅkhāre ādīnavato passantassa yadā tibhavapariyāpannesu nibbedo uppajjati, ukkaṇṭhā saṇṭhahanti, sabbasaṅkhāravisaṃyutte santipade abhiratiṃ paṭilabhati, tadāssa nibbidānupassanaṃ nāma ñāṇaṃ uppannaṃ hoti. Tassa yadā iminā nibbidāñāṇena sabbasaṅkhāresu nibbindantassa ekasaṅkhārepi cittaṃ na sajjati, sabbasmā saṅkhārato sappamukhagatassa viya maṇḍūkassa muccitukāmatā uppajjati, tadā muccitukamyatāñāṇaṃ nāma uppannaṃ hoti. Tassevaṃ sabbasaṅkhārehi muccitukāmassa niccasukhasubhaattākārena pana upaṭṭhituṃ asamatthataṃ pāpetvā muccanassa upāyasampādanatthaṃ aniccantikatādīhi aniccalakkhaṇaṃ, abhiṇhapaṭipīḷanatādīhi dukkhalakkhaṇaṃ, ajaññakatādīhi paṭikkūlataṃ, tucchatādīhi anattalakkhaṇañca āropetvā sabbasaṅkhāragataṃ pariggaṇhantassa paṭisaṅkhānupassanāñāṇaṃ nāma uppannaṃ hoti. Tena panevaṃ pariggahitasaṅkhārena yā sā ‘‘suññamidaṃ attena vā attaniyena vā’’tiādinā dvikoṭikādibhedā suññatā vuttā, sā pariggahetabbā. Tassevaṃ suññato disvā tilakkhaṇaṃ āropetvā sammasantassa yadā bhayañca nandiñca vippahāya vissaṭṭhabhariyassa viya saṅkhāragatesu upekkhā santiṭṭhati, tīsu bhavesu cittaṃ na sampasāriyati, tadāssa saṅkhārupekkhāñāṇaṃ nāma uppannaṃ hoti. Taṃ panetaṃ yāva nibbānaṃ na passati, tāva disākāko viya kūpakayaṭṭhiṃ punappunaṃ saṅkhārameva anabhimatampi nissāya saṅkhāravicinanepi majjhattameva hutvā tiṭṭhati. Tena vuttaṃ ‘‘etesu pana ñāṇesū’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1306"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipassanā…pe… vuṭṭhānagāminī"
      },
      "ti sikhaṃ uttamabhāvaṃ pattattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sikhāpattā"
      },
      ". Vuṭṭhānaṃ gacchatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuṭṭhānagāminī"
      },
      ". ‘‘Vuṭṭhāna’’nti hi bahiddhā nimittabhūtā abhiniviṭṭhavatthuto ceva ajjhattappavattato ca vuṭṭhahanato maggo vuccati, taṃ gacchatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuṭṭhānagāminī,"
      },
      " maggena saddhiṃ ghaṭīyatīti attho."
    ],
    "innerText": "1306.Vipassanā…pe… vuṭṭhānagāminīti sikhaṃ uttamabhāvaṃ pattattā sikhāpattā. Vuṭṭhānaṃ gacchatīti vuṭṭhānagāminī. ‘‘Vuṭṭhāna’’nti hi bahiddhā nimittabhūtā abhiniviṭṭhavatthuto ceva ajjhattappavattato ca vuṭṭhahanato maggo vuccati, taṃ gacchatīti vuṭṭhānagāminī, maggena saddhiṃ ghaṭīyatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1307"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ta"
      },
      "nti yaṃ sikhāpattā vipassanā saccānulomañāṇanti ca vuccati, taṃ saṅkhārupekkhāñāṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsevantassā"
      },
      "ti punappunaṃ sammasanavasena sevantassa bhāventassa bahulīkarontassa. Tassa hi adhimokkhasaddhā bhāvanāvasena balavatarā nibbattissati, vīriyaṃ supaggahitaṃ paṭipakkhavidhamanasamatthaṃ hoti, ārammaṇābhimukhabhāvena sati supatiṭṭhitā hoti, passaddhisukhānaṃ sātisayatāya cittaṃ susamāhitaṃ, tatova anulomañāṇuppattiyā paccayo bhavituṃ samatthā tikkhatamā saṅkhārupekkhā uppajjati."
    ],
    "innerText": "1307.Tanti yaṃ sikhāpattā vipassanā saccānulomañāṇanti ca vuccati, taṃ saṅkhārupekkhāñāṇaṃ. Āsevantassāti punappunaṃ sammasanavasena sevantassa bhāventassa bahulīkarontassa. Tassa hi adhimokkhasaddhā bhāvanāvasena balavatarā nibbattissati, vīriyaṃ supaggahitaṃ paṭipakkhavidhamanasamatthaṃ hoti, ārammaṇābhimukhabhāvena sati supatiṭṭhitā hoti, passaddhisukhānaṃ sātisayatāya cittaṃ susamāhitaṃ, tatova anulomañāṇuppattiyā paccayo bhavituṃ samatthā tikkhatamā saṅkhārupekkhā uppajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1308-12"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniccā…pe… votarateva sā"
      },
      "ti aniccādīsu ekena ākārena sammasantī sattakkhattuṃ pavattitvā bhijjantī bhavaṅgaṃ otiṇṇā nāma hoti, tato paraṃ bhavaṅgavāroti katvā ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhārupekkhākatanayenā"
      },
      "ti aniccādinā ārammaṇakaraṇavaseneva saṅkhārupekkhāya katanayena, na sammasitanayena. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘aniccādi…pe… kurumāna’’"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavaṅgāvaṭṭanaṃ katvā"
      },
      "ti bhavaṅgassa nivattanaṃ katvā cittassa bhavaṅgavasena pavattituṃ adatvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parikamma"
      },
      "nti maggassa ",
      " parikammattā paṭisaṅkhārakattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upacāra"
      },
      "nti maggassa āsannattā, samīpacārittā vā."
    ],
    "innerText": "1308-12.Aniccā…pe… votarateva sāti aniccādīsu ekena ākārena sammasantī sattakkhattuṃ pavattitvā bhijjantī bhavaṅgaṃ otiṇṇā nāma hoti, tato paraṃ bhavaṅgavāroti katvā . Saṅkhārupekkhākatanayenāti aniccādinā ārammaṇakaraṇavaseneva saṅkhārupekkhāya katanayena, na sammasitanayena. Tenāha ‘‘aniccādi…pe… kurumāna’’nti. Bhavaṅgāvaṭṭanaṃ katvāti bhavaṅgassa nivattanaṃ katvā cittassa bhavaṅgavasena pavattituṃ adatvā. Parikammanti maggassa parikammattā paṭisaṅkhārakattā. Upacāranti maggassa āsannattā, samīpacārittā vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1313-6"
      },
      ". Anulomattaṃ sayameva vadati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘purimāna’’"
      },
      "ntiādinā. Idañhi aniccalakkhaṇādivasena saṅkhāre ārabbha pavattattā, ‘‘udayabbayavantānaṃyeva vata dhammānaṃ udayabbayañāṇaṃ uppādavaye addasā’’ti ca ‘‘bhaṅgavantānaṃyeva vata bhaṅgānupassanaṃ bhaṅgamaddasā’’ti ca ‘‘sabhayaṃyeva vata bhayatupaṭṭhānassa bhayato upaṭṭhita’’nti ca ‘‘sādīnaveyeva vata ādīnavānupassanaṃ ādīnavamaddasā’’ti ca ‘‘nibbinditabbeyeva vata nibbidāñāṇaṃ nibbinda’’nti ca ‘‘muccitabbamhiyeva vata muccitukamyatāñāṇaṃ muccitukāmaṃ jāta’’nti ca ‘‘paṭisaṅkhātabbameva vata paṭisaṅkhāñāṇena paṭisaṅkhāta’’nti ca ‘‘upekkhitabbaṃyeva vata saṅkhārupekkhāya upekkhita’’nti ca atthato vadamānaṃ viya imesañca aṭṭhannaṃ ñāṇānaṃ katakiccatāya anulometi sabbāsaṃyeva vipassanānaṃ lakkhaṇattayasammasanakiccattā, tathā upari ca ariyamagge sattatiṃsāya bodhipakkhiyadhammānaṃ tāya paṭipadāya pattabbatāya. Na hi anulomañāṇe thūlathūlasaccapaṭicchādakasaṃkilesavikkhambhanavasena appavattante gotrabhuñāṇaṃ uppajjati, gotrabhuñāṇe ca anuppanne maggañāṇaṃ na uppajjati, tasmā purimapacchimānaṃ bhāgānaṃ anulomattā ‘‘anulomanti saññita’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tenevā"
      },
      "ti heṭṭhimañāṇānaṃ anulomamukhena, upari bodhipakkhiyānaṃ anulomanato ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saccānulomañāṇanti pavuccati"
      },
      " maggasaccassa anulomikattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuṭṭhānagāminiyā"
      },
      "ti saṅkhārārammaṇāya vuṭṭhānagāminiyā ",
      " vipassanāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyosāna"
      },
      "nti purimā koṭi. Saṅkhārārammaṇavipassanāsu hi ayaṃ visesato vuṭṭhānagāminivipassanāti. Asaṅkhatārammaṇaṃ pana sabbena sabbaṃ ariyamaggasaṅkhātaṃ vuṭṭhānaṃ gacchati upetīti. Tatopi hi visesato ‘‘vuṭṭhānagāminivipassanā’’ti vattabbataṃ labhatīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ñeyyaṃ sabbappakārenā’’"
      },
      "tiādi."
    ],
    "innerText": "1313-6. Anulomattaṃ sayameva vadati ‘‘purimāna’’ntiādinā. Idañhi aniccalakkhaṇādivasena saṅkhāre ārabbha pavattattā, ‘‘udayabbayavantānaṃyeva vata dhammānaṃ udayabbayañāṇaṃ uppādavaye addasā’’ti ca ‘‘bhaṅgavantānaṃyeva vata bhaṅgānupassanaṃ bhaṅgamaddasā’’ti ca ‘‘sabhayaṃyeva vata bhayatupaṭṭhānassa bhayato upaṭṭhita’’nti ca ‘‘sādīnaveyeva vata ādīnavānupassanaṃ ādīnavamaddasā’’ti ca ‘‘nibbinditabbeyeva vata nibbidāñāṇaṃ nibbinda’’nti ca ‘‘muccitabbamhiyeva vata muccitukamyatāñāṇaṃ muccitukāmaṃ jāta’’nti ca ‘‘paṭisaṅkhātabbameva vata paṭisaṅkhāñāṇena paṭisaṅkhāta’’nti ca ‘‘upekkhitabbaṃyeva vata saṅkhārupekkhāya upekkhita’’nti ca atthato vadamānaṃ viya imesañca aṭṭhannaṃ ñāṇānaṃ katakiccatāya anulometi sabbāsaṃyeva vipassanānaṃ lakkhaṇattayasammasanakiccattā, tathā upari ca ariyamagge sattatiṃsāya bodhipakkhiyadhammānaṃ tāya paṭipadāya pattabbatāya. Na hi anulomañāṇe thūlathūlasaccapaṭicchādakasaṃkilesavikkhambhanavasena appavattante gotrabhuñāṇaṃ uppajjati, gotrabhuñāṇe ca anuppanne maggañāṇaṃ na uppajjati, tasmā purimapacchimānaṃ bhāgānaṃ anulomattā ‘‘anulomanti saññita’’nti. Tenevāti heṭṭhimañāṇānaṃ anulomamukhena, upari bodhipakkhiyānaṃ anulomanato ca. Saccānulomañāṇanti pavuccati maggasaccassa anulomikattā. Vuṭṭhānagāminiyāti saṅkhārārammaṇāya vuṭṭhānagāminiyā vipassanāya. Pariyosānanti purimā koṭi. Saṅkhārārammaṇavipassanāsu hi ayaṃ visesato vuṭṭhānagāminivipassanāti. Asaṅkhatārammaṇaṃ pana sabbena sabbaṃ ariyamaggasaṅkhātaṃ vuṭṭhānaṃ gacchati upetīti. Tatopi hi visesato ‘‘vuṭṭhānagāminivipassanā’’ti vattabbataṃ labhatīti āha ‘‘ñeyyaṃ sabbappakārenā’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1317-8"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kittitā"
      },
      "ti thomitā, ariyamaggādhiṭṭhānatāya mahantānaṃ sīlakkhandhādīnaṃ esanato gavesanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahesinā"
      },
      " sammāsambuddhena. Santakilesatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "santā. Yoga"
      },
      "nti bhāvanaṃ, bhāvanābhiyogaṃ vā."
    ],
    "innerText": "1317-8.Kittitāti thomitā, ariyamaggādhiṭṭhānatāya mahantānaṃ sīlakkhandhādīnaṃ esanato gavesanato mahesinā sammāsambuddhena. Santakilesatāya santā. Yoganti bhāvanaṃ, bhāvanābhiyogaṃ vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti abhidhammatthavikāsiniyā nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhidhammāvatārasaṃvaṇṇanāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭipadāñāṇadassanavisuddhiniddesavaṇṇanā niṭṭhitā."
  }
]