[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "9. Iddhipādavibhaṅgo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Suttantabhājanīyavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "431"
      },
      ". Idāni ",
      " tadanantare iddhipādavibhaṅge ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cattāro"
      },
      "ti gaṇanaparicchedo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhipādā"
      },
      "ti ettha ijjhatīti iddhi, samijjhati nipphajjatīti attho. Ijjhanti vā etāya sattā iddhā vuddhā ukkaṃsagatā hontītipi iddhi. Paṭhamenatthena iddhi eva pādo iddhipādo, iddhikoṭṭhāsoti attho. Dutiyenatthena iddhiyā pādoti iddhipādo; pādoti patiṭṭhā, adhigamupāyoti attho. Tena hi yasmā uparūparivisesasaṅkhātaṃ iddhiṃ pajjanti pāpuṇanti, tasmā pādoti vuccati. Evaṃ tāva ‘‘cattāro iddhipādā’’ti ettha attho veditabbo."
    ],
    "innerText": "431. Idāni tadanantare iddhipādavibhaṅge cattāroti gaṇanaparicchedo. Iddhipādāti ettha ijjhatīti iddhi, samijjhati nipphajjatīti attho. Ijjhanti vā etāya sattā iddhā vuddhā ukkaṃsagatā hontītipi iddhi. Paṭhamenatthena iddhi eva pādo iddhipādo, iddhikoṭṭhāsoti attho. Dutiyenatthena iddhiyā pādoti iddhipādo; pādoti patiṭṭhā, adhigamupāyoti attho. Tena hi yasmā uparūparivisesasaṅkhātaṃ iddhiṃ pajjanti pāpuṇanti, tasmā pādoti vuccati. Evaṃ tāva ‘‘cattāro iddhipādā’’ti ettha attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni te bhājetvā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "idha bhikkhū"
      },
      "tiādi āraddhaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "idha bhikkhū"
      },
      "ti imasmiṃ sāsane bhikkhu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chandasamādhipadhānasaṅkhārasamannāgata"
      },
      "nti ettha chandahetuko chandādhiko vā samādhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chandasamādhi"
      },
      ". Kattukamyatāchandaṃ adhipatiṃ karitvā paṭiladdhasamādhissetaṃ adhivacanaṃ. Padhānabhūtā saṅkhārā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padhānasaṅkhārā"
      },
      ". Catukiccasādhakassa sammappadhānavīriyassetaṃ adhivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samannāgata"
      },
      "nti chandasamādhinā ca padhānasaṅkhārehi ca upetaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhipāda"
      },
      "nti nipphattipariyāyena vā ijjhanakaṭṭhena ijjhanti etāya sattā iddhā vuddhā ukkaṃsagatā hontīti iminā vā pariyāyena iddhīti saṅkhaṃ gatānaṃ upacārajjhānādikusalacittasampayuttānaṃ chandasamādhipadhānasaṅkhārānaṃ adhiṭṭhānaṭṭhena pādabhūtaṃ sesacittacetasikarāsinti attho. Yañhi parato ‘‘iddhipādoti tathābhūtassa vedanākkhandho…pe… viññāṇakkhandho’’ti vuttaṃ, taṃ iminā atthena yujjati. Iminā nayena sesesupi attho veditabbo. Yatheva hi chandaṃ adhipatiṃ karitvā paṭiladdhasamādhi ",
      " chandasamādhīti ",
      " vutto, evaṃ vīriyaṃ…pe… cittaṃ. Vīmaṃsaṃ adhipatiṃ karitvā paṭiladdhasamādhi vīmaṃsasamādhīti vuccati."
    ],
    "innerText": "Idāni te bhājetvā dassetuṃ idha bhikkhūtiādi āraddhaṃ. Tattha idha bhikkhūti imasmiṃ sāsane bhikkhu. Chandasamādhipadhānasaṅkhārasamannāgatanti ettha chandahetuko chandādhiko vā samādhi chandasamādhi. Kattukamyatāchandaṃ adhipatiṃ karitvā paṭiladdhasamādhissetaṃ adhivacanaṃ. Padhānabhūtā saṅkhārā padhānasaṅkhārā. Catukiccasādhakassa sammappadhānavīriyassetaṃ adhivacanaṃ. Samannāgatanti chandasamādhinā ca padhānasaṅkhārehi ca upetaṃ. Iddhipādanti nipphattipariyāyena vā ijjhanakaṭṭhena ijjhanti etāya sattā iddhā vuddhā ukkaṃsagatā hontīti iminā vā pariyāyena iddhīti saṅkhaṃ gatānaṃ upacārajjhānādikusalacittasampayuttānaṃ chandasamādhipadhānasaṅkhārānaṃ adhiṭṭhānaṭṭhena pādabhūtaṃ sesacittacetasikarāsinti attho. Yañhi parato ‘‘iddhipādoti tathābhūtassa vedanākkhandho…pe… viññāṇakkhandho’’ti vuttaṃ, taṃ iminā atthena yujjati. Iminā nayena sesesupi attho veditabbo. Yatheva hi chandaṃ adhipatiṃ karitvā paṭiladdhasamādhi chandasamādhīti vutto, evaṃ vīriyaṃ…pe… cittaṃ. Vīmaṃsaṃ adhipatiṃ karitvā paṭiladdhasamādhi vīmaṃsasamādhīti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni chandasamādhiādīni padāni bhājetvā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kathañca bhikkhū"
      },
      "tiādi āraddhaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chandañce bhikkhu adhipatiṃ karitvā"
      },
      "ti yadi bhikkhu chandaṃ adhipatiṃ chandaṃ jeṭṭhakaṃ chandaṃ dhuraṃ chandaṃ pubbaṅgamaṃ katvā samādhiṃ paṭilabhati nibbatteti, evaṃ nibbattito ayaṃ samādhi chandasamādhi nāma vuccatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vīriyañce"
      },
      "tiādīsupi ",
      " eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ime vuccanti padhānasaṅkhārā"
      },
      "ti ettāvatā chandiddhipādaṃ bhāvayamānassa bhikkhuno padhānābhisaṅkhārasaṅkhātacatukiccasādhakaṃ vīriyaṃ kathitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadekajjhaṃ abhisaññūhitvā"
      },
      "ti taṃ sabbaṃ ekato rāsiṃ katvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhyaṃ gacchatī"
      },
      "ti etaṃ vohāraṃ gacchatīti veditabbanti attho."
    ],
    "innerText": "Idāni chandasamādhiādīni padāni bhājetvā dassetuṃ kathañca bhikkhūtiādi āraddhaṃ. Tattha chandañce bhikkhu adhipatiṃ karitvāti yadi bhikkhu chandaṃ adhipatiṃ chandaṃ jeṭṭhakaṃ chandaṃ dhuraṃ chandaṃ pubbaṅgamaṃ katvā samādhiṃ paṭilabhati nibbatteti, evaṃ nibbattito ayaṃ samādhi chandasamādhi nāma vuccatīti attho. Vīriyañcetiādīsupi eseva nayo. Ime vuccanti padhānasaṅkhārāti ettāvatā chandiddhipādaṃ bhāvayamānassa bhikkhuno padhānābhisaṅkhārasaṅkhātacatukiccasādhakaṃ vīriyaṃ kathitaṃ. Tadekajjhaṃ abhisaññūhitvāti taṃ sabbaṃ ekato rāsiṃ katvāti attho. Saṅkhyaṃ gacchatīti etaṃ vohāraṃ gacchatīti veditabbanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "433"
      },
      ". Idāni ‘‘chandasamādhipadhānasaṅkhāro’’ti etasmiṃ padasamūhe chandādidhamme bhājetvā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha katamo chando"
      },
      "tiādi āraddhaṃ. Taṃ uttānatthameva."
    ],
    "innerText": "433. Idāni ‘‘chandasamādhipadhānasaṅkhāro’’ti etasmiṃ padasamūhe chandādidhamme bhājetvā dassetuṃ tattha katamo chandotiādi āraddhaṃ. Taṃ uttānatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upeto hotī"
      },
      "ti iddhipādasaṅkhāto dhammarāsi upeto hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesaṃ dhammāna"
      },
      "nti tesaṃ sampayuttānaṃ chandādidhammānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhi samiddhī"
      },
      "tiādīni sabbāni nipphattivevacanāneva. Evaṃ santepi ijjhanakaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iddhi"
      },
      ". Sampuṇṇā iddhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samiddhi;"
      },
      " upasaggena vā padaṃ vaḍḍhitaṃ. Ijjhanākāro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ijjhanā"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samijjhanā"
      },
      "ti upasaggena padaṃ vaḍḍhitaṃ. Attano santāne pātubhāvavasena labhanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lābho"
      },
      ". Parihīnānampi vīriyārambhavasena puna lābho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭilābho;"
      },
      " upasaggena vā padaṃ vaḍḍhitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pattī"
      },
      "ti adhigamo. Aparihānavasena sammā pattīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampatti. Phusanā"
      },
      "ti paṭilābhaphusanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacchikiriyā"
      },
      "ti ",
      " paṭilābhasacchikiriyāva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasampadā"
      },
      "ti paṭilābhaupasampadā evāti veditabbā."
    ],
    "innerText": "Upeto hotīti iddhipādasaṅkhāto dhammarāsi upeto hoti. Tesaṃ dhammānanti tesaṃ sampayuttānaṃ chandādidhammānaṃ. Iddhi samiddhītiādīni sabbāni nipphattivevacanāneva. Evaṃ santepi ijjhanakaṭṭhena iddhi. Sampuṇṇā iddhi samiddhi; upasaggena vā padaṃ vaḍḍhitaṃ. Ijjhanākāro ijjhanā. Samijjhanāti upasaggena padaṃ vaḍḍhitaṃ. Attano santāne pātubhāvavasena labhanaṃ lābho. Parihīnānampi vīriyārambhavasena puna lābho paṭilābho; upasaggena vā padaṃ vaḍḍhitaṃ. Pattīti adhigamo. Aparihānavasena sammā pattīti sampatti. Phusanāti paṭilābhaphusanā. Sacchikiriyāti paṭilābhasacchikiriyāva. Upasampadāti paṭilābhaupasampadā evāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tayābhūtassā"
      },
      "ti tena ākārena bhūtassa; te chandādidhamme paṭilabhitvā ṭhitassāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vedanākkhandho"
      },
      "tiādīhi chandādayo anto katvā cattāropi khandhā kathitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te dhamme"
      },
      "ti te cattāro arūpakkhandhe; chandādayo vā tayo dhammetipi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsevatī"
      },
      "tiādīni vuttatthāneva. Sesaiddhipādaniddesesupi imināva nayena attho veditabbo."
    ],
    "innerText": "Tayābhūtassāti tena ākārena bhūtassa; te chandādidhamme paṭilabhitvā ṭhitassāti attho. Vedanākkhandhotiādīhi chandādayo anto katvā cattāropi khandhā kathitā. Te dhammeti te cattāro arūpakkhandhe; chandādayo vā tayo dhammetipi vuttaṃ. Āsevatītiādīni vuttatthāneva. Sesaiddhipādaniddesesupi imināva nayena attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā ",
      " kiṃ kathitanti? Catunnaṃ bhikkhūnaṃ matthakappattaṃ kammaṭṭhānaṃ kathitaṃ. Eko hi bhikkhu chandaṃ avassayati; kattukamyatākusaladhammacchandena atthanipphattiyaṃ sati ‘ahaṃ lokuttaradhammaṃ nibbattessāmi, natthi mayhaṃ etassa nibbattane bhāro’ti chandaṃ jeṭṭhakaṃ chandaṃ dhuraṃ chandaṃ pubbaṅgamaṃ katvā lokuttaradhammaṃ nibbatteti. Eko vīriyaṃ avassayati. Eko cittaṃ, eko paññaṃ avassayati. Paññāya atthanipphattiyaṃ sati ‘ahaṃ lokuttaradhammaṃ nibbattessāmi ",
      ", natthi mayhaṃ etassa nibbattane bhāro’ti paññaṃ jeṭṭhakaṃ paññaṃ dhuraṃ paññaṃ pubbaṅgamaṃ katvā lokuttaradhammaṃ nibbatteti."
    ],
    "innerText": "Ettāvatā kiṃ kathitanti? Catunnaṃ bhikkhūnaṃ matthakappattaṃ kammaṭṭhānaṃ kathitaṃ. Eko hi bhikkhu chandaṃ avassayati; kattukamyatākusaladhammacchandena atthanipphattiyaṃ sati ‘ahaṃ lokuttaradhammaṃ nibbattessāmi, natthi mayhaṃ etassa nibbattane bhāro’ti chandaṃ jeṭṭhakaṃ chandaṃ dhuraṃ chandaṃ pubbaṅgamaṃ katvā lokuttaradhammaṃ nibbatteti. Eko vīriyaṃ avassayati. Eko cittaṃ, eko paññaṃ avassayati. Paññāya atthanipphattiyaṃ sati ‘ahaṃ lokuttaradhammaṃ nibbattessāmi , natthi mayhaṃ etassa nibbattane bhāro’ti paññaṃ jeṭṭhakaṃ paññaṃ dhuraṃ paññaṃ pubbaṅgamaṃ katvā lokuttaradhammaṃ nibbatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ? Yathā hi catūsu amaccaputtesu ṭhānantaraṃ patthetvā vicarantesu eko upaṭṭhānaṃ avassayi, eko sūrabhāvaṃ, eko jātiṃ, eko mantaṃ. Kathaṃ? Tesu hi paṭhamo ‘upaṭṭhāne appamādakāritāya atthanipphattiyā sati labbhamānaṃ lacchāmetaṃ ṭhānantara’nti upaṭṭhānaṃ avassayi. Dutiyo ‘upaṭṭhāne appamattopi ekacco saṅgāme paccupaṭṭhite saṇṭhātuṃ na sakkoti; avassaṃ kho pana rañño paccanto kuppissati; tasmiṃ kuppite rathadhure kammaṃ katvā rājānaṃ ārādhetvā āharāpessāmetaṃ ṭhānantara’nti sūrabhāvaṃ avassayi. Tatiyo ‘sūrabhāvepi sati ekacco hīnajātiko hoti; jātiṃ sodhetvā ṭhānantaraṃ dadantā mayhaṃ dassantī’ti jātiṃ avassayi. Catuttho ‘jātimāpi eko amantanīyo hoti; mantena kattabbakicce uppanne āharāpessāmetaṃ ṭhānantara’nti mantaṃ ",
      " avassayi. Te sabbepi attano attano avassayabalena ṭhānantarāni pāpuṇiṃsu."
    ],
    "innerText": "Kathaṃ? Yathā hi catūsu amaccaputtesu ṭhānantaraṃ patthetvā vicarantesu eko upaṭṭhānaṃ avassayi, eko sūrabhāvaṃ, eko jātiṃ, eko mantaṃ. Kathaṃ? Tesu hi paṭhamo ‘upaṭṭhāne appamādakāritāya atthanipphattiyā sati labbhamānaṃ lacchāmetaṃ ṭhānantara’nti upaṭṭhānaṃ avassayi. Dutiyo ‘upaṭṭhāne appamattopi ekacco saṅgāme paccupaṭṭhite saṇṭhātuṃ na sakkoti; avassaṃ kho pana rañño paccanto kuppissati; tasmiṃ kuppite rathadhure kammaṃ katvā rājānaṃ ārādhetvā āharāpessāmetaṃ ṭhānantara’nti sūrabhāvaṃ avassayi. Tatiyo ‘sūrabhāvepi sati ekacco hīnajātiko hoti; jātiṃ sodhetvā ṭhānantaraṃ dadantā mayhaṃ dassantī’ti jātiṃ avassayi. Catuttho ‘jātimāpi eko amantanīyo hoti; mantena kattabbakicce uppanne āharāpessāmetaṃ ṭhānantara’nti mantaṃ avassayi. Te sabbepi attano attano avassayabalena ṭhānantarāni pāpuṇiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha upaṭṭhāne appamatto hutvā ṭhānantaraṃ patto viya chandaṃ avassāya kattukamyatākusaladhammacchandena atthanibbattiyaṃ sati ‘ahaṃ lokuttaradhammaṃ nibbattessāmi, natthi mayhaṃ etassa nibbattane bhāro’ti chandaṃ jeṭṭhakaṃ chandaṃ dhuraṃ chandaṃ pubbaṅgamaṃ katvā lokuttaradhammanibbattako daṭṭhabbo, raṭṭhapālatthero (ma. ni. 2.293 ādayo) viya. So hi āyasmā chandaṃ dhuraṃ katvā lokuttaradhammaṃ nibbattesi. Sūrabhāvena rājānaṃ ārādhetvā ṭhānantaraṃ patto viya vīriyaṃ jeṭṭhakaṃ vīriyaṃ dhuraṃ vīriyaṃ pubbaṅgamaṃ katvā lokuttaradhammanibbattako daṭṭhabbo, soṇatthero (mahāva. 243) viya. So hi āyasmā vīriyaṃ dhuraṃ katvā lokuttaradhammaṃ nibbattesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Jātisampattiyā ",
      " ṭhānantaraṃ patto viya cittaṃ jeṭṭhakaṃ cittaṃ dhuraṃ cittaṃ pubbaṅgamaṃ katvā lokuttaradhammanibbattako daṭṭhabbo, sambhūtatthero viya. So hi āyasmā cittaṃ dhuraṃ katvā lokuttaradhammaṃ nibbattesi. Mantaṃ avassāya ṭhānantarappatto viya vīmaṃsaṃ jeṭṭhakaṃ vīmaṃsaṃ dhuraṃ vīmaṃsaṃ pubbaṅgamaṃ katvā ",
      " lokuttaradhammanibbattako daṭṭhabbo, thero mogharājā viya. So hi āyasmā vīmaṃsaṃ dhuraṃ katvā lokuttaradhammaṃ nibbattesi."
    ],
    "innerText": "Jātisampattiyā ṭhānantaraṃ patto viya cittaṃ jeṭṭhakaṃ cittaṃ dhuraṃ cittaṃ pubbaṅgamaṃ katvā lokuttaradhammanibbattako daṭṭhabbo, sambhūtatthero viya. So hi āyasmā cittaṃ dhuraṃ katvā lokuttaradhammaṃ nibbattesi. Mantaṃ avassāya ṭhānantarappatto viya vīmaṃsaṃ jeṭṭhakaṃ vīmaṃsaṃ dhuraṃ vīmaṃsaṃ pubbaṅgamaṃ katvā lokuttaradhammanibbattako daṭṭhabbo, thero mogharājā viya. So hi āyasmā vīmaṃsaṃ dhuraṃ katvā lokuttaradhammaṃ nibbattesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha ca tayo chandasamādhipadhānasaṅkhārasaṅkhātā dhammā iddhīpi honti iddhipādāpi. Sesā pana sampayuttakā cattāro khandhā iddhipādāyeva. Vīriyacittavīmaṃsasamādhipadhānasaṅkhārasaṅkhātāpi tayo dhammā iddhīpi honti iddhipādāpi. Sesā pana sampayuttakā cattāro khandhā iddhipādāyeva. Ayaṃ tāva abhedato kathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhedato pana ‘chando’ iddhi nāma. Chandadhurena bhāvitā cattāro khandhā chandiddhipādo nāma. Samādhi padhānasaṅkhāroti dve dhammā saṅkhārakkhandhavasena chandiddhipāde pavisanti; pāde paviṭṭhātipi vattuṃ vaṭṭatiyeva. Tattheva ‘samādhi’ iddhi nāma. Samādhidhurena bhāvitā cattāro khandhā samādhiddhipādo nāma. Chando ",
      " padhānasaṅkhāroti dve dhammā saṅkhārakkhandhavasena samādhiddhipāde pavisanti; pāde paviṭṭhātipi vattuṃ vaṭṭati eva. Tattheva ‘padhānasaṅkhāro’ iddhi nāma. Padhānasaṅkhārabhāvitā cattāro khandhā padhānasaṅkhāriddhipādo nāma. Chando samādhīti dve dhammā saṅkhārakkhandhavasena padhānasaṅkhāriddhipāde pavisanti; pāde paviṭṭhātipi vattuṃ vaṭṭati eva. Tattheva ‘vīriyaṃ’ iddhi nāma, ‘cittaṃ’ iddhi nāma, ‘vīmaṃsā’ iddhi nāma…pe… pāde paviṭṭhātipi vattuṃ vaṭṭati eva. Ayaṃ bhedato kathā nāma."
    ],
    "innerText": "Bhedato pana ‘chando’ iddhi nāma. Chandadhurena bhāvitā cattāro khandhā chandiddhipādo nāma. Samādhi padhānasaṅkhāroti dve dhammā saṅkhārakkhandhavasena chandiddhipāde pavisanti; pāde paviṭṭhātipi vattuṃ vaṭṭatiyeva. Tattheva ‘samādhi’ iddhi nāma. Samādhidhurena bhāvitā cattāro khandhā samādhiddhipādo nāma. Chando padhānasaṅkhāroti dve dhammā saṅkhārakkhandhavasena samādhiddhipāde pavisanti; pāde paviṭṭhātipi vattuṃ vaṭṭati eva. Tattheva ‘padhānasaṅkhāro’ iddhi nāma. Padhānasaṅkhārabhāvitā cattāro khandhā padhānasaṅkhāriddhipādo nāma. Chando samādhīti dve dhammā saṅkhārakkhandhavasena padhānasaṅkhāriddhipāde pavisanti; pāde paviṭṭhātipi vattuṃ vaṭṭati eva. Tattheva ‘vīriyaṃ’ iddhi nāma, ‘cittaṃ’ iddhi nāma, ‘vīmaṃsā’ iddhi nāma…pe… pāde paviṭṭhātipi vattuṃ vaṭṭati eva. Ayaṃ bhedato kathā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha pana abhinavaṃ natthi; gahitameva vibhūtadhātukaṃ kataṃ. Kathaṃ? Chando, samādhi, padhānasaṅkhāroti ime tayo dhammā iddhīpi honti iddhipādāpi. Sesā sampayuttakā cattāro khandhā iddhipādāyeva. Ime hi tayo dhammā ijjhamānā sampayuttakehi catūhi khandhehi saddhiṃyeva ijjhanti, na vinā. Sampayuttakā pana cattāro khandhā ijjhanakaṭṭhena iddhi nāma honti, patiṭṭhānaṭṭhena pādo nāma. ‘Iddhī’ti vā ‘iddhipādo’ti vā na aññassa kassaci adhivacanaṃ, sampayuttakānaṃ catunnaṃ khandhānaṃyeva adhivacanaṃ. Vīriyaṃ, cittaṃ, vīmaṃsāsamādhipadhānasaṅkhāroti tayo dhammā…pe… catunnaṃ khandhānaṃyeva adhivacanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica ",
      " pubbabhāgo pubbabhāgo iddhipādo nāma; paṭilābho paṭilābho iddhi nāmāti veditabbo. Ayamattho upacārena vā vipassanāya vā dīpetabbo. Paṭhamajjhānaparikammañhi iddhipādo nāma, paṭhamajjhānaṃ iddhi nāma. Dutiyatatiyacatutthaākāsānañcāyatana, viññāṇañcāyatanaākiñcaññāyatananevasaññānāsaññāyatanaparikammaṃ ",
      " iddhipādo nāma, nevasaññānāsaññāyatanaṃ iddhi nāma. Sotāpattimaggassa vipassanā iddhipādo nāma, sotāpattimaggo iddhi nāma. Sakadāgāmi, anāgāmi, arahattamaggassa vipassanā iddhipādo nāma, arahattamaggo iddhi nāma. Paṭilābhenāpi dīpetuṃ vaṭṭatiyeva. Paṭhamajjhānañhi iddhipādo nāma, dutiyajjhānaṃ iddhi nāma; dutiyajjhānaṃ iddhipādo nāma, tatiyajjhānaṃ iddhi nāma…pe… anāgāmimaggo iddhipādo nāma, arahattamaggo iddhi nāma."
    ],
    "innerText": "Apica pubbabhāgo pubbabhāgo iddhipādo nāma; paṭilābho paṭilābho iddhi nāmāti veditabbo. Ayamattho upacārena vā vipassanāya vā dīpetabbo. Paṭhamajjhānaparikammañhi iddhipādo nāma, paṭhamajjhānaṃ iddhi nāma. Dutiyatatiyacatutthaākāsānañcāyatana, viññāṇañcāyatanaākiñcaññāyatananevasaññānāsaññāyatanaparikammaṃ iddhipādo nāma, nevasaññānāsaññāyatanaṃ iddhi nāma. Sotāpattimaggassa vipassanā iddhipādo nāma, sotāpattimaggo iddhi nāma. Sakadāgāmi, anāgāmi, arahattamaggassa vipassanā iddhipādo nāma, arahattamaggo iddhi nāma. Paṭilābhenāpi dīpetuṃ vaṭṭatiyeva. Paṭhamajjhānañhi iddhipādo nāma, dutiyajjhānaṃ iddhi nāma; dutiyajjhānaṃ iddhipādo nāma, tatiyajjhānaṃ iddhi nāma…pe… anāgāmimaggo iddhipādo nāma, arahattamaggo iddhi nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kenaṭṭhena ",
      " iddhi? Kenaṭṭhena pādoti? Ijjhanakaṭṭheneva iddhi. Patiṭṭhānaṭṭheneva pādo. Evamidhāpi iddhīti vā pādoti vā na aññassa kassaci adhivacanaṃ, sampayuttakānaṃ catunnaṃ khandhānaṃyeva adhivacananti. Evaṃ vutte pana idamāhaṃsu – catunnaṃ khandhānameva adhivacanaṃ bhaveyya, yadi satthā parato uttaracūḷabhājanīyaṃ nāma na āhareyya. Uttaracūḷabhājanīye pana ‘‘chandoyeva chandiddhipādo, vīriyameva, cittameva, vīmaṃsāva vīmaṃsiddhipādo’’ti kathitaṃ. Keci pana ‘‘iddhi nāma anipphannā, iddhipādo nipphanno’’ti vadiṃsu. Tesaṃ vacanaṃ paṭikkhipitvā iddhīpi iddhipādopi ‘nipphanno tilakkhaṇabbhāhato’ti sanniṭṭhānaṃ kataṃ. Iti imasmiṃ suttantabhājanīye lokiyalokuttaramissakā iddhipādā kathitāti."
    ],
    "innerText": "Kenaṭṭhena iddhi? Kenaṭṭhena pādoti? Ijjhanakaṭṭheneva iddhi. Patiṭṭhānaṭṭheneva pādo. Evamidhāpi iddhīti vā pādoti vā na aññassa kassaci adhivacanaṃ, sampayuttakānaṃ catunnaṃ khandhānaṃyeva adhivacananti. Evaṃ vutte pana idamāhaṃsu – catunnaṃ khandhānameva adhivacanaṃ bhaveyya, yadi satthā parato uttaracūḷabhājanīyaṃ nāma na āhareyya. Uttaracūḷabhājanīye pana ‘‘chandoyeva chandiddhipādo, vīriyameva, cittameva, vīmaṃsāva vīmaṃsiddhipādo’’ti kathitaṃ. Keci pana ‘‘iddhi nāma anipphannā, iddhipādo nipphanno’’ti vadiṃsu. Tesaṃ vacanaṃ paṭikkhipitvā iddhīpi iddhipādopi ‘nipphanno tilakkhaṇabbhāhato’ti sanniṭṭhānaṃ kataṃ. Iti imasmiṃ suttantabhājanīye lokiyalokuttaramissakā iddhipādā kathitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Suttantabhājanīyavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Abhidhammabhājanīyavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "444"
      },
      ". Abhidhammabhājanīyaṃ uttānatthameva. Nayā panettha gaṇetabbā. ‘‘Chandasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāvetī’’ti vuttaṭṭhānasmiñhi lokuttarāni cattāri nayasahassāni vibhattāni. Vīriyasamādhiādīsupi eseva nayo. Tathā uttaracūḷabhājanīye chandiddhipāde ",
      " cattāri nayasahassāni vibhattāni, vīriyacittavīmaṃsiddhipāde cattāri cattārīti sabbānipi aṭṭhannaṃ catukkānaṃ vasena dvattiṃsa nayasahassāni vibhattāni. Evametaṃ nibbattitalokuttarānaṃyeva iddhipādānaṃ vasena dvattiṃsanayasahassappaṭimaṇḍitaṃ abhidhammabhājanīyaṃ kathitanti veditabbaṃ."
    ],
    "innerText": "444. Abhidhammabhājanīyaṃ uttānatthameva. Nayā panettha gaṇetabbā. ‘‘Chandasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāvetī’’ti vuttaṭṭhānasmiñhi lokuttarāni cattāri nayasahassāni vibhattāni. Vīriyasamādhiādīsupi eseva nayo. Tathā uttaracūḷabhājanīye chandiddhipāde cattāri nayasahassāni vibhattāni, vīriyacittavīmaṃsiddhipāde cattāri cattārīti sabbānipi aṭṭhannaṃ catukkānaṃ vasena dvattiṃsa nayasahassāni vibhattāni. Evametaṃ nibbattitalokuttarānaṃyeva iddhipādānaṃ vasena dvattiṃsanayasahassappaṭimaṇḍitaṃ abhidhammabhājanīyaṃ kathitanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Pañhāpucchakavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "462"
      },
      ". Pañhāpucchake ",
      " pāḷianusāreneva iddhipādānaṃ kusalādibhāvo veditabbo. Ārammaṇattikesu pana sabbepete appamāṇaṃ nibbānaṃ ārabbha pavattito appamāṇārammaṇā eva, na maggārammaṇā; sahajātahetuvasena pana maggahetukā, na maggādhipatino. Cattāro hi adhipatayo aññamaññaṃ garuṃ na karonti. Kasmā? Sayaṃ jeṭṭhakattā. Yathā hi samajātikā samavayā samathāmā samasippā cattāro rājaputtā attano attano jeṭṭhakatāya aññamaññassa ",
      " apacitiṃ na karonti, evamimepi cattāro adhipatayo pāṭiyekkaṃ pāṭiyekkaṃ jeṭṭhakadhammatāya aññamaññaṃ garuṃ na karontīti ekanteneva na maggādhipatino. Atītādīsu ekārammaṇabhāvepi na vattabbā. Nibbānassa pana bahiddhādhammattā bahiddhārammaṇā nāma hontīti. Evametasmiṃ pañhāpucchake nibbattitalokuttarāva iddhipādā kathitā. Sammāsambuddhena hi suttantabhājanīyasmiṃyeva lokiyalokuttaramissakā iddhipādā kathitā, abhidhammabhājanīyapañhāpucchakesu pana lokuttarāyevāti. Evamayaṃ iddhipādavibhaṅgopi teparivaṭṭaṃ nīharitvāva dassitoti."
    ],
    "innerText": "462. Pañhāpucchake pāḷianusāreneva iddhipādānaṃ kusalādibhāvo veditabbo. Ārammaṇattikesu pana sabbepete appamāṇaṃ nibbānaṃ ārabbha pavattito appamāṇārammaṇā eva, na maggārammaṇā; sahajātahetuvasena pana maggahetukā, na maggādhipatino. Cattāro hi adhipatayo aññamaññaṃ garuṃ na karonti. Kasmā? Sayaṃ jeṭṭhakattā. Yathā hi samajātikā samavayā samathāmā samasippā cattāro rājaputtā attano attano jeṭṭhakatāya aññamaññassa apacitiṃ na karonti, evamimepi cattāro adhipatayo pāṭiyekkaṃ pāṭiyekkaṃ jeṭṭhakadhammatāya aññamaññaṃ garuṃ na karontīti ekanteneva na maggādhipatino. Atītādīsu ekārammaṇabhāvepi na vattabbā. Nibbānassa pana bahiddhādhammattā bahiddhārammaṇā nāma hontīti. Evametasmiṃ pañhāpucchake nibbattitalokuttarāva iddhipādā kathitā. Sammāsambuddhena hi suttantabhājanīyasmiṃyeva lokiyalokuttaramissakā iddhipādā kathitā, abhidhammabhājanīyapañhāpucchakesu pana lokuttarāyevāti. Evamayaṃ iddhipādavibhaṅgopi teparivaṭṭaṃ nīharitvāva dassitoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sammohavinodaniyā vibhaṅgaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iddhipādavibhaṅgavaṇṇanā niṭṭhitā."
  }
]