[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "15. Paṭisambhidāvibhaṅgo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Suttantabhājanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Saṅgahavāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "718"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eseva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nayo"
      },
      "ti saṅkhepena dassetvā tameva nayaṃ vitthārato dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dhammappabhedassa hī’’"
      },
      "tiādimāha. Niruttipaṭibhānappabhedā tabbisayānaṃ atthādīnaṃ paccayuppannādibhedehi bhinditvā veditabbā."
    ],
    "innerText": "718.Esevanayoti saṅkhepena dassetvā tameva nayaṃ vitthārato dassetuṃ ‘‘dhammappabhedassa hī’’tiādimāha. Niruttipaṭibhānappabhedā tabbisayānaṃ atthādīnaṃ paccayuppannādibhedehi bhinditvā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Yaṃ kiñci paccayasamuppanna’’"
      },
      "nti etena saccahetudhammapaccayākāravāresu āgatāni dukkhādīni gahitāni. Saccapaccayākāravāresu nibbānaṃ, pariyattivāre bhāsitattho, abhidhammabhājanīye vipāko kiriyañcāti evaṃ pāḷiyaṃ vuttānameva vasena pañca atthā veditabbā, tathā dhammā ca."
    ],
    "innerText": "‘‘Yaṃ kiñci paccayasamuppanna’’nti etena saccahetudhammapaccayākāravāresu āgatāni dukkhādīni gahitāni. Saccapaccayākāravāresu nibbānaṃ, pariyattivāre bhāsitattho, abhidhammabhājanīye vipāko kiriyañcāti evaṃ pāḷiyaṃ vuttānameva vasena pañca atthā veditabbā, tathā dhammā ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vidahatī"
      },
      "ti nibbattakahetuādīnaṃ sādhāraṇaṃ nibbacanaṃ, tadatthaṃ pana vibhāvetumāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pavatteti ceva pāpeti cā’’"
      },
      "ti. Tesu purimo attho maggavajjesu daṭṭhabbo. Bhāsitampi hi avabodhanavasena atthaṃ pavattetīti. Maggo pana nibbānaṃ pāpetīti tasmiṃ pacchimo."
    ],
    "innerText": "Vidahatīti nibbattakahetuādīnaṃ sādhāraṇaṃ nibbacanaṃ, tadatthaṃ pana vibhāvetumāha ‘‘pavatteti ceva pāpeti cā’’ti. Tesu purimo attho maggavajjesu daṭṭhabbo. Bhāsitampi hi avabodhanavasena atthaṃ pavattetīti. Maggo pana nibbānaṃ pāpetīti tasmiṃ pacchimo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammaniruttābhilāpe"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhamma"
      },
      "-saddo sabhāvavācakoti katvā āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yā sabhāvaniruttī’’"
      },
      "ti, aviparītaniruttīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā abhilāpe"
      },
      "ti tassā niruttiyā avacanabhūtāya paññattiyā abhilāpeti keci vaṇṇayanti. Evaṃ sati paññatti abhilapitabbā ",
      ", na vacananti āpajjati, na ca vacanato aññaṃ abhilapitabbaṃ uccāretabbaṃ atthi, athāpi phassādivacanehi bodhetabbaṃ abhilapitabbaṃ siyā, evaṃ sati atthadhammavajjaṃ tehi bodhetabbaṃ na vijjatīti tesaṃ niruttibhāvo āpajjati. ‘‘Phassoti ca sabhāvanirutti, phassaṃ phassāti na sabhāvaniruttī’’ti dassitovāyamattho, na ca avacanaṃ evaṃpakāraṃ atthi, tasmā vacanabhūtāya eva tassā sabhāvaniruttiyā abhilāpe uccāraṇeti attho daṭṭhabbo."
    ],
    "innerText": "Dhammaniruttābhilāpeti ettha dhamma-saddo sabhāvavācakoti katvā āha ‘‘yā sabhāvaniruttī’’ti, aviparītaniruttīti attho. Tassā abhilāpeti tassā niruttiyā avacanabhūtāya paññattiyā abhilāpeti keci vaṇṇayanti. Evaṃ sati paññatti abhilapitabbā , na vacananti āpajjati, na ca vacanato aññaṃ abhilapitabbaṃ uccāretabbaṃ atthi, athāpi phassādivacanehi bodhetabbaṃ abhilapitabbaṃ siyā, evaṃ sati atthadhammavajjaṃ tehi bodhetabbaṃ na vijjatīti tesaṃ niruttibhāvo āpajjati. ‘‘Phassoti ca sabhāvanirutti, phassaṃ phassāti na sabhāvaniruttī’’ti dassitovāyamattho, na ca avacanaṃ evaṃpakāraṃ atthi, tasmā vacanabhūtāya eva tassā sabhāvaniruttiyā abhilāpe uccāraṇeti attho daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ sabhāvaniruttiṃ saddaṃ ārammaṇaṃ katvā paccavekkhantassa tasmiṃ sabhāvaniruttābhilāpe pabhedagataṃ ñāṇaṃ niruttipaṭisambhidā"
      },
      "ti vuttattā niruttisaddārammaṇāya sotaviññāṇavīthiyā parato manodvāre niruttipaṭisambhidā ",
      " pavattatīti vadanti. ‘‘Niruttipaṭisambhidā paccuppannārammaṇā’’ti ca vacanaṃ saddaṃ gahetvā pacchā jānanaṃ sandhāya vuttanti. Evaṃ pana aññasmiṃ paccuppannārammaṇe aññaṃ paccuppannārammaṇanti vuttanti āpajjati. Yathā pana dibbasotañāṇaṃ manussāmanussādisaddappabhedanicchayassa paccayabhūtaṃ taṃ taṃ saddavibhāvakaṃ, evaṃ sabhāvāsabhāvaniruttinicchayassa paccayabhūtaṃ paccuppannasabhāvaniruttisaddārammaṇaṃ taṃvibhāvakañāṇaṃ niruttipaṭisambhidāti vuccamāne na pāḷivirodho hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ sabhāvaniruttiṃ saddaṃ ārammaṇaṃ katvā paccavekkhantassā"
      },
      "ti ca paccuppannasaddārammaṇaṃ paccavekkhaṇaṃ pavattayantassāti na na sakkā vattuṃ. Tampi hi ñāṇaṃ sabhāvaniruttiṃ vibhāventaṃyeva taṃtaṃsaddapaccavekkhaṇānantaraṃ taṃtaṃpabhedanicchayahetuttā niruttiṃ bhindantaṃ paṭivijjhantameva uppajjatīti ca pabhedagatampi hotīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabhāvaniruttī"
      },
      "ti māgadhabhāsā adhippetāti tato aññaṃ sakkaṭanāmādisaddaṃ sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘aññaṃ panā’’"
      },
      "ti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Byañjana"
      },
      "nti nipātapadamāha."
    ],
    "innerText": "Taṃ sabhāvaniruttiṃ saddaṃ ārammaṇaṃ katvā paccavekkhantassa tasmiṃ sabhāvaniruttābhilāpe pabhedagataṃ ñāṇaṃ niruttipaṭisambhidāti vuttattā niruttisaddārammaṇāya sotaviññāṇavīthiyā parato manodvāre niruttipaṭisambhidā pavattatīti vadanti. ‘‘Niruttipaṭisambhidā paccuppannārammaṇā’’ti ca vacanaṃ saddaṃ gahetvā pacchā jānanaṃ sandhāya vuttanti. Evaṃ pana aññasmiṃ paccuppannārammaṇe aññaṃ paccuppannārammaṇanti vuttanti āpajjati. Yathā pana dibbasotañāṇaṃ manussāmanussādisaddappabhedanicchayassa paccayabhūtaṃ taṃ taṃ saddavibhāvakaṃ, evaṃ sabhāvāsabhāvaniruttinicchayassa paccayabhūtaṃ paccuppannasabhāvaniruttisaddārammaṇaṃ taṃvibhāvakañāṇaṃ niruttipaṭisambhidāti vuccamāne na pāḷivirodho hoti. Taṃ sabhāvaniruttiṃ saddaṃ ārammaṇaṃ katvā paccavekkhantassāti ca paccuppannasaddārammaṇaṃ paccavekkhaṇaṃ pavattayantassāti na na sakkā vattuṃ. Tampi hi ñāṇaṃ sabhāvaniruttiṃ vibhāventaṃyeva taṃtaṃsaddapaccavekkhaṇānantaraṃ taṃtaṃpabhedanicchayahetuttā niruttiṃ bhindantaṃ paṭivijjhantameva uppajjatīti ca pabhedagatampi hotīti. Sabhāvaniruttīti māgadhabhāsā adhippetāti tato aññaṃ sakkaṭanāmādisaddaṃ sandhāya ‘‘aññaṃ panā’’ti āha. Byañjananti nipātapadamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathitaṃ"
      },
      " aṭṭhakathāyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bodhimaṇḍa"
      },
      "-saddo paṭhamābhisambuddhaṭṭhāne eva daṭṭhabbo, na yattha katthaci bodhirukkhassa patiṭṭhitaṭṭhāne. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvaṇṇasalāka"
      },
      "nti seṭṭhasalākaṃ, dhammadesanatthaṃ salākaṃ gahetvāti attho, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na paṭisambhidāyaṃ ṭhitena"
      },
      " pavāritaṃ, tasmā paṭisambhidāto aññeneva pakārena jānitabbato na sakkaṭabhāsājānanaṃ paṭisambhidākiccanti adhippāyo."
    ],
    "innerText": "Kathitaṃ aṭṭhakathāyaṃ. Bodhimaṇḍa-saddo paṭhamābhisambuddhaṭṭhāne eva daṭṭhabbo, na yattha katthaci bodhirukkhassa patiṭṭhitaṭṭhāne. Suvaṇṇasalākanti seṭṭhasalākaṃ, dhammadesanatthaṃ salākaṃ gahetvāti attho, na paṭisambhidāyaṃ ṭhitena pavāritaṃ, tasmā paṭisambhidāto aññeneva pakārena jānitabbato na sakkaṭabhāsājānanaṃ paṭisambhidākiccanti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idaṃ kathita"
      },
      "nti māgadhabhāsāya sabhāvaniruttitāñāpanatthaṃ idaṃ idāni vattabbaṃ kathitanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chaddantavāraṇa"
      },
      " (jā. 1.16.97 ādayo) -",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tittirajātakā"
      },
      "dīsu (jā. 1.4.73 ādayo) tiracchānesu ca māgadhabhāsā ussannā, na oṭṭakādibhāsā sakkaṭaṃ vā."
    ],
    "innerText": "Idaṃ kathitanti māgadhabhāsāya sabhāvaniruttitāñāpanatthaṃ idaṃ idāni vattabbaṃ kathitanti attho. Chaddantavāraṇa (jā. 1.16.97 ādayo) -tittirajātakādīsu (jā. 1.4.73 ādayo) tiracchānesu ca māgadhabhāsā ussannā, na oṭṭakādibhāsā sakkaṭaṃ vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti ",
      " māgadhasesabhāsāsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sesā parivattanti"
      },
      " ekantena kālantare aññathā honti vinassanti ca. Māgadhā pana katthaci kadāci parivattantīpi na sabbattha sabbadā sabbathā ca parivattati, kappavināsepi tiṭṭhatiyevāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ayamevekā na parivattatī’’"
      },
      "ti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Papañco"
      },
      "ti cirāyananti attho. Buddhavacanameva cetassa visayo, teneva ‘‘nelaṅgo setapacchādo’’ti gāthaṃ pucchito citto gahapati ‘‘‘kiṃ nu kho etaṃ, bhante, bhagavatā bhāsita’nti? ‘Evaṃ gahapatī’ti. ‘Tena hi, bhante, muhuttaṃ āgametha, yāvassa atthaṃ pekkhāmī’’’ti (saṃ. ni. 4.347) āhāti vadanti."
    ],
    "innerText": "Tatthāti māgadhasesabhāsāsu. Sesā parivattanti ekantena kālantare aññathā honti vinassanti ca. Māgadhā pana katthaci kadāci parivattantīpi na sabbattha sabbadā sabbathā ca parivattati, kappavināsepi tiṭṭhatiyevāti ‘‘ayamevekā na parivattatī’’ti āha. Papañcoti cirāyananti attho. Buddhavacanameva cetassa visayo, teneva ‘‘nelaṅgo setapacchādo’’ti gāthaṃ pucchito citto gahapati ‘‘‘kiṃ nu kho etaṃ, bhante, bhagavatā bhāsita’nti? ‘Evaṃ gahapatī’ti. ‘Tena hi, bhante, muhuttaṃ āgametha, yāvassa atthaṃ pekkhāmī’’’ti (saṃ. ni. 4.347) āhāti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbatthakañāṇa"
      },
      "nti ",
      " atthādīsu ñāṇaṃ. Tañhi sabbesu tesu tīsu catūsupi vā pavattattā, kusalakiriyabhūtāya paṭibhānapaṭisambhidāya dhammatthabhāvato tīsu eva vā pavattattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sabbatthakañāṇa’’"
      },
      "nti vuttaṃ. Imāni ñāṇāni idamatthajotakānīti sātthakānaṃ paccavekkhitabbattā sabbo attho etassātipi sabbatthakaṃ, sabbasmiṃ khittanti vā. Sekkhe pavattā arahattappattiyā visadā hontīti vadanti. Pubbayogo viya pana arahattappatti arahatopi paṭisambhidāvisadatāya paccayo na na hotīti pañcannampi yathāyogaṃ sekkhāsekkhapaṭisambhidāvisadattakāraṇatā yojetabbā."
    ],
    "innerText": "Sabbatthakañāṇanti atthādīsu ñāṇaṃ. Tañhi sabbesu tesu tīsu catūsupi vā pavattattā, kusalakiriyabhūtāya paṭibhānapaṭisambhidāya dhammatthabhāvato tīsu eva vā pavattattā ‘‘sabbatthakañāṇa’’nti vuttaṃ. Imāni ñāṇāni idamatthajotakānīti sātthakānaṃ paccavekkhitabbattā sabbo attho etassātipi sabbatthakaṃ, sabbasmiṃ khittanti vā. Sekkhe pavattā arahattappattiyā visadā hontīti vadanti. Pubbayogo viya pana arahattappatti arahatopi paṭisambhidāvisadatāya paccayo na na hotīti pañcannampi yathāyogaṃ sekkhāsekkhapaṭisambhidāvisadattakāraṇatā yojetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pucchāya parato pavattā kathāti katvā aṭṭhakathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paripucchā’’"
      },
      "ti vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭipattiṃ pūretabbaṃ maññissantī"
      },
      "ti paṭipattigarutāya lābhaṃ hīḷentena satasahassagghanakampi kambalaṃ vāsiyā koṭṭetvā paribhaṇḍakaraṇaṃ mayā kataṃ āvajjitvā lābhagaruno pariyattidharā dhammakathikāva bhavituṃ na maññissantīti vuttaṃ hoti. Ettha ca therassa kaṅkhuppattiyā pubbe avisadataṃ dassetvā arahattappattassa pañhavissajjanena arahattappattiyā visadatā dassitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tissatthero"
      },
      " anantaraṃ vutto tissatthero evāti vadanti."
    ],
    "innerText": "Pucchāya parato pavattā kathāti katvā aṭṭhakathā ‘‘paripucchā’’ti vuttā. Paṭipattiṃ pūretabbaṃ maññissantīti paṭipattigarutāya lābhaṃ hīḷentena satasahassagghanakampi kambalaṃ vāsiyā koṭṭetvā paribhaṇḍakaraṇaṃ mayā kataṃ āvajjitvā lābhagaruno pariyattidharā dhammakathikāva bhavituṃ na maññissantīti vuttaṃ hoti. Ettha ca therassa kaṅkhuppattiyā pubbe avisadataṃ dassetvā arahattappattassa pañhavissajjanena arahattappattiyā visadatā dassitā. Tissatthero anantaraṃ vutto tissatthero evāti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhedo"
      },
      " nāma maggehi adhigatānaṃ paṭisambhidānaṃ pabhedagamanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhigamo"
      },
      " tehi paṭilābho, tasmā so lokuttaro, pabhedo kāmāvacaro daṭṭhabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na pana tathā"
      },
      "ti yathā adhigamassa balavapaccayo hoti, na tathā pabhedassāti attho. Idāni pariyattiyādīnaṃ adhigamassa balavapaccayattābhāvaṃ, pubbayogassa ca balavapaccayattaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pariyattisavanaparipucchā hī’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisambhidā nāma natthī"
      },
      "ti paṭisambhidādhigamo natthīti adhippāyo. Idāni ",
      " yaṃ vuttaṃ hoti, taṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ime panā’’"
      },
      "tiādimāha. Pubbayogādhigamā hi dvepi visadakāraṇāti ‘‘pubbayogo pabhedassa balavapaccayo hotī’’ti vuttanti."
    ],
    "innerText": "Pabhedo nāma maggehi adhigatānaṃ paṭisambhidānaṃ pabhedagamanaṃ. Adhigamo tehi paṭilābho, tasmā so lokuttaro, pabhedo kāmāvacaro daṭṭhabbo. Na pana tathāti yathā adhigamassa balavapaccayo hoti, na tathā pabhedassāti attho. Idāni pariyattiyādīnaṃ adhigamassa balavapaccayattābhāvaṃ, pubbayogassa ca balavapaccayattaṃ dassento ‘‘pariyattisavanaparipucchā hī’’tiādimāha. Tattha paṭisambhidā nāma natthīti paṭisambhidādhigamo natthīti adhippāyo. Idāni yaṃ vuttaṃ hoti, taṃ dassento ‘‘ime panā’’tiādimāha. Pubbayogādhigamā hi dvepi visadakāraṇāti ‘‘pubbayogo pabhedassa balavapaccayo hotī’’ti vuttanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṅgahavāravaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Saccavārādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "719"
      },
      ". Hetuvāre ",
      " kālattayepi hetuphaladhammā ‘‘atthā’’ti vuttā, tesañca hetudhammā ‘‘dhammā’’ti, dhammavāre veneyyavasena atītānañca saṅgahitattā ‘‘uppannā samuppannā’’tiādi na vuttanti atītapaccuppannā ‘‘atthā’’ti vuttā, taṃnibbattakā ca ‘‘dhammā’’ti idametesaṃ dvinnampi vārānaṃ nānattaṃ."
    ],
    "innerText": "719. Hetuvāre kālattayepi hetuphaladhammā ‘‘atthā’’ti vuttā, tesañca hetudhammā ‘‘dhammā’’ti, dhammavāre veneyyavasena atītānañca saṅgahitattā ‘‘uppannā samuppannā’’tiādi na vuttanti atītapaccuppannā ‘‘atthā’’ti vuttā, taṃnibbattakā ca ‘‘dhammā’’ti idametesaṃ dvinnampi vārānaṃ nānattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saccavārādivaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Suttantabhājanīyavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Abhidhammabhājanīyavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "725"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avuttattā"
      },
      "ti ‘‘tesaṃ vipāke ñāṇa’’nti sāmaññena vatvā visesena avuttattāti adhippāyo. Ettha ca kiriyānaṃ avipākattā dhammabhāvo na vuttoti. Yadi evaṃ vipākā na hontīti atthabhāvo ca na vattabboti? Na, paccayuppannattā. Evañce kusalākusalānampi atthabhāvo āpajjatīti. Nappaṭisiddho, vipākassa pana padhānahetutāya pākaṭattā dhammabhāvova tesaṃ vutto. Kiriyānaṃ paccayattā dhammabhāvo āpajjatīti ce? Nāyaṃ doso appaṭisiddhattā, kammaphalasambandhassa pana ahetuttā dhammabhāvo na vutto. Apica ‘‘ayaṃ imassa paccayo, idaṃ paccayuppanna’’nti evaṃ bhedaṃ akatvā kevalaṃ kusalākusale vipākakiriyadhamme ca sabhāvato paccavekkhantassa dhammapaṭisambhidā atthapaṭisambhidā ca hotītipi tesaṃ atthadhammatā na vuttāti veditabbā ",
      ". Kusalākusalavāresu ca dhammapaṭisambhidā kusalākusalānaṃ paccayabhāvaṃ sattivisesaṃ sanipphādetabbataṃ passantī nipphādetabbāpekkhā hotīti taṃsambandheneva ‘‘tesaṃ vipāke ñāṇaṃ atthapaṭisambhidā’’ti vuttaṃ. Sabhāvadassanamattameva pana atthapaṭisambhidāya kiccaṃ nipphannaphalamattadassanatoti tassā nipphādakānapekkhattā vipākavāre ‘‘tesaṃ vipaccanake ñāṇaṃ dhammapaṭisambhidā’’ti na vuttanti veditabbaṃ."
    ],
    "innerText": "725.Avuttattāti ‘‘tesaṃ vipāke ñāṇa’’nti sāmaññena vatvā visesena avuttattāti adhippāyo. Ettha ca kiriyānaṃ avipākattā dhammabhāvo na vuttoti. Yadi evaṃ vipākā na hontīti atthabhāvo ca na vattabboti? Na, paccayuppannattā. Evañce kusalākusalānampi atthabhāvo āpajjatīti. Nappaṭisiddho, vipākassa pana padhānahetutāya pākaṭattā dhammabhāvova tesaṃ vutto. Kiriyānaṃ paccayattā dhammabhāvo āpajjatīti ce? Nāyaṃ doso appaṭisiddhattā, kammaphalasambandhassa pana ahetuttā dhammabhāvo na vutto. Apica ‘‘ayaṃ imassa paccayo, idaṃ paccayuppanna’’nti evaṃ bhedaṃ akatvā kevalaṃ kusalākusale vipākakiriyadhamme ca sabhāvato paccavekkhantassa dhammapaṭisambhidā atthapaṭisambhidā ca hotītipi tesaṃ atthadhammatā na vuttāti veditabbā . Kusalākusalavāresu ca dhammapaṭisambhidā kusalākusalānaṃ paccayabhāvaṃ sattivisesaṃ sanipphādetabbataṃ passantī nipphādetabbāpekkhā hotīti taṃsambandheneva ‘‘tesaṃ vipāke ñāṇaṃ atthapaṭisambhidā’’ti vuttaṃ. Sabhāvadassanamattameva pana atthapaṭisambhidāya kiccaṃ nipphannaphalamattadassanatoti tassā nipphādakānapekkhattā vipākavāre ‘‘tesaṃ vipaccanake ñāṇaṃ dhammapaṭisambhidā’’ti na vuttanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabhāvapaññattiyā"
      },
      "ti na sattādipaññattiyā, aviparītapaññattiyā vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khobhetvā"
      },
      "ti lomahaṃsajananasādhukāradānādīhi khobhetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puna dhammassavane"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jānissathā"
      },
      "ti appassutattā dutiyavāraṃ kathento tadeva kathessatīti adhippāyo."
    ],
    "innerText": "Sabhāvapaññattiyāti na sattādipaññattiyā, aviparītapaññattiyā vā. Khobhetvāti lomahaṃsajananasādhukāradānādīhi khobhetvā. Puna dhammassavanejānissathāti appassutattā dutiyavāraṃ kathento tadeva kathessatīti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "746"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūmidassanattha"
      },
      "nti ettha kāmāvacarā lokuttarā ca bhūmi ‘‘bhūmī’’ti veditabbā, cittuppādā vāti."
    ],
    "innerText": "746.Bhūmidassanatthanti ettha kāmāvacarā lokuttarā ca bhūmi ‘‘bhūmī’’ti veditabbā, cittuppādā vāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhidhammabhājanīyavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Pañhapucchakavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "747"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccayasamuppannañca atthaṃ paccayadhammañcā"
      },
      "ti vacanehi hetādipaccayasamuppannānaṃ kusalākusalarūpānampi atthapariyāyaṃ, hetādipaccayabhūtānaṃ vipākakiriyarūpānampi dhammapariyāyañca dasseti. Paṭibhānapaṭisambhidāya kāmāvacaravipākārammaṇatā mahaggatārammaṇatā ca paṭisambhidāñāṇārammaṇatte na yujjati paṭisambhidāñāṇānaṃ kāmāvacaralokuttarakusalesu kāmāvacarakiriyālokuttaravipākesu ca uppattito. Sabbañāṇārammaṇatāya sati yujjeyya, ‘‘yena ñāṇena tāni ñāṇāni jānātī’’ti (vibha. 726) vacanato pana na sabbañāṇārammaṇatāti kathayanti. Suttantabhājanīye pana ‘‘ñāṇesu ñāṇaṃ paṭibhānapaṭisambhidā’’ti avisesena vuttattā sabbañāṇārammaṇatā siyā. Abhidhammabhājanīyepi cittuppādavasena kathanaṃ niravasesakathananti yathādassitavisayavacanavasena ‘‘yena ñāṇena tāni ñāṇāni ",
      " jānātī’’ti yaṃ vuttaṃ, taṃ aññārammaṇataṃ na paṭisedhetīti. Yathā ca atthapaṭisambhidāvisayānaṃ na niravasesena kathanaṃ abhidhammabhājanīye, evaṃ paṭibhānapaṭisambhidāvisayassapīti. Evaṃ paṭibhānapaṭisambhidāya sabbañāṇavisayattā ‘‘tisso paṭisambhidā siyā parittārammaṇā siyā mahaggatārammaṇā siyā appamāṇārammaṇā’’ti (vibha. 749) vuttā."
    ],
    "innerText": "747.Paccayasamuppannañca atthaṃ paccayadhammañcāti vacanehi hetādipaccayasamuppannānaṃ kusalākusalarūpānampi atthapariyāyaṃ, hetādipaccayabhūtānaṃ vipākakiriyarūpānampi dhammapariyāyañca dasseti. Paṭibhānapaṭisambhidāya kāmāvacaravipākārammaṇatā mahaggatārammaṇatā ca paṭisambhidāñāṇārammaṇatte na yujjati paṭisambhidāñāṇānaṃ kāmāvacaralokuttarakusalesu kāmāvacarakiriyālokuttaravipākesu ca uppattito. Sabbañāṇārammaṇatāya sati yujjeyya, ‘‘yena ñāṇena tāni ñāṇāni jānātī’’ti (vibha. 726) vacanato pana na sabbañāṇārammaṇatāti kathayanti. Suttantabhājanīye pana ‘‘ñāṇesu ñāṇaṃ paṭibhānapaṭisambhidā’’ti avisesena vuttattā sabbañāṇārammaṇatā siyā. Abhidhammabhājanīyepi cittuppādavasena kathanaṃ niravasesakathananti yathādassitavisayavacanavasena ‘‘yena ñāṇena tāni ñāṇāni jānātī’’ti yaṃ vuttaṃ, taṃ aññārammaṇataṃ na paṭisedhetīti. Yathā ca atthapaṭisambhidāvisayānaṃ na niravasesena kathanaṃ abhidhammabhājanīye, evaṃ paṭibhānapaṭisambhidāvisayassapīti. Evaṃ paṭibhānapaṭisambhidāya sabbañāṇavisayattā ‘‘tisso paṭisambhidā siyā parittārammaṇā siyā mahaggatārammaṇā siyā appamāṇārammaṇā’’ti (vibha. 749) vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadipi ‘‘siyā atthapaṭisambhidā na maggārammaṇā’’ti (vibha. 749) vacanato abhidhammabhājanīye vuttapaṭisambhidāsveva pañhapucchakanayo pavatto. Na hi maggo paccayuppanno na hoti, abhidhammabhājanīye ca paṭisambhidāñāṇavisayā eva paṭibhānapaṭisambhidā vuttāti na tassā mahaggatārammaṇatāti. Evamapi dvepi etā pāḷiyo virujjhanti, tāsu balavatarāya ṭhatvā ",
      " itarāya adhippāyo maggitabbo. Kusalākusalānaṃ pana paccayuppannattapaṭivedhopi kusalākusalabhāvapaṭivedhavinimutto natthīti nippariyāyā tattha dhammapaṭisambhidā ekantadhammavisayattā, tathā vipākakiriyānaṃ paccayabhāvapaṭivedhopi vipākakiriyabhāvapaṭivedhavinimutto natthīti nippariyāyā tattha atthapaṭisambhidā ekantikaatthavisayattā. Kiñci pana ñāṇaṃ appaṭibhānabhūtaṃ natthi ñeyyappakāsanatoti sabbasmimpi ñāṇe nippariyāyā paṭibhānapaṭisambhidā bhavituṃ arahati. Nippariyāyapaṭisambhidāsu pañhapucchakassa pavattiyaṃ dvepi pāḷiyo na virujjhanti."
    ],
    "innerText": "Yadipi ‘‘siyā atthapaṭisambhidā na maggārammaṇā’’ti (vibha. 749) vacanato abhidhammabhājanīye vuttapaṭisambhidāsveva pañhapucchakanayo pavatto. Na hi maggo paccayuppanno na hoti, abhidhammabhājanīye ca paṭisambhidāñāṇavisayā eva paṭibhānapaṭisambhidā vuttāti na tassā mahaggatārammaṇatāti. Evamapi dvepi etā pāḷiyo virujjhanti, tāsu balavatarāya ṭhatvā itarāya adhippāyo maggitabbo. Kusalākusalānaṃ pana paccayuppannattapaṭivedhopi kusalākusalabhāvapaṭivedhavinimutto natthīti nippariyāyā tattha dhammapaṭisambhidā ekantadhammavisayattā, tathā vipākakiriyānaṃ paccayabhāvapaṭivedhopi vipākakiriyabhāvapaṭivedhavinimutto natthīti nippariyāyā tattha atthapaṭisambhidā ekantikaatthavisayattā. Kiñci pana ñāṇaṃ appaṭibhānabhūtaṃ natthi ñeyyappakāsanatoti sabbasmimpi ñāṇe nippariyāyā paṭibhānapaṭisambhidā bhavituṃ arahati. Nippariyāyapaṭisambhidāsu pañhapucchakassa pavattiyaṃ dvepi pāḷiyo na virujjhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddārammaṇattā bahiddhārammaṇā"
      },
      "ti ettha parassa abhilāpasaddārammaṇattāti bhavitabbaṃ. Na hi saddārammaṇatā bahiddhārammaṇatāya kāraṇaṃ saddassa ajjhattassa ca sabbhāvāti. Anuvattamāno ca so eva saddoti visesanaṃ na katanti daṭṭhabbaṃ."
    ],
    "innerText": "Saddārammaṇattā bahiddhārammaṇāti ettha parassa abhilāpasaddārammaṇattāti bhavitabbaṃ. Na hi saddārammaṇatā bahiddhārammaṇatāya kāraṇaṃ saddassa ajjhattassa ca sabbhāvāti. Anuvattamāno ca so eva saddoti visesanaṃ na katanti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañhapucchakavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭisambhidāvibhaṅgavaṇṇanā niṭṭhitā."
  }
]