[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Āyatanavibhaṅgo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Suttantabhājanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "154"
      },
      ". Dvādasāyatanāni ",
      " – cakkhāyatanaṃ, rūpāyatanaṃ, sotāyatanaṃ, saddāyatanaṃ, ghānāyatanaṃ, gandhāyatanaṃ, jivhāyatanaṃ, rasāyatanaṃ, kāyāyatanaṃ, phoṭṭhabbāyatanaṃ, manāyatanaṃ, dhammāyatanaṃ."
    ],
    "innerText": "154. Dvādasāyatanāni – cakkhāyatanaṃ, rūpāyatanaṃ, sotāyatanaṃ, saddāyatanaṃ, ghānāyatanaṃ, gandhāyatanaṃ, jivhāyatanaṃ, rasāyatanaṃ, kāyāyatanaṃ, phoṭṭhabbāyatanaṃ, manāyatanaṃ, dhammāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Cakkhuṃ aniccaṃ dukkhaṃ anattā vipariṇāmadhammaṃ. Rūpā aniccā dukkhā anattā vipariṇāmadhammā. Sotaṃ aniccaṃ dukkhaṃ anattā vipariṇāmadhammaṃ. Saddā aniccā dukkhā anattā vipariṇāmadhammā. Ghānaṃ aniccaṃ dukkhaṃ anattā vipariṇāmadhammaṃ. Gandhā aniccā dukkhā anattā vipariṇāmadhammā. Jivhā aniccā dukkhā anattā vipariṇāmadhammā. Rasā aniccā dukkhā anattā vipariṇāmadhammā. Kāyo anicco dukkho anattā vipariṇāmadhammo. Phoṭṭhabbā aniccā dukkhā anattā vipariṇāmadhammā. Mano anicco dukkho anattā vipariṇāmadhammo. Dhammā aniccā dukkhā anattā vipariṇāmadhammā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Suttantabhājanīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Abhidhammabhājanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "155"
      },
      ". Dvādasāyatanāni ",
      " – cakkhāyatanaṃ, sotāyatanaṃ, ghānāyatanaṃ, jivhāyatanaṃ, kāyāyatanaṃ, manāyatanaṃ, rūpāyatanaṃ, saddāyatanaṃ, gandhāyatanaṃ, rasāyatanaṃ, phoṭṭhabbāyatanaṃ, dhammāyatanaṃ."
    ],
    "innerText": "155. Dvādasāyatanāni – cakkhāyatanaṃ, sotāyatanaṃ, ghānāyatanaṃ, jivhāyatanaṃ, kāyāyatanaṃ, manāyatanaṃ, rūpāyatanaṃ, saddāyatanaṃ, gandhāyatanaṃ, rasāyatanaṃ, phoṭṭhabbāyatanaṃ, dhammāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "156"
      },
      ". Tattha katamaṃ cakkhāyatanaṃ? Yaṃ cakkhu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cakkhuṃ (sī. syā. ka.) dha. sa. 596-599]"
      },
      " catunnaṃ mahābhūtānaṃ upādāya pasādo attabhāvapariyāpanno anidassano sappaṭigho, yena cakkhunā ",
      " anidassanena sappaṭighena rūpaṃ sanidassanaṃ sappaṭighaṃ passi vā passati vā passissati vā passe vā, cakkhumpetaṃ cakkhāyatanampetaṃ cakkhudhātupesā cakkhundriyampetaṃ lokopeso dvārāpesā samuddopeso paṇḍarampetaṃ khettampetaṃ vatthumpetaṃ nettampetaṃ nayanampetaṃ orimaṃ tīrampetaṃ suñño gāmopeso. Idaṃ vuccati ‘‘cakkhāyatanaṃ’’ ",
      "."
    ],
    "innerText": "156. Tattha katamaṃ cakkhāyatanaṃ? Yaṃ cakkhu [cakkhuṃ (sī. syā. ka.) dha. sa. 596-599] catunnaṃ mahābhūtānaṃ upādāya pasādo attabhāvapariyāpanno anidassano sappaṭigho, yena cakkhunā anidassanena sappaṭighena rūpaṃ sanidassanaṃ sappaṭighaṃ passi vā passati vā passissati vā passe vā, cakkhumpetaṃ cakkhāyatanampetaṃ cakkhudhātupesā cakkhundriyampetaṃ lokopeso dvārāpesā samuddopeso paṇḍarampetaṃ khettampetaṃ vatthumpetaṃ nettampetaṃ nayanampetaṃ orimaṃ tīrampetaṃ suñño gāmopeso. Idaṃ vuccati ‘‘cakkhāyatanaṃ’’ ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "157"
      },
      ". Tattha ",
      " katamaṃ sotāyatanaṃ? Yaṃ sotaṃ catunnaṃ mahābhūtānaṃ upādāya pasādo attabhāvapariyāpanno anidassano sappaṭigho, yena sotena anidassanena sappaṭighena saddaṃ anidassanaṃ sappaṭighaṃ suṇi vā suṇāti vā suṇissati vā suṇe vā, sotampetaṃ sotāyatanampetaṃ sotadhātupesā sotindriyampetaṃ lokopeso dvārāpesā samuddopeso paṇḍarampetaṃ khettampetaṃ vatthumpetaṃ orimaṃ tīrampetaṃ suñño gāmopeso. Idaṃ vuccati ‘‘sotāyatanaṃ’’."
    ],
    "innerText": "157. Tattha katamaṃ sotāyatanaṃ? Yaṃ sotaṃ catunnaṃ mahābhūtānaṃ upādāya pasādo attabhāvapariyāpanno anidassano sappaṭigho, yena sotena anidassanena sappaṭighena saddaṃ anidassanaṃ sappaṭighaṃ suṇi vā suṇāti vā suṇissati vā suṇe vā, sotampetaṃ sotāyatanampetaṃ sotadhātupesā sotindriyampetaṃ lokopeso dvārāpesā samuddopeso paṇḍarampetaṃ khettampetaṃ vatthumpetaṃ orimaṃ tīrampetaṃ suñño gāmopeso. Idaṃ vuccati ‘‘sotāyatanaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "158"
      },
      ". Tattha katamaṃ ghānāyatanaṃ? Yaṃ ghānaṃ catunnaṃ mahābhūtānaṃ upādāya pasādo attabhāvapariyāpanno anidassano sappaṭigho, yena ghānena anidassanena sappaṭighena gandhaṃ anidassanaṃ sappaṭighaṃ ghāyi vā ghāyati vā ghāyissati vā ghāye vā, ghānampetaṃ ghānāyatanampetaṃ ghānadhātupesā ghānindriyampetaṃ lokopeso dvārāpesā samuddopeso paṇḍarampetaṃ khettampetaṃ vatthumpetaṃ orimaṃ tīrampetaṃ suñño gāmopeso. Idaṃ vuccati ‘‘ghānāyatanaṃ’’."
    ],
    "innerText": "158. Tattha katamaṃ ghānāyatanaṃ? Yaṃ ghānaṃ catunnaṃ mahābhūtānaṃ upādāya pasādo attabhāvapariyāpanno anidassano sappaṭigho, yena ghānena anidassanena sappaṭighena gandhaṃ anidassanaṃ sappaṭighaṃ ghāyi vā ghāyati vā ghāyissati vā ghāye vā, ghānampetaṃ ghānāyatanampetaṃ ghānadhātupesā ghānindriyampetaṃ lokopeso dvārāpesā samuddopeso paṇḍarampetaṃ khettampetaṃ vatthumpetaṃ orimaṃ tīrampetaṃ suñño gāmopeso. Idaṃ vuccati ‘‘ghānāyatanaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "159"
      },
      ". Tattha katamaṃ jivhāyatanaṃ? Yā jivhā catunnaṃ mahābhūtānaṃ upādāya pasādo attabhāvapariyāpanno anidassano sappaṭigho, yāya jivhāya anidassanāya sappaṭighāya rasaṃ anidassanaṃ sappaṭighaṃ sāyi vā sāyati vā sāyissati vā sāye vā, jivhāpesā jivhāyatanampetaṃ ",
      " jivhādhātupesā jīvhindriyampetaṃ lokopeso dvārāpesā samuddopeso paṇḍarampetaṃ khettampetaṃ vatthumpetaṃ orimaṃ tīrampetaṃ suñño gāmopeso. Idaṃ vuccati ‘‘jivhāyatanaṃ’’."
    ],
    "innerText": "159. Tattha katamaṃ jivhāyatanaṃ? Yā jivhā catunnaṃ mahābhūtānaṃ upādāya pasādo attabhāvapariyāpanno anidassano sappaṭigho, yāya jivhāya anidassanāya sappaṭighāya rasaṃ anidassanaṃ sappaṭighaṃ sāyi vā sāyati vā sāyissati vā sāye vā, jivhāpesā jivhāyatanampetaṃ jivhādhātupesā jīvhindriyampetaṃ lokopeso dvārāpesā samuddopeso paṇḍarampetaṃ khettampetaṃ vatthumpetaṃ orimaṃ tīrampetaṃ suñño gāmopeso. Idaṃ vuccati ‘‘jivhāyatanaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "160"
      },
      ". Tattha katamaṃ kāyāyatanaṃ? Yo kāyo catunnaṃ mahābhūtānaṃ upādāya pasādo attabhāvapariyāpanno anidassano sappaṭigho, yena kāyena anidassanena sappaṭighena phoṭṭhabbaṃ anidassanaṃ sappaṭighaṃ phusi vā phusati vā phusissati vā phuse vā, kāyopeso kāyāyatanampetaṃ kāyadhātupesā kāyindriyampetaṃ lokopeso dvārāpesā samuddopeso paṇḍarampetaṃ khettampetaṃ vatthumpetaṃ orimaṃ tīrampetaṃ suñño gāmopeso. Idaṃ vuccati ‘‘kāyāyatanaṃ’’."
    ],
    "innerText": "160. Tattha katamaṃ kāyāyatanaṃ? Yo kāyo catunnaṃ mahābhūtānaṃ upādāya pasādo attabhāvapariyāpanno anidassano sappaṭigho, yena kāyena anidassanena sappaṭighena phoṭṭhabbaṃ anidassanaṃ sappaṭighaṃ phusi vā phusati vā phusissati vā phuse vā, kāyopeso kāyāyatanampetaṃ kāyadhātupesā kāyindriyampetaṃ lokopeso dvārāpesā samuddopeso paṇḍarampetaṃ khettampetaṃ vatthumpetaṃ orimaṃ tīrampetaṃ suñño gāmopeso. Idaṃ vuccati ‘‘kāyāyatanaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "161"
      },
      ". Tattha ",
      " katamaṃ manāyatanaṃ? Ekavidhena manāyatanaṃ – phassasampayuttaṃ."
    ],
    "innerText": "161. Tattha katamaṃ manāyatanaṃ? Ekavidhena manāyatanaṃ – phassasampayuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Duvidhena manāyatanaṃ – atthi sahetukaṃ, atthi ahetukaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tividhena manāyatanaṃ – atthi kusalaṃ, atthi akusalaṃ, atthi abyākataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Catubbidhena manāyatanaṃ – atthi kāmāvacaraṃ, atthi rūpāvacaraṃ, atthi arūpāvacaraṃ, atthi apariyāpannaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pañcavidhena manāyatanaṃ – atthi sukhindriyasampayuttaṃ, atthi dukkhindriyasampayuttaṃ, atthi somanassindriyasampayuttaṃ, atthi domanassindriyasampayuttaṃ, atthi upekkhindriyasampayuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Chabbidhena manāyatanaṃ – cakkhuviññāṇaṃ, sotaviññāṇaṃ, ghānaviññāṇaṃ, jivhāviññāṇaṃ, kāyaviññāṇaṃ, manoviññāṇaṃ. Evaṃ chabbidhena manāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sattavidhena manāyatanaṃ – cakkhuviññāṇaṃ, sotaviññāṇaṃ, ghānaviññāṇaṃ, jivhāviññāṇaṃ, kāyaviññāṇaṃ, manodhātu, manoviññāṇadhātu. Evaṃ sattavidhena manāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aṭṭhavidhena manāyatanaṃ – cakkhuviññāṇaṃ, sotaviññāṇaṃ, ghānaviññāṇaṃ, jivhāviññāṇaṃ, kāyaviññāṇaṃ ",
      " atthi sukhasahagataṃ, atthi dukkhasahagataṃ, manodhātu, manoviññāṇadhātu. Evaṃ aṭṭhavidhena manāyatanaṃ."
    ],
    "innerText": "Aṭṭhavidhena manāyatanaṃ – cakkhuviññāṇaṃ, sotaviññāṇaṃ, ghānaviññāṇaṃ, jivhāviññāṇaṃ, kāyaviññāṇaṃ atthi sukhasahagataṃ, atthi dukkhasahagataṃ, manodhātu, manoviññāṇadhātu. Evaṃ aṭṭhavidhena manāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Navavidhena manāyatanaṃ – cakkhuviññāṇaṃ, sotaviññāṇaṃ, ghānaviññāṇaṃ, jivhāviññāṇaṃ, kāyaviññāṇaṃ, manodhātu, manoviññāṇadhātu atthi kusalaṃ, atthi akusalaṃ, atthi abyākataṃ. Evaṃ navavidhena manāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dasavidhena manāyatanaṃ – cakkhuviññāṇaṃ, sotaviññāṇaṃ, ghānaviññāṇaṃ, jivhāviññāṇaṃ, kāyaviññāṇaṃ atthi sukhasahagataṃ, atthi dukkhasahagataṃ, manodhātu, manoviññāṇadhātu atthi kusalaṃ, atthi akusalaṃ, atthi abyākataṃ. Evaṃ dasavidhena manāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ekavidhena manāyatanaṃ – phassasampayuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Duvidhena manāyatanaṃ – atthi sahetukaṃ, atthi ahetukaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tividhena ",
      " manāyatanaṃ – atthi sukhāya vedanāya sampayuttaṃ, atthi dukkhāya vedanāya sampayuttaṃ, atthi adukkhamasukhāya vedanāya sampayuttaṃ…pe…. Evaṃ bahuvidhena manāyatanaṃ. Idaṃ vuccati ‘‘manāyatanaṃ’’."
    ],
    "innerText": "Tividhena manāyatanaṃ – atthi sukhāya vedanāya sampayuttaṃ, atthi dukkhāya vedanāya sampayuttaṃ, atthi adukkhamasukhāya vedanāya sampayuttaṃ…pe…. Evaṃ bahuvidhena manāyatanaṃ. Idaṃ vuccati ‘‘manāyatanaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "162"
      },
      ". Tattha ",
      " katamaṃ rūpāyatanaṃ? Yaṃ rūpaṃ catunnaṃ mahābhūtānaṃ upādāya vaṇṇanibhā sanidassanaṃ sappaṭighaṃ nīlaṃ pītakaṃ lohitakaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pītaṃ lohitaṃ (sī.)]"
      },
      " odātaṃ kāḷakaṃ mañjiṭṭhakaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mañjeṭṭhakaṃ (sī. syā.)]"
      },
      " hari harivaṇṇaṃ ambaṅkuravaṇṇaṃ dīghaṃ rassaṃ aṇuṃ thūlaṃ vaṭṭaṃ parimaṇḍalaṃ caturassaṃ chaḷaṃsaṃ aṭṭhaṃsaṃ soḷasaṃsaṃ ninnaṃ thalaṃ chāyā ātapo āloko andhakāro abbhā mahikā dhūmo rajo candamaṇḍalassa vaṇṇanibhā sūriyamaṇḍalassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[suriyamaṇḍalassa (sī. syā. kaṃ.)]"
      },
      " vaṇṇanibhā tārakarūpānaṃ vaṇṇanibhā ādāsamaṇḍalassa vaṇṇanibhā maṇisaṅkhamuttaveḷuriyassa vaṇṇanibhā jātarūparajatassa vaṇṇanibhā, yaṃ vā panaññampi atthi rūpaṃ catunnaṃ mahābhūtānaṃ upādāya vaṇṇanibhā sanidassanaṃ sappaṭighaṃ, yaṃ rūpaṃ sanidassanaṃ sappaṭighaṃ cakkhunā anidassanena sappaṭighena passi vā passati vā passissati vā passe vā, rūpampetaṃ rūpāyatanampetaṃ rūpadhātupesā. Idaṃ vuccati ‘‘rūpāyatanaṃ’’."
    ],
    "innerText": "162. Tattha katamaṃ rūpāyatanaṃ? Yaṃ rūpaṃ catunnaṃ mahābhūtānaṃ upādāya vaṇṇanibhā sanidassanaṃ sappaṭighaṃ nīlaṃ pītakaṃ lohitakaṃ [pītaṃ lohitaṃ (sī.)] odātaṃ kāḷakaṃ mañjiṭṭhakaṃ [mañjeṭṭhakaṃ (sī. syā.)] hari harivaṇṇaṃ ambaṅkuravaṇṇaṃ dīghaṃ rassaṃ aṇuṃ thūlaṃ vaṭṭaṃ parimaṇḍalaṃ caturassaṃ chaḷaṃsaṃ aṭṭhaṃsaṃ soḷasaṃsaṃ ninnaṃ thalaṃ chāyā ātapo āloko andhakāro abbhā mahikā dhūmo rajo candamaṇḍalassa vaṇṇanibhā sūriyamaṇḍalassa [suriyamaṇḍalassa (sī. syā. kaṃ.)] vaṇṇanibhā tārakarūpānaṃ vaṇṇanibhā ādāsamaṇḍalassa vaṇṇanibhā maṇisaṅkhamuttaveḷuriyassa vaṇṇanibhā jātarūparajatassa vaṇṇanibhā, yaṃ vā panaññampi atthi rūpaṃ catunnaṃ mahābhūtānaṃ upādāya vaṇṇanibhā sanidassanaṃ sappaṭighaṃ, yaṃ rūpaṃ sanidassanaṃ sappaṭighaṃ cakkhunā anidassanena sappaṭighena passi vā passati vā passissati vā passe vā, rūpampetaṃ rūpāyatanampetaṃ rūpadhātupesā. Idaṃ vuccati ‘‘rūpāyatanaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "163"
      },
      ". Tattha ",
      " katamaṃ saddāyatanaṃ? Yo saddo catunnaṃ mahābhūtānaṃ upādāya anidassano sappaṭigho bherisaddo mudiṅgasaddo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mutiṅgasaddho (sī.)]"
      },
      " saṅkhasaddo paṇavasaddo gītasaddo vāditasaddo sammasaddo pāṇisaddo sattānaṃ nigghosasaddo dhātūnaṃ sannighātasaddo vātasaddo udakasaddo manussasaddo amanussasaddo, yo vā panaññopi atthi saddo catunnaṃ mahābhūtānaṃ upādāya anidassano sappaṭigho, yaṃ saddaṃ anidassanaṃ sappaṭighaṃ sotena anidassanena sappaṭighena suṇi vā suṇāti vā suṇissati vā suṇe vā, saddopeso saddāyatanampetaṃ saddadhātupesā. Idaṃ vuccati ‘‘saddāyatanaṃ’’."
    ],
    "innerText": "163. Tattha katamaṃ saddāyatanaṃ? Yo saddo catunnaṃ mahābhūtānaṃ upādāya anidassano sappaṭigho bherisaddo mudiṅgasaddo [mutiṅgasaddho (sī.)] saṅkhasaddo paṇavasaddo gītasaddo vāditasaddo sammasaddo pāṇisaddo sattānaṃ nigghosasaddo dhātūnaṃ sannighātasaddo vātasaddo udakasaddo manussasaddo amanussasaddo, yo vā panaññopi atthi saddo catunnaṃ mahābhūtānaṃ upādāya anidassano sappaṭigho, yaṃ saddaṃ anidassanaṃ sappaṭighaṃ sotena anidassanena sappaṭighena suṇi vā suṇāti vā suṇissati vā suṇe vā, saddopeso saddāyatanampetaṃ saddadhātupesā. Idaṃ vuccati ‘‘saddāyatanaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "164"
      },
      ". Tattha katamaṃ gandhāyatanaṃ? Yo gandho catunnaṃ mahābhūtānaṃ upādāya anidassano sappaṭigho mūlagandho sāragandho tacagandho pattagandho pupphagandho phalagandho āmagandho vissagandho sugandho duggandho, yo vā panaññopi atthi gandho catunnaṃ mahābhūtānaṃ upādāya anidassano sappaṭigho ",
      ", yaṃ gandhaṃ anidassanaṃ sappaṭighaṃ ghānena anidassanena sappaṭighena ghāyi vā ghāyati vā ghāyissati vā ghāye vā, gandhopeso gandhāyatanampetaṃ gandhadhātupesā. Idaṃ vuccati ‘‘gandhāyatanaṃ’’."
    ],
    "innerText": "164. Tattha katamaṃ gandhāyatanaṃ? Yo gandho catunnaṃ mahābhūtānaṃ upādāya anidassano sappaṭigho mūlagandho sāragandho tacagandho pattagandho pupphagandho phalagandho āmagandho vissagandho sugandho duggandho, yo vā panaññopi atthi gandho catunnaṃ mahābhūtānaṃ upādāya anidassano sappaṭigho , yaṃ gandhaṃ anidassanaṃ sappaṭighaṃ ghānena anidassanena sappaṭighena ghāyi vā ghāyati vā ghāyissati vā ghāye vā, gandhopeso gandhāyatanampetaṃ gandhadhātupesā. Idaṃ vuccati ‘‘gandhāyatanaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "165"
      },
      ". Tattha katamaṃ rasāyatanaṃ? Yo raso catunnaṃ mahābhūtānaṃ upādāya anidassano sappaṭigho mūlaraso khandharaso tacaraso pattaraso puppharaso phalaraso ambilaṃ madhuraṃ tittakaṃ kaṭukaṃ loṇikaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[lapilakaṃ (sī.), lampikaṃ (ka. sī.)]"
      },
      " khārikaṃ lambikaṃ kasāvo sādu asādu, yo vā panaññopi atthi raso catunnaṃ mahābhūtānaṃ upādāya anidassano sappaṭigho, yaṃ rasaṃ anidassanaṃ sappaṭighaṃ jivhāya anidassanāya sappaṭighāya sāyi vā sāyati vā sāyissati vā sāye vā, rasopeso rasāyatanampetaṃ rasadhātupesā. Idaṃ vuccati ‘‘rasāyatanaṃ’’."
    ],
    "innerText": "165. Tattha katamaṃ rasāyatanaṃ? Yo raso catunnaṃ mahābhūtānaṃ upādāya anidassano sappaṭigho mūlaraso khandharaso tacaraso pattaraso puppharaso phalaraso ambilaṃ madhuraṃ tittakaṃ kaṭukaṃ loṇikaṃ [lapilakaṃ (sī.), lampikaṃ (ka. sī.)] khārikaṃ lambikaṃ kasāvo sādu asādu, yo vā panaññopi atthi raso catunnaṃ mahābhūtānaṃ upādāya anidassano sappaṭigho, yaṃ rasaṃ anidassanaṃ sappaṭighaṃ jivhāya anidassanāya sappaṭighāya sāyi vā sāyati vā sāyissati vā sāye vā, rasopeso rasāyatanampetaṃ rasadhātupesā. Idaṃ vuccati ‘‘rasāyatanaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "166"
      },
      ". Tattha katamaṃ phoṭṭhabbāyatanaṃ? Pathavīdhātu tejodhātu vāyodhātu kakkhaḷaṃ mudukaṃ saṇhaṃ pharusaṃ sukhasamphassaṃ dukkhasamphassaṃ garukaṃ lahukaṃ, yaṃ phoṭṭhabbaṃ anidassanaṃ sappaṭighaṃ kāyena anidassanena sappaṭighena phusi vā phusati vā phusissati vā phuse vā, phoṭṭhabbopeso phoṭṭhabbāyatanampetaṃ phoṭṭhabbadhātupesā. Idaṃ vuccati ‘‘phoṭṭhabbāyatanaṃ’’."
    ],
    "innerText": "166. Tattha katamaṃ phoṭṭhabbāyatanaṃ? Pathavīdhātu tejodhātu vāyodhātu kakkhaḷaṃ mudukaṃ saṇhaṃ pharusaṃ sukhasamphassaṃ dukkhasamphassaṃ garukaṃ lahukaṃ, yaṃ phoṭṭhabbaṃ anidassanaṃ sappaṭighaṃ kāyena anidassanena sappaṭighena phusi vā phusati vā phusissati vā phuse vā, phoṭṭhabbopeso phoṭṭhabbāyatanampetaṃ phoṭṭhabbadhātupesā. Idaṃ vuccati ‘‘phoṭṭhabbāyatanaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "167"
      },
      ". Tattha ",
      " katamaṃ dhammāyatanaṃ? Vedanākkhandho, saññākkhandho, saṅkhārakkhandho, yañca rūpaṃ anidassanaappaṭighaṃ dhammāyatanapariyāpannaṃ, asaṅkhatā ca dhātu."
    ],
    "innerText": "167. Tattha katamaṃ dhammāyatanaṃ? Vedanākkhandho, saññākkhandho, saṅkhārakkhandho, yañca rūpaṃ anidassanaappaṭighaṃ dhammāyatanapariyāpannaṃ, asaṅkhatā ca dhātu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha katamo vedanākkhandho? Ekavidhena vedanākkhandho – phassasampayutto. Duvidhena vedanākkhandho – atthi sahetuko, atthi ahetuko. Tividhena vedanākkhandho – atthi kusalo, atthi akusalo, atthi abyākato…pe… evaṃ dasavidhena vedanākkhandho…pe… evaṃ bahuvidhena vedanākkhandho. Ayaṃ vuccati ‘‘vedanākkhandho’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha katamo saññākkhandho? Ekavidhena saññākkhandho – phassasampayutto. Duvidhena saññākkhandho – atthi sahetuko, atthi ahetuko. Tividhena saññākkhandho – atthi kusalo, atthi akusalo, atthi ",
      " abyākato…pe… evaṃ dasavidhena saññākkhandho…pe… evaṃ bahuvidhena saññākkhandho. Ayaṃ vuccati ‘‘saññākkhandho’’."
    ],
    "innerText": "Tattha katamo saññākkhandho? Ekavidhena saññākkhandho – phassasampayutto. Duvidhena saññākkhandho – atthi sahetuko, atthi ahetuko. Tividhena saññākkhandho – atthi kusalo, atthi akusalo, atthi abyākato…pe… evaṃ dasavidhena saññākkhandho…pe… evaṃ bahuvidhena saññākkhandho. Ayaṃ vuccati ‘‘saññākkhandho’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha katamo saṅkhārakkhandho? Ekavidhena saṅkhārakkhandho – cittasampayutto. Duvidhena saṅkhārakkhandho – atthi hetu, atthi na hetu. Tividhena saṅkhārakkhandho – atthi kusalo, atthi akusalo, atthi abyākato…pe… evaṃ dasavidhena saṅkhārakkhandho…pe… evaṃ bahuvidhena saṅkhārakkhandho. Ayaṃ vuccati ‘‘saṅkhārakkhandho’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha katamaṃ ",
      " rūpaṃ anidassanaappaṭighaṃ dhammāyatanapariyāpannaṃ? Itthindriyaṃ purisindriyaṃ…pe… kabaḷīkāro āhāro. Idaṃ vuccati rūpaṃ ‘‘anidassanaappaṭighaṃ dhammāyatanapariyāpannaṃ’’."
    ],
    "innerText": "Tattha katamaṃ rūpaṃ anidassanaappaṭighaṃ dhammāyatanapariyāpannaṃ? Itthindriyaṃ purisindriyaṃ…pe… kabaḷīkāro āhāro. Idaṃ vuccati rūpaṃ ‘‘anidassanaappaṭighaṃ dhammāyatanapariyāpannaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha katamā asaṅkhatā dhātu? Rāgakkhayo ",
      ", dosakkhayo, mohakkhayo – ayaṃ vuccati ‘‘asaṅkhatā dhātu’’."
    ],
    "innerText": "Tattha katamā asaṅkhatā dhātu? Rāgakkhayo , dosakkhayo, mohakkhayo – ayaṃ vuccati ‘‘asaṅkhatā dhātu’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Idaṃ vuccati dhammāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhidhammabhājanīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Pañhāpucchakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "168"
      },
      ". Dvādasāyatanāni ",
      " – cakkhāyatanaṃ, rūpāyatanaṃ, sotāyatanaṃ, saddāyatanaṃ, ghānāyatanaṃ, gandhāyatanaṃ, jivhāyatanaṃ, rasāyatanaṃ, kāyāyatanaṃ, phoṭṭhabbāyatanaṃ, manāyatanaṃ, dhammāyatanaṃ."
    ],
    "innerText": "168. Dvādasāyatanāni – cakkhāyatanaṃ, rūpāyatanaṃ, sotāyatanaṃ, saddāyatanaṃ, ghānāyatanaṃ, gandhāyatanaṃ, jivhāyatanaṃ, rasāyatanaṃ, kāyāyatanaṃ, phoṭṭhabbāyatanaṃ, manāyatanaṃ, dhammāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "169"
      },
      ". Dvādasannaṃ āyatanānaṃ kati kusalā, kati akusalā, kati abyākatā…pe… kati saraṇā, kati araṇā?"
    ],
    "innerText": "169. Dvādasannaṃ āyatanānaṃ kati kusalā, kati akusalā, kati abyākatā…pe… kati saraṇā, kati araṇā?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Tikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "170"
      },
      ". Dasāyatanā abyākatā. Dvāyatanā siyā kusalā, siyā akusalā, siyā abyākatā. Dasāyatanā na vattabbā – ‘‘sukhāya vedanāya sampayuttā’’tipi, ‘‘dukkhāya vedanāya sampayuttā’’tipi, ‘‘adukkhamasukhāya vedanāya sampayuttā’’tipi. Manāyatanaṃ siyā sukhāya vedanāya ",
      " sampayuttaṃ, siyā dukkhāya vedanāya sampayuttaṃ, siyā adukkhamasukhāya vedanāya sampayuttaṃ. Dhammāyatanaṃ siyā sukhāya vedanāya sampayuttaṃ, siyā dukkhāya vedanāya sampayuttaṃ, siyā adukkhamasukhāya vedanāya sampayuttaṃ, siyā na vattabbaṃ – ‘‘sukhāya vedanāya sampayutta’’ntipi, ‘‘dukkhāya vedanāya sampayutta’’ntipi, ‘‘adukkhamasukhāya vedanāya sampayutta’’ntipi. Dasāyatanā nevavipākanavipākadhammadhammā. Dvāyatanā siyā vipākā, siyā vipākadhammadhammā, siyā nevavipākanavipākadhammadhammā."
    ],
    "innerText": "170. Dasāyatanā abyākatā. Dvāyatanā siyā kusalā, siyā akusalā, siyā abyākatā. Dasāyatanā na vattabbā – ‘‘sukhāya vedanāya sampayuttā’’tipi, ‘‘dukkhāya vedanāya sampayuttā’’tipi, ‘‘adukkhamasukhāya vedanāya sampayuttā’’tipi. Manāyatanaṃ siyā sukhāya vedanāya sampayuttaṃ, siyā dukkhāya vedanāya sampayuttaṃ, siyā adukkhamasukhāya vedanāya sampayuttaṃ. Dhammāyatanaṃ siyā sukhāya vedanāya sampayuttaṃ, siyā dukkhāya vedanāya sampayuttaṃ, siyā adukkhamasukhāya vedanāya sampayuttaṃ, siyā na vattabbaṃ – ‘‘sukhāya vedanāya sampayutta’’ntipi, ‘‘dukkhāya vedanāya sampayutta’’ntipi, ‘‘adukkhamasukhāya vedanāya sampayutta’’ntipi. Dasāyatanā nevavipākanavipākadhammadhammā. Dvāyatanā siyā vipākā, siyā vipākadhammadhammā, siyā nevavipākanavipākadhammadhammā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañcāyatanā upādinnupādāniyā. Saddāyatanaṃ ",
      " anupādinnupādāniyaṃ. Cattāro āyatanā siyā upādinnupādāniyā, siyā anupādinnupādāniyā, siyā anupādāniyā. Dvāyatanā siyā upādinnupādāniyā, siyā anupādinnupādāniyā, siyā anupādinnaanupādāniyā. Dasāyatanā asaṃkiliṭṭhasaṃkilesikā. Dvāyatanā siyā saṃkiliṭṭhasaṃkilesikā, siyā asaṃkiliṭṭhasaṃkilesikā, siyā asaṃkiliṭṭhaasaṃkilesikā. Dasāyatanā avitakkaavicārā. Manāyatanaṃ siyā savitakkasavicāraṃ, siyā avitakkavicāramattaṃ, siyā avitakkaavicāraṃ. Dhammāyatanaṃ siyā savitakkasavicāraṃ, siyā avitakkavicāramattaṃ, siyā avitakkaavicāraṃ ",
      ", siyā na vattabbaṃ – ‘‘savitakkasavicāra’’ntipi, ‘‘avitakkavicāramatta’’ntipi, ‘‘avitakkaavicāra’’ntipi. Dasāyatanā na vattabbā – ‘‘pītisahagatā’’tipi, ‘‘sukhasahagatā’’tipi, ‘‘upekkhāsahagatā’’tipi. Dvāyatanā siyā pītisahagatā, siyā ",
      " sukhasahagatā, siyā upekkhāsahagatā, siyā na vattabbā – ‘‘pītisahagatā’’tipi, ‘‘sukhasahagatā’’tipi, ‘‘upekkhāsahagatā’’tipi."
    ],
    "innerText": "Pañcāyatanā upādinnupādāniyā. Saddāyatanaṃ anupādinnupādāniyaṃ. Cattāro āyatanā siyā upādinnupādāniyā, siyā anupādinnupādāniyā, siyā anupādāniyā. Dvāyatanā siyā upādinnupādāniyā, siyā anupādinnupādāniyā, siyā anupādinnaanupādāniyā. Dasāyatanā asaṃkiliṭṭhasaṃkilesikā. Dvāyatanā siyā saṃkiliṭṭhasaṃkilesikā, siyā asaṃkiliṭṭhasaṃkilesikā, siyā asaṃkiliṭṭhaasaṃkilesikā. Dasāyatanā avitakkaavicārā. Manāyatanaṃ siyā savitakkasavicāraṃ, siyā avitakkavicāramattaṃ, siyā avitakkaavicāraṃ. Dhammāyatanaṃ siyā savitakkasavicāraṃ, siyā avitakkavicāramattaṃ, siyā avitakkaavicāraṃ , siyā na vattabbaṃ – ‘‘savitakkasavicāra’’ntipi, ‘‘avitakkavicāramatta’’ntipi, ‘‘avitakkaavicāra’’ntipi. Dasāyatanā na vattabbā – ‘‘pītisahagatā’’tipi, ‘‘sukhasahagatā’’tipi, ‘‘upekkhāsahagatā’’tipi. Dvāyatanā siyā pītisahagatā, siyā sukhasahagatā, siyā upekkhāsahagatā, siyā na vattabbā – ‘‘pītisahagatā’’tipi, ‘‘sukhasahagatā’’tipi, ‘‘upekkhāsahagatā’’tipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dasāyatanā neva dassanena na bhāvanāya pahātabbā. Dvāyatanā siyā dassanena pahātabbā, siyā bhāvanāya pahātabbā, siyā neva dassanena na bhāvanāya pahātabbā. Dasāyatanā neva dassanena na bhāvanāya pahātabbahetukā. Dvāyatanā siyā dassanena pahātabbahetukā, siyā bhāvanāya pahātabbahetukā, siyā neva dassanena na bhāvanāya pahātabbahetukā. Dasāyatanā nevācayagāmināpacayagāmino. Dvāyatanā siyā ācayagāmino, siyā apacayagāmino, siyā nevācayagāmināpacayagāmino. Dasāyatanā ",
      " nevasekkhanāsekkhā. Dvāyatanā siyā sekkhā, siyā asekkhā ",
      ", siyā nevasekkhanāsekkhā. Dasāyatanā parittā. Dvāyatanā siyā parittā, siyā mahaggatā, siyā appamāṇā. Dasāyatanā anārammaṇā. Dvāyatanā siyā parittārammaṇā, siyā mahaggatārammaṇā, siyā appamāṇārammaṇā, siyā na vattabbā – ‘‘parittārammaṇā’’tipi, ‘‘mahaggatārammaṇā’’tipi, ‘‘appamāṇārammaṇā’’tipi. Dasāyatanā majjhimā. Dvāyatanā siyā hīnā, siyā majjhimā, siyā paṇītā. Dasāyatanā aniyatā. Dvāyatanā siyā micchattaniyatā, siyā sammattaniyatā, siyā aniyatā."
    ],
    "innerText": "Dasāyatanā neva dassanena na bhāvanāya pahātabbā. Dvāyatanā siyā dassanena pahātabbā, siyā bhāvanāya pahātabbā, siyā neva dassanena na bhāvanāya pahātabbā. Dasāyatanā neva dassanena na bhāvanāya pahātabbahetukā. Dvāyatanā siyā dassanena pahātabbahetukā, siyā bhāvanāya pahātabbahetukā, siyā neva dassanena na bhāvanāya pahātabbahetukā. Dasāyatanā nevācayagāmināpacayagāmino. Dvāyatanā siyā ācayagāmino, siyā apacayagāmino, siyā nevācayagāmināpacayagāmino. Dasāyatanā nevasekkhanāsekkhā. Dvāyatanā siyā sekkhā, siyā asekkhā , siyā nevasekkhanāsekkhā. Dasāyatanā parittā. Dvāyatanā siyā parittā, siyā mahaggatā, siyā appamāṇā. Dasāyatanā anārammaṇā. Dvāyatanā siyā parittārammaṇā, siyā mahaggatārammaṇā, siyā appamāṇārammaṇā, siyā na vattabbā – ‘‘parittārammaṇā’’tipi, ‘‘mahaggatārammaṇā’’tipi, ‘‘appamāṇārammaṇā’’tipi. Dasāyatanā majjhimā. Dvāyatanā siyā hīnā, siyā majjhimā, siyā paṇītā. Dasāyatanā aniyatā. Dvāyatanā siyā micchattaniyatā, siyā sammattaniyatā, siyā aniyatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dasāyatanā anārammaṇā. Dvāyatanā siyā maggārammaṇā, siyā maggahetukā, siyā maggādhipatino, siyā na vattabbā – ‘‘maggārammaṇā’’tipi, ‘‘maggahetukā’’tipi, ‘‘maggādhipatino’’tipi. Pañcāyatanā siyā uppannā, siyā uppādino, na vattabbā – ‘‘anuppannā’’ti. Saddāyatanaṃ siyā uppannaṃ, siyā anuppannaṃ, na vattabbaṃ – ‘‘uppādī’’ti. Pañcāyatanā siyā uppannā, siyā anuppannā, siyā uppādino. Dhammāyatanaṃ siyā uppannaṃ, siyā anuppannaṃ, siyā uppādi, siyā na vattabbaṃ – ‘‘uppanna’’ntipi, ‘‘anuppanna’’ntipi, ‘‘uppādī’’tipi. Ekādasāyatanā siyā atītā, siyā anāgatā, siyā paccuppannā. Dhammāyatanaṃ siyā atītaṃ, siyā anāgataṃ, siyā paccuppannaṃ, siyā na vattabbaṃ – ‘‘atīta’’ntipi, ‘‘anāgata’’ntipi, ‘‘paccuppanna’’ntipi. Dasāyatanā anārammaṇā. Dvāyatanā siyā ",
      " atītārammaṇā, siyā anāgatārammaṇā ",
      ", siyā paccuppannārammaṇā, siyā na vattabbā ",
      " – ‘‘atītārammaṇā’’tipi, ‘‘anāgatārammaṇā’’tipi, ‘‘paccuppannārammaṇā’’tipi; siyā ajjhattā, siyā bahiddhā, siyā ajjhattabahiddhā. Dasāyatanā anārammaṇā. Dvāyatanā siyā ajjhattārammaṇā, siyā bahiddhārammaṇā, siyā ajjhattabahiddhārammaṇā, siyā na vattabbā – ‘‘ajjhattārammaṇā’’tipi, ‘‘bahiddhārammaṇā’’tipi, ‘‘ajjhattabahiddhārammaṇā’’tipi. Rūpāyatanaṃ sanidassanasappaṭighaṃ. Navāyatanā anidassanasappaṭighā. Dvāyatanā anidassanaappaṭighā."
    ],
    "innerText": "Dasāyatanā anārammaṇā. Dvāyatanā siyā maggārammaṇā, siyā maggahetukā, siyā maggādhipatino, siyā na vattabbā – ‘‘maggārammaṇā’’tipi, ‘‘maggahetukā’’tipi, ‘‘maggādhipatino’’tipi. Pañcāyatanā siyā uppannā, siyā uppādino, na vattabbā – ‘‘anuppannā’’ti. Saddāyatanaṃ siyā uppannaṃ, siyā anuppannaṃ, na vattabbaṃ – ‘‘uppādī’’ti. Pañcāyatanā siyā uppannā, siyā anuppannā, siyā uppādino. Dhammāyatanaṃ siyā uppannaṃ, siyā anuppannaṃ, siyā uppādi, siyā na vattabbaṃ – ‘‘uppanna’’ntipi, ‘‘anuppanna’’ntipi, ‘‘uppādī’’tipi. Ekādasāyatanā siyā atītā, siyā anāgatā, siyā paccuppannā. Dhammāyatanaṃ siyā atītaṃ, siyā anāgataṃ, siyā paccuppannaṃ, siyā na vattabbaṃ – ‘‘atīta’’ntipi, ‘‘anāgata’’ntipi, ‘‘paccuppanna’’ntipi. Dasāyatanā anārammaṇā. Dvāyatanā siyā atītārammaṇā, siyā anāgatārammaṇā , siyā paccuppannārammaṇā, siyā na vattabbā – ‘‘atītārammaṇā’’tipi, ‘‘anāgatārammaṇā’’tipi, ‘‘paccuppannārammaṇā’’tipi; siyā ajjhattā, siyā bahiddhā, siyā ajjhattabahiddhā. Dasāyatanā anārammaṇā. Dvāyatanā siyā ajjhattārammaṇā, siyā bahiddhārammaṇā, siyā ajjhattabahiddhārammaṇā, siyā na vattabbā – ‘‘ajjhattārammaṇā’’tipi, ‘‘bahiddhārammaṇā’’tipi, ‘‘ajjhattabahiddhārammaṇā’’tipi. Rūpāyatanaṃ sanidassanasappaṭighaṃ. Navāyatanā anidassanasappaṭighā. Dvāyatanā anidassanaappaṭighā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Dukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "171"
      },
      ". Ekādasāyatanā na hetū. Dhammāyatanaṃ siyā hetu, siyā na hetu. Dasāyatanā ahetukā. Dvāyatanā siyā sahetukā, siyā ahetukā. Dasāyatanā hetuvippayuttā. Dvāyatanā siyā hetusampayuttā, siyā hetuvippayuttā. Dasāyatanā na vattabbā – ‘‘hetū ",
      " ceva sahetukā cā’’tipi, ‘‘sahetukā ceva na ca hetū’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘hetu ceva sahetukañcā’’ti, siyā sahetukañceva na ca hetu, siyā na vattabbaṃ – ‘‘sahetukañceva na ca hetū’’ti. Dhammāyatanaṃ siyā hetu ceva sahetukañca, siyā sahetukañceva na ca hetu, siyā na vattabbaṃ – ‘‘hetu ceva sahetukañcā’’tipi, ‘‘sahetukañceva na ca hetū’’tipi. Dasāyatanā na vattabbā – ‘‘hetū ceva hetusampayuttā cā’’tipi, ‘‘hetusampayuttā ceva na ca hetū’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘hetu ceva hetusampayuttañcā’’ti, siyā hetusampayuttañceva na ca hetu, siyā na vattabbaṃ – ‘‘hetusampayuttañceva na ",
      " ca hetū’’ti. Dhammāyatanaṃ siyā hetu ceva hetusampayuttañca, siyā hetusampayuttañceva na ca hetu, siyā na vattabbaṃ – ‘‘hetu ceva hetusampayuttañcā’’tipi, ‘‘hetusampayuttañceva na ca hetū’’tipi. Dasāyatanā na hetūahetukā. Manāyatanaṃ siyā na hetusahetukaṃ, siyā na hetuahetukaṃ. Dhammāyatanaṃ siyā na hetusahetukaṃ, siyā na hetuahetukaṃ, siyā na vattabbaṃ – ‘‘na hetusahetuka’’ntipi, ‘‘na hetuahetuka’’ntipi."
    ],
    "innerText": "171. Ekādasāyatanā na hetū. Dhammāyatanaṃ siyā hetu, siyā na hetu. Dasāyatanā ahetukā. Dvāyatanā siyā sahetukā, siyā ahetukā. Dasāyatanā hetuvippayuttā. Dvāyatanā siyā hetusampayuttā, siyā hetuvippayuttā. Dasāyatanā na vattabbā – ‘‘hetū ceva sahetukā cā’’tipi, ‘‘sahetukā ceva na ca hetū’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘hetu ceva sahetukañcā’’ti, siyā sahetukañceva na ca hetu, siyā na vattabbaṃ – ‘‘sahetukañceva na ca hetū’’ti. Dhammāyatanaṃ siyā hetu ceva sahetukañca, siyā sahetukañceva na ca hetu, siyā na vattabbaṃ – ‘‘hetu ceva sahetukañcā’’tipi, ‘‘sahetukañceva na ca hetū’’tipi. Dasāyatanā na vattabbā – ‘‘hetū ceva hetusampayuttā cā’’tipi, ‘‘hetusampayuttā ceva na ca hetū’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘hetu ceva hetusampayuttañcā’’ti, siyā hetusampayuttañceva na ca hetu, siyā na vattabbaṃ – ‘‘hetusampayuttañceva na ca hetū’’ti. Dhammāyatanaṃ siyā hetu ceva hetusampayuttañca, siyā hetusampayuttañceva na ca hetu, siyā na vattabbaṃ – ‘‘hetu ceva hetusampayuttañcā’’tipi, ‘‘hetusampayuttañceva na ca hetū’’tipi. Dasāyatanā na hetūahetukā. Manāyatanaṃ siyā na hetusahetukaṃ, siyā na hetuahetukaṃ. Dhammāyatanaṃ siyā na hetusahetukaṃ, siyā na hetuahetukaṃ, siyā na vattabbaṃ – ‘‘na hetusahetuka’’ntipi, ‘‘na hetuahetuka’’ntipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekādasāyatanā sappaccayā. Dhammāyatanaṃ siyā sappaccayaṃ, siyā appaccayaṃ. Ekādasāyatanā saṅkhatā. Dhammāyatanaṃ siyā saṅkhataṃ, siyā asaṅkhataṃ. Rūpāyatanaṃ sanidassanaṃ. Ekādasāyatanā ",
      " anidassanā. Dasāyatanā ",
      " sappaṭighā. Dvāyatanā appaṭighā. Dasāyatanā rūpā. Manāyatanaṃ arūpaṃ. Dhammāyatanaṃ siyā rūpaṃ, siyā arūpaṃ. Dasāyatanā lokiyā. Dvāyatanā siyā lokiyā, siyā lokuttarā; kenaci viññeyyā, kenaci na viññeyyā."
    ],
    "innerText": "Ekādasāyatanā sappaccayā. Dhammāyatanaṃ siyā sappaccayaṃ, siyā appaccayaṃ. Ekādasāyatanā saṅkhatā. Dhammāyatanaṃ siyā saṅkhataṃ, siyā asaṅkhataṃ. Rūpāyatanaṃ sanidassanaṃ. Ekādasāyatanā anidassanā. Dasāyatanā sappaṭighā. Dvāyatanā appaṭighā. Dasāyatanā rūpā. Manāyatanaṃ arūpaṃ. Dhammāyatanaṃ siyā rūpaṃ, siyā arūpaṃ. Dasāyatanā lokiyā. Dvāyatanā siyā lokiyā, siyā lokuttarā; kenaci viññeyyā, kenaci na viññeyyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekādasāyatanā no āsavā. Dhammāyatanaṃ siyā āsavo, siyā no āsavo. Dasāyatanā sāsavā. Dvāyatanā siyā sāsavā, siyā anāsavā. Dasāyatanā āsavavippayuttā. Dvāyatanā siyā āsavasampayuttā, siyā āsavavippayuttā. Dasāyatanā na vattabbā – ‘‘āsavā ceva sāsavā cā’’ti, ‘‘sāsavā ceva no ca āsavā’’. Manāyatanaṃ na vattabbaṃ – ‘‘āsavo ceva sāsavañcā’’ti, siyā sāsavañceva no ca āsavo, siyā na vattabbaṃ – ‘‘sāsavañceva no ca āsavo’’ti. Dhammāyatanaṃ siyā āsavo ceva sāsavañca, siyā sāsavañceva no ca ",
      " āsavo, siyā na vattabbaṃ – ‘‘āsavo ceva sāsavañcā’’tipi, ‘‘sāsavañceva no ca āsavo’’tipi. Dasāyatanā na vattabbā – ‘‘āsavā ceva āsavasampayuttā cā’’tipi, ‘‘āsavasampayuttā ceva no ca āsavā’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘āsavo ceva āsavasampayuttañcā’’ti, siyā āsavasampayuttañceva no ca āsavo, siyā na vattabbaṃ – ‘‘āsavasampayuttañceva no ca āsavo’’ti. Dhammāyatanaṃ siyā ",
      " āsavo ceva āsavasampayuttañca, siyā āsavasampayuttañceva no ca āsavo, siyā na vattabbaṃ – ‘‘āsavo ceva āsavasampayuttañcā’’tipi, ‘‘āsavasampayuttañceva no ca āsavo’’tipi. Dasāyatanā āsavavippayuttasāsavā. Dvāyatanā siyā āsavavippayuttasāsavā, siyā āsavavippayuttaanāsavā, siyā na vattabbā – ‘‘āsavavippayuttasāsavā’’tipi, ‘‘āsavavippayuttaanāsavā’’tipi."
    ],
    "innerText": "Ekādasāyatanā no āsavā. Dhammāyatanaṃ siyā āsavo, siyā no āsavo. Dasāyatanā sāsavā. Dvāyatanā siyā sāsavā, siyā anāsavā. Dasāyatanā āsavavippayuttā. Dvāyatanā siyā āsavasampayuttā, siyā āsavavippayuttā. Dasāyatanā na vattabbā – ‘‘āsavā ceva sāsavā cā’’ti, ‘‘sāsavā ceva no ca āsavā’’. Manāyatanaṃ na vattabbaṃ – ‘‘āsavo ceva sāsavañcā’’ti, siyā sāsavañceva no ca āsavo, siyā na vattabbaṃ – ‘‘sāsavañceva no ca āsavo’’ti. Dhammāyatanaṃ siyā āsavo ceva sāsavañca, siyā sāsavañceva no ca āsavo, siyā na vattabbaṃ – ‘‘āsavo ceva sāsavañcā’’tipi, ‘‘sāsavañceva no ca āsavo’’tipi. Dasāyatanā na vattabbā – ‘‘āsavā ceva āsavasampayuttā cā’’tipi, ‘‘āsavasampayuttā ceva no ca āsavā’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘āsavo ceva āsavasampayuttañcā’’ti, siyā āsavasampayuttañceva no ca āsavo, siyā na vattabbaṃ – ‘‘āsavasampayuttañceva no ca āsavo’’ti. Dhammāyatanaṃ siyā āsavo ceva āsavasampayuttañca, siyā āsavasampayuttañceva no ca āsavo, siyā na vattabbaṃ – ‘‘āsavo ceva āsavasampayuttañcā’’tipi, ‘‘āsavasampayuttañceva no ca āsavo’’tipi. Dasāyatanā āsavavippayuttasāsavā. Dvāyatanā siyā āsavavippayuttasāsavā, siyā āsavavippayuttaanāsavā, siyā na vattabbā – ‘‘āsavavippayuttasāsavā’’tipi, ‘‘āsavavippayuttaanāsavā’’tipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekādasāyatanā no saṃyojanā. Dhammāyatanaṃ siyā saṃyojanaṃ, siyā no saṃyojanaṃ. Dasāyatanā saṃyojaniyā. Dvāyatanā siyā saṃyojaniyā, siyā asaṃyojaniyā. Dasāyatanā saṃyojanavippayuttā. Dvāyatanā siyā saṃyojanasampayuttā, siyā saṃyojanavippayuttā. Dasāyatanā na vattabbā – ‘‘saṃyojanā ceva saṃyojaniyā cā’’ti, saṃyojaniyā ceva no ca saṃyojanā. Manāyatanaṃ na vattabbaṃ – ‘‘saṃyojanañceva saṃyojaniyañcā’’ti, siyā saṃyojaniyañceva no ca saṃyojanaṃ, siyā na vattabbaṃ – ‘‘saṃyojaniyañceva no ca saṃyojana’’nti. Dhammāyatanaṃ ",
      " siyā saṃyojanañceva saṃyojaniyañca, siyā saṃyojaniyañceva no ca saṃyojanaṃ, siyā na vattabbaṃ – ‘‘saṃyojanañceva ",
      " saṃyojaniya’’ntipi, ‘‘saṃyojaniyañceva no ca saṃyojana’’ntipi. Dasāyatanā na vattabbā – ‘‘saṃyojanā ceva saṃyojanasampayuttā cā’’tipi, ‘‘saṃyojanasampayuttā ceva no ca saṃyojanā’’tipi. Manāyatanaṃ ",
      " na vattabbaṃ – ‘‘saṃyojanañceva saṃyojanasampayuttañcā’’ti, siyā saṃyojanasampayuttañceva no ca saṃyojanaṃ, siyā na vattabbaṃ – ‘‘saṃyojanasampayuttañceva no ca saṃyojana’’nti. Dhammāyatanaṃ siyā saṃyojanañceva saṃyojanasampayuttañca, siyā saṃyojanasampayuttañceva no ca saṃyojanaṃ, siyā na vattabbaṃ – ‘‘saṃyojanañceva saṃyojanasampayuttañcā’’tipi, ‘‘saṃyojanasampayuttañceva no ca saṃyojana’’ntipi. Dasāyatanā saṃyojanavippayuttasaṃyojaniyā ",
      ". Dvāyatanā siyā saṃyojanavippayuttasaṃyojaniyā, siyā saṃyojanavippayuttaasaṃyojaniyā, siyā na vattabbā – ‘‘saṃyojanavippayuttasaṃyojaniyā’’tipi, ‘‘saṃyojanavippayuttaasaṃyojaniyā’’tipi."
    ],
    "innerText": "Ekādasāyatanā no saṃyojanā. Dhammāyatanaṃ siyā saṃyojanaṃ, siyā no saṃyojanaṃ. Dasāyatanā saṃyojaniyā. Dvāyatanā siyā saṃyojaniyā, siyā asaṃyojaniyā. Dasāyatanā saṃyojanavippayuttā. Dvāyatanā siyā saṃyojanasampayuttā, siyā saṃyojanavippayuttā. Dasāyatanā na vattabbā – ‘‘saṃyojanā ceva saṃyojaniyā cā’’ti, saṃyojaniyā ceva no ca saṃyojanā. Manāyatanaṃ na vattabbaṃ – ‘‘saṃyojanañceva saṃyojaniyañcā’’ti, siyā saṃyojaniyañceva no ca saṃyojanaṃ, siyā na vattabbaṃ – ‘‘saṃyojaniyañceva no ca saṃyojana’’nti. Dhammāyatanaṃ siyā saṃyojanañceva saṃyojaniyañca, siyā saṃyojaniyañceva no ca saṃyojanaṃ, siyā na vattabbaṃ – ‘‘saṃyojanañceva saṃyojaniya’’ntipi, ‘‘saṃyojaniyañceva no ca saṃyojana’’ntipi. Dasāyatanā na vattabbā – ‘‘saṃyojanā ceva saṃyojanasampayuttā cā’’tipi, ‘‘saṃyojanasampayuttā ceva no ca saṃyojanā’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘saṃyojanañceva saṃyojanasampayuttañcā’’ti, siyā saṃyojanasampayuttañceva no ca saṃyojanaṃ, siyā na vattabbaṃ – ‘‘saṃyojanasampayuttañceva no ca saṃyojana’’nti. Dhammāyatanaṃ siyā saṃyojanañceva saṃyojanasampayuttañca, siyā saṃyojanasampayuttañceva no ca saṃyojanaṃ, siyā na vattabbaṃ – ‘‘saṃyojanañceva saṃyojanasampayuttañcā’’tipi, ‘‘saṃyojanasampayuttañceva no ca saṃyojana’’ntipi. Dasāyatanā saṃyojanavippayuttasaṃyojaniyā . Dvāyatanā siyā saṃyojanavippayuttasaṃyojaniyā, siyā saṃyojanavippayuttaasaṃyojaniyā, siyā na vattabbā – ‘‘saṃyojanavippayuttasaṃyojaniyā’’tipi, ‘‘saṃyojanavippayuttaasaṃyojaniyā’’tipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekādasāyatanā no ganthā. Dhammāyatanaṃ siyā gantho, siyā no gantho. Dasāyatanā ganthaniyā. Dvāyatanā siyā ganthaniyā, siyā aganthaniyā. Dasāyatanā ganthavippayuttā. Dvāyatanā siyā ganthasampayuttā, siyā ganthavippayuttā. Dasāyatanā na vattabbā – ‘‘ganthā ceva ganthaniyā cā’’ti, ganthaniyā ceva no ca ganthā. Manāyatanaṃ na vattabbaṃ ",
      " – ‘‘gantho ceva ganthaniyañcā’’ti, siyā ganthaniyañceva no ca gantho, siyā na vattabbaṃ – ‘‘ganthaniyañceva no ca gantho’’ti. Dhammāyatanaṃ siyā gantho ceva ganthaniyañca, siyā ganthaniyañceva no ca gantho, siyā na vattabbaṃ – ‘‘gantho ceva ganthaniyañcā’’tipi, ‘‘ganthaniyañceva no ca gantho’’tipi. Dasāyatanā na vattabbā – ‘‘ganthā ceva ganthasampayuttā cā’’tipi, ‘‘ganthasampayuttā ceva no ca ganthā’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘gantho ceva ganthasampayuttañcā’’ti, siyā ganthasampayuttañceva no ca gantho, siyā na vattabbaṃ – ‘‘ganthasampayuttañceva no ca gantho’’ti. Dhammāyatanaṃ siyā gantho ceva ganthasampayuttañca, siyā ganthasampayuttañceva no ca gantho, siyā na vattabbaṃ – ‘‘gantho ceva ganthasampayuttañcā’’tipi, ‘‘ganthasampayuttañceva no ca gantho’’tipi. Dasāyatanā ganthavippayuttaganthaniyā. Dvāyatanā siyā ganthavippayuttaganthaniyā, siyā ganthavippayuttaaganthaniyā, siyā na vattabbā – ‘‘ganthavippayuttaganthaniyā’’tipi, ‘‘ganthavippayuttaaganthaniyā’’tipi."
    ],
    "innerText": "Ekādasāyatanā no ganthā. Dhammāyatanaṃ siyā gantho, siyā no gantho. Dasāyatanā ganthaniyā. Dvāyatanā siyā ganthaniyā, siyā aganthaniyā. Dasāyatanā ganthavippayuttā. Dvāyatanā siyā ganthasampayuttā, siyā ganthavippayuttā. Dasāyatanā na vattabbā – ‘‘ganthā ceva ganthaniyā cā’’ti, ganthaniyā ceva no ca ganthā. Manāyatanaṃ na vattabbaṃ – ‘‘gantho ceva ganthaniyañcā’’ti, siyā ganthaniyañceva no ca gantho, siyā na vattabbaṃ – ‘‘ganthaniyañceva no ca gantho’’ti. Dhammāyatanaṃ siyā gantho ceva ganthaniyañca, siyā ganthaniyañceva no ca gantho, siyā na vattabbaṃ – ‘‘gantho ceva ganthaniyañcā’’tipi, ‘‘ganthaniyañceva no ca gantho’’tipi. Dasāyatanā na vattabbā – ‘‘ganthā ceva ganthasampayuttā cā’’tipi, ‘‘ganthasampayuttā ceva no ca ganthā’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘gantho ceva ganthasampayuttañcā’’ti, siyā ganthasampayuttañceva no ca gantho, siyā na vattabbaṃ – ‘‘ganthasampayuttañceva no ca gantho’’ti. Dhammāyatanaṃ siyā gantho ceva ganthasampayuttañca, siyā ganthasampayuttañceva no ca gantho, siyā na vattabbaṃ – ‘‘gantho ceva ganthasampayuttañcā’’tipi, ‘‘ganthasampayuttañceva no ca gantho’’tipi. Dasāyatanā ganthavippayuttaganthaniyā. Dvāyatanā siyā ganthavippayuttaganthaniyā, siyā ganthavippayuttaaganthaniyā, siyā na vattabbā – ‘‘ganthavippayuttaganthaniyā’’tipi, ‘‘ganthavippayuttaaganthaniyā’’tipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekādasāyatanā no oghā…pe… no yogā…pe… no nīvaraṇā. Dhammāyatanaṃ siyā ",
      " nīvaraṇaṃ, siyā no nīvaraṇaṃ. Dasāyatanā nīvaraṇiyā. Dvāyatanā siyā ",
      " nīvaraṇiyā, siyā anīvaraṇiyā. Dasāyatanā nīvaraṇavippayuttā. Dvāyatanā siyā nīvaraṇasampayuttā, siyā nīvaraṇavippayuttā. Dasāyatanā na vattabbā – ‘‘nīvaraṇā ceva nīvaraṇiyā cā’’ti, nīvaraṇiyā ceva no ca nīvaraṇā. Manāyatanaṃ na vattabbaṃ – ‘‘nīvaraṇañceva nīvaraṇiyañcā’’ti ",
      ", siyā nīvaraṇiyañceva no ca nīvaraṇaṃ, siyā na vattabbaṃ – ‘‘nīvaraṇiyañceva no ca nīvaraṇa’’nti. Dhammāyatanaṃ siyā nīvaraṇañceva nīvaraṇiyañca, siyā nīvaraṇiyañceva no ca nīvaraṇaṃ, siyā ",
      " na vattabbaṃ – ‘‘nīvaraṇañceva nīvaraṇiyañcā’’tipi, ‘‘nīvaraṇiyañceva no ca nīvaraṇa’’ntipi. Dasāyatanā na vattabbā – ‘‘nīvaraṇā ceva nīvaraṇasampayuttā cā’’tipi, ‘‘nīvaraṇasampayuttā ceva no ca nīvaraṇā’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘nīvaraṇañceva nīvaraṇasampayuttañcā’’ti, siyā nīvaraṇasampayuttañceva no ca nīvaraṇaṃ, siyā na vattabbaṃ – ‘‘nīvaraṇasampayuttañceva no ca nīvaraṇa’’nti. Dhammāyatanaṃ siyā nīvaraṇañceva nīvaraṇasampayuttañca, siyā nīvaraṇasampayuttañceva no ca nīvaraṇaṃ, siyā na vattabbaṃ – ‘‘nīvaraṇañceva nīvaraṇasampayuttañcā’’tipi, ‘‘nīvaraṇasampayuttañceva no ca nīvaraṇa’’ntipi. Dasāyatanā nīvaraṇavippayuttanīvaraṇiyā. Dvāyatanā siyā nīvaraṇavippayuttanīvaraṇiyā, siyā nīvaraṇavippayuttaanīvaraṇiyā, siyā na vattabbā – ‘‘nīvaraṇavippayuttanīvaraṇiyā’’tipi, ‘‘nīvaraṇavippayuttaanīvaraṇiyā’’tipi."
    ],
    "innerText": "Ekādasāyatanā no oghā…pe… no yogā…pe… no nīvaraṇā. Dhammāyatanaṃ siyā nīvaraṇaṃ, siyā no nīvaraṇaṃ. Dasāyatanā nīvaraṇiyā. Dvāyatanā siyā nīvaraṇiyā, siyā anīvaraṇiyā. Dasāyatanā nīvaraṇavippayuttā. Dvāyatanā siyā nīvaraṇasampayuttā, siyā nīvaraṇavippayuttā. Dasāyatanā na vattabbā – ‘‘nīvaraṇā ceva nīvaraṇiyā cā’’ti, nīvaraṇiyā ceva no ca nīvaraṇā. Manāyatanaṃ na vattabbaṃ – ‘‘nīvaraṇañceva nīvaraṇiyañcā’’ti , siyā nīvaraṇiyañceva no ca nīvaraṇaṃ, siyā na vattabbaṃ – ‘‘nīvaraṇiyañceva no ca nīvaraṇa’’nti. Dhammāyatanaṃ siyā nīvaraṇañceva nīvaraṇiyañca, siyā nīvaraṇiyañceva no ca nīvaraṇaṃ, siyā na vattabbaṃ – ‘‘nīvaraṇañceva nīvaraṇiyañcā’’tipi, ‘‘nīvaraṇiyañceva no ca nīvaraṇa’’ntipi. Dasāyatanā na vattabbā – ‘‘nīvaraṇā ceva nīvaraṇasampayuttā cā’’tipi, ‘‘nīvaraṇasampayuttā ceva no ca nīvaraṇā’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘nīvaraṇañceva nīvaraṇasampayuttañcā’’ti, siyā nīvaraṇasampayuttañceva no ca nīvaraṇaṃ, siyā na vattabbaṃ – ‘‘nīvaraṇasampayuttañceva no ca nīvaraṇa’’nti. Dhammāyatanaṃ siyā nīvaraṇañceva nīvaraṇasampayuttañca, siyā nīvaraṇasampayuttañceva no ca nīvaraṇaṃ, siyā na vattabbaṃ – ‘‘nīvaraṇañceva nīvaraṇasampayuttañcā’’tipi, ‘‘nīvaraṇasampayuttañceva no ca nīvaraṇa’’ntipi. Dasāyatanā nīvaraṇavippayuttanīvaraṇiyā. Dvāyatanā siyā nīvaraṇavippayuttanīvaraṇiyā, siyā nīvaraṇavippayuttaanīvaraṇiyā, siyā na vattabbā – ‘‘nīvaraṇavippayuttanīvaraṇiyā’’tipi, ‘‘nīvaraṇavippayuttaanīvaraṇiyā’’tipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekādasāyatanā no parāmāsā. Dhammāyatanaṃ siyā parāmāso, siyā no parāmāso. Dasāyatanā parāmaṭṭhā. Dvāyatanā siyā parāmaṭṭhā, siyā aparāmaṭṭhā. Dasāyatanā parāmāsavippayuttā. Manāyatanaṃ siyā parāmāsasampayuttaṃ, siyā parāmāsavippayuttaṃ. Dhammāyatanaṃ siyā parāmāsasampayuttaṃ, siyā parāmāsavippayuttaṃ, siyā na vattabbaṃ – ‘‘parāmāsasampayutta’’ntipi, ‘‘parāmāsavippayutta’’ntipi. Dasāyatanā na ",
      " vattabbā – ‘‘parāmāsā ceva parāmaṭṭhā cā’’ti, ‘‘parāmaṭṭhā ceva no ca parāmāsā’’. Manāyatanaṃ na vattabbaṃ – ‘‘parāmāso ceva parāmaṭṭhañcā’’ti, siyā parāmaṭṭhañceva no ca parāmāso, siyā na vattabbaṃ – ‘‘parāmaṭṭhañceva no ca parāmāso’’ti. Dhammāyatanaṃ siyā parāmāso ceva parāmaṭṭhañca, siyā parāmaṭṭhañceva no ca parāmāso, siyā na vattabbaṃ – ‘‘parāmāso ceva parāmaṭṭhañcā’’tipi, ‘‘parāmaṭṭhañceva no ca parāmāso’’tipi. Dasāyatanā parāmāsavippayuttaparāmaṭṭhā. Dvāyatanā siyā parāmāsavippayuttaparāmaṭṭhā ",
      ", siyā parāmāsavippayuttaaparāmaṭṭhā, siyā na vattabbā – ‘‘parāmāsavippayuttaparāmaṭṭhā’’tipi ",
      ", ‘‘parāmāsavippayuttaaparāmaṭṭhā’’tipi."
    ],
    "innerText": "Ekādasāyatanā no parāmāsā. Dhammāyatanaṃ siyā parāmāso, siyā no parāmāso. Dasāyatanā parāmaṭṭhā. Dvāyatanā siyā parāmaṭṭhā, siyā aparāmaṭṭhā. Dasāyatanā parāmāsavippayuttā. Manāyatanaṃ siyā parāmāsasampayuttaṃ, siyā parāmāsavippayuttaṃ. Dhammāyatanaṃ siyā parāmāsasampayuttaṃ, siyā parāmāsavippayuttaṃ, siyā na vattabbaṃ – ‘‘parāmāsasampayutta’’ntipi, ‘‘parāmāsavippayutta’’ntipi. Dasāyatanā na vattabbā – ‘‘parāmāsā ceva parāmaṭṭhā cā’’ti, ‘‘parāmaṭṭhā ceva no ca parāmāsā’’. Manāyatanaṃ na vattabbaṃ – ‘‘parāmāso ceva parāmaṭṭhañcā’’ti, siyā parāmaṭṭhañceva no ca parāmāso, siyā na vattabbaṃ – ‘‘parāmaṭṭhañceva no ca parāmāso’’ti. Dhammāyatanaṃ siyā parāmāso ceva parāmaṭṭhañca, siyā parāmaṭṭhañceva no ca parāmāso, siyā na vattabbaṃ – ‘‘parāmāso ceva parāmaṭṭhañcā’’tipi, ‘‘parāmaṭṭhañceva no ca parāmāso’’tipi. Dasāyatanā parāmāsavippayuttaparāmaṭṭhā. Dvāyatanā siyā parāmāsavippayuttaparāmaṭṭhā , siyā parāmāsavippayuttaaparāmaṭṭhā, siyā na vattabbā – ‘‘parāmāsavippayuttaparāmaṭṭhā’’tipi , ‘‘parāmāsavippayuttaaparāmaṭṭhā’’tipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dasāyatanā anārammaṇā. Manāyatanaṃ sārammaṇaṃ. Dhammāyatanaṃ siyā sārammaṇaṃ, siyā anārammaṇaṃ. Manāyatanaṃ cittaṃ. Ekādasāyatanā no cittā. Ekādasāyatanā acetasikā. Dhammāyatanaṃ siyā cetasikaṃ, siyā acetasikaṃ. Dasāyatanā cittavippayuttā. Dhammāyatanaṃ siyā cittasampayuttaṃ, siyā cittavippayuttaṃ. Manāyatanaṃ na vattabbaṃ – ‘‘cittena sampayutta’’ntipi ",
      ", ‘‘cittena vippayutta’’ntipi. Dasāyatanā cittavisaṃsaṭṭhā. Dhammāyatanaṃ siyā cittasaṃsaṭṭhaṃ, siyā cittavisaṃsaṭṭhaṃ. Manāyatanaṃ na vattabbaṃ – ‘‘cittena saṃsaṭṭha’’ntipi, ‘‘cittena visaṃsaṭṭha’’ntipi. Chāyatanā no cittasamuṭṭhānā. Chāyatanā siyā cittasamuṭṭhānā, siyā no cittasamuṭṭhānā. Ekādasāyatanā no cittasahabhuno. Dhammāyatanaṃ siyā cittasahabhū ",
      ", siyā no cittasahabhū. Ekādasāyatanā no cittānuparivattino. Dhammāyatanaṃ siyā cittānuparivatti, siyā no cittānuparivatti. Ekādasāyatanā no cittasaṃsaṭṭhasamuṭṭhānā. Dhammāyatanaṃ siyā cittasaṃsaṭṭhasamuṭṭhānaṃ, siyā no cittasaṃsaṭṭhasamuṭṭhānaṃ. Ekādasāyatanā no cittasaṃsaṭṭhasamuṭṭhānasahabhuno. Dhammāyatanaṃ siyā cittasaṃsaṭṭhasamuṭṭhānasahabhū, siyā no cittasaṃsaṭṭhasamuṭṭhānasahabhū. Ekādasāyatanā no cittasaṃsaṭṭhasamuṭṭhānānuparivattino. Dhammāyatanaṃ siyā cittasaṃsaṭṭhasamuṭṭhānānuparivatti, siyā no cittasaṃsaṭṭhasamuṭṭhānānuparivatti."
    ],
    "innerText": "Dasāyatanā anārammaṇā. Manāyatanaṃ sārammaṇaṃ. Dhammāyatanaṃ siyā sārammaṇaṃ, siyā anārammaṇaṃ. Manāyatanaṃ cittaṃ. Ekādasāyatanā no cittā. Ekādasāyatanā acetasikā. Dhammāyatanaṃ siyā cetasikaṃ, siyā acetasikaṃ. Dasāyatanā cittavippayuttā. Dhammāyatanaṃ siyā cittasampayuttaṃ, siyā cittavippayuttaṃ. Manāyatanaṃ na vattabbaṃ – ‘‘cittena sampayutta’’ntipi , ‘‘cittena vippayutta’’ntipi. Dasāyatanā cittavisaṃsaṭṭhā. Dhammāyatanaṃ siyā cittasaṃsaṭṭhaṃ, siyā cittavisaṃsaṭṭhaṃ. Manāyatanaṃ na vattabbaṃ – ‘‘cittena saṃsaṭṭha’’ntipi, ‘‘cittena visaṃsaṭṭha’’ntipi. Chāyatanā no cittasamuṭṭhānā. Chāyatanā siyā cittasamuṭṭhānā, siyā no cittasamuṭṭhānā. Ekādasāyatanā no cittasahabhuno. Dhammāyatanaṃ siyā cittasahabhū , siyā no cittasahabhū. Ekādasāyatanā no cittānuparivattino. Dhammāyatanaṃ siyā cittānuparivatti, siyā no cittānuparivatti. Ekādasāyatanā no cittasaṃsaṭṭhasamuṭṭhānā. Dhammāyatanaṃ siyā cittasaṃsaṭṭhasamuṭṭhānaṃ, siyā no cittasaṃsaṭṭhasamuṭṭhānaṃ. Ekādasāyatanā no cittasaṃsaṭṭhasamuṭṭhānasahabhuno. Dhammāyatanaṃ siyā cittasaṃsaṭṭhasamuṭṭhānasahabhū, siyā no cittasaṃsaṭṭhasamuṭṭhānasahabhū. Ekādasāyatanā no cittasaṃsaṭṭhasamuṭṭhānānuparivattino. Dhammāyatanaṃ siyā cittasaṃsaṭṭhasamuṭṭhānānuparivatti, siyā no cittasaṃsaṭṭhasamuṭṭhānānuparivatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Chāyatanā ajjhattikā. Chāyatanā bāhirā. Navāyatanā upādā. Dvāyatanā no upādā. Dhammāyatanaṃ siyā upādā, siyā no upādā. Pañcāyatanā upādinnā. Saddāyatanaṃ anupādinnaṃ. Chāyatanā siyā upādinnā, siyā anupādinnā. Ekādasāyatanā no upādānā. Dhammāyatanaṃ siyā upādānaṃ, siyā no upādānaṃ. Dasāyatanā upādāniyā. Dvāyatanā siyā upādāniyā, siyā anupādāniyā. Dasāyatanā upādānavippayuttā. Dvāyatanā siyā upādānasampayuttā, siyā upādānavippayuttā. Dasāyatanā na vattabbā – ‘‘upādānā ceva upādāniyā cā’’ti, upādāniyā ceva no ca upādānā. Manāyatanaṃ na vattabbaṃ – ‘‘upādānañceva upādāniyañcā’’ti, siyā upādāniyañceva no ca upādānaṃ, siyā na vattabbaṃ – ‘‘upādāniyañceva no ca upādāna’’nti. Dhammāyatanaṃ siyā upādānañceva ",
      " upādāniyañca, siyā upādāniyañceva no ca upādānaṃ, siyā na vattabbaṃ – ‘‘upādānañceva ",
      " upādāniyañcā’’tipi, ‘‘upādāniyañceva no ca upādāna’’ntipi. Dasāyatanā na vattabbā – ‘‘upādānā ceva upādānasampayuttā cā’’tipi, ‘‘upādānasampayuttā ceva no ca upādānā’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘upādāniyañceva upādānasampayuttañcā’’ti, siyā upādānasampayuttañceva no ca upādānaṃ, siyā na vattabbaṃ – ‘‘upādānasampayuttañceva no ca upādāna’’nti. Dhammāyatanaṃ siyā upādānañceva upādānasampayuttañca, siyā upādānasampayuttañceva no ca upādānaṃ ",
      ", siyā na vattabbaṃ – ‘‘upādānañceva upādānasampayuttañcā’’tipi, ‘‘upādānasampayuttañceva no ca upādāna’’ntipi. Dasāyatanā upādānavippayuttaupādāniyā. Dvāyatanā siyā upādānasampayuttaupādāniyā, siyā upādānavippayuttaanupādāniyā, siyā na vattabbā – ‘‘upādānavippayuttaupādāniyā’’tipi, ‘‘upādānavippayuttaanupādāniyā’’tipi."
    ],
    "innerText": "Chāyatanā ajjhattikā. Chāyatanā bāhirā. Navāyatanā upādā. Dvāyatanā no upādā. Dhammāyatanaṃ siyā upādā, siyā no upādā. Pañcāyatanā upādinnā. Saddāyatanaṃ anupādinnaṃ. Chāyatanā siyā upādinnā, siyā anupādinnā. Ekādasāyatanā no upādānā. Dhammāyatanaṃ siyā upādānaṃ, siyā no upādānaṃ. Dasāyatanā upādāniyā. Dvāyatanā siyā upādāniyā, siyā anupādāniyā. Dasāyatanā upādānavippayuttā. Dvāyatanā siyā upādānasampayuttā, siyā upādānavippayuttā. Dasāyatanā na vattabbā – ‘‘upādānā ceva upādāniyā cā’’ti, upādāniyā ceva no ca upādānā. Manāyatanaṃ na vattabbaṃ – ‘‘upādānañceva upādāniyañcā’’ti, siyā upādāniyañceva no ca upādānaṃ, siyā na vattabbaṃ – ‘‘upādāniyañceva no ca upādāna’’nti. Dhammāyatanaṃ siyā upādānañceva upādāniyañca, siyā upādāniyañceva no ca upādānaṃ, siyā na vattabbaṃ – ‘‘upādānañceva upādāniyañcā’’tipi, ‘‘upādāniyañceva no ca upādāna’’ntipi. Dasāyatanā na vattabbā – ‘‘upādānā ceva upādānasampayuttā cā’’tipi, ‘‘upādānasampayuttā ceva no ca upādānā’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘upādāniyañceva upādānasampayuttañcā’’ti, siyā upādānasampayuttañceva no ca upādānaṃ, siyā na vattabbaṃ – ‘‘upādānasampayuttañceva no ca upādāna’’nti. Dhammāyatanaṃ siyā upādānañceva upādānasampayuttañca, siyā upādānasampayuttañceva no ca upādānaṃ , siyā na vattabbaṃ – ‘‘upādānañceva upādānasampayuttañcā’’tipi, ‘‘upādānasampayuttañceva no ca upādāna’’ntipi. Dasāyatanā upādānavippayuttaupādāniyā. Dvāyatanā siyā upādānasampayuttaupādāniyā, siyā upādānavippayuttaanupādāniyā, siyā na vattabbā – ‘‘upādānavippayuttaupādāniyā’’tipi, ‘‘upādānavippayuttaanupādāniyā’’tipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekādasāyatanā no kilesā. Dhammāyatanaṃ siyā kileso, siyā no kileso. Dasāyatanā saṃkilesikā. Dvāyatanā siyā saṃkilesikā, siyā asaṃkilesikā. Dasāyatanā asaṃkiliṭṭhā. Dvāyatanā siyā saṃkiliṭṭhā, siyā asaṃkiliṭṭhā. Dasāyatanā kilesavippayuttā. Dvāyatanā siyā kilesasampayuttā, siyā kilesavippayuttā. Dasāyatanā na vattabbā – ‘‘kilesā ceva saṃkilesikā cā’’ti, ‘‘saṃkilesikā ceva no ca kilesā’’. Manāyatanaṃ na vattabbaṃ – ‘‘kileso ceva saṃkilesikañcā’’ti, siyā saṃkilesikañceva no ca kileso, siyā na vattabbaṃ – ‘‘saṃkilesikañceva no ca kileso’’ti. Dhammāyatanaṃ siyā kileso ceva saṃkilesikañca, siyā saṃkilesikañceva no ca kileso, siyā na vattabbaṃ – ‘‘kileso ceva saṃkilesikañcā’’tipi, ‘‘saṃkilesikañceva no ca kileso’’tipi. Dasāyatanā na vattabbā – ‘‘kilesā ceva saṃkiliṭṭhā cā’’tipi, ‘‘saṃkiliṭṭhā ceva no ca ",
      " kilesā’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘kileso ceva saṃkiliṭṭhañcā’’ti, siyā saṃkiliṭṭhañceva no ca kileso, siyā na vattabbaṃ – ‘‘saṃkiliṭṭhañceva no ca kileso’’ti. Dhammāyatanaṃ siyā kileso ceva saṃkiliṭṭhañca, siyā saṃkiliṭṭhañceva no ca kileso, siyā na vattabbaṃ – ‘‘kileso ceva saṃkiliṭṭhañcā’’tipi, ‘‘saṃkiliṭṭhañceva no ca kileso’’tipi."
    ],
    "innerText": "Ekādasāyatanā no kilesā. Dhammāyatanaṃ siyā kileso, siyā no kileso. Dasāyatanā saṃkilesikā. Dvāyatanā siyā saṃkilesikā, siyā asaṃkilesikā. Dasāyatanā asaṃkiliṭṭhā. Dvāyatanā siyā saṃkiliṭṭhā, siyā asaṃkiliṭṭhā. Dasāyatanā kilesavippayuttā. Dvāyatanā siyā kilesasampayuttā, siyā kilesavippayuttā. Dasāyatanā na vattabbā – ‘‘kilesā ceva saṃkilesikā cā’’ti, ‘‘saṃkilesikā ceva no ca kilesā’’. Manāyatanaṃ na vattabbaṃ – ‘‘kileso ceva saṃkilesikañcā’’ti, siyā saṃkilesikañceva no ca kileso, siyā na vattabbaṃ – ‘‘saṃkilesikañceva no ca kileso’’ti. Dhammāyatanaṃ siyā kileso ceva saṃkilesikañca, siyā saṃkilesikañceva no ca kileso, siyā na vattabbaṃ – ‘‘kileso ceva saṃkilesikañcā’’tipi, ‘‘saṃkilesikañceva no ca kileso’’tipi. Dasāyatanā na vattabbā – ‘‘kilesā ceva saṃkiliṭṭhā cā’’tipi, ‘‘saṃkiliṭṭhā ceva no ca kilesā’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘kileso ceva saṃkiliṭṭhañcā’’ti, siyā saṃkiliṭṭhañceva no ca kileso, siyā na vattabbaṃ – ‘‘saṃkiliṭṭhañceva no ca kileso’’ti. Dhammāyatanaṃ siyā kileso ceva saṃkiliṭṭhañca, siyā saṃkiliṭṭhañceva no ca kileso, siyā na vattabbaṃ – ‘‘kileso ceva saṃkiliṭṭhañcā’’tipi, ‘‘saṃkiliṭṭhañceva no ca kileso’’tipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dasāyatanā na vattabbā – ‘‘kilesā ceva kilesasampayuttā cā’’tipi, ‘‘kilesasampayuttā ceva no ca na kilesā’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘kileso ceva kilesasampayuttañcā’’ti ",
      ", siyā kilesasampayuttañceva no ca kileso, siyā na vattabbaṃ – ‘‘kilesasampayuttañceva no ca kileso’’ti. Dhammāyatanaṃ siyā kileso ceva kilesasampayuttañca, siyā kilesasampayuttañceva no ca kileso, siyā na vattabbaṃ – ‘‘kileso ceva kilesasampayuttañcā’’tipi, ‘‘kilesasampayuttañceva no ",
      " ca kileso’’tipi. Dasāyatanā kilesavippayuttasaṃkilesikā. Dvāyatanā siyā kilesavippayuttasaṃkilesikā, siyā kilesavippayuttaasaṃkilesikā ",
      ", siyā na vattabbā – ‘‘kilesavippayuttasaṃkilesikā’’tipi, ‘‘kilesavippayuttaasaṃkilesikā’’tipi ",
      "."
    ],
    "innerText": "Dasāyatanā na vattabbā – ‘‘kilesā ceva kilesasampayuttā cā’’tipi, ‘‘kilesasampayuttā ceva no ca na kilesā’’tipi. Manāyatanaṃ na vattabbaṃ – ‘‘kileso ceva kilesasampayuttañcā’’ti , siyā kilesasampayuttañceva no ca kileso, siyā na vattabbaṃ – ‘‘kilesasampayuttañceva no ca kileso’’ti. Dhammāyatanaṃ siyā kileso ceva kilesasampayuttañca, siyā kilesasampayuttañceva no ca kileso, siyā na vattabbaṃ – ‘‘kileso ceva kilesasampayuttañcā’’tipi, ‘‘kilesasampayuttañceva no ca kileso’’tipi. Dasāyatanā kilesavippayuttasaṃkilesikā. Dvāyatanā siyā kilesavippayuttasaṃkilesikā, siyā kilesavippayuttaasaṃkilesikā , siyā na vattabbā – ‘‘kilesavippayuttasaṃkilesikā’’tipi, ‘‘kilesavippayuttaasaṃkilesikā’’tipi ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dasāyatanā na dassanena pahātabbā. Dvāyatanā siyā dassanena pahātabbā, siyā na dassanena pahātabbā. Dasāyatanā na bhāvanāya pahātabbā. Dvāyatanā siyā bhāvanāya pahātabbā, siyā na bhāvanāya pahātabbā. Dasāyatanā na dassanena pahātabbahetukā. Dvāyatanā siyā dassanena pahātabbahetukā, siyā na dassanena pahātabbahetukā. Dasāyatanā na bhāvanāya pahātabbahetukā. Dvāyatanā siyā bhāvanāya pahātabbahetukā, siyā na bhāvanāya pahātabbahetukā. Dasāyatanā avitakkā. Dvāyatanā siyā savitakkā, siyā avitakkā. Dasāyatanā avicārā. Dvāyatanā siyā savicārā, siyā avicārā. Dasāyatanā appītikā. Dvāyatanā siyā sappītikā, siyā appītikā. Dasāyatanā na pītisahagatā. Dvāyatanā siyā pītisahagatā, siyā na pītisahagatā. Dasāyatanā na sukhasahagatā. Dvāyatanā siyā sukhasahagatā, siyā na sukhasahagatā. Dasāyatanā na upekkhāsahagatā. Dvāyatanā siyā upekkhāsahagatā, siyā na upekkhāsahagatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dasāyatanā kāmāvacarā. Dvāyatanā siyā kāmāvacarā, siyā na kāmāvacarā. Dasāyatanā na rūpāvacarā. Dvāyatanā siyā rūpāvacarā, siyā na rūpāvacarā. Dasāyatanā na arūpāvacarā. Dvāyatanā siyā arūpāvacarā, siyā na arūpāvacarā. Dasāyatanā pariyāpannā. Dvāyatanā siyā pariyāpannā, siyā apariyāpannā. Dasāyatanā aniyyānikā. Dvāyatanā siyā niyyānikā ",
      ", siyā aniyyānikā. Dasāyatanā aniyatā. Dvāyatanā siyā niyatā, siyā aniyatā. Dasāyatanā sauttarā. Dvāyatanā siyā sauttarā, siyā anuttarā. Dasāyatanā araṇā. Dvāyatanā siyā saraṇā, siyā araṇāti."
    ],
    "innerText": "Dasāyatanā kāmāvacarā. Dvāyatanā siyā kāmāvacarā, siyā na kāmāvacarā. Dasāyatanā na rūpāvacarā. Dvāyatanā siyā rūpāvacarā, siyā na rūpāvacarā. Dasāyatanā na arūpāvacarā. Dvāyatanā siyā arūpāvacarā, siyā na arūpāvacarā. Dasāyatanā pariyāpannā. Dvāyatanā siyā pariyāpannā, siyā apariyāpannā. Dasāyatanā aniyyānikā. Dvāyatanā siyā niyyānikā , siyā aniyyānikā. Dasāyatanā aniyatā. Dvāyatanā siyā niyatā, siyā aniyatā. Dasāyatanā sauttarā. Dvāyatanā siyā sauttarā, siyā anuttarā. Dasāyatanā araṇā. Dvāyatanā siyā saraṇā, siyā araṇāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañhāpucchakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Āyatanavibhaṅgo niṭṭhito."
  }
]