[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Niddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paṭhamanayo saṅgahāsaṅgahapadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Khandhapadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". Idāni ",
      " pañcakkhandhādivasena nikkhittamātikaṃ ‘saṅgaho asaṅgaho’tiādīhi nayamātikāpadehi saddhiṃ yojetvā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpakkhandho katihi khandhehī"
      },
      "tiādinā ",
      " nayena niddesavāro āraddho. Tattha yasmā ‘‘saṅgaho asaṅgahotiādikāya nayamātikāya ‘‘tīhi saṅgaho, tīhi asaṅgaho’’ti nayamukhamātikā ṭhapitā, tasmā rūpakkhandhādīnaṃ saṅgahaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "katihi khandhehi katihāyatanehi katihi dhātūhī"
      },
      "ti tīṇi khandhāyatanadhātupadāneva uddhaṭāni. ‘Cattāri saccānī’tiādīsu ekampi na parāmaṭṭhaṃ. Yasmā ca ‘‘sabhāgo visabhāgo’’ti evaṃ lakkhaṇamātikā ṭhapitā, tasmā imassa pañhassa vissajjane ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpakkhandho ekena khandhenā"
      },
      "tiādi vuttaṃ. Sabhāgā hi tassa ete khandhādayoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekena khandhenā"
      },
      "ti rūpakkhandheneva. Yañhi kiñci rūpaṃ rūpakkhandhasabhāgattā rūpakkhandhotveva saṅgahaṃ gacchatīti rūpakkhandheneva gaṇitaṃ, taṃ rūpakkhandheneva paricchinnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekādasahāyatanehī"
      },
      "ti manāyatanavajjehi. Sabbopi hi rūpakkhandho dasāyatanāni dhammāyatanekadeso ca hoti, tasmā ekādasahāyatanehi gaṇito ",
      ", paricchinno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekādasahi dhātūhī"
      },
      "ti sattaviññāṇadhātuvajjāhi ekādasahi etāsu hi apariyāpannaṃ rūpaṃ nāma natthi."
    ],
    "innerText": "6. Idāni pañcakkhandhādivasena nikkhittamātikaṃ ‘saṅgaho asaṅgaho’tiādīhi nayamātikāpadehi saddhiṃ yojetvā dassetuṃ rūpakkhandho katihi khandhehītiādinā nayena niddesavāro āraddho. Tattha yasmā ‘‘saṅgaho asaṅgahotiādikāya nayamātikāya ‘‘tīhi saṅgaho, tīhi asaṅgaho’’ti nayamukhamātikā ṭhapitā, tasmā rūpakkhandhādīnaṃ saṅgahaṃ dassetuṃ katihi khandhehi katihāyatanehi katihi dhātūhīti tīṇi khandhāyatanadhātupadāneva uddhaṭāni. ‘Cattāri saccānī’tiādīsu ekampi na parāmaṭṭhaṃ. Yasmā ca ‘‘sabhāgo visabhāgo’’ti evaṃ lakkhaṇamātikā ṭhapitā, tasmā imassa pañhassa vissajjane rūpakkhandho ekena khandhenātiādi vuttaṃ. Sabhāgā hi tassa ete khandhādayoti. Tattha ekena khandhenāti rūpakkhandheneva. Yañhi kiñci rūpaṃ rūpakkhandhasabhāgattā rūpakkhandhotveva saṅgahaṃ gacchatīti rūpakkhandheneva gaṇitaṃ, taṃ rūpakkhandheneva paricchinnaṃ. Ekādasahāyatanehīti manāyatanavajjehi. Sabbopi hi rūpakkhandho dasāyatanāni dhammāyatanekadeso ca hoti, tasmā ekādasahāyatanehi gaṇito , paricchinno. Ekādasahi dhātūhīti sattaviññāṇadhātuvajjāhi ekādasahi etāsu hi apariyāpannaṃ rūpaṃ nāma natthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Asaṅgahanayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "katihi asaṅgahito"
      },
      "ti saṅkhepeneva pucchā katā. Vissajjane panassa yasmā rūpakkhandhassa visabhāgā cattāro arūpakkhandhā, ekaṃ manāyatanaṃ, satta viññāṇadhātuyo; tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catūhi khandhehī"
      },
      "tiādi vuttaṃ. Iminā nayena sabbapadesu saṅgahāsaṅgaho veditabbo. Imasmiṃ pana khandhaniddese – ‘‘rūpakkhandho katihi khandhehī’’tiādimhi tāva ekamūlake saṅgahanaye sarūpeneva dassitā pañca pucchā, pañca vissajjanāni. Asaṅgahanaye saṅkhepena dassitā pañca pucchā, pañca vissajjanāni. Iminā upāyena dukamūlakādīsupi pucchāvissajjanāni ",
      " veditabbāni. Rūpakkhandhamūlakāyeva cettha dukatikacatukkā dassitā. Pañcake pana ‘‘rūpakkhandho ",
      " ca…pe… viññāṇakkhandho cā’’ti evaṃ bhedato ca, ‘‘pañcakkhandhā katihi khandhehī’’ti evaṃ abhedato cāti dvidhā pucchāvissajjanāni katāni. Evaṃ pāḷinayo veditabboti."
    ],
    "innerText": "Asaṅgahanayaniddese katihi asaṅgahitoti saṅkhepeneva pucchā katā. Vissajjane panassa yasmā rūpakkhandhassa visabhāgā cattāro arūpakkhandhā, ekaṃ manāyatanaṃ, satta viññāṇadhātuyo; tasmā catūhi khandhehītiādi vuttaṃ. Iminā nayena sabbapadesu saṅgahāsaṅgaho veditabbo. Imasmiṃ pana khandhaniddese – ‘‘rūpakkhandho katihi khandhehī’’tiādimhi tāva ekamūlake saṅgahanaye sarūpeneva dassitā pañca pucchā, pañca vissajjanāni. Asaṅgahanaye saṅkhepena dassitā pañca pucchā, pañca vissajjanāni. Iminā upāyena dukamūlakādīsupi pucchāvissajjanāni veditabbāni. Rūpakkhandhamūlakāyeva cettha dukatikacatukkā dassitā. Pañcake pana ‘‘rūpakkhandho ca…pe… viññāṇakkhandho cā’’ti evaṃ bhedato ca, ‘‘pañcakkhandhā katihi khandhehī’’ti evaṃ abhedato cāti dvidhā pucchāvissajjanāni katāni. Evaṃ pāḷinayo veditabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Āyatanapadādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". Āyatanapadaniddesādīsu āyatanapadaniddese tāva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhāyatanaṃ ekena khandhenā"
      },
      "ti ekena rūpakkhandheneva, ekena cakkhāyataneneva ekāya cakkhudhātuyāva saṅgahitanti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sotāyatanā"
      },
      "dīsupi imināva nayena saṅgahāsaṅgaho veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaṅkhataṃ khandhato ṭhapetvā"
      },
      "ti ettha pana yasmā asaṅkhataṃ dhammāyatanaṃ nāma nibbānaṃ, tañca khandhasaṅgahaṃ na gacchati; tasmā ‘khandhato ṭhapetvā’ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catūhi khandhehī"
      },
      "ti rūpavedanāsaññāsaṅkhārakkhandhehi. Nibbānavajjañhi dhammāyatanaṃ etehi saṅgahitaṃ. Viññāṇakkhandhena pana ṭhapetvā dhammāyatanadhammadhātuyo sesāyatanadhātūhi ca taṃ na saṅgayhati. Tena vuttaṃ – ‘‘ekena khandhena, ekādasahāyatanehi, sattarasahi dhātūhi asaṅgahita’’nti. Yathā ca te heṭṭhā rūpakkhandhamūlakā, evamidhāpi cakkhāyatanamūlakāva nayā veditabbā. Dukamattameva pana pāḷiyaṃ dassetvā ‘‘dvādasāyatanānī’’ti abhedatova pucchāvissajjanaṃ kataṃ. Dhātuniddesepi eseva nayo."
    ],
    "innerText": "22. Āyatanapadaniddesādīsu āyatanapadaniddese tāva cakkhāyatanaṃ ekena khandhenāti ekena rūpakkhandheneva, ekena cakkhāyataneneva ekāya cakkhudhātuyāva saṅgahitanti veditabbaṃ. Sotāyatanādīsupi imināva nayena saṅgahāsaṅgaho veditabbo. Asaṅkhataṃ khandhato ṭhapetvāti ettha pana yasmā asaṅkhataṃ dhammāyatanaṃ nāma nibbānaṃ, tañca khandhasaṅgahaṃ na gacchati; tasmā ‘khandhato ṭhapetvā’ti vuttaṃ. Catūhi khandhehīti rūpavedanāsaññāsaṅkhārakkhandhehi. Nibbānavajjañhi dhammāyatanaṃ etehi saṅgahitaṃ. Viññāṇakkhandhena pana ṭhapetvā dhammāyatanadhammadhātuyo sesāyatanadhātūhi ca taṃ na saṅgayhati. Tena vuttaṃ – ‘‘ekena khandhena, ekādasahāyatanehi, sattarasahi dhātūhi asaṅgahita’’nti. Yathā ca te heṭṭhā rūpakkhandhamūlakā, evamidhāpi cakkhāyatanamūlakāva nayā veditabbā. Dukamattameva pana pāḷiyaṃ dassetvā ‘‘dvādasāyatanānī’’ti abhedatova pucchāvissajjanaṃ kataṃ. Dhātuniddesepi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ". Saccaniddese ",
      " – sabbepi dukatikacatukkā pāḷiyaṃ dassitā. Yasmā ca dukatikesu samudayasaccasadisameva maggasaccepi vissajjanaṃ, tasmā taṃ samudayānantaraṃ vuttaṃ."
    ],
    "innerText": "40. Saccaniddese – sabbepi dukatikacatukkā pāḷiyaṃ dassitā. Yasmā ca dukatikesu samudayasaccasadisameva maggasaccepi vissajjanaṃ, tasmā taṃ samudayānantaraṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50"
      },
      ". Indriyaniddese – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jīvitindriyaṃ dvīhi khandhehī"
      },
      "ti rūpajīvitindriyaṃ rūpakkhandhena, arūpajīvitindriyaṃ ",
      " saṅkhārakkhandhena saṅgahitaṃ. Sesaṃ vuttanayānusāreneva veditabbaṃ. Pāḷivavatthānaṃ panettha āyatanadhātuniddesasadisameva."
    ],
    "innerText": "50. Indriyaniddese – jīvitindriyaṃ dvīhi khandhehīti rūpajīvitindriyaṃ rūpakkhandhena, arūpajīvitindriyaṃ saṅkhārakkhandhena saṅgahitaṃ. Sesaṃ vuttanayānusāreneva veditabbaṃ. Pāḷivavatthānaṃ panettha āyatanadhātuniddesasadisameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Paṭiccasamuppādavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "61"
      },
      ". Paṭiccasamuppādaniddese – ‘‘avijjā katihi khandhehī’’ti pucchaṃ anārabhitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avijjā ekena khandhenā"
      },
      "ti evaṃ vissajjanameva dassitaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅkhārapaccayā viññāṇa"
      },
      "nti paṭisandhiyaṃ pavatte ca sabbampi vipākaviññāṇaṃ. Tenevāha ",
      " – ‘‘sattahi dhātūhi saṅgahita’’nti. Nāmarūpampi paṭisandhipavattivaseneva veditabbaṃ. Tenevettha saddāyatanampi saṅgahetvā ekādasahāyatanehi saṅgaho dassito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phassā"
      },
      "dīsu khandhabhedo veditabbo. Aññeneva hi ekena khandhena phasso saṅgahito, aññena vedanā, taṇhāupādānakammabhavā pana saṅkhārakkhandheneva saṅgahitā. Bhavapadañcettha kammabhavādīnaṃ vasena ekādasadhā vibhattaṃ. Tattha kammabhavo phassādīhi sadisavisajjanattā tehi saddhiṃ ekato dassito. Upapattibhavakāmabhavasaññābhavapañcavokārabhavā aññamaññasadisavissajjanattā ekato dassitā. Yasmā cete upādinnakadhammāva tasmā ‘‘ekādasahāyatanehi sattarasahi dhātūhī’’ti vuttaṃ. Saddāyatanañhi anupādinnaṃ, taṃ ettha na gahitaṃ."
    ],
    "innerText": "61. Paṭiccasamuppādaniddese – ‘‘avijjā katihi khandhehī’’ti pucchaṃ anārabhitvā avijjā ekena khandhenāti evaṃ vissajjanameva dassitaṃ. Tattha saṅkhārapaccayā viññāṇanti paṭisandhiyaṃ pavatte ca sabbampi vipākaviññāṇaṃ. Tenevāha – ‘‘sattahi dhātūhi saṅgahita’’nti. Nāmarūpampi paṭisandhipavattivaseneva veditabbaṃ. Tenevettha saddāyatanampi saṅgahetvā ekādasahāyatanehi saṅgaho dassito. Phassādīsu khandhabhedo veditabbo. Aññeneva hi ekena khandhena phasso saṅgahito, aññena vedanā, taṇhāupādānakammabhavā pana saṅkhārakkhandheneva saṅgahitā. Bhavapadañcettha kammabhavādīnaṃ vasena ekādasadhā vibhattaṃ. Tattha kammabhavo phassādīhi sadisavisajjanattā tehi saddhiṃ ekato dassito. Upapattibhavakāmabhavasaññābhavapañcavokārabhavā aññamaññasadisavissajjanattā ekato dassitā. Yasmā cete upādinnakadhammāva tasmā ‘‘ekādasahāyatanehi sattarasahi dhātūhī’’ti vuttaṃ. Saddāyatanañhi anupādinnaṃ, taṃ ettha na gahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "68"
      },
      ". Rūpabhavaniddese – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcahāyatanehī"
      },
      "ti cakkhusotamanarūpadhammāyatanehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhahi dhātūhī"
      },
      "ti cakkhusotacakkhuviññāṇasotaviññāṇarūpadhammamanodhātumanoviññāṇadhātūhi. Arūpabhavādayopi tayo sadisavissajjanattāva ekato dassitā. Tathā asaññābhavaekavokārabhavā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvīhāyatanehī"
      },
      "ti rūpāyatanadhammāyatanehi. Dhātūsupi eseva nayo. Ekatalavāsikānañhi sesabrahmānaṃ cakkhusabbhāvato tassārammaṇattā tattha rūpāyatanaṃ uddhaṭaṃ."
    ],
    "innerText": "68. Rūpabhavaniddese – pañcahāyatanehīti cakkhusotamanarūpadhammāyatanehi. Aṭṭhahi dhātūhīti cakkhusotacakkhuviññāṇasotaviññāṇarūpadhammamanodhātumanoviññāṇadhātūhi. Arūpabhavādayopi tayo sadisavissajjanattāva ekato dassitā. Tathā asaññābhavaekavokārabhavā. Tattha dvīhāyatanehīti rūpāyatanadhammāyatanehi. Dhātūsupi eseva nayo. Ekatalavāsikānañhi sesabrahmānaṃ cakkhusabbhāvato tassārammaṇattā tattha rūpāyatanaṃ uddhaṭaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "71"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jāti dvīhi khandhehī"
      },
      "ti rūpajāti rūpakkhandhena, arūpajāti saṅkhārakkhandhena. Jarāmaraṇesupi ",
      " eseva nayo. Sokādīsupi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekena khandhenā"
      },
      "ti sokadukkhadomanassāni vedanākkhandhena, paridevo rūpakkhandhena, upāyāsādayo saṅkhārakkhandhenāti evaṃ khandhaviseso veditabbo."
    ],
    "innerText": "71.Jāti dvīhi khandhehīti rūpajāti rūpakkhandhena, arūpajāti saṅkhārakkhandhena. Jarāmaraṇesupi eseva nayo. Sokādīsupi ekena khandhenāti sokadukkhadomanassāni vedanākkhandhena, paridevo rūpakkhandhena, upāyāsādayo saṅkhārakkhandhenāti evaṃ khandhaviseso veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "73"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhipādo dvīhī"
      },
      "ti saṅkhāraviññāṇakkhandhehi, manāyatanadhammāyatanehi, dhammadhātumanoviññāṇadhātūhi ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhānaṃ dvīhī"
      },
      "ti vedanākkhandhasaṅkhārakkhandhehi. Appamaññādayo sadisavissajjanattā ekato niddiṭṭhā. Cittaṃ pana cetanānantaraṃ nikkhittampi asadisavissajjanattā pacchā gahitaṃ. Tattha appamaññādīsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekena khandhenā"
      },
      "ti vedanā vedanākkhandhena, saññā saññākkhandhena, sesā saṅkhārakkhandhena saṅgahitāti evaṃ khandhaviseso veditabbo."
    ],
    "innerText": "73.Iddhipādo dvīhīti saṅkhāraviññāṇakkhandhehi, manāyatanadhammāyatanehi, dhammadhātumanoviññāṇadhātūhi ca. Jhānaṃ dvīhīti vedanākkhandhasaṅkhārakkhandhehi. Appamaññādayo sadisavissajjanattā ekato niddiṭṭhā. Cittaṃ pana cetanānantaraṃ nikkhittampi asadisavissajjanattā pacchā gahitaṃ. Tattha appamaññādīsu ekena khandhenāti vedanā vedanākkhandhena, saññā saññākkhandhena, sesā saṅkhārakkhandhena saṅgahitāti evaṃ khandhaviseso veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Tikapadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "77"
      },
      ". Evaṃ ",
      " abbhantaramātikāya saṅgahaṃ dassetvā idāni bāhiramātikāya saṅgahaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kusalā dhammā"
      },
      "tiādi āraddhaṃ. Tattha vedanāttike ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tīhi dhātūhī"
      },
      "ti kāyaviññāṇamanoviññāṇadhammadhātūhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattahi dhātūhī"
      },
      "ti cakkhusotaghānajivhāviññāṇadhātūhi ceva manodhātudhammadhātumanoviññāṇadhātūhi ca. Vipākattike ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhahi dhātūhī"
      },
      "ti kāyaviññāṇadhātuyā saddhiṃ tāhiyeva. Vipākadhammadhammā pana saṃkiliṭṭhasaṃkilesikehi saddhiṃ sadisavissajjanattā ekato gahitā. Yathā cete, evaṃ sabbatikadukapadesu yaṃ yaṃ padaṃ yena yena padena saddhiṃ sadisavissajjanaṃ hoti, taṃ taṃ uppaṭipāṭiyāpi tena tena saddhiṃ gahetvā vissajjitaṃ. Tattha vuttānusāreneva saṅgahāsaṅgahanayo veditabboti."
    ],
    "innerText": "77. Evaṃ abbhantaramātikāya saṅgahaṃ dassetvā idāni bāhiramātikāya saṅgahaṃ dassetuṃ kusalā dhammātiādi āraddhaṃ. Tattha vedanāttike tīhi dhātūhīti kāyaviññāṇamanoviññāṇadhammadhātūhi. Sattahi dhātūhīti cakkhusotaghānajivhāviññāṇadhātūhi ceva manodhātudhammadhātumanoviññāṇadhātūhi ca. Vipākattike aṭṭhahi dhātūhīti kāyaviññāṇadhātuyā saddhiṃ tāhiyeva. Vipākadhammadhammā pana saṃkiliṭṭhasaṃkilesikehi saddhiṃ sadisavissajjanattā ekato gahitā. Yathā cete, evaṃ sabbatikadukapadesu yaṃ yaṃ padaṃ yena yena padena saddhiṃ sadisavissajjanaṃ hoti, taṃ taṃ uppaṭipāṭiyāpi tena tena saddhiṃ gahetvā vissajjitaṃ. Tattha vuttānusāreneva saṅgahāsaṅgahanayo veditabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṅgahāsaṅgahapadavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Dutiyanayo saṅgahitenaasaṅgahitapadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "171"
      },
      ". Idāni ",
      " saṅgahitena asaṅgahitapadaṃ bhājetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhāyatanenā"
      },
      "tiādi āraddhaṃ. Tatridaṃ ",
      " lakkhaṇaṃ – imasmiñhi vāre yaṃ khandhapadena saṅgahitaṃ hutvā āyatanadhātupadehi asaṅgahitaṃ, khandhāyatanapadehi vā saṅgahitaṃ hutvā dhātupadena asaṅgahitaṃ, tassa khandhādīhi asaṅgahaṃ pucchitvā vissajjanaṃ kataṃ. Taṃ pana rūpakkhandhādīsu na yujjati. Rūpakkhandhena hi rūpakkhandhova saṅgahito. So ca aḍḍhekādasahi āyatanadhātūhi asaṅgahito nāma natthi. Vedanākkhandhena ca vedanākkhandhova saṅgahito. Sopi dhammāyatanadhammadhātūhi asaṅgahito nāma natthi. Evaṃ asaṅgahitatāya abhāvato etāni aññāni ca evarūpāni manāyatanadhammāyatanādīni padāni imasmiṃ vāre na gahitāni. Yāni pana padāni rūpekadesaṃ arūpena asammissaṃ, viññāṇekadesañca aññena asammissaṃ dīpenti, tāni idha gahitāni. Pariyosāne ca –"
    ],
    "innerText": "171. Idāni saṅgahitena asaṅgahitapadaṃ bhājetuṃ cakkhāyatanenātiādi āraddhaṃ. Tatridaṃ lakkhaṇaṃ – imasmiñhi vāre yaṃ khandhapadena saṅgahitaṃ hutvā āyatanadhātupadehi asaṅgahitaṃ, khandhāyatanapadehi vā saṅgahitaṃ hutvā dhātupadena asaṅgahitaṃ, tassa khandhādīhi asaṅgahaṃ pucchitvā vissajjanaṃ kataṃ. Taṃ pana rūpakkhandhādīsu na yujjati. Rūpakkhandhena hi rūpakkhandhova saṅgahito. So ca aḍḍhekādasahi āyatanadhātūhi asaṅgahito nāma natthi. Vedanākkhandhena ca vedanākkhandhova saṅgahito. Sopi dhammāyatanadhammadhātūhi asaṅgahito nāma natthi. Evaṃ asaṅgahitatāya abhāvato etāni aññāni ca evarūpāni manāyatanadhammāyatanādīni padāni imasmiṃ vāre na gahitāni. Yāni pana padāni rūpekadesaṃ arūpena asammissaṃ, viññāṇekadesañca aññena asammissaṃ dīpenti, tāni idha gahitāni. Pariyosāne ca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Dasāyatanā ",
      " sattarasa dhātuyo,"
    ],
    "innerText": "‘‘Dasāyatanā sattarasa dhātuyo,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sattindriyā asaññābhavo ekavokārabhavo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Paridevo sanidassanasappaṭighaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anidassanaṃ punadeva sappaṭighaṃ upādā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddānagāthāya"
      },
      " dassitāneva. Tasmā tesaṃ vaseneva saṅgahāsaṅgaho veditabbo. Pañhavasena hi imasmiṃ vāre āyatanadhātuvaseneva sadisavissajjane vīsati dhamme samodhānetvā eko pañho kato, satta viññāṇadhātuyo samodhānetvā eko, sattindriyāni samodhānetvā eko, dve bhave samodhānetvā eko, paridevena ca sanidassanasappaṭighehi ca eko, anidassanasappaṭighehi eko, sanidassanehi eko, sappaṭighehi ca upādādhammehi ca ekoti aṭṭha pañhā katā. Tesu khandhādivibhāgo ",
      " evaṃ veditabbo seyyathidaṃ – paṭhamapañhe tāva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catūhi khandhehī"
      },
      "ti arūpakkhandhehi, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvīhāyatanehī"
      },
      "ti cakkhāyatanādīsu ekekena saddhiṃ manāyatanena, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhahi dhātūhī"
      },
      "ti cakkhudhātuādīsu ekekāya saddhiṃ sattahi viññāṇadhātūhi."
    ],
    "innerText": "Evaṃ uddānagāthāya dassitāneva. Tasmā tesaṃ vaseneva saṅgahāsaṅgaho veditabbo. Pañhavasena hi imasmiṃ vāre āyatanadhātuvaseneva sadisavissajjane vīsati dhamme samodhānetvā eko pañho kato, satta viññāṇadhātuyo samodhānetvā eko, sattindriyāni samodhānetvā eko, dve bhave samodhānetvā eko, paridevena ca sanidassanasappaṭighehi ca eko, anidassanasappaṭighehi eko, sanidassanehi eko, sappaṭighehi ca upādādhammehi ca ekoti aṭṭha pañhā katā. Tesu khandhādivibhāgo evaṃ veditabbo seyyathidaṃ – paṭhamapañhe tāva catūhi khandhehīti arūpakkhandhehi, dvīhāyatanehīti cakkhāyatanādīsu ekekena saddhiṃ manāyatanena, aṭṭhahi dhātūhīti cakkhudhātuādīsu ekekāya saddhiṃ sattahi viññāṇadhātūhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ nayo – cakkhāyatanena hi khandhasaṅgahena rūpakkhandho saṅgahito. Tasmiṃ saṅgahite rūpakkhandhe āyatanasaṅgahena cakkhāyatanamevekaṃ saṅgahitaṃ. Sesāni dasa āyatanāni asaṅgahitāni. Dhātusaṅgahenapi tena cakkhudhātuyevekā saṅgahitā. Sesā dasa dhātuyo asaṅgahitā. Iti yāni tena asaṅgahitāni dasāyatanāni, tāni cakkhāyatanamanāyatanehi dvīhi ",
      " asaṅgahitāni. Yāpi tena asaṅgahitā dasa dhātuyo, tā cakkhudhātuyā ceva sattahi ca viññāṇadhātūhi asaṅgahitāti. Rūpāyatanādīsupi eseva nayo."
    ],
    "innerText": "Tatrāyaṃ nayo – cakkhāyatanena hi khandhasaṅgahena rūpakkhandho saṅgahito. Tasmiṃ saṅgahite rūpakkhandhe āyatanasaṅgahena cakkhāyatanamevekaṃ saṅgahitaṃ. Sesāni dasa āyatanāni asaṅgahitāni. Dhātusaṅgahenapi tena cakkhudhātuyevekā saṅgahitā. Sesā dasa dhātuyo asaṅgahitā. Iti yāni tena asaṅgahitāni dasāyatanāni, tāni cakkhāyatanamanāyatanehi dvīhi asaṅgahitāni. Yāpi tena asaṅgahitā dasa dhātuyo, tā cakkhudhātuyā ceva sattahi ca viññāṇadhātūhi asaṅgahitāti. Rūpāyatanādīsupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "172"
      },
      ". Dutiyapañhe – yasmā yāya kāyaci viññāṇadhātuyā saṅgahito viññāṇakkhandho manāyatanena asaṅgahito nāma natthi, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āyatanasaṅgahena saṅgahitā"
      },
      "ti vuttaṃ. Ettha pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catūhi khandhehī"
      },
      "ti rūpādīhi catūhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekādasahāyatanehī"
      },
      "ti manāyatanavajjehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvādasahi dhātūhī"
      },
      "ti yathānurūpā cha viññāṇadhātuyo apanetvā sesāhi dvādasahi. Cakkhuviññāṇadhātuyā hi cakkhuviññāṇadhātuyeva saṅgahitā, itarā asaṅgahitā. Sotaviññāṇadhātuādīsupi eseva nayo."
    ],
    "innerText": "172. Dutiyapañhe – yasmā yāya kāyaci viññāṇadhātuyā saṅgahito viññāṇakkhandho manāyatanena asaṅgahito nāma natthi, tasmā āyatanasaṅgahena saṅgahitāti vuttaṃ. Ettha pana catūhi khandhehīti rūpādīhi catūhi. Ekādasahāyatanehīti manāyatanavajjehi. Dvādasahi dhātūhīti yathānurūpā cha viññāṇadhātuyo apanetvā sesāhi dvādasahi. Cakkhuviññāṇadhātuyā hi cakkhuviññāṇadhātuyeva saṅgahitā, itarā asaṅgahitā. Sotaviññāṇadhātuādīsupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "173"
      },
      ". Tatiyapañhe ",
      " – cakkhundriyādīnaṃ vissajjanaṃ cakkhāyatanādisadisameva. Itthindriyapurisindriyesu pana dhammāyatanena saddhiṃ dve āyatanāni, dhammadhātuyā ca saddhiṃ aṭṭha dhātuyo veditabbā."
    ],
    "innerText": "173. Tatiyapañhe – cakkhundriyādīnaṃ vissajjanaṃ cakkhāyatanādisadisameva. Itthindriyapurisindriyesu pana dhammāyatanena saddhiṃ dve āyatanāni, dhammadhātuyā ca saddhiṃ aṭṭha dhātuyo veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "174"
      },
      ". Catutthapañhe – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tīhāyatanehī"
      },
      "ti rūpāyatanadhammāyatanamanāyatanehi. Tesu hi bhavesu rūpāyatanadhammāyatanavasena dveva āyatanāni tehi saṅgahitāni ",
      ". Sesāni nava rūpāyatanāni teheva ca dvīhi, manāyatanena cāti tīhi asaṅgahitāni nāma honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navahi dhātūhī"
      },
      "ti rūpadhātudhammadhātūhi saddhiṃ sattahi viññāṇadhātūhi."
    ],
    "innerText": "174. Catutthapañhe – tīhāyatanehīti rūpāyatanadhammāyatanamanāyatanehi. Tesu hi bhavesu rūpāyatanadhammāyatanavasena dveva āyatanāni tehi saṅgahitāni . Sesāni nava rūpāyatanāni teheva ca dvīhi, manāyatanena cāti tīhi asaṅgahitāni nāma honti. Navahi dhātūhīti rūpadhātudhammadhātūhi saddhiṃ sattahi viññāṇadhātūhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "175"
      },
      ". Pañcamapañhe – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvīhāyatanehī"
      },
      "ti paṭhamapadaṃ sandhāya saddāyatanamanāyatanehi. Dutiyapadaṃ sandhāya rūpāyatanamanāyatanehi. Dhātuyopi tesaṃyeva ekekena saddhiṃ satta viññāṇadhātuyo veditabbā."
    ],
    "innerText": "175. Pañcamapañhe – dvīhāyatanehīti paṭhamapadaṃ sandhāya saddāyatanamanāyatanehi. Dutiyapadaṃ sandhāya rūpāyatanamanāyatanehi. Dhātuyopi tesaṃyeva ekekena saddhiṃ satta viññāṇadhātuyo veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "176"
      },
      ". Chaṭṭhapañhe – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dasahāyatanehī"
      },
      "ti rūpāyatanadhammāyatanavajjehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Soḷasahi dhātūhī"
      },
      "ti rūpadhātudhammadhātuvajjeheva. Kathaṃ? Anidassanasappaṭighā hi dhammā nāma nava oḷārikāyatanāni. Tehi khandhasaṅgahena saṅgahite rūpakkhandhe, āyatanasaṅgahena tāneva navāyatanāni saṅgahitāni. Rūpāyatanadhammāyatanāni asaṅgahitāni. Dhātusaṅgahenapi tā eva nava dhātuyo saṅgahitā. Rūpadhātudhammadhātuyo asaṅgahitā. Iti yāni tehi asaṅgahitāni dve āyatanāni ",
      ", tāni rūpāyatanavajjehi navahi oḷārikāyatanehi, manāyatanena cāti dasahi asaṅgahitāni. Yāpi tehi asaṅgahitā dve dhātuyo, tā rūpadhātuvajjāhi navahi oḷārikadhātūhi, sattahi ca viññāṇadhātūhīti soḷasahi asaṅgahitāti veditabbā."
    ],
    "innerText": "176. Chaṭṭhapañhe – dasahāyatanehīti rūpāyatanadhammāyatanavajjehi. Soḷasahi dhātūhīti rūpadhātudhammadhātuvajjeheva. Kathaṃ? Anidassanasappaṭighā hi dhammā nāma nava oḷārikāyatanāni. Tehi khandhasaṅgahena saṅgahite rūpakkhandhe, āyatanasaṅgahena tāneva navāyatanāni saṅgahitāni. Rūpāyatanadhammāyatanāni asaṅgahitāni. Dhātusaṅgahenapi tā eva nava dhātuyo saṅgahitā. Rūpadhātudhammadhātuyo asaṅgahitā. Iti yāni tehi asaṅgahitāni dve āyatanāni , tāni rūpāyatanavajjehi navahi oḷārikāyatanehi, manāyatanena cāti dasahi asaṅgahitāni. Yāpi tehi asaṅgahitā dve dhātuyo, tā rūpadhātuvajjāhi navahi oḷārikadhātūhi, sattahi ca viññāṇadhātūhīti soḷasahi asaṅgahitāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "177"
      },
      ". Sattamapañhe – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvīhāyatanehī"
      },
      "ti rūpāyatanamanāyatanehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhahi dhātūhī"
      },
      "ti rūpadhātuyā saddhiṃ sattahi viññāṇadhātūhi."
    ],
    "innerText": "177. Sattamapañhe – dvīhāyatanehīti rūpāyatanamanāyatanehi. Aṭṭhahi dhātūhīti rūpadhātuyā saddhiṃ sattahi viññāṇadhātūhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "178"
      },
      ". Aṭṭhamapañhe – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekādasahāyatanehī"
      },
      "ti sappaṭighadhamme sandhāya dhammāyatanavajjehi, upādādhamme sandhāya phoṭṭhabbāyatanavajjehi. Dhātūsupi eseva nayo. Atthayojanā panettha heṭṭhā vuttanayeneva veditabbāti."
    ],
    "innerText": "178. Aṭṭhamapañhe – ekādasahāyatanehīti sappaṭighadhamme sandhāya dhammāyatanavajjehi, upādādhamme sandhāya phoṭṭhabbāyatanavajjehi. Dhātūsupi eseva nayo. Atthayojanā panettha heṭṭhā vuttanayeneva veditabbāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṅgahitenaasaṅgahitapadavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Tatiyanayo asaṅgahitenasaṅgahitapadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "179"
      },
      ". Idāni ",
      " asaṅgahitenasaṅgahitapadaṃ bhājetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedanākkhandhenā"
      },
      "tiādi āraddhaṃ. Tatridaṃ lakkhaṇaṃ – imasmiñhi vāre yaṃ khandhapadena asaṅgahitaṃ hutvā āyatanadhātupadehi saṅgahitaṃ, tassa khandhādīhi saṅgahaṃ pucchitvā vissajjanaṃ kataṃ. Taṃ pana rūpakkhandhaviññāṇakkhandhacakkhāyatanādīsu na yujjati. Rūpakkhandhena hi cattāro khandhā khandhasaṅgahena asaṅgahitā. Tesu tena ekadhammopi āyatanadhātusaṅgahena saṅgahito nāma natthi. Nanu ca vedanādayo dhammāyatanena saṅgahitāti? Saṅgahitā. Na pana rūpakkhandhova dhammāyatanaṃ, rūpakkhandhato hi sukhumarūpamattaṃ dhammāyatanaṃ bhajati. Tasmā ye dhammāyatanena saṅgahitā, na te rūpakkhandhena saṅgahitā nāma. Viññāṇakkhandhenapi itare cattāro khandhā asaṅgahitā. Tesu tena ekopi āyatanadhātusaṅgahena saṅgahito nāma natthi. Evaṃ saṅgahitatāya abhāvato etāni aññāni ca evarūpāni cakkhāyatanādīni padāni imasmiṃ vāre na gahitāni. Yāni pana padāni ",
      " viññāṇena vā oḷārikarūpena vā asammissaṃ dhammāyatanekadesaṃ dīpenti, tāni idha gahitāni. Tesaṃ idamuddānaṃ –"
    ],
    "innerText": "179. Idāni asaṅgahitenasaṅgahitapadaṃ bhājetuṃ vedanākkhandhenātiādi āraddhaṃ. Tatridaṃ lakkhaṇaṃ – imasmiñhi vāre yaṃ khandhapadena asaṅgahitaṃ hutvā āyatanadhātupadehi saṅgahitaṃ, tassa khandhādīhi saṅgahaṃ pucchitvā vissajjanaṃ kataṃ. Taṃ pana rūpakkhandhaviññāṇakkhandhacakkhāyatanādīsu na yujjati. Rūpakkhandhena hi cattāro khandhā khandhasaṅgahena asaṅgahitā. Tesu tena ekadhammopi āyatanadhātusaṅgahena saṅgahito nāma natthi. Nanu ca vedanādayo dhammāyatanena saṅgahitāti? Saṅgahitā. Na pana rūpakkhandhova dhammāyatanaṃ, rūpakkhandhato hi sukhumarūpamattaṃ dhammāyatanaṃ bhajati. Tasmā ye dhammāyatanena saṅgahitā, na te rūpakkhandhena saṅgahitā nāma. Viññāṇakkhandhenapi itare cattāro khandhā asaṅgahitā. Tesu tena ekopi āyatanadhātusaṅgahena saṅgahito nāma natthi. Evaṃ saṅgahitatāya abhāvato etāni aññāni ca evarūpāni cakkhāyatanādīni padāni imasmiṃ vāre na gahitāni. Yāni pana padāni viññāṇena vā oḷārikarūpena vā asammissaṃ dhammāyatanekadesaṃ dīpenti, tāni idha gahitāni. Tesaṃ idamuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tayo khandhā tathā saccā, indriyāni ca soḷasa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Padāni paccayākāre, cuddasūpari cuddasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Samatiṃsa padā honti, gocchakesu dasasvatha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duve cūḷantaradukā, aṭṭha honti mahantarā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Etesu pana padesu sadisavissajjanāni padāni ekato katvā sabbepi dvādasa pañhā vuttā. Tesu evaṃ khandhavibhāgo veditabbo. Āyatanadhātūsu pana bhedo natthi. Tattha paṭhamapañhe tāva – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tīhi khandhehī"
      },
      "ti rūpasaññāsaṅkhārakkhandhehi. Āyatanadhātuyo pana dhammāyatanadhammadhātuvasena veditabbā."
    ],
    "innerText": "Etesu pana padesu sadisavissajjanāni padāni ekato katvā sabbepi dvādasa pañhā vuttā. Tesu evaṃ khandhavibhāgo veditabbo. Āyatanadhātūsu pana bhedo natthi. Tattha paṭhamapañhe tāva – tīhi khandhehīti rūpasaññāsaṅkhārakkhandhehi. Āyatanadhātuyo pana dhammāyatanadhammadhātuvasena veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ nayo – vedanākkhandhena hi nibbānañca sukhumarūpasaññāsaṅkhārā ",
      " ca khandhasaṅgahena asaṅgahitā hutvā āyatanadhātusaṅgahena saṅgahitā. Tesu nibbānaṃ khandhasaṅgahaṃ na gacchati, sesā rūpasaññāsaṅkhārakkhandhehi saṅgahaṃ gacchanti. Āyatanadhātusaṅgahaṃ pana nibbānampi gacchateva. Tena vuttaṃ ",
      " – ‘‘asaṅkhataṃ khandhato ṭhapetvā tīhi khandhehi, ekenāyatanena, ekāya dhātuyā saṅgahitā’’ti. Saññākkhandhapakkhe panettha saññaṃ apanetvā vedanāya saddhiṃ tayo khandhā saṅkhārādīsu saṅkhārakkhandhaṃ apanetvā rūpavedanāsaññāvasena tayo khandhā veditabbā."
    ],
    "innerText": "Tatrāyaṃ nayo – vedanākkhandhena hi nibbānañca sukhumarūpasaññāsaṅkhārā ca khandhasaṅgahena asaṅgahitā hutvā āyatanadhātusaṅgahena saṅgahitā. Tesu nibbānaṃ khandhasaṅgahaṃ na gacchati, sesā rūpasaññāsaṅkhārakkhandhehi saṅgahaṃ gacchanti. Āyatanadhātusaṅgahaṃ pana nibbānampi gacchateva. Tena vuttaṃ – ‘‘asaṅkhataṃ khandhato ṭhapetvā tīhi khandhehi, ekenāyatanena, ekāya dhātuyā saṅgahitā’’ti. Saññākkhandhapakkhe panettha saññaṃ apanetvā vedanāya saddhiṃ tayo khandhā saṅkhārādīsu saṅkhārakkhandhaṃ apanetvā rūpavedanāsaññāvasena tayo khandhā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "180"
      },
      ". Dutiye – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catūhi khandhehī"
      },
      "ti viññāṇavajjehi. Te hi nirodhena khandhasaṅgahena asaṅgahitā hutvā āyatanadhātusaṅgahena saṅgahitā."
    ],
    "innerText": "180. Dutiye – catūhi khandhehīti viññāṇavajjehi. Te hi nirodhena khandhasaṅgahena asaṅgahitā hutvā āyatanadhātusaṅgahena saṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "181"
      },
      ". Tatiye – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvīhī"
      },
      "ti vedanāsaññākkhandhehi. Rūpārūpajīvitindriyena hi vedanāsaññāviññāṇakkhandhā ca khandhasaṅgahena asaṅgahitā. Tesu pana vedanāsaññāva āyatanadhātusaṅgahena saṅgahitā. Tena vuttaṃ – ‘‘vedanāsaññākkhandhehī’’ti. Iminā upāyena sabbattha khandhabhedo veditabbo. Ito parañhi khandhānaṃ nāmamattameva vakkhāma."
    ],
    "innerText": "181. Tatiye – dvīhīti vedanāsaññākkhandhehi. Rūpārūpajīvitindriyena hi vedanāsaññāviññāṇakkhandhā ca khandhasaṅgahena asaṅgahitā. Tesu pana vedanāsaññāva āyatanadhātusaṅgahena saṅgahitā. Tena vuttaṃ – ‘‘vedanāsaññākkhandhehī’’ti. Iminā upāyena sabbattha khandhabhedo veditabbo. Ito parañhi khandhānaṃ nāmamattameva vakkhāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "182"
      },
      ". Catutthe ",
      " – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tīhi khandhehī"
      },
      "ti itthindriyapurisindriyesu vedanāsaññāsaṅkhārehi, vedanāpañcake rūpasaññāsaṅkhārehi; saddhindriyādīsu phassapariyosānesu rūpavedanāsaññākkhandhehi. Vedanāya vedanākkhandhasadisova taṇhupādānakammabhavesu saṅkhārakkhandhasadisova vinicchayo."
    ],
    "innerText": "182. Catutthe – tīhi khandhehīti itthindriyapurisindriyesu vedanāsaññāsaṅkhārehi, vedanāpañcake rūpasaññāsaṅkhārehi; saddhindriyādīsu phassapariyosānesu rūpavedanāsaññākkhandhehi. Vedanāya vedanākkhandhasadisova taṇhupādānakammabhavesu saṅkhārakkhandhasadisova vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "183"
      },
      ". Pañcame – jātijarāmaraṇesu jīvitindriyasadisova. Jhānena pana nibbānaṃ sukhumarūpaṃ saññā ca khandhasaṅgahena asaṅgahitā hutvā āyatanadhātusaṅgahena saṅgahitā. Tasmā taṃ sandhāya rūpakkhandhasaññākkhandhānaṃ vasena dve khandhā veditabbā."
    ],
    "innerText": "183. Pañcame – jātijarāmaraṇesu jīvitindriyasadisova. Jhānena pana nibbānaṃ sukhumarūpaṃ saññā ca khandhasaṅgahena asaṅgahitā hutvā āyatanadhātusaṅgahena saṅgahitā. Tasmā taṃ sandhāya rūpakkhandhasaññākkhandhānaṃ vasena dve khandhā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "184"
      },
      ". Chaṭṭhe – sokādittaye vedanāya sadiso. Upāyāsādīsu saṅkhārasadiso. Puna vedanāya vedanākkhandhasadiso, saññāya saññākkhandhasadiso, cetanādīsu saṅkhārakkhandhasadiso ",
      " vinicchayo. Iminā upāyena sattamapañhādīsupi saṅgahāsaṅgaho veditabboti."
    ],
    "innerText": "184. Chaṭṭhe – sokādittaye vedanāya sadiso. Upāyāsādīsu saṅkhārasadiso. Puna vedanāya vedanākkhandhasadiso, saññāya saññākkhandhasadiso, cetanādīsu saṅkhārakkhandhasadiso vinicchayo. Iminā upāyena sattamapañhādīsupi saṅgahāsaṅgaho veditabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Asaṅgahitenasaṅgahitapadavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4. Catutthanayo saṅgahitenasaṅgahitapadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "191"
      },
      ". Idāni ",
      " saṅgahitenasaṅgahitapadaṃ bhājetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samudayasaccenā"
      },
      "tiādi āraddhaṃ. Tattha yaṃ khandhādīhi saṅgahitena khandhādivasena saṅgahitaṃ, puna tasseva khandhādīhi saṅgahaṃ pucchitvā vissajjanaṃ kataṃ. Taṃ khandhāyatanadhātūsu ekampi sakalakoṭṭhāsaṃ gahetvā ṭhitapadesu na yujjati. Sakalena hi khandhādipadena aññaṃ khandhādivasena saṅgahitaṃ nāma natthi, yaṃ attano saṅgāhakaṃ saṅgaṇhitvā puna teneva saṅgahaṃ gaccheyya. Tasmā tathārūpāni padāni imasmiṃ vāre na gahitāni. Yāni pana padāni saṅkhārekadesaṃ vā aññena asammissaṃ dīpenti – vedanekadesaṃ vā sukhumarūpaṃ vā saddekadesaṃ vā, tāni idha gahitāni. Tesaṃ idamuddānaṃ –"
    ],
    "innerText": "191. Idāni saṅgahitenasaṅgahitapadaṃ bhājetuṃ samudayasaccenātiādi āraddhaṃ. Tattha yaṃ khandhādīhi saṅgahitena khandhādivasena saṅgahitaṃ, puna tasseva khandhādīhi saṅgahaṃ pucchitvā vissajjanaṃ kataṃ. Taṃ khandhāyatanadhātūsu ekampi sakalakoṭṭhāsaṃ gahetvā ṭhitapadesu na yujjati. Sakalena hi khandhādipadena aññaṃ khandhādivasena saṅgahitaṃ nāma natthi, yaṃ attano saṅgāhakaṃ saṅgaṇhitvā puna teneva saṅgahaṃ gaccheyya. Tasmā tathārūpāni padāni imasmiṃ vāre na gahitāni. Yāni pana padāni saṅkhārekadesaṃ vā aññena asammissaṃ dīpenti – vedanekadesaṃ vā sukhumarūpaṃ vā saddekadesaṃ vā, tāni idha gahitāni. Tesaṃ idamuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dve saccā pannarasindriyā, ekādasa paṭiccapadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uddhaṃ puna ekādasa, gocchakapadamettha tiṃsavidha’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañhā ",
      " panettha dveyeva honti. Tattha yaṃ pucchāya uddhaṭaṃ padaṃ, tadeva yehi dhammehi khandhādivasena saṅgahitaṃ, te dhamme sandhāya sabbattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekena khandhenā"
      },
      "tiādi vuttaṃ. Tatrāyaṃ nayo – samudayasaccena hi taṇhāvajjā sesā saṅkhārā khandhādisaṅgahena saṅgahitā. Puna tehi taṇhāva saṅgahitā. Sā ",
      " taṇhā puna saṅkhāreheva khandhādisaṅgahena saṅgahitāti. Eseva nayo sabbattha. Arūpadhammapucchāsu panettha saṅkhārakkhandho vā vedanākkhandho vā eko khandho nāma. Rūpadhammapucchāsu rūpakkhandho. Paridevapucchāya saddāyatanaṃ ekaṃ āyatanaṃ nāma. Saddadhātu ekā dhātu nāma, sesaṭṭhānesu dhammāyatanadhammadhātuvaseneva attho veditabboti."
    ],
    "innerText": "Pañhā panettha dveyeva honti. Tattha yaṃ pucchāya uddhaṭaṃ padaṃ, tadeva yehi dhammehi khandhādivasena saṅgahitaṃ, te dhamme sandhāya sabbattha ekena khandhenātiādi vuttaṃ. Tatrāyaṃ nayo – samudayasaccena hi taṇhāvajjā sesā saṅkhārā khandhādisaṅgahena saṅgahitā. Puna tehi taṇhāva saṅgahitā. Sā taṇhā puna saṅkhāreheva khandhādisaṅgahena saṅgahitāti. Eseva nayo sabbattha. Arūpadhammapucchāsu panettha saṅkhārakkhandho vā vedanākkhandho vā eko khandho nāma. Rūpadhammapucchāsu rūpakkhandho. Paridevapucchāya saddāyatanaṃ ekaṃ āyatanaṃ nāma. Saddadhātu ekā dhātu nāma, sesaṭṭhānesu dhammāyatanadhammadhātuvaseneva attho veditabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṅgahitenasaṅgahitapadavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "5. Pañcamanayo asaṅgahitenaasaṅgahitapadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "193"
      },
      ". Idāni asaṅgahitena asaṅgahitapadaṃ bhājetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpakkhandhenā"
      },
      "tiādi āraddhaṃ. Tattha yaṃ khandhādīhi asaṅgahitena khandhādivasena asaṅgahitaṃ, puna tasseva khandhādīhi asaṅgahaṃ pucchitvā vissajjanaṃ kataṃ. Taṃ pañcakkhandhaggāhakesu dukkhasaccādīsu ",
      " viññāṇena saddhiṃ sukhumarūpaggāhakesu anidassanaappaṭighādīsu ca padesu na yujjati. Tādisena hi padena nibbānaṃ khandhasaṅgahamattaṃ na gaccheyya. Sesā khandhādīhi asaṅgahitadhammā nāma natthi. Tasmā tathārūpāni padāni imasmiṃ vāre na gahitāni. Yāni pana pañcakkhandhe viññāṇañca sukhumarūpena saddhiṃ ekato na dīpenti, tāni idha gahitāni. Tesaṃ idamuddānaṃ –"
    ],
    "innerText": "193. Idāni asaṅgahitena asaṅgahitapadaṃ bhājetuṃ rūpakkhandhenātiādi āraddhaṃ. Tattha yaṃ khandhādīhi asaṅgahitena khandhādivasena asaṅgahitaṃ, puna tasseva khandhādīhi asaṅgahaṃ pucchitvā vissajjanaṃ kataṃ. Taṃ pañcakkhandhaggāhakesu dukkhasaccādīsu viññāṇena saddhiṃ sukhumarūpaggāhakesu anidassanaappaṭighādīsu ca padesu na yujjati. Tādisena hi padena nibbānaṃ khandhasaṅgahamattaṃ na gaccheyya. Sesā khandhādīhi asaṅgahitadhammā nāma natthi. Tasmā tathārūpāni padāni imasmiṃ vāre na gahitāni. Yāni pana pañcakkhandhe viññāṇañca sukhumarūpena saddhiṃ ekato na dīpenti, tāni idha gahitāni. Tesaṃ idamuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sabbe khandhā tathāyatanadhātuyo saccato tayo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Indriyānipi sabbāni, tevīsati paṭiccato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Parato soḷasa padā, tecattālīsakaṃ tike;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gocchake sattati dve ca, satta cūḷantare padā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Mahantare ",
      " padā vuttā, aṭṭhārasa tato paraṃ;"
    ],
    "innerText": "‘‘Mahantare padā vuttā, aṭṭhārasa tato paraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aṭṭhāraseva ñātabbā, sesā idha na bhāsitā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañhā panettha sadisavissajjanānaṃ vasena samodhānetvā katihi saddhiṃ sabbepi catuttiṃsa honti. Tattha yaṃ ",
      " pucchāya uddhaṭaṃ padaṃ, tadeva yehi khandhādīhi asaṅgahitaṃ, te dhamme sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekena khandhenā"
      },
      "tiādi vuttaṃ."
    ],
    "innerText": "Pañhā panettha sadisavissajjanānaṃ vasena samodhānetvā katihi saddhiṃ sabbepi catuttiṃsa honti. Tattha yaṃ pucchāya uddhaṭaṃ padaṃ, tadeva yehi khandhādīhi asaṅgahitaṃ, te dhamme sandhāya ekena khandhenātiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ nayo – rūpakkhandhena hi cattāro khandhā nibbānañca khandhasaṅgahena asaṅgahitā. Āyatanadhātusaṅgahena pana ṭhapetvā viññāṇaṃ avasesā saṅgahitāti viññāṇameva tīhipi khandhasaṅgahādīhi asaṅgahitaṃ nāma. Puna tena viññāṇena saddhiṃ nibbānena cattāro khandhā khandhādisaṅgahena asaṅgahitā. Te sabbepi puna viññāṇeneva khandhādisaṅgahena asaṅgahitāti ekena khandhena, ekenāyatanena, sattahi dhātūhi asaṅgahitā nāma honti. Atha vā – yadetaṃ rūpakkhandhena viññāṇameva tīhi khandhādisaṅgahehi asaṅgahitaṃ, tehipi viññāṇadhammehi te rūpadhammāva tīhi saṅgahehi asaṅgahitā. Puna te rūpadhammā viññāṇeneva tīhi saṅgahehi asaṅgahitā. Viññāṇañca khandhato eko viññāṇakkhandho hoti, āyatanato ekaṃ manāyatanaṃ, dhātuto satta viññāṇadhātuyo. Tasmā ‘‘ekena khandhenā’’tiādi vuttaṃ. Iminā upāyena sabbattha yaṃ pucchāya uddhaṭaṃ padaṃ, tadeva yehi dhammehi khandhādivasena asaṅgahitaṃ, tesaṃ dhammānaṃ vasena khandhādayo veditabbā. Tattha dutiyapañhe tāva – rūpaviññāṇānaṃ vasena ",
      " veditabbā. Vedanādayo hi rūpaviññāṇeheva khandhādisaṅgahena asaṅgahitā. Te ca dve khandhā ekādasāyatanāni sattarasa dhātuyo honti."
    ],
    "innerText": "Tatrāyaṃ nayo – rūpakkhandhena hi cattāro khandhā nibbānañca khandhasaṅgahena asaṅgahitā. Āyatanadhātusaṅgahena pana ṭhapetvā viññāṇaṃ avasesā saṅgahitāti viññāṇameva tīhipi khandhasaṅgahādīhi asaṅgahitaṃ nāma. Puna tena viññāṇena saddhiṃ nibbānena cattāro khandhā khandhādisaṅgahena asaṅgahitā. Te sabbepi puna viññāṇeneva khandhādisaṅgahena asaṅgahitāti ekena khandhena, ekenāyatanena, sattahi dhātūhi asaṅgahitā nāma honti. Atha vā – yadetaṃ rūpakkhandhena viññāṇameva tīhi khandhādisaṅgahehi asaṅgahitaṃ, tehipi viññāṇadhammehi te rūpadhammāva tīhi saṅgahehi asaṅgahitā. Puna te rūpadhammā viññāṇeneva tīhi saṅgahehi asaṅgahitā. Viññāṇañca khandhato eko viññāṇakkhandho hoti, āyatanato ekaṃ manāyatanaṃ, dhātuto satta viññāṇadhātuyo. Tasmā ‘‘ekena khandhenā’’tiādi vuttaṃ. Iminā upāyena sabbattha yaṃ pucchāya uddhaṭaṃ padaṃ, tadeva yehi dhammehi khandhādivasena asaṅgahitaṃ, tesaṃ dhammānaṃ vasena khandhādayo veditabbā. Tattha dutiyapañhe tāva – rūpaviññāṇānaṃ vasena veditabbā. Vedanādayo hi rūpaviññāṇeheva khandhādisaṅgahena asaṅgahitā. Te ca dve khandhā ekādasāyatanāni sattarasa dhātuyo honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "195"
      },
      ". Tatiyapañhe – viññāṇaṃ rūpādīhi catūhi asaṅgahitanti tesaṃ vasena khandhādayo veditabbā."
    ],
    "innerText": "195. Tatiyapañhe – viññāṇaṃ rūpādīhi catūhi asaṅgahitanti tesaṃ vasena khandhādayo veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "196"
      },
      ". Catutthapañhe – cakkhāyatanaṃ vedanādīhi catūhīti iminā nayena sabbattha khandhādayo veditabbā. Pariyosāne – rūpañca dhammāyatananti uddānagāthāya dassitadhammāyeva aññenākārena saṅkhipitvā dassitāti."
    ],
    "innerText": "196. Catutthapañhe – cakkhāyatanaṃ vedanādīhi catūhīti iminā nayena sabbattha khandhādayo veditabbā. Pariyosāne – rūpañca dhammāyatananti uddānagāthāya dassitadhammāyeva aññenākārena saṅkhipitvā dassitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Asaṅgahitenaasaṅgahitapadavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "6. Chaṭṭhanayo sampayogavippayogapadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "228"
      },
      ". Idāni ",
      " sampayogavippayogapadaṃ bhājetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpakkhandho"
      },
      "tiādi āraddhaṃ. Tattha yaṃ labbhati yañca na labbhati taṃ sabbaṃ pucchāya gahitaṃ. Vissajjane pana yaṃ na labbhati, taṃ natthīti paṭikkhittaṃ. Catūhi sampayogo, catūhi vippayogo; sabhāgo visabhāgoti hi vacanato catūhi arūpakkhandheheva sabhāgānaṃ ekasantānasmiṃ ekakkhaṇe uppannānaṃ arūpakkhandhānaṃyeva aññamaññaṃ sampayogo labbhati. Rūpadhammānaṃ pana rūpena nibbānena vā, nibbānassa ca rūpena saddhiṃ sampayogo nāma natthi. Tathā rūpanibbānānaṃ arūpakkhandhehi, visabhāgā hi te tesaṃ. Yathā ca arūpakkhandhānaṃ rūpanibbānehi, evaṃ bhinnasantānehi nānākkhaṇikehi arūpadhammehipi saddhiṃ natthiyeva. Tepi hi tesaṃ santānakkhaṇavisabhāgatāya visabhāgāyeva. Ayaṃ pana visabhāgatā saṅgahaṭṭhena virujjhanato saṅgahanaye natthi. Gaṇanūpagamattañhi saṅgahaṭṭho. Sampayoganaye pana atthi, ekuppādatādilakkhaṇañhi sampayogaṭṭhoti. Evamettha yassa ekadhammenapi sampayogalakkhaṇaṃ na yujjhati, tassa pucchāya saṅgahaṃ katvāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "natthī"
      },
      "ti paṭikkhepo kato. Yassa vippayogalakkhaṇaṃ yujjati, tassa vippayogo dassito. Yāni pana padāni sattasu viññāṇadhātūsu ekāyapi avippayutte rūpena nibbānena vā missakadhamme dīpenti, tāni sabbathāpi idha na yujjantīti na gahitāni. Tesaṃ idamuddānaṃ –"
    ],
    "innerText": "228. Idāni sampayogavippayogapadaṃ bhājetuṃ rūpakkhandhotiādi āraddhaṃ. Tattha yaṃ labbhati yañca na labbhati taṃ sabbaṃ pucchāya gahitaṃ. Vissajjane pana yaṃ na labbhati, taṃ natthīti paṭikkhittaṃ. Catūhi sampayogo, catūhi vippayogo; sabhāgo visabhāgoti hi vacanato catūhi arūpakkhandheheva sabhāgānaṃ ekasantānasmiṃ ekakkhaṇe uppannānaṃ arūpakkhandhānaṃyeva aññamaññaṃ sampayogo labbhati. Rūpadhammānaṃ pana rūpena nibbānena vā, nibbānassa ca rūpena saddhiṃ sampayogo nāma natthi. Tathā rūpanibbānānaṃ arūpakkhandhehi, visabhāgā hi te tesaṃ. Yathā ca arūpakkhandhānaṃ rūpanibbānehi, evaṃ bhinnasantānehi nānākkhaṇikehi arūpadhammehipi saddhiṃ natthiyeva. Tepi hi tesaṃ santānakkhaṇavisabhāgatāya visabhāgāyeva. Ayaṃ pana visabhāgatā saṅgahaṭṭhena virujjhanato saṅgahanaye natthi. Gaṇanūpagamattañhi saṅgahaṭṭho. Sampayoganaye pana atthi, ekuppādatādilakkhaṇañhi sampayogaṭṭhoti. Evamettha yassa ekadhammenapi sampayogalakkhaṇaṃ na yujjhati, tassa pucchāya saṅgahaṃ katvāpi natthīti paṭikkhepo kato. Yassa vippayogalakkhaṇaṃ yujjati, tassa vippayogo dassito. Yāni pana padāni sattasu viññāṇadhātūsu ekāyapi avippayutte rūpena nibbānena vā missakadhamme dīpenti, tāni sabbathāpi idha na yujjantīti na gahitāni. Tesaṃ idamuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Dhammāyatanaṃ ",
      " dhammadhātu, dukkhasaccañca jīvitaṃ;"
    ],
    "innerText": "‘‘Dhammāyatanaṃ dhammadhātu, dukkhasaccañca jīvitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saḷāyatanaṃ nāmarūpaṃ, cattāro ca mahābhavā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Jātijarā ca maraṇaṃ, tikesvekūnavīsati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gocchakesu ca paññāsa, aṭṭha cūḷantare padā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mahantare pannarasa, aṭṭhārasa tato pare;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tevīsa padasataṃ etaṃ, sampayoge na labbhatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dhammāyatanañhi ",
      " rūpanibbānamissakattā tasmiṃ apariyāpannena viññāṇenapi na sakkā sampayuttanti ",
      " vattuṃ. Yasmā panettha vedanādayo viññāṇena sampayuttā, tasmā vippayuttantipi na sakkā vattuṃ. Sesesupi eseva nayo. Evaṃ sabbatthāpi etāni na yujjantīti idha na gahitāni. Sesāni khandhādīni yujjantīti tāni gahetvā ekekavasena ca samodhānena ca pañhavissajjanaṃ kataṃ. Tesu pañhesu, paṭhame – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekenāyatanenā"
      },
      "ti manāyatanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kehicī"
      },
      "ti dhammāyatanadhammadhātupariyāpannehi vedanāsaññāsaṅkhārehi."
    ],
    "innerText": "Dhammāyatanañhi rūpanibbānamissakattā tasmiṃ apariyāpannena viññāṇenapi na sakkā sampayuttanti vattuṃ. Yasmā panettha vedanādayo viññāṇena sampayuttā, tasmā vippayuttantipi na sakkā vattuṃ. Sesesupi eseva nayo. Evaṃ sabbatthāpi etāni na yujjantīti idha na gahitāni. Sesāni khandhādīni yujjantīti tāni gahetvā ekekavasena ca samodhānena ca pañhavissajjanaṃ kataṃ. Tesu pañhesu, paṭhame – ekenāyatanenāti manāyatanena. Kehicīti dhammāyatanadhammadhātupariyāpannehi vedanāsaññāsaṅkhārehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "229"
      },
      ". Dutiye – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tīhī"
      },
      "ti pucchitaṃ pucchitaṃ ṭhapetvā sesehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kehici sampayutto"
      },
      "ti vedanākkhandho saññāsaṅkhārehi. Itarepi attānaṃ ṭhapetvā itarehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kehici vippayutto"
      },
      "ti rūpanibbānehi. Evaṃ sabbattha rūpassa vippayoge dhammāyatanadhammadhātūsu arūpaṃ, arūpassa vippayoge rūpaṃ daṭṭhabbaṃ. Tatiyapañho uttānatthova."
    ],
    "innerText": "229. Dutiye – tīhīti pucchitaṃ pucchitaṃ ṭhapetvā sesehi. Kehici sampayuttoti vedanākkhandho saññāsaṅkhārehi. Itarepi attānaṃ ṭhapetvā itarehi. Kehici vippayuttoti rūpanibbānehi. Evaṃ sabbattha rūpassa vippayoge dhammāyatanadhammadhātūsu arūpaṃ, arūpassa vippayoge rūpaṃ daṭṭhabbaṃ. Tatiyapañho uttānatthova."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "231"
      },
      ". Catutthe – ‘katihi khandhehī’tiādiṃ avatvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampayuttanti natthī"
      },
      "ti vuttaṃ. Taṃ pana khandhādīnaṃyeva vasena veditabbaṃ. Paratopi evarūpesu pañhesu eseva nayo. Ādipañhasmiñhi sarūpato dassetvā parato pāḷi saṃkhittā. Iminā nayena sabbattha atthayojanā veditabbā. Yattha pana nātipākaṭā bhavissati, tattha naṃ pākaṭaṃ katvāva gamissāma."
    ],
    "innerText": "231. Catutthe – ‘katihi khandhehī’tiādiṃ avatvā sampayuttanti natthīti vuttaṃ. Taṃ pana khandhādīnaṃyeva vasena veditabbaṃ. Paratopi evarūpesu pañhesu eseva nayo. Ādipañhasmiñhi sarūpato dassetvā parato pāḷi saṃkhittā. Iminā nayena sabbattha atthayojanā veditabbā. Yattha pana nātipākaṭā bhavissati, tattha naṃ pākaṭaṃ katvāva gamissāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "234"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Soḷasahi dhātūhī"
      },
      "ti cakkhuviññāṇadhātu tāva attānaṃ ṭhapetvā chahi viññāṇadhātūhi, dasahi ca rūpadhātūhi. Sesāsupi eseva nayo."
    ],
    "innerText": "234.Soḷasahi dhātūhīti cakkhuviññāṇadhātu tāva attānaṃ ṭhapetvā chahi viññāṇadhātūhi, dasahi ca rūpadhātūhi. Sesāsupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "235"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tīhi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khandhehī"
      },
      "ti saṅkhārakkhandhaṃ ṭhapetvā sesehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekāya dhātuyā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manoviññāṇadhātuyā."
      },
      " Samudayamaggānañhi aññāya dhātuyā sampayogo natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekena khandhenā"
      },
      "ti saṅkhārakkhandhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekenāyatanenā"
      },
      "ti dhammāyatanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekāya"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhātuyā"
      },
      "ti dhammadhātuyā. Etesu hi taṃ saccadvayaṃ kehici sampayuttaṃ."
    ],
    "innerText": "235.Tīhikhandhehīti saṅkhārakkhandhaṃ ṭhapetvā sesehi. Ekāya dhātuyāti manoviññāṇadhātuyā. Samudayamaggānañhi aññāya dhātuyā sampayogo natthi. Ekena khandhenāti saṅkhārakkhandhena. Ekenāyatanenāti dhammāyatanena. Ekāyadhātuyāti dhammadhātuyā. Etesu hi taṃ saccadvayaṃ kehici sampayuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "238"
      },
      ". Sukhindriyādipañhe – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tīhī"
      },
      "ti saññāsaṅkhāraviññāṇehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekāya dhātuyā"
      },
      "ti kāyaviññāṇadhātuyā, manoviññāṇadhātuyā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chahi dhātūhī"
      },
      "ti kāyaviññāṇadhātuvajjāhi."
    ],
    "innerText": "238. Sukhindriyādipañhe – tīhīti saññāsaṅkhāraviññāṇehi. Ekāya dhātuyāti kāyaviññāṇadhātuyā, manoviññāṇadhātuyā ca. Chahi dhātūhīti kāyaviññāṇadhātuvajjāhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "245"
      },
      ". Rūpabhavapañhe – sabbesampi arūpakkhandhānaṃ arūpāyatanānañca atthitāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na kehicī"
      },
      "ti ",
      " vuttaṃ. Ghānajivhākāyaviññāṇadhātūnaṃ pana natthitāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tīhi dhātūhi vippayutto"
      },
      "ti vuttaṃ."
    ],
    "innerText": "245. Rūpabhavapañhe – sabbesampi arūpakkhandhānaṃ arūpāyatanānañca atthitāya na kehicīti vuttaṃ. Ghānajivhākāyaviññāṇadhātūnaṃ pana natthitāya tīhi dhātūhi vippayuttoti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "256"
      },
      ". Adhimokkhapañhe – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvīhi dhātūhī"
      },
      "ti manodhātumanoviññāṇadhātūhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pannarasahī"
      },
      "ti sesāhi dasahi rūpadhātūhi, pañcahi ca cakkhuviññāṇādīhi."
    ],
    "innerText": "256. Adhimokkhapañhe – dvīhi dhātūhīti manodhātumanoviññāṇadhātūhi. Pannarasahīti sesāhi dasahi rūpadhātūhi, pañcahi ca cakkhuviññāṇādīhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "257"
      },
      ". Kusalapañhe – kusalehi catunnampi khandhānaṃ gahitattā sampayogo paṭikkhitto."
    ],
    "innerText": "257. Kusalapañhe – kusalehi catunnampi khandhānaṃ gahitattā sampayogo paṭikkhitto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "258"
      },
      ". Vedanāttikapañhe – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekena khandhenā"
      },
      "ti vedanākkhandheneva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pannarasahī"
      },
      "ti cakkhusotaghānajivhāviññāṇadhātumanodhātūhi ceva rūpadhātūhi ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekādasahī"
      },
      "ti kāyaviññāṇadhātuyā saddhiṃ rūpadhātūhi."
    ],
    "innerText": "258. Vedanāttikapañhe – ekena khandhenāti vedanākkhandheneva. Pannarasahīti cakkhusotaghānajivhāviññāṇadhātumanodhātūhi ceva rūpadhātūhi ca. Ekādasahīti kāyaviññāṇadhātuyā saddhiṃ rūpadhātūhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "262"
      },
      ". Nevavipākanavipākadhammadhammapañhe – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcahī"
      },
      "ti cakkhuviññāṇādīhi. Anupādinnaanupādāniyapañhe – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chahī"
      },
      "ti manoviññāṇadhātuvajjāhi. Savitakkasavicārapañhe – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pannarasahī"
      },
      "ti pañcahi viññāṇehi saddhiṃ rūpadhātūhi. Avitakkavicāramattapañhe – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekena khandhenā"
      },
      "tiādi saṅkhārakkhandhavaseneva veditabbaṃ. Dutiyajjhānavicārañhi ṭhapetvā sesā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avitakkavicāramattā"
      },
      " nāma. Pītiṃ ṭhapetvā sesā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pītisahagatā"
      },
      ". Tattha vicāro vicārena, pīti ca pītiyā na sampayuttāti saṅkhārakkhandhadhammāyatanadhammadhātūsu kehici sampayuttā nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Soḷasahī"
      },
      "ti dhammadhātumanoviññāṇadhātuvajjāheva. Avitakkaavicārapañhe ",
      " – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekāya dhātuyā"
      },
      "ti manodhātuyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhasahagatā upekkhāsahagatā"
      },
      " ca vedanāttike vuttāva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dassanenapahātabbā"
      },
      "dayo kusalasadisāva."
    ],
    "innerText": "262. Nevavipākanavipākadhammadhammapañhe – pañcahīti cakkhuviññāṇādīhi. Anupādinnaanupādāniyapañhe – chahīti manoviññāṇadhātuvajjāhi. Savitakkasavicārapañhe – pannarasahīti pañcahi viññāṇehi saddhiṃ rūpadhātūhi. Avitakkavicāramattapañhe – ekena khandhenātiādi saṅkhārakkhandhavaseneva veditabbaṃ. Dutiyajjhānavicārañhi ṭhapetvā sesā avitakkavicāramattā nāma. Pītiṃ ṭhapetvā sesā pītisahagatā. Tattha vicāro vicārena, pīti ca pītiyā na sampayuttāti saṅkhārakkhandhadhammāyatanadhammadhātūsu kehici sampayuttā nāma. Soḷasahīti dhammadhātumanoviññāṇadhātuvajjāheva. Avitakkaavicārapañhe – ekāya dhātuyāti manodhātuyā. Sukhasahagatā upekkhāsahagatā ca vedanāttike vuttāva. Dassanenapahātabbādayo kusalasadisāva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "271"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parittārammaṇaṃ"
      },
      " vipākadhammasadisaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekāya dhātuyā"
      },
      "ti dhammadhātuyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kehicī"
      },
      "ti ye tattha parittārammaṇā na honti, tehi. Dhammadhātu pana parittārammaṇānaṃ channaṃ cittuppādānaṃ vasena catūhi khandhehi saṅgahitattā paṭhamapaṭikkhepameva bhajati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahaggatārammaṇā"
      },
      "dayo kusalasadisāva."
    ],
    "innerText": "271.Parittārammaṇaṃ vipākadhammasadisaṃ. Ekāya dhātuyāti dhammadhātuyā. Kehicīti ye tattha parittārammaṇā na honti, tehi. Dhammadhātu pana parittārammaṇānaṃ channaṃ cittuppādānaṃ vasena catūhi khandhehi saṅgahitattā paṭhamapaṭikkhepameva bhajati. Mahaggatārammaṇādayo kusalasadisāva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "273"
      },
      ". Anuppannesu – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcahi dhātūhī"
      },
      "ti cakkhuviññāṇādīhi. Tāni hi ekantena uppādidhammabhūtāneva, uppannakoṭṭhāsampi pana bhajanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccuppannārammaṇā"
      },
      "dayo parittārammaṇasadisāva ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hetu"
      },
      "ādayo samudayasadisāva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahetukā ceva na ca hetū"
      },
      "pi pītisahagatasadisāva. Tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parāmāsasampayuttā. Anupādinnā"
      },
      " anuppannasadisāva. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "273. Anuppannesu – pañcahi dhātūhīti cakkhuviññāṇādīhi. Tāni hi ekantena uppādidhammabhūtāneva, uppannakoṭṭhāsampi pana bhajanti. Paccuppannārammaṇādayo parittārammaṇasadisāva . Hetuādayo samudayasadisāva. Sahetukā ceva na ca hetūpi pītisahagatasadisāva. Tathā parāmāsasampayuttā. Anupādinnā anuppannasadisāva. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sampayogavippayogapadavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "7. Sattamanayo sampayuttenavippayuttapadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "306"
      },
      ". Idāni sampayuttenavippayuttapadaṃ bhājetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedanākkhandhenā"
      },
      "tiādi āraddhaṃ. Tatridaṃ lakkhaṇaṃ – imasmiñhi vāre pucchāya uddhaṭapadena ye dhammā sampayuttā, tehi ye dhammā vippayuttā, tesaṃ khandhādīhi vippayogaṃ pucchitvā vissajjanaṃ kataṃ. Taṃ pana rūpakkhandhādīsu na yujjati. Rūpakkhandhena hi sampayuttā nāma natthi. Tasmā tañca aññāni ca evarūpāni padāni imasmiṃ vāre na gahitāni. Yāni pana padāni dhammadhātuyā ",
      " sampayutte dhamme viññāṇañca aññena asammissaṃ dīpenti, tāni idha gahitāni. Tesaṃ idamuddānaṃ –"
    ],
    "innerText": "306. Idāni sampayuttenavippayuttapadaṃ bhājetuṃ vedanākkhandhenātiādi āraddhaṃ. Tatridaṃ lakkhaṇaṃ – imasmiñhi vāre pucchāya uddhaṭapadena ye dhammā sampayuttā, tehi ye dhammā vippayuttā, tesaṃ khandhādīhi vippayogaṃ pucchitvā vissajjanaṃ kataṃ. Taṃ pana rūpakkhandhādīsu na yujjati. Rūpakkhandhena hi sampayuttā nāma natthi. Tasmā tañca aññāni ca evarūpāni padāni imasmiṃ vāre na gahitāni. Yāni pana padāni dhammadhātuyā sampayutte dhamme viññāṇañca aññena asammissaṃ dīpenti, tāni idha gahitāni. Tesaṃ idamuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Cattāro ",
      " khandhāyatanañca ekaṃ,"
    ],
    "innerText": "‘‘Cattāro khandhāyatanañca ekaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dve indriyā dhātupadāni satta;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tayo paṭiccā atha phassasattakaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tike tayo satta mahantare ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ekaṃ savitakkaṃ, savicāramekaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yuttaṃ upekkhāya ca ekamevā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pariyosāne – khandhā caturotiādināpi ayamevattho saṅgahito. Tattha yāni padāni sadisavissajjanāni, tāni uppaṭipāṭiyāpi samodhānetvā tattha vedanākkhandhādikā pañhā katā. Tesu evaṃ khandhādivibhāgo veditabbo. Vedanākkhandhādipañhe tāva – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekenā"
      },
      "ti manāyatanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattahī"
      },
      "ti viññāṇadhātūhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kehicī"
      },
      "ti dhammāyatane vedanādīhi. Viññāṇadhātupañhe ",
      " – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "te dhammā na kehicī"
      },
      "ti te pucchāya uddhaṭapadaṃ viññāṇadhātuṃ ṭhapetvā sesā cha viññāṇadhātudhammā, rūpaṃ, nibbānañca. Tehi sabbesaṃ khandhāyatanānaṃ saṅgahitattā na kehici khandhehi āyatanehi vā vippayuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekāya dhātuyā"
      },
      "ti yā yā pucchāya uddhaṭā hoti tāya tāya."
    ],
    "innerText": "Pariyosāne – khandhā caturotiādināpi ayamevattho saṅgahito. Tattha yāni padāni sadisavissajjanāni, tāni uppaṭipāṭiyāpi samodhānetvā tattha vedanākkhandhādikā pañhā katā. Tesu evaṃ khandhādivibhāgo veditabbo. Vedanākkhandhādipañhe tāva – ekenāti manāyatanena. Sattahīti viññāṇadhātūhi. Kehicīti dhammāyatane vedanādīhi. Viññāṇadhātupañhe – te dhammā na kehicīti te pucchāya uddhaṭapadaṃ viññāṇadhātuṃ ṭhapetvā sesā cha viññāṇadhātudhammā, rūpaṃ, nibbānañca. Tehi sabbesaṃ khandhāyatanānaṃ saṅgahitattā na kehici khandhehi āyatanehi vā vippayuttā. Ekāya dhātuyāti yā yā pucchāya uddhaṭā hoti tāya tāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "309"
      },
      ". Upekkhindriyapañhe – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcahī"
      },
      "ti upekkhāsampayuttāhi cakkhuviññāṇadhātuādīhi. Iminā nayena sabbattha pucchāya uddhaṭapadeneva saddhiṃ vippayuttānaṃ vasena attho veditabboti."
    ],
    "innerText": "309. Upekkhindriyapañhe – pañcahīti upekkhāsampayuttāhi cakkhuviññāṇadhātuādīhi. Iminā nayena sabbattha pucchāya uddhaṭapadeneva saddhiṃ vippayuttānaṃ vasena attho veditabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sampayuttenavippayuttapadavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "8. Aṭṭhamanayo vippayuttenasampayuttapadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "317"
      },
      ". Idāni vippayuttenasampayuttapadaṃ bhājetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpakkhandhenā"
      },
      "tiādi āraddhaṃ. Tattha sabbāpi pucchā moghapucchāva ",
      ". Rūpakkhandhena hi vippayuttā nāma cattāro khandhā, tesaṃ aññehi sampayogo natthi. Vedanākkhandhena vippayuttaṃ rūpaṃ nibbānañca, tassa ca kenaci sampayogo natthi. Evaṃ sabbapadesu. Vippayuttānaṃ pana sampayogābhāvo veditabbo. Iti pucchāya moghattā sabbavissajjanesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "natthi natthi"
      },
      "icceva vuttanti."
    ],
    "innerText": "317. Idāni vippayuttenasampayuttapadaṃ bhājetuṃ rūpakkhandhenātiādi āraddhaṃ. Tattha sabbāpi pucchā moghapucchāva . Rūpakkhandhena hi vippayuttā nāma cattāro khandhā, tesaṃ aññehi sampayogo natthi. Vedanākkhandhena vippayuttaṃ rūpaṃ nibbānañca, tassa ca kenaci sampayogo natthi. Evaṃ sabbapadesu. Vippayuttānaṃ pana sampayogābhāvo veditabbo. Iti pucchāya moghattā sabbavissajjanesu natthi natthiicceva vuttanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vippayuttenasampayuttapadavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "9. Navamanayo sampayuttenasampayuttapadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "319"
      },
      ". Idāni ",
      " sampayuttenasampayuttapadaṃ bhājetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedanākkhandhenā"
      },
      "tiādi āraddhaṃ. Tattha yaṃ ",
      " khandhādivasena sampayuttaṃ, puna tasseva khandhādīhi sampayogaṃ pucchitvā vissajjanaṃ kataṃ. Taṃ rūpena vā rūpamissakehi vā sabbarūpakkhandhasaṅgāhakehi vā padehi saddhiṃ na yujjati. Rūpena hi rūpamissakena vā aññesaṃ sampayogo natthi. Sabbarūpakkhandhasaṅgāhakehi sabbesaṃ sampayogārahānaṃ khandhādīnaṃ gahitattā aññaṃyeva natthi, yaṃ tena saha sampayogaṃ gaccheyya. Tasmā tathārūpāni padāni idha na gahitāni. Yāni pana padāni rūpena asammissaṃ arūpekadesaṃ dīpenti, tāni idha gahitāni. Tesaṃ idamuddānaṃ –"
    ],
    "innerText": "319. Idāni sampayuttenasampayuttapadaṃ bhājetuṃ vedanākkhandhenātiādi āraddhaṃ. Tattha yaṃ khandhādivasena sampayuttaṃ, puna tasseva khandhādīhi sampayogaṃ pucchitvā vissajjanaṃ kataṃ. Taṃ rūpena vā rūpamissakehi vā sabbarūpakkhandhasaṅgāhakehi vā padehi saddhiṃ na yujjati. Rūpena hi rūpamissakena vā aññesaṃ sampayogo natthi. Sabbarūpakkhandhasaṅgāhakehi sabbesaṃ sampayogārahānaṃ khandhādīnaṃ gahitattā aññaṃyeva natthi, yaṃ tena saha sampayogaṃ gaccheyya. Tasmā tathārūpāni padāni idha na gahitāni. Yāni pana padāni rūpena asammissaṃ arūpekadesaṃ dīpenti, tāni idha gahitāni. Tesaṃ idamuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Arūpakkhandhā cattāro, manāyatanameva ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Viññāṇadhātuyo satta, dve saccā cuddasindriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Paccaye dvādasa padā, tato upari soḷasa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tikesu aṭṭha gocchake, tecattālīsameva ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mahantaraduke satta, padā piṭṭhidukesu cha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Navamassa padassete, niddese saṅgahaṃ gatā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbapañhesu pana ye dhammā pucchāya uddhaṭā, te yehi sampayuttā honti, tesaṃ vasena khandhādibhedo veditabbo ",
      ". Vedanākkhandhena hi itare tayo khandhā sampayuttā, puna tehi vedanākkhandho sampayutto. So tehi saññādīhi tīhi khandhehi, ekena manāyatanena, sattahi viññāṇadhātūhi, ekasmiṃ dhammāyatane, dhammadhātuyā ca, kehici saññāsaṅkhāreheva sampayutto. Eseva nayo sabbatthāti."
    ],
    "innerText": "Sabbapañhesu pana ye dhammā pucchāya uddhaṭā, te yehi sampayuttā honti, tesaṃ vasena khandhādibhedo veditabbo . Vedanākkhandhena hi itare tayo khandhā sampayuttā, puna tehi vedanākkhandho sampayutto. So tehi saññādīhi tīhi khandhehi, ekena manāyatanena, sattahi viññāṇadhātūhi, ekasmiṃ dhammāyatane, dhammadhātuyā ca, kehici saññāsaṅkhāreheva sampayutto. Eseva nayo sabbatthāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sampayuttenasampayuttapadavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "10. Dasamanayo vippayuttenavippayuttapadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "353"
      },
      ". Idāni ",
      " vippayuttenavippayuttapadaṃ bhājetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpakkhandhenā"
      },
      "tiādi āraddhaṃ. Tattha ye sampayogavippayogapadaniddese rūpakkhandhādayo dhammā uddhaṭā, sabbapucchāsu teyeva uddhaṭā. Sadisavissajjanānaṃ pana ekato gahitattā ",
      " padāni aññāya paṭipāṭiyā āgatāni. Tattha yaṃ padaṃ pucchāya uddhaṭaṃ, taṃ yehi dhammehi vippayuttaṃ, tesaṃ vasena khandhādivibhāgo veditabbo. Rūpakkhandhena hi vedanādayo vippayuttā, tehi ca rūpakkhandho vippayutto. Nibbānaṃ pana sukhumarūpagatikameva. So rūpakkhandho catūhi khandhehi, ekena manāyatanena sattahi viññāṇadhātūhi, dhammāyatanadhammadhātūsu, kehici vedanādīhi dhammeheva vippayutto. Eseva nayo sabbatthāti."
    ],
    "innerText": "353. Idāni vippayuttenavippayuttapadaṃ bhājetuṃ rūpakkhandhenātiādi āraddhaṃ. Tattha ye sampayogavippayogapadaniddese rūpakkhandhādayo dhammā uddhaṭā, sabbapucchāsu teyeva uddhaṭā. Sadisavissajjanānaṃ pana ekato gahitattā padāni aññāya paṭipāṭiyā āgatāni. Tattha yaṃ padaṃ pucchāya uddhaṭaṃ, taṃ yehi dhammehi vippayuttaṃ, tesaṃ vasena khandhādivibhāgo veditabbo. Rūpakkhandhena hi vedanādayo vippayuttā, tehi ca rūpakkhandho vippayutto. Nibbānaṃ pana sukhumarūpagatikameva. So rūpakkhandho catūhi khandhehi, ekena manāyatanena sattahi viññāṇadhātūhi, dhammāyatanadhammadhātūsu, kehici vedanādīhi dhammeheva vippayutto. Eseva nayo sabbatthāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vippayuttenavippayuttapadavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "11. Ekādasamanayo saṅgahitenasampayuttavippayuttapadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "409"
      },
      ". Idāni saṅgahitenasampayuttavippayuttapadaṃ bhājetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samudayasaccenā"
      },
      "tiādi āraddhaṃ. Tattha ye saṅgahitenasaṅgahitapadaniddese samudayasaccādayova dhammā uddhaṭā, sabbapucchāsu teyeva uddhaṭā. Sadisavissajjanānaṃ pana ekato gahitattā padāni aññāya paṭipāṭiyā āgatāni. Tattha ye dhammā pucchāya uddhaṭapadena khandhādisaṅgahena saṅgahitā, tesaṃ yehi sampayogo vā vippayogo vā hoti, tesaṃ vasena ",
      " khandhādivibhāgo veditabbo."
    ],
    "innerText": "409. Idāni saṅgahitenasampayuttavippayuttapadaṃ bhājetuṃ samudayasaccenātiādi āraddhaṃ. Tattha ye saṅgahitenasaṅgahitapadaniddese samudayasaccādayova dhammā uddhaṭā, sabbapucchāsu teyeva uddhaṭā. Sadisavissajjanānaṃ pana ekato gahitattā padāni aññāya paṭipāṭiyā āgatāni. Tattha ye dhammā pucchāya uddhaṭapadena khandhādisaṅgahena saṅgahitā, tesaṃ yehi sampayogo vā vippayogo vā hoti, tesaṃ vasena khandhādivibhāgo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ nayo – samudayasaccena tāva saṅkhārakkhandhapariyāpannā dhammā khandhādisaṅgahena saṅgahitā. Te ca sesehi tīhi khandhehi, ekena manāyatanena, sattahi viññāṇadhātūhi, saṅkhārakkhandhe dhammāyatanadhammadhātūsu ca ṭhapetvā taṇhaṃ sesehi sampayuttattā kehici sampayuttā nāma. Ekena pana rūpakkhandhena, dasahi rūpāyatanehi, rūpadhātūhi ca vippayuttā, ekasmiṃ dhammāyatane ",
      " dhammadhātuyā ca, rūpanibbānehi vippayuttattā kehici vippayuttā nāma. Iminā upāyena sabbattha attho veditabboti."
    ],
    "innerText": "Tatrāyaṃ nayo – samudayasaccena tāva saṅkhārakkhandhapariyāpannā dhammā khandhādisaṅgahena saṅgahitā. Te ca sesehi tīhi khandhehi, ekena manāyatanena, sattahi viññāṇadhātūhi, saṅkhārakkhandhe dhammāyatanadhammadhātūsu ca ṭhapetvā taṇhaṃ sesehi sampayuttattā kehici sampayuttā nāma. Ekena pana rūpakkhandhena, dasahi rūpāyatanehi, rūpadhātūhi ca vippayuttā, ekasmiṃ dhammāyatane dhammadhātuyā ca, rūpanibbānehi vippayuttattā kehici vippayuttā nāma. Iminā upāyena sabbattha attho veditabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṅgahitenasampayuttavippayuttapadavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "12. Dvādasamanayo sampayuttenasaṅgahitāsaṅgahitapadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "417"
      },
      ". Idāni ",
      " sampayuttenasaṅgahitāsaṅgahitapadaṃ bhājetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedanākkhandhenā"
      },
      "tiādi āraddhaṃ. Tattha ye sampayuttenasampayuttapadaniddese vedanākkhandhādayo dhammā uddhaṭā, sabbapucchāsu teyeva uddhaṭā. Tattha ye dhammā pucchāya uddhaṭapadena sampayuttā, tesaṃ yehi saṅgaho vā asaṅgaho vā hoti, tesaṃ vasena khandhādibhedo veditabbo."
    ],
    "innerText": "417. Idāni sampayuttenasaṅgahitāsaṅgahitapadaṃ bhājetuṃ vedanākkhandhenātiādi āraddhaṃ. Tattha ye sampayuttenasampayuttapadaniddese vedanākkhandhādayo dhammā uddhaṭā, sabbapucchāsu teyeva uddhaṭā. Tattha ye dhammā pucchāya uddhaṭapadena sampayuttā, tesaṃ yehi saṅgaho vā asaṅgaho vā hoti, tesaṃ vasena khandhādibhedo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatrāyaṃ nayo – vedanākkhandho hi saññādīhi sampayutto. Te saññādayo tīhi saññādikkhandhehi, dvīhi dhammāyatanamanāyatanehi, dhammadhātuyā ceva, sattahi ca viññāṇadhātūhīti aṭṭhahi dhātūhi saṅgahitā, sesāhi khandhāyatanadhātūhi asaṅgahitā. Iminā upāyena sabbattha attho veditabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sampayuttenasaṅgahitāsaṅgahitapadavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "13. Terasamanayo asaṅgahitenasampayuttavippayuttapadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "448"
      },
      ". Idāni asaṅgahitenasampayuttavippayuttapadaṃ ",
      " bhājetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpakkhandhenā"
      },
      "tiādi āraddhaṃ. Tattha ye pañcame asaṅgahitenaasaṅgahitapadaniddese rūpakkhandhena sadisapañhā dhammā, ye ca arūpabhavena sadisā, teyeva uddhaṭā. Sesā pana na ruhantīti na uddhaṭā. Vedanākkhandhena hi ",
      " khandhādivasena pana rūpārūpadhammā asaṅgahitā honti. Tesañca sampayogo nāma natthi. Tasmā yāni padāni ruhanti, tāneva sadisavissajjanehi saddhiṃ samodhānetvā uddhaṭāni. Tattha ye dhammā pucchāya uddhaṭadhammehi khandhādivasena asaṅgahitā, te yehi sampayuttā ca vippayuttā ca, tesaṃ vasena khandhādivibhāgo veditabbo."
    ],
    "innerText": "448. Idāni asaṅgahitenasampayuttavippayuttapadaṃ bhājetuṃ rūpakkhandhenātiādi āraddhaṃ. Tattha ye pañcame asaṅgahitenaasaṅgahitapadaniddese rūpakkhandhena sadisapañhā dhammā, ye ca arūpabhavena sadisā, teyeva uddhaṭā. Sesā pana na ruhantīti na uddhaṭā. Vedanākkhandhena hi khandhādivasena pana rūpārūpadhammā asaṅgahitā honti. Tesañca sampayogo nāma natthi. Tasmā yāni padāni ruhanti, tāneva sadisavissajjanehi saddhiṃ samodhānetvā uddhaṭāni. Tattha ye dhammā pucchāya uddhaṭadhammehi khandhādivasena asaṅgahitā, te yehi sampayuttā ca vippayuttā ca, tesaṃ vasena khandhādivibhāgo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ nayo – rūpakkhandhena tāva viññāṇameva tīhi saṅgahehi asaṅgahitaṃ. Taṃ vedanādīhi tīhi khandhehi, dhammāyatanadhammadhātūsu ca vedanādīheva sampayuttaṃ. Ekena rūpakkhandhena, dasahi rūpāyatanarūpadhātūhi, dhammāyatanadhammadhātūsu ",
      " ca rūpanibbānadhammehi vippayuttaṃ. Taṃ sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "te dhammā tīhi khandhehī"
      },
      "tiādi vuttaṃ. Iminā nayena sabbattha attho veditabboti."
    ],
    "innerText": "Tatrāyaṃ nayo – rūpakkhandhena tāva viññāṇameva tīhi saṅgahehi asaṅgahitaṃ. Taṃ vedanādīhi tīhi khandhehi, dhammāyatanadhammadhātūsu ca vedanādīheva sampayuttaṃ. Ekena rūpakkhandhena, dasahi rūpāyatanarūpadhātūhi, dhammāyatanadhammadhātūsu ca rūpanibbānadhammehi vippayuttaṃ. Taṃ sandhāya te dhammā tīhi khandhehītiādi vuttaṃ. Iminā nayena sabbattha attho veditabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Asaṅgahitenasampayuttavippayuttapadavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "14. Cuddasamanayo vippayuttenasaṅgahitāsaṅgahitapadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "456"
      },
      ". Idāni vippayuttenasaṅgahitāsaṅgahitapadaṃ bhājetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpakkhandhenā"
      },
      "tiādi āraddhaṃ. Tattha yesaṃ padānaṃ vippayogo na ruhati, tāni imasmiṃ vāre na gahitāni. Kāni pana tānīti? Dhammāyatanādīni. Dhammāyatanassa hi khandhādīsu ekenāpi vippayogo na ruhati. Dhammadhātuādīsupi eseva nayo. Tesaṃ idamuddānaṃ –"
    ],
    "innerText": "456. Idāni vippayuttenasaṅgahitāsaṅgahitapadaṃ bhājetuṃ rūpakkhandhenātiādi āraddhaṃ. Tattha yesaṃ padānaṃ vippayogo na ruhati, tāni imasmiṃ vāre na gahitāni. Kāni pana tānīti? Dhammāyatanādīni. Dhammāyatanassa hi khandhādīsu ekenāpi vippayogo na ruhati. Dhammadhātuādīsupi eseva nayo. Tesaṃ idamuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dhammāyatanaṃ dhammadhātu, jīvitindriyameva ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nāmarūpapadañceva, saḷāyatanameva ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Jātiādittayaṃ ekaṃ, padaṃ vīsatime tike;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tikāvasānikaṃ ekaṃ, satta cūḷantare padā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Daseva ",
      " gocchake honti, mahantaramhi cuddasa;"
    ],
    "innerText": "‘‘Daseva gocchake honti, mahantaramhi cuddasa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Cha padāni tato uddhaṃ sabbānipi samāsato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Padāni ca na labbhanti, cattālīsañca satta cā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pariyosāne ",
      " ca – dhammāyatanaṃ dhammadhātūti gāthāpi imamevatthaṃ dīpetuṃ vuttā. Imāni pana ṭhapetvā sesāni sabbānipi labbhanti. Tesu khandhādivibhāgo vuttanayānusāreneva veditabboti."
    ],
    "innerText": "Pariyosāne ca – dhammāyatanaṃ dhammadhātūti gāthāpi imamevatthaṃ dīpetuṃ vuttā. Imāni pana ṭhapetvā sesāni sabbānipi labbhanti. Tesu khandhādivibhāgo vuttanayānusāreneva veditabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vippayuttenasaṅgahitāsaṅgahitapadavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Nigamanakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā ",
      " ca –"
    ],
    "innerText": "Ettāvatā ca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dhātuppabhedakusalo, yaṃ dhātukathaṃ tathāgato āha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tassā nayamukhabheda-ppakāsanaṃ niṭṭhitaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Iminā nayamukhabheda-ppakāsanena hi vibhāvinā sakkā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ñātuṃ sabbepi nayā, saṅkhepakathāva iti vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ekekassa pana sace, padassa vitthārameva bhāseyyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vacanañca ativiya bahuṃ, bhaveyya attho ca aviseso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Iti ūnabhāṇavāradvayāya, yaṃ tantiyā mayā etaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kurunā pattaṃ puññaṃ, sukhāya taṃ hotu lokassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhātukathā-aṭṭhakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammāsambuddhassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "nikaya"
    },
    "innerText": "Abhidhammapiṭake"
  }
]