[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(2) Paccayaniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hetupaccayo"
      },
      "ti ",
      " – hetū hetusampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ hetupaccayena paccayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paccayoti (syā.)]"
      },
      "."
    ],
    "innerText": "1.Hetupaccayoti – hetū hetusampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ hetupaccayena paccayo [paccayoti (syā.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇapaccayo"
      },
      "ti – rūpāyatanaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ ārammaṇapaccayena paccayo. Saddāyatanaṃ sotaviññāṇadhātuyā ",
      " taṃsampayuttakānañca dhammānaṃ ārammaṇapaccayena paccayo. Gandhāyatanaṃ ghānaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ ārammaṇapaccayena paccayo. Rasāyatanaṃ jivhāviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ ārammaṇapaccayena paccayo. Phoṭṭhabbāyatanaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ ārammaṇapaccayena paccayo. Rūpāyatanaṃ saddāyatanaṃ gandhāyatanaṃ rasāyatanaṃ phoṭṭhabbāyatanaṃ manodhātuyā taṃsampayuttakānañca dhammānaṃ ārammaṇapaccayena paccayo. Sabbe dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ ārammaṇapaccayena paccayo."
    ],
    "innerText": "2.Ārammaṇapaccayoti – rūpāyatanaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ ārammaṇapaccayena paccayo. Saddāyatanaṃ sotaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ ārammaṇapaccayena paccayo. Gandhāyatanaṃ ghānaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ ārammaṇapaccayena paccayo. Rasāyatanaṃ jivhāviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ ārammaṇapaccayena paccayo. Phoṭṭhabbāyatanaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ ārammaṇapaccayena paccayo. Rūpāyatanaṃ saddāyatanaṃ gandhāyatanaṃ rasāyatanaṃ phoṭṭhabbāyatanaṃ manodhātuyā taṃsampayuttakānañca dhammānaṃ ārammaṇapaccayena paccayo. Sabbe dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ ārammaṇapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yaṃ yaṃ dhammaṃ ārabbha ye ye dhammā uppajjanti cittacetasikā dhammā, te te dhammā tesaṃ tesaṃ dhammānaṃ ārammaṇapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhipatipaccayo"
      },
      "ti – chandādhipati chandasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ adhipatipaccayena paccayo. Vīriyādhipati vīriyasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ adhipatipaccayena paccayo. Cittādhipati cittasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ adhipatipaccayena paccayo. Vīmaṃsādhipati vīmaṃsasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ adhipatipaccayena paccayo."
    ],
    "innerText": "3.Adhipatipaccayoti – chandādhipati chandasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ adhipatipaccayena paccayo. Vīriyādhipati vīriyasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ adhipatipaccayena paccayo. Cittādhipati cittasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ adhipatipaccayena paccayo. Vīmaṃsādhipati vīmaṃsasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ adhipatipaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yaṃ yaṃ dhammaṃ garuṃ katvā ye ye dhammā uppajjanti cittacetasikā dhammā, te te dhammā tesaṃ tesaṃ dhammānaṃ adhipatipaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anantarapaccayo"
      },
      "ti ",
      " – cakkhuviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā taṃsampayuttakānañca dhammānaṃ anantarapaccayena paccayo. Manodhātu taṃsampayuttakā ca dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ anantarapaccayena paccayo."
    ],
    "innerText": "4.Anantarapaccayoti – cakkhuviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā taṃsampayuttakānañca dhammānaṃ anantarapaccayena paccayo. Manodhātu taṃsampayuttakā ca dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ anantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sotaviññāṇadhātu ",
      " taṃsampayuttakā ca dhammā manodhātuyā taṃsampayuttakānañca dhammānaṃ anantarapaccayena paccayo. Manodhātu taṃsampayuttakā ca dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ anantarapaccayena paccayo."
    ],
    "innerText": "Sotaviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā taṃsampayuttakānañca dhammānaṃ anantarapaccayena paccayo. Manodhātu taṃsampayuttakā ca dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ anantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ghānaviññāṇadhātu ",
      " taṃsampayuttakā ca dhammā manodhātuyā taṃsampayuttakānañca dhammānaṃ anantarapaccayena paccayo. Manodhātu taṃsampayuttakā ca dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ anantarapaccayena paccayo."
    ],
    "innerText": "Ghānaviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā taṃsampayuttakānañca dhammānaṃ anantarapaccayena paccayo. Manodhātu taṃsampayuttakā ca dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ anantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Jivhāviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā taṃsampayuttakānañca dhammānaṃ anantarapaccayena paccayo. Manodhātu taṃsampayuttakā ca dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ anantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kāyaviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā taṃsampayuttakānañca dhammānaṃ anantarapaccayena paccayo. Manodhātu taṃsampayuttakā ca dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ anantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ anantarapaccayena paccayo. Purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ ",
      " abyākatānaṃ dhammānaṃ anantarapaccayena paccayo."
    ],
    "innerText": "Purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ anantarapaccayena paccayo. Purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ abyākatānaṃ dhammānaṃ anantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Purimā purimā akusalā dhammā pacchimānaṃ pacchimānaṃ akusalānaṃ dhammānaṃ anantarapaccayena paccayo. Purimā purimā akusalā dhammā pacchimānaṃ pacchimānaṃ abyākatānaṃ dhammānaṃ anantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Purimā purimā abyākatā dhammā pacchimānaṃ pacchimānaṃ abyākatānaṃ dhammānaṃ anantarapaccayena paccayo. Purimā purimā abyākatā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ anantarapaccayena paccayo. Purimā purimā abyākatā dhammā pacchimānaṃ pacchimānaṃ akusalānaṃ dhammānaṃ anantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yesaṃ ",
      " yesaṃ dhammānaṃ anantarā ye ye dhammā uppajjanti cittacetasikā dhammā, te te dhammā tesaṃ tesaṃ dhammānaṃ anantarapaccayena paccayo."
    ],
    "innerText": "Yesaṃ yesaṃ dhammānaṃ anantarā ye ye dhammā uppajjanti cittacetasikā dhammā, te te dhammā tesaṃ tesaṃ dhammānaṃ anantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samanantarapaccayo"
      },
      "ti – cakkhuviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā taṃsampayuttakānañca dhammānaṃ samanantarapaccayena paccayo. Manodhātu taṃsampayuttakā ca dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ samanantarapaccayena paccayo."
    ],
    "innerText": "5.Samanantarapaccayoti – cakkhuviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā taṃsampayuttakānañca dhammānaṃ samanantarapaccayena paccayo. Manodhātu taṃsampayuttakā ca dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ samanantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sotaviññāṇadhātu ",
      " taṃsampayuttakā ca dhammā manodhātuyā taṃsampayuttakānañca dhammānaṃ samanantarapaccayena paccayo. Manodhātu taṃsampayuttakā ca dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ samanantarapaccayena paccayo."
    ],
    "innerText": "Sotaviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā taṃsampayuttakānañca dhammānaṃ samanantarapaccayena paccayo. Manodhātu taṃsampayuttakā ca dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ samanantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ghāṇaviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā taṃsampayuttakānañca dhammānaṃ samanantarapaccayena paccayo ",
      ". Manodhātu taṃsampayuttakā ca dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ samanantarapaccayena paccayo."
    ],
    "innerText": "Ghāṇaviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā taṃsampayuttakānañca dhammānaṃ samanantarapaccayena paccayo . Manodhātu taṃsampayuttakā ca dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ samanantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Jivhāviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā taṃsampayuttakānañca dhammānaṃ samanantarapaccayena paccayo. Manodhātu taṃsampayuttakā ca dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ samanantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kāyaviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā taṃsampayuttakānañca dhammānaṃ samanantarapaccayena paccayo. Manodhātu taṃsampayuttakā ca dhammā manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ samanantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ samanantarapaccayena paccayo. Purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ abyākatānaṃ dhammānaṃ samanantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Purimā purimā akusalā dhammā pacchimānaṃ pacchimānaṃ akusalānaṃ dhammānaṃ samanantarapaccayena ",
      " paccayo. Purimā purimā akusalā dhammā pacchimānaṃ pacchimānaṃ abyākatānaṃ dhammānaṃ samanantarapaccayena paccayo."
    ],
    "innerText": "Purimā purimā akusalā dhammā pacchimānaṃ pacchimānaṃ akusalānaṃ dhammānaṃ samanantarapaccayena paccayo. Purimā purimā akusalā dhammā pacchimānaṃ pacchimānaṃ abyākatānaṃ dhammānaṃ samanantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Purimā purimā abyākatā dhammā pacchimānaṃ pacchimānaṃ abyākatānaṃ dhammānaṃ samanantarapaccayena paccayo. Purimā purimā abyākatā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ samanantarapaccayena paccayo. Purimā purimā abyākatā dhammā pacchimānaṃ pacchimānaṃ akusalānaṃ dhammānaṃ samanantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yesaṃ ",
      " yesaṃ dhammānaṃ samanantarā ye ye dhammā uppajjanti cittacetasikā dhammā, te te dhammā tesaṃ tesaṃ dhammānaṃ samanantarapaccayena paccayo."
    ],
    "innerText": "Yesaṃ yesaṃ dhammānaṃ samanantarā ye ye dhammā uppajjanti cittacetasikā dhammā, te te dhammā tesaṃ tesaṃ dhammānaṃ samanantarapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātapaccayo"
      },
      "ti ",
      " – cattāro khandhā arūpino aññamaññaṃ sahajātapaccayena paccayo. Cattāro mahābhūtā aññamaññaṃ sahajātapaccayena paccayo. Okkantikkhaṇe nāmarūpaṃ aññamaññaṃ sahajātapaccayena paccayo. Cittacetasikā dhammā cittasamuṭṭhānānaṃ rūpānaṃ sahajātapaccayena paccayo. Mahābhūtā upādārūpānaṃ sahajātapaccayena paccayo. Rūpino dhammā arūpīnaṃ dhammānaṃ kiñci kāle ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kañci kālaṃ (syā.)]"
      },
      " sahajātapaccayena paccayo, kiñci kāle na sahajātapaccayena paccayo."
    ],
    "innerText": "6.Sahajātapaccayoti – cattāro khandhā arūpino aññamaññaṃ sahajātapaccayena paccayo. Cattāro mahābhūtā aññamaññaṃ sahajātapaccayena paccayo. Okkantikkhaṇe nāmarūpaṃ aññamaññaṃ sahajātapaccayena paccayo. Cittacetasikā dhammā cittasamuṭṭhānānaṃ rūpānaṃ sahajātapaccayena paccayo. Mahābhūtā upādārūpānaṃ sahajātapaccayena paccayo. Rūpino dhammā arūpīnaṃ dhammānaṃ kiñci kāle [kañci kālaṃ (syā.)] sahajātapaccayena paccayo, kiñci kāle na sahajātapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññamaññapaccayo"
      },
      "ti – cattāro khandhā arūpino aññamaññapaccayena paccayo. Cattāro mahābhūtā aññamaññapaccayena paccayo. Okkantikkhaṇe nāmarūpaṃ aññamaññapaccayena paccayo."
    ],
    "innerText": "7.Aññamaññapaccayoti – cattāro khandhā arūpino aññamaññapaccayena paccayo. Cattāro mahābhūtā aññamaññapaccayena paccayo. Okkantikkhaṇe nāmarūpaṃ aññamaññapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nissayapaccayo"
      },
      "ti – cattāro khandhā arūpino aññamaññaṃ nissayapaccayena paccayo. Cattāro mahābhūtā aññamaññaṃ nissayapaccayena paccayo. Okkantikkhaṇe nāmarūpaṃ aññamaññaṃ nissayapaccayena paccayo. Cittacetasikā dhammā cittasamuṭṭhānānaṃ rūpānaṃ nissayapaccayena paccayo. Mahābhūtā upādārūpānaṃ nissayapaccayena paccayo."
    ],
    "innerText": "8.Nissayapaccayoti – cattāro khandhā arūpino aññamaññaṃ nissayapaccayena paccayo. Cattāro mahābhūtā aññamaññaṃ nissayapaccayena paccayo. Okkantikkhaṇe nāmarūpaṃ aññamaññaṃ nissayapaccayena paccayo. Cittacetasikā dhammā cittasamuṭṭhānānaṃ rūpānaṃ nissayapaccayena paccayo. Mahābhūtā upādārūpānaṃ nissayapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cakkhāyatanaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ ",
      " nissayapaccayena ",
      " paccayo. Sotāyatanaṃ sotaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ nissayapaccayena paccayo. Ghānāyatanaṃ ghānaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ nissayapaccayena paccayo. Jivhāyatanaṃ jivhāviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ nissayapaccayena paccayo. Kāyāyatanaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ nissayapaccayena paccayo. Yaṃ rūpaṃ nissāya manodhātu ca manoviññāṇadhātu ca vattanti, taṃ rūpaṃ manodhātuyā ca manoviññāṇadhātuyā ca taṃsampayuttakānañca dhammānaṃ nissayapaccayena paccayo."
    ],
    "innerText": "Cakkhāyatanaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ nissayapaccayena paccayo. Sotāyatanaṃ sotaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ nissayapaccayena paccayo. Ghānāyatanaṃ ghānaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ nissayapaccayena paccayo. Jivhāyatanaṃ jivhāviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ nissayapaccayena paccayo. Kāyāyatanaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ nissayapaccayena paccayo. Yaṃ rūpaṃ nissāya manodhātu ca manoviññāṇadhātu ca vattanti, taṃ rūpaṃ manodhātuyā ca manoviññāṇadhātuyā ca taṃsampayuttakānañca dhammānaṃ nissayapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upanissayapaccayo"
      },
      "ti – purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ upanissayapaccayena paccayo. Purimā purimā kusalā ",
      " dhammā pacchimānaṃ pacchimānaṃ akusalānaṃ dhammānaṃ kesañci upanissayapaccayena paccayo. Purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ abyākatānaṃ dhammānaṃ upanissayapaccayena paccayo."
    ],
    "innerText": "9.Upanissayapaccayoti – purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ upanissayapaccayena paccayo. Purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ akusalānaṃ dhammānaṃ kesañci upanissayapaccayena paccayo. Purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ abyākatānaṃ dhammānaṃ upanissayapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Purimā purimā akusalā dhammā pacchimānaṃ pacchimānaṃ akusalānaṃ dhammānaṃ upanissayapaccayena paccayo. Purimā purimā akusalā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ kesañci upanissayapaccayena paccayo. Purimā purimā akusalā dhammā pacchimānaṃ pacchimānaṃ abyākatānaṃ dhammānaṃ upanissayapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Purimā purimā abyākatā dhammā pacchimānaṃ pacchimānaṃ abyākatānaṃ dhammānaṃ upanissayapaccayena paccayo ",
      ". Purimā purimā abyākatā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ upanissayapaccayena paccayo. Purimā purimā abyākatā dhammā pacchimānaṃ pacchimānaṃ akusalānaṃ dhammānaṃ upanissayapaccayena paccayo."
    ],
    "innerText": "Purimā purimā abyākatā dhammā pacchimānaṃ pacchimānaṃ abyākatānaṃ dhammānaṃ upanissayapaccayena paccayo . Purimā purimā abyākatā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ upanissayapaccayena paccayo. Purimā purimā abyākatā dhammā pacchimānaṃ pacchimānaṃ akusalānaṃ dhammānaṃ upanissayapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Utubhojanampi upanissayapaccayena paccayo. Puggalopi upanissayapaccayena paccayo. Senāsanampi upanissayapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātapaccayo"
      },
      "ti – cakkhāyatanaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Sotāyatanaṃ sotaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Ghānāyatanaṃ ghānaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena ",
      " paccayo. Jivhāyatanaṃ jivhāviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Kāyāyatanaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo."
    ],
    "innerText": "10.Purejātapaccayoti – cakkhāyatanaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Sotāyatanaṃ sotaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Ghānāyatanaṃ ghānaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Jivhāyatanaṃ jivhāviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Kāyāyatanaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rūpāyatanaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Saddāyatanaṃ sotaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Gandhāyatanaṃ ghānaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Rasāyatanaṃ jivhāviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Phoṭṭhabbāyatanaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Rūpāyatanaṃ ",
      " saddāyatanaṃ gandhāyatanaṃ rasāyatanaṃ phoṭṭhabbāyatanaṃ manodhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo."
    ],
    "innerText": "Rūpāyatanaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Saddāyatanaṃ sotaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Gandhāyatanaṃ ghānaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Rasāyatanaṃ jivhāviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Phoṭṭhabbāyatanaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Rūpāyatanaṃ saddāyatanaṃ gandhāyatanaṃ rasāyatanaṃ phoṭṭhabbāyatanaṃ manodhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yaṃ rūpaṃ nissāya manodhātu ca manoviññāṇadhātu ",
      " ca vattanti, taṃ rūpaṃ manodhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ kiñci kāle purejātapaccayena paccayo, kiñci kāle na purejātapaccayena paccayo."
    ],
    "innerText": "Yaṃ rūpaṃ nissāya manodhātu ca manoviññāṇadhātu ca vattanti, taṃ rūpaṃ manodhātuyā taṃsampayuttakānañca dhammānaṃ purejātapaccayena paccayo. Manoviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ kiñci kāle purejātapaccayena paccayo, kiñci kāle na purejātapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchājātapaccayo"
      },
      "ti – pacchājātā cittacetasikā dhammā purejātassa imassa kāyassa pacchājātapaccayena paccayo."
    ],
    "innerText": "11.Pacchājātapaccayoti – pacchājātā cittacetasikā dhammā purejātassa imassa kāyassa pacchājātapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsevanapaccayo"
      },
      "ti – purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ āsevanapaccayena paccayo. Purimā purimā akusalā dhammā pacchimānaṃ pacchimānaṃ akusalānaṃ dhammānaṃ āsevanapaccayena paccayo. Purimā purimā kiriyābyākatā dhammā pacchimānaṃ pacchimānaṃ kiriyābyākatānaṃ dhammānaṃ āsevanapaccayena paccayo."
    ],
    "innerText": "12.Āsevanapaccayoti – purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ āsevanapaccayena paccayo. Purimā purimā akusalā dhammā pacchimānaṃ pacchimānaṃ akusalānaṃ dhammānaṃ āsevanapaccayena paccayo. Purimā purimā kiriyābyākatā dhammā pacchimānaṃ pacchimānaṃ kiriyābyākatānaṃ dhammānaṃ āsevanapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammapaccayo"
      },
      "ti – kusalākusalaṃ kammaṃ vipākānaṃ khandhānaṃ kaṭattā ca rūpānaṃ kammapaccayena paccayo. Cetanā sampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ kammapaccayena paccayo."
    ],
    "innerText": "13.Kammapaccayoti – kusalākusalaṃ kammaṃ vipākānaṃ khandhānaṃ kaṭattā ca rūpānaṃ kammapaccayena paccayo. Cetanā sampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ kammapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipākapaccayo"
      },
      "ti ",
      " – vipākā cattāro khandhā arūpino aññamaññaṃ vipākapaccayena paccayo."
    ],
    "innerText": "14.Vipākapaccayoti – vipākā cattāro khandhā arūpino aññamaññaṃ vipākapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āhārapaccayo"
      },
      "ti – kabaḷīkāro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kabaḷiṅkāro (ka. sī. syā.)]"
      },
      " āhāro imassa kāyassa āhārapaccayena paccayo. Arūpino āhārā sampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ āhārapaccayena paccayo."
    ],
    "innerText": "15.Āhārapaccayoti – kabaḷīkāro [kabaḷiṅkāro (ka. sī. syā.)] āhāro imassa kāyassa āhārapaccayena paccayo. Arūpino āhārā sampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ āhārapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Indriyapaccayo"
      },
      "ti ",
      " – cakkhundriyaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ indriyapaccayena paccayo. Sotindriyaṃ sotaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ indriyapaccayena paccayo. Ghānindriyaṃ ",
      " ghānaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ indriyapaccayena paccayo. Jivhindriyaṃ jivhāviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ indriyapaccayena paccayo. Kāyindriyaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ indriyapaccayena paccayo. Rūpajīvitindriyaṃ kaṭattārūpānaṃ indriyapaccayena paccayo."
    ],
    "innerText": "16.Indriyapaccayoti – cakkhundriyaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ indriyapaccayena paccayo. Sotindriyaṃ sotaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ indriyapaccayena paccayo. Ghānindriyaṃ ghānaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ indriyapaccayena paccayo. Jivhindriyaṃ jivhāviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ indriyapaccayena paccayo. Kāyindriyaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ indriyapaccayena paccayo. Rūpajīvitindriyaṃ kaṭattārūpānaṃ indriyapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Arūpino indriyā sampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ indriyapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhānapaccayo"
      },
      "ti – jhānaṅgāni jhānasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ jhānapaccayena paccayo."
    ],
    "innerText": "17.Jhānapaccayoti – jhānaṅgāni jhānasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ jhānapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maggapaccayo"
      },
      "ti – maggaṅgāni maggasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ maggapaccayena paccayo."
    ],
    "innerText": "18.Maggapaccayoti – maggaṅgāni maggasampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ maggapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampayuttapaccayo"
      },
      "ti – cattāro khandhā arūpino aññamaññaṃ sampayuttapaccayena paccayo."
    ],
    "innerText": "19.Sampayuttapaccayoti – cattāro khandhā arūpino aññamaññaṃ sampayuttapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vippayuttapaccayo"
      },
      "ti – rūpino dhammā arūpīnaṃ dhammānaṃ vippayuttapaccayena paccayo. Arūpino dhammā rūpīnaṃ dhammānaṃ vippayuttapaccayena paccayo."
    ],
    "innerText": "20.Vippayuttapaccayoti – rūpino dhammā arūpīnaṃ dhammānaṃ vippayuttapaccayena paccayo. Arūpino dhammā rūpīnaṃ dhammānaṃ vippayuttapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthipaccayo"
      },
      "ti ",
      " – cattāro khandhā arūpino aññamaññaṃ atthipaccayena paccayo. Cattāro mahābhūtā aññamaññaṃ atthipaccayena paccayo. Okkantikkhaṇe nāmarūpaṃ aññamaññaṃ atthipaccayena paccayo. Cittacetasikā dhammā cittasamuṭṭhānānaṃ rūpānaṃ atthipaccayena paccayo. Mahābhūtā upādārūpānaṃ atthipaccayena paccayo."
    ],
    "innerText": "21.Atthipaccayoti – cattāro khandhā arūpino aññamaññaṃ atthipaccayena paccayo. Cattāro mahābhūtā aññamaññaṃ atthipaccayena paccayo. Okkantikkhaṇe nāmarūpaṃ aññamaññaṃ atthipaccayena paccayo. Cittacetasikā dhammā cittasamuṭṭhānānaṃ rūpānaṃ atthipaccayena paccayo. Mahābhūtā upādārūpānaṃ atthipaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Cakkhāyatanaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo. Sotāyatanaṃ sotaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo. Ghānāyatanaṃ ghānaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo. Jivhāyatanaṃ jivhāviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo. Kāyāyatanaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rūpāyatanaṃ ",
      " cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo. Saddāyatanaṃ sotaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo. Gandhāyatanaṃ ghānaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo. Rasāyatanaṃ jivhāviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo. Phoṭṭhabbāyatanaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo. Rūpāyatanaṃ saddāyatanaṃ gandhāyatanaṃ rasāyatanaṃ phoṭṭhabbāyatanaṃ manodhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo."
    ],
    "innerText": "Rūpāyatanaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo. Saddāyatanaṃ sotaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo. Gandhāyatanaṃ ghānaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo. Rasāyatanaṃ jivhāviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo. Phoṭṭhabbāyatanaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo. Rūpāyatanaṃ saddāyatanaṃ gandhāyatanaṃ rasāyatanaṃ phoṭṭhabbāyatanaṃ manodhātuyā taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yaṃ rūpaṃ nissāya manodhātu ca manoviññāṇadhātu ",
      " ca vattanti, taṃ rūpaṃ manodhātuyā ca manoviññāṇadhātuyā ca taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo."
    ],
    "innerText": "Yaṃ rūpaṃ nissāya manodhātu ca manoviññāṇadhātu ca vattanti, taṃ rūpaṃ manodhātuyā ca manoviññāṇadhātuyā ca taṃsampayuttakānañca dhammānaṃ atthipaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Natthipaccayo"
      },
      "ti – samanantaraniruddhā cittacetasikā dhammā paṭuppannānaṃ cittacetasikānaṃ dhammānaṃ natthipaccayena paccayo."
    ],
    "innerText": "22.Natthipaccayoti – samanantaraniruddhā cittacetasikā dhammā paṭuppannānaṃ cittacetasikānaṃ dhammānaṃ natthipaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vigatapaccayo"
      },
      "ti – samanantaravigatā cittacetasikā dhammā paṭuppannānaṃ cittacetasikānaṃ dhammānaṃ vigatapaccayena paccayo."
    ],
    "innerText": "23.Vigatapaccayoti – samanantaravigatā cittacetasikā dhammā paṭuppannānaṃ cittacetasikānaṃ dhammānaṃ vigatapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avigatapaccayo"
      },
      "ti ",
      " – cattāro khandhā arūpino aññamaññaṃ avigatapaccayena paccayo. Cattāro mahābhūtā aññamaññaṃ avigatapaccayena paccayo ",
      ". Okkantikkhaṇe nāmarūpaṃ aññamaññaṃ avigatapaccayena paccayo. Cittacetasikā dhammā cittasamuṭṭhānānaṃ rūpānaṃ avigatapaccayena paccayo. Mahābhūtā upādārūpānaṃ avigatapaccayena paccayo."
    ],
    "innerText": "24.Avigatapaccayoti – cattāro khandhā arūpino aññamaññaṃ avigatapaccayena paccayo. Cattāro mahābhūtā aññamaññaṃ avigatapaccayena paccayo . Okkantikkhaṇe nāmarūpaṃ aññamaññaṃ avigatapaccayena paccayo. Cittacetasikā dhammā cittasamuṭṭhānānaṃ rūpānaṃ avigatapaccayena paccayo. Mahābhūtā upādārūpānaṃ avigatapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Cakkhāyatanaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo. Sotāyatanaṃ sotaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo. Ghānāyatanaṃ ghānaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo. Jivhāyatanaṃ jivhāviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo. Kāyāyatanaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rūpāyatanaṃ ",
      " cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo. Saddāyatanaṃ sotaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo. Gandhāyatanaṃ ghānaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo. Rasāyatanaṃ jivhāviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo. Phoṭṭhabbāyatanaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo. Rūpāyatanaṃ saddāyatanaṃ gandhāyatanaṃ rasāyatanaṃ phoṭṭhabbāyatanaṃ manodhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo."
    ],
    "innerText": "Rūpāyatanaṃ cakkhuviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo. Saddāyatanaṃ sotaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo. Gandhāyatanaṃ ghānaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo. Rasāyatanaṃ jivhāviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo. Phoṭṭhabbāyatanaṃ kāyaviññāṇadhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo. Rūpāyatanaṃ saddāyatanaṃ gandhāyatanaṃ rasāyatanaṃ phoṭṭhabbāyatanaṃ manodhātuyā taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yaṃ rūpaṃ nissāya manodhātu ca manoviññāṇadhātu ca vattanti, taṃ rūpaṃ manodhātuyā ca manoviññāṇadhātuyā ca taṃsampayuttakānañca dhammānaṃ avigatapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccayaniddeso."
  }
]