[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "4. Jahatikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Nasuttāharaṇakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "279"
      },
      ". Idāni ",
      " jahatikathā nāma hoti. Tattha yesaṃ ‘‘jhānalābhī puthujjano saha saccābhisamayā anāgāmī nāma hoti, tassa puthujjanakāleyeva kāmarāgabyāpādā pahīnā’’ti laddhi seyyathāpi etarahi sammitiyānaṃ, tesaṃ taṃ laddhiṃ bhindituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jahati puthujjano"
      },
      "ti pucchā sakavādissa, jhānavikkhambhitānaṃ pana tesaṃ pariyuṭṭhānaṃ apassantassa paṭiññā paravādissa. Yasmā pana tesaṃ jhānavikkhambhitānampi anāgāmimaggeneva accantaṃ ",
      " pahānaṃ hoti, tasmā puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "accanta"
      },
      "ntiādianuyogo sakavādissa, tathārūpassa pahānassa abhāvato paṭikkhepo itarassa. Vikkhambhetīti accantavikkhambhanameva sandhāya pucchā sakavādissa. Tato paraṃ anāgāmimaggaṭṭhena saddhiṃ puthujjanasaṃsandanaṃ hoti. Taṃ uttānatthameva."
    ],
    "innerText": "279. Idāni jahatikathā nāma hoti. Tattha yesaṃ ‘‘jhānalābhī puthujjano saha saccābhisamayā anāgāmī nāma hoti, tassa puthujjanakāleyeva kāmarāgabyāpādā pahīnā’’ti laddhi seyyathāpi etarahi sammitiyānaṃ, tesaṃ taṃ laddhiṃ bhindituṃ jahati puthujjanoti pucchā sakavādissa, jhānavikkhambhitānaṃ pana tesaṃ pariyuṭṭhānaṃ apassantassa paṭiññā paravādissa. Yasmā pana tesaṃ jhānavikkhambhitānampi anāgāmimaggeneva accantaṃ pahānaṃ hoti, tasmā puna accantantiādianuyogo sakavādissa, tathārūpassa pahānassa abhāvato paṭikkhepo itarassa. Vikkhambhetīti accantavikkhambhanameva sandhāya pucchā sakavādissa. Tato paraṃ anāgāmimaggaṭṭhena saddhiṃ puthujjanasaṃsandanaṃ hoti. Taṃ uttānatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "280"
      },
      ". Tato paraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāgāmiphale saṇṭhātī"
      },
      "ti puṭṭho jhānānāgāmitaṃ sandhāya paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arahatte saṇṭhātī"
      },
      "ti puṭṭho dassanamaggena uddhambhāgiyānaṃ pahānābhāvato paṭikkhipati."
    ],
    "innerText": "280. Tato paraṃ anāgāmiphale saṇṭhātīti puṭṭho jhānānāgāmitaṃ sandhāya paṭijānāti. Arahatte saṇṭhātīti puṭṭho dassanamaggena uddhambhāgiyānaṃ pahānābhāvato paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apubbaṃ acarimaṃ tayo magge"
      },
      "ti puṭṭho tathārūpāya bhāvanāya abhāvā paṭikkhipati. Puna puṭṭho tiṇṇaṃ maggānaṃ kiccasabbhāvaṃ sandhāya paṭijānāti. Sāmaññaphalapucchāsupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katamena maggenā"
      },
      "ti puṭṭho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāgāmimaggenā"
      },
      "ti jhānānāgāmitaṃ sandhāya vadati. Puna saṃyojanappahānaṃ puṭṭho tiṇṇaṃ anāgāmimaggena tesaṃ kilesānaṃ appaheyyattā paṭikkhipati. Dutiyaṃ puṭṭho paṭhamamaggasseva ",
      " jhānānāgāmimaggabhāvaṃ sandhāya paṭijānāti. Sesamettha uttānatthamevāti."
    ],
    "innerText": "Apubbaṃ acarimaṃ tayo maggeti puṭṭho tathārūpāya bhāvanāya abhāvā paṭikkhipati. Puna puṭṭho tiṇṇaṃ maggānaṃ kiccasabbhāvaṃ sandhāya paṭijānāti. Sāmaññaphalapucchāsupi eseva nayo. Katamena maggenāti puṭṭho anāgāmimaggenāti jhānānāgāmitaṃ sandhāya vadati. Puna saṃyojanappahānaṃ puṭṭho tiṇṇaṃ anāgāmimaggena tesaṃ kilesānaṃ appaheyyattā paṭikkhipati. Dutiyaṃ puṭṭho paṭhamamaggasseva jhānānāgāmimaggabhāvaṃ sandhāya paṭijānāti. Sesamettha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Jahatikathā."
  }
]