[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "1. Mātikāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cha"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññattiyo – khandhapaññatti…pe… puggalapaññattī"
      },
      "ti ayaṃ tāva puggalapaññattiyā uddeso. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chā"
      },
      "ti gaṇanaparicchedo. Tena ye dhamme idha paññapetukāmo tesaṃ gaṇanavasena saṃkhepato paññattiparicchedaṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññattiyo"
      },
      "ti paricchinnadhammanidassanaṃ. Tattha ‘‘ācikkhati deseti paññapeti paṭṭhapetī’’ti (saṃ. ni. 2.20) āgataṭṭhāne paññāpanā dassanā pakāsanā paññatti nāma. ‘‘Supaññattaṃ mañcapīṭha’’nti (pārā. 269) āgataṭṭhāne ṭhapanā nikkhipanā paññatti nāma. Idha ubhayampi vaṭṭati. Cha paññattiyoti hi cha paññāpanā, cha dassanā pakāsanātipi; cha ṭhapanā nikkhipanātipi idha adhippetameva. Nāmapaññatti hi te te dhamme dassetipi, tena tena koṭṭhāsena ṭhapetipi."
    ],
    "innerText": "1.Chapaññattiyo – khandhapaññatti…pe… puggalapaññattīti ayaṃ tāva puggalapaññattiyā uddeso. Tattha chāti gaṇanaparicchedo. Tena ye dhamme idha paññapetukāmo tesaṃ gaṇanavasena saṃkhepato paññattiparicchedaṃ dasseti. Paññattiyoti paricchinnadhammanidassanaṃ. Tattha ‘‘ācikkhati deseti paññapeti paṭṭhapetī’’ti (saṃ. ni. 2.20) āgataṭṭhāne paññāpanā dassanā pakāsanā paññatti nāma. ‘‘Supaññattaṃ mañcapīṭha’’nti (pārā. 269) āgataṭṭhāne ṭhapanā nikkhipanā paññatti nāma. Idha ubhayampi vaṭṭati. Cha paññattiyoti hi cha paññāpanā, cha dassanā pakāsanātipi; cha ṭhapanā nikkhipanātipi idha adhippetameva. Nāmapaññatti hi te te dhamme dassetipi, tena tena koṭṭhāsena ṭhapetipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khandhapaññattī"
      },
      "tiādi pana saṃkhepato tāsaṃ paññattīnaṃ sarūpadassanaṃ. Tattha khandhānaṃ ‘khandhā’ti paññāpanā dassanā pakāsanā ṭhapanā nikkhipanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khandhapaññatti"
      },
      " nāma. Āyatanānaṃ āyatanānīti, dhātūnaṃ dhātuyoti, saccānaṃ saccānīti, indriyānaṃ indriyānīti, puggalānaṃ puggalāti paññāpanā dassanā pakāsanā ṭhapanā nikkhipanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalapaññatti"
      },
      " nāma."
    ],
    "innerText": "Khandhapaññattītiādi pana saṃkhepato tāsaṃ paññattīnaṃ sarūpadassanaṃ. Tattha khandhānaṃ ‘khandhā’ti paññāpanā dassanā pakāsanā ṭhapanā nikkhipanā khandhapaññatti nāma. Āyatanānaṃ āyatanānīti, dhātūnaṃ dhātuyoti, saccānaṃ saccānīti, indriyānaṃ indriyānīti, puggalānaṃ puggalāti paññāpanā dassanā pakāsanā ṭhapanā nikkhipanā puggalapaññatti nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pāḷimuttakena ",
      " pana aṭṭhakathānayena aparāpi cha paññattiyo – vijjamānapaññatti, avijjamānapaññatti, vijjamānena ",
      " avijjamānapaññatti, avijjamānena vijjamānapaññatti, vijjamānena vijjamānapaññatti, avijjamānena avijjamānapaññattīti. Tattha kusalākusalasseva saccikaṭṭhaparamatthavasena vijjamānassa sato sambhūtassa dhammassa paññāpanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijjamānapaññatti"
      },
      " nāma. Tathā avijjamānassa lokaniruttimattasiddhassa itthipurisādikassa paññāpanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avijjamānapaññatti"
      },
      " nāma. Sabbākārenapi anupalabbhaneyyassa vācāvatthumattasseva pañcamasaccādikassa titthiyānaṃ aṇupakatipurisādikassa vā paññāpanāpi avijjamānapaññattiyeva. Sā pana sāsanāvacarā na hotīti idha na gahitā. Iti imesaṃ vijjamānāvijjamānānaṃ vikappanavasena sesā veditabbā. ‘Tevijjo’, ‘chaḷabhiñño’tiādīsu hi tisso vijjā cha abhiññā ca vijjamānā, puggalo avijjamāno. Tasmā tisso vijjā assāti tevijjo, cha abhiññā assāti chaḷabhiññoti evaṃ vijjamānena avijjamānassa paññāpanato evarūpā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijjamānena avijjamānapaññatti"
      },
      " nāma. ‘Itthirūpaṃ’, ‘purisarūpa’ntiādīsu ",
      " pana itthipurisā avijjamānā, rūpaṃ vijjamānaṃ. Tasmā itthiyā rūpaṃ itthirūpaṃ, purisassa rūpaṃ purisarūpanti evaṃ avijjamānena vijjamānassa paññāpanato evarūpā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avijjamānena vijjamānapaññatti"
      },
      " nāma. Cakkhusamphasso, sotasamphassotiādīsu cakkhusotādayopi phassopi vijjamānoyeva. Tasmā cakkhumhi samphasso, cakkhuto jāto samphasso, cakkhussa vā phalabhūto samphasso cakkhusamphassoti evaṃ vijjamānena vijjamānassa paññāpanato evarūpā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijjamānena vijjamānapaññatti"
      },
      " nāma. Khattiyaputto, brāhmaṇaputto, seṭṭhiputtotiādīsu khattiyādayopi avijjamānā, puttopi. Tasmā khattiyassa putto khattiyaputtoti evaṃ avijjamānena avijjamānassa paññāpanato evarūpā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avijjamānena avijjamānapaññatti"
      },
      " nāma. Tāsu imasmiṃ pakaraṇe purimā tissova paññattiyo labbhanti. ‘‘Khandhapaññatti…pe… indriyapaññattī’’ti imasmiñhi ",
      " ṭhāne vijjamānasseva paññāpitattā vijjamānapaññatti labbhati. ‘‘Puggalapaññattī’’ti pade avijjamānapaññatti. Parato pana ‘tevijjo’, ‘chaḷabhiñño’tiādīsu vijjamānena avijjamānapaññatti labbhatīti."
    ],
    "innerText": "Pāḷimuttakena pana aṭṭhakathānayena aparāpi cha paññattiyo – vijjamānapaññatti, avijjamānapaññatti, vijjamānena avijjamānapaññatti, avijjamānena vijjamānapaññatti, vijjamānena vijjamānapaññatti, avijjamānena avijjamānapaññattīti. Tattha kusalākusalasseva saccikaṭṭhaparamatthavasena vijjamānassa sato sambhūtassa dhammassa paññāpanā vijjamānapaññatti nāma. Tathā avijjamānassa lokaniruttimattasiddhassa itthipurisādikassa paññāpanā avijjamānapaññatti nāma. Sabbākārenapi anupalabbhaneyyassa vācāvatthumattasseva pañcamasaccādikassa titthiyānaṃ aṇupakatipurisādikassa vā paññāpanāpi avijjamānapaññattiyeva. Sā pana sāsanāvacarā na hotīti idha na gahitā. Iti imesaṃ vijjamānāvijjamānānaṃ vikappanavasena sesā veditabbā. ‘Tevijjo’, ‘chaḷabhiñño’tiādīsu hi tisso vijjā cha abhiññā ca vijjamānā, puggalo avijjamāno. Tasmā tisso vijjā assāti tevijjo, cha abhiññā assāti chaḷabhiññoti evaṃ vijjamānena avijjamānassa paññāpanato evarūpā vijjamānena avijjamānapaññatti nāma. ‘Itthirūpaṃ’, ‘purisarūpa’ntiādīsu pana itthipurisā avijjamānā, rūpaṃ vijjamānaṃ. Tasmā itthiyā rūpaṃ itthirūpaṃ, purisassa rūpaṃ purisarūpanti evaṃ avijjamānena vijjamānassa paññāpanato evarūpā avijjamānena vijjamānapaññatti nāma. Cakkhusamphasso, sotasamphassotiādīsu cakkhusotādayopi phassopi vijjamānoyeva. Tasmā cakkhumhi samphasso, cakkhuto jāto samphasso, cakkhussa vā phalabhūto samphasso cakkhusamphassoti evaṃ vijjamānena vijjamānassa paññāpanato evarūpā vijjamānena vijjamānapaññatti nāma. Khattiyaputto, brāhmaṇaputto, seṭṭhiputtotiādīsu khattiyādayopi avijjamānā, puttopi. Tasmā khattiyassa putto khattiyaputtoti evaṃ avijjamānena avijjamānassa paññāpanato evarūpā avijjamānena avijjamānapaññatti nāma. Tāsu imasmiṃ pakaraṇe purimā tissova paññattiyo labbhanti. ‘‘Khandhapaññatti…pe… indriyapaññattī’’ti imasmiñhi ṭhāne vijjamānasseva paññāpitattā vijjamānapaññatti labbhati. ‘‘Puggalapaññattī’’ti pade avijjamānapaññatti. Parato pana ‘tevijjo’, ‘chaḷabhiñño’tiādīsu vijjamānena avijjamānapaññatti labbhatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aṭṭhakathāmuttakena pana ācariyanayena aparāpi cha paññattiyo – upādāpaññatti, upanidhāpaññatti, samodhānapaññatti, upanikkhittapaññatti, tajjāpaññatti, santatipaññattīti ",
      ". Tattha yo rūpavedanādīhi ekattena vā aññattena vā rūpavedanādayo viya saccikaṭṭhaparamatthena anupalabbhasabhāvopi rūpavedanādibhede khandhe upādāya nissāya kāraṇaṃ katvā sammato satto. Tāni tāni aṅgāni upādāya ratho gehaṃ muṭṭhi uddhananti ca; te teyeva rūpādayo upādāya ghaṭo paṭo; candasūriyaparivattādayo upādāya kālo, disā; taṃ taṃ bhūtanimittañceva bhāvanānisaṃsañca upādāya nissāya kāraṇaṃ katvā sammataṃ tena tenākārena upaṭṭhitaṃ uggahanimittaṃ paṭibhāganimittanti ayaṃ evarūpā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upādāpaññatti"
      },
      " nāma. Paññapetabbaṭṭhena cesā paññatti nāma, na paññāpanaṭṭhena. Yā pana tassatthassa paññāpanā, ayaṃ avijjamānapaññattiyeva."
    ],
    "innerText": "Aṭṭhakathāmuttakena pana ācariyanayena aparāpi cha paññattiyo – upādāpaññatti, upanidhāpaññatti, samodhānapaññatti, upanikkhittapaññatti, tajjāpaññatti, santatipaññattīti . Tattha yo rūpavedanādīhi ekattena vā aññattena vā rūpavedanādayo viya saccikaṭṭhaparamatthena anupalabbhasabhāvopi rūpavedanādibhede khandhe upādāya nissāya kāraṇaṃ katvā sammato satto. Tāni tāni aṅgāni upādāya ratho gehaṃ muṭṭhi uddhananti ca; te teyeva rūpādayo upādāya ghaṭo paṭo; candasūriyaparivattādayo upādāya kālo, disā; taṃ taṃ bhūtanimittañceva bhāvanānisaṃsañca upādāya nissāya kāraṇaṃ katvā sammataṃ tena tenākārena upaṭṭhitaṃ uggahanimittaṃ paṭibhāganimittanti ayaṃ evarūpā upādāpaññatti nāma. Paññapetabbaṭṭhena cesā paññatti nāma, na paññāpanaṭṭhena. Yā pana tassatthassa paññāpanā, ayaṃ avijjamānapaññattiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yā paṭhamadutiyādīni upanidhāya dutiyaṃ tatiyantiādikā, aññamaññañca upanidhāya dīghaṃ rassaṃ, dūraṃ, santikantiādikā paññāpanā; ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upanidhāpaññatti"
      },
      " nāma. Apicesā upanidhāpaññatti – tadaññāpekkhūpanidhā, hatthagatūpanidhā, sampayuttūpanidhā, samāropitūpanidhā, avidūragatūpanidhā ",
      ", paṭibhāgūpanidhā, tabbahulūpanidhā, tabbisiṭṭhūpanidhātiādinā bhedena anekappakārā."
    ],
    "innerText": "Yā paṭhamadutiyādīni upanidhāya dutiyaṃ tatiyantiādikā, aññamaññañca upanidhāya dīghaṃ rassaṃ, dūraṃ, santikantiādikā paññāpanā; ayaṃ upanidhāpaññatti nāma. Apicesā upanidhāpaññatti – tadaññāpekkhūpanidhā, hatthagatūpanidhā, sampayuttūpanidhā, samāropitūpanidhā, avidūragatūpanidhā , paṭibhāgūpanidhā, tabbahulūpanidhā, tabbisiṭṭhūpanidhātiādinā bhedena anekappakārā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha dutiyaṃ tatiyantiādikāva tadaññaṃ apekkhitvā vuttatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tadaññāpekkhūpanidhā"
      },
      " nāma. Chattapāṇi, satthapāṇītiādikā hatthagataṃ upanidhāya vuttatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hatthagatūpanidhā"
      },
      " nāma. Kuṇḍalī, sikharī, kiriṭītiādikā sampayuttaṃ upanidhāya vuttatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampayuttūpanidhā"
      },
      " nāma. Dhaññasakaṭaṃ, sappikumbhotiādikā samāropitaṃ upanidhāya vuttatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāropitūpanidhā"
      },
      " nāma. Indasālaguhā, piyaṅguguhā, serīsakantiādikā avidūragataṃ upanidhāya vuttatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avidūragatūpanidhā"
      },
      " nāma. Suvaṇṇavaṇṇo, usabhagāmītiādikā paṭibhāgaṃ upanidhāya vuttatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭibhāgūpanidhā"
      },
      " nāma. Padumassaro, brāhmaṇagāmotiādikā tabbahulaṃ upanidhāya vuttatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tabbahulūpanidhā"
      },
      " nāma. Maṇikaṭakaṃ, vajirakaṭakantiādikā tabbisiṭṭhaṃ upanidhāya vuttatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tabbisiṭṭhūpanidhā"
      },
      " nāma."
    ],
    "innerText": "Tattha dutiyaṃ tatiyantiādikāva tadaññaṃ apekkhitvā vuttatāya tadaññāpekkhūpanidhā nāma. Chattapāṇi, satthapāṇītiādikā hatthagataṃ upanidhāya vuttatāya hatthagatūpanidhā nāma. Kuṇḍalī, sikharī, kiriṭītiādikā sampayuttaṃ upanidhāya vuttatāya sampayuttūpanidhā nāma. Dhaññasakaṭaṃ, sappikumbhotiādikā samāropitaṃ upanidhāya vuttatāya samāropitūpanidhā nāma. Indasālaguhā, piyaṅguguhā, serīsakantiādikā avidūragataṃ upanidhāya vuttatāya avidūragatūpanidhā nāma. Suvaṇṇavaṇṇo, usabhagāmītiādikā paṭibhāgaṃ upanidhāya vuttatāya paṭibhāgūpanidhā nāma. Padumassaro, brāhmaṇagāmotiādikā tabbahulaṃ upanidhāya vuttatāya tabbahulūpanidhā nāma. Maṇikaṭakaṃ, vajirakaṭakantiādikā tabbisiṭṭhaṃ upanidhāya vuttatāya tabbisiṭṭhūpanidhā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yā pana tesaṃ tesaṃ samodhānamapekkhitvā tidaṇḍaṃ, aṭṭhapadaṃ, dhaññarāsi, puppharāsītiādikā paññāpanā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samodhānapaññatti"
      },
      " nāma. Yā purimassa purimassa upanikkhipitvā dve, tīṇi, cattārītiādikā paññāpanā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upanikkhittapaññatti"
      },
      " nāma. Yā taṃ taṃ dhammasabhāvaṃ apekkhitvā pathavī, tejo, kakkhaḷatā, uṇhatātiādikā paññāpanā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tajjāpaññatti"
      },
      " nāma. Yā pana santativicchedābhāvaṃ apekkhitvā āsītiko, nāvutikotiādikā paññāpanā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "santatipaññatti"
      },
      " nāma. Etāsu pana tajjāpaññatti vijjamānapaññattiyeva. Sesā avijjamānapakkhañceva, avijjamānena avijjamānapakkhañca bhajanti."
    ],
    "innerText": "Yā pana tesaṃ tesaṃ samodhānamapekkhitvā tidaṇḍaṃ, aṭṭhapadaṃ, dhaññarāsi, puppharāsītiādikā paññāpanā, ayaṃ samodhānapaññatti nāma. Yā purimassa purimassa upanikkhipitvā dve, tīṇi, cattārītiādikā paññāpanā, ayaṃ upanikkhittapaññatti nāma. Yā taṃ taṃ dhammasabhāvaṃ apekkhitvā pathavī, tejo, kakkhaḷatā, uṇhatātiādikā paññāpanā, ayaṃ tajjāpaññatti nāma. Yā pana santativicchedābhāvaṃ apekkhitvā āsītiko, nāvutikotiādikā paññāpanā, ayaṃ santatipaññatti nāma. Etāsu pana tajjāpaññatti vijjamānapaññattiyeva. Sesā avijjamānapakkhañceva, avijjamānena avijjamānapakkhañca bhajanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aṭṭhakathāmuttakena ācariyanayeneva aparāpi cha paññattiyo – kiccapaññatti, saṇṭhānapaññatti, liṅgapaññatti, bhūmipaññatti, paccattapaññatti, asaṅkhatapaññattīti. Tattha bhāṇako, dhammakathikotiādikā kiccavasena paññāpanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiccapaññatti"
      },
      " nāma. Kiso, thūlo, parimaṇḍalo, caturassotiādikā saṇṭhānavasena paññāpanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṇṭhānapaññatti"
      },
      " nāma. Itthī, purisotiādikā liṅgavasena paññāpanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "liṅgapaññati"
      },
      " nāma. Kāmāvacarā, rūpāvacarā, arūpāvacarā, kosalakā, mādhurātiādikā bhūmivasena paññāpanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhūmipaññatti"
      },
      " nāma. Tisso ",
      ", nāgo, sumanotiādikā paccattanāmakaraṇamattavasena paññāpanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccattapaññatti"
      },
      " nāma. Nirodho, nibbānantiādikā asaṅkhatadhammassa paññāpanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asaṅkhatapaññatti"
      },
      " nāma. Tattha ekaccā bhūmipaññatti asaṅkhatapaññatti ca vijjamānapaññattiyeva, kiccapaññatti vijjamānena avijjamānapakkhaṃ bhajati. Sesā avijjamānapaññattiyo nāma."
    ],
    "innerText": "Aṭṭhakathāmuttakena ācariyanayeneva aparāpi cha paññattiyo – kiccapaññatti, saṇṭhānapaññatti, liṅgapaññatti, bhūmipaññatti, paccattapaññatti, asaṅkhatapaññattīti. Tattha bhāṇako, dhammakathikotiādikā kiccavasena paññāpanā kiccapaññatti nāma. Kiso, thūlo, parimaṇḍalo, caturassotiādikā saṇṭhānavasena paññāpanā saṇṭhānapaññatti nāma. Itthī, purisotiādikā liṅgavasena paññāpanā liṅgapaññati nāma. Kāmāvacarā, rūpāvacarā, arūpāvacarā, kosalakā, mādhurātiādikā bhūmivasena paññāpanā bhūmipaññatti nāma. Tisso , nāgo, sumanotiādikā paccattanāmakaraṇamattavasena paññāpanā paccattapaññatti nāma. Nirodho, nibbānantiādikā asaṅkhatadhammassa paññāpanā asaṅkhatapaññatti nāma. Tattha ekaccā bhūmipaññatti asaṅkhatapaññatti ca vijjamānapaññattiyeva, kiccapaññatti vijjamānena avijjamānapakkhaṃ bhajati. Sesā avijjamānapaññattiyo nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Idāni yāsaṃ paññattīnaṃ uddesavāre saṅkhepato sarūpadassanaṃ kataṃ, saṅkhepatoyeva tāva tāsaṃ vatthuṃ vibhajitvā dassanavasena tā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kittāvatā"
      },
      "tiādimāha. Tattha pucchāya tāva evamattho veditabbo – yā ayaṃ khandhānaṃ ‘khandhā’ti paññāpanā, dassanā, ṭhapanā, sā kittakena hotīti kathetukamyatāpucchā. Parato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kittāvatā āyatanāna"
      },
      "ntiādīsupi eseva nayo. Vissajjanepi evamattho veditabbo – yattakena paññāpanena saṅkhepato pañcakkhandhāti vā pabhedato ‘‘rūpakkhandho…pe… viññāṇakkhandho’’ti vā; tatrāpi rūpakkhandho kāmāvacaro, sesā catubhūmikāti vā evarūpaṃ paññāpanaṃ hoti; ettakena khandhānaṃ ‘khandhā’ti paññatti hoti."
    ],
    "innerText": "2. Idāni yāsaṃ paññattīnaṃ uddesavāre saṅkhepato sarūpadassanaṃ kataṃ, saṅkhepatoyeva tāva tāsaṃ vatthuṃ vibhajitvā dassanavasena tā dassetuṃ kittāvatātiādimāha. Tattha pucchāya tāva evamattho veditabbo – yā ayaṃ khandhānaṃ ‘khandhā’ti paññāpanā, dassanā, ṭhapanā, sā kittakena hotīti kathetukamyatāpucchā. Parato kittāvatā āyatanānantiādīsupi eseva nayo. Vissajjanepi evamattho veditabbo – yattakena paññāpanena saṅkhepato pañcakkhandhāti vā pabhedato ‘‘rūpakkhandho…pe… viññāṇakkhandho’’ti vā; tatrāpi rūpakkhandho kāmāvacaro, sesā catubhūmikāti vā evarūpaṃ paññāpanaṃ hoti; ettakena khandhānaṃ ‘khandhā’ti paññatti hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Tathā yattakena paññāpanena saṅkhepato dvādasāyatanānīti vā, pabhedato ‘‘cakkhāyatanaṃ…pe… dhammāyatana’’nti vā; tatrāpi dasāyatanā kāmāvacarā ",
      ", dvāyatanā catubhūmikāti vā, evarūpaṃ paññāpanaṃ hoti; ettakena āyatanānaṃ āyatanānīti paññatti hoti."
    ],
    "innerText": "3. Tathā yattakena paññāpanena saṅkhepato dvādasāyatanānīti vā, pabhedato ‘‘cakkhāyatanaṃ…pe… dhammāyatana’’nti vā; tatrāpi dasāyatanā kāmāvacarā , dvāyatanā catubhūmikāti vā, evarūpaṃ paññāpanaṃ hoti; ettakena āyatanānaṃ āyatanānīti paññatti hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Yattakena paññāpanena saṅkhepato aṭṭhārasa dhātuyoti vā ",
      ", pabhedato ‘‘cakkhudhātu…pe… manoviññāṇadhātū’’ti vā; tatrāpi soḷasa dhātuyo kāmāvacarā, dve dhātuyo catubhūmikāti vā evarūpaṃ paññāpanaṃ hoti; ettakena dhātūnaṃ dhātūti paññatti hoti."
    ],
    "innerText": "4. Yattakena paññāpanena saṅkhepato aṭṭhārasa dhātuyoti vā , pabhedato ‘‘cakkhudhātu…pe… manoviññāṇadhātū’’ti vā; tatrāpi soḷasa dhātuyo kāmāvacarā, dve dhātuyo catubhūmikāti vā evarūpaṃ paññāpanaṃ hoti; ettakena dhātūnaṃ dhātūti paññatti hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". Yattakena paññāpanena saṅkhepato cattāri saccānīti vā, pabhedato ‘‘dukkhasaccaṃ…pe… nirodhasacca’’nti vā; tatrāpi dve saccā lokiyā, dve saccā lokuttarāti vā evarūpaṃ paññāpanaṃ hoti; ettakena saccānaṃ ‘saccānī’ti paññatti hoti."
    ],
    "innerText": "5. Yattakena paññāpanena saṅkhepato cattāri saccānīti vā, pabhedato ‘‘dukkhasaccaṃ…pe… nirodhasacca’’nti vā; tatrāpi dve saccā lokiyā, dve saccā lokuttarāti vā evarūpaṃ paññāpanaṃ hoti; ettakena saccānaṃ ‘saccānī’ti paññatti hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". Yattakena paññāpanena saṅkhepato bāvīsatindriyānīti vā, pabhedato ‘‘cakkhundriyaṃ…pe… aññātāvindriya’’nti vā; tatrāpi dasindriyāni kāmāvacarāni, navindriyāni ",
      " missakāni, tīṇi indriyāni lokuttarānīti vā evarūpaṃ paññāpanaṃ hoti; ettakena indriyānaṃ indriyānīti paññatti hoti. Ettāvatā saṅkhepato vatthuṃ vibhajitvā dassanavasena pañca paññattiyo dassitā honti."
    ],
    "innerText": "6. Yattakena paññāpanena saṅkhepato bāvīsatindriyānīti vā, pabhedato ‘‘cakkhundriyaṃ…pe… aññātāvindriya’’nti vā; tatrāpi dasindriyāni kāmāvacarāni, navindriyāni missakāni, tīṇi indriyāni lokuttarānīti vā evarūpaṃ paññāpanaṃ hoti; ettakena indriyānaṃ indriyānīti paññatti hoti. Ettāvatā saṅkhepato vatthuṃ vibhajitvā dassanavasena pañca paññattiyo dassitā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". Idāni vitthārato vatthuṃ vibhajitvā dassanavasena puggalapaññattiṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samayavimutto asamayavimutto"
      },
      "tiādimāha. Sammāsambuddhena hi tile visārayamānena viya, vāke hīrayamānena viya ca, heṭṭhā vibhaṅgappakaraṇe imāsaṃ pañcannaṃ paññattīnaṃ vatthubhūtā khandhādayo nippadesena kathitāti tena te idha ekadeseneva kathesi. Chaṭṭhā puggalapaññatti heṭṭhā akathitāva. Idhāpi uddesavāre ekadeseneva kathitā; tasmā taṃ vitthārato kathetukāmo samayavimutto asamayavimuttoti ekakato paṭṭhāya yāva dasakā mātikaṃ ṭhapesīti."
    ],
    "innerText": "7. Idāni vitthārato vatthuṃ vibhajitvā dassanavasena puggalapaññattiṃ dassetuṃ samayavimutto asamayavimuttotiādimāha. Sammāsambuddhena hi tile visārayamānena viya, vāke hīrayamānena viya ca, heṭṭhā vibhaṅgappakaraṇe imāsaṃ pañcannaṃ paññattīnaṃ vatthubhūtā khandhādayo nippadesena kathitāti tena te idha ekadeseneva kathesi. Chaṭṭhā puggalapaññatti heṭṭhā akathitāva. Idhāpi uddesavāre ekadeseneva kathitā; tasmā taṃ vitthārato kathetukāmo samayavimutto asamayavimuttoti ekakato paṭṭhāya yāva dasakā mātikaṃ ṭhapesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mātikāvaṇṇanā."
  }
]