[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Parihānikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Vādayuttiparihānivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "239"
      },
      ". Idāni ",
      " parihānikathā hoti. Parihānidhammo aparihānidhammo, ‘‘dveme, bhikkhave, dhammā sekkhassa, bhikkhuno parihānāya saṃvattanti’’ (a. ni. 2.185), ‘‘pañcime, bhikkhave, dhammā ",
      " samayavimuttassa bhikkhuno parihānāya saṃvattantī’’ti (a. ni. 5.149) evamādīni hi suttāni nissāya sammitiyā vajjiputtakā sabbatthivādino ekacce ca mahāsaṅghikā arahatopi parihāniṃ icchanti, tasmā te vā hontu aññeyeva vā, yesaṃ ayaṃ laddhi, tesaṃ laddhibhindanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parihāyati arahā arahattā"
      },
      "ti pucchā sakavādissa. Tatra ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parihāyatī"
      },
      "ti dve parihāniyo pattaparihāni ca appattaparihāni ca. Tattha ‘‘dutiyampi kho āyasmā godhiko tamhā sāmayikāya cetovimuttiyā parihāyī’’ti (saṃ. ni. 1.159) ayaṃ pattaparihāni nāma. ‘‘Mā vo sāmaññatthikānaṃ sataṃ sāmaññattho parihāyī’’ti (ma. ni. 1.416-418) ayaṃ appattaparihāni. Tāsu idha pattaparihāni adhippetā. Tañhi sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āmantā"
      },
      "ti paṭiññā paravādissa. Sakasamaye pana imaṃ pattaparihāniṃ nāma lokiyasamāpattiyāva icchanti, na arahattādīhi sāmaññaphalehi. Parasamayepi naṃ sabbasāmaññaphalesu sabbabhavesu sabbakālesu sabbesañca puggalānaṃ na icchanti. Taṃ pana tesaṃ laddhimattamevāti sabbaṃ laddhijālaṃ bhindituṃ puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbatthā"
      },
      "tiādinā nayena desanā vaḍḍhitā."
    ],
    "innerText": "239. Idāni parihānikathā hoti. Parihānidhammo aparihānidhammo, ‘‘dveme, bhikkhave, dhammā sekkhassa, bhikkhuno parihānāya saṃvattanti’’ (a. ni. 2.185), ‘‘pañcime, bhikkhave, dhammā samayavimuttassa bhikkhuno parihānāya saṃvattantī’’ti (a. ni. 5.149) evamādīni hi suttāni nissāya sammitiyā vajjiputtakā sabbatthivādino ekacce ca mahāsaṅghikā arahatopi parihāniṃ icchanti, tasmā te vā hontu aññeyeva vā, yesaṃ ayaṃ laddhi, tesaṃ laddhibhindanatthaṃ parihāyati arahā arahattāti pucchā sakavādissa. Tatra parihāyatīti dve parihāniyo pattaparihāni ca appattaparihāni ca. Tattha ‘‘dutiyampi kho āyasmā godhiko tamhā sāmayikāya cetovimuttiyā parihāyī’’ti (saṃ. ni. 1.159) ayaṃ pattaparihāni nāma. ‘‘Mā vo sāmaññatthikānaṃ sataṃ sāmaññattho parihāyī’’ti (ma. ni. 1.416-418) ayaṃ appattaparihāni. Tāsu idha pattaparihāni adhippetā. Tañhi sandhāya āmantāti paṭiññā paravādissa. Sakasamaye pana imaṃ pattaparihāniṃ nāma lokiyasamāpattiyāva icchanti, na arahattādīhi sāmaññaphalehi. Parasamayepi naṃ sabbasāmaññaphalesu sabbabhavesu sabbakālesu sabbesañca puggalānaṃ na icchanti. Taṃ pana tesaṃ laddhimattamevāti sabbaṃ laddhijālaṃ bhindituṃ puna sabbatthātiādinā nayena desanā vaḍḍhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yasmā paravādī kamena parihāyitvā sotāpattiphale ṭhitassa arahato parihāniṃ na icchati, upariphalesu ṭhitasseva icchati. Yasmā ca rūpārūpabhavesu ṭhitassa na icchati, kammārāmatādīnaṃ pana parihāniyadhammānaṃ bhāvato kāmabhave ṭhitasseva icchati, tasmā ‘‘sabbatthā’’ti ",
      " puṭṭho paṭikkhipati. Puna daḷhaṃ katvā puṭṭho kāmabhavaṃ sandhāya paṭijānāti. Sabbasmimpi hi kāmabhave parihānikarā kāmaguṇā atthi, tasmā tattha parihāyatīti tassa laddhi."
    ],
    "innerText": "Tattha yasmā paravādī kamena parihāyitvā sotāpattiphale ṭhitassa arahato parihāniṃ na icchati, upariphalesu ṭhitasseva icchati. Yasmā ca rūpārūpabhavesu ṭhitassa na icchati, kammārāmatādīnaṃ pana parihāniyadhammānaṃ bhāvato kāmabhave ṭhitasseva icchati, tasmā ‘‘sabbatthā’’ti puṭṭho paṭikkhipati. Puna daḷhaṃ katvā puṭṭho kāmabhavaṃ sandhāya paṭijānāti. Sabbasmimpi hi kāmabhave parihānikarā kāmaguṇā atthi, tasmā tattha parihāyatīti tassa laddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatiyapucchāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parihānī"
      },
      "ti parihānikare dhamme pucchati. Tattha yasmā parihāni nāma kammārāmatādidhammā, visesato vā kāmarāgabyāpādā eva, te ca rūpārūpabhave natthi, tasmā ‘‘na heva’’nti paṭikkhepo paravādissa."
    ],
    "innerText": "Tatiyapucchāya parihānīti parihānikare dhamme pucchati. Tattha yasmā parihāni nāma kammārāmatādidhammā, visesato vā kāmarāgabyāpādā eva, te ca rūpārūpabhave natthi, tasmā ‘‘na heva’’nti paṭikkhepo paravādissa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbadā"
      },
      "ti kālapucchā. Tattha paṭhamapañhe yonisomanasikārakāle aparihāyanato paṭikkhipati. Dutiye ayonisomanasikaroto rattibhāge vā divasabhāge vā sabbadā parihāyanato paṭijānāti. Tatiye parihānikaradhammasamāyoge ",
      " sati muhuttameva parihāni nāma hoti, tato pubbe aparihīnassa pacchā parihīnassa ca parihāni nāma natthīti paṭikkhipati."
    ],
    "innerText": "Sabbadāti kālapucchā. Tattha paṭhamapañhe yonisomanasikārakāle aparihāyanato paṭikkhipati. Dutiye ayonisomanasikaroto rattibhāge vā divasabhāge vā sabbadā parihāyanato paṭijānāti. Tatiye parihānikaradhammasamāyoge sati muhuttameva parihāni nāma hoti, tato pubbe aparihīnassa pacchā parihīnassa ca parihāni nāma natthīti paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbeva arahanto"
      },
      "ti pañhānaṃ paṭhamasmiṃ tikkhindriye sandhāya paṭikkhipati. Dutiyasmiṃ mudindriye sandhāya paṭijānāti. Tatiyasmimpi tikkhindriyāva adhippetā. Tesañhi sabbesampi parihāni na hotīti tassa laddhi."
    ],
    "innerText": "Sabbeva arahantoti pañhānaṃ paṭhamasmiṃ tikkhindriye sandhāya paṭikkhipati. Dutiyasmiṃ mudindriye sandhāya paṭijānāti. Tatiyasmimpi tikkhindriyāva adhippetā. Tesañhi sabbesampi parihāni na hotīti tassa laddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seṭṭhiudāharaṇe"
      },
      " paṭhamapucchā paravādissa, dutiyā sakavādissa. Tatrāyaṃ adhippāyo – yaṃ maṃ tumhe pucchatha – ‘‘arahā arahattā parihāyanto catūhi phalehi parihāyatī’’ti, tatra vo paṭipucchāmi – ‘‘catūhi satasahassehi seṭṭhī seṭṭhittaṃ karonto satasahassehi parihīne seṭṭhī seṭṭhittā parihīno hotī’’ti. Tato sakavādinā ekadesena parihāniṃ sandhāya ‘‘āmantā’’ti vutte ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbasāpateyyā parihīno hotī"
      },
      "ti pucchati. Tathā aparihīnattā sakavādī na hevāti vatvā atha naṃ ‘‘evameva arahāpi parihāyati ca. Na ca catūhi phalehī’’ti uppannaladdhikaṃ dutiyaṃ bhabbapañhaṃ pucchati. Paravādī seṭṭhino abhabbatāya niyamaṃ apassanto paṭijānitvā arahato catūhi phalehi parihānibhabbataṃ puṭṭho ‘‘niyato sambodhiparāyaṇo’’ti (a. ni. 3.87) vacanassa ayoniso atthaṃ gahetvā laddhiyaṃ ṭhito sotāpattiphalato parihāyituṃ abhabbataṃ sandhāya paṭikkhipati. Taṃ panassa laddhimattamevāti."
    ],
    "innerText": "Seṭṭhiudāharaṇe paṭhamapucchā paravādissa, dutiyā sakavādissa. Tatrāyaṃ adhippāyo – yaṃ maṃ tumhe pucchatha – ‘‘arahā arahattā parihāyanto catūhi phalehi parihāyatī’’ti, tatra vo paṭipucchāmi – ‘‘catūhi satasahassehi seṭṭhī seṭṭhittaṃ karonto satasahassehi parihīne seṭṭhī seṭṭhittā parihīno hotī’’ti. Tato sakavādinā ekadesena parihāniṃ sandhāya ‘‘āmantā’’ti vutte sabbasāpateyyā parihīno hotīti pucchati. Tathā aparihīnattā sakavādī na hevāti vatvā atha naṃ ‘‘evameva arahāpi parihāyati ca. Na ca catūhi phalehī’’ti uppannaladdhikaṃ dutiyaṃ bhabbapañhaṃ pucchati. Paravādī seṭṭhino abhabbatāya niyamaṃ apassanto paṭijānitvā arahato catūhi phalehi parihānibhabbataṃ puṭṭho ‘‘niyato sambodhiparāyaṇo’’ti (a. ni. 3.87) vacanassa ayoniso atthaṃ gahetvā laddhiyaṃ ṭhito sotāpattiphalato parihāyituṃ abhabbataṃ sandhāya paṭikkhipati. Taṃ panassa laddhimattamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ettāvatā vādayutti nāma niṭṭhitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Ariyapuggalasaṃsandanaparihānivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "240"
      },
      ". Idāni ",
      " ariyapuggalasaṃsandanā āraddhā. Tattha yasmā keci arahatova parihāniṃ icchanti, keci anāgāminopi, keci sakadāgāmissapi. Sotāpannassa pana sabbepi na icchantiyeva. Ye arahattā parihāyitvā anāgāmisakadāgāmibhāve ṭhitā, tesaṃ parihāniṃ icchanti, na itaresaṃ anāgāmisakadāgāmīnaṃ. Sotāpannassa ",
      " pana tepi sabbathāpi na icchantiyeva, tasmā peyyālamukhena pucchā katā. Tattha tesaṃ laddhivasena paṭiññā ca paṭikkhepo ca veditabbā. ‘‘Parihāyati anāgāmī anāgāmiphalā’’ti hi pañhasmiṃ ye anāgāmino parihāniṃ na icchanti, tesaṃ vasena paṭikkhepo. Ye pakatianāgāmino vā arahattā parihāyitvā ṭhitaanāgāmino vā parihāniṃ icchanti, tesaṃ vasena paṭiññāti idamettha nayamukhaṃ. Tassānusārena sabbapeyyālā atthato veditabbā."
    ],
    "innerText": "240. Idāni ariyapuggalasaṃsandanā āraddhā. Tattha yasmā keci arahatova parihāniṃ icchanti, keci anāgāminopi, keci sakadāgāmissapi. Sotāpannassa pana sabbepi na icchantiyeva. Ye arahattā parihāyitvā anāgāmisakadāgāmibhāve ṭhitā, tesaṃ parihāniṃ icchanti, na itaresaṃ anāgāmisakadāgāmīnaṃ. Sotāpannassa pana tepi sabbathāpi na icchantiyeva, tasmā peyyālamukhena pucchā katā. Tattha tesaṃ laddhivasena paṭiññā ca paṭikkhepo ca veditabbā. ‘‘Parihāyati anāgāmī anāgāmiphalā’’ti hi pañhasmiṃ ye anāgāmino parihāniṃ na icchanti, tesaṃ vasena paṭikkhepo. Ye pakatianāgāmino vā arahattā parihāyitvā ṭhitaanāgāmino vā parihāniṃ icchanti, tesaṃ vasena paṭiññāti idamettha nayamukhaṃ. Tassānusārena sabbapeyyālā atthato veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "241"
      },
      ". Yaṃ panettha ‘‘sotāpattiphalassa anantarā arahattaṃyeva sacchikarotī’’ti vuttaṃ, taṃ parihīnassa puna vāyamato arahattappattiṃ sandhāya vuttaṃ. Itaro sotāpattiphalānantaraṃ arahattassa abhāvā paṭikkhipati."
    ],
    "innerText": "241. Yaṃ panettha ‘‘sotāpattiphalassa anantarā arahattaṃyeva sacchikarotī’’ti vuttaṃ, taṃ parihīnassa puna vāyamato arahattappattiṃ sandhāya vuttaṃ. Itaro sotāpattiphalānantaraṃ arahattassa abhāvā paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "242"
      },
      ". Tato paraṃ ‘‘parihāni nāmesā kilesappahānassa vā mandatāya bhaveyya, maggabhāvanādīnaṃ vā anadhimattatāya, saccānaṃ vā adassanenā’’ti evamādīnaṃ vasena anuyuñjituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kassa bahutarā kilesā pahīnā"
      },
      "tiādi vuttaṃ. Taṃ sabbaṃ uttānādhippāyameva suttānaṃ panattho āgamaṭṭhakathāsu vuttanayeneva veditabbo."
    ],
    "innerText": "242. Tato paraṃ ‘‘parihāni nāmesā kilesappahānassa vā mandatāya bhaveyya, maggabhāvanādīnaṃ vā anadhimattatāya, saccānaṃ vā adassanenā’’ti evamādīnaṃ vasena anuyuñjituṃ kassa bahutarā kilesā pahīnātiādi vuttaṃ. Taṃ sabbaṃ uttānādhippāyameva suttānaṃ panattho āgamaṭṭhakathāsu vuttanayeneva veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "262"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samayavimutto arahā arahattā parihāyatī"
      },
      "ti ettha mudindriyo samayavimutto, tikkhindriyo asamayavimuttoti tesaṃ laddhi. Sakasamaye pana avasippatto jhānalābhī samayavimutto, vasippatto jhānalābhī ceva sabbe ca ariyapuggalā ariye vimokkhe asamayavimuttāti sanniṭṭhānaṃ. So pana taṃ attano laddhiṃ gahetvā samayavimutto ",
      " parihāyati, itaro na parihāyatī’’ti āha. Sesamettha uttānatthameva."
    ],
    "innerText": "262.Samayavimutto arahā arahattā parihāyatīti ettha mudindriyo samayavimutto, tikkhindriyo asamayavimuttoti tesaṃ laddhi. Sakasamaye pana avasippatto jhānalābhī samayavimutto, vasippatto jhānalābhī ceva sabbe ca ariyapuggalā ariye vimokkhe asamayavimuttāti sanniṭṭhānaṃ. So pana taṃ attano laddhiṃ gahetvā samayavimutto parihāyati, itaro na parihāyatī’’ti āha. Sesamettha uttānatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ariyapuggalasaṃsandanaparihānivaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Suttasādhanaparihānivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "265"
      },
      ". Idāni ",
      " suttasādhanā hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uccāvacā"
      },
      "ti uttamahīnabhedato uccā ca avacā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭipādā"
      },
      "ti paṭipadā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaṇena pakāsitā"
      },
      "ti buddhasamaṇena jotitā. Sukhāpaṭipadā hi khippābhiññā uccā. Dukkhāpaṭipadā dandhābhiññā avacā. Itarā dve ekenaṅgena ",
      " uccā, ekena avacā. Paṭhamaṃ vuttā eva vā uccā, itaro tissopi avacā. Tāya cetāya uccāvacāya paṭipadāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na pāraṃ diguṇaṃ ya"
      },
      "nti, ekamaggena dvikkhattuṃ nibbānaṃ na gacchantīti attho. Kasmā? Yena maggena ye kilesā pahīnā, tena tesaṃ puna appahātabbato. Etena parihānidhammābhāvaṃ dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nayidaṃ ekaguṇaṃ muta"
      },
      "nti tañca idaṃ pāraṃ ekavāraṃyeva phusanārahaṃ na hoti. Kasmā? Ekena maggena sabbakilesānaṃ appahānato. Etena ekamaggeneva arahattābhāvaṃ dīpeti."
    ],
    "innerText": "265. Idāni suttasādhanā hoti. Tattha uccāvacāti uttamahīnabhedato uccā ca avacā ca. Paṭipādāti paṭipadā. Samaṇena pakāsitāti buddhasamaṇena jotitā. Sukhāpaṭipadā hi khippābhiññā uccā. Dukkhāpaṭipadā dandhābhiññā avacā. Itarā dve ekenaṅgena uccā, ekena avacā. Paṭhamaṃ vuttā eva vā uccā, itaro tissopi avacā. Tāya cetāya uccāvacāya paṭipadāya na pāraṃ diguṇaṃ yanti, ekamaggena dvikkhattuṃ nibbānaṃ na gacchantīti attho. Kasmā? Yena maggena ye kilesā pahīnā, tena tesaṃ puna appahātabbato. Etena parihānidhammābhāvaṃ dīpeti. Nayidaṃ ekaguṇaṃ mutanti tañca idaṃ pāraṃ ekavāraṃyeva phusanārahaṃ na hoti. Kasmā? Ekena maggena sabbakilesānaṃ appahānato. Etena ekamaggeneva arahattābhāvaṃ dīpeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthi chinnassa chediya"
      },
      "nti chinnassa kilesavaṭṭassa puna chinditabbaṃ kiñci atthīti pucchati. Itaro tikkhindriyaṃ sandhāya paṭikkhipitvā puna puṭṭho mudindriyaṃ sandhāya paṭijānāti. Sakavādī suttaṃ āharitvā natthibhāvaṃ dasseti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "oghapāso"
      },
      "ti kilesogho ceva kilesapāso ca."
    ],
    "innerText": "Atthi chinnassa chediyanti chinnassa kilesavaṭṭassa puna chinditabbaṃ kiñci atthīti pucchati. Itaro tikkhindriyaṃ sandhāya paṭikkhipitvā puna puṭṭho mudindriyaṃ sandhāya paṭijānāti. Sakavādī suttaṃ āharitvā natthibhāvaṃ dasseti. Tattha oghapāsoti kilesogho ceva kilesapāso ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "266"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katassa paṭicayo"
      },
      "ti bhāvitassa maggassa puna bhāvanā. Idhāpi paṭikkhepapaṭijānanāni purimanayeneva veditabbāni."
    ],
    "innerText": "266.Katassa paṭicayoti bhāvitassa maggassa puna bhāvanā. Idhāpi paṭikkhepapaṭijānanāni purimanayeneva veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "267"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parihānāya saṃvattantī"
      },
      "ti paravādinā ābhate sutte pañca dhammā appattaparihānāya ceva lokiyasamāpattiparihānāya ca saṃvattanti. So pana pattassa arahattaphalassa parihānāya sallakkheti. Teneva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthi arahato kammārāmatā"
      },
      "ti āha. Itaropi asamayavimuttaṃ ",
      " sandhāya paṭikkhipitvā itaraṃ sandhāya paṭijānāti. Kāmarāgavasena vā pavattamānaṃ taṃ paṭikkhipitvā itarathā pavattamānaṃ paṭijānāti. Rāgādīnaṃ pana atthitaṃ puṭṭho paṭijānituṃ na sakkoti."
    ],
    "innerText": "267.Parihānāya saṃvattantīti paravādinā ābhate sutte pañca dhammā appattaparihānāya ceva lokiyasamāpattiparihānāya ca saṃvattanti. So pana pattassa arahattaphalassa parihānāya sallakkheti. Teneva atthi arahato kammārāmatāti āha. Itaropi asamayavimuttaṃ sandhāya paṭikkhipitvā itaraṃ sandhāya paṭijānāti. Kāmarāgavasena vā pavattamānaṃ taṃ paṭikkhipitvā itarathā pavattamānaṃ paṭijānāti. Rāgādīnaṃ pana atthitaṃ puṭṭho paṭijānituṃ na sakkoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "268"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiṃ pariyuṭṭhito"
      },
      "ti kena pariyuṭṭhito anubaddho ajjhotthato vā hutvāti attho. Anusayapucchāyapi tikkhindriyamudindriyavaseneva paṭikkhepapaṭijānanāni veditabbāni. Kalyāṇānusayoti ",
      " vacanamattasāmaññena vā paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rāgo upacayaṃ gacchatī"
      },
      "ti bhāvanāya pahīnaṃ sandhāyāha. Parato dosamohesupi eseva nayo. Sakkāyadiṭṭhiādīnaṃ pana dassanena pahīnattā upacayaṃ na icchati. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "268.Kiṃ pariyuṭṭhitoti kena pariyuṭṭhito anubaddho ajjhotthato vā hutvāti attho. Anusayapucchāyapi tikkhindriyamudindriyavaseneva paṭikkhepapaṭijānanāni veditabbāni. Kalyāṇānusayoti vacanamattasāmaññena vā paṭijānāti. Rāgo upacayaṃ gacchatīti bhāvanāya pahīnaṃ sandhāyāha. Parato dosamohesupi eseva nayo. Sakkāyadiṭṭhiādīnaṃ pana dassanena pahīnattā upacayaṃ na icchati. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Suttasādhanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Parihānikathā niṭṭhitā."
  }
]