[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "10. Bojjhaṅgavibhaṅgo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Suttantabhājanīyavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "466"
      },
      ". Idāni ",
      " tadanantare bojjhaṅgavibhaṅge ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sattā"
      },
      "ti gaṇanaparicchedo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bojjhaṅgā"
      },
      "ti bodhiyā bodhissa vā aṅgāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bojjhaṅgā"
      },
      ". Idaṃ vuttaṃ hoti – yā esā dhammasāmaggī yāya lokuttaramaggakkhaṇe uppajjamānāya līnuddhaccapatiṭṭhānāyūhanakāmasukhattakilamathānuyogaucchedasassatābhinivesādīnaṃ anekesaṃ upaddavānaṃ paṭipakkhabhūtāya satidhammavicayavīriyapītipassaddhisamādhiupekkhāsaṅkhātāya dhammasāmaggiyā ariyasāvako bujjhatīti katvā bodhīti vuccati, bujjhati kilesasantānaniddāya uṭṭhahati, cattāri vā ariyasaccāni paṭivijjhati, nibbānameva vā sacchikaroti, tassā dhammasāmaggīsaṅkhātāya bodhiyā aṅgātipi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bojjhaṅgā,"
      },
      " jhānaṅgamaggaṅgādīni viya. Yo panesa yathāvuttappakārāya etāya dhammasāmaggiyā bujjhatīti katvā ariyasāvako bodhīti vuccati, tassa bodhissa aṅgātipi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bojjhaṅgā,"
      },
      " senaṅgarathaṅgādayo viya. Tenāhu aṭṭhakathācariyā – ‘‘bujjhanakassa puggalassa aṅgāti vā bojjhaṅgā’’ti."
    ],
    "innerText": "466. Idāni tadanantare bojjhaṅgavibhaṅge sattāti gaṇanaparicchedo. Bojjhaṅgāti bodhiyā bodhissa vā aṅgāti bojjhaṅgā. Idaṃ vuttaṃ hoti – yā esā dhammasāmaggī yāya lokuttaramaggakkhaṇe uppajjamānāya līnuddhaccapatiṭṭhānāyūhanakāmasukhattakilamathānuyogaucchedasassatābhinivesādīnaṃ anekesaṃ upaddavānaṃ paṭipakkhabhūtāya satidhammavicayavīriyapītipassaddhisamādhiupekkhāsaṅkhātāya dhammasāmaggiyā ariyasāvako bujjhatīti katvā bodhīti vuccati, bujjhati kilesasantānaniddāya uṭṭhahati, cattāri vā ariyasaccāni paṭivijjhati, nibbānameva vā sacchikaroti, tassā dhammasāmaggīsaṅkhātāya bodhiyā aṅgātipi bojjhaṅgā, jhānaṅgamaggaṅgādīni viya. Yo panesa yathāvuttappakārāya etāya dhammasāmaggiyā bujjhatīti katvā ariyasāvako bodhīti vuccati, tassa bodhissa aṅgātipi bojjhaṅgā, senaṅgarathaṅgādayo viya. Tenāhu aṭṭhakathācariyā – ‘‘bujjhanakassa puggalassa aṅgāti vā bojjhaṅgā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Apica ‘‘bojjhaṅgāti kenaṭṭhena bojjhaṅgā? Bodhāya saṃvattantīti bojjhaṅgā, bujjhantīti bojjhaṅgā, anubujjhantīti bojjhaṅgā, paṭibujjhantīti bojjhaṅgā, sambujjhantīti bojjhaṅgā’’ti iminā paṭisambhidānayenāpi bojjhaṅgattho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satisambojjhaṅgo"
      },
      "tiādīsu pasattho sundaro ca bojjhaṅgo sambojjhaṅgo, satiyeva sambojjhaṅgo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satisambojjhaṅgo"
      },
      ". Tattha upaṭṭhānalakkhaṇo satisambojjhaṅgo, pavicayalakkhaṇo dhammavicayasambojjhaṅgo, paggahalakkhaṇo vīriyasambojjhaṅgo, pharaṇalakkhaṇo pītisambojjhaṅgo, upasamalakkhaṇo ",
      " passaddhisambojjhaṅgo, avikkhepalakkhaṇo samādhisambojjhaṅgo, paṭisaṅkhānalakkhaṇo ",
      " upekkhāsambojjhaṅgo. Tesu ‘‘satiñca khvāhaṃ, bhikkhave, sabbatthikaṃ vadāmī’’ti (saṃ. ni. 5.234) vacanato sabbesaṃ bojjhaṅgānaṃ upakārakattā satisambojjhaṅgo paṭhamaṃ vutto. Tato paraṃ ‘‘so tathā sato viharanto ",
      " taṃ dhammaṃ paññāya pavicinatī’’tiādinā (ma. ni. 150) nayena evaṃ anukkameneva nikkhepapayojanaṃ pāḷiyaṃ āgatameva."
    ],
    "innerText": "Satisambojjhaṅgotiādīsu pasattho sundaro ca bojjhaṅgo sambojjhaṅgo, satiyeva sambojjhaṅgo satisambojjhaṅgo. Tattha upaṭṭhānalakkhaṇo satisambojjhaṅgo, pavicayalakkhaṇo dhammavicayasambojjhaṅgo, paggahalakkhaṇo vīriyasambojjhaṅgo, pharaṇalakkhaṇo pītisambojjhaṅgo, upasamalakkhaṇo passaddhisambojjhaṅgo, avikkhepalakkhaṇo samādhisambojjhaṅgo, paṭisaṅkhānalakkhaṇo upekkhāsambojjhaṅgo. Tesu ‘‘satiñca khvāhaṃ, bhikkhave, sabbatthikaṃ vadāmī’’ti (saṃ. ni. 5.234) vacanato sabbesaṃ bojjhaṅgānaṃ upakārakattā satisambojjhaṅgo paṭhamaṃ vutto. Tato paraṃ ‘‘so tathā sato viharanto taṃ dhammaṃ paññāya pavicinatī’’tiādinā (ma. ni. 150) nayena evaṃ anukkameneva nikkhepapayojanaṃ pāḷiyaṃ āgatameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kasmā panete satteva vuttā, anūnā anadhikāti? Līnuddhaccapaṭipakkhato sabbatthikato ca. Ettha hi tayo bojjhaṅgā līnassa paṭipakkhā, yathāha – ‘‘yasmiñca kho, bhikkhave, samaye līnaṃ cittaṃ hoti, kālo tasmiṃ samaye dhammavicayasambojjhaṅgassa bhāvanāya, kālo vīriyasambojjhaṅgassa bhāvanāya, kālo pītisambojjhaṅgassa bhāvanāyā’’ti (saṃ. ni. 5.234). Tayo uddhaccassa paṭipakkhā, yathāha – ‘‘yasmiñca kho, bhikkhave, samaye uddhataṃ cittaṃ hoti, kālo tasmiṃ samaye passaddhisambojjhaṅgassa bhāvanāya, kālo samādhisambojjhaṅgassa bhāvanāya, kālo upekkhāsambojjhaṅgassa bhāvanāyā’’ti (saṃ. ni. 5.234). Eko panettha loṇadhūpanaṃ viya sabbabyañjanesu, sabbakammikaamacco viya ca sabbesu rājakiccesu, sabbabojjhaṅgesu icchitabbato sabbatthiko, yathāha – ‘‘satiñca khvāhaṃ, bhikkhave, sabbatthikaṃ vadāmī’’ti. ‘‘Sabbatthaka’’ntipi pāḷi. Dvinnampi sabbattha icchitabbanti attho. Evaṃ līnuddhaccapaṭipakkhato sabbatthikato ca satteva vuttāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "467"
      },
      ". Idāni nesaṃ ekasmiṃyevārammaṇe attano attano kiccavasena nānākaraṇaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha katamo satisambojjhaṅgo"
      },
      "tiādi āraddhaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "idha bhikkhū"
      },
      "ti imasmiṃ sāsane bhikkhu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satimā hotī"
      },
      "ti paññāya paññavā, yasena yasavā, dhanena dhanavā viya satiyā satimā hoti, satisampannoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paramenā"
      },
      "ti uttamena; tañhi paramatthasaccassa nibbānassa ceva maggassa ca anulomato paramaṃ nāma hoti uttamaṃ seṭṭhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satinepakkenā"
      },
      "ti nepakkaṃ vuccati paññā; satiyā ceva nepakkena ",
      " cāti attho."
    ],
    "innerText": "467. Idāni nesaṃ ekasmiṃyevārammaṇe attano attano kiccavasena nānākaraṇaṃ dassetuṃ tattha katamo satisambojjhaṅgotiādi āraddhaṃ. Tattha idha bhikkhūti imasmiṃ sāsane bhikkhu. Satimā hotīti paññāya paññavā, yasena yasavā, dhanena dhanavā viya satiyā satimā hoti, satisampannoti attho. Paramenāti uttamena; tañhi paramatthasaccassa nibbānassa ceva maggassa ca anulomato paramaṃ nāma hoti uttamaṃ seṭṭhaṃ. Satinepakkenāti nepakkaṃ vuccati paññā; satiyā ceva nepakkena cāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kasmā pana imasmiṃ satibhājanīye paññā saṅgahitāti? Satiyā balavabhāvadīpanatthaṃ. Sati hi paññāya saddhimpi uppajjati vināpi, paññāya saddhiṃ uppajjamānā balavatī hoti, vinā uppajjamānā dubbalā. Tenassā balavabhāvadīpanatthaṃ paññā saṅgahitā. Yathā hi dvīsu ",
      " disāsu dve rājamahāmattā tiṭṭheyyuṃ; tesu eko rājaputtaṃ gahetvā tiṭṭheyya, eko attano dhammatāya ekakova tesu rājaputtaṃ gahetvā ṭhito attanopi ",
      " tejena rājaputtassapi tejena tejavā hoti; attano dhammatāya ṭhito na tena samatejo hoti; evameva rājaputtaṃ gahetvā ṭhitamahāmatto viya paññāya saddhiṃ uppannā sati, attano dhammatāya ṭhito viya vinā paññāya uppannā. Tattha yathā rājaputtaṃ gahetvā ṭhito attanopi tejena rājaputtassapi tejena tejavā hoti, evaṃ paññāya saddhiṃ uppannā sati balavatī hoti; yathā attano dhammatāya ṭhito na tena samatejo hoti, evaṃ vinā paññāya uppannā dubbalā hotīti balavabhāvadīpanatthaṃ paññā gahitāti."
    ],
    "innerText": "Kasmā pana imasmiṃ satibhājanīye paññā saṅgahitāti? Satiyā balavabhāvadīpanatthaṃ. Sati hi paññāya saddhimpi uppajjati vināpi, paññāya saddhiṃ uppajjamānā balavatī hoti, vinā uppajjamānā dubbalā. Tenassā balavabhāvadīpanatthaṃ paññā saṅgahitā. Yathā hi dvīsu disāsu dve rājamahāmattā tiṭṭheyyuṃ; tesu eko rājaputtaṃ gahetvā tiṭṭheyya, eko attano dhammatāya ekakova tesu rājaputtaṃ gahetvā ṭhito attanopi tejena rājaputtassapi tejena tejavā hoti; attano dhammatāya ṭhito na tena samatejo hoti; evameva rājaputtaṃ gahetvā ṭhitamahāmatto viya paññāya saddhiṃ uppannā sati, attano dhammatāya ṭhito viya vinā paññāya uppannā. Tattha yathā rājaputtaṃ gahetvā ṭhito attanopi tejena rājaputtassapi tejena tejavā hoti, evaṃ paññāya saddhiṃ uppannā sati balavatī hoti; yathā attano dhammatāya ṭhito na tena samatejo hoti, evaṃ vinā paññāya uppannā dubbalā hotīti balavabhāvadīpanatthaṃ paññā gahitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cirakatampī"
      },
      "ti attano vā parassa vā kāyena cirakataṃ vattaṃ vā kasiṇamaṇḍalaṃ vā kasiṇaparikammaṃ vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cirabhāsitampī"
      },
      "ti attanā vā parena vā vācāya cirabhāsitaṃ bahukampi, vattasīse ṭhatvā dhammakathaṃ vā kammaṭṭhānavinicchayaṃ vā, vimuttāyatanasīse vā ṭhatvā dhammakathameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saritā hotī"
      },
      "ti taṃ kāyaviññattiṃ vacīviññattiñca samuṭṭhāpetvā pavattaṃ arūpadhammakoṭṭhāsaṃ ‘evaṃ uppajjitvā evaṃ niruddho’ti saritā hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anussaritā"
      },
      "ti punappunaṃ saritā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ vuccati satisambojjhaṅgo"
      },
      "ti ayaṃ evaṃ uppannā sesabojjhaṅgasamuṭṭhāpikā vipassanāsampayuttā sati satisambojjhaṅgo nāma kathīyati."
    ],
    "innerText": "Cirakatampīti attano vā parassa vā kāyena cirakataṃ vattaṃ vā kasiṇamaṇḍalaṃ vā kasiṇaparikammaṃ vā. Cirabhāsitampīti attanā vā parena vā vācāya cirabhāsitaṃ bahukampi, vattasīse ṭhatvā dhammakathaṃ vā kammaṭṭhānavinicchayaṃ vā, vimuttāyatanasīse vā ṭhatvā dhammakathameva. Saritā hotīti taṃ kāyaviññattiṃ vacīviññattiñca samuṭṭhāpetvā pavattaṃ arūpadhammakoṭṭhāsaṃ ‘evaṃ uppajjitvā evaṃ niruddho’ti saritā hoti. Anussaritāti punappunaṃ saritā. Ayaṃ vuccati satisambojjhaṅgoti ayaṃ evaṃ uppannā sesabojjhaṅgasamuṭṭhāpikā vipassanāsampayuttā sati satisambojjhaṅgo nāma kathīyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So tathā sato viharanto"
      },
      "ti so bhikkhu tenākārena uppannāya satiyā sato hutvā viharanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ dhamma"
      },
      "nti taṃ cirakataṃ cirabhāsitaṃ heṭṭhā vuttappakāraṃ dhammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāya pavicinatī"
      },
      "ti paññāya ‘aniccaṃ dukkhaṃ anattā’ti pavicinati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavicaratī"
      },
      "ti ",
      " ‘aniccaṃ dukkhaṃ anattā’ti tattha paññaṃ carāpento pavicarati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parivīmaṃsaṃ āpajjatī"
      },
      "ti olokanaṃ gavesanaṃ āpajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ vuccatī"
      },
      "ti idaṃ vuttappakāraṃ bojjhaṅgasamuṭṭhāpakaṃ vipassanāñāṇaṃ dhammavicayasambojjhaṅgo nāma vuccati."
    ],
    "innerText": "So tathā sato viharantoti so bhikkhu tenākārena uppannāya satiyā sato hutvā viharanto. Taṃ dhammanti taṃ cirakataṃ cirabhāsitaṃ heṭṭhā vuttappakāraṃ dhammaṃ. Paññāya pavicinatīti paññāya ‘aniccaṃ dukkhaṃ anattā’ti pavicinati. Pavicaratīti ‘aniccaṃ dukkhaṃ anattā’ti tattha paññaṃ carāpento pavicarati. Parivīmaṃsaṃ āpajjatīti olokanaṃ gavesanaṃ āpajjati. Ayaṃ vuccatīti idaṃ vuttappakāraṃ bojjhaṅgasamuṭṭhāpakaṃ vipassanāñāṇaṃ dhammavicayasambojjhaṅgo nāma vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa taṃ dhamma"
      },
      "nti tassa bhikkhuno taṃ heṭṭhā vuttappakāraṃ dhammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āraddhaṃ hotī"
      },
      "ti paripuṇṇaṃ hoti paggahitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asallīna"
      },
      "nti āraddhattāyeva asallīnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ vuccatī"
      },
      "ti idaṃ bojjhaṅgasamuṭṭhāpakaṃ vipassanāsampayuttaṃ vīriyaṃ vīriyasambojjhaṅgo nāma vuccati."
    ],
    "innerText": "Tassa taṃ dhammanti tassa bhikkhuno taṃ heṭṭhā vuttappakāraṃ dhammaṃ. Āraddhaṃ hotīti paripuṇṇaṃ hoti paggahitaṃ. Asallīnanti āraddhattāyeva asallīnaṃ. Ayaṃ vuccatīti idaṃ bojjhaṅgasamuṭṭhāpakaṃ vipassanāsampayuttaṃ vīriyaṃ vīriyasambojjhaṅgo nāma vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nirāmisā"
      },
      "ti ",
      " kāmāmisalokāmisavaṭṭāmisānaṃ abhāvena nirāmisā parisuddhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ vuccatī"
      },
      "ti ayaṃ bojjhaṅgasamuṭṭhāpikā vipassanāsampayuttā pīti pītisambojjhaṅgo nāma vuccati."
    ],
    "innerText": "Nirāmisāti kāmāmisalokāmisavaṭṭāmisānaṃ abhāvena nirāmisā parisuddhā. Ayaṃ vuccatīti ayaṃ bojjhaṅgasamuṭṭhāpikā vipassanāsampayuttā pīti pītisambojjhaṅgo nāma vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pītimanassā"
      },
      "ti pītisampayuttacittassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyopi passambhatī"
      },
      "ti khandhattayasaṅkhāto nāmakāyo kilesadarathapaṭippassaddhiyā passambhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittampī"
      },
      "ti viññāṇakkhandhopi tatheva passambhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ vuccatī"
      },
      "ti ayaṃ bojjhaṅgasamuṭṭhāpikā vipassanāsampayuttā passaddhi passaddhisambojjhaṅgo nāma vuccati."
    ],
    "innerText": "Pītimanassāti pītisampayuttacittassa. Kāyopi passambhatīti khandhattayasaṅkhāto nāmakāyo kilesadarathapaṭippassaddhiyā passambhati. Cittampīti viññāṇakkhandhopi tatheva passambhati. Ayaṃ vuccatīti ayaṃ bojjhaṅgasamuṭṭhāpikā vipassanāsampayuttā passaddhi passaddhisambojjhaṅgo nāma vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passaddhakāyassa sukhino"
      },
      "ti passaddhakāyatāya uppannasukhena sukhitassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādhiyatī"
      },
      "ti sammā ādhiyati, niccalaṃ hutvā ārammaṇe ṭhapīyati, appanāppattaṃ viya hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ vuccatī"
      },
      "ti ayaṃ bojjhaṅgasamuṭṭhāpikā vipassanāsampayuttā cittekaggatā samādhisambojjhaṅgo nāma vuccati."
    ],
    "innerText": "Passaddhakāyassa sukhinoti passaddhakāyatāya uppannasukhena sukhitassa. Samādhiyatīti sammā ādhiyati, niccalaṃ hutvā ārammaṇe ṭhapīyati, appanāppattaṃ viya hoti. Ayaṃ vuccatīti ayaṃ bojjhaṅgasamuṭṭhāpikā vipassanāsampayuttā cittekaggatā samādhisambojjhaṅgo nāma vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathā samāhita"
      },
      "nti tena appanāppattena viya samādhinā samāhitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhukaṃ ajjhupekkhitā hotī"
      },
      "ti suṭṭhu ajjhupekkhitā hoti; tesaṃ dhammānaṃ pahānavaḍḍhane abyāvaṭo hutvā ajjhupekkhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuccatī"
      },
      "ti ayaṃ channaṃ bojjhaṅgānaṃ anosakkanaanativattanabhāvasādhako majjhattākāro upekkhāsambojjhaṅgo nāma vuccati."
    ],
    "innerText": "Tathā samāhitanti tena appanāppattena viya samādhinā samāhitaṃ. Sādhukaṃ ajjhupekkhitā hotīti suṭṭhu ajjhupekkhitā hoti; tesaṃ dhammānaṃ pahānavaḍḍhane abyāvaṭo hutvā ajjhupekkhati. Ayaṃvuccatīti ayaṃ channaṃ bojjhaṅgānaṃ anosakkanaanativattanabhāvasādhako majjhattākāro upekkhāsambojjhaṅgo nāma vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettāvatā kiṃ kathitaṃ nāma hoti? Apubbaṃ acarimaṃ ekacittakkhaṇe nānārasalakkhaṇā pubbabhāgavipassanā bojjhaṅgā kathitā hontīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamo nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "468-469"
      },
      ". Idāni yena pariyāyena satta bojjhaṅgā cuddasa honti, tassa pakāsanatthaṃ dutiyanayaṃ dassento puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satta bojjhaṅgā"
      },
      "tiādimāha. Tatrāyaṃ anupubbapadavaṇṇanā – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhattaṃ dhammesu satī"
      },
      "ti ajjhattikasaṅkhāre pariggaṇhantassa uppannā sati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahiddhā dhammesu satī"
      },
      "ti bahiddhāsaṅkhāre pariggaṇhantassa uppannā sati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadapī"
      },
      "ti yāpi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadapī"
      },
      "ti sāpi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhiññāyā"
      },
      "ti abhiññeyyadhamme abhijānanatthāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sambodhāyā"
      },
      "ti sambodhi vuccati maggo, maggatthāyāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibbānāyā"
      },
      "ti ",
      " vānaṃ vuccati taṇhā; sā tattha ",
      " natthīti nibbānaṃ, tadatthāya, asaṅkhatāya amatadhātuyā sacchikiriyatthāya saṃvattatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammavicayasambojjhaṅgepi"
      },
      " eseva nayo."
    ],
    "innerText": "468-469. Idāni yena pariyāyena satta bojjhaṅgā cuddasa honti, tassa pakāsanatthaṃ dutiyanayaṃ dassento puna satta bojjhaṅgātiādimāha. Tatrāyaṃ anupubbapadavaṇṇanā – ajjhattaṃ dhammesu satīti ajjhattikasaṅkhāre pariggaṇhantassa uppannā sati. Bahiddhā dhammesu satīti bahiddhāsaṅkhāre pariggaṇhantassa uppannā sati. Yadapīti yāpi. Tadapīti sāpi. Abhiññāyāti abhiññeyyadhamme abhijānanatthāya. Sambodhāyāti sambodhi vuccati maggo, maggatthāyāti attho. Nibbānāyāti vānaṃ vuccati taṇhā; sā tattha natthīti nibbānaṃ, tadatthāya, asaṅkhatāya amatadhātuyā sacchikiriyatthāya saṃvattatīti attho. Dhammavicayasambojjhaṅgepi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyikaṃ vīriya"
      },
      "nti caṅkamaṃ adhiṭṭhahantassa uppannavīriyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cetasikaṃ vīriya"
      },
      "nti ‘‘na tāvāhaṃ imaṃ pallaṅkaṃ bhindissāmi yāva me na anupādāya āsavehi cittaṃ vimuccissatī’’ti evaṃ kāyapayogaṃ vinā uppannavīriyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyapassaddhī"
      },
      "ti tiṇṇaṃ khandhānaṃ darathapassaddhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittapassaddhī"
      },
      "ti viññāṇakkhandhassa darathapassaddhi. Upekkhāsambojjhaṅge satisambojjhaṅgasadisova vinicchayo. Imasmiṃ naye satta bojjhaṅgā lokiyalokuttaramissakā kathitā."
    ],
    "innerText": "Kāyikaṃ vīriyanti caṅkamaṃ adhiṭṭhahantassa uppannavīriyaṃ. Cetasikaṃ vīriyanti ‘‘na tāvāhaṃ imaṃ pallaṅkaṃ bhindissāmi yāva me na anupādāya āsavehi cittaṃ vimuccissatī’’ti evaṃ kāyapayogaṃ vinā uppannavīriyaṃ. Kāyapassaddhīti tiṇṇaṃ khandhānaṃ darathapassaddhi. Cittapassaddhīti viññāṇakkhandhassa darathapassaddhi. Upekkhāsambojjhaṅge satisambojjhaṅgasadisova vinicchayo. Imasmiṃ naye satta bojjhaṅgā lokiyalokuttaramissakā kathitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Porāṇakattherā pana ‘ettakena pākaṭaṃ na hotī’ti vibhajitvā dassesuṃ. Etesu hi ajjhattadhammesu sati pavicayo upekkhāti ime tayo attano khandhārammaṇattā lokiyāva honti. Tathā maggaṃ appattaṃ kāyikavīriyaṃ. Avitakkaavicārā ",
      " pana pītisamādhiyo lokuttarā honti. Sesā lokiyalokuttaramissakāti."
    ],
    "innerText": "Porāṇakattherā pana ‘ettakena pākaṭaṃ na hotī’ti vibhajitvā dassesuṃ. Etesu hi ajjhattadhammesu sati pavicayo upekkhāti ime tayo attano khandhārammaṇattā lokiyāva honti. Tathā maggaṃ appattaṃ kāyikavīriyaṃ. Avitakkaavicārā pana pītisamādhiyo lokuttarā honti. Sesā lokiyalokuttaramissakāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha ajjhattaṃ tāva dhammesu satipavicayaupekkhā ajjhattārammaṇā, lokuttarā pana bahiddhārammaṇāti tesaṃ lokuttarabhāvo mā yujjittha. Caṅkamappayogena nibbattavīriyampi lokiyanti vadanto na kilamati. Avitakkaavicārā pana pītisamādhiyo kadā lokuttarā hontīti? Kāmāvacare tāva pītisambojjhaṅgo labbhati, avitakkaavicārā pīti na labbhati. Rūpāvacare avitakkaavicārā pīti labbhati, pītisambojjhaṅgo pana na labbhati. Arūpāvacare sabbena sabbaṃ na labbhati. Ettha pana alabbhamānakaṃ upādāya labbhamānakāpi paṭikkhittā. Evamayaṃ avitakkaavicāro pītisambojjhaṅgo kāmāvacaratopi nikkhanto rūpāvacaratopi arūpāvacaratopīti nibbattitalokuttaro yevāti kathito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tathā kāmāvacare samādhisambojjhaṅgo labbhati, avitakkaavicāro pana samādhi na labbhati. Rūpāvacaraarūpāvacaresu avitakkaavicāro samādhi labbhati, samādhisambojjhaṅgo pana na labbhati. Ettha pana alabbhamānakaṃ upādāya labbhamānakopi paṭikkhitto. Evamayaṃ avitakkaavicāro samādhi kāmāvacaratopi nikkhanto rūpāvacaratopi arūpāvacaratopīti nibbattitalokuttaro yevāti kathito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica ",
      " lokiyaṃ gahetvā lokuttaro kātabbo; lokuttaraṃ gahetvā lokiyo kātabbo. Ajjhattadhammesu hi satipavicayaupekkhānaṃ lokuttarabhāvanākālopi atthi. Tatridaṃ suttaṃ – ‘‘ajjhattavimokkhaṃ khvāhaṃ, āvuso, sabbupādānakkhayaṃ vadāmi; evamassime āsavā nānusentī’’ti (saṃ. ni. 2.32 thokaṃ visadisaṃ) iminā suttena lokuttarā honti. Yadā pana caṅkamapayogena nibbatte kāyikavīriye anupasanteyeva vipassanā maggena ghaṭīyati, tadā taṃ lokuttaraṃ hoti. Ye pana therā ‘‘kasiṇajjhāne, ānāpānajjhāne, brahmavihārajjhāne ca bojjhaṅgo uddharanto na vāretabbo’’ti vadanti, tesaṃ vāde avitakkaavicārā pītisamādhisambojjhaṅgā lokiyā hontīti."
    ],
    "innerText": "Apica lokiyaṃ gahetvā lokuttaro kātabbo; lokuttaraṃ gahetvā lokiyo kātabbo. Ajjhattadhammesu hi satipavicayaupekkhānaṃ lokuttarabhāvanākālopi atthi. Tatridaṃ suttaṃ – ‘‘ajjhattavimokkhaṃ khvāhaṃ, āvuso, sabbupādānakkhayaṃ vadāmi; evamassime āsavā nānusentī’’ti (saṃ. ni. 2.32 thokaṃ visadisaṃ) iminā suttena lokuttarā honti. Yadā pana caṅkamapayogena nibbatte kāyikavīriye anupasanteyeva vipassanā maggena ghaṭīyati, tadā taṃ lokuttaraṃ hoti. Ye pana therā ‘‘kasiṇajjhāne, ānāpānajjhāne, brahmavihārajjhāne ca bojjhaṅgo uddharanto na vāretabbo’’ti vadanti, tesaṃ vāde avitakkaavicārā pītisamādhisambojjhaṅgā lokiyā hontīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyo nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "470-471"
      },
      ". Idāni ",
      " bojjhaṅgānaṃ bhāvanāvasena pavattaṃ tatiyanayaṃ dassento puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satta bojjhaṅgā"
      },
      "tiādimāha. Tatthāpi ayaṃ anupubbapadavaṇṇanā – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhāvetī"
      },
      "ti vaḍḍheti; attano santāne punappunaṃ janeti abhinibbatteti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivekanissita"
      },
      "nti viveke nissitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viveko"
      },
      "ti vivittatā. So cāyaṃ tadaṅgaviveko, vikkhambhanasamucchedapaṭippassaddhinissaraṇavivekoti pañcavidho. Tattha tadaṅgaviveko nāma vipassanā. Vikkhambhanaviveko nāma aṭṭha samāpattiyo. Samucchedaviveko nāma maggo. Paṭippassaddhiviveko nāma phalaṃ. Nissaraṇaviveko nāma sabbanimittanissaṭaṃ nibbānaṃ. Evametasmiṃ pañcavidhe viveke nissitaṃ vivekanissitanti tadaṅgavivekanissitaṃ samucchedavivekanissitaṃ nissaraṇavivekanissitañca satisambojjhaṅgaṃ bhāvetīti ayamattho veditabbo."
    ],
    "innerText": "470-471. Idāni bojjhaṅgānaṃ bhāvanāvasena pavattaṃ tatiyanayaṃ dassento puna satta bojjhaṅgātiādimāha. Tatthāpi ayaṃ anupubbapadavaṇṇanā – bhāvetīti vaḍḍheti; attano santāne punappunaṃ janeti abhinibbatteti. Vivekanissitanti viveke nissitaṃ. Vivekoti vivittatā. So cāyaṃ tadaṅgaviveko, vikkhambhanasamucchedapaṭippassaddhinissaraṇavivekoti pañcavidho. Tattha tadaṅgaviveko nāma vipassanā. Vikkhambhanaviveko nāma aṭṭha samāpattiyo. Samucchedaviveko nāma maggo. Paṭippassaddhiviveko nāma phalaṃ. Nissaraṇaviveko nāma sabbanimittanissaṭaṃ nibbānaṃ. Evametasmiṃ pañcavidhe viveke nissitaṃ vivekanissitanti tadaṅgavivekanissitaṃ samucchedavivekanissitaṃ nissaraṇavivekanissitañca satisambojjhaṅgaṃ bhāvetīti ayamattho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā hi ayaṃ satisambojjhaṅgabhāvanānuyogamanuyutto yogī vipassanākkhaṇe kiccato tadaṅgavivekanissitaṃ, ajjhāsayato nissaraṇavivekanissitaṃ, maggakāle pana kiccato samucchedavivekanissitaṃ, ārammaṇato nissaraṇavivekanissitaṃ, satisambojjhaṅgaṃ bhāveti. Pañcavivekanissitampīti eke. Te hi na kevalaṃ balavavipassanāmaggaphalakkhaṇesu eva bojjhaṅgaṃ uddharanti, vipassanāpādakakasiṇajjhānaānāpānāsubhabrahmavihārajjhānesupi uddharanti, na ca paṭisiddhā aṭṭhakathācariyehi ",
      ". Tasmā tesaṃ matena etesaṃ jhānānaṃ pavattikkhaṇe kiccato eva vikkhambhanavivekanissitaṃ. Yathā ca vipassanākkhaṇe ‘‘ajjhāsayato nissaraṇavivekanissita’’nti ",
      " vuttaṃ, evaṃ ‘‘paṭippassaddhivivekanissitampi bhāvetī’’ti vattuṃ vaṭṭati. Esa nayo virāganissitādīsu. Vivekatthā eva hi virāgādayo."
    ],
    "innerText": "Tathā hi ayaṃ satisambojjhaṅgabhāvanānuyogamanuyutto yogī vipassanākkhaṇe kiccato tadaṅgavivekanissitaṃ, ajjhāsayato nissaraṇavivekanissitaṃ, maggakāle pana kiccato samucchedavivekanissitaṃ, ārammaṇato nissaraṇavivekanissitaṃ, satisambojjhaṅgaṃ bhāveti. Pañcavivekanissitampīti eke. Te hi na kevalaṃ balavavipassanāmaggaphalakkhaṇesu eva bojjhaṅgaṃ uddharanti, vipassanāpādakakasiṇajjhānaānāpānāsubhabrahmavihārajjhānesupi uddharanti, na ca paṭisiddhā aṭṭhakathācariyehi . Tasmā tesaṃ matena etesaṃ jhānānaṃ pavattikkhaṇe kiccato eva vikkhambhanavivekanissitaṃ. Yathā ca vipassanākkhaṇe ‘‘ajjhāsayato nissaraṇavivekanissita’’nti vuttaṃ, evaṃ ‘‘paṭippassaddhivivekanissitampi bhāvetī’’ti vattuṃ vaṭṭati. Esa nayo virāganissitādīsu. Vivekatthā eva hi virāgādayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kevalañcettha vossaggo duvidho – pariccāgavossaggo ca pakkhandanavossaggo cāti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘pariccāgavossaggo’"
      },
      "ti vipassanākkhaṇe ca tadaṅgavasena maggakkhaṇe ca samucchedavasena kilesappahānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Pakkhandanavossaggo’"
      },
      "ti vipassanākkhaṇe tanninnabhāvena, maggakkhaṇe pana ārammaṇakaraṇena nibbānapakkhandanaṃ. Tadubhayampi imasmiṃ lokiyalokuttaramissake ",
      " atthavaṇṇanānaye vaṭṭati. Tathā hi ayaṃ sati sambojjhaṅgo yathāvuttena pakārena kilese pariccajati, nibbānañca pakkhandati."
    ],
    "innerText": "Kevalañcettha vossaggo duvidho – pariccāgavossaggo ca pakkhandanavossaggo cāti. Tattha ‘pariccāgavossaggo’ti vipassanākkhaṇe ca tadaṅgavasena maggakkhaṇe ca samucchedavasena kilesappahānaṃ. ‘Pakkhandanavossaggo’ti vipassanākkhaṇe tanninnabhāvena, maggakkhaṇe pana ārammaṇakaraṇena nibbānapakkhandanaṃ. Tadubhayampi imasmiṃ lokiyalokuttaramissake atthavaṇṇanānaye vaṭṭati. Tathā hi ayaṃ sati sambojjhaṅgo yathāvuttena pakārena kilese pariccajati, nibbānañca pakkhandati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vossaggapariṇāmi"
      },
      "nti iminā pana sakalena vacanena vossaggatthaṃ pariṇamantaṃ pariṇatañca, paripaccantaṃ paripakkañcāti idaṃ vuttaṃ hoti. Ayañhi bojjhaṅgabhāvanamanuyutto bhikkhu yathā satisambojjhaṅgo kilesapariccāgavossaggatthaṃ nibbānapakkhandanavossaggatthañca paripaccati, yathā ca paripakko hoti, tathā naṃ bhāvetīti. Esa nayo sesabojjhaṅgesupi. Imasmimpi naye lokiyalokuttaramissakā bojjhaṅgā kathitāti."
    ],
    "innerText": "Vossaggapariṇāminti iminā pana sakalena vacanena vossaggatthaṃ pariṇamantaṃ pariṇatañca, paripaccantaṃ paripakkañcāti idaṃ vuttaṃ hoti. Ayañhi bojjhaṅgabhāvanamanuyutto bhikkhu yathā satisambojjhaṅgo kilesapariccāgavossaggatthaṃ nibbānapakkhandanavossaggatthañca paripaccati, yathā ca paripakko hoti, tathā naṃ bhāvetīti. Esa nayo sesabojjhaṅgesupi. Imasmimpi naye lokiyalokuttaramissakā bojjhaṅgā kathitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Suttantabhājanīyavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Abhidhammabhājanīyavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "472"
      },
      ". Abhidhammabhājanīye sattapi bojjhaṅge ekato pucchitvā vissajjanassa ca pāṭiyekkaṃ pucchitvā vissajjanassa ca vasena dve nayā. Tesaṃ atthavaṇṇanā heṭṭhā vuttanayeneva veditabbā."
    ],
    "innerText": "472. Abhidhammabhājanīye sattapi bojjhaṅge ekato pucchitvā vissajjanassa ca pāṭiyekkaṃ pucchitvā vissajjanassa ca vasena dve nayā. Tesaṃ atthavaṇṇanā heṭṭhā vuttanayeneva veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Upekkhāsambojjhaṅganiddese pana upekkhanavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upekkhā"
      },
      ". Upekkhanākāro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upekkhanā"
      },
      ". Upekkhitabbayutte samappavatte dhamme ikkhati, na codetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upekkhā"
      },
      ". Puggalaṃ upekkhāpetīti upekkhanā ",
      ". Bojjhaṅgabhāvappattiyā lokiyaupekkhanāya adhikā upekkhanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhupekkhanā"
      },
      ". Abyāpārāpajjanena majjhattabhāvo majjhattatā. Sā pana cittassa, na sattassāti dīpetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "majjhattatā cittassā"
      },
      "ti vuttanti. Ayamettha anupubbapadavaṇṇanā."
    ],
    "innerText": "Upekkhāsambojjhaṅganiddese pana upekkhanavasena upekkhā. Upekkhanākāro upekkhanā. Upekkhitabbayutte samappavatte dhamme ikkhati, na codetīti upekkhā. Puggalaṃ upekkhāpetīti upekkhanā . Bojjhaṅgabhāvappattiyā lokiyaupekkhanāya adhikā upekkhanā ajjhupekkhanā. Abyāpārāpajjanena majjhattabhāvo majjhattatā. Sā pana cittassa, na sattassāti dīpetuṃ majjhattatā cittassāti vuttanti. Ayamettha anupubbapadavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nayā panettha gaṇetabbā – sattannampi hi bojjhaṅgānaṃ ekato pucchitvā vissajjane ekekamagge nayasahassaṃ nayasahassanti cattāri nayasahassāni vibhattāni. Pāṭiyekkaṃ pucchitvā vissajjane ekekabojjhaṅgavasena cattāri cattārīti satta catukkā aṭṭhavīsati. Tāni purimehi catūhi saddhiṃ dvattiṃsāti sabbānipi abhidhammabhājanīye dvattiṃsa nayasahassāni vibhattāni kusalāneva. Yasmā pana phalakkhaṇepi bojjhaṅgā labbhanti, kusalahetukāni ca sāmaññaphalāni, tasmā tesupi bojjhaṅgadassanatthaṃ kusalaniddesapubbaṅgamāya eva tantiyā vipākanayo āraddho. Sopi ",
      " ekato pucchitvā vissajjanassa ca, pāṭiyekkaṃ pucchitvā vissajjanassa ca vasena duvidho hoti. Sesamettha heṭṭhā vuttanayeneva veditabbaṃ. Vipāke pana kusalato tiguṇā nayā kātabbāti."
    ],
    "innerText": "Nayā panettha gaṇetabbā – sattannampi hi bojjhaṅgānaṃ ekato pucchitvā vissajjane ekekamagge nayasahassaṃ nayasahassanti cattāri nayasahassāni vibhattāni. Pāṭiyekkaṃ pucchitvā vissajjane ekekabojjhaṅgavasena cattāri cattārīti satta catukkā aṭṭhavīsati. Tāni purimehi catūhi saddhiṃ dvattiṃsāti sabbānipi abhidhammabhājanīye dvattiṃsa nayasahassāni vibhattāni kusalāneva. Yasmā pana phalakkhaṇepi bojjhaṅgā labbhanti, kusalahetukāni ca sāmaññaphalāni, tasmā tesupi bojjhaṅgadassanatthaṃ kusalaniddesapubbaṅgamāya eva tantiyā vipākanayo āraddho. Sopi ekato pucchitvā vissajjanassa ca, pāṭiyekkaṃ pucchitvā vissajjanassa ca vasena duvidho hoti. Sesamettha heṭṭhā vuttanayeneva veditabbaṃ. Vipāke pana kusalato tiguṇā nayā kātabbāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhidhammabhājanīyavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Pañhāpucchakavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "482"
      },
      ". Pañhāpucchake pāḷianusāreneva bojjhaṅgānaṃ kusalādibhāvo veditabbo. Ārammaṇattikesu pana sabbepete appamāṇaṃ nibbānaṃ ārabbha pavattito appamāṇārammaṇā eva, na maggārammaṇā. Sahajātahetuvasena panettha kusalā maggahetukā, vīriyaṃ vā vīmaṃsaṃ vā jeṭṭhakaṃ katvā maggabhāvanākāle maggādhipatino, chandacittajeṭṭhikāya maggabhāvanāya na vattabbā maggādhipatinoti, phalakālepi na vattabbā eva."
    ],
    "innerText": "482. Pañhāpucchake pāḷianusāreneva bojjhaṅgānaṃ kusalādibhāvo veditabbo. Ārammaṇattikesu pana sabbepete appamāṇaṃ nibbānaṃ ārabbha pavattito appamāṇārammaṇā eva, na maggārammaṇā. Sahajātahetuvasena panettha kusalā maggahetukā, vīriyaṃ vā vīmaṃsaṃ vā jeṭṭhakaṃ katvā maggabhāvanākāle maggādhipatino, chandacittajeṭṭhikāya maggabhāvanāya na vattabbā maggādhipatinoti, phalakālepi na vattabbā eva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atītādīsu ekārammaṇabhāvenapi na vattabbā, nibbānassa pana bahiddhādhammattā bahiddhārammaṇā nāma hontīti. Evametasmiṃ pañhāpucchakepi nibbattitalokuttarāva ",
      " bojjhaṅgā kathitā ",
      ". Sammāsambuddhena hi suttantabhājanīyasseva paṭhamanayasmiṃ lokiyā, dutiyatatiyesu lokiyalokuttaramissakā bojjhaṅgā kathitā. Abhidhammabhājanīyassa pana catūsupi nayesu imasmiñca pañhāpucchake lokuttarāyevāti evamayaṃ bojjhaṅgavibhaṅgopi teparivaṭṭaṃ nīharitvāva bhājetvā dassitoti."
    ],
    "innerText": "Atītādīsu ekārammaṇabhāvenapi na vattabbā, nibbānassa pana bahiddhādhammattā bahiddhārammaṇā nāma hontīti. Evametasmiṃ pañhāpucchakepi nibbattitalokuttarāva bojjhaṅgā kathitā . Sammāsambuddhena hi suttantabhājanīyasseva paṭhamanayasmiṃ lokiyā, dutiyatatiyesu lokiyalokuttaramissakā bojjhaṅgā kathitā. Abhidhammabhājanīyassa pana catūsupi nayesu imasmiñca pañhāpucchake lokuttarāyevāti evamayaṃ bojjhaṅgavibhaṅgopi teparivaṭṭaṃ nīharitvāva bhājetvā dassitoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sammohavinodaniyā vibhaṅgaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bojjhaṅgavibhaṅgavaṇṇanā niṭṭhitā."
  }
]