[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Paccayaniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Hetupaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Idāni ",
      " sabbepi te paccaye uddiṭṭhapaṭipāṭiyā niddisitvā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetupaccayoti hetū hetusampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ hetupaccayena paccayo"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetupaccayo"
      },
      "ti catuvīsatiyā paccayesu nikkhittapaṭipāṭiyā sabbapaṭhamaṃ bhājetabbassa paduddhāro. Sesapaccayesupi imināva nayena paṭhamaṃ bhājetabbapadaṃ uddharitvā vissajjanaṃ katanti veditabbaṃ. Ayaṃ panettha sambandho – yo paccayuddese hetupaccayoti uddiṭṭho, so niddesato ‘‘hetū hetusampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ hetupaccayena paccayo’’ti evaṃ veditabbo ",
      ". Iminā upāyena sabbapaccayesu bhājetabbassa padassa vissajjanena saddhiṃ sambandho veditabbo."
    ],
    "innerText": "1. Idāni sabbepi te paccaye uddiṭṭhapaṭipāṭiyā niddisitvā dassetuṃ hetupaccayoti hetū hetusampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ hetupaccayena paccayotiādimāha. Tattha hetupaccayoti catuvīsatiyā paccayesu nikkhittapaṭipāṭiyā sabbapaṭhamaṃ bhājetabbassa paduddhāro. Sesapaccayesupi imināva nayena paṭhamaṃ bhājetabbapadaṃ uddharitvā vissajjanaṃ katanti veditabbaṃ. Ayaṃ panettha sambandho – yo paccayuddese hetupaccayoti uddiṭṭho, so niddesato ‘‘hetū hetusampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ hetupaccayena paccayo’’ti evaṃ veditabbo . Iminā upāyena sabbapaccayesu bhājetabbassa padassa vissajjanena saddhiṃ sambandho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetū hetusampayuttakāna"
      },
      "nti ettha ‘‘hetusampayuttakāna’’nti avatvā ‘‘hetū hetusampayuttakāna’’nti kasmā vuttanti? Paccayassa ceva paccayuppannānañca vavatthāpanato. Hetusampayuttakānanti hi vutte hetunā sampayuttakānaṃ hetupaccayena paccayoti attho bhaveyya. Evaṃ sante asuko nāma dhammo hetupaccayena paccayoti paccayavavatthānaṃ na paññāyeyya. Athāpi hetunā sampayuttakānaṃ hetusampayuttakānanti atthaṃ aggahetvāva yesaṃ kesañci sampayuttakānaṃ hetū hetupaccayena paccayoti attho bhaveyya, evaṃ sante hetunā vippayuttā cakkhuviññāṇādayopi sampayuttakāyeva, hetunā sampayuttā kusalādayopi. Tattha ayaṃ hetu asukassa nāma sampayuttakadhammassa paccayoti paccayuppannavavatthānaṃ na paññāyeyya. Tasmā paccayañceva paccayuppannañca vavatthāpento ‘‘hetū hetusampayuttakāna’’nti āha. Tassattho – hetusampayuttakānaṃ kusalādidhammānaṃ yo hetu sampayuttako, so hetupaccayena paccayoti. Tatrāpi ‘‘paccayo’’ti avatvā ‘‘hetupaccayenā’’ti vacanaṃ hetuno aññathā paccayabhāvapaṭisedhanatthaṃ. Ayañhi hetu hetupaccayenāpi paccayo hoti, sahajātādipaccayenāpi. Tatrāssa yvāyaṃ sahajātādipaccayavasena aññathāpi paccayabhāvo, tassa paṭisedhanatthaṃ hetupaccayenāti vuttaṃ. Evaṃ santepi ‘‘taṃsampayuttakāna’’nti avatvā kasmā ‘‘hetusampayuttakāna’’nti vuttanti? Niddisitabbassa apākaṭattā. Taṃsampayuttakānanti hi vutte yena te taṃsampayuttakā nāma honti ",
      ", ayaṃ nāma soti niddisitabbo apākaṭo. Tassa apākaṭattā yena sampayuttā te taṃsampayuttakāti vuccanti, taṃ sarūpatova dassetuṃ ‘‘hetusampayuttakāna’’nti vuttaṃ."
    ],
    "innerText": "Idāni hetū hetusampayuttakānanti ettha ‘‘hetusampayuttakāna’’nti avatvā ‘‘hetū hetusampayuttakāna’’nti kasmā vuttanti? Paccayassa ceva paccayuppannānañca vavatthāpanato. Hetusampayuttakānanti hi vutte hetunā sampayuttakānaṃ hetupaccayena paccayoti attho bhaveyya. Evaṃ sante asuko nāma dhammo hetupaccayena paccayoti paccayavavatthānaṃ na paññāyeyya. Athāpi hetunā sampayuttakānaṃ hetusampayuttakānanti atthaṃ aggahetvāva yesaṃ kesañci sampayuttakānaṃ hetū hetupaccayena paccayoti attho bhaveyya, evaṃ sante hetunā vippayuttā cakkhuviññāṇādayopi sampayuttakāyeva, hetunā sampayuttā kusalādayopi. Tattha ayaṃ hetu asukassa nāma sampayuttakadhammassa paccayoti paccayuppannavavatthānaṃ na paññāyeyya. Tasmā paccayañceva paccayuppannañca vavatthāpento ‘‘hetū hetusampayuttakāna’’nti āha. Tassattho – hetusampayuttakānaṃ kusalādidhammānaṃ yo hetu sampayuttako, so hetupaccayena paccayoti. Tatrāpi ‘‘paccayo’’ti avatvā ‘‘hetupaccayenā’’ti vacanaṃ hetuno aññathā paccayabhāvapaṭisedhanatthaṃ. Ayañhi hetu hetupaccayenāpi paccayo hoti, sahajātādipaccayenāpi. Tatrāssa yvāyaṃ sahajātādipaccayavasena aññathāpi paccayabhāvo, tassa paṭisedhanatthaṃ hetupaccayenāti vuttaṃ. Evaṃ santepi ‘‘taṃsampayuttakāna’’nti avatvā kasmā ‘‘hetusampayuttakāna’’nti vuttanti? Niddisitabbassa apākaṭattā. Taṃsampayuttakānanti hi vutte yena te taṃsampayuttakā nāma honti , ayaṃ nāma soti niddisitabbo apākaṭo. Tassa apākaṭattā yena sampayuttā te taṃsampayuttakāti vuccanti, taṃ sarūpatova dassetuṃ ‘‘hetusampayuttakāna’’nti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃsamuṭṭhānāna"
      },
      "nti ettha pana niddisitabbassa pākaṭattā taṃ-gahaṇaṃ kataṃ. Ayañhettha attho – te hetū ceva hetusampayuttakā ca dhammā samuṭṭhānaṃ etesanti taṃsamuṭṭhānāni. Tesaṃ taṃsamuṭṭhānānaṃ, hetuto ceva hetusampayuttadhammehi ca nibbattānanti attho. Iminā cittasamuṭṭhānarūpaṃ gaṇhāti ",
      ". Kiṃ pana taṃ cittato aññenapi samuṭṭhātīti? Āma, samuṭṭhāti. Sabbepi hi cittacetasikā ekato hutvā rūpaṃ samuṭṭhāpenti. Lokiyadhammadesanāyaṃ pana cittassa adhikabhāvato tathāvidhaṃ rūpaṃ cittasamuṭṭhānanti vuccati. Tenevāha cittacetasikā dhammā cittasamuṭṭhānānaṃ rūpānaṃ sahajātapaccayena paccayoti."
    ],
    "innerText": "Taṃsamuṭṭhānānanti ettha pana niddisitabbassa pākaṭattā taṃ-gahaṇaṃ kataṃ. Ayañhettha attho – te hetū ceva hetusampayuttakā ca dhammā samuṭṭhānaṃ etesanti taṃsamuṭṭhānāni. Tesaṃ taṃsamuṭṭhānānaṃ, hetuto ceva hetusampayuttadhammehi ca nibbattānanti attho. Iminā cittasamuṭṭhānarūpaṃ gaṇhāti . Kiṃ pana taṃ cittato aññenapi samuṭṭhātīti? Āma, samuṭṭhāti. Sabbepi hi cittacetasikā ekato hutvā rūpaṃ samuṭṭhāpenti. Lokiyadhammadesanāyaṃ pana cittassa adhikabhāvato tathāvidhaṃ rūpaṃ cittasamuṭṭhānanti vuccati. Tenevāha cittacetasikā dhammā cittasamuṭṭhānānaṃ rūpānaṃ sahajātapaccayena paccayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yadi evaṃ idhāpi ‘‘taṃsamuṭṭhānāna’’nti avatvā cittasamuṭṭhānānanti kasmā na vuttanti? Acittasamuṭṭhānānampi saṅgaṇhanato. Pañhāvārasmiñhi ‘‘paṭisandhikkhaṇe vipākābyākatā hetū sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpānaṃ hetupaccayena paccayoti āgataṃ’’. Tassa saṅgaṇhanatthaṃ idha cittasamuṭṭhānānanti avatvā taṃsamuṭṭhānānanti vuttaṃ. Tassattho – cittajarūpaṃ ajanayamānāpi te hetū hetusampayuttakā dhammā sahajātādipaccayavasena samuṭṭhānaṃ etesanti taṃsamuṭṭhānāni. Tesaṃ taṃsamuṭṭhānānaṃ pavatte cittajānaṃ paṭisandhiyañca kaṭattārūpānampi hetū hetupaccayena paccayoti. Iminā upāyena aññesupi taṃsamuṭṭhānānanti āgataṭṭhānesu attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kasmā panāyaṃ hetu paṭisandhiyameva kaṭattārūpānaṃ hetupaccayo hoti, na pavatteti? Paṭisandhiyaṃ kammajarūpānaṃ cittapaṭibaddhavuttitāya. Paṭisandhiyañhi kammajarūpānaṃ cittapaṭibaddhā pavatti, cittavasena uppajjanti ceva tiṭṭhanti ca. Tasmiñhi khaṇe cittaṃ cittajarūpaṃ janetuṃ na sakkoti, tānipi vinā cittena uppajjituṃ vā ṭhātuṃ vā na sakkonti. Tenevāha – ‘‘viññāṇapaccayā nāmarūpaṃ, tasmiṃ patiṭṭhite viññāṇe nāmarūpassa avakkanti hotī’’ti (saṃ. ni. 2.39). Pavattiyaṃ pana tesaṃ citte vijjamānepi kammapaṭibaddhāva pavatti, na cittapaṭibaddhā. Avijjamāne cāpi citte nirodhasamāpannānaṃ uppajjantiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kasmā pana paṭisandhikkhaṇe cittaṃ cittajarūpaṃ janetuṃ na sakkotīti? Kammavegakkhittatāya ",
      " ceva appatiṭṭhitavatthutāya ca dubbalattā. Tañhi tadā kammavegakkhittaṃ apurejātavatthukattā ca appatiṭṭhitavatthukanti dubbalaṃ hoti. Tasmā papāte patitamatto puriso kiñci sippaṃ kātuṃ viya rūpaṃ janetuṃ na sakkoti; kammajarūpameva panassa cittasamuṭṭhānarūpaṭṭhāne tiṭṭhati. Tañca kammajarūpasseva bījaṭṭhāne tiṭṭhati. Kammaṃ panassa khettasadisaṃ, kilesā ",
      " āpasadisā. Tasmā santepi khette āpe ca paṭhamuppattiyaṃ bījānubhāvena rukkhuppatti viya paṭisandhikkhaṇe cittānubhāvena rūpakāyassa uppatti. Bīje pana vigatepi pathavīāpānubhāvena rukkhassa uparūpari pavatti viya; vinā cittena kammatova kaṭattārūpānaṃ pavatti hotīti veditabbā. Vuttampi cetaṃ – ‘‘kammaṃ khettaṃ viññāṇaṃ bījaṃ taṇhā sneho’’ti (a. ni. 3.77)."
    ],
    "innerText": "Kasmā pana paṭisandhikkhaṇe cittaṃ cittajarūpaṃ janetuṃ na sakkotīti? Kammavegakkhittatāya ceva appatiṭṭhitavatthutāya ca dubbalattā. Tañhi tadā kammavegakkhittaṃ apurejātavatthukattā ca appatiṭṭhitavatthukanti dubbalaṃ hoti. Tasmā papāte patitamatto puriso kiñci sippaṃ kātuṃ viya rūpaṃ janetuṃ na sakkoti; kammajarūpameva panassa cittasamuṭṭhānarūpaṭṭhāne tiṭṭhati. Tañca kammajarūpasseva bījaṭṭhāne tiṭṭhati. Kammaṃ panassa khettasadisaṃ, kilesā āpasadisā. Tasmā santepi khette āpe ca paṭhamuppattiyaṃ bījānubhāvena rukkhuppatti viya paṭisandhikkhaṇe cittānubhāvena rūpakāyassa uppatti. Bīje pana vigatepi pathavīāpānubhāvena rukkhassa uparūpari pavatti viya; vinā cittena kammatova kaṭattārūpānaṃ pavatti hotīti veditabbā. Vuttampi cetaṃ – ‘‘kammaṃ khettaṃ viññāṇaṃ bījaṃ taṇhā sneho’’ti (a. ni. 3.77)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayañca panattho okāsavaseneva gahetabbo. Tayo hi okāsā – nāmokāso, rūpokāso, nāmarūpokāsoti. Tattha arūpabhavo nāmokāso nāma. Tatra hi hadayavatthumattampi rūpapaccayaṃ vinā arūpadhammāva uppajjanti. Asaññabhavo rūpokāso nāma. Tatra hi paṭisandhicittamattampi arūpapaccayaṃ vinā rūpadhammāva uppajjanti. Pañcavokārabhavo nāmarūpokāso nāma. Tatra hi vatthurūpamattampi vinā paṭisandhiyaṃ arūpadhammā, paṭisandhicittañca vinā kammajāpi rūpadhammā nuppajjanti. Yuganaddhāva rūpārūpānaṃ uppatti. Yathā hi sassāmike sarājake gehe sadvārapālake rājāṇattiṃ vinā paṭhamappaveso nāma natthi, aparabhāge pana vināpi āṇattiṃ purimāṇattiānubhāveneva hoti, evameva pañcavokāre paṭisandhiviññāṇarājassa sahajātādipaccayataṃ vinā rūpassa paṭisandhivasena paṭhamuppatti nāma natthi. Aparabhāge pana vināpi paṭisandhiviññāṇassa sahajātādipaccayānubhāvaṃ purimānubhāvavasena laddhappavesassa kammato pavatti hoti. Asaññabhavo pana yasmā arūpokāso na hoti, tasmā tattha vināva arūpapaccayā asaññokāsattā rūpaṃ pavattati, assāmike suññagehe attano gehe ca purisassa paveso viya. Arūpabhavopi yasmā rūpokāso na hoti, tasmā tattha vināva rūpapaccayā aññokāsattā arūpadhammā pavattanti. Pañcavokārabhavo pana rūpārūpokāsoti natthettha arūpapaccayaṃ vinā paṭisandhikkhaṇe rūpānaṃ uppattīti. Iti ayaṃ hetu paṭisandhiyameva kaṭattārūpānaṃ paccayo hoti, na pavatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nanu ‘‘hetū sahajātānaṃ hetupaccayena paccayoti vutte sabbopi ayamattho gahito hoti, atha ",
      " kasmā ‘‘hetusampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpāna’’nti idaṃ gahitanti? Pavattiyaṃ kaṭattārūpādīnaṃ paccayabhāvapaṭibāhanato. Evañhi sati yāni pavattiyaṃ hetunā ",
      " saha ekakkhaṇe kaṭattārūpāni ceva utuāhārasamuṭṭhānāni ca jāyanti, tesampi hetū hetupaccayoti āpajjeyya, na ca so tesaṃ paccayo. Tasmā tesaṃ paccayabhāvassa paṭibāhanatthametaṃ gahitanti veditabbaṃ."
    ],
    "innerText": "Nanu ‘‘hetū sahajātānaṃ hetupaccayena paccayoti vutte sabbopi ayamattho gahito hoti, atha kasmā ‘‘hetusampayuttakānaṃ dhammānaṃ taṃsamuṭṭhānānañca rūpāna’’nti idaṃ gahitanti? Pavattiyaṃ kaṭattārūpādīnaṃ paccayabhāvapaṭibāhanato. Evañhi sati yāni pavattiyaṃ hetunā saha ekakkhaṇe kaṭattārūpāni ceva utuāhārasamuṭṭhānāni ca jāyanti, tesampi hetū hetupaccayoti āpajjeyya, na ca so tesaṃ paccayo. Tasmā tesaṃ paccayabhāvassa paṭibāhanatthametaṃ gahitanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ‘‘nānappakārabhedato paccayuppannato’’ti imesaṃ padānaṃ vasenettha viññātabbo vinicchayo. Tesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nānappakārabhedato"
      },
      "ti ayañhi hetu nāma jātito kusalākusalavipākakiriyabhedato catubbidho. Tattha kusalahetu bhūmantarato kāmāvacarādibhedena catubbidho, akusalahetu kāmāvacarova vipākahetu kāmāvacarādibhedena catubbidho, kiriyahetu kāmāvacaro rūpāvacaro arūpāvacaroti tividho. Tattha kāmāvacarakusalahetu nāmato alobhādivasena tividho. Rūpāvacarādikusalahetūsupi eseva nayo. Akusalahetu lobhādivasena tividho. Vipākakiriyahetū pana alobhādivasena tayo tayo honti. Taṃtaṃcittasampayogavasena pana tesaṃ tesaṃ hetūnaṃ nānappakārabhedoyevāti evaṃ tāvettha nānappakārabhedato viññātabbo vinicchayo."
    ],
    "innerText": "Idāni ‘‘nānappakārabhedato paccayuppannato’’ti imesaṃ padānaṃ vasenettha viññātabbo vinicchayo. Tesu nānappakārabhedatoti ayañhi hetu nāma jātito kusalākusalavipākakiriyabhedato catubbidho. Tattha kusalahetu bhūmantarato kāmāvacarādibhedena catubbidho, akusalahetu kāmāvacarova vipākahetu kāmāvacarādibhedena catubbidho, kiriyahetu kāmāvacaro rūpāvacaro arūpāvacaroti tividho. Tattha kāmāvacarakusalahetu nāmato alobhādivasena tividho. Rūpāvacarādikusalahetūsupi eseva nayo. Akusalahetu lobhādivasena tividho. Vipākakiriyahetū pana alobhādivasena tayo tayo honti. Taṃtaṃcittasampayogavasena pana tesaṃ tesaṃ hetūnaṃ nānappakārabhedoyevāti evaṃ tāvettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccayuppannato"
      },
      "ti iminā paccayena ime dhammā uppajjanti, imesaṃ nāma dhammānaṃ ayaṃ paccayoti evampi viññātabbo vinicchayoti attho. Tattha imasmiṃ tāva hetupaccaye kāmāvacarakusalahetu kāmabhavarūpabhavesu attanā sampayuttadhammānañceva cittasamuṭṭhānarūpānañca hetupaccayo hoti, arūpabhave sampayuttadhammānaṃyeva. Rūpāvacarakusalahetu kāmabhavarūpabhavesuyeva sampayuttadhammānañceva cittasamuṭṭhānarūpānañca hetupaccayo. Arūpāvacarakusalahetu kāmāvacarakusalahetusadisova. Tathā apariyāpannakusalahetu, tathā akusalahetu. Kāmāvacaravipākahetu pana kāmabhavasmiṃyeva attanā sampayuttadhammānaṃ, paṭisandhiyaṃ kaṭattārūpānaṃ, pavatte cittasamuṭṭhānarūpānañca hetupaccayo. Rūpāvacaravipākahetu rūpabhave vuttappakārānaññeva hetupaccayo. Arūpāvacaravipākahetu arūpabhave sampayuttakānaññeva hetupaccayo. Apariyāpannavipākahetu kāmabhavarūpabhavesu sampayuttakānañceva cittasamuṭṭhānarūpānañca arūpabhave arūpadhammānaññeva hetupaccayo. Kiriyahetūsu pana tebhūmakesupi ",
      " kusalahetusadisova paccayoti. Evamettha paccayuppannatopi viññātabbo vinicchayoti."
    ],
    "innerText": "Paccayuppannatoti iminā paccayena ime dhammā uppajjanti, imesaṃ nāma dhammānaṃ ayaṃ paccayoti evampi viññātabbo vinicchayoti attho. Tattha imasmiṃ tāva hetupaccaye kāmāvacarakusalahetu kāmabhavarūpabhavesu attanā sampayuttadhammānañceva cittasamuṭṭhānarūpānañca hetupaccayo hoti, arūpabhave sampayuttadhammānaṃyeva. Rūpāvacarakusalahetu kāmabhavarūpabhavesuyeva sampayuttadhammānañceva cittasamuṭṭhānarūpānañca hetupaccayo. Arūpāvacarakusalahetu kāmāvacarakusalahetusadisova. Tathā apariyāpannakusalahetu, tathā akusalahetu. Kāmāvacaravipākahetu pana kāmabhavasmiṃyeva attanā sampayuttadhammānaṃ, paṭisandhiyaṃ kaṭattārūpānaṃ, pavatte cittasamuṭṭhānarūpānañca hetupaccayo. Rūpāvacaravipākahetu rūpabhave vuttappakārānaññeva hetupaccayo. Arūpāvacaravipākahetu arūpabhave sampayuttakānaññeva hetupaccayo. Apariyāpannavipākahetu kāmabhavarūpabhavesu sampayuttakānañceva cittasamuṭṭhānarūpānañca arūpabhave arūpadhammānaññeva hetupaccayo. Kiriyahetūsu pana tebhūmakesupi kusalahetusadisova paccayoti. Evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Hetupaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Ārammaṇapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Ārammaṇapaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpāyatana"
      },
      "nti rūpasaṅkhātaṃ āyatanaṃ. Sesesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhuviññāṇadhātuyā"
      },
      "ti cakkhuviññāṇasaṅkhātāya dhātuyā. Sesapadesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃsampayuttakāna"
      },
      "nti tāya cakkhuviññāṇadhātuyā sampayuttakānaṃ tiṇṇaṃ khandhānaṃ, sabbesampi cakkhupasādavatthukānaṃ catunnaṃ khandhānaṃ rūpāyatanaṃ ārammaṇapaccayena paccayoti attho. Ito paresupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manodhātuyā"
      },
      "ti sasampayuttadhammāya tividhāyapi manodhātuyā rūpāyatanādīni pañca ārammaṇapaccayena paccayo, no ca kho ekakkhaṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbe dhammā"
      },
      "ti etāni ca rūpāyatanādīni pañca avasesā ca sabbepi ñeyyadhammā imā cha dhātuyo ṭhapetvā sesāya sasampayuttadhammāya manoviññāṇadhātuyā ārammaṇapaccayena paccayoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ yaṃ dhammaṃ ārabbhā"
      },
      "ti iminā ye ete etāsaṃ sattannaṃ viññāṇadhātūnaṃ ārammaṇadhammā vuttā, te tāsaṃ dhātūnaṃ ārammaṇaṃ katvā uppajjanakkhaṇeyeva ārammaṇapaccayo hontīti dīpeti. Evaṃ hontāpi ca na ekato honti, yaṃ yaṃ ārabbha ye ye uppajjanti, tesaṃ tesaṃ te te visuṃ visuṃ ārammaṇapaccayo hontītipi dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppajjantī"
      },
      "ti idaṃ yathā najjo sandanti, pabbatā tiṭṭhantīti sabbakālasaṅgahavasena, evaṃ vuttanti veditabbaṃ. Tena yepi ārabbha ye uppajjiṃsu, yepi uppajjissanti, te sabbe ārammaṇapaccayeneva uppajjiṃsu ca uppajjissanti cāti siddhaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittacetasikā dhammā"
      },
      "ti idaṃ ‘‘ye ye dhammā’’ti vuttānaṃ sarūpato nidassanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te te dhammā"
      },
      "ti te te ārammaṇadhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesaṃ tesa"
      },
      "nti tesaṃ tesaṃ cittacetasikadhammānaṃ. Ayaṃ tāvettha pāḷivaṇṇanā."
    ],
    "innerText": "2. Ārammaṇapaccayaniddese rūpāyatananti rūpasaṅkhātaṃ āyatanaṃ. Sesesupi eseva nayo. Cakkhuviññāṇadhātuyāti cakkhuviññāṇasaṅkhātāya dhātuyā. Sesapadesupi eseva nayo. Taṃsampayuttakānanti tāya cakkhuviññāṇadhātuyā sampayuttakānaṃ tiṇṇaṃ khandhānaṃ, sabbesampi cakkhupasādavatthukānaṃ catunnaṃ khandhānaṃ rūpāyatanaṃ ārammaṇapaccayena paccayoti attho. Ito paresupi eseva nayo. Manodhātuyāti sasampayuttadhammāya tividhāyapi manodhātuyā rūpāyatanādīni pañca ārammaṇapaccayena paccayo, no ca kho ekakkhaṇe. Sabbe dhammāti etāni ca rūpāyatanādīni pañca avasesā ca sabbepi ñeyyadhammā imā cha dhātuyo ṭhapetvā sesāya sasampayuttadhammāya manoviññāṇadhātuyā ārammaṇapaccayena paccayoti attho. Yaṃ yaṃ dhammaṃ ārabbhāti iminā ye ete etāsaṃ sattannaṃ viññāṇadhātūnaṃ ārammaṇadhammā vuttā, te tāsaṃ dhātūnaṃ ārammaṇaṃ katvā uppajjanakkhaṇeyeva ārammaṇapaccayo hontīti dīpeti. Evaṃ hontāpi ca na ekato honti, yaṃ yaṃ ārabbha ye ye uppajjanti, tesaṃ tesaṃ te te visuṃ visuṃ ārammaṇapaccayo hontītipi dīpeti. Uppajjantīti idaṃ yathā najjo sandanti, pabbatā tiṭṭhantīti sabbakālasaṅgahavasena, evaṃ vuttanti veditabbaṃ. Tena yepi ārabbha ye uppajjiṃsu, yepi uppajjissanti, te sabbe ārammaṇapaccayeneva uppajjiṃsu ca uppajjissanti cāti siddhaṃ hoti. Cittacetasikā dhammāti idaṃ ‘‘ye ye dhammā’’ti vuttānaṃ sarūpato nidassanaṃ. Te te dhammāti te te ārammaṇadhammā. Tesaṃ tesanti tesaṃ tesaṃ cittacetasikadhammānaṃ. Ayaṃ tāvettha pāḷivaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idaṃ pana ārammaṇaṃ nāma rūpārammaṇaṃ saddagandharasaphoṭṭhabbadhammārammaṇanti koṭṭhāsato chabbidhaṃ hoti. Tattha ṭhapetvā paññattiṃ avasesaṃ bhūmito ",
      " kāmāvacaraṃ…pe… apariyāpannanti catubbidhaṃ hoti. Tattha kāmāvacaraṃ kusalākusalavipākakiriyarūpabhedato pañcavidhaṃ; rūpāvacaraṃ kusalavipākakiriyato tividhaṃ, tathā arūpāvacaraṃ, apariyāpannaṃ kusalavipākanibbānavasena tividhaṃ hoti. Sabbameva vā etaṃ kusalākusalavipākakiriyarūpanibbānapaññattibhedato sattavidhaṃ hoti. Tattha kusalaṃ bhūmibhedato catubbidhaṃ hoti, akusalaṃ kāmāvacarameva, vipākaṃ catubhūmakaṃ, kiriyaṃ tibhūmakaṃ, rūpaṃ ekabhūmakaṃ kāmāvacarameva, nibbānampi ekabhūmakaṃ apariyāpannameva, paññatti bhūmivinimuttāti evamettha nānappakārabhedato viññātabbo vinicchayo."
    ],
    "innerText": "Idaṃ pana ārammaṇaṃ nāma rūpārammaṇaṃ saddagandharasaphoṭṭhabbadhammārammaṇanti koṭṭhāsato chabbidhaṃ hoti. Tattha ṭhapetvā paññattiṃ avasesaṃ bhūmito kāmāvacaraṃ…pe… apariyāpannanti catubbidhaṃ hoti. Tattha kāmāvacaraṃ kusalākusalavipākakiriyarūpabhedato pañcavidhaṃ; rūpāvacaraṃ kusalavipākakiriyato tividhaṃ, tathā arūpāvacaraṃ, apariyāpannaṃ kusalavipākanibbānavasena tividhaṃ hoti. Sabbameva vā etaṃ kusalākusalavipākakiriyarūpanibbānapaññattibhedato sattavidhaṃ hoti. Tattha kusalaṃ bhūmibhedato catubbidhaṃ hoti, akusalaṃ kāmāvacarameva, vipākaṃ catubhūmakaṃ, kiriyaṃ tibhūmakaṃ, rūpaṃ ekabhūmakaṃ kāmāvacarameva, nibbānampi ekabhūmakaṃ apariyāpannameva, paññatti bhūmivinimuttāti evamettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " bhinne panetasmiṃ ārammaṇe kāmāvacarakusalārammaṇaṃ kāmāvacarakusalassa, rūpāvacarakusalassa, akusalassa, kāmāvacaravipākassa, kāmāvacarakiriyassa, rūpāvacarakiriyassa cāti imesaṃ channaṃ rāsīnaṃ ārammaṇapaccayo hoti. Rūpāvacarakusalārammaṇaṃ tesu chasu rāsīsu kāmāvacaravipākavajjānaṃ pañcannaṃ rāsīnaṃ ārammaṇapaccayo hoti. Arūpāvacarakusalārammaṇaṃ kāmāvacarakusalassa, rūpāvacarakusalassa, arūpāvacarakusalassa, akusalassa, arūpāvaracaravipākassa, kāmāvacarakiriyassa, rūpāvacarakiriyassa, arūpāvacarakiriyassa cāti imesaṃ aṭṭhannaṃ rāsīnaṃ ārammaṇapaccayo hoti. Apariyāpannakusalārammaṇaṃ kāmāvacararūpāvacarato kusalakiriyānameva ārammaṇapaccayo hoti. Akusalārammaṇaṃ kāmāvacararūpāvacarakusalassa, akusalassa, kāmāvacaravipākassa, kāmāvacararūpāvacarakiriyassa cāti imesaṃ channaṃ rāsīnaṃ ārammaṇapaccayo hoti."
    ],
    "innerText": "Evaṃ bhinne panetasmiṃ ārammaṇe kāmāvacarakusalārammaṇaṃ kāmāvacarakusalassa, rūpāvacarakusalassa, akusalassa, kāmāvacaravipākassa, kāmāvacarakiriyassa, rūpāvacarakiriyassa cāti imesaṃ channaṃ rāsīnaṃ ārammaṇapaccayo hoti. Rūpāvacarakusalārammaṇaṃ tesu chasu rāsīsu kāmāvacaravipākavajjānaṃ pañcannaṃ rāsīnaṃ ārammaṇapaccayo hoti. Arūpāvacarakusalārammaṇaṃ kāmāvacarakusalassa, rūpāvacarakusalassa, arūpāvacarakusalassa, akusalassa, arūpāvaracaravipākassa, kāmāvacarakiriyassa, rūpāvacarakiriyassa, arūpāvacarakiriyassa cāti imesaṃ aṭṭhannaṃ rāsīnaṃ ārammaṇapaccayo hoti. Apariyāpannakusalārammaṇaṃ kāmāvacararūpāvacarato kusalakiriyānameva ārammaṇapaccayo hoti. Akusalārammaṇaṃ kāmāvacararūpāvacarakusalassa, akusalassa, kāmāvacaravipākassa, kāmāvacararūpāvacarakiriyassa cāti imesaṃ channaṃ rāsīnaṃ ārammaṇapaccayo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kāmāvacaravipākārammaṇaṃ kāmāvacararūpāvacarakusalassa, akusalassa, kāmāvacaravipākassa, kāmāvacararūpāvacarakiriyassa cāti imesaṃ channaṃ rāsīnaṃ ārammaṇapaccayo hoti. Rūpāvacaravipākārammaṇaṃ kāmāvacararūpāvacarakusalassa, akusalassa, kāmāvacararūpāvacarakiriyassa cāti imesaṃ pañcannaṃ rāsīnaṃ ārammaṇapaccayo hoti. Arūpāvacaravipākārammaṇampi imesaṃyeva pañcannaṃ rāsīnaṃ ārammaṇapaccayo hoti. Apariyāpannavipākārammaṇaṃ kāmāvacararūpāvacarakusalakiriyānaññeva ārammaṇapaccayo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kāmāvacarakiriyārammaṇaṃ kāmāvacararūpāvacarakusalassa, akusalassa, kāmāvacaravipākassa, kāmāvacararūpāvacarakiriyassa cāti imesaṃ channaṃ rāsīnaṃ ",
      " ārammaṇapaccayo hoti. Rūpāvacarakiriyārammaṇaṃ imesu chasu rāsīsu kāmāvacaravipākavajjānaṃ pañcannaṃ rāsīnaṃ ārammaṇapaccayo hoti. Arūpāvacarakiriyārammaṇaṃ tesaṃ pañcannaṃ arūpāvacarakiriyassa cāti imesaṃ channaṃ rāsīnaṃ ārammaṇapaccayo hoti. Catusamuṭṭhānaṃ rūpakkhandhasaṅkhātaṃ rūpārammaṇaṃ kāmāvacararūpāvacarakusalassa akusalassa kāmāvacaravipākassa kāmāvacararūpāvacarakiriyassa cāti imesaṃ channaṃ rāsīnaṃ ārammaṇapaccayo hoti. Nibbānārammaṇaṃ kāmāvacararūpāvacarakusalassa, apariyāpannato kusalavipākassa, kāmāvacararūpāvacarakiriyassa cāti imesaṃ channaṃ rāsīnaṃ ārammaṇapaccayo hoti. Rūpāvacarakusalakiriyānaṃ keci nicchanti, taṃ yuttito upadhāretabbaṃ. Nānappakārakaṃ pana ",
      " paññattiārammaṇaṃ tebhūmakakusalassa, akusalassa, rūpāvacaravipākassa, arūpāvacaravipākassa, tebhūmakakiriyassa cāti imesaṃ navannaṃ rāsīnaṃ ārammaṇapaccayo hoti. Tattha yaṃ yaṃ ārammaṇaṃ yesaṃ yesaṃ paccayo, te te taṃtaṃpaccayuppannā nāma hontīti evamettha paccayuppannatopi viññātabbo vinicchayoti."
    ],
    "innerText": "Kāmāvacarakiriyārammaṇaṃ kāmāvacararūpāvacarakusalassa, akusalassa, kāmāvacaravipākassa, kāmāvacararūpāvacarakiriyassa cāti imesaṃ channaṃ rāsīnaṃ ārammaṇapaccayo hoti. Rūpāvacarakiriyārammaṇaṃ imesu chasu rāsīsu kāmāvacaravipākavajjānaṃ pañcannaṃ rāsīnaṃ ārammaṇapaccayo hoti. Arūpāvacarakiriyārammaṇaṃ tesaṃ pañcannaṃ arūpāvacarakiriyassa cāti imesaṃ channaṃ rāsīnaṃ ārammaṇapaccayo hoti. Catusamuṭṭhānaṃ rūpakkhandhasaṅkhātaṃ rūpārammaṇaṃ kāmāvacararūpāvacarakusalassa akusalassa kāmāvacaravipākassa kāmāvacararūpāvacarakiriyassa cāti imesaṃ channaṃ rāsīnaṃ ārammaṇapaccayo hoti. Nibbānārammaṇaṃ kāmāvacararūpāvacarakusalassa, apariyāpannato kusalavipākassa, kāmāvacararūpāvacarakiriyassa cāti imesaṃ channaṃ rāsīnaṃ ārammaṇapaccayo hoti. Rūpāvacarakusalakiriyānaṃ keci nicchanti, taṃ yuttito upadhāretabbaṃ. Nānappakārakaṃ pana paññattiārammaṇaṃ tebhūmakakusalassa, akusalassa, rūpāvacaravipākassa, arūpāvacaravipākassa, tebhūmakakiriyassa cāti imesaṃ navannaṃ rāsīnaṃ ārammaṇapaccayo hoti. Tattha yaṃ yaṃ ārammaṇaṃ yesaṃ yesaṃ paccayo, te te taṃtaṃpaccayuppannā nāma hontīti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ārammaṇapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Adhipatipaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Adhipatipaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chandādhipatī"
      },
      "ti chandasaṅkhāto adhipati. Chandaṃ dhuraṃ katvā chandaṃ jeṭṭhakaṃ katvā cittuppattikāle uppannassa kattukamyatāchandassetaṃ nāmaṃ. Sesesupi eseva nayo. Kasmā pana yathā hetupaccayaniddese hetū hetusampayuttakāna’’nti vuttaṃ, evamidha ‘‘adhipatī adhipatisampayuttakānanti avatvā ‘‘chandādhipati chandasampayuttakāna’’ntiādinā nayena desanā katāti? Ekakkhaṇe abhāvato. Purimanayasmiñhi dve tayo hetū ekakkhaṇepi hetupaccayo honti mūlaṭṭhena. Upakārakabhāvassa avijahanato. Adhipati pana jeṭṭhakaṭṭhena upakārako, na ca ekakkhaṇe bahū jeṭṭhakā nāma honti. Tasmā ekato uppannānampi nesaṃ ekakkhaṇe adhipatipaccayabhāvo natthi. Tassa adhipatipaccayabhāvassa ekakkhaṇe abhāvato idha evaṃ desanā katāti."
    ],
    "innerText": "3. Adhipatipaccayaniddese chandādhipatīti chandasaṅkhāto adhipati. Chandaṃ dhuraṃ katvā chandaṃ jeṭṭhakaṃ katvā cittuppattikāle uppannassa kattukamyatāchandassetaṃ nāmaṃ. Sesesupi eseva nayo. Kasmā pana yathā hetupaccayaniddese hetū hetusampayuttakāna’’nti vuttaṃ, evamidha ‘‘adhipatī adhipatisampayuttakānanti avatvā ‘‘chandādhipati chandasampayuttakāna’’ntiādinā nayena desanā katāti? Ekakkhaṇe abhāvato. Purimanayasmiñhi dve tayo hetū ekakkhaṇepi hetupaccayo honti mūlaṭṭhena. Upakārakabhāvassa avijahanato. Adhipati pana jeṭṭhakaṭṭhena upakārako, na ca ekakkhaṇe bahū jeṭṭhakā nāma honti. Tasmā ekato uppannānampi nesaṃ ekakkhaṇe adhipatipaccayabhāvo natthi. Tassa adhipatipaccayabhāvassa ekakkhaṇe abhāvato idha evaṃ desanā katāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " sahajātādhipatiṃ dassetvā idāni ārammaṇādhipatiṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yaṃ yaṃ dhammaṃ garuṃ katvā"
      },
      "tiādi āraddhaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yaṃ yaṃ dhamma"
      },
      "nti yaṃ yaṃ ārammaṇadhammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Garuṃ katvā"
      },
      "ti garukāracittīkāravasena vā assādavasena vā garuṃ bhāriyaṃ laddhabbaṃ avijahitabbaṃ anavaññātaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te te dhammā"
      },
      "ti te te garukātabbadhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesaṃ tesa"
      },
      "nti tesaṃ tesaṃ garukārakadhammānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhipatipaccayenā"
      },
      "ti ārammaṇādhipatipaccayena paccayo hotīti ayaṃ tāvettha pāḷivaṇṇanā."
    ],
    "innerText": "Evaṃ sahajātādhipatiṃ dassetvā idāni ārammaṇādhipatiṃ dassetuṃ yaṃ yaṃ dhammaṃ garuṃ katvātiādi āraddhaṃ. Tattha yaṃ yaṃ dhammanti yaṃ yaṃ ārammaṇadhammaṃ. Garuṃ katvāti garukāracittīkāravasena vā assādavasena vā garuṃ bhāriyaṃ laddhabbaṃ avijahitabbaṃ anavaññātaṃ katvā. Te te dhammāti te te garukātabbadhammā. Tesaṃ tesanti tesaṃ tesaṃ garukārakadhammānaṃ. Adhipatipaccayenāti ārammaṇādhipatipaccayena paccayo hotīti ayaṃ tāvettha pāḷivaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayaṃ ",
      " pana adhipati nāma sahajātārammaṇavasena duvidho. Tattha sahajāto chandādivasena catubbidho. Tesu ekeko kāmāvacarādivasena bhūmito catubbidho. Tattha kāmāvacaro kusalākusalakiriyavasena tividho. Akusalaṃ patvā panettha vīmaṃsādhipati na labbhati. Rūpārūpāvacaro kusalakiriyavasena duvidho, apariyāpanno kusalavipākavasena duvidho. Ārammaṇādhipati pana jātibhedato kusalākusalavipākakiriyarūpanibbānānaṃ vasena chabbidhoti evamettha nānappakārabhedato viññātabbo vinicchayo."
    ],
    "innerText": "Ayaṃ pana adhipati nāma sahajātārammaṇavasena duvidho. Tattha sahajāto chandādivasena catubbidho. Tesu ekeko kāmāvacarādivasena bhūmito catubbidho. Tattha kāmāvacaro kusalākusalakiriyavasena tividho. Akusalaṃ patvā panettha vīmaṃsādhipati na labbhati. Rūpārūpāvacaro kusalakiriyavasena duvidho, apariyāpanno kusalavipākavasena duvidho. Ārammaṇādhipati pana jātibhedato kusalākusalavipākakiriyarūpanibbānānaṃ vasena chabbidhoti evamettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhinne panettha sahajātādhipatimhi tāva kāmāvacarakusalakiriyasaṅkhāto adhipati duhetukatihetukesu cittuppādesu chandādīnaṃ aññataraṃ jeṭṭhakaṃ katvā uppattikāle attanā sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca adhipatipaccayo hoti. Rūpāvacarakusalakiriyasaṅkhātepi eseva nayo. Ayaṃ pana ekanteneva labbhati. Na hi te dhammā sahajātādhipatiṃ vinā uppajjanti. Arūpāvacarakusalakiriyasaṅkhāto pana pañcavokāre rūpāvacaraadhipatisadisova catuvokāre pana sampayuttadhammānaññeva adhipatipaccayo hoti. Tathā tatthuppanno sabbopi kāmāvacarādhipati. Apariyāpanno kusalatopi vipākatopi pañcavokāre ekanteneva sampayuttadhammānañceva cittasamuṭṭhānarūpānañca adhipatipaccayo hoti, catuvokāre arūpadhammānaññeva. Akusalo kāmabhave micchattaniyatacittesu ekanteneva sampayuttakānañceva cittasamuṭṭhānarūpānañca adhipatipaccayo hoti. Aniyato kāmabhavarūpabhavesu ",
      " attano adhipatikāle tesaññeva. Arūpabhave arūpadhammānaññeva adhipatipaccayo hoti. Ayaṃ tāva sahajātādhipatimhi nayo."
    ],
    "innerText": "Evaṃ bhinne panettha sahajātādhipatimhi tāva kāmāvacarakusalakiriyasaṅkhāto adhipati duhetukatihetukesu cittuppādesu chandādīnaṃ aññataraṃ jeṭṭhakaṃ katvā uppattikāle attanā sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca adhipatipaccayo hoti. Rūpāvacarakusalakiriyasaṅkhātepi eseva nayo. Ayaṃ pana ekanteneva labbhati. Na hi te dhammā sahajātādhipatiṃ vinā uppajjanti. Arūpāvacarakusalakiriyasaṅkhāto pana pañcavokāre rūpāvacaraadhipatisadisova catuvokāre pana sampayuttadhammānaññeva adhipatipaccayo hoti. Tathā tatthuppanno sabbopi kāmāvacarādhipati. Apariyāpanno kusalatopi vipākatopi pañcavokāre ekanteneva sampayuttadhammānañceva cittasamuṭṭhānarūpānañca adhipatipaccayo hoti, catuvokāre arūpadhammānaññeva. Akusalo kāmabhave micchattaniyatacittesu ekanteneva sampayuttakānañceva cittasamuṭṭhānarūpānañca adhipatipaccayo hoti. Aniyato kāmabhavarūpabhavesu attano adhipatikāle tesaññeva. Arūpabhave arūpadhammānaññeva adhipatipaccayo hoti. Ayaṃ tāva sahajātādhipatimhi nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ārammaṇādhipatimhi pana kāmāvacarakusalo ārammaṇādhipati kāmāvacarakusalassa lobhasahagatākusalassāti imesaṃ dvinnaṃ rāsīnaṃ ārammaṇādhipatipaccayo hoti. Rūpāvacarārūpāvacarepi kusalārammaṇādhipatimhi eseva nayo. Apariyāpannakusalo pana ārammaṇādhipati kāmāvacarato ñāṇasampayuttakusalassa ceva ñāṇasampayuttakiriyassa ca ārammaṇādhipatipaccayo hoti. Akusalo pana ārammaṇādhipati nāma lobhasahagatacittuppādo vuccati. So lobhasahagatākusalasseva ārammaṇādhipatipaccayo hoti. Kāmāvacaro pana vipākārammaṇādhipati lobhasahagatākusalasseva ārammaṇādhipatipaccayo hoti. Tathā rūpāvacarārūpāvacaravipākārammaṇādhipati. Lokuttaro pana vipākārammaṇādhipati kāmāvacarato ñāṇasampayuttakusalakiriyānaññeva ",
      " ārammaṇādhipatipaccayo hoti. Kāmāvacarādibhedato pana tividhopi kiriyārammaṇādhipati lobhasahagatākusalasseva ārammaṇādhipatipaccayo hoti. Catusamuṭṭhānikarūpasaṅkhāto rūpakkhandho ārammaṇādhipati lobhasahagatākusalasseva ārammaṇādhipatipaccayo hoti. Nibbānaṃ kāmāvacarato ñāṇasampayuttakusalassa ñāṇasampayuttakiriyassa lokuttarakusalassa lokuttaravipākassa cāti imesaṃ catunnaṃ rāsīnaṃ ārammaṇādhipatipaccayo hotīti evamettha paccayuppannatopi viññātabbo vinicchayoti."
    ],
    "innerText": "Ārammaṇādhipatimhi pana kāmāvacarakusalo ārammaṇādhipati kāmāvacarakusalassa lobhasahagatākusalassāti imesaṃ dvinnaṃ rāsīnaṃ ārammaṇādhipatipaccayo hoti. Rūpāvacarārūpāvacarepi kusalārammaṇādhipatimhi eseva nayo. Apariyāpannakusalo pana ārammaṇādhipati kāmāvacarato ñāṇasampayuttakusalassa ceva ñāṇasampayuttakiriyassa ca ārammaṇādhipatipaccayo hoti. Akusalo pana ārammaṇādhipati nāma lobhasahagatacittuppādo vuccati. So lobhasahagatākusalasseva ārammaṇādhipatipaccayo hoti. Kāmāvacaro pana vipākārammaṇādhipati lobhasahagatākusalasseva ārammaṇādhipatipaccayo hoti. Tathā rūpāvacarārūpāvacaravipākārammaṇādhipati. Lokuttaro pana vipākārammaṇādhipati kāmāvacarato ñāṇasampayuttakusalakiriyānaññeva ārammaṇādhipatipaccayo hoti. Kāmāvacarādibhedato pana tividhopi kiriyārammaṇādhipati lobhasahagatākusalasseva ārammaṇādhipatipaccayo hoti. Catusamuṭṭhānikarūpasaṅkhāto rūpakkhandho ārammaṇādhipati lobhasahagatākusalasseva ārammaṇādhipatipaccayo hoti. Nibbānaṃ kāmāvacarato ñāṇasampayuttakusalassa ñāṇasampayuttakiriyassa lokuttarakusalassa lokuttaravipākassa cāti imesaṃ catunnaṃ rāsīnaṃ ārammaṇādhipatipaccayo hotīti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Adhipatipaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4. Anantarapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Anantarapaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manodhātuyā"
      },
      "ti vipākamanodhātuyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manoviññāṇadhātuyā"
      },
      "ti santīraṇakiccāya ahetukavipākamanoviññāṇadhātuyā. Tato paraṃ pana voṭṭhabbanajavanatadārammaṇabhavaṅgakiccā manoviññāṇadhātuyo ",
      " vattabbā siyuṃ, tā avuttāpi imināva nayena veditabbāti nayaṃ dassetvā desanā saṅkhittā. ‘‘Purimā purimā kusalā dhammā’’tiādike ca chaṭṭhanaye tā saṅgahitātipi idha na vuttāti veditabbā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purimā purimā"
      },
      "ti chasu dvāresupi anantarātītā kusalajavanadhammā daṭṭhabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchimānaṃ pacchimāna"
      },
      "nti anantarauppajjamānānaññeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalāna"
      },
      "nti sadisakusalānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abyākatāna"
      },
      "nti idaṃ pana kusalānantaraṃ tadārammaṇabhavaṅgaphalasamāpattivasena vuttaṃ. Akusalamūlake ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abyākatāna"
      },
      "nti tadārammaṇabhavaṅgasaṅkhātānaññeva. Abyākatamūlake ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abyākatāna"
      },
      "nti āvajjanajavanavasena vā bhavaṅgavasena vā pavattānaṃ kiriyavipākābyākatānaṃ kiriyamanodhātuto paṭṭhāya pana yāva voṭṭhabbanakiccā manoviññāṇadhātu, tāva pavattesu vīthicittesupi ayaṃ nayo labbhateva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalāna"
      },
      "nti pañcadvāre voṭṭhabbanānantarānaṃ manodvāre āvajjanāntarānaṃ paṭhamajavanakusalānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akusalāna"
      },
      "nti padepi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yesaṃ yesa"
      },
      "nti idaṃ sabbesampi anantarapaccayadhammānaṃ. Saṅkhepalakkhaṇanti ayaṃ tāvettha pāḷivaṇṇanā."
    ],
    "innerText": "4. Anantarapaccayaniddese manodhātuyāti vipākamanodhātuyā. Manoviññāṇadhātuyāti santīraṇakiccāya ahetukavipākamanoviññāṇadhātuyā. Tato paraṃ pana voṭṭhabbanajavanatadārammaṇabhavaṅgakiccā manoviññāṇadhātuyo vattabbā siyuṃ, tā avuttāpi imināva nayena veditabbāti nayaṃ dassetvā desanā saṅkhittā. ‘‘Purimā purimā kusalā dhammā’’tiādike ca chaṭṭhanaye tā saṅgahitātipi idha na vuttāti veditabbā. Tattha purimā purimāti chasu dvāresupi anantarātītā kusalajavanadhammā daṭṭhabbā. Pacchimānaṃ pacchimānanti anantarauppajjamānānaññeva. Kusalānanti sadisakusalānaṃ. Abyākatānanti idaṃ pana kusalānantaraṃ tadārammaṇabhavaṅgaphalasamāpattivasena vuttaṃ. Akusalamūlake abyākatānanti tadārammaṇabhavaṅgasaṅkhātānaññeva. Abyākatamūlake abyākatānanti āvajjanajavanavasena vā bhavaṅgavasena vā pavattānaṃ kiriyavipākābyākatānaṃ kiriyamanodhātuto paṭṭhāya pana yāva voṭṭhabbanakiccā manoviññāṇadhātu, tāva pavattesu vīthicittesupi ayaṃ nayo labbhateva. Kusalānanti pañcadvāre voṭṭhabbanānantarānaṃ manodvāre āvajjanāntarānaṃ paṭhamajavanakusalānaṃ. Akusalānanti padepi eseva nayo. Yesaṃ yesanti idaṃ sabbesampi anantarapaccayadhammānaṃ. Saṅkhepalakkhaṇanti ayaṃ tāvettha pāḷivaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayaṃ ",
      " pana anantarapaccayo nāma ṭhapetvā nibbānaṃ catubhūmako arūpadhammarāsiyevāti veditabbo. So jātivasena kusalākusalavipākakiriyato catudhā bhijjati. Tattha kusalo kāmāvacarādibhedato catubbidho hoti, akusalo kāmāvacarova vipāko catubhūmako, kiriyānantarapaccayo pana te bhūmakoti evamettha nānappakārabhedato viññātabbo vinicchayo."
    ],
    "innerText": "Ayaṃ pana anantarapaccayo nāma ṭhapetvā nibbānaṃ catubhūmako arūpadhammarāsiyevāti veditabbo. So jātivasena kusalākusalavipākakiriyato catudhā bhijjati. Tattha kusalo kāmāvacarādibhedato catubbidho hoti, akusalo kāmāvacarova vipāko catubhūmako, kiriyānantarapaccayo pana te bhūmakoti evamettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhinne panettha kāmāvacarakusalo attanā sadisasseva kāmāvacarakusalassa anantarapaccayo hoti. Ñāṇasampayuttakāmāvacarakusalo pana rūpāvacarakusalassa arūpāvacarakusalassa lokuttarakusalassāti imesaṃ tiṇṇaṃ rāsīnaṃ anantarapaccayo hoti. Kāmāvacarakusalo ca kāmāvacaravipākassa, rūpāvacarārūpāvacaravipākassa, ñāṇasampayutto lokuttaravipākassāpīti imesaṃ catunnaṃ rāsīnaṃ anantarapaccayo hoti. Rūpāvacarakusalo rūpāvacarakusalassa, ñāṇasampayuttakāmāvacaravipākassa, rūpāvacaravipākassāti imesaṃ tiṇṇaṃ rāsīnaṃ anantarapaccayo hoti. Arūpāvacarakusalo tesaṃ dvinnaṃ vipākānaṃ attano ",
      " kusalassa vipākassa cāti avisesena catunnaṃ rāsīnaṃ anantarapaccayo hoti. Visesena panettha nevasaññānāsaññāyatanakusalo anāgāmiphalasaṅkhātassa lokuttaravipākassapi anantarapaccayo hoti. Lokuttarakusalo lokuttaravipākasseva anantarapaccayo hoti. Akusalo avisesena akusalassa ceva kusalākusalavipākassa ca. Visesena panettha sukhamajjhattavedanāsampayutto akusalo rūpāvacarārūpāvacaravipākassāpīti imesaṃ catunnaṃ rāsīnaṃ anantarapaccayo hoti."
    ],
    "innerText": "Evaṃ bhinne panettha kāmāvacarakusalo attanā sadisasseva kāmāvacarakusalassa anantarapaccayo hoti. Ñāṇasampayuttakāmāvacarakusalo pana rūpāvacarakusalassa arūpāvacarakusalassa lokuttarakusalassāti imesaṃ tiṇṇaṃ rāsīnaṃ anantarapaccayo hoti. Kāmāvacarakusalo ca kāmāvacaravipākassa, rūpāvacarārūpāvacaravipākassa, ñāṇasampayutto lokuttaravipākassāpīti imesaṃ catunnaṃ rāsīnaṃ anantarapaccayo hoti. Rūpāvacarakusalo rūpāvacarakusalassa, ñāṇasampayuttakāmāvacaravipākassa, rūpāvacaravipākassāti imesaṃ tiṇṇaṃ rāsīnaṃ anantarapaccayo hoti. Arūpāvacarakusalo tesaṃ dvinnaṃ vipākānaṃ attano kusalassa vipākassa cāti avisesena catunnaṃ rāsīnaṃ anantarapaccayo hoti. Visesena panettha nevasaññānāsaññāyatanakusalo anāgāmiphalasaṅkhātassa lokuttaravipākassapi anantarapaccayo hoti. Lokuttarakusalo lokuttaravipākasseva anantarapaccayo hoti. Akusalo avisesena akusalassa ceva kusalākusalavipākassa ca. Visesena panettha sukhamajjhattavedanāsampayutto akusalo rūpāvacarārūpāvacaravipākassāpīti imesaṃ catunnaṃ rāsīnaṃ anantarapaccayo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kāmāvacaravipākassa ñāṇasampayutto vā ñāṇavippayutto vā vipāko kāmāvacarakiriyāvajjanassa, ñāṇasampayuttavipāko panettha paṭisandhivasena uppajjamānassa rūpāvacarārūpāvacaravipākassāpīti imesaṃ catunnaṃ rāsīnaṃ anantarapaccayo hoti. Rūpāvacaravipāko sahetukakāmāvacaravipākassa rūpāvacarārūpāvacaravipākassa kāmāvacarakiriyāvajjanassāti imesaṃ catunnaṃ rāsīnaṃ anantarapaccayo hoti. Arūpāvacaravipāko tihetukakāmāvacaravipākassa arūpāvacaravipākassa kāmāvacarakiriyāvajjanassāti tiṇṇaṃ rāsīnaṃ anantarapaccayo hoti. Lokuttaravipāko tihetukakāmāvacaravipākassa rūpāvacarārūpāvacaralokuttaravipākassāti catunnaṃ rāsīnaṃ anantarapaccayo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kāmāvacarakiriyaṃ kāmāvacarakusalākusalassa catubhūmakavipākassa tebhūmakakiriyassāti navannaṃ ",
      " rāsīnaṃ anantarapaccayo hoti. Rūpāvacarakiriyaṃ tihetukakāmāvacaravipākassa rūpāvacaravipākassa rūpāvacarakiriyassāti tiṇṇaṃ rāsīnaṃ anantarapaccayo hoti. Arūpāvacarakiriyaṃ tihetukakāmāvacaravipākassa rūpāvacarārūpāvacaralokuttaravipākassa arūpāvacarakiriyassāti pañcannaṃ rāsīnaṃ anantarapaccayo hotīti. Evamettha paccayuppannatopi viññātabbo vinicchayoti."
    ],
    "innerText": "Kāmāvacarakiriyaṃ kāmāvacarakusalākusalassa catubhūmakavipākassa tebhūmakakiriyassāti navannaṃ rāsīnaṃ anantarapaccayo hoti. Rūpāvacarakiriyaṃ tihetukakāmāvacaravipākassa rūpāvacaravipākassa rūpāvacarakiriyassāti tiṇṇaṃ rāsīnaṃ anantarapaccayo hoti. Arūpāvacarakiriyaṃ tihetukakāmāvacaravipākassa rūpāvacarārūpāvacaralokuttaravipākassa arūpāvacarakiriyassāti pañcannaṃ rāsīnaṃ anantarapaccayo hotīti. Evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anantarapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "5. Samanantarapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". Samanantarapaccayaniddesopi ",
      " iminā samānagatikova. Ime pana dve paccayā mahāvitthārā, tasmā sabbacittuppattivasena tesaṃ upaparikkhitvā vitthāro gahetabboti."
    ],
    "innerText": "5. Samanantarapaccayaniddesopi iminā samānagatikova. Ime pana dve paccayā mahāvitthārā, tasmā sabbacittuppattivasena tesaṃ upaparikkhitvā vitthāro gahetabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Samanantarapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "6. Sahajātapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". Sahajātapaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññamañña"
      },
      "nti añño aññassa. Iminā etesaṃ dhammānaṃ ekakkhaṇe paccayabhāvañceva paccayuppannabhāvañca dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Okkantikkhaṇe"
      },
      "ti pañcavokārabhave paṭisandhikkhaṇe. Tasmiñhi khaṇe nāmarūpaṃ okkantaṃ viya pakkhandantaṃ viya paralokato imaṃ lokaṃ āgantvā pavisantaṃ viya uppajjati, tasmā so khaṇo ‘‘okkantikkhaṇo’’ti vuccati. Ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpa"
      },
      "nti hadayavatthumattameva adhippetaṃ. Tañhi nāmassa, nāmañca tassa aññamaññaṃ sahajātapaccayaṭṭhaṃ pharati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittacetasikā"
      },
      "ti pavattiyaṃ cattāro khandhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātapaccayenā"
      },
      "ti ettha cittasamuṭṭhānarūpā cittacetasikānaṃ paccayaṭṭhaṃ na pharanti, tasmā ‘‘aññamañña’’nti ",
      " na vuttaṃ. Tathā upādārūpā bhūtānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpino dhammā arūpīnaṃ dhammāna"
      },
      "nti hadayavatthu catunnaṃ khandhānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiñci kāle"
      },
      "ti kismiñci kāle. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātapaccayenā"
      },
      "ti paṭisandhiṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na sahajātapaccayenā"
      },
      "ti pavattiṃ sandhāya vuttaṃ."
    ],
    "innerText": "6. Sahajātapaccayaniddese aññamaññanti añño aññassa. Iminā etesaṃ dhammānaṃ ekakkhaṇe paccayabhāvañceva paccayuppannabhāvañca dīpeti. Okkantikkhaṇeti pañcavokārabhave paṭisandhikkhaṇe. Tasmiñhi khaṇe nāmarūpaṃ okkantaṃ viya pakkhandantaṃ viya paralokato imaṃ lokaṃ āgantvā pavisantaṃ viya uppajjati, tasmā so khaṇo ‘‘okkantikkhaṇo’’ti vuccati. Ettha ca rūpanti hadayavatthumattameva adhippetaṃ. Tañhi nāmassa, nāmañca tassa aññamaññaṃ sahajātapaccayaṭṭhaṃ pharati. Cittacetasikāti pavattiyaṃ cattāro khandhā. Sahajātapaccayenāti ettha cittasamuṭṭhānarūpā cittacetasikānaṃ paccayaṭṭhaṃ na pharanti, tasmā ‘‘aññamañña’’nti na vuttaṃ. Tathā upādārūpā bhūtānaṃ. Rūpino dhammā arūpīnaṃ dhammānanti hadayavatthu catunnaṃ khandhānaṃ. Kiñci kāleti kismiñci kāle. Sahajātapaccayenāti paṭisandhiṃ sandhāya vuttaṃ. Na sahajātapaccayenāti pavattiṃ sandhāya vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ pana ‘cattāro khandhā arūpino aññamaññaṃ sahajātapaccayena paccayo’ti evaṃ chahi koṭṭhāsehi ṭhito. Tattha tayo koṭṭhāsā aññamaññavasena vuttā, tayo na aññamaññavasena. Tattha paṭhamakoṭṭhāse arūpameva paccayo ceva paccayuppannañca, dutiye rūpameva, tatiye nāmarūpaṃ, catutthe paccayo arūpaṃ, paccayuppannaṃ rūpaṃ; pañcame paccayopi paccayuppannampi rūpameva; chaṭṭhe paccayo rūpaṃ, paccayuppannaṃ arūpanti ayaṃ tāvettha pāḷivaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayaṃ pana sahajātapaccayo jātivasena kusalo akusalo vipāko kiriyaṃ rūpanti pañcadhā bhijjati. Tattha kusalo bhūmito catubbidho ",
      " hoti, akusalo ekavidhova vipāko catubbidho, kiriyasaṅkhāto tividho, rūpaṃ ekavidhaṃ kāmāvacaramevāti evaṃ tāvettha nānappakārabhedato viññātabbo vinicchayo."
    ],
    "innerText": "Ayaṃ pana sahajātapaccayo jātivasena kusalo akusalo vipāko kiriyaṃ rūpanti pañcadhā bhijjati. Tattha kusalo bhūmito catubbidho hoti, akusalo ekavidhova vipāko catubbidho, kiriyasaṅkhāto tividho, rūpaṃ ekavidhaṃ kāmāvacaramevāti evaṃ tāvettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ bhinne panettha catubhūmakampi kusalaṃ pañcavokārabhave attanā sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca sahajātapaccayo hoti, tathā akusalaṃ. Yaṃ panettha arūpe uppajjati, taṃ arūpadhammānaṃyeva sahajātapaccayo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kāmāvacararūpāvacaravipākaṃ cittasamuṭṭhānarūpassa ceva sampayuttadhammānañca sahajātapaccayo hoti. Yaṃ panettha rūpaṃ na samuṭṭhāpeti, taṃ sampayuttadhammānaññeva. Yaṃ paṭisandhiyaṃ uppajjati, taṃ kaṭattārūpānañcāpi sahajātapaccayo hoti. Arūpāvacaravipākaṃ sampayuttadhammānaññeva. Lokuttaravipākaṃ pañcavokāre sampayuttadhammānañceva cittasamuṭṭhānarūpānañca, catuvokāre arūpānaññeva. Kāmāvacaraarūpāvacarakiriyā pañcavokāre sampayuttakānañceva cittasamuṭṭhānarūpānañca sahajātapaccayo hoti, catuvokāre arūpānaññeva. Rūpāvacarakiriyā sampayuttadhammānañceva cittasamuṭṭhānarūpānañca ekantena sahajātapaccayo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catusamuṭṭhānikassa ",
      " rūpassa kammasamuṭṭhānarūpe ekaṃ mahābhūtaṃ tiṇṇaṃ, tīṇi ekassa, dve dvinnaṃ mahābhūtānaṃ, mahābhūtā upādārūpassa sahajātapaccayena paccayo. Kāmāvacararūpāvacarapaṭisandhikkhaṇe vatthurūpaṃ vipākakkhandhānaṃ sahajātapaccayena paccayo. Utucittāhārasamuṭṭhānesu pana mahābhūtāni aññamaññañceva upādārūpassa ca sahajātapaccayena paccayoti evamettha paccayuppannatopi viññātabbo vinicchayoti."
    ],
    "innerText": "Catusamuṭṭhānikassa rūpassa kammasamuṭṭhānarūpe ekaṃ mahābhūtaṃ tiṇṇaṃ, tīṇi ekassa, dve dvinnaṃ mahābhūtānaṃ, mahābhūtā upādārūpassa sahajātapaccayena paccayo. Kāmāvacararūpāvacarapaṭisandhikkhaṇe vatthurūpaṃ vipākakkhandhānaṃ sahajātapaccayena paccayo. Utucittāhārasamuṭṭhānesu pana mahābhūtāni aññamaññañceva upādārūpassa ca sahajātapaccayena paccayoti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sahajātapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "7. Aññamaññapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". Aññamaññapaccayaniddese sahajātapaccayaniddesassa purimānaṃ tiṇṇaṃ koṭṭhāsānaṃ vasena pāḷi āgatā. Tassā tattha vuttasadisāva vaṇṇanāti puna na gahitā. Ayampi ca aññamaññapaccayo jātivasena kusalo akusalo vipāko kiriyaṃ rūpanti pañcadhā bhinno. Tattha kusalo bhūmito ",
      " catubbidho. Sabbaṃ purimasadisamevāti evamettha nānappakārabhedato viññātabbo vinicchayo."
    ],
    "innerText": "7. Aññamaññapaccayaniddese sahajātapaccayaniddesassa purimānaṃ tiṇṇaṃ koṭṭhāsānaṃ vasena pāḷi āgatā. Tassā tattha vuttasadisāva vaṇṇanāti puna na gahitā. Ayampi ca aññamaññapaccayo jātivasena kusalo akusalo vipāko kiriyaṃ rūpanti pañcadhā bhinno. Tattha kusalo bhūmito catubbidho. Sabbaṃ purimasadisamevāti evamettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ bhinne panettha sabbampi catubhūmakaṃ kusalaṃ attanā sampayuttadhammānaṃ aññamaññapaccayena paccayo. Tathā akusalaṃ. Vipāke pana kāmāvacararūpāvacaravipākaṃ paṭisandhiyaṃ vatthurūpassa, pavatte sampayuttadhammānaññeva. Arūpāvacaralokuttaravipākaṃ attanā sampayuttadhammānaññeva aññamaññapaccayena paccayo. Sabbampi kiriyaṃ sampayuttadhammānaññeva aññamaññapaccayena paccayo. Catusamuṭṭhānikarūpassa kammasamuṭṭhāne ekaṃ mahābhūtaṃ tiṇṇaṃ, tīṇi ekassa, dve dvinnaṃ mahābhūtānaṃ aññamaññapaccayena paccayo. Kāmāvacararūpāvacarapaṭisandhiyaṃ vatthurūpaṃ vipākakkhandhānaṃ aññamaññapaccayena paccayo. Utucittāhārasamuṭṭhānesu mahābhūtāneva mahābhūtānaṃ aññamaññapaccayena paccayoti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aññamaññapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "8. Nissayapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ". Nissayapaccayaniddese ",
      " sahajātapaccayaniddesassa purimānaṃ pañcannaṃ koṭṭhāsānaṃ vasena sahajātanissayanayaṃ dassetvā puna chaṭṭhena koṭṭhāsena purejātanissayanayaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhāyatanaṃ cakkhuviññāṇadhātuyā"
      },
      "tiādi āraddhaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yaṃ rūpaṃ nissāyā"
      },
      "ti vatthurūpaṃ sandhāya vuttaṃ. Tañhi nissāya tividhā manodhātu, ṭhapetvā arūpavipākaṃ dvāsattatividhā manoviññāṇadhātūti imāni pañcasattati cittāni vattantīti ayaṃ tāvettha pāḷivaṇṇanā. Ayampi nissayapaccayo jātivasena kusalādibhedato pañcadhāva bhijjati. Tattha kusalo bhūmito catubbidhova akusalo ekavidho vipāko catubbidho, kiriyasaṅkhāto tividho, rūpaṃ ekavidhamevāti evamettha nānappakārabhedato viññātabbo vinicchayo."
    ],
    "innerText": "8. Nissayapaccayaniddese sahajātapaccayaniddesassa purimānaṃ pañcannaṃ koṭṭhāsānaṃ vasena sahajātanissayanayaṃ dassetvā puna chaṭṭhena koṭṭhāsena purejātanissayanayaṃ dassetuṃ cakkhāyatanaṃ cakkhuviññāṇadhātuyātiādi āraddhaṃ. Tattha yaṃ rūpaṃ nissāyāti vatthurūpaṃ sandhāya vuttaṃ. Tañhi nissāya tividhā manodhātu, ṭhapetvā arūpavipākaṃ dvāsattatividhā manoviññāṇadhātūti imāni pañcasattati cittāni vattantīti ayaṃ tāvettha pāḷivaṇṇanā. Ayampi nissayapaccayo jātivasena kusalādibhedato pañcadhāva bhijjati. Tattha kusalo bhūmito catubbidhova akusalo ekavidho vipāko catubbidho, kiriyasaṅkhāto tividho, rūpaṃ ekavidhamevāti evamettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhinne panettha catubhūmakampi kusalaṃ pañcavokāre sampayuttakkhandhānañceva cittasamuṭṭhānarūpassa ca nissayapaccayena paccayo hoti. Tathā akusalaṃ ",
      ". Yaṃ panettha āruppe uppajjati, taṃ arūpadhammānaññeva nissayapaccayo hoti. Kāmāvacararūpāvacaravipākaṃ pavatte sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca, paṭisandhiyaṃ kaṭattārūpassāpi nissayapaccayo hoti. Arūpāvacaravipākaṃ sampayuttakkhandhānaṃyeva hoti. Lokuttaravipākaṃ pañcavokāre; sampayuttakānañceva cittasamuṭṭhānarūpassa ca, catuvokāre arūpasseva nissayapaccayo hoti. Kāmāvacaraarūpāvacarakiriyā pañcavokāre sampayuttakānañceva cittasamuṭṭhānarūpassa ca nissayapaccayo hoti, catuvokāre arūpānaññeva. Rūpāvacarakiriyā sampayuttakānañceva cittasamuṭṭhānarūpassa ca ekantena nissayapaccayo hoti."
    ],
    "innerText": "Evaṃ bhinne panettha catubhūmakampi kusalaṃ pañcavokāre sampayuttakkhandhānañceva cittasamuṭṭhānarūpassa ca nissayapaccayena paccayo hoti. Tathā akusalaṃ . Yaṃ panettha āruppe uppajjati, taṃ arūpadhammānaññeva nissayapaccayo hoti. Kāmāvacararūpāvacaravipākaṃ pavatte sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca, paṭisandhiyaṃ kaṭattārūpassāpi nissayapaccayo hoti. Arūpāvacaravipākaṃ sampayuttakkhandhānaṃyeva hoti. Lokuttaravipākaṃ pañcavokāre; sampayuttakānañceva cittasamuṭṭhānarūpassa ca, catuvokāre arūpasseva nissayapaccayo hoti. Kāmāvacaraarūpāvacarakiriyā pañcavokāre sampayuttakānañceva cittasamuṭṭhānarūpassa ca nissayapaccayo hoti, catuvokāre arūpānaññeva. Rūpāvacarakiriyā sampayuttakānañceva cittasamuṭṭhānarūpassa ca ekantena nissayapaccayo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Catusamuṭṭhānikarūpassa ca kammasamuṭṭhānarūpe ekaṃ mahābhūtaṃ tiṇṇaṃ, tīṇi ekassa, dve dvinnaṃ mahābhūtānaṃ, mahābhūtā upādārūpānaṃ, vatthurūpaṃ pañcavokārabhave catubhūmakakusalassa, akusalassa, ṭhapetvā āruppavipākañceva dve pañcaviññāṇāni ca sesatebhūmakavipākassa, tebhūmakakiriyassāti imesaṃ catunnaṃ dhammarāsīnaṃ nissayapaccayo hoti. Cakkhāyatanādīni pañca sasampayuttānaṃ cakkhuviññāṇādīnaṃ nissayapaccayo hoti. Utucittāhārasamuṭṭhānesu pana mahābhūtā mahābhūtānañceva upādārūpassa ca nissayapaccayena paccayoti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nissayapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "9. Upanissayapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ". Upanissayapaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purimā purimā"
      },
      "ti anantarūpanissaye samanantarātītā labbhanti, ārammaṇūpanissayapakatūpanissayesu nānāvīthivasena purimatarā. Te tayopi rāsayo kusalavasena kusalapade labbhanti, kusalena pana akusale samanantarātītā na labbhanti. Teneva vuttaṃ – ‘‘akusalānaṃ dhammānaṃ kesañci upanissayapaccayena paccayo’’ti ",
      ". Idañhi – ‘‘kusalo dhammo akusalassa dhammassa upanissayapaccayena paccayo; ārammaṇūpanissayo pakatūpanissayo. Ārammaṇūpanissayo – dānaṃ datvā sīlaṃ samādiyitvā uposathakammaṃ katvā taṃ garuṃ katvā assādeti abhinandati, taṃ garuṃ katvā rāgo uppajjati, diṭṭhi uppajjati, pubbe suciṇṇāni garuṃ katvā assādeti abhinandati, taṃ garuṃ katvā rāgo uppajjati, diṭṭhi uppajjati. Jhānā vuṭṭhahitvā jhānaṃ garuṃ katvā assādeti abhinandati, taṃ garuṃ katvā rāgo uppajjati diṭṭhi uppajjati. Pakatūpanissayo – saddhaṃ upanissāya mānaṃ jappeti, diṭṭhiṃ gaṇhāti. Sīlaṃ sutaṃ cāgaṃ paññaṃ upanissāya mānaṃ jappeti, diṭṭhiṃ gaṇhāti. Saddhā sīlaṃ sutaṃ cāgo paññā rāgassa dosassa mohassa mānassa diṭṭhiyā patthanāya upanissayapaccayena paccayo’’ti imaṃ nayaṃ sandhāya vuttaṃ. Kusalena abyākate tayopi labbhanti, tathā akusalena akusale."
    ],
    "innerText": "9. Upanissayapaccayaniddese purimā purimāti anantarūpanissaye samanantarātītā labbhanti, ārammaṇūpanissayapakatūpanissayesu nānāvīthivasena purimatarā. Te tayopi rāsayo kusalavasena kusalapade labbhanti, kusalena pana akusale samanantarātītā na labbhanti. Teneva vuttaṃ – ‘‘akusalānaṃ dhammānaṃ kesañci upanissayapaccayena paccayo’’ti . Idañhi – ‘‘kusalo dhammo akusalassa dhammassa upanissayapaccayena paccayo; ārammaṇūpanissayo pakatūpanissayo. Ārammaṇūpanissayo – dānaṃ datvā sīlaṃ samādiyitvā uposathakammaṃ katvā taṃ garuṃ katvā assādeti abhinandati, taṃ garuṃ katvā rāgo uppajjati, diṭṭhi uppajjati, pubbe suciṇṇāni garuṃ katvā assādeti abhinandati, taṃ garuṃ katvā rāgo uppajjati, diṭṭhi uppajjati. Jhānā vuṭṭhahitvā jhānaṃ garuṃ katvā assādeti abhinandati, taṃ garuṃ katvā rāgo uppajjati diṭṭhi uppajjati. Pakatūpanissayo – saddhaṃ upanissāya mānaṃ jappeti, diṭṭhiṃ gaṇhāti. Sīlaṃ sutaṃ cāgaṃ paññaṃ upanissāya mānaṃ jappeti, diṭṭhiṃ gaṇhāti. Saddhā sīlaṃ sutaṃ cāgo paññā rāgassa dosassa mohassa mānassa diṭṭhiyā patthanāya upanissayapaccayena paccayo’’ti imaṃ nayaṃ sandhāya vuttaṃ. Kusalena abyākate tayopi labbhanti, tathā akusalena akusale."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Akusalena pana kusale samanantarātītā na labbhanti. Tena vuttaṃ – ‘‘kusalānaṃ dhammānaṃ kesañci upanissayapaccayena paccayo’’ti. Idampi hi – ‘‘akusalo dhammo kusalassa dhammassa upanissayapaccayena paccayo. Pakatūpanissayo – rāgaṃ upanissāya dānaṃ deti, sīlaṃ samādiyati, uposathakammaṃ karoti, jhānaṃ uppādeti vipassanaṃ uppādeti, maggaṃ uppādeti, abhiññaṃ uppādeti, samāpattiṃ uppādeti; dosaṃ mohaṃ mānaṃ diṭṭhiṃ patthanaṃ upanissāya dānaṃ deti…pe… samāpattiṃ uppādeti. Rāgo doso moho māno diṭṭhi patthanā saddhāya sīlassa sutassa cāgassa paññāya upanissayapaccayena paccayo. Pāṇaṃ hantvā tassa paṭighātatthāya dānaṃ detī’’tiādinā nayena pañhāvāre āgataṃ pakatūpanissayameva sandhāya vuttaṃ. Akusalaṃ pana kusalassa ārammaṇūpanissayo na hoti. Kasmā? Taṃ garuṃ katvā tassa appavattanatoti yathā anantarūpanissayo, evaṃ ārammaṇūpanissayopettha na labbhatīti veditabbo. Akusalena abyākatapade ārammaṇūpanissayova na labbhati. Na hi abyākatā dhammā akusalaṃ garuṃ karonti ",
      ". Yasmā pana anantaratā labbhati, tasmā ettha ‘‘kesañcī’’ti na vuttaṃ. Abyākatena pana abyākate kusale akusaleti tīsu nayesu tayopi upanissayā labbhanteva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puggalopi senāsanampī"
      },
      "ti idaṃ dvayaṃ pakatūpanissayavasena vuttaṃ. Idañhi dvayaṃ kusalākusalapavattiyā balavapaccayo hoti. Paccayabhāvo ",
      " cassa panettha pariyāyavasena veditabboti ayaṃ tāvettha pāḷivaṇṇanā."
    ],
    "innerText": "Akusalena pana kusale samanantarātītā na labbhanti. Tena vuttaṃ – ‘‘kusalānaṃ dhammānaṃ kesañci upanissayapaccayena paccayo’’ti. Idampi hi – ‘‘akusalo dhammo kusalassa dhammassa upanissayapaccayena paccayo. Pakatūpanissayo – rāgaṃ upanissāya dānaṃ deti, sīlaṃ samādiyati, uposathakammaṃ karoti, jhānaṃ uppādeti vipassanaṃ uppādeti, maggaṃ uppādeti, abhiññaṃ uppādeti, samāpattiṃ uppādeti; dosaṃ mohaṃ mānaṃ diṭṭhiṃ patthanaṃ upanissāya dānaṃ deti…pe… samāpattiṃ uppādeti. Rāgo doso moho māno diṭṭhi patthanā saddhāya sīlassa sutassa cāgassa paññāya upanissayapaccayena paccayo. Pāṇaṃ hantvā tassa paṭighātatthāya dānaṃ detī’’tiādinā nayena pañhāvāre āgataṃ pakatūpanissayameva sandhāya vuttaṃ. Akusalaṃ pana kusalassa ārammaṇūpanissayo na hoti. Kasmā? Taṃ garuṃ katvā tassa appavattanatoti yathā anantarūpanissayo, evaṃ ārammaṇūpanissayopettha na labbhatīti veditabbo. Akusalena abyākatapade ārammaṇūpanissayova na labbhati. Na hi abyākatā dhammā akusalaṃ garuṃ karonti . Yasmā pana anantaratā labbhati, tasmā ettha ‘‘kesañcī’’ti na vuttaṃ. Abyākatena pana abyākate kusale akusaleti tīsu nayesu tayopi upanissayā labbhanteva. Puggalopi senāsanampīti idaṃ dvayaṃ pakatūpanissayavasena vuttaṃ. Idañhi dvayaṃ kusalākusalapavattiyā balavapaccayo hoti. Paccayabhāvo cassa panettha pariyāyavasena veditabboti ayaṃ tāvettha pāḷivaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ pana upanissayapaccayo nāma saddhiṃ ekaccāya paññattiyā sabbepi catubhūmakadhammā. Vibhāgato pana ārammaṇūpanissayādivasena tividho hoti. Tattha ārammaṇūpanissayo ārammaṇādhipatinā ninnānākaraṇoti heṭṭhā vuttanayeneva nānappakārabhedato gahetabbo. Anantarūpanissayo anantarapaccayena ninnānākaraṇo, sopi heṭṭhā vuttanayeneva nānappakārabhedato veditabbo. Paccayuppannatopi nesaṃ tattha vuttanayeneva vinicchayo veditabbo. Pakatūpanissayo pana jātivasena kusalākusalavipākakiriyarūpabhedato pañcavidho hoti, kusalādīnaṃ pana bhūmibhedato anekavidhoti evaṃ tāvettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ bhinne panettha tebhūmakakusalo catubhūmakassāpi kusalassa akusalassa vipākakiriyassāti catunnaṃ rāsīnaṃ pakatūpanissayo hoti. Lokuttaro akusalasseva na hoti. Amhākaṃ ācariyena ‘‘lokuttaradhammo nibbattito’’ti iminā pana nayena aññesaṃ akusalassāpi hoti. Yassa vā uppajjissati, tassāpi anuttaresu vimokkhesu pihaṃ upaṭṭhāpayato iminā nayena hotiyeva. Akusalo sabbesampi catubhūmakānaṃ khandhānaṃ pakatūpanissayo hoti, tathā tebhūmakavipāko. Lokuttaravipāke heṭṭhimāni tīṇi phalāni akusalasseva na honti, upariṭṭhimaṃ kusalassāpi. Purimanayena pana aññesaṃ vā yassa vā uppajjissati, tassa santāne sabbopi lokuttaravipāko sabbesaṃ kusalādīnaṃ arūpakkhandhānaṃ pakatūpanissayo hoti. Kiriyasaṅkhātopi pakatūpanissayo catubhūmakānaṃ akusalādikhandhānaṃ hotiyeva, tathā rūpasaṅkhāto. Sayaṃ pana rūpaṃ imasmiṃ paṭṭhānamahāpakaraṇe āgatanayena upanissayapaccayaṃ na labhati, suttantikapariyāyena pana labhatīti vattuṃ vaṭṭati. Evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Upanissayapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "10. Purejātapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ". Purejātapaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purejātapaccayena paccayo"
      },
      "ti ettha purejātaṃ nāma yassa paccayo hoti, tato purimataraṃ jātaṃ jātikkhaṇaṃ atikkamitvā ṭhitikkhaṇappattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhāyatana"
      },
      "ntiādi vatthupurejātavasena vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpāyatana"
      },
      "ntiādi ārammaṇapurejātavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiñcikāle purejātapaccayenā"
      },
      "ti pavattiṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiñcikāle na purejātapaccayenā"
      },
      "ti paṭisandhiṃ sandhāya vuttaṃ. Evaṃ sabbathāpi pañcadvāre vatthārammaṇavasena, manodvāre vatthuvasenevāyaṃ pāḷi āgatā, pañhāvāre pana ‘‘ārammaṇapurejātaṃ – sekkhā vā puthujjanā vā cakkhuṃ aniccato dukkhato anattato vipassantī’’ti āgatattā manodvārepi ārammaṇapurejātaṃ labbhateva. Idha pana sāvasesavasena desanā katāti ayaṃ tāvettha pāḷivaṇṇanā."
    ],
    "innerText": "10. Purejātapaccayaniddese purejātapaccayena paccayoti ettha purejātaṃ nāma yassa paccayo hoti, tato purimataraṃ jātaṃ jātikkhaṇaṃ atikkamitvā ṭhitikkhaṇappattaṃ. Cakkhāyatanantiādi vatthupurejātavasena vuttaṃ. Rūpāyatanantiādi ārammaṇapurejātavasena. Kiñcikāle purejātapaccayenāti pavattiṃ sandhāya vuttaṃ. Kiñcikāle na purejātapaccayenāti paṭisandhiṃ sandhāya vuttaṃ. Evaṃ sabbathāpi pañcadvāre vatthārammaṇavasena, manodvāre vatthuvasenevāyaṃ pāḷi āgatā, pañhāvāre pana ‘‘ārammaṇapurejātaṃ – sekkhā vā puthujjanā vā cakkhuṃ aniccato dukkhato anattato vipassantī’’ti āgatattā manodvārepi ārammaṇapurejātaṃ labbhateva. Idha pana sāvasesavasena desanā katāti ayaṃ tāvettha pāḷivaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ pana purejātapaccayo suddharūpameva hoti. Tañca kho uppādakkhaṇaṃ atikkamitvā ṭhitippattaṃ aṭṭhārasavidhaṃ rūparūpameva. Taṃ sabbampi vatthupurejātaṃ ārammaṇapurejātanti dvidhā ṭhitaṃ. Tattha cakkhāyatanaṃ…pe… kāyāyatanaṃ vatthurūpanti idaṃ vatthupurejātaṃ nāma. Sesaṃ imāya pāḷiyā āgatañca anāgatañca vaṇṇo saddo gandho raso catasso dhātuyo tīṇi indriyāni kabaḷīkāro āhāroti dvādasavidhaṃ rūpaṃ ārammaṇapurejātapaccayo nāmāti evamettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhinne panettha cakkhāyatanaṃ dvinnaṃ cakkhuviññāṇānaṃ purejātapaccayena paccayo, tathā itarāni cattāri sotaviññāṇādīnaṃ. Vatthurūpaṃ pana ṭhapetvā dvipañcaviññāṇāni cattāro ca āruppavipāke sesānaṃ sabbesampi catubhūmakānaṃ kusalākusalābyākatānaṃ cittacetasikānaṃ purejātapaccayo hoti. Rūpādīni pana pañcārammaṇāni dvipañcaviññāṇānañceva manodhātūnañca ekanteneva purejātapaccayā honti. Aṭṭhārasavidhampi panetaṃ rūparūpaṃ kāmāvacarakusalassa rūpāvacarato abhiññākusalassa akusalassa tadārammaṇabhāvino kāmāvacaravipākassa kāmāvacarakiriyassa rūpāvacarato abhiññākiriyassāti imesaṃ channaṃ rāsīnaṃ purejātapaccayo ",
      " hotīti evamettha paccayuppannatopi viññātabbo vinicchayoti."
    ],
    "innerText": "Evaṃ bhinne panettha cakkhāyatanaṃ dvinnaṃ cakkhuviññāṇānaṃ purejātapaccayena paccayo, tathā itarāni cattāri sotaviññāṇādīnaṃ. Vatthurūpaṃ pana ṭhapetvā dvipañcaviññāṇāni cattāro ca āruppavipāke sesānaṃ sabbesampi catubhūmakānaṃ kusalākusalābyākatānaṃ cittacetasikānaṃ purejātapaccayo hoti. Rūpādīni pana pañcārammaṇāni dvipañcaviññāṇānañceva manodhātūnañca ekanteneva purejātapaccayā honti. Aṭṭhārasavidhampi panetaṃ rūparūpaṃ kāmāvacarakusalassa rūpāvacarato abhiññākusalassa akusalassa tadārammaṇabhāvino kāmāvacaravipākassa kāmāvacarakiriyassa rūpāvacarato abhiññākiriyassāti imesaṃ channaṃ rāsīnaṃ purejātapaccayo hotīti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Purejātapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "11. Pacchājātapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". Pacchājātapaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pacchājātā"
      },
      "ti yassa kāyassa paccayā honti, tasmiṃ uppajjitvā ṭhite jātā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātassā"
      },
      "ti tesaṃ uppādato paṭhamataraṃ jātassa jātikkhaṇaṃ atikkamitvā ṭhitippattassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imassa kāyassā"
      },
      "ti imassa catusamuṭṭhānikatisamuṭṭhānikabhūtaupādārūpasaṅkhātassa kāyassa. Ettha ca tisamuṭṭhānikakāyoti āhārasamuṭṭhānassa abhāvato brahmapārisajjādīnaṃ kāyo veditabbo. Ayamettha pāḷivaṇṇanā. Ayaṃ pana pacchājātapaccayo nāma saṅkhepato ṭhapetvā āruppavipāke avasesā catubhūmakā arūpakkhandhā. So jātivasena kusalākusalavipākakiriyabhedena catudhā bhijjatīti evamettha nānappakārabhedato viññātabbo vinicchayo."
    ],
    "innerText": "11. Pacchājātapaccayaniddese pacchājātāti yassa kāyassa paccayā honti, tasmiṃ uppajjitvā ṭhite jātā. Purejātassāti tesaṃ uppādato paṭhamataraṃ jātassa jātikkhaṇaṃ atikkamitvā ṭhitippattassa. Imassa kāyassāti imassa catusamuṭṭhānikatisamuṭṭhānikabhūtaupādārūpasaṅkhātassa kāyassa. Ettha ca tisamuṭṭhānikakāyoti āhārasamuṭṭhānassa abhāvato brahmapārisajjādīnaṃ kāyo veditabbo. Ayamettha pāḷivaṇṇanā. Ayaṃ pana pacchājātapaccayo nāma saṅkhepato ṭhapetvā āruppavipāke avasesā catubhūmakā arūpakkhandhā. So jātivasena kusalākusalavipākakiriyabhedena catudhā bhijjatīti evamettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ bhinne panettha pañcavokārabhave uppannaṃ catubhūmakakusalañca akusalañca uppādakkhaṇaṃ atikkamitvā ṭhitippattassa catusamuṭṭhānikatisamuṭṭhānikarūpakāyassa pacchājātapaccayo hoti. Vipākepi ṭhapetvā paṭisandhivipākaṃ avaseso kāmāvacararūpāvacaravipāko tasseva ekantena pacchājātapaccayo hoti. Lokuttaropi pañcavokāre uppannavipāko tasseva pacchājātapaccayo hoti. Tebhūmakakiriyāpi pañcavokāre uppannāva vuttappakārassa kāyassa pacchājātapaccayo hotīti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pacchājātapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "12. Āsevanapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ". Āsevanapaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purimā purimā"
      },
      "ti sabbanayesu samanantarātītāva daṭṭhabbā. Kasmā panettha anantarapaccaye viya ‘‘purimā purimā kusalā ",
      " dhammā pacchimānaṃ pacchimānaṃ abyākatānaṃ dhammāna’’ntiādinā nayena bhinnajātikehi saddhiṃ niddeso na katoti? Attano gatiṃ gāhāpetuṃ asamatthatāya. Bhinnajātikā hi bhinnajātikānaṃ arūpadhammānaṃ āsevanaguṇena paguṇabalavabhāvaṃ ",
      " sādhayamānā attano kusalādibhāvasaṅkhātaṃ gatiṃ gāhāpetuṃ na sakkonti. Tasmā tehi saddhiṃ niddesaṃ akatvā ye yesaṃ vāsanāsaṅkhātena āsevanena paguṇatarabalavatarabhāvavisiṭṭhaṃ attano kusalādibhāvasaṅkhātaṃ gatiṃ gāhāpetuṃ sakkonti, tesaṃ tehi samānajātikeheva saddhiṃ niddeso katoti veditabbo. Atha vipākābyākataṃ kasmā na gahitanti? Āsevanābhāvena. Vipākañhi kammavasena vipākabhāvappattaṃ kammapariṇāmitaṃ hutvā vattati nirussāhaṃ dubbalanti taṃ āsevanaguṇena attano sabhāvaṃ gāhāpetvā paribhāvetvā neva aññaṃ vipākaṃ uppādetuṃ sakkoti, na purimavipākānubhāvaṃ gahetvā uppajjitunti. Kammavegakkhittaṃ pana patitaṃ viya hutvā uppajjatīti sabbathāpi vipāke āsevanaṃ natthīti āsevanābhāvena vipākaṃ na gahitaṃ. Kusalākusalakiriyānantaraṃ uppajjamānampi cetaṃ kammapaṭibaddhavuttitāya āsevanaguṇaṃ na gaṇhātīti kusalādayopissa āsevanapaccayā na honti. Apica nānājātikattāpete na hontiyeva. Bhūmito pana ārammaṇato vā nānājātikattaṃ nāma natthi. Tasmā kāmāvacarakusalakiriyāmahaggatakusalakiriyānampi, saṅkhārārammaṇañca anulomakusalaṃ nibbānārammaṇassa gotrabhukusalassa āsevanapaccayo hotiyevāti ayaṃ tāvettha pāḷivaṇṇanā. Ayaṃ pana āsevanapaccayo jātito tāva kusalo akusalo kiriyābyākatoti tidhā ṭhito. Tattha kusalo bhūmito kāmāvacaro rūpāvacaro arūpāvacaroti tividho hoti, akusalo kāmāvacarova kiriyābyākato kāmāvacaro rūpāvacaro arūpāvacaroti tividhova, lokuttaro āsevanapaccayo nāma natthīti evamettha nānappakārabhedato viññātabbo vinicchayo."
    ],
    "innerText": "12. Āsevanapaccayaniddese purimā purimāti sabbanayesu samanantarātītāva daṭṭhabbā. Kasmā panettha anantarapaccaye viya ‘‘purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ abyākatānaṃ dhammāna’’ntiādinā nayena bhinnajātikehi saddhiṃ niddeso na katoti? Attano gatiṃ gāhāpetuṃ asamatthatāya. Bhinnajātikā hi bhinnajātikānaṃ arūpadhammānaṃ āsevanaguṇena paguṇabalavabhāvaṃ sādhayamānā attano kusalādibhāvasaṅkhātaṃ gatiṃ gāhāpetuṃ na sakkonti. Tasmā tehi saddhiṃ niddesaṃ akatvā ye yesaṃ vāsanāsaṅkhātena āsevanena paguṇatarabalavatarabhāvavisiṭṭhaṃ attano kusalādibhāvasaṅkhātaṃ gatiṃ gāhāpetuṃ sakkonti, tesaṃ tehi samānajātikeheva saddhiṃ niddeso katoti veditabbo. Atha vipākābyākataṃ kasmā na gahitanti? Āsevanābhāvena. Vipākañhi kammavasena vipākabhāvappattaṃ kammapariṇāmitaṃ hutvā vattati nirussāhaṃ dubbalanti taṃ āsevanaguṇena attano sabhāvaṃ gāhāpetvā paribhāvetvā neva aññaṃ vipākaṃ uppādetuṃ sakkoti, na purimavipākānubhāvaṃ gahetvā uppajjitunti. Kammavegakkhittaṃ pana patitaṃ viya hutvā uppajjatīti sabbathāpi vipāke āsevanaṃ natthīti āsevanābhāvena vipākaṃ na gahitaṃ. Kusalākusalakiriyānantaraṃ uppajjamānampi cetaṃ kammapaṭibaddhavuttitāya āsevanaguṇaṃ na gaṇhātīti kusalādayopissa āsevanapaccayā na honti. Apica nānājātikattāpete na hontiyeva. Bhūmito pana ārammaṇato vā nānājātikattaṃ nāma natthi. Tasmā kāmāvacarakusalakiriyāmahaggatakusalakiriyānampi, saṅkhārārammaṇañca anulomakusalaṃ nibbānārammaṇassa gotrabhukusalassa āsevanapaccayo hotiyevāti ayaṃ tāvettha pāḷivaṇṇanā. Ayaṃ pana āsevanapaccayo jātito tāva kusalo akusalo kiriyābyākatoti tidhā ṭhito. Tattha kusalo bhūmito kāmāvacaro rūpāvacaro arūpāvacaroti tividho hoti, akusalo kāmāvacarova kiriyābyākato kāmāvacaro rūpāvacaro arūpāvacaroti tividhova, lokuttaro āsevanapaccayo nāma natthīti evamettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhinne panettha kāmāvacarakusalaṃ attano anantarassa kāmāvacarakusalasseva. Yaṃ panettha ñāṇasampayuttaṃ, taṃ attanā sadisavedanassa rūpāvacarakusalassa arūpāvacarakusalassa lokuttarakusalassāti imesaṃ ",
      " rāsīnaṃ āsevanapaccayo hoti. Rūpāvacarakusalaṃ pana rūpāvacarakusalasseva. Arūpāvacarakusalaṃ arūpāvacarakusalasseva. Akusalaṃ pana akusalasseva āsevanapaccayo hoti. Kiriyato pana kāmāvacarakiriyasaṅkhāto tāva kāmāvacarakiriyasseva. Yo panettha ñāṇasampayutto, so attanā sadisavedanassa rūpāvacarakiriyassa arūpāvacarakiriyassāti imesaṃ rāsīnaṃ āsevanapaccayo hoti. Rūpāvacarakiriyasaṅkhāto pana rūpāvacarakiriyasseva, arūpāvacarakiriyasaṅkhāto arūpāvacarakiriyasseva āsevanapaccayo hoti. Vipāko pana ekadhammassāpi ekadhammopi vā koci ",
      " vipākassa āsevanapaccayo natthīti evamettha paccayuppannatopi viññātabbo vinicchayoti."
    ],
    "innerText": "Evaṃ bhinne panettha kāmāvacarakusalaṃ attano anantarassa kāmāvacarakusalasseva. Yaṃ panettha ñāṇasampayuttaṃ, taṃ attanā sadisavedanassa rūpāvacarakusalassa arūpāvacarakusalassa lokuttarakusalassāti imesaṃ rāsīnaṃ āsevanapaccayo hoti. Rūpāvacarakusalaṃ pana rūpāvacarakusalasseva. Arūpāvacarakusalaṃ arūpāvacarakusalasseva. Akusalaṃ pana akusalasseva āsevanapaccayo hoti. Kiriyato pana kāmāvacarakiriyasaṅkhāto tāva kāmāvacarakiriyasseva. Yo panettha ñāṇasampayutto, so attanā sadisavedanassa rūpāvacarakiriyassa arūpāvacarakiriyassāti imesaṃ rāsīnaṃ āsevanapaccayo hoti. Rūpāvacarakiriyasaṅkhāto pana rūpāvacarakiriyasseva, arūpāvacarakiriyasaṅkhāto arūpāvacarakiriyasseva āsevanapaccayo hoti. Vipāko pana ekadhammassāpi ekadhammopi vā koci vipākassa āsevanapaccayo natthīti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Āsevanapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "13. Kammapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". Kammapaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kamma"
      },
      "nti cetanākammameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṭattā ca rūpāna"
      },
      "nti kammassa kaṭattā uppannarūpānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammapaccayenā"
      },
      "ti anekānampi kappakoṭīnaṃ matthake attano phalaṃ uppādetuṃ samatthena nānākkhaṇikakammapaccayenāti attho. Kusalākusalañhi kammaṃ attano pavattikkhaṇe phalaṃ na deti. Yadi dadeyya, yaṃ manusso devalokūpagaṃ kusalakammaṃ karoti, tassānubhāvena tasmiṃyeva khaṇe devo bhaveyya. Yasmiṃ pana khaṇe taṃ kataṃ, tato aññasmiṃ khaṇe avijjamānampi kevalaṃ kaṭattāyeva diṭṭheva dhamme upapajje vā apare vā pariyāye avasesapaccayasamāyoge sati phalaṃ uppādeti niruddhāpi purimasippādikiriyā viya kālantare pacchimasippādikiriyāya. Tasmā nānākkhaṇikakammapaccayoti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cetanā sampayuttakānaṃ dhammāna"
      },
      "nti yā kāci cetanā attanā sampayuttakānaṃ dhammānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃsamuṭṭhānāna"
      },
      "nti iminā paṭisandhikkhaṇe kaṭattārūpampi gaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammapaccayenā"
      },
      "ti idaṃ sahajātacetanaṃ sandhāya vuttaṃ. Kusalādīsu hi yā kāci sahajātacetanā sesadhammānaṃ cittapayogasaṅkhātena kiriyābhāvena ",
      " upakārikā hoti. Tasmā sahajātakammapaccayoti vuccati. Ayaṃ tāvettha pāḷivaṇṇanā."
    ],
    "innerText": "13. Kammapaccayaniddese kammanti cetanākammameva. Kaṭattā ca rūpānanti kammassa kaṭattā uppannarūpānaṃ. Kammapaccayenāti anekānampi kappakoṭīnaṃ matthake attano phalaṃ uppādetuṃ samatthena nānākkhaṇikakammapaccayenāti attho. Kusalākusalañhi kammaṃ attano pavattikkhaṇe phalaṃ na deti. Yadi dadeyya, yaṃ manusso devalokūpagaṃ kusalakammaṃ karoti, tassānubhāvena tasmiṃyeva khaṇe devo bhaveyya. Yasmiṃ pana khaṇe taṃ kataṃ, tato aññasmiṃ khaṇe avijjamānampi kevalaṃ kaṭattāyeva diṭṭheva dhamme upapajje vā apare vā pariyāye avasesapaccayasamāyoge sati phalaṃ uppādeti niruddhāpi purimasippādikiriyā viya kālantare pacchimasippādikiriyāya. Tasmā nānākkhaṇikakammapaccayoti vuccati. Cetanā sampayuttakānaṃ dhammānanti yā kāci cetanā attanā sampayuttakānaṃ dhammānaṃ. Taṃsamuṭṭhānānanti iminā paṭisandhikkhaṇe kaṭattārūpampi gaṇhāti. Kammapaccayenāti idaṃ sahajātacetanaṃ sandhāya vuttaṃ. Kusalādīsu hi yā kāci sahajātacetanā sesadhammānaṃ cittapayogasaṅkhātena kiriyābhāvena upakārikā hoti. Tasmā sahajātakammapaccayoti vuccati. Ayaṃ tāvettha pāḷivaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ pana kammapaccayo atthato catubhūmikacetanāmattameva. So hi jātibhedato kusalo akusalo vipāko kiriyāti catudhā bhijjati. Tattha kusalo bhūmito kāmāvacarādivasena catudhā bhijjati. Akusalo ekadhāva vipāko catudhā, kiriyā tidhāvāti evamettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhinne panettha sahajātā kāmāvacarakusalacetanā pañcavokāre attanā sampayuttadhammānañceva ",
      " cittasamuṭṭhānarūpassa ca, catuvokāre sampayuttakkhandhānaññeva sahajātakammapaccayo hoti. Uppajjitvā niruddhā pana attano vipākānaṃ khandhānaṃ kaṭattā ca rūpānaṃ nānākkhaṇikakammapaccayena paccayo hoti. Sā ca kho pañcavokāreyeva, na aññattha. Sahajātā rūpāvacarakusalacetanā attanā sampayuttadhammānañceva cittasamuṭṭhānarūpānañca ekanteneva sahajātakammapaccayena paccayo. Uppajjitvā niruddhā pana attano vipākānañceva kaṭattārūpānañca nānākkhaṇikakammapaccayena paccayo. Arūpāvacarā pana lokuttarā ca sahajātā kusalacetanā pañcavokāre attanā sampayuttadhammānañceva cittasamuṭṭhānarūpānañca, catuvokāre sampayuttakkhandhānaññeva sahajātakammapaccayena paccayo. Uppajjitvā niruddhā panesā duvidhāpi attano attano vipākakkhandhānaññeva nānākkhaṇikakammapaccayena paccayo. Sahajātā akusalacetanā pañcavokāre attanā sampayuttakkhandhānañceva cittasamuṭṭhānarūpānañca catuvokāre arūpakkhandhānaññeva sahajātakammapaccayena paccayo. Uppajjitvā niruddhā pana vipākakkhandhānañceva kaṭattārūpānañca nānākkhaṇikakammapaccayena paccayo."
    ],
    "innerText": "Evaṃ bhinne panettha sahajātā kāmāvacarakusalacetanā pañcavokāre attanā sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca, catuvokāre sampayuttakkhandhānaññeva sahajātakammapaccayo hoti. Uppajjitvā niruddhā pana attano vipākānaṃ khandhānaṃ kaṭattā ca rūpānaṃ nānākkhaṇikakammapaccayena paccayo hoti. Sā ca kho pañcavokāreyeva, na aññattha. Sahajātā rūpāvacarakusalacetanā attanā sampayuttadhammānañceva cittasamuṭṭhānarūpānañca ekanteneva sahajātakammapaccayena paccayo. Uppajjitvā niruddhā pana attano vipākānañceva kaṭattārūpānañca nānākkhaṇikakammapaccayena paccayo. Arūpāvacarā pana lokuttarā ca sahajātā kusalacetanā pañcavokāre attanā sampayuttadhammānañceva cittasamuṭṭhānarūpānañca, catuvokāre sampayuttakkhandhānaññeva sahajātakammapaccayena paccayo. Uppajjitvā niruddhā panesā duvidhāpi attano attano vipākakkhandhānaññeva nānākkhaṇikakammapaccayena paccayo. Sahajātā akusalacetanā pañcavokāre attanā sampayuttakkhandhānañceva cittasamuṭṭhānarūpānañca catuvokāre arūpakkhandhānaññeva sahajātakammapaccayena paccayo. Uppajjitvā niruddhā pana vipākakkhandhānañceva kaṭattārūpānañca nānākkhaṇikakammapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kāmāvacararūpāvacarato vipākacetanā attanā sampayuttadhammānaṃ pavatte cittasamuṭṭhānarūpānaṃ, paṭisandhiyaṃ kaṭattārūpānañca sahajātakammapaccayena paccayo. Arūpāvacaravipākacetanā attanā sampayuttadhammānaññeva sahajātakammapaccayena paccayo. Lokuttaravipākacetanā pañcavokāre attanā sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca, catuvokāre arūpasseva sahajātakammapaccayena paccayo. Tebhūmikā kiriyacetanā pañcavokāre ",
      " sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca sahajātakammapaccayena paccayo. Yā panettha āruppe uppajjati, sā arūpadhammānaññeva sahajātakammapaccayena paccayoti evamettha paccayuppannatopi viññātabbo vinicchayoti."
    ],
    "innerText": "Kāmāvacararūpāvacarato vipākacetanā attanā sampayuttadhammānaṃ pavatte cittasamuṭṭhānarūpānaṃ, paṭisandhiyaṃ kaṭattārūpānañca sahajātakammapaccayena paccayo. Arūpāvacaravipākacetanā attanā sampayuttadhammānaññeva sahajātakammapaccayena paccayo. Lokuttaravipākacetanā pañcavokāre attanā sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca, catuvokāre arūpasseva sahajātakammapaccayena paccayo. Tebhūmikā kiriyacetanā pañcavokāre sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca sahajātakammapaccayena paccayo. Yā panettha āruppe uppajjati, sā arūpadhammānaññeva sahajātakammapaccayena paccayoti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kammapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "14. Vipākapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Vipākapaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipākā cattāro khandhā"
      },
      "ti yasmā kammasamuṭṭhānāpi rūpā vipākā na honti, tasmā ‘‘vipākā’’ti vatvā ‘‘cattāro khandhā’’ti vuttaṃ. Evaṃ ayaṃ pāḷi arūpadhammānaññeva vipākapaccayavasena āgatā. Pañhāvāre pana ‘‘vipākābyākato eko khandho tiṇṇaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ vipākapaccayena paccayo. Paṭisandhikkhaṇe vipākābyākato eko khandho tiṇṇannaṃ khandhānaṃ kaṭattā ca rūpānaṃ vipākapaccayena paccayo’’ti āgatattā cittasamuṭṭhānakammasamuṭṭhānarūpānampi vipākapaccayo labbhati. Idha pana sāvasesavasena desanā katāti ayaṃ tāvettha pāḷivaṇṇanā. Ayaṃ pana vipākapaccayo vipākabhāvena jātito ekavidho, bhūmibhedato kāmāvacarādivasena catudhā bhijjatīti evamettha nānappakārabhedato viññātabbo vinicchayo."
    ],
    "innerText": "14. Vipākapaccayaniddese vipākā cattāro khandhāti yasmā kammasamuṭṭhānāpi rūpā vipākā na honti, tasmā ‘‘vipākā’’ti vatvā ‘‘cattāro khandhā’’ti vuttaṃ. Evaṃ ayaṃ pāḷi arūpadhammānaññeva vipākapaccayavasena āgatā. Pañhāvāre pana ‘‘vipākābyākato eko khandho tiṇṇaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ vipākapaccayena paccayo. Paṭisandhikkhaṇe vipākābyākato eko khandho tiṇṇannaṃ khandhānaṃ kaṭattā ca rūpānaṃ vipākapaccayena paccayo’’ti āgatattā cittasamuṭṭhānakammasamuṭṭhānarūpānampi vipākapaccayo labbhati. Idha pana sāvasesavasena desanā katāti ayaṃ tāvettha pāḷivaṇṇanā. Ayaṃ pana vipākapaccayo vipākabhāvena jātito ekavidho, bhūmibhedato kāmāvacarādivasena catudhā bhijjatīti evamettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ bhinne panettha kāmāvacararūpāvacaravipāko attanā sampayuttadhammānaṃ pavatte cittasamuṭṭhānarūpānaṃ paṭisandhiyaṃ kaṭattārūpānañca vipākapaccayo hoti. Arūpāvacaravipāko sampayuttadhammānaññeva. Lokuttaravipāko pañcavokāre sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca, catuvokāre sampayuttakkhandhānaññeva vipākapaccayo hotīti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vipākapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "15. Āhārapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". Āhārapaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kabaḷīkāro āhāro"
      },
      "ti catusantatisamuṭṭhāne rūpe ojā āhāro nāma. So pana yasmā kabaḷaṃ karitvā ajjhoharitova āhārakiccaṃ karoti, na bahi ṭhito, tasmā āhāroti avatvā ‘‘kabaḷīkāro āhāro’’ti vuttaṃ. Kabaḷaṃ karitvā ajjhoharitabbavatthukattā vā kabaḷīkāroti nāmametaṃ tassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arūpino āhārā"
      },
      "ti phassacetanāviññāṇāhārā ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃsamuṭṭhānāna"
      },
      "nti idhāpi kammasamuṭṭhānāni gahitāneva. Vuttañhetaṃ pañhāvāre – paṭisandhikkhaṇe vipākābyākatā āhārā sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpānaṃ āhārapaccayena paccayoti. Ayaṃ tāvettha pāḷivaṇṇanā."
    ],
    "innerText": "15. Āhārapaccayaniddese kabaḷīkāro āhāroti catusantatisamuṭṭhāne rūpe ojā āhāro nāma. So pana yasmā kabaḷaṃ karitvā ajjhoharitova āhārakiccaṃ karoti, na bahi ṭhito, tasmā āhāroti avatvā ‘‘kabaḷīkāro āhāro’’ti vuttaṃ. Kabaḷaṃ karitvā ajjhoharitabbavatthukattā vā kabaḷīkāroti nāmametaṃ tassa. Arūpino āhārāti phassacetanāviññāṇāhārā . Taṃsamuṭṭhānānanti idhāpi kammasamuṭṭhānāni gahitāneva. Vuttañhetaṃ pañhāvāre – paṭisandhikkhaṇe vipākābyākatā āhārā sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpānaṃ āhārapaccayena paccayoti. Ayaṃ tāvettha pāḷivaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ pana āhārapaccayo saṅkhepato kabaḷīkāro āhāro, phasso, cetanā, viññāṇanti cattārova dhammā honti. Tattha ṭhapetvā kabaḷīkārāhāraṃ sesā tayo arūpāhārā jātivasena kusalākusalavipākakiriyabhedato catudhā bhijjanti. Puna bhūmibhedena kusalo catudhā, akusalo ekadhā, vipāko catudhā, kiriyā tidhāti evaṃ anekadhā bhijjanti. Kabaḷīkārāhāro pana jātito abyākato, bhūmito kāmāvacarovāti evamettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhinne panettha catubhūmakāpi tayo kusalāhārā pañcavokāre attanā sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca āhārapaccayena paccayo, ṭhapetvā pana rūpāvacaraṃ avasesā āruppe sampayuttadhammānaññeva āhārapaccayena paccayo. Akusalāhāresupi eseva nayo. Catubhūmakavipākāhārā pana sabbattha sampayuttakānaṃ āhārapaccayā honti. Kāmāvacararūpāvacaravipākā panettha pañcavokāre uppajjamānā pavatte cittasamuṭṭhānarūpassa paṭisandhiyaṃ kaṭattārūpassāpi āhārapaccayā honti. Lokuttarā pana cittasamuṭṭhānarūpasseva, āruppe uppannā rūpassa paccayā na honti. Tebhūmakāpi tayo kiriyāhārā pañcavokāre sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca, kāmāvacarārūpāvacarā pana āruppe sampayuttadhammānaññeva āhārapaccayena paccayo ",
      ". Catusantatisamuṭṭhāno kabaḷīkārāhāro kiñcāpi ‘‘imassa kāyassā’’ti avisesato vutto, visesato panāyamettha āhārasamuṭṭhānarūpassa janako ceva anupālako ca hutvā āhārapaccayena paccayo hoti, sesatisantatisamuṭṭhānassa anupālakova hutvā āhārapaccayena paccayo hotīti evamettha paccayuppannatopi viññātabbo vinicchayoti."
    ],
    "innerText": "Evaṃ bhinne panettha catubhūmakāpi tayo kusalāhārā pañcavokāre attanā sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca āhārapaccayena paccayo, ṭhapetvā pana rūpāvacaraṃ avasesā āruppe sampayuttadhammānaññeva āhārapaccayena paccayo. Akusalāhāresupi eseva nayo. Catubhūmakavipākāhārā pana sabbattha sampayuttakānaṃ āhārapaccayā honti. Kāmāvacararūpāvacaravipākā panettha pañcavokāre uppajjamānā pavatte cittasamuṭṭhānarūpassa paṭisandhiyaṃ kaṭattārūpassāpi āhārapaccayā honti. Lokuttarā pana cittasamuṭṭhānarūpasseva, āruppe uppannā rūpassa paccayā na honti. Tebhūmakāpi tayo kiriyāhārā pañcavokāre sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca, kāmāvacarārūpāvacarā pana āruppe sampayuttadhammānaññeva āhārapaccayena paccayo . Catusantatisamuṭṭhāno kabaḷīkārāhāro kiñcāpi ‘‘imassa kāyassā’’ti avisesato vutto, visesato panāyamettha āhārasamuṭṭhānarūpassa janako ceva anupālako ca hutvā āhārapaccayena paccayo hoti, sesatisantatisamuṭṭhānassa anupālakova hutvā āhārapaccayena paccayo hotīti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Āhārapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "16. Indriyapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". Indriyapaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhundriya"
      },
      "nti cakkhusaṅkhātaṃ indriyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Indriyapaccayenā"
      },
      "ti sayaṃ purejāto hutvā arūpadhammānaṃ uppādato paṭṭhāya yāva bhaṅgā indriyapaccayena paccayo hoti. Sotindriyādīsupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arūpino indriyā"
      },
      "ti ettha arūpajīvitindriyampi saṅgahitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃsamuṭṭhānāna"
      },
      "nti ettha heṭṭhā vuttanayeneva kaṭattārūpampi saṅgahitaṃ. Vuttañhetaṃ pañhāvāre – paṭisandhikkhaṇe vipākābyākatā indriyā sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpānaṃ indriyapaccayena paccayoti. Evaṃ tāvettha pāḷivaṇṇanā veditabbā."
    ],
    "innerText": "16. Indriyapaccayaniddese cakkhundriyanti cakkhusaṅkhātaṃ indriyaṃ. Indriyapaccayenāti sayaṃ purejāto hutvā arūpadhammānaṃ uppādato paṭṭhāya yāva bhaṅgā indriyapaccayena paccayo hoti. Sotindriyādīsupi eseva nayo. Arūpino indriyāti ettha arūpajīvitindriyampi saṅgahitaṃ. Taṃsamuṭṭhānānanti ettha heṭṭhā vuttanayeneva kaṭattārūpampi saṅgahitaṃ. Vuttañhetaṃ pañhāvāre – paṭisandhikkhaṇe vipākābyākatā indriyā sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpānaṃ indriyapaccayena paccayoti. Evaṃ tāvettha pāḷivaṇṇanā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ pana indriyapaccayo itthindriyapurisindriyavajjānaṃ samavīsatiyā indriyānaṃ vasena ṭhito. Itthindriyapurisindriyāni hi kiñcāpi itthiliṅgapurisaliṅgādīnaṃ bījabhūtāni, kalalādikāle pana vijjamānesupi tesu itthiliṅgapurisaliṅgādīnaṃ abhāvā tāni neva tesaṃ, na aññesaṃ indriyapaccayataṃ pharanti. Indriyapaccayo hi attano vijjamānakkhaṇe avinibbhuttadhammānaṃ indriyapaccayataṃ apharanto nāma natthi, tasmā tāni indriyapaccayā na honti. Yesaṃ panetāni bījabhūtāni, tesaṃ tāni suttantikapariyāyena pakatūpanissayabhāvaṃ bhajanti. Iti indriyapaccayo samavīsatiyā indriyānaṃ vasena ṭhitoti veditabbo. So jātito kusalākusalavipākakiriyarūpavasena pañcadhā bhijjati. Tattha kusalo bhūmivasena catudhā, akusalo kāmāvacarova vipāko catudhāva kiriyāsaṅkhāto tidhā, rūpaṃ kāmāvacaramevāti evaṃ anekadhā bhijjatīti evaṃ tāvettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " bhinne panettha catubhūmakopi kusalindriyapaccayo pañcavokāre sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca indriyapaccayena paccayo, tathā akusalo. Ṭhapetvā pana rūpāvacarakusalaṃ avasesā kusalākusalā āruppe sampayuttadhammānaññeva indriyapaccayena paccayo. Catubhūmako vipākindriyapaccayo ekanteneva sampayuttakānaṃ indriyapaccayena paccayo. Kāmāvacararūpāvacarā panettha pañcavokāre uppajjanato pavatte cittasamuṭṭhānarūpassa, paṭisandhiyaṃ kaṭattārūpassāpi indriyapaccayena paccayā honti. Lokuttarā cittasamuṭṭhānarūpasseva. Āruppe uppannā lokuttaravipākā indriyā rūpassa paccayā na honti. Tebhūmakā kiriyindriyā pañcavokāre sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca, kāmāvacarārūpāvacarā pana āruppe sampayuttadhammānaññeva ",
      " indriyapaccayataṃ pharanti. Cakkhundriyādivasena chabbidhe rūpindriye cakkhundriyaṃ kusalākusalavipākato sampayuttadhammānaṃ dvinnaṃ cakkhuviññāṇānaṃ, sotindriyādīni tathāvidhānaññeva sotaviññāṇādīnaṃ, rūpajīvitindriyaṃ attanā sahajātarūpānaṃ ṭhitikkhaṇe indriyapaccayena paccayo. Sahajātapaccayatā pana tassa natthīti evamettha paccayuppannatopi viññātabbo vinicchayoti."
    ],
    "innerText": "Evaṃ bhinne panettha catubhūmakopi kusalindriyapaccayo pañcavokāre sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca indriyapaccayena paccayo, tathā akusalo. Ṭhapetvā pana rūpāvacarakusalaṃ avasesā kusalākusalā āruppe sampayuttadhammānaññeva indriyapaccayena paccayo. Catubhūmako vipākindriyapaccayo ekanteneva sampayuttakānaṃ indriyapaccayena paccayo. Kāmāvacararūpāvacarā panettha pañcavokāre uppajjanato pavatte cittasamuṭṭhānarūpassa, paṭisandhiyaṃ kaṭattārūpassāpi indriyapaccayena paccayā honti. Lokuttarā cittasamuṭṭhānarūpasseva. Āruppe uppannā lokuttaravipākā indriyā rūpassa paccayā na honti. Tebhūmakā kiriyindriyā pañcavokāre sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca, kāmāvacarārūpāvacarā pana āruppe sampayuttadhammānaññeva indriyapaccayataṃ pharanti. Cakkhundriyādivasena chabbidhe rūpindriye cakkhundriyaṃ kusalākusalavipākato sampayuttadhammānaṃ dvinnaṃ cakkhuviññāṇānaṃ, sotindriyādīni tathāvidhānaññeva sotaviññāṇādīnaṃ, rūpajīvitindriyaṃ attanā sahajātarūpānaṃ ṭhitikkhaṇe indriyapaccayena paccayo. Sahajātapaccayatā pana tassa natthīti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Indriyapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "17. Jhānapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ". Jhānapaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānaṅgānī"
      },
      "ti dvipañcaviññāṇavajjesu sesacittesu uppannāni vitakkavicārapītisomanassadomanassupekkhācittekaggatāsaṅkhātāni satta aṅgāni. Pañcannaṃ pana viññāṇakāyānaṃ abhinipātamattattā tesu vijjamānānipi upekkhāsukhadukkhāni upanijjhānākārassa abhāvato jhānaṅgānīti na uddhaṭāni. Tattha pacchinnattā pana sesāhetukesupi jhānaṅgaṃ na uddhaṭameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃsamuṭṭhānāna"
      },
      "nti idhāpi kaṭattārūpaṃ saṅgahitanti veditabbaṃ. Vuttañhetaṃ pañhāvāre – ‘‘paṭisandhikkhaṇe vipākābyākatāni jhānaṅgāni sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpānaṃ jhānapaccayena ",
      " paccayo’’ti. Ayaṃ tāvettha pāḷivaṇṇanā. Ayaṃ pana jhānapaccayo sattannaṃ jhānaṅgānaṃ vasena ṭhitopi jātibhedato kusalākusalavipākakiriyavasena catudhā bhijjati, puna bhūmivasena catudhā; ekadhā, catudhā, tidhāti dvādasadhā bhijjatīti evamettha nānappakārabhedato viññātabbo vinicchayo."
    ],
    "innerText": "17. Jhānapaccayaniddese jhānaṅgānīti dvipañcaviññāṇavajjesu sesacittesu uppannāni vitakkavicārapītisomanassadomanassupekkhācittekaggatāsaṅkhātāni satta aṅgāni. Pañcannaṃ pana viññāṇakāyānaṃ abhinipātamattattā tesu vijjamānānipi upekkhāsukhadukkhāni upanijjhānākārassa abhāvato jhānaṅgānīti na uddhaṭāni. Tattha pacchinnattā pana sesāhetukesupi jhānaṅgaṃ na uddhaṭameva. Taṃsamuṭṭhānānanti idhāpi kaṭattārūpaṃ saṅgahitanti veditabbaṃ. Vuttañhetaṃ pañhāvāre – ‘‘paṭisandhikkhaṇe vipākābyākatāni jhānaṅgāni sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpānaṃ jhānapaccayena paccayo’’ti. Ayaṃ tāvettha pāḷivaṇṇanā. Ayaṃ pana jhānapaccayo sattannaṃ jhānaṅgānaṃ vasena ṭhitopi jātibhedato kusalākusalavipākakiriyavasena catudhā bhijjati, puna bhūmivasena catudhā; ekadhā, catudhā, tidhāti dvādasadhā bhijjatīti evamettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhinne panettha catubhūmakampi kusalajhānaṅgaṃ pañcavokāre sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca, ṭhapetvā rūpāvacaraṃ avasesaṃ āruppe sampayuttadhammānaññeva jhānapaccayena paccayo. Akusalepi eseva nayo. Kāmāvacararūpāvacaravipākaṃ pavatte sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca, paṭisandhiyaṃ sampayuttadhammānañceva kaṭattārūpassa ca, āruppavipākaṃ sampayuttadhammānaññeva, yañca āruppe lokuttaravipākaṃ uppajjati, tañca. Pañcavokāre pana taṃ cittasamuṭṭhānarūpassapi jhānapaccayena paccayo hoti. Tebhūmakampi kiriyajhānaṅgaṃ ",
      " pañcavokāre sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca. Yaṃ panettha āruppe uppajjati, taṃ sampayuttadhammānaññeva jhānapaccayena paccayoti evamettha paccayuppannatopi viññātabbo vinicchayoti."
    ],
    "innerText": "Evaṃ bhinne panettha catubhūmakampi kusalajhānaṅgaṃ pañcavokāre sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca, ṭhapetvā rūpāvacaraṃ avasesaṃ āruppe sampayuttadhammānaññeva jhānapaccayena paccayo. Akusalepi eseva nayo. Kāmāvacararūpāvacaravipākaṃ pavatte sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca, paṭisandhiyaṃ sampayuttadhammānañceva kaṭattārūpassa ca, āruppavipākaṃ sampayuttadhammānaññeva, yañca āruppe lokuttaravipākaṃ uppajjati, tañca. Pañcavokāre pana taṃ cittasamuṭṭhānarūpassapi jhānapaccayena paccayo hoti. Tebhūmakampi kiriyajhānaṅgaṃ pañcavokāre sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca. Yaṃ panettha āruppe uppajjati, taṃ sampayuttadhammānaññeva jhānapaccayena paccayoti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Jhānapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "18. Maggapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". Maggapaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "maggaṅgānī"
      },
      "ti ahetukacittuppādavajjesu sesacittesu uppannāni paññā, vitakko, sammāvācākammantājīvā, vīriyaṃ, sati, samādhi, micchādiṭṭhi, micchāvācākammantājīvāti imāni dvādasaṅgāni. Maggassa pana hetupacchimakattā ahetukacittesu maggaṅgāni na uddhaṭāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃsamuṭṭhānāna"
      },
      "nti idhāpi kaṭattārūpaṃ saṅgahitameva. Vuttañhetaṃ pañhāvāre – ‘‘paṭisandhikkhaṇe vipākābyākatāni maggaṅgāni sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpānaṃ maggapaccayena paccayo’’ti. Ayaṃ tāvettha pāḷivaṇṇanā."
    ],
    "innerText": "18. Maggapaccayaniddese maggaṅgānīti ahetukacittuppādavajjesu sesacittesu uppannāni paññā, vitakko, sammāvācākammantājīvā, vīriyaṃ, sati, samādhi, micchādiṭṭhi, micchāvācākammantājīvāti imāni dvādasaṅgāni. Maggassa pana hetupacchimakattā ahetukacittesu maggaṅgāni na uddhaṭāni. Taṃsamuṭṭhānānanti idhāpi kaṭattārūpaṃ saṅgahitameva. Vuttañhetaṃ pañhāvāre – ‘‘paṭisandhikkhaṇe vipākābyākatāni maggaṅgāni sampayuttakānaṃ khandhānaṃ kaṭattā ca rūpānaṃ maggapaccayena paccayo’’ti. Ayaṃ tāvettha pāḷivaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayaṃ pana maggapaccayo dvādasannaṃ maggaṅgānaṃ vasena ṭhitopi jātibhedato kusalādivasena catudhā, kusalādīnañca kāmāvacarādibhūmibhedato dvādasadhā bhijjatīti evamettha nānappakārabhedato viññātabbo vinicchayo ",
      ". Evaṃ bhinne panettha catubhūmakampi kusalamaggaṅgaṃ pañcavokāre sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca, ṭhapetvā rūpāvacaraṃ avasesaṃ āruppe sampayuttadhammānaññeva maggapaccayena paccayoti sabbaṃ jhānapaccaye viya vitthāretabbanti evamettha paccayuppannatopi viññātabbo vinicchayoti."
    ],
    "innerText": "Ayaṃ pana maggapaccayo dvādasannaṃ maggaṅgānaṃ vasena ṭhitopi jātibhedato kusalādivasena catudhā, kusalādīnañca kāmāvacarādibhūmibhedato dvādasadhā bhijjatīti evamettha nānappakārabhedato viññātabbo vinicchayo . Evaṃ bhinne panettha catubhūmakampi kusalamaggaṅgaṃ pañcavokāre sampayuttadhammānañceva cittasamuṭṭhānarūpassa ca, ṭhapetvā rūpāvacaraṃ avasesaṃ āruppe sampayuttadhammānaññeva maggapaccayena paccayoti sabbaṃ jhānapaccaye viya vitthāretabbanti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Maggapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "19. Sampayuttapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ". Sampayuttapaccayaniddese ",
      " pāḷi uttānatthā eva. Ayaṃ pana sampayuttapaccayo nāma saṅkhepato sabbepi arūpino khandhā. Pabhedato panesa jātito kusalādīnaṃ, bhūmito ca kāmāvacarādīnaṃ vasena anekadhā bhijjatīti evamettha nānappakārabhedato viññātabbo vinicchayo. Evaṃ bhinne panettha catubhūmakesupi kusalakkhandhesu eko khandho tiṇṇaṃ khandhānaṃ, tayo ekassa, dve dvinnanti evaṃ sabbepi aññamaññaṃ sampayuttapaccayena paccayo. Akusalavipākakiriyakkhandhesupi eseva nayoti evamettha paccayuppannatopi viññātabbo vinicchayoti."
    ],
    "innerText": "19. Sampayuttapaccayaniddese pāḷi uttānatthā eva. Ayaṃ pana sampayuttapaccayo nāma saṅkhepato sabbepi arūpino khandhā. Pabhedato panesa jātito kusalādīnaṃ, bhūmito ca kāmāvacarādīnaṃ vasena anekadhā bhijjatīti evamettha nānappakārabhedato viññātabbo vinicchayo. Evaṃ bhinne panettha catubhūmakesupi kusalakkhandhesu eko khandho tiṇṇaṃ khandhānaṃ, tayo ekassa, dve dvinnanti evaṃ sabbepi aññamaññaṃ sampayuttapaccayena paccayo. Akusalavipākakiriyakkhandhesupi eseva nayoti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sampayuttapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "20. Vippayuttapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". Vippayuttapaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpino dhammā arūpīna"
      },
      "nti idaṃ tāva hadayavatthuno ceva cakkhundriyādīnañca vasena veditabbaṃ. Rūpadhammesu hi eteyeva cha koṭṭhāsā arūpakkhandhānaṃ vippayuttapaccayena paccayā honti. Rūpāyatanādayo pana ārammaṇadhammā kiñcāpi vippayuttadhammā, vippayuttapaccayā pana na honti. Kiṃ kāraṇā? Sampayogāsaṅkāya abhāvato. Arūpino hi khandhā cakkhādīnaṃ vatthūnaṃ abbhantarato nikkhamantā viya uppajjanti. Tattha āsaṅkā hoti – ‘‘kiṃ nu kho ete etehi sampayuttā, udāhu vippayuttā’’ti. Ārammaṇadhammā pana vatthunissayena uppajjamānānaṃ ārammaṇamattā hontīti natthi tesu sampayogāsaṅkā. Iti sampayogāsaṅkāya ",
      " abhāvato na te vippayuttapaccayā. Hadayavatthuādīsu eva panāyaṃ vippayuttapaccayatā veditabbā. Vuttampi cetaṃ pañhāvāre – vatthu kusalānaṃ khandhānaṃ vippayuttapaccayena paccayo. Vatthu akusalānaṃ khandhānaṃ vippayuttapaccayena paccayo. Cakkhāyatanaṃ cakkhuviññāṇassa vippayuttapaccayena paccayo. Sota… ghāna… jivhā… kāyāyatanaṃ kāyaviññāṇassa vippayuttapaccayena paccayo. Vatthu vipākābyākatānaṃ kiriyābyākatānaṃ khandhānaṃ vippayuttapaccayena paccayoti."
    ],
    "innerText": "20. Vippayuttapaccayaniddese rūpino dhammā arūpīnanti idaṃ tāva hadayavatthuno ceva cakkhundriyādīnañca vasena veditabbaṃ. Rūpadhammesu hi eteyeva cha koṭṭhāsā arūpakkhandhānaṃ vippayuttapaccayena paccayā honti. Rūpāyatanādayo pana ārammaṇadhammā kiñcāpi vippayuttadhammā, vippayuttapaccayā pana na honti. Kiṃ kāraṇā? Sampayogāsaṅkāya abhāvato. Arūpino hi khandhā cakkhādīnaṃ vatthūnaṃ abbhantarato nikkhamantā viya uppajjanti. Tattha āsaṅkā hoti – ‘‘kiṃ nu kho ete etehi sampayuttā, udāhu vippayuttā’’ti. Ārammaṇadhammā pana vatthunissayena uppajjamānānaṃ ārammaṇamattā hontīti natthi tesu sampayogāsaṅkā. Iti sampayogāsaṅkāya abhāvato na te vippayuttapaccayā. Hadayavatthuādīsu eva panāyaṃ vippayuttapaccayatā veditabbā. Vuttampi cetaṃ pañhāvāre – vatthu kusalānaṃ khandhānaṃ vippayuttapaccayena paccayo. Vatthu akusalānaṃ khandhānaṃ vippayuttapaccayena paccayo. Cakkhāyatanaṃ cakkhuviññāṇassa vippayuttapaccayena paccayo. Sota… ghāna… jivhā… kāyāyatanaṃ kāyaviññāṇassa vippayuttapaccayena paccayo. Vatthu vipākābyākatānaṃ kiriyābyākatānaṃ khandhānaṃ vippayuttapaccayena paccayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arūpino"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammā rūpīna"
      },
      "nti idaṃ pana catunnaṃ khandhānaṃ vasena veditabbaṃ. Arūpadhammesu hi cattāro khandhāva sahajātapurejātānaṃ rūpadhammānaṃ vippayuttapaccayā honti, nibbānaṃ pana arūpampi samānaṃ rūpassa vippayuttapaccayo na hoti. ‘‘Catūhi sampayogo catūhi vippayogo’’ti hi vuttaṃ. Iti catunnaṃ arūpakkhandhānaṃyeva vippayuttapaccayatā veditabbā. Vuttampi cetaṃ pañhāvāre – sahajātā kusalā khandhā cittasamuṭṭhānānaṃ rūpānaṃ vippayuttapaccayena paccayo. Pacchājātā kusalā khandhā purejātassa imassa kāyassa vippayuttapaccayena paccayo. Paṭisandhikkhaṇe vipākābyākatā khandhā kaṭattārūpānaṃ vippayuttapaccayena paccayo, khandhā vatthussāti. Evaṃ tāvettha pāḷivaṇṇanā veditabbā."
    ],
    "innerText": "Arūpinodhammā rūpīnanti idaṃ pana catunnaṃ khandhānaṃ vasena veditabbaṃ. Arūpadhammesu hi cattāro khandhāva sahajātapurejātānaṃ rūpadhammānaṃ vippayuttapaccayā honti, nibbānaṃ pana arūpampi samānaṃ rūpassa vippayuttapaccayo na hoti. ‘‘Catūhi sampayogo catūhi vippayogo’’ti hi vuttaṃ. Iti catunnaṃ arūpakkhandhānaṃyeva vippayuttapaccayatā veditabbā. Vuttampi cetaṃ pañhāvāre – sahajātā kusalā khandhā cittasamuṭṭhānānaṃ rūpānaṃ vippayuttapaccayena paccayo. Pacchājātā kusalā khandhā purejātassa imassa kāyassa vippayuttapaccayena paccayo. Paṭisandhikkhaṇe vipākābyākatā khandhā kaṭattārūpānaṃ vippayuttapaccayena paccayo, khandhā vatthussāti. Evaṃ tāvettha pāḷivaṇṇanā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ pana vippayuttapaccayo nāma saṅkhepato pañcavokārabhave vattamānā rūpārūpadhammā. Tesu rūpaṃ vatthuno cakkhādīnañca vasena chadhā bhinnaṃ, arūpaṃ pañcavokārabhave uppannakusalākusalavipākakiriyavasena catudhā bhinnaṃ. Tassa bhūmito kāmāvacarādivasena catudhā, ekadhā, tidhā, tidhāti ekadasadhā bhedo hoti. Āruppavipākañhi vippayuttapaccayo na hotīti evamettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhinne panettha pañcavokārabhave uppannaṃ catubhūmakampi kusalaṃ akusalañca attanā samuṭṭhāpitacittasamuṭṭhānarūpassa sahajātavippayuttapaccayena paccayo hoti. Uppādakkhaṇaṃ pana atikkamitvā ṭhitikkhaṇaṃ pattassa purejātassa catusamuṭṭhānikatisamuṭṭhānikarūpakāyassa pacchājātavippayuttapaccayena paccayo hoti. Ettha ca tisamuṭṭhānikakāyoti āhārasamuṭṭhānassa abhāvato brahmapārisajjādīnaṃ kāyo veditabbo. Kāmāvacararūpāvacaravipākaṃ pana pavatte cittasamuṭṭhānarūpassa, paṭisandhiyaṃ ",
      " kaṭattārūpassa ca sahajātavippayuttapaccayena paccayo hoti. Lokuttaravipākaṃ cittasamuṭṭhānarūpasseva. Tividhampi panetaṃ purejātassa catusamuṭṭhānikatisamuṭṭhānikakāyassa pacchājātavippayuttapaccayena paccayo. Tebhūmakampi kiriyaṃ cittasamuṭṭhānassa sahajātavippayuttapaccayena paccayo, purejātassa catusamuṭṭhānikatisamuṭṭhānikakāyassa pacchājātavippayuttapaccayena paccayo. Chadhā ṭhitesu pana rūpesu vatthurūpaṃ paṭisandhikkhaṇe kāmāvacararūpāvacaravipākānaṃ sahajātavippayuttapaccayena paccayo, pavatte uppajjamānānaṃ catubhūmakakusalānaṃ akusalānaṃ dvipañcaviññāṇavajjānaṃ tebhūmakavipākānaṃ tebhūmakakiriyānañca purejātavippayuttapaccayena ",
      " paccayo. Cakkhāyatanādīni cakkhuviññāṇādīnaṃ purejātavippayuttapaccayena paccayoti evamettha paccayuppannatopi viññātabbo vinicchayoti."
    ],
    "innerText": "Evaṃ bhinne panettha pañcavokārabhave uppannaṃ catubhūmakampi kusalaṃ akusalañca attanā samuṭṭhāpitacittasamuṭṭhānarūpassa sahajātavippayuttapaccayena paccayo hoti. Uppādakkhaṇaṃ pana atikkamitvā ṭhitikkhaṇaṃ pattassa purejātassa catusamuṭṭhānikatisamuṭṭhānikarūpakāyassa pacchājātavippayuttapaccayena paccayo hoti. Ettha ca tisamuṭṭhānikakāyoti āhārasamuṭṭhānassa abhāvato brahmapārisajjādīnaṃ kāyo veditabbo. Kāmāvacararūpāvacaravipākaṃ pana pavatte cittasamuṭṭhānarūpassa, paṭisandhiyaṃ kaṭattārūpassa ca sahajātavippayuttapaccayena paccayo hoti. Lokuttaravipākaṃ cittasamuṭṭhānarūpasseva. Tividhampi panetaṃ purejātassa catusamuṭṭhānikatisamuṭṭhānikakāyassa pacchājātavippayuttapaccayena paccayo. Tebhūmakampi kiriyaṃ cittasamuṭṭhānassa sahajātavippayuttapaccayena paccayo, purejātassa catusamuṭṭhānikatisamuṭṭhānikakāyassa pacchājātavippayuttapaccayena paccayo. Chadhā ṭhitesu pana rūpesu vatthurūpaṃ paṭisandhikkhaṇe kāmāvacararūpāvacaravipākānaṃ sahajātavippayuttapaccayena paccayo, pavatte uppajjamānānaṃ catubhūmakakusalānaṃ akusalānaṃ dvipañcaviññāṇavajjānaṃ tebhūmakavipākānaṃ tebhūmakakiriyānañca purejātavippayuttapaccayena paccayo. Cakkhāyatanādīni cakkhuviññāṇādīnaṃ purejātavippayuttapaccayena paccayoti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vippayuttapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "21. Atthipaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". Atthipaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cattāro khandhā"
      },
      "tiādīhi sahajātavasena atthipaccayo niddiṭṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhāyatana"
      },
      "ntiādīhi purejātavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ rūpaṃ nissāyā"
      },
      "ti ettha sahajātapurejātavasena atthipaccayo niddiṭṭho. Evamayaṃ pāḷi sahajātapurejātānaññeva atthipaccayānaṃ vasena āgatā. Pañhāvāre pana sahajātaṃ, purejātaṃ, pacchājātaṃ, āhāraṃ, indriyanti imesaṃ vasena āgatattā pacchājātaāhārindriyavasenāpi atthipaccayo labbhati. Idha pana sāvasesavasena desanā katāti ayaṃ tāvettha pāḷivaṇṇanā."
    ],
    "innerText": "21. Atthipaccayaniddese cattāro khandhātiādīhi sahajātavasena atthipaccayo niddiṭṭho. Cakkhāyatanantiādīhi purejātavasena. Yaṃ rūpaṃ nissāyāti ettha sahajātapurejātavasena atthipaccayo niddiṭṭho. Evamayaṃ pāḷi sahajātapurejātānaññeva atthipaccayānaṃ vasena āgatā. Pañhāvāre pana sahajātaṃ, purejātaṃ, pacchājātaṃ, āhāraṃ, indriyanti imesaṃ vasena āgatattā pacchājātaāhārindriyavasenāpi atthipaccayo labbhati. Idha pana sāvasesavasena desanā katāti ayaṃ tāvettha pāḷivaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayaṃ pana atthipaccayo nāma duvidho – aññamaññato, na aññamaññato. Tattha aññamaññaṃ tividhaṃ – arūpaṃ arūpena, rūpaṃ rūpena, rūpārūpaṃ rūpārūpena. ‘‘Cattāro khandhā arūpino’’ti ettha hi sabbacittuppattivasena arūpaṃ arūpena vuttaṃ. ‘‘Cattāro mahābhūtā’’ti ettha sabbasantativasena rūpaṃ rūpena. ‘‘Okkantikkhaṇe nāmarūpa’’nti ettha paṭisandhikhandhānañceva vatthuno ca vasena rūpārūpaṃ rūpārūpena vuttaṃ. Na aññamaññampi tividhaṃ – ‘‘arūpaṃ rūpassa, rūpaṃ rūpassa, rūpaṃ ",
      " arūpassa cittacetasikā dhammā’’ti ettha hi pañcavokāravasena arūpaṃ rūpassa vuttaṃ. ‘‘Mahābhūtā upādārūpāna’’nti ettha sabbasantativasena rūpaṃ rūpassa. ‘‘Cakkhāyatanaṃ cakkhuviññāṇadhātuyā’’tiādīsu vatthārammaṇavasena rūpaṃ arūpassa atthipaccayoti vuttaṃ."
    ],
    "innerText": "Ayaṃ pana atthipaccayo nāma duvidho – aññamaññato, na aññamaññato. Tattha aññamaññaṃ tividhaṃ – arūpaṃ arūpena, rūpaṃ rūpena, rūpārūpaṃ rūpārūpena. ‘‘Cattāro khandhā arūpino’’ti ettha hi sabbacittuppattivasena arūpaṃ arūpena vuttaṃ. ‘‘Cattāro mahābhūtā’’ti ettha sabbasantativasena rūpaṃ rūpena. ‘‘Okkantikkhaṇe nāmarūpa’’nti ettha paṭisandhikhandhānañceva vatthuno ca vasena rūpārūpaṃ rūpārūpena vuttaṃ. Na aññamaññampi tividhaṃ – ‘‘arūpaṃ rūpassa, rūpaṃ rūpassa, rūpaṃ arūpassa cittacetasikā dhammā’’ti ettha hi pañcavokāravasena arūpaṃ rūpassa vuttaṃ. ‘‘Mahābhūtā upādārūpāna’’nti ettha sabbasantativasena rūpaṃ rūpassa. ‘‘Cakkhāyatanaṃ cakkhuviññāṇadhātuyā’’tiādīsu vatthārammaṇavasena rūpaṃ arūpassa atthipaccayoti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apicesa atthipaccayo nāma saṅkhepato khaṇattayappattaṃ nāmañceva rūpañca, vattamānā pañcakkhandhātipi vattuṃ vaṭṭati. So jātibhedato kusalākusalavipākakiriyarūpavasena pañcadhā bhijjati ",
      ". Tattha kusalo sahajātapacchājātavasena duvidho hoti, tathā akusalo vipākakiriyasaṅkhāto ca. Tesu kusalo kāmāvacarādibhedena catudhā bhijjati, akusalo kāmāvacarova vipāko catubhūmako, kiriyāsaṅkhāto tibhūmako. Rūpasaṅkhāto atthipaccayo kāmāvacarova. So pana sahajātapurejātavasena duvidho. Tattha pañca vatthūni ārammaṇāni ca purejātāneva, hadayavatthu sahajātaṃ vā hoti purejātaṃ vā. Pañhāvāre pana āgato āhāro indriyañca sahajātādibhedaṃ na labhatīti evamettha nānappakārabhedato viññātabbo vinicchayo."
    ],
    "innerText": "Apicesa atthipaccayo nāma saṅkhepato khaṇattayappattaṃ nāmañceva rūpañca, vattamānā pañcakkhandhātipi vattuṃ vaṭṭati. So jātibhedato kusalākusalavipākakiriyarūpavasena pañcadhā bhijjati . Tattha kusalo sahajātapacchājātavasena duvidho hoti, tathā akusalo vipākakiriyasaṅkhāto ca. Tesu kusalo kāmāvacarādibhedena catudhā bhijjati, akusalo kāmāvacarova vipāko catubhūmako, kiriyāsaṅkhāto tibhūmako. Rūpasaṅkhāto atthipaccayo kāmāvacarova. So pana sahajātapurejātavasena duvidho. Tattha pañca vatthūni ārammaṇāni ca purejātāneva, hadayavatthu sahajātaṃ vā hoti purejātaṃ vā. Pañhāvāre pana āgato āhāro indriyañca sahajātādibhedaṃ na labhatīti evamettha nānappakārabhedato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ bhinne panettha catubhūmakakusalopi sahajāto atthipaccayo pañcavokāre ‘‘eko khandho tiṇṇannaṃ khandhāna’’ntiādinā nayena aññamaññaṃ khandhānañceva cittasamuṭṭhānarūpassa ca ṭhapetvā pana rūpāvacarakusalaṃ avaseso āruppe sampayuttakkhandhānaññeva sahajātakusalo atthipaccayena paccayo hoti. Catubhūmako panesa pañcavokāre catusamuṭṭhānikatisamuṭṭhānikakāyassa pacchājāto kusalo atthipaccayena paccayo hoti. Akusalepi eseva nayo. Sopi hi pañcavokāre sampayuttakkhandhānañceva cittasamuṭṭhānarūpassa ca, catuvokāre sampayuttakkhandhānaññeva sahajātākusalo atthipaccayena paccayo. Pañcavokāre catusamuṭṭhānikatisamuṭṭhānikakāyassa pacchājātākusalo atthipaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vipākato pana kāmāvacararūpāvacaro atthipaccayo niyameneva paṭisandhikkhaṇe khandhānañceva kaṭattārūpassa ca sahajātatthipaccayena paccayo. Pavatte ",
      " pana sampayuttakkhandhānañceva cittasamuṭṭhānarūpassa ca sahajātatthipaccayena paccayo, ṭhitippattassa catusamuṭṭhānikatisamuṭṭhānikakāyassa pacchājātatthipaccayena paccayo. Arūpāvacaravipāko pana āruppe uppannalokuttaravipāko ca attanā sampayuttakkhandhānaññeva sahajātatthipaccayena paccayo. Pañcavokāre lokuttaravipāko sampayuttakkhandhānañceva cittasamuṭṭhānarūpassa ca sahajātatthipaccayena paccayo, catusamuṭṭhānikatisamuṭṭhānikakāyassa pacchājātatthipaccayena paccayo. Kiriyato rūpāvacaro atthipaccayo sampayuttakkhandhānañceva cittasamuṭṭhānarūpassa ca sahajātatthipaccayena paccayo, catusamuṭṭhānikatisamuṭṭhānikakāyassa pacchājātatthipaccayena paccayo. Kāmāvacarārūpāvacaro pana āruppe sampayuttakkhandhānaññeva, pañcavokāre cittasamuṭṭhānarūpassāpi sahajātatthipaccayena paccayo, catusamuṭṭhānikatisamuṭṭhānikakāyassa pacchājātatthi paccayena paccayo."
    ],
    "innerText": "Vipākato pana kāmāvacararūpāvacaro atthipaccayo niyameneva paṭisandhikkhaṇe khandhānañceva kaṭattārūpassa ca sahajātatthipaccayena paccayo. Pavatte pana sampayuttakkhandhānañceva cittasamuṭṭhānarūpassa ca sahajātatthipaccayena paccayo, ṭhitippattassa catusamuṭṭhānikatisamuṭṭhānikakāyassa pacchājātatthipaccayena paccayo. Arūpāvacaravipāko pana āruppe uppannalokuttaravipāko ca attanā sampayuttakkhandhānaññeva sahajātatthipaccayena paccayo. Pañcavokāre lokuttaravipāko sampayuttakkhandhānañceva cittasamuṭṭhānarūpassa ca sahajātatthipaccayena paccayo, catusamuṭṭhānikatisamuṭṭhānikakāyassa pacchājātatthipaccayena paccayo. Kiriyato rūpāvacaro atthipaccayo sampayuttakkhandhānañceva cittasamuṭṭhānarūpassa ca sahajātatthipaccayena paccayo, catusamuṭṭhānikatisamuṭṭhānikakāyassa pacchājātatthipaccayena paccayo. Kāmāvacarārūpāvacaro pana āruppe sampayuttakkhandhānaññeva, pañcavokāre cittasamuṭṭhānarūpassāpi sahajātatthipaccayena paccayo, catusamuṭṭhānikatisamuṭṭhānikakāyassa pacchājātatthi paccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Rūpasaṅkhāto pana atthipaccayo sahajāto, purejāto, āhāro, indriyanti catubbidho. Tattha sahajātarūpatthipaccayo catusamuṭṭhānavasena catudhā ṭhito. Tattha kammasamuṭṭhāno ekaṃ mahābhūtaṃ tiṇṇannaṃ mahābhūtānaṃ, tīṇi ekassa, dve dvinnaṃ, mahābhūtā upādārūpānanti evaṃ sahajātatthipaccayena paccayo hoti. Paṭisandhikkhaṇe vatthurūpaṃ kāmāvacararūpāvacaravipākakkhandhānaṃ sahajātatthipaccayena paccayo hoti. Tesampi tisamuṭṭhānikarūpaṃ ekaṃ mahābhūtaṃ tiṇṇannaṃ mahābhūtānaṃ, tīṇi ekassa, dve dvinnaṃ, mahābhūtā upādārūpānanti evaṃ sahajātatthipaccayena paccayo hoti. Purejātatthipaccayo pana vatthupurejātaārammaṇapurejātavasena duvidho hoti. So duvidhopi heṭṭhā purejātapaccaye vuttanayeneva yojetvā gahetabbo. Āhāratthipaccayopi heṭṭhā kabaḷīkārāhārapaccaye yojitanayeneva yojetabbo. Idha panesa attano aniruddhakkhaṇe paccayabhāvena atthipaccayoti vutto. Rūpajīvitindriyampi heṭṭhā indriyapaccaye rūpajīvitindriyayojanāyaṃ vuttanayeneva yojetabbaṃ. Idha panetampi attano aniruddhakkhaṇeyeva paccayabhāvena atthipaccayoti vuttanti evamettha paccayuppannatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Atthipaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22. Natthipaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". Natthipaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samanantaraniruddhā"
      },
      "ti aññena cittuppādena anantarikā hutvā samanantaraniruddhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭuppannāna"
      },
      "nti paccuppannānaṃ. Iminā natthipaccayassa okāsadānaṭṭhena natthipaccayabhāvaṃ sādheti. Purimesu hi nirodhavasena pacchimānaṃ pavattanokāsaṃ adentesu tesaṃ paṭuppannabhāvo na siyāti ayamettha pāḷivaṇṇanā. Sesaṃ sabbaṃ anantarapaccaye vuttanayeneva veditabbaṃ. Paccayalakkhaṇameva hettha nānaṃ, paccayānaṃ pana paccayuppannānañca nānākaraṇaṃ natthi. Kevalaṃ pana tattha ‘‘cakkhuviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā’’tiādinā nayena paccayā ca paccayuppannā ca sarūpato dassitā. Idha pana ‘‘samanantaraniruddhā cittacetasikā dhammā ",
      " paṭuppannānaṃ cittacetasikānaṃ dhammāna’’nti sabbepi te nirodhuppādavasena sāmaññato dassitāti."
    ],
    "innerText": "22. Natthipaccayaniddese samanantaraniruddhāti aññena cittuppādena anantarikā hutvā samanantaraniruddhā. Paṭuppannānanti paccuppannānaṃ. Iminā natthipaccayassa okāsadānaṭṭhena natthipaccayabhāvaṃ sādheti. Purimesu hi nirodhavasena pacchimānaṃ pavattanokāsaṃ adentesu tesaṃ paṭuppannabhāvo na siyāti ayamettha pāḷivaṇṇanā. Sesaṃ sabbaṃ anantarapaccaye vuttanayeneva veditabbaṃ. Paccayalakkhaṇameva hettha nānaṃ, paccayānaṃ pana paccayuppannānañca nānākaraṇaṃ natthi. Kevalaṃ pana tattha ‘‘cakkhuviññāṇadhātu taṃsampayuttakā ca dhammā manodhātuyā’’tiādinā nayena paccayā ca paccayuppannā ca sarūpato dassitā. Idha pana ‘‘samanantaraniruddhā cittacetasikā dhammā paṭuppannānaṃ cittacetasikānaṃ dhammāna’’nti sabbepi te nirodhuppādavasena sāmaññato dassitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Natthipaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "23. Vigatapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". Vigatapaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samanantaravigatā"
      },
      "ti samanantarameva vigatā. Iminā vigatapaccayassa vigacchamānabhāveneva paccayabhāvaṃ dasseti. Iti natthipaccayassa ca imassa ca byañjanamatteyeva nānattaṃ, na attheti."
    ],
    "innerText": "23. Vigatapaccayaniddese samanantaravigatāti samanantarameva vigatā. Iminā vigatapaccayassa vigacchamānabhāveneva paccayabhāvaṃ dasseti. Iti natthipaccayassa ca imassa ca byañjanamatteyeva nānattaṃ, na attheti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vigatapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "24. Avigatapaccayaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ". Avigatapaccayaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cattāro khandhā"
      },
      "tiādīnaṃ sabbākārena atthipaccayaniddese vuttanayeneva attho veditabbo. Imassapi hi paccayassa atthipaccayena saddhiṃ byañjanamatteyeva nānattaṃ, na attheti."
    ],
    "innerText": "24. Avigatapaccayaniddese cattāro khandhātiādīnaṃ sabbākārena atthipaccayaniddese vuttanayeneva attho veditabbo. Imassapi hi paccayassa atthipaccayena saddhiṃ byañjanamatteyeva nānattaṃ, na attheti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Avigatapaccayaniddesavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Paccayaniddesapakiṇṇakavinicchayakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " evaṃ uddesaniddesato dassitesu imesu catuvīsatiyā paccayesu ñāṇacārassa visadabhāvatthaṃ ",
      " anekadhammānaṃ ekapaccayabhāvato, ekadhammassa anekapaccayabhāvato, ekapaccayassa anekapaccayabhāvato, paccayasabhāgato, paccayavisabhāgato, yugaḷakato, janakājanakato, sabbaṭṭhānikāsabbaṭṭhānikato, rūpaṃ rūpassātiādivikappato, bhavabhedatoti imesaṃ dasannaṃ padānaṃ vasena pakiṇṇakavinicchayo veditabbo. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anekadhammānaṃ ekapaccayabhāvato"
      },
      "ti etesu hi ṭhapetvā kammapaccayaṃ avasesesu tevīsatiyā paccayesu anekadhammā ekato paccayā honti. Kammapaccayo pana eko cetanādhammoyevāti evaṃ tāvettha anekadhammānaṃ ekapaccayabhāvato vinicchayo veditabbo."
    ],
    "innerText": "Idāni evaṃ uddesaniddesato dassitesu imesu catuvīsatiyā paccayesu ñāṇacārassa visadabhāvatthaṃ anekadhammānaṃ ekapaccayabhāvato, ekadhammassa anekapaccayabhāvato, ekapaccayassa anekapaccayabhāvato, paccayasabhāgato, paccayavisabhāgato, yugaḷakato, janakājanakato, sabbaṭṭhānikāsabbaṭṭhānikato, rūpaṃ rūpassātiādivikappato, bhavabhedatoti imesaṃ dasannaṃ padānaṃ vasena pakiṇṇakavinicchayo veditabbo. Tattha anekadhammānaṃ ekapaccayabhāvatoti etesu hi ṭhapetvā kammapaccayaṃ avasesesu tevīsatiyā paccayesu anekadhammā ekato paccayā honti. Kammapaccayo pana eko cetanādhammoyevāti evaṃ tāvettha anekadhammānaṃ ekapaccayabhāvato vinicchayo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekadhammassa anekapaccayabhāvato"
      },
      "ti hetupaccaye tāva amoho eko dhammo. So purejātakammāhārajhānapaccayova na hoti, sesānaṃ vīsatiyā paccayānaṃ vasena paccayo hoti. Alobhādosā indriyamaggapaccayāpi na honti, sesānaṃ aṭṭhārasannaṃ paccayānaṃ vasena paccayā honti. Lobhamohā vipākapaccayāpi na honti, sesānaṃ sattarasannaṃ paccayānaṃ vasena paccayā honti. Doso adhipatipaccayopi na hoti, sesānaṃ soḷasannaṃ paccayānaṃ vasena paccayo hoti. Ārammaṇapaccaye rūpāyatanaṃ cakkhuviññāṇadhātuyā ārammaṇapurejātaatthiavigatavasena catudhā paccayo; tathā manodhātuyā ahetukamanoviññāṇadhātuyā ca. Sahetukāya pana ārammaṇādhipatiārammaṇūpanissayavasenāpi paccayo hoti. Iminā nayena sabbesaṃ ārammaṇapaccayadhammānaṃ anekapaccayabhāvo veditabbo."
    ],
    "innerText": "Ekadhammassa anekapaccayabhāvatoti hetupaccaye tāva amoho eko dhammo. So purejātakammāhārajhānapaccayova na hoti, sesānaṃ vīsatiyā paccayānaṃ vasena paccayo hoti. Alobhādosā indriyamaggapaccayāpi na honti, sesānaṃ aṭṭhārasannaṃ paccayānaṃ vasena paccayā honti. Lobhamohā vipākapaccayāpi na honti, sesānaṃ sattarasannaṃ paccayānaṃ vasena paccayā honti. Doso adhipatipaccayopi na hoti, sesānaṃ soḷasannaṃ paccayānaṃ vasena paccayo hoti. Ārammaṇapaccaye rūpāyatanaṃ cakkhuviññāṇadhātuyā ārammaṇapurejātaatthiavigatavasena catudhā paccayo; tathā manodhātuyā ahetukamanoviññāṇadhātuyā ca. Sahetukāya pana ārammaṇādhipatiārammaṇūpanissayavasenāpi paccayo hoti. Iminā nayena sabbesaṃ ārammaṇapaccayadhammānaṃ anekapaccayabhāvo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Adhipatipaccaye ārammaṇādhipatino ārammaṇapaccaye vuttanayeneva anekapaccayabhāvo veditabbo. Sahajātādhipatīsu vīmaṃsā amohahetu viya vīsatidhā paccayo hoti. Chando hetupurejātakammaāhāraindriyajhānamaggapaccayo na hoti, sesānaṃ sattarasannaṃ paccayānaṃ vasena paccayo hoti. Cittaṃ hetupurejātakammajhānamaggapaccayo na hoti, sesānaṃ ekūnavīsatiyā paccayānaṃ vasena paccayo hoti. Vīriyaṃ hetupurejātakammāhārajhānapaccayo na hoti, sesānaṃ ekūnavīsatiyā vasena paccayo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anantarapaccaye ",
      " ‘‘cakkhuviññāṇadhātū’’tiādinā nayena vuttesu catūsu khandhesu vedanākkhandho hetupurejātakammāhāramaggapaccayo na hoti, sesānaṃ ekūnavīsatiyā vasena paccayo hoti. Saññākkhandho indriyajhānapaccayopi na hoti, sesānaṃ sattarasannaṃ vasena paccayo ",
      " hoti. Saṅkhārakkhandhe hetū hetupaccaye vuttanayena, chandavīriyāni adhipatipaccaye vuttanayeneva paccayā honti. Phasso hetupurejātakammaindriyajhānamaggapaccayo na hoti, sesānaṃ aṭṭhārasannaṃ vasena paccayo hoti. Cetanā hetupurejātaindriyajhānamaggapaccayo na hoti. Sesānaṃ ekūnavīsatiyā vasena paccayo hoti. Vitakko hetupurejātakammāhārindriyapaccayo na hoti, sesānaṃ ekūnavīsatiyā vasena paccayo hoti. Vicāro maggapaccayopi na hoti, sesānaṃ aṭṭhārasannaṃ vasena paccayo hoti. Pīti tesaññeva vasena paccayo hoti. Cittekaggatā hetupurejātakammāhārapaccayo na hoti, sesānaṃ vīsatiyā vasena paccayo hoti. Saddhā hetupurejātakammāhārajhānamaggapaccayo na hoti, sesānaṃ aṭṭhārasannaṃ vasena paccayo hoti. Sati tehi ceva maggapaccayena cāti ekūnavīsatiyā vasena paccayo hoti. Jīvitindriyaṃ saddhāya vuttānaṃ aṭṭhārasannaṃ vasena paccayo hoti. Hirottappaṃ tato indriyapaccayaṃ apanetvā sesānaṃ sattarasannaṃ vasena paccayo hoti. Tathā kāyapassaddhādīni yugaḷakāni, yevāpanakesu adhimokkhamanasikāratatramajjhattatā karuṇāmuditā ca. Viratiyo pana tehi ceva maggapaccayena cāti aṭṭhārasadhā paccayā honti. Micchādiṭṭhi tato vipākapaccayaṃ apanetvā sattarasadhā, micchāvācākammantājīvā tehi ceva kammāhārapaccayehi cāti ekūnavīsatidhā. Ahirikaṃ anottappaṃ māno thinaṃ middhaṃ uddhaccanti ime hetupurejātakammavipākāhārindriyajhānamaggapaccayā na honti, sesānaṃ pana soḷasannaṃ paccayānaṃ vasena paccayā honti. Vicikicchāissāmacchariyakukkuccāni tato adhipatipaccayaṃ apanetvā pannarasadhā viññāṇakkhandhassa. Adhipatipaccaye vuttanayeneva anekapaccayabhāvo veditabbo. Samanantarapaccayepi eseva nayo."
    ],
    "innerText": "Anantarapaccaye ‘‘cakkhuviññāṇadhātū’’tiādinā nayena vuttesu catūsu khandhesu vedanākkhandho hetupurejātakammāhāramaggapaccayo na hoti, sesānaṃ ekūnavīsatiyā vasena paccayo hoti. Saññākkhandho indriyajhānapaccayopi na hoti, sesānaṃ sattarasannaṃ vasena paccayo hoti. Saṅkhārakkhandhe hetū hetupaccaye vuttanayena, chandavīriyāni adhipatipaccaye vuttanayeneva paccayā honti. Phasso hetupurejātakammaindriyajhānamaggapaccayo na hoti, sesānaṃ aṭṭhārasannaṃ vasena paccayo hoti. Cetanā hetupurejātaindriyajhānamaggapaccayo na hoti. Sesānaṃ ekūnavīsatiyā vasena paccayo hoti. Vitakko hetupurejātakammāhārindriyapaccayo na hoti, sesānaṃ ekūnavīsatiyā vasena paccayo hoti. Vicāro maggapaccayopi na hoti, sesānaṃ aṭṭhārasannaṃ vasena paccayo hoti. Pīti tesaññeva vasena paccayo hoti. Cittekaggatā hetupurejātakammāhārapaccayo na hoti, sesānaṃ vīsatiyā vasena paccayo hoti. Saddhā hetupurejātakammāhārajhānamaggapaccayo na hoti, sesānaṃ aṭṭhārasannaṃ vasena paccayo hoti. Sati tehi ceva maggapaccayena cāti ekūnavīsatiyā vasena paccayo hoti. Jīvitindriyaṃ saddhāya vuttānaṃ aṭṭhārasannaṃ vasena paccayo hoti. Hirottappaṃ tato indriyapaccayaṃ apanetvā sesānaṃ sattarasannaṃ vasena paccayo hoti. Tathā kāyapassaddhādīni yugaḷakāni, yevāpanakesu adhimokkhamanasikāratatramajjhattatā karuṇāmuditā ca. Viratiyo pana tehi ceva maggapaccayena cāti aṭṭhārasadhā paccayā honti. Micchādiṭṭhi tato vipākapaccayaṃ apanetvā sattarasadhā, micchāvācākammantājīvā tehi ceva kammāhārapaccayehi cāti ekūnavīsatidhā. Ahirikaṃ anottappaṃ māno thinaṃ middhaṃ uddhaccanti ime hetupurejātakammavipākāhārindriyajhānamaggapaccayā na honti, sesānaṃ pana soḷasannaṃ paccayānaṃ vasena paccayā honti. Vicikicchāissāmacchariyakukkuccāni tato adhipatipaccayaṃ apanetvā pannarasadhā viññāṇakkhandhassa. Adhipatipaccaye vuttanayeneva anekapaccayabhāvo veditabbo. Samanantarapaccayepi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sahajātapaccaye catūsu tāva khandhesu ekekassa dhammassa anekapaccayabhāvo vuttanayeneva veditabbo. Cattāri mahābhūtāni ārammaṇaārammaṇādhipatisahajātaaññamaññanissayaupanissayapurejātaatthiavigatavasena ",
      " navadhā paccayā honti. Hadayavatthu tesañceva vippayuttassa ca vasena dasadhā paccayo hoti. Aññamaññapaccaye apubbaṃ natthi. Nissayapaccaye cakkhāyatanādīni ārammaṇaārammaṇādhipatinissayaupanissayapurejātaindriyavippayuttaatthiavigatavasena navadhā paccayā honti. Upanissaye apubbaṃ natthi. Purejātapaccaye rūpasaddagandharasāyatanāni ārammaṇaārammaṇādhipatiupanissayapurejātaatthiavigatavasena chadhā paccayā honti. Ettakamevettha apubbaṃ. Pacchājātādīsu apubbaṃ natthi. Āhārapaccaye kabaḷīkārāhāro ",
      " ārammaṇaārammaṇādhipatiupanissayaāhāraatthiavigatavasena chadhā paccayo hoti. Indriyādīsu apubbaṃ natthi. Evamettha ekadhammassa anekapaccayabhāvatopi viññātabbo vinicchayo."
    ],
    "innerText": "Sahajātapaccaye catūsu tāva khandhesu ekekassa dhammassa anekapaccayabhāvo vuttanayeneva veditabbo. Cattāri mahābhūtāni ārammaṇaārammaṇādhipatisahajātaaññamaññanissayaupanissayapurejātaatthiavigatavasena navadhā paccayā honti. Hadayavatthu tesañceva vippayuttassa ca vasena dasadhā paccayo hoti. Aññamaññapaccaye apubbaṃ natthi. Nissayapaccaye cakkhāyatanādīni ārammaṇaārammaṇādhipatinissayaupanissayapurejātaindriyavippayuttaatthiavigatavasena navadhā paccayā honti. Upanissaye apubbaṃ natthi. Purejātapaccaye rūpasaddagandharasāyatanāni ārammaṇaārammaṇādhipatiupanissayapurejātaatthiavigatavasena chadhā paccayā honti. Ettakamevettha apubbaṃ. Pacchājātādīsu apubbaṃ natthi. Āhārapaccaye kabaḷīkārāhāro ārammaṇaārammaṇādhipatiupanissayaāhāraatthiavigatavasena chadhā paccayo hoti. Indriyādīsu apubbaṃ natthi. Evamettha ekadhammassa anekapaccayabhāvatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekapaccayassa anekapaccayabhāvato"
      },
      "ti hetupaccayādīsu yassa kassaci ekassa paccayassa yenākārena yenatthena yo paccayuppannānaṃ paccayo hoti, taṃ ākāraṃ taṃ atthaṃ avijahitvāva aññehipi yehākārehi yehi atthehi so tasmiññeva khaṇe tesaṃ dhammānaṃ anekapaccayabhāvaṃ gacchati, tato anekapaccayabhāvato tassa vinicchayo veditabboti attho. Seyyathidaṃ – amoho hetupaccayo, so hetupaccayattaṃ avijahantova adhipatisahajātaaññamaññanissayavipākaindriyamaggasampayuttavippayuttaatthiavigatānaṃ vasena aparehipi ekādasahākārehi anekapaccayabhāvaṃ gacchati. Alobhādosā tato adhipatiindriyamaggapaccaye tayo apanetvā sesānaṃ vasena anekapaccayabhāvaṃ gacchanti. Idaṃ vipākahetūsuyeva labbhati, kusalakiriyesu pana vipākapaccayatā parihāyati. Lobhadosamohā te tayo vipākañcāti cattāro apanetvā sesānaṃ vasena anekapaccayabhāvaṃ gacchanti."
    ],
    "innerText": "Ekapaccayassa anekapaccayabhāvatoti hetupaccayādīsu yassa kassaci ekassa paccayassa yenākārena yenatthena yo paccayuppannānaṃ paccayo hoti, taṃ ākāraṃ taṃ atthaṃ avijahitvāva aññehipi yehākārehi yehi atthehi so tasmiññeva khaṇe tesaṃ dhammānaṃ anekapaccayabhāvaṃ gacchati, tato anekapaccayabhāvato tassa vinicchayo veditabboti attho. Seyyathidaṃ – amoho hetupaccayo, so hetupaccayattaṃ avijahantova adhipatisahajātaaññamaññanissayavipākaindriyamaggasampayuttavippayuttaatthiavigatānaṃ vasena aparehipi ekādasahākārehi anekapaccayabhāvaṃ gacchati. Alobhādosā tato adhipatiindriyamaggapaccaye tayo apanetvā sesānaṃ vasena anekapaccayabhāvaṃ gacchanti. Idaṃ vipākahetūsuyeva labbhati, kusalakiriyesu pana vipākapaccayatā parihāyati. Lobhadosamohā te tayo vipākañcāti cattāro apanetvā sesānaṃ vasena anekapaccayabhāvaṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ārammaṇapaccayo taṃ ārammaṇapaccayattaṃ avijahantaṃyeva ārammaṇādhipatinissayaupanissayapurejātavippayuttaatthiavigatānaṃ vasena aparehipi sattahākārehi anekapaccayabhāvaṃ gacchati. Ayamettha ukkaṭṭhaparicchedo, arūpadhammānaṃ pana atītānāgatānaṃ vā rūpadhammānaṃ ārammaṇapaccayabhāve sati ārammaṇādhipatiārammaṇūpanissayamattaññeva uttari ",
      " labbhati. Adhipatipaccaye vīmaṃsā amohasadisā. Chando adhipatipaccayo adhipatipaccayattaṃ avijahantova sahajātaaññamaññanissayavipākasampayuttavippayuttaatthiavigatānaṃ vasena aparehipi aṭṭhahākārehi anekapaccayabhāvaṃ gacchati. Vīriyaṃ tesañceva indriyamaggapaccayānañcāti imesaṃ vasena aparehipi dasahākārehi anekapaccayabhāvaṃ gacchati. Cittaṃ tato maggapaccayaṃ apanetvā āhārapaccayaṃ pakkhipitvā imesaṃ vasena adhipatipaccayato uttari dasahākārehi anekapaccayabhāvaṃ gacchati. Ārammaṇādhipatino pana heṭṭhā ārammaṇapaccaye vuttanayeneva anekapaccayabhāvo veditabbo."
    ],
    "innerText": "Ārammaṇapaccayo taṃ ārammaṇapaccayattaṃ avijahantaṃyeva ārammaṇādhipatinissayaupanissayapurejātavippayuttaatthiavigatānaṃ vasena aparehipi sattahākārehi anekapaccayabhāvaṃ gacchati. Ayamettha ukkaṭṭhaparicchedo, arūpadhammānaṃ pana atītānāgatānaṃ vā rūpadhammānaṃ ārammaṇapaccayabhāve sati ārammaṇādhipatiārammaṇūpanissayamattaññeva uttari labbhati. Adhipatipaccaye vīmaṃsā amohasadisā. Chando adhipatipaccayo adhipatipaccayattaṃ avijahantova sahajātaaññamaññanissayavipākasampayuttavippayuttaatthiavigatānaṃ vasena aparehipi aṭṭhahākārehi anekapaccayabhāvaṃ gacchati. Vīriyaṃ tesañceva indriyamaggapaccayānañcāti imesaṃ vasena aparehipi dasahākārehi anekapaccayabhāvaṃ gacchati. Cittaṃ tato maggapaccayaṃ apanetvā āhārapaccayaṃ pakkhipitvā imesaṃ vasena adhipatipaccayato uttari dasahākārehi anekapaccayabhāvaṃ gacchati. Ārammaṇādhipatino pana heṭṭhā ārammaṇapaccaye vuttanayeneva anekapaccayabhāvo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anantarasamanantarapaccayā anantarasamanantarapaccayattaṃ avijahantāva upanissayakammaāsevananatthivigatānaṃ ",
      " vasena aparehipi pañcahākārehi anekapaccayabhāvaṃ gacchanti. Ariyamaggacetanāyeva cettha kammapaccayataṃ labhati, na sesadhammā. Sahajātapaccayo sahajātapaccayattaṃ avijahantova hetuadhipatiaññamaññanissayakammavipākaāhāraindriyajhānamaggasampayuttavippayuttaatthiavigatānaṃ vasena aparehi cuddasahākārehi anekapaccayabhāvaṃ gacchati. Ayampi ukkaṭṭhaparicchedo vatthusahajātādīnaṃ pana vasenettha hetupaccayādīnaṃ abhāvopi veditabbo. Aññamaññapaccayepi eseva nayo."
    ],
    "innerText": "Anantarasamanantarapaccayā anantarasamanantarapaccayattaṃ avijahantāva upanissayakammaāsevananatthivigatānaṃ vasena aparehipi pañcahākārehi anekapaccayabhāvaṃ gacchanti. Ariyamaggacetanāyeva cettha kammapaccayataṃ labhati, na sesadhammā. Sahajātapaccayo sahajātapaccayattaṃ avijahantova hetuadhipatiaññamaññanissayakammavipākaāhāraindriyajhānamaggasampayuttavippayuttaatthiavigatānaṃ vasena aparehi cuddasahākārehi anekapaccayabhāvaṃ gacchati. Ayampi ukkaṭṭhaparicchedo vatthusahajātādīnaṃ pana vasenettha hetupaccayādīnaṃ abhāvopi veditabbo. Aññamaññapaccayepi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nissayapaccayo nissayapaccayattaṃ avijahantova catuvīsatiyā paccayesu attano nissayapaccayattañceva anantarasamanantarapacchājātaāsevananatthivigatapaccaye ca cha apanetvā sesānaṃ vasena aparehipi sattarasahākārehi anekapaccayabhāvaṃ gacchati. Ayampi ukkaṭṭhaparicchedova vatthunissayādīnaṃ pana vasenettha hetupaccayādīnaṃ ābhāvopi veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Upanissayapaccaye ārammaṇūpanissayo ārammaṇādhipatisadiso. Anantarūpanissayo anantarūpanissayapaccayattaṃ avijahantova anantarasamanantarakammaāsevananatthivigatānaṃ vasena aparehipi chahākārehi anekapaccayabhāvaṃ gacchati. Ariyamaggacetanāyeva cettha kammapaccayataṃ labhati, na sesadhammā. Pakatūpanissayo pakatūpanissayova. Purejātapaccayo attano purejātapaccayattaṃ avijahantova ārammaṇaārammaṇādhipatinissayaupanissayaindriyavippayuttaatthiavigatānaṃ vasena aparehipi ",
      " aṭṭhahākārehi anekapaccayabhāvaṃ gacchati. Ayampi ukkaṭṭhaniddesova ārammaṇapurejāte panettha nissayaindriyavippayuttapaccayatā na labbhati. Ito uttaripi labbhamānālabbhamānaṃ veditabbaṃ. Pacchājātapaccayo attano pacchājātapaccayabhāvaṃ avijahantova vippayuttaatthiavigatānaṃ vasena aparehipi tīhākārehi anekapaccayabhāvaṃ gacchati. Āsevanapaccayo āsevanapaccayattaṃ avijahantova anantarasamanantaraupanissayanatthivigatānaṃ vasena aparehipi pañcahākārehi anekapaccayabhāvaṃ gacchati."
    ],
    "innerText": "Upanissayapaccaye ārammaṇūpanissayo ārammaṇādhipatisadiso. Anantarūpanissayo anantarūpanissayapaccayattaṃ avijahantova anantarasamanantarakammaāsevananatthivigatānaṃ vasena aparehipi chahākārehi anekapaccayabhāvaṃ gacchati. Ariyamaggacetanāyeva cettha kammapaccayataṃ labhati, na sesadhammā. Pakatūpanissayo pakatūpanissayova. Purejātapaccayo attano purejātapaccayattaṃ avijahantova ārammaṇaārammaṇādhipatinissayaupanissayaindriyavippayuttaatthiavigatānaṃ vasena aparehipi aṭṭhahākārehi anekapaccayabhāvaṃ gacchati. Ayampi ukkaṭṭhaniddesova ārammaṇapurejāte panettha nissayaindriyavippayuttapaccayatā na labbhati. Ito uttaripi labbhamānālabbhamānaṃ veditabbaṃ. Pacchājātapaccayo attano pacchājātapaccayabhāvaṃ avijahantova vippayuttaatthiavigatānaṃ vasena aparehipi tīhākārehi anekapaccayabhāvaṃ gacchati. Āsevanapaccayo āsevanapaccayattaṃ avijahantova anantarasamanantaraupanissayanatthivigatānaṃ vasena aparehipi pañcahākārehi anekapaccayabhāvaṃ gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kammapaccayo kammapaccayattaṃ avijahantova ekakkhaṇiko tāva sahajātaaññamaññanissayavipākaāhārasampayuttavippayuttaatthiavigatānaṃ vasena aparehipi navahākārehi anekapaccayabhāvaṃ gacchati. Nānākkhaṇiko upanissayaanantarasamanantaranatthivigatānaṃ vasena aparehipi pañcahākārehi anekapaccayabhāvaṃ gacchati. Vipākapaccayo ",
      " vipākapaccayattaṃ avijahantova hetuadhipatisahajātaaññamaññanissayakammaāhāraindriyajhānamaggasampayuttavippayuttaatthiavigatānaṃ vasena aparehipi cuddasahākārehi anekapaccayabhāvaṃ gacchati. Āhārapaccaye kabaḷīkāro āhāro āhārapaccayattaṃ avijahantova atthiavigatānaṃ vasena aparehipi dvīhākārehi anekapaccayabhāvaṃ gacchati. Sesā tayo āhārapaccayattaṃ avijahantāva yathānurūpaṃ adhipatisahajātaaññamaññanissayakammavipākaindriyasampayuttavippayuttaatthiavigatānaṃ vasena aparehipi ekādasahākārehi anekapaccayabhāvaṃ gacchanti."
    ],
    "innerText": "Kammapaccayo kammapaccayattaṃ avijahantova ekakkhaṇiko tāva sahajātaaññamaññanissayavipākaāhārasampayuttavippayuttaatthiavigatānaṃ vasena aparehipi navahākārehi anekapaccayabhāvaṃ gacchati. Nānākkhaṇiko upanissayaanantarasamanantaranatthivigatānaṃ vasena aparehipi pañcahākārehi anekapaccayabhāvaṃ gacchati. Vipākapaccayo vipākapaccayattaṃ avijahantova hetuadhipatisahajātaaññamaññanissayakammaāhāraindriyajhānamaggasampayuttavippayuttaatthiavigatānaṃ vasena aparehipi cuddasahākārehi anekapaccayabhāvaṃ gacchati. Āhārapaccaye kabaḷīkāro āhāro āhārapaccayattaṃ avijahantova atthiavigatānaṃ vasena aparehipi dvīhākārehi anekapaccayabhāvaṃ gacchati. Sesā tayo āhārapaccayattaṃ avijahantāva yathānurūpaṃ adhipatisahajātaaññamaññanissayakammavipākaindriyasampayuttavippayuttaatthiavigatānaṃ vasena aparehipi ekādasahākārehi anekapaccayabhāvaṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Indriyapaccaye rūpino pañcindriyā indriyapaccayattaṃ avijahantāva nissayapurejātavippayuttaatthiavigatānaṃ vasena aparehipi pañcahākārehi anekapaccayabhāvaṃ gacchanti. Rūpajīvitindriyampi indriyapaccayattaṃ avijahantaññeva atthiavigatānaṃ vasena aparehipi dvīhākārehi anekapaccayabhāvaṃ gacchati. Arūpino indriyānipi yathānurūpaṃ indriyapaccayattaṃ avijahantāneva hetuadhipatisahajātaaññamaññanissayavipākaāhārajhānamaggasampayuttavippayuttaatthiavigatānaṃ vasena aparehipi terasahākārehi anekapaccayabhāvaṃ gacchanti. Jhānapaccayo jhānapaccayattaṃ avijahantova yathānurūpaṃ ",
      " sahajātaaññamaññanissayavipākaindriyamaggasampayuttavippayuttaatthiavigatānaṃ vasena aparehipi dasahākārehi anekapaccayabhāvaṃ gacchati. Maggapaccayo maggapaccayattaṃ avijahantova yathānurūpaṃ jhānapaccaye vuttānaṃ dasannaṃ hetuadhipatīnañcāti imesaṃ vasena aparehipi dvādasahākārehi anekapaccayabhāvaṃ gacchati."
    ],
    "innerText": "Indriyapaccaye rūpino pañcindriyā indriyapaccayattaṃ avijahantāva nissayapurejātavippayuttaatthiavigatānaṃ vasena aparehipi pañcahākārehi anekapaccayabhāvaṃ gacchanti. Rūpajīvitindriyampi indriyapaccayattaṃ avijahantaññeva atthiavigatānaṃ vasena aparehipi dvīhākārehi anekapaccayabhāvaṃ gacchati. Arūpino indriyānipi yathānurūpaṃ indriyapaccayattaṃ avijahantāneva hetuadhipatisahajātaaññamaññanissayavipākaāhārajhānamaggasampayuttavippayuttaatthiavigatānaṃ vasena aparehipi terasahākārehi anekapaccayabhāvaṃ gacchanti. Jhānapaccayo jhānapaccayattaṃ avijahantova yathānurūpaṃ sahajātaaññamaññanissayavipākaindriyamaggasampayuttavippayuttaatthiavigatānaṃ vasena aparehipi dasahākārehi anekapaccayabhāvaṃ gacchati. Maggapaccayo maggapaccayattaṃ avijahantova yathānurūpaṃ jhānapaccaye vuttānaṃ dasannaṃ hetuadhipatīnañcāti imesaṃ vasena aparehipi dvādasahākārehi anekapaccayabhāvaṃ gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sampayuttapaccayo sampayuttapaccayattaṃ avijahantova yathānurūpaṃ hetuadhipatisahajātaaññamaññanissayakammavipākaāhāraindriyajhānamaggaatthiavigatānaṃ vasena aparehipi terasahākārehi anekapaccayabhāvaṃ gacchati. Vippayuttapaccayo vippayuttapaccayattaṃ avijahantova anantarasamanantaraāsevanasampayuttanatthivigatasaṅkhāte cha paccaye apanetvā sesānaṃ vasena yathānurūpaṃ aparehipi sattarasahākārehi anekapaccayabhāvaṃ gacchati. Tattha rūpassa ca arūpassa ca paccayavibhāgo veditabbo. Atthipaccayo atthipaccayattaṃ avijahantova anantarasamanantaraāsevananatthivigatasaṅkhāte pañca paccaye apanetvā sesānaṃ vasena yathānurūpaṃ aparehi aṭṭhārasahākārehi anekapaccayabhāvaṃ gacchati. Natthipaccayavigatapaccayā anantarapaccayasadisā ",
      ". Avigatapaccayo atthipaccayasadisoyevāti evamettha ekapaccayassa anekapaccayabhāvatopi viññātabbo vinicchayo."
    ],
    "innerText": "Sampayuttapaccayo sampayuttapaccayattaṃ avijahantova yathānurūpaṃ hetuadhipatisahajātaaññamaññanissayakammavipākaāhāraindriyajhānamaggaatthiavigatānaṃ vasena aparehipi terasahākārehi anekapaccayabhāvaṃ gacchati. Vippayuttapaccayo vippayuttapaccayattaṃ avijahantova anantarasamanantaraāsevanasampayuttanatthivigatasaṅkhāte cha paccaye apanetvā sesānaṃ vasena yathānurūpaṃ aparehipi sattarasahākārehi anekapaccayabhāvaṃ gacchati. Tattha rūpassa ca arūpassa ca paccayavibhāgo veditabbo. Atthipaccayo atthipaccayattaṃ avijahantova anantarasamanantaraāsevananatthivigatasaṅkhāte pañca paccaye apanetvā sesānaṃ vasena yathānurūpaṃ aparehi aṭṭhārasahākārehi anekapaccayabhāvaṃ gacchati. Natthipaccayavigatapaccayā anantarapaccayasadisā . Avigatapaccayo atthipaccayasadisoyevāti evamettha ekapaccayassa anekapaccayabhāvatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccayasabhāgato"
      },
      "ti etesu hi catuvīsatiyā paccayesu anantarasamanantaraanantarūpanissayaāsevananatthivigatā sabhāgā, tathā ārammaṇaārammaṇādhipatiārammaṇūpanissayāti iminā upāyenettha paccayasabhāgatopi viññātabbo vinicchayo."
    ],
    "innerText": "Paccayasabhāgatoti etesu hi catuvīsatiyā paccayesu anantarasamanantaraanantarūpanissayaāsevananatthivigatā sabhāgā, tathā ārammaṇaārammaṇādhipatiārammaṇūpanissayāti iminā upāyenettha paccayasabhāgatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccayavisabhāgato"
      },
      "ti purejātapaccayo panettha pacchājātapaccayena visabhāgo, tathā sampayuttapaccayo vippayuttapaccayena, atthipaccayo natthipaccayena, vigatapaccayo avigatapaccayenāti iminā upāyenettha paccayavisabhāgatopi viññātabbo vinicchayo."
    ],
    "innerText": "Paccayavisabhāgatoti purejātapaccayo panettha pacchājātapaccayena visabhāgo, tathā sampayuttapaccayo vippayuttapaccayena, atthipaccayo natthipaccayena, vigatapaccayo avigatapaccayenāti iminā upāyenettha paccayavisabhāgatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yugaḷakato"
      },
      "ti etesu ca atthasarikkhatāya, saddasarikkhatāya, kālapaṭipakkhatāya, hetuphalatāya, aññamaññapaṭipakkhatāyāti imehi kāraṇehi yugaḷakato viññātabbo vinicchayo. Anantarasamanantarā hi atthasarikkhatāya ekaṃ yugaḷakaṃ nāma; nissayūpanissayā saddasarikkhatāya, purejātapacchājātā ",
      " kālapaṭipakkhatāya, kammapaccayavipākapaccayā hetuphalatāya, sampayuttavippayuttapaccayā aññamaññapaṭipakkhatāya ekaṃ yugaḷakaṃ nāma, tathā atthinatthipaccayā, vigatāvigatapaccayā cāti evamettha yugaḷakatopi viññātabbo vinicchayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Janakājanakato"
      },
      "ti etesu ca anantarasamanantarānantarūpanissayapakatūpanissayāsevanapaccayā nānākkhaṇiko, kammapaccayo, natthivigatapaccayāti ime paccayā janakāyeva, na ajanakā. Pacchājātapaccayo kevalaṃ upatthambhakoyeva, na janako. Sesā janakā ca ajanakā ca upatthambhakā cāti attho. Evamettha janakājanakatopi viññātabbo vinicchayo."
    ],
    "innerText": "Yugaḷakatoti etesu ca atthasarikkhatāya, saddasarikkhatāya, kālapaṭipakkhatāya, hetuphalatāya, aññamaññapaṭipakkhatāyāti imehi kāraṇehi yugaḷakato viññātabbo vinicchayo. Anantarasamanantarā hi atthasarikkhatāya ekaṃ yugaḷakaṃ nāma; nissayūpanissayā saddasarikkhatāya, purejātapacchājātā kālapaṭipakkhatāya, kammapaccayavipākapaccayā hetuphalatāya, sampayuttavippayuttapaccayā aññamaññapaṭipakkhatāya ekaṃ yugaḷakaṃ nāma, tathā atthinatthipaccayā, vigatāvigatapaccayā cāti evamettha yugaḷakatopi viññātabbo vinicchayo. Janakājanakatoti etesu ca anantarasamanantarānantarūpanissayapakatūpanissayāsevanapaccayā nānākkhaṇiko, kammapaccayo, natthivigatapaccayāti ime paccayā janakāyeva, na ajanakā. Pacchājātapaccayo kevalaṃ upatthambhakoyeva, na janako. Sesā janakā ca ajanakā ca upatthambhakā cāti attho. Evamettha janakājanakatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaṭṭhānikāsabbaṭṭhānikato"
      },
      "ti etesu ca sahajātanissayaatthiavigatapaccayā sabbaṭṭhānikā nāma, sabbesaṃ saṅkhatānaṃ rūpārūpadhammānaṃ ṭhānabhūtā kāraṇabhūtāti attho. Etehi vinā uppajjamāno ekadhammopi natthīti. Ārammaṇaārammaṇādhipatianantarasamanantarānantarūpanissayapakatūpanissayāsevanasampayuttanatthivigatapaccayā asabbaṭṭhānikā nāma. Na sabbesaṃ rūpārūpadhammānaṃ ṭhānabhūtā, arūpakkhandhānaññeva pana ṭhānabhūtā kāraṇabhūtāti attho. Arūpadhammāyeva hi etehi uppajjanti, na rūpadhammā. Purejātapacchājātāpi asabbaṭṭhānikā arūparūpānaññeva ",
      " yathākkamena paccayabhāvato. Vuttāvasesāpi ekaccānaṃ rūpārūpadhammānaṃ uppattihetuto na sabbaṭṭhānikāti evamettha sabbaṭṭhānikā sabbaṭṭhānikatopi viññātabbo vinicchayo."
    ],
    "innerText": "Sabbaṭṭhānikāsabbaṭṭhānikatoti etesu ca sahajātanissayaatthiavigatapaccayā sabbaṭṭhānikā nāma, sabbesaṃ saṅkhatānaṃ rūpārūpadhammānaṃ ṭhānabhūtā kāraṇabhūtāti attho. Etehi vinā uppajjamāno ekadhammopi natthīti. Ārammaṇaārammaṇādhipatianantarasamanantarānantarūpanissayapakatūpanissayāsevanasampayuttanatthivigatapaccayā asabbaṭṭhānikā nāma. Na sabbesaṃ rūpārūpadhammānaṃ ṭhānabhūtā, arūpakkhandhānaññeva pana ṭhānabhūtā kāraṇabhūtāti attho. Arūpadhammāyeva hi etehi uppajjanti, na rūpadhammā. Purejātapacchājātāpi asabbaṭṭhānikā arūparūpānaññeva yathākkamena paccayabhāvato. Vuttāvasesāpi ekaccānaṃ rūpārūpadhammānaṃ uppattihetuto na sabbaṭṭhānikāti evamettha sabbaṭṭhānikā sabbaṭṭhānikatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpaṃ rūpassātiādivikappato"
      },
      "ti etesu ca catuvīsatiyā paccayesu ekapaccayopi ekantena rūpameva hutvā rūpasseva paccayo nāma natthi, ekantena pana rūpaṃ hutvā arūpasseva paccayo nāma atthi. Kataro panesoti? Purejātapaccayo. Purejātapaccayo hi ekantena rūpameva hutvā arūpasseva paccayo hoti. Ekantena rūpameva hutvā rūpārūpasseva paccayo nāmātipi natthi, ekantena pana arūpaṃ hutvā arūpasseva paccayo nāma atthi. Kataro panesoti? Anantarasamanantaraāsevanasampayuttanatthivigatavasena chabbidho. So hi sabbopi ekantena arūpameva hutvā arūpasseva paccayo hoti. Ekantena arūpameva hutvāpi ekantena rūpasseva paccayo nāmātipi atthi. Kataro panesoti? Pacchājātapaccayo. So hi ekantena ",
      " arūpaṃ hutvā rūpasseva paccayo hoti; ekantena pana arūpadhammova hutvā rūpārūpānaṃ paccayopi atthi. Kataro panesoti? Hetukammavipākajhānamaggavasena pañcavidho. So hi sabbopi ekantena arūpameva hutvā rūpadhammānaṃ arūpadhammānampi paccayo hoti. Ekantena pana rūpārūpameva hutvā rūpasseva paccayo nāmātipi natthi, arūpasseva pana hoti. Kataro panesoti? Ārammaṇapaccayo ceva upanissayapaccayo ca. Idañhi dvayaṃ ekantena rūpārūpameva hutvā arūpasseva paccayo hoti. Ekantena rūpārūpameva hutvā pana rūpārūpasseva paccayo nāmātipi atthi. Kataro panesoti? Adhipatisahajātaaññamaññanissayaāhāraindriyavippayuttaatthiavigatavasena navavidho. So hi sabbopi ekantena rūpārūpameva hutvā rūpārūpasseva paccayo hotīti evamettha rūpaṃ rūpassātiādivikappatopi viññātabbo vinicchayo."
    ],
    "innerText": "Rūpaṃ rūpassātiādivikappatoti etesu ca catuvīsatiyā paccayesu ekapaccayopi ekantena rūpameva hutvā rūpasseva paccayo nāma natthi, ekantena pana rūpaṃ hutvā arūpasseva paccayo nāma atthi. Kataro panesoti? Purejātapaccayo. Purejātapaccayo hi ekantena rūpameva hutvā arūpasseva paccayo hoti. Ekantena rūpameva hutvā rūpārūpasseva paccayo nāmātipi natthi, ekantena pana arūpaṃ hutvā arūpasseva paccayo nāma atthi. Kataro panesoti? Anantarasamanantaraāsevanasampayuttanatthivigatavasena chabbidho. So hi sabbopi ekantena arūpameva hutvā arūpasseva paccayo hoti. Ekantena arūpameva hutvāpi ekantena rūpasseva paccayo nāmātipi atthi. Kataro panesoti? Pacchājātapaccayo. So hi ekantena arūpaṃ hutvā rūpasseva paccayo hoti; ekantena pana arūpadhammova hutvā rūpārūpānaṃ paccayopi atthi. Kataro panesoti? Hetukammavipākajhānamaggavasena pañcavidho. So hi sabbopi ekantena arūpameva hutvā rūpadhammānaṃ arūpadhammānampi paccayo hoti. Ekantena pana rūpārūpameva hutvā rūpasseva paccayo nāmātipi natthi, arūpasseva pana hoti. Kataro panesoti? Ārammaṇapaccayo ceva upanissayapaccayo ca. Idañhi dvayaṃ ekantena rūpārūpameva hutvā arūpasseva paccayo hoti. Ekantena rūpārūpameva hutvā pana rūpārūpasseva paccayo nāmātipi atthi. Kataro panesoti? Adhipatisahajātaaññamaññanissayaāhāraindriyavippayuttaatthiavigatavasena navavidho. So hi sabbopi ekantena rūpārūpameva hutvā rūpārūpasseva paccayo hotīti evamettha rūpaṃ rūpassātiādivikappatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavabhedato"
      },
      "ti imesu pana catuvīsatiyā paccayesu pañcavokārabhave tāva na koci paccayo na labbhati nāma. Catuvokārabhave pana tayo purejātapacchājātavippayuttapaccaye apanetvā sesā ekavīsatimeva labbhanti. Ekavokārabhave sahajātaaññamaññanissayakammaindriyaatthiavigatavasena satteva labbhanti. Bāhire pana anindriyabaddharūpe sahajātaaññamaññanissayaatthiavigatavasena pañceva labbhantīti evamettha bhavabhedatopi viññātabbo vinicchayoti."
    ],
    "innerText": "Bhavabhedatoti imesu pana catuvīsatiyā paccayesu pañcavokārabhave tāva na koci paccayo na labbhati nāma. Catuvokārabhave pana tayo purejātapacchājātavippayuttapaccaye apanetvā sesā ekavīsatimeva labbhanti. Ekavokārabhave sahajātaaññamaññanissayakammaindriyaatthiavigatavasena satteva labbhanti. Bāhire pana anindriyabaddharūpe sahajātaaññamaññanissayaatthiavigatavasena pañceva labbhantīti evamettha bhavabhedatopi viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccayaniddesavāravaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Pucchāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paccayānulomavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " anulomapaṭṭhānādīsu tikapaṭṭhānādivasena catuvīsatisamantapaṭṭhānasamodhāne paṭṭhānamahāpakaraṇe ye tikādayo nissāya niddiṭṭhattā etaṃ tikapaṭṭhānaṃ, dukapaṭṭhānaṃ…pe… dukadukapaṭṭhānanti vuttaṃ. Te anāmasitvā yesaṃ paccayānaṃ vasena te tikādayo vibhattā, te paccaye eva tāva iminā mātikānikkhepapaccayavibhaṅgasaṅkhātena vārena uddesato ca niddesato ca dassetvā, idāni ye tikādayo nissāya niddiṭṭhattā etaṃ tikapaṭṭhānaṃ, dukapaṭṭhānaṃ…pe… dukadukapaṭṭhānanti vuttaṃ. Te ",
      " tikādayo imesaṃ paccayānaṃ vasena vitthāretvā dassetuṃ ekekaṃ tikadukaṃ nissāya sattahi mahāvārehi desanā katā. Tesaṃ imāni nāmāni – paṭiccavāro, sahajātavāro, paccayavāro, nissayavāro, saṃsaṭṭhavāro, sampayuttavāro, pañhāvāroti."
    ],
    "innerText": "Evaṃ anulomapaṭṭhānādīsu tikapaṭṭhānādivasena catuvīsatisamantapaṭṭhānasamodhāne paṭṭhānamahāpakaraṇe ye tikādayo nissāya niddiṭṭhattā etaṃ tikapaṭṭhānaṃ, dukapaṭṭhānaṃ…pe… dukadukapaṭṭhānanti vuttaṃ. Te anāmasitvā yesaṃ paccayānaṃ vasena te tikādayo vibhattā, te paccaye eva tāva iminā mātikānikkhepapaccayavibhaṅgasaṅkhātena vārena uddesato ca niddesato ca dassetvā, idāni ye tikādayo nissāya niddiṭṭhattā etaṃ tikapaṭṭhānaṃ, dukapaṭṭhānaṃ…pe… dukadukapaṭṭhānanti vuttaṃ. Te tikādayo imesaṃ paccayānaṃ vasena vitthāretvā dassetuṃ ekekaṃ tikadukaṃ nissāya sattahi mahāvārehi desanā katā. Tesaṃ imāni nāmāni – paṭiccavāro, sahajātavāro, paccayavāro, nissayavāro, saṃsaṭṭhavāro, sampayuttavāro, pañhāvāroti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo’’ti evaṃ paṭiccābhidhānavasena vutto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭiccavāro"
      },
      " nāma. Kusalaṃ dhammaṃ sahajāto kusalo dhammo’’ti evaṃ sahajātābhidhānavasena vutto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahajātavāro"
      },
      " nāma. So purimena paṭiccavārena atthato ninnānākaraṇo. Paṭiccābhidhānavasena bujjhanakānaṃ vasena pana paṭhamo vutto, sahajātābhidhānavasena bujjhanakānaṃ vasena dutiyo. Dvīsupi cetesu rūpārūpadhammavasena paccayā ceva paccayuppannadhammā ca veditabbā. Te ca kho sahajātāva, na purejātapacchājātā labbhanti. ‘‘Kusalaṃ dhammaṃ paccayā kusalo dhammo’’ti evaṃ paccayābhidhānavasena vutto pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccayavāro"
      },
      " nāma. Sopi purimavāradvayaṃ viya rūpārūpadhammavaseneva veditabbo. Paccayo panettha purejātopi labbhati. Ayamassa purimavāradvayato viseso. Tadanantaro ‘‘kusalaṃ dhammaṃ nissāya kusalo dhammo’’ti evaṃ nissayābhidhānavasena vutto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissayavāro"
      },
      " nāma. So purimena paccayavārena atthato ninnānākaraṇo. Paccayābhidhānavasena bujjhanakānaṃ vasena pana paṭhamo vutto, nissayābhidhānavasena bujjhanakānaṃ vasena dutiyo. Tato paraṃ ‘‘kusalaṃ dhammaṃ saṃsaṭṭho kusalo dhammo’’ti evaṃ saṃsaṭṭhābhidhānavasena vutto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃsaṭṭhavāro"
      },
      " nāma. ‘‘Kusalaṃ dhammaṃ sampayutto kusalo dhammo’’ti evaṃ sampayuttābhidhānavasena vutto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampayuttavāro"
      },
      " nāma. So purimena saṃsaṭṭhavārena atthato ninnānākaraṇo. Saṃsaṭṭhābhidhānavasena bujjhanakānaṃ vasena pana paṭhamo vutto, sampayuttābhidhānavasena ",
      " dutiyo. Dvīsupi cetesu arūpadhammavaseneva paccayā paccayuppannā ca veditabbā. Sattamavāre pana yasmā ‘‘kusalo dhammo kusalassa dhammassa hetupaccayena paccayo’’tiādinā nayena te te pañhe uddharitvā puna ‘‘kusalā hetū sampayuttakānaṃ khandhāna’’ntiādinā nayena sabbepi te pañhā nijjaṭā niggumbā ca katvā vibhattā, tasmā so vāro pañhānaṃ sādhukaṃ vibhattattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañhāvāro"
      },
      "tveva saṅkhyaṃ gato. Rūpārūpadhammavaseneva panettha paccayāpi paccayuppannāpi veditabbā."
    ],
    "innerText": "Tattha ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo’’ti evaṃ paṭiccābhidhānavasena vutto paṭiccavāro nāma. Kusalaṃ dhammaṃ sahajāto kusalo dhammo’’ti evaṃ sahajātābhidhānavasena vutto sahajātavāro nāma. So purimena paṭiccavārena atthato ninnānākaraṇo. Paṭiccābhidhānavasena bujjhanakānaṃ vasena pana paṭhamo vutto, sahajātābhidhānavasena bujjhanakānaṃ vasena dutiyo. Dvīsupi cetesu rūpārūpadhammavasena paccayā ceva paccayuppannadhammā ca veditabbā. Te ca kho sahajātāva, na purejātapacchājātā labbhanti. ‘‘Kusalaṃ dhammaṃ paccayā kusalo dhammo’’ti evaṃ paccayābhidhānavasena vutto pana paccayavāro nāma. Sopi purimavāradvayaṃ viya rūpārūpadhammavaseneva veditabbo. Paccayo panettha purejātopi labbhati. Ayamassa purimavāradvayato viseso. Tadanantaro ‘‘kusalaṃ dhammaṃ nissāya kusalo dhammo’’ti evaṃ nissayābhidhānavasena vutto nissayavāro nāma. So purimena paccayavārena atthato ninnānākaraṇo. Paccayābhidhānavasena bujjhanakānaṃ vasena pana paṭhamo vutto, nissayābhidhānavasena bujjhanakānaṃ vasena dutiyo. Tato paraṃ ‘‘kusalaṃ dhammaṃ saṃsaṭṭho kusalo dhammo’’ti evaṃ saṃsaṭṭhābhidhānavasena vutto saṃsaṭṭhavāro nāma. ‘‘Kusalaṃ dhammaṃ sampayutto kusalo dhammo’’ti evaṃ sampayuttābhidhānavasena vutto sampayuttavāro nāma. So purimena saṃsaṭṭhavārena atthato ninnānākaraṇo. Saṃsaṭṭhābhidhānavasena bujjhanakānaṃ vasena pana paṭhamo vutto, sampayuttābhidhānavasena dutiyo. Dvīsupi cetesu arūpadhammavaseneva paccayā paccayuppannā ca veditabbā. Sattamavāre pana yasmā ‘‘kusalo dhammo kusalassa dhammassa hetupaccayena paccayo’’tiādinā nayena te te pañhe uddharitvā puna ‘‘kusalā hetū sampayuttakānaṃ khandhāna’’ntiādinā nayena sabbepi te pañhā nijjaṭā niggumbā ca katvā vibhattā, tasmā so vāro pañhānaṃ sādhukaṃ vibhattattā pañhāvārotveva saṅkhyaṃ gato. Rūpārūpadhammavaseneva panettha paccayāpi paccayuppannāpi veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " yo tāva esa sabbapaṭhamo paṭiccavāro nāma, so uddesato niddesato ca duvidho hoti. Tattha uddesavāro paṭhamo, pucchāvārotipi vuccati. Paṇṇattivārotipi tasseva nāmaṃ. So hi kusalādayo paṭicca kusalādīnaṃ hetupaccayādīnaṃ vasena uddiṭṭhattā uddesavāro, kusalādayo paṭicca hetupaccayādivasena kusalādīnaṃ uppattiyā pucchitattā pucchāvāro, kusalādayo paṭicca hetupaccayādivasena kusalādīnaṃ uppattiyā paññāpitattā paṇṇattivārotipi vutto."
    ],
    "innerText": "Tattha yo tāva esa sabbapaṭhamo paṭiccavāro nāma, so uddesato niddesato ca duvidho hoti. Tattha uddesavāro paṭhamo, pucchāvārotipi vuccati. Paṇṇattivārotipi tasseva nāmaṃ. So hi kusalādayo paṭicca kusalādīnaṃ hetupaccayādīnaṃ vasena uddiṭṭhattā uddesavāro, kusalādayo paṭicca hetupaccayādivasena kusalādīnaṃ uppattiyā pucchitattā pucchāvāro, kusalādayo paṭicca hetupaccayādivasena kusalādīnaṃ uppattiyā paññāpitattā paṇṇattivārotipi vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25-34"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā"
      },
      "ti parikappapucchā. Ayañhettha attho – yo kusalo dhammo uppajjeyya hetupaccayā, kiṃ so kusalaṃ dhammaṃ paṭicca siyāti atha vā kusalaṃ dhammaṃ paṭicca yo kusalo dhammo uppajjeyya, so hetupaccayā siyāti ayamettha attho. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭī"
      },
      "ti sadisatthe vattati. Sadisapuggalo hi paṭipuggalo, sadisabhāgo ca paṭibhāgoti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iccā"
      },
      "ti gamanussukkavacanametaṃ. Ubhayaṃ ekato katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭiccā"
      },
      "ti paṭigantvā sahuppattisaṅkhātena sadisabhāvena patvā, tena saddhiṃ ekato uppattibhāvaṃ upagantvāti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalo dhammo"
      },
      "ti evaṃ sahuppattibhāvena kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayāti pucchati. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭiccā"
      },
      "ti paccayaṃ katvā. Taṃ pana paccayakaraṇaṃ purejātepi paccaye labbhati sahajātepi. Idha sahajātaṃ adhippetaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siyā kusalaṃ dhammaṃ paṭicca akusalo"
      },
      "tiādīsupi eseva nayo. Tattha kiñcāpi sahajātavasena kusalaṃ dhammaṃ paṭicca akusalo natthi, imasmiṃ pana pucchāvāre yampi vissajjiyamānaṃ atthato labbhati, yampi na labbhati, taṃ sabbaṃ pucchāvasena uddhaṭaṃ. Parato pana vissajjane yaṃ na labbhati, taṃ pahāya yaṃ labbhati, tadeva vissajjitaṃ."
    ],
    "innerText": "25-34. Tattha siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayāti parikappapucchā. Ayañhettha attho – yo kusalo dhammo uppajjeyya hetupaccayā, kiṃ so kusalaṃ dhammaṃ paṭicca siyāti atha vā kusalaṃ dhammaṃ paṭicca yo kusalo dhammo uppajjeyya, so hetupaccayā siyāti ayamettha attho. Tattha paṭīti sadisatthe vattati. Sadisapuggalo hi paṭipuggalo, sadisabhāgo ca paṭibhāgoti vuccati. Iccāti gamanussukkavacanametaṃ. Ubhayaṃ ekato katvā paṭiccāti paṭigantvā sahuppattisaṅkhātena sadisabhāvena patvā, tena saddhiṃ ekato uppattibhāvaṃ upagantvāti vuttaṃ hoti. Kusalo dhammoti evaṃ sahuppattibhāvena kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayāti pucchati. Atha vā paṭiccāti paccayaṃ katvā. Taṃ pana paccayakaraṇaṃ purejātepi paccaye labbhati sahajātepi. Idha sahajātaṃ adhippetaṃ. Siyā kusalaṃ dhammaṃ paṭicca akusalotiādīsupi eseva nayo. Tattha kiñcāpi sahajātavasena kusalaṃ dhammaṃ paṭicca akusalo natthi, imasmiṃ pana pucchāvāre yampi vissajjiyamānaṃ atthato labbhati, yampi na labbhati, taṃ sabbaṃ pucchāvasena uddhaṭaṃ. Parato pana vissajjane yaṃ na labbhati, taṃ pahāya yaṃ labbhati, tadeva vissajjitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evamettha pucchānaṃ atthañceva pucchāgatiñca ñatvā idāni gaṇanavasena pucchāparicchedo veditabbo ",
      ". Ettha hi ‘‘kusalaṃ dhammaṃ paṭiccā’’ti kusalapadaṃ ādiṃ katvā kusalākusalābyākatantā tisso pucchā, puna tadevādiṃ katvā kusalābyākatādivasena dukappabhedantā tisso, puna tadevādiṃ katvā tikantā ca ekā, evaṃ kusalaṃ dhammaṃ paṭiccāti kusalādikā ",
      " satta pucchā, tathā akusalādikā, tathā abyākatādikā, tathā kusalābyākatādikā, akusalābyākatādikā, kusalākusalādikā, kusalākusalābyākatādikāti sabbāpi sattannaṃ sattakānaṃ vasena kusalattikaṃ nissāya hetupaccaye ekūnapaññāsaṃ pucchā."
    ],
    "innerText": "Evamettha pucchānaṃ atthañceva pucchāgatiñca ñatvā idāni gaṇanavasena pucchāparicchedo veditabbo . Ettha hi ‘‘kusalaṃ dhammaṃ paṭiccā’’ti kusalapadaṃ ādiṃ katvā kusalākusalābyākatantā tisso pucchā, puna tadevādiṃ katvā kusalābyākatādivasena dukappabhedantā tisso, puna tadevādiṃ katvā tikantā ca ekā, evaṃ kusalaṃ dhammaṃ paṭiccāti kusalādikā satta pucchā, tathā akusalādikā, tathā abyākatādikā, tathā kusalābyākatādikā, akusalābyākatādikā, kusalākusalādikā, kusalākusalābyākatādikāti sabbāpi sattannaṃ sattakānaṃ vasena kusalattikaṃ nissāya hetupaccaye ekūnapaññāsaṃ pucchā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha ekamūlakāvasānā nava, ekamūladukāvasānā nava, ekamūlatikāvasānā tisso, dukamūlaekāvasānā nava, dukamūladukāvasānā nava, dukamūlatikāvasānā tisso, tikamūlaekāvasānā tisso, tikamūladukāvasānā tisso, tikamūlatikāvasānā ekāti evametā mūlavasenāpi veditabbā. Yathā ca hetupaccaye ekūnapaññāsaṃ, ārammaṇapaccayādīsupi tathevāti sabbesupi catuvīsatiyā paccayesu –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sahassamekañca sataṃ, chasattati punāparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā sampiṇḍitā honti, nayamhi ekamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35-36"
      },
      ". Tato paraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetupaccayā ārammaṇapaccayā"
      },
      "ti dumūlakanayo āraddho. Tattha hetārammaṇaduko…pe… hetuavigatadukoti hetupaccayena saddhiṃ tevīsati dukā honti. Tesu hetupaccaye viya hetārammaṇadukepi ekūnapaññāsaṃ pucchā, tāsu pāḷiyaṃ dveyeva dassitā. Yathā ca hetārammaṇaduke ekūnapaññāsaṃ tathā hetādhipatidukādīsupi. Tattha paṭhamapucchāvasena hetādhipatiduko, hetānantaraduko, hetusamanantaradukoti paṭipāṭiyā tayo duke dassetvā pariyosāne hetuavigataduko dassito, sesaṃ saṅkhittaṃ. Pucchāparicchedo panettha evaṃ veditabbo."
    ],
    "innerText": "35-36. Tato paraṃ hetupaccayā ārammaṇapaccayāti dumūlakanayo āraddho. Tattha hetārammaṇaduko…pe… hetuavigatadukoti hetupaccayena saddhiṃ tevīsati dukā honti. Tesu hetupaccaye viya hetārammaṇadukepi ekūnapaññāsaṃ pucchā, tāsu pāḷiyaṃ dveyeva dassitā. Yathā ca hetārammaṇaduke ekūnapaññāsaṃ tathā hetādhipatidukādīsupi. Tattha paṭhamapucchāvasena hetādhipatiduko, hetānantaraduko, hetusamanantaradukoti paṭipāṭiyā tayo duke dassetvā pariyosāne hetuavigataduko dassito, sesaṃ saṅkhittaṃ. Pucchāparicchedo panettha evaṃ veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sahassamekañca sataṃ, sattavīsatimeva ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dukesu tevīsatiyā, pucchā honti dumūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ". Tato paraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetupaccayā ārammaṇapaccayā adhipatipaccayā"
      },
      "ti timūlakanayo āraddho. Tattha ",
      " hetārammaṇadukena saddhiṃ adhipatipaccayādīsu bāvīsatiyā paccayesu ekamekassa yojanāvasena bāvīsati tikā honti. Tesu paṭhamapucchāvasena paṭhamattikañca dutiyattikañca dassetvā pariyosānatiko dassito, sesaṃ saṅkhittaṃ. Yathā pana ",
      " dukesu, evaṃ tikesupi ekamekasmiṃ tike ekūnapaññāsaṃ katvā sabbesupi bāvīsatiyā tikesu –"
    ],
    "innerText": "37. Tato paraṃ hetupaccayā ārammaṇapaccayā adhipatipaccayāti timūlakanayo āraddho. Tattha hetārammaṇadukena saddhiṃ adhipatipaccayādīsu bāvīsatiyā paccayesu ekamekassa yojanāvasena bāvīsati tikā honti. Tesu paṭhamapucchāvasena paṭhamattikañca dutiyattikañca dassetvā pariyosānatiko dassito, sesaṃ saṅkhittaṃ. Yathā pana dukesu, evaṃ tikesupi ekamekasmiṃ tike ekūnapaññāsaṃ katvā sabbesupi bāvīsatiyā tikesu –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sahassamekaṃ pucchānaṃ, aṭṭhasattatimeva ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, nayamhi tikamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "38"
      },
      ". Tato paraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetupaccayā ārammaṇapaccayā adhipatipaccayā anantarapaccayā"
      },
      "ti catumūlakanayo āraddho. Tattha paṭhamattikena saddhiṃ anantarapaccayādīsu ekavīsatiyā paccayesu ekamekassa yojanāvasena ekavīsati catukkā honti. Tesu dve catukke dassetvā sesaṃ saṅkhittaṃ. Idhāpi ekamekasmiṃ catukke ekūnapaññāsaṃ katvā sabbesupi ekavīsatiyā catukkesu –"
    ],
    "innerText": "38. Tato paraṃ hetupaccayā ārammaṇapaccayā adhipatipaccayā anantarapaccayāti catumūlakanayo āraddho. Tattha paṭhamattikena saddhiṃ anantarapaccayādīsu ekavīsatiyā paccayesu ekamekassa yojanāvasena ekavīsati catukkā honti. Tesu dve catukke dassetvā sesaṃ saṅkhittaṃ. Idhāpi ekamekasmiṃ catukke ekūnapaññāsaṃ katvā sabbesupi ekavīsatiyā catukkesu –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sahassamekaṃ pucchānaṃ, ekūnatiṃsa punāparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, nayamhi catumūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato paraṃ pañcamūlakaṃ ādiṃ katvā yāva sabbamūlakā desanā katā, taṃ sabbaṃ saṅkhipitvā heṭṭhā vuttañca upari vattabbañca ekato katvā pāḷiyaṃ ‘‘ekamūlakaṃ, dumūlakaṃ, timūlakaṃ, catumūlakaṃ, pañcamūlakaṃ, sabbamūlakaṃ asammuyhantena vitthāretabba’’nti nayo dassito. Tattha ekamūlakādīsu yaṃ vattabbaṃ, taṃ vuttameva. Pañcamūlake pana paṭhamacatukkena saddhiṃ samanantarapaccayādīsu samavīsatiyā paccayesu ekamekassa yojanāvasena samavīsati pañcakā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Satāni nava pucchānaṃ, asīti ca punāparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, nayamhi pañcamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Chamūlake paṭhamapañcakena saddhiṃ sahajātapaccayādīsu ekūnavīsatiyā paccayesu ekamekassa ",
      " yojanāvasena ekūnavīsati chakkā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
    ],
    "innerText": "Chamūlake paṭhamapañcakena saddhiṃ sahajātapaccayādīsu ekūnavīsatiyā paccayesu ekamekassa yojanāvasena ekūnavīsati chakkā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Satāni nava pucchānaṃ, ekatiṃsa tatoparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, nayamhi chakkamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sattamūlake ",
      " paṭhamachakkena saddhiṃ aññamaññapaccayādīsu aṭṭhārasasu paccayesu ekamekassa yojanāvasena aṭṭhārasa sattakā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
    ],
    "innerText": "Sattamūlake paṭhamachakkena saddhiṃ aññamaññapaccayādīsu aṭṭhārasasu paccayesu ekamekassa yojanāvasena aṭṭhārasa sattakā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Satāni aṭṭha pucchānaṃ, dvāsīti ca tatoparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, nayamhi sattamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Aṭṭhamūlake paṭhamasattakena saddhiṃ nissayapaccayādīsu sattarasasu paccayesu ekamekassa yojanāvasena sattarasa aṭṭhakā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Satāni aṭṭha pucchānaṃ, tettiṃsā ca tatoparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, nayamhi aṭṭhamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Navamūlake paṭhamaaṭṭhakena saddhiṃ upanissayapaccayādīsu soḷasasu paccayesu ekamekassa yojanāvasena soḷasa navakā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Satāni ",
      " satta pucchānaṃ, caturāsīti tatoparā;"
    ],
    "innerText": "Satāni satta pucchānaṃ, caturāsīti tatoparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, nayamhi navamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dasamūlake paṭhamanavakena saddhiṃ purejātapaccayādīsu pannarasasu paccayesu ekamekassa yojanāvasena pannarasa dasakā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Satāni satta pucchānaṃ, pañcatiṃsa tatoparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, nayamhi dasamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ekādasamūlake paṭhamadasakena saddhiṃ pacchājātapaccayādīsu cuddasasu paccayesu ekamekassa yojanāvasena cuddasa ekādasakā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Cha satāni ca pucchānaṃ, chaḷāsīti tatoparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nayamhi pucchā gaṇitā, ekādasakamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dvādasamūlake paṭhamaekādasakena saddhiṃ āsevanapaccayādīsu terasasu paccayesu ekamekassa yojanāvasena terasa dvādasakā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Cha ",
      " satāni ca pucchānaṃ, sattatiṃsa tatoparā;"
    ],
    "innerText": "Cha satāni ca pucchānaṃ, sattatiṃsa tatoparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, naye dvādasamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Terasamūlake paṭhamadvādasakena saddhiṃ kammapaccayādīsu dvādasasu paccayesu ekamekassa yojanāvasena dvādasa terasakā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Satāni pañca pucchānaṃ, aṭṭhāsīti punāparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, naye terasamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Cuddasamūlake paṭhamaterasakena saddhiṃ vipākapaccayādīsu ekādasasu paccayesu ekamekassa yojanāvasena ekādasa cuddasakā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Satāni pañca pucchānaṃ, tiṃsa cātha navāparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, naye cuddasamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pannarasamūlake ",
      " paṭhamacuddasakena saddhiṃ āhārapaccayādīsu dasasu paccayesu ekamekassa yojanāvasena dasa pannarasakā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
    ],
    "innerText": "Pannarasamūlake paṭhamacuddasakena saddhiṃ āhārapaccayādīsu dasasu paccayesu ekamekassa yojanāvasena dasa pannarasakā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Satāni cattāri pucchānaṃ, navuti ca tatoparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, naye pannarasamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Soḷasamūlake paṭhamapannarasakena saddhiṃ indriyapaccayādīsu navasu paccayesu ekamekassa yojanāvasena nava soḷasakā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Satāni cattāri cattā-līsekā ceva punāparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, naye soḷasamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sattarasamūlake paṭhamasoḷasakena saddhiṃ jhānapaccayādīsu aṭṭhasu paccayesu ekamekassa yojanāvasena aṭṭha sattarasakā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Satāni tīṇi pucchānaṃ, navuti dve punāparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, naye sattarasamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aṭṭhārasamūlake ",
      " paṭhamasattarasakena saddhiṃ maggapaccayādīsu sattasu paccayesu ekamekassa yojanāvasena satta aṭṭhārasakā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
    ],
    "innerText": "Aṭṭhārasamūlake paṭhamasattarasakena saddhiṃ maggapaccayādīsu sattasu paccayesu ekamekassa yojanāvasena satta aṭṭhārasakā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Satāni tīṇi pucchānaṃ, tecattārīsameva ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, naye aṭṭhārasamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ekūnavīsatimūlake paṭhamaaṭṭhārasakena saddhiṃ sampayuttapaccayādīsu chasu paccayesu ekamekassa yojanāvasena cha ekūnavīsatikā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Dve ",
      " satā navuti ceva, catasso ca punāparā;"
    ],
    "innerText": "Dve satā navuti ceva, catasso ca punāparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, naye ekūnavīsatike."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vīsatimūlake paṭhamaekūnavīsatikena saddhiṃ vippayuttapaccayādīsu pañcasu paccayesu ekamekassa yojanāvasena pañcavīsatikā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dve satā honti pucchānaṃ, cattālīsā ca pañca ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, naye vīsatimūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ekavīsatimūlake paṭhamavīsatikena saddhiṃ atthipaccayādīsu catūsu paccayesu ekamekassa yojanāvasena cattāro ekavīsatikā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sataṃ chanavuti ceva, pucchā honti sampiṇḍitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gaṇitā lakkhaṇaññūhi, ekavīsatike naye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dvāvīsatimūlake paṭhamaekavīsatikena saddhiṃ natthipaccayādīsu tīsu paccayesu ekamekassa yojanāvasena tayo dvāvīsatikā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Cattālīsādhikaṃ sataṃ, satta ceva punāparā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā gaṇanato honti, naye dvāvīsatimūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tevīsatimūlake ",
      " paṭhamadvāvīsatikena saddhiṃ dvīsu vigatāvigatapaccayesu ekamekassa yojanāvasena dve tevīsatikā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
    ],
    "innerText": "Tevīsatimūlake paṭhamadvāvīsatikena saddhiṃ dvīsu vigatāvigatapaccayesu ekamekassa yojanāvasena dve tevīsatikā honti. Tesu ekamekasmiṃ ekūnapaññāsaṃ katvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Aṭṭhanavutimevidha, pucchā gaṇanato matā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nayamhi tevīsatime, tevīsatikamūlake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catuvīsatimūlako ",
      " pana sabbapaccayānaṃ samodhānavasena veditabbo, teneva sabbamūlakoti vutto. Tattha ekūnapaññāsameva pucchā hontīti sabbāpetā hetupaccayapadameva gahetvā ekamūlakādīnaṃ sabbamūlakapariyosānānaṃ vasena satthārā devaparisati vitthārato vibhattā pucchā idha saṅkhepena dassitā."
    ],
    "innerText": "Catuvīsatimūlako pana sabbapaccayānaṃ samodhānavasena veditabbo, teneva sabbamūlakoti vutto. Tattha ekūnapaññāsameva pucchā hontīti sabbāpetā hetupaccayapadameva gahetvā ekamūlakādīnaṃ sabbamūlakapariyosānānaṃ vasena satthārā devaparisati vitthārato vibhattā pucchā idha saṅkhepena dassitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tāsaṃ pana sabbāsampi ayaṃ gaṇanapiṇḍo – ekamūlakanayasmiñhi ekādasa satāni chasattati ca pucchā āgatā. Hetupaccayanaye teneva mūlakena ekūnapaññāsaṃ katvā imasmiṃ hetupaccayamūlake gahetabbā, sesā sesapaccayamūlakesu pakkhipitabbā. Dumūlake sattavīsāni ekādasa satāni, timūlake sahassaṃ aṭṭhasattati ca, catumūlake sahassaṃ ekūnatiṃsañca, pañcamūlake asītādhikāni nava satāni, chamūlake ekatiṃsāni nava satāni, sattamūlake dvāsītāni aṭṭha satāni, aṭṭhamūlake tettiṃsāni aṭṭha satāni, navamūlake caturāsītāni satta satāni, dasamūlake pañcatiṃsāni satta satāni, ekādasamūlake chāsītāni cha satāni, dvādasamūlake sattatiṃsāni cha satāni, terasamūlake aṭṭhāsītāni pañca satāni, cuddasamūlake ekūnacattālīsāni pañca satāni, pannarasamūlake navutāni cattāri satāni, soḷasamūlake ekacattālīsāni cattāri sattāni, sattarasamūlake dvānavutāni tīṇi satāni, aṭṭhārasamūlake tecattālīsāni tīṇi satāni, ekūnavīsatimūlake catunavutāni dve satāni, vīsatimūlake pañcacattālīsāni dve satāni, ekavīsatimūlake chanavutisataṃ, dvāvīsatimūlake sattacattālīsasataṃ, tevīsatimūlake aṭṭhanavuti, sabbamūlake ekūnapaññāsāti evaṃ hetupadaṃ ādiṃ katvā vibhattesu ekamūlakādīsu –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Cuddaseva sahassāni, puna satta satāni ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā hetupadasseva, ekamūlādibhedatoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "39-40"
      },
      ". Evaṃ ",
      " hetupaccayaṃ ādiṃ katvā ekamūlakato paṭṭhāya yāva sabbamūlakanayā pucchābhedaṃ dassetvā idāni ārammaṇapaccayaṃ ādiṃ katvā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya ārammaṇapaccayā hetupaccayā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇapaccayā hetupaccayā"
      },
      "ti ettāvatā ārammaṇapaccayaṃ ādiṃ katvā hetupaccayapariyosāno ekamūlakanayo dassito. Tato paraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇapaccayā adhipatipaccayā"
      },
      "ti dukamūlakaṃ āraddhaṃ. Tattha imaṃ paṭhamadukañceva ",
      " ārammaṇāvigatadukañca dassetvā sesaṃ saṅkhittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇapaccayā hetupaccayā"
      },
      "ti ayaṃ osānadukopi na dassito. Sace pana katthaci vācanāmagge sandissati, sveva vācanāmaggo gahetabbo. Tato paraṃ ārammaṇapaccayavasena tikamūlakādayo adassetvāva adhipatipaccayaṃ ādiṃ katvā ekakādayo dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhipatipaccayā, anantarapaccayā, samanantarapaccayā, sahajātapaccayā, aññamaññapaccayā"
      },
      "ti ettakameva vuttaṃ, taṃ ekamūlakavasena vā sabbamūlakavasena vā veditabbaṃ."
    ],
    "innerText": "39-40. Evaṃ hetupaccayaṃ ādiṃ katvā ekamūlakato paṭṭhāya yāva sabbamūlakanayā pucchābhedaṃ dassetvā idāni ārammaṇapaccayaṃ ādiṃ katvā dassetuṃ siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya ārammaṇapaccayā hetupaccayātiādimāha. Tattha ārammaṇapaccayā hetupaccayāti ettāvatā ārammaṇapaccayaṃ ādiṃ katvā hetupaccayapariyosāno ekamūlakanayo dassito. Tato paraṃ ārammaṇapaccayā adhipatipaccayāti dukamūlakaṃ āraddhaṃ. Tattha imaṃ paṭhamadukañceva ārammaṇāvigatadukañca dassetvā sesaṃ saṅkhittaṃ. Ārammaṇapaccayā hetupaccayāti ayaṃ osānadukopi na dassito. Sace pana katthaci vācanāmagge sandissati, sveva vācanāmaggo gahetabbo. Tato paraṃ ārammaṇapaccayavasena tikamūlakādayo adassetvāva adhipatipaccayaṃ ādiṃ katvā ekakādayo dassetuṃ adhipatipaccayā, anantarapaccayā, samanantarapaccayā, sahajātapaccayā, aññamaññapaccayāti ettakameva vuttaṃ, taṃ ekamūlakavasena vā sabbamūlakavasena vā veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ". Tato paraṃ avigatapaccayaṃ ādiṃ katvā dumūlakameva dassetuṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avigatapaccayā hetupaccayā"
      },
      "tiādi āraddhaṃ. Tattha avigatahetuduko, avigatārammaṇaduko, avigatādhipatidukoti paṭipāṭiyā tayo duke vatvā pariyosāne ca avigatavigataduko eko duko dassito. Tato avigatapaccayavaseneva timūlakaṃ dassetuṃ – ‘‘avigatapaccayā hetupaccayā ārammaṇapaccayā, avigatapaccayā hetupaccayā adhipatipaccayā, avigatapaccayā hetupaccayā anantarapaccayā’’ti evaṃ paṭipāṭiyā tayo tike vatvā ‘‘avigatapaccayā hetupaccayā vigatapaccayā’’ti pariyosānattiko vutto. Tato avigatapaccayavaseneva catumūlakaṃ dassetuṃ ‘‘avigatapaccayā hetupaccayā ārammaṇapaccayā adhipatipaccayā, avigatapaccayā hetupaccayā ārammaṇapaccayā anantarapaccayā’’ti dve catukke vatvā ‘‘vigatapaccayā’’ti padaṃ uddharitvā ṭhapitaṃ, sesaṃ sabbaṃ saṅkhittaṃ. Tassa saṅkhittabhāvaṃ dassetuṃ ‘‘ekekassa padassa ekamūlakaṃ, dumūlakaṃ, timūlakaṃ, sabbamūlakaṃ asammuyhantena vitthāretabba’’nti vuttaṃ. Tasmā yathā hetupaccayaṃ ādiṃ katvā hetuādipadavasena ekamūlake ekādasa pucchāsatāni chasattati ca pucchā…pe… sabbamūlake ekūnapaññāsaṃ, evaṃ ārammaṇapaccayādīsupi ekamekaṃ ādiṃ katvā ārammaṇādipadavasena ekamekassa ",
      " padassa ekamūlake ekādasa pucchāsatāni chasattati ca pucchā…pe… sabbamūlake ekūnapaññāsāti ekekassa padassa ekamūlakādibhede sattasatādhikāni cuddasa pucchā sahassāni honti. Tāsaṃ sabbesupi catuvīsatiyā paccayesu ayaṃ gaṇanaparicchedo –"
    ],
    "innerText": "41. Tato paraṃ avigatapaccayaṃ ādiṃ katvā dumūlakameva dassetuṃ – avigatapaccayā hetupaccayātiādi āraddhaṃ. Tattha avigatahetuduko, avigatārammaṇaduko, avigatādhipatidukoti paṭipāṭiyā tayo duke vatvā pariyosāne ca avigatavigataduko eko duko dassito. Tato avigatapaccayavaseneva timūlakaṃ dassetuṃ – ‘‘avigatapaccayā hetupaccayā ārammaṇapaccayā, avigatapaccayā hetupaccayā adhipatipaccayā, avigatapaccayā hetupaccayā anantarapaccayā’’ti evaṃ paṭipāṭiyā tayo tike vatvā ‘‘avigatapaccayā hetupaccayā vigatapaccayā’’ti pariyosānattiko vutto. Tato avigatapaccayavaseneva catumūlakaṃ dassetuṃ ‘‘avigatapaccayā hetupaccayā ārammaṇapaccayā adhipatipaccayā, avigatapaccayā hetupaccayā ārammaṇapaccayā anantarapaccayā’’ti dve catukke vatvā ‘‘vigatapaccayā’’ti padaṃ uddharitvā ṭhapitaṃ, sesaṃ sabbaṃ saṅkhittaṃ. Tassa saṅkhittabhāvaṃ dassetuṃ ‘‘ekekassa padassa ekamūlakaṃ, dumūlakaṃ, timūlakaṃ, sabbamūlakaṃ asammuyhantena vitthāretabba’’nti vuttaṃ. Tasmā yathā hetupaccayaṃ ādiṃ katvā hetuādipadavasena ekamūlake ekādasa pucchāsatāni chasattati ca pucchā…pe… sabbamūlake ekūnapaññāsaṃ, evaṃ ārammaṇapaccayādīsupi ekamekaṃ ādiṃ katvā ārammaṇādipadavasena ekamekassa padassa ekamūlake ekādasa pucchāsatāni chasattati ca pucchā…pe… sabbamūlake ekūnapaññāsāti ekekassa padassa ekamūlakādibhede sattasatādhikāni cuddasa pucchā sahassāni honti. Tāsaṃ sabbesupi catuvīsatiyā paccayesu ayaṃ gaṇanaparicchedo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dvāpaññāsasahassāna-ṭṭhasatāni tīṇi satasahassāni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kusalattikassa pucchā, anulomanayamhi suvibhattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā ",
      " ca kusalattikassa, evaṃ vedanāttikādīnampīti sabbesupi dvāvīsatiyā tikesu –"
    ],
    "innerText": "Yathā ca kusalattikassa, evaṃ vedanāttikādīnampīti sabbesupi dvāvīsatiyā tikesu –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ekasaṭṭhisahassāni, cha satāni sattasattati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Satasahassāni pucchānaṃ, tikabhede pabhedato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saṅkhittā vācanāmagge."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dukesu pana ‘‘siyā hetuṃ dhammaṃ paṭicca hetudhammo uppajjeyya hetupaccayā’’ti evaṃ hetuṃ paṭicca hetu, hetuṃ paṭicca nahetu, hetuṃ paṭicca hetu ca nahetu ca, nahetuṃ paṭicca nahetu, nahetuṃ paṭicca hetu, nahetuṃ paṭicca hetu ca nahetu ca, hetuñca nahetuñca paṭicca hetu, hetuñca nahetuñca paṭicca nahetu, hetuñca nahetuñca paṭicca hetu ca nahetu cāti ekamekasmiṃ duke hetupaccayādīsu ekamekasmiṃ paccaye nava pucchā honti. Tāsu hetupaccayaṃ ādiṃ katvā ekamūlake dvesatāni soḷasa ca pucchā honti. Tāsu hetupaccayasseva aññena asammissā nava pucchā gahetabbā, sesā aṭṭha vārena gahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tāsaṃ dukamūlakādīsu tevīsatiyā vāresu ekekaṃ navakaṃ apanetvā yāva sabbamūlakā ayaṃ gaṇanaparicchedo – dukamūlake tāva ekamūlake dassitesu dvīsu soḷasādhikesu pucchāsatesu nava apanetvā dvesatāni satta ca pucchā honti, tato nava apanetvā timūlake aṭṭhanavutisataṃ. Evaṃ purimapurimato nava nava apanetvā catumūlake ekūnanavutisataṃ, pañcamūlake asītisataṃ, chamūlake ekasattatisataṃ, sattamūlake dvāsaṭṭhisataṃ, aṭṭhamūlake tepaṇṇāsasataṃ, navamūlake ",
      " catucattālīsasataṃ, dasamūlake pañcatiṃsasataṃ, ekādasamūlake chabbīsasataṃ, dvādasamūlake sattarasādhikasataṃ, terasamūlake aṭṭhādhikasataṃ, cuddasamūlake navanavuti, pannarasamūlake navuti, soḷasamūlake ekāsīti, sattarasamūlake dvāsattati, aṭṭhārasamūlake tesaṭṭhi, ekūnavīsatimūlake catupaññāsaṃ, vīsatimūlake pañcacattālīsaṃ, ekavīsatimūlake chattiṃsaṃ, dvāvīsatimūlake sattavīsa, tevīsatimūlake aṭṭhārasa, sabbamūlake navāti. Yathā panetāni hetupaccayavasena ekamūlake soḷasādhikāni dve pucchāsatāni…pe… sabbamūlake nava, evaṃ ārammaṇapaccayādīsupi ekamekaṃ ādiṃ katvā ārammaṇādipadavasena ekekassa padassa ",
      " ekamūlake soḷasādhikāni dve pucchāsatāni…pe… sabbamūlake navāti ekekassa padassa ekamūlakādibhede dve pucchā sahassāni sattasatāni ca pucchā honti. Tāsaṃ sabbesupi catuvīsatiyā paccayesu ayaṃ gaṇanaparicchedo –"
    ],
    "innerText": "Tāsaṃ dukamūlakādīsu tevīsatiyā vāresu ekekaṃ navakaṃ apanetvā yāva sabbamūlakā ayaṃ gaṇanaparicchedo – dukamūlake tāva ekamūlake dassitesu dvīsu soḷasādhikesu pucchāsatesu nava apanetvā dvesatāni satta ca pucchā honti, tato nava apanetvā timūlake aṭṭhanavutisataṃ. Evaṃ purimapurimato nava nava apanetvā catumūlake ekūnanavutisataṃ, pañcamūlake asītisataṃ, chamūlake ekasattatisataṃ, sattamūlake dvāsaṭṭhisataṃ, aṭṭhamūlake tepaṇṇāsasataṃ, navamūlake catucattālīsasataṃ, dasamūlake pañcatiṃsasataṃ, ekādasamūlake chabbīsasataṃ, dvādasamūlake sattarasādhikasataṃ, terasamūlake aṭṭhādhikasataṃ, cuddasamūlake navanavuti, pannarasamūlake navuti, soḷasamūlake ekāsīti, sattarasamūlake dvāsattati, aṭṭhārasamūlake tesaṭṭhi, ekūnavīsatimūlake catupaññāsaṃ, vīsatimūlake pañcacattālīsaṃ, ekavīsatimūlake chattiṃsaṃ, dvāvīsatimūlake sattavīsa, tevīsatimūlake aṭṭhārasa, sabbamūlake navāti. Yathā panetāni hetupaccayavasena ekamūlake soḷasādhikāni dve pucchāsatāni…pe… sabbamūlake nava, evaṃ ārammaṇapaccayādīsupi ekamekaṃ ādiṃ katvā ārammaṇādipadavasena ekekassa padassa ekamūlake soḷasādhikāni dve pucchāsatāni…pe… sabbamūlake navāti ekekassa padassa ekamūlakādibhede dve pucchā sahassāni sattasatāni ca pucchā honti. Tāsaṃ sabbesupi catuvīsatiyā paccayesu ayaṃ gaṇanaparicchedo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Catusaṭṭhisahassāni, puna aṭṭhasatāni ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā hetudukasseva, anulomanaye matā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathā ca hetudukassa, evaṃ sahetukadukādīnampīti sabbasmimpi dukasate –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Saṭṭhi satasahassāni, cattāri ca tatoparaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Asīti ca sahassāni, pucchā dukasate vidū."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ tāva suddhike tikapaṭṭhāne ceva dukapaṭṭhāne ca pucchānaṃ gaṇanaparicchedo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yaṃ pana tato paraṃ dvāvīsati tike gahetvā dukasate pakkhipitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukatikapaṭṭhānaṃ"
      },
      " nāma desitaṃ, tattha ‘‘siyā hetuṃ kusalaṃ dhammaṃ paṭicca hetu kusalo dhammo uppajjeyya hetupaccayā’’ti evaṃ dvāvīsatiyā tikesu ekekaṃ tikaṃ dukānaṃ satena satena saddhiṃ yojetvā dassetabbānaṃ pucchānaṃ heṭṭhā vuttanayena sabbesaṃ ekamūlakādīnaṃ vasena gahetvā paricchedo veditabbo."
    ],
    "innerText": "Yaṃ pana tato paraṃ dvāvīsati tike gahetvā dukasate pakkhipitvā dukatikapaṭṭhānaṃ nāma desitaṃ, tattha ‘‘siyā hetuṃ kusalaṃ dhammaṃ paṭicca hetu kusalo dhammo uppajjeyya hetupaccayā’’ti evaṃ dvāvīsatiyā tikesu ekekaṃ tikaṃ dukānaṃ satena satena saddhiṃ yojetvā dassetabbānaṃ pucchānaṃ heṭṭhā vuttanayena sabbesaṃ ekamūlakādīnaṃ vasena gahetvā paricchedo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yampi tato paraṃ dukasataṃ gahetvā dvāvīsatiyā tikesu pakkhipitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikadukapaṭṭhānaṃ"
      },
      " nāma desitaṃ, tatthāpi ‘‘siyā kusalaṃ hetuṃ dhammaṃ paṭicca kusalo hetudhammo uppajjeyya hetupaccayā’’ti evaṃ dukasate ekekaṃ ",
      " dukaṃ dvāvīsatiyā tikehi saddhiṃ yojetvā dassetabbānaṃ pucchānaṃ heṭṭhā vuttanayena sabbesaṃ ekamūlakādīnaṃ vasena gahetvā paricchedo veditabbo."
    ],
    "innerText": "Yampi tato paraṃ dukasataṃ gahetvā dvāvīsatiyā tikesu pakkhipitvā tikadukapaṭṭhānaṃ nāma desitaṃ, tatthāpi ‘‘siyā kusalaṃ hetuṃ dhammaṃ paṭicca kusalo hetudhammo uppajjeyya hetupaccayā’’ti evaṃ dukasate ekekaṃ dukaṃ dvāvīsatiyā tikehi saddhiṃ yojetvā dassetabbānaṃ pucchānaṃ heṭṭhā vuttanayena sabbesaṃ ekamūlakādīnaṃ vasena gahetvā paricchedo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yampi tato paraṃ tike tikesuyeva pakkhipitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikatikapaṭṭhānaṃ"
      },
      " nāma desitaṃ, tatthāpi ‘‘siyā kusalaṃ sukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca kusalo sukhāya vedanāya sampayutto dhammo uppajjeyya hetupaccayā’’ti evaṃ dvāvīsatiyā tikesu ekekaṃ tikaṃ sesehi ekavīsatiyā ",
      " tikehi saddhiṃ yojetvā dassetabbānaṃ pucchānaṃ heṭṭhā vuttanayena sabbesaṃ ekamūlakādīnaṃ vasena gahetvā paricchedo veditabbo."
    ],
    "innerText": "Yampi tato paraṃ tike tikesuyeva pakkhipitvā tikatikapaṭṭhānaṃ nāma desitaṃ, tatthāpi ‘‘siyā kusalaṃ sukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca kusalo sukhāya vedanāya sampayutto dhammo uppajjeyya hetupaccayā’’ti evaṃ dvāvīsatiyā tikesu ekekaṃ tikaṃ sesehi ekavīsatiyā tikehi saddhiṃ yojetvā dassetabbānaṃ pucchānaṃ heṭṭhā vuttanayena sabbesaṃ ekamūlakādīnaṃ vasena gahetvā paricchedo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yampi tato paraṃ duke dukesuyeva pakkhipitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukadukapaṭṭhānaṃ"
      },
      " nāma desitaṃ, tatthāpi ‘‘siyā hetuṃ sahetukaṃ dhammaṃ paṭicca hetu sahetuko dhammo uppajjeyya hetupaccayā’’ti evaṃ dukasate ekekaṃ dukaṃ sesehi navanavutiyā dukehi saddhiṃ yojetvā dassetabbānaṃ pucchānaṃ heṭṭhā vuttanayena sabbesaṃ ekamūlakādīnaṃ vasena gahetvā paricchedo veditabbo. Tathāgatena hi sabbampetaṃ pabhedaṃ dassetvāva devaparisāya dhammo desito, dhammasenāpatissa pana tena ‘‘ajja idañcidañca desita’’nti saṅkhipitvā nayadassanamatteneva desanā akkhātā. Therenāpi saṅkhipitvāva vācanāmaggo pavattito, so therena pavattitanayeneva saṅgītikāle saṅgahaṃ āropito."
    ],
    "innerText": "Yampi tato paraṃ duke dukesuyeva pakkhipitvā dukadukapaṭṭhānaṃ nāma desitaṃ, tatthāpi ‘‘siyā hetuṃ sahetukaṃ dhammaṃ paṭicca hetu sahetuko dhammo uppajjeyya hetupaccayā’’ti evaṃ dukasate ekekaṃ dukaṃ sesehi navanavutiyā dukehi saddhiṃ yojetvā dassetabbānaṃ pucchānaṃ heṭṭhā vuttanayena sabbesaṃ ekamūlakādīnaṃ vasena gahetvā paricchedo veditabbo. Tathāgatena hi sabbampetaṃ pabhedaṃ dassetvāva devaparisāya dhammo desito, dhammasenāpatissa pana tena ‘‘ajja idañcidañca desita’’nti saṅkhipitvā nayadassanamatteneva desanā akkhātā. Therenāpi saṅkhipitvāva vācanāmaggo pavattito, so therena pavattitanayeneva saṅgītikāle saṅgahaṃ āropito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Taṃ panassa saṅkhepanayaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikañca paṭṭhānavara"
      },
      "nti ayaṃ gāthā ṭhapitā. Tassattho – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikañca paṭṭhānavara"
      },
      "nti pavaraṃ tikapaṭṭhānañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukuttama"
      },
      "nti uttamaṃ seṭṭhaṃ dukapaṭṭhānañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukatikañcevā"
      },
      "ti dukatikapaṭṭhānañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tikadukañcā"
      },
      "ti tikadukapaṭṭhānañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tikatikañcevā"
      },
      "ti tikatikapaṭṭhānañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukadukañcā"
      },
      "ti dukadukapaṭṭhānañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cha anulomamhi nayā sugambhīrā"
      },
      "ti ete tikapaṭṭhānādayo suṭṭhu gambhīrā cha nayā anulomamhi veditabbāti. Tattha dve anulomāni – dhammānulomañca paccayānulomañca. Tattha ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo’’ti evaṃ abhidhammamātikāpadehi saṅgahitānaṃ dhammānaṃ ",
      " anulomadesanāvasena pavattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammānulomaṃ"
      },
      " nāma. ‘‘Hetupaccayā ārammaṇapaccayā’’ti evaṃ catuvīsatiyā paccayānaṃ anulomadesanāvasena pavattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccayānulomaṃ"
      },
      " nāma."
    ],
    "innerText": "Taṃ panassa saṅkhepanayaṃ dassetuṃ tikañca paṭṭhānavaranti ayaṃ gāthā ṭhapitā. Tassattho – tikañca paṭṭhānavaranti pavaraṃ tikapaṭṭhānañca. Dukuttamanti uttamaṃ seṭṭhaṃ dukapaṭṭhānañca. Dukatikañcevāti dukatikapaṭṭhānañca. Tikadukañcāti tikadukapaṭṭhānañca. Tikatikañcevāti tikatikapaṭṭhānañca. Dukadukañcāti dukadukapaṭṭhānañca. Cha anulomamhi nayā sugambhīrāti ete tikapaṭṭhānādayo suṭṭhu gambhīrā cha nayā anulomamhi veditabbāti. Tattha dve anulomāni – dhammānulomañca paccayānulomañca. Tattha ‘‘kusalaṃ dhammaṃ paṭicca kusalo dhammo’’ti evaṃ abhidhammamātikāpadehi saṅgahitānaṃ dhammānaṃ anulomadesanāvasena pavattaṃ dhammānulomaṃ nāma. ‘‘Hetupaccayā ārammaṇapaccayā’’ti evaṃ catuvīsatiyā paccayānaṃ anulomadesanāvasena pavattaṃ paccayānulomaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha heṭṭhā aṭṭhakathāyaṃ ‘‘tikañca paṭṭhānavaraṃ…pe… cha anulomamhi nayā sugambhīrā’’ti ayaṃ gāthā dhammānulomaṃ sandhāya vuttā. Idha pana ayaṃ gāthā tasmiṃ dhammānulome paccayānulomaṃ sandhāya vuttā. Tasmā ‘‘cha anulomamhi nayā sugambhīrā’’ti aṭṭhakathāgāthāya dhammānulome tikapaṭṭhānādayo cha nayā sugambhīrāti evamattho veditabbo. Imasmiṃ panokāse ‘‘hetupaccayā ārammaṇapaccayā’’ti evaṃ pavatte paccayānulome ete dhammānulome tikapaṭṭhānādayo ‘‘cha nayā sugambhīrā’’ti evamattho veditabbo. Tesu anulome tikapaṭṭhāne kusalattikamattasseva ",
      " vasena ayaṃ imasmiṃ paṭiccavārassa paṇṇattivāre saṅkhipitvā pucchāpabhedo dassito. Sesesu pana tikesu sesapaṭṭhānesu ca ekāpi pucchā na dassitā. Tato paresu pana sahajātavārādīsu kusalattikassāpi vasena pucchaṃ anuddharitvā labbhamānakavasena vissajjanameva dassitaṃ. ‘‘Cha anulomamhi nayā sugambhīrā’’ti vacanato pana imasmiṃ paccayānulome chapi ete paṭṭhānanayā pucchāvasena uddharitvā dassetabbā. Paṭṭhānaṃ vaṇṇayantānañhi ācariyānaṃ bhāro esoti."
    ],
    "innerText": "Tattha heṭṭhā aṭṭhakathāyaṃ ‘‘tikañca paṭṭhānavaraṃ…pe… cha anulomamhi nayā sugambhīrā’’ti ayaṃ gāthā dhammānulomaṃ sandhāya vuttā. Idha pana ayaṃ gāthā tasmiṃ dhammānulome paccayānulomaṃ sandhāya vuttā. Tasmā ‘‘cha anulomamhi nayā sugambhīrā’’ti aṭṭhakathāgāthāya dhammānulome tikapaṭṭhānādayo cha nayā sugambhīrāti evamattho veditabbo. Imasmiṃ panokāse ‘‘hetupaccayā ārammaṇapaccayā’’ti evaṃ pavatte paccayānulome ete dhammānulome tikapaṭṭhānādayo ‘‘cha nayā sugambhīrā’’ti evamattho veditabbo. Tesu anulome tikapaṭṭhāne kusalattikamattasseva vasena ayaṃ imasmiṃ paṭiccavārassa paṇṇattivāre saṅkhipitvā pucchāpabhedo dassito. Sesesu pana tikesu sesapaṭṭhānesu ca ekāpi pucchā na dassitā. Tato paresu pana sahajātavārādīsu kusalattikassāpi vasena pucchaṃ anuddharitvā labbhamānakavasena vissajjanameva dassitaṃ. ‘‘Cha anulomamhi nayā sugambhīrā’’ti vacanato pana imasmiṃ paccayānulome chapi ete paṭṭhānanayā pucchāvasena uddharitvā dassetabbā. Paṭṭhānaṃ vaṇṇayantānañhi ācariyānaṃ bhāro esoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Paccayapaccanīyavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42-44"
      },
      ". Idāni paccanīyaṃ hoti. Taṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya na hetupaccayā"
      },
      "tiādi āraddhaṃ. Tattha anulomapucchāhi samappamāṇova pucchāparicchedo. Tenevettha ‘‘yathā anulome hetupaccayo vitthārito, evaṃ paccanīyepi nahetupaccayo vitthāretabbo’’ti vatvā puna pariyosāne ‘‘yathā anulome ekekassa padassa ekamūlakaṃ, dumūlakaṃ, timūlakaṃ, catumūlakaṃ yāva tevīsatimūlakaṃ, evaṃ paccanīyepi vitthāretabba’’nti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tevīsatimūlaka"
      },
      "nti idañcettha dumūlakaṃyeva sandhāya vuttaṃ. Pariyosāne pana sabbamūlakaṃ catuvīsatimūlakampi hotiyeva. Taṃ sabbaṃ saṅkhittamevāti."
    ],
    "innerText": "42-44. Idāni paccanīyaṃ hoti. Taṃ dassetuṃ siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya na hetupaccayātiādi āraddhaṃ. Tattha anulomapucchāhi samappamāṇova pucchāparicchedo. Tenevettha ‘‘yathā anulome hetupaccayo vitthārito, evaṃ paccanīyepi nahetupaccayo vitthāretabbo’’ti vatvā puna pariyosāne ‘‘yathā anulome ekekassa padassa ekamūlakaṃ, dumūlakaṃ, timūlakaṃ, catumūlakaṃ yāva tevīsatimūlakaṃ, evaṃ paccanīyepi vitthāretabba’’nti vuttaṃ. Tevīsatimūlakanti idañcettha dumūlakaṃyeva sandhāya vuttaṃ. Pariyosāne pana sabbamūlakaṃ catuvīsatimūlakampi hotiyeva. Taṃ sabbaṃ saṅkhittamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tikañca"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭṭhānavaraṃ…pe… cha paccanīyamhi nayā sugambhīrā"
      },
      "ti etthāpi dve paccanīyāni – dhammapaccanīyañca paccayapaccanīyañca. Tattha ‘‘kusalā dhammā’’ti evaṃ abhidhammamātikāpadehi saṅgahitānaṃ dhammānaṃ ‘‘na kusalaṃ dhammaṃ paṭicca na kusalo dhammo’’ti paccanīyadesanāvasena pavattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammapaccanīyaṃ"
      },
      " nāma. ‘‘Nahetupaccayā nārammaṇapaccayā’’ti evaṃ catuvīsatiyā paccayānaṃ paccanīyadesanāvasena pavattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccayapaccanīyaṃ"
      },
      " nāma. Tattha heṭṭhā aṭṭhakathāyaṃ ‘‘tikañca paṭṭhānavaraṃ…pe… cha paccanīyamhi nayā sugambhīrā’’ti ayaṃ gāthā dhammapaccanīyaṃ sandhāya vuttā. Idha pana ayaṃ gāthā dhammānulomeyeva paccayapaccanīyaṃ sandhāya vuttā. Tasmā ‘‘cha paccanīyamhi nayā sugambhīrā’’ti aṭṭhakathāgāthāya dhammapaccanīye tikapaṭṭhānādayo cha nayā sugambhīrāti evamattho veditabbo. Imasmiṃ panokāse na hetupaccayā nārammaṇapaccayāti evaṃ pavatte paccayapaccanīye ete dhammānulomeyeva tikapaṭṭhānādayo cha nayā sugambhīrāti evamattho veditabbo."
    ],
    "innerText": "Tikañcapaṭṭhānavaraṃ…pe… cha paccanīyamhi nayā sugambhīrāti etthāpi dve paccanīyāni – dhammapaccanīyañca paccayapaccanīyañca. Tattha ‘‘kusalā dhammā’’ti evaṃ abhidhammamātikāpadehi saṅgahitānaṃ dhammānaṃ ‘‘na kusalaṃ dhammaṃ paṭicca na kusalo dhammo’’ti paccanīyadesanāvasena pavattaṃ dhammapaccanīyaṃ nāma. ‘‘Nahetupaccayā nārammaṇapaccayā’’ti evaṃ catuvīsatiyā paccayānaṃ paccanīyadesanāvasena pavattaṃ paccayapaccanīyaṃ nāma. Tattha heṭṭhā aṭṭhakathāyaṃ ‘‘tikañca paṭṭhānavaraṃ…pe… cha paccanīyamhi nayā sugambhīrā’’ti ayaṃ gāthā dhammapaccanīyaṃ sandhāya vuttā. Idha pana ayaṃ gāthā dhammānulomeyeva paccayapaccanīyaṃ sandhāya vuttā. Tasmā ‘‘cha paccanīyamhi nayā sugambhīrā’’ti aṭṭhakathāgāthāya dhammapaccanīye tikapaṭṭhānādayo cha nayā sugambhīrāti evamattho veditabbo. Imasmiṃ panokāse na hetupaccayā nārammaṇapaccayāti evaṃ pavatte paccayapaccanīye ete dhammānulomeyeva tikapaṭṭhānādayo cha nayā sugambhīrāti evamattho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesu ",
      " anulomatikapaṭṭhāneyeva kusalattikamattassa vasena ayaṃ imasmiṃ paṭiccavārassa paṇṇattivāre saṅkhipitvā pucchāpabhedo dassito. Sesesu pana tikesu sesapaṭṭhānesu ca ekāpi pucchā na dassitā. Tato paresu pana sahajātavārādīsu kusalattikassāpi vasena pucchaṃ anuddharitvā labbhamānakavasena vissajjanameva dassitaṃ. ‘‘Cha paccanīyamhi nayā sugambhīrā’’ti vacanato pana imasmiṃ paccayapaccanīye chapi ete paṭṭhānanayā pucchāvasena uddharitvā dassetabbā. Paṭṭhānaṃ vaṇṇayantānañhi ācariyānaṃ bhāro esoti."
    ],
    "innerText": "Tesu anulomatikapaṭṭhāneyeva kusalattikamattassa vasena ayaṃ imasmiṃ paṭiccavārassa paṇṇattivāre saṅkhipitvā pucchāpabhedo dassito. Sesesu pana tikesu sesapaṭṭhānesu ca ekāpi pucchā na dassitā. Tato paresu pana sahajātavārādīsu kusalattikassāpi vasena pucchaṃ anuddharitvā labbhamānakavasena vissajjanameva dassitaṃ. ‘‘Cha paccanīyamhi nayā sugambhīrā’’ti vacanato pana imasmiṃ paccayapaccanīye chapi ete paṭṭhānanayā pucchāvasena uddharitvā dassetabbā. Paṭṭhānaṃ vaṇṇayantānañhi ācariyānaṃ bhāro esoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Anulomapaccanīyavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "45-48"
      },
      ". Idāni anulomapaccanīyaṃ hoti. Taṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā naārammaṇapaccayā"
      },
      "tiādi āraddhaṃ. Tattha ‘‘hetupaccayā naārammaṇapaccayā…pe… hetupaccayā naavigatapaccayā’’ti hetupadassa sesesu tevīsatiyā paccayesu ekekena saddhiṃ yojanāvasena hetupadādike ekamūlake tevīsati anulomapaccanīyāni. Tesu ekekasmiṃ ekūnapaññāsaṃ katvā sattavīsādhikāni ekādasa pucchāsatāni honti. Dumūlake pana hetārammaṇapadānaṃ sesesu dvāvīsatiyā paccayesu ekekena saddhiṃ ",
      " yojanāvasena dvāvīsati anulomapaccanīyānīti evaṃ anulome vuttesu sabbesu ekamūlakādīsu ekekaṃ padaṃ parihāpetvā avasesānaṃ vasena pucchāgaṇanā veditabbā. Ekamūlakādīsu cettha yā pucchā pāḷiyaṃ āgatā, yā ca na āgatā, tā sabbā heṭṭhā vuttanayānusāreneva veditabbā."
    ],
    "innerText": "45-48. Idāni anulomapaccanīyaṃ hoti. Taṃ dassetuṃ siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya hetupaccayā naārammaṇapaccayātiādi āraddhaṃ. Tattha ‘‘hetupaccayā naārammaṇapaccayā…pe… hetupaccayā naavigatapaccayā’’ti hetupadassa sesesu tevīsatiyā paccayesu ekekena saddhiṃ yojanāvasena hetupadādike ekamūlake tevīsati anulomapaccanīyāni. Tesu ekekasmiṃ ekūnapaññāsaṃ katvā sattavīsādhikāni ekādasa pucchāsatāni honti. Dumūlake pana hetārammaṇapadānaṃ sesesu dvāvīsatiyā paccayesu ekekena saddhiṃ yojanāvasena dvāvīsati anulomapaccanīyānīti evaṃ anulome vuttesu sabbesu ekamūlakādīsu ekekaṃ padaṃ parihāpetvā avasesānaṃ vasena pucchāgaṇanā veditabbā. Ekamūlakādīsu cettha yā pucchā pāḷiyaṃ āgatā, yā ca na āgatā, tā sabbā heṭṭhā vuttanayānusāreneva veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tikañca paṭṭhānavaraṃ…pe… cha anulomapaccanīyamhi nayā sugambhīrā"
      },
      "ti ettha pana heṭṭhā vuttanayeneva dve anulomapaccanīyāni – dhammānulomapaccanīyaṃ paccayānulomapaccanīyañca. Tattha ‘‘kusalā dhammā’’ti evaṃ abhidhammamātikāpadehi saṅgahitānaṃ dhammānaṃ ‘‘kusalaṃ dhammaṃ paṭicca na kusalo dhammo’’ti anulomapaccanīyadesanāvasena pavattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammānulomapaccanīyaṃ"
      },
      " nāma. ‘‘Hetupaccayā naārammaṇapaccayā’’ti evaṃ catuvīsatiyā paccayesu labbhamānapadānaṃ anulomapaccanīyadesanāvasena pavattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccayānulomapaccanīyaṃ"
      },
      " nāma. Tattha heṭṭhā aṭṭhakathāyaṃ ‘‘tikañca paṭṭhānavaraṃ…pe… cha anulomapaccanīyamhi nayā sugambhīrā’’ti ayaṃ gāthā dhammānulomapaccanīyaṃ sandhāya vuttā. Idha pana ayaṃ gāthā dhammānulomeyeva paccayānulomapaccanīyaṃ ",
      " sandhāya vuttā. Tasmā ‘‘cha anulomapaccanīyamhi nayā sugambhīrā’’ti aṭṭhakathāgāthāya dhammānulomapaccanīye tikapaṭṭhānādayo cha nayā sugambhīrāti evamattho veditabbo. Imasmiṃ panokāse hetupaccayā nārammaṇapaccayāti evaṃ pavatte paccayānulomapaccanīye ete dhammānulomeyeva tikapaṭṭhānādayo cha nayā sugambhīrāti evamattho veditabbo."
    ],
    "innerText": "Tikañca paṭṭhānavaraṃ…pe… cha anulomapaccanīyamhi nayā sugambhīrāti ettha pana heṭṭhā vuttanayeneva dve anulomapaccanīyāni – dhammānulomapaccanīyaṃ paccayānulomapaccanīyañca. Tattha ‘‘kusalā dhammā’’ti evaṃ abhidhammamātikāpadehi saṅgahitānaṃ dhammānaṃ ‘‘kusalaṃ dhammaṃ paṭicca na kusalo dhammo’’ti anulomapaccanīyadesanāvasena pavattaṃ dhammānulomapaccanīyaṃ nāma. ‘‘Hetupaccayā naārammaṇapaccayā’’ti evaṃ catuvīsatiyā paccayesu labbhamānapadānaṃ anulomapaccanīyadesanāvasena pavattaṃ paccayānulomapaccanīyaṃ nāma. Tattha heṭṭhā aṭṭhakathāyaṃ ‘‘tikañca paṭṭhānavaraṃ…pe… cha anulomapaccanīyamhi nayā sugambhīrā’’ti ayaṃ gāthā dhammānulomapaccanīyaṃ sandhāya vuttā. Idha pana ayaṃ gāthā dhammānulomeyeva paccayānulomapaccanīyaṃ sandhāya vuttā. Tasmā ‘‘cha anulomapaccanīyamhi nayā sugambhīrā’’ti aṭṭhakathāgāthāya dhammānulomapaccanīye tikapaṭṭhānādayo cha nayā sugambhīrāti evamattho veditabbo. Imasmiṃ panokāse hetupaccayā nārammaṇapaccayāti evaṃ pavatte paccayānulomapaccanīye ete dhammānulomeyeva tikapaṭṭhānādayo cha nayā sugambhīrāti evamattho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tesu anulome tikapaṭṭhāneyeva kusalattikamattassa vasena ayaṃ imasmiṃ paṭiccavārassa paṇṇattivāre saṅkhipitvā pucchāpabhedo dassito. Sesesu pana tikesu sesapaṭṭhānesu ca ekāpi pucchā na dassitā. Tato paresu pana sahajātavārādīsu kusalattikassāpi vasena pucchaṃ anuddharitvā labbhamānakavasena vissajjanameva dassitaṃ. ‘‘Cha anulomapaccanīyamhi nayā sugambhīrā’’ti vacanato pana imasmiṃ paccayānulomapaccanīye chapi ete paṭṭhānanayā pucchāvasena uddharitvā dassetabbā. Paṭṭhānaṃ vaṇṇayantānañhi ācariyānaṃ bhāro esoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4. Paccanīyānulomavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "49-52"
      },
      ". Idāni ",
      " paccanīyānulomaṃ hoti. Taṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya nahetupaccayā ārammaṇapaccayā"
      },
      "tiādi āraddhaṃ. Tattha anulomapaccanīyapucchāhi samappamāṇo eva pucchāparicchedo. Ekamūlakādīsu cettha yā pucchā pāḷiyaṃ āgatā, yā ca na āgatā, tā sabbā heṭṭhā vuttanayānusāreneva veditabbā."
    ],
    "innerText": "49-52. Idāni paccanīyānulomaṃ hoti. Taṃ dassetuṃ siyā kusalaṃ dhammaṃ paṭicca kusalo dhammo uppajjeyya nahetupaccayā ārammaṇapaccayātiādi āraddhaṃ. Tattha anulomapaccanīyapucchāhi samappamāṇo eva pucchāparicchedo. Ekamūlakādīsu cettha yā pucchā pāḷiyaṃ āgatā, yā ca na āgatā, tā sabbā heṭṭhā vuttanayānusāreneva veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tikañca paṭṭhānavaraṃ…pe… cha paccanīyānulomamhi nayā sugambhīrā"
      },
      "ti etthāpi heṭṭhā vuttanayeneva dve paccayānulomāni – dhammapaccanīyānulomaṃ paccayapaccanīyānulomañca. Tattha ‘‘kusalā dhammā’’ti evaṃ abhidhammamātikāpadehi saṅgahitānaṃ dhammānaṃ ‘‘nakusalaṃ dhammaṃ paṭicca kusalo dhammo’’ti paccanīyānulomadesanāvasena pavattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammapaccanīyānulomaṃ"
      },
      " nāma. ‘‘Nahetupaccayā ārammaṇapaccayā’’ti evaṃ catuvīsatiyā paccayesu labbhamānapadānaṃ paccayapaccanīyānulomadesanāvasena pavattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccayapaccanīyānulomaṃ"
      },
      " nāma. Tattha heṭṭhā aṭṭhakathāyaṃ ‘‘tikañca paṭṭhānavaraṃ…pe… cha paccanīyānulomamhi nayā sugambhīrā’’ti ayaṃ gāthā dhammapaccanīyānulomaṃ sandhāya vuttā. Idha pana ayaṃ gāthā dhammānulomeyeva paccayapaccanīyānulomaṃ sandhāya vuttā. Tasmā ‘‘cha paccanīyānulomamhi nayā sugambhīrā’’ti aṭṭhakathāya ",
      " dhammapaccanīyānulome tikapaṭṭhānādayo cha nayā sugambhīrāti evamattho veditabbo. Imasmiṃ panokāse nahetupaccayā ārammaṇapaccayāti evaṃ pavatte paccayapaccanīyānulome ete dhammānulomeyeva tikapaṭṭhānādayo cha nayā sugambhīrāti evamattho veditabbo."
    ],
    "innerText": "Tikañca paṭṭhānavaraṃ…pe… cha paccanīyānulomamhi nayā sugambhīrāti etthāpi heṭṭhā vuttanayeneva dve paccayānulomāni – dhammapaccanīyānulomaṃ paccayapaccanīyānulomañca. Tattha ‘‘kusalā dhammā’’ti evaṃ abhidhammamātikāpadehi saṅgahitānaṃ dhammānaṃ ‘‘nakusalaṃ dhammaṃ paṭicca kusalo dhammo’’ti paccanīyānulomadesanāvasena pavattaṃ dhammapaccanīyānulomaṃ nāma. ‘‘Nahetupaccayā ārammaṇapaccayā’’ti evaṃ catuvīsatiyā paccayesu labbhamānapadānaṃ paccayapaccanīyānulomadesanāvasena pavattaṃ paccayapaccanīyānulomaṃ nāma. Tattha heṭṭhā aṭṭhakathāyaṃ ‘‘tikañca paṭṭhānavaraṃ…pe… cha paccanīyānulomamhi nayā sugambhīrā’’ti ayaṃ gāthā dhammapaccanīyānulomaṃ sandhāya vuttā. Idha pana ayaṃ gāthā dhammānulomeyeva paccayapaccanīyānulomaṃ sandhāya vuttā. Tasmā ‘‘cha paccanīyānulomamhi nayā sugambhīrā’’ti aṭṭhakathāya dhammapaccanīyānulome tikapaṭṭhānādayo cha nayā sugambhīrāti evamattho veditabbo. Imasmiṃ panokāse nahetupaccayā ārammaṇapaccayāti evaṃ pavatte paccayapaccanīyānulome ete dhammānulomeyeva tikapaṭṭhānādayo cha nayā sugambhīrāti evamattho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tesu anulomatikapaṭṭhāneyeva kusalattikamattassapi vasena ayaṃ imasmiṃ paṭiccavārassa paṇṇattivāre saṅkhipitvā pucchāpabhedo dassito. Sesesu pana tikesu sesapaṭṭhānesu ca ekāpi pucchā na dassitā. Tato paresu pana sahajātavārādīsu kusalattikassapi vasena pucchaṃ anuddharitvā labbhamānakavasena vissajjanameva dassitaṃ. ‘‘Cha paccanīyānulomamhi nayā sugambhīrā’’ti vacanato pana imasmiṃ paccayapaccanīyānulome chapi ete paṭṭhānanayā pucchāvasena uddharitvā dassetabbā. Paṭṭhānaṃ vaṇṇayantānañhi ācariyānaṃ bhāro esoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pucchāvāravaṇṇanā niṭṭhitā."
  }
]