[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Vipākattikavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1-23"
      },
      ". Vipākattike ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipākaṃ dhammaṃ paṭicca vipāko dhammo uppajjati hetupaccayā"
      },
      "ti ye hetupaccaye terasa vārā vuttā, te saṅkhipitvā gaṇanāya dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetuyā terasā"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇe pañcā"
      },
      "tiādīsupi eseva nayo. Evamettha terasa pañca nava satta tīṇi dveti cha gaṇanaparicchedā, tesaṃ vasena paccayasaṃsandane heṭṭhā vuttanayeneva gaṇanā veditabbā."
    ],
    "innerText": "1-23. Vipākattike vipākaṃ dhammaṃ paṭicca vipāko dhammo uppajjati hetupaccayāti ye hetupaccaye terasa vārā vuttā, te saṅkhipitvā gaṇanāya dassetuṃ hetuyā terasāti vuttaṃ. Ārammaṇe pañcātiādīsupi eseva nayo. Evamettha terasa pañca nava satta tīṇi dveti cha gaṇanaparicchedā, tesaṃ vasena paccayasaṃsandane heṭṭhā vuttanayeneva gaṇanā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24-52"
      },
      ". Paccanīyepi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipākaṃ dhammaṃ paṭicca vipāko dhammo uppajjati nahetupaccayā"
      },
      "ti ye nahetupaccaye dasa vārā vuttā, te saṅkhipitvā gaṇanāya dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nahetuyā dasā"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ārammaṇe pañcā"
      },
      "tiādīsupi eseva nayo. Evamettha dasa pañca terasa dvādasa dve ekaṃ nava tīṇīti aṭṭha gaṇanaparicchedā, tesaṃ vasena paccayasaṃsandane heṭṭhā vuttanayeneva vitthārato gaṇanā veditabbā. Pāḷi pana saṅkhittā, etesaññeva pana laddhagaṇanaraparicchedānaṃ vārānaṃ vasena saṃsanditvā anulomapaccanīyaṃ paccanīyānulomañca veditabbaṃ."
    ],
    "innerText": "24-52. Paccanīyepi vipākaṃ dhammaṃ paṭicca vipāko dhammo uppajjati nahetupaccayāti ye nahetupaccaye dasa vārā vuttā, te saṅkhipitvā gaṇanāya dassetuṃ nahetuyā dasāti vuttaṃ. Na ārammaṇe pañcātiādīsupi eseva nayo. Evamettha dasa pañca terasa dvādasa dve ekaṃ nava tīṇīti aṭṭha gaṇanaparicchedā, tesaṃ vasena paccayasaṃsandane heṭṭhā vuttanayeneva vitthārato gaṇanā veditabbā. Pāḷi pana saṅkhittā, etesaññeva pana laddhagaṇanaraparicchedānaṃ vārānaṃ vasena saṃsanditvā anulomapaccanīyaṃ paccanīyānulomañca veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sahajātavāro ",
      " imināva ekagatiko. Paccayanissayasaṃsaṭṭhasampayuttavārā yathāpāḷimeva niyyanti."
    ],
    "innerText": "Sahajātavāro imināva ekagatiko. Paccayanissayasaṃsaṭṭhasampayuttavārā yathāpāḷimeva niyyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "92"
      },
      ". Pañhāvāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kusalākusale niruddhe"
      },
      "ti etasmiṃ vipassanāvasena pavatte kusale sārajjanādivasena pavatte akusale ca niruddhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipāko tadārammaṇatā uppajjatī"
      },
      "ti kāmāvacaravipāko tadārammaṇatāya uppajjati. Ye pana ‘‘vipassanājavanānaṃ vicikicchuddhaccānañca pariyosāne tadārammaṇaṃ natthī’’ti vadanti, te imāya tantiyā paṭisedhetabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākāsānañcāyatanakusalaṃ viññāṇañcāyatanassa kiriyassa ārammaṇapaccayena paccayo"
      },
      "ti arahattaṃ patvā asamāpannapubbā samāpattiyo paṭilomato samāpajjantassa vasenetaṃ vuttaṃ. Iminā upāyena sabbavissajjanesu sādhukaṃ pāḷiṃ upaparikkhitvā attho veditabbo."
    ],
    "innerText": "92. Pañhāvāre kusalākusale niruddheti etasmiṃ vipassanāvasena pavatte kusale sārajjanādivasena pavatte akusale ca niruddhe. Vipāko tadārammaṇatā uppajjatīti kāmāvacaravipāko tadārammaṇatāya uppajjati. Ye pana ‘‘vipassanājavanānaṃ vicikicchuddhaccānañca pariyosāne tadārammaṇaṃ natthī’’ti vadanti, te imāya tantiyā paṭisedhetabbā. Ākāsānañcāyatanakusalaṃ viññāṇañcāyatanassa kiriyassa ārammaṇapaccayena paccayoti arahattaṃ patvā asamāpannapubbā samāpattiyo paṭilomato samāpajjantassa vasenetaṃ vuttaṃ. Iminā upāyena sabbavissajjanesu sādhukaṃ pāḷiṃ upaparikkhitvā attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "120"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hetuyā satta, ārammaṇe nava, adhipatiyā dasā"
      },
      "tiādīsupi sahajātādhipativasena ārammaṇādhipativasena sahajātanissayavasena purejātanissayavasena anantarūpanissayavasena ārammaṇūpanissayavasena ",
      " pakatūpanissayavasena sahajātavippayuttavasena purejātapacchājātavippayuttavasenāti yattha yattha yathā yathā yattakāni vissajjanāni labbhanti, tattha tattha tathā tathā tāni sabbāni sallakkhetabbāni. Tathā paccanīyādīsu anulomavasena vāruddharaṇaṃ, anulomato laddhavārānaṃ paccanīyato gaṇanā, paccayasaṃsandanaṃ, anulomapaccanīye paccanīyānulome ca suddhikesu ceva saṃsandanavasena ca pavattesu hetumūlakādīsu labbhamānavāragaṇanā, alabbhamānānaṃ alabbhamānatāti sabbaṃ heṭṭhā vuttanayeneva veditabbaṃ."
    ],
    "innerText": "120.Hetuyā satta, ārammaṇe nava, adhipatiyā dasātiādīsupi sahajātādhipativasena ārammaṇādhipativasena sahajātanissayavasena purejātanissayavasena anantarūpanissayavasena ārammaṇūpanissayavasena pakatūpanissayavasena sahajātavippayuttavasena purejātapacchājātavippayuttavasenāti yattha yattha yathā yathā yattakāni vissajjanāni labbhanti, tattha tattha tathā tathā tāni sabbāni sallakkhetabbāni. Tathā paccanīyādīsu anulomavasena vāruddharaṇaṃ, anulomato laddhavārānaṃ paccanīyato gaṇanā, paccayasaṃsandanaṃ, anulomapaccanīye paccanīyānulome ca suddhikesu ceva saṃsandanavasena ca pavattesu hetumūlakādīsu labbhamānavāragaṇanā, alabbhamānānaṃ alabbhamānatāti sabbaṃ heṭṭhā vuttanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathā cettha, evaṃ ito paresupi tikadukesu. Paṭṭhānapakaraṇañhi pāḷitova anantaṃ aparimāṇaṃ. Tassa padapaṭipāṭiyā atthaṃ vaṇṇayissāmīti paṭipannassa atidīghāyukassāpi āyu nappahoti. Na cassa ekadesaṃ vaṇṇetvā sesamhi nayato dassiyamāne na sakkā attho jānituṃ, tasmā ito paraṃ ettakampi avatvā sesesu tikadukesu heṭṭhā avuttappakārattā yaṃ yaṃ avassaṃ vattabbaṃ, taṃ tadeva vakkhāma. Yaṃ pana avatvā gamissāma, taṃ pāḷinayeneva veditabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vipākattikavaṇṇanā."
  }
]