[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "1. Cittaparicchedavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Bhūmibhedacittavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Idāni yasmā vibhāgavantānaṃ dhammānaṃ sabhāvavibhāvanaṃ vibhāgena vinā na hoti, tasmā yathāuddiṭṭhānaṃ abhidhammatthānaṃ uddesakkamena vibhāgaṃ dassetuṃ cittaṃ tāva bhūmijātisampayogādivasena ",
      " vibhajitvā niddisitumārabhanto āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tattha cittaṃ tāvā’’"
      },
      "tyādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāva"
      },
      "-saddo paṭhamanti etassatthe. Yathāuddiṭṭhesu catūsu abhidhammatthesu paṭhamaṃ cittaṃ niddisīyatīti ",
      " ayañhetthattho. Cattāro vidhā pakārā assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catubbidhaṃ"
      },
      ". Yasmā panete catubhummakā dhammā anupubbapaṇītā, tasmā hīnukkaṭṭhukkaṭṭhataratamānukkamena tesaṃ niddeso kato. Tattha kāmetīti kāmo, kāmataṇhā, sā ettha avacarati ārammaṇakaraṇavasenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmāvacaraṃ"
      },
      ". Kāmīyatīti vā kāmo, ekādasavidho kāmabhavo, tasmiṃ yebhuyyena avacaratīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmāvacaraṃ"
      },
      ". Yebhuyyena caraṇassa hi adhippetattā rūpārūpabhavesu pavattassāpi imassa kāmāvacarabhāvo upapanno hoti. Kāmabhavoyeva vā kāmo ettha avacaratīti kāmāvacaro, tattha pavattampi cittaṃ nissite nissayavohārena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmāvacaraṃ"
      },
      " ‘‘mañcā ukkuṭṭhiṃ karontī’’tyādīsu viyāti alamativisāraṇiyā kathāya. Hoti cettha –"
    ],
    "innerText": "3. Idāni yasmā vibhāgavantānaṃ dhammānaṃ sabhāvavibhāvanaṃ vibhāgena vinā na hoti, tasmā yathāuddiṭṭhānaṃ abhidhammatthānaṃ uddesakkamena vibhāgaṃ dassetuṃ cittaṃ tāva bhūmijātisampayogādivasena vibhajitvā niddisitumārabhanto āha ‘‘tattha cittaṃ tāvā’’tyādi. Tāva-saddo paṭhamanti etassatthe. Yathāuddiṭṭhesu catūsu abhidhammatthesu paṭhamaṃ cittaṃ niddisīyatīti ayañhetthattho. Cattāro vidhā pakārā assāti catubbidhaṃ. Yasmā panete catubhummakā dhammā anupubbapaṇītā, tasmā hīnukkaṭṭhukkaṭṭhataratamānukkamena tesaṃ niddeso kato. Tattha kāmetīti kāmo, kāmataṇhā, sā ettha avacarati ārammaṇakaraṇavasenāti kāmāvacaraṃ. Kāmīyatīti vā kāmo, ekādasavidho kāmabhavo, tasmiṃ yebhuyyena avacaratīti kāmāvacaraṃ. Yebhuyyena caraṇassa hi adhippetattā rūpārūpabhavesu pavattassāpi imassa kāmāvacarabhāvo upapanno hoti. Kāmabhavoyeva vā kāmo ettha avacaratīti kāmāvacaro, tattha pavattampi cittaṃ nissite nissayavohārena kāmāvacaraṃ ‘‘mañcā ukkuṭṭhiṃ karontī’’tyādīsu viyāti alamativisāraṇiyā kathāya. Hoti cettha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kāmovacaratītyettha, kāmevacaratīti vā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ṭhānūpacārato vāpi, taṃ kāmāvacaraṃ bhave’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpārūpāvacare"
      },
      "supi eseva nayo yathārahaṃ daṭṭhabbo. Upādānakkhandhasaṅkhātalokato uttarati anāsavabhāvenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokuttaraṃ,"
      },
      " maggacittaṃ. Phalacittaṃ pana tato uttiṇṇanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokuttaraṃ"
      },
      ". Ubhayampi vā saha nibbānena lokato uttaraṃ adhikaṃ yathāvuttaguṇavasenevāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokuttaraṃ"
      },
      "."
    ],
    "innerText": "Rūpārūpāvacaresupi eseva nayo yathārahaṃ daṭṭhabbo. Upādānakkhandhasaṅkhātalokato uttarati anāsavabhāvenāti lokuttaraṃ, maggacittaṃ. Phalacittaṃ pana tato uttiṇṇanti lokuttaraṃ. Ubhayampi vā saha nibbānena lokato uttaraṃ adhikaṃ yathāvuttaguṇavasenevāti lokuttaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhūmibhedacittavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Akusalacittavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Imesu pana catūsu cittesu kāmāvacaracittassa kusalākusalavipākakiriyabhedena catubbidhabhāvepi pāpāhetukavajjānaṃ ekūnasaṭṭhiyā, ekanavutiyā vā cittānaṃ sobhananāmena vohārakaraṇatthaṃ ‘‘pāpāhetukamuttāni ",
      " ‘sobhanānī’ti vuccare’’ti evaṃ vakkhamānanayassa anurūpato pāpāhetukeyeva paṭhamaṃ dassento, tesu ca bhavesu gahitapaṭisandhikassa sattassa ādito vīthicittavasena lobhasahagatacittuppādānameva sambhavato teyeva paṭhamaṃ dassetvā tadanantaraṃ dvihetukabhāvasāmaññena domanassasahagate, tadanantaraṃ ekahetuke ca dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘somanassasahagata’’"
      },
      "ntyādinā ",
      " lobhamūlaṃ tāva vedanādiṭṭhisaṅkhārabhedena aṭṭhadhā vibhajitvā dasseti."
    ],
    "innerText": "4. Imesu pana catūsu cittesu kāmāvacaracittassa kusalākusalavipākakiriyabhedena catubbidhabhāvepi pāpāhetukavajjānaṃ ekūnasaṭṭhiyā, ekanavutiyā vā cittānaṃ sobhananāmena vohārakaraṇatthaṃ ‘‘pāpāhetukamuttāni ‘sobhanānī’ti vuccare’’ti evaṃ vakkhamānanayassa anurūpato pāpāhetukeyeva paṭhamaṃ dassento, tesu ca bhavesu gahitapaṭisandhikassa sattassa ādito vīthicittavasena lobhasahagatacittuppādānameva sambhavato teyeva paṭhamaṃ dassetvā tadanantaraṃ dvihetukabhāvasāmaññena domanassasahagate, tadanantaraṃ ekahetuke ca dassetuṃ ‘‘somanassasahagata’’ntyādinā lobhamūlaṃ tāva vedanādiṭṭhisaṅkhārabhedena aṭṭhadhā vibhajitvā dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha sundaraṃ mano, taṃ vā etassa atthīti sumano, cittaṃ, taṃsamaṅgipuggalo vā, tassa bhāvo tasmiṃ abhidhānabuddhīnaṃ pavattihetutāyāti somanassaṃ, mānasikasukhavedanāyetaṃ adhivacanaṃ, tena sahagataṃ ekuppādādivasena saṃsaṭṭhaṃ, tena saha ekuppādādibhāvaṃ gatanti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "somanassasahagataṃ"
      },
      ". Micchā passatīti diṭṭhi. Sāmaññavacanassapi hi atthappakaraṇādinā visesavisayatā hotīti idha micchādassanameva ‘‘diṭṭhī’’ti vuccati. Diṭṭhiyeva diṭṭhigataṃ ‘‘saṅkhāragataṃ thāmagata’’ntyādīsu viya gata-saddassa tabbhāvavuttittā. Dvāsaṭṭhiyā vā diṭṭhīsu gataṃ antogataṃ, diṭṭhiyā vā gamanamattaṃ na ettha gantabbo attādiko koci atthīti diṭṭhigataṃ, ‘‘idameva saccaṃ moghamañña’’nti pavatto attattaniyādiabhiniveso, tena samaṃ ekuppādādīhi pakārehi yuttanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭhigatasampayuttaṃ"
      },
      ". Saṅkharoti cittaṃ tikkhabhāvasaṅkhātamaṇḍanavisesena sajjeti, saṅkharīyati vā taṃ etena yathāvuttanayena sajjīyatīti saṅkhāro, tattha tattha kicce saṃsīdamānassa cittassa anubalappadānavasena attano vā paresaṃ vā pavattapubbappayogo, so pana attano pubbabhāgappavatte cittasantāne ceva parasantāne ca pavattatīti tannibbattito cittassa tikkhabhāvasaṅkhāto visesovidha saṅkhāro, so yassa natthi taṃ asaṅkhāraṃ ",
      ", tadeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asaṅkhārikaṃ"
      },
      ". Saṅkhārena sahitaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sasaṅkhārikaṃ"
      },
      ". Tathā ca vadanti –"
    ],
    "innerText": "Tattha sundaraṃ mano, taṃ vā etassa atthīti sumano, cittaṃ, taṃsamaṅgipuggalo vā, tassa bhāvo tasmiṃ abhidhānabuddhīnaṃ pavattihetutāyāti somanassaṃ, mānasikasukhavedanāyetaṃ adhivacanaṃ, tena sahagataṃ ekuppādādivasena saṃsaṭṭhaṃ, tena saha ekuppādādibhāvaṃ gatanti vā somanassasahagataṃ. Micchā passatīti diṭṭhi. Sāmaññavacanassapi hi atthappakaraṇādinā visesavisayatā hotīti idha micchādassanameva ‘‘diṭṭhī’’ti vuccati. Diṭṭhiyeva diṭṭhigataṃ ‘‘saṅkhāragataṃ thāmagata’’ntyādīsu viya gata-saddassa tabbhāvavuttittā. Dvāsaṭṭhiyā vā diṭṭhīsu gataṃ antogataṃ, diṭṭhiyā vā gamanamattaṃ na ettha gantabbo attādiko koci atthīti diṭṭhigataṃ, ‘‘idameva saccaṃ moghamañña’’nti pavatto attattaniyādiabhiniveso, tena samaṃ ekuppādādīhi pakārehi yuttanti diṭṭhigatasampayuttaṃ. Saṅkharoti cittaṃ tikkhabhāvasaṅkhātamaṇḍanavisesena sajjeti, saṅkharīyati vā taṃ etena yathāvuttanayena sajjīyatīti saṅkhāro, tattha tattha kicce saṃsīdamānassa cittassa anubalappadānavasena attano vā paresaṃ vā pavattapubbappayogo, so pana attano pubbabhāgappavatte cittasantāne ceva parasantāne ca pavattatīti tannibbattito cittassa tikkhabhāvasaṅkhāto visesovidha saṅkhāro, so yassa natthi taṃ asaṅkhāraṃ , tadeva asaṅkhārikaṃ. Saṅkhārena sahitaṃ sasaṅkhārikaṃ. Tathā ca vadanti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pubbappayogasambhūto, viseso cittasambhavī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saṅkhāro taṃvasenettha, hotyāsaṅkhārikāditā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā ‘‘sasaṅkhārikaṃ asaṅkhārika’’nti cetaṃ kevalaṃ saṅkhārassa bhāvābhāvaṃ sandhāya vuttaṃ, na tassa sahappavattisabbhāvābhāvatoti bhinnasantānappavattinopi saṅkhārassa idamatthitāya taṃvasena nibbattaṃ cittaṃ saṅkhāro assa atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sasaṅkhārikaṃ"
      },
      " ‘‘salomako sapakkhako’’tyādīsu viya saha-saddassa vijjamānatthaparidīpanato. Tabbiparītaṃ pana tadabhāvato vuttanayena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asaṅkhārikaṃ"
      },
      ". Diṭṭhigatena vippayuttaṃ visaṃsaṭṭhanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭhigatavippayuttaṃ"
      },
      ". Upapattito yuttito ikkhati anubhavati vedayamānāpi majjhattākārasaṇṭhitiyāti upekkhā. Sukhadukkhānaṃ vā upetā yuttā aviruddhā ikkhā ",
      " anubhavananti upekkhā. Sukhadukkhāvirodhitāya hesā tesaṃ anantarampi pavattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upekkhāsahagata"
      },
      "nti idaṃ vuttanayameva."
    ],
    "innerText": "Atha vā ‘‘sasaṅkhārikaṃ asaṅkhārika’’nti cetaṃ kevalaṃ saṅkhārassa bhāvābhāvaṃ sandhāya vuttaṃ, na tassa sahappavattisabbhāvābhāvatoti bhinnasantānappavattinopi saṅkhārassa idamatthitāya taṃvasena nibbattaṃ cittaṃ saṅkhāro assa atthīti sasaṅkhārikaṃ ‘‘salomako sapakkhako’’tyādīsu viya saha-saddassa vijjamānatthaparidīpanato. Tabbiparītaṃ pana tadabhāvato vuttanayena asaṅkhārikaṃ. Diṭṭhigatena vippayuttaṃ visaṃsaṭṭhanti diṭṭhigatavippayuttaṃ. Upapattito yuttito ikkhati anubhavati vedayamānāpi majjhattākārasaṇṭhitiyāti upekkhā. Sukhadukkhānaṃ vā upetā yuttā aviruddhā ikkhā anubhavananti upekkhā. Sukhadukkhāvirodhitāya hesā tesaṃ anantarampi pavattati. Upekkhāsahagatanti idaṃ vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kasmā panettha aññesupi phassādīsu sampayuttadhammesu vijjamānesu somanassasahagatādibhāvova vuttoti? Somanassādīnameva asādhāraṇabhāvato. Phassādayo hi keci sabbacittasādhāraṇā, keci kusalādisādhāraṇā, mohādayo ca sabbākusalasādhāraṇāti na tehi sakkā cittaṃ visesetuṃ, somanassādayo pana katthaci citte honti, katthaci na hontīti pākaṭova taṃvasena cittassa viseso. Kasmā panete katthaci honti, katthaci na hontīti? Kāraṇassa sannihitāsannihitabhāvato. Kiṃ pana nesaṃ kāraṇanti? Vuccatesabhāvato, parikappato vā hi iṭṭhārammaṇaṃ, somanassapaṭisandhikatā, agambhīrasabhāvatā ca idha somanassassa ",
      " kāraṇaṃ, iṭṭhamajjhattārammaṇaṃ, upekkhāpaṭisandhikatā, gambhīrasabhāvatā ca upekkhāya, diṭṭhivipannapuggalasevanā, sassatucchedāsayatā ca diṭṭhiyā, balavautubhojanādayo pana paccayā asaṅkhārikabhāvassāti. Tasmā attano anurūpakāraṇavasena nesaṃ uppajjanato katthaci citteyeva sambhavoti sakkā etehi cittassa viseso paññāpetunti. Evañca katvā nesaṃ satipi mohahetukabhāve lobhasahagatabhāvova nigamane vutto."
    ],
    "innerText": "Kasmā panettha aññesupi phassādīsu sampayuttadhammesu vijjamānesu somanassasahagatādibhāvova vuttoti? Somanassādīnameva asādhāraṇabhāvato. Phassādayo hi keci sabbacittasādhāraṇā, keci kusalādisādhāraṇā, mohādayo ca sabbākusalasādhāraṇāti na tehi sakkā cittaṃ visesetuṃ, somanassādayo pana katthaci citte honti, katthaci na hontīti pākaṭova taṃvasena cittassa viseso. Kasmā panete katthaci honti, katthaci na hontīti? Kāraṇassa sannihitāsannihitabhāvato. Kiṃ pana nesaṃ kāraṇanti? Vuccatesabhāvato, parikappato vā hi iṭṭhārammaṇaṃ, somanassapaṭisandhikatā, agambhīrasabhāvatā ca idha somanassassa kāraṇaṃ, iṭṭhamajjhattārammaṇaṃ, upekkhāpaṭisandhikatā, gambhīrasabhāvatā ca upekkhāya, diṭṭhivipannapuggalasevanā, sassatucchedāsayatā ca diṭṭhiyā, balavautubhojanādayo pana paccayā asaṅkhārikabhāvassāti. Tasmā attano anurūpakāraṇavasena nesaṃ uppajjanato katthaci citteyeva sambhavoti sakkā etehi cittassa viseso paññāpetunti. Evañca katvā nesaṃ satipi mohahetukabhāve lobhasahagatabhāvova nigamane vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesaṃ pana aṭṭhannampi ayamuppattikkamo veditabbo. Yadā hi ‘‘natthi kāmesu ādīnavo’’tyādinā nayena micchādiṭṭhiṃ purakkhatvā haṭṭhatuṭṭho kāme vā paribhuñjati, diṭṭhamaṅgalādīni vā sārato pacceti sabhāvatikkheneva anussāhitena cittena, tadā paṭhamaṃ akusalacittamuppajjati. Yadā pana mandena samussāhitena cittena, tadā dutiyaṃ. Yadā pana micchādiṭṭhiṃ apurakkhatvā kevalaṃ haṭṭhatuṭṭho methunaṃ vā sevati, parasampattiṃ vā abhijjhāyati, parabhaṇḍaṃ vā harati sabhāvatikkheneva anussāhitena cittena, tadā tatiyaṃ. Yadā pana mandena samussāhitena cittena, tadā catutthaṃ. Yadā pana kāmānaṃ vā asampattiṃ āgamma, aññesaṃ vā somanassahetūnaṃ abhāvena catūsupi vikappesu somanassarahitā honti, tadā sesāni cattāri upekkhāsahagatāni uppajjantīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhapī"
      },
      "ti pi-saddo sampiṇḍanattho, tena vakkhamānanayena akusalakammapathesu nesaṃ labbhamānakammapathānurūpato pavattibhedaṃ kāladesasantānārammaṇādibhedena anekavidhatampi saṅgaṇhāti."
    ],
    "innerText": "Imesaṃ pana aṭṭhannampi ayamuppattikkamo veditabbo. Yadā hi ‘‘natthi kāmesu ādīnavo’’tyādinā nayena micchādiṭṭhiṃ purakkhatvā haṭṭhatuṭṭho kāme vā paribhuñjati, diṭṭhamaṅgalādīni vā sārato pacceti sabhāvatikkheneva anussāhitena cittena, tadā paṭhamaṃ akusalacittamuppajjati. Yadā pana mandena samussāhitena cittena, tadā dutiyaṃ. Yadā pana micchādiṭṭhiṃ apurakkhatvā kevalaṃ haṭṭhatuṭṭho methunaṃ vā sevati, parasampattiṃ vā abhijjhāyati, parabhaṇḍaṃ vā harati sabhāvatikkheneva anussāhitena cittena, tadā tatiyaṃ. Yadā pana mandena samussāhitena cittena, tadā catutthaṃ. Yadā pana kāmānaṃ vā asampattiṃ āgamma, aññesaṃ vā somanassahetūnaṃ abhāvena catūsupi vikappesu somanassarahitā honti, tadā sesāni cattāri upekkhāsahagatāni uppajjantīti. Aṭṭhapīti pi-saddo sampiṇḍanattho, tena vakkhamānanayena akusalakammapathesu nesaṃ labbhamānakammapathānurūpato pavattibhedaṃ kāladesasantānārammaṇādibhedena anekavidhatampi saṅgaṇhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". Duṭṭhu ",
      " mano, taṃ vā etassāti dummano, tassa bhāvo domanassaṃ, mānasikadukkhavedanāyetaṃ adhivacanaṃ, tena ",
      " sahagatanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "domanassasahagataṃ"
      },
      ". Ārammaṇe paṭihaññatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭigho,"
      },
      " doso. Caṇḍikkasabhāvatāya hesa ārammaṇaṃ paṭihananto viya pavattati. Domanassasahagatassa vedanāvasena abhedepi asādhāraṇadhammavasena cittassa upalakkhaṇatthaṃ domanassaggahaṇaṃ, paṭighasampayuttabhāvo pana ubhinnaṃ ekantasahacāritā dassanatthaṃ vuttoti daṭṭhabbaṃ. Domanassañcettha aniṭṭhārammaṇānubhavanalakkhaṇo vedanākkhandhapariyāpanno eko dhammo, paṭigho caṇḍikkasabhāvo saṅkhārakkhandhapariyāpanno eko dhammoti ayametesaṃ viseso. Ettha ca yaṃ kiñci aniṭṭhārammaṇaṃ, navavidhaāghātavatthūni ca domanassassa kāraṇaṃ, paṭighassa kāraṇañcāti daṭṭhabbaṃ. Dvinnaṃ pana nesaṃ cittānaṃ pāṇātipātādīsu tikkhamandappavattikāle uppatti veditabbā. Etthāpi nigamane ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pi"
      },
      "-saddassa attho vuttanayānusārena daṭṭhabbo."
    ],
    "innerText": "5. Duṭṭhu mano, taṃ vā etassāti dummano, tassa bhāvo domanassaṃ, mānasikadukkhavedanāyetaṃ adhivacanaṃ, tena sahagatanti domanassasahagataṃ. Ārammaṇe paṭihaññatīti paṭigho, doso. Caṇḍikkasabhāvatāya hesa ārammaṇaṃ paṭihananto viya pavattati. Domanassasahagatassa vedanāvasena abhedepi asādhāraṇadhammavasena cittassa upalakkhaṇatthaṃ domanassaggahaṇaṃ, paṭighasampayuttabhāvo pana ubhinnaṃ ekantasahacāritā dassanatthaṃ vuttoti daṭṭhabbaṃ. Domanassañcettha aniṭṭhārammaṇānubhavanalakkhaṇo vedanākkhandhapariyāpanno eko dhammo, paṭigho caṇḍikkasabhāvo saṅkhārakkhandhapariyāpanno eko dhammoti ayametesaṃ viseso. Ettha ca yaṃ kiñci aniṭṭhārammaṇaṃ, navavidhaāghātavatthūni ca domanassassa kāraṇaṃ, paṭighassa kāraṇañcāti daṭṭhabbaṃ. Dvinnaṃ pana nesaṃ cittānaṃ pāṇātipātādīsu tikkhamandappavattikāle uppatti veditabbā. Etthāpi nigamane pi-saddassa attho vuttanayānusārena daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". Sabhāvaṃ vicinanto tāya kicchati kilamatīti vicikicchā. Atha vā cikicchituṃ dukkaratāya vigatā cikicchā ñāṇappaṭikāro imissāti vicikicchā, tāya sampayuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vicikicchāsampayuttaṃ"
      },
      ". Uddhatassa bhāvo uddhaccaṃ. Uddhaccassa sabbākusalasādhāraṇabhāvepi idha sampayuttadhammesu padhānaṃ hutvā pavattatīti idameva tena visesetvā vuttaṃ. Evañca katvā dhammuddesapāḷiyaṃ sesākusalesu uddhaccaṃ yevāpanakavasena vuttaṃ, idha pana ‘‘uddhaccaṃ uppajjatī’’ti sarūpeneva desitaṃ. Honti cettha –"
    ],
    "innerText": "6. Sabhāvaṃ vicinanto tāya kicchati kilamatīti vicikicchā. Atha vā cikicchituṃ dukkaratāya vigatā cikicchā ñāṇappaṭikāro imissāti vicikicchā, tāya sampayuttaṃ vicikicchāsampayuttaṃ. Uddhatassa bhāvo uddhaccaṃ. Uddhaccassa sabbākusalasādhāraṇabhāvepi idha sampayuttadhammesu padhānaṃ hutvā pavattatīti idameva tena visesetvā vuttaṃ. Evañca katvā dhammuddesapāḷiyaṃ sesākusalesu uddhaccaṃ yevāpanakavasena vuttaṃ, idha pana ‘‘uddhaccaṃ uppajjatī’’ti sarūpeneva desitaṃ. Honti cettha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sabbākusalayuttampi, uddhaccaṃ antamānase;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Balavaṃ iti taṃyeva, vuttamuddhaccayogato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Teneva hi munindena, yevāpanakanāmato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vatvā sesesu ettheva, taṃ sarūpena desita’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imāni ",
      " pana dve cittāni mūlantaravirahato atisammūḷhatāya, saṃsappanavikkhipanavasena pavattavicikicchuddhaccasamāyogena cañcalatāya ca sabbatthāpi rajjanadussanarahitāni upekkhāsahagatāneva pavattanti, tatoyeva ca sabhāvatikkhatāya ussāhetabbatāya abhāvato saṅkhārabhedopi nesaṃ natthi. Honti cettha –"
    ],
    "innerText": "Imāni pana dve cittāni mūlantaravirahato atisammūḷhatāya, saṃsappanavikkhipanavasena pavattavicikicchuddhaccasamāyogena cañcalatāya ca sabbatthāpi rajjanadussanarahitāni upekkhāsahagatāneva pavattanti, tatoyeva ca sabhāvatikkhatāya ussāhetabbatāya abhāvato saṅkhārabhedopi nesaṃ natthi. Honti cettha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Mūḷhattā ",
      " ceva saṃsappa-vikkhepā cekahetukaṃ;"
    ],
    "innerText": "‘‘Mūḷhattā ceva saṃsappa-vikkhepā cekahetukaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sopekkhaṃ sabbadā no ca, bhinnaṃ saṅkhārabhedato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Na hi tassa sabhāvena, tikkhatussāhanīyatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Atthi saṃsappamānassa, vikkhipantassa sabbadā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Mohena muyhanti atisayena muyhanti mūlantaravirahatoti momūhāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". Iccevantyādi yathāvuttānaṃ dvādasākusalacittānaṃ nigamanaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iti"
      },
      "-saddo vacanavacanīyasamudāyanidassanattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      "-saddo vacanavacanīyapaṭipāṭisandassanattho. Nipātasamudāyo vā esa vacanavacanīyanigamanārambhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iccevaṃ"
      },
      " yathāvuttanayena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbathāpi"
      },
      " somanassupekkhādiṭṭhisampayogādinā paṭighasampayogādinā vicikicchuddhaccayogenāti sabbenāpi sampayogādiākārena dvādasa akusalacittāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samattāni"
      },
      " pariniṭṭhitāni, saṅgahetvā vā attāni gahitāni, vuttānītyattho. Tattha kusalapaṭipakkhāni akusalāni mittappaṭipakkho amitto viya, paṭipakkhabhāvo ca kusalākusalānaṃ yathākkamaṃ pahāyakapahātabbabhāvena veditabbo."
    ],
    "innerText": "7. Iccevantyādi yathāvuttānaṃ dvādasākusalacittānaṃ nigamanaṃ. Tattha iti-saddo vacanavacanīyasamudāyanidassanattho. Evaṃ-saddo vacanavacanīyapaṭipāṭisandassanattho. Nipātasamudāyo vā esa vacanavacanīyanigamanārambhe. Iccevaṃ yathāvuttanayena sabbathāpi somanassupekkhādiṭṭhisampayogādinā paṭighasampayogādinā vicikicchuddhaccayogenāti sabbenāpi sampayogādiākārena dvādasa akusalacittāni samattāni pariniṭṭhitāni, saṅgahetvā vā attāni gahitāni, vuttānītyattho. Tattha kusalapaṭipakkhāni akusalāni mittappaṭipakkho amitto viya, paṭipakkhabhāvo ca kusalākusalānaṃ yathākkamaṃ pahāyakapahātabbabhāvena veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhadhā"
      },
      "tyādi saṅgahagāthā. Lobho ca so suppatiṭṭhitabhāvasādhanena mūlasadisattā mūlañca, kaṃ etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lobhamūlāni"
      },
      " cittāni vedanādibhedato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhadhā"
      },
      " siyuṃ ",
      ". Tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dosamūlāni"
      },
      " saṅkhārabhedato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvidhā. Mohamūlāni"
      },
      " suddho mohoyeva mūlametesanti mohamūlasaṅkhātāni sampayogabhedato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dve cā"
      },
      "ti akusalā dvādasa siyuntyattho."
    ],
    "innerText": "8.Aṭṭhadhātyādi saṅgahagāthā. Lobho ca so suppatiṭṭhitabhāvasādhanena mūlasadisattā mūlañca, kaṃ etesanti lobhamūlāni cittāni vedanādibhedato aṭṭhadhā siyuṃ . Tathā dosamūlāni saṅkhārabhedato dvidhā. Mohamūlāni suddho mohoyeva mūlametesanti mohamūlasaṅkhātāni sampayogabhedato dve cāti akusalā dvādasa siyuntyattho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Akusalacittavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ahetukacittavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ". Evaṃ mūlabhedato tividhampi akusalaṃ sampayogādibhedato dvādasadhā vibhajitvā idāni ",
      " ahetukacittāni niddisanto tesaṃ akusalavipākādivasena tividhabhāvepi akusalānantaraṃ akusalavipākeyeva cakkhādinissayasampaṭicchanādikiccabhedena sattadhā vibhajituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘upekkhāsahagataṃ cakkhuviññāṇa’’"
      },
      "ntyādimāha. Tattha cakkhati viññāṇādhiṭṭhitaṃ hutvā samavisamaṃ ācikkhantaṃ viya hotīti cakkhu. Atha vā cakkhati rūpaṃ assādentaṃ viya hotīti cakkhu. Cakkhatīti hi ayaṃ saddo ‘‘madhuṃ cakkhati, byañjanaṃ cakkhatī’’tyādīsu viya assādanattho hoti. Tenāha bhagavā – ‘‘cakkhuṃ kho pana, māgaṇḍiya, rūpārāmaṃ rūparataṃ rūpasammudita’’ntyādi. Yadi evaṃ ‘‘sotaṃ kho, māgaṇḍiya, saddārāmaṃ saddarataṃ saddasammudita’’ntyādivacanato (ma. ni. 2.209) sotādīnampi saddādiassādanaṃ atthīti tesampi cakkhusaddābhidheyyatā āpajjeyyāti? Nāpajjati niruḷhattā, niruḷho hesa cakkhu-saddo daṭṭhukāmatānidānakammajabhūtappasādalakkhaṇe cakkhuppasādeyeva mayūrādisaddā viya sakuṇavisesādīsu, cakkhunā sahavuttiyā pana bhamukaṭṭhiparicchinno maṃsapiṇḍopi ‘‘cakkhū’’ti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhakathāyaṃ"
      },
      " pana anekatthattā dhātūnaṃ cakkhati-saddassa vibhāvanatthatāpi sambhavatīti ‘‘cakkhati rūpaṃ vibhāvetīti cakkhū’’ti (visuddhi. 2.510) vuttaṃ. Cakkhusmiṃ ",
      " viññāṇaṃ tannissitatthāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhuviññāṇaṃ"
      },
      ". Tathā hetaṃ ‘‘cakkhusannissitarūpavijānanalakkhaṇa’’nti (dha. sa. aṭṭha. 431; visuddhi. 2.454) vuttaṃ."
    ],
    "innerText": "9. Evaṃ mūlabhedato tividhampi akusalaṃ sampayogādibhedato dvādasadhā vibhajitvā idāni ahetukacittāni niddisanto tesaṃ akusalavipākādivasena tividhabhāvepi akusalānantaraṃ akusalavipākeyeva cakkhādinissayasampaṭicchanādikiccabhedena sattadhā vibhajituṃ ‘‘upekkhāsahagataṃ cakkhuviññāṇa’’ntyādimāha. Tattha cakkhati viññāṇādhiṭṭhitaṃ hutvā samavisamaṃ ācikkhantaṃ viya hotīti cakkhu. Atha vā cakkhati rūpaṃ assādentaṃ viya hotīti cakkhu. Cakkhatīti hi ayaṃ saddo ‘‘madhuṃ cakkhati, byañjanaṃ cakkhatī’’tyādīsu viya assādanattho hoti. Tenāha bhagavā – ‘‘cakkhuṃ kho pana, māgaṇḍiya, rūpārāmaṃ rūparataṃ rūpasammudita’’ntyādi. Yadi evaṃ ‘‘sotaṃ kho, māgaṇḍiya, saddārāmaṃ saddarataṃ saddasammudita’’ntyādivacanato (ma. ni. 2.209) sotādīnampi saddādiassādanaṃ atthīti tesampi cakkhusaddābhidheyyatā āpajjeyyāti? Nāpajjati niruḷhattā, niruḷho hesa cakkhu-saddo daṭṭhukāmatānidānakammajabhūtappasādalakkhaṇe cakkhuppasādeyeva mayūrādisaddā viya sakuṇavisesādīsu, cakkhunā sahavuttiyā pana bhamukaṭṭhiparicchinno maṃsapiṇḍopi ‘‘cakkhū’’ti vuccati. Aṭṭhakathāyaṃ pana anekatthattā dhātūnaṃ cakkhati-saddassa vibhāvanatthatāpi sambhavatīti ‘‘cakkhati rūpaṃ vibhāvetīti cakkhū’’ti (visuddhi. 2.510) vuttaṃ. Cakkhusmiṃ viññāṇaṃ tannissitatthāti cakkhuviññāṇaṃ. Tathā hetaṃ ‘‘cakkhusannissitarūpavijānanalakkhaṇa’’nti (dha. sa. aṭṭha. 431; visuddhi. 2.454) vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sotaviññāṇā"
      },
      "dīsupi yathārahaṃ daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Tathā’’"
      },
      "ti iminā upekkhāsahagatabhāvaṃ atidisati. Viññāṇādhiṭṭhitaṃ hutvā suṇātīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sotaṃ"
      },
      ". Ghāyati gandhopādānaṃ karotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ghānaṃ"
      },
      ". Jīvitanimittaṃ raso jīvitaṃ, taṃ avhāyati tasmiṃ ninnatāyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jivhā"
      },
      " niruttinayena. Kucchitānaṃ pāpadhammānaṃ āyo pavattiṭṭhānanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyo"
      },
      ". Kāyindriyañhi phoṭṭhabbaggahaṇasabhāvattā tadassādavasappavattānaṃ, tammūlakānañca pāpadhammānaṃ visesakāraṇanti tesaṃ pavattiṭṭhānaṃ viya gayhati. Sasambhārakāyo vā kucchitānaṃ kesādīnaṃ āyoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyo"
      },
      ". Taṃsahacaritattā pana pasādakāyopi tathā vuccati. Du kucchitaṃ hutvā khanati kāyikasukhaṃ, dukkhamanti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhaṃ"
      },
      ". Dukkaramokāsadānaṃ etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkha’’"
      },
      "ntipi apare. Pañcaviññāṇaggahitaṃ rūpādiārammaṇaṃ sampaṭicchati tadākārappavattiyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampaṭicchanaṃ"
      },
      ". Sammā tīreti yathāsampaṭicchitaṃ rūpādiārammaṇaṃ vīmaṃsatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "santīraṇaṃ"
      },
      ". Aññamaññaviruddhānaṃ kusalākusalānaṃ pākāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipākā,"
      },
      " vipakkabhāvamāpannānaṃ arūpadhammānametaṃ adhivacanaṃ. Evañca katvā kusalākusalakammasamuṭṭhānānampi ",
      " kaṭattārūpānaṃ natthi vipākavohāro. Akusalassa vipākacittāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akusalavipākacittāni"
      },
      "."
    ],
    "innerText": "Evaṃ sotaviññāṇādīsupi yathārahaṃ daṭṭhabbaṃ. ‘‘Tathā’’ti iminā upekkhāsahagatabhāvaṃ atidisati. Viññāṇādhiṭṭhitaṃ hutvā suṇātīti sotaṃ. Ghāyati gandhopādānaṃ karotīti ghānaṃ. Jīvitanimittaṃ raso jīvitaṃ, taṃ avhāyati tasmiṃ ninnatāyāti jivhā niruttinayena. Kucchitānaṃ pāpadhammānaṃ āyo pavattiṭṭhānanti kāyo. Kāyindriyañhi phoṭṭhabbaggahaṇasabhāvattā tadassādavasappavattānaṃ, tammūlakānañca pāpadhammānaṃ visesakāraṇanti tesaṃ pavattiṭṭhānaṃ viya gayhati. Sasambhārakāyo vā kucchitānaṃ kesādīnaṃ āyoti kāyo. Taṃsahacaritattā pana pasādakāyopi tathā vuccati. Du kucchitaṃ hutvā khanati kāyikasukhaṃ, dukkhamanti vā dukkhaṃ. Dukkaramokāsadānaṃ etassāti dukkha’’ntipi apare. Pañcaviññāṇaggahitaṃ rūpādiārammaṇaṃ sampaṭicchati tadākārappavattiyāti sampaṭicchanaṃ. Sammā tīreti yathāsampaṭicchitaṃ rūpādiārammaṇaṃ vīmaṃsatīti santīraṇaṃ. Aññamaññaviruddhānaṃ kusalākusalānaṃ pākāti vipākā, vipakkabhāvamāpannānaṃ arūpadhammānametaṃ adhivacanaṃ. Evañca katvā kusalākusalakammasamuṭṭhānānampi kaṭattārūpānaṃ natthi vipākavohāro. Akusalassa vipākacittāni akusalavipākacittāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ". Sukhayati kāyacittaṃ, suṭṭhu vā khanati kāyacittābādhaṃ, sukhena khamitabbanti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhaṃ"
      },
      ". ‘‘Sukaramokāsadānaṃ etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukha’’"
      },
      "nti apare. Kasmā pana yathā akusalavipākasantīraṇaṃ ekameva vuttaṃ, evamavatvā kusalavipākasantīraṇaṃ dvidhā vuttanti? Iṭṭhaiṭṭhamajjhattārammaṇavasena vedanābhedasambhavato. Yadi evaṃ tatthāpi aniṭṭhaaniṭṭhamajjhattārammaṇavasena vedanābhedena bhavitabbanti? Nayidamevaṃ aniṭṭhārammaṇe ",
      " uppajjitabbassapi domanassassa paṭighena vinā anuppajjanato, paṭighassa ca ekantākusalasabhāvassa abyākatesu asambhavato. Na hi bhinnajātiko dhammo bhinnajātikesu upalabbhati, tasmā attanā samānayogakkhamassa asambhavato akusalavipākesu domanassaṃ na sambhavatīti tassa taṃsahagatatā na vuttā. Atha vā yathā koci balavatā pothiyamāno dubbalapuriso tassa paṭippaharituṃ asakkonto tasmiṃ upekkhakova hoti, evameva akusalavipākānaṃ paridubbalabhāvato aniṭṭhārammaṇepi domanassuppādo natthīti santīraṇaṃ upekkhāsahagatameva."
    ],
    "innerText": "10. Sukhayati kāyacittaṃ, suṭṭhu vā khanati kāyacittābādhaṃ, sukhena khamitabbanti vā sukhaṃ. ‘‘Sukaramokāsadānaṃ etassāti sukha’’nti apare. Kasmā pana yathā akusalavipākasantīraṇaṃ ekameva vuttaṃ, evamavatvā kusalavipākasantīraṇaṃ dvidhā vuttanti? Iṭṭhaiṭṭhamajjhattārammaṇavasena vedanābhedasambhavato. Yadi evaṃ tatthāpi aniṭṭhaaniṭṭhamajjhattārammaṇavasena vedanābhedena bhavitabbanti? Nayidamevaṃ aniṭṭhārammaṇe uppajjitabbassapi domanassassa paṭighena vinā anuppajjanato, paṭighassa ca ekantākusalasabhāvassa abyākatesu asambhavato. Na hi bhinnajātiko dhammo bhinnajātikesu upalabbhati, tasmā attanā samānayogakkhamassa asambhavato akusalavipākesu domanassaṃ na sambhavatīti tassa taṃsahagatatā na vuttā. Atha vā yathā koci balavatā pothiyamāno dubbalapuriso tassa paṭippaharituṃ asakkonto tasmiṃ upekkhakova hoti, evameva akusalavipākānaṃ paridubbalabhāvato aniṭṭhārammaṇepi domanassuppādo natthīti santīraṇaṃ upekkhāsahagatameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cakkhuviññāṇādīni pana cattāri ubhayavipākānipi vatthārammaṇaghaṭṭanāya dubbalabhāvato aniṭṭhe iṭṭhepi ca ārammaṇe upekkhāsahagatāneva. Tesañhi catunnampi vatthubhūtāni cakkhādīni upādārūpāneva, tathā ārammaṇabhūtānipi rūpādīni, upādārūpakena ca upādārūpakassa saṅghaṭṭanaṃ atidubbalaṃ picupiṇḍakena picupiṇḍakassa phusanaṃ viya, tasmā tāni sabbathāpi upekkhāsahagatāneva. Kāyaviññāṇassa pana phoṭṭhabbasaṅkhātabhūtattayameva ārammaṇanti taṃ kāyappasāde saṅghaṭṭitampi taṃ atikkamitvā tannissayesu mahābhūtesu paṭihaññati. Bhūtarūpehi ca bhūtarūpānaṃ saṅghaṭṭanaṃ balavataraṃ adhikaraṇimatthake picupiṇḍakaṃ ṭhapetvā kūṭena pahaṭakāle kūṭassa picupiṇḍakaṃ atikkamitvā adhikaraṇiggahaṇaṃ viya, tasmā vatthārammaṇaghaṭṭanāya balavabhāvato kāyaviññāṇaṃ aniṭṭhe dukkhasahagataṃ, iṭṭhe sukhasahagatanti. Sampaṭicchanayugaḷhaṃ pana attanā asamānanissayānaṃ cakkhuviññāṇādīnamanantaraṃ uppajjatīti samānanissayato aladdhānantarapaccayatāya sabhāgūpatthambharahito viya puriso nātibalavaṃ sabbathāpi visayarasamanubhavituṃ na sakkotīti sabbathāpi upekkhāsahagatameva. Vuttavipariyāyato kusalavipākasantīraṇaṃ iṭṭhaiṭṭhamajjhattārammaṇesu ",
      " sukhopekkhāsahagatanti. Yadi evaṃ āvajjanadvayassa ",
      " upekkhāsampayogaṃ kasmā vakkhati, nanu tampi samānanissayānantaraṃ pavattatīti? Saccaṃ, tattha pana purimaṃ pubbe kenaci aggahiteyeva ārammaṇe ekavārameva pavattati, pacchimampi visadisacittasantānaparāvattanavasena byāpārantarasāpekkhanti na sabbathāpi visayarasamanubhavituṃ sakkoti, tasmā majjhattavedanāsampayuttamevāti. Honti cettha –"
    ],
    "innerText": "Cakkhuviññāṇādīni pana cattāri ubhayavipākānipi vatthārammaṇaghaṭṭanāya dubbalabhāvato aniṭṭhe iṭṭhepi ca ārammaṇe upekkhāsahagatāneva. Tesañhi catunnampi vatthubhūtāni cakkhādīni upādārūpāneva, tathā ārammaṇabhūtānipi rūpādīni, upādārūpakena ca upādārūpakassa saṅghaṭṭanaṃ atidubbalaṃ picupiṇḍakena picupiṇḍakassa phusanaṃ viya, tasmā tāni sabbathāpi upekkhāsahagatāneva. Kāyaviññāṇassa pana phoṭṭhabbasaṅkhātabhūtattayameva ārammaṇanti taṃ kāyappasāde saṅghaṭṭitampi taṃ atikkamitvā tannissayesu mahābhūtesu paṭihaññati. Bhūtarūpehi ca bhūtarūpānaṃ saṅghaṭṭanaṃ balavataraṃ adhikaraṇimatthake picupiṇḍakaṃ ṭhapetvā kūṭena pahaṭakāle kūṭassa picupiṇḍakaṃ atikkamitvā adhikaraṇiggahaṇaṃ viya, tasmā vatthārammaṇaghaṭṭanāya balavabhāvato kāyaviññāṇaṃ aniṭṭhe dukkhasahagataṃ, iṭṭhe sukhasahagatanti. Sampaṭicchanayugaḷhaṃ pana attanā asamānanissayānaṃ cakkhuviññāṇādīnamanantaraṃ uppajjatīti samānanissayato aladdhānantarapaccayatāya sabhāgūpatthambharahito viya puriso nātibalavaṃ sabbathāpi visayarasamanubhavituṃ na sakkotīti sabbathāpi upekkhāsahagatameva. Vuttavipariyāyato kusalavipākasantīraṇaṃ iṭṭhaiṭṭhamajjhattārammaṇesu sukhopekkhāsahagatanti. Yadi evaṃ āvajjanadvayassa upekkhāsampayogaṃ kasmā vakkhati, nanu tampi samānanissayānantaraṃ pavattatīti? Saccaṃ, tattha pana purimaṃ pubbe kenaci aggahiteyeva ārammaṇe ekavārameva pavattati, pacchimampi visadisacittasantānaparāvattanavasena byāpārantarasāpekkhanti na sabbathāpi visayarasamanubhavituṃ sakkoti, tasmā majjhattavedanāsampayuttamevāti. Honti cettha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vatthālambasabhāvānaṃ, bhūtikānañhi ghaṭṭanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dubbalaṃ iti cakkhādi-catucittamupekkhakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kāyanissayaphoṭṭhabba-bhūtānaṃ ghaṭṭanāya tu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Balavattā na viññāṇaṃ, kāyika majjhavedanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Samānanissayo yasmā, natthānantarapaccayo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā dubbalamālambe, sopekkhaṃ sampaṭicchana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kusalassa vipākāni, sampayuttahetuvirahato ahetukacittāni cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kusalavipākāhetukacittāni"
      },
      ". Nibbattakahetuvasena nipphannānipi hetāni sampayuttahetuvaseneva ahetukavohāraṃ labhanti, itarathā mahāvipākehi imesaṃ nānattāsambhavato. Kiṃ panettha kāraṇaṃ yathā idhevaṃ akusalavipākanigamane ahetukaggahaṇaṃ na katanti? Byabhicārābhāvato. Sati hi sambhave, byabhicāre ca visesanaṃ sātthakaṃ siyā. Akusalavipākānaṃ pana lobhādisāvajjadhammavipākabhāvena tabbidhurehi, alobhādīhi sampayogāyogato, sayaṃ abyākataniravajjasabhāvānaṃ lobhādiakusaladhammasampayogavirodhato ca natthi kadācipi sahetukatāya sambhavoti ahetukabhāvābyabhicārato ",
      " na tāni ahetukasaddena visesitabbāni."
    ],
    "innerText": "Kusalassa vipākāni, sampayuttahetuvirahato ahetukacittāni cāti kusalavipākāhetukacittāni. Nibbattakahetuvasena nipphannānipi hetāni sampayuttahetuvaseneva ahetukavohāraṃ labhanti, itarathā mahāvipākehi imesaṃ nānattāsambhavato. Kiṃ panettha kāraṇaṃ yathā idhevaṃ akusalavipākanigamane ahetukaggahaṇaṃ na katanti? Byabhicārābhāvato. Sati hi sambhave, byabhicāre ca visesanaṃ sātthakaṃ siyā. Akusalavipākānaṃ pana lobhādisāvajjadhammavipākabhāvena tabbidhurehi, alobhādīhi sampayogāyogato, sayaṃ abyākataniravajjasabhāvānaṃ lobhādiakusaladhammasampayogavirodhato ca natthi kadācipi sahetukatāya sambhavoti ahetukabhāvābyabhicārato na tāni ahetukasaddena visesitabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". Idāni ahetukādhikāre ahetukakiriyacittānipi kiccabhedena tidhā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘upekkhāsahagata’’"
      },
      "ntyādi vuttaṃ. Cakkhādipañcadvāre ghaṭṭitamārammaṇaṃ āvajjeti tattha ābhogaṃ karoti, cittasantānaṃ vā bhavaṅgavasena pavattituṃ adatvā vīthicittabhāvāya pariṇāmetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcadvārāvajjanaṃ,"
      },
      " kiriyāhetukamanodhātucittaṃ. Āvajjanassa anantarapaccayabhūtaṃ bhavaṅgacittaṃ manodvāraṃ vīthicittānaṃ pavattimukhabhāvato. Tasmiṃ diṭṭhasutamutādivasena āpāthamāgatamārammaṇaṃ āvajjeti ",
      ", vuttanayena vā cittasantānaṃ pariṇāmetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manodvārāvajjanaṃ,"
      },
      " kiriyāhetukamanoviññāṇadhātuupekkhāsahagatacittaṃ. Idameva ca pañcadvāre yathāsantīritaṃ ārammaṇaṃ vavatthapetīti voṭṭhabbananti ca vuccati. Hasitaṃ uppādetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hasituppādaṃ,"
      },
      " khīṇāsavānaṃ anoḷārikārammaṇesu pahaṭṭhākāramattahetukaṃ kiriyāhetukamanoviññāṇadhātusomanassasahagatacittaṃ."
    ],
    "innerText": "11. Idāni ahetukādhikāre ahetukakiriyacittānipi kiccabhedena tidhā dassetuṃ ‘‘upekkhāsahagata’’ntyādi vuttaṃ. Cakkhādipañcadvāre ghaṭṭitamārammaṇaṃ āvajjeti tattha ābhogaṃ karoti, cittasantānaṃ vā bhavaṅgavasena pavattituṃ adatvā vīthicittabhāvāya pariṇāmetīti pañcadvārāvajjanaṃ, kiriyāhetukamanodhātucittaṃ. Āvajjanassa anantarapaccayabhūtaṃ bhavaṅgacittaṃ manodvāraṃ vīthicittānaṃ pavattimukhabhāvato. Tasmiṃ diṭṭhasutamutādivasena āpāthamāgatamārammaṇaṃ āvajjeti , vuttanayena vā cittasantānaṃ pariṇāmetīti manodvārāvajjanaṃ, kiriyāhetukamanoviññāṇadhātuupekkhāsahagatacittaṃ. Idameva ca pañcadvāre yathāsantīritaṃ ārammaṇaṃ vavatthapetīti voṭṭhabbananti ca vuccati. Hasitaṃ uppādetīti hasituppādaṃ, khīṇāsavānaṃ anoḷārikārammaṇesu pahaṭṭhākāramattahetukaṃ kiriyāhetukamanoviññāṇadhātusomanassasahagatacittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbathāpī"
      },
      "ti akusalavipākakusalavipākakiriyabhedena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhārasā"
      },
      "ti gaṇanaparicchedo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahetukacittānī"
      },
      "ti paricchinnadhammanidassanaṃ."
    ],
    "innerText": "12.Sabbathāpīti akusalavipākakusalavipākakiriyabhedena. Aṭṭhārasāti gaṇanaparicchedo. Ahetukacittānīti paricchinnadhammanidassanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ahetukacittavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sobhanacittavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Evaṃ dvādasākusalaahetukāṭṭhārasavasena samatiṃsa cittāni dassetvā idāni tabbinimuttānaṃ sobhanavohāraṃ ṭhapetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pāpāhetukamuttānī’’"
      },
      "tyādi vuttaṃ. Attanā adhisayitassa apāyādidukkhassa pāpanato pāpehi ",
      ", hetusampayogābhāvato ahetukehi ca muttāni catuvīsatikāmāvacarapañcatiṃsamahaggatalokuttaravasena ekūnasaṭṭhiparimāṇāni, atha vā aṭṭha lokuttarāni jhānaṅgayogabhedena paccekaṃ pañcadhā katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekanavutipi"
      },
      " cittāni sobhanaguṇāvahanato, alobhādianavajjahetusampayogato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sobhanānīti vuccare"
      },
      " kathīyanti."
    ],
    "innerText": "14. Evaṃ dvādasākusalaahetukāṭṭhārasavasena samatiṃsa cittāni dassetvā idāni tabbinimuttānaṃ sobhanavohāraṃ ṭhapetuṃ ‘‘pāpāhetukamuttānī’’tyādi vuttaṃ. Attanā adhisayitassa apāyādidukkhassa pāpanato pāpehi , hetusampayogābhāvato ahetukehi ca muttāni catuvīsatikāmāvacarapañcatiṃsamahaggatalokuttaravasena ekūnasaṭṭhiparimāṇāni, atha vā aṭṭha lokuttarāni jhānaṅgayogabhedena paccekaṃ pañcadhā katvā ekanavutipi cittāni sobhanaguṇāvahanato, alobhādianavajjahetusampayogato ca sobhanānīti vuccare kathīyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Kāmāvacarasobhanacittavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". Idāni sobhanesu kāmāvacarānameva paṭhamaṃ uddiṭṭhattā tesupi abyākatānaṃ kusalapubbakattā paṭhamaṃ kāmāvacarakusalaṃ, tato tabbipākaṃ, tadanantaraṃ tadekabhūmipariyāpannaṃ kiriyacittañca paccekaṃ vedanāñāṇasaṅkhārabhedena aṭṭhadhā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘somanassasahagata’’"
      },
      "ntyādi vuttaṃ. Tattha jānāti yathāsabhāvaṃ paṭivijjhatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñāṇaṃ"
      },
      ". Sesaṃ vuttanayameva. Ettha ca balavasaddhāya dassanasampattiyā paccayapaṭiggāhakādisampattiyāti evamādīhi kāraṇehi somanassasahagatatā, paññāsaṃvattanikakammato, abyāpajjalokūpapattito, indriyaparipākato, kilesadūrībhāvato ",
      " ca ñāṇasampayuttatā, tabbipariyāyena upekkhāsahagatatā ceva ñāṇavippayuttatā ca, āvāsasappāyādivasena kāyacittānaṃ kallabhāvato, pubbe dānādīsu kataparicayatādīhi ca asaṅkhārikatā, tabbipariyāyena sasaṅkhārikatā ca veditabbā."
    ],
    "innerText": "15. Idāni sobhanesu kāmāvacarānameva paṭhamaṃ uddiṭṭhattā tesupi abyākatānaṃ kusalapubbakattā paṭhamaṃ kāmāvacarakusalaṃ, tato tabbipākaṃ, tadanantaraṃ tadekabhūmipariyāpannaṃ kiriyacittañca paccekaṃ vedanāñāṇasaṅkhārabhedena aṭṭhadhā dassetuṃ ‘‘somanassasahagata’’ntyādi vuttaṃ. Tattha jānāti yathāsabhāvaṃ paṭivijjhatīti ñāṇaṃ. Sesaṃ vuttanayameva. Ettha ca balavasaddhāya dassanasampattiyā paccayapaṭiggāhakādisampattiyāti evamādīhi kāraṇehi somanassasahagatatā, paññāsaṃvattanikakammato, abyāpajjalokūpapattito, indriyaparipākato, kilesadūrībhāvato ca ñāṇasampayuttatā, tabbipariyāyena upekkhāsahagatatā ceva ñāṇavippayuttatā ca, āvāsasappāyādivasena kāyacittānaṃ kallabhāvato, pubbe dānādīsu kataparicayatādīhi ca asaṅkhārikatā, tabbipariyāyena sasaṅkhārikatā ca veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yadā pana yo deyyadhammapaṭiggāhakādisampattiṃ, aññaṃ vā somanassahetuṃ āgamma haṭṭhapahaṭṭho ‘‘atthi dinna’’ntyādinayappavattaṃ sammādiṭṭhiṃ purakkhatvā muttacāgatādivasena asaṃsīdanto anussāhito parehi dānādīni puññāni karoti, tadāssa cittaṃ somanassasahagataṃ ñāṇasampayuttaṃ asaṅkhārikaṃ hoti. Yadā pana vuttanayeneva haṭṭhatuṭṭho sammādiṭṭhiṃ ",
      " purakkhatvāpi amuttacāgatādivasena saṃsīdamāno parehi vā ussāhito karoti, tadāssa tadeva cittaṃ sasaṅkhārikaṃ hoti. Yadā pana ñātijanassa paṭipattidassanena jātaparicayā bāladārakā bhikkhū disvā somanassajātā sahasā kiñcideva hatthagataṃ dadanti vā vandanti vā, tadā tesaṃ tatiyaṃ cittaṃ uppajjati. Yadā pana ‘‘detha, vandathā’’ti ñātīhi ussāhitā evaṃ paṭipajjanti, tadā catutthaṃ cittaṃ uppajjati. Yadā pana deyyadhammapaṭiggāhakādīnaṃ asampattiṃ, aññesaṃ vā somanassahetūnaṃ abhāvaṃ āgamma catūsupi vikappesu somanassarahitā honti, tadā sesāni cattāri upekkhāsahagatāni uppajjantīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhapī"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pi"
      },
      "-saddena dasapuññakiriyādivasena anekavidhataṃ sampiṇḍeti. Tathā hi vadanti –"
    ],
    "innerText": "Tattha yadā pana yo deyyadhammapaṭiggāhakādisampattiṃ, aññaṃ vā somanassahetuṃ āgamma haṭṭhapahaṭṭho ‘‘atthi dinna’’ntyādinayappavattaṃ sammādiṭṭhiṃ purakkhatvā muttacāgatādivasena asaṃsīdanto anussāhito parehi dānādīni puññāni karoti, tadāssa cittaṃ somanassasahagataṃ ñāṇasampayuttaṃ asaṅkhārikaṃ hoti. Yadā pana vuttanayeneva haṭṭhatuṭṭho sammādiṭṭhiṃ purakkhatvāpi amuttacāgatādivasena saṃsīdamāno parehi vā ussāhito karoti, tadāssa tadeva cittaṃ sasaṅkhārikaṃ hoti. Yadā pana ñātijanassa paṭipattidassanena jātaparicayā bāladārakā bhikkhū disvā somanassajātā sahasā kiñcideva hatthagataṃ dadanti vā vandanti vā, tadā tesaṃ tatiyaṃ cittaṃ uppajjati. Yadā pana ‘‘detha, vandathā’’ti ñātīhi ussāhitā evaṃ paṭipajjanti, tadā catutthaṃ cittaṃ uppajjati. Yadā pana deyyadhammapaṭiggāhakādīnaṃ asampattiṃ, aññesaṃ vā somanassahetūnaṃ abhāvaṃ āgamma catūsupi vikappesu somanassarahitā honti, tadā sesāni cattāri upekkhāsahagatāni uppajjantīti. Aṭṭhapīti pi-saddena dasapuññakiriyādivasena anekavidhataṃ sampiṇḍeti. Tathā hi vadanti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kamena puññavatthūhi, gocarādhipatīhi ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kammahīnādito ceva, gaṇeyya nayakovido’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imāni hi aṭṭha cittāni dasapuññakiriyavatthuvasena pavattanato paccekaṃ dasa dasāti katvā asīti cittāni honti, tāni ca chasu ārammaṇesu pavattanato paccekaṃ chagguṇitāni sāsītikāni cattāri satāni honti, adhipatibhedena pana ñāṇavippayuttānaṃ cattālīsādhikadvisataparimāṇānaṃ vīmaṃsādhipatisampayogābhāvato tāni tiṇṇaṃ adhipatīnaṃ vasena tiguṇitāni vīsādhikāni sattasatāni, tathā ñāṇasampayuttāni ca catunnaṃ adhipatīnaṃ vasena catugguṇitāni sasaṭṭhikāni nava satānīti evaṃ adhipativasena sahassaṃ sāsītikāni ca cha satāni honti, tāni kāyavacīmanokammasaṅkhātakammattikavasena tiguṇitāni cattālīsādhikāni pañca ",
      " sahassāni honti, tāni ca hīnamajjhimapaṇītabhedato tiguṇitāni vīsasatādhikapannarasasahassāni honti. Yaṃ pana vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ācariyabuddhadattattherena"
      },
      " –"
    ],
    "innerText": "Imāni hi aṭṭha cittāni dasapuññakiriyavatthuvasena pavattanato paccekaṃ dasa dasāti katvā asīti cittāni honti, tāni ca chasu ārammaṇesu pavattanato paccekaṃ chagguṇitāni sāsītikāni cattāri satāni honti, adhipatibhedena pana ñāṇavippayuttānaṃ cattālīsādhikadvisataparimāṇānaṃ vīmaṃsādhipatisampayogābhāvato tāni tiṇṇaṃ adhipatīnaṃ vasena tiguṇitāni vīsādhikāni sattasatāni, tathā ñāṇasampayuttāni ca catunnaṃ adhipatīnaṃ vasena catugguṇitāni sasaṭṭhikāni nava satānīti evaṃ adhipativasena sahassaṃ sāsītikāni ca cha satāni honti, tāni kāyavacīmanokammasaṅkhātakammattikavasena tiguṇitāni cattālīsādhikāni pañca sahassāni honti, tāni ca hīnamajjhimapaṇītabhedato tiguṇitāni vīsasatādhikapannarasasahassāni honti. Yaṃ pana vuttaṃ ācariyabuddhadattattherena –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Sattarasa ",
      " sahassāni, dve satāni asīti ca;"
    ],
    "innerText": "‘‘Sattarasa sahassāni, dve satāni asīti ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kāmāvacarapuññāni, bhavantīti viniddise’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Taṃ adhipativasena gaṇanaparihāniṃ anādiyitvā sotapatitavasena vuttanti daṭṭhabbaṃ, kāladesādibhedena pana nesaṃ bhedo appameyyova."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kucchite (dha. sa. aṭṭha. 1) pāpadhamme salayanti kampenti viddhaṃsenti apagamentīti vā kusalāni. Atha vā kucchitākārena santāne sayanato pavattanato kusasaṅkhāte pāpadhamme lunanti chindantīti kusalāni. Atha vā kucchite pāpadhamme sānato tanukaraṇato osānakaraṇato vā kusasaṅkhātena ñāṇena, saddhādidhammajātena vā lātabbāni sahajātaupanissayabhāvena yathārahaṃ pavattetabbānīti kusalāni, tāneva yathāvuttatthena kāmāvacarāni kusalacittāni cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmāvacarakusalacittāni"
      },
      "."
    ],
    "innerText": "Kucchite (dha. sa. aṭṭha. 1) pāpadhamme salayanti kampenti viddhaṃsenti apagamentīti vā kusalāni. Atha vā kucchitākārena santāne sayanato pavattanato kusasaṅkhāte pāpadhamme lunanti chindantīti kusalāni. Atha vā kucchite pāpadhamme sānato tanukaraṇato osānakaraṇato vā kusasaṅkhātena ñāṇena, saddhādidhammajātena vā lātabbāni sahajātaupanissayabhāvena yathārahaṃ pavattetabbānīti kusalāni, tāneva yathāvuttatthena kāmāvacarāni kusalacittāni cāti kāmāvacarakusalacittāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". Yathā panetāni puññakiriyavasena, kammadvāravasena, kammavasena, adhipativasena ca pavattanti, nevaṃ vipākāni dānādivasena appavattanato, viññattisamuṭṭhāpanābhāvato, avipākasabhāvato, chandādīni purakkhatvā appavattito ca, tasmā taṃvasena parihāpetvā yathārahaṃ gaṇanabhedo yojetabbo. Imānipi iṭṭhaiṭṭhamajjhattārammaṇavasena yathākkamaṃ somanassupekkhāsahitāni. Paṭisandhādivasappavattiyaṃ kammassa balavābalavabhāvato, tadārammaṇappavattiyaṃ yebhuyyena javanānurūpato, kadāci tatthāpi kammānurūpato ca ñāṇasampayuttāni, ñāṇavippayuttāni ca honti. Yathāpayogaṃ vinā sappayogañca yathāupaṭṭhitehi kammādipaccayehi utubhojanādisappāyāsappāyavasena asaṅkhārikasasaṅkhārikāni."
    ],
    "innerText": "16. Yathā panetāni puññakiriyavasena, kammadvāravasena, kammavasena, adhipativasena ca pavattanti, nevaṃ vipākāni dānādivasena appavattanato, viññattisamuṭṭhāpanābhāvato, avipākasabhāvato, chandādīni purakkhatvā appavattito ca, tasmā taṃvasena parihāpetvā yathārahaṃ gaṇanabhedo yojetabbo. Imānipi iṭṭhaiṭṭhamajjhattārammaṇavasena yathākkamaṃ somanassupekkhāsahitāni. Paṭisandhādivasappavattiyaṃ kammassa balavābalavabhāvato, tadārammaṇappavattiyaṃ yebhuyyena javanānurūpato, kadāci tatthāpi kammānurūpato ca ñāṇasampayuttāni, ñāṇavippayuttāni ca honti. Yathāpayogaṃ vinā sappayogañca yathāupaṭṭhitehi kammādipaccayehi utubhojanādisappāyāsappāyavasena asaṅkhārikasasaṅkhārikāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ". Kiriyacittānampi ",
      " kusale vuttanayena yathārahaṃ somanassasahagatāditā veditabbā."
    ],
    "innerText": "17. Kiriyacittānampi kusale vuttanayena yathārahaṃ somanassasahagatāditā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahetukakāmāvacarakusalavipākakiriyacittānī"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahetukaggahaṇaṃ"
      },
      " vipākakiriyāpekkhaṃ ",
      " visesanaṃ kusalassa ekantasahetukattā. Hoti hi yathālābhayojanā, ‘‘sakkharakathalampi macchagumbampi carantampi tiṭṭhantampī’’tyādīsu (dī. ni. 1.249) viya sakkharakathalassa caraṇāyogato macchagumbāpekkhāya caraṇakiriyā yojīyatīti."
    ],
    "innerText": "18.Sahetukakāmāvacarakusalavipākakiriyacittānīti ettha sahetukaggahaṇaṃ vipākakiriyāpekkhaṃ visesanaṃ kusalassa ekantasahetukattā. Hoti hi yathālābhayojanā, ‘‘sakkharakathalampi macchagumbampi carantampi tiṭṭhantampī’’tyādīsu (dī. ni. 1.249) viya sakkharakathalassa caraṇāyogato macchagumbāpekkhāya caraṇakiriyā yojīyatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ". Sahetukāmāvacarapuññapākakiriyā vedanāñāṇasaṅkhārabhedena paccekaṃ vedanābhedato duvidhattā, ñāṇabhedato catubbidhattā, saṅkhārabhedato aṭṭhavidhattā ca sampiṇḍetvā catuvīsati matāti yojanā. Nanu ca vedanābhedo tāva yutto tāsaṃ bhinnasabhāvattā. Ñāṇasaṅkhārabhedo pana kathanti? Ñāṇasaṅkhārānaṃ bhāvābhāvakatopi bhedo ñāṇasaṅkhārakatova yathā vassakato subhikkho dubbhikkhoti, tasmā ñāṇasaṅkhārakato bhedo ñāṇasaṅkhārabhedoti na ettha koci virodhoti."
    ],
    "innerText": "19. Sahetukāmāvacarapuññapākakiriyā vedanāñāṇasaṅkhārabhedena paccekaṃ vedanābhedato duvidhattā, ñāṇabhedato catubbidhattā, saṅkhārabhedato aṭṭhavidhattā ca sampiṇḍetvā catuvīsati matāti yojanā. Nanu ca vedanābhedo tāva yutto tāsaṃ bhinnasabhāvattā. Ñāṇasaṅkhārabhedo pana kathanti? Ñāṇasaṅkhārānaṃ bhāvābhāvakatopi bhedo ñāṇasaṅkhārakatova yathā vassakato subhikkho dubbhikkhoti, tasmā ñāṇasaṅkhārakato bhedo ñāṇasaṅkhārabhedoti na ettha koci virodhoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". Idāni sabbānipi kāmāvacaracittāni sampiṇḍetvā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kāme tevīsā’’"
      },
      "tyādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāme"
      },
      " bhave satta akusalavipākāni, sahetukāhetukāni soḷasa kusalavipākānīti evaṃ tevīsati vipākāni dvādasa akusalāni, aṭṭha kusalānīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puññāpuññāni vīsati"
      },
      " ahetukā tisso sahetukā aṭṭhāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekādasa kiriyā cā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbathāpi"
      },
      " kusalākusalavipākakiriyānaṃ antogadhabhedena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catupaññāseva"
      },
      " kāladesasantānādibhedena anekavidhabhāvepītyattho."
    ],
    "innerText": "20. Idāni sabbānipi kāmāvacaracittāni sampiṇḍetvā dassetuṃ ‘‘kāme tevīsā’’tyādi vuttaṃ. Kāme bhave satta akusalavipākāni, sahetukāhetukāni soḷasa kusalavipākānīti evaṃ tevīsati vipākāni dvādasa akusalāni, aṭṭha kusalānīti puññāpuññāni vīsati ahetukā tisso sahetukā aṭṭhāti ekādasa kiriyā cāti sabbathāpi kusalākusalavipākakiriyānaṃ antogadhabhedena catupaññāseva kāladesasantānādibhedena anekavidhabhāvepītyattho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kāmāvacarasobhanacittavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Rūpāvacaracittavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". Idāni ",
      " tadanantaruddiṭṭhassa rūpāvacarassa niddesakkamo anuppattoti tassa jhānaṅgayogabhedena pañcadhā vibhāgaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vitakka…pe… sahita’’"
      },
      "ntyādimāha. Vitakko ca vicāro ca pīti ca sukhañca ekaggatā cāti imehi sahitaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vitakkavicārapītisukhekaggatāsahitaṃ"
      },
      ". Tattha ārammaṇaṃ vitakketi sampayuttadhamme abhiniropetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vitakko,"
      },
      " so sahajātānaṃ ārammaṇābhiniropanalakkhaṇo, yathā hi koci gāmavāsī puriso rājavallabhaṃ sambandhinaṃ mittaṃ vā nissāya rājagehaṃ anupavisati, evaṃ vitakkaṃ nissāya cittaṃ ārammaṇaṃ ārohati. Yadi evaṃ kathaṃ avitakkaṃ cittaṃ ārammaṇaṃ ārohatīti? Tampi vitakkabaleneva ",
      " abhinirohati. Yathā hi so puriso paricayena tena vināpi nirāsaṅko rājagehaṃ pavisati, evaṃ paricayena vitakkena vināpi avitakkaṃ cittaṃ ārammaṇaṃ abhinirohati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paricayo"
      },
      "ti cettha savitakkacittassa santāne abhiṇhappavattivasena nibbattā cittabhāvanā. Api cettha pañcaviññāṇaṃ avitakkampi vatthārammaṇasaṅghaṭṭanabalena, dutiyajjhānādīni ca heṭṭhimabhāvanābalena abhirohanti."
    ],
    "innerText": "21. Idāni tadanantaruddiṭṭhassa rūpāvacarassa niddesakkamo anuppattoti tassa jhānaṅgayogabhedena pañcadhā vibhāgaṃ dassetuṃ ‘‘vitakka…pe… sahita’’ntyādimāha. Vitakko ca vicāro ca pīti ca sukhañca ekaggatā cāti imehi sahitaṃ vitakkavicārapītisukhekaggatāsahitaṃ. Tattha ārammaṇaṃ vitakketi sampayuttadhamme abhiniropetīti vitakko, so sahajātānaṃ ārammaṇābhiniropanalakkhaṇo, yathā hi koci gāmavāsī puriso rājavallabhaṃ sambandhinaṃ mittaṃ vā nissāya rājagehaṃ anupavisati, evaṃ vitakkaṃ nissāya cittaṃ ārammaṇaṃ ārohati. Yadi evaṃ kathaṃ avitakkaṃ cittaṃ ārammaṇaṃ ārohatīti? Tampi vitakkabaleneva abhinirohati. Yathā hi so puriso paricayena tena vināpi nirāsaṅko rājagehaṃ pavisati, evaṃ paricayena vitakkena vināpi avitakkaṃ cittaṃ ārammaṇaṃ abhinirohati. Paricayoti cettha savitakkacittassa santāne abhiṇhappavattivasena nibbattā cittabhāvanā. Api cettha pañcaviññāṇaṃ avitakkampi vatthārammaṇasaṅghaṭṭanabalena, dutiyajjhānādīni ca heṭṭhimabhāvanābalena abhirohanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ārammaṇe tena cittaṃ vicaratīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vicāro"
      },
      ". So āraṇanumajjanalakkhaṇo. Tathā hesa ‘‘anusandhānatā’’ti (dha. sa. 8) niddiṭṭho. Ettha ca vicārato oḷārikaṭṭhena, tasseva pubbaṅgamaṭṭhena ca paṭhamaghaṇṭābhighāto viya cetaso paṭhamābhinipāto vitakko, anuravo viya anusañcaraṇaṃ vicāro. Vipphāravācettha vitakko cittassa paripphandanabhūto, ākāse uppatitukāmassa sakuṇassa pakkhavikkhepo viya, padumābhimukhapāto viya ca gandhānubandhacetasā bhamarassa, santavutti vicāro cittassa nātiparipphandanabhūto, ākāse uppatitassa ",
      " sakuṇassa pakkhappasāraṇaṃ viya, padumassa uparibhāge paribbhamanaṃ viya ca padumābhimukhapatitassa bhamarassa."
    ],
    "innerText": "Ārammaṇe tena cittaṃ vicaratīti vicāro. So āraṇanumajjanalakkhaṇo. Tathā hesa ‘‘anusandhānatā’’ti (dha. sa. 8) niddiṭṭho. Ettha ca vicārato oḷārikaṭṭhena, tasseva pubbaṅgamaṭṭhena ca paṭhamaghaṇṭābhighāto viya cetaso paṭhamābhinipāto vitakko, anuravo viya anusañcaraṇaṃ vicāro. Vipphāravācettha vitakko cittassa paripphandanabhūto, ākāse uppatitukāmassa sakuṇassa pakkhavikkhepo viya, padumābhimukhapāto viya ca gandhānubandhacetasā bhamarassa, santavutti vicāro cittassa nātiparipphandanabhūto, ākāse uppatitassa sakuṇassa pakkhappasāraṇaṃ viya, padumassa uparibhāge paribbhamanaṃ viya ca padumābhimukhapatitassa bhamarassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pinayati kāyacittaṃ tappeti, vaḍḍhetīti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pīti,"
      },
      " sā sampiyāyanalakkhaṇā, ārammaṇaṃ kallato gahaṇalakkhaṇāti vuttaṃ hoti, sampayuttadhamme sukhayatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhaṃ,"
      },
      " taṃ iṭṭhānubhavanalakkhaṇaṃ subhojanarasassādako rājā viya. Tattha ārammaṇappaṭilābhe pītiyā viseso pākaṭo kantārakhinnassa vanantodakadassane viya, yathāladdhassa anubhavane sukhassa viseso pākaṭo yathādiṭṭhaudakassa pānādīsu viyāti. Nānārammaṇavikkhepābhāvena ekaṃ ārammaṇaṃ aggaṃ imassāti ekaggaṃ, cittaṃ, tassa bhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekaggatā,"
      },
      " samādhi. So avikkhepalakkhaṇo. Tassa hi vasena sasampayuttaṃ cittaṃ avikkhittaṃ hoti."
    ],
    "innerText": "Pinayati kāyacittaṃ tappeti, vaḍḍhetīti vā pīti, sā sampiyāyanalakkhaṇā, ārammaṇaṃ kallato gahaṇalakkhaṇāti vuttaṃ hoti, sampayuttadhamme sukhayatīti sukhaṃ, taṃ iṭṭhānubhavanalakkhaṇaṃ subhojanarasassādako rājā viya. Tattha ārammaṇappaṭilābhe pītiyā viseso pākaṭo kantārakhinnassa vanantodakadassane viya, yathāladdhassa anubhavane sukhassa viseso pākaṭo yathādiṭṭhaudakassa pānādīsu viyāti. Nānārammaṇavikkhepābhāvena ekaṃ ārammaṇaṃ aggaṃ imassāti ekaggaṃ, cittaṃ, tassa bhāvo ekaggatā, samādhi. So avikkhepalakkhaṇo. Tassa hi vasena sasampayuttaṃ cittaṃ avikkhittaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭhamañca desanākkamato ceva uppattikkamato ca ādibhūtattā taṃ jhānañca ārammaṇūpanijjhānato, paccanīkajhāpanato cāti paṭhamajjhānaṃ, vitakkādipañcakaṃ. Jhānaṅgasamudāye yeva hi jhānavohāro nemiādiaṅgasamudāye rathavohāro viya, tathā hi vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhaṅge"
      },
      " ‘‘jhānanti vitakko vicāro pīti sukhaṃ cittassekaggatā’’ti (vibha. 569). Paṭhamajjhānena sampayuttaṃ kusalacittaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭhamajjhānakusalacittaṃ"
      },
      "."
    ],
    "innerText": "Paṭhamañca desanākkamato ceva uppattikkamato ca ādibhūtattā taṃ jhānañca ārammaṇūpanijjhānato, paccanīkajhāpanato cāti paṭhamajjhānaṃ, vitakkādipañcakaṃ. Jhānaṅgasamudāye yeva hi jhānavohāro nemiādiaṅgasamudāye rathavohāro viya, tathā hi vuttaṃ vibhaṅge ‘‘jhānanti vitakko vicāro pīti sukhaṃ cittassekaggatā’’ti (vibha. 569). Paṭhamajjhānena sampayuttaṃ kusalacittaṃ paṭhamajjhānakusalacittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kasmā ",
      " pana aññesu phassādīsu sampayuttadhammesu vijjamānesu imeyeva pañca jhānaṅgavasena vuttāti? Vuccate – upanijjhānakiccavantatāya, kāmacchandādīnaṃ ujupaṭipakkhabhāvato ca. Vitakko hi ārammaṇe cittaṃ abhiniropeti. Vicāro anuppabandheti, pīti cassa pīnanaṃ, sukhañca upabrūhanaṃ karoti, atha naṃ sasampayuttadhammaṃ etehi abhiniropanānuppabandhanapīnanaupabrūhanehi anuggahitā ekaggatā samādhānakiccena ",
      " attānaṃ anuvattāpentī ekattārammaṇe samaṃ, sammā ca ādhiyati. Indriyasamatāvasena samaṃ paṭipakkhadhammānaṃ dūrībhāvena līnuddhaccābhāvena sammā ca ṭhapetīti evamete sameva upanijjhānakiccaṃ āveṇikaṃ. Kāmacchandādipaṭipakkhabhāve pana samādhi kāmacchandassa paṭipakkho rāgappaṇidhiyā ujupaccanīkabhāvato. Kāmacchandavasena hi nānārammaṇehi palobhitassa paribbhamantassa cittassa samādhānaṃ ekaggatāya hoti. Pīti byāpādassa pāmojjasabhāvattā. Vitakko thinamiddhassa yoniso saṅkappanavasena savipphārappavattito sukhaṃ avūpasamānutāpasabhāvassa uddhaccakukkuccassa vūpasantasītalasabhāvattā. Vicāro vicikicchāya ārammaṇe anumajjanavasena paññāpatirūpasabhāvattā. Evaṃ upanijjhānakiccavantatāya, kāmacchandādīnaṃ ujupaṭipakkhabhāvato ca imeyeva pañca jhānaṅgabhāvena vavatthitāti. Yathāhu –"
    ],
    "innerText": "Kasmā pana aññesu phassādīsu sampayuttadhammesu vijjamānesu imeyeva pañca jhānaṅgavasena vuttāti? Vuccate – upanijjhānakiccavantatāya, kāmacchandādīnaṃ ujupaṭipakkhabhāvato ca. Vitakko hi ārammaṇe cittaṃ abhiniropeti. Vicāro anuppabandheti, pīti cassa pīnanaṃ, sukhañca upabrūhanaṃ karoti, atha naṃ sasampayuttadhammaṃ etehi abhiniropanānuppabandhanapīnanaupabrūhanehi anuggahitā ekaggatā samādhānakiccena attānaṃ anuvattāpentī ekattārammaṇe samaṃ, sammā ca ādhiyati. Indriyasamatāvasena samaṃ paṭipakkhadhammānaṃ dūrībhāvena līnuddhaccābhāvena sammā ca ṭhapetīti evamete sameva upanijjhānakiccaṃ āveṇikaṃ. Kāmacchandādipaṭipakkhabhāve pana samādhi kāmacchandassa paṭipakkho rāgappaṇidhiyā ujupaccanīkabhāvato. Kāmacchandavasena hi nānārammaṇehi palobhitassa paribbhamantassa cittassa samādhānaṃ ekaggatāya hoti. Pīti byāpādassa pāmojjasabhāvattā. Vitakko thinamiddhassa yoniso saṅkappanavasena savipphārappavattito sukhaṃ avūpasamānutāpasabhāvassa uddhaccakukkuccassa vūpasantasītalasabhāvattā. Vicāro vicikicchāya ārammaṇe anumajjanavasena paññāpatirūpasabhāvattā. Evaṃ upanijjhānakiccavantatāya, kāmacchandādīnaṃ ujupaṭipakkhabhāvato ca imeyeva pañca jhānaṅgabhāvena vavatthitāti. Yathāhu –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Upanijjhānakiccattā, kāmādipaṭipakkhato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Santesupi ca aññesu, pañceva jhānasaññitā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Upekkhā panetta santavuttisabhāvattā sukheva antogadhāti daṭṭhabbaṃ. Tenāhu –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "‘‘Upekkhā santavuttittā, sukhamicceva bhāsitā’’ti. (vibha. aṭṭha. 232; visuddhi. 2.644);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pahānaṅgādivasena panassa viseso upari āvi bhavissati, tathā arūpāvacaralokuttaresupi labbhamānakaviseso. Athettha kāmāvacarakusalesu viya saṅkhārabhedo kasmā na gahito. Idampi hi kevalaṃ samathānuyogavasena paṭiladdhaṃ sasaṅkhārikaṃ, maggādhigamavasena paṭiladdhaṃ asaṅkhārikanti sakkā vattunti? Nayidamevaṃ maggādhigamavasenasattito ",
      " paṭiladdhassāpi aparabhāge parikammavaseneva uppajjanato, tasmā sabbassapi jhānassa parikammasaṅkhātapubbābhisaṅkhārena ",
      " vinā kevalaṃ adhikāravasena anuppajjanato ‘‘asaṅkhārika’’ntipi, adhikārena ca vinā kevalaṃ parikammābhisaṅkhāreneva anuppajjanato ‘‘sasaṅkhārika’’ntipi na sakkā vattunti. Atha vā pubbābhisaṅkhāravaseneva uppajjamānassa na kadāci asaṅkhārikabhāvo sambhavatīti ‘‘asaṅkhārika’’nti ca byabhicārābhāvato ‘‘sasaṅkhārika’’nti ca na vuttanti."
    ],
    "innerText": "Pahānaṅgādivasena panassa viseso upari āvi bhavissati, tathā arūpāvacaralokuttaresupi labbhamānakaviseso. Athettha kāmāvacarakusalesu viya saṅkhārabhedo kasmā na gahito. Idampi hi kevalaṃ samathānuyogavasena paṭiladdhaṃ sasaṅkhārikaṃ, maggādhigamavasena paṭiladdhaṃ asaṅkhārikanti sakkā vattunti? Nayidamevaṃ maggādhigamavasenasattito paṭiladdhassāpi aparabhāge parikammavaseneva uppajjanato, tasmā sabbassapi jhānassa parikammasaṅkhātapubbābhisaṅkhārena vinā kevalaṃ adhikāravasena anuppajjanato ‘‘asaṅkhārika’’ntipi, adhikārena ca vinā kevalaṃ parikammābhisaṅkhāreneva anuppajjanato ‘‘sasaṅkhārika’’ntipi na sakkā vattunti. Atha vā pubbābhisaṅkhāravaseneva uppajjamānassa na kadāci asaṅkhārikabhāvo sambhavatīti ‘‘asaṅkhārika’’nti ca byabhicārābhāvato ‘‘sasaṅkhārika’’nti ca na vuttanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pi-saddena cettha catukkapañcakanayavasena suddhikanavako, tañca dukkhappaṭipadādandhābhiññādukkhappaṭipadākhippābhiññāsukhappaṭipadādandhābhiññāsukhappaṭipadākhippābhiññāvasena paṭipadācatukkena yojetvā desitattā cattāro navakā, parittaṃ parittārammaṇaṃ, parittaṃ appamāṇārammaṇaṃ, appamāṇaṃ parittārammaṇaṃ, appamāṇaṃ appamāṇārammaṇanti ārammaṇacatukkena yojitattā cattāro navakā, ‘‘dukkhappaṭipadaṃ dandhābhiññaṃ parittaṃ parittārammaṇaṃ, dukkhappaṭipadaṃ dandhābhiññaṃ parittaṃ appamāṇārammaṇa’’ntyādinā ārammaṇappaṭipadāmissakanayavasena soḷasa navakāti pañcavīsati navakāti evamādibhedaṃ saṅgaṇhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". Jhānavisesena nibbattitavipāko ekantato taṃtaṃjhānasadisovāti vipākaṃ jhānasadisameva vibhattaṃ. Imameva hi atthaṃ dīpetuṃ bhagavatā vipākaniddesepi kusalaṃ uddisitvāva tadanantaraṃ mahaggatalokuttaravipākā vibhattā."
    ],
    "innerText": "22. Jhānavisesena nibbattitavipāko ekantato taṃtaṃjhānasadisovāti vipākaṃ jhānasadisameva vibhattaṃ. Imameva hi atthaṃ dīpetuṃ bhagavatā vipākaniddesepi kusalaṃ uddisitvāva tadanantaraṃ mahaggatalokuttaravipākā vibhattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". Rūpāvacaramānasaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānabhedena"
      },
      " pañcahi catūhi tīhi dvīhi puna dvīhi jhānaṅgehi sampayogabhedena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcadhā"
      },
      " pañcaṅgikaṃ caturaṅgikaṃ tivaṅgikaṃ duvaṅgikaṃ puna duvaṅgikanti pañcavidhaṃ hoti avisesena, puna taṃ puññapākakiriyānaṃ paccekaṃ pañcannaṃ pañcannaṃ bhedā pañcadasadhā bhavetyattho."
    ],
    "innerText": "25. Rūpāvacaramānasaṃ jhānabhedena pañcahi catūhi tīhi dvīhi puna dvīhi jhānaṅgehi sampayogabhedena pañcadhā pañcaṅgikaṃ caturaṅgikaṃ tivaṅgikaṃ duvaṅgikaṃ puna duvaṅgikanti pañcavidhaṃ hoti avisesena, puna taṃ puññapākakiriyānaṃ paccekaṃ pañcannaṃ pañcannaṃ bhedā pañcadasadhā bhavetyattho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Rūpāvacaracittavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Arūpāvacaracittavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". Idāni ",
      " arūpāvacaraṃ ārammaṇabhedena catudhā vibhajitvā dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ākāsānañcāyatanā’’"
      },
      "tiādi. Tattha uppādādiantarahitatāya nāssa antoti anantaṃ, ākāsañca taṃ anantañcāti ākāsānantaṃ, kasiṇugghāṭimākāso. ‘‘Anantākāsa’’nti ca vattabbe ‘‘agyāhito’’tyādīsu viya visesanassa paranipātavasena ‘‘ākāsānanta’’nti vuttaṃ. Ākāsānantameva ākāsānañcaṃ sakatthe bhāvapaccayavasena. Ākāsānañcameva āyatanaṃ sasampayuttadhammassa jhānassa adhiṭṭhānaṭṭhena devānaṃ devāyatanaṃ viyāti ākāsānañcāyatanaṃ. Tasmiṃ appanāppattaṃ paṭhamāruppajjhānampi idha ‘‘ākāsānañcāyatana’’nti vuttaṃ yathā pathavīkasiṇārammaṇaṃ jhānaṃ ‘‘pathavīkasiṇa’’nti. Atha vā ākāsānañcaṃ āyatanaṃ assāti ākāsānañcāyatanaṃ, jhānaṃ, tena sampayuttaṃ kusalacittaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ākāsānañcāyatanakusalacittaṃ"
      },
      "."
    ],
    "innerText": "26. Idāni arūpāvacaraṃ ārammaṇabhedena catudhā vibhajitvā dassento āha ‘‘ākāsānañcāyatanā’’tiādi. Tattha uppādādiantarahitatāya nāssa antoti anantaṃ, ākāsañca taṃ anantañcāti ākāsānantaṃ, kasiṇugghāṭimākāso. ‘‘Anantākāsa’’nti ca vattabbe ‘‘agyāhito’’tyādīsu viya visesanassa paranipātavasena ‘‘ākāsānanta’’nti vuttaṃ. Ākāsānantameva ākāsānañcaṃ sakatthe bhāvapaccayavasena. Ākāsānañcameva āyatanaṃ sasampayuttadhammassa jhānassa adhiṭṭhānaṭṭhena devānaṃ devāyatanaṃ viyāti ākāsānañcāyatanaṃ. Tasmiṃ appanāppattaṃ paṭhamāruppajjhānampi idha ‘‘ākāsānañcāyatana’’nti vuttaṃ yathā pathavīkasiṇārammaṇaṃ jhānaṃ ‘‘pathavīkasiṇa’’nti. Atha vā ākāsānañcaṃ āyatanaṃ assāti ākāsānañcāyatanaṃ, jhānaṃ, tena sampayuttaṃ kusalacittaṃ ākāsānañcāyatanakusalacittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Viññāṇameva anantaṃ viññāṇānantaṃ, paṭhamāruppaviññāṇaṃ. Tañhi uppādādiantavantampi anantākāse pavattanato attānaṃ ārabbha pavattāya bhāvanāya uppādādiantaṃ aggahetvā anantato pharaṇavasena pavattanato ca ‘‘ananta’’nti vuccati. Viññāṇānantameva viññāṇañcaṃ ākārassa rassattaṃ, na-kārassa lopañca katvā. Dutiyāruppaviññāṇena vā añcitabbaṃ pāpuṇitabbanti viññāṇañcaṃ, tadeva āyatanaṃ dutiyāruppassa adhiṭṭhānattāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viññāṇañcāyatanaṃ"
      },
      ". Sesaṃ purimasamaṃ."
    ],
    "innerText": "Viññāṇameva anantaṃ viññāṇānantaṃ, paṭhamāruppaviññāṇaṃ. Tañhi uppādādiantavantampi anantākāse pavattanato attānaṃ ārabbha pavattāya bhāvanāya uppādādiantaṃ aggahetvā anantato pharaṇavasena pavattanato ca ‘‘ananta’’nti vuccati. Viññāṇānantameva viññāṇañcaṃ ākārassa rassattaṃ, na-kārassa lopañca katvā. Dutiyāruppaviññāṇena vā añcitabbaṃ pāpuṇitabbanti viññāṇañcaṃ, tadeva āyatanaṃ dutiyāruppassa adhiṭṭhānattāti viññāṇañcāyatanaṃ. Sesaṃ purimasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nāssa ",
      " paṭhamāruppassa kiñcanaṃ appamattakaṃ antamaso bhaṅgamattampi avasiṭṭhaṃ atthīti akiñcanaṃ, tassa bhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ākiñcaññaṃ,"
      },
      " paṭhamāruppaviññāṇābhāvo. Tadeva āyatanantyādi purimasadisaṃ."
    ],
    "innerText": "Nāssa paṭhamāruppassa kiñcanaṃ appamattakaṃ antamaso bhaṅgamattampi avasiṭṭhaṃ atthīti akiñcanaṃ, tassa bhāvo ākiñcaññaṃ, paṭhamāruppaviññāṇābhāvo. Tadeva āyatanantyādi purimasadisaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Oḷārikāya saññāya abhāvato, sukhumāya ca saññāya atthitāya nevassa sasampayuttadhammassa saññā atthi, nāpi asaññaṃ avijjamānasaññanti nevasaññānāsaññaṃ, catutthāruppajjhānaṃ. Dīghaṃ katvā pana ‘‘nevasaññānāsañña’’nti vuttaṃ. Nevasaññānāsaññameva āyatanaṃ manāyatanadhammāyatanapariyāpannattāti nevasaññānāsaññāyatanaṃ. Atha vā saññāva vipassanāya gocarabhāvaṃ gantvā nibbedajananasaṅkhātassa paṭusaññākiccassa abhāvato nevasaññā ca ",
      " uṇhodake tejodhātu viya saṅkhārāvasesasukhumabhāvena vijjamānattā na asaññāti nevasaññānāsaññā, sā eva āyatanaṃ imassa sasampayuttadhammassa jhānassa nissayādibhāvatoti nevasaññānāsaññāyatanaṃ. Saññāvasena cettha jhānūpalakkhaṇaṃ nidassanamattaṃ. Vedanādayopi hi tasmiṃ jhāne nevavedanānāvedanādikāyevāti. Nevasaññānāsaññāyatanena sampayuttaṃ kusalacittaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nevasaññānāsaññāyatanakusalacittaṃ"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pi"
      },
      "-saddena cettha ārammaṇappaṭipadāmissakanayavasena soḷasakkhattukadesanaṃ (dha. sa. 265-268), aññampi ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāḷiyaṃ"
      },
      " āgatanayabhedaṃ saṅgaṇhāti."
    ],
    "innerText": "Oḷārikāya saññāya abhāvato, sukhumāya ca saññāya atthitāya nevassa sasampayuttadhammassa saññā atthi, nāpi asaññaṃ avijjamānasaññanti nevasaññānāsaññaṃ, catutthāruppajjhānaṃ. Dīghaṃ katvā pana ‘‘nevasaññānāsañña’’nti vuttaṃ. Nevasaññānāsaññameva āyatanaṃ manāyatanadhammāyatanapariyāpannattāti nevasaññānāsaññāyatanaṃ. Atha vā saññāva vipassanāya gocarabhāvaṃ gantvā nibbedajananasaṅkhātassa paṭusaññākiccassa abhāvato nevasaññā ca uṇhodake tejodhātu viya saṅkhārāvasesasukhumabhāvena vijjamānattā na asaññāti nevasaññānāsaññā, sā eva āyatanaṃ imassa sasampayuttadhammassa jhānassa nissayādibhāvatoti nevasaññānāsaññāyatanaṃ. Saññāvasena cettha jhānūpalakkhaṇaṃ nidassanamattaṃ. Vedanādayopi hi tasmiṃ jhāne nevavedanānāvedanādikāyevāti. Nevasaññānāsaññāyatanena sampayuttaṃ kusalacittaṃ nevasaññānāsaññāyatanakusalacittaṃ. Pi-saddena cettha ārammaṇappaṭipadāmissakanayavasena soḷasakkhattukadesanaṃ (dha. sa. 265-268), aññampi ca pāḷiyaṃ āgatanayabhedaṃ saṅgaṇhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ". Ārammaṇānaṃ atikkamitabbānaṃ, kasiṇākāsaviññāṇatadabhāvasaṅkhātānaṃ ālambitabbānañca ākāsādicatunnaṃ gocarānaṃ pabhedena āruppamānasaṃ catubbidhaṃ hoti. Tañhi yathākkamaṃ pañcamajjhānārammaṇaṃ kasiṇanimittaṃ atikkamma tadugghāṭena laddhaṃ ākāsamālambitvā tampi atikkamma tattha pavattaṃ viññāṇamālambitvā tampi atikkamma tadabhāvabhūtaṃ akiñcanabhāvamālambitvā tampi atikkamma tattha pavattaṃ tatiyāruppaviññāṇamālambitvā ",
      " pavattati, na pana rūpāvacarakusalaṃ viya purimapurimaaṅgātikkamavasena purimapurimassāpi ārammaṇaṃ gahetvā. Tenāhu ācariyā –"
    ],
    "innerText": "30. Ārammaṇānaṃ atikkamitabbānaṃ, kasiṇākāsaviññāṇatadabhāvasaṅkhātānaṃ ālambitabbānañca ākāsādicatunnaṃ gocarānaṃ pabhedena āruppamānasaṃ catubbidhaṃ hoti. Tañhi yathākkamaṃ pañcamajjhānārammaṇaṃ kasiṇanimittaṃ atikkamma tadugghāṭena laddhaṃ ākāsamālambitvā tampi atikkamma tattha pavattaṃ viññāṇamālambitvā tampi atikkamma tadabhāvabhūtaṃ akiñcanabhāvamālambitvā tampi atikkamma tattha pavattaṃ tatiyāruppaviññāṇamālambitvā pavattati, na pana rūpāvacarakusalaṃ viya purimapurimaaṅgātikkamavasena purimapurimassāpi ārammaṇaṃ gahetvā. Tenāhu ācariyā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ārammaṇātikkamato, catassopi bhavantimā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aṅgātikkamametāsaṃ, na icchanti vibhāvino’’ti; (Dha. sa. aṭṭha. 268);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Arūpāvacaracittavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sobhanacittavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Lokuttaracittavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ". Idāni lokuttarakusalaṃ catumaggayogato, phalañca tadanurūpappavattiyā catudhā vibhajitvā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sotāpattimaggacitta’’"
      },
      "ntyādi vuttaṃ. Nibbānaṃ patisavanato upagamanato, nibbānamahāsamuddaninnatāya ",
      " sotasadisattā vā ‘‘soto’’ti vuccati ariyo aṭṭhaṅgiko maggo, tassa āpatti ādito pajjanaṃ pāpuṇanaṃ paṭhamasamannāgamo sotāpatti ā-upasaggassa ādikammani pavattanato. Nibbānaṃ maggeti, nibbānatthikehi vā maggīyati, kilese mārento gacchatīti vā maggo, tena sampayuttaṃ cittaṃ maggacittaṃ, sotāpattiyā laddhaṃ maggacittaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sotāpattimaggacittaṃ"
      },
      ". Atha vā ariyamaggasotassa ādito pajjanaṃ etassāti sotāpatti, puggalo, tassa maggo sotāpattimaggo, tena sampayuttaṃ cittaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sotāpattimaggacittaṃ"
      },
      "."
    ],
    "innerText": "31. Idāni lokuttarakusalaṃ catumaggayogato, phalañca tadanurūpappavattiyā catudhā vibhajitvā dassetuṃ ‘‘sotāpattimaggacitta’’ntyādi vuttaṃ. Nibbānaṃ patisavanato upagamanato, nibbānamahāsamuddaninnatāya sotasadisattā vā ‘‘soto’’ti vuccati ariyo aṭṭhaṅgiko maggo, tassa āpatti ādito pajjanaṃ pāpuṇanaṃ paṭhamasamannāgamo sotāpatti ā-upasaggassa ādikammani pavattanato. Nibbānaṃ maggeti, nibbānatthikehi vā maggīyati, kilese mārento gacchatīti vā maggo, tena sampayuttaṃ cittaṃ maggacittaṃ, sotāpattiyā laddhaṃ maggacittaṃ sotāpattimaggacittaṃ. Atha vā ariyamaggasotassa ādito pajjanaṃ etassāti sotāpatti, puggalo, tassa maggo sotāpattimaggo, tena sampayuttaṃ cittaṃ sotāpattimaggacittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sakiṃ ekavāraṃ paṭisandhivasena imaṃ manussalokaṃ āgacchatīti sakadāgāmī, idha patvā idha parinibbāyī, tattha patvā tattha parinibbāyī, idha patvā tattha parinibbāyī, tattha patvā idha parinibbāyī, idha patvā tattha nibbattitvā idha parinibbāyīti pañcasu sakadāgāmīsu pañcamako idhādhippeto. So hi ito ",
      " gantvā puna sakiṃ idha āgacchatīti. Tassa maggo sakadāgāmimaggo. Kiñcāpi maggasamaṅgino tathāgamanāsambhavato phalaṭṭhoyeva sakadāgāmī nāma, tassa pana kāraṇabhūto purimuppanno maggo maggantarāvacchedanatthaṃ phalaṭṭhena visesetvā vuccati ‘‘sakadāgāmimaggo’’ti. Evaṃ anāgāmimaggoti. Sakadāgāmimaggena sampayuttaṃ cittaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sakadāgāmimaggacittaṃ"
      },
      "."
    ],
    "innerText": "Sakiṃ ekavāraṃ paṭisandhivasena imaṃ manussalokaṃ āgacchatīti sakadāgāmī, idha patvā idha parinibbāyī, tattha patvā tattha parinibbāyī, idha patvā tattha parinibbāyī, tattha patvā idha parinibbāyī, idha patvā tattha nibbattitvā idha parinibbāyīti pañcasu sakadāgāmīsu pañcamako idhādhippeto. So hi ito gantvā puna sakiṃ idha āgacchatīti. Tassa maggo sakadāgāmimaggo. Kiñcāpi maggasamaṅgino tathāgamanāsambhavato phalaṭṭhoyeva sakadāgāmī nāma, tassa pana kāraṇabhūto purimuppanno maggo maggantarāvacchedanatthaṃ phalaṭṭhena visesetvā vuccati ‘‘sakadāgāmimaggo’’ti. Evaṃ anāgāmimaggoti. Sakadāgāmimaggena sampayuttaṃ cittaṃ sakadāgāmimaggacittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭisandhivasena imaṃ kāmadhātuṃ na āgacchatīti anāgāmī, tassa maggo anāgāmimaggo, tena sampayuttaṃ cittaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāgāmimaggacittaṃ"
      },
      ". Aggadakkhiṇeyyabhāvena pūjāvisesaṃ arahatīti arahā, atha vā kilesasaṅkhātā arayo, saṃsāracakkassa vā arā kilesā hatā anenāti arahā, pāpakaraṇe rahābhāvato vā arahā, aṭṭhamako ariyapuggalo, tassa bhāvo arahattaṃ, catutthaphalassetaṃ adhivacanaṃ, tassa āgamanabhūto maggo arahattamaggo, tena sampayuttaṃ cittaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "arahattamaggacittaṃ"
      },
      "."
    ],
    "innerText": "Paṭisandhivasena imaṃ kāmadhātuṃ na āgacchatīti anāgāmī, tassa maggo anāgāmimaggo, tena sampayuttaṃ cittaṃ anāgāmimaggacittaṃ. Aggadakkhiṇeyyabhāvena pūjāvisesaṃ arahatīti arahā, atha vā kilesasaṅkhātā arayo, saṃsāracakkassa vā arā kilesā hatā anenāti arahā, pāpakaraṇe rahābhāvato vā arahā, aṭṭhamako ariyapuggalo, tassa bhāvo arahattaṃ, catutthaphalassetaṃ adhivacanaṃ, tassa āgamanabhūto maggo arahattamaggo, tena sampayuttaṃ cittaṃ arahattamaggacittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pi"
      },
      "-saddena ekekassa maggassa nayasahassavasena catunnaṃ catusahassabhedaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saccavibhaṅge"
      },
      " (vibha. 206; vibha. aṭṭha. 206-214) āgataṃ saṭṭhisahassabhedaṃ nayaṃ heṭṭhā vuttanayena anekavidhattampi saṅgaṇhāti. Tatthāyaṃ nayasahassamattaparidīpanā, kathaṃ? Sotāpattimaggo tāva jhānanāmena paṭipadābhedaṃ anāmasitvā kevalaṃ suññato appaṇihitoti dvidhā vibhatto, puna paṭipadācatukkena yojetvā paccekaṃ catudhā vibhattoti evaṃ jhānanāmena dasadhā vibhatto. Tathā maggasatipaṭṭhānasammappadhānaiddhipādaindriyabalabojjhaṅgasaccasamathadhammakhandhaāyatanadhātuāhāraphassavedanāsaññācetanācittanāmehipi ",
      " paccekaṃ dasadasākārehi vibhatto tathā tathā bujjhanakānaṃ puggalānaṃ vasena. Tasmā ",
      " jhānavasena dasamaggādīnaṃ ekūnavīsatiyā vasena dasa dasāti vīsatiyā ṭhānesu dve nayasatāni honti. Puna tāni catūhi adhipatīhi yojetvā paccekaṃ catudhā vibhattānīti evaṃ adhipatīhi amissetvā dve satāni, missetvā aṭṭha satānīti sotāpattimagge nayasahassaṃ hoti, tathā sakadāgāmimaggādīsupi."
    ],
    "innerText": "Pi-saddena ekekassa maggassa nayasahassavasena catunnaṃ catusahassabhedaṃ saccavibhaṅge (vibha. 206; vibha. aṭṭha. 206-214) āgataṃ saṭṭhisahassabhedaṃ nayaṃ heṭṭhā vuttanayena anekavidhattampi saṅgaṇhāti. Tatthāyaṃ nayasahassamattaparidīpanā, kathaṃ? Sotāpattimaggo tāva jhānanāmena paṭipadābhedaṃ anāmasitvā kevalaṃ suññato appaṇihitoti dvidhā vibhatto, puna paṭipadācatukkena yojetvā paccekaṃ catudhā vibhattoti evaṃ jhānanāmena dasadhā vibhatto. Tathā maggasatipaṭṭhānasammappadhānaiddhipādaindriyabalabojjhaṅgasaccasamathadhammakhandhaāyatanadhātuāhāraphassavedanāsaññācetanācittanāmehipi paccekaṃ dasadasākārehi vibhatto tathā tathā bujjhanakānaṃ puggalānaṃ vasena. Tasmā jhānavasena dasamaggādīnaṃ ekūnavīsatiyā vasena dasa dasāti vīsatiyā ṭhānesu dve nayasatāni honti. Puna tāni catūhi adhipatīhi yojetvā paccekaṃ catudhā vibhattānīti evaṃ adhipatīhi amissetvā dve satāni, missetvā aṭṭha satānīti sotāpattimagge nayasahassaṃ hoti, tathā sakadāgāmimaggādīsupi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "32"
      },
      ". Sotāpattiyā laddhaṃ, sotāpattissa vā phalacittaṃ vipākabhūtaṃ cittaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sotāpattiphalacittaṃ"
      },
      ". Arahattañca taṃ phalacittañcāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "arahattaphalacittaṃ"
      },
      "."
    ],
    "innerText": "32. Sotāpattiyā laddhaṃ, sotāpattissa vā phalacittaṃ vipākabhūtaṃ cittaṃ sotāpattiphalacittaṃ. Arahattañca taṃ phalacittañcāti arahattaphalacittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "34"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catumaggappabhedenā"
      },
      "ti indriyānaṃ apāṭavapāṭavataratamabhedena bhinnasāmatthiyatāya sakkāyadiṭṭhivicikicchāsīlabbataparāmāsānaṃ niravasesappahānaṃ kāmarāgabyāpādānaṃ tanubhāvāpādanaṃ tesameva niravasesappahānaṃ rūpārūparāgamānuddhaccāvijjānaṃ anavasesappahānanti evaṃ saṃyojanappahānavasena catubbidhānaṃ sotāpattimaggādīnaṃ aṭṭhaṅgikamaggānaṃ sampayogabhedena catumaggasaṅkhātaṃ lokuttarakusalaṃ catudhā hoti, vipākaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tasseva"
      },
      " kusalassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "phalattā"
      },
      " tadanurūpato tathā catudhāti evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anuttaraṃ"
      },
      " attano uttaritarābhāvena anuttarasaṅkhātaṃ lokuttaraṃ cittaṃ aṭṭhadhā matanti yojanā."
    ],
    "innerText": "34.Catumaggappabhedenāti indriyānaṃ apāṭavapāṭavataratamabhedena bhinnasāmatthiyatāya sakkāyadiṭṭhivicikicchāsīlabbataparāmāsānaṃ niravasesappahānaṃ kāmarāgabyāpādānaṃ tanubhāvāpādanaṃ tesameva niravasesappahānaṃ rūpārūparāgamānuddhaccāvijjānaṃ anavasesappahānanti evaṃ saṃyojanappahānavasena catubbidhānaṃ sotāpattimaggādīnaṃ aṭṭhaṅgikamaggānaṃ sampayogabhedena catumaggasaṅkhātaṃ lokuttarakusalaṃ catudhā hoti, vipākaṃ pana tasseva kusalassa phalattā tadanurūpato tathā catudhāti evaṃ anuttaraṃ attano uttaritarābhāvena anuttarasaṅkhātaṃ lokuttaraṃ cittaṃ aṭṭhadhā matanti yojanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kiriyānuttarassa pana asambhavato dvādasavidhatā na vuttā. Kasmā pana tassa asambhavoti? Maggassa ekacittakkhaṇikattā. Yadi hi maggacittaṃ punappunaṃ uppajjeyya, taduppattiyā kiriyabhāvo sakkā vattuṃ. Taṃ pana kilesasamucchedakavaseneva upalabhitabbato ekavārappavatteneva ca tena asanisampātena viya taruādīnaṃ samūlaviddhaṃsanassa taṃtaṃkilesānaṃ accantaṃ appavattiyā sādhitattā puna uppajjamānepi kātabbābhāvato diṭṭhadhammasukhavihāratthañca phalasamāpattiyā eva ",
      " nibbānārammaṇavasena pavattanato na kadāci sekkhānaṃ asekkhānaṃ vā uppajjati. Tasmā natthi sabbathāpi lokuttarakiriyacittanti."
    ],
    "innerText": "Kiriyānuttarassa pana asambhavato dvādasavidhatā na vuttā. Kasmā pana tassa asambhavoti? Maggassa ekacittakkhaṇikattā. Yadi hi maggacittaṃ punappunaṃ uppajjeyya, taduppattiyā kiriyabhāvo sakkā vattuṃ. Taṃ pana kilesasamucchedakavaseneva upalabhitabbato ekavārappavatteneva ca tena asanisampātena viya taruādīnaṃ samūlaviddhaṃsanassa taṃtaṃkilesānaṃ accantaṃ appavattiyā sādhitattā puna uppajjamānepi kātabbābhāvato diṭṭhadhammasukhavihāratthañca phalasamāpattiyā eva nibbānārammaṇavasena pavattanato na kadāci sekkhānaṃ asekkhānaṃ vā uppajjati. Tasmā natthi sabbathāpi lokuttarakiriyacittanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Lokuttaracittavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Cittagaṇanasaṅgahavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Dvādasākusalāneva’’"
      },
      "ntyādi ",
      " yathāvuttānaṃ catubhūmikacittānaṃ gaṇanasaṅgaho."
    ],
    "innerText": "35.‘‘Dvādasākusalāneva’’ntyādi yathāvuttānaṃ catubhūmikacittānaṃ gaṇanasaṅgaho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ". Evaṃ jātivasena saṅgahaṃ dassetvā puna bhūmivasena dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘catupaññāsadhā kāme’’"
      },
      "tyādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāme"
      },
      " bhave cittāni catupaññāsadhā īraye, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpe"
      },
      " bhave pannarasa īraye, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āruppe"
      },
      " bhave dvādasa īraye, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anuttare"
      },
      " pana navavidhe dhammasamudāye cittāni aṭṭhadhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "īraye,"
      },
      " katheyyātyattho. Ettha ca kāmataṇhādivisayabhāvena kāmabhavādipariyāpannāni cittāni sakasakabhūmito aññattha pavattamānānipi kāmabhavādīsu cittānīti vuttāni, yathā manussitthiyā kucchismiṃ nibbattopi tiracchānagato tiracchānayonipariyāpannattā tiracchānesveva saṅgayhati. Katthaci apariyāpannāni navavidhalokuttaradhammasamūhekadesabhūtāni ‘‘rukkhe sākhā’’tyādīsu viya anuttare cittānīti vuttāni. Atha vā ‘‘kāme, rūpe’’ti ca uttarapadalopaniddeso. Arūpe bhavāni āruppāni. Natthi etesaṃ uttaraṃ cittanti anuttarānīti upayogabahuvacanavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāme"
      },
      " kāmāvacarāni cittāni catupaññāsadhā īraye, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpe"
      },
      " rūpāvacarāni cittāni pannarasa īraye, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āruppe"
      },
      " āruppāni cittāni dvādasa īraye. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuttare"
      },
      " lokuttarāni cittāni aṭṭhadhā īrayeti evamettha sambandho daṭṭhabbo."
    ],
    "innerText": "36. Evaṃ jātivasena saṅgahaṃ dassetvā puna bhūmivasena dassetuṃ ‘‘catupaññāsadhā kāme’’tyādi vuttaṃ. Kāme bhave cittāni catupaññāsadhā īraye, rūpe bhave pannarasa īraye, āruppe bhave dvādasa īraye, anuttare pana navavidhe dhammasamudāye cittāni aṭṭhadhā īraye, katheyyātyattho. Ettha ca kāmataṇhādivisayabhāvena kāmabhavādipariyāpannāni cittāni sakasakabhūmito aññattha pavattamānānipi kāmabhavādīsu cittānīti vuttāni, yathā manussitthiyā kucchismiṃ nibbattopi tiracchānagato tiracchānayonipariyāpannattā tiracchānesveva saṅgayhati. Katthaci apariyāpannāni navavidhalokuttaradhammasamūhekadesabhūtāni ‘‘rukkhe sākhā’’tyādīsu viya anuttare cittānīti vuttāni. Atha vā ‘‘kāme, rūpe’’ti ca uttarapadalopaniddeso. Arūpe bhavāni āruppāni. Natthi etesaṃ uttaraṃ cittanti anuttarānīti upayogabahuvacanavasena kāme kāmāvacarāni cittāni catupaññāsadhā īraye, rūpe rūpāvacarāni cittāni pannarasa īraye, āruppe āruppāni cittāni dvādasa īraye. Anuttare lokuttarāni cittāni aṭṭhadhā īrayeti evamettha sambandho daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itthaṃ"
      },
      " yathāvuttena jātibhedabhinnacatubhūmikacittabhedavasena ekūnanavutippabhedaṃ katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mānasaṃ"
      },
      " cittaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vicakkhaṇā"
      },
      " visesena atthacakkhaṇasabhāvā paṇḍitā vibhajanti. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekavīsasataṃ"
      },
      " ekuttaravīsādhikaṃ sataṃ vibhajanti."
    ],
    "innerText": "37.Itthaṃ yathāvuttena jātibhedabhinnacatubhūmikacittabhedavasena ekūnanavutippabhedaṃ katvā mānasaṃ cittaṃ vicakkhaṇā visesena atthacakkhaṇasabhāvā paṇḍitā vibhajanti. Atha vā ekavīsasataṃ ekuttaravīsādhikaṃ sataṃ vibhajanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cittagaṇanasaṅgahavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Vitthāragaṇanavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "38"
      },
      ". Jhānaṅgavasena paṭhamajjhānasadisattā paṭhamajjhānañca taṃ sotāpattimaggacittañceti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭhamajjhānasotāpattimaggacittaṃ"
      },
      ". Pādakajjhānasammasitajjhānapuggalajjhāsayesupi, hi aññataravasena taṃtaṃjhānasadisattā ",
      " vitakkādiaṅgapātubhāvena cattāropi maggā paṭhamajjhānādivohāraṃ labhantā paccekaṃ pañcadhā vibhajanti. Tenāha ‘‘jhānaṅgayogabhedenā’’tyādi, tattha paṭhamajjhānādīsu yaṃ yaṃ jhānaṃ samāpajjitvā tato tato vuṭṭhāya saṅkhāre sammasantassa vuṭṭhānagāminivipassanā pavattā, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pādakajjhānaṃ"
      },
      " vuṭṭhānagāminivipassanāya padaṭṭhānabhāvato. Yaṃ yaṃ jhānaṃ sammasantassa sā pavattā, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammasitajjhānaṃ"
      },
      ". ‘‘Aho vata me paṭhamajjhānasadiso maggo pañcaṅgiko, dutiyajjhānādīsu vā aññatarasadiso caturaṅgādibhedo maggo bhaveyyā’’ti evaṃ yogāvacarassa uppannajjhāsayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalajjhāsayo"
      },
      " nāma."
    ],
    "innerText": "38. Jhānaṅgavasena paṭhamajjhānasadisattā paṭhamajjhānañca taṃ sotāpattimaggacittañceti paṭhamajjhānasotāpattimaggacittaṃ. Pādakajjhānasammasitajjhānapuggalajjhāsayesupi, hi aññataravasena taṃtaṃjhānasadisattā vitakkādiaṅgapātubhāvena cattāropi maggā paṭhamajjhānādivohāraṃ labhantā paccekaṃ pañcadhā vibhajanti. Tenāha ‘‘jhānaṅgayogabhedenā’’tyādi, tattha paṭhamajjhānādīsu yaṃ yaṃ jhānaṃ samāpajjitvā tato tato vuṭṭhāya saṅkhāre sammasantassa vuṭṭhānagāminivipassanā pavattā, taṃ pādakajjhānaṃ vuṭṭhānagāminivipassanāya padaṭṭhānabhāvato. Yaṃ yaṃ jhānaṃ sammasantassa sā pavattā, taṃ sammasitajjhānaṃ. ‘‘Aho vata me paṭhamajjhānasadiso maggo pañcaṅgiko, dutiyajjhānādīsu vā aññatarasadiso caturaṅgādibhedo maggo bhaveyyā’’ti evaṃ yogāvacarassa uppannajjhāsayo puggalajjhāsayo nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yena paṭhamajjhānādīsu aññataraṃ jhānaṃ samāpajjitvā tato vuṭṭhāya pakiṇṇakasaṅkhāre sammasitvā maggo uppādito hoti, tassa so maggo paṭhamajjhānādīsu taṃtaṃpādakajjhānasadiso hoti. Sace pana vipassanāpādakaṃ kiñci jhānaṃ natthi, kevalaṃ paṭhamajjhānādīsu aññataraṃ jhānaṃ sammasitvā ",
      " maggo uppādito hoti, tassa so sammasitajjhānasadiso hoti. Yadā pana yaṃ kiñci jhānaṃ samāpajjitvā tato vuṭṭhāya aññataraṃ sammasitvā maggo uppādito hoti, tadā puggalajjhāsayavasena dvīsu aññatarasadiso hoti. Sace pana puggalassa tathāvidho ajjhāsayo natthi, heṭṭhimaheṭṭhimajjhānato vuṭṭhāya uparūparijhānadhamme sammasitvā uppāditamaggo pādakajjhānaṃ anapekkhitvā sammasitajjhānasadiso hoti. Uparūparijhānato pana vuṭṭhāya heṭṭhimaheṭṭhimajjhānadhamme sammasitvā uppāditamaggo sammasitajjhānaṃ anapekkhitvā pādakajjhānasadiso hoti. Heṭṭhimaheṭṭhimajjhānato hi uparūparijhānaṃ balavataranti. Vedanāniyamo pana sabbatthāpi vuṭṭhānagāminivipassanāniyamena hoti. Tathā sukkhavipassakassa sakalajjhānaṅganiyamo. Tassa hi pādakajjhānādīnaṃ abhāvena tesaṃ vasena niyamābhāvato vipassanāniyamena pañcaṅgikova maggo hotīti. Apica samāpattilābhinopi jhānaṃ pādakaṃ akatvā pakiṇṇakasaṅkhāre sammasitvā uppāditamaggopi vipassanāniyameneva pañcaṅgikova hotīti ayamettha aṭṭhakathādito uddhaṭo vinicchayasāro. Theravādadassanādivasappavatto pana papañco aṭṭhakathādīsu vuttanayena veditabbo. Yathā cettha, evaṃ sabbatthāpi vitthāranayo tattha tattha vuttanayena gahetabbo. Ganthabhīrukajanānuggahatthaṃ panettha saṅkhepakathā adhippetā."
    ],
    "innerText": "Tattha yena paṭhamajjhānādīsu aññataraṃ jhānaṃ samāpajjitvā tato vuṭṭhāya pakiṇṇakasaṅkhāre sammasitvā maggo uppādito hoti, tassa so maggo paṭhamajjhānādīsu taṃtaṃpādakajjhānasadiso hoti. Sace pana vipassanāpādakaṃ kiñci jhānaṃ natthi, kevalaṃ paṭhamajjhānādīsu aññataraṃ jhānaṃ sammasitvā maggo uppādito hoti, tassa so sammasitajjhānasadiso hoti. Yadā pana yaṃ kiñci jhānaṃ samāpajjitvā tato vuṭṭhāya aññataraṃ sammasitvā maggo uppādito hoti, tadā puggalajjhāsayavasena dvīsu aññatarasadiso hoti. Sace pana puggalassa tathāvidho ajjhāsayo natthi, heṭṭhimaheṭṭhimajjhānato vuṭṭhāya uparūparijhānadhamme sammasitvā uppāditamaggo pādakajjhānaṃ anapekkhitvā sammasitajjhānasadiso hoti. Uparūparijhānato pana vuṭṭhāya heṭṭhimaheṭṭhimajjhānadhamme sammasitvā uppāditamaggo sammasitajjhānaṃ anapekkhitvā pādakajjhānasadiso hoti. Heṭṭhimaheṭṭhimajjhānato hi uparūparijhānaṃ balavataranti. Vedanāniyamo pana sabbatthāpi vuṭṭhānagāminivipassanāniyamena hoti. Tathā sukkhavipassakassa sakalajjhānaṅganiyamo. Tassa hi pādakajjhānādīnaṃ abhāvena tesaṃ vasena niyamābhāvato vipassanāniyamena pañcaṅgikova maggo hotīti. Apica samāpattilābhinopi jhānaṃ pādakaṃ akatvā pakiṇṇakasaṅkhāre sammasitvā uppāditamaggopi vipassanāniyameneva pañcaṅgikova hotīti ayamettha aṭṭhakathādito uddhaṭo vinicchayasāro. Theravādadassanādivasappavatto pana papañco aṭṭhakathādīsu vuttanayena veditabbo. Yathā cettha, evaṃ sabbatthāpi vitthāranayo tattha tattha vuttanayena gahetabbo. Ganthabhīrukajanānuggahatthaṃ panettha saṅkhepakathā adhippetā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42"
      },
      ". Yathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpāvacaraṃ"
      },
      " cittaṃ paṭhamādipañcavidhajhānabhedena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gayhati"
      },
      " ‘‘paṭhamajjhāna’’ntyādinā vuccati ",
      ", tathā anuttarampi cittaṃ ‘‘paṭhamajjhānasotāpattimaggacitta’’ntyādinā gayhati. Āruppañcāpi upekkhekaggatāyogena aṅgasamatāya pañcamajjhāne gayhati, pañcamajjhānavohāraṃ labhatītyattho. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpāvacaraṃ"
      },
      " cittaṃ anuttarañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭhamādijhānabhede"
      },
      " ‘‘paṭhamajjhānakusalacittaṃ, paṭhamajjhānasotāpattimaggacittantyādinā yathā gayhati, tathā āruppañcāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcame"
      },
      " jhāne gayhatīti yojanā. Ācariyassāpi hi ayameva yojanā adhippetāti dissati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāmarūpaparicchede"
      },
      " ujukameva tathā vuttattā. Vuttañhi tattha –"
    ],
    "innerText": "42. Yathā rūpāvacaraṃ cittaṃ paṭhamādipañcavidhajhānabhedena gayhati ‘‘paṭhamajjhāna’’ntyādinā vuccati , tathā anuttarampi cittaṃ ‘‘paṭhamajjhānasotāpattimaggacitta’’ntyādinā gayhati. Āruppañcāpi upekkhekaggatāyogena aṅgasamatāya pañcamajjhāne gayhati, pañcamajjhānavohāraṃ labhatītyattho. Atha vā rūpāvacaraṃ cittaṃ anuttarañca paṭhamādijhānabhede ‘‘paṭhamajjhānakusalacittaṃ, paṭhamajjhānasotāpattimaggacittantyādinā yathā gayhati, tathā āruppañcāpi pañcame jhāne gayhatīti yojanā. Ācariyassāpi hi ayameva yojanā adhippetāti dissati nāmarūpaparicchede ujukameva tathā vuttattā. Vuttañhi tattha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Rūpāvacaracittāni, gayhantānuttarāni ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paṭhamādijhānabhede, āruppañcāpi pañcame’’ti. (nāma. pari. 24);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      "ti yasmā rūpāvacaraṃ viya anuttarampi paṭhamādijhānabhede gayhati, āruppañcāpi pañcame gayhati, yasmā vā jhānaṅgayogabhedena ekekaṃ pañcadhā katvā anuttaraṃ cittaṃ cattālīsavidhanti vuccati, rūpāvacaralokuttarāni viya ca paṭhamādijhānabhede, tathā āruppañcāpi pañcame gayhati, tasmā paṭhamādikamekekaṃ jhānaṃ lokiyaṃ tividhaṃ, lokuttaraṃ aṭṭhavidhanti ekādasavidhaṃ. Ante tu jhānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tevīsatividhaṃ"
      },
      " tividharūpāvacaradvādasavidhaarūpāvacaraaṭṭhalokuttaravasenātyattho."
    ],
    "innerText": "Tasmāti yasmā rūpāvacaraṃ viya anuttarampi paṭhamādijhānabhede gayhati, āruppañcāpi pañcame gayhati, yasmā vā jhānaṅgayogabhedena ekekaṃ pañcadhā katvā anuttaraṃ cittaṃ cattālīsavidhanti vuccati, rūpāvacaralokuttarāni viya ca paṭhamādijhānabhede, tathā āruppañcāpi pañcame gayhati, tasmā paṭhamādikamekekaṃ jhānaṃ lokiyaṃ tividhaṃ, lokuttaraṃ aṭṭhavidhanti ekādasavidhaṃ. Ante tu jhānaṃ tevīsatividhaṃ tividharūpāvacaradvādasavidhaarūpāvacaraaṭṭhalokuttaravasenātyattho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "43"
      },
      ". Pādakajjhānādivasena gaṇanavuḍḍhi kusalavipākesveva sambhavatīti tesameva gaṇanaṃ ekavīsasatagaṇanāya aṅgabhāvena dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sattatiṃsā’’"
      },
      "tyādi."
    ],
    "innerText": "43. Pādakajjhānādivasena gaṇanavuḍḍhi kusalavipākesveva sambhavatīti tesameva gaṇanaṃ ekavīsasatagaṇanāya aṅgabhāvena dassento āha ‘‘sattatiṃsā’’tyādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti abhidhammatthavibhāviniyā nāma abhidhammatthasaṅgahavaṇṇanāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cittaparicchedavaṇṇanā niṭṭhitā."
  }
]