[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Dhammānulomapaccanīye tikadukapaṭṭhānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-1. Kusalattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-7. Paṭiccavārādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Paccayacatukkaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetupaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Kusalaṃ ",
      " hetuṃ dhammaṃ paṭicca nakusalo nahetu dhammo uppajjati hetupaccayā. Kusalaṃ hetuṃ dhammaṃ paṭicca naakusalo nahetu dhammo uppajjati hetupaccayā. Kusalaṃ hetuṃ dhammaṃ paṭicca naabyākato nahetu dhammo uppajjati hetupaccayā. Kusalaṃ hetuṃ dhammaṃ paṭicca naakusalo nahetu ca naabyākato nahetu ca dhammā uppajjanti hetupaccayā. Kusalaṃ hetuṃ dhammaṃ paṭicca nakusalo nahetu ca naakusalo nahetu ca dhammā uppajjanti hetupaccayā. (5)"
    ],
    "innerText": "1. Kusalaṃ hetuṃ dhammaṃ paṭicca nakusalo nahetu dhammo uppajjati hetupaccayā. Kusalaṃ hetuṃ dhammaṃ paṭicca naakusalo nahetu dhammo uppajjati hetupaccayā. Kusalaṃ hetuṃ dhammaṃ paṭicca naabyākato nahetu dhammo uppajjati hetupaccayā. Kusalaṃ hetuṃ dhammaṃ paṭicca naakusalo nahetu ca naabyākato nahetu ca dhammā uppajjanti hetupaccayā. Kusalaṃ hetuṃ dhammaṃ paṭicca nakusalo nahetu ca naakusalo nahetu ca dhammā uppajjanti hetupaccayā. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Akusalaṃ hetuṃ dhammaṃ paṭicca naakusalo nahetu dhammo uppajjati ",
      " hetupaccayā. Akusalaṃ hetuṃ dhammaṃ paṭicca nakusalo nahetu dhammo uppajjati hetupaccayā. Akusalaṃ hetuṃ dhammaṃ paṭicca naabyākato nahetu dhammo uppajjati hetupaccayā. Akusalaṃ hetuṃ dhammaṃ paṭicca nakusalo nahetu ca naabyākato nahetu ca dhammā uppajjanti hetupaccayā. Akusalaṃ hetuṃ dhammaṃ paṭicca nakusalo nahetu ca naakusalo nahetu ca dhammā uppajjanti hetupaccayā. (5)"
    ],
    "innerText": "Akusalaṃ hetuṃ dhammaṃ paṭicca naakusalo nahetu dhammo uppajjati hetupaccayā. Akusalaṃ hetuṃ dhammaṃ paṭicca nakusalo nahetu dhammo uppajjati hetupaccayā. Akusalaṃ hetuṃ dhammaṃ paṭicca naabyākato nahetu dhammo uppajjati hetupaccayā. Akusalaṃ hetuṃ dhammaṃ paṭicca nakusalo nahetu ca naabyākato nahetu ca dhammā uppajjanti hetupaccayā. Akusalaṃ hetuṃ dhammaṃ paṭicca nakusalo nahetu ca naakusalo nahetu ca dhammā uppajjanti hetupaccayā. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Abyākataṃ ",
      " hetuṃ dhammaṃ paṭicca nakusalo nahetu dhammo uppajjati hetupaccayā. Abyākataṃ hetuṃ dhammaṃ paṭicca naakusalo nahetu dhammo uppajjati hetupaccayā. Abyākataṃ hetuṃ dhammaṃ paṭicca nakusalo nahetu ca naakusalo nahetu ca dhammā uppajjanti hetupaccayā. (3) (Saṃkhittaṃ.)"
    ],
    "innerText": "Abyākataṃ hetuṃ dhammaṃ paṭicca nakusalo nahetu dhammo uppajjati hetupaccayā. Abyākataṃ hetuṃ dhammaṃ paṭicca naakusalo nahetu dhammo uppajjati hetupaccayā. Abyākataṃ hetuṃ dhammaṃ paṭicca nakusalo nahetu ca naakusalo nahetu ca dhammā uppajjanti hetupaccayā. (3) (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā terasa, ārammaṇe nava…pe… avigate terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Paccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Naārammaṇapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Kusalaṃ hetuṃ dhammaṃ paṭicca nakusalo nahetu dhammo uppajjati naārammaṇapaccayā. (Saṃkhittaṃ.)"
    ],
    "innerText": "2. Kusalaṃ hetuṃ dhammaṃ paṭicca nakusalo nahetu dhammo uppajjati naārammaṇapaccayā. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naārammaṇe nava, naadhipatiyā terasa…pe… navippayutte nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Sahajātavārampi…pe… sampayuttavārampi paṭiccavārasadisaṃ vitthāretabbaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetu-ārammaṇapaccayā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Kusalo hetu dhammo nakusalassa nahetussa dhammassa hetupaccayena paccayo. Kusalo hetu dhammo naakusalassa nahetussa dhammassa ",
      " hetupaccayena paccayo. Kusalo hetu dhammo naabyākatassa nahetussa dhammassa hetupaccayena paccayo. Kusalo hetu dhammo naakusalassa nahetussa ca naabyākatassa nahetussa ca dhammassa hetupaccayena paccayo. Kusalo hetu dhammo nakusalassa nahetussa ca naakusalassa nahetussa ca dhammassa hetupaccayena paccayo. (5)"
    ],
    "innerText": "3. Kusalo hetu dhammo nakusalassa nahetussa dhammassa hetupaccayena paccayo. Kusalo hetu dhammo naakusalassa nahetussa dhammassa hetupaccayena paccayo. Kusalo hetu dhammo naabyākatassa nahetussa dhammassa hetupaccayena paccayo. Kusalo hetu dhammo naakusalassa nahetussa ca naabyākatassa nahetussa ca dhammassa hetupaccayena paccayo. Kusalo hetu dhammo nakusalassa nahetussa ca naakusalassa nahetussa ca dhammassa hetupaccayena paccayo. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalo hetu dhammo naakusalassa nahetussa dhammassa hetupaccayena paccayo… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākato hetu dhammo nakusalassa nahetussa dhammassa hetupaccayena paccayo… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kusalo hetu dhammo nakusalassa nahetussa dhammassa ārammaṇapaccayena paccayo. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Hetuyā ",
      " terasa, ārammaṇe aṭṭhārasa…pe… avigate terasa. (Pañhāvāraṃ vitthāretabbaṃ.)"
    ],
    "innerText": "4. Hetuyā terasa, ārammaṇe aṭṭhārasa…pe… avigate terasa. (Pañhāvāraṃ vitthāretabbaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". Kusalaṃ ",
      " nahetuṃ dhammaṃ paṭicca naakusalo nanahetu dhammo uppajjati hetupaccayā. Kusalaṃ nahetuṃ dhammaṃ paṭicca naabyākato nanahetu dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.)"
    ],
    "innerText": "5. Kusalaṃ nahetuṃ dhammaṃ paṭicca naakusalo nanahetu dhammo uppajjati hetupaccayā. Kusalaṃ nahetuṃ dhammaṃ paṭicca naabyākato nanahetu dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā nava, ārammaṇe nava…pe… avigate nava. (Sabbattha nava.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-2. Kusalattika-sahetukadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-7. Paṭiccavārādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Paccayacatukkaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetupaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". Kusalaṃ sahetukaṃ dhammaṃ paṭicca nakusalo nasahetuko dhammo uppajjati hetupaccayā. Kusalaṃ sahetukaṃ dhammaṃ paṭicca naakusalo nasahetuko dhammo uppajjati hetupaccayā. Kusalaṃ sahetukaṃ dhammaṃ paṭicca nakusalo nasahetuko ca naakusalo nasahetuko ca dhammā uppajjanti ",
      " hetupaccayā. Tīṇi."
    ],
    "innerText": "6. Kusalaṃ sahetukaṃ dhammaṃ paṭicca nakusalo nasahetuko dhammo uppajjati hetupaccayā. Kusalaṃ sahetukaṃ dhammaṃ paṭicca naakusalo nasahetuko dhammo uppajjati hetupaccayā. Kusalaṃ sahetukaṃ dhammaṃ paṭicca nakusalo nasahetuko ca naakusalo nasahetuko ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalaṃ sahetukaṃ dhammaṃ paṭicca naakusalo nasahetuko dhammo uppajjati hetupaccayā. Akusalaṃ sahetukaṃ dhammaṃ paṭicca nakusalo nasahetuko dhammo uppajjati hetupaccayā. Akusalaṃ sahetukaṃ dhammaṃ paṭicca nakusalo nasahetuko ca naakusalo nasahetuko ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākataṃ sahetukaṃ dhammaṃ paṭicca nakusalo nasahetuko dhammo uppajjati hetupaccayā. Abyākataṃ sahetukaṃ dhammaṃ paṭicca naakusalo nasahetuko dhammo uppajjati hetupaccayā. Abyākataṃ sahetukaṃ dhammaṃ paṭicca nakusalo nasahetuko ca naakusalo nasahetuko ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hetuyā ",
      " nava, ārammaṇe tīṇi…pe… avigate ekādasa. (Sahajātavārampi…pe… sampayuttavārampi paṭiccavārasadisaṃ.)"
    ],
    "innerText": "Hetuyā nava, ārammaṇe tīṇi…pe… avigate ekādasa. (Sahajātavārampi…pe… sampayuttavārampi paṭiccavārasadisaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". Kusalo sahetuko dhammo nakusalassa nasahetukassa dhammassa hetupaccayena paccayo. Kusalo sahetuko dhammo naakusalassa nasahetukassa dhammassa hetupaccayena paccayo. Kusalo sahetuko dhammo nakusalassa nasahetukassa ca naakusalassa nasahetukassa ca dhammassa hetupaccayena paccayo. Tīṇi."
    ],
    "innerText": "7. Kusalo sahetuko dhammo nakusalassa nasahetukassa dhammassa hetupaccayena paccayo. Kusalo sahetuko dhammo naakusalassa nasahetukassa dhammassa hetupaccayena paccayo. Kusalo sahetuko dhammo nakusalassa nasahetukassa ca naakusalassa nasahetukassa ca dhammassa hetupaccayena paccayo. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Akusalo ",
      " sahetuko dhammo naakusalassa nasahetukassa dhammassa hetupaccayena paccayo. Akusalo sahetuko dhammo nakusalassa nasahetukassa dhammassa hetupaccayena paccayo. Akusalo sahetuko dhammo nakusalassa nasahetukassa ca naakusalassa ",
      " nasahetukassa ca dhammassa hetupaccayena paccayo. Tīṇi."
    ],
    "innerText": "Akusalo sahetuko dhammo naakusalassa nasahetukassa dhammassa hetupaccayena paccayo. Akusalo sahetuko dhammo nakusalassa nasahetukassa dhammassa hetupaccayena paccayo. Akusalo sahetuko dhammo nakusalassa nasahetukassa ca naakusalassa nasahetukassa ca dhammassa hetupaccayena paccayo. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākato sahetuko dhammo nakusalassa nasahetukassa dhammassa hetupaccayena paccayo. Abyākato sahetuko dhammo naakusalassa nasahetukassa dhammassa hetupaccayena paccayo. Abyākato sahetuko dhammo nakusalassa nasahetukassa ca naakusalassa nasahetukassa ca dhammassa hetupaccayena paccayo. Tīṇi. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ". Hetuyā nava, ārammaṇe pannarasa…pe… avigate ekādasa."
    ],
    "innerText": "8. Hetuyā nava, ārammaṇe pannarasa…pe… avigate ekādasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ". Akusalaṃ ahetukaṃ dhammaṃ paṭicca nakusalo naahetuko dhammo uppajjati hetupaccayā. Akusalaṃ ahetukaṃ dhammaṃ paṭicca naabyākato naahetuko dhammo uppajjati hetupaccayā. Akusalaṃ ahetukaṃ dhammaṃ paṭicca nakusalo naahetuko ca naabyākato naahetuko ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "9. Akusalaṃ ahetukaṃ dhammaṃ paṭicca nakusalo naahetuko dhammo uppajjati hetupaccayā. Akusalaṃ ahetukaṃ dhammaṃ paṭicca naabyākato naahetuko dhammo uppajjati hetupaccayā. Akusalaṃ ahetukaṃ dhammaṃ paṭicca nakusalo naahetuko ca naabyākato naahetuko ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Abyākataṃ ahetukaṃ dhammaṃ paṭicca nakusalo naahetuko dhammo uppajjati hetupaccayā. Abyākataṃ ahetukaṃ dhammaṃ paṭicca naakusalo naahetuko dhammo uppajjati hetupaccayā. Abyākataṃ ",
      " ahetukaṃ dhammaṃ paṭicca nakusalo naahetuko ca naakusalo naahetuko ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "Abyākataṃ ahetukaṃ dhammaṃ paṭicca nakusalo naahetuko dhammo uppajjati hetupaccayā. Abyākataṃ ahetukaṃ dhammaṃ paṭicca naakusalo naahetuko dhammo uppajjati hetupaccayā. Abyākataṃ ahetukaṃ dhammaṃ paṭicca nakusalo naahetuko ca naakusalo naahetuko ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā cha, ārammaṇe cha…pe… avigate cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-3. Kusalattika-hetusampayuttadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ". Kusalaṃ ",
      " hetusampayuttaṃ dhammaṃ paṭicca nakusalo nahetusampayutto dhammo uppajjati hetupaccayā. (Sahetukadukasadisaṃ.)"
    ],
    "innerText": "10. Kusalaṃ hetusampayuttaṃ dhammaṃ paṭicca nakusalo nahetusampayutto dhammo uppajjati hetupaccayā. (Sahetukadukasadisaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-4. Kusalattika-hetusahetukadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". Kusalaṃ hetuñceva sahetukañca dhammaṃ paṭicca naakusalo nahetu ceva naahetuko ca dhammo uppajjati hetupaccayā. Kusalaṃ hetuñceva ",
      " sahetukañca dhammaṃ paṭicca naabyākato nahetu ceva naahetuko ca dhammo uppajjati hetupaccayā. Kusalaṃ hetuñceva sahetukañca dhammaṃ paṭicca naakusalo nahetu ceva naahetuko ca naabyākato nahetu ceva naahetuko ca dhammā uppajjanti hetupaccayā. (3)"
    ],
    "innerText": "11. Kusalaṃ hetuñceva sahetukañca dhammaṃ paṭicca naakusalo nahetu ceva naahetuko ca dhammo uppajjati hetupaccayā. Kusalaṃ hetuñceva sahetukañca dhammaṃ paṭicca naabyākato nahetu ceva naahetuko ca dhammo uppajjati hetupaccayā. Kusalaṃ hetuñceva sahetukañca dhammaṃ paṭicca naakusalo nahetu ceva naahetuko ca naabyākato nahetu ceva naahetuko ca dhammā uppajjanti hetupaccayā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalaṃ hetuñceva sahetukañca dhammaṃ paṭicca nakusalo nahetu ceva naahetuko ca dhammo uppajjati hetupaccayā… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākataṃ hetuñceva sahetukañca dhammaṃ paṭicca nakusalo nahetu ceva naahetuko ca dhammo uppajjati hetupaccayā. Abyākataṃ hetuñceva sahetukañca dhammaṃ paṭicca naakusalo nahetu ceva naahetuko ca dhammo uppajjati hetupaccayā. Abyākataṃ hetuñceva sahetukañca dhammaṃ paṭicca nakusalo nahetu ceva naahetuko ca naakusalo nahetu ceva naahetuko ca dhammā uppajjanti hetupaccayā. (3) (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ". Kusalaṃ ",
      " sahetukañceva na ca hetuṃ dhammaṃ paṭicca naakusalo naahetuko ceva nanahetu ",
      " ca dhammo uppajjati hetupaccayā. Kusalaṃ sahetukañceva na ca hetuṃ dhammaṃ paṭicca naabyākato naahetuko ceva nanahetu ca dhammo uppajjati hetupaccayā. Kusalaṃ sahetukañceva na ca hetuṃ dhammaṃ paṭicca naakusalo naahetuko ceva nanahetu ca naabyākato naahetuko ceva nanahetu ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "12. Kusalaṃ sahetukañceva na ca hetuṃ dhammaṃ paṭicca naakusalo naahetuko ceva nanahetu ca dhammo uppajjati hetupaccayā. Kusalaṃ sahetukañceva na ca hetuṃ dhammaṃ paṭicca naabyākato naahetuko ceva nanahetu ca dhammo uppajjati hetupaccayā. Kusalaṃ sahetukañceva na ca hetuṃ dhammaṃ paṭicca naakusalo naahetuko ceva nanahetu ca naabyākato naahetuko ceva nanahetu ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalaṃ sahetukañceva na ca hetuṃ dhammaṃ paṭicca nakusalo naahetuko ceva nanahetu ca dhammo uppajjati hetupaccayā. Akusalaṃ sahetukañceva na ca hetuṃ dhammaṃ paṭicca naabyākato naahetuko ceva nanahetu ca dhammo uppajjati hetupaccayā. Akusalaṃ sahetukañceva na ca hetuṃ dhammaṃ paṭicca naakusalo naahetuko ceva nanahetu ca naabyākato naahetuko ceva nanahetu ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Abyākataṃ sahetukañceva na ca hetuṃ dhammaṃ paṭicca nakusalo naahetuko ceva nanahetu ca dhammo uppajjati hetupaccayā. Abyākataṃ ",
      " sahetukañceva na ca hetuṃ dhammaṃ paṭicca naakusalo naahetuko ceva nanahetu ca dhammo uppajjati hetupaccayā. Abyākataṃ sahetukañceva na ca hetuṃ dhammaṃ paṭicca nakusalo naahetuko ceva nanahetu ca naakusalo naahetuko ceva nanahetu ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "Abyākataṃ sahetukañceva na ca hetuṃ dhammaṃ paṭicca nakusalo naahetuko ceva nanahetu ca dhammo uppajjati hetupaccayā. Abyākataṃ sahetukañceva na ca hetuṃ dhammaṃ paṭicca naakusalo naahetuko ceva nanahetu ca dhammo uppajjati hetupaccayā. Abyākataṃ sahetukañceva na ca hetuṃ dhammaṃ paṭicca nakusalo naahetuko ceva nanahetu ca naakusalo naahetuko ceva nanahetu ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-5. Kusalattika-hetuhetusampayuttadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". Kusalaṃ hetuñceva hetusampayuttañca dhammaṃ paṭicca naakusalo nahetu ceva nahetuvippayutto ca dhammo uppajjati hetupaccayā. Kusalaṃ hetuñceva hetusampayuttañca dhammaṃ paṭicca naabyākato nahetu ceva nahetuvippayutto ca dhammo uppajjati hetupaccayā. Kusalaṃ hetuñceva hetusampayuttañca dhammaṃ paṭicca naakusalo nahetu ceva nahetuvippayutto ca naabyākato nahetu ceva nahetuvippayutto ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "13. Kusalaṃ hetuñceva hetusampayuttañca dhammaṃ paṭicca naakusalo nahetu ceva nahetuvippayutto ca dhammo uppajjati hetupaccayā. Kusalaṃ hetuñceva hetusampayuttañca dhammaṃ paṭicca naabyākato nahetu ceva nahetuvippayutto ca dhammo uppajjati hetupaccayā. Kusalaṃ hetuñceva hetusampayuttañca dhammaṃ paṭicca naakusalo nahetu ceva nahetuvippayutto ca naabyākato nahetu ceva nahetuvippayutto ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "(Akusalaṃ tīṇi kātabbaṃ, abyākataṃ tīṇi ",
      " kātabbaṃ.)"
    ],
    "innerText": "(Akusalaṃ tīṇi kātabbaṃ, abyākataṃ tīṇi kātabbaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Kusalaṃ hetusampayuttañceva na ca hetuṃ dhammaṃ paṭicca naakusalo nahetuvippayutto ceva ",
      " nanahetu ca dhammo uppajjati hetupaccayā. Kusalaṃ hetusampayuttañceva na ca hetuṃ dhammaṃ paṭicca naabyākato nahetuvippayutto ceva nanahetu ca dhammo uppajjati hetupaccayā. Kusalaṃ hetusampayuttañceva na ca hetuṃ dhammaṃ paṭicca naakusalo nahetuvippayutto ceva nanahetu ca naabyākato nahetuvippayutto ceva nanahetu ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "14. Kusalaṃ hetusampayuttañceva na ca hetuṃ dhammaṃ paṭicca naakusalo nahetuvippayutto ceva nanahetu ca dhammo uppajjati hetupaccayā. Kusalaṃ hetusampayuttañceva na ca hetuṃ dhammaṃ paṭicca naabyākato nahetuvippayutto ceva nanahetu ca dhammo uppajjati hetupaccayā. Kusalaṃ hetusampayuttañceva na ca hetuṃ dhammaṃ paṭicca naakusalo nahetuvippayutto ceva nanahetu ca naabyākato nahetuvippayutto ceva nanahetu ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalaṃ hetusampayuttañceva na ca hetuṃ dhammaṃ paṭicca… tīṇi. Abyākataṃ… tīṇi. Hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-6. Kusalattika-hetusahetukadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". Kusalaṃ nahetuṃ sahetukaṃ dhammaṃ paṭicca nakusalo nahetu nasahetuko dhammo uppajjati hetupaccayā. Kusalaṃ nahetuṃ sahetukaṃ dhammaṃ paṭicca naakusalo nahetu nasahetuko dhammo uppajjati ",
      " hetupaccayā. Kusalaṃ nahetuṃ sahetukaṃ dhammaṃ paṭicca nakusalo nahetu nasahetuko ca naakusalo nahetu nasahetuko ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "15. Kusalaṃ nahetuṃ sahetukaṃ dhammaṃ paṭicca nakusalo nahetu nasahetuko dhammo uppajjati hetupaccayā. Kusalaṃ nahetuṃ sahetukaṃ dhammaṃ paṭicca naakusalo nahetu nasahetuko dhammo uppajjati hetupaccayā. Kusalaṃ nahetuṃ sahetukaṃ dhammaṃ paṭicca nakusalo nahetu nasahetuko ca naakusalo nahetu nasahetuko ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalaṃ nahetuṃ sahetukaṃ… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākataṃ nahetuṃ sahetukaṃ dhammaṃ paṭicca nakusalo…pe… naakusalo…pe… nakusalo nahetu nasahetuko ca naakusalo nahetu nasahetuko ca dhammā uppajjanti hetupaccayā… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". Abyākataṃ nahetuṃ ahetukaṃ dhammaṃ paṭicca nakusalo nahetu naahetuko dhammo uppajjati hetupaccayā. Abyākataṃ nahetuṃ ahetukaṃ dhammaṃ paṭicca naakusalo nahetu naahetuko dhammo uppajjati hetupaccayā. Abyākataṃ nahetuṃ ahetukaṃ dhammaṃ paṭicca nakusalo nahetu naahetuko ca naakusalo nahetu naahetuko ca dhammā uppajjanti hetupaccayā. (3)"
    ],
    "innerText": "16. Abyākataṃ nahetuṃ ahetukaṃ dhammaṃ paṭicca nakusalo nahetu naahetuko dhammo uppajjati hetupaccayā. Abyākataṃ nahetuṃ ahetukaṃ dhammaṃ paṭicca naakusalo nahetu naahetuko dhammo uppajjati hetupaccayā. Abyākataṃ nahetuṃ ahetukaṃ dhammaṃ paṭicca nakusalo nahetu naahetuko ca naakusalo nahetu naahetuko ca dhammā uppajjanti hetupaccayā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Hetugocchakaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-7-8. Kusalattika-sappaccayādidukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ". Abyākato ",
      " appaccayo dhammo naabyākatassa naappaccayassa ",
      " dhammassa ārammaṇapaccayena paccayo. Abyākato appaccayo dhammo nakusalassa naappaccayassa dhammassa ārammaṇapaccayena paccayo. Abyākato appaccayo dhammo naakusalassa naappaccayassa dhammassa ārammaṇapaccayena paccayo. Abyākato appaccayo dhammo naakusalassa naappaccayassa ca naabyākatassa naappaccayassa ca dhammassa ārammaṇapaccayena paccayo. Abyākato appaccayo dhammo nakusalassa naappaccayassa ca naakusalassa naappaccayassa ca dhammassa ārammaṇapaccayena paccayo. (5)"
    ],
    "innerText": "17. Abyākato appaccayo dhammo naabyākatassa naappaccayassa dhammassa ārammaṇapaccayena paccayo. Abyākato appaccayo dhammo nakusalassa naappaccayassa dhammassa ārammaṇapaccayena paccayo. Abyākato appaccayo dhammo naakusalassa naappaccayassa dhammassa ārammaṇapaccayena paccayo. Abyākato appaccayo dhammo naakusalassa naappaccayassa ca naabyākatassa naappaccayassa ca dhammassa ārammaṇapaccayena paccayo. Abyākato appaccayo dhammo nakusalassa naappaccayassa ca naakusalassa naappaccayassa ca dhammassa ārammaṇapaccayena paccayo. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ārammaṇe pañca. (Asaṅkhataṃ appaccayasadisaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-9. Kusalattika-sanidassanadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". Abyākato ",
      " sanidassano dhammo naabyākatassa nasanidassanassa dhammassa ārammaṇapaccayena paccayo. Abyākato sanidassano dhammo nakusalassa nasanidassanassa…pe… (cha pañhā kātabbā)."
    ],
    "innerText": "18. Abyākato sanidassano dhammo naabyākatassa nasanidassanassa dhammassa ārammaṇapaccayena paccayo. Abyākato sanidassano dhammo nakusalassa nasanidassanassa…pe… (cha pañhā kātabbā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kusalaṃ anidassanaṃ dhammaṃ paṭicca nakusalo naanidassano dhammo uppajjati hetupaccayā. Akusalena tīṇiyeva. Abyākatena tīṇiyeva. Hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-10. Kusalattika-sappaṭighadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ". Abyākataṃ sappaṭighaṃ dhammaṃ paṭicca nakusalo nasappaṭigho dhammo uppajjati hetupaccayā. Abyākataṃ sappaṭighaṃ dhammaṃ paṭicca naakusalo nasappaṭigho dhammo uppajjati hetupaccayā. Abyākataṃ sappaṭighaṃ dhammaṃ paṭicca nakusalo nasappaṭigho ca naakusalo nasappaṭigho ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "19. Abyākataṃ sappaṭighaṃ dhammaṃ paṭicca nakusalo nasappaṭigho dhammo uppajjati hetupaccayā. Abyākataṃ sappaṭighaṃ dhammaṃ paṭicca naakusalo nasappaṭigho dhammo uppajjati hetupaccayā. Abyākataṃ sappaṭighaṃ dhammaṃ paṭicca nakusalo nasappaṭigho ca naakusalo nasappaṭigho ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kusalaṃ appaṭighena tīṇi. Akusalaṃ appaṭighena tīṇi. Abyākataṃ appaṭighena tīṇi. Kusalaṃ appaṭighañca abyākataṃ appaṭighañca tīṇi. Akusalaṃ appaṭighañca abyākataṃ ",
      " appaṭighañca tīṇi. Hetuyā pannarasa."
    ],
    "innerText": "Kusalaṃ appaṭighena tīṇi. Akusalaṃ appaṭighena tīṇi. Abyākataṃ appaṭighena tīṇi. Kusalaṃ appaṭighañca abyākataṃ appaṭighañca tīṇi. Akusalaṃ appaṭighañca abyākataṃ appaṭighañca tīṇi. Hetuyā pannarasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-11. Kusalattika-rūpīdukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". Abyākataṃ ",
      " rūpiṃ dhammaṃ paṭicca nakusalo narūpī dhammo uppajjati hetupaccayā. Abyākataṃ rūpiṃ dhammaṃ paṭicca naakusalo narūpī dhammo uppajjati hetupaccayā. Abyākataṃ rūpiṃ dhammaṃ paṭicca nakusalo narūpī ca naakusalo narūpī ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "20. Abyākataṃ rūpiṃ dhammaṃ paṭicca nakusalo narūpī dhammo uppajjati hetupaccayā. Abyākataṃ rūpiṃ dhammaṃ paṭicca naakusalo narūpī dhammo uppajjati hetupaccayā. Abyākataṃ rūpiṃ dhammaṃ paṭicca nakusalo narūpī ca naakusalo narūpī ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kusalaṃ arūpiṃ dhammaṃ paṭicca tīṇi. Akusalaṃ arūpiṃ dhammaṃ paṭicca tīṇi. Abyākataṃ arūpiṃ dhammaṃ paṭicca tīṇi. Hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-12. Kusalattika-lokiyadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". Abyākataṃ lokiyaṃ dhammaṃ paccayā naabyākato nalokiyo dhammo uppajjati hetupaccayā. Abyākataṃ lokiyaṃ dhammaṃ paccayā nakusalo nalokiyo dhammo uppajjati hetupaccayā. Abyākataṃ lokiyaṃ ",
      " dhammaṃ paccayā naakusalo nalokiyo dhammo uppajjati hetupaccayā. Abyākataṃ lokiyaṃ dhammaṃ paccayā naakusalo nalokiyo ca naabyākato nalokiyo ca dhammā uppajjanti hetupaccayā. Abyākataṃ lokiyaṃ dhammaṃ paccayā nakusalo nalokiyo ca naakusalo nalokiyo ca dhammā uppajjanti hetupaccayā. Hetuyā pañca."
    ],
    "innerText": "21. Abyākataṃ lokiyaṃ dhammaṃ paccayā naabyākato nalokiyo dhammo uppajjati hetupaccayā. Abyākataṃ lokiyaṃ dhammaṃ paccayā nakusalo nalokiyo dhammo uppajjati hetupaccayā. Abyākataṃ lokiyaṃ dhammaṃ paccayā naakusalo nalokiyo dhammo uppajjati hetupaccayā. Abyākataṃ lokiyaṃ dhammaṃ paccayā naakusalo nalokiyo ca naabyākato nalokiyo ca dhammā uppajjanti hetupaccayā. Abyākataṃ lokiyaṃ dhammaṃ paccayā nakusalo nalokiyo ca naakusalo nalokiyo ca dhammā uppajjanti hetupaccayā. Hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kusalaṃ lokuttaraṃ dhammaṃ paṭicca nakusalo nalokuttaro dhammo uppajjati hetupaccayā. Kusalaṃ lokuttaraṃ dhammaṃ paṭicca naakusalo nalokuttaro dhammo uppajjati hetupaccayā. Kusalaṃ lokuttaraṃ dhammaṃ paṭicca nakusalo nalokuttaro ca naakusalo nalokuttaro ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākataṃ lokuttaraṃ dhammaṃ paṭicca nakusalo nalokuttaro dhammo uppajjati hetupaccayā. Abyākataṃ lokuttaraṃ dhammaṃ paṭicca naakusalo nalokuttaro dhammo uppajjati hetupaccayā. Abyākataṃ lokuttaraṃ dhammaṃ paṭicca nakusalo nalokuttaro ca naakusalo nalokuttaro ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-13. Kusalattika-kenaciviññeyyadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". Kusalaṃ ",
      " kenaci viññeyyaṃ dhammaṃ paṭicca nakusalo nakenaci ",
      " viññeyyo dhammo uppajjati hetupaccayā. Kusalaṃ kenaci viññeyyaṃ dhammaṃ paṭicca naakusalo nakenaci viññeyyo dhammo uppajjati hetupaccayā. Kusalaṃ kenaci viññeyyaṃ dhammaṃ paṭicca naabyākato nakenaci viññeyyo dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.) Hetuyā ekūnavīsati."
    ],
    "innerText": "22. Kusalaṃ kenaci viññeyyaṃ dhammaṃ paṭicca nakusalo nakenaci viññeyyo dhammo uppajjati hetupaccayā. Kusalaṃ kenaci viññeyyaṃ dhammaṃ paṭicca naakusalo nakenaci viññeyyo dhammo uppajjati hetupaccayā. Kusalaṃ kenaci viññeyyaṃ dhammaṃ paṭicca naabyākato nakenaci viññeyyo dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.) Hetuyā ekūnavīsati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". Kusalaṃ kenaci naviññeyyaṃ dhammaṃ paṭicca nakusalo nakenaci naviññeyyo dhammo uppajjati hetupaccayā. Kusalaṃ kenaci naviññeyyaṃ dhammaṃ paṭicca naakusalo nakenaci naviññeyyo dhammo uppajjati hetupaccayā. Kusalaṃ kenaci naviññeyyaṃ dhammaṃ paṭicca naabyākato nakenaci naviññeyyo dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.)"
    ],
    "innerText": "23. Kusalaṃ kenaci naviññeyyaṃ dhammaṃ paṭicca nakusalo nakenaci naviññeyyo dhammo uppajjati hetupaccayā. Kusalaṃ kenaci naviññeyyaṃ dhammaṃ paṭicca naakusalo nakenaci naviññeyyo dhammo uppajjati hetupaccayā. Kusalaṃ kenaci naviññeyyaṃ dhammaṃ paṭicca naabyākato nakenaci naviññeyyo dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Etena upāyena kenaci naviññeyye ekūnavīsati pañhā kātabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-14-19. Kusalattika-āsavagocchakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ". Akusalaṃ ",
      " āsavaṃ dhammaṃ paṭicca naakusalo naāsavo dhammo…pe… nakusalo naāsavo dhammo…pe… naabyākato naāsavo dhammo…pe… nakusalo naāsavo ca naabyākato naāsavo ca dhammā…pe… nakusalo naāsavo ca naakusalo naāsavo ca dhammā uppajjanti hetupaccayā. Hetuyā pañca, ārammaṇe tīṇi…pe… avigate pañca."
    ],
    "innerText": "24. Akusalaṃ āsavaṃ dhammaṃ paṭicca naakusalo naāsavo dhammo…pe… nakusalo naāsavo dhammo…pe… naabyākato naāsavo dhammo…pe… nakusalo naāsavo ca naabyākato naāsavo ca dhammā…pe… nakusalo naāsavo ca naakusalo naāsavo ca dhammā uppajjanti hetupaccayā. Hetuyā pañca, ārammaṇe tīṇi…pe… avigate pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalaṃ noāsavaṃ dhammaṃ paṭicca nakusalo nanoāsavo dhammo uppajjati hetupaccayā. Akusalaṃ noāsavaṃ dhammaṃ paṭicca naabyākato nanoāsavo dhammo…pe… nakusalo nanoāsavo ca naabyākato nanoāsavo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi…pe… avigate tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". Abyākataṃ sāsavaṃ dhammaṃ paṭicca…pe… (lokiyadukasadisaṃ)."
    ],
    "innerText": "25. Abyākataṃ sāsavaṃ dhammaṃ paṭicca…pe… (lokiyadukasadisaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". Akusalaṃ ",
      " āsavasampayuttaṃ dhammaṃ paṭicca naakusalo naāsavasampayutto dhammo ",
      "…pe… nakusalo naāsavasampayutto dhammo…pe… naabyākato naāsavasampayutto dhammo…pe… nakusalo naāsavasampayutto ca naabyākato naāsavasampayutto ca dhammā…pe… nakusalo naāsavasampayutto ca naakusalo naāsavasampayutto ca dhammā uppajjanti hetupaccayā. Hetuyā pañca."
    ],
    "innerText": "26. Akusalaṃ āsavasampayuttaṃ dhammaṃ paṭicca naakusalo naāsavasampayutto dhammo …pe… nakusalo naāsavasampayutto dhammo…pe… naabyākato naāsavasampayutto dhammo…pe… nakusalo naāsavasampayutto ca naabyākato naāsavasampayutto ca dhammā…pe… nakusalo naāsavasampayutto ca naakusalo naāsavasampayutto ca dhammā uppajjanti hetupaccayā. Hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalaṃ āsavavippayuttaṃ dhammaṃ paṭicca nakusalo naāsavavippayutto dhammo…pe… naabyākato naāsavavippayutto dhammo…pe… nakusalo naāsavavippayutto ca naabyākato naāsavavippayutto ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      ". Akusalaṃ āsavañceva sāsavañca dhammaṃ paṭicca naakusalo naāsavo ceva naanāsavo ca dhammo…pe… nakusalo naāsavo ceva naanāsavo ca dhammo…pe… naabyākato naāsavo ceva naanāsavo ca dhammo…pe… nakusalo naāsavo ceva naanāsavo ca naabyākato naāsavo ceva naanāsavo ca dhammā…pe… nakusalo naāsavo ",
      " ceva naanāsavo ca naakusalo naāsavo ceva naanāsavo ca dhammā uppajjanti hetupaccayā. Hetuyā pañca."
    ],
    "innerText": "27. Akusalaṃ āsavañceva sāsavañca dhammaṃ paṭicca naakusalo naāsavo ceva naanāsavo ca dhammo…pe… nakusalo naāsavo ceva naanāsavo ca dhammo…pe… naabyākato naāsavo ceva naanāsavo ca dhammo…pe… nakusalo naāsavo ceva naanāsavo ca naabyākato naāsavo ceva naanāsavo ca dhammā…pe… nakusalo naāsavo ceva naanāsavo ca naakusalo naāsavo ceva naanāsavo ca dhammā uppajjanti hetupaccayā. Hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Akusalaṃ ",
      " sāsavañceva no ca āsavaṃ dhammaṃ paṭicca naakusalo naanāsavo ceva nano ca āsavo dhammo…pe… naabyākato naanāsavo ceva nano ca āsavo dhammo…pe… nakusalo naanāsavo ceva nano ca āsavo naabyākato naanāsavo ceva nano āsavo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "Akusalaṃ sāsavañceva no ca āsavaṃ dhammaṃ paṭicca naakusalo naanāsavo ceva nano ca āsavo dhammo…pe… naabyākato naanāsavo ceva nano ca āsavo dhammo…pe… nakusalo naanāsavo ceva nano ca āsavo naabyākato naanāsavo ceva nano āsavo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      ". Akusalaṃ āsavañceva āsavasampayuttañca dhammaṃ paṭicca nakusalo naāsavo ceva naāsavavippayutto ca dhammo…pe… naabyākato naāsavo ceva naāsavavippayutto ca dhammo…pe… nakusalo naāsavo ceva naāsavavippayutto ca naabyākato naāsavo ceva naāsavavippayutto ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "28. Akusalaṃ āsavañceva āsavasampayuttañca dhammaṃ paṭicca nakusalo naāsavo ceva naāsavavippayutto ca dhammo…pe… naabyākato naāsavo ceva naāsavavippayutto ca dhammo…pe… nakusalo naāsavo ceva naāsavavippayutto ca naabyākato naāsavo ceva naāsavavippayutto ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Akusalaṃ āsavasampayuttañceva no ca āsavaṃ dhammaṃ paṭicca nakusalo naāsavavippayutto ceva nano ca āsavo dhammo…pe… naabyākato naāsavavippayutto ceva nano ca āsavo dhammo ",
      "…pe… nakusalo naāsavavippayutto ceva nanoāsavo ca naabyākato naāsavavippayutto ceva nano ca āsavo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "Akusalaṃ āsavasampayuttañceva no ca āsavaṃ dhammaṃ paṭicca nakusalo naāsavavippayutto ceva nano ca āsavo dhammo…pe… naabyākato naāsavavippayutto ceva nano ca āsavo dhammo …pe… nakusalo naāsavavippayutto ceva nanoāsavo ca naabyākato naāsavavippayutto ceva nano ca āsavo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "29"
      },
      ". Abyākataṃ āsavavippayuttaṃ sāsavaṃ dhammaṃ paṭicca…pe… (lokiyadukasadisaṃ)."
    ],
    "innerText": "29. Abyākataṃ āsavavippayuttaṃ sāsavaṃ dhammaṃ paṭicca…pe… (lokiyadukasadisaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-20-54. Kusalattika-chagocchakadukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ". Akusalaṃ ",
      " saññojanaṃ dhammaṃ paṭicca…pe… ganthaṃ…pe… oghaṃ…pe… yogaṃ…pe… nīvaraṇaṃ…pe… parāmāsaṃ. (Saṃkhittaṃ.)"
    ],
    "innerText": "30. Akusalaṃ saññojanaṃ dhammaṃ paṭicca…pe… ganthaṃ…pe… oghaṃ…pe… yogaṃ…pe… nīvaraṇaṃ…pe… parāmāsaṃ. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-55. Kusalattika-sārammaṇadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ". Kusalaṃ sārammaṇaṃ dhammaṃ paṭicca nakusalo nasārammaṇo dhammo uppajjati hetupaccayā. Kusalaṃ sārammaṇaṃ dhammaṃ paṭicca naakusalo nasārammaṇo dhammo uppajjati hetupaccayā. Kusalaṃ sārammaṇaṃ dhammaṃ paṭicca ",
      " nakusalo nasārammaṇo ca naakusalo nasārammaṇo ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "31. Kusalaṃ sārammaṇaṃ dhammaṃ paṭicca nakusalo nasārammaṇo dhammo uppajjati hetupaccayā. Kusalaṃ sārammaṇaṃ dhammaṃ paṭicca naakusalo nasārammaṇo dhammo uppajjati hetupaccayā. Kusalaṃ sārammaṇaṃ dhammaṃ paṭicca nakusalo nasārammaṇo ca naakusalo nasārammaṇo ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalaṃ sārammaṇaṃ dhammaṃ paṭicca naakusalo nasārammaṇo dhammo uppajjati hetupaccayā. Akusalaṃ sārammaṇaṃ dhammaṃ paṭicca nakusalo nasārammaṇo dhammo uppajjati hetupaccayā. Akusalaṃ sārammaṇaṃ dhammaṃ paṭicca nakusalo nasārammaṇo ca naakusalo nasārammaṇo ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākataṃ sārammaṇaṃ dhammaṃ paṭicca nakusalo nasārammaṇo dhammo uppajjati hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "32"
      },
      ". Abyākataṃ anārammaṇaṃ dhammaṃ paṭicca nakusalo naanārammaṇo ",
      " dhammo uppajjati hetupaccayā. Abyākataṃ anārammaṇaṃ dhammaṃ paṭicca naakusalo naanārammaṇo dhammo uppajjati hetupaccayā ",
      ". Abyākataṃ anārammaṇaṃ dhammaṃ paṭicca nakusalo naanārammaṇo ca naakusalo naanārammaṇo ca dhammā uppajjanti hetupaccayā. (Saṃkhittaṃ.) Hetuyā tīṇi."
    ],
    "innerText": "32. Abyākataṃ anārammaṇaṃ dhammaṃ paṭicca nakusalo naanārammaṇo dhammo uppajjati hetupaccayā. Abyākataṃ anārammaṇaṃ dhammaṃ paṭicca naakusalo naanārammaṇo dhammo uppajjati hetupaccayā . Abyākataṃ anārammaṇaṃ dhammaṃ paṭicca nakusalo naanārammaṇo ca naakusalo naanārammaṇo ca dhammā uppajjanti hetupaccayā. (Saṃkhittaṃ.) Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-56. Kusalattika-cittadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "33"
      },
      ". Kusalaṃ cittaṃ dhammaṃ paṭicca nakusalo nacitto dhammo uppajjati hetupaccayā. Kusalaṃ cittaṃ dhammaṃ paṭicca naakusalo nacitto dhammo uppajjati hetupaccayā. Kusalaṃ cittaṃ dhammaṃ paṭicca naabyākato nacitto dhammo uppajjati hetupaccayā. Kusalaṃ cittaṃ dhammaṃ paṭicca naakusalo nacitto ca naabyākato nacitto ca dhammā uppajjanti hetupaccayā. Kusalaṃ cittaṃ dhammaṃ paṭicca nakusalo nacitto ca naakusalo nacitto ca dhammā uppajjanti hetupaccayā. Pañca."
    ],
    "innerText": "33. Kusalaṃ cittaṃ dhammaṃ paṭicca nakusalo nacitto dhammo uppajjati hetupaccayā. Kusalaṃ cittaṃ dhammaṃ paṭicca naakusalo nacitto dhammo uppajjati hetupaccayā. Kusalaṃ cittaṃ dhammaṃ paṭicca naabyākato nacitto dhammo uppajjati hetupaccayā. Kusalaṃ cittaṃ dhammaṃ paṭicca naakusalo nacitto ca naabyākato nacitto ca dhammā uppajjanti hetupaccayā. Kusalaṃ cittaṃ dhammaṃ paṭicca nakusalo nacitto ca naakusalo nacitto ca dhammā uppajjanti hetupaccayā. Pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Akusalaṃ cittaṃ dhammaṃ paṭicca naakusalo nacitto dhammo uppajjati hetupaccayā. Akusalaṃ cittaṃ dhammaṃ paṭicca nakusalo nacitto dhammo uppajjati hetupaccayā. Akusalaṃ cittaṃ dhammaṃ paṭicca naabyākato nacitto dhammo uppajjati hetupaccayā. Akusalaṃ cittaṃ dhammaṃ paṭicca nakusalo nacitto ca naabyākato nacitto ca dhammā uppajjanti hetupaccayā ",
      ". Akusalaṃ ",
      " cittaṃ dhammaṃ paṭicca nakusalo nacitto ca naakusalo nacitto ca dhammā uppajjanti hetupaccayā. Pañca."
    ],
    "innerText": "Akusalaṃ cittaṃ dhammaṃ paṭicca naakusalo nacitto dhammo uppajjati hetupaccayā. Akusalaṃ cittaṃ dhammaṃ paṭicca nakusalo nacitto dhammo uppajjati hetupaccayā. Akusalaṃ cittaṃ dhammaṃ paṭicca naabyākato nacitto dhammo uppajjati hetupaccayā. Akusalaṃ cittaṃ dhammaṃ paṭicca nakusalo nacitto ca naabyākato nacitto ca dhammā uppajjanti hetupaccayā . Akusalaṃ cittaṃ dhammaṃ paṭicca nakusalo nacitto ca naakusalo nacitto ca dhammā uppajjanti hetupaccayā. Pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākataṃ cittaṃ dhammaṃ paṭicca nakusalo nacitto dhammo uppajjati hetupaccayā. Abyākataṃ cittaṃ dhammaṃ paṭicca naakusalo nacitto dhammo uppajjati hetupaccayā. Abyākataṃ cittaṃ dhammaṃ paṭicca nakusalo nacitto ca naakusalo nacitto ca dhammā uppajjanti hetupaccayā. Tīṇi. Hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "34"
      },
      ". Kusalaṃ nocittaṃ dhammaṃ paṭicca naakusalo nanocitto dhammo uppajjati hetupaccayā. Kusalaṃ nocittaṃ dhammaṃ paṭicca naabyākato nanocitto dhammo uppajjati hetupaccayā. Kusalaṃ nocittaṃ dhammaṃ paṭicca naakusalo nanocitto ca naabyākato nanocitto ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "34. Kusalaṃ nocittaṃ dhammaṃ paṭicca naakusalo nanocitto dhammo uppajjati hetupaccayā. Kusalaṃ nocittaṃ dhammaṃ paṭicca naabyākato nanocitto dhammo uppajjati hetupaccayā. Kusalaṃ nocittaṃ dhammaṃ paṭicca naakusalo nanocitto ca naabyākato nanocitto ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Akusalaṃ ",
      " nocittaṃ dhammaṃ paṭicca nakusalo nanocitto dhammo uppajjati hetupaccayā. Akusalaṃ nocittaṃ dhammaṃ paṭicca naabyākato nanocitto dhammo uppajjati hetupaccayā. Akusalaṃ nocittaṃ dhammaṃ paṭicca nakusalo nanocitto ca naabyākato nanocitto ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "Akusalaṃ nocittaṃ dhammaṃ paṭicca nakusalo nanocitto dhammo uppajjati hetupaccayā. Akusalaṃ nocittaṃ dhammaṃ paṭicca naabyākato nanocitto dhammo uppajjati hetupaccayā. Akusalaṃ nocittaṃ dhammaṃ paṭicca nakusalo nanocitto ca naabyākato nanocitto ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākatāni tīṇi. Hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-57. Kusalattika-cetasikadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ". Kusalaṃ ",
      " cetasikaṃ dhammaṃ paṭicca nakusalo nacetasiko dhammo uppajjati hetupaccayā. Kusalaṃ cetasikaṃ dhammaṃ paṭicca naakusalo nacetasiko dhammo uppajjati hetupaccayā. Kusalaṃ cetasikaṃ dhammaṃ paṭicca naabyākato nacetasiko dhammo uppajjati hetupaccayā. Kusalaṃ cetasikaṃ dhammaṃ paṭicca naakusalo nacetasiko ca naabyākato nacetasiko ca dhammā uppajjanti hetupaccayā. Kusalaṃ cetasikaṃ dhammaṃ paṭicca nakusalo nacetasiko ca naakusalo nacetasiko ca dhammā uppajjanti hetupaccayā. Pañca."
    ],
    "innerText": "35. Kusalaṃ cetasikaṃ dhammaṃ paṭicca nakusalo nacetasiko dhammo uppajjati hetupaccayā. Kusalaṃ cetasikaṃ dhammaṃ paṭicca naakusalo nacetasiko dhammo uppajjati hetupaccayā. Kusalaṃ cetasikaṃ dhammaṃ paṭicca naabyākato nacetasiko dhammo uppajjati hetupaccayā. Kusalaṃ cetasikaṃ dhammaṃ paṭicca naakusalo nacetasiko ca naabyākato nacetasiko ca dhammā uppajjanti hetupaccayā. Kusalaṃ cetasikaṃ dhammaṃ paṭicca nakusalo nacetasiko ca naakusalo nacetasiko ca dhammā uppajjanti hetupaccayā. Pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Akusalaṃ cetasikaṃ dhammaṃ paṭicca naakusalo nacetasiko dhammo uppajjati hetupaccayā. Akusalaṃ cetasikaṃ dhammaṃ paṭicca nakusalo nacetasiko ",
      " dhammo uppajjati hetupaccayā. Akusalaṃ cetasikaṃ dhammaṃ paṭicca naabyākato nacetasiko dhammo uppajjati hetupaccayā. Akusalaṃ cetasikaṃ dhammaṃ paṭicca nakusalo nacetasiko ca naabyākato nacetasiko ca dhammā uppajjanti hetupaccayā. Akusalaṃ cetasikaṃ dhammaṃ paṭicca nakusalo nacetasiko ca naakusalo nacetasiko ca dhammā uppajjanti hetupaccayā. Pañca."
    ],
    "innerText": "Akusalaṃ cetasikaṃ dhammaṃ paṭicca naakusalo nacetasiko dhammo uppajjati hetupaccayā. Akusalaṃ cetasikaṃ dhammaṃ paṭicca nakusalo nacetasiko dhammo uppajjati hetupaccayā. Akusalaṃ cetasikaṃ dhammaṃ paṭicca naabyākato nacetasiko dhammo uppajjati hetupaccayā. Akusalaṃ cetasikaṃ dhammaṃ paṭicca nakusalo nacetasiko ca naabyākato nacetasiko ca dhammā uppajjanti hetupaccayā. Akusalaṃ cetasikaṃ dhammaṃ paṭicca nakusalo nacetasiko ca naakusalo nacetasiko ca dhammā uppajjanti hetupaccayā. Pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Abyākataṃ cetasikaṃ dhammaṃ paṭicca nakusalo nacetasiko dhammo uppajjati hetupaccayā. Abyākataṃ cetasikaṃ dhammaṃ paṭicca naakusalo nacetasiko dhammo uppajjati hetupaccayā. Abyākataṃ cetasikaṃ dhammaṃ paṭicca nakusalo ",
      " nacetasiko ca naakusalo nacetasiko ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "Abyākataṃ cetasikaṃ dhammaṃ paṭicca nakusalo nacetasiko dhammo uppajjati hetupaccayā. Abyākataṃ cetasikaṃ dhammaṃ paṭicca naakusalo nacetasiko dhammo uppajjati hetupaccayā. Abyākataṃ cetasikaṃ dhammaṃ paṭicca nakusalo nacetasiko ca naakusalo nacetasiko ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā terasa. Acetasikāni nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-58. Kusalattika-cittasampayuttadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ". Kusalaṃ ",
      " cittasampayuttaṃ dhammaṃ paṭicca nakusalo nacittasampayutto dhammo uppajjati hetupaccayā. Kusalaṃ cittasampayuttaṃ dhammaṃ paṭicca naakusalo nacittasampayutto dhammo uppajjati hetupaccayā. Kusalaṃ cittasampayuttaṃ dhammaṃ paṭicca naabyākato nacittasampayutto dhammo uppajjati hetupaccayā. Kusalaṃ cittasampayuttaṃ dhammaṃ paṭicca naakusalo nacittasampayutto ca naabyākato nacittasampayutto ca dhammā uppajjanti hetupaccayā. Kusalaṃ cittasampayuttaṃ dhammaṃ paṭicca nakusalo nacittasampayutto ca naakusalo nacittasampayutto ca dhammā uppajjanti hetupaccayā. Pañca."
    ],
    "innerText": "36. Kusalaṃ cittasampayuttaṃ dhammaṃ paṭicca nakusalo nacittasampayutto dhammo uppajjati hetupaccayā. Kusalaṃ cittasampayuttaṃ dhammaṃ paṭicca naakusalo nacittasampayutto dhammo uppajjati hetupaccayā. Kusalaṃ cittasampayuttaṃ dhammaṃ paṭicca naabyākato nacittasampayutto dhammo uppajjati hetupaccayā. Kusalaṃ cittasampayuttaṃ dhammaṃ paṭicca naakusalo nacittasampayutto ca naabyākato nacittasampayutto ca dhammā uppajjanti hetupaccayā. Kusalaṃ cittasampayuttaṃ dhammaṃ paṭicca nakusalo nacittasampayutto ca naakusalo nacittasampayutto ca dhammā uppajjanti hetupaccayā. Pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalaṃ cittasampayuttaṃ dhammaṃ paṭicca naakusalo nacittasampayutto dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Abyākataṃ cittasampayuttaṃ dhammaṃ paṭicca nakusalo nacittasampayutto dhammo uppajjati hetupaccayā. Abyākataṃ cittasampayuttaṃ dhammaṃ paṭicca naakusalo nacittasampayutto dhammo uppajjati hetupaccayā. Abyākataṃ cittasampayuttaṃ dhammaṃ paṭicca nakusalo nacittasampayutto ca naakusalo nacittasampayutto ",
      " ca dhammā uppajjanti hetupaccayā. Tīṇi. (Saṃkhittaṃ.) Hetuyā terasa. Cittavippayutte tīṇi."
    ],
    "innerText": "Abyākataṃ cittasampayuttaṃ dhammaṃ paṭicca nakusalo nacittasampayutto dhammo uppajjati hetupaccayā. Abyākataṃ cittasampayuttaṃ dhammaṃ paṭicca naakusalo nacittasampayutto dhammo uppajjati hetupaccayā. Abyākataṃ cittasampayuttaṃ dhammaṃ paṭicca nakusalo nacittasampayutto ca naakusalo nacittasampayutto ca dhammā uppajjanti hetupaccayā. Tīṇi. (Saṃkhittaṃ.) Hetuyā terasa. Cittavippayutte tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-59. Kusalattika-cittasaṃsaṭṭhadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ". Kusalaṃ ",
      " cittasaṃsaṭṭhaṃ dhammaṃ paṭicca nakusalo nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā. Kusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca naakusalo nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā. Kusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca naabyākato nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā. Kusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca naakusalo nacittasaṃsaṭṭho ca naabyākato nacittasaṃsaṭṭho ca dhammā uppajjanti hetupaccayā. Kusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca nakusalo nacittasaṃsaṭṭho ca naakusalo nacittasaṃsaṭṭho ca dhammā uppajjanti hetupaccayā. Pañca."
    ],
    "innerText": "37. Kusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca nakusalo nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā. Kusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca naakusalo nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā. Kusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca naabyākato nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā. Kusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca naakusalo nacittasaṃsaṭṭho ca naabyākato nacittasaṃsaṭṭho ca dhammā uppajjanti hetupaccayā. Kusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca nakusalo nacittasaṃsaṭṭho ca naakusalo nacittasaṃsaṭṭho ca dhammā uppajjanti hetupaccayā. Pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Akusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca naakusalo nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā ",
      ". Akusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca nakusalo nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā. Akusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca naabyākato nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā. Akusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca nakusalo nacittasaṃsaṭṭho ca naabyākato nacittasaṃsaṭṭho ca dhammā uppajjanti hetupaccayā. Akusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca nakusalo nacittasaṃsaṭṭho ca naakusalo nacittasaṃsaṭṭho ca dhammā uppajjanti hetupaccayā ",
      ". Pañca."
    ],
    "innerText": "Akusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca naakusalo nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā . Akusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca nakusalo nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā. Akusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca naabyākato nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā. Akusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca nakusalo nacittasaṃsaṭṭho ca naabyākato nacittasaṃsaṭṭho ca dhammā uppajjanti hetupaccayā. Akusalaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca nakusalo nacittasaṃsaṭṭho ca naakusalo nacittasaṃsaṭṭho ca dhammā uppajjanti hetupaccayā . Pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākataṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca nakusalo nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā. Abyākataṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca naakusalo nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā. Abyākataṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca nakusalo nacittasaṃsaṭṭho ca naakusalo nacittasaṃsaṭṭho ca dhammā uppajjanti hetupaccayā. Tīṇi. (Saṃkhittaṃ.) Hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-60. Kusalattika-cittasamuṭṭhānadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "38"
      },
      ". Kusalaṃ cittasamuṭṭhānaṃ dhammaṃ paṭicca naakusalo nacittasamuṭṭhāno dhammo uppajjati hetupaccayā. Kusalaṃ cittasamuṭṭhānaṃ dhammaṃ paṭicca naabyākato nacittasamuṭṭhāno dhammo uppajjati hetupaccayā. Kusalaṃ cittasamuṭṭhānaṃ dhammaṃ paṭicca naakusalo nacittasamuṭṭhāno ca naabyākato nacittasamuṭṭhāno ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "38. Kusalaṃ cittasamuṭṭhānaṃ dhammaṃ paṭicca naakusalo nacittasamuṭṭhāno dhammo uppajjati hetupaccayā. Kusalaṃ cittasamuṭṭhānaṃ dhammaṃ paṭicca naabyākato nacittasamuṭṭhāno dhammo uppajjati hetupaccayā. Kusalaṃ cittasamuṭṭhānaṃ dhammaṃ paṭicca naakusalo nacittasamuṭṭhāno ca naabyākato nacittasamuṭṭhāno ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Akusalaṃ ",
      " cittasamuṭṭhānaṃ dhammaṃ paṭicca naakusalo nacittasamuṭṭhāno dhammo uppajjati hetupaccayā. Akusalaṃ cittasamuṭṭhānaṃ dhammaṃ paṭicca naabyākato nacittasamuṭṭhāno dhammo uppajjati hetupaccayā. Akusalaṃ cittasamuṭṭhānaṃ dhammaṃ paṭicca nakusalo nacittasamuṭṭhāno ca naabyākato nacittasamuṭṭhāno ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "Akusalaṃ cittasamuṭṭhānaṃ dhammaṃ paṭicca naakusalo nacittasamuṭṭhāno dhammo uppajjati hetupaccayā. Akusalaṃ cittasamuṭṭhānaṃ dhammaṃ paṭicca naabyākato nacittasamuṭṭhāno dhammo uppajjati hetupaccayā. Akusalaṃ cittasamuṭṭhānaṃ dhammaṃ paṭicca nakusalo nacittasamuṭṭhāno ca naabyākato nacittasamuṭṭhāno ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Abyākataṃ cittasamuṭṭhānaṃ dhammaṃ ",
      " paṭicca nakusalo nacittasamuṭṭhāno dhammo uppajjati hetupaccayā… tīṇi. Hetuyā nava…pe… avigate nava."
    ],
    "innerText": "Abyākataṃ cittasamuṭṭhānaṃ dhammaṃ paṭicca nakusalo nacittasamuṭṭhāno dhammo uppajjati hetupaccayā… tīṇi. Hetuyā nava…pe… avigate nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "39"
      },
      ". Kusalaṃ nocittasamuṭṭhānaṃ dhammaṃ paṭicca nakusalo nanocittasamuṭṭhāno dhammo uppajjati hetupaccayā… pañca."
    ],
    "innerText": "39. Kusalaṃ nocittasamuṭṭhānaṃ dhammaṃ paṭicca nakusalo nanocittasamuṭṭhāno dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Akusalaṃ ",
      " nocittasamuṭṭhānaṃ dhammaṃ paṭicca naakusalo nanocittasamuṭṭhāno dhammo uppajjati hetupaccayā… pañca."
    ],
    "innerText": "Akusalaṃ nocittasamuṭṭhānaṃ dhammaṃ paṭicca naakusalo nanocittasamuṭṭhāno dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākataṃ nocittasamuṭṭhānaṃ dhammaṃ paṭicca nakusalo nanocittasamuṭṭhāno dhammo uppajjati hetupaccayā… tīṇi. Hetuyā terasa…pe… avigate terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-61. Kusalattika-cittasahabhūdukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ". Kusalaṃ cittasahabhuṃ dhammaṃ paṭicca nakusalo nacittasahabhū dhammo uppajjati hetupaccayā… pañca."
    ],
    "innerText": "40. Kusalaṃ cittasahabhuṃ dhammaṃ paṭicca nakusalo nacittasahabhū dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalaṃ cittasahabhuṃ dhammaṃ paṭicca naakusalo nacittasahabhū dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākataṃ cittasahabhuṃ dhammaṃ paṭicca nakusalo nacittasahabhū dhammo uppajjati hetupaccayā… tīṇi. Hetuyā terasa…pe… avigate terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ". Kusalaṃ nocittasahabhuṃ dhammaṃ paṭicca nakusalo nanocittasahabhū dhammo uppajjati hetupaccayā… pañca."
    ],
    "innerText": "41. Kusalaṃ nocittasahabhuṃ dhammaṃ paṭicca nakusalo nanocittasahabhū dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Akusalaṃ nocittasahabhuṃ ",
      " dhammaṃ paṭicca naakusalo nanocittasahabhū dhammo uppajjati hetupaccayā… pañca."
    ],
    "innerText": "Akusalaṃ nocittasahabhuṃ dhammaṃ paṭicca naakusalo nanocittasahabhū dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Abyākataṃ ",
      " nocittasahabhuṃ dhammaṃ paṭicca nakusalo nanocittasahabhū dhammo uppajjati hetupaccayā… tīṇi. (Saṃkhittaṃ.) Hetuyā terasa…pe… avigate terasa."
    ],
    "innerText": "Abyākataṃ nocittasahabhuṃ dhammaṃ paṭicca nakusalo nanocittasahabhū dhammo uppajjati hetupaccayā… tīṇi. (Saṃkhittaṃ.) Hetuyā terasa…pe… avigate terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-62-65. Kusalattika-cittānuparivattādidukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42"
      },
      ". Kusalaṃ cittānuparivattiṃ dhammaṃ paṭicca… (saṃkhittaṃ.) Hetuyā terasa."
    ],
    "innerText": "42. Kusalaṃ cittānuparivattiṃ dhammaṃ paṭicca… (saṃkhittaṃ.) Hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kusalaṃ nocittānuparivattiṃ dhammaṃ paṭicca… (saṃkhittaṃ.) Hetuyā terasa. (Ete saṃkhittā, dukattayaṃ cittadukasadisaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-66-68. Kusalattika-ajjhattikādidukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "43"
      },
      ". Kusalaṃ ",
      " ajjhattikaṃ dhammaṃ paṭicca… (saṃkhittaṃ, cittadukasadisaṃ)."
    ],
    "innerText": "43. Kusalaṃ ajjhattikaṃ dhammaṃ paṭicca… (saṃkhittaṃ, cittadukasadisaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kusalaṃ bāhiraṃ dhammaṃ paṭicca naakusalo nabāhiro dhammo uppajjati hetupaccayā… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44"
      },
      ". Abyākataṃ upādā dhammaṃ paṭicca nakusalo naupādā dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "44. Abyākataṃ upādā dhammaṃ paṭicca nakusalo naupādā dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kusalaṃ noupādā dhammaṃ paṭicca nakusalo nanoupādā dhammo uppajjati hetupaccayā… tīṇi… nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "45"
      },
      ". Abyākataṃ ",
      " upādinnaṃ dhammaṃ paṭicca nakusalo naupādinno dhammo uppajjati hetupaccayā. Abyākataṃ upādinnaṃ dhammaṃ paṭicca naakusalo naupādinno dhammo uppajjati hetupaccayā. Abyākataṃ upādinnaṃ dhammaṃ paṭicca nakusalo naupādinno ca naakusalo naupādinno ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "45. Abyākataṃ upādinnaṃ dhammaṃ paṭicca nakusalo naupādinno dhammo uppajjati hetupaccayā. Abyākataṃ upādinnaṃ dhammaṃ paṭicca naakusalo naupādinno dhammo uppajjati hetupaccayā. Abyākataṃ upādinnaṃ dhammaṃ paṭicca nakusalo naupādinno ca naakusalo naupādinno ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-69-82. Kusalattika-upādānādidukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "46"
      },
      ". Akusalaṃ upādānaṃ dhammaṃ paṭicca naakusalo noupādāno dhammo uppajjati hetupaccayā."
    ],
    "innerText": "46. Akusalaṃ upādānaṃ dhammaṃ paṭicca naakusalo noupādāno dhammo uppajjati hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalaṃ kilesaṃ dhammaṃ paṭicca naakusalo nokileso dhammo uppajjati hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-83. Kusalattika-piṭṭhidukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "47"
      },
      ". Akusalaṃ ",
      " dassanena pahātabbaṃ dhammaṃ paṭicca naakusalo nadassanena pahātabbo dhammo uppajjati hetupaccayā. Akusalaṃ dassanena pahātabbaṃ dhammaṃ paṭicca nakusalo nadassanena pahātabbo dhammo uppajjati hetupaccayā. Akusalaṃ dassanena pahātabbaṃ dhammaṃ paṭicca nakusalo nadassanena pahātabbo ca naakusalo nadassanena pahātabbo ca dhammā uppajjanti hetupaccayā. Hetuyā ",
      " tīṇi."
    ],
    "innerText": "47. Akusalaṃ dassanena pahātabbaṃ dhammaṃ paṭicca naakusalo nadassanena pahātabbo dhammo uppajjati hetupaccayā. Akusalaṃ dassanena pahātabbaṃ dhammaṃ paṭicca nakusalo nadassanena pahātabbo dhammo uppajjati hetupaccayā. Akusalaṃ dassanena pahātabbaṃ dhammaṃ paṭicca nakusalo nadassanena pahātabbo ca naakusalo nadassanena pahātabbo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Abyākataṃ ",
      " nadassanena pahātabbaṃ dhammaṃ paccayā naabyākato nanadassanena pahātabbo dhammo uppajjati hetupaccayā. Abyākataṃ nadassanena pahātabbaṃ dhammaṃ paccayā nakusalo nanadassanena pahātabbo dhammo uppajjati hetupaccayā. Abyākataṃ nadassanena pahātabbaṃ dhammaṃ paccayā nakusalo nanadassanena pahātabbo ca naabyākato nanadassanena pahātabbo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "Abyākataṃ nadassanena pahātabbaṃ dhammaṃ paccayā naabyākato nanadassanena pahātabbo dhammo uppajjati hetupaccayā. Abyākataṃ nadassanena pahātabbaṃ dhammaṃ paccayā nakusalo nanadassanena pahātabbo dhammo uppajjati hetupaccayā. Abyākataṃ nadassanena pahātabbaṃ dhammaṃ paccayā nakusalo nanadassanena pahātabbo ca naabyākato nanadassanena pahātabbo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "48"
      },
      ". Akusalaṃ bhāvanāya pahātabbaṃ dhammaṃ paṭicca naakusalo nabhāvanāya pahātabbo dhammo uppajjati hetupaccayā. Akusalaṃ bhāvanāya pahātabbaṃ dhammaṃ paṭicca nakusalo nabhāvanāya pahātabbo dhammo uppajjati hetupaccayā. Akusalaṃ bhāvanāya pahātabbaṃ dhammaṃ paṭicca nakusalo nabhāvanāya pahātabbo ca naakusalo nabhāvanāya pahātabbo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "48. Akusalaṃ bhāvanāya pahātabbaṃ dhammaṃ paṭicca naakusalo nabhāvanāya pahātabbo dhammo uppajjati hetupaccayā. Akusalaṃ bhāvanāya pahātabbaṃ dhammaṃ paṭicca nakusalo nabhāvanāya pahātabbo dhammo uppajjati hetupaccayā. Akusalaṃ bhāvanāya pahātabbaṃ dhammaṃ paṭicca nakusalo nabhāvanāya pahātabbo ca naakusalo nabhāvanāya pahātabbo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākataṃ nabhāvanāya pahātabbaṃ dhammaṃ paccayā naabyākato nanabhāvanāya pahātabbo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "49"
      },
      ". Akusalaṃ ",
      " dassanena pahātabbahetukaṃ dhammaṃ paṭicca naakusalo nadassanena pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "49. Akusalaṃ dassanena pahātabbahetukaṃ dhammaṃ paṭicca naakusalo nadassanena pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalaṃ nadassanena pahātabbahetukaṃ dhammaṃ paṭicca nakusalo nanadassanena pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Abyākataṃ ",
      " nadassanena pahātabbahetukaṃ dhammaṃ paccayā naabyākato nanadassanena pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "Abyākataṃ nadassanena pahātabbahetukaṃ dhammaṃ paccayā naabyākato nanadassanena pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50"
      },
      ". Akusalaṃ bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca naakusalo nabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "50. Akusalaṃ bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca naakusalo nabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Akusalaṃ ",
      " nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nakusalo nanabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "Akusalaṃ nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nakusalo nanabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "51"
      },
      ". Kusalaṃ ",
      " savitakkaṃ dhammaṃ paṭicca nakusalo nasavitakko dhammo uppajjati hetupaccayā… hetuyā terasa."
    ],
    "innerText": "51. Kusalaṃ savitakkaṃ dhammaṃ paṭicca nakusalo nasavitakko dhammo uppajjati hetupaccayā… hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kusalaṃ avitakkaṃ dhammaṃ paṭicca naakusalo naavitakko dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "52"
      },
      ". Kusalaṃ savicāraṃ dhammaṃ paṭicca nakusalo nasavicāro dhammo uppajjati hetupaccayā… hetuyā terasa."
    ],
    "innerText": "52. Kusalaṃ savicāraṃ dhammaṃ paṭicca nakusalo nasavicāro dhammo uppajjati hetupaccayā… hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kusalaṃ avicāraṃ dhammaṃ paṭicca naakusalo naavicāro dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "53"
      },
      ". Kusalaṃ sappītikaṃ dhammaṃ paṭicca nakusalo nasappītiko dhammo uppajjati hetupaccayā… hetuyā ",
      " terasa."
    ],
    "innerText": "53. Kusalaṃ sappītikaṃ dhammaṃ paṭicca nakusalo nasappītiko dhammo uppajjati hetupaccayā… hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kusalaṃ appītikaṃ dhammaṃ paṭicca naakusalo naappītiko dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "54"
      },
      ". Kusalaṃ pītisahagataṃ dhammaṃ paṭicca nakusalo napītisahagato dhammo uppajjati hetupaccayā… hetuyā terasa."
    ],
    "innerText": "54. Kusalaṃ pītisahagataṃ dhammaṃ paṭicca nakusalo napītisahagato dhammo uppajjati hetupaccayā… hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kusalaṃ napītisahagataṃ dhammaṃ paṭicca naakusalo nanapītisahagato dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "55"
      },
      ". Kusalaṃ sukhasahagataṃ dhammaṃ paṭicca nakusalo nasukhasahagato dhammo uppajjati hetupaccayā… hetuyā terasa."
    ],
    "innerText": "55. Kusalaṃ sukhasahagataṃ dhammaṃ paṭicca nakusalo nasukhasahagato dhammo uppajjati hetupaccayā… hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kusalaṃ ",
      " nasukhasahagataṃ dhammaṃ paṭicca naakusalo nanasukhasahagato dhammo uppajjati hetupaccayā… hetuyā nava."
    ],
    "innerText": "Kusalaṃ nasukhasahagataṃ dhammaṃ paṭicca naakusalo nanasukhasahagato dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "56"
      },
      ". Kusalaṃ ",
      " upekkhāsahagataṃ dhammaṃ paṭicca nakusalo naupekkhāsahagato dhammo uppajjati hetupaccayā… hetuyā terasa."
    ],
    "innerText": "56. Kusalaṃ upekkhāsahagataṃ dhammaṃ paṭicca nakusalo naupekkhāsahagato dhammo uppajjati hetupaccayā… hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kusalaṃ naupekkhāsahagataṃ dhammaṃ paṭicca nakusalo nanaupekkhāsahagato dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "57"
      },
      ". Abyākataṃ kāmāvacaraṃ dhammaṃ paṭicca nakusalo nakāmāvacaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "57. Abyākataṃ kāmāvacaraṃ dhammaṃ paṭicca nakusalo nakāmāvacaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kusalaṃ nakāmāvacaraṃ dhammaṃ paṭicca nakusalo nanakāmāvacaro dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "58"
      },
      ". Kusalaṃ rūpāvacaraṃ dhammaṃ paṭicca nakusalo narūpāvacaro dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "58. Kusalaṃ rūpāvacaraṃ dhammaṃ paṭicca nakusalo narūpāvacaro dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākataṃ narūpāvacaraṃ dhammaṃ paṭicca nakusalo nanarūpāvacaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "59"
      },
      ". Kusalaṃ ",
      " arūpāvacaraṃ dhammaṃ paṭicca nakusalo naarūpāvacaro dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "59. Kusalaṃ arūpāvacaraṃ dhammaṃ paṭicca nakusalo naarūpāvacaro dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākataṃ naarūpāvacaraṃ dhammaṃ paccayā naabyākato nanaarūpāvacaro dhammo uppajjati hetupaccayā… hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "60"
      },
      ". Abyākataṃ pariyāpannaṃ dhammaṃ paccayā naabyākato napariyāpanno dhammo uppajjati hetupaccayā… hetuyā pañca."
    ],
    "innerText": "60. Abyākataṃ pariyāpannaṃ dhammaṃ paccayā naabyākato napariyāpanno dhammo uppajjati hetupaccayā… hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kusalaṃ ",
      " apariyāpannaṃ dhammaṃ paṭicca nakusalo naapariyāpanno dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "Kusalaṃ apariyāpannaṃ dhammaṃ paṭicca nakusalo naapariyāpanno dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "61"
      },
      ". Kusalaṃ niyyānikaṃ dhammaṃ paṭicca nakusalo naniyyāniko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "61. Kusalaṃ niyyānikaṃ dhammaṃ paṭicca nakusalo naniyyāniko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākataṃ aniyyānikaṃ dhammaṃ paccayā naabyākato naaniyyāniko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "62"
      },
      ". Kusalaṃ ",
      " niyataṃ dhammaṃ paṭicca nakusalo naniyato dhammo uppajjati ",
      " hetupaccayā… hetuyā cha."
    ],
    "innerText": "62. Kusalaṃ niyataṃ dhammaṃ paṭicca nakusalo naniyato dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyākataṃ aniyataṃ dhammaṃ paccayā naabyākato naaniyato dhammo uppajjati hetupaccayā… hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "63"
      },
      ". Abyākataṃ sauttaraṃ dhammaṃ paccayā naabyākato nasauttaro dhammo uppajjati hetupaccayā… hetuyā pañca."
    ],
    "innerText": "63. Abyākataṃ sauttaraṃ dhammaṃ paccayā naabyākato nasauttaro dhammo uppajjati hetupaccayā… hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kusalaṃ anuttaraṃ dhammaṃ paṭicca nakusalo naanuttaro dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "64"
      },
      ". Akusalaṃ saraṇaṃ dhammaṃ paṭicca naakusalo nasaraṇo dhammo uppajjati hetupaccayā. Akusalaṃ saraṇaṃ dhammaṃ paṭicca nakusalo nasaraṇo dhammo uppajjati hetupaccayā. Akusalaṃ saraṇaṃ dhammaṃ paṭicca nakusalo nasaraṇo ca naakusalo nasaraṇo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "64. Akusalaṃ saraṇaṃ dhammaṃ paṭicca naakusalo nasaraṇo dhammo uppajjati hetupaccayā. Akusalaṃ saraṇaṃ dhammaṃ paṭicca nakusalo nasaraṇo dhammo uppajjati hetupaccayā. Akusalaṃ saraṇaṃ dhammaṃ paṭicca nakusalo nasaraṇo ca naakusalo nasaraṇo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Abyākataṃ araṇaṃ dhammaṃ paccayā naabyākato naaraṇo dhammo uppajjati hetupaccayā. Abyākataṃ araṇaṃ dhammaṃ paccayā nakusalo naaraṇo dhammo uppajjati hetupaccayā. Abyākataṃ araṇaṃ ",
      " dhammaṃ paccayā nakusalo naaraṇo ca naabyākato naaraṇo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "Abyākataṃ araṇaṃ dhammaṃ paccayā naabyākato naaraṇo dhammo uppajjati hetupaccayā. Abyākataṃ araṇaṃ dhammaṃ paccayā nakusalo naaraṇo dhammo uppajjati hetupaccayā. Abyākataṃ araṇaṃ dhammaṃ paccayā nakusalo naaraṇo ca naabyākato naaraṇo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2-1. Vedanāttika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "65"
      },
      ". Sukhāya ",
      " vedanāya sampayuttaṃ hetuṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto nahetu dhammo uppajjati hetupaccayā. Sukhāya vedanāya sampayuttaṃ hetuṃ dhammaṃ paṭicca nadukkhāya vedanāya sampayutto nahetu dhammo uppajjati hetupaccayā. Sukhāya vedanāya sampayuttaṃ hetuṃ dhammaṃ paṭicca naadukkhamasukhāya vedanāya sampayutto nahetu dhammo uppajjati hetupaccayā…pe… satta pañhā."
    ],
    "innerText": "65. Sukhāya vedanāya sampayuttaṃ hetuṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto nahetu dhammo uppajjati hetupaccayā. Sukhāya vedanāya sampayuttaṃ hetuṃ dhammaṃ paṭicca nadukkhāya vedanāya sampayutto nahetu dhammo uppajjati hetupaccayā. Sukhāya vedanāya sampayuttaṃ hetuṃ dhammaṃ paṭicca naadukkhamasukhāya vedanāya sampayutto nahetu dhammo uppajjati hetupaccayā…pe… satta pañhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dukkhāya vedanāya sampayuttaṃ hetuṃ dhammaṃ paṭicca nadukkhāya vedanāya sampayutto nahetu dhammo uppajjati hetupaccayā… satta pañhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Adukkhamasukhāya ",
      " vedanāya sampayuttaṃ hetuṃ dhammaṃ paṭicca naadukkhamasukhāya vedanāya sampayutto nahetu dhammo uppajjati hetupaccayā… satta pañhā. Hetuyā ekavīsa…pe… avigate ekavīsa. (Sabbattha ekavīsa.)"
    ],
    "innerText": "Adukkhamasukhāya vedanāya sampayuttaṃ hetuṃ dhammaṃ paṭicca naadukkhamasukhāya vedanāya sampayutto nahetu dhammo uppajjati hetupaccayā… satta pañhā. Hetuyā ekavīsa…pe… avigate ekavīsa. (Sabbattha ekavīsa.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "66"
      },
      ". Sukhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca nadukkhāya vedanāya sampayutto nanahetu dhammo uppajjati hetupaccayā. Sukhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca naadukkhamasukhāya vedanāya sampayutto nanahetu dhammo uppajjati hetupaccayā. Sukhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca nadukkhāya vedanāya sampayutto nanahetu ca naadukkhamasukhāya vedanāya sampayutto nanahetu ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "66. Sukhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca nadukkhāya vedanāya sampayutto nanahetu dhammo uppajjati hetupaccayā. Sukhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca naadukkhamasukhāya vedanāya sampayutto nanahetu dhammo uppajjati hetupaccayā. Sukhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca nadukkhāya vedanāya sampayutto nanahetu ca naadukkhamasukhāya vedanāya sampayutto nanahetu ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dukkhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto nanahetu dhammo ",
      " uppajjati hetupaccayā… tīṇi."
    ],
    "innerText": "Dukkhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto nanahetu dhammo uppajjati hetupaccayā… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Adukkhamasukhāya vedanāya sampayuttaṃ nahetuṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto nanahetu dhammo uppajjati hetupaccayā… tīṇi… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3-1. Vipākattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "67"
      },
      ". Vipākaṃ ",
      " hetuṃ dhammaṃ paṭicca navipāko nahetu dhammo uppajjati hetupaccayā. Vipākaṃ hetuṃ dhammaṃ paṭicca navipākadhammadhammo nahetu dhammo uppajjati hetupaccayā. Vipākaṃ hetuṃ dhammaṃ paṭicca nanevavipākanavipākadhammadhammo nahetu dhammo uppajjati hetupaccayā. Vipākaṃ hetuṃ dhammaṃ paṭicca navipākadhammadhammo nahetu ca nanevavipākanavipākadhammadhammo nahetu ca dhammā uppajjanti hetupaccayā. Vipākaṃ hetuṃ dhammaṃ paṭicca navipāko nahetu ca navipākadhammadhammo nahetu ca dhammā uppajjanti hetupaccayā. Pañca."
    ],
    "innerText": "67. Vipākaṃ hetuṃ dhammaṃ paṭicca navipāko nahetu dhammo uppajjati hetupaccayā. Vipākaṃ hetuṃ dhammaṃ paṭicca navipākadhammadhammo nahetu dhammo uppajjati hetupaccayā. Vipākaṃ hetuṃ dhammaṃ paṭicca nanevavipākanavipākadhammadhammo nahetu dhammo uppajjati hetupaccayā. Vipākaṃ hetuṃ dhammaṃ paṭicca navipākadhammadhammo nahetu ca nanevavipākanavipākadhammadhammo nahetu ca dhammā uppajjanti hetupaccayā. Vipākaṃ hetuṃ dhammaṃ paṭicca navipāko nahetu ca navipākadhammadhammo nahetu ca dhammā uppajjanti hetupaccayā. Pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vipākadhammadhammaṃ hetuṃ dhammaṃ paṭicca navipākadhammadhammo nahetu dhammo uppajjati hetupaccayā. Vipākadhammadhammaṃ hetuṃ dhammaṃ paṭicca navipāko nahetu dhammo uppajjati hetupaccayā. Vipākadhammadhammaṃ hetuṃ dhammaṃ paṭicca nanevavipākanavipākadhammadhammo nahetu dhammo uppajjati hetupaccayā. Vipākadhammadhammaṃ hetuṃ dhammaṃ paṭicca navipāko ",
      " nahetu ca nanevavipākanavipākadhammadhammo nahetu ca dhammā uppajjanti hetupaccayā. Vipākadhammadhammaṃ hetuṃ ",
      " dhammaṃ paṭicca navipāko nahetu ca navipākadhammadhammo nahetu ca dhammā uppajjanti hetupaccayā. Pañca."
    ],
    "innerText": "Vipākadhammadhammaṃ hetuṃ dhammaṃ paṭicca navipākadhammadhammo nahetu dhammo uppajjati hetupaccayā. Vipākadhammadhammaṃ hetuṃ dhammaṃ paṭicca navipāko nahetu dhammo uppajjati hetupaccayā. Vipākadhammadhammaṃ hetuṃ dhammaṃ paṭicca nanevavipākanavipākadhammadhammo nahetu dhammo uppajjati hetupaccayā. Vipākadhammadhammaṃ hetuṃ dhammaṃ paṭicca navipāko nahetu ca nanevavipākanavipākadhammadhammo nahetu ca dhammā uppajjanti hetupaccayā. Vipākadhammadhammaṃ hetuṃ dhammaṃ paṭicca navipāko nahetu ca navipākadhammadhammo nahetu ca dhammā uppajjanti hetupaccayā. Pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevavipākanavipākadhammadhammaṃ hetuṃ dhammaṃ paṭicca navipāko nahetu dhammo uppajjati hetupaccayā. Nevavipākanavipākadhammadhammaṃ hetuṃ dhammaṃ paṭicca navipākadhammadhammo nahetu dhammo uppajjati hetupaccayā. Nevavipākanavipākadhammadhammaṃ hetuṃ dhammaṃ paṭicca navipāko nahetu ca navipākadhammadhammo nahetu ca dhammā uppajjanti hetupaccayā. Tīṇi… hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "68"
      },
      ". Vipākaṃ nahetuṃ dhammaṃ paṭicca navipākadhammadhammo nanahetu dhammo uppajjati hetupaccayā. Vipākaṃ nahetuṃ dhammaṃ paṭicca nanevavipākanavipākadhammadhammo nanahetu dhammo uppajjati hetupaccayā. Vipākaṃ nahetuṃ dhammaṃ paṭicca navipākadhammadhammo nanahetu ca nanevavipākanavipākadhammadhammo nanahetu ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "68. Vipākaṃ nahetuṃ dhammaṃ paṭicca navipākadhammadhammo nanahetu dhammo uppajjati hetupaccayā. Vipākaṃ nahetuṃ dhammaṃ paṭicca nanevavipākanavipākadhammadhammo nanahetu dhammo uppajjati hetupaccayā. Vipākaṃ nahetuṃ dhammaṃ paṭicca navipākadhammadhammo nanahetu ca nanevavipākanavipākadhammadhammo nanahetu ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vipākadhammadhammaṃ nahetuṃ dhammaṃ paṭicca navipāko nanahetu dhammo uppajjati hetupaccayā. Vipākadhammadhammaṃ nahetuṃ dhammaṃ paṭicca nanevavipākanavipākadhammadhammo nanahetu dhammo uppajjati hetupaccayā ",
      ". Vipākadhammadhammaṃ nahetuṃ dhammaṃ paṭicca navipāko nanahetu ca nanevavipākanavipākadhammadhammo nanahetu ca dhammā uppajjanti hetupaccayā. Tīṇi."
    ],
    "innerText": "Vipākadhammadhammaṃ nahetuṃ dhammaṃ paṭicca navipāko nanahetu dhammo uppajjati hetupaccayā. Vipākadhammadhammaṃ nahetuṃ dhammaṃ paṭicca nanevavipākanavipākadhammadhammo nanahetu dhammo uppajjati hetupaccayā . Vipākadhammadhammaṃ nahetuṃ dhammaṃ paṭicca navipāko nanahetu ca nanevavipākanavipākadhammadhammo nanahetu ca dhammā uppajjanti hetupaccayā. Tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevavipākanavipākadhammadhammaṃ ",
      " nahetuṃ dhammaṃ paṭicca nanevavipākanavipākadhammadhammo nanahetu dhammo uppajjati hetupaccayā. Nevavipākanavipākadhammadhammaṃ nahetuṃ dhammaṃ paṭicca navipāko nanahetu dhammo uppajjati hetupaccayā…pe…. Nevavipākanavipākadhammadhammaṃ nahetuñca dhammaṃ paṭicca navipāko nanahetu ca navipākadhammadhammo nanahetu ca dhammā uppajjanti hetupaccayā… pañca."
    ],
    "innerText": "Nevavipākanavipākadhammadhammaṃ nahetuṃ dhammaṃ paṭicca nanevavipākanavipākadhammadhammo nanahetu dhammo uppajjati hetupaccayā. Nevavipākanavipākadhammadhammaṃ nahetuṃ dhammaṃ paṭicca navipāko nanahetu dhammo uppajjati hetupaccayā…pe…. Nevavipākanavipākadhammadhammaṃ nahetuñca dhammaṃ paṭicca navipāko nanahetu ca navipākadhammadhammo nanahetu ca dhammā uppajjanti hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vipākaṃ nahetuñca nevavipākanavipākadhammadhammaṃ nahetuñca dhammaṃ paṭicca navipākadhammadhammo nanahetu dhammo uppajjati hetupaccayā… tīṇi… hetuyā cuddasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4-1. Upādinnattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "69"
      },
      ". Upādinnupādāniyaṃ hetuṃ dhammaṃ paṭicca naupādinnupādāniyo nahetu dhammo uppajjati hetupaccayā. Upādinnupādāniyaṃ hetuṃ dhammaṃ paṭicca naanupādinnupādāniyo nahetu dhammo uppajjati hetupaccayā. Upādinnupādāniyaṃ ",
      " hetuṃ dhammaṃ paṭicca naanupādinnaanupādāniyo nahetu dhammo uppajjati hetupaccayā. Upādinnupādāniyaṃ hetuṃ dhammaṃ paṭicca naupādinnupādāniyo nahetu ca naanupādinnaanupādāniyo nahetu ca dhammā uppajjanti hetupaccayā. Upādinnupādāniyaṃ hetuṃ dhammaṃ paṭicca naanupādinnupādāniyo nahetu ca naanupādinnaanupādāniyo nahetu ca dhammā uppajjanti ",
      " hetupaccayā. Pañca."
    ],
    "innerText": "69. Upādinnupādāniyaṃ hetuṃ dhammaṃ paṭicca naupādinnupādāniyo nahetu dhammo uppajjati hetupaccayā. Upādinnupādāniyaṃ hetuṃ dhammaṃ paṭicca naanupādinnupādāniyo nahetu dhammo uppajjati hetupaccayā. Upādinnupādāniyaṃ hetuṃ dhammaṃ paṭicca naanupādinnaanupādāniyo nahetu dhammo uppajjati hetupaccayā. Upādinnupādāniyaṃ hetuṃ dhammaṃ paṭicca naupādinnupādāniyo nahetu ca naanupādinnaanupādāniyo nahetu ca dhammā uppajjanti hetupaccayā. Upādinnupādāniyaṃ hetuṃ dhammaṃ paṭicca naanupādinnupādāniyo nahetu ca naanupādinnaanupādāniyo nahetu ca dhammā uppajjanti hetupaccayā. Pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anupādinnupādāniyaṃ hetuṃ dhammaṃ paṭicca naupādinnupādāniyo nahetu dhammo uppajjati hetupaccayā… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anupādinnaanupādāniyaṃ hetuṃ dhammaṃ paṭicca naanupādinnaanupādāniyo nahetu dhammo uppajjati hetupaccayā… pañca… hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "70"
      },
      ". Upādinnupādāniyaṃ ",
      " nahetuṃ dhammaṃ paṭicca naanupādinnupādāniyo nanahetu dhammo uppajjati hetupaccayā… tīṇi… hetuyā nava."
    ],
    "innerText": "70. Upādinnupādāniyaṃ nahetuṃ dhammaṃ paṭicca naanupādinnupādāniyo nanahetu dhammo uppajjati hetupaccayā… tīṇi… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "5-1. Saṃkiliṭṭhattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "71"
      },
      ". Saṃkiliṭṭhasaṃkilesikaṃ hetuṃ dhammaṃ paṭicca nasaṃkiliṭṭhasaṃkilesiko nahetu dhammo uppajjati hetupaccayā… hetuyā terasa."
    ],
    "innerText": "71. Saṃkiliṭṭhasaṃkilesikaṃ hetuṃ dhammaṃ paṭicca nasaṃkiliṭṭhasaṃkilesiko nahetu dhammo uppajjati hetupaccayā… hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saṃkiliṭṭhasaṃkilesikaṃ nahetuṃ dhammaṃ paṭicca naasaṃkiliṭṭhasaṃkilesiko nanahetu dhammo uppajjati hetupaccayā… tīṇi… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "6-1. Vitakkattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "72"
      },
      ". Savitakkasavicāraṃ hetuṃ dhammaṃ paṭicca nasavitakkasavicāro nahetu dhammo uppajjati hetupaccayā… hetuyā pannarasa."
    ],
    "innerText": "72. Savitakkasavicāraṃ hetuṃ dhammaṃ paṭicca nasavitakkasavicāro nahetu dhammo uppajjati hetupaccayā… hetuyā pannarasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Savitakkasavicāraṃ ",
      " nahetuṃ dhammaṃ paṭicca naavitakkavicāramatto nanahetu dhammo uppajjati hetupaccayā… hetuyā aṭṭhavīsa."
    ],
    "innerText": "Savitakkasavicāraṃ nahetuṃ dhammaṃ paṭicca naavitakkavicāramatto nanahetu dhammo uppajjati hetupaccayā… hetuyā aṭṭhavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "7-1. Pītittika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "73"
      },
      ". Pītisahagataṃ hetuṃ dhammaṃ paṭicca napītisahagato nahetu dhammo uppajjati hetupaccayā… hetuyā aṭṭhavīsa."
    ],
    "innerText": "73. Pītisahagataṃ hetuṃ dhammaṃ paṭicca napītisahagato nahetu dhammo uppajjati hetupaccayā… hetuyā aṭṭhavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pītisahagataṃ ",
      " nahetuṃ dhammaṃ paṭicca naupekkhāsahagato nanahetu dhammo uppajjati hetupaccayā… hetuyā aṭṭhārasa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[hetuyā aṭṭha?]"
      },
      "."
    ],
    "innerText": "Pītisahagataṃ nahetuṃ dhammaṃ paṭicca naupekkhāsahagato nanahetu dhammo uppajjati hetupaccayā… hetuyā aṭṭhārasa [hetuyā aṭṭha?]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "8-1. Dassanattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "74"
      },
      ". Dassanena pahātabbaṃ hetuṃ dhammaṃ paṭicca nadassanena pahātabbo nahetu dhammo uppajjati hetupaccayā… hetuyā terasa."
    ],
    "innerText": "74. Dassanena pahātabbaṃ hetuṃ dhammaṃ paṭicca nadassanena pahātabbo nahetu dhammo uppajjati hetupaccayā… hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena ",
      " pahātabbaṃ nahetuṃ dhammaṃ paṭicca nabhāvanāya pahātabbo nanahetu dhammo uppajjati hetupaccayā… hetuyā nava."
    ],
    "innerText": "Dassanena pahātabbaṃ nahetuṃ dhammaṃ paṭicca nabhāvanāya pahātabbo nanahetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "9-1. Dassanahetuttika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "75"
      },
      ". Dassanena pahātabbahetukaṃ hetuṃ dhammaṃ paṭicca nadassanena pahātabbahetuko ",
      " nahetu dhammo uppajjati hetupaccayā… hetuyā soḷasa."
    ],
    "innerText": "75. Dassanena pahātabbahetukaṃ hetuṃ dhammaṃ paṭicca nadassanena pahātabbahetuko nahetu dhammo uppajjati hetupaccayā… hetuyā soḷasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukaṃ nahetuṃ dhammaṃ paṭicca nabhāvanāya pahātabbahetuko nanahetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "10-1. Ācayagāmittika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "76"
      },
      ". Ācayagāmiṃ hetuṃ dhammaṃ paṭicca naācayagāmī nahetu dhammo uppajjati hetupaccayā… hetuyā terasa."
    ],
    "innerText": "76. Ācayagāmiṃ hetuṃ dhammaṃ paṭicca naācayagāmī nahetu dhammo uppajjati hetupaccayā… hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ācayagāmiṃ nahetuṃ dhammaṃ paṭicca naapacayagāmī nanahetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "11-1. Sekkhattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "77"
      },
      ". Sekkhaṃ hetuṃ dhammaṃ paṭicca nasekkho nahetu dhammo uppajjati hetupaccayā… hetuyā terasa."
    ],
    "innerText": "77. Sekkhaṃ hetuṃ dhammaṃ paṭicca nasekkho nahetu dhammo uppajjati hetupaccayā… hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sekkhaṃ nahetuṃ dhammaṃ paṭicca naasekkho nanahetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "12-1. Parittattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "78"
      },
      ". Parittaṃ ",
      " hetuṃ dhammaṃ paṭicca namahaggato nahetu dhammo uppajjati hetupaccayā… hetuyā terasa."
    ],
    "innerText": "78. Parittaṃ hetuṃ dhammaṃ paṭicca namahaggato nahetu dhammo uppajjati hetupaccayā… hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Parittaṃ ",
      " nahetuṃ dhammaṃ paṭicca naparitto nanahetu dhammo uppajjati hetupaccayā… hetuyā cuddasa."
    ],
    "innerText": "Parittaṃ nahetuṃ dhammaṃ paṭicca naparitto nanahetu dhammo uppajjati hetupaccayā… hetuyā cuddasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "13-1. Parittārammaṇattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "79"
      },
      ". Parittārammaṇaṃ hetuṃ dhammaṃ paṭicca naparittārammaṇo nahetu dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
    ],
    "innerText": "79. Parittārammaṇaṃ hetuṃ dhammaṃ paṭicca naparittārammaṇo nahetu dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Parittārammaṇaṃ nahetuṃ dhammaṃ paṭicca namahaggatārammaṇo nanahetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "14-1. Hīnattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "80"
      },
      ". Hīnaṃ hetuṃ dhammaṃ paṭicca nahīno nahetu dhammo uppajjati hetupaccayā… hetuyā terasa."
    ],
    "innerText": "80. Hīnaṃ hetuṃ dhammaṃ paṭicca nahīno nahetu dhammo uppajjati hetupaccayā… hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hīnaṃ nahetuṃ dhammaṃ paṭicca namajjhimo nanahetu dhammo uppajjati ",
      " hetupaccayā… hetuyā nava."
    ],
    "innerText": "Hīnaṃ nahetuṃ dhammaṃ paṭicca namajjhimo nanahetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "15-1. Micchattaniyatattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "81"
      },
      ". Micchattaniyataṃ hetuṃ dhammaṃ paṭicca namicchattaniyato nahetu dhammo uppajjati hetupaccayā… hetuyā terasa."
    ],
    "innerText": "81. Micchattaniyataṃ hetuṃ dhammaṃ paṭicca namicchattaniyato nahetu dhammo uppajjati hetupaccayā… hetuyā terasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Micchattaniyataṃ nahetuṃ dhammaṃ paṭicca nasammattaniyato nanahetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "16-1. Maggārammaṇattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "82"
      },
      ". Maggārammaṇaṃ hetuṃ dhammaṃ paṭicca namaggārammaṇo nahetu dhammo uppajjati hetupaccayā… hetuyā pañcavīsa."
    ],
    "innerText": "82. Maggārammaṇaṃ hetuṃ dhammaṃ paṭicca namaggārammaṇo nahetu dhammo uppajjati hetupaccayā… hetuyā pañcavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Maggārammaṇaṃ nahetuṃ dhammaṃ paṭicca namaggahetuko nanahetu dhammo uppajjati hetupaccayā… hetuyā terasa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[hetuyā aṭṭha?]"
      },
      "."
    ],
    "innerText": "Maggārammaṇaṃ nahetuṃ dhammaṃ paṭicca namaggahetuko nanahetu dhammo uppajjati hetupaccayā… hetuyā terasa [hetuyā aṭṭha?]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "17-1. Uppannattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "83"
      },
      ". Uppanno ",
      " hetu dhammo naanupannassa nahetussa dhammassa hetupaccayena paccayo. Uppanno hetu dhammo nauppādissa ",
      " nahetussa dhammassa hetupaccayena paccayo. Uppanno hetu dhammo naanuppannassa nahetussa ca nauppādissa nahetussa ca dhammassa hetupaccayena paccayo. Hetuyā tīṇi."
    ],
    "innerText": "83. Uppanno hetu dhammo naanupannassa nahetussa dhammassa hetupaccayena paccayo. Uppanno hetu dhammo nauppādissa nahetussa dhammassa hetupaccayena paccayo. Uppanno hetu dhammo naanuppannassa nahetussa ca nauppādissa nahetussa ca dhammassa hetupaccayena paccayo. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "18-1. Atītattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "84"
      },
      ". Paccuppanno hetu dhammo naatītassa nahetussa dhammassa hetupaccayena paccayo. Paccuppanno hetu dhammo naanāgatassa nahetussa dhammassa hetupaccayena paccayo. Paccuppanno hetu dhammo naatītassa nahetussa ca naanāgatassa nahetussa ca dhammassa hetupaccayena paccayo. Hetuyā tīṇi."
    ],
    "innerText": "84. Paccuppanno hetu dhammo naatītassa nahetussa dhammassa hetupaccayena paccayo. Paccuppanno hetu dhammo naanāgatassa nahetussa dhammassa hetupaccayena paccayo. Paccuppanno hetu dhammo naatītassa nahetussa ca naanāgatassa nahetussa ca dhammassa hetupaccayena paccayo. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "19-1. Atītārammaṇattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "85"
      },
      ". Atītārammaṇaṃ hetuṃ dhammaṃ paṭicca naatītārammaṇo nahetu dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
    ],
    "innerText": "85. Atītārammaṇaṃ hetuṃ dhammaṃ paṭicca naatītārammaṇo nahetu dhammo uppajjati hetupaccayā… hetuyā ekavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atītārammaṇaṃ nahetuṃ dhammaṃ paṭicca naanāgatārammaṇo nanahetu dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "20-1. Ajjhattattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "86"
      },
      ". Ajjhattaṃ ",
      " hetuṃ dhammaṃ paṭicca nabahiddhā nahetu dhammo uppajjati hetupaccayā. Bahiddhā hetuṃ dhammaṃ paṭicca naajjhatto nahetu dhammo uppajjati hetupaccayā. Hetuyā dve."
    ],
    "innerText": "86. Ajjhattaṃ hetuṃ dhammaṃ paṭicca nabahiddhā nahetu dhammo uppajjati hetupaccayā. Bahiddhā hetuṃ dhammaṃ paṭicca naajjhatto nahetu dhammo uppajjati hetupaccayā. Hetuyā dve."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ajjhattaṃ nahetuṃ dhammaṃ paṭicca nabahiddhā nanahetu dhammo uppajjati hetupaccayā. Bahiddhā nahetuṃ dhammaṃ paṭicca naajjhatto nanahetu dhammo uppajjati hetupaccayā. Hetuyā dve."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "21-1. Ajjhattārammaṇattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "87"
      },
      ". Ajjhattārammaṇaṃ ",
      " hetuṃ dhammaṃ paṭicca naajjhattārammaṇo nahetu dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "87. Ajjhattārammaṇaṃ hetuṃ dhammaṃ paṭicca naajjhattārammaṇo nahetu dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ajjhattārammaṇaṃ ",
      " nahetuṃ dhammaṃ paṭicca nabahiddhārammaṇo nanahetu dhammo uppajjati hetupaccayā… hetuyā dve."
    ],
    "innerText": "Ajjhattārammaṇaṃ nahetuṃ dhammaṃ paṭicca nabahiddhārammaṇo nanahetu dhammo uppajjati hetupaccayā… hetuyā dve."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-1. Sanidassanattika-hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "88"
      },
      ". Anidassanaappaṭighaṃ hetuṃ dhammaṃ paṭicca naanidassanaappaṭigho nahetu dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ ",
      " hetuṃ dhammaṃ paṭicca nasanidassanasappaṭigho nahetu dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ hetuṃ dhammaṃ paṭicca nasanidassanasappaṭigho nahetu ca naanidassanasappaṭigho nahetu ca dhammā uppajjanti hetupaccayā… hetuyā cha."
    ],
    "innerText": "88. Anidassanaappaṭighaṃ hetuṃ dhammaṃ paṭicca naanidassanaappaṭigho nahetu dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ hetuṃ dhammaṃ paṭicca nasanidassanasappaṭigho nahetu dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ hetuṃ dhammaṃ paṭicca nasanidassanasappaṭigho nahetu ca naanidassanasappaṭigho nahetu ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "89"
      },
      ". Anidassanaappaṭighaṃ nahetuṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanahetu dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ nahetuṃ dhammaṃ paṭicca naanidassanasappaṭigho nanahetu dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ nahetuṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanahetu ca naanidassanasappaṭigho nanahetu ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "89. Anidassanaappaṭighaṃ nahetuṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanahetu dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ nahetuṃ dhammaṃ paṭicca naanidassanasappaṭigho nanahetu dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ nahetuṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanahetu ca naanidassanasappaṭigho nanahetu ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-2. Sanidassanattika-sahetukadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "90"
      },
      ". Anidassanaappaṭighaṃ sahetukaṃ dhammaṃ paṭicca naanidassanaappaṭigho nasahetuko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ sahetukaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasahetuko dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ sahetukaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasahetuko ca naanidassanasappaṭigho nasahetuko ca dhammā uppajjanti hetupaccayā… hetuyā ",
      " cha."
    ],
    "innerText": "90. Anidassanaappaṭighaṃ sahetukaṃ dhammaṃ paṭicca naanidassanaappaṭigho nasahetuko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ sahetukaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasahetuko dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ sahetukaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasahetuko ca naanidassanasappaṭigho nasahetuko ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ ",
      " ahetukaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naahetuko dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.) Hetuyā tīṇi."
    ],
    "innerText": "Anidassanaappaṭighaṃ ahetukaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naahetuko dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.) Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-3. Sanidassanattika-hetusampayuttadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "91"
      },
      ". Anidassanaappaṭighaṃ hetusampayuttaṃ dhammaṃ paṭicca naanidassanaappaṭigho nahetusampayutto dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ ",
      " hetusampayuttaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nahetusampayutto dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ hetusampayuttaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nahetusampayutto ca naanidassanasappaṭigho nahetusampayutto ca dhammā uppajjanti hetupaccayā… hetuyā cha."
    ],
    "innerText": "91. Anidassanaappaṭighaṃ hetusampayuttaṃ dhammaṃ paṭicca naanidassanaappaṭigho nahetusampayutto dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ hetusampayuttaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nahetusampayutto dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ hetusampayuttaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nahetusampayutto ca naanidassanasappaṭigho nahetusampayutto ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ hetuvippayuttaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nahetuvippayutto dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-4. Sanidassanattika-hetusahetukadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "92"
      },
      ". Anidassanaappaṭighaṃ hetuñceva sahetukañca dhammaṃ paṭicca nasanidassanasappaṭigho ",
      " nahetu ceva naahetuko ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "92. Anidassanaappaṭighaṃ hetuñceva sahetukañca dhammaṃ paṭicca nasanidassanasappaṭigho nahetu ceva naahetuko ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ sahetukañceva na ca hetuṃ dhammaṃ paṭicca nasanidassanasappaṭigho naahetuko ceva nanahetu ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-5. Sanidassanattika-hetuhetusampayuttadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "93"
      },
      ". Anidassanaappaṭighaṃ hetuñceva hetusampayuttañca dhammaṃ paṭicca nasanidassanasappaṭigho nahetu ceva nahetuvippayutto ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "93. Anidassanaappaṭighaṃ hetuñceva hetusampayuttañca dhammaṃ paṭicca nasanidassanasappaṭigho nahetu ceva nahetuvippayutto ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ hetusampayuttañceva na ca hetuṃ dhammaṃ paṭicca nasanidassanasappaṭigho nahetuvippayutto ceva nanahetu ca dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-6. Sanidassanattika-nahetusahetukadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "94"
      },
      ". Anidassanaappaṭighaṃ ",
      " nahetuṃ sahetukaṃ dhammaṃ paṭicca naanidassanaappaṭigho ",
      " nahetu nasahetuko dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "94. Anidassanaappaṭighaṃ nahetuṃ sahetukaṃ dhammaṃ paṭicca naanidassanaappaṭigho nahetu nasahetuko dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ ",
      " nahetuṃ ahetukaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nahetu naahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "Anidassanaappaṭighaṃ nahetuṃ ahetukaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nahetu naahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-7. Sanidassanattika-sappaccayadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "95"
      },
      ". Anidassanaappaṭigho appaccayo dhammo nasanidassanasappaṭighassa naappaccayassa dhammassa ārammaṇapaccayena paccayo."
    ],
    "innerText": "95. Anidassanaappaṭigho appaccayo dhammo nasanidassanasappaṭighassa naappaccayassa dhammassa ārammaṇapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ārammaṇe tīṇi, adhipatiyā tīṇi, upanissaye tīṇi. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-9. Sanidassanattika-sanidassanadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "96"
      },
      ". Sanidassanasappaṭigho nasanidassano dhammo nasanidassanasappaṭighassa nasanidassanassa dhammassa ārammaṇapaccayena paccayo. (Saṃkhittaṃ.) Ārammaṇe tīṇi, adhipatiyā tīṇi, upanissaye purejāte atthiyā avigate tīṇi."
    ],
    "innerText": "96. Sanidassanasappaṭigho nasanidassano dhammo nasanidassanasappaṭighassa nasanidassanassa dhammassa ārammaṇapaccayena paccayo. (Saṃkhittaṃ.) Ārammaṇe tīṇi, adhipatiyā tīṇi, upanissaye purejāte atthiyā avigate tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭighaṃ anidassanaṃ dhammaṃ paṭicca naanidassanasappaṭigho naanidassano dhammo uppajjati hetupaccayā… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-10. Sanidassanattika-sappaṭighadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "97"
      },
      ". Anidassanasappaṭighaṃ sappaṭighaṃ dhammaṃ paṭicca naanidassanasappaṭigho nasappaṭigho dhammo uppajjati hetupaccayā. Anidassanasappaṭighaṃ sappaṭighaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasappaṭigho dhammo uppajjati hetupaccayā. Anidassanasappaṭighaṃ sappaṭighaṃ ",
      " dhammaṃ paṭicca nasanidassanasappaṭigho nasappaṭigho ca naanidassanasappaṭigho nasappaṭigho ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "97. Anidassanasappaṭighaṃ sappaṭighaṃ dhammaṃ paṭicca naanidassanasappaṭigho nasappaṭigho dhammo uppajjati hetupaccayā. Anidassanasappaṭighaṃ sappaṭighaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasappaṭigho dhammo uppajjati hetupaccayā. Anidassanasappaṭighaṃ sappaṭighaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasappaṭigho ca naanidassanasappaṭigho nasappaṭigho ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ ",
      " appaṭighaṃ dhammaṃ paṭicca naanidassanaappaṭigho naappaṭigho dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ appaṭighaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naappaṭigho dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ appaṭighaṃ dhammaṃ paṭicca naanidassanasappaṭigho naappaṭigho ca naanidassanaappaṭigho naappaṭigho ca dhammā uppajjanti hetupaccayā… hetuyā pañca."
    ],
    "innerText": "Anidassanaappaṭighaṃ appaṭighaṃ dhammaṃ paṭicca naanidassanaappaṭigho naappaṭigho dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ appaṭighaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naappaṭigho dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ appaṭighaṃ dhammaṃ paṭicca naanidassanasappaṭigho naappaṭigho ca naanidassanaappaṭigho naappaṭigho ca dhammā uppajjanti hetupaccayā… hetuyā pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-11. Sanidassanattika-rūpīdukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "98"
      },
      ". Anidassanaappaṭighaṃ ",
      " rūpiṃ dhammaṃ paṭicca nasanidassanasappaṭigho narūpī dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "98. Anidassanaappaṭighaṃ rūpiṃ dhammaṃ paṭicca nasanidassanasappaṭigho narūpī dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ arūpiṃ dhammaṃ paṭicca naanidassanaappaṭigho naarūpī dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ arūpiṃ dhammaṃ paṭicca nasanidassanasappaṭigho naarūpī dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ arūpiṃ dhammaṃ paṭicca nasanidassanasappaṭigho naarūpī ca naanidassanasappaṭigho naarūpī ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-12. Sanidassanattika-lokiyadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "99"
      },
      ". Anidassanaappaṭighaṃ lokiyaṃ dhammaṃ paccayā nasanidassanasappaṭigho nalokiyo dhammo uppajjati hetupaccayā… (saṃkhittaṃ). Hetuyā tīṇi… avigate tīṇi."
    ],
    "innerText": "99. Anidassanaappaṭighaṃ lokiyaṃ dhammaṃ paccayā nasanidassanasappaṭigho nalokiyo dhammo uppajjati hetupaccayā… (saṃkhittaṃ). Hetuyā tīṇi… avigate tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ ",
      " lokuttaraṃ dhammaṃ paṭicca naanidassanaappaṭigho nalokuttaro dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "Anidassanaappaṭighaṃ lokuttaraṃ dhammaṃ paṭicca naanidassanaappaṭigho nalokuttaro dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-13. Sanidassanattika-kenaciviññeyyadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "100"
      },
      ". Anidassanasappaṭighaṃ ",
      " kenaci viññeyyaṃ dhammaṃ paṭicca naanidassanasappaṭigho nakenaci viññeyyo dhammo uppajjati hetupaccayā. Anidassanasappaṭighaṃ kenaci viññeyyaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nakenaci viññeyyo dhammo uppajjati hetupaccayā. Anidassanasappaṭighaṃ kenaci viññeyyaṃ dhammaṃ paṭicca naanidassanaappaṭigho nakenaci viññeyyo dhammo uppajjati hetupaccayā…pe… anidassanasappaṭighaṃ kenaci viññeyyaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nakenaci viññeyyo ca naanidassanasappaṭigho nakenaci viññeyyo ca dhammā uppajjanti hetupaccayā… cha."
    ],
    "innerText": "100. Anidassanasappaṭighaṃ kenaci viññeyyaṃ dhammaṃ paṭicca naanidassanasappaṭigho nakenaci viññeyyo dhammo uppajjati hetupaccayā. Anidassanasappaṭighaṃ kenaci viññeyyaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nakenaci viññeyyo dhammo uppajjati hetupaccayā. Anidassanasappaṭighaṃ kenaci viññeyyaṃ dhammaṃ paṭicca naanidassanaappaṭigho nakenaci viññeyyo dhammo uppajjati hetupaccayā…pe… anidassanasappaṭighaṃ kenaci viññeyyaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nakenaci viññeyyo ca naanidassanasappaṭigho nakenaci viññeyyo ca dhammā uppajjanti hetupaccayā… cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ kenaci viññeyyaṃ dhammaṃ paṭicca naanidassanaappaṭigho nakenaci viññeyyo dhammo uppajjati hetupaccayā… cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭighaṃ kenaci viññeyyañca anidassanaappaṭighaṃ kenaci viññeyyañca dhammaṃ paṭicca nasanidassanasappaṭigho nakenaci viññeyyo dhammo uppajjati ",
      " hetupaccayā… cha… hetuyā aṭṭhārasa."
    ],
    "innerText": "Anidassanasappaṭighaṃ kenaci viññeyyañca anidassanaappaṭighaṃ kenaci viññeyyañca dhammaṃ paṭicca nasanidassanasappaṭigho nakenaci viññeyyo dhammo uppajjati hetupaccayā… cha… hetuyā aṭṭhārasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭighaṃ ",
      " kenaci viññeyyaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanakenaci viññeyyo dhammo uppajjati hetupaccayā… hetuyā aṭṭhārasa."
    ],
    "innerText": "Anidassanasappaṭighaṃ kenaci viññeyyaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanakenaci viññeyyo dhammo uppajjati hetupaccayā… hetuyā aṭṭhārasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-14. Sanidassanattika-āsavadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "101"
      },
      ". Anidassanaappaṭighaṃ āsavaṃ dhammaṃ paṭicca naanidassanaappaṭigho noāsavo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ āsavaṃ dhammaṃ paṭicca nasanidassanasappaṭigho noāsavo dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ āsavaṃ dhammaṃ paṭicca nasanidassanasappaṭigho noāsavo ca naanidassanasappaṭigho noāsavo ca dhammā uppajjanti hetupaccayā… hetuyā cha."
    ],
    "innerText": "101. Anidassanaappaṭighaṃ āsavaṃ dhammaṃ paṭicca naanidassanaappaṭigho noāsavo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ āsavaṃ dhammaṃ paṭicca nasanidassanasappaṭigho noāsavo dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ āsavaṃ dhammaṃ paṭicca nasanidassanasappaṭigho noāsavo ca naanidassanasappaṭigho noāsavo ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ noāsavaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanoāsavo dhammo uppajjati ",
      " hetupaccayā. Anidassanaappaṭighaṃ noāsavaṃ dhammaṃ paṭicca naanidassanasappaṭigho nanoāsavo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ noāsavaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanoāsavo ca naanidassanasappaṭigho nanoāsavo ",
      " ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "Anidassanaappaṭighaṃ noāsavaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanoāsavo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ noāsavaṃ dhammaṃ paṭicca naanidassanasappaṭigho nanoāsavo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ noāsavaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanoāsavo ca naanidassanasappaṭigho nanoāsavo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-15. Sanidassanattika-sāsavadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "102"
      },
      ". Anidassanaappaṭighaṃ sāsavaṃ dhammaṃ paccayā nasanidassanasappaṭigho nasāsavo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ sāsavaṃ dhammaṃ paccayā naanidassanasappaṭigho nasāsavo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ sāsavaṃ dhammaṃ paccayā nasanidassanasappaṭigho nasāsavo ca naanidassanasappaṭigho nasāsavo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "102. Anidassanaappaṭighaṃ sāsavaṃ dhammaṃ paccayā nasanidassanasappaṭigho nasāsavo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ sāsavaṃ dhammaṃ paccayā naanidassanasappaṭigho nasāsavo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ sāsavaṃ dhammaṃ paccayā nasanidassanasappaṭigho nasāsavo ca naanidassanasappaṭigho nasāsavo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ anāsavaṃ dhammaṃ paṭicca naanidassanaappaṭigho naanāsavo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ anāsavaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naanāsavo dhammo uppajjati hetupaccayā…pe…. Anidassanaappaṭighaṃ anāsavaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naanāsavo ca naanidassanasappaṭigho naanāsavo ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-16. Sanidassanattika-āsavasampayuttadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "103"
      },
      ". Anidassanaappaṭighaṃ ",
      " āsavasampayuttaṃ dhammaṃ paṭicca naanidassanaappaṭigho ",
      " naāsavasampayutto dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ āsavasampayuttaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naāsavasampayutto dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ āsavasampayuttaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naāsavasampayutto ca naanidassanasappaṭigho naāsavasampayutto ca dhammā uppajjanti hetupaccayā… hetuyā cha."
    ],
    "innerText": "103. Anidassanaappaṭighaṃ āsavasampayuttaṃ dhammaṃ paṭicca naanidassanaappaṭigho naāsavasampayutto dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ āsavasampayuttaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naāsavasampayutto dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ āsavasampayuttaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naāsavasampayutto ca naanidassanasappaṭigho naāsavasampayutto ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ āsavavippayuttaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naāsavavippayutto dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-17. Sanidassanattika-āsavasāsavadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "104"
      },
      ". Anidassanaappaṭighaṃ ",
      " āsavañceva sāsavañca dhammaṃ paṭicca naanidassanaappaṭigho naāsavo ceva naanāsavo ca dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ āsavañceva sāsavañca dhammaṃ paṭicca nasanidassanasappaṭigho naāsavo ceva naanāsavo ca dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ āsavañceva sāsavañca dhammaṃ paṭicca nasanidassanasappaṭigho naāsavo ceva naanāsavo ca naanidassanasappaṭigho naāsavo ceva naanāsavo ca dhammā uppajjanti ",
      " hetupaccayā… hetuyā cha."
    ],
    "innerText": "104. Anidassanaappaṭighaṃ āsavañceva sāsavañca dhammaṃ paṭicca naanidassanaappaṭigho naāsavo ceva naanāsavo ca dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ āsavañceva sāsavañca dhammaṃ paṭicca nasanidassanasappaṭigho naāsavo ceva naanāsavo ca dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ āsavañceva sāsavañca dhammaṃ paṭicca nasanidassanasappaṭigho naāsavo ceva naanāsavo ca naanidassanasappaṭigho naāsavo ceva naanāsavo ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ sāsavañceva no ca āsavaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naanāsavo ceva nanoāsavo ca dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ sāsavañceva no ca āsavaṃ dhammaṃ paṭicca naanidassanasappaṭigho naanāsavo ceva nano ca āsavo dhammo uppajjati hetupaccayā. Anidassanasappaṭighaṃ sāsavañceva no ca āsavaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naanāsavo ceva nano ca āsavo naanidassanasappaṭigho naanāsavo ceva nano āsavo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-18. Sanidassanattika-āsavaāsavasampayuttadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "105"
      },
      ". Anidassanaappaṭighaṃ ",
      " āsavañceva āsavasampayuttañca dhammaṃ paṭicca nasanidassanasappaṭigho naāsavo ceva naāsavavippayutto ca dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ āsavañceva āsavasampayuttañca dhammaṃ paṭicca naanidassanasappaṭigho naāsavo ceva naāsavavippayutto ca dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ āsavañceva āsavasampayuttañca dhammaṃ paṭicca nasanidassanasappaṭigho naāsavo ceva naāsavavippayutto ca naanidassanasappaṭigho naāsavo ",
      " ceva naāsavavippayutto ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "105. Anidassanaappaṭighaṃ āsavañceva āsavasampayuttañca dhammaṃ paṭicca nasanidassanasappaṭigho naāsavo ceva naāsavavippayutto ca dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ āsavañceva āsavasampayuttañca dhammaṃ paṭicca naanidassanasappaṭigho naāsavo ceva naāsavavippayutto ca dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ āsavañceva āsavasampayuttañca dhammaṃ paṭicca nasanidassanasappaṭigho naāsavo ceva naāsavavippayutto ca naanidassanasappaṭigho naāsavo ceva naāsavavippayutto ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ āsavasampayuttañceva no ca āsavaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naāsavavippayutto ceva nano ca āsavo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-19. Sanidassanattika-āsavavippayuttasāsavadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "106"
      },
      ". Anidassanaappaṭighaṃ ",
      " āsavavippayuttaṃ sāsavaṃ dhammaṃ paccayā nasanidassanasappaṭigho āsavavippayutto nasāsavo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ āsavavippayuttaṃ sāsavaṃ dhammaṃ paccayā naanidassanasappaṭigho āsavavippayutto nasāsavo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ āsavavippayuttaṃ sāsavaṃ dhammaṃ paccayā nasanidassanasappaṭigho āsavavippayutto nasāsavo ca naanidassanasappaṭigho āsavavippayutto nasāsavo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "106. Anidassanaappaṭighaṃ āsavavippayuttaṃ sāsavaṃ dhammaṃ paccayā nasanidassanasappaṭigho āsavavippayutto nasāsavo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ āsavavippayuttaṃ sāsavaṃ dhammaṃ paccayā naanidassanasappaṭigho āsavavippayutto nasāsavo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ āsavavippayuttaṃ sāsavaṃ dhammaṃ paccayā nasanidassanasappaṭigho āsavavippayutto nasāsavo ca naanidassanasappaṭigho āsavavippayutto nasāsavo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ āsavavippayuttaṃ anāsavaṃ dhammaṃ paṭicca naanidassanaappaṭigho āsavavippayutto naanāsavo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ āsavavippayuttaṃ anāsavaṃ dhammaṃ paṭicca ",
      " nasanidassanasappaṭigho āsavavippayutto naanāsavo dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ āsavavippayuttaṃ anāsavaṃ dhammaṃ paṭicca nasanidassanasappaṭigho āsavavippayutto naanāsavo ca naanidassanasappaṭigho āsavavippayutto naanāsavo ca dhammā uppajjanti hetupaccayā… hetuyā cha."
    ],
    "innerText": "Anidassanaappaṭighaṃ āsavavippayuttaṃ anāsavaṃ dhammaṃ paṭicca naanidassanaappaṭigho āsavavippayutto naanāsavo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ āsavavippayuttaṃ anāsavaṃ dhammaṃ paṭicca nasanidassanasappaṭigho āsavavippayutto naanāsavo dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ āsavavippayuttaṃ anāsavaṃ dhammaṃ paṭicca nasanidassanasappaṭigho āsavavippayutto naanāsavo ca naanidassanasappaṭigho āsavavippayutto naanāsavo ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-20-54. Sanidassanattika-saññojanādidukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "107"
      },
      ". Anidassanaappaṭighaṃ ",
      " saññojanaṃ dhammaṃ paṭicca naanidassanaappaṭigho nosaññojano dhammo uppajjati hetupaccayā."
    ],
    "innerText": "107. Anidassanaappaṭighaṃ saññojanaṃ dhammaṃ paṭicca naanidassanaappaṭigho nosaññojano dhammo uppajjati hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "108"
      },
      ". Anidassanaappaṭighaṃ ganthaṃ dhammaṃ paṭicca naanidassanaappaṭigho nogantho dhammo uppajjati hetupaccayā…pe…."
    ],
    "innerText": "108. Anidassanaappaṭighaṃ ganthaṃ dhammaṃ paṭicca naanidassanaappaṭigho nogantho dhammo uppajjati hetupaccayā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ oghaṃ dhammaṃ paṭicca naanidassanaappaṭigho noogho dhammo uppajjati hetupaccayā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ yogaṃ dhammaṃ paṭicca naanidassanaappaṭigho noyogo dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "109"
      },
      ". Anidassanaappaṭighaṃ ",
      " nīvaraṇaṃ dhammaṃ paṭicca naanidassanaappaṭigho nonīvaraṇo dhammo uppajjati hetupaccayā."
    ],
    "innerText": "109. Anidassanaappaṭighaṃ nīvaraṇaṃ dhammaṃ paṭicca naanidassanaappaṭigho nonīvaraṇo dhammo uppajjati hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "110"
      },
      ". Anidassanaappaṭighaṃ parāmāsaṃ dhammaṃ paṭicca naanidassanaappaṭigho noparāmāso dhammo uppajjati hetupaccayā."
    ],
    "innerText": "110. Anidassanaappaṭighaṃ parāmāsaṃ dhammaṃ paṭicca naanidassanaappaṭigho noparāmāso dhammo uppajjati hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-55. Sanidassanattika-sārammaṇadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "111"
      },
      ". Anidassanaappaṭighaṃ ",
      " sārammaṇaṃ dhammaṃ paṭicca naanidassanaappaṭigho nasārammaṇo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ sārammaṇaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasārammaṇo dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ sārammaṇaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasārammaṇo ca naanidassanasappaṭigho nasārammaṇo ca dhammā uppajjanti hetupaccayā."
    ],
    "innerText": "111. Anidassanaappaṭighaṃ sārammaṇaṃ dhammaṃ paṭicca naanidassanaappaṭigho nasārammaṇo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ sārammaṇaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasārammaṇo dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ sārammaṇaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasārammaṇo ca naanidassanasappaṭigho nasārammaṇo ca dhammā uppajjanti hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ anārammaṇaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naanārammaṇo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-56. Sanidassanattika-cittadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "112"
      },
      ". Anidassanaappaṭighaṃ cittaṃ dhammaṃ paṭicca naanidassanaappaṭigho nocitto dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ cittaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nocitto dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ ",
      " cittaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nocitto ",
      " ca naanidassanasappaṭigho nocitto ca dhammā uppajjanti hetupaccayā… hetuyā cha."
    ],
    "innerText": "112. Anidassanaappaṭighaṃ cittaṃ dhammaṃ paṭicca naanidassanaappaṭigho nocitto dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ cittaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nocitto dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ cittaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nocitto ca naanidassanasappaṭigho nocitto ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ nocittaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanocitto dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-57. Sanidassanattika-cetasikadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "113"
      },
      ". Anidassanaappaṭighaṃ ",
      " cetasikaṃ dhammaṃ paṭicca naanidassanaappaṭigho nacetasiko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ cetasikaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nacetasiko dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ cetasikaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nacetasiko ca naanidassanasappaṭigho nacetasiko ca dhammā uppajjanti hetupaccayā… hetuyā cha."
    ],
    "innerText": "113. Anidassanaappaṭighaṃ cetasikaṃ dhammaṃ paṭicca naanidassanaappaṭigho nacetasiko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ cetasikaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nacetasiko dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ cetasikaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nacetasiko ca naanidassanasappaṭigho nacetasiko ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-58. Sanidassanattika-cittasampayuttadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "114"
      },
      ". Anidassanaappaṭighaṃ cittasampayuttaṃ dhammaṃ paṭicca naanidassanaappaṭigho nacittasampayutto dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ cittasampayuttaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nacittasampayutto dhammo uppajjati hetupaccayā ",
      " …pe… anidassanaappaṭighaṃ cittasampayuttaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nacittasampayutto ca naanidassanasappaṭigho nacittasampayutto ca dhammā uppajjanti hetupaccayā… hetuyā cha."
    ],
    "innerText": "114. Anidassanaappaṭighaṃ cittasampayuttaṃ dhammaṃ paṭicca naanidassanaappaṭigho nacittasampayutto dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ cittasampayuttaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nacittasampayutto dhammo uppajjati hetupaccayā …pe… anidassanaappaṭighaṃ cittasampayuttaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nacittasampayutto ca naanidassanasappaṭigho nacittasampayutto ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-59. Sanidassanattika-cittasaṃsaṭṭhadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "115"
      },
      ". Anidassanaappaṭighaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca naanidassanaappaṭigho nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nacittasaṃsaṭṭho ca naanidassanasappaṭigho nacittasaṃsaṭṭho ca dhammā uppajjanti hetupaccayā… hetuyā cha."
    ],
    "innerText": "115. Anidassanaappaṭighaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca naanidassanaappaṭigho nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nacittasaṃsaṭṭho dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ cittasaṃsaṭṭhaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nacittasaṃsaṭṭho ca naanidassanasappaṭigho nacittasaṃsaṭṭho ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-60. Sanidassanattika-cittasamuṭṭhānadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "116"
      },
      ". Anidassanaappaṭighaṃ ",
      " cittasamuṭṭhānaṃ dhammaṃ paṭicca naanidassanaappaṭigho nocittasamuṭṭhāno dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "116. Anidassanaappaṭighaṃ cittasamuṭṭhānaṃ dhammaṃ paṭicca naanidassanaappaṭigho nocittasamuṭṭhāno dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-61. Sanidassanattika-cittasahabhūdukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "117"
      },
      ". Anidassanaappaṭighaṃ ",
      " cittasahabhuṃ dhammaṃ paṭicca naanidassanaappaṭigho nocittasahabhū dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "117. Anidassanaappaṭighaṃ cittasahabhuṃ dhammaṃ paṭicca naanidassanaappaṭigho nocittasahabhū dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-62. Sanidassanattika-cittānuparivattidukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "118"
      },
      ". Anidassanaappaṭighaṃ cittānuparivattiṃ dhammaṃ paṭicca naanidassanaappaṭigho nocittānuparivattī dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "118. Anidassanaappaṭighaṃ cittānuparivattiṃ dhammaṃ paṭicca naanidassanaappaṭigho nocittānuparivattī dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-63-65. Sanidassanattika-cittasaṃsaṭṭhasamuṭṭhānādidukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "119"
      },
      ". Anidassanaappaṭighaṃ cittasaṃsaṭṭhasamuṭṭhānaṃ dhammaṃ paṭicca naanidassanaappaṭigho nocittasaṃsaṭṭhasamuṭṭhāno dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "119. Anidassanaappaṭighaṃ cittasaṃsaṭṭhasamuṭṭhānaṃ dhammaṃ paṭicca naanidassanaappaṭigho nocittasaṃsaṭṭhasamuṭṭhāno dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "120"
      },
      ". Anidassanaappaṭighaṃ cittasaṃsaṭṭhasamuṭṭhānasahabhuṃ dhammaṃ paṭicca naanidassanaappaṭigho nocittasaṃsaṭṭhasamuṭṭhānasahabhū dhammo uppajjati hetupaccayā ",
      "… hetuyā cha."
    ],
    "innerText": "120. Anidassanaappaṭighaṃ cittasaṃsaṭṭhasamuṭṭhānasahabhuṃ dhammaṃ paṭicca naanidassanaappaṭigho nocittasaṃsaṭṭhasamuṭṭhānasahabhū dhammo uppajjati hetupaccayā … hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "121"
      },
      ". Anidassanaappaṭighaṃ cittasaṃsaṭṭhasamuṭṭhānānuparivattiṃ dhammaṃ paṭicca naanidassanaappaṭigho nocittasaṃsaṭṭhasamuṭṭhānānuparivattī dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "121. Anidassanaappaṭighaṃ cittasaṃsaṭṭhasamuṭṭhānānuparivattiṃ dhammaṃ paṭicca naanidassanaappaṭigho nocittasaṃsaṭṭhasamuṭṭhānānuparivattī dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-66. Sanidassanattika-ajjhattadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "122"
      },
      ". Anidassanaappaṭighaṃ ajjhattikaṃ dhammaṃ paṭicca naanidassanaappaṭigho naajjhattiko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ ajjhattikaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naajjhattiko dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ ajjhattikaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naajjhattiko ca naanidassanasappaṭigho naajjhattiko ca dhammā uppajjanti hetupaccayā… hetuyā cha. Ārammaṇe tīṇi…pe… avigate cha."
    ],
    "innerText": "122. Anidassanaappaṭighaṃ ajjhattikaṃ dhammaṃ paṭicca naanidassanaappaṭigho naajjhattiko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ ajjhattikaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naajjhattiko dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ ajjhattikaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naajjhattiko ca naanidassanasappaṭigho naajjhattiko ca dhammā uppajjanti hetupaccayā… hetuyā cha. Ārammaṇe tīṇi…pe… avigate cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭighaṃ ",
      " bāhiraṃ dhammaṃ paṭicca nasanidassanasappaṭigho nabāhiro dhammo uppajjati hetupaccayā… hetuyā ",
      " ekādasa."
    ],
    "innerText": "Anidassanasappaṭighaṃ bāhiraṃ dhammaṃ paṭicca nasanidassanasappaṭigho nabāhiro dhammo uppajjati hetupaccayā… hetuyā ekādasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-67. Sanidassanattika-upādādukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "123"
      },
      ". Anidassanaappaṭighaṃ upādā dhammaṃ paṭicca nasanidassanasappaṭigho noupādā dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "123. Anidassanaappaṭighaṃ upādā dhammaṃ paṭicca nasanidassanasappaṭigho noupādā dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭighaṃ noupādā dhammaṃ paṭicca naanidassanasappaṭigho nanoupādā dhammo uppajjati hetupaccayā… cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ noupādā dhammaṃ paṭicca naanidassanaappaṭigho nanoupādā dhammo uppajjati hetupaccayā… cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭighaṃ noupādā ca anidassanaappaṭighaṃ noupādā ca dhammaṃ paṭicca nasanidassanasappaṭigho nanoupādā dhammo uppajjati hetupaccayā… cha. Hetuyā aṭṭhārasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-68. Sanidassanattika-upādinnadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "124"
      },
      ". Anidassanaappaṭighaṃ upādinnaṃ dhammaṃ paṭicca naanidassanaappaṭigho naupādinno dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ upādinnaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naupādinno dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ upādinnaṃ dhammaṃ ",
      " paṭicca nasanidassanasappaṭigho naupādinno ca naanidassanasappaṭigho naupādinno ca dhammā uppajjanti hetupaccayā… hetuyā cha."
    ],
    "innerText": "124. Anidassanaappaṭighaṃ upādinnaṃ dhammaṃ paṭicca naanidassanaappaṭigho naupādinno dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ upādinnaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naupādinno dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ upādinnaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naupādinno ca naanidassanasappaṭigho naupādinno ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "125"
      },
      ". Sanidassanasappaṭigho anupādinno dhammo nasanidassanasappaṭighassa naanupādinnassa dhammassa ārammaṇapaccayena paccayo. (Saṃkhittaṃ.) Ārammaṇe nava."
    ],
    "innerText": "125. Sanidassanasappaṭigho anupādinno dhammo nasanidassanasappaṭighassa naanupādinnassa dhammassa ārammaṇapaccayena paccayo. (Saṃkhittaṃ.) Ārammaṇe nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-69-82. Sanidassanattika-upādānādidukāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "126"
      },
      ". Anidassanaappaṭighaṃ ",
      " upādānaṃ dhammaṃ paṭicca naanidassanaappaṭigho noupādāno dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "126. Anidassanaappaṭighaṃ upādānaṃ dhammaṃ paṭicca naanidassanaappaṭigho noupādāno dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "127"
      },
      ". Anidassanaappaṭighaṃ kilesaṃ dhammaṃ paṭicca naanidassanaappaṭigho nokileso dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "127. Anidassanaappaṭighaṃ kilesaṃ dhammaṃ paṭicca naanidassanaappaṭigho nokileso dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-83. Sanidassanattika-dassanenapahātabbadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "128"
      },
      ". Anidassanaappaṭighaṃ ",
      " dassanena pahātabbaṃ dhammaṃ paṭicca naanidassanaappaṭigho nadassanena pahātabbo dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "128. Anidassanaappaṭighaṃ dassanena pahātabbaṃ dhammaṃ paṭicca naanidassanaappaṭigho nadassanena pahātabbo dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ nadassanena pahātabbaṃ dhammaṃ paccayā nasanidassanasappaṭigho ",
      " nanadassanena pahātabbo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ nadassanena pahātabbaṃ dhammaṃ paccayā naanidassanasappaṭigho nanadassanena pahātabbo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ nadassanena pahātabbaṃ dhammaṃ paccayā nasanidassanasappaṭigho nanadassanena pahātabbo ca naanidassanasappaṭigho nanadassanena pahātabbo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "Anidassanaappaṭighaṃ nadassanena pahātabbaṃ dhammaṃ paccayā nasanidassanasappaṭigho nanadassanena pahātabbo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ nadassanena pahātabbaṃ dhammaṃ paccayā naanidassanasappaṭigho nanadassanena pahātabbo dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ nadassanena pahātabbaṃ dhammaṃ paccayā nasanidassanasappaṭigho nanadassanena pahātabbo ca naanidassanasappaṭigho nanadassanena pahātabbo ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-84. Sanidassanattika-bhāvanāyapahātabbadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "129"
      },
      ". Anidassanaappaṭighaṃ bhāvanāya pahātabbaṃ dhammaṃ paṭicca naanidassanaappaṭigho nabhāvanāya pahātabbo dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "129. Anidassanaappaṭighaṃ bhāvanāya pahātabbaṃ dhammaṃ paṭicca naanidassanaappaṭigho nabhāvanāya pahātabbo dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ nabhāvanāya pahātabbaṃ dhammaṃ paccayā nasanidassanasappaṭigho nanabhāvanāya pahātabbo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-85. Sanidassanattika-dassanenapahātabbahetukadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "130"
      },
      ". Anidassanaappaṭighaṃ ",
      " dassanena pahātabbahetukaṃ dhammaṃ paṭicca naanidassanaappaṭigho ",
      " nadassanena pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "130. Anidassanaappaṭighaṃ dassanena pahātabbahetukaṃ dhammaṃ paṭicca naanidassanaappaṭigho nadassanena pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ nadassanena pahātabbahetukaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanadassanena pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-86. Sanidassanattika-bhāvanāyapahātabbahetukadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "131"
      },
      ". Anidassanaappaṭighaṃ ",
      " bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca naanidassanaappaṭigho nabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "131. Anidassanaappaṭighaṃ bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca naanidassanaappaṭigho nabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-87. Sanidassanattika-savitakkadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "132"
      },
      ". Anidassanaappaṭighaṃ savitakkaṃ dhammaṃ paṭicca naanidassanaappaṭigho ",
      " nasavitakko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ savitakkaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasavitakko dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ savitakkaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasavitakko ca naanidassanasappaṭigho nasavitakko ca dhammā uppajjanti hetupaccayā… hetuyā cha."
    ],
    "innerText": "132. Anidassanaappaṭighaṃ savitakkaṃ dhammaṃ paṭicca naanidassanaappaṭigho nasavitakko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ savitakkaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasavitakko dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ savitakkaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasavitakko ca naanidassanasappaṭigho nasavitakko ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "133"
      },
      ". Anidassanaappaṭighaṃ avitakkaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naavitakko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ avitakkaṃ dhammaṃ paṭicca naanidassanasappaṭigho naavitakko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ avitakkaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naavitakko ca naanidassanasappaṭigho naavitakko ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "133. Anidassanaappaṭighaṃ avitakkaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naavitakko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ avitakkaṃ dhammaṃ paṭicca naanidassanasappaṭigho naavitakko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ avitakkaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naavitakko ca naanidassanasappaṭigho naavitakko ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-88. Sanidassanattika-savicāradukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "134"
      },
      ". Anidassanaappaṭighaṃ ",
      " savicāraṃ dhammaṃ paṭicca naanidassanaappaṭigho nasavicāro dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "134. Anidassanaappaṭighaṃ savicāraṃ dhammaṃ paṭicca naanidassanaappaṭigho nasavicāro dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ avicāraṃ dhammaṃ paṭicca nasanidassanasappaṭigho naavicāro dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ ",
      " avicāraṃ dhammaṃ paṭicca naanidassanasappaṭigho naavicāro dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ avicāraṃ dhammaṃ paṭicca nasanidassanasappaṭigho naavicāro ca naanidassanasappaṭigho naavicāro ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
    ],
    "innerText": "Anidassanaappaṭighaṃ avicāraṃ dhammaṃ paṭicca nasanidassanasappaṭigho naavicāro dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ avicāraṃ dhammaṃ paṭicca naanidassanasappaṭigho naavicāro dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ avicāraṃ dhammaṃ paṭicca nasanidassanasappaṭigho naavicāro ca naanidassanasappaṭigho naavicāro ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-89. Sanidassanattika-sappītikadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "135"
      },
      ". Anidassanaappaṭighaṃ ",
      " sappītikaṃ dhammaṃ paṭicca naanidassanaappaṭigho nasappītiko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ sappītikaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasappītiko dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ sappītikaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasappītiko ca naanidassanasappaṭigho nasappītiko ca dhammā uppajjanti hetupaccayā… hetuyā cha."
    ],
    "innerText": "135. Anidassanaappaṭighaṃ sappītikaṃ dhammaṃ paṭicca naanidassanaappaṭigho nasappītiko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ sappītikaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasappītiko dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ sappītikaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nasappītiko ca naanidassanasappaṭigho nasappītiko ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ appītikaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naappītiko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ appītikaṃ dhammaṃ paṭicca naanidassanasappaṭigho naappītiko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ appītikaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naappītiko ca naanidassanasappaṭigho naappītiko ca dhammā uppajjanti hetupaccayā. Hetuyā ",
      " tīṇi."
    ],
    "innerText": "Anidassanaappaṭighaṃ appītikaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naappītiko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ appītikaṃ dhammaṃ paṭicca naanidassanasappaṭigho naappītiko dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ appītikaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naappītiko ca naanidassanasappaṭigho naappītiko ca dhammā uppajjanti hetupaccayā. Hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-90. Sanidassanattika-pītisahagatadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "136"
      },
      ". Anidassanaappaṭighaṃ pītisahagataṃ dhammaṃ paṭicca naanidassanaappaṭigho napītisahagato dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ pītisahagataṃ dhammaṃ paṭicca nasanidassanasappaṭigho ",
      " napītisahagato dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ pītisahagataṃ dhammaṃ paṭicca nasanidassanasappaṭigho napītisahagato ca naanidassanasappaṭigho napītisahagato ca dhammā uppajjanti hetupaccayā… hetuyā cha."
    ],
    "innerText": "136. Anidassanaappaṭighaṃ pītisahagataṃ dhammaṃ paṭicca naanidassanaappaṭigho napītisahagato dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ pītisahagataṃ dhammaṃ paṭicca nasanidassanasappaṭigho napītisahagato dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ pītisahagataṃ dhammaṃ paṭicca nasanidassanasappaṭigho napītisahagato ca naanidassanasappaṭigho napītisahagato ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ napītisahagataṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanapītisahagato dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-91. Sanidassanattika-sukhasahagatadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "137"
      },
      ". Anidassanaappaṭighaṃ sukhasahagataṃ dhammaṃ paṭicca naanidassanaappaṭigho nasukhasahagato dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "137. Anidassanaappaṭighaṃ sukhasahagataṃ dhammaṃ paṭicca naanidassanaappaṭigho nasukhasahagato dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ nasukhasahagataṃ dhammaṃ paṭicca nasanidassanasappaṭigho ",
      " nanasukhasahagato dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "Anidassanaappaṭighaṃ nasukhasahagataṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanasukhasahagato dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-92. Sanidassanattika-upekkhāsahagatadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "138"
      },
      ". Anidassanaappaṭighaṃ ",
      " upekkhāsahagataṃ dhammaṃ paṭicca naanidassanaappaṭigho naupekkhāsahagato dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ upekkhāsahagataṃ dhammaṃ paṭicca nasanidassanasappaṭigho naupekkhāsahagato dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ upekkhāsahagataṃ dhammaṃ paṭicca nasanidassanasappaṭigho naupekkhāsahagato ca naanidassanasappaṭigho naupekkhāsahagato ca dhammā uppajjanti hetupaccayā… hetuyā cha."
    ],
    "innerText": "138. Anidassanaappaṭighaṃ upekkhāsahagataṃ dhammaṃ paṭicca naanidassanaappaṭigho naupekkhāsahagato dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ upekkhāsahagataṃ dhammaṃ paṭicca nasanidassanasappaṭigho naupekkhāsahagato dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ upekkhāsahagataṃ dhammaṃ paṭicca nasanidassanasappaṭigho naupekkhāsahagato ca naanidassanasappaṭigho naupekkhāsahagato ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ naupekkhāsahagataṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanaupekkhāsahagato dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-93. Sanidassanattika-kāmāvacaradukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "139"
      },
      ". Anidassanaappaṭighaṃ ",
      " kāmāvacaraṃ dhammaṃ paṭicca nasanidassanasappaṭigho nakāmāvacaro dhammo uppajjati hetupaccayā… hetuyā ",
      " tīṇi."
    ],
    "innerText": "139. Anidassanaappaṭighaṃ kāmāvacaraṃ dhammaṃ paṭicca nasanidassanasappaṭigho nakāmāvacaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ nakāmāvacaraṃ dhammaṃ paṭicca naanidassanaappaṭigho nanakāmāvacaro dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ nakāmāvacaraṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanakāmāvacaro ca naanidassanasappaṭigho nanakāmāvacaro ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-94. Sanidassanattika-rūpāvacaradukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "140"
      },
      ". Anidassanaappaṭighaṃ rūpāvacaraṃ dhammaṃ paṭicca naanidassanaappaṭigho narūpāvacaro dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "140. Anidassanaappaṭighaṃ rūpāvacaraṃ dhammaṃ paṭicca naanidassanaappaṭigho narūpāvacaro dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ narūpāvacaraṃ dhammaṃ paṭicca nasanidassanasappaṭigho nanarūpāvacaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-95. Sanidassanattika-arūpāvacaradukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "141"
      },
      ". Anidassanaappaṭighaṃ arūpāvacaraṃ dhammaṃ paṭicca naanidassanaappaṭigho naarūpāvacaro dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "141. Anidassanaappaṭighaṃ arūpāvacaraṃ dhammaṃ paṭicca naanidassanaappaṭigho naarūpāvacaro dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ ",
      " naarūpāvacaraṃ dhammaṃ paccayā nasanidassanasappaṭigho nanaarūpāvacaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "Anidassanaappaṭighaṃ naarūpāvacaraṃ dhammaṃ paccayā nasanidassanasappaṭigho nanaarūpāvacaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-96. Sanidassanattika-pariyāpannadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "142"
      },
      ". Anidassanaappaṭighaṃ pariyāpannaṃ dhammaṃ paccayā nasanidassanasappaṭigho napariyāpanno dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "142. Anidassanaappaṭighaṃ pariyāpannaṃ dhammaṃ paccayā nasanidassanasappaṭigho napariyāpanno dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ ",
      " apariyāpannaṃ dhammaṃ paṭicca naanidassanaappaṭigho naapariyāpanno dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ apariyāpannaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naapariyāpanno dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ apariyāpannaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naapariyāpanno ca naanidassanasappaṭigho naapariyāpanno ca dhammā uppajjanti hetupaccayā… hetuyā cha."
    ],
    "innerText": "Anidassanaappaṭighaṃ apariyāpannaṃ dhammaṃ paṭicca naanidassanaappaṭigho naapariyāpanno dhammo uppajjati hetupaccayā. Anidassanaappaṭighaṃ apariyāpannaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naapariyāpanno dhammo uppajjati hetupaccayā…pe… anidassanaappaṭighaṃ apariyāpannaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naapariyāpanno ca naanidassanasappaṭigho naapariyāpanno ca dhammā uppajjanti hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-97. Sanidassanattika-niyyānikadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "143"
      },
      ". Anidassanaappaṭighaṃ niyyānikaṃ dhammaṃ paṭicca naanidassanaappaṭigho naniyyāniko dhammo uppajjati hetupaccayā… hetuyā ",
      " cha."
    ],
    "innerText": "143. Anidassanaappaṭighaṃ niyyānikaṃ dhammaṃ paṭicca naanidassanaappaṭigho naniyyāniko dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ aniyyānikaṃ dhammaṃ paccayā nasanidassanasappaṭigho naaniyyāniko dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-98. Sanidassanattika-niyatadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "144"
      },
      ". Anidassanaappaṭighaṃ niyataṃ dhammaṃ paṭicca naanidassanaappaṭigho naniyato dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "144. Anidassanaappaṭighaṃ niyataṃ dhammaṃ paṭicca naanidassanaappaṭigho naniyato dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ aniyataṃ dhammaṃ paccayā nasanidassanasappaṭigho naaniyato dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-99. Sanidassanattika-sauttaradukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "145"
      },
      ". Anidassanaappaṭighaṃ sauttaraṃ dhammaṃ paccayā nasanidassanasappaṭigho nasauttaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
    ],
    "innerText": "145. Anidassanaappaṭighaṃ sauttaraṃ dhammaṃ paccayā nasanidassanasappaṭigho nasauttaro dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ anuttaraṃ dhammaṃ paṭicca naanidassanaappaṭigho naanuttaro dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-100. Sanidassanattika-saraṇadukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "146"
      },
      ". Anidassanaappaṭighaṃ ",
      " saraṇaṃ dhammaṃ paṭicca naanidassanaappaṭigho nasaraṇo dhammo uppajjati hetupaccayā… hetuyā cha."
    ],
    "innerText": "146. Anidassanaappaṭighaṃ saraṇaṃ dhammaṃ paṭicca naanidassanaappaṭigho nasaraṇo dhammo uppajjati hetupaccayā… hetuyā cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ araṇaṃ dhammaṃ paccayā nasanidassanasappaṭigho naaraṇo dhammo uppajjati hetupaccayā… hetuyā tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Sahajātavārampi…pe… sampayuttavārampi paṭiccavārasadisaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "147"
      },
      ". Sanidassanasappaṭigho araṇo dhammo nasanidassanasappaṭighassa naaraṇassa dhammassa ārammaṇapaccayena paccayo."
    ],
    "innerText": "147. Sanidassanasappaṭigho araṇo dhammo nasanidassanasappaṭighassa naaraṇassa dhammassa ārammaṇapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Yathā kusalattike pañhāvārassa anulomampi paccanīyampi anulomapaccanīyampi paccanīyānulomampi gaṇitaṃ, evaṃ gaṇetabbaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhammānulomapaccanīye tikadukapaṭṭhānaṃ niṭṭhitaṃ."
  }
]