[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "9. Iddhipādavibhaṅgo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Suttantabhājanīyavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "431"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhi"
      },
      "-saddassa ",
      " paṭhamo kattuattho, dutiyo karaṇattho vutto, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāda"
      },
      "-saddassa eko karaṇamevattho vutto. Pajjitabbāva iddhi vuttā, na ca ijjhantī pajjitabbā ca iddhi pajjanakaraṇena pādena samānādhikaraṇā hotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paṭhamenatthena iddhi eva pādo iddhipādo’’"
      },
      "ti na sakkā vattuṃ, tathā iddhikiriyākaraṇena sādhetabbā ca vuddhisaṅkhātā iddhi pajjanakiriyākaraṇena pajjitabbāti dvinnaṃ karaṇānaṃ na asamānādhikaraṇatā sambhavatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dutiyenatthena iddhiyā pādo iddhipādo’’"
      },
      "ti ca na sakkā vattuṃ, tasmā paṭhamenatthena iddhiyā pādo iddhipādo, dutiyenatthena iddhi eva pādo iddhipādoti evaṃ yojanā yujjati."
    ],
    "innerText": "431.Iddhi-saddassa paṭhamo kattuattho, dutiyo karaṇattho vutto, pāda-saddassa eko karaṇamevattho vutto. Pajjitabbāva iddhi vuttā, na ca ijjhantī pajjitabbā ca iddhi pajjanakaraṇena pādena samānādhikaraṇā hotīti ‘‘paṭhamenatthena iddhi eva pādo iddhipādo’’ti na sakkā vattuṃ, tathā iddhikiriyākaraṇena sādhetabbā ca vuddhisaṅkhātā iddhi pajjanakiriyākaraṇena pajjitabbāti dvinnaṃ karaṇānaṃ na asamānādhikaraṇatā sambhavatīti ‘‘dutiyenatthena iddhiyā pādo iddhipādo’’ti ca na sakkā vattuṃ, tasmā paṭhamenatthena iddhiyā pādo iddhipādo, dutiyenatthena iddhi eva pādo iddhipādoti evaṃ yojanā yujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Chandaṃ ce…pe… ayaṃ vuccati chandasamādhī’’ti imāya pāḷiyā chandādhipati samādhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chandasamādhī"
      },
      "ti adhipati-saddalopaṃ katvā samāso vuttoti viññāyati, adhipati-saddatthadassanavasena pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘chandahetuko chandādhiko vā samādhi chandasamādhī’’"
      },
      "ti aṭṭhakathāyaṃ vuttanti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padhānabhūtā"
      },
      "ti vīriyabhūtāti keci vadanti. Saṅkhatasaṅkhārādinivattanatthañhi padhānaggahaṇanti. Atha vā taṃ taṃ visesaṃ saṅkharotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅkhāro,"
      },
      " sabbaṃ vīriyaṃ. Tattha catukiccasādhakato aññassa nivattanatthaṃ padhānaggahaṇanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padhānabhūtā"
      },
      " seṭṭhabhūtāti attho. Catubbidhassa pana vīriyassa adhippetattā bahuvacananiddeso kato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhiṭṭhānaṭṭhenā"
      },
      "ti duvidhatthāyapi iddhiyā adhiṭṭhānatthena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pādabhūta"
      },
      "nti iminā visuṃ samāsayojanāvasena pana yo pubbe iddhipādattho pāda-saddassa upāyatthataṃ gahetvā yathāyutto vutto, so vakkhamānānaṃ paṭilābhapubbabhāgānaṃ kattukaraṇiddhibhāvaṃ, uttaracūḷabhājanīye vā vuttehi ",
      " chandādīhi iddhipādehi sādhetabbāya iddhiyā kattiddhibhāvaṃ, chandādīnañca karaṇiddhibhāvaṃ sandhāya vuttoti veditabbo."
    ],
    "innerText": "‘‘Chandaṃ ce…pe… ayaṃ vuccati chandasamādhī’’ti imāya pāḷiyā chandādhipati samādhi chandasamādhīti adhipati-saddalopaṃ katvā samāso vuttoti viññāyati, adhipati-saddatthadassanavasena pana ‘‘chandahetuko chandādhiko vā samādhi chandasamādhī’’ti aṭṭhakathāyaṃ vuttanti veditabbaṃ. Padhānabhūtāti vīriyabhūtāti keci vadanti. Saṅkhatasaṅkhārādinivattanatthañhi padhānaggahaṇanti. Atha vā taṃ taṃ visesaṃ saṅkharotīti saṅkhāro, sabbaṃ vīriyaṃ. Tattha catukiccasādhakato aññassa nivattanatthaṃ padhānaggahaṇanti padhānabhūtā seṭṭhabhūtāti attho. Catubbidhassa pana vīriyassa adhippetattā bahuvacananiddeso kato. Adhiṭṭhānaṭṭhenāti duvidhatthāyapi iddhiyā adhiṭṭhānatthena. Pādabhūtanti iminā visuṃ samāsayojanāvasena pana yo pubbe iddhipādattho pāda-saddassa upāyatthataṃ gahetvā yathāyutto vutto, so vakkhamānānaṃ paṭilābhapubbabhāgānaṃ kattukaraṇiddhibhāvaṃ, uttaracūḷabhājanīye vā vuttehi chandādīhi iddhipādehi sādhetabbāya iddhiyā kattiddhibhāvaṃ, chandādīnañca karaṇiddhibhāvaṃ sandhāya vuttoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vīriyiddhipādaniddese ‘‘vīriyasamādhipadhānasaṅkhārasamannāgata’’nti dvikkhattuṃ vīriyaṃ āgataṃ. Tattha purimaṃ samādhivisesanaṃ ‘‘vīriyādhipati samādhi vīriyasamādhī’’ti, dutiyaṃ samannāgamaṅgadassanaṃ. Dveyeva hi sabbattha samannāgamaṅgāni samādhi padhānasaṅkhāro ca, chandādayo samādhivisesanāni, padhānasaṅkhāro ",
      " pana padhānavacaneneva visesito, na chandādīhīti na idha vīriyādhipatitā padhānasaṅkhārassa vuttā hoti. Vīriyañca samādhiṃ visesetvā ṭhitameva samannāgamaṅgavasena padhānasaṅkhāravacanena vuttanti nāpi dvīhi vīriyehi samannāgamo vutto hotīti. Yasmā pana chandādīhi visiṭṭho samādhi, tathā visiṭṭheneva ca tena sampayutto padhānasaṅkhāro sesadhammā ca, tasmā samādhivisesanānaṃ vasena cattāro iddhipādā vuttā. Visesanabhāvo ca chandādīnaṃ taṃtaṃavassayanavasena hotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘chandasamādhi…pe… iddhipāda’’"
      },
      "nti ettha nissayatthepi pāda-sadde upāyatthena chandādīnaṃ iddhipādatā vuttā hoti. Teneva uttaracūḷabhājanīye ‘‘cattāro iddhipādā chandiddhipādo’’tiādinā chandādīnameva iddhipādatā vuttā. Pañhapucchake ca ‘‘cattāro iddhipādā idha bhikkhu chandasamādhī’’tiādināva (vibha. 462) uddesaṃ katvāpi puna chandādīnaṃyeva kusalādibhāvo vibhattoti. Upāyiddhipādadassanatthameva hi nissayiddhipādadassanaṃ kataṃ, aññathā catubbidhatā na hotīti ayamettha pāḷivasena atthavinicchayo veditabbo."
    ],
    "innerText": "Vīriyiddhipādaniddese ‘‘vīriyasamādhipadhānasaṅkhārasamannāgata’’nti dvikkhattuṃ vīriyaṃ āgataṃ. Tattha purimaṃ samādhivisesanaṃ ‘‘vīriyādhipati samādhi vīriyasamādhī’’ti, dutiyaṃ samannāgamaṅgadassanaṃ. Dveyeva hi sabbattha samannāgamaṅgāni samādhi padhānasaṅkhāro ca, chandādayo samādhivisesanāni, padhānasaṅkhāro pana padhānavacaneneva visesito, na chandādīhīti na idha vīriyādhipatitā padhānasaṅkhārassa vuttā hoti. Vīriyañca samādhiṃ visesetvā ṭhitameva samannāgamaṅgavasena padhānasaṅkhāravacanena vuttanti nāpi dvīhi vīriyehi samannāgamo vutto hotīti. Yasmā pana chandādīhi visiṭṭho samādhi, tathā visiṭṭheneva ca tena sampayutto padhānasaṅkhāro sesadhammā ca, tasmā samādhivisesanānaṃ vasena cattāro iddhipādā vuttā. Visesanabhāvo ca chandādīnaṃ taṃtaṃavassayanavasena hotīti ‘‘chandasamādhi…pe… iddhipāda’’nti ettha nissayatthepi pāda-sadde upāyatthena chandādīnaṃ iddhipādatā vuttā hoti. Teneva uttaracūḷabhājanīye ‘‘cattāro iddhipādā chandiddhipādo’’tiādinā chandādīnameva iddhipādatā vuttā. Pañhapucchake ca ‘‘cattāro iddhipādā idha bhikkhu chandasamādhī’’tiādināva (vibha. 462) uddesaṃ katvāpi puna chandādīnaṃyeva kusalādibhāvo vibhattoti. Upāyiddhipādadassanatthameva hi nissayiddhipādadassanaṃ kataṃ, aññathā catubbidhatā na hotīti ayamettha pāḷivasena atthavinicchayo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "433"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rathadhure"
      },
      "ti rathassa purato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hīnajātiko"
      },
      " caṇḍālo upaṭṭhānādiguṇayogepi senāpatiṭṭhānādīni na labhatīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘jātiṃ sodhetvā…pe… jātiṃ avassayatī’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amantanīyo"
      },
      "ti hitāhitamantane na araho."
    ],
    "innerText": "433.Rathadhureti rathassa purato. Hīnajātiko caṇḍālo upaṭṭhānādiguṇayogepi senāpatiṭṭhānādīni na labhatīti āha ‘‘jātiṃ sodhetvā…pe… jātiṃ avassayatī’’ti. Amantanīyoti hitāhitamantane na araho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Raṭṭhapālatthero chande sati kathaṃ nānujānissantīti sattapi bhattāni abhuñjitvā mātāpitaro anujānāpetvā pabbajitvā chandameva avassāya lokuttaradhammaṃ nibbattesīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘raṭṭhapālatthero viyā’’"
      },
      "ti."
    ],
    "innerText": "Raṭṭhapālatthero chande sati kathaṃ nānujānissantīti sattapi bhattāni abhuñjitvā mātāpitaro anujānāpetvā pabbajitvā chandameva avassāya lokuttaradhammaṃ nibbattesīti āha ‘‘raṭṭhapālatthero viyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mogharājatthero"
      },
      " vīmaṃsaṃ avassayīti tassa bhagavā ‘‘suññato lokaṃ avekkhassū’’ti (su. ni. 1125) suññatākathaṃ ",
      " kathesi, paññānissitamānaniggahatthañca dvikkhattuṃ pucchito pañhaṃ na kathesi. Tattha punappunaṃ chanduppādanaṃ tosanaṃ viya hotīti chandassa upaṭṭhānasadisatā vuttā, thāmabhāvato vīriyassa sūrattasadisatā, ‘‘chadvārādhipati rājā’’ti (dha. pa. aṭṭha. 2.181 erakapattanāgarājavatthu) vacanato pubbaṅgamattā cittassa visiṭṭhajātisadisatā."
    ],
    "innerText": "Mogharājatthero vīmaṃsaṃ avassayīti tassa bhagavā ‘‘suññato lokaṃ avekkhassū’’ti (su. ni. 1125) suññatākathaṃ kathesi, paññānissitamānaniggahatthañca dvikkhattuṃ pucchito pañhaṃ na kathesi. Tattha punappunaṃ chanduppādanaṃ tosanaṃ viya hotīti chandassa upaṭṭhānasadisatā vuttā, thāmabhāvato vīriyassa sūrattasadisatā, ‘‘chadvārādhipati rājā’’ti (dha. pa. aṭṭha. 2.181 erakapattanāgarājavatthu) vacanato pubbaṅgamattā cittassa visiṭṭhajātisadisatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhedato"
      },
      "ti ",
      " chandādike tayo tayo dhamme sampiṇḍetvā, iddhiiddhipāde amissetvā vā kathananti attho. Tattha chandavīriyādayo visesena ijjhanti etāyāti iddhīti vuccanti, ijjhatīti iddhīti avisesena samādhipadhānasaṅkhārāpīti."
    ],
    "innerText": "Abhedatoti chandādike tayo tayo dhamme sampiṇḍetvā, iddhiiddhipāde amissetvā vā kathananti attho. Tattha chandavīriyādayo visesena ijjhanti etāyāti iddhīti vuccanti, ijjhatīti iddhīti avisesena samādhipadhānasaṅkhārāpīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Chandiddhipādasamādhiddhipādādayo visiṭṭhā, pādo sabbiddhīnaṃ sādhāraṇattā avisiṭṭho, tasmā visiṭṭhesveva pavesaṃ avatvā avisiṭṭhe ca pavesaṃ vattuṃ yuttanti dassetuṃ sabbattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pāde patiṭṭhātipi vattuṃ vaṭṭatī’’"
      },
      "ti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthevā"
      },
      "ti chandasamādhipadhānasaṅkhāraiddhipādesu, catūsu chandādikesvevāti attho. ‘‘Chandavato ko samādhi na ijjhissatī’’ti samādhibhāvanāmukhena bhāvitā samādhibhāvitā."
    ],
    "innerText": "Chandiddhipādasamādhiddhipādādayo visiṭṭhā, pādo sabbiddhīnaṃ sādhāraṇattā avisiṭṭho, tasmā visiṭṭhesveva pavesaṃ avatvā avisiṭṭhe ca pavesaṃ vattuṃ yuttanti dassetuṃ sabbattha ‘‘pāde patiṭṭhātipi vattuṃ vaṭṭatī’’ti āha. Tatthevāti chandasamādhipadhānasaṅkhāraiddhipādesu, catūsu chandādikesvevāti attho. ‘‘Chandavato ko samādhi na ijjhissatī’’ti samādhibhāvanāmukhena bhāvitā samādhibhāvitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ettha panā"
      },
      "ti bhedakathāyaṃ abhedakathanato abhinavaṃ natthīti attho. Ye hi tayo dhammā abhedakathāyaṃ iddhiiddhipādotveva vuttā, te eva bhedakathāyaṃ iddhīpi honti iddhipādāpi, sesā iddhipādā evāti evaṃ abhinavābhāvaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘chando samādhī’’"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ime hi tayo…pe… na vinā,"
      },
      " tasmā sesā sampayuttakā cattāro khandhā tesaṃ tiṇṇaṃ ijjhanena iddhi nāma bhaveyyuṃ, na attano sabhāvenāti te iddhipādā eva honti, na iddhīti evamidaṃ purimassa kāraṇabhāvena vuttanti veditabbaṃ. Atha vā tiṇṇaṃ iddhitā iddhipādatā ca vuttā, sesānañca iddhipādatāva, taṃ sabbaṃ sādhetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ime hi tayo…pe… na vinā’’"
      },
      "ti āha. Tena yasmā ijjhanti, tasmā iddhi. Ijjhamānā ca yasmā sampayuttakehi saheva ijjhanti, na vinā, tasmā sampayuttakā iddhipādā, tadantogadhattā pana te tayo dhammā iddhipādāpi hontīti dasseti. Sampayuttakānampi pana khandhānaṃ iddhibhāvapariyāyo atthīti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sampayuttakā panā’’"
      },
      "tiādimāha. Catūsu khandhesu ekadesassa iddhitā, catunnampi ‘‘iddhiyā pādo iddhipādo’’ti iminā atthena iddhipādatā, punapi catunnaṃ khandhānaṃ ‘‘iddhi eva pādo iddhipādo’’ti iminā atthena iddhipādatā ca dassitā, na aññassāti katvā āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na aññassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kassaci adhivacana’’"
      },
      "nti. Iminā ‘‘iddhi nāma anipphannā’’ti idaṃ vādaṃ paṭisedheti."
    ],
    "innerText": "Ettha panāti bhedakathāyaṃ abhedakathanato abhinavaṃ natthīti attho. Ye hi tayo dhammā abhedakathāyaṃ iddhiiddhipādotveva vuttā, te eva bhedakathāyaṃ iddhīpi honti iddhipādāpi, sesā iddhipādā evāti evaṃ abhinavābhāvaṃ dassento ‘‘chando samādhī’’tiādimāha. Ime hi tayo…pe… na vinā, tasmā sesā sampayuttakā cattāro khandhā tesaṃ tiṇṇaṃ ijjhanena iddhi nāma bhaveyyuṃ, na attano sabhāvenāti te iddhipādā eva honti, na iddhīti evamidaṃ purimassa kāraṇabhāvena vuttanti veditabbaṃ. Atha vā tiṇṇaṃ iddhitā iddhipādatā ca vuttā, sesānañca iddhipādatāva, taṃ sabbaṃ sādhetuṃ ‘‘ime hi tayo…pe… na vinā’’ti āha. Tena yasmā ijjhanti, tasmā iddhi. Ijjhamānā ca yasmā sampayuttakehi saheva ijjhanti, na vinā, tasmā sampayuttakā iddhipādā, tadantogadhattā pana te tayo dhammā iddhipādāpi hontīti dasseti. Sampayuttakānampi pana khandhānaṃ iddhibhāvapariyāyo atthīti dassetuṃ ‘‘sampayuttakā panā’’tiādimāha. Catūsu khandhesu ekadesassa iddhitā, catunnampi ‘‘iddhiyā pādo iddhipādo’’ti iminā atthena iddhipādatā, punapi catunnaṃ khandhānaṃ ‘‘iddhi eva pādo iddhipādo’’ti iminā atthena iddhipādatā ca dassitā, na aññassāti katvā āha ‘‘na aññassakassaci adhivacana’’nti. Iminā ‘‘iddhi nāma anipphannā’’ti idaṃ vādaṃ paṭisedheti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭilābhapubbabhāgānaṃ paṭilābhasseva ca iddhiiddhipādatāvacanaṃ apubbanti katvā pucchati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kenaṭṭhena iddhi, kenaṭṭhena pādo’’"
      },
      "ti. Paṭilābho pubbabhāgo ",
      " cāti vacanaseso. Upāyo ca upāyabhāveneva attano phalassa patiṭṭhā hotīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘patiṭṭhānaṭṭheneva pādo’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chandoyeva…pe… vīmaṃsāva vīmaṃsiddhipādoti kathitaṃ,"
      },
      " tasmā na cattāro khandhā iddhiyā samānakālikā nānākkhaṇikā vā iddhipādā, jeṭṭhakabhūtā pana chandādayo eva sabbattha iddhipādāti ayameva tesaṃ aṭṭhakathācariyānaṃ adhippāyo. Suttantabhājanīye hi abhidhammabhājanīye ca samādhivisesanavasena dassitānaṃ upāyabhūtānaṃ iddhipādānaṃ pākaṭakaraṇatthaṃ uttaracūḷabhājanīyaṃ vuttanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kecī"
      },
      "ti uttaravihāravāsitherā kira."
    ],
    "innerText": "Paṭilābhapubbabhāgānaṃ paṭilābhasseva ca iddhiiddhipādatāvacanaṃ apubbanti katvā pucchati ‘‘kenaṭṭhena iddhi, kenaṭṭhena pādo’’ti. Paṭilābho pubbabhāgo cāti vacanaseso. Upāyo ca upāyabhāveneva attano phalassa patiṭṭhā hotīti āha ‘‘patiṭṭhānaṭṭheneva pādo’’ti. Chandoyeva…pe… vīmaṃsāva vīmaṃsiddhipādoti kathitaṃ, tasmā na cattāro khandhā iddhiyā samānakālikā nānākkhaṇikā vā iddhipādā, jeṭṭhakabhūtā pana chandādayo eva sabbattha iddhipādāti ayameva tesaṃ aṭṭhakathācariyānaṃ adhippāyo. Suttantabhājanīye hi abhidhammabhājanīye ca samādhivisesanavasena dassitānaṃ upāyabhūtānaṃ iddhipādānaṃ pākaṭakaraṇatthaṃ uttaracūḷabhājanīyaṃ vuttanti. Kecīti uttaravihāravāsitherā kira."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Suttantabhājanīyavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Abhidhammabhājanīyavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "444"
      },
      ". Abhidhammabhājanīye ‘‘iddhipādoti tathābhūtassa phasso…pe… paggāho avikkhepo’’ti (vibha. 447) iddhiiddhipādatthadassanatthaṃ paggāhāvikkhepā vuttā, cittapaññā ca saṅkhipitvāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattāri nayasahassāni vibhattānī"
      },
      "ti idaṃ sādhipativārānaṃ paripuṇṇānaṃ abhāvā vicāretabbaṃ. Na hi adhipatīnaṃ adhipatayo vijjanti, ekekasmiṃ pana iddhipādaniddese ekeko adhipativāro labbhatīti soḷasa soḷasa nayasatāni labbhanti."
    ],
    "innerText": "444. Abhidhammabhājanīye ‘‘iddhipādoti tathābhūtassa phasso…pe… paggāho avikkhepo’’ti (vibha. 447) iddhiiddhipādatthadassanatthaṃ paggāhāvikkhepā vuttā, cittapaññā ca saṅkhipitvāti. Cattāri nayasahassāni vibhattānīti idaṃ sādhipativārānaṃ paripuṇṇānaṃ abhāvā vicāretabbaṃ. Na hi adhipatīnaṃ adhipatayo vijjanti, ekekasmiṃ pana iddhipādaniddese ekeko adhipativāro labbhatīti soḷasa soḷasa nayasatāni labbhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhidhammabhājanīyavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Pañhapucchakavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nanu ",
      " ca cattāropi adhipatayo ekakkhaṇe labbhanti, aññamaññassa pana adhipatayo na bhavanti ‘‘cattāro iddhipādā na maggādhipatino’’ti vuttattā. Rājaputtopamāpi hi etamatthaṃ dīpetīti? Na, ekakkhaṇe dutiyassa adhipatino abhāvato eva, ‘‘na maggādhipatino’’ti vuttattā rājaputtopamā adhipatiṃ na karontīti imamevatthaṃ dīpeti, na adhipatīnaṃ sahabhāvaṃ. Taṃ kathaṃ jānitabbanti? Paṭikkhittattā. Adhipatipaccayaniddese ",
      " hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathāyaṃ"
      },
      " (paṭṭhā. aṭṭha. 1.3) vuttā ‘‘kasmā pana yathā hetupaccayaniddese ‘hetū hetusampayuttakāna’nti vuttaṃ, evamidha ‘adhipatī adhipatisampayuttakāna’nti avatvā ‘chandādhipati chandasampayuttakāna’ntiādinā nayena desanā katāti? Ekakkhaṇe abhāvato’’ti. Sati ca catunnaṃ adhipatīnaṃ sahabhāve ‘‘ariyamaggasamaṅgissa vīmaṃsādhipateyyaṃ maggaṃ bhāventassā’’ti visesanaṃ na kattabbaṃ siyā avīmaṃsādhipatikassa maggassa abhāvā. Chandādīnaṃ aññamaññādhipatikaraṇabhāve ca ‘‘vīmaṃsaṃ ṭhapetvā taṃsampayutto’’tiādinā chandādīnaṃ vīmaṃsādhipatikattavacanaṃ na vattabbaṃ siyā. Tathā ‘‘cattāro ariyamaggā siyā maggādhipatino, siyā na vattabbā maggādhipatino’’ti (dha. sa. 1429) evamādīhipi adhipatīnaṃ sahabhāvo paṭikkhitto evāti."
    ],
    "innerText": "Nanu ca cattāropi adhipatayo ekakkhaṇe labbhanti, aññamaññassa pana adhipatayo na bhavanti ‘‘cattāro iddhipādā na maggādhipatino’’ti vuttattā. Rājaputtopamāpi hi etamatthaṃ dīpetīti? Na, ekakkhaṇe dutiyassa adhipatino abhāvato eva, ‘‘na maggādhipatino’’ti vuttattā rājaputtopamā adhipatiṃ na karontīti imamevatthaṃ dīpeti, na adhipatīnaṃ sahabhāvaṃ. Taṃ kathaṃ jānitabbanti? Paṭikkhittattā. Adhipatipaccayaniddese hi aṭṭhakathāyaṃ (paṭṭhā. aṭṭha. 1.3) vuttā ‘‘kasmā pana yathā hetupaccayaniddese ‘hetū hetusampayuttakāna’nti vuttaṃ, evamidha ‘adhipatī adhipatisampayuttakāna’nti avatvā ‘chandādhipati chandasampayuttakāna’ntiādinā nayena desanā katāti? Ekakkhaṇe abhāvato’’ti. Sati ca catunnaṃ adhipatīnaṃ sahabhāve ‘‘ariyamaggasamaṅgissa vīmaṃsādhipateyyaṃ maggaṃ bhāventassā’’ti visesanaṃ na kattabbaṃ siyā avīmaṃsādhipatikassa maggassa abhāvā. Chandādīnaṃ aññamaññādhipatikaraṇabhāve ca ‘‘vīmaṃsaṃ ṭhapetvā taṃsampayutto’’tiādinā chandādīnaṃ vīmaṃsādhipatikattavacanaṃ na vattabbaṃ siyā. Tathā ‘‘cattāro ariyamaggā siyā maggādhipatino, siyā na vattabbā maggādhipatino’’ti (dha. sa. 1429) evamādīhipi adhipatīnaṃ sahabhāvo paṭikkhitto evāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañhapucchakavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iddhipādavibhaṅgavaṇṇanā niṭṭhitā."
  }
]