[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "4. Upādinnattikavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "51"
      },
      ". Upādinnupādāniyattikassa ",
      " pañhāvāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vatthu upādāniyānaṃ khandhānaṃ purejātapaccayena paccayo"
      },
      "ti pavattiṃ sandhāya vuttaṃ. Paṭisandhiyaṃ pana taṃ purejātaṃ na hoti."
    ],
    "innerText": "51. Upādinnupādāniyattikassa pañhāvāre vatthu upādāniyānaṃ khandhānaṃ purejātapaccayena paccayoti pavattiṃ sandhāya vuttaṃ. Paṭisandhiyaṃ pana taṃ purejātaṃ na hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "72"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upādinnupādāniyo kabaḷīkāro āhāro upādinnupādāniyassa kāyassa āhārapaccayena paccayo"
      },
      "ti ettha upādinnupādāniyo kabaḷīkārāhāro nāma kammasamuṭṭhānānaṃ rūpānaṃ abbhantaragatā ojā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upādinnupādāniyassa kāyassā"
      },
      "ti tasseva kammasamuṭṭhānarūpakāyassa āhārapaccayena paccayo. Rūpajīvitindriyaṃ viya kaṭattārūpānaṃ anupālanaupatthambhanavasena paccayo, na janakavasena. Yaṃ pana maṇḍūkādayo gilitvā ṭhitānaṃ ahiādīnaṃ kāyassa jīvamānakamaṇḍūkādisarīre ojā āhārapaccayena ",
      " paccayoti vadanti, taṃ na gahetabbaṃ. Na hi jīvamānakasarīre ojā aññassa sarīrassa āhārapaccayataṃ sādheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupādinnupādāniyassa kāyassā"
      },
      "ti ettha pana janakavasenāpi labbhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upādinnupādāniyassa ca anupādinnupādāniyassa"
      },
      " cāti ettha ekassa upatthambhakavasena, ekassa janakavasena, ubhinnampi vā upatthambhakavaseneva vutto. Dve pana āhārā ekato paccayā hontā upatthambhakāva honti, na janakā. Sesamettha pāḷimeva sādhukaṃ oloketvā veditabbaṃ."
    ],
    "innerText": "72.Upādinnupādāniyo kabaḷīkāro āhāro upādinnupādāniyassa kāyassa āhārapaccayena paccayoti ettha upādinnupādāniyo kabaḷīkārāhāro nāma kammasamuṭṭhānānaṃ rūpānaṃ abbhantaragatā ojā. Upādinnupādāniyassa kāyassāti tasseva kammasamuṭṭhānarūpakāyassa āhārapaccayena paccayo. Rūpajīvitindriyaṃ viya kaṭattārūpānaṃ anupālanaupatthambhanavasena paccayo, na janakavasena. Yaṃ pana maṇḍūkādayo gilitvā ṭhitānaṃ ahiādīnaṃ kāyassa jīvamānakamaṇḍūkādisarīre ojā āhārapaccayena paccayoti vadanti, taṃ na gahetabbaṃ. Na hi jīvamānakasarīre ojā aññassa sarīrassa āhārapaccayataṃ sādheti. Anupādinnupādāniyassa kāyassāti ettha pana janakavasenāpi labbhati. Upādinnupādāniyassa ca anupādinnupādāniyassa cāti ettha ekassa upatthambhakavasena, ekassa janakavasena, ubhinnampi vā upatthambhakavaseneva vutto. Dve pana āhārā ekato paccayā hontā upatthambhakāva honti, na janakā. Sesamettha pāḷimeva sādhukaṃ oloketvā veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Upādinnattikavaṇṇanā."
  }
]