[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "22. Sanidassanasappaṭighattikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paṭiccavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paccayānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Vibhaṅgavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetupaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Anidassanasappaṭighaṃ ",
      " dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati hetupaccayā – anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ. Anidassanasappaṭighe mahābhūte paṭicca anidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ…pe…. (1)"
    ],
    "innerText": "1. Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati hetupaccayā – anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ. Anidassanasappaṭighe mahābhūte paṭicca anidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭighaṃ dhammaṃ paṭicca sanidassanasappaṭigho dhammo uppajjati hetupaccayā – anidassanasappaṭighe mahābhūte paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca rūpāyatanaṃ. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati hetupaccayā – anidassanasappaṭighe mahābhūte paṭicca anidassanaappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca āpodhātu, itthindriyaṃ…pe… kabaḷīkāro āhāro. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭighaṃ ",
      " dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanasappaṭighe mahābhūte paṭicca sanidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca rūpāyatanaṃ, āpodhātu, indriyaṃ…pe… kabaḷīkāro ",
      " āhāro. (4)"
    ],
    "innerText": "Anidassanasappaṭighaṃ dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanasappaṭighe mahābhūte paṭicca sanidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca rūpāyatanaṃ, āpodhātu, indriyaṃ…pe… kabaḷīkāro āhāro. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā āpodhātu ca, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ āpodhātu ca. Anidassanasappaṭighe mahābhūte paṭicca anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ, āpodhātu, itthindriyaṃ…pe… kabaḷīkāro āhāro. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭighaṃ ",
      " dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanasappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanasappaṭighe mahābhūte paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca rūpāyatanaṃ, cakkhāyatanaṃ…pe… rasāyatanaṃ. (6)"
    ],
    "innerText": "Anidassanasappaṭighaṃ dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanasappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanasappaṭighe mahābhūte paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca rūpāyatanaṃ, cakkhāyatanaṃ…pe… rasāyatanaṃ. (6)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭighaṃ dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanasappaṭighe mahābhūte paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca rūpāyatanaṃ, cakkhāyatanaṃ…pe… rasāyatanaṃ, āpodhātu, itthindriyaṃ…pe… kabaḷīkāro āhāro. (7)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati hetupaccayā – anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo ",
      " khandhā anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ…pe… dve khandhe paṭicca dve khandhā anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanaappaṭighañca kaṭattārūpaṃ…pe… dve khandhe…pe… khandhe paṭicca vatthu, vatthuṃ paṭicca ",
      " khandhā. Āpodhātuṃ paṭicca anidassanaappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca itthindriyaṃ…pe… kabaḷīkāro āhāro. (1)"
    ],
    "innerText": "2. Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati hetupaccayā – anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ…pe… dve khandhe paṭicca dve khandhā anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanaappaṭighañca kaṭattārūpaṃ…pe… dve khandhe…pe… khandhe paṭicca vatthu, vatthuṃ paṭicca khandhā. Āpodhātuṃ paṭicca anidassanaappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca itthindriyaṃ…pe… kabaḷīkāro āhāro. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ dhammaṃ paṭicca sanidassanasappaṭigho dhammo uppajjati hetupaccayā – anidassanaappaṭighe khandhe paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ. Āpodhātuṃ paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca rūpāyatanaṃ. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati hetupaccayā – anidassanaappaṭighe khandhe paṭicca anidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe paṭicca anidassanasappaṭighaṃ kaṭattārūpaṃ. Āpodhātuṃ paṭicca anidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ ",
      " dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā sanidassanasappaṭighañca anidassanaappaṭighañca ",
      " cittasamuṭṭhānaṃ rūpaṃ…pe… dve khandhe…pe… paṭisandhikkhaṇe anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā. Sanidassanasappaṭighañca anidassanaappaṭighañca kaṭattārūpaṃ…pe… dve khandhe…pe… āpodhātuṃ paṭicca sanidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca rūpāyatanaṃ, itthindriyaṃ…pe… kabaḷīkāro āhāro. (4)"
    ],
    "innerText": "Anidassanaappaṭighaṃ dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā sanidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ…pe… dve khandhe…pe… paṭisandhikkhaṇe anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā. Sanidassanasappaṭighañca anidassanaappaṭighañca kaṭattārūpaṃ…pe… dve khandhe…pe… āpodhātuṃ paṭicca sanidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca rūpāyatanaṃ, itthindriyaṃ…pe… kabaḷīkāro āhāro. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ…pe… dve khandhe…pe… paṭisandhikkhaṇe anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanasappaṭighañca anidassanaappaṭighañca kaṭattārūpaṃ…pe… dve khandhe…pe… āpodhātuṃ paṭicca anidassanasappaṭighañca ",
      " anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ, itthindriyaṃ…pe… kabaḷīkāro āhāro. (5)"
    ],
    "innerText": "Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ…pe… dve khandhe…pe… paṭisandhikkhaṇe anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanasappaṭighañca anidassanaappaṭighañca kaṭattārūpaṃ…pe… dve khandhe…pe… āpodhātuṃ paṭicca anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ, itthindriyaṃ…pe… kabaḷīkāro āhāro. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanasappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanaappaṭighe khandhe paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca kaṭattārūpaṃ. Āpodhātuṃ paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca cittasamuṭṭhānaṃ ",
      " rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca rūpāyatanaṃ, cakkhāyatanaṃ…pe… rasāyatanaṃ. (6)"
    ],
    "innerText": "Anidassanaappaṭighaṃ dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanasappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanaappaṭighe khandhe paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca kaṭattārūpaṃ. Āpodhātuṃ paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca rūpāyatanaṃ, cakkhāyatanaṃ…pe… rasāyatanaṃ. (6)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā sanidassanasappaṭighañca anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ…pe… dve khandhe…pe… paṭisandhikkhaṇe anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā sanidassanasappaṭighañca anidassanasappaṭighañca anidassanaappaṭighañca kaṭattārūpaṃ…pe… dve khandhe…pe… āpodhātuṃ paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ ",
      " paṭicca rūpāyatanaṃ cakkhāyatanaṃ…pe… rasāyatanaṃ, itthindriyaṃ…pe… kabaḷīkāro āhāro. (7)"
    ],
    "innerText": "Anidassanaappaṭighaṃ dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā sanidassanasappaṭighañca anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ…pe… dve khandhe…pe… paṭisandhikkhaṇe anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā sanidassanasappaṭighañca anidassanasappaṭighañca anidassanaappaṭighañca kaṭattārūpaṃ…pe… dve khandhe…pe… āpodhātuṃ paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca rūpāyatanaṃ cakkhāyatanaṃ…pe… rasāyatanaṃ, itthindriyaṃ…pe… kabaḷīkāro āhāro. (7)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho dhammo uppajjati hetupaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ. Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca rūpāyatanaṃ. (1)"
    ],
    "innerText": "3. Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho dhammo uppajjati hetupaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ. Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca rūpāyatanaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭighañca ",
      " anidassanaappaṭighañca ",
      " dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati hetupaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca anidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca anidassanasappaṭighaṃ kaṭattārūpaṃ. Anidassanasappaṭighaṃ ekaṃ mahābhūtañca āpodhātuñca paṭicca dve mahābhūtā, dve mahābhūte ca āpodhātuñca paṭicca ekaṃ mahābhūtaṃ. Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca anidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ. (2)"
    ],
    "innerText": "Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati hetupaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca anidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca anidassanasappaṭighaṃ kaṭattārūpaṃ. Anidassanasappaṭighaṃ ekaṃ mahābhūtañca āpodhātuñca paṭicca dve mahābhūtā, dve mahābhūte ca āpodhātuñca paṭicca ekaṃ mahābhūtaṃ. Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca anidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati hetupaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca anidassanaappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca anidassanaappaṭighaṃ kaṭattārūpaṃ. Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca anidassanaappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca itthindriyaṃ…pe… kabaḷīkāro āhāro. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighañca anidassanaappaṭighañca ",
      " cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighañca anidassanaappaṭighañca kaṭattārūpaṃ ",
      ". Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca rūpāyatanaṃ, itthindriyaṃ…pe… kabaḷīkāro āhāro. (4)"
    ],
    "innerText": "Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighañca anidassanaappaṭighañca kaṭattārūpaṃ . Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca rūpāyatanaṃ, itthindriyaṃ…pe… kabaḷīkāro āhāro. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe ",
      " anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca anidassanasappaṭighañca anidassanaappaṭighañca kaṭattārūpaṃ. Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭatārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ, itthindriyaṃ…pe… kabaḷīkāro āhāro. (5)"
    ],
    "innerText": "Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca anidassanasappaṭighañca anidassanaappaṭighañca kaṭattārūpaṃ. Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭatārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ, itthindriyaṃ…pe… kabaḷīkāro āhāro. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanasappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe ",
      " khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca kaṭattārūpaṃ. Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca rūpāyatanaṃ, cakkhāyatanaṃ…pe… rasāyatanaṃ. (6)"
    ],
    "innerText": "Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanasappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca kaṭattārūpaṃ. Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca rūpāyatanaṃ, cakkhāyatanaṃ…pe… rasāyatanaṃ. (6)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca anidassanaappaṭighañca kaṭattārūpaṃ. Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ ",
      ". Phoṭṭhabbāyatanañca āpodhātuñca paṭicca rūpāyatanaṃ, cakkhāyatanaṃ…pe… rasāyatanaṃ, itthindriyaṃ…pe… kabaḷīkāro āhāro. (7)"
    ],
    "innerText": "Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho ca anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti hetupaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca anidassanaappaṭighañca kaṭattārūpaṃ. Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighañca anidassanasappaṭighañca anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ . Phoṭṭhabbāyatanañca āpodhātuñca paṭicca rūpāyatanaṃ, cakkhāyatanaṃ…pe… rasāyatanaṃ, itthindriyaṃ…pe… kabaḷīkāro āhāro. (7)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ārammaṇapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati ārammaṇapaccayā – anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe ",
      " …pe… paṭisandhikkhaṇe anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe…pe… vatthuṃ paṭicca ",
      " khandhā. (1)"
    ],
    "innerText": "4. Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati ārammaṇapaccayā – anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe …pe… paṭisandhikkhaṇe anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe…pe… vatthuṃ paṭicca khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Adhipatipaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati adhipatipaccayā – anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ. Anidassanasappaṭighe mahābhūte paṭicca cittasamuṭṭhānaṃ rūpaṃ upādārūpaṃ. (1)"
    ],
    "innerText": "5. Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati adhipatipaccayā – anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ. Anidassanasappaṭighe mahābhūte paṭicca cittasamuṭṭhānaṃ rūpaṃ upādārūpaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Anidassanasappaṭighamūlake iminā kāraṇena satta pañhā vibhajitabbā, pariyosānapadā natthi.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati adhipatipaccayā – anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ…pe… dve khandhe…pe… āpodhātuṃ paṭicca anidassanaappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ upādārūpaṃ."
    ],
    "innerText": "6. Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati adhipatipaccayā – anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanaappaṭighañca cittasamuṭṭhānaṃ rūpaṃ…pe… dve khandhe…pe… āpodhātuṃ paṭicca anidassanaappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ upādārūpaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Iminā kāraṇena anidassanaappaṭighamūlake satta pañhā vibhajitabbā, niṭṭhānapadā natthi.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho dhammo uppajjati adhipatipaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ. Anidassanaappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ upādārūpaṃ."
    ],
    "innerText": "7. Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho dhammo uppajjati adhipatipaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ. Anidassanaappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ upādārūpaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Iminā kāraṇena sattapi pañhā vibhajitabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Anantara-samanantarapaccayā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ". Anidassanaappaṭighaṃ ",
      " dhammaṃ paṭicca anidassanaappaṭigho dhammo ",
      " uppajjati anantarapaccayā… samanantarapaccayā (ārammaṇasadisaṃ)."
    ],
    "innerText": "8. Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati anantarapaccayā… samanantarapaccayā (ārammaṇasadisaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sahajātapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ". Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati sahajātapaccayā – anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ. Anidassanasappaṭighe mahābhūte paṭicca anidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā…pe…."
    ],
    "innerText": "9. Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati sahajātapaccayā – anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ. Anidassanasappaṭighe mahābhūte paṭicca anidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Anidassanasappaṭighamūlakā satta pañhā iminā kāraṇena vibhajitabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ". Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati sahajātapaccayā – anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanaappaṭighaṃ cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe…pe… paṭisandhikkhaṇe anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanaappaṭighaṃ kaṭattā ca rūpaṃ…pe… dve khandhe…pe… khandhe paṭicca vatthu, vatthuṃ paṭicca khandhā. Āpodhātuṃ paṭicca anidassanaappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca itthindriyaṃ…pe… kabaḷīkāro āhāro. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ āpodhātuṃ paṭicca anidassanaappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ."
    ],
    "innerText": "10. Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati sahajātapaccayā – anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanaappaṭighaṃ cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe…pe… paṭisandhikkhaṇe anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanaappaṭighaṃ kaṭattā ca rūpaṃ…pe… dve khandhe…pe… khandhe paṭicca vatthu, vatthuṃ paṭicca khandhā. Āpodhātuṃ paṭicca anidassanaappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca itthindriyaṃ…pe… kabaḷīkāro āhāro. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ āpodhātuṃ paṭicca anidassanaappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Anidassanaappaṭighamūlake satta pañhā iminā kāraṇena kātabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". Anidassanasappaṭighañca ",
      " anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho dhammo uppajjati sahajātapaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ ",
      " cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ. Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ ",
      " cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca rūpāyatanaṃ. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ."
    ],
    "innerText": "11. Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho dhammo uppajjati sahajātapaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ. Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca rūpāyatanaṃ. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Iminā kāraṇena satta pañhā vibhajitabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Aññamaññapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ". Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati aññamaññapaccayā – anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ. (1)"
    ],
    "innerText": "12. Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati aññamaññapaccayā – anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati aññamaññapaccayā – anidassanasappaṭighe mahābhūte paṭicca āpodhātu. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā uppajjanti aññamaññapaccayā – anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā āpodhātu ca, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ āpodhātu ca. Bāhiraṃ…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". Anidassanaappaṭighaṃ ",
      " dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati aññamaññapaccayā – anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe…pe… paṭisandhikkhaṇe anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā vatthu ca…pe… dve khandhe…pe… khandhe paṭicca vatthu, vatthuṃ paṭicca khandhā. (1)"
    ],
    "innerText": "13. Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati aññamaññapaccayā – anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe…pe… paṭisandhikkhaṇe anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā vatthu ca…pe… dve khandhe…pe… khandhe paṭicca vatthu, vatthuṃ paṭicca khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭighaṃ ",
      " dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati aññamaññapaccayā – āpodhātuṃ paṭicca anidassanasappaṭighā mahābhūtā. Bāhiraṃ…pe…. (2)"
    ],
    "innerText": "Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati aññamaññapaccayā – āpodhātuṃ paṭicca anidassanasappaṭighā mahābhūtā. Bāhiraṃ…pe…. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati aññamaññapaccayā – anidassanasappaṭighaṃ ekaṃ mahābhūtañca āpodhātuñca paṭicca dve mahābhūtā, dve mahābhūte ca āpodhātuñca paṭicca ekaṃ mahābhūtaṃ. Bāhiraṃ…pe…. (1)"
    ],
    "innerText": "14. Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati aññamaññapaccayā – anidassanasappaṭighaṃ ekaṃ mahābhūtañca āpodhātuñca paṭicca dve mahābhūtā, dve mahābhūte ca āpodhātuñca paṭicca ekaṃ mahābhūtaṃ. Bāhiraṃ…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nissayapaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". Anidassanasappaṭighaṃ ",
      " dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati nissayapaccayā… upanissayapaccayā… purejātapaccayā… āsevanapaccayā… kammapaccayā… vipākapaccayā… āhārapaccayā… indriyapaccayā… jhānapaccayā… maggapaccayā… sampayuttapaccayā… vippayuttapaccayā… atthipaccayā… natthipaccayā… vigatapaccayā… avigatapaccayā."
    ],
    "innerText": "15. Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati nissayapaccayā… upanissayapaccayā… purejātapaccayā… āsevanapaccayā… kammapaccayā… vipākapaccayā… āhārapaccayā… indriyapaccayā… jhānapaccayā… maggapaccayā… sampayuttapaccayā… vippayuttapaccayā… atthipaccayā… natthipaccayā… vigatapaccayā… avigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paccayānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Saṅkhyāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Suddhaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". Hetuyā ekavīsa, ārammaṇe ekaṃ, adhipatiyā ekavīsa, anantare ekaṃ, samanantare ekaṃ, sahajāte ekavīsa, aññamaññe cha, nissaye ekavīsa, upanissaye ekaṃ, purejāte ekaṃ, āsevane ekaṃ, kamme ekavīsa, vipāke āhāre ekavīsa, indriye ekavīsa, jhāne ",
      " magge ekavīsa, sampayutte ekaṃ, vippayutte ekavīsa, atthiyā ekavīsa, natthiyā ekaṃ, vigate ekaṃ, avigate ekavīsa (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "16. Hetuyā ekavīsa, ārammaṇe ekaṃ, adhipatiyā ekavīsa, anantare ekaṃ, samanantare ekaṃ, sahajāte ekavīsa, aññamaññe cha, nissaye ekavīsa, upanissaye ekaṃ, purejāte ekaṃ, āsevane ekaṃ, kamme ekavīsa, vipāke āhāre ekavīsa, indriye ekavīsa, jhāne magge ekavīsa, sampayutte ekaṃ, vippayutte ekavīsa, atthiyā ekavīsa, natthiyā ekaṃ, vigate ekaṃ, avigate ekavīsa (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anulomaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Paccayapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Vibhaṅgavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nahetupaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ". Anidassanasappaṭighaṃ ",
      " dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati nahetupaccayā – anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ. Anidassanasappaṭighe mahābhūte paṭicca anidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ, mahābhūte paṭicca…pe…."
    ],
    "innerText": "17. Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati nahetupaccayā – anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ. Anidassanasappaṭighe mahābhūte paṭicca anidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ, mahābhūte paṭicca…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Anidassanasappaṭighamūlake iminā kāraṇena sattapi pañhā vibhajitabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". Anidassanaappaṭighaṃ ",
      " dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati nahetupaccayā – ahetukaṃ anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanaappaṭighañca cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe…pe… ahetukapaṭisandhikkhaṇe anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanaappaṭighañca kaṭattārūpaṃ…pe… khandhe paṭicca vatthu, vatthuṃ paṭicca khandhā. Āpodhātuṃ paṭicca anidassanaappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca ",
      " itthindriyaṃ…pe… kabaḷīkāro āhāro. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ āpodhātuṃ paṭicca anidassanaappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ. Vicikicchāsahagate uddhaccasahagate khandhe paṭicca vicikicchāsahagato uddhaccasahagato moho."
    ],
    "innerText": "18. Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati nahetupaccayā – ahetukaṃ anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanaappaṭighañca cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe…pe… ahetukapaṭisandhikkhaṇe anidassanaappaṭighaṃ ekaṃ khandhaṃ paṭicca tayo khandhā anidassanaappaṭighañca kaṭattārūpaṃ…pe… khandhe paṭicca vatthu, vatthuṃ paṭicca khandhā. Āpodhātuṃ paṭicca anidassanaappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca itthindriyaṃ…pe… kabaḷīkāro āhāro. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ āpodhātuṃ paṭicca anidassanaappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ. Vicikicchāsahagate uddhaccasahagate khandhe paṭicca vicikicchāsahagato uddhaccasahagato moho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Anidassanaappaṭighamūlakā iminā kāraṇena satta pañhā vibhajitabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ". Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho dhammo ",
      " uppajjati nahetupaccayā – ahetuke anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ. Ahetukapaṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ. Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca rūpāyatanaṃ. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ."
    ],
    "innerText": "19. Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho dhammo uppajjati nahetupaccayā – ahetuke anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ. Ahetukapaṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ. Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca rūpāyatanaṃ. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Iminā kāraṇena satta pañhā vitthāretabbā asammohantena.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Naārammaṇapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati naārammaṇapaccayā – anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ. Anidassanasappaṭighe mahābhūte paṭicca anidassanasappaṭighaṃ cittasamuṭṭhānaṃ ",
      " rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ. Bāhiraṃ… āhārasamuṭṭhānaṃ… ",
      ", utusamuṭṭhānaṃ… asaññasattānaṃ anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ…pe…."
    ],
    "innerText": "20. Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati naārammaṇapaccayā – anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ. Anidassanasappaṭighe mahābhūte paṭicca anidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ. Bāhiraṃ… āhārasamuṭṭhānaṃ… , utusamuṭṭhānaṃ… asaññasattānaṃ anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Anidassanasappaṭighamūlakā iminā kāraṇena sattapi pañhā vitthāretabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati naārammaṇapaccayā – anidassanaappaṭighe khandhe paṭicca anidassanaappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe paṭicca anidassanaappaṭighaṃ kaṭattārūpaṃ. Khandhe paṭicca vatthu…pe… āpodhātuṃ paṭicca anidassanaappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca itthindriyaṃ…pe… kabaḷīkāro āhāro. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ āpodhātuṃ paṭicca anidassanaappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ."
    ],
    "innerText": "21. Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati naārammaṇapaccayā – anidassanaappaṭighe khandhe paṭicca anidassanaappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe paṭicca anidassanaappaṭighaṃ kaṭattārūpaṃ. Khandhe paṭicca vatthu…pe… āpodhātuṃ paṭicca anidassanaappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Āpodhātuṃ paṭicca itthindriyaṃ…pe… kabaḷīkāro āhāro. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ āpodhātuṃ paṭicca anidassanaappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "(Anidassanaappaṭighamūlake ",
      " iminā kāraṇena sattapi pañhā vitthāretabbā.)"
    ],
    "innerText": "(Anidassanaappaṭighamūlake iminā kāraṇena sattapi pañhā vitthāretabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho dhammo uppajjati naārammaṇapaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ. Anidassanasappaṭighe mahābhūte ",
      " ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca rūpāyatanaṃ. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ."
    ],
    "innerText": "22. Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho dhammo uppajjati naārammaṇapaccayā – anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe anidassanaappaṭighe khandhe ca mahābhūte ca paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ. Anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanañca āpodhātuñca paṭicca rūpāyatanaṃ. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Ghaṭane iminā kāraṇena sattapi pañhā vibhajitabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Naadhipatipaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati naadhipatipaccayā (sahajātasadisaṃ)… naanantarapaccayā… nasamanantarapaccayā… naaññamaññapaccayā – anidassanasappaṭighe mahābhūte paṭicca anidassanasappaṭighaṃ ",
      " cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ… bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ mahābhūte paṭicca anidassanasappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ."
    ],
    "innerText": "23. Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati naadhipatipaccayā (sahajātasadisaṃ)… naanantarapaccayā… nasamanantarapaccayā… naaññamaññapaccayā – anidassanasappaṭighe mahābhūte paṭicca anidassanasappaṭighaṃ cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. Phoṭṭhabbāyatanaṃ paṭicca cakkhāyatanaṃ…pe… rasāyatanaṃ… bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ mahābhūte paṭicca anidassanasappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Iminā kāraṇena ekavīsa pañhā vibhajitabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Naupanissayapaccayā… napurejātapaccayā… napacchājātapaccayā… naāsevanapaccayā… nakammapaccayā – bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ. Anidassanasappaṭighe mahābhūte paṭicca anidassanasappaṭighaṃ upādārūpaṃ (kammaṃ vibhajitvā nakammeneva ekavīsa pañhā ",
      " kātabbā), navipākapaccayā (paṭisandhipi kaṭattāpi natthi, pañcavokāreyeva kātabbā), naāhārapaccayā ",
      " – bāhiraṃ… utusamuṭṭhānaṃ… asaññasattānaṃ…pe… (iminā kāraṇena vibhajitabbā ekavīsāpi)."
    ],
    "innerText": "Naupanissayapaccayā… napurejātapaccayā… napacchājātapaccayā… naāsevanapaccayā… nakammapaccayā – bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ paṭicca dve mahābhūtā, dve mahābhūte paṭicca ekaṃ mahābhūtaṃ. Anidassanasappaṭighe mahābhūte paṭicca anidassanasappaṭighaṃ upādārūpaṃ (kammaṃ vibhajitvā nakammeneva ekavīsa pañhā kātabbā), navipākapaccayā (paṭisandhipi kaṭattāpi natthi, pañcavokāreyeva kātabbā), naāhārapaccayā – bāhiraṃ… utusamuṭṭhānaṃ… asaññasattānaṃ…pe… (iminā kāraṇena vibhajitabbā ekavīsāpi)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Naindriyapaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ". Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati naindriyapaccayā – bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ…pe… asaññasattānaṃ mahābhūte paṭicca rūpajīvitindriyaṃ (saṃkhittaṃ, sabbe pañhā vibhajitabbā)… najhānapaccayā – bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ ekaṃ mahābhūtaṃ (saṃkhittaṃ, sattapi pañhā vibhajitabbā)."
    ],
    "innerText": "24. Anidassanasappaṭighaṃ dhammaṃ paṭicca anidassanasappaṭigho dhammo uppajjati naindriyapaccayā – bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ…pe… asaññasattānaṃ mahābhūte paṭicca rūpajīvitindriyaṃ (saṃkhittaṃ, sabbe pañhā vibhajitabbā)… najhānapaccayā – bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ ekaṃ mahābhūtaṃ (saṃkhittaṃ, sattapi pañhā vibhajitabbā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭighaṃ dhammaṃ paṭicca anidassanaappaṭigho dhammo uppajjati najhānapaccayā – pañcaviññāṇasahagataṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe…pe… bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ āpodhātuṃ paṭicca anidassanaappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Evaṃ sattapi pañhā vibhajitabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho dhammo uppajjati najhānapaccayā – bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… ",
      ", asaññasattānaṃ…pe… anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ."
    ],
    "innerText": "25. Anidassanasappaṭighañca anidassanaappaṭighañca dhammaṃ paṭicca sanidassanasappaṭigho dhammo uppajjati najhānapaccayā – bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… , asaññasattānaṃ…pe… anidassanasappaṭighe mahābhūte ca āpodhātuñca paṭicca sanidassanasappaṭighaṃ kaṭattārūpaṃ upādārūpaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Evaṃ sattapi pañhā vibhajitabbā), namaggapaccayā… (nahetusadisaṃ kātabbaṃ. Paripuṇṇaṃ. Moho natthi). Nasampayuttapaccayā… navippayuttapaccayā (paripuṇṇaṃ)… nonatthipaccayā… novigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Paccayapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Saṅkhyāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Suddhaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". Nahetuyā ",
      " ekavīsa, naārammaṇe ekavīsa, naadhipatiyā ekavīsa ",
      " (saṃkhittaṃ, sabbattha ekavīsa), nonatthiyā ekavīsa, novigate ekavīsa (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "26. Nahetuyā ekavīsa, naārammaṇe ekavīsa, naadhipatiyā ekavīsa (saṃkhittaṃ, sabbattha ekavīsa), nonatthiyā ekavīsa, novigate ekavīsa (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccanīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Paccayānulomapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      ". Hetupaccayā naārammaṇe ekavīsa, naadhipatiyā ekavīsa…pe… nakamme ekaṃ, navipāke ekavīsa, nasampayutte ekavīsa, navippayutte ekaṃ, nonatthiyā ekavīsa, novigate ekavīsa (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "27. Hetupaccayā naārammaṇe ekavīsa, naadhipatiyā ekavīsa…pe… nakamme ekaṃ, navipāke ekavīsa, nasampayutte ekavīsa, navippayutte ekaṃ, nonatthiyā ekavīsa, novigate ekavīsa (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anulomapaccanīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4. Paccayapaccanīyānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nahetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      ". Nahetupaccayā ārammaṇe ekaṃ, anantare ekaṃ, samanantare ekaṃ, sahajāte ekavīsa ",
      " …pe… jhāne ekavīsa, magge ekaṃ, sampayutte ekaṃ ",
      ", vippayutte ekavīsa, atthiyā ekavīsa, natthiyā ekaṃ, vigate ekaṃ, avigate ekavīsa (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "28. Nahetupaccayā ārammaṇe ekaṃ, anantare ekaṃ, samanantare ekaṃ, sahajāte ekavīsa …pe… jhāne ekavīsa, magge ekaṃ, sampayutte ekaṃ , vippayutte ekavīsa, atthiyā ekavīsa, natthiyā ekaṃ, vigate ekaṃ, avigate ekavīsa (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccanīyānulomaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭiccavāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2-6. Sahajāta-paccaya-nissaya-saṃsaṭṭha-sampayuttavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Sahajātavāropi paccayavāropi nissayavāropi paṭiccavārasadisā, saṃsaṭṭhavāropi sampayuttavāropi arūpeyeva kātabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "7. Pañhāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paccayānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Vibhaṅgavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetupaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "29"
      },
      ". Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa hetupaccayena paccayo – anidassanaappaṭighā hetū sampayuttakānaṃ khandhānaṃ anidassanaappaṭighānañca cittasamuṭṭhānānaṃ rūpānaṃ hetupaccayena ",
      " paccayo. Paṭisandhikkhaṇe anidassanaappaṭighā hetū sampayuttakānaṃ khandhānaṃ anidassanaappaṭighānañca kaṭattārūpānaṃ hetupaccayena paccayo. (1)"
    ],
    "innerText": "29. Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa hetupaccayena paccayo – anidassanaappaṭighā hetū sampayuttakānaṃ khandhānaṃ anidassanaappaṭighānañca cittasamuṭṭhānānaṃ rūpānaṃ hetupaccayena paccayo. Paṭisandhikkhaṇe anidassanaappaṭighā hetū sampayuttakānaṃ khandhānaṃ anidassanaappaṭighānañca kaṭattārūpānaṃ hetupaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa dhammassa hetupaccayena paccayo – anidassanaappaṭighā hetū sanidassanasappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ hetupaccayena paccayo. Paṭisandhikkhaṇe…pe…. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "(Anidassanaappaṭighamūlakeyeva ",
      " iminā kāraṇena satta pañhā vibhajitabbā.)"
    ],
    "innerText": "(Anidassanaappaṭighamūlakeyeva iminā kāraṇena satta pañhā vibhajitabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ārammaṇapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ". Sanidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa ārammaṇapaccayena paccayo – rūpe aniccato dukkhato anattato vipassati, assādeti abhinandati, taṃ ārabbha rāgo uppajjati, diṭṭhi uppajjati, vicikicchā uppajjati, uddhaccaṃ uppajjati, domanassaṃ uppajjati, dibbena cakkhunā ",
      " rūpaṃ passati, rūpāyatanaṃ cakkhuviññāṇassa ārammaṇapaccayena paccayo. Sanidassanasappaṭighā khandhā iddhividhañāṇassa, pubbenivāsānussatiñāṇassa, anāgataṃsañāṇassa, āvajjanāya ārammaṇapaccayena paccayo. (1)"
    ],
    "innerText": "30. Sanidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa ārammaṇapaccayena paccayo – rūpe aniccato dukkhato anattato vipassati, assādeti abhinandati, taṃ ārabbha rāgo uppajjati, diṭṭhi uppajjati, vicikicchā uppajjati, uddhaccaṃ uppajjati, domanassaṃ uppajjati, dibbena cakkhunā rūpaṃ passati, rūpāyatanaṃ cakkhuviññāṇassa ārammaṇapaccayena paccayo. Sanidassanasappaṭighā khandhā iddhividhañāṇassa, pubbenivāsānussatiñāṇassa, anāgataṃsañāṇassa, āvajjanāya ārammaṇapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa ārammaṇapaccayena paccayo. Cakkhuṃ…pe… kāyaṃ… sadde… gandhe… rase… phoṭṭhabbe… aniccato…pe… domanassaṃ uppajjati, dibbāya sotadhātuyā saddaṃ suṇāti, saddāyatanaṃ sotaviññāṇassa…pe… phoṭṭhabbāyatanaṃ kāyaviññāṇassa…pe… anidassanasappaṭighā khandhā iddhividhañāṇassa ",
      ", pubbenivāsānussatiñāṇassa, anāgataṃsañāṇassa, āvajjanāya ārammaṇapaccayena paccayo. (1)"
    ],
    "innerText": "Anidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa ārammaṇapaccayena paccayo. Cakkhuṃ…pe… kāyaṃ… sadde… gandhe… rase… phoṭṭhabbe… aniccato…pe… domanassaṃ uppajjati, dibbāya sotadhātuyā saddaṃ suṇāti, saddāyatanaṃ sotaviññāṇassa…pe… phoṭṭhabbāyatanaṃ kāyaviññāṇassa…pe… anidassanasappaṭighā khandhā iddhividhañāṇassa , pubbenivāsānussatiñāṇassa, anāgataṃsañāṇassa, āvajjanāya ārammaṇapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ". Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa ārammaṇapaccayena paccayo – dānaṃ datvā sīlaṃ samādiyitvā uposathakammaṃ katvā taṃ paccavekkhati, pubbe suciṇṇāni paccavekkhati, jhānā…pe… ariyā maggā vuṭṭhahitvā maggaṃ paccavekkhanti, phalaṃ paccavekkhanti, nibbānaṃ paccavekkhanti, nibbānaṃ gotrabhussa, vodānassa, maggassa, phalassa, āvajjanāya ārammaṇapaccayena paccayo. Ariyā pahīne kilese paccavekkhanti, vikkhambhite kilese paccavekkhanti, pubbe samudāciṇṇe kilese jānanti…pe… vatthuṃ… itthindriyaṃ… purisindriyaṃ… jīvitindriyaṃ… āpodhātuṃ… kabaḷīkāraṃ āhāraṃ… anidassanaappaṭighe khandhe aniccato…pe… domanassaṃ uppajjati, cetopariyañāṇena anidassanaappaṭighacittasamaṅgissa cittaṃ jānāti, ākāsānañcāyatanaṃ viññāṇañcāyatanassa ārammaṇapaccayena paccayo. Ākiñcaññāyatanaṃ nevasaññānāsaññāyatanassa…pe… anidassanaappaṭighā ",
      " khandhā iddhividhañāṇassa, cetopariyañāṇassa, pubbenivāsānussatiñāṇassa, yathākammūpagañāṇassa, anāgataṃsañāṇassa, āvajjanāya ārammaṇapaccayena paccayo. (1)"
    ],
    "innerText": "31. Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa ārammaṇapaccayena paccayo – dānaṃ datvā sīlaṃ samādiyitvā uposathakammaṃ katvā taṃ paccavekkhati, pubbe suciṇṇāni paccavekkhati, jhānā…pe… ariyā maggā vuṭṭhahitvā maggaṃ paccavekkhanti, phalaṃ paccavekkhanti, nibbānaṃ paccavekkhanti, nibbānaṃ gotrabhussa, vodānassa, maggassa, phalassa, āvajjanāya ārammaṇapaccayena paccayo. Ariyā pahīne kilese paccavekkhanti, vikkhambhite kilese paccavekkhanti, pubbe samudāciṇṇe kilese jānanti…pe… vatthuṃ… itthindriyaṃ… purisindriyaṃ… jīvitindriyaṃ… āpodhātuṃ… kabaḷīkāraṃ āhāraṃ… anidassanaappaṭighe khandhe aniccato…pe… domanassaṃ uppajjati, cetopariyañāṇena anidassanaappaṭighacittasamaṅgissa cittaṃ jānāti, ākāsānañcāyatanaṃ viññāṇañcāyatanassa ārammaṇapaccayena paccayo. Ākiñcaññāyatanaṃ nevasaññānāsaññāyatanassa…pe… anidassanaappaṭighā khandhā iddhividhañāṇassa, cetopariyañāṇassa, pubbenivāsānussatiñāṇassa, yathākammūpagañāṇassa, anāgataṃsañāṇassa, āvajjanāya ārammaṇapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Adhipatipaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "32"
      },
      ". Sanidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa adhipatipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇādhipati"
      },
      " – rūpaṃ garuṃ katvā assādeti abhinandati, taṃ garuṃ katvā rāgo uppajjati, diṭṭhi uppajjati. (1)"
    ],
    "innerText": "32. Sanidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa adhipatipaccayena paccayo. Ārammaṇādhipati – rūpaṃ garuṃ katvā assādeti abhinandati, taṃ garuṃ katvā rāgo uppajjati, diṭṭhi uppajjati. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭigho ",
      " dhammo anidassanaappaṭighassa dhammassa adhipatipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇādhipati"
      },
      " – cakkhuṃ…pe… kāyaṃ… sadde… gandhe… rase… phoṭṭhabbe… garuṃ katvā assādeti abhinandati, taṃ garuṃ katvā rāgo uppajjati, diṭṭhi uppajjati. (1)"
    ],
    "innerText": "Anidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa adhipatipaccayena paccayo. Ārammaṇādhipati – cakkhuṃ…pe… kāyaṃ… sadde… gandhe… rase… phoṭṭhabbe… garuṃ katvā assādeti abhinandati, taṃ garuṃ katvā rāgo uppajjati, diṭṭhi uppajjati. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "33"
      },
      ". Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa adhipatipaccayena paccayo – ārammaṇādhipati, sahajātādhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇādhipati"
      },
      " – dānaṃ datvā sīlaṃ samādiyitvā uposathakammaṃ katvā taṃ garuṃ katvā…pe… jhānā vuṭṭhahitvā…pe… ariyā maggā vuṭṭhahitvā…pe… phalā vuṭṭhahitvā…pe… phalaṃ garuṃ katvā…pe… nibbānaṃ garuṃ katvā… nibbānaṃ gotrabhussa, vodānassa, maggassa, phalassa adhipatipaccayena paccayo. Vatthuṃ… itthindriyaṃ… purisindriyaṃ… jīvitindriyaṃ… āpodhātuṃ… kabaḷīkāraṃ āhāraṃ… anidassanaappaṭighe khandhe garuṃ katvā assādeti abhinandati, taṃ garuṃ katvā rāgo uppajjati, diṭṭhi uppajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātādhipati"
      },
      " – anidassanaappaṭighādhipati sampayuttakānaṃ khandhānaṃ anidassanaappaṭighānañca cittasamuṭṭhānānaṃ rūpānaṃ adhipatipaccayena paccayo. (1)"
    ],
    "innerText": "33. Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa adhipatipaccayena paccayo – ārammaṇādhipati, sahajātādhipati. Ārammaṇādhipati – dānaṃ datvā sīlaṃ samādiyitvā uposathakammaṃ katvā taṃ garuṃ katvā…pe… jhānā vuṭṭhahitvā…pe… ariyā maggā vuṭṭhahitvā…pe… phalā vuṭṭhahitvā…pe… phalaṃ garuṃ katvā…pe… nibbānaṃ garuṃ katvā… nibbānaṃ gotrabhussa, vodānassa, maggassa, phalassa adhipatipaccayena paccayo. Vatthuṃ… itthindriyaṃ… purisindriyaṃ… jīvitindriyaṃ… āpodhātuṃ… kabaḷīkāraṃ āhāraṃ… anidassanaappaṭighe khandhe garuṃ katvā assādeti abhinandati, taṃ garuṃ katvā rāgo uppajjati, diṭṭhi uppajjati. Sahajātādhipati – anidassanaappaṭighādhipati sampayuttakānaṃ khandhānaṃ anidassanaappaṭighānañca cittasamuṭṭhānānaṃ rūpānaṃ adhipatipaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa dhammassa adhipatipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātādhipati"
      },
      " – anidassanaappaṭighādhipati sanidassanasappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ adhipatipaccayena paccayo. (2)"
    ],
    "innerText": "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa dhammassa adhipatipaccayena paccayo. Sahajātādhipati – anidassanaappaṭighādhipati sanidassanasappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ adhipatipaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Anidassanaappaṭighamūlake sattapi pañhā vibhajitabbā, adhipati tividharūpasaṅgahena.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Anantarapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "34"
      },
      ". Anidassanaappaṭigho ",
      " dhammo anidassanaappaṭighassa dhammassa anantarapaccayena paccayo – purimā purimā anidassanaappaṭighā khandhā pacchimānaṃ pacchimānaṃ anidassanaappaṭighānaṃ khandhānaṃ anantarapaccayena paccayo. Anulomaṃ gotrabhussa… anulomaṃ vodānassa… gotrabhu maggassa… vodānaṃ maggassa… maggo phalassa… phalaṃ phalassa… anulomaṃ phalasamāpattiyā… nirodhā vuṭṭhahantassa nevasaññānāsaññāyatanaṃ phalasamāpattiyā anantarapaccayena paccayo. (1)"
    ],
    "innerText": "34. Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa anantarapaccayena paccayo – purimā purimā anidassanaappaṭighā khandhā pacchimānaṃ pacchimānaṃ anidassanaappaṭighānaṃ khandhānaṃ anantarapaccayena paccayo. Anulomaṃ gotrabhussa… anulomaṃ vodānassa… gotrabhu maggassa… vodānaṃ maggassa… maggo phalassa… phalaṃ phalassa… anulomaṃ phalasamāpattiyā… nirodhā vuṭṭhahantassa nevasaññānāsaññāyatanaṃ phalasamāpattiyā anantarapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Samanantarapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ". Anidassanaappaṭigho ",
      " dhammo anidassanaappaṭighassa dhammassa samanantarapaccayena paccayo (anantarasadisaṃ)."
    ],
    "innerText": "35. Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa samanantarapaccayena paccayo (anantarasadisaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sahajātapaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ". Anidassanasappaṭigho dhammo anidassanasappaṭighassa dhammassa sahajātapaccayena paccayo (paṭiccavārasadisaṃ sādhukaṃ kātabbaṃ. Aññamaññapaccaye paṭiccavāre aññamaññasadisaṃ, nissayapaccaye paṭiccavārasadisaṃ)."
    ],
    "innerText": "36. Anidassanasappaṭigho dhammo anidassanasappaṭighassa dhammassa sahajātapaccayena paccayo (paṭiccavārasadisaṃ sādhukaṃ kātabbaṃ. Aññamaññapaccaye paṭiccavāre aññamaññasadisaṃ, nissayapaccaye paṭiccavārasadisaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Upanissayapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ". Sanidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – vaṇṇasampadaṃ patthayamāno dānaṃ deti, sīlaṃ samādiyati, uposathakammaṃ…pe… vaṇṇasampadā saddhāya…pe… paññāya, rāgassa…pe… patthanāya, kāyikassa sukhassa, kāyikassa dukkhassa, maggassa, phalasamāpattiyā upanissayapaccayena paccayo. (1)"
    ],
    "innerText": "37. Sanidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa upanissayapaccayena paccayo – ārammaṇūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – vaṇṇasampadaṃ patthayamāno dānaṃ deti, sīlaṃ samādiyati, uposathakammaṃ…pe… vaṇṇasampadā saddhāya…pe… paññāya, rāgassa…pe… patthanāya, kāyikassa sukhassa, kāyikassa dukkhassa, maggassa, phalasamāpattiyā upanissayapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa ",
      " upanissayapaccayena paccayo ",
      " – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – cakkhusampadaṃ patthayamāno…pe… kāyasampadaṃ… saddasampadaṃ…pe… phoṭṭhabbasampadaṃ patthayamāno dānaṃ deti, sīlaṃ samādiyati, uposathakammaṃ… utuṃ… senāsanaṃ upanissāya dānaṃ deti sīlaṃ samādiyati. Uposathakammaṃ, jhānaṃ… vipassanaṃ… maggaṃ… abhiññaṃ… samāpattiṃ uppādeti pāṇaṃ hanati…pe… saṅghaṃ bhindati. Cakkhusampadā…pe… phoṭṭhabbasampadā, utu, senāsanaṃ saddhāya…pe… paññāya, rāgassa…pe… patthanāya, kāyikassa sukhassa, kāyikassa dukkhassa, maggassa, phalasamāpattiyā upanissayapaccayena paccayo. (1)"
    ],
    "innerText": "Anidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa upanissayapaccayena paccayo – ārammaṇūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – cakkhusampadaṃ patthayamāno…pe… kāyasampadaṃ… saddasampadaṃ…pe… phoṭṭhabbasampadaṃ patthayamāno dānaṃ deti, sīlaṃ samādiyati, uposathakammaṃ… utuṃ… senāsanaṃ upanissāya dānaṃ deti sīlaṃ samādiyati. Uposathakammaṃ, jhānaṃ… vipassanaṃ… maggaṃ… abhiññaṃ… samāpattiṃ uppādeti pāṇaṃ hanati…pe… saṅghaṃ bhindati. Cakkhusampadā…pe… phoṭṭhabbasampadā, utu, senāsanaṃ saddhāya…pe… paññāya, rāgassa…pe… patthanāya, kāyikassa sukhassa, kāyikassa dukkhassa, maggassa, phalasamāpattiyā upanissayapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "38"
      },
      ". Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇūpanissayo, anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – saddhaṃ upanissāya dānaṃ deti, sīlaṃ samādiyati, uposathakammaṃ… jhānaṃ… samāpattiṃ uppādeti, mānaṃ ",
      " jappeti, diṭṭhiṃ gaṇhāti. Sīlaṃ…pe… paññaṃ… rāgaṃ…pe… patthanaṃ, kāyikaṃ sukhaṃ… kāyikaṃ dukkhaṃ… bhojanaṃ upanissāya dānaṃ deti…pe… saṅghaṃ bhindati. Saddhā …pe… paññā, rāgo…pe… patthanā, kāyikaṃ sukhaṃ… kāyikaṃ dukkhaṃ… bhojanaṃ saddhāya…pe… paññāya, maggassa, phalasamāpattiyā upanissayapaccayena paccayo. (1)"
    ],
    "innerText": "38. Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa upanissayapaccayena paccayo – ārammaṇūpanissayo, anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – saddhaṃ upanissāya dānaṃ deti, sīlaṃ samādiyati, uposathakammaṃ… jhānaṃ… samāpattiṃ uppādeti, mānaṃ jappeti, diṭṭhiṃ gaṇhāti. Sīlaṃ…pe… paññaṃ… rāgaṃ…pe… patthanaṃ, kāyikaṃ sukhaṃ… kāyikaṃ dukkhaṃ… bhojanaṃ upanissāya dānaṃ deti…pe… saṅghaṃ bhindati. Saddhā …pe… paññā, rāgo…pe… patthanā, kāyikaṃ sukhaṃ… kāyikaṃ dukkhaṃ… bhojanaṃ saddhāya…pe… paññāya, maggassa, phalasamāpattiyā upanissayapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Purejātapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "39"
      },
      ". Sanidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa purejātapaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇapurejātaṃ"
      },
      " – rūpe aniccato dukkhato anattato vipassati, assādeti abhinandati, taṃ ārabbha rāgo uppajjati, diṭṭhi…pe… vicikicchā…pe… uddhaccaṃ…pe… domanassaṃ uppajjati, dibbena cakkhunā ",
      " rūpaṃ passati, rūpāyatanaṃ cakkhuviññāṇassa purejātapaccayena paccayo. (1)"
    ],
    "innerText": "39. Sanidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa purejātapaccayena paccayo. Ārammaṇapurejātaṃ – rūpe aniccato dukkhato anattato vipassati, assādeti abhinandati, taṃ ārabbha rāgo uppajjati, diṭṭhi…pe… vicikicchā…pe… uddhaccaṃ…pe… domanassaṃ uppajjati, dibbena cakkhunā rūpaṃ passati, rūpāyatanaṃ cakkhuviññāṇassa purejātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ, vatthupurejātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇapurejātaṃ"
      },
      " – cakkhuṃ…pe… kāyaṃ… sadde…pe… phoṭṭhabbe aniccato…pe… domanassaṃ uppajjati, dibbāya sotadhātuyā saddaṃ suṇāti, saddāyatanaṃ sotaviññāṇassa…pe… phoṭṭhabbāyatanaṃ kāyaviññāṇassa purejātapaccayena ",
      " paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthupurejātaṃ"
      },
      " – cakkhāyatanaṃ cakkhuviññāṇassa…pe… kāyāyatanaṃ kāyaviññāṇassa purejātapaccayena paccayo. (1)"
    ],
    "innerText": "Anidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ, vatthupurejātaṃ. Ārammaṇapurejātaṃ – cakkhuṃ…pe… kāyaṃ… sadde…pe… phoṭṭhabbe aniccato…pe… domanassaṃ uppajjati, dibbāya sotadhātuyā saddaṃ suṇāti, saddāyatanaṃ sotaviññāṇassa…pe… phoṭṭhabbāyatanaṃ kāyaviññāṇassa purejātapaccayena paccayo. Vatthupurejātaṃ – cakkhāyatanaṃ cakkhuviññāṇassa…pe… kāyāyatanaṃ kāyaviññāṇassa purejātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ, vatthupurejātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇapurejātaṃ"
      },
      " – vatthuṃ… itthindriyaṃ… purisindriyaṃ… jīvitindriyaṃ… āpodhātuṃ… kabaḷīkāraṃ āhāraṃ… aniccato…pe… domanassaṃ uppajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthupurejātaṃ"
      },
      " – vatthu anidassanaappaṭighānaṃ khandhānaṃ purejātapaccayena paccayo. (1)"
    ],
    "innerText": "Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ, vatthupurejātaṃ. Ārammaṇapurejātaṃ – vatthuṃ… itthindriyaṃ… purisindriyaṃ… jīvitindriyaṃ… āpodhātuṃ… kabaḷīkāraṃ āhāraṃ… aniccato…pe… domanassaṃ uppajjati. Vatthupurejātaṃ – vatthu anidassanaappaṭighānaṃ khandhānaṃ purejātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ". Sanidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa purejātapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇapurejātaṃ, vatthupurejātaṃ"
      },
      ". Rūpāyatanañca vatthu ca anidassanaappaṭighānaṃ khandhānaṃ purejātapaccayena paccayo. (1)"
    ],
    "innerText": "40. Sanidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ, vatthupurejātaṃ. Rūpāyatanañca vatthu ca anidassanaappaṭighānaṃ khandhānaṃ purejātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭigho ",
      " ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa purejātapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇapurejātaṃ , vatthupurejātaṃ"
      },
      ". Cakkhāyatanañca vatthu ca…pe… phoṭṭhabbāyatanañca vatthu ca anidassanaappaṭighānaṃ khandhānaṃ purejātapaccayena paccayo. (1)"
    ],
    "innerText": "Anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ , vatthupurejātaṃ. Cakkhāyatanañca vatthu ca…pe… phoṭṭhabbāyatanañca vatthu ca anidassanaappaṭighānaṃ khandhānaṃ purejātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sanidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa purejātapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇapurejātaṃ, vatthupurejātaṃ"
      },
      ". Rūpāyatanañca cakkhāyatanañca cakkhuviññāṇassa purejātapaccayena paccayo. (1)"
    ],
    "innerText": "Sanidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ, vatthupurejātaṃ. Rūpāyatanañca cakkhāyatanañca cakkhuviññāṇassa purejātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pacchājātapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ". Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa pacchājātapaccayena paccayo – pacchājātā anidassanaappaṭighā khandhā purejātassa imassa anidassanaappaṭighassa kāyassa pacchājātapaccayena paccayo. (1)"
    ],
    "innerText": "41. Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa pacchājātapaccayena paccayo – pacchājātā anidassanaappaṭighā khandhā purejātassa imassa anidassanaappaṭighassa kāyassa pacchājātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa dhammassa pacchājātapaccayena paccayo ",
      " – pacchājātā anidassanaappaṭighā khandhā purejātassa imassa sanidassanasappaṭighassa kāyassa pacchājātapaccayena paccayo. (2)"
    ],
    "innerText": "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa dhammassa pacchājātapaccayena paccayo – pacchājātā anidassanaappaṭighā khandhā purejātassa imassa sanidassanasappaṭighassa kāyassa pacchājātapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Evaṃ satta pañhā vibhajitabbā, tividharūpasaṅgaho.) (7)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Āsevanapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42"
      },
      ". Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa āsevanapaccayena paccayo – purimā purimā anidassanaappaṭighā khandhā pacchimānaṃ pacchimānaṃ anidassanaappaṭighānaṃ khandhānaṃ āsevanapaccayena paccayo. Anulomaṃ gotrabhussa… anulomaṃ vodānassa… gotrabhu ",
      " maggassa… vodānaṃ maggassa āsevanapaccayena paccayo. (1)"
    ],
    "innerText": "42. Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa āsevanapaccayena paccayo – purimā purimā anidassanaappaṭighā khandhā pacchimānaṃ pacchimānaṃ anidassanaappaṭighānaṃ khandhānaṃ āsevanapaccayena paccayo. Anulomaṃ gotrabhussa… anulomaṃ vodānassa… gotrabhu maggassa… vodānaṃ maggassa āsevanapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Kammapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "43"
      },
      ". Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa kammapaccayena paccayo – sahajātā, nānākkhaṇikā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātā"
      },
      " – anidassanaappaṭighā cetanā sampayuttakānaṃ khandhānaṃ anidassanaappaṭighānañca cittasamuṭṭhānānaṃ ",
      " rūpānaṃ kammapaccayena paccayo. Paṭisandhikkhaṇe…pe…. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānākkhaṇikā"
      },
      " – anidassanaappaṭighā cetanā vipākānaṃ khandhānaṃ anidassanaappaṭighānañca kaṭattārūpānaṃ kammapaccayena paccayo. (1)"
    ],
    "innerText": "43. Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa kammapaccayena paccayo – sahajātā, nānākkhaṇikā. Sahajātā – anidassanaappaṭighā cetanā sampayuttakānaṃ khandhānaṃ anidassanaappaṭighānañca cittasamuṭṭhānānaṃ rūpānaṃ kammapaccayena paccayo. Paṭisandhikkhaṇe…pe…. Nānākkhaṇikā – anidassanaappaṭighā cetanā vipākānaṃ khandhānaṃ anidassanaappaṭighānañca kaṭattārūpānaṃ kammapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa dhammassa kammapaccayena paccayo – sahajātā, nānākkhaṇikā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātā"
      },
      " – anidassanaappaṭighā cetanā sanidassanasappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ kammapaccayena paccayo. Paṭisandhikkhaṇe…pe…. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānākkhaṇikā"
      },
      " – anidassanaappaṭighā cetanā sanidassanasappaṭighānaṃ kaṭattārūpānaṃ kammapaccayena paccayo. (2)"
    ],
    "innerText": "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa dhammassa kammapaccayena paccayo – sahajātā, nānākkhaṇikā. Sahajātā – anidassanaappaṭighā cetanā sanidassanasappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ kammapaccayena paccayo. Paṭisandhikkhaṇe…pe…. Nānākkhaṇikā – anidassanaappaṭighā cetanā sanidassanasappaṭighānaṃ kaṭattārūpānaṃ kammapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Evaṃ satta pañhā sahajātā nānākkhaṇikā iminā kāraṇena vibhajitabbā, tividharūpasaṅgaho.) (7)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Vipākapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44"
      },
      ". Anidassanaappaṭigho ",
      " dhammo anidassanaappaṭighassa dhammassa vipākapaccayena paccayo – vipāko anidassanaappaṭigho eko khandho tiṇṇannaṃ khandhānaṃ anidassanaappaṭighānaṃ cittasamuṭṭhānānañca rūpānaṃ vipākapaccayena paccayo…pe… dve khandhā…pe… paṭisandhikkhaṇe anidassanaappaṭigho eko khandho tiṇṇannaṃ khandhānaṃ anidassanaappaṭighānañca kaṭattārūpānaṃ vipākapaccayena paccayo…pe… khandhā vatthussa ",
      " vipākapaccayena paccayo. (1)"
    ],
    "innerText": "44. Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa vipākapaccayena paccayo – vipāko anidassanaappaṭigho eko khandho tiṇṇannaṃ khandhānaṃ anidassanaappaṭighānaṃ cittasamuṭṭhānānañca rūpānaṃ vipākapaccayena paccayo…pe… dve khandhā…pe… paṭisandhikkhaṇe anidassanaappaṭigho eko khandho tiṇṇannaṃ khandhānaṃ anidassanaappaṭighānañca kaṭattārūpānaṃ vipākapaccayena paccayo…pe… khandhā vatthussa vipākapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa dhammassa vipākapaccayena paccayo – vipākā anidassanaappaṭighā khandhā sanidassanasappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ vipākapaccayena paccayo. Paṭisandhikkhaṇe anidassanaappaṭighā khandhā sanidassanasappaṭighānaṃ kaṭattārūpānaṃ vipākapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Evaṃ satta pañhā vitthāretabbā, pavattipaṭisandhi.) (7)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Āhārapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "45"
      },
      ". Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa āhārapaccayena paccayo – anidassanaappaṭighā āhārā sampayuttakānaṃ khandhānaṃ anidassanaappaṭighānañca cittasamuṭṭhānānaṃ rūpānaṃ āhārapaccayena paccayo. Paṭisandhikkhaṇe anidassanaappaṭighā āhārā sampayuttakānaṃ khandhānaṃ ",
      " anidassanaappaṭighānañca kaṭattārūpānaṃ āhārapaccayena paccayo. Kabaḷīkāro āhāro imassa anidassanaappaṭighassa kāyassa āhārapaccayena paccayo. (1)"
    ],
    "innerText": "45. Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa āhārapaccayena paccayo – anidassanaappaṭighā āhārā sampayuttakānaṃ khandhānaṃ anidassanaappaṭighānañca cittasamuṭṭhānānaṃ rūpānaṃ āhārapaccayena paccayo. Paṭisandhikkhaṇe anidassanaappaṭighā āhārā sampayuttakānaṃ khandhānaṃ anidassanaappaṭighānañca kaṭattārūpānaṃ āhārapaccayena paccayo. Kabaḷīkāro āhāro imassa anidassanaappaṭighassa kāyassa āhārapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa dhammassa āhārapaccayena paccayo – anidassanaappaṭighā āhārā sanidassanasappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ āhārapaccayena paccayo. Paṭisandhikkhaṇe anidassanaappaṭighā āhārā sanidassanasappaṭighānaṃ kaṭattārūpānaṃ āhārapaccayena ",
      " paccayo. Kabaḷīkāro āhāro imassa sanidassanasappaṭighassa kāyassa āhārapaccayena paccayo. (2)"
    ],
    "innerText": "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa dhammassa āhārapaccayena paccayo – anidassanaappaṭighā āhārā sanidassanasappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ āhārapaccayena paccayo. Paṭisandhikkhaṇe anidassanaappaṭighā āhārā sanidassanasappaṭighānaṃ kaṭattārūpānaṃ āhārapaccayena paccayo. Kabaḷīkāro āhāro imassa sanidassanasappaṭighassa kāyassa āhārapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "(Evaṃ satta pañhā ",
      " pavattipaṭisandhi vibhajitabbā, sattasupi kabaḷīkāro āhāro kātabbo.) (7)"
    ],
    "innerText": "(Evaṃ satta pañhā pavattipaṭisandhi vibhajitabbā, sattasupi kabaḷīkāro āhāro kātabbo.) (7)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Indriyapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "46"
      },
      ". Anidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa indriyapaccayena paccayo – cakkhundriyaṃ cakkhuviññāṇassa…pe… kāyindriyaṃ kāyaviññāṇassa indriyapaccayena paccayo. (1)"
    ],
    "innerText": "46. Anidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa indriyapaccayena paccayo – cakkhundriyaṃ cakkhuviññāṇassa…pe… kāyindriyaṃ kāyaviññāṇassa indriyapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa indriyapaccayena paccayo – anidassanaappaṭighā indriyā sampayuttakānaṃ khandhānaṃ anidassanaappaṭighānaṃ cittasamuṭṭhānānañca rūpānaṃ indriyapaccayena paccayo. Paṭisandhikkhaṇe anidassanaappaṭighā indriyā sampayuttakānaṃ khandhānaṃ anidassanaappaṭighānañca kaṭattārūpānaṃ indriyapaccayena paccayo. Rūpajīvitindriyaṃ anidassanaappaṭighānaṃ kaṭattārūpānaṃ indriyapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa dhammassa indriyapaccayena paccayo – anidassanaappaṭighā indriyā sanidassanasappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ indriyapaccayena paccayo. Paṭisandhikkhaṇe anidassanaappaṭighā indriyā sanidassanasappaṭighānaṃ kaṭattārūpānaṃ indriyapaccayena paccayo. Rūpajīvitindriyaṃ sanidassanasappaṭighānaṃ kaṭattārūpānaṃ indriyapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Evaṃ pavattipaṭisandhi satta pañhā vibhajitabbā, rūpajīvitindriyañca ante ante.) (7)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "47"
      },
      ". Anidassanasappaṭigho ",
      " ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa indriyapaccayena paccayo – cakkhundriyañca cakkhuviññāṇañca cakkhuviññāṇasahagatānaṃ khandhānaṃ ",
      " indriyapaccayena paccayo…pe… kāyindriyañca kāyaviññāṇañca kāyaviññāṇasahagatānaṃ khandhānaṃ indriyapaccayena paccayo. (1)"
    ],
    "innerText": "47. Anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa indriyapaccayena paccayo – cakkhundriyañca cakkhuviññāṇañca cakkhuviññāṇasahagatānaṃ khandhānaṃ indriyapaccayena paccayo…pe… kāyindriyañca kāyaviññāṇañca kāyaviññāṇasahagatānaṃ khandhānaṃ indriyapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Jhānapaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "48"
      },
      ". Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa jhānapaccayena paccayo… maggapaccayena paccayo… sampayuttapaccayena paccayo – anidassanaappaṭigho eko khandho tiṇṇannaṃ khandhānaṃ sampayuttapaccayena paccayo…pe… dve khandhā…pe… paṭisandhikkhaṇe…pe…."
    ],
    "innerText": "48. Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa jhānapaccayena paccayo… maggapaccayena paccayo… sampayuttapaccayena paccayo – anidassanaappaṭigho eko khandho tiṇṇannaṃ khandhānaṃ sampayuttapaccayena paccayo…pe… dve khandhā…pe… paṭisandhikkhaṇe…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Vippayuttapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "49"
      },
      ". Anidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa vippayuttapaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – cakkhāyatanaṃ cakkhuviññāṇassa…pe… kāyāyatanaṃ kāyaviññāṇassa vippayuttapaccayena paccayo. (1)"
    ],
    "innerText": "49. Anidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa vippayuttapaccayena paccayo. Purejātaṃ – cakkhāyatanaṃ cakkhuviññāṇassa…pe… kāyāyatanaṃ kāyaviññāṇassa vippayuttapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa vippayuttapaccayena paccayo – sahajātaṃ, purejātaṃ, pacchājātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātā"
      },
      " – anidassanaappaṭighā khandhā anidassanaappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ vippayuttapaccayena paccayo. Paṭisandhikkhaṇe anidassanaappaṭighā khandhā anidassanaappaṭighānaṃ kaṭattārūpānaṃ vippayuttapaccayena paccayo. Khandhā vatthussa vippayuttapaccayena paccayo. Vatthu khandhānaṃ vippayuttapaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – vatthu anidassanaappaṭighānaṃ ",
      " khandhānaṃ vippayuttapaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchājātā"
      },
      " – anidassanaappaṭighā khandhā purejātassa imassa anidassanaappaṭighassa kāyassa vippayuttapaccayena paccayo. (1)"
    ],
    "innerText": "Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa vippayuttapaccayena paccayo – sahajātaṃ, purejātaṃ, pacchājātaṃ. Sahajātā – anidassanaappaṭighā khandhā anidassanaappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ vippayuttapaccayena paccayo. Paṭisandhikkhaṇe anidassanaappaṭighā khandhā anidassanaappaṭighānaṃ kaṭattārūpānaṃ vippayuttapaccayena paccayo. Khandhā vatthussa vippayuttapaccayena paccayo. Vatthu khandhānaṃ vippayuttapaccayena paccayo. Purejātaṃ – vatthu anidassanaappaṭighānaṃ khandhānaṃ vippayuttapaccayena paccayo. Pacchājātā – anidassanaappaṭighā khandhā purejātassa imassa anidassanaappaṭighassa kāyassa vippayuttapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa dhammassa vippayuttapaccayena paccayo – sahajātaṃ, pacchājātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātā"
      },
      " – anidassanaappaṭighā khandhā sanidassanasappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ vippayuttapaccayena paccayo. Paṭisandhikkhaṇe anidassanaappaṭighā khandhā sanidassanasappaṭighānaṃ kaṭattārūpānaṃ vippayuttapaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchājātā"
      },
      " – anidassanaappaṭighā ",
      " khandhā purejātassa imassa sanidassanasappaṭighassa kāyassa vippayuttapaccayena paccayo. (2)"
    ],
    "innerText": "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa dhammassa vippayuttapaccayena paccayo – sahajātaṃ, pacchājātaṃ. Sahajātā – anidassanaappaṭighā khandhā sanidassanasappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ vippayuttapaccayena paccayo. Paṭisandhikkhaṇe anidassanaappaṭighā khandhā sanidassanasappaṭighānaṃ kaṭattārūpānaṃ vippayuttapaccayena paccayo. Pacchājātā – anidassanaappaṭighā khandhā purejātassa imassa sanidassanasappaṭighassa kāyassa vippayuttapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Avasesā pañca pañhā evaṃ vitthāretabbā. Sahajātā, pacchājātā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Atthipaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50"
      },
      ". Sanidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa atthipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – rūpe aniccato…pe… domanassaṃ uppajjati, dibbena cakkhunā rūpaṃ passati, rūpāyatanaṃ cakkhuviññāṇassa atthipaccayena paccayo. (1)"
    ],
    "innerText": "50. Sanidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa atthipaccayena paccayo. Purejātaṃ – rūpe aniccato…pe… domanassaṃ uppajjati, dibbena cakkhunā rūpaṃ passati, rūpāyatanaṃ cakkhuviññāṇassa atthipaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "51"
      },
      ". Anidassanasappaṭigho dhammo anidassanasappaṭighassa dhammassa atthipaccayena paccayo – anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ dvinnaṃ mahābhūtānaṃ atthipaccayena paccayo. Dve mahābhūtā ekassa mahābhūtassa atthipaccayena paccayo. Anidassanasappaṭighā mahābhūtā anidassanasappaṭighānaṃ ",
      " cittasamuṭṭhānānaṃ rūpānaṃ kaṭattārūpānaṃ upādārūpānaṃ atthipaccayena paccayo. Phoṭṭhabbāyatanaṃ cakkhāyatanassa…pe… rasāyatanassa atthipaccayena paccayo. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… ekaṃ mahābhūtaṃ dvinnaṃ mahābhūtānaṃ atthipaccayena paccayo. Dve mahābhūtā ekassa mahābhūtassa atthipaccayena paccayo. Utusamuṭṭhānā mahābhūtā anidassanasappaṭighānaṃ upādārūpānaṃ atthipaccayena paccayo. Asaññasattānaṃ anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ dvinnaṃ mahābhūtānaṃ atthipaccayena paccayo. Dve mahābhūtā…pe…. (1)"
    ],
    "innerText": "51. Anidassanasappaṭigho dhammo anidassanasappaṭighassa dhammassa atthipaccayena paccayo – anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ dvinnaṃ mahābhūtānaṃ atthipaccayena paccayo. Dve mahābhūtā ekassa mahābhūtassa atthipaccayena paccayo. Anidassanasappaṭighā mahābhūtā anidassanasappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ kaṭattārūpānaṃ upādārūpānaṃ atthipaccayena paccayo. Phoṭṭhabbāyatanaṃ cakkhāyatanassa…pe… rasāyatanassa atthipaccayena paccayo. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… ekaṃ mahābhūtaṃ dvinnaṃ mahābhūtānaṃ atthipaccayena paccayo. Dve mahābhūtā ekassa mahābhūtassa atthipaccayena paccayo. Utusamuṭṭhānā mahābhūtā anidassanasappaṭighānaṃ upādārūpānaṃ atthipaccayena paccayo. Asaññasattānaṃ anidassanasappaṭighaṃ ekaṃ mahābhūtaṃ dvinnaṃ mahābhūtānaṃ atthipaccayena paccayo. Dve mahābhūtā…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭigho dhammo sanidassanasappaṭighassa dhammassa atthipaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Paṭiccavāre nissayapaccayasadisaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātā"
      },
      " – anidassanasappaṭighā mahābhūtā anidassanaappaṭighānaṃ cittasamuṭṭhānānaṃ ",
      " rūpānaṃ kaṭattārūpānaṃ upādārūpānaṃ atthipaccayena paccayo (yāva asaññasattā vitthāretabbā). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – cakkhuṃ…pe… kāyaṃ, sadde…pe… phoṭṭhabbe aniccato…pe… domanassaṃ uppajjati, cakkhāyatanaṃ cakkhuviññāṇassa…pe… phoṭṭhabbāyatanaṃ kāyaviññāṇassa atthipaccayena paccayo. (3)"
    ],
    "innerText": "Anidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ. Sahajātā – anidassanasappaṭighā mahābhūtā anidassanaappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ kaṭattārūpānaṃ upādārūpānaṃ atthipaccayena paccayo (yāva asaññasattā vitthāretabbā). Purejātaṃ – cakkhuṃ…pe… kāyaṃ, sadde…pe… phoṭṭhabbe aniccato…pe… domanassaṃ uppajjati, cakkhāyatanaṃ cakkhuviññāṇassa…pe… phoṭṭhabbāyatanaṃ kāyaviññāṇassa atthipaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "(Avasesā ",
      " cattāro pañhā vitthāretabbā. Paṭiccavāre sahajātapaccayasadisā, ninnānākaraṇā.) (7)"
    ],
    "innerText": "(Avasesā cattāro pañhā vitthāretabbā. Paṭiccavāre sahajātapaccayasadisā, ninnānākaraṇā.) (7)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "52"
      },
      ". Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa ",
      " atthipaccayena paccayo – sahajātaṃ, purejātaṃ, pacchājātaṃ, āhāraṃ, indriyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajāto"
      },
      " – anidassanaappaṭigho eko khandho tiṇṇannaṃ khandhānaṃ anidassanaappaṭighānaṃ cittasamuṭṭhānānañca rūpānaṃ atthipaccayena paccayo. Dve khandhā…pe… paṭisandhikkhaṇe…pe… āpodhātu anidassanaappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ kaṭattārūpānaṃ upādārūpānaṃ…pe… āpodhātu itthindriyassa…pe… kabaḷīkārāhārassa ca atthipaccayena paccayo. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ āpodhātu anidassanaappaṭighānaṃ kaṭattārūpānaṃ upādārūpānaṃ atthipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – vatthuṃ… itthindriyaṃ… purisindriyaṃ… jīvitindriyaṃ… āpodhātuṃ… kabaḷīkāraṃ āhāraṃ… aniccato…pe… domanassaṃ uppajjati, vatthu anidassanaappaṭighānaṃ khandhānaṃ atthipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchājātā"
      },
      " – anidassanaappaṭighā khandhā purejātassa imassa anidassanaappaṭighassa kāyassa atthipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kabaḷīkāro āhāro"
      },
      " imassa anidassanaappaṭighassa kāyassa atthipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpajīvitindriyaṃ"
      },
      " anidassanaappaṭighānaṃ kaṭattārūpānaṃ atthipaccayena paccayo (evaṃ avasesā cha pañhā vibhajitabbā. Sahajātaṃ, pacchājātaṃ, āhāraṃ, indriyampi kātabbā). (7)"
    ],
    "innerText": "52. Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ, pacchājātaṃ, āhāraṃ, indriyaṃ. Sahajāto – anidassanaappaṭigho eko khandho tiṇṇannaṃ khandhānaṃ anidassanaappaṭighānaṃ cittasamuṭṭhānānañca rūpānaṃ atthipaccayena paccayo. Dve khandhā…pe… paṭisandhikkhaṇe…pe… āpodhātu anidassanaappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ kaṭattārūpānaṃ upādārūpānaṃ…pe… āpodhātu itthindriyassa…pe… kabaḷīkārāhārassa ca atthipaccayena paccayo. Bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ āpodhātu anidassanaappaṭighānaṃ kaṭattārūpānaṃ upādārūpānaṃ atthipaccayena paccayo. Purejātaṃ – vatthuṃ… itthindriyaṃ… purisindriyaṃ… jīvitindriyaṃ… āpodhātuṃ… kabaḷīkāraṃ āhāraṃ… aniccato…pe… domanassaṃ uppajjati, vatthu anidassanaappaṭighānaṃ khandhānaṃ atthipaccayena paccayo. Pacchājātā – anidassanaappaṭighā khandhā purejātassa imassa anidassanaappaṭighassa kāyassa atthipaccayena paccayo. Kabaḷīkāro āhāro imassa anidassanaappaṭighassa kāyassa atthipaccayena paccayo. Rūpajīvitindriyaṃ anidassanaappaṭighānaṃ kaṭattārūpānaṃ atthipaccayena paccayo (evaṃ avasesā cha pañhā vibhajitabbā. Sahajātaṃ, pacchājātaṃ, āhāraṃ, indriyampi kātabbā). (7)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "53"
      },
      ". Sanidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa atthipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – rūpāyatanañca vatthu ca anidassanaappaṭighānaṃ khandhānaṃ atthipaccayena paccayo ",
      ". (1)"
    ],
    "innerText": "53. Sanidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa atthipaccayena paccayo. Purejātaṃ – rūpāyatanañca vatthu ca anidassanaappaṭighānaṃ khandhānaṃ atthipaccayena paccayo . (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā sanidassanasappaṭighassa dhammassa atthipaccayena ",
      " paccayo – anidassanaappaṭighā khandhā ca mahābhūtā ca sanidassanasappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ atthipaccayena paccayo. Paṭisandhikkhaṇe… (saṃkhittaṃ, asaññasattānañca kātabbā). (1)"
    ],
    "innerText": "Anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā sanidassanasappaṭighassa dhammassa atthipaccayena paccayo – anidassanaappaṭighā khandhā ca mahābhūtā ca sanidassanasappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ atthipaccayena paccayo. Paṭisandhikkhaṇe… (saṃkhittaṃ, asaññasattānañca kātabbā). (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanasappaṭighassa dhammassa atthipaccayena paccayo (saṃkhittaṃ). (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "54"
      },
      ". Anidassanasappaṭigho ",
      " ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātā"
      },
      " – anidassanaappaṭighā khandhā ca mahābhūtā ca anidassanaappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ…pe… (yāva asaññasattā kātabbā). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – cakkhāyatanañca vatthu ca…pe… phoṭṭhabbāyatanañca vatthu ca anidassanaappaṭighānaṃ khandhānaṃ atthipaccayena paccayo. (3) (Avasesā catasso pañhā vibhajitabbā.) (7)"
    ],
    "innerText": "54. Anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ. Sahajātā – anidassanaappaṭighā khandhā ca mahābhūtā ca anidassanaappaṭighānaṃ cittasamuṭṭhānānaṃ rūpānaṃ…pe… (yāva asaññasattā kātabbā). Purejātaṃ – cakkhāyatanañca vatthu ca…pe… phoṭṭhabbāyatanañca vatthu ca anidassanaappaṭighānaṃ khandhānaṃ atthipaccayena paccayo. (3) (Avasesā catasso pañhā vibhajitabbā.) (7)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "55"
      },
      ". Sanidassanasappaṭigho ca anidassanasappaṭigho ca dhammā anidassanaappaṭighassa dhammassa atthipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – rūpāyatanañca cakkhāyatanañca cakkhuviññāṇassa atthipaccayena paccayo. (1)"
    ],
    "innerText": "55. Sanidassanasappaṭigho ca anidassanasappaṭigho ca dhammā anidassanaappaṭighassa dhammassa atthipaccayena paccayo. Purejātaṃ – rūpāyatanañca cakkhāyatanañca cakkhuviññāṇassa atthipaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sanidassanasappaṭigho ca anidassanasappaṭigho ca anidassanaappaṭigho ",
      " ca dhammā anidassanaappaṭighassa dhammassa atthipaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahajātaṃ, purejātaṃ"
      },
      ". Rūpāyatanañca cakkhāyatanañca cakkhuviññāṇañca cakkhuviññāṇasahagatānaṃ khandhānaṃ atthipaccayena paccayo. (1)"
    ],
    "innerText": "Sanidassanasappaṭigho ca anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ. Rūpāyatanañca cakkhāyatanañca cakkhuviññāṇañca cakkhuviññāṇasahagatānaṃ khandhānaṃ atthipaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Natthivigatapaccayaṃ anantarasadisaṃ. Avigatapaccayaṃ atthisadisaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paccayānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Saṅkhyāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Suddhaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "56"
      },
      ". Hetuyā ",
      " satta, ārammaṇe tīṇi, adhipatiyā nava, anantare ekaṃ, samanantare ekaṃ, sahajāte ekavīsa, aññamaññe cha, nissaye ekavīsa, upanissaye tīṇi, purejāte cha, pacchājāte satta, āsevane ekaṃ, kamme satta, vipāke satta, āhāre satta, indriye nava, jhāne satta, magge satta, sampayutte ekaṃ, vippayutte aṭṭha, atthiyā pañcavīsa, natthiyā ekaṃ, vigate ekaṃ, avigate pañcavīsa."
    ],
    "innerText": "56. Hetuyā satta, ārammaṇe tīṇi, adhipatiyā nava, anantare ekaṃ, samanantare ekaṃ, sahajāte ekavīsa, aññamaññe cha, nissaye ekavīsa, upanissaye tīṇi, purejāte cha, pacchājāte satta, āsevane ekaṃ, kamme satta, vipāke satta, āhāre satta, indriye nava, jhāne satta, magge satta, sampayutte ekaṃ, vippayutte aṭṭha, atthiyā pañcavīsa, natthiyā ekaṃ, vigate ekaṃ, avigate pañcavīsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetusabhāgaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "57"
      },
      ". Hetupaccayā adhipatiyā satta, sahajāte satta, aññamaññe ekaṃ, nissaye satta, vipāke satta, indriye satta, magge satta, sampayutte ekaṃ, vippayutte satta, atthiyā satta, avigate satta."
    ],
    "innerText": "57. Hetupaccayā adhipatiyā satta, sahajāte satta, aññamaññe ekaṃ, nissaye satta, vipāke satta, indriye satta, magge satta, sampayutte ekaṃ, vippayutte satta, atthiyā satta, avigate satta."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetusāmaññaghaṭanā (9)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "58"
      },
      ". Hetu-sahajāta-nissaya-atthi-avigatanti ",
      " satta. Hetu-sahajāta-aññamaññanissaya-atthi-avigatanti ekaṃ. Hetu-sahajāta-aññamañña-nissaya-sampayutta-atthi-avigatanti ekaṃ. Hetu-sahajāta-nissaya-vippayutta-atthi ",
      " -avigatanti satta (avipākaṃ-4)."
    ],
    "innerText": "58. Hetu-sahajāta-nissaya-atthi-avigatanti satta. Hetu-sahajāta-aññamaññanissaya-atthi-avigatanti ekaṃ. Hetu-sahajāta-aññamañña-nissaya-sampayutta-atthi-avigatanti ekaṃ. Hetu-sahajāta-nissaya-vippayutta-atthi -avigatanti satta (avipākaṃ-4)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetu-sahajāta-nissaya-vipāka-atthi-avigatanti satta. Hetu-sahajāta-aññamañña-nissayavipāka-atthi-avigatanti ekaṃ. Hetu-sahajāta-aññamañña-nissaya-vipāka-sampayutta-atthiavigatanti ekaṃ. Hetu-sahajāta-nissaya-vipāka-vippayutta-atthi-avigatanti satta. Hetu-sahajāta-aññamañña-nissaya-vipāka-vippayutta-atthi-avigatanti ekaṃ (savipākaṃ-5)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "(Evaṃ sabbo gaṇanavāro gaṇetabbo.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anulomaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Paccanīyuddhāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "59"
      },
      ". Sanidassanasappaṭigho ",
      " dhammo anidassanaappaṭighassa dhammassa ārammaṇapaccayena paccayo… upanissayapaccayena paccayo… purejātapaccayena paccayo. (1)"
    ],
    "innerText": "59. Sanidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa ārammaṇapaccayena paccayo… upanissayapaccayena paccayo… purejātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭigho dhammo anidassanasappaṭighassa dhammassa sahajātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭigho dhammo sanidassanasappaṭighassa dhammassa sahajātapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭigho dhammo anidassanaappaṭighassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo… purejātapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭigho dhammo sanidassanasappaṭighassa ca anidassanaappaṭighassa ca dhammassa sahajātapaccayena paccayo. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭigho dhammo anidassanasappaṭighassa ca anidassanaappaṭighassa ",
      " ca dhammassa sahajātapaccayena paccayo. (5)"
    ],
    "innerText": "Anidassanasappaṭigho dhammo anidassanasappaṭighassa ca anidassanaappaṭighassa ca dhammassa sahajātapaccayena paccayo. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭigho ",
      " dhammo sanidassanasappaṭighassa ca anidassanasappaṭighassa ca dhammassa sahajātapaccayena paccayo. (6)"
    ],
    "innerText": "Anidassanasappaṭigho dhammo sanidassanasappaṭighassa ca anidassanasappaṭighassa ca dhammassa sahajātapaccayena paccayo. (6)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭigho ",
      " dhammo sanidassanasappaṭighassa ca anidassanasappaṭighassa ca anidassanaappaṭighassa ca dhammassa sahajātapaccayena paccayo. (7)"
    ],
    "innerText": "Anidassanasappaṭigho dhammo sanidassanasappaṭighassa ca anidassanasappaṭighassa ca anidassanaappaṭighassa ca dhammassa sahajātapaccayena paccayo. (7)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "60"
      },
      ". Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo… purejātapaccayena paccayo… pacchājātapaccayena paccayo… kammapaccayena paccayo… āhārapaccayena paccayo… indriyapaccayena paccayo. (1)"
    ],
    "innerText": "60. Anidassanaappaṭigho dhammo anidassanaappaṭighassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo… purejātapaccayena paccayo… pacchājātapaccayena paccayo… kammapaccayena paccayo… āhārapaccayena paccayo… indriyapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa dhammassa sahajātapaccayena paccayo… pacchājātapaccayena paccayo… kammapaccayena paccayo… āhārapaccayena paccayo… indriyapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭigho dhammo anidassanasappaṭighassa dhammassa sahajātapaccayena paccayo… pacchājātapaccayena paccayo… kammapaccayena paccayo… āhārapaccayena paccayo… indriyapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa ca anidassanaappaṭighassa ca dhammassa sahajātapaccayena paccayo… pacchājātapaccayena paccayo… kammapaccayena paccayo… āhārapaccayena paccayo… indriyapaccayena paccayo. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭigho dhammo anidassanasappaṭighassa ca anidassanaappaṭighassa ca dhammassa sahajātapaccayena paccayo… pacchājātapaccayena paccayo… kammapaccayena paccayo… āhārapaccayena paccayo… indriyapaccayena ",
      " paccayo. (5)"
    ],
    "innerText": "Anidassanaappaṭigho dhammo anidassanasappaṭighassa ca anidassanaappaṭighassa ca dhammassa sahajātapaccayena paccayo… pacchājātapaccayena paccayo… kammapaccayena paccayo… āhārapaccayena paccayo… indriyapaccayena paccayo. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa ca anidassanasappaṭighassa ca dhammassa sahajātapaccayena paccayo… pacchājātapaccayena paccayo… kammapaccayena paccayo… āhārapaccayena paccayo… indriyapaccayena paccayo. (6)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanaappaṭigho ",
      " dhammo sanidassanasappaṭighassa ca anidassanasappaṭighassa ca anidassanaappaṭighassa ca dhammassa sahajātapaccayena paccayo ",
      "… pacchājātapaccayena paccayo… kammapaccayena paccayo… āhārapaccayena paccayo… indriyapaccayena paccayo. (7)"
    ],
    "innerText": "Anidassanaappaṭigho dhammo sanidassanasappaṭighassa ca anidassanasappaṭighassa ca anidassanaappaṭighassa ca dhammassa sahajātapaccayena paccayo … pacchājātapaccayena paccayo… kammapaccayena paccayo… āhārapaccayena paccayo… indriyapaccayena paccayo. (7)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "61"
      },
      ". Sanidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa purejātaṃ. (1)"
    ],
    "innerText": "61. Sanidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa purejātaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā sanidassanasappaṭighassa dhammassa sahajātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanasappaṭighassa dhammassa sahajātapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa sahajātaṃ, purejātaṃ. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā sanidassanasappaṭighassa ca anidassanaappaṭighassa ca ",
      " dhammassa sahajātapaccayena paccayo. (4)"
    ],
    "innerText": "Anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā sanidassanasappaṭighassa ca anidassanaappaṭighassa ca dhammassa sahajātapaccayena paccayo. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanasappaṭighassa ca anidassanaappaṭighassa ca dhammassa sahajātapaccayena paccayo. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā sanidassanasappaṭighassa ca anidassanasappaṭighassa ca dhammassa sahajātapaccayena paccayo. (6)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā sanidassanasappaṭighassa ca anidassanasappaṭighassa ca anidassanaappaṭighassa ca dhammassa sahajātapaccayena paccayo. (7)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "62"
      },
      ". Sanidassanasappaṭigho ",
      " ca anidassanasappaṭigho ca dhammā anidassanaappaṭighassa dhammassa purejātaṃ. (1)"
    ],
    "innerText": "62. Sanidassanasappaṭigho ca anidassanasappaṭigho ca dhammā anidassanaappaṭighassa dhammassa purejātaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sanidassanasappaṭigho ca anidassanasappaṭigho ca anidassanaappaṭigho ca dhammā anidassanaappaṭighassa dhammassa sahajātapaccayena paccayo… purejātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Paccayapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Saṅkhyāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Suddhaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "63"
      },
      ". Nahetuyā ",
      " pañcavīsa, naārammaṇe dvāvīsa, naadhipatiyā pañcavīsa, naanantare pañcavīsa, nasamanantare pañcavīsa, nasahajāte dvādasa, naaññamaññe catuvīsa, nanissaye nava, naupanissaye pañcavīsa, napurejāte bāvīsa, napacchājāte pañcavīsa, naāsevane pañcavīsa, nakamme pañcavīsa, navipāke catuvīsa, naāhāre pañcavīsa, naindriye tevīsa, najhāne pañcavīsa, namagge pañcavīsa, nasampayutte catuvīsa, navippayutte bāvīsa, noatthiyā ",
      " nava, nonatthiyā pañcavīsa, novigate pañcavīsa, noavigate nava."
    ],
    "innerText": "63. Nahetuyā pañcavīsa, naārammaṇe dvāvīsa, naadhipatiyā pañcavīsa, naanantare pañcavīsa, nasamanantare pañcavīsa, nasahajāte dvādasa, naaññamaññe catuvīsa, nanissaye nava, naupanissaye pañcavīsa, napurejāte bāvīsa, napacchājāte pañcavīsa, naāsevane pañcavīsa, nakamme pañcavīsa, navipāke catuvīsa, naāhāre pañcavīsa, naindriye tevīsa, najhāne pañcavīsa, namagge pañcavīsa, nasampayutte catuvīsa, navippayutte bāvīsa, noatthiyā nava, nonatthiyā pañcavīsa, novigate pañcavīsa, noavigate nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nahetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nahetupaccayā naārammaṇe bāvīsa (paṭhamagamanasadisaṃ), noavigate nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nahetutikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nahetupaccayā naārammaṇapaccayā naadhipatiyā bāvīsa, naanantare bāvīsa, nasamanantare bāvīsa, nasahajāte nava, naaññamaññe bāvīsa, nanissaye nava, naupanissaye ekavīsa, napurejāte bāvīsa, napacchājāte bāvīsa…pe… nasampayutte bāvīsa, navippayutte bāvīsa ",
      ", noatthiyā nava, nonatthiyā bāvīsa, novigate bāvīsa, noavigate nava (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "Nahetupaccayā naārammaṇapaccayā naadhipatiyā bāvīsa, naanantare bāvīsa, nasamanantare bāvīsa, nasahajāte nava, naaññamaññe bāvīsa, nanissaye nava, naupanissaye ekavīsa, napurejāte bāvīsa, napacchājāte bāvīsa…pe… nasampayutte bāvīsa, navippayutte bāvīsa , noatthiyā nava, nonatthiyā bāvīsa, novigate bāvīsa, noavigate nava (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccanīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Paccayānulomapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "64"
      },
      ". Hetupaccayā naārammaṇe satta, naadhipatiyā satta, naanantare satta, nasamanantare satta, naaññamaññe satta, naupanissaye satta, napurejāte satta, napacchājāte satta…pe… nasampayutte satta, navippayutte ekaṃ, nonatthiyā satta, novigate satta."
    ],
    "innerText": "64. Hetupaccayā naārammaṇe satta, naadhipatiyā satta, naanantare satta, nasamanantare satta, naaññamaññe satta, naupanissaye satta, napurejāte satta, napacchājāte satta…pe… nasampayutte satta, navippayutte ekaṃ, nonatthiyā satta, novigate satta."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetusāmaññaghaṭanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "65"
      },
      ". Hetu-sahajāta-nissaya-atthi-avigatanti ",
      " naārammaṇe satta…pe… naanantare satta, nasamanantare satta, naaññamaññe satta (idhāpi saṃkhittaṃ), nasampayutte satta, navippayutte ekaṃ, nonatthiyā satta, novigate satta."
    ],
    "innerText": "65. Hetu-sahajāta-nissaya-atthi-avigatanti naārammaṇe satta…pe… naanantare satta, nasamanantare satta, naaññamaññe satta (idhāpi saṃkhittaṃ), nasampayutte satta, navippayutte ekaṃ, nonatthiyā satta, novigate satta."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hetu ",
      " -sahajāta-aññamañña-nissaya-atthi-avigatanti naārammaṇe ekaṃ (sabbattha ekaṃ), novigate ekaṃ (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "Hetu -sahajāta-aññamañña-nissaya-atthi-avigatanti naārammaṇe ekaṃ (sabbattha ekaṃ), novigate ekaṃ (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anulomapaccanīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4. Paccayapaccanīyānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nahetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "66"
      },
      ". Nahetupaccayā ",
      " ārammaṇe tīṇi, adhipatiyā nava, anantare ekaṃ, samanantare ekaṃ, sahajāte ekavīsa, aññamaññe cha, nissaye ekavīsa, upanissaye tīṇi, purejāte cha, pacchājāte satta, āsevane ekaṃ, kamme satta, vipāke satta, āhāre satta, indriye nava, jhāne satta, magge satta, sampayutte ekaṃ, vippayutte aṭṭha, atthiyā pañcavīsa, natthiyā ekaṃ, vigate ekaṃ, avigate pañcavīsa (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "66. Nahetupaccayā ārammaṇe tīṇi, adhipatiyā nava, anantare ekaṃ, samanantare ekaṃ, sahajāte ekavīsa, aññamaññe cha, nissaye ekavīsa, upanissaye tīṇi, purejāte cha, pacchājāte satta, āsevane ekaṃ, kamme satta, vipāke satta, āhāre satta, indriye nava, jhāne satta, magge satta, sampayutte ekaṃ, vippayutte aṭṭha, atthiyā pañcavīsa, natthiyā ekaṃ, vigate ekaṃ, avigate pañcavīsa (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccanīyānulomaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañhāvāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sanidassanasappaṭighattikaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhammānulome tikapaṭṭhānaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyo bhāgo niṭṭhito."
  }
]