[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "17. Sattarasamo paricchedo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Abhiññārammaṇaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1104-5"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañca"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iddhividhādīnī"
      },
      "ti –"
    ],
    "innerText": "1104-5.Pañcaiddhividhādīnīti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Iddhividhaṃ dibbasotaṃ, paracittavijānanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pubbenivāsānussati, dibbacakkhūti pañcadhā’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evamāgatā pañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattābhiññā imā panā"
      },
      "ti atītaṃsañāṇassa pubbenivāsānussatiñāṇe, manomayañāṇassa ca iddhividhañāṇe antogadhattā vuttaṃ. Atītaṃsañāṇaṃ nāma paresaṃ paccuppannabhave yāva paṭisandhipariyosānaṃ pavattacittārammaṇaṃ ñāṇaṃ. Manomayañāṇampi nāma manomayakāyābhinimmānādivasappavattaṃ iddhividhañāṇaṃ."
    ],
    "innerText": "Evamāgatā pañca. Sattābhiññā imā panāti atītaṃsañāṇassa pubbenivāsānussatiñāṇe, manomayañāṇassa ca iddhividhañāṇe antogadhattā vuttaṃ. Atītaṃsañāṇaṃ nāma paresaṃ paccuppannabhave yāva paṭisandhipariyosānaṃ pavattacittārammaṇaṃ ñāṇaṃ. Manomayañāṇampi nāma manomayakāyābhinimmānādivasappavattaṃ iddhividhañāṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1106"
      },
      ". Idāni imesaṃ abhiññāñāṇānaṃ ārammaṇavinicchaye asammohatthaṃ taṃ dassetumārabhanto āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sattanna’’"
      },
      "ntiādi ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattāro ārammaṇattikā"
      },
      "ti parittārammaṇattiko maggārammaṇattiko atītārammaṇattiko ajjhattārammaṇattikoti ime cattāro ārammaṇattikā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etthā"
      },
      "ti idaṃ paccāmasanaṃ kiṃ tikānaṃ, udāhu ārammaṇānanti, kiñcettha – yadi tikānaṃ, tadayuttaṃ. Na hi tikesu abhiññāñāṇāni pavattanti. Atha ārammaṇānaṃ, tampi ayuttaṃ. Na hi aññaṃ uddisitvā aññassa paccāmasanaṃ yuttanti. Yathā icchasi, tathā hotu. Bhavatu tāva tikānaṃ, nanu vuttaṃ ‘‘tikesu abhiññāñāṇāni nappavattantī’’ti? Nāyaṃ virodho tikavohārena ārammaṇānaṃyeva gayhamānattā. Atha vā pana hotu ārammaṇānaṃ, nanu vuttaṃ ‘‘aññaṃ uddisitvā aññassa paccāmasanaṃ ayutta’’nti. Ayampi na doso yathāvuttakāraṇenevāti."
    ],
    "innerText": "1106. Idāni imesaṃ abhiññāñāṇānaṃ ārammaṇavinicchaye asammohatthaṃ taṃ dassetumārabhanto āha ‘‘sattanna’’ntiādi . Cattāro ārammaṇattikāti parittārammaṇattiko maggārammaṇattiko atītārammaṇattiko ajjhattārammaṇattikoti ime cattāro ārammaṇattikā. Etthāti idaṃ paccāmasanaṃ kiṃ tikānaṃ, udāhu ārammaṇānanti, kiñcettha – yadi tikānaṃ, tadayuttaṃ. Na hi tikesu abhiññāñāṇāni pavattanti. Atha ārammaṇānaṃ, tampi ayuttaṃ. Na hi aññaṃ uddisitvā aññassa paccāmasanaṃ yuttanti. Yathā icchasi, tathā hotu. Bhavatu tāva tikānaṃ, nanu vuttaṃ ‘‘tikesu abhiññāñāṇāni nappavattantī’’ti? Nāyaṃ virodho tikavohārena ārammaṇānaṃyeva gayhamānattā. Atha vā pana hotu ārammaṇānaṃ, nanu vuttaṃ ‘‘aññaṃ uddisitvā aññassa paccāmasanaṃ ayutta’’nti. Ayampi na doso yathāvuttakāraṇenevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1107-10"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parittādīsu sattasū"
      },
      "ti asatipi vatthubhede bhūmikālasantānabhedavasena bhinnesu ",
      " parittamahaggataatītānāgatapaccuppannaajjhattabahiddhārammaṇavasena sattasu parittādiārammaṇavibhāgesu. Iddhividhañāṇassa maggārammaṇatāya abhāvato idha maggārammaṇattiko na labbhati. Kāyaṃ cittasannissitaṃ katvā adissamānena kāyena gantukāmoti sambandho. Cittasannissitakaraṇañca taṃ viya kāyassa adissamānasīghagatikatāvasena taggatikatāpādanaṃ. Yathā cittaṃ na dissati sīghagamanañca, evaṃ kāyampi adissamānaṃ, sīghagamanañca katvā yathicchitaṭṭhānaṃ gantukāmoti ayañhettha attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittavasenā"
      },
      "ti mahaggatacittavasena pariṇāmetīti pāṭhaseso. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘taṃ mahaggate ca cittasmiṃ samāropetī’’"
      },
      "ti. Pādakajjhānañhi samāpajjitvā vuṭṭhāya ‘‘ayaṃ kāyo idaṃ cittaṃ viya adissamāno, sīghagamano ca hotū’’ti parikammaṃ karoti, parikammaṃ pana katvā puna samāpajjitvā ",
      " vuṭṭhāya tatheva parikammaṃ karonto kāyaṃ gahetvā mahaggate pādakacitte samāropeti, taggatikaṃ karoti viya, adissamānaṃ, sīghagamanañca karoti. Taṃ pana sīghagamanatthaṃ abhāvitiddhipādānaṃ viya dandhaṃ appavattitvā katipayacittavāreheva icchitaṭṭhānappattivasena daṭṭhabbaṃ, na ekacittakkhaṇeneva. ‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi, yaṃ evaṃ lahuparivattaṃ, yathayidaṃ, bhikkhave, citta’’nti (a. ni. 1.48) hi ettha añña-ggahaṇeneva rūpadhammānaṃ gahitattā cittakkhaṇavasena rūpappavatti na yuttā. Yattha yattha ca dhammā uppajjanti, tattha tattheva bhijjanti ca, na ca iddhibalena dhammānaṃ kenaci lakkhaṇaññathattaṃ sakkā kātunti. Cittavasena rūpakāyaṃ pādakajjhāne samāropentassa kāyameva ārammaṇanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kāyārammaṇato’’"
      },
      "ti, kāye vaṇṇārammaṇatoti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyasannissitaṃ katvā citta"
      },
      "nti ettha na cittaṃ kāyaṃ viya dandhaṃ dissamānaṃ karoti, kintu dandhadissamānagatikaraṇamattamevāti daṭṭhabbaṃ."
    ],
    "innerText": "1107-10.Parittādīsu sattasūti asatipi vatthubhede bhūmikālasantānabhedavasena bhinnesu parittamahaggataatītānāgatapaccuppannaajjhattabahiddhārammaṇavasena sattasu parittādiārammaṇavibhāgesu. Iddhividhañāṇassa maggārammaṇatāya abhāvato idha maggārammaṇattiko na labbhati. Kāyaṃ cittasannissitaṃ katvā adissamānena kāyena gantukāmoti sambandho. Cittasannissitakaraṇañca taṃ viya kāyassa adissamānasīghagatikatāvasena taggatikatāpādanaṃ. Yathā cittaṃ na dissati sīghagamanañca, evaṃ kāyampi adissamānaṃ, sīghagamanañca katvā yathicchitaṭṭhānaṃ gantukāmoti ayañhettha attho. Cittavasenāti mahaggatacittavasena pariṇāmetīti pāṭhaseso. Tenāha ‘‘taṃ mahaggate ca cittasmiṃ samāropetī’’ti. Pādakajjhānañhi samāpajjitvā vuṭṭhāya ‘‘ayaṃ kāyo idaṃ cittaṃ viya adissamāno, sīghagamano ca hotū’’ti parikammaṃ karoti, parikammaṃ pana katvā puna samāpajjitvā vuṭṭhāya tatheva parikammaṃ karonto kāyaṃ gahetvā mahaggate pādakacitte samāropeti, taggatikaṃ karoti viya, adissamānaṃ, sīghagamanañca karoti. Taṃ pana sīghagamanatthaṃ abhāvitiddhipādānaṃ viya dandhaṃ appavattitvā katipayacittavāreheva icchitaṭṭhānappattivasena daṭṭhabbaṃ, na ekacittakkhaṇeneva. ‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi, yaṃ evaṃ lahuparivattaṃ, yathayidaṃ, bhikkhave, citta’’nti (a. ni. 1.48) hi ettha añña-ggahaṇeneva rūpadhammānaṃ gahitattā cittakkhaṇavasena rūpappavatti na yuttā. Yattha yattha ca dhammā uppajjanti, tattha tattheva bhijjanti ca, na ca iddhibalena dhammānaṃ kenaci lakkhaṇaññathattaṃ sakkā kātunti. Cittavasena rūpakāyaṃ pādakajjhāne samāropentassa kāyameva ārammaṇanti āha ‘‘kāyārammaṇato’’ti, kāye vaṇṇārammaṇatoti vuttaṃ hoti. Kāyasannissitaṃ katvā cittanti ettha na cittaṃ kāyaṃ viya dandhaṃ dissamānaṃ karoti, kintu dandhadissamānagatikaraṇamattamevāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1112-3"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāgatamatītañca karoti visayaṃ yadā"
      },
      "ti mahādhātunidhāne mahākassapattherādīnaṃ viya anāgataṃ adhiṭṭhahantānaṃ anāgataṃ ārammaṇaṃ karoti, kāyavasena cittapariṇāmanakāle tadeva ciraniruddhaṃ pādakajjhānaṃ ārammaṇaṃ karontānaṃ atītaṃ ārammaṇaṃ karoti, tadā atītārammaṇaṃ, anāgatagocarañca hoti, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccuppanno gocaro"
      },
      " paccuppannassa rūpakāyassa ārammaṇakaraṇato. Hatthiādayo abhinimminantassāpi hi kiñcāpi parikammaṃ anāgatārammaṇaṃ hoti, adhiṭṭhānacittaṃ pana paccuppannārammaṇameva. Upacārārammaṇaṃ viya hi paṭibhāganimittaṃ tena saha pātubhūtameva tassārammaṇaṃ hoti."
    ],
    "innerText": "1112-3.Anāgatamatītañca karoti visayaṃ yadāti mahādhātunidhāne mahākassapattherādīnaṃ viya anāgataṃ adhiṭṭhahantānaṃ anāgataṃ ārammaṇaṃ karoti, kāyavasena cittapariṇāmanakāle tadeva ciraniruddhaṃ pādakajjhānaṃ ārammaṇaṃ karontānaṃ atītaṃ ārammaṇaṃ karoti, tadā atītārammaṇaṃ, anāgatagocarañca hoti, paccuppanno gocaro paccuppannassa rūpakāyassa ārammaṇakaraṇato. Hatthiādayo abhinimminantassāpi hi kiñcāpi parikammaṃ anāgatārammaṇaṃ hoti, adhiṭṭhānacittaṃ pana paccuppannārammaṇameva. Upacārārammaṇaṃ viya hi paṭibhāganimittaṃ tena saha pātubhūtameva tassārammaṇaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1114-5"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "…pe…"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "siyā"
      },
      "ti attano kāyaṃ cittavasena pariṇāmanakāle ajjhattassa kāyassa ārammaṇakaraṇato, attano cittaṃ kāyavasena pariṇāmanakāle cittassa ārammaṇakaraṇato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vā"
      },
      "-saddena avuttasamuccayatthena gahite attano kumāravaṇṇādiabhinimmānakāle kāyassa ārammaṇakaraṇato ca ajjhattārammaṇaṃ siyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahiddhā rūpadassane"
      },
      "ti bahiddhā hatthiassādirūpadassanakāle."
    ],
    "innerText": "1114-5.Kāyaṃ…pe…siyāti attano kāyaṃ cittavasena pariṇāmanakāle ajjhattassa kāyassa ārammaṇakaraṇato, attano cittaṃ kāyavasena pariṇāmanakāle cittassa ārammaṇakaraṇato. Vā-saddena avuttasamuccayatthena gahite attano kumāravaṇṇādiabhinimmānakāle kāyassa ārammaṇakaraṇato ca ajjhattārammaṇaṃ siyā. Bahiddhā rūpadassaneti bahiddhā hatthiassādirūpadassanakāle."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1116-8"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccuppanne paritte cā"
      },
      "ti sarūpavibhāvanametaṃ. Dibbasotassa hi paccuppannova saddo ārammaṇaṃ hoti, so ca sabhāvato parittova. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kucchisaddassā"
      },
      "ti kucchiyaṃ vātasaddassa. Tattha pāṇakasaddassa pana savane bahiddhārammaṇameva. Vasitāpattassa attano vitakkavipphārasaddasavanepi ajjhattārammaṇanti vadanti, taṃ pana ekādasabhavaṅgacittato upari bhavaṅgaṃ pavattitumadatvā bhavaṅgato vuṭṭhāya āvajjanasamatthatāvasena vasitāpattasseva yujjati. ‘‘Parassa ca saddassā’’ti sambandhitabbaṃ. Na hi parassa kucchisaddasavaneyeva bahiddhārammaṇaṃ hoti, atha kho parassa cittasamuṭṭhānasaddasavanepīti."
    ],
    "innerText": "1116-8.Paccuppanne paritte cāti sarūpavibhāvanametaṃ. Dibbasotassa hi paccuppannova saddo ārammaṇaṃ hoti, so ca sabhāvato parittova. Kucchisaddassāti kucchiyaṃ vātasaddassa. Tattha pāṇakasaddassa pana savane bahiddhārammaṇameva. Vasitāpattassa attano vitakkavipphārasaddasavanepi ajjhattārammaṇanti vadanti, taṃ pana ekādasabhavaṅgacittato upari bhavaṅgaṃ pavattitumadatvā bhavaṅgato vuṭṭhāya āvajjanasamatthatāvasena vasitāpattasseva yujjati. ‘‘Parassa ca saddassā’’ti sambandhitabbaṃ. Na hi parassa kucchisaddasavaneyeva bahiddhārammaṇaṃ hoti, atha kho parassa cittasamuṭṭhānasaddasavanepīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1119-22"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parittādīsū"
      },
      "ti parittamahaggataappamāṇamaggaatītānāgatapaccuppannabahiddhārammaṇesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parittāna"
      },
      "nti kāmāvacaracittānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhimāna"
      },
      "nti parittaappamāṇānaṃ majjhe bhavattā majjhimasaṅkhātānaṃ rūpārūpāvacaracittānaṃ. Majjhebhavatā ca desanāvasena, na sabhāvavasena. Cetopariyañāṇaṃ parassa cittameva jānāti, avasesakkhandhattayaṃ pana na jānātīti imaṃ mahāaṭṭhakathāvādaṃ sandhāyāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘maggacittassa jānane’’"
      },
      "tiādi. Ayañhettha adhippāyo – yasmā cetopariyañāṇaṃ cittameva jānāti, tasmā taṃ maggārammaṇaṃ na hoti ",
      ", maggasampayuttacittajānanato pana pariyāyena maggārammaṇatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathāyaṃ"
      },
      " anuññātāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭṭhāne"
      },
      " pana –"
    ],
    "innerText": "1119-22.Parittādīsūti parittamahaggataappamāṇamaggaatītānāgatapaccuppannabahiddhārammaṇesu. Parittānanti kāmāvacaracittānaṃ. Majjhimānanti parittaappamāṇānaṃ majjhe bhavattā majjhimasaṅkhātānaṃ rūpārūpāvacaracittānaṃ. Majjhebhavatā ca desanāvasena, na sabhāvavasena. Cetopariyañāṇaṃ parassa cittameva jānāti, avasesakkhandhattayaṃ pana na jānātīti imaṃ mahāaṭṭhakathāvādaṃ sandhāyāha ‘‘maggacittassa jānane’’tiādi. Ayañhettha adhippāyo – yasmā cetopariyañāṇaṃ cittameva jānāti, tasmā taṃ maggārammaṇaṃ na hoti , maggasampayuttacittajānanato pana pariyāyena maggārammaṇatā aṭṭhakathāyaṃ anuññātāti. Paṭṭhāne pana –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Kusalā khandhā iddhividhañāṇassa cetopariyañāṇassa pubbenivāsānussatiñāṇassa yathākammūpagañāṇassa anāgataṃsañāṇassa ārammaṇapaccayena paccayo’’ti (paṭṭhā. 1.1.404) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Vuttattā ",
      " cattāropi khandhā cetopariyañāṇassa ārammaṇaṃ honti, tasmā nippariyāyeneva maggārammaṇatā labbhatīti idamettha saṅgahakārānaṃ sanniṭṭhānaṃ."
    ],
    "innerText": "Vuttattā cattāropi khandhā cetopariyañāṇassa ārammaṇaṃ honti, tasmā nippariyāyeneva maggārammaṇatā labbhatīti idamettha saṅgahakārānaṃ sanniṭṭhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1123-5"
      },
      ". Atītasattadivasabbhantare, anāgatasattadivasabbhantareyeva ca pavattaṃ paracittaṃ cetopariyañāṇaṃ jānāti, tato paṭṭhāya pana paṭisandhipariyosānaṃ, cutipariyosānañca pavattaṃ atītaṃsañāṇassa, anāgataṃsañāṇassa ca gocaranti adhippāyenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atīte’’"
      },
      "tiādi. Atītassa, anāgatassa ca paracittassa jānanaṃ sambhavati, paccuppannassa pana na sambhavatīti pucchati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kathañca panā’’"
      },
      "tiādi. Itaro yattha sambhavati, taṃ dassetuṃ paccuppannaṃ tāva vibhajitvā dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paccuppannaṃ tidhā vutta’’"
      },
      "ntiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khaṇasantatiaddhato"
      },
      "ti khaṇapaccuppannaṃ santatipaccuppannaṃ addhāpaccuppannanti evaṃ khaṇasantatiaddhāvasena tidhā vuttaṃ."
    ],
    "innerText": "1123-5. Atītasattadivasabbhantare, anāgatasattadivasabbhantareyeva ca pavattaṃ paracittaṃ cetopariyañāṇaṃ jānāti, tato paṭṭhāya pana paṭisandhipariyosānaṃ, cutipariyosānañca pavattaṃ atītaṃsañāṇassa, anāgataṃsañāṇassa ca gocaranti adhippāyenāha ‘‘atīte’’tiādi. Atītassa, anāgatassa ca paracittassa jānanaṃ sambhavati, paccuppannassa pana na sambhavatīti pucchati ‘‘kathañca panā’’tiādi. Itaro yattha sambhavati, taṃ dassetuṃ paccuppannaṃ tāva vibhajitvā dassento ‘‘paccuppannaṃ tidhā vutta’’ntiādimāha. Khaṇasantatiaddhatoti khaṇapaccuppannaṃ santatipaccuppannaṃ addhāpaccuppannanti evaṃ khaṇasantatiaddhāvasena tidhā vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1126"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tikkhaṇasampatta"
      },
      "nti uppādaṭṭhitibhaṅgavasena khaṇattayapariyāpannaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccuppannakhaṇādika"
      },
      "nti khaṇa-saddādikaṃ paccuppannaṃ khaṇapaccuppannanti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekadvesantativārapariyāpanna"
      },
      "nti ettha andhakāre nisīditvā ālokaṭṭhānaṃ gatassa na ca tāva ārammaṇaṃ pākaṭaṃ hoti, yāva pana taṃ pākaṭaṃ hoti, etthantare pavattā rūpasantati, arūpasantati vā ‘‘ekadvesantativārā’’ti ",
      " veditabbā. ‘‘Ālokaṭṭhāne vicaritvā ovarakaṃ paviṭṭhassāpi na tāva sahasā rūpaṃ pākaṭaṃ hoti, yāva taṃ pākaṭaṃ hoti, pubbeva tattha nisinnassa viya etthantare ekadvesantativārā veditabbā. Dūre ṭhatvā pana rajakādīnaṃ hatthavikāraṃ, ghaṇṭibherīādiākoṭanahatthavikārañca disvā na pana tāva saddaṃ suṇāti, yāva pana taṃ suṇāti, etthantare ekadvesantativārā veditabbā’’ti (visuddhi. 2.416) evaṃ tāva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "majjhimabhāṇakattherā"
      },
      " vadanti."
    ],
    "innerText": "1126.Tikkhaṇasampattanti uppādaṭṭhitibhaṅgavasena khaṇattayapariyāpannaṃ. Paccuppannakhaṇādikanti khaṇa-saddādikaṃ paccuppannaṃ khaṇapaccuppannanti vuttaṃ hoti. Ekadvesantativārapariyāpannanti ettha andhakāre nisīditvā ālokaṭṭhānaṃ gatassa na ca tāva ārammaṇaṃ pākaṭaṃ hoti, yāva pana taṃ pākaṭaṃ hoti, etthantare pavattā rūpasantati, arūpasantati vā ‘‘ekadvesantativārā’’ti veditabbā. ‘‘Ālokaṭṭhāne vicaritvā ovarakaṃ paviṭṭhassāpi na tāva sahasā rūpaṃ pākaṭaṃ hoti, yāva taṃ pākaṭaṃ hoti, pubbeva tattha nisinnassa viya etthantare ekadvesantativārā veditabbā. Dūre ṭhatvā pana rajakādīnaṃ hatthavikāraṃ, ghaṇṭibherīādiākoṭanahatthavikārañca disvā na pana tāva saddaṃ suṇāti, yāva pana taṃ suṇāti, etthantare ekadvesantativārā veditabbā’’ti (visuddhi. 2.416) evaṃ tāva majjhimabhāṇakattherā vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃyuttabhāṇakā"
      },
      " pana ‘‘rūpasantati arūpasantatīti dve santatiyo vatvā udakaṃ akkamitvā gatassa yāva tīre akkantaudakalekhā na vippasīdati, addhānato āgatassa yāva kāye usumabhāvo na vūpasammati, ātapā āgantvā gabbhaṃ paviṭṭhassa yāva andhakārabhāvo na vigacchati, antogabbhe kammaṭṭhānaṃ manasikatvā divā vātapānaṃ vivaritvā olokentassa yāva akkhīnaṃ phandanabhāvo na vūpasammati, ayaṃ rūpasantati nāma. Dve tayo javanavārā arūpasantati nāmāti vatvā tadubhayampi santatipaccuppannaṃ nāmā’’ti (visuddhi. 2.416) evaṃ ",
      " ekameva santativāraṃ vadanti. Tattha majjhimabhāṇakavāde ekaccassa sīghampi pākaṭaṃ hotīti ekadvesantativārāti eka-ggahaṇampi kataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ācariyadhammapāla"
      },
      "tthero pana ‘‘atiparittasabhāvautuādisamuṭṭhānā vā ekadvesantativārā veditabbā’’tipi (visuddhi. mahā. 2.416) āha."
    ],
    "innerText": "Saṃyuttabhāṇakā pana ‘‘rūpasantati arūpasantatīti dve santatiyo vatvā udakaṃ akkamitvā gatassa yāva tīre akkantaudakalekhā na vippasīdati, addhānato āgatassa yāva kāye usumabhāvo na vūpasammati, ātapā āgantvā gabbhaṃ paviṭṭhassa yāva andhakārabhāvo na vigacchati, antogabbhe kammaṭṭhānaṃ manasikatvā divā vātapānaṃ vivaritvā olokentassa yāva akkhīnaṃ phandanabhāvo na vūpasammati, ayaṃ rūpasantati nāma. Dve tayo javanavārā arūpasantati nāmāti vatvā tadubhayampi santatipaccuppannaṃ nāmā’’ti (visuddhi. 2.416) evaṃ ekameva santativāraṃ vadanti. Tattha majjhimabhāṇakavāde ekaccassa sīghampi pākaṭaṃ hotīti ekadvesantativārāti eka-ggahaṇampi kataṃ. Ācariyadhammapālatthero pana ‘‘atiparittasabhāvautuādisamuṭṭhānā vā ekadvesantativārā veditabbā’’tipi (visuddhi. mahā. 2.416) āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1127-8"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekabbhavaparicchinna"
      },
      "nti ekasmiṃ bhave paṭisandhicutivasena paricchinnaṃ ekabhavapariyāpannaṃ dhammajātaṃ. Yaṃ sandhāya vuttaṃ ‘‘yo cāvuso mano, ye ca dhammā, ubhayametaṃ paccuppannaṃ, tasmiṃ ce paccuppanne chandarāgapaṭibaddhaṃ hoti viññāṇa’’ntiādi, santatipaccuppannañcettha abhidhammaṭṭhakathāsu āgataṃ, addhāpaccuppannaṃ sutte. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kecī"
      },
      "ti abhayagirivāsino."
    ],
    "innerText": "1127-8.Ekabbhavaparicchinnanti ekasmiṃ bhave paṭisandhicutivasena paricchinnaṃ ekabhavapariyāpannaṃ dhammajātaṃ. Yaṃ sandhāya vuttaṃ ‘‘yo cāvuso mano, ye ca dhammā, ubhayametaṃ paccuppannaṃ, tasmiṃ ce paccuppanne chandarāgapaṭibaddhaṃ hoti viññāṇa’’ntiādi, santatipaccuppannañcettha abhidhammaṭṭhakathāsu āgataṃ, addhāpaccuppannaṃ sutte. Kecīti abhayagirivāsino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1129-30"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cā"
      },
      "tiādi ettha tesaṃ opammadassanaṃ. Ekapupphaṃ attano vaṇṭena ekassa vaṇṭaṃ vijjhatīti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahājanassāpi…pe… vijjhatī"
      },
      "ti ‘‘atītaṃ cittaṃ, anāgataṃ cittaṃ, imassa cittaṃ, asukassa citta’’nti evaṃ vibhāgaṃ akatvā parassa cittaṃ jānāmicceva rāsivasena mahājanassa citte āvajjite ekassa cittaṃ ekena cittena uppādakkhaṇe vā ṭhitikkhaṇe vā bhaṅgakkhaṇe vā ekantena paṭivijjhatīti attho."
    ],
    "innerText": "1129-30.Yathācātiādi ettha tesaṃ opammadassanaṃ. Ekapupphaṃ attano vaṇṭena ekassa vaṇṭaṃ vijjhatīti sambandho. Mahājanassāpi…pe… vijjhatīti ‘‘atītaṃ cittaṃ, anāgataṃ cittaṃ, imassa cittaṃ, asukassa citta’’nti evaṃ vibhāgaṃ akatvā parassa cittaṃ jānāmicceva rāsivasena mahājanassa citte āvajjite ekassa cittaṃ ekena cittena uppādakkhaṇe vā ṭhitikkhaṇe vā bhaṅgakkhaṇe vā ekantena paṭivijjhatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1131-2"
      },
      ". Taṃ pana tesaṃ vacanaṃ ayuttanti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yenāvajjatī’’"
      },
      "tiādi vuttaṃ. Vassasahassampi hi evaṃ āvajjayato āvajjanajavanānaṃ ekasmiṃ ārammaṇe ṭhānaṃ natthi, abhiññācittañca sace khaṇapaccuppannaṃ jānāti, āvajjanena saha ekārammaṇe vattamānameva jānāti, no aññathā, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tesaṃ"
      },
      " āvajjanajavanānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvinnaṃ saha"
      },
      " ekasmiṃ ārammaṇe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhānābhāvato taṃ na yujjati"
      },
      ". Bhavatu tāva ko ettha dosoti ce āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āvajjanajavanāna’’"
      },
      "ntiādi. Tattha maggaphalavīthito aññaṃ aniṭṭhaṭṭhānaṃ. Maggaphalavīthiyañhi āvajjanādīnaṃ saṅkhārārammaṇattā, gotrabhuādīnañca nibbānārammaṇattā nānārammaṇatā iṭṭhā, aññattha pana aniṭṭhā, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aniṭṭhe ṭhāne javanāvajjanānaṃ"
      },
      " nānārammaṇatāpattidoso ayuttoti taṃ tesaṃ vacanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ayuttanti pakāsitaṃ"
      },
      " aṭṭhakathāsūti adhippāyo."
    ],
    "innerText": "1131-2. Taṃ pana tesaṃ vacanaṃ ayuttanti dassetuṃ ‘‘yenāvajjatī’’tiādi vuttaṃ. Vassasahassampi hi evaṃ āvajjayato āvajjanajavanānaṃ ekasmiṃ ārammaṇe ṭhānaṃ natthi, abhiññācittañca sace khaṇapaccuppannaṃ jānāti, āvajjanena saha ekārammaṇe vattamānameva jānāti, no aññathā, tasmā tesaṃ āvajjanajavanānaṃ dvinnaṃ saha ekasmiṃ ārammaṇe aṭṭhānābhāvato taṃ na yujjati. Bhavatu tāva ko ettha dosoti ce āha ‘‘āvajjanajavanāna’’ntiādi. Tattha maggaphalavīthito aññaṃ aniṭṭhaṭṭhānaṃ. Maggaphalavīthiyañhi āvajjanādīnaṃ saṅkhārārammaṇattā, gotrabhuādīnañca nibbānārammaṇattā nānārammaṇatā iṭṭhā, aññattha pana aniṭṭhā, tasmā aniṭṭhe ṭhāne javanāvajjanānaṃ nānārammaṇatāpattidoso ayuttoti taṃ tesaṃ vacanaṃ ayuttanti pakāsitaṃ aṭṭhakathāsūti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1133-4"
      },
      ". Yadi evaṃ, kathaṃ cetopariyañāṇaṃ paccuppannārammaṇaṃ hotīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tasmā’’"
      },
      "tiādi. Yasmā evaṃ ayuttanti pakāsitaṃ, tasmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Javanavārato"
      },
      "ti ekajavanavāravasena ",
      ". Idaṃ pana khaṇapaccuppannānantaraṃ lahukaṃ katvā paccuppannadassanatthaṃ vuttaṃ, yaṃ pana vattamānajavanavīthito atītānāgatavasena dvitijavanavīthiparimāṇakāle pavattaṃ paracittaṃ ",
      ", taṃ sabbampi ‘‘santatipaccuppannaṃ nāmā’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathāyaṃ"
      },
      " (visuddhi. 2.416) vuttaṃ, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "javanavārato"
      },
      "ti dvitijavanavāravasena dīpetabbaṃ, na sakalena paccuppannaddhunāti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niddiṭṭhaṃ"
      },
      " saṃyuttaṭṭhakathāyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatrāyaṃ dīpanā"
      },
      "tiādi javanavārassa addhāpaccuppannabhāvadīpanamukhena iddhicittassa pavattiākāradīpanaṃ."
    ],
    "innerText": "1133-4. Yadi evaṃ, kathaṃ cetopariyañāṇaṃ paccuppannārammaṇaṃ hotīti āha ‘‘tasmā’’tiādi. Yasmā evaṃ ayuttanti pakāsitaṃ, tasmā. Javanavāratoti ekajavanavāravasena . Idaṃ pana khaṇapaccuppannānantaraṃ lahukaṃ katvā paccuppannadassanatthaṃ vuttaṃ, yaṃ pana vattamānajavanavīthito atītānāgatavasena dvitijavanavīthiparimāṇakāle pavattaṃ paracittaṃ , taṃ sabbampi ‘‘santatipaccuppannaṃ nāmā’’ti aṭṭhakathāyaṃ (visuddhi. 2.416) vuttaṃ, tasmā javanavāratoti dvitijavanavāravasena dīpetabbaṃ, na sakalena paccuppannaddhunāti adhippāyo. Niddiṭṭhaṃ saṃyuttaṭṭhakathāyaṃ. Tatrāyaṃ dīpanātiādi javanavārassa addhāpaccuppannabhāvadīpanamukhena iddhicittassa pavattiākāradīpanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1139-41"
      },
      ". Santatipaccuppannampi addhāpaccuppanneneva saṅgahetvā āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘addhāvasā…pe… panā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ānandācariyo"
      },
      " panettha abhidhammamātikāya āgatassa paccuppannapadassa addhāsantatipaccuppannapadatthatā na katthaci pāḷiyaṃ vuttā, tasmā cittasāmaññena cittaṃ āvajjayamānaṃ abhimukhībhūtaṃ vijjamānacittaṃ āvajjeti, parikammāni ca taṃ taṃ vijjamānacittaṃ cittasāmaññeneva ārammaṇaṃ katvā cittajānanaparikammāni hutvā pavattanti. Cetopariyañāṇaṃ pana vijjamānacittaṃ paṭivijjhantaṃ tena saha ekakkhaṇe uppajjati. Tattha yasmā santānaggahaṇato ekattavasena āvajjanādīni cittanteva pavattāni, tañca cittameva, yaṃ cetopariyañāṇena vibhāvitaṃ, tasmā samānākārappavattito na aniṭṭhe ṭhāne nānārammaṇatā hotīti khaṇapaccuppannavaseneva imassa paccuppannārammaṇataṃ icchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itarānī"
      },
      "ti āvajjanaparikammacittāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhudvāre viññāṇa"
      },
      "nti cakkhuviññāṇaṃ."
    ],
    "innerText": "1139-41. Santatipaccuppannampi addhāpaccuppanneneva saṅgahetvā āha ‘‘addhāvasā…pe… panā’’ti. Ānandācariyo panettha abhidhammamātikāya āgatassa paccuppannapadassa addhāsantatipaccuppannapadatthatā na katthaci pāḷiyaṃ vuttā, tasmā cittasāmaññena cittaṃ āvajjayamānaṃ abhimukhībhūtaṃ vijjamānacittaṃ āvajjeti, parikammāni ca taṃ taṃ vijjamānacittaṃ cittasāmaññeneva ārammaṇaṃ katvā cittajānanaparikammāni hutvā pavattanti. Cetopariyañāṇaṃ pana vijjamānacittaṃ paṭivijjhantaṃ tena saha ekakkhaṇe uppajjati. Tattha yasmā santānaggahaṇato ekattavasena āvajjanādīni cittanteva pavattāni, tañca cittameva, yaṃ cetopariyañāṇena vibhāvitaṃ, tasmā samānākārappavattito na aniṭṭhe ṭhāne nānārammaṇatā hotīti khaṇapaccuppannavaseneva imassa paccuppannārammaṇataṃ icchati. Itarānīti āvajjanaparikammacittāni. Cakkhudvāre viññāṇanti cakkhuviññāṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1143-7"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parittādīsu aṭṭhasū"
      },
      "ti cetopariyañāṇassa vuttesu paccuppannārammaṇaṃ hitvā navattabbārammaṇañca pakkhipitvā aṭṭhasu parittādīsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atīte…pe… phalampi vā"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attanā"
      },
      "ti nidassanamattaṃ. Parehipi bhāvitamaggaṃ, sacchikataphalañca pubbenivāsānussatiñāṇena samanussarati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vā"
      },
      "-saddena vā avuttasamuccayatthena attanā bhāvitaṃ maggaṃ, phalampi vā parehi bhāvitaṃ maggaṃ, phalampi vāti evamattho gahetabbo. Tathā ",
      " ca vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathāyaṃ"
      },
      " ‘‘attanā, parehi bhāvitamaggaṃ, sacchikataphalañca anussaraṇakāle’’ti (visuddhi. 2.417). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eva"
      },
      "-kāraṃ pana padapūraṇamattameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phalampi vā"
      },
      "ti ettha ‘‘bhāvita’’nti na sambandhitabbaṃ. Na hi phalaṃ bhāvetabbaṃ hoti, atha kho sacchikātabbamevāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samanussarato magga"
      },
      "nti etthāpi ‘‘attanā, parehi vā bhāvita’’nti sambandhitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekantato"
      },
      "ti niyamato."
    ],
    "innerText": "1143-7.Parittādīsu aṭṭhasūti cetopariyañāṇassa vuttesu paccuppannārammaṇaṃ hitvā navattabbārammaṇañca pakkhipitvā aṭṭhasu parittādīsu. Atīte…pe… phalampi vāti ettha attanāti nidassanamattaṃ. Parehipi bhāvitamaggaṃ, sacchikataphalañca pubbenivāsānussatiñāṇena samanussarati. Vā-saddena vā avuttasamuccayatthena attanā bhāvitaṃ maggaṃ, phalampi vā parehi bhāvitaṃ maggaṃ, phalampi vāti evamattho gahetabbo. Tathā ca vuttaṃ aṭṭhakathāyaṃ ‘‘attanā, parehi bhāvitamaggaṃ, sacchikataphalañca anussaraṇakāle’’ti (visuddhi. 2.417). Eva-kāraṃ pana padapūraṇamattameva. Phalampi vāti ettha ‘‘bhāvita’’nti na sambandhitabbaṃ. Na hi phalaṃ bhāvetabbaṃ hoti, atha kho sacchikātabbamevāti. Samanussarato magganti etthāpi ‘‘attanā, parehi vā bhāvita’’nti sambandhitabbaṃ. Ekantatoti niyamato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1148-50"
      },
      ". Nanu ",
      " ca cetopariyañāṇayathākammūpagañāṇānipi atītārammaṇāneva, kiṃ pana tesaṃ, imassa ca ārammaṇe nānākaraṇanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cetopariyañāṇampī’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiñcāpī"
      },
      "ti ayaṃ nipātasamudāyo, eko vā nipāto visesānabhidhānanimitte upagamane daṭṭhabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha kho"
      },
      "ti visesābhidhānasamārambhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittamevā"
      },
      "ti idaṃ pubbe vicāritameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atīte cetanāmatta"
      },
      "nti idampi pubbe viya mahāaṭṭhakathāvādaṃ sandhāyeva vuttaṃ. Tattha hi yathākammūpagañāṇassa cetanāmattameva ārammaṇaṃ hoti, na cittaṃ, nāpi itare dhammā, yato taṃ yathākammūpaganti vuccatīti iminā adhippāyena yathākammūpagañāṇaṃ atītacetanāmattameva ārammaṇaṃ karotīti vuttaṃ, heṭṭhā dassitapāḷivasena sabbe cattāropi khandhā yathākammūpagañāṇassa ārammaṇanti saṅgahakārānaṃ sanniṭṭhānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Natthi kiñci agocara"
      },
      "nti kiñci khandhaṃ vā khandhapaṭibaddhaṃ nāmagottādiṃ vā agocaraṃ nāma natthi. Tañhi atītakkhandhakhandhapaṭibaddhesu dhammesu sabbaññutaññāṇasamānagatikamevāti adhippāyo."
    ],
    "innerText": "1148-50. Nanu ca cetopariyañāṇayathākammūpagañāṇānipi atītārammaṇāneva, kiṃ pana tesaṃ, imassa ca ārammaṇe nānākaraṇanti āha ‘‘cetopariyañāṇampī’’tiādi. Kiñcāpīti ayaṃ nipātasamudāyo, eko vā nipāto visesānabhidhānanimitte upagamane daṭṭhabbo. Atha khoti visesābhidhānasamārambhe. Cittamevāti idaṃ pubbe vicāritameva. Atīte cetanāmattanti idampi pubbe viya mahāaṭṭhakathāvādaṃ sandhāyeva vuttaṃ. Tattha hi yathākammūpagañāṇassa cetanāmattameva ārammaṇaṃ hoti, na cittaṃ, nāpi itare dhammā, yato taṃ yathākammūpaganti vuccatīti iminā adhippāyena yathākammūpagañāṇaṃ atītacetanāmattameva ārammaṇaṃ karotīti vuttaṃ, heṭṭhā dassitapāḷivasena sabbe cattāropi khandhā yathākammūpagañāṇassa ārammaṇanti saṅgahakārānaṃ sanniṭṭhānaṃ. Natthi kiñci agocaranti kiñci khandhaṃ vā khandhapaṭibaddhaṃ nāmagottādiṃ vā agocaraṃ nāma natthi. Tañhi atītakkhandhakhandhapaṭibaddhesu dhammesu sabbaññutaññāṇasamānagatikamevāti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1151-2"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attakkhandhānussaraṇe"
      },
      "ti attano khandhānussaraṇakāle. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saraṇe…pe… gocara"
      },
      "nti ‘‘atīte vipassī bhagavā ahosi, tassa mātā bandhumatī, pitā bandhumā’’tiādinā nayena nāmagottādiṃ, pathavīnimittādiñca anussaraṇakāle ",
      " navattabbārammaṇaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navattabbagocara"
      },
      "nti hi parittārammaṇaatītārammaṇattikavasena vuttaṃ, ajjhattārammaṇattikavasena pana ākiñcaññāyatanajjhānassa ārammaṇabhūtadhammārammaṇakāle navattabbārammaṇaṃ hoti, avasesapaññattārammaṇakāle bahiddhārammaṇaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāmagotta"
      },
      "nti cettha khandhapaṭibaddho sammutisiddho byañjanattho, na byañjanaṃ. Byañjanañhi saddāyatanasaṅgahitattā parittaṃ hoti. Yathāha ‘‘niruttipaṭisambhidā parittārammaṇā’’ti (vibha. 749)."
    ],
    "innerText": "1151-2.Attakkhandhānussaraṇeti attano khandhānussaraṇakāle. Saraṇe…pe… gocaranti ‘‘atīte vipassī bhagavā ahosi, tassa mātā bandhumatī, pitā bandhumā’’tiādinā nayena nāmagottādiṃ, pathavīnimittādiñca anussaraṇakāle navattabbārammaṇaṃ hoti. Navattabbagocaranti hi parittārammaṇaatītārammaṇattikavasena vuttaṃ, ajjhattārammaṇattikavasena pana ākiñcaññāyatanajjhānassa ārammaṇabhūtadhammārammaṇakāle navattabbārammaṇaṃ hoti, avasesapaññattārammaṇakāle bahiddhārammaṇaṃ hoti. Nāmagottanti cettha khandhapaṭibaddho sammutisiddho byañjanattho, na byañjanaṃ. Byañjanañhi saddāyatanasaṅgahitattā parittaṃ hoti. Yathāha ‘‘niruttipaṭisambhidā parittārammaṇā’’ti (vibha. 749)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1154"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dibbasotasama"
      },
      "nti yasmā paccuppannaṃ, parittañca rūpaṃ ārammaṇaṃ karoti, tasmā paccuppannārammaṇaṃ, parittārammaṇañca hoti, attano kucchigatarūpadassane, parassa hadayanissitalohitadassanādīsu ca ajjhattārammaṇaṃ, bahiddhārammaṇañca hoti."
    ],
    "innerText": "1154.Dibbasotasamanti yasmā paccuppannaṃ, parittañca rūpaṃ ārammaṇaṃ karoti, tasmā paccuppannārammaṇaṃ, parittārammaṇañca hoti, attano kucchigatarūpadassane, parassa hadayanissitalohitadassanādīsu ca ajjhattārammaṇaṃ, bahiddhārammaṇañca hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1155-6"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parittādīsu aṭṭhasū"
      },
      "ti pubbenivāsānussatiñāṇassa vuttesu atītārammaṇaṃ vajjetvā anāgatārammaṇaṃ pakkhipitvā aṭṭhasu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibbattissati…pe… pajānato"
      },
      "ti iminā nibbattakkhandhajānanamāha ",
      ". Anāgataṃsañāṇassa anāgatamagocaraṃ natthi. Tampi hi anāgatakkhandhakhandhapaṭibaddhesu dhammesu sabbaññutaññāṇasamānagatikameva."
    ],
    "innerText": "1155-6.Parittādīsu aṭṭhasūti pubbenivāsānussatiñāṇassa vuttesu atītārammaṇaṃ vajjetvā anāgatārammaṇaṃ pakkhipitvā aṭṭhasu. Nibbattissati…pe… pajānatoti iminā nibbattakkhandhajānanamāha . Anāgataṃsañāṇassa anāgatamagocaraṃ natthi. Tampi hi anāgatakkhandhakhandhapaṭibaddhesu dhammesu sabbaññutaññāṇasamānagatikameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1163"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jānane nāmagottassā"
      },
      "ti ‘‘anāgate metteyyo nāma sammāsambuddho uppajjissati, tassa subrahmā nāma pitā bhavissati, brahmavatī nāma mātā’’tiādinā nayena nāmagottādijānanakāle."
    ],
    "innerText": "1163.Jānane nāmagottassāti ‘‘anāgate metteyyo nāma sammāsambuddho uppajjissati, tassa subrahmā nāma pitā bhavissati, brahmavatī nāma mātā’’tiādinā nayena nāmagottādijānanakāle."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1164-5"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parittādīsu pañcasū"
      },
      "ti parittamahaggataatītaajjhattabahiddhārammaṇavasena pañcasu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmakammassā"
      },
      "ti kāmāvacarakammassa."
    ],
    "innerText": "1164-5.Parittādīsu pañcasūti parittamahaggataatītaajjhattabahiddhārammaṇavasena pañcasu. Kāmakammassāti kāmāvacarakammassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1169"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vividhatthavaṇṇapada"
      },
      "nti ",
      " nānappakāraatthapadehi, byañjanapadehi ca sampannaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Madhuratthamatinīhara"
      },
      "nti madhuratthaṃ atinīharañcāti padacchedo."
    ],
    "innerText": "1169.Vividhatthavaṇṇapadanti nānappakāraatthapadehi, byañjanapadehi ca sampannaṃ. Madhuratthamatinīharanti madhuratthaṃ atinīharañcāti padacchedo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti abhidhammatthavikāsiniyā nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhidhammāvatārasaṃvaṇṇanāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhiññārammaṇaniddesavaṇṇanā niṭṭhitā."
  }
]