[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "4. Tikadukapaṭṭhānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tikadukapaṭṭhāne"
      },
      "pi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kusalaṃ hetuṃ dhammaṃ paṭicca kusalo hetu dhammo uppajjati hetupaccayā"
      },
      "ti pañhāmattuddhāravaseneva desanā katā. Tattha yathā heṭṭhā hetudukena saddhiṃ kusalapadaṃ yojetvā sabbapaccayavasena sabbavāresu saṅkhepato desanā katā, evamidha kusalattikena saddhiṃ hetupadaṃ yojetvā sabbapaccayavasena sabbavāresu saṅkhepato desanā katā. Yathā ca hetupadaṃ, evaṃ nahetupadampi kusalattikena saddhiṃ yojetvā kusalattikahetudukaṃ niṭṭhāpitaṃ. Tato paraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhāya vedanāya sampayuttaṃ hetuṃ dhamma"
      },
      "ntiādinā nayena vedanāttikahetudukādīni ekavīsati tikadukāni dassitāni."
    ],
    "innerText": "Tikadukapaṭṭhānepi kusalaṃ hetuṃ dhammaṃ paṭicca kusalo hetu dhammo uppajjati hetupaccayāti pañhāmattuddhāravaseneva desanā katā. Tattha yathā heṭṭhā hetudukena saddhiṃ kusalapadaṃ yojetvā sabbapaccayavasena sabbavāresu saṅkhepato desanā katā, evamidha kusalattikena saddhiṃ hetupadaṃ yojetvā sabbapaccayavasena sabbavāresu saṅkhepato desanā katā. Yathā ca hetupadaṃ, evaṃ nahetupadampi kusalattikena saddhiṃ yojetvā kusalattikahetudukaṃ niṭṭhāpitaṃ. Tato paraṃ sukhāya vedanāya sampayuttaṃ hetuṃ dhammantiādinā nayena vedanāttikahetudukādīni ekavīsati tikadukāni dassitāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bāvīsatiyā tikehi saddhiṃ hetudukaṃ yojetvā puna tehiyeva saddhiṃ sahetukadukādayo saraṇadukapariyosānā labbhamānavasena sabbadukā yojitā. Idhāpi yaṃ yaṃ padaṃ yojanaṃ na gacchati, taṃ taṃ pāḷiyaṃyeva paṭikkhittaṃ. Evaṃ dukasataṃ gahetvā dvāvīsatiyā tikesu ",
      " pakkhipitvā tikadukapaṭṭhānaṃ nāma desitaṃ. Tatrāpi yena yena nayena pāḷi saṅkhittā, so so nayo vitthārato veditabbo."
    ],
    "innerText": "Evaṃ bāvīsatiyā tikehi saddhiṃ hetudukaṃ yojetvā puna tehiyeva saddhiṃ sahetukadukādayo saraṇadukapariyosānā labbhamānavasena sabbadukā yojitā. Idhāpi yaṃ yaṃ padaṃ yojanaṃ na gacchati, taṃ taṃ pāḷiyaṃyeva paṭikkhittaṃ. Evaṃ dukasataṃ gahetvā dvāvīsatiyā tikesu pakkhipitvā tikadukapaṭṭhānaṃ nāma desitaṃ. Tatrāpi yena yena nayena pāḷi saṅkhittā, so so nayo vitthārato veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tikadukapaṭṭhānavaṇṇanā."
  }
]