[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Dhammapaccanīye tikatikapaṭṭhānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-1. Kusalattika-vedanāttikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-7. Paṭiccavārādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetupaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Nakusalaṃ ",
      " nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naabyākato nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naabyākato nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naakusalo nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. (5)"
    ],
    "innerText": "1. Nakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naabyākato nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naabyākato nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naakusalo nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Naakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naabyākato nasukhāya vedanāya sampayutto ",
      " dhammo uppajjati hetupaccayā. Naakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto ca naabyākato nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. Naakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naakusalo nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. (5)"
    ],
    "innerText": "2. Naakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naabyākato nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto ca naabyākato nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. Naakusalaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naakusalo nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Naabyākataṃ ",
      " nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naabyākato nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naabyākataṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naabyākataṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naabyākataṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naabyākato nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. Naabyākataṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto ca naabyākato nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. Naabyākataṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naakusalo nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. (6)"
    ],
    "innerText": "3. Naabyākataṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naabyākato nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naabyākataṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naabyākataṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naabyākataṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naabyākato nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. Naabyākataṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto ca naabyākato nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. Naabyākataṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naakusalo nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. (6)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Nakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca naabyākato nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naabyākato nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā ",
      ". Nakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya ",
      " vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nasukhāya vedanāya ",
      " sampayutto ca naakusalo nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. (5)"
    ],
    "innerText": "4. Nakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca naabyākato nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naabyākato nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā . Nakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naakusalo nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". Naakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca naabyākato nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto ca naabyākato nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. Naakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naakusalo nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. (5)"
    ],
    "innerText": "5. Naakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca naabyākato nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Naakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto ca naabyākato nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. Naakusalaṃ nasukhāya vedanāya sampayuttañca naabyākataṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naakusalo nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". Nakusalaṃ nasukhāya vedanāya sampayuttañca naakusalaṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttañca naakusalaṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttañca naakusalaṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naakusalo nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. (3) (Saṃkhittaṃ.)"
    ],
    "innerText": "6. Nakusalaṃ nasukhāya vedanāya sampayuttañca naakusalaṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttañca naakusalaṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca naakusalo nasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nasukhāya vedanāya sampayuttañca naakusalaṃ nasukhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nasukhāya vedanāya sampayutto ca naakusalo nasukhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. (3) (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā ekūnatiṃsa, ārammaṇe catuvīsa…pe… avigate ekūnatiṃsa. (Sahajātavārepi…pe… pañhāvārepi vitthāro.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Dukkhāyavedanāyasampayuttapadaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetupaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". Nakusalaṃ ",
      " nadukkhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nadukkhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nadukkhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naakusalo nadukkhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nadukkhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naabyākato nadukkhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nadukkhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nadukkhāya vedanāya sampayutto ca naabyākato nadukkhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. Nakusalaṃ nadukkhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nadukkhāya vedanāya sampayutto ca naakusalo nadukkhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. (5)"
    ],
    "innerText": "7. Nakusalaṃ nadukkhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nadukkhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nadukkhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naakusalo nadukkhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nadukkhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naabyākato nadukkhāya vedanāya sampayutto dhammo uppajjati hetupaccayā. Nakusalaṃ nadukkhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nadukkhāya vedanāya sampayutto ca naabyākato nadukkhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. Nakusalaṃ nadukkhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo nadukkhāya vedanāya sampayutto ca naakusalo nadukkhāya vedanāya sampayutto ca dhammā uppajjanti hetupaccayā. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naakusalaṃ nadukkhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naakusalo nadukkhāya vedanāya sampayutto dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naabyākataṃ nadukkhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naabyākato nadukkhāya vedanāya sampayutto dhammo uppajjati hetupaccayā… cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ nadukkhāya vedanāya sampayuttañca naabyākataṃ nadukkhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nadukkhāya vedanāya sampayutto dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Naakusalaṃ nadukkhāya vedanāya sampayuttañca naabyākataṃ nadukkhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nadukkhāya vedanāya sampayutto ",
      " dhammo uppajjati hetupaccayā… pañca."
    ],
    "innerText": "Naakusalaṃ nadukkhāya vedanāya sampayuttañca naabyākataṃ nadukkhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nadukkhāya vedanāya sampayutto dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ nadukkhāya vedanāya sampayuttañca naakusalaṃ nadukkhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo nadukkhāya vedanāya sampayutto dhammo uppajjati hetupaccayā… tīṇi. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā ekūnatiṃsa…pe… avigate ekūnatiṃsa. (Sabbattha vitthāretabbaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Tatiyapadaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetupaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ". Nakusalaṃ ",
      " naadukkhamasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo naadukkhamasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā… pañca."
    ],
    "innerText": "8. Nakusalaṃ naadukkhamasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca nakusalo naadukkhamasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naakusalaṃ naadukkhamasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naakusalo naadukkhamasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naabyākataṃ naadukkhamasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca naabyākato naadukkhamasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā… cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ naadukkhamasukhāya vedanāya sampayuttañca naabyākataṃ naadukkhamasukhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo naadukkhamasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naakusalaṃ naadukkhamasukhāya vedanāya sampayuttañca naabyākataṃ naadukkhamasukhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo naadukkhamasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nakusalaṃ naadukkhamasukhāya vedanāya sampayuttañca naakusalaṃ naadukkhamasukhāya ",
      " vedanāya sampayuttañca dhammaṃ paṭicca nakusalo naadukkhamasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā… tīṇi. (Saṃkhittaṃ.)"
    ],
    "innerText": "Nakusalaṃ naadukkhamasukhāya vedanāya sampayuttañca naakusalaṃ naadukkhamasukhāya vedanāya sampayuttañca dhammaṃ paṭicca nakusalo naadukkhamasukhāya vedanāya sampayutto dhammo uppajjati hetupaccayā… tīṇi. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā ekūnatiṃsa…pe… avigate ekūnatiṃsa. (Sabbattha vitthāro.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-2. Kusalattika-vipākattikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ". Nakusalaṃ navipākaṃ dhammaṃ paṭicca nakusalo navipāko dhammo uppajjati hetupaccayā ",
      ". Nakusalaṃ navipākaṃ dhammaṃ paṭicca naakusalo navipāko dhammo uppajjati hetupaccayā. Nakusalaṃ navipākaṃ dhammaṃ paṭicca naabyākato navipāko dhammo uppajjati hetupaccayā. Nakusalaṃ navipākaṃ dhammaṃ paṭicca nakusalo navipāko ca naabyākato navipāko ca dhammā uppajjanti hetupaccayā ",
      ". Nakusalaṃ navipākaṃ dhammaṃ paṭicca nakusalo navipāko ca naakusalo navipāko ca dhammā uppajjanti hetupaccayā. (5)"
    ],
    "innerText": "9. Nakusalaṃ navipākaṃ dhammaṃ paṭicca nakusalo navipāko dhammo uppajjati hetupaccayā . Nakusalaṃ navipākaṃ dhammaṃ paṭicca naakusalo navipāko dhammo uppajjati hetupaccayā. Nakusalaṃ navipākaṃ dhammaṃ paṭicca naabyākato navipāko dhammo uppajjati hetupaccayā. Nakusalaṃ navipākaṃ dhammaṃ paṭicca nakusalo navipāko ca naabyākato navipāko ca dhammā uppajjanti hetupaccayā . Nakusalaṃ navipākaṃ dhammaṃ paṭicca nakusalo navipāko ca naakusalo navipāko ca dhammā uppajjanti hetupaccayā. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naakusalaṃ navipākaṃ dhammaṃ paṭicca naakusalo navipāko dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naabyākataṃ navipākaṃ dhammaṃ paṭicca naabyākato navipāko dhammo uppajjati hetupaccayā… cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ navipākañca naabyākataṃ navipākañca dhammaṃ paṭicca nakusalo navipāko dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naakusalaṃ navipākañca naabyākataṃ navipākañca dhammaṃ paṭicca nakusalo navipāko dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nakusalaṃ navipākañca naakusalaṃ navipākañca dhammaṃ paṭicca ",
      " nakusalo navipāko dhammo uppajjati hetupaccayā… tīṇi. (Saṃkhittaṃ.)"
    ],
    "innerText": "Nakusalaṃ navipākañca naakusalaṃ navipākañca dhammaṃ paṭicca nakusalo navipāko dhammo uppajjati hetupaccayā… tīṇi. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā ekūnatiṃsa…pe… avigate ekūnatiṃsa. (Sabbattha vitthāro.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ". Nakusalaṃ navipākadhammadhammaṃ paṭicca nakusalo navipākadhammadhammo uppajjati hetupaccayā. Nakusalaṃ navipākadhammadhammaṃ paṭicca naakusalo navipākadhammadhammo uppajjati hetupaccayā. Nakusalaṃ navipākadhammadhammaṃ paṭicca nakusalo navipākadhammadhammo ca naakusalo navipākadhammadhammo ca dhammā uppajjanti hetupaccayā. (3)"
    ],
    "innerText": "10. Nakusalaṃ navipākadhammadhammaṃ paṭicca nakusalo navipākadhammadhammo uppajjati hetupaccayā. Nakusalaṃ navipākadhammadhammaṃ paṭicca naakusalo navipākadhammadhammo uppajjati hetupaccayā. Nakusalaṃ navipākadhammadhammaṃ paṭicca nakusalo navipākadhammadhammo ca naakusalo navipākadhammadhammo ca dhammā uppajjanti hetupaccayā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Naakusalaṃ ",
      " navipākadhammadhammaṃ paṭicca naakusalo navipākadhammadhammo uppajjati hetupaccayā. Naakusalaṃ navipākadhammadhammaṃ paṭicca nakusalo navipākadhammadhammo uppajjati hetupaccayā. Naakusalaṃ navipākadhammadhammaṃ paṭicca nakusalo navipākadhammadhammo ca naakusalo navipākadhammadhammo ca dhammā uppajjanti hetupaccayā. (3)"
    ],
    "innerText": "Naakusalaṃ navipākadhammadhammaṃ paṭicca naakusalo navipākadhammadhammo uppajjati hetupaccayā. Naakusalaṃ navipākadhammadhammaṃ paṭicca nakusalo navipākadhammadhammo uppajjati hetupaccayā. Naakusalaṃ navipākadhammadhammaṃ paṭicca nakusalo navipākadhammadhammo ca naakusalo navipākadhammadhammo ca dhammā uppajjanti hetupaccayā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nakusalaṃ navipākadhammadhammañca naakusalaṃ navipākadhammadhammañca dhammaṃ paṭicca nakusalo navipākadhammadhammo uppajjati hetupaccayā. Nakusalaṃ navipākadhammadhammañca naakusalaṃ navipākadhammadhammañca dhammaṃ paṭicca naakusalo navipākadhammadhammo uppajjati hetupaccayā. Nakusalaṃ navipākadhammadhammañca naakusalaṃ ",
      " navipākadhammadhammañca dhammaṃ paṭicca nakusalo navipākadhammadhammo ca naakusalo navipākadhammadhammo ca dhammā uppajjanti hetupaccayā. (3) (Saṃkhittaṃ)."
    ],
    "innerText": "Nakusalaṃ navipākadhammadhammañca naakusalaṃ navipākadhammadhammañca dhammaṃ paṭicca nakusalo navipākadhammadhammo uppajjati hetupaccayā. Nakusalaṃ navipākadhammadhammañca naakusalaṃ navipākadhammadhammañca dhammaṃ paṭicca naakusalo navipākadhammadhammo uppajjati hetupaccayā. Nakusalaṃ navipākadhammadhammañca naakusalaṃ navipākadhammadhammañca dhammaṃ paṭicca nakusalo navipākadhammadhammo ca naakusalo navipākadhammadhammo ca dhammā uppajjanti hetupaccayā. (3) (Saṃkhittaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hetuyā ",
      " nava…pe… avigate nava. (Sabbattha nava.)"
    ],
    "innerText": "Hetuyā nava…pe… avigate nava. (Sabbattha nava.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". Nakusalaṃ nanevavipākanavipākadhammadhammaṃ paṭicca nakusalo nanevavipākanavipākadhammadhammo uppajjati hetupaccayā."
    ],
    "innerText": "11. Nakusalaṃ nanevavipākanavipākadhammadhammaṃ paṭicca nakusalo nanevavipākanavipākadhammadhammo uppajjati hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-3. Kusalattika-upādinnattikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ". Nakusalaṃ naupādinnupādāniyaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "12. Nakusalaṃ naupādinnupādāniyaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". Nakusalaṃ naanupādinnupādāniyaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "13. Nakusalaṃ naanupādinnupādāniyaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Nakusalaṃ naanupādinnaanupādāniyaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "14. Nakusalaṃ naanupādinnaanupādāniyaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-4. Kusalattika-saṃkiliṭṭhattikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". Nakusalaṃ nasaṃkiliṭṭhasaṃkilesikaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "15. Nakusalaṃ nasaṃkiliṭṭhasaṃkilesikaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". Nakusalaṃ naasaṃkiliṭṭhasaṃkilesikaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "16. Nakusalaṃ naasaṃkiliṭṭhasaṃkilesikaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ". Nakusalaṃ naasaṃkiliṭṭhaasaṃkilesikaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "17. Nakusalaṃ naasaṃkiliṭṭhaasaṃkilesikaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-5. Kusalattika-vitakkattikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". Nakusalaṃ ",
      " nasavitakkasavicāraṃ dhammaṃ paṭicca…."
    ],
    "innerText": "18. Nakusalaṃ nasavitakkasavicāraṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ". Nakusalaṃ naavitakkavicāramattaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "19. Nakusalaṃ naavitakkavicāramattaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". Nakusalaṃ naavitakkaavicāraṃ dhammaṃ paṭicca…."
    ],
    "innerText": "20. Nakusalaṃ naavitakkaavicāraṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-6. Kusalattika-pītittikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". Nakusalaṃ napītisahagataṃ dhammaṃ paṭicca…pe… nakusalaṃ nasukhasahagataṃ dhammaṃ paṭicca…pe… nakusalaṃ naupekkhāsahagataṃ dhammaṃ paṭicca…."
    ],
    "innerText": "21. Nakusalaṃ napītisahagataṃ dhammaṃ paṭicca…pe… nakusalaṃ nasukhasahagataṃ dhammaṃ paṭicca…pe… nakusalaṃ naupekkhāsahagataṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-7-12. Kusalattika-dassanādittikāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". Nakusalaṃ ",
      " nadassanena pahātabbaṃ dhammaṃ paṭicca…pe… nakusalaṃ nabhāvanāya ",
      " pahātabbaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "22. Nakusalaṃ nadassanena pahātabbaṃ dhammaṃ paṭicca…pe… nakusalaṃ nabhāvanāya pahātabbaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ nanevadassanena nabhāvanāya pahātabbaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". Nakusalaṃ nadassanena pahātabbahetukaṃ dhammaṃ paṭicca…pe… nakusalaṃ nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "23. Nakusalaṃ nadassanena pahātabbahetukaṃ dhammaṃ paṭicca…pe… nakusalaṃ nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ nanevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ". Nakusalaṃ naācayagāmiṃ dhammaṃ paṭicca…."
    ],
    "innerText": "24. Nakusalaṃ naācayagāmiṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ naapacayagāmiṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ nanevācayagāmināpacayagāmiṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". Nakusalaṃ nasekkhaṃ dhammaṃ paṭicca…pe… nakusalaṃ naasekkhaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "25. Nakusalaṃ nasekkhaṃ dhammaṃ paṭicca…pe… nakusalaṃ naasekkhaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ nanevasekkhanāsekkhaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". Nakusalaṃ ",
      " naparittaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "26. Nakusalaṃ naparittaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ namahaggataṃ dhammaṃ paṭicca…pe… nakusalaṃ naappamāṇaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      ". Nakusalaṃ naparittārammaṇaṃ dhammaṃ paṭicca…pe… nakusalaṃ namahaggatārammaṇaṃ dhammaṃ paṭicca…pe… nakusalaṃ naappamāṇārammaṇaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "27. Nakusalaṃ naparittārammaṇaṃ dhammaṃ paṭicca…pe… nakusalaṃ namahaggatārammaṇaṃ dhammaṃ paṭicca…pe… nakusalaṃ naappamāṇārammaṇaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-13-20. Kusalattika-hīnādittikāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      ". Nakusalaṃ ",
      " nahīnaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "28. Nakusalaṃ nahīnaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nakusalaṃ namajjhimaṃ dhammaṃ paṭicca…;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nakusalaṃ napaṇītaṃ dhammaṃ paṭicca…;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "29"
      },
      ". Nakusalaṃ namicchattaniyataṃ dhammaṃ paṭicca…pe… nakusalaṃ nasammattaniyataṃ dhammaṃ paṭicca…."
    ],
    "innerText": "29. Nakusalaṃ namicchattaniyataṃ dhammaṃ paṭicca…pe… nakusalaṃ nasammattaniyataṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nakusalaṃ naaniyataṃ dhammaṃ paṭicca…;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ". Nakusalaṃ ",
      " namaggārammaṇaṃ dhammaṃ paṭicca…pe… nakusalaṃ namaggahetukaṃ dhammaṃ paṭicca…pe… nakusalaṃ namaggādhipatiṃ dhammaṃ paṭicca…."
    ],
    "innerText": "30. Nakusalaṃ namaggārammaṇaṃ dhammaṃ paṭicca…pe… nakusalaṃ namaggahetukaṃ dhammaṃ paṭicca…pe… nakusalaṃ namaggādhipatiṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ". Nakusalaṃ naanuppannaṃ dhammaṃ paṭicca…pe… nakusalaṃ nauppādiṃ dhammaṃ paṭicca…."
    ],
    "innerText": "31. Nakusalaṃ naanuppannaṃ dhammaṃ paṭicca…pe… nakusalaṃ nauppādiṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "32"
      },
      ". Nakusalaṃ naatītaṃ dhammaṃ paṭicca…pe… nakusalaṃ naanāgataṃ dhammaṃ paṭicca…."
    ],
    "innerText": "32. Nakusalaṃ naatītaṃ dhammaṃ paṭicca…pe… nakusalaṃ naanāgataṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "33"
      },
      ". Nakusalaṃ naatītārammaṇaṃ dhammaṃ paṭicca…pe… nakusalaṃ naanāgatārammaṇaṃ dhammaṃ paṭicca…pe… nakusalaṃ napaccuppannārammaṇaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "33. Nakusalaṃ naatītārammaṇaṃ dhammaṃ paṭicca…pe… nakusalaṃ naanāgatārammaṇaṃ dhammaṃ paṭicca…pe… nakusalaṃ napaccuppannārammaṇaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "34"
      },
      ". Nakusalaṃ ",
      " naajjhattaṃ dhammaṃ paṭicca…pe… nakusalaṃ nabahiddhā dhammaṃ paṭicca…."
    ],
    "innerText": "34. Nakusalaṃ naajjhattaṃ dhammaṃ paṭicca…pe… nakusalaṃ nabahiddhā dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ". Nakusalaṃ naajjhattārammaṇaṃ dhammaṃ paṭicca…pe… nakusalaṃ nabahiddhārammaṇaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "35. Nakusalaṃ naajjhattārammaṇaṃ dhammaṃ paṭicca…pe… nakusalaṃ nabahiddhārammaṇaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1-21. Kusalattika-sanidassanattikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ". Nakusalaṃ ",
      " nasanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Nakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca naakusalo nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Nakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca naabyākato nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Nakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho ca naabyākato nasanidassanasappaṭigho ca dhammā uppajjanti hetupaccayā. Nakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho ca naakusalo nasanidassanasappaṭigho ca dhammā uppajjanti hetupaccayā. (5)"
    ],
    "innerText": "36. Nakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Nakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca naakusalo nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Nakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca naabyākato nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Nakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho ca naabyākato nasanidassanasappaṭigho ca dhammā uppajjanti hetupaccayā. Nakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho ca naakusalo nasanidassanasappaṭigho ca dhammā uppajjanti hetupaccayā. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Naakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca naakusalo nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Naakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho dhammo ",
      " uppajjati hetupaccayā. Naakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca naabyākato nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Naakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca naakusalo nasanidassanasappaṭigho ca naabyākato nasanidassanasappaṭigho ca dhammā uppajjanti hetupaccayā. Naakusalaṃ ",
      " nasanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho ca naakusalo nasanidassanasappaṭigho ca dhammā uppajjanti hetupaccayā. (5)"
    ],
    "innerText": "Naakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca naakusalo nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Naakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Naakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca naabyākato nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Naakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca naakusalo nasanidassanasappaṭigho ca naabyākato nasanidassanasappaṭigho ca dhammā uppajjanti hetupaccayā. Naakusalaṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho ca naakusalo nasanidassanasappaṭigho ca dhammā uppajjanti hetupaccayā. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Naabyākataṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca naabyākato nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Naabyākataṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Naabyākataṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca naakusalo nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Naabyākataṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho ca naabyākato nasanidassanasappaṭigho ca dhammā uppajjanti hetupaccayā. Naabyākataṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca naakusalo nasanidassanasappaṭigho ca naabyākato nasanidassanasappaṭigho ca dhammā uppajjanti hetupaccayā. Naabyākataṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho ",
      " ca naakusalo nasanidassanasappaṭigho ca dhammā uppajjanti hetupaccayā. (6)"
    ],
    "innerText": "Naabyākataṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca naabyākato nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Naabyākataṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Naabyākataṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca naakusalo nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Naabyākataṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho ca naabyākato nasanidassanasappaṭigho ca dhammā uppajjanti hetupaccayā. Naabyākataṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca naakusalo nasanidassanasappaṭigho ca naabyākato nasanidassanasappaṭigho ca dhammā uppajjanti hetupaccayā. Naabyākataṃ nasanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho ca naakusalo nasanidassanasappaṭigho ca dhammā uppajjanti hetupaccayā. (6)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nakusalaṃ ",
      " nasanidassanasappaṭighañca naabyākataṃ nasanidassanasappaṭighañca dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho dhammo uppajjati hetupaccayā… pañca."
    ],
    "innerText": "Nakusalaṃ nasanidassanasappaṭighañca naabyākataṃ nasanidassanasappaṭighañca dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naakusalaṃ nasanidassanasappaṭighañca naabyākataṃ nasanidassanasappaṭighañca dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho dhammo uppajjati hetupaccayā… pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nakusalaṃ nasanidassanasappaṭighañca naakusalaṃ nasanidassanasappaṭighañca dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Nakusalaṃ nasanidassanasappaṭighañca naakusalaṃ nasanidassanasappaṭighañca dhammaṃ paṭicca naakusalo nasanidassanasappaṭigho dhammo uppajjati hetupaccayā. Nakusalaṃ nasanidassanasappaṭighañca naakusalaṃ nasanidassanasappaṭighañca dhammaṃ paṭicca nakusalo nasanidassanasappaṭigho ca naakusalo nasanidassanasappaṭigho ca dhammā uppajjanti hetupaccayā. (3) (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā ekūnatiṃsa…pe… avigate ekūnatiṃsa. (Sabbattha vitthāro.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ". Nakusalaṃ ",
      " naanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo naanidassanasappaṭigho dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.)"
    ],
    "innerText": "37. Nakusalaṃ naanidassanasappaṭighaṃ dhammaṃ paṭicca nakusalo naanidassanasappaṭigho dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā ekūnatiṃsa…pe… avigate ekūnatiṃsa. (Sabbattha vitthāro.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "38"
      },
      ". Nakusalaṃ ",
      " naanidassanaappaṭighaṃ dhammaṃ paṭicca nakusalo naanidassanaappaṭigho dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.)"
    ],
    "innerText": "38. Nakusalaṃ naanidassanaappaṭighaṃ dhammaṃ paṭicca nakusalo naanidassanaappaṭigho dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā nava…pe… (sabbattha vitthāro)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2-1. Vedanāttika-kusalattikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "39"
      },
      ". Nasukhāya ",
      " vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nasukhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nadukkhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nasukhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca naadukkhamasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nasukhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto nakusalo ca naadukkhamasukhāya vedanāya sampayutto nakusalo ca dhammā uppajjanti hetupaccayā…pe… satta."
    ],
    "innerText": "39. Nasukhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nasukhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nadukkhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nasukhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca naadukkhamasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nasukhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto nakusalo ca naadukkhamasukhāya vedanāya sampayutto nakusalo ca dhammā uppajjanti hetupaccayā…pe… satta."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nadukkhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nadukkhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nadukkhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nadukkhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca naadukkhamasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nadukkhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto nakusalo ",
      " ca naadukkhamasukhāya vedanāya sampayutto nakusalo ca dhammā uppajjanti hetupaccayā…pe… satta."
    ],
    "innerText": "Nadukkhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nadukkhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nadukkhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nadukkhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca naadukkhamasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nadukkhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto nakusalo ca naadukkhamasukhāya vedanāya sampayutto nakusalo ca dhammā uppajjanti hetupaccayā…pe… satta."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Naadukkhamasukhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca naadukkhamasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Naadukkhamasukhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nasukhāya ",
      " vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Naadukkhamasukhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nadukkhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Naadukkhamasukhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto nakusalo ca naadukkhamasukhāya vedanāya sampayutto nakusalo ca dhammā uppajjanti hetupaccayā…pe… satta."
    ],
    "innerText": "Naadukkhamasukhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca naadukkhamasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Naadukkhamasukhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Naadukkhamasukhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nadukkhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Naadukkhamasukhāya vedanāya sampayuttaṃ nakusalaṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto nakusalo ca naadukkhamasukhāya vedanāya sampayutto nakusalo ca dhammā uppajjanti hetupaccayā…pe… satta."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ". Nasukhāya vedanāya sampayuttaṃ nakusalañca naadukkhamasukhāya vedanāya sampayuttaṃ nakusalañca dhammaṃ paṭicca nasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nasukhāya vedanāya sampayuttaṃ nakusalañca naadukkhamasukhāya vedanāya sampayuttaṃ nakusalañca ",
      " dhammaṃ paṭicca nadukkhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nasukhāya vedanāya sampayuttaṃ nakusalañca naadukkhamasukhāya vedanāya sampayuttaṃ nakusalañca dhammaṃ paṭicca naadukkhamasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nasukhāya vedanāya sampayuttaṃ nakusalañca naadukkhamasukhāya vedanāya sampayuttaṃ ",
      " nakusalañca dhammaṃ paṭicca nasukhāya vedanāya sampayutto nakusalo ca naadukkhamasukhāya vedanāya sampayutto nakusalo ca dhammā uppajjanti hetupaccayā…pe… satta."
    ],
    "innerText": "40. Nasukhāya vedanāya sampayuttaṃ nakusalañca naadukkhamasukhāya vedanāya sampayuttaṃ nakusalañca dhammaṃ paṭicca nasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nasukhāya vedanāya sampayuttaṃ nakusalañca naadukkhamasukhāya vedanāya sampayuttaṃ nakusalañca dhammaṃ paṭicca nadukkhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nasukhāya vedanāya sampayuttaṃ nakusalañca naadukkhamasukhāya vedanāya sampayuttaṃ nakusalañca dhammaṃ paṭicca naadukkhamasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nasukhāya vedanāya sampayuttaṃ nakusalañca naadukkhamasukhāya vedanāya sampayuttaṃ nakusalañca dhammaṃ paṭicca nasukhāya vedanāya sampayutto nakusalo ca naadukkhamasukhāya vedanāya sampayutto nakusalo ca dhammā uppajjanti hetupaccayā…pe… satta."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nadukkhāya vedanāya sampayuttaṃ nakusalañca naadukkhamasukhāya vedanāya sampayuttaṃ nakusalañca dhammaṃ paṭicca nasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nadukkhāya vedanāya sampayuttaṃ nakusalañca naadukkhamasukhāya vedanāya sampayuttaṃ nakusalañca dhammaṃ paṭicca nadukkhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā. Nadukkhāya vedanāya sampayuttaṃ nakusalañca naadukkhamasukhāya vedanāya sampayuttaṃ nakusalañca dhammaṃ paṭicca naadukkhamasukhāya vedanāya sampayutto nakusalo dhammo uppajjati hetupaccayā…pe… satta. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā ekūnapaññāsa, ārammaṇe ekūnapaññāsa…pe… avigate ekūnapaññāsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ". Nasukhāya ",
      " vedanāya sampayuttaṃ naakusalaṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto naakusalo dhammo uppajjati hetupaccayā…. (Saṃkhittaṃ.) Hetuyā ekūnapaññāsa."
    ],
    "innerText": "41. Nasukhāya vedanāya sampayuttaṃ naakusalaṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto naakusalo dhammo uppajjati hetupaccayā…. (Saṃkhittaṃ.) Hetuyā ekūnapaññāsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42"
      },
      ". Nasukhāya vedanāya sampayuttaṃ naabyākataṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto naabyākato dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.) Hetuyā ",
      " aṭṭhacattālīsa. (Sabbattha vitthāro.)"
    ],
    "innerText": "42. Nasukhāya vedanāya sampayuttaṃ naabyākataṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto naabyākato dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.) Hetuyā aṭṭhacattālīsa. (Sabbattha vitthāro.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2-2. Vedanāttika-vipākattikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "43"
      },
      ". Nasukhāya vedanāya sampayuttaṃ navipākaṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto navipāko dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.)"
    ],
    "innerText": "43. Nasukhāya vedanāya sampayuttaṃ navipākaṃ dhammaṃ paṭicca nasukhāya vedanāya sampayutto navipāko dhammo uppajjati hetupaccayā. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā ekūnapaññāsa…pe… avigate ekūnapaññāsa. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3-1. Vipākattika-kusalattikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44"
      },
      ". Navipākaṃ ",
      " nakusalaṃ dhammaṃ paṭicca…pe… navipākadhammadhammaṃ naakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "44. Navipākaṃ nakusalaṃ dhammaṃ paṭicca…pe… navipākadhammadhammaṃ naakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nanevavipākanavipākadhammadhammaṃ naabyākataṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4-1. Upādinnattika-kusalattikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "45"
      },
      ". Naupādinnupādāniyaṃ nakusalaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ito paṭṭhāya yāva ajjhattārammaṇattikā sabbapotthakesu akusalābyākatapadāni na dissanti, vedanāttika sanidassanattikesu viya nanu tehipi bhavitabbaṃ]"
      },
      " dhammaṃ paṭicca…pe… naanupādinnupādāniyaṃ nakusalaṃ dhammaṃ paṭicca…pe… naanupādinnaanupādāniyaṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "45. Naupādinnupādāniyaṃ nakusalaṃ [ito paṭṭhāya yāva ajjhattārammaṇattikā sabbapotthakesu akusalābyākatapadāni na dissanti, vedanāttika sanidassanattikesu viya nanu tehipi bhavitabbaṃ] dhammaṃ paṭicca…pe… naanupādinnupādāniyaṃ nakusalaṃ dhammaṃ paṭicca…pe… naanupādinnaanupādāniyaṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "5-1. Saṃkiliṭṭhattika-kusalattikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "46"
      },
      ". Nasaṃkiliṭṭhasaṃkilesikaṃ nakusalaṃ dhammaṃ paṭicca…pe… naasaṃkiliṭṭhasaṃkilesikaṃ nakusalaṃ dhammaṃ paṭicca…pe… naasaṃkiliṭṭhaasaṃkilesikaṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "46. Nasaṃkiliṭṭhasaṃkilesikaṃ nakusalaṃ dhammaṃ paṭicca…pe… naasaṃkiliṭṭhasaṃkilesikaṃ nakusalaṃ dhammaṃ paṭicca…pe… naasaṃkiliṭṭhaasaṃkilesikaṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "6-21-1. Vitakkādittikāni-kusalattikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "47"
      },
      ". Nasavitakkasavicāraṃ ",
      " nakusalaṃ dhammaṃ paṭicca…pe… naavitakkavicāramattaṃ nakusalaṃ dhammaṃ paṭicca…pe… naavitakkaavicāraṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "47. Nasavitakkasavicāraṃ nakusalaṃ dhammaṃ paṭicca…pe… naavitakkavicāramattaṃ nakusalaṃ dhammaṃ paṭicca…pe… naavitakkaavicāraṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "48"
      },
      ". Napītisahagataṃ ",
      " nakusalaṃ dhammaṃ paṭicca…pe… nasukhasahagataṃ nakusalaṃ dhammaṃ paṭicca…pe… naupekkhāsahagataṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "48. Napītisahagataṃ nakusalaṃ dhammaṃ paṭicca…pe… nasukhasahagataṃ nakusalaṃ dhammaṃ paṭicca…pe… naupekkhāsahagataṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "49"
      },
      ". Nadassanena pahātabbaṃ nakusalaṃ dhammaṃ paṭicca…pe… nabhāvanāya pahātabbaṃ nakusalaṃ dhammaṃ paṭicca…pe… nanevadassanena nabhāvanāya pahātabbaṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "49. Nadassanena pahātabbaṃ nakusalaṃ dhammaṃ paṭicca…pe… nabhāvanāya pahātabbaṃ nakusalaṃ dhammaṃ paṭicca…pe… nanevadassanena nabhāvanāya pahātabbaṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50"
      },
      ". Nadassanena pahātabbahetukaṃ nakusalaṃ dhammaṃ paṭicca…pe… nabhāvanāya pahātabbahetukaṃ nakusalaṃ dhammaṃ paṭicca…pe… nanevadassanena nabhāvanāya pahātabbahetukaṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "50. Nadassanena pahātabbahetukaṃ nakusalaṃ dhammaṃ paṭicca…pe… nabhāvanāya pahātabbahetukaṃ nakusalaṃ dhammaṃ paṭicca…pe… nanevadassanena nabhāvanāya pahātabbahetukaṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "51"
      },
      ". Naācayagāmiṃ ",
      " nakusalaṃ dhammaṃ paṭicca…pe… naapacayagāmiṃ nakusalaṃ dhammaṃ paṭicca…pe… nanevācayagāmināpacayagāmiṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "51. Naācayagāmiṃ nakusalaṃ dhammaṃ paṭicca…pe… naapacayagāmiṃ nakusalaṃ dhammaṃ paṭicca…pe… nanevācayagāmināpacayagāmiṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "52"
      },
      ". Nasekkhaṃ ",
      " nakusalaṃ dhammaṃ paṭicca…pe… naasekkhaṃ nakusalaṃ dhammaṃ paṭicca…pe… nanevāsekkhanāsekkhaṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "52. Nasekkhaṃ nakusalaṃ dhammaṃ paṭicca…pe… naasekkhaṃ nakusalaṃ dhammaṃ paṭicca…pe… nanevāsekkhanāsekkhaṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "53"
      },
      ". Naparittaṃ nakusalaṃ dhammaṃ paṭicca…pe… namahaggataṃ nakusalaṃ dhammaṃ paṭicca…pe… naappamāṇaṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "53. Naparittaṃ nakusalaṃ dhammaṃ paṭicca…pe… namahaggataṃ nakusalaṃ dhammaṃ paṭicca…pe… naappamāṇaṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "54"
      },
      ". Naparittārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…pe… namahaggatārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…pe… naappamāṇārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "54. Naparittārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…pe… namahaggatārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…pe… naappamāṇārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "55"
      },
      ". Nahīnaṃ nakusalaṃ dhammaṃ paṭicca…pe… namajjhimaṃ nakusalaṃ dhammaṃ paṭicca…pe… napaṇītaṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "55. Nahīnaṃ nakusalaṃ dhammaṃ paṭicca…pe… namajjhimaṃ nakusalaṃ dhammaṃ paṭicca…pe… napaṇītaṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "56"
      },
      ". Namicchattaniyataṃ nakusalaṃ dhammaṃ paṭicca…pe… nasammattaniyataṃ nakusalaṃ dhammaṃ paṭicca…pe… naaniyataṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "56. Namicchattaniyataṃ nakusalaṃ dhammaṃ paṭicca…pe… nasammattaniyataṃ nakusalaṃ dhammaṃ paṭicca…pe… naaniyataṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "57"
      },
      ". Namaggārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…pe… namaggahetukaṃ nakusalaṃ dhammaṃ paṭicca…pe… namaggādhipatiṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "57. Namaggārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…pe… namaggahetukaṃ nakusalaṃ dhammaṃ paṭicca…pe… namaggādhipatiṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "58"
      },
      ". Naanuppannaṃ ",
      " nakusalaṃ dhammaṃ paṭicca…pe… nauppādiṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "58. Naanuppannaṃ nakusalaṃ dhammaṃ paṭicca…pe… nauppādiṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "59"
      },
      ". Naatītaṃ nakusalaṃ dhammaṃ paṭicca…pe… naanāgataṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "59. Naatītaṃ nakusalaṃ dhammaṃ paṭicca…pe… naanāgataṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "60"
      },
      ". Naatītārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…pe… naanāgatārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…pe… napaccuppannārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "60. Naatītārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…pe… naanāgatārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…pe… napaccuppannārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "61"
      },
      ". Naajjhattaṃ ",
      " nakusalaṃ dhammaṃ paṭicca…pe… nabahiddhā nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "61. Naajjhattaṃ nakusalaṃ dhammaṃ paṭicca…pe… nabahiddhā nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "62"
      },
      ". Naajjhattārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…pe… nabahiddhārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "62. Naajjhattārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…pe… nabahiddhārammaṇaṃ nakusalaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-1. Sanidassanattika-kusalattikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "63"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " nakusalaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nakusalo dhammo uppajjati hetupaccayā. Nasanidassanasappaṭighaṃ nakusalaṃ dhammaṃ paṭicca naanidassanasappaṭigho nakusalo dhammo ",
      " uppajjati hetupaccayā. Nasanidassanasappaṭighaṃ nakusalaṃ dhammaṃ paṭicca naanidassanaappaṭigho nakusalo dhammo uppajjati hetupaccayā…pe… cha."
    ],
    "innerText": "63. Nasanidassanasappaṭighaṃ nakusalaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nakusalo dhammo uppajjati hetupaccayā. Nasanidassanasappaṭighaṃ nakusalaṃ dhammaṃ paṭicca naanidassanasappaṭigho nakusalo dhammo uppajjati hetupaccayā. Nasanidassanasappaṭighaṃ nakusalaṃ dhammaṃ paṭicca naanidassanaappaṭigho nakusalo dhammo uppajjati hetupaccayā…pe… cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naanidassanasappaṭighaṃ nakusalaṃ dhammaṃ paṭicca naanidassanasappaṭigho nakusalo dhammo uppajjati hetupaccayā. Naanidassanasappaṭighaṃ nakusalaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nakusalo dhammo uppajjati hetupaccayā. Naanidassanasappaṭighaṃ nakusalaṃ dhammaṃ paṭicca naanidassanaappaṭigho nakusalo dhammo uppajjati hetupaccayā…pe… cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naanidassanaappaṭighaṃ nakusalaṃ dhammaṃ paṭicca naanidassanaappaṭigho nakusalo dhammo uppajjati hetupaccayā… cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nakusalañca naanidassanaappaṭighaṃ nakusalañca dhammaṃ paṭicca nasanidassanasappaṭigho nakusalo dhammo uppajjati hetupaccayā… cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naanidassanasappaṭighaṃ nakusalañca naanidassanaappaṭighaṃ nakusalañca dhammaṃ paṭicca nasanidassanasappaṭigho nakusalo dhammo uppajjati hetupaccayā… cha (saṃkhittaṃ). Hetuyā tiṃsa, ārammaṇe nava…pe… avigate tiṃsa. (Sabbattha vitthāro.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "64"
      },
      ". Nasanidassanasappaṭighaṃ naakusalaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naakusalo dhammo uppajjati hetupaccayā. Hetuyā tiṃsa, ārammaṇe nava…pe… avigate tiṃsa. (Sabbattha vitthāro.)"
    ],
    "innerText": "64. Nasanidassanasappaṭighaṃ naakusalaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naakusalo dhammo uppajjati hetupaccayā. Hetuyā tiṃsa, ārammaṇe nava…pe… avigate tiṃsa. (Sabbattha vitthāro.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "65"
      },
      ". Nasanidassanasappaṭighaṃ naabyākataṃ dhammaṃ paṭicca nasanidassanasappaṭigho naabyākato dhammo uppajjati hetupaccayā."
    ],
    "innerText": "65. Nasanidassanasappaṭighaṃ naabyākataṃ dhammaṃ paṭicca nasanidassanasappaṭigho naabyākato dhammo uppajjati hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hetuyā ",
      ". Nava (sabbattha nava.)"
    ],
    "innerText": "Hetuyā . Nava (sabbattha nava.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "22-2-21. Sanidassanattika-vedanādittikāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "66"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca… hetuyā tiṃsa."
    ],
    "innerText": "66. Nasanidassanasappaṭighaṃ nasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca… hetuyā tiṃsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nadukkhāya vedanāya sampayuttaṃ dhammaṃ paṭicca… hetuyā tiṃsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naadukkhamasukhāya vedanāya sampayuttaṃ dhammaṃ paṭicca… hetuyā tiṃsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "67"
      },
      ". Nasanidassanasappaṭighaṃ navipākaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ navipākadhammadhammaṃ paṭicca… hetuyā tiṃsa."
    ],
    "innerText": "67. Nasanidassanasappaṭighaṃ navipākaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ navipākadhammadhammaṃ paṭicca… hetuyā tiṃsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanevavipākanavipākadhammadhammaṃ paṭicca… hetuyā nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "68"
      },
      ". Nasanidassanasappaṭighaṃ naupādinnupādāniyaṃ dhammaṃ paṭicca…pe…."
    ],
    "innerText": "68. Nasanidassanasappaṭighaṃ naupādinnupādāniyaṃ dhammaṃ paṭicca…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naanupādinnupādāniyaṃ dhammaṃ paṭicca…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ anupādinnaanupādāniyaṃ dhammaṃ paṭicca… hetuyā tiṃsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "69"
      },
      ". Nasanidassanasappaṭighaṃ nasaṃkiliṭṭhasaṃkilesikaṃ dhammaṃ paṭicca… hetuyā tiṃsa."
    ],
    "innerText": "69. Nasanidassanasappaṭighaṃ nasaṃkiliṭṭhasaṃkilesikaṃ dhammaṃ paṭicca… hetuyā tiṃsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naasaṃkiliṭṭhasaṃkilesikaṃ dhammaṃ paṭicca…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naasaṃkiliṭṭhaasaṃkilesikaṃ dhammaṃ paṭicca… hetuyā tiṃsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "70"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " nasavitakkasavicāraṃ dhammaṃ paṭicca…pe…."
    ],
    "innerText": "70. Nasanidassanasappaṭighaṃ nasavitakkasavicāraṃ dhammaṃ paṭicca…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naavitakkavicāramattaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naavitakkaavicāraṃ dhammaṃ paṭicca…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "71"
      },
      ". Nasanidassanasappaṭighaṃ napītisahagataṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ nasukhasahagataṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ naupekkhāsahagataṃ dhammaṃ paṭicca…."
    ],
    "innerText": "71. Nasanidassanasappaṭighaṃ napītisahagataṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ nasukhasahagataṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ naupekkhāsahagataṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "72"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " nadassanena pahātabbaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ nabhāvanāya pahātabbaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "72. Nasanidassanasappaṭighaṃ nadassanena pahātabbaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ nabhāvanāya pahātabbaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanevadassanena nabhāvanāya pahātabbaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "73"
      },
      ". Nasanidassanasappaṭighaṃ nadassanena pahātabbahetukaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "73. Nasanidassanasappaṭighaṃ nadassanena pahātabbahetukaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "74"
      },
      ". Nasanidassanasappaṭighaṃ naācayagāmiṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ ",
      " naapacayagāmiṃ dhammaṃ paṭicca…."
    ],
    "innerText": "74. Nasanidassanasappaṭighaṃ naācayagāmiṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ naapacayagāmiṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanevācayagāmināpacayagāmiṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "75"
      },
      ". Nasanidassanasappaṭighaṃ nasekkhaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ naasekkhaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "75. Nasanidassanasappaṭighaṃ nasekkhaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ naasekkhaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ nanevasekkhanāsekkhaṃ dhammaṃ paṭicca…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "76"
      },
      ". Nasanidassanasappaṭighaṃ naparittaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "76. Nasanidassanasappaṭighaṃ naparittaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ namahaggataṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ naappamāṇaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "77"
      },
      ". Nasanidassanasappaṭighaṃ naparittārammaṇaṃ dhammaṃ paṭicca…pe… sanidassanasappaṭighaṃ namahaggatārammaṇaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ naappamāṇārammaṇaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "77. Nasanidassanasappaṭighaṃ naparittārammaṇaṃ dhammaṃ paṭicca…pe… sanidassanasappaṭighaṃ namahaggatārammaṇaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ naappamāṇārammaṇaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "78"
      },
      ". Nasanidassanasappaṭighaṃ nahīnaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "78. Nasanidassanasappaṭighaṃ nahīnaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ namajjhimaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ napaṇītaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "79"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " namicchattaniyataṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ ",
      " nasammattaniyataṃ dhammaṃ paṭicca…."
    ],
    "innerText": "79. Nasanidassanasappaṭighaṃ namicchattaniyataṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ nasammattaniyataṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nasanidassanasappaṭighaṃ naaniyataṃ dhammaṃ paṭicca…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "80"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " namaggārammaṇaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ namaggahetukaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ namaggādhipatiṃ dhammaṃ paṭicca…."
    ],
    "innerText": "80. Nasanidassanasappaṭighaṃ namaggārammaṇaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ namaggahetukaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ namaggādhipatiṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "81"
      },
      ". Nasanidassanasappaṭighaṃ naanuppannaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ nauppādiṃ dhammaṃ paṭicca…."
    ],
    "innerText": "81. Nasanidassanasappaṭighaṃ naanuppannaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ nauppādiṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "82"
      },
      ". Nasanidassanasappaṭighaṃ naatītaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ naanāgataṃ dhammaṃ paṭicca…."
    ],
    "innerText": "82. Nasanidassanasappaṭighaṃ naatītaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ naanāgataṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "83"
      },
      ". Nasanidassanasappaṭighaṃ naatītārammaṇaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ naanāgatārammaṇaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ napaccuppannārammaṇaṃ dhammaṃ paṭicca…."
    ],
    "innerText": "83. Nasanidassanasappaṭighaṃ naatītārammaṇaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ naanāgatārammaṇaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ napaccuppannārammaṇaṃ dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "84"
      },
      ". Nasanidassanasappaṭighaṃ naajjhattaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ nabahiddhā dhammaṃ paṭicca…."
    ],
    "innerText": "84. Nasanidassanasappaṭighaṃ naajjhattaṃ dhammaṃ paṭicca…pe… nasanidassanasappaṭighaṃ nabahiddhā dhammaṃ paṭicca…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "85"
      },
      ". Nasanidassanasappaṭighaṃ ",
      " naajjhattārammaṇaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naajjhattārammaṇo dhammo uppajjati hetupaccayā. Nasanidassanasappaṭighaṃ naajjhattārammaṇaṃ dhammaṃ paṭicca naanidassanasappaṭigho naajjhattārammaṇo dhammo uppajjati hetupaccayā."
    ],
    "innerText": "85. Nasanidassanasappaṭighaṃ naajjhattārammaṇaṃ dhammaṃ paṭicca nasanidassanasappaṭigho naajjhattārammaṇo dhammo uppajjati hetupaccayā. Nasanidassanasappaṭighaṃ naajjhattārammaṇaṃ dhammaṃ paṭicca naanidassanasappaṭigho naajjhattārammaṇo dhammo uppajjati hetupaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā tiṃsa…pe… avigate tiṃsa. (Sabbattha vitthāro.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "86"
      },
      ". Nasanidassanasappaṭighaṃ nabahiddhārammaṇaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nabahiddhārammaṇo dhammo uppajjati hetupaccayā. Nasanidassanasappaṭighaṃ nabahiddhārammaṇaṃ dhammaṃ paṭicca naanidassanasappaṭigho nabahiddhārammaṇo dhammo uppajjati hetupaccayā. Nasanidassanasappaṭighaṃ ",
      " nabahiddhārammaṇaṃ dhammaṃ paṭicca naanidassanaappaṭigho nabahiddhārammaṇo dhammo uppajjati hetupaccayā…pe… cha."
    ],
    "innerText": "86. Nasanidassanasappaṭighaṃ nabahiddhārammaṇaṃ dhammaṃ paṭicca nasanidassanasappaṭigho nabahiddhārammaṇo dhammo uppajjati hetupaccayā. Nasanidassanasappaṭighaṃ nabahiddhārammaṇaṃ dhammaṃ paṭicca naanidassanasappaṭigho nabahiddhārammaṇo dhammo uppajjati hetupaccayā. Nasanidassanasappaṭighaṃ nabahiddhārammaṇaṃ dhammaṃ paṭicca naanidassanaappaṭigho nabahiddhārammaṇo dhammo uppajjati hetupaccayā…pe… cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naanidassanasappaṭighaṃ nabahiddhārammaṇaṃ dhammaṃ paṭicca naanidassanasappaṭigho nabahiddhārammaṇo dhammo uppajjati hetupaccayā… cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naanidassanaappaṭighaṃ nabahiddhārammaṇaṃ dhammaṃ paṭicca naanidassanaappaṭigho nabahiddhārammaṇo dhammo uppajjati hetupaccayā… cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nasanidassanasappaṭighaṃ ",
      " nabahiddhārammaṇañca naanidassanaappaṭighaṃ nabahiddhārammaṇañca dhammaṃ paṭicca nasanidassanasappaṭigho nabahiddhārammaṇo dhammo uppajjati hetupaccayā… cha."
    ],
    "innerText": "Nasanidassanasappaṭighaṃ nabahiddhārammaṇañca naanidassanaappaṭighaṃ nabahiddhārammaṇañca dhammaṃ paṭicca nasanidassanasappaṭigho nabahiddhārammaṇo dhammo uppajjati hetupaccayā… cha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Naanidassanasappaṭighaṃ nabahiddhārammaṇañca naanidassanaappaṭighaṃ nabahiddhārammaṇañca dhammaṃ paṭicca nasanidassanasappaṭigho nabahiddhārammaṇo dhammo uppajjati hetupaccayā… cha. (Saṃkhittaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hetuyā tiṃsa, ārammaṇe nava…pe… avigate tiṃsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Sahajātavārepi paccayavārepi nissayavārepi saṃsaṭṭhavārepi sampayuttavārepi pañhāvārepi vitthāro.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhammapaccanīye tikatikapaṭṭhānaṃ niṭṭhitaṃ."
  }
]