[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "18. Aṭṭhārasamavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Manussalokakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "802-803"
      },
      ". Idāni ",
      " manussalokakathā nāma hoti. Tattha ‘‘tathāgato loke, jāto loke saṃvaḍḍho, lokaṃ abhibhuyya viharati ",
      " anupalitto lokenā’’ti (saṃ. ni. 3.94) suttaṃ ayoniso gahetvā ‘‘bhagavā tusitabhavane nibbatto tattheva vasati, na manussalokaṃ āgacchati, nimmitarūpamattakaṃ panettha dassetī’’ti yesaṃ laddhi, seyyathāpi etarahi vetullakānaṃyeva, te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ puṭṭhokāsena ceva suttasādhanena ca saññāpetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nanu atthī"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Loke jāto"
      },
      "ti paravādī tusitapuraṃ sandhāya vadati. Satthārā panetaṃ manussalokaññeva sandhāya lokaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokaṃ abhibhuyyā"
      },
      "ti paravādī manussalokaṃ abhibhavitvāti diṭṭhiyā vadati, satthā pana ārammaṇalokaṃ abhibhavitvā vihāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupalitto lokenā"
      },
      "ti paravādī manussalokena anupalittataṃva sandhāya vadati, satthā pana lokadhammesu kilesehi anupalitto vihāsi. Tasmā asādhakametanti."
    ],
    "innerText": "802-803. Idāni manussalokakathā nāma hoti. Tattha ‘‘tathāgato loke, jāto loke saṃvaḍḍho, lokaṃ abhibhuyya viharati anupalitto lokenā’’ti (saṃ. ni. 3.94) suttaṃ ayoniso gahetvā ‘‘bhagavā tusitabhavane nibbatto tattheva vasati, na manussalokaṃ āgacchati, nimmitarūpamattakaṃ panettha dassetī’’ti yesaṃ laddhi, seyyathāpi etarahi vetullakānaṃyeva, te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ puṭṭhokāsena ceva suttasādhanena ca saññāpetuṃ nanu atthītiādimāha. Loke jātoti paravādī tusitapuraṃ sandhāya vadati. Satthārā panetaṃ manussalokaññeva sandhāya lokaṃ vuttaṃ. Lokaṃ abhibhuyyāti paravādī manussalokaṃ abhibhavitvāti diṭṭhiyā vadati, satthā pana ārammaṇalokaṃ abhibhavitvā vihāsi. Anupalitto lokenāti paravādī manussalokena anupalittataṃva sandhāya vadati, satthā pana lokadhammesu kilesehi anupalitto vihāsi. Tasmā asādhakametanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Manussalokakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Dhammadesanākathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "804-806"
      },
      ". Idāni dhammadesanākathā nāma hoti. Tattha ‘‘tusitapure ṭhito bhagavā dhammadesanatthāya abhinimmitaṃ pesesi, tena ceva tassa ca desanaṃ sampaṭicchitvā āyasmatā ānandena dhammo ",
      " desito, na buddhena bhagavatā’’ti yesaṃ laddhi, seyyathāpi vetullakānaññeva; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘yadi tena dhammo desito, sveva satthā bhaveyyā’’ti codetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhinimmito jino"
      },
      "tiādimāha. Itaro tathā asampaṭicchanto paṭikkhipati. Sesamettha uttānatthamevāti."
    ],
    "innerText": "804-806. Idāni dhammadesanākathā nāma hoti. Tattha ‘‘tusitapure ṭhito bhagavā dhammadesanatthāya abhinimmitaṃ pesesi, tena ceva tassa ca desanaṃ sampaṭicchitvā āyasmatā ānandena dhammo desito, na buddhena bhagavatā’’ti yesaṃ laddhi, seyyathāpi vetullakānaññeva; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘yadi tena dhammo desito, sveva satthā bhaveyyā’’ti codetuṃ abhinimmito jinotiādimāha. Itaro tathā asampaṭicchanto paṭikkhipati. Sesamettha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhammadesanākathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Karuṇākathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "807-808"
      },
      ". Idāni ",
      " karuṇākathā nāma hoti. Tattha piyāyitānaṃ vatthūnaṃ vipattiyā sarāgānaṃ rāgavasena karuṇāpatirūpikaṃ pavattiṃ disvā ‘‘rāgova ",
      " karuṇā nāma, so ca bhagavato natthi, tasmā natthi buddhassa bhagavato karuṇā’’ti yesaṃ laddhi, seyyathāpi uttarāpathakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘karuṇā nāmesā nikkilesatāya ceva sattārammaṇatāya ca cetovimuttitāya ca ekādasānisaṃsatāya ca mettādīhi samānajātikā, tasmā yadi bhagavato karuṇā natthi, mettādayopissa na siyu’’nti codanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "natthi buddhassa bhagavato mettā"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākāruṇiko"
      },
      "ti pañhe tathārūpaṃ vohāraṃ apassanto paṭikkhipati. Sesamettha uttānatthamevāti."
    ],
    "innerText": "807-808. Idāni karuṇākathā nāma hoti. Tattha piyāyitānaṃ vatthūnaṃ vipattiyā sarāgānaṃ rāgavasena karuṇāpatirūpikaṃ pavattiṃ disvā ‘‘rāgova karuṇā nāma, so ca bhagavato natthi, tasmā natthi buddhassa bhagavato karuṇā’’ti yesaṃ laddhi, seyyathāpi uttarāpathakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘karuṇā nāmesā nikkilesatāya ceva sattārammaṇatāya ca cetovimuttitāya ca ekādasānisaṃsatāya ca mettādīhi samānajātikā, tasmā yadi bhagavato karuṇā natthi, mettādayopissa na siyu’’nti codanatthaṃ natthi buddhassa bhagavato mettātiādimāha. Ākāruṇikoti pañhe tathārūpaṃ vohāraṃ apassanto paṭikkhipati. Sesamettha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Karuṇākathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Gandhajātakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "809"
      },
      ". Idāni gandhajātakathā nāma hoti. Tattha yesaṃ buddhe bhagavati ayoniso pemavasena ‘‘bhagavato uccārapassāvo aññe gandhajāte ativiya adhigaṇhāti, natthi tato ca sugandhataraṃ gandhajāta’’nti laddhi, seyyathāpi ekaccānaṃ andhakānañceva ",
      " uttarāpathakānañca; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Sesamettha yathāpāḷimeva niyyātīti."
    ],
    "innerText": "809. Idāni gandhajātakathā nāma hoti. Tattha yesaṃ buddhe bhagavati ayoniso pemavasena ‘‘bhagavato uccārapassāvo aññe gandhajāte ativiya adhigaṇhāti, natthi tato ca sugandhataraṃ gandhajāta’’nti laddhi, seyyathāpi ekaccānaṃ andhakānañceva uttarāpathakānañca; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Sesamettha yathāpāḷimeva niyyātīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Gandhajātakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Ekamaggakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "810-811"
      },
      ". Idāni ekamaggakathā nāma hoti. Tattha yesaṃ buddhe bhagavati ayoniso pemavaseneva ",
      " ‘‘bhagavā sotāpanno hutvā sakadāgāmī, sakadāgāmī hutvā anāgāmī, anāgāmī hutvā arahattaṃ sacchākāsi, ekeneva pana ariyamaggena cattāri phalāni sacchākāsī’’ti laddhi, seyyathāpi tesaññeva; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ catūhi phalehi saddhiṃ uppannānaṃ catunnaṃ phassādīnaṃ ekato ",
      " samodhānavasena codetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catunnaṃ phassāna"
      },
      "ntiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sotāpattimaggenā"
      },
      "tiādi ‘‘kataramaggena sacchikarotī’’ti pucchanatthaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arahattamaggenā"
      },
      "ti ca vutte tena sakkāyadiṭṭhiādīnaṃ pahānābhāvavasena codeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavā sotāpanno"
      },
      "ti buddhabhūtassa sotāpannabhāvo natthīti paṭikkhipati. Parato pañhadvayepi eseva nayo. Sesamettha yathāpāḷimeva niyyātīti."
    ],
    "innerText": "810-811. Idāni ekamaggakathā nāma hoti. Tattha yesaṃ buddhe bhagavati ayoniso pemavaseneva ‘‘bhagavā sotāpanno hutvā sakadāgāmī, sakadāgāmī hutvā anāgāmī, anāgāmī hutvā arahattaṃ sacchākāsi, ekeneva pana ariyamaggena cattāri phalāni sacchākāsī’’ti laddhi, seyyathāpi tesaññeva; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ catūhi phalehi saddhiṃ uppannānaṃ catunnaṃ phassādīnaṃ ekato samodhānavasena codetuṃ catunnaṃ phassānantiādimāha. Sotāpattimaggenātiādi ‘‘kataramaggena sacchikarotī’’ti pucchanatthaṃ vuttaṃ. Arahattamaggenāti ca vutte tena sakkāyadiṭṭhiādīnaṃ pahānābhāvavasena codeti. Bhagavā sotāpannoti buddhabhūtassa sotāpannabhāvo natthīti paṭikkhipati. Parato pañhadvayepi eseva nayo. Sesamettha yathāpāḷimeva niyyātīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ekamaggakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Jhānasaṅkantikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "813-816"
      },
      ". Idāni jhānasaṅkantikathā nāma hoti. Tattha yesaṃ ‘‘idha, bhikkhave, bhikkhu vivicceva kāmehi paṭhamaṃ jhānaṃ upasampajja viharati, vitakkavicārānaṃ vūpasamā dutiyaṃ jhānaṃ, tatiyaṃ jhānaṃ, catutthaṃ jhānaṃ upasampajja viharatī’’ti (saṃ. ni. 5.923-934) imaṃ paṭipāṭidesanaṃ ",
      " nissāya ‘‘tassa tassa jhānassa upacārappavattiṃ vināva jhānā jhānaṃ saṅkamatī’’ti laddhi, seyyathāpi mahisāsakānañceva ekaccānañca andhakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘yadi te dutiyajjhānūpacāraṃ appatvā uppaṭipāṭiyā paṭhamajjhānā dutiyajjhānameva saṅkamati, paṭhamato tatiyaṃ, dutiyato catutthampi saṅkameyyā’’ti codetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭhamā jhānā"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yā paṭhamassā"
      },
      "tiādi ‘‘yadi paṭhamato anantaraṃ dutiyaṃ, dutiyādīhi vā tatiyādīni samāpajjati, ekāvajjanena samāpajjeyyā’’ti codanatthaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāme ādīnavato"
      },
      "ti paṭhamaṃ kāme ādīnavato manasi karoto pacchā uppajjati. Jhānakkhaṇe panesa nimittameva manasi karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taññeva paṭhama"
      },
      "nti ‘‘yadi purimajavanato pacchimajavanaṃ viya anantaraṃ uppajjeyya, ṭhapetvā purimapacchimabhāvaṃ lakkhaṇato taññeva taṃ bhaveyyā’’ti codetuṃ pucchati. Iminā upāyena ",
      " sabbattha attho veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivicceva kāmehī"
      },
      "tiādīhi paṭipāṭiyā jhānānaṃ desitabhāvaṃ dīpeti, na anantaruppattiṃ, tasmā asādhakanti."
    ],
    "innerText": "813-816. Idāni jhānasaṅkantikathā nāma hoti. Tattha yesaṃ ‘‘idha, bhikkhave, bhikkhu vivicceva kāmehi paṭhamaṃ jhānaṃ upasampajja viharati, vitakkavicārānaṃ vūpasamā dutiyaṃ jhānaṃ, tatiyaṃ jhānaṃ, catutthaṃ jhānaṃ upasampajja viharatī’’ti (saṃ. ni. 5.923-934) imaṃ paṭipāṭidesanaṃ nissāya ‘‘tassa tassa jhānassa upacārappavattiṃ vināva jhānā jhānaṃ saṅkamatī’’ti laddhi, seyyathāpi mahisāsakānañceva ekaccānañca andhakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘yadi te dutiyajjhānūpacāraṃ appatvā uppaṭipāṭiyā paṭhamajjhānā dutiyajjhānameva saṅkamati, paṭhamato tatiyaṃ, dutiyato catutthampi saṅkameyyā’’ti codetuṃ paṭhamā jhānātiādimāha. Yā paṭhamassātiādi ‘‘yadi paṭhamato anantaraṃ dutiyaṃ, dutiyādīhi vā tatiyādīni samāpajjati, ekāvajjanena samāpajjeyyā’’ti codanatthaṃ vuttaṃ. Kāme ādīnavatoti paṭhamaṃ kāme ādīnavato manasi karoto pacchā uppajjati. Jhānakkhaṇe panesa nimittameva manasi karoti. Taññeva paṭhamanti ‘‘yadi purimajavanato pacchimajavanaṃ viya anantaraṃ uppajjeyya, ṭhapetvā purimapacchimabhāvaṃ lakkhaṇato taññeva taṃ bhaveyyā’’ti codetuṃ pucchati. Iminā upāyena sabbattha attho veditabbo. Vivicceva kāmehītiādīhi paṭipāṭiyā jhānānaṃ desitabhāvaṃ dīpeti, na anantaruppattiṃ, tasmā asādhakanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Jhānasaṅkantikathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Jhānantarikakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "817-818"
      },
      ". Idāni ",
      " jhānantarikakathā nāma hoti. Tattha yesaṃ samaye ‘‘pañcakanaye pañca jhānāni vibhattāni, kevalaṃ tayo samādhī uddiṭṭhā’’ti avitakkavicāramattassa samādhino okāsaṃ ajānantānaṃ ‘‘paṭhamassa ca dutiyassa ca jhānassa antare jhānantarikā nāma esā’’ti laddhi, seyyathāpi sammitiyānañceva ekaccānañca andhakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘jhānampi cetasikā dhammā, phassādayopi, tasmā yadi jhānantarikā nāma bhaveyya, phassantarikādīhipi bhavitabba’’nti codanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthi phassantarikā"
      },
      "tiādimāha ",
      "."
    ],
    "innerText": "817-818. Idāni jhānantarikakathā nāma hoti. Tattha yesaṃ samaye ‘‘pañcakanaye pañca jhānāni vibhattāni, kevalaṃ tayo samādhī uddiṭṭhā’’ti avitakkavicāramattassa samādhino okāsaṃ ajānantānaṃ ‘‘paṭhamassa ca dutiyassa ca jhānassa antare jhānantarikā nāma esā’’ti laddhi, seyyathāpi sammitiyānañceva ekaccānañca andhakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘jhānampi cetasikā dhammā, phassādayopi, tasmā yadi jhānantarikā nāma bhaveyya, phassantarikādīhipi bhavitabba’’nti codanatthaṃ atthi phassantarikātiādimāha ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dutiyassa ca jhānassā"
      },
      "ti ‘‘yadi jhānantarikā nāma bhaveyya, dutiyatatiyādīnipi jhānāneva, tesampi antarikāya bhavitabba’’nti codanatthaṃ vuttaṃ. So kevalaṃ laddhiyā abhāvena paṭikkhipati ceva paṭijānāti ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamassa cā"
      },
      "ti puṭṭho laddhivasena paṭijānāti."
    ],
    "innerText": "Dutiyassa ca jhānassāti ‘‘yadi jhānantarikā nāma bhaveyya, dutiyatatiyādīnipi jhānāneva, tesampi antarikāya bhavitabba’’nti codanatthaṃ vuttaṃ. So kevalaṃ laddhiyā abhāvena paṭikkhipati ceva paṭijānāti ca. Paṭhamassa cāti puṭṭho laddhivasena paṭijānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "819"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Savitakko savicāro"
      },
      "tiādi ‘‘tiṇṇampi samādhīnaṃ samādhibhāve samāne avitakko vicāramattova samādhi jhānantariko, na itaroti ko ettha visesahetū’’ti codanatthaṃ vuttaṃ."
    ],
    "innerText": "819.Savitakko savicārotiādi ‘‘tiṇṇampi samādhīnaṃ samādhibhāve samāne avitakko vicāramattova samādhi jhānantariko, na itaroti ko ettha visesahetū’’ti codanatthaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "820-822"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvinnaṃ jhānānaṃ paṭuppannāna"
      },
      "nti paṭhamadutiyāni sandhāya pucchati. Itaro ‘‘tesaṃ paccuppannānaṃyeva antare avitakko vicāramatto samādhi jhānantariko nāma hotī’’ti laddhiyā paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamaṃ jhānaṃ niruddha"
      },
      "nti puṭṭho tiṇṇaṃ ekakkhaṇe pavatti na yuttāti paṭijānāti ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avitakko vicāramatto samādhi paṭhamaṃ jhāna"
      },
      "nti catukkanayavasena pucchati. Sakavādī tasmiṃ naye tassa abhāvā paṭikkhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nanu tayo samādhī"
      },
      "ti etthāyamadhippāyo – yathā tesu tīsu samādhīsu dve samādhī jhānāneva, na jhānantarikā, evaṃ itarenapi jhāneneva bhavitabbaṃ, na jhānantarikāyāti."
    ],
    "innerText": "820-822.Dvinnaṃ jhānānaṃ paṭuppannānanti paṭhamadutiyāni sandhāya pucchati. Itaro ‘‘tesaṃ paccuppannānaṃyeva antare avitakko vicāramatto samādhi jhānantariko nāma hotī’’ti laddhiyā paṭijānāti. Paṭhamaṃ jhānaṃ niruddhanti puṭṭho tiṇṇaṃ ekakkhaṇe pavatti na yuttāti paṭijānāti . Avitakko vicāramatto samādhi paṭhamaṃ jhānanti catukkanayavasena pucchati. Sakavādī tasmiṃ naye tassa abhāvā paṭikkhipati. Nanu tayo samādhīti etthāyamadhippāyo – yathā tesu tīsu samādhīsu dve samādhī jhānāneva, na jhānantarikā, evaṃ itarenapi jhāneneva bhavitabbaṃ, na jhānantarikāyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Jhānantarikakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Samāpanno saddaṃ suṇātītikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "823-825"
      },
      ". Idāni ",
      " samāpanno saddaṃ suṇātītikathā nāma hoti. Tattha ‘‘yasmā paṭhamassa jhānassa saddo kaṇḍako vutto bhagavatā, yadi ca samāpanno taṃ na suṇeyya, kathaṃ kaṇḍako siyā. Tasmā samāpanno saddaṃ, suṇātī’’ti yesaṃ laddhi, seyyathāpi pubbaseliyānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhunā rūpaṃ passatī"
      },
      "tiādi ‘‘samāpannassa tāva pañcadvārappavattaṃ natthi, tasmiṃ asati ",
      " yadi so saddaṃ suṇeyya, rūpampi passeyyā’’ti codanatthaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddo kaṇḍako"
      },
      "ti vikkhepakarattā vuttaṃ. Oḷārikena hi saddena sote ghaṭṭite paṭhamajjhānato vuṭṭhānaṃ hoti, tenetaṃ vuttaṃ, tasmā asādhakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dutiyassa jhānassā"
      },
      "tiādi ‘‘yathā aññopi kaṇḍako antosamāpattiyaṃ natthi, evaṃ saddassavanampī’’ti bodhanatthaṃ vuttaṃ, taṃ sabbaṃ uttānatthamevāti."
    ],
    "innerText": "823-825. Idāni samāpanno saddaṃ suṇātītikathā nāma hoti. Tattha ‘‘yasmā paṭhamassa jhānassa saddo kaṇḍako vutto bhagavatā, yadi ca samāpanno taṃ na suṇeyya, kathaṃ kaṇḍako siyā. Tasmā samāpanno saddaṃ, suṇātī’’ti yesaṃ laddhi, seyyathāpi pubbaseliyānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Cakkhunā rūpaṃ passatītiādi ‘‘samāpannassa tāva pañcadvārappavattaṃ natthi, tasmiṃ asati yadi so saddaṃ suṇeyya, rūpampi passeyyā’’ti codanatthaṃ vuttaṃ. Saddo kaṇḍakoti vikkhepakarattā vuttaṃ. Oḷārikena hi saddena sote ghaṭṭite paṭhamajjhānato vuṭṭhānaṃ hoti, tenetaṃ vuttaṃ, tasmā asādhakaṃ. Dutiyassa jhānassātiādi ‘‘yathā aññopi kaṇḍako antosamāpattiyaṃ natthi, evaṃ saddassavanampī’’ti bodhanatthaṃ vuttaṃ, taṃ sabbaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Samāpanno saddaṃ suṇātītikathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Cakkhunārūpaṃpassatītikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "826-827"
      },
      ". Idāni cakkhunā rūpaṃ passatītikathā nāma hoti. Tattha ‘‘cakkhunā rūpaṃ disvā’’ti vacanaṃ nissāya ‘‘pasādacakkhumeva rūpaṃ passatī’’ti yesaṃ laddhi, seyyathāpi mahāsaṅghikānaṃ ",
      ", te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘yadi cakkhunā rūpaṃ passeyya, rūpena rūpaṃ passeyyātī’’ti codetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpena rūpaṃ passatī"
      },
      "ti āha. Itaro rūpāyatanaṃ sandhāya paṭikkhipitvā puna puṭṭho cakkhumeva sandhāya paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭivijānātī"
      },
      "ti ettha ayamadhippāyo – passatīti hi mayaṃ paṭijānanaṃ sandhāya pucchāma, na cakkhūpasaṃhāramattaṃ. Tasmā vadehi tāva ‘‘kiṃ te cakkhumā rūpena rūpaṃ paṭivijānātī’’ti. Itaro purimanayeneva paṭikkhipati ceva paṭijānāti ca. Atha naṃ ‘‘evaṃ sante rūpaṃ manoviññāṇaṃ āpajjati, tañhi paṭivijānāti nāmā’’ti codetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpaṃ manoviññāṇa"
      },
      "nti āha. Itaro lesaṃ alabhanto paṭikkhipateva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthi cakkhussa āvaṭṭanā"
      },
      "tiādi ‘‘yadi cakkhu paṭivijānanaṭṭhena passati, cakkhuviññāṇassa viya tassāpi āvajjanāya ",
      " bhavitabba’’nti codetuṃ pucchati. Itaro yasmā na āvajjanapaṭibaddhaṃ cakkhu, na taṃ āvajjanānantaraṃ uppajjati, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na heva"
      },
      "nti paṭikkhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sotena sadda"
      },
      "ntiādīsupi ",
      " eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ passatī"
      },
      "ti sasambhārakathānayena vuttaṃ. Yathā hi usunā vijjhantopi ‘‘dhanunā vijjhatī’’ti vuccati, evaṃ cakkhuviññāṇena passantopi ‘‘cakkhunā passatī’’ti vutto, tasmā asādhakametaṃ. Sesesupi eseva nayopi."
    ],
    "innerText": "826-827. Idāni cakkhunā rūpaṃ passatītikathā nāma hoti. Tattha ‘‘cakkhunā rūpaṃ disvā’’ti vacanaṃ nissāya ‘‘pasādacakkhumeva rūpaṃ passatī’’ti yesaṃ laddhi, seyyathāpi mahāsaṅghikānaṃ , te sandhāya pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘yadi cakkhunā rūpaṃ passeyya, rūpena rūpaṃ passeyyātī’’ti codetuṃ rūpena rūpaṃ passatīti āha. Itaro rūpāyatanaṃ sandhāya paṭikkhipitvā puna puṭṭho cakkhumeva sandhāya paṭijānāti. Paṭivijānātīti ettha ayamadhippāyo – passatīti hi mayaṃ paṭijānanaṃ sandhāya pucchāma, na cakkhūpasaṃhāramattaṃ. Tasmā vadehi tāva ‘‘kiṃ te cakkhumā rūpena rūpaṃ paṭivijānātī’’ti. Itaro purimanayeneva paṭikkhipati ceva paṭijānāti ca. Atha naṃ ‘‘evaṃ sante rūpaṃ manoviññāṇaṃ āpajjati, tañhi paṭivijānāti nāmā’’ti codetuṃ rūpaṃ manoviññāṇanti āha. Itaro lesaṃ alabhanto paṭikkhipateva. Atthi cakkhussa āvaṭṭanātiādi ‘‘yadi cakkhu paṭivijānanaṭṭhena passati, cakkhuviññāṇassa viya tassāpi āvajjanāya bhavitabba’’nti codetuṃ pucchati. Itaro yasmā na āvajjanapaṭibaddhaṃ cakkhu, na taṃ āvajjanānantaraṃ uppajjati, tasmā na hevanti paṭikkhipati. Sotena saddantiādīsupi eseva nayo. Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ passatīti sasambhārakathānayena vuttaṃ. Yathā hi usunā vijjhantopi ‘‘dhanunā vijjhatī’’ti vuccati, evaṃ cakkhuviññāṇena passantopi ‘‘cakkhunā passatī’’ti vutto, tasmā asādhakametaṃ. Sesesupi eseva nayopi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cakkhunā rūpaṃ passatītikathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aṭṭhārasamo vaggo."
  }
]