[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "10. Indriyayamakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " tesaññeva mūlayamake desitānaṃ kusalādidhammānaṃ labbhamānavasena ekadesaṃ saṃgaṇhitvā dhammayamakānantaraṃ desitassa indriyayamakassa vaṇṇanā hoti. Tattha khandhayamakādīsu vuttanayeneva pāḷivavatthānaṃ veditabbaṃ. Idhāpi hi paṇṇattivārādayo tayo mahāvārā avasesā antaravārā ca saddhiṃ kālappabhedādīhi khandhayamakādīsu āgatasadisāva. Indriyānaṃ pana bahutāya dhātuyamakatopi bahutarāni yamakāni honti. Yathā pana heṭṭhā puggalavārādīsu cakkhāyatanacakkhudhātumūlake naye cakkhāyatanacakkhudhātūhi saddhiṃ jivhāyatanakāyāyatanāni na yojitāni. Jivhāyatanakāyāyatanamūlakāni ca yamakāneva na gahitāni, tathā idhāpi cakkhundriyamūlake naye jivhindriyakāyindriyāni na yojitāni, jivhindriyakāyindriyamūlakāni ca yamakāneva na gahitāni. Tesaṃ aggahaṇe kāraṇaṃ tattha vuttanayeneva veditabbaṃ. Manindriyaṃ pana yathā cakkhundriyādimūlakehi tatheva itthindriyādimūlakehipi saddhiṃ yasmā yojanaṃ gacchati, tasmā nikkhittapaṭipāṭiyā ayojetvā sabbehipi cakkhundriyamūlakādīhi saddhiṃ pariyosāne yojitanti veditabbaṃ. Cakkhundriyena saddhiṃ itthindriyapurisindriyajīvitindriyāni ",
      " yojitāni sukhindriyadukkhindriyadomanassindriyāni paṭisandhiyaṃ natthīti na gahitāni. Somanassindriyaupekkhindriyāni paṭisandhiyaṃ uppattisabbhāvato gahitāni. Tathā saddhindriyādīni pañca. Lokuttarāni tīṇi paṭisandhiyaṃ abhāveneva na gahitāni. Iti yāni gahitāni, tesaṃ ",
      " vasenettha cakkhundriyamūlake naye yamakagaṇanā veditabbā. Yathā cettha, evaṃ sabbattha. Yāni pana na gahitāni, tesaṃ vasena yamakāni na gaṇetabbāni. Gaṇentena vā moghapucchāvasena gaṇetabbānīti evaṃ tāva sabbavāresu pāḷivavatthānameva veditabbaṃ."
    ],
    "innerText": "Idāni tesaññeva mūlayamake desitānaṃ kusalādidhammānaṃ labbhamānavasena ekadesaṃ saṃgaṇhitvā dhammayamakānantaraṃ desitassa indriyayamakassa vaṇṇanā hoti. Tattha khandhayamakādīsu vuttanayeneva pāḷivavatthānaṃ veditabbaṃ. Idhāpi hi paṇṇattivārādayo tayo mahāvārā avasesā antaravārā ca saddhiṃ kālappabhedādīhi khandhayamakādīsu āgatasadisāva. Indriyānaṃ pana bahutāya dhātuyamakatopi bahutarāni yamakāni honti. Yathā pana heṭṭhā puggalavārādīsu cakkhāyatanacakkhudhātumūlake naye cakkhāyatanacakkhudhātūhi saddhiṃ jivhāyatanakāyāyatanāni na yojitāni. Jivhāyatanakāyāyatanamūlakāni ca yamakāneva na gahitāni, tathā idhāpi cakkhundriyamūlake naye jivhindriyakāyindriyāni na yojitāni, jivhindriyakāyindriyamūlakāni ca yamakāneva na gahitāni. Tesaṃ aggahaṇe kāraṇaṃ tattha vuttanayeneva veditabbaṃ. Manindriyaṃ pana yathā cakkhundriyādimūlakehi tatheva itthindriyādimūlakehipi saddhiṃ yasmā yojanaṃ gacchati, tasmā nikkhittapaṭipāṭiyā ayojetvā sabbehipi cakkhundriyamūlakādīhi saddhiṃ pariyosāne yojitanti veditabbaṃ. Cakkhundriyena saddhiṃ itthindriyapurisindriyajīvitindriyāni yojitāni sukhindriyadukkhindriyadomanassindriyāni paṭisandhiyaṃ natthīti na gahitāni. Somanassindriyaupekkhindriyāni paṭisandhiyaṃ uppattisabbhāvato gahitāni. Tathā saddhindriyādīni pañca. Lokuttarāni tīṇi paṭisandhiyaṃ abhāveneva na gahitāni. Iti yāni gahitāni, tesaṃ vasenettha cakkhundriyamūlake naye yamakagaṇanā veditabbā. Yathā cettha, evaṃ sabbattha. Yāni pana na gahitāni, tesaṃ vasena yamakāni na gaṇetabbāni. Gaṇentena vā moghapucchāvasena gaṇetabbānīti evaṃ tāva sabbavāresu pāḷivavatthānameva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pavattivāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1-86"
      },
      ". Atthavinicchaye panettha idaṃ nayamukhaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sacakkhukānaṃ na itthīna"
      },
      "nti brahmapārisajjādīnañceva rūpīnaṃ purisanapuṃsakānañca vasena vuttaṃ. Tesañhi itthindriyaṃ nuppajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacakkhukānaṃ na purisāna"
      },
      "nti rūpībrahmānañceva itthinapuṃsakānañca vasena vuttaṃ. Tesañhi purisindriyaṃ nuppajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Acakkhukānaṃ upapajjantānaṃ tesaṃ jīvitindriyaṃ uppajjatī"
      },
      "ti ekavokāracatuvokārakāmadhātusatte sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacakkhukānaṃ vinā somanassenā"
      },
      "ti upekkhāsahagatānaṃ ",
      " catunnaṃ mahāvipākapaṭisandhīnaṃ vasena vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacakkhukānaṃ vinā upekkhāyā"
      },
      "ti somanassasahagatapaṭisandhikānaṃ vasena vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upekkhāya acakkhukāna"
      },
      "nti ahetukapaṭisandhivasena vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahetukāna"
      },
      "nti ahetukapaṭisandhicittena saddhiṃ saddhindriyādīnaṃ abhāvato vuttaṃ. Tattha hi ekanteneva saddhāsatipaññāyo natthi. Samādhivīriyāni pana indriyappattāni na honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahetukānaṃ acakkhukāna"
      },
      "nti gabbhaseyyakavasena ceva arūpīvasena ca vuttaṃ. Añño hi sahetuko acakkhuko nāma natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacakkhukānaṃ ahetukāna"
      },
      "nti apāye opapātikavasena vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacakkhukānaṃ ñāṇavippayuttāna"
      },
      "nti kāmadhātuyaṃ duhetukapaṭisandhikānaṃ vasena vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacakkhukānaṃ ñāṇasampayuttāna"
      },
      "nti rūpībrahmāno ceva kāmāvacaradevamanusse ca sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāṇasampayuttānaṃ acakkhukāna"
      },
      "nti arūpino ca tihetukagabbhaseyyake ca sandhāya vuttaṃ."
    ],
    "innerText": "1-86. Atthavinicchaye panettha idaṃ nayamukhaṃ – sacakkhukānaṃ na itthīnanti brahmapārisajjādīnañceva rūpīnaṃ purisanapuṃsakānañca vasena vuttaṃ. Tesañhi itthindriyaṃ nuppajjati. Sacakkhukānaṃ na purisānanti rūpībrahmānañceva itthinapuṃsakānañca vasena vuttaṃ. Tesañhi purisindriyaṃ nuppajjati. Acakkhukānaṃ upapajjantānaṃ tesaṃ jīvitindriyaṃ uppajjatīti ekavokāracatuvokārakāmadhātusatte sandhāya vuttaṃ. Sacakkhukānaṃ vinā somanassenāti upekkhāsahagatānaṃ catunnaṃ mahāvipākapaṭisandhīnaṃ vasena vuttaṃ. Sacakkhukānaṃ vinā upekkhāyāti somanassasahagatapaṭisandhikānaṃ vasena vuttaṃ. Upekkhāya acakkhukānanti ahetukapaṭisandhivasena vuttaṃ. Ahetukānanti ahetukapaṭisandhicittena saddhiṃ saddhindriyādīnaṃ abhāvato vuttaṃ. Tattha hi ekanteneva saddhāsatipaññāyo natthi. Samādhivīriyāni pana indriyappattāni na honti. Sahetukānaṃ acakkhukānanti gabbhaseyyakavasena ceva arūpīvasena ca vuttaṃ. Añño hi sahetuko acakkhuko nāma natthi. Sacakkhukānaṃ ahetukānanti apāye opapātikavasena vuttaṃ. Sacakkhukānaṃ ñāṇavippayuttānanti kāmadhātuyaṃ duhetukapaṭisandhikānaṃ vasena vuttaṃ. Sacakkhukānaṃ ñāṇasampayuttānanti rūpībrahmāno ceva kāmāvacaradevamanusse ca sandhāya vuttaṃ. Ñāṇasampayuttānaṃ acakkhukānanti arūpino ca tihetukagabbhaseyyake ca sandhāya vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "190"
      },
      ". Jīvitindriyamūlake ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinā somanassena upapajjantāna"
      },
      "nti dvepi jīvitindriyāni sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavatte"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "somanassavippayuttacittassa uppādakkhaṇe"
      },
      "ti arūpajīvitindriyaṃ sandhāya vuttaṃ. Iminā nayena sabbatthāpi paṭisandhipavattivasena jīvitindriyayojanā veditabbā. Somanassindriyādimūlakesupi paṭisandhipavattivasenevattho gahetabbo. Paṭilomanaye pana nirodhavāre ca etesañceva aññesañca dhammānaṃ yathālābhavasena cutipaṭisandhipavattesu tīsupi anuppādanirodhā veditabbā."
    ],
    "innerText": "190. Jīvitindriyamūlake vinā somanassena upapajjantānanti dvepi jīvitindriyāni sandhāya vuttaṃ. Pavattesomanassavippayuttacittassa uppādakkhaṇeti arūpajīvitindriyaṃ sandhāya vuttaṃ. Iminā nayena sabbatthāpi paṭisandhipavattivasena jīvitindriyayojanā veditabbā. Somanassindriyādimūlakesupi paṭisandhipavattivasenevattho gahetabbo. Paṭilomanaye pana nirodhavāre ca etesañceva aññesañca dhammānaṃ yathālābhavasena cutipaṭisandhipavattesu tīsupi anuppādanirodhā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "281"
      },
      ". Anāgatavāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "eteneva bhāvenā"
      },
      "ti etena purisabhāveneva, antarā itthibhāvaṃ anāpajjitvā purisapaṭisandhiggahaṇenevāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katici bhave dassetvā parinibbāyissantī"
      },
      "ti katici paṭisandhiyo gahetvā itthibhāvaṃ appatvāva parinibbāyissantīti attho. Dutiyapucchāyapi eseva nayo."
    ],
    "innerText": "281. Anāgatavāre eteneva bhāvenāti etena purisabhāveneva, antarā itthibhāvaṃ anāpajjitvā purisapaṭisandhiggahaṇenevāti attho. Katici bhave dassetvā parinibbāyissantīti katici paṭisandhiyo gahetvā itthibhāvaṃ appatvāva parinibbāyissantīti attho. Dutiyapucchāyapi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "361"
      },
      ". Paccuppannena atītavāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suddhāvāsānaṃ upapatticittassa bhaṅgakkhaṇe manindriyañca nuppajjitthā"
      },
      "ti cittayamake viya uppādakkhaṇātikkamavasena atthaṃ aggahetvā tasmiṃ bhave anuppannapubbavasena gahetabboti. Iminā nayamukhena sabbasmimpi pavattivāre atthavinicchayo veditabbo."
    ],
    "innerText": "361. Paccuppannena atītavāre suddhāvāsānaṃ upapatticittassa bhaṅgakkhaṇe manindriyañca nuppajjitthāti cittayamake viya uppādakkhaṇātikkamavasena atthaṃ aggahetvā tasmiṃ bhave anuppannapubbavasena gahetabboti. Iminā nayamukhena sabbasmimpi pavattivāre atthavinicchayo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pavattivāravaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pariññāvāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "435-482"
      },
      ". Pariññāvāre ",
      " pana cakkhumūlakādīsu ekameva cakkhusotayamakaṃ dassitaṃ. Yasmā pana sesānipi lokiyaabyākatāni ceva lokiyaabyākatamissakāni ca pariññeyyāneva, tasmā tāni anupadiṭṭhānipi imināva dassitāni honti. Yasmā pana akusalaṃ ekantato pahātabbameva, ekantaṃ kusalaṃ bhāvetabbameva, lokuttarābyākataṃ sacchikātabbaṃ, tasmā ‘‘domanassindriyaṃ pajahatī’’ti ‘‘anaññātaññassāmītindriyaṃ bhāvetī’’ti ‘‘aññātāvindriyaṃ sacchikarotī’’ti vuttaṃ. Aññindriyaṃ pana bhāvetabbampi atthi sacchikātabbampi, taṃ bhāvanāvaseneva gahitaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dve puggalā"
      },
      "ti sakadāgāmimaggasamaṅgī ca, arahattamaggasamaṅgī ca. Tesu eko samucchindituṃ asamatthattā domanassindriyaṃ na pajahati nāma. Eko pahīnadosattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhundriyaṃ na parijānātī"
      },
      "ti anuppādaṃ āpādetuṃ ",
      " asamatthatāya na parijānāti. Iminā nayena sabbavissajjanesu attho veditabboti."
    ],
    "innerText": "435-482. Pariññāvāre pana cakkhumūlakādīsu ekameva cakkhusotayamakaṃ dassitaṃ. Yasmā pana sesānipi lokiyaabyākatāni ceva lokiyaabyākatamissakāni ca pariññeyyāneva, tasmā tāni anupadiṭṭhānipi imināva dassitāni honti. Yasmā pana akusalaṃ ekantato pahātabbameva, ekantaṃ kusalaṃ bhāvetabbameva, lokuttarābyākataṃ sacchikātabbaṃ, tasmā ‘‘domanassindriyaṃ pajahatī’’ti ‘‘anaññātaññassāmītindriyaṃ bhāvetī’’ti ‘‘aññātāvindriyaṃ sacchikarotī’’ti vuttaṃ. Aññindriyaṃ pana bhāvetabbampi atthi sacchikātabbampi, taṃ bhāvanāvaseneva gahitaṃ. Tattha dve puggalāti sakadāgāmimaggasamaṅgī ca, arahattamaggasamaṅgī ca. Tesu eko samucchindituṃ asamatthattā domanassindriyaṃ na pajahati nāma. Eko pahīnadosattā cakkhundriyaṃ na parijānātīti anuppādaṃ āpādetuṃ asamatthatāya na parijānāti. Iminā nayena sabbavissajjanesu attho veditabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pariññāvāravaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Indriyayamakavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nigamanakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā ",
      " ca –"
    ],
    "innerText": "Ettāvatā ca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yassovāde ṭhatvā, niṭṭhitakiccassa kiccasampanno;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yuvatijanopi atīto, suvihitaniyamo yamassāṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Devaparisāya majjhe, devapure sabbadevadevena;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yamakaṃ nāma pakāsitaṃ, yamāmalalomena yaṃ tena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pāḷivavatthānavidhiṃ, pucchāvissajjane ca atthanayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dassetuṃ āraddhā, yamakaaṭṭhakathā mayā tassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Sā ",
      " subahuantarāye, lokamhi yathā anantarāyena;"
    ],
    "innerText": "Sā subahuantarāye, lokamhi yathā anantarāyena;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ayamajja pañcamattehi, tantiyā bhāṇavārehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Niṭṭhaṃ pattā evaṃ, niṭṭhānaṃ pāpuṇantu sabbepi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Hitasukhanibbattikarā, manorathā sabbasattānanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Yamakappakaraṇa-aṭṭhakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammāsambuddhassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "nikaya"
    },
    "innerText": "Abhidhammapiṭake"
  }
]