[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "4. Puggalapaññattimātikā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ekakamātikatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " puggalapaññattimātikāsaṃvaṇṇanānayo hoti. Tattha anuttānatthato tāva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cha paññattiyo"
      },
      "ti ettha ‘‘ācikkhati deseti paññapeti paṭṭhapetī’’ti (saṃ. ni. 2.20) āgataṭṭhāne sandassanā pakāsanā paññatti nāma. ‘‘Supaññattaṃ mañcapīṭha’’nti (pārā. 269) āgataṭṭhāne ṭhapanā nikkhipanā paññatti nāma, idha ubhayampi vaṭṭati. Cha paññattiyoti hi cha paññāpanā cha sandassanā pakāsanātipi, cha ṭhapanā nikkhipanātipi vuttaṃ hoti. Nāmapaññattiyeva hi te te vijjamānāvijjamāne dhamme sandassetītipi. Tena tena koṭṭhāsena ṭhapetītipi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khandhapaññattī"
      },
      "tiādi pana saṅkhepato tāsaṃ paññattīnaṃ sarūpadassanaṃ. Tattha khandhānaṃ ‘‘khandhā’’ti paññāpanā sandassanā pakāsanā ca ṭhapanā nikkhipanā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khandhapaññatti"
      },
      " nāma…pe… puggalānaṃ ‘‘puggalā’’ti paññāpanā sandassanā pakāsanā ca ṭhapanā nikkhipanā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalapaññatti"
      },
      " nāma. Imā eva cha paññattiyo vijjanti. Aññāsampi sammutiparamatthakathānaṃ paññattīnaṃ anantattā, upalakkhaṇavasena pana padhānabhāvato ca etāva vuttā. Pāḷimuttakanayena pana sabbasaṅgāhikā vijjamānapaññattiādayo cha nāmapaññattiyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathāsu"
      },
      " (pu. pa. aṭṭha. mātikāvaṇṇanā 1) āgatā, tā ca heṭṭhā vuttāti idha na vuttā. Tāsu idha puggalapaññattipadena avijjamānapaññatti, sesehi vijjamānapaññatti cāti dve eva labbhanti."
    ],
    "innerText": "Idāni puggalapaññattimātikāsaṃvaṇṇanānayo hoti. Tattha anuttānatthato tāva cha paññattiyoti ettha ‘‘ācikkhati deseti paññapeti paṭṭhapetī’’ti (saṃ. ni. 2.20) āgataṭṭhāne sandassanā pakāsanā paññatti nāma. ‘‘Supaññattaṃ mañcapīṭha’’nti (pārā. 269) āgataṭṭhāne ṭhapanā nikkhipanā paññatti nāma, idha ubhayampi vaṭṭati. Cha paññattiyoti hi cha paññāpanā cha sandassanā pakāsanātipi, cha ṭhapanā nikkhipanātipi vuttaṃ hoti. Nāmapaññattiyeva hi te te vijjamānāvijjamāne dhamme sandassetītipi. Tena tena koṭṭhāsena ṭhapetītipi. Khandhapaññattītiādi pana saṅkhepato tāsaṃ paññattīnaṃ sarūpadassanaṃ. Tattha khandhānaṃ ‘‘khandhā’’ti paññāpanā sandassanā pakāsanā ca ṭhapanā nikkhipanā ca khandhapaññatti nāma…pe… puggalānaṃ ‘‘puggalā’’ti paññāpanā sandassanā pakāsanā ca ṭhapanā nikkhipanā ca puggalapaññatti nāma. Imā eva cha paññattiyo vijjanti. Aññāsampi sammutiparamatthakathānaṃ paññattīnaṃ anantattā, upalakkhaṇavasena pana padhānabhāvato ca etāva vuttā. Pāḷimuttakanayena pana sabbasaṅgāhikā vijjamānapaññattiādayo cha nāmapaññattiyo aṭṭhakathāsu (pu. pa. aṭṭha. mātikāvaṇṇanā 1) āgatā, tā ca heṭṭhā vuttāti idha na vuttā. Tāsu idha puggalapaññattipadena avijjamānapaññatti, sesehi vijjamānapaññatti cāti dve eva labbhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aṭṭhakathāmuttakena pana ācariyanayena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aparāpi cha paññattiyo"
      },
      " – upādāpaññatti upanidhāpaññatti samodhānapaññatti upanikkhittapaññatti tajjāpaññatti santatipaññattīti, yā ‘‘atthapaññattī’’ti ",
      " vuccati. Tattha yā khandhapañcakaṃ upādāya nissāya sammatā ",
      " sattādikā, aṅgāni upādāya rathādikā, candādiparivattādayo upādāya kāladisādikā, taṃtaṃbhūtanimittaṃ, bhāvanāvisesañca upādāya kasiṇādiuggahapaṭibhāganimittādikāti ayaṃ evarūpā sabhāvadhammehi ekattena vā sacchikaṭṭhaparamatthena anupalabbhasabhāvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upādāpaññatti"
      },
      " nāma. Paññāpetabbaṭṭhena cesā paññatti vuttā, na pana paññāpanaṭṭhena. Yā tassa tassatthassa paññāpanā, sā avijjamānapaññattiyeva."
    ],
    "innerText": "Aṭṭhakathāmuttakena pana ācariyanayena aparāpi cha paññattiyo – upādāpaññatti upanidhāpaññatti samodhānapaññatti upanikkhittapaññatti tajjāpaññatti santatipaññattīti, yā ‘‘atthapaññattī’’ti vuccati. Tattha yā khandhapañcakaṃ upādāya nissāya sammatā sattādikā, aṅgāni upādāya rathādikā, candādiparivattādayo upādāya kāladisādikā, taṃtaṃbhūtanimittaṃ, bhāvanāvisesañca upādāya kasiṇādiuggahapaṭibhāganimittādikāti ayaṃ evarūpā sabhāvadhammehi ekattena vā sacchikaṭṭhaparamatthena anupalabbhasabhāvā upādāpaññatti nāma. Paññāpetabbaṭṭhena cesā paññatti vuttā, na pana paññāpanaṭṭhena. Yā tassa tassatthassa paññāpanā, sā avijjamānapaññattiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yā pana aññaṃ paṭhamādiṃ upanidhāya apekkhitvā dutiyaṃ rassaṃ dīghaṃ dūraṃ santikantiādikā tadaññāpekkhūpanidhā, chattapāṇītiādikā hatthagatūpanidhā, kuṇḍalītiādikā sampayuttūpanidhā, dhaññasakaṭanti ādikā samāropitūpanidhā, indasālaguhātiādikā avidūragatūpanidhā, suvaṇṇavaṇṇotiādikā paṭibhāgūpanidhā, brāhmaṇagāmotiādikā tabbahulūpanidhā, maṇikaṭakantiādikā tabbisiṭṭhūpanidhāti evamādi anekappakārā paññāpanā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upanidhāpaññatti"
      },
      " nāma."
    ],
    "innerText": "Yā pana aññaṃ paṭhamādiṃ upanidhāya apekkhitvā dutiyaṃ rassaṃ dīghaṃ dūraṃ santikantiādikā tadaññāpekkhūpanidhā, chattapāṇītiādikā hatthagatūpanidhā, kuṇḍalītiādikā sampayuttūpanidhā, dhaññasakaṭanti ādikā samāropitūpanidhā, indasālaguhātiādikā avidūragatūpanidhā, suvaṇṇavaṇṇotiādikā paṭibhāgūpanidhā, brāhmaṇagāmotiādikā tabbahulūpanidhā, maṇikaṭakantiādikā tabbisiṭṭhūpanidhāti evamādi anekappakārā paññāpanā, ayaṃ upanidhāpaññatti nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dhaññarāsītiādikā pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samodhānapaññatti"
      },
      " nāma. Purimassa purimassa upanikkhipitvā dve tīṇītiādikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upanikkhittapaññatti"
      },
      " nāma. Taṃtaṃsabhāvanissitā pathavīādikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tajjāpaññatti"
      },
      " nāma. Āsītikotiādikā pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "santatipaññatti"
      },
      " nāma."
    ],
    "innerText": "Dhaññarāsītiādikā pana samodhānapaññatti nāma. Purimassa purimassa upanikkhipitvā dve tīṇītiādikā upanikkhittapaññatti nāma. Taṃtaṃsabhāvanissitā pathavīādikā tajjāpaññatti nāma. Āsītikotiādikā pana santatipaññatti nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aṭṭhakathāmuttakeneva ācariyanayena aparāpi dhammakathikādikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiccapaññatti,"
      },
      " kisathūlādikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṇṭhānapaññatti,"
      },
      " itthipurisādikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "liṅgapaññatti,"
      },
      " kāmāvacarādikā, kosalakādikā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhūmipaññatti,"
      },
      " tisso nāgotiādikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccattapaññatti,"
      },
      " nirodhādikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asaṅkhatapaññatti"
      },
      " cāti cha paññattiyo."
    ],
    "innerText": "Aṭṭhakathāmuttakeneva ācariyanayena aparāpi dhammakathikādikā kiccapaññatti, kisathūlādikā saṇṭhānapaññatti, itthipurisādikā liṅgapaññatti, kāmāvacarādikā, kosalakādikā ca bhūmipaññatti, tisso nāgotiādikā paccattapaññatti, nirodhādikā asaṅkhatapaññatti cāti cha paññattiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Etāsu ",
      " pana dvādasasu tajjāpaññatti, ekaccā bhūmipaññatti, asaṅkhatapaññatti ca vijjamānapaññattisaṅkhātā nāmapaññatti, tadaññā paramatthāvasesā, pana atthapaññattīti dīpitā avijjamānādipaññattiyo cāti. Ayaṃ tāvettha anuttānatthato saṃvaṇṇanā."
    ],
    "innerText": "Etāsu pana dvādasasu tajjāpaññatti, ekaccā bhūmipaññatti, asaṅkhatapaññatti ca vijjamānapaññattisaṅkhātā nāmapaññatti, tadaññā paramatthāvasesā, pana atthapaññattīti dīpitā avijjamānādipaññattiyo cāti. Ayaṃ tāvettha anuttānatthato saṃvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atthanicchayo panetthāpi pāḷinayeneva saddhiṃ hoti, na vinā pāḷiṃ tassa vattumasakkuṇeyyattā ",
      ". Pāḷiyañca yasmā ādito pañca paññattiyo, tadatthabhūtā khandhādayo ca heṭṭhā vibhaṅgappakaraṇe nippadesato kathitāti tā idha ‘‘kittāvatā khandhānaṃ khandhapaññatti, yāvatā pañcakkhandhā rūpakkhandho’’tiādinā saṅkhepeneva niddiṭṭhā, tā cetthāpi vuttatthā. Puggalapaññatti pana heṭṭhā na vuttāti ‘‘kittāvatā puggalānaṃ puggalapaññatti? Samayavimutto, asamayavimutto’’tiādinā ekakādibhedena yāva dasakā dasadhā mātikaṃ ṭhapetvā vitthāreneva vibhattā, sā ca ñātabbapabhedato avuccamānā dubbiññeyyā, tasmā puggalapaññattiyā eva cettha pāḷinayānusārena saṅkhepato atthanicchayo hoti, so cettha mātikāyaṃ vutte sabbapuggale anuddharitvā ñātabbānaṃ dubbiññeyyānaṃ puggalānaṃ ekakādibhedatova mātikaṃ uddharitvā vibhajanavasena saṅkhepatova hoti. Kathaṃ? ‘‘Samayavimutto asamayavimutto, kuppadhammo akuppadhammo, cetanābhabbo anurakkhaṇābhabbo, bhayūparato abhayūparato, bhabbāgamano abhabbāgamano, niyato aniyato, paṭipannako phale ṭhito, samasīsī ṭhitakappī, sotāpanno sattakkhattuparamo kolaṃkolo ekabījī, sakadāgāmī, anāgāmī antarāparinibbāyī upahaccaparinibbāyī asaṅkhāraparinibbāyī sasaṅkhāraparinibbāyī uddhaṃsoto akaniṭṭhagāmī, arahā’’ti ekakamātikā."
    ],
    "innerText": "Atthanicchayo panetthāpi pāḷinayeneva saddhiṃ hoti, na vinā pāḷiṃ tassa vattumasakkuṇeyyattā . Pāḷiyañca yasmā ādito pañca paññattiyo, tadatthabhūtā khandhādayo ca heṭṭhā vibhaṅgappakaraṇe nippadesato kathitāti tā idha ‘‘kittāvatā khandhānaṃ khandhapaññatti, yāvatā pañcakkhandhā rūpakkhandho’’tiādinā saṅkhepeneva niddiṭṭhā, tā cetthāpi vuttatthā. Puggalapaññatti pana heṭṭhā na vuttāti ‘‘kittāvatā puggalānaṃ puggalapaññatti? Samayavimutto, asamayavimutto’’tiādinā ekakādibhedena yāva dasakā dasadhā mātikaṃ ṭhapetvā vitthāreneva vibhattā, sā ca ñātabbapabhedato avuccamānā dubbiññeyyā, tasmā puggalapaññattiyā eva cettha pāḷinayānusārena saṅkhepato atthanicchayo hoti, so cettha mātikāyaṃ vutte sabbapuggale anuddharitvā ñātabbānaṃ dubbiññeyyānaṃ puggalānaṃ ekakādibhedatova mātikaṃ uddharitvā vibhajanavasena saṅkhepatova hoti. Kathaṃ? ‘‘Samayavimutto asamayavimutto, kuppadhammo akuppadhammo, cetanābhabbo anurakkhaṇābhabbo, bhayūparato abhayūparato, bhabbāgamano abhabbāgamano, niyato aniyato, paṭipannako phale ṭhito, samasīsī ṭhitakappī, sotāpanno sattakkhattuparamo kolaṃkolo ekabījī, sakadāgāmī, anāgāmī antarāparinibbāyī upahaccaparinibbāyī asaṅkhāraparinibbāyī sasaṅkhāraparinibbāyī uddhaṃsoto akaniṭṭhagāmī, arahā’’ti ekakamātikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " yo appanaṃ nibbattetuṃ yuttapattakāle rūpārūpasamāpattisaṅkhātehi aṭṭhahi vimokkhehi paccanīkadhammato vimuccitvā tīsu maggesu yena kenaci yathāsakaṃ āsave khepetvā vuṭṭhito, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samayavimutto"
      },
      " nāma. ‘‘Ekacce āsavā parikkhīṇā’’tiādivacanato (pu. pa. 1) hi aṭṭhasamāpattilābhī puthujjano vā khīṇāsavo vā idha na gahito, samāpattilābhino pana phalaṭṭhasekhāva gahitāti veditabbā. Sukkhavipassakakhīṇāsavo, sabbepi ca ariyā maggavimokkhaṃ sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asamayavimuttā"
      },
      " nāma. Bāhirānañhi aṭṭhannaṃ samāpattīnaṃ samāpajjantassa pavivekaṭṭhānalābhādisamayopi atthi, vattakaraṇakālādiasamayopi atthi. Maggavimokkhena vimuccanassa pana tādiso samayo vā asamayo vā natthi, yassa saddhā balavatī, vipassanā ca āraddhā, tassa gacchantassa vā bhuñjantassa vā maggaphalapaṭivedho nāma na hotīti natthi, tasmā sabbe ariyā ariyavimokkhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asamayavimuttā"
      },
      "ti veditabbā. Purimapadepi lokiyasamāpattiññeva sandhāya sekhā samayavimuttā nāma jātā."
    ],
    "innerText": "Tattha yo appanaṃ nibbattetuṃ yuttapattakāle rūpārūpasamāpattisaṅkhātehi aṭṭhahi vimokkhehi paccanīkadhammato vimuccitvā tīsu maggesu yena kenaci yathāsakaṃ āsave khepetvā vuṭṭhito, ayaṃ samayavimutto nāma. ‘‘Ekacce āsavā parikkhīṇā’’tiādivacanato (pu. pa. 1) hi aṭṭhasamāpattilābhī puthujjano vā khīṇāsavo vā idha na gahito, samāpattilābhino pana phalaṭṭhasekhāva gahitāti veditabbā. Sukkhavipassakakhīṇāsavo, sabbepi ca ariyā maggavimokkhaṃ sandhāya asamayavimuttā nāma. Bāhirānañhi aṭṭhannaṃ samāpattīnaṃ samāpajjantassa pavivekaṭṭhānalābhādisamayopi atthi, vattakaraṇakālādiasamayopi atthi. Maggavimokkhena vimuccanassa pana tādiso samayo vā asamayo vā natthi, yassa saddhā balavatī, vipassanā ca āraddhā, tassa gacchantassa vā bhuñjantassa vā maggaphalapaṭivedho nāma na hotīti natthi, tasmā sabbe ariyā ariyavimokkhe asamayavimuttāti veditabbā. Purimapadepi lokiyasamāpattiññeva sandhāya sekhā samayavimuttā nāma jātā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Avasibhāvā aṭṭhasamāpattilābhī pana puthujjano, sotāpannasakadāgāmino dve sekhā aṭṭhasamāpattiṃ ",
      " sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kuppadhammo"
      },
      " nāma. Parihānadhammotipi duvidhā eva. Anāgāmiādayo suppahīnasamādhipāripanthikattā vasibhāvā samāpattilābhī puthujjano, ariyā ca lokuttaradhammepi sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akuppadhammo"
      },
      " nāma. Aparihānadhammoti te eva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cetanābhabbo"
      },
      "ti cetanāsaṅkhātena jhānasamāpattivaḷañjanena aparihāniṃ āpajjituṃ bhabbo. Yo hi rūpārūpajjhānesu āciṇṇavasitāya cetanāsaṅkhātāya jhānasamāpattiyā nirantaraṃ vaḷañjamāno tehi na parihāyati, avaḷañjamāno ca parihāyati, ayaṃ vaḷañjamāno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cetanābhabbo"
      },
      " nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anurakkhaṇābhabbo"
      },
      "ti jhānassa upakārānupakāradhamme jānitvā anurakkhaṇāya avaḷañjamānopi aparihāniṃ āpajjituṃ bhabbo, eso ca purimato balavataro, āciṇṇavasino paññāsampadāya upakārānupakāradhamme jānitvā tadanurūpaṃ paṭipajjanatoti veditabbo."
    ],
    "innerText": "Avasibhāvā aṭṭhasamāpattilābhī pana puthujjano, sotāpannasakadāgāmino dve sekhā aṭṭhasamāpattiṃ sandhāya kuppadhammo nāma. Parihānadhammotipi duvidhā eva. Anāgāmiādayo suppahīnasamādhipāripanthikattā vasibhāvā samāpattilābhī puthujjano, ariyā ca lokuttaradhammepi sandhāya akuppadhammo nāma. Aparihānadhammoti te eva. Cetanābhabboti cetanāsaṅkhātena jhānasamāpattivaḷañjanena aparihāniṃ āpajjituṃ bhabbo. Yo hi rūpārūpajjhānesu āciṇṇavasitāya cetanāsaṅkhātāya jhānasamāpattiyā nirantaraṃ vaḷañjamāno tehi na parihāyati, avaḷañjamāno ca parihāyati, ayaṃ vaḷañjamāno cetanābhabbo nāma. Anurakkhaṇābhabboti jhānassa upakārānupakāradhamme jānitvā anurakkhaṇāya avaḷañjamānopi aparihāniṃ āpajjituṃ bhabbo, eso ca purimato balavataro, āciṇṇavasino paññāsampadāya upakārānupakāradhamme jānitvā tadanurūpaṃ paṭipajjanatoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhayūparato"
      },
      "ti bhayena pāpato uparato virato sekho, kalyāṇaputhujjano ca. Tesu pacchimo duggativaṭṭakilesaupavādasaṅkhātehi catūhi bhayehi pāpato oramati, sekho duggativajjehi, apāyehi muttattā. Khīṇāsavo pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhayūparato"
      },
      " nāma samucchinnabhayattā, upavādato pana oramitabbo."
    ],
    "innerText": "Bhayūparatoti bhayena pāpato uparato virato sekho, kalyāṇaputhujjano ca. Tesu pacchimo duggativaṭṭakilesaupavādasaṅkhātehi catūhi bhayehi pāpato oramati, sekho duggativajjehi, apāyehi muttattā. Khīṇāsavo pana abhayūparato nāma samucchinnabhayattā, upavādato pana oramitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhabbāgamano"
      },
      "ti sammattaniyāmāgamanassa abhabbo, ye ānantariyasaṅkhātena kammāvaraṇena, niyatamicchādiṭṭhisaṅkhātena kilesāvaraṇena, ahetukaduhetukapaṭisandhisaṅkhātena vipākāvaraṇena ca samannāgatā, buddhādīsu ca saddhārahitā, maggabhāvanāya ca uttarakurukādayo viya acchandikā, pubbūpanissayarahitā ca, sabbete ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhabbāgamanā"
      },
      " nāma. Viparītā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhabbāgamanā"
      },
      " nāma. Pañcānantariyaniyatamicchādiṭṭhikā nirayagamane, aṭṭha ariyapuggalā anupādāparinibbānādīsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niyatā"
      },
      " nāma. Avasesapuggalā anibaddhagatikatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aniyatā"
      },
      " nāma, uttarakurukā pana sugatiniyatāpi micchattasammattaniyāmasseva idhādhippetattā ‘‘niyatā’’ti na vuttā. Maggasamaṅgī puggalo maggakkhaṇe phalatthāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭipannako"
      },
      " nāma, phalasamaṅgī phalānuppattiyampi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "phale ṭhito"
      },
      " nāma."
    ],
    "innerText": "Abhabbāgamanoti sammattaniyāmāgamanassa abhabbo, ye ānantariyasaṅkhātena kammāvaraṇena, niyatamicchādiṭṭhisaṅkhātena kilesāvaraṇena, ahetukaduhetukapaṭisandhisaṅkhātena vipākāvaraṇena ca samannāgatā, buddhādīsu ca saddhārahitā, maggabhāvanāya ca uttarakurukādayo viya acchandikā, pubbūpanissayarahitā ca, sabbete abhabbāgamanā nāma. Viparītā bhabbāgamanā nāma. Pañcānantariyaniyatamicchādiṭṭhikā nirayagamane, aṭṭha ariyapuggalā anupādāparinibbānādīsu niyatā nāma. Avasesapuggalā anibaddhagatikatāya aniyatā nāma, uttarakurukā pana sugatiniyatāpi micchattasammattaniyāmasseva idhādhippetattā ‘‘niyatā’’ti na vuttā. Maggasamaṅgī puggalo maggakkhaṇe phalatthāya paṭipannako nāma, phalasamaṅgī phalānuppattiyampi phale ṭhito nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yassa pana apubbācarimaṃ āsavapariyādānañca hoti jīvitapariyādānañca, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samasīsī"
      },
      " nāma. So ca tividho hoti iriyāpathasamasīsī rogasamasīsī jīvitasamasīsīti. Tattha yo catūsu iriyāpathesu ekasmiṃ vipassanaṃ paṭṭhapetvā ",
      " arahattaṃ patvā tasmiññeva iriyāpathe parinibbāti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iriyāpathasamasīsī"
      },
      " nāma. Yo pana ekaṃ rogaṃ patvā antoroge eva ",
      " vipassanaṃ paṭṭhapetvā arahattaṃ patvā teneva rogena parinibbāti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rogasamasīsī"
      },
      " nāma. Yassa pana kilesasīsasaṅkhātā avijjā, arahattamaggena pavattasīsasaṅkhātaṃ jīvitindriyañca cuticittena samaṃ pariyādānaṃ gacchati, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jīvitasamasīsī"
      },
      " nāma. Kathamidaṃ samaṃ hotīti? Vārasamatāya. Yasmiṃ hi vāre maggena kilese khepite paccavekkhaṇañāṇāni pavattanti, tassānantarameva parinibbāyato imāya vārasamatāya idaṃ ubhayasīsapariyādānampi samaṃ hoti nāma, ayameva jīvitasamasīsī idhādhippeto."
    ],
    "innerText": "Yassa pana apubbācarimaṃ āsavapariyādānañca hoti jīvitapariyādānañca, ayaṃ samasīsī nāma. So ca tividho hoti iriyāpathasamasīsī rogasamasīsī jīvitasamasīsīti. Tattha yo catūsu iriyāpathesu ekasmiṃ vipassanaṃ paṭṭhapetvā arahattaṃ patvā tasmiññeva iriyāpathe parinibbāti, ayaṃ iriyāpathasamasīsī nāma. Yo pana ekaṃ rogaṃ patvā antoroge eva vipassanaṃ paṭṭhapetvā arahattaṃ patvā teneva rogena parinibbāti, ayaṃ rogasamasīsī nāma. Yassa pana kilesasīsasaṅkhātā avijjā, arahattamaggena pavattasīsasaṅkhātaṃ jīvitindriyañca cuticittena samaṃ pariyādānaṃ gacchati, ayaṃ jīvitasamasīsī nāma. Kathamidaṃ samaṃ hotīti? Vārasamatāya. Yasmiṃ hi vāre maggena kilese khepite paccavekkhaṇañāṇāni pavattanti, tassānantarameva parinibbāyato imāya vārasamatāya idaṃ ubhayasīsapariyādānampi samaṃ hoti nāma, ayameva jīvitasamasīsī idhādhippeto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhitakappī"
      },
      "ti ṭhito kappo ṭhitakappo, svāssa atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ṭhitakappī,"
      },
      " kappamhi vinassamānamhi kappaṃ ṭhapetuṃ samatthoti attho."
    ],
    "innerText": "Ṭhitakappīti ṭhito kappo ṭhitakappo, svāssa atthīti ṭhitakappī, kappamhi vinassamānamhi kappaṃ ṭhapetuṃ samatthoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sace hi yesaṃ maggasamaṅgikkhaṇe kappavināso bhaveyya, neva tāva kappo vinasseyya, yāvāyaṃ yathāsakaṃ phalaṃ na sacchikarotīti te vinassamānampi kappaṃ ṭhapentīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ṭhitakappino"
      },
      " nāma jātāti. Kiñcāpi kappavināsanakāle sāsanaṃ natthi, gatakoṭike hi kāle kappavināso hoti, evaṃ santepi maggānantaraphalassa anantarāyaṃ dīpetuṃ idaṃ abhūtampi kāraṇaṃ āhaṭaṃ."
    ],
    "innerText": "Sace hi yesaṃ maggasamaṅgikkhaṇe kappavināso bhaveyya, neva tāva kappo vinasseyya, yāvāyaṃ yathāsakaṃ phalaṃ na sacchikarotīti te vinassamānampi kappaṃ ṭhapentīti ṭhitakappino nāma jātāti. Kiñcāpi kappavināsanakāle sāsanaṃ natthi, gatakoṭike hi kāle kappavināso hoti, evaṃ santepi maggānantaraphalassa anantarāyaṃ dīpetuṃ idaṃ abhūtampi kāraṇaṃ āhaṭaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sotāpanno"
      },
      "ti nibbānasamuddaninnatāya sotasaṅkhātassa maggassa paṭhamasamaṅgī vuccati, idha pana phalaṭṭho adhippeto. Tasseva ca pabhedadassanatthaṃ ‘‘sattakkhattuparamo’’tiādi vuttaṃ. Sattavārā paramā assa bhavūpapattīti sattakkhattuparamo, tato paraṃ aṭṭhamaṃ bhavaṃ nādiyatīti attho. Sotāpanno hi yo sattakkhattuṃ devesu, manussesu ca paṭisandhiṃ ",
      " gahetvā sattame bhave dukkhassantaṃ karoti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sattakkhattuparamo"
      },
      " nāma. Kulato kulaṃ bhavato bhavaṃ gacchatīti kolaṃkolo. So hi devamanussavasena dve gatiyo bhave saṃsaritvā dukkhassantaṃ karoti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kolaṃkolo"
      },
      " nāma. Kammapaṭisandhiyā ekaṃ kammaṃ kilesabījaṃ assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekabījī"
      },
      ". So hi ekasmiññeva bhave khīṇāsavo hoti. Kiṃ panassa bhedassa niyāmakanti? Vipassanābhiññābhedā. Sotāpannesu hi yo vipassanāya pamatto, so sattakkhattuparamo hoti. Yo kiñci appamatto, so kolaṃkolo. Yo pana vipassanāya ativiya appamatto, so ekabījī hoti. Ye pana abhiviya pamattā vaṭṭajjhāsayā anāthapiṇḍikavisākhāsakkādayo, te punappunaṃ vaṭṭasmiṃyeva vicarantā ādito paṭṭhāya cha devaloke osāpetvā brahmalokesupi yathākkamaṃ nibbattitvā akaniṭṭhe ṭhatvā parinibbanti, na te idha gahitā. Te hi manussagatiṃ punappunaṃ ",
      " ādiyanti. Ye pana manussagatiyampi bhavaṃ ādiyanti, tesaṃ vasena sattakkhattuparamo kolaṃkolo mānusikabhavanibbattako eva ekabījī gahito. Te pana saddhādhurena āgatā tayo, paññādhurena āgatā tayoti sotāpanno chabbidho hotīti veditabbo."
    ],
    "innerText": "Sotāpannoti nibbānasamuddaninnatāya sotasaṅkhātassa maggassa paṭhamasamaṅgī vuccati, idha pana phalaṭṭho adhippeto. Tasseva ca pabhedadassanatthaṃ ‘‘sattakkhattuparamo’’tiādi vuttaṃ. Sattavārā paramā assa bhavūpapattīti sattakkhattuparamo, tato paraṃ aṭṭhamaṃ bhavaṃ nādiyatīti attho. Sotāpanno hi yo sattakkhattuṃ devesu, manussesu ca paṭisandhiṃ gahetvā sattame bhave dukkhassantaṃ karoti, ayaṃ sattakkhattuparamo nāma. Kulato kulaṃ bhavato bhavaṃ gacchatīti kolaṃkolo. So hi devamanussavasena dve gatiyo bhave saṃsaritvā dukkhassantaṃ karoti, ayaṃ kolaṃkolo nāma. Kammapaṭisandhiyā ekaṃ kammaṃ kilesabījaṃ assāti ekabījī. So hi ekasmiññeva bhave khīṇāsavo hoti. Kiṃ panassa bhedassa niyāmakanti? Vipassanābhiññābhedā. Sotāpannesu hi yo vipassanāya pamatto, so sattakkhattuparamo hoti. Yo kiñci appamatto, so kolaṃkolo. Yo pana vipassanāya ativiya appamatto, so ekabījī hoti. Ye pana abhiviya pamattā vaṭṭajjhāsayā anāthapiṇḍikavisākhāsakkādayo, te punappunaṃ vaṭṭasmiṃyeva vicarantā ādito paṭṭhāya cha devaloke osāpetvā brahmalokesupi yathākkamaṃ nibbattitvā akaniṭṭhe ṭhatvā parinibbanti, na te idha gahitā. Te hi manussagatiṃ punappunaṃ ādiyanti. Ye pana manussagatiyampi bhavaṃ ādiyanti, tesaṃ vasena sattakkhattuparamo kolaṃkolo mānusikabhavanibbattako eva ekabījī gahito. Te pana saddhādhurena āgatā tayo, paññādhurena āgatā tayoti sotāpanno chabbidho hotīti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭisandhivasena pana sakiṃ imaṃ manussagatiṃ āgacchatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sakadāgāmī,"
      },
      " dutiyamaggaphalasamaṅgī. Iminā pañcasu sakadāgāmīsu cattāro vajjetvā ekova gahito. Ekacco hi sakadāgāmiphale ṭhatvā puna dutiyabhave idheva parinibbāti, ekacco idha patvā devaloke parinibbāti, ekacco devaloke patvā dutiyabhave tattheva parinibbāti, ekacco devaloke patvā idhūpapajjitvā parinibbāti, ime cattāropi idha na gahitā. Yo pana idha patvā devaloke ",
      " nibbattitvā puna idhūpapajjitvā parinibbāti, ayamekova idha gahito. Imassa ca dve paṭisandhiyo, ekabījissa pana ekāvāti idaṃ tesaṃ nānākaraṇanti veditabbaṃ."
    ],
    "innerText": "Paṭisandhivasena pana sakiṃ imaṃ manussagatiṃ āgacchatīti sakadāgāmī, dutiyamaggaphalasamaṅgī. Iminā pañcasu sakadāgāmīsu cattāro vajjetvā ekova gahito. Ekacco hi sakadāgāmiphale ṭhatvā puna dutiyabhave idheva parinibbāti, ekacco idha patvā devaloke parinibbāti, ekacco devaloke patvā dutiyabhave tattheva parinibbāti, ekacco devaloke patvā idhūpapajjitvā parinibbāti, ime cattāropi idha na gahitā. Yo pana idha patvā devaloke nibbattitvā puna idhūpapajjitvā parinibbāti, ayamekova idha gahito. Imassa ca dve paṭisandhiyo, ekabījissa pana ekāvāti idaṃ tesaṃ nānākaraṇanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭisandhivasena kāmabhavaṃ nāgacchatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāgāmī,"
      },
      " tatiyamaggaphalasamaṅgī. Tasseva pana pabhedadassanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘antarāparinibbāyī’’"
      },
      "tiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "antarāparinibbāyī"
      },
      "ti āyuvemajjhassa antarā eva arahattamaggaṃ uppādetvā kilesaparinibbānena parinibbāyanasīlo eko anāgāmī. So ca uppannasamanantaraṃ parinibbāyī, āyuvemajjhaṃ appatvā parinibbāyī, āyuvemajjhaṃ patvā parinibbāyīti tividho hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upahaccaparinibbāyī"
      },
      "ti āyuvemajjhaṃ upahacca atikkamitvā, maraṇasamayaṃ vā upahacca upagantvā parinibbāyī, āyuvemajjhaṃ atikkamitvā yāva maraṇasamayā parinibbāyīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaṅkhāraparinibbāyī"
      },
      "ti asaṅkhārena appadukkhena adhimattappayogaṃ akatvā parinibbāyanasīlo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sasaṅkhāraparinibbāyī"
      },
      "ti sasaṅkhārena dukkhena kasirena adhimattappayogena parinibbāyanasīlo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddhaṃsoto"
      },
      "ti uddhaṃvāhibhāvena uddhamassa taṇhāsotaṃ vaṭṭasotañca, uddhaṃ vā gantvā paṭilabhitabbato uddhaṃ maggasotamassātipi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddhaṃsoto"
      },
      ". Akaniṭṭhaṃ gacchatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akaniṭṭhagāmī"
      },
      ". Imesaṃ pana anāgāmīnaṃ pabhedadassanatthampettha uddhaṃsoto akaniṭṭhagāmītiādi catukkaṃ veditabbaṃ."
    ],
    "innerText": "Paṭisandhivasena kāmabhavaṃ nāgacchatīti anāgāmī, tatiyamaggaphalasamaṅgī. Tasseva pana pabhedadassanatthaṃ ‘‘antarāparinibbāyī’’tiādi vuttaṃ. Tattha antarāparinibbāyīti āyuvemajjhassa antarā eva arahattamaggaṃ uppādetvā kilesaparinibbānena parinibbāyanasīlo eko anāgāmī. So ca uppannasamanantaraṃ parinibbāyī, āyuvemajjhaṃ appatvā parinibbāyī, āyuvemajjhaṃ patvā parinibbāyīti tividho hoti. Upahaccaparinibbāyīti āyuvemajjhaṃ upahacca atikkamitvā, maraṇasamayaṃ vā upahacca upagantvā parinibbāyī, āyuvemajjhaṃ atikkamitvā yāva maraṇasamayā parinibbāyīti attho. Asaṅkhāraparinibbāyīti asaṅkhārena appadukkhena adhimattappayogaṃ akatvā parinibbāyanasīlo. Sasaṅkhāraparinibbāyīti sasaṅkhārena dukkhena kasirena adhimattappayogena parinibbāyanasīlo. Uddhaṃsototi uddhaṃvāhibhāvena uddhamassa taṇhāsotaṃ vaṭṭasotañca, uddhaṃ vā gantvā paṭilabhitabbato uddhaṃ maggasotamassātipi uddhaṃsoto. Akaniṭṭhaṃ gacchatīti akaniṭṭhagāmī. Imesaṃ pana anāgāmīnaṃ pabhedadassanatthampettha uddhaṃsoto akaniṭṭhagāmītiādi catukkaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yo avihato paṭṭhāya catūsu yathākkamaṃ uppajjitvā yāvatāyukaṃ ṭhatvā cuto akaniṭṭhe uppajjitvā parinibbāti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddhaṃsoto akaniṭṭhagāmī"
      },
      " nāma. Yo pana akaniṭṭhaṃ appatvā antarā parinibbāti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddhaṃsoto na akaniṭṭhagāmī"
      },
      " nāma. Yo manussaloko akaniṭṭhameva ",
      " gantvā parinibbāti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na uddhaṃsoto akaniṭṭhagāmī"
      },
      " nāma. Yo pana heṭṭhā catūsu suddhāvāsesu aññatarasmiṃ uppajjitvā tattheva parinibbāti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na uddhaṃsoto na akaniṭṭhagāmī"
      },
      " nāma ",
      ". Evamete anāgāmino aṭṭhacattālīsavidhā honti. Kathaṃ? Avihesu tāva tayo antarāparinibbāyino, eko upahaccaparinibbāyī, eko uddhaṃsototi pañca, te asaṅkhāraparinibbāyisasaṅkhāraparinibbāyivasena dasa honti, evaṃ atappasudassasudassīsūti cattālīsaṃ, akaniṭṭhe pana uddhaṃsoto natthi, tasmā tattha taṃ sasaṅkhārāsaṅkhāravasena duvidhaṃ uddhaṃsotaṃ vajjetvā aṭṭha cāti aṭṭhacattālīsa honti."
    ],
    "innerText": "Tattha yo avihato paṭṭhāya catūsu yathākkamaṃ uppajjitvā yāvatāyukaṃ ṭhatvā cuto akaniṭṭhe uppajjitvā parinibbāti, ayaṃ uddhaṃsoto akaniṭṭhagāmī nāma. Yo pana akaniṭṭhaṃ appatvā antarā parinibbāti, ayaṃ uddhaṃsoto na akaniṭṭhagāmī nāma. Yo manussaloko akaniṭṭhameva gantvā parinibbāti, ayaṃ na uddhaṃsoto akaniṭṭhagāmī nāma. Yo pana heṭṭhā catūsu suddhāvāsesu aññatarasmiṃ uppajjitvā tattheva parinibbāti, ayaṃ na uddhaṃsoto na akaniṭṭhagāmī nāma . Evamete anāgāmino aṭṭhacattālīsavidhā honti. Kathaṃ? Avihesu tāva tayo antarāparinibbāyino, eko upahaccaparinibbāyī, eko uddhaṃsototi pañca, te asaṅkhāraparinibbāyisasaṅkhāraparinibbāyivasena dasa honti, evaṃ atappasudassasudassīsūti cattālīsaṃ, akaniṭṭhe pana uddhaṃsoto natthi, tasmā tattha taṃ sasaṅkhārāsaṅkhāravasena duvidhaṃ uddhaṃsotaṃ vajjetvā aṭṭha cāti aṭṭhacattālīsa honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arahā"
      },
      "ti kilesārīnaṃ hatattādinā khīṇāsavo arahā nāma. So suññatādivimokkhattayavasena tividho hutvā puna paccekaṃ paṭipadācatukkavasena dvādasavidhā honti. Yathā ca arahā dvādasavidho, evaṃ dvādaseva sakadāgāmino, catuvīsati sotāpannā aṭṭhacattālīsa anāgāminova paccekanti veditabbaṃ. Ime ca sabbe ariyā imasmiṃ sāsane eva uppajjanti, no bahiddhāti. Ekakanayo."
    ],
    "innerText": "Arahāti kilesārīnaṃ hatattādinā khīṇāsavo arahā nāma. So suññatādivimokkhattayavasena tividho hutvā puna paccekaṃ paṭipadācatukkavasena dvādasavidhā honti. Yathā ca arahā dvādasavidho, evaṃ dvādaseva sakadāgāmino, catuvīsati sotāpannā aṭṭhacattālīsa anāgāminova paccekanti veditabbaṃ. Ime ca sabbe ariyā imasmiṃ sāsane eva uppajjanti, no bahiddhāti. Ekakanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dukādimātikatthavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dukādīsu ‘‘dve puggalā – kodhano ca upanāhī ca makkhī ca paḷāsī cā’’tiādinā dukañca, ‘‘tayo puggalā – nirāso āsaṃso vigatāso’’tiādinā tikañca, ‘‘cattāro puggalā – asappuriso, asappurisenaasappurisataro, sappuriso, sappurisenasappurisataro’’tiādinā catukkañca, ‘‘pañca puggalā – atthekacco puggalo ārabhati ca vippaṭisārī ca hoti, tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ nappajānāti. Yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti, atthekacco puggalo ārabhati na vippaṭisārī ca hoti…pe… aparisesā nirujjhanti, atthekacco puggalo nārabhati vippaṭisārī ca hoti…pe… aparisesā nirujjhanti. Atthekacco ",
      " puggalo nārabhati na vippaṭisārī hoti…pe… aparisesā nirujjhantī’’tiādinā pañcakañca vitthārato mātikaṃ nikkhipitvā sabbepi te puggalā niddiṭṭhā, idha pana te ganthavitthārabhayena sabbe na uddiṭṭhā, pāḷiyā eva ñātabbāti."
    ],
    "innerText": "Dukādīsu ‘‘dve puggalā – kodhano ca upanāhī ca makkhī ca paḷāsī cā’’tiādinā dukañca, ‘‘tayo puggalā – nirāso āsaṃso vigatāso’’tiādinā tikañca, ‘‘cattāro puggalā – asappuriso, asappurisenaasappurisataro, sappuriso, sappurisenasappurisataro’’tiādinā catukkañca, ‘‘pañca puggalā – atthekacco puggalo ārabhati ca vippaṭisārī ca hoti, tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ nappajānāti. Yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti, atthekacco puggalo ārabhati na vippaṭisārī ca hoti…pe… aparisesā nirujjhanti, atthekacco puggalo nārabhati vippaṭisārī ca hoti…pe… aparisesā nirujjhanti. Atthekacco puggalo nārabhati na vippaṭisārī hoti…pe… aparisesā nirujjhantī’’tiādinā pañcakañca vitthārato mātikaṃ nikkhipitvā sabbepi te puggalā niddiṭṭhā, idha pana te ganthavitthārabhayena sabbe na uddiṭṭhā, pāḷiyā eva ñātabbāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " tike ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nirāso"
      },
      "ti arahattāsāya virahito dussīlo. Tassa hi attano abhabbatāya bhabbasahāyakassa sīlavato arahattappattiṃ sutvā, caṇḍālaputtassa viya kassaci rājaputtassa rajjābhisekaṃ sutvā abhisekappattiyaṃ, ‘‘kudāssu nāmāhampi arahattaṃ pāpuṇeyya’’nti arahattappattiyaṃ patthanāpi na uppajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsaṃso"
      },
      "ti arahattaṃ āsīsamāno patthayamāno sīlavā. Tassa hi arahattapatthanāya sīlasampattiyā ṭhitattā kassaci arahattappattiṃ sutvā, ubhatosujātassa rājakumārassa viya tādisassa kassaci rajjābhisekaṃ sutvā abhisekappattiyaṃ, arahattappattiyaṃ patthanā uppajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vigatāso"
      },
      "ti arahā. So hi pattaarahattatāya tattha vigatāso hoti pattābhiseko viya khattiyo abhisekappattiyanti veditabbaṃ."
    ],
    "innerText": "Tattha tike nirāsoti arahattāsāya virahito dussīlo. Tassa hi attano abhabbatāya bhabbasahāyakassa sīlavato arahattappattiṃ sutvā, caṇḍālaputtassa viya kassaci rājaputtassa rajjābhisekaṃ sutvā abhisekappattiyaṃ, ‘‘kudāssu nāmāhampi arahattaṃ pāpuṇeyya’’nti arahattappattiyaṃ patthanāpi na uppajjati. Āsaṃsoti arahattaṃ āsīsamāno patthayamāno sīlavā. Tassa hi arahattapatthanāya sīlasampattiyā ṭhitattā kassaci arahattappattiṃ sutvā, ubhatosujātassa rājakumārassa viya tādisassa kassaci rajjābhisekaṃ sutvā abhisekappattiyaṃ, arahattappattiyaṃ patthanā uppajjati. Vigatāsoti arahā. So hi pattaarahattatāya tattha vigatāso hoti pattābhiseko viya khattiyo abhisekappattiyanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catukke pana pāṇātipātādiakusalakammapathasamannāgato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asappuriso"
      },
      " nāma. Yo pana sayampi pāṇātipātādīni katvā parañca tattha samādapeti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asappurisenaasappurisataro,"
      },
      " asappurisatopi asappurisataroti attho. Vuttapaṭipakkhakusalavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sappuriso, sappurisenasappurisataro"
      },
      " ca veditabbo."
    ],
    "innerText": "Catukke pana pāṇātipātādiakusalakammapathasamannāgato asappuriso nāma. Yo pana sayampi pāṇātipātādīni katvā parañca tattha samādapeti, ayaṃ asappurisenaasappurisataro, asappurisatopi asappurisataroti attho. Vuttapaṭipakkhakusalavasena sappuriso, sappurisenasappurisataro ca veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañcake ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārabhati ca vippaṭisārī ca hotī"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārambha"
      },
      "-saddo āpattivītikkame vattati, tasmā āpattivītikkamavasena ārabhati ceva tappaccayā ca vippaṭisārī hotīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cetovimutti"
      },
      "nti phalasampayuttasamādhiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāvimutti"
      },
      "nti phalasampayuttañāṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathābhūtaṃ nappajānātī"
      },
      "ti anadhigatattā ",
      " yathāsabhāvato nappajānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yatthassā"
      },
      "ti yasmiṃ arahattaphalasaṅkhāte jhāne adhigate assa puggalassa sabbe pāpakā akusalā dhammā niravasesā nirujjhanti, te nappajānātīti sambandho. Kiñcāpi te maggakkhaṇe eva nirujjhanti nāma, phalakkhaṇe pana niruddhā nāma honti, idha pana maggakiccavasena ‘‘phalakkhaṇe nirujjhantī’’ti vuttāti veditabbā."
    ],
    "innerText": "Pañcake ārabhati ca vippaṭisārī ca hotīti ettha ārambha-saddo āpattivītikkame vattati, tasmā āpattivītikkamavasena ārabhati ceva tappaccayā ca vippaṭisārī hotīti attho. Cetovimuttinti phalasampayuttasamādhiṃ. Paññāvimuttinti phalasampayuttañāṇaṃ. Yathābhūtaṃ nappajānātīti anadhigatattā yathāsabhāvato nappajānāti. Yatthassāti yasmiṃ arahattaphalasaṅkhāte jhāne adhigate assa puggalassa sabbe pāpakā akusalā dhammā niravasesā nirujjhanti, te nappajānātīti sambandho. Kiñcāpi te maggakkhaṇe eva nirujjhanti nāma, phalakkhaṇe pana niruddhā nāma honti, idha pana maggakiccavasena ‘‘phalakkhaṇe nirujjhantī’’ti vuttāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārabhati na vippaṭisārī ca hotī"
      },
      "ti āpattiṃ āpajjati, taṃ pana desetuṃ sabhāgapuggalaṃ pariyesati, vuṭṭhāpeti vā, tasmā na vippaṭisārī hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nārabhati vippaṭisārī ca hotī"
      },
      "ti āpattiṃ nāpajjati, vinayapaññattiyaṃ pana akovidattā anāpattiyā āpattisaññitāya vuṭṭhitāyapi taṃ āpattiyā vippaṭisāraṃ vinodetuṃ asakkuṇeyyatāya vippaṭisārī hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nārabhati na vippaṭisārī hotī"
      },
      "ti nārabhati neva āpattiṃ āpajjati, na vippaṭisārī hoti. Arahattañca ",
      " na pāpuṇāti. Kataro panesa puggaloti? Sīlavā ossaṭṭhavīriyo puggalo. So hi ‘‘kiṃ me imasmiṃ buddhakāle parinibbānena, anāgate metteyyasammāsambuddhakāle parinibbāyissāmī’’ti visuddhasīlopi paṭipattiṃ na pūreti. Ime cattāropi puggalā tathā tathā ovaditvā āsavakkhaye patiṭṭhāpetabbā. Evaṃ hi tepi yvāyaṃ pañcamo puggalo nārabhati na vippaṭisārī āraddhavīriyo arahattaṃ pāpuṇāti, tena samasamāva bhavissantīti."
    ],
    "innerText": "Ārabhati na vippaṭisārī ca hotīti āpattiṃ āpajjati, taṃ pana desetuṃ sabhāgapuggalaṃ pariyesati, vuṭṭhāpeti vā, tasmā na vippaṭisārī hoti. Nārabhati vippaṭisārī ca hotīti āpattiṃ nāpajjati, vinayapaññattiyaṃ pana akovidattā anāpattiyā āpattisaññitāya vuṭṭhitāyapi taṃ āpattiyā vippaṭisāraṃ vinodetuṃ asakkuṇeyyatāya vippaṭisārī hoti. Nārabhati na vippaṭisārī hotīti nārabhati neva āpattiṃ āpajjati, na vippaṭisārī hoti. Arahattañca na pāpuṇāti. Kataro panesa puggaloti? Sīlavā ossaṭṭhavīriyo puggalo. So hi ‘‘kiṃ me imasmiṃ buddhakāle parinibbānena, anāgate metteyyasammāsambuddhakāle parinibbāyissāmī’’ti visuddhasīlopi paṭipattiṃ na pūreti. Ime cattāropi puggalā tathā tathā ovaditvā āsavakkhaye patiṭṭhāpetabbā. Evaṃ hi tepi yvāyaṃ pañcamo puggalo nārabhati na vippaṭisārī āraddhavīriyo arahattaṃ pāpuṇāti, tena samasamāva bhavissantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Chakkādīsu –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Cha puggalā"
      },
      " – atthekacco puggalo pubbe ananussutesu dhammesu sāmaṃ saccāni abhisambujjhati, tattha ca sabbaññutaṃ pāpuṇāti balesu ca vasībhāvaṃ. Atthekacco puggalo…pe… abhisambujjhati, na ca tattha sabbaññutaṃ ",
      " pāpuṇāti, na ca balesu vasibhāvaṃ. Atthekacco puggalo…pe… anabhisambujjhati, diṭṭheva dhamme dukkhassantakaro hoti, sāvakapāramiñca pāpuṇāti. Atthekacco puggalo…pe… dukkhassantakaro hoti, na ca sāvakapāramiṃ pāpuṇāti. Atthekacco puggalo…pe… anabhisambujjhati, na ca diṭṭheva dhamme dukkhassantakaro hoti, anāgāmī hoti anāgantā itthattaṃ. Atthekacco puggalo…pe… anabhisambujjhati, na ca diṭṭheva dhamme dukkhassantakaro hoti, āgāmī hoti āgantā itthatta’’nti –"
    ],
    "innerText": "‘‘Cha puggalā – atthekacco puggalo pubbe ananussutesu dhammesu sāmaṃ saccāni abhisambujjhati, tattha ca sabbaññutaṃ pāpuṇāti balesu ca vasībhāvaṃ. Atthekacco puggalo…pe… abhisambujjhati, na ca tattha sabbaññutaṃ pāpuṇāti, na ca balesu vasibhāvaṃ. Atthekacco puggalo…pe… anabhisambujjhati, diṭṭheva dhamme dukkhassantakaro hoti, sāvakapāramiñca pāpuṇāti. Atthekacco puggalo…pe… dukkhassantakaro hoti, na ca sāvakapāramiṃ pāpuṇāti. Atthekacco puggalo…pe… anabhisambujjhati, na ca diṭṭheva dhamme dukkhassantakaro hoti, anāgāmī hoti anāgantā itthattaṃ. Atthekacco puggalo…pe… anabhisambujjhati, na ca diṭṭheva dhamme dukkhassantakaro hoti, āgāmī hoti āgantā itthatta’’nti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Chakkaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘satta puggalā"
      },
      " – satta udakūpamā puggalā sakiṃ nimuggo nimuggova hoti, ummujjitvā nimujjati, ummujjitvā ṭhito hoti, ummujjitvā vipassati viloketi, ummujjitvā patarati, ummujjitvā paṭigādhappatto hoti, ummujjitvā tiṇṇo hoti pāraṅgato, thale tiṭṭhati brāhmaṇo’’tiādinā sattakaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘aṭṭha puggalā"
      },
      " – cattāro maggasamaṅgino, cattāro phalasamaṅgino puggalā’’ti aṭṭhakaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘nava puggalā"
      },
      " – sammāsambuddho paccekasambuddho ubhatobhāgavimutto paññāvimutto kāyasakkhī diṭṭhippatto saddhāvimutto dhammānusārī saddhānusārī’’ti navakaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dasa puggalā"
      },
      " – pañcannaṃ idha niṭṭhā, pañcannaṃ idha vihāya niṭṭhā’’ti dasakañca mātikaṃ nikkhipitvā pāḷiyaṃ niddeso kato. Tattha chakke paṭhamena padena sammāsambuddho daṭṭhabbo. So hi anācariyako attanā uppāditena sabbaññutaññāṇapadaṭṭhānena arahattamaggañāṇena sabbākārato saccāni abhisambujjhitvā sabbaññutaṃ pāpuṇi, dasañāṇabalesu ",
      " ca vasibhāvanti. Dutiyena pana paccekasambuddho daṭṭhabbo. Tatiyena aggasāvako, catutthena avasesā arahanto ",
      ", pañcamena anāgāmī, chaṭṭhena sotāpannasakadāgāmino daṭṭhabbā. Te hi ‘‘āgantā itthatta’’nti vuttāti."
    ],
    "innerText": "Chakkaṃ, ‘‘satta puggalā – satta udakūpamā puggalā sakiṃ nimuggo nimuggova hoti, ummujjitvā nimujjati, ummujjitvā ṭhito hoti, ummujjitvā vipassati viloketi, ummujjitvā patarati, ummujjitvā paṭigādhappatto hoti, ummujjitvā tiṇṇo hoti pāraṅgato, thale tiṭṭhati brāhmaṇo’’tiādinā sattakaṃ, ‘‘aṭṭha puggalā – cattāro maggasamaṅgino, cattāro phalasamaṅgino puggalā’’ti aṭṭhakaṃ, ‘‘nava puggalā – sammāsambuddho paccekasambuddho ubhatobhāgavimutto paññāvimutto kāyasakkhī diṭṭhippatto saddhāvimutto dhammānusārī saddhānusārī’’ti navakaṃ, ‘‘dasa puggalā – pañcannaṃ idha niṭṭhā, pañcannaṃ idha vihāya niṭṭhā’’ti dasakañca mātikaṃ nikkhipitvā pāḷiyaṃ niddeso kato. Tattha chakke paṭhamena padena sammāsambuddho daṭṭhabbo. So hi anācariyako attanā uppāditena sabbaññutaññāṇapadaṭṭhānena arahattamaggañāṇena sabbākārato saccāni abhisambujjhitvā sabbaññutaṃ pāpuṇi, dasañāṇabalesu ca vasibhāvanti. Dutiyena pana paccekasambuddho daṭṭhabbo. Tatiyena aggasāvako, catutthena avasesā arahanto , pañcamena anāgāmī, chaṭṭhena sotāpannasakadāgāmino daṭṭhabbā. Te hi ‘‘āgantā itthatta’’nti vuttāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sattake paṭhamena padena sāsane aniviṭṭhasaddho niyatamicchādiṭṭhidhammehi ekantakāḷakehi samannāgato gahito. So hi samudde udakabhīrukapuriso viya saṃsāre apāye nimuggo nimuggova hoti, na puna bhavato vuṭṭhāti, anantampi kālaṃ bhave eva vicarati sāsanasamāyogābhāvā. Dutiyena padena sāsane paṭiladdhasaddhopi devadattādayo viya saddhādiparihāniyaṃ ṭhito dussīlo gahito. So hi samudde kenaci kāraṇena ummujjitvā puna nimuggo viya sāsanasaddhāya ummujjitvāpi apāye nimujjati eva, ayaṃ pana cirakālātikkamena buddhādīhi, attanā eva vā paccekabodhiñāṇena bhavato uddharaṇīyo hoti sāsane sakiṃ uppannāyapi saddhāya mokkhabhāvena niyamena nibbānāvahattā. Ayameva hissa purimapuggalato viseso, itarathā tassa visuṃ gahaṇe payojanameva na siyāti gahetabbaṃ. Tatiyena sāsane uppannasaddho ṭhitibhāgiyehi sīlādiguṇehi samannāgato gahito. So hi ummujjitvā tīraṃ adisvāva samuddamajjhe nāvādiāgamanaṃ olokento puna animujjitvā uṇṇatappadese ṭhito viya sāsanasaddhāya ummujjitvā nibbānaṃ adisvāva buddhādiṃ olokayamāno sagge, sīlādimhi ṭhito hoti. Catutthena pana sotāpanno gahito. So hi ummujjitvā ṭhito tīraṃ disvā uttaraṇūpāyaṃ vilokayamāno viya lokuttarasaddhāya ummujjitvā nibbānatīraṃ disvā uttaraṇopāyaṃ viloketi. Pañcamena sakadāgāmī gahito. So hi samudde tīraṃ disvā tadabhimukhaṃ ",
      " pataramāno viya paṭhamamaggena nibbānatīraṃ disvā tadabhimukhaṃ dutiyamaggena patarati nāma. Chaṭṭhena anāgāmī gahito. So hi pataritvā tīraṃ upaggamma kaṭippamāṇe udake ṭhito viya arahattasamīpe satikavāṭapatitthe anāvattidhammatāya tatiyamaggena tiṭṭhati. Sattamena pana arahā gahito, so hi taritvā pāraṃ patvā ṭhitapuriso viya cattāro oghe taritvā nibbānatthale ṭhito khīṇāsavabrāhmaṇo nāma hotīti."
    ],
    "innerText": "Sattake paṭhamena padena sāsane aniviṭṭhasaddho niyatamicchādiṭṭhidhammehi ekantakāḷakehi samannāgato gahito. So hi samudde udakabhīrukapuriso viya saṃsāre apāye nimuggo nimuggova hoti, na puna bhavato vuṭṭhāti, anantampi kālaṃ bhave eva vicarati sāsanasamāyogābhāvā. Dutiyena padena sāsane paṭiladdhasaddhopi devadattādayo viya saddhādiparihāniyaṃ ṭhito dussīlo gahito. So hi samudde kenaci kāraṇena ummujjitvā puna nimuggo viya sāsanasaddhāya ummujjitvāpi apāye nimujjati eva, ayaṃ pana cirakālātikkamena buddhādīhi, attanā eva vā paccekabodhiñāṇena bhavato uddharaṇīyo hoti sāsane sakiṃ uppannāyapi saddhāya mokkhabhāvena niyamena nibbānāvahattā. Ayameva hissa purimapuggalato viseso, itarathā tassa visuṃ gahaṇe payojanameva na siyāti gahetabbaṃ. Tatiyena sāsane uppannasaddho ṭhitibhāgiyehi sīlādiguṇehi samannāgato gahito. So hi ummujjitvā tīraṃ adisvāva samuddamajjhe nāvādiāgamanaṃ olokento puna animujjitvā uṇṇatappadese ṭhito viya sāsanasaddhāya ummujjitvā nibbānaṃ adisvāva buddhādiṃ olokayamāno sagge, sīlādimhi ṭhito hoti. Catutthena pana sotāpanno gahito. So hi ummujjitvā ṭhito tīraṃ disvā uttaraṇūpāyaṃ vilokayamāno viya lokuttarasaddhāya ummujjitvā nibbānatīraṃ disvā uttaraṇopāyaṃ viloketi. Pañcamena sakadāgāmī gahito. So hi samudde tīraṃ disvā tadabhimukhaṃ pataramāno viya paṭhamamaggena nibbānatīraṃ disvā tadabhimukhaṃ dutiyamaggena patarati nāma. Chaṭṭhena anāgāmī gahito. So hi pataritvā tīraṃ upaggamma kaṭippamāṇe udake ṭhito viya arahattasamīpe satikavāṭapatitthe anāvattidhammatāya tatiyamaggena tiṭṭhati. Sattamena pana arahā gahito, so hi taritvā pāraṃ patvā ṭhitapuriso viya cattāro oghe taritvā nibbānatthale ṭhito khīṇāsavabrāhmaṇo nāma hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Navake ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ubhatobhāgavimutto"
      },
      "ti rūpārūpasamāpattiyā vikkhambhanavimokkhena, ariyamaggena samucchedavimokkhena kilesato vimutto, arūpasamāpattiyā vā rūpakāyato, maggena ca nāmakāyatoti imehi ubhatobhāgehi vimuttotipi ubhatobhāgavimutto, so catunnaṃ arūpasamāpattīnaṃ ",
      " ekekato vuṭṭhāya saṅkhāre sammasitvā arahattappattānaṃ catunnaṃ, nirodhā vuṭṭhāya arahattappattaanāgāmino ca vasena pañcavidho, tesu pacchimova nippariyāyato ubhatobhāgavimutto nāma, sesā pariyāyena. Ettha ca rūpāvacaracatutthajjhānaṃ kilesakāyato vimuttampi rūpakāyato avimuttaṃ, arūpāvacaraṃ pana tadabhayatopi vimuttaṃ, tasmā tadeva pādakaṃ katvā arahattappattova ubhatobhāgavimutto hoti, na rūpāvacaranti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāvimutto"
      },
      "ti arahattamaggapaññāya āsavehi vimutto. So hi sukkhavipassako, catūhi rūpāvacarajjhānehi vuṭṭhāya arahattappattā cattāro cāti pañcavidho. Arūpāvacarajjhānesu hi ekasmimpi sati ubhatobhāgavimuttova nāma hoti."
    ],
    "innerText": "Navake ubhatobhāgavimuttoti rūpārūpasamāpattiyā vikkhambhanavimokkhena, ariyamaggena samucchedavimokkhena kilesato vimutto, arūpasamāpattiyā vā rūpakāyato, maggena ca nāmakāyatoti imehi ubhatobhāgehi vimuttotipi ubhatobhāgavimutto, so catunnaṃ arūpasamāpattīnaṃ ekekato vuṭṭhāya saṅkhāre sammasitvā arahattappattānaṃ catunnaṃ, nirodhā vuṭṭhāya arahattappattaanāgāmino ca vasena pañcavidho, tesu pacchimova nippariyāyato ubhatobhāgavimutto nāma, sesā pariyāyena. Ettha ca rūpāvacaracatutthajjhānaṃ kilesakāyato vimuttampi rūpakāyato avimuttaṃ, arūpāvacaraṃ pana tadabhayatopi vimuttaṃ, tasmā tadeva pādakaṃ katvā arahattappattova ubhatobhāgavimutto hoti, na rūpāvacaranti veditabbaṃ. Paññāvimuttoti arahattamaggapaññāya āsavehi vimutto. So hi sukkhavipassako, catūhi rūpāvacarajjhānehi vuṭṭhāya arahattappattā cattāro cāti pañcavidho. Arūpāvacarajjhānesu hi ekasmimpi sati ubhatobhāgavimuttova nāma hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyasakkhī"
      },
      "ti rūpārūpajjhānalābhī ariyo. So hi sotāpattimaggaṭṭhavajjitānaṃ channaṃ sekhānaṃ vasena chabbidho. Teneva ",
      " hissa ‘‘ekacce āsavā parikkhīṇā’’ti niddese vuttaṃ. Sotāpattimaggaṭṭhassa ca na kecipi āsavā parikkhīṇāti vattabbā, parikkhīyissantīti pana vattabbā, arahato pana sabbepi āsavā parikkhīṇā, na ekacceti. So hi phuṭṭhantaṃ sacchikarotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyasakkhī,"
      },
      " phuṭṭhānaṃ paṭiladdhānaṃ jhānānaṃ anantaraṃ nāmakāyena nirodhaṃ sacchikarotītipi kāyasakkhī, kāyenāti cettha ‘‘nāmakāyena ceva paramatthasaccaṃ sacchikaroti, paññāya ca ativijjha passatī’’ti vacanato arahattaphalaṃ ṭhapetvā sesamaggaphalānametaṃ adhivacanaṃ, tena kāyena paṭhamajjhānānantaraṃ nibbānassa sacchikaraṇatopi kāyasakkhīti keci. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhippatto"
      },
      "ti sukkhavipassako, rūpajjhānalābhī ca yathāvutto chabbidho sekho ca, ayaṃ diṭṭhantappattoti diṭṭhippatto. Dassanaṃ diṭṭhi, paṭhamamaggo, tassa anantaraṃ nirodhappattoti attho. Diṭṭhappattotipi pāṭho, tassa paṭhamamaggena diṭṭhaṃ nibbānaṃ puna pattoti attho."
    ],
    "innerText": "Kāyasakkhīti rūpārūpajjhānalābhī ariyo. So hi sotāpattimaggaṭṭhavajjitānaṃ channaṃ sekhānaṃ vasena chabbidho. Teneva hissa ‘‘ekacce āsavā parikkhīṇā’’ti niddese vuttaṃ. Sotāpattimaggaṭṭhassa ca na kecipi āsavā parikkhīṇāti vattabbā, parikkhīyissantīti pana vattabbā, arahato pana sabbepi āsavā parikkhīṇā, na ekacceti. So hi phuṭṭhantaṃ sacchikarotīti kāyasakkhī, phuṭṭhānaṃ paṭiladdhānaṃ jhānānaṃ anantaraṃ nāmakāyena nirodhaṃ sacchikarotītipi kāyasakkhī, kāyenāti cettha ‘‘nāmakāyena ceva paramatthasaccaṃ sacchikaroti, paññāya ca ativijjha passatī’’ti vacanato arahattaphalaṃ ṭhapetvā sesamaggaphalānametaṃ adhivacanaṃ, tena kāyena paṭhamajjhānānantaraṃ nibbānassa sacchikaraṇatopi kāyasakkhīti keci. Diṭṭhippattoti sukkhavipassako, rūpajjhānalābhī ca yathāvutto chabbidho sekho ca, ayaṃ diṭṭhantappattoti diṭṭhippatto. Dassanaṃ diṭṭhi, paṭhamamaggo, tassa anantaraṃ nirodhappattoti attho. Diṭṭhappattotipi pāṭho, tassa paṭhamamaggena diṭṭhaṃ nibbānaṃ puna pattoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhāvimutto"
      },
      "ti sukkhavipassako, rūpajjhānalābhī ca yathāvutto chabbidho sekho ca. Ayaṃ hi saddahanto vimuttoti saddhāvimutto. Kathaṃ panetassa diṭṭhippattato nānattanti? Āgamanīyapaṭipadāya. Diṭṭhippatto hi paññāsampadāya pubbabhāge vipassanāya kilese appadukkhena vikkhambhento āgato, saddhāvimutto pana saddhābahulatāya kilese dukkhena vikkhambhento āgato. Etameva hi bhedaṃ sandhāya niddese ‘‘ekacce āsavā parikkhīṇā honti, no ca kho yathādiṭṭhippattassā’’ti vuttaṃ."
    ],
    "innerText": "Saddhāvimuttoti sukkhavipassako, rūpajjhānalābhī ca yathāvutto chabbidho sekho ca. Ayaṃ hi saddahanto vimuttoti saddhāvimutto. Kathaṃ panetassa diṭṭhippattato nānattanti? Āgamanīyapaṭipadāya. Diṭṭhippatto hi paññāsampadāya pubbabhāge vipassanāya kilese appadukkhena vikkhambhento āgato, saddhāvimutto pana saddhābahulatāya kilese dukkhena vikkhambhento āgato. Etameva hi bhedaṃ sandhāya niddese ‘‘ekacce āsavā parikkhīṇā honti, no ca kho yathādiṭṭhippattassā’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammānusārī"
      },
      "ti ",
      " yassa sotāpattimaggakkhaṇe paññindriyaṃ adhimattaṃ hoti, ayaṃ paññāsaṅkhātena dhammena sarati anussaratīti dhammānusārī, sotāpattimaggaṭṭhassetaṃ nāmaṃ. Phale pana patte diṭṭhippatto nāma hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhānusārī"
      },
      "ti yassa ",
      " sotāpattimaggakkhaṇe saddhindriyaṃ adhimattaṃ hoti, ayaṃ saddhāya sarati anussaratīti saddhānusārī, sotāpattimaggaṭṭhassetaṃ nāmaṃ. Phale pana patte saddhāvimutto nāma hoti."
    ],
    "innerText": "Dhammānusārīti yassa sotāpattimaggakkhaṇe paññindriyaṃ adhimattaṃ hoti, ayaṃ paññāsaṅkhātena dhammena sarati anussaratīti dhammānusārī, sotāpattimaggaṭṭhassetaṃ nāmaṃ. Phale pana patte diṭṭhippatto nāma hoti. Saddhānusārīti yassa sotāpattimaggakkhaṇe saddhindriyaṃ adhimattaṃ hoti, ayaṃ saddhāya sarati anussaratīti saddhānusārī, sotāpattimaggaṭṭhassetaṃ nāmaṃ. Phale pana patte saddhāvimutto nāma hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Lokuttaradhammaṃ hi nibbattentānaṃ dve dhurāni nāma, dve abhinivesā nāma, dve sīsāni nāma. Tattha saddhādhuraṃ paññādhuranti dve dhurāni nāma. Eko pana samathābhiniveso, eko vipassanābhinivesoti dve abhinivesā. Eko ca arahattaṃ matthakaṃ pāpuṇanto ubhatobhāgavimutto hoti, eko paññāvimuttoti imāni dve sīsāni nāma. Ye hi keci lokuttaraṃ dhammaṃ nibbattenti, sabbe te dve ime dhamme dhuraṃ katvā imesu dvīsu ṭhānesu abhinivisitvā imehi dvīhi ṭhānehi vimuccanti. Tesu yo bhikkhu aṭṭhasamāpattilābhī paññaṃ dhuraṃ katvā samathavasena abhiniviṭṭho aññataraṃ arūpasamāpattiṃ padaṭṭhānaṃ katvā vipassanaṃ paṭṭhapetvā arahattaṃ pāpuṇāti, ayaṃ sotāpattimaggakkhaṇe dhammānusārī nāma. Parato pana chasu ṭhānesu kāyasakkhī nāma. Arahattaphalaṃ patte ubhatobhāgavimutto nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Aparo paññameva dhuraṃ katvā vipassanāvasena abhiniviṭṭho suddhasaṅkhāre vā rūpāvacarajjhānesu vā aññataraṃ sammasitvā arahattaṃ pāpuṇāti, ayampi sotāpattimaggakkhaṇe dhammānusārī nāma. Parato pana chasu ṭhānesu diṭṭhippatto nāma, arahattaṃ patte paññāvimutto nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparo pana aṭṭhasamāpattilābhī saddhaṃ dhuraṃ katvā samādhivasena abhiniviṭṭho aññataraṃ arūpasamāpattiṃ padaṭṭhānaṃ katvā vipassanaṃ paṭṭhapetvā arahattaṃ pāpuṇāti, ayaṃ sotāpattimaggakkhaṇe saddhānusārī nāma, parato chasu ṭhānesu kāyasakkhīyeva ",
      " nāma. Arahattaṃ patte ubhatobhāgavimuttoyeva nāma. Aparo saddhameva dhuraṃ katvā vipassanāvasena abhiniviṭṭho suddhasaṅkhāre vā rūpāvacarajjhānesu vā aññataraṃ sammasitvā arahattaṃ pāpuṇāti, ayampi sotāpattimaggakkhaṇe saddhānusārī nāma, parato chasu ṭhānesu saddhāvimutto nāma. Arahattappatte paññāvimutto nāma. Ime satta puggalā sammāsambuddhapaccekasambuddhehi saddhiṃ nava loke aggadakkhiṇeyyā nāmāti."
    ],
    "innerText": "Aparo pana aṭṭhasamāpattilābhī saddhaṃ dhuraṃ katvā samādhivasena abhiniviṭṭho aññataraṃ arūpasamāpattiṃ padaṭṭhānaṃ katvā vipassanaṃ paṭṭhapetvā arahattaṃ pāpuṇāti, ayaṃ sotāpattimaggakkhaṇe saddhānusārī nāma, parato chasu ṭhānesu kāyasakkhīyeva nāma. Arahattaṃ patte ubhatobhāgavimuttoyeva nāma. Aparo saddhameva dhuraṃ katvā vipassanāvasena abhiniviṭṭho suddhasaṅkhāre vā rūpāvacarajjhānesu vā aññataraṃ sammasitvā arahattaṃ pāpuṇāti, ayampi sotāpattimaggakkhaṇe saddhānusārī nāma, parato chasu ṭhānesu saddhāvimutto nāma. Arahattappatte paññāvimutto nāma. Ime satta puggalā sammāsambuddhapaccekasambuddhehi saddhiṃ nava loke aggadakkhiṇeyyā nāmāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dasake ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcannaṃ idha niṭṭhā"
      },
      "ti sattakkhattuparamo, kolaṃkolo, ekabījī, sakadāgāmī kāmāvacarapaṭisandhiko, arahā cāti imesaṃ pañcannaṃ idha kāmāvacarabhūmiyaññeva anupādisesanibbānasaṅkhātā niṭṭhāti attho. Kāmāvacarattabhāve eva hi ete parinibbāyanti, nāññasmiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcannaṃ idha vihāya niṭṭhā"
      },
      "ti antarāparinibbāyī upahaccaparinibbāyī asaṅkhāraparinibbāyī sasaṅkhāraparinibbāyī uddhaṃsoto akaniṭṭhagāmī cāti imesaṃ pañcannaṃ idha kāmāvacare attabhāvaṃ vihāya vijahitvā brahmattabhāve ṭhitānaññeva niṭṭhāti attho. Sesamettha uttānatthamevāti. Ayamettha saṅkhepato pāḷinayena saddhiṃ atthanicchayo, vitthāro pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalapaññattipāḷiaṭṭhakathāsu"
      },
      " (pu. pa. mātikā 1 ādayo; pu. pa. aṭṭha. mātikāvaṇṇanā 1) gahetabboti."
    ],
    "innerText": "Dasake pañcannaṃ idha niṭṭhāti sattakkhattuparamo, kolaṃkolo, ekabījī, sakadāgāmī kāmāvacarapaṭisandhiko, arahā cāti imesaṃ pañcannaṃ idha kāmāvacarabhūmiyaññeva anupādisesanibbānasaṅkhātā niṭṭhāti attho. Kāmāvacarattabhāve eva hi ete parinibbāyanti, nāññasmiṃ. Pañcannaṃ idha vihāya niṭṭhāti antarāparinibbāyī upahaccaparinibbāyī asaṅkhāraparinibbāyī sasaṅkhāraparinibbāyī uddhaṃsoto akaniṭṭhagāmī cāti imesaṃ pañcannaṃ idha kāmāvacare attabhāvaṃ vihāya vijahitvā brahmattabhāve ṭhitānaññeva niṭṭhāti attho. Sesamettha uttānatthamevāti. Ayamettha saṅkhepato pāḷinayena saddhiṃ atthanicchayo, vitthāro pana puggalapaññattipāḷiaṭṭhakathāsu (pu. pa. mātikā 1 ādayo; pu. pa. aṭṭha. mātikāvaṇṇanā 1) gahetabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mohavicchedaniyā abhidhammamātikatthavaṇṇanāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Puggalapaññattimātikatthavaṇṇanā niṭṭhitā."
  }
]