[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "9. Dassanenapahātabbahetukattikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paṭiccavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paccayānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Vibhaṅgavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetupaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Dassanena ",
      " pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati hetupaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhā. (1)"
    ],
    "innerText": "1. Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati hetupaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – dassanena pahātabbahetuke khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti hetupaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhā…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – bhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhā. (1)"
    ],
    "innerText": "2. Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – bhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – bhāvanāya pahātabbahetuke khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ. (2)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – bhāvanāya pahātabbahetuke khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā ",
      " uppajjanti hetupaccayā – bhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe…pe…. (3)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti hetupaccayā – bhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā ",
      " cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe paṭicca dve khandhā cittasamuṭṭhānañca rūpaṃ; vicikicchāsahagataṃ uddhaccasahagataṃ mohaṃ paṭicca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā kaṭattā ca rūpaṃ…pe… dve khandhā…pe… khandhe paṭicca vatthu, vatthuṃ paṭicca khandhā; ekaṃ mahābhūtaṃ paṭicca…pe… mahābhūte paṭicca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. (1)"
    ],
    "innerText": "3. Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe paṭicca dve khandhā cittasamuṭṭhānañca rūpaṃ; vicikicchāsahagataṃ uddhaccasahagataṃ mohaṃ paṭicca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā kaṭattā ca rūpaṃ…pe… dve khandhā…pe… khandhe paṭicca vatthu, vatthuṃ paṭicca khandhā; ekaṃ mahābhūtaṃ paṭicca…pe… mahābhūte paṭicca cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati hetupaccayā – vicikicchāsahagataṃ mohaṃ paṭicca sampayuttakā khandhā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – uddhaccasahagataṃ mohaṃ paṭicca sampayuttakā khandhā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti hetupaccayā – vicikicchāsahagataṃ mohaṃ paṭicca sampayuttakā khandhā cittasamuṭṭhānañca rūpaṃ. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko ca nevadassanena ",
      " nabhāvanāya pahātabbahetuko ca dhammā uppajjanti hetupaccayā – uddhaccasahagataṃ mohaṃ paṭicca sampayuttakā khandhā cittasamuṭṭhānañca rūpaṃ. (5)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti hetupaccayā – uddhaccasahagataṃ mohaṃ paṭicca sampayuttakā khandhā cittasamuṭṭhānañca rūpaṃ. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Dassanena ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati hetupaccayā – vicikicchāsahagataṃ ekaṃ khandhañca mohañca paṭicca tayo khandhā…pe… dve khandhe ca mohañca paṭicca dve khandhā. (1)"
    ],
    "innerText": "4. Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati hetupaccayā – vicikicchāsahagataṃ ekaṃ khandhañca mohañca paṭicca tayo khandhā…pe… dve khandhe ca mohañca paṭicca dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – dassanena pahātabbahetuke khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagate khandhe ca mohañca paṭicca cittasamuṭṭhānaṃ rūpaṃ. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti hetupaccayā – vicikicchāsahagataṃ ekaṃ khandhañca mohañca paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe ca mohañca paṭicca dve khandhā…pe…. (3)"
    ],
    "innerText": "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti hetupaccayā – vicikicchāsahagataṃ ekaṃ khandhañca mohañca paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe ca mohañca paṭicca dve khandhā…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – uddhaccasahagataṃ ekaṃ khandhañca mohañca paṭicca tayo khandhā…pe… dve khandhe ca mohañca paṭicca dve khandhā. (1)"
    ],
    "innerText": "5. Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – uddhaccasahagataṃ ekaṃ khandhañca mohañca paṭicca tayo khandhā…pe… dve khandhe ca mohañca paṭicca dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca nevadassanena ",
      " nabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – bhāvanāya pahātabbahetuke khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ; uddhaccasahagate khandhe ca mohañca paṭicca cittasamuṭṭhānaṃ rūpaṃ. (2)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – bhāvanāya pahātabbahetuke khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ; uddhaccasahagate khandhe ca mohañca paṭicca cittasamuṭṭhānaṃ rūpaṃ. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti hetupaccayā – uddhaccasahagataṃ ekaṃ khandhañca mohañca paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ārammaṇapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". Dassanena ",
      " pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe paṭicca dve khandhā. (1)"
    ],
    "innerText": "6. Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe paṭicca dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – vicikicchāsahagate khandhe paṭicca vicikicchāsahagato moho. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti ārammaṇapaccayā – vicikicchāsahagataṃ ekaṃ khandhaṃ paṭicca tayo khandhā ca moho ca…pe… dve khandhe paṭicca dve khandhā ca moho ca. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā… tīṇi. (Dassanena sadisaṃ vibhajitabbaṃ.)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā… tīṇi. (Dassanena sadisaṃ vibhajitabbaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". Nevadassanena ",
      " nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe paṭicca dve khandhā. Paṭisandhikkhaṇe…pe… vatthuṃ paṭicca khandhā. (1)"
    ],
    "innerText": "7. Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe paṭicca dve khandhā. Paṭisandhikkhaṇe…pe… vatthuṃ paṭicca khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – vicikicchāsahagataṃ mohaṃ paṭicca sampayuttakā khandhā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – uddhaccasahagataṃ mohaṃ paṭicca sampayuttakā khandhā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ". Dassanena ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – vicikicchāsahagataṃ ekaṃ khandhañca mohañca paṭicca tayo khandhā…pe… dve khandhe ca mohañca paṭicca dve khandhā. (1)"
    ],
    "innerText": "8. Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – vicikicchāsahagataṃ ekaṃ khandhañca mohañca paṭicca tayo khandhā…pe… dve khandhe ca mohañca paṭicca dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – uddhaccasahagataṃ ekaṃ khandhañca mohañca paṭicca tayo khandhā…pe… dve khandhe ca mohañca paṭicca dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Adhipatipaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ". Dassanena ",
      " pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati adhipatipaccayā… tīṇi (hetusadisā)."
    ],
    "innerText": "9. Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati adhipatipaccayā… tīṇi (hetusadisā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca…pe… tīṇi (hetusadisā, adhipatiyā moho natthi)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati adhipatipaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhā. Ekaṃ mahābhūtaṃ paṭicca tayo mahābhūtā…pe… mahābhūte paṭicca cittasamuṭṭhānaṃ rūpaṃ upādārūpaṃ. (1)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati adhipatipaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhā. Ekaṃ mahābhūtaṃ paṭicca tayo mahābhūtā…pe… mahābhūte paṭicca cittasamuṭṭhānaṃ rūpaṃ upādārūpaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ". Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati adhipatipaccayā – dassanena pahātabbahetuke khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ. (1)"
    ],
    "innerText": "10. Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati adhipatipaccayā – dassanena pahātabbahetuke khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca nevadassanena ",
      " nabhāvanāya pahātabbahetuko dhammo uppajjati adhipatipaccayā – bhāvanāya pahātabbahetuke khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ. (1)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati adhipatipaccayā – bhāvanāya pahātabbahetuke khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Anantara-samanantarapaccayā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati anantarapaccayā. Samanantarapaccayā (ārammaṇasadisaṃ)."
    ],
    "innerText": "11. Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati anantarapaccayā. Samanantarapaccayā (ārammaṇasadisaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sahajātapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati sahajātapaccayā – dassanena pahātabbahetukaṃ ",
      " ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe paṭicca dve khandhā. (1)"
    ],
    "innerText": "12. Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati sahajātapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe paṭicca dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati sahajātapaccayā – dassanena pahātabbahetuke khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagate khandhe paṭicca moho cittasamuṭṭhānañca rūpaṃ. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti sahajātapaccayā ",
      " – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe paṭicca dve khandhā cittasamuṭṭhānañca rūpaṃ; vicikicchāsahagataṃ ekaṃ khandhaṃ paṭicca tayo khandhā moho ca cittasamuṭṭhānañca rūpaṃ…pe…. (3)"
    ],
    "innerText": "Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti sahajātapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe paṭicca dve khandhā cittasamuṭṭhānañca rūpaṃ; vicikicchāsahagataṃ ekaṃ khandhaṃ paṭicca tayo khandhā moho ca cittasamuṭṭhānañca rūpaṃ…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati sahajātapaccayā – bhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe paṭicca dve khandhā. (1)"
    ],
    "innerText": "13. Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati sahajātapaccayā – bhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe paṭicca dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati ",
      " sahajātapaccayā – bhāvanāya pahātabbahetuke khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ; uddhaccasahagate khandhe paṭicca moho ca cittasamuṭṭhānañca rūpaṃ. (2)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati sahajātapaccayā – bhāvanāya pahātabbahetuke khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ; uddhaccasahagate khandhe paṭicca moho ca cittasamuṭṭhānañca rūpaṃ. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti sahajātapaccayā ",
      " – bhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe paṭicca dve khandhā cittasamuṭṭhānañca rūpaṃ; uddhaccasahagataṃ ekaṃ khandhaṃ paṭicca tayo khandhā moho ca cittasamuṭṭhānañca rūpaṃ…pe…. (3)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti sahajātapaccayā – bhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe paṭicca dve khandhā cittasamuṭṭhānañca rūpaṃ; uddhaccasahagataṃ ekaṃ khandhaṃ paṭicca tayo khandhā moho ca cittasamuṭṭhānañca rūpaṃ…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati sahajātapaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe…pe… vicikicchāsahagataṃ uddhaccasahagataṃ mohaṃ paṭicca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe…pe… khandhe paṭicca vatthu, vatthuṃ paṭicca khandhā; ekaṃ mahābhūtaṃ paṭicca tayo mahābhūtā…pe… bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ ekaṃ…pe…. (1)"
    ],
    "innerText": "14. Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati sahajātapaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe…pe… vicikicchāsahagataṃ uddhaccasahagataṃ mohaṃ paṭicca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe…pe… khandhe paṭicca vatthu, vatthuṃ paṭicca khandhā; ekaṃ mahābhūtaṃ paṭicca tayo mahābhūtā…pe… bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ ekaṃ…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati sahajātapaccayā – vicikicchāsahagataṃ mohaṃ paṭicca sampayuttakā khandhā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati sahajātapaccayā (saṃkhittaṃ. Hetusadisaṃ kātabbaṃ). (3)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati sahajātapaccayā (saṃkhittaṃ. Hetusadisaṃ kātabbaṃ). (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Aññamaññapaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati aññamaññapaccayā, nissayapaccayā, upanissayapaccayā, purejātapaccayā, āsevanapaccayā, kammapaccayā, vipākapaccayā, āhārapaccayā, indriyapaccayā, jhānapaccayā, maggapaccayā, sampayuttapaccayā ",
      ", vippayuttapaccayā, atthipaccayā, natthipaccayā, vigatapaccayā, avigatapaccayā."
    ],
    "innerText": "15. Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati aññamaññapaccayā, nissayapaccayā, upanissayapaccayā, purejātapaccayā, āsevanapaccayā, kammapaccayā, vipākapaccayā, āhārapaccayā, indriyapaccayā, jhānapaccayā, maggapaccayā, sampayuttapaccayā , vippayuttapaccayā, atthipaccayā, natthipaccayā, vigatapaccayā, avigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paccayānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Saṅkhyāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Suddhaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". Hetuyā sattarasa, ārammaṇe ekādasa, adhipatiyā nava, anantare ekādasa, samanantare ekādasa, sahajāte sattarasa, aññamaññe ekādasa, nissaye sattarasa, upanissaye ekādasa, purejāte ekādasa, āsevane ekādasa, kamme sattarasa, vipāke ekaṃ, āhāre sattarasa, indriye sattarasa, jhāne sattarasa, magge sattarasa, sampayutte ekādasa, vippayutte sattarasa, atthiyā sattarasa, natthiyā ekādasa, vigate ekādasa, avigate sattarasa (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "16. Hetuyā sattarasa, ārammaṇe ekādasa, adhipatiyā nava, anantare ekādasa, samanantare ekādasa, sahajāte sattarasa, aññamaññe ekādasa, nissaye sattarasa, upanissaye ekādasa, purejāte ekādasa, āsevane ekādasa, kamme sattarasa, vipāke ekaṃ, āhāre sattarasa, indriye sattarasa, jhāne sattarasa, magge sattarasa, sampayutte ekādasa, vippayutte sattarasa, atthiyā sattarasa, natthiyā ekādasa, vigate ekādasa, avigate sattarasa (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anulomaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Paccayapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Vibhaṅgavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nahetupaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – vicikicchāsahagate khandhe paṭicca vicikicchāsahagato moho. (1)"
    ],
    "innerText": "17. Dassanena pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – vicikicchāsahagate khandhe paṭicca vicikicchāsahagato moho. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – uddhaccasahagate khandhe paṭicca uddhaccasahagato moho. (1)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – uddhaccasahagate khandhe paṭicca uddhaccasahagato moho. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – ahetukaṃ nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ ",
      " paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhā; ahetukapaṭisandhikkhaṇe…pe… khandhe paṭicca vatthu, vatthuṃ paṭicca khandhā; ekaṃ mahābhūtaṃ paṭicca…pe… bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ…pe…. (1)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – ahetukaṃ nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhā; ahetukapaṭisandhikkhaṇe…pe… khandhe paṭicca vatthu, vatthuṃ paṭicca khandhā; ekaṃ mahābhūtaṃ paṭicca…pe… bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Naārammaṇapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naārammaṇapaccayā – dassanena pahātabbahetuke khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ. (1)"
    ],
    "innerText": "18. Dassanena pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naārammaṇapaccayā – dassanena pahātabbahetuke khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naārammaṇapaccayā – bhāvanāya pahātabbahetuke khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naārammaṇapaccayā – nevadassanena nabhāvanāya pahātabbahetuke khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagataṃ uddhaccasahagataṃ mohaṃ paṭicca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe nevadassanena nabhāvanāya pahātabbahetuke khandhe paṭicca kaṭattārūpaṃ, khandhe paṭicca vatthu…pe… ekaṃ mahābhūtaṃ…pe… asaññasattānaṃ…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ". Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko ",
      " dhammo uppajjati naārammaṇapaccayā – dassanena ",
      " pahātabbahetuke khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagate khandhe ca mohañca paṭicca cittasamuṭṭhānaṃ rūpaṃ. (1)"
    ],
    "innerText": "19. Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naārammaṇapaccayā – dassanena pahātabbahetuke khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagate khandhe ca mohañca paṭicca cittasamuṭṭhānaṃ rūpaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naārammaṇapaccayā – bhāvanāya pahātabbahetuke khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ; uddhaccasahagate khandhe ca mohañca paṭicca cittasamuṭṭhānaṃ rūpaṃ. (1)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naārammaṇapaccayā – bhāvanāya pahātabbahetuke khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ; uddhaccasahagate khandhe ca mohañca paṭicca cittasamuṭṭhānaṃ rūpaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Naadhipatipaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naadhipatipaccayā… (sahajātasadisaṃ) naanantarapaccayā… nasamanantarapaccayā… naaññamaññapaccayā… naupanissayapaccayā."
    ],
    "innerText": "20. Dassanena pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naadhipatipaccayā… (sahajātasadisaṃ) naanantarapaccayā… nasamanantarapaccayā… naaññamaññapaccayā… naupanissayapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Napurejātapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati napurejātapaccayā – arūpe dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca…pe…. (1)"
    ],
    "innerText": "21. Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati napurejātapaccayā – arūpe dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati napurejātapaccayā – arūpe vicikicchāsahagate khandhe paṭicca vicikicchāsahagato moho; dassanena pahātabbahetuke khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā ",
      " uppajjanti napurejātapaccayā – arūpe vicikicchāsahagataṃ ekaṃ khandhaṃ paṭicca tayo khandhā moho ca…pe… dve khandhe…pe…. (3)"
    ],
    "innerText": "Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti napurejātapaccayā – arūpe vicikicchāsahagataṃ ekaṃ khandhaṃ paṭicca tayo khandhā moho ca…pe… dve khandhe…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ… tīṇi (dassanena sadisaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". Nevadassanena ",
      " nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati napurejātapaccayā – arūpe nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhā, nevadassanena nabhāvanāya pahātabbahetuke khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagataṃ uddhaccasahagataṃ ",
      " mohaṃ paṭicca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe…pe… asaññasattānaṃ…pe…. (1)"
    ],
    "innerText": "22. Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati napurejātapaccayā – arūpe nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhā, nevadassanena nabhāvanāya pahātabbahetuke khandhe paṭicca cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagataṃ uddhaccasahagataṃ mohaṃ paṭicca cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe…pe… asaññasattānaṃ…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati napurejātapaccayā – arūpe vicikicchāsahagataṃ mohaṃ paṭicca sampayuttakā khandhā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati napurejātapaccayā – arūpe uddhaccasahagataṃ mohaṃ paṭicca sampayuttakā khandhā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati napurejātapaccayā – arūpe vicikicchāsahagataṃ ekaṃ khandhañca mohañca paṭicca tayo khandhā…pe…. (1)"
    ],
    "innerText": "23. Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati napurejātapaccayā – arūpe vicikicchāsahagataṃ ekaṃ khandhañca mohañca paṭicca tayo khandhā…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca ",
      " nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati napurejātapaccayā – dassanena pahātabbahetuke khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagate khandhe ca mohañca paṭicca cittasamuṭṭhānaṃ rūpaṃ. (2)"
    ],
    "innerText": "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati napurejātapaccayā – dassanena pahātabbahetuke khandhe ca mahābhūte ca paṭicca cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagate khandhe ca mohañca paṭicca cittasamuṭṭhānaṃ rūpaṃ. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati napurejātapaccayā (imepi dve kātabbā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Napacchājātapaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ". Dassanena ",
      " pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati napacchājātapaccayā… naāsevanapaccayā."
    ],
    "innerText": "24. Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati napacchājātapaccayā… naāsevanapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nakammapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati nakammapaccayā – dassanena pahātabbahetuke khandhe paṭicca dassanena pahātabbahetukā cetanā. (1)"
    ],
    "innerText": "25. Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati nakammapaccayā – dassanena pahātabbahetuke khandhe paṭicca dassanena pahātabbahetukā cetanā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati nakammapaccayā – bhāvanāya pahātabbahetuke khandhe paṭicca bhāvanāya pahātabbahetukā cetanā. (1)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati nakammapaccayā – bhāvanāya pahātabbahetuke khandhe paṭicca bhāvanāya pahātabbahetukā cetanā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nakammapaccayā – nevadassanena nabhāvanāya pahātabbahetuke khandhe paṭicca nevadassanena nabhāvanāya pahātabbahetukā cetanā; bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati nakammapaccayā – vicikicchāsahagataṃ mohaṃ paṭicca sampayuttakā cetanā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya ",
      " pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati nakammapaccayā – uddhaccasahagataṃ mohaṃ paṭicca sampayuttakā cetanā. (3)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati nakammapaccayā – uddhaccasahagataṃ mohaṃ paṭicca sampayuttakā cetanā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati nakammapaccayā – vicikicchāsahagate khandhe ca mohañca paṭicca sampayuttakā cetanā. (1)"
    ],
    "innerText": "26. Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati nakammapaccayā – vicikicchāsahagate khandhe ca mohañca paṭicca sampayuttakā cetanā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati nakammapaccayā – uddhaccasahagate khandhe ca mohañca paṭicca sampayuttakā cetanā. (1)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati nakammapaccayā – uddhaccasahagate khandhe ca mohañca paṭicca sampayuttakā cetanā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Navipākapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati navipākapaccayā (paṭisandhi natthi)."
    ],
    "innerText": "27. Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati navipākapaccayā (paṭisandhi natthi)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Naāhārapaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      ". Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naāhārapaccayā – bāhiraṃ… utusamuṭṭhānaṃ… asaññasattānaṃ…pe… naindriyapaccayā – bāhiraṃ… āhārasamuṭṭhānaṃ… ",
      " utusamuṭṭhānaṃ, asaññasattānaṃ…pe… mahābhūte paṭicca rūpajīvitindriyaṃ… najhānapaccayā – pañcaviññāṇaṃ…pe… (mahābhūtā kātabbā) namaggapaccayā – ahetukaṃ nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ…pe… asaññasattānaṃ…pe… nasampayuttapaccayā."
    ],
    "innerText": "28. Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naāhārapaccayā – bāhiraṃ… utusamuṭṭhānaṃ… asaññasattānaṃ…pe… naindriyapaccayā – bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ, asaññasattānaṃ…pe… mahābhūte paṭicca rūpajīvitindriyaṃ… najhānapaccayā – pañcaviññāṇaṃ…pe… (mahābhūtā kātabbā) namaggapaccayā – ahetukaṃ nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ…pe… asaññasattānaṃ…pe… nasampayuttapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Navippayuttapaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "29"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko ",
      " dhammo uppajjati navippayuttapaccayā – arūpe dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe…. (1)"
    ],
    "innerText": "29. Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati navippayuttapaccayā – arūpe dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati navippayuttapaccayā – arūpe vicikicchāsahagate khandhe paṭicca vicikicchāsahagato moho. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko ca nevadassanena nabhāvanāya ",
      " pahātabbahetuko ca dhammā uppajjanti navippayuttapaccayā – arūpe vicikicchāsahagataṃ ekaṃ khandhaṃ paṭicca tayo khandhā moho ca…pe… dve khandhe…pe…. (3)"
    ],
    "innerText": "Dassanena pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti navippayuttapaccayā – arūpe vicikicchāsahagataṃ ekaṃ khandhaṃ paṭicca tayo khandhā moho ca…pe… dve khandhe…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati navippayuttapaccayā – arūpe bhāvanāya… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ". Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati navippayuttapaccayā – arūpe nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe paṭicca dve khandhā; bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ…pe…. (1)"
    ],
    "innerText": "30. Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati navippayuttapaccayā – arūpe nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paṭicca tayo khandhā…pe… dve khandhe paṭicca dve khandhā; bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati navippayuttapaccayā – arūpe vicikicchāsahagataṃ mohaṃ paṭicca sampayuttakā khandhā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetukaṃ ",
      " dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati navippayuttapaccayā – arūpe uddhaccasahagataṃ mohaṃ paṭicca sampayuttakā khandhā. (3)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati navippayuttapaccayā – arūpe uddhaccasahagataṃ mohaṃ paṭicca sampayuttakā khandhā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ". Dassanena ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati navippayuttapaccayā – arūpe vicikicchāsahagataṃ ekaṃ khandhañca mohañca paṭicca tayo khandhā…pe… dve khandhā. (1)"
    ],
    "innerText": "31. Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca dassanena pahātabbahetuko dhammo uppajjati navippayuttapaccayā – arūpe vicikicchāsahagataṃ ekaṃ khandhañca mohañca paṭicca tayo khandhā…pe… dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paṭicca bhāvanāya pahātabbahetuko dhammo uppajjati navippayuttapaccayā – arūpe uddhaccasahagataṃ ekaṃ khandhañca mohañca paṭicca tayo khandhā…pe… dve khandhā… nonatthipaccayā… novigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Paccayapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Saṅkhyāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Suddhaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "32"
      },
      ". Nahetuyā ",
      " tīṇi, naārammaṇe pañca, naadhipatiyā sattarasa, naanantare pañca, nasamanantare pañca, naaññamaññe pañca, naupanissaye pañca, napurejāte terasa, napacchājāte sattarasa, naāsevane sattarasa, nakamme satta, navipāke sattarasa, naāhāre ekaṃ, naindriye ekaṃ, najhāne ekaṃ, namagge ekaṃ, nasampayutte pañca, navippayutte ekādasa, nonatthiyā pañca, novigate pañca (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "32. Nahetuyā tīṇi, naārammaṇe pañca, naadhipatiyā sattarasa, naanantare pañca, nasamanantare pañca, naaññamaññe pañca, naupanissaye pañca, napurejāte terasa, napacchājāte sattarasa, naāsevane sattarasa, nakamme satta, navipāke sattarasa, naāhāre ekaṃ, naindriye ekaṃ, najhāne ekaṃ, namagge ekaṃ, nasampayutte pañca, navippayutte ekādasa, nonatthiyā pañca, novigate pañca (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccanīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Paccayānulomapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "33"
      },
      ". Hetupaccayā ",
      " naārammaṇe pañca, naadhipatiyā sattarasa, naanantare pañca, nasamanantare pañca, naaññamaññe pañca, naupanissaye pañca, napurejāte terasa, napacchājāte sattarasa, naāsevane sattarasa, nakamme satta, navipāke sattarasa, nasampayutte pañca, navippayutte ekādasa, nonatthiyā pañca, novigate pañca (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "33. Hetupaccayā naārammaṇe pañca, naadhipatiyā sattarasa, naanantare pañca, nasamanantare pañca, naaññamaññe pañca, naupanissaye pañca, napurejāte terasa, napacchājāte sattarasa, naāsevane sattarasa, nakamme satta, navipāke sattarasa, nasampayutte pañca, navippayutte ekādasa, nonatthiyā pañca, novigate pañca (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anulomapaccanīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4. Paccayapaccanīyānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "34"
      },
      ". Nahetupaccayā ",
      " ārammaṇe tīṇi, anantare tīṇi, samanantare tīṇi, sahajāte tīṇi, aññamaññe tīṇi, nissaye tīṇi, upanissaye tīṇi, purejāte tīṇi, āsevane tīṇi, kamme tīṇi, vipāke ekaṃ, āhāre tīṇi, indriye tīṇi, jhāne tīṇi, magge dve, sampayutte ",
      " tīṇi, vippayutte tīṇi, atthiyā tīṇi, natthiyā tīṇi, vigate tīṇi, avigate tīṇi (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "34. Nahetupaccayā ārammaṇe tīṇi, anantare tīṇi, samanantare tīṇi, sahajāte tīṇi, aññamaññe tīṇi, nissaye tīṇi, upanissaye tīṇi, purejāte tīṇi, āsevane tīṇi, kamme tīṇi, vipāke ekaṃ, āhāre tīṇi, indriye tīṇi, jhāne tīṇi, magge dve, sampayutte tīṇi, vippayutte tīṇi, atthiyā tīṇi, natthiyā tīṇi, vigate tīṇi, avigate tīṇi (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccanīyānulomaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭiccavāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Sahajātavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "(Sahajātavāro paṭiccavārasadiso.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Paccayavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paccayānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Vibhaṅgavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetupaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati hetupaccayā… tīṇi (paṭiccavārasadisaṃ)."
    ],
    "innerText": "35. Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati hetupaccayā… tīṇi (paṭiccavārasadisaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paccayā… tīṇi (paṭiccavārasadisaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya… ekaṃ (paṭiccavārasadisaṃ). Vatthuṃ paccayā nevadassanena nabhāvanāya pahātabbahetukā khandhā. (1)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya… ekaṃ (paṭiccavārasadisaṃ). Vatthuṃ paccayā nevadassanena nabhāvanāya pahātabbahetukā khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati hetupaccayā – vatthuṃ paccayā dassanena pahātabbahetukā khandhā; vicikicchāsahagataṃ mohaṃ paccayā sampayuttakā khandhā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – vatthuṃ paccayā bhāvanāya pahātabbahetukā ",
      " khandhā; uddhaccasahagataṃ mohaṃ paccayā sampayuttakā khandhā. (3)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – vatthuṃ paccayā bhāvanāya pahātabbahetukā khandhā; uddhaccasahagataṃ mohaṃ paccayā sampayuttakā khandhā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti hetupaccayā – vatthuṃ paccayā dassanena pahātabbahetukā khandhā; mahābhūte paccayā cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagataṃ mohaṃ paccayā sampayuttakā khandhā cittasamuṭṭhānañca rūpaṃ. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti hetupaccayā – vatthuṃ paccayā bhāvanāya pahātabbahetukā khandhā; mahābhūte paccayā cittasamuṭṭhānaṃ rūpaṃ; uddhaccasahagataṃ mohaṃ paccayā sampayuttakā khandhā cittasamuṭṭhānañca rūpaṃ. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ". Dassanena ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati hetupaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve khandhe ca…pe… vicikicchāsahagataṃ ekaṃ khandhañca mohañca paccayā tayo khandhā…pe… dve khandhe ca mohañca paccayā dve khandhā. (1)"
    ],
    "innerText": "36. Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati hetupaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve khandhe ca…pe… vicikicchāsahagataṃ ekaṃ khandhañca mohañca paccayā tayo khandhā…pe… dve khandhe ca mohañca paccayā dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – dassanena pahātabbahetuke khandhe ca mahābhūte ca paccayā cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagate khandhe ca mohañca paccayā cittasamuṭṭhānaṃ rūpaṃ. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti hetupaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve ",
      " khandhe ca vatthuñca paccayā dve khandhā; dassanena pahātabbahetuke khandhe ca mahābhūte ca paccayā cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagataṃ ekaṃ khandhañca mohañca paccayā tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe…. (3)"
    ],
    "innerText": "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti hetupaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve khandhe ca vatthuñca paccayā dve khandhā; dassanena pahātabbahetuke khandhe ca mahābhūte ca paccayā cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagataṃ ekaṃ khandhañca mohañca paccayā tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā… tīṇi."
    ],
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ārammaṇapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ". Dassanena ",
      " pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati ārammaṇapaccayā… tīṇi (paṭiccavāre ārammaṇasadisā)."
    ],
    "innerText": "37. Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati ārammaṇapaccayā… tīṇi (paṭiccavāre ārammaṇasadisā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paccayā… tīṇi (paṭiccavārasadisā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "38"
      },
      ". Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paccayā tayo khandhā…pe… dve khandhā. Paṭisandhikkhaṇe…pe… vatthuṃ paccayā khandhā. Cakkhāyatanaṃ paccayā cakkhuviññāṇaṃ…pe… kāyāyatanaṃ paccayā kāyaviññāṇaṃ; vatthuṃ paccayā nevadassanena nabhāvanāya pahātabbahetukā khandhā. (1)"
    ],
    "innerText": "38. Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paccayā tayo khandhā…pe… dve khandhā. Paṭisandhikkhaṇe…pe… vatthuṃ paccayā khandhā. Cakkhāyatanaṃ paccayā cakkhuviññāṇaṃ…pe… kāyāyatanaṃ paccayā kāyaviññāṇaṃ; vatthuṃ paccayā nevadassanena nabhāvanāya pahātabbahetukā khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – vatthuṃ paccayā dassanena pahātabbahetukā khandhā; vicikicchāsahagataṃ mohaṃ paccayā sampayuttakā khandhā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – vatthuṃ paccayā bhāvanāya pahātabbahetukā khandhā; uddhaccasahagataṃ mohaṃ paccayā sampayuttakā khandhā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti ārammaṇapaccayā – vatthuṃ paccayā vicikicchāsahagatā khandhā ca moho ca. (4)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti ārammaṇapaccayā – vatthuṃ paccayā vicikicchāsahagatā khandhā ca moho ca. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko ca ",
      " nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti ārammaṇapaccayā – vatthuṃ paccayā uddhaccasahagatā khandhā ca moho ca. (5)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti ārammaṇapaccayā – vatthuṃ paccayā uddhaccasahagatā khandhā ca moho ca. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "39"
      },
      ". Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve khandhā; vicikicchāsahagataṃ ekaṃ khandhañca mohañca paccayā tayo khandhā…pe… dve khandhe ca mohañca paccayā dve khandhā. (1)"
    ],
    "innerText": "39. Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve khandhā; vicikicchāsahagataṃ ekaṃ khandhañca mohañca paccayā tayo khandhā…pe… dve khandhe ca mohañca paccayā dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – vicikicchāsahagate khandhe ca vatthuñca paccayā vicikicchāsahagato moho. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti ārammaṇapaccayā – vicikicchāsahagataṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā moho ca…pe… dve khandhe ca vatthuñca…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ". Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – bhāvanāya pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve khandhā; uddhaccasahagataṃ ",
      " ekaṃ khandhañca mohañca paccayā tayo khandhā…pe… dve khandhā. (1)"
    ],
    "innerText": "40. Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – bhāvanāya pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve khandhā; uddhaccasahagataṃ ekaṃ khandhañca mohañca paccayā tayo khandhā…pe… dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – uddhaccasahagate khandhe ca vatthuñca paccayā uddhaccasahagato moho. (2)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – uddhaccasahagate khandhe ca vatthuñca paccayā uddhaccasahagato moho. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya ",
      " pahātabbahetuko ca dhammā uppajjanti ārammaṇapaccayā – uddhaccasahagataṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā moho ca…pe… dve khandhe ca…pe…. (3)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti ārammaṇapaccayā – uddhaccasahagataṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā moho ca…pe… dve khandhe ca…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Adhipatipaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati adhipatipaccayā… tīṇi."
    ],
    "innerText": "41. Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati adhipatipaccayā… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paccayā… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati adhipatipaccayā – ekaṃ…pe… vatthuṃ paccayā nevadassanena nabhāvanāya pahātabbahetukā khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati adhipatipaccayā – vatthuṃ paccayā dassanena pahātabbahetukā khandhā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati adhipatipaccayā – vatthuṃ paccayā bhāvanāya pahātabbahetukā khandhā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko ",
      " ca nevadassanena ",
      " nabhāvanāya pahātabbahetuko ca dhammā uppajjanti adhipatipaccayā – vatthuṃ paccayā dassanena pahātabbahetukā khandhā; mahābhūte paccayā cittasamuṭṭhānaṃ rūpaṃ. (4)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti adhipatipaccayā – vatthuṃ paccayā dassanena pahātabbahetukā khandhā; mahābhūte paccayā cittasamuṭṭhānaṃ rūpaṃ. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti adhipatipaccayā – vatthuṃ paccayā bhāvanāya pahātabbahetukā khandhā; mahābhūte paccayā cittasamuṭṭhānaṃ rūpaṃ. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42"
      },
      ". Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati adhipatipaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve khandhe ca…pe…. (1)"
    ],
    "innerText": "42. Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati adhipatipaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve khandhe ca…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati adhipatipaccayā – dassanena pahātabbahetuke khandhe ca mahābhūte ca paccayā cittasamuṭṭhānaṃ rūpaṃ. (2)"
    ],
    "innerText": "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati adhipatipaccayā – dassanena pahātabbahetuke khandhe ca mahābhūte ca paccayā cittasamuṭṭhānaṃ rūpaṃ. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti adhipatipaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve khandhe ca…pe… dassanena pahātabbahetuke khandhe ca mahābhūte ca paccayā cittasamuṭṭhānaṃ rūpaṃ. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati adhipatipaccayā – bhāvanāya pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… tīṇi… (dassanena sadisā) anantarapaccayā… samanantarapaccayā."
    ],
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati adhipatipaccayā – bhāvanāya pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… tīṇi… (dassanena sadisā) anantarapaccayā… samanantarapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sahajātapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "43"
      },
      ". Dassanena ",
      " pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati sahajātapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paccayā tayo khandhā…pe…. (1)"
    ],
    "innerText": "43. Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati sahajātapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paccayā tayo khandhā…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati sahajātapaccayā – dassanena pahātabbahetuke khandhe paccayā cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagate khandhe paccayā vicikicchāsahagato moho cittasamuṭṭhānañca rūpaṃ. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti sahajātapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paccayā tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… vicikicchāsahagataṃ ekaṃ khandhaṃ paccayā tayo khandhā moho ca cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetukaṃ dhammaṃ paccayā… tīṇi (saṃkhittaṃ. Dassanena sadisā )."
    ],
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paccayā… tīṇi (saṃkhittaṃ. Dassanena sadisā )."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44"
      },
      ". Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati sahajātapaccayā ",
      " – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paccayā tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… vicikicchāsahagataṃ uddhaccasahagataṃ mohaṃ paccayā cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe…pe… khandhe paccayā vatthu, vatthuṃ paccayā khandhā; ekaṃ mahābhūtaṃ paccayā tayo mahābhūtā…pe… asaññasattānaṃ…pe… cakkhāyatanaṃ paccayā cakkhuviññāṇaṃ…pe… kāyāyatanaṃ paccayā kāyaviññāṇaṃ; vatthuṃ paccayā nevadassanena nabhāvanāya pahātabbahetukā khandhā. (1)"
    ],
    "innerText": "44. Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati sahajātapaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paccayā tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… vicikicchāsahagataṃ uddhaccasahagataṃ mohaṃ paccayā cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe…pe… khandhe paccayā vatthu, vatthuṃ paccayā khandhā; ekaṃ mahābhūtaṃ paccayā tayo mahābhūtā…pe… asaññasattānaṃ…pe… cakkhāyatanaṃ paccayā cakkhuviññāṇaṃ…pe… kāyāyatanaṃ paccayā kāyaviññāṇaṃ; vatthuṃ paccayā nevadassanena nabhāvanāya pahātabbahetukā khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati sahajātapaccayā – vatthuṃ paccayā dassanena pahātabbahetukā khandhā; vicikicchāsahagataṃ mohaṃ paccayā sampayuttakā khandhā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati sahajātapaccayā – vatthuṃ paccayā bhāvanāya pahātabbahetukā khandhā; uddhaccasahagataṃ mohaṃ paccayā sampayuttakā khandhā. (3)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati sahajātapaccayā – vatthuṃ paccayā bhāvanāya pahātabbahetukā khandhā; uddhaccasahagataṃ mohaṃ paccayā sampayuttakā khandhā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti sahajātapaccayā – vatthuṃ paccayā dassanena pahātabbahetukā khandhā; mahābhūte paccayā cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagataṃ mohaṃ paccayā sampayuttakā khandhā cittasamuṭṭhānañca rūpaṃ; vatthuṃ paccayā vicikicchāsahagatā khandhā ca moho ca. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti sahajātapaccayā – vatthuṃ ",
      " paccayā bhāvanāya pahātabbahetukā khandhā; mahābhūte paccayā cittasamuṭṭhānaṃ rūpaṃ; uddhaccasahagataṃ mohaṃ ",
      " paccayā sampayuttakā khandhā cittasamuṭṭhānañca rūpaṃ; vatthuṃ paccayā uddhaccasahagatā khandhā ca moho ca. (5)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti sahajātapaccayā – vatthuṃ paccayā bhāvanāya pahātabbahetukā khandhā; mahābhūte paccayā cittasamuṭṭhānaṃ rūpaṃ; uddhaccasahagataṃ mohaṃ paccayā sampayuttakā khandhā cittasamuṭṭhānañca rūpaṃ; vatthuṃ paccayā uddhaccasahagatā khandhā ca moho ca. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "45"
      },
      ". Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati sahajātapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… vicikicchāsahagataṃ ekaṃ khandhañca mohañca paccayā tayo khandhā…pe…. (1)"
    ],
    "innerText": "45. Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati sahajātapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… vicikicchāsahagataṃ ekaṃ khandhañca mohañca paccayā tayo khandhā…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati sahajātapaccayā – dassanena pahātabbahetuke khandhe ca mahābhūte ca paccayā cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagate khandhe ca mohañca paccayā cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagate khandhe ca vatthuñca paccayā vicikicchāsahagato moho. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena ",
      " pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti sahajātapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve khandhe…pe… dassanena pahātabbahetuke khandhe ca mahābhūte ca paccayā cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagataṃ ekaṃ khandhañca mohañca paccayā tayo khandhā; cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe…pe… vicikicchāsahagataṃ ekaṃ khandhañca ",
      " vatthuñca paccayā tayo khandhā moho ca…pe… dve khandhe ca vatthuñca paccayā dve khandhā moho ca. (3)"
    ],
    "innerText": "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti sahajātapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve khandhe…pe… dassanena pahātabbahetuke khandhe ca mahābhūte ca paccayā cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagataṃ ekaṃ khandhañca mohañca paccayā tayo khandhā; cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe…pe… vicikicchāsahagataṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā moho ca…pe… dve khandhe ca vatthuñca paccayā dve khandhā moho ca. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati sahajātapaccayā… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Aññamaññapaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "46"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati aññamaññapaccayā… nissayapaccayā… upanissayapaccayā… purejātapaccayā… āsevanapaccayā… kammapaccayā… vipākapaccayā… āhārapaccayā… indriyapaccayā… jhānapaccayā… maggapaccayā… sampayuttapaccayā."
    ],
    "innerText": "46. Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati aññamaññapaccayā… nissayapaccayā… upanissayapaccayā… purejātapaccayā… āsevanapaccayā… kammapaccayā… vipākapaccayā… āhārapaccayā… indriyapaccayā… jhānapaccayā… maggapaccayā… sampayuttapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Vippayuttapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "47"
      },
      ". Dassanena ",
      " pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati vippayuttapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paccayā tayo khandhā…pe… dve khandhā, khandhā vatthuṃ vippayuttapaccayā. (1)"
    ],
    "innerText": "47. Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati vippayuttapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paccayā tayo khandhā…pe… dve khandhā, khandhā vatthuṃ vippayuttapaccayā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati vippayuttapaccayā – dassanena pahātabbahetuke khandhe paccayā cittasamuṭṭhānaṃ rūpaṃ, khandhe vippayuttapaccayā. Vicikicchāsahagate khandhe paccayā moho cittasamuṭṭhānañca rūpaṃ, moho vatthuṃ vippayuttapaccayā. Cittasamuṭṭhānaṃ rūpaṃ khandhe vippayuttapaccayā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena pahātabbahetukaṃ dhammaṃ paccayā ",
      " dassanena pahātabbahetuko ca nevadassanena nabhāvanāya ",
      " pahātabbahetuko ca dhammā uppajjanti vippayuttapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paccayā tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe…pe… khandhā vatthuṃ vippayuttapaccayā. Cittasamuṭṭhānaṃ rūpaṃ khandhe vippayuttapaccayā. Vicikicchāsahagataṃ ekaṃ khandhaṃ paccayā tayo khandhā moho ca cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe…pe… khandhā ca moho ca vatthuṃ vippayuttapaccayā. Cittasamuṭṭhānaṃ rūpaṃ khandhe vippayuttapaccayā. (3)"
    ],
    "innerText": "Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti vippayuttapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ paccayā tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe…pe… khandhā vatthuṃ vippayuttapaccayā. Cittasamuṭṭhānaṃ rūpaṃ khandhe vippayuttapaccayā. Vicikicchāsahagataṃ ekaṃ khandhaṃ paccayā tayo khandhā moho ca cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe…pe… khandhā ca moho ca vatthuṃ vippayuttapaccayā. Cittasamuṭṭhānaṃ rūpaṃ khandhe vippayuttapaccayā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati vippayuttapaccayā… tīṇi (dassanena sadisā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "48"
      },
      ". Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati vippayuttapaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paccayā tayo khandhā cittasamuṭṭhānañca rūpaṃ… dve khandhe…pe… khandhā vatthuṃ vippayuttapaccayā. Cittasamuṭṭhānaṃ rūpaṃ khandhe vippayuttapaccayā. Vicikicchāsahagataṃ uddhaccasahagataṃ mohaṃ paccayā cittasamuṭṭhānaṃ rūpaṃ, mohaṃ vippayuttapaccayā. Paṭisandhikkhaṇe…pe… khandhe paccayā vatthu, vatthuṃ paccayā khandhā. Khandhā vatthuṃ vippayuttapaccayā. Vatthu khandhe vippayuttapaccayā. Ekaṃ mahābhūtaṃ paccayā tayo mahābhūtā…pe… mahābhūte paccayā cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ ",
      ", khandhe vippayuttapaccayā. Cakkhāyatanaṃ paccayā cakkhuviññāṇaṃ…pe… kāyāyatanaṃ paccayā kāyaviññāṇaṃ; vatthuṃ paccayā nevadassanena nabhāvanāya pahātabbahetukā khandhā. (1)"
    ],
    "innerText": "48. Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati vippayuttapaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paccayā tayo khandhā cittasamuṭṭhānañca rūpaṃ… dve khandhe…pe… khandhā vatthuṃ vippayuttapaccayā. Cittasamuṭṭhānaṃ rūpaṃ khandhe vippayuttapaccayā. Vicikicchāsahagataṃ uddhaccasahagataṃ mohaṃ paccayā cittasamuṭṭhānaṃ rūpaṃ, mohaṃ vippayuttapaccayā. Paṭisandhikkhaṇe…pe… khandhe paccayā vatthu, vatthuṃ paccayā khandhā. Khandhā vatthuṃ vippayuttapaccayā. Vatthu khandhe vippayuttapaccayā. Ekaṃ mahābhūtaṃ paccayā tayo mahābhūtā…pe… mahābhūte paccayā cittasamuṭṭhānaṃ rūpaṃ kaṭattārūpaṃ upādārūpaṃ , khandhe vippayuttapaccayā. Cakkhāyatanaṃ paccayā cakkhuviññāṇaṃ…pe… kāyāyatanaṃ paccayā kāyaviññāṇaṃ; vatthuṃ paccayā nevadassanena nabhāvanāya pahātabbahetukā khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo ",
      " uppajjati vippayuttapaccayā – vatthuṃ paccayā dassanena pahātabbahetukā khandhā, vatthuṃ vippayuttapaccayā. Vicikicchāsahagataṃ mohaṃ paccayā sampayuttakā khandhā, vatthuṃ vippayuttapaccayā. (2)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati vippayuttapaccayā – vatthuṃ paccayā dassanena pahātabbahetukā khandhā, vatthuṃ vippayuttapaccayā. Vicikicchāsahagataṃ mohaṃ paccayā sampayuttakā khandhā, vatthuṃ vippayuttapaccayā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati vippayuttapaccayā – vatthuṃ paccayā bhāvanāya pahātabbahetukā khandhā, vatthuṃ vippayuttapaccayā ",
      ". Uddhaccasahagataṃ mohaṃ paccayā sampayuttakā khandhā, vatthuṃ vippayuttapaccayā. (3)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati vippayuttapaccayā – vatthuṃ paccayā bhāvanāya pahātabbahetukā khandhā, vatthuṃ vippayuttapaccayā . Uddhaccasahagataṃ mohaṃ paccayā sampayuttakā khandhā, vatthuṃ vippayuttapaccayā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti vippayuttapaccayā – vatthuṃ paccayā dassanena pahātabbahetukā khandhā; mahābhūte paccayā cittasamuṭṭhānaṃ rūpaṃ, khandhā vatthuṃ vippayuttapaccayā. Cittasamuṭṭhānaṃ rūpaṃ, khandhe vippayuttapaccayā. Vicikicchāsahagataṃ mohaṃ paccayā sampayuttakā khandhā cittasamuṭṭhānañca rūpaṃ, khandhā vatthuṃ vippayuttapaccayā. Cittasamuṭṭhānaṃ rūpaṃ mohaṃ vippayuttapaccayā. Vatthuṃ paccayā vicikicchāsahagatā khandhā ca moho ca, vatthuṃ vippayuttapaccayā. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti vippayuttapaccayā – vatthuṃ paccayā bhāvanāya pahātabbahetukā khandhā…pe… (dassanena sadisaṃ). (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "49"
      },
      ". Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati vippayuttapaccayā – dassanena ",
      " pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve khandhe…pe… vatthuṃ vippayuttapaccayā. Vicikicchāsahagataṃ ekaṃ khandhañca mohañca paccayā tayo khandhā…pe… dve khandhe…pe… vatthuṃ vippayuttapaccayā. (1)"
    ],
    "innerText": "49. Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati vippayuttapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve khandhe…pe… vatthuṃ vippayuttapaccayā. Vicikicchāsahagataṃ ekaṃ khandhañca mohañca paccayā tayo khandhā…pe… dve khandhe…pe… vatthuṃ vippayuttapaccayā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati vippayuttapaccayā – dassanena pahātabbahetuke khandhe ca mahābhūte ca paccayā cittasamuṭṭhānaṃ rūpaṃ, khandhe vippayuttapaccayā. Vicikicchāsahagate khandhe ca mohañca paccayā cittasamuṭṭhānaṃ rūpaṃ, khandhe ca mohañca vippayuttapaccayā. Vicikicchāsahagate khandhe ca vatthuñca paccayā vicikicchāsahagato moho, vatthuṃ vippayuttapaccayā. (2)"
    ],
    "innerText": "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati vippayuttapaccayā – dassanena pahātabbahetuke khandhe ca mahābhūte ca paccayā cittasamuṭṭhānaṃ rūpaṃ, khandhe vippayuttapaccayā. Vicikicchāsahagate khandhe ca mohañca paccayā cittasamuṭṭhānaṃ rūpaṃ, khandhe ca mohañca vippayuttapaccayā. Vicikicchāsahagate khandhe ca vatthuñca paccayā vicikicchāsahagato moho, vatthuṃ vippayuttapaccayā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti vippayuttapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve khandhe…pe… dassanena pahātabbahetuke khandhe ca mahābhūte ca paccayā cittasamuṭṭhānaṃ rūpaṃ, khandhā vatthuṃ vippayuttapaccayā. Cittasamuṭṭhānaṃ rūpaṃ khandhe vippayuttapaccayā. Vicikicchāsahagataṃ ekaṃ khandhañca mohañca paccayā tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe ca…pe… khandhā vatthuṃ vippayuttapaccayā. Cittasamuṭṭhānaṃ rūpaṃ, khandhe ca mohañca vippayuttapaccayā. Vicikicchāsahagataṃ ekaṃ khandhañca vatthuñca ",
      " paccayā tayo khandhā moho ca…pe… dve khandhe ca…pe… vatthuṃ vippayuttapaccayā. (3)"
    ],
    "innerText": "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti vippayuttapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā…pe… dve khandhe…pe… dassanena pahātabbahetuke khandhe ca mahābhūte ca paccayā cittasamuṭṭhānaṃ rūpaṃ, khandhā vatthuṃ vippayuttapaccayā. Cittasamuṭṭhānaṃ rūpaṃ khandhe vippayuttapaccayā. Vicikicchāsahagataṃ ekaṃ khandhañca mohañca paccayā tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… dve khandhe ca…pe… khandhā vatthuṃ vippayuttapaccayā. Cittasamuṭṭhānaṃ rūpaṃ, khandhe ca mohañca vippayuttapaccayā. Vicikicchāsahagataṃ ekaṃ khandhañca vatthuñca paccayā tayo khandhā moho ca…pe… dve khandhe ca…pe… vatthuṃ vippayuttapaccayā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukañca…pe… tīṇi (dassanena sadisā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Atthipaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati atthipaccayā… natthipaccayā… vigatapaccayā… avigatapaccayā."
    ],
    "innerText": "50. Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati atthipaccayā… natthipaccayā… vigatapaccayā… avigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paccayānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Saṅkhyāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Suddhaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "51"
      },
      ". Hetuyā sattarasa, ārammaṇe sattarasa, adhipatiyā sattarasa, anantare sattarasa, samanantare sattarasa, sahajāte sattarasa, aññamaññe sattārasa nissaye sattarasa, upanissaye sattarasa, purejāte ",
      " sattarasa, āsevane sattarasa, kamme sattarasa, vipāke ekaṃ, āhāre sattarasa, indriye sattarasa, jhāne sattarasa, magge sattarasa, sampayutte sattarasa, vippayutte sattarasa, atthiyā sattarasa, natthiyā sattarasa, vigate sattarasa, avigate sattarasa (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "51. Hetuyā sattarasa, ārammaṇe sattarasa, adhipatiyā sattarasa, anantare sattarasa, samanantare sattarasa, sahajāte sattarasa, aññamaññe sattārasa nissaye sattarasa, upanissaye sattarasa, purejāte sattarasa, āsevane sattarasa, kamme sattarasa, vipāke ekaṃ, āhāre sattarasa, indriye sattarasa, jhāne sattarasa, magge sattarasa, sampayutte sattarasa, vippayutte sattarasa, atthiyā sattarasa, natthiyā sattarasa, vigate sattarasa, avigate sattarasa (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anulomaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Paccayapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Vibhaṅgavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nahetupaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "52"
      },
      ". Dassanena ",
      " pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – vicikicchāsahagate khandhe paccayā vicikicchāsahagato moho. (1)"
    ],
    "innerText": "52. Dassanena pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – vicikicchāsahagate khandhe paccayā vicikicchāsahagato moho. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – uddhaccasahagate khandhe paccayā uddhaccasahagato moho. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā nevadassanena ",
      " nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – ahetukaṃ nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paccayā tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… ahetukapaṭisandhikkhaṇe (paripuṇṇaṃ) cakkhāyatanaṃ paccayā cakkhuviññāṇaṃ…pe… kāyāyatanaṃ paccayā kāyaviññāṇaṃ; vatthuṃ paccayā ahetukā nevadassanena nabhāvanāya pahātabbahetukā khandhā; vatthuṃ paccayā vicikicchāsahagato uddhaccasahagato moho. (1)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – ahetukaṃ nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ paccayā tayo khandhā cittasamuṭṭhānañca rūpaṃ…pe… ahetukapaṭisandhikkhaṇe (paripuṇṇaṃ) cakkhāyatanaṃ paccayā cakkhuviññāṇaṃ…pe… kāyāyatanaṃ paccayā kāyaviññāṇaṃ; vatthuṃ paccayā ahetukā nevadassanena nabhāvanāya pahātabbahetukā khandhā; vatthuṃ paccayā vicikicchāsahagato uddhaccasahagato moho. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "53"
      },
      ". Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – vicikicchāsahagate khandhe ca vatthuñca paccayā vicikicchāsahagato moho. (1)"
    ],
    "innerText": "53. Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – vicikicchāsahagate khandhe ca vatthuñca paccayā vicikicchāsahagato moho. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo ",
      " uppajjati nahetupaccayā – uddhaccasahagate khandhe ca vatthuñca paccayā uddhaccasahagato moho. (1)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – uddhaccasahagate khandhe ca vatthuñca paccayā uddhaccasahagato moho. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Naārammaṇapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "54"
      },
      ". Dassanena ",
      " pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naārammaṇapaccayā – dassanena pahātabbahetuke khandhe paccayā cittasamuṭṭhānaṃ rūpaṃ. (1)"
    ],
    "innerText": "54. Dassanena pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naārammaṇapaccayā – dassanena pahātabbahetuke khandhe paccayā cittasamuṭṭhānaṃ rūpaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naārammaṇapaccayā – bhāvanāya pahātabbahetuke khandhe paccayā cittasamuṭṭhānaṃ ",
      " rūpaṃ. (1)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naārammaṇapaccayā – bhāvanāya pahātabbahetuke khandhe paccayā cittasamuṭṭhānaṃ rūpaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naārammaṇapaccayā – nevadassanena nabhāvanāya pahātabbahetuke khandhe paccayā cittasamuṭṭhānaṃ rūpaṃ. Paṭisandhikkhaṇe nevadassanena nabhāvanāya pahātabbahetuke khandhe paccayā kaṭattārūpaṃ; khandhe paccayā vatthu…pe… ekaṃ mahābhūtaṃ…pe… bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "55"
      },
      ". Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naārammaṇapaccayā – dassanena pahātabbahetuke khandhe ca mahābhūte ca paccayā cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagate khandhe ca mohañca paccayā cittasamuṭṭhānaṃ rūpaṃ. (1)"
    ],
    "innerText": "55. Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naārammaṇapaccayā – dassanena pahātabbahetuke khandhe ca mahābhūte ca paccayā cittasamuṭṭhānaṃ rūpaṃ; vicikicchāsahagate khandhe ca mohañca paccayā cittasamuṭṭhānaṃ rūpaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati naārammaṇapaccayā – bhāvanāya pahātabbahetuke khandhe ca mahābhūte ca paccayā cittasamuṭṭhānaṃ rūpaṃ; uddhaccasahagate khandhe ca mohañca paccayā cittasamuṭṭhānaṃ rūpaṃ. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Naadhipatipaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "56"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati naadhipatipaccayā ",
      " (sahajātasadisaṃ)… naanantarapaccayā ",
      "… nasamanantarapaccayā… naaññamaññapaccayā… naupanissayapaccayā… ",
      " napurejātapaccayā (paṭiccavāre paccanīyasadisaṃ, terasa pañhā. Ninnānaṃ)… napacchājātapaccayā… naāsevanapaccayā."
    ],
    "innerText": "56. Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati naadhipatipaccayā (sahajātasadisaṃ)… naanantarapaccayā … nasamanantarapaccayā… naaññamaññapaccayā… naupanissayapaccayā… napurejātapaccayā (paṭiccavāre paccanīyasadisaṃ, terasa pañhā. Ninnānaṃ)… napacchājātapaccayā… naāsevanapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nakammapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "57"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati nakammapaccayā – dassanena pahātabbahetuke khandhe paccayā dassanena pahātabbahetukā cetanā. (1)"
    ],
    "innerText": "57. Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati nakammapaccayā – dassanena pahātabbahetuke khandhe paccayā dassanena pahātabbahetukā cetanā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati nakammapaccayā – bhāvanāya pahātabbahetuke khandhe paccayā bhāvanāya pahātabbahetukā cetanā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nakammapaccayā – nevadassanena nabhāvanāya pahātabbahetuke khandhe paccayā nevadassanena nabhāvanāya pahātabbahetukā cetanā; bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ…pe… vatthuṃ paccayā nevadassanena nabhāvanāya pahātabbahetukā cetanā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati nakammapaccayā – vatthuṃ paccayā dassanena pahātabbahetukā cetanā; vicikicchāsahagataṃ mohaṃ paccayā sampayuttakā cetanā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati nakammapaccayā – vatthuṃ paccayā bhāvanāya pahātabbahetukā cetanā; uddhaccasahagataṃ mohaṃ paccayā sampayuttakā cetanā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "58"
      },
      ". Dassanena ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati nakammapaccayā – dassanena pahātabbahetuke khandhe ",
      " ca vatthuñca paccayā dassanena pahātabbahetukā cetanā; vicikicchāsahagate khandhe ca mohañca paccayā sampayuttakā cetanā. (1)"
    ],
    "innerText": "58. Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati nakammapaccayā – dassanena pahātabbahetuke khandhe ca vatthuñca paccayā dassanena pahātabbahetukā cetanā; vicikicchāsahagate khandhe ca mohañca paccayā sampayuttakā cetanā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati nakammapaccayā – bhāvanāya pahātabbahetuke khandhe ca vatthuñca paccayā bhāvanāya pahātabbahetukā cetanā; uddhaccasahagate khandhe ca mohañca paccayā sampayuttakā cetanā. (1)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ paccayā bhāvanāya pahātabbahetuko dhammo uppajjati nakammapaccayā – bhāvanāya pahātabbahetuke khandhe ca vatthuñca paccayā bhāvanāya pahātabbahetukā cetanā; uddhaccasahagate khandhe ca mohañca paccayā sampayuttakā cetanā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Navipākapaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "59"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati navipākapaccayā (paripuṇṇaṃ, paṭisandhi natthi), naāhārapaccayā – bāhiraṃ… utusamuṭṭhānaṃ… asaññasattānaṃ…pe… naindriyapaccayā – bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ…pe… mahābhūte paccayā rūpajīvitindriyaṃ… najhānapaccayā – pañcaviññāṇasahagataṃ ekaṃ khandhaṃ…pe… bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ…pe… namaggapaccayā – ahetukaṃ ekaṃ…pe… nasampayuttapaccayā… navippayuttapaccayā… (paṭiccavārapaccanīye navippayuttasadisaṃ, ninnānaṃ. Ekādasa). Nonatthipaccayā… novigatapaccayā."
    ],
    "innerText": "59. Dassanena pahātabbahetukaṃ dhammaṃ paccayā dassanena pahātabbahetuko dhammo uppajjati navipākapaccayā (paripuṇṇaṃ, paṭisandhi natthi), naāhārapaccayā – bāhiraṃ… utusamuṭṭhānaṃ… asaññasattānaṃ…pe… naindriyapaccayā – bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ…pe… mahābhūte paccayā rūpajīvitindriyaṃ… najhānapaccayā – pañcaviññāṇasahagataṃ ekaṃ khandhaṃ…pe… bāhiraṃ… āhārasamuṭṭhānaṃ… utusamuṭṭhānaṃ… asaññasattānaṃ…pe… namaggapaccayā – ahetukaṃ ekaṃ…pe… nasampayuttapaccayā… navippayuttapaccayā… (paṭiccavārapaccanīye navippayuttasadisaṃ, ninnānaṃ. Ekādasa). Nonatthipaccayā… novigatapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Paccayapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Saṅkhyāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "60"
      },
      ". Nahetuyā ",
      " pañca, naārammaṇe pañca, naadhipatiyā sattarasa, naanantare pañca, nasamanantare pañca, naaññamaññe pañca, naupanissaye pañca, napurejāte terasa, napacchājāte sattarasa, naāsevane sattarasa, nakamme satta, navipāke sattarasa, naāhāre ekaṃ, naindriye ekaṃ, najhāne ekaṃ, namagge ekaṃ, nasampayutte pañca, navippayutte ekādasa, nonatthiyā pañca, novigate pañca (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "60. Nahetuyā pañca, naārammaṇe pañca, naadhipatiyā sattarasa, naanantare pañca, nasamanantare pañca, naaññamaññe pañca, naupanissaye pañca, napurejāte terasa, napacchājāte sattarasa, naāsevane sattarasa, nakamme satta, navipāke sattarasa, naāhāre ekaṃ, naindriye ekaṃ, najhāne ekaṃ, namagge ekaṃ, nasampayutte pañca, navippayutte ekādasa, nonatthiyā pañca, novigate pañca (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccanīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Paccayānulomapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "61"
      },
      ". Hetupaccayā ",
      " naārammaṇe pañca, naadhipatiyā sattarasa, naanantare pañca, nasamanantare pañca, naaññamaññe pañca, naupanissaye pañca, napurejāte ",
      " terasa, napacchājāte sattarasa, naāsevane sattarasa, nakamme satta, navipāke sattarasa, nasampayutte pañca, navippayutte ekādasa, nonatthiyā pañca, novigate pañca ( evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "61. Hetupaccayā naārammaṇe pañca, naadhipatiyā sattarasa, naanantare pañca, nasamanantare pañca, naaññamaññe pañca, naupanissaye pañca, napurejāte terasa, napacchājāte sattarasa, naāsevane sattarasa, nakamme satta, navipāke sattarasa, nasampayutte pañca, navippayutte ekādasa, nonatthiyā pañca, novigate pañca ( evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anulomapaccanīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4. Paccayapaccanīyānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nahetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "62"
      },
      ". Nahetupaccayā ārammaṇe pañca, anantare pañca, samanantare pañca, sahajāte pañca, aññamaññe pañca, nissaye pañca, upanissaye pañca, purejāte pañca, āsevane pañca, kamme pañca, vipāke ekaṃ, āhāre pañca, indriye pañca, jhāne pañca, magge pañca, sampayutte pañca, vippayutte pañca, atthiyā pañca, natthiyā ",
      " pañca, vigate pañca, avigate pañca (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "62. Nahetupaccayā ārammaṇe pañca, anantare pañca, samanantare pañca, sahajāte pañca, aññamaññe pañca, nissaye pañca, upanissaye pañca, purejāte pañca, āsevane pañca, kamme pañca, vipāke ekaṃ, āhāre pañca, indriye pañca, jhāne pañca, magge pañca, sampayutte pañca, vippayutte pañca, atthiyā pañca, natthiyā pañca, vigate pañca, avigate pañca (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccanīyānulomaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccayavāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4. Nissayavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "(Nissayavāro paccayavārasadiso.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "5. Saṃsaṭṭhavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paccayānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Vibhaṅgavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetupaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "63"
      },
      ". Dassanena ",
      " pahātabbahetukaṃ dhammaṃ saṃsaṭṭho dassanena pahātabbahetuko dhammo uppajjati hetupaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ saṃsaṭṭhā tayo khandhā…pe… dve khandhe saṃsaṭṭhā dve khandhā. (1)"
    ],
    "innerText": "63. Dassanena pahātabbahetukaṃ dhammaṃ saṃsaṭṭho dassanena pahātabbahetuko dhammo uppajjati hetupaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ saṃsaṭṭhā tayo khandhā…pe… dve khandhe saṃsaṭṭhā dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho bhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – bhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ saṃsaṭṭhā tayo khandhā…pe… dve khandhe saṃsaṭṭhā dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ saṃsaṭṭhā tayo khandhā…pe… paṭisandhikkhaṇe…pe…. (1)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ saṃsaṭṭhā tayo khandhā…pe… paṭisandhikkhaṇe…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho dassanena pahātabbahetuko dhammo uppajjati hetupaccayā – vicikicchāsahagataṃ mohaṃ saṃsaṭṭhā sampayuttakā khandhā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho bhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – uddhaccasahagataṃ mohaṃ saṃsaṭṭhā sampayuttakā khandhā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "64"
      },
      ". Dassanena ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ saṃsaṭṭho dassanena pahātabbahetuko dhammo uppajjati hetupaccayā – vicikicchāsahagataṃ ekaṃ khandhañca mohañca saṃsaṭṭhā tayo khandhā…pe… dve khandhā. (1)"
    ],
    "innerText": "64. Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ saṃsaṭṭho dassanena pahātabbahetuko dhammo uppajjati hetupaccayā – vicikicchāsahagataṃ ekaṃ khandhañca mohañca saṃsaṭṭhā tayo khandhā…pe… dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ bhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – uddhaccasahagataṃ ekaṃ khandhañca mohañca saṃsaṭṭhā tayo khandhā…pe… dve khandhā. (1)"
    ],
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ bhāvanāya pahātabbahetuko dhammo uppajjati hetupaccayā – uddhaccasahagataṃ ekaṃ khandhañca mohañca saṃsaṭṭhā tayo khandhā…pe… dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ārammaṇapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "65"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ saṃsaṭṭho dassanena pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ saṃsaṭṭhā tayo khandhā…pe… dve khandhā. (1)"
    ],
    "innerText": "65. Dassanena pahātabbahetukaṃ dhammaṃ saṃsaṭṭho dassanena pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ saṃsaṭṭhā tayo khandhā…pe… dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukaṃ dhammaṃ saṃsaṭṭho nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – vicikicchāsahagate khandhe saṃsaṭṭho vicikicchāsahagato moho. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukaṃ dhammaṃ saṃsaṭṭho dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā uppajjanti ārammaṇapaccayā – vicikicchāsahagataṃ ekaṃ khandhaṃ saṃsaṭṭhā tayo khandhā moho ca…pe… dve khandhe…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetukaṃ dhammaṃ saṃsaṭṭho… tīṇi."
    ],
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "66"
      },
      ". Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – nevadassanena nabhāvanāya ",
      " pahātabbahetukaṃ ekaṃ khandhaṃ saṃsaṭṭhā tayo khandhā…pe… dve khandhe saṃsaṭṭhā dve khandhā. Paṭisandhikkhaṇe…pe…. (1)"
    ],
    "innerText": "66. Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ saṃsaṭṭhā tayo khandhā…pe… dve khandhe saṃsaṭṭhā dve khandhā. Paṭisandhikkhaṇe…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho dassanena pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – vicikicchāsahagataṃ mohaṃ saṃsaṭṭhā sampayuttakā khandhā. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho bhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – uddhaccasahagataṃ mohaṃ saṃsaṭṭhā sampayuttakā khandhā. (3)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho bhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – uddhaccasahagataṃ mohaṃ saṃsaṭṭhā sampayuttakā khandhā. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ saṃsaṭṭho dassanena pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – vicikicchāsahagataṃ ekaṃ khandhañca mohañca saṃsaṭṭhā tayo khandhā…pe… dve khandhe ca mohañca saṃsaṭṭhā dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukañca nevadassanena nabhāvanāya pahātabbahetukañca dhammaṃ saṃsaṭṭho bhāvanāya pahātabbahetuko dhammo uppajjati ārammaṇapaccayā – uddhaccasahagataṃ ekaṃ khandhañca mohañca saṃsaṭṭhā tayo khandhā…pe… dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Adhipatipaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "67"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ saṃsaṭṭho dassanena pahātabbahetuko dhammo uppajjati adhipatipaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ saṃsaṭṭhā tayo khandhā…pe… dve khandhā. (1)"
    ],
    "innerText": "67. Dassanena pahātabbahetukaṃ dhammaṃ saṃsaṭṭho dassanena pahātabbahetuko dhammo uppajjati adhipatipaccayā – dassanena pahātabbahetukaṃ ekaṃ khandhaṃ saṃsaṭṭhā tayo khandhā…pe… dve khandhā. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho… ekaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho nevadassanena nabhāvanāya pahātabbahetuko ",
      " dhammo uppajjati adhipatipaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ saṃsaṭṭhā tayo khandhā…pe… dve khandhā; anantarapaccayā… samanantarapaccayā."
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati adhipatipaccayā – nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ saṃsaṭṭhā tayo khandhā…pe… dve khandhā; anantarapaccayā… samanantarapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sahajātapaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "68"
      },
      ". Dassanena ",
      " pahātabbahetukaṃ dhammaṃ saṃsaṭṭho dassanena pahātabbahetuko dhammo uppajjati sahajātapaccayā… aññamaññapaccayā… nissayapaccayā… upanissayapaccayā… purejātapaccayā… āsevanapaccayā… kammapaccayā… vipākapaccayā… āhārapaccayā… indriyapaccayā ",
      "… jhānapaccayā… maggapaccayā… sampayuttapaccayā… vippayuttapaccayā… atthipaccayā… natthipaccayā… vigatapaccayā… avigatapaccayā…."
    ],
    "innerText": "68. Dassanena pahātabbahetukaṃ dhammaṃ saṃsaṭṭho dassanena pahātabbahetuko dhammo uppajjati sahajātapaccayā… aññamaññapaccayā… nissayapaccayā… upanissayapaccayā… purejātapaccayā… āsevanapaccayā… kammapaccayā… vipākapaccayā… āhārapaccayā… indriyapaccayā … jhānapaccayā… maggapaccayā… sampayuttapaccayā… vippayuttapaccayā… atthipaccayā… natthipaccayā… vigatapaccayā… avigatapaccayā…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paccayānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Saṅkhyāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "69"
      },
      ". Hetuyā satta, ārammaṇe ekādasa, adhipatiyā tīṇi, anantare ekādasa, samanantare ekādasa, sahajāte ekādasa, aññamaññe ekādasa, nissaye ekādasa, upanissaye ekādasa, purejāte ekādasa, āsevane ekādasa, kamme ekādasa, vipāke ekaṃ, āhāre ekādasa, indriye ekādasa, jhāne ekādasa, magge ekādasa, sampayutte ekādasa, vippayutte ekādasa, atthiyā ekādasa, natthiyā ekādasa, vigate ekādasa, avigate ekādasa (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "69. Hetuyā satta, ārammaṇe ekādasa, adhipatiyā tīṇi, anantare ekādasa, samanantare ekādasa, sahajāte ekādasa, aññamaññe ekādasa, nissaye ekādasa, upanissaye ekādasa, purejāte ekādasa, āsevane ekādasa, kamme ekādasa, vipāke ekaṃ, āhāre ekādasa, indriye ekādasa, jhāne ekādasa, magge ekādasa, sampayutte ekādasa, vippayutte ekādasa, atthiyā ekādasa, natthiyā ekādasa, vigate ekādasa, avigate ekādasa (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anulomaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Paccayapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Vibhaṅgavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nahetupaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "70"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ saṃsaṭṭho nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – vicikicchāsahagate ",
      " khandhe saṃsaṭṭho vicikicchāsahagato moho.(1)"
    ],
    "innerText": "70. Dassanena pahātabbahetukaṃ dhammaṃ saṃsaṭṭho nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – vicikicchāsahagate khandhe saṃsaṭṭho vicikicchāsahagato moho.(1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – uddhaccasahagate khandhe saṃsaṭṭho uddhaccasahagato moho. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – ahetukaṃ nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ saṃsaṭṭhā tayo khandhā…pe… dve khandhe saṃsaṭṭhā dve khandhā. Ahetukapaṭisandhikkhaṇe…pe…. (1)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetukaṃ dhammaṃ saṃsaṭṭho nevadassanena nabhāvanāya pahātabbahetuko dhammo uppajjati nahetupaccayā – ahetukaṃ nevadassanena nabhāvanāya pahātabbahetukaṃ ekaṃ khandhaṃ saṃsaṭṭhā tayo khandhā…pe… dve khandhe saṃsaṭṭhā dve khandhā. Ahetukapaṭisandhikkhaṇe…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Naadhipatipaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "71"
      },
      ". Dassanena pahātabbahetukaṃ dhammaṃ saṃsaṭṭho…pe… naadhipatipaccayā (sahajātasadisaṃ)… napurejātapaccayā… napacchājātapaccayā, naāsevanapaccayā… nakammapaccayā… satta, navipākapaccayā… najhānapaccayā… namaggapaccayā… navippayuttapaccayā…."
    ],
    "innerText": "71. Dassanena pahātabbahetukaṃ dhammaṃ saṃsaṭṭho…pe… naadhipatipaccayā (sahajātasadisaṃ)… napurejātapaccayā… napacchājātapaccayā, naāsevanapaccayā… nakammapaccayā… satta, navipākapaccayā… najhānapaccayā… namaggapaccayā… navippayuttapaccayā…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Paccayapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Saṅkhyāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "72"
      },
      ". Nahetuyā tīṇi, naadhipatiyā ekādasa, napurejāte ekādasa, napacchājāte ekādasa, naāsevane ekādasa, nakamme satta, navipāke ekādasa, najhāne ekaṃ, namagge ekaṃ, navippayutte ekādasa (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "72. Nahetuyā tīṇi, naadhipatiyā ekādasa, napurejāte ekādasa, napacchājāte ekādasa, naāsevane ekādasa, nakamme satta, navipāke ekādasa, najhāne ekaṃ, namagge ekaṃ, navippayutte ekādasa (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccanīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Paccayānulomapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "73"
      },
      ". Hetupaccayā naadhipatiyā satta, napurejāte satta, napacchājāte satta, naāsevane satta, nakamme satta, navipāke satta ",
      ", navippayutte satta (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "73. Hetupaccayā naadhipatiyā satta, napurejāte satta, napacchājāte satta, naāsevane satta, nakamme satta, navipāke satta , navippayutte satta (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anulomapaccanīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4. Paccayapaccanīyānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "74"
      },
      ". Nahetupaccayā ",
      " ārammaṇe tīṇi, anantare tīṇi, samanantare tīṇi, sahajāte tīṇi, aññamaññe tīṇi, nissaye tīṇi, upanissaye tīṇi, purejāte tīṇi, āsevane tīṇi, kamme tīṇi, vipāke ekaṃ ",
      ", āhāre tīṇi, indriye tīṇi, jhāne tīṇi, magge dve, sampayutte tīṇi, vippayutte tīṇi, atthiyā tīṇi, natthiyā tīṇi, vigate tīṇi, avigate tīṇi (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "74. Nahetupaccayā ārammaṇe tīṇi, anantare tīṇi, samanantare tīṇi, sahajāte tīṇi, aññamaññe tīṇi, nissaye tīṇi, upanissaye tīṇi, purejāte tīṇi, āsevane tīṇi, kamme tīṇi, vipāke ekaṃ , āhāre tīṇi, indriye tīṇi, jhāne tīṇi, magge dve, sampayutte tīṇi, vippayutte tīṇi, atthiyā tīṇi, natthiyā tīṇi, vigate tīṇi, avigate tīṇi (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccanīyānulomaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṃsaṭṭhavāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "6. Sampayuttavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "(Sampayuttavāro saṃsaṭṭhavārasadiso)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "7. Pañhāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paccayānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Vibhaṅgavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetupaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "75"
      },
      ". Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa hetupaccayena paccayo – dassanena pahātabbahetukā hetū sampayuttakānaṃ khandhānaṃ hetupaccayena paccayo. (1)"
    ],
    "innerText": "75. Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa hetupaccayena paccayo – dassanena pahātabbahetukā hetū sampayuttakānaṃ khandhānaṃ hetupaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa hetupaccayena paccayo – dassanena pahātabbahetukā hetū cittasamuṭṭhānānaṃ rūpānaṃ hetupaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena ",
      " pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa hetupaccayena paccayo – dassanena pahātabbahetukā hetū sampayuttakānaṃ ",
      " khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ hetupaccayena paccayo. (3)"
    ],
    "innerText": "Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa hetupaccayena paccayo – dassanena pahātabbahetukā hetū sampayuttakānaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ hetupaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko dhammo… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "76"
      },
      ". Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa hetupaccayena paccayo…pe…."
    ],
    "innerText": "76. Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa hetupaccayena paccayo…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa hetupaccayena paccayo – vicikicchāsahagato moho sampayuttakānaṃ khandhānaṃ hetupaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa hetupaccayena paccayo – uddhaccasahagato moho sampayuttakānaṃ khandhānaṃ hetupaccayena paccayo. (3)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa hetupaccayena paccayo – uddhaccasahagato moho sampayuttakānaṃ khandhānaṃ hetupaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa hetupaccayena paccayo – vicikicchāsahagato moho sampayuttakānaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ hetupaccayena paccayo. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa hetupaccayena paccayo – uddhaccasahagato moho sampayuttakānaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ hetupaccayena paccayo. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ārammaṇapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "77"
      },
      ". Dassanena ",
      " pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – dassanena pahātabbahetukaṃ rāgaṃ assādeti abhinandati; taṃ ārabbha dassanena pahātabbahetuko ",
      " rāgo uppajjati, diṭṭhi uppajjati, vicikicchā uppajjati, dassanena pahātabbahetukaṃ domanassaṃ uppajjati. Diṭṭhiṃ assādeti abhinandati; taṃ ārabbha dassanena pahātabbahetuko rāgo uppajjati, diṭṭhi uppajjati, vicikicchā uppajjati, dassanena pahātabbahetukaṃ domanassaṃ uppajjati. Vicikicchaṃ ārabbha vicikicchā uppajjati, diṭṭhi uppajjati, dassanena pahātabbahetukaṃ domanassaṃ uppajjati. Dassanena pahātabbahetukaṃ domanassaṃ ārabbha dassanena pahātabbahetukaṃ domanassaṃ uppajjati, diṭṭhi uppajjati, vicikicchā uppajjati. (1)"
    ],
    "innerText": "77. Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – dassanena pahātabbahetukaṃ rāgaṃ assādeti abhinandati; taṃ ārabbha dassanena pahātabbahetuko rāgo uppajjati, diṭṭhi uppajjati, vicikicchā uppajjati, dassanena pahātabbahetukaṃ domanassaṃ uppajjati. Diṭṭhiṃ assādeti abhinandati; taṃ ārabbha dassanena pahātabbahetuko rāgo uppajjati, diṭṭhi uppajjati, vicikicchā uppajjati, dassanena pahātabbahetukaṃ domanassaṃ uppajjati. Vicikicchaṃ ārabbha vicikicchā uppajjati, diṭṭhi uppajjati, dassanena pahātabbahetukaṃ domanassaṃ uppajjati. Dassanena pahātabbahetukaṃ domanassaṃ ārabbha dassanena pahātabbahetukaṃ domanassaṃ uppajjati, diṭṭhi uppajjati, vicikicchā uppajjati. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – ariyā dassanena pahātabbahetuke pahīne kilese paccavekkhanti, pubbe samudāciṇṇe kilese jānanti, dassanena pahātabbahetuke khandhe aniccato…pe… cetopariyañāṇena…pe… dassanena pahātabbahetukā khandhā ",
      " cetopariyañāṇassa, pubbenivāsānussatiñāṇassa, yathākammūpagañāṇassa anāgataṃsañāṇassa, āvajjanāya mohassa ca ārammaṇapaccayena paccayo. (2)"
    ],
    "innerText": "Dassanena pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – ariyā dassanena pahātabbahetuke pahīne kilese paccavekkhanti, pubbe samudāciṇṇe kilese jānanti, dassanena pahātabbahetuke khandhe aniccato…pe… cetopariyañāṇena…pe… dassanena pahātabbahetukā khandhā cetopariyañāṇassa, pubbenivāsānussatiñāṇassa, yathākammūpagañāṇassa anāgataṃsañāṇassa, āvajjanāya mohassa ca ārammaṇapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo – dassanena pahātabbahetuke khandhe ārabbha vicikicchāsahagatā khandhā ca moho ca uppajjanti. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "78"
      },
      ". Bhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ",
      " dhammassa ārammaṇapaccayena paccayo – bhāvanāya pahātabbahetukaṃ rāgaṃ assādeti abhinandati; taṃ ārabbha bhāvanāya pahātabbahetuko rāgo uppajjati, uddhaccaṃ uppajjati, bhāvanāya pahātabbahetukaṃ domanassaṃ uppajjati. Uddhaccaṃ ārabbha uddhaccaṃ uppajjati, bhāvanāya pahātabbahetukaṃ ",
      " domanassaṃ uppajjati. Bhāvanāya pahātabbahetukaṃ domanassaṃ ārabbha bhāvanāya pahātabbahetukaṃ domanassaṃ uppajjati, uddhaccaṃ uppajjati. (1)"
    ],
    "innerText": "78. Bhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – bhāvanāya pahātabbahetukaṃ rāgaṃ assādeti abhinandati; taṃ ārabbha bhāvanāya pahātabbahetuko rāgo uppajjati, uddhaccaṃ uppajjati, bhāvanāya pahātabbahetukaṃ domanassaṃ uppajjati. Uddhaccaṃ ārabbha uddhaccaṃ uppajjati, bhāvanāya pahātabbahetukaṃ domanassaṃ uppajjati. Bhāvanāya pahātabbahetukaṃ domanassaṃ ārabbha bhāvanāya pahātabbahetukaṃ domanassaṃ uppajjati, uddhaccaṃ uppajjati. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – bhāvanāya pahātabbahetukaṃ rāgaṃ assādeti abhinandati; taṃ ārabbha dassanena pahātabbahetuko rāgo uppajjati, diṭṭhi uppajjati, vicikicchā uppajjati, dassanena pahātabbahetukaṃ domanassaṃ uppajjati. Uddhaccaṃ ārabbha diṭṭhi uppajjati, vicikicchā uppajjati, dassanena pahātabbahetukaṃ domanassaṃ uppajjati. Bhāvanāya pahātabbahetukaṃ domanassaṃ ārabbha dassanena pahātabbahetukaṃ domanassaṃ uppajjati, diṭṭhi uppajjati, vicikicchā uppajjati. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – ariyā bhāvanāya pahātabbahetuke pahīne kilese paccavekkhanti, vikkhambhite kilese paccavekkhanti, pubbe samudāciṇṇe kilese jānanti, bhāvanāya pahātabbahetuke khandhe aniccato…pe… cetopariyañāṇena…pe… bhāvanāya ",
      " pahātabbahetukā khandhā cetopariyañāṇassa, pubbenivāsānussatiñāṇassa ",
      ", yathākammūpagañāṇassa, anāgataṃsañāṇassa, āvajjanāya mohassa ca ārammaṇapaccayena paccayo. (3)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – ariyā bhāvanāya pahātabbahetuke pahīne kilese paccavekkhanti, vikkhambhite kilese paccavekkhanti, pubbe samudāciṇṇe kilese jānanti, bhāvanāya pahātabbahetuke khandhe aniccato…pe… cetopariyañāṇena…pe… bhāvanāya pahātabbahetukā khandhā cetopariyañāṇassa, pubbenivāsānussatiñāṇassa , yathākammūpagañāṇassa, anāgataṃsañāṇassa, āvajjanāya mohassa ca ārammaṇapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo – bhāvanāya pahātabbahetuke khandhe ārabbha vicikicchāsahagatā khandhā ca moho ca uppajjanti. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo – bhāvanāya pahātabbahetuke khandhe ārabbha uddhaccasahagatā khandhā ca moho ca uppajjanti. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "79"
      },
      ". Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa ",
      " dhammassa ārammaṇapaccayena paccayo – dānaṃ datvā…(vitthāretabbaṃ dassanattikasadisaṃ) āvajjanāya mohassa ca ārammaṇapaccayena paccayo. (1)"
    ],
    "innerText": "79. Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – dānaṃ datvā…(vitthāretabbaṃ dassanattikasadisaṃ) āvajjanāya mohassa ca ārammaṇapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – dānaṃ datvā… (yathā dassanattikaṃ). (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – dānaṃ datvā… (yathā dassanattikaṃ). (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo – cakkhuṃ ārabbha vicikicchāsahagatā khandhā ca moho ca uppajjanti. Sotaṃ…pe… vatthuṃ… nevadassanena nabhāvanāya pahātabbahetuke khandhe ārabbha vicikicchāsahagatā khandhā ca moho ca uppajjanti. (4)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo – cakkhuṃ ārabbha vicikicchāsahagatā khandhā ca moho ca uppajjanti. Sotaṃ…pe… vatthuṃ… nevadassanena nabhāvanāya pahātabbahetuke khandhe ārabbha vicikicchāsahagatā khandhā ca moho ca uppajjanti. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca ",
      " dhammassa ārammaṇapaccayena paccayo – cakkhuṃ…pe… vatthuṃ… nevadassanena nabhāvanāya pahātabbahetuke khandhe ārabbha uddhaccasahagatā khandhā ca moho ca uppajjanti. (5)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo – cakkhuṃ…pe… vatthuṃ… nevadassanena nabhāvanāya pahātabbahetuke khandhe ārabbha uddhaccasahagatā khandhā ca moho ca uppajjanti. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "80"
      },
      ". Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – vicikicchāsahagate khandhe ca mohañca ārabbha dassanena pahātabbahetukā khandhā uppajjanti. (1)"
    ],
    "innerText": "80. Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – vicikicchāsahagate khandhe ca mohañca ārabbha dassanena pahātabbahetukā khandhā uppajjanti. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – vicikicchāsahagate khandhe ca mohañca ārabbha nevadassanena nabhāvanāya pahātabbahetukā khandhā ca moho ca uppajjanti. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena ",
      " pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo – vicikicchāsahagate khandhe ca mohañca ārabbha vicikicchāsahagatā khandhā ca moho ca uppajjanti. (3)"
    ],
    "innerText": "Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo – vicikicchāsahagate khandhe ca mohañca ārabbha vicikicchāsahagatā khandhā ca moho ca uppajjanti. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "81"
      },
      ". Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – uddhaccasahagate khandhe ca mohañca ārabbha dassanena pahātabbahetukā khandhā uppajjanti. (1)"
    ],
    "innerText": "81. Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – uddhaccasahagate khandhe ca mohañca ārabbha dassanena pahātabbahetukā khandhā uppajjanti. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā bhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – uddhaccasahagate khandhe ca mohañca ārabbha bhāvanāya pahātabbahetukā khandhā uppajjanti. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – uddhaccasahagate khandhe ca mohañca ārabbha ",
      " nevadassanena nabhāvanāya pahātabbahetukā khandhā ca moho ca uppajjanti. (3)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo – uddhaccasahagate khandhe ca mohañca ārabbha nevadassanena nabhāvanāya pahātabbahetukā khandhā ca moho ca uppajjanti. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa ca nevadassanena ",
      " nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo – uddhaccasahagate khandhe ca mohañca ārabbha vicikicchāsahagatā khandhā ca moho ca uppajjanti. (4)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo – uddhaccasahagate khandhe ca mohañca ārabbha vicikicchāsahagatā khandhā ca moho ca uppajjanti. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo – uddhaccasahagate khandhe ca mohañca ārabbha uddhaccasahagatā khandhā ca moho ca uppajjanti. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Adhipatipaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "82"
      },
      ". Dassanena ",
      " pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa adhipatipaccayena paccayo (dassanattikasadisaṃ, dasa pañhā)."
    ],
    "innerText": "82. Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa adhipatipaccayena paccayo (dassanattikasadisaṃ, dasa pañhā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Anantarapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "83"
      },
      ". Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa anantarapaccayena paccayo – purimā purimā dassanena pahātabbahetukā khandhā pacchimānaṃ pacchimānaṃ dassanena pahātabbahetukānaṃ khandhānaṃ anantarapaccayena paccayo. (1)"
    ],
    "innerText": "83. Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa anantarapaccayena paccayo – purimā purimā dassanena pahātabbahetukā khandhā pacchimānaṃ pacchimānaṃ dassanena pahātabbahetukānaṃ khandhānaṃ anantarapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa anantarapaccayena paccayo – purimā purimā vicikicchāsahagatā khandhā pacchimassa pacchimassa mohassa anantarapaccayena paccayo; dassanena pahātabbahetukā khandhā vuṭṭhānassa anantarapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena ",
      " pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ",
      " anantarapaccayena paccayo – purimā purimā vicikicchāsahagatā khandhā pacchimānaṃ pacchimānaṃ vicikicchāsahagatānaṃ khandhānaṃ mohassa ca anantarapaccayena paccayo. (3)"
    ],
    "innerText": "Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa anantarapaccayena paccayo – purimā purimā vicikicchāsahagatā khandhā pacchimānaṃ pacchimānaṃ vicikicchāsahagatānaṃ khandhānaṃ mohassa ca anantarapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "84"
      },
      ". Bhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa anantarapaccayena paccayo – purimā purimā bhāvanāya pahātabbahetukā khandhā pacchimānaṃ pacchimānaṃ bhāvanāya pahātabbahetukānaṃ khandhānaṃ anantarapaccayena paccayo. (1)"
    ],
    "innerText": "84. Bhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa anantarapaccayena paccayo – purimā purimā bhāvanāya pahātabbahetukā khandhā pacchimānaṃ pacchimānaṃ bhāvanāya pahātabbahetukānaṃ khandhānaṃ anantarapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa anantarapaccayena paccayo – purimā purimā uddhaccasahagatā khandhā pacchimassa pacchimassa mohassa anantarapaccayena paccayo; bhāvanāya pahātabbahetukā khandhā vuṭṭhānassa anantarapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa anantarapaccayena paccayo – purimā purimā uddhaccasahagatā khandhā pacchimānaṃ pacchimānaṃ uddhaccasahagatānaṃ khandhānaṃ mohassa ca anantarapaccayena paccayo. (3)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa anantarapaccayena paccayo – purimā purimā uddhaccasahagatā khandhā pacchimānaṃ pacchimānaṃ uddhaccasahagatānaṃ khandhānaṃ mohassa ca anantarapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "85"
      },
      ". Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa anantarapaccayena paccayo – purimo purimo vicikicchāsahagato ",
      " uddhaccasahagato moho pacchimassa pacchimassa vicikicchāsahagatassa uddhaccasahagatassa mohassa anantarapaccayena paccayo; purimā purimā nevadassanena nabhāvanāya pahātabbahetukā khandhā pacchimānaṃ pacchimānaṃ nevadassanena nabhāvanāya pahātabbahetukānaṃ khandhānaṃ anantarapaccayena paccayo; anulomaṃ gotrabhussa… anulomaṃ vodānassa…pe… nirodhā vuṭṭhahantassa nevasaññānāsaññāyatanaṃ phalasamāpattiyā anantarapaccayena paccayo. (1)"
    ],
    "innerText": "85. Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa anantarapaccayena paccayo – purimo purimo vicikicchāsahagato uddhaccasahagato moho pacchimassa pacchimassa vicikicchāsahagatassa uddhaccasahagatassa mohassa anantarapaccayena paccayo; purimā purimā nevadassanena nabhāvanāya pahātabbahetukā khandhā pacchimānaṃ pacchimānaṃ nevadassanena nabhāvanāya pahātabbahetukānaṃ khandhānaṃ anantarapaccayena paccayo; anulomaṃ gotrabhussa… anulomaṃ vodānassa…pe… nirodhā vuṭṭhahantassa nevasaññānāsaññāyatanaṃ phalasamāpattiyā anantarapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa anantarapaccayena paccayo – purimo purimo vicikicchāsahagato ",
      " moho pacchimānaṃ pacchimānaṃ vicikicchāsahagatānaṃ khandhānaṃ anantarapaccayena paccayo; āvajjanā dassanena pahātabbahetukānaṃ khandhānaṃ anantarapaccayena paccayo. (2)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa anantarapaccayena paccayo – purimo purimo vicikicchāsahagato moho pacchimānaṃ pacchimānaṃ vicikicchāsahagatānaṃ khandhānaṃ anantarapaccayena paccayo; āvajjanā dassanena pahātabbahetukānaṃ khandhānaṃ anantarapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa anantarapaccayena paccayo – purimo purimo uddhaccasahagato moho pacchimānaṃ pacchimānaṃ uddhaccasahagatānaṃ khandhānaṃ anantarapaccayena paccayo; āvajjanā bhāvanāya pahātabbahetukānaṃ khandhānaṃ anantarapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa anantarapaccayena paccayo – purimo purimo vicikicchāsahagato moho pacchimānaṃ ",
      " pacchimānaṃ vicikicchāsahagatānaṃ khandhānaṃ mohassa ca anantarapaccayena paccayo; āvajjanā vicikicchāsahagatānaṃ khandhānaṃ mohassa ca anantarapaccayena paccayo. (4)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa anantarapaccayena paccayo – purimo purimo vicikicchāsahagato moho pacchimānaṃ pacchimānaṃ vicikicchāsahagatānaṃ khandhānaṃ mohassa ca anantarapaccayena paccayo; āvajjanā vicikicchāsahagatānaṃ khandhānaṃ mohassa ca anantarapaccayena paccayo. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa anantarapaccayena paccayo – purimo purimo uddhaccasahagato moho pacchimānaṃ pacchimānaṃ uddhaccasahagatānaṃ khandhānaṃ mohassa ca anantarapaccayena paccayo; āvajjanā uddhaccasahagatānaṃ khandhānaṃ mohassa ca anantarapaccayena paccayo. (5)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa anantarapaccayena paccayo – purimo purimo uddhaccasahagato moho pacchimānaṃ pacchimānaṃ uddhaccasahagatānaṃ khandhānaṃ mohassa ca anantarapaccayena paccayo; āvajjanā uddhaccasahagatānaṃ khandhānaṃ mohassa ca anantarapaccayena paccayo. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "86"
      },
      ". Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa dhammassa anantarapaccayena paccayo – purimā purimā vicikicchāsahagatā khandhā ca moho ca pacchimānaṃ pacchimānaṃ vicikicchāsahagatānaṃ khandhānaṃ anantarapaccayena paccayo. (1)"
    ],
    "innerText": "86. Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa dhammassa anantarapaccayena paccayo – purimā purimā vicikicchāsahagatā khandhā ca moho ca pacchimānaṃ pacchimānaṃ vicikicchāsahagatānaṃ khandhānaṃ anantarapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa anantarapaccayena paccayo – purimā purimā vicikicchāsahagatā khandhā ca moho ca pacchimassa pacchimassa mohassa anantarapaccayena ",
      " paccayo; vicikicchāsahagatā khandhā ca moho ca vuṭṭhānassa anantarapaccayena paccayo. (2)"
    ],
    "innerText": "Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa anantarapaccayena paccayo – purimā purimā vicikicchāsahagatā khandhā ca moho ca pacchimassa pacchimassa mohassa anantarapaccayena paccayo; vicikicchāsahagatā khandhā ca moho ca vuṭṭhānassa anantarapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena ",
      " pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa anantarapaccayena paccayo – purimā purimā vicikicchāsahagatā khandhā ca moho ca pacchimānaṃ pacchimānaṃ vicikicchāsahagatānaṃ khandhānaṃ mohassa ca anantarapaccayena paccayo. (3)"
    ],
    "innerText": "Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa anantarapaccayena paccayo – purimā purimā vicikicchāsahagatā khandhā ca moho ca pacchimānaṃ pacchimānaṃ vicikicchāsahagatānaṃ khandhānaṃ mohassa ca anantarapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā bhāvanāya pahātabbahetukassa dhammassa anantarapaccayena paccayo… tīṇi (dassanena sadisaṃ gamanaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Samanantarapaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "87"
      },
      ". Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa samanantarapaccayena paccayo… (anantarasadisaṃ) sahajātapaccayena paccayo… (saṃkhittaṃ. Paṭiccavāre ",
      " sahajātasadisaṃ) aññamaññapaccayena paccayo… (saṃkhittaṃ. Paṭiccavāre aññamaññasadisaṃ) nissayapaccayena paccayo… (saṃkhittaṃ. Paccayavāre nissayavārasadisaṃ. Visuṃ ghaṭanā natthi)."
    ],
    "innerText": "87. Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa samanantarapaccayena paccayo… (anantarasadisaṃ) sahajātapaccayena paccayo… (saṃkhittaṃ. Paṭiccavāre sahajātasadisaṃ) aññamaññapaccayena paccayo… (saṃkhittaṃ. Paṭiccavāre aññamaññasadisaṃ) nissayapaccayena paccayo… (saṃkhittaṃ. Paccayavāre nissayavārasadisaṃ. Visuṃ ghaṭanā natthi)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Upanissayapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "88"
      },
      ". Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇūpanissayo, 51anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – dassanena pahātabbahetukaṃ rāgaṃ upanissāya pāṇaṃ hanati…pe… saṅghaṃ bhindati. Dassanena pahātabbahetukaṃ dosaṃ… mohaṃ… diṭṭhiṃ… patthanaṃ upanissāya pāṇaṃ hanati…pe… saṅghaṃ bhindati. Dassanena pahātabbahetuko rāgo… doso… moho… ",
      " diṭṭhi… patthanā dassanena pahātabbahetukassa rāgassa…pe… patthanāya upanissayapaccayena paccayo. (1)"
    ],
    "innerText": "88. Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ārammaṇūpanissayo, 51anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – dassanena pahātabbahetukaṃ rāgaṃ upanissāya pāṇaṃ hanati…pe… saṅghaṃ bhindati. Dassanena pahātabbahetukaṃ dosaṃ… mohaṃ… diṭṭhiṃ… patthanaṃ upanissāya pāṇaṃ hanati…pe… saṅghaṃ bhindati. Dassanena pahātabbahetuko rāgo… doso… moho… diṭṭhi… patthanā dassanena pahātabbahetukassa rāgassa…pe… patthanāya upanissayapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena ",
      " pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – dassanena pahātabbahetukaṃ rāgaṃ upanissāya dānaṃ deti…pe… samāpattiṃ uppādeti. Dassanena pahātabbahetukaṃ dosaṃ… mohaṃ… diṭṭhiṃ… patthanaṃ upanissāya dānaṃ deti…pe… samāpattiṃ uppādeti. Dassanena pahātabbahetuko rāgo…pe… patthanā… saddhāya…pe… paññāya… kāyikassa sukhassa, kāyikassa dukkhassa phalasamāpattiyā mohassa ca upanissayapaccayena paccayo. (2)"
    ],
    "innerText": "Dassanena pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa upanissayapaccayena paccayo – anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – dassanena pahātabbahetukaṃ rāgaṃ upanissāya dānaṃ deti…pe… samāpattiṃ uppādeti. Dassanena pahātabbahetukaṃ dosaṃ… mohaṃ… diṭṭhiṃ… patthanaṃ upanissāya dānaṃ deti…pe… samāpattiṃ uppādeti. Dassanena pahātabbahetuko rāgo…pe… patthanā… saddhāya…pe… paññāya… kāyikassa sukhassa, kāyikassa dukkhassa phalasamāpattiyā mohassa ca upanissayapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – dassanena pahātabbahetuko rāgo… doso… moho… diṭṭhi… patthanā vicikicchāsahagatānaṃ khandhānaṃ mohassa ca upanissayapaccayena paccayo. (3)"
    ],
    "innerText": "Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa upanissayapaccayena paccayo – anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – dassanena pahātabbahetuko rāgo… doso… moho… diṭṭhi… patthanā vicikicchāsahagatānaṃ khandhānaṃ mohassa ca upanissayapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "89"
      },
      ". Bhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa upanissayapaccayena ",
      " paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇūpanissayo, anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – bhāvanāya pahātabbahetuko rāgo… doso… moho… māno… patthanā bhāvanāya pahātabbahetukassa ",
      " rāgassa… dosassa… mohassa… mānassa… patthanāya upanissayapaccayena paccayo. (1)"
    ],
    "innerText": "89. Bhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ārammaṇūpanissayo, anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – bhāvanāya pahātabbahetuko rāgo… doso… moho… māno… patthanā bhāvanāya pahātabbahetukassa rāgassa… dosassa… mohassa… mānassa… patthanāya upanissayapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – bhāvanāya pahātabbahetukaṃ rāgaṃ upanissāya pāṇaṃ hanati…pe… saṅghaṃ bhindati. Bhāvanāya pahātabbahetukaṃ dosaṃ… mohaṃ… mānaṃ… patthanaṃ upanissāya pāṇaṃ hanati…pe… saṅghaṃ bhindati. Bhāvanāya pahātabbahetuko rāgo…pe… patthanā dassanena pahātabbahetukassa rāgassa… dosassa… mohassa… diṭṭhiyā… patthanāya upanissayapaccayena paccayo. Sakabhaṇḍe chandarāgo parabhaṇḍe ",
      " chandarāgassa upanissayapaccayena paccayo. Sakapariggahe chandarāgo parapariggahe chandarāgassa upanissayapaccayena paccayo. (2)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ārammaṇūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – bhāvanāya pahātabbahetukaṃ rāgaṃ upanissāya pāṇaṃ hanati…pe… saṅghaṃ bhindati. Bhāvanāya pahātabbahetukaṃ dosaṃ… mohaṃ… mānaṃ… patthanaṃ upanissāya pāṇaṃ hanati…pe… saṅghaṃ bhindati. Bhāvanāya pahātabbahetuko rāgo…pe… patthanā dassanena pahātabbahetukassa rāgassa… dosassa… mohassa… diṭṭhiyā… patthanāya upanissayapaccayena paccayo. Sakabhaṇḍe chandarāgo parabhaṇḍe chandarāgassa upanissayapaccayena paccayo. Sakapariggahe chandarāgo parapariggahe chandarāgassa upanissayapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – bhāvanāya pahātabbahetukaṃ rāgaṃ upanissāya dānaṃ deti…pe… samāpattiṃ uppādeti. Bhāvanāya pahātabbahetukaṃ dosaṃ… mohaṃ… mānaṃ… patthanaṃ upanissāya dānaṃ deti…pe… samāpattiṃ uppādeti. Bhāvanāya pahātabbahetuko rāgo…pe… patthanā saddhāya…pe… paññāya… kāyikassa sukhassa, kāyikassa dukkhassa phalasamāpattiyā mohassa ca upanissayapaccayena paccayo. (3)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa upanissayapaccayena paccayo – anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – bhāvanāya pahātabbahetukaṃ rāgaṃ upanissāya dānaṃ deti…pe… samāpattiṃ uppādeti. Bhāvanāya pahātabbahetukaṃ dosaṃ… mohaṃ… mānaṃ… patthanaṃ upanissāya dānaṃ deti…pe… samāpattiṃ uppādeti. Bhāvanāya pahātabbahetuko rāgo…pe… patthanā saddhāya…pe… paññāya… kāyikassa sukhassa, kāyikassa dukkhassa phalasamāpattiyā mohassa ca upanissayapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa upanissayapaccayena paccayo…. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakatūpanissayo"
      },
      " – bhāvanāya pahātabbahetuko rāgo…pe… patthanā vicikicchāsahagatānaṃ khandhānaṃ mohassa ca upanissayapaccayena paccayo. (4)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa upanissayapaccayena paccayo…. Pakatūpanissayo – bhāvanāya pahātabbahetuko rāgo…pe… patthanā vicikicchāsahagatānaṃ khandhānaṃ mohassa ca upanissayapaccayena paccayo. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ",
      " ca dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – bhāvanāya pahātabbahetuko rāgo…pe… patthanā uddhaccasahagatānaṃ khandhānaṃ mohassa ca upanissayapaccayena paccayo. (5)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa upanissayapaccayena paccayo – anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – bhāvanāya pahātabbahetuko rāgo…pe… patthanā uddhaccasahagatānaṃ khandhānaṃ mohassa ca upanissayapaccayena paccayo. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "90"
      },
      ". Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇūpanissayo, anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – saddhaṃ upanissāya dānaṃ deti…pe… samāpattiṃ uppādeti. Sīlaṃ…pe… paññaṃ… kāyikaṃ sukhaṃ… kāyikaṃ dukkhaṃ… utuṃ… bhojanaṃ… senāsanaṃ… mohaṃ upanissāya dānaṃ deti…pe… saddhā…pe… moho saddhāya…pe… phalasamāpattiyā mohassa ca upanissayapaccayena paccayo. (1)"
    ],
    "innerText": "90. Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ārammaṇūpanissayo, anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – saddhaṃ upanissāya dānaṃ deti…pe… samāpattiṃ uppādeti. Sīlaṃ…pe… paññaṃ… kāyikaṃ sukhaṃ… kāyikaṃ dukkhaṃ… utuṃ… bhojanaṃ… senāsanaṃ… mohaṃ upanissāya dānaṃ deti…pe… saddhā…pe… moho saddhāya…pe… phalasamāpattiyā mohassa ca upanissayapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇūpanissayo, anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – saddhaṃ ",
      " upanissāya diṭṭhiṃ gaṇhāti. Sīlaṃ…pe… paññaṃ… kāyikaṃ sukhaṃ… kāyikaṃ dukkhaṃ…pe… senāsanaṃ… mohaṃ upanissāya pāṇaṃ hanati…pe… saṅghaṃ bhindati. Saddhā…pe… senāsanaṃ moho ca dassanena pahātabbahetukassa rāgassa…pe… patthanāya upanissayapaccayena paccayo. (2)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ārammaṇūpanissayo, anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – saddhaṃ upanissāya diṭṭhiṃ gaṇhāti. Sīlaṃ…pe… paññaṃ… kāyikaṃ sukhaṃ… kāyikaṃ dukkhaṃ…pe… senāsanaṃ… mohaṃ upanissāya pāṇaṃ hanati…pe… saṅghaṃ bhindati. Saddhā…pe… senāsanaṃ moho ca dassanena pahātabbahetukassa rāgassa…pe… patthanāya upanissayapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇūpanissayo, anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – saddhaṃ upanissāya mānaṃ jappeti…pe… mohaṃ upanissāya mānaṃ jappeti. Saddhā…pe… senāsanaṃ moho ca bhāvanāya pahātabbahetukassa rāgassa…pe… patthanāya upanissayapaccayena paccayo. (3)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ārammaṇūpanissayo, anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – saddhaṃ upanissāya mānaṃ jappeti…pe… mohaṃ upanissāya mānaṃ jappeti. Saddhā…pe… senāsanaṃ moho ca bhāvanāya pahātabbahetukassa rāgassa…pe… patthanāya upanissayapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – saddhā…pe… paññā… kāyikaṃ ",
      " sukhaṃ… kāyikaṃ dukkhaṃ…pe… senāsanaṃ moho ca vicikicchāsahagatānaṃ khandhānaṃ mohassa ca upanissayapaccayena paccayo. (4)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa upanissayapaccayena paccayo – anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – saddhā…pe… paññā… kāyikaṃ sukhaṃ… kāyikaṃ dukkhaṃ…pe… senāsanaṃ moho ca vicikicchāsahagatānaṃ khandhānaṃ mohassa ca upanissayapaccayena paccayo. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – saddhā…pe… senāsanaṃ moho ca uddhaccasahagatānaṃ ",
      " khandhānaṃ mohassa ca upanissayapaccayena paccayo. (5)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa upanissayapaccayena paccayo – anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – saddhā…pe… senāsanaṃ moho ca uddhaccasahagatānaṃ khandhānaṃ mohassa ca upanissayapaccayena paccayo. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "91"
      },
      ". Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – vicikicchāsahagatā khandhā ca moho ca dassanena pahātabbahetukassa ",
      " rāgassa…pe… patthanāya upanissayapaccayena paccayo. (1)"
    ],
    "innerText": "91. Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa dhammassa upanissayapaccayena paccayo – anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – vicikicchāsahagatā khandhā ca moho ca dassanena pahātabbahetukassa rāgassa…pe… patthanāya upanissayapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – vicikicchāsahagatā khandhā ca moho ca saddhāya…pe… paññāya… kāyikassa sukhassa, kāyikassa dukkhassa phalasamāpattiyā mohassa ca upanissayapaccayena paccayo. (2)"
    ],
    "innerText": "Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa upanissayapaccayena paccayo – anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – vicikicchāsahagatā khandhā ca moho ca saddhāya…pe… paññāya… kāyikassa sukhassa, kāyikassa dukkhassa phalasamāpattiyā mohassa ca upanissayapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – vicikicchāsahagatā khandhā ca moho ca vicikicchāsahagatānaṃ khandhānaṃ mohassa ca upanissayapaccayena paccayo. (3)"
    ],
    "innerText": "Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa upanissayapaccayena paccayo – anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – vicikicchāsahagatā khandhā ca moho ca vicikicchāsahagatānaṃ khandhānaṃ mohassa ca upanissayapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "92"
      },
      ". Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa dhammassa upanissayapaccayena ",
      " paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakatūpanissayo"
      },
      " – uddhaccasahagatā ",
      " khandhā ca moho ca dassanena pahātabbahetukassa rāgassa…pe… patthanāya upanissayapaccayena paccayo. (1)"
    ],
    "innerText": "92. Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa dhammassa upanissayapaccayena paccayo. Pakatūpanissayo – uddhaccasahagatā khandhā ca moho ca dassanena pahātabbahetukassa rāgassa…pe… patthanāya upanissayapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā bhāvanāya pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – uddhaccasahagatā khandhā ca moho ca bhāvanāya pahātabbahetukassa rāgassa…pe… patthanāya upanissayapaccayena paccayo. (2)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā bhāvanāya pahātabbahetukassa dhammassa upanissayapaccayena paccayo – anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – uddhaccasahagatā khandhā ca moho ca bhāvanāya pahātabbahetukassa rāgassa…pe… patthanāya upanissayapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – uddhaccasahagatā khandhā ca moho ",
      " ca saddhāya…pe… phalasamāpattiyā mohassa ca upanissayapaccayena paccayo. (3)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa upanissayapaccayena paccayo – anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – uddhaccasahagatā khandhā ca moho ca saddhāya…pe… phalasamāpattiyā mohassa ca upanissayapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa upanissayapaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakatūpanissayo"
      },
      " – uddhaccasahagatā khandhā ca moho ca vicikicchāsahagatānaṃ khandhānaṃ mohassa ca upanissayapaccayena paccayo. (4)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa upanissayapaccayena paccayo. Pakatūpanissayo – uddhaccasahagatā khandhā ca moho ca vicikicchāsahagatānaṃ khandhānaṃ mohassa ca upanissayapaccayena paccayo. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ",
      " ca dhammā bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa upanissayapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantarūpanissayo, pakatūpanissayo…pe…"
      },
      ". Pakatūpanissayo – uddhaccasahagatā khandhā ca moho ca uddhaccasahagatānaṃ khandhānaṃ mohassa ca upanissayapaccayena paccayo. (5)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa upanissayapaccayena paccayo – anantarūpanissayo, pakatūpanissayo…pe…. Pakatūpanissayo – uddhaccasahagatā khandhā ca moho ca uddhaccasahagatānaṃ khandhānaṃ mohassa ca upanissayapaccayena paccayo. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Purejātapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "93"
      },
      ". Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ, vatthupurejātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇapurejātaṃ"
      },
      " – cakkhuṃ aniccato…pe… vipassati, sotaṃ…pe… vatthuṃ aniccato…pe… vipassati; dibbena cakkhunā rūpaṃ passati, dibbāya sotadhātuyā saddaṃ suṇāti, rūpāyatanaṃ cakkhuviññāṇassa…pe… phoṭṭhabbāyatanaṃ kāyaviññāṇassa purejātapaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthupurejātaṃ"
      },
      " – cakkhāyatanaṃ cakkhuviññāṇassa…pe… kāyāyatanaṃ kāyaviññāṇassa…pe… vatthu nevadassanena nabhāvanāya pahātabbahetukānaṃ khandhānaṃ mohassa ca purejātapaccayena paccayo. (1)"
    ],
    "innerText": "93. Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ, vatthupurejātaṃ. Ārammaṇapurejātaṃ – cakkhuṃ aniccato…pe… vipassati, sotaṃ…pe… vatthuṃ aniccato…pe… vipassati; dibbena cakkhunā rūpaṃ passati, dibbāya sotadhātuyā saddaṃ suṇāti, rūpāyatanaṃ cakkhuviññāṇassa…pe… phoṭṭhabbāyatanaṃ kāyaviññāṇassa purejātapaccayena paccayo. Vatthupurejātaṃ – cakkhāyatanaṃ cakkhuviññāṇassa…pe… kāyāyatanaṃ kāyaviññāṇassa…pe… vatthu nevadassanena nabhāvanāya pahātabbahetukānaṃ khandhānaṃ mohassa ca purejātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ, vatthupurejātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇapurejātaṃ"
      },
      " – cakkhuṃ…pe… vatthuṃ assādeti abhinandati; taṃ ārabbha dassanena pahātabbahetuko rāgo…pe… diṭṭhi…pe… vicikicchā…pe… dassanena pahātabbahetukaṃ domanassaṃ uppajjati ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthupurejātaṃ"
      },
      " – vatthu dassanena pahātabbahetukānaṃ khandhānaṃ purejātapaccayena ",
      " paccayo. (2)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ, vatthupurejātaṃ. Ārammaṇapurejātaṃ – cakkhuṃ…pe… vatthuṃ assādeti abhinandati; taṃ ārabbha dassanena pahātabbahetuko rāgo…pe… diṭṭhi…pe… vicikicchā…pe… dassanena pahātabbahetukaṃ domanassaṃ uppajjati . Vatthupurejātaṃ – vatthu dassanena pahātabbahetukānaṃ khandhānaṃ purejātapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ, vatthupurejātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇapurejātaṃ"
      },
      " – cakkhuṃ…pe… vatthuṃ assādeti abhinandati; taṃ ārabbha bhāvanāya pahātabbahetuko rāgo uppajjati, uddhaccaṃ uppajjati, bhāvanāya pahātabbahetukaṃ domanassaṃ uppajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthupurejātaṃ"
      },
      " – vatthu bhāvanāya pahātabbahetukānaṃ khandhānaṃ purejātapaccayena paccayo. (3)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ, vatthupurejātaṃ. Ārammaṇapurejātaṃ – cakkhuṃ…pe… vatthuṃ assādeti abhinandati; taṃ ārabbha bhāvanāya pahātabbahetuko rāgo uppajjati, uddhaccaṃ uppajjati, bhāvanāya pahātabbahetukaṃ domanassaṃ uppajjati. Vatthupurejātaṃ – vatthu bhāvanāya pahātabbahetukānaṃ khandhānaṃ purejātapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ, vatthupurejātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇapurejātaṃ"
      },
      " – cakkhuṃ…pe… vatthuṃ ārabbha vicikicchāsahagatā khandhā ca moho ca uppajjanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthupurejātaṃ"
      },
      " – vatthu vicikicchāsahagatānaṃ khandhānaṃ mohassa ca purejātapaccayena paccayo. (4)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ, vatthupurejātaṃ. Ārammaṇapurejātaṃ – cakkhuṃ…pe… vatthuṃ ārabbha vicikicchāsahagatā khandhā ca moho ca uppajjanti. Vatthupurejātaṃ – vatthu vicikicchāsahagatānaṃ khandhānaṃ mohassa ca purejātapaccayena paccayo. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ, vatthupurejātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇapurejātaṃ"
      },
      " – cakkhuṃ…pe… vatthuṃ ārabbha uddhaccasahagatā ",
      " khandhā ca moho ca uppajjanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthupurejātaṃ"
      },
      " – vatthu ",
      " uddhaccasahagatānaṃ khandhānaṃ mohassa ca purejātapaccayena paccayo. (5)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa purejātapaccayena paccayo – ārammaṇapurejātaṃ, vatthupurejātaṃ. Ārammaṇapurejātaṃ – cakkhuṃ…pe… vatthuṃ ārabbha uddhaccasahagatā khandhā ca moho ca uppajjanti. Vatthupurejātaṃ – vatthu uddhaccasahagatānaṃ khandhānaṃ mohassa ca purejātapaccayena paccayo. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pacchājātapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "94"
      },
      ". Dassanena pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa pacchājātapaccayena paccayo – pacchājātā dassanena pahātabbahetukā khandhā purejātassa imassa kāyassa pacchājātapaccayena paccayo. (1)"
    ],
    "innerText": "94. Dassanena pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa pacchājātapaccayena paccayo – pacchājātā dassanena pahātabbahetukā khandhā purejātassa imassa kāyassa pacchājātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa pacchājātapaccayena paccayo – pacchājātā bhāvanāya ",
      " pahātabbahetukā khandhā purejātassa imassa kāyassa pacchājātapaccayena paccayo. (1)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa pacchājātapaccayena paccayo – pacchājātā bhāvanāya pahātabbahetukā khandhā purejātassa imassa kāyassa pacchājātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa pacchājātapaccayena paccayo – pacchājātā nevadassanena nabhāvanāya pahātabbahetukā khandhā purejātassa imassa kāyassa pacchājātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa pacchājātapaccayena paccayo – pacchājātā vicikicchāsahagatā khandhā ca moho ca purejātassa imassa kāyassa pacchājātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ",
      " ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa pacchājātapaccayena paccayo – pacchājātā uddhaccasahagatā khandhā ca moho ca purejātassa imassa kāyassa pacchājātapaccayena paccayo. (1)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa pacchājātapaccayena paccayo – pacchājātā uddhaccasahagatā khandhā ca moho ca purejātassa imassa kāyassa pacchājātapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Āsevanapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "95"
      },
      ". Dassanena ",
      " pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa āsevanapaccayena paccayo – purimā purimā dassanena pahātabbahetukā khandhā pacchimānaṃ pacchimānaṃ dassanena pahātabbahetukānaṃ khandhānaṃ āsevanapaccayena paccayo. (1)"
    ],
    "innerText": "95. Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa āsevanapaccayena paccayo – purimā purimā dassanena pahātabbahetukā khandhā pacchimānaṃ pacchimānaṃ dassanena pahātabbahetukānaṃ khandhānaṃ āsevanapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa āsevanapaccayena paccayo – purimā purimā vicikicchāsahagatā khandhā pacchimassa pacchimassa mohassa āsevanapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa āsevanapaccayena paccayo – purimā purimā vicikicchāsahagatā khandhā pacchimānaṃ ",
      " pacchimānaṃ vicikicchāsahagatānaṃ khandhānaṃ mohassa ca āsevanapaccayena paccayo."
    ],
    "innerText": "Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa āsevanapaccayena paccayo – purimā purimā vicikicchāsahagatā khandhā pacchimānaṃ pacchimānaṃ vicikicchāsahagatānaṃ khandhānaṃ mohassa ca āsevanapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa (saṃkhittaṃ) tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo…pe…. (Āsevanamūlake vuṭṭhānassapi āvajjanāyapi pahātabbaṃ, sattarasa pañhā paripuṇṇā, anantarasadisā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Kammapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "96"
      },
      ". Dassanena ",
      " pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa kammapaccayena paccayo – dassanena pahātabbahetukā cetanā sampayuttakānaṃ khandhānaṃ kammapaccayena paccayo. (1)"
    ],
    "innerText": "96. Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa kammapaccayena paccayo – dassanena pahātabbahetukā cetanā sampayuttakānaṃ khandhānaṃ kammapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa kammapaccayena paccayo – sahajātā, nānākkhaṇikā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātā"
      },
      " dassanena pahātabbahetukā cetanā mohassa cittasamuṭṭhānānañca rūpānaṃ kammapaccayena paccayo. Nānākkhaṇikā – dassanena ",
      " pahātabbahetukā cetanā vipākānaṃ khandhānaṃ kaṭattā ca rūpānaṃ kammapaccayena paccayo. (2)"
    ],
    "innerText": "Dassanena pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa kammapaccayena paccayo – sahajātā, nānākkhaṇikā. Sahajātā dassanena pahātabbahetukā cetanā mohassa cittasamuṭṭhānānañca rūpānaṃ kammapaccayena paccayo. Nānākkhaṇikā – dassanena pahātabbahetukā cetanā vipākānaṃ khandhānaṃ kaṭattā ca rūpānaṃ kammapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa kammapaccayena paccayo – dassanena pahātabbahetukā cetanā sampayuttakānaṃ khandhānaṃ mohassa ca cittasamuṭṭhānānañca rūpānaṃ kammapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "97"
      },
      ". Bhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa kammapaccayena paccayo – bhāvanāya pahātabbahetukā cetanā sampayuttakānaṃ khandhānaṃ kammapaccayena paccayo. (1)"
    ],
    "innerText": "97. Bhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa kammapaccayena paccayo – bhāvanāya pahātabbahetukā cetanā sampayuttakānaṃ khandhānaṃ kammapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa kammapaccayena paccayo – bhāvanāya pahātabbahetukā cetanā mohassa cittasamuṭṭhānānañca rūpānaṃ kammapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa kammapaccayena paccayo – bhāvanāya pahātabbahetukā cetanā sampayuttakānaṃ khandhānaṃ mohassa ca cittasamuṭṭhānānañca rūpānaṃ kammapaccayena paccayo. (3)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa kammapaccayena paccayo – bhāvanāya pahātabbahetukā cetanā sampayuttakānaṃ khandhānaṃ mohassa ca cittasamuṭṭhānānañca rūpānaṃ kammapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "98"
      },
      ". Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa kammapaccayena paccayo – sahajātā, nānākkhaṇikā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātā"
      },
      " – nevadassanena nabhāvanāya pahātabbahetukā cetanā sampayuttakānaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ kammapaccayena paccayo. Paṭisandhikkhaṇe…pe…. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānākkhaṇikā"
      },
      " – nevadassanena nabhāvanāya pahātabbahetukā cetanā vipākānaṃ khandhānaṃ kaṭattā ca rūpānaṃ kammapaccayena paccayo. (1)"
    ],
    "innerText": "98. Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa kammapaccayena paccayo – sahajātā, nānākkhaṇikā. Sahajātā – nevadassanena nabhāvanāya pahātabbahetukā cetanā sampayuttakānaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ kammapaccayena paccayo. Paṭisandhikkhaṇe…pe…. Nānākkhaṇikā – nevadassanena nabhāvanāya pahātabbahetukā cetanā vipākānaṃ khandhānaṃ kaṭattā ca rūpānaṃ kammapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Vipākapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "99"
      },
      ". Nevadassanena ",
      " nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa vipākapaccayena paccayo (pavattipaṭisandhi) vipākā khandhā vatthussa…pe…."
    ],
    "innerText": "99. Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa vipākapaccayena paccayo (pavattipaṭisandhi) vipākā khandhā vatthussa…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Āhārapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "100"
      },
      ". Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa āhārapaccayena paccayo – dassanena pahātabbahetukā āhārā sampayuttakānaṃ khandhānaṃ āhārapaccayena paccayo. (1)"
    ],
    "innerText": "100. Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa āhārapaccayena paccayo – dassanena pahātabbahetukā āhārā sampayuttakānaṃ khandhānaṃ āhārapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa āhārapaccayena paccayo – dassanena pahātabbahetukā āhārā ",
      " mohassa cittasamuṭṭhānānañca rūpānaṃ āhārapaccayena paccayo. (2)"
    ],
    "innerText": "Dassanena pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa āhārapaccayena paccayo – dassanena pahātabbahetukā āhārā mohassa cittasamuṭṭhānānañca rūpānaṃ āhārapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa āhārapaccayena paccayo – dassanena pahātabbahetukā āhārā sampayuttakānaṃ khandhānaṃ mohassa ca cittasamuṭṭhānānañca rūpānaṃ āhārapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetuko dhammo… tīṇi (dassanena sadisaṃ)."
    ],
    "innerText": "Bhāvanāya pahātabbahetuko dhammo… tīṇi (dassanena sadisaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa āhārapaccayena paccayo – nevadassanena nabhāvanāya pahātabbahetukā āhārā sampayuttakānaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ āhārapaccayena paccayo. Paṭisandhikkhaṇe…pe… kabaḷīkāro āhāro imassa kāyassa āhārapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Indriyapaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "101"
      },
      ". Dassanena ",
      " pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa indriyapaccayena paccayo… tīṇi (āhārasadisaṃ. Moho kātabbo)."
    ],
    "innerText": "101. Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa indriyapaccayena paccayo… tīṇi (āhārasadisaṃ. Moho kātabbo)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko dhammo… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa indriyapaccayena paccayo – nevadassanena nabhāvanāya pahātabbahetukā indriyā sampayuttakānaṃ khandhānaṃ…pe… cakkhundriyaṃ cakkhuviññāṇassa…pe… kāyindriyaṃ kāyaviññāṇassa…pe… rūpajīvitindriyaṃ kaṭattārūpānaṃ indriyapaccayena paccayo… jhānapaccayena paccayo… ",
      " maggapaccayena paccayo… (ime sahetukā kātabbā) sampayuttapaccayena paccayo (paṭiccavāre sampayuttavārasadisaṃ)."
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa indriyapaccayena paccayo – nevadassanena nabhāvanāya pahātabbahetukā indriyā sampayuttakānaṃ khandhānaṃ…pe… cakkhundriyaṃ cakkhuviññāṇassa…pe… kāyindriyaṃ kāyaviññāṇassa…pe… rūpajīvitindriyaṃ kaṭattārūpānaṃ indriyapaccayena paccayo… jhānapaccayena paccayo… maggapaccayena paccayo… (ime sahetukā kātabbā) sampayuttapaccayena paccayo (paṭiccavāre sampayuttavārasadisaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Vippayuttapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "102"
      },
      ". Dassanena pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa vippayuttapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahajātaṃ, pacchājātaṃ"
      },
      " (dassanattikasadisaṃ)."
    ],
    "innerText": "102. Dassanena pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa vippayuttapaccayena paccayo – sahajātaṃ, pacchājātaṃ (dassanattikasadisaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa vippayuttapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahajātaṃ, pacchājātaṃ"
      },
      " (dassanattikasadisaṃ)."
    ],
    "innerText": "Bhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa vippayuttapaccayena paccayo – sahajātaṃ, pacchājātaṃ (dassanattikasadisaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa vippayuttapaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahajātaṃ, purejātaṃ, pacchājātaṃ"
      },
      " (dassanattikasadisaṃ). Pacchājātā – nevadassanena ",
      " nabhāvanāya pahātabbahetukā khandhā ca moho ca purejātassa imassa kāyassa…pe…. (1)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa vippayuttapaccayena paccayo – sahajātaṃ, purejātaṃ, pacchājātaṃ (dassanattikasadisaṃ). Pacchājātā – nevadassanena nabhāvanāya pahātabbahetukā khandhā ca moho ca purejātassa imassa kāyassa…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa vippayuttapaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – vatthu dassanena pahātabbahetukānaṃ khandhānaṃ…pe…. (2)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa vippayuttapaccayena paccayo. Purejātaṃ – vatthu dassanena pahātabbahetukānaṃ khandhānaṃ…pe…. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa vippayuttapaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – vatthu bhāvanāya pahātabbahetukānaṃ khandhānaṃ…pe…. (3)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa vippayuttapaccayena paccayo. Purejātaṃ – vatthu bhāvanāya pahātabbahetukānaṃ khandhānaṃ…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ",
      " ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa vippayuttapaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – vatthu vicikicchāsahagatānaṃ khandhānaṃ mohassa ca vippayuttapaccayena paccayo. (4)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa vippayuttapaccayena paccayo. Purejātaṃ – vatthu vicikicchāsahagatānaṃ khandhānaṃ mohassa ca vippayuttapaccayena paccayo. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa vippayuttapaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – vatthu uddhaccasahagatānaṃ khandhānaṃ mohassa ca vippayuttapaccayena paccayo. (5)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa vippayuttapaccayena paccayo. Purejātaṃ – vatthu uddhaccasahagatānaṃ khandhānaṃ mohassa ca vippayuttapaccayena paccayo. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "103"
      },
      ". Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa vippayuttapaccayena paccayo – sahajātaṃ, pacchājātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātā"
      },
      " – vicikicchāsahagatā khandhā ca moho ca cittasamuṭṭhānānaṃ rūpānaṃ vippayuttapaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchājātā"
      },
      " – vicikicchāsahagatā khandhā ca moho ca purejātassa imassa kāyassa vippayuttapaccayena paccayo. (1)"
    ],
    "innerText": "103. Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa vippayuttapaccayena paccayo – sahajātaṃ, pacchājātaṃ. Sahajātā – vicikicchāsahagatā khandhā ca moho ca cittasamuṭṭhānānaṃ rūpānaṃ vippayuttapaccayena paccayo. Pacchājātā – vicikicchāsahagatā khandhā ca moho ca purejātassa imassa kāyassa vippayuttapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa vippayuttapaccayena paccayo – sahajātaṃ, pacchājātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātā"
      },
      " – uddhaccasahagatā khandhā ca moho ca cittasamuṭṭhānānaṃ rūpānaṃ…pe…. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchājātā"
      },
      " – uddhaccasahagatā khandhā ca moho ca purejātassa imassa kāyassa vippayuttapaccayena paccayo. (1)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa vippayuttapaccayena paccayo – sahajātaṃ, pacchājātaṃ. Sahajātā – uddhaccasahagatā khandhā ca moho ca cittasamuṭṭhānānaṃ rūpānaṃ…pe…. Pacchājātā – uddhaccasahagatā khandhā ca moho ca purejātassa imassa kāyassa vippayuttapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Atthipaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "104"
      },
      ". Dassanena ",
      " pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa atthipaccayena paccayo – dassanena pahātabbahetuko eko khandho tiṇṇannaṃ khandhānaṃ…pe…. (1)"
    ],
    "innerText": "104. Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa atthipaccayena paccayo – dassanena pahātabbahetuko eko khandho tiṇṇannaṃ khandhānaṃ…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena ",
      " pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa atthipaccayena paccayo – sahajātaṃ, pacchājātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātā"
      },
      " – dassanena pahātabbahetukā khandhā cittasamuṭṭhānānaṃ rūpānaṃ atthipaccayena paccayo. Sahajātā – vicikicchāsahagatā khandhā mohassa cittasamuṭṭhānānañca rūpānaṃ atthipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchājātā"
      },
      " – dassanena pahātabbahetukā khandhā purejātassa imassa kāyassa atthipaccayena paccayo. (2)"
    ],
    "innerText": "Dassanena pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa atthipaccayena paccayo – sahajātaṃ, pacchājātaṃ. Sahajātā – dassanena pahātabbahetukā khandhā cittasamuṭṭhānānaṃ rūpānaṃ atthipaccayena paccayo. Sahajātā – vicikicchāsahagatā khandhā mohassa cittasamuṭṭhānānañca rūpānaṃ atthipaccayena paccayo. Pacchājātā – dassanena pahātabbahetukā khandhā purejātassa imassa kāyassa atthipaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa atthipaccayena paccayo – dassanena pahātabbahetuko eko khandho tiṇṇannaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ atthipaccayena paccayo. Vicikicchāsahagato eko khandho tiṇṇannaṃ khandhānaṃ mohassa ca cittasamuṭṭhānānañca rūpānaṃ atthipaccayena paccayo…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko dhammo… tīṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "105"
      },
      ". Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ, pacchājātaṃ, āhāraṃ, indriyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajāto"
      },
      " – nevadassanena ",
      " nabhāvanāya pahātabbahetuko eko khandho tiṇṇannaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ atthipaccayena paccayo…pe… vicikicchāsahagato uddhaccasahagato moho cittasamuṭṭhānānaṃ rūpānaṃ atthipaccayena paccayo. Paṭisandhikkhaṇe…pe… asaññasattānaṃ…pe…. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – cakkhuṃ…pe… vatthuṃ aniccato…pe… dibbena cakkhunā rūpaṃ passati, dibbāya sotadhātuyā saddaṃ suṇāti, rūpāyatanaṃ cakkhuviññāṇassa…pe… phoṭṭhabbāyatanaṃ kāyaviññāṇassa…pe… cakkhāyatanaṃ…pe… kāyāyatanaṃ…pe… vatthu nevadassanena nabhāvanāya pahātabbahetukānaṃ khandhānaṃ mohassa ca atthipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchājātā"
      },
      " – nevadassanena nabhāvanāya pahātabbahetukā ",
      " khandhā ca moho ca purejātassa imassa kāyassa atthipaccayena paccayo; ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kabaḷīkāro āhāro"
      },
      " imassa kāyassa…pe… ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpajīvitindriyaṃ"
      },
      " kaṭattārūpānaṃ…pe…. (1)"
    ],
    "innerText": "105. Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ, pacchājātaṃ, āhāraṃ, indriyaṃ. Sahajāto – nevadassanena nabhāvanāya pahātabbahetuko eko khandho tiṇṇannaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ atthipaccayena paccayo…pe… vicikicchāsahagato uddhaccasahagato moho cittasamuṭṭhānānaṃ rūpānaṃ atthipaccayena paccayo. Paṭisandhikkhaṇe…pe… asaññasattānaṃ…pe…. Purejātaṃ – cakkhuṃ…pe… vatthuṃ aniccato…pe… dibbena cakkhunā rūpaṃ passati, dibbāya sotadhātuyā saddaṃ suṇāti, rūpāyatanaṃ cakkhuviññāṇassa…pe… phoṭṭhabbāyatanaṃ kāyaviññāṇassa…pe… cakkhāyatanaṃ…pe… kāyāyatanaṃ…pe… vatthu nevadassanena nabhāvanāya pahātabbahetukānaṃ khandhānaṃ mohassa ca atthipaccayena paccayo. Pacchājātā – nevadassanena nabhāvanāya pahātabbahetukā khandhā ca moho ca purejātassa imassa kāyassa atthipaccayena paccayo; kabaḷīkāro āhāro imassa kāyassa…pe… rūpajīvitindriyaṃ kaṭattārūpānaṃ…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa atthipaccayena ",
      " paccayo – sahajātaṃ, purejātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajāto"
      },
      " – vicikicchāsahagato moho sampayuttakānaṃ khandhānaṃ atthipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – cakkhuṃ…pe… vatthuṃ assādeti abhinandati; taṃ ārabbha dassanena pahātabbahetuko rāgo uppajjati, diṭṭhi uppajjati, vicikicchā uppajjati, dassanena pahātabbahetukaṃ domanassaṃ uppajjati, vatthu dassanena pahātabbahetukānaṃ khandhānaṃ atthipaccayena paccayo. (2)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ. Sahajāto – vicikicchāsahagato moho sampayuttakānaṃ khandhānaṃ atthipaccayena paccayo. Purejātaṃ – cakkhuṃ…pe… vatthuṃ assādeti abhinandati; taṃ ārabbha dassanena pahātabbahetuko rāgo uppajjati, diṭṭhi uppajjati, vicikicchā uppajjati, dassanena pahātabbahetukaṃ domanassaṃ uppajjati, vatthu dassanena pahātabbahetukānaṃ khandhānaṃ atthipaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajāto"
      },
      " – uddhaccasahagato moho sampayuttakānaṃ khandhānaṃ atthipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – cakkhuṃ…pe… vatthuṃ assādeti abhinandati…pe… vatthu bhāvanāya pahātabbahetukānaṃ khandhānaṃ atthipaccayena paccayo. (3)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ. Sahajāto – uddhaccasahagato moho sampayuttakānaṃ khandhānaṃ atthipaccayena paccayo. Purejātaṃ – cakkhuṃ…pe… vatthuṃ assādeti abhinandati…pe… vatthu bhāvanāya pahātabbahetukānaṃ khandhānaṃ atthipaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajāto"
      },
      " – vicikicchāsahagato moho sampayuttakānaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ atthipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – cakkhuṃ ārabbha vicikicchāsahagatā khandhā ca moho ca uppajjanti…pe… vatthuṃ ārabbha…pe… vatthu vicikicchāsahagatānaṃ khandhānaṃ mohassa ca atthipaccayena paccayo. (4)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ. Sahajāto – vicikicchāsahagato moho sampayuttakānaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ atthipaccayena paccayo. Purejātaṃ – cakkhuṃ ārabbha vicikicchāsahagatā khandhā ca moho ca uppajjanti…pe… vatthuṃ ārabbha…pe… vatthu vicikicchāsahagatānaṃ khandhānaṃ mohassa ca atthipaccayena paccayo. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajāto"
      },
      " – uddhaccasahagato moho sampayuttakānaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ atthipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purejātaṃ"
      },
      " – cakkhuṃ ārabbha uddhaccasahagatā ",
      " khandhā ca moho ca uppajjanti…pe… vatthuṃ ārabbha…pe… vatthu uddhaccasahagatānaṃ khandhānaṃ mohassa ca atthipaccayena paccayo. (5)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ. Sahajāto – uddhaccasahagato moho sampayuttakānaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ atthipaccayena paccayo. Purejātaṃ – cakkhuṃ ārabbha uddhaccasahagatā khandhā ca moho ca uppajjanti…pe… vatthuṃ ārabbha…pe… vatthu uddhaccasahagatānaṃ khandhānaṃ mohassa ca atthipaccayena paccayo. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "106"
      },
      ". Dassanena ",
      " pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa dhammassa atthipaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahajātaṃ, purejātaṃ"
      },
      ". Sahajāto – dassanena pahātabbahetuko eko khandho ca vatthu ca tiṇṇannaṃ khandhānaṃ atthipaccayena paccayo ",
      " …pe… dve khandhā…pe… vicikicchāsahagato eko khandho ca moho ca tiṇṇannaṃ khandhānaṃ atthipaccayena paccayo…pe… dve khandhā…pe…. (1)"
    ],
    "innerText": "106. Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ. Sahajāto – dassanena pahātabbahetuko eko khandho ca vatthu ca tiṇṇannaṃ khandhānaṃ atthipaccayena paccayo …pe… dve khandhā…pe… vicikicchāsahagato eko khandho ca moho ca tiṇṇannaṃ khandhānaṃ atthipaccayena paccayo…pe… dve khandhā…pe…. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ, pacchājātaṃ, āhāraṃ, indriyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātā"
      },
      " – dassanena pahātabbahetukā khandhā ca mahābhūtā ca cittasamuṭṭhānānaṃ rūpānaṃ atthipaccayena paccayo. Sahajātā – vicikicchāsahagatā khandhā ca moho ca cittasamuṭṭhānānaṃ rūpānaṃ atthipaccayena paccayo. Sahajātā – vicikicchāsahagatā khandhā ca vatthu ca mohassa atthipaccayena paccayo. Pacchājātā – vicikicchāsahagatā khandhā ca moho ca purejātassa imassa kāyassa atthipaccayena paccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchājātā"
      },
      " – dassanena pahātabbahetukā khandhā ca kabaḷīkāro āhāro ca imassa kāyassa atthipaccayena paccayo. Pacchājātā – dassanena pahātabbahetukā khandhā ca rūpajīvitindriyañca kaṭattārūpānaṃ atthipaccayena paccayo. (2)"
    ],
    "innerText": "Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ, pacchājātaṃ, āhāraṃ, indriyaṃ. Sahajātā – dassanena pahātabbahetukā khandhā ca mahābhūtā ca cittasamuṭṭhānānaṃ rūpānaṃ atthipaccayena paccayo. Sahajātā – vicikicchāsahagatā khandhā ca moho ca cittasamuṭṭhānānaṃ rūpānaṃ atthipaccayena paccayo. Sahajātā – vicikicchāsahagatā khandhā ca vatthu ca mohassa atthipaccayena paccayo. Pacchājātā – vicikicchāsahagatā khandhā ca moho ca purejātassa imassa kāyassa atthipaccayena paccayo. Pacchājātā – dassanena pahātabbahetukā khandhā ca kabaḷīkāro āhāro ca imassa kāyassa atthipaccayena paccayo. Pacchājātā – dassanena pahātabbahetukā khandhā ca rūpajīvitindriyañca kaṭattārūpānaṃ atthipaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena ",
      " pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa atthipaccayena paccayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahajātaṃ, purejātaṃ"
      },
      ". Sahajāto – vicikicchāsahagato eko khandho ca vatthu ca tiṇṇannaṃ khandhānaṃ mohassa ca atthipaccayena paccayo…pe… dve khandhā…pe… vicikicchāsahagato eko khandho ca moho ca tiṇṇannaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ atthipaccayena paccayo…pe… dve khandhā ca moho ca…pe…. (3)"
    ],
    "innerText": "Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa atthipaccayena paccayo – sahajātaṃ, purejātaṃ. Sahajāto – vicikicchāsahagato eko khandho ca vatthu ca tiṇṇannaṃ khandhānaṃ mohassa ca atthipaccayena paccayo…pe… dve khandhā…pe… vicikicchāsahagato eko khandho ca moho ca tiṇṇannaṃ khandhānaṃ cittasamuṭṭhānānañca rūpānaṃ atthipaccayena paccayo…pe… dve khandhā ca moho ca…pe…. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya ",
      " pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā bhāvanāya pahātabbahetukassa dhammassa atthipaccayena paccayo (saṃkhittaṃ. Tisso pañhā, dassanena nayena vibhajitabbā, ‘‘uddhacca’’nti niyāmetabbaṃ) natthipaccayena paccayo… vigatapaccayena paccayo… avigatapaccayena paccayo…."
    ],
    "innerText": "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā bhāvanāya pahātabbahetukassa dhammassa atthipaccayena paccayo (saṃkhittaṃ. Tisso pañhā, dassanena nayena vibhajitabbā, ‘‘uddhacca’’nti niyāmetabbaṃ) natthipaccayena paccayo… vigatapaccayena paccayo… avigatapaccayena paccayo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paccayānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Saṅkhyāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Suddhaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "107"
      },
      ". Hetuyā ",
      " ekādasa, ārammaṇe ekavīsa, adhipatiyā dasa, anantare sattarasa, samanantare sattarasa, sahajāte sattarasa, aññamaññe ekādasa, nissaye sattarasa, upanissaye ekavīsa, purejāte pañca, pacchājāte pañca, āsevane sattarasa, kamme satta, vipāke ekaṃ, āhāre satta, indriye satta, jhāne satta, magge satta, sampayutte ekādasa, vippayutte nava, atthiyā sattarasa, natthiyā sattarasa, vigate sattarasa, avigate sattarasa (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "107. Hetuyā ekādasa, ārammaṇe ekavīsa, adhipatiyā dasa, anantare sattarasa, samanantare sattarasa, sahajāte sattarasa, aññamaññe ekādasa, nissaye sattarasa, upanissaye ekavīsa, purejāte pañca, pacchājāte pañca, āsevane sattarasa, kamme satta, vipāke ekaṃ, āhāre satta, indriye satta, jhāne satta, magge satta, sampayutte ekādasa, vippayutte nava, atthiyā sattarasa, natthiyā sattarasa, vigate sattarasa, avigate sattarasa (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anulomaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Paccanīyuddhāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "108"
      },
      ". Dassanena ",
      " pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo. (1)"
    ],
    "innerText": "108. Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo… pacchājātapaccayena paccayo… kammapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "109"
      },
      ". Bhāvanāya ",
      " pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo. (1)"
    ],
    "innerText": "109. Bhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… upanissayapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo… pacchājātapaccayena ",
      " paccayo. (3)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo… pacchājātapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo… upanissayapaccayena paccayo. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "110"
      },
      ". Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo… purejātapaccayena paccayo… pacchājātapaccayena paccayo… kammapaccayena paccayo… āhārapaccayena paccayo… indriyapaccayena paccayo. (1)"
    ],
    "innerText": "110. Nevadassanena nabhāvanāya pahātabbahetuko dhammo nevadassanena nabhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo… purejātapaccayena paccayo… pacchājātapaccayena paccayo… kammapaccayena paccayo… āhārapaccayena paccayo… indriyapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo… purejātapaccayena paccayo. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevadassanena ",
      " nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena ",
      " paccayo… sahajātapaccayena ",
      " paccayo… upanissayapaccayena paccayo… purejātapaccayena paccayo. (3)"
    ],
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo… purejātapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo… purejātapaccayena paccayo. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nevadassanena nabhāvanāya pahātabbahetuko dhammo bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo… purejātapaccayena paccayo. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "111"
      },
      ". Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo. (1)"
    ],
    "innerText": "111. Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Idha sahajātaṃ, purejātaṃ, missagataṃ atthi, pāḷiyaṃ kātabbaṃ. Gaṇanāya upadhāretvā gaṇetabbaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa sahajātaṃ, purejātaṃ, pacchājātaṃ, āhāraṃ, indriyaṃ. (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Idhāpi ārammaṇapaccayā upanissayapaccayā atthi, pāḷiyaṃ natthi. Gaṇentena upadhāretvā gaṇetabbaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassanena ",
      " pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo. (3)"
    ],
    "innerText": "Dassanena pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo. (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "(Idhāpi ",
      " ‘‘sahajātaṃ, purejātaṃ’’ yaṃ missakapañhā atthi, pāḷiyaṃ kātabbaṃ)."
    ],
    "innerText": "(Idhāpi ‘‘sahajātaṃ, purejātaṃ’’ yaṃ missakapañhā atthi, pāḷiyaṃ kātabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "112"
      },
      ". Bhāvanāya ",
      " pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… upanissayapaccayena paccayo. (1)"
    ],
    "innerText": "112. Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… upanissayapaccayena paccayo. (1)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā bhāvanāya pahātabbahetukassa dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo (idhāpi ‘‘sahajātaṃ, purejātaṃ’’ yaṃ missakapañhā atthi ). (2)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā nevadassanena nabhāvanāya pahātabbahetukassa dhammassa sahajātaṃ, purejātaṃ, pacchājātaṃ, āhāraṃ, indriyaṃ (idhāpi ārammaṇaupanissayā atthi). (3)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa ca nevadassanena ",
      " nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo… upanissayapaccayena paccayo. (4)"
    ],
    "innerText": "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā dassanena pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo… upanissayapaccayena paccayo. (4)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhāvanāya pahātabbahetuko ca nevadassanena nabhāvanāya pahātabbahetuko ca dhammā bhāvanāya pahātabbahetukassa ca nevadassanena nabhāvanāya pahātabbahetukassa ca dhammassa ārammaṇapaccayena paccayo… sahajātapaccayena paccayo… upanissayapaccayena paccayo. (5)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Idhāpi sahajātaṃ, purejātaṃ atthi. Ye te pañhā na likhitā, te pāḷiyaṃ gaṇentānaṃ byañjanena na samenti. Te pāḷiyaṃ na likhitā gaṇanā pākaṭā honti. Yadi saṃsayo uppajjati, anulome atthipaccaye pekkhitabbaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Paccayapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Saṅkhyāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Suddhaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "113"
      },
      ". Nahetuyā ",
      " ekavīsa, naārammaṇe naadhipatiyā naanantare nasamanantare nasahajāte naaññamaññe nanissaye naupanissaye napurejāte ",
      " napacchājāte naāsevane nakamme navipāke naāhāre naindriye najhāne namagge nasampayutte navippayutte noatthiyā nonatthiyā novigate noavigate sabbattha ekavīsa (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "113. Nahetuyā ekavīsa, naārammaṇe naadhipatiyā naanantare nasamanantare nasahajāte naaññamaññe nanissaye naupanissaye napurejāte napacchājāte naāsevane nakamme navipāke naāhāre naindriye najhāne namagge nasampayutte navippayutte noatthiyā nonatthiyā novigate noavigate sabbattha ekavīsa (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccanīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Paccayānulomapaccanīyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "114"
      },
      ". Hetupaccayā naārammaṇe ekādasa, naadhipatiyā naanantare nasamanantare ekādasa, naaññamaññe tīṇi, naupanissaye napurejāte napacchājāte naāsevane nakamme navipāke naāhāre naindriye najhāne namagge ekādasa, nasampayutte tīṇi, navippayutte pañca ",
      ", nonatthiyā ekādasa, novigate ekādasa (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "114. Hetupaccayā naārammaṇe ekādasa, naadhipatiyā naanantare nasamanantare ekādasa, naaññamaññe tīṇi, naupanissaye napurejāte napacchājāte naāsevane nakamme navipāke naāhāre naindriye najhāne namagge ekādasa, nasampayutte tīṇi, navippayutte pañca , nonatthiyā ekādasa, novigate ekādasa (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anulomapaccanīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4. Paccayapaccanīyānulomaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nahetudukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "115"
      },
      ". Nahetupaccayā ",
      " ārammaṇe ekavīsa, adhipatiyā dasa, anantare sattarasa, samanantare sattarasa, sahajāte sattarasa, aññamaññe ekādasa, nissaye sattarasa, upanissaye ekavīsa, purejāte pañca, pacchājāte pañca, āsevane sattarasa, kamme satta, vipāke ekaṃ, āhāre satta, indriye satta, jhāne satta, magge satta, sampayutte ekādasa, vippayutte nava, atthiyā sattarasa, natthiyā sattarasa, vigate sattarasa, avigate sattarasa (evaṃ gaṇetabbaṃ)."
    ],
    "innerText": "115. Nahetupaccayā ārammaṇe ekavīsa, adhipatiyā dasa, anantare sattarasa, samanantare sattarasa, sahajāte sattarasa, aññamaññe ekādasa, nissaye sattarasa, upanissaye ekavīsa, purejāte pañca, pacchājāte pañca, āsevane sattarasa, kamme satta, vipāke ekaṃ, āhāre satta, indriye satta, jhāne satta, magge satta, sampayutte ekādasa, vippayutte nava, atthiyā sattarasa, natthiyā sattarasa, vigate sattarasa, avigate sattarasa (evaṃ gaṇetabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccanīyānulomaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañhāvāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dassanenapahātabbahetukattikaṃ niṭṭhitaṃ."
  }
]