[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Dukamātikāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1-6"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mūlaṭṭhenā"
      },
      "ti suppatiṭṭhitabhāvasādhanena mūlabhāvena, na paccayamattaṭṭhena hetudhammā hetū dhammāti samāsāsamāsaniddesabhāvo dvinnaṃ pāṭhānaṃ viseso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathevā"
      },
      "ti sampayogatova. Sahetukānaṃ hetusampayuttabhāvato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sampayogato’’"
      },
      "ti vuttanti veditabbaṃ, na sahasaddassa sampayogatthattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saha"
      },
      "-saddo pana ekapuñje uppādato yāva bhaṅgā sahetukānaṃ hetūhi samānadesagahaṇānaṃ hetuādisabbhāvaṃ dīpeti, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampayutta"
      },
      "-saddo ekuppādādivasena saha hetūhi ekībhāvupagamanaṃ, tato eva ca dvinnaṃ dukānaṃ nānattaṃ veditabbaṃ. Dhammanānattābhāvepi hi padatthanānattena dukantaraṃ vuccati. Na hi hetudukasaṅgahitehi dhammehi aññe sahetukadukādīhi vuccanti, te eva pana sahetukāhetukādibhāvato sahetukadukādīhi vuttā. Evaṃ sahetukadukasaṅgahitā eva hetusampayuttavippayuttabhāvato hetusampayuttadukena vuttā. Na hi dhammānaṃ avuttatāpekkhaṃ dukantaravacananti natthi punaruttidoso. Desetabbappakārajānanañhi desanāvilāso tathā desanāñāṇañcāti. Tena dhammānaṃ tappakāratā vuttā hoti. Sakalekadesavasena paṭhamadukaṃ dutiyatatiyehi saddhiṃ yojetvā catutthādayo tayo dukā vuttā. Sakalañhi paṭhamadukaṃ dutiyadukekadesena sahetukapadena tatiyadukekadesena hetusampayuttapadena ca yojetvā yathākkamaṃ catutthapañcamadukā vuttā, tathā paṭhamadukekadesaṃ nahetupadaṃ sakalena dutiyadukena yojetvā chaṭṭhaduko vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idampi sambhavatī"
      },
      "ti etena avuttampi sambhavavasena dīpitanti dasseti. Sambhavo hi gahaṇassa kāraṇanti. Yathā hetusahetukāti idaṃ sambhavatīti katvā gahitaṃ, evaṃ hetuahetukāti idampi sambhavatīti katvā gahetabbamevāti evaṃ aññatthāpi yojetabbaṃ."
    ],
    "innerText": "1-6.Mūlaṭṭhenāti suppatiṭṭhitabhāvasādhanena mūlabhāvena, na paccayamattaṭṭhena hetudhammā hetū dhammāti samāsāsamāsaniddesabhāvo dvinnaṃ pāṭhānaṃ viseso. Tathevāti sampayogatova. Sahetukānaṃ hetusampayuttabhāvato ‘‘sampayogato’’ti vuttanti veditabbaṃ, na sahasaddassa sampayogatthattā. Saha-saddo pana ekapuñje uppādato yāva bhaṅgā sahetukānaṃ hetūhi samānadesagahaṇānaṃ hetuādisabbhāvaṃ dīpeti, sampayutta-saddo ekuppādādivasena saha hetūhi ekībhāvupagamanaṃ, tato eva ca dvinnaṃ dukānaṃ nānattaṃ veditabbaṃ. Dhammanānattābhāvepi hi padatthanānattena dukantaraṃ vuccati. Na hi hetudukasaṅgahitehi dhammehi aññe sahetukadukādīhi vuccanti, te eva pana sahetukāhetukādibhāvato sahetukadukādīhi vuttā. Evaṃ sahetukadukasaṅgahitā eva hetusampayuttavippayuttabhāvato hetusampayuttadukena vuttā. Na hi dhammānaṃ avuttatāpekkhaṃ dukantaravacananti natthi punaruttidoso. Desetabbappakārajānanañhi desanāvilāso tathā desanāñāṇañcāti. Tena dhammānaṃ tappakāratā vuttā hoti. Sakalekadesavasena paṭhamadukaṃ dutiyatatiyehi saddhiṃ yojetvā catutthādayo tayo dukā vuttā. Sakalañhi paṭhamadukaṃ dutiyadukekadesena sahetukapadena tatiyadukekadesena hetusampayuttapadena ca yojetvā yathākkamaṃ catutthapañcamadukā vuttā, tathā paṭhamadukekadesaṃ nahetupadaṃ sakalena dutiyadukena yojetvā chaṭṭhaduko vutto. Idampi sambhavatīti etena avuttampi sambhavavasena dīpitanti dasseti. Sambhavo hi gahaṇassa kāraṇanti. Yathā hetusahetukāti idaṃ sambhavatīti katvā gahitaṃ, evaṃ hetuahetukāti idampi sambhavatīti katvā gahetabbamevāti evaṃ aññatthāpi yojetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " paṭhamadukaṃ dutiyatatiyadukesu dutiyapadehi yojetvā ‘‘hetū ceva dhammā ahetukā ca, ahetukā ceva dhammā na ca hetū, hetū ceva dhammā hetuvippayuttā ca, hetuvippayuttā ceva dhammā na ca hetū’’ti ye dve dukā kātabbā, tesaṃ sambhavavaseneva saṅgahaṃ dassetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kho pana"
      },
      "-padena aparesampi dukānaṃ saṅgahaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tatra yadeta’’"
      },
      "ntiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatrā"
      },
      "ti pāḷiyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ atirekattho"
      },
      "ti idāni yaṃ vakkhati, tamatthamāha. Tattha pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññepi aññathāpī"
      },
      "ti etesaṃ visuṃ pavattiyā dve dukā dassitā, saha pavattiyā pana ayampi duko veditabbo ‘‘hetū ceva dhammā hetusampayuttāpi hetuvippayuttāpī’’ti, etesu pana pañcasu dukesu dutiyadukena tatiyaduko viya, catutthadukena pañcamaduko viya ca chaṭṭhadukena ninnānatthattā ‘‘na hetu kho pana dhammā hetusampayuttāpi hetuvippayuttāpī’’ti ayaṃ duko na vutto. Dassitaninnānatthanayo hi so purimadukehīti. Itaresu catūsu hetū ceva ahetukadukena samānatthattā hetū ceva hetuvippayuttaduko, hetusahetukadukena samānatthattā hetuhetusampayuttaduko ca nahetuhetusampayuttaduko viya na vattabbo. Tesu pana dvīsu pacchimaduke ‘‘hetū kho pana dhammā sahetukā’’ti padaṃ catutthaduke paṭhamapadena ninnānākaraṇattā ",
      " na vattabbaṃ, ‘‘hetū kho pana dhammā ahetukā’’ti padaṃ ‘‘hetū ceva dhammā ahetukā’’ti etena ninnānattā na vattabbaṃ. Avasiṭṭhe pana ekasmiṃ duke ‘‘ahetukā ceva dhammā na ca hetū’’ti padaṃ chaṭṭhaduke dutiyapadena ekatthattā na vattabbaṃ. Idāni ‘‘hetū ceva dhammā ahetukā cā’’ti idamevekaṃ padaṃ avasiṭṭhaṃ, na ca ekena padena duko hotīti tañca na vuttanti. Catutthaduke dutiyapadena pana samānatthassa chaṭṭhaduke paṭhamapadassa vacanaṃ dukapūraṇatthaṃ, etena vā gatidassanena sabbassa sambhavantassa saṅgaho katoti daṭṭhabbo. Tathā hi sabbo sambhavaduko paṭhamaduke dutiyatatiyadukapakkhepena dassito, tesu ca paṭhamadukapakkhepenāti."
    ],
    "innerText": "Evaṃ paṭhamadukaṃ dutiyatatiyadukesu dutiyapadehi yojetvā ‘‘hetū ceva dhammā ahetukā ca, ahetukā ceva dhammā na ca hetū, hetū ceva dhammā hetuvippayuttā ca, hetuvippayuttā ceva dhammā na ca hetū’’ti ye dve dukā kātabbā, tesaṃ sambhavavaseneva saṅgahaṃ dassetvā kho pana-padena aparesampi dukānaṃ saṅgahaṃ dassetuṃ ‘‘tatra yadeta’’ntiādimāha. Tatrāti pāḷiyaṃ. Ayaṃ atirekatthoti idāni yaṃ vakkhati, tamatthamāha. Tattha pana aññepi aññathāpīti etesaṃ visuṃ pavattiyā dve dukā dassitā, saha pavattiyā pana ayampi duko veditabbo ‘‘hetū ceva dhammā hetusampayuttāpi hetuvippayuttāpī’’ti, etesu pana pañcasu dukesu dutiyadukena tatiyaduko viya, catutthadukena pañcamaduko viya ca chaṭṭhadukena ninnānatthattā ‘‘na hetu kho pana dhammā hetusampayuttāpi hetuvippayuttāpī’’ti ayaṃ duko na vutto. Dassitaninnānatthanayo hi so purimadukehīti. Itaresu catūsu hetū ceva ahetukadukena samānatthattā hetū ceva hetuvippayuttaduko, hetusahetukadukena samānatthattā hetuhetusampayuttaduko ca nahetuhetusampayuttaduko viya na vattabbo. Tesu pana dvīsu pacchimaduke ‘‘hetū kho pana dhammā sahetukā’’ti padaṃ catutthaduke paṭhamapadena ninnānākaraṇattā na vattabbaṃ, ‘‘hetū kho pana dhammā ahetukā’’ti padaṃ ‘‘hetū ceva dhammā ahetukā’’ti etena ninnānattā na vattabbaṃ. Avasiṭṭhe pana ekasmiṃ duke ‘‘ahetukā ceva dhammā na ca hetū’’ti padaṃ chaṭṭhaduke dutiyapadena ekatthattā na vattabbaṃ. Idāni ‘‘hetū ceva dhammā ahetukā cā’’ti idamevekaṃ padaṃ avasiṭṭhaṃ, na ca ekena padena duko hotīti tañca na vuttanti. Catutthaduke dutiyapadena pana samānatthassa chaṭṭhaduke paṭhamapadassa vacanaṃ dukapūraṇatthaṃ, etena vā gatidassanena sabbassa sambhavantassa saṅgaho katoti daṭṭhabbo. Tathā hi sabbo sambhavaduko paṭhamaduke dutiyatatiyadukapakkhepena dassito, tesu ca paṭhamadukapakkhepenāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7-13"
      },
      ". Samānakālena asamānakālena kālavimuttena ca paccayena nipphannānaṃ paccayāyattānaṃ paccayabhāvamattena tesaṃ paccayānaṃ atthitaṃ dīpetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sappaccaya"
      },
      "vacanaṃ, na sahetukavacanaṃ viya samānakālānameva, nāpi sanidassanaṃ viya taṃsabhāvassa anatthantarabhūtassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhata"
      },
      "-saddo pana sametehi ",
      " nipphāditabhāvaṃ dīpetīti ayametesaṃ viseso dukantaravacane kāraṇaṃ. Ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appaccayā asaṅkhatā"
      },
      "ti bahuvacananiddeso avinicchitatthaparicchedadassanavasena mātikāṭhapanato katoti veditabbo. Uddesena hi kusalādisabhāvānaṃ dhammānaṃ atthitāmattaṃ vuccati, na paricchedoti aparicchedena bahuvacanena uddeso vuttoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpa"
      },
      "nti rūpāyatanaṃ pathaviyādi vā. Purimasmiṃ atthavikappe rūpāyatanassa asaṅgahitatā āpajjatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ruppanalakkhaṇaṃ vā rūpa"
      },
      "nti ayaṃ atthanayo vutto. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpa"
      },
      "nti ruppanasabhāvo. Na lujjati na palujjatīti yo gahito tathā na hoti, so lokoti taṃgahaṇarahitānaṃ lokuttarānaṃ natthi lokatā. Dukkhasaccaṃ vā loko, tattha teneva lokasabhāvena viditāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokiyā"
      },
      "."
    ],
    "innerText": "7-13. Samānakālena asamānakālena kālavimuttena ca paccayena nipphannānaṃ paccayāyattānaṃ paccayabhāvamattena tesaṃ paccayānaṃ atthitaṃ dīpetuṃ sappaccayavacanaṃ, na sahetukavacanaṃ viya samānakālānameva, nāpi sanidassanaṃ viya taṃsabhāvassa anatthantarabhūtassa. Saṅkhata-saddo pana sametehi nipphāditabhāvaṃ dīpetīti ayametesaṃ viseso dukantaravacane kāraṇaṃ. Ettha ca appaccayā asaṅkhatāti bahuvacananiddeso avinicchitatthaparicchedadassanavasena mātikāṭhapanato katoti veditabbo. Uddesena hi kusalādisabhāvānaṃ dhammānaṃ atthitāmattaṃ vuccati, na paricchedoti aparicchedena bahuvacanena uddeso vuttoti. Rūpanti rūpāyatanaṃ pathaviyādi vā. Purimasmiṃ atthavikappe rūpāyatanassa asaṅgahitatā āpajjatīti ruppanalakkhaṇaṃ vā rūpanti ayaṃ atthanayo vutto. Tattha rūpanti ruppanasabhāvo. Na lujjati na palujjatīti yo gahito tathā na hoti, so lokoti taṃgahaṇarahitānaṃ lokuttarānaṃ natthi lokatā. Dukkhasaccaṃ vā loko, tattha teneva lokasabhāvena viditāti lokiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ sante cakkhuviññāṇena vijānitabbassa rūpāyatanassa teneva navijānitabbassa saddāyatanādikassa ca nānattā dvinnampi padānaṃ atthanānattato duko hoti. Evaṃ pana duke vuccamāne dukabahutā āpajjati, yattakāni viññāṇāni, tattakā dukā vuttā samattā ṭhapetvā sabbadhammārammaṇāni viññāṇāni. Tesu ca dukassa pacchedo āpajjati, tathā ca sati ‘‘kenacī’’ti padaṃ sabbaviññāṇasaṅgāhakaṃ na siyā, niddesena ca viruddhaṃ idaṃ vacanaṃ. Yo ca tattha ‘‘ye te dhammā cakkhuviññeyyā, na te dhammā sotaviññeyyāti ayaṃ duko na hotī’’ti paṭisedho kato, so ca kathaṃ yujjeyya. Na hi samatthā aṭṭhakathā pāḷiṃ paṭisedhetunti, na ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kenaci"
      },
      "-saddassa tenevāti ayaṃ padattho sambhavati, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kenacī’’"
      },
      "ti etassa ādipadassa aniyamitaṃ yaṃ ",
      " kiñci ekaṃ padattho, taṃ vatvā vuccamānassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kenacī’’"
      },
      "ti dutiyapadassa yaṃ kiñci aparaṃ aniyamitaṃ padatthoti lokasiddhametaṃ, tatheva ca niddeso pavatto, na cettha viññātabbadhammabhedena dukabhedo samatto āpajjati yattakā viññātabbā, tattakā dukāti, tasmā natthi dukabahutā. Na hi ekaṃyeva viññātabbaṃ kenaci viññeyyaṃ kenaci na viññeyyañca, kintu aparampi aparampīti sabbaviññātabbasaṅgahe duko samatto hoti, evañca sati ‘‘kenacī’’ti padaṃ aniyamena sabbaviññāṇasaṅgāhakanti siddhaṃ hoti, viññāṇanānattena ca viññātabbaṃ bhinditvā ayaṃ duko vutto, na viññātabbānaṃ atthantaratāyāti. Etassa pana dukassa nikkheparāsiniddeso dukasaṅgahitadhammekadesesu ",
      " dukapadadvayappavattidassanavasena pavatto. Atthuddhāraniddeso niravasesadukasaṅgahitadhammadassanavasenāti veditabbo."
    ],
    "innerText": "Evaṃ sante cakkhuviññāṇena vijānitabbassa rūpāyatanassa teneva navijānitabbassa saddāyatanādikassa ca nānattā dvinnampi padānaṃ atthanānattato duko hoti. Evaṃ pana duke vuccamāne dukabahutā āpajjati, yattakāni viññāṇāni, tattakā dukā vuttā samattā ṭhapetvā sabbadhammārammaṇāni viññāṇāni. Tesu ca dukassa pacchedo āpajjati, tathā ca sati ‘‘kenacī’’ti padaṃ sabbaviññāṇasaṅgāhakaṃ na siyā, niddesena ca viruddhaṃ idaṃ vacanaṃ. Yo ca tattha ‘‘ye te dhammā cakkhuviññeyyā, na te dhammā sotaviññeyyāti ayaṃ duko na hotī’’ti paṭisedho kato, so ca kathaṃ yujjeyya. Na hi samatthā aṭṭhakathā pāḷiṃ paṭisedhetunti, na ca kenaci-saddassa tenevāti ayaṃ padattho sambhavati, ‘‘kenacī’’ti etassa ādipadassa aniyamitaṃ yaṃ kiñci ekaṃ padattho, taṃ vatvā vuccamānassa ‘‘kenacī’’ti dutiyapadassa yaṃ kiñci aparaṃ aniyamitaṃ padatthoti lokasiddhametaṃ, tatheva ca niddeso pavatto, na cettha viññātabbadhammabhedena dukabhedo samatto āpajjati yattakā viññātabbā, tattakā dukāti, tasmā natthi dukabahutā. Na hi ekaṃyeva viññātabbaṃ kenaci viññeyyaṃ kenaci na viññeyyañca, kintu aparampi aparampīti sabbaviññātabbasaṅgahe duko samatto hoti, evañca sati ‘‘kenacī’’ti padaṃ aniyamena sabbaviññāṇasaṅgāhakanti siddhaṃ hoti, viññāṇanānattena ca viññātabbaṃ bhinditvā ayaṃ duko vutto, na viññātabbānaṃ atthantaratāyāti. Etassa pana dukassa nikkheparāsiniddeso dukasaṅgahitadhammekadesesu dukapadadvayappavattidassanavasena pavatto. Atthuddhāraniddeso niravasesadukasaṅgahitadhammadassanavasenāti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14-19"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhutopi…pe… manatopī"
      },
      "ti cakkhuviññāṇādivīthīsu tadanugatamanoviññāṇavīthīsu ca kiñcāpi kusalādīnampi pavatti atthi, kāmāsavādayo eva pana vaṇato yūsaṃ viya paggharaṇakaasucibhāvena sandanti, tasmā te eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āsavā’’"
      },
      "ti vuccanti. Tattha hi paggharaṇakaasucimhi niruḷho āsavasaddoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammato yāva gotrabhu"
      },
      "nti tato paraṃ maggaphalesu appavattito vuttaṃ. Ete hi ārammaṇakaraṇavasena dhamme gacchantā tato paraṃ na gacchantīti. Nanu tato paraṃ bhavaṅgādīnipi gacchantīti ce? Na, tesampi pubbe ālambitesu lokiyadhammesu sāsavabhāvena antogadhattā tato paratābhāvato. Ettha ca gotrabhuvacanena gotrabhuvodānaphalasamāpattipurecārikaparikammāni vuttānīti veditabbāni, paṭhamamaggapurecārikameva vā gotrabhu avadhinidassanabhāvena gahitaṃ, tato paraṃ maggaphalasamānatāya pana aññesu maggesu maggavīthiyaṃ phalasamāpattivīthiyaṃ nirodhānantarañca pavattamānesu phalesu nibbāne ca pavatti nivāritā āsavānanti veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Savantī"
      },
      "ti gacchanti. Duvidho hi avadhi abhividhivisayo anabhividhivisayo ca. Abhividhivisayaṃ kiriyā byāpetvā pavattati ‘‘ābhavaggā bhagavato yaso gato’’ti, itaraṃ bahi katvā ‘‘āpāṭaliputtā vuṭṭho devo’’ti. Ayañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ā"
      },
      "-kāro abhividhiattho idha gahitoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘antokaraṇattho’’"
      },
      "ti vuttaṃ."
    ],
    "innerText": "14-19.Cakkhutopi…pe… manatopīti cakkhuviññāṇādivīthīsu tadanugatamanoviññāṇavīthīsu ca kiñcāpi kusalādīnampi pavatti atthi, kāmāsavādayo eva pana vaṇato yūsaṃ viya paggharaṇakaasucibhāvena sandanti, tasmā te eva ‘‘āsavā’’ti vuccanti. Tattha hi paggharaṇakaasucimhi niruḷho āsavasaddoti. Dhammato yāva gotrabhunti tato paraṃ maggaphalesu appavattito vuttaṃ. Ete hi ārammaṇakaraṇavasena dhamme gacchantā tato paraṃ na gacchantīti. Nanu tato paraṃ bhavaṅgādīnipi gacchantīti ce? Na, tesampi pubbe ālambitesu lokiyadhammesu sāsavabhāvena antogadhattā tato paratābhāvato. Ettha ca gotrabhuvacanena gotrabhuvodānaphalasamāpattipurecārikaparikammāni vuttānīti veditabbāni, paṭhamamaggapurecārikameva vā gotrabhu avadhinidassanabhāvena gahitaṃ, tato paraṃ maggaphalasamānatāya pana aññesu maggesu maggavīthiyaṃ phalasamāpattivīthiyaṃ nirodhānantarañca pavattamānesu phalesu nibbāne ca pavatti nivāritā āsavānanti veditabbā. Savantīti gacchanti. Duvidho hi avadhi abhividhivisayo anabhividhivisayo ca. Abhividhivisayaṃ kiriyā byāpetvā pavattati ‘‘ābhavaggā bhagavato yaso gato’’ti, itaraṃ bahi katvā ‘‘āpāṭaliputtā vuṭṭho devo’’ti. Ayañca ā-kāro abhividhiattho idha gahitoti ‘‘antokaraṇattho’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cirapārivāsiyaṭṭho"
      },
      " ciraparivutthatā purāṇabhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādi"
      },
      "-saddena ‘‘purimā, bhikkhave, koṭi na paññāyati bhavataṇhāyā’’ti (a. ni. 10.62) idaṃ suttaṃ saṅgahitaṃ. Avijjāsavabhavāsavānañca ",
      " ciraparivutthatāya dassitāya tabbhāvabhāvīnaṃ kāmāsavadiṭṭhāsavānañca ciraparivutthatā dassitā hoti. Aññesupi yathāvutte dhamme okāsañca ārammaṇaṃ katvā pavattamānesu mānādīsu vijjamānesu attattaniyādiggāhavasena abhibyāpanaṃ madakaraṇavasena āsavasadisatā ca etesaṃyeva, nāññesanti etesveva āsavasaddo niruḷho daṭṭhabbo. Āyataṃ vā savanti phalantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āsavā"
      },
      ". Na hi kiñci saṃsāradukkhaṃ āsavehi vinā uppajjamānaṃ atthīti. Ārammaṇabhāvena ye dhammā vaṇo viya āsave paggharanti, te asampayoge atabbhāvepi saha āsavehīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāsavā,"
      },
      " āsavavantoti attho."
    ],
    "innerText": "Cirapārivāsiyaṭṭho ciraparivutthatā purāṇabhāvo. Ādi-saddena ‘‘purimā, bhikkhave, koṭi na paññāyati bhavataṇhāyā’’ti (a. ni. 10.62) idaṃ suttaṃ saṅgahitaṃ. Avijjāsavabhavāsavānañca ciraparivutthatāya dassitāya tabbhāvabhāvīnaṃ kāmāsavadiṭṭhāsavānañca ciraparivutthatā dassitā hoti. Aññesupi yathāvutte dhamme okāsañca ārammaṇaṃ katvā pavattamānesu mānādīsu vijjamānesu attattaniyādiggāhavasena abhibyāpanaṃ madakaraṇavasena āsavasadisatā ca etesaṃyeva, nāññesanti etesveva āsavasaddo niruḷho daṭṭhabbo. Āyataṃ vā savanti phalantīti āsavā. Na hi kiñci saṃsāradukkhaṃ āsavehi vinā uppajjamānaṃ atthīti. Ārammaṇabhāvena ye dhammā vaṇo viya āsave paggharanti, te asampayoge atabbhāvepi saha āsavehīti sāsavā, āsavavantoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Osānaduke ‘‘no āsavā kho panā’’ti avatvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āsavavippayuttā kho panā’’"
      },
      "ti vacanaṃ sāsavānaṃ sahetukānaṃ viya sampayuttehi taṃsahitatā na hotīti dassanatthaṃ. Evaṃ sesagocchakesupi yathāsambhavaṃ vippayuttaggahaṇe payojanaṃ daṭṭhabbaṃ. Apica ‘‘no āsavā kho pana dhammā sāsavā’’ti idaṃ padaṃ catutthaduke dutiyapadena ninnānaṃ, na ca ekena duko hoti, tasmā āsavavippayuttapadameva gahetvā osānadukayojanā ñāyāgatāti katā. Hetugocchake pana hetuvippayuttānaṃ sahetukatā natthīti te gahetvā dukayojanāya asakkuṇeyyattā nahetupadaṃ gahetvā osānadukayojanā katā. Ye vā pana paṭhame duke dutiyassa pakkhepe eko, tatiyassa dve, paṭhamassa dutiye eko, tatiye dve, dutiyassa tatiye eko, dutiye ca tatiyassa ekoti aṭṭha dukā labbhanti, tesu tīhi itare ca nayato dassitāti veditabbā. Esa nayo sesagocchakesupi."
    ],
    "innerText": "Osānaduke ‘‘no āsavā kho panā’’ti avatvā ‘‘āsavavippayuttā kho panā’’ti vacanaṃ sāsavānaṃ sahetukānaṃ viya sampayuttehi taṃsahitatā na hotīti dassanatthaṃ. Evaṃ sesagocchakesupi yathāsambhavaṃ vippayuttaggahaṇe payojanaṃ daṭṭhabbaṃ. Apica ‘‘no āsavā kho pana dhammā sāsavā’’ti idaṃ padaṃ catutthaduke dutiyapadena ninnānaṃ, na ca ekena duko hoti, tasmā āsavavippayuttapadameva gahetvā osānadukayojanā ñāyāgatāti katā. Hetugocchake pana hetuvippayuttānaṃ sahetukatā natthīti te gahetvā dukayojanāya asakkuṇeyyattā nahetupadaṃ gahetvā osānadukayojanā katā. Ye vā pana paṭhame duke dutiyassa pakkhepe eko, tatiyassa dve, paṭhamassa dutiye eko, tatiye dve, dutiyassa tatiye eko, dutiye ca tatiyassa ekoti aṭṭha dukā labbhanti, tesu tīhi itare ca nayato dassitāti veditabbā. Esa nayo sesagocchakesupi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20-25"
      },
      ". Kilesakammavipākavaṭṭānaṃ paccayabhāvena tattha saṃyojenti, satipi aññesaṃ tappaccayabhāve na vinā saṃyojanāni tesaṃ tappaccayabhāvo atthi, orambhāgiyuddhambhāgiyasaṅgahitehi ca taṃtaṃbhavanibbattakakammaniyamo bhavaniyamo ca hoti, na ca upacchinnasaṃyojanassa katānipi kammāni bhavaṃ nibbattentīti. Saṃyojetabbāti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃyojaniyā,"
      },
      " saṃyojane niyuttāti vā. Dūragatassapi ākaḍḍhanato nissarituṃ appadānavasena bandhanaṃ saṃyojanaṃ, ganthakaraṇaṃ saṅkhalikacakkalakānaṃ viya paṭibaddhatākaraṇaṃ vā ganthanaṃ gantho, saṃsilisakaraṇaṃ yojanaṃ yogoti ayametesaṃ visesoti veditabbo. Dhammānaṃ sabhāvakiccavisesaññunā pana bhagavatā sampayuttesu ārammaṇesu tappaccayesu ca tehi tehi nipphādiyamānaṃ taṃ taṃ kiccavisesaṃ passantena te te dhammā tathā tathā āsavasaṃyojanaganthādivasena ",
      " vuttāti ‘‘kimatthaṃ eteyeva dhammā evaṃ vuttā, kasmā ca vuttā eva puna vuttā’’ti na codetabbametaṃ."
    ],
    "innerText": "20-25. Kilesakammavipākavaṭṭānaṃ paccayabhāvena tattha saṃyojenti, satipi aññesaṃ tappaccayabhāve na vinā saṃyojanāni tesaṃ tappaccayabhāvo atthi, orambhāgiyuddhambhāgiyasaṅgahitehi ca taṃtaṃbhavanibbattakakammaniyamo bhavaniyamo ca hoti, na ca upacchinnasaṃyojanassa katānipi kammāni bhavaṃ nibbattentīti. Saṃyojetabbāti vā saṃyojaniyā, saṃyojane niyuttāti vā. Dūragatassapi ākaḍḍhanato nissarituṃ appadānavasena bandhanaṃ saṃyojanaṃ, ganthakaraṇaṃ saṅkhalikacakkalakānaṃ viya paṭibaddhatākaraṇaṃ vā ganthanaṃ gantho, saṃsilisakaraṇaṃ yojanaṃ yogoti ayametesaṃ visesoti veditabbo. Dhammānaṃ sabhāvakiccavisesaññunā pana bhagavatā sampayuttesu ārammaṇesu tappaccayesu ca tehi tehi nipphādiyamānaṃ taṃ taṃ kiccavisesaṃ passantena te te dhammā tathā tathā āsavasaṃyojanaganthādivasena vuttāti ‘‘kimatthaṃ eteyeva dhammā evaṃ vuttā, kasmā ca vuttā eva puna vuttā’’ti na codetabbametaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26-37"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ganthaniyā"
      },
      "ti ",
      " ettha ayamañño attho ‘‘ganthakaraṇaṃ ganthanaṃ, ganthane niyuttāti ganthaniyā, ganthayituṃ sakkuṇeyyā, ganthayituṃ arahantīti vā ganthaniyā’’ti. Evaṃ oghaniyādīsupi daṭṭhabbaṃ. Tenātikkamatīti etaṃ dhātvatthaṃ gahetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "oghaniyā"
      },
      "ti padasiddhi katā."
    ],
    "innerText": "26-37.Ganthaniyāti ettha ayamañño attho ‘‘ganthakaraṇaṃ ganthanaṃ, ganthane niyuttāti ganthaniyā, ganthayituṃ sakkuṇeyyā, ganthayituṃ arahantīti vā ganthaniyā’’ti. Evaṃ oghaniyādīsupi daṭṭhabbaṃ. Tenātikkamatīti etaṃ dhātvatthaṃ gahetvā oghaniyāti padasiddhi katā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50-54"
      },
      ". Dhammasabhāvaṃ aggahetvā parato āmasantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parāmāsā. Parato"
      },
      "ti niccādito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āmasantī"
      },
      "ti sabhāvapaṭisedhena parimajjanti."
    ],
    "innerText": "50-54. Dhammasabhāvaṃ aggahetvā parato āmasantīti parāmāsā. Paratoti niccādito. Āmasantīti sabhāvapaṭisedhena parimajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "55-68"
      },
      ". Sabhāvato vijjamānaṃ avijjamānaṃ vā vicittasaññāya saññitaṃ ārammaṇaṃ aggahetvā appavattito ālambamānā dhammā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sārammaṇā"
      },
      ". Cintanaṃ gahaṇaṃ ārammaṇūpaladdhi. Cetasi niyuttā, cetasā saṃsaṭṭhā vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cetasikā"
      },
      ". Dubbiññeyyanānattatāya ekībhāvamivupagamanaṃ nirantarabhāvupagamanaṃ. Yesaṃ rūpānaṃ cittaṃ sahajātapaccayo hoti, tesaṃ cittassa ca suviññeyyanānattanti nirantarabhāvānupagamanaṃ veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekato vattamānāpī"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "api"
      },
      "-saddo ko pana vādo ekato avattamānāti etamatthaṃ dīpeti. Idamettha vicāretabbaṃ – avinibbhogarūpānaṃ kiṃ aññamaññaṃ saṃsaṭṭhatā, udāhu visaṃsaṭṭhatāti? Visuṃ ārammaṇabhāvena suviññeyyanānattattā na saṃsaṭṭhatā, nāpi visaṃsaṭṭhatā saṃsaṭṭhāti anāsaṅkanīyasabhāvattā. Catunnañhi khandhānaṃ aññamaññaṃ saṃsaṭṭhasabhāvattā rūpanibbānehipi so saṃsaṭṭhabhāvo atthi natthīti siyā āsaṅkā, tasmā tesaṃ itarehi, itaresañca tehi visaṃsaṭṭhasabhāvatā vuccati, na pana rūpānaṃ rūpehi katthaci saṃsaṭṭhatā atthīti tadāsaṅkābhāvato visaṃsaṭṭhatā ca rūpānaṃ rūpehi na vuccatīti. Esa hi tesaṃ sabhāvoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittasaṃsaṭṭhasamuṭṭhānā"
      },
      "dipadesu saṃsaṭṭhasamuṭṭhānādisaddā cittasaddāpekkhāti paccekaṃ cittasaddasambandhattā cittasaṃsaṭṭhā ca te cittasamuṭṭhānā cāti paccekaṃ yojetvā attho vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upādiyantevā"
      },
      "ti bhūtāni gaṇhanti eva, nissayanti evāti attho. Yathā bhūtāni upādiyanti gayhanti nissīyanti, na tathā etāni gayhanti nissīyanti, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upādā"
      },
      ". Atha vā bhūtāni amuñcitvā tesaṃ vaṇṇanibhādibhāvena gahetabbato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upādā"
      },
      "."
    ],
    "innerText": "55-68. Sabhāvato vijjamānaṃ avijjamānaṃ vā vicittasaññāya saññitaṃ ārammaṇaṃ aggahetvā appavattito ālambamānā dhammā sārammaṇā. Cintanaṃ gahaṇaṃ ārammaṇūpaladdhi. Cetasi niyuttā, cetasā saṃsaṭṭhā vā cetasikā. Dubbiññeyyanānattatāya ekībhāvamivupagamanaṃ nirantarabhāvupagamanaṃ. Yesaṃ rūpānaṃ cittaṃ sahajātapaccayo hoti, tesaṃ cittassa ca suviññeyyanānattanti nirantarabhāvānupagamanaṃ veditabbaṃ. Ekato vattamānāpīti api-saddo ko pana vādo ekato avattamānāti etamatthaṃ dīpeti. Idamettha vicāretabbaṃ – avinibbhogarūpānaṃ kiṃ aññamaññaṃ saṃsaṭṭhatā, udāhu visaṃsaṭṭhatāti? Visuṃ ārammaṇabhāvena suviññeyyanānattattā na saṃsaṭṭhatā, nāpi visaṃsaṭṭhatā saṃsaṭṭhāti anāsaṅkanīyasabhāvattā. Catunnañhi khandhānaṃ aññamaññaṃ saṃsaṭṭhasabhāvattā rūpanibbānehipi so saṃsaṭṭhabhāvo atthi natthīti siyā āsaṅkā, tasmā tesaṃ itarehi, itaresañca tehi visaṃsaṭṭhasabhāvatā vuccati, na pana rūpānaṃ rūpehi katthaci saṃsaṭṭhatā atthīti tadāsaṅkābhāvato visaṃsaṭṭhatā ca rūpānaṃ rūpehi na vuccatīti. Esa hi tesaṃ sabhāvoti. Cittasaṃsaṭṭhasamuṭṭhānādipadesu saṃsaṭṭhasamuṭṭhānādisaddā cittasaddāpekkhāti paccekaṃ cittasaddasambandhattā cittasaṃsaṭṭhā ca te cittasamuṭṭhānā cāti paccekaṃ yojetvā attho vutto. Upādiyantevāti bhūtāni gaṇhanti eva, nissayanti evāti attho. Yathā bhūtāni upādiyanti gayhanti nissīyanti, na tathā etāni gayhanti nissīyanti, tasmā upādā. Atha vā bhūtāni amuñcitvā tesaṃ vaṇṇanibhādibhāvena gahetabbato upādā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "75-82"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃkiliṭṭhattike"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuttanayenā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃ"
      },
      "-saddaṃ apanetvā kilisantīti kilesātiādinā nayena."
    ],
    "innerText": "75-82.Saṃkiliṭṭhattikevuttanayenāti saṃ-saddaṃ apanetvā kilisantīti kilesātiādinā nayena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "83-100"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmāvacarā"
      },
      "dīsu ",
      " ayamaparo attho – kāmataṇhā kāmo, evaṃ rūpārūpataṇhā rūpaṃ arūpañca. Ārammaṇakaraṇavasena tāni yattha avacaranti, te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmāvacarā"
      },
      "dayoti. Evañhi sati aññabhūmīsu uppajjamānānaṃ akāmāvacarāditā kāmāvacarāditā ca nāpajjatīti siddhaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nikkhepakaṇḍe"
      },
      "pi ‘‘etthāvacarā’’ti vacanaṃ avīciparanimmitaparicchinnokāsāya kāmataṇhāya ārammaṇabhāvaṃ sandhāya vuttanti veditabbaṃ, tadokāsatā ca taṇhāya tanninnatāya veditabbā. Yadi pariyāpannasaddassa antogadhāti ayamattho, maggādidhammānañca lokuttarantogadhattā pariyāpannatā āpajjati. Na hi ‘‘pariyāpannā’’ti ettha tebhūmakagahaṇaṃ atthīti? Nāpajjati sabbadā pavattamānassa paccakkhassa lokassa vasena pariyāpannanicchayato. Atha vā paricchedakārikāya taṇhāya paricchinditvā āpannā paṭipannā gahitāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariyāpannā"
      },
      "."
    ],
    "innerText": "83-100.Kāmāvacarādīsu ayamaparo attho – kāmataṇhā kāmo, evaṃ rūpārūpataṇhā rūpaṃ arūpañca. Ārammaṇakaraṇavasena tāni yattha avacaranti, te kāmāvacarādayoti. Evañhi sati aññabhūmīsu uppajjamānānaṃ akāmāvacarāditā kāmāvacarāditā ca nāpajjatīti siddhaṃ hoti. Nikkhepakaṇḍepi ‘‘etthāvacarā’’ti vacanaṃ avīciparanimmitaparicchinnokāsāya kāmataṇhāya ārammaṇabhāvaṃ sandhāya vuttanti veditabbaṃ, tadokāsatā ca taṇhāya tanninnatāya veditabbā. Yadi pariyāpannasaddassa antogadhāti ayamattho, maggādidhammānañca lokuttarantogadhattā pariyāpannatā āpajjati. Na hi ‘‘pariyāpannā’’ti ettha tebhūmakagahaṇaṃ atthīti? Nāpajjati sabbadā pavattamānassa paccakkhassa lokassa vasena pariyāpannanicchayato. Atha vā paricchedakārikāya taṇhāya paricchinditvā āpannā paṭipannā gahitāti pariyāpannā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anīya-saddo bahulā kattuabhidhāyakoti vaṭṭacārakato niyyantīti niyyānīyā, nī-kārassa rassattaṃ ya-kārassa ca ka-kārattaṃ katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘niyyānikā’’"
      },
      "ti vuttaṃ, niyyānakaraṇasīlā vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niyyānikā"
      },
      ". Uttaritabbassa aññassa niddiṭṭhassa abhāvā niddisiyamānā sauttarā dhammāva uttaritabbāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘attāna’’"
      },
      "nti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rāgādīna"
      },
      "nti rāgādīnaṃ dasannaṃ kilesānaṃ sabbaniyatākusalānaṃ vā. Tehi nānappakāradukkhanibbattakehi abhibhūtā sattā kandanti akandantāpi kandanakāraṇabhāvato. Yasmā pana pahānekaṭṭhatāvasena ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘saraṇā’’"
      },
      "ti āha, tasmā ‘‘rāgādīna’’nti vacanena rāgadosamohāva gahitāti ñāyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Raṇa"
      },
      "-saddo vā rāgādireṇūsu niruḷho daṭṭhabbo, raṇaṃ vā yuddhaṃ, ‘‘kāmā te paṭhamā senā’’ti (su. ni. 438; mahāni. 28, 68, 149; cūḷani. nandamāṇavapucchāniddesa 47) evamādikā ca akusalā senā ariyamaggayuddhena jetabbattā sayuddhattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘saraṇā’’"
      },
      "ti vuccantīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Araṇavibhaṅgasutte"
      },
      " (ma. ni. 3.323 ādayo) pana sadukkhā saupaghātā saupāyāsā sapariḷāhā micchāpaṭipadābhūtā kāmasukhānuyogādayo ‘‘saraṇā’’ti vuttāti dukkhādīnaṃ raṇabhāvo tannibbattakasabhāvānaṃ akusalānaṃ saraṇatā ca veditabbā."
    ],
    "innerText": "Anīya-saddo bahulā kattuabhidhāyakoti vaṭṭacārakato niyyantīti niyyānīyā, nī-kārassa rassattaṃ ya-kārassa ca ka-kārattaṃ katvā ‘‘niyyānikā’’ti vuttaṃ, niyyānakaraṇasīlā vā niyyānikā. Uttaritabbassa aññassa niddiṭṭhassa abhāvā niddisiyamānā sauttarā dhammāva uttaritabbāti ‘‘attāna’’nti āha. Rāgādīnanti rāgādīnaṃ dasannaṃ kilesānaṃ sabbaniyatākusalānaṃ vā. Tehi nānappakāradukkhanibbattakehi abhibhūtā sattā kandanti akandantāpi kandanakāraṇabhāvato. Yasmā pana pahānekaṭṭhatāvasena ca ‘‘saraṇā’’ti āha, tasmā ‘‘rāgādīna’’nti vacanena rāgadosamohāva gahitāti ñāyati. Raṇa-saddo vā rāgādireṇūsu niruḷho daṭṭhabbo, raṇaṃ vā yuddhaṃ, ‘‘kāmā te paṭhamā senā’’ti (su. ni. 438; mahāni. 28, 68, 149; cūḷani. nandamāṇavapucchāniddesa 47) evamādikā ca akusalā senā ariyamaggayuddhena jetabbattā sayuddhattā ‘‘saraṇā’’ti vuccantīti. Araṇavibhaṅgasutte (ma. ni. 3.323 ādayo) pana sadukkhā saupaghātā saupāyāsā sapariḷāhā micchāpaṭipadābhūtā kāmasukhānuyogādayo ‘‘saraṇā’’ti vuttāti dukkhādīnaṃ raṇabhāvo tannibbattakasabhāvānaṃ akusalānaṃ saraṇatā ca veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Piṭṭhidukā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Suttantikadukamātikāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "101-108"
      },
      ". Vijjārāsantogadhadhammā ",
      " vijjāsabhāgatāya tadekadese vijjākoṭṭhāse vattantīti vuttā. Vajirassa yattha taṃ patati, tattha abhejjaṃ nāma kiñci maṇipāsāṇādi natthi, na ca tena gamanamaggo viruhati, evameva arahattamaggena yattha so uppajjati, tasmiṃ santāne abhejjo kileso nāma natthi, na ca bhinno puna viruhatīti vajirupamatā veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadupacārena bālā"
      },
      " yathā ‘‘mañcā ghosantī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṇhābhijātī"
      },
      "ti apāyā vuccanti manussesu ca dobhaggiyaṃ. Tapanassa vā dukkhassa hitāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tapaniyā"
      },
      "."
    ],
    "innerText": "101-108. Vijjārāsantogadhadhammā vijjāsabhāgatāya tadekadese vijjākoṭṭhāse vattantīti vuttā. Vajirassa yattha taṃ patati, tattha abhejjaṃ nāma kiñci maṇipāsāṇādi natthi, na ca tena gamanamaggo viruhati, evameva arahattamaggena yattha so uppajjati, tasmiṃ santāne abhejjo kileso nāma natthi, na ca bhinno puna viruhatīti vajirupamatā veditabbā. Tadupacārena bālā yathā ‘‘mañcā ghosantī’’ti. Kaṇhābhijātīti apāyā vuccanti manussesu ca dobhaggiyaṃ. Tapanassa vā dukkhassa hitāti tapaniyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dāsādīsupi sirivaḍḍhakādisaddā viya atathattā vacanamattameva adhikāraṃ katvā pavattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhivacanā"
      },
      ". Yasmā pana adhivacananiruttipaññattipadāni samānatthāni, sabbañca vacanaṃ adhivacanādibhāvaṃ bhajati, tasmā tesupi vacanavisesesu visesena pavattehi adhivacanādisaddehi sabbāni vacanāni atthappakāsanasāmaññena vuttānīti etenādhippāyena ayaṃ atthayojanā katāti veditabbā. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhi"
      },
      "-saddo uparibhāge, upari vacanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhivacanaṃ"
      },
      ". Kassa upari? Pakāsetabbassa atthassāti viditovāyamattho. Adhīnaṃ vā vacanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhivacanaṃ"
      },
      ". Kena adhīnaṃ? Atthena. Tathā taṃtaṃatthappakāsane nicchitaṃ, niyataṃ vā vacanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nirutti"
      },
      ". Pathavīdhātupurisāditaṃtaṃpakārena ñāpanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññattī"
      },
      "ti evaṃ adhivacanādipadānaṃ sabbavacanesu pavatti veditabbā. Aññathā sirivaḍḍhakadhanavaḍḍhakappakārānameva abhilāpānaṃ adhivacanatā, abhisaṅkharontīti evaṃpakārānameva niddhāraṇavacanānaṃ niruttitā, takko vitakkoti evaṃpakārānameva ekamevatthaṃ tena tena pakārena ñāpentānaṃ paññattitā ca āpajjeyyāti."
    ],
    "innerText": "Dāsādīsupi sirivaḍḍhakādisaddā viya atathattā vacanamattameva adhikāraṃ katvā pavattā adhivacanā. Yasmā pana adhivacananiruttipaññattipadāni samānatthāni, sabbañca vacanaṃ adhivacanādibhāvaṃ bhajati, tasmā tesupi vacanavisesesu visesena pavattehi adhivacanādisaddehi sabbāni vacanāni atthappakāsanasāmaññena vuttānīti etenādhippāyena ayaṃ atthayojanā katāti veditabbā. Atha vā adhi-saddo uparibhāge, upari vacanaṃ adhivacanaṃ. Kassa upari? Pakāsetabbassa atthassāti viditovāyamattho. Adhīnaṃ vā vacanaṃ adhivacanaṃ. Kena adhīnaṃ? Atthena. Tathā taṃtaṃatthappakāsane nicchitaṃ, niyataṃ vā vacanaṃ nirutti. Pathavīdhātupurisāditaṃtaṃpakārena ñāpanato paññattīti evaṃ adhivacanādipadānaṃ sabbavacanesu pavatti veditabbā. Aññathā sirivaḍḍhakadhanavaḍḍhakappakārānameva abhilāpānaṃ adhivacanatā, abhisaṅkharontīti evaṃpakārānameva niddhāraṇavacanānaṃ niruttitā, takko vitakkoti evaṃpakārānameva ekamevatthaṃ tena tena pakārena ñāpentānaṃ paññattitā ca āpajjeyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "109-118"
      },
      ". Phasso vedanāti sabbadāpi arūpadhammānaṃ phassādināmakattā pathaviyādīnaṃ kesakumbhādināmantarāpatti viya nāmantarānāpajjanato ca sadā attanāva katanāmatāya catukkhandhanibbānāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāmakaraṇaṭṭhena nāmaṃ. Namanaṃ"
      },
      " avinābhāvato ārammaṇābhimukhatā, namanahetubhūtatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāmanaṃ"
      },
      ". Atha vā adhivacanasamphasso viya adhivacanaṃ nāmamantarena ye anupacitabodhisambhārānaṃ gahaṇaṃ na gacchanti, te nāmāyattaggahaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāmaṃ"
      },
      ". Rūpaṃ pana vināpi nāmasādhanaṃ attano ruppanasabhāvena gahaṇaṃ upayātīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpaṃ"
      },
      "."
    ],
    "innerText": "109-118. Phasso vedanāti sabbadāpi arūpadhammānaṃ phassādināmakattā pathaviyādīnaṃ kesakumbhādināmantarāpatti viya nāmantarānāpajjanato ca sadā attanāva katanāmatāya catukkhandhanibbānāni nāmakaraṇaṭṭhena nāmaṃ. Namanaṃ avinābhāvato ārammaṇābhimukhatā, namanahetubhūtatā nāmanaṃ. Atha vā adhivacanasamphasso viya adhivacanaṃ nāmamantarena ye anupacitabodhisambhārānaṃ gahaṇaṃ na gacchanti, te nāmāyattaggahaṇā nāmaṃ. Rūpaṃ pana vināpi nāmasādhanaṃ attano ruppanasabhāvena gahaṇaṃ upayātīti rūpaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "119-123"
      },
      ". Ito ",
      " pubbe parikammaṃ pavattaṃ, ito paraṃ bhavaṅgaṃ, majjhe samāpattīti evaṃ samāpattīnaṃ appanāparicchedapaññā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāpattikusalatā"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuṭṭhāne kusalabhāvo"
      },
      " pubbe vuṭṭhāne paricchedakaraṇañāṇaṃ. Lakkhaṇādivasena aniccādivasena ca manasi karaṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manasikāro"
      },
      "."
    ],
    "innerText": "119-123. Ito pubbe parikammaṃ pavattaṃ, ito paraṃ bhavaṅgaṃ, majjhe samāpattīti evaṃ samāpattīnaṃ appanāparicchedapaññā samāpattikusalatā. Vuṭṭhāne kusalabhāvo pubbe vuṭṭhāne paricchedakaraṇañāṇaṃ. Lakkhaṇādivasena aniccādivasena ca manasi karaṇaṃ manasikāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "124-134"
      },
      ". Sucisīlatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "soraccaṃ"
      },
      ". Sā hi sobhanakammaratatāti. Sammodakassa, sammodako vā mudubhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammodakamudubhāvo,"
      },
      " saṇhavācatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Aguttadvāratā’’"
      },
      "ti vutte kesu dvāresūti na paññāyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘indriyesū’’"
      },
      "ti vuttaṃ. Sampajānātīti sampajāno, tassa bhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampajaññaṃ"
      },
      ". Tadapi ñāṇaṃ yasmā sampajānāti, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sampajānātīti sampajañña’’"
      },
      "nti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaṭisaṅkhāne"
      },
      " nimitte visaye vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vīriyasīsenā"
      },
      "ti vīriyapāmokkhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppannaṃ bala"
      },
      "nti vīriyopatthambhena hi kusalabhāvanā balavatī thirā uppajjatīti tathā uppannā balavatī kusalabhāvanā balavanto satta bojjhaṅgātipi vuccanti. Kasiṇanimittaṃ viya saññāṇaṃ viya saviggahaṃ viya ca suṭṭhu upalakkhetabbākāraṃ ‘‘nimitta’’nti vuccati. Samatho ca evaṃ ākāroti ‘‘nimitta’’nti vutto. Tathā hi so paccavekkhantena paccavekkhaṇato gayhatīti. Uddhaccamiva cittaṃ na vikkhipatīti, vikkhepapaṭikkhepo vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avikkhepo"
      },
      "."
    ],
    "innerText": "124-134. Sucisīlatā soraccaṃ. Sā hi sobhanakammaratatāti. Sammodakassa, sammodako vā mudubhāvo sammodakamudubhāvo, saṇhavācatā. ‘‘Aguttadvāratā’’ti vutte kesu dvāresūti na paññāyatīti ‘‘indriyesū’’ti vuttaṃ. Sampajānātīti sampajāno, tassa bhāvo sampajaññaṃ. Tadapi ñāṇaṃ yasmā sampajānāti, tasmā ‘‘sampajānātīti sampajañña’’nti āha. Appaṭisaṅkhāne nimitte visaye vā. Vīriyasīsenāti vīriyapāmokkhena. Uppannaṃ balanti vīriyopatthambhena hi kusalabhāvanā balavatī thirā uppajjatīti tathā uppannā balavatī kusalabhāvanā balavanto satta bojjhaṅgātipi vuccanti. Kasiṇanimittaṃ viya saññāṇaṃ viya saviggahaṃ viya ca suṭṭhu upalakkhetabbākāraṃ ‘‘nimitta’’nti vuccati. Samatho ca evaṃ ākāroti ‘‘nimitta’’nti vutto. Tathā hi so paccavekkhantena paccavekkhaṇato gayhatīti. Uddhaccamiva cittaṃ na vikkhipatīti, vikkhepapaṭikkhepo vā avikkhepo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "135-142"
      },
      ". Sīlameva punappunaṃ āseviyamānaṃ lokiyaṃ lokuttarampi sīlaṃ paripūretīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sīlaparipūraṇato’’"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlassa sampadā"
      },
      "ti kāraṇasīlampi phalasīlampi sampannasamudāyassa ekadesavasena vuttaṃ. Atha vā ‘‘katame ca thapati akusalā sīlā? Akusalaṃ kāyakammaṃ akusalaṃ vacīkammaṃ pāpako ājīvo’’ti (ma. ni. 2.264) vuttattā sabbampi kusalākusalaṃ ‘‘sīla’’nti gahetvā tattha kusalasīlaṃ niddhāretvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sīlasampadā’’"
      },
      "ti vuttaṃ. Evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭhisampadā"
      },
      "pi veditabbā."
    ],
    "innerText": "135-142. Sīlameva punappunaṃ āseviyamānaṃ lokiyaṃ lokuttarampi sīlaṃ paripūretīti ‘‘sīlaparipūraṇato’’ti vuttaṃ. Sīlassa sampadāti kāraṇasīlampi phalasīlampi sampannasamudāyassa ekadesavasena vuttaṃ. Atha vā ‘‘katame ca thapati akusalā sīlā? Akusalaṃ kāyakammaṃ akusalaṃ vacīkammaṃ pāpako ājīvo’’ti (ma. ni. 2.264) vuttattā sabbampi kusalākusalaṃ ‘‘sīla’’nti gahetvā tattha kusalasīlaṃ niddhāretvā ‘‘sīlasampadā’’ti vuttaṃ. Evaṃ diṭṭhisampadāpi veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhivisuddhi kho pana yathādiṭṭhissa ca padhānanti kammassakatañāṇādisaṅkhātā diṭṭhivisuddhi cevā"
      },
      "ti paṭipāṭiyā diṭṭhivisuddhi diṭṭhivisuddhi kho panāti ca padadvayassa samānattā paññā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathādiṭṭhissā"
      },
      "ti nibbattitappakāradiṭṭhissa nibbattetabbapadhānānurūpadiṭṭhissa vā yathādiṭṭhipavattakiriyassa vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃvego"
      },
      "ti sahottappaṃ ñāṇaṃ, ottappameva vā. Samattaṃ tussanaṃ titti ",
      " santuṭṭhi, natthi etassa santuṭṭhīti asantuṭṭhi, asantuṭṭhissa bhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asantuṭṭhitā"
      },
      ". Vīriyappavāhe pavattamāne antarā eva paṭigamanaṃ nivattanaṃ paṭivānaṃ, taṃ assa atthīti paṭivānī ",
      ", na paṭivānī appaṭivānī, tassa bhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appaṭivānitā"
      },
      ". Vimuccanaṃ nāma ārammaṇe adhimuttatā kilesehi sabbasaṅkhārehi ca nissaṭatā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisandhivasenā"
      },
      "ti kilesānaṃ taṃtaṃmaggavajjhānaṃ uppannamagge khandhasantāne puna saṃdahanavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuppādabhūte"
      },
      "ti taṃtaṃphale. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuppādapariyosāne"
      },
      "ti anuppādakaro maggo anuppādo, tassa pariyosāne."
    ],
    "innerText": "Diṭṭhivisuddhi kho pana yathādiṭṭhissa ca padhānanti kammassakatañāṇādisaṅkhātā diṭṭhivisuddhi cevāti paṭipāṭiyā diṭṭhivisuddhi diṭṭhivisuddhi kho panāti ca padadvayassa samānattā paññā. Yathādiṭṭhissāti nibbattitappakāradiṭṭhissa nibbattetabbapadhānānurūpadiṭṭhissa vā yathādiṭṭhipavattakiriyassa vā. Saṃvegoti sahottappaṃ ñāṇaṃ, ottappameva vā. Samattaṃ tussanaṃ titti santuṭṭhi, natthi etassa santuṭṭhīti asantuṭṭhi, asantuṭṭhissa bhāvo asantuṭṭhitā. Vīriyappavāhe pavattamāne antarā eva paṭigamanaṃ nivattanaṃ paṭivānaṃ, taṃ assa atthīti paṭivānī , na paṭivānī appaṭivānī, tassa bhāvo appaṭivānitā. Vimuccanaṃ nāma ārammaṇe adhimuttatā kilesehi sabbasaṅkhārehi ca nissaṭatā ca. Paṭisandhivasenāti kilesānaṃ taṃtaṃmaggavajjhānaṃ uppannamagge khandhasantāne puna saṃdahanavasena. Anuppādabhūteti taṃtaṃphale. Anuppādapariyosāneti anuppādakaro maggo anuppādo, tassa pariyosāne."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Suttantikadukamātikāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dukamātikāpadavaṇṇanā niṭṭhitā."
  }
]