[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "7. Sattamavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Saṅgahitakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "471-472"
      },
      ". Idāni ",
      " saṅgahitakathā nāma hoti. Tattha yasmā dāmādīhi balibaddādayo viya keci dhammā kehici dhammehi saṅgahitā nāma natthi, tasmā ‘‘natthi keci dhammā kehici dhammehi saṅgahitā, evaṃ sante ekavidhena rūpasaṅgahotiādi niratthaka’’nti yesaṃ laddhi, seyyathāpi rājagirikānañceva siddhatthikānañca; te sandhāya aññenatthena saṅgahabhāvaṃ dassetuṃ pucchā sakavādissa, attano laddhivasena paṭiññā itarassa. Idāni yenatthena saṅgaho labbhati, taṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nanu atthi keci dhammā"
      },
      "tiādi āraddhaṃ. Taṃ sabbaṃ heṭṭhā vuttanayattā uttānatthameva. Yā panesā paravādinā laddhipatiṭṭhāpanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathā dāmena vā"
      },
      "tiādikā upamā āhaṭā, sakavādinā taṃ anabhinanditvā appaṭikkositvā ‘‘hañci dāmena vā’’ti tassa laddhi bhinnāti veditabbā. Ayañhettha attho – yadi te dāmādīhi balibaddādayo saṅgahitā nāma, atthi keci dhammā kehici dhammehi saṅgahitāti."
    ],
    "innerText": "471-472. Idāni saṅgahitakathā nāma hoti. Tattha yasmā dāmādīhi balibaddādayo viya keci dhammā kehici dhammehi saṅgahitā nāma natthi, tasmā ‘‘natthi keci dhammā kehici dhammehi saṅgahitā, evaṃ sante ekavidhena rūpasaṅgahotiādi niratthaka’’nti yesaṃ laddhi, seyyathāpi rājagirikānañceva siddhatthikānañca; te sandhāya aññenatthena saṅgahabhāvaṃ dassetuṃ pucchā sakavādissa, attano laddhivasena paṭiññā itarassa. Idāni yenatthena saṅgaho labbhati, taṃ dassetuṃ nanu atthi keci dhammātiādi āraddhaṃ. Taṃ sabbaṃ heṭṭhā vuttanayattā uttānatthameva. Yā panesā paravādinā laddhipatiṭṭhāpanatthaṃ yathā dāmena vātiādikā upamā āhaṭā, sakavādinā taṃ anabhinanditvā appaṭikkositvā ‘‘hañci dāmena vā’’ti tassa laddhi bhinnāti veditabbā. Ayañhettha attho – yadi te dāmādīhi balibaddādayo saṅgahitā nāma, atthi keci dhammā kehici dhammehi saṅgahitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṅgahitakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Sampayuttakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "473-474"
      },
      ". Idāni ",
      " sampayuttakathā nāma hoti. Tattha yasmā tilamhi telaṃ viya na vedanādayo saññādīsu anupaviṭṭhā, tasmā ‘‘natthi keci dhammā kehici dhammehi sampayuttā, evaṃ sante ",
      " ñāṇasampayuttantiādi niratthakaṃ hotī’’ti yesaṃ laddhi, seyyathāpi ",
      " rājagirikasiddhatthikānaññeva; te sandhāya aññenevatthena sampayuttataṃ dassetuṃ pucchā sakavādissa, attano laddhivasena paṭiññā itarassa. Sesamidhāpi heṭṭhā vuttanayattā uttānatthameva. Yo panesa paravādinā ‘‘yathā tilamhi tela’’ntiādiko upamāpañho āhaṭo, so yasmā vedanāsaññānaṃ viya tilatelānaṃ lakkhaṇato nānattavavatthānaṃ natthi. Sabbesupi hi tilaaṭṭhitacesu tiloti vohāramattaṃ, teneva tilaṃ nibbattetvā gahite purimasaṇṭhānena tilo nāma na paññāyati, tasmā anāhaṭasadisova hotīti."
    ],
    "innerText": "473-474. Idāni sampayuttakathā nāma hoti. Tattha yasmā tilamhi telaṃ viya na vedanādayo saññādīsu anupaviṭṭhā, tasmā ‘‘natthi keci dhammā kehici dhammehi sampayuttā, evaṃ sante ñāṇasampayuttantiādi niratthakaṃ hotī’’ti yesaṃ laddhi, seyyathāpi rājagirikasiddhatthikānaññeva; te sandhāya aññenevatthena sampayuttataṃ dassetuṃ pucchā sakavādissa, attano laddhivasena paṭiññā itarassa. Sesamidhāpi heṭṭhā vuttanayattā uttānatthameva. Yo panesa paravādinā ‘‘yathā tilamhi tela’’ntiādiko upamāpañho āhaṭo, so yasmā vedanāsaññānaṃ viya tilatelānaṃ lakkhaṇato nānattavavatthānaṃ natthi. Sabbesupi hi tilaaṭṭhitacesu tiloti vohāramattaṃ, teneva tilaṃ nibbattetvā gahite purimasaṇṭhānena tilo nāma na paññāyati, tasmā anāhaṭasadisova hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sampayuttakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Cetasikakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "475-477"
      },
      ". Idāni cetasikakathā nāma hoti. Tattha yasmā phassikādayo nāma natthi, tasmā ‘‘cetasikenāpi na bhavitabbaṃ, iti natthi cetasiko dhammo’’ti yesaṃ laddhi, seyyathāpi rājagirikasiddhatthikānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajāto"
      },
      "ti sampayuttasahajātaṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phassikā"
      },
      "ti tādisaṃ vohāraṃ apassantassa pucchā paravādissa. Kiṃ vohārena, yathā cittanissitakoti cetasiko, evaṃ sopi phassanissitattā phassikoti vutte doso natthīti paṭiññā sakavādissa. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "475-477. Idāni cetasikakathā nāma hoti. Tattha yasmā phassikādayo nāma natthi, tasmā ‘‘cetasikenāpi na bhavitabbaṃ, iti natthi cetasiko dhammo’’ti yesaṃ laddhi, seyyathāpi rājagirikasiddhatthikānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Sahajātoti sampayuttasahajātaṃ sandhāya vuttaṃ. Phassikāti tādisaṃ vohāraṃ apassantassa pucchā paravādissa. Kiṃ vohārena, yathā cittanissitakoti cetasiko, evaṃ sopi phassanissitattā phassikoti vutte doso natthīti paṭiññā sakavādissa. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cetasikakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Dānakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "478"
      },
      ". Idāni ",
      " dānakathā nāma hoti. Tattha dānaṃ nāma tividhaṃ – cāgacetanāpi, viratipi, deyyadhammopi. ‘‘Saddhā hiriyaṃ kusalañca ",
      " dāna’’nti (a. ni. 8.30) āgataṭṭhāne cāgacetanā dānaṃ. ‘‘Abhayaṃ detī’’ti (a. ni. 8.39) āgataṭṭhāne virati. ‘‘Dānaṃ deti annaṃ pāna’’nti āgataṭṭhāne deyyadhammo. Tattha cāgacetanā ‘‘deti vā deyyadhammaṃ, denti ",
      " vā etāya deyyadhamma’’nti dānaṃ. Virati avakhaṇḍanaṭṭhena lavanaṭṭhena vā dānaṃ. Sā hi uppajjamānā bhayabheravādisaṅkhātaṃ dussīlyacetanaṃ dāti khaṇḍeti lunāti vāti dānaṃ. Deyyadhammo diyyatīti dānaṃ. Evametaṃ tividhampi atthato cetasiko ceva dhammo deyyadhammo cāti duvidhaṃ hoti. Tattha yesaṃ ‘‘cetasikova dhammo dānaṃ, na deyyadhammo’’ti laddhi, seyyathāpi rājagirikasiddhatthikānaṃ; te sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cetasiko"
      },
      "ti pucchā sakavādissa, paṭiññā itarassa. Atha naṃ deyyadhammavasena codetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "labbhā"
      },
      "ti pucchā sakavādissa, annādīni viya so na sakkā dātunti paṭikkhepo itarassa. Puna daḷhaṃ katvā puṭṭhe ‘‘abhayaṃ detī’’ti suttavasena paṭiññā tasseva. Phassapañhādīsu pana phassaṃ detītiādivohāraṃ apassanto paṭikkhipateva."
    ],
    "innerText": "478. Idāni dānakathā nāma hoti. Tattha dānaṃ nāma tividhaṃ – cāgacetanāpi, viratipi, deyyadhammopi. ‘‘Saddhā hiriyaṃ kusalañca dāna’’nti (a. ni. 8.30) āgataṭṭhāne cāgacetanā dānaṃ. ‘‘Abhayaṃ detī’’ti (a. ni. 8.39) āgataṭṭhāne virati. ‘‘Dānaṃ deti annaṃ pāna’’nti āgataṭṭhāne deyyadhammo. Tattha cāgacetanā ‘‘deti vā deyyadhammaṃ, denti vā etāya deyyadhamma’’nti dānaṃ. Virati avakhaṇḍanaṭṭhena lavanaṭṭhena vā dānaṃ. Sā hi uppajjamānā bhayabheravādisaṅkhātaṃ dussīlyacetanaṃ dāti khaṇḍeti lunāti vāti dānaṃ. Deyyadhammo diyyatīti dānaṃ. Evametaṃ tividhampi atthato cetasiko ceva dhammo deyyadhammo cāti duvidhaṃ hoti. Tattha yesaṃ ‘‘cetasikova dhammo dānaṃ, na deyyadhammo’’ti laddhi, seyyathāpi rājagirikasiddhatthikānaṃ; te sandhāya cetasikoti pucchā sakavādissa, paṭiññā itarassa. Atha naṃ deyyadhammavasena codetuṃ labbhāti pucchā sakavādissa, annādīni viya so na sakkā dātunti paṭikkhepo itarassa. Puna daḷhaṃ katvā puṭṭhe ‘‘abhayaṃ detī’’ti suttavasena paṭiññā tasseva. Phassapañhādīsu pana phassaṃ detītiādivohāraṃ apassanto paṭikkhipateva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "479"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniṭṭhaphala"
      },
      "ntiādi acetasikassa dhammassa dānabhāvadīpanatthaṃ vuttaṃ. Na hi acetasiko annādidhammo āyatiṃ vipākaṃ deti, iṭṭhaphalabhāvaniyamanatthaṃ panetaṃ vuttanti veditabbaṃ. Ayampi hettha adhippāyo – yadi acetasiko annādidhammo dānaṃ bhaveyya, hitacittena aniṭṭhaṃ akantaṃ bhesajjaṃ dentassa nimbabījādīhi viya nimbādayo aniṭṭhameva phalaṃ nibbatteyya. Yasmā panettha hitapharaṇacāgacetanā dānaṃ, tasmā aniṭṭhepi deyyadhamme dānaṃ iṭṭhaphalameva hotīti."
    ],
    "innerText": "479.Aniṭṭhaphalantiādi acetasikassa dhammassa dānabhāvadīpanatthaṃ vuttaṃ. Na hi acetasiko annādidhammo āyatiṃ vipākaṃ deti, iṭṭhaphalabhāvaniyamanatthaṃ panetaṃ vuttanti veditabbaṃ. Ayampi hettha adhippāyo – yadi acetasiko annādidhammo dānaṃ bhaveyya, hitacittena aniṭṭhaṃ akantaṃ bhesajjaṃ dentassa nimbabījādīhi viya nimbādayo aniṭṭhameva phalaṃ nibbatteyya. Yasmā panettha hitapharaṇacāgacetanā dānaṃ, tasmā aniṭṭhepi deyyadhamme dānaṃ iṭṭhaphalameva hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ paravādinā cetasikadhammassa dānabhāve patiṭṭhāpite sakavādī itarena pariyāyena deyyadhammassa dānabhāvaṃ sādhetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dānaṃ iṭṭhaphalaṃ vuttaṃ bhagavatā"
      },
      "tiādimāha. Paravādī pana cīvarādīnaṃ iṭṭhavipākataṃ apassanto paṭikkhipati. Suttasādhanaṃ paravādīvādepi yujjati sakavādīvādepi, na pana ekenatthena. Deyyadhammo iṭṭhaphaloti iṭṭhaphalabhāvamattameva paṭikkhittaṃ. Tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tena hi na vattabba"
      },
      "nti iṭṭhaphalabhāveneva na vattabbatā yujjati ",
      ". Dātabbaṭṭhena ",
      " pana deyyadhammo dānameva. Dinnañhi dānānaṃ saṅkarabhāvamocanatthameva ayaṃ kathāti."
    ],
    "innerText": "Evaṃ paravādinā cetasikadhammassa dānabhāve patiṭṭhāpite sakavādī itarena pariyāyena deyyadhammassa dānabhāvaṃ sādhetuṃ dānaṃ iṭṭhaphalaṃ vuttaṃ bhagavatātiādimāha. Paravādī pana cīvarādīnaṃ iṭṭhavipākataṃ apassanto paṭikkhipati. Suttasādhanaṃ paravādīvādepi yujjati sakavādīvādepi, na pana ekenatthena. Deyyadhammo iṭṭhaphaloti iṭṭhaphalabhāvamattameva paṭikkhittaṃ. Tasmā tena hi na vattabbanti iṭṭhaphalabhāveneva na vattabbatā yujjati . Dātabbaṭṭhena pana deyyadhammo dānameva. Dinnañhi dānānaṃ saṅkarabhāvamocanatthameva ayaṃ kathāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dānakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Paribhogamayapuññakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "483"
      },
      ". Idāni paribhogamayapuññakathā nāma hoti. Tattha ‘‘tesaṃ divā ca ratto ca, sadā puññaṃ pavaḍḍhatī’’ti (saṃ. ni. 1.47) ca ‘‘yassa bhikkhave, bhikkhu cīvaraṃ paribhuñjamāno’’ti (a. ni. 4.51) ca evamādīni suttāni ayoniso gahetvā yesaṃ paribhogamayaṃ ",
      " nāma puññaṃ atthī’’ti laddhi, seyyathāpi rājagirikasiddhatthikasammitiyānaṃ; te sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paribhogamaya"
      },
      "nti pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘puññaṃ nāma phassādayo kusalā dhammā, na tato paraṃ, tasmā phassādīhi te vaḍḍhitabba’’nti codetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paribhogamayo phasso"
      },
      "tiādi āraddhaṃ. Taṃ sabbaṃ itarena tesaṃ avaḍḍhanato paṭikkhittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Latāviyā"
      },
      "tiādīni ‘‘kiriyāya vā bhāvanāya vā vināpi yathā latādīni sayameva vaḍḍhanti, kiṃ te evaṃ vaḍḍhantī’’ti codanatthaṃ vuttāni. Tathā panassa avaḍḍhanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na hevā"
      },
      "ti paṭikkhittaṃ."
    ],
    "innerText": "483. Idāni paribhogamayapuññakathā nāma hoti. Tattha ‘‘tesaṃ divā ca ratto ca, sadā puññaṃ pavaḍḍhatī’’ti (saṃ. ni. 1.47) ca ‘‘yassa bhikkhave, bhikkhu cīvaraṃ paribhuñjamāno’’ti (a. ni. 4.51) ca evamādīni suttāni ayoniso gahetvā yesaṃ paribhogamayaṃ nāma puññaṃ atthī’’ti laddhi, seyyathāpi rājagirikasiddhatthikasammitiyānaṃ; te sandhāya paribhogamayanti pucchā sakavādissa, paṭiññā itarassa. Atha naṃ ‘‘puññaṃ nāma phassādayo kusalā dhammā, na tato paraṃ, tasmā phassādīhi te vaḍḍhitabba’’nti codetuṃ paribhogamayo phassotiādi āraddhaṃ. Taṃ sabbaṃ itarena tesaṃ avaḍḍhanato paṭikkhittaṃ. Latāviyātiādīni ‘‘kiriyāya vā bhāvanāya vā vināpi yathā latādīni sayameva vaḍḍhanti, kiṃ te evaṃ vaḍḍhantī’’ti codanatthaṃ vuttāni. Tathā panassa avaḍḍhanato na hevāti paṭikkhittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "484"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na samannāharatī"
      },
      "ti pañhe paṭiggāhakānaṃ paribhogena purimacetanā vaḍḍhati, evaṃ taṃ hoti puññanti laddhivasena paṭijānāti. Tato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāvaṭṭentassā"
      },
      "tiādīhi puṭṭho dāyakassa cāgacetanaṃ sandhāya paṭikkhipati. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāvaṭṭentassā"
      },
      "ti dānacetanāya purecārikena āvajjanena bhavaṅgaṃ anāvaṭṭentassa aparivaṭṭentassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anābhogassā"
      },
      "ti nirābhogassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asamannāharantassā"
      },
      "ti na samannāharantassa. Āvajjanañhi bhavaṅgaṃ vicchinditvā attano gatamagge uppajjamānaṃ dānacetanaṃ samannāharati nāma. Evaṃkiccena iminā cittena asamannāharantassa puññaṃ hotīti pucchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amanasikarontassā"
      },
      "ti ",
      " manaṃ akarontassa. Āvajjanena hi tadanantaraṃ uppajjamānaṃ manaṃ karoti nāma. Evaṃ akarontassāti attho. Upayogavacanasmiñhi etaṃ bhummaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Acetayantassā"
      },
      "ti cetanaṃ anuppādentassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apatthentassā"
      },
      "ti ",
      " patthanāsaṅkhātaṃ kusalacchandaṃ akarontassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaṇidahantassā"
      },
      "ti dānacetanāvasena cittaṃ aṭṭhapentassāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nanu āvaṭṭentassā"
      },
      "ti vāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ābhogassā"
      },
      "ti ābhogavato. Atha vā ābhogā assa, ābhogassa vā anantaraṃ taṃ puññaṃ hotīti attho."
    ],
    "innerText": "484.Na samannāharatīti pañhe paṭiggāhakānaṃ paribhogena purimacetanā vaḍḍhati, evaṃ taṃ hoti puññanti laddhivasena paṭijānāti. Tato anāvaṭṭentassātiādīhi puṭṭho dāyakassa cāgacetanaṃ sandhāya paṭikkhipati. Tattha anāvaṭṭentassāti dānacetanāya purecārikena āvajjanena bhavaṅgaṃ anāvaṭṭentassa aparivaṭṭentassa. Anābhogassāti nirābhogassa. Asamannāharantassāti na samannāharantassa. Āvajjanañhi bhavaṅgaṃ vicchinditvā attano gatamagge uppajjamānaṃ dānacetanaṃ samannāharati nāma. Evaṃkiccena iminā cittena asamannāharantassa puññaṃ hotīti pucchati. Amanasikarontassāti manaṃ akarontassa. Āvajjanena hi tadanantaraṃ uppajjamānaṃ manaṃ karoti nāma. Evaṃ akarontassāti attho. Upayogavacanasmiñhi etaṃ bhummaṃ. Acetayantassāti cetanaṃ anuppādentassa. Apatthentassāti patthanāsaṅkhātaṃ kusalacchandaṃ akarontassa. Appaṇidahantassāti dānacetanāvasena cittaṃ aṭṭhapentassāti attho. Nanu āvaṭṭentassāti vāre ābhogassāti ābhogavato. Atha vā ābhogā assa, ābhogassa vā anantaraṃ taṃ puññaṃ hotīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "485"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvinnaṃ phassāna"
      },
      "ntiādīsupi ekakkhaṇe dāyakassa dvinnaṃ phassādīnaṃ abhāvā paṭikkhipati, dāyakassa ca paribhuñjantassa cāti ubhinnaṃ phassādayo sandhāya paṭijānāti. Apicassa pañcannaṃ viññāṇānaṃ samodhānaṃ hotīti laddhi, tassāpi vasena paṭijānāti. Atha naṃ sakavādī pariyāyassa dvāraṃpidahitvā ujuvipaccanīkavasena codetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kusalā"
      },
      "dipañhaṃ pucchati. Tatrāpi kusalākusalānaṃ ekassekakkhaṇe sampayogābhāvaṃ sandhāya paṭikkhipati. Paribhogamayaṃ pana cittavippayuttaṃ uppajjatīti laddhiyā paṭijānāti. Atha naṃ sakavādī suttena niggaṇhāti."
    ],
    "innerText": "485.Dvinnaṃ phassānantiādīsupi ekakkhaṇe dāyakassa dvinnaṃ phassādīnaṃ abhāvā paṭikkhipati, dāyakassa ca paribhuñjantassa cāti ubhinnaṃ phassādayo sandhāya paṭijānāti. Apicassa pañcannaṃ viññāṇānaṃ samodhānaṃ hotīti laddhi, tassāpi vasena paṭijānāti. Atha naṃ sakavādī pariyāyassa dvāraṃpidahitvā ujuvipaccanīkavasena codetuṃ kusalādipañhaṃ pucchati. Tatrāpi kusalākusalānaṃ ekassekakkhaṇe sampayogābhāvaṃ sandhāya paṭikkhipati. Paribhogamayaṃ pana cittavippayuttaṃ uppajjatīti laddhiyā paṭijānāti. Atha naṃ sakavādī suttena niggaṇhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "486"
      },
      ". Suttasādhane ārāmaropakādīnaṃ anussaraṇapaṭisaṅkharaṇādivasena antarantarā uppajjamānaṃ ",
      " puññaṃ sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sadā puññaṃ pavaḍḍhatī"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appamāṇo tassa puññābhisando"
      },
      "ti idaṃ appamāṇavihārino dinnapaccayattā ca ‘‘evarūpo me cīvaraṃ paribhuñjatī’’ti anumodanavasena ca vuttaṃ. Taṃ so ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paribhogamaya"
      },
      "nti sallakkheti. Yasmā pana paṭiggāhakena paṭiggahetvā aparibhuttepi deyyadhamme puññaṃ hotiyeva, tasmā sakavādīvādova balavā, tattha paṭiggāhakena paṭiggahiteti attho daṭṭhabbo. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "486. Suttasādhane ārāmaropakādīnaṃ anussaraṇapaṭisaṅkharaṇādivasena antarantarā uppajjamānaṃ puññaṃ sandhāya sadā puññaṃ pavaḍḍhatīti vuttaṃ. Appamāṇo tassa puññābhisandoti idaṃ appamāṇavihārino dinnapaccayattā ca ‘‘evarūpo me cīvaraṃ paribhuñjatī’’ti anumodanavasena ca vuttaṃ. Taṃ so paribhogamayanti sallakkheti. Yasmā pana paṭiggāhakena paṭiggahetvā aparibhuttepi deyyadhamme puññaṃ hotiyeva, tasmā sakavādīvādova balavā, tattha paṭiggāhakena paṭiggahiteti attho daṭṭhabbo. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paribhogamayapuññakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Itodinnakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "488-491"
      },
      ". Idāni ",
      " ito dinnakathā nāma hoti. Tattha yesaṃ ‘‘ito dinnena yāpenti, petā kālaṅkatā tahi’’nti (pe. va. 19) vacanaṃ nissāya ‘‘yaṃ ito cīvarādi dinnaṃ teneva yāpentī’’ti laddhi, seyyathāpi rājagirikasiddhatthikānaṃ; te sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ito dinnenā"
      },
      "ti pucchā sakavādissa, paṭiññā itarassa ",
      ". Puna cīvarādivasena anuyutto paṭikkhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Añño aññassa kārako"
      },
      "ti aññassa vipākadāyakānaṃ kammānaṃ añño kārako, na attanāva attano kammaṃ karotīti vuttaṃ hoti. Evaṃ puṭṭho pana itaro suttavirodhabhayena paṭikkhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dānaṃ denta"
      },
      "nti dānaṃ dadamānaṃ disvāti attho. Tattha yasmā attano anumoditattā ca tesaṃ tattha bhogā uppajjanti, tasmāssa iminā kāraṇena laddhiṃ patiṭṭhapentassāpi appatiṭṭhitāva hoti. Na hi te ito dinneneva vatthunā yāpenti. Sesesupi suttasādhanesu eseva nayoti."
    ],
    "innerText": "488-491. Idāni ito dinnakathā nāma hoti. Tattha yesaṃ ‘‘ito dinnena yāpenti, petā kālaṅkatā tahi’’nti (pe. va. 19) vacanaṃ nissāya ‘‘yaṃ ito cīvarādi dinnaṃ teneva yāpentī’’ti laddhi, seyyathāpi rājagirikasiddhatthikānaṃ; te sandhāya ito dinnenāti pucchā sakavādissa, paṭiññā itarassa . Puna cīvarādivasena anuyutto paṭikkhipati. Añño aññassa kārakoti aññassa vipākadāyakānaṃ kammānaṃ añño kārako, na attanāva attano kammaṃ karotīti vuttaṃ hoti. Evaṃ puṭṭho pana itaro suttavirodhabhayena paṭikkhipati. Dānaṃ dentanti dānaṃ dadamānaṃ disvāti attho. Tattha yasmā attano anumoditattā ca tesaṃ tattha bhogā uppajjanti, tasmāssa iminā kāraṇena laddhiṃ patiṭṭhapentassāpi appatiṭṭhitāva hoti. Na hi te ito dinneneva vatthunā yāpenti. Sesesupi suttasādhanesu eseva nayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ito dinnakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Pathavīkammavipākotikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "492"
      },
      ". Idāni pathavī kammavipākotikathā nāma hoti. Tattha yasmā ‘‘atthi issariyasaṃvattaniyaṃ kammaṃ, ādhipaccasaṃvattaniyaṃ kamma’’nti ettha issarānaṃ bhāvo issariyaṃ nāma ",
      ", adhipatīnañca bhāvo ādhipaccaṃ nāma, pathavissariyaādhipaccasaṃvattanikañca kammaṃ atthīti vuttaṃ. Tasmā yesaṃ ‘‘pathavī kammavipāko’’ti laddhi, seyyathāpi andhakānaṃ; te sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pathavī"
      },
      "ti pucchā sakavādissa, paṭiññā itarassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhavedanīyā"
      },
      "tiādi kammavipākasabhāvadassanavasena vuttaṃ. ‘‘Phasso hotī’’tiādinā nayena niddiṭṭhesu vipākesu phasso sukhavedanīyādibhedo ",
      " hoti. So ca saññādayo ca sukhavedanādīhi sampayuttā, vedanādayo saññādīhi, sabbepi sārammaṇā, atthi ca nesaṃ purecārikaāvaṭṭanādisaṅkhātaṃ āvajjanaṃ, kammapaccayabhūtā cetanā, yo tattha iṭṭhavipāko, tassa patthanā, paṇidhānavasena pavattā mūlataṇhā, kiṃ te evarūpā pathavīti pucchati. Itaro paṭikkhipati. Paṭilomapucchādīni uttānatthāneva."
    ],
    "innerText": "492. Idāni pathavī kammavipākotikathā nāma hoti. Tattha yasmā ‘‘atthi issariyasaṃvattaniyaṃ kammaṃ, ādhipaccasaṃvattaniyaṃ kamma’’nti ettha issarānaṃ bhāvo issariyaṃ nāma , adhipatīnañca bhāvo ādhipaccaṃ nāma, pathavissariyaādhipaccasaṃvattanikañca kammaṃ atthīti vuttaṃ. Tasmā yesaṃ ‘‘pathavī kammavipāko’’ti laddhi, seyyathāpi andhakānaṃ; te sandhāya pathavīti pucchā sakavādissa, paṭiññā itarassa. Sukhavedanīyātiādi kammavipākasabhāvadassanavasena vuttaṃ. ‘‘Phasso hotī’’tiādinā nayena niddiṭṭhesu vipākesu phasso sukhavedanīyādibhedo hoti. So ca saññādayo ca sukhavedanādīhi sampayuttā, vedanādayo saññādīhi, sabbepi sārammaṇā, atthi ca nesaṃ purecārikaāvaṭṭanādisaṅkhātaṃ āvajjanaṃ, kammapaccayabhūtā cetanā, yo tattha iṭṭhavipāko, tassa patthanā, paṇidhānavasena pavattā mūlataṇhā, kiṃ te evarūpā pathavīti pucchati. Itaro paṭikkhipati. Paṭilomapucchādīni uttānatthāneva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "493"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammavipāko paresaṃ sādhāraṇo"
      },
      "ti pañhe phassādayo sandhāya paṭikkhipati, kammasamuṭṭhānaṃ rūpañca pathavīādīnaṃyeva ca sādhāraṇabhāvaṃ sandhāya paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asādhāraṇamaññesa"
      },
      "nti suttaṃ parasamayato āharitvā ",
      " dassitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbe sattā pathaviṃ paribhuñjantī"
      },
      "ti pañhe pathaviṃ anissite sandhāya paṭikkhipati, nissite sandhāya paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pathaviṃ aparibhuñjitvā parinibbāyantī"
      },
      "ti pañhe āruppe parinibbāyantānaṃ vasena paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammavipākaṃ akhepetvā"
      },
      "ti idaṃ parasamayavasena vuttaṃ. Kammavipākañhi khepetvāva parinibbāyantīti tesaṃ laddhi. Sakasamaye pana katokāsassa kammassa uppannaṃ vipākaṃ akhepetvā parinibbānaṃ natthi. Tesañca laddhiyā pathavī sādhāraṇavipākattā uppannavipākoyeva hoti. Taṃ vipākabhāvena ṭhitaṃ akhepetvā parinibbānaṃ na yujjatīti codetuṃ vaṭṭati. Itaro laddhivasena paṭikkhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkavattisattassa kammavipāka"
      },
      "nti pañhe asādhāraṇaṃ phassādiṃ sandhāya paṭikkhipati, sādhāraṇaṃ sandhāya paṭijānāti. Pathavīsamuddasūriyacandimādayo hi sabbesaṃ sādhāraṇakammavipākoti tesaṃ laddhi."
    ],
    "innerText": "493.Kammavipāko paresaṃ sādhāraṇoti pañhe phassādayo sandhāya paṭikkhipati, kammasamuṭṭhānaṃ rūpañca pathavīādīnaṃyeva ca sādhāraṇabhāvaṃ sandhāya paṭijānāti. Asādhāraṇamaññesanti suttaṃ parasamayato āharitvā dassitaṃ. Sabbe sattā pathaviṃ paribhuñjantīti pañhe pathaviṃ anissite sandhāya paṭikkhipati, nissite sandhāya paṭijānāti. Pathaviṃ aparibhuñjitvā parinibbāyantīti pañhe āruppe parinibbāyantānaṃ vasena paṭijānāti. Kammavipākaṃ akhepetvāti idaṃ parasamayavasena vuttaṃ. Kammavipākañhi khepetvāva parinibbāyantīti tesaṃ laddhi. Sakasamaye pana katokāsassa kammassa uppannaṃ vipākaṃ akhepetvā parinibbānaṃ natthi. Tesañca laddhiyā pathavī sādhāraṇavipākattā uppannavipākoyeva hoti. Taṃ vipākabhāvena ṭhitaṃ akhepetvā parinibbānaṃ na yujjatīti codetuṃ vaṭṭati. Itaro laddhivasena paṭikkhipati. Cakkavattisattassa kammavipākanti pañhe asādhāraṇaṃ phassādiṃ sandhāya paṭikkhipati, sādhāraṇaṃ sandhāya paṭijānāti. Pathavīsamuddasūriyacandimādayo hi sabbesaṃ sādhāraṇakammavipākoti tesaṃ laddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "494"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Issariyasaṃvattaniya"
      },
      "nti ettha issariyaṃ nāma bahudhanatā. Ādhipaccaṃ nāma sesajane attano vase vattetvā tehi garukātabbaṭṭhena adhipatibhāvo. Tattha kammaṃ paṭilābhavasena taṃsaṃvattanikaṃ nāma hoti, na janakavasena. Tasmā vipākabhāve asādhakametanti."
    ],
    "innerText": "494.Issariyasaṃvattaniyanti ettha issariyaṃ nāma bahudhanatā. Ādhipaccaṃ nāma sesajane attano vase vattetvā tehi garukātabbaṭṭhena adhipatibhāvo. Tattha kammaṃ paṭilābhavasena taṃsaṃvattanikaṃ nāma hoti, na janakavasena. Tasmā vipākabhāve asādhakametanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pathavī kammavipākotikathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Jarāmaraṇaṃ vipākotikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "495"
      },
      ". Idāni ",
      " jarāmaraṇaṃ vipākotikathā nāma hoti. Tattha yesaṃ ‘‘atthi dubbaṇṇasaṃvattaniyaṃ kammaṃ appāyukasaṃvattaniyaṃ kamma’’nti ettha dubbaṇṇatā nāma jarā. Appāyukatā nāma maraṇaṃ. Taṃsaṃvattaniyañca kammaṃ atthi. Tasmā jarāmaraṇaṃ vipākoti laddhi, seyyathāpi andhakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Paṭilomapañhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anārammaṇa"
      },
      "nti rūpadhammānaṃ tāva anārammaṇameva, arūpānaṃ pana jarāmaraṇaṃ sampayogalakkhaṇābhāvā anārammaṇameva."
    ],
    "innerText": "495. Idāni jarāmaraṇaṃ vipākotikathā nāma hoti. Tattha yesaṃ ‘‘atthi dubbaṇṇasaṃvattaniyaṃ kammaṃ appāyukasaṃvattaniyaṃ kamma’’nti ettha dubbaṇṇatā nāma jarā. Appāyukatā nāma maraṇaṃ. Taṃsaṃvattaniyañca kammaṃ atthi. Tasmā jarāmaraṇaṃ vipākoti laddhi, seyyathāpi andhakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Paṭilomapañhe anārammaṇanti rūpadhammānaṃ tāva anārammaṇameva, arūpānaṃ pana jarāmaraṇaṃ sampayogalakkhaṇābhāvā anārammaṇameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "496"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akusalānaṃ dhammānaṃ jarāmaraṇaṃ akusalānaṃ dhammānaṃ vipāko"
      },
      "ti pañhe jarāmaraṇena nāma aniṭṭhavipākena bhavitabbanti laddhiyā paṭijānāti ",
      ". Teneva kāraṇena kusalānaṃ dhammānaṃ jarāmaraṇassa kusalavipākataṃ paṭikkhipati. Parato cassa akusalavipākataññeva paṭijānāti."
    ],
    "innerText": "496.Akusalānaṃ dhammānaṃ jarāmaraṇaṃ akusalānaṃ dhammānaṃ vipākoti pañhe jarāmaraṇena nāma aniṭṭhavipākena bhavitabbanti laddhiyā paṭijānāti . Teneva kāraṇena kusalānaṃ dhammānaṃ jarāmaraṇassa kusalavipākataṃ paṭikkhipati. Parato cassa akusalavipākataññeva paṭijānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalānañca akusalānañcā"
      },
      "ti pucchāvasena ekato kataṃ, ekakkhaṇe pana taṃ natthi. Abyākatānaṃ avipākānaṃ jarāmaraṇaṃ vipākoti vattabbatāya pariyāyo natthi, tasmā abyākatavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pucchā na katā"
      },
      "."
    ],
    "innerText": "Kusalānañca akusalānañcāti pucchāvasena ekato kataṃ, ekakkhaṇe pana taṃ natthi. Abyākatānaṃ avipākānaṃ jarāmaraṇaṃ vipākoti vattabbatāya pariyāyo natthi, tasmā abyākatavasena pucchā na katā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "497"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dubbaṇṇasaṃvattaniya"
      },
      "nti ettha dubbaṇṇiyaṃ nāma aparisuddhavaṇṇatā. Appāyukatā nāma āyuno ciraṃ pavattituṃ asamatthatā. Tattha akusalakammaṃ kammasamuṭṭhānassa dubbaṇṇarūpassa kammapaccayo hoti, asadisattā panassa taṃvipāko na hoti. Utusamuṭṭhānādino pana taṃpaṭilābhavasena āyuno ca upacchedakavasena paccayo hoti. Evametaṃ pariyāyena taṃsaṃvattanikaṃ nāma hoti, na vipākaphassādīnaṃ viya janakavasena, tasmā vipākabhāve asādhakaṃ. Sesamettha heṭṭhā vuttasadisamevāti."
    ],
    "innerText": "497.Dubbaṇṇasaṃvattaniyanti ettha dubbaṇṇiyaṃ nāma aparisuddhavaṇṇatā. Appāyukatā nāma āyuno ciraṃ pavattituṃ asamatthatā. Tattha akusalakammaṃ kammasamuṭṭhānassa dubbaṇṇarūpassa kammapaccayo hoti, asadisattā panassa taṃvipāko na hoti. Utusamuṭṭhānādino pana taṃpaṭilābhavasena āyuno ca upacchedakavasena paccayo hoti. Evametaṃ pariyāyena taṃsaṃvattanikaṃ nāma hoti, na vipākaphassādīnaṃ viya janakavasena, tasmā vipākabhāve asādhakaṃ. Sesamettha heṭṭhā vuttasadisamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Jarāmaraṇaṃ vipākotikathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Ariyadhammavipākakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "498"
      },
      ". Idāni ",
      " ariyadhammavipākakathā nāma hoti. Tattha yesaṃ kilesappahānamattameva sāmaññaphalaṃ, na cittacetasikā dhammāti laddhi, seyyathāpi andhakānaṃ; te sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "natthi ariyadhammavipāko"
      },
      "ti pucchā sakavādissa. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyadhammavipāko"
      },
      "ti maggasaṅkhātassa ariyadhammassa vipāko. Kilesakkhayamattaṃ ariyaphalanti laddhiyā paṭiññā itarassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāmañña"
      },
      "nti samaṇabhāvo, maggassetaṃ nāmaṃ. ‘‘Sāmaññañca vo, bhikkhave, desessāmi sāmaññaphalañcā’’ti hi vuttaṃ. Brahmaññepi eseva nayo."
    ],
    "innerText": "498. Idāni ariyadhammavipākakathā nāma hoti. Tattha yesaṃ kilesappahānamattameva sāmaññaphalaṃ, na cittacetasikā dhammāti laddhi, seyyathāpi andhakānaṃ; te sandhāya natthi ariyadhammavipākoti pucchā sakavādissa. Tattha ariyadhammavipākoti maggasaṅkhātassa ariyadhammassa vipāko. Kilesakkhayamattaṃ ariyaphalanti laddhiyā paṭiññā itarassa. Sāmaññanti samaṇabhāvo, maggassetaṃ nāmaṃ. ‘‘Sāmaññañca vo, bhikkhave, desessāmi sāmaññaphalañcā’’ti hi vuttaṃ. Brahmaññepi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sotāpattiphalaṃ na vipāko"
      },
      "tiādīsu sotāpattimaggādīnaṃ apacayagāmitaṃ sandhāya ariyaphalānaṃ navipākabhāvaṃ paṭijānāti, dānaphalādīnaṃ paṭikkhipati ",
      ". So hi ācayagāmittikassa evaṃ atthaṃ dhāreti – vipākasaṅkhātaṃ ācayaṃ gacchanti, taṃ vā ācinantā gacchantīti ācayagāmino, vipākaṃ apacinantā gacchantīti apacayagāminoti. Tasmā evaṃ paṭijānāti ca paṭikkhipati ca."
    ],
    "innerText": "Sotāpattiphalaṃ na vipākotiādīsu sotāpattimaggādīnaṃ apacayagāmitaṃ sandhāya ariyaphalānaṃ navipākabhāvaṃ paṭijānāti, dānaphalādīnaṃ paṭikkhipati . So hi ācayagāmittikassa evaṃ atthaṃ dhāreti – vipākasaṅkhātaṃ ācayaṃ gacchanti, taṃ vā ācinantā gacchantīti ācayagāmino, vipākaṃ apacinantā gacchantīti apacayagāminoti. Tasmā evaṃ paṭijānāti ca paṭikkhipati ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "500"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmāvacaraṃ kusalaṃ savipākaṃ ācayagāmī"
      },
      "tiādikā pucchā paravādissa, paṭiññā ca paṭikkhepo ca sakavādissa. Lokiyañhi kusalaṃ vipākacutipaṭisandhiyo ceva vaṭṭañca ācinantaṃ gacchatīti ācayagāmi. Lokuttarakusalaṃ cutipaṭisandhiyo ceva vaṭṭañca apacinantaṃ gacchatīti apacayagāmi. Evametaṃ savipākameva hoti, na apacayagāmivacanamattena avipākaṃ. Imamatthaṃ sandhāyettha sakavādino paṭiññā ca paṭikkhepo ca veditabbāti."
    ],
    "innerText": "500.Kāmāvacaraṃ kusalaṃ savipākaṃ ācayagāmītiādikā pucchā paravādissa, paṭiññā ca paṭikkhepo ca sakavādissa. Lokiyañhi kusalaṃ vipākacutipaṭisandhiyo ceva vaṭṭañca ācinantaṃ gacchatīti ācayagāmi. Lokuttarakusalaṃ cutipaṭisandhiyo ceva vaṭṭañca apacinantaṃ gacchatīti apacayagāmi. Evametaṃ savipākameva hoti, na apacayagāmivacanamattena avipākaṃ. Imamatthaṃ sandhāyettha sakavādino paṭiññā ca paṭikkhepo ca veditabbāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ariyadhammavipākakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Vipāko vipākadhammadhammotikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "501"
      },
      ". Idāni vipāko vipākadhammadhammotikathā nāma ",
      " hoti. Tattha yasmā vipāko vipākassa aññamaññādipaccayavasena paccayo hoti, tasmā vipākopi vipākadhammadhammoti yesaṃ laddhi, seyyathāpi andhakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa vipāko"
      },
      "ti tassa vipākadhammadhammassa vipākassa yo vipāko, sopi te vipākadhammadhammo hotīti ",
      " pucchati. Itaro āyatiṃ vipākadānābhāvaṃ sandhāya paṭikkhipati. Dutiyaṃ puṭṭho tappaccayāpi aññassa vipākassa uppattiṃ sandhāya paṭijānāti. Evaṃ sante panassa kusalākusalassa viya tassāpi vipākassa vipāko, tassāpi vipākoti vaṭṭānupacchedo āpajjatīti puṭṭho samayavirodhabhayena paṭikkhipati."
    ],
    "innerText": "501. Idāni vipāko vipākadhammadhammotikathā nāma hoti. Tattha yasmā vipāko vipākassa aññamaññādipaccayavasena paccayo hoti, tasmā vipākopi vipākadhammadhammoti yesaṃ laddhi, seyyathāpi andhakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Tassa vipākoti tassa vipākadhammadhammassa vipākassa yo vipāko, sopi te vipākadhammadhammo hotīti pucchati. Itaro āyatiṃ vipākadānābhāvaṃ sandhāya paṭikkhipati. Dutiyaṃ puṭṭho tappaccayāpi aññassa vipākassa uppattiṃ sandhāya paṭijānāti. Evaṃ sante panassa kusalākusalassa viya tassāpi vipākassa vipāko, tassāpi vipākoti vaṭṭānupacchedo āpajjatīti puṭṭho samayavirodhabhayena paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipākoti vā"
      },
      "tiādimhi vacanasādhane pana yadi vipākassa vipākadhammadhammena ekatthatā bhaveyya, kusalākusalabyākatānaṃ ekatthataṃ āpajjeyyāti paṭikkhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipāko ca vipākadhammadhammo cā"
      },
      "ti ettha ",
      " ayaṃ adhippāyo – so hi catūsu vipākakkhandhesu ekekaṃ aññamaññapaccayādīsu paccayaṭṭhena vipākadhammadhammataṃ paccayuppannaṭṭhena ca vipākaṃ maññamāno ‘‘vipāko vipākadhammadhammo’’ti puṭṭho āmantāti paṭijānāti. Atha naṃ sakavādī ‘‘yasmā tayā ekakkhaṇe catūsu khandhesu vipāko vipākadhammadhammopi anuññāto, tasmā tesaṃ sahagatādibhāvo āpajjatī’’ti codetuṃ evamāha. Itaro kusalākusalasaṅkhātaṃ vipākadhammadhammaṃ sandhāya paṭikkhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taññeva akusala"
      },
      "nti yadi te vipāko vipākadhammadhammo, yo akusalavipāko, so akusalaṃ āpajjati. Kasmā? Vipākadhammadhammena ekattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taññeva kusala"
      },
      "ntiādīsupi eseva nayo."
    ],
    "innerText": "Vipākoti vātiādimhi vacanasādhane pana yadi vipākassa vipākadhammadhammena ekatthatā bhaveyya, kusalākusalabyākatānaṃ ekatthataṃ āpajjeyyāti paṭikkhipati. Vipāko ca vipākadhammadhammo cāti ettha ayaṃ adhippāyo – so hi catūsu vipākakkhandhesu ekekaṃ aññamaññapaccayādīsu paccayaṭṭhena vipākadhammadhammataṃ paccayuppannaṭṭhena ca vipākaṃ maññamāno ‘‘vipāko vipākadhammadhammo’’ti puṭṭho āmantāti paṭijānāti. Atha naṃ sakavādī ‘‘yasmā tayā ekakkhaṇe catūsu khandhesu vipāko vipākadhammadhammopi anuññāto, tasmā tesaṃ sahagatādibhāvo āpajjatī’’ti codetuṃ evamāha. Itaro kusalākusalasaṅkhātaṃ vipākadhammadhammaṃ sandhāya paṭikkhipati. Taññeva akusalanti yadi te vipāko vipākadhammadhammo, yo akusalavipāko, so akusalaṃ āpajjati. Kasmā? Vipākadhammadhammena ekattā. Taññeva kusalantiādīsupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "502"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññamaññapaccayā"
      },
      "ti idaṃ sahajātānaṃ paccayamattavasena vuttaṃ, tasmā asādhakaṃ. Mahābhūtānampi ca aññamaññapaccayatā vuttā, na ca tāni vipākāni, na ca vipākadhammadhammānīti."
    ],
    "innerText": "502.Aññamaññapaccayāti idaṃ sahajātānaṃ paccayamattavasena vuttaṃ, tasmā asādhakaṃ. Mahābhūtānampi ca aññamaññapaccayatā vuttā, na ca tāni vipākāni, na ca vipākadhammadhammānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vipāko vipākadhammadhammotikathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sattamo vaggo."
  }
]