[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "1. Puggalakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Suddhasaccikaṭṭho"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Anulomapaccanīkavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalo upalabbhati saccikaṭṭhaparamatthenā"
      },
      "ti ayaṃ pucchā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āmantā"
      },
      "ti ayaṃ paṭijānanā. Kassa panāyaṃ pucchā, kassa paṭijānanāti? Asukassāti na vattabbā. Bhagavatā hi imasmiṃ pakaraṇe nānappakārānaṃ laddhīnaṃ visodhanatthaṃ tantivasena mātikā ṭhapitā. Sā therena satthārā dinnanaye ṭhatvā tantivasena vibhattā. Na hi thero yattakā ettha vādamaggā dassitā, tattakehi vādīhi saddhiṃ vādena viggāhikakathaṃ kathesi. Evaṃ santepi pana tāsaṃ tāsaṃ kathānaṃ atthassa sukhāvadhāraṇatthaṃ sakavādīpucchā, paravādīpucchā, sakavādīpaṭiññā, paravādīpaṭiññāti evaṃ vibhāgaṃ dassetvāva atthavaṇṇanaṃ karissāma."
    ],
    "innerText": "1. Tattha puggalo upalabbhati saccikaṭṭhaparamatthenāti ayaṃ pucchā. Āmantāti ayaṃ paṭijānanā. Kassa panāyaṃ pucchā, kassa paṭijānanāti? Asukassāti na vattabbā. Bhagavatā hi imasmiṃ pakaraṇe nānappakārānaṃ laddhīnaṃ visodhanatthaṃ tantivasena mātikā ṭhapitā. Sā therena satthārā dinnanaye ṭhatvā tantivasena vibhattā. Na hi thero yattakā ettha vādamaggā dassitā, tattakehi vādīhi saddhiṃ vādena viggāhikakathaṃ kathesi. Evaṃ santepi pana tāsaṃ tāsaṃ kathānaṃ atthassa sukhāvadhāraṇatthaṃ sakavādīpucchā, paravādīpucchā, sakavādīpaṭiññā, paravādīpaṭiññāti evaṃ vibhāgaṃ dassetvāva atthavaṇṇanaṃ karissāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puggalo upalabbhati saccikaṭṭhaparamatthenā"
      },
      "ti hi ayaṃ sakavādīpucchā. Tāya ‘‘ye atthi puggaloti evaṃladdhikā puggalavādino, te evaṃ pucchitabbā’’ti dīpeti. Ke pana puggalavādinoti? Sāsane vajjiputtakā ceva samitiyā ca bahiddhā ca bahū aññatitthiyā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalo"
      },
      "ti attā, satto jīvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upalabbhatī"
      },
      "ti paññāya upagantvā labbhati, ñāyatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saccikaṭṭhaparamatthenā"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saccikaṭṭho"
      },
      "ti māyāmarīciādayo viya abhūtākārena aggahetabbo bhūtaṭṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paramattho"
      },
      "ti anussavādivasena aggahetabbo uttamattho. Ubhayenāpi yo parato ",
      " ‘‘puggalo upalabbhati saccikaṭṭhaparamatthena, rūpañca upalabbhatī’’tiādinā khandhāyatanadhātuindriyavasena sattapaññāsavidho dhammappabhedo dassito ",
      ". Yathā so bhūtena sabhāvaṭṭhena upalabbhati, evaṃ tava puggalo upalabbhatīti pucchati. Paravādī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āmantā"
      },
      "ti paṭijānāti. Paṭijānanañhi katthaci ‘‘āma, bhante’’ti āgacchati, katthaci ‘‘āmo’’ti paṭijānanaṃ āgacchati. Idha pana ‘‘āmantā’’ti āgataṃ. Tatrāyaṃ adhippāyo – so hi yaṃ taṃ parato vuttaṃ bhagavatā – ‘‘atthi puggalo attahitāya paṭipanno’’ti suttaṃ ",
      " āgataṃ, taṃ gahetvā yasmā pana bhagavā saccavādī na visaṃvādanapurekkhāro vācaṃ bhāsati, nāpi anussavādivasena dhammaṃ deseti, sadevakaṃ pana lokaṃ sayaṃ abhiññā sacchikatvā pavedeti, tasmā yo tena vutto ‘‘atthi puggalo attahitāya paṭipanno’’ti, so saccikaṭṭhaparamattheneva atthīti laddhiṃ gahetvā ‘‘āmantā’’ti paṭijānāti."
    ],
    "innerText": "Puggalo upalabbhati saccikaṭṭhaparamatthenāti hi ayaṃ sakavādīpucchā. Tāya ‘‘ye atthi puggaloti evaṃladdhikā puggalavādino, te evaṃ pucchitabbā’’ti dīpeti. Ke pana puggalavādinoti? Sāsane vajjiputtakā ceva samitiyā ca bahiddhā ca bahū aññatitthiyā. Tattha puggaloti attā, satto jīvo. Upalabbhatīti paññāya upagantvā labbhati, ñāyatīti attho. Saccikaṭṭhaparamatthenāti ettha saccikaṭṭhoti māyāmarīciādayo viya abhūtākārena aggahetabbo bhūtaṭṭho. Paramatthoti anussavādivasena aggahetabbo uttamattho. Ubhayenāpi yo parato ‘‘puggalo upalabbhati saccikaṭṭhaparamatthena, rūpañca upalabbhatī’’tiādinā khandhāyatanadhātuindriyavasena sattapaññāsavidho dhammappabhedo dassito . Yathā so bhūtena sabhāvaṭṭhena upalabbhati, evaṃ tava puggalo upalabbhatīti pucchati. Paravādī āmantāti paṭijānāti. Paṭijānanañhi katthaci ‘‘āma, bhante’’ti āgacchati, katthaci ‘‘āmo’’ti paṭijānanaṃ āgacchati. Idha pana ‘‘āmantā’’ti āgataṃ. Tatrāyaṃ adhippāyo – so hi yaṃ taṃ parato vuttaṃ bhagavatā – ‘‘atthi puggalo attahitāya paṭipanno’’ti suttaṃ āgataṃ, taṃ gahetvā yasmā pana bhagavā saccavādī na visaṃvādanapurekkhāro vācaṃ bhāsati, nāpi anussavādivasena dhammaṃ deseti, sadevakaṃ pana lokaṃ sayaṃ abhiññā sacchikatvā pavedeti, tasmā yo tena vutto ‘‘atthi puggalo attahitāya paṭipanno’’ti, so saccikaṭṭhaparamattheneva atthīti laddhiṃ gahetvā ‘‘āmantā’’ti paṭijānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassa tādisassa lesavacanassa chalavādassa okāsaṃ adadamāno sakavādī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yo saccikaṭṭho"
      },
      "tiādimāha. Tatrāyaṃ adhippāyo – yvāyaṃ parato ‘‘sappaccayo appaccayo, saṅkhato asaṅkhato, sassato, asassato sanimitto animitto’’ti evaṃ paridīpito rūpādisattapaññāsavidho dhammappabhedo āgato; na sammutisaccavasena, nāpi anussavādivasena gahetabbo. Attano pana bhūtatāya eva saccikaṭṭho, attapaccakkhatāya ca paramattho. Taṃ sandhāyāha – ‘‘yo saccikaṭṭho paramattho, tato so puggalo upalabbhati saccikaṭṭhaparamatthenā’’ti."
    ],
    "innerText": "Athassa tādisassa lesavacanassa chalavādassa okāsaṃ adadamāno sakavādī yo saccikaṭṭhotiādimāha. Tatrāyaṃ adhippāyo – yvāyaṃ parato ‘‘sappaccayo appaccayo, saṅkhato asaṅkhato, sassato, asassato sanimitto animitto’’ti evaṃ paridīpito rūpādisattapaññāsavidho dhammappabhedo āgato; na sammutisaccavasena, nāpi anussavādivasena gahetabbo. Attano pana bhūtatāya eva saccikaṭṭho, attapaccakkhatāya ca paramattho. Taṃ sandhāyāha – ‘‘yo saccikaṭṭho paramattho, tato so puggalo upalabbhati saccikaṭṭhaparamatthenā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato"
      },
      "ti karaṇavacanametaṃ, tasmā tena saccikaṭṭhaparamatthena so puggalo upalabbhatīti ayamettha attho. Idaṃ vuttaṃ hoti – ruppanādibhedena vā sappaccayādibhedena vā ākārena yo saccikaṭṭhaparamattho upalabbhati, kiṃ te puggalopi tenākārena upalabbhatīti? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na hevaṃ vattabbe"
      },
      "ti avajānanā paravādissa. So hi tathārūpaṃ puggalaṃ anicchanto avajānāti. Tatrāyaṃ padacchedo – ‘na hi evaṃ vattabbe’ti, na hi evantipi vaṭṭati. Dvinnampi evaṃ na vattabboti attho."
    ],
    "innerText": "Tatoti karaṇavacanametaṃ, tasmā tena saccikaṭṭhaparamatthena so puggalo upalabbhatīti ayamettha attho. Idaṃ vuttaṃ hoti – ruppanādibhedena vā sappaccayādibhedena vā ākārena yo saccikaṭṭhaparamattho upalabbhati, kiṃ te puggalopi tenākārena upalabbhatīti? Na hevaṃ vattabbeti avajānanā paravādissa. So hi tathārūpaṃ puggalaṃ anicchanto avajānāti. Tatrāyaṃ padacchedo – ‘na hi evaṃ vattabbe’ti, na hi evantipi vaṭṭati. Dvinnampi evaṃ na vattabboti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ājānāhi niggaha"
      },
      "nti sakavādivacanaṃ. Yasmā te purimāya vattabbapaṭiññāya pacchimā navattabbapaṭiññā, pacchimāya ca purimā na sandhiyati, tasmāpi niggahaṃ patto. Taṃ niggahaṃ dosaṃ ",
      " aparādhaṃ sampaṭicchāhīti attho. Evaṃ ",
      " niggahaṃ ājānāpetvā idāni taṃ ṭhapanāya ceva anulomapaṭilomato pāpanāropanānañca vasena pākaṭaṃ karonto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hañci puggalo"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hañci puggalo upalabbhatī"
      },
      "ti yadi puggalo upalabbhati, sace puggalo upalabbhati saccikaṭṭhaparamatthenāti attho. Ayaṃ tāva paravādīpakkhassa ṭhapanato niggahapāpanāropanānaṃ lakkhaṇabhūtā ",
      " anulomaṭhapanā nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena vata re"
      },
      "tiādi anulomapakkhe niggahassa pāpitattā anulomapāpanā nāma. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tenā"
      },
      "ti kāraṇavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatā"
      },
      "ti okappanavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Re"
      },
      "ti āmantanavacanaṃ. Idaṃ vuttaṃ hoti – tena, re vattabbe vata, re hambho, bhadramukha, tena kāraṇena vattabboyevāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ tattha vadesī"
      },
      "tiādi anulomapakkhe niggahassa āropitattā anulomaropanā nāma. Yaṃ tassa pariyosāne micchātipadaṃ tassa purato idaṃ te’ti āharitabbaṃ. Idaṃ te micchāti ayañhettha attho. Parato ca pāḷiyaṃ etaṃ āgatameva."
    ],
    "innerText": "Ājānāhi niggahanti sakavādivacanaṃ. Yasmā te purimāya vattabbapaṭiññāya pacchimā navattabbapaṭiññā, pacchimāya ca purimā na sandhiyati, tasmāpi niggahaṃ patto. Taṃ niggahaṃ dosaṃ aparādhaṃ sampaṭicchāhīti attho. Evaṃ niggahaṃ ājānāpetvā idāni taṃ ṭhapanāya ceva anulomapaṭilomato pāpanāropanānañca vasena pākaṭaṃ karonto hañci puggalotiādimāha. Tattha hañci puggalo upalabbhatīti yadi puggalo upalabbhati, sace puggalo upalabbhati saccikaṭṭhaparamatthenāti attho. Ayaṃ tāva paravādīpakkhassa ṭhapanato niggahapāpanāropanānaṃ lakkhaṇabhūtā anulomaṭhapanā nāma. Tena vata retiādi anulomapakkhe niggahassa pāpitattā anulomapāpanā nāma. Tattha tenāti kāraṇavacanaṃ. Vatāti okappanavacanaṃ. Reti āmantanavacanaṃ. Idaṃ vuttaṃ hoti – tena, re vattabbe vata, re hambho, bhadramukha, tena kāraṇena vattabboyevāti. Yaṃ tattha vadesītiādi anulomapakkhe niggahassa āropitattā anulomaropanā nāma. Yaṃ tassa pariyosāne micchātipadaṃ tassa purato idaṃ te’ti āharitabbaṃ. Idaṃ te micchāti ayañhettha attho. Parato ca pāḷiyaṃ etaṃ āgatameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "No ce pana vattabbe"
      },
      "tiādi ‘‘na hevaṃ vattabbe’’ti paṭikkhittapakkhassa ṭhapitattā paṭilomato niggahapāpanāropanānaṃ lakkhaṇabhūtā paṭilomaṭhapanā nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "No ca vata re"
      },
      "tiādi paṭilomapakkhe niggahassa pāpitattā paṭilomapāpanā nāma. Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yaṃ tattha vadesī"
      },
      "tiādi paṭilomapakkhe niggahassa āropitattā paṭilomaropanā nāma. Idhāpi pariyosāne micchātipadassa purato idaṃ teti āharitabbameva. Paratopi evarūpesu ṭhānesu eseva nayo."
    ],
    "innerText": "No ce pana vattabbetiādi ‘‘na hevaṃ vattabbe’’ti paṭikkhittapakkhassa ṭhapitattā paṭilomato niggahapāpanāropanānaṃ lakkhaṇabhūtā paṭilomaṭhapanā nāma. No ca vata retiādi paṭilomapakkhe niggahassa pāpitattā paṭilomapāpanā nāma. Puna yaṃ tattha vadesītiādi paṭilomapakkhe niggahassa āropitattā paṭilomaropanā nāma. Idhāpi pariyosāne micchātipadassa purato idaṃ teti āharitabbameva. Paratopi evarūpesu ṭhānesu eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ ādito paṭṭhāya saṅkhepattho – yadi puggalo upalabbhati saccikaṭṭhaparamatthena, tena vata bho so upalabbhatīti vattabbo. Yaṃ pana tattha vadesi ‘‘vattabbo kho purimapañhe ‘saccikaṭṭhaparamatthena upalabbhatī’ti, no ca vattabbo dutiyapañhe ‘tato so puggalo upalabbhatī’’’ti, idaṃ te micchāti evaṃ tāva anulomato ṭhapanāpāpanāropanā honti. Atha na vattabbo dutiyapañhe ‘‘tato so upalabbhatī’’ti, purimapañhepi na vattabbova. Yaṃ panettha vadesi ‘‘vattabbo kho purimapañhe ‘saccikaṭṭhaparamatthena upalabbhatī’ti, no ",
      " ca vattabbo dutiyapañhe ‘tato so puggalo upalabbhatī’’’ti, idaṃ te micchāti evaṃ paṭilomato ṭhapanāpāpanāropanā honti. Evametaṃ niggahassa ca anulomapaṭilomato catunnaṃ pāpanāropanānañca vuttattā upalabbhatītiādikaṃ anulomapañcakaṃ nāma. Ettha ca kiñcāpi anulomato pāpanāropanāhi eko, paṭilomato pāpanāropanāhi ekoti dve niggahā katā. ‘Ājānāhi ",
      " niggaha’nti etasseva panettha ",
      " puggalo upalabbhatīti paṭhamaṃ vādaṃ nissāya paṭhamassa niggahassa dvīhākārehi āropitattā ekovāyaṃ niggahoti paṭhamo niggaho."
    ],
    "innerText": "Tatrāyaṃ ādito paṭṭhāya saṅkhepattho – yadi puggalo upalabbhati saccikaṭṭhaparamatthena, tena vata bho so upalabbhatīti vattabbo. Yaṃ pana tattha vadesi ‘‘vattabbo kho purimapañhe ‘saccikaṭṭhaparamatthena upalabbhatī’ti, no ca vattabbo dutiyapañhe ‘tato so puggalo upalabbhatī’’’ti, idaṃ te micchāti evaṃ tāva anulomato ṭhapanāpāpanāropanā honti. Atha na vattabbo dutiyapañhe ‘‘tato so upalabbhatī’’ti, purimapañhepi na vattabbova. Yaṃ panettha vadesi ‘‘vattabbo kho purimapañhe ‘saccikaṭṭhaparamatthena upalabbhatī’ti, no ca vattabbo dutiyapañhe ‘tato so puggalo upalabbhatī’’’ti, idaṃ te micchāti evaṃ paṭilomato ṭhapanāpāpanāropanā honti. Evametaṃ niggahassa ca anulomapaṭilomato catunnaṃ pāpanāropanānañca vuttattā upalabbhatītiādikaṃ anulomapañcakaṃ nāma. Ettha ca kiñcāpi anulomato pāpanāropanāhi eko, paṭilomato pāpanāropanāhi ekoti dve niggahā katā. ‘Ājānāhi niggaha’nti etasseva panettha puggalo upalabbhatīti paṭhamaṃ vādaṃ nissāya paṭhamassa niggahassa dvīhākārehi āropitattā ekovāyaṃ niggahoti paṭhamo niggaho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Idāni paccanīkanayo hoti. Tattha pucchā paravādissa. So hi ‘‘atthi puggalo attahitāya paṭipanno’’ti gahitattā ‘‘nupalabbhatī’’ti asampaṭicchanto evaṃ pucchati. Sakavādī yathā rūpādidhammā upalabbhanti, evaṃ anupalabbhanīyato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āmantā"
      },
      "ti paṭijānāti. Puna itaro attanā adhippetaṃ saccikaṭṭhaṃyeva sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yo saccikaṭṭho"
      },
      "tiādimāha. Sammutisaccaparamatthasaccāni vā ekato katvāpi evamāha. Sakavādī ‘puggalo’ti upādāpaññattisabbhāvatopi dvinnaṃ saccānaṃ ekato katvā pucchitattāpi na ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "heva"
      },
      "nti paṭikkhipati."
    ],
    "innerText": "2. Idāni paccanīkanayo hoti. Tattha pucchā paravādissa. So hi ‘‘atthi puggalo attahitāya paṭipanno’’ti gahitattā ‘‘nupalabbhatī’’ti asampaṭicchanto evaṃ pucchati. Sakavādī yathā rūpādidhammā upalabbhanti, evaṃ anupalabbhanīyato āmantāti paṭijānāti. Puna itaro attanā adhippetaṃ saccikaṭṭhaṃyeva sandhāya yo saccikaṭṭhotiādimāha. Sammutisaccaparamatthasaccāni vā ekato katvāpi evamāha. Sakavādī ‘puggalo’ti upādāpaññattisabbhāvatopi dvinnaṃ saccānaṃ ekato katvā pucchitattāpi na hevanti paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni kiñcāpi tena paṭhamaṃ paramatthasaccavasena nupalabbhanīyatā sampaṭicchitā, pacchā sammutisaccavasena vomissakavasena vā paṭikkhittā. Paravādī pana ‘nupalabbhatī’ti vacanasāmaññamattaṃ chalavādaṃ nissāya yaṃ tayā paṭhamaṃ paṭiññātaṃ, taṃ pacchā paṭikkhittanti bhaṇḍanassa paṭibhaṇḍanaṃ viya attano katassa niggahakammassa paṭikammaṃ karonto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ājānāhi paṭikamma"
      },
      "nti āha. Idāni yathāssa anulomapañcake sakavādinā vādaṭṭhapanaṃ katvā anulomapaṭilomato pāpanāropanāhi niggaho pākaṭo kato, evaṃ paṭikammaṃ pākaṭaṃ karonto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hañci puggalo"
      },
      "tiādimāha. Taṃ heṭṭhā vuttanayeneva atthato veditabbaṃ. Yasmā panettha ṭhapanā nāma paravādīpakkhassa ṭhapanato ",
      " ‘‘ayaṃ tava doso’’ti dassetuṃ ṭhapanamattameva hoti, na niggahassa vā paṭikammassa vā pākaṭabhāvakaraṇaṃ, pāpanāropanāhi panassa pākaṭakaraṇaṃ hoti. Tasmā idaṃ anulomapaṭilomato pāpanāropanānaṃ vasena catūhākārehi. Paṭikammassa katattā paṭikammacatukkaṃ nāmāti ekaṃ catukkaṃ veditabbaṃ."
    ],
    "innerText": "Idāni kiñcāpi tena paṭhamaṃ paramatthasaccavasena nupalabbhanīyatā sampaṭicchitā, pacchā sammutisaccavasena vomissakavasena vā paṭikkhittā. Paravādī pana ‘nupalabbhatī’ti vacanasāmaññamattaṃ chalavādaṃ nissāya yaṃ tayā paṭhamaṃ paṭiññātaṃ, taṃ pacchā paṭikkhittanti bhaṇḍanassa paṭibhaṇḍanaṃ viya attano katassa niggahakammassa paṭikammaṃ karonto ājānāhi paṭikammanti āha. Idāni yathāssa anulomapañcake sakavādinā vādaṭṭhapanaṃ katvā anulomapaṭilomato pāpanāropanāhi niggaho pākaṭo kato, evaṃ paṭikammaṃ pākaṭaṃ karonto hañci puggalotiādimāha. Taṃ heṭṭhā vuttanayeneva atthato veditabbaṃ. Yasmā panettha ṭhapanā nāma paravādīpakkhassa ṭhapanato ‘‘ayaṃ tava doso’’ti dassetuṃ ṭhapanamattameva hoti, na niggahassa vā paṭikammassa vā pākaṭabhāvakaraṇaṃ, pāpanāropanāhi panassa pākaṭakaraṇaṃ hoti. Tasmā idaṃ anulomapaṭilomato pāpanāropanānaṃ vasena catūhākārehi. Paṭikammassa katattā paṭikammacatukkaṃ nāmāti ekaṃ catukkaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Evaṃ paṭikammaṃ katvā idāni yvāssa anulomapañcake sakavādinā niggaho kato, tassa tameva chalavādaṃ nissāya dukkaṭabhāvaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tvañce pana maññasī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tvaṃ ce pana maññasī"
      },
      "ti yadi tvaṃ maññasi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vattabbe kho"
      },
      "ti idaṃ paccanīke āmantāti paṭiññaṃ sandhāya vuttaṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "No ca vattabbe"
      },
      "ti idaṃ pana na hevāti avajānanaṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena tava tatthā"
      },
      "ti tena kāraṇena tvaṃyeva tasmiṃ nupalabbhatīti pakkhe – ‘‘hevaṃ paṭijānantanti āmantā’’ti ",
      " evaṃ paṭijānanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hevaṃ niggahetabbe"
      },
      "ti puna na hevāti avajānanto evaṃ niggahetabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha taṃ niggaṇhāmā"
      },
      "ti athevaṃ niggahārahaṃ taṃ niggaṇhāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suniggahito ca hosī"
      },
      "ti sakena matena niggahitattā suniggahito ca bhavasi."
    ],
    "innerText": "3. Evaṃ paṭikammaṃ katvā idāni yvāssa anulomapañcake sakavādinā niggaho kato, tassa tameva chalavādaṃ nissāya dukkaṭabhāvaṃ dassento tvañce pana maññasītiādimāha. Tattha tvaṃ ce pana maññasīti yadi tvaṃ maññasi. Vattabbe khoti idaṃ paccanīke āmantāti paṭiññaṃ sandhāya vuttaṃ . No ca vattabbeti idaṃ pana na hevāti avajānanaṃ sandhāya vuttaṃ. Tena tava tatthāti tena kāraṇena tvaṃyeva tasmiṃ nupalabbhatīti pakkhe – ‘‘hevaṃ paṭijānantanti āmantā’’ti evaṃ paṭijānanto. Hevaṃ niggahetabbeti puna na hevāti avajānanto evaṃ niggahetabbo. Atha taṃ niggaṇhāmāti athevaṃ niggahārahaṃ taṃ niggaṇhāma. Suniggahito ca hosīti sakena matena niggahitattā suniggahito ca bhavasi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evamassa niggahetabbabhāvaṃ dassetvā idāni taṃ niggaṇhanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hañcī"
      },
      "tiādimāha. Tattha ṭhapanāpāpanāropanā heṭṭhā vuttanayeneva veditabbā. Pariyosāne pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "idaṃ te micchā"
      },
      "ti idaṃ tava vacanaṃ micchā hotīti attho. Idaṃ chalavādena catūhi ākārehi niggahassa katattā niggahacatukkaṃ nāma."
    ],
    "innerText": "Evamassa niggahetabbabhāvaṃ dassetvā idāni taṃ niggaṇhanto hañcītiādimāha. Tattha ṭhapanāpāpanāropanā heṭṭhā vuttanayeneva veditabbā. Pariyosāne pana idaṃ te micchāti idaṃ tava vacanaṃ micchā hotīti attho. Idaṃ chalavādena catūhi ākārehi niggahassa katattā niggahacatukkaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Evaṃ niggahaṃ katvāpi idāni ‘‘yadi ayaṃ mayā tava matena kato ",
      " niggaho dunniggaho, yo mama tayā heṭṭhā anulomapañcake kato niggaho, sopi dunniggaho’’ti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ese ce dunniggahite"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ese ce dunniggahite"
      },
      "ti eso ce tava vādo mayā dunniggahito. Atha vā eso ce tava mayā kato niggaho dunniggaho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hevamevaṃ tattha dakkhā"
      },
      "ti tatthāpi tayā mama heṭṭhā kate niggahe evamevaṃ passa. Idāni yvāssa heṭṭhā sakavādinā niggaho kato, taṃ ‘‘vattabbe kho’’tiādivacanena dassetvā puna taṃ niggahaṃ aniggahabhāvaṃ upanento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "no ca mayaṃ tayā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "no ca mayaṃ tayā tattha hetāya paṭiññāyā"
      },
      "tiādīsu ayamattho – yasmā so tayā mama kato niggaho dunniggaho, tasmā mayaṃ tayā tattha anulomapañcake āmantāti etāya paṭiññāya evaṃ paṭijānantā puna na hevāti paṭikkhepe katepi ‘‘ājānāhi niggaha’’nti evaṃ na niggahetabboyeva. Evaṃ aniggahetabbampi maṃ niggaṇhāsi, īdisena pana niggahena dunniggahitā mayaṃ homa."
    ],
    "innerText": "4. Evaṃ niggahaṃ katvāpi idāni ‘‘yadi ayaṃ mayā tava matena kato niggaho dunniggaho, yo mama tayā heṭṭhā anulomapañcake kato niggaho, sopi dunniggaho’’ti dassento ese ce dunniggahitetiādimāha. Tattha ese ce dunniggahiteti eso ce tava vādo mayā dunniggahito. Atha vā eso ce tava mayā kato niggaho dunniggaho. Hevamevaṃ tattha dakkhāti tatthāpi tayā mama heṭṭhā kate niggahe evamevaṃ passa. Idāni yvāssa heṭṭhā sakavādinā niggaho kato, taṃ ‘‘vattabbe kho’’tiādivacanena dassetvā puna taṃ niggahaṃ aniggahabhāvaṃ upanento no ca mayaṃ tayātiādimāha. Tattha no ca mayaṃ tayā tattha hetāya paṭiññāyātiādīsu ayamattho – yasmā so tayā mama kato niggaho dunniggaho, tasmā mayaṃ tayā tattha anulomapañcake āmantāti etāya paṭiññāya evaṃ paṭijānantā puna na hevāti paṭikkhepe katepi ‘‘ājānāhi niggaha’’nti evaṃ na niggahetabboyeva. Evaṃ aniggahetabbampi maṃ niggaṇhāsi, īdisena pana niggahena dunniggahitā mayaṃ homa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni yaṃ niggahaṃ sandhāya ‘‘dunniggahitā ca homā’’ti avoca, taṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hañci puggalo…pe… idaṃ te micchā"
      },
      "tiāha. Evamidaṃ anulomapaṭilomato ",
      " catūhi pāpanāropanāhi niggahassa upanītattā upanayanacatukkaṃ nāma hoti."
    ],
    "innerText": "Idāni yaṃ niggahaṃ sandhāya ‘‘dunniggahitā ca homā’’ti avoca, taṃ dassetuṃ hañci puggalo…pe… idaṃ te micchātiāha. Evamidaṃ anulomapaṭilomato catūhi pāpanāropanāhi niggahassa upanītattā upanayanacatukkaṃ nāma hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". Idāni ‘‘na hevaṃ niggahetabbe’’tiādikaṃ niggamanacatukkaṃ nāma hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na hevaṃ niggahetabbe"
      },
      "ti yathāhaṃ tayā niggahito, na hi evaṃ niggahetabbo. Etassa hi niggahassa dunniggahabhāvo mayā sādhito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena hī"
      },
      "ti tena kāraṇena, yasmā esa niggaho dunniggaho, tasmā ",
      " yaṃ maṃ niggaṇhāsi hañci puggalo…pe… idaṃ te micchāti, idaṃ niggaṇhanaṃ tava micchāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena hi ye kate niggahe"
      },
      "ti yena kāraṇena idaṃ micchā, tena kāraṇena yo tayā niggaho kato, so dukkaṭo. Yaṃ mayā paṭikammaṃ kataṃ, tadeva sukataṃ. Yāpi ",
      " cesā paṭikammacatukkādivasena kathāmaggasampaṭipādanā katā, sāpi sukatā. Evametaṃ puggalo upalabbhatītiādikassa anulomapañcakassa nupalabbhatītiādikānaṃ paṭikammaniggahopanayananiggamanacatukkānaṃ vasena anulomapaccanīkapañcakaṃ nāma niddiṭṭhanti veditabbaṃ. Ettāvatā sakavādino pubbapakkhe sati paravādino vacanasāmaññamattena chalavādena jayo hoti."
    ],
    "innerText": "5. Idāni ‘‘na hevaṃ niggahetabbe’’tiādikaṃ niggamanacatukkaṃ nāma hoti. Tattha na hevaṃ niggahetabbeti yathāhaṃ tayā niggahito, na hi evaṃ niggahetabbo. Etassa hi niggahassa dunniggahabhāvo mayā sādhito. Tena hīti tena kāraṇena, yasmā esa niggaho dunniggaho, tasmā yaṃ maṃ niggaṇhāsi hañci puggalo…pe… idaṃ te micchāti, idaṃ niggaṇhanaṃ tava micchāti attho. Tena hi ye kate niggaheti yena kāraṇena idaṃ micchā, tena kāraṇena yo tayā niggaho kato, so dukkaṭo. Yaṃ mayā paṭikammaṃ kataṃ, tadeva sukataṃ. Yāpi cesā paṭikammacatukkādivasena kathāmaggasampaṭipādanā katā, sāpi sukatā. Evametaṃ puggalo upalabbhatītiādikassa anulomapañcakassa nupalabbhatītiādikānaṃ paṭikammaniggahopanayananiggamanacatukkānaṃ vasena anulomapaccanīkapañcakaṃ nāma niddiṭṭhanti veditabbaṃ. Ettāvatā sakavādino pubbapakkhe sati paravādino vacanasāmaññamattena chalavādena jayo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Paccanīkānulomavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". Idāni yathā paravādino pubbapakkhe sati sakavādino dhammeneva tathena sujayo hoti, tathā vāduppattiṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalo nupalabbhatī"
      },
      "ti paccanīkānulomapañcakaṃ āraddhaṃ. Tattha paccanīke pucchā paravādissa, rūpādibhedaṃ saccikaṭṭhaparamatthaṃ sandhāya paṭiññā sakavādissa. Suddhasammutisaccaṃ vā paramatthamissakaṃ vā sammutisaccaṃ sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yo saccikaṭṭho"
      },
      "ti puna anuyogo paravādissa, sammutivasena nupalabbhatīti navattabbattā missakavasena vā anuyogassa saṃkiṇṇattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na heva"
      },
      "nti paṭikkhepo sakavādissa. Paṭiññātaṃ paṭikkhipatīti vacanasāmaññamattena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ājānāhi niggaha"
      },
      "ntiādivacanaṃ paravādissa. Evamayaṃ puggalo nupalabbhatīti dutiyavādaṃ nissāya dutiyo niggaho hotīti veditabbo. Evaṃ tena chalena niggaho āropito."
    ],
    "innerText": "6. Idāni yathā paravādino pubbapakkhe sati sakavādino dhammeneva tathena sujayo hoti, tathā vāduppattiṃ dassetuṃ puggalo nupalabbhatīti paccanīkānulomapañcakaṃ āraddhaṃ. Tattha paccanīke pucchā paravādissa, rūpādibhedaṃ saccikaṭṭhaparamatthaṃ sandhāya paṭiññā sakavādissa. Suddhasammutisaccaṃ vā paramatthamissakaṃ vā sammutisaccaṃ sandhāya yo saccikaṭṭhoti puna anuyogo paravādissa, sammutivasena nupalabbhatīti navattabbattā missakavasena vā anuyogassa saṃkiṇṇattā na hevanti paṭikkhepo sakavādissa. Paṭiññātaṃ paṭikkhipatīti vacanasāmaññamattena ājānāhi niggahantiādivacanaṃ paravādissa. Evamayaṃ puggalo nupalabbhatīti dutiyavādaṃ nissāya dutiyo niggaho hotīti veditabbo. Evaṃ tena chalena niggaho āropito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7-10"
      },
      ". Idāni ",
      " dhammena samena attano vāde jayaṃ ",
      " dassetuṃ anulomanaye pucchā sakavādissa, attano laddhiṃ nissāya paṭiññā paravādissa. Laddhiyā okāsaṃ adatvā paramatthavasena puna anuyogo sakavādissa, paramatthavasena puggalassa abhāvato paṭikkhepo paravādissa. Tato paraṃ dhammena samena attano jayadassanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ājānāhi paṭikamma"
      },
      "ntiādi sabbaṃ sakavādīvacanameva hoti. Tattha sabbesaṃ paṭikammaniggahopanayananiggamanacatukkānaṃ heṭṭhā vuttanayeneva attho veditabbo. Evamidaṃ puggalo nupalabbhatītiādikassa paccanīkapañcakassa upalabbhatītiādīnaṃ paṭikammaniggahopanayananiggamanacatukkānañca vasena paccanīkānulomapañcakaṃ nāma niddiṭṭhaṃ hoti. Evametāni paṭhamasaccikaṭṭhe dve pañcakāni niddiṭṭhāni. Tattha purimapañcake ",
      " paravādissa sakavādinā kato niggaho suniggaho. Sakavādissa pana paravādinā chalavādaṃ nissāya paṭikammaṃ katvā attanā sādhito jayo dujjayo. Dutiyapañcake sakavādissa paravādinā kato niggaho dunniggaho. Paravādissa pana sakavādinā dhammavādaṃ nissāya paṭikammaṃ katvā attanā sādhito jayo sujayoti paṭhamasaccikaṭṭho. Tatthetaṃ vuccati –"
    ],
    "innerText": "7-10. Idāni dhammena samena attano vāde jayaṃ dassetuṃ anulomanaye pucchā sakavādissa, attano laddhiṃ nissāya paṭiññā paravādissa. Laddhiyā okāsaṃ adatvā paramatthavasena puna anuyogo sakavādissa, paramatthavasena puggalassa abhāvato paṭikkhepo paravādissa. Tato paraṃ dhammena samena attano jayadassanatthaṃ ājānāhi paṭikammantiādi sabbaṃ sakavādīvacanameva hoti. Tattha sabbesaṃ paṭikammaniggahopanayananiggamanacatukkānaṃ heṭṭhā vuttanayeneva attho veditabbo. Evamidaṃ puggalo nupalabbhatītiādikassa paccanīkapañcakassa upalabbhatītiādīnaṃ paṭikammaniggahopanayananiggamanacatukkānañca vasena paccanīkānulomapañcakaṃ nāma niddiṭṭhaṃ hoti. Evametāni paṭhamasaccikaṭṭhe dve pañcakāni niddiṭṭhāni. Tattha purimapañcake paravādissa sakavādinā kato niggaho suniggaho. Sakavādissa pana paravādinā chalavādaṃ nissāya paṭikammaṃ katvā attanā sādhito jayo dujjayo. Dutiyapañcake sakavādissa paravādinā kato niggaho dunniggaho. Paravādissa pana sakavādinā dhammavādaṃ nissāya paṭikammaṃ katvā attanā sādhito jayo sujayoti paṭhamasaccikaṭṭho. Tatthetaṃ vuccati –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Niggaho paravādissa, suddho paṭhamapañcake;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Asuddho pana tasseva, paṭikammajayo tahiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Niggaho sakavādissa, asuddho dutiyapañcake;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Visuddho pana tasseva, paṭikammajayo tahiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tasmā dvīsupi ṭhānesu, jayova sakavādino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammena hi jayo nāma, adhammena kuto jayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Saccikaṭṭhe yathā cettha, pañcakadvayamaṇḍite;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammādhammavaseneva, vutto jayaparājayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ito paresu sabbesu, saccikaṭṭhesu paṇḍito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evameva vibhāveyya, ubho jayaparājaye’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Okāsasaccikaṭṭho"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Anulomapaccanīkavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". Evaṃ ",
      " suddhikasaccikaṭṭhaṃ vitthāretvā idāni tameva aparehi okāsādīhi nayehi vitthāretuṃ puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalo upalabbhatī"
      },
      "tiādi āraddhaṃ. Tattha pucchā sakavādissa, paṭiññā paravādissa. Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbatthā"
      },
      "ti sarīraṃ sandhāya anuyogo sakavādissa, rūpasmiṃ attānaṃ samanupassanādosañca ‘aññaṃ jīvaṃ aññaṃ sarīra’nti āpajjanadosañca disvā paṭikkhepo paravādissa. Sesamettha anulomapaccanīkapañcake heṭṭhā vuttanayeneva veditabbaṃ. Pāṭho pana saṅkhitto ",
      ". Tattha yasmā sarīraṃ sandhāya ‘‘sabbattha na upalabbhatī’’ti vutte sarīrato bahi upalabbhatīti āpajjati. Tasmā paccanīke paṭikkhepo sakavādissa, paṭhamaṃ anujānitvā pacchā avajānātīti chalavādassa vasena paṭikammaṃ paravādissa. Sesaṃ pākaṭameva."
    ],
    "innerText": "11. Evaṃ suddhikasaccikaṭṭhaṃ vitthāretvā idāni tameva aparehi okāsādīhi nayehi vitthāretuṃ puna puggalo upalabbhatītiādi āraddhaṃ. Tattha pucchā sakavādissa, paṭiññā paravādissa. Puna sabbatthāti sarīraṃ sandhāya anuyogo sakavādissa, rūpasmiṃ attānaṃ samanupassanādosañca ‘aññaṃ jīvaṃ aññaṃ sarīra’nti āpajjanadosañca disvā paṭikkhepo paravādissa. Sesamettha anulomapaccanīkapañcake heṭṭhā vuttanayeneva veditabbaṃ. Pāṭho pana saṅkhitto . Tattha yasmā sarīraṃ sandhāya ‘‘sabbattha na upalabbhatī’’ti vutte sarīrato bahi upalabbhatīti āpajjati. Tasmā paccanīke paṭikkhepo sakavādissa, paṭhamaṃ anujānitvā pacchā avajānātīti chalavādassa vasena paṭikammaṃ paravādissa. Sesaṃ pākaṭameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Kālasaccikaṭṭho"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Anulomapaccanīkavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ". Dutiyanaye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbadā"
      },
      "ti purimapacchimajātikālañca dharamānaparinibbutakālañca sandhāya anuyogo sakavādissa, sveva khattiyo so brāhmaṇotiādīnaṃ āpattidosañca dharamānaparinibbutānaṃ visesābhāvadosañca disvā paṭikkhepo paravādissa. Sesaṃ paṭhamanaye vuttasadisameva."
    ],
    "innerText": "12. Dutiyanaye sabbadāti purimapacchimajātikālañca dharamānaparinibbutakālañca sandhāya anuyogo sakavādissa, sveva khattiyo so brāhmaṇotiādīnaṃ āpattidosañca dharamānaparinibbutānaṃ visesābhāvadosañca disvā paṭikkhepo paravādissa. Sesaṃ paṭhamanaye vuttasadisameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Avayavasaccikaṭṭho"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Anulomapaccanīkavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". Tatiyanaye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbesū"
      },
      "ti khandhāyatanādīni sandhāya anuyogo sakavādissa, rūpasmiṃ attā, cakkhusmiṃ attātiādidosabhayena paṭikkhepo paravādissa. Sesaṃ tādisamevāti."
    ],
    "innerText": "13. Tatiyanaye sabbesūti khandhāyatanādīni sandhāya anuyogo sakavādissa, rūpasmiṃ attā, cakkhusmiṃ attātiādidosabhayena paṭikkhepo paravādissa. Sesaṃ tādisamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Okāsadisaccikaṭṭhādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Paccanīkānulomavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Evametāni ",
      " tīṇi anulomapaccanīkapañcake anulomamattavaseneva tāva paṭipāṭiyā bhājetvā puna paccanīkānulomapañcake paccanīkamattavaseneva bhājetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalo nupalabbhatī"
      },
      "tiādi āraddhaṃ. Tattha anulomapañcakassa pāḷiyaṃ saṅkhipitvā āgate paccanīke vuttanayeneva paccanīkassa ca pāḷiyaṃ saṅkhipitvā āgate anulome vuttanayeneva attho veditabbo. Ettāvatā suddhikassa ceva imesañca tiṇṇanti catunnaṃ saccikaṭṭhānaṃ ekekasmiṃ saccikaṭṭhe ",
      " anulomapaccanīkassa paccanīkānulomassa cāti dvinnaṃ dvinnaṃ paccanīkānaṃ vasena ayaṃ aṭṭhamukhā nāma vādayutti niddiṭṭhā hotīti veditabbā. Yā ekekasmiṃ mukhe ekekassa niggahassa vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakaniggaho"
      },
      "ti pāḷiyaṃ likhiyati. Tatthetaṃ vuccati –"
    ],
    "innerText": "14. Evametāni tīṇi anulomapaccanīkapañcake anulomamattavaseneva tāva paṭipāṭiyā bhājetvā puna paccanīkānulomapañcake paccanīkamattavaseneva bhājetuṃ puggalo nupalabbhatītiādi āraddhaṃ. Tattha anulomapañcakassa pāḷiyaṃ saṅkhipitvā āgate paccanīke vuttanayeneva paccanīkassa ca pāḷiyaṃ saṅkhipitvā āgate anulome vuttanayeneva attho veditabbo. Ettāvatā suddhikassa ceva imesañca tiṇṇanti catunnaṃ saccikaṭṭhānaṃ ekekasmiṃ saccikaṭṭhe anulomapaccanīkassa paccanīkānulomassa cāti dvinnaṃ dvinnaṃ paccanīkānaṃ vasena ayaṃ aṭṭhamukhā nāma vādayutti niddiṭṭhā hotīti veditabbā. Yā ekekasmiṃ mukhe ekekassa niggahassa vasena aṭṭhakaniggahoti pāḷiyaṃ likhiyati. Tatthetaṃ vuccati –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Evaṃ catubbidhe pañhe, pañcakadvayabhedato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Esā aṭṭhamukhā nāma, vādayutti pakāsitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Aṭṭheva niggahā tattha, cattāro tesu dhammikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Adhammikā ca cattāro, sabbattha sakavādino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Jayo parājayo ceva, sabbattha paravādino’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saccikaṭṭhavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Suddhikasaṃsandanavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17-27"
      },
      ". Idāni rūpādīhi saddhiṃ saccikaṭṭhasaṃsandanaṃ hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpañcā"
      },
      "ti yathā rūpaṃ paramatthato upalabbhati, kiṃ te puggalopi tatheva upalabbhatīti sandhāya pucchā sakavādissa, atthi puggaloti vacanamattaṃ gahetvā paṭiññā paravādissa. Yadi te rūpaṃ viya paramatthato puggalo atthi, rūpato vedanādīnaṃ viya ",
      " puggalassāpi aññattaṃ āpajjatīti anuyogo sakavādissa, samayasuttavirodhaṃ disvā paṭikkhepo paravādissa. Sesaṃ atthato ",
      " pākaṭameva. Dhammato panettha sattapaññāsabhedassa saccikaṭṭhaparamatthassa vasena sakavādīpakkhamūlake anulomapaccanīke sattapaññāsa anulomapañcakāni dassitāni. Paṭikammacatukkādīni saṅkhittāni. Paravādīpakkhamūlakepi paccanīkānulome sattapaññāsa paṭilomapañcakāni dassitāni. Paṭikammacatukkādīni saṅkhittāni. Tattha ‘‘vuttaṃ bhagavatā’’ti vacanamattena puggalassa atthitaṃ rūpassa ca saccikaṭṭhaparamatthavasena upalabbhanīyataṃ dassetvā ubhinnaṃ aññattaṃ paṭijānāpanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuttaṃ bhagavatā"
      },
      "ti anuyogo paravādissa, sammutiparamatthānaṃ ekattanānattapañhassa ṭhapanīyattā paṭikkhepo sakavādissa. Sesamidhāpi atthato pākaṭamevāti."
    ],
    "innerText": "17-27. Idāni rūpādīhi saddhiṃ saccikaṭṭhasaṃsandanaṃ hoti. Tattha rūpañcāti yathā rūpaṃ paramatthato upalabbhati, kiṃ te puggalopi tatheva upalabbhatīti sandhāya pucchā sakavādissa, atthi puggaloti vacanamattaṃ gahetvā paṭiññā paravādissa. Yadi te rūpaṃ viya paramatthato puggalo atthi, rūpato vedanādīnaṃ viya puggalassāpi aññattaṃ āpajjatīti anuyogo sakavādissa, samayasuttavirodhaṃ disvā paṭikkhepo paravādissa. Sesaṃ atthato pākaṭameva. Dhammato panettha sattapaññāsabhedassa saccikaṭṭhaparamatthassa vasena sakavādīpakkhamūlake anulomapaccanīke sattapaññāsa anulomapañcakāni dassitāni. Paṭikammacatukkādīni saṅkhittāni. Paravādīpakkhamūlakepi paccanīkānulome sattapaññāsa paṭilomapañcakāni dassitāni. Paṭikammacatukkādīni saṅkhittāni. Tattha ‘‘vuttaṃ bhagavatā’’ti vacanamattena puggalassa atthitaṃ rūpassa ca saccikaṭṭhaparamatthavasena upalabbhanīyataṃ dassetvā ubhinnaṃ aññattaṃ paṭijānāpanatthaṃ vuttaṃ bhagavatāti anuyogo paravādissa, sammutiparamatthānaṃ ekattanānattapañhassa ṭhapanīyattā paṭikkhepo sakavādissa. Sesamidhāpi atthato pākaṭamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Suddhikasaṃsandanavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Opammasaṃsandanavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28-36"
      },
      ". Idāni rūpādīheva saddhiṃ opammavasena saccikaṭṭhasaṃsandanaṃ hoti. Tattha rūpavedanānaṃ upaladdhisāmaññena aññattapucchā ca puggalarūpānaṃ upaladdhisāmaññapucchā cāti pucchādvayampi sakavādissa, ubhopi paṭiññā paravādissa. Paravādinā anuññātena upaladdhisāmaññena rūpavedanānaṃ viya rūpapuggalānaṃ aññattānuyogo sakavādissa, paṭikkhepo itarassa. Sesamidhāpi atthato pākaṭameva. Dhammato panettha rūpamūlakādīnaṃ cakkānañca vasena sakavādīpakkhe vīsādhikāni nava niggahapañcakasatāni dassitāni. Kathaṃ? Khandhesu tāva rūpamūlake cakke cattāri, tathā vedanādimūlakesūti vīsati. Āyatanesu cakkhāyatanamūlake cakke ekādasa, tathā sesesūti dvattiṃsasataṃ. Dhātūsu cakkhudhātumūlake cakke sattarasa, tathā sesesūti chādhikāni tīṇi satāni. Indriyesu cakkhundriyamūlake ",
      " cakke ekavīsati, tathā sesesūti dvāsaṭṭhādhikāni cattāri satāni. Evaṃ sabbānipi vīsādhikāni nava niggahapañcakasatāni honti."
    ],
    "innerText": "28-36. Idāni rūpādīheva saddhiṃ opammavasena saccikaṭṭhasaṃsandanaṃ hoti. Tattha rūpavedanānaṃ upaladdhisāmaññena aññattapucchā ca puggalarūpānaṃ upaladdhisāmaññapucchā cāti pucchādvayampi sakavādissa, ubhopi paṭiññā paravādissa. Paravādinā anuññātena upaladdhisāmaññena rūpavedanānaṃ viya rūpapuggalānaṃ aññattānuyogo sakavādissa, paṭikkhepo itarassa. Sesamidhāpi atthato pākaṭameva. Dhammato panettha rūpamūlakādīnaṃ cakkānañca vasena sakavādīpakkhe vīsādhikāni nava niggahapañcakasatāni dassitāni. Kathaṃ? Khandhesu tāva rūpamūlake cakke cattāri, tathā vedanādimūlakesūti vīsati. Āyatanesu cakkhāyatanamūlake cakke ekādasa, tathā sesesūti dvattiṃsasataṃ. Dhātūsu cakkhudhātumūlake cakke sattarasa, tathā sesesūti chādhikāni tīṇi satāni. Indriyesu cakkhundriyamūlake cakke ekavīsati, tathā sesesūti dvāsaṭṭhādhikāni cattāri satāni. Evaṃ sabbānipi vīsādhikāni nava niggahapañcakasatāni honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37-45"
      },
      ". Paravādīpakkhepi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpaṃ upalabbhatī"
      },
      "ti anulomavaseneva rūpavedanādīnaṃ aññattapaṭiññaṃ kāretvā puna atthi puggaloti suttaṃ nissāya chalavasena ",
      " puggalassa rūpādīhi upaladdhisāmaññaṃ āropetvā aññattānuyogo kato. Sesamidhāpi atthato uttānameva. Dhammatopi sakavādīpakkhe vuttanayena vīsādhikāni nava paṭikammapañcakasatāni dassitāni."
    ],
    "innerText": "37-45. Paravādīpakkhepi rūpaṃ upalabbhatīti anulomavaseneva rūpavedanādīnaṃ aññattapaṭiññaṃ kāretvā puna atthi puggaloti suttaṃ nissāya chalavasena puggalassa rūpādīhi upaladdhisāmaññaṃ āropetvā aññattānuyogo kato. Sesamidhāpi atthato uttānameva. Dhammatopi sakavādīpakkhe vuttanayena vīsādhikāni nava paṭikammapañcakasatāni dassitāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Rūpādīhi saddhiṃ opammavasena saccikaṭṭhasaṃsandanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Catukkanayasaṃsandanavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "46-52"
      },
      ". Idāni ",
      " yaṃ saccikaṭṭhaparamatthena upalabbhati, tena yasmā rūpādīsu sattapaññāsāya saccikaṭṭhaparamatthesu aññatarena bhavitabbaṃ; rūpādinissitena vā, aññatra vā rūpādīhi, rūpādīnaṃ vā nissayena, tasmā iminā catukkanayena saccikaṭṭhasaṃsandanaṃ āraddhaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpaṃ puggalo"
      },
      "ti anuyogo sakavādissa, ucchedadiṭṭhibhayena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na hevā"
      },
      "ti paṭikkhepo paravādissa, niggahāropanaṃ sakavādissa. Kiṃ panetaṃ yuttaṃ, nanu rūpaṃ vedanāti vuttampi paṭikkhipitabbamevāti? Āma paṭikkhipitabbaṃ. Taṃ pana rūpato vedanāya aññasabhāvasabbhāvato, na aññattābhāvato. Ayañca rūpādīsu ekadhammatopi puggalassa aññattaṃ na icchati, tasmā yuttaṃ. Ayañca anuyogo rūpaṃ puggalo…pe… aññātāvindriyaṃ puggaloti sakalaṃ paramatthasaccaṃ sandhāya āraddho. Sakalaṃ pana paccattalakkhaṇavasena ekato vattuṃ na sakkāti tantivasena anuyogalakkhaṇamattametaṃ ṭhapitaṃ. Tena viññū atthaṃ vibhāventi. Vādakāmena pana imaṃ lakkhaṇaṃ gahetvā yathā yathā paravādissa okāso na hoti, tathā tathā ",
      " vattabbaṃ. Iti tantivasena anuyogalakkhaṇassa ṭhapitattāpi yuttameva. Iminā nayena sabbānuyogesu attho veditabbo."
    ],
    "innerText": "46-52. Idāni yaṃ saccikaṭṭhaparamatthena upalabbhati, tena yasmā rūpādīsu sattapaññāsāya saccikaṭṭhaparamatthesu aññatarena bhavitabbaṃ; rūpādinissitena vā, aññatra vā rūpādīhi, rūpādīnaṃ vā nissayena, tasmā iminā catukkanayena saccikaṭṭhasaṃsandanaṃ āraddhaṃ. Tattha rūpaṃ puggaloti anuyogo sakavādissa, ucchedadiṭṭhibhayena na hevāti paṭikkhepo paravādissa, niggahāropanaṃ sakavādissa. Kiṃ panetaṃ yuttaṃ, nanu rūpaṃ vedanāti vuttampi paṭikkhipitabbamevāti? Āma paṭikkhipitabbaṃ. Taṃ pana rūpato vedanāya aññasabhāvasabbhāvato, na aññattābhāvato. Ayañca rūpādīsu ekadhammatopi puggalassa aññattaṃ na icchati, tasmā yuttaṃ. Ayañca anuyogo rūpaṃ puggalo…pe… aññātāvindriyaṃ puggaloti sakalaṃ paramatthasaccaṃ sandhāya āraddho. Sakalaṃ pana paccattalakkhaṇavasena ekato vattuṃ na sakkāti tantivasena anuyogalakkhaṇamattametaṃ ṭhapitaṃ. Tena viññū atthaṃ vibhāventi. Vādakāmena pana imaṃ lakkhaṇaṃ gahetvā yathā yathā paravādissa okāso na hoti, tathā tathā vattabbaṃ. Iti tantivasena anuyogalakkhaṇassa ṭhapitattāpi yuttameva. Iminā nayena sabbānuyogesu attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayaṃ pana viseso – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpasmiṃ puggalo"
      },
      "tiādīsu yathā ekaṃ mahābhūtaṃ nissāya tayo mahābhūtā, vatthurūpaṃ nissāya viññāṇaṃ rūpasminti vattuṃ vaṭṭati, kiṃ te evaṃ rūpasmiṃ puggalo? Yathā ca sabhāgavinibbhogato vedanādayo sabbadhammā, arūpā vā pana cattāro khandhā, nibbānameva vā ‘‘aññatra rūpā’’ti vattuṃ vaṭṭati, kiṃ te evaṃ puggalo? Yathā ",
      " ca cittasamuṭṭhānānaṃ rūpānaṃ nissayavasena ‘‘vedanāya rūpaṃ…pe… viññāṇasmiṃ rūpa’’nti vattuṃ vaṭṭati, kiṃ te evaṃ puggaloti? Sabbānuyogesu pana ucchedadiṭṭhibhayena ceva samayavirodhena ca paṭikkhepo paravādissa. Sesamettha atthato pākaṭameva. Dhammato panettha sattapaññāsāya saccikaṭṭhesu ekekasmiṃ cattāri cattāri katvā niggahavasena aṭṭhavīsādhikāni dve pañcakasatāni dassitāni. Paravādīpakkhepi paṭikammavasena tattakāneva. Yā panettha atthi puggaloti vutte sakavādissa paṭiññā, sā sutte āgatena sammutivasena. Yo rūpaṃ puggalotiādīsu paṭikkhepo, so sakkāyadiṭṭhipañhassa ṭhapanīyattā. Paravādissa paṭikammaṃ chalavasenevāti."
    ],
    "innerText": "Ayaṃ pana viseso – rūpasmiṃ puggalotiādīsu yathā ekaṃ mahābhūtaṃ nissāya tayo mahābhūtā, vatthurūpaṃ nissāya viññāṇaṃ rūpasminti vattuṃ vaṭṭati, kiṃ te evaṃ rūpasmiṃ puggalo? Yathā ca sabhāgavinibbhogato vedanādayo sabbadhammā, arūpā vā pana cattāro khandhā, nibbānameva vā ‘‘aññatra rūpā’’ti vattuṃ vaṭṭati, kiṃ te evaṃ puggalo? Yathā ca cittasamuṭṭhānānaṃ rūpānaṃ nissayavasena ‘‘vedanāya rūpaṃ…pe… viññāṇasmiṃ rūpa’’nti vattuṃ vaṭṭati, kiṃ te evaṃ puggaloti? Sabbānuyogesu pana ucchedadiṭṭhibhayena ceva samayavirodhena ca paṭikkhepo paravādissa. Sesamettha atthato pākaṭameva. Dhammato panettha sattapaññāsāya saccikaṭṭhesu ekekasmiṃ cattāri cattāri katvā niggahavasena aṭṭhavīsādhikāni dve pañcakasatāni dassitāni. Paravādīpakkhepi paṭikammavasena tattakāneva. Yā panettha atthi puggaloti vutte sakavādissa paṭiññā, sā sutte āgatena sammutivasena. Yo rūpaṃ puggalotiādīsu paṭikkhepo, so sakkāyadiṭṭhipañhassa ṭhapanīyattā. Paravādissa paṭikammaṃ chalavasenevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catukkanayasaṃsandanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niṭṭhitā ca saṃsandanakathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Lakkhaṇayuttivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "53"
      },
      ". Idāni ",
      " lakkhaṇayutti nāma hoti. Tattha yasmā ṭhapetvā nibbānaṃ seso saccikaṭṭhaparamattho paccayapaṭibaddhatāya sappaccayo, paccayehi samāgamma katattā saṅkhato, uppajjitvā nirujjhanato sadā abhāvato asassato, uppattikāraṇasaṅkhātassa nimittassa atthitāya sanimitto, nibbānaṃ vuttappakārābhāvato appaccayaṃ asaṅkhataṃ sassataṃ animittanti idaṃ saccikaṭṭhassa lakkhaṇaṃ. Tasmā yadi puggalopi saccikaṭṭhaparamatthova tassāpi iminā lakkhaṇena bhavitabbanti sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalo sappaccayo"
      },
      "tiādayo aṭṭhapi anuyogā sakavādissa ",
      ", paṭikkhepo paravādissa. Ājānāhi niggahantiādi panettha saṅkhittaṃ. Evametāni sakavādīpakkhe anulomapaccanīke anulomamattavasena aṭṭha pañcakāni veditabbāni."
    ],
    "innerText": "53. Idāni lakkhaṇayutti nāma hoti. Tattha yasmā ṭhapetvā nibbānaṃ seso saccikaṭṭhaparamattho paccayapaṭibaddhatāya sappaccayo, paccayehi samāgamma katattā saṅkhato, uppajjitvā nirujjhanato sadā abhāvato asassato, uppattikāraṇasaṅkhātassa nimittassa atthitāya sanimitto, nibbānaṃ vuttappakārābhāvato appaccayaṃ asaṅkhataṃ sassataṃ animittanti idaṃ saccikaṭṭhassa lakkhaṇaṃ. Tasmā yadi puggalopi saccikaṭṭhaparamatthova tassāpi iminā lakkhaṇena bhavitabbanti sandhāya puggalo sappaccayotiādayo aṭṭhapi anuyogā sakavādissa , paṭikkhepo paravādissa. Ājānāhi niggahantiādi panettha saṅkhittaṃ. Evametāni sakavādīpakkhe anulomapaccanīke anulomamattavasena aṭṭha pañcakāni veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "54"
      },
      ". Paravādīpakkhepi paccanīkānulome paccanīkamattavasena aṭṭheva. Tattha yasmā paravādinā suttavasena sammutisaccaṃ sādhitaṃ, sammutiyā ca sappaccayādibhāvo ",
      " natthi, tasmā yāthāvato ca paṭikkhepo sakavādissa. Chalavasena pana vattabbaṃ ‘‘ājānāhi paṭikamma’’ntiādi sabbaṃ idhāpi saṅkhittameva."
    ],
    "innerText": "54. Paravādīpakkhepi paccanīkānulome paccanīkamattavasena aṭṭheva. Tattha yasmā paravādinā suttavasena sammutisaccaṃ sādhitaṃ, sammutiyā ca sappaccayādibhāvo natthi, tasmā yāthāvato ca paṭikkhepo sakavādissa. Chalavasena pana vattabbaṃ ‘‘ājānāhi paṭikamma’’ntiādi sabbaṃ idhāpi saṅkhittameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Lakkhaṇayuttikathāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Vacanasodhanavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "55-59"
      },
      ". Idāni vacanasodhanaṃ hoti. Tattha yadetaṃ puggalo upalabbhatīti vacanaṃ, taṃ sodhetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalo upalabbhati, upalabbhati puggalo"
      },
      "ti. Pucchā sakavādissa. Tassattho – yadetaṃ puggalo upalabbhatīti padadvayaṃ, taṃ ekatthaṃ vā bhaveyya nānatthaṃ vā. Yadi tāva nānatthaṃ, yathā aññaṃ rūpaṃ, aññā vedanā, evaṃ añño puggalo, añño upalabbhatīti āpajjati. Athekatthaṃ, yathā yaṃ cittaṃ taṃ mano, evaṃ sveva puggalo, so upalabbhatīti āpajjati. Tena taṃ vadāmi ‘‘yadi te yo puggalo, so upalabbhati, evaṃ sante yo yo upalabbhati, so so puggaloti āpajjati, kiṃ sampaṭicchasi eta’’nti? Tato puggalavādī yasmā puggalassa upalabbhataṃ ",
      " icchati, na upalabbhamānānampi rūpādīnaṃ puggalabhāvaṃ, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalo upalabbhati, upalabbhati ke hi ci puggalo ke hi ci na puggalo"
      },
      "tiādimāha. Tassattho – mama puggalo atthi puggaloti satthu vacanato upalabbhati. Yo pana upalabbhati, na so sabbo puggalo, atha kho ke hi ci puggalo ke hi ci na puggaloti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ko"
      },
      "-kāratthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ke-"
      },
      "kāro, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hi-"
      },
      "kāro ca nipātamatto. Koci puggalo, koci na puggaloti ayaṃ panettha attho. Idaṃ vuttaṃ hoti – puggalopi hi rūpādīsupi yo koci dhammo upalabbhatiyeva, tattha puggalova puggalo. Rūpādīsu ",
      " pana kocipi na puggaloti. Tato taṃ sakavādī āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalo ke hi ci upalabbhati ke hi ci na upalabbhatī"
      },
      "ti. Tassattho – puggalo upalabbhatīti padadvayassa atthato ekatte yadi upalabbhatīti anuññāto dhammo puggalato anaññopi koci puggalo koci na puggalo, puggalopi ",
      " te koci upalabbhati, koci na upalabbhatīti āpajjati, kiṃ sampaṭicchasi etanti? So puggalassa anupaladdhiṃ anicchanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na heva"
      },
      "nti paṭikkhipati. Ito paraṃ ‘‘ājānāhi niggaha’’ntiādi sabbaṃ saṅkhittaṃ. Vitthārato pana veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puggalo saccikaṭṭho"
      },
      "tiādīsupi eseva nayo. Sabbāni hetāni upalabbhativevacanāneva, apica yasmā ‘‘puggalo upalabbhatisaccikaṭṭhaparamatthenā’’ti ayaṃ puggalavādino paṭiññā, tasmāssa yatheva puggalo upalabbhatīti laddhi, evamevaṃ puggalo saccikaṭṭhotipi āpajjati. Yā panassa puggalo atthīti laddhi, tassā vijjamānotivevacanameva, tasmā sabbānipetāni vacanāni sodhitāni."
    ],
    "innerText": "55-59. Idāni vacanasodhanaṃ hoti. Tattha yadetaṃ puggalo upalabbhatīti vacanaṃ, taṃ sodhetuṃ puggalo upalabbhati, upalabbhati puggaloti. Pucchā sakavādissa. Tassattho – yadetaṃ puggalo upalabbhatīti padadvayaṃ, taṃ ekatthaṃ vā bhaveyya nānatthaṃ vā. Yadi tāva nānatthaṃ, yathā aññaṃ rūpaṃ, aññā vedanā, evaṃ añño puggalo, añño upalabbhatīti āpajjati. Athekatthaṃ, yathā yaṃ cittaṃ taṃ mano, evaṃ sveva puggalo, so upalabbhatīti āpajjati. Tena taṃ vadāmi ‘‘yadi te yo puggalo, so upalabbhati, evaṃ sante yo yo upalabbhati, so so puggaloti āpajjati, kiṃ sampaṭicchasi eta’’nti? Tato puggalavādī yasmā puggalassa upalabbhataṃ icchati, na upalabbhamānānampi rūpādīnaṃ puggalabhāvaṃ, tasmā puggalo upalabbhati, upalabbhati ke hi ci puggalo ke hi ci na puggalotiādimāha. Tassattho – mama puggalo atthi puggaloti satthu vacanato upalabbhati. Yo pana upalabbhati, na so sabbo puggalo, atha kho ke hi ci puggalo ke hi ci na puggaloti. Tattha ko-kāratthe ke-kāro, hi-kāro ca nipātamatto. Koci puggalo, koci na puggaloti ayaṃ panettha attho. Idaṃ vuttaṃ hoti – puggalopi hi rūpādīsupi yo koci dhammo upalabbhatiyeva, tattha puggalova puggalo. Rūpādīsu pana kocipi na puggaloti. Tato taṃ sakavādī āha – puggalo ke hi ci upalabbhati ke hi ci na upalabbhatīti. Tassattho – puggalo upalabbhatīti padadvayassa atthato ekatte yadi upalabbhatīti anuññāto dhammo puggalato anaññopi koci puggalo koci na puggalo, puggalopi te koci upalabbhati, koci na upalabbhatīti āpajjati, kiṃ sampaṭicchasi etanti? So puggalassa anupaladdhiṃ anicchanto na hevanti paṭikkhipati. Ito paraṃ ‘‘ājānāhi niggaha’’ntiādi sabbaṃ saṅkhittaṃ. Vitthārato pana veditabbaṃ. Puggalo saccikaṭṭhotiādīsupi eseva nayo. Sabbāni hetāni upalabbhativevacanāneva, apica yasmā ‘‘puggalo upalabbhatisaccikaṭṭhaparamatthenā’’ti ayaṃ puggalavādino paṭiññā, tasmāssa yatheva puggalo upalabbhatīti laddhi, evamevaṃ puggalo saccikaṭṭhotipi āpajjati. Yā panassa puggalo atthīti laddhi, tassā vijjamānotivevacanameva, tasmā sabbānipetāni vacanāni sodhitāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "60"
      },
      ". Tattha yaṃ avasāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘puggalo atthi, atthi na sabbo puggalo’’"
      },
      "tiādi vuttaṃ, tatrāyamadhippāyo – yañhetaṃ paravādinā ‘‘puggalo atthi, atthi kehici puggalo, kehici na puggalo’’ti vuttaṃ, taṃ yasmā atthato puggalo atthi, atthi na sabbo puggaloti ettakaṃ hoti, tasmā naṃ sakavādī sampaṭicchāpetvā idāni naṃ evaṃ anuyuñjati. Tayā hi ‘‘atthi puggalo attahitāya paṭipanno’’ti vacanamattaṃ nissāya ‘‘puggalo atthī’’ti laddhi gahitā, yathā ca bhagavatā etaṃ vuttaṃ, tathā ‘‘suññato lokaṃ avekkhassu, mogharājā, sadā sato’’tiādinā (su. ni. 1125) nayena ‘‘natthī’’tipi vuttaṃ, tasmā yatheva te ‘‘puggalo atthi, atthi na sabbo puggalo’’ti laddhi, tathā puggalo natthi, natthi na sabbo puggalotipi āpajjati, kiṃ etaṃ sampaṭicchasīti? Atha naṃ asampaṭicchanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na hevā"
      },
      "ti paṭikkhipati. Sesamettha niggahādividhānaṃ vuttanayeneva veditabbanti."
    ],
    "innerText": "60. Tattha yaṃ avasāne ‘‘puggalo atthi, atthi na sabbo puggalo’’tiādi vuttaṃ, tatrāyamadhippāyo – yañhetaṃ paravādinā ‘‘puggalo atthi, atthi kehici puggalo, kehici na puggalo’’ti vuttaṃ, taṃ yasmā atthato puggalo atthi, atthi na sabbo puggaloti ettakaṃ hoti, tasmā naṃ sakavādī sampaṭicchāpetvā idāni naṃ evaṃ anuyuñjati. Tayā hi ‘‘atthi puggalo attahitāya paṭipanno’’ti vacanamattaṃ nissāya ‘‘puggalo atthī’’ti laddhi gahitā, yathā ca bhagavatā etaṃ vuttaṃ, tathā ‘‘suññato lokaṃ avekkhassu, mogharājā, sadā sato’’tiādinā (su. ni. 1125) nayena ‘‘natthī’’tipi vuttaṃ, tasmā yatheva te ‘‘puggalo atthi, atthi na sabbo puggalo’’ti laddhi, tathā puggalo natthi, natthi na sabbo puggalotipi āpajjati, kiṃ etaṃ sampaṭicchasīti? Atha naṃ asampaṭicchanto na hevāti paṭikkhipati. Sesamettha niggahādividhānaṃ vuttanayeneva veditabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vacanasodhanavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Paññattānuyogavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "61-66"
      },
      ". Idāni ",
      " paññattānuyogo nāma hoti. Rūpadhātuyā hi puggalavādī ",
      " rūpiṃ puggalaṃ paññapeti, tathā arūpadhātuyā arūpiṃ. Tassa taṃ laddhiṃ bhindituṃ sabbāpi pucchā sakavādissa, paṭiññā ca paṭikkhepo ca itarassa ",
      ". So hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpī"
      },
      "ti vutte rūpakāyasabbhāvato ceva tathārūpāya ca paññattiyā atthitāya paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmī"
      },
      "ti vutte vītarāgasabbhāvato ceva tathārūpāya ca paññattiyā natthitāya paṭikkhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arūpī"
      },
      "ti vuttepi arūpakkhandhasabbhāvato ceva tathārūpāya ca paññattiyā atthitāya paṭijānāti. Dvīsupi nayesu sattoti puggalassa vevacanavasena vuttaṃ."
    ],
    "innerText": "61-66. Idāni paññattānuyogo nāma hoti. Rūpadhātuyā hi puggalavādī rūpiṃ puggalaṃ paññapeti, tathā arūpadhātuyā arūpiṃ. Tassa taṃ laddhiṃ bhindituṃ sabbāpi pucchā sakavādissa, paṭiññā ca paṭikkhepo ca itarassa . So hi rūpīti vutte rūpakāyasabbhāvato ceva tathārūpāya ca paññattiyā atthitāya paṭijānāti. Kāmīti vutte vītarāgasabbhāvato ceva tathārūpāya ca paññattiyā natthitāya paṭikkhipati. Arūpīti vuttepi arūpakkhandhasabbhāvato ceva tathārūpāya ca paññattiyā atthitāya paṭijānāti. Dvīsupi nayesu sattoti puggalassa vevacanavasena vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "67"
      },
      ". Idāni yasmā so ‘‘kāye kāyānupassī’’ti āgataṭṭhāne añño kāyo añño puggaloti icchati, tasmā taṃ laddhiṃ bhindituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyoti vā sarīranti vā"
      },
      "tiādi sakavādīpucchā hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyaṃ appiyaṃ karitvā"
      },
      "ti kāyaṃ appetabbaṃ allīyāpetabbaṃ ekībhāvaṃ upanetabbaṃ avibhajitabbaṃ katvā pucchāmīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Esese"
      },
      "ti eso soyeva. Ese esetipi pāṭho. Eso esoyevāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekaṭṭhe"
      },
      "ti ekaṭṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Same samabhāge tajjāte"
      },
      "ti samo samabhāgo tajjātiko. Vacanamatteyevettha bhedo. Atthato pana kāyova esoti pucchati. Paravādī nānattaṃ apassanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āmantā"
      },
      "ti paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puggaloti vā jīvoti vā"
      },
      "ti pucchāyapi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Añño kāyo"
      },
      "ti puṭṭho pana kāyānupassanāya evaṃladdhikattā paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññaṃ jīva"
      },
      "nti puṭṭho pana āhacca bhāsitaṃ suttaṃ paṭikkhipituṃ asakkonto avajānāti. Tato paraṃ ‘‘ājānāhi niggaha’’ntiādi uttānatthameva."
    ],
    "innerText": "67. Idāni yasmā so ‘‘kāye kāyānupassī’’ti āgataṭṭhāne añño kāyo añño puggaloti icchati, tasmā taṃ laddhiṃ bhindituṃ kāyoti vā sarīranti vātiādi sakavādīpucchā hoti. Tattha kāyaṃ appiyaṃ karitvāti kāyaṃ appetabbaṃ allīyāpetabbaṃ ekībhāvaṃ upanetabbaṃ avibhajitabbaṃ katvā pucchāmīti attho. Eseseti eso soyeva. Ese esetipi pāṭho. Eso esoyevāti attho. Ekaṭṭheti ekaṭṭho. Same samabhāge tajjāteti samo samabhāgo tajjātiko. Vacanamatteyevettha bhedo. Atthato pana kāyova esoti pucchati. Paravādī nānattaṃ apassanto āmantāti paṭijānāti. Puggaloti vā jīvoti vāti pucchāyapi eseva nayo. Añño kāyoti puṭṭho pana kāyānupassanāya evaṃladdhikattā paṭijānāti. Aññaṃ jīvanti puṭṭho pana āhacca bhāsitaṃ suttaṃ paṭikkhipituṃ asakkonto avajānāti. Tato paraṃ ‘‘ājānāhi niggaha’’ntiādi uttānatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "68"
      },
      ". Paravādīpakkhe pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "añño kāyo añño puggalo"
      },
      "ti puṭṭho sakavādī ṭhapanīyapañhattā paṭikkhipati, paravādī chalavasena paṭikammaṃ karoti. Tampi uttānatthamevāti."
    ],
    "innerText": "68. Paravādīpakkhe pana añño kāyo añño puggaloti puṭṭho sakavādī ṭhapanīyapañhattā paṭikkhipati, paravādī chalavasena paṭikammaṃ karoti. Tampi uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paññattānuyogavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Gatianuyogavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "69-72"
      },
      ". Idāni ",
      " gatiparivattanamukhena cutipaṭisandhianuyogo hoti. Tattha yasmā puggalavādī ‘‘sa sattakkhattuparamaṃ sandhāvitvāna ",
      " puggalo’’tiādīni (saṃ. ni. 2.133; itivu. 24) suttāni nissāya puggalo sandhāvatīti laddhiṃ gahetvā voharati ",
      ", tasmāssa taṃ laddhiṃ bhindituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sandhāvatī"
      },
      "ti pucchā sakavādissa. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sandhāvatī"
      },
      "ti saṃsarati gamanāgamanaṃ karoti. Attano laddhivasena paṭiññā paravādissa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So puggalo"
      },
      "tiādayo anuyogopi sakavādissa, paṭikkhepo itarassa. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "so"
      },
      "ti soyevāti attho. Evaṃ pana anuyutto sassatadiṭṭhibhayena paṭikkhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Añño"
      },
      "ti puṭṭho ucchedadiṭṭhibhayena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So ca añño cā"
      },
      "ti puṭṭho ekaccasassatadiṭṭhibhayena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Neva so na añño"
      },
      "ti puṭṭho amarāvikkhepadiṭṭhibhayena. Puna cattāropi pañhe ekato puṭṭho catunnampi diṭṭhīnaṃ bhayena paṭikkhipitvā puna yānissa suttāni nissāya laddhi uppannā tāni dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tena hi puggalo"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sandhāvatī"
      },
      "tiādimāha."
    ],
    "innerText": "69-72. Idāni gatiparivattanamukhena cutipaṭisandhianuyogo hoti. Tattha yasmā puggalavādī ‘‘sa sattakkhattuparamaṃ sandhāvitvāna puggalo’’tiādīni (saṃ. ni. 2.133; itivu. 24) suttāni nissāya puggalo sandhāvatīti laddhiṃ gahetvā voharati , tasmāssa taṃ laddhiṃ bhindituṃ sandhāvatīti pucchā sakavādissa. Tattha sandhāvatīti saṃsarati gamanāgamanaṃ karoti. Attano laddhivasena paṭiññā paravādissa. So puggalotiādayo anuyogopi sakavādissa, paṭikkhepo itarassa. Tattha soti soyevāti attho. Evaṃ pana anuyutto sassatadiṭṭhibhayena paṭikkhipati. Aññoti puṭṭho ucchedadiṭṭhibhayena. So ca añño cāti puṭṭho ekaccasassatadiṭṭhibhayena. Neva so na aññoti puṭṭho amarāvikkhepadiṭṭhibhayena. Puna cattāropi pañhe ekato puṭṭho catunnampi diṭṭhīnaṃ bhayena paṭikkhipitvā puna yānissa suttāni nissāya laddhi uppannā tāni dassento tena hi puggalosandhāvatītiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "76"
      },
      ". Puna sakavādinā ‘‘yvāyaṃ tava laddhiyā sandhāvati, kiṃ so asmiñca parasmiñca loke ekoyevā’’ti adhippāyena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "svevā"
      },
      "ti niyametvā puṭṭho sassatabhayā paṭikkhipitvā puna daḷhaṃ katvā tatheva puṭṭho yasmā so puggalova na añño bhāvo, ‘‘so tato cuto idhūpapanno’’tiādisuttampi (pārā. 12; dī. ni. 1.245) atthi, tasmā paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sveva manusso"
      },
      "ti puṭṭho manussasseva devattābhāvato paṭikkhipati."
    ],
    "innerText": "76. Puna sakavādinā ‘‘yvāyaṃ tava laddhiyā sandhāvati, kiṃ so asmiñca parasmiñca loke ekoyevā’’ti adhippāyena svevāti niyametvā puṭṭho sassatabhayā paṭikkhipitvā puna daḷhaṃ katvā tatheva puṭṭho yasmā so puggalova na añño bhāvo, ‘‘so tato cuto idhūpapanno’’tiādisuttampi (pārā. 12; dī. ni. 1.245) atthi, tasmā paṭijānāti. Sveva manussoti puṭṭho manussasseva devattābhāvato paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "77"
      },
      ". Puna puṭṭho ‘‘ahaṃ tena samayena sunetto nāma satthā ahosi’’ntiādisuttavasena (a. ni. 7.66 atthato samānaṃ) paṭijānāti. Athassa sakavādī devamanussupapattīnaṃ nānattato vacanaṃ micchāti pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manusso hutvā"
      },
      "tiādimāha."
    ],
    "innerText": "77. Puna puṭṭho ‘‘ahaṃ tena samayena sunetto nāma satthā ahosi’’ntiādisuttavasena (a. ni. 7.66 atthato samānaṃ) paṭijānāti. Athassa sakavādī devamanussupapattīnaṃ nānattato vacanaṃ micchāti pakāsento manusso hutvātiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "78"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hevaṃ maraṇaṃ na hehitī"
      },
      "ti evaṃ sante maraṇaṃ na bhavissatīti attho. Ito paraṃ yakkho petoti attabhāvanānattavasena anuyoganānattaṃ veditabbaṃ."
    ],
    "innerText": "78. Tattha hevaṃ maraṇaṃ na hehitīti evaṃ sante maraṇaṃ na bhavissatīti attho. Ito paraṃ yakkho petoti attabhāvanānattavasena anuyoganānattaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "82"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khattiyo"
      },
      "tiādīni jātivasena ceva aṅgavekallādivasena ca vuttāni."
    ],
    "innerText": "82.Khattiyotiādīni jātivasena ceva aṅgavekallādivasena ca vuttāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "87"
      },
      ". Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na vattabba"
      },
      "nti paravādinā puṭṭho idhaṭṭhakassa upapattivasena paralokassa gamanābhāvato paṭiññā sakavādissa puna sotāpannassa bhavantarepi sotāpannabhāvāvijahanato dutiyapaṭiññāpi tasseva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hañcī"
      },
      "tiādivacanaṃ paravādissa."
    ],
    "innerText": "87. Puna na vattabbanti paravādinā puṭṭho idhaṭṭhakassa upapattivasena paralokassa gamanābhāvato paṭiññā sakavādissa puna sotāpannassa bhavantarepi sotāpannabhāvāvijahanato dutiyapaṭiññāpi tasseva. Hañcītiādivacanaṃ paravādissa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "88"
      },
      ". Puna devaloke upapannassa manussattābhāvadassanena anuyogo sakavādissa."
    ],
    "innerText": "88. Puna devaloke upapannassa manussattābhāvadassanena anuyogo sakavādissa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "89"
      },
      ". Tato paraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anañño avigato"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anañño"
      },
      "ti sabbākārena ekasadiso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avigato"
      },
      "ti ekenāpi ākārena avigatoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na heva"
      },
      "nti devaloke upapannassa manussabhāvābhāvato evamāha."
    ],
    "innerText": "89. Tato paraṃ anañño avigatoti ettha anaññoti sabbākārena ekasadiso. Avigatoti ekenāpi ākārena avigatoti attho. Na hevanti devaloke upapannassa manussabhāvābhāvato evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "90"
      },
      ". Puna ",
      " daḷhaṃ katvā anuyutto ‘‘sveva puggalo sandhāvatī’’ti laddhiyā anujānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hatthacchinno"
      },
      "tiādi ākāravigamanadassanena avigato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sandhāvatī"
      },
      "ti laddhibhindanatthaṃ vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aḷacchinno"
      },
      "ti yassa aṅguṭṭhakā chinnā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṇḍaracchinno"
      },
      "ti yassa mahānhārū chinnā."
    ],
    "innerText": "90. Puna daḷhaṃ katvā anuyutto ‘‘sveva puggalo sandhāvatī’’ti laddhiyā anujānāti. Hatthacchinnotiādi ākāravigamanadassanena avigato sandhāvatīti laddhibhindanatthaṃ vuttaṃ. Tattha aḷacchinnoti yassa aṅguṭṭhakā chinnā. Kaṇḍaracchinnoti yassa mahānhārū chinnā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "91"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sarūpo"
      },
      "tiādīsu paṭhame pañhe iminā rūpakāyena saddhiṃ agamanaṃ sandhāya paṭikkhipati. Dutiye antarābhavapuggalaṃ sandhāya paṭijānāti. So hi tassa laddhiyā sarūpova gantvā mātukucchiṃ pavisati. Athassa taṃ rūpaṃ bhijjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ jīva"
      },
      "nti yena rūpasaṅkhātena sarīrena saddhiṃ gacchati, kimassa tadeva jīvaṃ taṃ sarīranti pucchati. Paravādī idha sarīranikkhepā suttavirodhā ca paṭikkhipati."
    ],
    "innerText": "91.Sarūpotiādīsu paṭhame pañhe iminā rūpakāyena saddhiṃ agamanaṃ sandhāya paṭikkhipati. Dutiye antarābhavapuggalaṃ sandhāya paṭijānāti. So hi tassa laddhiyā sarūpova gantvā mātukucchiṃ pavisati. Athassa taṃ rūpaṃ bhijjati. Taṃ jīvanti yena rūpasaṅkhātena sarīrena saddhiṃ gacchati, kimassa tadeva jīvaṃ taṃ sarīranti pucchati. Paravādī idha sarīranikkhepā suttavirodhā ca paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Savedano"
      },
      "tiādīsu asaññūpapattiṃ sandhāya paṭikkhipati, tadaññaṃ upapattiṃ sandhāya paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ jīva"
      },
      "nti yena vedanādisaṅkhātena sarīrena saddhiṃ gacchati. Kimassa tadeva jīvaṃ taṃ sarīranti pucchati. Taṃ jīvaṃ taṃ sarīraṃ, aññaṃ jīvaṃ aññaṃ sarīranti etissā hi laddhiyā pañcapi khandhā sarīranti adhippetā. Paravādī suttavirodhā paṭikkhipati."
    ],
    "innerText": "Savedanotiādīsu asaññūpapattiṃ sandhāya paṭikkhipati, tadaññaṃ upapattiṃ sandhāya paṭijānāti. Taṃ jīvanti yena vedanādisaṅkhātena sarīrena saddhiṃ gacchati. Kimassa tadeva jīvaṃ taṃ sarīranti pucchati. Taṃ jīvaṃ taṃ sarīraṃ, aññaṃ jīvaṃ aññaṃ sarīranti etissā hi laddhiyā pañcapi khandhā sarīranti adhippetā. Paravādī suttavirodhā paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "92"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arūpo"
      },
      "tiādīsu paṭhame pañhe antarābhavaṃ sandhāya paṭikkhipati. Dutiye arūpā rūpaṃ upapajjamānaṃ sandhāya paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññaṃ, jīva"
      },
      "nti yaṃ ",
      " rūpasaṅkhātaṃ sarīraṃ pahāya arūpo ",
      " sandhāvati, kiṃ te taṃ sarīraṃ aññaṃ, aññaṃ jīvanti pucchati. Itaro suttavirodhā paṭikkhipati."
    ],
    "innerText": "92.Arūpotiādīsu paṭhame pañhe antarābhavaṃ sandhāya paṭikkhipati. Dutiye arūpā rūpaṃ upapajjamānaṃ sandhāya paṭijānāti. Aññaṃ, jīvanti yaṃ rūpasaṅkhātaṃ sarīraṃ pahāya arūpo sandhāvati, kiṃ te taṃ sarīraṃ aññaṃ, aññaṃ jīvanti pucchati. Itaro suttavirodhā paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avedano"
      },
      "tiādīsu saññībhavaṃ sandhāya paṭikkhipati, tadaññaṃ upapattiṃ sandhāya paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññaṃ jīva"
      },
      "nti yaṃ vedanādisaṅkhātaṃ sarīraṃ pahāya avedano aviññāṇo sandhāvati, kiṃ te taṃ aññaṃ sarīraṃ, aññaṃ jīvanti pucchati. Itaro suttavirodhā paṭikkhipati."
    ],
    "innerText": "Avedanotiādīsu saññībhavaṃ sandhāya paṭikkhipati, tadaññaṃ upapattiṃ sandhāya paṭijānāti. Aññaṃ jīvanti yaṃ vedanādisaṅkhātaṃ sarīraṃ pahāya avedano aviññāṇo sandhāvati, kiṃ te taṃ aññaṃ sarīraṃ, aññaṃ jīvanti pucchati. Itaro suttavirodhā paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "93"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpaṃ sandhāvatī"
      },
      "tiādīsu ye rūpādayo khandhe upādāya puggalaṃ paññapeti, kiṃ te tasmiṃ puggale sandhāvante tampi rūpaṃ sandhāvatīti pucchati. Paravādī ‘‘avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarata’’nti sattasseva sandhāvanavacanato ",
      " paṭikkhipati. Puna puṭṭho yasmā rūpādidhamme vinā puggalo natthi, tasmā tasmiṃ sandhāvante tenapi rūpena sandhāvitabbanti saññāya paṭijānāti. Vedanādīsupi eseva nayo."
    ],
    "innerText": "93.Rūpaṃ sandhāvatītiādīsu ye rūpādayo khandhe upādāya puggalaṃ paññapeti, kiṃ te tasmiṃ puggale sandhāvante tampi rūpaṃ sandhāvatīti pucchati. Paravādī ‘‘avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarata’’nti sattasseva sandhāvanavacanato paṭikkhipati. Puna puṭṭho yasmā rūpādidhamme vinā puggalo natthi, tasmā tasmiṃ sandhāvante tenapi rūpena sandhāvitabbanti saññāya paṭijānāti. Vedanādīsupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "94"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpaṃ na sandhāvatī"
      },
      "tiādīsu yasmā te rūpaṃ puggalo na hoti, sveva ca sandhāvatīti vadesi, tasmā taṃ pucchāmi, kiṃ te rūpaṃ na sandhāvatīti attho. Itaro puggale sandhāvante na sakkā tassa upādānabhūtena rūpena sandhāvitunti saññāya paṭikkhipati. Puna puṭṭho sattānaññeva sandhāvanavacanato paṭijānāti. Sesamettha uttānameva."
    ],
    "innerText": "94.Rūpaṃ na sandhāvatītiādīsu yasmā te rūpaṃ puggalo na hoti, sveva ca sandhāvatīti vadesi, tasmā taṃ pucchāmi, kiṃ te rūpaṃ na sandhāvatīti attho. Itaro puggale sandhāvante na sakkā tassa upādānabhūtena rūpena sandhāvitunti saññāya paṭikkhipati. Puna puṭṭho sattānaññeva sandhāvanavacanato paṭijānāti. Sesamettha uttānameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāthānaṃ pana ayamattho – āyasmato matena rukkhaṃ upādāya chāyā viya, indhanaṃ upādāya aggi viya ca, khandhe upādāya puggalo; rūpādīnaṃ sandhāvane asati tesu khandhesu bhijjamānesu so tava puggalo bhijjati ce, evaṃ sante ucchedā bhavati diṭṭhi, ucchedadiṭṭhi te āpajjati. Katarā yā buddhena vivajjitā akusaladiṭṭhi. Yā pana ‘‘ucchedavādī samaṇo gotamo’’ti pariyāyabhāsitā, na taṃ vadāmāti dasseti. Athāpi tesu khandhesu bhijjamānesu so puggalo na bhijjati, evaṃ sante sassato puggalo hoti. Tato so nibbānena samasamo āpajjati ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samasamo"
      },
      "ti ativiya samo, samena vā samo, samabhāveneva samo. Yatheva nibbānaṃ nuppajjati na bhijjati, evaṃ te puggalopi tena samasamoti."
    ],
    "innerText": "Gāthānaṃ pana ayamattho – āyasmato matena rukkhaṃ upādāya chāyā viya, indhanaṃ upādāya aggi viya ca, khandhe upādāya puggalo; rūpādīnaṃ sandhāvane asati tesu khandhesu bhijjamānesu so tava puggalo bhijjati ce, evaṃ sante ucchedā bhavati diṭṭhi, ucchedadiṭṭhi te āpajjati. Katarā yā buddhena vivajjitā akusaladiṭṭhi. Yā pana ‘‘ucchedavādī samaṇo gotamo’’ti pariyāyabhāsitā, na taṃ vadāmāti dasseti. Athāpi tesu khandhesu bhijjamānesu so puggalo na bhijjati, evaṃ sante sassato puggalo hoti. Tato so nibbānena samasamo āpajjati . Samasamoti ativiya samo, samena vā samo, samabhāveneva samo. Yatheva nibbānaṃ nuppajjati na bhijjati, evaṃ te puggalopi tena samasamoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Gatiparivattanamukhena cutipaṭisandhānuyogo niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anuyogavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "12. Upādāpaññattānuyogavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "95"
      },
      ". Idāni ",
      " upādāpaññattānuyogo hoti. Tattha pucchā sakavādissa, paṭiññāpaṭikkhepo paravādissa. So hi rukkhaṃ upādāya chāyāya viya, indhanaṃ upādāya aggissa viya ca, rūpādīni upādāya ",
      " puggalassa paññattiṃ paññāpanaṃ avabodhanaṃ icchati, tasmā ‘‘rūpaṃ upādāyā’’ti puṭṭho paṭijānāti. Puna yathā rukkhupādānā chāyā rukkho viya, indhanupādāno ca aggi indhanaṃ viya aniccādidhammo, evaṃ te rūpādiupādāno puggalo rūpādayo viya aniccoti imamatthaṃ puṭṭho attano laddhiyaṃ ṭhatvā paṭikkhipati."
    ],
    "innerText": "95. Idāni upādāpaññattānuyogo hoti. Tattha pucchā sakavādissa, paṭiññāpaṭikkhepo paravādissa. So hi rukkhaṃ upādāya chāyāya viya, indhanaṃ upādāya aggissa viya ca, rūpādīni upādāya puggalassa paññattiṃ paññāpanaṃ avabodhanaṃ icchati, tasmā ‘‘rūpaṃ upādāyā’’ti puṭṭho paṭijānāti. Puna yathā rukkhupādānā chāyā rukkho viya, indhanupādāno ca aggi indhanaṃ viya aniccādidhammo, evaṃ te rūpādiupādāno puggalo rūpādayo viya aniccoti imamatthaṃ puṭṭho attano laddhiyaṃ ṭhatvā paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "97"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nīlaṃ rūpaṃ upādāya nīlo"
      },
      "tiādīsu nīlarūpena saddhiṃ puggalassa ekattaṃ, ekasarīre nīlādīnaṃ bahūnaṃ vasena bahubhāvañca anicchanto paṭikkhipati."
    ],
    "innerText": "97.Nīlaṃ rūpaṃ upādāya nīlotiādīsu nīlarūpena saddhiṃ puggalassa ekattaṃ, ekasarīre nīlādīnaṃ bahūnaṃ vasena bahubhāvañca anicchanto paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "98"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalaṃ vedana"
      },
      "nti etthāpi vedanāya saddhiṃ ekattaṃ ekasantāne bahūnaṃ kusalavedanānaṃ vasena bahubhāvañca anicchanto paṭikkhipati. Dutiyanaye maggakusalotiādivacanasabbhāvato chekaṭṭhaṃ sandhāya paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saphalo"
      },
      "tiādīni puṭṭho tathārūpassa vohārassa abhāvato paṭikkhipati."
    ],
    "innerText": "98.Kusalaṃ vedananti etthāpi vedanāya saddhiṃ ekattaṃ ekasantāne bahūnaṃ kusalavedanānaṃ vasena bahubhāvañca anicchanto paṭikkhipati. Dutiyanaye maggakusalotiādivacanasabbhāvato chekaṭṭhaṃ sandhāya paṭijānāti. Saphalotiādīni puṭṭho tathārūpassa vohārassa abhāvato paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "99"
      },
      ". Akusalapakkhe achekaṭṭhaṃ sandhāya paṭijānāti."
    ],
    "innerText": "99. Akusalapakkhe achekaṭṭhaṃ sandhāya paṭijānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "100"
      },
      ". Abyākatapakkhe sassatādivasena abyākatabhāvaṃ sandhāya paṭijānāti. Sesamettha heṭṭhā vuttanayeneva veditabbaṃ."
    ],
    "innerText": "100. Abyākatapakkhe sassatādivasena abyākatabhāvaṃ sandhāya paṭijānāti. Sesamettha heṭṭhā vuttanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "104"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhuṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upādāyā"
      },
      "tiādīsu ‘‘cakkhumā visamānīva…pe… pāpāni parivajjaye’’ti(udā. 43) ādivohārasabbhāvato paṭijānāti. Cakkhumattādinirodhena puggalanirodhaṃ anicchanto paṭikkhipati."
    ],
    "innerText": "104.Cakkhuṃupādāyātiādīsu ‘‘cakkhumā visamānīva…pe… pāpāni parivajjaye’’ti(udā. 43) ādivohārasabbhāvato paṭijānāti. Cakkhumattādinirodhena puggalanirodhaṃ anicchanto paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "107"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpaṃ upādāya vedanaṃ upādāyā"
      },
      "ti ettha aññepi rūpamūlakā dukatikacatukkā veditabbā. Yasmā pana khandhe upādāya puggalassa paññatti, tasmā dvepi tayopi cattāropi pañcapi ",
      " upādāya paññattiṃ paṭijānāti. Ekasantāne pana dvinnaṃ pañcannaṃ vā abhāvā paṭikkhipati. Āyatanādīsupi eseva nayo."
    ],
    "innerText": "107.Rūpaṃ upādāya vedanaṃ upādāyāti ettha aññepi rūpamūlakā dukatikacatukkā veditabbā. Yasmā pana khandhe upādāya puggalassa paññatti, tasmā dvepi tayopi cattāropi pañcapi upādāya paññattiṃ paṭijānāti. Ekasantāne pana dvinnaṃ pañcannaṃ vā abhāvā paṭikkhipati. Āyatanādīsupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "112"
      },
      ". Idāni yaṃ upādāya yassa paññatti, yathā tassa aniccatāya tassāpi aniccatā, tato ca aññattaṃ siddhaṃ, evaṃ tassa puggalassāpi āpajjatīti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathā rukkha"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upādāyā"
      },
      "ti paṭicca āgamma, na vinā tanti attho. Paravādī pana tathā anicchanto laddhiyaṃ ṭhatvā paṭikkhipati."
    ],
    "innerText": "112. Idāni yaṃ upādāya yassa paññatti, yathā tassa aniccatāya tassāpi aniccatā, tato ca aññattaṃ siddhaṃ, evaṃ tassa puggalassāpi āpajjatīti dassetuṃ yathā rukkhantiādimāha. Tattha upādāyāti paṭicca āgamma, na vinā tanti attho. Paravādī pana tathā anicchanto laddhiyaṃ ṭhatvā paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "115"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nigaḷo"
      },
      "ti saṅkhalikabandhanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Negaḷiko"
      },
      "ti tena bandhako ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yassa rūpaṃ so rūpavā"
      },
      "ti yasmā yassa rūpaṃ so rūpavā hoti, tasmā yathā na nigaḷo ",
      "…pe… añño rūpavāti attho."
    ],
    "innerText": "115.Nigaḷoti saṅkhalikabandhanaṃ. Negaḷikoti tena bandhako yassa rūpaṃ so rūpavāti yasmā yassa rūpaṃ so rūpavā hoti, tasmā yathā na nigaḷo …pe… añño rūpavāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "116"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Citte citte"
      },
      "tiādīsu sarāgādicittavasena sarāgāditaṃ sandhāya cittānupassanāvasena paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jāyatī"
      },
      "tiādinā nayena puṭṭho puggalassa khaṇikabhāvaṃ anicchanto paṭikkhipati. ‘‘So’’ti vā ‘‘añño’’ti vā puṭṭho sassatucchedabhayena paṭikkhipati. Puna na vattabbaṃ ‘‘kumārako’’ti vā ‘‘kumārikā’’ti vā puṭṭho lokavohārasamucchedabhayena vattabbanti paṭijānāti. Sesamettha pākaṭameva."
    ],
    "innerText": "116.Citte cittetiādīsu sarāgādicittavasena sarāgāditaṃ sandhāya cittānupassanāvasena paṭijānāti. Jāyatītiādinā nayena puṭṭho puggalassa khaṇikabhāvaṃ anicchanto paṭikkhipati. ‘‘So’’ti vā ‘‘añño’’ti vā puṭṭho sassatucchedabhayena paṭikkhipati. Puna na vattabbaṃ ‘‘kumārako’’ti vā ‘‘kumārikā’’ti vā puṭṭho lokavohārasamucchedabhayena vattabbanti paṭijānāti. Sesamettha pākaṭameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "118"
      },
      ". Idāni paravādī aññenākārena laddhiṃ patiṭṭhāpetukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na vattabbaṃ puggalo upalabbhatī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na vattabba"
      },
      "nti kiṃ te iminā evaṃ bahunā upādāpaññattānuyogena, idaṃ tāva vadehi, kiṃ na vattabbaṃ ‘‘puggalo upalabbhati saccikaṭṭhaparamatthenā’’ti. Tato sakavādinā āmantāti vutte ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nanu yo passatī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yo"
      },
      "ti puggalo ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ya"
      },
      "nti rūpaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yenā"
      },
      "ti cakkhunā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So"
      },
      "ti puggalo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ta"
      },
      "nti rūpaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tenā"
      },
      "ti cakkhunā. Idaṃ vuttaṃ hoti – nanu yo yaṃ rūpaṃ yena cakkhunā passati, so taṃ rūpaṃ tena cakkhunā passanto puggaloti. Sakavādī kiñcāpi cakkhuviññāṇassa nissayabhāvaṃ gacchantaṃ cakkhumeva rūpaṃ passati, tathā sotameva saddaṃ suṇāti…pe… viññāṇameva dhammaṃ vijānāti, ‘‘atthi arahato cakkhu, passati arahā cakkhunā rūpa’’ntiādisammutivasena pana āmantāti paṭijānāti."
    ],
    "innerText": "118. Idāni paravādī aññenākārena laddhiṃ patiṭṭhāpetukāmo na vattabbaṃ puggalo upalabbhatītiādimāha. Tattha na vattabbanti kiṃ te iminā evaṃ bahunā upādāpaññattānuyogena, idaṃ tāva vadehi, kiṃ na vattabbaṃ ‘‘puggalo upalabbhati saccikaṭṭhaparamatthenā’’ti. Tato sakavādinā āmantāti vutte nanu yo passatītiādimāha. Tattha yoti puggalo . Yanti rūpaṃ. Yenāti cakkhunā. Soti puggalo. Tanti rūpaṃ. Tenāti cakkhunā. Idaṃ vuttaṃ hoti – nanu yo yaṃ rūpaṃ yena cakkhunā passati, so taṃ rūpaṃ tena cakkhunā passanto puggaloti. Sakavādī kiñcāpi cakkhuviññāṇassa nissayabhāvaṃ gacchantaṃ cakkhumeva rūpaṃ passati, tathā sotameva saddaṃ suṇāti…pe… viññāṇameva dhammaṃ vijānāti, ‘‘atthi arahato cakkhu, passati arahā cakkhunā rūpa’’ntiādisammutivasena pana āmantāti paṭijānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "120"
      },
      ". Tato ",
      " chalavādaṃ nissāya paravādinā puggalassa vattabbatāya sādhitāya tameva vādaṃ parivattetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalo upalabbhatī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yo na passatī"
      },
      "ti andho asaññasatto arūpaṃ upapanno nirodhaṃ samāpanno, anandhopi ca aññatra dassanasamayā na passati nāma. Sesavāresupi eseva nayo. Sesaṃ pāḷivaseneva atthato veditabbaṃ."
    ],
    "innerText": "120. Tato chalavādaṃ nissāya paravādinā puggalassa vattabbatāya sādhitāya tameva vādaṃ parivattetvā puggalo upalabbhatītiādimāha. Tattha yo na passatīti andho asaññasatto arūpaṃ upapanno nirodhaṃ samāpanno, anandhopi ca aññatra dassanasamayā na passati nāma. Sesavāresupi eseva nayo. Sesaṃ pāḷivaseneva atthato veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "122"
      },
      ". Suttasaṃsandanāyaṃ dibbassa cakkhuno rūpagocarattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpaṃ passatī"
      },
      "ti āha. Dutiyavāre ‘‘satte passāmī’’tivacanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalaṃ passatī"
      },
      "ti āha. Tatiyavāre ‘‘rūpaṃ disvā puggalaṃ vibhāvetī’’ti laddhito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ubho passatī"
      },
      "ti āha. Yasmā pana passitabbaṃ nāma diṭṭhaṃ sutaṃ mutaṃ viññātanti catubbidhe rūpasaṅgahe rūpāyatanameva saṅgahitaṃ, tasmā sakavādī ‘‘rūpaṃ puggalo, puggalo rūpaṃ, ubho rūpa’’nti anuyogaṃ karoti. Tassattho pākaṭoyevāti."
    ],
    "innerText": "122. Suttasaṃsandanāyaṃ dibbassa cakkhuno rūpagocarattā rūpaṃ passatīti āha. Dutiyavāre ‘‘satte passāmī’’tivacanato puggalaṃ passatīti āha. Tatiyavāre ‘‘rūpaṃ disvā puggalaṃ vibhāvetī’’ti laddhito ubho passatīti āha. Yasmā pana passitabbaṃ nāma diṭṭhaṃ sutaṃ mutaṃ viññātanti catubbidhe rūpasaṅgahe rūpāyatanameva saṅgahitaṃ, tasmā sakavādī ‘‘rūpaṃ puggalo, puggalo rūpaṃ, ubho rūpa’’nti anuyogaṃ karoti. Tassattho pākaṭoyevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Upādāpaññattānuyogavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "13. Purisakārānuyogavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "123"
      },
      ". Idāni ",
      " purisakārānuyogo hoti. Tattha kamme sati niyamato tassa kārakenapi bhavitabbanti laddhiyā pucchā paravādissa, tathārūpānaṃ kammānaṃ atthitāya paṭiññā sakavādissa. Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kattā kāretā"
      },
      "ti pucchā paravādissa. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kattā"
      },
      "ti tesaṃ kammānaṃ kārako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāretā"
      },
      "ti āṇattidesanādīhi upāyehi kārāpako. Idāni yasmā ",
      " paravādī puggalaṃ sandhāya kattāti pucchati, na karaṇamattaṃ, tasmā paṭikkhepo sakavādissa."
    ],
    "innerText": "123. Idāni purisakārānuyogo hoti. Tattha kamme sati niyamato tassa kārakenapi bhavitabbanti laddhiyā pucchā paravādissa, tathārūpānaṃ kammānaṃ atthitāya paṭiññā sakavādissa. Puna kattā kāretāti pucchā paravādissa. Tattha kattāti tesaṃ kammānaṃ kārako. Kāretāti āṇattidesanādīhi upāyehi kārāpako. Idāni yasmā paravādī puggalaṃ sandhāya kattāti pucchati, na karaṇamattaṃ, tasmā paṭikkhepo sakavādissa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "124"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa kattā kāretā"
      },
      "ti ettha yadi yaṃ yaṃ upalabbhati, tassa tassa kattā puggalo te upalabbhati, kiṃ tassāpi kārako ca kārāpako ca añño puggalo upalabbhatīti attho. Paravādī tathā anicchanto issaranimmānavādabhayena paṭikkhipati. Puna puṭṭho yasmā puggalaṃ mātāpitaro janenti nāmaṃ karonti posenti, tasmāssa te kārakā. Ye ca pana taṃ kalyāṇamittā vā ācariyā vā tāni tāni vijjāṭṭhānasippāyatanāni sikkhāpenti ",
      ", te kārāpakā nāmāti imamatthaṃ sandhāya paṭijānāti. Purimakammameva tassa kattā ceva kārāpetā cāti adhippetaṃ."
    ],
    "innerText": "124.Tassa kattā kāretāti ettha yadi yaṃ yaṃ upalabbhati, tassa tassa kattā puggalo te upalabbhati, kiṃ tassāpi kārako ca kārāpako ca añño puggalo upalabbhatīti attho. Paravādī tathā anicchanto issaranimmānavādabhayena paṭikkhipati. Puna puṭṭho yasmā puggalaṃ mātāpitaro janenti nāmaṃ karonti posenti, tasmāssa te kārakā. Ye ca pana taṃ kalyāṇamittā vā ācariyā vā tāni tāni vijjāṭṭhānasippāyatanāni sikkhāpenti , te kārāpakā nāmāti imamatthaṃ sandhāya paṭijānāti. Purimakammameva tassa kattā ceva kārāpetā cāti adhippetaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "125"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa tassevā"
      },
      "ti iminā idaṃ pucchati – yadi kammānaṃ kārakassa kattā tassāpi kattā tassāpi kattā attheva, evaṃ sante purimena purimena avassaṃ pacchā pacchā puggalo kātabboti imināpi te kammānaṃ kārakena puggalena āyatiṃ añño puggalo kātabbo, tenāpi aññoti natthi dukkhassa antakiriyā, natthi vaṭṭassa upacchedo, natthi appaccayaparinibbānaṃ. Paccayābhāvena paccayapaṭibaddhassa dukkhassa abhāvā yaṃ nibbānaṃ vuttaṃ, natthi te tanti. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tassa tassevā"
      },
      "ti yadi kammaṃ kammamattaṃ na hoti, tassa pana kārako puggalo, tassāpi kārako, tassāpi kārakoti evaṃ puggalaparamparā atthi. Evaṃ sante yā esā kammavaṭṭassa appavattikaraṇena dukkhassa antakiriyā vuttā, sā natthīti attho. Paravādī taṃ anicchanto paṭikkhipati. Ito aparāsupi upalabbhati sāmaññena kārakapucchāsu puggalaṃyeva sandhāya ‘‘kattā kāretā’’ti ",
      " vuttaṃ, na paccaye. Na hi mahāpathavīādīnaṃ paccayā natthi."
    ],
    "innerText": "125.Tassa tassevāti iminā idaṃ pucchati – yadi kammānaṃ kārakassa kattā tassāpi kattā tassāpi kattā attheva, evaṃ sante purimena purimena avassaṃ pacchā pacchā puggalo kātabboti imināpi te kammānaṃ kārakena puggalena āyatiṃ añño puggalo kātabbo, tenāpi aññoti natthi dukkhassa antakiriyā, natthi vaṭṭassa upacchedo, natthi appaccayaparinibbānaṃ. Paccayābhāvena paccayapaṭibaddhassa dukkhassa abhāvā yaṃ nibbānaṃ vuttaṃ, natthi te tanti. Atha vā tassa tassevāti yadi kammaṃ kammamattaṃ na hoti, tassa pana kārako puggalo, tassāpi kārako, tassāpi kārakoti evaṃ puggalaparamparā atthi. Evaṃ sante yā esā kammavaṭṭassa appavattikaraṇena dukkhassa antakiriyā vuttā, sā natthīti attho. Paravādī taṃ anicchanto paṭikkhipati. Ito aparāsupi upalabbhati sāmaññena kārakapucchāsu puggalaṃyeva sandhāya ‘‘kattā kāretā’’ti vuttaṃ, na paccaye. Na hi mahāpathavīādīnaṃ paccayā natthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "135"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Añño kalyāṇapāpakānaṃ kammānaṃ kattā"
      },
      "ti pañho ‘‘saṅkhāravantaṃ vā attāna’’ntiādidiṭṭhibhayā paṭikkhitto."
    ],
    "innerText": "135.Añño kalyāṇapāpakānaṃ kammānaṃ kattāti pañho ‘‘saṅkhāravantaṃ vā attāna’’ntiādidiṭṭhibhayā paṭikkhitto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "136"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipāko upalabbhatī"
      },
      "tiādi vipākapaṭisaṃvedīvasena puggalaṃ dassentassa laddhibhindanatthaṃ vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipākapaṭisaṃvedī"
      },
      "ti anuyogo paravādissa ",
      ", vipākapavattito aññassa vedakassa abhāvā paṭikkhepo sakavādissa. Puna pucchā sakavādissa, paṭiññā itarassa."
    ],
    "innerText": "136.Vipāko upalabbhatītiādi vipākapaṭisaṃvedīvasena puggalaṃ dassentassa laddhibhindanatthaṃ vuttaṃ. Tattha vipākapaṭisaṃvedīti anuyogo paravādissa , vipākapavattito aññassa vedakassa abhāvā paṭikkhepo sakavādissa. Puna pucchā sakavādissa, paṭiññā itarassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "138"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa paṭisaṃvedī"
      },
      "ti tassa vipākapaṭisaṃvedakassa paṭisaṃvedī yasmā pana paṭisaṃveditabbo nāma vipāko, na ca puggalo vipāko, tasmā paṭikkhepo paravādissa. Puna puṭṭho yasmā puññavipāke ṭhitattā vipākapaṭisaṃvedī puttaṃ vā patiṃ vā mātā vā jāyā vā paricumbati parisajjati, tasmā tathārūpaṃ paṭisaṃveditaṃ sandhāya paṭijānāti paravādī."
    ],
    "innerText": "138.Tassa paṭisaṃvedīti tassa vipākapaṭisaṃvedakassa paṭisaṃvedī yasmā pana paṭisaṃveditabbo nāma vipāko, na ca puggalo vipāko, tasmā paṭikkhepo paravādissa. Puna puṭṭho yasmā puññavipāke ṭhitattā vipākapaṭisaṃvedī puttaṃ vā patiṃ vā mātā vā jāyā vā paricumbati parisajjati, tasmā tathārūpaṃ paṭisaṃveditaṃ sandhāya paṭijānāti paravādī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tassevā"
      },
      "ti yadi vipāko vipākamattaṃ na hoti, tassa pana paṭisaṃvedī puggalo, tassāpi paṭisaṃvedī tassāpi paṭisaṃvedīti evaṃ puggalaparamparā atthi. Evaṃ sante yā esā vipākavaṭṭassa appavattikaraṇena dukkhassa antakiriyā vuttā, sā natthīti attho. Ito paraṃ upalabbhatisāmaññena paṭisaṃvedīpucchāsu heṭṭhā vuttanayeneva attho veditabbo."
    ],
    "innerText": "Tassatassevāti yadi vipāko vipākamattaṃ na hoti, tassa pana paṭisaṃvedī puggalo, tassāpi paṭisaṃvedī tassāpi paṭisaṃvedīti evaṃ puggalaparamparā atthi. Evaṃ sante yā esā vipākavaṭṭassa appavattikaraṇena dukkhassa antakiriyā vuttā, sā natthīti attho. Ito paraṃ upalabbhatisāmaññena paṭisaṃvedīpucchāsu heṭṭhā vuttanayeneva attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "142"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Añño kalyāṇapāpakānaṃ kammānaṃ vipākapaṭisaṃvedī"
      },
      "ti pañho ‘‘vedanavantaṃ vā attāna’’ntiādidiṭṭhibhayā paṭikkhitto."
    ],
    "innerText": "142.Añño kalyāṇapāpakānaṃ kammānaṃ vipākapaṭisaṃvedīti pañho ‘‘vedanavantaṃ vā attāna’’ntiādidiṭṭhibhayā paṭikkhitto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "143"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dibbaṃ sukha"
      },
      "ntiādi kalyāṇapāpakānaṃ kammānaṃ vipākaṃ bhājetvā dassanavasena āraddhaṃ. Taṃ sabbaṃ heṭṭhā vuttanayeneva veditabbaṃ. Sakavādino cettha puggalavaseneva paṭisaṃvedīpaṭikkhepo veditabbo, na vedayitavasena."
    ],
    "innerText": "143.Dibbaṃ sukhantiādi kalyāṇapāpakānaṃ kammānaṃ vipākaṃ bhājetvā dassanavasena āraddhaṃ. Taṃ sabbaṃ heṭṭhā vuttanayeneva veditabbaṃ. Sakavādino cettha puggalavaseneva paṭisaṃvedīpaṭikkhepo veditabbo, na vedayitavasena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "148"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāpathavī"
      },
      "ādīni hi ārammaṇaṃ katvā vedayitānaṃ uppatti appaṭisiddhā."
    ],
    "innerText": "148.Mahāpathavīādīni hi ārammaṇaṃ katvā vedayitānaṃ uppatti appaṭisiddhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "170"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kattā kāretā vipākapaṭisaṃvedī"
      },
      "tiādi vomissakanayavasena āraddhaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "so karotī"
      },
      "ti yaṃ tvaṃ kattāti ca paṭisaṃvedīti ca vadesi, kiṃ soyeva karoti, so paṭisaṃvedeti. Ayamanuyogo sakavādissa, suttavirodhabhayena paṭikkhepo paravādissa."
    ],
    "innerText": "170.Kattā kāretā vipākapaṭisaṃvedītiādi vomissakanayavasena āraddhaṃ. Tattha so karotīti yaṃ tvaṃ kattāti ca paṭisaṃvedīti ca vadesi, kiṃ soyeva karoti, so paṭisaṃvedeti. Ayamanuyogo sakavādissa, suttavirodhabhayena paṭikkhepo paravādissa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "171"
      },
      ". Puna ",
      " puṭṭho ‘‘idha nandati pecca nandatī’’tiādisuttavasena (dha. pa. 18) paṭiññā tasseva. Athassa vacanokāsaṃ paṭibāhanto sakavādī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sayaṃkataṃ sukhadukkha"
      },
      "nti ",
      " āha."
    ],
    "innerText": "171. Puna puṭṭho ‘‘idha nandati pecca nandatī’’tiādisuttavasena (dha. pa. 18) paṭiññā tasseva. Athassa vacanokāsaṃ paṭibāhanto sakavādī sayaṃkataṃ sukhadukkhanti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "172"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "añño karotī"
      },
      "ti kārakavedakānaṃ aññattapucchāvasena vuttaṃ. Tato paravādī suttavirodhabhayena paṭikkhipitvā puna puṭṭho ‘‘manussabhūto katvā devabhūto paṭisaṃvedetī’’ti maññamāno paṭijānāti ",
      ". Evaṃvādino pana paraṃkataṃ sukhadukkhaṃ āpajjatīti tassa vasena puṭṭho puna paṭikkhipati."
    ],
    "innerText": "172. Tattha añño karotīti kārakavedakānaṃ aññattapucchāvasena vuttaṃ. Tato paravādī suttavirodhabhayena paṭikkhipitvā puna puṭṭho ‘‘manussabhūto katvā devabhūto paṭisaṃvedetī’’ti maññamāno paṭijānāti . Evaṃvādino pana paraṃkataṃ sukhadukkhaṃ āpajjatīti tassa vasena puṭṭho puna paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "174"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So ca añño cā"
      },
      "ti kārakavedakānaṃ ekattaaññattapucchāvasena vuttaṃ. Tato paravādī suttavirodhabhayeneva paṭikkhipitvā puna puṭṭho purime dvepi naye ekato katvā paṭijānāti. Evaṃvādino pana sayaṃkatañca paraṃkatañca sukhadukkhaṃ āpajjatīti tassa vasena puṭṭho puna paṭikkhipati."
    ],
    "innerText": "174.So ca añño cāti kārakavedakānaṃ ekattaaññattapucchāvasena vuttaṃ. Tato paravādī suttavirodhabhayeneva paṭikkhipitvā puna puṭṭho purime dvepi naye ekato katvā paṭijānāti. Evaṃvādino pana sayaṃkatañca paraṃkatañca sukhadukkhaṃ āpajjatīti tassa vasena puṭṭho puna paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "176"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Neva so karotī"
      },
      "ti kārakavedakānaṃ ekattaaññattapaṭikkhepavasena vuttaṃ. Tato paravādī suttavirodhavaseneva paṭikkhipitvā puna puṭṭho yasmā manusso devalokūpapattiyā kammaṃ katvā na manussabhūtova paṭisaṃvedeti, nāpi yena kammaṃ kataṃ, tato aññova paṭisaṃvedeti, tasmā kārakato vedako neva so hoti, na aññoti maññamāno paṭijānāti. Laddhimattamevetaṃ? Evaṃvādino pana asayaṃkāraṃ aparaṃkāraṃ adhiccasamuppannaṃ sukhadukkhaṃ āpajjatīti tassa vasena puṭṭho puna paṭikkhipati. Apica imasmiṃ vomissakanaye ādito paṭṭhāya imināpi nayena attho veditabbo. Yasmā hi ayaṃ puggalavādī kammānaṃ kārakañceva vedakañca icchati, tasmāssa yo kārako, teneva vā vedakena bhavitabbaṃ, aññena vā ubhohi vā bhavitabbaṃ, ubhohi vāpi na bhavitabbanti idamāpannaṃ hoti. Evamāpannameva anuyogaṃ anuyuñjanto sakavādī ‘‘so karotī’’tiādayo cattāropi vikappe āha. Sesaṃ vuttappakārameva."
    ],
    "innerText": "176.Neva so karotīti kārakavedakānaṃ ekattaaññattapaṭikkhepavasena vuttaṃ. Tato paravādī suttavirodhavaseneva paṭikkhipitvā puna puṭṭho yasmā manusso devalokūpapattiyā kammaṃ katvā na manussabhūtova paṭisaṃvedeti, nāpi yena kammaṃ kataṃ, tato aññova paṭisaṃvedeti, tasmā kārakato vedako neva so hoti, na aññoti maññamāno paṭijānāti. Laddhimattamevetaṃ? Evaṃvādino pana asayaṃkāraṃ aparaṃkāraṃ adhiccasamuppannaṃ sukhadukkhaṃ āpajjatīti tassa vasena puṭṭho puna paṭikkhipati. Apica imasmiṃ vomissakanaye ādito paṭṭhāya imināpi nayena attho veditabbo. Yasmā hi ayaṃ puggalavādī kammānaṃ kārakañceva vedakañca icchati, tasmāssa yo kārako, teneva vā vedakena bhavitabbaṃ, aññena vā ubhohi vā bhavitabbaṃ, ubhohi vāpi na bhavitabbanti idamāpannaṃ hoti. Evamāpannameva anuyogaṃ anuyuñjanto sakavādī ‘‘so karotī’’tiādayo cattāropi vikappe āha. Sesaṃ vuttappakārameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pariyosāne pana cattāropi pañhā ekato puṭṭhā. Tattha paṭikkhepo ca paṭijānanā ca sayaṃkatādidosappatti ca purimanayeneva veditabbā. Ito ",
      " paraṃ ‘‘kalyāṇapāpakānī’’ti avatvā heṭṭhā vuttanayā eva ‘‘kammaṃ atthī’’tiādinā vikappena dassitā. Tesampi heṭṭhā vuttanayeneva attho veditabbo."
    ],
    "innerText": "Pariyosāne pana cattāropi pañhā ekato puṭṭhā. Tattha paṭikkhepo ca paṭijānanā ca sayaṃkatādidosappatti ca purimanayeneva veditabbā. Ito paraṃ ‘‘kalyāṇapāpakānī’’ti avatvā heṭṭhā vuttanayā eva ‘‘kammaṃ atthī’’tiādinā vikappena dassitā. Tesampi heṭṭhā vuttanayeneva attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Purisakārānuyogavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kalyāṇavaggotipi etasseva nāmaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "14. Abhiññānuyogavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "193"
      },
      ". Ito ",
      " paraṃ abhiññānuyogādivasena arahattasādhanā hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āmantā"
      },
      "ti sakavādinā paṭiññāte paravādī ‘‘bahiddhā anindriyabaddharūpe iddhividhādivisesādhigamo natthi, ajjhattaṃ ",
      " atthi, tasmā iddhādinibbattakena puggalena bhavitabba’’nti maññamāno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nanu atthi koci iddhiṃ vikubbatī"
      },
      "tiādimāha. Taṃ sabbaṃ uttānatthameva."
    ],
    "innerText": "193. Ito paraṃ abhiññānuyogādivasena arahattasādhanā hoti. Tattha āmantāti sakavādinā paṭiññāte paravādī ‘‘bahiddhā anindriyabaddharūpe iddhividhādivisesādhigamo natthi, ajjhattaṃ atthi, tasmā iddhādinibbattakena puggalena bhavitabba’’nti maññamāno nanu atthi koci iddhiṃ vikubbatītiādimāha. Taṃ sabbaṃ uttānatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhiññānuyogavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "15-18. Ñātakānuyogādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "197"
      },
      ". Idāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mātā"
      },
      "tiādiko ñātakānuyogo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khattiyo"
      },
      "tiādiko jātianuyogo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gahaṭṭho pabbajito"
      },
      "ti paṭipattianuyogo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devo manusso"
      },
      "ti upapattianuyogo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sotāpanno"
      },
      "tiādiko paṭivedhānuyogo, ariyānuyogotipi vuccati. Te sabbe uttānatthāyeva. ‘‘Arahā hutvā na arahā’’ti panettha moghapañhattā na vuttaṃ."
    ],
    "innerText": "197. Idāni mātātiādiko ñātakānuyogo. Khattiyotiādiko jātianuyogo. Gahaṭṭho pabbajitoti paṭipattianuyogo. Devo manussoti upapattianuyogo. Sotāpannotiādiko paṭivedhānuyogo, ariyānuyogotipi vuccati. Te sabbe uttānatthāyeva. ‘‘Arahā hutvā na arahā’’ti panettha moghapañhattā na vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "206"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattāro purisayugā"
      },
      "tiādi saṃghānuyogo, sopi uttānatthoyeva."
    ],
    "innerText": "206.Cattāro purisayugātiādi saṃghānuyogo, sopi uttānatthoyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "209"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhato"
      },
      "tiādi saccikaṭṭhasabhāvānuyogo. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatiyā koṭī"
      },
      "ti pucchā sakavādissa. Tathārūpassa saccikaṭṭhassa abhāvato paṭikkhepo paravādissa. Puna puṭṭho puggalaṃ sandhāya paṭiññā tasseva."
    ],
    "innerText": "209.Saṅkhatotiādi saccikaṭṭhasabhāvānuyogo. Tattha tatiyā koṭīti pucchā sakavādissa. Tathārūpassa saccikaṭṭhassa abhāvato paṭikkhepo paravādissa. Puna puṭṭho puggalaṃ sandhāya paṭiññā tasseva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "211"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Añño"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalo"
      },
      "tipañhepi saṅkhatehi khandhehi aññattaṃ anicchanto paṭikkhepo tasseva."
    ],
    "innerText": "211.Aññopuggalotipañhepi saṅkhatehi khandhehi aññattaṃ anicchanto paṭikkhepo tasseva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "212"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khandhā saṅkhatā"
      },
      "tiādi saṅkhatāsaṅkhatāni sarūpena dassetvā aññattapucchanatthaṃ vuttaṃ."
    ],
    "innerText": "212.Khandhā saṅkhatātiādi saṅkhatāsaṅkhatāni sarūpena dassetvā aññattapucchanatthaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "213"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpaṃ saṅkhata"
      },
      "ntiādi khandhe vibhāgato dassetvā aññattapucchanatthaṃ vuttaṃ."
    ],
    "innerText": "213.Rūpaṃ saṅkhatantiādi khandhe vibhāgato dassetvā aññattapucchanatthaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "214"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puggalassa uppādo"
      },
      "ti pucchā sakavādissa, ‘‘jātidhammā jarādhammā, atho maraṇadhammino’’tiādisuttavasena ",
      " paṭiññā paravādissa. Saṅkhatabhāvaṃ panassa so na icchati, tasmā paṭikkhipati."
    ],
    "innerText": "214.Puggalassa uppādoti pucchā sakavādissa, ‘‘jātidhammā jarādhammā, atho maraṇadhammino’’tiādisuttavasena paṭiññā paravādissa. Saṅkhatabhāvaṃ panassa so na icchati, tasmā paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "215"
      },
      ". Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na uppādo paññāyatī"
      },
      "tiādinā nayena puṭṭho ‘‘dukkhameva hi sambhoti ",
      ", dukkhaṃ tiṭṭhati veti cā’’tiādivacanato (saṃ. ni. 1.171) puggalassa uppādādayo nāma na yujjantīti paṭijānāti."
    ],
    "innerText": "215. Puna na uppādo paññāyatītiādinā nayena puṭṭho ‘‘dukkhameva hi sambhoti , dukkhaṃ tiṭṭhati veti cā’’tiādivacanato (saṃ. ni. 1.171) puggalassa uppādādayo nāma na yujjantīti paṭijānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "216"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthatthamhī"
      },
      "ti atthaṃ vuccati nibbānaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthī"
      },
      "ti pucchati. Tassa atthitāya sassataṃ, natthitāya. Ucchedo āpajjati. Tadubhayampi anicchanto pacchā paṭikkhipati."
    ],
    "innerText": "216.Atthatthamhīti atthaṃ vuccati nibbānaṃ. Tattha atthīti pucchati. Tassa atthitāya sassataṃ, natthitāya. Ucchedo āpajjati. Tadubhayampi anicchanto pacchā paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ñātakānuyogādivaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "19. Paṭivedhānuyogādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "217"
      },
      ". Bhavaṃ nissāya pañhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhava"
      },
      "nti upapattibhavaṃ."
    ],
    "innerText": "217. Bhavaṃ nissāya pañhe bhavanti upapattibhavaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "218"
      },
      ". Vedanaṃ vediyamānapañhe vedanaṃ vediyamāno pariggahitavedano yogāvacarova pajānāti, bālaputhujjano nappajānāti."
    ],
    "innerText": "218. Vedanaṃ vediyamānapañhe vedanaṃ vediyamāno pariggahitavedano yogāvacarova pajānāti, bālaputhujjano nappajānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "224"
      },
      ". Kāyānupassanādipañhā uttānatthāyeva."
    ],
    "innerText": "224. Kāyānupassanādipañhā uttānatthāyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "226"
      },
      ". Pārāyanagāthāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suññato lokaṃ avekkhassū"
      },
      "ti sattasuññatavasena khandhalokaṃ olokehīti attho."
    ],
    "innerText": "226. Pārāyanagāthāya suññato lokaṃ avekkhassūti sattasuññatavasena khandhalokaṃ olokehīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "228"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puggalo avekkhatī"
      },
      "ti sakavādipucchā. Paravādissa hi ‘‘suññato lokaṃ avekkhassū’’ti gāthāya yo avekkhati, so puggaloti laddhi, tasmā naṃ evaṃ pucchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saha rūpenā"
      },
      "ti ",
      " rūpakāyena saddhiṃ. Tato anissaṭo hutvāti attho. Idaṃ pañcavokāravasena anujānitvā puna taṃ jīvanti puṭṭho suttavirodhabhayena paṭikkhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinā rūpenā"
      },
      "ti idaṃ catuvokāravasena anujānitvā puna aññaṃ jīvanti puṭṭho suttavirodhabhayeneva paṭikkhipati. ‘‘Abbhantaragato’’ti ca ‘‘bahiddhā nikkhamitvā’’ti ca idaṃ ‘‘saha rūpena vinā rūpenā’’ti heṭṭhā vuttassa lakkhaṇavacanaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abbhantaragato"
      },
      "ti rūpassa antogato, ito vā etto vā anikkhamitvā rūpaparicchedavaseneva ṭhito hutvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nikkhamitvā"
      },
      "ti rūpaparicchedaṃ atikkamitvā. Rūpaṃ anissito hutvāti attho."
    ],
    "innerText": "228.Puggalo avekkhatīti sakavādipucchā. Paravādissa hi ‘‘suññato lokaṃ avekkhassū’’ti gāthāya yo avekkhati, so puggaloti laddhi, tasmā naṃ evaṃ pucchati. Saha rūpenāti rūpakāyena saddhiṃ. Tato anissaṭo hutvāti attho. Idaṃ pañcavokāravasena anujānitvā puna taṃ jīvanti puṭṭho suttavirodhabhayena paṭikkhipati. Vinā rūpenāti idaṃ catuvokāravasena anujānitvā puna aññaṃ jīvanti puṭṭho suttavirodhabhayeneva paṭikkhipati. ‘‘Abbhantaragato’’ti ca ‘‘bahiddhā nikkhamitvā’’ti ca idaṃ ‘‘saha rūpena vinā rūpenā’’ti heṭṭhā vuttassa lakkhaṇavacanaṃ. Tattha abbhantaragatoti rūpassa antogato, ito vā etto vā anikkhamitvā rūpaparicchedavaseneva ṭhito hutvāti attho. Nikkhamitvāti rūpaparicchedaṃ atikkamitvā. Rūpaṃ anissito hutvāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "231"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anattā"
      },
      "ti attanā jīvena puggalena rahito. Ekadhammepi puggalo natthīti attho. Evaṃ sabbasuttānaṃ āgamaṭṭhakathāsu vuttanayeneva ",
      " attho veditabbo. Idha pana sandhāyabhāsitamattameva vakkhāma."
    ],
    "innerText": "231.Anattāti attanā jīvena puggalena rahito. Ekadhammepi puggalo natthīti attho. Evaṃ sabbasuttānaṃ āgamaṭṭhakathāsu vuttanayeneva attho veditabbo. Idha pana sandhāyabhāsitamattameva vakkhāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "237"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuttaṃ bhagavatā sappikumbho"
      },
      "tiādi ‘‘sabbāva desanā yathārutavaseneva atthato na gahetabbā’’ti dassanatthaṃ ābhataṃ. Yathā hi suvaṇṇaṃ gahetvā kato suvaṇṇavikāro kumbho suvaṇṇakumbhoti vuccati, na evaṃ sappiṃ gahetvā kato sappissa vikāro sappikumbho nāma atthi. Yasmiṃ pana kumbhe sappi pakkhittaṃ, so sappikumbho nāmāti ayamettha attho. Telakumbhādīsupi eseva nayo. Yathā ca nibbānaṃ niccaṃ dhuvaṃ, na evaṃ bhattaṃ vā yāgu vā atthi. Kālaparicchedaṃ pana akatvā divase divase dassāmāti paññattavasena ‘‘niccabhattaṃ dhuvayāgū’’ti vuccatīti ayamettha attho."
    ],
    "innerText": "237.Vuttaṃ bhagavatā sappikumbhotiādi ‘‘sabbāva desanā yathārutavaseneva atthato na gahetabbā’’ti dassanatthaṃ ābhataṃ. Yathā hi suvaṇṇaṃ gahetvā kato suvaṇṇavikāro kumbho suvaṇṇakumbhoti vuccati, na evaṃ sappiṃ gahetvā kato sappissa vikāro sappikumbho nāma atthi. Yasmiṃ pana kumbhe sappi pakkhittaṃ, so sappikumbho nāmāti ayamettha attho. Telakumbhādīsupi eseva nayo. Yathā ca nibbānaṃ niccaṃ dhuvaṃ, na evaṃ bhattaṃ vā yāgu vā atthi. Kālaparicchedaṃ pana akatvā divase divase dassāmāti paññattavasena ‘‘niccabhattaṃ dhuvayāgū’’ti vuccatīti ayamettha attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atthi puggalo attahitāya paṭipanno’’tiādīsupi yathā rūpādayo dhammā paccattalakkhaṇasāmaññalakkhaṇavasena atthi, na evaṃ puggalo ",
      ". Rūpādīsu pana sati ‘evaṃnāmo’‘evaṃgotto’ti vohāro hoti. Iti iminā lokavohārena lokasammutiyā lokaniruttiyā atthi puggaloti ayamettha attho. Vuttampi cetaṃ bhagavatā – ‘‘imā kho citta, lokasamaññā lokaniruttiyo lokavohārā lokapaññattiyo’’ti (dī. ni. 1.440). Rūpādidhammā pana vināpi lokasammutiṃ paccattasāmaññalakkhaṇavasena paññāpanato atthīti ayamettha attho."
    ],
    "innerText": "‘‘Atthi puggalo attahitāya paṭipanno’’tiādīsupi yathā rūpādayo dhammā paccattalakkhaṇasāmaññalakkhaṇavasena atthi, na evaṃ puggalo . Rūpādīsu pana sati ‘evaṃnāmo’‘evaṃgotto’ti vohāro hoti. Iti iminā lokavohārena lokasammutiyā lokaniruttiyā atthi puggaloti ayamettha attho. Vuttampi cetaṃ bhagavatā – ‘‘imā kho citta, lokasamaññā lokaniruttiyo lokavohārā lokapaññattiyo’’ti (dī. ni. 1.440). Rūpādidhammā pana vināpi lokasammutiṃ paccattasāmaññalakkhaṇavasena paññāpanato atthīti ayamettha attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Buddhānaṃ ",
      " pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dve kathā"
      },
      " sammutikathā ca paramatthakathā ca. Tattha satto, puggalo, devo, brahmātiādikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammutikathā"
      },
      " nāma. Aniccaṃ, dukkhaṃ, anattā, khandhā, dhātuyo, āyatanāni, satipaṭṭhānā, sammappadhānātiādikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paramatthakathā"
      },
      " nāma."
    ],
    "innerText": "Buddhānaṃ pana dve kathā sammutikathā ca paramatthakathā ca. Tattha satto, puggalo, devo, brahmātiādikā sammutikathā nāma. Aniccaṃ, dukkhaṃ, anattā, khandhā, dhātuyo, āyatanāni, satipaṭṭhānā, sammappadhānātiādikā paramatthakathā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yo sammutidesanāya sattoti vā…pe… brahmāti vāti vutte jānituṃ paṭivijjhituṃ niyyātuṃ arahattajayaggāhaṃ gahetuṃ sakkoti, tassa bhagavā āditova sattoti vā puggaloti vā posoti vā devoti vā brahmāti vā katheti. Yo paramatthadesanāya aniccanti vā dukkhanti vātiādīsu aññataraṃ sutvāva jānituṃ paṭivijjhituṃ niyyātuṃ arahattajayaggāhaṃ gahetuṃ sakkoti. Tassa aniccantiādīsu aññataraṃ katheti. Tathā sammutikathāya bujjhanakasattassa na paṭhamaṃ paramatthakathaṃ katheti. Sammutikathāya pana bodhetvā pacchā paramatthakathaṃ katheti ",
      ". Paramatthakathāya bujjhanakasattassāpi na paṭhamaṃ sammutikathaṃ katheti. Paramatthakathāya pana bodhetvā pacchā sammutikathaṃ katheti. Pakatiyā pana paṭhamameva paramatthakathaṃ kathentassa desanā lūkhākārā hoti. Tasmā buddhā paṭhamaṃ sammutikathaṃ kathetvā pacchā paramatthakathaṃ kathenti. Te sammutikathaṃ kathentāpi saccameva sabhāvameva amusāva kathenti. Paramatthakathaṃ kathentāpi saccameva sabhāvameva amusāva kathenti. Ayañhi –"
    ],
    "innerText": "Tattha yo sammutidesanāya sattoti vā…pe… brahmāti vāti vutte jānituṃ paṭivijjhituṃ niyyātuṃ arahattajayaggāhaṃ gahetuṃ sakkoti, tassa bhagavā āditova sattoti vā puggaloti vā posoti vā devoti vā brahmāti vā katheti. Yo paramatthadesanāya aniccanti vā dukkhanti vātiādīsu aññataraṃ sutvāva jānituṃ paṭivijjhituṃ niyyātuṃ arahattajayaggāhaṃ gahetuṃ sakkoti. Tassa aniccantiādīsu aññataraṃ katheti. Tathā sammutikathāya bujjhanakasattassa na paṭhamaṃ paramatthakathaṃ katheti. Sammutikathāya pana bodhetvā pacchā paramatthakathaṃ katheti . Paramatthakathāya bujjhanakasattassāpi na paṭhamaṃ sammutikathaṃ katheti. Paramatthakathāya pana bodhetvā pacchā sammutikathaṃ katheti. Pakatiyā pana paṭhamameva paramatthakathaṃ kathentassa desanā lūkhākārā hoti. Tasmā buddhā paṭhamaṃ sammutikathaṃ kathetvā pacchā paramatthakathaṃ kathenti. Te sammutikathaṃ kathentāpi saccameva sabhāvameva amusāva kathenti. Paramatthakathaṃ kathentāpi saccameva sabhāvameva amusāva kathenti. Ayañhi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Duve saccāni akkhāsi, sambuddho vadataṃ varo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sammutiṃ paramatthañca, tatiyaṃ nupalabbhati’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " –"
    ],
    "innerText": "Tattha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Saṅketavacanaṃ saccaṃ, lokasammutikāraṇaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paramatthavacanaṃ saccaṃ, dhammānaṃ tathalakkhaṇa’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Aparo nayo – dve bhagavato desanā paramatthadesanā ca khandhādivasena, sammutidesanā ca sappikumbhādivasena. Na hi bhagavā samaññaṃ atidhāvati. Tasmā ‘‘atthi puggalo’’ti vacanamattato abhiniveso na kātabbo. Satthārā hi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Paññattiṃ ",
      " anatikkamma, paramattho pakāsito;"
    ],
    "innerText": "‘‘Paññattiṃ anatikkamma, paramattho pakāsito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Samaññaṃ nātidhāveyya, tasmā aññopi paṇḍito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paramatthaṃ pakāsento, samaññaṃ nātidhāvaye’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Puggalakathā niṭṭhitā."
  }
]