[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "18. Dhammahadayavibhaṅgo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Sabbasaṅgāhikavāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "978"
      },
      ". Idāni ",
      " tadanantare dhammahadayavibhaṅge pāḷiparicchedo tāva evaṃ veditabbo – ettha hi āditova khandhādīnaṃ dvādasannaṃ koṭṭhāsānaṃ vasena sabbasaṅgāhikavāro nāma vutto. Dutiyo tesaṃyeva dhammānaṃ kāmadhātuādīsu uppattānuppattidassanavāro nāma. Tatiyo tattheva pariyāpannāpariyāpannadassanavāro nāma. Catuttho tīsu bhūmīsu uppattikkhaṇe vijjamānāvijjamānadhammadassanavāro nāma. Pañcamo tesaṃ dhammānaṃ bhūmantaravasena dassanavāro nāma. Chaṭṭho gatīsu uppādakakammaāyuppamāṇadassanavāro nāma. Sattamo abhiññeyyādivāro nāma. Aṭṭhamo sārammaṇānārammaṇavāro nāma. Navamo tesaṃ khandhādidhammānaṃ diṭṭhasutādivasena saṅgahetvā dassanavāro nāma. Dasamo kusalattikādivasena saṅgahetvā dassanavāro nāma."
    ],
    "innerText": "978. Idāni tadanantare dhammahadayavibhaṅge pāḷiparicchedo tāva evaṃ veditabbo – ettha hi āditova khandhādīnaṃ dvādasannaṃ koṭṭhāsānaṃ vasena sabbasaṅgāhikavāro nāma vutto. Dutiyo tesaṃyeva dhammānaṃ kāmadhātuādīsu uppattānuppattidassanavāro nāma. Tatiyo tattheva pariyāpannāpariyāpannadassanavāro nāma. Catuttho tīsu bhūmīsu uppattikkhaṇe vijjamānāvijjamānadhammadassanavāro nāma. Pañcamo tesaṃ dhammānaṃ bhūmantaravasena dassanavāro nāma. Chaṭṭho gatīsu uppādakakammaāyuppamāṇadassanavāro nāma. Sattamo abhiññeyyādivāro nāma. Aṭṭhamo sārammaṇānārammaṇavāro nāma. Navamo tesaṃ khandhādidhammānaṃ diṭṭhasutādivasena saṅgahetvā dassanavāro nāma. Dasamo kusalattikādivasena saṅgahetvā dassanavāro nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "979"
      },
      ". Evaṃ dasahi vārehi paricchinnāya pāḷiyā paṭhame tāva sabbasaṅgāhikavāre ‘‘avīcito yāva bhavaggaṃ etthantare kati khandhā’’ti pucchite ‘‘ekoti vā…pe… cattāroti vā chāti vā avatvā pañcāti vattuṃ samattho añño natthī’’ti attano ñāṇabalaṃ dīpento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcakkhandhā"
      },
      "ti pucchānurūpaṃ vissajjanaṃ āha. Yathāpucchaṃ vissajjanañhi sabbaññubyākaraṇaṃ nāmāti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvādasāyatanānī"
      },
      "tiādīsupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpakkhandhādīnaṃ"
      },
      " pabhedo khandhavibhaṅgādīsu vuttanayeneva veditabbo."
    ],
    "innerText": "979. Evaṃ dasahi vārehi paricchinnāya pāḷiyā paṭhame tāva sabbasaṅgāhikavāre ‘‘avīcito yāva bhavaggaṃ etthantare kati khandhā’’ti pucchite ‘‘ekoti vā…pe… cattāroti vā chāti vā avatvā pañcāti vattuṃ samattho añño natthī’’ti attano ñāṇabalaṃ dīpento pañcakkhandhāti pucchānurūpaṃ vissajjanaṃ āha. Yathāpucchaṃ vissajjanañhi sabbaññubyākaraṇaṃ nāmāti vuccati. Dvādasāyatanānītiādīsupi eseva nayo. Rūpakkhandhādīnaṃ pabhedo khandhavibhaṅgādīsu vuttanayeneva veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Uppattānuppattivāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "991"
      },
      ". Dutiyavāre ",
      " ye dhammā kāmabhave kāmadhātusambhūtānañca sattānaṃ uppajjanti – kāmadhātuyaṃ pariyāpannā vā apariyāpannā vā – te sabbe saṅgahetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmadhātuyā pañcakkhandhā"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpadhātu"
      },
      "ādīsupi eseva nayo. Yasmā pana rūpadhātupariyāpannānaṃ sattānaṃ ghānāyatanādīnaṃ abhāvena gandhāyatanādīni āyatanādikiccaṃ na karonti, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpadhātuyā cha āyatanāni, nava dhātuyo"
      },
      "tiādi vuttaṃ ",
      ". Yasmā ca okāsavasena vā sattuppattivasena ",
      " vā apariyāpannadhātu nāma natthi, tasmā apariyāpannadhātuyāti avatvā yaṃ yaṃ apariyāpannaṃ taṃ tadeva dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apariyāpanne kati khandhā"
      },
      "tiādi vuttaṃ."
    ],
    "innerText": "991. Dutiyavāre ye dhammā kāmabhave kāmadhātusambhūtānañca sattānaṃ uppajjanti – kāmadhātuyaṃ pariyāpannā vā apariyāpannā vā – te sabbe saṅgahetvā kāmadhātuyā pañcakkhandhātiādi vuttaṃ. Rūpadhātuādīsupi eseva nayo. Yasmā pana rūpadhātupariyāpannānaṃ sattānaṃ ghānāyatanādīnaṃ abhāvena gandhāyatanādīni āyatanādikiccaṃ na karonti, tasmā rūpadhātuyā cha āyatanāni, nava dhātuyotiādi vuttaṃ . Yasmā ca okāsavasena vā sattuppattivasena vā apariyāpannadhātu nāma natthi, tasmā apariyāpannadhātuyāti avatvā yaṃ yaṃ apariyāpannaṃ taṃ tadeva dassetuṃ apariyāpanne kati khandhātiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Pariyāpannāpariyāpannavāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "999"
      },
      ". Tatiyavāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmadhātupariyāpannā"
      },
      "ti kāmadhātubhajanaṭṭhena pariyāpannā; taṃnissitā tadantogadhā kāmadhātutveva saṅkhaṃ gatāti attho. Sesapadesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyāpannā"
      },
      "ti bhavavasena okāsavasena ca paricchinnā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apariyāpannā"
      },
      "ti tathā aparicchinnā."
    ],
    "innerText": "999. Tatiyavāre kāmadhātupariyāpannāti kāmadhātubhajanaṭṭhena pariyāpannā; taṃnissitā tadantogadhā kāmadhātutveva saṅkhaṃ gatāti attho. Sesapadesupi eseva nayo. Pariyāpannāti bhavavasena okāsavasena ca paricchinnā. Apariyāpannāti tathā aparicchinnā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4. Dhammadassanavāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1007"
      },
      ". Catutthavāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekādasāyatanānī"
      },
      "ti saddāyatanavajjāni. Tañhi ekantena paṭisandhiyaṃ nuppajjati. Iminā nayena sabbattha attho veditabbo. Sattake ‘‘devānaṃ asurāna’’nti gativasena avatvā avisesena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gabbhaseyyakāna"
      },
      "nti vuttaṃ. Tasmā yattha yattha gabbhaseyyakā sambhavanti tattha tattha tesaṃ sattāyatanāni veditabbāni. Tathā dhātuyo. Sesamettha uttānatthameva. Pañcamavāre yaṃ vattabbaṃ taṃ dhammasaṅgahaṭṭhakathāyaṃ vuttameva."
    ],
    "innerText": "1007. Catutthavāre ekādasāyatanānīti saddāyatanavajjāni. Tañhi ekantena paṭisandhiyaṃ nuppajjati. Iminā nayena sabbattha attho veditabbo. Sattake ‘‘devānaṃ asurāna’’nti gativasena avatvā avisesena gabbhaseyyakānanti vuttaṃ. Tasmā yattha yattha gabbhaseyyakā sambhavanti tattha tattha tesaṃ sattāyatanāni veditabbāni. Tathā dhātuyo. Sesamettha uttānatthameva. Pañcamavāre yaṃ vattabbaṃ taṃ dhammasaṅgahaṭṭhakathāyaṃ vuttameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "6. Uppādakakammaāyuppamāṇavāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(1.) Uppādakakammaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1021"
      },
      ". Chaṭṭhavāre ",
      " pañcahi kāmaguṇehi nānappakārehi vā iddhivisesehi dibbantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "devā"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammutidevā"
      },
      "ti ‘devo, devī’ti evaṃ lokasammutiyā devā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upapattidevā"
      },
      "ti devaloke uppannattā upapattiyā devā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visuddhidevā"
      },
      "ti sabbesaṃ devānaṃ pūjārahā sabbakilesavisuddhiyā devā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājāno"
      },
      "ti muddhābhisittakhattiyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Deviyo"
      },
      "ti tesaṃ mahesiyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kumārā"
      },
      "ti abhisittarājūnaṃ abhisittadeviyā kucchismiṃ uppannakumārā."
    ],
    "innerText": "1021. Chaṭṭhavāre pañcahi kāmaguṇehi nānappakārehi vā iddhivisesehi dibbantīti devā. Sammutidevāti ‘devo, devī’ti evaṃ lokasammutiyā devā. Upapattidevāti devaloke uppannattā upapattiyā devā. Visuddhidevāti sabbesaṃ devānaṃ pūjārahā sabbakilesavisuddhiyā devā. Rājānoti muddhābhisittakhattiyā. Deviyoti tesaṃ mahesiyo. Kumārāti abhisittarājūnaṃ abhisittadeviyā kucchismiṃ uppannakumārā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uposathakammaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "katvā"
      },
      "ti cātuddasādīsu aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā. Idāni yasmā parittadānādipuññakammaṃ manussasobhagyatāya paccayo, mattaso kataṃ manussasobhagyatāya adhimattaṃ, adhimattabhāvepi nānappakārabhedato nānappakārassa khattiyamahāsālādibhāvassa paccayo, tasmā tassa vasena upapattibhedaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appekacce gahapatimahāsālāna"
      },
      "ntiādimāha. Tattha ",
      " mahāsāro etesanti mahāsārā; ra-kārassa pana la-kāraṃ katvā mahāsālāti vuttaṃ. Gahapatiyova mahāsālā, gahapatīsu vā mahāsālāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gahapatimahāsālā"
      },
      ". Sesesupi eseva nayo. Tattha yassa gehe pacchimantena cattālīsakoṭidhanaṃ nidhānagataṃ hoti, kahāpaṇānañca pañca ambaṇāni divasavaḷañjo nikkhamati – ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gahapatimahāsālo"
      },
      " nāma. Yassa pana gehe pacchimantena asītikoṭidhanaṃ nidhānagataṃ hoti, kahāpaṇānañca dasaambaṇāni divasavaḷañjo nikkhamati – ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brāhmaṇamahāsālo"
      },
      " nāma. Yassa pana gehe pacchimantena koṭisatadhanaṃ nidhānagataṃ hoti, kahāpaṇānañca vīsati ambaṇāni divasavaḷañjo nikkhamati – ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khattiyamahāsālo"
      },
      " nāma."
    ],
    "innerText": "Uposathakammaṃkatvāti cātuddasādīsu aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā. Idāni yasmā parittadānādipuññakammaṃ manussasobhagyatāya paccayo, mattaso kataṃ manussasobhagyatāya adhimattaṃ, adhimattabhāvepi nānappakārabhedato nānappakārassa khattiyamahāsālādibhāvassa paccayo, tasmā tassa vasena upapattibhedaṃ dassento appekacce gahapatimahāsālānantiādimāha. Tattha mahāsāro etesanti mahāsārā; ra-kārassa pana la-kāraṃ katvā mahāsālāti vuttaṃ. Gahapatiyova mahāsālā, gahapatīsu vā mahāsālāti gahapatimahāsālā. Sesesupi eseva nayo. Tattha yassa gehe pacchimantena cattālīsakoṭidhanaṃ nidhānagataṃ hoti, kahāpaṇānañca pañca ambaṇāni divasavaḷañjo nikkhamati – ayaṃ gahapatimahāsālo nāma. Yassa pana gehe pacchimantena asītikoṭidhanaṃ nidhānagataṃ hoti, kahāpaṇānañca dasaambaṇāni divasavaḷañjo nikkhamati – ayaṃ brāhmaṇamahāsālo nāma. Yassa pana gehe pacchimantena koṭisatadhanaṃ nidhānagataṃ hoti, kahāpaṇānañca vīsati ambaṇāni divasavaḷañjo nikkhamati – ayaṃ khattiyamahāsālo nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahabyata"
      },
      "nti sahabhāvaṃ; sabhāgā hutvā nibbattantīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cātumahārājikāna"
      },
      "ntiādīsu cātumahārājikā nāma sinerupabbatassa vemajjhe honti. Tesu pabbataṭṭhakāpi atthi, ākāsaṭṭhāpi; tesaṃ paramparā cakkavāḷapabbataṃ pattā. Khiḍḍāpadosikā, manopadosikā, sītavalāhakā, uṇhavalāhakā, candimā devaputto, sūriyo devaputtoti ete sabbepi cātumahārājikadevalokaṭṭhakā eva."
    ],
    "innerText": "Sahabyatanti sahabhāvaṃ; sabhāgā hutvā nibbattantīti attho. Cātumahārājikānantiādīsu cātumahārājikā nāma sinerupabbatassa vemajjhe honti. Tesu pabbataṭṭhakāpi atthi, ākāsaṭṭhāpi; tesaṃ paramparā cakkavāḷapabbataṃ pattā. Khiḍḍāpadosikā, manopadosikā, sītavalāhakā, uṇhavalāhakā, candimā devaputto, sūriyo devaputtoti ete sabbepi cātumahārājikadevalokaṭṭhakā eva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tettiṃsa ",
      " janā tattha upapannāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tāvatiṃsā"
      },
      ". Apica tāvatiṃsāti tesaṃ devānaṃ nāmamevāti vuttaṃ. Tepi atthi pabbataṭṭhakā, atthi ākāsaṭṭhakā. Tesaṃ paramparā cakkavāḷapabbataṃ pattā. Tathā yāmādīnaṃ. Ekadevalokepi hi devānaṃ paramparā cakkavāḷapabbataṃ appattā nāma natthi. Tattha dibbaṃ sukhaṃ yātā payātā sampattāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yāmā"
      },
      ". Tuṭṭhā pahaṭṭhāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tusitā"
      },
      ". Pakatipaṭiyattārammaṇato atirekena ramitukāmakāle yathārucite bhoge nimminitvā ramantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nimmānaratī"
      },
      ". Cittācāraṃ ñatvā parehi nimmitesu bhogesu vasaṃ vattentīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paranimmitavasavattī"
      },
      "."
    ],
    "innerText": "Tettiṃsa janā tattha upapannāti tāvatiṃsā. Apica tāvatiṃsāti tesaṃ devānaṃ nāmamevāti vuttaṃ. Tepi atthi pabbataṭṭhakā, atthi ākāsaṭṭhakā. Tesaṃ paramparā cakkavāḷapabbataṃ pattā. Tathā yāmādīnaṃ. Ekadevalokepi hi devānaṃ paramparā cakkavāḷapabbataṃ appattā nāma natthi. Tattha dibbaṃ sukhaṃ yātā payātā sampattāti yāmā. Tuṭṭhā pahaṭṭhāti tusitā. Pakatipaṭiyattārammaṇato atirekena ramitukāmakāle yathārucite bhoge nimminitvā ramantīti nimmānaratī. Cittācāraṃ ñatvā parehi nimmitesu bhogesu vasaṃ vattentīti paranimmitavasavattī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(2.) Āyuppamāṇaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1022"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vā bhiyyo"
      },
      "ti dutiyaṃ vassasataṃ appatvā vīsāya vā tiṃsāya vā cattālīsāya vā paññāsāya vā saṭṭhiyā vā vassehi adhikampi vassasatanti attho. Sabbampi hetaṃ dutiyaṃ vassasataṃ appattattā appanti vuttaṃ."
    ],
    "innerText": "1022.Appaṃvā bhiyyoti dutiyaṃ vassasataṃ appatvā vīsāya vā tiṃsāya vā cattālīsāya vā paññāsāya vā saṭṭhiyā vā vassehi adhikampi vassasatanti attho. Sabbampi hetaṃ dutiyaṃ vassasataṃ appattattā appanti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1024"
      },
      ". Brahmapārisajjādīsu mahābrahmānaṃ pārisajjā paricārikāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmapārisajjā"
      },
      ". Tesaṃ purohitabhāve ṭhitāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmapurohitā"
      },
      ". Vaṇṇavantatāya ",
      " ceva dīghāyukatāya ca mahanto brahmāti mahābrahmā, tesaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahābrahmānaṃ"
      },
      ". Ime tayopi janā paṭhamajjhānabhūmiyaṃ ekatale vasanti; āyuantaraṃ pana nesaṃ nānā."
    ],
    "innerText": "1024. Brahmapārisajjādīsu mahābrahmānaṃ pārisajjā paricārikāti brahmapārisajjā. Tesaṃ purohitabhāve ṭhitāti brahmapurohitā. Vaṇṇavantatāya ceva dīghāyukatāya ca mahanto brahmāti mahābrahmā, tesaṃ mahābrahmānaṃ. Ime tayopi janā paṭhamajjhānabhūmiyaṃ ekatale vasanti; āyuantaraṃ pana nesaṃ nānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1025"
      },
      ". Parittā ābhā etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parittābhā"
      },
      ". Appamāṇā ābhā etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appamāṇābhā"
      },
      ". Daṇḍadīpikāya acci viya etesaṃ sarīrato ābhā chijjitvā chijjitvā patantī viya sarati visaratīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ābhassarā"
      },
      ". Imepi tayo janā dutiyajjhānabhūmiyaṃ ekatale vasanti; āyuantaraṃ pana nesaṃ nānā."
    ],
    "innerText": "1025. Parittā ābhā etesanti parittābhā. Appamāṇā ābhā etesanti appamāṇābhā. Daṇḍadīpikāya acci viya etesaṃ sarīrato ābhā chijjitvā chijjitvā patantī viya sarati visaratīti ābhassarā. Imepi tayo janā dutiyajjhānabhūmiyaṃ ekatale vasanti; āyuantaraṃ pana nesaṃ nānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1026"
      },
      ". Parittā subhā etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parittasubhā"
      },
      ". Appamāṇā subhā etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appamāṇasubhā"
      },
      ". Subhena okiṇṇā vikiṇṇā, subhena sarīrappabhāvaṇṇena ekagghanā, suvaṇṇamañjusāya ṭhapitasampajjalitakañcanapiṇḍasassirīkāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "subhakiṇhā"
      },
      ". Imepi tayo janā tatiyajjhānabhūmiyaṃ ekatale vasanti; āyuantaraṃ pana nesaṃ nānā."
    ],
    "innerText": "1026. Parittā subhā etesanti parittasubhā. Appamāṇā subhā etesanti appamāṇasubhā. Subhena okiṇṇā vikiṇṇā, subhena sarīrappabhāvaṇṇena ekagghanā, suvaṇṇamañjusāya ṭhapitasampajjalitakañcanapiṇḍasassirīkāti subhakiṇhā. Imepi tayo janā tatiyajjhānabhūmiyaṃ ekatale vasanti; āyuantaraṃ pana nesaṃ nānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1027"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇanānattatā"
      },
      "ti ",
      " ārammaṇassa nānattabhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manasikāranānattatādīsu"
      },
      "pi eseva nayo. Ettha ekassa pathavīkasiṇaṃ ārammaṇaṃ hoti…pe… ekassa odātakasiṇanti idaṃ ārammaṇanānattaṃ. Eko pathavīkasiṇaṃ manasi karoti…pe… eko odātakasiṇanti idaṃ manasikāranānattaṃ. Ekassa pathavīkasiṇe chando hoti…pe… ekassa odātakasiṇeti idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chandanānattaṃ"
      },
      ". Eko pathavīkasiṇe patthanaṃ karoti…pe… eko odātakasiṇeti idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇidhinānattaṃ"
      },
      ". Eko pathavīkasiṇavasena adhimuccati…pe… eko odātakasiṇavasenāti idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhimokkhanānattaṃ"
      },
      ". Eko pathavīkasiṇavasena cittaṃ abhinīharati…pe… eko ",
      " odātakasiṇavasenāti idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhinīhāranānattaṃ"
      },
      ". Ekassa pathavīkasiṇaparicchindanakapaññā hoti…pe… ekassa odātakasiṇaparicchindanakapaññāti idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññānānattaṃ"
      },
      ". Tattha ārammaṇamanasikārā pubbabhāgena kathitā. Chandapaṇidhiadhimokkhābhinīhārā appanāyapi vattanti upacārepi. Paññā pana lokiyalokuttaramissakā kathitā."
    ],
    "innerText": "1027.Ārammaṇanānattatāti ārammaṇassa nānattabhāvo. Manasikāranānattatādīsupi eseva nayo. Ettha ekassa pathavīkasiṇaṃ ārammaṇaṃ hoti…pe… ekassa odātakasiṇanti idaṃ ārammaṇanānattaṃ. Eko pathavīkasiṇaṃ manasi karoti…pe… eko odātakasiṇanti idaṃ manasikāranānattaṃ. Ekassa pathavīkasiṇe chando hoti…pe… ekassa odātakasiṇeti idaṃ chandanānattaṃ. Eko pathavīkasiṇe patthanaṃ karoti…pe… eko odātakasiṇeti idaṃ paṇidhinānattaṃ. Eko pathavīkasiṇavasena adhimuccati…pe… eko odātakasiṇavasenāti idaṃ adhimokkhanānattaṃ. Eko pathavīkasiṇavasena cittaṃ abhinīharati…pe… eko odātakasiṇavasenāti idaṃ abhinīhāranānattaṃ. Ekassa pathavīkasiṇaparicchindanakapaññā hoti…pe… ekassa odātakasiṇaparicchindanakapaññāti idaṃ paññānānattaṃ. Tattha ārammaṇamanasikārā pubbabhāgena kathitā. Chandapaṇidhiadhimokkhābhinīhārā appanāyapi vattanti upacārepi. Paññā pana lokiyalokuttaramissakā kathitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaññasattāna"
      },
      "nti saññāvirahitānaṃ sattānaṃ. Ekacce hi titthāyatane pabbajitvā ‘cittaṃ nissāya rajjanadussanamuyhanāni nāma hontī’ti citte dosaṃ disvā ‘acittakabhāvo nāma sobhano, diṭṭhadhammanibbānameta’nti ",
      " saññāvirāgaṃ janetvā tatrūpagaṃ pañcamaṃ samāpattiṃ bhāvetvā tattha nibbattanti. Tesaṃ upapattikkhaṇe eko rūpakkhandhoyeva nibbattati. Ṭhatvā nibbatto ṭhitako eva hoti, nisīditvā nibbatto nisinnakova nipajjitvā nibbatto nipannova. Cittakammarūpakasadisā hutvā pañca kappasatāni tiṭṭhanti. Tesaṃ pariyosāne so rūpakāyo antaradhāyati, kāmāvacarasaññā uppajjati; tena idha saññuppādena te devā tamhā kāyā cutāti paññāyanti."
    ],
    "innerText": "Asaññasattānanti saññāvirahitānaṃ sattānaṃ. Ekacce hi titthāyatane pabbajitvā ‘cittaṃ nissāya rajjanadussanamuyhanāni nāma hontī’ti citte dosaṃ disvā ‘acittakabhāvo nāma sobhano, diṭṭhadhammanibbānameta’nti saññāvirāgaṃ janetvā tatrūpagaṃ pañcamaṃ samāpattiṃ bhāvetvā tattha nibbattanti. Tesaṃ upapattikkhaṇe eko rūpakkhandhoyeva nibbattati. Ṭhatvā nibbatto ṭhitako eva hoti, nisīditvā nibbatto nisinnakova nipajjitvā nibbatto nipannova. Cittakammarūpakasadisā hutvā pañca kappasatāni tiṭṭhanti. Tesaṃ pariyosāne so rūpakāyo antaradhāyati, kāmāvacarasaññā uppajjati; tena idha saññuppādena te devā tamhā kāyā cutāti paññāyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vipulā phalā etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vehapphalā"
      },
      ". Attano sampattiyā na hāyanti na vihāyantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avihā"
      },
      ". Na kañci sattaṃ tappantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atappā"
      },
      ". Sundarā dassanā abhirūpā pāsādikāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sudassā"
      },
      ". Suṭṭha passanti, sundarametesaṃ vā dassananti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sudassī"
      },
      ". Sabbehi eva guṇehi ca bhavasampattiyā ca jeṭṭhā, natthettha kaniṭṭhāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akaniṭṭhā"
      },
      "."
    ],
    "innerText": "Vipulā phalā etesanti vehapphalā. Attano sampattiyā na hāyanti na vihāyantīti avihā. Na kañci sattaṃ tappantīti atappā. Sundarā dassanā abhirūpā pāsādikāti sudassā. Suṭṭha passanti, sundarametesaṃ vā dassananti sudassī. Sabbehi eva guṇehi ca bhavasampattiyā ca jeṭṭhā, natthettha kaniṭṭhāti akaniṭṭhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1028"
      },
      ". Ākāsānañcāyatanaṃ upagatāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ākāsānañcāyatanūpagā"
      },
      ". Itaresupi eseva nayo ",
      ". Iti cha kāmāvacarā, nava brahmalokā, pañca suddhāvāsā, cattāro arūpā asaññasattavehapphalehi saddhiṃ chabbīsati devalokā; manussalokena saddhiṃ sattavīsati."
    ],
    "innerText": "1028. Ākāsānañcāyatanaṃ upagatāti ākāsānañcāyatanūpagā. Itaresupi eseva nayo . Iti cha kāmāvacarā, nava brahmalokā, pañca suddhāvāsā, cattāro arūpā asaññasattavehapphalehi saddhiṃ chabbīsati devalokā; manussalokena saddhiṃ sattavīsati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha sammāsambuddhena manussānaṃ devānañca āyuṃ paricchindamānena catūsu apāyesu bhummadevesu ca āyu paricchinnaṃ taṃ kasmāti? Niraye tāva kammameva pamāṇaṃ. Yāva kammaṃ na khīyati, na tāva cavanti. Tathā sesaapāyesu. Bhummadevānampi kammameva pamāṇaṃ. Tattha nibbattā hi keci ",
      " sattāhamattaṃ tiṭṭhanti, keci addhamāsaṃ, keci māsaṃ, kappaṃ tiṭṭhamānāpi atthiyeva."
    ],
    "innerText": "Tattha sammāsambuddhena manussānaṃ devānañca āyuṃ paricchindamānena catūsu apāyesu bhummadevesu ca āyu paricchinnaṃ taṃ kasmāti? Niraye tāva kammameva pamāṇaṃ. Yāva kammaṃ na khīyati, na tāva cavanti. Tathā sesaapāyesu. Bhummadevānampi kammameva pamāṇaṃ. Tattha nibbattā hi keci sattāhamattaṃ tiṭṭhanti, keci addhamāsaṃ, keci māsaṃ, kappaṃ tiṭṭhamānāpi atthiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha manussesu gihibhāve ṭhitāyeva sotāpannāpi honti, sakadāgāmiphalampi anāgāmiphalampi arahattaphalampi pāpuṇanti. Tesu sotāpannādayo yāvajīvaṃ tiṭṭhanti. Khīṇāsavā pana parinibbāyanti vā pabbajanti vā. Kasmā? Arahattaṃ nāma seṭṭhaguṇo, gihiliṅgaṃ hīnaṃ, taṃ hīnatāya uttamaṃ guṇaṃ dhāretuṃ na sakkoti. Tasmā te parinibbātukāmā vā pabbajitukāmā vā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhummadevā pana arahattaṃ patvāpi yāvajīvaṃ tiṭṭhanti. Chasu kāmāvacaradevesu sotāpannasakadāgāmino yāvajīvaṃ tiṭṭhanti; anāgāminā rūpabhavaṃ gantuṃ vaṭṭati, khīṇāsavena parinibbātuṃ. Kasmā ",
      "? Nilīyanokāsassa abhāvā. Rūpāvacarārūpāvacaresu sabbepi yāvajīvaṃ tiṭṭhanti. Tattha rūpāvacare nibbattā sotāpannasakadāgāmino na puna idhāgacchanti, tattheva parinibbāyanti. Ete hi jhānaanāgāmino nāma."
    ],
    "innerText": "Bhummadevā pana arahattaṃ patvāpi yāvajīvaṃ tiṭṭhanti. Chasu kāmāvacaradevesu sotāpannasakadāgāmino yāvajīvaṃ tiṭṭhanti; anāgāminā rūpabhavaṃ gantuṃ vaṭṭati, khīṇāsavena parinibbātuṃ. Kasmā ? Nilīyanokāsassa abhāvā. Rūpāvacarārūpāvacaresu sabbepi yāvajīvaṃ tiṭṭhanti. Tattha rūpāvacare nibbattā sotāpannasakadāgāmino na puna idhāgacchanti, tattheva parinibbāyanti. Ete hi jhānaanāgāmino nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aṭṭhasamāpattilābhīnaṃ pana kiṃ niyameti? Paguṇajjhānaṃ. Yadevassa paguṇaṃ hoti, tena uppajjati. Sabbesu pana paguṇesu kiṃ niyameti? Patthanā. Yattha upapattiṃ pattheti tattheva upapajjati. Patthanāya asati kiṃ niyameti? Maraṇasamaye samāpannā samāpatti. Maraṇasamaye samāpannā natthi, kiṃ niyameti? Nevasaññānāsaññāyatanasamāpatti. Ekaṃsena hi so nevasaññānāsaññāyatane upapajjati. Navasu brahmalokesu nibbattaariyasāvakānaṃ tatrūpapattipi hoti uparūpapattipi na heṭṭhūpapatti. Puthujjanānaṃ pana tatrūpapattipi hoti uparūpapattipi ",
      " heṭṭhūpapattipi. Pañcasu suddhāvāsesu catūsu ca arūpesu ariyasāvakānaṃ tatrūpapattipi hoti uparūpapattipi. Paṭhamajjhānabhūmiyaṃ nibbatto anāgāmī nava brahmaloke sodhetvā matthake ṭhito parinibbāti. Vehapphalā, akaniṭṭhā, nevasaññānāsaññāyatananti ime tayo devalokā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "seṭṭhabhavā"
      },
      " nāma. Imesu tīsu ṭhānesu nibbattaanāgāmino neva uddhaṃ gacchanti, na adho, tattha tattheva parinibbāyantīti. Idamettha pakiṇṇakaṃ."
    ],
    "innerText": "Aṭṭhasamāpattilābhīnaṃ pana kiṃ niyameti? Paguṇajjhānaṃ. Yadevassa paguṇaṃ hoti, tena uppajjati. Sabbesu pana paguṇesu kiṃ niyameti? Patthanā. Yattha upapattiṃ pattheti tattheva upapajjati. Patthanāya asati kiṃ niyameti? Maraṇasamaye samāpannā samāpatti. Maraṇasamaye samāpannā natthi, kiṃ niyameti? Nevasaññānāsaññāyatanasamāpatti. Ekaṃsena hi so nevasaññānāsaññāyatane upapajjati. Navasu brahmalokesu nibbattaariyasāvakānaṃ tatrūpapattipi hoti uparūpapattipi na heṭṭhūpapatti. Puthujjanānaṃ pana tatrūpapattipi hoti uparūpapattipi heṭṭhūpapattipi. Pañcasu suddhāvāsesu catūsu ca arūpesu ariyasāvakānaṃ tatrūpapattipi hoti uparūpapattipi. Paṭhamajjhānabhūmiyaṃ nibbatto anāgāmī nava brahmaloke sodhetvā matthake ṭhito parinibbāti. Vehapphalā, akaniṭṭhā, nevasaññānāsaññāyatananti ime tayo devalokā seṭṭhabhavā nāma. Imesu tīsu ṭhānesu nibbattaanāgāmino neva uddhaṃ gacchanti, na adho, tattha tattheva parinibbāyantīti. Idamettha pakiṇṇakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "7. Abhiññeyyādivāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1030"
      },
      ". Sattamavāre ",
      " salakkhaṇapariggāhikāya abhiññāya vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhiññeyyatā"
      },
      " veditabbā. Ñātatīraṇapahānapariññānaṃ vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariññeyyatā"
      },
      ". Sā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpakkhandho abhiññeyyo pariññeyyo na pahātabbo"
      },
      "tiādīsu ñātatīraṇapariññāvaseneva veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samudayasaccaṃ abhiññeyyaṃ pariññeyyaṃ pahātabba"
      },
      "ntiādīsu pahānapariññāvasena."
    ],
    "innerText": "1030. Sattamavāre salakkhaṇapariggāhikāya abhiññāya vasena abhiññeyyatā veditabbā. Ñātatīraṇapahānapariññānaṃ vasena pariññeyyatā. Sā ca rūpakkhandho abhiññeyyo pariññeyyo na pahātabbotiādīsu ñātatīraṇapariññāvaseneva veditabbā. Samudayasaccaṃ abhiññeyyaṃ pariññeyyaṃ pahātabbantiādīsu pahānapariññāvasena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Aṭṭhamavāre rūpādiārammaṇānaṃ cakkhuviññāṇādīnaṃ vasena sārammaṇānārammaṇatā veditabbā. Navamavāro uttānatthoyeva. Dasamavārepi yaṃ vattabbaṃ siyā taṃ sabbaṃ tattha tattha pañhāpucchakavāre vuttamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sammohavinodaniyā vibhaṅgaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhammahadayavibhaṅgavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Nigamanakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā ",
      " ca –"
    ],
    "innerText": "Ettāvatā ca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Abhidhammaṃ desento, dhammagaru dhammagāravayuttānaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Devānaṃ devapure, devagaṇasahassaparivāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Dutiyaṃ ",
      " adutiyapuriso, yaṃ āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhaṅgapakaraṇaṃ"
      },
      " nātho;"
    ],
    "innerText": "Dutiyaṃ adutiyapuriso, yaṃ āha vibhaṅgapakaraṇaṃ nātho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aṭṭhārasahi vibhaṅgehi, maṇḍitamaṇḍapeyyaguṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Atthappakāsanatthaṃ, tassāhaṃ yācito ṭhitaguṇena;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yatinā adandhagatinā, subuddhinā buddhaghosena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yaṃ ārabhiṃ racayituṃ, aṭṭhakathaṃ sunipuṇesu atthesu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sammohavinodanato, sammohavinodaniṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Porāṇaṭṭhakathānaṃ, sāraṃ ādāya sā ayaṃ niṭṭhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pattā anantarāyena, pāḷiyā bhāṇavārehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Cattālīsāya yathā, ekena ca evameva sabbepi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Niṭṭhaṃ vajantu vimalā, manorathā sabbasattānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Saddhammassa ṭhitatthaṃ, yañca imaṃ racayatā mayā puññaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pattaṃ tena samattaṃ, pāpuṇatu sadevako loko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Suciraṃ tiṭṭhatu dhammo, dhammābhirato sadā bhavatu loko;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Niccaṃ khemasubhikkhādi-sampadā janapadā hontūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paramavisuddhasaddhābuddhivīriyapaṭimaṇḍitena sīlācārajjavamaddavādiguṇasamudayasamuditena sakasamayasamayantaragahanajjhogāhaṇasamatthena paññāveyyattiyasamannāgatena tipiṭakapariyattippabhede sāṭṭhakathe satthusāsane appaṭihatañāṇappabhāvena mahāveyyākaraṇena ",
      " karaṇasampattijanitasukhaviniggatamadhurodāravacanalāvaṇṇayuttena yuttamuttavādinā vādīvarena mahākavinā pabhinnapaṭisambhidāparivāre chaḷabhiññāpaṭisambhidādippabhedaguṇapaṭimaṇḍite uttarimanussadhamme suppatiṭṭhitabuddhīnaṃ theravaṃsappadīpānaṃ therānaṃ ",
      " mahāvihāravāsīnaṃ vaṃsālaṅkārabhūtena vipulavisuddhabuddhinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddhaghoso"
      },
      "ti garūhi gahitanāmadheyyena therena katā ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammohavinodanī"
      },
      " nāma vibhaṅgaṭṭhakathā."
    ],
    "innerText": "Paramavisuddhasaddhābuddhivīriyapaṭimaṇḍitena sīlācārajjavamaddavādiguṇasamudayasamuditena sakasamayasamayantaragahanajjhogāhaṇasamatthena paññāveyyattiyasamannāgatena tipiṭakapariyattippabhede sāṭṭhakathe satthusāsane appaṭihatañāṇappabhāvena mahāveyyākaraṇena karaṇasampattijanitasukhaviniggatamadhurodāravacanalāvaṇṇayuttena yuttamuttavādinā vādīvarena mahākavinā pabhinnapaṭisambhidāparivāre chaḷabhiññāpaṭisambhidādippabhedaguṇapaṭimaṇḍite uttarimanussadhamme suppatiṭṭhitabuddhīnaṃ theravaṃsappadīpānaṃ therānaṃ mahāvihāravāsīnaṃ vaṃsālaṅkārabhūtena vipulavisuddhabuddhinā buddhaghosoti garūhi gahitanāmadheyyena therena katā ayaṃ sammohavinodanī nāma vibhaṅgaṭṭhakathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tāva tiṭṭhatu lokasmiṃ, lokanittharaṇesinaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dassentī kulaputtānaṃ, nayaṃ paññāvisuddhiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yāva buddhoti nāmampi, suddhacittassa tādino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Lokamhi lokajeṭṭhassa, pavattati mahesinoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sammohavinodanī nāma vibhaṅga-aṭṭhakathā niṭṭhitā."
  }
]