[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "12. Dvādasamanayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "12. Sampayuttenasaṅgahitāsaṅgahitapadaniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "417"
      },
      ". Vedanākkhandhena ",
      " ye dhammā… saññākkhandhena ye dhammā… saṅkhārakkhandhena ye dhammā sampayuttā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi saṅgahitā? Te dhammā tīhi khandhehi dvīhāyatanehi ",
      " aṭṭhahi dhātūhi saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi dasahāyatanehi dasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "417. Vedanākkhandhena ye dhammā… saññākkhandhena ye dhammā… saṅkhārakkhandhena ye dhammā sampayuttā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi saṅgahitā? Te dhammā tīhi khandhehi dvīhāyatanehi aṭṭhahi dhātūhi saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi dasahāyatanehi dasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "418"
      },
      ". Viññāṇakkhandhena ye dhammā… manāyatanena ye dhammā… cakkhuviññāṇadhātuyā ye dhammā…pe… manodhātuyā ye dhammā… manoviññāṇadhātuyā ye dhammā sampayuttā…pe… te dhammā tīhi khandhehi ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "418. Viññāṇakkhandhena ye dhammā… manāyatanena ye dhammā… cakkhuviññāṇadhātuyā ye dhammā…pe… manodhātuyā ye dhammā… manoviññāṇadhātuyā ye dhammā sampayuttā…pe… te dhammā tīhi khandhehi ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "419"
      },
      ". Samudayasaccena ye dhammā… maggasaccena ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "419. Samudayasaccena ye dhammā… maggasaccena ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "420"
      },
      ". Manindriyena ye dhammā sampayuttā… te dhammā tīhi khandhehi ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi ",
      " asaṅgahitā? Dvīhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "420. Manindriyena ye dhammā sampayuttā… te dhammā tīhi khandhehi ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "421"
      },
      ". Sukhindriyena ",
      " ye dhammā… dukkhindriyena ye dhammā… somanassindriyena ye dhammā… domanassindriyena ye dhammā sampayuttā…, te dhammā tīhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "421. Sukhindriyena ye dhammā… dukkhindriyena ye dhammā… somanassindriyena ye dhammā… domanassindriyena ye dhammā sampayuttā…, te dhammā tīhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "422"
      },
      ". Upekkhindriyena ye dhammā sampayuttā… te dhammā tīhi khandhehi ",
      " dvīhāyatanehi sattahi dhātūhi saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi dasahāyatanehi ekādasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "422. Upekkhindriyena ye dhammā sampayuttā… te dhammā tīhi khandhehi dvīhāyatanehi sattahi dhātūhi saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi dasahāyatanehi ekādasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "423"
      },
      ". Saddhindriyena ",
      " ye dhammā… vīriyindriyena ye dhammā… satindriyena ye dhammā… samādhindriyena ye dhammā… paññindriyena ye dhammā… anaññātaññassāmītindriyena ye dhammā… aññindriyena ye dhammā… aññātāvindriyena ye dhammā… avijjāya ye dhammā… avijjāpaccayā saṅkhārehi ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "423. Saddhindriyena ye dhammā… vīriyindriyena ye dhammā… satindriyena ye dhammā… samādhindriyena ye dhammā… paññindriyena ye dhammā… anaññātaññassāmītindriyena ye dhammā… aññindriyena ye dhammā… aññātāvindriyena ye dhammā… avijjāya ye dhammā… avijjāpaccayā saṅkhārehi ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "424"
      },
      ". Saṅkhārapaccayā viññāṇena ye dhammā sampayuttā… te dhammā tīhi khandhehi ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "424. Saṅkhārapaccayā viññāṇena ye dhammā sampayuttā… te dhammā tīhi khandhehi ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "425"
      },
      ". Saḷāyatanapaccayā ",
      " phassena ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi aṭṭhahi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi dasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "425. Saḷāyatanapaccayā phassena ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi aṭṭhahi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi dasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "426"
      },
      ". Phassapaccayā vedanāya ye dhammā sampayuttā… te dhammā tīhi khandhehi dvīhāyatanehi aṭṭhahi dhātūhi saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi dasahāyatanehi dasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "426. Phassapaccayā vedanāya ye dhammā sampayuttā… te dhammā tīhi khandhehi dvīhāyatanehi aṭṭhahi dhātūhi saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi dasahāyatanehi dasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "427"
      },
      ". Vedanāpaccayā taṇhāya ye dhammā… taṇhāpaccayā upādānena ",
      " ye dhammā… kammabhavena ",
      " ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "427. Vedanāpaccayā taṇhāya ye dhammā… taṇhāpaccayā upādānena ye dhammā… kammabhavena ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "428"
      },
      ". Sokena ye dhammā… dukkhena ye dhammā… domanassena ye dhammā sampayuttā… te dhammā tīhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "428. Sokena ye dhammā… dukkhena ye dhammā… domanassena ye dhammā sampayuttā… te dhammā tīhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "429"
      },
      ". Upāyāsena ye dhammā… satipaṭṭhānena ye dhammā… sammappadhānena ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi ",
      " saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "429. Upāyāsena ye dhammā… satipaṭṭhānena ye dhammā… sammappadhānena ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "430"
      },
      ". Iddhipādena ye dhammā sampayuttā… te dhammā tīhi ",
      " khandhehi ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "430. Iddhipādena ye dhammā sampayuttā… te dhammā tīhi khandhehi ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "431"
      },
      ". Jhānena ye dhammā sampayuttā… te dhammā tīhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "431. Jhānena ye dhammā sampayuttā… te dhammā tīhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "432"
      },
      ". Appamaññāya ye dhammā… pañcahi indriyehi ye dhammā… pañcahi balehi ye dhammā… sattahi bojjhaṅgehi ye dhammā… ariyena aṭṭhaṅgikena maggena ye dhammā sampayuttā… te ",
      " dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "432. Appamaññāya ye dhammā… pañcahi indriyehi ye dhammā… pañcahi balehi ye dhammā… sattahi bojjhaṅgehi ye dhammā… ariyena aṭṭhaṅgikena maggena ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "433"
      },
      ". Phassena ye dhammā… cetanāya ye dhammā… manasikārena ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi aṭṭhahi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi dasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "433. Phassena ye dhammā… cetanāya ye dhammā… manasikārena ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi aṭṭhahi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi dasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "434"
      },
      ". Vedanāya ye dhammā… saññāya ye dhammā sampayuttā… te dhammā tīhi khandhehi dvīhāyatanehi ",
      " aṭṭhahi dhātūhi saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi dasahāyatanehi dasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "434. Vedanāya ye dhammā… saññāya ye dhammā sampayuttā… te dhammā tīhi khandhehi dvīhāyatanehi aṭṭhahi dhātūhi saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi dasahāyatanehi dasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "435"
      },
      ". Cittena ye dhammā sampayuttā… te dhammā tīhi khandhehi ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi ",
      " asaṅgahitā? Dvīhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "435. Cittena ye dhammā sampayuttā… te dhammā tīhi khandhehi ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "436"
      },
      ". Adhimokkhena ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi tīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi pannarasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "436. Adhimokkhena ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi tīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi pannarasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "437"
      },
      ". Sukhāya ",
      " vedanāya sampayuttehi dhammehi ye dhammā… dukkhāya vedanāya sampayuttehi dhammehi ye dhammā… adukkhamasukhāya vedanāya sampayuttehi dhammehi ye dhammā… savitakkasavicārehi dhammehi ye dhammā… avitakkavicāramattehi dhammehi ye dhammā… pītisahagatehi dhammehi ",
      " ye dhammā… sukhasahagatehi dhammehi ye dhammā… upekkhāsahagatehi dhammehi ye dhammā sampayuttā… te dhammā ekena khandhena ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Catūhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "437. Sukhāya vedanāya sampayuttehi dhammehi ye dhammā… dukkhāya vedanāya sampayuttehi dhammehi ye dhammā… adukkhamasukhāya vedanāya sampayuttehi dhammehi ye dhammā… savitakkasavicārehi dhammehi ye dhammā… avitakkavicāramattehi dhammehi ye dhammā… pītisahagatehi dhammehi ye dhammā… sukhasahagatehi dhammehi ye dhammā… upekkhāsahagatehi dhammehi ye dhammā sampayuttā… te dhammā ekena khandhena ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Catūhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "438"
      },
      ". Hetūhi dhammehi ye dhammā… hetūhi ceva sahetukehi ca dhammehi ye dhammā… hetūhi ceva hetusampayuttehi ca dhammehi ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "438. Hetūhi dhammehi ye dhammā… hetūhi ceva sahetukehi ca dhammehi ye dhammā… hetūhi ceva hetusampayuttehi ca dhammehi ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "439"
      },
      ". Sahetukehi ceva na ca hetūhi dhammehi ye dhammā… hetusampayuttehi ceva na ca hetūhi dhammehi ye dhammā… na hetusahetukehi dhammehi ye dhammā sampayuttā… te dhammā ekena khandhena ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Catūhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "439. Sahetukehi ceva na ca hetūhi dhammehi ye dhammā… hetusampayuttehi ceva na ca hetūhi dhammehi ye dhammā… na hetusahetukehi dhammehi ye dhammā sampayuttā… te dhammā ekena khandhena ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Catūhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "440"
      },
      ". Āsavehi ",
      " dhammehi ye dhammā… āsavehi ceva sāsavehi ca dhammehi ye dhammā… āsavehi ceva āsavasampayuttehi ca dhammehi ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi ",
      " asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "440. Āsavehi dhammehi ye dhammā… āsavehi ceva sāsavehi ca dhammehi ye dhammā… āsavehi ceva āsavasampayuttehi ca dhammehi ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "441"
      },
      ". Āsavasampayuttehi ceva no ca āsavehi dhammehi ye dhammā ",
      " sampayuttā… te dhammā ekena khandhena ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Catūhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "441. Āsavasampayuttehi ceva no ca āsavehi dhammehi ye dhammā sampayuttā… te dhammā ekena khandhena ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Catūhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "442"
      },
      ". Saṃyojanehi dhammehi ye dhammā… ganthehi dhammehi ye dhammā… oghehi dhammehi ye dhammā… yogehi dhammehi ye dhammā… nīvaraṇehi dhammehi ",
      " ye dhammā… parāmāsehi dhammehi ye dhammā… parāmāsehi ceva parāmaṭṭhehi ca dhammehi ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "442. Saṃyojanehi dhammehi ye dhammā… ganthehi dhammehi ye dhammā… oghehi dhammehi ye dhammā… yogehi dhammehi ye dhammā… nīvaraṇehi dhammehi ye dhammā… parāmāsehi dhammehi ye dhammā… parāmāsehi ceva parāmaṭṭhehi ca dhammehi ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "443"
      },
      ". Parāmāsasampayuttehi dhammehi ye dhammā sampayuttā… te dhammā ekena khandhena ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Catūhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "443. Parāmāsasampayuttehi dhammehi ye dhammā sampayuttā… te dhammā ekena khandhena ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Catūhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "444"
      },
      ". Cittehi dhammehi ye dhammā sampayuttā… te dhammā tīhi khandhehi ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "444. Cittehi dhammehi ye dhammā sampayuttā… te dhammā tīhi khandhehi ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Dvīhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "445"
      },
      ". Cetasikehi dhammehi ye dhammā… cittasampayuttehi dhammehi ye dhammā… cittasaṃsaṭṭhehi dhammehi ye dhammā… cittasaṃsaṭṭhasamuṭṭhānehi dhammehi ye dhammā… cittasaṃsaṭṭhasamuṭṭhānasahabhūhi dhammehi ye ",
      " dhammā… cittasaṃsaṭṭhasamuṭṭhānānuparivattīhi ",
      " dhammehi ye dhammā sampayuttā… te dhammā ekena khandhena ekenāyatanena sattahi dhātūhi saṅgahitā. Katihi asaṅgahitā? Catūhi khandhehi ekādasahāyatanehi ekādasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "445. Cetasikehi dhammehi ye dhammā… cittasampayuttehi dhammehi ye dhammā… cittasaṃsaṭṭhehi dhammehi ye dhammā… cittasaṃsaṭṭhasamuṭṭhānehi dhammehi ye dhammā… cittasaṃsaṭṭhasamuṭṭhānasahabhūhi dhammehi ye dhammā… cittasaṃsaṭṭhasamuṭṭhānānuparivattīhi dhammehi ye dhammā sampayuttā… te dhammā ekena khandhena ekenāyatanena sattahi dhātūhi saṅgahitā. Katihi asaṅgahitā? Catūhi khandhehi ekādasahāyatanehi ekādasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "446"
      },
      ". Upādānehi ",
      " dhammehi ye dhammā… kilesehi dhammehi ye dhammā… kilesehi ceva saṃkilesikehi ca dhammehi ye dhammā… kilesehi ceva saṃkiliṭṭhehi ca dhammehi ye dhammā… kilesehi ceva kilesasampayuttehi ca dhammehi ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "446. Upādānehi dhammehi ye dhammā… kilesehi dhammehi ye dhammā… kilesehi ceva saṃkilesikehi ca dhammehi ye dhammā… kilesehi ceva saṃkiliṭṭhehi ca dhammehi ye dhammā… kilesehi ceva kilesasampayuttehi ca dhammehi ye dhammā sampayuttā… te dhammā catūhi khandhehi dvīhāyatanehi dvīhi dhātūhi saṅgahitā. Katihi asaṅgahitā? Ekena khandhena dasahāyatanehi soḷasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "447"
      },
      ". Saṃkiliṭṭhehi ceva no ca kilesehi dhammehi ye dhammā… kilesasampayuttehi ceva no ca kilesehi dhammehi ye dhammā… savitakkehi dhammehi ye dhammā… savicārehi dhammehi ye dhammā… sappītikehi dhammehi ye dhammā… pītisahagatehi dhammehi ye dhammā… sukhasahagatehi dhammehi ",
      " ye dhammā… upekkhāsahagatehi dhammehi ye dhammā sampayuttā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi saṅgahitā? Te dhammā ekena khandhena ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Catūhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
    ],
    "innerText": "447. Saṃkiliṭṭhehi ceva no ca kilesehi dhammehi ye dhammā… kilesasampayuttehi ceva no ca kilesehi dhammehi ye dhammā… savitakkehi dhammehi ye dhammā… savicārehi dhammehi ye dhammā… sappītikehi dhammehi ye dhammā… pītisahagatehi dhammehi ye dhammā… sukhasahagatehi dhammehi ye dhammā… upekkhāsahagatehi dhammehi ye dhammā sampayuttā, te dhammā katihi khandhehi katihāyatanehi katihi dhātūhi saṅgahitā? Te dhammā ekena khandhena ekenāyatanena ekāya dhātuyā saṅgahitā. Katihi asaṅgahitā? Catūhi khandhehi ekādasahāyatanehi sattarasahi dhātūhi asaṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Rūpakkhandhā cattāro, manāyatanameva ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Viññāṇadhātuyo satta, dve saccā cuddasindriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Paccaye dvādasa padā, tato upari soḷasa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tikesu aṭṭha gocchake, tecattālīsameva ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mahantaraduke satta, padā piṭṭhidukesu cha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Navamassa padassete, niddese saṅgahaṃ gatāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sampayuttenasaṅgahitāsaṅgahitapadaniddeso dvādasamo."
  }
]