[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "7. Ekaccaṃatthītikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Atītādiekaccakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "299"
      },
      ". Idāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekaccaṃ atthī"
      },
      "ti kathā hoti. Tattha ye ‘‘ekaccaṃ atītaṃ atthī’’ti maññanti, seyyathāpi kassapikā; tesaṃ laddhibhindanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atītaṃ atthī"
      },
      "ti pucchā sakavādissa, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekaccaṃ atthī"
      },
      "ti vissajjanaṃ paravādissa. Ayañhi adhippāyo – avipakkavipākaṃ atthi, vipakkavipākaṃ natthīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekaccaṃ niruddha"
      },
      "nti anuyogo sakavādissa. Tassattho – yadi te atītaṃ ekaccaṃ atthi ekaccaṃ natthi, evaṃ sante ekaccaṃ atītaṃ niruddhaṃ, ekaccaṃ atītaṃ aniruddhaṃ, tatheva ṭhitanti āpajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vigata"
      },
      "ntiādīsupi eseva nayo."
    ],
    "innerText": "299. Idāni ekaccaṃ atthīti kathā hoti. Tattha ye ‘‘ekaccaṃ atītaṃ atthī’’ti maññanti, seyyathāpi kassapikā; tesaṃ laddhibhindanatthaṃ atītaṃ atthīti pucchā sakavādissa, ekaccaṃ atthīti vissajjanaṃ paravādissa. Ayañhi adhippāyo – avipakkavipākaṃ atthi, vipakkavipākaṃ natthīti. Ekaccaṃ niruddhanti anuyogo sakavādissa. Tassattho – yadi te atītaṃ ekaccaṃ atthi ekaccaṃ natthi, evaṃ sante ekaccaṃ atītaṃ niruddhaṃ, ekaccaṃ atītaṃ aniruddhaṃ, tatheva ṭhitanti āpajjati. Vigatantiādīsupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avipakkavipākadhammā ekacce"
      },
      "ti idaṃ yasmā yesaṃ so avipakkavipākānaṃ atthitaṃ icchati, tepi atītāyeva. Tasmā yathā te atītaṃ ekaccaṃ atthi, kiṃ tathā avipakkavipākāpi dhammā ",
      " ekacce atthī ekacce natthīti codetuṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipakkavipākā"
      },
      "ti idaṃ yesaṃ so natthitaṃ icchati, tesaṃ vasena codetuṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avipākā"
      },
      "ti idaṃ abyākatānaṃ vasena codetuṃ vuttaṃ. Iti imesaṃ tiṇṇaṃ rāsīnaṃ vasena sabbesu anulomapaṭilomesu paṭiññā ca ",
      " paṭikkhepo ca veditabbā. Atītā ekadesaṃ vipakkavipākā, ekadesaṃ avipakkavipākāti vippakatavipākā vuccanti. Yena hi kammena paṭisandhi nibbattitā, bhavaṅgampi cutipi tasseva vipāko. Tasmā paṭisandhito yāva cuti, tāva taṃ vippakatavipākaṃ nāma hoti. Tathārūpe dhamme sandhāyetaṃ vuttaṃ."
    ],
    "innerText": "Avipakkavipākadhammā ekacceti idaṃ yasmā yesaṃ so avipakkavipākānaṃ atthitaṃ icchati, tepi atītāyeva. Tasmā yathā te atītaṃ ekaccaṃ atthi, kiṃ tathā avipakkavipākāpi dhammā ekacce atthī ekacce natthīti codetuṃ vuttaṃ. Vipakkavipākāti idaṃ yesaṃ so natthitaṃ icchati, tesaṃ vasena codetuṃ vuttaṃ. Avipākāti idaṃ abyākatānaṃ vasena codetuṃ vuttaṃ. Iti imesaṃ tiṇṇaṃ rāsīnaṃ vasena sabbesu anulomapaṭilomesu paṭiññā ca paṭikkhepo ca veditabbā. Atītā ekadesaṃ vipakkavipākā, ekadesaṃ avipakkavipākāti vippakatavipākā vuccanti. Yena hi kammena paṭisandhi nibbattitā, bhavaṅgampi cutipi tasseva vipāko. Tasmā paṭisandhito yāva cuti, tāva taṃ vippakatavipākaṃ nāma hoti. Tathārūpe dhamme sandhāyetaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipaccissantīti katvā te atthī"
      },
      "ti pucchā sakavādissa. Yathā dhammadharassa puggalassa niddāyantassāpi bahupavattino dhammā atthīti vuccanti, evaṃ lokavohāravasena atthitaṃ sandhāya paṭiññā paravādissa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipaccissantīti katvā paccupannā"
      },
      "ti dutiyapañhe ‘‘kammānaṃ avināsasaṅkhāto kammūpacayo nāmeko atthī’’ti laddhiyaṃ ṭhatvā paṭiññā paravādissa."
    ],
    "innerText": "Vipaccissantīti katvā te atthīti pucchā sakavādissa. Yathā dhammadharassa puggalassa niddāyantassāpi bahupavattino dhammā atthīti vuccanti, evaṃ lokavohāravasena atthitaṃ sandhāya paṭiññā paravādissa. Vipaccissantīti katvā paccupannāti dutiyapañhe ‘‘kammānaṃ avināsasaṅkhāto kammūpacayo nāmeko atthī’’ti laddhiyaṃ ṭhatvā paṭiññā paravādissa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Anāgatādiekaccakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "300"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāgataṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthī"
      },
      "tiādīsupi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekaccaṃ atthī"
      },
      "ti uppādino dhamme sandhāya vadati. Sesaṃ sabbattha heṭṭhā vuttanayattā uttānatthamevāti."
    ],
    "innerText": "300.Anāgataṃatthītiādīsupi ekaccaṃ atthīti uppādino dhamme sandhāya vadati. Sesaṃ sabbattha heṭṭhā vuttanayattā uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ekaccaṃatthītikathāvaṇṇanā."
  }
]