[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "4. Catuttho paricchedo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ekavidhādiniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "128-30"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijānanasabhāvato"
      },
      "ti ārammaṇavijānanasabhāvattā. Nanu ca heṭṭhā sārammaṇato ekavidhabhāvo vuttoti? Saccaṃ vutto, so pana cetasikānañca sādhāraṇoti idha tabbivajjanatthaṃ vijānanalakkhaṇatāva vuttā. Saṅkhepagaṇanavasena ca sahetukānaṃ ekasattatividhatā vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hetuvādinā"
      },
      "ti kusalākusalābyākatahetūnaṃ byākaraṇakusalena ",
      ". Atha vā ‘‘ye dhammā hetuppabhavā ",
      ", tesaṃ hetuṃ tathāgato āhā’’ti (apa. thera 1.1.286; mahāva. 60) vacanato taṃtaṃpaccayuppannadhammānaṃ taṃtaṃpaccayavādinā."
    ],
    "innerText": "128-30.Vijānanasabhāvatoti ārammaṇavijānanasabhāvattā. Nanu ca heṭṭhā sārammaṇato ekavidhabhāvo vuttoti? Saccaṃ vutto, so pana cetasikānañca sādhāraṇoti idha tabbivajjanatthaṃ vijānanalakkhaṇatāva vuttā. Saṅkhepagaṇanavasena ca sahetukānaṃ ekasattatividhatā vuttā. Hetuvādināti kusalākusalābyākatahetūnaṃ byākaraṇakusalena . Atha vā ‘‘ye dhammā hetuppabhavā , tesaṃ hetuṃ tathāgato āhā’’ti (apa. thera 1.1.286; mahāva. 60) vacanato taṃtaṃpaccayuppannadhammānaṃ taṃtaṃpaccayavādinā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "131-4"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Savatthukāvatthukato"
      },
      "ti ekantena sabbavatthunissitabhāvato ceva tadabhāvato ca. Keci pana hadayavatthuvasena savatthukāvatthukataṃ vaṇṇenti, taṃ na yujjati savatthukaniddese ‘‘sabbo kāmavipāko’’ti pasādanissitānampi saṅgahitattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubhayavasenā"
      },
      "ti savatthukāvatthukavasena. Kānici hi cittāni ekantena savatthukāni, kānici avatthukāneva, kānici ubhayasabhāvāni. Tathā ceva niddisati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sabbo kāmavipāko cā’’"
      },
      "tiādi."
    ],
    "innerText": "131-4.Savatthukāvatthukatoti ekantena sabbavatthunissitabhāvato ceva tadabhāvato ca. Keci pana hadayavatthuvasena savatthukāvatthukataṃ vaṇṇenti, taṃ na yujjati savatthukaniddese ‘‘sabbo kāmavipāko’’ti pasādanissitānampi saṅgahitattā. Ubhayavasenāti savatthukāvatthukavasena. Kānici hi cittāni ekantena savatthukāni, kānici avatthukāneva, kānici ubhayasabhāvāni. Tathā ceva niddisati ‘‘sabbo kāmavipāko cā’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbo kāmavipāko cā"
      },
      "ti sahetukāhetukabhinno sabbo tevīsatividho kāmāvacaravipāko ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādimaggo"
      },
      "ti sotāpattimaggo. So hi sabbalokuttaresu ādito uppajjanato, aṭṭhasu ariyapuggalesu ādipuggalassa sambandhīti vā ‘‘ādimaggo’’ti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinā vatthu"
      },
      "nti sakasakavatthuṃ vinā nuppajjanti. Teneva hetāni arūpabhave nuppajjanti tattha vatthūnaṃ abhāvato. ‘‘Nuppajjanti vinā vatthu’’nti ca idaṃ antobhāvitakāraṇatthaṃ katvā vuttaṃ. Tena yasmā vatthuṃ vinā nuppajjanti, tasmā ekantena savatthukāti vuttaṃ hoti."
    ],
    "innerText": "Sabbo kāmavipāko cāti sahetukāhetukabhinno sabbo tevīsatividho kāmāvacaravipāko ca. Ādimaggoti sotāpattimaggo. So hi sabbalokuttaresu ādito uppajjanato, aṭṭhasu ariyapuggalesu ādipuggalassa sambandhīti vā ‘‘ādimaggo’’ti vuccati. Vinā vatthunti sakasakavatthuṃ vinā nuppajjanti. Teneva hetāni arūpabhave nuppajjanti tattha vatthūnaṃ abhāvato. ‘‘Nuppajjanti vinā vatthu’’nti ca idaṃ antobhāvitakāraṇatthaṃ katvā vuttaṃ. Tena yasmā vatthuṃ vinā nuppajjanti, tasmā ekantena savatthukāti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekantena avatthukā"
      },
      " arūpabhaveyeva paṭisandhādivasena pavattanato. Kathaṃ pana rūpasannissayena vinā tattha arūpaṃ pavattati, kasmā na pavattati pañcavokāreti? Tathā adassanato. Yadi evaṃ kabaḷīkārāhārenapi vinā rūpadhātuyaṃ rūpena pavattitabbaṃ, kiṃ kāraṇā? Kāmadhātuyaṃ tathā adassanato. Api tu yassa cittasantānassa pavattikāraṇaṃ ",
      " rūpe avigatataṇhaṃ, tassa saha rūpena pavatti. Yassa pana nibbattikāraṇaṃ rūpe vigatataṇhaṃ, tassa vinā rūpena pavatti kāraṇassa taṃvimukhatāyāti rūpasannissayena vinā tattha arūpaṃ pavattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvecattālīsa sesānī"
      },
      "ti manodvārāvajjanaṃ kusalakiriyāvasena soḷasa kāmāvacarāni, tatheva aṭṭha arūpāvacarāni, paṭhamamaggavajjāni satta lokuttarāni, paṭighadvayavajjitadasaakusalāni ceti dvecattālīsa vuttāvasesacittāni."
    ],
    "innerText": "Ekantena avatthukā arūpabhaveyeva paṭisandhādivasena pavattanato. Kathaṃ pana rūpasannissayena vinā tattha arūpaṃ pavattati, kasmā na pavattati pañcavokāreti? Tathā adassanato. Yadi evaṃ kabaḷīkārāhārenapi vinā rūpadhātuyaṃ rūpena pavattitabbaṃ, kiṃ kāraṇā? Kāmadhātuyaṃ tathā adassanato. Api tu yassa cittasantānassa pavattikāraṇaṃ rūpe avigatataṇhaṃ, tassa saha rūpena pavatti. Yassa pana nibbattikāraṇaṃ rūpe vigatataṇhaṃ, tassa vinā rūpena pavatti kāraṇassa taṃvimukhatāyāti rūpasannissayena vinā tattha arūpaṃ pavattati. Dvecattālīsa sesānīti manodvārāvajjanaṃ kusalakiriyāvasena soḷasa kāmāvacarāni, tatheva aṭṭha arūpāvacarāni, paṭhamamaggavajjāni satta lokuttarāni, paṭighadvayavajjitadasaakusalāni ceti dvecattālīsa vuttāvasesacittāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "135-7"
      },
      ". Rūpādīsu ekekameva ārammaṇaṃ imassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekekārammaṇaṃ"
      },
      ". Tassa tassa ārammaṇassa āpāthagatakāle taṃtaṃvijānanavasena pañcapi ārammaṇāni imassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcārammaṇaṃ. Evampī"
      },
      "ti ",
      " na kevalaṃ savatthukādivaseneva, atha kho ekekārammaṇāditopi. Abhiññāvajjitānaṃ sabbamahaggatānampi dhammārammaṇabhāvena ekārammaṇattā āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sabbaṃ mahaggata’’"
      },
      "nti. Paṇṇattārammaṇato ekārammaṇanti keci. Taṃ arūpāvacaradutiyacatutthajjhānāni patvā na yujjati tesaṃ mahaggatārammaṇattā. Abhiññādvayassa chaḷārammaṇikabhāvena, tassa ca rūpāvacarapañcamajjhānato abhinnattā taṃ pahāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tecattālīsā’’"
      },
      "ti vuttaṃ."
    ],
    "innerText": "135-7. Rūpādīsu ekekameva ārammaṇaṃ imassāti ekekārammaṇaṃ. Tassa tassa ārammaṇassa āpāthagatakāle taṃtaṃvijānanavasena pañcapi ārammaṇāni imassāti pañcārammaṇaṃ. Evampīti na kevalaṃ savatthukādivaseneva, atha kho ekekārammaṇāditopi. Abhiññāvajjitānaṃ sabbamahaggatānampi dhammārammaṇabhāvena ekārammaṇattā āha ‘‘sabbaṃ mahaggata’’nti. Paṇṇattārammaṇato ekārammaṇanti keci. Taṃ arūpāvacaradutiyacatutthajjhānāni patvā na yujjati tesaṃ mahaggatārammaṇattā. Abhiññādvayassa chaḷārammaṇikabhāvena, tassa ca rūpāvacarapañcamajjhānato abhinnattā taṃ pahāya ‘‘tecattālīsā’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "141"
      },
      ". Puññavipākakiriyato kāme dvādasāti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhā"
      },
      "ti nipātamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puññavipākakriyato"
      },
      "ti ñāṇavippayuttakusalavipākakiriyato."
    ],
    "innerText": "141. Puññavipākakiriyato kāme dvādasāti sambandho. Dhāti nipātamattaṃ. Puññavipākakriyatoti ñāṇavippayuttakusalavipākakiriyato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "143-9"
      },
      ". Iriyāya kāyikāya kiriyāya pavattipathabhāvato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iriyāpatho,"
      },
      " gamanādi. Atthato tadavatthā rūpappavatti. Kāmañcettha rūpavinimutto iriyāpatho, viññatti vā natthi, tathāpi sabbaṃ rūpasamuṭṭhāpakacittaṃ iriyāpathupatthambhakaṃ, viññattivikāruppādanañca hoti. Yaṃ pana cittaṃ viññattijanakaṃ ",
      ", taṃ ekaṃsato itaradvayassa janakaṃ avinābhāvato, tathā iriyāpathupatthambhakaṃ rūpassāti imassa visesassa dassanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘rūpīriyāpathaviññatti-janakājanakādito’’"
      },
      "ti iriyāpathaviññattīnaṃ visuṃ gahaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Janakājanakādito"
      },
      "ti tiṇṇampi janakato, kassacipi ajanakato, dvinnaṃ ekassa ca janakato. Kānici hi cittāni rūpaṃ samuṭṭhāpenti, iriyāpathaṃ kappenti, viññattiṃ janayanti. Kānici rūpaṃ samuṭṭhāpenti, iriyāpathaṃ kappenti, viññattiṃ na janayanti. Kānici rūpameva samuṭṭhāpenti, itaradvayaṃ na karonti. Kānici tīṇi na karonteva. Tathā ceva dasseti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dvādasākusalā’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evañcāpi hi taṃ citta"
      },
      "nti na kevalaṃ ahetukāditova, evaṃ rūpādijanakāditopi taṃ catubbidhaṃ. ‘‘Evañcādimhi ta’’ntipi likhanti. Tassa pana ādimhi nikkhittaṃ cittaṃ evañca catubbidhanti atthaṃ vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti tesu rūpajanakādīsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dasa kiriyā"
      },
      "ti manodhātuvajjā dasa kiriyā."
    ],
    "innerText": "143-9. Iriyāya kāyikāya kiriyāya pavattipathabhāvato iriyāpatho, gamanādi. Atthato tadavatthā rūpappavatti. Kāmañcettha rūpavinimutto iriyāpatho, viññatti vā natthi, tathāpi sabbaṃ rūpasamuṭṭhāpakacittaṃ iriyāpathupatthambhakaṃ, viññattivikāruppādanañca hoti. Yaṃ pana cittaṃ viññattijanakaṃ , taṃ ekaṃsato itaradvayassa janakaṃ avinābhāvato, tathā iriyāpathupatthambhakaṃ rūpassāti imassa visesassa dassanatthaṃ ‘‘rūpīriyāpathaviññatti-janakājanakādito’’ti iriyāpathaviññattīnaṃ visuṃ gahaṇaṃ. Janakājanakāditoti tiṇṇampi janakato, kassacipi ajanakato, dvinnaṃ ekassa ca janakato. Kānici hi cittāni rūpaṃ samuṭṭhāpenti, iriyāpathaṃ kappenti, viññattiṃ janayanti. Kānici rūpaṃ samuṭṭhāpenti, iriyāpathaṃ kappenti, viññattiṃ na janayanti. Kānici rūpameva samuṭṭhāpenti, itaradvayaṃ na karonti. Kānici tīṇi na karonteva. Tathā ceva dasseti ‘‘dvādasākusalā’’tiādi. Evañcāpi hi taṃ cittanti na kevalaṃ ahetukāditova, evaṃ rūpādijanakāditopi taṃ catubbidhaṃ. ‘‘Evañcādimhi ta’’ntipi likhanti. Tassa pana ādimhi nikkhittaṃ cittaṃ evañca catubbidhanti atthaṃ vadanti. Tatthāti tesu rūpajanakādīsu. Dasa kiriyāti manodhātuvajjā dasa kiriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samuṭṭhāpenti rūpānī"
      },
      "ti attano uppādakkhaṇeyeva attanā janetabbarūpāni samuṭṭhāpenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappentī"
      },
      "ti sannāmenti. Yathāpavattaṃ iriyāpathaṃ upatthambhenti. Yathā hi antarantarā uppajjamānehi vīthicittehi abbokiṇṇe bhavaṅge pavattamāne aṅgāni osīdanti, pavedhantā viya honti, na evaṃ dvattiṃsavidhesu vakkhamānesu ca chabbīsatividhesu jāgaraṇacittesu pavattamānesu. Tadā pana aṅgāni ",
      " upatthaddhāni yathāpavattairiyāpathabhāveneva pavattanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Janayanti ca viññatti"
      },
      "nti manodvāre pavattā eva viññattiṃ janayanti, na pana pañcadvāre pavattāti daṭṭhabbaṃ."
    ],
    "innerText": "Samuṭṭhāpenti rūpānīti attano uppādakkhaṇeyeva attanā janetabbarūpāni samuṭṭhāpenti. Kappentīti sannāmenti. Yathāpavattaṃ iriyāpathaṃ upatthambhenti. Yathā hi antarantarā uppajjamānehi vīthicittehi abbokiṇṇe bhavaṅge pavattamāne aṅgāni osīdanti, pavedhantā viya honti, na evaṃ dvattiṃsavidhesu vakkhamānesu ca chabbīsatividhesu jāgaraṇacittesu pavattamānesu. Tadā pana aṅgāni upatthaddhāni yathāpavattairiyāpathabhāveneva pavattanti. Janayanti ca viññattinti manodvāre pavattā eva viññattiṃ janayanti, na pana pañcadvāre pavattāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dvipañcaviññāṇānaṃ jhānaṅgayogābhāvena rūpājanakattā āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dvepañcaviññāṇā’’"
      },
      "ti. Jhānaṅgāni hi cittena saha rūpasamuṭṭhāpakāni, tesaṃ anubalappadāyakāni maggaṅgādīni tesu ",
      " vijjamānesu savisesaṃ rūpappavattidassanato. Arūpavipākā pana rūpavirāgabhāvanāya nibbattattā hetuno taṃvimukhatāya rūpaṃ na samuṭṭhāpentīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vipākā ca arūpisū’’"
      },
      "ti."
    ],
    "innerText": "Dvipañcaviññāṇānaṃ jhānaṅgayogābhāvena rūpājanakattā āha ‘‘dvepañcaviññāṇā’’ti. Jhānaṅgāni hi cittena saha rūpasamuṭṭhāpakāni, tesaṃ anubalappadāyakāni maggaṅgādīni tesu vijjamānesu savisesaṃ rūpappavattidassanato. Arūpavipākā pana rūpavirāgabhāvanāya nibbattattā hetuno taṃvimukhatāya rūpaṃ na samuṭṭhāpentīti āha ‘‘vipākā ca arūpisū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "150"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbesaṃ sandhicitta"
      },
      "nti sabbesaṃ sattānaṃ paṭisandhicittaṃ. Tañhi vatthudubbalatāya, appatiṭṭhitatāya, paccayavekallato, āgantukatāya ca rūpaṃ na samuṭṭhāpeti. Tathā hi paṭisandhiviññāṇena sahajātaṃ vatthu pacchājātapaccayarahitaṃ, āhārādīhi ca anupatthaddhaṃ dubbalaṃ, tassa ca dubbalattā tannissitaviññāṇampi dubbalanti. Yathā ca papāte patito aññassa nissayo bhavituṃ na sakkoti, evaṃ tampi bhinnasantatiyaṃ kammakkhittatāya papāte patitaṃ viya appatiṭṭhitaṃ na rūpasamuṭṭhāpane ussahati ca vatthuno ca attanā saha apacchā apure uppajjamānattā purejātapaccayassa alābhato. Yathā pana āgantuko puriso agatapubbaṃ desaṃ gato aññesaṃ ‘‘etha bho antogāme vo annapānagandhamālādīni dassāmī’’ti vattuṃ na sakkoti attano avisayatāya, appahutāya ca, evamevaṃ paṭisandhicittampi āgantukanti. Evaṃ vatthudubbalatādīhi kāraṇehi rūpaṃ na samuṭṭhāpeti. Apica āhārindriyādivasena yehākārehi cittasamuṭṭhānarūpānaṃ cittacetasikā paccayā honti, tehi sabbehi paṭisandhiyaṃ cittacetasikā samatiṃsakammajarūpānaṃ yathāyogaṃ paccayā honti. Vuttañhetaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭṭhāne"
      },
      " –"
    ],
    "innerText": "150.Sabbesaṃ sandhicittanti sabbesaṃ sattānaṃ paṭisandhicittaṃ. Tañhi vatthudubbalatāya, appatiṭṭhitatāya, paccayavekallato, āgantukatāya ca rūpaṃ na samuṭṭhāpeti. Tathā hi paṭisandhiviññāṇena sahajātaṃ vatthu pacchājātapaccayarahitaṃ, āhārādīhi ca anupatthaddhaṃ dubbalaṃ, tassa ca dubbalattā tannissitaviññāṇampi dubbalanti. Yathā ca papāte patito aññassa nissayo bhavituṃ na sakkoti, evaṃ tampi bhinnasantatiyaṃ kammakkhittatāya papāte patitaṃ viya appatiṭṭhitaṃ na rūpasamuṭṭhāpane ussahati ca vatthuno ca attanā saha apacchā apure uppajjamānattā purejātapaccayassa alābhato. Yathā pana āgantuko puriso agatapubbaṃ desaṃ gato aññesaṃ ‘‘etha bho antogāme vo annapānagandhamālādīni dassāmī’’ti vattuṃ na sakkoti attano avisayatāya, appahutāya ca, evamevaṃ paṭisandhicittampi āgantukanti. Evaṃ vatthudubbalatādīhi kāraṇehi rūpaṃ na samuṭṭhāpeti. Apica āhārindriyādivasena yehākārehi cittasamuṭṭhānarūpānaṃ cittacetasikā paccayā honti, tehi sabbehi paṭisandhiyaṃ cittacetasikā samatiṃsakammajarūpānaṃ yathāyogaṃ paccayā honti. Vuttañhetaṃ paṭṭhāne –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Paṭisandhikkhaṇe vipākābyākatā āhārā sampayuttānaṃ khandhānaṃ kaṭattā ca rūpānaṃ āhārapaccayena paccayo’’tiādi (paṭṭhā. 1.1.429)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmā ",
      " samatiṃsakammajarūpāni cittasamuṭṭhānarūpānaṃ ṭhānaṃ gahetvā ṭhitānīti paṭisandhicittaṃ rūpaṃ na samuṭṭhāpetīti veditabbaṃ."
    ],
    "innerText": "Tasmā samatiṃsakammajarūpāni cittasamuṭṭhānarūpānaṃ ṭhānaṃ gahetvā ṭhitānīti paṭisandhicittaṃ rūpaṃ na samuṭṭhāpetīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cuticittañcārahato"
      },
      "ti ettha khīṇāsavassa cuticittaṃ upasantavaṭṭamūlasmiṃ santāne sātisayaṃ santavuttitāya ",
      " rūpaṃ na samuṭṭhāpeti, anāgāmiādīnaṃ tadabhāvatoti vadanti. Ṭīkākāro pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānandācariyo"
      },
      " bhaṇati –"
    ],
    "innerText": "Cuticittañcārahatoti ettha khīṇāsavassa cuticittaṃ upasantavaṭṭamūlasmiṃ santāne sātisayaṃ santavuttitāya rūpaṃ na samuṭṭhāpeti, anāgāmiādīnaṃ tadabhāvatoti vadanti. Ṭīkākāro pana ānandācariyo bhaṇati –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Kāmāvacarānaṃ pacchimacittassa uppādakkhaṇe yassa cittassa anantarā kāmāvacarānaṃ pacchimacittaṃ uppajjissati, rūpāvacare, arūpāvacare pacchimabhavikānaṃ, ye ca rūpāvacaraṃ, arūpāvacaraṃ upapajjitvā parinibbāyissanti, tesaṃ cavantānaṃ, tesaṃ vacīsaṅkhāro nirujjhissati, no ca tesaṃ kāyasaṅkhāro nirujjhissatīti vacanato aññesampi cuticittaṃ rūpaṃ na samuṭṭhāpetī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ācariyassa hi ayamadhippāyo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kāmāvacarānaṃ pacchimacittassā’’"
      },
      "ti etena avisesena kāmāvacarasattānaṃ cuticittassa, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ye ca rūpāvacaraṃ…pe… nirujjhissatī’’"
      },
      "ti iminā kāmabhavato cavitvā rūpārūpabhavūpapajjanakānaṃ kāmāvacaracuticittassāpi uppādakkhaṇato uddhaṃ vacīsaṅkhārassa nirodhaṃ vatvā kāyasaṅkhārassa tadabhāvavacanato cuticittassa kāyasaṅkhārāsamuṭṭhāpanaṃ siddhaṃ. Yadaggena ca taṃ kāyasaṅkhāraṃ na samuṭṭhāpeti, tadaggena taṃ sesarūpampi na janeti. Na hi rūpasamuṭṭhāpakassa gabbhagatatādivibandhābhāve kāyasaṅkhārāsamuṭṭhāpane kāraṇaṃ atthi. Na ca yuttaṃ cutito uddhaṃ cittasamuṭṭhānañcassa rūpaṃ pavattatīti, nāpi ‘‘cuticittaṃ rūpaṃ samuṭṭhāpetī’’ti pāḷi atthi, na cāpi vaṭṭamūlānupasamo cuticittassa rūpuppādane ",
      " kāraṇaṃ cuticittena na uppannānampi tato purimatarehi uppannānaṃ viya bhavantare anuppajjanato, tasmā sabbesampi cuticittaṃ rūpaṃ na samuṭṭhāpetīti. Yadi kāyasaṅkhārasamuṭṭhāpanameva rūpajananārahabhāvaṃ sādheti, tadā catutthajjhāne kathanti? Nāyaṃ doso, tassa bhāvanābalena sātisayaṃ santavuttitāya kāyasaṅkhārāsamuṭṭhāpanepi maraṇāsannacittānaṃ viya paridubbalattābhāvato rūpasamuṭṭhāpane vibandho natthīti. Kuto pana paṭṭhāya cittajarūpaṃ nuppajjatīti? Yato paṭṭhāya kāyasaṅkhāre nuppajjati. Kadā ca kāyasaṅkhāro nuppajjatīti? Cutito pubbe dvattiṃsamacittakkhaṇato paṭṭhāya nuppajjati, tettiṃsamacittakkhaṇe uppannaṃ pacchimasoḷasakato puretarameva nirujjhatīti vadanti. ‘‘Yassa kāyasaṅkhāro na nirujjhati, tassa cittasaṅkhāro na nirujjhissatī’’ti (yama. 2.saṅkhārayamaka.113) pañhe ‘‘pacchimacittassa bhaṅgakkhaṇe tesaṃ kāyasaṅkhāro ca na nirujjhati, cittasaṅkhāro ca na nirujjhissatī’’ti pacchimacittasseva vajjitattā cutito dutiyatatiyacittenāpi saha nirujjhatīti apare. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa cittassa anantarā kāmāvacarānaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pacchimacittaṃ uppajjatī"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yassā’’"
      },
      "ti kāmāvacaracuticittassa anantarapaccayabhūtaṃ cittaṃ sandhāya vuttanti tassa uppādatopi uddhaṃ kāyasaṅkhārābhāvavacanena heṭṭhimakoṭiyā cutito tatiyacitteneva saha nirujjhati. Dutiyacittaṃ na pāpuṇātīti eke."
    ],
    "innerText": "Ācariyassa hi ayamadhippāyo – ‘‘kāmāvacarānaṃ pacchimacittassā’’ti etena avisesena kāmāvacarasattānaṃ cuticittassa, ‘‘ye ca rūpāvacaraṃ…pe… nirujjhissatī’’ti iminā kāmabhavato cavitvā rūpārūpabhavūpapajjanakānaṃ kāmāvacaracuticittassāpi uppādakkhaṇato uddhaṃ vacīsaṅkhārassa nirodhaṃ vatvā kāyasaṅkhārassa tadabhāvavacanato cuticittassa kāyasaṅkhārāsamuṭṭhāpanaṃ siddhaṃ. Yadaggena ca taṃ kāyasaṅkhāraṃ na samuṭṭhāpeti, tadaggena taṃ sesarūpampi na janeti. Na hi rūpasamuṭṭhāpakassa gabbhagatatādivibandhābhāve kāyasaṅkhārāsamuṭṭhāpane kāraṇaṃ atthi. Na ca yuttaṃ cutito uddhaṃ cittasamuṭṭhānañcassa rūpaṃ pavattatīti, nāpi ‘‘cuticittaṃ rūpaṃ samuṭṭhāpetī’’ti pāḷi atthi, na cāpi vaṭṭamūlānupasamo cuticittassa rūpuppādane kāraṇaṃ cuticittena na uppannānampi tato purimatarehi uppannānaṃ viya bhavantare anuppajjanato, tasmā sabbesampi cuticittaṃ rūpaṃ na samuṭṭhāpetīti. Yadi kāyasaṅkhārasamuṭṭhāpanameva rūpajananārahabhāvaṃ sādheti, tadā catutthajjhāne kathanti? Nāyaṃ doso, tassa bhāvanābalena sātisayaṃ santavuttitāya kāyasaṅkhārāsamuṭṭhāpanepi maraṇāsannacittānaṃ viya paridubbalattābhāvato rūpasamuṭṭhāpane vibandho natthīti. Kuto pana paṭṭhāya cittajarūpaṃ nuppajjatīti? Yato paṭṭhāya kāyasaṅkhāre nuppajjati. Kadā ca kāyasaṅkhāro nuppajjatīti? Cutito pubbe dvattiṃsamacittakkhaṇato paṭṭhāya nuppajjati, tettiṃsamacittakkhaṇe uppannaṃ pacchimasoḷasakato puretarameva nirujjhatīti vadanti. ‘‘Yassa kāyasaṅkhāro na nirujjhati, tassa cittasaṅkhāro na nirujjhissatī’’ti (yama. 2.saṅkhārayamaka.113) pañhe ‘‘pacchimacittassa bhaṅgakkhaṇe tesaṃ kāyasaṅkhāro ca na nirujjhati, cittasaṅkhāro ca na nirujjhissatī’’ti pacchimacittasseva vajjitattā cutito dutiyatatiyacittenāpi saha nirujjhatīti apare. Yassa cittassa anantarā kāmāvacarānaṃpacchimacittaṃ uppajjatīti ettha ‘‘yassā’’ti kāmāvacaracuticittassa anantarapaccayabhūtaṃ cittaṃ sandhāya vuttanti tassa uppādatopi uddhaṃ kāyasaṅkhārābhāvavacanena heṭṭhimakoṭiyā cutito tatiyacitteneva saha nirujjhati. Dutiyacittaṃ na pāpuṇātīti eke."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "151-7"
      },
      ". Ekaṃ dve tīṇi cattāri ṭhānāni imassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekadviticatuṭṭhānaṃ,"
      },
      " ekadviticatuṭṭhānattāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhāna"
      },
      "nti ca idha kiccamadhippetaṃ. Tañhi tiṭṭhanti ettha dhammā avaṭṭhitā viya hontīti ‘‘ṭhāna’’nti vuccati. Maṃsacakkhudibbacakkhuñāṇacakkhubuddhacakkhusamantacakkhuvasena pañca nimmalāni locanāni imassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcanimmalalocano"
      },
      "."
    ],
    "innerText": "151-7. Ekaṃ dve tīṇi cattāri ṭhānāni imassāti ekadviticatuṭṭhānaṃ, ekadviticatuṭṭhānattāti attho. Ṭhānanti ca idha kiccamadhippetaṃ. Tañhi tiṭṭhanti ettha dhammā avaṭṭhitā viya hontīti ‘‘ṭhāna’’nti vuccati. Maṃsacakkhudibbacakkhuñāṇacakkhubuddhacakkhusamantacakkhuvasena pañca nimmalāni locanāni imassāti pañcanimmalalocano."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nippapañcenā"
      },
      "ti ",
      " rāgādipapañcarahitena. Rāgādayo hi saṃsāre papañcanato ‘‘papañcā’’ti vuccanti."
    ],
    "innerText": "Nippapañcenāti rāgādipapañcarahitena. Rāgādayo hi saṃsāre papañcanato ‘‘papañcā’’ti vuccanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Āvajjane paṭicchane ṭhāne manodhātuttikanti sambandho, kiriyāmanodhātu āvajjanaṭṭhāne, vipākadvayaṃ sampaṭicchanaṭṭhāneti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Somanassayuttasantīraṇaṃ pañcadvāre santīraṇaṃ siyā’’ti vattabbe ‘‘santīraṇa’’nti adhikāratova labbhatīti gāthābandhasukhatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘somanassayuta’’"
      },
      "nti ettakameva vuttaṃ."
    ],
    "innerText": "‘‘Somanassayuttasantīraṇaṃ pañcadvāre santīraṇaṃ siyā’’ti vattabbe ‘‘santīraṇa’’nti adhikāratova labbhatīti gāthābandhasukhatthaṃ ‘‘somanassayuta’’nti ettakameva vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Balavārammaṇe satī"
      },
      "ti tadārammaṇakiccassa balavārammaṇeyeva labbhanato vuttaṃ, na imasseva āveṇikabhāvena sabbesampi tadārammaṇānaṃ balavārammaṇeyeva uppajjanato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Voṭṭhabbana"
      },
      "nti kiriyāmanoviññāṇadhātusaṅkhātaṃ voṭṭhabbanakiccaṃ cittaṃ."
    ],
    "innerText": "Balavārammaṇe satīti tadārammaṇakiccassa balavārammaṇeyeva labbhanato vuttaṃ, na imasseva āveṇikabhāvena sabbesampi tadārammaṇānaṃ balavārammaṇeyeva uppajjanato. Voṭṭhabbananti kiriyāmanoviññāṇadhātusaṅkhātaṃ voṭṭhabbanakiccaṃ cittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "158-9"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbesa"
      },
      "nti sabbesaṃ kāmarūpārūpabhavikasattānaṃ. Iminā idaṃ dasseti – pañcadvāresu voṭṭhabbanakiccaṃ kesañcideva sattānaṃ arūpabhave sabbaso pañcadvārikacittappavattiyā, rūpabhave ca dvārattayappavattiyā abhāvato. Manodvāre āvajjanakiccaṃ pana sabbesameva sacittakasattānaṃ karotīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dviṭṭhānikaṃ nāma hotī"
      },
      "ti yathāvuttaṭṭhānadvayavantatāya dviṭṭhānikacittaṃ nāma hoti. Keci pana ‘‘somanassasahagatasantīraṇaṃ kāmasugatiyaṃ paṭisandhiṃ ākaḍḍhati ",
      ", tasmā taṃ pañcaṭṭhānika’’nti vadanti, taṃ tesaṃ matimattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭṭhāne"
      },
      " tathā adīpitattā. Tattha hi –"
    ],
    "innerText": "158-9.Sabbesanti sabbesaṃ kāmarūpārūpabhavikasattānaṃ. Iminā idaṃ dasseti – pañcadvāresu voṭṭhabbanakiccaṃ kesañcideva sattānaṃ arūpabhave sabbaso pañcadvārikacittappavattiyā, rūpabhave ca dvārattayappavattiyā abhāvato. Manodvāre āvajjanakiccaṃ pana sabbesameva sacittakasattānaṃ karotīti. Dviṭṭhānikaṃ nāma hotīti yathāvuttaṭṭhānadvayavantatāya dviṭṭhānikacittaṃ nāma hoti. Keci pana ‘‘somanassasahagatasantīraṇaṃ kāmasugatiyaṃ paṭisandhiṃ ākaḍḍhati , tasmā taṃ pañcaṭṭhānika’’nti vadanti, taṃ tesaṃ matimattaṃ paṭṭhāne tathā adīpitattā. Tattha hi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Upekkhāsahagataṃ dhammaṃ paṭicca upekkhāsahagato dhammo uppajjati nahetupaccayā’’ti ettha (paṭṭhā. 2.7.8) ‘‘ahetukaṃ upekkhāsahagataṃ ekaṃ khandhaṃ paṭicca tayo khandhā, tayo khandhe paṭicca eko khandho, dve khandhe paṭicca dve khandhā ",
      ", ahetukapaṭisandhikkhaṇe upekkhāsahagataṃ ekaṃ khandhaṃ paṭicca tayo khandhā, tayo khandhe paṭicca eko khandho, dve khandhe paṭicca dve khandhā’’ti (paṭṭhā. 2.7.8) –"
    ],
    "innerText": "‘‘Upekkhāsahagataṃ dhammaṃ paṭicca upekkhāsahagato dhammo uppajjati nahetupaccayā’’ti ettha (paṭṭhā. 2.7.8) ‘‘ahetukaṃ upekkhāsahagataṃ ekaṃ khandhaṃ paṭicca tayo khandhā, tayo khandhe paṭicca eko khandho, dve khandhe paṭicca dve khandhā , ahetukapaṭisandhikkhaṇe upekkhāsahagataṃ ekaṃ khandhaṃ paṭicca tayo khandhā, tayo khandhe paṭicca eko khandho, dve khandhe paṭicca dve khandhā’’ti (paṭṭhā. 2.7.8) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Evaṃ upekkhāsahagata-padassa pavattipaṭisandhivasena paṭiccanayo uddhaṭo. Pītisahagatasukhasahagata-padānaṃ pana –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Pītisahagataṃ dhammaṃ paṭicca pītisahagato dhammo uppajjati nahetupaccayā. Ahetukaṃ pītisahagataṃ ekaṃ khandhaṃ paṭicca tayo khandhā, tayo khandhe paṭicca eko khandho, dve khandhe paṭicca dve khandhā. Sukhasahagataṃ dhammaṃ paṭicca sukhasahagato dhammo uppajjati nahetupaccayā. Ahetukaṃ sukhasahagataṃ ekaṃ khandhaṃ paṭicca tayo khandhā, tayo khandhe paṭicca eko khandho, dve khandhe paṭicca dve khandhā’’ti (paṭṭhā. 2.7.6) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Evaṃ pavattivaseneva uddhaṭo, na ‘‘ahetukapaṭisandhikkhaṇe’’tiādinā paṭisandhivasena, tasmā yathādhammasāsane avacanampi abhāvameva dīpetīti na tassa paṭisandhidānaṃ atthīti dviṭṭhānikatāva vuttāti. Te mahaggatavipākā navāti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "162"
      },
      ". Chadvārā eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chadvārikā"
      },
      ". Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chadvārikesū"
      },
      "ti chadvārikacittesūti attho."
    ],
    "innerText": "162. Chadvārā eva chadvārikā. Atha vā chadvārikesūti chadvārikacittesūti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "164-6"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Pañcakicca’’"
      },
      "ntiādi yathāvuttānameva nigamanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sesa"
      },
      "nti aṭṭhasaṭṭhividhaṃ cittaṃ. Ekakiccayogato, ekaṃ kiccamassāti vā ekaṃ, ekameva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekakaṃ"
      },
      ". Sabbacittānaṃ kiccavasena niddesaṭṭhāneyeva kiccānaṃ paṭipāṭimpi dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bhavaṅgāvajjana’’"
      },
      "ntiādi vuttaṃ. Yadi evaṃ paṭisandhito paṭṭhāya cutipariyosānaṃ vattabbanti? Saccaṃ, cutipaṭisandhīnaṃ pana pākaṭattā ",
      " tathā ",
      " na vuttaṃ. Bhavassa hi paṭisandhi ādi, cuti pariyosānanti pākaṭameva, tasmā pākaṭaṭṭhānaṃ pahāya apākaṭaṭṭhānato paṭṭhāya dassetuṃ bhavaṅgameva ādito vuttaṃ. Tadārammaṇaṃ pana kiñcāpi apākaṭaṃ, atha kho anekantikaṃ kismiñci bhave katthaci javanavīthiyaṃ alabbhanatoti ekantalabbhamānaparidīpanatthaṃ taṃ na vuttaṃ. Atha vā tadārammaṇacittampi yebhuyyena bhavaṅganāmaṃ labbhatīti purimajavanavīthiyaṃ tadārammaṇaṃ pacchimajavanavīthiyā āvajjanassa purecarabhūtaṃ bhavaṅga-ggahaṇeneva saṅgahitanti visuṃ na vuttaṃ. Keci pana ‘‘pañcadvāresu pavattivasena pañcavidhatāya dassanatthaṃ ‘bhavaṅgāvajjana’ntiādi vutta’’nti vadanti, tattha pana appavattamānānaṃ kesañci sabbhāvato taṃ na yujjati, chadvārappavattivasena chabbidhattanayadassanatthanti vattuṃ vaṭṭati. Yathā cettha ‘‘bhavaṅgāvajjana’’ntiādinā cakkhudvāre vuttaṃ, evaṃ sotadvārādīsupi dassanādiṃ apanetvā savanādiṃ pakkhipitvā kiccappavatti yojetabbā. Manodvāre pana –"
    ],
    "innerText": "164-6.‘‘Pañcakicca’’ntiādi yathāvuttānameva nigamanaṃ. Sesanti aṭṭhasaṭṭhividhaṃ cittaṃ. Ekakiccayogato, ekaṃ kiccamassāti vā ekaṃ, ekameva ekakaṃ. Sabbacittānaṃ kiccavasena niddesaṭṭhāneyeva kiccānaṃ paṭipāṭimpi dassetuṃ ‘‘bhavaṅgāvajjana’’ntiādi vuttaṃ. Yadi evaṃ paṭisandhito paṭṭhāya cutipariyosānaṃ vattabbanti? Saccaṃ, cutipaṭisandhīnaṃ pana pākaṭattā tathā na vuttaṃ. Bhavassa hi paṭisandhi ādi, cuti pariyosānanti pākaṭameva, tasmā pākaṭaṭṭhānaṃ pahāya apākaṭaṭṭhānato paṭṭhāya dassetuṃ bhavaṅgameva ādito vuttaṃ. Tadārammaṇaṃ pana kiñcāpi apākaṭaṃ, atha kho anekantikaṃ kismiñci bhave katthaci javanavīthiyaṃ alabbhanatoti ekantalabbhamānaparidīpanatthaṃ taṃ na vuttaṃ. Atha vā tadārammaṇacittampi yebhuyyena bhavaṅganāmaṃ labbhatīti purimajavanavīthiyaṃ tadārammaṇaṃ pacchimajavanavīthiyā āvajjanassa purecarabhūtaṃ bhavaṅga-ggahaṇeneva saṅgahitanti visuṃ na vuttaṃ. Keci pana ‘‘pañcadvāresu pavattivasena pañcavidhatāya dassanatthaṃ ‘bhavaṅgāvajjana’ntiādi vutta’’nti vadanti, tattha pana appavattamānānaṃ kesañci sabbhāvato taṃ na yujjati, chadvārappavattivasena chabbidhattanayadassanatthanti vattuṃ vaṭṭati. Yathā cettha ‘‘bhavaṅgāvajjana’’ntiādinā cakkhudvāre vuttaṃ, evaṃ sotadvārādīsupi dassanādiṃ apanetvā savanādiṃ pakkhipitvā kiccappavatti yojetabbā. Manodvāre pana –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Bhavaṅgaṃ paṭhamaṃ hoti, tato āvajjanaṃ mataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dutiyaṃ tamatikkamma, javanaṃ tatiyaṃ siyā’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Yojanā daṭṭhabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Channaṃ viññāṇāna"
      },
      "nti cakkhuviññāṇādīnaṃ pañcannaṃ, manoviññāṇassa ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattaviññāṇadhātūna"
      },
      "nti cakkhuviññāṇadhātādīnaṃ pañcannaṃ, manodhātumanoviññāṇadhātudvayassāti sattannaṃ viññāṇadhātūnaṃ."
    ],
    "innerText": "Yojanā daṭṭhabbā. Channaṃ viññāṇānanti cakkhuviññāṇādīnaṃ pañcannaṃ, manoviññāṇassa ca. Sattaviññāṇadhātūnanti cakkhuviññāṇadhātādīnaṃ pañcannaṃ, manodhātumanoviññāṇadhātudvayassāti sattannaṃ viññāṇadhātūnaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "169-71"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcābhiññāvivajjita"
      },
      "nti –"
    ],
    "innerText": "169-71.Pañcābhiññāvivajjitanti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Iddhividhaṃ dibbasoto, paracittavijānanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pubbenivāsānussati, dibbacakkhūti pañcadhā’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evamāgatāhi pañcahi abhiññāhi yuttena rūpāvacarapañcamajjhānacittena vajjitaṃ. Dibbasotādīnaṃ ekekārammaṇattepi pañcannampi abhiññānaṃ ekasseva cittassa avatthābhedabhāvato vuttaṃ ‘‘pañcābhiññāvivajjita’’nti ",
      ". Keci pana ‘‘idha ekantena dhammārammaṇikacittānameva vacanato ",
      " paracittavijānanaṃ vajjetvā anāgataṃsañāṇena saha pañcābhiññānaṃ paṭikkhepo’’ti vadanti."
    ],
    "innerText": "Evamāgatāhi pañcahi abhiññāhi yuttena rūpāvacarapañcamajjhānacittena vajjitaṃ. Dibbasotādīnaṃ ekekārammaṇattepi pañcannampi abhiññānaṃ ekasseva cittassa avatthābhedabhāvato vuttaṃ ‘‘pañcābhiññāvivajjita’’nti . Keci pana ‘‘idha ekantena dhammārammaṇikacittānameva vacanato paracittavijānanaṃ vajjetvā anāgataṃsañāṇena saha pañcābhiññānaṃ paṭikkhepo’’ti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dvipañcaviññāṇānaṃ, manodhātuttayassa ca pariccāgena ekacattālīsa hontīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cattālīsaṃ tathekaka’’"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhiññāni cā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca"
      },
      "-saddo aṭṭhānappayutto, so ‘‘cattālīsaṃ tathekaka’’nti imassānantaraṃ daṭṭhabbo, tena pana abhiññācittadvayaṃ saṅgaṇhāti. Atha vā abhiññā nāma heṭṭhā ekekārammaṇikesu vuttassa pañcamajjhānasseva avatthāvisesoti abhiññācittānaṃ chaḷārammaṇikesu aggahaṇanti daṭṭhabbaṃ."
    ],
    "innerText": "Dvipañcaviññāṇānaṃ, manodhātuttayassa ca pariccāgena ekacattālīsa hontīti āha ‘‘cattālīsaṃ tathekaka’’nti. Abhiññāni cāti ca-saddo aṭṭhānappayutto, so ‘‘cattālīsaṃ tathekaka’’nti imassānantaraṃ daṭṭhabbo, tena pana abhiññācittadvayaṃ saṅgaṇhāti. Atha vā abhiññā nāma heṭṭhā ekekārammaṇikesu vuttassa pañcamajjhānasseva avatthāvisesoti abhiññācittānaṃ chaḷārammaṇikesu aggahaṇanti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "172-3"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tidhā katvā"
      },
      "ti tidhā karaṇahetu. Hetvattho hi ayaṃ tvā-saddo yathā ‘‘sīhaṃ disvā bhayaṃ chambhitattaṃ uppajjati, paññāya cassa disvā āsavā parikkhīṇā hontī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Puññāpuññavasenā’’"
      },
      "tiādinā jātibhūmihetuvedanādivasena yāva chasattatividho bhedo, tāva manoviññāṇadhātuṃ bhinditvā taṃvasena cittavibhāgadassanatthaṃ nayadānaṃ katanti veditabbaṃ."
    ],
    "innerText": "172-3.Tidhā katvāti tidhā karaṇahetu. Hetvattho hi ayaṃ tvā-saddo yathā ‘‘sīhaṃ disvā bhayaṃ chambhitattaṃ uppajjati, paññāya cassa disvā āsavā parikkhīṇā hontī’’ti. ‘‘Puññāpuññavasenā’’tiādinā jātibhūmihetuvedanādivasena yāva chasattatividho bhedo, tāva manoviññāṇadhātuṃ bhinditvā taṃvasena cittavibhāgadassanatthaṃ nayadānaṃ katanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "175"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tidhā katvā"
      },
      "ti paṭhamaṃ vipākadvayakiriyābhedato, dutiyaṃ kusalākusalāditoti evaṃ dhātudvayaṃ paccekaṃ tidhā katvā."
    ],
    "innerText": "175.Tidhā katvāti paṭhamaṃ vipākadvayakiriyābhedato, dutiyaṃ kusalākusalāditoti evaṃ dhātudvayaṃ paccekaṃ tidhā katvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "180"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūmi…pe… vibhāvaye"
      },
      "ti tiṃsabhūmīnaṃ nānattavasena pavattito tiṃsavidhaṃ, tattheva tiṃsapuggalānaṃ nānattavasena pavattito ca tiṃsavidhantiādinā idaṃ yathāniddiṭṭhacittaṃ bahudhā hotīti ca vibhāveyyāti attho."
    ],
    "innerText": "180.Bhūmi…pe… vibhāvayeti tiṃsabhūmīnaṃ nānattavasena pavattito tiṃsavidhaṃ, tattheva tiṃsapuggalānaṃ nānattavasena pavattito ca tiṃsavidhantiādinā idaṃ yathāniddiṭṭhacittaṃ bahudhā hotīti ca vibhāveyyāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "181"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti ",
      " imasmiṃ sāsane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hatthagatāmalakā viya hontī"
      },
      "ti yathā hatthagataṃ āmalakaṃ cakkhumato supākaṭaṃ hoti, evamimassa matimato bhikkhuno abhidhammapiṭakagatā atthā supākaṭā honti, āvajjitāvajjitakkhaṇe suvisadāva paññāyantīti attho."
    ],
    "innerText": "181.Idhāti imasmiṃ sāsane. Hatthagatāmalakā viya hontīti yathā hatthagataṃ āmalakaṃ cakkhumato supākaṭaṃ hoti, evamimassa matimato bhikkhuno abhidhammapiṭakagatā atthā supākaṭā honti, āvajjitāvajjitakkhaṇe suvisadāva paññāyantīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti abhidhammatthavikāsiniyā nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhidhammāvatārasaṃvaṇṇanāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ekavidhādiniddesavaṇṇanā niṭṭhitā."
  }
]