[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "5. Pañcamo paricchedo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Bhūmipuggalacittuppattiniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "182-8"
      },
      ". Buddhiyā ",
      " vuddhiṃ viruḷhiṃ karotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddhivuddhikaraṃ"
      },
      ". Yassa yassa nayassa kathanaṃ paṭiññātaṃ, taṃ taṃ dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cittānaṃ bhūmīsuppatti’’"
      },
      "nti. Taṃ vatvā bhūmīnaṃ ādhāravasena pasaṅgāgataṃ gatibhedaṃ, bhavabhedañca dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘devā cevā’’"
      },
      "tiādi vuttaṃ. ‘‘Catassopāyabhūmiyo’’ti vatvā asuragatiyā petagatiyaṃyeva saṅgahitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘gatiyo pañcā’’"
      },
      "ti vuttanti vadanti. Mayaṃ pana ‘‘tissovāpāyabhūmiyo’’ti pāṭhena bhavitabbanti maññāma. Na hi esa anākulavacano ācariyo īdisaṃ pubbāparaviruddhaṃ viya sammohajanakaṃ vacanaṃ bhāsati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāḷiyampi"
      },
      " hi –"
    ],
    "innerText": "182-8. Buddhiyā vuddhiṃ viruḷhiṃ karotīti buddhivuddhikaraṃ. Yassa yassa nayassa kathanaṃ paṭiññātaṃ, taṃ taṃ dassento āha ‘‘cittānaṃ bhūmīsuppatti’’nti. Taṃ vatvā bhūmīnaṃ ādhāravasena pasaṅgāgataṃ gatibhedaṃ, bhavabhedañca dassetuṃ ‘‘devā cevā’’tiādi vuttaṃ. ‘‘Catassopāyabhūmiyo’’ti vatvā asuragatiyā petagatiyaṃyeva saṅgahitattā ‘‘gatiyo pañcā’’ti vuttanti vadanti. Mayaṃ pana ‘‘tissovāpāyabhūmiyo’’ti pāṭhena bhavitabbanti maññāma. Na hi esa anākulavacano ācariyo īdisaṃ pubbāparaviruddhaṃ viya sammohajanakaṃ vacanaṃ bhāsati. Pāḷiyampi hi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Pañca kho imā, sāriputta, gatiyo. Katamā pañca? Nirayo tiracchānayoni pettivisayo manussā devā’’ti (a. ni. 9.68) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ ",
      " tiṇṇameva apāyānaṃ vasena vuttaṃ. Kāmarūpārūpavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tayo bhavā. Tatthā"
      },
      "ti tesu tīsu bhavesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiṃsevā"
      },
      "ti catasso apāyabhūmiyo, sattavidhā kāmasugatibhūmi, soḷasa rūpībrahmalokā, catasso arūpabhūmiyoti ekatiṃsabhūmīnamantare cittappavattiadhikārattā asaññabhūmiṃ apanetvā avasesā tiṃseva bhūmiyoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāsu tiṃseva puggalā"
      },
      "ti tāsu bhūmīsu uppannā puggalā bhūmigaṇanavasena tiṃseva honti. Bhūmivasena tiṃsavidhāpi pana paṭisandhicittagaṇanāya ekūnavīsati hontīti dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bhūmīsvetāsū’’"
      },
      "tiādi."
    ],
    "innerText": "Evaṃ tiṇṇameva apāyānaṃ vasena vuttaṃ. Kāmarūpārūpavasena tayo bhavā. Tatthāti tesu tīsu bhavesu. Tiṃsevāti catasso apāyabhūmiyo, sattavidhā kāmasugatibhūmi, soḷasa rūpībrahmalokā, catasso arūpabhūmiyoti ekatiṃsabhūmīnamantare cittappavattiadhikārattā asaññabhūmiṃ apanetvā avasesā tiṃseva bhūmiyoti attho. Tāsu tiṃseva puggalāti tāsu bhūmīsu uppannā puggalā bhūmigaṇanavasena tiṃseva honti. Bhūmivasena tiṃsavidhāpi pana paṭisandhicittagaṇanāya ekūnavīsati hontīti dassento āha ‘‘bhūmīsvetāsū’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisandhikacittāna"
      },
      "nti dasa kāmāvacarapaṭisandhicittāni, pañca rūpāvacarapaṭisandhicittāni, cattāri arūpāvacarapaṭisandhicittānīti imesaṃ ekūnavīsatipaṭisandhicittānaṃ vasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaññīnamacittakā"
      },
      "ti asaññasattānaṃ acittakā paṭisandhi. Vuttañhetaṃ –"
    ],
    "innerText": "Paṭisandhikacittānanti dasa kāmāvacarapaṭisandhicittāni, pañca rūpāvacarapaṭisandhicittāni, cattāri arūpāvacarapaṭisandhicittānīti imesaṃ ekūnavīsatipaṭisandhicittānaṃ vasena. Asaññīnamacittakāti asaññasattānaṃ acittakā paṭisandhi. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Asaññasattā ",
      " devā ahetukā anāhārakā aphassakā avedanakā asaññakā acetanakā acittakā pātubhavantī’’ti."
    ],
    "innerText": "‘‘Asaññasattā devā ahetukā anāhārakā aphassakā avedanakā asaññakā acetanakā acittakā pātubhavantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadi paṭisandhivasena vīsati puggalā, kathaṃ bhūmivasena tiṃsāti vuttā. Ekatiṃsāti hi vattabbanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘idhā’’"
      },
      "tiādi."
    ],
    "innerText": "Yadi paṭisandhivasena vīsati puggalā, kathaṃ bhūmivasena tiṃsāti vuttā. Ekatiṃsāti hi vattabbanti āha ‘‘idhā’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na vijjati hetu imesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ahetū,"
      },
      " duve, tīṇi ca hetū imesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvitihetū,"
      },
      " paṭisandhivasena ahetukā, duhetukā, tihetukā cāti attho. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ahetukā"
      },
      " āpāyikā ca, ekacce bhūmadevā, manussesu jaccandhajaccabadhirajaccummattakanapuṃsakaubhatobyañjanakādayo ca. Vuttāvasesā kāmasugativāsinova ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "duhetukā. Tihetukā"
      },
      " pana kāmasugativāsinova. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ariyā pana aṭṭhā"
      },
      "ti catunnaṃ ariyamaggasamaṅgīnaṃ, catunnañca ariyaphalasamaṅgīnaṃ vasena aṭṭha ariyapuggalā ",
      ". Nanu ca ariyāpi tihetukāyevāti? Saccaṃ, cittuppādaṃ pana patvā tesaṃ visesasabbhāvato visuṃyeva uddhaṭāti daṭṭhabbaṃ."
    ],
    "innerText": "Na vijjati hetu imesanti ahetū, duve, tīṇi ca hetū imesanti dvitihetū, paṭisandhivasena ahetukā, duhetukā, tihetukā cāti attho. Tattha ahetukā āpāyikā ca, ekacce bhūmadevā, manussesu jaccandhajaccabadhirajaccummattakanapuṃsakaubhatobyañjanakādayo ca. Vuttāvasesā kāmasugativāsinova duhetukā. Tihetukā pana kāmasugativāsinova. Ariyā pana aṭṭhāti catunnaṃ ariyamaggasamaṅgīnaṃ, catunnañca ariyaphalasamaṅgīnaṃ vasena aṭṭha ariyapuggalā . Nanu ca ariyāpi tihetukāyevāti? Saccaṃ, cittuppādaṃ pana patvā tesaṃ visesasabbhāvato visuṃyeva uddhaṭāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "189-92"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Bhūmīsuppattiṃ bhaṇato me nibodhathā’’"
      },
      "ti sutvā codako ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tiṃsabhūmīsū’’"
      },
      "tiādinā sabbesaṃ bhūmīnaṃ sādhāraṇacittāni pucchati, itaro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cuddasevā’’"
      },
      "ti vissajjeti. Tattha aṭṭha parittakusalāni, cattāri diṭṭhivippayuttāni, uddhaccasahagataṃ, manodvārāvajjanañcāti cuddaseva, na ūnāni nādhikāni, sabbāsu tiṃsabhūmīsu honti, sabbabhūmīnaṃ sādhāraṇānīti attho."
    ],
    "innerText": "189-92.‘‘Bhūmīsuppattiṃ bhaṇato me nibodhathā’’ti sutvā codako ‘‘tiṃsabhūmīsū’’tiādinā sabbesaṃ bhūmīnaṃ sādhāraṇacittāni pucchati, itaro ‘‘cuddasevā’’ti vissajjeti. Tattha aṭṭha parittakusalāni, cattāri diṭṭhivippayuttāni, uddhaccasahagataṃ, manodvārāvajjanañcāti cuddaseva, na ūnāni nādhikāni, sabbāsu tiṃsabhūmīsu honti, sabbabhūmīnaṃ sādhāraṇānīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sadā…pe… siyu"
      },
      "nti dve dosamūlāni, kusalavipākacakkhusotaviññāṇasampaṭicchanasantīraṇadvayavajjitāni aṭṭhārasa kāmāvacaravipākacittānīti vīsati cittāni sadā kāmeyeva bhave siyuṃ, na kadāci aññattha uppajjantīti attho. Nanu ca brahmūnampi akusalavipākāni uppajjantīti? Saccaṃ uppajjanti, tāni kāmabhave aniṭṭharūpādayo ārabbha uppajjanti brahmaloke tesaṃ abhāvatoti kāmabhaveyeva niyamitāni. Rūpāvacaravipākacittāni pañca rūpāvacarabhaveyeva siyuṃ, cattāro ca arūpāvacaravipākā arūpīsūti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pañca rūpabhave’’"
      },
      "tiādi."
    ],
    "innerText": "Sadā…pe… siyunti dve dosamūlāni, kusalavipākacakkhusotaviññāṇasampaṭicchanasantīraṇadvayavajjitāni aṭṭhārasa kāmāvacaravipākacittānīti vīsati cittāni sadā kāmeyeva bhave siyuṃ, na kadāci aññattha uppajjantīti attho. Nanu ca brahmūnampi akusalavipākāni uppajjantīti? Saccaṃ uppajjanti, tāni kāmabhave aniṭṭharūpādayo ārabbha uppajjanti brahmaloke tesaṃ abhāvatoti kāmabhaveyeva niyamitāni. Rūpāvacaravipākacittāni pañca rūpāvacarabhaveyeva siyuṃ, cattāro ca arūpāvacaravipākā arūpīsūti āha ‘‘pañca rūpabhave’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāma"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "…pe… bhavantī"
      },
      "ti rūpāvacarakusalakiriyacittāni ceva kusalavipākāni ca cakkhusotaviññāṇasampaṭicchanasantīraṇāni voṭṭhabbanavajjāni ca dve ahetukakiriyacittāni paṭhamamaggaviññāṇanti aṭṭhārasa cittāni kāmarūpabhaveyeva bhavanti, na arūpabhave. Tattha hi sabbaso rūpasaññānaṃ samatikkantattā rūpāvacarakusalakiriyā nuppajjanti. Cakkhuviññāṇādīni vatthudvāravirahato, hasituppādo ekantavatthunissayattā, sotāpattimaggo paratoghosapaccayāyeva nibbattanato ",
      " na uppajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvecattālīsā"
      },
      "ti aṭṭha parittakusalāni, cattāri arūpakusalāni, paṭhamamaggavajjāni satta lokuttaracittāni, paṭighadvayavajjitāni ca dasa akusalacittāni, pubbe vuttaahetukakiriyādvayavajjitāni nava kāmāvacarakiriyacittāni, cattāri arūpāvacarakiriyacittānīti evaṃ dvecattālīsa cittāni tīsu bhavesu honti."
    ],
    "innerText": "Kāma…pe… bhavantīti rūpāvacarakusalakiriyacittāni ceva kusalavipākāni ca cakkhusotaviññāṇasampaṭicchanasantīraṇāni voṭṭhabbanavajjāni ca dve ahetukakiriyacittāni paṭhamamaggaviññāṇanti aṭṭhārasa cittāni kāmarūpabhaveyeva bhavanti, na arūpabhave. Tattha hi sabbaso rūpasaññānaṃ samatikkantattā rūpāvacarakusalakiriyā nuppajjanti. Cakkhuviññāṇādīni vatthudvāravirahato, hasituppādo ekantavatthunissayattā, sotāpattimaggo paratoghosapaccayāyeva nibbattanato na uppajjati. Dvecattālīsāti aṭṭha parittakusalāni, cattāri arūpakusalāni, paṭhamamaggavajjāni satta lokuttaracittāni, paṭighadvayavajjitāni ca dasa akusalacittāni, pubbe vuttaahetukakiriyādvayavajjitāni nava kāmāvacarakiriyacittāni, cattāri arūpāvacarakiriyacittānīti evaṃ dvecattālīsa cittāni tīsu bhavesu honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "193-204"
      },
      ". Evaṃ bhavavasena cittuppattiṃ dassetvā idāni kālavasena dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ṭhapetvā panā’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbāsa"
      },
      "nti niddhāraṇatthe sāmivacanaṃ. Aṭṭha mahākiriyā, arahattamaggaphalacittāni, anāgāmiphalaṃ, nevasaññānāsaññāyatanakusalakiriyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "teraseva cittāni"
      },
      " apāyarahitāsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chabbīsabhūmīsu honti"
      },
      " apāyesu vipākāvaraṇasabbhāve etesaṃ anuppajjanato. Aparāni cha cittānīti sambandho. Tāni pana rūpabhavasādhāraṇānaṃ pañcaparittavipākānaṃ, kiriyamanodhātuyā ca vasena veditabbāni."
    ],
    "innerText": "193-204. Evaṃ bhavavasena cittuppattiṃ dassetvā idāni kālavasena dassento āha ‘‘ṭhapetvā panā’’tiādi. Sabbāsanti niddhāraṇatthe sāmivacanaṃ. Aṭṭha mahākiriyā, arahattamaggaphalacittāni, anāgāmiphalaṃ, nevasaññānāsaññāyatanakusalakiriyāti teraseva cittāni apāyarahitāsu chabbīsabhūmīsu honti apāyesu vipākāvaraṇasabbhāve etesaṃ anuppajjanato. Aparāni cha cittānīti sambandho. Tāni pana rūpabhavasādhāraṇānaṃ pañcaparittavipākānaṃ, kiriyamanodhātuyā ca vasena veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañca cittānī"
      },
      "ti diṭṭhisampayuttavicikicchāvasena pañca cittāni. Tāni hi pañcasu suddhāvāsabhūmīsu na labbhanti. Tattha anāgāmikhīṇāsavānameva adhivutthattā, tesañca paṭhamamaggeneva imesaṃ pañcannaṃ viññāṇānaṃ anuppādadhammataṃ āpāditattā."
    ],
    "innerText": "Pañca cittānīti diṭṭhisampayuttavicikicchāvasena pañca cittāni. Tāni hi pañcasu suddhāvāsabhūmīsu na labbhanti. Tattha anāgāmikhīṇāsavānameva adhivutthattā, tesañca paṭhamamaggeneva imesaṃ pañcannaṃ viññāṇānaṃ anuppādadhammataṃ āpāditattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aparāni duve"
      },
      "ti tatiyāruppakusalakiriyacittāni. Tāni hi nevasaññānāsaññāyatanesu atikkantārammaṇattā, apāyesu ca ahetukapaṭisandhikattā nuppajjanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catuvīsatībhūmisu dve cā"
      },
      "ti viññāṇañcāyatanakusalakiriyāvasena dve cittāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tevīsabhūmisu dveyevā"
      },
      "ti ākāsānañcāyatanakusalakiriyacittāni."
    ],
    "innerText": "Aparāni duveti tatiyāruppakusalakiriyacittāni. Tāni hi nevasaññānāsaññāyatanesu atikkantārammaṇattā, apāyesu ca ahetukapaṭisandhikattā nuppajjanti. Catuvīsatībhūmisu dve cāti viññāṇañcāyatanakusalakiriyāvasena dve cittāni. Tevīsabhūmisu dveyevāti ākāsānañcāyatanakusalakiriyacittāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekādasavidha"
      },
      "nti rūpāvacarakusalakiriyā hasituppādoti ekādasa. Sotāpattiphalaṃ yāva anāgāmimaggo cattāri ca cittāni suddhāvāsaapāyavajjāsu ekavīsatibhūmīsu bhavanti. Ekaṃ ",
      " sotāpattimaggacittaṃ suddhāvāsaapāyaarūpabhūmivajjesu sattarasasu bhūmīsu jāyati. Dve dosamūlāni, kusalavipākaghānajivhākāyaviññāṇāni, satta akusalavipākāti dvādasa cittāni mahaggatabhūmivajjāsu ekādasasu kāmabhūmīsu jāyanti. Aṭṭha mahāvipākacittāni kāmāvacaradevamanussavasena sattabhūmīsu jāyanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chasu bhūmisū"
      },
      "ti vehapphalasuddhāvāsasaṅkhātāsu chasu pañcamajjhānabhūmīsu."
    ],
    "innerText": "Ekādasavidhanti rūpāvacarakusalakiriyā hasituppādoti ekādasa. Sotāpattiphalaṃ yāva anāgāmimaggo cattāri ca cittāni suddhāvāsaapāyavajjāsu ekavīsatibhūmīsu bhavanti. Ekaṃ sotāpattimaggacittaṃ suddhāvāsaapāyaarūpabhūmivajjesu sattarasasu bhūmīsu jāyati. Dve dosamūlāni, kusalavipākaghānajivhākāyaviññāṇāni, satta akusalavipākāti dvādasa cittāni mahaggatabhūmivajjāsu ekādasasu kāmabhūmīsu jāyanti. Aṭṭha mahāvipākacittāni kāmāvacaradevamanussavasena sattabhūmīsu jāyanti. Chasu bhūmisūti vehapphalasuddhāvāsasaṅkhātāsu chasu pañcamajjhānabhūmīsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattāri…pe… bhūmisū"
      },
      "ti catutthajjhānavipāko parittasubhaappamāṇasubhasubhakiṇhavasena tīsu bhūmīsu jāyati, dutiyajjhānavipāko, tatiyajjhānavipāko ca parittābhāappamāṇābhāābhassaravasena tīsu bhūmīsu, paṭhamajjhānavipāko brahmapārisajjabrahmapurohitamahābrahmāvasena tīsu bhūmīsu hotīti evaṃ cattāri cittāni ekekavasena tīsu tīsu bhūmīsu jāyanti."
    ],
    "innerText": "Cattāri…pe… bhūmisūti catutthajjhānavipāko parittasubhaappamāṇasubhasubhakiṇhavasena tīsu bhūmīsu jāyati, dutiyajjhānavipāko, tatiyajjhānavipāko ca parittābhāappamāṇābhāābhassaravasena tīsu bhūmīsu, paṭhamajjhānavipāko brahmapārisajjabrahmapurohitamahābrahmāvasena tīsu bhūmīsu hotīti evaṃ cattāri cittāni ekekavasena tīsu tīsu bhūmīsu jāyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "206-9"
      },
      ". Evaṃ ettakāneva cittāni ettakāsu bhūmīsu uppajjantīti cittaniyamavasena uppattiṃ dassetvā idāni ettakāsu eva bhūmīsu ettakāneva cittāni uppajjantīti bhūminiyamavasena dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kusalākusalā kāme’’"
      },
      "tiādi āraddhaṃ. Tattha kāme kusalākusalā vīsati, tesaṃ pannarasa ahetukā pākā, āvajjanadvayañcāti sattatiṃseva mānasā narakādīsu catūsupi apāyesu jāyare. Avasesāni pana sattarasa kāmāvacaravipākakiriyacittāni, pañcatiṃsa mahaggatalokuttarānīti dvepaññāsa mānasā kadācipi tesu nuppajjanti abhūmibhāvatoti attho."
    ],
    "innerText": "206-9. Evaṃ ettakāneva cittāni ettakāsu bhūmīsu uppajjantīti cittaniyamavasena uppattiṃ dassetvā idāni ettakāsu eva bhūmīsu ettakāneva cittāni uppajjantīti bhūminiyamavasena dassetuṃ ‘‘kusalākusalā kāme’’tiādi āraddhaṃ. Tattha kāme kusalākusalā vīsati, tesaṃ pannarasa ahetukā pākā, āvajjanadvayañcāti sattatiṃseva mānasā narakādīsu catūsupi apāyesu jāyare. Avasesāni pana sattarasa kāmāvacaravipākakiriyacittāni, pañcatiṃsa mahaggatalokuttarānīti dvepaññāsa mānasā kadācipi tesu nuppajjanti abhūmibhāvatoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asīti hadayā"
      },
      "ti vuttāvasesāni asīti cittāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ghānādiviññāṇattaya"
      },
      "nti kusalavipākaghānādiviññāṇattayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Apuññajā pākā’’"
      },
      "ti akusalavipākānaṃ sabbesameva gahitattā ghānādiviññāṇattayaṃ aggahitavisesampi pārisesañāyena kusalavipākameva viññāyati."
    ],
    "innerText": "Asīti hadayāti vuttāvasesāni asīti cittāni. Ghānādiviññāṇattayanti kusalavipākaghānādiviññāṇattayaṃ. ‘‘Apuññajā pākā’’ti akusalavipākānaṃ sabbesameva gahitattā ghānādiviññāṇattayaṃ aggahitavisesampi pārisesañāyena kusalavipākameva viññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "213"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Domanassa"
      },
      "nti ",
      " domanassasahagataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kriyā ca dve"
      },
      "ti voṭṭhabbanavajjitā dve ahetukakiriyā."
    ],
    "innerText": "213.Domanassanti domanassasahagataṃ. Kriyā ca dveti voṭṭhabbanavajjitā dve ahetukakiriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "214"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūmivasenevā"
      },
      "ti puggale anāmasitvā kevalaṃ bhūmivasena. Puggalānaṃ vasena ca bhūmivasena ca cittuppattiṃ vibhāvayeti sambandho."
    ],
    "innerText": "214.Bhūmivasenevāti puggale anāmasitvā kevalaṃ bhūmivasena. Puggalānaṃ vasena ca bhūmivasena ca cittuppattiṃ vibhāvayeti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "216-8"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcabhūmisū"
      },
      "ti ",
      " caturāpāyamanussavasena pañcabhūmīsu. Ahetukānaṃ paṭisandhisadisatadārammaṇavasena ‘‘sattatiṃsevā’’ti vuttaṃ, aññakammena pana dvihetukatadārammaṇassāpi sambhavato ekacattālīsa honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ācariyajotipālattherassa"
      },
      " adhippāyena tihetukavipākehipi saddhiṃ pañcacattālīsevāti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahetukassa vuttehī"
      },
      "ti ahetukasattassa vuttehi sattatiṃsamānasehi saha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nava kriyā"
      },
      "ti aṭṭha mahākiriyā, hasituppādo cāti imāni asādhāraṇakiriyacittāni nava."
    ],
    "innerText": "216-8.Pañcabhūmisūti caturāpāyamanussavasena pañcabhūmīsu. Ahetukānaṃ paṭisandhisadisatadārammaṇavasena ‘‘sattatiṃsevā’’ti vuttaṃ, aññakammena pana dvihetukatadārammaṇassāpi sambhavato ekacattālīsa honti. Ācariyajotipālattherassa adhippāyena tihetukavipākehipi saddhiṃ pañcacattālīsevāti daṭṭhabbaṃ. Ahetukassa vuttehīti ahetukasattassa vuttehi sattatiṃsamānasehi saha. Nava kriyāti aṭṭha mahākiriyā, hasituppādo cāti imāni asādhāraṇakiriyacittāni nava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "220-1"
      },
      ". ‘‘Catupaññāsa mānasā’’ti vatvā tesaṃ sarūpato dassanatthaṃ āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dvihetukassā’’"
      },
      "tiādi. Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘catupaññāsā’’"
      },
      "tiādi pana nigamanaṃ."
    ],
    "innerText": "220-1. ‘‘Catupaññāsa mānasā’’ti vatvā tesaṃ sarūpato dassanatthaṃ āha ‘‘dvihetukassā’’tiādi. Puna ‘‘catupaññāsā’’tiādi pana nigamanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "223-4"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāsevassa cittānī"
      },
      "ti tihetukassa puthujjanassa vuttacatupaññāsacittesu diṭṭhivicikicchāsahagatavajjāni ekūnapaññāsa, sotāpattiphalanti imāni paññāseva cittāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "assa"
      },
      " kāmāvacarassa sotāpannadehino jāyante. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navatiṃsevā"
      },
      "ti ekūnacattālīsacittāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamaṃ phala"
      },
      "nti sotāpattiphalaṃ."
    ],
    "innerText": "223-4.Paññāsevassa cittānīti tihetukassa puthujjanassa vuttacatupaññāsacittesu diṭṭhivicikicchāsahagatavajjāni ekūnapaññāsa, sotāpattiphalanti imāni paññāseva cittāni assa kāmāvacarassa sotāpannadehino jāyante. Navatiṃsevāti ekūnacattālīsacittāni. Paṭhamaṃ phalanti sotāpattiphalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "225-8"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dutiyañca phalaṃ hitvā"
      },
      "ti sakadāgāmiphalaṃ hitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ca"
      },
      "-saddena sotāpattiphalañca hitvāti attho. Attano phalena ",
      " saha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yāni"
      },
      " aṭṭhacattālīsa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cittāni,"
      },
      " tāni anāgāmissa sattassa jāyanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattālīsañca cattārī"
      },
      "ti tevīsati kāmāvacaravipākacittāni, vīsati kiriyacittāni, arahattaphalañcāti catucattālīsa cittāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakaṃ saka"
      },
      "nti ‘‘sotāpannassa sotāpattimaggacittaṃ, sakadāgāmino sakadāgāmimaggacitta’’ntiādinā attano attano maggacittaṃ. Kasmā pana tesaṃ ekekameva cittaṃ hotīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ekacittakkhaṇāhi te’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcatiṃsevā"
      },
      "ti sattarasa kāmarūpārūpakusalacittāni, paṭighadvayavajjāni dasa akusalāni, rūpabhave labbhamānakāni pañca ahetukavipākāni, āvajjanadvayaṃ, paṭhamajjhānavipāko cāti pañcatiṃsa cittāni tīsu paṭhamajjhānabhūmīsu puthujjanassa jāyanti."
    ],
    "innerText": "225-8.Dutiyañca phalaṃ hitvāti sakadāgāmiphalaṃ hitvā. Ca-saddena sotāpattiphalañca hitvāti attho. Attano phalena saha yāni aṭṭhacattālīsa cittāni, tāni anāgāmissa sattassa jāyanti. Cattālīsañca cattārīti tevīsati kāmāvacaravipākacittāni, vīsati kiriyacittāni, arahattaphalañcāti catucattālīsa cittāni. Sakaṃ sakanti ‘‘sotāpannassa sotāpattimaggacittaṃ, sakadāgāmino sakadāgāmimaggacitta’’ntiādinā attano attano maggacittaṃ. Kasmā pana tesaṃ ekekameva cittaṃ hotīti āha ‘‘ekacittakkhaṇāhi te’’ti. Pañcatiṃsevāti sattarasa kāmarūpārūpakusalacittāni, paṭighadvayavajjāni dasa akusalāni, rūpabhave labbhamānakāni pañca ahetukavipākāni, āvajjanadvayaṃ, paṭhamajjhānavipāko cāti pañcatiṃsa cittāni tīsu paṭhamajjhānabhūmīsu puthujjanassa jāyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "232-5"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hitvā cā"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca"
      },
      "-saddena paṭhamaphalassa gahaṇaṃ dasseti. Tena apuññapañcakaṃ hitvā paṭhamaṃ phalaṃ gahetvā cāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apuññapañcaka"
      },
      "nti diṭṭhisampayuttavicikicchāsahagatavasena ",
      " pañca akusalacittāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti tesu sotāpannassa vuttesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthevā"
      },
      "ti sakadāgāmissa vuttesu. Puññajaṃ sampaṭicchanaṃ santīraṇadvayañcevāti sambandho."
    ],
    "innerText": "232-5.Hitvā cāti ettha ca-saddena paṭhamaphalassa gahaṇaṃ dasseti. Tena apuññapañcakaṃ hitvā paṭhamaṃ phalaṃ gahetvā cāti attho. Apuññapañcakanti diṭṭhisampayuttavicikicchāsahagatavasena pañca akusalacittāni. Tatthāti tesu sotāpannassa vuttesu. Tatthevāti sakadāgāmissa vuttesu. Puññajaṃ sampaṭicchanaṃ santīraṇadvayañcevāti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "237"
      },
      ". Evaṃ paṭhamajjhānabhūmiyaṃ puthujjanasotāpannādivasena cittasambhavaṃ dassetvā idāni tesameva vasena dutiyajjhānabhūmiyaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘puthujjanassā’’"
      },
      "tiādi āraddhaṃ. Dutiyajjhānatatiyajjhānavipākānaṃ ekasattasseva asambhavepi dutiyajjhānatale nibbatte puthujjanādayo puthujjanādibhāvasāmaññena ekato gahetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dutiyajjhānatatiyajjhānapākato’’"
      },
      "ti vuttaṃ."
    ],
    "innerText": "237. Evaṃ paṭhamajjhānabhūmiyaṃ puthujjanasotāpannādivasena cittasambhavaṃ dassetvā idāni tesameva vasena dutiyajjhānabhūmiyaṃ dassetuṃ ‘‘puthujjanassā’’tiādi āraddhaṃ. Dutiyajjhānatatiyajjhānavipākānaṃ ekasattasseva asambhavepi dutiyajjhānatale nibbatte puthujjanādayo puthujjanādibhāvasāmaññena ekato gahetvā ‘‘dutiyajjhānatatiyajjhānapākato’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "242"
      },
      ". Parittasubhādito paṭṭhāya yāva akaniṭṭhā tatiyacatutthajjhānabhūmīsu paṭhamajjhānabhūmiyaṃ vuttagaṇanāya cittappavatti veditabbā. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘parittakasubhādīna’’"
      },
      "ntiādi."
    ],
    "innerText": "242. Parittasubhādito paṭṭhāya yāva akaniṭṭhā tatiyacatutthajjhānabhūmīsu paṭhamajjhānabhūmiyaṃ vuttagaṇanāya cittappavatti veditabbā. Tenāha ‘‘parittakasubhādīna’’ntiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "247"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catuvīsati"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cittānī"
      },
      "ti aṭṭhaparittakusalāni, cattāri arūpakusalāni, paṭighadvayavajjitāni dasa akusalacittāni, paṭhamāruppavipāko, manodvārāvajjanañcāti catuvīsati cittāni paṭhamāruppabhūmiyaṃ puthujjanassa jāyanti."
    ],
    "innerText": "247.Catuvīsaticittānīti aṭṭhaparittakusalāni, cattāri arūpakusalāni, paṭighadvayavajjitāni dasa akusalacittāni, paṭhamāruppavipāko, manodvārāvajjanañcāti catuvīsati cittāni paṭhamāruppabhūmiyaṃ puthujjanassa jāyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "250-3"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dasa pañcā"
      },
      "ti aṭṭha mahākiriyā, catasso arūpakiriyā, manodvārāvajjanaṃ, paṭhamāruppavipāko, arahattaphalañcāti pannarasa cittāni paṭhamāruppabhūmiyaṃ arahato honti."
    ],
    "innerText": "250-3.Dasa pañcāti aṭṭha mahākiriyā, catasso arūpakiriyā, manodvārāvajjanaṃ, paṭhamāruppavipāko, arahattaphalañcāti pannarasa cittāni paṭhamāruppabhūmiyaṃ arahato honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tevīsā"
      },
      "ti paṭhamāruppabhūmiyaṃ puthujjanassa vuttesu catuvīsaticittesu ākāsānañcāyatanakusalavipākavajjā bāvīsati ca dutiyāruppavipāko cāti tevīsati dutiyāruppabhūmiyaṃ puthujjanassa honti. Tattheva tiṇṇaṃ phalaṭṭhasekhānaṃ puthujjanassa vuttesu akusalapañcakavajjāni aṭṭhārasa, taṃtaṃphalañcāti ekūnavīsati cittāni honti."
    ],
    "innerText": "Tevīsāti paṭhamāruppabhūmiyaṃ puthujjanassa vuttesu catuvīsaticittesu ākāsānañcāyatanakusalavipākavajjā bāvīsati ca dutiyāruppavipāko cāti tevīsati dutiyāruppabhūmiyaṃ puthujjanassa honti. Tattheva tiṇṇaṃ phalaṭṭhasekhānaṃ puthujjanassa vuttesu akusalapañcakavajjāni aṭṭhārasa, taṃtaṃphalañcāti ekūnavīsati cittāni honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kriyā dvādasā"
      },
      "ti aṭṭha mahākiriyā, ākāsānañcāyatanavajjitā tisso arūpakiriyā, manodvārāvajjananti dvādasa kiriyacittāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pākeko"
      },
      "ti eko arūpavipāko."
    ],
    "innerText": "Kriyā dvādasāti aṭṭha mahākiriyā, ākāsānañcāyatanavajjitā tisso arūpakiriyā, manodvārāvajjananti dvādasa kiriyacittāni. Pākekoti eko arūpavipāko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiyāruppabhūmiyaṃ puthujjanassa vuttesu viññāṇañcāyatanakusalavipākavajjāni ekavīsati ",
      ", ākiñcaññāyatanavipāko cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bāvīsati cittāni"
      },
      " tatiyāruppabhūmiyaṃ puthujjanassa uppajjanti."
    ],
    "innerText": "Dutiyāruppabhūmiyaṃ puthujjanassa vuttesu viññāṇañcāyatanakusalavipākavajjāni ekavīsati , ākiñcaññāyatanavipāko cāti bāvīsati cittāni tatiyāruppabhūmiyaṃ puthujjanassa uppajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "254-60"
      },
      ". Puthujjanassa vuttesu apuññapañcakavajjāni sattarasa, paṭhamaphalañcāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhārasa"
      },
      " tatiyāruppabhūmiyaṃ sotāpannassa uppajjanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tānī"
      },
      "ti tāneva aṭṭhārasa cittāni. ‘‘Ṭhapetvā paṭhamaṃ phala’’nti hi vacanato dutiyaphalaṃ pakkhipitvāti ayamattho avuttasiddho. Na hi sakadāgāmino sakadāgāmiphalañca nuppajjati ",
      ". Evañca katvā vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ṭhapetvā dutiyaṃ phala’’"
      },
      "nti. Etthāpi anāgāmiphalaṃ pakaraṇasiddhamevāti daṭṭhabbaṃ. Aṭṭha mahākiriyā, dve tatiyacatutthāruppakiriyā, manodvārāvajjanaṃ, ākiñcaññāyatanavipāko, arahattaphalanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "terasa cittāni"
      },
      " tatiyāruppabhūmiyaṃ khīṇāsavassa jāyanti. Tatiyāruppabhūmiyaṃ puthujjanassa vuttesu dvāvīsaticittesu ākiñcaññāyatanakusalavipākavajjāti vīsati, nevasaññānāsaññāyatanavipākoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekavīsati cittāni"
      },
      " catutthāruppabhūmiyaṃ puthujjanassa jāyanti. Puthujjanassa vuttesu apuññapañcakavajjāni soḷasa, sotāpattiphalañcāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sattarasa"
      },
      " tattheva sotāpannassa honti. Aṭṭha mahākiriyā, dve ca nevasaññānāsaññāyatanavipākakiriyā, manodvārāvajjanaṃ, arahattaphalañcāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvādasa cittāni"
      },
      " tattheva arahato uppajjanti."
    ],
    "innerText": "254-60. Puthujjanassa vuttesu apuññapañcakavajjāni sattarasa, paṭhamaphalañcāti aṭṭhārasa tatiyāruppabhūmiyaṃ sotāpannassa uppajjanti. Tānīti tāneva aṭṭhārasa cittāni. ‘‘Ṭhapetvā paṭhamaṃ phala’’nti hi vacanato dutiyaphalaṃ pakkhipitvāti ayamattho avuttasiddho. Na hi sakadāgāmino sakadāgāmiphalañca nuppajjati . Evañca katvā vuttaṃ ‘‘ṭhapetvā dutiyaṃ phala’’nti. Etthāpi anāgāmiphalaṃ pakaraṇasiddhamevāti daṭṭhabbaṃ. Aṭṭha mahākiriyā, dve tatiyacatutthāruppakiriyā, manodvārāvajjanaṃ, ākiñcaññāyatanavipāko, arahattaphalanti terasa cittāni tatiyāruppabhūmiyaṃ khīṇāsavassa jāyanti. Tatiyāruppabhūmiyaṃ puthujjanassa vuttesu dvāvīsaticittesu ākiñcaññāyatanakusalavipākavajjāti vīsati, nevasaññānāsaññāyatanavipākoti ekavīsati cittāni catutthāruppabhūmiyaṃ puthujjanassa jāyanti. Puthujjanassa vuttesu apuññapañcakavajjāni soḷasa, sotāpattiphalañcāti sattarasa tattheva sotāpannassa honti. Aṭṭha mahākiriyā, dve ca nevasaññānāsaññāyatanavipākakiriyā, manodvārāvajjanaṃ, arahattaphalañcāti dvādasa cittāni tattheva arahato uppajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "261-3"
      },
      ". Arūpakusalā ceva kiriyāpi ca uppajjanti, na pana vipākāti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddhamuddhamarūpīna"
      },
      "nti viññāṇañcāyatanādīsu arūpīnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Heṭṭhimā"
      },
      "ti viññāṇañcāyatanikānaṃ ākāsānañcāyatanakusalavipākā nuppajjanti, ākiñcaññāyatanikānaṃ ākāsānañcāyatanaviññāṇañcāyatanakusalavipākāti evamādinā heṭṭhimā heṭṭhimā arūpā nuppajjanti. Kasmāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘diṭṭhādīnavato kirā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kirā"
      },
      "ti anussutiyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhādīnavato"
      },
      "ti ārammaṇe, jhāne ca diṭṭhadosattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalānuttarā"
      },
      "ti lokuttarakusalā."
    ],
    "innerText": "261-3. Arūpakusalā ceva kiriyāpi ca uppajjanti, na pana vipākāti adhippāyo. Uddhamuddhamarūpīnanti viññāṇañcāyatanādīsu arūpīnaṃ. Heṭṭhimāti viññāṇañcāyatanikānaṃ ākāsānañcāyatanakusalavipākā nuppajjanti, ākiñcaññāyatanikānaṃ ākāsānañcāyatanaviññāṇañcāyatanakusalavipākāti evamādinā heṭṭhimā heṭṭhimā arūpā nuppajjanti. Kasmāti āha ‘‘diṭṭhādīnavato kirā’’ti. Kirāti anussutiyaṃ. Diṭṭhādīnavatoti ārammaṇe, jhāne ca diṭṭhadosattā. Kusalānuttarāti lokuttarakusalā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "266"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbo rūpo mahaggato"
      },
      "ti sabbo rūpāvacaramahaggatacittuppādo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manodhātū"
      },
      "ti kiriyāmanodhātuvipākamanodhātūnaṃ kāmavipāka-ggahaṇena gahitattā."
    ],
    "innerText": "266.Sabbo rūpo mahaggatoti sabbo rūpāvacaramahaggatacittuppādo. Manodhātūti kiriyāmanodhātuvipākamanodhātūnaṃ kāmavipāka-ggahaṇena gahitattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "269-73"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ…pe… heṭṭhima"
      },
      "nti dutiyāruppabhūmiyaṃ vuttesu dutiyāruppattayaṃ ṭhapetvā attano pākena saha tatiyāruppabhūmiyaṃ ",
      " ekūnacattālīsa cittāni tatthavuttesu tatiyāruppattayaṃ ṭhapetvā ",
      " attano pākena saha sattatiṃsāti evaṃ sesadvayepi heṭṭhimaheṭṭhimaṃ hitvā cittagaṇanā ñeyyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attano attano"
      },
      "ti paṭhamāruppabhūmiyaṃ paṭhamāruppavipāko, dutiyāruppabhūmiyaṃ dutiyāruppavipākoti evaṃ attano attano vipākā cattāro ca anāsavā lokuttaravipākāti evaṃ catūsu arūpabhūmīsu ekekāya bhūmiyā pañca pañca vipākā jāyanti. Yā kiriyā teraseva siyuṃ, tā sabbapaṭhamāruppabhūmiyaṃ khīṇāsavassa jāyanteti sambandho. Dutiyāruppabhūmiyaṃ khīṇāsavassa paṭhamāruppakiriyacittaṃ vajjetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvādaseva kriyā"
      },
      " honti. Tatiyāruppabhūmiyaṃ dutiyāruppakiriyacittaṃ vajjetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekādasa"
      },
      ". Catutthāruppabhūmiyaṃ tatiyāruppakiriyacittaṃ vajjetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "daseva"
      },
      " viññeyyā."
    ],
    "innerText": "269-73.Evaṃ…pe… heṭṭhimanti dutiyāruppabhūmiyaṃ vuttesu dutiyāruppattayaṃ ṭhapetvā attano pākena saha tatiyāruppabhūmiyaṃ ekūnacattālīsa cittāni tatthavuttesu tatiyāruppattayaṃ ṭhapetvā attano pākena saha sattatiṃsāti evaṃ sesadvayepi heṭṭhimaheṭṭhimaṃ hitvā cittagaṇanā ñeyyā. Attano attanoti paṭhamāruppabhūmiyaṃ paṭhamāruppavipāko, dutiyāruppabhūmiyaṃ dutiyāruppavipākoti evaṃ attano attano vipākā cattāro ca anāsavā lokuttaravipākāti evaṃ catūsu arūpabhūmīsu ekekāya bhūmiyā pañca pañca vipākā jāyanti. Yā kiriyā teraseva siyuṃ, tā sabbapaṭhamāruppabhūmiyaṃ khīṇāsavassa jāyanteti sambandho. Dutiyāruppabhūmiyaṃ khīṇāsavassa paṭhamāruppakiriyacittaṃ vajjetvā dvādaseva kriyā honti. Tatiyāruppabhūmiyaṃ dutiyāruppakiriyacittaṃ vajjetvā ekādasa. Catutthāruppabhūmiyaṃ tatiyāruppakiriyacittaṃ vajjetvā daseva viññeyyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "274-5"
      },
      ". Idāni kevalaṃ puggalavasena tesameva puggalānaṃ āveṇikacittaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘arahato panā’’"
      },
      "tiādinā arahatoyeva uppajjanakacittaṃ dassetvā anāgāmiādīnaṃ pāṭipuggalikaṃ sakasakaphalacittaṃ pākaṭamevāti saṃkhittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arahato"
      },
      "ti khīṇāsavassa. Arahato bhāvo arahattaṃ, arahattaphalanti attho. Tañhi ‘‘arīnaṃ hatattā arahā’’tiādinā arahanta-saddassa pavattinimittabhāvena ‘‘arahatta’’nti vuccati. Idāni tesaṃ tesaṃ puggalānaṃ sādhāraṇacittāni dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘catunnañca phalaṭṭhāna’’"
      },
      "ntiādi vuttaṃ."
    ],
    "innerText": "274-5. Idāni kevalaṃ puggalavasena tesameva puggalānaṃ āveṇikacittaṃ dassetuṃ ‘‘arahato panā’’tiādinā arahatoyeva uppajjanakacittaṃ dassetvā anāgāmiādīnaṃ pāṭipuggalikaṃ sakasakaphalacittaṃ pākaṭamevāti saṃkhittaṃ. Arahatoti khīṇāsavassa. Arahato bhāvo arahattaṃ, arahattaphalanti attho. Tañhi ‘‘arīnaṃ hatattā arahā’’tiādinā arahanta-saddassa pavattinimittabhāvena ‘‘arahatta’’nti vuccati. Idāni tesaṃ tesaṃ puggalānaṃ sādhāraṇacittāni dassetuṃ ‘‘catunnañca phalaṭṭhāna’’ntiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "290"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Susāra"
      },
      "nti atthabyañjanavasena pariccajitabbassa pheggussa abhāvato suṭṭhu sāraṃ, sabbaso sāranti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Para"
      },
      "nti susārattā eva paraṃ. Sattānaṃ idhalokaparalokahitapaṭicchādakassa avijjandhakārassa vidhamanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mohandhakārappadīpaṃ. Cintetī"
      },
      "ti atthavasena cinteti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vācetī"
      },
      "ti byañjanavasena ",
      " sajjhāyati. Rāgadosānaṃ mohena saha avinābhāvato tassa anupagamanaṃ atthasiddhamevāti ‘‘mohandhakārappadīpa’’nti vatvāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘naraṃ…pe… nopayantī’’"
      },
      "ti rāgadosānupagamanameva vuttaṃ. ‘‘Mohandhakārappadīpa’’nti vā vacaneneva mohassa anupagamo vutto hotīti rāgadosānameva anupagamanaṃ vuttaṃ. Mūlabhūtānaṃ pana tiṇṇaṃ anupagamanavacanena sesakilesānampi anupagamanaṃ vuttamevāti daṭṭhabbaṃ."
    ],
    "innerText": "290.Susāranti atthabyañjanavasena pariccajitabbassa pheggussa abhāvato suṭṭhu sāraṃ, sabbaso sāranti attho. Paranti susārattā eva paraṃ. Sattānaṃ idhalokaparalokahitapaṭicchādakassa avijjandhakārassa vidhamanato mohandhakārappadīpaṃ. Cintetīti atthavasena cinteti. Vācetīti byañjanavasena sajjhāyati. Rāgadosānaṃ mohena saha avinābhāvato tassa anupagamanaṃ atthasiddhamevāti ‘‘mohandhakārappadīpa’’nti vatvāpi ‘‘naraṃ…pe… nopayantī’’ti rāgadosānupagamanameva vuttaṃ. ‘‘Mohandhakārappadīpa’’nti vā vacaneneva mohassa anupagamo vutto hotīti rāgadosānameva anupagamanaṃ vuttaṃ. Mūlabhūtānaṃ pana tiṇṇaṃ anupagamanavacanena sesakilesānampi anupagamanaṃ vuttamevāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti abhidhammatthavikāsiniyā nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhidhammāvatārasaṃvaṇṇanāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhūmipuggalacittuppattiniddesavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamo bhāgo niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammāsambuddhassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "nikaya"
    },
    "innerText": "Abhidhammāvatāra-abhinavaṭīkā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(Dutiyo bhāgo)"
  }
]