[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Āyatanavibhaṅgo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Suttantabhājanīyavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "154"
      },
      ". Idāni ",
      " tadanantare āyatanavibhaṅganiddese suttantabhājanīyaṃ tāva dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvādasāyatanāni cakkhāyatanaṃ rūpāyatana"
      },
      "ntiādimāha. Tattha pāḷimuttakena tāva nayena –"
    ],
    "innerText": "154. Idāni tadanantare āyatanavibhaṅganiddese suttantabhājanīyaṃ tāva dassento dvādasāyatanāni cakkhāyatanaṃ rūpāyatanantiādimāha. Tattha pāḷimuttakena tāva nayena –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Atthalakkhaṇatāvatva, kamasaṅkhepavitthārā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tathā daṭṭhabbato ceva, viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha visesato tāva cakkhatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhu;"
      },
      " rūpaṃ assādeti, vibhāveti cāti attho. Rūpayatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpaṃ;"
      },
      " vaṇṇavikāraṃ āpajjamānaṃ hadayaṅgatabhāvaṃ pakāsetīti attho. Suṇātīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sotaṃ"
      },
      ". Sappatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddo;"
      },
      " udāhariyatīti attho. Ghāyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ghānaṃ"
      },
      ". Gandhayatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gandho;"
      },
      " attano vatthuṃ sūcayatīti attho. Jīvitaṃ avhāyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jivhā"
      },
      ". Rasanti taṃ sattāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "raso;"
      },
      " assādentīti attho. Kucchitānaṃ sāsavadhammānaṃ āyoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyo"
      },
      ". Āyoti uppattideso. Phusīyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "phoṭṭhabbaṃ"
      },
      ". Manatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mano"
      },
      ". Attano lakkhaṇaṃ dhārayantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammā"
      },
      "."
    ],
    "innerText": "Tattha visesato tāva cakkhatīti cakkhu; rūpaṃ assādeti, vibhāveti cāti attho. Rūpayatīti rūpaṃ; vaṇṇavikāraṃ āpajjamānaṃ hadayaṅgatabhāvaṃ pakāsetīti attho. Suṇātīti sotaṃ. Sappatīti saddo; udāhariyatīti attho. Ghāyatīti ghānaṃ. Gandhayatīti gandho; attano vatthuṃ sūcayatīti attho. Jīvitaṃ avhāyatīti jivhā. Rasanti taṃ sattāti raso; assādentīti attho. Kucchitānaṃ sāsavadhammānaṃ āyoti kāyo. Āyoti uppattideso. Phusīyatīti phoṭṭhabbaṃ. Manatīti mano. Attano lakkhaṇaṃ dhārayantīti dhammā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Avisesato pana āyatanato, āyānaṃ tananato, āyatassa ca nayanato āyatananti veditabbaṃ. Cakkhurūpādīsu hi taṃtaṃdvārārammaṇā cittacetasikā dhammā sena sena anubhavanādinā kiccena āyatanti uṭṭhahanti ghaṭṭenti vāyamantīti vuttaṃ hoti. Te ca pana āyabhūte dhamme etāni tanonti vitthārentīti vuttaṃ hoti. Idañca anamatagge saṃsāre pavattaṃ atīva āyataṃ saṃsāradukkhaṃ yāva na nivattati tāva nayanteva, pavattayantīti vuttaṃ hoti. Iti ",
      " sabbepi me dhammā āyatanato āyānaṃ tananato āyatassa ca nayanato ‘āyatanaṃ āyatana’nti vuccanti."
    ],
    "innerText": "Avisesato pana āyatanato, āyānaṃ tananato, āyatassa ca nayanato āyatananti veditabbaṃ. Cakkhurūpādīsu hi taṃtaṃdvārārammaṇā cittacetasikā dhammā sena sena anubhavanādinā kiccena āyatanti uṭṭhahanti ghaṭṭenti vāyamantīti vuttaṃ hoti. Te ca pana āyabhūte dhamme etāni tanonti vitthārentīti vuttaṃ hoti. Idañca anamatagge saṃsāre pavattaṃ atīva āyataṃ saṃsāradukkhaṃ yāva na nivattati tāva nayanteva, pavattayantīti vuttaṃ hoti. Iti sabbepi me dhammā āyatanato āyānaṃ tananato āyatassa ca nayanato ‘āyatanaṃ āyatana’nti vuccanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica nivāsaṭṭhānaṭṭhena, ākaraṭṭhena, samosaraṇaṭṭhānaṭṭhena ",
      ", sañjātidesaṭṭhena, kāraṇaṭṭhena ca āyatanaṃ veditabbaṃ. Tathā hi loke ‘‘issarāyatanaṃ vāsudevāyatana’’ntiādīsu nivāsaṭṭhānaṃ āyatananti vuccati ",
      ". ‘‘Suvaṇṇāyatanaṃ rajatāyatana’’ntiādīsu ākaro. Sāsane pana ‘‘manorame āyatane sevanti naṃ vihaṅgamā’’tiādīsu (a. ni. 5.38) samosaraṇaṭṭhānaṃ. ‘‘Dakkhiṇāpatho gunnaṃ āyatana’’ntiādīsu sañjātideso. ‘‘Tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane’’tiādīsu (a. ni. 5.23) kāraṇaṃ."
    ],
    "innerText": "Apica nivāsaṭṭhānaṭṭhena, ākaraṭṭhena, samosaraṇaṭṭhānaṭṭhena , sañjātidesaṭṭhena, kāraṇaṭṭhena ca āyatanaṃ veditabbaṃ. Tathā hi loke ‘‘issarāyatanaṃ vāsudevāyatana’’ntiādīsu nivāsaṭṭhānaṃ āyatananti vuccati . ‘‘Suvaṇṇāyatanaṃ rajatāyatana’’ntiādīsu ākaro. Sāsane pana ‘‘manorame āyatane sevanti naṃ vihaṅgamā’’tiādīsu (a. ni. 5.38) samosaraṇaṭṭhānaṃ. ‘‘Dakkhiṇāpatho gunnaṃ āyatana’’ntiādīsu sañjātideso. ‘‘Tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane’’tiādīsu (a. ni. 5.23) kāraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cakkhurūpādīsu cāpi te te cittacetasikā dhammā nivasanti tadāyattavuttitāyāti cakkhādayo nesaṃ nivāsanaṭṭhānaṃ. Cakkhādīsu ca te ākiṇṇā taṃ nissitattā tadārammaṇattā cāti cakkhādayo nesaṃ ākaro. Cakkhādayo ca nesaṃ samosaraṇaṭṭhānaṃ, tattha tattha vatthudvārārammaṇavasena samosaraṇato. Cakkhādayo ca nesaṃ sañjātideso; taṃ nissayārammaṇabhāvena tattheva uppattito. Cakkhādayo ca nesaṃ kāraṇaṃ, tesaṃ abhāve abhāvatoti. Iti nivāsaṭṭhānaṭṭhena, ākaraṭṭhena, samosaraṇaṭṭhānaṭṭhena, sañjātidesaṭṭhena, kāraṇaṭṭhenāti imehi kāraṇehi ete dhammā ‘āyatanaṃ āyatana’nti vuccanti. Tasmā yathāvuttenatthena cakkhu ca taṃ āyatanañcāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhāyatanaṃ…pe…"
      },
      " dhammā ca te āyatanañcāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammāyatana"
      },
      "nti evaṃ tāvettha ‘atthato’ viññātabbo vinicchayo."
    ],
    "innerText": "Cakkhurūpādīsu cāpi te te cittacetasikā dhammā nivasanti tadāyattavuttitāyāti cakkhādayo nesaṃ nivāsanaṭṭhānaṃ. Cakkhādīsu ca te ākiṇṇā taṃ nissitattā tadārammaṇattā cāti cakkhādayo nesaṃ ākaro. Cakkhādayo ca nesaṃ samosaraṇaṭṭhānaṃ, tattha tattha vatthudvārārammaṇavasena samosaraṇato. Cakkhādayo ca nesaṃ sañjātideso; taṃ nissayārammaṇabhāvena tattheva uppattito. Cakkhādayo ca nesaṃ kāraṇaṃ, tesaṃ abhāve abhāvatoti. Iti nivāsaṭṭhānaṭṭhena, ākaraṭṭhena, samosaraṇaṭṭhānaṭṭhena, sañjātidesaṭṭhena, kāraṇaṭṭhenāti imehi kāraṇehi ete dhammā ‘āyatanaṃ āyatana’nti vuccanti. Tasmā yathāvuttenatthena cakkhu ca taṃ āyatanañcāti cakkhāyatanaṃ…pe… dhammā ca te āyatanañcāti dhammāyatananti evaṃ tāvettha ‘atthato’ viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Lakkhaṇato’"
      },
      "ti cakkhādīnaṃ lakkhaṇatopettha viññātabbo vinicchayo. Tāni ca pana nesaṃ lakkhaṇāni heṭṭhā rūpakaṇḍaniddese vuttanayeneva veditabbāni."
    ],
    "innerText": "‘Lakkhaṇato’ti cakkhādīnaṃ lakkhaṇatopettha viññātabbo vinicchayo. Tāni ca pana nesaṃ lakkhaṇāni heṭṭhā rūpakaṇḍaniddese vuttanayeneva veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Tāvatvato’"
      },
      "ti tāvabhāvato. Idaṃ vuttaṃ hoti – cakkhādayopi hi dhammā eva. Evaṃ sati dhammāyatanamicceva avatvā kasmā dvādasāyatanāni vuttānīti ce? Cha viññāṇakāyuppattidvārārammaṇavavatthānato. Idha channaṃ viññāṇakāyānaṃ dvārabhāvena ārammaṇabhāvena ca vavatthānato ayameva tesaṃ bhedo hotīti dvādasa vuttāni. Cakkhuviññāṇavīthipariyāpannassa hi viññāṇakāyassa cakkhāyatanameva uppattidvāraṃ, rūpāyatanameva cārammaṇaṃ ",
      ". Tathā itarāni itaresaṃ. Chaṭṭhassa pana bhavaṅgamanasaṅkhāto manāyatanekadesova uppattidvāraṃ, asādhāraṇañca dhammāyatanaṃ ārammaṇanti ",
      ". Iti channaṃ viññāṇakāyānaṃ uppattidvārārammaṇavavatthānato dvādasa vuttānīti. Evamettha ‘tāvatvato’ viññātabbo vinicchayo."
    ],
    "innerText": "‘Tāvatvato’ti tāvabhāvato. Idaṃ vuttaṃ hoti – cakkhādayopi hi dhammā eva. Evaṃ sati dhammāyatanamicceva avatvā kasmā dvādasāyatanāni vuttānīti ce? Cha viññāṇakāyuppattidvārārammaṇavavatthānato. Idha channaṃ viññāṇakāyānaṃ dvārabhāvena ārammaṇabhāvena ca vavatthānato ayameva tesaṃ bhedo hotīti dvādasa vuttāni. Cakkhuviññāṇavīthipariyāpannassa hi viññāṇakāyassa cakkhāyatanameva uppattidvāraṃ, rūpāyatanameva cārammaṇaṃ . Tathā itarāni itaresaṃ. Chaṭṭhassa pana bhavaṅgamanasaṅkhāto manāyatanekadesova uppattidvāraṃ, asādhāraṇañca dhammāyatanaṃ ārammaṇanti . Iti channaṃ viññāṇakāyānaṃ uppattidvārārammaṇavavatthānato dvādasa vuttānīti. Evamettha ‘tāvatvato’ viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Kamato’"
      },
      "ti idhāpi pubbe vuttesu uppattikkamādīsu desanākkamova yujjati. Ajjhattikesu hi āyatanesu sanidassanasappaṭighavisayattā cakkhāyatanaṃ pākaṭanti paṭhamaṃ desitaṃ. Tato anidassanasappaṭighavisayāni sotāyatanādīni. Atha vā dassanānuttariyasavanānuttariyahetubhāvena bahūpakārattā ajjhattikesu cakkhāyatanasotāyatanāni paṭhamaṃ desitāni. Tato ghānāyatanādīni tīṇi. Pañcannampi gocaravisayattā ante manāyatanaṃ. Cakkhādīnaṃ pana gocarattā tassa tassa anantarāni bāhiresu rūpāyatanādīni. Apica viññāṇuppattikāraṇavavatthānatopi ayameva tesaṃ kamo veditabbo. Vuttañhetaṃ ‘‘cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ…pe… manañca paṭicca dhamme ca uppajjati manoviññāṇa’’nti (ma. ni. 3.421) evaṃ ‘kamato’pettha viññātabbo vinicchayo."
    ],
    "innerText": "‘Kamato’ti idhāpi pubbe vuttesu uppattikkamādīsu desanākkamova yujjati. Ajjhattikesu hi āyatanesu sanidassanasappaṭighavisayattā cakkhāyatanaṃ pākaṭanti paṭhamaṃ desitaṃ. Tato anidassanasappaṭighavisayāni sotāyatanādīni. Atha vā dassanānuttariyasavanānuttariyahetubhāvena bahūpakārattā ajjhattikesu cakkhāyatanasotāyatanāni paṭhamaṃ desitāni. Tato ghānāyatanādīni tīṇi. Pañcannampi gocaravisayattā ante manāyatanaṃ. Cakkhādīnaṃ pana gocarattā tassa tassa anantarāni bāhiresu rūpāyatanādīni. Apica viññāṇuppattikāraṇavavatthānatopi ayameva tesaṃ kamo veditabbo. Vuttañhetaṃ ‘‘cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ…pe… manañca paṭicca dhamme ca uppajjati manoviññāṇa’’nti (ma. ni. 3.421) evaṃ ‘kamato’pettha viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Saṅkhepavitthārā’ti"
      },
      " saṅkhepato hi manāyatanassa ceva dhammāyatanekadesassa ca nāmena, tadavasesānañca āyatanānaṃ rūpena saṅgahitattā dvādasāpi āyatanāni nāmarūpamattameva honti."
    ],
    "innerText": "‘Saṅkhepavitthārā’ti saṅkhepato hi manāyatanassa ceva dhammāyatanekadesassa ca nāmena, tadavasesānañca āyatanānaṃ rūpena saṅgahitattā dvādasāpi āyatanāni nāmarūpamattameva honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vitthārato pana ajjhattikesu tāva cakkhāyatanaṃ jātivasena cakkhupasādamattameva, paccayagatinikāyapuggalabhedato pana anantappabhedaṃ. Tathā sotāyatanādīni cattāri. Manāyatanaṃ tebhūmakakusalākusalavipākakiriyaviññāṇabhedena ekāsītippabhedaṃ, vatthupaṭipadādibhedato pana anantappabhedaṃ. Rūpagandharasāyatanāni samuṭṭhānabhedato catuppabhedāni, saddāyatanaṃ dvippabhedaṃ. Sabhāgavisabhāgabhedato pana sabbānipi anantappabhedāni. Phoṭṭhabbāyatanaṃ pathavīdhātutejodhātuvāyodhātuvasena tippabhedaṃ, samuṭṭhānato catuppabhedaṃ, sabhāgavisabhāgato anekappabhedaṃ. Dhammāyatanaṃ tebhūmakadhammārammaṇavasena anekappabhedanti. Evaṃ saṅkhepavitthārā viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Daṭṭhabbato’"
      },
      "ti ",
      " ettha pana sabbānevetāni āyatanāni anāgamanato aniggamanato ca daṭṭhabbāni. Na hi tāni pubbe udayā kutoci āgacchanti, nāpi uddhaṃ vayā kuhiñci gacchanti; atha kho pubbe udayā appaṭiladdhasabhāvāni, uddhaṃ ",
      " vayā paribhinnasabhāvāni, pubbantāparantavemajjhe ",
      " paccayāyattavuttitāya avasāni pavattanti. Tasmā anāgamanato aniggamanato ca daṭṭhabbāni. Tathā nirīhato abyāpārato ca. Na hi cakkhurūpādīnaṃ evaṃ hoti – ‘aho vata amhākaṃ sāmaggiyā viññāṇaṃ nāma uppajjeyyā’ti, na ca tāni viññāṇuppādanatthaṃ dvārabhāvena vatthubhāvena ārammaṇabhāvena vā īhanti, na byāpāramāpajjanti; atha kho dhammatāvesā yaṃ cakkhurūpādīnaṃ sāmaggiyaṃ cakkhuviññāṇādīni sambhavanti. Tasmā nirīhato abyāpārato ca daṭṭhabbāni. Apica ajjhattikāni suññagāmo viya daṭṭhabbāni dhuvasubhasukhattabhāvavirahitattā, bāhirāni gāmaghātakacorā viya ajjhattikānaṃ abhighātakattā. Vuttañhetaṃ – ‘‘cakkhu, bhikkhave, haññati manāpāmanāpehi rūpehīti vitthāro. Apica ajjhattikāni cha pāṇakā viya daṭṭhabbāni, bāhirāni tesaṃ gocarā viyāti. Evampettha ‘daṭṭhabbato’ viññātabbo vinicchayoti."
    ],
    "innerText": "‘Daṭṭhabbato’ti ettha pana sabbānevetāni āyatanāni anāgamanato aniggamanato ca daṭṭhabbāni. Na hi tāni pubbe udayā kutoci āgacchanti, nāpi uddhaṃ vayā kuhiñci gacchanti; atha kho pubbe udayā appaṭiladdhasabhāvāni, uddhaṃ vayā paribhinnasabhāvāni, pubbantāparantavemajjhe paccayāyattavuttitāya avasāni pavattanti. Tasmā anāgamanato aniggamanato ca daṭṭhabbāni. Tathā nirīhato abyāpārato ca. Na hi cakkhurūpādīnaṃ evaṃ hoti – ‘aho vata amhākaṃ sāmaggiyā viññāṇaṃ nāma uppajjeyyā’ti, na ca tāni viññāṇuppādanatthaṃ dvārabhāvena vatthubhāvena ārammaṇabhāvena vā īhanti, na byāpāramāpajjanti; atha kho dhammatāvesā yaṃ cakkhurūpādīnaṃ sāmaggiyaṃ cakkhuviññāṇādīni sambhavanti. Tasmā nirīhato abyāpārato ca daṭṭhabbāni. Apica ajjhattikāni suññagāmo viya daṭṭhabbāni dhuvasubhasukhattabhāvavirahitattā, bāhirāni gāmaghātakacorā viya ajjhattikānaṃ abhighātakattā. Vuttañhetaṃ – ‘‘cakkhu, bhikkhave, haññati manāpāmanāpehi rūpehīti vitthāro. Apica ajjhattikāni cha pāṇakā viya daṭṭhabbāni, bāhirāni tesaṃ gocarā viyāti. Evampettha ‘daṭṭhabbato’ viññātabbo vinicchayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni tesaṃ vipassitabbākāraṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhuṃ anicca"
      },
      "ntiādi āraddhaṃ. Tattha cakkhu tāva hutvā abhāvaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anicca"
      },
      "nti veditabbaṃ. Aparehipi catūhi kāraṇehi aniccaṃ – uppādavayavantato, vipariṇāmato, tāvakālikato, niccapaṭikkhepatoti."
    ],
    "innerText": "Idāni tesaṃ vipassitabbākāraṃ dassetuṃ cakkhuṃ aniccantiādi āraddhaṃ. Tattha cakkhu tāva hutvā abhāvaṭṭhena aniccanti veditabbaṃ. Aparehipi catūhi kāraṇehi aniccaṃ – uppādavayavantato, vipariṇāmato, tāvakālikato, niccapaṭikkhepatoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tadeva paṭipīḷanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhaṃ"
      },
      ". Yasmā vā etaṃ uppannaṃ ṭhitiṃ pāpuṇāti, ṭhitiyaṃ jarāya kilamati, jaraṃ patvā avassaṃ bhijjati; tasmā abhiṇhasampaṭipīḷanato, dukkhamato, dukkhavatthuto, sukhapaṭikkhepatoti imehi catūhi kāraṇehi dukkhaṃ."
    ],
    "innerText": "Tadeva paṭipīḷanaṭṭhena dukkhaṃ. Yasmā vā etaṃ uppannaṃ ṭhitiṃ pāpuṇāti, ṭhitiyaṃ jarāya kilamati, jaraṃ patvā avassaṃ bhijjati; tasmā abhiṇhasampaṭipīḷanato, dukkhamato, dukkhavatthuto, sukhapaṭikkhepatoti imehi catūhi kāraṇehi dukkhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Avasavattanaṭṭhena pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anattā"
      },
      ". Yasmā vā etaṃ uppannaṃ ṭhitiṃ mā pāpuṇātu, ṭhānappattaṃ mā jiratu, jarappataṃ mā bhijjatūti imesu tīsu ṭhānesu kassaci vasavattibhāvo natthi, suññaṃ tena vasavattanākārena; tasmā suññato, assāmikato, akāmakāriyato, attapaṭikkhepatoti imehi catūhi kāraṇehi anattā."
    ],
    "innerText": "Avasavattanaṭṭhena pana anattā. Yasmā vā etaṃ uppannaṃ ṭhitiṃ mā pāpuṇātu, ṭhānappattaṃ mā jiratu, jarappataṃ mā bhijjatūti imesu tīsu ṭhānesu kassaci vasavattibhāvo natthi, suññaṃ tena vasavattanākārena; tasmā suññato, assāmikato, akāmakāriyato, attapaṭikkhepatoti imehi catūhi kāraṇehi anattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vibhavagatikato ",
      ", pubbāparavasena bhavasaṅkantigamanato, pakatibhāvavijahanato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipariṇāmadhammaṃ"
      },
      ". Idaṃ aniccavevacanameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpā aniccā"
      },
      "tiādīsupi eseva nayo. Apicettha ṭhapetvā cakkhuṃ tebhūmakadhammā aniccā, no cakkhu. Cakkhu pana cakkhu ceva aniccañca. Tathā ",
      " sesadhammā dukkhā, no cakkhu. Cakkhu ",
      " pana cakkhu ceva dukkhañca. Sesadhammā anattā, no cakkhu. Cakkhu pana cakkhu ceva anattā cāti. Rūpādīsupi eseva nayo."
    ],
    "innerText": "Vibhavagatikato , pubbāparavasena bhavasaṅkantigamanato, pakatibhāvavijahanato ca vipariṇāmadhammaṃ. Idaṃ aniccavevacanameva. Rūpā aniccātiādīsupi eseva nayo. Apicettha ṭhapetvā cakkhuṃ tebhūmakadhammā aniccā, no cakkhu. Cakkhu pana cakkhu ceva aniccañca. Tathā sesadhammā dukkhā, no cakkhu. Cakkhu pana cakkhu ceva dukkhañca. Sesadhammā anattā, no cakkhu. Cakkhu pana cakkhu ceva anattā cāti. Rūpādīsupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Imasmiṃ pana suttantabhājanīye tathāgatena kiṃ dassitanti? Dvādasannaṃ āyatanānaṃ anattalakkhaṇaṃ. Sammāsambuddho hi anattalakkhaṇaṃ dassento aniccena vā dasseti, dukkhena vā, aniccadukkhehi vā. Tattha ‘‘cakkhu, attāti yo vadeyya, taṃ na upapajjati. Cakkhussa uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi paññāyati ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – cakkhu attāti yo vadeyya iti cakkhu anattā’’ti (ma. ni. 3.422). Imasmiṃ sutte aniccena anattalakkhaṇaṃ dassesi. ‘‘Rūpaṃ, bhikkhave, anattā. Rūpañca hidaṃ, bhikkhave, attā abhavissa, na yidaṃ rūpaṃ ābādhāya saṃvatteyya; labbhetha ca rūpe – evaṃ me rūpaṃ hotu, evaṃ me rūpaṃ mā ahosīti. Yasmā ca kho, bhikkhave, rūpaṃ anattā tasmā rūpaṃ ābādhāya saṃvattati; na ca labbhati rūpe – evaṃ me rūpaṃ hotu, evaṃ me rūpaṃ mā ahosī’’ti (saṃ. ni. 3.59; mahāva. 20) imasmiṃ sutte dukkhena anattalakkhaṇaṃ dassesi. ‘‘Rūpaṃ, bhikkhave, aniccaṃ, yadaniccaṃ taṃ dukkhaṃ, yaṃ dukkhaṃ tadanattā, yadanattā taṃ netaṃ mama, nesohamasmi, na meso attā’’tiādīsu (saṃ. ni. 3.15) aniccadukkhehi anattalakkhaṇaṃ dassesi. Kasmā? Aniccadukkhānaṃ pākaṭattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hatthato hi taṭṭake vā sarake vā kismiñcideva vā patitvā bhinne ‘aho anicca’nti vadanti. Evaṃ aniccaṃ pākaṭaṃ nāma. Attabhāvasmiṃ pana gaṇḍapiḷakādīsu vā uṭṭhitāsu khāṇukaṇṭakādīhi vā viddhāsu ‘aho dukkha’nti vadanti. Evaṃ dukkhaṃ pākaṭaṃ nāma. Anattalakkhaṇaṃ apākaṭaṃ andhakāraṃ avibhūtaṃ duppaṭivijjhaṃ duddīpanaṃ duppaññāpanaṃ ",
      ". Aniccadukkhalakkhaṇāni uppādā vā tathāgatānaṃ anuppādā vā paññāyanti. Anattalakkhaṇaṃ vinā buddhuppādā na paññāyati, buddhuppādeyeva paññāyati. Mahiddhikā hi mahānubhāvā tāpasaparibbājakā sarabhaṅgasatthārādayopi ‘aniccaṃ dukkha’nti vattuṃ sakkonti, ‘anattā’ti vattuṃ na sakkonti. Sace hi te sampattaparisāya anattāti vattuṃ sakkuṇeyyuṃ, sampattaparisāya maggaphalapaṭivedho bhaveyya. Anattalakkhaṇapaññāpanañhi aññassa kassaci avisayo, sabbaññubuddhānameva visayo. Evametaṃ anattalakkhaṇaṃ apākaṭaṃ. Tasmā satthā ",
      " anattalakkhaṇaṃ dassento ",
      " aniccena vā dassesi, dukkhena vā, aniccadukkhehi vā. Idha pana taṃ aniccadukkhehi dassesīti veditabbaṃ."
    ],
    "innerText": "Hatthato hi taṭṭake vā sarake vā kismiñcideva vā patitvā bhinne ‘aho anicca’nti vadanti. Evaṃ aniccaṃ pākaṭaṃ nāma. Attabhāvasmiṃ pana gaṇḍapiḷakādīsu vā uṭṭhitāsu khāṇukaṇṭakādīhi vā viddhāsu ‘aho dukkha’nti vadanti. Evaṃ dukkhaṃ pākaṭaṃ nāma. Anattalakkhaṇaṃ apākaṭaṃ andhakāraṃ avibhūtaṃ duppaṭivijjhaṃ duddīpanaṃ duppaññāpanaṃ . Aniccadukkhalakkhaṇāni uppādā vā tathāgatānaṃ anuppādā vā paññāyanti. Anattalakkhaṇaṃ vinā buddhuppādā na paññāyati, buddhuppādeyeva paññāyati. Mahiddhikā hi mahānubhāvā tāpasaparibbājakā sarabhaṅgasatthārādayopi ‘aniccaṃ dukkha’nti vattuṃ sakkonti, ‘anattā’ti vattuṃ na sakkonti. Sace hi te sampattaparisāya anattāti vattuṃ sakkuṇeyyuṃ, sampattaparisāya maggaphalapaṭivedho bhaveyya. Anattalakkhaṇapaññāpanañhi aññassa kassaci avisayo, sabbaññubuddhānameva visayo. Evametaṃ anattalakkhaṇaṃ apākaṭaṃ. Tasmā satthā anattalakkhaṇaṃ dassento aniccena vā dassesi, dukkhena vā, aniccadukkhehi vā. Idha pana taṃ aniccadukkhehi dassesīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Imāni pana lakkhaṇāni kissa amanasikārā appaṭivedhā, kena paṭicchannattā, na upaṭṭhahanti? Aniccalakkhaṇaṃ tāva udayabbayānaṃ amanasikārā appaṭivedhā, santatiyā paṭicchannattā, na upaṭṭhāti. Dukkhalakkhaṇaṃ abhiṇhasampaṭipīḷanassa amanasikārā appaṭivedhā, iriyāpathehi paṭicchannattā, na upaṭṭhāti. Anattalakkhaṇaṃ nānādhātuvinibbhogassa amanasikārā appaṭivedhā, ghanena paṭicchannattā, na upaṭṭhāti. Udayabbayaṃ pana pariggahetvā santatiyā vikopitāya aniccalakkhaṇaṃ yāthāvasarasato upaṭṭhāti. Abhiṇhasampaṭipīḷanaṃ manasikatvā iriyāpathe ugghāṭite dukkhalakkhaṇaṃ yāthāvasarasato upaṭṭhāti. Nānādhātuyo vinibbhujitvā ghanavinibbhoge kate anattalakkhaṇaṃ yāthāvasarasato upaṭṭhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca aniccaṃ aniccalakkhaṇaṃ, dukkhaṃ dukkhalakkhaṇaṃ, anattā anattalakkhaṇanti ayaṃ vibhāgo veditabbo. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anicca"
      },
      "nti khandhapañcakaṃ. Kasmā? Uppādavayaññathattabhāvā, hutvā abhāvato vā; uppādavayaññathattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aniccalakkhaṇaṃ,"
      },
      " hutvā abhāvasaṅkhāto ākāravikāro vā. ‘‘Yadaniccaṃ taṃ dukkha’’nti vacanato pana tadeva khandhapañcakaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhaṃ"
      },
      ". Kasmā? Abhiṇhasampaṭipīḷanato; abhiṇhasampaṭipīḷanākāro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhalakkhaṇaṃ"
      },
      ". ‘‘Yaṃ ",
      " dukkhaṃ taṃ anattā’’ti pana vacanato tadeva khandhapañcakaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anattā"
      },
      ". Kasmā? Avasavattanato; avasavattanākāro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anattalakkhaṇaṃ"
      },
      ". Iti aññadeva aniccaṃ dukkhaṃ anattā, aññāni aniccadukkhānattalakkhaṇāni. Pañcakkhandhā, dvādasāyatanāni, aṭṭhārasa dhātuyoti idañhi sabbampi aniccaṃ dukkhaṃ anattā nāma. Vuttappakārākāravikārā aniccadukkhānattalakkhaṇānīti."
    ],
    "innerText": "Ettha ca aniccaṃ aniccalakkhaṇaṃ, dukkhaṃ dukkhalakkhaṇaṃ, anattā anattalakkhaṇanti ayaṃ vibhāgo veditabbo. Tattha aniccanti khandhapañcakaṃ. Kasmā? Uppādavayaññathattabhāvā, hutvā abhāvato vā; uppādavayaññathattaṃ aniccalakkhaṇaṃ, hutvā abhāvasaṅkhāto ākāravikāro vā. ‘‘Yadaniccaṃ taṃ dukkha’’nti vacanato pana tadeva khandhapañcakaṃ dukkhaṃ. Kasmā? Abhiṇhasampaṭipīḷanato; abhiṇhasampaṭipīḷanākāro dukkhalakkhaṇaṃ. ‘‘Yaṃ dukkhaṃ taṃ anattā’’ti pana vacanato tadeva khandhapañcakaṃ anattā. Kasmā? Avasavattanato; avasavattanākāro anattalakkhaṇaṃ. Iti aññadeva aniccaṃ dukkhaṃ anattā, aññāni aniccadukkhānattalakkhaṇāni. Pañcakkhandhā, dvādasāyatanāni, aṭṭhārasa dhātuyoti idañhi sabbampi aniccaṃ dukkhaṃ anattā nāma. Vuttappakārākāravikārā aniccadukkhānattalakkhaṇānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saṅkhepato panettha dasāyatanāni kāmāvacarāni, dve tebhūmakāni. Sabbesupi sammasanacāro kathitoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Suttantabhājanīyavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Abhidhammabhājanīyavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "155"
      },
      ". Abhidhammabhājanīye ",
      " yathā heṭṭhā vipassakānaṃ upakāratthāya ‘‘cakkhāyatanaṃ rūpāyatana’’nti yugalato āyatanāni vuttāni, tathā avatvā ajjhattikabāhirānaṃ sabbākārato sabhāvadassanatthaṃ ‘‘cakkhāyatanaṃ sotāyatana’’nti evaṃ ajjhattikabāhiravavatthānanayena vuttāni."
    ],
    "innerText": "155. Abhidhammabhājanīye yathā heṭṭhā vipassakānaṃ upakāratthāya ‘‘cakkhāyatanaṃ rūpāyatana’’nti yugalato āyatanāni vuttāni, tathā avatvā ajjhattikabāhirānaṃ sabbākārato sabhāvadassanatthaṃ ‘‘cakkhāyatanaṃ sotāyatana’’nti evaṃ ajjhattikabāhiravavatthānanayena vuttāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "156"
      },
      ". Tesaṃ niddesavāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha katamaṃ cakkhāyatana"
      },
      "ntiādīni heṭṭhā vuttanayeneva veditabbāni."
    ],
    "innerText": "156. Tesaṃ niddesavāre tattha katamaṃ cakkhāyatanantiādīni heṭṭhā vuttanayeneva veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "167"
      },
      ". Yaṃ panetaṃ dhammāyatananiddese ‘‘tattha katamā asaṅkhatā dhātu? Rāgakkhayo dosakkhayo mohakkhayo’’ti vuttaṃ, tatrāyamattho – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asaṅkhatā dhātū"
      },
      "ti asaṅkhatasabhāvaṃ nibbānaṃ. Yasmā panetaṃ āgamma rāgādayo khīyanti, tasmā rāgakkhayo dosakkhayo mohakkhayoti vuttaṃ. Ayamettha ācariyānaṃ samānatthakathā."
    ],
    "innerText": "167. Yaṃ panetaṃ dhammāyatananiddese ‘‘tattha katamā asaṅkhatā dhātu? Rāgakkhayo dosakkhayo mohakkhayo’’ti vuttaṃ, tatrāyamattho – asaṅkhatā dhātūti asaṅkhatasabhāvaṃ nibbānaṃ. Yasmā panetaṃ āgamma rāgādayo khīyanti, tasmā rāgakkhayo dosakkhayo mohakkhayoti vuttaṃ. Ayamettha ācariyānaṃ samānatthakathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vitaṇḍavādī panāha – ‘pāṭiyekkaṃ nibbānaṃ nāma natthi, kilesakkhayova nibbāna’nti. ‘Suttaṃ āharā’ti ca vutte ‘‘nibbānaṃ nibbānanti kho, āvuso sāriputta, vuccati; katamaṃ nu kho, āvuso, nibbānanti? Yo kho, āvuso, rāgakkhayo dosakkhayo mohakkhayo – idaṃ vuccati nibbāna’’nti etaṃ jambukhādakasuttaṃ āharitvā ‘iminā suttena veditabbaṃ pāṭiyekkaṃ nibbānaṃ nāma natthi, kilesakkhayova nibbāna’nti āha. So vattabbo – ‘kiṃ pana yathā cetaṃ suttaṃ tathā attho’ti? Addhā vakkhati – ‘āma ",
      ", natthi suttato muñcitvā attho’ti. Tato vattabbo – ‘idaṃ tāva te suttaṃ ābhataṃ; anantarasuttaṃ āharā’ti. Anantarasuttaṃ nāma – ‘‘arahattaṃ arahattanti, āvuso sāriputta, vuccati; katamaṃ nu kho, āvuso, arahattanti? Yo kho, āvuso, rāgakkhayo dosakkhayo mohakkhayo – idaṃ vuccati arahatta’’nti (saṃ. ni. 4.315) idaṃ tassevānantaraṃ ābhatasuttaṃ."
    ],
    "innerText": "Vitaṇḍavādī panāha – ‘pāṭiyekkaṃ nibbānaṃ nāma natthi, kilesakkhayova nibbāna’nti. ‘Suttaṃ āharā’ti ca vutte ‘‘nibbānaṃ nibbānanti kho, āvuso sāriputta, vuccati; katamaṃ nu kho, āvuso, nibbānanti? Yo kho, āvuso, rāgakkhayo dosakkhayo mohakkhayo – idaṃ vuccati nibbāna’’nti etaṃ jambukhādakasuttaṃ āharitvā ‘iminā suttena veditabbaṃ pāṭiyekkaṃ nibbānaṃ nāma natthi, kilesakkhayova nibbāna’nti āha. So vattabbo – ‘kiṃ pana yathā cetaṃ suttaṃ tathā attho’ti? Addhā vakkhati – ‘āma , natthi suttato muñcitvā attho’ti. Tato vattabbo – ‘idaṃ tāva te suttaṃ ābhataṃ; anantarasuttaṃ āharā’ti. Anantarasuttaṃ nāma – ‘‘arahattaṃ arahattanti, āvuso sāriputta, vuccati; katamaṃ nu kho, āvuso, arahattanti? Yo kho, āvuso, rāgakkhayo dosakkhayo mohakkhayo – idaṃ vuccati arahatta’’nti (saṃ. ni. 4.315) idaṃ tassevānantaraṃ ābhatasuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imasmiṃ pana naṃ ābhate āhaṃsu – ‘nibbānaṃ nāma dhammāyatanapariyāpanno dhammo, arahattaṃ cattāro khandhā. Nibbānaṃ sacchikatvā viharanto dhammasenāpati ",
      " nibbānaṃ pucchitopi arahattaṃ pucchitopi kilesakkhayameva āha. Kiṃ pana nibbānañca arahattañca ekaṃ udāhu nāna’nti? ‘Ekaṃ ",
      " vā hotu nānaṃ vā. Ko ettha tayā atibahuṃ cuṇṇīkaraṇaṃ karontena attho’? ‘Na tvaṃ ekaṃ nānaṃ jānāsīti. Nanu ñāte sādhu hotī’ti evaṃ punappunaṃ pucchito vañcetuṃ asakkonto āha – ‘rāgādīnaṃ khīṇante uppannattā arahattaṃ rāgakkhayo dosakkhayo mohakkhayo’ti vuccatīti. Tato naṃ āhaṃsu – ‘mahākammaṃ te kataṃ. Lañjaṃ datvāpi taṃ vadāpento etadeva vadāpeyya. Yatheva ca te etaṃ vibhajitvā kathitaṃ, evaṃ idampi sallakkhehi – nibbānañhi āgamma rāgādayo khīṇāti nibbānaṃ rāgakkhayo dosakkhayo mohakkhayoti vuttaṃ. Tīṇipi hi etāni nibbānasseva adhivacanānī’ti."
    ],
    "innerText": "Imasmiṃ pana naṃ ābhate āhaṃsu – ‘nibbānaṃ nāma dhammāyatanapariyāpanno dhammo, arahattaṃ cattāro khandhā. Nibbānaṃ sacchikatvā viharanto dhammasenāpati nibbānaṃ pucchitopi arahattaṃ pucchitopi kilesakkhayameva āha. Kiṃ pana nibbānañca arahattañca ekaṃ udāhu nāna’nti? ‘Ekaṃ vā hotu nānaṃ vā. Ko ettha tayā atibahuṃ cuṇṇīkaraṇaṃ karontena attho’? ‘Na tvaṃ ekaṃ nānaṃ jānāsīti. Nanu ñāte sādhu hotī’ti evaṃ punappunaṃ pucchito vañcetuṃ asakkonto āha – ‘rāgādīnaṃ khīṇante uppannattā arahattaṃ rāgakkhayo dosakkhayo mohakkhayo’ti vuccatīti. Tato naṃ āhaṃsu – ‘mahākammaṃ te kataṃ. Lañjaṃ datvāpi taṃ vadāpento etadeva vadāpeyya. Yatheva ca te etaṃ vibhajitvā kathitaṃ, evaṃ idampi sallakkhehi – nibbānañhi āgamma rāgādayo khīṇāti nibbānaṃ rāgakkhayo dosakkhayo mohakkhayoti vuttaṃ. Tīṇipi hi etāni nibbānasseva adhivacanānī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sace evaṃ vutte saññattiṃ gacchati iccetaṃ kusalaṃ; no ce, bahunibbānatāya kāretabbo. Kathaṃ? Evaṃ tāva pucchitabbo – ‘rāgakkhayo nāma rāgasseva khayo udāhu dosamohānampi? Dosakkhayo nāma dosasseva khayo udāhu rāgamohānampi? Mohakkhayo nāma mohasseva khayo udāhu rāgadosānampī’ti? Addhā vakkhati – ‘rāgakkhayo nāma rāgasseva khayo, dosakkhayo nāma dosasseva khayo, mohakkhayo nāma mohasseva khayo’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato vattabbo – ‘tava vāde rāgakkhayo ekaṃ nibbānaṃ hoti, dosakkhayo ekaṃ, mohakkhayo ekaṃ; tiṇṇaṃ akusalamūlānaṃ khaye tīṇi nibbānāni honti, catunnaṃ upādānānaṃ khaye cattāri, pañcannaṃ nīvaraṇānaṃ khaye pañca, channaṃ taṇhākāyānaṃ khaye cha, sattannaṃ anusayānaṃ khaye satta, aṭṭhannaṃ micchattānaṃ khaye aṭṭha, navannaṃ taṇhāmūlakadhammānaṃ ",
      " khaye nava, dasannaṃ saṃyojanānaṃ khaye dasa, diyaḍḍhakilesasahassassa khaye pāṭiyekkaṃ pāṭiyekkaṃ nibbānanti bahūni nibbānāni honti. Natthi pana te nibbānānaṃ pamāṇanti. Evaṃ pana aggahetvā nibbānaṃ āgamma rāgādayo khīṇāti ekameva nibbānaṃ rāgakkhayo dosakkhayo mohakkhayoti vuccati. Tīṇipi hetāni nibbānasseva adhivacanānīti gaṇha’."
    ],
    "innerText": "Tato vattabbo – ‘tava vāde rāgakkhayo ekaṃ nibbānaṃ hoti, dosakkhayo ekaṃ, mohakkhayo ekaṃ; tiṇṇaṃ akusalamūlānaṃ khaye tīṇi nibbānāni honti, catunnaṃ upādānānaṃ khaye cattāri, pañcannaṃ nīvaraṇānaṃ khaye pañca, channaṃ taṇhākāyānaṃ khaye cha, sattannaṃ anusayānaṃ khaye satta, aṭṭhannaṃ micchattānaṃ khaye aṭṭha, navannaṃ taṇhāmūlakadhammānaṃ khaye nava, dasannaṃ saṃyojanānaṃ khaye dasa, diyaḍḍhakilesasahassassa khaye pāṭiyekkaṃ pāṭiyekkaṃ nibbānanti bahūni nibbānāni honti. Natthi pana te nibbānānaṃ pamāṇanti. Evaṃ pana aggahetvā nibbānaṃ āgamma rāgādayo khīṇāti ekameva nibbānaṃ rāgakkhayo dosakkhayo mohakkhayoti vuccati. Tīṇipi hetāni nibbānasseva adhivacanānīti gaṇha’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sace ",
      " pana evaṃ vuttepi na sallakkheti, oḷārikatāya kāretabbo. Kathaṃ? ‘Andhabālā hi acchadīpimigamakkaṭādayopi kilesapariyuṭṭhitā vatthuṃ paṭisevanti. Atha nesaṃ paṭisevanapariyante kileso vūpasammati. Tava vāde acchadīpimigamakkaṭādayo nibbānappattā nāma honti. Oḷārikaṃ vata te nibbānaṃ thūlaṃ, kaṇṇehi piḷandhituṃ na sakkāti. Evaṃ pana ",
      " aggahetvā nibbānaṃ āgamma rāgādayo khīṇāti ekameva nibbānaṃ rāgakkhayo dosakkhayo mohakkhayoti vuccati. Tīṇipi hetāni nibbānasseva adhivacanānīti gaṇha’."
    ],
    "innerText": "Sace pana evaṃ vuttepi na sallakkheti, oḷārikatāya kāretabbo. Kathaṃ? ‘Andhabālā hi acchadīpimigamakkaṭādayopi kilesapariyuṭṭhitā vatthuṃ paṭisevanti. Atha nesaṃ paṭisevanapariyante kileso vūpasammati. Tava vāde acchadīpimigamakkaṭādayo nibbānappattā nāma honti. Oḷārikaṃ vata te nibbānaṃ thūlaṃ, kaṇṇehi piḷandhituṃ na sakkāti. Evaṃ pana aggahetvā nibbānaṃ āgamma rāgādayo khīṇāti ekameva nibbānaṃ rāgakkhayo dosakkhayo mohakkhayoti vuccati. Tīṇipi hetāni nibbānasseva adhivacanānīti gaṇha’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sace pana evaṃ vuttepi na sallakkheti, gotrabhunāpi kāretabbo. Kathaṃ? Evaṃ tāva pucchitabbo – ‘tvaṃ gotrabhu nāma atthīti vadesī’ti? ‘Āma vadāmī’ti. ‘Gotrabhukkhaṇe kilesā khīṇā, khīyanti, khīyissantī’ti? Na khīṇā, na khīyanti; apica kho khīyissantīti. ‘Gotrabhu pana kiṃ ārammaṇaṃ karotī’ti? ‘Nibbānaṃ’. ‘Tava gotrabhukkhaṇe kilesā na khīṇā, na khīyanti; atha kho khīyissanti. Tvaṃ akhīṇesuyeva kilesesu kilesakkhayaṃ nibbānaṃ paññapesi, appahīnesu anusayesu anusayappahānaṃ nibbānaṃ paññapesi. Taṃ te na sameti. Evaṃ pana aggahetvā nibbānaṃ āgamma rāgādayo khīṇāti ekameva nibbānaṃ rāgakkhayo dosakkhayo mohakkhayoti vuccati. Tīṇipi hetāni nibbānasseva adhivacanānīti gaṇha’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sace pana evaṃ vuttepi na sallakkheti, maggena kāretabbo. Kathaṃ? Evaṃ tāva pucchitabbo – ‘tvaṃ maggaṃ nāma vadesī’ti? ‘Āma vademī’ti. ‘Maggakkhaṇe kilesā khīṇā, khīyanti, khiyissantī’ti? Jānamāno vakkhati – ‘khīṇāti vā khīyissantīti vā vattuṃ na vaṭṭati, khīyantīti vattuṃ ",
      " vaṭṭatī’ti. ‘Yadi evaṃ, maggassa kilesakkhayaṃ nibbānaṃ katamaṃ? Maggena khīyanakakilesā katame? Maggo katamaṃ kilesakkhayaṃ nibbānaṃ ārammaṇaṃ katvā katame kilese khepeti? Tasmā mā evaṃ gaṇha. Nibbānaṃ pana āgamma rāgādayo khīṇāti ekameva nibbānaṃ rāgakkhayo dosakkhayo mohakkhayoti vuccati. Tīṇipi hetāni nibbānasseva adhivacanānī’ti."
    ],
    "innerText": "Sace pana evaṃ vuttepi na sallakkheti, maggena kāretabbo. Kathaṃ? Evaṃ tāva pucchitabbo – ‘tvaṃ maggaṃ nāma vadesī’ti? ‘Āma vademī’ti. ‘Maggakkhaṇe kilesā khīṇā, khīyanti, khiyissantī’ti? Jānamāno vakkhati – ‘khīṇāti vā khīyissantīti vā vattuṃ na vaṭṭati, khīyantīti vattuṃ vaṭṭatī’ti. ‘Yadi evaṃ, maggassa kilesakkhayaṃ nibbānaṃ katamaṃ? Maggena khīyanakakilesā katame? Maggo katamaṃ kilesakkhayaṃ nibbānaṃ ārammaṇaṃ katvā katame kilese khepeti? Tasmā mā evaṃ gaṇha. Nibbānaṃ pana āgamma rāgādayo khīṇāti ekameva nibbānaṃ rāgakkhayo dosakkhayo mohakkhayoti vuccati. Tīṇipi hetāni nibbānasseva adhivacanānī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vutte evamāha – ‘tvaṃ āgamma āgammāti vadesī’ti? ‘Āma vademī’ti. ‘Āgamma nāmāti idaṃ te kuto laddha’nti? ‘Suttato laddha’nti ",
      ". ‘Āhara sutta’nti. ‘‘Evaṃ avijjā ca taṇhā ca taṃ āgamma, tamhi khīṇā, tamhi bhaggā, na ca kiñci kadācī’’ti. Evaṃ vutte paravādī tuṇhībhāvaṃ āpannoti."
    ],
    "innerText": "Evaṃ vutte evamāha – ‘tvaṃ āgamma āgammāti vadesī’ti? ‘Āma vademī’ti. ‘Āgamma nāmāti idaṃ te kuto laddha’nti? ‘Suttato laddha’nti . ‘Āhara sutta’nti. ‘‘Evaṃ avijjā ca taṇhā ca taṃ āgamma, tamhi khīṇā, tamhi bhaggā, na ca kiñci kadācī’’ti. Evaṃ vutte paravādī tuṇhībhāvaṃ āpannoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idhāpi dasāyatanāni kāmāvacarāni, dve pana catubhūmakāni lokiyalokuttaramissakānīti veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhidhammabhājanīyavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Pañhāpucchakavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "168"
      },
      ". Idhāpi ",
      " pañhāpucchake yaṃ labbhati yañca na labbhati, taṃ sabbaṃ pucchitvā labbhamānavaseneva vissajjanaṃ vuttaṃ; na kevalañca idha, sabbesupi pañhāpucchakesu eseva nayo. Idha pana dasannaṃ āyatanānaṃ rūpabhāvena abyākatatā veditabbā. Dvinnaṃ āyatanānaṃ khandhavibhaṅge catunnaṃ khandhānaṃ viya kusalādibhāvo veditabbo. Kevalañhi cattāro khandhā sappaccayāva saṅkhatāva dhammāyatanaṃ pana ‘‘siyā appaccayaṃ, siyā asaṅkhata’’nti āgataṃ. Ārammaṇattikesu ca anārammaṇaṃ sukhumarūpasaṅkhātaṃ dhammāyatanaṃ na-vattabbakoṭṭhāsaṃ bhajati. Tañca kho anārammaṇattā na parittādibhāvena navattabbadhammārammaṇattāti ayamettha viseso. Sesaṃ tādisameva. Idhāpi hi cattāro khandhā viya dvāyatanā pañcapaṇṇāsa kāmāvacaradhamme ārabbha rajjantassa dussantassa muyhantassa saṃvarantassa sammasantassa paccavekkhantassa ca parittārammaṇāti sabbaṃ khandhesu vuttasadisamevāti."
    ],
    "innerText": "168. Idhāpi pañhāpucchake yaṃ labbhati yañca na labbhati, taṃ sabbaṃ pucchitvā labbhamānavaseneva vissajjanaṃ vuttaṃ; na kevalañca idha, sabbesupi pañhāpucchakesu eseva nayo. Idha pana dasannaṃ āyatanānaṃ rūpabhāvena abyākatatā veditabbā. Dvinnaṃ āyatanānaṃ khandhavibhaṅge catunnaṃ khandhānaṃ viya kusalādibhāvo veditabbo. Kevalañhi cattāro khandhā sappaccayāva saṅkhatāva dhammāyatanaṃ pana ‘‘siyā appaccayaṃ, siyā asaṅkhata’’nti āgataṃ. Ārammaṇattikesu ca anārammaṇaṃ sukhumarūpasaṅkhātaṃ dhammāyatanaṃ na-vattabbakoṭṭhāsaṃ bhajati. Tañca kho anārammaṇattā na parittādibhāvena navattabbadhammārammaṇattāti ayamettha viseso. Sesaṃ tādisameva. Idhāpi hi cattāro khandhā viya dvāyatanā pañcapaṇṇāsa kāmāvacaradhamme ārabbha rajjantassa dussantassa muyhantassa saṃvarantassa sammasantassa paccavekkhantassa ca parittārammaṇāti sabbaṃ khandhesu vuttasadisamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sammohavinodaniyā vibhaṅgaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Āyatanavibhaṅgavaṇṇanā niṭṭhitā."
  }
]