[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "14. Sikkhāpadavibhaṅgo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Abhidhammabhājanīyavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "703"
      },
      ". Idāni ",
      " tadanantare sikkhāpadavibhaṅge ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcā"
      },
      "ti gaṇanaparicchedo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikkhāpadānī"
      },
      "ti sikkhitabbapadāni; sikkhākoṭṭhāsāti attho. Apica upari āgatā sabbepi kusalā dhammā sikkhitabbato sikkhā. Pañcasu pana sīlaṅgesu yaṃkiñci aṅgaṃ tāsaṃ sikkhānaṃ patiṭṭhānaṭṭhena padanti sikkhānaṃ padattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sikkhāpadāni. Pāṇātipātā"
      },
      "ti pāṇassa atipātā ghātanā māraṇāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Veramaṇī"
      },
      "ti virati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adinnādānā"
      },
      "ti adinnassa ādānā; parapariggahitassa haraṇāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmesū"
      },
      "ti vatthukāmesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Micchācārā"
      },
      "ti kilesakāmavasena lāmakācārā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Musāvādā"
      },
      "ti abhūtavādato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Surāmerayamajjapamādaṭṭhānā"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "surā"
      },
      "ti piṭṭhasurā, pūvasurā, odanasurā, kiṇṇapakkhittā, sambhārasaṃyuttāti pañca surā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Meraya"
      },
      "nti pupphāsavo, phalāsavo, guḷāsavo, madhvāsavo, sambhārasaṃyuttoti pañca āsavā. Tadubhayampi madanīyaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "majjaṃ"
      },
      ". Yāya cetanāya taṃ pivanti, sā pamādakāraṇattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pamādaṭṭhānaṃ;"
      },
      " tasmā surāmerayamajjapamādaṭṭhānā. Ayaṃ tāvettha mātikānikkhepassa attho."
    ],
    "innerText": "703. Idāni tadanantare sikkhāpadavibhaṅge pañcāti gaṇanaparicchedo. Sikkhāpadānīti sikkhitabbapadāni; sikkhākoṭṭhāsāti attho. Apica upari āgatā sabbepi kusalā dhammā sikkhitabbato sikkhā. Pañcasu pana sīlaṅgesu yaṃkiñci aṅgaṃ tāsaṃ sikkhānaṃ patiṭṭhānaṭṭhena padanti sikkhānaṃ padattā sikkhāpadāni. Pāṇātipātāti pāṇassa atipātā ghātanā māraṇāti attho. Veramaṇīti virati. Adinnādānāti adinnassa ādānā; parapariggahitassa haraṇāti attho. Kāmesūti vatthukāmesu. Micchācārāti kilesakāmavasena lāmakācārā. Musāvādāti abhūtavādato. Surāmerayamajjapamādaṭṭhānāti ettha surāti piṭṭhasurā, pūvasurā, odanasurā, kiṇṇapakkhittā, sambhārasaṃyuttāti pañca surā. Merayanti pupphāsavo, phalāsavo, guḷāsavo, madhvāsavo, sambhārasaṃyuttoti pañca āsavā. Tadubhayampi madanīyaṭṭhena majjaṃ. Yāya cetanāya taṃ pivanti, sā pamādakāraṇattā pamādaṭṭhānaṃ; tasmā surāmerayamajjapamādaṭṭhānā. Ayaṃ tāvettha mātikānikkhepassa attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "704"
      },
      ". Padabhājanīye pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yasmiṃ samaye kāmāvacara"
      },
      "ntiādi sabbaṃ heṭṭhā vuttanayattā uttānatthameva. Yasmā pana na kevalaṃ viratiyeva sikkhāpadaṃ, cetanāpi sikkhāpadameva, tasmā taṃ dassetuṃ dutiyanayo dassito. Yasmā ca na kevalaṃ eteyeva dve dhammā sikkhāpadaṃ, cetanāsampayuttā pana paropaṇṇāsadhammāpi sikkhitabbakoṭṭhāsato sikkhāpadameva, tasmā tatiyanayopi dassito."
    ],
    "innerText": "704. Padabhājanīye pana yasmiṃ samaye kāmāvacarantiādi sabbaṃ heṭṭhā vuttanayattā uttānatthameva. Yasmā pana na kevalaṃ viratiyeva sikkhāpadaṃ, cetanāpi sikkhāpadameva, tasmā taṃ dassetuṃ dutiyanayo dassito. Yasmā ca na kevalaṃ eteyeva dve dhammā sikkhāpadaṃ, cetanāsampayuttā pana paropaṇṇāsadhammāpi sikkhitabbakoṭṭhāsato sikkhāpadameva, tasmā tatiyanayopi dassito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " duvidhaṃ sikkhāpadaṃ pariyāyasikkhāpadaṃ nippariyāyasikkhāpadañca. Tattha virati nippariyāyasikkhāpadaṃ. Sā hi ‘‘pāṇātipātā veramaṇī’’ti ",
      " pāḷiyaṃ āgatā, no cetanā. Viramanto ca tāya eva tato tato viramati, na cetanāya. Cetanaṃ pana āharitvā dassesi. Tathā sesacetanāsampayuttadhamme. Vītikkamakāle hi veracetanā dussīlyaṃ nāma. Tasmā sā viratikālepi susīlyavasena vuttā. Phassādayo taṃsampayuttattā gahitāti."
    ],
    "innerText": "Tattha duvidhaṃ sikkhāpadaṃ pariyāyasikkhāpadaṃ nippariyāyasikkhāpadañca. Tattha virati nippariyāyasikkhāpadaṃ. Sā hi ‘‘pāṇātipātā veramaṇī’’ti pāḷiyaṃ āgatā, no cetanā. Viramanto ca tāya eva tato tato viramati, na cetanāya. Cetanaṃ pana āharitvā dassesi. Tathā sesacetanāsampayuttadhamme. Vītikkamakāle hi veracetanā dussīlyaṃ nāma. Tasmā sā viratikālepi susīlyavasena vuttā. Phassādayo taṃsampayuttattā gahitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " etesu sikkhāpadesu ñāṇasamuttejanatthaṃ imesaṃ pāṇātipātādīnaṃ dhammato, koṭṭhāsato, ārammaṇato, vedanāto, mūlato, kammato, sāvajjato, payogato ca vinicchayo veditabbo."
    ],
    "innerText": "Idāni etesu sikkhāpadesu ñāṇasamuttejanatthaṃ imesaṃ pāṇātipātādīnaṃ dhammato, koṭṭhāsato, ārammaṇato, vedanāto, mūlato, kammato, sāvajjato, payogato ca vinicchayo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘dhammato’"
      },
      "ti pañcapete pāṇātipātādayo cetanādhammāva honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Koṭṭhāsato’"
      },
      " pañcapi kammapathā eva."
    ],
    "innerText": "Tattha ‘dhammato’ti pañcapete pāṇātipātādayo cetanādhammāva honti. ‘Koṭṭhāsato’ pañcapi kammapathā eva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Ārammaṇato’"
      },
      " pāṇātipāto jīvitindriyārammaṇo. Adinnādānaṃ sattārammaṇaṃ vā saṅkhārārammaṇaṃ vā. Micchācāro itthipurisārammaṇo. Musāvādo sattārammaṇo vā saṅkhārārammaṇo vā. Surāpānaṃ saṅkhārārammaṇaṃ."
    ],
    "innerText": "‘Ārammaṇato’ pāṇātipāto jīvitindriyārammaṇo. Adinnādānaṃ sattārammaṇaṃ vā saṅkhārārammaṇaṃ vā. Micchācāro itthipurisārammaṇo. Musāvādo sattārammaṇo vā saṅkhārārammaṇo vā. Surāpānaṃ saṅkhārārammaṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Vedanāto’"
      },
      " pāṇātipāto dukkhavedano. Adinnādānaṃ tivedanaṃ. Tañhi haṭṭhatuṭṭhassa adinnaṃ ādiyato sukhavedanaṃ hoti, bhītakāle dukkhavedanaṃ, majjhattassa hutvā gaṇhato adukkhamasukhavedanaṃ. Micchācāro sukhavedano vā adukkhamasukhavedano vā. Musāvādo adinnādānaṃ viya tivedano. Surāpānaṃ sukhamajjhattavedanaṃ."
    ],
    "innerText": "‘Vedanāto’ pāṇātipāto dukkhavedano. Adinnādānaṃ tivedanaṃ. Tañhi haṭṭhatuṭṭhassa adinnaṃ ādiyato sukhavedanaṃ hoti, bhītakāle dukkhavedanaṃ, majjhattassa hutvā gaṇhato adukkhamasukhavedanaṃ. Micchācāro sukhavedano vā adukkhamasukhavedano vā. Musāvādo adinnādānaṃ viya tivedano. Surāpānaṃ sukhamajjhattavedanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Mūlato’"
      },
      " pāṇātipāto dosamohamūlo. Adinnādānaṃ kiñcikāle lobhamohamūlaṃ, kiñcikāle dosamohamūlaṃ. Micchācāro lobhamohamūlo. Musāvādo kiñcikāle lobhamohamūlo, kiñcikāle dosamohamūlo. Surāpānaṃ lobhamohamūlaṃ."
    ],
    "innerText": "‘Mūlato’ pāṇātipāto dosamohamūlo. Adinnādānaṃ kiñcikāle lobhamohamūlaṃ, kiñcikāle dosamohamūlaṃ. Micchācāro lobhamohamūlo. Musāvādo kiñcikāle lobhamohamūlo, kiñcikāle dosamohamūlo. Surāpānaṃ lobhamohamūlaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Kammato’"
      },
      " musāvādo cettha vacīkammaṃ. Sesā kāyakammameva."
    ],
    "innerText": "‘Kammato’ musāvādo cettha vacīkammaṃ. Sesā kāyakammameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Sāvajjato’"
      },
      " pāṇātipāto atthi appasāvajjo, atthi mahāsāvajjo. Tathā adinnādānādīni. Tesaṃ nānākaraṇaṃ heṭṭhā dassitameva."
    ],
    "innerText": "‘Sāvajjato’ pāṇātipāto atthi appasāvajjo, atthi mahāsāvajjo. Tathā adinnādānādīni. Tesaṃ nānākaraṇaṃ heṭṭhā dassitameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayaṃ pana aparo nayo – kunthakipillikassa hi vadho appasāvajjo, tato mahantatarassa mahāsāvajjo; sopi appasāvajjo, tato mahantatarāya sakuṇikāya mahāsāvajjo; tato godhāya, tato sasakassa, tato migassa, tato gavayassa, tato assassa, tato hatthissa vadho mahāsāvajjo, tatopi dussīlamanussassa ",
      ", tato gorūpasīlakamanussassa, tato saraṇagatassa, tato pañcasikkhāpadikassa, tato sāmaṇerassa, tato puthujjanabhikkhuno ",
      ", tato sotāpannassa, tato sakadāgāmissa, tato anāgāmissa, tato khīṇāsavassa vadho atimahāsāvajjoyeva."
    ],
    "innerText": "Ayaṃ pana aparo nayo – kunthakipillikassa hi vadho appasāvajjo, tato mahantatarassa mahāsāvajjo; sopi appasāvajjo, tato mahantatarāya sakuṇikāya mahāsāvajjo; tato godhāya, tato sasakassa, tato migassa, tato gavayassa, tato assassa, tato hatthissa vadho mahāsāvajjo, tatopi dussīlamanussassa , tato gorūpasīlakamanussassa, tato saraṇagatassa, tato pañcasikkhāpadikassa, tato sāmaṇerassa, tato puthujjanabhikkhuno , tato sotāpannassa, tato sakadāgāmissa, tato anāgāmissa, tato khīṇāsavassa vadho atimahāsāvajjoyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Adinnādānaṃ dussīlassa santake appasāvajjaṃ, tato gorūpasīlakassa santake mahāsāvajjaṃ; tato saraṇagatassa, tato pañcasikkhāpadikassa, tato sāmaṇerassa, tato puthujjanabhikkhuno, tato sotāpannassa, tato sakadāgāmissa, tato anāgāmissa santake mahāsāvajjaṃ, tato khīṇāsavassa santake atimahāsāvajjaṃyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Micchācāro dussīlāya itthiyā vītikkame appasāvajjo, tato gorūpasīlakāya mahāsāvajjo; tato saraṇagatāya, pañcasikkhāpadikāya, sāmaṇeriyā, puthujjanabhikkhuniyā, sotāpannāya, sakadāgāminiyā, tato anāgāminiyā vītikkame mahāsāvajjo, khīṇāsavāya pana bhikkhuniyā ekantamahāsāvajjova."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Musāvādo kākaṇikamattassa atthāya musākathane appasāvajjo, tato aḍḍhamāsakassa, māsakassa, pañcamāsakassa, aḍḍhakahāpaṇassa, kahāpaṇassa, tato anagghaniyabhaṇḍassa atthāya musākathane mahāsāvajjo, musā kathetvā pana saṅghaṃ bhindantassa ekantamahāsāvajjova."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Surāpānaṃ pasatamattassa pāne appasāvajjaṃ, añjalimattassa pāne mahāsāvajjaṃ; kāyacālanasamatthaṃ pana bahuṃ pivitvā gāmaghātanigamaghātakammaṃ karontassa ekantamahāsāvajjameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pāṇātipātañhi ",
      " patvā khīṇāsavassa vadho mahāsāvajjo; adinnādānaṃ patvā khīṇāsavasantakassa haraṇaṃ, micchācāraṃ patvā khīṇāsavāya bhikkhuniyā vītikkamanaṃ, musāvādaṃ patvā musāvādena saṅghabhedo, surāpānaṃ patvā kāyacālanasamatthaṃ bahuṃ pivitvā gāmanigamaghātanaṃ mahāsāvajjaṃ. Sabbehipi panetehi musāvādena saṅghabhedanameva mahāsāvajjaṃ. Tañhi kappaṃ niraye pācanasamatthaṃ mahākibbisaṃ."
    ],
    "innerText": "Pāṇātipātañhi patvā khīṇāsavassa vadho mahāsāvajjo; adinnādānaṃ patvā khīṇāsavasantakassa haraṇaṃ, micchācāraṃ patvā khīṇāsavāya bhikkhuniyā vītikkamanaṃ, musāvādaṃ patvā musāvādena saṅghabhedo, surāpānaṃ patvā kāyacālanasamatthaṃ bahuṃ pivitvā gāmanigamaghātanaṃ mahāsāvajjaṃ. Sabbehipi panetehi musāvādena saṅghabhedanameva mahāsāvajjaṃ. Tañhi kappaṃ niraye pācanasamatthaṃ mahākibbisaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Payogato’"
      },
      "ti ",
      " pāṇātipāto sāhatthikopi hoti āṇattikopi. Tathā adinnādānaṃ. Micchācāramusāvādasurāpānāni sāhatthikānevāti."
    ],
    "innerText": "‘Payogato’ti pāṇātipāto sāhatthikopi hoti āṇattikopi. Tathā adinnādānaṃ. Micchācāramusāvādasurāpānāni sāhatthikānevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evamettha ",
      " pāṇātipātādīnaṃ dhammādivasena vinicchayaṃ ñatvā pāṇātipātā veramaṇītiādīnampi dhammato, koṭṭhāsato, ārammaṇato, vedanāto, mūlato, kammato, khaṇḍato, samādānato, payogato ca vinicchayo veditabbo."
    ],
    "innerText": "Evamettha pāṇātipātādīnaṃ dhammādivasena vinicchayaṃ ñatvā pāṇātipātā veramaṇītiādīnampi dhammato, koṭṭhāsato, ārammaṇato, vedanāto, mūlato, kammato, khaṇḍato, samādānato, payogato ca vinicchayo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘dhammato’"
      },
      "ti pariyāyasīlavasena paṭipāṭiyā pañca cetanādhammāva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Koṭṭhāsato’"
      },
      "ti pañcapi kammapathā eva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Ārammaṇato’"
      },
      "ti pāṇātipātā veramaṇī parassa jīvitindriyaṃ ārammaṇaṃ katvā attano veracetanāya viramati. Itarāsupi eseva nayo. Sabbāpi hi etā vītikkamitabbavatthuṃ ārammaṇaṃ katvā veracetanāhiyeva viramanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Vedanāto’"
      },
      "ti sabbāpi sukhavedanā vā honti majjhattavedanā vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Mūlato’"
      },
      "ti ñāṇasampayuttacittena viramantassa alobhaadosaamohamūlā honti, ñāṇavippayuttacittena viramantassa alobhaadosamūlā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Kammato’"
      },
      "ti musāvādā veramaṇīyevettha vacīkammaṃ; sesā kāyakammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Khaṇḍato’"
      },
      "ti gahaṭṭhā yaṃ yaṃ vītikkamanti, taṃ tadeva khaṇḍaṃ hoti bhijjati, avasesaṃ na bhijjati. Kasmā? Gahaṭṭhā hi anibaddhasīlā honti, yaṃ yaṃ sakkonti taṃ tadeva gopenti. Sāmaṇerānaṃ pana ekasmiṃ vītikkamante sabbāni bhijjanti. Na kevalañca etāni, sesasīlānipi bhijjantiyeva. Tesaṃ pana vītikkamo daṇḍakammavatthuko. ‘Puna evarūpaṃ na karissāmī’ti daṇḍakamme kate sīlaṃ paripuṇṇaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Samādānato’"
      },
      "ti sayameva ‘pañca sīlāni adhiṭṭhahāmī’ti adhiṭṭhahantenapi, pāṭiyekkaṃ pāṭiyekkaṃ samādiyantenapi samādiṇṇāni honti. Aññassa santike nisīditvā ‘pañca sīlāni samādiyāmī’ti samādiyantenapi, pāṭiyekkaṃ pāṭiyekkaṃ samādiyantenapi ",
      " samādinnāneva honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘Payogato’"
      },
      " sabbānipi sāhatthikapayogānevāti veditabbāni."
    ],
    "innerText": "Tattha ‘dhammato’ti pariyāyasīlavasena paṭipāṭiyā pañca cetanādhammāva. ‘Koṭṭhāsato’ti pañcapi kammapathā eva. ‘Ārammaṇato’ti pāṇātipātā veramaṇī parassa jīvitindriyaṃ ārammaṇaṃ katvā attano veracetanāya viramati. Itarāsupi eseva nayo. Sabbāpi hi etā vītikkamitabbavatthuṃ ārammaṇaṃ katvā veracetanāhiyeva viramanti. ‘Vedanāto’ti sabbāpi sukhavedanā vā honti majjhattavedanā vā. ‘Mūlato’ti ñāṇasampayuttacittena viramantassa alobhaadosaamohamūlā honti, ñāṇavippayuttacittena viramantassa alobhaadosamūlā honti. ‘Kammato’ti musāvādā veramaṇīyevettha vacīkammaṃ; sesā kāyakammaṃ. ‘Khaṇḍato’ti gahaṭṭhā yaṃ yaṃ vītikkamanti, taṃ tadeva khaṇḍaṃ hoti bhijjati, avasesaṃ na bhijjati. Kasmā? Gahaṭṭhā hi anibaddhasīlā honti, yaṃ yaṃ sakkonti taṃ tadeva gopenti. Sāmaṇerānaṃ pana ekasmiṃ vītikkamante sabbāni bhijjanti. Na kevalañca etāni, sesasīlānipi bhijjantiyeva. Tesaṃ pana vītikkamo daṇḍakammavatthuko. ‘Puna evarūpaṃ na karissāmī’ti daṇḍakamme kate sīlaṃ paripuṇṇaṃ hoti. ‘Samādānato’ti sayameva ‘pañca sīlāni adhiṭṭhahāmī’ti adhiṭṭhahantenapi, pāṭiyekkaṃ pāṭiyekkaṃ samādiyantenapi samādiṇṇāni honti. Aññassa santike nisīditvā ‘pañca sīlāni samādiyāmī’ti samādiyantenapi, pāṭiyekkaṃ pāṭiyekkaṃ samādiyantenapi samādinnāneva honti. ‘Payogato’ sabbānipi sāhatthikapayogānevāti veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "712"
      },
      ". Idāni yāsaṃ sikkhānaṃ koṭṭhāsabhāvena imāni pañca sikkhāpadāni vuttāni, tāni dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "katame dhammā sikkhā"
      },
      "ti ayaṃ sikkhāvāro āraddho. Tattha ",
      " yasmā sabbepi catubhūmakakusalā dhammā sikkhitabbabhāvato ",
      " sikkhā, tasmā te dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yasmiṃ samaye kāmāvacara"
      },
      "ntiādi vuttaṃ. Tattha heṭṭhā cittuppādakaṇḍe (dha. sa. 1) vuttanayeneva pāḷiṃ vitthāretvā attho veditabbo. Idha pana mukhamattameva dassitanti."
    ],
    "innerText": "712. Idāni yāsaṃ sikkhānaṃ koṭṭhāsabhāvena imāni pañca sikkhāpadāni vuttāni, tāni dassetuṃ katame dhammā sikkhāti ayaṃ sikkhāvāro āraddho. Tattha yasmā sabbepi catubhūmakakusalā dhammā sikkhitabbabhāvato sikkhā, tasmā te dassetuṃ yasmiṃ samaye kāmāvacarantiādi vuttaṃ. Tattha heṭṭhā cittuppādakaṇḍe (dha. sa. 1) vuttanayeneva pāḷiṃ vitthāretvā attho veditabbo. Idha pana mukhamattameva dassitanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhidhammabhājanīyavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Pañhāpucchakavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "714"
      },
      ". Pañhāpucchake pāḷianusāreneva sikkhāpadānaṃ kusalādibhāvo veditabbo. Ārammaṇattikesu pana yāni sikkhāpadāni ettha sattārammaṇānīti vuttāni, tāni yasmā sattoti saṅkhaṃ gate saṅkhāreyeva ārammaṇaṃ karonti, yasmā ca sabbānipi etāni sampattavirativaseneva niddiṭṭhāni, tasmā ‘‘parittārammaṇā’’ti ca ‘‘paccuppannārammaṇā’’ti ca vuttaṃ. Yato pana viramati tassa vatthuno accantabahiddhattā sabbesampi bahiddhārammaṇatā veditabbāti."
    ],
    "innerText": "714. Pañhāpucchake pāḷianusāreneva sikkhāpadānaṃ kusalādibhāvo veditabbo. Ārammaṇattikesu pana yāni sikkhāpadāni ettha sattārammaṇānīti vuttāni, tāni yasmā sattoti saṅkhaṃ gate saṅkhāreyeva ārammaṇaṃ karonti, yasmā ca sabbānipi etāni sampattavirativaseneva niddiṭṭhāni, tasmā ‘‘parittārammaṇā’’ti ca ‘‘paccuppannārammaṇā’’ti ca vuttaṃ. Yato pana viramati tassa vatthuno accantabahiddhattā sabbesampi bahiddhārammaṇatā veditabbāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Imasmiṃ pana sikkhāpadavibhaṅge sammāsambuddhena abhidhammabhājanīyepi pañhāpucchakepi lokiyāneva sikkhāpadāni kathitāni. Ubhopi hi ete nayā lokiyattā ekaparicchedā eva. Evamayaṃ sikkhāpadavibhaṅgo dveparivaṭṭaṃ nīharitvāva bhājetvā dassitoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sammohavinodaniyā vibhaṅgaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sikkhāpadavibhaṅgavaṇṇanā niṭṭhitā."
  }
]