[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "7. Anusayayamakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Paricchedaparicchinnuddesavāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Idāni ",
      " tesaññeva mūlayamake desitānaṃ kusalādidhammānaṃ labbhamānavasena ekadesaṃ saṅgaṇhitvā saṅkhārayamakānantaraṃ desitassa anusayayamakassa atthavaṇṇanā hoti. Tattha pāḷivavatthānaṃ tāva veditabbaṃ – imasmiñhi anusayayamake khandhayamakādīsu viya desanaṃ akatvā ",
      " aññena nayena pāḷidesanā katā. Kathaṃ? Paṭhamaṃ tāva paricchedato, uddesato, uppattiṭṭhānatoti tīhākārehi anusaye gahāpetuṃ paricchedavāro, paricchinnuddesavāro, uppattiṭṭhānavāroti, tayo vārā desitā. Tato sattannaṃ mahāvārānaṃ vasena anusaye yojetvā yamakadesanā katā. Tattha",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": " sattānusayāti"
      },
      " ayaṃ ‘‘satteva, na tato uddhaṃ, na heṭṭhā’’ti gaṇanaparicchedena paricchinditvā anusayānaṃ desitattā paricchedavāro nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmarāgānusayo…pe… avijjānusayo"
      },
      "ti ayaṃ paricchedavārena paricchinnānaṃ nāmamattaṃ uddisitvā ‘‘ime nāma te’’ti desitattā paricchinnuddesavāro nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kattha kāmarāgānusayo anuseti…pe… ettha avijjānusayo anusetī"
      },
      "ti ayaṃ ‘‘imesu nāma ṭhānesu ime anusayā anusenti’’ti evaṃ tesaṃyeva uppattiṭṭhānassa desitattā uppattiṭṭhānavāro nāma."
    ],
    "innerText": "1. Idāni tesaññeva mūlayamake desitānaṃ kusalādidhammānaṃ labbhamānavasena ekadesaṃ saṅgaṇhitvā saṅkhārayamakānantaraṃ desitassa anusayayamakassa atthavaṇṇanā hoti. Tattha pāḷivavatthānaṃ tāva veditabbaṃ – imasmiñhi anusayayamake khandhayamakādīsu viya desanaṃ akatvā aññena nayena pāḷidesanā katā. Kathaṃ? Paṭhamaṃ tāva paricchedato, uddesato, uppattiṭṭhānatoti tīhākārehi anusaye gahāpetuṃ paricchedavāro, paricchinnuddesavāro, uppattiṭṭhānavāroti, tayo vārā desitā. Tato sattannaṃ mahāvārānaṃ vasena anusaye yojetvā yamakadesanā katā. Tattha sattānusayāti ayaṃ ‘‘satteva, na tato uddhaṃ, na heṭṭhā’’ti gaṇanaparicchedena paricchinditvā anusayānaṃ desitattā paricchedavāro nāma. Kāmarāgānusayo…pe… avijjānusayoti ayaṃ paricchedavārena paricchinnānaṃ nāmamattaṃ uddisitvā ‘‘ime nāma te’’ti desitattā paricchinnuddesavāro nāma. Kattha kāmarāgānusayo anuseti…pe… ettha avijjānusayo anusetīti ayaṃ ‘‘imesu nāma ṭhānesu ime anusayā anusenti’’ti evaṃ tesaṃyeva uppattiṭṭhānassa desitattā uppattiṭṭhānavāro nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yesaṃ pana sattannaṃ mahāvārānaṃ vasena anusaye yojetvā yamakadesanā katā, tesaṃ imāni nāmāni – anusayavāro, sānusayavāro, pajahanavāro, pariññāvāro, pahīnavāro, uppajjanavāro dhātuvāroti. Tesu paṭhamo anusayavāro. So anulomapaṭilomanayavasena duvidho hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " anulomanaye ‘‘yassa anuseti, yattha anuseti, yassa yattha anusetī’’ti puggalokāsatadubhayavasena tayo antaravārā honti. Tesu paṭhame puggalavāre ‘‘yassa kāmarāgānusayo anuseti, tassa paṭighānusayo anuseti; yassa vā pana paṭighānusayo anuseti, tassa kāmarāgānusayo anuseti; yassa kāmarāgānusayo anuseti, tassa mānānusayo, diṭṭhānusayo, vicikicchānusayo, bhavarāgānusayo, avijjānusayo anuseti. Yassa vā pana avijjānusayo anuseti, tassa kāmarāgānusayo ",
      " anusetī’’ti kāmarāgānusayamūlakāni cha yamakāni. Puna agahitaggahaṇavasena paṭighānusayamūlakāni pañca, mānānusayamūlakāni cattāri, diṭṭhānusayamūlakāni tīṇi, vicikicchānusayamūlakāni dve, bhavarāgānusayamūlakaṃ ekanti evaṃ sabbānipi ekamūlakāni ekavīsati. Puna ‘‘yassa kāmarāgānusayo ca paṭighānusayo ca anusentī’’ti evaṃ āgatāni dukamūlakāni pañca, tikamūlakāni cattāri, catukkamūlakāni tīṇi, pañcakamūlakāni dve, chakkamūlakaṃ ekanti aparānipi pannarasa honti. Tāni purimehi ekavīsatiyā saddhiṃ chattiṃsāti puggalavāre chattiṃsa yamakāni. Tathā okāsavāre, tathā puggalokāsavāreti sabbānipi anulomanaye aṭṭhasataṃ yamakāni. Tathā paṭilomanayeti anusayavāre soḷasādhikāni dve yamakasatāni, tato diguṇā ",
      " pucchā, tato diguṇā atthā ca veditabbā. Yathā cettha, evaṃ sānusayavāro, pajahanavāro, pariññāvāro, pahīnavāro, uppajjanavāroti imesampi pañcannaṃ vārānaṃ, ekekasmiṃ yamakagaṇanā; yamakadiguṇā pucchā, pucchādiguṇā ca atthā veditabbā. Ayaṃ panettha purimesu tīsu vāresu viseso. Okāsavāre ‘‘yattha tatthā’’ti avatvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yato tato"
      },
      "ti nissakkavacanena desanā katā. Sesaṃ tādisameva."
    ],
    "innerText": "Tattha anulomanaye ‘‘yassa anuseti, yattha anuseti, yassa yattha anusetī’’ti puggalokāsatadubhayavasena tayo antaravārā honti. Tesu paṭhame puggalavāre ‘‘yassa kāmarāgānusayo anuseti, tassa paṭighānusayo anuseti; yassa vā pana paṭighānusayo anuseti, tassa kāmarāgānusayo anuseti; yassa kāmarāgānusayo anuseti, tassa mānānusayo, diṭṭhānusayo, vicikicchānusayo, bhavarāgānusayo, avijjānusayo anuseti. Yassa vā pana avijjānusayo anuseti, tassa kāmarāgānusayo anusetī’’ti kāmarāgānusayamūlakāni cha yamakāni. Puna agahitaggahaṇavasena paṭighānusayamūlakāni pañca, mānānusayamūlakāni cattāri, diṭṭhānusayamūlakāni tīṇi, vicikicchānusayamūlakāni dve, bhavarāgānusayamūlakaṃ ekanti evaṃ sabbānipi ekamūlakāni ekavīsati. Puna ‘‘yassa kāmarāgānusayo ca paṭighānusayo ca anusentī’’ti evaṃ āgatāni dukamūlakāni pañca, tikamūlakāni cattāri, catukkamūlakāni tīṇi, pañcakamūlakāni dve, chakkamūlakaṃ ekanti aparānipi pannarasa honti. Tāni purimehi ekavīsatiyā saddhiṃ chattiṃsāti puggalavāre chattiṃsa yamakāni. Tathā okāsavāre, tathā puggalokāsavāreti sabbānipi anulomanaye aṭṭhasataṃ yamakāni. Tathā paṭilomanayeti anusayavāre soḷasādhikāni dve yamakasatāni, tato diguṇā pucchā, tato diguṇā atthā ca veditabbā. Yathā cettha, evaṃ sānusayavāro, pajahanavāro, pariññāvāro, pahīnavāro, uppajjanavāroti imesampi pañcannaṃ vārānaṃ, ekekasmiṃ yamakagaṇanā; yamakadiguṇā pucchā, pucchādiguṇā ca atthā veditabbā. Ayaṃ panettha purimesu tīsu vāresu viseso. Okāsavāre ‘‘yattha tatthā’’ti avatvā yato tatoti nissakkavacanena desanā katā. Sesaṃ tādisameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yo panāyaṃ sabbapacchimo dhātuvāro nāma, so pucchāvāro, vissajjanāvāroti dvidhā ṭhito. Tassa pucchāvāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmadhātuyā cutassa kāmadhātuṃ upapajjantassā"
      },
      "ti vatvā ‘‘kāmadhātuṃ vā pana upapajjantassa kāmadhātuyā cutassā’’ti na vuttaṃ. Kiṃ kāraṇā? Atthavisesābhāvato. Dvepi hi etā pucchā ekatthāyeva, tasmā ekekasmā yamakā ekekameva pucchaṃ pucchitvā sabbapucchāvasāne pucchānukkameneva ‘‘kāmadhātuyā ",
      " cutassa kāmadhātuṃ upapajjantassa kassaci satta anusayā anusentī’’tiādinā nayena vissajjanaṃ kataṃ."
    ],
    "innerText": "Yo panāyaṃ sabbapacchimo dhātuvāro nāma, so pucchāvāro, vissajjanāvāroti dvidhā ṭhito. Tassa pucchāvāre kāmadhātuyā cutassa kāmadhātuṃ upapajjantassāti vatvā ‘‘kāmadhātuṃ vā pana upapajjantassa kāmadhātuyā cutassā’’ti na vuttaṃ. Kiṃ kāraṇā? Atthavisesābhāvato. Dvepi hi etā pucchā ekatthāyeva, tasmā ekekasmā yamakā ekekameva pucchaṃ pucchitvā sabbapucchāvasāne pucchānukkameneva ‘‘kāmadhātuyā cutassa kāmadhātuṃ upapajjantassa kassaci satta anusayā anusentī’’tiādinā nayena vissajjanaṃ kataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ‘‘kāmadhātuyā cutassa kāmadhātuṃ upapajjantassa, rūpadhātuṃ, arūpadhātuṃ, nakāmadhātuṃ, narūpadhātuṃ naarūpadhātuṃ ",
      ", upapajjantassā’’ti cha suddhikapucchā; ‘‘nakāmadhātuṃ, naarūpadhātuṃ, narūpadhātuṃ; naarūpadhātuṃ, nakāmadhātuṃ, narūpadhātuṃ, upapajjantassā’’ti tisso missakā pucchā cāti kāmadhātumūlakā nava anulomapucchā honti. Tathā rūpadhātumūlakā nava, arūpadhātumūlakā navāti sattavīsati anulomapucchā honti. Tathā nakāmadhātunarūpadhātunaarūpadhātumūlakā sattavīsati paṭilomapucchā. Puna ‘‘nakāmadhātuyā, naarūpadhātuyā, narūpadhātuyā, naarūpadhātuyā, nakāmadhātuyā, naarūpadhātuyā’’ti sattavīsati dukamūlakā pucchāti sabbāpi sampiṇḍitā ekāsīti pucchā honti. Tāsaṃ vasenettha vissajjanaṃ katanti idaṃ dhātuvāre pāḷivavatthānaṃ. Evaṃ tāva sakalepi anusayayamake pāḷivavatthānametaṃ veditabbaṃ."
    ],
    "innerText": "Tattha ‘‘kāmadhātuyā cutassa kāmadhātuṃ upapajjantassa, rūpadhātuṃ, arūpadhātuṃ, nakāmadhātuṃ, narūpadhātuṃ naarūpadhātuṃ , upapajjantassā’’ti cha suddhikapucchā; ‘‘nakāmadhātuṃ, naarūpadhātuṃ, narūpadhātuṃ; naarūpadhātuṃ, nakāmadhātuṃ, narūpadhātuṃ, upapajjantassā’’ti tisso missakā pucchā cāti kāmadhātumūlakā nava anulomapucchā honti. Tathā rūpadhātumūlakā nava, arūpadhātumūlakā navāti sattavīsati anulomapucchā honti. Tathā nakāmadhātunarūpadhātunaarūpadhātumūlakā sattavīsati paṭilomapucchā. Puna ‘‘nakāmadhātuyā, naarūpadhātuyā, narūpadhātuyā, naarūpadhātuyā, nakāmadhātuyā, naarūpadhātuyā’’ti sattavīsati dukamūlakā pucchāti sabbāpi sampiṇḍitā ekāsīti pucchā honti. Tāsaṃ vasenettha vissajjanaṃ katanti idaṃ dhātuvāre pāḷivavatthānaṃ. Evaṃ tāva sakalepi anusayayamake pāḷivavatthānametaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ādito paṭṭhāya panettha yaṃ yaṃ anuttānaṃ, tattha tattha ayaṃ vinicchayakathā – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anusayā"
      },
      "ti kenaṭṭhena anusayā? Anusayanaṭṭhena. Ko esa anusayanaṭṭho nāmāti? Appahīnaṭṭho. Ete hi appahīnaṭṭhena tassa tassa santāne anusenti nāma, tasmā anusayāti vuccanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anusentī"
      },
      "ti anurūpaṃ kāraṇaṃ labhitvā uppajjantīti attho. Athāpi siyā – anusayanaṭṭho nāma appahīnākāro. Appahīnākāro ca uppajjatīti vattuṃ na yujjati, tasmā na anusayā uppajjantīti ",
      ". Tatridaṃ paṭivacanaṃ – appahīnākāro anusayo, anusayoti pana appahīnaṭṭhena thāmagatakileso vuccati. So cittasampayutto sārammaṇo sappaccayaṭṭhena sahetuko ekantākusalo atītopi hoti anāgatopi paccuppannopi, tasmā uppajjatīti vattuṃ yujjati."
    ],
    "innerText": "Ādito paṭṭhāya panettha yaṃ yaṃ anuttānaṃ, tattha tattha ayaṃ vinicchayakathā – anusayāti kenaṭṭhena anusayā? Anusayanaṭṭhena. Ko esa anusayanaṭṭho nāmāti? Appahīnaṭṭho. Ete hi appahīnaṭṭhena tassa tassa santāne anusenti nāma, tasmā anusayāti vuccanti. Anusentīti anurūpaṃ kāraṇaṃ labhitvā uppajjantīti attho. Athāpi siyā – anusayanaṭṭho nāma appahīnākāro. Appahīnākāro ca uppajjatīti vattuṃ na yujjati, tasmā na anusayā uppajjantīti . Tatridaṃ paṭivacanaṃ – appahīnākāro anusayo, anusayoti pana appahīnaṭṭhena thāmagatakileso vuccati. So cittasampayutto sārammaṇo sappaccayaṭṭhena sahetuko ekantākusalo atītopi hoti anāgatopi paccuppannopi, tasmā uppajjatīti vattuṃ yujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatridaṃ pamāṇaṃ – abhidhamme tāva kathāvatthusmiṃ (kathā. 554 ādayo) ‘‘anusayā abyākatā, anusayā ahetukā, anusayā cittavippayuttā’’ti sabbe vādā paṭisedhitā. Paṭisambhidāmagge (paṭi. ma. 3.21) ‘‘paccuppanne kilese pajahatī’’ti pucchaṃ katvā anusayānaṃ paccuppannabhāvassa atthitāya ‘‘thāmagatānusayaṃ pajahatī’’ti ",
      " vuttaṃ. Dhammasaṅgahe pana mohassa padabhājane ‘‘avijjānusayo avijjāpariyuṭṭhānaṃ avijjālaṅgī moho akusalamūlaṃ, ayaṃ tasmiṃ samaye moho hotī’’ti ",
      " (dha. sa. 390) akusalacittena saddhiṃ avijjānusayassa uppannabhāvo vutto. Imasmiṃyeva anusayayamake sattannaṃ mahāvārānaṃ aññatarasmiṃ uppajjanavāre ‘‘yassa kāmarāgānusayo uppajjati, tassa paṭighānusayo uppajjatī’’tiādi vuttaṃ. Tasmā ‘‘anusentīti anurūpaṃ kāraṇaṃ labhitvā uppajjantī’’ti yaṃ vuttaṃ, taṃ iminā tantippamāṇena suvuttanti veditabbaṃ. Yampi ‘‘cittasampayutto sārammaṇo’’tiādi vuttaṃ, tampi suvuttameva. Anusayo hi nāmesa parinipphanno cittasampayutto akusaladhammoti niṭṭhamettha gantabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmarāgānusayo"
      },
      "tiādīsu kāmarāgo ca so appahīnaṭṭhena anusayo cāti kāmarāgānusayo. Sesapadesupi eseva nayo."
    ],
    "innerText": "Tatridaṃ pamāṇaṃ – abhidhamme tāva kathāvatthusmiṃ (kathā. 554 ādayo) ‘‘anusayā abyākatā, anusayā ahetukā, anusayā cittavippayuttā’’ti sabbe vādā paṭisedhitā. Paṭisambhidāmagge (paṭi. ma. 3.21) ‘‘paccuppanne kilese pajahatī’’ti pucchaṃ katvā anusayānaṃ paccuppannabhāvassa atthitāya ‘‘thāmagatānusayaṃ pajahatī’’ti vuttaṃ. Dhammasaṅgahe pana mohassa padabhājane ‘‘avijjānusayo avijjāpariyuṭṭhānaṃ avijjālaṅgī moho akusalamūlaṃ, ayaṃ tasmiṃ samaye moho hotī’’ti (dha. sa. 390) akusalacittena saddhiṃ avijjānusayassa uppannabhāvo vutto. Imasmiṃyeva anusayayamake sattannaṃ mahāvārānaṃ aññatarasmiṃ uppajjanavāre ‘‘yassa kāmarāgānusayo uppajjati, tassa paṭighānusayo uppajjatī’’tiādi vuttaṃ. Tasmā ‘‘anusentīti anurūpaṃ kāraṇaṃ labhitvā uppajjantī’’ti yaṃ vuttaṃ, taṃ iminā tantippamāṇena suvuttanti veditabbaṃ. Yampi ‘‘cittasampayutto sārammaṇo’’tiādi vuttaṃ, tampi suvuttameva. Anusayo hi nāmesa parinipphanno cittasampayutto akusaladhammoti niṭṭhamettha gantabbaṃ. Kāmarāgānusayotiādīsu kāmarāgo ca so appahīnaṭṭhena anusayo cāti kāmarāgānusayo. Sesapadesupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paricchedaparicchinnuddesavāravaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Uppattiṭṭhānavāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Idāni tesaṃ uppattiṭṭhānaṃ pakāsetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kattha kāmarāgānusayo anusetī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmadhātuyā dvīsu vedanāsū"
      },
      "ti kāmāvacarabhūmiyaṃ sukhāya ca upekkhāya cāti dvīsu vedanāsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ettha kāmarāgānusayo anusetī"
      },
      "ti imāsu dvīsu vedanāsu uppajjati. So panesa akusalavedanāsu sahajātavasena ārammaṇavasena cāti dvīhākārehi anuseti. Akusalāya sukhāya ",
      " vedanāya ceva upekkhāya vedanāya ca sahajātopi hutvā uppajjati. Tā vedanā ārammaṇaṃ katvāpi uppajjatīti attho. Avasesā pana kāmāvacarakusalavipākakiriyavedanā ārammaṇameva katvā uppajjati. Kāmadhātuyā dvīsu vedanāsu anusayamāno cesa tāhi vedanāhi sampayuttesu saññāsaṅkhāraviññāṇesupi anusetiyeva. Na hi sakkā vedanāsu anusayamānena taṃsampayuttehi saññādīhi saddhiṃ asahajātena vā bhavituṃ, taṃsampayutte vā saññādayo ārammaṇaṃ akatvā uppajjituṃ. Evaṃ santepi ",
      " pana yasmā imā dve vedanāva sātasantasukhattā assādaṭṭhena kāmarāgānusayassa uppattiyā sesasampayuttadhammesu padhānā, tasmā ‘‘dvīsu vedanāsu ettha kāmarāgānusayo anusetī’’ti vuttaṃ, oḷārikavasena hi bodhaneyye sukhaṃ bodhetunti."
    ],
    "innerText": "2. Idāni tesaṃ uppattiṭṭhānaṃ pakāsetuṃ kattha kāmarāgānusayo anusetītiādimāha. Tattha kāmadhātuyā dvīsu vedanāsūti kāmāvacarabhūmiyaṃ sukhāya ca upekkhāya cāti dvīsu vedanāsu. Ettha kāmarāgānusayo anusetīti imāsu dvīsu vedanāsu uppajjati. So panesa akusalavedanāsu sahajātavasena ārammaṇavasena cāti dvīhākārehi anuseti. Akusalāya sukhāya vedanāya ceva upekkhāya vedanāya ca sahajātopi hutvā uppajjati. Tā vedanā ārammaṇaṃ katvāpi uppajjatīti attho. Avasesā pana kāmāvacarakusalavipākakiriyavedanā ārammaṇameva katvā uppajjati. Kāmadhātuyā dvīsu vedanāsu anusayamāno cesa tāhi vedanāhi sampayuttesu saññāsaṅkhāraviññāṇesupi anusetiyeva. Na hi sakkā vedanāsu anusayamānena taṃsampayuttehi saññādīhi saddhiṃ asahajātena vā bhavituṃ, taṃsampayutte vā saññādayo ārammaṇaṃ akatvā uppajjituṃ. Evaṃ santepi pana yasmā imā dve vedanāva sātasantasukhattā assādaṭṭhena kāmarāgānusayassa uppattiyā sesasampayuttadhammesu padhānā, tasmā ‘‘dvīsu vedanāsu ettha kāmarāgānusayo anusetī’’ti vuttaṃ, oḷārikavasena hi bodhaneyye sukhaṃ bodhetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nanu cesa ārammaṇavasena anusayamāno na kevalaṃ ",
      " imāsu dvīsu vedanāsu ceva vedanāsampayuttadhammesu ca anuseti, iṭṭhesu pana rūpādīsupi anusetiyeva. Vuttampi cetaṃ vibhaṅgappakaraṇe (vibha. 816) ‘‘yaṃ loke piyarūpaṃ sātarūpaṃ, ettha sattānaṃ kāmarāgānusayo anusetī’’ti imasmimpi pakaraṇe anusayavārassa paṭilomanaye vuttaṃ. ‘‘Yattha kāmarāgānusayo nānuseti tattha diṭṭhānusayo nānusetīti dukkhāya vedanāya rūpadhātuyā arūpadhātuyā ettha kāmarāgānusayo nānuseti, no ca tattha diṭṭhānusayo nānuseti. Apariyāpanne ettha kāmarāgānusayo ca nānuseti, diṭṭhānusayo ca nānusetī’’ti. Ettha hi dukkhavedanāya ceva rūpadhātuādīsu ca nānusetīti vuttattā sasampayuttadhammaṃ dukkhavedanaṃ saokāse rūpārūpāvacaradhamme nava ca, lokuttaradhamme ṭhapetvā avasesesu rūpasaddagandharasaphoṭṭhabbesu anusetīti vuttaṃ hoti. Taṃ idha kasmā na vuttanti? Anoḷārikattā. Heṭṭhā vuttanayena hi vedanānaññeva oḷārikattā imesaṃ pana anoḷārikattā etesu rūpādīsu anusetīti na vuttaṃ, atthato pana labbhati. Tasmā etesupi kāmarāgānusayo anusetiyevāti veditabbo. Na hi satthā sabbaṃ sabbattha katheti. Bodhaneyyasattānaṃ pana vasena katthaci yaṃ labbhati, taṃ sabbaṃ katheti, katthaci na katheti. Tathā hi anena katthaci diṭṭhānusayo anusetīti pucchitvā ‘‘sabbasakkāyapariyāpannesu dhammesu ettha diṭṭhānusayo anusetī’’ti yaṃ labbhati taṃ sabbaṃ kathitaṃ. Aparasmiṃ ṭhāne vissajjantena ‘‘rūpadhātuyā arūpadhātuyā ettha vicikicchānusayo ca mānānusayo ca diṭṭhānusayo ca anusenti, kāmadhātuyā dvīsu vedanāsu ettha vicikicchānusayo ca kāmarāgānusayo ca mānānusayo ca diṭṭhānusayo ca anusenti, dukkhāya ",
      " vedanāya ettha vicikicchānusayo ca paṭighānusayo ca diṭṭhānusayo ca avijjānusayo ",
      " ca anusentī’’ti yaṃ labbhati taṃ sabbaṃ akathetvā rūpadhātuarūpadhātūhi saddhiṃ tisso vedanāva kathitā. Vedanāsampayuttā pana arūpadhammā, sabbañca rūpaṃ na ",
      " kathitaṃ. Kiñcāpi na kathitaṃ, diṭṭhānusayo panettha anusetiyeva. Evameva kiñcāpi idha rūpādiiṭṭhārammaṇaṃ na kathitaṃ, kāmarāgānusayo panettha anusetiyevāti. Evaṃ tāva kāmarāgānusayassa anusayanaṭṭhānaṃ veditabbaṃ."
    ],
    "innerText": "Nanu cesa ārammaṇavasena anusayamāno na kevalaṃ imāsu dvīsu vedanāsu ceva vedanāsampayuttadhammesu ca anuseti, iṭṭhesu pana rūpādīsupi anusetiyeva. Vuttampi cetaṃ vibhaṅgappakaraṇe (vibha. 816) ‘‘yaṃ loke piyarūpaṃ sātarūpaṃ, ettha sattānaṃ kāmarāgānusayo anusetī’’ti imasmimpi pakaraṇe anusayavārassa paṭilomanaye vuttaṃ. ‘‘Yattha kāmarāgānusayo nānuseti tattha diṭṭhānusayo nānusetīti dukkhāya vedanāya rūpadhātuyā arūpadhātuyā ettha kāmarāgānusayo nānuseti, no ca tattha diṭṭhānusayo nānuseti. Apariyāpanne ettha kāmarāgānusayo ca nānuseti, diṭṭhānusayo ca nānusetī’’ti. Ettha hi dukkhavedanāya ceva rūpadhātuādīsu ca nānusetīti vuttattā sasampayuttadhammaṃ dukkhavedanaṃ saokāse rūpārūpāvacaradhamme nava ca, lokuttaradhamme ṭhapetvā avasesesu rūpasaddagandharasaphoṭṭhabbesu anusetīti vuttaṃ hoti. Taṃ idha kasmā na vuttanti? Anoḷārikattā. Heṭṭhā vuttanayena hi vedanānaññeva oḷārikattā imesaṃ pana anoḷārikattā etesu rūpādīsu anusetīti na vuttaṃ, atthato pana labbhati. Tasmā etesupi kāmarāgānusayo anusetiyevāti veditabbo. Na hi satthā sabbaṃ sabbattha katheti. Bodhaneyyasattānaṃ pana vasena katthaci yaṃ labbhati, taṃ sabbaṃ katheti, katthaci na katheti. Tathā hi anena katthaci diṭṭhānusayo anusetīti pucchitvā ‘‘sabbasakkāyapariyāpannesu dhammesu ettha diṭṭhānusayo anusetī’’ti yaṃ labbhati taṃ sabbaṃ kathitaṃ. Aparasmiṃ ṭhāne vissajjantena ‘‘rūpadhātuyā arūpadhātuyā ettha vicikicchānusayo ca mānānusayo ca diṭṭhānusayo ca anusenti, kāmadhātuyā dvīsu vedanāsu ettha vicikicchānusayo ca kāmarāgānusayo ca mānānusayo ca diṭṭhānusayo ca anusenti, dukkhāya vedanāya ettha vicikicchānusayo ca paṭighānusayo ca diṭṭhānusayo ca avijjānusayo ca anusentī’’ti yaṃ labbhati taṃ sabbaṃ akathetvā rūpadhātuarūpadhātūhi saddhiṃ tisso vedanāva kathitā. Vedanāsampayuttā pana arūpadhammā, sabbañca rūpaṃ na kathitaṃ. Kiñcāpi na kathitaṃ, diṭṭhānusayo panettha anusetiyeva. Evameva kiñcāpi idha rūpādiiṭṭhārammaṇaṃ na kathitaṃ, kāmarāgānusayo panettha anusetiyevāti. Evaṃ tāva kāmarāgānusayassa anusayanaṭṭhānaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paṭighānusayassa pana ‘‘dukkhāya vedanāyā’’ti vacanato dve domanassavedanā kāyaviññāṇasampayuttā dukkhavedanāti tisso vedanā anusayanaṭṭhānaṃ. So panesa domanassavedanāsu sahajātavasena ārammaṇavasena cāti dvīhākārehi anuseti. Avasesadukkhavedanāya pana ārammaṇavaseneva anuseti. Tāsu vedanāsu anusayamāno cesa tāhi sampayuttesu saññākkhandhādīsupi anusetiyeva. Yāya hi vedanāya esa sahajāto, taṃsampayuttehi saññādīhipi sahajātova. Yā ca vedanā ārammaṇaṃ karoti, tāhi sampayutte saññādayopi karotiyeva. Evaṃ santepi pana yasmā dukkhavedanāva asātadukkhavedayitattā nirassādaṭṭhena paṭighānusayassa uppattiyā sesasampayuttadhammesu adhikā; tasmā ‘‘dukkhāya vedanāya ettha paṭighānusayo anusetī’’ti vuttaṃ, oḷārikavasena hi bodhaneyye sukhaṃ bodhetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nanu cesa ārammaṇavasena anusayamāno na kevalaṃ dukkhavedanāya ceva taṃsampayuttadhammesu ca anuseti, aniṭṭhesu pana rūpādīsupi anusetiyeva? Vuttampi cetaṃ vibhaṅgappakaraṇe (vibha. 816) ‘‘yaṃ loke appiyarūpaṃ asātarūpaṃ, ettha sattānaṃ paṭighānusayo anusetī’’ti imasmimpi pakaraṇe anusayavārassa paṭilomanaye vuttaṃ – ‘‘kāmadhātuyā dvīsu vedanāsu ettha paṭighānusayo nānuseti, no ca tattha kāmarāgānusayo nānuseti. Rūpadhātuyā arūpadhātuyā apariyāpanne ettha paṭighānusayo ca nānuseti, kāmarāgānusayo ca nānusetī’’ti. Ettha hi dvīsu kāmāvacaravedanāsu ceva rūpadhātuādīsu ca nānusetīti vuttattā sasampayuttadhammā dve vedanā saokāse rūpārūpāvacaradhamme nava ca, lokuttaradhamme ṭhapetvā ",
      " avasesesu rūpādīsu anusetīti vuttaṃ hoti ",
      ". Taṃ idha kasmā na vuttanti? Anoḷārikattā. Heṭṭhā vuttanayena hi dukkhavedanāya eva oḷārikattā imesaṃ pana anoḷārikattā etesu rūpādīsu anusetīti na vuttaṃ. Atthato pana labbhati, tasmā etesupi paṭighānusayo anusetiyevāti veditabbo."
    ],
    "innerText": "Nanu cesa ārammaṇavasena anusayamāno na kevalaṃ dukkhavedanāya ceva taṃsampayuttadhammesu ca anuseti, aniṭṭhesu pana rūpādīsupi anusetiyeva? Vuttampi cetaṃ vibhaṅgappakaraṇe (vibha. 816) ‘‘yaṃ loke appiyarūpaṃ asātarūpaṃ, ettha sattānaṃ paṭighānusayo anusetī’’ti imasmimpi pakaraṇe anusayavārassa paṭilomanaye vuttaṃ – ‘‘kāmadhātuyā dvīsu vedanāsu ettha paṭighānusayo nānuseti, no ca tattha kāmarāgānusayo nānuseti. Rūpadhātuyā arūpadhātuyā apariyāpanne ettha paṭighānusayo ca nānuseti, kāmarāgānusayo ca nānusetī’’ti. Ettha hi dvīsu kāmāvacaravedanāsu ceva rūpadhātuādīsu ca nānusetīti vuttattā sasampayuttadhammā dve vedanā saokāse rūpārūpāvacaradhamme nava ca, lokuttaradhamme ṭhapetvā avasesesu rūpādīsu anusetīti vuttaṃ hoti . Taṃ idha kasmā na vuttanti? Anoḷārikattā. Heṭṭhā vuttanayena hi dukkhavedanāya eva oḷārikattā imesaṃ pana anoḷārikattā etesu rūpādīsu anusetīti na vuttaṃ. Atthato pana labbhati, tasmā etesupi paṭighānusayo anusetiyevāti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kiṃ ",
      " pana itarā dve vedanā iṭṭhārammaṇaṃ vā paṭighassa ārammaṇaṃ na hontīti? No na honti. Parihīnajjhānassa vippaṭisāravasena sasampayuttadhammā tā vedanā ārabbha domanassaṃ uppajjati. Iṭṭhārammaṇassa ca paṭiladdhassa vipariṇāmaṃ vā appaṭiladdhassa appaṭilābhaṃ vā samanussaratopi domanassaṃ uppajjati. Domanassamattameva pana taṃ hoti, na paṭighānusayo. Paṭighānusayo hi aniṭṭhārammaṇe paṭihaññanavasena uppanno thāmagato kileso, tasmā ettha domanassena saddhiṃ paṭigho uppannopi attano paṭighakiccaṃ akaraṇabhāvena eva paṭighānusayo na hoti abbohārikattaṃ gacchati. Yathā hi pāṇātipātacetanāya saddhiṃ uppannopi byāpādo manokammaṃ nāma na hoti abbohārikattaṃ gacchati, evaṃ paṭighānusayo na hoti, abbohārikattaṃ gacchati. Vuttampi cetaṃ ekaccaṃ iṭṭhārammaṇaṃ nekkhammasitampi vā domanassaṃ sandhāya ‘‘yaṃ evarūpaṃ domanassaṃ paṭighaṃ tena pajahati na tattha paṭighānusayo anusetī’’ti (ma. ni. 1.465). Evaṃ paṭighānusayassa anusayanaṭṭhānaṃ veditabbaṃ."
    ],
    "innerText": "Kiṃ pana itarā dve vedanā iṭṭhārammaṇaṃ vā paṭighassa ārammaṇaṃ na hontīti? No na honti. Parihīnajjhānassa vippaṭisāravasena sasampayuttadhammā tā vedanā ārabbha domanassaṃ uppajjati. Iṭṭhārammaṇassa ca paṭiladdhassa vipariṇāmaṃ vā appaṭiladdhassa appaṭilābhaṃ vā samanussaratopi domanassaṃ uppajjati. Domanassamattameva pana taṃ hoti, na paṭighānusayo. Paṭighānusayo hi aniṭṭhārammaṇe paṭihaññanavasena uppanno thāmagato kileso, tasmā ettha domanassena saddhiṃ paṭigho uppannopi attano paṭighakiccaṃ akaraṇabhāvena eva paṭighānusayo na hoti abbohārikattaṃ gacchati. Yathā hi pāṇātipātacetanāya saddhiṃ uppannopi byāpādo manokammaṃ nāma na hoti abbohārikattaṃ gacchati, evaṃ paṭighānusayo na hoti, abbohārikattaṃ gacchati. Vuttampi cetaṃ ekaccaṃ iṭṭhārammaṇaṃ nekkhammasitampi vā domanassaṃ sandhāya ‘‘yaṃ evarūpaṃ domanassaṃ paṭighaṃ tena pajahati na tattha paṭighānusayo anusetī’’ti (ma. ni. 1.465). Evaṃ paṭighānusayassa anusayanaṭṭhānaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Mānānusayassa pana ‘‘kāmadhātuyā dvīsu vedanāsū’’tiādivacanato dve kāmāvacaravedanā rūpārūpadhātuyo cāti idaṃ tividhaṃ anusayanaṭṭhānaṃ. Tassa akusalāsu vedanāsu kāmarāgānusayassa viya sahajātānusayatā veditabbā. Sasampayuttadhammāsu pana sabbāsupi kāmāvacarāsu sukhaadukkhamasukhavedanāsu rūpārūpadhātūsu ca ārammaṇavaseneva anuseti. Anusayavārassa pana paṭilomanaye ‘‘dukkhāya vedanāya apariyāpanne ettha kāmarāgānusayo ca nānuseti, mānānusayo ca nānusetī’’ti vuttattā ṭhapetvā dukkhavedanañceva navavidhaṃ lokuttaradhammañca sesarūpārūpadhammesupi ",
      " ayaṃ anusetiyevāti. Evaṃ mānānusayassa anusayanaṭṭhānaṃ veditabbaṃ."
    ],
    "innerText": "Mānānusayassa pana ‘‘kāmadhātuyā dvīsu vedanāsū’’tiādivacanato dve kāmāvacaravedanā rūpārūpadhātuyo cāti idaṃ tividhaṃ anusayanaṭṭhānaṃ. Tassa akusalāsu vedanāsu kāmarāgānusayassa viya sahajātānusayatā veditabbā. Sasampayuttadhammāsu pana sabbāsupi kāmāvacarāsu sukhaadukkhamasukhavedanāsu rūpārūpadhātūsu ca ārammaṇavaseneva anuseti. Anusayavārassa pana paṭilomanaye ‘‘dukkhāya vedanāya apariyāpanne ettha kāmarāgānusayo ca nānuseti, mānānusayo ca nānusetī’’ti vuttattā ṭhapetvā dukkhavedanañceva navavidhaṃ lokuttaradhammañca sesarūpārūpadhammesupi ayaṃ anusetiyevāti. Evaṃ mānānusayassa anusayanaṭṭhānaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Diṭṭhānusayavicikicchānusayā ",
      " pana kevalaṃ lokuttaradhammesveva nānusenti. Tebhūmakesu pana sabbesupi anusentiyeva. Tena vuttaṃ – ‘‘sabbasakkāyapariyāpannesu dhammesu ettha diṭṭhānusayo anuseti, ettha vicikicchānusayo anusetī’’ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbasakkāyapariyāpannesū"
      },
      "ti saṃsāravaṭṭanissitaṭṭhena sakkāyapariyāpannesu sabbadhammesūti attho. Tattha panete pañcasu cittuppādesu sahajātānusayanavasena anusenti. Te vā pana pañca cittuppāde aññe vā tebhūmakadhamme ārabbha pavattikāle ārammaṇānusayanavasena anusentīti. Evaṃ diṭṭhānusayavicikicchānusayānaṃ anusayanaṭṭhānaṃ veditabbaṃ."
    ],
    "innerText": "Diṭṭhānusayavicikicchānusayā pana kevalaṃ lokuttaradhammesveva nānusenti. Tebhūmakesu pana sabbesupi anusentiyeva. Tena vuttaṃ – ‘‘sabbasakkāyapariyāpannesu dhammesu ettha diṭṭhānusayo anuseti, ettha vicikicchānusayo anusetī’’ti. Tattha sabbasakkāyapariyāpannesūti saṃsāravaṭṭanissitaṭṭhena sakkāyapariyāpannesu sabbadhammesūti attho. Tattha panete pañcasu cittuppādesu sahajātānusayanavasena anusenti. Te vā pana pañca cittuppāde aññe vā tebhūmakadhamme ārabbha pavattikāle ārammaṇānusayanavasena anusentīti. Evaṃ diṭṭhānusayavicikicchānusayānaṃ anusayanaṭṭhānaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhavarāgānusayo ",
      " pana kiñcāpi diṭṭhivippayuttesu catūsu cittesu uppajjanato sahajātānusayanavasena ‘‘kāmadhātuyā dvīsu vedanāsu anusetī’’ti vattabbo bhaveyya. Kāmadhātuyaṃ panesa dvīhi vedanāhi saddhiṃ uppajjamānopi rūpārūpāvacaradhammameva paṭilabhati. Kāmadhātuyā pariyāpannaṃ ekadhammampi ārammaṇaṃ na karoti, tasmā ārammaṇānusayanavasena niyamaṃ katvā ‘‘rūpadhātuyā arūpadhātuyā ettha bhavarāgānusayo anusetī’’ti vuttaṃ. Apica rāgo nāmesa kāmarāgabhavarāgavasena duvidho. Tattha kāmarāgo kāmadhātuyā dvīsu vedanāsu anusetīti vutto. Sace pana bhavarāgopi kāmarāgo viya evaṃ vucceyya, kāmarāgena saddhiṃ desanā saṃkiṇṇā viya bhaveyyāti rāgakilesaṃ dvidhā bhinditvā kāmarāgato bhavarāgassa visesadassanatthampi evaṃ desanā katāti. Evaṃ bhavarāgānusayassa anusayanaṭṭhānaṃ veditabbaṃ."
    ],
    "innerText": "Bhavarāgānusayo pana kiñcāpi diṭṭhivippayuttesu catūsu cittesu uppajjanato sahajātānusayanavasena ‘‘kāmadhātuyā dvīsu vedanāsu anusetī’’ti vattabbo bhaveyya. Kāmadhātuyaṃ panesa dvīhi vedanāhi saddhiṃ uppajjamānopi rūpārūpāvacaradhammameva paṭilabhati. Kāmadhātuyā pariyāpannaṃ ekadhammampi ārammaṇaṃ na karoti, tasmā ārammaṇānusayanavasena niyamaṃ katvā ‘‘rūpadhātuyā arūpadhātuyā ettha bhavarāgānusayo anusetī’’ti vuttaṃ. Apica rāgo nāmesa kāmarāgabhavarāgavasena duvidho. Tattha kāmarāgo kāmadhātuyā dvīsu vedanāsu anusetīti vutto. Sace pana bhavarāgopi kāmarāgo viya evaṃ vucceyya, kāmarāgena saddhiṃ desanā saṃkiṇṇā viya bhaveyyāti rāgakilesaṃ dvidhā bhinditvā kāmarāgato bhavarāgassa visesadassanatthampi evaṃ desanā katāti. Evaṃ bhavarāgānusayassa anusayanaṭṭhānaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Avijjānusayo pana sabbesupi tebhūmakadhammesu anuseti. Tena vuttaṃ ‘‘sabbasakkāyapariyāpannesu dhammesu ettha avijjānusayo anusetī’’ti. Tassa dvādasasu cittuppādesu sahajātānusayatā veditabbā. Ārammaṇakaraṇavasena pana na kiñci tebhūmakadhammaṃ ārabbha na pavattatīti. Evaṃ avijjānusayassa anusayanaṭṭhānaṃ veditabbaṃ. Ayaṃ ",
      " tāva paricchedavāraparicchinnuddesavārauppattiṭṭhānavāresu vinicchayakathā."
    ],
    "innerText": "Avijjānusayo pana sabbesupi tebhūmakadhammesu anuseti. Tena vuttaṃ ‘‘sabbasakkāyapariyāpannesu dhammesu ettha avijjānusayo anusetī’’ti. Tassa dvādasasu cittuppādesu sahajātānusayatā veditabbā. Ārammaṇakaraṇavasena pana na kiñci tebhūmakadhammaṃ ārabbha na pavattatīti. Evaṃ avijjānusayassa anusayanaṭṭhānaṃ veditabbaṃ. Ayaṃ tāva paricchedavāraparicchinnuddesavārauppattiṭṭhānavāresu vinicchayakathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Uppattiṭṭhānavāravaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Mahāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Anusayavāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Sattannaṃ ",
      " pana mahāvārānaṃ paṭhame anusayavāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yassa kāmarāgānusayo anuseti, tassa paṭighānusayo anusetī"
      },
      "ti ettha yadetaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āmantā’’"
      },
      "ti paṭivacanaṃ dinnaṃ, taṃ duddinnaṃ viya khāyati. Kasmā? Kāmarāgapaṭighānaṃ ekakkhaṇe anuppattito. Yathā hi ‘‘yassa manāyatanaṃ uppajjati, tassa dhammāyatanaṃ uppajjatīti ‘āmantā’, assāsapassāsānaṃ uppādakkhaṇe tesaṃ kāyasaṅkhāro ",
      " ca uppajjati, vacīsaṅkhāro ca uppajjatī’’tiādīsu manāyatanadhammāyatanāni kāyasaṅkhāravacīsaṅkhārā ca ekakkhaṇe uppajjanti, na tathā kāmarāgapaṭighā. Kāmarāgo hi aṭṭhasu lobhasahagatacittuppādesu uppajjati. Paṭigho dvīsu domanassasahagatesūti, natthi nesaṃ ekakkhaṇe uppatti; tasmā ettha ‘no’ti paṭisedho kattabbo siyā. Taṃ akatvā pana ‘āmantā’ti paṭivacanassa dinnattā heṭṭhāyamakesu viya ettha khaṇapaccuppannavasena vattamānavohāraṃ aggahetvā aññathā gahetabbo."
    ],
    "innerText": "3. Sattannaṃ pana mahāvārānaṃ paṭhame anusayavāre yassa kāmarāgānusayo anuseti, tassa paṭighānusayo anusetīti ettha yadetaṃ ‘‘āmantā’’ti paṭivacanaṃ dinnaṃ, taṃ duddinnaṃ viya khāyati. Kasmā? Kāmarāgapaṭighānaṃ ekakkhaṇe anuppattito. Yathā hi ‘‘yassa manāyatanaṃ uppajjati, tassa dhammāyatanaṃ uppajjatīti ‘āmantā’, assāsapassāsānaṃ uppādakkhaṇe tesaṃ kāyasaṅkhāro ca uppajjati, vacīsaṅkhāro ca uppajjatī’’tiādīsu manāyatanadhammāyatanāni kāyasaṅkhāravacīsaṅkhārā ca ekakkhaṇe uppajjanti, na tathā kāmarāgapaṭighā. Kāmarāgo hi aṭṭhasu lobhasahagatacittuppādesu uppajjati. Paṭigho dvīsu domanassasahagatesūti, natthi nesaṃ ekakkhaṇe uppatti; tasmā ettha ‘no’ti paṭisedho kattabbo siyā. Taṃ akatvā pana ‘āmantā’ti paṭivacanassa dinnattā heṭṭhāyamakesu viya ettha khaṇapaccuppannavasena vattamānavohāraṃ aggahetvā aññathā gahetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ? Appahīnavasena. Appahīnatañhi sandhāya ayaṃ ‘‘anusetī’’ti vattamānavohāro vutto, na khaṇapaccuppannataṃ. Yasmā ca appahīnataṃ sandhāya vutto, tasmā ‘‘yassa kāmarāgānusayo anuseti, tassa paṭighānusayo anusetī’’ti pucchāya yassa kāmarāgānusayo appahīno, na anuppattidhammataṃ āpādito, tassa paṭighānusayopi appahīnoti evamattho daṭṭhabbo. Yasmā ca tesu yasseko appahīno, tassa itaropi appahīnova hoti, tasmā ‘‘āmantā’’ti vuttaṃ. Yadi evaṃ, yaṃ upari uppajjanavāre ‘yassa kāmarāgānusayo uppajjati, tassa paṭighānusayo uppajjatī’ti pucchitvā ‘āmantā’ti vuttaṃ; tattha kathaṃ attho gahetabboti? Tatthāpi appahīnavaseneva uppattipaccaye sati uppattiyā anivāritavasena vā. Yathā hi cittakammādīni ārabhitvā apariniṭṭhitakammantā cittakārādayo tesaṃ kammantānaṃ akaraṇakkhaṇepi mittasuhajjādīhi diṭṭhadiṭṭhaṭṭhāne ‘‘imesu divasesu kiṃ karothā’’ti vuttā, ‘‘cittakammaṃ karoma, kaṭṭhakammaṃ karomā’’ti vadanti. Te kiñcāpi tasmiṃ khaṇe na karonti avicchinnakammantattā pana katakhaṇañca kattabbakhaṇañca upādāya ",
      " karontiyeva nāma honti. Evameva yamhi santāne anusayā appahīnā, yamhi vā pana nesaṃ santāne uppattipaccaye sati uppatti anivāritā, tattha anuppajjanakkhaṇepi ",
      " uppannapubbañceva kālantare uppajjanakañca upādāya yassa kāmarāgānusayo uppajjati, tassa paṭighānusayo uppajjatiyeva nāmāti evamattho veditabbo. Ito paresupi evarūpesu vissajjanesu eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "No ca tassā"
      },
      "ti idaṃ anāgāmissa kāmarāgabyāpādānaṃ anavasesato pahīnattā vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiṇṇaṃ puggalāna"
      },
      "nti puthujjanasotāpannasakadāgāmīnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvinnaṃ puggalāna"
      },
      "nti sotāpannasakadāgāmīnaṃ. Paratopi evarūpesu ṭhānesu eseva nayo."
    ],
    "innerText": "Kathaṃ? Appahīnavasena. Appahīnatañhi sandhāya ayaṃ ‘‘anusetī’’ti vattamānavohāro vutto, na khaṇapaccuppannataṃ. Yasmā ca appahīnataṃ sandhāya vutto, tasmā ‘‘yassa kāmarāgānusayo anuseti, tassa paṭighānusayo anusetī’’ti pucchāya yassa kāmarāgānusayo appahīno, na anuppattidhammataṃ āpādito, tassa paṭighānusayopi appahīnoti evamattho daṭṭhabbo. Yasmā ca tesu yasseko appahīno, tassa itaropi appahīnova hoti, tasmā ‘‘āmantā’’ti vuttaṃ. Yadi evaṃ, yaṃ upari uppajjanavāre ‘yassa kāmarāgānusayo uppajjati, tassa paṭighānusayo uppajjatī’ti pucchitvā ‘āmantā’ti vuttaṃ; tattha kathaṃ attho gahetabboti? Tatthāpi appahīnavaseneva uppattipaccaye sati uppattiyā anivāritavasena vā. Yathā hi cittakammādīni ārabhitvā apariniṭṭhitakammantā cittakārādayo tesaṃ kammantānaṃ akaraṇakkhaṇepi mittasuhajjādīhi diṭṭhadiṭṭhaṭṭhāne ‘‘imesu divasesu kiṃ karothā’’ti vuttā, ‘‘cittakammaṃ karoma, kaṭṭhakammaṃ karomā’’ti vadanti. Te kiñcāpi tasmiṃ khaṇe na karonti avicchinnakammantattā pana katakhaṇañca kattabbakhaṇañca upādāya karontiyeva nāma honti. Evameva yamhi santāne anusayā appahīnā, yamhi vā pana nesaṃ santāne uppattipaccaye sati uppatti anivāritā, tattha anuppajjanakkhaṇepi uppannapubbañceva kālantare uppajjanakañca upādāya yassa kāmarāgānusayo uppajjati, tassa paṭighānusayo uppajjatiyeva nāmāti evamattho veditabbo. Ito paresupi evarūpesu vissajjanesu eseva nayo. No ca tassāti idaṃ anāgāmissa kāmarāgabyāpādānaṃ anavasesato pahīnattā vuttaṃ. Tiṇṇaṃ puggalānanti puthujjanasotāpannasakadāgāmīnaṃ. Dvinnaṃ puggalānanti sotāpannasakadāgāmīnaṃ. Paratopi evarūpesu ṭhānesu eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Okāsavārassa paṭhamadutiyapucchāsu yasmā kāmarāgānusayo kāmadhātuyā dvīsu vedanāsu ",
      " anuseti, paṭighānusayo dukkhavedanāya; tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘no’"
      },
      "ti paṭisedho kato. Tatiyapucchāyaṃ ubhinnampi kāmadhātuyā dvīsu vedanāsu anusayanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘āmantā’"
      },
      "ti paṭivacanaṃ dinnaṃ. Rūpadhātuarūpadhātuyā pana mānānusayassa kāmarāgānusayena saddhiṃ asādhāraṇaṃ uppattiṭṭhānaṃ. Tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "no ca tattha kāmarāgānusayo"
      },
      "ti vuttaṃ. Iminā nayena sabbesaṃ uppattiṭṭhānavāraṃ oloketvā sādhāraṇāsādhāraṇaṃ uppattiṭṭhānaṃ veditabbaṃ."
    ],
    "innerText": "14. Okāsavārassa paṭhamadutiyapucchāsu yasmā kāmarāgānusayo kāmadhātuyā dvīsu vedanāsu anuseti, paṭighānusayo dukkhavedanāya; tasmā ‘no’ti paṭisedho kato. Tatiyapucchāyaṃ ubhinnampi kāmadhātuyā dvīsu vedanāsu anusayanato ‘āmantā’ti paṭivacanaṃ dinnaṃ. Rūpadhātuarūpadhātuyā pana mānānusayassa kāmarāgānusayena saddhiṃ asādhāraṇaṃ uppattiṭṭhānaṃ. Tasmā no ca tattha kāmarāgānusayoti vuttaṃ. Iminā nayena sabbesaṃ uppattiṭṭhānavāraṃ oloketvā sādhāraṇāsādhāraṇaṃ uppattiṭṭhānaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". Dukamūlakapucchāyaṃ yasmā kāmarāgapaṭighānusayā nāpi ekasmiṃ ṭhāne uppajjanti, na ekaṃ dhammaṃ ārammaṇaṃ karonti, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "natthī"
      },
      "ti paṭikkhepo kato. Ayañhettha adhippāyo. Yasmiṃ ime dve anusayā anusayeyyuṃ, taṃ ṭhānameva natthi. Tasmā ‘‘kattha mānānusayo anusetī’’ti ayaṃ pucchā apucchāyevāti. Aññesupi evarūpesu eseva nayo."
    ],
    "innerText": "20. Dukamūlakapucchāyaṃ yasmā kāmarāgapaṭighānusayā nāpi ekasmiṃ ṭhāne uppajjanti, na ekaṃ dhammaṃ ārammaṇaṃ karonti, tasmā natthīti paṭikkhepo kato. Ayañhettha adhippāyo. Yasmiṃ ime dve anusayā anusayeyyuṃ, taṃ ṭhānameva natthi. Tasmā ‘‘kattha mānānusayo anusetī’’ti ayaṃ pucchā apucchāyevāti. Aññesupi evarūpesu eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      ". Puggalokāsavāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catunna"
      },
      "nti puthujjanasotāpannasakadāgāmianāgāmīnaṃ."
    ],
    "innerText": "27. Puggalokāsavāre catunnanti puthujjanasotāpannasakadāgāmianāgāmīnaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ". Paṭilomanaye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yassa kāmarāgānusayo nānusetī"
      },
      "ti ayaṃ pucchā anāgāmiṃ gahetvā pucchati."
    ],
    "innerText": "36. Paṭilomanaye yassa kāmarāgānusayo nānusetīti ayaṃ pucchā anāgāmiṃ gahetvā pucchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "56"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvinnaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalānaṃ sabbattha kāmarāgānusayo"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nānusetī"
      },
      "ti anāgāmiarahantānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmadhātuyā tīsu vedanāsū"
      },
      "ti ca vedanāggahaṇena vedanāsampayuttakānampi tesaṃ vatthārammaṇānampīti sabbesampi kāmāvacaradhammānaṃ gahaṇaṃ veditabbaṃ. Ayaṃ anusayavāre vinicchayakathā."
    ],
    "innerText": "56.Dvinnaṃpuggalānaṃ sabbattha kāmarāgānusayonānusetīti anāgāmiarahantānaṃ. Kāmadhātuyā tīsu vedanāsūti ca vedanāggahaṇena vedanāsampayuttakānampi tesaṃ vatthārammaṇānampīti sabbesampi kāmāvacaradhammānaṃ gahaṇaṃ veditabbaṃ. Ayaṃ anusayavāre vinicchayakathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anusayavāravaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Sānusayavāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "66-131"
      },
      ". Sānusayavāre pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yo kāmarāgānusayena sānusayo"
      },
      "ti yathā ekantarikajarādirogena ābādhiko yāva tamhā rogā na muccati, tāva tassa rogassa anuppattikkhaṇepi ",
      " sarogoyeva nāma hoti. Evaṃ sasaṃkilesassa vaṭṭagāmisattassa yāva ariyamaggena anusayā samugghātaṃ na gacchanti, tāva tesaṃ anusayānaṃ anuppattikkhaṇepi sānusayoyeva nāma hoti. Evarūpaṃ sānusayataṃ sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘āmantā’"
      },
      "ti vuttaṃ. Sesamettha anusayavārasadisameva."
    ],
    "innerText": "66-131. Sānusayavāre pana yo kāmarāgānusayena sānusayoti yathā ekantarikajarādirogena ābādhiko yāva tamhā rogā na muccati, tāva tassa rogassa anuppattikkhaṇepi sarogoyeva nāma hoti. Evaṃ sasaṃkilesassa vaṭṭagāmisattassa yāva ariyamaggena anusayā samugghātaṃ na gacchanti, tāva tesaṃ anusayānaṃ anuppattikkhaṇepi sānusayoyeva nāma hoti. Evarūpaṃ sānusayataṃ sandhāya ‘āmantā’ti vuttaṃ. Sesamettha anusayavārasadisameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Okāsavāre pana ‘‘rūpadhātuyā arūpadhātuyā ettha mānānusayena sānusayo’’ti vutte tāsu dhātūsu puggalassa sānusayatā paññāyeyya, anusayassa uppattiṭṭhānaṃ na paññāyeyya. Anusayassa ca uppattiṭṭhānadassanatthaṃ ayaṃ vāro āraddho, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tato mānānusayena sānusayo"
      },
      "ti vuttaṃ. Evañhi sati tato dhātudvayato uppannena mānānusayena sānusayoti anusayassa uppattiṭṭhānaṃ dassitaṃ hoti. Imassa pana pañhassa atthe avutte ādipañhassa attho pākaṭo na hotīti paṭhamaṃ na vutto, tasmā so evaṃ veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yato kāmarāgānusayenā"
      },
      "ti yato uppannena kāmarāgānusayena sānusayo, kiṃ so tato uppannena paṭighānusayenapi sānusayoti? Yasmā panete dve ekasmā ṭhānā nuppajjanti; tasmā ‘‘no’’ti paṭisedho kato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arahā sabbatthā"
      },
      "ti arahā sabbadhammesu uppajjanakena kenaci anusayena nirānusayoti. Iminā atthavasena nippadesaṭṭhānesu bhummavacanameva katanti. Iminā upāyena sabbattha atthavinicchayo veditabboti."
    ],
    "innerText": "Okāsavāre pana ‘‘rūpadhātuyā arūpadhātuyā ettha mānānusayena sānusayo’’ti vutte tāsu dhātūsu puggalassa sānusayatā paññāyeyya, anusayassa uppattiṭṭhānaṃ na paññāyeyya. Anusayassa ca uppattiṭṭhānadassanatthaṃ ayaṃ vāro āraddho, tasmā tato mānānusayena sānusayoti vuttaṃ. Evañhi sati tato dhātudvayato uppannena mānānusayena sānusayoti anusayassa uppattiṭṭhānaṃ dassitaṃ hoti. Imassa pana pañhassa atthe avutte ādipañhassa attho pākaṭo na hotīti paṭhamaṃ na vutto, tasmā so evaṃ veditabbo. Yato kāmarāgānusayenāti yato uppannena kāmarāgānusayena sānusayo, kiṃ so tato uppannena paṭighānusayenapi sānusayoti? Yasmā panete dve ekasmā ṭhānā nuppajjanti; tasmā ‘‘no’’ti paṭisedho kato. Arahā sabbatthāti arahā sabbadhammesu uppajjanakena kenaci anusayena nirānusayoti. Iminā atthavasena nippadesaṭṭhānesu bhummavacanameva katanti. Iminā upāyena sabbattha atthavinicchayo veditabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sānusayavāravaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Pajahanavāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "132-197"
      },
      ". Pajahanavāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pajahatī"
      },
      "ti tena tena maggena pahānapariññāvasena pajahati, āyatiṃ anuppattidhammataṃ āpādeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āmantā"
      },
      "ti anāgāmīmaggaṭṭhaṃ sandhāya paṭivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadekaṭṭhaṃ pajahatī"
      },
      "ti pahānekaṭṭhataṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "No"
      },
      "ti arahattamaggaṭṭhaṃ sandhāya paṭisedho."
    ],
    "innerText": "132-197. Pajahanavāre pajahatīti tena tena maggena pahānapariññāvasena pajahati, āyatiṃ anuppattidhammataṃ āpādeti. Āmantāti anāgāmīmaggaṭṭhaṃ sandhāya paṭivacanaṃ. Tadekaṭṭhaṃ pajahatīti pahānekaṭṭhataṃ sandhāya vuttaṃ. Noti arahattamaggaṭṭhaṃ sandhāya paṭisedho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yato kāmarāgānusayaṃ pajahatī"
      },
      "ti yato uppajjanakaṃ kāmarāgānusayaṃ pajahatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhamako"
      },
      "ti arahattaphalaṭṭhato paṭṭhāya paccorohanagaṇanāya gaṇiyamāno sotāpattimaggaṭṭho aṭṭhamako ",
      " nāma. Dakkhiṇeyyagaṇanāya hi arahā aggadakkhiṇeyyattā paṭhamo, arahattamaggaṭṭho dutiyo, anāgāmī tatiyo…pe… sotāpattimaggaṭṭho aṭṭhamo. So idha ‘‘aṭṭhamako’’ti vutto. Nāmasaññāyeva vā esā tassāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāgāmimaggasamaṅgiñca aṭṭhamakañca ṭhapetvā avasesā"
      },
      "ti saddhiṃ puthujjanena sekkhāsekkhā. Tesu hi puthujjano pahānapariññāya abhāvena nappajahati. Sesā tesaṃ anusayānaṃ pahīnattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvinnaṃ maggasamaṅgīna"
      },
      "nti dve maggasamaṅgino ṭhapetvāti attho. Iminā nayena sabbattha vinicchayo veditabboti."
    ],
    "innerText": "Yato kāmarāgānusayaṃ pajahatīti yato uppajjanakaṃ kāmarāgānusayaṃ pajahatīti attho. Aṭṭhamakoti arahattaphalaṭṭhato paṭṭhāya paccorohanagaṇanāya gaṇiyamāno sotāpattimaggaṭṭho aṭṭhamako nāma. Dakkhiṇeyyagaṇanāya hi arahā aggadakkhiṇeyyattā paṭhamo, arahattamaggaṭṭho dutiyo, anāgāmī tatiyo…pe… sotāpattimaggaṭṭho aṭṭhamo. So idha ‘‘aṭṭhamako’’ti vutto. Nāmasaññāyeva vā esā tassāti. Anāgāmimaggasamaṅgiñca aṭṭhamakañca ṭhapetvā avasesāti saddhiṃ puthujjanena sekkhāsekkhā. Tesu hi puthujjano pahānapariññāya abhāvena nappajahati. Sesā tesaṃ anusayānaṃ pahīnattā. Dvinnaṃ maggasamaṅgīnanti dve maggasamaṅgino ṭhapetvāti attho. Iminā nayena sabbattha vinicchayo veditabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pajahanavāravaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Pariññāvāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "198-263"
      },
      ". Pariññāvāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parijānātī"
      },
      "ti tīhi pariññāhi parijānāti. Sesamettha heṭṭhā vuttanayameva. Ayampi hi vāro pajahanavāro viya maggaṭṭhānaññeva vasena vissajjitoti."
    ],
    "innerText": "198-263. Pariññāvāre parijānātīti tīhi pariññāhi parijānāti. Sesamettha heṭṭhā vuttanayameva. Ayampi hi vāro pajahanavāro viya maggaṭṭhānaññeva vasena vissajjitoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pariññāvāravaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Pahīnavāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "264-274"
      },
      ". Pahīnavāre phalaṭṭhavaseneva desanā āraddhā. Anāgāmissa hi ubhopete anusayā pahīnā, tasmā ‘‘āmantā’’ti vuttaṃ."
    ],
    "innerText": "264-274. Pahīnavāre phalaṭṭhavaseneva desanā āraddhā. Anāgāmissa hi ubhopete anusayā pahīnā, tasmā ‘‘āmantā’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "275-296"
      },
      ". Okāsavāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yattha kāmarāgānusayo pahīno tattha paṭighānusayo pahīno"
      },
      "ti pucchitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na vattabbo pahīnoti vā appahīnoti vā"
      },
      "ti vuttaṃ taṃ kasmāti? Uppattiṭṭhānassa asādhāraṇattā. Aññaṃ hi kāmarāgānusayassa ",
      " uppattiṭṭhānaṃ, aññaṃ paṭighānusayassa. Abhāvitamaggassa ca yattha anusayo uppajjati, magge bhāvite tattheva so pahīno nāma hoti ",
      ". Tattha yasmā neva kāmarāgānusayaṭṭhāne paṭighānusayo uppajjati, na paṭighānusayaṭṭhāne kāmarāgānusayo, tasmā tattha so pahīnoti vā appahīnoti vā na vattabbo. So hi yasmiṃ attano uppattiṭṭhāne kāmarāgānusayo pahīno, tasmiṃ appahīnattā tattha pahīnoti na vattabbo. Yaṃ kāmarāgānusayassa uppattiṭṭhānaṃ, tasmiṃ aṭṭhitattā tattha appahīnoti na vattabbo."
    ],
    "innerText": "275-296. Okāsavāre yattha kāmarāgānusayo pahīno tattha paṭighānusayo pahīnoti pucchitvā na vattabbo pahīnoti vā appahīnoti vāti vuttaṃ taṃ kasmāti? Uppattiṭṭhānassa asādhāraṇattā. Aññaṃ hi kāmarāgānusayassa uppattiṭṭhānaṃ, aññaṃ paṭighānusayassa. Abhāvitamaggassa ca yattha anusayo uppajjati, magge bhāvite tattheva so pahīno nāma hoti . Tattha yasmā neva kāmarāgānusayaṭṭhāne paṭighānusayo uppajjati, na paṭighānusayaṭṭhāne kāmarāgānusayo, tasmā tattha so pahīnoti vā appahīnoti vā na vattabbo. So hi yasmiṃ attano uppattiṭṭhāne kāmarāgānusayo pahīno, tasmiṃ appahīnattā tattha pahīnoti na vattabbo. Yaṃ kāmarāgānusayassa uppattiṭṭhānaṃ, tasmiṃ aṭṭhitattā tattha appahīnoti na vattabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yattha kāmarāgānusayo pahīno, tattha mānānusayo pahīno"
      },
      "ti ettha pana sādhāraṇaṭṭhānaṃ sandhāya āmantāti vuttaṃ. Kāmarāgānusayo hi kāmadhātuyā dvīsu vedanāsu anuseti. Mānānusayo tāsu ceva rūpārūpadhātūsu ca. So ṭhapetvā asādhāraṇaṭṭhānaṃ sādhāraṇaṭṭhāne tena saddhiṃ pahīno nāma hoti. Tasmā ‘āmantā’ti vuttaṃ. Iminā nayena sabbasmimpi okāsavāre pahīnatā ca navattabbatā ca veditabbā. ‘Natthī’ti āgataṭṭhānesu pana heṭṭhā vuttasadisova vinicchayo. Puggalokāsavāro, okāsavāragatikoyeva."
    ],
    "innerText": "Yattha kāmarāgānusayo pahīno, tattha mānānusayo pahīnoti ettha pana sādhāraṇaṭṭhānaṃ sandhāya āmantāti vuttaṃ. Kāmarāgānusayo hi kāmadhātuyā dvīsu vedanāsu anuseti. Mānānusayo tāsu ceva rūpārūpadhātūsu ca. So ṭhapetvā asādhāraṇaṭṭhānaṃ sādhāraṇaṭṭhāne tena saddhiṃ pahīno nāma hoti. Tasmā ‘āmantā’ti vuttaṃ. Iminā nayena sabbasmimpi okāsavāre pahīnatā ca navattabbatā ca veditabbā. ‘Natthī’ti āgataṭṭhānesu pana heṭṭhā vuttasadisova vinicchayo. Puggalokāsavāro, okāsavāragatikoyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "297-307"
      },
      ". Paṭilomanaye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yassa kāmarāgānusayo appahīno"
      },
      "ti puthujjanasotāpannasakadāgāmivasena pucchati. Kiñcāpi hi ime dve anusayā puthujjanato paṭṭhāya yāva anāgāmimaggaṭṭhā channaṃ puggalānaṃ appahīnā. Idha pana parato ‘‘tiṇṇaṃ puggalānaṃ dvinnaṃ puggalāna’’ntiādivacanato maggaṭṭhā anadhippetā, tasmā puthujjanasotāpannasakadāgāminova sandhāya ‘āmantā’ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvinnaṃ puggalāna"
      },
      "nti sotāpannasakadāgāmīnaṃ. Iminā nayena puggalavāre vinicchayo veditabbo."
    ],
    "innerText": "297-307. Paṭilomanaye yassa kāmarāgānusayo appahīnoti puthujjanasotāpannasakadāgāmivasena pucchati. Kiñcāpi hi ime dve anusayā puthujjanato paṭṭhāya yāva anāgāmimaggaṭṭhā channaṃ puggalānaṃ appahīnā. Idha pana parato ‘‘tiṇṇaṃ puggalānaṃ dvinnaṃ puggalāna’’ntiādivacanato maggaṭṭhā anadhippetā, tasmā puthujjanasotāpannasakadāgāminova sandhāya ‘āmantā’ti vuttaṃ. Dvinnaṃ puggalānanti sotāpannasakadāgāmīnaṃ. Iminā nayena puggalavāre vinicchayo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "308-329"
      },
      ". Okāsavārapuggalokāsavārā pana heṭṭhā vuttanayeneva veditabbāti."
    ],
    "innerText": "308-329. Okāsavārapuggalokāsavārā pana heṭṭhā vuttanayeneva veditabbāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pahīnavāravaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Uppajjanavāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "330"
      },
      ". Uppajjanavāro ",
      " anusayavārasadisoyeva."
    ],
    "innerText": "330. Uppajjanavāro anusayavārasadisoyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Dhātupucchāvāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "332-340"
      },
      ". Dhātuvārassa ",
      " pucchāvāre tāva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kati anusayā anusentī"
      },
      "ti kati ",
      " anusayā santānaṃ anugatā hutvā sayanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kati anusayā nānusentī"
      },
      "ti kati anusayā santānaṃ na anugatā hutvā sayanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kati anusayā bhaṅgā"
      },
      "ti kati anusayā anusenti nānusentīti evaṃ vibhajitabbāti attho. Sesamettha yaṃ vattabbaṃ siyā, taṃ heṭṭhā pāḷivavatthāne vuttameva."
    ],
    "innerText": "332-340. Dhātuvārassa pucchāvāre tāva kati anusayā anusentīti kati anusayā santānaṃ anugatā hutvā sayanti. Kati anusayā nānusentīti kati anusayā santānaṃ na anugatā hutvā sayanti. Kati anusayā bhaṅgāti kati anusayā anusenti nānusentīti evaṃ vibhajitabbāti attho. Sesamettha yaṃ vattabbaṃ siyā, taṃ heṭṭhā pāḷivavatthāne vuttameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Dhātuvissajjanāvāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "341-349"
      },
      ". Niddesavāre panassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kassaci satta anusayā anusentī"
      },
      "ti puthujjanavasena vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kassaci pañcā"
      },
      "ti sotāpannasakadāgāmivasena vuttaṃ. Tesañhi diṭṭhānusayo ca vicikicchānusayo ca pahīnāti pañceva anusenti. Tattha yathā anusayavāre ‘‘anusentī’’ti padassa uppajjantīti attho gahito, evamidha na gahetabbo. Kasmā? Tasmiṃ khaṇe anuppajjanato. Kāmadhātuṃ upapajjantassa hi vipākacittañceva kammasamuṭṭhānarūpañca uppajjati, akusalacittaṃ natthi. Anusayā ca akusalacittakkhaṇe uppajjanti, na vipākacittakkhaṇeti tasmiṃ khaṇe anuppajjanato tathā attho na gahetabbo. Kathaṃ pana gahetabboti? Yathā labbhati tathā gahetabbo. Kathañca labbhati? Appahīnaṭṭhena. Yathā hi rāgadosamohānaṃ appahīnattā. Kusalābyākatacittasamaṅgī puggalo ‘‘sarāgo sadoso samoho’’ti vuccati, evaṃ maggabhāvanāya appahīnattā paṭisandhikkhaṇepi tassa tassa puggalassa te te anusayā anusentīti vuccanti. Na kevalañca vuccanti, appahīnattā pana te anusentiyeva nāmāti veditabbā."
    ],
    "innerText": "341-349. Niddesavāre panassa kassaci satta anusayā anusentīti puthujjanavasena vuttaṃ. Kassaci pañcāti sotāpannasakadāgāmivasena vuttaṃ. Tesañhi diṭṭhānusayo ca vicikicchānusayo ca pahīnāti pañceva anusenti. Tattha yathā anusayavāre ‘‘anusentī’’ti padassa uppajjantīti attho gahito, evamidha na gahetabbo. Kasmā? Tasmiṃ khaṇe anuppajjanato. Kāmadhātuṃ upapajjantassa hi vipākacittañceva kammasamuṭṭhānarūpañca uppajjati, akusalacittaṃ natthi. Anusayā ca akusalacittakkhaṇe uppajjanti, na vipākacittakkhaṇeti tasmiṃ khaṇe anuppajjanato tathā attho na gahetabbo. Kathaṃ pana gahetabboti? Yathā labbhati tathā gahetabbo. Kathañca labbhati? Appahīnaṭṭhena. Yathā hi rāgadosamohānaṃ appahīnattā. Kusalābyākatacittasamaṅgī puggalo ‘‘sarāgo sadoso samoho’’ti vuccati, evaṃ maggabhāvanāya appahīnattā paṭisandhikkhaṇepi tassa tassa puggalassa te te anusayā anusentīti vuccanti. Na kevalañca vuccanti, appahīnattā pana te anusentiyeva nāmāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anusayā bhaṅgā natthī"
      },
      "ti yassa hi yo anuseti, so anusetiyeva; yo nānuseti, so nānusetiyeva. Ayaṃ anuseti ca nānuseti ca, ayaṃ siyā anuseti siyā nānusetīti, evaṃ vibhajitabbo anusayo nāma natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpadhātuṃ upapajjantassa kassaci tayo"
      },
      "ti ",
      " anāgāmivasena vuttaṃ. Tassa hi kāmarāgapaṭighadiṭṭhivicikicchānusayā cattāropi anavasesato pahīnā. Itare tayova appahīnā. Tena vuttaṃ – ‘‘kassaci tayo anusayā anusentī’’ti."
    ],
    "innerText": "Anusayā bhaṅgā natthīti yassa hi yo anuseti, so anusetiyeva; yo nānuseti, so nānusetiyeva. Ayaṃ anuseti ca nānuseti ca, ayaṃ siyā anuseti siyā nānusetīti, evaṃ vibhajitabbo anusayo nāma natthi. Rūpadhātuṃ upapajjantassa kassaci tayoti anāgāmivasena vuttaṃ. Tassa hi kāmarāgapaṭighadiṭṭhivicikicchānusayā cattāropi anavasesato pahīnā. Itare tayova appahīnā. Tena vuttaṃ – ‘‘kassaci tayo anusayā anusentī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmadhātu"
      },
      "nti kāmadhātuyā paṭisiddhattā sesā dve dhātuyo upapajjantassāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satte"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vā"
      },
      "ti yasmā ariyasāvakassa rūpadhātuyā cutassa kāmadhātuyaṃ upapatti nāma natthi, puthujjanasseva hoti, tasmā sattevāti niyametvā vuttaṃ. ‘‘Arūpadhātuyā cutassa kāmadhātuṃ upapajjantassa sattevā’’ti etthāpi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpadhātuyā upapatti natthī"
      },
      "ti kasmā natthi? Upapattinipphādakassa rūpāvacarajjhānassa abhāvā. So hi sabbaso rūpasaññānaṃ samatikkamā taṃ dhātuṃ upapannoti nāssa tattha rūpāvacarajjhānaṃ atthi. Tadabhāvā rūpadhātuyaṃ upapatti natthīti veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arūpadhātuyā cutassa na kāmadhātu"
      },
      "nti ettha arūpadhātuyeva adhippetā. Iminā nayena sabbavissajjanesu attho veditabboti."
    ],
    "innerText": "Nakāmadhātunti kāmadhātuyā paṭisiddhattā sesā dve dhātuyo upapajjantassāti attho. Sattevāti yasmā ariyasāvakassa rūpadhātuyā cutassa kāmadhātuyaṃ upapatti nāma natthi, puthujjanasseva hoti, tasmā sattevāti niyametvā vuttaṃ. ‘‘Arūpadhātuyā cutassa kāmadhātuṃ upapajjantassa sattevā’’ti etthāpi eseva nayo. Rūpadhātuyā upapatti natthīti kasmā natthi? Upapattinipphādakassa rūpāvacarajjhānassa abhāvā. So hi sabbaso rūpasaññānaṃ samatikkamā taṃ dhātuṃ upapannoti nāssa tattha rūpāvacarajjhānaṃ atthi. Tadabhāvā rūpadhātuyaṃ upapatti natthīti veditabbā. Arūpadhātuyā cutassa na kāmadhātunti ettha arūpadhātuyeva adhippetā. Iminā nayena sabbavissajjanesu attho veditabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhātuvāravaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anusayayamakavaṇṇanā niṭṭhitā."
  }
]