[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Tatiyavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Balakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "354"
      },
      ". Idāni ",
      " balakathā nāma hoti. Tattha yesaṃ anuruddhasaṃyutte ‘‘imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāmī’’tiādīni (saṃ. ni. 5.913) dasasuttāni ayoniso gahetvā ‘‘tathāgatabalaṃ sāvakasādhāraṇa’’nti laddhi, seyyathāpi etarahi andhakānaṃ; te sandhāya pucchā sakavādissa, laddhiyaṃ ṭhatvā paṭiññā paravādissa. Tathāgatabalañca nāmetaṃ sāvakehi sādhāraṇampi atthi asādhāraṇampi sādhāraṇāsādhāraṇampi. Tattha āsavānaṃ khaye ñāṇaṃ sādhāraṇaṃ. Indriyaparopariyattiñāṇaṃ ",
      " asādhāraṇaṃ. Sesaṃ sādhāraṇañca asādhāraṇañca. Ṭhānāṭṭhānādīni hi sāvakā padesena jānanti, tathāgatā nippadesena. Iti tāni uddesato sādhāraṇāni, na niddesato. Ayaṃ pana avisesena sabbampi sādhāraṇanti āha. Tamenaṃ tato vivecetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathāgatabalaṃ sāvakabala"
      },
      "nti puna anuyogo āraddho. Tattha paṭhamapañhe niddesato sabbākāravisayataṃ sandhāya paṭikkhipati. Dutiyapañhe uddesato ṭhānāṭṭhānamattādijānanavasena paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taññevā"
      },
      "tiādipañhesu sabbākārena ninnānākaraṇatāya abhāvena paṭikkhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbayogo"
      },
      " ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pubbacariyā"
      },
      " ca atthato ekaṃ, tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammakkhāna"
      },
      "ñca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammadesanā"
      },
      " ca."
    ],
    "innerText": "354. Idāni balakathā nāma hoti. Tattha yesaṃ anuruddhasaṃyutte ‘‘imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāmī’’tiādīni (saṃ. ni. 5.913) dasasuttāni ayoniso gahetvā ‘‘tathāgatabalaṃ sāvakasādhāraṇa’’nti laddhi, seyyathāpi etarahi andhakānaṃ; te sandhāya pucchā sakavādissa, laddhiyaṃ ṭhatvā paṭiññā paravādissa. Tathāgatabalañca nāmetaṃ sāvakehi sādhāraṇampi atthi asādhāraṇampi sādhāraṇāsādhāraṇampi. Tattha āsavānaṃ khaye ñāṇaṃ sādhāraṇaṃ. Indriyaparopariyattiñāṇaṃ asādhāraṇaṃ. Sesaṃ sādhāraṇañca asādhāraṇañca. Ṭhānāṭṭhānādīni hi sāvakā padesena jānanti, tathāgatā nippadesena. Iti tāni uddesato sādhāraṇāni, na niddesato. Ayaṃ pana avisesena sabbampi sādhāraṇanti āha. Tamenaṃ tato vivecetuṃ tathāgatabalaṃ sāvakabalanti puna anuyogo āraddho. Tattha paṭhamapañhe niddesato sabbākāravisayataṃ sandhāya paṭikkhipati. Dutiyapañhe uddesato ṭhānāṭṭhānamattādijānanavasena paṭijānāti. Taññevātiādipañhesu sabbākārena ninnānākaraṇatāya abhāvena paṭikkhipati. Pubbayogo ca pubbacariyā ca atthato ekaṃ, tathā dhammakkhānañca dhammadesanā ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Indriyaparopariyattipañhe ekadesena sādhāraṇataṃ sandhāya sāvakavisaye paṭijānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "355"
      },
      ". Idāni ",
      " yasmā uddesato ṭhānāṭṭhānādīni sāvako jānāti, tasmā sāvakassa tathā jānanaṃ pakāsetvā tena jānanamattasāmaññena tesaṃ sāvakasādhāraṇattaṃ patiṭṭhāpetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāvako ṭhānāṭṭhānaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jānātī"
      },
      "tiādayo paravādipañhā honti. Tattha indriyaparopariyattiñāṇaṃ channaṃ asādhāraṇañāṇānaṃ aññataranti na gahitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsavakkhayena vā āsavakkhaya"
      },
      "nti yaṃ tathāgatassa āsavakkhayena saddhiṃ sāvakassa āsavakkhayaṃ paṭicca vattabbaṃ siyā nānākaraṇaṃ, taṃ natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimuttiyā vā vimutti"
      },
      "nti padepi eseva nayo. Sesamettha uttānatthameva."
    ],
    "innerText": "355. Idāni yasmā uddesato ṭhānāṭṭhānādīni sāvako jānāti, tasmā sāvakassa tathā jānanaṃ pakāsetvā tena jānanamattasāmaññena tesaṃ sāvakasādhāraṇattaṃ patiṭṭhāpetuṃ sāvako ṭhānāṭṭhānaṃjānātītiādayo paravādipañhā honti. Tattha indriyaparopariyattiñāṇaṃ channaṃ asādhāraṇañāṇānaṃ aññataranti na gahitaṃ. Āsavakkhayena vā āsavakkhayanti yaṃ tathāgatassa āsavakkhayena saddhiṃ sāvakassa āsavakkhayaṃ paṭicca vattabbaṃ siyā nānākaraṇaṃ, taṃ natthi. Vimuttiyā vā vimuttinti padepi eseva nayo. Sesamettha uttānatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "356"
      },
      ". Idāni yaṃ sakavādinā ‘‘āsavānaṃ khaye ñāṇaṃ sādhāraṇa’’nti anuññātaṃ, tena saddhiṃ saṃsanditvā sesānampi sādhāraṇabhāvaṃ pucchituṃ puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āsavānaṃ khaye"
      },
      "tiādayo paravādipañhāva honti. Tesaṃ vissajjane sakavādinā āsavakkhaye visesābhāvena taṃ ñāṇaṃ sādhāraṇanti anuññātaṃ. Itaresupi visesābhāvena sādhāraṇatā paṭikkhittā. Puna ṭhānāṭṭhānādīnaṃ āsavakkhayeneva saddhiṃ saṃsanditvā asādhāraṇapucchā paravādisseva. Tattha āsavakkhayañāṇe paṭikkhepo, sesesu ca paṭiññā sakavādissa. Tato indriyaparopariyattena saddhiṃ saṃsanditvā asādhāraṇapucchā paravādissa. Sā saṅkhipitvā dassitā. Tathāpi indriyaparopariyatte paṭiññā, sesesu ca paṭikkhepo sakavādissa. Tato ṭhānāṭṭhānādīhi saddhiṃ saṃsanditvā indriyaparopariyattassa sādhāraṇapucchā paravādissa. Sāpi saṅkhipitvāva dassitā. Tattha indriyaparopariyatte paṭikkhepo. Sesesu ca paṭiññā sakavādissāti."
    ],
    "innerText": "356. Idāni yaṃ sakavādinā ‘‘āsavānaṃ khaye ñāṇaṃ sādhāraṇa’’nti anuññātaṃ, tena saddhiṃ saṃsanditvā sesānampi sādhāraṇabhāvaṃ pucchituṃ puna āsavānaṃ khayetiādayo paravādipañhāva honti. Tesaṃ vissajjane sakavādinā āsavakkhaye visesābhāvena taṃ ñāṇaṃ sādhāraṇanti anuññātaṃ. Itaresupi visesābhāvena sādhāraṇatā paṭikkhittā. Puna ṭhānāṭṭhānādīnaṃ āsavakkhayeneva saddhiṃ saṃsanditvā asādhāraṇapucchā paravādisseva. Tattha āsavakkhayañāṇe paṭikkhepo, sesesu ca paṭiññā sakavādissa. Tato indriyaparopariyattena saddhiṃ saṃsanditvā asādhāraṇapucchā paravādissa. Sā saṅkhipitvā dassitā. Tathāpi indriyaparopariyatte paṭiññā, sesesu ca paṭikkhepo sakavādissa. Tato ṭhānāṭṭhānādīhi saddhiṃ saṃsanditvā indriyaparopariyattassa sādhāraṇapucchā paravādissa. Sāpi saṅkhipitvāva dassitā. Tattha indriyaparopariyatte paṭikkhepo. Sesesu ca paṭiññā sakavādissāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Balakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Ariyantikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "357"
      },
      ". Idāni ",
      " ariyantikathā nāma hoti. Tattha yesaṃ ‘‘na kevalaṃ āsavakkhayañāṇameva ariyaṃ, atha kho purimānipi nava balāni ariyāni’’cceva laddhi, seyyathāpi etarahi andhakānaṃ; te sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariya"
      },
      "nti pucchā sakavādissa, paṭiññā itarassa. Puna yadi taṃ ariyaṃ, maggādīsu tena aññatarena ",
      " bhavitabbanti maggādivasena pucchā sakavādissa, paṭikkhepo itarassa."
    ],
    "innerText": "357. Idāni ariyantikathā nāma hoti. Tattha yesaṃ ‘‘na kevalaṃ āsavakkhayañāṇameva ariyaṃ, atha kho purimānipi nava balāni ariyāni’’cceva laddhi, seyyathāpi etarahi andhakānaṃ; te sandhāya ariyanti pucchā sakavādissa, paṭiññā itarassa. Puna yadi taṃ ariyaṃ, maggādīsu tena aññatarena bhavitabbanti maggādivasena pucchā sakavādissa, paṭikkhepo itarassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna suññatārammaṇādivasena pucchā sakavādissa. Tattha dve suññatā – sattasuññatā ca saṅkhārasuññatā ca. Sattasuññatā nāma diṭṭhiyā ",
      " parikappitena sattena suññā pañcakkhandhā. Saṅkhārasuññatā nāma sabbasaṅkhārehi suññaṃ vivittaṃ nissaṭaṃ nibbānaṃ. Tattha paravādī nibbānārammaṇataṃ sandhāya paṭikkhipati, saṅkhārārammaṇataṃ sandhāya paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manasi karotī"
      },
      "ti puṭṭhopi nibbānameva sandhāya paṭikkhipati, saṅkhāre sandhāya paṭijānāti. Tato sakavādinā ‘‘ṭhānāṭṭhānādimanasikāro saṅkhārārammaṇo, suññatamanasikāro nibbānārammaṇo’’ti imaṃ nayaṃ gahetvā ‘‘dvinnaṃ phassānaṃ dvinnaṃ cittānaṃ samodhānaṃ hotī’’ti puṭṭho lesokāsaṃ alabhanto paṭikkhipati. Animittāpaṇihitesupi eseva nayo. Sattanimittābhāvato hi khandhā animittā. Saṅkhāranimittābhāvato nibbānaṃ. Ekadhammasmimpi āropetvā ṭhapetabbasaṅkhātena ca paṇidahitabbaṭṭhena paṇihitasaṅkhaṃ gatena sattapaṇidhinā appaṇihitā khandhā. Taṇhāpaṇidhinā taṇhāya vā ārammaṇabhūtena sabbasaṅkhārapaṇidhinā appaṇihitaṃ nibbānaṃ. Tasmā idhāpi paṭikkhepo ca paṭiññā ca purimanayeneva veditabbā."
    ],
    "innerText": "Puna suññatārammaṇādivasena pucchā sakavādissa. Tattha dve suññatā – sattasuññatā ca saṅkhārasuññatā ca. Sattasuññatā nāma diṭṭhiyā parikappitena sattena suññā pañcakkhandhā. Saṅkhārasuññatā nāma sabbasaṅkhārehi suññaṃ vivittaṃ nissaṭaṃ nibbānaṃ. Tattha paravādī nibbānārammaṇataṃ sandhāya paṭikkhipati, saṅkhārārammaṇataṃ sandhāya paṭijānāti. Manasi karotīti puṭṭhopi nibbānameva sandhāya paṭikkhipati, saṅkhāre sandhāya paṭijānāti. Tato sakavādinā ‘‘ṭhānāṭṭhānādimanasikāro saṅkhārārammaṇo, suññatamanasikāro nibbānārammaṇo’’ti imaṃ nayaṃ gahetvā ‘‘dvinnaṃ phassānaṃ dvinnaṃ cittānaṃ samodhānaṃ hotī’’ti puṭṭho lesokāsaṃ alabhanto paṭikkhipati. Animittāpaṇihitesupi eseva nayo. Sattanimittābhāvato hi khandhā animittā. Saṅkhāranimittābhāvato nibbānaṃ. Ekadhammasmimpi āropetvā ṭhapetabbasaṅkhātena ca paṇidahitabbaṭṭhena paṇihitasaṅkhaṃ gatena sattapaṇidhinā appaṇihitā khandhā. Taṇhāpaṇidhinā taṇhāya vā ārammaṇabhūtena sabbasaṅkhārapaṇidhinā appaṇihitaṃ nibbānaṃ. Tasmā idhāpi paṭikkhepo ca paṭiññā ca purimanayeneva veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "358"
      },
      ". Tato ‘‘yathā satipaṭṭhānādayo lokuttaradhammā ariyā ceva suññatādiārammaṇā ca, kiṃ te evaṃ ṭhānāṭṭhānañāṇa’’nti anulomapaṭilomapucchā honti. Tattha sabbāpi paṭiññā sabbe ca paṭikkhepā paravādisseva. Imināvupāyena sesañāṇesupi pucchāvissajjanaṃ veditabbaṃ. Pāḷiyaṃ pana sesāni saṅkhipitvā avasāne cutūpapātañāṇameva vibhattaṃ. Tato paraṃ sakasamayepi ‘‘ariya’’nti siddhena āsavānaṃ khayañāṇena saddhiṃ saṃsanditvā sesañāṇānaṃ anulomato ca paṭilomato ca ariyabhāvapucchā honti. Tā sabbā paravādissa, paṭiññā paṭikkhepo ca sakavādissa ",
      ". Te uttānatthāyeva. Pāḷiyaṃ panettha paṭhamanavamāneva dassetvā satta ñāṇāni saṅkhittānīti."
    ],
    "innerText": "358. Tato ‘‘yathā satipaṭṭhānādayo lokuttaradhammā ariyā ceva suññatādiārammaṇā ca, kiṃ te evaṃ ṭhānāṭṭhānañāṇa’’nti anulomapaṭilomapucchā honti. Tattha sabbāpi paṭiññā sabbe ca paṭikkhepā paravādisseva. Imināvupāyena sesañāṇesupi pucchāvissajjanaṃ veditabbaṃ. Pāḷiyaṃ pana sesāni saṅkhipitvā avasāne cutūpapātañāṇameva vibhattaṃ. Tato paraṃ sakasamayepi ‘‘ariya’’nti siddhena āsavānaṃ khayañāṇena saddhiṃ saṃsanditvā sesañāṇānaṃ anulomato ca paṭilomato ca ariyabhāvapucchā honti. Tā sabbā paravādissa, paṭiññā paṭikkhepo ca sakavādissa . Te uttānatthāyeva. Pāḷiyaṃ panettha paṭhamanavamāneva dassetvā satta ñāṇāni saṅkhittānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ariyantikathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Vimuttikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "363"
      },
      ". Idāni ",
      " vimuttikathā nāma hoti. Tattha yesaṃ ‘‘vītarāgacittānaṃ vimuttipayojanaṃ nāma natthi. Yathā pana malīnaṃ vatthaṃ dhoviyamānaṃ malā vimuccati, evaṃ sarāgaṃ cittaṃ rāgato vimuccatī’’ti laddhi, seyyathāpi etarahi andhakānaṃ; te sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sarāga"
      },
      "nti pucchā sakavādissa, paṭiññā itarassa. Tato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rāgasahagata"
      },
      "ntiādinā nayena puṭṭho maggakkhaṇe cittaṃ vimuccati nāma. Tadā ca evarūpaṃ cittaṃ natthīti paṭikkhipati."
    ],
    "innerText": "363. Idāni vimuttikathā nāma hoti. Tattha yesaṃ ‘‘vītarāgacittānaṃ vimuttipayojanaṃ nāma natthi. Yathā pana malīnaṃ vatthaṃ dhoviyamānaṃ malā vimuccati, evaṃ sarāgaṃ cittaṃ rāgato vimuccatī’’ti laddhi, seyyathāpi etarahi andhakānaṃ; te sandhāya sarāganti pucchā sakavādissa, paṭiññā itarassa. Tato rāgasahagatantiādinā nayena puṭṭho maggakkhaṇe cittaṃ vimuccati nāma. Tadā ca evarūpaṃ cittaṃ natthīti paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saphassantiādinā nayena puṭṭhopi yathā phasso ca cittañca ubho rāgato vimuccanti, evaṃ rāgassa vimuttiṃ apassamāno paṭikkhipati. Sadosādīsupi imināvupāyena attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vimuttikathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Vimuccamānakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "366"
      },
      ". Idāni vimuccamānakathā nāma hoti. Tattha yesaṃ ‘‘jhānena vikkhambhanavimuttiyā vimuttaṃ, maggakkhaṇe samucchedavimuttiyā vimuccamānaṃ nāma hotī’’ti laddhi, te sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimuttaṃ vimuccamāna"
      },
      "nti pucchā sakavādissa, paṭiññā itarasa."
    ],
    "innerText": "366. Idāni vimuccamānakathā nāma hoti. Tattha yesaṃ ‘‘jhānena vikkhambhanavimuttiyā vimuttaṃ, maggakkhaṇe samucchedavimuttiyā vimuccamānaṃ nāma hotī’’ti laddhi, te sandhāya vimuttaṃ vimuccamānanti pucchā sakavādissa, paṭiññā itarasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekadesa"
      },
      "nti pucchā sakavādissa. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekadesa"
      },
      "nti bhāvanapuṃsakaṃ. Yathā vimuttaṃ, ekadesena ",
      " vā ekadese vā avimuttaṃ hoti kiṃ evaṃ ekadesaṃ vimuttaṃ, ekadesaṃ avimuttanti pucchati. Kiṃ kāraṇā evaṃ pucchatīti? ‘‘Vimuttaṃ vimuccamāna’’nti vippakatabhāvena vuttattā. Yathā hi kariyamānā kaṭādayo vippakatattā ekadesena katā ekadesena akatā honti, tathā idampi ekadesaṃ vimuttaṃ ekadesaṃ avimuttanti āpajjati. Tato paravādī kaṭādīnaṃ viya cittassa ekadesābhāvā paṭhamapañhe paṭikkhipitvā dutiye vimuccamānassa apariniṭṭhitavimuttitāya paṭijānāti. Lokiyajjhānakkhaṇaṃ vā sandhāya paṭikkhipati. Na hi taṃ tadā samucchedavimuttiyā vimuccamānaṃ. Lokuttarajjhānakkhaṇaṃ sandhāya paṭijānāti. Tañhi tadā samucchedavimuttiyā vimuttekadesena ",
      " vimuccamānantissa laddhi. Tato sakavādī ‘‘yadi te ekameva ",
      " cittaṃ ekadesaṃ vimuttaṃ ekadesaṃ avimuttaṃ, evaṃ sante yo ekeneva cittena sotāpanno hoti, sopi te ekadesaṃ sotāpanno, ekadesaṃ na sotāpanno āpajjatī’’ti codanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekadesaṃ sotāpanno"
      },
      "tiādimāha. Itaro taṃ vidhānaṃ apassanto paṭikkhipati. Sesavāresupi eseva nayo."
    ],
    "innerText": "Puna ekadesanti pucchā sakavādissa. Tattha ekadesanti bhāvanapuṃsakaṃ. Yathā vimuttaṃ, ekadesena vā ekadese vā avimuttaṃ hoti kiṃ evaṃ ekadesaṃ vimuttaṃ, ekadesaṃ avimuttanti pucchati. Kiṃ kāraṇā evaṃ pucchatīti? ‘‘Vimuttaṃ vimuccamāna’’nti vippakatabhāvena vuttattā. Yathā hi kariyamānā kaṭādayo vippakatattā ekadesena katā ekadesena akatā honti, tathā idampi ekadesaṃ vimuttaṃ ekadesaṃ avimuttanti āpajjati. Tato paravādī kaṭādīnaṃ viya cittassa ekadesābhāvā paṭhamapañhe paṭikkhipitvā dutiye vimuccamānassa apariniṭṭhitavimuttitāya paṭijānāti. Lokiyajjhānakkhaṇaṃ vā sandhāya paṭikkhipati. Na hi taṃ tadā samucchedavimuttiyā vimuccamānaṃ. Lokuttarajjhānakkhaṇaṃ sandhāya paṭijānāti. Tañhi tadā samucchedavimuttiyā vimuttekadesena vimuccamānantissa laddhi. Tato sakavādī ‘‘yadi te ekameva cittaṃ ekadesaṃ vimuttaṃ ekadesaṃ avimuttaṃ, evaṃ sante yo ekeneva cittena sotāpanno hoti, sopi te ekadesaṃ sotāpanno, ekadesaṃ na sotāpanno āpajjatī’’ti codanatthaṃ ekadesaṃ sotāpannotiādimāha. Itaro taṃ vidhānaṃ apassanto paṭikkhipati. Sesavāresupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Uppādakkhaṇapañhe yadi ekameva cittaṃ vimuttañca vimuccamānañca, ekasmiṃ khaṇe vimuttaṃ ekasmiṃ vimuccamānaṃ āpajjati. Kiṃ te evarūpaṃ cittanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "367"
      },
      ". Suttasādhane paṭhamasuttaṃ paravādissa. Tatrāssāyamadhippāyo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimuccatī"
      },
      "ti vippakataniddeso. Tasmā yaṃ tassa yogino evaṃ jānato evaṃ passato etehi āsavehi cittaṃ vimuccati, taṃ vimuccamānaṃ nāma hotīti. Dutiyasuttaṃ sakavādissa. Tatrāssāyamadhippāyo – yadi te vimuccatīti vacanato vimuttaṃ vimuccamānaṃ, idha vimuccatīti vacanābhāvato vimuttameva siyā, na vimuccamānanti."
    ],
    "innerText": "367. Suttasādhane paṭhamasuttaṃ paravādissa. Tatrāssāyamadhippāyo – vimuccatīti vippakataniddeso. Tasmā yaṃ tassa yogino evaṃ jānato evaṃ passato etehi āsavehi cittaṃ vimuccati, taṃ vimuccamānaṃ nāma hotīti. Dutiyasuttaṃ sakavādissa. Tatrāssāyamadhippāyo – yadi te vimuccatīti vacanato vimuttaṃ vimuccamānaṃ, idha vimuccatīti vacanābhāvato vimuttameva siyā, na vimuccamānanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ‘‘yathā te vippakatavimuttitāya vimuccamānaṃ, kiṃ evaṃ vippakatarāgāditāya rajjamānādīnipi atthī’’ti codanatthaṃ puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthi citta"
      },
      "ntiādi āraddhaṃ. Paravādināpi tathārūpaṃ cittaṃ apassantena sabbaṃ paṭikkhittaṃ. Atha naṃ sakavādī ‘‘dveyeva koṭiyo, tatiyā natthī’’ti anubodhento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nanu rattañceva arattañcā"
      },
      "tiādimāha. Tassattho – nanu bhadramukha, rāgasampayuttaṃ cittaṃ rattaṃ vippayuttaṃ arattanti dveva koṭiyo, rajjamānaṃ nāma tatiyā koṭi natthīti? Duṭṭhādīsupi eseva nayo. Atha naṃ āmantāti paṭijānitvā ṭhitaṃ. Vimuttipakkhepi dveyeva ",
      " koṭiyo dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hañci rattañcevā"
      },
      "tiādimāha. Tassattho – yadi etā dve koṭiyo sampaṭicchasi, avimuttañceva vimuttañcā ti imāpi sampaṭiccha. Kilesasampayuttañhi cittaṃ avimuttaṃ, vippayuttaṃ vimuttaṃ. Vimuccamānaṃ nāmāti paramatthato tatiyā koṭi natthīti."
    ],
    "innerText": "Idāni ‘‘yathā te vippakatavimuttitāya vimuccamānaṃ, kiṃ evaṃ vippakatarāgāditāya rajjamānādīnipi atthī’’ti codanatthaṃ puna atthi cittantiādi āraddhaṃ. Paravādināpi tathārūpaṃ cittaṃ apassantena sabbaṃ paṭikkhittaṃ. Atha naṃ sakavādī ‘‘dveyeva koṭiyo, tatiyā natthī’’ti anubodhento nanu rattañceva arattañcātiādimāha. Tassattho – nanu bhadramukha, rāgasampayuttaṃ cittaṃ rattaṃ vippayuttaṃ arattanti dveva koṭiyo, rajjamānaṃ nāma tatiyā koṭi natthīti? Duṭṭhādīsupi eseva nayo. Atha naṃ āmantāti paṭijānitvā ṭhitaṃ. Vimuttipakkhepi dveyeva koṭiyo dassetuṃ hañci rattañcevātiādimāha. Tassattho – yadi etā dve koṭiyo sampaṭicchasi, avimuttañceva vimuttañcā ti imāpi sampaṭiccha. Kilesasampayuttañhi cittaṃ avimuttaṃ, vippayuttaṃ vimuttaṃ. Vimuccamānaṃ nāmāti paramatthato tatiyā koṭi natthīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vimuccamānakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Aṭṭhamakakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "368"
      },
      ". Idāni ",
      " aṭṭhamakakathā nāma hoti. Tattha yesaṃ anulomagotrabhumaggakkhaṇe kilesānaṃ samudācārābhāvato aṭṭhamakassa sotāpattimaggaṭṭhapuggalassa dve pariyuṭṭhānā pahīnāti laddhi, seyyathāpi etarahi andhakānañceva sammitiyānañca; tesaṃ aññataraṃ sandhāya pucchā sakavādissa, maggakkhaṇato paṭṭhāya diṭṭhiyā anuppattiṃ sandhāya paṭiññā itarassa. Tato yasmā diṭṭhi nāmesā sotāpannasseva pahīnā, na maggaṭṭhassa, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhamako puggalo sotāpanno"
      },
      "ti anuyogo sakavādissa. Vicikicchāpañhepi eseva nayo. Anusayapañhe pariyuṭṭhānato añño anusayoti tesaṃ laddhi, tasmā ‘‘na heva’’nti paṭikkhittaṃ."
    ],
    "innerText": "368. Idāni aṭṭhamakakathā nāma hoti. Tattha yesaṃ anulomagotrabhumaggakkhaṇe kilesānaṃ samudācārābhāvato aṭṭhamakassa sotāpattimaggaṭṭhapuggalassa dve pariyuṭṭhānā pahīnāti laddhi, seyyathāpi etarahi andhakānañceva sammitiyānañca; tesaṃ aññataraṃ sandhāya pucchā sakavādissa, maggakkhaṇato paṭṭhāya diṭṭhiyā anuppattiṃ sandhāya paṭiññā itarassa. Tato yasmā diṭṭhi nāmesā sotāpannasseva pahīnā, na maggaṭṭhassa, tasmā aṭṭhamako puggalo sotāpannoti anuyogo sakavādissa. Vicikicchāpañhepi eseva nayo. Anusayapañhe pariyuṭṭhānato añño anusayoti tesaṃ laddhi, tasmā ‘‘na heva’’nti paṭikkhittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sīlabbataparāmāsapañhepi sīlabbataparāmāsapariyuṭṭhānanti vohāraṃ na passati, tasmā paṭikkhipati. Pariyuṭṭhānamevassa pahīnanti laddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "369"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maggo bhāvito"
      },
      "ti pañhe tasmiṃ khaṇe bhāveti, na bhāvito. Tasmā paṭikkhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amaggenā"
      },
      "tiādianuyoge paṭhamamaggeneva pahīnabhāvaṃ sandhāya paṭikkhipati. Yadi hi amaggena pahīyetha, gotrabhupuggalādīnampi pahīyethāti āpajjanato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppajjissatī"
      },
      "ti pucchā paravādissa, vissajjanaṃ sakavādissa. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "369.Maggo bhāvitoti pañhe tasmiṃ khaṇe bhāveti, na bhāvito. Tasmā paṭikkhipati. Amaggenātiādianuyoge paṭhamamaggeneva pahīnabhāvaṃ sandhāya paṭikkhipati. Yadi hi amaggena pahīyetha, gotrabhupuggalādīnampi pahīyethāti āpajjanato. Uppajjissatīti pucchā paravādissa, vissajjanaṃ sakavādissa. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aṭṭhamakakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Aṭṭhamakassa indriyakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "371"
      },
      ". Idāni ",
      " aṭṭhamakassa indriyakathā nāma hoti. Tattha yesaṃ ‘‘aṭṭhamako maggakkhaṇe indriyāni paṭilabhati nāma, no cassa paṭiladdhāni hontī’’ti laddhi, seyyathāpi etarahi andhakānaṃ; te sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "natthi saddhindriya"
      },
      "nti pucchā sakavādissa, paṭiññā itarassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Natthi saddhā"
      },
      "ti puṭṭho pana saddhindriyato saddhāya nānattaṃ sallakkhetvā paṭikkhipati. Sesesupi eseva nayo. Yathā pana yassa atthi mano, tassa manindriyampi atthi; evaṃ yassa ",
      " saddhādayo atthi, tassa atthi saddhindriyādīnipīti dīpanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthi mano atthi manindriya"
      },
      "ntiādi āraddhaṃ. Taṃ sabbaṃ uttānatthameva saddhiṃ suttasādhanenāti."
    ],
    "innerText": "371. Idāni aṭṭhamakassa indriyakathā nāma hoti. Tattha yesaṃ ‘‘aṭṭhamako maggakkhaṇe indriyāni paṭilabhati nāma, no cassa paṭiladdhāni hontī’’ti laddhi, seyyathāpi etarahi andhakānaṃ; te sandhāya natthi saddhindriyanti pucchā sakavādissa, paṭiññā itarassa. Natthi saddhāti puṭṭho pana saddhindriyato saddhāya nānattaṃ sallakkhetvā paṭikkhipati. Sesesupi eseva nayo. Yathā pana yassa atthi mano, tassa manindriyampi atthi; evaṃ yassa saddhādayo atthi, tassa atthi saddhindriyādīnipīti dīpanatthaṃ atthi mano atthi manindriyantiādi āraddhaṃ. Taṃ sabbaṃ uttānatthameva saddhiṃ suttasādhanenāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aṭṭhamakassa indriyakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Dibbacakkhukathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "373"
      },
      ". Idāni dibbacakkhukathā nāma hoti. Tattha yesaṃ catutthajjhānadhammūpatthaddhaṃ maṃsacakkhumeva dibbacakkhu nāma hotīti laddhi, seyyathāpi etarahi andhakānañceva sammitiyānañca; te sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "maṃsacakkhu"
      },
      "nti pucchā sakavādissa, paṭiññā itarassa."
    ],
    "innerText": "373. Idāni dibbacakkhukathā nāma hoti. Tattha yesaṃ catutthajjhānadhammūpatthaddhaṃ maṃsacakkhumeva dibbacakkhu nāma hotīti laddhi, seyyathāpi etarahi andhakānañceva sammitiyānañca; te sandhāya maṃsacakkhunti pucchā sakavādissa, paṭiññā itarassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna ‘‘maṃsacakkhu dibbacakkhu, dibbacakkhu maṃsacakkhū’’ti puṭṭho taṃ mattameva taṃ na hotīti paṭikkhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yādisa"
      },
      "ntiādipucchāsupi ubhinnaṃ ekasabhāvābhāveneva paṭikkhipati."
    ],
    "innerText": "Puna ‘‘maṃsacakkhu dibbacakkhu, dibbacakkhu maṃsacakkhū’’ti puṭṭho taṃ mattameva taṃ na hotīti paṭikkhipati. Yādisantiādipucchāsupi ubhinnaṃ ekasabhāvābhāveneva paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visayo"
      },
      "tiādīsu ubhinnampi rūpāyatanameva visayo. Maṃsacakkhu pana āpāthagatameva passati. Itaraṃ anāpāthagataṃ tiropabbatādigatampi. Dibbacakkhussa ca atisukhumampi rūpaṃ gocaro, na tādisaṃ itarassāti evametesaṃ ānubhāvagocarā asadisā."
    ],
    "innerText": "Visayotiādīsu ubhinnampi rūpāyatanameva visayo. Maṃsacakkhu pana āpāthagatameva passati. Itaraṃ anāpāthagataṃ tiropabbatādigatampi. Dibbacakkhussa ca atisukhumampi rūpaṃ gocaro, na tādisaṃ itarassāti evametesaṃ ānubhāvagocarā asadisā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upādiṇṇaṃ hutvā anupādiṇṇaṃ hotī"
      },
      "ti puṭṭho yasmā maṃsacakkhu upādiṇṇaṃ, dibbacakkhu anupādiṇṇaṃ, na ca maṃsacakkhumeva dibbacakkhūti icchati, tasmā paṭikkhipati. Dutiyaṃ puṭṭho yasmā ",
      " ‘‘maṃsacakkhussa uppādo, maggo dibbassa cakkhuno’’ti vacanaṃ nissāya maṃsacakkhupaccayā dibbacakkhu uppajjati, tañca rūpāvacarikānaṃ catunnaṃ mahābhūtānaṃ pasādoti icchati, tasmā paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmāvacaraṃ hutvā"
      },
      "ti puṭṭhopi yasmā na maṃsacakkhumeva dibbacakkhūti icchati, tasmā paṭikkhipati. Dutiyaṃ puṭṭho rūpāvacarajjhānapaccayena uppannattā rūpāvacaraṃ nāma jātanti paṭijānāti."
    ],
    "innerText": "Upādiṇṇaṃ hutvā anupādiṇṇaṃ hotīti puṭṭho yasmā maṃsacakkhu upādiṇṇaṃ, dibbacakkhu anupādiṇṇaṃ, na ca maṃsacakkhumeva dibbacakkhūti icchati, tasmā paṭikkhipati. Dutiyaṃ puṭṭho yasmā ‘‘maṃsacakkhussa uppādo, maggo dibbassa cakkhuno’’ti vacanaṃ nissāya maṃsacakkhupaccayā dibbacakkhu uppajjati, tañca rūpāvacarikānaṃ catunnaṃ mahābhūtānaṃ pasādoti icchati, tasmā paṭijānāti. Kāmāvacaraṃ hutvāti puṭṭhopi yasmā na maṃsacakkhumeva dibbacakkhūti icchati, tasmā paṭikkhipati. Dutiyaṃ puṭṭho rūpāvacarajjhānapaccayena uppannattā rūpāvacaraṃ nāma jātanti paṭijānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpāvacaraṃ hutvā arūpāvacara"
      },
      "nti puṭṭhopi tato paraṃ bhāvanāya arūpāvacarakkhaṇe rūpāvacaracittassa abhāvā paṭikkhipati. Dutiyaṃ puṭṭho arūpāvacarikānaṃ ",
      " catunnaṃ mahābhūtānaṃ pasādo hutvā uppajjatīti laddhiyā ",
      " paṭijānāti. Apariyāpannabhāvaṃ panassa na icchati, tasmā paṭikkhipatiyeva."
    ],
    "innerText": "Rūpāvacaraṃ hutvā arūpāvacaranti puṭṭhopi tato paraṃ bhāvanāya arūpāvacarakkhaṇe rūpāvacaracittassa abhāvā paṭikkhipati. Dutiyaṃ puṭṭho arūpāvacarikānaṃ catunnaṃ mahābhūtānaṃ pasādo hutvā uppajjatīti laddhiyā paṭijānāti. Apariyāpannabhāvaṃ panassa na icchati, tasmā paṭikkhipatiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "374"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dibbacakkhuṃ dhammupatthaddha"
      },
      "nti kāmāvacaradhammena upatthambhitaṃ hutvā. Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammupatthaddha"
      },
      "nti lokuttaradhammena upatthaddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dveva cakkhūnī"
      },
      "ti puṭṭho kiñcāpi dibbacakkhuno dhammupatthaddhassa paññācakkhubhāvaṃ na icchati, paññācakkhussa pana atthitāya paṭikkhipati. Puna puṭṭho maṃsacakkhu dhammupatthaddhaṃ dibbacakkhu hotīti laddhivasena paṭijānāti. Sesamettha uttānatthamevāti."
    ],
    "innerText": "374.Dibbacakkhuṃ dhammupatthaddhanti kāmāvacaradhammena upatthambhitaṃ hutvā. Puna dhammupatthaddhanti lokuttaradhammena upatthaddhaṃ. Dveva cakkhūnīti puṭṭho kiñcāpi dibbacakkhuno dhammupatthaddhassa paññācakkhubhāvaṃ na icchati, paññācakkhussa pana atthitāya paṭikkhipati. Puna puṭṭho maṃsacakkhu dhammupatthaddhaṃ dibbacakkhu hotīti laddhivasena paṭijānāti. Sesamettha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dibbacakkhukathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Dibbasotakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "375"
      },
      ". Idāni dibbasotakathā nāma hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekaṃyeva sota"
      },
      "nti puṭṭho dvinnaṃ atthitāya paṭikkhipati. Puna puṭṭho yasmā tadeva dhammupatthaddhaṃ dibbasotaṃ nāma hoti, tasmā paṭijānāti. Sesaṃ heṭṭhā vuttanayamevāti."
    ],
    "innerText": "375. Idāni dibbasotakathā nāma hoti. Tattha ekaṃyeva sotanti puṭṭho dvinnaṃ atthitāya paṭikkhipati. Puna puṭṭho yasmā tadeva dhammupatthaddhaṃ dibbasotaṃ nāma hoti, tasmā paṭijānāti. Sesaṃ heṭṭhā vuttanayamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dibbasotakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Yathākammūpagatañāṇakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "377"
      },
      ". Idāni ",
      " yathākammūpagatañāṇakathā nāma hoti. Tattha yesaṃ ‘‘iti dibbena cakkhunā visuddhena…pe… yathākammūpage satte pajānātī’’ti (dī. ni. 1.246; paṭi. ma. 1.106) suttaṃ ayoniso gahetvā yathākammūpagatañāṇameva dibbacakkhunti laddhi, te sandhāya pucchā sakavādissa, paṭiññā itarassa. Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathākammūpagatañca manasi karotī"
      },
      "ti puṭṭho ekacittassa ārammaṇadvayābhāvā paṭikkhipati. Dutiyaṃ puṭṭho nānācittavasena paṭijānāti. Puna lesokāsaṃ adatvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvinnaṃ phassāna"
      },
      "nti puṭṭho paṭikkhipati. Iti yathā iminā yathākammūpagatapadena, evameva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ime vata bhonto"
      },
      ", ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sattā"
      },
      "tiādipadehipi saddhiṃ yojanāsu attho veditabbo."
    ],
    "innerText": "377. Idāni yathākammūpagatañāṇakathā nāma hoti. Tattha yesaṃ ‘‘iti dibbena cakkhunā visuddhena…pe… yathākammūpage satte pajānātī’’ti (dī. ni. 1.246; paṭi. ma. 1.106) suttaṃ ayoniso gahetvā yathākammūpagatañāṇameva dibbacakkhunti laddhi, te sandhāya pucchā sakavādissa, paṭiññā itarassa. Puna yathākammūpagatañca manasi karotīti puṭṭho ekacittassa ārammaṇadvayābhāvā paṭikkhipati. Dutiyaṃ puṭṭho nānācittavasena paṭijānāti. Puna lesokāsaṃ adatvā dvinnaṃ phassānanti puṭṭho paṭikkhipati. Iti yathā iminā yathākammūpagatapadena, evameva ime vata bhonto, sattātiādipadehipi saddhiṃ yojanāsu attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "378"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āyasmā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāriputto yathākammūpagataṃ ñāṇaṃ jānātī"
      },
      "ti idaṃ sakavādī yasmā thero appicchatāya abhiññāñāṇāni na vaḷañjetīti ekacce na jānanti, tāni panassa neva atthīti maññanti, tasmā taṃ ‘‘dibbacakkhuno alābhī thero’’ti maññamānaṃ pucchati. Teneva kāraṇena ‘‘atthāyasmato sāriputtassa dibbacakkhū’’ti parato puṭṭho paṭikkhipati. Dutiyaṃ puṭṭho yaṃkiñci sāvakena pattabbaṃ, sabbaṃ taṃ therena anuppattanti paṭijānāti. Idānissa vikkhepaṃ karonto sakavādī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nanu āyasmā sāriputto"
      },
      "tiādimāha. Imañhi gāthaṃ thero vaḷañjanapaṇidhiyā eva abhāvena āha, na abhiññāñāṇassa abhāvena. Paravādī pana abhāvenevāti atthaṃ sallakkheti. Tasmā tassa laddhiyā therassa yathākammūpagatañāṇameva atthi, no dibbacakkhu. Tena vuttaṃ ‘‘tena hi na vattabbaṃ yathākammūpagatañāṇaṃ dibbacakkhū’’ti."
    ],
    "innerText": "378.Āyasmāsāriputto yathākammūpagataṃ ñāṇaṃ jānātīti idaṃ sakavādī yasmā thero appicchatāya abhiññāñāṇāni na vaḷañjetīti ekacce na jānanti, tāni panassa neva atthīti maññanti, tasmā taṃ ‘‘dibbacakkhuno alābhī thero’’ti maññamānaṃ pucchati. Teneva kāraṇena ‘‘atthāyasmato sāriputtassa dibbacakkhū’’ti parato puṭṭho paṭikkhipati. Dutiyaṃ puṭṭho yaṃkiñci sāvakena pattabbaṃ, sabbaṃ taṃ therena anuppattanti paṭijānāti. Idānissa vikkhepaṃ karonto sakavādī nanu āyasmā sāriputtotiādimāha. Imañhi gāthaṃ thero vaḷañjanapaṇidhiyā eva abhāvena āha, na abhiññāñāṇassa abhāvena. Paravādī pana abhāvenevāti atthaṃ sallakkheti. Tasmā tassa laddhiyā therassa yathākammūpagatañāṇameva atthi, no dibbacakkhu. Tena vuttaṃ ‘‘tena hi na vattabbaṃ yathākammūpagatañāṇaṃ dibbacakkhū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Yathākammūpagatañāṇakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Saṃvarakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "379"
      },
      ". Idāni saṃvarakathā nāma hoti. Tattha yesaṃ tāvatiṃse deve upādāya tatuttari devesu yasmā te pañca verāni na samācaranti, tasmā saṃvaro atthīti laddhi, te sandhāya pucchā ",
      " sakavādissa, verasamudācāraṃ apassato paṭiññā itarassa. Tato yasmā saṃvaro nāma saṃvaritabbe asaṃvare sati hoti, tasmā asaṃvarapucchā sakavādissa, devesu pāṇātipātādīnaṃ abhāvena paṭikkhepo itarassa."
    ],
    "innerText": "379. Idāni saṃvarakathā nāma hoti. Tattha yesaṃ tāvatiṃse deve upādāya tatuttari devesu yasmā te pañca verāni na samācaranti, tasmā saṃvaro atthīti laddhi, te sandhāya pucchā sakavādissa, verasamudācāraṃ apassato paṭiññā itarassa. Tato yasmā saṃvaro nāma saṃvaritabbe asaṃvare sati hoti, tasmā asaṃvarapucchā sakavādissa, devesu pāṇātipātādīnaṃ abhāvena paṭikkhepo itarassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthi manussesū"
      },
      "tiādi saṃvare sati asaṃvarassa asaṃvare ca sati saṃvarassa pavattidassanatthaṃ vuttaṃ."
    ],
    "innerText": "Atthi manussesūtiādi saṃvare sati asaṃvarassa asaṃvare ca sati saṃvarassa pavattidassanatthaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "380"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṇātipātā veramaṇī"
      },
      "ti ādipañhesu pāṇātipātādīnaṃ asamācaraṇavasena paṭiññā, pāṇātipātādīnaṃ natthitāya paṭikkhepo veditabbo. Paṭilomapañhā uttānatthāyeva."
    ],
    "innerText": "380.Pāṇātipātā veramaṇīti ādipañhesu pāṇātipātādīnaṃ asamācaraṇavasena paṭiññā, pāṇātipātādīnaṃ natthitāya paṭikkhepo veditabbo. Paṭilomapañhā uttānatthāyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Avasāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "natthi devesu saṃvaro"
      },
      "tipañhe ",
      " pāṇātipātādīni katvā puna tato saṃvarābhāvaṃ sandhāya paṭiññā sakavādissa. Tato chalavasena ",
      " yadi saṃvaro natthi, sabbe devā pāṇātipātinotiādipucchā paravādissa. Devānaṃ verasamudācārassa abhāvena paṭikkhepo sakavādissa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Naheva"
      },
      "nti vacanamattaṃ gahetvā laddhipatiṭṭhāpanaṃ paravādissa. Evaṃ patiṭṭhitā pana laddhi appatiṭṭhitāva hotīti."
    ],
    "innerText": "Avasāne natthi devesu saṃvarotipañhe pāṇātipātādīni katvā puna tato saṃvarābhāvaṃ sandhāya paṭiññā sakavādissa. Tato chalavasena yadi saṃvaro natthi, sabbe devā pāṇātipātinotiādipucchā paravādissa. Devānaṃ verasamudācārassa abhāvena paṭikkhepo sakavādissa. Nahevanti vacanamattaṃ gahetvā laddhipatiṭṭhāpanaṃ paravādissa. Evaṃ patiṭṭhitā pana laddhi appatiṭṭhitāva hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṃvarakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Asaññakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "381"
      },
      ". Idāni asaññakathā nāma hoti. Tattha yesaṃ ‘‘saṅkhārapaccayā viññāṇa’’nti vacanato vinā viññāṇena paṭisandhi nāma natthi. ‘‘Saññuppādā ca pana te devā tamhā kāyā cavantī’’ti vacanato asaññasattānampi cutipaṭisandhikkhaṇe saññā atthīti laddhi, seyyathāpi etarahi andhakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Tato naṃ sakavādī ‘‘kiṃ te taṃ ṭhānaṃ saññābhavo’’tiādīhi codetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saññābhavo saññāgatī"
      },
      "tiādimāha. Taṃ sabbaṃ tato parañca pāḷinayeneva veditabbanti."
    ],
    "innerText": "381. Idāni asaññakathā nāma hoti. Tattha yesaṃ ‘‘saṅkhārapaccayā viññāṇa’’nti vacanato vinā viññāṇena paṭisandhi nāma natthi. ‘‘Saññuppādā ca pana te devā tamhā kāyā cavantī’’ti vacanato asaññasattānampi cutipaṭisandhikkhaṇe saññā atthīti laddhi, seyyathāpi etarahi andhakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Tato naṃ sakavādī ‘‘kiṃ te taṃ ṭhānaṃ saññābhavo’’tiādīhi codetuṃ saññābhavo saññāgatītiādimāha. Taṃ sabbaṃ tato parañca pāḷinayeneva veditabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Asaññakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "12. Nevasaññānāsaññāyatanakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "384"
      },
      ". Idāni ",
      " nevasaññānāsaññāyatanakathā nāma hoti. Tattha yesaṃ ‘‘nevasaññānāsaññāyatana’’nti vacanato na vattabbaṃ ‘‘tasmiṃ bhave saññā atthī’’ti laddhi, seyyathāpi etarahi andhakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Sesamettha sabbaṃ pāḷinayeneva veditabbanti."
    ],
    "innerText": "384. Idāni nevasaññānāsaññāyatanakathā nāma hoti. Tattha yesaṃ ‘‘nevasaññānāsaññāyatana’’nti vacanato na vattabbaṃ ‘‘tasmiṃ bhave saññā atthī’’ti laddhi, seyyathāpi etarahi andhakānaṃ; te sandhāya pucchā sakavādissa, paṭiññā itarassa. Sesamettha sabbaṃ pāḷinayeneva veditabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nevasaññānāsaññāyatanakathāvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tatiyo vaggo."
  }
]