[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "22. Ñāṇadassanavisuddhiniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Paṭhamamaggañāṇakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "806"
      },
      ". Ito ",
      " paraṃ gotrabhuñāṇaṃ hoti, taṃ maggassa āvajjanaṭṭhāniyattā neva paṭipadāñāṇadassanavisuddhiṃ na ñāṇadassanavisuddhiṃ bhajati, antarā abbohārikameva hoti. Vipassanāsote patitattā pana vipassanāti saṅkhaṃ gacchati. Sotāpattimaggo sakadāgāmimaggo anāgāmimaggo arahattamaggoti imesu pana catūsu maggesu ñāṇaṃ ñāṇadassanavisuddhi nāma."
    ],
    "innerText": "806. Ito paraṃ gotrabhuñāṇaṃ hoti, taṃ maggassa āvajjanaṭṭhāniyattā neva paṭipadāñāṇadassanavisuddhiṃ na ñāṇadassanavisuddhiṃ bhajati, antarā abbohārikameva hoti. Vipassanāsote patitattā pana vipassanāti saṅkhaṃ gacchati. Sotāpattimaggo sakadāgāmimaggo anāgāmimaggo arahattamaggoti imesu pana catūsu maggesu ñāṇaṃ ñāṇadassanavisuddhi nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha paṭhamamaggañāṇaṃ tāva sampādetukāmena aññaṃ kiñci kātabbaṃ nāma natthi. Yañhi anena kātabbaṃ siyā, taṃ anulomāvasānaṃ vipassanaṃ uppādentena katameva. Evaṃ uppannaanulomañāṇassa panassa tehi tīhipi anulomañāṇehi attano balānurūpena thūlathūle saccapaṭicchādake tamamhi antaradhāpite sabbasaṅkhāragatesu cittaṃ na pakkhandati, na santiṭṭhati, nādhimuccati, na sajjati, na laggati, na bajjhati. Padumapalāsato udakaṃ viya patilīyati patikuṭati pativattati. Sabbaṃ nimittārammaṇampi sabbaṃ pavattārammaṇampi palibodhato upaṭṭhāti. Athassa sabbasmiṃ nimittapavattārammaṇe palibodhato upaṭṭhite anulomañāṇassa āsevanante animittaṃ appavattaṃ visaṅkhāraṃ nirodhaṃ nibbānaṃ ārammaṇaṃ kurumānaṃ puthujjanagottaṃ puthujjanasaṅkhaṃ puthujjanabhūmiṃ atikkamamānaṃ ariyagottaṃ ariyasaṅkhaṃ ariyabhūmiṃ okkamamānaṃ nibbānārammaṇe paṭhamāvaṭṭanapaṭhamābhogapaṭhamasamannāhārabhūtaṃ maggassa anantarasamanantarāsevanaupanissayanatthivigatavasena chahi ākārehi paccayabhāvaṃ sādhayamānaṃ sikhāppattaṃ vipassanāya muddhabhūtaṃ apunarāvaṭṭakaṃ uppajjati gotrabhuñāṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yaṃ sandhāya vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Kathaṃ ",
      " bahiddhā vuṭṭhānavivaṭṭane paññā gotrabhuñāṇaṃ? Uppādaṃ abhibhuyyatīti gotrabhu. Pavattaṃ…pe… upāyāsaṃ abhibhuyyatīti gotrabhu. Bahiddhā saṅkhāranimittaṃ abhibhuyyatīti gotrabhu. Anuppādaṃ pakkhandatīti gotrabhu. Appavattaṃ…pe… anupāyāsaṃ nirodhaṃ nibbānaṃ pakkhandatīti ",
      " gotrabhu. Uppādaṃ abhibhuyyitvā anuppādaṃ pakkhandatīti gotrabhū’’ti (paṭi. ma. 1.59) sabbaṃ vitthāretabbaṃ."
    ],
    "innerText": "‘‘Kathaṃ bahiddhā vuṭṭhānavivaṭṭane paññā gotrabhuñāṇaṃ? Uppādaṃ abhibhuyyatīti gotrabhu. Pavattaṃ…pe… upāyāsaṃ abhibhuyyatīti gotrabhu. Bahiddhā saṅkhāranimittaṃ abhibhuyyatīti gotrabhu. Anuppādaṃ pakkhandatīti gotrabhu. Appavattaṃ…pe… anupāyāsaṃ nirodhaṃ nibbānaṃ pakkhandatīti gotrabhu. Uppādaṃ abhibhuyyitvā anuppādaṃ pakkhandatīti gotrabhū’’ti (paṭi. ma. 1.59) sabbaṃ vitthāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "807"
      },
      ". Tatrāyaṃ ekāvajjanena ekavīthiyaṃ pavattamānānampi anulomagotrabhūnaṃ nānārammaṇe pavattanākāradīpikā upamā – yathā hi mahāmātikaṃ laṅghitvā paratīre patiṭṭhātukāmo puriso vegena dhāvitvā mātikāya orimatīre rukkhasākhāya bandhitvā olambitaṃ rajjuṃ vā yaṭṭhiṃ vā gahetvā ullaṅghitvā paratīraninnapoṇapabbhārakāyo hutvā paratīrassa uparibhāgaṃ patto taṃ muñcitvā vedhamāno paratīre patitvā saṇikaṃ patiṭṭhāti, evamevāyaṃ yogāvacaropi bhavayonigatiṭṭhitinivāsānaṃ paratīrabhūte nibbāne patiṭṭhātukāmo udayabbayānupassanādinā vegena dhāvitvā attabhāvarukkhasākhāya bandhitvā olambitaṃ rūparajjuṃ vā vedanādīsu aññataradaṇḍaṃ vā aniccanti vā dukkhanti vā anattāti vāti anulomāvajjanena gahetvā taṃ amuñcamānova paṭhamena anulomacittena ullaṅghitvā dutiyena paratīraninnapoṇapabbhārakāyo viya nibbānaninnapoṇapabbhāramānaso hutvā tatiyena paratīrassa uparibhāgaṃ patto viya idāni pattabbassa nibbānassa āsanno hutvā tassa cittassa nirodhena taṃ saṅkhārārammaṇaṃ muñcitvā gotrabhucittena visaṅkhāre paratīrabhūte nibbāne patati. Ekārammaṇe pana aladdhāsevanatāya vedhamāno so puriso viya na tāva suppatiṭṭhito hoti, tato maggañāṇena patiṭṭhātīti."
    ],
    "innerText": "807. Tatrāyaṃ ekāvajjanena ekavīthiyaṃ pavattamānānampi anulomagotrabhūnaṃ nānārammaṇe pavattanākāradīpikā upamā – yathā hi mahāmātikaṃ laṅghitvā paratīre patiṭṭhātukāmo puriso vegena dhāvitvā mātikāya orimatīre rukkhasākhāya bandhitvā olambitaṃ rajjuṃ vā yaṭṭhiṃ vā gahetvā ullaṅghitvā paratīraninnapoṇapabbhārakāyo hutvā paratīrassa uparibhāgaṃ patto taṃ muñcitvā vedhamāno paratīre patitvā saṇikaṃ patiṭṭhāti, evamevāyaṃ yogāvacaropi bhavayonigatiṭṭhitinivāsānaṃ paratīrabhūte nibbāne patiṭṭhātukāmo udayabbayānupassanādinā vegena dhāvitvā attabhāvarukkhasākhāya bandhitvā olambitaṃ rūparajjuṃ vā vedanādīsu aññataradaṇḍaṃ vā aniccanti vā dukkhanti vā anattāti vāti anulomāvajjanena gahetvā taṃ amuñcamānova paṭhamena anulomacittena ullaṅghitvā dutiyena paratīraninnapoṇapabbhārakāyo viya nibbānaninnapoṇapabbhāramānaso hutvā tatiyena paratīrassa uparibhāgaṃ patto viya idāni pattabbassa nibbānassa āsanno hutvā tassa cittassa nirodhena taṃ saṅkhārārammaṇaṃ muñcitvā gotrabhucittena visaṅkhāre paratīrabhūte nibbāne patati. Ekārammaṇe pana aladdhāsevanatāya vedhamāno so puriso viya na tāva suppatiṭṭhito hoti, tato maggañāṇena patiṭṭhātīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "808"
      },
      ". Tattha anulomaṃ saccapaṭicchādakaṃ kilesatamaṃ vinodetuṃ sakkoti, na nibbānamārammaṇaṃ kātuṃ. Gotrabhu nibbānameva ārammaṇaṃ kātuṃ sakkoti, na saccapaṭicchādakaṃ tamaṃ vinodetuṃ. Tatrāyaṃ upamā – eko kira cakkhumā puriso ‘‘nakkhattayogaṃ jānissāmī’’ti rattibhāge nikkhamitvā candaṃ passituṃ uddhaṃ ullokesi, tassa valāhakehi paṭicchannattā cando na paññāyittha. Atheko vāto uṭṭhahitvā thūlathūle valāhake viddhaṃseti. Aparo majjhime, aparo sukhumeti. Tato so puriso vigatavalāhake nabhe candaṃ disvā nakkhattayogaṃ aññāsi."
    ],
    "innerText": "808. Tattha anulomaṃ saccapaṭicchādakaṃ kilesatamaṃ vinodetuṃ sakkoti, na nibbānamārammaṇaṃ kātuṃ. Gotrabhu nibbānameva ārammaṇaṃ kātuṃ sakkoti, na saccapaṭicchādakaṃ tamaṃ vinodetuṃ. Tatrāyaṃ upamā – eko kira cakkhumā puriso ‘‘nakkhattayogaṃ jānissāmī’’ti rattibhāge nikkhamitvā candaṃ passituṃ uddhaṃ ullokesi, tassa valāhakehi paṭicchannattā cando na paññāyittha. Atheko vāto uṭṭhahitvā thūlathūle valāhake viddhaṃseti. Aparo majjhime, aparo sukhumeti. Tato so puriso vigatavalāhake nabhe candaṃ disvā nakkhattayogaṃ aññāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " tayo valāhakā viya saccapaṭicchādakathūlamajjhimasukhumaṃ kilesandhakāraṃ, tayo vātā viya tīṇi anulomacittāni, cakkhumā puriso viya gotrabhuñāṇaṃ, cando viya nibbānaṃ, ekekassa vātassa yathākkamena valāhakaviddhaṃsanaṃ viya ekekassa anulomacittassa saccapaṭicchādakatamavinodanaṃ, vigatavalāhake nabhe tassa purisassa visuddhacandadassanaṃ viya vigate saccapaṭicchādake tame gotrabhuñāṇassa visuddhanibbānadassanaṃ."
    ],
    "innerText": "Tattha tayo valāhakā viya saccapaṭicchādakathūlamajjhimasukhumaṃ kilesandhakāraṃ, tayo vātā viya tīṇi anulomacittāni, cakkhumā puriso viya gotrabhuñāṇaṃ, cando viya nibbānaṃ, ekekassa vātassa yathākkamena valāhakaviddhaṃsanaṃ viya ekekassa anulomacittassa saccapaṭicchādakatamavinodanaṃ, vigatavalāhake nabhe tassa purisassa visuddhacandadassanaṃ viya vigate saccapaṭicchādake tame gotrabhuñāṇassa visuddhanibbānadassanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yatheva hi tayo vātā candapaṭicchādake valāhakeyeva viddhaṃsetuṃ sakkonti, na candaṃ daṭṭhuṃ, evaṃ anulomāni saccapaṭicchādakaṃ tamaññeva vinodetuṃ sakkonti, na nibbānaṃ daṭṭhuṃ. Yathā so puriso candameva daṭṭhuṃ sakkoti, na valāhake viddhaṃsetuṃ, evaṃ gotrabhuñāṇaṃ nibbānameva daṭṭhuṃ sakkoti, na kilesatamaṃ vinodetuṃ. Teneva cetaṃ maggassa āvajjananti vuccati. Tañhi anāvajjanampi samānaṃ āvajjanaṭṭhāne ṭhatvā ‘‘evaṃ nibbattāhī’’ti maggassa saññaṃ datvā viya nirujjhati. Maggopi tena dinnasaññaṃ amuñcitvāva avīcisantativasena taṃ ñāṇaṃ anuppabandhamāno anibbiddhapubbaṃ apadālitapubbaṃ lobhakkhandhaṃ dosakkhandhaṃ mohakkhandhaṃ nibbijjhamānova padālayamānova nibbattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "809"
      },
      ". Tatrāyaṃ upamā – eko kira issāso aṭṭhausabhamatte padese phalakasataṃ ṭhapāpetvā vatthena mukhaṃ veṭhetvā saraṃ sannahitvā cakkayante aṭṭhāsi. Añño puriso cakkayantaṃ āvijjhitvā yadā issāsassa phalakaṃ abhimukhaṃ hoti, tadā tattha daṇḍakena saññaṃ deti. Issāso daṇḍakasaññaṃ amuñcitvāva saraṃ khipitvā phalakasataṃ nibbijjhati. Tattha daṇḍakasaññaṃ viya gotrabhuñāṇaṃ, issāso viya maggañāṇaṃ. Issāsassa daṇḍakasaññaṃ amuñcitvāva phalakasatanibbijjhanaṃ viya maggañāṇassa gotrabhuñāṇena dinnasaññaṃ amuñcitvāva nibbānaṃ ārammaṇaṃ katvā anibbiddhapubbānaṃ apadālitapubbānaṃ lobhadosamohakkhandhānaṃ nibbijjhanapadālanaṃ."
    ],
    "innerText": "809. Tatrāyaṃ upamā – eko kira issāso aṭṭhausabhamatte padese phalakasataṃ ṭhapāpetvā vatthena mukhaṃ veṭhetvā saraṃ sannahitvā cakkayante aṭṭhāsi. Añño puriso cakkayantaṃ āvijjhitvā yadā issāsassa phalakaṃ abhimukhaṃ hoti, tadā tattha daṇḍakena saññaṃ deti. Issāso daṇḍakasaññaṃ amuñcitvāva saraṃ khipitvā phalakasataṃ nibbijjhati. Tattha daṇḍakasaññaṃ viya gotrabhuñāṇaṃ, issāso viya maggañāṇaṃ. Issāsassa daṇḍakasaññaṃ amuñcitvāva phalakasatanibbijjhanaṃ viya maggañāṇassa gotrabhuñāṇena dinnasaññaṃ amuñcitvāva nibbānaṃ ārammaṇaṃ katvā anibbiddhapubbānaṃ apadālitapubbānaṃ lobhadosamohakkhandhānaṃ nibbijjhanapadālanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "810"
      },
      ". Na kevalañcesa maggo lobhakkhandhādīnaṃ nibbijjhanameva karoti, apica kho anamataggasaṃsāravaṭṭadukkhasamuddaṃ soseti, sabbaapāyadvārāni pidahati, sattannaṃ ariyadhanānaṃ sammukhībhāvaṃ karoti, aṭṭhaṅgikaṃ micchāmaggaṃ pajahati, sabbaverabhayāni vūpasameti, sammāsambuddhassa orasaputtabhāvaṃ upaneti ",
      ", aññesañca anekasatānaṃ ānisaṃsānaṃ paṭilābhāya saṃvattatīti evaṃ anekānisaṃsadāyakena sotāpattimaggena sampayuttaṃ ñāṇaṃ sotāpattimagge ñāṇanti."
    ],
    "innerText": "810. Na kevalañcesa maggo lobhakkhandhādīnaṃ nibbijjhanameva karoti, apica kho anamataggasaṃsāravaṭṭadukkhasamuddaṃ soseti, sabbaapāyadvārāni pidahati, sattannaṃ ariyadhanānaṃ sammukhībhāvaṃ karoti, aṭṭhaṅgikaṃ micchāmaggaṃ pajahati, sabbaverabhayāni vūpasameti, sammāsambuddhassa orasaputtabhāvaṃ upaneti , aññesañca anekasatānaṃ ānisaṃsānaṃ paṭilābhāya saṃvattatīti evaṃ anekānisaṃsadāyakena sotāpattimaggena sampayuttaṃ ñāṇaṃ sotāpattimagge ñāṇanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamamaggañāṇaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sotāpannapuggalakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "811"
      },
      ". Imassa pana ñāṇassa anantaraṃ tasseva vipākabhūtāni dve tīṇi vā phalacittāni uppajjanti. Anantaravipākattāyeva hi lokuttarakusalānaṃ ‘‘samādhimānantarikaññamāhū’’ti (khu. pā. 6.5) ca ‘‘dandhaṃ ānantarikaṃ pāpuṇāti āsavānaṃ khayāyā’’ti (a. ni. 4.162) ca ādi vuttaṃ. Keci pana ekaṃ dve tīṇi cattāri vā phalacittānīti vadanti, taṃ na gahetabbaṃ."
    ],
    "innerText": "811. Imassa pana ñāṇassa anantaraṃ tasseva vipākabhūtāni dve tīṇi vā phalacittāni uppajjanti. Anantaravipākattāyeva hi lokuttarakusalānaṃ ‘‘samādhimānantarikaññamāhū’’ti (khu. pā. 6.5) ca ‘‘dandhaṃ ānantarikaṃ pāpuṇāti āsavānaṃ khayāyā’’ti (a. ni. 4.162) ca ādi vuttaṃ. Keci pana ekaṃ dve tīṇi cattāri vā phalacittānīti vadanti, taṃ na gahetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anulomassa hi āsevanante gotrabhuñāṇaṃ uppajjati. Tasmā sabbantimena paricchedena dvīhi anulomacittehi bhavitabbaṃ. Na hi ekaṃ āsevanapaccayaṃ labhati, sattacittaparamā ca ekāvajjanavīthi. Tasmā yassa dve anulomāni, tassa tatiyaṃ gotrabhu catutthaṃ maggacittaṃ tīṇi phalacittāni honti. Yassa tīṇi anulomāni, tassa catutthaṃ gotrabhu pañcamaṃ maggacittaṃ dve phalacittāni honti. Tena vuttaṃ ‘‘dve tīṇi vā phalacittāni uppajjantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Keci pana yassa cattāri anulomāni, tassa pañcamaṃ gotrabhu chaṭṭhaṃ maggacittaṃ ekaṃ phalacittanti vadanti, taṃ pana yasmā catutthaṃ pañcamaṃ vā appeti, na tato paraṃ āsannabhavaṅgattāti paṭikkhittaṃ. Tasmā na sārato paccetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "812"
      },
      ". Ettāvatā ca panesa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sotāpanno"
      },
      " nāma dutiyo ariyapuggalo hoti. Bhusaṃ pamattopi hutvā sattakkhattuṃ devesu ca manussesu ca sandhāvitvā saṃsaritvā dukkhassantassa karaṇasamattho hoti. Phalapariyosāne panassa cittaṃ bhavaṅgaṃ otarati, tato bhavaṅgaṃ upacchinditvā maggapaccavekkhaṇatthāya uppajjati manodvārāvajjanaṃ, tasmiṃ niruddhe paṭipāṭiyā satta maggapaccavekkhaṇajavanānīti. Puna bhavaṅgaṃ otaritvā teneva nayena ",
      " phalādīnaṃ paccavekkhaṇatthāya āvajjanādīni ",
      " uppajjanti. Yesaṃ uppattiyā esa maggaṃ paccavekkhati, phalaṃ paccavekkhati, pahīnakilese paccavekkhati, avasiṭṭhakilese paccavekkhati, nibbānaṃ paccavekkhati."
    ],
    "innerText": "812. Ettāvatā ca panesa sotāpanno nāma dutiyo ariyapuggalo hoti. Bhusaṃ pamattopi hutvā sattakkhattuṃ devesu ca manussesu ca sandhāvitvā saṃsaritvā dukkhassantassa karaṇasamattho hoti. Phalapariyosāne panassa cittaṃ bhavaṅgaṃ otarati, tato bhavaṅgaṃ upacchinditvā maggapaccavekkhaṇatthāya uppajjati manodvārāvajjanaṃ, tasmiṃ niruddhe paṭipāṭiyā satta maggapaccavekkhaṇajavanānīti. Puna bhavaṅgaṃ otaritvā teneva nayena phalādīnaṃ paccavekkhaṇatthāya āvajjanādīni uppajjanti. Yesaṃ uppattiyā esa maggaṃ paccavekkhati, phalaṃ paccavekkhati, pahīnakilese paccavekkhati, avasiṭṭhakilese paccavekkhati, nibbānaṃ paccavekkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So hi ‘‘iminā vatāhaṃ maggena āgato’’ti maggaṃ paccavekkhati, tato ‘‘ayaṃ me ānisaṃso laddho’’ti phalaṃ paccavekkhati. Tato ‘‘ime nāma me kilesā pahīnā’’ti pahīnakilese paccavekkhati. Tato ‘‘ime nāma me kilesā avasiṭṭhā’’ti uparimaggattayavajjhe kilese paccavekkhati. Avasāne ca ‘‘ayaṃ me dhammo ārammaṇato paṭividdho’’ti amataṃ nibbānaṃ paccavekkhati. Iti sotāpannassa ariyasāvakassa pañca paccavekkhaṇāni honti. Yathā ca sotāpannassa, evaṃ sakadāgāmianāgāmīnampi. Arahato pana avasiṭṭhakilesapaccavekkhaṇaṃ nāma natthīti. Evaṃ sabbānipi ekūnavīsati paccavekkhaṇāni nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ukkaṭṭhaparicchedoyeva ceso. Pahīnāvasiṭṭhakilesapaccavekkhaṇañhi sekkhānampi hoti vā na vā. Tassa hi paccavekkhaṇassa abhāveneva mahānāmo bhagavantaṃ pucchi ‘‘kosu nāma me dhammo ajjhattaṃ appahīno, yena me ekadā lobhadhammāpi cittaṃ pariyādāya tiṭṭhantī’’ti (ma. ni. 1.175) sabbaṃ vitthārato veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dutiyamaggañāṇakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "813"
      },
      ". Evaṃ paccavekkhitvā pana so sotāpanno ariyasāvako tasmiññeva vā āsane nisinno, aparena vā samayena kāmarāgabyāpādānaṃ tanubhāvāya dutiyāya bhūmiyā pattiyā yogaṃ karoti. So indriyabalabojjhaṅgāni samodhānetvā tadeva rūpavedanāsaññāsaṅkhāraviññāṇabhedaṃ saṅkhāragataṃ aniccaṃ dukkhamanattāti ñāṇena parimaddati, parivatteti, vipassanāvīthiṃ ogāhati. Tassevaṃ paṭipannassa vuttanayeneva saṅkhārupekkhāvasāne ekāvajjanena anulomagotrabhuñāṇesu uppannesu gotrabhuanantaraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sakadāgāmimaggo"
      },
      " uppajjati. Tena sampayuttaṃ ñāṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sakadāgāmimagge ñāṇa"
      },
      "nti."
    ],
    "innerText": "813. Evaṃ paccavekkhitvā pana so sotāpanno ariyasāvako tasmiññeva vā āsane nisinno, aparena vā samayena kāmarāgabyāpādānaṃ tanubhāvāya dutiyāya bhūmiyā pattiyā yogaṃ karoti. So indriyabalabojjhaṅgāni samodhānetvā tadeva rūpavedanāsaññāsaṅkhāraviññāṇabhedaṃ saṅkhāragataṃ aniccaṃ dukkhamanattāti ñāṇena parimaddati, parivatteti, vipassanāvīthiṃ ogāhati. Tassevaṃ paṭipannassa vuttanayeneva saṅkhārupekkhāvasāne ekāvajjanena anulomagotrabhuñāṇesu uppannesu gotrabhuanantaraṃ sakadāgāmimaggo uppajjati. Tena sampayuttaṃ ñāṇaṃ sakadāgāmimagge ñāṇanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyañāṇaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Tatiyamaggañāṇakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "814"
      },
      ". Imassāpi ",
      " ñāṇassa anantaraṃ vuttanayeneva phalacittāni veditabbāni. Ettāvatā cesa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sakadāgāmī"
      },
      " nāma catuttho ariyapuggalo hoti sakiṃdeva imaṃ lokaṃ āgantvā dukkhassantakaraṇasamattho. Tato paraṃ paccavekkhaṇaṃ vuttanayameva."
    ],
    "innerText": "814. Imassāpi ñāṇassa anantaraṃ vuttanayeneva phalacittāni veditabbāni. Ettāvatā cesa sakadāgāmī nāma catuttho ariyapuggalo hoti sakiṃdeva imaṃ lokaṃ āgantvā dukkhassantakaraṇasamattho. Tato paraṃ paccavekkhaṇaṃ vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ paccavekkhitvā ca so sakadāgāmī ariyasāvako tasmiññeva vā āsane nisinno aparena vā samayena kāmarāgabyāpādānaṃ anavasesappahānāya tatiyāya bhūmiyā pattiyā yogaṃ karoti, so indriyabalabojjhaṅgāni samodhānetvā tadeva saṅkhāragataṃ aniccaṃ dukkhamanattāti ñāṇena parimaddati, parivatteti, vipassanāvīthiṃ ogāhati. Tassevaṃ paṭipannassa vuttanayeneva saṅkhārupekkhāvasāne ekāvajjanena anulomagotrabhuñāṇesu uppannesu gotrabhuanantaraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāgāmimaggo"
      },
      " uppajjati, tena sampayuttaṃ ñāṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāgāmimagge ñāṇa"
      },
      "nti."
    ],
    "innerText": "Evaṃ paccavekkhitvā ca so sakadāgāmī ariyasāvako tasmiññeva vā āsane nisinno aparena vā samayena kāmarāgabyāpādānaṃ anavasesappahānāya tatiyāya bhūmiyā pattiyā yogaṃ karoti, so indriyabalabojjhaṅgāni samodhānetvā tadeva saṅkhāragataṃ aniccaṃ dukkhamanattāti ñāṇena parimaddati, parivatteti, vipassanāvīthiṃ ogāhati. Tassevaṃ paṭipannassa vuttanayeneva saṅkhārupekkhāvasāne ekāvajjanena anulomagotrabhuñāṇesu uppannesu gotrabhuanantaraṃ anāgāmimaggo uppajjati, tena sampayuttaṃ ñāṇaṃ anāgāmimagge ñāṇanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tatiyañāṇaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Catutthamaggañāṇakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "815"
      },
      ". Imassapi ñāṇassa anantaraṃ vuttanayeneva phalacittāni veditabbāni. Ettāvatā cesa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāgāmī"
      },
      " nāma chaṭṭho ariyapuggalo hoti opapātiko tatthaparinibbāyī anāvattidhammo paṭisandhivasena imaṃ lokaṃ puna anāgantā. Tato paraṃ paccavekkhaṇaṃ vuttanayameva."
    ],
    "innerText": "815. Imassapi ñāṇassa anantaraṃ vuttanayeneva phalacittāni veditabbāni. Ettāvatā cesa anāgāmī nāma chaṭṭho ariyapuggalo hoti opapātiko tatthaparinibbāyī anāvattidhammo paṭisandhivasena imaṃ lokaṃ puna anāgantā. Tato paraṃ paccavekkhaṇaṃ vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ paccavekkhitvā ca so anāgāmī ariyasāvako tasmiññeva vā āsane nisinno, aparena vā samayena rūpārūparāgamānauddhaccaavijjānaṃ anavasesappahānāya catutthāya bhūmiyā pattiyā yogaṃ karoti, so indriyabalabojjhaṅgāni samodhānetvā tadeva saṅkhāragataṃ aniccaṃ dukkhamanattāti ñāṇena parimaddati, parivatteti, vipassanāvīthiṃ ogāhati. Tassevaṃ paṭipannassa vuttanayeneva saṅkhārupekkhāvasāne ekāvajjanena anulomagotrabhuñāṇesu ",
      " uppannesu gotrabhuanantaraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "arahattamaggo"
      },
      " uppajjati, tena sampayuttaṃ ñāṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "arahattamagge ñāṇa"
      },
      "nti."
    ],
    "innerText": "Evaṃ paccavekkhitvā ca so anāgāmī ariyasāvako tasmiññeva vā āsane nisinno, aparena vā samayena rūpārūparāgamānauddhaccaavijjānaṃ anavasesappahānāya catutthāya bhūmiyā pattiyā yogaṃ karoti, so indriyabalabojjhaṅgāni samodhānetvā tadeva saṅkhāragataṃ aniccaṃ dukkhamanattāti ñāṇena parimaddati, parivatteti, vipassanāvīthiṃ ogāhati. Tassevaṃ paṭipannassa vuttanayeneva saṅkhārupekkhāvasāne ekāvajjanena anulomagotrabhuñāṇesu uppannesu gotrabhuanantaraṃ arahattamaggo uppajjati, tena sampayuttaṃ ñāṇaṃ arahattamagge ñāṇanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catutthañāṇaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Arahantapuggalakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "816"
      },
      ". Imassapi ",
      " ñāṇassa anantaraṃ vuttanayeneva phalacittāni veditabbāni. Ettāvatā cesa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "arahā"
      },
      " nāma aṭṭhamo ariyapuggalo hoti mahākhīṇāsavo antimadehadhārī ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammādaññā vimutto sadevakassa lokassa aggadakkhiṇeyyoti."
    ],
    "innerText": "816. Imassapi ñāṇassa anantaraṃ vuttanayeneva phalacittāni veditabbāni. Ettāvatā cesa arahā nāma aṭṭhamo ariyapuggalo hoti mahākhīṇāsavo antimadehadhārī ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammādaññā vimutto sadevakassa lokassa aggadakkhiṇeyyoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iti yaṃ taṃ vuttaṃ ‘‘sotāpattimaggo sakadāgāmimaggo anāgāmimaggo arahattamaggoti imesu pana catūsu maggesu ñāṇaṃ ñāṇadassanavisuddhi nāmā’’ti, taṃ imāni iminā anukkamena pattabbāni cattāri ñāṇāni sandhāya vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Bodhipakkhiyakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "817"
      },
      ". Idāni imissāyeva catuñāṇāya ñāṇadassanavisuddhiyā ānubhāvavijānanatthaṃ –"
    ],
    "innerText": "817. Idāni imissāyeva catuñāṇāya ñāṇadassanavisuddhiyā ānubhāvavijānanatthaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Paripuṇṇabodhipakkhiya, bhāvo vuṭṭhānabalasamāyogo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ye yena pahātabbā, dhammā tesaṃ pahānañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kiccāni pariññādīni, yāni vuttāni abhisamayakāle;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tāni ca yathāsabhāvena, jānitabbāni sabbānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "818"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paripuṇṇabodhipakkhiya, bhāvo"
      },
      "ti bodhipakkhiyānaṃ paripuṇṇabhāvo. Cattāro satipaṭṭhānā, cattāro sammappadhānā, cattāro iddhipādā, pañcindriyāni, pañca balāni, satta bojjhaṅgā, ariyo aṭṭhaṅgiko maggoti hi ime sattatiṃsa dhammā bujjhanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bodho"
      },
      "ti laddhanāmassa ariyamaggassa pakkhe bhavattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bodhipakkhiyā"
      },
      " nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakkhe bhavattā"
      },
      "ti upakārabhāve ṭhitattā."
    ],
    "innerText": "818. Tattha paripuṇṇabodhipakkhiya, bhāvoti bodhipakkhiyānaṃ paripuṇṇabhāvo. Cattāro satipaṭṭhānā, cattāro sammappadhānā, cattāro iddhipādā, pañcindriyāni, pañca balāni, satta bojjhaṅgā, ariyo aṭṭhaṅgiko maggoti hi ime sattatiṃsa dhammā bujjhanaṭṭhena bodhoti laddhanāmassa ariyamaggassa pakkhe bhavattā bodhipakkhiyā nāma. Pakkhe bhavattāti upakārabhāve ṭhitattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "819"
      },
      ". Tesu ",
      " tesu ārammaṇesu okkhanditvā pakkhanditvā upaṭṭhānato paṭṭhānaṃ. Satiyeva paṭṭhānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satipaṭṭhānaṃ"
      },
      ". Kāyavedanācittadhammesu panassā asubha-dukkha-anicca-anattākāragahaṇavasena ",
      " subha-sukha-nicca-atta-saññāpahānakiccasādhanavasena ca pavattito catudhā bhedo hoti. Tasmā cattāro satipaṭṭhānāti vuccanti."
    ],
    "innerText": "819. Tesu tesu ārammaṇesu okkhanditvā pakkhanditvā upaṭṭhānato paṭṭhānaṃ. Satiyeva paṭṭhānaṃ satipaṭṭhānaṃ. Kāyavedanācittadhammesu panassā asubha-dukkha-anicca-anattākāragahaṇavasena subha-sukha-nicca-atta-saññāpahānakiccasādhanavasena ca pavattito catudhā bhedo hoti. Tasmā cattāro satipaṭṭhānāti vuccanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "820"
      },
      ". Padahanti etenāti padhānaṃ. Sobhanaṃ padhānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammappadhānaṃ"
      },
      ". Sammā vā padahanti etenāti sammappadhānaṃ. Sobhanaṃ vā taṃ kilesavirūpattavirahato padhānañca hitasukhanipphādakattena seṭṭhabhāvāvahanato padhānabhāvakāraṇato cāti sammappadhānaṃ. Vīriyassetaṃ adhivacanaṃ. Tayidaṃ uppannānuppannānaṃ akusalānaṃ pahānānuppattikiccaṃ anuppannuppannānañca kusalānaṃ uppattiṭṭhitikiccaṃ sādhayatīti catubbidhaṃ hoti, tasmā cattāro sammappadhānāti vuccanti."
    ],
    "innerText": "820. Padahanti etenāti padhānaṃ. Sobhanaṃ padhānaṃ sammappadhānaṃ. Sammā vā padahanti etenāti sammappadhānaṃ. Sobhanaṃ vā taṃ kilesavirūpattavirahato padhānañca hitasukhanipphādakattena seṭṭhabhāvāvahanato padhānabhāvakāraṇato cāti sammappadhānaṃ. Vīriyassetaṃ adhivacanaṃ. Tayidaṃ uppannānuppannānaṃ akusalānaṃ pahānānuppattikiccaṃ anuppannuppannānañca kusalānaṃ uppattiṭṭhitikiccaṃ sādhayatīti catubbidhaṃ hoti, tasmā cattāro sammappadhānāti vuccanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "821"
      },
      ". Pubbe vuttena ijjhanaṭṭhena iddhi. Tassā sampayuttāya pubbaṅgamaṭṭhena phalabhūtāya pubbabhāgakāraṇaṭṭhena ca iddhiyā pādoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iddhipādo"
      },
      ". So chandādivasena catubbidho hoti, tasmā cattāro iddhipādāti vuccanti. Yathāha – ‘‘cattāro iddhipādā chandiddhipādo cittiddhipādo vīriyiddhipādo vīmaṃsiddhipādo’’ti (vibha. 457). Ime lokuttarāva. Lokiyā pana ‘‘chandañce bhikkhu adhipatiṃ karitvā labhati samādhiṃ, labhati cittassa ekaggataṃ. Ayaṃ vuccati chandasamādhī’’tiādivacanato (vibha. 432) chandādiadhipativasena paṭiladdhadhammāpi honti."
    ],
    "innerText": "821. Pubbe vuttena ijjhanaṭṭhena iddhi. Tassā sampayuttāya pubbaṅgamaṭṭhena phalabhūtāya pubbabhāgakāraṇaṭṭhena ca iddhiyā pādoti iddhipādo. So chandādivasena catubbidho hoti, tasmā cattāro iddhipādāti vuccanti. Yathāha – ‘‘cattāro iddhipādā chandiddhipādo cittiddhipādo vīriyiddhipādo vīmaṃsiddhipādo’’ti (vibha. 457). Ime lokuttarāva. Lokiyā pana ‘‘chandañce bhikkhu adhipatiṃ karitvā labhati samādhiṃ, labhati cittassa ekaggataṃ. Ayaṃ vuccati chandasamādhī’’tiādivacanato (vibha. 432) chandādiadhipativasena paṭiladdhadhammāpi honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "822"
      },
      ". Assaddhiyakosajjapamādavikkhepasammohānaṃ abhibhavanato abhibhavanasaṅkhātena adhipatiyaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "indriyaṃ"
      },
      ". Assaddhiyādīhi ca anabhibhavanīyato akampiyaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "balaṃ"
      },
      ". Tadubhayampi saddhādivasena pañcavidhaṃ hoti, tasmā pañcindriyāni pañca balānīti vuccanti."
    ],
    "innerText": "822. Assaddhiyakosajjapamādavikkhepasammohānaṃ abhibhavanato abhibhavanasaṅkhātena adhipatiyaṭṭhena indriyaṃ. Assaddhiyādīhi ca anabhibhavanīyato akampiyaṭṭhena balaṃ. Tadubhayampi saddhādivasena pañcavidhaṃ hoti, tasmā pañcindriyāni pañca balānīti vuccanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "823"
      },
      ". Bujjhanakasattassa pana aṅgabhāvena satiādayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satta bojjhaṅgā"
      },
      ". Niyyānikaṭṭhena ca sammādiṭṭhiādayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭha maggaṅgā"
      },
      " honti. Tena vuttaṃ ‘‘satta bojjhaṅgā ariyo aṭṭhaṅgiko maggo’’ti."
    ],
    "innerText": "823. Bujjhanakasattassa pana aṅgabhāvena satiādayo satta bojjhaṅgā. Niyyānikaṭṭhena ca sammādiṭṭhiādayo aṭṭha maggaṅgā honti. Tena vuttaṃ ‘‘satta bojjhaṅgā ariyo aṭṭhaṅgiko maggo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "824"
      },
      ". Iti ",
      " ime sattatiṃsa bodhipakkhiyadhammā pubbabhāge lokiyavipassanāya vattamānāya cuddasavidhena kāyaṃ pariggaṇhato ca kāyānupassanāsatipaṭṭhānaṃ, navavidhena vedanaṃ pariggaṇhato ca vedanānupassanāsatipaṭṭhānaṃ, soḷasavidhena cittaṃ pariggaṇhato ca cittānupassanāsatipaṭṭhānaṃ, pañcavidhena dhamme pariggaṇhato ca dhammānupassanāsatipaṭṭhānaṃ. Imasmiṃ attabhāve ",
      " anuppannapubbaṃ parassa uppannaṃ akusalaṃ disvā ‘‘yathā paṭipannassetaṃ uppannaṃ, na tathā paṭipajjissāmi evaṃ me etaṃ nuppajjissatī’’ti, tassa anuppādāya vāyamanakāle paṭhamaṃ sammappadhānaṃ. Attano samudācārappattaṃ akusalaṃ disvā tassa pahānāya vāyamanakāle dutiyaṃ. Imasmiṃ attabhāve anuppannapubbaṃ jhānaṃ vā vipassanaṃ vā uppādetuṃ vāyamantassa tatiyaṃ. Uppannaṃ yathā na parihāyati, evaṃ punappunaṃ uppādentassa catutthaṃ sammappadhānaṃ. Chandaṃ dhuraṃ katvā kusaluppādanakāle chandiddhipādo. Micchāvācāya viramaṇakāle sammāvācāti evaṃ nānācittesu labbhanti. Imesaṃ pana catunnaṃ ñāṇānaṃ uppattikāle ekacitte labbhanti. Phalakkhaṇe ṭhapetvā cattāro sammappadhāne avasesā tettiṃsa labbhanti."
    ],
    "innerText": "824. Iti ime sattatiṃsa bodhipakkhiyadhammā pubbabhāge lokiyavipassanāya vattamānāya cuddasavidhena kāyaṃ pariggaṇhato ca kāyānupassanāsatipaṭṭhānaṃ, navavidhena vedanaṃ pariggaṇhato ca vedanānupassanāsatipaṭṭhānaṃ, soḷasavidhena cittaṃ pariggaṇhato ca cittānupassanāsatipaṭṭhānaṃ, pañcavidhena dhamme pariggaṇhato ca dhammānupassanāsatipaṭṭhānaṃ. Imasmiṃ attabhāve anuppannapubbaṃ parassa uppannaṃ akusalaṃ disvā ‘‘yathā paṭipannassetaṃ uppannaṃ, na tathā paṭipajjissāmi evaṃ me etaṃ nuppajjissatī’’ti, tassa anuppādāya vāyamanakāle paṭhamaṃ sammappadhānaṃ. Attano samudācārappattaṃ akusalaṃ disvā tassa pahānāya vāyamanakāle dutiyaṃ. Imasmiṃ attabhāve anuppannapubbaṃ jhānaṃ vā vipassanaṃ vā uppādetuṃ vāyamantassa tatiyaṃ. Uppannaṃ yathā na parihāyati, evaṃ punappunaṃ uppādentassa catutthaṃ sammappadhānaṃ. Chandaṃ dhuraṃ katvā kusaluppādanakāle chandiddhipādo. Micchāvācāya viramaṇakāle sammāvācāti evaṃ nānācittesu labbhanti. Imesaṃ pana catunnaṃ ñāṇānaṃ uppattikāle ekacitte labbhanti. Phalakkhaṇe ṭhapetvā cattāro sammappadhāne avasesā tettiṃsa labbhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "825"
      },
      ". Evaṃ ekacitte labbhamānesu cetesu ekāva nibbānārammaṇā sati kāyādīsu subhasaññādippahānakiccasādhanavasena cattāro satipaṭṭhānāti vuccati. Ekameva ca vīriyaṃ anuppannānaṃ anuppādādikiccasādhanavasena cattāro sammappadhānāti vuccati. Sesesu pana hāpanavaḍḍhanaṃ natthi."
    ],
    "innerText": "825. Evaṃ ekacitte labbhamānesu cetesu ekāva nibbānārammaṇā sati kāyādīsu subhasaññādippahānakiccasādhanavasena cattāro satipaṭṭhānāti vuccati. Ekameva ca vīriyaṃ anuppannānaṃ anuppādādikiccasādhanavasena cattāro sammappadhānāti vuccati. Sesesu pana hāpanavaḍḍhanaṃ natthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "826"
      },
      ". Apica tesu –"
    ],
    "innerText": "826. Apica tesu –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nava ekavidhā eko, dvedhātha catu pañcadhā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aṭṭhadhā navadhā ceva, iti chaddhā bhavanti te."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nava ekavidhā"
      },
      "ti chando, cittaṃ, pīti, passaddhi, upekkhā, saṅkappo, vācā, kammanto, ājīvoti ime nava chandiddhipādādivasena ekavidhāva honti, na aññaṃ koṭṭhāsaṃ bhajanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eko dvedhā"
      },
      "ti saddhā indriya, balavasena dvedhā ṭhitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha catu pañcadhā"
      },
      "ti athañño eko catudhā, añño pañcadhā ṭhitoti attho. Tattha samādhi eko indriya, bala, bojjhaṅga, maggaṅgavasena catudhā ṭhito. Paññā tesañca catunnaṃ iddhipādakoṭṭhāsassa ca ",
      " vasena pañcadhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhadhā navadhā cevā"
      },
      "ti aparo eko aṭṭhadhā, eko navadhā ṭhitoti attho. Catusatipaṭṭhāna, indriya, bala, bojjhaṅga, maggaṅgavasena sati aṭṭhadhā ṭhitā. Catusammappadhāna, iddhipāda, indriya, bala, bojjhaṅga, maggaṅgavasena vīriyaṃ navadhāti. Evaṃ –"
    ],
    "innerText": "Nava ekavidhāti chando, cittaṃ, pīti, passaddhi, upekkhā, saṅkappo, vācā, kammanto, ājīvoti ime nava chandiddhipādādivasena ekavidhāva honti, na aññaṃ koṭṭhāsaṃ bhajanti. Eko dvedhāti saddhā indriya, balavasena dvedhā ṭhitā. Atha catu pañcadhāti athañño eko catudhā, añño pañcadhā ṭhitoti attho. Tattha samādhi eko indriya, bala, bojjhaṅga, maggaṅgavasena catudhā ṭhito. Paññā tesañca catunnaṃ iddhipādakoṭṭhāsassa ca vasena pañcadhā. Aṭṭhadhā navadhā cevāti aparo eko aṭṭhadhā, eko navadhā ṭhitoti attho. Catusatipaṭṭhāna, indriya, bala, bojjhaṅga, maggaṅgavasena sati aṭṭhadhā ṭhitā. Catusammappadhāna, iddhipāda, indriya, bala, bojjhaṅga, maggaṅgavasena vīriyaṃ navadhāti. Evaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Cuddaseva ",
      " asambhinnā, hontete bodhipakkhiyā;"
    ],
    "innerText": "Cuddaseva asambhinnā, hontete bodhipakkhiyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Koṭṭhāsato sattavidhā, sattatiṃsappabhedato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sakiccanipphādanato, sarūpena ca vuttito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbeva ariyamaggassa, sambhave sambhavanti teti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Evaṃ tāvettha paripuṇṇabodhipakkhiyabhāvo jānitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Vuṭṭhānabalasamāyogakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "827"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuṭṭhānabalasamāyogo"
      },
      "ti vuṭṭhānañceva balasamāyogo ca. Lokiyavipassanā hi nimittārammaṇattā ceva pavattikāraṇassa ca samudayassa asamucchindanato neva nimittā na pavattā vuṭṭhāti. Gotrabhuñāṇaṃ samudayassa asamucchindanato pavattā na vuṭṭhāti. Nibbānārammaṇato pana nimittā vuṭṭhātīti ekato vuṭṭhānaṃ hoti. Tenāha ‘‘bahiddhāvuṭṭhānavivaṭṭane paññā gotrabhuñāṇa’’nti (paṭi. ma. mātikā 1.10). Tathā ‘‘uppādā vivaṭṭitvā anuppādaṃ pakkhandatīti gotrabhu, pavattā vivaṭṭitvā’’ti (paṭi. ma. 1.59) sabbaṃ veditabbaṃ. Imāni pana cattāripi ñāṇāni animittārammaṇattā nimittato vuṭṭhahanti, samudayassa samucchindanato pavattā vuṭṭhahantīti dubhato vuṭṭhānāni honti."
    ],
    "innerText": "827.Vuṭṭhānabalasamāyogoti vuṭṭhānañceva balasamāyogo ca. Lokiyavipassanā hi nimittārammaṇattā ceva pavattikāraṇassa ca samudayassa asamucchindanato neva nimittā na pavattā vuṭṭhāti. Gotrabhuñāṇaṃ samudayassa asamucchindanato pavattā na vuṭṭhāti. Nibbānārammaṇato pana nimittā vuṭṭhātīti ekato vuṭṭhānaṃ hoti. Tenāha ‘‘bahiddhāvuṭṭhānavivaṭṭane paññā gotrabhuñāṇa’’nti (paṭi. ma. mātikā 1.10). Tathā ‘‘uppādā vivaṭṭitvā anuppādaṃ pakkhandatīti gotrabhu, pavattā vivaṭṭitvā’’ti (paṭi. ma. 1.59) sabbaṃ veditabbaṃ. Imāni pana cattāripi ñāṇāni animittārammaṇattā nimittato vuṭṭhahanti, samudayassa samucchindanato pavattā vuṭṭhahantīti dubhato vuṭṭhānāni honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathaṃ dubhato vuṭṭhānavivaṭṭane paññā magge ñāṇaṃ?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Sotāpattimaggakkhaṇe dassanaṭṭhena sammādiṭṭhi micchādiṭṭhiyā vuṭṭhāti, tadanuvattakakilesehi ca khandhehi ca vuṭṭhāti, bahiddhā ca sabbanimittehi vuṭṭhāti. Tena vuccati dubhato vuṭṭhānavivaṭṭane paññā magge ñāṇaṃ. Abhiniropanaṭṭhena sammāsaṅkappo micchāsaṅkappā…pe… pariggahaṭṭhena sammāvācā micchāvācāya. Samuṭṭhānaṭṭhena sammākammanto. Vodānaṭṭhena sammāājīvo. Paggahaṭṭhena sammāvāyāmo ",
      ". Upaṭṭhānaṭṭhena sammāsati. Avikkhepaṭṭhena sammāsamādhi micchāsamādhito vuṭṭhāti, tadanuvattakakilesehi ca ",
      " khandhehi ca vuṭṭhāti, bahiddhā ca sabbanimittehi vuṭṭhāti. Tena vuccati ‘dubhato vuṭṭhānavivaṭṭane paññā magge ñāṇa’nti."
    ],
    "innerText": "‘‘Sotāpattimaggakkhaṇe dassanaṭṭhena sammādiṭṭhi micchādiṭṭhiyā vuṭṭhāti, tadanuvattakakilesehi ca khandhehi ca vuṭṭhāti, bahiddhā ca sabbanimittehi vuṭṭhāti. Tena vuccati dubhato vuṭṭhānavivaṭṭane paññā magge ñāṇaṃ. Abhiniropanaṭṭhena sammāsaṅkappo micchāsaṅkappā…pe… pariggahaṭṭhena sammāvācā micchāvācāya. Samuṭṭhānaṭṭhena sammākammanto. Vodānaṭṭhena sammāājīvo. Paggahaṭṭhena sammāvāyāmo . Upaṭṭhānaṭṭhena sammāsati. Avikkhepaṭṭhena sammāsamādhi micchāsamādhito vuṭṭhāti, tadanuvattakakilesehi ca khandhehi ca vuṭṭhāti, bahiddhā ca sabbanimittehi vuṭṭhāti. Tena vuccati ‘dubhato vuṭṭhānavivaṭṭane paññā magge ñāṇa’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Sakadāgāmimaggakkhaṇe dassanaṭṭhena sammādiṭṭhi…pe… avikkhepaṭṭhena sammāsamādhi oḷārikā kāmarāgasaṃyojanā paṭighasaṃyojanā oḷārikā kāmarāgānusayā paṭighānusayā vuṭṭhāti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Anāgāmimaggakkhaṇe dassanaṭṭhena sammādiṭṭhi…pe… avikkhepaṭṭhena sammāsamādhi anusahagatā kāmarāgasaṃyojanā paṭighasaṃyojanā anusahagatā kāmarāgānusayā paṭighānusayā vuṭṭhāti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Arahattamaggakkhaṇe dassanaṭṭhena sammādiṭṭhi…pe… avikkhepaṭṭhena sammāsamādhi rūparāgā arūparāgā mānā uddhaccā avijjāya mānānusayā bhavarāgānusayā avijjānusayā vuṭṭhāti, tadanuvattakakilesehi ca khandhehi ca vuṭṭhāti, bahiddhā ca sabbanimittehi vuṭṭhāti. Tena vuccati ‘dubhato vuṭṭhānavivaṭṭane paññā magge ñāṇa’’’nti (paṭi. ma. 1.61)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "828"
      },
      ". Lokiyānañca aṭṭhannaṃ samāpattīnaṃ bhāvanākāle samathabalaṃ adhikaṃ hoti. Aniccānupassanādīnaṃ bhāvanākāle vipassanābalaṃ. Ariyamaggakkhaṇe pana yuganaddhā te dhammā pavattanti aññamaññaṃ anativattanaṭṭhena. Tasmā imesu catūsupi ñāṇesu ubhayabalasamāyogo hoti. Yathāha –"
    ],
    "innerText": "828. Lokiyānañca aṭṭhannaṃ samāpattīnaṃ bhāvanākāle samathabalaṃ adhikaṃ hoti. Aniccānupassanādīnaṃ bhāvanākāle vipassanābalaṃ. Ariyamaggakkhaṇe pana yuganaddhā te dhammā pavattanti aññamaññaṃ anativattanaṭṭhena. Tasmā imesu catūsupi ñāṇesu ubhayabalasamāyogo hoti. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Uddhaccasahagatakilesehi ca khandhehi ca vuṭṭhahato cittassa ekaggatā avikkhepo samādhi nirodhagocaro, avijjāsahagatakilesehi ca khandhehi ca vuṭṭhahato anupassanaṭṭhena vipassanā nirodhagocarā. Iti vuṭṭhānaṭṭhena samathavipassanā ekarasā ",
      " honti, yuganaddhā honti, aññamaññaṃ nātivattantīti. Tena vuccati vuṭṭhānaṭṭhena samathavipassanaṃ yuganaddhaṃ bhāvetī’’ti (paṭi. ma. 2.5)."
    ],
    "innerText": "‘‘Uddhaccasahagatakilesehi ca khandhehi ca vuṭṭhahato cittassa ekaggatā avikkhepo samādhi nirodhagocaro, avijjāsahagatakilesehi ca khandhehi ca vuṭṭhahato anupassanaṭṭhena vipassanā nirodhagocarā. Iti vuṭṭhānaṭṭhena samathavipassanā ekarasā honti, yuganaddhā honti, aññamaññaṃ nātivattantīti. Tena vuccati vuṭṭhānaṭṭhena samathavipassanaṃ yuganaddhaṃ bhāvetī’’ti (paṭi. ma. 2.5)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Evamettha vuṭṭhānabalasamāyogo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pahātabbadhammapahānakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "829"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yena pahātabbā dhammā, tesaṃ pahānañcā"
      },
      "ti imesu pana catūsu ñāṇesu ye dhammā yena ñāṇena pahātabbā, tesaṃ pahānañca jānitabbaṃ. Etāni hi yathāyogaṃ saṃyojanakilesamicchattalokadhammamacchariyavipallāsaganthaagatiāsavaoghayoganīvaraṇaparāmāsaupādānaanusayamalaakusalakammapathacittuppādasaṅkhātānaṃ dhammānaṃ pahānakarāni."
    ],
    "innerText": "829.Yeyena pahātabbā dhammā, tesaṃ pahānañcāti imesu pana catūsu ñāṇesu ye dhammā yena ñāṇena pahātabbā, tesaṃ pahānañca jānitabbaṃ. Etāni hi yathāyogaṃ saṃyojanakilesamicchattalokadhammamacchariyavipallāsaganthaagatiāsavaoghayoganīvaraṇaparāmāsaupādānaanusayamalaakusalakammapathacittuppādasaṅkhātānaṃ dhammānaṃ pahānakarāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃyojanānī"
      },
      "ti khandhehi khandhānaṃ phalena kammassa dukkhena vā sattānaṃ saṃyojakattā rūparāgādayo dasa dhammā vuccanti. Yāvañhi te, tāva etesaṃ anuparamoti. Tatrāpi rūparāgo arūparāgo māno uddhaccaṃ avijjāti ime pañca uddhaṃnibbattanakakhandhādisaṃyojakattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddhaṃbhāgiyasaṃyojanāni"
      },
      " nāma. Sakkāyadiṭṭhi vicikicchā sīlabbataparāmāso kāmarāgo paṭighoti ime pañca adhonibbattanakakhandhādisaṃyojakattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhobhāgiyasaṃyojanāni"
      },
      " nāma."
    ],
    "innerText": "Tattha saṃyojanānīti khandhehi khandhānaṃ phalena kammassa dukkhena vā sattānaṃ saṃyojakattā rūparāgādayo dasa dhammā vuccanti. Yāvañhi te, tāva etesaṃ anuparamoti. Tatrāpi rūparāgo arūparāgo māno uddhaccaṃ avijjāti ime pañca uddhaṃnibbattanakakhandhādisaṃyojakattā uddhaṃbhāgiyasaṃyojanāni nāma. Sakkāyadiṭṭhi vicikicchā sīlabbataparāmāso kāmarāgo paṭighoti ime pañca adhonibbattanakakhandhādisaṃyojakattā adhobhāgiyasaṃyojanāni nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kilesā"
      },
      "ti sayaṃ saṃkiliṭṭhattā sampayuttadhammānañca saṃkilesikattā lobho doso moho māno diṭṭhi vicikicchā thinaṃ uddhaccaṃ ahirikaṃ anottappanti ime dasa dhammā."
    ],
    "innerText": "Kilesāti sayaṃ saṃkiliṭṭhattā sampayuttadhammānañca saṃkilesikattā lobho doso moho māno diṭṭhi vicikicchā thinaṃ uddhaccaṃ ahirikaṃ anottappanti ime dasa dhammā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Micchattā"
      },
      "ti micchāpavattanato micchādiṭṭhi micchāsaṅkappo micchāvācā micchākammanto micchāājīvo micchāvāyāmo micchāsati micchāsamādhīti ime aṭṭha dhammā. Micchāvimuttimicchāñāṇehi vā saddhiṃ dasa."
    ],
    "innerText": "Micchattāti micchāpavattanato micchādiṭṭhi micchāsaṅkappo micchāvācā micchākammanto micchāājīvo micchāvāyāmo micchāsati micchāsamādhīti ime aṭṭha dhammā. Micchāvimuttimicchāñāṇehi vā saddhiṃ dasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokadhammā"
      },
      "ti lokappavattiyā sati anuparamadhammakattā lābho alābho yaso ayaso sukhaṃ dukkhaṃ nindā pasaṃsāti ime aṭṭha. Idha pana kāraṇopacārena lābhādivatthukassa anunayassa alābhādivatthukassa paṭighassa cetaṃ lokadhammaggahaṇena gahaṇaṃ katanti veditabbaṃ."
    ],
    "innerText": "Lokadhammāti lokappavattiyā sati anuparamadhammakattā lābho alābho yaso ayaso sukhaṃ dukkhaṃ nindā pasaṃsāti ime aṭṭha. Idha pana kāraṇopacārena lābhādivatthukassa anunayassa alābhādivatthukassa paṭighassa cetaṃ lokadhammaggahaṇena gahaṇaṃ katanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Macchariyānī"
      },
      "ti ",
      " āvāsamacchariyaṃ kulamacchariyaṃ lābhamacchariyaṃ dhammamacchariyaṃ vaṇṇamacchariyanti imāsu āvāsādīsu aññesaṃ sādhāraṇabhāvaṃ asahanākārena pavattāni pañca macchariyāni."
    ],
    "innerText": "Macchariyānīti āvāsamacchariyaṃ kulamacchariyaṃ lābhamacchariyaṃ dhammamacchariyaṃ vaṇṇamacchariyanti imāsu āvāsādīsu aññesaṃ sādhāraṇabhāvaṃ asahanākārena pavattāni pañca macchariyāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipallāsā"
      },
      "ti ",
      " aniccadukkhaanattaasubhesuyeva vatthūsu ‘‘niccaṃ sukhaṃ attā subha’’nti evaṃ pavatto saññāvipallāso cittavipallāso diṭṭhivipallāsoti ime tayo."
    ],
    "innerText": "Vipallāsāti aniccadukkhaanattaasubhesuyeva vatthūsu ‘‘niccaṃ sukhaṃ attā subha’’nti evaṃ pavatto saññāvipallāso cittavipallāso diṭṭhivipallāsoti ime tayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ganthā"
      },
      "ti nāmakāyassa ceva rūpakāyassa ca ganthanato abhijjhādayo cattāro. Tathā hi te abhijjhā kāyagantho, byāpādo kāyagantho, sīlabbataparāmāso kāyagantho, idaṃsaccābhiniveso kāyagantho icceva vuttā."
    ],
    "innerText": "Ganthāti nāmakāyassa ceva rūpakāyassa ca ganthanato abhijjhādayo cattāro. Tathā hi te abhijjhā kāyagantho, byāpādo kāyagantho, sīlabbataparāmāso kāyagantho, idaṃsaccābhiniveso kāyagantho icceva vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Agatī"
      },
      "ti chandadosamohabhayehi akattabbakaraṇassa, kattabbākaraṇassa ca adhivacanaṃ. Tañhi ariyehi agantabbattā agatīti vuccati."
    ],
    "innerText": "Agatīti chandadosamohabhayehi akattabbakaraṇassa, kattabbākaraṇassa ca adhivacanaṃ. Tañhi ariyehi agantabbattā agatīti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsavā"
      },
      "ti ārammaṇavasena āgotrabhuto, ābhavaggato ca savanā, asaṃvutehi vā dvārehi ghaṭachiddehi udakaṃ viya savanato niccapaggharaṇaṭṭhena saṃsāradukkhassa vā savanato kāmarāgabhavarāgamicchādiṭṭhiavijjānametaṃ adhivacanaṃ."
    ],
    "innerText": "Āsavāti ārammaṇavasena āgotrabhuto, ābhavaggato ca savanā, asaṃvutehi vā dvārehi ghaṭachiddehi udakaṃ viya savanato niccapaggharaṇaṭṭhena saṃsāradukkhassa vā savanato kāmarāgabhavarāgamicchādiṭṭhiavijjānametaṃ adhivacanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhavasāgare ākaḍḍhanaṭṭhena duruttaraṇaṭṭhena ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "oghā"
      },
      "tipi, ārammaṇaviyogassa ceva dukkhaviyogassa ca appadānato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yogā"
      },
      "tipi tesaññeva adhivacanaṃ."
    ],
    "innerText": "Bhavasāgare ākaḍḍhanaṭṭhena duruttaraṇaṭṭhena ca oghātipi, ārammaṇaviyogassa ceva dukkhaviyogassa ca appadānato yogātipi tesaññeva adhivacanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nīvaraṇānī"
      },
      "ti cittassa āvaraṇanīvaraṇapaṭicchādanaṭṭhena kāmacchandādayo pañca."
    ],
    "innerText": "Nīvaraṇānīti cittassa āvaraṇanīvaraṇapaṭicchādanaṭṭhena kāmacchandādayo pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parāmāso"
      },
      "ti tassa tassa dhammassa sabhāvaṃ atikkamma parato abhūtaṃ sabhāvaṃ āmasanākārena pavattanato micchādiṭṭhiyā etaṃ adhivacanaṃ."
    ],
    "innerText": "Parāmāsoti tassa tassa dhammassa sabhāvaṃ atikkamma parato abhūtaṃ sabhāvaṃ āmasanākārena pavattanato micchādiṭṭhiyā etaṃ adhivacanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upādānānī"
      },
      "ti sabbākārena paṭiccasamuppādaniddese vuttāni kāmupādānādīni cattāri."
    ],
    "innerText": "Upādānānīti sabbākārena paṭiccasamuppādaniddese vuttāni kāmupādānādīni cattāri."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anusayā"
      },
      "ti thāmagataṭṭhena kāmarāgānusayo, paṭigha, māna, diṭṭhi, vicikicchā, bhavarāga, avijjānusayoti evaṃ vuttā kāmarāgādayo satta ",
      ". Te hi thāmagatattā punappunaṃ kāmarāgādīnaṃ uppattihetubhāvena anusentiyevāti anusayā."
    ],
    "innerText": "Anusayāti thāmagataṭṭhena kāmarāgānusayo, paṭigha, māna, diṭṭhi, vicikicchā, bhavarāga, avijjānusayoti evaṃ vuttā kāmarāgādayo satta . Te hi thāmagatattā punappunaṃ kāmarāgādīnaṃ uppattihetubhāvena anusentiyevāti anusayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Malā"
      },
      "ti ",
      " telañjanakalalaṃ viya sayañca asuddhattā, aññesañca asuddhabhāvakaraṇato lobhadosamohā tayo."
    ],
    "innerText": "Malāti telañjanakalalaṃ viya sayañca asuddhattā, aññesañca asuddhabhāvakaraṇato lobhadosamohā tayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akusalakammapathā"
      },
      "ti akusalakammabhāvena ceva duggatīnañca pathabhāvena pāṇātipāto adinnādānaṃ kāmesumicchācāro musāvādo pisuṇavācā pharusavācā samphappalāpo abhijjhā byāpādo micchādiṭṭhīti ime dasa."
    ],
    "innerText": "Akusalakammapathāti akusalakammabhāvena ceva duggatīnañca pathabhāvena pāṇātipāto adinnādānaṃ kāmesumicchācāro musāvādo pisuṇavācā pharusavācā samphappalāpo abhijjhā byāpādo micchādiṭṭhīti ime dasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akusalacittuppādā"
      },
      "ti lobhamūlā aṭṭha dosamūlā dve mohamūlā dveti ime dvādasa."
    ],
    "innerText": "Akusalacittuppādāti lobhamūlā aṭṭha dosamūlā dve mohamūlā dveti ime dvādasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "830"
      },
      ". Iti etesaṃ saṃyojanādīnaṃ dhammānaṃ etāni yathāyogaṃ pahānakarāni. Kathaṃ? Saṃyojanesu tāva sakkāyadiṭṭhi vicikicchā sīlabbataparāmāso apāyagamanīyā ca kāmarāgapaṭighāti ete pañca dhammā paṭhamañāṇavajjhā, sesā kāmarāgapaṭighā oḷārikā dutiyañāṇavajjhā, sukhumā tatiyañāṇavajjhā, rūparāgādayo pañcapi catutthañāṇavajjhā eva. Paratopi ca yattha yattha evasaddena niyamaṃ na karissāma. Tattha tattha yaṃ yaṃ ‘‘upariñāṇavajjho’’ti vakkhāma, so so purimañāṇehi hatāpāyagamanīyādibhāvova hutvā upariñāṇavajjho hotīti veditabbo."
    ],
    "innerText": "830. Iti etesaṃ saṃyojanādīnaṃ dhammānaṃ etāni yathāyogaṃ pahānakarāni. Kathaṃ? Saṃyojanesu tāva sakkāyadiṭṭhi vicikicchā sīlabbataparāmāso apāyagamanīyā ca kāmarāgapaṭighāti ete pañca dhammā paṭhamañāṇavajjhā, sesā kāmarāgapaṭighā oḷārikā dutiyañāṇavajjhā, sukhumā tatiyañāṇavajjhā, rūparāgādayo pañcapi catutthañāṇavajjhā eva. Paratopi ca yattha yattha evasaddena niyamaṃ na karissāma. Tattha tattha yaṃ yaṃ ‘‘upariñāṇavajjho’’ti vakkhāma, so so purimañāṇehi hatāpāyagamanīyādibhāvova hutvā upariñāṇavajjho hotīti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kilesesu diṭṭhivicikicchā paṭhamañāṇavajjhā, doso tatiyañāṇavajjho, lobhamohamānathinauddhaccaahirikaanottappāni catutthañāṇavajjhāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Micchattesu micchādiṭṭhi musāvādo micchākammanto micchāājīvoti ime paṭhamañāṇavajjhā, micchāsaṅkappo pisuṇavācā pharusavācāti ime tatiyañāṇavajjhā, cetanāyeva cettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vācā"
      },
      "ti veditabbā. Samphappalāpamicchāvāyāmasatisamādhivimuttiñāṇāni catutthañāṇavajjhāni."
    ],
    "innerText": "Micchattesu micchādiṭṭhi musāvādo micchākammanto micchāājīvoti ime paṭhamañāṇavajjhā, micchāsaṅkappo pisuṇavācā pharusavācāti ime tatiyañāṇavajjhā, cetanāyeva cettha vācāti veditabbā. Samphappalāpamicchāvāyāmasatisamādhivimuttiñāṇāni catutthañāṇavajjhāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Lokadhammesu paṭigho tatiyañāṇavajjho, anunayo catutthañāṇavajjho, yase ca pasaṃsāya ca anunayo catutthañāṇavajjhoti eke. Macchariyāni paṭhamañāṇavajjhāneva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vipallāsesu ",
      " anicce niccaṃ, anattani attāti ca saññācittadiṭṭhivipallāsā, dukkhe sukhaṃ, asubhe subhanti diṭṭhivipallāso cāti ime paṭhamañāṇavajjhā, asubhe subhanti saññācittavipallāsā tatiyañāṇavajjhā, dukkhe sukhanti saññācittavipallāsā catutthañāṇavajjhā."
    ],
    "innerText": "Vipallāsesu anicce niccaṃ, anattani attāti ca saññācittadiṭṭhivipallāsā, dukkhe sukhaṃ, asubhe subhanti diṭṭhivipallāso cāti ime paṭhamañāṇavajjhā, asubhe subhanti saññācittavipallāsā tatiyañāṇavajjhā, dukkhe sukhanti saññācittavipallāsā catutthañāṇavajjhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ganthesu sīlabbataparāmasaidaṃsaccābhinivesakāyaganthā paṭhamañāṇavajjhā, byāpādakāyagantho tatiyañāṇavajjho, itaro catutthañāṇavajjho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Agati paṭhamañāṇavajjhāva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Āsavesu diṭṭhāsavo paṭhamañāṇavajjho, kāmāsavo tatiyañāṇavajjho, itare dve catutthañāṇavajjhā. Oghayogesupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nīvaraṇesu vicikicchānīvaraṇaṃ paṭhamañāṇavajjhaṃ, kāmacchando byāpādo kukkuccanti tīṇi tatiyañāṇavajjhāni, thinamiddhauddhaccāni catutthañāṇavajjhāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Parāmāso paṭhamañāṇavajjhova."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Upādānesu sabbesampi lokiyadhammānaṃ vatthukāmavasena kāmāti āgatattā rūpārūparāgopi kāmupādāne patati, tasmā taṃ catutthañāṇavajjhaṃ, sesāni paṭhamañāṇavajjhāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anusayesu diṭṭhivicikicchānusayā paṭhamañāṇavajjhāva, kāmarāgapaṭighānusayā tatiyañāṇavajjhā, mānabhavarāgāvijjānusayā catutthañāṇavajjhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Malesu dosamalaṃ tatiyañāṇavajjhaṃ, itarāni catutthañāṇavajjhāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Akusalakammapathesu pāṇātipāto adinnādānaṃ micchācāro musāvādo micchādiṭṭhīti ime paṭhamañāṇavajjhā ",
      ", pisuṇavācā pharusavācā byāpādoti tayo tatiyañāṇavajjhā, samphappalāpābhijjhā catutthañāṇavajjhā."
    ],
    "innerText": "Akusalakammapathesu pāṇātipāto adinnādānaṃ micchācāro musāvādo micchādiṭṭhīti ime paṭhamañāṇavajjhā , pisuṇavācā pharusavācā byāpādoti tayo tatiyañāṇavajjhā, samphappalāpābhijjhā catutthañāṇavajjhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Akusalacittuppādesu cattāro diṭṭhigatasampayuttā vicikicchāsampayutto cāti pañca paṭhamañāṇavajjhāva, dve paṭighasampayuttā tatiyañāṇavajjhā, sesā catutthañāṇavajjhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yañca yena vajjhaṃ, taṃ tena pahātabbaṃ nāma. Tena vuttaṃ ‘‘iti etesaṃ saṃyojanādīnaṃ dhammānaṃ etāni yathāyogaṃ pahānakarānī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "831"
      },
      ". Kiṃ ",
      " panetāni ete dhamme atītānāgate pajahanti udāhu paccuppanneti. Kiṃ panettha yadi tāva atītānāgate, aphalo vāyāmo āpajjati. Kasmā? Pahātabbānaṃ natthitāya. Atha paccuppanne, tathāpi aphalo, vāyāmena saddhiṃ pahātabbānaṃ atthitāya, saṃkilesikā ca maggabhāvanā āpajjati, vippayuttatā vā kilesānaṃ, na ca paccuppannakileso cittavippayutto nāma atthīti. Nāyaṃ āveṇikā codanā. Pāḷiyaṃyeva hi ‘‘svāyaṃ kilese pajahati, atīte kilese pajahati, anāgate kilese pajahati, paccuppanne kilese pajahatī’’ti vatvā, puna ‘‘hañci atīte kilese pajahati, tenahi khīṇaṃ khepeti, niruddhaṃ nirodheti, vigataṃ vigameti, atthaṅgataṃ atthaṅgameti. Atītaṃ yaṃ natthi, taṃ pajahatī’’ti (paṭi. ma. 3.21) ca vatvā, ‘‘na atīte kilese pajahatī’’ti paṭikkhittaṃ."
    ],
    "innerText": "831. Kiṃ panetāni ete dhamme atītānāgate pajahanti udāhu paccuppanneti. Kiṃ panettha yadi tāva atītānāgate, aphalo vāyāmo āpajjati. Kasmā? Pahātabbānaṃ natthitāya. Atha paccuppanne, tathāpi aphalo, vāyāmena saddhiṃ pahātabbānaṃ atthitāya, saṃkilesikā ca maggabhāvanā āpajjati, vippayuttatā vā kilesānaṃ, na ca paccuppannakileso cittavippayutto nāma atthīti. Nāyaṃ āveṇikā codanā. Pāḷiyaṃyeva hi ‘‘svāyaṃ kilese pajahati, atīte kilese pajahati, anāgate kilese pajahati, paccuppanne kilese pajahatī’’ti vatvā, puna ‘‘hañci atīte kilese pajahati, tenahi khīṇaṃ khepeti, niruddhaṃ nirodheti, vigataṃ vigameti, atthaṅgataṃ atthaṅgameti. Atītaṃ yaṃ natthi, taṃ pajahatī’’ti (paṭi. ma. 3.21) ca vatvā, ‘‘na atīte kilese pajahatī’’ti paṭikkhittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tathā ‘‘hañci anāgate kilese pajahati, tenahi ajātaṃ pajahati, anibbattaṃ pajahati, anuppannaṃ pajahati, apātubhūtaṃ pajahati. Anāgataṃ yaṃ natthi, taṃ pajahatī’’ti ca vatvā, ‘‘na anāgate kilese pajahatī’’ti paṭikkhittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā ‘‘hañci paccuppanne kilese pajahati, tenahi ratto rāgaṃ pajahati. Duṭṭho dosaṃ, mūḷho mohaṃ, vinibaddho mānaṃ, parāmaṭṭho diṭṭhiṃ, vikkhepagato uddhaccaṃ, aniṭṭhaṅgato vicikicchaṃ, thāmagato anusayaṃ pajahati. Kaṇhasukkā dhammā yuganaddhāva vattanti. Saṃkilesikā maggabhāvanā hotī’’ti ca vatvā, ‘‘na atīte kilese pajahati, na anāgate, na paccuppanne kilese pajahatī’’ti sabbaṃ paṭikkhipitvā, ‘‘tenahi natthi maggabhāvanā, natthi phalasacchikiriyā ",
      ", natthi kilesappahānaṃ, natthi dhammābhisamayo’’ti pañhāpariyosāne ‘‘na hi natthi maggabhāvanā…pe… natthi dhammābhisamayo’’ti paṭijānitvā ‘‘yathā kathaṃ viyā’’ti vutte idaṃ vuttaṃ –"
    ],
    "innerText": "Tathā ‘‘hañci paccuppanne kilese pajahati, tenahi ratto rāgaṃ pajahati. Duṭṭho dosaṃ, mūḷho mohaṃ, vinibaddho mānaṃ, parāmaṭṭho diṭṭhiṃ, vikkhepagato uddhaccaṃ, aniṭṭhaṅgato vicikicchaṃ, thāmagato anusayaṃ pajahati. Kaṇhasukkā dhammā yuganaddhāva vattanti. Saṃkilesikā maggabhāvanā hotī’’ti ca vatvā, ‘‘na atīte kilese pajahati, na anāgate, na paccuppanne kilese pajahatī’’ti sabbaṃ paṭikkhipitvā, ‘‘tenahi natthi maggabhāvanā, natthi phalasacchikiriyā , natthi kilesappahānaṃ, natthi dhammābhisamayo’’ti pañhāpariyosāne ‘‘na hi natthi maggabhāvanā…pe… natthi dhammābhisamayo’’ti paṭijānitvā ‘‘yathā kathaṃ viyā’’ti vutte idaṃ vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Seyyathāpi taruṇo rukkho ajātaphalo, tamenaṃ puriso mūle chindeyya, ye tassa rukkhassa ajātaphalā, te ajātāyeva na jāyanti, anibbattāyeva na nibbattanti, anuppannāyeva na uppajjanti, apātubhūtāyeva na pātubhavanti, evameva ",
      " uppādo hetu uppādo paccayo kilesānaṃ nibbattiyāti uppāde ādīnavaṃ disvā anuppāde cittaṃ pakkhandati, anuppāde cittassa pakkhandattā ye āyūhanapaccayā kilesā nibbatteyyuṃ, te ajātāyeva na jāyanti…pe… apātubhūtāyeva na pātubhavanti, evaṃ hetunirodhā dukkhanirodho. Pavattaṃ hetu…pe… nimittaṃ hetu…pe… āyūhanā hetu…pe… anāyūhane cittassa pakkhandattā ye āyūhanapaccayā kilesā nibbatteyyuṃ, te ajātāyeva…pe… apātubhūtāyeva na pātubhavanti, evaṃ hetunirodhā dukkhanirodho. Evaṃ atthi maggabhāvanā, atthi phalasacchikiriyā, atthi kilesappahānaṃ, atthi dhammābhisamayo’’ti (paṭi. ma. 3.21)."
    ],
    "innerText": "‘‘Seyyathāpi taruṇo rukkho ajātaphalo, tamenaṃ puriso mūle chindeyya, ye tassa rukkhassa ajātaphalā, te ajātāyeva na jāyanti, anibbattāyeva na nibbattanti, anuppannāyeva na uppajjanti, apātubhūtāyeva na pātubhavanti, evameva uppādo hetu uppādo paccayo kilesānaṃ nibbattiyāti uppāde ādīnavaṃ disvā anuppāde cittaṃ pakkhandati, anuppāde cittassa pakkhandattā ye āyūhanapaccayā kilesā nibbatteyyuṃ, te ajātāyeva na jāyanti…pe… apātubhūtāyeva na pātubhavanti, evaṃ hetunirodhā dukkhanirodho. Pavattaṃ hetu…pe… nimittaṃ hetu…pe… āyūhanā hetu…pe… anāyūhane cittassa pakkhandattā ye āyūhanapaccayā kilesā nibbatteyyuṃ, te ajātāyeva…pe… apātubhūtāyeva na pātubhavanti, evaṃ hetunirodhā dukkhanirodho. Evaṃ atthi maggabhāvanā, atthi phalasacchikiriyā, atthi kilesappahānaṃ, atthi dhammābhisamayo’’ti (paṭi. ma. 3.21)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "832"
      },
      ". Etena kiṃ dīpitaṃ hoti? Bhūmiladdhānaṃ kilesānaṃ pahānaṃ dīpitaṃ hoti. Bhūmiladdhā pana kiṃ atītānāgatā udāhu paccuppannāti. Bhūmiladdhuppannā eva nāma te."
    ],
    "innerText": "832. Etena kiṃ dīpitaṃ hoti? Bhūmiladdhānaṃ kilesānaṃ pahānaṃ dīpitaṃ hoti. Bhūmiladdhā pana kiṃ atītānāgatā udāhu paccuppannāti. Bhūmiladdhuppannā eva nāma te."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "833"
      },
      ". Uppannaṃ hi vattamānabhūtāpagatokāsakatabhūmiladdhavasena anekappabhedaṃ. Tattha sabbampi uppādajarābhaṅgasamaṅgisaṅkhātaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vattamānuppannaṃ"
      },
      " nāma. Ārammaṇarasaṃ anubhavitvā niruddhaṃ anubhūtāpagatasaṅkhātaṃ kusalākusalaṃ uppādādittayaṃ anuppatvā niruddhaṃ bhūtāpagatasaṅkhātaṃ sesasaṅkhatañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhūtāpagatuppannaṃ"
      },
      " nāma. ‘‘Yānissa tāni pubbekatāni kammānī’’ti (ma. ni. 3.248) evamādinā nayena vuttaṃ kammaṃ atītampi samānaṃ aññaṃ vipākaṃ paṭibāhitvā attano vipākassokāsaṃ katvā ṭhitattā tathā katokāsañca vipākaṃ anuppannampi samānaṃ evaṃ kate okāse ekantena uppajjanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "okāsakatuppannaṃ"
      },
      " nāma. Tāsu tāsu bhūmīsu asamūhataṃ akusalaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhūmiladdhuppannaṃ"
      },
      " nāma."
    ],
    "innerText": "833. Uppannaṃ hi vattamānabhūtāpagatokāsakatabhūmiladdhavasena anekappabhedaṃ. Tattha sabbampi uppādajarābhaṅgasamaṅgisaṅkhātaṃ vattamānuppannaṃ nāma. Ārammaṇarasaṃ anubhavitvā niruddhaṃ anubhūtāpagatasaṅkhātaṃ kusalākusalaṃ uppādādittayaṃ anuppatvā niruddhaṃ bhūtāpagatasaṅkhātaṃ sesasaṅkhatañca bhūtāpagatuppannaṃ nāma. ‘‘Yānissa tāni pubbekatāni kammānī’’ti (ma. ni. 3.248) evamādinā nayena vuttaṃ kammaṃ atītampi samānaṃ aññaṃ vipākaṃ paṭibāhitvā attano vipākassokāsaṃ katvā ṭhitattā tathā katokāsañca vipākaṃ anuppannampi samānaṃ evaṃ kate okāse ekantena uppajjanato okāsakatuppannaṃ nāma. Tāsu tāsu bhūmīsu asamūhataṃ akusalaṃ bhūmiladdhuppannaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "834"
      },
      ". Ettha ",
      " ca bhūmiyā bhūmiladdhassa ca nānattaṃ veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūmī"
      },
      "ti hi vipassanāya ārammaṇabhūtā tebhūmakā pañcakkhandhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūmiladdhaṃ"
      },
      " nāma tesu khandhesu uppattirahaṃ kilesajātaṃ. Tenahi sā bhūmi laddhā nāma hotīti tasmā bhūmiladdhanti vuccati, sā ca kho na ārammaṇavasena. Ārammaṇavasena ",
      " hi sabbepi atītānāgate pariññātepi ca khīṇāsavānaṃ khandhe ārabbha kilesā uppajjanti mahākaccānauppalavaṇṇādīnaṃ khandhe ārabbha soreyyaseṭṭhi nandamāṇavakādīnaṃ viya. Yadi ca taṃ bhūmiladdhaṃ nāma siyā, tassa appaheyyato na koci bhavamūlaṃ pajaheyya. Vatthuvasena pana bhūmiladdhaṃ veditabbaṃ. Yattha yattha hi vipassanāya apariññātā khandhā uppajjanti, tattha tattha uppādato pabhuti tesu vaṭṭamūlaṃ kilesajātaṃ anuseti. Taṃ appahīnaṭṭhena bhūmiladdhanti veditabbaṃ."
    ],
    "innerText": "834. Ettha ca bhūmiyā bhūmiladdhassa ca nānattaṃ veditabbaṃ. Bhūmīti hi vipassanāya ārammaṇabhūtā tebhūmakā pañcakkhandhā. Bhūmiladdhaṃ nāma tesu khandhesu uppattirahaṃ kilesajātaṃ. Tenahi sā bhūmi laddhā nāma hotīti tasmā bhūmiladdhanti vuccati, sā ca kho na ārammaṇavasena. Ārammaṇavasena hi sabbepi atītānāgate pariññātepi ca khīṇāsavānaṃ khandhe ārabbha kilesā uppajjanti mahākaccānauppalavaṇṇādīnaṃ khandhe ārabbha soreyyaseṭṭhi nandamāṇavakādīnaṃ viya. Yadi ca taṃ bhūmiladdhaṃ nāma siyā, tassa appaheyyato na koci bhavamūlaṃ pajaheyya. Vatthuvasena pana bhūmiladdhaṃ veditabbaṃ. Yattha yattha hi vipassanāya apariññātā khandhā uppajjanti, tattha tattha uppādato pabhuti tesu vaṭṭamūlaṃ kilesajātaṃ anuseti. Taṃ appahīnaṭṭhena bhūmiladdhanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "835"
      },
      ". Tattha ca yassa yesu khandhesu appahīnaṭṭhena anusayitā kilesā, tassa te eva khandhā tesaṃ kilesānaṃ vatthu, na aññesaṃ santakā khandhā. Atītakkhandhesu ca appahīnānusayitānaṃ kilesānaṃ atītakkhandhāva vatthu, na itare. Esa nayo anāgatādīsu. Tathā kāmāvacarakkhandhesu appahīnānusayitānaṃ kilesānaṃ kāmāvacarakkhandhāva vatthu, na itare. Esa nayo rūpārūpāvacaresu. Sotāpannādīsu pana yassa yassa ariyapuggalassa khandhesu taṃ taṃ vaṭṭamūlaṃ kilesajātaṃ tena tena maggena pahīnaṃ, tassa tassa te te khandhā pahīnānaṃ tesaṃ tesaṃ vaṭṭamūlakilesānaṃ avatthuto bhūmīti saṅkhaṃ na labhanti. Puthujjanassa sabbasova vaṭṭamūlakilesānaṃ appahīnattā yaṃkiñci kariyamānaṃ kammaṃ kusalaṃ akusalaṃ vā hoti. Iccassa kammakilesapaccayā vaṭṭaṃ vaṭṭati. Tassetaṃ vaṭṭamūlaṃ rūpakkhandheyeva, na vedanākkhandhādīsu. Viññāṇakkhandheyeva vā, na rūpakkhandhādīsūti na vattabbaṃ. Kasmā? Avisesena pañcasupi khandhesu anusayitattā."
    ],
    "innerText": "835. Tattha ca yassa yesu khandhesu appahīnaṭṭhena anusayitā kilesā, tassa te eva khandhā tesaṃ kilesānaṃ vatthu, na aññesaṃ santakā khandhā. Atītakkhandhesu ca appahīnānusayitānaṃ kilesānaṃ atītakkhandhāva vatthu, na itare. Esa nayo anāgatādīsu. Tathā kāmāvacarakkhandhesu appahīnānusayitānaṃ kilesānaṃ kāmāvacarakkhandhāva vatthu, na itare. Esa nayo rūpārūpāvacaresu. Sotāpannādīsu pana yassa yassa ariyapuggalassa khandhesu taṃ taṃ vaṭṭamūlaṃ kilesajātaṃ tena tena maggena pahīnaṃ, tassa tassa te te khandhā pahīnānaṃ tesaṃ tesaṃ vaṭṭamūlakilesānaṃ avatthuto bhūmīti saṅkhaṃ na labhanti. Puthujjanassa sabbasova vaṭṭamūlakilesānaṃ appahīnattā yaṃkiñci kariyamānaṃ kammaṃ kusalaṃ akusalaṃ vā hoti. Iccassa kammakilesapaccayā vaṭṭaṃ vaṭṭati. Tassetaṃ vaṭṭamūlaṃ rūpakkhandheyeva, na vedanākkhandhādīsu. Viññāṇakkhandheyeva vā, na rūpakkhandhādīsūti na vattabbaṃ. Kasmā? Avisesena pañcasupi khandhesu anusayitattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "836"
      },
      ". Kathaṃ? Pathavīrasādi viya rukkhe. Yathā hi mahārukkhe pathavītalaṃ adhiṭṭhāya pathavīrasañca āporasañca nissāya tappaccayā mūlakhandhasākhapasākhapallavapalāsapupphaphalehi vaḍḍhitvā nabhaṃ pūretvā yāva kappāvasānā bījaparamparāya rukkhapaveṇiṃ santānayamāne ṭhite taṃ pathavīrasādi mūleyeva, na khandhādīsu…pe… phaleyeva vā, na mūlādīsūti na vattabbaṃ. Kasmā? Avisesena sabbesu mūlādīsu anugatattāti."
    ],
    "innerText": "836. Kathaṃ? Pathavīrasādi viya rukkhe. Yathā hi mahārukkhe pathavītalaṃ adhiṭṭhāya pathavīrasañca āporasañca nissāya tappaccayā mūlakhandhasākhapasākhapallavapalāsapupphaphalehi vaḍḍhitvā nabhaṃ pūretvā yāva kappāvasānā bījaparamparāya rukkhapaveṇiṃ santānayamāne ṭhite taṃ pathavīrasādi mūleyeva, na khandhādīsu…pe… phaleyeva vā, na mūlādīsūti na vattabbaṃ. Kasmā? Avisesena sabbesu mūlādīsu anugatattāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā ",
      " pana tasseva rukkhassa pupphaphalādīsu nibbinno koci puriso catūsu disāsu maṇḍūkakaṇṭakaṃ nāma visakaṇṭakaṃ ākoṭeyya, atha so ",
      " rukkho tena visasamphassena phuṭṭho pathavīrasaāporasānaṃ pariyādiṇṇattā appasavanadhammataṃ āgamma puna santānaṃ nibbattetuṃ na sakkuṇeyya, evameva khandhapavattiyaṃ nibbinno kulaputto tassa purisassa catūsu disāsu rukkhe visayojanaṃ viya attano santāne catumaggabhāvanaṃ ārabhati. Athassa so khandhasantāno tena catumaggavisasamphassena sabbaso vaṭṭamūlakakilesānaṃ pariyādiṇṇattā kiriyabhāvamattaupagatakāyakammādisabbakammappabhedo hutvā āyatiṃ punabbhavānabhinibbattanadhammataṃ āgamma bhavantarasantānaṃ nibbattetuṃ na sakkoti. Kevalaṃ carimaviññāṇanirodhena nirindhano viya jātavedo anupādāno parinibbāyati, evaṃ bhūmiyā bhūmiladdhassa ca nānattaṃ veditabbaṃ."
    ],
    "innerText": "Yathā pana tasseva rukkhassa pupphaphalādīsu nibbinno koci puriso catūsu disāsu maṇḍūkakaṇṭakaṃ nāma visakaṇṭakaṃ ākoṭeyya, atha so rukkho tena visasamphassena phuṭṭho pathavīrasaāporasānaṃ pariyādiṇṇattā appasavanadhammataṃ āgamma puna santānaṃ nibbattetuṃ na sakkuṇeyya, evameva khandhapavattiyaṃ nibbinno kulaputto tassa purisassa catūsu disāsu rukkhe visayojanaṃ viya attano santāne catumaggabhāvanaṃ ārabhati. Athassa so khandhasantāno tena catumaggavisasamphassena sabbaso vaṭṭamūlakakilesānaṃ pariyādiṇṇattā kiriyabhāvamattaupagatakāyakammādisabbakammappabhedo hutvā āyatiṃ punabbhavānabhinibbattanadhammataṃ āgamma bhavantarasantānaṃ nibbattetuṃ na sakkoti. Kevalaṃ carimaviññāṇanirodhena nirindhano viya jātavedo anupādāno parinibbāyati, evaṃ bhūmiyā bhūmiladdhassa ca nānattaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "837"
      },
      ". Apica aparampi samudācāraārammaṇādhiggahitaavikkhambhitaasamūhatavasena catubbidhaṃ uppannaṃ. Tattha vattamānuppannameva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samudācāruppannaṃ"
      },
      ". Cakkhādīnaṃ pana āpāthagate ārammaṇe pubbabhāge anuppajjamānampi kilesajātaṃ ārammaṇassa adhiggahitattā eva aparabhāge ekantena uppattito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇādhiggahituppanna"
      },
      "nti vuccati, kalyāṇigāme piṇḍāya carato mahātissattherassa visabhāgarūpadassanena uppannakilesajātaṃ viya. Samathavipassanānaṃ aññataravasena avikkhambhitaṃ kilesajātaṃ cittasantatimanārūḷhampi uppattinivārakassa hetuno abhāvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avikkhambhituppannaṃ"
      },
      " nāma. Samathavipassanāvasena pana vikkhambhitampi ariyamaggena asamūhatattā uppattidhammataṃ anatītatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asamūhatuppanna"
      },
      "nti vuccati, ākāsena gacchantassa aṭṭhasamāpattilābhino therassa kusumitarukkhe upavane pupphāni uccinantassa madhurena sarena gāyato mātugāmassa gītasavanena uppannakilesajātaṃ viya. Tividhampi cetaṃ ārammaṇādhiggahitāvikkhambhitaasamūhatuppannaṃ bhūmiladdheneva saṅgahaṃ gacchatīti veditabbaṃ."
    ],
    "innerText": "837. Apica aparampi samudācāraārammaṇādhiggahitaavikkhambhitaasamūhatavasena catubbidhaṃ uppannaṃ. Tattha vattamānuppannameva samudācāruppannaṃ. Cakkhādīnaṃ pana āpāthagate ārammaṇe pubbabhāge anuppajjamānampi kilesajātaṃ ārammaṇassa adhiggahitattā eva aparabhāge ekantena uppattito ārammaṇādhiggahituppannanti vuccati, kalyāṇigāme piṇḍāya carato mahātissattherassa visabhāgarūpadassanena uppannakilesajātaṃ viya. Samathavipassanānaṃ aññataravasena avikkhambhitaṃ kilesajātaṃ cittasantatimanārūḷhampi uppattinivārakassa hetuno abhāvā avikkhambhituppannaṃ nāma. Samathavipassanāvasena pana vikkhambhitampi ariyamaggena asamūhatattā uppattidhammataṃ anatītatāya asamūhatuppannanti vuccati, ākāsena gacchantassa aṭṭhasamāpattilābhino therassa kusumitarukkhe upavane pupphāni uccinantassa madhurena sarena gāyato mātugāmassa gītasavanena uppannakilesajātaṃ viya. Tividhampi cetaṃ ārammaṇādhiggahitāvikkhambhitaasamūhatuppannaṃ bhūmiladdheneva saṅgahaṃ gacchatīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "838"
      },
      ". Iccetasmiṃ vuttappabhede uppanne yadetaṃ vattamānabhūtāpagatokāsakatasamudācārasaṅkhātaṃ catubbidhaṃ uppannaṃ, taṃ amaggavajjhattā kenacipi ñāṇena pahātabbaṃ na hoti. Yaṃ panetaṃ bhūmiladdhārammaṇādhiggahitaavikkhambhitaasamūhatasaṅkhātaṃ uppannaṃ, tassa taṃ uppannabhāvaṃ vināsayamānaṃ yasmā taṃ taṃ lokiyalokuttarañāṇaṃ uppajjati, tasmā taṃ sabbampi pahātabbaṃ hotīti. Evamettha ye yena pahātabbā dhammā, tesaṃ pahānañca jānitabbaṃ."
    ],
    "innerText": "838. Iccetasmiṃ vuttappabhede uppanne yadetaṃ vattamānabhūtāpagatokāsakatasamudācārasaṅkhātaṃ catubbidhaṃ uppannaṃ, taṃ amaggavajjhattā kenacipi ñāṇena pahātabbaṃ na hoti. Yaṃ panetaṃ bhūmiladdhārammaṇādhiggahitaavikkhambhitaasamūhatasaṅkhātaṃ uppannaṃ, tassa taṃ uppannabhāvaṃ vināsayamānaṃ yasmā taṃ taṃ lokiyalokuttarañāṇaṃ uppajjati, tasmā taṃ sabbampi pahātabbaṃ hotīti. Evamettha ye yena pahātabbā dhammā, tesaṃ pahānañca jānitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pariññādikiccakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "839"
      },
      "."
    ],
    "innerText": "839."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Kiccāni ",
      " pariññādīni, yāni vuttāni abhisamayakāle;"
    ],
    "innerText": "Kiccāni pariññādīni, yāni vuttāni abhisamayakāle;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tāni ca yathāsabhāvena, jānitabbāni sabbānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saccābhisamayakālaṃ hi etesu catūsu ñāṇesu ekekassa ekakkhaṇe pariññā pahānaṃ sacchikiriyā bhāvanāti etāni pariññādīni cattāri kiccāni vuttāni, tāni yathāsabhāvena jānitabbāni. Vuttaṃ hetaṃ porāṇehi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yathā padīpo apubbaṃ acarimaṃ ekakkhaṇe cattāri kiccāni karoti, vaṭṭiṃ jhāpeti, andhakāraṃ vidhamati, ālokaṃ parividaṃseti, sinehaṃ pariyādiyati, evameva maggañāṇaṃ apubbaṃ acarimaṃ ekakkhaṇe cattāri saccāni abhisameti, dukkhaṃ pariññābhisamayena abhisameti, samudayaṃ pahānābhisamayena abhisameti, maggaṃ bhāvanābhisamayena abhisameti, nirodhaṃ sacchikiriyābhisamayena abhisameti. Kiṃ vuttaṃ hoti? Nirodhaṃ ārammaṇaṃ karitvā cattāripi saccāni pāpuṇāti passati paṭivijjhatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vuttampi cetaṃ ‘‘yo, bhikkhave, dukkhaṃ passati, dukkhasamudayampi so passati, dukkhanirodhampi passati, dukkhanirodhagāminiṃ paṭipadampi passatī’’ti (saṃ. ni. 5.1100) sabbaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Aparampi vuttaṃ ‘‘maggasamaṅgissa ñāṇaṃ, dukkhepetaṃ ñāṇaṃ, dukkhasamudayepetaṃ ñāṇaṃ, dukkhanirodhepetaṃ ñāṇaṃ, dukkhanirodhagāminiyā paṭipadāyapetaṃ ñāṇa’’nti (vibha. 794; paṭi. ma. 1.109)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha yathā padīpo vaṭṭiṃ jhāpeti, evaṃ maggañāṇaṃ dukkhaṃ parijānāti. Yathā andhakāraṃ vidhamati, evaṃ samudayaṃ pajahati. Yathā ālokaṃ parividaṃseti, evaṃ sahajātādipaccayatāya sammāsaṅkappādidhammasaṅkhātaṃ maggaṃ bhāveti. Yathā sinehaṃ pariyādiyati, evaṃ kilesapariyādānaṃ nirodhaṃ sacchikarotīti evaṃ upamāsaṃsandanaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "840"
      },
      ". Aparo ",
      " nayo – yathā sūriyo udayanto apubbaṃ acarimaṃ saha pātubhāvā cattāri kiccāni karoti, rūpagatāni obhāseti, andhakāraṃ ",
      " vidhamati, ālokaṃ dasseti, sītaṃ paṭippassambheti, evameva maggañāṇaṃ…pe… nirodhaṃ sacchikiriyābhisamayena abhisameti. Idhāpi yathā sūriyo rūpagatāni obhāseti, evaṃ maggañāṇaṃ dukkhaṃ parijānāti. Yathā andhakāraṃ vidhamati, evaṃ samudayaṃ pajahati. Yathā ālokaṃ dasseti, evaṃ sahajātādipaccayatāya maggaṃ bhāveti. Yathā sītaṃ paṭippassambheti, evaṃ kilesapaṭippassaddhiṃ nirodhaṃ sacchikarotīti evaṃ upamāsaṃsandanaṃ veditabbaṃ."
    ],
    "innerText": "840. Aparo nayo – yathā sūriyo udayanto apubbaṃ acarimaṃ saha pātubhāvā cattāri kiccāni karoti, rūpagatāni obhāseti, andhakāraṃ vidhamati, ālokaṃ dasseti, sītaṃ paṭippassambheti, evameva maggañāṇaṃ…pe… nirodhaṃ sacchikiriyābhisamayena abhisameti. Idhāpi yathā sūriyo rūpagatāni obhāseti, evaṃ maggañāṇaṃ dukkhaṃ parijānāti. Yathā andhakāraṃ vidhamati, evaṃ samudayaṃ pajahati. Yathā ālokaṃ dasseti, evaṃ sahajātādipaccayatāya maggaṃ bhāveti. Yathā sītaṃ paṭippassambheti, evaṃ kilesapaṭippassaddhiṃ nirodhaṃ sacchikarotīti evaṃ upamāsaṃsandanaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "841"
      },
      ". Aparo nayo – yathā nāvā apubbaṃ acarimaṃ ekakkhaṇe cattāri kiccāni karoti, orimatīraṃ pajahati, sotaṃ chindati, bhaṇḍaṃ vahati, pārimatīraṃ appeti, evameva maggañāṇaṃ…pe… nirodhaṃ sacchikiriyābhisamayena abhisameti. Etthāpi yathā nāvā orimatīraṃ pajahati, evaṃ maggañāṇaṃ dukkhaṃ parijānāti. Yathā sotaṃ chindati, evaṃ samudayaṃ pajahati. Yathā bhaṇḍaṃ vahati, evaṃ sahajātādipaccayatāya maggaṃ bhāveti. Yathā pārimatīraṃ appeti, evaṃ pārimatīrabhūtaṃ nirodhaṃ sacchikarotīti evaṃ upamāsaṃsandanaṃ veditabbaṃ."
    ],
    "innerText": "841. Aparo nayo – yathā nāvā apubbaṃ acarimaṃ ekakkhaṇe cattāri kiccāni karoti, orimatīraṃ pajahati, sotaṃ chindati, bhaṇḍaṃ vahati, pārimatīraṃ appeti, evameva maggañāṇaṃ…pe… nirodhaṃ sacchikiriyābhisamayena abhisameti. Etthāpi yathā nāvā orimatīraṃ pajahati, evaṃ maggañāṇaṃ dukkhaṃ parijānāti. Yathā sotaṃ chindati, evaṃ samudayaṃ pajahati. Yathā bhaṇḍaṃ vahati, evaṃ sahajātādipaccayatāya maggaṃ bhāveti. Yathā pārimatīraṃ appeti, evaṃ pārimatīrabhūtaṃ nirodhaṃ sacchikarotīti evaṃ upamāsaṃsandanaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "842"
      },
      ". Evaṃ saccābhisamayakālasmiṃ ekakkhaṇe catunnaṃ kiccānaṃ vasena pavattañāṇassa panassa soḷasahākārehi tathaṭṭhena cattāri kiccāni ekapaṭivedhāni honti. Yathāha –"
    ],
    "innerText": "842. Evaṃ saccābhisamayakālasmiṃ ekakkhaṇe catunnaṃ kiccānaṃ vasena pavattañāṇassa panassa soḷasahākārehi tathaṭṭhena cattāri kiccāni ekapaṭivedhāni honti. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Kathaṃ tathaṭṭhena cattāri kiccāni ekapaṭivedhāni? Soḷasahi ākārehi tathaṭṭhena cattāri kiccāni ekapaṭivedhāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhassa"
      },
      " pīḷanaṭṭho, saṅkhataṭṭho, santāpaṭṭho, vipariṇāmaṭṭho, tathaṭṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samudayassa"
      },
      " āyūhanaṭṭho, nidānaṭṭho, saṃyogaṭṭho, palibodhaṭṭho, tathaṭṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nirodhassa"
      },
      " nissaraṇaṭṭho, vivekaṭṭho, asaṅkhataṭṭho, amataṭṭho, tathaṭṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maggassa"
      },
      " niyyānaṭṭho, hetuṭṭho, dassanaṭṭho, adhipateyyaṭṭho, tathaṭṭho. Imehi soḷasahi ākārehi tathaṭṭhena cattāri saccāni ekasaṅgahitāni. Yaṃ ekasaṅgahitaṃ, taṃ ekattaṃ. Yaṃ ekattaṃ, taṃ ekena ñāṇena paṭivijjhatīti cattāri saccāni ekapaṭivedhānī’’ti (paṭi. ma. 2.11)."
    ],
    "innerText": "‘‘Kathaṃ tathaṭṭhena cattāri kiccāni ekapaṭivedhāni? Soḷasahi ākārehi tathaṭṭhena cattāri kiccāni ekapaṭivedhāni. Dukkhassa pīḷanaṭṭho, saṅkhataṭṭho, santāpaṭṭho, vipariṇāmaṭṭho, tathaṭṭho. Samudayassa āyūhanaṭṭho, nidānaṭṭho, saṃyogaṭṭho, palibodhaṭṭho, tathaṭṭho. Nirodhassa nissaraṇaṭṭho, vivekaṭṭho, asaṅkhataṭṭho, amataṭṭho, tathaṭṭho. Maggassa niyyānaṭṭho, hetuṭṭho, dassanaṭṭho, adhipateyyaṭṭho, tathaṭṭho. Imehi soḷasahi ākārehi tathaṭṭhena cattāri saccāni ekasaṅgahitāni. Yaṃ ekasaṅgahitaṃ, taṃ ekattaṃ. Yaṃ ekattaṃ, taṃ ekena ñāṇena paṭivijjhatīti cattāri saccāni ekapaṭivedhānī’’ti (paṭi. ma. 2.11)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "843"
      },
      ". Tattha ",
      " siyā yadā dukkhādīnaṃ aññepi rogagaṇḍādayo atthā atthi, atha kasmā cattāroyeva vuttāti. Ettha vadāma, aññasaccadassanavasena āvibhāvato. ‘‘Tattha katamaṃ ",
      " dukkhe ñāṇaṃ? Dukkhaṃ ārabbha yā uppajjati paññā pajānanā’’tiādinā (vibha. 794; paṭi. ma. 1.109) hi nayena ekekasaccārammaṇavasenāpi saccañāṇaṃ vuttaṃ. ‘‘Yo, bhikkhave, dukkhaṃ passati, samudayampi so passatī’’tiādinā (saṃ. ni. 5.1100) nayena ekaṃ saccaṃ ārammaṇaṃ katvā sesesupi kiccanipphattivasenāpi vuttaṃ."
    ],
    "innerText": "843. Tattha siyā yadā dukkhādīnaṃ aññepi rogagaṇḍādayo atthā atthi, atha kasmā cattāroyeva vuttāti. Ettha vadāma, aññasaccadassanavasena āvibhāvato. ‘‘Tattha katamaṃ dukkhe ñāṇaṃ? Dukkhaṃ ārabbha yā uppajjati paññā pajānanā’’tiādinā (vibha. 794; paṭi. ma. 1.109) hi nayena ekekasaccārammaṇavasenāpi saccañāṇaṃ vuttaṃ. ‘‘Yo, bhikkhave, dukkhaṃ passati, samudayampi so passatī’’tiādinā (saṃ. ni. 5.1100) nayena ekaṃ saccaṃ ārammaṇaṃ katvā sesesupi kiccanipphattivasenāpi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yadā ekekaṃ saccaṃ ārammaṇaṃ karoti, tadā samudayadassanena tāva sabhāvato pīḷanalakkhaṇassāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhassa,"
      },
      " yasmā taṃ āyūhanalakkhaṇena samudayena āyūhitaṃ saṅkhataṃ rāsikataṃ, tasmāssa so saṅkhataṭṭho āvibhavati. Yasmā pana maggo kilesasantāpaharo susītalo, tasmāssa maggassa dassanena santāpaṭṭho āvibhavati āyasmato nandassa accharādassanena sundariyā anabhirūpabhāvo viya. Avipariṇāmadhammassa pana nirodhassa dassanenassa vipariṇāmaṭṭho āvibhavatīti vattabbamevettha natthi."
    ],
    "innerText": "Tattha yadā ekekaṃ saccaṃ ārammaṇaṃ karoti, tadā samudayadassanena tāva sabhāvato pīḷanalakkhaṇassāpi dukkhassa, yasmā taṃ āyūhanalakkhaṇena samudayena āyūhitaṃ saṅkhataṃ rāsikataṃ, tasmāssa so saṅkhataṭṭho āvibhavati. Yasmā pana maggo kilesasantāpaharo susītalo, tasmāssa maggassa dassanena santāpaṭṭho āvibhavati āyasmato nandassa accharādassanena sundariyā anabhirūpabhāvo viya. Avipariṇāmadhammassa pana nirodhassa dassanenassa vipariṇāmaṭṭho āvibhavatīti vattabbamevettha natthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā sabhāvato āyūhanalakkhaṇassāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samudayassa,"
      },
      " dukkhadassanena nidānaṭṭho āvibhavati asappāyabhojanato uppannabyādhidassanena bhojanassa byādhinidānabhāvo viya. Visaṃyogabhūtassa nirodhassa dassanena saṃyogaṭṭho. Niyyānabhūtassa ca maggassa dassanena palibodhaṭṭhoti."
    ],
    "innerText": "Tathā sabhāvato āyūhanalakkhaṇassāpi samudayassa, dukkhadassanena nidānaṭṭho āvibhavati asappāyabhojanato uppannabyādhidassanena bhojanassa byādhinidānabhāvo viya. Visaṃyogabhūtassa nirodhassa dassanena saṃyogaṭṭho. Niyyānabhūtassa ca maggassa dassanena palibodhaṭṭhoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā nissaraṇalakkhaṇassāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nirodhassa,"
      },
      " avivekabhūtassa samudayassa dassanena vivekaṭṭho āvibhavati. Maggadassanena asaṅkhataṭṭho, iminā hi anamataggasaṃsāre maggo nadiṭṭhapubbo, sopi ca sappaccayattā saṅkhatoyevāti appaccayadhammassa asaṅkhatabhāvo ativiya pākaṭo hoti. Dukkhadassanena panassa amataṭṭho āvibhavati, dukkhaṃ hi visaṃ, amataṃ nibbānanti."
    ],
    "innerText": "Tathā nissaraṇalakkhaṇassāpi nirodhassa, avivekabhūtassa samudayassa dassanena vivekaṭṭho āvibhavati. Maggadassanena asaṅkhataṭṭho, iminā hi anamataggasaṃsāre maggo nadiṭṭhapubbo, sopi ca sappaccayattā saṅkhatoyevāti appaccayadhammassa asaṅkhatabhāvo ativiya pākaṭo hoti. Dukkhadassanena panassa amataṭṭho āvibhavati, dukkhaṃ hi visaṃ, amataṃ nibbānanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā niyyānalakkhaṇassāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "maggassa,"
      },
      " samudayadassanena ‘‘nāyaṃ hetu nibbānassa pattiyā, ayaṃ hetū’’ti hetuṭṭho āvibhavati. Nirodhadassanena dassanaṭṭho, paramasukhumāni rūpāni passato ‘‘vippasannaṃ vata me ",
      " cakkhū’’nti cakkhussa vippasannabhāvo viya. Dukkhadassanena adhipateyyaṭṭho, anekarogāturakapaṇajanadassanena issarajanassa uḷārabhāvo viyāti evamettha salakkhaṇavasena ekekassa, aññasaccadassanavasena ca itaresaṃ tiṇṇaṃ tiṇṇaṃ āvibhāvato ekekassa cattāro cattāro atthā vuttā. Maggakkhaṇe pana sabbe cete atthā ekeneva dukkhādīsu ",
      " catukiccena ñāṇena paṭivedhaṃ gacchantīti. Ye pana nānābhisamayaṃ icchanti, tesaṃ uttaraṃ abhidhamme kathāvatthusmiṃ vuttameva."
    ],
    "innerText": "Tathā niyyānalakkhaṇassāpi maggassa, samudayadassanena ‘‘nāyaṃ hetu nibbānassa pattiyā, ayaṃ hetū’’ti hetuṭṭho āvibhavati. Nirodhadassanena dassanaṭṭho, paramasukhumāni rūpāni passato ‘‘vippasannaṃ vata me cakkhū’’nti cakkhussa vippasannabhāvo viya. Dukkhadassanena adhipateyyaṭṭho, anekarogāturakapaṇajanadassanena issarajanassa uḷārabhāvo viyāti evamettha salakkhaṇavasena ekekassa, aññasaccadassanavasena ca itaresaṃ tiṇṇaṃ tiṇṇaṃ āvibhāvato ekekassa cattāro cattāro atthā vuttā. Maggakkhaṇe pana sabbe cete atthā ekeneva dukkhādīsu catukiccena ñāṇena paṭivedhaṃ gacchantīti. Ye pana nānābhisamayaṃ icchanti, tesaṃ uttaraṃ abhidhamme kathāvatthusmiṃ vuttameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pariññādippabhedakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "844"
      },
      ". Idāni yāni tāni pariññādīni cattāri kiccāni vuttāni, tesu –"
    ],
    "innerText": "844. Idāni yāni tāni pariññādīni cattāri kiccāni vuttāni, tesu –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tividhā hoti pariññā, tathā pahānampi sacchikiriyāpi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dve bhāvanā abhimatā, vinicchayo tattha ñātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "845"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tividhā hoti pariññā"
      },
      "ti ñātapariññā tīraṇapariññā pahānapariññāti evaṃ pariññā tividhā hoti. Tattha ‘‘abhiññāpaññā ñātaṭṭhena ñāṇa’’nti (paṭi. ma. mātikā 1.20) evaṃ uddisitvā ‘‘ye ye dhammā abhiññātā honti, te te dhammā ñātā hontī’’ti (paṭi. ma. 1.75) evaṃ saṅkhepato, ‘‘sabbaṃ, bhikkhave, abhiññeyyaṃ. Kiñca, bhikkhave, sabbaṃ abhiññeyyaṃ? Cakkhuṃ, bhikkhave, abhiññeyya’’ntiādinā (paṭi. ma. 1.2) nayena vitthārato vuttā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñātapariññā"
      },
      " nāma. Tassā sappaccayanāmarūpābhijānanā āveṇikā bhūmi."
    ],
    "innerText": "845.Tividhā hoti pariññāti ñātapariññā tīraṇapariññā pahānapariññāti evaṃ pariññā tividhā hoti. Tattha ‘‘abhiññāpaññā ñātaṭṭhena ñāṇa’’nti (paṭi. ma. mātikā 1.20) evaṃ uddisitvā ‘‘ye ye dhammā abhiññātā honti, te te dhammā ñātā hontī’’ti (paṭi. ma. 1.75) evaṃ saṅkhepato, ‘‘sabbaṃ, bhikkhave, abhiññeyyaṃ. Kiñca, bhikkhave, sabbaṃ abhiññeyyaṃ? Cakkhuṃ, bhikkhave, abhiññeyya’’ntiādinā (paṭi. ma. 1.2) nayena vitthārato vuttā ñātapariññā nāma. Tassā sappaccayanāmarūpābhijānanā āveṇikā bhūmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "846"
      },
      ". ‘‘Pariññāpaññā tīraṇaṭṭhena ñāṇa’’nti (paṭi. ma. mātikā 1.21) evaṃ uddisitvā pana ‘‘ye ye dhammā pariññātā honti, te te dhammā tīritā hontī’’ti (paṭi. ma. 1.75) evaṃ saṅkhepato, ‘‘sabbaṃ, bhikkhave, pariññeyyaṃ. Kiñca, bhikkhave, sabbaṃ pariññeyyaṃ? Cakkhuṃ, bhikkhave, pariññeyya’’ntiādinā (paṭi. ma. 1.21) nayena vitthārato vuttā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tīraṇapariññā"
      },
      " nāma. Tassā kalāpasammasanato paṭṭhāya aniccaṃ dukkhamanattāti tīraṇavasena pavattamānāya yāva anulomā āveṇikā bhūmi."
    ],
    "innerText": "846. ‘‘Pariññāpaññā tīraṇaṭṭhena ñāṇa’’nti (paṭi. ma. mātikā 1.21) evaṃ uddisitvā pana ‘‘ye ye dhammā pariññātā honti, te te dhammā tīritā hontī’’ti (paṭi. ma. 1.75) evaṃ saṅkhepato, ‘‘sabbaṃ, bhikkhave, pariññeyyaṃ. Kiñca, bhikkhave, sabbaṃ pariññeyyaṃ? Cakkhuṃ, bhikkhave, pariññeyya’’ntiādinā (paṭi. ma. 1.21) nayena vitthārato vuttā tīraṇapariññā nāma. Tassā kalāpasammasanato paṭṭhāya aniccaṃ dukkhamanattāti tīraṇavasena pavattamānāya yāva anulomā āveṇikā bhūmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "847"
      },
      ". ‘‘Pahānapaññā pariccāgaṭṭhena ñāṇa’’nti (paṭi. ma. mātikā 1.22) evaṃ pana uddisitvā ‘‘ye ye dhammā pahīnā honti, te te dhammā pariccattā hontī’’ti (paṭi. ma. 1.75) evaṃ vitthārato ",
      " vuttā ‘‘aniccānupassanāya niccasaññaṃ pajahatī’’tiādinayappavattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pahānapariññā"
      },
      ". Tassā bhaṅgānupassanato paṭṭhāya yāva maggañāṇā bhūmi, ayaṃ idha adhippetā."
    ],
    "innerText": "847. ‘‘Pahānapaññā pariccāgaṭṭhena ñāṇa’’nti (paṭi. ma. mātikā 1.22) evaṃ pana uddisitvā ‘‘ye ye dhammā pahīnā honti, te te dhammā pariccattā hontī’’ti (paṭi. ma. 1.75) evaṃ vitthārato vuttā ‘‘aniccānupassanāya niccasaññaṃ pajahatī’’tiādinayappavattā pahānapariññā. Tassā bhaṅgānupassanato paṭṭhāya yāva maggañāṇā bhūmi, ayaṃ idha adhippetā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yasmā vā ñātatīraṇapariññāyopi tadatthāyeva, yasmā ca ye dhamme pajahati, te niyamato ñātā ceva tīritā ca honti, tasmā pariññāttayampi iminā pariyāyena maggañāṇassa kiccanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "848"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathā pahānampī"
      },
      "ti pahānampi hi vikkhambhanappahānaṃ tadaṅgappahānaṃ samucchedappahānanti pariññā viya tividhameva hoti. Tattha yaṃ sasevāle udake pakkhittena ghaṭena sevālassa viya tena tena lokiyasamādhinā nīvaraṇādīnaṃ paccanīkadhammānaṃ vikkhambhanaṃ, idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vikkhambhanappahānaṃ"
      },
      " nāma. Pāḷiyaṃ pana ‘‘vikkhambhanappahānañca nīvaraṇānaṃ paṭhamaṃ jhānaṃ bhāvayato’’ti (paṭi. ma. 1.24) nīvaraṇānaññeva vikkhambhanaṃ vuttaṃ, taṃ pākaṭattā vuttanti veditabbaṃ. Nīvaraṇāni hi jhānassa pubbabhāgepi pacchābhāgepi na sahasā cittaṃ ajjhottharanti, vitakkādayo appitakkhaṇeyeva. Tasmā nīvaraṇānaṃ vikkhambhanaṃ pākaṭaṃ."
    ],
    "innerText": "848.Tathā pahānampīti pahānampi hi vikkhambhanappahānaṃ tadaṅgappahānaṃ samucchedappahānanti pariññā viya tividhameva hoti. Tattha yaṃ sasevāle udake pakkhittena ghaṭena sevālassa viya tena tena lokiyasamādhinā nīvaraṇādīnaṃ paccanīkadhammānaṃ vikkhambhanaṃ, idaṃ vikkhambhanappahānaṃ nāma. Pāḷiyaṃ pana ‘‘vikkhambhanappahānañca nīvaraṇānaṃ paṭhamaṃ jhānaṃ bhāvayato’’ti (paṭi. ma. 1.24) nīvaraṇānaññeva vikkhambhanaṃ vuttaṃ, taṃ pākaṭattā vuttanti veditabbaṃ. Nīvaraṇāni hi jhānassa pubbabhāgepi pacchābhāgepi na sahasā cittaṃ ajjhottharanti, vitakkādayo appitakkhaṇeyeva. Tasmā nīvaraṇānaṃ vikkhambhanaṃ pākaṭaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "849"
      },
      ". Yaṃ pana rattibhāge samujjalitena padīpena andhakārassa viya tena tena vipassanāya avayavabhūtena ñāṇaṅgena paṭipakkhavaseneva tassa tassa pahātabbadhammassa pahānaṃ, idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tadaṅgappahānaṃ"
      },
      " nāma. Seyyathidaṃ – nāmarūpaparicchedena tāva sakkāyadiṭṭhiyā. Paccayapariggahena ahetuvisamahetudiṭṭhiyā ceva kaṅkhāmalassa ca. Kalāpasammasanena ‘‘ahaṃ mamā’’ti samūhagāhassa. Maggāmaggavavatthānena amagge maggasaññāya. Udayadassanena ucchedadiṭṭhiyā. Vayadassanena sassatadiṭṭhiyā. Bhayatupaṭṭhānena sabhaye abhayasaññāya. Ādīnavadassanena assādasaññāya. Nibbidānupassanena abhiratisaññāya. Muñcitukamyatāya amuñcitukāmabhāvassa. Paṭisaṅkhānena appaṭisaṅkhānassa. Upekkhāya anupekkhanassa. Anulomena saccapaṭilomagāhassa pahānaṃ."
    ],
    "innerText": "849. Yaṃ pana rattibhāge samujjalitena padīpena andhakārassa viya tena tena vipassanāya avayavabhūtena ñāṇaṅgena paṭipakkhavaseneva tassa tassa pahātabbadhammassa pahānaṃ, idaṃ tadaṅgappahānaṃ nāma. Seyyathidaṃ – nāmarūpaparicchedena tāva sakkāyadiṭṭhiyā. Paccayapariggahena ahetuvisamahetudiṭṭhiyā ceva kaṅkhāmalassa ca. Kalāpasammasanena ‘‘ahaṃ mamā’’ti samūhagāhassa. Maggāmaggavavatthānena amagge maggasaññāya. Udayadassanena ucchedadiṭṭhiyā. Vayadassanena sassatadiṭṭhiyā. Bhayatupaṭṭhānena sabhaye abhayasaññāya. Ādīnavadassanena assādasaññāya. Nibbidānupassanena abhiratisaññāya. Muñcitukamyatāya amuñcitukāmabhāvassa. Paṭisaṅkhānena appaṭisaṅkhānassa. Upekkhāya anupekkhanassa. Anulomena saccapaṭilomagāhassa pahānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yaṃ vā pana aṭṭhārasasu mahāvipassanāsu aniccānupassanāya niccasaññāya. Dukkhānupassanāya sukhasaññāya. Anattānupassanāya attasaññāya. Nibbidānupassanāya nandiyā. Virāgānupassanāya rāgassa. Nirodhānupassanāya ",
      " samudayassa. Paṭinissaggānupassanāya ",
      " ādānassa. Khayānupassanāya ghanasaññāya. Vayānupassanāya āyūhanassa. Vipariṇāmānupassanāya dhuvasaññāya. Animittānupassanāya nimittassa. Appaṇihitānupassanāya paṇidhiyā. Suññatānupassanāya abhinivesassa. Adhipaññādhammavipassanāya sārādānābhinivesassa. Yathābhūtañāṇadassanena sammohābhinivesassa. Ādīnavānupassanāya ālayābhinivesassa. Paṭisaṅkhānupassanāya appaṭisaṅkhāya. Vivaṭṭānupassanāya saṃyogābhinivesassa pahānaṃ. Idampi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tadaṅgappahāna"
      },
      "meva."
    ],
    "innerText": "Yaṃ vā pana aṭṭhārasasu mahāvipassanāsu aniccānupassanāya niccasaññāya. Dukkhānupassanāya sukhasaññāya. Anattānupassanāya attasaññāya. Nibbidānupassanāya nandiyā. Virāgānupassanāya rāgassa. Nirodhānupassanāya samudayassa. Paṭinissaggānupassanāya ādānassa. Khayānupassanāya ghanasaññāya. Vayānupassanāya āyūhanassa. Vipariṇāmānupassanāya dhuvasaññāya. Animittānupassanāya nimittassa. Appaṇihitānupassanāya paṇidhiyā. Suññatānupassanāya abhinivesassa. Adhipaññādhammavipassanāya sārādānābhinivesassa. Yathābhūtañāṇadassanena sammohābhinivesassa. Ādīnavānupassanāya ālayābhinivesassa. Paṭisaṅkhānupassanāya appaṭisaṅkhāya. Vivaṭṭānupassanāya saṃyogābhinivesassa pahānaṃ. Idampi tadaṅgappahānameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "850"
      },
      ". Tattha yathā aniccānupassanādīhi sattahi niccasaññādīnaṃ pahānaṃ hoti, taṃ bhaṅgānupassane vuttameva."
    ],
    "innerText": "850. Tattha yathā aniccānupassanādīhi sattahi niccasaññādīnaṃ pahānaṃ hoti, taṃ bhaṅgānupassane vuttameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khayānupassanā"
      },
      "ti pana ghanavinibbhogaṃ katvā aniccaṃ khayaṭṭhenāti evaṃ khayaṃ passato ñāṇaṃ. Tena ghanasaññāya pahānaṃ hoti."
    ],
    "innerText": "Khayānupassanāti pana ghanavinibbhogaṃ katvā aniccaṃ khayaṭṭhenāti evaṃ khayaṃ passato ñāṇaṃ. Tena ghanasaññāya pahānaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vayānupassanā"
      },
      "ti –"
    ],
    "innerText": "Vayānupassanāti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ārammaṇānvayena, ubho ekavavatthānā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nirodhe adhimuttatā, vayalakkhaṇavipassanāti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Evaṃ vuttā paccakkhato ceva anvayato ca saṅkhārānaṃ bhaṅgaṃ disvā tasmiññeva bhaṅgasaṅkhāte nirodhe adhimuttatā, tāya āyūhanassa pahānaṃ hoti. Yesaṃ hi atthāya āyūheyya, ‘‘te evaṃ vayadhammā’’ti vipassato āyūhane cittaṃ na namati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipariṇāmānupassanā"
      },
      "ti rūpasattakādivasena taṃ taṃ paricchedaṃ atikkamma aññathāpavattidassanaṃ. Uppannassa vā jarāya ceva maraṇena ca dvīhākārehi vipariṇāmadassanaṃ, tāya dhuvasaññāya pahānaṃ hoti."
    ],
    "innerText": "Vipariṇāmānupassanāti rūpasattakādivasena taṃ taṃ paricchedaṃ atikkamma aññathāpavattidassanaṃ. Uppannassa vā jarāya ceva maraṇena ca dvīhākārehi vipariṇāmadassanaṃ, tāya dhuvasaññāya pahānaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Animittānupassanā"
      },
      "ti aniccānupassanāva, tāya niccanimittassa pahānaṃ hoti."
    ],
    "innerText": "Animittānupassanāti aniccānupassanāva, tāya niccanimittassa pahānaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaṇihitānupassanā"
      },
      "ti dukkhānupassanāva, tāya sukhapaṇidhisukhapatthanāpahānaṃ hoti."
    ],
    "innerText": "Appaṇihitānupassanāti dukkhānupassanāva, tāya sukhapaṇidhisukhapatthanāpahānaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suññatānupassanā"
      },
      "ti anattānupassanāva, tāya ‘‘atthi attā’’ti abhinivesassa pahānaṃ hoti."
    ],
    "innerText": "Suññatānupassanāti anattānupassanāva, tāya ‘‘atthi attā’’ti abhinivesassa pahānaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhipaññādhammavipassanā"
      },
      "ti ",
      " –"
    ],
    "innerText": "Adhipaññādhammavipassanāti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ārammaṇañca paṭisaṅkhā, bhaṅgañca anupassati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Suññato ca upaṭṭhānaṃ, adhipaññā vipassanā’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Evaṃ vuttā rūpādiārammaṇaṃ jānitvā tassa ca ārammaṇassa tadārammaṇassa ca cittassa bhaṅgaṃ disvā ‘‘saṅkhārāva bhijjanti, saṅkhārānaṃ maraṇaṃ, na añño koci atthī’’ti bhaṅgavasena suññataṃ gahetvā pavattā vipassanā. Sā adhipaññā ca dhammesu ca vipassanāti katvā adhipaññādhammavipassanāti vuccati, tāya niccasārābhāvassa ca attasārābhāvassa ca suṭṭhu diṭṭhattā sārādānābhinivesassa pahānaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathābhūtañāṇadassana"
      },
      "nti sappaccayanāmarūpapariggaho, tena ‘‘ahosiṃ nu kho ahaṃ atītamaddhāna’’ntiādivasena ceva, ‘‘issarato loko sambhotī’’tiādivasena ca pavattassa sammohābhinivesassa pahānaṃ hoti."
    ],
    "innerText": "Yathābhūtañāṇadassananti sappaccayanāmarūpapariggaho, tena ‘‘ahosiṃ nu kho ahaṃ atītamaddhāna’’ntiādivasena ceva, ‘‘issarato loko sambhotī’’tiādivasena ca pavattassa sammohābhinivesassa pahānaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādīnavānupassanā"
      },
      "ti bhayatupaṭṭhānavasena uppannaṃ sabbabhavādīsu ādīnavadassanañāṇaṃ, tena ‘‘kiñci allīyitabbaṃ na dissatī’’ti ālayābhinivesassa pahānaṃ hoti."
    ],
    "innerText": "Ādīnavānupassanāti bhayatupaṭṭhānavasena uppannaṃ sabbabhavādīsu ādīnavadassanañāṇaṃ, tena ‘‘kiñci allīyitabbaṃ na dissatī’’ti ālayābhinivesassa pahānaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisaṅkhānupassanā"
      },
      "ti muñcanassa upāyakaraṇaṃ paṭisaṅkhāñāṇaṃ, tena appaṭisaṅkhāya pahānaṃ hoti."
    ],
    "innerText": "Paṭisaṅkhānupassanāti muñcanassa upāyakaraṇaṃ paṭisaṅkhāñāṇaṃ, tena appaṭisaṅkhāya pahānaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivaṭṭānupassanā"
      },
      "ti saṅkhārupekkhā ceva anulomañca. Tadā hissa cittaṃ īsakapoṇe padumapalāse udakabindu viya sabbasmā saṅkhāragatā patilīyati, patikuṭati, pativattatīti vuttaṃ. Tasmā tāya saṃyogābhinivesassa pahānaṃ hoti, kāmasaṃyogādikassa kilesābhinivesassa kilesappavattiyā pahānaṃ hotīti attho. Evaṃ vitthārato tadaṅgappahānaṃ veditabbaṃ. Pāḷiyaṃ pana ‘‘tadaṅgappahānañca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato’’ti (paṭi. ma. 1.24) saṅkhepeneva vuttaṃ."
    ],
    "innerText": "Vivaṭṭānupassanāti saṅkhārupekkhā ceva anulomañca. Tadā hissa cittaṃ īsakapoṇe padumapalāse udakabindu viya sabbasmā saṅkhāragatā patilīyati, patikuṭati, pativattatīti vuttaṃ. Tasmā tāya saṃyogābhinivesassa pahānaṃ hoti, kāmasaṃyogādikassa kilesābhinivesassa kilesappavattiyā pahānaṃ hotīti attho. Evaṃ vitthārato tadaṅgappahānaṃ veditabbaṃ. Pāḷiyaṃ pana ‘‘tadaṅgappahānañca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato’’ti (paṭi. ma. 1.24) saṅkhepeneva vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "851"
      },
      ". Yaṃ ",
      " pana asanivicakkābhihatassa rukkhassa viya ariyamaggañāṇena saṃyojanādīnaṃ dhammānaṃ yathā na puna pavatti, evaṃ pahānaṃ, idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samucchedappahānaṃ"
      },
      " nāma. Yaṃ sandhāya vuttaṃ ‘‘samucchedappahānañca lokuttaraṃ khayagāmimaggaṃ bhāvayato’’ti (paṭi. ma. 1.24) ",
      ". Iti imesu tīsu pahānesu samucchedappahānameva idha adhippetaṃ. Yasmā pana tassa yogino pubbabhāge vikkhambhanatadaṅgappahānānipi tadatthāneva, tasmā pahānattayampi iminā pariyāyena maggañāṇassa kiccanti veditabbaṃ. Paṭirājānaṃ vadhitvā rajjaṃ pattena hi yampi tato pubbe kataṃ, sabbaṃ ‘‘idañcidañca raññā kata’’ntiyeva vuccati."
    ],
    "innerText": "851. Yaṃ pana asanivicakkābhihatassa rukkhassa viya ariyamaggañāṇena saṃyojanādīnaṃ dhammānaṃ yathā na puna pavatti, evaṃ pahānaṃ, idaṃ samucchedappahānaṃ nāma. Yaṃ sandhāya vuttaṃ ‘‘samucchedappahānañca lokuttaraṃ khayagāmimaggaṃ bhāvayato’’ti (paṭi. ma. 1.24) . Iti imesu tīsu pahānesu samucchedappahānameva idha adhippetaṃ. Yasmā pana tassa yogino pubbabhāge vikkhambhanatadaṅgappahānānipi tadatthāneva, tasmā pahānattayampi iminā pariyāyena maggañāṇassa kiccanti veditabbaṃ. Paṭirājānaṃ vadhitvā rajjaṃ pattena hi yampi tato pubbe kataṃ, sabbaṃ ‘‘idañcidañca raññā kata’’ntiyeva vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "852"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacchikiriyāpī"
      },
      "ti lokiyasacchikiriyā lokuttarasacchikiriyāti dvedhā bhinnāpi lokuttarāya dassanabhāvanāvasena bhedato tividhā hoti. Tattha ‘‘paṭhamassa jhānassa lābhīmhi, vasīmhi, paṭhamajjhānaṃ sacchikataṃ mayā’’tiādinā (pārā. 203-204) nayena āgatā paṭhamajjhānādīnaṃ phassanā lokiyasacchikiriyā nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phassanā"
      },
      "ti adhigantvā ‘‘idaṃ mayā adhigata’’nti paccakkhato ñāṇaphassena phusanā. Imameva hi atthaṃ sandhāya ‘‘sacchikiriyā paññā phassanaṭṭhe ñāṇa’’nti (paṭi. ma. mātikā 1.24) uddisitvā ‘‘ye ye dhammā sacchikatā honti, te te dhammā phassitā hontī’’ti (paṭi. ma. 1.75) sacchikiriyaniddeso vutto."
    ],
    "innerText": "852.Sacchikiriyāpīti lokiyasacchikiriyā lokuttarasacchikiriyāti dvedhā bhinnāpi lokuttarāya dassanabhāvanāvasena bhedato tividhā hoti. Tattha ‘‘paṭhamassa jhānassa lābhīmhi, vasīmhi, paṭhamajjhānaṃ sacchikataṃ mayā’’tiādinā (pārā. 203-204) nayena āgatā paṭhamajjhānādīnaṃ phassanā lokiyasacchikiriyā nāma. Phassanāti adhigantvā ‘‘idaṃ mayā adhigata’’nti paccakkhato ñāṇaphassena phusanā. Imameva hi atthaṃ sandhāya ‘‘sacchikiriyā paññā phassanaṭṭhe ñāṇa’’nti (paṭi. ma. mātikā 1.24) uddisitvā ‘‘ye ye dhammā sacchikatā honti, te te dhammā phassitā hontī’’ti (paṭi. ma. 1.75) sacchikiriyaniddeso vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Apica attano santāne anuppādetvāpi ye dhammā kevalaṃ aparappaccayena ñāṇena ñātā, te sacchikatā honti. Teneva hi ‘‘sabbaṃ, bhikkhave, sacchikātabbaṃ. Kiñca, bhikkhave, sabbaṃ sacchikātabbaṃ? Cakkhu, bhikkhave, sacchikātabba’’ntiādi (paṭi. ma. 1.29) vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Aparampi vuttaṃ ‘‘rūpaṃ passanto sacchikaroti. Vedanaṃ…pe… viññāṇaṃ passanto sacchikaroti. Cakkhuṃ…pe… jarāmaraṇaṃ…pe… amatogadhaṃ nibbānaṃ passanto sacchikarotīti. Ye ye dhammā sacchikatā honti, te te dhammā phassitā hontī’’ti (paṭi. ma. 1.29)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paṭhamamaggakkhaṇe pana nibbānadassanaṃ dassanasacchikiriyā. Sesamaggakkhaṇesu bhāvanāsacchikiriyāti. Sā duvidhāpi idha adhippetā. Tasmā dassanabhāvanāvasena nibbānassa sacchikiriyā imassa ñāṇassa kiccanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "853"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhāvanā abhimatā"
      },
      "ti bhāvanā pana lokiyabhāvanā lokuttarabhāvanāti dveyeva abhimatā. Tattha lokiyānaṃ sīlasamādhipaññānaṃ uppādanaṃ, tāhi ca santānavāsanaṃ lokiyabhāvanā. Lokuttarānaṃ uppādanaṃ, tāhi ca santānavāsanaṃ lokuttarabhāvanā. Tāsu idha lokuttarā adhippetā. Lokuttarāni hi sīlādīni catubbidhampetaṃ ñāṇaṃ uppādeti. Tesaṃ sahajātapaccayāditāya tehi ca santānaṃ vāsetīti lokuttarabhāvanāvassa kiccanti."
    ],
    "innerText": "853.Dvebhāvanā abhimatāti bhāvanā pana lokiyabhāvanā lokuttarabhāvanāti dveyeva abhimatā. Tattha lokiyānaṃ sīlasamādhipaññānaṃ uppādanaṃ, tāhi ca santānavāsanaṃ lokiyabhāvanā. Lokuttarānaṃ uppādanaṃ, tāhi ca santānavāsanaṃ lokuttarabhāvanā. Tāsu idha lokuttarā adhippetā. Lokuttarāni hi sīlādīni catubbidhampetaṃ ñāṇaṃ uppādeti. Tesaṃ sahajātapaccayāditāya tehi ca santānaṃ vāsetīti lokuttarabhāvanāvassa kiccanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kiccāni pariññādīni, yāni vuttāni abhisamayakāle;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tāni ca yathāsabhāvena, jānitabbāni sabbānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettāvatā ca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "‘‘Sīle patiṭṭhāya naro sapañño, cittaṃ paññañca bhāvaya’’nti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ sarūpeneva ābhatāya paññābhāvanāya vidhānadassanatthaṃ yaṃ vuttaṃ ‘‘mūlabhūtā dve visuddhiyo sampādetvā sarīrabhūtā pañca visuddhiyo sampādentena bhāvetabbā’’ti, taṃ vitthāritaṃ hoti. Kathaṃ bhāvetabbāti ayañca pañho vissajjitoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti sādhujanapāmojjatthāya kate visuddhimagge"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paññābhāvanādhikāre"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ñāṇadassanavisuddhiniddeso nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bāvīsatimo paricchedo."
  }
]