[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "15. Āyatanadhātuniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Āyatanavitthārakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "510"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āyatanānī"
      },
      "ti ",
      " dvādasāyatanāni – cakkhāyatanaṃ, rūpāyatanaṃ, sotāyatanaṃ, saddāyatanaṃ, ghānāyatanaṃ, gandhāyatanaṃ, jivhāyatanaṃ, rasāyatanaṃ, kāyāyatanaṃ, phoṭṭhabbāyatanaṃ, manāyatanaṃ, dhammāyatananti. Tattha –"
    ],
    "innerText": "510.Āyatanānīti dvādasāyatanāni – cakkhāyatanaṃ, rūpāyatanaṃ, sotāyatanaṃ, saddāyatanaṃ, ghānāyatanaṃ, gandhāyatanaṃ, jivhāyatanaṃ, rasāyatanaṃ, kāyāyatanaṃ, phoṭṭhabbāyatanaṃ, manāyatanaṃ, dhammāyatananti. Tattha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Attha lakkhaṇa tāvatva, kama saṅkhepa vitthārā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tathā daṭṭhabbato ceva, viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha visesato tāva cakkhatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhu,"
      },
      " rūpaṃ assādeti vibhāveti cāti attho. Rūpayatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpaṃ,"
      },
      " vaṇṇavikāraṃ āpajjamānaṃ hadayaṅgatabhāvaṃ pakāsetīti attho. Suṇātīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sotaṃ"
      },
      ". Sappatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddo,"
      },
      " udāhariyatīti attho. Ghāyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ghānaṃ"
      },
      ". Gandhayatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gandho"
      },
      ". Attano vatthuṃ sūcayatīti attho. Jīvitaṃ avhayatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jivhā"
      },
      ". Rasanti taṃ sattāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "raso,"
      },
      " assādentīti attho. Kucchitānaṃ sāsavadhammānaṃ āyoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyo. Āyo"
      },
      "ti uppattideso. Phusiyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "phoṭṭhabbaṃ"
      },
      ". Munātīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mano"
      },
      ". Attano lakkhaṇaṃ dhārentīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammā"
      },
      "."
    ],
    "innerText": "Tattha visesato tāva cakkhatīti cakkhu, rūpaṃ assādeti vibhāveti cāti attho. Rūpayatīti rūpaṃ, vaṇṇavikāraṃ āpajjamānaṃ hadayaṅgatabhāvaṃ pakāsetīti attho. Suṇātīti sotaṃ. Sappatīti saddo, udāhariyatīti attho. Ghāyatīti ghānaṃ. Gandhayatīti gandho. Attano vatthuṃ sūcayatīti attho. Jīvitaṃ avhayatīti jivhā. Rasanti taṃ sattāti raso, assādentīti attho. Kucchitānaṃ sāsavadhammānaṃ āyoti kāyo. Āyoti uppattideso. Phusiyatīti phoṭṭhabbaṃ. Munātīti mano. Attano lakkhaṇaṃ dhārentīti dhammā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "511"
      },
      ". Avisesato pana āyatanato, āyānaṃ tananato, āyatassa ca nayanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āyatana"
      },
      "nti veditabbaṃ. Cakkhurūpādīsu hi taṃtaṃdvārārammaṇā cittacetasikā dhammā sena sena anubhavanādinā kiccena āyatanti uṭṭhahanti ghaṭanti, vāyamantīti vuttaṃ hoti. Te ca āyabhūte dhamme etāni tanonti, vitthārentīti vuttaṃ hoti, idañca anamatagge saṃsāre pavattaṃ atīva āyataṃ saṃsāradukkhaṃ yāva na nivattati, tāva nayanteva, pavattayantīti vuttaṃ hoti. Iti ",
      " sabbepime dhammā āyatanato, āyānaṃ tananato, āyatassa ca nayanato āyatanaṃ āyatananti vuccanti."
    ],
    "innerText": "511. Avisesato pana āyatanato, āyānaṃ tananato, āyatassa ca nayanato āyatananti veditabbaṃ. Cakkhurūpādīsu hi taṃtaṃdvārārammaṇā cittacetasikā dhammā sena sena anubhavanādinā kiccena āyatanti uṭṭhahanti ghaṭanti, vāyamantīti vuttaṃ hoti. Te ca āyabhūte dhamme etāni tanonti, vitthārentīti vuttaṃ hoti, idañca anamatagge saṃsāre pavattaṃ atīva āyataṃ saṃsāradukkhaṃ yāva na nivattati, tāva nayanteva, pavattayantīti vuttaṃ hoti. Iti sabbepime dhammā āyatanato, āyānaṃ tananato, āyatassa ca nayanato āyatanaṃ āyatananti vuccanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "512"
      },
      ". Apica nivāsaṭṭhānaṭṭhena ākaraṭṭhena samosaraṇaṭṭhānaṭṭhena sañjātidesaṭṭhena kāraṇaṭṭhena ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āyatanaṃ"
      },
      " veditabbaṃ. Tathā hi loke ‘‘issarāyatanaṃ vāsudevāyatana’’ntiādīsu nivāsaṭṭhānaṃ āyatananti ",
      " vuccati. ‘‘Suvaṇṇāyatanaṃ rajatāyatana’’ntiādīsu ākaro. Sāsane pana ‘‘manoramme āyatane sevanti naṃ vihaṅgamā’’tiādīsu (a. ni. 5.38) samosaraṇaṭṭhānaṃ. ‘‘Dakkhiṇāpatho gunnaṃ āyatana’’ntiādīsu sañjātideso. ‘‘Tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane’’tiādīsu (a. ni. 3.102) kāraṇaṃ."
    ],
    "innerText": "512. Apica nivāsaṭṭhānaṭṭhena ākaraṭṭhena samosaraṇaṭṭhānaṭṭhena sañjātidesaṭṭhena kāraṇaṭṭhena ca āyatanaṃ veditabbaṃ. Tathā hi loke ‘‘issarāyatanaṃ vāsudevāyatana’’ntiādīsu nivāsaṭṭhānaṃ āyatananti vuccati. ‘‘Suvaṇṇāyatanaṃ rajatāyatana’’ntiādīsu ākaro. Sāsane pana ‘‘manoramme āyatane sevanti naṃ vihaṅgamā’’tiādīsu (a. ni. 5.38) samosaraṇaṭṭhānaṃ. ‘‘Dakkhiṇāpatho gunnaṃ āyatana’’ntiādīsu sañjātideso. ‘‘Tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane’’tiādīsu (a. ni. 3.102) kāraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Cakkhuādīsu cāpi te te cittacetasikā dhammā nivasanti tadāyattavuttitāyāti cakkhādayo ca nesaṃ nivāsaṭṭhānaṃ. Cakkhādīsu ca te ākiṇṇā tannissitattā tadārammaṇattā cāti cakkhādayo nesaṃ ākaro. Cakkhādayo ca nesaṃ samosaraṇaṭṭhānaṃ, tattha tattha vatthudvārārammaṇavasena samosaraṇato. Cakkhādayo ca nesaṃ sañjātideso, tannissayārammaṇabhāvena tattheva uppattito. Cakkhādayo ca nesaṃ kāraṇaṃ, tesaṃ abhāve abhāvatoti. Iti nivāsaṭṭhānaṭṭhena, ākaraṭṭhena, samosaraṇaṭṭhānaṭṭhena, sañjātidesaṭṭhena, kāraṇaṭṭhenacāti imehipi kāraṇehi ete dhammā āyatanaṃ āyatananti vuccanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmā yathāvuttena atthena cakkhu ca taṃ āyatanañcāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhāyatanaṃ"
      },
      "…pe… dhammā ca te āyatanañcāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammāyatana"
      },
      "nti evaṃ tāvettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthato"
      },
      " viññātabbo vinicchayo."
    ],
    "innerText": "Tasmā yathāvuttena atthena cakkhu ca taṃ āyatanañcāti cakkhāyatanaṃ…pe… dhammā ca te āyatanañcāti dhammāyatananti evaṃ tāvettha atthato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "513"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇā"
      },
      "ti cakkhādīnaṃ lakkhaṇatopettha viññātabbo vinicchayo. Tāni ca pana tesaṃ lakkhaṇāni khandhaniddese vuttanayeneva veditabbāni."
    ],
    "innerText": "513.Lakkhaṇāti cakkhādīnaṃ lakkhaṇatopettha viññātabbo vinicchayo. Tāni ca pana tesaṃ lakkhaṇāni khandhaniddese vuttanayeneva veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāvatvato"
      },
      "ti tāvabhāvato. Idaṃ vuttaṃ hoti – cakkhādayopi hi dhammā eva, evaṃ sati dhammāyatanamicceva avatvā kasmā dvādasāyatanānīti vuttānīti ce. Chaviññāṇakāyuppattidvārārammaṇavavatthānato idha channaṃ viññāṇakāyānaṃ dvārabhāvena ārammaṇabhāvena ca vavatthānato ayametesaṃ bhedo hotīti dvādasa vuttāni, cakkhuviññāṇavīthipariyāpannassa hi viññāṇakāyassa ",
      " cakkhāyatanameva uppattidvāraṃ, rūpāyatanameva cārammaṇaṃ, tathā itarāni itaresaṃ. Chaṭṭhassa pana bhavaṅgamanasaṅkhāto manāyatanekadesova uppattidvāraṃ, asādhāraṇameva ca dhammāyatanaṃ ārammaṇanti ",
      ". Iti channaṃ viññāṇakāyānaṃ uppattidvārārammaṇavavatthānato dvādasa vuttānīti evamettha tāvatvato viññātabbo vinicchayo."
    ],
    "innerText": "Tāvatvatoti tāvabhāvato. Idaṃ vuttaṃ hoti – cakkhādayopi hi dhammā eva, evaṃ sati dhammāyatanamicceva avatvā kasmā dvādasāyatanānīti vuttānīti ce. Chaviññāṇakāyuppattidvārārammaṇavavatthānato idha channaṃ viññāṇakāyānaṃ dvārabhāvena ārammaṇabhāvena ca vavatthānato ayametesaṃ bhedo hotīti dvādasa vuttāni, cakkhuviññāṇavīthipariyāpannassa hi viññāṇakāyassa cakkhāyatanameva uppattidvāraṃ, rūpāyatanameva cārammaṇaṃ, tathā itarāni itaresaṃ. Chaṭṭhassa pana bhavaṅgamanasaṅkhāto manāyatanekadesova uppattidvāraṃ, asādhāraṇameva ca dhammāyatanaṃ ārammaṇanti . Iti channaṃ viññāṇakāyānaṃ uppattidvārārammaṇavavatthānato dvādasa vuttānīti evamettha tāvatvato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "514"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kamato"
      },
      "ti idhāpi pubbe vuttesu uppattikkamādīsu desanākkamova yujjati. Ajjhattikesu hi āyatanesu sanidassanasappaṭighavisayattā cakkhāyatanaṃ pākaṭanti paṭhamaṃ desitaṃ, tato anidassanasappaṭighavisayāni sotāyatanādīni. Atha vā dassanānuttariyasavanānuttariyahetubhāvena bahūpakārattā ajjhattikesu cakkhāyatanasotāyatanāni paṭhamaṃ desitāni, tato ghānāyatanādīni tīṇi, pañcannampi gocaravisayattā ante manāyatanaṃ, cakkhāyatanādīnaṃ pana gocarattā tassa tassa antarantarāni bāhiresu rūpāyatanādīni. Apica viññāṇuppattikāraṇavavatthānatopi ayametesaṃ kamo veditabbo. Vuttañhetaṃ ‘‘cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ…pe… manañca paṭicca dhamme ca uppajjati manoviññāṇa’’nti (ma. ni. 3.421; saṃ. ni. 2.43). Evaṃ kamatopettha viññātabbo vinicchayo."
    ],
    "innerText": "514.Kamatoti idhāpi pubbe vuttesu uppattikkamādīsu desanākkamova yujjati. Ajjhattikesu hi āyatanesu sanidassanasappaṭighavisayattā cakkhāyatanaṃ pākaṭanti paṭhamaṃ desitaṃ, tato anidassanasappaṭighavisayāni sotāyatanādīni. Atha vā dassanānuttariyasavanānuttariyahetubhāvena bahūpakārattā ajjhattikesu cakkhāyatanasotāyatanāni paṭhamaṃ desitāni, tato ghānāyatanādīni tīṇi, pañcannampi gocaravisayattā ante manāyatanaṃ, cakkhāyatanādīnaṃ pana gocarattā tassa tassa antarantarāni bāhiresu rūpāyatanādīni. Apica viññāṇuppattikāraṇavavatthānatopi ayametesaṃ kamo veditabbo. Vuttañhetaṃ ‘‘cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ…pe… manañca paṭicca dhamme ca uppajjati manoviññāṇa’’nti (ma. ni. 3.421; saṃ. ni. 2.43). Evaṃ kamatopettha viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "515"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhepavitthārā"
      },
      "ti saṅkhepato hi manāyatanassa ceva dhammāyatanekadesassa ca nāmena tadavasesānañca āyatanānaṃ rūpena saṅgahitattā dvādasāpi āyatanāni nāmarūpamattameva honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitthārato"
      },
      " pana ajjhattikesu tāva cakkhāyatanaṃ jātivasena cakkhupasādamattameva, paccayagatinikāyapuggalabhedato pana anantappabhedaṃ. Tathā sotāyatanādīni cattāri. Manāyatanaṃ kusalākusalavipākakiriyaviññāṇabhedena ekūnanavutippabhedaṃ ekavīsuttarasatappabhedañca. Vatthupaṭipadādibhedato pana anantappabhedaṃ. Rūpasaddagandharasāyatanāni visabhāgapaccayādibhedato anantappabhedāni. Phoṭṭhabbāyatanaṃ pathavīdhātutejodhātuvāyodhātuvasena tippabhedaṃ. Paccayādibhedato anekappabhedaṃ. Dhammāyatanaṃ vedanāsaññāsaṅkhārakkhandhasukhumarūpanibbānānaṃ sabhāvanānattabhedato anekappabhedanti. Evaṃ saṅkhepavitthārā viññātabbo vinicchayo."
    ],
    "innerText": "515.Saṅkhepavitthārāti saṅkhepato hi manāyatanassa ceva dhammāyatanekadesassa ca nāmena tadavasesānañca āyatanānaṃ rūpena saṅgahitattā dvādasāpi āyatanāni nāmarūpamattameva honti. Vitthārato pana ajjhattikesu tāva cakkhāyatanaṃ jātivasena cakkhupasādamattameva, paccayagatinikāyapuggalabhedato pana anantappabhedaṃ. Tathā sotāyatanādīni cattāri. Manāyatanaṃ kusalākusalavipākakiriyaviññāṇabhedena ekūnanavutippabhedaṃ ekavīsuttarasatappabhedañca. Vatthupaṭipadādibhedato pana anantappabhedaṃ. Rūpasaddagandharasāyatanāni visabhāgapaccayādibhedato anantappabhedāni. Phoṭṭhabbāyatanaṃ pathavīdhātutejodhātuvāyodhātuvasena tippabhedaṃ. Paccayādibhedato anekappabhedaṃ. Dhammāyatanaṃ vedanāsaññāsaṅkhārakkhandhasukhumarūpanibbānānaṃ sabhāvanānattabhedato anekappabhedanti. Evaṃ saṅkhepavitthārā viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "516"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Daṭṭhabbato"
      },
      "ti ettha pana sabbāneva saṅkhatāni āyatanāni anāgamanato aniggamanato ca daṭṭhabbāni. Na hi tāni pubbe udayā kutoci āgacchanti, napi uddhaṃ vayā ",
      " kuhiñci gacchanti, atha kho pubbe udayā appaṭiladdhasabhāvāni ",
      ", uddhaṃ vayā paribhinnasabhāvāni, pubbantāparantavemajjhe paccayāyattavuttitāya avasāni pavattanti. Tasmā anāgamanato aniggamanato ca daṭṭhabbāni. Tathā nirīhakato abyāpārato ca. Na hi cakkhurūpādīnaṃ evaṃ hoti ‘‘aho vata amhākaṃ sāmaggiyaṃ viññāṇaṃ nāma uppajjeyyā’’ti, na ca tāni viññāṇuppādanatthaṃ dvārabhāvena vatthubhāvena ārammaṇabhāvena vā īhanti, na byāpāramāpajjanti, atha kho dhammatāvesā, yaṃ cakkhurūpādisāmaggiyaṃ cakkhuviññāṇādīni sambhavantīti. Tasmā nirīhakato abyāpārato ca daṭṭhabbāni. Apica ajjhattikāni suññagāmo viya daṭṭhabbāni, dhuvasubhasukhattabhāvavirahitattā. Bāhirāni gāmaghātakacorā viya, ajjhattikānaṃ abhighātakattā. Vuttañhetaṃ ‘‘cakkhu, bhikkhave, haññati manāpāmanāpehi rūpehī’’ti vitthāro. Apica ajjhattikāni cha pāṇakā viya daṭṭhabbāni, bāhirāni tesaṃ gocarā viyāti. Evamettha daṭṭhabbato viññātabbo vinicchayo."
    ],
    "innerText": "516.Daṭṭhabbatoti ettha pana sabbāneva saṅkhatāni āyatanāni anāgamanato aniggamanato ca daṭṭhabbāni. Na hi tāni pubbe udayā kutoci āgacchanti, napi uddhaṃ vayā kuhiñci gacchanti, atha kho pubbe udayā appaṭiladdhasabhāvāni , uddhaṃ vayā paribhinnasabhāvāni, pubbantāparantavemajjhe paccayāyattavuttitāya avasāni pavattanti. Tasmā anāgamanato aniggamanato ca daṭṭhabbāni. Tathā nirīhakato abyāpārato ca. Na hi cakkhurūpādīnaṃ evaṃ hoti ‘‘aho vata amhākaṃ sāmaggiyaṃ viññāṇaṃ nāma uppajjeyyā’’ti, na ca tāni viññāṇuppādanatthaṃ dvārabhāvena vatthubhāvena ārammaṇabhāvena vā īhanti, na byāpāramāpajjanti, atha kho dhammatāvesā, yaṃ cakkhurūpādisāmaggiyaṃ cakkhuviññāṇādīni sambhavantīti. Tasmā nirīhakato abyāpārato ca daṭṭhabbāni. Apica ajjhattikāni suññagāmo viya daṭṭhabbāni, dhuvasubhasukhattabhāvavirahitattā. Bāhirāni gāmaghātakacorā viya, ajjhattikānaṃ abhighātakattā. Vuttañhetaṃ ‘‘cakkhu, bhikkhave, haññati manāpāmanāpehi rūpehī’’ti vitthāro. Apica ajjhattikāni cha pāṇakā viya daṭṭhabbāni, bāhirāni tesaṃ gocarā viyāti. Evamettha daṭṭhabbato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Idaṃ tāva āyatanānaṃ vitthārakathāmukhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dhātuvitthārakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "517"
      },
      ". Tadanantarā pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhātuyo"
      },
      "ti aṭṭhārasa dhātuyo – cakkhudhātu, rūpadhātu, cakkhuviññāṇadhātu, sotadhātu, saddadhātu, sotaviññāṇadhātu, ghānadhātu, gandhadhātu, ghānaviññāṇadhātu, jivhādhātu, rasadhātu, jivhāviññāṇadhātu, kāyadhātu, phoṭṭhabbadhātu, kāyaviññāṇadhātu, manodhātu, dhammadhātu, manoviññāṇadhātūti. Tattha –"
    ],
    "innerText": "517. Tadanantarā pana dhātuyoti aṭṭhārasa dhātuyo – cakkhudhātu, rūpadhātu, cakkhuviññāṇadhātu, sotadhātu, saddadhātu, sotaviññāṇadhātu, ghānadhātu, gandhadhātu, ghānaviññāṇadhātu, jivhādhātu, rasadhātu, jivhāviññāṇadhātu, kāyadhātu, phoṭṭhabbadhātu, kāyaviññāṇadhātu, manodhātu, dhammadhātu, manoviññāṇadhātūti. Tattha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Atthato lakkhaṇādīhi, kama tāvatvasaṅkhato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paccayā atha daṭṭhabbā, veditabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthato"
      },
      "ti cakkhatīti cakkhu. Rūpayatīti rūpaṃ. Cakkhussa viññāṇaṃ cakkhuviññāṇanti evamādinā tāva nayena cakkhādīnaṃ visesatthato veditabbo vinicchayo. Avisesena pana vidahati, dhīyate, vidhānaṃ, vidhīyate etāya, ettha vā dhīyatīti dhātu. Lokiyā hi dhātuyo kāraṇabhāvena vavatthitā hutvā suvaṇṇarajatādidhātuyo viya suvaṇṇarajatādiṃ ",
      ", anekappakāraṃ saṃsāradukkhaṃ vidahanti. Bhārahārehi ca bhāro viya, sattehi ",
      " dhīyante, dhāriyantīti attho. Dukkhavidhānamattameva cesā, avasavattanato. Etāhi ca karaṇabhūtāhi saṃsāradukkhaṃ sattehi anuvidhīyati. Tathāvihitañca taṃ etāsveva dhīyati, ṭhapiyatīti attho. Iti cakkhādīsu ekeko dhammo yathāsambhavaṃ vidahati, dhīyatītiādinā atthavasena dhātūti vuccati."
    ],
    "innerText": "Tattha atthatoti cakkhatīti cakkhu. Rūpayatīti rūpaṃ. Cakkhussa viññāṇaṃ cakkhuviññāṇanti evamādinā tāva nayena cakkhādīnaṃ visesatthato veditabbo vinicchayo. Avisesena pana vidahati, dhīyate, vidhānaṃ, vidhīyate etāya, ettha vā dhīyatīti dhātu. Lokiyā hi dhātuyo kāraṇabhāvena vavatthitā hutvā suvaṇṇarajatādidhātuyo viya suvaṇṇarajatādiṃ , anekappakāraṃ saṃsāradukkhaṃ vidahanti. Bhārahārehi ca bhāro viya, sattehi dhīyante, dhāriyantīti attho. Dukkhavidhānamattameva cesā, avasavattanato. Etāhi ca karaṇabhūtāhi saṃsāradukkhaṃ sattehi anuvidhīyati. Tathāvihitañca taṃ etāsveva dhīyati, ṭhapiyatīti attho. Iti cakkhādīsu ekeko dhammo yathāsambhavaṃ vidahati, dhīyatītiādinā atthavasena dhātūti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "518"
      },
      ". Apica yathā titthiyānaṃ attā nāma sabhāvato natthi, na evametā, etā pana attano sabhāvaṃ dhārentīti dhātuyo. Yathā loke vicittā haritālamanosilādayo selāvayavā dhātuyoti vuccanti, evametāpi dhātuyo viya dhātuyo. Vicittā hete ñāṇañeyyāvayavāti. Yathā vā sarīrasaṅkhātassa samudāyassa avayavabhūtesu rasasoṇitādīsu aññamaññavisabhāgalakkhaṇaparicchinnesu dhātusamaññā, evametesupi pañcakkhandhasaṅkhātassa attabhāvassa avayavesu dhātusamaññā veditabbā. Aññamaññavisabhāgalakkhaṇaparicchinnā hete cakkhādayoti. Apica dhātūti nijjīvamattassevetaṃ adhivacanaṃ. Tathā hi bhagavā ‘‘cha dhāturo ayaṃ bhikkhu puriso’’tiādīsu (ma. ni. 3.344) jīvasaññāsamūhananatthaṃ dhātudesanaṃ akāsīti."
    ],
    "innerText": "518. Apica yathā titthiyānaṃ attā nāma sabhāvato natthi, na evametā, etā pana attano sabhāvaṃ dhārentīti dhātuyo. Yathā loke vicittā haritālamanosilādayo selāvayavā dhātuyoti vuccanti, evametāpi dhātuyo viya dhātuyo. Vicittā hete ñāṇañeyyāvayavāti. Yathā vā sarīrasaṅkhātassa samudāyassa avayavabhūtesu rasasoṇitādīsu aññamaññavisabhāgalakkhaṇaparicchinnesu dhātusamaññā, evametesupi pañcakkhandhasaṅkhātassa attabhāvassa avayavesu dhātusamaññā veditabbā. Aññamaññavisabhāgalakkhaṇaparicchinnā hete cakkhādayoti. Apica dhātūti nijjīvamattassevetaṃ adhivacanaṃ. Tathā hi bhagavā ‘‘cha dhāturo ayaṃ bhikkhu puriso’’tiādīsu (ma. ni. 3.344) jīvasaññāsamūhananatthaṃ dhātudesanaṃ akāsīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmā yathāvuttena atthena cakkhu ca taṃ dhātu ca cakkhudhātu…pe… manoviññāṇañca taṃ dhātu ca manoviññāṇadhātūti. Evaṃ tāvettha atthato veditabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "519"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇādito"
      },
      "ti cakkhādīnaṃ lakkhaṇāditopettha veditabbo vinicchayo. Tāni ca pana nesaṃ lakkhaṇādīni khandhaniddese vuttanayeneva veditabbāni."
    ],
    "innerText": "519.Lakkhaṇāditoti cakkhādīnaṃ lakkhaṇāditopettha veditabbo vinicchayo. Tāni ca pana nesaṃ lakkhaṇādīni khandhaniddese vuttanayeneva veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kamato"
      },
      "ti idhāpi pubbe vuttesu uppattikkamādīsu desanākkamova yujjati. So ca panāyaṃ hetuphalānupubbavavatthānavasena vutto. Cakkhudhātu rūpadhātūti idañhi dvayaṃ hetu, cakkhuviññāṇadhātūti phalaṃ. Evaṃ sabbattha."
    ],
    "innerText": "Kamatoti idhāpi pubbe vuttesu uppattikkamādīsu desanākkamova yujjati. So ca panāyaṃ hetuphalānupubbavavatthānavasena vutto. Cakkhudhātu rūpadhātūti idañhi dvayaṃ hetu, cakkhuviññāṇadhātūti phalaṃ. Evaṃ sabbattha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "520"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāvatvato"
      },
      "ti ",
      " tāvabhāvato. Idaṃ vuttaṃ hoti – tesu tesu hi suttābhidhammappadesesu ‘‘ābhādhātu, subhadhātu, ākāsānañcāyatanadhātu, viññāṇañcāyatanadhātu, ākiñcaññāyatanadhātu, nevasaññānāsaññāyatanadhātu, saññāvedayitanirodhadhātu’’ (saṃ. ni. 2.95), ‘‘kāmadhātu ",
      ", byāpādadhātu, vihiṃsādhātu, nekkhammadhātu, abyāpādadhātu, avihiṃsādhātu’’ (vibha. 182; dī. ni. 3.305; ma. ni. 3.125), ‘‘sukhadhātu, dukkhadhātu, somanassadhātu, domanassadhātu, upekkhādhātu, avijjādhātu’’ (vibha. 180; ma. ni. 3.125), ‘‘ārambhadhātu, nikkamadhātu, parakkamadhātu’’ (saṃ. ni. 5.183), ‘‘hīnadhātu, majjhimadhātu, paṇītadhātu’’ (dī. ni. 3.305), ‘‘pathavīdhātu, āpodhātu, tejodhātu, vāyodhātu (dī. ni. 3.311), ākāsadhātu, viññāṇadhātu’’ (ma. ni. 3.125; vibha. 172), ‘‘saṅkhatadhātu, asaṅkhatadhātu’’ (ma. ni. 3.125), ‘‘anekadhātu nānādhātu loko’’ti (dī. ni. 2.366; ma. ni. 1.148) evamādayo aññāpi dhātuyo dissanti. Evaṃ sati sabbāsaṃ vasena paricchedaṃ akatvā kasmā aṭṭhārasāti ayameva paricchedo katoti ce. Sabhāvato vijjamānānaṃ sabbadhātūnaṃ tadantogadhattā."
    ],
    "innerText": "520.Tāvatvatoti tāvabhāvato. Idaṃ vuttaṃ hoti – tesu tesu hi suttābhidhammappadesesu ‘‘ābhādhātu, subhadhātu, ākāsānañcāyatanadhātu, viññāṇañcāyatanadhātu, ākiñcaññāyatanadhātu, nevasaññānāsaññāyatanadhātu, saññāvedayitanirodhadhātu’’ (saṃ. ni. 2.95), ‘‘kāmadhātu , byāpādadhātu, vihiṃsādhātu, nekkhammadhātu, abyāpādadhātu, avihiṃsādhātu’’ (vibha. 182; dī. ni. 3.305; ma. ni. 3.125), ‘‘sukhadhātu, dukkhadhātu, somanassadhātu, domanassadhātu, upekkhādhātu, avijjādhātu’’ (vibha. 180; ma. ni. 3.125), ‘‘ārambhadhātu, nikkamadhātu, parakkamadhātu’’ (saṃ. ni. 5.183), ‘‘hīnadhātu, majjhimadhātu, paṇītadhātu’’ (dī. ni. 3.305), ‘‘pathavīdhātu, āpodhātu, tejodhātu, vāyodhātu (dī. ni. 3.311), ākāsadhātu, viññāṇadhātu’’ (ma. ni. 3.125; vibha. 172), ‘‘saṅkhatadhātu, asaṅkhatadhātu’’ (ma. ni. 3.125), ‘‘anekadhātu nānādhātu loko’’ti (dī. ni. 2.366; ma. ni. 1.148) evamādayo aññāpi dhātuyo dissanti. Evaṃ sati sabbāsaṃ vasena paricchedaṃ akatvā kasmā aṭṭhārasāti ayameva paricchedo katoti ce. Sabhāvato vijjamānānaṃ sabbadhātūnaṃ tadantogadhattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Rūpadhātuyeva hi ābhādhātu, subhadhātu pana rūpādipaṭibaddhā. Kasmā, subhanimittattā. Subhanimittañhi subhadhātu. Tañca rūpādivinimuttaṃ na vijjati. Kusalavipākārammaṇā vā rūpādayo eva subhadhātūti rūpādimattamevesā. Ākāsānañcāyatanadhātuādīsu cittaṃ manoviññāṇadhātuyeva, sesā dhammadhātu. Saññāvedayitanirodhadhātu pana sabhāvato natthi. Dhātudvayanirodhamattameva hi sā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kāmadhātu dhammadhātumattaṃ vā hoti. Yathāha – ‘‘tattha katamā kāmadhātu? Kāmapaṭisaṃyutto takko vitakko micchāsaṅkappo’’ti (vibha. 182). Aṭṭhārasāpi vā dhātuyo. Yathāha – ‘‘heṭṭhato avīcinirayaṃ pariyantaṃ karitvā uparito paranimmitavasavattī deve antokaritvā yaṃ etasmiṃ antare etthāvacarā ettha pariyāpannā khandhadhātuāyatanā rūpā vedanā saññā saṅkhārā viññāṇaṃ, ayaṃ vuccati kāmadhātū’’ti (vibha. 182)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nekkhammadhātu ",
      " dhammadhātu eva, ‘‘sabbepi kusalā dhammā nekkhammadhātū’’ti (vibha. 182) vacanato manoviññāṇadhātupi hotiyeva. Byāpādavihiṃsā-abyāpāda-avihiṃsāsukha-dukkha-somanassa-domanassupekkhā-avijjāārambha-nikkama-parakkamadhātuyo dhammadhātuyeva."
    ],
    "innerText": "Nekkhammadhātu dhammadhātu eva, ‘‘sabbepi kusalā dhammā nekkhammadhātū’’ti (vibha. 182) vacanato manoviññāṇadhātupi hotiyeva. Byāpādavihiṃsā-abyāpāda-avihiṃsāsukha-dukkha-somanassa-domanassupekkhā-avijjāārambha-nikkama-parakkamadhātuyo dhammadhātuyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hīnamajjhimapaṇītadhātuyo aṭṭhārasa dhātumattameva. Hīnā hi cakkhādayo hīnā dhātu, majjhimapaṇītā ",
      " majjhimā ceva paṇītā ca. Nippariyāyena pana akusalā dhammadhātumanoviññāṇadhātuyo hīnadhātu, lokiyā kusalābyākatā ubhopi cakkhudhātuādayo ca majjhimadhātu, lokuttarā pana dhammadhātumanoviññāṇadhātuyo paṇītadhātu."
    ],
    "innerText": "Hīnamajjhimapaṇītadhātuyo aṭṭhārasa dhātumattameva. Hīnā hi cakkhādayo hīnā dhātu, majjhimapaṇītā majjhimā ceva paṇītā ca. Nippariyāyena pana akusalā dhammadhātumanoviññāṇadhātuyo hīnadhātu, lokiyā kusalābyākatā ubhopi cakkhudhātuādayo ca majjhimadhātu, lokuttarā pana dhammadhātumanoviññāṇadhātuyo paṇītadhātu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pathavītejovāyodhātuyo phoṭṭhabbadhātuyeva, āpodhātu ākāsadhātu ca dhammadhātuyeva. Viññāṇadhātu cakkhuviññāṇādisattaviññāṇadhātusaṅkhepoyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sattarasa dhātuyo dhammadhātuekadeso ca saṅkhatadhātu, asaṅkhatā pana dhātu dhammadhātuekadesova. Anekadhātunānādhātuloko pana aṭṭhārasa dhātuppabhedamattamevāti. Iti sabhāvato vijjamānānaṃ sabbadhātūnaṃ tadantogadhattā aṭṭhāraseva vuttāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "521"
      },
      ". Apica vijānanasabhāve viññāṇe jīvasaññīnaṃ saññāsamūhananatthampi aṭṭhāraseva vuttā. Santi hi sattā vijānanasabhāve viññāṇe jīvasaññino, tesaṃ cakkhusotaghānajivhākāyamanodhātumanoviññāṇadhātubhedena tassa anekataṃ cakkhurūpādipaccayāyattavuttitāya aniccatañca pakāsetvā dīgharattānusayitaṃ jīvasaññaṃ samūhanitukāmena bhagavatā aṭṭhārasa dhātuyo pakāsitā. Kiñca bhiyyo tathā veneyyajjhāsayavasena ca. Ye ca imāya anatisaṅkhepavitthārāya desanāya veneyyasattā, tadajjhāsayavasena ca aṭṭhāraseva pakāsitā."
    ],
    "innerText": "521. Apica vijānanasabhāve viññāṇe jīvasaññīnaṃ saññāsamūhananatthampi aṭṭhāraseva vuttā. Santi hi sattā vijānanasabhāve viññāṇe jīvasaññino, tesaṃ cakkhusotaghānajivhākāyamanodhātumanoviññāṇadhātubhedena tassa anekataṃ cakkhurūpādipaccayāyattavuttitāya aniccatañca pakāsetvā dīgharattānusayitaṃ jīvasaññaṃ samūhanitukāmena bhagavatā aṭṭhārasa dhātuyo pakāsitā. Kiñca bhiyyo tathā veneyyajjhāsayavasena ca. Ye ca imāya anatisaṅkhepavitthārāya desanāya veneyyasattā, tadajjhāsayavasena ca aṭṭhāraseva pakāsitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Saṅkhepavitthāranayena tathā tathā hi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dhammaṃ pakāsayati esa yathā yathāssa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Saddhammatejavihataṃ vilayaṃ khaṇena,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Veneyyasattahadayesu tamo payātīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Evamettha tāvatvato veditabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "522"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhato"
      },
      "ti ",
      " cakkhudhātu tāva jātito eko dhammotveva saṅkhaṃ gacchati cakkhupasādavasena, tathā sotaghānajivhākāyarūpasaddagandharasadhātuyo sotappasādādivasena, phoṭṭhabbadhātu pana pathavītejovāyovasena tayo dhammāti saṅkhaṃ gacchati. Cakkhuviññāṇadhātu kusalākusalavipākavasena ",
      " dve dhammāti saṅkhaṃ gacchati, tathā sotaghānajivhākāyaviññāṇadhātuyo. Manodhātu pana pañcadvārāvajjanakusalākusalavipākasampaṭicchanavasena tayo dhammāti saṅkhaṃ gacchati. Dhammadhātu tiṇṇaṃ arūpakkhandhānaṃ soḷasannaṃ sukhumarūpānaṃ asaṅkhatāya ca dhātuyā vasena vīsati dhammāti saṅkhaṃ gacchati. Manoviññāṇadhātu sesakusalākusalābyākataviññāṇavasena chasattati dhammāti saṅkhaṃ gacchati. Evamettha saṅkhatopi veditabbo vinicchayo."
    ],
    "innerText": "522.Saṅkhatoti cakkhudhātu tāva jātito eko dhammotveva saṅkhaṃ gacchati cakkhupasādavasena, tathā sotaghānajivhākāyarūpasaddagandharasadhātuyo sotappasādādivasena, phoṭṭhabbadhātu pana pathavītejovāyovasena tayo dhammāti saṅkhaṃ gacchati. Cakkhuviññāṇadhātu kusalākusalavipākavasena dve dhammāti saṅkhaṃ gacchati, tathā sotaghānajivhākāyaviññāṇadhātuyo. Manodhātu pana pañcadvārāvajjanakusalākusalavipākasampaṭicchanavasena tayo dhammāti saṅkhaṃ gacchati. Dhammadhātu tiṇṇaṃ arūpakkhandhānaṃ soḷasannaṃ sukhumarūpānaṃ asaṅkhatāya ca dhātuyā vasena vīsati dhammāti saṅkhaṃ gacchati. Manoviññāṇadhātu sesakusalākusalābyākataviññāṇavasena chasattati dhammāti saṅkhaṃ gacchati. Evamettha saṅkhatopi veditabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "523"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccayā"
      },
      "ti ettha ca cakkhudhātu tāva cakkhuviññāṇadhātuyā vippayuttapurejātaatthiavigatanissayindriyapaccayānaṃ vasena chahi paccayehi paccayo hoti, rūpadhātu purejātaatthiavigatārammaṇapaccayānaṃ vasena catūhi paccayehi paccayo hoti. Evaṃ sotaviññāṇadhātuādīnaṃ sotadhātusaddadhātuādayo. Pañcannaṃ pana nesaṃ āvajjanamanodhātu anantarasamanantaranatthivigatānantarūpanissayavasena pañcahi paccayehi paccayo hoti, tā ca pañcapi sampaṭicchanamanodhātuyā. Tathā sampaṭicchanamanodhātu santīraṇamanoviññāṇadhātuyā, sā ca voṭṭhabbanamanoviññāṇadhātuyā, voṭṭhabbanamanoviññāṇadhātu ca javanamanoviññāṇadhātuyā. Javanamanoviññāṇadhātu pana anantarāya javanamanoviññāṇadhātuyā tehi ceva pañcahi āsevanapaccayena cāti chahi paccayehi paccayo hoti. Esa tāva pañcadvāre nayo."
    ],
    "innerText": "523.Paccayāti ettha ca cakkhudhātu tāva cakkhuviññāṇadhātuyā vippayuttapurejātaatthiavigatanissayindriyapaccayānaṃ vasena chahi paccayehi paccayo hoti, rūpadhātu purejātaatthiavigatārammaṇapaccayānaṃ vasena catūhi paccayehi paccayo hoti. Evaṃ sotaviññāṇadhātuādīnaṃ sotadhātusaddadhātuādayo. Pañcannaṃ pana nesaṃ āvajjanamanodhātu anantarasamanantaranatthivigatānantarūpanissayavasena pañcahi paccayehi paccayo hoti, tā ca pañcapi sampaṭicchanamanodhātuyā. Tathā sampaṭicchanamanodhātu santīraṇamanoviññāṇadhātuyā, sā ca voṭṭhabbanamanoviññāṇadhātuyā, voṭṭhabbanamanoviññāṇadhātu ca javanamanoviññāṇadhātuyā. Javanamanoviññāṇadhātu pana anantarāya javanamanoviññāṇadhātuyā tehi ceva pañcahi āsevanapaccayena cāti chahi paccayehi paccayo hoti. Esa tāva pañcadvāre nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Manodvāre pana bhavaṅgamanoviññāṇadhātu āvajjanamanoviññāṇadhātuyā. Āvajjanamanoviññāṇadhātu ca javanamanoviññāṇadhātuyā purimehi pañcahi paccayehi paccayo hoti. Dhammadhātu pana sattannampi viññāṇadhātūnaṃ sahajātaaññamaññanissayasampayuttaatthiavigatādīhi bahudhā paccayo hoti. Cakkhudhātuādayo pana ekaccā ca dhammadhātu ekaccāya manoviññāṇadhātuyā ārammaṇapaccayādīhipi paccayā honti. Cakkhuviññāṇadhātuādīnañca na kevalaṃ cakkhurūpādayo paccayā honti, atha kho ālokādayopi. Tenāhu pubbācariyā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Cakkhurūpālokamanasikāre ",
      " paṭicca uppajjati cakkhuviññāṇaṃ. Sotasaddavivaramanasikāre paṭicca uppajjati sotaviññāṇaṃ. Ghānagandhavāyumanasikāre paṭicca uppajjati ghānaviññāṇaṃ. Jivhārasaāpamanasikāre paṭicca uppajjati jivhāviññāṇaṃ. Kāyaphoṭṭhabbapathavīmanasikāre paṭicca uppajjati kāyaviññāṇaṃ. Bhavaṅgamanadhammamanasikāre paṭicca uppajjati manoviññāṇa’’nti."
    ],
    "innerText": "‘‘Cakkhurūpālokamanasikāre paṭicca uppajjati cakkhuviññāṇaṃ. Sotasaddavivaramanasikāre paṭicca uppajjati sotaviññāṇaṃ. Ghānagandhavāyumanasikāre paṭicca uppajjati ghānaviññāṇaṃ. Jivhārasaāpamanasikāre paṭicca uppajjati jivhāviññāṇaṃ. Kāyaphoṭṭhabbapathavīmanasikāre paṭicca uppajjati kāyaviññāṇaṃ. Bhavaṅgamanadhammamanasikāre paṭicca uppajjati manoviññāṇa’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayamettha ",
      " saṅkhepo. Vitthārato pana paccayappabhedo paṭiccasamuppādaniddese āvibhavissatīti evamettha paccayatopi veditabbo vinicchayo."
    ],
    "innerText": "Ayamettha saṅkhepo. Vitthārato pana paccayappabhedo paṭiccasamuppādaniddese āvibhavissatīti evamettha paccayatopi veditabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "524"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Daṭṭhabbato"
      },
      "ti daṭṭhabbatopettha vinicchayo veditabboti attho. Sabbā eva hi saṅkhatadhātuyo pubbantāparantavivittato dhuvasubhasukhattabhāvasuññato paccayāyattavuttito ca daṭṭhabbā."
    ],
    "innerText": "524.Daṭṭhabbatoti daṭṭhabbatopettha vinicchayo veditabboti attho. Sabbā eva hi saṅkhatadhātuyo pubbantāparantavivittato dhuvasubhasukhattabhāvasuññato paccayāyattavuttito ca daṭṭhabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Visesato panettha bheritalaṃ viya cakkhudhātu daṭṭhabbā, daṇḍo viya rūpadhātu, saddo viya cakkhuviññāṇadhātu. Tathā ādāsatalaṃ viya cakkhudhātu, mukhaṃ viya rūpadhātu, mukhanimittaṃ viya cakkhuviññāṇadhātu. Atha vā ucchutilā viya cakkhudhātu, yantacakkayaṭṭhi viya rūpadhātu, ucchurasatelāni viya cakkhuviññāṇadhātu. Tathā adharāraṇī viya cakkhudhātu, uttarāraṇī viya rūpadhātu, aggi viya cakkhuviññāṇadhātu. Esa nayo sotadhātuādīsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Manodhātu pana yathāsambhavato cakkhuviññāṇadhātuādīnaṃ purecarānucarā viya daṭṭhabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dhammadhātuyā vedanākkhandho sallamiva sūlamiva ca daṭṭhabbo. Saññāsaṅkhārakkhandhā vedanāsallasūlayogāāturā viya, puthujjanānaṃ vā saññā āsādukkhajananato rittamuṭṭhi viya. Ayathābhuccanimittagāhakato vanamigo viya. Saṅkhārā paṭisandhiyaṃ pakkhipanato aṅgārakāsuyaṃ khipanakapurisā viya. Jāti dukkhānubandhato rājapurisānubandhacorā viya. Sabbānatthāvahassa khandhasantānassa hetuto visarukkhabījāni viya. Rūpaṃ nānāvidhupaddavanimittato khuracakkaṃ viya daṭṭhabbaṃ. Asaṅkhatā pana dhātu amatato santato khemato ca daṭṭhabbā. Kasmā? Sabbānatthāvahassa paṭipakkhabhūtattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Manoviññāṇadhātu ",
      " ārammaṇesu vavatthānābhāvato araññamakkaṭo viya, duddamanato assakhaḷuṅko viya, yatthakāmanipātito vehāsakkhittadaṇḍo viya, lobhadosādinānappakārakilesavesayogato raṅganaṭo viya daṭṭhabbāti."
    ],
    "innerText": "Manoviññāṇadhātu ārammaṇesu vavatthānābhāvato araññamakkaṭo viya, duddamanato assakhaḷuṅko viya, yatthakāmanipātito vehāsakkhittadaṇḍo viya, lobhadosādinānappakārakilesavesayogato raṅganaṭo viya daṭṭhabbāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti sādhujanapāmojjatthāya kate visuddhimagge"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paññābhāvanādhikāre"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Āyatanadhātuniddeso nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pannarasamo paricchedo."
  }
]