[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammāsambuddhassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "book"
    },
    "innerText": "Visuddhimaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(Dutiyo bhāgo)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "12. Iddhividhaniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Abhiññākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "365"
      },
      ". Idāni ",
      " yāsaṃ lokikābhiññānaṃ vasena ayaṃ samādhibhāvanā abhiññānisaṃsāti vuttā, tā abhiññā sampādetuṃ yasmā pathavīkasiṇādīsu adhigatacatutthajjhānena yoginā yogo kātabbo. Evañhissa sā samādhibhāvanā adhigatānisaṃsā ceva bhavissati thiratarā ca, so adhigatānisaṃsāya thiratarāya samādhibhāvanāya samannāgato sukheneva paññābhāvanaṃ sampādessati. Tasmā abhiññākathaṃ tāva ārabhissāma."
    ],
    "innerText": "365. Idāni yāsaṃ lokikābhiññānaṃ vasena ayaṃ samādhibhāvanā abhiññānisaṃsāti vuttā, tā abhiññā sampādetuṃ yasmā pathavīkasiṇādīsu adhigatacatutthajjhānena yoginā yogo kātabbo. Evañhissa sā samādhibhāvanā adhigatānisaṃsā ceva bhavissati thiratarā ca, so adhigatānisaṃsāya thiratarāya samādhibhāvanāya samannāgato sukheneva paññābhāvanaṃ sampādessati. Tasmā abhiññākathaṃ tāva ārabhissāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhagavatā hi adhigatacatutthajjhānasamādhīnaṃ kulaputtānaṃ samādhibhāvanānisaṃsadassanatthañceva uttaruttari paṇītapaṇītadhammadesanatthañca ",
      " ‘‘so evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte iddhividhāya cittaṃ abhinīharati abhininnāmeti. So anekavihitaṃ iddhividhaṃ paccanubhoti ekopi hutvā bahudhā hotī’’tiādinā (dī. ni. 1.238) nayena iddhividhaṃ, dibbasotadhātuñāṇaṃ, cetopariyañāṇaṃ, pubbenivāsānussatiñāṇaṃ, sattānaṃ cutūpapāte ñāṇanti pañca lokikābhiññā vuttā."
    ],
    "innerText": "Bhagavatā hi adhigatacatutthajjhānasamādhīnaṃ kulaputtānaṃ samādhibhāvanānisaṃsadassanatthañceva uttaruttari paṇītapaṇītadhammadesanatthañca ‘‘so evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte iddhividhāya cittaṃ abhinīharati abhininnāmeti. So anekavihitaṃ iddhividhaṃ paccanubhoti ekopi hutvā bahudhā hotī’’tiādinā (dī. ni. 1.238) nayena iddhividhaṃ, dibbasotadhātuñāṇaṃ, cetopariyañāṇaṃ, pubbenivāsānussatiñāṇaṃ, sattānaṃ cutūpapāte ñāṇanti pañca lokikābhiññā vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " ekopi hutvā bahudhā hotītiādikaṃ iddhivikubbanaṃ kātukāmena ādikammikena yoginā odātakasiṇapariyantesu aṭṭhasu kasiṇesu aṭṭha aṭṭha samāpattiyo nibbattetvā –"
    ],
    "innerText": "Tattha ekopi hutvā bahudhā hotītiādikaṃ iddhivikubbanaṃ kātukāmena ādikammikena yoginā odātakasiṇapariyantesu aṭṭhasu kasiṇesu aṭṭha aṭṭha samāpattiyo nibbattetvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kasiṇānulomato, kasiṇapaṭilomato, kasiṇānulomapaṭilomato, jhānānulomato, jhānapaṭilomato, jhānānulomapaṭilomato, jhānukkantikato, kasiṇukkantikato, jhānakasiṇukkantikato, aṅgasaṅkantito, ārammaṇasaṅkantito, aṅgārammaṇasaṅkantito, aṅgavavatthāpanato, ārammaṇavavatthāpanatoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Imehi cuddasahi ākārehi cittaṃ paridametabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "366"
      },
      ". Katamaṃ panettha kasiṇānulomaṃ…pe… katamaṃ ārammaṇavavatthāpananti. Idha bhikkhu pathavīkasiṇe jhānaṃ samāpajjati, tato āpokasiṇeti evaṃ paṭipāṭiyā aṭṭhasu kasiṇesu satakkhattumpi sahassakkhattumpi samāpajjati, idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kasiṇānulomaṃ"
      },
      " nāma."
    ],
    "innerText": "366. Katamaṃ panettha kasiṇānulomaṃ…pe… katamaṃ ārammaṇavavatthāpananti. Idha bhikkhu pathavīkasiṇe jhānaṃ samāpajjati, tato āpokasiṇeti evaṃ paṭipāṭiyā aṭṭhasu kasiṇesu satakkhattumpi sahassakkhattumpi samāpajjati, idaṃ kasiṇānulomaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Odātakasiṇato pana paṭṭhāya tatheva paṭilomakkamena samāpajjanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kasiṇapaṭilomaṃ"
      },
      " nāma."
    ],
    "innerText": "Odātakasiṇato pana paṭṭhāya tatheva paṭilomakkamena samāpajjanaṃ kasiṇapaṭilomaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pathavīkasiṇato paṭṭhāya yāva odātakasiṇaṃ, odātakasiṇatopi paṭṭhāya yāva pathavīkasiṇanti evaṃ anulomapaṭilomavasena punappunaṃ samāpajjanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kasiṇānulomapaṭilomaṃ"
      },
      " nāma."
    ],
    "innerText": "Pathavīkasiṇato paṭṭhāya yāva odātakasiṇaṃ, odātakasiṇatopi paṭṭhāya yāva pathavīkasiṇanti evaṃ anulomapaṭilomavasena punappunaṃ samāpajjanaṃ kasiṇānulomapaṭilomaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭhamajjhānato pana paṭṭhāya paṭipāṭiyā yāva nevasaññānāsaññāyatanaṃ, tāva punappunaṃ samāpajjanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānānulomaṃ"
      },
      " nāma."
    ],
    "innerText": "Paṭhamajjhānato pana paṭṭhāya paṭipāṭiyā yāva nevasaññānāsaññāyatanaṃ, tāva punappunaṃ samāpajjanaṃ jhānānulomaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevasaññānāsaññāyatanato ",
      " paṭṭhāya yāva paṭhamajjhānaṃ, tāva punappunaṃ samāpajjanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānapaṭilomaṃ"
      },
      " nāma."
    ],
    "innerText": "Nevasaññānāsaññāyatanato paṭṭhāya yāva paṭhamajjhānaṃ, tāva punappunaṃ samāpajjanaṃ jhānapaṭilomaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭhamajjhānato paṭṭhāya yāva nevasaññānāsaññāyatanaṃ, nevasaññānāsaññāyatanato paṭṭhāya yāva paṭhamajjhānanti evaṃ anulomapaṭilomavasena punappunaṃ samāpajjanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānānulomapaṭilomaṃ"
      },
      " nāma."
    ],
    "innerText": "Paṭhamajjhānato paṭṭhāya yāva nevasaññānāsaññāyatanaṃ, nevasaññānāsaññāyatanato paṭṭhāya yāva paṭhamajjhānanti evaṃ anulomapaṭilomavasena punappunaṃ samāpajjanaṃ jhānānulomapaṭilomaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pathavīkasiṇe pana paṭhamaṃ jhānaṃ samāpajjitvā tattheva tatiyaṃ samāpajjati, tato tadeva ugghāṭetvā ākāsānañcāyatanaṃ, tato ākiñcaññāyatananti ",
      " evaṃ kasiṇaṃ anukkamitvā jhānasseva ekantarikabhāvena ukkamanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānukkantikaṃ"
      },
      " nāma. Evaṃ āpokasiṇādimūlikāpi yojanā kātabbā."
    ],
    "innerText": "Pathavīkasiṇe pana paṭhamaṃ jhānaṃ samāpajjitvā tattheva tatiyaṃ samāpajjati, tato tadeva ugghāṭetvā ākāsānañcāyatanaṃ, tato ākiñcaññāyatananti evaṃ kasiṇaṃ anukkamitvā jhānasseva ekantarikabhāvena ukkamanaṃ jhānukkantikaṃ nāma. Evaṃ āpokasiṇādimūlikāpi yojanā kātabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pathavīkasiṇe paṭhamaṃ jhānaṃ samāpajjitvā puna tadeva tejokasiṇe, tato nīlakasiṇe, tato lohitakasiṇeti iminā nayena jhānaṃ anukkamitvā kasiṇasseva ekantarikabhāvena ukkamanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kasiṇukkantikaṃ"
      },
      " nāma."
    ],
    "innerText": "Pathavīkasiṇe paṭhamaṃ jhānaṃ samāpajjitvā puna tadeva tejokasiṇe, tato nīlakasiṇe, tato lohitakasiṇeti iminā nayena jhānaṃ anukkamitvā kasiṇasseva ekantarikabhāvena ukkamanaṃ kasiṇukkantikaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pathavīkasiṇe paṭhamaṃ jhānaṃ samāpajjitvā tato tejokasiṇe tatiyaṃ, nīlakasiṇaṃ ugghāṭetvā ākāsānañcāyatanaṃ, lohitakasiṇato ākiñcaññāyatananti iminā nayena jhānassa ceva kasiṇassa ca ukkamanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānakasiṇukkantikaṃ"
      },
      " nāma."
    ],
    "innerText": "Pathavīkasiṇe paṭhamaṃ jhānaṃ samāpajjitvā tato tejokasiṇe tatiyaṃ, nīlakasiṇaṃ ugghāṭetvā ākāsānañcāyatanaṃ, lohitakasiṇato ākiñcaññāyatananti iminā nayena jhānassa ceva kasiṇassa ca ukkamanaṃ jhānakasiṇukkantikaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pathavīkasiṇe pana paṭhamaṃ jhānaṃ samāpajjitvā tattheva itaresampi samāpajjanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṅgasaṅkantikaṃ"
      },
      " nāma."
    ],
    "innerText": "Pathavīkasiṇe pana paṭhamaṃ jhānaṃ samāpajjitvā tattheva itaresampi samāpajjanaṃ aṅgasaṅkantikaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pathavīkasiṇe paṭhamaṃ jhānaṃ samāpajjitvā tadeva āpokasiṇe…pe… tadeva odātakasiṇeti evaṃ sabbakasiṇesu ekasseva jhānassa samāpajjanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇasaṅkantikaṃ"
      },
      " nāma."
    ],
    "innerText": "Pathavīkasiṇe paṭhamaṃ jhānaṃ samāpajjitvā tadeva āpokasiṇe…pe… tadeva odātakasiṇeti evaṃ sabbakasiṇesu ekasseva jhānassa samāpajjanaṃ ārammaṇasaṅkantikaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pathavīkasiṇe paṭhamaṃ jhānaṃ samāpajjitvā āpokasiṇe dutiyaṃ, tejokasiṇe tatiyaṃ, vāyokasiṇe catutthaṃ, nīlakasiṇaṃ ugghāṭetvā ākāsānañcāyatanaṃ, pītakasiṇato viññāṇañcāyatanaṃ ",
      ", lohitakasiṇato ākiñcaññāyatanaṃ, odātakasiṇato nevasaññānāsaññāyatananti evaṃ ekantarikavasena aṅgānañca ārammaṇānañca saṅkamanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṅgārammaṇasaṅkantikaṃ"
      },
      " nāma."
    ],
    "innerText": "Pathavīkasiṇe paṭhamaṃ jhānaṃ samāpajjitvā āpokasiṇe dutiyaṃ, tejokasiṇe tatiyaṃ, vāyokasiṇe catutthaṃ, nīlakasiṇaṃ ugghāṭetvā ākāsānañcāyatanaṃ, pītakasiṇato viññāṇañcāyatanaṃ , lohitakasiṇato ākiñcaññāyatanaṃ, odātakasiṇato nevasaññānāsaññāyatananti evaṃ ekantarikavasena aṅgānañca ārammaṇānañca saṅkamanaṃ aṅgārammaṇasaṅkantikaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭhamaṃ jhānaṃ pana pañcaṅgikanti vavatthapetvā dutiyaṃ tivaṅgikaṃ, tatiyaṃ duvaṅgikaṃ, tathā catutthaṃ ākāsānañcāyatanaṃ…pe… nevasaññānāsaññāyatananti evaṃ jhānaṅgamattasseva vavatthāpanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṅgavavatthāpanaṃ"
      },
      " nāma."
    ],
    "innerText": "Paṭhamaṃ jhānaṃ pana pañcaṅgikanti vavatthapetvā dutiyaṃ tivaṅgikaṃ, tatiyaṃ duvaṅgikaṃ, tathā catutthaṃ ākāsānañcāyatanaṃ…pe… nevasaññānāsaññāyatananti evaṃ jhānaṅgamattasseva vavatthāpanaṃ aṅgavavatthāpanaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā idaṃ pathavīkasiṇanti vavatthapetvā idaṃ āpokasiṇaṃ…pe… idaṃ odātakasiṇanti evaṃ ārammaṇamattasseva vavatthāpanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇavavatthāpanaṃ"
      },
      " nāma ",
      ". Aṅgārammaṇavavatthāpanampi eke icchanti. Aṭṭhakathāsu pana anāgatattā addhā taṃ bhāvanāmukhaṃ na hoti."
    ],
    "innerText": "Tathā idaṃ pathavīkasiṇanti vavatthapetvā idaṃ āpokasiṇaṃ…pe… idaṃ odātakasiṇanti evaṃ ārammaṇamattasseva vavatthāpanaṃ ārammaṇavavatthāpanaṃ nāma . Aṅgārammaṇavavatthāpanampi eke icchanti. Aṭṭhakathāsu pana anāgatattā addhā taṃ bhāvanāmukhaṃ na hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "367"
      },
      ". Imehi pana cuddasahi ākārehi cittaṃ aparidametvā pubbe abhāvitabhāvano ādikammiko yogāvacaro iddhivikubbanaṃ sampādessatīti netaṃ ṭhānaṃ vijjati. Ādikammikassa hi kasiṇaparikammampi bhāro, satesu sahassesu vā ekova sakkoti. Katakasiṇaparikammassa nimittuppādanaṃ bhāro, satesu sahassesu vā ekova sakkoti. Uppanne nimitte taṃ vaḍḍhetvā appanādhigamo bhāro, satesu sahassesu vā ekova sakkoti. Adhigatappanassa cuddasahākārehi cittaparidamanaṃ bhāro, satesu sahassesu vā ekova sakkoti. Cuddasahākārehi paridamitacittassāpi iddhivikubbanaṃ nāma bhāro, satesu sahassesu vā ekova sakkoti. Vikubbanappattassāpi khippanisantibhāvo nāma bhāro, satesu sahassesu vā ekova khippanisantī hoti. Therambatthale mahārohaṇaguttattherassa gilānupaṭṭhānaṃ āgatesu tiṃsamattesu iddhimantasahassesu upasampadāya aṭṭhavassiko rakkhitatthero viya. Tassānubhāvo pathavīkasiṇaniddese (visuddhi. 1.78 ādayo) vuttoyeva. Taṃ panassānubhāvaṃ disvā thero āha ‘‘āvuso, sace rakkhito nābhavissa sabbe garahappattā assāma ‘nāgarājānaṃ rakkhituṃ nāsakkhiṃsū’ti. Tasmā attanā gahetvā vicaritabbaṃ āvudhaṃ nāma malaṃ sodhetvāva gahetvā vicarituṃ vaṭṭatī’’ti. Te therassa ovāde ṭhatvā tiṃsasahassāpi bhikkhū khippanisantino ahesuṃ."
    ],
    "innerText": "367. Imehi pana cuddasahi ākārehi cittaṃ aparidametvā pubbe abhāvitabhāvano ādikammiko yogāvacaro iddhivikubbanaṃ sampādessatīti netaṃ ṭhānaṃ vijjati. Ādikammikassa hi kasiṇaparikammampi bhāro, satesu sahassesu vā ekova sakkoti. Katakasiṇaparikammassa nimittuppādanaṃ bhāro, satesu sahassesu vā ekova sakkoti. Uppanne nimitte taṃ vaḍḍhetvā appanādhigamo bhāro, satesu sahassesu vā ekova sakkoti. Adhigatappanassa cuddasahākārehi cittaparidamanaṃ bhāro, satesu sahassesu vā ekova sakkoti. Cuddasahākārehi paridamitacittassāpi iddhivikubbanaṃ nāma bhāro, satesu sahassesu vā ekova sakkoti. Vikubbanappattassāpi khippanisantibhāvo nāma bhāro, satesu sahassesu vā ekova khippanisantī hoti. Therambatthale mahārohaṇaguttattherassa gilānupaṭṭhānaṃ āgatesu tiṃsamattesu iddhimantasahassesu upasampadāya aṭṭhavassiko rakkhitatthero viya. Tassānubhāvo pathavīkasiṇaniddese (visuddhi. 1.78 ādayo) vuttoyeva. Taṃ panassānubhāvaṃ disvā thero āha ‘‘āvuso, sace rakkhito nābhavissa sabbe garahappattā assāma ‘nāgarājānaṃ rakkhituṃ nāsakkhiṃsū’ti. Tasmā attanā gahetvā vicaritabbaṃ āvudhaṃ nāma malaṃ sodhetvāva gahetvā vicarituṃ vaṭṭatī’’ti. Te therassa ovāde ṭhatvā tiṃsasahassāpi bhikkhū khippanisantino ahesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Khippanisantiyāpi ",
      " ca sati parassa patiṭṭhābhāvo bhāro, satesu sahassesu vā ekova hoti, giribhaṇḍavāhanapūjāya mārena aṅgāravasse pavattite ākāse pathaviṃ māpetvā aṅgāravassaparittārako thero viya."
    ],
    "innerText": "Khippanisantiyāpi ca sati parassa patiṭṭhābhāvo bhāro, satesu sahassesu vā ekova hoti, giribhaṇḍavāhanapūjāya mārena aṅgāravasse pavattite ākāse pathaviṃ māpetvā aṅgāravassaparittārako thero viya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Balavapubbayogānaṃ pana buddhapaccekabuddhaaggasāvakādīnaṃ vināpi iminā vuttappakārena bhāvanānukkamena arahattapaṭilābheneva idañca iddhivikubbanaṃ aññe ",
      " ca paṭisambhidādibhedā guṇā ijjhanti. Tasmā yathā piḷandhanavikatiṃ kattukāmo suvaṇṇakāro aggidhamanādīhi suvaṇṇaṃ muduṃ kammaññaṃ katvāva karoti, yathā ca bhājanavikatiṃ kattukāmo kumbhakāro mattikaṃ suparimadditaṃ muduṃ katvā karoti, evameva ādikammikena imehi cuddasahākārehi cittaṃ paridametvā chandasīsacittasīsavīriyasīsavīmaṃsāsīsasamāpajjanavasena ceva āvajjanādivasībhāvavasena ca muduṃ kammaññaṃ katvā iddhividhāya yogo karaṇīyo. Pubbahetusampannena pana kasiṇesu catutthajjhānamatte ciṇṇavasināpi kātuṃ vaṭṭati. Yathā panettha yogo kātabbo, taṃ vidhiṃ dassento bhagavā ‘‘so evaṃ samāhite citte’’tiādimāha."
    ],
    "innerText": "Balavapubbayogānaṃ pana buddhapaccekabuddhaaggasāvakādīnaṃ vināpi iminā vuttappakārena bhāvanānukkamena arahattapaṭilābheneva idañca iddhivikubbanaṃ aññe ca paṭisambhidādibhedā guṇā ijjhanti. Tasmā yathā piḷandhanavikatiṃ kattukāmo suvaṇṇakāro aggidhamanādīhi suvaṇṇaṃ muduṃ kammaññaṃ katvāva karoti, yathā ca bhājanavikatiṃ kattukāmo kumbhakāro mattikaṃ suparimadditaṃ muduṃ katvā karoti, evameva ādikammikena imehi cuddasahākārehi cittaṃ paridametvā chandasīsacittasīsavīriyasīsavīmaṃsāsīsasamāpajjanavasena ceva āvajjanādivasībhāvavasena ca muduṃ kammaññaṃ katvā iddhividhāya yogo karaṇīyo. Pubbahetusampannena pana kasiṇesu catutthajjhānamatte ciṇṇavasināpi kātuṃ vaṭṭati. Yathā panettha yogo kātabbo, taṃ vidhiṃ dassento bhagavā ‘‘so evaṃ samāhite citte’’tiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "368"
      },
      ". Tatrāyaṃ pāḷinayānusāreneva vinicchayakathā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "so"
      },
      "ti so adhigatacatutthajjhāno yogī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eva"
      },
      "nti catutthajjhānakkamanidassanametaṃ. Iminā paṭhamajjhānādhigamādinā kamena catutthajjhānaṃ paṭilabhitvāti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samāhite"
      },
      "ti iminā catutthajjhānasamādhinā samāhite. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Citte"
      },
      "ti rūpāvacaracitte. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parisuddhe"
      },
      "tiādīsu pana upekkhāsatipārisuddhibhāvena parisuddhe. Parisuddhattāyeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariyodāte,"
      },
      " pabhassareti vuttaṃ hoti. Sukhādīnaṃ paccayānaṃ ghātena vihatarāgādiaṅgaṇattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anaṅgaṇe"
      },
      ". Anaṅgaṇattāyeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vigatūpakkilese"
      },
      ". Aṅgaṇena hi taṃ cittaṃ upakkilissati. Subhāvitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mudubhūte,"
      },
      " vasībhāvappatteti vuttaṃ hoti. Vase vattamānaṃ hi cittaṃ mudunti vuccati. Muduttāyeva ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaniye,"
      },
      " kammakkhame kammayoggeti vuttaṃ hoti. Muduṃ hi cittaṃ kammaniyaṃ hoti sudantamiva suvaṇṇaṃ, tañca ubhayampi subhāvitattāyevāti. Yathāha ‘‘nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi, yaṃ evaṃ bhāvitaṃ bahulīkataṃ muduñca hoti kammaniyañca, yathayidaṃ, bhikkhave, citta’’nti (a. ni. 1.22)."
    ],
    "innerText": "368. Tatrāyaṃ pāḷinayānusāreneva vinicchayakathā. Tattha soti so adhigatacatutthajjhāno yogī. Evanti catutthajjhānakkamanidassanametaṃ. Iminā paṭhamajjhānādhigamādinā kamena catutthajjhānaṃ paṭilabhitvāti vuttaṃ hoti. Samāhiteti iminā catutthajjhānasamādhinā samāhite. Citteti rūpāvacaracitte. Parisuddhetiādīsu pana upekkhāsatipārisuddhibhāvena parisuddhe. Parisuddhattāyeva pariyodāte, pabhassareti vuttaṃ hoti. Sukhādīnaṃ paccayānaṃ ghātena vihatarāgādiaṅgaṇattā anaṅgaṇe. Anaṅgaṇattāyeva vigatūpakkilese. Aṅgaṇena hi taṃ cittaṃ upakkilissati. Subhāvitattā mudubhūte, vasībhāvappatteti vuttaṃ hoti. Vase vattamānaṃ hi cittaṃ mudunti vuccati. Muduttāyeva ca kammaniye, kammakkhame kammayoggeti vuttaṃ hoti. Muduṃ hi cittaṃ kammaniyaṃ hoti sudantamiva suvaṇṇaṃ, tañca ubhayampi subhāvitattāyevāti. Yathāha ‘‘nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi, yaṃ evaṃ bhāvitaṃ bahulīkataṃ muduñca hoti kammaniyañca, yathayidaṃ, bhikkhave, citta’’nti (a. ni. 1.22)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Etesu parisuddhabhāvādīsu ṭhitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ṭhite"
      },
      ". Ṭhitattāyeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āneñjappatte,"
      },
      " acale niriñjaneti vuttaṃ hoti. Mudukammaññabhāvena vā attano vase ṭhitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ṭhite"
      },
      ". Saddhādīhi pariggahitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āneñjappatte"
      },
      ". Saddhāpariggahitaṃ hi cittaṃ assaddhiyena na iñjati. Vīriyapariggahitaṃ kosajjena na iñjati. Satipariggahitaṃ pamādena na iñjati. Samādhipariggahitaṃ uddhaccena na iñjati ",
      ". Paññāpariggahitaṃ avijjāya na iñjati. Obhāsagataṃ kilesandhakārena na iñjati. Imehi chahi dhammehi pariggahitaṃ āneñjappattaṃ hoti. Evaṃ aṭṭhaṅgasamannāgataṃ cittaṃ abhinīhārakkhamaṃ hoti abhiññāsacchikaraṇīyānaṃ dhammānaṃ abhiññāsacchikiriyāya."
    ],
    "innerText": "Etesu parisuddhabhāvādīsu ṭhitattā ṭhite. Ṭhitattāyeva āneñjappatte, acale niriñjaneti vuttaṃ hoti. Mudukammaññabhāvena vā attano vase ṭhitattā ṭhite. Saddhādīhi pariggahitattā āneñjappatte. Saddhāpariggahitaṃ hi cittaṃ assaddhiyena na iñjati. Vīriyapariggahitaṃ kosajjena na iñjati. Satipariggahitaṃ pamādena na iñjati. Samādhipariggahitaṃ uddhaccena na iñjati . Paññāpariggahitaṃ avijjāya na iñjati. Obhāsagataṃ kilesandhakārena na iñjati. Imehi chahi dhammehi pariggahitaṃ āneñjappattaṃ hoti. Evaṃ aṭṭhaṅgasamannāgataṃ cittaṃ abhinīhārakkhamaṃ hoti abhiññāsacchikaraṇīyānaṃ dhammānaṃ abhiññāsacchikiriyāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparo nayo, catutthajjhānasamādhinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāhite"
      },
      ". Nīvaraṇadūrabhāvena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parisuddhe"
      },
      ". Vitakkādisamatikkamena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariyodāte"
      },
      ". Jhānapaṭilābhapaccayānaṃ icchāvacarānaṃ abhāvena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anaṅgaṇe"
      },
      ". Abhijjhādīnaṃ cittassa upakkilesānaṃ vigamena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vigatūpakkilese"
      },
      ". Ubhayampi cetaṃ anaṅgaṇasuttavatthasuttānusārena (ma. ni. 1.57 ādayo) veditabbaṃ. Vasippattiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mudubhūte"
      },
      ". Iddhipādabhāvūpagamena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaniye"
      },
      ". Bhāvanāpāripūriyā paṇītabhāvūpagamena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ṭhite āneñjappatte"
      },
      ". Yathā āneñjappattaṃ hoti, evaṃ ṭhiteti attho. Evampi aṭṭhaṅgasamannāgataṃ cittaṃ abhinīhārakkhamaṃ hoti abhiññāsacchikaraṇīyānaṃ dhammānaṃ abhiññāsacchikiriyāya pādakaṃ padaṭṭhānabhūtanti."
    ],
    "innerText": "Aparo nayo, catutthajjhānasamādhinā samāhite. Nīvaraṇadūrabhāvena parisuddhe. Vitakkādisamatikkamena pariyodāte. Jhānapaṭilābhapaccayānaṃ icchāvacarānaṃ abhāvena anaṅgaṇe. Abhijjhādīnaṃ cittassa upakkilesānaṃ vigamena vigatūpakkilese. Ubhayampi cetaṃ anaṅgaṇasuttavatthasuttānusārena (ma. ni. 1.57 ādayo) veditabbaṃ. Vasippattiyā mudubhūte. Iddhipādabhāvūpagamena kammaniye. Bhāvanāpāripūriyā paṇītabhāvūpagamena ṭhite āneñjappatte. Yathā āneñjappattaṃ hoti, evaṃ ṭhiteti attho. Evampi aṭṭhaṅgasamannāgataṃ cittaṃ abhinīhārakkhamaṃ hoti abhiññāsacchikaraṇīyānaṃ dhammānaṃ abhiññāsacchikiriyāya pādakaṃ padaṭṭhānabhūtanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dasaiddhikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "369"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhividhāya cittaṃ abhinīharati abhininnāmetī"
      },
      "ti ettha ijjhanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iddhi,"
      },
      " nipphattiatthena paṭilābhaṭṭhena cāti vuttaṃ hoti. Yañhi nipphajjati paṭilabbhati ca, taṃ ijjhatīti vuccati. Yathāha ‘‘kāmaṃ kāmayamānassa, tassa cetaṃ samijjhatī’’ti (su. ni. 772). Tathā ‘‘nekkhammaṃ ijjhatīti iddhi, paṭiharatīti pāṭihāriyaṃ. Arahattamaggo ijjhatīti iddhi, paṭiharatīti pāṭihāriya’’nti (paṭi. ma. 3.32)."
    ],
    "innerText": "369.Iddhividhāya cittaṃ abhinīharati abhininnāmetīti ettha ijjhanaṭṭhena iddhi, nipphattiatthena paṭilābhaṭṭhena cāti vuttaṃ hoti. Yañhi nipphajjati paṭilabbhati ca, taṃ ijjhatīti vuccati. Yathāha ‘‘kāmaṃ kāmayamānassa, tassa cetaṃ samijjhatī’’ti (su. ni. 772). Tathā ‘‘nekkhammaṃ ijjhatīti iddhi, paṭiharatīti pāṭihāriyaṃ. Arahattamaggo ijjhatīti iddhi, paṭiharatīti pāṭihāriya’’nti (paṭi. ma. 3.32)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Aparo nayo, ijjhanaṭṭhena iddhi. Upāyasampadāyetamadhivacanaṃ. Upāyasampadā hi ijjhati adhippetaphalappasavanato. Yathāha – ‘‘ayaṃ kho citto gahapati sīlavā kalyāṇadhammo, sace paṇidahissati ‘anāgatamaddhānaṃ rājā assaṃ cakkavattī’ti, tassa kho ayaṃ ijjhissati sīlavato cetopaṇidhi visuddhattā’’ti (saṃ. ni. 4.352)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparo nayo, etāya sattā ijjhantīti iddhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ijjhantī"
      },
      "ti iddhā vuddhā ukkaṃsagatā hontīti ",
      " vuttaṃ hoti. Sā dasavidhā. Yathāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kati iddhiyo"
      },
      "ti dasa iddhiyo’’. Puna caparaṃ āha ‘‘katamā dasa iddhiyo ",
      "? Adhiṭṭhānā iddhi, vikubbanā iddhi, manomayā iddhi, ñāṇavipphārā iddhi, samādhivipphārā iddhi, ariyā iddhi, kammavipākajā iddhi, puññavato iddhi, vijjāmayā iddhi, tattha tattha sammāpayogapaccayā ijjhanaṭṭhena iddhī’’ti (paṭi. ma. 3.9)."
    ],
    "innerText": "Aparo nayo, etāya sattā ijjhantīti iddhi. Ijjhantīti iddhā vuddhā ukkaṃsagatā hontīti vuttaṃ hoti. Sā dasavidhā. Yathāha ‘‘kati iddhiyoti dasa iddhiyo’’. Puna caparaṃ āha ‘‘katamā dasa iddhiyo ? Adhiṭṭhānā iddhi, vikubbanā iddhi, manomayā iddhi, ñāṇavipphārā iddhi, samādhivipphārā iddhi, ariyā iddhi, kammavipākajā iddhi, puññavato iddhi, vijjāmayā iddhi, tattha tattha sammāpayogapaccayā ijjhanaṭṭhena iddhī’’ti (paṭi. ma. 3.9)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "370"
      },
      ". Tattha ‘‘pakatiyā eko bahukaṃ āvajjati. Sataṃ vā sahassaṃ vā satasahassaṃ vā āvajjitvā ñāṇena adhiṭṭhāti ‘bahuko homī’’’ti (paṭi. ma. 3.10) evaṃ vibhajitvā dassitā iddhi adhiṭṭhānavasena nipphannattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhiṭṭhānā iddhi"
      },
      " nāma."
    ],
    "innerText": "370. Tattha ‘‘pakatiyā eko bahukaṃ āvajjati. Sataṃ vā sahassaṃ vā satasahassaṃ vā āvajjitvā ñāṇena adhiṭṭhāti ‘bahuko homī’’’ti (paṭi. ma. 3.10) evaṃ vibhajitvā dassitā iddhi adhiṭṭhānavasena nipphannattā adhiṭṭhānā iddhi nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "371"
      },
      ". ‘‘So pakativaṇṇaṃ vijahitvā kumārakavaṇṇaṃ vā dasseti nāgavaṇṇaṃ vā…pe… vividhampi senābyūhaṃ dassetī’’ti (paṭi. ma. 3.13) evaṃ āgatā iddhi pakativaṇṇavijahanavikāravasena pavattattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vikubbanā iddhi"
      },
      " nāma."
    ],
    "innerText": "371. ‘‘So pakativaṇṇaṃ vijahitvā kumārakavaṇṇaṃ vā dasseti nāgavaṇṇaṃ vā…pe… vividhampi senābyūhaṃ dassetī’’ti (paṭi. ma. 3.13) evaṃ āgatā iddhi pakativaṇṇavijahanavikāravasena pavattattā vikubbanā iddhi nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "372"
      },
      ". ‘‘Idha bhikkhu imamhā kāyā aññaṃ kāyaṃ abhinimmināti rūpiṃ manomaya’’nti (paṭi. ma. 3.14) iminā nayena āgatā iddhi sarīrabbhantare aññasseva manomayassa sarīrassa nipphattivasena pavattattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manomayā iddhi"
      },
      " nāma."
    ],
    "innerText": "372. ‘‘Idha bhikkhu imamhā kāyā aññaṃ kāyaṃ abhinimmināti rūpiṃ manomaya’’nti (paṭi. ma. 3.14) iminā nayena āgatā iddhi sarīrabbhantare aññasseva manomayassa sarīrassa nipphattivasena pavattattā manomayā iddhi nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "373"
      },
      ". Ñāṇuppattito pana pubbe vā pacchā vā taṃkhaṇe vā ñāṇānubhāvanibbatto viseso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñāṇavipphārā iddhi"
      },
      " nāma. Vuttañhetaṃ – ‘‘aniccānupassanāya niccasaññāya pahānaṭṭho ijjhatīti ñāṇavipphārā iddhi…pe… arahattamaggena sabbakilesānaṃ pahānaṭṭho ijjhatīti ñāṇavipphārā iddhi. Āyasmato bākkulassa ñāṇavipphārā iddhi. Āyasmato saṃkiccassa ñāṇavipphārā iddhi. Āyasmato bhūtapālassa ñāṇavipphārā iddhī’’ti (paṭi. ma. 3.15)."
    ],
    "innerText": "373. Ñāṇuppattito pana pubbe vā pacchā vā taṃkhaṇe vā ñāṇānubhāvanibbatto viseso ñāṇavipphārā iddhi nāma. Vuttañhetaṃ – ‘‘aniccānupassanāya niccasaññāya pahānaṭṭho ijjhatīti ñāṇavipphārā iddhi…pe… arahattamaggena sabbakilesānaṃ pahānaṭṭho ijjhatīti ñāṇavipphārā iddhi. Āyasmato bākkulassa ñāṇavipphārā iddhi. Āyasmato saṃkiccassa ñāṇavipphārā iddhi. Āyasmato bhūtapālassa ñāṇavipphārā iddhī’’ti (paṭi. ma. 3.15)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āyasmā bākkulo"
      },
      " daharova maṅgaladivase nadiyā nhāpiyamāno dhātiyā pamādena sote patito. Tamenaṃ maccho gilitvā bārāṇasītitthaṃ agamāsi. Tatra taṃ macchabandho gahetvā seṭṭhibhariyāya vikkiṇi. Sā macche sinehaṃ uppādetvā ahameva naṃ pacissāmīti phālentī macchakucchiyaṃ suvaṇṇabimbaṃ viya dārakaṃ disvā putto me laddhoti somanassajātā ahosi. Iti macchakucchiyaṃ arogabhāvo āyasmato bākkulassa ",
      " pacchimabhavikassa tena attabhāvena paṭilabhitabbaarahattamaggañāṇānubhāvena ",
      " nibbattattā ñāṇavipphārā iddhi nāma. Vatthu pana vitthārena kathetabbaṃ."
    ],
    "innerText": "Tattha āyasmā bākkulo daharova maṅgaladivase nadiyā nhāpiyamāno dhātiyā pamādena sote patito. Tamenaṃ maccho gilitvā bārāṇasītitthaṃ agamāsi. Tatra taṃ macchabandho gahetvā seṭṭhibhariyāya vikkiṇi. Sā macche sinehaṃ uppādetvā ahameva naṃ pacissāmīti phālentī macchakucchiyaṃ suvaṇṇabimbaṃ viya dārakaṃ disvā putto me laddhoti somanassajātā ahosi. Iti macchakucchiyaṃ arogabhāvo āyasmato bākkulassa pacchimabhavikassa tena attabhāvena paṭilabhitabbaarahattamaggañāṇānubhāvena nibbattattā ñāṇavipphārā iddhi nāma. Vatthu pana vitthārena kathetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃkiccattherassa"
      },
      " pana gabbhagatasseva mātā kālamakāsi. Tassā citakaṃ āropetvā sūlehi vijjhitvā jhāpiyamānāya dārako sūlakoṭiyā akkhikūṭe pahāraṃ labhitvā saddaṃ akāsi. Tato dārako jīvatīti otāretvā kucchiṃ phāletvā dārakaṃ ayyikāya adaṃsu. So tāya paṭijaggito vuddhimanvāya pabbajitvā saha paṭisambhidāhi arahattaṃ pāpuṇi. Iti vuttanayeneva dārucitakāya arogabhāvo āyasmato saṃkiccassa ñāṇavipphārā iddhi nāma."
    ],
    "innerText": "Saṃkiccattherassa pana gabbhagatasseva mātā kālamakāsi. Tassā citakaṃ āropetvā sūlehi vijjhitvā jhāpiyamānāya dārako sūlakoṭiyā akkhikūṭe pahāraṃ labhitvā saddaṃ akāsi. Tato dārako jīvatīti otāretvā kucchiṃ phāletvā dārakaṃ ayyikāya adaṃsu. So tāya paṭijaggito vuddhimanvāya pabbajitvā saha paṭisambhidāhi arahattaṃ pāpuṇi. Iti vuttanayeneva dārucitakāya arogabhāvo āyasmato saṃkiccassa ñāṇavipphārā iddhi nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūtapāladārakassa"
      },
      " pana pitā rājagahe daliddamanusso. So dārūnaṃ atthāya sakaṭena aṭaviṃ gantvā dārubhāraṃ katvā sāyaṃ nagaradvārasamīpaṃ patto. Athassa goṇā yugaṃ ossajjitvā nagaraṃ pavisiṃsu. So sakaṭamūle puttakaṃ nisīdāpetvā goṇānaṃ anupadaṃ gacchanto nagarameva pāvisi. Tassa anikkhantasseva dvāraṃ pihitaṃ. Dārakassa vāḷayakkhānucaritepi bahinagare tiyāmarattiṃ arogabhāvo vuttanayeneva ñāṇavipphārā iddhi nāma. Vatthu pana vitthāretabbaṃ."
    ],
    "innerText": "Bhūtapāladārakassa pana pitā rājagahe daliddamanusso. So dārūnaṃ atthāya sakaṭena aṭaviṃ gantvā dārubhāraṃ katvā sāyaṃ nagaradvārasamīpaṃ patto. Athassa goṇā yugaṃ ossajjitvā nagaraṃ pavisiṃsu. So sakaṭamūle puttakaṃ nisīdāpetvā goṇānaṃ anupadaṃ gacchanto nagarameva pāvisi. Tassa anikkhantasseva dvāraṃ pihitaṃ. Dārakassa vāḷayakkhānucaritepi bahinagare tiyāmarattiṃ arogabhāvo vuttanayeneva ñāṇavipphārā iddhi nāma. Vatthu pana vitthāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "374"
      },
      ". Samādhito pubbe vā pacchā vā taṃkhaṇe vā samathānubhāvanibbatto viseso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samādhivipphārā iddhi"
      },
      ". Vuttañhetaṃ ‘‘paṭhamajjhānena nīvaraṇānaṃ pahānaṭṭho ijjhatīti samādhivipphārā iddhi…pe… nevasaññānāsaññāyatanasamāpattiyā ākiñcaññāyatanasaññāya pahānaṭṭho ijjhatīti samādhivipphārā iddhi. Āyasmato sāriputtassa samādhivipphārā iddhi, āyasmato sañjīvassa, āyasmato khāṇukoṇḍaññassa, uttarāya upāsikāya, sāmāvatiyā upāsikāya samādhivipphārā iddhī’’ti (paṭi. ma. 3.16)."
    ],
    "innerText": "374. Samādhito pubbe vā pacchā vā taṃkhaṇe vā samathānubhāvanibbatto viseso samādhivipphārā iddhi. Vuttañhetaṃ ‘‘paṭhamajjhānena nīvaraṇānaṃ pahānaṭṭho ijjhatīti samādhivipphārā iddhi…pe… nevasaññānāsaññāyatanasamāpattiyā ākiñcaññāyatanasaññāya pahānaṭṭho ijjhatīti samādhivipphārā iddhi. Āyasmato sāriputtassa samādhivipphārā iddhi, āyasmato sañjīvassa, āyasmato khāṇukoṇḍaññassa, uttarāya upāsikāya, sāmāvatiyā upāsikāya samādhivipphārā iddhī’’ti (paṭi. ma. 3.16)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yadā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āyasmato sāriputtassa"
      },
      " mahāmoggallānattherena saddhiṃ kapotakandarāyaṃ viharato juṇhāya rattiyā navoropitehi kesehi ajjhokāse nisinnassa eko duṭṭhayakkho sahāyakena yakkhena vāriyamānopi sīse pahāramadāsi. Yassa meghassa viya gajjato ",
      " saddo ahosi. Tadā thero tassa paharaṇasamaye samāpattiṃ appesi. Athassa tena pahārena na koci ābādho ahosi ",
      ". Ayaṃ tassāyasmato samādhivipphārā iddhi. Vatthu pana udāne (udā. 34) āgatameva."
    ],
    "innerText": "Tattha yadā āyasmato sāriputtassa mahāmoggallānattherena saddhiṃ kapotakandarāyaṃ viharato juṇhāya rattiyā navoropitehi kesehi ajjhokāse nisinnassa eko duṭṭhayakkho sahāyakena yakkhena vāriyamānopi sīse pahāramadāsi. Yassa meghassa viya gajjato saddo ahosi. Tadā thero tassa paharaṇasamaye samāpattiṃ appesi. Athassa tena pahārena na koci ābādho ahosi . Ayaṃ tassāyasmato samādhivipphārā iddhi. Vatthu pana udāne (udā. 34) āgatameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sañjīvattheraṃ"
      },
      " pana nirodhasamāpannaṃ kālakatoti sallakkhetvā gopālakādayo tiṇakaṭṭhagomayāni saṅkaḍḍhetvā aggiṃ adaṃsu. Therassa cīvare aṃsumattampi najjhāyittha. Ayamassa anupubbasamāpattivasena pavattasamathānubhāvanibbattattā samādhivipphārā iddhi. Vatthu pana sutte (ma. ni. 1.507) āgatameva."
    ],
    "innerText": "Sañjīvattheraṃ pana nirodhasamāpannaṃ kālakatoti sallakkhetvā gopālakādayo tiṇakaṭṭhagomayāni saṅkaḍḍhetvā aggiṃ adaṃsu. Therassa cīvare aṃsumattampi najjhāyittha. Ayamassa anupubbasamāpattivasena pavattasamathānubhāvanibbattattā samādhivipphārā iddhi. Vatthu pana sutte (ma. ni. 1.507) āgatameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khāṇukoṇḍaññatthero"
      },
      " pana pakatiyāva samāpattibahulo. So aññatarasmiṃ araññe rattiṃ samāpattiṃ appetvā nisīdi. Pañcasatā corā bhaṇḍakaṃ thenetvā gacchantā ‘‘idāni amhākaṃ anupathaṃ āgacchantā natthī’’ti vissamitukāmā bhaṇḍakaṃ oropayamānā ‘‘khāṇuko aya’’nti maññamānā therasseva upari sabbabhaṇḍakāni ṭhapesuṃ. Tesaṃ vissamitvā gacchantānaṃ paṭhamaṃ ṭhapitabhaṇḍakassa gahaṇakāle kālaparicchedavasena thero vuṭṭhāsi. Te therassa calanākāraṃ disvā bhītā viraviṃsu. Thero ‘‘mā bhāyittha upāsakā, bhikkhu aha’’nti āha. Te āgantvā vanditvā theragatena pasādena pabbajitvā saha paṭisambhidāhi arahattaṃ pāpuṇiṃsu (dha. pa. aṭṭha. 1.1). Ayamettha pañcahi bhaṇḍakasatehi ajjhotthaṭassa therassa ābādhābhāvo samādhivipphārā iddhi."
    ],
    "innerText": "Khāṇukoṇḍaññatthero pana pakatiyāva samāpattibahulo. So aññatarasmiṃ araññe rattiṃ samāpattiṃ appetvā nisīdi. Pañcasatā corā bhaṇḍakaṃ thenetvā gacchantā ‘‘idāni amhākaṃ anupathaṃ āgacchantā natthī’’ti vissamitukāmā bhaṇḍakaṃ oropayamānā ‘‘khāṇuko aya’’nti maññamānā therasseva upari sabbabhaṇḍakāni ṭhapesuṃ. Tesaṃ vissamitvā gacchantānaṃ paṭhamaṃ ṭhapitabhaṇḍakassa gahaṇakāle kālaparicchedavasena thero vuṭṭhāsi. Te therassa calanākāraṃ disvā bhītā viraviṃsu. Thero ‘‘mā bhāyittha upāsakā, bhikkhu aha’’nti āha. Te āgantvā vanditvā theragatena pasādena pabbajitvā saha paṭisambhidāhi arahattaṃ pāpuṇiṃsu (dha. pa. aṭṭha. 1.1). Ayamettha pañcahi bhaṇḍakasatehi ajjhotthaṭassa therassa ābādhābhāvo samādhivipphārā iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttarā"
      },
      " pana upāsikā puṇṇaseṭṭhissa dhītā. Tassā sirimā nāma gaṇikā issāpakatā tattatelakaṭāhaṃ sīse āsiñci. Uttarā taṃkhaṇaññeva mettaṃ samāpajji. Telaṃ pokkharapattato udakabindu viya vivaṭṭamānaṃ agamāsi. Ayamassā samādhivipphārā iddhi. Vatthu pana vitthāretabbaṃ."
    ],
    "innerText": "Uttarā pana upāsikā puṇṇaseṭṭhissa dhītā. Tassā sirimā nāma gaṇikā issāpakatā tattatelakaṭāhaṃ sīse āsiñci. Uttarā taṃkhaṇaññeva mettaṃ samāpajji. Telaṃ pokkharapattato udakabindu viya vivaṭṭamānaṃ agamāsi. Ayamassā samādhivipphārā iddhi. Vatthu pana vitthāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāmāvatī"
      },
      " nāma udenassa rañño aggamahesī. Māgaṇḍiyabrāhmaṇo attano dhītāya aggamahesiṭṭhānaṃ patthayamāno tassā vīṇāya āsīvisaṃ ",
      " pakkhipāpetvā rājānaṃ āha ‘‘mahārāja, sāmāvatī taṃ māretukāmā vīṇāya āsīvisaṃ gahetvā pariharatī’’ti. Rājā taṃ disvā kupito sāmāvatiṃ vadhissāmīti dhanuṃ āropetvā visapītaṃ khurappaṃ sannayhi. Sāmāvatī saparivārā rājānaṃ mettāya phari. Rājā neva saraṃ khipituṃ na oropetuṃ sakkonto vedhamāno aṭṭhāsi. Tato naṃ devī āha ‘‘kiṃ, mahārāja, kilamasī’’ti? ‘‘Āma kilamāmī’’ti. ‘‘Tena ",
      " hi dhanuṃ oropehī’’ti. Saro rañño pādamūleyeva pati. Tato naṃ devī ‘‘mahārāja, appaduṭṭhassa nappadussitabba’’nti ovadi. Iti rañño saraṃ muñcituṃ avisahanabhāvo sāmāvatiyā upāsikāya samādhivipphārā iddhīti."
    ],
    "innerText": "Sāmāvatī nāma udenassa rañño aggamahesī. Māgaṇḍiyabrāhmaṇo attano dhītāya aggamahesiṭṭhānaṃ patthayamāno tassā vīṇāya āsīvisaṃ pakkhipāpetvā rājānaṃ āha ‘‘mahārāja, sāmāvatī taṃ māretukāmā vīṇāya āsīvisaṃ gahetvā pariharatī’’ti. Rājā taṃ disvā kupito sāmāvatiṃ vadhissāmīti dhanuṃ āropetvā visapītaṃ khurappaṃ sannayhi. Sāmāvatī saparivārā rājānaṃ mettāya phari. Rājā neva saraṃ khipituṃ na oropetuṃ sakkonto vedhamāno aṭṭhāsi. Tato naṃ devī āha ‘‘kiṃ, mahārāja, kilamasī’’ti? ‘‘Āma kilamāmī’’ti. ‘‘Tena hi dhanuṃ oropehī’’ti. Saro rañño pādamūleyeva pati. Tato naṃ devī ‘‘mahārāja, appaduṭṭhassa nappadussitabba’’nti ovadi. Iti rañño saraṃ muñcituṃ avisahanabhāvo sāmāvatiyā upāsikāya samādhivipphārā iddhīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "375"
      },
      ". Paṭikkūlādīsu appaṭikkūlasaññivihārādikā pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyā iddhi"
      },
      " nāma. Yathāha – ‘‘katamā ariyā iddhi? Idha – bhikkhu sace ākaṅkhati ‘paṭikkūle appaṭikkūlasaññī vihareyya’nti, appaṭikkūlasaññī tattha viharati…pe… upekkhako tattha viharati sato sampajāno’’ti (paṭi. ma. 3.17). Ayañhi cetovasippattānaṃ ariyānaṃyeva sambhavato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyā iddhī"
      },
      "ti vuccati."
    ],
    "innerText": "375. Paṭikkūlādīsu appaṭikkūlasaññivihārādikā pana ariyā iddhi nāma. Yathāha – ‘‘katamā ariyā iddhi? Idha – bhikkhu sace ākaṅkhati ‘paṭikkūle appaṭikkūlasaññī vihareyya’nti, appaṭikkūlasaññī tattha viharati…pe… upekkhako tattha viharati sato sampajāno’’ti (paṭi. ma. 3.17). Ayañhi cetovasippattānaṃ ariyānaṃyeva sambhavato ariyā iddhīti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Etāya hi samannāgato khīṇāsavo bhikkhu paṭikkūle aniṭṭhe vatthusmiṃ mettāpharaṇaṃ vā dhātumanasikāraṃ vā karonto appaṭikkūlasaññī viharati. Appaṭikkūle iṭṭhe vatthusmiṃ asubhapharaṇaṃ vā aniccanti manasikāraṃ vā karonto paṭikkūlasaññī viharati. Tathā paṭikkūlāpaṭikkūlesu tadeva mettāpharaṇaṃ vā dhātumanasikāraṃ vā karonto appaṭikkūlasaññī viharati. Appaṭikkūlapaṭikkūlesu ca tadeva asubhapharaṇaṃ vā aniccanti manasikāraṃ vā karonto paṭikkūlasaññī viharati. Cakkhunā rūpaṃ disvā neva sumano hotītiādinā nayena vuttaṃ pana chaḷaṅgupekkhaṃ pavattayamāno paṭikkūle ca appaṭikkūle ca tadubhayaṃ abhinivajjitvā upekkhako viharati sato sampajāno. Paṭisambhidāyañhi ‘‘kathaṃ paṭikkūle appaṭikkūlasaññī viharati? Aniṭṭhasmiṃ vatthusmiṃ mettāya vā pharati dhātuso vā upasaṃharatī’’tiādinā (paṭi. ma. 3.17) nayena ayameva attho vibhatto. Ayaṃ cetovasippattānaṃ ariyānaṃyeva sambhavato ariyā iddhīti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "376"
      },
      ". Pakkhīādīnaṃ pana ",
      " vehāsagamanādikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammavipākajā iddhi"
      },
      " nāma. Yathāha – ‘‘katamā kammavipākajā iddhi? Sabbesaṃ pakkhīnaṃ sabbesaṃ devānaṃ ekaccānaṃ manussānaṃ ekaccānañca vinipātikānaṃ ayaṃ kammavipākajā iddhī’’ti (paṭi. ma. 3.18). Ettha hi sabbesaṃ pakkhīnaṃ jhānaṃ vā vipassanaṃ vā vināyeva ākāsena gamanaṃ. Tathā sabbesaṃ devānaṃ paṭhamakappikānañca ekaccānaṃ manussānaṃ. Tathā piyaṅkaramātā (saṃ. ni. 1.240) yakkhinī ",
      " uttaramātā phussamittā dhammaguttāti evamādīnaṃ ekaccānaṃ vinipātikānaṃ ākāsena gamanaṃ kammavipākajā iddhīti."
    ],
    "innerText": "376. Pakkhīādīnaṃ pana vehāsagamanādikā kammavipākajā iddhi nāma. Yathāha – ‘‘katamā kammavipākajā iddhi? Sabbesaṃ pakkhīnaṃ sabbesaṃ devānaṃ ekaccānaṃ manussānaṃ ekaccānañca vinipātikānaṃ ayaṃ kammavipākajā iddhī’’ti (paṭi. ma. 3.18). Ettha hi sabbesaṃ pakkhīnaṃ jhānaṃ vā vipassanaṃ vā vināyeva ākāsena gamanaṃ. Tathā sabbesaṃ devānaṃ paṭhamakappikānañca ekaccānaṃ manussānaṃ. Tathā piyaṅkaramātā (saṃ. ni. 1.240) yakkhinī uttaramātā phussamittā dhammaguttāti evamādīnaṃ ekaccānaṃ vinipātikānaṃ ākāsena gamanaṃ kammavipākajā iddhīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "377"
      },
      ". Cakkavattiādīnaṃ vehāsagamanādikā pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puññavato iddhi"
      },
      " nāma. Yathāha ‘‘katamā puññavato iddhi? Rājā cakkavattī vehāsaṃ gacchati saddhiṃ caturaṅginiyā senāya antamaso assabandhagobandhapurise upādāya. Jotikassa gahapatissa puññavato iddhi. Jaṭilakassa gahapatissa puññavato iddhi. Ghositassa gahapatissa puññavato iddhi. Meṇḍakassa gahapatissa puññavato iddhi. Pañcannaṃ mahāpuññānaṃ puññavato iddhī’’ti. Saṅkhepato pana paripākaṃ gate puññasambhāre ijjhanakaviseso puññavato iddhi."
    ],
    "innerText": "377. Cakkavattiādīnaṃ vehāsagamanādikā pana puññavato iddhi nāma. Yathāha ‘‘katamā puññavato iddhi? Rājā cakkavattī vehāsaṃ gacchati saddhiṃ caturaṅginiyā senāya antamaso assabandhagobandhapurise upādāya. Jotikassa gahapatissa puññavato iddhi. Jaṭilakassa gahapatissa puññavato iddhi. Ghositassa gahapatissa puññavato iddhi. Meṇḍakassa gahapatissa puññavato iddhi. Pañcannaṃ mahāpuññānaṃ puññavato iddhī’’ti. Saṅkhepato pana paripākaṃ gate puññasambhāre ijjhanakaviseso puññavato iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jotikassa"
      },
      " gahapatissa pathaviṃ bhinditvā maṇipāsādo uṭṭhahi. Catusaṭṭhi ca kapparukkhāti ayamassa puññavato iddhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jaṭilakassa"
      },
      " asītihattho suvaṇṇapabbato nibbatti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ghositassa"
      },
      " sattasu ṭhānesu māraṇatthāya upakkame katepi arogabhāvo puññavato iddhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Meṇḍakassa"
      },
      " ekakarīsamatte padese sattaratanamayānaṃ meṇḍakānaṃ pātubhāvo puññavato iddhi. Pañca mahāpuññā nāma meṇḍakaseṭṭhi, tassa bhariyā candapadumasirī, putto dhanañcayaseṭṭhi, suṇisā sumanadevī, dāso puṇṇo nāmāti. Tesu seṭṭhissa sīsaṃ nhātassa ākāsaṃ ullokanakāle aḍḍhateḷasakoṭṭhasahassāni ākāsato rattasālīnaṃ pūrenti. Bhariyāya nāḷikodanamattampi gahetvā sakalajambudīpavāsike parivisamānāya bhattaṃ na khīyati. Puttassa sahassatthavikaṃ gahetvā sakalajambudīpavāsikānampi dentassa kahāpaṇā na khīyanti. Suṇisāya ekaṃ ",
      " vīhitumbaṃ gahetvā sakalajambudīpavāsikānampi bhājayamānāya dhaññaṃ na khīyati. Dāsassa ekena naṅgalena kasato ito satta ito sattāti cuddasa maggā honti. Ayaṃ nesaṃ puññavato iddhi."
    ],
    "innerText": "Ettha ca jotikassa gahapatissa pathaviṃ bhinditvā maṇipāsādo uṭṭhahi. Catusaṭṭhi ca kapparukkhāti ayamassa puññavato iddhi. Jaṭilakassa asītihattho suvaṇṇapabbato nibbatti. Ghositassa sattasu ṭhānesu māraṇatthāya upakkame katepi arogabhāvo puññavato iddhi. Meṇḍakassa ekakarīsamatte padese sattaratanamayānaṃ meṇḍakānaṃ pātubhāvo puññavato iddhi. Pañca mahāpuññā nāma meṇḍakaseṭṭhi, tassa bhariyā candapadumasirī, putto dhanañcayaseṭṭhi, suṇisā sumanadevī, dāso puṇṇo nāmāti. Tesu seṭṭhissa sīsaṃ nhātassa ākāsaṃ ullokanakāle aḍḍhateḷasakoṭṭhasahassāni ākāsato rattasālīnaṃ pūrenti. Bhariyāya nāḷikodanamattampi gahetvā sakalajambudīpavāsike parivisamānāya bhattaṃ na khīyati. Puttassa sahassatthavikaṃ gahetvā sakalajambudīpavāsikānampi dentassa kahāpaṇā na khīyanti. Suṇisāya ekaṃ vīhitumbaṃ gahetvā sakalajambudīpavāsikānampi bhājayamānāya dhaññaṃ na khīyati. Dāsassa ekena naṅgalena kasato ito satta ito sattāti cuddasa maggā honti. Ayaṃ nesaṃ puññavato iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "378"
      },
      ". Vijjādharādīnaṃ vehāsagamanādikā pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijjāmayā iddhi"
      },
      ". Yathāha ‘‘katamā vijjāmayā iddhi? Vijjādharā vijjaṃ parijapitvā vehāsaṃ gacchanti. Ākāse antalikkhe hatthimpi dassenti…pe… vividhampi senābyūhaṃ dassentī’’ti (paṭi. ma. 3.18)."
    ],
    "innerText": "378. Vijjādharādīnaṃ vehāsagamanādikā pana vijjāmayā iddhi. Yathāha ‘‘katamā vijjāmayā iddhi? Vijjādharā vijjaṃ parijapitvā vehāsaṃ gacchanti. Ākāse antalikkhe hatthimpi dassenti…pe… vividhampi senābyūhaṃ dassentī’’ti (paṭi. ma. 3.18)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "379"
      },
      ". Tena tena pana sammāpayogena tassa tassa kammassa ijjhanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha tattha sammāpayogapaccayā ijjhanaṭṭhena iddhi"
      },
      ". Yathāha – ‘‘nekkhammena kāmacchandassa pahānaṭṭho ijjhatīti tattha ",
      " tattha sammāpayogapaccayā ijjhanaṭṭhena iddhi…pe… arahattamaggena sabbakilesānaṃ pahānaṭṭho ijjhatīti tattha tattha sammāpayogapaccayā ijjhanaṭṭhena iddhī’’ti (paṭi. ma. 3.18). Ettha ca paṭipattisaṅkhātasseva sammāpayogassa dīpanavasena purimapāḷisadisāva pāḷi āgatā. Aṭṭhakathāyaṃ pana sakaṭabyūhādikaraṇavasena yaṃkiñci sippakammaṃ yaṃkiñci vejjakammaṃ tiṇṇaṃ bedānaṃ uggahaṇaṃ tiṇṇaṃ piṭakānaṃ uggahaṇaṃ antamaso kasanavapanādīni upādāya taṃ taṃ kammaṃ katvā nibbattaviseso tattha tattha sammāpayogapaccayā ijjhanaṭṭhena iddhīti āgatā. (10)"
    ],
    "innerText": "379. Tena tena pana sammāpayogena tassa tassa kammassa ijjhanaṃ tattha tattha sammāpayogapaccayā ijjhanaṭṭhena iddhi. Yathāha – ‘‘nekkhammena kāmacchandassa pahānaṭṭho ijjhatīti tattha tattha sammāpayogapaccayā ijjhanaṭṭhena iddhi…pe… arahattamaggena sabbakilesānaṃ pahānaṭṭho ijjhatīti tattha tattha sammāpayogapaccayā ijjhanaṭṭhena iddhī’’ti (paṭi. ma. 3.18). Ettha ca paṭipattisaṅkhātasseva sammāpayogassa dīpanavasena purimapāḷisadisāva pāḷi āgatā. Aṭṭhakathāyaṃ pana sakaṭabyūhādikaraṇavasena yaṃkiñci sippakammaṃ yaṃkiñci vejjakammaṃ tiṇṇaṃ bedānaṃ uggahaṇaṃ tiṇṇaṃ piṭakānaṃ uggahaṇaṃ antamaso kasanavapanādīni upādāya taṃ taṃ kammaṃ katvā nibbattaviseso tattha tattha sammāpayogapaccayā ijjhanaṭṭhena iddhīti āgatā. (10)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iti imāsu dasasu iddhīsu iddhividhāyāti imasmiṃ pade adhiṭṭhānā iddhiyeva āgatā. Imasmiṃ panatthe vikubbanāmanomayāiddhiyopi icchitabbā eva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "380"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhividhāyā"
      },
      "ti iddhikoṭṭhāsāya, iddhivikappāya vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittaṃ abhinīharati abhininnāmetī"
      },
      "ti so bhikkhu vuttappakāravasena tasmiṃ citte abhiññāpādake jāte iddhividhādhigamatthāya parikammacittaṃ abhinīharati kasiṇārammaṇato apanetvā iddhividhābhimukhaṃ peseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhininnāmetī"
      },
      "ti adhigantabbaiddhipoṇaṃ iddhipabbhāraṃ karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So"
      },
      "ti so evaṃ katacittābhinīhāro bhikkhu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anekavihita"
      },
      "nti anekavidhaṃ nānappakārakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhividha"
      },
      "nti iddhikoṭṭhāsaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccanubhotī"
      },
      "ti paccanubhavati, phusati ",
      " sacchikaroti pāpuṇātīti attho. Idānissa anekavihitabhāvaṃ dassento ‘‘ekopi hutvā’’tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekopi hutvā"
      },
      "ti iddhikaraṇato pubbe pakatiyā ekopi hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahudhā hotī"
      },
      "ti bahūnaṃ santike caṅkamitukāmo vā sajjhāyaṃ vā kattukāmo pañhaṃ vā pucchitukāmo hutvā satampi sahassampi hoti. Kathaṃ panāyamevaṃ hoti? Iddhiyā catasso bhūmiyo cattāro pādā aṭṭha padāni soḷasa ca mūlāni sampādetvā ñāṇena adhiṭṭhahanto."
    ],
    "innerText": "380.Iddhividhāyāti iddhikoṭṭhāsāya, iddhivikappāya vā. Cittaṃ abhinīharati abhininnāmetīti so bhikkhu vuttappakāravasena tasmiṃ citte abhiññāpādake jāte iddhividhādhigamatthāya parikammacittaṃ abhinīharati kasiṇārammaṇato apanetvā iddhividhābhimukhaṃ peseti. Abhininnāmetīti adhigantabbaiddhipoṇaṃ iddhipabbhāraṃ karoti. Soti so evaṃ katacittābhinīhāro bhikkhu. Anekavihitanti anekavidhaṃ nānappakārakaṃ. Iddhividhanti iddhikoṭṭhāsaṃ. Paccanubhotīti paccanubhavati, phusati sacchikaroti pāpuṇātīti attho. Idānissa anekavihitabhāvaṃ dassento ‘‘ekopi hutvā’’tiādimāha. Tattha ekopi hutvāti iddhikaraṇato pubbe pakatiyā ekopi hutvā. Bahudhā hotīti bahūnaṃ santike caṅkamitukāmo vā sajjhāyaṃ vā kattukāmo pañhaṃ vā pucchitukāmo hutvā satampi sahassampi hoti. Kathaṃ panāyamevaṃ hoti? Iddhiyā catasso bhūmiyo cattāro pādā aṭṭha padāni soḷasa ca mūlāni sampādetvā ñāṇena adhiṭṭhahanto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "381"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catasso bhūmiyo"
      },
      "ti cattāri jhānāni veditabbāni. Vuttañhetaṃ dhammasenāpatinā ‘‘iddhiyā katamā catasso bhūmiyo? Vivekajabhūmi paṭhamaṃ jhānaṃ, pītisukhabhūmi dutiyaṃ jhānaṃ, upekkhāsukhabhūmi tatiyaṃ jhānaṃ, adukkhamasukhabhūmi catutthaṃ jhānaṃ. Iddhiyā imā catasso bhūmiyo iddhilābhāya iddhipaṭilābhāya iddhivikubbanatāya iddhivisavitāya iddhivasitāya iddhivesārajjāya saṃvattantī’’ti (paṭi. ma. 3.9). Ettha ca purimāni tīṇi jhānāni yasmā pītipharaṇena ca sukhapharaṇena ca sukhasaññañca lahusaññañca okkamitvā ",
      " lahumudukammaññakāyo iddhiṃ pāpuṇāti, tasmā iminā pariyāyena iddhilābhāya saṃvattanato sambhārabhūmiyoti veditabbāni. Catutthajjhānaṃ pana iddhilābhāya pakatibhūmiyeva."
    ],
    "innerText": "381. Tattha catasso bhūmiyoti cattāri jhānāni veditabbāni. Vuttañhetaṃ dhammasenāpatinā ‘‘iddhiyā katamā catasso bhūmiyo? Vivekajabhūmi paṭhamaṃ jhānaṃ, pītisukhabhūmi dutiyaṃ jhānaṃ, upekkhāsukhabhūmi tatiyaṃ jhānaṃ, adukkhamasukhabhūmi catutthaṃ jhānaṃ. Iddhiyā imā catasso bhūmiyo iddhilābhāya iddhipaṭilābhāya iddhivikubbanatāya iddhivisavitāya iddhivasitāya iddhivesārajjāya saṃvattantī’’ti (paṭi. ma. 3.9). Ettha ca purimāni tīṇi jhānāni yasmā pītipharaṇena ca sukhapharaṇena ca sukhasaññañca lahusaññañca okkamitvā lahumudukammaññakāyo iddhiṃ pāpuṇāti, tasmā iminā pariyāyena iddhilābhāya saṃvattanato sambhārabhūmiyoti veditabbāni. Catutthajjhānaṃ pana iddhilābhāya pakatibhūmiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "382"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattāro pādā"
      },
      "ti cattāro iddhipādā veditabbā. Vuttañhetaṃ ‘‘iddhiyā katame cattāro pādā? Idha bhikkhu chandasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Vīriya… citta… vīmaṃsāsamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Iddhiyā ime cattāro pādā iddhilābhāya…pe… iddhivesārajjāya saṃvattantī’’ti (paṭi. ma. 3.9). Ettha ca chandahetuko chandādhiko vā samādhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chandasamādhi"
      },
      ". Kattukamyatāchandaṃ adhipatiṃ karitvā paṭiladdhasamādhissetaṃ adhivacanaṃ. Padhānabhūtā saṅkhārā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padhānasaṅkhārā"
      },
      ". Catukiccasādhakassa sammappadhānavīriyassetaṃ adhivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samannāgata"
      },
      "nti chandasamādhinā ca padhānasaṅkhārehi ca upetaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhipāda"
      },
      "nti nipphattipariyāyena vā ijjhanaṭṭhena, ijjhanti etāya sattā iddhā vuddhā ukkaṃsagatā hontīti iminā vā pariyāyena iddhīti saṅkhaṃ gatānaṃ abhiññācittasampayuttānaṃ chandasamādhipadhānasaṅkhārānaṃ ",
      " adhiṭṭhānaṭṭhena pādabhūtaṃ sesacittacetasikarāsinti attho. Vuttañhetaṃ ‘‘iddhipādoti tathābhūtassa vedanākkhandho…pe… viññāṇakkhandho’’ti (vibha. 434)."
    ],
    "innerText": "382.Cattāro pādāti cattāro iddhipādā veditabbā. Vuttañhetaṃ ‘‘iddhiyā katame cattāro pādā? Idha bhikkhu chandasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Vīriya… citta… vīmaṃsāsamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Iddhiyā ime cattāro pādā iddhilābhāya…pe… iddhivesārajjāya saṃvattantī’’ti (paṭi. ma. 3.9). Ettha ca chandahetuko chandādhiko vā samādhi chandasamādhi. Kattukamyatāchandaṃ adhipatiṃ karitvā paṭiladdhasamādhissetaṃ adhivacanaṃ. Padhānabhūtā saṅkhārā padhānasaṅkhārā. Catukiccasādhakassa sammappadhānavīriyassetaṃ adhivacanaṃ. Samannāgatanti chandasamādhinā ca padhānasaṅkhārehi ca upetaṃ. Iddhipādanti nipphattipariyāyena vā ijjhanaṭṭhena, ijjhanti etāya sattā iddhā vuddhā ukkaṃsagatā hontīti iminā vā pariyāyena iddhīti saṅkhaṃ gatānaṃ abhiññācittasampayuttānaṃ chandasamādhipadhānasaṅkhārānaṃ adhiṭṭhānaṭṭhena pādabhūtaṃ sesacittacetasikarāsinti attho. Vuttañhetaṃ ‘‘iddhipādoti tathābhūtassa vedanākkhandho…pe… viññāṇakkhandho’’ti (vibha. 434)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha vā pajjate anenāti pādo. Pāpuṇīyatīti attho. Iddhiyā pādo iddhipādo. Chandādīnametaṃ adhivacanaṃ. Yathāha – ‘‘chandañce, bhikkhave, bhikkhu nissāya labhati samādhiṃ, labhati cittassekaggataṃ, ayaṃ vuccati chandasamādhi. So anuppannānaṃ pāpakānaṃ…pe… padahati, ime vuccanti padhānasaṅkhārā. Iti ayañca chando ayañca chandasamādhi ime ca padhānasaṅkhārā, ayaṃ vuccati, bhikkhave, chandasamādhipadhānasaṅkhārasamannāgato iddhipādo’’ti (saṃ. ni. 5.825). Evaṃ sesiddhipādesupi attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "383"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭha padānī"
      },
      "ti chandādīni aṭṭha veditabbāni. Vuttañhetaṃ ‘‘iddhiyā katamāni aṭṭha padāni? Chandañce bhikkhu nissāya labhati samādhiṃ, labhati cittassekaggataṃ. Chando na samādhi, samādhi na chando. Añño chando, añño samādhi. Vīriyañce bhikkhu… cittañce bhikkhu… vīmaṃsañce bhikkhu nissāya labhati samādhiṃ, labhati cittassekaggataṃ. Vīmaṃsā na samādhi, samādhi na vīmaṃsā. Aññā vīmaṃsā, añño samādhi. Iddhiyā imāni aṭṭha padāni iddhilābhāya…pe… iddhivesārajjāya saṃvattantī’’ti (paṭi. ma. 3.9). Ettha hi iddhimuppādetukāmatāchando ",
      " samādhinā ekato niyuttova iddhilābhāya saṃvattati; tathā vīriyādayo. Tasmā imāni aṭṭha padāni vuttānīti veditabbāni."
    ],
    "innerText": "383.Aṭṭha padānīti chandādīni aṭṭha veditabbāni. Vuttañhetaṃ ‘‘iddhiyā katamāni aṭṭha padāni? Chandañce bhikkhu nissāya labhati samādhiṃ, labhati cittassekaggataṃ. Chando na samādhi, samādhi na chando. Añño chando, añño samādhi. Vīriyañce bhikkhu… cittañce bhikkhu… vīmaṃsañce bhikkhu nissāya labhati samādhiṃ, labhati cittassekaggataṃ. Vīmaṃsā na samādhi, samādhi na vīmaṃsā. Aññā vīmaṃsā, añño samādhi. Iddhiyā imāni aṭṭha padāni iddhilābhāya…pe… iddhivesārajjāya saṃvattantī’’ti (paṭi. ma. 3.9). Ettha hi iddhimuppādetukāmatāchando samādhinā ekato niyuttova iddhilābhāya saṃvattati; tathā vīriyādayo. Tasmā imāni aṭṭha padāni vuttānīti veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "384"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Soḷasa mūlānī"
      },
      "ti soḷasahi ākārehi āneñjatā cittassa veditabbā. Vuttañhetaṃ – ‘‘iddhiyā kati mūlāni? Soḷasa mūlāni – anonataṃ cittaṃ kosajje na iñjatīti āneñjaṃ, anunnataṃ cittaṃ uddhacce na iñjatīti āneñjaṃ, anabhinataṃ cittaṃ rāge na iñjatīti āneñjaṃ, anapanataṃ cittaṃ byāpāde na iñjatīti āneñjaṃ, anissitaṃ cittaṃ diṭṭhiyā na iñjatīti āneñjaṃ, appaṭibaddhaṃ cittaṃ chandarāge na iñjatīti āneñjaṃ, vippamuttaṃ cittaṃ kāmarāge na iñjatīti āneñjaṃ, visaṃyuttaṃ cittaṃ kilese na iñjatīti āneñjaṃ, vimariyādikataṃ cittaṃ kilesamariyāde na iñjatīti āneñjaṃ, ekattagataṃ cittaṃ nānattakilese na iñjatīti āneñjaṃ, saddhāya pariggahitaṃ ",
      " cittaṃ assaddhiye na iñjatīti āneñjaṃ, vīriyena pariggahitaṃ cittaṃ kosajje na iñjatīti āneñjaṃ, satiyā pariggahitaṃ cittaṃ pamāde na iñjatīti āneñjaṃ, samādhinā pariggahitaṃ cittaṃ uddhacce na iñjatīti āneñjaṃ, paññāya pariggahitaṃ cittaṃ avijjāya na iñjatīti āneñjaṃ, obhāsagataṃ cittaṃ avijjandhakāre na iñjatīti āneñjaṃ. Iddhiyā imāni soḷasa mūlāni iddhilābhāya…pe… iddhivesārajjāya saṃvattantī’’ti (paṭi. ma. 3.9)."
    ],
    "innerText": "384.Soḷasa mūlānīti soḷasahi ākārehi āneñjatā cittassa veditabbā. Vuttañhetaṃ – ‘‘iddhiyā kati mūlāni? Soḷasa mūlāni – anonataṃ cittaṃ kosajje na iñjatīti āneñjaṃ, anunnataṃ cittaṃ uddhacce na iñjatīti āneñjaṃ, anabhinataṃ cittaṃ rāge na iñjatīti āneñjaṃ, anapanataṃ cittaṃ byāpāde na iñjatīti āneñjaṃ, anissitaṃ cittaṃ diṭṭhiyā na iñjatīti āneñjaṃ, appaṭibaddhaṃ cittaṃ chandarāge na iñjatīti āneñjaṃ, vippamuttaṃ cittaṃ kāmarāge na iñjatīti āneñjaṃ, visaṃyuttaṃ cittaṃ kilese na iñjatīti āneñjaṃ, vimariyādikataṃ cittaṃ kilesamariyāde na iñjatīti āneñjaṃ, ekattagataṃ cittaṃ nānattakilese na iñjatīti āneñjaṃ, saddhāya pariggahitaṃ cittaṃ assaddhiye na iñjatīti āneñjaṃ, vīriyena pariggahitaṃ cittaṃ kosajje na iñjatīti āneñjaṃ, satiyā pariggahitaṃ cittaṃ pamāde na iñjatīti āneñjaṃ, samādhinā pariggahitaṃ cittaṃ uddhacce na iñjatīti āneñjaṃ, paññāya pariggahitaṃ cittaṃ avijjāya na iñjatīti āneñjaṃ, obhāsagataṃ cittaṃ avijjandhakāre na iñjatīti āneñjaṃ. Iddhiyā imāni soḷasa mūlāni iddhilābhāya…pe… iddhivesārajjāya saṃvattantī’’ti (paṭi. ma. 3.9)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kāmañca esa attho evaṃ samāhite cittetiādināpi siddhoyeva, paṭhamajjhānādīnaṃ pana iddhiyā bhūmipādapadamūlabhāvadassanatthaṃ puna vutto. Purimo ca suttesu āgatanayo. Ayaṃ paṭisambhidāyaṃ. Iti ubhayattha asammohatthampi puna vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "385"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāṇena adhiṭṭhahanto"
      },
      "ti svāyamete iddhiyā bhūmipādapadabhūte dhamme sampādetvā abhiññāpādakaṃ jhānaṃ samāpajjitvā vuṭṭhāya sace sataṃ icchati ‘‘sataṃ homi sataṃ homī’’ti parikammaṃ katvā puna abhiññāpādakaṃ jhānaṃ samāpajjitvā vuṭṭhāya adhiṭṭhāti, adhiṭṭhānacittena saheva sataṃ hoti. Sahassādīsupi eseva nayo. Sace evaṃ na ijjhati puna parikammaṃ katvā dutiyampi samāpajjitvā vuṭṭhāya adhiṭṭhātabbaṃ. Saṃyuttaṭṭhakathāyaṃ hi ekavāraṃ dvevāraṃ samāpajjituṃ vaṭṭatīti vuttaṃ. Tattha pādakajjhānacittaṃ nimittārammaṇaṃ. Parikammacittāni satārammaṇāni vā sahassārammaṇāni vā, tāni ca kho vaṇṇavasena, no paṇṇattivasena. Adhiṭṭhānacittampi tatheva satārammaṇaṃ ",
      " vā sahassārammaṇaṃ vā. Taṃ pubbe vuttaṃ appanācittamiva gotrabhuanantaraṃ ekameva uppajjati rūpāvacaracatutthajjhānikaṃ."
    ],
    "innerText": "385.Ñāṇena adhiṭṭhahantoti svāyamete iddhiyā bhūmipādapadabhūte dhamme sampādetvā abhiññāpādakaṃ jhānaṃ samāpajjitvā vuṭṭhāya sace sataṃ icchati ‘‘sataṃ homi sataṃ homī’’ti parikammaṃ katvā puna abhiññāpādakaṃ jhānaṃ samāpajjitvā vuṭṭhāya adhiṭṭhāti, adhiṭṭhānacittena saheva sataṃ hoti. Sahassādīsupi eseva nayo. Sace evaṃ na ijjhati puna parikammaṃ katvā dutiyampi samāpajjitvā vuṭṭhāya adhiṭṭhātabbaṃ. Saṃyuttaṭṭhakathāyaṃ hi ekavāraṃ dvevāraṃ samāpajjituṃ vaṭṭatīti vuttaṃ. Tattha pādakajjhānacittaṃ nimittārammaṇaṃ. Parikammacittāni satārammaṇāni vā sahassārammaṇāni vā, tāni ca kho vaṇṇavasena, no paṇṇattivasena. Adhiṭṭhānacittampi tatheva satārammaṇaṃ vā sahassārammaṇaṃ vā. Taṃ pubbe vuttaṃ appanācittamiva gotrabhuanantaraṃ ekameva uppajjati rūpāvacaracatutthajjhānikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "386"
      },
      ". Yampi paṭisambhidāyaṃ vuttaṃ ‘‘pakatiyā eko bahukaṃ āvajjati sataṃ vā sahassaṃ vā satasahassaṃ vā, āvajjitvā ñāṇena adhiṭṭhāti ‘bahuko homī’ti, bahuko hoti, yathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āyasmā cūḷapanthako’’"
      },
      "ti (paṭi. ma. 3.10). Tatrāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āvajjatī"
      },
      "ti parikammavaseneva vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvajjitvā ñāṇena adhiṭṭhātī"
      },
      "ti abhiññāñāṇavasena vuttaṃ. Tasmā bahukaṃ āvajjati, tato tesampi parikammacittānaṃ avasāne samāpajjati, samāpattito vuṭṭhahitvā puna bahuko homīti āvajjitvā tato paraṃ pavattānaṃ tiṇṇaṃ catunnaṃ vā pubbabhāgacittānaṃ anantarā uppannena sanniṭṭhāpanavasena adhiṭṭhānanti ",
      " laddhanāmena ekeneva abhiññāñāṇena adhiṭṭhātīti evamettha attho daṭṭhabbo."
    ],
    "innerText": "386. Yampi paṭisambhidāyaṃ vuttaṃ ‘‘pakatiyā eko bahukaṃ āvajjati sataṃ vā sahassaṃ vā satasahassaṃ vā, āvajjitvā ñāṇena adhiṭṭhāti ‘bahuko homī’ti, bahuko hoti, yathā āyasmā cūḷapanthako’’ti (paṭi. ma. 3.10). Tatrāpi āvajjatīti parikammavaseneva vuttaṃ. Āvajjitvā ñāṇena adhiṭṭhātīti abhiññāñāṇavasena vuttaṃ. Tasmā bahukaṃ āvajjati, tato tesampi parikammacittānaṃ avasāne samāpajjati, samāpattito vuṭṭhahitvā puna bahuko homīti āvajjitvā tato paraṃ pavattānaṃ tiṇṇaṃ catunnaṃ vā pubbabhāgacittānaṃ anantarā uppannena sanniṭṭhāpanavasena adhiṭṭhānanti laddhanāmena ekeneva abhiññāñāṇena adhiṭṭhātīti evamettha attho daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yaṃ pana vuttaṃ ‘‘yathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āyasmā cūḷapanthako’’"
      },
      "ti, taṃ bahudhābhāvassa kāyasakkhidassanatthaṃ vuttaṃ. Taṃ pana vatthunā dīpetabbaṃ. Te kira dvebhātaro panthe jātattā panthakāti nāmaṃ labhiṃsu. Tesaṃ jeṭṭho mahāpanthako, so pabbajitvā saha paṭisambhidāhi arahattaṃ pāpuṇi. Arahā hutvā cūḷapanthakaṃ pabbājetvā –"
    ],
    "innerText": "Yaṃ pana vuttaṃ ‘‘yathā āyasmā cūḷapanthako’’ti, taṃ bahudhābhāvassa kāyasakkhidassanatthaṃ vuttaṃ. Taṃ pana vatthunā dīpetabbaṃ. Te kira dvebhātaro panthe jātattā panthakāti nāmaṃ labhiṃsu. Tesaṃ jeṭṭho mahāpanthako, so pabbajitvā saha paṭisambhidāhi arahattaṃ pāpuṇi. Arahā hutvā cūḷapanthakaṃ pabbājetvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Padumaṃ yathā kokanadaṃ sugandhaṃ, pāto siyā phullamavītagandhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aṅgīrasaṃ passa virocamānaṃ, tapantamādiccamivantalikkheti. (a. ni. 5.195) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Imaṃ gāthaṃ adāsi. So taṃ catūhi māsehi paguṇaṃ kātuṃ nāsakkhi. Atha naṃ thero abhabbo tvaṃ sāsaneti vihārato nīhari. Tasmiñca kāle thero bhattuddesako hoti. Jīvako theraṃ upasaṅkamitvā ‘‘sve, bhante, bhagavatā saddhiṃ pañcabhikkhusatāni gahetvā amhākaṃ gehe bhikkhaṃ gaṇhathā’’ti āha. Theropi ṭhapetvā cūḷapanthakaṃ sesānaṃ adhivāsemīti adhivāsesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cūḷapanthako dvārakoṭṭhake ṭhatvā rodati. Bhagavā dibbacakkhunā disvā taṃ upasaṅkamitvā kasmā rodasīti āha. So taṃ pavattimācikkhi. Bhagavā na sajjhāyaṃ kātuṃ asakkonto mama ",
      " sāsane abhabbo nāma hoti, mā soci bhikkhūti taṃ bāhāyaṃ gahetvā vihāraṃ pavisitvā iddhiyā pilotikakhaṇḍaṃ abhinimminitvā adāsi, handa bhikkhu imaṃ parimajjanto rajoharaṇaṃ rajoharaṇanti punappunaṃ sajjhāyaṃ karohīti. Tassa tathā karoto taṃ kāḷavaṇṇaṃ ahosi. So parisuddhaṃ vatthaṃ, natthettha doso, attabhāvassa panāyaṃ dosoti saññaṃ paṭilabhitvā pañcasu khandhesu ñāṇaṃ otāretvā vipassanaṃ vaḍḍhetvā anulomato gotrabhusamīpaṃ pāpesi. Athassa bhagavā obhāsagāthā abhāsi –"
    ],
    "innerText": "Cūḷapanthako dvārakoṭṭhake ṭhatvā rodati. Bhagavā dibbacakkhunā disvā taṃ upasaṅkamitvā kasmā rodasīti āha. So taṃ pavattimācikkhi. Bhagavā na sajjhāyaṃ kātuṃ asakkonto mama sāsane abhabbo nāma hoti, mā soci bhikkhūti taṃ bāhāyaṃ gahetvā vihāraṃ pavisitvā iddhiyā pilotikakhaṇḍaṃ abhinimminitvā adāsi, handa bhikkhu imaṃ parimajjanto rajoharaṇaṃ rajoharaṇanti punappunaṃ sajjhāyaṃ karohīti. Tassa tathā karoto taṃ kāḷavaṇṇaṃ ahosi. So parisuddhaṃ vatthaṃ, natthettha doso, attabhāvassa panāyaṃ dosoti saññaṃ paṭilabhitvā pañcasu khandhesu ñāṇaṃ otāretvā vipassanaṃ vaḍḍhetvā anulomato gotrabhusamīpaṃ pāpesi. Athassa bhagavā obhāsagāthā abhāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Rāgo rajo na ca pana reṇu vuccati,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Rāgassetaṃ adhivacanaṃ rajoti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Etaṃ rajaṃ vippajahitvā paṇḍitā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Viharanti te vigatarajassa sāsane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "‘‘Doso ",
      "…pe…."
    ],
    "innerText": "‘‘Doso …pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Moho rajo na ca pana reṇu vuccati,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Mohassetaṃ adhivacanaṃ rajoti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Etaṃ rajaṃ vippajahitvā paṇḍitā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Viharanti te vigatarajassa sāsane’’ti. (mahāni. 209);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassa gāthāpariyosāne catupaṭisambhidāchaḷabhiññāparivārā nava lokuttaradhammā hatthagatāva ahesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Satthā dutiyadivase jīvakassa gehaṃ agamāsi saddhiṃ bhikkhusaṅghena. Atha dakkhiṇodakāvasāne yāguyā diyyamānāya hatthena pattaṃ pidahi. Jīvako kiṃ bhanteti pucchi. Vihāre eko bhikkhu atthīti. So purisaṃ pesesi ‘‘gaccha, ayyaṃ gahetvā sīghaṃ ehī’’ti. Vihārato nikkhante pana bhagavati,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Sahassakkhattumattānaṃ ",
      ", nimminitvāna panthako;"
    ],
    "innerText": "Sahassakkhattumattānaṃ , nimminitvāna panthako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nisīdambavane ramme, yāva kālappavedanāti. (theragā. 563);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha so puriso gantvā kāsāvehi ekapajjotaṃ ārāmaṃ disvā āgantvā bhikkhūhi bharito bhante ārāmo, nāhaṃ jānāmi katamo so ayyoti āha. Tato naṃ bhagavā āha ‘‘gaccha yaṃ paṭhamaṃ passasi, taṃ cīvarakaṇṇe gahetvā ‘satthā taṃ āmantetī’ti vatvā ānehī’’ti. So taṃ gantvā therasseva cīvarakaṇṇe aggahesi. Tāvadeva sabbepi nimmitā antaradhāyiṃsu. Thero ‘‘gaccha tva’’nti taṃ uyyojetvā mukhadhovanādisarīrakiccaṃ niṭṭhapetvā paṭhamataraṃ gantvā pattāsane nisīdi. Idaṃ sandhāya vuttaṃ ‘‘yathā āyasmā cūḷapanthako’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatra ye te bahū nimmitā te aniyametvā nimmitattā iddhimatā sadisāva honti. Ṭhānanisajjādīsu vā bhāsitatuṇhībhāvādīsu vā yaṃ yaṃ iddhimā karoti, taṃ tadeva karonti. Sace pana nānāvaṇṇe kātukāmo hoti, keci paṭhamavaye, keci majjhimavaye, keci pacchimavaye, tathā ",
      " dīghakese, upaḍḍhamuṇḍe, muṇḍe, missakese, upaḍḍharattacīvare, paṇḍukacīvare, padabhāṇadhammakathāsarabhaññapañhapucchanapañhavissajjanarajanapacanacīvarasibbanadhovanādīni karonte aparepi vā nānappakārake kātukāmo hoti, tena pādakajjhānato vuṭṭhāya ettakā bhikkhū paṭhamavayā hontūtiādinā nayena parikammaṃ katvā puna samāpajjitvā vuṭṭhāya adhiṭṭhātabbaṃ. Adhiṭṭhānacittena saddhiṃ icchiticchitappakārāyeva hontīti. Esa nayo bahudhāpi hutvā eko hotītiādīsu."
    ],
    "innerText": "Tatra ye te bahū nimmitā te aniyametvā nimmitattā iddhimatā sadisāva honti. Ṭhānanisajjādīsu vā bhāsitatuṇhībhāvādīsu vā yaṃ yaṃ iddhimā karoti, taṃ tadeva karonti. Sace pana nānāvaṇṇe kātukāmo hoti, keci paṭhamavaye, keci majjhimavaye, keci pacchimavaye, tathā dīghakese, upaḍḍhamuṇḍe, muṇḍe, missakese, upaḍḍharattacīvare, paṇḍukacīvare, padabhāṇadhammakathāsarabhaññapañhapucchanapañhavissajjanarajanapacanacīvarasibbanadhovanādīni karonte aparepi vā nānappakārake kātukāmo hoti, tena pādakajjhānato vuṭṭhāya ettakā bhikkhū paṭhamavayā hontūtiādinā nayena parikammaṃ katvā puna samāpajjitvā vuṭṭhāya adhiṭṭhātabbaṃ. Adhiṭṭhānacittena saddhiṃ icchiticchitappakārāyeva hontīti. Esa nayo bahudhāpi hutvā eko hotītiādīsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ pana viseso, iminā bhikkhunā evaṃ bahubhāvaṃ nimminitvā puna ‘‘ekova hutvā caṅkamissāmi, sajjhāyaṃ karissāmi, pañhaṃ pucchissāmī’’ti cintetvā vā, ‘‘ayaṃ vihāro appabhikkhuko, sace keci āgamissanti ‘kuto ime ettakā ekasadisā bhikkhū, addhā therassa esa ānubhāvo’ti maṃ jānissantī’’ti appicchatāya vā antarāva ‘‘eko homī’’ti icchantena pādakajjhānaṃ samāpajjitvā vuṭṭhāya ‘‘eko homī’’ti parikammaṃ katvā puna samāpajjitvā vuṭṭhāya ‘‘eko homī’’ti adhiṭṭhātabbaṃ. Adhiṭṭhānacittena saddhiṃyeva eko hoti. Evaṃ akaronto pana yathā paricchinnakālavasena sayameva eko hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "387"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvibhāvaṃ tirobhāva"
      },
      "nti ettha āvibhāvaṃ karoti tirobhāvaṃ karotīti ayamattho ",
      ". Idameva hi sandhāya paṭisambhidāyaṃ vuttaṃ ‘‘āvibhāvanti kenaci anāvaṭaṃ hoti appaṭicchannaṃ vivaṭaṃ pākaṭaṃ. Tirobhāvanti kenaci āvaṭaṃ hoti paṭicchannaṃ pihitaṃ paṭikujjita’’nti (paṭi. ma. 3.11). Tatrāyaṃ iddhimā āvibhāvaṃ kātukāmo andhakāraṃ vā ālokaṃ karoti, paṭicchannaṃ vā vivaṭaṃ, anāpāthaṃ vā āpāthaṃ karoti. Kathaṃ? Ayañhi yathā paṭicchannopi dūre ṭhitopi vā dissati, evaṃ attānaṃ vā paraṃ vā kātukāmo pādakajjhānato vuṭṭhāya idaṃ andhakāraṭṭhānaṃ ālokajātaṃ hotūti vā, idaṃ paṭicchannaṃ vivaṭaṃ hotūti vā, idaṃ anāpāthaṃ āpāthaṃ hotūti vā āvajjitvā parikammaṃ katvā vuttanayeneva adhiṭṭhāti, saha adhiṭṭhānacittena yathādhiṭṭhitameva hoti. Pare dūre ṭhitāpi passanti. Sayampi passitukāmo passati."
    ],
    "innerText": "387.Āvibhāvaṃ tirobhāvanti ettha āvibhāvaṃ karoti tirobhāvaṃ karotīti ayamattho . Idameva hi sandhāya paṭisambhidāyaṃ vuttaṃ ‘‘āvibhāvanti kenaci anāvaṭaṃ hoti appaṭicchannaṃ vivaṭaṃ pākaṭaṃ. Tirobhāvanti kenaci āvaṭaṃ hoti paṭicchannaṃ pihitaṃ paṭikujjita’’nti (paṭi. ma. 3.11). Tatrāyaṃ iddhimā āvibhāvaṃ kātukāmo andhakāraṃ vā ālokaṃ karoti, paṭicchannaṃ vā vivaṭaṃ, anāpāthaṃ vā āpāthaṃ karoti. Kathaṃ? Ayañhi yathā paṭicchannopi dūre ṭhitopi vā dissati, evaṃ attānaṃ vā paraṃ vā kātukāmo pādakajjhānato vuṭṭhāya idaṃ andhakāraṭṭhānaṃ ālokajātaṃ hotūti vā, idaṃ paṭicchannaṃ vivaṭaṃ hotūti vā, idaṃ anāpāthaṃ āpāthaṃ hotūti vā āvajjitvā parikammaṃ katvā vuttanayeneva adhiṭṭhāti, saha adhiṭṭhānacittena yathādhiṭṭhitameva hoti. Pare dūre ṭhitāpi passanti. Sayampi passitukāmo passati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "388"
      },
      ". Etaṃ ",
      " pana pāṭihāriyaṃ kena katapubbanti? Bhagavatā. Bhagavā hi cūḷasubhaddāya nimantito vissakammunā nimmitehi pañcahi kūṭāgārasatehi sāvatthito sattayojanabbhantaraṃ sāketaṃ gacchanto yathā sāketanagaravāsino sāvatthivāsike, sāvatthivāsino ca sāketavāsike passanti, evaṃ adhiṭṭhāsi. Nagaramajjhe ca otaritvā pathaviṃ dvidhā bhinditvā yāva avīciṃ ākāsañca dvidhā viyūhitvā yāva brahmalokaṃ dassesi."
    ],
    "innerText": "388. Etaṃ pana pāṭihāriyaṃ kena katapubbanti? Bhagavatā. Bhagavā hi cūḷasubhaddāya nimantito vissakammunā nimmitehi pañcahi kūṭāgārasatehi sāvatthito sattayojanabbhantaraṃ sāketaṃ gacchanto yathā sāketanagaravāsino sāvatthivāsike, sāvatthivāsino ca sāketavāsike passanti, evaṃ adhiṭṭhāsi. Nagaramajjhe ca otaritvā pathaviṃ dvidhā bhinditvā yāva avīciṃ ākāsañca dvidhā viyūhitvā yāva brahmalokaṃ dassesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Devorohaṇenapi ca ayamattho vibhāvetabbo. Bhagavā kira yamakapāṭihāriyaṃ katvā caturāsītipāṇasahassāni bandhanā pamocetvā atītā buddhā yamakapāṭihāriyāvasāne kuhiṃ gatāti āvajjitvā tāvatiṃsabhavanaṃ gatāti addasa. Athekena pādena pathavītalaṃ akkamitvā dutiyaṃ yugandharapabbate patiṭṭhapetvā puna purimapādaṃ uddharitvā sinerumatthakaṃ akkamitvā tattha paṇḍukambalasilātale vassaṃ upagantvā sannipatitānaṃ dasasahassacakkavāḷadevatānaṃ ādito paṭṭhāya abhidhammakathaṃ ārabhi. Bhikkhācāravelāya nimmitabuddhaṃ māpesi. So dhammaṃ deseti. Bhagavā nāgalatādantakaṭṭhaṃ khāditvā anotattadahe mukhaṃ dhovitvā uttarakurūsu piṇḍapātaṃ gahetvā anotattadahatīre paribhuñjati. Sāriputtatthero tattha gantvā bhagavantaṃ vandati. Bhagavā ajja ettakaṃ dhammaṃ desesinti therassa nayaṃ deti. Evaṃ tayo māse abbocchinnaṃ abhidhammakathaṃ kathesi. Taṃ sutvā asītikoṭidevatānaṃ dhammābhisamayo ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yamakapāṭihāriye sannipatitāpi dvādasayojanā parisā bhagavantaṃ passitvāva gamissāmāti ",
      " khandhāvāraṃ bandhitvā aṭṭhāsi. Taṃ cūḷaanāthapiṇḍikaseṭṭhiyeva sabbapaccayehi upaṭṭhāsi. Manussā kuhiṃ bhagavāti jānanatthāya anuruddhattheraṃ yāciṃsu. Thero ālokaṃ vaḍḍhetvā addasa dibbena cakkhunā tattha vassūpagataṃ bhagavantaṃ disvā ārocesi."
    ],
    "innerText": "Yamakapāṭihāriye sannipatitāpi dvādasayojanā parisā bhagavantaṃ passitvāva gamissāmāti khandhāvāraṃ bandhitvā aṭṭhāsi. Taṃ cūḷaanāthapiṇḍikaseṭṭhiyeva sabbapaccayehi upaṭṭhāsi. Manussā kuhiṃ bhagavāti jānanatthāya anuruddhattheraṃ yāciṃsu. Thero ālokaṃ vaḍḍhetvā addasa dibbena cakkhunā tattha vassūpagataṃ bhagavantaṃ disvā ārocesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Te bhagavato vandanatthāya mahāmoggallānattheraṃ yāciṃsu. Thero parisamajjheyeva mahāpathaviyaṃ nimujjitvā sinerupabbataṃ nibbijjhitvā tathāgatapādamūle ",
      " bhagavato pāde vandamānova ummujjitvā bhagavantaṃ etadavoca ‘‘jambudīpavāsino, bhante, bhagavato pāde vanditvā passitvāva gamissāmāti vadantī’’ti. Bhagavā āha ‘‘kuhiṃ pana te, moggallāna, etarahi jeṭṭhabhātā dhammasenāpatī’’ti? ‘‘Saṅkassanagare bhante’’ti. ‘‘Moggallāna, maṃ daṭṭhukāmā sve saṅkassanagaraṃ āgacchantu, ahaṃ sve mahāpavāraṇapuṇṇamāsīuposathadivase saṅkassanagare otarissāmī’’ti. ‘‘Sādhu, bhante’’ti thero dasabalaṃ vanditvā āgatamaggeneva oruyha manussānaṃ santikaṃ sampāpuṇi. Gamanāgamanakāle ca yathā naṃ manussā passanti, evaṃ adhiṭṭhāsi. Idaṃ tāvettha mahāmoggallānatthero āvibhāvapāṭihāriyaṃ akāsi."
    ],
    "innerText": "Te bhagavato vandanatthāya mahāmoggallānattheraṃ yāciṃsu. Thero parisamajjheyeva mahāpathaviyaṃ nimujjitvā sinerupabbataṃ nibbijjhitvā tathāgatapādamūle bhagavato pāde vandamānova ummujjitvā bhagavantaṃ etadavoca ‘‘jambudīpavāsino, bhante, bhagavato pāde vanditvā passitvāva gamissāmāti vadantī’’ti. Bhagavā āha ‘‘kuhiṃ pana te, moggallāna, etarahi jeṭṭhabhātā dhammasenāpatī’’ti? ‘‘Saṅkassanagare bhante’’ti. ‘‘Moggallāna, maṃ daṭṭhukāmā sve saṅkassanagaraṃ āgacchantu, ahaṃ sve mahāpavāraṇapuṇṇamāsīuposathadivase saṅkassanagare otarissāmī’’ti. ‘‘Sādhu, bhante’’ti thero dasabalaṃ vanditvā āgatamaggeneva oruyha manussānaṃ santikaṃ sampāpuṇi. Gamanāgamanakāle ca yathā naṃ manussā passanti, evaṃ adhiṭṭhāsi. Idaṃ tāvettha mahāmoggallānatthero āvibhāvapāṭihāriyaṃ akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So evaṃ āgato taṃ pavattiṃ ārocetvā ‘‘dūranti saññaṃ akatvā katapātarāsāva nikkhamathā’’ti āha. Bhagavā sakkassa devarañño ārocesi ‘‘mahārāja, sve manussalokaṃ gacchāmī’’ti. Devarājā vissakammaṃ āṇāpesi ‘‘tāta, sve bhagavā manussalokaṃ gantukāmo, tisso sopānapantiyo māpehi ekaṃ kanakamayaṃ, ekaṃ rajatamayaṃ, ekaṃ maṇimaya’’nti. So tathā akāsi. Bhagavā dutiyadivase sinerumuddhani ṭhatvā puratthimalokadhātuṃ olokesi, anekāni cakkavāḷasahassāni vivaṭāni hutvā ekaṅgaṇaṃ viya pakāsiṃsu. Yathā ca puratthimena, evaṃ pacchimenapi uttarenapi dakkhiṇenapi sabbaṃ vivaṭamaddasa. Heṭṭhāpi yāva avīci, upari yāva akaniṭṭhabhavanaṃ, tāva addasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Taṃ divasaṃ kira lokavivaraṇaṃ nāma ahosi. Manussāpi deve passanti, devāpi manusse. Tattha neva manussā uddhaṃ ullokenti, na devā adho olokenti, sabbe sammukhāva aññamaññaṃ passanti. Bhagavā majjhe maṇimayena sopānena otarati, chakāmāvacaradevā vāmapasse kanakamayena, suddhāvāsā ca mahābrahmā ca dakkhiṇapasse rajatamayena. Devarājā pattacīvaraṃ aggahesi, mahābrahmā tiyojanikaṃ setacchattaṃ, suyāmo vāḷabījaniṃ, pañcasikho gandhabbaputto ",
      " tigāvutamattaṃ beḷuvapaṇḍuvīṇaṃ gahetvā tathāgatassa pūjaṃ karonto otarati. Taṃdivasaṃ bhagavantaṃ disvā buddhabhāvāya pihaṃ anuppādetvā ṭhitasatto nāma natthi. Idamettha bhagavā āvibhāvapāṭihāriyaṃ akāsi."
    ],
    "innerText": "Taṃ divasaṃ kira lokavivaraṇaṃ nāma ahosi. Manussāpi deve passanti, devāpi manusse. Tattha neva manussā uddhaṃ ullokenti, na devā adho olokenti, sabbe sammukhāva aññamaññaṃ passanti. Bhagavā majjhe maṇimayena sopānena otarati, chakāmāvacaradevā vāmapasse kanakamayena, suddhāvāsā ca mahābrahmā ca dakkhiṇapasse rajatamayena. Devarājā pattacīvaraṃ aggahesi, mahābrahmā tiyojanikaṃ setacchattaṃ, suyāmo vāḷabījaniṃ, pañcasikho gandhabbaputto tigāvutamattaṃ beḷuvapaṇḍuvīṇaṃ gahetvā tathāgatassa pūjaṃ karonto otarati. Taṃdivasaṃ bhagavantaṃ disvā buddhabhāvāya pihaṃ anuppādetvā ṭhitasatto nāma natthi. Idamettha bhagavā āvibhāvapāṭihāriyaṃ akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica ",
      " tambapaṇṇidīpe talaṅgaravāsī dhammadinnattheropi tissamahāvihāre cetiyaṅgaṇasmiṃ nisīditvā ‘‘tīhi, bhikkhave, dhammehi samannāgato bhikkhu apaṇṇakapaṭipadaṃ paṭipanno hotī’’ti apaṇṇakasuttaṃ (a. ni. 3.16) kathento heṭṭhāmukhaṃ bījaniṃ akāsi, yāva avīcito ekaṅgaṇaṃ ahosi. Tato uparimukhaṃ akāsi, yāva brahmalokā ekaṅgaṇaṃ ahosi. Thero nirayabhayena tajjetvā saggasukhena ca palobhetvā dhammaṃ desesi. Keci sotāpannā ahesuṃ, keci sakadāgāmī anāgāmī arahantoti."
    ],
    "innerText": "Apica tambapaṇṇidīpe talaṅgaravāsī dhammadinnattheropi tissamahāvihāre cetiyaṅgaṇasmiṃ nisīditvā ‘‘tīhi, bhikkhave, dhammehi samannāgato bhikkhu apaṇṇakapaṭipadaṃ paṭipanno hotī’’ti apaṇṇakasuttaṃ (a. ni. 3.16) kathento heṭṭhāmukhaṃ bījaniṃ akāsi, yāva avīcito ekaṅgaṇaṃ ahosi. Tato uparimukhaṃ akāsi, yāva brahmalokā ekaṅgaṇaṃ ahosi. Thero nirayabhayena tajjetvā saggasukhena ca palobhetvā dhammaṃ desesi. Keci sotāpannā ahesuṃ, keci sakadāgāmī anāgāmī arahantoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "389"
      },
      ". Tirobhāvaṃ kātukāmo pana ālokaṃ vā andhakāraṃ karoti, appaṭicchannaṃ vā paṭicchannaṃ, āpāthaṃ vā anāpāthaṃ karoti. Kathaṃ? Ayañhi yathā appaṭicchannopi samīpe ṭhitopi vā na dissati, evaṃ attānaṃ vā paraṃ vā kātukāmo pādakajjhānato vuṭṭhāya ‘‘idaṃ ālokaṭṭhānaṃ andhakāraṃ hotū’’ti vā, ‘‘idaṃ appaṭicchannaṃ paṭicchannaṃ hotū’’ti vā, ‘‘idaṃ āpāthaṃ anāpāthaṃ hotū’’ti vā āvajjitvā parikammaṃ katvā vuttanayeneva adhiṭṭhāti. Saha adhiṭṭhānacittena yathādhiṭṭhitameva hoti. Pare samīpe ṭhitāpi na passanti. Sayampi apassitukāmo na passati."
    ],
    "innerText": "389. Tirobhāvaṃ kātukāmo pana ālokaṃ vā andhakāraṃ karoti, appaṭicchannaṃ vā paṭicchannaṃ, āpāthaṃ vā anāpāthaṃ karoti. Kathaṃ? Ayañhi yathā appaṭicchannopi samīpe ṭhitopi vā na dissati, evaṃ attānaṃ vā paraṃ vā kātukāmo pādakajjhānato vuṭṭhāya ‘‘idaṃ ālokaṭṭhānaṃ andhakāraṃ hotū’’ti vā, ‘‘idaṃ appaṭicchannaṃ paṭicchannaṃ hotū’’ti vā, ‘‘idaṃ āpāthaṃ anāpāthaṃ hotū’’ti vā āvajjitvā parikammaṃ katvā vuttanayeneva adhiṭṭhāti. Saha adhiṭṭhānacittena yathādhiṭṭhitameva hoti. Pare samīpe ṭhitāpi na passanti. Sayampi apassitukāmo na passati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "390"
      },
      ". Etaṃ pana pāṭihāriyaṃ kena katapubbanti? Bhagavatā. Bhagavā hi yasaṃ kulaputtaṃ samīpe nisinnaṃyeva yathā naṃ pitā na passati, evamakāsi. Tathā vīsayojanasataṃ mahākappinassa paccuggamanaṃ katvā taṃ anāgāmiphale, amaccasahassañcassa sotāpattiphale patiṭṭhāpetvā, tassa anumaggaṃ āgatā sahassitthiparivārā anojādevī āgantvā samīpe nisinnāpi yathā saparisaṃ rājānaṃ na passati, tathā katvā ‘‘api, bhante, rājānaṃ passathā’’ti vutte ‘‘kiṃ pana te rājānaṃ gavesituṃ varaṃ, udāhu attāna’’nti? ‘‘Attānaṃ, bhante’’ti vatvā nisinnāya tassā tathā dhammaṃ desesi, yathā sā saddhiṃ itthisahassena sotāpattiphale patiṭṭhāsi, amaccā anāgāmiphale, rājā arahatteti. Apica tambapaṇṇidīpaṃ ",
      " āgatadivase yathā attanā saddhiṃ āgate avasese rājā na passati, evaṃ karontena mahindattherenāpi idaṃ katameva (pārā. aṭṭha. 1.tatiyasaṅgītikathā)."
    ],
    "innerText": "390. Etaṃ pana pāṭihāriyaṃ kena katapubbanti? Bhagavatā. Bhagavā hi yasaṃ kulaputtaṃ samīpe nisinnaṃyeva yathā naṃ pitā na passati, evamakāsi. Tathā vīsayojanasataṃ mahākappinassa paccuggamanaṃ katvā taṃ anāgāmiphale, amaccasahassañcassa sotāpattiphale patiṭṭhāpetvā, tassa anumaggaṃ āgatā sahassitthiparivārā anojādevī āgantvā samīpe nisinnāpi yathā saparisaṃ rājānaṃ na passati, tathā katvā ‘‘api, bhante, rājānaṃ passathā’’ti vutte ‘‘kiṃ pana te rājānaṃ gavesituṃ varaṃ, udāhu attāna’’nti? ‘‘Attānaṃ, bhante’’ti vatvā nisinnāya tassā tathā dhammaṃ desesi, yathā sā saddhiṃ itthisahassena sotāpattiphale patiṭṭhāsi, amaccā anāgāmiphale, rājā arahatteti. Apica tambapaṇṇidīpaṃ āgatadivase yathā attanā saddhiṃ āgate avasese rājā na passati, evaṃ karontena mahindattherenāpi idaṃ katameva (pārā. aṭṭha. 1.tatiyasaṅgītikathā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "391"
      },
      ". Apica sabbampi pākaṭaṃ pāṭihāriyaṃ āvibhāvaṃ nāma. Apākaṭapāṭihāriyaṃ tirobhāvaṃ nāma. Tattha pākaṭapāṭihāriye iddhipi paññāyati iddhimāpi. Taṃ yamakapāṭihāriyena dīpetabbaṃ. Tatra hi ‘‘idha tathāgato yamakapāṭihāriyaṃ karoti asādhāraṇaṃ sāvakehi. Uparimakāyato aggikkhandho pavattati, heṭṭhimakāyato udakadhārā pavattatī’’ti (paṭi. ma. 1.116) evaṃ ubhayaṃ paññāyittha. Apākaṭapāṭihāriye iddhiyeva paññāyati, na iddhimā. Taṃ mahakasuttena (saṃ. ni. 4.346) ca brahmanimantanikasuttena (ma. ni. 1.501 ādayo) ca dīpetabbaṃ. Tatra hi āyasmato ca mahakassa, bhagavato ca iddhiyeva paññāyittha, na iddhimā."
    ],
    "innerText": "391. Apica sabbampi pākaṭaṃ pāṭihāriyaṃ āvibhāvaṃ nāma. Apākaṭapāṭihāriyaṃ tirobhāvaṃ nāma. Tattha pākaṭapāṭihāriye iddhipi paññāyati iddhimāpi. Taṃ yamakapāṭihāriyena dīpetabbaṃ. Tatra hi ‘‘idha tathāgato yamakapāṭihāriyaṃ karoti asādhāraṇaṃ sāvakehi. Uparimakāyato aggikkhandho pavattati, heṭṭhimakāyato udakadhārā pavattatī’’ti (paṭi. ma. 1.116) evaṃ ubhayaṃ paññāyittha. Apākaṭapāṭihāriye iddhiyeva paññāyati, na iddhimā. Taṃ mahakasuttena (saṃ. ni. 4.346) ca brahmanimantanikasuttena (ma. ni. 1.501 ādayo) ca dīpetabbaṃ. Tatra hi āyasmato ca mahakassa, bhagavato ca iddhiyeva paññāyittha, na iddhimā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Ekamantaṃ nisinno kho citto gahapati āyasmantaṃ mahakaṃ etadavoca ‘sādhu me, bhante, ayyo mahako uttarimanussadhammā iddhipāṭihāriyaṃ dassetū’ti. Tena hi tvaṃ gahapati āḷinde uttarāsaṅgaṃ paññāpetvā tiṇakalāpaṃ okāsehīti. ‘Evaṃ, bhante’ti kho citto gahapati āyasmato mahakassa paṭissutvā āḷinde uttarāsaṅgaṃ paññāpetvā tiṇakalāpaṃ okāsesi. Atha kho āyasmā mahako vihāraṃ pavisitvā tathārūpaṃ iddhābhisaṅkhāraṃ abhisaṅkhāsi, yathā tālacchiggaḷena ca aggaḷantarikāya ca acci nikkhamitvā tiṇāni jhāpesi, uttarāsaṅgaṃ na jhāpesī’’ti (saṃ. ni. 4.346)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathā cāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Atha khvāhaṃ, bhikkhave, tathārūpaṃ iddhābhisaṅkhāraṃ abhisaṅkhāsiṃ ‘ettāvatā brahmā ca brahmaparisā ca brahmapārisajjā ca saddañca me sossanti, na ca maṃ dakkhissantī’ti antarahito imaṃ gāthaṃ abhāsiṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘Bhave ",
      " vāhaṃ bhayaṃ disvā, bhavañca vibhavesinaṃ;"
    ],
    "innerText": "‘Bhave vāhaṃ bhayaṃ disvā, bhavañca vibhavesinaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhavaṃ nābhivadiṃ kiñci, nandiñca na upādiyi’’’nti. (ma. ni. 1.504);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "392"
      },
      ". Tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati seyyathāpi ākāseti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tirokuṭṭa"
      },
      "nti parakuṭṭaṃ, kuṭṭassa parabhāganti vuttaṃ hoti. Esa nayo itaresu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kuṭṭo"
      },
      "ti ca gehabhittiyā etamadhivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pākāro"
      },
      "ti gehavihāragāmādīnaṃ parikkhepapākāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabbato"
      },
      "ti paṃsupabbato vā pāsāṇapabbato vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asajjamāno"
      },
      "ti alaggamāno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seyyathāpi ākāse"
      },
      "ti ākāse viya. Evaṃ gantukāmena pana ākāsakasiṇaṃ samāpajjitvā vuṭṭhāya kuṭṭaṃ vā pākāraṃ vā sinerucakkavāḷesupi aññataraṃ pabbataṃ vā āvajjitvā kataparikammena ākāso hotūti adhiṭṭhātabbo. Ākāsoyeva hoti. Adho otaritukāmassa, uddhaṃ vā ārohitukāmassa susiro hoti, vinivijjhitvā gantukāmassa chiddo. So tattha asajjamāno gacchati."
    ],
    "innerText": "392. Tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati seyyathāpi ākāseti ettha tirokuṭṭanti parakuṭṭaṃ, kuṭṭassa parabhāganti vuttaṃ hoti. Esa nayo itaresu. Kuṭṭoti ca gehabhittiyā etamadhivacanaṃ. Pākāroti gehavihāragāmādīnaṃ parikkhepapākāro. Pabbatoti paṃsupabbato vā pāsāṇapabbato vā. Asajjamānoti alaggamāno. Seyyathāpi ākāseti ākāse viya. Evaṃ gantukāmena pana ākāsakasiṇaṃ samāpajjitvā vuṭṭhāya kuṭṭaṃ vā pākāraṃ vā sinerucakkavāḷesupi aññataraṃ pabbataṃ vā āvajjitvā kataparikammena ākāso hotūti adhiṭṭhātabbo. Ākāsoyeva hoti. Adho otaritukāmassa, uddhaṃ vā ārohitukāmassa susiro hoti, vinivijjhitvā gantukāmassa chiddo. So tattha asajjamāno gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tipiṭakacūḷābhayatthero"
      },
      " panetthāha – ‘‘ākāsakasiṇasamāpajjanaṃ, āvuso, kimatthiyaṃ, kiṃ hatthiassādīni abhinimminitukāmo hatthiassādi kasiṇāni samāpajjati, nanu yattha katthaci kasiṇe parikammaṃ katvā aṭṭhasamāpattivasībhāvoyeva pamāṇaṃ. Yaṃ yaṃ icchati, taṃ tadeva hotī’’ti. Bhikkhū āhaṃsu – ‘‘pāḷiyā, bhante, ākāsakasiṇaṃyeva āgataṃ, tasmā avassametaṃ vattabba’’nti. Tatrāyaṃ pāḷi –"
    ],
    "innerText": "Tipiṭakacūḷābhayatthero panetthāha – ‘‘ākāsakasiṇasamāpajjanaṃ, āvuso, kimatthiyaṃ, kiṃ hatthiassādīni abhinimminitukāmo hatthiassādi kasiṇāni samāpajjati, nanu yattha katthaci kasiṇe parikammaṃ katvā aṭṭhasamāpattivasībhāvoyeva pamāṇaṃ. Yaṃ yaṃ icchati, taṃ tadeva hotī’’ti. Bhikkhū āhaṃsu – ‘‘pāḷiyā, bhante, ākāsakasiṇaṃyeva āgataṃ, tasmā avassametaṃ vattabba’’nti. Tatrāyaṃ pāḷi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Pakatiyā ākāsakasiṇasamāpattiyā lābhī hoti. Tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ āvajjati. Āvajjitvā ñāṇena adhiṭṭhāti – ‘ākāso hotū’ti. Ākāso hoti. Tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati. Yathā manussā pakatiyā aniddhimanto kenaci anāvaṭe aparikkhitte asajjamānā gacchanti, evameva so iddhimā cetovasippatto tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati, seyyathāpi ākāse’’ti (paṭi. ma. 3.11)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sace ",
      " panassa bhikkhuno adhiṭṭhahitvā gacchantassa antarā pabbato vā rukkho vā uṭṭheti, kiṃ puna samāpajjitvā adhiṭṭhātabbanti? Doso natthi. Puna samāpajjitvā adhiṭṭhānaṃ hi ",
      " upajjhāyassa santike nissayaggahaṇasadisaṃ hoti. Iminā ca pana bhikkhunā ākāso hotūti adhiṭṭhitattā ākāso hotiyeva. Purimādhiṭṭhānabaleneva cassa antarā añño pabbato vā rukkho vā utumayo uṭṭhahissatīti aṭṭhānamevetaṃ. Aññena iddhimatā nimmite pana paṭhamanimmānaṃ balavaṃ hoti. Itarena tassa uddhaṃ vā adho vā gantabbaṃ."
    ],
    "innerText": "Sace panassa bhikkhuno adhiṭṭhahitvā gacchantassa antarā pabbato vā rukkho vā uṭṭheti, kiṃ puna samāpajjitvā adhiṭṭhātabbanti? Doso natthi. Puna samāpajjitvā adhiṭṭhānaṃ hi upajjhāyassa santike nissayaggahaṇasadisaṃ hoti. Iminā ca pana bhikkhunā ākāso hotūti adhiṭṭhitattā ākāso hotiyeva. Purimādhiṭṭhānabaleneva cassa antarā añño pabbato vā rukkho vā utumayo uṭṭhahissatīti aṭṭhānamevetaṃ. Aññena iddhimatā nimmite pana paṭhamanimmānaṃ balavaṃ hoti. Itarena tassa uddhaṃ vā adho vā gantabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "393"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pathaviyāpi ummujjanimujja"
      },
      "nti ettha ummujjanti uṭṭhānaṃ vuccati. Nimujjanti saṃsīdanaṃ. Ummujjañca nimujjañca ummujjanimujjaṃ. Evaṃ kātukāmena āpokasiṇaṃ samāpajjitvā uṭṭhāya ettake ṭhāne pathavī udakaṃ hotūti paricchinditvā parikammaṃ katvā vuttanayeneva adhiṭṭhātabbaṃ. Saha adhiṭṭhānena yathā paricchinne ṭhāne pathavī udakameva hoti. So tattha ummujjanimujjaṃ karoti. Tatrāyaṃ pāḷi –"
    ],
    "innerText": "393.Pathaviyāpi ummujjanimujjanti ettha ummujjanti uṭṭhānaṃ vuccati. Nimujjanti saṃsīdanaṃ. Ummujjañca nimujjañca ummujjanimujjaṃ. Evaṃ kātukāmena āpokasiṇaṃ samāpajjitvā uṭṭhāya ettake ṭhāne pathavī udakaṃ hotūti paricchinditvā parikammaṃ katvā vuttanayeneva adhiṭṭhātabbaṃ. Saha adhiṭṭhānena yathā paricchinne ṭhāne pathavī udakameva hoti. So tattha ummujjanimujjaṃ karoti. Tatrāyaṃ pāḷi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Pakatiyā āpokasiṇasamāpattiyā lābhī hoti. Pathaviṃ āvajjati. Āvajjitvā ñāṇena adhiṭṭhāti – ‘udakaṃ hotū’ti. Udakaṃ hoti. So pathaviyā ummujjanimujjaṃ karoti. Yathā manussā pakatiyā aniddhimanto udake ummujjanimujjaṃ karonti, evameva so iddhimā cetovasippatto pathaviyā ummujjanimujjaṃ karoti, seyyathāpi udake’’ti (paṭi. ma. 3.11)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na kevalañca ummujjanimujjameva, nhānapānamukhadhovanabhaṇḍakadhovanādīsu yaṃ yaṃ icchati, taṃ taṃ karoti. Na kevalañca udakameva, sappitelamadhuphāṇitādīsupi yaṃ yaṃ icchati, taṃ taṃ idañcidañca ettakaṃ hotūti āvajjitvā parikammaṃ katvā adhiṭṭhahantassa yathādhiṭṭhitameva hoti. Uddharitvā bhājanagataṃ karontassa sappi sappimeva hoti. Telādīni telādīniyeva. Udakaṃ udakameva. So tattha temitukāmova temeti, na temitukāmo na temeti. Tasseva ca sā pathavī udakaṃ hoti sesajanassa pathavīyeva. Tattha manussā pattikāpi gacchanti, yānādīhipi gacchanti, kasikammādīnipi karontiyeva. Sace panāyaṃ tesampi udakaṃ hotūti ",
      " icchati, hotiyeva. Paricchinnakālaṃ pana atikkamitvā yaṃ pakatiyā ghaṭataḷākādīsu udakaṃ, taṃ ṭhapetvā avasesaṃ paricchinnaṭṭhānaṃ pathavīyeva hoti."
    ],
    "innerText": "Na kevalañca ummujjanimujjameva, nhānapānamukhadhovanabhaṇḍakadhovanādīsu yaṃ yaṃ icchati, taṃ taṃ karoti. Na kevalañca udakameva, sappitelamadhuphāṇitādīsupi yaṃ yaṃ icchati, taṃ taṃ idañcidañca ettakaṃ hotūti āvajjitvā parikammaṃ katvā adhiṭṭhahantassa yathādhiṭṭhitameva hoti. Uddharitvā bhājanagataṃ karontassa sappi sappimeva hoti. Telādīni telādīniyeva. Udakaṃ udakameva. So tattha temitukāmova temeti, na temitukāmo na temeti. Tasseva ca sā pathavī udakaṃ hoti sesajanassa pathavīyeva. Tattha manussā pattikāpi gacchanti, yānādīhipi gacchanti, kasikammādīnipi karontiyeva. Sace panāyaṃ tesampi udakaṃ hotūti icchati, hotiyeva. Paricchinnakālaṃ pana atikkamitvā yaṃ pakatiyā ghaṭataḷākādīsu udakaṃ, taṃ ṭhapetvā avasesaṃ paricchinnaṭṭhānaṃ pathavīyeva hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "394"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Udakepi abhijjamāne"
      },
      "ti ettha yaṃ udakaṃ akkamitvā saṃsīdati, taṃ bhijjamānanti ",
      " vuccati. Viparītaṃ abhijjamānaṃ. Evaṃ gantukāmena pana pathavīkasiṇaṃ samāpajjitvā vuṭṭhāya ettake ṭhāne udakaṃ pathavī hotūti paricchinditvā parikammaṃ katvā vuttanayeneva adhiṭṭhātabbaṃ. Saha adhiṭṭhānena yathā paricchinnaṭṭhāne udakaṃ pathavīyeva hoti. So tattha gacchati, tatrāyaṃ pāḷi –"
    ],
    "innerText": "394.Udakepi abhijjamāneti ettha yaṃ udakaṃ akkamitvā saṃsīdati, taṃ bhijjamānanti vuccati. Viparītaṃ abhijjamānaṃ. Evaṃ gantukāmena pana pathavīkasiṇaṃ samāpajjitvā vuṭṭhāya ettake ṭhāne udakaṃ pathavī hotūti paricchinditvā parikammaṃ katvā vuttanayeneva adhiṭṭhātabbaṃ. Saha adhiṭṭhānena yathā paricchinnaṭṭhāne udakaṃ pathavīyeva hoti. So tattha gacchati, tatrāyaṃ pāḷi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Pakatiyā pathavīkasiṇasamāpattiyā lābhī hoti. Udakaṃ āvajjati. Āvajjitvā ñāṇena adhiṭṭhāti – ‘pathavī hotū’ti. Pathavī hoti. So abhijjamāne udake gacchati. Yathā manussā pakatiyā aniddhimanto abhijjamānāya pathaviyā gacchanti, evameva so iddhimā cetovasippatto abhijjamāne udake gacchati, seyyathāpi pathaviya’’nti (paṭi. ma. 3.11)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na kevalañca gacchati, yaṃ yaṃ iriyāpathaṃ icchati, taṃ taṃ karoti. Na kevalañca pathavimeva karoti, maṇisuvaṇṇapabbatarukkhādīsupi yaṃ yaṃ icchati, taṃ taṃ vuttanayeneva āvajjitvā adhiṭṭhāti, yathādhiṭṭhitameva hoti. Tasseva ca taṃ udakaṃ pathavī hoti, sesajanassa udakameva, macchakacchapā ca udakakākādayo ca yathāruci vicaranti. Sace panāyaṃ aññesampi manussānaṃ taṃ pathaviṃ kātuṃ icchati, karotiyeva. Paricchinnakālātikkamena pana udakameva hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "395"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pallaṅkena kamatī"
      },
      "ti pallaṅkena gacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakkhī sakuṇo"
      },
      "ti pakkhehi yuttasakuṇo. Evaṃ kātukāmena pana pathavīkasiṇaṃ samāpajjitvā vuṭṭhāya sace nisinno gantumicchati, pallaṅkappamāṇaṃ ṭhānaṃ paricchinditvā parikammaṃ katvā vuttanayeneva adhiṭṭhātabbaṃ. Sace nipanno gantukāmo hoti mañcappamāṇaṃ, sace padasā gantukāmo hoti maggappamāṇanti evaṃ yathānurūpaṃ ṭhānaṃ paricchinditvā vuttanayeneva pathavī hotūti adhiṭṭhātabbaṃ, saha adhiṭṭhānena pathavīyeva hoti. Tatrāyaṃ pāḷi –"
    ],
    "innerText": "395.Pallaṅkena kamatīti pallaṅkena gacchati. Pakkhī sakuṇoti pakkhehi yuttasakuṇo. Evaṃ kātukāmena pana pathavīkasiṇaṃ samāpajjitvā vuṭṭhāya sace nisinno gantumicchati, pallaṅkappamāṇaṃ ṭhānaṃ paricchinditvā parikammaṃ katvā vuttanayeneva adhiṭṭhātabbaṃ. Sace nipanno gantukāmo hoti mañcappamāṇaṃ, sace padasā gantukāmo hoti maggappamāṇanti evaṃ yathānurūpaṃ ṭhānaṃ paricchinditvā vuttanayeneva pathavī hotūti adhiṭṭhātabbaṃ, saha adhiṭṭhānena pathavīyeva hoti. Tatrāyaṃ pāḷi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Ākāsepi ",
      " pallaṅkena kamati, seyyathāpi pakkhī sakuṇoti. Pakatiyā pathavīkasiṇasamāpattiyā lābhī hoti, ākāsaṃ āvajjati. Āvajjitvā ñāṇena adhiṭṭhāti – ‘pathavī hotū’ti. Pathavī hoti. So ākāse antalikkhe caṅkamatipi tiṭṭhatipi ",
      " nisīdatipi seyyampi kappeti. Yathā manussā pakatiyā aniddhimanto pathaviyaṃ caṅkamantipi…pe… seyyampi kappenti, evameva so iddhimā cetovasippatto ākāse antalikkhe caṅkamatipi…pe… seyyampi kappetī’’ti (paṭi. ma. 3.11)."
    ],
    "innerText": "‘‘Ākāsepi pallaṅkena kamati, seyyathāpi pakkhī sakuṇoti. Pakatiyā pathavīkasiṇasamāpattiyā lābhī hoti, ākāsaṃ āvajjati. Āvajjitvā ñāṇena adhiṭṭhāti – ‘pathavī hotū’ti. Pathavī hoti. So ākāse antalikkhe caṅkamatipi tiṭṭhatipi nisīdatipi seyyampi kappeti. Yathā manussā pakatiyā aniddhimanto pathaviyaṃ caṅkamantipi…pe… seyyampi kappenti, evameva so iddhimā cetovasippatto ākāse antalikkhe caṅkamatipi…pe… seyyampi kappetī’’ti (paṭi. ma. 3.11)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ākāse gantukāmena ca bhikkhunā dibbacakkhulābhināpi bhavitabbaṃ. Kasmā? Antare utusamuṭṭhānā vā pabbatarukkhādayo honti, nāgasupaṇṇādayo vā usūyantā māpenti, nesaṃ dassanatthaṃ. Te pana disvā kiṃ kātabbanti? Pādakajjhānaṃ samāpajjitvā vuṭṭhāya ākāso hotūti parikammaṃ katvā adhiṭṭhātabbaṃ. Thero panāha ‘‘samāpattisamāpajjanaṃ, āvuso, kimatthiyaṃ, nanu samāhitamevassa cittaṃ, tena yaṃ yaṃ ṭhānaṃ ākāso hotūti adhiṭṭhāti, ākāsoyeva hotī’’ti. Kiñcāpi evamāha, atha kho tirokuṭṭapārihāriye vuttanayeneva paṭipajjitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Apica okāse orohaṇatthampi iminā dibbacakkhulābhinā bhavitabbaṃ, ayañhi sace anokāse nhānatitthe vā gāmadvāre vā orohati. Mahājanassa pākaṭo hoti. Tasmā dibbacakkhunā passitvā anokāsaṃ vajjetvā okāse otaratīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "396"
      },
      ". Imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parāmasati parimajjatīti ettha candimasūriyānaṃ dvācattālīsayojanasahassassa upari caraṇena mahiddhikatā, tīsu dīpesu ekakkhaṇe ālokakaraṇena mahānubhāvatā veditabbā. Evaṃ upari caraṇaālokakaraṇehi vā mahiddhike teneva mahānubhāve. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parāmasatī"
      },
      "ti pariggaṇhati ekadese vā chupati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parimajjatī"
      },
      "ti samantato ādāsatalaṃ viya parimajjati. Ayaṃ panassa iddhi abhiññāpādakajjhānavaseneva ijjhati, natthettha kasiṇasamāpattiniyamo. Vuttañhetaṃ paṭisambhidāyaṃ –"
    ],
    "innerText": "396. Imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parāmasati parimajjatīti ettha candimasūriyānaṃ dvācattālīsayojanasahassassa upari caraṇena mahiddhikatā, tīsu dīpesu ekakkhaṇe ālokakaraṇena mahānubhāvatā veditabbā. Evaṃ upari caraṇaālokakaraṇehi vā mahiddhike teneva mahānubhāve. Parāmasatīti pariggaṇhati ekadese vā chupati. Parimajjatīti samantato ādāsatalaṃ viya parimajjati. Ayaṃ panassa iddhi abhiññāpādakajjhānavaseneva ijjhati, natthettha kasiṇasamāpattiniyamo. Vuttañhetaṃ paṭisambhidāyaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Imepi ",
      " candimasūriye…pe… parimajjatīti idha so iddhimā cetovasippatto candimasūriye āvajjati, āvajjitvā ñāṇena adhiṭṭhāti – ‘hatthapāse hotū’ti. Hatthapāse hoti. So nisinnako vā nipannako vā candimasūriye pāṇinā āmasati parāmasati parimajjati. Yathā manussā pakatiyā aniddhimanto kiñcideva rūpagataṃ hatthapāse ",
      " āmasanti parāmasanti parimajjanti, evameva so iddhimā…pe… parimajjatī’’ti (paṭi. ma. 3.12)."
    ],
    "innerText": "‘‘Imepi candimasūriye…pe… parimajjatīti idha so iddhimā cetovasippatto candimasūriye āvajjati, āvajjitvā ñāṇena adhiṭṭhāti – ‘hatthapāse hotū’ti. Hatthapāse hoti. So nisinnako vā nipannako vā candimasūriye pāṇinā āmasati parāmasati parimajjati. Yathā manussā pakatiyā aniddhimanto kiñcideva rūpagataṃ hatthapāse āmasanti parāmasanti parimajjanti, evameva so iddhimā…pe… parimajjatī’’ti (paṭi. ma. 3.12)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Svāyaṃ yadi icchati gantvā parāmasituṃ, gantvā parāmasati, yadi pana idheva nisinnako vā nipannako vā parāmasitukāmo hoti, hatthapāse hotūti adhiṭṭhāti, adhiṭṭhānabalena vaṇṭā muttatālaphalaṃ viya āgantvā hatthapāse ṭhite vā parāmasati, hatthaṃ vā vaḍḍhetvā. Vaḍḍhentassa pana kiṃ upādiṇṇakaṃ vaḍḍhati, anupādiṇṇakanti? Upādiṇṇakaṃ nissāya anupādiṇṇakaṃ vaḍḍhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tipiṭakacūḷanāgatthero"
      },
      " āha ‘‘kiṃ panāvuso, upādiṇṇakaṃ khuddakampi mahantampi na hoti, nanu yadā bhikkhu tālacchiddādīhi nikkhamati, tadā upādiṇṇakaṃ khuddakaṃ hoti. Yadā mahantaṃ attabhāvaṃ karoti, tadā mahantaṃ hoti mahāmoggallānattherassa viyā’’ti."
    ],
    "innerText": "Tattha tipiṭakacūḷanāgatthero āha ‘‘kiṃ panāvuso, upādiṇṇakaṃ khuddakampi mahantampi na hoti, nanu yadā bhikkhu tālacchiddādīhi nikkhamati, tadā upādiṇṇakaṃ khuddakaṃ hoti. Yadā mahantaṃ attabhāvaṃ karoti, tadā mahantaṃ hoti mahāmoggallānattherassa viyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nandopanandanāgadamanakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekasmiṃ kira samaye anāthapiṇḍiko gahapati bhagavato dhammadesanaṃ sutvā ‘‘sve, bhante, pañcahi bhikkhusatehi saddhiṃ amhākaṃ gehe bhikkhaṃ gaṇhathā’’ti nimantetvā pakkami. Bhagavā adhivāsetvā taṃdivasāvasesaṃ rattibhāgañca vītināmetvā paccūsasamaye dasasahassilokadhātuṃ olokesi. Athassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nandopanando"
      },
      " nāma nāgarājā ñāṇamukhe āpāthamāgacchi. Bhagavā ‘‘ayaṃ nāgarājā mayhaṃ ñāṇamukhe āpāthamāgacchi, atthi nu kho assa upanissayo’’ti āvajjento ‘‘ayaṃ micchādiṭṭhiko tīsu ratanesu appasannoti disvā ko nu kho imaṃ micchādiṭṭhito viveceyyā’’ti āvajjento mahāmoggallānattheraṃ addasa."
    ],
    "innerText": "Ekasmiṃ kira samaye anāthapiṇḍiko gahapati bhagavato dhammadesanaṃ sutvā ‘‘sve, bhante, pañcahi bhikkhusatehi saddhiṃ amhākaṃ gehe bhikkhaṃ gaṇhathā’’ti nimantetvā pakkami. Bhagavā adhivāsetvā taṃdivasāvasesaṃ rattibhāgañca vītināmetvā paccūsasamaye dasasahassilokadhātuṃ olokesi. Athassa nandopanando nāma nāgarājā ñāṇamukhe āpāthamāgacchi. Bhagavā ‘‘ayaṃ nāgarājā mayhaṃ ñāṇamukhe āpāthamāgacchi, atthi nu kho assa upanissayo’’ti āvajjento ‘‘ayaṃ micchādiṭṭhiko tīsu ratanesu appasannoti disvā ko nu kho imaṃ micchādiṭṭhito viveceyyā’’ti āvajjento mahāmoggallānattheraṃ addasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato ",
      " pabhātāya rattiyā sarīrapaṭijagganaṃ katvā āyasmantaṃ ānandaṃ āmantesi – ‘‘ānanda, pañcannaṃ bhikkhusatānaṃ ārocehi tathāgato devacārikaṃ gacchatī’’ti. Taṃ divasañca nandopanandassa āpānabhūmiṃ sajjayiṃsu. So dibbaratanapallaṅke dibbena setacchattena dhāriyamānena tividhanāṭakehi ceva nāgaparisāya ca parivuto dibbabhājanesu upaṭṭhāpitaṃ annapānavidhiṃ olokayamāno nisinno hoti. Atha bhagavā yathā nāgarājā passati, tathā katvā tassa vitānamatthakeneva pañcahi bhikkhusatehi saddhiṃ tāvatiṃsadevalokābhimukho pāyāsi."
    ],
    "innerText": "Tato pabhātāya rattiyā sarīrapaṭijagganaṃ katvā āyasmantaṃ ānandaṃ āmantesi – ‘‘ānanda, pañcannaṃ bhikkhusatānaṃ ārocehi tathāgato devacārikaṃ gacchatī’’ti. Taṃ divasañca nandopanandassa āpānabhūmiṃ sajjayiṃsu. So dibbaratanapallaṅke dibbena setacchattena dhāriyamānena tividhanāṭakehi ceva nāgaparisāya ca parivuto dibbabhājanesu upaṭṭhāpitaṃ annapānavidhiṃ olokayamāno nisinno hoti. Atha bhagavā yathā nāgarājā passati, tathā katvā tassa vitānamatthakeneva pañcahi bhikkhusatehi saddhiṃ tāvatiṃsadevalokābhimukho pāyāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena nandopanandassa nāgarājassa evarūpaṃ pāpakaṃ diṭṭhigataṃ uppannaṃ hoti – ‘‘ime hi nāma muṇḍakā samaṇakā amhākaṃ uparūparibhavanena devānaṃ tāvatiṃsānaṃ bhavanaṃ pavisantipi nikkhamantipi, na dāni ito paṭṭhāya imesaṃ amhākaṃ matthake pādapaṃsuṃ okirantānaṃ gantuṃ dassāmī’’ti uṭṭhāya sinerupādaṃ gantvā taṃ attabhāvaṃ vijahitvā sineruṃ sattakkhattuṃ bhogehi parikkhipitvā upari phaṇaṃ katvā tāvatiṃsabhavanaṃ avakujjena phaṇena gahetvā adassanaṃ gamesi."
    ],
    "innerText": "Tena kho pana samayena nandopanandassa nāgarājassa evarūpaṃ pāpakaṃ diṭṭhigataṃ uppannaṃ hoti – ‘‘ime hi nāma muṇḍakā samaṇakā amhākaṃ uparūparibhavanena devānaṃ tāvatiṃsānaṃ bhavanaṃ pavisantipi nikkhamantipi, na dāni ito paṭṭhāya imesaṃ amhākaṃ matthake pādapaṃsuṃ okirantānaṃ gantuṃ dassāmī’’ti uṭṭhāya sinerupādaṃ gantvā taṃ attabhāvaṃ vijahitvā sineruṃ sattakkhattuṃ bhogehi parikkhipitvā upari phaṇaṃ katvā tāvatiṃsabhavanaṃ avakujjena phaṇena gahetvā adassanaṃ gamesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho āyasmā raṭṭhapālo bhagavantaṃ etadavoca ‘‘pubbe, bhante, imasmiṃ padese ṭhito sineruṃ passāmi, sineruparibhaṇḍaṃ passāmi, tāvatiṃsaṃ passāmi, vejayantaṃ passāmi, vejayantassa pāsādassa upari dhajaṃ passāmi. Ko nu kho, bhante, hetu ko paccayo, yaṃ etarahi neva sineruṃ passāmi…pe… na vejayantassa pāsādassa upari dhajaṃ passāmī’’ti. ‘‘Ayaṃ, raṭṭhapāla, nandopanando nāma nāgarājā tumhākaṃ kupito sineruṃ sattakkhattuṃ bhogehi parikkhipitvā upari phaṇena paṭicchādetvā andhakāraṃ katvā ṭhito’’ti. ‘‘Damemi naṃ, bhante’’ti. Na bhagavā anujāni. Atha kho āyasmā bhaddiyo āyasmā rāhuloti anukkamena sabbepi bhikkhū uṭṭhahiṃsu. Na bhagavā anujāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Avasāne mahāmoggallānatthero ‘‘ahaṃ, bhante, damemi na’’nti āha. ‘‘Damehi moggallānā’’ti bhagavā anujāni. Thero attabhāvaṃ vijahitvā mahantaṃ nāgarājavaṇṇaṃ abhinimminitvā nandopanandaṃ cuddasakkhattuṃ bhogehi parikkhipitvā tassa phaṇamatthake attano phaṇaṃ ṭhapetvā sinerunā ",
      " saddhiṃ abhinippīḷesi. Nāgarājā padhūmāyi. Theropi na tuyhaṃyeva sarīre dhūmo atthi, mayhampi atthīti padhūmāyi. Nāgarājassa dhūmo theraṃ na bādhati. Therassa pana dhūmo nāgarājānaṃ bādhati. Tato nāgarājā pajjali. Theropi na tuyhaṃyeva sarīre aggi atthi, mayhampi atthīti pajjali. Nāgarājassa tejo theraṃ na bādhati. Therassa pana tejo nāgarājānaṃ bādhati. Nāgarājā ayaṃ maṃ sinerunā abhinippīḷetvā dhūmāyati ceva pajjalati cāti cintetvā ‘‘bho tvaṃ kosī’’ti paṭipucchi. ‘‘Ahaṃ kho, nanda, moggallāno’’ti. ‘‘Bhante, attano bhikkhubhāvena tiṭṭhāhī’’ti."
    ],
    "innerText": "Avasāne mahāmoggallānatthero ‘‘ahaṃ, bhante, damemi na’’nti āha. ‘‘Damehi moggallānā’’ti bhagavā anujāni. Thero attabhāvaṃ vijahitvā mahantaṃ nāgarājavaṇṇaṃ abhinimminitvā nandopanandaṃ cuddasakkhattuṃ bhogehi parikkhipitvā tassa phaṇamatthake attano phaṇaṃ ṭhapetvā sinerunā saddhiṃ abhinippīḷesi. Nāgarājā padhūmāyi. Theropi na tuyhaṃyeva sarīre dhūmo atthi, mayhampi atthīti padhūmāyi. Nāgarājassa dhūmo theraṃ na bādhati. Therassa pana dhūmo nāgarājānaṃ bādhati. Tato nāgarājā pajjali. Theropi na tuyhaṃyeva sarīre aggi atthi, mayhampi atthīti pajjali. Nāgarājassa tejo theraṃ na bādhati. Therassa pana tejo nāgarājānaṃ bādhati. Nāgarājā ayaṃ maṃ sinerunā abhinippīḷetvā dhūmāyati ceva pajjalati cāti cintetvā ‘‘bho tvaṃ kosī’’ti paṭipucchi. ‘‘Ahaṃ kho, nanda, moggallāno’’ti. ‘‘Bhante, attano bhikkhubhāvena tiṭṭhāhī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Thero taṃ attabhāvaṃ vijahitvā tassa dakkhiṇakaṇṇasotena pavisitvā vāmakaṇṇasotena nikkhami ",
      ", vāmakaṇṇasotena pavisitvā dakkhiṇakaṇṇasotena nikkhami, tathā dakkhiṇanāsasotena pavisitvā vāmanāsasotena nikkhami, vāmanāsasotena pavisitvā dakkhiṇanāsasotena nikkhami. Tato nāgarājā mukhaṃ vivari. Thero mukhena pavisitvā antokucchiyaṃ pācīnena ca pacchimena ca caṅkamati. Bhagavā ‘‘moggallāna, manasikarohi mahiddhiko esa nāgo’’ti āha. Thero ‘‘mayhaṃ kho, bhante, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, tiṭṭhatu, bhante, nandopanando, ahaṃ nandopanandasadisānaṃ nāgarājānaṃ satampi sahassampi satasahassampi dameyya’’nti āha."
    ],
    "innerText": "Thero taṃ attabhāvaṃ vijahitvā tassa dakkhiṇakaṇṇasotena pavisitvā vāmakaṇṇasotena nikkhami , vāmakaṇṇasotena pavisitvā dakkhiṇakaṇṇasotena nikkhami, tathā dakkhiṇanāsasotena pavisitvā vāmanāsasotena nikkhami, vāmanāsasotena pavisitvā dakkhiṇanāsasotena nikkhami. Tato nāgarājā mukhaṃ vivari. Thero mukhena pavisitvā antokucchiyaṃ pācīnena ca pacchimena ca caṅkamati. Bhagavā ‘‘moggallāna, manasikarohi mahiddhiko esa nāgo’’ti āha. Thero ‘‘mayhaṃ kho, bhante, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, tiṭṭhatu, bhante, nandopanando, ahaṃ nandopanandasadisānaṃ nāgarājānaṃ satampi sahassampi satasahassampi dameyya’’nti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nāgarājā cintesi ‘‘pavisanto tāva me na diṭṭho, nikkhamanakāle dāni naṃ dāṭhantare pakkhipitvā saṅkhādissāmī’’ti cintetvā nikkhama bhante, mā maṃ antokucchiyaṃ aparāparaṃ caṅkamanto bādhayitthāti āha. Thero nikkhamitvā bahi aṭṭhāsi. Nāgarājā ayaṃ soti disvā nāsavātaṃ vissajji. Thero catutthaṃ jhānaṃ samāpajji. Lomakūpampissa vāto cāletuṃ nāsakkhi. Avasesā bhikkhū kira ādito paṭṭhāya sabbapāṭihāriyāni kātuṃ sakkuṇeyyuṃ, imaṃ pana ṭhānaṃ patvā evaṃ khippanisantino hutvā samāpajjituṃ na sakkhissantīti tesaṃ bhagavā nāgarājadamanaṃ nānujāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nāgarājā ",
      " ‘‘ahaṃ imassa samaṇassa nāsavātena lomakūpampi cāletuṃ nāsakkhiṃ, mahiddhiko samaṇo’’ti cintesi. Thero attabhāvaṃ vijahitvā supaṇṇarūpaṃ abhinimminitvā supaṇṇavātaṃ dassento nāgarājānaṃ anubandhi. Nāgarājā taṃ attabhāvaṃ vijahitvā māṇavakavaṇṇaṃ abhinimminitvā ‘‘bhante, tumhākaṃ saraṇaṃ gacchāmī’’ti vadanto therassa pāde vandi. Thero ‘‘satthā, nanda, āgato, ehi gamissāmā’’ti nāgarājānaṃ damayitvā nibbisaṃ katvā gahetvā bhagavato santikaṃ agamāsi. Nāgarājā bhagavantaṃ vanditvā ‘‘bhante, tumhākaṃ saraṇaṃ gacchāmī’’ti āha. Bhagavā ‘‘sukhī hohi, nāgarājā’’ti vatvā bhikkhusaṅghaparivuto anāthapiṇḍikassa nivesanaṃ agamāsi."
    ],
    "innerText": "Nāgarājā ‘‘ahaṃ imassa samaṇassa nāsavātena lomakūpampi cāletuṃ nāsakkhiṃ, mahiddhiko samaṇo’’ti cintesi. Thero attabhāvaṃ vijahitvā supaṇṇarūpaṃ abhinimminitvā supaṇṇavātaṃ dassento nāgarājānaṃ anubandhi. Nāgarājā taṃ attabhāvaṃ vijahitvā māṇavakavaṇṇaṃ abhinimminitvā ‘‘bhante, tumhākaṃ saraṇaṃ gacchāmī’’ti vadanto therassa pāde vandi. Thero ‘‘satthā, nanda, āgato, ehi gamissāmā’’ti nāgarājānaṃ damayitvā nibbisaṃ katvā gahetvā bhagavato santikaṃ agamāsi. Nāgarājā bhagavantaṃ vanditvā ‘‘bhante, tumhākaṃ saraṇaṃ gacchāmī’’ti āha. Bhagavā ‘‘sukhī hohi, nāgarājā’’ti vatvā bhikkhusaṅghaparivuto anāthapiṇḍikassa nivesanaṃ agamāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anāthapiṇḍiko ‘‘kiṃ, bhante, atidivā āgatatthā’’ti āha. Moggallānassa ca nandopanandassa ca saṅgāmo ahosīti. Kassa, bhante, jayo, kassa parājayoti. Moggallānassa jayo, nandassa parājayoti. Anāthapiṇḍiko ‘‘adhivāsetu me, bhante, bhagavā sattāhaṃ ",
      " ekapaṭipāṭiyā bhattaṃ, sattāhaṃ therassa sakkāraṃ karissāmī’’ti vatvā sattāhaṃ buddhapamukhānaṃ pañcannaṃ bhikkhusatānaṃ mahāsakkāraṃ akāsi. Iti imaṃ imasmiṃ nandopanandadamane kataṃ mahantaṃ attabhāvaṃ sandhāyetaṃ vuttaṃ ‘‘yadā mahantaṃ attabhāvaṃ karoti, tadā mahantaṃ hoti mahāmoggallānattherassa viyā’’ti. Evaṃ vuttepi bhikkhū upādiṇṇakaṃ nissāya anupādiṇṇakameva vaḍḍhatīti āhaṃsu. Ayameva cettha yutti."
    ],
    "innerText": "Anāthapiṇḍiko ‘‘kiṃ, bhante, atidivā āgatatthā’’ti āha. Moggallānassa ca nandopanandassa ca saṅgāmo ahosīti. Kassa, bhante, jayo, kassa parājayoti. Moggallānassa jayo, nandassa parājayoti. Anāthapiṇḍiko ‘‘adhivāsetu me, bhante, bhagavā sattāhaṃ ekapaṭipāṭiyā bhattaṃ, sattāhaṃ therassa sakkāraṃ karissāmī’’ti vatvā sattāhaṃ buddhapamukhānaṃ pañcannaṃ bhikkhusatānaṃ mahāsakkāraṃ akāsi. Iti imaṃ imasmiṃ nandopanandadamane kataṃ mahantaṃ attabhāvaṃ sandhāyetaṃ vuttaṃ ‘‘yadā mahantaṃ attabhāvaṃ karoti, tadā mahantaṃ hoti mahāmoggallānattherassa viyā’’ti. Evaṃ vuttepi bhikkhū upādiṇṇakaṃ nissāya anupādiṇṇakameva vaḍḍhatīti āhaṃsu. Ayameva cettha yutti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So evaṃ katvā na kevalaṃ candimasūriye parāmasati. Sace icchati pādakathalikaṃ katvā pāde ṭhapeti, pīṭhaṃ katvā nisīdati, mañcaṃ katvā nipajjati, apassenaphalakaṃ katvā apassayati. Yathā ca eko, evaṃ aparopi. Anekesupi hi bhikkhusatasahassesu evaṃ karontesu tesañca ekamekassa tatheva ijjhati. Candimasūriyānañca gamanampi ālokakaraṇampi tatheva hoti. Yathā hi pātisahassesu udakapūresu sabbapātīsu ca candamaṇḍalāni dissanti. Pākatikameva ca candassa gamanaṃ ālokakaraṇañca hoti. Tathūpamametaṃ pāṭihāriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "397"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāva brahmalokāpī"
      },
      "ti brahmalokampi paricchedaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyena vasaṃ vattetī"
      },
      "ti tattha brahmaloke kāyena attano vasaṃ vatteti. Tassattho pāḷiṃ anugantvā veditabbo. Ayañhettha pāḷi –"
    ],
    "innerText": "397.Yāva brahmalokāpīti brahmalokampi paricchedaṃ katvā. Kāyena vasaṃ vattetīti tattha brahmaloke kāyena attano vasaṃ vatteti. Tassattho pāḷiṃ anugantvā veditabbo. Ayañhettha pāḷi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Yāva ",
      " brahmalokāpi kāyena vasaṃ vattetīti. Sace so iddhimā cetovasippatto brahmalokaṃ gantukāmo hoti, dūrepi santike adhiṭṭhāti santike hotūti, santike hoti. Santikepi dūre adhiṭṭhāti dūre hotūti, dūre hoti. Bahukampi thokanti adhiṭṭhāti thokaṃ hotūti, thokaṃ hoti. Thokampi bahukanti adhiṭṭhāti bahukaṃ hotūti, bahukaṃ hoti. Dibbena cakkhunā tassa brahmuno rūpaṃ passati. Dibbāya sotadhātuyā tassa brahmuno saddaṃ suṇāti. Cetopariyañāṇena tassa brahmuno cittaṃ pajānāti. Sace so iddhimā cetovasippatto dissamānena kāyena brahmalokaṃ gantukāmo hoti, kāyavasena cittaṃ pariṇāmeti, kāyavasena cittaṃ adhiṭṭhāti, kāyavasena cittaṃ pariṇāmetvā kāyavasena cittaṃ adhiṭṭhahitvā sukhasaññañca lahusaññañca okkamitvā dissamānena kāyena brahmalokaṃ gacchati. Sace so iddhimā cetovasippatto adissamānena kāyena brahmalokaṃ gantukāmo hoti, cittavasena kāyaṃ pariṇāmeti, cittavasena ",
      " kāyaṃ adhiṭṭhāti. Cittavasena kāyaṃ pariṇāmetvā cittavasena kāyaṃ adhiṭṭhahitvā sukhasaññañca lahusaññañca okkamitvā adissamānena kāyena brahmalokaṃ gacchati. So tassa brahmuno purato rūpaṃ abhinimmināti manomayaṃ sabbaṅgapañcaṅgiṃ ahīnindriyaṃ. Sace so iddhimā caṅkamati, nimmitopi tattha caṅkamati. Sace so iddhimā tiṭṭhati, nisīdati, seyyaṃ kappeti, nimmitopi tattha seyyaṃ kappeti. Sace so iddhimā dhūmāyati, pajjalati, dhammaṃ bhāsati, pañhaṃ pucchati, pañhaṃ puṭṭho vissajjeti, nimmitopi tattha pañhaṃ puṭṭho vissajjeti. Sace so iddhimā tena brahmunā saddhiṃ santiṭṭhati, sallapati, sākacchaṃ samāpajjati, nimmitopi tattha tena brahmunā saddhiṃ santiṭṭhati, sallapati, sākacchaṃ samāpajjati. Yaṃ yadeva hi so iddhimā karoti, taṃ tadeva nimmito karotī’’ti (paṭi. ma. 3.12)."
    ],
    "innerText": "‘‘Yāva brahmalokāpi kāyena vasaṃ vattetīti. Sace so iddhimā cetovasippatto brahmalokaṃ gantukāmo hoti, dūrepi santike adhiṭṭhāti santike hotūti, santike hoti. Santikepi dūre adhiṭṭhāti dūre hotūti, dūre hoti. Bahukampi thokanti adhiṭṭhāti thokaṃ hotūti, thokaṃ hoti. Thokampi bahukanti adhiṭṭhāti bahukaṃ hotūti, bahukaṃ hoti. Dibbena cakkhunā tassa brahmuno rūpaṃ passati. Dibbāya sotadhātuyā tassa brahmuno saddaṃ suṇāti. Cetopariyañāṇena tassa brahmuno cittaṃ pajānāti. Sace so iddhimā cetovasippatto dissamānena kāyena brahmalokaṃ gantukāmo hoti, kāyavasena cittaṃ pariṇāmeti, kāyavasena cittaṃ adhiṭṭhāti, kāyavasena cittaṃ pariṇāmetvā kāyavasena cittaṃ adhiṭṭhahitvā sukhasaññañca lahusaññañca okkamitvā dissamānena kāyena brahmalokaṃ gacchati. Sace so iddhimā cetovasippatto adissamānena kāyena brahmalokaṃ gantukāmo hoti, cittavasena kāyaṃ pariṇāmeti, cittavasena kāyaṃ adhiṭṭhāti. Cittavasena kāyaṃ pariṇāmetvā cittavasena kāyaṃ adhiṭṭhahitvā sukhasaññañca lahusaññañca okkamitvā adissamānena kāyena brahmalokaṃ gacchati. So tassa brahmuno purato rūpaṃ abhinimmināti manomayaṃ sabbaṅgapañcaṅgiṃ ahīnindriyaṃ. Sace so iddhimā caṅkamati, nimmitopi tattha caṅkamati. Sace so iddhimā tiṭṭhati, nisīdati, seyyaṃ kappeti, nimmitopi tattha seyyaṃ kappeti. Sace so iddhimā dhūmāyati, pajjalati, dhammaṃ bhāsati, pañhaṃ pucchati, pañhaṃ puṭṭho vissajjeti, nimmitopi tattha pañhaṃ puṭṭho vissajjeti. Sace so iddhimā tena brahmunā saddhiṃ santiṭṭhati, sallapati, sākacchaṃ samāpajjati, nimmitopi tattha tena brahmunā saddhiṃ santiṭṭhati, sallapati, sākacchaṃ samāpajjati. Yaṃ yadeva hi so iddhimā karoti, taṃ tadeva nimmito karotī’’ti (paṭi. ma. 3.12)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dūrepi santike adhiṭṭhātī"
      },
      "ti pādakajjhānato vuṭṭhāya dūre devalokaṃ vā brahmalokaṃ vā āvajjati santike hotūti. Āvajjitvā parikammaṃ katvā puna samāpajjitvā ñāṇena adhiṭṭhāti santike hotūti, santike hoti. Esa nayo sesapadesupi."
    ],
    "innerText": "Tattha dūrepi santike adhiṭṭhātīti pādakajjhānato vuṭṭhāya dūre devalokaṃ vā brahmalokaṃ vā āvajjati santike hotūti. Āvajjitvā parikammaṃ katvā puna samāpajjitvā ñāṇena adhiṭṭhāti santike hotūti, santike hoti. Esa nayo sesapadesupi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha ko dūraṃ gahetvā santikaṃ akāsīti? Bhagavā. Bhagavā hi yamakapāṭihāriyāvasāne devalokaṃ gacchanto yugandharañca sineruñca santike katvā pathavītalato ekapādaṃ yugandhare patiṭṭhapetvā dutiyaṃ sinerumatthake ṭhapesi. Añño ko akāsi? Mahāmoggallānatthero. Thero hi sāvatthito bhattakiccaṃ katvā nikkhantaṃ dvādasayojanikaṃ parisaṃ tiṃsayojanaṃ saṅkassanagaramaggaṃ saṅkhipitvā taṅkhaṇaññeva sampāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica tambapaṇṇidīpe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cūḷasamuddatthero"
      },
      "pi akāsi. Dubbhikkhasamaye kira therassa santikaṃ pātova satta bhikkhusatāni āgamaṃsu. Thero ‘‘mahā bhikkhusaṅgho kuhiṃ bhikkhācāro bhavissatī’’ti cintento sakalatambapaṇṇidīpe adisvā ‘‘paratīre pāṭaliputte bhavissatī’’ti disvā bhikkhū pattacīvaraṃ gāhāpetvā ‘‘ethāvuso, bhikkhācāraṃ gamissāmā’’ti pathaviṃ saṅkhipitvā pāṭaliputtaṃ gato. Bhikkhū ‘‘kataraṃ, bhante, imaṃ nagara’’nti pucchiṃsu. Pāṭaliputtaṃ, āvusoti. Pāṭaliputtaṃ nāma dūre bhanteti. Āvuso, mahallakattherā nāma dūrepi gahetvā santike karontīti. Mahāsamuddo kuhiṃ, bhanteti? Nanu, āvuso, antarā ekaṃ nīlamātikaṃ atikkamitvā ",
      " āgatatthāti? Āma, bhante. Mahāsamuddo pana mahantoti. Āvuso, mahallakattherā nāma mahantampi khuddakaṃ karontīti."
    ],
    "innerText": "Apica tambapaṇṇidīpe cūḷasamuddattheropi akāsi. Dubbhikkhasamaye kira therassa santikaṃ pātova satta bhikkhusatāni āgamaṃsu. Thero ‘‘mahā bhikkhusaṅgho kuhiṃ bhikkhācāro bhavissatī’’ti cintento sakalatambapaṇṇidīpe adisvā ‘‘paratīre pāṭaliputte bhavissatī’’ti disvā bhikkhū pattacīvaraṃ gāhāpetvā ‘‘ethāvuso, bhikkhācāraṃ gamissāmā’’ti pathaviṃ saṅkhipitvā pāṭaliputtaṃ gato. Bhikkhū ‘‘kataraṃ, bhante, imaṃ nagara’’nti pucchiṃsu. Pāṭaliputtaṃ, āvusoti. Pāṭaliputtaṃ nāma dūre bhanteti. Āvuso, mahallakattherā nāma dūrepi gahetvā santike karontīti. Mahāsamuddo kuhiṃ, bhanteti? Nanu, āvuso, antarā ekaṃ nīlamātikaṃ atikkamitvā āgatatthāti? Āma, bhante. Mahāsamuddo pana mahantoti. Āvuso, mahallakattherā nāma mahantampi khuddakaṃ karontīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā cāyaṃ, evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tissadattatthero"
      },
      "pi sāyanhasamaye nhāyitvā katuttarāsaṅgo mahābodhiṃ vandissāmīti citte uppanne santike akāsi."
    ],
    "innerText": "Yathā cāyaṃ, evaṃ tissadattattheropi sāyanhasamaye nhāyitvā katuttarāsaṅgo mahābodhiṃ vandissāmīti citte uppanne santike akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Santikaṃ pana gahetvā ko dūramakāsīti? Bhagavā. Bhagavā hi attano ca aṅgulimālassa (ma. ni. 2.348) ca antaraṃ santikampi dūramakāsīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ko bahukaṃ thokaṃ akāsīti? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahākassapatthero"
      },
      ". Rājagahe kira nakkhattadivase pañcasatā kumāriyo candapūve gahetvā nakkhattakīḷanatthāya gacchantiyo bhagavantaṃ disvā kiñci nādaṃsu. Pacchato āgacchantaṃ pana theraṃ disvā amhākaṃ thero eti pūvaṃ dassāmāti sabbā pūve ",
      " gahetvā theraṃ upasaṅkamiṃsu. Thero pattaṃ nīharitvā sabbaṃ ekapattapūramattamakāsi. Bhagavā theraṃ āgamayamāno purato nisīdi. Thero āharitvā bhagavato adāsi."
    ],
    "innerText": "Atha ko bahukaṃ thokaṃ akāsīti? Mahākassapatthero. Rājagahe kira nakkhattadivase pañcasatā kumāriyo candapūve gahetvā nakkhattakīḷanatthāya gacchantiyo bhagavantaṃ disvā kiñci nādaṃsu. Pacchato āgacchantaṃ pana theraṃ disvā amhākaṃ thero eti pūvaṃ dassāmāti sabbā pūve gahetvā theraṃ upasaṅkamiṃsu. Thero pattaṃ nīharitvā sabbaṃ ekapattapūramattamakāsi. Bhagavā theraṃ āgamayamāno purato nisīdi. Thero āharitvā bhagavato adāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Illisaseṭṭhivatthusmiṃ"
      },
      " pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāmoggallānatthero"
      },
      " thokaṃ bahukamakāsi, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kākavaliyavatthusmiñca"
      },
      " bhagavā. Mahākassapatthero kira sattāhaṃ samāpattiyā vītināmetvā daliddasaṅgahaṃ karonto kākavaliyassa nāma duggatamanussassa gharadvāre aṭṭhāsi. Tassa jāyā theraṃ disvā patino pakkaṃ aloṇambilayāguṃ patte ākiri. Thero taṃ gahetvā bhagavato hatthe ṭhapesi. Bhagavā mahābhikkhusaṅghassa pahonakaṃ katvā adhiṭṭhāsi. Ekapattena ābhatā sabbesaṃ pahosi. Kākavaliyopi sattame divase seṭṭhiṭṭhānaṃ alatthāti."
    ],
    "innerText": "Illisaseṭṭhivatthusmiṃ pana mahāmoggallānatthero thokaṃ bahukamakāsi, kākavaliyavatthusmiñca bhagavā. Mahākassapatthero kira sattāhaṃ samāpattiyā vītināmetvā daliddasaṅgahaṃ karonto kākavaliyassa nāma duggatamanussassa gharadvāre aṭṭhāsi. Tassa jāyā theraṃ disvā patino pakkaṃ aloṇambilayāguṃ patte ākiri. Thero taṃ gahetvā bhagavato hatthe ṭhapesi. Bhagavā mahābhikkhusaṅghassa pahonakaṃ katvā adhiṭṭhāsi. Ekapattena ābhatā sabbesaṃ pahosi. Kākavaliyopi sattame divase seṭṭhiṭṭhānaṃ alatthāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na kevalañca thokassa bahukaraṇaṃ, madhuraṃ amadhuraṃ, amadhuraṃ madhurantiādīsupi yaṃ yaṃ icchati, sabbaṃ iddhimato ijjhati. Tathā hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāanuḷatthero"
      },
      " nāma sambahule bhikkhū piṇḍāya caritvā sukkhabhattameva labhitvā gaṅgātīre nisīditvā paribhuñjamāne disvā gaṅgāya udakaṃ sappimaṇḍanti adhiṭṭhahitvā sāmaṇerānaṃ saññaṃ adāsi. Te thālakehi āharitvā bhikkhusaṅghassa adaṃsu. Sabbe madhurena sappimaṇḍena bhuñjiṃsūti."
    ],
    "innerText": "Na kevalañca thokassa bahukaraṇaṃ, madhuraṃ amadhuraṃ, amadhuraṃ madhurantiādīsupi yaṃ yaṃ icchati, sabbaṃ iddhimato ijjhati. Tathā hi mahāanuḷatthero nāma sambahule bhikkhū piṇḍāya caritvā sukkhabhattameva labhitvā gaṅgātīre nisīditvā paribhuñjamāne disvā gaṅgāya udakaṃ sappimaṇḍanti adhiṭṭhahitvā sāmaṇerānaṃ saññaṃ adāsi. Te thālakehi āharitvā bhikkhusaṅghassa adaṃsu. Sabbe madhurena sappimaṇḍena bhuñjiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dibbena"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhunā"
      },
      "ti idheva ṭhito ālokaṃ vaḍḍhetvā tassa brahmuno rūpaṃ passati. Idheva ca ṭhito sabbaṃ tassa bhāsato saddaṃ suṇāti. Cittaṃ pajānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyavasena cittaṃ pariṇāmetī"
      },
      "ti karajakāyassa vasena cittaṃ pariṇāmeti. Pādakajjhānacittaṃ gahetvā kāye āropeti. Kāyānugatikaṃ karoti dandhagamanaṃ. Kāyagamanaṃ hi dandhaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhasaññañca lahusaññañca okkamatī"
      },
      "ti pādakajjhānārammaṇena iddhicittena sahajātaṃ sukhasaññañca lahusaññañca okkamati pavisati phasseti sampāpuṇāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhasaññā"
      },
      " nāma upekkhāsampayuttasaññā. Upekkhā hi santaṃ sukhanti vuttā. Sāyeva ca saññā nīvaraṇehi ceva vitakkādīhi paccanīkehi ca vimuttattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lahusaññā"
      },
      "tipi veditabbā. Taṃ okkantassa panassa karajakāyopi tūlapicu viya sallahuko hoti. So evaṃ vāyukkhittatūlapicunā ",
      " viya sallahukena dissamānena kāyena brahmalokaṃ gacchati. Evaṃ gacchanto ca sace icchati pathavīkasiṇavasena ākāse maggaṃ nimminitvā padasā gacchati. Sace icchati vāyokasiṇavasena vāyuṃ adhiṭṭhahitvā tūlapicu viya vāyunā gacchati. Apica gantukāmatā eva ettha pamāṇaṃ. ‘‘Sati hi gantukāmatāya’’ evaṃ katacittādhiṭṭhāno adhiṭṭhānavegukkhittova so issāsakhittasaro viya dissamāno gacchati."
    ],
    "innerText": "Dibbenacakkhunāti idheva ṭhito ālokaṃ vaḍḍhetvā tassa brahmuno rūpaṃ passati. Idheva ca ṭhito sabbaṃ tassa bhāsato saddaṃ suṇāti. Cittaṃ pajānāti. Kāyavasena cittaṃ pariṇāmetīti karajakāyassa vasena cittaṃ pariṇāmeti. Pādakajjhānacittaṃ gahetvā kāye āropeti. Kāyānugatikaṃ karoti dandhagamanaṃ. Kāyagamanaṃ hi dandhaṃ hoti. Sukhasaññañca lahusaññañca okkamatīti pādakajjhānārammaṇena iddhicittena sahajātaṃ sukhasaññañca lahusaññañca okkamati pavisati phasseti sampāpuṇāti. Sukhasaññā nāma upekkhāsampayuttasaññā. Upekkhā hi santaṃ sukhanti vuttā. Sāyeva ca saññā nīvaraṇehi ceva vitakkādīhi paccanīkehi ca vimuttattā lahusaññātipi veditabbā. Taṃ okkantassa panassa karajakāyopi tūlapicu viya sallahuko hoti. So evaṃ vāyukkhittatūlapicunā viya sallahukena dissamānena kāyena brahmalokaṃ gacchati. Evaṃ gacchanto ca sace icchati pathavīkasiṇavasena ākāse maggaṃ nimminitvā padasā gacchati. Sace icchati vāyokasiṇavasena vāyuṃ adhiṭṭhahitvā tūlapicu viya vāyunā gacchati. Apica gantukāmatā eva ettha pamāṇaṃ. ‘‘Sati hi gantukāmatāya’’ evaṃ katacittādhiṭṭhāno adhiṭṭhānavegukkhittova so issāsakhittasaro viya dissamāno gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittavasena kāyaṃ pariṇāmetī"
      },
      "ti kāyaṃ gahetvā citte āropeti. Cittānugatikaṃ karoti sīghagamanaṃ. Cittagamanaṃ hi sīghaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhasaññañca lahusaññañca okkamatī"
      },
      "ti rūpakāyārammaṇena iddhicittena sahajātaṃ sukhasaññañca lahusaññañca okkamatīti. Sesaṃ vuttanayeneva veditabbaṃ. Idaṃ pana cittagamanameva hoti. Evaṃ adissamānena kāyena gacchanto panāyaṃ kiṃ tassa adhiṭṭhānacittassa uppādakkhaṇe gacchati, udāhu ṭhitikkhaṇe bhaṅgakkhaṇe vāti vutte tīsupi khaṇesu gacchatīti thero āha. Kiṃ pana so sayaṃ gacchati nimmitaṃ pesetīti. Yathāruci karoti. Idha panassa sayaṃ gamanameva āgataṃ."
    ],
    "innerText": "Cittavasena kāyaṃ pariṇāmetīti kāyaṃ gahetvā citte āropeti. Cittānugatikaṃ karoti sīghagamanaṃ. Cittagamanaṃ hi sīghaṃ hoti. Sukhasaññañca lahusaññañca okkamatīti rūpakāyārammaṇena iddhicittena sahajātaṃ sukhasaññañca lahusaññañca okkamatīti. Sesaṃ vuttanayeneva veditabbaṃ. Idaṃ pana cittagamanameva hoti. Evaṃ adissamānena kāyena gacchanto panāyaṃ kiṃ tassa adhiṭṭhānacittassa uppādakkhaṇe gacchati, udāhu ṭhitikkhaṇe bhaṅgakkhaṇe vāti vutte tīsupi khaṇesu gacchatīti thero āha. Kiṃ pana so sayaṃ gacchati nimmitaṃ pesetīti. Yathāruci karoti. Idha panassa sayaṃ gamanameva āgataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manomaya"
      },
      "nti adhiṭṭhānamanena nimmitattā manomayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahīnindriya"
      },
      "nti idaṃ cakkhusotādīnaṃ saṇṭhānavasena vuttaṃ. Nimmitarūpe pana pasādo nāma natthi. Sace iddhimā caṅkamati nimmitopi tattha caṅkamatītiādi sabbaṃ sāvakanimmitaṃ sandhāya vuttaṃ. Buddhanimmito pana yaṃ yaṃ bhagavā karoti, taṃ tampi karoti. Bhagavato rucivasena aññampi karotīti. Ettha ca yaṃ so iddhimā idheva ṭhito dibbena cakkhunā rūpaṃ passati, dibbāya sotadhātuyā saddaṃ suṇāti, cetopariyañāṇena ",
      " cittaṃ pajānāti, na ettāvatā kāyena vasaṃ vatteti. Yampi so idheva ṭhito tena brahmunā saddhiṃ santiṭṭhati sallapati sākacchaṃ samāpajjati, ettāvatāpi na kāyena vasaṃ vatteti. Yampissa dūrepi santike adhiṭṭhātītiādikaṃ adhiṭṭhānaṃ, ettāvatāpi na kāyena vasaṃ vatteti. Yampi so dissamānena vā adissamānena vā kāyena brahmalokaṃ gacchati, ettāvatāpi na kāyena vasaṃ vatteti. Yañca kho so tassa brahmuno purato rūpaṃ abhinimminātītiādinā nayena ",
      " vuttavidhānaṃ āpajjati, ettāvatā kāyena vasaṃ vatteti nāmaṃ. Sesaṃ panettha kāyena vasaṃ vattanāya pubbabhāgadassanatthaṃ vuttanti ayaṃ tāva adhiṭṭhānā iddhi."
    ],
    "innerText": "Manomayanti adhiṭṭhānamanena nimmitattā manomayaṃ. Ahīnindriyanti idaṃ cakkhusotādīnaṃ saṇṭhānavasena vuttaṃ. Nimmitarūpe pana pasādo nāma natthi. Sace iddhimā caṅkamati nimmitopi tattha caṅkamatītiādi sabbaṃ sāvakanimmitaṃ sandhāya vuttaṃ. Buddhanimmito pana yaṃ yaṃ bhagavā karoti, taṃ tampi karoti. Bhagavato rucivasena aññampi karotīti. Ettha ca yaṃ so iddhimā idheva ṭhito dibbena cakkhunā rūpaṃ passati, dibbāya sotadhātuyā saddaṃ suṇāti, cetopariyañāṇena cittaṃ pajānāti, na ettāvatā kāyena vasaṃ vatteti. Yampi so idheva ṭhito tena brahmunā saddhiṃ santiṭṭhati sallapati sākacchaṃ samāpajjati, ettāvatāpi na kāyena vasaṃ vatteti. Yampissa dūrepi santike adhiṭṭhātītiādikaṃ adhiṭṭhānaṃ, ettāvatāpi na kāyena vasaṃ vatteti. Yampi so dissamānena vā adissamānena vā kāyena brahmalokaṃ gacchati, ettāvatāpi na kāyena vasaṃ vatteti. Yañca kho so tassa brahmuno purato rūpaṃ abhinimminātītiādinā nayena vuttavidhānaṃ āpajjati, ettāvatā kāyena vasaṃ vatteti nāmaṃ. Sesaṃ panettha kāyena vasaṃ vattanāya pubbabhāgadassanatthaṃ vuttanti ayaṃ tāva adhiṭṭhānā iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "398"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vikubbanāya"
      },
      " pana manomayāya ca idaṃ nānākaraṇaṃ. Vikubbanaṃ tāva karontena ‘‘so pakativaṇṇaṃ vijahitvā kumārakavaṇṇaṃ vā dasseti, nāgavaṇṇaṃ vā dasseti, supaṇṇavaṇṇaṃ vā dasseti, asuravaṇṇaṃ vā dasseti, indavaṇṇaṃ vā dasseti, devavaṇṇaṃ vā dasseti, brahmavaṇṇaṃ vā dasseti, samuddavaṇṇaṃ vā dasseti, pabbatavaṇṇaṃ vā dasseti, sīhavaṇṇaṃ vā dasseti, byagghavaṇṇaṃ vā dasseti, dīpivaṇṇaṃ vā dasseti, hatthimpi dasseti, assampi dasseti, rathampi dasseti, pattimpi dasseti, vividhampi senābyūhaṃ dassetī’’ti (paṭi. ma. 3.13) evaṃ vuttesu kumārakavaṇṇādīsu yaṃ yaṃ ākaṅkhati, taṃ taṃ adhiṭṭhātabbaṃ. Adhiṭṭhahantena ca pathavīkasiṇādīsu aññatarārammaṇato abhiññāpādakajjhānato vuṭṭhāya attano kumārakavaṇṇo āvajjitabbo. Āvajjitvā parikammāvasāne puna samāpajjitvā vuṭṭhāya evarūpo nāma kumārako homīti adhiṭṭhātabbaṃ. Saha adhiṭṭhānacittena kumārako hoti devadatto viya (cūḷava. 333). Esa nayo sabbattha."
    ],
    "innerText": "398.Vikubbanāya pana manomayāya ca idaṃ nānākaraṇaṃ. Vikubbanaṃ tāva karontena ‘‘so pakativaṇṇaṃ vijahitvā kumārakavaṇṇaṃ vā dasseti, nāgavaṇṇaṃ vā dasseti, supaṇṇavaṇṇaṃ vā dasseti, asuravaṇṇaṃ vā dasseti, indavaṇṇaṃ vā dasseti, devavaṇṇaṃ vā dasseti, brahmavaṇṇaṃ vā dasseti, samuddavaṇṇaṃ vā dasseti, pabbatavaṇṇaṃ vā dasseti, sīhavaṇṇaṃ vā dasseti, byagghavaṇṇaṃ vā dasseti, dīpivaṇṇaṃ vā dasseti, hatthimpi dasseti, assampi dasseti, rathampi dasseti, pattimpi dasseti, vividhampi senābyūhaṃ dassetī’’ti (paṭi. ma. 3.13) evaṃ vuttesu kumārakavaṇṇādīsu yaṃ yaṃ ākaṅkhati, taṃ taṃ adhiṭṭhātabbaṃ. Adhiṭṭhahantena ca pathavīkasiṇādīsu aññatarārammaṇato abhiññāpādakajjhānato vuṭṭhāya attano kumārakavaṇṇo āvajjitabbo. Āvajjitvā parikammāvasāne puna samāpajjitvā vuṭṭhāya evarūpo nāma kumārako homīti adhiṭṭhātabbaṃ. Saha adhiṭṭhānacittena kumārako hoti devadatto viya (cūḷava. 333). Esa nayo sabbattha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hatthimpi dassetī"
      },
      "tiādi panettha bahiddhāpi hatthiādidassanavasena vuttaṃ. Tattha hatthī homīti anadhiṭṭhahitvā hatthī hotūti adhiṭṭhātabbaṃ, assādīsupi eseva nayoti. Ayaṃ vikubbanā iddhi."
    ],
    "innerText": "Hatthimpi dassetītiādi panettha bahiddhāpi hatthiādidassanavasena vuttaṃ. Tattha hatthī homīti anadhiṭṭhahitvā hatthī hotūti adhiṭṭhātabbaṃ, assādīsupi eseva nayoti. Ayaṃ vikubbanā iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "399"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manomayaṃ"
      },
      " kātukāmo pana pādakajjhānato vuṭṭhāya kāyaṃ tāva āvajjitvā vuttanayeneva susiro hotūti adhiṭṭhāti, susiro hoti. Athassa abbhantare aññaṃ kāyaṃ āvajjitvā parikammaṃ katvā vuttanayeneva adhiṭṭhāti, tassa abbhantare añño kāyo hotūti. So taṃ muñjamhā īsikaṃ viya kosiyā asiṃ viya karaṇḍāya ahiṃ viya ca abbāhati ",
      ". Tena vuttaṃ ‘‘idha bhikkhu imamhā kāyā aññaṃ kāyaṃ abhinimmināti rūpiṃ manomayaṃ sabbaṅgapaccaṅgiṃ ahīnindriyaṃ. Seyyathāpi puriso muñjamhā īsikaṃ pavāheyya, tassa evamassa ayaṃ muñjo ayaṃ īsikā ",
      ", añño muñjo aññā īsikā, muñjamhātveva īsikā pavāḷhā’’tiādi (paṭi. ma. 3.14). Ettha ca yathā īsikādayo muñjādīhi sadisā honti, evaṃ manomayarūpaṃ iddhimatāsadisameva hotīti dassanatthaṃ etā upamā vuttāti. Ayaṃ manomayā iddhi."
    ],
    "innerText": "399.Manomayaṃ kātukāmo pana pādakajjhānato vuṭṭhāya kāyaṃ tāva āvajjitvā vuttanayeneva susiro hotūti adhiṭṭhāti, susiro hoti. Athassa abbhantare aññaṃ kāyaṃ āvajjitvā parikammaṃ katvā vuttanayeneva adhiṭṭhāti, tassa abbhantare añño kāyo hotūti. So taṃ muñjamhā īsikaṃ viya kosiyā asiṃ viya karaṇḍāya ahiṃ viya ca abbāhati . Tena vuttaṃ ‘‘idha bhikkhu imamhā kāyā aññaṃ kāyaṃ abhinimmināti rūpiṃ manomayaṃ sabbaṅgapaccaṅgiṃ ahīnindriyaṃ. Seyyathāpi puriso muñjamhā īsikaṃ pavāheyya, tassa evamassa ayaṃ muñjo ayaṃ īsikā , añño muñjo aññā īsikā, muñjamhātveva īsikā pavāḷhā’’tiādi (paṭi. ma. 3.14). Ettha ca yathā īsikādayo muñjādīhi sadisā honti, evaṃ manomayarūpaṃ iddhimatāsadisameva hotīti dassanatthaṃ etā upamā vuttāti. Ayaṃ manomayā iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti sādhujanapāmojjatthāya kate visuddhimagge"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iddhividhaniddeso nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dvādasamo paricchedo."
  }
]