[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Āyācanakāraṇaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kasmā ",
      " pana te taṃ āyāciṃsūti? Vuccate, mahāvihāravāsino hi āditoyeva paṭṭhāya piṭakattayaṃ yathā tīsu saṅgītīsu pāḷibhāsāya saṅgītaṃ, yathā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vaṭṭagāmaṇirāja"
      },
      "kāle (455-467-bu-va) potthakesu āropitaṃ, tathā porāṇaṃ pāḷipiṭakameva uggaṇhanti ceva vācenti ca, na sakkatāropitapiṭakaṃ. Aṭṭhakathāyo ca tivassasatamattato pure katā. Tathā hi aṭṭhakathāsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vasabharāja"
      },
      "kālato (609-653-bu-0) pacchā sīhaḷikattherānañceva aññesañca vatthu na dissati ṭhapetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāsena"
      },
      "rājavatthuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pārā. aṭṭha. 2.236-237]"
      },
      ", yāva ācariyabuddhaghosakālāpi ca tā eva porāṇaṭṭhakathāyo atthi na abhinavīkatā. Tena tesaṃ piṭakesu yebhuyyena janā paricayaṃ kātuṃ asañjātābhilāsā honti asañjātussāhā. Dīpantaresu ca attano piṭakaṃ pattharāpetuṃ na sakkonti aṭṭhakathānaṃ dīpabhāsāya abhisaṅkhatattā. Abhayagirivāsino pana vaṭṭagāmaṇirājakālato paṭṭhāya sakkatabhāsāropitaṃ dhammarucinikāyādipiṭakampi mahāyānapiṭakampi navaṃ navaṃ pariyāpuṇanti ceva vācenti ca, tena tesaṃ piṭakesu yebhuyyena janā paricayaṃ kātuṃ sañjātābhilāsā honti sañjātussāhā, navaṃ navameva hi sattā piyāyanti. Tatoyeva te dīpantaresupi attano vādaṃ pattharāpetuṃ sakkonti. Tasmā te mahāvihāravāsino therā attano sīhaḷaṭṭhakathāyo pāḷibhāsāya abhisaṅkharitukāmā tathā kātuṃ samatthaṃ ācariyabuddhaghosattherassa ñāṇappabhāvavisesaṃ yathāvuttaguṇasampannabhāvañca ñatvā āyāciṃsūti veditabbaṃ."
    ],
    "innerText": "Kasmā pana te taṃ āyāciṃsūti? Vuccate, mahāvihāravāsino hi āditoyeva paṭṭhāya piṭakattayaṃ yathā tīsu saṅgītīsu pāḷibhāsāya saṅgītaṃ, yathā ca vaṭṭagāmaṇirājakāle (455-467-bu-va) potthakesu āropitaṃ, tathā porāṇaṃ pāḷipiṭakameva uggaṇhanti ceva vācenti ca, na sakkatāropitapiṭakaṃ. Aṭṭhakathāyo ca tivassasatamattato pure katā. Tathā hi aṭṭhakathāsu vasabharājakālato (609-653-bu-0) pacchā sīhaḷikattherānañceva aññesañca vatthu na dissati ṭhapetvā mahāsenarājavatthuṃ [pārā. aṭṭha. 2.236-237], yāva ācariyabuddhaghosakālāpi ca tā eva porāṇaṭṭhakathāyo atthi na abhinavīkatā. Tena tesaṃ piṭakesu yebhuyyena janā paricayaṃ kātuṃ asañjātābhilāsā honti asañjātussāhā. Dīpantaresu ca attano piṭakaṃ pattharāpetuṃ na sakkonti aṭṭhakathānaṃ dīpabhāsāya abhisaṅkhatattā. Abhayagirivāsino pana vaṭṭagāmaṇirājakālato paṭṭhāya sakkatabhāsāropitaṃ dhammarucinikāyādipiṭakampi mahāyānapiṭakampi navaṃ navaṃ pariyāpuṇanti ceva vācenti ca, tena tesaṃ piṭakesu yebhuyyena janā paricayaṃ kātuṃ sañjātābhilāsā honti sañjātussāhā, navaṃ navameva hi sattā piyāyanti. Tatoyeva te dīpantaresupi attano vādaṃ pattharāpetuṃ sakkonti. Tasmā te mahāvihāravāsino therā attano sīhaḷaṭṭhakathāyo pāḷibhāsāya abhisaṅkharitukāmā tathā kātuṃ samatthaṃ ācariyabuddhaghosattherassa ñāṇappabhāvavisesaṃ yathāvuttaguṇasampannabhāvañca ñatvā āyāciṃsūti veditabbaṃ."
  }
]