[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "4. Pathavīkasiṇaniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "51"
      },
      ". Idāni ",
      " yaṃ vuttaṃ ‘‘samādhibhāvanāya ananurūpaṃ vihāraṃ pahāya anurūpe vihāre viharantenā’’ti ettha yassa tāvācariyena saddhiṃ ekavihāre vasato phāsu hoti, tena tattheva kammaṭṭhānaṃ parisodhentena vasitabbaṃ. Sace tattha phāsu na hoti, yo añño gāvute vā aḍḍhayojane vā yojanamattepi vā sappāyo vihāro hoti, tattha vasitabbaṃ. Evañhi sati kammaṭṭhānassa kismiñcideva ṭhāne sandehe vā satisammose vā jāte kālasseva vihāre vattaṃ katvā antarāmagge piṇḍāya caritvā bhattakiccapariyosāneyeva ācariyassa vasanaṭṭhānaṃ gantvā taṃdivasamācariyassa santike kammaṭṭhānaṃ sodhetvā dutiyadivase ācariyaṃ vanditvā nikkhamitvā antarāmagge piṇḍāya caritvā akilamantoyeva attano vasanaṭṭhānaṃ āgantuṃ sakkhissati. Yo pana yojanappamāṇepi phāsukaṭṭhānaṃ na labhati, tena kammaṭṭhāne sabbaṃ gaṇṭhiṭṭhānaṃ chinditvā suvisuddhaṃ āvajjanapaṭibaddhaṃ kammaṭṭhānaṃ katvā dūrampi gantvā samādhibhāvanāya ananurūpaṃ vihāraṃ pahāya anurūpe vihāre vihātabbaṃ."
    ],
    "innerText": "51. Idāni yaṃ vuttaṃ ‘‘samādhibhāvanāya ananurūpaṃ vihāraṃ pahāya anurūpe vihāre viharantenā’’ti ettha yassa tāvācariyena saddhiṃ ekavihāre vasato phāsu hoti, tena tattheva kammaṭṭhānaṃ parisodhentena vasitabbaṃ. Sace tattha phāsu na hoti, yo añño gāvute vā aḍḍhayojane vā yojanamattepi vā sappāyo vihāro hoti, tattha vasitabbaṃ. Evañhi sati kammaṭṭhānassa kismiñcideva ṭhāne sandehe vā satisammose vā jāte kālasseva vihāre vattaṃ katvā antarāmagge piṇḍāya caritvā bhattakiccapariyosāneyeva ācariyassa vasanaṭṭhānaṃ gantvā taṃdivasamācariyassa santike kammaṭṭhānaṃ sodhetvā dutiyadivase ācariyaṃ vanditvā nikkhamitvā antarāmagge piṇḍāya caritvā akilamantoyeva attano vasanaṭṭhānaṃ āgantuṃ sakkhissati. Yo pana yojanappamāṇepi phāsukaṭṭhānaṃ na labhati, tena kammaṭṭhāne sabbaṃ gaṇṭhiṭṭhānaṃ chinditvā suvisuddhaṃ āvajjanapaṭibaddhaṃ kammaṭṭhānaṃ katvā dūrampi gantvā samādhibhāvanāya ananurūpaṃ vihāraṃ pahāya anurūpe vihāre vihātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ananurūpavihāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "52"
      },
      ". Tattha ananurūpo nāma aṭṭhārasannaṃ dosānaṃ aññatarena samannāgato. Tatrime aṭṭhārasa dosā – mahattaṃ, navattaṃ, jiṇṇattaṃ, panthanissitattaṃ, soṇḍī, paṇṇaṃ, pupphaṃ, phalaṃ, patthanīyatā, nagarasannissitatā, dārusannissitatā, khettasannissitatā, visabhāgānaṃ puggalānaṃ atthitā, paṭṭanasannissitatā, paccantasannissitatā, rajjasīmasannissitatā, asappāyatā, kalyāṇamittānaṃ alābhoti imesaṃ aṭṭhārasannaṃ dosānaṃ aññatarena dosena samannāgato ananurūpo nāma. Na tattha vihātabbaṃ."
    ],
    "innerText": "52. Tattha ananurūpo nāma aṭṭhārasannaṃ dosānaṃ aññatarena samannāgato. Tatrime aṭṭhārasa dosā – mahattaṃ, navattaṃ, jiṇṇattaṃ, panthanissitattaṃ, soṇḍī, paṇṇaṃ, pupphaṃ, phalaṃ, patthanīyatā, nagarasannissitatā, dārusannissitatā, khettasannissitatā, visabhāgānaṃ puggalānaṃ atthitā, paṭṭanasannissitatā, paccantasannissitatā, rajjasīmasannissitatā, asappāyatā, kalyāṇamittānaṃ alābhoti imesaṃ aṭṭhārasannaṃ dosānaṃ aññatarena dosena samannāgato ananurūpo nāma. Na tattha vihātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kasmā? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāvihāre"
      },
      " tāva bahū nānāchandā sannipatanti, te aññamaññaṃ paṭiviruddhatāya vattaṃ ",
      " na karonti. Bodhiyaṅgaṇādīni asammaṭṭhāneva honti. Anupaṭṭhāpitaṃ pānīyaṃ paribhojanīyaṃ. Tatrāyaṃ gocaragāme piṇḍāya ",
      " carissāmīti pattacīvaramādāya nikkhanto sace passati vattaṃ vā akataṃ pānīyaghaṭaṃ vā rittaṃ, athānena vattaṃ kātabbaṃ hoti, pānīyaṃ upaṭṭhāpetabbaṃ. Akaronto vattabhede dukkaṭaṃ āpajjati. Karontassa kālo atikkamati, atidivā paviṭṭho niṭṭhitāya bhikkhāya kiñci na labhati. Paṭisallānagatopi sāmaṇeradaharabhikkhūnaṃ uccāsaddena saṅghakammehi ca vikkhipati. Yattha pana sabbaṃ vattaṃ katameva hoti, avasesāpi ca saṅghaṭṭanā natthi. Evarūpe mahāvihārepi vihātabbaṃ."
    ],
    "innerText": "Kasmā? Mahāvihāre tāva bahū nānāchandā sannipatanti, te aññamaññaṃ paṭiviruddhatāya vattaṃ na karonti. Bodhiyaṅgaṇādīni asammaṭṭhāneva honti. Anupaṭṭhāpitaṃ pānīyaṃ paribhojanīyaṃ. Tatrāyaṃ gocaragāme piṇḍāya carissāmīti pattacīvaramādāya nikkhanto sace passati vattaṃ vā akataṃ pānīyaghaṭaṃ vā rittaṃ, athānena vattaṃ kātabbaṃ hoti, pānīyaṃ upaṭṭhāpetabbaṃ. Akaronto vattabhede dukkaṭaṃ āpajjati. Karontassa kālo atikkamati, atidivā paviṭṭho niṭṭhitāya bhikkhāya kiñci na labhati. Paṭisallānagatopi sāmaṇeradaharabhikkhūnaṃ uccāsaddena saṅghakammehi ca vikkhipati. Yattha pana sabbaṃ vattaṃ katameva hoti, avasesāpi ca saṅghaṭṭanā natthi. Evarūpe mahāvihārepi vihātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navavihāre"
      },
      " bahu navakammaṃ hoti, akarontaṃ ujjhāyanti. Yattha pana bhikkhū evaṃ vadanti ‘‘āyasmā yathāsukhaṃ samaṇadhammaṃ karotu, mayaṃ navakammaṃ karissāmā’’ti evarūpe vihātabbaṃ."
    ],
    "innerText": "Navavihāre bahu navakammaṃ hoti, akarontaṃ ujjhāyanti. Yattha pana bhikkhū evaṃ vadanti ‘‘āyasmā yathāsukhaṃ samaṇadhammaṃ karotu, mayaṃ navakammaṃ karissāmā’’ti evarūpe vihātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jiṇṇavihāre"
      },
      " pana bahu paṭijaggitabbaṃ hoti, antamaso attano senāsanamattampi appaṭijaggantaṃ ujjhāyanti, paṭijaggantassa kammaṭṭhānaṃ parihāyati."
    ],
    "innerText": "Jiṇṇavihāre pana bahu paṭijaggitabbaṃ hoti, antamaso attano senāsanamattampi appaṭijaggantaṃ ujjhāyanti, paṭijaggantassa kammaṭṭhānaṃ parihāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Panthanissite"
      },
      " mahāpathavihāre rattindivaṃ āgantukā sannipatanti. Vikāle āgatānaṃ attano senāsanaṃ datvā rukkhamūle vā pāsāṇapiṭṭhe vā vasitabbaṃ hoti. Punadivasepi evamevāti kammaṭṭhānassa okāso na hoti. Yattha pana evarūpo āgantukasambādho na hoti, tattha vihātabbaṃ."
    ],
    "innerText": "Panthanissite mahāpathavihāre rattindivaṃ āgantukā sannipatanti. Vikāle āgatānaṃ attano senāsanaṃ datvā rukkhamūle vā pāsāṇapiṭṭhe vā vasitabbaṃ hoti. Punadivasepi evamevāti kammaṭṭhānassa okāso na hoti. Yattha pana evarūpo āgantukasambādho na hoti, tattha vihātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Soṇḍī"
      },
      " nāma pāsāṇapokkharaṇī hoti, tattha pānīyatthaṃ mahājano samosarati, nagaravāsīnaṃ rājakulūpakattherānaṃ antevāsikā rajanakammatthāya āgacchanti, tesaṃ bhājanadārudoṇikādīni pucchantānaṃ asuke ca asuke ca ṭhāneti dassetabbāni honti, evaṃ sabbakālampi niccabyāvaṭo hoti."
    ],
    "innerText": "Soṇḍī nāma pāsāṇapokkharaṇī hoti, tattha pānīyatthaṃ mahājano samosarati, nagaravāsīnaṃ rājakulūpakattherānaṃ antevāsikā rajanakammatthāya āgacchanti, tesaṃ bhājanadārudoṇikādīni pucchantānaṃ asuke ca asuke ca ṭhāneti dassetabbāni honti, evaṃ sabbakālampi niccabyāvaṭo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yattha nānāvidhaṃ sākapaṇṇaṃ hoti, tatthassa kammaṭṭhānaṃ gahetvā divāvihāraṃ nisinnassāpi santike sākahārikā gāyamānā paṇṇaṃ uccinantiyo visabhāgasaddasaṅghaṭṭanena kammaṭṭhānantarāyaṃ karonti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yattha ",
      " pana nānāvidhā mālāgacchā supupphitā honti, tatrāpi tādisoyeva upaddavo."
    ],
    "innerText": "Yattha pana nānāvidhā mālāgacchā supupphitā honti, tatrāpi tādisoyeva upaddavo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yattha ",
      " nānāvidhaṃ ambajambupanasādiphalaṃ hoti, tattha phalatthikā āgantvā yācanti, adentassa kujjhanti, balakkārena vā gaṇhanti, sāyanhasamaye vihāramajjhe caṅkamantena te disvā ‘‘kiṃ upāsakā evaṃ karothā’’ti vuttā yathāruci akkosanti. Avāsāyapissa parakkamanti."
    ],
    "innerText": "Yattha nānāvidhaṃ ambajambupanasādiphalaṃ hoti, tattha phalatthikā āgantvā yācanti, adentassa kujjhanti, balakkārena vā gaṇhanti, sāyanhasamaye vihāramajjhe caṅkamantena te disvā ‘‘kiṃ upāsakā evaṃ karothā’’ti vuttā yathāruci akkosanti. Avāsāyapissa parakkamanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patthanīye"
      },
      " pana leṇasammate dakkhiṇagirihatthikucchicetiyagiricittalapabbatasadise vihāre viharantaṃ ayamarahāti sambhāvetvā vanditukāmā manussā samantā osaranti, tenassa na phāsu hoti, yassa pana taṃ sappāyaṃ hoti, tena divā aññatra gantvā rattiṃ vasitabbaṃ."
    ],
    "innerText": "Patthanīye pana leṇasammate dakkhiṇagirihatthikucchicetiyagiricittalapabbatasadise vihāre viharantaṃ ayamarahāti sambhāvetvā vanditukāmā manussā samantā osaranti, tenassa na phāsu hoti, yassa pana taṃ sappāyaṃ hoti, tena divā aññatra gantvā rattiṃ vasitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nagarasannissite"
      },
      " visabhāgārammaṇāni āpāthamāgacchanti, kumbhadāsiyopi ghaṭehi nighaṃsantiyo gacchanti, okkamitvā maggaṃ na denti, issaramanussāpi vihāramajjhe sāṇiṃ parikkhipitvā nisīdanti."
    ],
    "innerText": "Nagarasannissite visabhāgārammaṇāni āpāthamāgacchanti, kumbhadāsiyopi ghaṭehi nighaṃsantiyo gacchanti, okkamitvā maggaṃ na denti, issaramanussāpi vihāramajjhe sāṇiṃ parikkhipitvā nisīdanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dārusannissaye"
      },
      " pana yattha kaṭṭhāni ca dabbupakaraṇarukkhā ca santi, tattha kaṭṭhahārikā pubbe vuttasākapupphahārikā viya aphāsuṃ karonti, vihāre rukkhā santi, te chinditvā gharāni karissāmāti manussā āgantvā chindanti. Sace sāyanhasamayaṃ padhānagharā nikkhamitvā vihāramajjhe caṅkamanto te disvā ‘‘kiṃ upāsakā evaṃ karothā’’ti vadati, yathāruci akkosanti, avāsāyapissa parakkamanti."
    ],
    "innerText": "Dārusannissaye pana yattha kaṭṭhāni ca dabbupakaraṇarukkhā ca santi, tattha kaṭṭhahārikā pubbe vuttasākapupphahārikā viya aphāsuṃ karonti, vihāre rukkhā santi, te chinditvā gharāni karissāmāti manussā āgantvā chindanti. Sace sāyanhasamayaṃ padhānagharā nikkhamitvā vihāramajjhe caṅkamanto te disvā ‘‘kiṃ upāsakā evaṃ karothā’’ti vadati, yathāruci akkosanti, avāsāyapissa parakkamanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yo pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khettasannissito"
      },
      " hoti samantā khettehi parivārito, tattha manussā vihāramajjheyeva khalaṃ katvā dhaññaṃ maddanti, pamukhesu sayanti, aññampi bahuṃ aphāsuṃ karonti. Yatrāpi mahāsaṅghabhogo hoti, ārāmikā kulānaṃ gāvo rundhanti, udakavāraṃ paṭisedhenti, manussā vīhisīsaṃ gahetvā ‘‘passatha tumhākaṃ ārāmikānaṃ kamma’’nti saṅghassa dassenti. Tena tena kāraṇena rājarājamahāmattānaṃ gharadvāraṃ gantabbaṃ hoti, ayampi khettasannissiteneva saṅgahito."
    ],
    "innerText": "Yo pana khettasannissito hoti samantā khettehi parivārito, tattha manussā vihāramajjheyeva khalaṃ katvā dhaññaṃ maddanti, pamukhesu sayanti, aññampi bahuṃ aphāsuṃ karonti. Yatrāpi mahāsaṅghabhogo hoti, ārāmikā kulānaṃ gāvo rundhanti, udakavāraṃ paṭisedhenti, manussā vīhisīsaṃ gahetvā ‘‘passatha tumhākaṃ ārāmikānaṃ kamma’’nti saṅghassa dassenti. Tena tena kāraṇena rājarājamahāmattānaṃ gharadvāraṃ gantabbaṃ hoti, ayampi khettasannissiteneva saṅgahito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visabhāgānaṃ puggalānaṃ atthitā"
      },
      "ti yattha aññamaññaṃ visabhāgaverī bhikkhū viharanti, ye kalahaṃ ",
      " karontā mā, bhante, evaṃ karothāti vāriyamānā etassa paṃsukūlikassa āgatakālato paṭṭhāya naṭṭhāmhāti vattāro bhavanti."
    ],
    "innerText": "Visabhāgānaṃ puggalānaṃ atthitāti yattha aññamaññaṃ visabhāgaverī bhikkhū viharanti, ye kalahaṃ karontā mā, bhante, evaṃ karothāti vāriyamānā etassa paṃsukūlikassa āgatakālato paṭṭhāya naṭṭhāmhāti vattāro bhavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yopi ",
      " udakapaṭṭanaṃ vā thalapaṭṭanaṃ vā nissito hoti, tattha abhiṇhaṃ nāvāhi ca satthehi ca āgatamanussā okāsaṃ detha, pānīyaṃ detha, loṇaṃ dethāti ghaṭṭayantā aphāsuṃ karonti."
    ],
    "innerText": "Yopi udakapaṭṭanaṃ vā thalapaṭṭanaṃ vā nissito hoti, tattha abhiṇhaṃ nāvāhi ca satthehi ca āgatamanussā okāsaṃ detha, pānīyaṃ detha, loṇaṃ dethāti ghaṭṭayantā aphāsuṃ karonti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccantasannissite"
      },
      " pana manussā buddhādīsu appasannā honti."
    ],
    "innerText": "Paccantasannissite pana manussā buddhādīsu appasannā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rajjasīmasannissite"
      },
      " rājabhayaṃ hoti. Tañhi padesaṃ eko rājā na mayhaṃ vase vattatīti paharati, itaropi na mayhaṃ vase vattatīti. Tatrāyaṃ bhikkhu kadāci imassa rañño vijite vicarati, kadāci etassa. Atha naṃ ‘‘carapuriso aya’’nti maññamānā anayabyasanaṃ pāpenti."
    ],
    "innerText": "Rajjasīmasannissite rājabhayaṃ hoti. Tañhi padesaṃ eko rājā na mayhaṃ vase vattatīti paharati, itaropi na mayhaṃ vase vattatīti. Tatrāyaṃ bhikkhu kadāci imassa rañño vijite vicarati, kadāci etassa. Atha naṃ ‘‘carapuriso aya’’nti maññamānā anayabyasanaṃ pāpenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asappāyatā"
      },
      "ti visabhāgarūpādiārammaṇasamosaraṇena vā amanussapariggahitatāya vā asappāyatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatridaṃ vatthu"
      },
      ". Eko kira thero araññe vasati. Athassa ekā yakkhinī paṇṇasāladvāre ṭhatvā gāyi. So nikkhamitvā dvāre aṭṭhāsi, sā gantvā caṅkamanasīse gāyi. Thero caṅkamanasīsaṃ agamāsi. Sā sataporise papāte ṭhatvā gāyi. Thero paṭinivatti. Atha naṃ sā vegenāgantvā gahetvā ‘‘mayā, bhante, na eko na dve tumhādisā khāditā’’ti āha."
    ],
    "innerText": "Asappāyatāti visabhāgarūpādiārammaṇasamosaraṇena vā amanussapariggahitatāya vā asappāyatā. Tatridaṃ vatthu. Eko kira thero araññe vasati. Athassa ekā yakkhinī paṇṇasāladvāre ṭhatvā gāyi. So nikkhamitvā dvāre aṭṭhāsi, sā gantvā caṅkamanasīse gāyi. Thero caṅkamanasīsaṃ agamāsi. Sā sataporise papāte ṭhatvā gāyi. Thero paṭinivatti. Atha naṃ sā vegenāgantvā gahetvā ‘‘mayā, bhante, na eko na dve tumhādisā khāditā’’ti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kalyāṇamittānaṃ alābho"
      },
      "ti yattha na sakkā hoti ācariyaṃ vā ācariyasamaṃ vā upajjhāyaṃ vā upajjhāyasamaṃ vā kalyāṇamittaṃ laddhuṃ. Tattha so kalyāṇamittānaṃ alābho mahādosoyevāti imesaṃ aṭṭhārasannaṃ dosānaṃ aññatarena samannāgato ananurūpoti veditabbo. Vuttampi cetaṃ aṭṭhakathāsu –"
    ],
    "innerText": "Kalyāṇamittānaṃ alābhoti yattha na sakkā hoti ācariyaṃ vā ācariyasamaṃ vā upajjhāyaṃ vā upajjhāyasamaṃ vā kalyāṇamittaṃ laddhuṃ. Tattha so kalyāṇamittānaṃ alābho mahādosoyevāti imesaṃ aṭṭhārasannaṃ dosānaṃ aññatarena samannāgato ananurūpoti veditabbo. Vuttampi cetaṃ aṭṭhakathāsu –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mahāvāsaṃ navāvāsaṃ, jarāvāsañca panthaniṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Soṇḍiṃ paṇṇañca pupphañca, phalaṃ patthitameva ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nagaraṃ dārunā khettaṃ, visabhāgena paṭṭanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paccantasīmāsappāyaṃ, yattha mitto na labbhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Aṭṭhārasetāni ",
      " ṭhānāni, iti viññāya paṇḍito;"
    ],
    "innerText": "Aṭṭhārasetāni ṭhānāni, iti viññāya paṇḍito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ārakā parivajjeyya, maggaṃ sappaṭibhayaṃ yathāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Anurūpavihāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "53"
      },
      ". Yo ",
      " pana gocaragāmato nātidūranāccāsannatādīhi pañcahaṅgehi samannāgato, ayaṃ anurūpo nāma. Vuttañhetaṃ bhagavatā – ‘‘kathañca, bhikkhave, senāsanaṃ pañcaṅgasamannāgataṃ hoti? Idha, bhikkhave, senāsanaṃ nātidūraṃ hoti nāccāsannaṃ gamanāgamanasampannaṃ, divā appākiṇṇaṃ rattiṃ appasaddaṃ appanigghosaṃ, appaḍaṃsamakasavātātapasarīsapasamphassaṃ, tasmiṃ kho pana senāsane viharantassa appakasireneva uppajjanti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārā. Tasmiṃ kho pana senāsane therā bhikkhū viharanti bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā, te kālena kālaṃ upasaṅkamitvā paripucchati paripañhati ‘idaṃ, bhante, kathaṃ imassa ko attho’ti, tassa te āyasmanto avivaṭañceva vivaranti, anuttānīkatañca uttānīkaronti, anekavihitesu ca kaṅkhaṭṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Evaṃ kho, bhikkhave, senāsanaṃ pañcaṅgasamannāgataṃ hotī’’ti (a. ni. 10.11)."
    ],
    "innerText": "53. Yo pana gocaragāmato nātidūranāccāsannatādīhi pañcahaṅgehi samannāgato, ayaṃ anurūpo nāma. Vuttañhetaṃ bhagavatā – ‘‘kathañca, bhikkhave, senāsanaṃ pañcaṅgasamannāgataṃ hoti? Idha, bhikkhave, senāsanaṃ nātidūraṃ hoti nāccāsannaṃ gamanāgamanasampannaṃ, divā appākiṇṇaṃ rattiṃ appasaddaṃ appanigghosaṃ, appaḍaṃsamakasavātātapasarīsapasamphassaṃ, tasmiṃ kho pana senāsane viharantassa appakasireneva uppajjanti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārā. Tasmiṃ kho pana senāsane therā bhikkhū viharanti bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā, te kālena kālaṃ upasaṅkamitvā paripucchati paripañhati ‘idaṃ, bhante, kathaṃ imassa ko attho’ti, tassa te āyasmanto avivaṭañceva vivaranti, anuttānīkatañca uttānīkaronti, anekavihitesu ca kaṅkhaṭṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Evaṃ kho, bhikkhave, senāsanaṃ pañcaṅgasamannāgataṃ hotī’’ti (a. ni. 10.11)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ ‘‘samādhibhāvanāya ananurūpaṃ vihāraṃ pahāya anurūpe vihāre viharantenā’’ti ettha vitthāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Khuddakapalibodhā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "54"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khuddakapalibodhupacchedaṃ katvā"
      },
      "ti evaṃ patirūpe vihāre viharantena yepissa te honti khuddakapalibodhā, tepi upacchinditabbā. Seyyathidaṃ, dīghāni kesanakhalomāni chinditabbāni. Jiṇṇacīvaresu daḷhīkammaṃ vā tunnakammaṃ vā kātabbaṃ. Kiliṭṭhāni vā rajitabbāni. Sace patte malaṃ hoti, patto pacitabbo. Mañcapīṭhādīni sodhetabbānīti. ‘‘Ayaṃ khuddakapalibodhupacchedaṃ katvā’’ti ettha vitthāro."
    ],
    "innerText": "54.Khuddakapalibodhupacchedaṃ katvāti evaṃ patirūpe vihāre viharantena yepissa te honti khuddakapalibodhā, tepi upacchinditabbā. Seyyathidaṃ, dīghāni kesanakhalomāni chinditabbāni. Jiṇṇacīvaresu daḷhīkammaṃ vā tunnakammaṃ vā kātabbaṃ. Kiliṭṭhāni vā rajitabbāni. Sace patte malaṃ hoti, patto pacitabbo. Mañcapīṭhādīni sodhetabbānīti. ‘‘Ayaṃ khuddakapalibodhupacchedaṃ katvā’’ti ettha vitthāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Bhāvanāvidhānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "55"
      },
      ". Idāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbaṃ bhāvanāvidhānaṃ aparihāpentena bhāvetabbo"
      },
      "ti ettha ayaṃ pathavīkasiṇaṃ ādiṃ katvā sabbakammaṭṭhānavasena vitthārakathā hoti."
    ],
    "innerText": "55. Idāni sabbaṃ bhāvanāvidhānaṃ aparihāpentena bhāvetabboti ettha ayaṃ pathavīkasiṇaṃ ādiṃ katvā sabbakammaṭṭhānavasena vitthārakathā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " upacchinnakhuddakapalibodhena hi bhikkhunā pacchābhattaṃ piṇḍapātapaṭikkantena bhattasammadaṃ paṭivinodetvā pavivitte okāse sukhanisinnena katāya vā akatāya vā pathaviyā nimittaṃ gaṇhitabbaṃ. Vuttañhetaṃ –"
    ],
    "innerText": "Evaṃ upacchinnakhuddakapalibodhena hi bhikkhunā pacchābhattaṃ piṇḍapātapaṭikkantena bhattasammadaṃ paṭivinodetvā pavivitte okāse sukhanisinnena katāya vā akatāya vā pathaviyā nimittaṃ gaṇhitabbaṃ. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Pathavīkasiṇaṃ uggaṇhanto pathaviyaṃ nimittaṃ gaṇhāti kate vā akate vā sāntake, no anantake, sakoṭiye, no akoṭiye, savaṭṭume, no avaṭṭume, sapariyante, no apariyante, suppamatte vā sarāvamatte vā. So taṃ nimittaṃ suggahitaṃ karoti, sūpadhāritaṃ upadhāreti, suvavatthitaṃ vavatthapeti. So taṃ nimittaṃ suggahitaṃ katvā sūpadhāritaṃ upadhāretvā suvavatthitaṃ vavatthapetvā ānisaṃsadassāvī ratanasaññī hutvā cittīkāraṃ upaṭṭhapetvā sampiyāyamāno tasmiṃ ārammaṇe cittaṃ upanibandhati ‘addhā imāya paṭipadāya jarāmaraṇamhā muccissāmī’ti. So vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yena atītabhavepi sāsane vā isipabbajjāya vā pabbajitvā pathavīkasiṇe catukkapañcakajjhānāni nibbattitapubbāni, evarūpassa puññavato upanissayasampannassa akatāya pathaviyā kasitaṭṭhāne vā khalamaṇḍale vā nimittaṃ uppajjati, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mallakattherassa"
      },
      " viya. Tassa kirāyasmato kasitaṭṭhānaṃ olokentassa taṃṭhānappamāṇameva nimittaṃ udapādi. So taṃ vaḍḍhetvā pañcakajjhānāni nibbattetvā jhānapadaṭṭhānaṃ vipassanaṃ paṭṭhapetvā arahattaṃ pāpuṇi."
    ],
    "innerText": "Tattha yena atītabhavepi sāsane vā isipabbajjāya vā pabbajitvā pathavīkasiṇe catukkapañcakajjhānāni nibbattitapubbāni, evarūpassa puññavato upanissayasampannassa akatāya pathaviyā kasitaṭṭhāne vā khalamaṇḍale vā nimittaṃ uppajjati, mallakattherassa viya. Tassa kirāyasmato kasitaṭṭhānaṃ olokentassa taṃṭhānappamāṇameva nimittaṃ udapādi. So taṃ vaḍḍhetvā pañcakajjhānāni nibbattetvā jhānapadaṭṭhānaṃ vipassanaṃ paṭṭhapetvā arahattaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yo panevaṃ akatādhikāro hoti, tena ācariyasantike uggahitakammaṭṭhānavidhānaṃ avirādhetvā cattāro kasiṇadose pariharantena kasiṇaṃ kātabbaṃ. Nīlapītalohitaodātasambhedavasena hi cattāro pathavīkasiṇadosā. Tasmā nīlādivaṇṇaṃ mattikaṃ aggahetvā gaṅgāvahe mattikāsadisāya aruṇavaṇṇāya mattikāya kasiṇaṃ kātabbaṃ. Tañca kho vihāramajjhe sāmaṇerādīnaṃ ",
      " sañcaraṇaṭṭhāne na kātabbaṃ. Vihārapaccante pana paṭicchannaṭṭhāne pabbhāre vā paṇṇasālāya vā saṃhārimaṃ vā tatraṭṭhakaṃ vā kātabbaṃ. Tatra saṃhārimaṃ catūsu daṇḍakesu pilotikaṃ ",
      " vā cammaṃ vā kaṭasārakaṃ vā bandhitvā tattha apanītatiṇamūlasakkharakathalikāya sumadditāya mattikāya vuttappamāṇaṃ vaṭṭaṃ limpetvā kātabbaṃ. Taṃ parikammakāle bhūmiyaṃ attharitvā oloketabbaṃ. Tatraṭṭhakaṃ bhūmiyaṃ padumakaṇṇikākārena khāṇuke ākoṭetvā vallīhi vinandhitvā kātabbaṃ. Yadi sā mattikā nappahoti, adho aññaṃ pakkhipitvā uparibhāge suparisodhitāya aruṇavaṇṇāya mattikāya vidatthicaturaṅgulavitthāraṃ vaṭṭaṃ kātabbaṃ. Etadeva hi pamāṇaṃ sandhāya ‘‘suppamattaṃ vā sarāvamattaṃ vā’’ti vuttaṃ. ‘‘Sāntake no anantake’’tiādi panassa paricchedatthāya vuttaṃ."
    ],
    "innerText": "Yo panevaṃ akatādhikāro hoti, tena ācariyasantike uggahitakammaṭṭhānavidhānaṃ avirādhetvā cattāro kasiṇadose pariharantena kasiṇaṃ kātabbaṃ. Nīlapītalohitaodātasambhedavasena hi cattāro pathavīkasiṇadosā. Tasmā nīlādivaṇṇaṃ mattikaṃ aggahetvā gaṅgāvahe mattikāsadisāya aruṇavaṇṇāya mattikāya kasiṇaṃ kātabbaṃ. Tañca kho vihāramajjhe sāmaṇerādīnaṃ sañcaraṇaṭṭhāne na kātabbaṃ. Vihārapaccante pana paṭicchannaṭṭhāne pabbhāre vā paṇṇasālāya vā saṃhārimaṃ vā tatraṭṭhakaṃ vā kātabbaṃ. Tatra saṃhārimaṃ catūsu daṇḍakesu pilotikaṃ vā cammaṃ vā kaṭasārakaṃ vā bandhitvā tattha apanītatiṇamūlasakkharakathalikāya sumadditāya mattikāya vuttappamāṇaṃ vaṭṭaṃ limpetvā kātabbaṃ. Taṃ parikammakāle bhūmiyaṃ attharitvā oloketabbaṃ. Tatraṭṭhakaṃ bhūmiyaṃ padumakaṇṇikākārena khāṇuke ākoṭetvā vallīhi vinandhitvā kātabbaṃ. Yadi sā mattikā nappahoti, adho aññaṃ pakkhipitvā uparibhāge suparisodhitāya aruṇavaṇṇāya mattikāya vidatthicaturaṅgulavitthāraṃ vaṭṭaṃ kātabbaṃ. Etadeva hi pamāṇaṃ sandhāya ‘‘suppamattaṃ vā sarāvamattaṃ vā’’ti vuttaṃ. ‘‘Sāntake no anantake’’tiādi panassa paricchedatthāya vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "56"
      },
      ". Tasmā evaṃ vuttappamāṇaparicchedaṃ katvā rukkhapāṇikā visabhāgavaṇṇaṃ samuṭṭhapeti. Tasmā taṃ aggahetvā pāsāṇapāṇikāya ghaṃsetvā samaṃ bherītalasadisaṃ katvā taṃ ṭhānaṃ sammajjitvā nhatvā āgantvā kasiṇamaṇḍalato aḍḍhateyyahatthantare padese paññatte vidatthicaturaṅgulapādake suatthate pīṭhe nisīditabbaṃ. Tato dūratare nisinnassa hi kasiṇaṃ na upaṭṭhāti, āsannatare kasiṇadosā paññāyanti. Uccatare nisinnena gīvaṃ onamitvā oloketabbaṃ hoti, nīcatare jaṇṇukāni rujanti. Tasmā vuttanayeneva nisīditvā ‘‘appassādā kāmā’’tiādinā nayena kāmesu ādīnavaṃ paccavekkhitvā kāmanissaraṇe sabbadukkhasamatikkamupāyabhūte nekkhamme jātābhilāsena buddhadhammasaṅghaguṇānussaraṇena pītipāmojjaṃ janayitvā ‘‘ayaṃ dāni sā sabbabuddha paccekabuddha ariyasāvakehi paṭipannā nekkhammapaṭipadā’’ti paṭipattiyā sañjātagāravena ‘‘addhā imāya paṭipadāya pavivekasukharasassa bhāgī bhavissāmī’’ti ussāhaṃ janayitvā samena ākārena cakkhūni ummīletvā nimittaṃ gaṇhantena bhāvetabbaṃ."
    ],
    "innerText": "56. Tasmā evaṃ vuttappamāṇaparicchedaṃ katvā rukkhapāṇikā visabhāgavaṇṇaṃ samuṭṭhapeti. Tasmā taṃ aggahetvā pāsāṇapāṇikāya ghaṃsetvā samaṃ bherītalasadisaṃ katvā taṃ ṭhānaṃ sammajjitvā nhatvā āgantvā kasiṇamaṇḍalato aḍḍhateyyahatthantare padese paññatte vidatthicaturaṅgulapādake suatthate pīṭhe nisīditabbaṃ. Tato dūratare nisinnassa hi kasiṇaṃ na upaṭṭhāti, āsannatare kasiṇadosā paññāyanti. Uccatare nisinnena gīvaṃ onamitvā oloketabbaṃ hoti, nīcatare jaṇṇukāni rujanti. Tasmā vuttanayeneva nisīditvā ‘‘appassādā kāmā’’tiādinā nayena kāmesu ādīnavaṃ paccavekkhitvā kāmanissaraṇe sabbadukkhasamatikkamupāyabhūte nekkhamme jātābhilāsena buddhadhammasaṅghaguṇānussaraṇena pītipāmojjaṃ janayitvā ‘‘ayaṃ dāni sā sabbabuddha paccekabuddha ariyasāvakehi paṭipannā nekkhammapaṭipadā’’ti paṭipattiyā sañjātagāravena ‘‘addhā imāya paṭipadāya pavivekasukharasassa bhāgī bhavissāmī’’ti ussāhaṃ janayitvā samena ākārena cakkhūni ummīletvā nimittaṃ gaṇhantena bhāvetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atiummīlayato hi cakkhu kilamati, maṇḍalañca ativibhūtaṃ hoti, tenassa nimittaṃ nuppajjati. Atimandaṃ ummīlayato maṇḍalamavibhūtaṃ hoti, cittañca līnaṃ hoti, evampi nimittaṃ nuppajjati. Tasmā ādāsatale mukhanimittadassinā viya samenākārena cakkhūni ummīletvā nimittaṃ gaṇhantena bhāvetabbaṃ, na vaṇṇo paccavekkhitabbo, na lakkhaṇaṃ manasikātabbaṃ. Apica vaṇṇaṃ ",
      " amuñcitvā nissayasavaṇṇaṃ katvā ussadavasena paṇṇattidhamme cittaṃ ",
      " paṭṭhapetvā manasi kātabbaṃ. Pathavī mahī, medinī, bhūmi, vasudhā, vasundharātiādīsu pathavīnāmesu yamicchati, yadassa saññānukūlaṃ hoti, taṃ vattabbaṃ. Apica pathavīti etadeva nāmaṃ pākaṭaṃ, tasmā pākaṭavaseneva pathavī pathavīti bhāvetabbaṃ. Kālena ummīletvā kālena nimīletvā āvajjitabbaṃ. Yāva uggahanimittaṃ nuppajjati, tāva kālasatampi kālasahassampi tato bhiyyopi eteneva nayena bhāvetabbaṃ."
    ],
    "innerText": "Atiummīlayato hi cakkhu kilamati, maṇḍalañca ativibhūtaṃ hoti, tenassa nimittaṃ nuppajjati. Atimandaṃ ummīlayato maṇḍalamavibhūtaṃ hoti, cittañca līnaṃ hoti, evampi nimittaṃ nuppajjati. Tasmā ādāsatale mukhanimittadassinā viya samenākārena cakkhūni ummīletvā nimittaṃ gaṇhantena bhāvetabbaṃ, na vaṇṇo paccavekkhitabbo, na lakkhaṇaṃ manasikātabbaṃ. Apica vaṇṇaṃ amuñcitvā nissayasavaṇṇaṃ katvā ussadavasena paṇṇattidhamme cittaṃ paṭṭhapetvā manasi kātabbaṃ. Pathavī mahī, medinī, bhūmi, vasudhā, vasundharātiādīsu pathavīnāmesu yamicchati, yadassa saññānukūlaṃ hoti, taṃ vattabbaṃ. Apica pathavīti etadeva nāmaṃ pākaṭaṃ, tasmā pākaṭavaseneva pathavī pathavīti bhāvetabbaṃ. Kālena ummīletvā kālena nimīletvā āvajjitabbaṃ. Yāva uggahanimittaṃ nuppajjati, tāva kālasatampi kālasahassampi tato bhiyyopi eteneva nayena bhāvetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "57"
      },
      ". Tassevaṃ bhāvayato yadā nimīletvā āvajjantassa ummīlitakāle viya āpāthamāgacchati, tadā uggahanimittaṃ jātaṃ nāma hoti. Tassa jātakālato paṭṭhāya na tasmiṃ ṭhāne nisīditabbaṃ. Attano vasanaṭṭhānaṃ pavisitvā tattha nisinnena bhāvetabbaṃ. Pādadhovanapapañcaparihāratthaṃ panassa ekapaṭalikupāhanā ca kattaradaṇḍo ca icchitabbo. Athānena sace taruṇo samādhi kenacideva asappāyakāraṇena nassati, upāhanā āruyha kattaradaṇḍaṃ gahetvā taṃ ṭhānaṃ gantvā nimittaṃ ādāya āgantvā sukhanisinnena bhāvetabbaṃ, punappunaṃ samannāharitabbaṃ, takkāhataṃ vitakkāhataṃ kātabbaṃ. Tassevaṃ karontassa anukkamena nīvaraṇāni vikkhambhanti, kilesā sannisīdanti, upacārasamādhinā cittaṃ samādhiyati, paṭibhāganimittaṃ uppajjati."
    ],
    "innerText": "57. Tassevaṃ bhāvayato yadā nimīletvā āvajjantassa ummīlitakāle viya āpāthamāgacchati, tadā uggahanimittaṃ jātaṃ nāma hoti. Tassa jātakālato paṭṭhāya na tasmiṃ ṭhāne nisīditabbaṃ. Attano vasanaṭṭhānaṃ pavisitvā tattha nisinnena bhāvetabbaṃ. Pādadhovanapapañcaparihāratthaṃ panassa ekapaṭalikupāhanā ca kattaradaṇḍo ca icchitabbo. Athānena sace taruṇo samādhi kenacideva asappāyakāraṇena nassati, upāhanā āruyha kattaradaṇḍaṃ gahetvā taṃ ṭhānaṃ gantvā nimittaṃ ādāya āgantvā sukhanisinnena bhāvetabbaṃ, punappunaṃ samannāharitabbaṃ, takkāhataṃ vitakkāhataṃ kātabbaṃ. Tassevaṃ karontassa anukkamena nīvaraṇāni vikkhambhanti, kilesā sannisīdanti, upacārasamādhinā cittaṃ samādhiyati, paṭibhāganimittaṃ uppajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatrāyaṃ purimassa ca uggahanimittassa imassa ca viseso, uggahanimitte kasiṇadoso paññāyati, paṭibhāganimittaṃ thavikato nihatādāsamaṇḍalaṃ viya sudhotasaṅkhathālaṃ viya valāhakantarā nikkhantacandamaṇḍalaṃ viya meghamukhe balākā viya uggahanimittaṃ padāletvā nikkhantamiva tato sataguṇaṃ sahassaguṇaṃ suparisuddhaṃ hutvā upaṭṭhāti. Tañca kho neva vaṇṇavantaṃ, na saṇṭhānavantaṃ. Yadi hi taṃ īdisaṃ bhaveyya, cakkhuviññeyyaṃ siyā oḷārikaṃ sammasanupagaṃ tilakkhaṇabbhāhataṃ, na panetaṃ tādisaṃ. Kevalañhi samādhilābhino upaṭṭhānākāramattaṃ saññajametanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "58"
      },
      ". Uppannakālato ca panassa paṭṭhāya nīvaraṇāni vikkhambhitāneva honti, kilesā sannisinnāva, upacārasamādhinā cittaṃ samāhitamevāti."
    ],
    "innerText": "58. Uppannakālato ca panassa paṭṭhāya nīvaraṇāni vikkhambhitāneva honti, kilesā sannisinnāva, upacārasamādhinā cittaṃ samāhitamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Duvidho ",
      " hi samādhi upacārasamādhi ca appanāsamādhi ca. Dvīhākārehi cittaṃ samādhiyati ",
      " upacārabhūmiyaṃ vā paṭilābhabhūmiyaṃ vā. Tattha upacārabhūmiyaṃ nīvaraṇappahānena cittaṃ samāhitaṃ hoti. Paṭilābhabhūmiyaṃ aṅgapātubhāvena."
    ],
    "innerText": "Duvidho hi samādhi upacārasamādhi ca appanāsamādhi ca. Dvīhākārehi cittaṃ samādhiyati upacārabhūmiyaṃ vā paṭilābhabhūmiyaṃ vā. Tattha upacārabhūmiyaṃ nīvaraṇappahānena cittaṃ samāhitaṃ hoti. Paṭilābhabhūmiyaṃ aṅgapātubhāvena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dvinnaṃ pana samādhīnaṃ idaṃ nānākāraṇaṃ, upacāre aṅgāni na thāmajātāni honti, aṅgānaṃ athāmajātattā, yathā nāma daharo kumārako ukkhipitvā ṭhapiyamāno punappunaṃ bhūmiyaṃ patati, evameva upacāre uppanne cittaṃ kālena nimittamārammaṇaṃ karoti, kālena bhavaṅgamotarati. Appanāyaṃ pana aṅgāni thāmajātāni honti, tesaṃ thāmajātattā, yathā nāma balavā puriso āsanā vuṭṭhāya divasampi tiṭṭheyya, evameva appanāsamādhimhi uppanne cittaṃ sakiṃ bhavaṅgavāraṃ chinditvā kevalampi rattiṃ kevalampi divasaṃ tiṭṭhati, kusalajavanapaṭipāṭivaseneva pavattatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatra yadetaṃ upacārasamādhinā saddhiṃ paṭibhāganimittaṃ uppannaṃ, tassa uppādanaṃ nāma atidukkaraṃ. Tasmā sace teneva pallaṅkena taṃ nimittaṃ vaḍḍhetvā appanaṃ adhigantuṃ sakkoti, sundaraṃ. No ce sakkoti, athānena taṃ nimittaṃ appamattena cakkavattigabbho viya rakkhitabbaṃ. Evañhi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nimittaṃ rakkhato laddha-parihāni na vijjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ārakkhamhi asantamhi, laddhaṃ laddhaṃ vinassati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sattasappāyā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "59"
      },
      ". Tatrāyaṃ rakkhaṇavidhi –"
    ],
    "innerText": "59. Tatrāyaṃ rakkhaṇavidhi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āvāso gocaro bhassaṃ, puggalo bhojanaṃ utu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Iriyāpathoti sattete, asappāye vivajjaye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sappāye satta sevetha, evañhi paṭipajjato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nacireneva kālena, hoti kassaci appanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrassa ",
      " yasmiṃ āvāse vasantassa anuppannaṃ vā nimittaṃ nuppajjati, uppannaṃ vā vinassati, anupaṭṭhitā ca sati na upaṭṭhāti, asamāhitañca cittaṃ na samādhiyati, ayaṃ asappāyo. Yattha nimittaṃ uppajjati ceva thāvarañca hoti ",
      ", sati upaṭṭhāti, cittaṃ samādhiyati nāgapabbatavāsīpadhāniyatissattherassa viya, ayaṃ sappāyo. Tasmā yasmiṃ vihāre bahū āvāsā honti, tattha ekamekasmiṃ tīṇi tīṇi divasāni vasitvā yatthassa cittaṃ ekaggaṃ hoti, tattha vasitabbaṃ. Āvāsasappāyatāya hi tambapaṇṇidīpamhi cūḷanāgaleṇe vasantā tattheva kammaṭṭhānaṃ gahetvā pañcasatā bhikkhū arahattaṃ pāpuṇiṃsu. Sotāpannādīnaṃ pana aññattha ariyabhūmiṃ patvā tattha arahattappattānañca gaṇanā natthi. Evamaññesupi cittalapabbatavihārādīsu."
    ],
    "innerText": "Tatrassa yasmiṃ āvāse vasantassa anuppannaṃ vā nimittaṃ nuppajjati, uppannaṃ vā vinassati, anupaṭṭhitā ca sati na upaṭṭhāti, asamāhitañca cittaṃ na samādhiyati, ayaṃ asappāyo. Yattha nimittaṃ uppajjati ceva thāvarañca hoti , sati upaṭṭhāti, cittaṃ samādhiyati nāgapabbatavāsīpadhāniyatissattherassa viya, ayaṃ sappāyo. Tasmā yasmiṃ vihāre bahū āvāsā honti, tattha ekamekasmiṃ tīṇi tīṇi divasāni vasitvā yatthassa cittaṃ ekaggaṃ hoti, tattha vasitabbaṃ. Āvāsasappāyatāya hi tambapaṇṇidīpamhi cūḷanāgaleṇe vasantā tattheva kammaṭṭhānaṃ gahetvā pañcasatā bhikkhū arahattaṃ pāpuṇiṃsu. Sotāpannādīnaṃ pana aññattha ariyabhūmiṃ patvā tattha arahattappattānañca gaṇanā natthi. Evamaññesupi cittalapabbatavihārādīsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gocaragāmo"
      },
      " pana yo senāsanato uttarena vā dakkhiṇena vā nātidūre diyaḍḍhakosabbhantare hoti sulabhasampannabhikkho, so sappāyo. Viparīto asappāyo."
    ],
    "innerText": "Gocaragāmo pana yo senāsanato uttarena vā dakkhiṇena vā nātidūre diyaḍḍhakosabbhantare hoti sulabhasampannabhikkho, so sappāyo. Viparīto asappāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhassa"
      },
      "nti dvattiṃsatiracchānakathāpariyāpannaṃ asappāyaṃ, tañhissa nimittantaradhānāya saṃvattati. Dasakathāvatthunissitaṃ sappāyaṃ, tampi mattāya bhāsitabbaṃ."
    ],
    "innerText": "Bhassanti dvattiṃsatiracchānakathāpariyāpannaṃ asappāyaṃ, tañhissa nimittantaradhānāya saṃvattati. Dasakathāvatthunissitaṃ sappāyaṃ, tampi mattāya bhāsitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puggalo"
      },
      "pi atiracchānakathiko sīlādiguṇasampanno, yaṃ nissāya asamāhitaṃ vā cittaṃ samādhiyati, samāhitaṃ vā cittaṃ thirataraṃ hoti, evarūpo sappāyo. Kāyadaḷhībahulo pana tiracchānakathiko asappāyo. So hi taṃ kaddamodakamiva acchaṃ udakaṃ malīnameva karoti, tādisañca āgamma koṭapabbatavāsīdaharasseva samāpattipi nassati, pageva nimittaṃ."
    ],
    "innerText": "Puggalopi atiracchānakathiko sīlādiguṇasampanno, yaṃ nissāya asamāhitaṃ vā cittaṃ samādhiyati, samāhitaṃ vā cittaṃ thirataraṃ hoti, evarūpo sappāyo. Kāyadaḷhībahulo pana tiracchānakathiko asappāyo. So hi taṃ kaddamodakamiva acchaṃ udakaṃ malīnameva karoti, tādisañca āgamma koṭapabbatavāsīdaharasseva samāpattipi nassati, pageva nimittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhojanaṃ"
      },
      " pana kassaci madhuraṃ, kassaci ambilaṃ sappāyaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Utu"
      },
      "pi kassaci sīto, kassaci uṇho sappāyo hoti. Tasmā yaṃ bhojanaṃ vā utuṃ vā sevantassa phāsu hoti, asamāhitaṃ vā cittaṃ samādhiyati, samāhitaṃ vā thirataraṃ hoti, taṃ bhojanaṃ so ca utu sappāyo. Itaraṃ bhojanaṃ itaro ca utu asappāyo."
    ],
    "innerText": "Bhojanaṃ pana kassaci madhuraṃ, kassaci ambilaṃ sappāyaṃ hoti. Utupi kassaci sīto, kassaci uṇho sappāyo hoti. Tasmā yaṃ bhojanaṃ vā utuṃ vā sevantassa phāsu hoti, asamāhitaṃ vā cittaṃ samādhiyati, samāhitaṃ vā thirataraṃ hoti, taṃ bhojanaṃ so ca utu sappāyo. Itaraṃ bhojanaṃ itaro ca utu asappāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iriyāpathesu"
      },
      "pi kassaci caṅkamo sappāyo hoti, kassaci sayanaṭṭhānanisajjānaṃ aññataro. Tasmā taṃ āvāsaṃ viya tīṇi divasāni upaparikkhitvā yasmiṃ iriyāpathe asamāhitaṃ ",
      " vā cittaṃ samādhiyati, samāhitaṃ vā thirataraṃ hoti, so sappāyo. Itaro asappāyoti veditabbo."
    ],
    "innerText": "Iriyāpathesupi kassaci caṅkamo sappāyo hoti, kassaci sayanaṭṭhānanisajjānaṃ aññataro. Tasmā taṃ āvāsaṃ viya tīṇi divasāni upaparikkhitvā yasmiṃ iriyāpathe asamāhitaṃ vā cittaṃ samādhiyati, samāhitaṃ vā thirataraṃ hoti, so sappāyo. Itaro asappāyoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iti ",
      " imaṃ sattavidhaṃ asappāyaṃ vajjetvā sappāyaṃ sevitabbaṃ. Evaṃ paṭipannassa hi nimittāsevanabahulassa nacireneva kālena hoti kassaci appanā."
    ],
    "innerText": "Iti imaṃ sattavidhaṃ asappāyaṃ vajjetvā sappāyaṃ sevitabbaṃ. Evaṃ paṭipannassa hi nimittāsevanabahulassa nacireneva kālena hoti kassaci appanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dasavidhaappanākosallaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "60"
      },
      ". Yassa pana evampi paṭipajjato na hoti, tena dasavidhaṃ appanākosallaṃ sampādetabbaṃ. Tatrāyaṃ nayo, dasāhākārehi appanākosallaṃ icchitabbaṃ, vatthuvisadakiriyato, indriyasamattapaṭipādanato, nimittakusalato, yasmiṃ samaye cittaṃ paggahetabbaṃ tasmiṃ samaye cittaṃ paggaṇhāti, yasmiṃ samaye cittaṃ niggahetabbaṃ tasmiṃ samaye cittaṃ niggaṇhāti, yasmiṃ samaye cittaṃ sampahaṃsitabbaṃ tasmiṃ samaye cittaṃ sampahaṃseti, yasmiṃ samaye cittaṃ ajjhupekkhitabbaṃ tasmiṃ samaye cittaṃ ajjhupekkhati, asamāhitapuggalaparivajjanato, samāhitapuggalasevanato, tadadhimuttatoti."
    ],
    "innerText": "60. Yassa pana evampi paṭipajjato na hoti, tena dasavidhaṃ appanākosallaṃ sampādetabbaṃ. Tatrāyaṃ nayo, dasāhākārehi appanākosallaṃ icchitabbaṃ, vatthuvisadakiriyato, indriyasamattapaṭipādanato, nimittakusalato, yasmiṃ samaye cittaṃ paggahetabbaṃ tasmiṃ samaye cittaṃ paggaṇhāti, yasmiṃ samaye cittaṃ niggahetabbaṃ tasmiṃ samaye cittaṃ niggaṇhāti, yasmiṃ samaye cittaṃ sampahaṃsitabbaṃ tasmiṃ samaye cittaṃ sampahaṃseti, yasmiṃ samaye cittaṃ ajjhupekkhitabbaṃ tasmiṃ samaye cittaṃ ajjhupekkhati, asamāhitapuggalaparivajjanato, samāhitapuggalasevanato, tadadhimuttatoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "61"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vatthuvisadakiriyā"
      },
      " nāma ajjhattikabāhirānaṃ vatthūnaṃ visadabhāvakaraṇaṃ. Yadā hissa kesanakhalomāni dīghāni honti, sarīraṃ vā sedamalaggahitaṃ, tadā ajjhattikavatthu avisadaṃ hoti aparisuddhaṃ. Yadā panassa cīvaraṃ jiṇṇaṃ kiliṭṭhaṃ duggandhaṃ hoti, senāsanaṃ vā uklāpaṃ hoti, tadā bāhiravatthu avisadaṃ hoti aparisuddhaṃ. Ajjhattikabāhire ca vatthumhi avisade uppannesu cittacetasikesu ñāṇampi aparisuddhaṃ hoti, aparisuddhāni dīpakapallikavaṭṭitelāni nissāya uppannadīpasikhāya obhāso viya. Aparisuddhena ñāṇena saṅkhāre sammasato saṅkhārāpi avibhūtā honti, kammaṭṭhānamanuyuñjato kammaṭṭhānampi vuḍḍhiṃ viruḷhiṃ vepullaṃ na gacchati. Visade pana ajjhattikabāhire vatthumhi uppannesu cittacetasikesu ñāṇampi visadaṃ hoti parisuddhaṃ, parisuddhāni dīpakapallikavaṭṭitelāni nissāya uppannadīpasikhāya obhāso viya. Parisuddhena ca ñāṇena saṅkhāre sammasato saṅkhārāpi vibhūtā honti, kammaṭṭhānamanuyuñjato kammaṭṭhānampi vuḍḍhiṃ virūḷhiṃ vepullaṃ gacchati."
    ],
    "innerText": "61. Tattha vatthuvisadakiriyā nāma ajjhattikabāhirānaṃ vatthūnaṃ visadabhāvakaraṇaṃ. Yadā hissa kesanakhalomāni dīghāni honti, sarīraṃ vā sedamalaggahitaṃ, tadā ajjhattikavatthu avisadaṃ hoti aparisuddhaṃ. Yadā panassa cīvaraṃ jiṇṇaṃ kiliṭṭhaṃ duggandhaṃ hoti, senāsanaṃ vā uklāpaṃ hoti, tadā bāhiravatthu avisadaṃ hoti aparisuddhaṃ. Ajjhattikabāhire ca vatthumhi avisade uppannesu cittacetasikesu ñāṇampi aparisuddhaṃ hoti, aparisuddhāni dīpakapallikavaṭṭitelāni nissāya uppannadīpasikhāya obhāso viya. Aparisuddhena ñāṇena saṅkhāre sammasato saṅkhārāpi avibhūtā honti, kammaṭṭhānamanuyuñjato kammaṭṭhānampi vuḍḍhiṃ viruḷhiṃ vepullaṃ na gacchati. Visade pana ajjhattikabāhire vatthumhi uppannesu cittacetasikesu ñāṇampi visadaṃ hoti parisuddhaṃ, parisuddhāni dīpakapallikavaṭṭitelāni nissāya uppannadīpasikhāya obhāso viya. Parisuddhena ca ñāṇena saṅkhāre sammasato saṅkhārāpi vibhūtā honti, kammaṭṭhānamanuyuñjato kammaṭṭhānampi vuḍḍhiṃ virūḷhiṃ vepullaṃ gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "62"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Indriyasamattapaṭipādanaṃ"
      },
      " nāma saddhādīnaṃ indriyānaṃ samabhāvakaraṇaṃ. Sace hissa saddhindriyaṃ balavaṃ hoti itarāni mandāni, tato vīriyindriyaṃ paggahakiccaṃ ",
      ", satindriyaṃ upaṭṭhānakiccaṃ, samādhindriyaṃ avikkhepakiccaṃ, paññindriyaṃ dassanakiccaṃ kātuṃ na sakkoti, tasmā taṃ dhammasabhāvapaccavekkhaṇena vā yathā vā manasikaroto balavaṃ jātaṃ, tathā amanasikārena hāpetabbaṃ. Vakkalittheravatthu cettha nidassanaṃ. Sace pana vīriyindriyaṃ balavaṃ hoti, atha neva saddhindriyaṃ adhimokkhakiccaṃ kātuṃ sakkoti, na itarāni itarakiccabhedaṃ, tasmā taṃ passaddhādibhāvanāya hāpetabbaṃ. Tatrāpi soṇattheravatthu dassetabbaṃ. Evaṃ sesesupi ekassa balavabhāve sati itaresaṃ attano kiccesu asamatthatā veditabbā. Visesato panettha saddhāpaññānaṃ samādhivīriyānañca samataṃ pasaṃsanti. Balavasaddho hi mandapañño muddhappasanno hoti, avatthusmiṃ pasīdati. Balavapañño mandasaddho kerāṭikapakkhaṃ bhajati, bhesajjasamuṭṭhito viya rogo atekiccho hoti. Ubhinnaṃ samatāya vatthusmiṃyeva pasīdati. Balavasamādhiṃ pana mandavīriyaṃ samādhissa kosajjapakkhattā kosajjaṃ abhibhavati. Balavavīriyaṃ mandasamādhiṃ vīriyassa uddhaccapakkhattā uddhaccaṃ abhibhavati. Samādhi pana vīriyena saṃyojito kosajje patituṃ na labhati. Vīriyaṃ samādhinā saṃyojitaṃ uddhacce patituṃ na labhati, tasmā tadubhayaṃ samaṃ kātabbaṃ. Ubhayasamatāya hi appanā hoti. Apica samādhikammikassa balavatīpi saddhā vaṭṭati. Evaṃ saddahanto okappento appanaṃ pāpuṇissati. Samādhipaññāsu pana samādhikammikassa ekaggatā balavatī vaṭṭati. Evañhi so appanaṃ pāpuṇāti. Vipassanākammikassa paññā balavatī vaṭṭati. Evañhi so lakkhaṇapaṭivedhaṃ pāpuṇāti. Ubhinnaṃ pana samatāyapi appanā hotiyeva. Sati pana sabbattha balavatī vaṭṭati. Sati hi cittaṃ uddhaccapakkhikānaṃ saddhāvīriyapaññānaṃ vasena uddhaccapātato kosajjapakkhena ca samādhinā kosajjapātato rakkhati, tasmā sā loṇadhūpanaṃ viya sabbabyañjanesu, sabbakammikaamacco viya ca sabbarājakiccesu sabbattha icchitabbā. Tenāha – ‘‘sati ca pana sabbatthikā vuttā bhagavatā. Kiṃ kāraṇā? Cittañhi satipaṭisaraṇaṃ, ārakkhapaccupaṭṭhānā ca sati, na vinā satiyā cittassa paggahaniggaho hotī’’ti."
    ],
    "innerText": "62.Indriyasamattapaṭipādanaṃ nāma saddhādīnaṃ indriyānaṃ samabhāvakaraṇaṃ. Sace hissa saddhindriyaṃ balavaṃ hoti itarāni mandāni, tato vīriyindriyaṃ paggahakiccaṃ , satindriyaṃ upaṭṭhānakiccaṃ, samādhindriyaṃ avikkhepakiccaṃ, paññindriyaṃ dassanakiccaṃ kātuṃ na sakkoti, tasmā taṃ dhammasabhāvapaccavekkhaṇena vā yathā vā manasikaroto balavaṃ jātaṃ, tathā amanasikārena hāpetabbaṃ. Vakkalittheravatthu cettha nidassanaṃ. Sace pana vīriyindriyaṃ balavaṃ hoti, atha neva saddhindriyaṃ adhimokkhakiccaṃ kātuṃ sakkoti, na itarāni itarakiccabhedaṃ, tasmā taṃ passaddhādibhāvanāya hāpetabbaṃ. Tatrāpi soṇattheravatthu dassetabbaṃ. Evaṃ sesesupi ekassa balavabhāve sati itaresaṃ attano kiccesu asamatthatā veditabbā. Visesato panettha saddhāpaññānaṃ samādhivīriyānañca samataṃ pasaṃsanti. Balavasaddho hi mandapañño muddhappasanno hoti, avatthusmiṃ pasīdati. Balavapañño mandasaddho kerāṭikapakkhaṃ bhajati, bhesajjasamuṭṭhito viya rogo atekiccho hoti. Ubhinnaṃ samatāya vatthusmiṃyeva pasīdati. Balavasamādhiṃ pana mandavīriyaṃ samādhissa kosajjapakkhattā kosajjaṃ abhibhavati. Balavavīriyaṃ mandasamādhiṃ vīriyassa uddhaccapakkhattā uddhaccaṃ abhibhavati. Samādhi pana vīriyena saṃyojito kosajje patituṃ na labhati. Vīriyaṃ samādhinā saṃyojitaṃ uddhacce patituṃ na labhati, tasmā tadubhayaṃ samaṃ kātabbaṃ. Ubhayasamatāya hi appanā hoti. Apica samādhikammikassa balavatīpi saddhā vaṭṭati. Evaṃ saddahanto okappento appanaṃ pāpuṇissati. Samādhipaññāsu pana samādhikammikassa ekaggatā balavatī vaṭṭati. Evañhi so appanaṃ pāpuṇāti. Vipassanākammikassa paññā balavatī vaṭṭati. Evañhi so lakkhaṇapaṭivedhaṃ pāpuṇāti. Ubhinnaṃ pana samatāyapi appanā hotiyeva. Sati pana sabbattha balavatī vaṭṭati. Sati hi cittaṃ uddhaccapakkhikānaṃ saddhāvīriyapaññānaṃ vasena uddhaccapātato kosajjapakkhena ca samādhinā kosajjapātato rakkhati, tasmā sā loṇadhūpanaṃ viya sabbabyañjanesu, sabbakammikaamacco viya ca sabbarājakiccesu sabbattha icchitabbā. Tenāha – ‘‘sati ca pana sabbatthikā vuttā bhagavatā. Kiṃ kāraṇā? Cittañhi satipaṭisaraṇaṃ, ārakkhapaccupaṭṭhānā ca sati, na vinā satiyā cittassa paggahaniggaho hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "63"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nimittakosallaṃ"
      },
      " nāma pathavīkasiṇādikassa cittekaggatānimittassa akatassa karaṇakosallaṃ, katassa ca bhāvanākosallaṃ, bhāvanāya laddhassa rakkhaṇakosallañca, taṃ idha adhippetaṃ."
    ],
    "innerText": "63.Nimittakosallaṃ nāma pathavīkasiṇādikassa cittekaggatānimittassa akatassa karaṇakosallaṃ, katassa ca bhāvanākosallaṃ, bhāvanāya laddhassa rakkhaṇakosallañca, taṃ idha adhippetaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "64"
      },
      ". Kathañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yasmiṃ samaye cittaṃ paggahetabbaṃ, tasmiṃ samaye cittaṃ paggaṇhāti"
      },
      "? Yadāssa atisithilavīriyatādīhi līnaṃ cittaṃ hoti, tadā passaddhisambojjhaṅgādayo tayo abhāvetvā dhammavicayasambojjhaṅgādayo bhāveti. Vuttañhetaṃ bhagavatā –"
    ],
    "innerText": "64. Kathañca yasmiṃ samaye cittaṃ paggahetabbaṃ, tasmiṃ samaye cittaṃ paggaṇhāti? Yadāssa atisithilavīriyatādīhi līnaṃ cittaṃ hoti, tadā passaddhisambojjhaṅgādayo tayo abhāvetvā dhammavicayasambojjhaṅgādayo bhāveti. Vuttañhetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Seyyathāpi, bhikkhave, puriso parittaṃ aggiṃ ujjāletukāmo assa, so tattha allāni ceva tiṇāni pakkhipeyya, allāni ca gomayāni pakkhipeyya, allāni ca kaṭṭhāni pakkhipeyya, udakavātañca dadeyya, paṃsukena ca okireyya, bhabbo nu kho so, bhikkhave, puriso parittaṃ aggiṃ ujjāletunti? No hetaṃ, bhante. Evameva kho, bhikkhave, yasmiṃ samaye līnaṃ cittaṃ hoti, akālo tasmiṃ samaye passaddhisambojjhaṅgassa bhāvanāya, akālo samādhi…pe… akālo upekkhāsambojjhaṅgassa bhāvanāya. Taṃ kissa hetu? Līnaṃ, bhikkhave, cittaṃ, taṃ etehi dhammehi dusamuṭṭhāpayaṃ hoti. Yasmiṃ ca kho, bhikkhave, līnaṃ cittaṃ hoti, kālo tasmiṃ samaye dhammavicayasambojjhaṅgassa bhāvanāya, kālo vīriyasambojjhaṅgassa bhāvanāya, kālo pītisambojjhaṅgassa bhāvanāya. Taṃ kissa hetu? Līnaṃ, bhikkhave, cittaṃ, taṃ etehi dhammehi susamuṭṭhāpayaṃ hoti. Seyyathāpi, bhikkhave, puriso parittaṃ aggiṃ ujjāletukāmo assa, so tattha sukkhāni ceva tiṇāni pakkhipeyya, sukkhāni ca gomayāni pakkhipeyya, sukkhāni ca kaṭṭhāni pakkhipeyya, mukhavātañca dadeyya, na ca paṃsukena okireyya, bhabbo nu kho so, bhikkhave, puriso parittaṃ aggiṃ ujjāletunti? Evaṃ bhante’’ti (saṃ. ni. 5.234)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha ca yathāsakamāhāravasena dhammavicayasambojjhaṅgādīnaṃ bhāvanā veditabbā. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Atthi, bhikkhave, kusalākusalā dhammā sāvajjānavajjā dhammā hīnappaṇītā dhammā kaṇhasukkasappaṭibhāgā dhammā. Tattha yoniso manasikārabahulīkāro, ayamāhāro anuppannassa vā dhammavicayasambojjhaṅgassa uppādāya uppannassa vā dhammavicayasambojjhaṅgassa ",
      " bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattatī’’ti (saṃ. ni. 5.232)."
    ],
    "innerText": "‘‘Atthi, bhikkhave, kusalākusalā dhammā sāvajjānavajjā dhammā hīnappaṇītā dhammā kaṇhasukkasappaṭibhāgā dhammā. Tattha yoniso manasikārabahulīkāro, ayamāhāro anuppannassa vā dhammavicayasambojjhaṅgassa uppādāya uppannassa vā dhammavicayasambojjhaṅgassa bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattatī’’ti (saṃ. ni. 5.232)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "Tathā ",
      " ‘‘atthi, bhikkhave, ārambhadhātu nikkamadhātu parakkamadhātu. Tattha yoniso manasikārabahulīkāro, ayamāhāro anuppannassa vā vīriyasambojjhaṅgassa uppādāya uppannassa vā vīriyasambojjhaṅgassa bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattatī’’ti (saṃ. ni. 5.232)."
    ],
    "innerText": "Tathā ‘‘atthi, bhikkhave, ārambhadhātu nikkamadhātu parakkamadhātu. Tattha yoniso manasikārabahulīkāro, ayamāhāro anuppannassa vā vīriyasambojjhaṅgassa uppādāya uppannassa vā vīriyasambojjhaṅgassa bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattatī’’ti (saṃ. ni. 5.232)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Tathā ‘‘atthi, bhikkhave, pītisambojjhaṅgaṭṭhāniyā dhammā. Tattha yoniso manasikārabahulīkāro, ayamāhāro anuppannassa vā pītisambojjhaṅgassa uppādāya uppannassa vā pītisambojjhaṅgassa bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattatī’’ti (saṃ. ni. 5.232)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha sabhāvasāmaññalakkhaṇapaṭivedhavasena pavattamanasikāro kusalādīsu yoniso manasikāro nāma. Ārambhadhātuādīnaṃ uppādanavasena pavattamanasikāro ārambhadhātuādīsu yoniso manasikāro nāma. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārambhadhātū"
      },
      "ti paṭhamavīriyaṃ vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nikkamadhātū"
      },
      "ti kosajjato nikkhantattā tato balavataraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parakkamadhātū"
      },
      "ti paraṃ paraṃ ṭhānaṃ akkamanato tatopi balavataraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pītisambojjhaṅgaṭṭhāniyā dhammā"
      },
      "ti pana pītiyā eva etaṃ nāmaṃ. Tassāpi uppādakamanasikārova yoniso manasikāro nāma."
    ],
    "innerText": "Tattha sabhāvasāmaññalakkhaṇapaṭivedhavasena pavattamanasikāro kusalādīsu yoniso manasikāro nāma. Ārambhadhātuādīnaṃ uppādanavasena pavattamanasikāro ārambhadhātuādīsu yoniso manasikāro nāma. Tattha ārambhadhātūti paṭhamavīriyaṃ vuccati. Nikkamadhātūti kosajjato nikkhantattā tato balavataraṃ. Parakkamadhātūti paraṃ paraṃ ṭhānaṃ akkamanato tatopi balavataraṃ. Pītisambojjhaṅgaṭṭhāniyā dhammāti pana pītiyā eva etaṃ nāmaṃ. Tassāpi uppādakamanasikārova yoniso manasikāro nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Apica satta dhammā dhammavicayasambojjhaṅgassa uppādāya saṃvattanti paripucchakatā, vatthuvisadakiriyā, indriyasamattapaṭipādanā, duppaññapuggalaparivajjanā, paññavantapuggalasevanā, gambhīrañāṇacariyapaccavekkhaṇā, tadadhimuttatāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekādasadhammā vīriyasambojjhaṅgassa uppādāya saṃvattanti apāyādibhayapaccavekkhaṇatā, vīriyāyattalokiyalokuttaravisesādhigamānisaṃsadassitā, ‘‘buddhapaccekabuddhamahāsāvakehi gatamaggo mayā gantabbo, so ca na sakkā kusītena gantu’’nti evaṃ gamanavīthipaccavekkhaṇatā, dāyakānaṃ mahapphalabhāvakaraṇena piṇḍāpacāyanatā, ‘‘vīriyārambhassa vaṇṇavādī me satthā, so ca anatikkamanīyasāsano amhākañca bahūpakāro paṭipattiyā ca pūjiyamāno pūjito hoti na itarathā’’ti evaṃ satthu ",
      " mahattapaccavekkhaṇatā, ‘‘saddhammasaṅkhātaṃ me mahādāyajjaṃ gahetabbaṃ, tañca na sakkā kusītena gahetu’’nti evaṃ dāyajjamahattapaccavekkhaṇatā, ālokasaññāmanasikārairiyāpathaparivattanaabbhokāsasevanādīhi ",
      " thinamiddhavinodanatā, kusītapuggalaparivajjanatā, āraddhavīriyapuggalasevanatā, sammappadhānapaccavekkhaṇatā, tadadhimuttatāti."
    ],
    "innerText": "Ekādasadhammā vīriyasambojjhaṅgassa uppādāya saṃvattanti apāyādibhayapaccavekkhaṇatā, vīriyāyattalokiyalokuttaravisesādhigamānisaṃsadassitā, ‘‘buddhapaccekabuddhamahāsāvakehi gatamaggo mayā gantabbo, so ca na sakkā kusītena gantu’’nti evaṃ gamanavīthipaccavekkhaṇatā, dāyakānaṃ mahapphalabhāvakaraṇena piṇḍāpacāyanatā, ‘‘vīriyārambhassa vaṇṇavādī me satthā, so ca anatikkamanīyasāsano amhākañca bahūpakāro paṭipattiyā ca pūjiyamāno pūjito hoti na itarathā’’ti evaṃ satthu mahattapaccavekkhaṇatā, ‘‘saddhammasaṅkhātaṃ me mahādāyajjaṃ gahetabbaṃ, tañca na sakkā kusītena gahetu’’nti evaṃ dāyajjamahattapaccavekkhaṇatā, ālokasaññāmanasikārairiyāpathaparivattanaabbhokāsasevanādīhi thinamiddhavinodanatā, kusītapuggalaparivajjanatā, āraddhavīriyapuggalasevanatā, sammappadhānapaccavekkhaṇatā, tadadhimuttatāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ekādasadhammā pītisambojjhaṅgassa uppādāya saṃvattanti buddhānussati, dhamma… saṅgha… sīla… cāga… devatānussati, upasamānussati, lūkhapuggalaparivajjanatā, siniddhapuggalasevanatā, pasādaniyasuttantapaccavekkhaṇatā, tadadhimuttatāti. Iti imehi ākārehi ete dhamme uppādento dhammavicayasambojjhaṅgādayo bhāveti nāma. Evaṃ yasmiṃ samaye cittaṃ paggahetabbaṃ, tasmiṃ samaye cittaṃ paggaṇhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "65"
      },
      ". Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yasmiṃ samaye cittaṃ niggahetabbaṃ, tasmiṃ samaye cittaṃ niggaṇhāti"
      },
      "? Yadāssa accāraddhavīriyatādīhi uddhataṃ cittaṃ hoti, tadā dhammavicayasambojjhaṅgādayo tayo abhāvetvā passaddhisambojjhaṅgādayo bhāveti. Vuttañhetaṃ bhagavatā –"
    ],
    "innerText": "65. Kathaṃ yasmiṃ samaye cittaṃ niggahetabbaṃ, tasmiṃ samaye cittaṃ niggaṇhāti? Yadāssa accāraddhavīriyatādīhi uddhataṃ cittaṃ hoti, tadā dhammavicayasambojjhaṅgādayo tayo abhāvetvā passaddhisambojjhaṅgādayo bhāveti. Vuttañhetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, puriso mahantaṃ aggikkhandhaṃ nibbāpetukāmo assa, so tattha sukkhāni ceva tiṇāni pakkhipeyya…pe… na ca paṃsukena okireyya, bhabbo nu kho so, bhikkhave, puriso mahantaṃ aggikkhandhaṃ nibbāpetunti? No hetaṃ, bhante. Evameva kho, bhikkhave, yasmiṃ samaye uddhataṃ cittaṃ hoti, akālo tasmiṃ samaye dhammavicayasambojjhaṅgassa bhāvanāya, akālo vīriya…pe… akālo pītisambojjhaṅgassa bhāvanāya. Taṃ kissa hetu? Uddhataṃ, bhikkhave, cittaṃ, taṃ etehi dhammehi duvūpasamayaṃ hoti. Yasmiṃ ca kho, bhikkhave, samaye uddhataṃ cittaṃ hoti, kālo tasmiṃ samaye passaddhisambojjhaṅgassa bhāvanāya, kālo samādhisambojjhaṅgassa bhāvanāya, kālo upekkhāsambojjhaṅgassa bhāvanāya. Taṃ kissa hetu? Uddhataṃ, bhikkhave, cittaṃ, taṃ etehi dhammehi suvūpasamayaṃ hoti. Seyyathāpi, bhikkhave, puriso mahantaṃ aggikkhandhaṃ nibbāpetukāmo assa, so tattha allāni ceva tiṇāni pakkhipeyya…pe… paṃsukena ",
      " ca okireyya, bhabbo nu kho so, bhikkhave, puriso mahantaṃ aggikkhandhaṃ nibbāpetunti? Evaṃ, bhante’’ti (saṃ. ni. 5.234)."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, puriso mahantaṃ aggikkhandhaṃ nibbāpetukāmo assa, so tattha sukkhāni ceva tiṇāni pakkhipeyya…pe… na ca paṃsukena okireyya, bhabbo nu kho so, bhikkhave, puriso mahantaṃ aggikkhandhaṃ nibbāpetunti? No hetaṃ, bhante. Evameva kho, bhikkhave, yasmiṃ samaye uddhataṃ cittaṃ hoti, akālo tasmiṃ samaye dhammavicayasambojjhaṅgassa bhāvanāya, akālo vīriya…pe… akālo pītisambojjhaṅgassa bhāvanāya. Taṃ kissa hetu? Uddhataṃ, bhikkhave, cittaṃ, taṃ etehi dhammehi duvūpasamayaṃ hoti. Yasmiṃ ca kho, bhikkhave, samaye uddhataṃ cittaṃ hoti, kālo tasmiṃ samaye passaddhisambojjhaṅgassa bhāvanāya, kālo samādhisambojjhaṅgassa bhāvanāya, kālo upekkhāsambojjhaṅgassa bhāvanāya. Taṃ kissa hetu? Uddhataṃ, bhikkhave, cittaṃ, taṃ etehi dhammehi suvūpasamayaṃ hoti. Seyyathāpi, bhikkhave, puriso mahantaṃ aggikkhandhaṃ nibbāpetukāmo assa, so tattha allāni ceva tiṇāni pakkhipeyya…pe… paṃsukena ca okireyya, bhabbo nu kho so, bhikkhave, puriso mahantaṃ aggikkhandhaṃ nibbāpetunti? Evaṃ, bhante’’ti (saṃ. ni. 5.234)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Etthāpi ",
      " yathāsakaṃ āhāravasena passaddhisambojjhaṅgādīnaṃ bhāvanā veditabbā. Vuttañhetaṃ bhagavatā –"
    ],
    "innerText": "Etthāpi yathāsakaṃ āhāravasena passaddhisambojjhaṅgādīnaṃ bhāvanā veditabbā. Vuttañhetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Atthi, bhikkhave, kāyapassaddhi cittapassaddhi. Tattha yoniso manasikārabahulīkāro, ayamāhāro anuppannassa vā passaddhisambojjhaṅgassa uppādāya uppannassa vā passaddhisambojjhaṅgassa bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattatī’’ti (saṃ. ni. 5.232)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Tathā ‘‘atthi, bhikkhave, samathanimittaṃ abyagganimittaṃ. Tattha yoniso manasikārabahulīkāro, ayamāhāro anuppannassa vā samādhisambojjhaṅgassa uppādāya uppannassa vā samādhisambojjhaṅgassa bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattatī’’ti (saṃ. ni. 5.232)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Tathā ‘‘atthi, bhikkhave, upekkhāsambojjhaṅgaṭṭhāniyā dhammā. Tattha yoniso manasikārabahulīkāro, ayamāhāro anuppannassa vā upekkhāsambojjhaṅgassa uppādāya uppannassa vā upekkhāsambojjhaṅgassa bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattatī’’ti (saṃ. ni. 5.232)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yathāssa passaddhiādayo uppannapubbā, taṃ ākāraṃ sallakkhetvā tesaṃ uppādanavasena pavattamanasikārova tīsupi padesu yoniso manasikāro nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samathanimitta"
      },
      "nti ca samathassevetamadhivacanaṃ. Avikkhepaṭṭhena ca tasseva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abyagganimitta"
      },
      "nti."
    ],
    "innerText": "Tattha yathāssa passaddhiādayo uppannapubbā, taṃ ākāraṃ sallakkhetvā tesaṃ uppādanavasena pavattamanasikārova tīsupi padesu yoniso manasikāro nāma. Samathanimittanti ca samathassevetamadhivacanaṃ. Avikkhepaṭṭhena ca tasseva abyagganimittanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Apica satta dhammā passaddhisambojjhaṅgassa uppādāya saṃvattanti paṇītabhojanasevanatā, utusukhasevanatā, iriyāpathasukhasevanatā, majjhattapayogatā, sāraddhakāyapuggalaparivajjanatā, passaddhakāyapuggalasevanatā, tadadhimuttatāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekādasa ",
      " dhammā samādhisambojjhaṅgassa uppādāya saṃvattanti vatthuvisadatā, nimittakusalatā, indriyasamattapaṭipādanatā, samaye cittassa niggahaṇatā, samaye cittassa paggahaṇatā ",
      ", nirassādassa cittassa saddhāsaṃvegavasena sampahaṃsanatā, sammāpavattassa ajjhupekkhanatā, asamāhitapuggalaparivajjanatā, samāhitapuggalasevanatā, jhānavimokkhapaccavekkhaṇatā, tadadhimuttatāti."
    ],
    "innerText": "Ekādasa dhammā samādhisambojjhaṅgassa uppādāya saṃvattanti vatthuvisadatā, nimittakusalatā, indriyasamattapaṭipādanatā, samaye cittassa niggahaṇatā, samaye cittassa paggahaṇatā , nirassādassa cittassa saddhāsaṃvegavasena sampahaṃsanatā, sammāpavattassa ajjhupekkhanatā, asamāhitapuggalaparivajjanatā, samāhitapuggalasevanatā, jhānavimokkhapaccavekkhaṇatā, tadadhimuttatāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pañca dhammā upekkhāsambojjhaṅgassa uppādāya saṃvattanti sattamajjhattatā, saṅkhāramajjhattatā, sattasaṅkhārakelāyanapuggalaparivajjanatā, sattasaṅkhāramajjhattapuggalasevanatā, tadadhimuttatāti. Iti imehākārehi ete dhamme uppādento passaddhisambojjhaṅgādayo bhāveti nāma. Evaṃ yasmiṃ samaye cittaṃ niggahetabbaṃ tasmiṃ samaye cittaṃ niggaṇhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "66"
      },
      ". Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yasmiṃ samaye cittaṃ sampahaṃsitabbaṃ, tasmiṃ samaye cittaṃ sampahaṃseti"
      },
      "? Yadāssa paññāpayogamandatāya vā upasamasukhānadhigamena vā nirassādaṃ cittaṃ hoti, tadā naṃ aṭṭhasaṃvegavatthupaccavekkhaṇena saṃvejeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭha saṃvegavatthūni"
      },
      " nāma jātijarābyādhimaraṇāni cattāri, apāyadukkhaṃ pañcamaṃ, atīte vaṭṭamūlakaṃ dukkhaṃ, anāgate vaṭṭamūlakaṃ dukkhaṃ, paccuppanne āhārapariyeṭṭhimūlakaṃ dukkhanti. Buddhadhammasaṅghaguṇānussaraṇena cassa pasādaṃ janeti. Evaṃ yasmiṃ samaye cittaṃ sampahaṃsitabbaṃ, tasmiṃ samaye cittaṃ sampahaṃseti."
    ],
    "innerText": "66. Kathaṃ yasmiṃ samaye cittaṃ sampahaṃsitabbaṃ, tasmiṃ samaye cittaṃ sampahaṃseti? Yadāssa paññāpayogamandatāya vā upasamasukhānadhigamena vā nirassādaṃ cittaṃ hoti, tadā naṃ aṭṭhasaṃvegavatthupaccavekkhaṇena saṃvejeti. Aṭṭha saṃvegavatthūni nāma jātijarābyādhimaraṇāni cattāri, apāyadukkhaṃ pañcamaṃ, atīte vaṭṭamūlakaṃ dukkhaṃ, anāgate vaṭṭamūlakaṃ dukkhaṃ, paccuppanne āhārapariyeṭṭhimūlakaṃ dukkhanti. Buddhadhammasaṅghaguṇānussaraṇena cassa pasādaṃ janeti. Evaṃ yasmiṃ samaye cittaṃ sampahaṃsitabbaṃ, tasmiṃ samaye cittaṃ sampahaṃseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ yasmiṃ samaye cittaṃ ajjhupekkhitabbaṃ, tasmiṃ samaye cittaṃ ajjhupekkhati? Yadāssa evaṃ paṭipajjato alīnaṃ anuddhataṃ anirassādaṃ ārammaṇe samappavattaṃ samathavīthipaṭipannaṃ cittaṃ hoti, tadāssa paggahaniggahasampahaṃsanesu na byāpāraṃ āpajjati, sārathi viya samappavattesu assesu. Evaṃ yasmiṃ samaye cittaṃ ajjhupekkhitabbaṃ, tasmiṃ samaye cittaṃ ajjhupekkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asamāhitapuggalaparivajjanatā"
      },
      " nāma nekkhammapaṭipadaṃ anāruḷhapubbānaṃ anekakiccapasutānaṃ vikkhittahadayānaṃ puggalānaṃ ārakā pariccāgo."
    ],
    "innerText": "Asamāhitapuggalaparivajjanatā nāma nekkhammapaṭipadaṃ anāruḷhapubbānaṃ anekakiccapasutānaṃ vikkhittahadayānaṃ puggalānaṃ ārakā pariccāgo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samāhitapuggalasevanatā"
      },
      " nāma nekkhammapaṭipadaṃ paṭipannānaṃ samādhilābhīnaṃ puggalānaṃ kālena kālaṃ upasaṅkamanaṃ."
    ],
    "innerText": "Samāhitapuggalasevanatā nāma nekkhammapaṭipadaṃ paṭipannānaṃ samādhilābhīnaṃ puggalānaṃ kālena kālaṃ upasaṅkamanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadadhimuttatā"
      },
      " nāma samādhiadhimuttatā samādhigarusamādhininnasamādhipoṇasamādhipabbhāratāti attho."
    ],
    "innerText": "Tadadhimuttatā nāma samādhiadhimuttatā samādhigarusamādhininnasamādhipoṇasamādhipabbhāratāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evametaṃ ",
      " dasavidhaṃ appanākosallaṃ sampādetabbaṃ."
    ],
    "innerText": "Evametaṃ dasavidhaṃ appanākosallaṃ sampādetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "67"
      },
      "."
    ],
    "innerText": "67."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Evañhi sampādayato, appanākosallaṃ imaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paṭiladdhe nimittasmiṃ, appanā sampavattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Evañhi paṭipannassa, sace sā nappavattati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tathāpi na jahe yogaṃ, vāyametheva paṇḍito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Hitvā hi sammāvāyāmaṃ, visesaṃ nāma māṇavo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Adhigacche parittampi, ṭhānametaṃ na vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Cittappavattiākāraṃ, tasmā sallakkhayaṃ budho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Samataṃ vīriyasseva, yojayetha punappunaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Īsakampi layaṃ yantaṃ, paggaṇhetheva mānasaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Accāraddhaṃ nisedhetvā, samameva pavattaye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Reṇumhi uppaladale, sutte nāvāya nāḷiyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yathā madhukarādīnaṃ, pavatti sammavaṇṇitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Līnauddhatabhāvehi, mocayitvāna sabbaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evaṃ nimittābhimukhaṃ, mānasaṃ paṭipādayeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nimittābhimukhapaṭipādanaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "68"
      },
      ". Tatrāyamatthadīpanā – yathā hi acheko madhukaro asukasmiṃ rukkhe pupphaṃ pupphitanti ñatvā tikkhena vegena pakkhando taṃ atikkamitvā paṭinivattento khīṇe reṇumhi sampāpuṇāti. Aparo acheko mandena javena pakkhando khīṇeyeva sampāpuṇāti. Cheko pana samena javena pakkhando sukhena puppharāsiṃ sampatvā yāvadicchakaṃ reṇuṃ ādāya madhuṃ sampādetvā madhurasamanubhavati."
    ],
    "innerText": "68. Tatrāyamatthadīpanā – yathā hi acheko madhukaro asukasmiṃ rukkhe pupphaṃ pupphitanti ñatvā tikkhena vegena pakkhando taṃ atikkamitvā paṭinivattento khīṇe reṇumhi sampāpuṇāti. Aparo acheko mandena javena pakkhando khīṇeyeva sampāpuṇāti. Cheko pana samena javena pakkhando sukhena puppharāsiṃ sampatvā yāvadicchakaṃ reṇuṃ ādāya madhuṃ sampādetvā madhurasamanubhavati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā ",
      " ca sallakattaantevāsikesu udakathālagate uppalapatte satthakammaṃ sikkhantesu eko acheko vegena satthaṃ pātento uppalapattaṃ dvidhā vā chindati, udake vā paveseti. Aparo acheko chijjanapavesanabhayā satthakena phusitumpi na visahati. Cheko pana samena payogena tattha satthapahāraṃ dassetvā pariyodātasippo hutvā tathārūpesu ṭhānesu kammaṃ katvā lābhaṃ labhati."
    ],
    "innerText": "Yathā ca sallakattaantevāsikesu udakathālagate uppalapatte satthakammaṃ sikkhantesu eko acheko vegena satthaṃ pātento uppalapattaṃ dvidhā vā chindati, udake vā paveseti. Aparo acheko chijjanapavesanabhayā satthakena phusitumpi na visahati. Cheko pana samena payogena tattha satthapahāraṃ dassetvā pariyodātasippo hutvā tathārūpesu ṭhānesu kammaṃ katvā lābhaṃ labhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathā ca yo catubyāmappamāṇaṃ makkaṭasuttamāharati, so cattāri sahassāni labhatīti raññā vutte eko achekapuriso vegena makkaṭasuttamākaḍḍhanto tahiṃ tahiṃ chindatiyeva. Aparo acheko chedanabhayā hatthena phusitumpi na visahati. Cheko pana koṭito paṭṭhāya samena payogena daṇḍake vedhetvā āharitvā lābhaṃ labhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathā ca acheko niyāmako balavavāte laṅkāraṃ pūrento nāvaṃ videsaṃ pakkhandāpeti. Aparo acheko mandavāte laṅkāraṃ oropento nāvaṃ tattheva ṭhapeti. Cheko pana mandavāte laṅkāraṃ pūretvā balavavāte aḍḍhalaṅkāraṃ katvā sotthinā icchitaṭṭhānaṃ pāpuṇāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathā ca yo telena achaḍḍento nāḷiṃ pūreti, so lābhaṃ labhatīti ācariyena antevāsikānaṃ vutte eko acheko lābhaluddho vegena pūrento telaṃ chaḍḍeti. Aparo acheko telachaḍḍanabhayā āsiñcitumpi na visahati. Cheko pana samena payogena pūretvā lābhaṃ labhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evameva eko bhikkhu uppanne nimitte sīghameva appanaṃ pāpuṇissāmīti gāḷhaṃ vīriyaṃ karoti, tassa cittaṃ accāraddhavīriyattā uddhacce patati, so na sakkoti appanaṃ pāpuṇituṃ. Eko accāraddhavīriyatāya dosaṃ disvā kiṃ dānime appanāyāti vīriyaṃ hāpeti, tassa cittaṃ atilīnavīriyattā kosajje patati, sopi na sakkoti appanaṃ pāpuṇituṃ. Yo pana īsakampi līnaṃ līnabhāvato uddhataṃ uddhaccato mocetvā samena payogena ",
      " nimittābhimukhaṃ pavatteti, so appanaṃ pāpuṇāti, tādisena bhavitabbaṃ. Imamatthaṃ sandhāya etaṃ vuttaṃ –"
    ],
    "innerText": "Evameva eko bhikkhu uppanne nimitte sīghameva appanaṃ pāpuṇissāmīti gāḷhaṃ vīriyaṃ karoti, tassa cittaṃ accāraddhavīriyattā uddhacce patati, so na sakkoti appanaṃ pāpuṇituṃ. Eko accāraddhavīriyatāya dosaṃ disvā kiṃ dānime appanāyāti vīriyaṃ hāpeti, tassa cittaṃ atilīnavīriyattā kosajje patati, sopi na sakkoti appanaṃ pāpuṇituṃ. Yo pana īsakampi līnaṃ līnabhāvato uddhataṃ uddhaccato mocetvā samena payogena nimittābhimukhaṃ pavatteti, so appanaṃ pāpuṇāti, tādisena bhavitabbaṃ. Imamatthaṃ sandhāya etaṃ vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Reṇumhi uppaladale, sutte nāvāya nāḷiyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yathā madhukarādīnaṃ, pavatti sammavaṇṇitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Līnauddhatabhāvehi ",
      ", mocayitvāna sabbaso;"
    ],
    "innerText": "Līnauddhatabhāvehi , mocayitvāna sabbaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evaṃ nimittābhimukhaṃ, mānasaṃ paṭipādayeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Paṭhamajjhānakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "69"
      },
      ". Iti evaṃ nimittābhimukhaṃ mānasaṃ paṭipādayato panassa idāni appanā ijjhissatīti bhavaṅgaṃ upacchinditvā pathavī pathavīti anuyogavasena upaṭṭhitaṃ tadeva pathavīkasiṇaṃ ārammaṇaṃ katvā manodvārāvajjanamuppajjati. Tato tasmiṃyevārammaṇe cattāri pañca vā javanāni javanti. Tesu avasāne ekaṃ rūpāvacaraṃ, sesāni kāmāvacarāni. Pakaticittehi balavataravitakkavicārapītisukhacittekaggatāni yāni appanāya parikammattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parikammānī"
      },
      "tipi, yathā gāmādīnaṃ āsannapadeso gāmūpacāro nagarūpacāroti vuccati, evaṃ appanāya āsannattā samīpacārattā vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upacārānī"
      },
      "tipi, ito pubbe parikammānaṃ, upari appanāya ca anulomato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anulomānī"
      },
      "tipi vuccanti. Yañcettha sabbantimaṃ, taṃ parittagottābhibhavanato, mahaggatagottabhāvanato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gotrabhū"
      },
      "tipi vuccati. Agahitaggahaṇena panettha paṭhamaṃ parikammaṃ, dutiyaṃ upacāraṃ, tatiyaṃ anulomaṃ, catutthaṃ gotrabhu. Paṭhamaṃ vā upacāraṃ, dutiyaṃ anulomaṃ, tatiyaṃ gotrabhu, catutthaṃ pañcamaṃ vā appanācittaṃ. Catutthameva hi pañcamaṃ vā appeti, tañca kho khippābhiññadandhābhiññavasena. Tato paraṃ javanaṃ patati. Bhavaṅgassa vāro hoti."
    ],
    "innerText": "69. Iti evaṃ nimittābhimukhaṃ mānasaṃ paṭipādayato panassa idāni appanā ijjhissatīti bhavaṅgaṃ upacchinditvā pathavī pathavīti anuyogavasena upaṭṭhitaṃ tadeva pathavīkasiṇaṃ ārammaṇaṃ katvā manodvārāvajjanamuppajjati. Tato tasmiṃyevārammaṇe cattāri pañca vā javanāni javanti. Tesu avasāne ekaṃ rūpāvacaraṃ, sesāni kāmāvacarāni. Pakaticittehi balavataravitakkavicārapītisukhacittekaggatāni yāni appanāya parikammattā parikammānītipi, yathā gāmādīnaṃ āsannapadeso gāmūpacāro nagarūpacāroti vuccati, evaṃ appanāya āsannattā samīpacārattā vā upacārānītipi, ito pubbe parikammānaṃ, upari appanāya ca anulomato anulomānītipi vuccanti. Yañcettha sabbantimaṃ, taṃ parittagottābhibhavanato, mahaggatagottabhāvanato ca gotrabhūtipi vuccati. Agahitaggahaṇena panettha paṭhamaṃ parikammaṃ, dutiyaṃ upacāraṃ, tatiyaṃ anulomaṃ, catutthaṃ gotrabhu. Paṭhamaṃ vā upacāraṃ, dutiyaṃ anulomaṃ, tatiyaṃ gotrabhu, catutthaṃ pañcamaṃ vā appanācittaṃ. Catutthameva hi pañcamaṃ vā appeti, tañca kho khippābhiññadandhābhiññavasena. Tato paraṃ javanaṃ patati. Bhavaṅgassa vāro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ābhidhammikagodattatthero pana ‘‘purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ āsevanapaccayena paccayo’’ti (paṭṭhā. 1.1.12) imaṃ suttaṃ vatvā āsevanapaccayena pacchimo pacchimo dhammo balavā hoti, tasmā chaṭṭhepi sattamepi appanā hotīti āha, taṃ aṭṭhakathāsu ‘‘attano matimattaṃ therasseta’’nti vatvā paṭikkhittaṃ. Catutthapañcamesuyeva pana appanā hoti. Parato javanaṃ patitaṃ nāma hoti, bhavaṅgassa āsannattāti vuttaṃ ",
      ". Tameva vicāretvā vuttattā na sakkā paṭikkhipituṃ. Yathā hi puriso chinnapapātābhimukho dhāvanto ṭhātukāmopi pariyante pādaṃ katvā ṭhātuṃ na sakkoti papāte eva patati, evaṃ chaṭṭhe vā sattame vā appetuṃ na sakkoti, bhavaṅgassa āsannattā. Tasmā catutthapañcamesuyeva appanā hotīti veditabbā."
    ],
    "innerText": "Ābhidhammikagodattatthero pana ‘‘purimā purimā kusalā dhammā pacchimānaṃ pacchimānaṃ kusalānaṃ dhammānaṃ āsevanapaccayena paccayo’’ti (paṭṭhā. 1.1.12) imaṃ suttaṃ vatvā āsevanapaccayena pacchimo pacchimo dhammo balavā hoti, tasmā chaṭṭhepi sattamepi appanā hotīti āha, taṃ aṭṭhakathāsu ‘‘attano matimattaṃ therasseta’’nti vatvā paṭikkhittaṃ. Catutthapañcamesuyeva pana appanā hoti. Parato javanaṃ patitaṃ nāma hoti, bhavaṅgassa āsannattāti vuttaṃ . Tameva vicāretvā vuttattā na sakkā paṭikkhipituṃ. Yathā hi puriso chinnapapātābhimukho dhāvanto ṭhātukāmopi pariyante pādaṃ katvā ṭhātuṃ na sakkoti papāte eva patati, evaṃ chaṭṭhe vā sattame vā appetuṃ na sakkoti, bhavaṅgassa āsannattā. Tasmā catutthapañcamesuyeva appanā hotīti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sā ",
      " ca pana ekacittakkhaṇikāyeva. Sattasu hi ṭhānesu addhānaparicchedo nāma natthi paṭhamappanāyaṃ, lokiyābhiññāsu, catūsu maggesu, maggānantaraphale, rūpārūpabhavesu bhavaṅgajjhāne, nirodhassa paccaye nevasaññānāsaññāyatane, nirodhā vuṭṭhahantassa phalasamāpattiyanti. Ettha maggānantaraphalaṃ tiṇṇaṃ upari na hoti. Nirodhassa paccayo nevasaññānāsaññāyatanaṃ dvinnamupari na hoti. Rūpārūpesu bhavaṅgassa parimāṇaṃ natthi, sesaṭṭhānesu ekameva cittanti. Iti ekacittakkhaṇikāyeva appanā. Tato bhavaṅgapāto. Atha bhavaṅgaṃ vocchinditvā jhānapaccavekkhaṇatthāya āvajjanaṃ, tato jhānapaccavekkhaṇanti."
    ],
    "innerText": "Sā ca pana ekacittakkhaṇikāyeva. Sattasu hi ṭhānesu addhānaparicchedo nāma natthi paṭhamappanāyaṃ, lokiyābhiññāsu, catūsu maggesu, maggānantaraphale, rūpārūpabhavesu bhavaṅgajjhāne, nirodhassa paccaye nevasaññānāsaññāyatane, nirodhā vuṭṭhahantassa phalasamāpattiyanti. Ettha maggānantaraphalaṃ tiṇṇaṃ upari na hoti. Nirodhassa paccayo nevasaññānāsaññāyatanaṃ dvinnamupari na hoti. Rūpārūpesu bhavaṅgassa parimāṇaṃ natthi, sesaṭṭhānesu ekameva cittanti. Iti ekacittakkhaṇikāyeva appanā. Tato bhavaṅgapāto. Atha bhavaṅgaṃ vocchinditvā jhānapaccavekkhaṇatthāya āvajjanaṃ, tato jhānapaccavekkhaṇanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettāvatā ca panesa vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati (dha. sa. 160; dī. ni. 1.226). Evamanena pañcaṅgavippahīnaṃ pañcaṅgasamannāgataṃ tividhakalyāṇaṃ dasalakkhaṇasampannaṃ paṭhamaṃ jhānaṃ adhigataṃ hoti pathavīkasiṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "70"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vivicceva kāmehī"
      },
      "ti kāmehi viviccitvā vinā hutvā apakkamitvā. Yo panāyamettha evakāro, so niyamatthoti veditabbo. Yasmā ca niyamattho, tasmā tasmiṃ paṭhamajjhānaṃ upasampajja viharaṇasamaye avijjamānānampi kāmānaṃ tassa paṭhamajjhānassa paṭipakkhabhāvaṃ kāmapariccāgeneva cassa adhigamaṃ dīpeti."
    ],
    "innerText": "70. Tattha vivicceva kāmehīti kāmehi viviccitvā vinā hutvā apakkamitvā. Yo panāyamettha evakāro, so niyamatthoti veditabbo. Yasmā ca niyamattho, tasmā tasmiṃ paṭhamajjhānaṃ upasampajja viharaṇasamaye avijjamānānampi kāmānaṃ tassa paṭhamajjhānassa paṭipakkhabhāvaṃ kāmapariccāgeneva cassa adhigamaṃ dīpeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ? ‘‘Vivicceva kāmehī’’ti evañhi niyame kariyamāne idaṃ paññāyati, nūna jhānassa kāmā paṭipakkhabhūtā yesu sati idaṃ nappavattati, andhakāre sati padīpobhāso viya. Tesaṃ pariccāgeneva cassa ",
      " adhigamo hoti, orimatīrapariccāgena pārimatīrasseva. Tasmā niyamaṃ karotīti."
    ],
    "innerText": "Kathaṃ? ‘‘Vivicceva kāmehī’’ti evañhi niyame kariyamāne idaṃ paññāyati, nūna jhānassa kāmā paṭipakkhabhūtā yesu sati idaṃ nappavattati, andhakāre sati padīpobhāso viya. Tesaṃ pariccāgeneva cassa adhigamo hoti, orimatīrapariccāgena pārimatīrasseva. Tasmā niyamaṃ karotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha siyā, kasmā panesa pubbapadeyeva vutto, na uttarapade, kiṃ akusalehi dhammehi aviviccāpi jhānaṃ upasampajja vihareyyāti? Na kho panetaṃ evaṃ daṭṭhabbaṃ. Taṃnissaraṇato hi pubbapade esa vutto. Kāmadhātusamatikkamanato hi kāmarāgapaṭipakkhato ca idaṃ jhānaṃ kāmānameva nissaraṇaṃ. Yathāha, ‘‘kāmānametaṃ nissaraṇaṃ yadidaṃ nekkhamma’’nti (dī. ni. 3.353). Uttarapadepi pana yathā ‘‘idheva, bhikkhave, samaṇo, idha dutiyo samaṇo’’ti (ma. ni. 1.139; a. ni. 4.241) ettha ",
      " evakāro ānetvā vuccati, evaṃ vattabbo. Na hi sakkā ito aññehipi nīvaraṇasaṅkhātehi akusaladhammehi avivicca jhānaṃ upasampajja viharituṃ. Tasmā ‘‘vivicceva kāmehi vivicceva akusalehi dhammehī’’ti evaṃ padadvayepi esa daṭṭhabbo. Padadvayepi ca kiñcāpi viviccāti iminā sādhāraṇavacanena tadaṅgavivekādayo, kāyavivekādayo ca sabbepi vivekā saṅgahaṃ gacchanti, tathāpi kāyaviveko cittaviveko vikkhambhanavivekoti tayo eva idha daṭṭhabbā."
    ],
    "innerText": "Tattha siyā, kasmā panesa pubbapadeyeva vutto, na uttarapade, kiṃ akusalehi dhammehi aviviccāpi jhānaṃ upasampajja vihareyyāti? Na kho panetaṃ evaṃ daṭṭhabbaṃ. Taṃnissaraṇato hi pubbapade esa vutto. Kāmadhātusamatikkamanato hi kāmarāgapaṭipakkhato ca idaṃ jhānaṃ kāmānameva nissaraṇaṃ. Yathāha, ‘‘kāmānametaṃ nissaraṇaṃ yadidaṃ nekkhamma’’nti (dī. ni. 3.353). Uttarapadepi pana yathā ‘‘idheva, bhikkhave, samaṇo, idha dutiyo samaṇo’’ti (ma. ni. 1.139; a. ni. 4.241) ettha evakāro ānetvā vuccati, evaṃ vattabbo. Na hi sakkā ito aññehipi nīvaraṇasaṅkhātehi akusaladhammehi avivicca jhānaṃ upasampajja viharituṃ. Tasmā ‘‘vivicceva kāmehi vivicceva akusalehi dhammehī’’ti evaṃ padadvayepi esa daṭṭhabbo. Padadvayepi ca kiñcāpi viviccāti iminā sādhāraṇavacanena tadaṅgavivekādayo, kāyavivekādayo ca sabbepi vivekā saṅgahaṃ gacchanti, tathāpi kāyaviveko cittaviveko vikkhambhanavivekoti tayo eva idha daṭṭhabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kāmehīti iminā pana padena ye ca niddese ‘‘katame vatthukāmā, manāpiyā rūpā’’tiādinā (mahāni. 1) nayena vatthukāmā vuttā, ye ca tattheva vibhaṅge ca ‘‘chando kāmo, rāgo kāmo, chandarāgo kāmo, saṅkappo kāmo, rāgo kāmo, saṅkapparāgo kāmo, ime vuccanti kāmā’’ti (mahāni. 1; vibha. 564) evaṃ kilesakāmā vuttā, te sabbepi saṅgahitāicceva daṭṭhabbā. Evañhi sati vivicceva kāmehīti vatthukāmehipi viviccevāti attho yujjati, tena kāyaviveko vutto hoti. Vivicca akusalehi dhammehīti kilesakāmehi sabbākusalehi vā viviccāti attho yujjati, tena cittaviveko vutto hoti. Purimena cettha vatthukāmehi vivekavacanato eva kāmasukhapariccāgo, dutiyena kilesakāmehi vivekavacanato nekkhammasukhapariggaho vibhāvito hoti. Evaṃ vatthukāmakilesakāmavivekavacanatoyeva ca etesaṃ paṭhamena saṃkilesavatthuppahānaṃ, dutiyena saṃkilesappahānaṃ. Paṭhamena lolabhāvassa hetupariccāgo, dutiyena bālabhāvassa. Paṭhamena ca payogasuddhi ",
      ", dutiyena āsayaposanaṃ vibhāvitaṃ hotīti viññātabbaṃ. Esa tāva nayo kāmehīti ettha vuttakāmesu vatthukāmapakkhe."
    ],
    "innerText": "Kāmehīti iminā pana padena ye ca niddese ‘‘katame vatthukāmā, manāpiyā rūpā’’tiādinā (mahāni. 1) nayena vatthukāmā vuttā, ye ca tattheva vibhaṅge ca ‘‘chando kāmo, rāgo kāmo, chandarāgo kāmo, saṅkappo kāmo, rāgo kāmo, saṅkapparāgo kāmo, ime vuccanti kāmā’’ti (mahāni. 1; vibha. 564) evaṃ kilesakāmā vuttā, te sabbepi saṅgahitāicceva daṭṭhabbā. Evañhi sati vivicceva kāmehīti vatthukāmehipi viviccevāti attho yujjati, tena kāyaviveko vutto hoti. Vivicca akusalehi dhammehīti kilesakāmehi sabbākusalehi vā viviccāti attho yujjati, tena cittaviveko vutto hoti. Purimena cettha vatthukāmehi vivekavacanato eva kāmasukhapariccāgo, dutiyena kilesakāmehi vivekavacanato nekkhammasukhapariggaho vibhāvito hoti. Evaṃ vatthukāmakilesakāmavivekavacanatoyeva ca etesaṃ paṭhamena saṃkilesavatthuppahānaṃ, dutiyena saṃkilesappahānaṃ. Paṭhamena lolabhāvassa hetupariccāgo, dutiyena bālabhāvassa. Paṭhamena ca payogasuddhi , dutiyena āsayaposanaṃ vibhāvitaṃ hotīti viññātabbaṃ. Esa tāva nayo kāmehīti ettha vuttakāmesu vatthukāmapakkhe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kilesakāmapakkhe pana chandoti ca rāgoti ca evamādīhi anekabhedo kāmacchandoyeva kāmoti adhippeto. So ca akusalapariyāpannopi samāno ‘‘tattha katamo kāmo chando kāmo’’tiādinā (vibha. 564) nayena vibhaṅge jhānapaṭipakkhato visuṃ vutto. Kilesakāmattā vā purimapade vutto, akusalapariyāpannattā dutiyapade. Anekabhedato cassa kāmatoti avatvā kāmehīti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aññesampi ca dhammānaṃ akusalabhāve vijjamāne ‘‘tattha katame akusalā dhammā, kāmacchando’’tiādinā ",
      " nayena vibhaṅge upari jhānaṅgānaṃ paccanīkapaṭipakkhabhāvadassanato nīvaraṇāneva vuttāni. Nīvaraṇāni hi jhānaṅgapaccanīkāni, tesaṃ jhānaṅgāneva paṭipakkhāni viddhaṃsakāni vighātakānīti vuttaṃ hoti. Tathā hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samādhi kāmacchandassa paṭipakkho, pīti byāpādassa, vitakko thinamiddhassa, sukhaṃ uddhaccakukkuccassa, vicāro vicikicchāyā"
      },
      "ti peṭake vuttaṃ."
    ],
    "innerText": "Aññesampi ca dhammānaṃ akusalabhāve vijjamāne ‘‘tattha katame akusalā dhammā, kāmacchando’’tiādinā nayena vibhaṅge upari jhānaṅgānaṃ paccanīkapaṭipakkhabhāvadassanato nīvaraṇāneva vuttāni. Nīvaraṇāni hi jhānaṅgapaccanīkāni, tesaṃ jhānaṅgāneva paṭipakkhāni viddhaṃsakāni vighātakānīti vuttaṃ hoti. Tathā hi samādhi kāmacchandassa paṭipakkho, pīti byāpādassa, vitakko thinamiddhassa, sukhaṃ uddhaccakukkuccassa, vicāro vicikicchāyāti peṭake vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evamettha vivicceva kāmehīti iminā kāmacchandassa vikkhambhanaviveko vutto hoti. Vivicca akusalehi dhammehīti iminā pañcannampi nīvaraṇānaṃ, agahitaggahaṇena pana paṭhamena kāmacchandassa, dutiyena sesanīvaraṇānaṃ. Tathā paṭhamena tīsu akusalamūlesu pañcakāmaguṇabhedavisayassa lobhassa, dutiyena āghātavatthubhedādivisayānaṃ dosamohānaṃ. Oghādīsu vā dhammesu paṭhamena kāmoghakāmayogakāmāsavakāmupādānaabhijjhākāyaganthakāmarāgasaṃyojanānaṃ, dutiyena avasesaoghayogāsavaupādānaganthasaṃyojanānaṃ. Paṭhamena ca taṇhāya taṃsampayuttakānañca, dutiyena avijjāya taṃsampayuttakānañca. Apica paṭhamena lobhasampayuttānaṃ aṭṭhannaṃ cittuppādānaṃ, dutiyena sesānaṃ catunnaṃ akusalacittuppādānaṃ vikkhambhanaviveko vutto hotīti veditabbo. Ayaṃ tāva vivicceva kāmehi vivicca akusalehi dhammehīti ettha atthappakāsanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "71"
      },
      ". Ettāvatā ",
      " ca paṭhamassa jhānassa pahānaṅgaṃ dassetvā idāni sampayogaṅgaṃ dassetuṃ savitakkaṃ savicārantiādi vuttaṃ. Tattha vitakkanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vitakko,"
      },
      " ūhananti vuttaṃ hoti. Svāyaṃ ārammaṇe cittassa abhiniropanalakkhaṇo, āhananapariyāhananaraso. Tathā hi tena yogāvacaro ārammaṇaṃ vitakkāhataṃ vitakkapariyāhataṃ karotīti vuccati. Ārammaṇe cittassa ānayanapaccupaṭṭhāno."
    ],
    "innerText": "71. Ettāvatā ca paṭhamassa jhānassa pahānaṅgaṃ dassetvā idāni sampayogaṅgaṃ dassetuṃ savitakkaṃ savicārantiādi vuttaṃ. Tattha vitakkanaṃ vitakko, ūhananti vuttaṃ hoti. Svāyaṃ ārammaṇe cittassa abhiniropanalakkhaṇo, āhananapariyāhananaraso. Tathā hi tena yogāvacaro ārammaṇaṃ vitakkāhataṃ vitakkapariyāhataṃ karotīti vuccati. Ārammaṇe cittassa ānayanapaccupaṭṭhāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vicaraṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vicāro,"
      },
      " anusañcaraṇanti vuttaṃ hoti. Svāyaṃ ārammaṇānumajjanalakkhaṇo, tattha sahajātānuyojanaraso, cittassa anuppabandhanapaccupaṭṭhāno."
    ],
    "innerText": "Vicaraṇaṃ vicāro, anusañcaraṇanti vuttaṃ hoti. Svāyaṃ ārammaṇānumajjanalakkhaṇo, tattha sahajātānuyojanaraso, cittassa anuppabandhanapaccupaṭṭhāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Santepi ca nesaṃ katthaci avippayoge oḷārikaṭṭhena pubbaṅgamaṭṭhena ca ghaṇḍābhighāto viya cetaso paṭhamābhinipāto vitakko. Sukhumaṭṭhena anumajjanasabhāvena ca ghaṇḍānuravo viya ",
      " anuppabandho vicāro. Vipphāravā cettha vitakko paṭhamuppattikāle paripphandanabhūto cittassa ākāse uppatitukāmassa pakkhino pakkhavikkhepo viya padumābhimukhapāto viya ca gandhānubandhacetaso bhamarassa. Santavutti vicāro nātiparipphandanabhāvo cittassa ākāse uppatitassa pakkhino pakkhappasāraṇaṃ viya, paribbhamanaṃ viya ca padumābhimukhapatitassa bhamarassa padumassa uparibhāge. Dukanipātaṭṭhakathāyaṃ pana ‘‘ākāse gacchato mahāsakuṇassa ubhohi pakkhehi vātaṃ gahetvā pakkhe sannisīdāpetvā gamanaṃ viya ārammaṇe cetaso abhiniropanabhāvena pavatto vitakko. Vātaggahaṇatthaṃ pakkhe phandāpayamānassa gamanaṃ viya anumajjanabhāvena pavatto vicāro’’ti vuttaṃ, taṃ anuppabandhena pavattiyaṃ yujjati. So pana nesaṃ viseso paṭhamadutiyajjhānesu pākaṭo hoti."
    ],
    "innerText": "Santepi ca nesaṃ katthaci avippayoge oḷārikaṭṭhena pubbaṅgamaṭṭhena ca ghaṇḍābhighāto viya cetaso paṭhamābhinipāto vitakko. Sukhumaṭṭhena anumajjanasabhāvena ca ghaṇḍānuravo viya anuppabandho vicāro. Vipphāravā cettha vitakko paṭhamuppattikāle paripphandanabhūto cittassa ākāse uppatitukāmassa pakkhino pakkhavikkhepo viya padumābhimukhapāto viya ca gandhānubandhacetaso bhamarassa. Santavutti vicāro nātiparipphandanabhāvo cittassa ākāse uppatitassa pakkhino pakkhappasāraṇaṃ viya, paribbhamanaṃ viya ca padumābhimukhapatitassa bhamarassa padumassa uparibhāge. Dukanipātaṭṭhakathāyaṃ pana ‘‘ākāse gacchato mahāsakuṇassa ubhohi pakkhehi vātaṃ gahetvā pakkhe sannisīdāpetvā gamanaṃ viya ārammaṇe cetaso abhiniropanabhāvena pavatto vitakko. Vātaggahaṇatthaṃ pakkhe phandāpayamānassa gamanaṃ viya anumajjanabhāvena pavatto vicāro’’ti vuttaṃ, taṃ anuppabandhena pavattiyaṃ yujjati. So pana nesaṃ viseso paṭhamadutiyajjhānesu pākaṭo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica malaggahitaṃ kaṃsabhājanaṃ ekena hatthena daḷhaṃ gahetvā itarena hatthena cuṇṇatelavālaṇḍupakena parimajjantassa daḷhagahaṇahattho viya vitakko, parimajjanahattho viya vicāro. Tathā kumbhakārassa daṇḍappahārena cakkaṃ bhamayitvā bhājanaṃ karontassa uppīḷanahattho viya vitakko, ito cito ca sañcaraṇahattho viya vicāro. Tathā maṇḍalaṃ karontassa majjhe ",
      " sannirumbhitvā ṭhitakaṇṭako viya abhiniropano vitakko, bahi paribbhamanakaṇṭako viya anumajjano vicāro. Iti iminā ca vitakkena iminā ca vicārena saha vattati rukkho viya pupphena phalena cāti idaṃ jhānaṃ ‘‘savitakkaṃ savicāra’’nti vuccati. Vibhaṅge pana ‘‘iminā ca vitakkena iminā ca vicārena upeto hoti samupeto’’tiādinā (vibha. 565) nayena puggalādhiṭṭhānā desanā katā. Attho pana tatrāpi evameva daṭṭhabbo."
    ],
    "innerText": "Apica malaggahitaṃ kaṃsabhājanaṃ ekena hatthena daḷhaṃ gahetvā itarena hatthena cuṇṇatelavālaṇḍupakena parimajjantassa daḷhagahaṇahattho viya vitakko, parimajjanahattho viya vicāro. Tathā kumbhakārassa daṇḍappahārena cakkaṃ bhamayitvā bhājanaṃ karontassa uppīḷanahattho viya vitakko, ito cito ca sañcaraṇahattho viya vicāro. Tathā maṇḍalaṃ karontassa majjhe sannirumbhitvā ṭhitakaṇṭako viya abhiniropano vitakko, bahi paribbhamanakaṇṭako viya anumajjano vicāro. Iti iminā ca vitakkena iminā ca vicārena saha vattati rukkho viya pupphena phalena cāti idaṃ jhānaṃ ‘‘savitakkaṃ savicāra’’nti vuccati. Vibhaṅge pana ‘‘iminā ca vitakkena iminā ca vicārena upeto hoti samupeto’’tiādinā (vibha. 565) nayena puggalādhiṭṭhānā desanā katā. Attho pana tatrāpi evameva daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivekaja"
      },
      "nti ettha vivitti viveko, nīvaraṇavigamoti attho. Vivittoti vā viveko, nīvaraṇavivitto jhānasampayuttadhammarāsīti attho. Tasmā vivekā, tasmiṃ vā viveke jātanti vivekajaṃ."
    ],
    "innerText": "Vivekajanti ettha vivitti viveko, nīvaraṇavigamoti attho. Vivittoti vā viveko, nīvaraṇavivitto jhānasampayuttadhammarāsīti attho. Tasmā vivekā, tasmiṃ vā viveke jātanti vivekajaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "72"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pītisukha"
      },
      "nti ettha pīṇayatīti pīti. Sā sampiyāyanalakkhaṇā, kāyacittapīnanarasā, pharaṇarasā vā, odagyapaccupaṭṭhānā. Sā panesā khuddikā pīti, khaṇikāpīti, okkantikāpīti, ubbegāpīti, pharaṇāpītīti pañcavidhā hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khuddikāpīti"
      },
      " sarīre lomahaṃsamattameva kātuṃ sakkoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khaṇikāpīti"
      },
      " khaṇe khaṇe vijjuppādasadisā ",
      " hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Okkantikāpīti"
      },
      " samuddatīraṃ vīci viya kāyaṃ okkamitvā okkamitvā bhijjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubbegāpīti"
      },
      " balavatī hoti kāyaṃ uddhaggaṃ katvā ākāse laṅghāpanappamāṇappattā. Tathā hi puṇṇavallikavāsī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahātissatthero"
      },
      " puṇṇamadivase sāyaṃ cetiyaṅgaṇaṃ gantvā candālokaṃ disvā mahācetiyābhimukho hutvā ‘‘imāya vata velāya catasso parisā mahācetiyaṃ vandantī’’ti pakatiyā diṭṭhārammaṇavasena buddhārammaṇaṃ ubbegāpītiṃ uppādetvā sudhātale pahaṭacitrageṇḍuko viya ākāse uppatitvā mahācetiyaṅgaṇeyeva patiṭṭhāsi. Tathā girikaṇḍakavihārassa upanissaye vattakālakagāme ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekā kuladhītā"
      },
      "pi balavabuddhārammaṇāya ubbegāpītiyā ākāse laṅghesi."
    ],
    "innerText": "72.Pītisukhanti ettha pīṇayatīti pīti. Sā sampiyāyanalakkhaṇā, kāyacittapīnanarasā, pharaṇarasā vā, odagyapaccupaṭṭhānā. Sā panesā khuddikā pīti, khaṇikāpīti, okkantikāpīti, ubbegāpīti, pharaṇāpītīti pañcavidhā hoti. Tattha khuddikāpīti sarīre lomahaṃsamattameva kātuṃ sakkoti. Khaṇikāpīti khaṇe khaṇe vijjuppādasadisā hoti. Okkantikāpīti samuddatīraṃ vīci viya kāyaṃ okkamitvā okkamitvā bhijjati. Ubbegāpīti balavatī hoti kāyaṃ uddhaggaṃ katvā ākāse laṅghāpanappamāṇappattā. Tathā hi puṇṇavallikavāsī mahātissatthero puṇṇamadivase sāyaṃ cetiyaṅgaṇaṃ gantvā candālokaṃ disvā mahācetiyābhimukho hutvā ‘‘imāya vata velāya catasso parisā mahācetiyaṃ vandantī’’ti pakatiyā diṭṭhārammaṇavasena buddhārammaṇaṃ ubbegāpītiṃ uppādetvā sudhātale pahaṭacitrageṇḍuko viya ākāse uppatitvā mahācetiyaṅgaṇeyeva patiṭṭhāsi. Tathā girikaṇḍakavihārassa upanissaye vattakālakagāme ekā kuladhītāpi balavabuddhārammaṇāya ubbegāpītiyā ākāse laṅghesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassā kira mātāpitaro sāyaṃ dhammassavanatthāya vihāraṃ gacchantā ‘‘amma tvaṃ garubhārā akāle vicarituṃ na sakkosi, mayaṃ tuyhaṃ pattiṃ katvā dhammaṃ sossāmā’’ti agamaṃsu. Sā gantukāmāpi tesaṃ vacanaṃ paṭibāhituṃ ",
      " asakkontī ghare ohīyitvā gharājire ṭhatvā candālokena girikaṇḍake ākāsacetiyaṅgaṇaṃ olokentī cetiyassa dīpapūjaṃ addasa, catasso ca parisā mālāgandhādīhi cetiyapūjaṃ katvā padakkhiṇaṃ karontiyo bhikkhusaṅghassa ca gaṇasajjhāyasaddaṃ assosi. Athassā ‘‘dhaññāvatime, ye vihāraṃ gantvā evarūpe cetiyaṅgaṇe anusañcarituṃ, evarūpañca madhuradhammakathaṃ sotuṃ labhantī’’ti muttarāsisadisaṃ cetiyaṃ passantiyā eva ubbegāpīti udapādi. Sā ākāse laṅghitvā mātāpitūnaṃ purimataraṃyeva ākāsato cetiyaṅgaṇe oruyha cetiyaṃ vanditvā dhammaṃ suṇamānā aṭṭhāsi. Atha naṃ mātāpitaro āgantvā ‘‘amma tvaṃ katarena maggena āgatāsī’’ti pucchiṃsu. Sā ‘‘ākāsena āgatāmhi, na maggenā’’ti vatvā ‘‘amma ākāsena nāma khīṇāsavā sañcaranti, tvaṃ kathaṃ āgatā’’ti vuttā āha – ‘‘mayhaṃ candālokena cetiyaṃ ālokentiyā ṭhitāya buddhārammaṇā balavapīti uppajji. Athāhaṃ neva attano ṭhitabhāvaṃ, na nisinnabhāvaṃ aññāsiṃ, gahitanimitteneva pana ākāse laṅghitvā cetiyaṅgaṇe patiṭṭhitāmhī’’ti."
    ],
    "innerText": "Tassā kira mātāpitaro sāyaṃ dhammassavanatthāya vihāraṃ gacchantā ‘‘amma tvaṃ garubhārā akāle vicarituṃ na sakkosi, mayaṃ tuyhaṃ pattiṃ katvā dhammaṃ sossāmā’’ti agamaṃsu. Sā gantukāmāpi tesaṃ vacanaṃ paṭibāhituṃ asakkontī ghare ohīyitvā gharājire ṭhatvā candālokena girikaṇḍake ākāsacetiyaṅgaṇaṃ olokentī cetiyassa dīpapūjaṃ addasa, catasso ca parisā mālāgandhādīhi cetiyapūjaṃ katvā padakkhiṇaṃ karontiyo bhikkhusaṅghassa ca gaṇasajjhāyasaddaṃ assosi. Athassā ‘‘dhaññāvatime, ye vihāraṃ gantvā evarūpe cetiyaṅgaṇe anusañcarituṃ, evarūpañca madhuradhammakathaṃ sotuṃ labhantī’’ti muttarāsisadisaṃ cetiyaṃ passantiyā eva ubbegāpīti udapādi. Sā ākāse laṅghitvā mātāpitūnaṃ purimataraṃyeva ākāsato cetiyaṅgaṇe oruyha cetiyaṃ vanditvā dhammaṃ suṇamānā aṭṭhāsi. Atha naṃ mātāpitaro āgantvā ‘‘amma tvaṃ katarena maggena āgatāsī’’ti pucchiṃsu. Sā ‘‘ākāsena āgatāmhi, na maggenā’’ti vatvā ‘‘amma ākāsena nāma khīṇāsavā sañcaranti, tvaṃ kathaṃ āgatā’’ti vuttā āha – ‘‘mayhaṃ candālokena cetiyaṃ ālokentiyā ṭhitāya buddhārammaṇā balavapīti uppajji. Athāhaṃ neva attano ṭhitabhāvaṃ, na nisinnabhāvaṃ aññāsiṃ, gahitanimitteneva pana ākāse laṅghitvā cetiyaṅgaṇe patiṭṭhitāmhī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ ubbegāpīti ākāse laṅghāpanappamāṇā hoti. Pharaṇāpītiyā pana uppannāya sakalasarīraṃ dhamitvā pūritavatthi viya mahatā udakoghena pakkhandapabbatakucchi viya ca anuparipphuṭaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sā ",
      " panesā pañcavidhā pīti gabbhaṃ gaṇhantī paripākaṃ gacchantī duvidhaṃ passaddhiṃ paripūreti kāyapassaddhiñca cittapassaddhiñca. Passaddhi gabbhaṃ gaṇhantī paripākaṃ gacchantī duvidhampi sukhaṃ paripūreti kāyikañca cetasikañca. Sukhaṃ gabbhaṃ gaṇhantaṃ paripākaṃ gacchantaṃ tividhaṃ samādhiṃ paripūreti khaṇikasamādhiṃ upacārasamādhiṃ appanā samādhinti. Tāsu yā appanāsamādhissa mūlaṃ hutvā vaḍḍhamānā samādhisampayogaṃ gatā pharaṇāpīti, ayaṃ imasmiṃ atthe adhippetā pītīti."
    ],
    "innerText": "Sā panesā pañcavidhā pīti gabbhaṃ gaṇhantī paripākaṃ gacchantī duvidhaṃ passaddhiṃ paripūreti kāyapassaddhiñca cittapassaddhiñca. Passaddhi gabbhaṃ gaṇhantī paripākaṃ gacchantī duvidhampi sukhaṃ paripūreti kāyikañca cetasikañca. Sukhaṃ gabbhaṃ gaṇhantaṃ paripākaṃ gacchantaṃ tividhaṃ samādhiṃ paripūreti khaṇikasamādhiṃ upacārasamādhiṃ appanā samādhinti. Tāsu yā appanāsamādhissa mūlaṃ hutvā vaḍḍhamānā samādhisampayogaṃ gatā pharaṇāpīti, ayaṃ imasmiṃ atthe adhippetā pītīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "73"
      },
      ". Itaraṃ pana sukhanaṃ sukhaṃ, suṭṭhu vā khādati, khanati ca kāyacittābādhanti sukhaṃ, taṃ sātalakkhaṇaṃ, sampayuttānaṃ upabrūhanarasaṃ, anuggahapaccupaṭṭhānaṃ. Satipi ca nesaṃ katthaci avippayoge iṭṭhārammaṇapaṭilābhatuṭṭhi pīti. Paṭiladdharasānubhavanaṃ sukhaṃ. Yattha pīti, tattha sukhaṃ. Yattha sukhaṃ, tattha na niyamato pīti. Saṅkhārakkhandhasaṅgahitā pīti. Vedanākkhandhasaṅgahitaṃ sukhaṃ. Kantārakhinnassa ",
      " vanantudakadassanasavanesu viya pīti. Vanacchāyāpavesanaudakaparibhogesu viya sukhaṃ. Tasmiṃ tasmiṃ samaye pākaṭabhāvato cetaṃ vuttanti veditabbaṃ. Iti ayañca pīti idañca sukhaṃ assa jhānassa, asmiṃ vā jhāne atthīti idaṃ jhānaṃ pītisukhanti vuccati."
    ],
    "innerText": "73. Itaraṃ pana sukhanaṃ sukhaṃ, suṭṭhu vā khādati, khanati ca kāyacittābādhanti sukhaṃ, taṃ sātalakkhaṇaṃ, sampayuttānaṃ upabrūhanarasaṃ, anuggahapaccupaṭṭhānaṃ. Satipi ca nesaṃ katthaci avippayoge iṭṭhārammaṇapaṭilābhatuṭṭhi pīti. Paṭiladdharasānubhavanaṃ sukhaṃ. Yattha pīti, tattha sukhaṃ. Yattha sukhaṃ, tattha na niyamato pīti. Saṅkhārakkhandhasaṅgahitā pīti. Vedanākkhandhasaṅgahitaṃ sukhaṃ. Kantārakhinnassa vanantudakadassanasavanesu viya pīti. Vanacchāyāpavesanaudakaparibhogesu viya sukhaṃ. Tasmiṃ tasmiṃ samaye pākaṭabhāvato cetaṃ vuttanti veditabbaṃ. Iti ayañca pīti idañca sukhaṃ assa jhānassa, asmiṃ vā jhāne atthīti idaṃ jhānaṃ pītisukhanti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā pīti ca sukhañca pītisukhaṃ, dhammavinayādayo viya. Vivekajaṃ pītisukhamassa jhānassa, asmiṃ vā jhāne atthīti evampi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vivekajaṃpītisukhaṃ"
      },
      ". Yatheva hi jhānaṃ, evaṃ pītisukhampettha vivekajameva hoti, tañcassa atthi, tasmā ekapadeneva ‘‘vivekajaṃpītisukha’’ntipi vattuṃ yujjati. Vibhaṅge pana ‘‘idaṃ sukhaṃ imāya pītiyā sahagata’’ntiādinā (vibha. 567) nayena vuttaṃ. Attho pana tatthāpi evameva daṭṭhabbo."
    ],
    "innerText": "Atha vā pīti ca sukhañca pītisukhaṃ, dhammavinayādayo viya. Vivekajaṃ pītisukhamassa jhānassa, asmiṃ vā jhāne atthīti evampi vivekajaṃpītisukhaṃ. Yatheva hi jhānaṃ, evaṃ pītisukhampettha vivekajameva hoti, tañcassa atthi, tasmā ekapadeneva ‘‘vivekajaṃpītisukha’’ntipi vattuṃ yujjati. Vibhaṅge pana ‘‘idaṃ sukhaṃ imāya pītiyā sahagata’’ntiādinā (vibha. 567) nayena vuttaṃ. Attho pana tatthāpi evameva daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamaṃ jhāna"
      },
      "nti idaṃ parato āvibhavissati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasampajjā"
      },
      "ti upagantvā, pāpuṇitvāti vuttaṃ hoti. Upasampādayitvā vā, nipphādetvāti vuttaṃ hoti. Vibhaṅge pana ‘‘upasampajjāti paṭhamassa jhānassa lābho paṭilābho patti sampatti phusanā sacchikiriyā upasampadā’’ti vuttaṃ. Tassāpi evamevattho daṭṭhabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viharatī"
      },
      "ti tadanurūpena iriyāpathavihārena itivuttappakārajhānasamaṅgī hutvā attabhāvassa iriyaṃ vuttiṃ pālanaṃ yapanaṃ yāpanaṃ cāraṃ vihāraṃ abhinipphādeti ",
      ". Vuttañhetaṃ vibhaṅge ‘‘viharatīti iriyati vattati pāleti yapeti yāpeti carati viharati, tena vuccati viharatī’’ti (vibha. 540)."
    ],
    "innerText": "Paṭhamaṃ jhānanti idaṃ parato āvibhavissati. Upasampajjāti upagantvā, pāpuṇitvāti vuttaṃ hoti. Upasampādayitvā vā, nipphādetvāti vuttaṃ hoti. Vibhaṅge pana ‘‘upasampajjāti paṭhamassa jhānassa lābho paṭilābho patti sampatti phusanā sacchikiriyā upasampadā’’ti vuttaṃ. Tassāpi evamevattho daṭṭhabbo. Viharatīti tadanurūpena iriyāpathavihārena itivuttappakārajhānasamaṅgī hutvā attabhāvassa iriyaṃ vuttiṃ pālanaṃ yapanaṃ yāpanaṃ cāraṃ vihāraṃ abhinipphādeti . Vuttañhetaṃ vibhaṅge ‘‘viharatīti iriyati vattati pāleti yapeti yāpeti carati viharati, tena vuccati viharatī’’ti (vibha. 540)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pañcaṅgavippahīnādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "74"
      },
      ". Yaṃ pana vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pañcaṅgavippahīnaṃ pañcaṅgasamannāgata’’"
      },
      "nti, tattha kāmacchando, byāpādo, thinamiddhaṃ, uddhaccakukkuccaṃ, vicikicchāti imesaṃ pañcannaṃ nīvaraṇānaṃ pahānavasena pañcaṅgavippahīnatā veditabbā. Na hi etesu appahīnesu jhānaṃ uppajjati. Tenassetāni pahānaṅgānīti vuccanti. Kiñcāpi hi jhānakkhaṇe aññepi akusalā dhammā pahīyanti, tathāpi etāneva visesena jhānantarāyakarāni. Kāmacchandena hi nānāvisayappalobhitaṃ cittaṃ na ekattārammaṇe samādhiyati. Kāmacchandābhibhūtaṃ vā taṃ na kāmadhātuppahānāya paṭipadaṃ paṭipajjati. Byāpādena cārammaṇe paṭihaññamānaṃ na nirantaraṃ pavattati ",
      ". Thinamiddhābhibhūtaṃ akammaññaṃ hoti. Uddhaccakukkuccaparetaṃ avūpasantameva hutvā paribbhamati. Vicikicchāya upahataṃ jhānādhigamasādhikaṃ paṭipadaṃ nārohati. Iti visesena jhānantarāyakarattā etāneva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pahānaṅgānī"
      },
      "ti vuttānīti."
    ],
    "innerText": "74. Yaṃ pana vuttaṃ ‘‘pañcaṅgavippahīnaṃ pañcaṅgasamannāgata’’nti, tattha kāmacchando, byāpādo, thinamiddhaṃ, uddhaccakukkuccaṃ, vicikicchāti imesaṃ pañcannaṃ nīvaraṇānaṃ pahānavasena pañcaṅgavippahīnatā veditabbā. Na hi etesu appahīnesu jhānaṃ uppajjati. Tenassetāni pahānaṅgānīti vuccanti. Kiñcāpi hi jhānakkhaṇe aññepi akusalā dhammā pahīyanti, tathāpi etāneva visesena jhānantarāyakarāni. Kāmacchandena hi nānāvisayappalobhitaṃ cittaṃ na ekattārammaṇe samādhiyati. Kāmacchandābhibhūtaṃ vā taṃ na kāmadhātuppahānāya paṭipadaṃ paṭipajjati. Byāpādena cārammaṇe paṭihaññamānaṃ na nirantaraṃ pavattati . Thinamiddhābhibhūtaṃ akammaññaṃ hoti. Uddhaccakukkuccaparetaṃ avūpasantameva hutvā paribbhamati. Vicikicchāya upahataṃ jhānādhigamasādhikaṃ paṭipadaṃ nārohati. Iti visesena jhānantarāyakarattā etāneva pahānaṅgānīti vuttānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yasmā pana vitakko ārammaṇe cittaṃ abhiniropeti, vicāro anuppabandhati, tehi avikkhepāya sampāditappayogassa cetaso payogasampattisambhavā pīti pīṇanaṃ, sukhañca upabrūhanaṃ karoti. Atha naṃ sasesasampayuttadhammaṃ etehi abhiniropanānuppabandhanapīṇanaupabrūhanehi anuggahitā ekaggatā ekattārammaṇe samaṃ sammā ca ādhiyati, tasmā vitakko vicāro pīti sukhaṃ cittekaggatāti imesaṃ pañcannaṃ uppattivasena pañcaṅgasamannāgatatā veditabbā. Uppannesu hi etesu pañcasu jhānaṃ uppannaṃ nāma hoti. Tenassa etāni pañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samannāgataṅgānī"
      },
      "ti vuccanti. Tasmā na etehi samannāgataṃ aññadeva jhānaṃ nāma atthīti gahetabbaṃ. Yathā pana aṅgamattavaseneva caturaṅginī senā, pañcaṅgikaṃ tūriyaṃ, aṭṭhaṅgiko ca maggoti vuccati, evamidampi aṅgamattavaseneva pañcaṅgikanti vā pañcaṅgasamannāgatanti vā vuccatīti veditabbaṃ."
    ],
    "innerText": "Yasmā pana vitakko ārammaṇe cittaṃ abhiniropeti, vicāro anuppabandhati, tehi avikkhepāya sampāditappayogassa cetaso payogasampattisambhavā pīti pīṇanaṃ, sukhañca upabrūhanaṃ karoti. Atha naṃ sasesasampayuttadhammaṃ etehi abhiniropanānuppabandhanapīṇanaupabrūhanehi anuggahitā ekaggatā ekattārammaṇe samaṃ sammā ca ādhiyati, tasmā vitakko vicāro pīti sukhaṃ cittekaggatāti imesaṃ pañcannaṃ uppattivasena pañcaṅgasamannāgatatā veditabbā. Uppannesu hi etesu pañcasu jhānaṃ uppannaṃ nāma hoti. Tenassa etāni pañca samannāgataṅgānīti vuccanti. Tasmā na etehi samannāgataṃ aññadeva jhānaṃ nāma atthīti gahetabbaṃ. Yathā pana aṅgamattavaseneva caturaṅginī senā, pañcaṅgikaṃ tūriyaṃ, aṭṭhaṅgiko ca maggoti vuccati, evamidampi aṅgamattavaseneva pañcaṅgikanti vā pañcaṅgasamannāgatanti vā vuccatīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Etāni ca pañcaṅgāni kiñcāpi upacārakkhaṇepi atthi, atha kho upacāre pakaticittato ",
      " balavatarāni. Idha pana upacāratopi balavatarāni rūpāvacaralakkhaṇappattāni. Ettha hi vitakko suvisadena ākārena ārammaṇe cittaṃ abhiniropayamāno uppajjati. Vicāro ativiya ārammaṇaṃ anumajjamāno. Pītisukhaṃ sabbāvantampi kāyaṃ pharamānaṃ. Tenevāha – ‘‘nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṃ hotī’’ti (dī. ni. 1.228). Cittekaggatāpi heṭṭhimamhi samuggapaṭale uparimaṃ samuggapaṭalaṃ viya ārammaṇesu phusitā hutvā uppajjati, ayametesaṃ itarehi viseso. Tattha cittekaggatā kiñcāpi savitakkaṃ savicāranti imasmiṃ pāṭhe na niddiṭṭhā, tathāpi vibhaṅge ‘‘jhānanti vitakko vicāro pīti sukhaṃ cittassekaggatā’’ti (vibha. 569) evaṃ vuttattā aṅgameva. Yena hi adhippāyena bhagavatā uddeso kato, soyeva tena vibhaṅge pakāsitoti."
    ],
    "innerText": "Etāni ca pañcaṅgāni kiñcāpi upacārakkhaṇepi atthi, atha kho upacāre pakaticittato balavatarāni. Idha pana upacāratopi balavatarāni rūpāvacaralakkhaṇappattāni. Ettha hi vitakko suvisadena ākārena ārammaṇe cittaṃ abhiniropayamāno uppajjati. Vicāro ativiya ārammaṇaṃ anumajjamāno. Pītisukhaṃ sabbāvantampi kāyaṃ pharamānaṃ. Tenevāha – ‘‘nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṃ hotī’’ti (dī. ni. 1.228). Cittekaggatāpi heṭṭhimamhi samuggapaṭale uparimaṃ samuggapaṭalaṃ viya ārammaṇesu phusitā hutvā uppajjati, ayametesaṃ itarehi viseso. Tattha cittekaggatā kiñcāpi savitakkaṃ savicāranti imasmiṃ pāṭhe na niddiṭṭhā, tathāpi vibhaṅge ‘‘jhānanti vitakko vicāro pīti sukhaṃ cittassekaggatā’’ti (vibha. 569) evaṃ vuttattā aṅgameva. Yena hi adhippāyena bhagavatā uddeso kato, soyeva tena vibhaṅge pakāsitoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Tividhakalyāṇaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "75"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tividhakalyāṇaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dasalakkhaṇasampanna"
      },
      "nti ettha pana ādimajjhapariyosānavasena tividhakalyāṇatā. Tesaṃyeva ca ādimajjhapariyosānānaṃ lakkhaṇavasena dasalakkhaṇasampannatā veditabbā."
    ],
    "innerText": "75.Tividhakalyāṇaṃdasalakkhaṇasampannanti ettha pana ādimajjhapariyosānavasena tividhakalyāṇatā. Tesaṃyeva ca ādimajjhapariyosānānaṃ lakkhaṇavasena dasalakkhaṇasampannatā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatrāyaṃ pāḷi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Paṭhamassa jhānassa paṭipadāvisuddhi ādi, upekkhānubrūhanā majjhe, sampahaṃsanā pariyosānaṃ, paṭhamassa jhānassa paṭipadāvisuddhi ādi, ādissa kati lakkhaṇāni? Ādissa tīṇi lakkhaṇāni, yo tassa paribandho, tato cittaṃ visujjhati, visuddhattā cittaṃ majjhimaṃ samathanimittaṃ paṭipajjati, paṭipannattā tattha cittaṃ pakkhandati. Yañca paribandhato cittaṃ visujjhati, yañca visuddhattā cittaṃ majjhimaṃ samathanimittaṃ paṭipajjati, yañca paṭipannattā tattha cittaṃ pakkhandati. Paṭhamassa jhānassa paṭipadāvisuddhi ādi, ādissa imāni tīṇi lakkhaṇāni. Tena vuccati paṭhamaṃ jhānaṃ ādikalyāṇañceva hoti tilakkhaṇasampannañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Paṭhamassa jhānassa upekkhānubrūhanā majjhe, majjhassa kati lakkhaṇāni? Majjhassa ",
      " tīṇi lakkhaṇāni, visuddhaṃ cittaṃ ajjhupekkhati, samathapaṭipannaṃ ajjhupekkhati, ekattupaṭṭhānaṃ ajjhupekkhati. Yañca visuddhaṃ cittaṃ ajjhupekkhati, yañca samathapaṭipannaṃ ajjhupekkhati, yañca ekattupaṭṭhānaṃ ajjhupekkhati. Paṭhamassa jhānassa upekkhānubrūhanā majjhe, majjhassa imāni tīṇi lakkhaṇāni. Tena vuccati paṭhamaṃ jhānaṃ majjhekalyāṇañceva hoti tilakkhaṇasampannañca."
    ],
    "innerText": "‘‘Paṭhamassa jhānassa upekkhānubrūhanā majjhe, majjhassa kati lakkhaṇāni? Majjhassa tīṇi lakkhaṇāni, visuddhaṃ cittaṃ ajjhupekkhati, samathapaṭipannaṃ ajjhupekkhati, ekattupaṭṭhānaṃ ajjhupekkhati. Yañca visuddhaṃ cittaṃ ajjhupekkhati, yañca samathapaṭipannaṃ ajjhupekkhati, yañca ekattupaṭṭhānaṃ ajjhupekkhati. Paṭhamassa jhānassa upekkhānubrūhanā majjhe, majjhassa imāni tīṇi lakkhaṇāni. Tena vuccati paṭhamaṃ jhānaṃ majjhekalyāṇañceva hoti tilakkhaṇasampannañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Paṭhamassa jhānassa sampahaṃsanā pariyosānaṃ, pariyosānassa kati lakkhaṇāni? Pariyosānassa cattāri lakkhaṇāni, tattha jātānaṃ dhammānaṃ anativattanaṭṭhena sampahaṃsanā, indriyānaṃ ekarasaṭṭhena sampahaṃsanā, tadupagavīriyavāhanaṭṭhena sampahaṃsanā, āsevanaṭṭhena sampahaṃsanā. Paṭhamassa jhānassa sampahaṃsanā pariyosānaṃ, pariyosānassa imāni cattāri lakkhaṇāni. Tena vuccati paṭhamaṃ jhānaṃ pariyosānakalyāṇañceva hoti catulakkhaṇasampannañcā’’ti (paṭi. ma. 1.158)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatra ",
      " paṭipadāvisuddhi nāma sasambhāriko upacāro. Upekkhānubrūhanā nāma appanā. Sampahaṃsanā nāma paccavekkhaṇāti evameke vaṇṇayanti. Yasmā pana ‘‘ekattagataṃ cittaṃ paṭipadāvisuddhipakkhandañceva hoti upekkhānubrūhitañca ñāṇena ca sampahaṃsita’’nti (paṭi. ma. 1.158) pāḷiyaṃ vuttaṃ, tasmā antoappanāyameva āgamanavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭipadāvisuddhi,"
      },
      " tatramajjhattupekkhāya kiccavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upekkhānubrūhanā,"
      },
      " dhammānaṃ anativattanādibhāvasādhanena pariyodāpakassa ñāṇassa kiccanipphattivasena sampahaṃsanā ca veditabbā."
    ],
    "innerText": "Tatra paṭipadāvisuddhi nāma sasambhāriko upacāro. Upekkhānubrūhanā nāma appanā. Sampahaṃsanā nāma paccavekkhaṇāti evameke vaṇṇayanti. Yasmā pana ‘‘ekattagataṃ cittaṃ paṭipadāvisuddhipakkhandañceva hoti upekkhānubrūhitañca ñāṇena ca sampahaṃsita’’nti (paṭi. ma. 1.158) pāḷiyaṃ vuttaṃ, tasmā antoappanāyameva āgamanavasena paṭipadāvisuddhi, tatramajjhattupekkhāya kiccavasena upekkhānubrūhanā, dhammānaṃ anativattanādibhāvasādhanena pariyodāpakassa ñāṇassa kiccanipphattivasena sampahaṃsanā ca veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ? Yasmiñhi vāre appanā uppajjati, tasmiṃ yo nīvaraṇasaṅkhāto kilesagaṇo tassa jhānassa paribandho, tato cittaṃ visujjhati. Visuddhattā āvaraṇavirahitaṃ hutvā majjhimaṃ samathanimittaṃ paṭipajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhimaṃ samathanimittaṃ"
      },
      " nāma samappavatto appanāsamādhiyeva. Tadanantaraṃ pana purimacittaṃ ekasantatipariṇāmanayena tathattamupagacchamānaṃ majjhimaṃ samathanimittaṃ paṭipajjati nāma, evaṃ paṭipannattā tathattupagamanena tattha pakkhandati nāma. Evaṃ tāva purimacitte vijjamānākāranipphādikā paṭhamassa jhānassa uppādakkhaṇeyeva āgamanavasena paṭipadāvisuddhi veditabbā."
    ],
    "innerText": "Kathaṃ? Yasmiñhi vāre appanā uppajjati, tasmiṃ yo nīvaraṇasaṅkhāto kilesagaṇo tassa jhānassa paribandho, tato cittaṃ visujjhati. Visuddhattā āvaraṇavirahitaṃ hutvā majjhimaṃ samathanimittaṃ paṭipajjati. Majjhimaṃ samathanimittaṃ nāma samappavatto appanāsamādhiyeva. Tadanantaraṃ pana purimacittaṃ ekasantatipariṇāmanayena tathattamupagacchamānaṃ majjhimaṃ samathanimittaṃ paṭipajjati nāma, evaṃ paṭipannattā tathattupagamanena tattha pakkhandati nāma. Evaṃ tāva purimacitte vijjamānākāranipphādikā paṭhamassa jhānassa uppādakkhaṇeyeva āgamanavasena paṭipadāvisuddhi veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " visuddhassa pana tassa puna visodhetabbābhāvato visodhane byāpāraṃ akaronto visuddhaṃ cittaṃ ajjhupekkhati nāma. Samathabhāvupagamanena samathapaṭipannassa puna samādhāne byāpāraṃ akaronto samathapaṭipannaṃ ajjhupekkhati nāma. Samathapaṭipannabhāvato eva cassa kilesasaṃsaggaṃ pahāya ekattena upaṭṭhitassa puna ekattupaṭṭhāne byāpāraṃ akaronto ekattupaṭṭhānaṃ ajjhupekkhati nāma. Evaṃ tatramajjhattupekkhāya kiccavasena upekkhānubrūhanā veditabbā."
    ],
    "innerText": "Evaṃ visuddhassa pana tassa puna visodhetabbābhāvato visodhane byāpāraṃ akaronto visuddhaṃ cittaṃ ajjhupekkhati nāma. Samathabhāvupagamanena samathapaṭipannassa puna samādhāne byāpāraṃ akaronto samathapaṭipannaṃ ajjhupekkhati nāma. Samathapaṭipannabhāvato eva cassa kilesasaṃsaggaṃ pahāya ekattena upaṭṭhitassa puna ekattupaṭṭhāne byāpāraṃ akaronto ekattupaṭṭhānaṃ ajjhupekkhati nāma. Evaṃ tatramajjhattupekkhāya kiccavasena upekkhānubrūhanā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ye panete evaṃ upekkhānubrūhite tattha jātā samādhipaññāsaṅkhātā yuganaddhadhammā aññamaññaṃ anativattamānā hutvā pavattā, yāni ca saddhādīni indriyāni nānākilesehi vimuttattā vimuttirasena ekarasāni hutvā pavattāni, yañcesa tadupagaṃ tesaṃ anativattanaekarasabhāvānaṃ anucchavikaṃ vīriyaṃ vāhayati, yā cassa tasmiṃ khaṇe pavattā āsevanā, sabbepi te ākārā yasmā ñāṇena saṃkilesavodānesu taṃ taṃ ādīnavañca ānisaṃsañca ",
      " disvā tathā tathā sampahaṃsitattā visodhitattā pariyodāpitattā nipphannāva, tasmā ‘‘dhammānaṃ anativattanādibhāvasādhanena pariyodāpakassa ñāṇassa kiccanipphattivasena sampahaṃsanā veditabbā’’ti vuttaṃ."
    ],
    "innerText": "Ye panete evaṃ upekkhānubrūhite tattha jātā samādhipaññāsaṅkhātā yuganaddhadhammā aññamaññaṃ anativattamānā hutvā pavattā, yāni ca saddhādīni indriyāni nānākilesehi vimuttattā vimuttirasena ekarasāni hutvā pavattāni, yañcesa tadupagaṃ tesaṃ anativattanaekarasabhāvānaṃ anucchavikaṃ vīriyaṃ vāhayati, yā cassa tasmiṃ khaṇe pavattā āsevanā, sabbepi te ākārā yasmā ñāṇena saṃkilesavodānesu taṃ taṃ ādīnavañca ānisaṃsañca disvā tathā tathā sampahaṃsitattā visodhitattā pariyodāpitattā nipphannāva, tasmā ‘‘dhammānaṃ anativattanādibhāvasādhanena pariyodāpakassa ñāṇassa kiccanipphattivasena sampahaṃsanā veditabbā’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha yasmā upekkhāvasena ñāṇaṃ pākaṭaṃ hoti. Yathāha – ‘‘tathāpaggahitaṃ cittaṃ sādhukaṃ ajjhupekkhati, upekkhāvasena paññāvasena paññindriyaṃ adhimattaṃ hoti, upekkhāvasena nānattakilesehi cittaṃ vimuccati, vimokkhavasena paññāvasena paññindriyaṃ adhimattaṃ hoti. Vimuttattā te dhammā ekarasā honti. Ekarasaṭṭhena bhāvanā’’ti (paṭi. ma. 1.201). Tasmā ñāṇakiccabhūtā sampahaṃsanā pariyosānanti vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni paṭhamaṃ jhānaṃ adhigataṃ hoti pathavīkasiṇanti ettha gaṇanānupubbatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭhamaṃ,"
      },
      " paṭhamaṃ uppannantipi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭhamaṃ"
      },
      ". Ārammaṇūpanijjhānato paccanīkajhāpanato vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānaṃ"
      },
      ". Pathavīmaṇḍalaṃ pana sakalaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pathavīkasiṇa"
      },
      "nti vuccati, taṃ nissāya paṭiladdhanimittampi, pathavīkasiṇanimitte paṭiladdhajhānampi. Tatra imasmiṃ atthe jhānaṃ pathavīkasiṇanti veditabbaṃ. Taṃ sandhāya vuttaṃ ‘‘paṭhamaṃ jhānaṃ adhigataṃ hoti pathavīkasiṇa’’nti."
    ],
    "innerText": "Idāni paṭhamaṃ jhānaṃ adhigataṃ hoti pathavīkasiṇanti ettha gaṇanānupubbatā paṭhamaṃ, paṭhamaṃ uppannantipi paṭhamaṃ. Ārammaṇūpanijjhānato paccanīkajhāpanato vā jhānaṃ. Pathavīmaṇḍalaṃ pana sakalaṭṭhena pathavīkasiṇanti vuccati, taṃ nissāya paṭiladdhanimittampi, pathavīkasiṇanimitte paṭiladdhajhānampi. Tatra imasmiṃ atthe jhānaṃ pathavīkasiṇanti veditabbaṃ. Taṃ sandhāya vuttaṃ ‘‘paṭhamaṃ jhānaṃ adhigataṃ hoti pathavīkasiṇa’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ciraṭṭhitisampādanaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "76"
      },
      ". Evamadhigate ",
      " pana etasmiṃ tena yoginā vālavedhinā viya, sūdena viya ca ākārā pariggahetabbā. Yathā hi sukusalo dhanuggaho vālavedhāya kammaṃ kurumāno yasmiṃ vāre vālaṃ vijjhati, tasmiṃ vāre akkantapadānañca dhanudaṇḍassa ca jiyāya ca sarassa ca ākāraṃ pariggaṇheyya. ‘‘Evaṃ me ṭhitena evaṃ dhanudaṇḍaṃ evaṃ jiyaṃ evaṃ saraṃ gahetvā vālo viddho’’ti. So tato paṭṭhāya tatheva te ākāre sampādento avirādhetvā vālaṃ vijjheyya. Evameva yogināpi ‘‘imaṃ nāma me bhojanaṃ bhuñjitvā evarūpaṃ puggalaṃ sevamānena evarūpe senāsane iminā nāma iriyāpathena imasmiṃ kāle idaṃ adhigata’’nti ete bhojanasappāyādayo ākārā pariggahetabbā. Evañhi so naṭṭhe ",
      " vā tasmiṃ te ākāre sampādetvā puna uppādetuṃ, appaguṇaṃ vā paguṇaṃ karonto punappunaṃ appetuṃ sakkhissati."
    ],
    "innerText": "76. Evamadhigate pana etasmiṃ tena yoginā vālavedhinā viya, sūdena viya ca ākārā pariggahetabbā. Yathā hi sukusalo dhanuggaho vālavedhāya kammaṃ kurumāno yasmiṃ vāre vālaṃ vijjhati, tasmiṃ vāre akkantapadānañca dhanudaṇḍassa ca jiyāya ca sarassa ca ākāraṃ pariggaṇheyya. ‘‘Evaṃ me ṭhitena evaṃ dhanudaṇḍaṃ evaṃ jiyaṃ evaṃ saraṃ gahetvā vālo viddho’’ti. So tato paṭṭhāya tatheva te ākāre sampādento avirādhetvā vālaṃ vijjheyya. Evameva yogināpi ‘‘imaṃ nāma me bhojanaṃ bhuñjitvā evarūpaṃ puggalaṃ sevamānena evarūpe senāsane iminā nāma iriyāpathena imasmiṃ kāle idaṃ adhigata’’nti ete bhojanasappāyādayo ākārā pariggahetabbā. Evañhi so naṭṭhe vā tasmiṃ te ākāre sampādetvā puna uppādetuṃ, appaguṇaṃ vā paguṇaṃ karonto punappunaṃ appetuṃ sakkhissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathā ca kusalo sūdo bhattāraṃ parivisanto tassa yaṃ yaṃ ruciyā bhuñjati, taṃ taṃ sallakkhetvā tato paṭṭhāya tādisameva upanāmento lābhassa bhāgī hoti, evamayampi adhigatakkhaṇe bhojanādayo ākāre gahetvā te sampādento naṭṭhe naṭṭhe punappunaṃ appanāya lābhī hoti. Tasmā tena vālavedhinā viya sūdena viya ca ākārā pariggahetabbā. Vuttampi cetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, paṇḍito byatto kusalo sūdo rājānaṃ vā rājamahāmattaṃ vā nānaccayehi sūpehi paccupaṭṭhito assa ambilaggehipi tittakaggehipi kaṭukaggehipi madhuraggehipi khārikehipi akhārikehipi loṇikehipi aloṇikehipi. Sa kho so, bhikkhave, paṇḍito byatto kusalo sūdo sakassa bhattu nimittaṃ uggaṇhāti ‘idaṃ vā me ajja bhattu sūpeyyaṃ ruccati, imassa vā abhiharati, imassa vā bahuṃ gaṇhāti, imassa vā vaṇṇaṃ bhāsati, ambilaggaṃ vā me ajja bhattu sūpeyyaṃ ruccati, ambilaggassa vā abhiharati, ambilaggassa vā bahuṃ gaṇhāti, ambilaggassa vā vaṇṇaṃ bhāsati…pe… aloṇikassa vā vaṇṇaṃ bhāsatī’ti. Sa kho so, bhikkhave, paṇḍito byatto kusalo sūdo lābhī ceva hoti acchādanassa, lābhī vetanassa, lābhī abhihārānaṃ. Taṃ kissa hetu? Tathā hi so, bhikkhave, paṇḍito ",
      " byatto kusalo sūdo sakassa bhattu nimittaṃ uggaṇhāti. Evameva kho, bhikkhave, idhekacco paṇḍito byatto kusalo bhikkhu kāye kāyānupassī viharati…pe… vedanāsu vedanā… citte cittā… dhammesu dhammānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Tassa dhammesu dhammānupassino viharato cittaṃ samādhiyati, upakkilesā pahīyanti, so taṃ nimittaṃ uggaṇhāti. Sa kho so, bhikkhave, paṇḍito byatto kusalo bhikkhu lābhī ceva hoti diṭṭhadhammasukhavihārānaṃ, lābhī satisampajaññassa. Taṃ kissa hetu? Tathā ",
      " hi so, bhikkhave, paṇḍito byatto kusalo bhikkhu sakassa cittassa nimittaṃ uggaṇhātī’’ti (saṃ. ni. 5.374)."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, paṇḍito byatto kusalo sūdo rājānaṃ vā rājamahāmattaṃ vā nānaccayehi sūpehi paccupaṭṭhito assa ambilaggehipi tittakaggehipi kaṭukaggehipi madhuraggehipi khārikehipi akhārikehipi loṇikehipi aloṇikehipi. Sa kho so, bhikkhave, paṇḍito byatto kusalo sūdo sakassa bhattu nimittaṃ uggaṇhāti ‘idaṃ vā me ajja bhattu sūpeyyaṃ ruccati, imassa vā abhiharati, imassa vā bahuṃ gaṇhāti, imassa vā vaṇṇaṃ bhāsati, ambilaggaṃ vā me ajja bhattu sūpeyyaṃ ruccati, ambilaggassa vā abhiharati, ambilaggassa vā bahuṃ gaṇhāti, ambilaggassa vā vaṇṇaṃ bhāsati…pe… aloṇikassa vā vaṇṇaṃ bhāsatī’ti. Sa kho so, bhikkhave, paṇḍito byatto kusalo sūdo lābhī ceva hoti acchādanassa, lābhī vetanassa, lābhī abhihārānaṃ. Taṃ kissa hetu? Tathā hi so, bhikkhave, paṇḍito byatto kusalo sūdo sakassa bhattu nimittaṃ uggaṇhāti. Evameva kho, bhikkhave, idhekacco paṇḍito byatto kusalo bhikkhu kāye kāyānupassī viharati…pe… vedanāsu vedanā… citte cittā… dhammesu dhammānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Tassa dhammesu dhammānupassino viharato cittaṃ samādhiyati, upakkilesā pahīyanti, so taṃ nimittaṃ uggaṇhāti. Sa kho so, bhikkhave, paṇḍito byatto kusalo bhikkhu lābhī ceva hoti diṭṭhadhammasukhavihārānaṃ, lābhī satisampajaññassa. Taṃ kissa hetu? Tathā hi so, bhikkhave, paṇḍito byatto kusalo bhikkhu sakassa cittassa nimittaṃ uggaṇhātī’’ti (saṃ. ni. 5.374)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nimittaggahaṇena cassa puna te ākāre sampādayato appanāmattameva ijjhati, na ciraṭṭhānaṃ. Ciraṭṭhānaṃ pana samādhiparibandhānaṃ dhammānaṃ suvisodhitattā hoti. Yo hi bhikkhu kāmādīnavapaccavekkhaṇādīhi kāmacchandaṃ na suṭṭhu vikkhambhetvā, kāyapassaddhivasena kāyaduṭṭhullaṃ na suppaṭipassaddhaṃ katvā, ārambhadhātumanasikārādivasena thinamiddhaṃ na suṭṭhu paṭivinodetvā, samathanimittamanasikārādivasena uddhaccakukkuccaṃ na susamūhataṃ katvā, aññepi samādhiparibandhe dhamme na suṭṭhu visodhetvā jhānaṃ samāpajjati, so avisodhitaṃ āsayaṃ paviṭṭhabhamaro viya avisuddhaṃ uyyānaṃ paviṭṭharājā viya ca khippameva nikkhamati. Yo pana samādhiparibandhe dhamme suṭṭhu visodhetvā jhānaṃ samāpajjati, so suvisodhitaṃ āsayaṃ paviṭṭhabhamaro viya suparisuddhaṃ uyyānaṃ paviṭṭharājā viya ca sakalampi divasabhāgaṃ antosamāpattiyaṃyeva hoti. Tenāhu porāṇā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kāmesu chandaṃ paṭighaṃ vinodaye,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Uddhaccamiddhaṃ vicikicchapañcamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Vivekapāmojjakarena cetasā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rājāva suddhantagato tahiṃ rame’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmā ciraṭṭhitikāmena paribandhakadhamme visodhetvā jhānaṃ samāpajjitabbaṃ. Cittabhāvanāvepullatthañca yathāladdhaṃ paṭibhāganimittaṃ vaḍḍhetabbaṃ. Tassa dve vaḍḍhanābhūmiyo upacāraṃ vā ",
      " appanaṃ vā. Upacāraṃ patvāpi hi taṃ vaḍḍhetuṃ vaṭṭati appanaṃ patvāpi. Ekasmiṃ pana ṭhāne avassaṃ vaḍḍhetabbaṃ. Tena vuttaṃ ‘‘yathāladdhaṃ paṭibhāganimittaṃ vaḍḍhetabba’’nti."
    ],
    "innerText": "Tasmā ciraṭṭhitikāmena paribandhakadhamme visodhetvā jhānaṃ samāpajjitabbaṃ. Cittabhāvanāvepullatthañca yathāladdhaṃ paṭibhāganimittaṃ vaḍḍhetabbaṃ. Tassa dve vaḍḍhanābhūmiyo upacāraṃ vā appanaṃ vā. Upacāraṃ patvāpi hi taṃ vaḍḍhetuṃ vaṭṭati appanaṃ patvāpi. Ekasmiṃ pana ṭhāne avassaṃ vaḍḍhetabbaṃ. Tena vuttaṃ ‘‘yathāladdhaṃ paṭibhāganimittaṃ vaḍḍhetabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nimittavaḍḍhananayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "77"
      },
      ". Tatrāyaṃ vaḍḍhananayo, tena yoginā taṃ nimittaṃ pattavaḍḍhanapūvavaḍḍhanabhattavaḍḍhanalatāvaḍḍhanadussavaḍḍhanayogena avaḍḍhetvā yathā nāma kassako kasitabbaṭṭhānaṃ ",
      " naṅgalena paricchinditvā paricchedabbhantare kasati, yathā vā pana bhikkhū sīmaṃ bandhantā paṭhamaṃ nimittāni sallakkhetvā pacchā bandhanti, evameva tassa yathāladdhassa nimittassa anukkamena ekaṅguladvaṅgulativaṅgulacaturaṅgulamattaṃ manasā paricchinditvā yathāparicchedaṃ vaḍḍhetabbaṃ. Aparicchinditvā pana na vaḍḍhetabbaṃ. Tato vidatthiratanapamukhapariveṇavihārasīmānaṃ gāmanigamajanapadarajjasamuddasīmānañca paricchedavasena vaḍḍhayantena cakkavāḷaparicchedena vā tato vāpi uttari paricchinditvā vaḍḍhetabbaṃ."
    ],
    "innerText": "77. Tatrāyaṃ vaḍḍhananayo, tena yoginā taṃ nimittaṃ pattavaḍḍhanapūvavaḍḍhanabhattavaḍḍhanalatāvaḍḍhanadussavaḍḍhanayogena avaḍḍhetvā yathā nāma kassako kasitabbaṭṭhānaṃ naṅgalena paricchinditvā paricchedabbhantare kasati, yathā vā pana bhikkhū sīmaṃ bandhantā paṭhamaṃ nimittāni sallakkhetvā pacchā bandhanti, evameva tassa yathāladdhassa nimittassa anukkamena ekaṅguladvaṅgulativaṅgulacaturaṅgulamattaṃ manasā paricchinditvā yathāparicchedaṃ vaḍḍhetabbaṃ. Aparicchinditvā pana na vaḍḍhetabbaṃ. Tato vidatthiratanapamukhapariveṇavihārasīmānaṃ gāmanigamajanapadarajjasamuddasīmānañca paricchedavasena vaḍḍhayantena cakkavāḷaparicchedena vā tato vāpi uttari paricchinditvā vaḍḍhetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathā hi haṃsapotakā pakkhānaṃ uṭṭhitakālato paṭṭhāya parittaṃ parittaṃ padesaṃ uppatantā paricayaṃ katvā anukkamena candimasūriyasantikaṃ gacchanti, evameva bhikkhu vuttanayena nimittaṃ paricchinditvā vaḍḍhento yāva cakkavāḷaparicchedā tato vā uttari vaḍḍheti. Athassa taṃ nimittaṃ vaḍḍhitavaḍḍhitaṭṭhāne pathaviyā ukkūlavikūlanadīviduggapabbatavisamesu saṅkusatasamabbhāhataṃ usabhacammaṃ viya hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmiṃ pana nimitte pattapaṭhamajjhānena ādikammikena samāpajjanabahulena bhavitabbaṃ, na paccavekkhaṇabahulena. Paccavekkhaṇabahulassa hi jhānaṅgāni thūlāni dubbalāni hutvā upaṭṭhahanti. Athassa tāni evaṃ upaṭṭhitattā upari ussukkanāya paccayataṃ āpajjanti. So appaguṇe jhāne ussukkamāno pattapaṭhamajjhānā ca parihāyati, na ca sakkoti dutiyaṃ pāpuṇituṃ. Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, gāvī pabbateyyā bālā abyattā akhettaññū akusalā visame pabbate carituṃ. Tassā evamassa ‘yaṃnūnāhaṃ agatapubbañceva disaṃ gaccheyyaṃ, akhāditapubbāni ca tiṇāni khādeyyaṃ, apītapubbāni ca pānīyāni piveyya’nti. Sā ",
      " purimaṃ pādaṃ na supatiṭṭhitaṃ patiṭṭhāpetvā pacchimaṃ pādaṃ uddhareyya, sā na ceva agatapubbaṃ disaṃ gaccheyya, na ca akhāditapubbāni tiṇāni khādeyya, na ca apītapubbāni pānīyāni piveyya. Yasmiñcassā padese ṭhitāya evamassa ‘yaṃnūnāhaṃ agatapubbañceva…pe… piveyya’nti. Tañca padesaṃ na sotthinā paccāgaccheyya. Taṃ kissa hetu ",
      "? Tathā hi sā, bhikkhave, gāvī pabbateyyā bālā abyattā akhettaññū akusalā visame pabbate carituṃ, evameva kho, bhikkhave, idhekacco bhikkhu bālo abyatto akhettaññū akusalo vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharituṃ. So taṃ nimittaṃ nāsevati, na bhāveti, na bahulīkaroti, na svādhiṭṭhitaṃ adhiṭṭhāti, tassa evaṃ hoti ‘yaṃnūnāhaṃ vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja vihareyya’nti. So na sakkoti vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharituṃ. Tassevaṃ hoti ‘yaṃnūnāhaṃ vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja vihareyya’nti. So na sakkoti vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharituṃ. Ayaṃ vuccati, bhikkhave, bhikkhu ubhato bhaṭṭho ubhato parihīno, seyyathāpi sā gāvī pabbateyyā bālā abyattā akhettaññū akusalā visame pabbate caritu’’nti (a. ni. 9.35)."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, gāvī pabbateyyā bālā abyattā akhettaññū akusalā visame pabbate carituṃ. Tassā evamassa ‘yaṃnūnāhaṃ agatapubbañceva disaṃ gaccheyyaṃ, akhāditapubbāni ca tiṇāni khādeyyaṃ, apītapubbāni ca pānīyāni piveyya’nti. Sā purimaṃ pādaṃ na supatiṭṭhitaṃ patiṭṭhāpetvā pacchimaṃ pādaṃ uddhareyya, sā na ceva agatapubbaṃ disaṃ gaccheyya, na ca akhāditapubbāni tiṇāni khādeyya, na ca apītapubbāni pānīyāni piveyya. Yasmiñcassā padese ṭhitāya evamassa ‘yaṃnūnāhaṃ agatapubbañceva…pe… piveyya’nti. Tañca padesaṃ na sotthinā paccāgaccheyya. Taṃ kissa hetu ? Tathā hi sā, bhikkhave, gāvī pabbateyyā bālā abyattā akhettaññū akusalā visame pabbate carituṃ, evameva kho, bhikkhave, idhekacco bhikkhu bālo abyatto akhettaññū akusalo vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharituṃ. So taṃ nimittaṃ nāsevati, na bhāveti, na bahulīkaroti, na svādhiṭṭhitaṃ adhiṭṭhāti, tassa evaṃ hoti ‘yaṃnūnāhaṃ vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja vihareyya’nti. So na sakkoti vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharituṃ. Tassevaṃ hoti ‘yaṃnūnāhaṃ vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja vihareyya’nti. So na sakkoti vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharituṃ. Ayaṃ vuccati, bhikkhave, bhikkhu ubhato bhaṭṭho ubhato parihīno, seyyathāpi sā gāvī pabbateyyā bālā abyattā akhettaññū akusalā visame pabbate caritu’’nti (a. ni. 9.35)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmānena tasmiṃyeva tāva paṭhamajjhāne pañcahākārehi ciṇṇavasinā bhavitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pañcavasīkathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "78"
      },
      ". Tatrimā pañca vasiyo āvajjanavasī, samāpajjanavasī, adhiṭṭhānavasī, vuṭṭhānavasī, paccavekkhaṇavasīti. Paṭhamaṃ jhānaṃ yatthicchakaṃ yadicchakaṃ yāvadicchakaṃ āvajjeti, āvajjanāya dandhāyitattaṃ natthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āvajjanavasī"
      },
      ". Paṭhamaṃ jhānaṃ yatthicchakaṃ…pe… samāpajjati, samāpajjanāya dandhāyitattaṃ natthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāpajjanavasī"
      },
      ". Evaṃ sesāpi vitthāretabbā."
    ],
    "innerText": "78. Tatrimā pañca vasiyo āvajjanavasī, samāpajjanavasī, adhiṭṭhānavasī, vuṭṭhānavasī, paccavekkhaṇavasīti. Paṭhamaṃ jhānaṃ yatthicchakaṃ yadicchakaṃ yāvadicchakaṃ āvajjeti, āvajjanāya dandhāyitattaṃ natthīti āvajjanavasī. Paṭhamaṃ jhānaṃ yatthicchakaṃ…pe… samāpajjati, samāpajjanāya dandhāyitattaṃ natthīti samāpajjanavasī. Evaṃ sesāpi vitthāretabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayaṃ panettha atthappakāsanā, paṭhamajjhānato vuṭṭhāya paṭhamaṃ vitakkaṃ āvajjayato bhavaṅgaṃ upacchinditvā uppannāvajjanānantaraṃ vitakkārammaṇāneva cattāri pañca vā javanāni javanti. Tato dve bhavaṅgāni, tato puna vicārārammaṇaṃ āvajjanaṃ, vuttanayāneva javanānīti evaṃ pañcasu ",
      " jhānaṅgesu yadā nirantaraṃ cittaṃ pesetuṃ sakkoti, athassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āvajjanavasī"
      },
      " siddhā hoti. Ayaṃ pana matthakappattā vasī bhagavato yamakapāṭihāriye labbhati ",
      ", aññesaṃ vā evarūpe kāle. Ito paraṃ sīghatarā āvajjanavasī nāma natthi."
    ],
    "innerText": "Ayaṃ panettha atthappakāsanā, paṭhamajjhānato vuṭṭhāya paṭhamaṃ vitakkaṃ āvajjayato bhavaṅgaṃ upacchinditvā uppannāvajjanānantaraṃ vitakkārammaṇāneva cattāri pañca vā javanāni javanti. Tato dve bhavaṅgāni, tato puna vicārārammaṇaṃ āvajjanaṃ, vuttanayāneva javanānīti evaṃ pañcasu jhānaṅgesu yadā nirantaraṃ cittaṃ pesetuṃ sakkoti, athassa āvajjanavasī siddhā hoti. Ayaṃ pana matthakappattā vasī bhagavato yamakapāṭihāriye labbhati , aññesaṃ vā evarūpe kāle. Ito paraṃ sīghatarā āvajjanavasī nāma natthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Āyasmato pana mahāmoggallānassa nandopanandanāgarājadamane viya sīghaṃ samāpajjanasamatthatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāpajjanavasī"
      },
      " nāma."
    ],
    "innerText": "Āyasmato pana mahāmoggallānassa nandopanandanāgarājadamane viya sīghaṃ samāpajjanasamatthatā samāpajjanavasī nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Accharāmattaṃ vā dasaccharāmattaṃ vā khaṇaṃ ṭhapetuṃ samatthatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhiṭṭhānavasī"
      },
      " nāma. Tatheva lahuṃ vuṭṭhātuṃ samatthatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuṭṭhānavasī"
      },
      " nāma. Tadubhayadassanatthaṃ buddharakkhitattherassa vatthuṃ kathetuṃ vaṭṭati."
    ],
    "innerText": "Accharāmattaṃ vā dasaccharāmattaṃ vā khaṇaṃ ṭhapetuṃ samatthatā adhiṭṭhānavasī nāma. Tatheva lahuṃ vuṭṭhātuṃ samatthatā vuṭṭhānavasī nāma. Tadubhayadassanatthaṃ buddharakkhitattherassa vatthuṃ kathetuṃ vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So hāyasmā upasampadāya aṭṭhavassiko hutvā therambatthale mahārohaṇaguttattherassa gilānupaṭṭhānaṃ āgatānaṃ tiṃsamattānaṃ iddhimantasahassānaṃ majjhe nisinno therassa yāguṃ paṭiggāhayamānaṃ upaṭṭhākanāgarājānaṃ gahessāmīti ākāsato pakkhandantaṃ supaṇṇarājānaṃ disvā tāvadeva pabbataṃ nimminitvā nāgarājānaṃ bāhāyaṃ gahetvā tattha pāvisi. Supaṇṇarājā pabbate pahāraṃ datvā palāyi. Mahāthero āha – ‘‘sace, āvuso, buddharakkhito nābhavissa, sabbeva gārayhā assāmā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paccavekkhaṇavasī pana āvajjanavasiyā eva vuttā. Paccavekkhaṇajavanāneva hi tattha āvajjanānantarānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dutiyajjhānakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "79"
      },
      ". Imāsu pana pañcasu vasīsu ciṇṇavasinā paguṇapaṭhamajjhānato vuṭṭhāya ‘‘ayaṃ samāpatti āsannanīvaraṇapaccatthikā, vitakkavicārānaṃ oḷārikattā aṅgadubbalā’’ti ca tattha dosaṃ disvā dutiyajjhānaṃ santato manasikatvā paṭhamajjhāne nikantiṃ pariyādāya dutiyādhigamāya yogo kātabbo. Athassa yadā paṭhamajjhānā vuṭṭhāya satassa sampajānassa jhānaṅgāni paccavekkhato vitakkavicārā oḷārikato upaṭṭhahanti, pītisukhañceva cittekaggatā ca santato upaṭṭhāti, tadāssa oḷārikaṅgaṃ pahānāya santaaṅgapaṭilābhāya ca tadeva ",
      " nimittaṃ ‘‘pathavī pathavī’’ti punappunaṃ manasikaroto ‘‘idāni dutiyajjhānaṃ uppajjissatī’’ti bhavaṅgaṃ upacchinditvā tadeva pathavīkasiṇaṃ ārammaṇaṃ katvā manodvārāvajjanaṃ uppajjati ",
      ". Tato tasmiṃyevārammaṇe cattāri pañca vā javanāni javanti, yesamavasāne ekaṃ rūpāvacaraṃ dutiyajjhānikaṃ. Sesāni vuttappakārāneva kāmāvacarānīti."
    ],
    "innerText": "79. Imāsu pana pañcasu vasīsu ciṇṇavasinā paguṇapaṭhamajjhānato vuṭṭhāya ‘‘ayaṃ samāpatti āsannanīvaraṇapaccatthikā, vitakkavicārānaṃ oḷārikattā aṅgadubbalā’’ti ca tattha dosaṃ disvā dutiyajjhānaṃ santato manasikatvā paṭhamajjhāne nikantiṃ pariyādāya dutiyādhigamāya yogo kātabbo. Athassa yadā paṭhamajjhānā vuṭṭhāya satassa sampajānassa jhānaṅgāni paccavekkhato vitakkavicārā oḷārikato upaṭṭhahanti, pītisukhañceva cittekaggatā ca santato upaṭṭhāti, tadāssa oḷārikaṅgaṃ pahānāya santaaṅgapaṭilābhāya ca tadeva nimittaṃ ‘‘pathavī pathavī’’ti punappunaṃ manasikaroto ‘‘idāni dutiyajjhānaṃ uppajjissatī’’ti bhavaṅgaṃ upacchinditvā tadeva pathavīkasiṇaṃ ārammaṇaṃ katvā manodvārāvajjanaṃ uppajjati . Tato tasmiṃyevārammaṇe cattāri pañca vā javanāni javanti, yesamavasāne ekaṃ rūpāvacaraṃ dutiyajjhānikaṃ. Sesāni vuttappakārāneva kāmāvacarānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettāvatā cesa vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Evamanena dvaṅgavippahīnaṃ tivaṅgasamannāgataṃ tividhakalyāṇaṃ dasalakkhaṇasampannaṃ dutiyaṃ jhānaṃ adhigataṃ hoti pathavīkasiṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "80"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vitakkavicārānaṃ vūpasamā"
      },
      "ti vitakkassa ca vicārassa cāti imesaṃ dvinnaṃ vūpasamā samatikkamā, dutiyajjhānakkhaṇe apātubhāvāti vuttaṃ hoti. Tattha kiñcāpi dutiyajjhāne sabbepi paṭhamajjhānadhammā na santi. Aññeyeva hi paṭhamajjhāne phassādayo, aññe idha. Oḷārikassa pana oḷārikassa aṅgassa samatikkamā paṭhamajjhānato paresaṃ dutiyajjhānādīnaṃ adhigamo hotīti dīpanatthaṃ ‘‘vitakkavicārānaṃ vūpasamā’’ti evaṃ vuttanti veditabbaṃ."
    ],
    "innerText": "80. Tattha vitakkavicārānaṃ vūpasamāti vitakkassa ca vicārassa cāti imesaṃ dvinnaṃ vūpasamā samatikkamā, dutiyajjhānakkhaṇe apātubhāvāti vuttaṃ hoti. Tattha kiñcāpi dutiyajjhāne sabbepi paṭhamajjhānadhammā na santi. Aññeyeva hi paṭhamajjhāne phassādayo, aññe idha. Oḷārikassa pana oḷārikassa aṅgassa samatikkamā paṭhamajjhānato paresaṃ dutiyajjhānādīnaṃ adhigamo hotīti dīpanatthaṃ ‘‘vitakkavicārānaṃ vūpasamā’’ti evaṃ vuttanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhatta"
      },
      "nti idha niyakajjhattamadhippetaṃ. Vibhaṅge pana ‘‘ajjhattaṃ paccatta’’nti ettakameva vuttaṃ. Yasmā ca niyakajjhattamadhippetaṃ, tasmā attani jātaṃ attano santāne nibbattanti ayamettha attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampasādana"
      },
      "nti sampasādanaṃ vuccati saddhā. Sampasādanayogato jhānampi sampasādanaṃ. Nīlavaṇṇayogato nīlavatthaṃ viya. Yasmā vā taṃ jhānaṃ sampasādanasamannāgatattā vitakkavicārakkhobhavūpasamanena ca cetaso sampasādayati, tasmāpi sampasādananti vuttaṃ. Imasmiñca atthavikappe sampasādanaṃ cetasoti evaṃ padasambandho veditabbo. Purimasmiṃ pana atthavikappe cetasoti etaṃ ekodibhāvena saddhiṃ yojetabbaṃ."
    ],
    "innerText": "Ajjhattanti idha niyakajjhattamadhippetaṃ. Vibhaṅge pana ‘‘ajjhattaṃ paccatta’’nti ettakameva vuttaṃ. Yasmā ca niyakajjhattamadhippetaṃ, tasmā attani jātaṃ attano santāne nibbattanti ayamettha attho. Sampasādananti sampasādanaṃ vuccati saddhā. Sampasādanayogato jhānampi sampasādanaṃ. Nīlavaṇṇayogato nīlavatthaṃ viya. Yasmā vā taṃ jhānaṃ sampasādanasamannāgatattā vitakkavicārakkhobhavūpasamanena ca cetaso sampasādayati, tasmāpi sampasādananti vuttaṃ. Imasmiñca atthavikappe sampasādanaṃ cetasoti evaṃ padasambandho veditabbo. Purimasmiṃ pana atthavikappe cetasoti etaṃ ekodibhāvena saddhiṃ yojetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyamatthayojanā, eko udetīti ekodi, vitakkavicārehi anajjhārūḷhattā aggo seṭṭho hutvā udetīti attho. Seṭṭhopi hi loke ekoti vuccati. Vitakkavicāravirahato vā eko asahāyo hutvā itipi vattuṃ vaṭṭati. Atha vā sampayuttadhamme udāyatīti udi, uṭṭhāpetīti ",
      " attho. Seṭṭhaṭṭhena eko ca so udi cāti ekodi, samādhissetaṃ ",
      " adhivacanaṃ. Iti imaṃ ekodiṃ bhāveti vaḍḍhetīti idaṃ dutiyajjhānaṃ ekodibhāvaṃ. So panāyaṃ ekodi yasmā cetaso, na sattassa, na jīvassa, tasmā etaṃ cetaso ekodibhāvanti vuttaṃ."
    ],
    "innerText": "Tatrāyamatthayojanā, eko udetīti ekodi, vitakkavicārehi anajjhārūḷhattā aggo seṭṭho hutvā udetīti attho. Seṭṭhopi hi loke ekoti vuccati. Vitakkavicāravirahato vā eko asahāyo hutvā itipi vattuṃ vaṭṭati. Atha vā sampayuttadhamme udāyatīti udi, uṭṭhāpetīti attho. Seṭṭhaṭṭhena eko ca so udi cāti ekodi, samādhissetaṃ adhivacanaṃ. Iti imaṃ ekodiṃ bhāveti vaḍḍhetīti idaṃ dutiyajjhānaṃ ekodibhāvaṃ. So panāyaṃ ekodi yasmā cetaso, na sattassa, na jīvassa, tasmā etaṃ cetaso ekodibhāvanti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nanu cāyaṃ saddhā paṭhamajjhānepi atthi, ayañca ekodināmako samādhi, atha kasmā idameva ‘‘sampasādanaṃ cetaso ekodibhāvañcā’’ti vuttanti. Vuccate, aduñhi paṭhamajjhānaṃ vitakkavicārakkhobhena vīcitaraṅgasamākulamiva jalaṃ na suppasannaṃ hoti, tasmā satiyāpi saddhāya ‘‘sampasādana’’nti na vuttaṃ. Na suppasannattāyeva cettha samādhipi na suṭṭhu pākaṭo, tasmā ‘‘ekodibhāva’’ntipi na vuttaṃ. Imasmiṃ pana jhāne vitakkavicārapalibodhābhāvena laddhokāsā balavatī saddhā, balavasaddhāsahāyapaṭilābheneva ca samādhipi pākaṭo, tasmā idameva evaṃ vuttanti veditabbaṃ. Vibhaṅge pana ‘‘sampasādananti yā saddhā saddahanā okappanā abhippasādo. Cetaso ekodibhāvanti yā cittassa ṭhiti…pe… sammāsamādhī’’ti ettakameva vuttaṃ. Evaṃ vuttena pana tena saddhiṃ ayamatthavaṇṇanā yathā na virujjhati, aññadatthu saṃsandati ceva sameti ca, evaṃ veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "81"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avitakkaṃ avicāra"
      },
      "nti bhāvanāya pahīnattā etasmiṃ, etassa vā vitakko natthīti avitakkaṃ. Imināva nayena avicāraṃ. Vibhaṅgepi vuttaṃ ‘‘iti ayañca vitakko ayañca vicāro santā honti samitā vūpasantā atthaṅgatā abbhatthaṅgatā appitā byappitā sositā visositā byantikatā, tena vuccati avitakkaṃ avicāra’’nti (vibha. 576)."
    ],
    "innerText": "81.Avitakkaṃ avicāranti bhāvanāya pahīnattā etasmiṃ, etassa vā vitakko natthīti avitakkaṃ. Imināva nayena avicāraṃ. Vibhaṅgepi vuttaṃ ‘‘iti ayañca vitakko ayañca vicāro santā honti samitā vūpasantā atthaṅgatā abbhatthaṅgatā appitā byappitā sositā visositā byantikatā, tena vuccati avitakkaṃ avicāra’’nti (vibha. 576)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Etthāha ‘‘nanu ca ‘vitakkavicārānaṃ vūpasamā’ti imināpi ayamattho siddho, atha kasmā puna vuttaṃ ‘avitakkaṃ avicāra’nti’’. Vuccate, evametaṃ siddhovāyamattho, na panetaṃ tadatthadīpakaṃ. Nanu avocumha ‘‘oḷārikassa pana oḷārikassa aṅgassa samatikkamā paṭhamajjhānato paresaṃ dutiyajjhānādīnaṃ samadhigamo hotīti dassanatthaṃ vitakkavicārānaṃ vūpasamāti evaṃ vutta’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica vitakkavicārānaṃ vūpasamā idaṃ sampasādanaṃ, na kilesakālussiyassa. Vitakkavicārānañca vūpasamā ekodibhāvaṃ, na upacārajjhānamiva nīvaraṇappahānā ",
      ", paṭhamajjhānamiva ",
      " ca na aṅgapātubhāvāti evaṃ sampasādanaekodibhāvānaṃ hetuparidīpakamidaṃ vacanaṃ. Tathā vitakkavicārānaṃ vūpasamā idaṃ avitakkaṃ avicāraṃ, na tatiyacatutthajjhānāni viya cakkhuviññāṇādīni viya ca abhāvāti evaṃ avitakkaavicārabhāvassa hetuparidīpakañca, na vitakkavicārābhāvamattaparidīpakaṃ. Vitakkavicārābhāvamattaparidīpakameva pana ‘‘avitakkaṃ avicāra’’nti idaṃ vacanaṃ. Tasmā purimaṃ vatvāpi vattabbamevāti."
    ],
    "innerText": "Apica vitakkavicārānaṃ vūpasamā idaṃ sampasādanaṃ, na kilesakālussiyassa. Vitakkavicārānañca vūpasamā ekodibhāvaṃ, na upacārajjhānamiva nīvaraṇappahānā , paṭhamajjhānamiva ca na aṅgapātubhāvāti evaṃ sampasādanaekodibhāvānaṃ hetuparidīpakamidaṃ vacanaṃ. Tathā vitakkavicārānaṃ vūpasamā idaṃ avitakkaṃ avicāraṃ, na tatiyacatutthajjhānāni viya cakkhuviññāṇādīni viya ca abhāvāti evaṃ avitakkaavicārabhāvassa hetuparidīpakañca, na vitakkavicārābhāvamattaparidīpakaṃ. Vitakkavicārābhāvamattaparidīpakameva pana ‘‘avitakkaṃ avicāra’’nti idaṃ vacanaṃ. Tasmā purimaṃ vatvāpi vattabbamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādhija"
      },
      "nti paṭhamajjhānasamādhito sampayuttasamādhito vā jātanti attho. Tattha kiñcāpi paṭhamampi sampayuttasamādhito jātaṃ, atha kho ayameva samādhi ‘‘samādhī’’ti vattabbataṃ arahati vitakkavicārakkhobhavirahena ativiya acalattā, suppasannattā ca, tasmā imassa vaṇṇabhaṇanatthaṃ idameva ‘‘samādhija’’nti vuttaṃ. Pītisukhanti idaṃ vuttanayameva."
    ],
    "innerText": "Samādhijanti paṭhamajjhānasamādhito sampayuttasamādhito vā jātanti attho. Tattha kiñcāpi paṭhamampi sampayuttasamādhito jātaṃ, atha kho ayameva samādhi ‘‘samādhī’’ti vattabbataṃ arahati vitakkavicārakkhobhavirahena ativiya acalattā, suppasannattā ca, tasmā imassa vaṇṇabhaṇanatthaṃ idameva ‘‘samādhija’’nti vuttaṃ. Pītisukhanti idaṃ vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dutiya"
      },
      "nti gaṇanānupubbatā dutiyaṃ. Idaṃ dutiyaṃ samāpajjatītipi dutiyaṃ. Yaṃ pana vuttaṃ ‘‘dvaṅgavippahīnaṃ tivaṅgasamannāgata’’nti, tattha vitakkavicārānaṃ pahānavasena dvaṅgavippahīnatā veditabbā. Yathā ca paṭhamajjhānassa upacārakkhaṇe nīvaraṇāni pahīyanti, na tathā imassa vitakkavicārā. Appanākkhaṇeyeva ca panetaṃ vinā tehi uppajjati. Tenassa te ‘‘pahānaṅga’’nti vuccanti. Pīti sukhaṃ cittekaggatāti imesaṃ pana tiṇṇaṃ uppattivasena tivaṅgasamannāgatatā veditabbā. Tasmā yaṃ vibhaṅge ‘‘jhānanti sampasādo pīti sukhaṃ cittassa ekaggatā’’ti (vibha. 580) vuttaṃ, taṃ saparikkhāraṃ jhānaṃ dassetuṃ pariyāyena vuttaṃ. Ṭhapetvā pana sampasādanaṃ nippariyāyena upanijjhānalakkhaṇappattānaṃ aṅgānaṃ vasena tivaṅgikameva etaṃ hoti. Yathāha – ‘‘katamaṃ tasmiṃ samaye tivaṅgikaṃ jhānaṃ hoti, pīti sukhaṃ cittassa ekaggatā’’ti (dha. sa. 161; vibha. 628). Sesaṃ paṭhamajjhāne vuttanayameva."
    ],
    "innerText": "Dutiyanti gaṇanānupubbatā dutiyaṃ. Idaṃ dutiyaṃ samāpajjatītipi dutiyaṃ. Yaṃ pana vuttaṃ ‘‘dvaṅgavippahīnaṃ tivaṅgasamannāgata’’nti, tattha vitakkavicārānaṃ pahānavasena dvaṅgavippahīnatā veditabbā. Yathā ca paṭhamajjhānassa upacārakkhaṇe nīvaraṇāni pahīyanti, na tathā imassa vitakkavicārā. Appanākkhaṇeyeva ca panetaṃ vinā tehi uppajjati. Tenassa te ‘‘pahānaṅga’’nti vuccanti. Pīti sukhaṃ cittekaggatāti imesaṃ pana tiṇṇaṃ uppattivasena tivaṅgasamannāgatatā veditabbā. Tasmā yaṃ vibhaṅge ‘‘jhānanti sampasādo pīti sukhaṃ cittassa ekaggatā’’ti (vibha. 580) vuttaṃ, taṃ saparikkhāraṃ jhānaṃ dassetuṃ pariyāyena vuttaṃ. Ṭhapetvā pana sampasādanaṃ nippariyāyena upanijjhānalakkhaṇappattānaṃ aṅgānaṃ vasena tivaṅgikameva etaṃ hoti. Yathāha – ‘‘katamaṃ tasmiṃ samaye tivaṅgikaṃ jhānaṃ hoti, pīti sukhaṃ cittassa ekaggatā’’ti (dha. sa. 161; vibha. 628). Sesaṃ paṭhamajjhāne vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Tatiyajjhānakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "82"
      },
      ". Evamadhigate pana tasmimpi vuttanayeneva pañcahākārehi ciṇṇavasinā hutvā paguṇadutiyajjhānato vuṭṭhāya ‘‘ayaṃ samāpatti āsannavitakkavicārapaccatthikā, ‘yadeva tattha pītigataṃ cetaso uppilāvitaṃ, etenetaṃ ",
      " oḷārikaṃ akkhāyatī’ti (dī. ni. 1.96) vuttāya pītiyā oḷārikattā aṅgadubbalā’’ti ca tattha dosaṃ disvā tatiyajjhānaṃ santato manasikaritvā ",
      " dutiyajjhāne nikantiṃ pariyādāya tatiyādhigamāya yogo kātabbo. Athassa yadā dutiyajjhānato vuṭṭhāya satassa sampajānassa jhānaṅgāni paccavekkhato pīti oḷārikato upaṭṭhāti, sukhañceva ekaggatā ca santato upaṭṭhāti. Tadāssa oḷārikaṅgappahānāya santaaṅgapaṭilābhāya ca tadeva nimittaṃ ‘‘pathavī pathavī’’ti punappunaṃ manasikaroto ‘‘idāni tatiyajjhānaṃ uppajjissatī’’ti bhavaṅgaṃ upacchinditvā tadeva pathavīkasiṇaṃ ārammaṇaṃ katvā manodvārāvajjanaṃ uppajjati. Tato tasmiṃyevārammaṇe cattāri pañca vā javanāni javanti, yesaṃ avasāne ekaṃ rūpāvacaraṃ tatiyajjhānikaṃ, sesāni vuttanayeneva kāmāvacarānīti. Ettāvatā ca panesa pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti upekkhako satimā sukhavihārīti, tatiyaṃ jhānaṃ upasampajja viharatīti (dī. ni. 1.230; dha. sa. 163). Evamanena ekaṅgavippahīnaṃ duvaṅgasamannāgataṃ tividhakalyāṇaṃ dasalakkhaṇasampannaṃ tatiyaṃ jhānaṃ adhigataṃ hoti pathavīkasiṇaṃ."
    ],
    "innerText": "82. Evamadhigate pana tasmimpi vuttanayeneva pañcahākārehi ciṇṇavasinā hutvā paguṇadutiyajjhānato vuṭṭhāya ‘‘ayaṃ samāpatti āsannavitakkavicārapaccatthikā, ‘yadeva tattha pītigataṃ cetaso uppilāvitaṃ, etenetaṃ oḷārikaṃ akkhāyatī’ti (dī. ni. 1.96) vuttāya pītiyā oḷārikattā aṅgadubbalā’’ti ca tattha dosaṃ disvā tatiyajjhānaṃ santato manasikaritvā dutiyajjhāne nikantiṃ pariyādāya tatiyādhigamāya yogo kātabbo. Athassa yadā dutiyajjhānato vuṭṭhāya satassa sampajānassa jhānaṅgāni paccavekkhato pīti oḷārikato upaṭṭhāti, sukhañceva ekaggatā ca santato upaṭṭhāti. Tadāssa oḷārikaṅgappahānāya santaaṅgapaṭilābhāya ca tadeva nimittaṃ ‘‘pathavī pathavī’’ti punappunaṃ manasikaroto ‘‘idāni tatiyajjhānaṃ uppajjissatī’’ti bhavaṅgaṃ upacchinditvā tadeva pathavīkasiṇaṃ ārammaṇaṃ katvā manodvārāvajjanaṃ uppajjati. Tato tasmiṃyevārammaṇe cattāri pañca vā javanāni javanti, yesaṃ avasāne ekaṃ rūpāvacaraṃ tatiyajjhānikaṃ, sesāni vuttanayeneva kāmāvacarānīti. Ettāvatā ca panesa pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti upekkhako satimā sukhavihārīti, tatiyaṃ jhānaṃ upasampajja viharatīti (dī. ni. 1.230; dha. sa. 163). Evamanena ekaṅgavippahīnaṃ duvaṅgasamannāgataṃ tividhakalyāṇaṃ dasalakkhaṇasampannaṃ tatiyaṃ jhānaṃ adhigataṃ hoti pathavīkasiṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "83"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pītiyā ca virāgā"
      },
      "ti virāgo nāma vuttappakārāya pītiyā jigucchanaṃ vā samatikkamo vā. Ubhinnaṃ pana antarā casaddo sampiṇḍanattho, so vūpasamaṃ vā sampiṇḍeti vitakkavicārānaṃ vūpasamaṃ vā. Tattha yadā vūpasamameva sampiṇḍeti, tadā ‘‘pītiyā ca virāgā kiñca bhiyyo vūpasamā cā’’ti evaṃ yojanā veditabbā. Imissā ca yojanāya virāgo jigucchanattho hoti, tasmā ‘‘pītiyā jigucchanā ca vūpasamā cā’’ti ayamattho daṭṭhabbo. Yadā pana vitakkavicāravūpasamaṃ sampiṇḍeti, tadā ‘‘pītiyā ca virāgā, kiñca bhiyyo vitakkavicārānañca vūpasamā’’ti evaṃ yojanā veditabbā. Imissā ca yojanāya virāgo samatikkamanattho hoti, tasmā ‘‘pītiyā ca samatikkamā vitakkavicārānañca vūpasamā’’ti ayamattho daṭṭhabbo."
    ],
    "innerText": "83. Tattha pītiyā ca virāgāti virāgo nāma vuttappakārāya pītiyā jigucchanaṃ vā samatikkamo vā. Ubhinnaṃ pana antarā casaddo sampiṇḍanattho, so vūpasamaṃ vā sampiṇḍeti vitakkavicārānaṃ vūpasamaṃ vā. Tattha yadā vūpasamameva sampiṇḍeti, tadā ‘‘pītiyā ca virāgā kiñca bhiyyo vūpasamā cā’’ti evaṃ yojanā veditabbā. Imissā ca yojanāya virāgo jigucchanattho hoti, tasmā ‘‘pītiyā jigucchanā ca vūpasamā cā’’ti ayamattho daṭṭhabbo. Yadā pana vitakkavicāravūpasamaṃ sampiṇḍeti, tadā ‘‘pītiyā ca virāgā, kiñca bhiyyo vitakkavicārānañca vūpasamā’’ti evaṃ yojanā veditabbā. Imissā ca yojanāya virāgo samatikkamanattho hoti, tasmā ‘‘pītiyā ca samatikkamā vitakkavicārānañca vūpasamā’’ti ayamattho daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kāmañcete vitakkavicārā dutiyajjhāneyeva vūpasantā, imassa pana jhānassa maggaparidīpanatthaṃ vaṇṇabhaṇanatthañcetaṃ vuttaṃ. Vitakkavicārānañca vūpasamāti hi vutte idaṃ paññāyati, nūna vitakkavicāravūpasamo maggo imassa ",
      " jhānassāti. Yathā ca tatiye ariyamagge appahīnānampi sakkāyadiṭṭhādīnaṃ ‘‘pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ pahānā’’ti (dī. ni. 1.373; ma. ni. 2.133; saṃ. ni. 5.184; a. ni. 3.88) evaṃ ",
      " pahānaṃ vuccamānaṃ vaṇṇabhaṇanaṃ hoti, tadadhigamāya ussukkānaṃ ussāhajanakaṃ, evameva idha avūpasantānampi vitakkavicārānaṃ vūpasamo vuccamāno vaṇṇabhaṇanaṃ hoti. Tenāyamattho vutto ‘‘pītiyā ca samatikkamā vitakkavicārānañca vūpasamā’’ti."
    ],
    "innerText": "Kāmañcete vitakkavicārā dutiyajjhāneyeva vūpasantā, imassa pana jhānassa maggaparidīpanatthaṃ vaṇṇabhaṇanatthañcetaṃ vuttaṃ. Vitakkavicārānañca vūpasamāti hi vutte idaṃ paññāyati, nūna vitakkavicāravūpasamo maggo imassa jhānassāti. Yathā ca tatiye ariyamagge appahīnānampi sakkāyadiṭṭhādīnaṃ ‘‘pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ pahānā’’ti (dī. ni. 1.373; ma. ni. 2.133; saṃ. ni. 5.184; a. ni. 3.88) evaṃ pahānaṃ vuccamānaṃ vaṇṇabhaṇanaṃ hoti, tadadhigamāya ussukkānaṃ ussāhajanakaṃ, evameva idha avūpasantānampi vitakkavicārānaṃ vūpasamo vuccamāno vaṇṇabhaṇanaṃ hoti. Tenāyamattho vutto ‘‘pītiyā ca samatikkamā vitakkavicārānañca vūpasamā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "84"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upekkhako ca viharatī"
      },
      "ti ettha upapattito ikkhatīti upekkhā. Samaṃ passati, apakkhapatitā hutvā passatīti attho. Tāya visadāya vipulāya thāmagatāya samannāgatattā tatiyajjhānasamaṅgī upekkhakoti vuccati."
    ],
    "innerText": "84.Upekkhako ca viharatīti ettha upapattito ikkhatīti upekkhā. Samaṃ passati, apakkhapatitā hutvā passatīti attho. Tāya visadāya vipulāya thāmagatāya samannāgatattā tatiyajjhānasamaṅgī upekkhakoti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Upekkhā pana dasavidhā hoti chaḷaṅgupekkhā, brahmavihārupekkhā, bojjhaṅgupekkhā, vīriyupekkhā, saṅkhārupekkhā, vedanupekkhā, vipassanupekkhā, tatramajjhattupekkhā, jhānupekkhā, pārisuddhupekkhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yā ‘‘idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā neva sumano hoti, na dummano, upekkhako ca viharati sato sampajāno’’ti (a. ni. 6.1) evamāgatā khīṇāsavassa chasu dvāresu iṭṭhāniṭṭhachaḷārammaṇāpāthe parisuddhapakatibhāvāvijahanākārabhūtā upekkhā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chaḷaṅgupekkhā"
      },
      " nāma."
    ],
    "innerText": "Tattha yā ‘‘idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā neva sumano hoti, na dummano, upekkhako ca viharati sato sampajāno’’ti (a. ni. 6.1) evamāgatā khīṇāsavassa chasu dvāresu iṭṭhāniṭṭhachaḷārammaṇāpāthe parisuddhapakatibhāvāvijahanākārabhūtā upekkhā, ayaṃ chaḷaṅgupekkhā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yā pana ‘‘upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharatī’’ti (dī. ni. 1.556; ma. ni. 1.77) evamāgatā sattesu majjhattākārabhūtā upekkhā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmavihārupekkhā"
      },
      " nāma."
    ],
    "innerText": "Yā pana ‘‘upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharatī’’ti (dī. ni. 1.556; ma. ni. 1.77) evamāgatā sattesu majjhattākārabhūtā upekkhā, ayaṃ brahmavihārupekkhā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yā ‘‘upekkhāsambojjhaṅgaṃ bhāveti vivekanissita’’nti (ma. ni. 1.27) evamāgatā sahajātadhammānaṃ majjhattākārabhūtā upekkhā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bojjhaṅgupekkhā"
      },
      " nāma."
    ],
    "innerText": "Yā ‘‘upekkhāsambojjhaṅgaṃ bhāveti vivekanissita’’nti (ma. ni. 1.27) evamāgatā sahajātadhammānaṃ majjhattākārabhūtā upekkhā, ayaṃ bojjhaṅgupekkhā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yā ",
      " pana ‘‘kālenakālaṃ upekkhānimittaṃ manasikarotī’’ti (a. ni. 3.103) evamāgatā anaccāraddhanātisithilavīriyasaṅkhātā upekkhā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vīriyupekkhā"
      },
      " nāma."
    ],
    "innerText": "Yā pana ‘‘kālenakālaṃ upekkhānimittaṃ manasikarotī’’ti (a. ni. 3.103) evamāgatā anaccāraddhanātisithilavīriyasaṅkhātā upekkhā, ayaṃ vīriyupekkhā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yā ‘‘kati saṅkhārupekkhā samathavasena uppajjanti, kati saṅkhārupekkhā vipassanāvasena uppajjanti ",
      ". Aṭṭha saṅkhārupekkhā samathavasena uppajjanti. Dasa saṅkhārupekkhā vipassanāvasena uppajjantī’’ti (paṭi. ma. 1.57) evamāgatā nīvaraṇādipaṭisaṅkhāsantiṭṭhanā gahaṇe majjhattabhūtā upekkhā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅkhārupekkhā"
      },
      " nāma."
    ],
    "innerText": "Yā ‘‘kati saṅkhārupekkhā samathavasena uppajjanti, kati saṅkhārupekkhā vipassanāvasena uppajjanti . Aṭṭha saṅkhārupekkhā samathavasena uppajjanti. Dasa saṅkhārupekkhā vipassanāvasena uppajjantī’’ti (paṭi. ma. 1.57) evamāgatā nīvaraṇādipaṭisaṅkhāsantiṭṭhanā gahaṇe majjhattabhūtā upekkhā, ayaṃ saṅkhārupekkhā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yā pana ‘‘yasmiṃ samaye kāmāvacaraṃ kusalaṃ cittaṃ uppannaṃ hoti upekkhāsahagata’’nti (dha. sa. 150) evamāgatā adukkhamasukhasaññitā upekkhā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedanupekkhā"
      },
      " nāma."
    ],
    "innerText": "Yā pana ‘‘yasmiṃ samaye kāmāvacaraṃ kusalaṃ cittaṃ uppannaṃ hoti upekkhāsahagata’’nti (dha. sa. 150) evamāgatā adukkhamasukhasaññitā upekkhā, ayaṃ vedanupekkhā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yā ‘‘yadatthi yaṃ bhūtaṃ, taṃ pajahati, upekkhaṃ paṭilabhatī’’ti (ma. ni. 3.71; a. ni. 7.55) evamāgatā vicinane majjhattabhūtā upekkhā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipassanupekkhā"
      },
      " nāma."
    ],
    "innerText": "Yā ‘‘yadatthi yaṃ bhūtaṃ, taṃ pajahati, upekkhaṃ paṭilabhatī’’ti (ma. ni. 3.71; a. ni. 7.55) evamāgatā vicinane majjhattabhūtā upekkhā, ayaṃ vipassanupekkhā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yā pana chandādīsu yevāpanakesu āgatā sahajātānaṃ samavāhitabhūtā upekkhā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatramajjhattupekkhā"
      },
      " nāma."
    ],
    "innerText": "Yā pana chandādīsu yevāpanakesu āgatā sahajātānaṃ samavāhitabhūtā upekkhā, ayaṃ tatramajjhattupekkhā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yā ‘‘upekkhako ca viharatī’’ti (dī. ni. 1.230; dha. sa. 163) evamāgatā aggasukhepi tasmiṃ apakkhapātajananī upekkhā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānupekkhā"
      },
      " nāma."
    ],
    "innerText": "Yā ‘‘upekkhako ca viharatī’’ti (dī. ni. 1.230; dha. sa. 163) evamāgatā aggasukhepi tasmiṃ apakkhapātajananī upekkhā, ayaṃ jhānupekkhā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yā pana ‘‘upekkhāsatipārisuddhiṃ catutthaṃ jhāna’’nti (dī. ni. 1.232; dha. sa. 165) evamāgatā sabbapaccanīkaparisuddhā paccanīkavūpasamanepi abyāpārabhūtā upekkhā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pārisuddhupekkhā"
      },
      " nāma."
    ],
    "innerText": "Yā pana ‘‘upekkhāsatipārisuddhiṃ catutthaṃ jhāna’’nti (dī. ni. 1.232; dha. sa. 165) evamāgatā sabbapaccanīkaparisuddhā paccanīkavūpasamanepi abyāpārabhūtā upekkhā, ayaṃ pārisuddhupekkhā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatra chaḷaṅgupekkhā ca brahmavihārupekkhā ca bojjhaṅgupekkhā ca tatramajjhattupekkhā ca jhānupekkhā ca pārisuddhupekkhā ca atthato ekā, tatramajjhattupekkhāva hoti. Tena tena avatthābhedena panassā ayaṃ bhedo. Ekassāpi sato sattassa kumārayuvatherasenāpatirājādivasena bhedo viya. Tasmā tāsu yattha chaḷaṅgupekkhā, na tattha bojjhaṅgupekkhādayo. Yattha vā pana bojjhaṅgupekkhā, na tattha chaḷaṅgupekkhādayo hontīti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā ",
      " cetāsamatthato ekībhāvo, evaṃ saṅkhārupekkhā vipassanupekkhānampi. Paññā eva hi sā kiccavasena dvidhā bhinnā. Yathā hi purisassa sāyaṃ gehaṃ paviṭṭhaṃ sappaṃ ajapadadaṇḍaṃ gahetvā ",
      " pariyesamānassa taṃ thusakoṭṭhake nipannaṃ disvā ‘‘sappo nu kho, no’’ti avalokentassa sovattikattayaṃ disvā nibbematikassa ‘‘sappo, na sappo’’ti vicinane majjhattatā hoti, evameva yā āraddhavipassakassa vipassanāñāṇena lakkhaṇattaye diṭṭhe saṅkhārānaṃ aniccabhāvādivicinane majjhattatā uppajjati, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipassanupekkhā"
      },
      " nāma. Yathā pana tassa purisassa ajapadadaṇḍena gāḷhaṃ sappaṃ gahetvā ‘‘kiṃ tāhaṃ imaṃ sappaṃ aviheṭhento attānañca iminā aḍaṃsāpento muñceyya’’nti muñcanākārameva pariyesato gahaṇe majjhattatā hoti. Evameva yā lakkhaṇattayassa diṭṭhattā āditte viya tayo bhave passato saṅkhāraggahaṇe majjhattatā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅkhārupekkhā"
      },
      " nāma. Iti vipassanupekkhāya siddhāya saṅkhārupekkhāpi siddhāva hoti. Iminā panesā vicinanaggahaṇesu majjhattasaṅkhātena kiccena dvidhā bhinnāti. Vīriyupekkhā pana vedanupekkhā ca aññamaññañca avasesāhi ca atthato bhinnā evāti."
    ],
    "innerText": "Yathā cetāsamatthato ekībhāvo, evaṃ saṅkhārupekkhā vipassanupekkhānampi. Paññā eva hi sā kiccavasena dvidhā bhinnā. Yathā hi purisassa sāyaṃ gehaṃ paviṭṭhaṃ sappaṃ ajapadadaṇḍaṃ gahetvā pariyesamānassa taṃ thusakoṭṭhake nipannaṃ disvā ‘‘sappo nu kho, no’’ti avalokentassa sovattikattayaṃ disvā nibbematikassa ‘‘sappo, na sappo’’ti vicinane majjhattatā hoti, evameva yā āraddhavipassakassa vipassanāñāṇena lakkhaṇattaye diṭṭhe saṅkhārānaṃ aniccabhāvādivicinane majjhattatā uppajjati, ayaṃ vipassanupekkhā nāma. Yathā pana tassa purisassa ajapadadaṇḍena gāḷhaṃ sappaṃ gahetvā ‘‘kiṃ tāhaṃ imaṃ sappaṃ aviheṭhento attānañca iminā aḍaṃsāpento muñceyya’’nti muñcanākārameva pariyesato gahaṇe majjhattatā hoti. Evameva yā lakkhaṇattayassa diṭṭhattā āditte viya tayo bhave passato saṅkhāraggahaṇe majjhattatā, ayaṃ saṅkhārupekkhā nāma. Iti vipassanupekkhāya siddhāya saṅkhārupekkhāpi siddhāva hoti. Iminā panesā vicinanaggahaṇesu majjhattasaṅkhātena kiccena dvidhā bhinnāti. Vīriyupekkhā pana vedanupekkhā ca aññamaññañca avasesāhi ca atthato bhinnā evāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iti imāsu upekkhāsu jhānupekkhā idhādhippetā. Sā majjhattalakkhaṇā, anābhogarasā, abyāpārapaccupaṭṭhānā, pītivirāgapadaṭṭhānāti. Etthāha, nanu cāyamatthato tatramajjhattupekkhāva hoti, sā ca paṭhamadutiyajjhānesupi atthi. Tasmā tatrāpi upekkhako ca viharatīti evamayaṃ vattabbā siyā, sā kasmā na vuttāti. Aparibyattakiccato. Aparibyattañhi tassā tattha kiccaṃ vitakkādīhi abhibhūtattā. Idha panāyaṃ vitakkavicārapītīhi anabhibhūtattā ukkhittasirā viya hutvā paribyattakiccā jātā, tasmā vuttāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niṭṭhitā upekkhako ca viharatīti etassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sabbaso atthavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "85"
      },
      ". Idāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sato ca sampajāno"
      },
      "ti ettha saratīti sato. Sampajānātīti sampajāno. Puggalena sati ca sampajaññañca vuttaṃ. Tattha saraṇalakkhaṇā sati, asammussanarasā, ārakkhapaccupaṭṭhānā. Asammohalakkhaṇaṃ sampajaññaṃ, tīraṇarasaṃ, pavicayapaccupaṭṭhānaṃ."
    ],
    "innerText": "85. Idāni sato ca sampajānoti ettha saratīti sato. Sampajānātīti sampajāno. Puggalena sati ca sampajaññañca vuttaṃ. Tattha saraṇalakkhaṇā sati, asammussanarasā, ārakkhapaccupaṭṭhānā. Asammohalakkhaṇaṃ sampajaññaṃ, tīraṇarasaṃ, pavicayapaccupaṭṭhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " kiñcāpi idaṃ satisampajaññaṃ purimajjhānesupi atthi. Muṭṭhasatissa hi asampajānassa upacāramattampi na sampajjati, pageva appanā. Oḷārikattā pana tesaṃ jhānānaṃ bhūmiyaṃ viya purisassa cittassa gati sukhā hoti, abyattaṃ tattha satisampajaññakiccaṃ. Oḷārikaṅgappahānena pana sukhumattā imassa jhānassa purisassa khuradhārāyaṃ viya satisampajaññakiccapariggahitā ",
      " eva cittassa gati icchitabbāti idheva vuttaṃ. Kiñca bhiyyo, yathā dhenupago vaccho dhenuto apanīto arakkhiyamāno punadeva dhenuṃ upagacchati, evamidaṃ tatiyajjhānasukhaṃ pītito apanītaṃ, taṃ satisampajaññārakkhena arakkhiyamānaṃ punadeva pītiṃ upagaccheyya, pītisampayuttameva siyā. Sukhe vāpi sattā sārajjanti, idañca atimadhuraṃ sukhaṃ, tato paraṃ sukhābhāvā. Satisampajaññānubhāvena panettha sukhe asārajjanā hoti, no aññathāti imampi atthavisesaṃ dassetuṃ idamidheva vuttanti veditabbaṃ."
    ],
    "innerText": "Tattha kiñcāpi idaṃ satisampajaññaṃ purimajjhānesupi atthi. Muṭṭhasatissa hi asampajānassa upacāramattampi na sampajjati, pageva appanā. Oḷārikattā pana tesaṃ jhānānaṃ bhūmiyaṃ viya purisassa cittassa gati sukhā hoti, abyattaṃ tattha satisampajaññakiccaṃ. Oḷārikaṅgappahānena pana sukhumattā imassa jhānassa purisassa khuradhārāyaṃ viya satisampajaññakiccapariggahitā eva cittassa gati icchitabbāti idheva vuttaṃ. Kiñca bhiyyo, yathā dhenupago vaccho dhenuto apanīto arakkhiyamāno punadeva dhenuṃ upagacchati, evamidaṃ tatiyajjhānasukhaṃ pītito apanītaṃ, taṃ satisampajaññārakkhena arakkhiyamānaṃ punadeva pītiṃ upagaccheyya, pītisampayuttameva siyā. Sukhe vāpi sattā sārajjanti, idañca atimadhuraṃ sukhaṃ, tato paraṃ sukhābhāvā. Satisampajaññānubhāvena panettha sukhe asārajjanā hoti, no aññathāti imampi atthavisesaṃ dassetuṃ idamidheva vuttanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhañca kāyena paṭisaṃvedetī"
      },
      "ti ettha kiñcāpi tatiyajjhānasamaṅgino sukhapaṭisaṃvedanābhogo natthi. Evaṃ santepi yasmā tassa nāmakāyena sampayuttaṃ sukhaṃ. Yaṃ vā taṃ nāmakāyasampayuttaṃ sukhaṃ, taṃsamuṭṭhānenassa yasmā atipaṇītena rūpena rūpakāyo phuṭo, yassa phuṭattā jhānā vuṭṭhitopi sukhaṃ paṭisaṃvedeyya. Tasmā etamatthaṃ dassento sukhañca kāyena paṭisaṃvedetīti āha."
    ],
    "innerText": "Idāni sukhañca kāyena paṭisaṃvedetīti ettha kiñcāpi tatiyajjhānasamaṅgino sukhapaṭisaṃvedanābhogo natthi. Evaṃ santepi yasmā tassa nāmakāyena sampayuttaṃ sukhaṃ. Yaṃ vā taṃ nāmakāyasampayuttaṃ sukhaṃ, taṃsamuṭṭhānenassa yasmā atipaṇītena rūpena rūpakāyo phuṭo, yassa phuṭattā jhānā vuṭṭhitopi sukhaṃ paṭisaṃvedeyya. Tasmā etamatthaṃ dassento sukhañca kāyena paṭisaṃvedetīti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "86"
      },
      ". Idāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yaṃ taṃ ariyā ācikkhanti upekkhako satimā sukhavihārī"
      },
      "ti ettha yaṃjhānahetu yaṃjhānakāraṇā taṃ tatiyajjhānasamaṅgipuggalaṃ buddhādayo ariyā ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti uttānīkaronti pakāsenti, pasaṃsantīti adhippāyo. Kinti? Upekkhako satimā sukhavihārīti. Taṃ tatiyaṃ jhānaṃ upasampajja viharatīti evamettha yojanā veditabbā."
    ],
    "innerText": "86. Idāni yaṃ taṃ ariyā ācikkhanti upekkhako satimā sukhavihārīti ettha yaṃjhānahetu yaṃjhānakāraṇā taṃ tatiyajjhānasamaṅgipuggalaṃ buddhādayo ariyā ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti uttānīkaronti pakāsenti, pasaṃsantīti adhippāyo. Kinti? Upekkhako satimā sukhavihārīti. Taṃ tatiyaṃ jhānaṃ upasampajja viharatīti evamettha yojanā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kasmā pana taṃ te evaṃ pasaṃsantīti? Pasaṃsārahato. Ayañhi yasmā atimadhurasukhe sukhapāramippattepi tatiyajjhāne upekkhako, na tattha sukhābhisaṅgena ākaḍḍhiyati. Yathā ca pīti na uppajjati, evaṃ upaṭṭhitasatitāya satimā. Yasmā ca ariyakantaṃ ariyajanasevitameva ca asaṃkiliṭṭhaṃ sukhaṃ nāmakāyena paṭisaṃvedeti, tasmā pasaṃsāraho hoti ",
      ". Iti pasaṃsārahato naṃ ariyā te evaṃ pasaṃsāhetubhūte guṇe pakāsento ‘‘upekkhako satimā sukhavihārī’’ti evaṃ pasaṃsantīti veditabbaṃ."
    ],
    "innerText": "Kasmā pana taṃ te evaṃ pasaṃsantīti? Pasaṃsārahato. Ayañhi yasmā atimadhurasukhe sukhapāramippattepi tatiyajjhāne upekkhako, na tattha sukhābhisaṅgena ākaḍḍhiyati. Yathā ca pīti na uppajjati, evaṃ upaṭṭhitasatitāya satimā. Yasmā ca ariyakantaṃ ariyajanasevitameva ca asaṃkiliṭṭhaṃ sukhaṃ nāmakāyena paṭisaṃvedeti, tasmā pasaṃsāraho hoti . Iti pasaṃsārahato naṃ ariyā te evaṃ pasaṃsāhetubhūte guṇe pakāsento ‘‘upekkhako satimā sukhavihārī’’ti evaṃ pasaṃsantīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatiyanti gaṇanānupubbatā tatiyaṃ, idaṃ tatiyaṃ samāpajjatītipi tatiyaṃ. Yaṃ pana vuttaṃ ‘‘ekaṅgavippahīnaṃ duvaṅgasamannāgata’’nti, ettha pītiyā pahānavasena ekaṅgavippahīnatā veditabbā ",
      ". Sā panesā dutiyajjhānassa vitakkavicārā viya appanākkhaṇeyeva pahīyati. Tena nassa sā pahānaṅganti vuccati. Sukhaṃ cittekaggatāti imesaṃ pana dvinnaṃ uppattivasena duvaṅgasamannāgatatā veditabbā. Tasmā yaṃ vibhaṅge ‘‘jhānanti upekkhā sati sampajaññaṃ sukhaṃ cittassekaggatā’’ti (vibha. 591) vuttaṃ, taṃ saparikkhāraṃ jhānaṃ dassetuṃ pariyāyena vuttaṃ. Ṭhapetvā pana upekkhāsatisampajaññāni nippariyāyena upanijjhānalakkhaṇappattānaṃ aṅgānaṃ vasena duvaṅgikamevetaṃ hoti. Yathāha – ‘‘katamaṃ tasmiṃ samaye duvaṅgikaṃ jhānaṃ hoti, sukhaṃ cittassekaggatā’’ti (dha. sa. 163; vibha. 624). Sesaṃ paṭhamajjhāne vuttanayameva."
    ],
    "innerText": "Tatiyanti gaṇanānupubbatā tatiyaṃ, idaṃ tatiyaṃ samāpajjatītipi tatiyaṃ. Yaṃ pana vuttaṃ ‘‘ekaṅgavippahīnaṃ duvaṅgasamannāgata’’nti, ettha pītiyā pahānavasena ekaṅgavippahīnatā veditabbā . Sā panesā dutiyajjhānassa vitakkavicārā viya appanākkhaṇeyeva pahīyati. Tena nassa sā pahānaṅganti vuccati. Sukhaṃ cittekaggatāti imesaṃ pana dvinnaṃ uppattivasena duvaṅgasamannāgatatā veditabbā. Tasmā yaṃ vibhaṅge ‘‘jhānanti upekkhā sati sampajaññaṃ sukhaṃ cittassekaggatā’’ti (vibha. 591) vuttaṃ, taṃ saparikkhāraṃ jhānaṃ dassetuṃ pariyāyena vuttaṃ. Ṭhapetvā pana upekkhāsatisampajaññāni nippariyāyena upanijjhānalakkhaṇappattānaṃ aṅgānaṃ vasena duvaṅgikamevetaṃ hoti. Yathāha – ‘‘katamaṃ tasmiṃ samaye duvaṅgikaṃ jhānaṃ hoti, sukhaṃ cittassekaggatā’’ti (dha. sa. 163; vibha. 624). Sesaṃ paṭhamajjhāne vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Catutthajjhānakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "87"
      },
      ". Evamadhigate pana tasmiṃpi vuttanayeneva pañcahākārehi ciṇṇavasinā hutvā paguṇatatiyajjhānato vuṭṭhāya ‘‘ayaṃ samāpatti āsannapītipaccatthikā, ‘yadeva tattha sukhamiti cetaso ābhogo, etenetaṃ oḷārikaṃ akkhāyatī’ti (dī. ni. 1.96) evaṃ vuttassa sukhassa oḷārikattā aṅgadubbalā’’ti ca tattha dosaṃ disvā catutthaṃ jhānaṃ santato manasikatvā tatiyajjhāne nikantiṃ pariyādāya catutthādhigamāya yogo kātabbo. Athassa yadā tatiyajjhānato vuṭṭhāya satassa sampajānassa jhānaṅgāni paccavekkhato cetasikasomanassasaṅkhātaṃ sukhaṃ oḷārikato upaṭṭhāti, upekkhāvedanā ceva cittekaggatā ca santato upaṭṭhāti, tadāssa oḷārikaṅgappahānāya santaaṅgapaṭilābhāya ca tadeva nimittaṃ ‘‘pathavī pathavī’’ti punappunaṃ manasikaroto ‘‘idāni catutthaṃ jhānaṃ uppajjissatī’’ti bhavaṅgaṃ upacchinditvā tadeva pathavīkasiṇaṃ ārammaṇaṃ katvā manodvārāvajjanaṃ uppajjati. Tato tasmiṃyevārammaṇe cattāri pañca vā javanāni uppajjanti ",
      ", yesaṃ avasāne ekaṃ rūpāvacaraṃ catutthajjhānikaṃ, sesāni vuttappakārāneva kāmāvacarāni. Ayaṃ pana viseso, yasmā sukhavedanā adukkhamasukhāya vedanāya āsevanapaccayena paccayo na hoti, catutthajjhāne ca adukkhamasukhāya vedanāya uppajjitabbaṃ, tasmā tāni upekkhāvedanāsampayuttāni honti. Upekkhāsampayuttattāyeva cettha pītipi parihāyatīti. Ettāvatā cesa sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati (dī. ni. 1.232; dha. sa. 165). Evamanena ekaṅgavippahīnaṃ duvaṅgasamannāgataṃ tividhakalyāṇaṃ dasalakkhaṇasampannaṃ catutthaṃ jhānaṃ adhigataṃ hoti pathavīkasiṇaṃ."
    ],
    "innerText": "87. Evamadhigate pana tasmiṃpi vuttanayeneva pañcahākārehi ciṇṇavasinā hutvā paguṇatatiyajjhānato vuṭṭhāya ‘‘ayaṃ samāpatti āsannapītipaccatthikā, ‘yadeva tattha sukhamiti cetaso ābhogo, etenetaṃ oḷārikaṃ akkhāyatī’ti (dī. ni. 1.96) evaṃ vuttassa sukhassa oḷārikattā aṅgadubbalā’’ti ca tattha dosaṃ disvā catutthaṃ jhānaṃ santato manasikatvā tatiyajjhāne nikantiṃ pariyādāya catutthādhigamāya yogo kātabbo. Athassa yadā tatiyajjhānato vuṭṭhāya satassa sampajānassa jhānaṅgāni paccavekkhato cetasikasomanassasaṅkhātaṃ sukhaṃ oḷārikato upaṭṭhāti, upekkhāvedanā ceva cittekaggatā ca santato upaṭṭhāti, tadāssa oḷārikaṅgappahānāya santaaṅgapaṭilābhāya ca tadeva nimittaṃ ‘‘pathavī pathavī’’ti punappunaṃ manasikaroto ‘‘idāni catutthaṃ jhānaṃ uppajjissatī’’ti bhavaṅgaṃ upacchinditvā tadeva pathavīkasiṇaṃ ārammaṇaṃ katvā manodvārāvajjanaṃ uppajjati. Tato tasmiṃyevārammaṇe cattāri pañca vā javanāni uppajjanti , yesaṃ avasāne ekaṃ rūpāvacaraṃ catutthajjhānikaṃ, sesāni vuttappakārāneva kāmāvacarāni. Ayaṃ pana viseso, yasmā sukhavedanā adukkhamasukhāya vedanāya āsevanapaccayena paccayo na hoti, catutthajjhāne ca adukkhamasukhāya vedanāya uppajjitabbaṃ, tasmā tāni upekkhāvedanāsampayuttāni honti. Upekkhāsampayuttattāyeva cettha pītipi parihāyatīti. Ettāvatā cesa sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati (dī. ni. 1.232; dha. sa. 165). Evamanena ekaṅgavippahīnaṃ duvaṅgasamannāgataṃ tividhakalyāṇaṃ dasalakkhaṇasampannaṃ catutthaṃ jhānaṃ adhigataṃ hoti pathavīkasiṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "88"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhassa ca pahānā dukkhassa ca pahānā"
      },
      "ti kāyikasukhassa ca kāyikadukkhassa ca pahānā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbevā"
      },
      "ti tañca kho pubbeva, na catutthajjhānakkhaṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Somanassadomanassānaṃ atthaṅgamā"
      },
      "ti cetasikasukhassa ca cetasikadukkhassa cāti imesampi dvinnaṃ pubbeva atthaṅgamā, pahānā icceva vuttaṃ hoti."
    ],
    "innerText": "88. Tattha sukhassa ca pahānā dukkhassa ca pahānāti kāyikasukhassa ca kāyikadukkhassa ca pahānā. Pubbevāti tañca kho pubbeva, na catutthajjhānakkhaṇe. Somanassadomanassānaṃ atthaṅgamāti cetasikasukhassa ca cetasikadukkhassa cāti imesampi dvinnaṃ pubbeva atthaṅgamā, pahānā icceva vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kadā pana nesaṃ pahānaṃ hotīti. Catunnaṃ jhānānaṃ upacārakkhaṇe. Somanassañhi catutthajjhānassa upacārakkhaṇeyeva pahīyati. Dukkhadomanassasukhāni paṭhamadutiyatatiyajjhānānaṃ upacārakkhaṇesu. Evametesaṃ pahānakkamena avuttānampi indriyavibhaṅge pana indriyānaṃ uddesakkameneva idhāpi vuttānaṃ sukhadukkhasomanassadomanassānaṃ pahānaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yadi panetāni tassa tassa jhānassa upacārakkhaṇeyeva pahīyanti, atha kasmā ‘‘kattha cuppannaṃ dukkhindriyaṃ aparisesaṃ nirujjhati, idha, bhikkhave, bhikkhu vivicceva kāmehipi…pe… paṭhamaṃ jhānaṃ upasampajja viharati. Ettha cuppannaṃ dukkhindriyaṃ aparisesaṃ nirujjhati. Kattha cuppannaṃ domanassindriyaṃ sukhindriyaṃ somanassindriyaṃ aparisesaṃ nirujjhati, idha, bhikkhave, bhikkhu sukhassa ca pahānā…pe… catutthaṃ jhānaṃ upasampajja viharati, ettha cuppannaṃ somanassindriyaṃ aparisesaṃ nirujjhatī’’ti (saṃ. ni. 5.510) evaṃ jhānesveva nirodho vuttoti? Atisayanirodhattā. Atisayanirodho hi nesaṃ paṭhamajjhānādīsu, na nirodhoyeva. Nirodhoyeva pana upacārakkhaṇe, nātisayanirodho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā ",
      " hi nānāvajjane paṭhamajjhānupacāre niruddhassāpi dukkhindriyassa ḍaṃsamakasādisamphassena vā visamāsanupatāpena vā siyā uppatti, na tveva antoappanāyaṃ. Upacāre vā niruddhampetaṃ na suṭṭhu niruddhaṃ hoti, paṭipakkhena avihatattā. Antoappanāyaṃ pana pītipharaṇena sabbo kāyo sukhokkanto hoti, sukhokkantakāyassa ca suṭṭhu niruddhaṃ hoti dukkhindriyaṃ, paṭipakkhena vihatattā. Nānāvajjaneyeva ca dutiyajjhānupacāre pahīnassa domanassindriyassa yasmā etaṃ vitakkavicārapaccayepi kāyakilamathe cittupaghāte ca sati uppajjati. Vitakkavicārābhāve ca neva uppajjati. Yattha pana uppajjati, tattha vitakkavicārabhāve, appahīnā eva ca dutiyajjhānupacāre vitakkavicārāti tatthassa siyā uppatti, na tveva dutiyajjhāne, pahīnapaccayattā. Tathā tatiyajjhānupacāre pahīnassāpi sukhindriyassa pītisamuṭṭhānapaṇītarūpaphuṭakāyassa ",
      " siyā uppatti, na tveva tatiyajjhāne. Tatiyajjhāne hi sukhassa paccayabhūtā pīti sabbaso niruddhāti. Tathā catutthajjhānupacāre pahīnassāpi somanassindriyassa āsannattā appanāppattāya upekkhāya abhāvena sammā anatikkantattā ca siyā uppatti, na tveva catutthajjhāne. Tasmā eva ca etthuppannaṃ dukkhindriyaṃ aparisesaṃ nirujjhatīti tattha tattha aparisesaggahaṇaṃ katanti."
    ],
    "innerText": "Tathā hi nānāvajjane paṭhamajjhānupacāre niruddhassāpi dukkhindriyassa ḍaṃsamakasādisamphassena vā visamāsanupatāpena vā siyā uppatti, na tveva antoappanāyaṃ. Upacāre vā niruddhampetaṃ na suṭṭhu niruddhaṃ hoti, paṭipakkhena avihatattā. Antoappanāyaṃ pana pītipharaṇena sabbo kāyo sukhokkanto hoti, sukhokkantakāyassa ca suṭṭhu niruddhaṃ hoti dukkhindriyaṃ, paṭipakkhena vihatattā. Nānāvajjaneyeva ca dutiyajjhānupacāre pahīnassa domanassindriyassa yasmā etaṃ vitakkavicārapaccayepi kāyakilamathe cittupaghāte ca sati uppajjati. Vitakkavicārābhāve ca neva uppajjati. Yattha pana uppajjati, tattha vitakkavicārabhāve, appahīnā eva ca dutiyajjhānupacāre vitakkavicārāti tatthassa siyā uppatti, na tveva dutiyajjhāne, pahīnapaccayattā. Tathā tatiyajjhānupacāre pahīnassāpi sukhindriyassa pītisamuṭṭhānapaṇītarūpaphuṭakāyassa siyā uppatti, na tveva tatiyajjhāne. Tatiyajjhāne hi sukhassa paccayabhūtā pīti sabbaso niruddhāti. Tathā catutthajjhānupacāre pahīnassāpi somanassindriyassa āsannattā appanāppattāya upekkhāya abhāvena sammā anatikkantattā ca siyā uppatti, na tveva catutthajjhāne. Tasmā eva ca etthuppannaṃ dukkhindriyaṃ aparisesaṃ nirujjhatīti tattha tattha aparisesaggahaṇaṃ katanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Etthāha ‘‘athevaṃ tassa tassa jhānassupacāre pahīnāpi etā vedanā idha kasmā samāhaṭā’’ti? Sukhaggahaṇatthaṃ. Yā hi ayaṃ adukkhamasukhanti ettha adukkhamasukhā vedanā vuttā, sā sukhumā duviññeyyā na sakkā sukhena gahetuṃ, tasmā yathā nāma duṭṭhassa yathā vā tathā vā upasaṅkamitvā gahetuṃ asakkuṇeyyassa goṇassa sukhaggahaṇatthaṃ gopo ekasmiṃ vaje sabbā gāvo samāharati, athekekaṃ nīharanto paṭipāṭiyā āgataṃ ‘‘ayaṃ so gaṇhatha na’’nti tampi gāhayati, evameva bhagavā sukhaggahaṇatthaṃ sabbā etā samāhari. Evañhi samāhaṭā etā dassetvā yaṃ neva sukhaṃ na dukkhaṃ na somanassaṃ na domanassaṃ, ayaṃ adukkhamasukhā vedanāti sakkā hoti esā gāhayituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica adukkhamasukhāya cetovimuttiyā paccayadassanatthañcāpi etā vuttāti veditabbā. Dukkhappahānādayo hi tassā paccayā. Yathāha – ‘‘cattāro ",
      " kho, āvuso, paccayā adukkhamasukhāya cetovimuttiyā samāpattiyā. Idhāvuso, bhikkhu sukhassa ca pahānā…pe… catutthaṃ jhānaṃ upasampajja viharati. Ime khvāvuso, cattāro paccayā adukkhamasukhāya cetovimuttiyā samāpattiyā’’ti (ma. ni. 1.458)."
    ],
    "innerText": "Apica adukkhamasukhāya cetovimuttiyā paccayadassanatthañcāpi etā vuttāti veditabbā. Dukkhappahānādayo hi tassā paccayā. Yathāha – ‘‘cattāro kho, āvuso, paccayā adukkhamasukhāya cetovimuttiyā samāpattiyā. Idhāvuso, bhikkhu sukhassa ca pahānā…pe… catutthaṃ jhānaṃ upasampajja viharati. Ime khvāvuso, cattāro paccayā adukkhamasukhāya cetovimuttiyā samāpattiyā’’ti (ma. ni. 1.458)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathā vā aññattha pahīnāpi sakkāyadiṭṭhiādayo tatiyamaggassa vaṇṇabhaṇanatthaṃ tattha pahīnāti vuttā, evaṃ vaṇṇabhaṇanatthampetassa jhānassetā idha vuttātipi veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paccayaghātena vā ettha rāgadosānamatidūrabhāvaṃ dassetumpetā vuttāti veditabbā. Etāsu hi sukhaṃ somanassassa paccayo, somanassaṃ rāgassa. Dukkhaṃ domanassassa paccayo, domanassaṃ dosassa. Sukhādighātena cassa sappaccayā rāgadosā hatāti atidūre hontīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adukkhamasukha"
      },
      "nti dukkhābhāvena adukkhaṃ. Sukhābhāvena asukhaṃ. Etenettha dukkhasukhapaṭipakkhabhūtaṃ tatiyavedanaṃ dīpeti, na dukkhasukhābhāvamattaṃ. Tatiyavedanā nāma adukkhamasukhā ",
      ", upekkhātipi vuccati. Sā iṭṭhāniṭṭhaviparītānubhavanalakkhaṇā, majjhattarasā, avibhūtapaccupaṭṭhānā, sukhadukkhanirodhapadaṭṭhānāti veditabbā."
    ],
    "innerText": "Adukkhamasukhanti dukkhābhāvena adukkhaṃ. Sukhābhāvena asukhaṃ. Etenettha dukkhasukhapaṭipakkhabhūtaṃ tatiyavedanaṃ dīpeti, na dukkhasukhābhāvamattaṃ. Tatiyavedanā nāma adukkhamasukhā , upekkhātipi vuccati. Sā iṭṭhāniṭṭhaviparītānubhavanalakkhaṇā, majjhattarasā, avibhūtapaccupaṭṭhānā, sukhadukkhanirodhapadaṭṭhānāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "89"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upekkhāsatipārisuddhi"
      },
      "nti upekkhāya janitasatiyā pārisuddhiṃ. Imasmiñhi jhāne suparisuddhā sati, yā ca tassā satiyā pārisuddhi, sā upekkhāya katā, na aññena. Tasmā etaṃ ‘‘upekkhāsatipārisuddhi’’nti vuccati. Vibhaṅgepi vuttaṃ ‘‘ayaṃ sati imāya upekkhāya visadā hoti parisuddhā pariyodātā. Tena vuccati upekkhāsatipārisuddhī’’ti (vibha. 597). Yāya ca upekkhāya ettha satiyā pārisuddhi hoti, sā atthato tatramajjhattatātiveditabbā. Na kevalañcettha tāya satiyeva parisuddhā, apica kho sabbepi sampayuttadhammā, satisīsena pana desanā vuttā."
    ],
    "innerText": "89.Upekkhāsatipārisuddhinti upekkhāya janitasatiyā pārisuddhiṃ. Imasmiñhi jhāne suparisuddhā sati, yā ca tassā satiyā pārisuddhi, sā upekkhāya katā, na aññena. Tasmā etaṃ ‘‘upekkhāsatipārisuddhi’’nti vuccati. Vibhaṅgepi vuttaṃ ‘‘ayaṃ sati imāya upekkhāya visadā hoti parisuddhā pariyodātā. Tena vuccati upekkhāsatipārisuddhī’’ti (vibha. 597). Yāya ca upekkhāya ettha satiyā pārisuddhi hoti, sā atthato tatramajjhattatātiveditabbā. Na kevalañcettha tāya satiyeva parisuddhā, apica kho sabbepi sampayuttadhammā, satisīsena pana desanā vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha kiñcāpi ayaṃ upekkhā heṭṭhāpi tīsu jhānesu vijjati. Yathā pana divā sūriyappabhābhibhavā sommabhāvena ca attano upakārakattena vā ",
      " sabhāgāya rattiyā alābhā divā vijjamānāpi candalekhā aparisuddhā hoti apariyodātā, evamayampi tatramajjhattupekkhācandalekhā vitakkādipaccanīkadhammatejābhibhavā sabhāgāya ca upekkhāvedanārattiyā appaṭilābhā vijjamānāpi paṭhamādijjhānabhedesu aparisuddhā hoti. Tassā ca aparisuddhāya divā aparisuddhacandalekhāya pabhā viya sahajātāpi satiādayo aparisuddhāva honti. Tasmā tesu ekampi ‘‘upekkhāsatipārisuddhi’’nti na vuttaṃ. Idha pana vitakkādipaccanīkadhammatejābhibhavābhāvā sabhāgāya ca upekkhāvedanārattiyā paṭilābhā ayaṃ tatramajjhattupekkhācandalekhā ativiya parisuddhā. Tassā parisuddhattā parisuddhacandalekhāya pabhā viya sahajātāpi satiādayo parisuddhā honti pariyodātā. Tasmā idameva ‘‘upekkhāsatipārisuddhi’’nti vuttanti veditabbaṃ."
    ],
    "innerText": "Tattha kiñcāpi ayaṃ upekkhā heṭṭhāpi tīsu jhānesu vijjati. Yathā pana divā sūriyappabhābhibhavā sommabhāvena ca attano upakārakattena vā sabhāgāya rattiyā alābhā divā vijjamānāpi candalekhā aparisuddhā hoti apariyodātā, evamayampi tatramajjhattupekkhācandalekhā vitakkādipaccanīkadhammatejābhibhavā sabhāgāya ca upekkhāvedanārattiyā appaṭilābhā vijjamānāpi paṭhamādijjhānabhedesu aparisuddhā hoti. Tassā ca aparisuddhāya divā aparisuddhacandalekhāya pabhā viya sahajātāpi satiādayo aparisuddhāva honti. Tasmā tesu ekampi ‘‘upekkhāsatipārisuddhi’’nti na vuttaṃ. Idha pana vitakkādipaccanīkadhammatejābhibhavābhāvā sabhāgāya ca upekkhāvedanārattiyā paṭilābhā ayaṃ tatramajjhattupekkhācandalekhā ativiya parisuddhā. Tassā parisuddhattā parisuddhacandalekhāya pabhā viya sahajātāpi satiādayo parisuddhā honti pariyodātā. Tasmā idameva ‘‘upekkhāsatipārisuddhi’’nti vuttanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catuttha"
      },
      "nti gaṇanānupubbatā catutthaṃ. Idaṃ catutthaṃ samāpajjatītipi catutthaṃ. Yaṃ pana vuttaṃ ‘‘ekaṅgavippahīnaṃ duvaṅgasamannāgata’’nti, tattha somanassassa pahānavasena ekaṅgavippahīnatā veditabbā. Tañca pana somanassaṃ ekavīthiyaṃ purimajavanesuyeva pahīyati. Tenassa taṃ pahānaṅganti vuccati. Upekkhāvedanā cittassekaggatāti imesaṃ pana dvinnaṃ uppattivasena duvaṅgasamannāgatatā veditabbā. Sesaṃ paṭhamajjhāne vuttanayameva. Esa tāva catukkajjhāne nayo."
    ],
    "innerText": "Catutthanti gaṇanānupubbatā catutthaṃ. Idaṃ catutthaṃ samāpajjatītipi catutthaṃ. Yaṃ pana vuttaṃ ‘‘ekaṅgavippahīnaṃ duvaṅgasamannāgata’’nti, tattha somanassassa pahānavasena ekaṅgavippahīnatā veditabbā. Tañca pana somanassaṃ ekavīthiyaṃ purimajavanesuyeva pahīyati. Tenassa taṃ pahānaṅganti vuccati. Upekkhāvedanā cittassekaggatāti imesaṃ pana dvinnaṃ uppattivasena duvaṅgasamannāgatatā veditabbā. Sesaṃ paṭhamajjhāne vuttanayameva. Esa tāva catukkajjhāne nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pañcakajjhānakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "90"
      },
      ". Pañcakajjhānaṃ ",
      " pana nibbattentena paguṇapaṭhamajjhānato vuṭṭhāya ‘‘ayaṃ samāpatti āsannanīvaraṇapaccatthikā, vitakkassa oḷārikattā aṅgadubbalā’’ti ca tattha dosaṃ disvā dutiyajjhānaṃ santato manasikaritvā paṭhamajjhāne nikantiṃ pariyādāya dutiyādhigamāya yogo kātabbo. Athassa yadā paṭhamajjhānā vuṭṭhāya satassa sampajānassa jhānaṅgāni paccavekkhato vitakkamattaṃ oḷārikato upaṭṭhāti, vicārādayo santato. Tadāssa oḷārikaṅgappahānāya santaṅgapaṭilābhāya ca tadeva nimittaṃ ‘‘pathavī pathavī’’ti punappunaṃ manasikaroto vuttanayeneva dutiyajjhānaṃ uppajjati. Tassa vitakkamattameva pahānaṅgaṃ. Vicārādīni cattāri samannāgataṅgāni. Sesaṃ vuttappakārameva."
    ],
    "innerText": "90. Pañcakajjhānaṃ pana nibbattentena paguṇapaṭhamajjhānato vuṭṭhāya ‘‘ayaṃ samāpatti āsannanīvaraṇapaccatthikā, vitakkassa oḷārikattā aṅgadubbalā’’ti ca tattha dosaṃ disvā dutiyajjhānaṃ santato manasikaritvā paṭhamajjhāne nikantiṃ pariyādāya dutiyādhigamāya yogo kātabbo. Athassa yadā paṭhamajjhānā vuṭṭhāya satassa sampajānassa jhānaṅgāni paccavekkhato vitakkamattaṃ oḷārikato upaṭṭhāti, vicārādayo santato. Tadāssa oḷārikaṅgappahānāya santaṅgapaṭilābhāya ca tadeva nimittaṃ ‘‘pathavī pathavī’’ti punappunaṃ manasikaroto vuttanayeneva dutiyajjhānaṃ uppajjati. Tassa vitakkamattameva pahānaṅgaṃ. Vicārādīni cattāri samannāgataṅgāni. Sesaṃ vuttappakārameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evamadhigate ",
      " pana tasmimpi vuttanayeneva pañcahākārehi ciṇṇavasinā hutvā paguṇadutiyajjhānato vuṭṭhāya ‘‘ayaṃ samāpatti āsannavitakkapaccatthikā, vicārassa oḷārikattā aṅgadubbalā’’ti ca tattha dosaṃ disvā tatiyaṃ jhānaṃ santato manasikaritvā dutiyajjhāne nikantiṃ pariyādāya tatiyādhigamāya yogo kātabbo. Athassa yadā dutiyajjhānato vuṭṭhāya satassa sampajānassa jhānaṅgāni paccavekkhato vicāramattaṃ oḷārikato upaṭṭhāti, pītiādīni santato. Tadāssa oḷārikaṅgappahānāya santaṅgapaṭilābhāya ca tadeva nimittaṃ ‘‘pathavī pathavī’’ti punappunaṃ manasikaroto vuttanayeneva tatiyaṃ jhānaṃ uppajjati. Tassa vicāramattameva pahānaṅgaṃ catukkanayassa dutiyajjhāne viya pītiādīni tīṇi samannāgataṅgāni. Sesaṃ vuttappakārameva."
    ],
    "innerText": "Evamadhigate pana tasmimpi vuttanayeneva pañcahākārehi ciṇṇavasinā hutvā paguṇadutiyajjhānato vuṭṭhāya ‘‘ayaṃ samāpatti āsannavitakkapaccatthikā, vicārassa oḷārikattā aṅgadubbalā’’ti ca tattha dosaṃ disvā tatiyaṃ jhānaṃ santato manasikaritvā dutiyajjhāne nikantiṃ pariyādāya tatiyādhigamāya yogo kātabbo. Athassa yadā dutiyajjhānato vuṭṭhāya satassa sampajānassa jhānaṅgāni paccavekkhato vicāramattaṃ oḷārikato upaṭṭhāti, pītiādīni santato. Tadāssa oḷārikaṅgappahānāya santaṅgapaṭilābhāya ca tadeva nimittaṃ ‘‘pathavī pathavī’’ti punappunaṃ manasikaroto vuttanayeneva tatiyaṃ jhānaṃ uppajjati. Tassa vicāramattameva pahānaṅgaṃ catukkanayassa dutiyajjhāne viya pītiādīni tīṇi samannāgataṅgāni. Sesaṃ vuttappakārameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iti yaṃ catukkanaye dutiyaṃ, taṃ dvidhā bhinditvā pañcakanaye dutiyañceva tatiyañca hoti. Yāni ca tattha tatiyacatutthāni, tāni ca catutthapañcamāni honti. Paṭhamaṃ paṭhamamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti sādhujanapāmojjatthāya kate visuddhimagge"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Samādhibhāvanādhikāre"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pathavīkasiṇaniddeso nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catuttho paricchedo."
  }
]