[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "9. Brahmavihāraniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Mettābhāvanākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "240"
      },
      ". Anussatikammaṭṭhānānantaraṃ ",
      " uddiṭṭhesu pana mettā, karuṇā, muditā, upekkhāti imesu catūsu brahmavihāresu mettaṃ bhāvetukāmena tāva ādikammikena yogāvacarena upacchinnapalibodhena gahitakammaṭṭhānena bhattakiccaṃ katvā bhattasammadaṃ paṭivinodetvā vivitte padese supaññatte āsane sukhanisinnena ādito tāva dose ādīnavo, khantiyañca ānisaṃso paccavekkhitabbo."
    ],
    "innerText": "240. Anussatikammaṭṭhānānantaraṃ uddiṭṭhesu pana mettā, karuṇā, muditā, upekkhāti imesu catūsu brahmavihāresu mettaṃ bhāvetukāmena tāva ādikammikena yogāvacarena upacchinnapalibodhena gahitakammaṭṭhānena bhattakiccaṃ katvā bhattasammadaṃ paṭivinodetvā vivitte padese supaññatte āsane sukhanisinnena ādito tāva dose ādīnavo, khantiyañca ānisaṃso paccavekkhitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kasmā? Imāya hi bhāvanāya doso pahātabbo, khanti adhigantabbā. Na ca sakkā kiñci adiṭṭhādīnavaṃ pahātuṃ, aviditānisaṃsaṃ vā adhigantuṃ. Tasmā ‘‘duṭṭho kho, āvuso, dosena abhibhūto pariyādiṇṇacitto pāṇampi hanatī’’tiādīnaṃ (a. ni. 3.72) vasena dose ādīnavo daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Khantī paramaṃ tapo titikkhā, nibbānaṃ paramaṃ vadanti buddhā’’; (Dī. ni. 2.90; dha. pa. 184);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "‘‘Khantibalaṃ balānīkaṃ, tamahaṃ brūmi brāhmaṇaṃ’’. (dha. pa. 399; su. ni. 628);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Khantā bhiyyo na vijjatī’’tiādīnaṃ (saṃ. ni. 1.250) vasena khantiyaṃ ānisaṃso veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athevaṃ diṭṭhādīnavato dosato cittaṃ vivecanatthāya, viditānisaṃsāya ca khantiyā saṃyojanatthāya ",
      " mettābhāvanā ārabhitabbā. Ārabhantena ca āditova puggalabhedo jānitabbo ‘‘imesu puggalesu mettā paṭhamaṃ na bhāvetabbā, imesu neva bhāvetabbā’’ti."
    ],
    "innerText": "Athevaṃ diṭṭhādīnavato dosato cittaṃ vivecanatthāya, viditānisaṃsāya ca khantiyā saṃyojanatthāya mettābhāvanā ārabhitabbā. Ārabhantena ca āditova puggalabhedo jānitabbo ‘‘imesu puggalesu mettā paṭhamaṃ na bhāvetabbā, imesu neva bhāvetabbā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayañhi mettā appiyapuggale, atippiyasahāyake, majjhatte, verīpuggaleti imesu catūsu paṭhamaṃ na bhāvetabbā. Liṅgavisabhāge odhiso na bhāvetabbā. Kālakate na bhāvetabbāva. Kiṃkāraṇā appiyādīsu paṭhamaṃ na bhāvetabbā? Appiyaṃ hi piyaṭṭhāne ṭhapento kilamati. Atippiyasahāyakaṃ majjhattaṭṭhāne ṭhapento kilamati, appamattakepi cassa dukkhe uppanne ārodanākārappatto viya hoti. Majjhattaṃ ",
      " garuṭṭhāne ca piyaṭṭhāne ca ṭhapento kilamati. Verimanussarato kodho uppajjati, tasmā appiyādīsu paṭhamaṃ na bhāvetabbā."
    ],
    "innerText": "Ayañhi mettā appiyapuggale, atippiyasahāyake, majjhatte, verīpuggaleti imesu catūsu paṭhamaṃ na bhāvetabbā. Liṅgavisabhāge odhiso na bhāvetabbā. Kālakate na bhāvetabbāva. Kiṃkāraṇā appiyādīsu paṭhamaṃ na bhāvetabbā? Appiyaṃ hi piyaṭṭhāne ṭhapento kilamati. Atippiyasahāyakaṃ majjhattaṭṭhāne ṭhapento kilamati, appamattakepi cassa dukkhe uppanne ārodanākārappatto viya hoti. Majjhattaṃ garuṭṭhāne ca piyaṭṭhāne ca ṭhapento kilamati. Verimanussarato kodho uppajjati, tasmā appiyādīsu paṭhamaṃ na bhāvetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Liṅgavisabhāge pana tameva ārabbha odhiso bhāventassa rāgo uppajjati. Aññataro kira amaccaputto kulūpakattheraṃ pucchi ‘‘bhante, kassa mettā bhāvetabbā’’ti? Thero ‘‘piyapuggale’’ti āha. Tassa attano bhariyā piyā hoti. So tassā mettaṃ bhāvento sabbarattiṃ bhittiyuddhamakāsi. Tasmā liṅgavisabhāge odhiso na bhāvetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kālakate pana bhāvento neva appanaṃ, na upacāraṃ pāpuṇāti. Aññataro kira daharabhikkhu ācariyaṃ ārabbha mettaṃ ārabhi. Tassa mettā nappavattati. So mahātherassa santikaṃ gantvā ‘‘bhante, paguṇāva me mettājhānasamāpatti, na ca naṃ samāpajjituṃ sakkomi, kiṃ nu kho kāraṇa’’nti āha. Thero ‘‘nimittaṃ, āvuso, gavesāhī’’ti āha. So gavesanto ācariyassa matabhāvaṃ ñatvā aññaṃ ārabbha mettāyanto samāpattiṃ appesi. Tasmā kālakate na bhāvetabbāva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "241"
      },
      ". Sabbapaṭhamaṃ pana ‘‘ahaṃ sukhito homi niddukkho’’ti vā, ‘‘avero abyāpajjo anīgho sukhī attānaṃ pariharāmī’’ti vā evaṃ punappunaṃ attaniyeva bhāvetabbā."
    ],
    "innerText": "241. Sabbapaṭhamaṃ pana ‘‘ahaṃ sukhito homi niddukkho’’ti vā, ‘‘avero abyāpajjo anīgho sukhī attānaṃ pariharāmī’’ti vā evaṃ punappunaṃ attaniyeva bhāvetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ sante yaṃ vibhaṅge (vibha. 643) vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Kathañca bhikkhu mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati? Seyyathāpi ",
      " nāma ekaṃ puggalaṃ piyaṃ manāpaṃ disvā mettāyeyya, evameva sabbe satte mettāya pharatī’’ti."
    ],
    "innerText": "‘‘Kathañca bhikkhu mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati? Seyyathāpi nāma ekaṃ puggalaṃ piyaṃ manāpaṃ disvā mettāyeyya, evameva sabbe satte mettāya pharatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yañca paṭisambhidāyaṃ (paṭi. ma. 2.22) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Katamehi pañcahākārehi anodhisopharaṇā mettā cetovimutti bhāvetabbā, sabbe sattā averā hontu’’ abyāpajjā anīghā sukhī attānaṃ pariharantu. Sabbe pāṇā… sabbe bhūtā… sabbe puggalā… sabbe attabhāvapariyāpannā averā abyāpajjā anīghā sukhī attānaṃ pariharantū’’tiādi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vuttaṃ. Yañca mettasutte (khu. pā. 9.3; su. ni. 145) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Sukhinova ",
      " khemino hontu,"
    ],
    "innerText": "‘‘Sukhinova khemino hontu,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbasattā bhavantu sukhitattā’’tiādi. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Vuttaṃ, taṃ virujjhati. Na hi tattha attani bhāvanā vuttāti ce. Tañca na virujjhati. Kasmā? Tañhi appanāvasena vuttaṃ. Idaṃ sakkhibhāvavasena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sacepi hi vassasataṃ vassasahassaṃ vā ‘‘ahaṃ sukhito homī’’tiādinā nayena attani mettaṃ bhāveti, nevassa appanā uppajjati. ‘‘Ahaṃ sukhito homī’’ti bhāvayato pana yathā ahaṃ sukhakāmo dukkhapaṭikkūlo jīvitukāmo amaritukāmo ca, evaṃ aññepi sattāti attānaṃ sakkhiṃ katvā aññasattesu hitasukhakāmatā uppajjati. Bhagavatāpi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sabbā disā anuparigamma cetasā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Nevajjhagā piyataramattanā kvaci;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Evaṃ piyo puthu attā paresaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā na hiṃse paramattakāmo’’ti. (saṃ. ni. 1.119; udā. 41); –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Vadatā ",
      " ayaṃ nayo dassito."
    ],
    "innerText": "Vadatā ayaṃ nayo dassito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "242"
      },
      ". Tasmā sakkhibhāvatthaṃ paṭhamaṃ attānaṃ mettāya pharitvā tadanantaraṃ sukhappavattanatthaṃ yvāyaṃ piyo manāpo garu bhāvanīyo ācariyo vā ācariyamatto vā upajjhāyo vā upajjhāyamatto vā tassa dānapiyavacanādīni piyamanāpattakāraṇāni sīlasutādīni garubhāvanīyattakāraṇāni ca anussaritvā ‘‘esa sappuriso sukhī hotu niddukkho’’tiādinā nayena mettā bhāvetabbā."
    ],
    "innerText": "242. Tasmā sakkhibhāvatthaṃ paṭhamaṃ attānaṃ mettāya pharitvā tadanantaraṃ sukhappavattanatthaṃ yvāyaṃ piyo manāpo garu bhāvanīyo ācariyo vā ācariyamatto vā upajjhāyo vā upajjhāyamatto vā tassa dānapiyavacanādīni piyamanāpattakāraṇāni sīlasutādīni garubhāvanīyattakāraṇāni ca anussaritvā ‘‘esa sappuriso sukhī hotu niddukkho’’tiādinā nayena mettā bhāvetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evarūpe ca puggale kāmaṃ appanā sampajjati, iminā pana bhikkhunā tāvatakeneva tuṭṭhiṃ anāpajjitvā sīmāsambhedaṃ kattukāmena tadanantaraṃ atippiyasahāyake, atippiyasahāyakato majjhatte, majjhattato verīpuggale mettā bhāvetabbā. Bhāventena ca ekekasmiṃ koṭṭhāse muduṃ kammaniyaṃ cittaṃ katvā tadanantare tadanantare upasaṃharitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yassa ",
      " pana verīpuggalo vā natthi, mahāpurisajātikattā vā anatthaṃ karontepi pare verīsaññāva nuppajjati, tena ‘‘majjhatte me mettacittaṃ kammaniyaṃ jātaṃ, idāni naṃ verimhi upasaṃharāmī’’ti byāpārova na kātabbo. Yassa pana atthi, taṃ sandhāya vuttaṃ ‘‘majjhattato verīpuggale mettā bhāvetabbā’’ti."
    ],
    "innerText": "Yassa pana verīpuggalo vā natthi, mahāpurisajātikattā vā anatthaṃ karontepi pare verīsaññāva nuppajjati, tena ‘‘majjhatte me mettacittaṃ kammaniyaṃ jātaṃ, idāni naṃ verimhi upasaṃharāmī’’ti byāpārova na kātabbo. Yassa pana atthi, taṃ sandhāya vuttaṃ ‘‘majjhattato verīpuggale mettā bhāvetabbā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "243"
      },
      ". Sace panassa verimhi cittamupasaṃharato tena katāparādhānussaraṇena paṭighamuppajjati, athānena purimapuggalesu yattha katthaci punappunaṃ mettaṃ samāpajjitvā vuṭṭhahitvā punappunaṃ taṃ puggalaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mettāyantena"
      },
      " paṭighaṃ vinodetabbaṃ. Sace evampi vāyamato na nibbāti, atha –"
    ],
    "innerText": "243. Sace panassa verimhi cittamupasaṃharato tena katāparādhānussaraṇena paṭighamuppajjati, athānena purimapuggalesu yattha katthaci punappunaṃ mettaṃ samāpajjitvā vuṭṭhahitvā punappunaṃ taṃ puggalaṃ mettāyantena paṭighaṃ vinodetabbaṃ. Sace evampi vāyamato na nibbāti, atha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kakacūpamaovāda-ādīnaṃ anusārato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paṭighassa pahānāya, ghaṭitabbaṃ punappunaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tañca kho iminā ākārena attānaṃ ovadanteneva ‘‘are kujjhanapurisa, nanu vuttaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘Ubhatodaṇḍakena ",
      " cepi, bhikkhave, kakacena corā ocarakā aṅgamaṅgāni okanteyyuṃ, tatrāpi yo mano padoseyya. Na me so tena sāsanakaro’ti (ma. ni. 1.232) ca,"
    ],
    "innerText": "‘Ubhatodaṇḍakena cepi, bhikkhave, kakacena corā ocarakā aṅgamaṅgāni okanteyyuṃ, tatrāpi yo mano padoseyya. Na me so tena sāsanakaro’ti (ma. ni. 1.232) ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘Tasseva tena pāpiyo, yo kuddhaṃ paṭikujjhati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kuddhamappaṭikujjhanto, saṅgāmaṃ jeti dujjayaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘‘Ubhinnamatthaṃ carati, attano ca parassa ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paraṃ saṅkupitaṃ ñatvā, yo sato upasammatī’ti ca. (saṃ. ni. 1.188); –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘‘Sattime, bhikkhave, dhammā sapattakantā sapattakaraṇā kodhanaṃ āgacchanti itthiṃ vā purisaṃ vā. Katame satta? Idha, bhikkhave, sapatto sapattassa evaṃ icchati aho vatāyaṃ dubbaṇṇo assāti. Taṃ kissahetu? Na, bhikkhave, sapatto sapattassa vaṇṇavatāya nandati. Kodhanāyaṃ, bhikkhave, purisapuggalo kodhābhibhūto kodhapareto kiñcāpi so hoti sunhāto suvilitto kappitakesamassu odātavatthavasano, atha kho so dubbaṇṇova hoti kodhābhibhūto. Ayaṃ, bhikkhave, ",
      " paṭhamo dhammo sapattakanto sapattakaraṇo kodhanaṃ āgacchati itthiṃ vā purisaṃ vā. Puna caparaṃ, bhikkhave, sapatto sapattassa evaṃ icchati ahovatāyaṃ dukkhaṃ sayeyyāti…pe… na pacurattho assāti…pe… na bhogavā assāti…pe… na yasavā assāti…pe… na mittavā assāti…pe… na kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjeyyāti. Taṃ kissa hetu? Na, bhikkhave, sapatto sapattassa sugatigamanena nandati. Kodhanāyaṃ, bhikkhave, purisapuggalo kodhābhibhūto kodhapareto kāyena duccaritaṃ carati, vācāya manasā duccaritaṃ carati. So kāyena vācāya manasā duccaritaṃ caritvā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati kodhābhibhūto’ti (a. ni. 7.64) ca,"
    ],
    "innerText": "‘‘‘Sattime, bhikkhave, dhammā sapattakantā sapattakaraṇā kodhanaṃ āgacchanti itthiṃ vā purisaṃ vā. Katame satta? Idha, bhikkhave, sapatto sapattassa evaṃ icchati aho vatāyaṃ dubbaṇṇo assāti. Taṃ kissahetu? Na, bhikkhave, sapatto sapattassa vaṇṇavatāya nandati. Kodhanāyaṃ, bhikkhave, purisapuggalo kodhābhibhūto kodhapareto kiñcāpi so hoti sunhāto suvilitto kappitakesamassu odātavatthavasano, atha kho so dubbaṇṇova hoti kodhābhibhūto. Ayaṃ, bhikkhave, paṭhamo dhammo sapattakanto sapattakaraṇo kodhanaṃ āgacchati itthiṃ vā purisaṃ vā. Puna caparaṃ, bhikkhave, sapatto sapattassa evaṃ icchati ahovatāyaṃ dukkhaṃ sayeyyāti…pe… na pacurattho assāti…pe… na bhogavā assāti…pe… na yasavā assāti…pe… na mittavā assāti…pe… na kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjeyyāti. Taṃ kissa hetu? Na, bhikkhave, sapatto sapattassa sugatigamanena nandati. Kodhanāyaṃ, bhikkhave, purisapuggalo kodhābhibhūto kodhapareto kāyena duccaritaṃ carati, vācāya manasā duccaritaṃ carati. So kāyena vācāya manasā duccaritaṃ caritvā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati kodhābhibhūto’ti (a. ni. 7.64) ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘‘Seyyathāpi ",
      ", bhikkhave, chavālātaṃ ubhatopadittaṃ majjhe gūthagataṃ neva gāme kaṭṭhatthaṃ pharati, na araññe kaṭṭhatthaṃ pharati. Tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmī’ti ca,"
    ],
    "innerText": "‘‘‘Seyyathāpi , bhikkhave, chavālātaṃ ubhatopadittaṃ majjhe gūthagataṃ neva gāme kaṭṭhatthaṃ pharati, na araññe kaṭṭhatthaṃ pharati. Tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmī’ti ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘So dāni tvaṃ evaṃ kujjhanto na ceva bhagavato sāsanakaro bhavissasi, paṭikujjhanto ca kuddhapurisatopi pāpiyo hutvā na dujjayaṃ saṅgāmaṃ jessasi, sapattakaraṇe ca dhamme attāva attano karissasi, chavālātūpamo ca bhavissasī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "244"
      },
      ". Tassevaṃ ghaṭayato vāyamato sace taṃ paṭighaṃ vūpasammati, iccetaṃ kusalaṃ. No ce vūpasammati, atha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yo yo dhammo tassa puggalassa vūpasanto hoti parisuddho, anussariyamāno pasādaṃ āvahati, taṃ taṃ anussaritvā"
      },
      " āghāto paṭivinetabbo."
    ],
    "innerText": "244. Tassevaṃ ghaṭayato vāyamato sace taṃ paṭighaṃ vūpasammati, iccetaṃ kusalaṃ. No ce vūpasammati, atha yo yo dhammo tassa puggalassa vūpasanto hoti parisuddho, anussariyamāno pasādaṃ āvahati, taṃ taṃ anussaritvā āghāto paṭivinetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ekaccassa hi kāyasamācārova upasanto hoti. Upasantabhāvo cassa bahuṃ vattapaṭipattiṃ karontassa sabbajanena ñāyati. Vacīsamācāramanosamācārā pana avūpasantā honti. Tassa te acintetvā kāyasamācāravūpasamoyeva anussaritabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekaccassa ",
      " vacīsamācārova upasanto hoti. Upasantabhāvo cassa sabbajanena ñāyati. So hi pakatiyā ca paṭisanthārakusalo hoti sakhilo sukhasambhāso sammodako uttānamukho pubbabhāsī madhurena sarena dhammaṃ osāreti, parimaṇḍalehi padabyañjanehi dhammakathaṃ katheti. Kāyasamācāramanosamācārā pana avūpasantā honti, tassa te acintetvā vacīsamācāravūpasamoyeva anussaritabbo."
    ],
    "innerText": "Ekaccassa vacīsamācārova upasanto hoti. Upasantabhāvo cassa sabbajanena ñāyati. So hi pakatiyā ca paṭisanthārakusalo hoti sakhilo sukhasambhāso sammodako uttānamukho pubbabhāsī madhurena sarena dhammaṃ osāreti, parimaṇḍalehi padabyañjanehi dhammakathaṃ katheti. Kāyasamācāramanosamācārā pana avūpasantā honti, tassa te acintetvā vacīsamācāravūpasamoyeva anussaritabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ekaccassa manosamācārova upasanto hoti, upasantabhāvo cassa cetiyavandanādīsu sabbajanassa pākaṭo hoti. Yo hi avūpasantacitto hoti, so cetiyaṃ vā bodhiṃ vā there vā vandamāno na sakkaccaṃ vandati, dhammassavanamaṇḍape vikkhittacitto vā pacalāyanto vā nisīdati. Upasantacitto pana okappetvā vandati, ohitasoto aṭṭhiṃkatvā kāyena vā vācāya vā cittappasādaṃ karonto dhammaṃ suṇāti. Iti ekaccassa manosamācārova upasanto hoti, kāyavacīsamācārā avūpasantā honti, tassa te acintetvā manosamācāravūpasamoyeva anussaritabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekaccassa ",
      " pana imesu tīsu dhammesu ekopi avūpasanto hoti, tasmiṃ puggale ‘‘kiñcāpi esa idāni manussaloke carati, atha kho katipāhassa accayena aṭṭhamahānirayasoḷasaussadanirayaparipūrako bhavissatī’’ti kāruññaṃ upaṭṭhapetabbaṃ. Kāruññampi hi paṭicca āghāto vūpasammati."
    ],
    "innerText": "Ekaccassa pana imesu tīsu dhammesu ekopi avūpasanto hoti, tasmiṃ puggale ‘‘kiñcāpi esa idāni manussaloke carati, atha kho katipāhassa accayena aṭṭhamahānirayasoḷasaussadanirayaparipūrako bhavissatī’’ti kāruññaṃ upaṭṭhapetabbaṃ. Kāruññampi hi paṭicca āghāto vūpasammati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ekaccassa tayopime dhammā vūpasantā honti, tassa yaṃ yaṃ icchati, taṃ taṃ anussaritabbaṃ. Tādise hi puggale na dukkarā hoti mettābhāvanāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Imassa ca atthassa āvibhāvatthaṃ – ‘‘pañcime, āvuso, āghātapaṭivinayā. Yattha bhikkhuno uppanno āghāto sabbaso paṭivinodetabbo’’ti (a. ni. 5.162) idaṃ pañcakanipāte āghātapaṭivinayasuttaṃ vitthāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "245"
      },
      ". Sace panassa evampi vāyamato āghāto uppajjatiyeva, athānena evaṃ attā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ovaditabbo"
      },
      " –"
    ],
    "innerText": "245. Sace panassa evampi vāyamato āghāto uppajjatiyeva, athānena evaṃ attā ovaditabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Attano ",
      " visaye dukkhaṃ, kataṃ te yadi verinā;"
    ],
    "innerText": "‘‘Attano visaye dukkhaṃ, kataṃ te yadi verinā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kiṃ tassāvisaye dukkhaṃ, sacitte kattumicchasi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Bahūpakāraṃ hitvāna, ñātivaggaṃ rudammukhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mahānatthakaraṃ kodhaṃ, sapattaṃ na jahāsi kiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yāni rakkhasi sīlāni, tesaṃ mūlanikantanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kodhaṃ nāmupaḷālesi, ko tayā sadiso jaḷo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kataṃ anariyaṃ kammaṃ, parena iti kujjhasi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kiṃ nu tvaṃ tādisaṃyeva, yo sayaṃ kattumicchasi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Dosetukāmo ",
      " yadi taṃ, amanāpaṃ paro kari;"
    ],
    "innerText": "‘‘Dosetukāmo yadi taṃ, amanāpaṃ paro kari;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dosuppādena tasseva, kiṃ pūresi manorathaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dukkhaṃ tassa ca nāma tvaṃ, kuddho kāhasi vā navā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Attānaṃ panidāneva, kodhadukkhena bādhasi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kodhaṃ vā ahitaṃ maggaṃ, ārūḷhā yadi verino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kasmā tuvampi kujjhanto, tesaṃyevānusikkhasi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yaṃ dosaṃ tava nissāya, sattunā appiyaṃ kataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tameva dosaṃ chindassu, kimaṭṭhāne vihaññasi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Khaṇikattā ca dhammānaṃ, yehi khandhehi te kataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Amanāpaṃ niruddhā te, kassa dānīdha kujjhasi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dukkhaṃ karoti yo yassa, taṃ vinā kassa so kare;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sayampi dukkhahetutta, miti kiṃ tassa kujjhasī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "246"
      },
      ". Sace panassa evaṃ attānaṃ ovadatopi paṭighaṃ neva vūpasammati, athānena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attano ca parassa ca kammassakatā"
      },
      " paccavekkhitabbā. Tattha attano tāva evaṃ paccavekkhitabbā ‘‘ambho tvaṃ tassa kuddho kiṃ karissasi? Nanu taveva cetaṃ dosanidānaṃ kammaṃ anatthāya saṃvattissati? Kammassako hi tvaṃ kammadāyādo kammayoni kammabandhu kammapaṭisaraṇo, yaṃ kammaṃ karissasi, tassa dāyādo bhavissasi, idañca te kammaṃ neva sammāsambodhiṃ ",
      ", na paccekabodhiṃ, na sāvakabhūmiṃ, na brahmattasakkattacakkavattipadesarājādisampattīnaṃ aññataraṃ sampattiṃ sādhetuṃ samatthaṃ, atha kho sāsanato cāvetvā vighāsādādibhāvassa ceva nerayikādidukkhavisesānañca te saṃvattanikamidaṃ kammaṃ. So tvaṃ idaṃ karonto ubhohi hatthehi vītaccite vā aṅgāre, gūthaṃ vā gahetvā paraṃ paharitukāmo puriso viya attānameva paṭhamaṃ dahasi ceva duggandhañca karosī’’ti."
    ],
    "innerText": "246. Sace panassa evaṃ attānaṃ ovadatopi paṭighaṃ neva vūpasammati, athānena attano ca parassa ca kammassakatā paccavekkhitabbā. Tattha attano tāva evaṃ paccavekkhitabbā ‘‘ambho tvaṃ tassa kuddho kiṃ karissasi? Nanu taveva cetaṃ dosanidānaṃ kammaṃ anatthāya saṃvattissati? Kammassako hi tvaṃ kammadāyādo kammayoni kammabandhu kammapaṭisaraṇo, yaṃ kammaṃ karissasi, tassa dāyādo bhavissasi, idañca te kammaṃ neva sammāsambodhiṃ , na paccekabodhiṃ, na sāvakabhūmiṃ, na brahmattasakkattacakkavattipadesarājādisampattīnaṃ aññataraṃ sampattiṃ sādhetuṃ samatthaṃ, atha kho sāsanato cāvetvā vighāsādādibhāvassa ceva nerayikādidukkhavisesānañca te saṃvattanikamidaṃ kammaṃ. So tvaṃ idaṃ karonto ubhohi hatthehi vītaccite vā aṅgāre, gūthaṃ vā gahetvā paraṃ paharitukāmo puriso viya attānameva paṭhamaṃ dahasi ceva duggandhañca karosī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attano kammassakataṃ"
      },
      " paccavekkhitvā parassapi evaṃ paccavekkhitabbā ‘‘esopi tava kujjhitvā kiṃ karissati? Nanu etassevetaṃ anatthāya saṃvattissati? Kammassako hi ayamāyasmā kammadāyādo…pe… yaṃ kammaṃ karissati, tassa dāyādo bhavissati. Idañcassa kammaṃ neva sammāsambodhiṃ, na paccekabodhiṃ, na sāvakabhūmiṃ, na brahmattasakkattacakkavattipadesarājādisampattīnaṃ aññataraṃ sampattiṃ sādhetuṃ samatthaṃ, atha kho sāsanato cāvetvā vighāsādādibhāvassa ceva nerayikādidukkhavisesānañcassa saṃvattanikamidaṃ kammaṃ. Svāyaṃ idaṃ karonto paṭivāte ṭhatvā paraṃ rajena okiritukāmo puriso viya attānaṃyeva okirati. Vuttañhetaṃ bhagavatā –"
    ],
    "innerText": "Evaṃ attano kammassakataṃ paccavekkhitvā parassapi evaṃ paccavekkhitabbā ‘‘esopi tava kujjhitvā kiṃ karissati? Nanu etassevetaṃ anatthāya saṃvattissati? Kammassako hi ayamāyasmā kammadāyādo…pe… yaṃ kammaṃ karissati, tassa dāyādo bhavissati. Idañcassa kammaṃ neva sammāsambodhiṃ, na paccekabodhiṃ, na sāvakabhūmiṃ, na brahmattasakkattacakkavattipadesarājādisampattīnaṃ aññataraṃ sampattiṃ sādhetuṃ samatthaṃ, atha kho sāsanato cāvetvā vighāsādādibhāvassa ceva nerayikādidukkhavisesānañcassa saṃvattanikamidaṃ kammaṃ. Svāyaṃ idaṃ karonto paṭivāte ṭhatvā paraṃ rajena okiritukāmo puriso viya attānaṃyeva okirati. Vuttañhetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘‘Yo appaduṭṭhassa narassa dussati,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Suddhassa posassa anaṅgaṇassa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tameva bālaṃ pacceti pāpaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sukhumo rajo paṭivātaṃva khitto’’’ti. (dha. pa. 125; su. ni. 667);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "247"
      },
      ". Sace panassa evaṃ kammassakatampi paccavekkhato neva vūpasammati, athānena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satthu pubbacariyaguṇā"
      },
      " anussaritabbā."
    ],
    "innerText": "247. Sace panassa evaṃ kammassakatampi paccavekkhato neva vūpasammati, athānena satthu pubbacariyaguṇā anussaritabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ paccavekkhaṇānayo – ambho pabbajita, nanu te satthā pubbeva sambodhā anabhisambuddho bodhisattopi samāno cattāri asaṅkhyeyyāni kappasatasahassañca pāramiyo pūrayamāno tattha tattha vadhakesupi paccatthikesu cittaṃ nappadūsesi. Seyyathidaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīlavajātake"
      },
      " tāva attano deviyā paduṭṭhena pāpaamaccena ānītassa paṭirañño tiyojanasataṃ ",
      " rajjaṃ gaṇhantassa nisedhanatthāya uṭṭhitānaṃ amaccānaṃ āvudhampi chupituṃ na adāsi. Puna saddhiṃ amaccasahassena āmakasusāne galappamāṇaṃ bhūmiṃ khaṇitvā nikhaññamāno cittappadosamattampi akatvā kuṇapakhādanatthaṃ āgatānaṃ siṅgālānaṃ paṃsuviyūhanaṃ nissāya purisakāraṃ katvā paṭiladdhajīvito yakkhānubhāvena attano sirigabbhaṃ oruyha sirisayane sayitaṃ paccatthikaṃ disvā kopaṃ akatvāva aññamaññaṃ sapathaṃ katvā taṃ mittaṭṭhāne ṭhapayitvā āha –"
    ],
    "innerText": "Tatrāyaṃ paccavekkhaṇānayo – ambho pabbajita, nanu te satthā pubbeva sambodhā anabhisambuddho bodhisattopi samāno cattāri asaṅkhyeyyāni kappasatasahassañca pāramiyo pūrayamāno tattha tattha vadhakesupi paccatthikesu cittaṃ nappadūsesi. Seyyathidaṃ, sīlavajātake tāva attano deviyā paduṭṭhena pāpaamaccena ānītassa paṭirañño tiyojanasataṃ rajjaṃ gaṇhantassa nisedhanatthāya uṭṭhitānaṃ amaccānaṃ āvudhampi chupituṃ na adāsi. Puna saddhiṃ amaccasahassena āmakasusāne galappamāṇaṃ bhūmiṃ khaṇitvā nikhaññamāno cittappadosamattampi akatvā kuṇapakhādanatthaṃ āgatānaṃ siṅgālānaṃ paṃsuviyūhanaṃ nissāya purisakāraṃ katvā paṭiladdhajīvito yakkhānubhāvena attano sirigabbhaṃ oruyha sirisayane sayitaṃ paccatthikaṃ disvā kopaṃ akatvāva aññamaññaṃ sapathaṃ katvā taṃ mittaṭṭhāne ṭhapayitvā āha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Āsīsetheva ",
      " puriso, na nibbindeyya paṇḍito;"
    ],
    "innerText": "‘‘Āsīsetheva puriso, na nibbindeyya paṇḍito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Passāmi vohamattānaṃ, yathā icchiṃ tathā ahū’’ti. (jā. 1.1.51);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Khantivādījātake dummedhena kāsiraññā ‘‘kiṃvādī tvaṃ samaṇā’’ti puṭṭho ‘‘khantivādī nāmāha’’nti vutte sakaṇṭakāhi kasāhi tāḷetvā hatthapādesu chijjamānesu kopamattampi nākāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anacchariyañcetaṃ, yaṃ mahallako pabbajjūpagato evaṃ kareyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cūḷadhammapālajātake"
      },
      " pana uttānaseyyakopi samāno –"
    ],
    "innerText": "Anacchariyañcetaṃ, yaṃ mahallako pabbajjūpagato evaṃ kareyya. Cūḷadhammapālajātake pana uttānaseyyakopi samāno –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Candanarasānulittā, bāhā chijjanti dhammapālassa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dāyādassa pathabyā, pāṇā me deva rujjhantī’’ti. (jā. 1.5.49);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ vippalapamānāya mātuyā pitarā mahāpatāpena nāma raññā vaṃsakaḷīresu viya catūsu hatthapādesu chedāpitesu tāvatāpi santuṭṭhiṃ anāpajjitvā sīsamassa chindathāti āṇatte ‘‘ayaṃ dāni te cittapariggaṇhanakālo, idāni ambho dhammapāla, sīsacchedāṇāpake pitari, sīsacchedake purise, paridevamānāya mātari, attani cāti imesu catūsu samacitto hohī’’ti daḷhaṃ samādānamadhiṭṭhāya paduṭṭhākāramattampi nākāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idañcāpi anacchariyameva, yaṃ manussabhūto evamakāsi. Tiracchānabhūtopi pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chaddanto"
      },
      " nāma vāraṇo hutvā visappitena sallena nābhiyaṃ viddhopi tāva anatthakārimhi luddake cittaṃ nappadūsesi. Yathāha –"
    ],
    "innerText": "Idañcāpi anacchariyameva, yaṃ manussabhūto evamakāsi. Tiracchānabhūtopi pana chaddanto nāma vāraṇo hutvā visappitena sallena nābhiyaṃ viddhopi tāva anatthakārimhi luddake cittaṃ nappadūsesi. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Samappito ",
      " puthusallena nāgo,"
    ],
    "innerText": "‘‘Samappito puthusallena nāgo,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Aduṭṭhacitto luddakaṃ ajjhabhāsi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Kimatthayaṃ kissa vā samma hetu,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mamaṃ vadhī kassa vāyaṃ payogo’’ti. (jā. 1.16.124);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " vatvā ca kāsirañño mahesiyā tava dantānamatthāya pesitomhi bhadanteti vutte tassā manorathaṃ pūrento chabbaṇṇarasminiccharaṇasamujjalitacārusobhe attano dante chetvā adāsi."
    ],
    "innerText": "Evaṃ vatvā ca kāsirañño mahesiyā tava dantānamatthāya pesitomhi bhadanteti vutte tassā manorathaṃ pūrento chabbaṇṇarasminiccharaṇasamujjalitacārusobhe attano dante chetvā adāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahākapi"
      },
      " hutvā attanāyeva pabbatapapātato uddharitena purisena –"
    ],
    "innerText": "Mahākapi hutvā attanāyeva pabbatapapātato uddharitena purisena –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Bhakkho ayaṃ manussānaṃ, yathevaññe vane migā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yaṃnūnimaṃ vadhitvāna, chāto khādeyya vānaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Āhitova gamissāmi, maṃsamādāya sambalaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kantāraṃ nittharissāmi, pātheyyaṃ me bhavissatī’’ti. (jā. 1.16.205-206); –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Evaṃ cintetvā silaṃ ukkhipitvā matthake sampadālite assupuṇṇehi nettehi taṃ purisaṃ udikkhamāno –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mā ayyosi me bhadante, tvaṃ nāmetādisaṃ kari;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tvaṃ khosi nāma dīghāvu, aññaṃ vāretumarahasī’’ti. (jā. 1.16.209); –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Vatvā tasmiṃ purise cittaṃ appadūsetvā attano ca dukkhaṃ acintetvā tameva purisaṃ khemantabhūmiṃ sampāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūridatto"
      },
      " nāma nāgarājā hutvā uposathaṅgāni adhiṭṭhāya vammikamuddhani sayamāno kappuṭṭhānaggisadisena osadhena sakalasarīre siñciyamānopi peḷāya pakkhipitvā sakalajambudīpe kīḷāpiyamānopi tasmiṃ brāhmaṇe manopadosamattampi na akāsi. Yathāha –"
    ],
    "innerText": "Bhūridatto nāma nāgarājā hutvā uposathaṅgāni adhiṭṭhāya vammikamuddhani sayamāno kappuṭṭhānaggisadisena osadhena sakalasarīre siñciyamānopi peḷāya pakkhipitvā sakalajambudīpe kīḷāpiyamānopi tasmiṃ brāhmaṇe manopadosamattampi na akāsi. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Peḷāya pakkhipantepi, maddantepi ca pāṇinā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Alampāne na kuppāmi, sīlakhaṇḍabhayā mamā’’ti. (cariyā. 2.16);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Campeyyopi"
      },
      " nāgarājā hutvā ahituṇḍikena viheṭhiyamāno manopadosamattampi nuppādesi. Yathāha –"
    ],
    "innerText": "Campeyyopi nāgarājā hutvā ahituṇḍikena viheṭhiyamāno manopadosamattampi nuppādesi. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tadāpi maṃ dhammacāriṃ, upavutthauposathaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ahituṇḍiko gahetvāna, rājadvāramhi kīḷati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yaṃ so vaṇṇaṃ cintayati, nīlaṃ pītaṃ va lohitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tassa cittānuvattanto, homi cintitasannibho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Thalaṃ kareyyaṃ udakaṃ, udakampi thalaṃ kare;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yadihaṃ tassa kuppeyyaṃ, khaṇena chārikaṃ kare."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yadi cittavasī hessaṃ, parihāyissāmi sīlato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sīlena parihīnassa, uttamattho na sijjhatī’’ti. (cariyā. 2.21-24);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhapālanāgarājā"
      },
      " hutvā tikhiṇāhi sattīhi aṭṭhasu ṭhānesu ovijjhitvā pahāramukhehi sakaṇṭakā latāyo pavesetvā nāsāya daḷhaṃ rajjuṃ pakkhipitvā soḷasahi bhojaputtehi kājenādāya vayhamāno dharaṇītale ghaṃsiyamānasarīro mahantaṃ dukkhaṃ paccanubhonto kujjhitvā olokitamatteneva sabbe bhojaputte bhasmaṃ kātuṃ samatthopi samāno cakkhuṃ ummīletvā paduṭṭhākāramattampi na akāsi."
    ],
    "innerText": "Saṅkhapālanāgarājā hutvā tikhiṇāhi sattīhi aṭṭhasu ṭhānesu ovijjhitvā pahāramukhehi sakaṇṭakā latāyo pavesetvā nāsāya daḷhaṃ rajjuṃ pakkhipitvā soḷasahi bhojaputtehi kājenādāya vayhamāno dharaṇītale ghaṃsiyamānasarīro mahantaṃ dukkhaṃ paccanubhonto kujjhitvā olokitamatteneva sabbe bhojaputte bhasmaṃ kātuṃ samatthopi samāno cakkhuṃ ummīletvā paduṭṭhākāramattampi na akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Cātuddasiṃ pañcadasiñcaḷāra,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Uposathaṃ niccamupāvasāmi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Athāgamuṃ soḷasa bhojaputtā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rajjuṃ gahetvāna daḷhañca pāsaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Bhetvāna ",
      " nāsaṃ atikassa rajjuṃ,"
    ],
    "innerText": "‘‘Bhetvāna nāsaṃ atikassa rajjuṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Nayiṃsu maṃ samparigayha luddā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Etādisaṃ dukkhamahaṃ titikkhaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uposathaṃ appaṭikopayanto’’ti. (jā. 2.17.180-181);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na ",
      " kevalañca etāneva, aññānipi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mātuposakajātakā"
      },
      "dīsu anekāni acchariyāni akāsi. Tassa te idāni sabbaññutaṃ pattaṃ sadevaloke kenaci appaṭisamakhantiguṇaṃ taṃ bhagavantaṃ satthāraṃ apadisato paṭighacittaṃ nāma uppādetuṃ ativiya ayuttaṃ appatirūpanti."
    ],
    "innerText": "Na kevalañca etāneva, aññānipi mātuposakajātakādīsu anekāni acchariyāni akāsi. Tassa te idāni sabbaññutaṃ pattaṃ sadevaloke kenaci appaṭisamakhantiguṇaṃ taṃ bhagavantaṃ satthāraṃ apadisato paṭighacittaṃ nāma uppādetuṃ ativiya ayuttaṃ appatirūpanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "248"
      },
      ". Sace panassa evaṃ satthu pubbacaritaguṇaṃ paccavekkhatopi dīgharattaṃ kilesānaṃ dāsabyaṃ upagatassa neva taṃ paṭighaṃ vūpasammati, athānena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anamataggiyāni"
      },
      " paccavekkhitabbāni. Tatra hi vuttaṃ –"
    ],
    "innerText": "248. Sace panassa evaṃ satthu pubbacaritaguṇaṃ paccavekkhatopi dīgharattaṃ kilesānaṃ dāsabyaṃ upagatassa neva taṃ paṭighaṃ vūpasammati, athānena anamataggiyāni paccavekkhitabbāni. Tatra hi vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Na so, bhikkhave, satto sulabharūpo, yo na mātābhūtapubbo, yo na pitābhūtapubbo, yo na bhātā, yo na bhaginī, yo na putto, yo na dhītābhūtapubbā’’ti (saṃ. ni. 2.137-142)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmā tasmiṃ puggale evaṃ cittaṃ uppādetabbaṃ, ‘‘ayaṃ kira me atīte mātā hutvā dasamāse kucchiyā pariharitvā muttakarīsakheḷasiṅghāṇikādīni haricandanaṃ viya ajigucchamānā apanetvā ure naccāpentī aṅgena pariharamānā posesi, pitā hutvā ajapathasaṅkupathādīni gantvā vāṇijjaṃ payojayamāno mayhamatthāya jīvitampi pariccajitvā ubhatobyūḷhe saṅgāme pavisitvā nāvāya mahāsamuddaṃ pakkhanditvā aññāni ca dukkarāni karitvā ‘puttake posessāmī’ti tehi tehi upāyehi dhanaṃ saṃharitvā maṃ posesi. Bhātā, bhaginī, putto, dhītā ca hutvāpi idañcidañcupakāraṃ akāsīti tatra me nappatirūpaṃ manaṃ padūsetu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "249"
      },
      ". Sace pana evampi cittaṃ nibbāpetuṃ na sakkotiyeva, athānena evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mettānisaṃsā"
      },
      " paccavekkhitabbā – ‘‘ambho pabbajita, nanu vuttaṃ bhagavatā –"
    ],
    "innerText": "249. Sace pana evampi cittaṃ nibbāpetuṃ na sakkotiyeva, athānena evaṃ mettānisaṃsā paccavekkhitabbā – ‘‘ambho pabbajita, nanu vuttaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘Mettāya ",
      " kho, bhikkhave, cetovimuttiyā āsevitāya bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya ekādasānisaṃsā pāṭikaṅkhā ",
      ". Katame ekādasa? Sukhaṃ supati, sukhaṃ paṭibujjhati, na pāpakaṃ supinaṃ passati, manussānaṃ piyo hoti, amanussānaṃ piyo hoti, devatā rakkhanti, nāssa aggi vā visaṃ vā satthaṃ vā kamati, tuvaṭaṃ cittaṃ samādhiyati, mukhavaṇṇo pasīdati, asammūḷho kālaṅkaroti, uttarimappaṭivijjhanto brahmalokūpago hotī’ti (a. ni. 11.15)."
    ],
    "innerText": "‘Mettāya kho, bhikkhave, cetovimuttiyā āsevitāya bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya ekādasānisaṃsā pāṭikaṅkhā . Katame ekādasa? Sukhaṃ supati, sukhaṃ paṭibujjhati, na pāpakaṃ supinaṃ passati, manussānaṃ piyo hoti, amanussānaṃ piyo hoti, devatā rakkhanti, nāssa aggi vā visaṃ vā satthaṃ vā kamati, tuvaṭaṃ cittaṃ samādhiyati, mukhavaṇṇo pasīdati, asammūḷho kālaṅkaroti, uttarimappaṭivijjhanto brahmalokūpago hotī’ti (a. ni. 11.15)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace tvaṃ idaṃ cittaṃ na nibbāpessasi, imehi ānisaṃsehi paribāhiro bhavissasī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "250"
      },
      ". Evampi nibbāpetuṃ asakkontena pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhātuvinibbhogo"
      },
      " kātabbo. Kathaṃ? ‘‘Ambho pabbajita, tvaṃ etassa kujjhamāno kassa kujjhasi? Kiṃ kesānaṃ kujjhasi, udāhu lomānaṃ, nakhānaṃ…pe… muttassa kujjhasi? Atha vā pana kesādīsu pathavīdhātuyā kujjhasi, āpodhātuyā, tejodhātuyā, vāyodhātuyā kujjhasi? Ye vā pañcakkhandhe dvādasāyatanāni aṭṭhārasa dhātuyo upādāya ayamāyasmā itthannāmoti vuccati, tesu kiṃ rūpakkhandhassa kujjhasi, udāhu vedanā saññā saṅkhāraviññāṇakkhandhassa kujjhasi? Kiṃ vā cakkhāyatanassa kujjhasi, kiṃ rūpāyatanassa kujjhasi…pe… kiṃ manāyatanassa kujjhasi, kiṃ dhammāyatanassa kujjhasi? Kiṃ vā cakkhudhātuyā kujjhasi, kiṃ rūpadhātuyā, kiṃ cakkhuviññāṇadhātuyā…pe… kiṃ manodhātuyā, kiṃ dhammadhātuyā, kiṃ manoviññāṇadhātuyā’’ti? Evañhi dhātuvinibbhogaṃ karoto āragge sāsapassa viya ākāse cittakammassa viya ca kodhassa patiṭṭhānaṭṭhānaṃ na hoti."
    ],
    "innerText": "250. Evampi nibbāpetuṃ asakkontena pana dhātuvinibbhogo kātabbo. Kathaṃ? ‘‘Ambho pabbajita, tvaṃ etassa kujjhamāno kassa kujjhasi? Kiṃ kesānaṃ kujjhasi, udāhu lomānaṃ, nakhānaṃ…pe… muttassa kujjhasi? Atha vā pana kesādīsu pathavīdhātuyā kujjhasi, āpodhātuyā, tejodhātuyā, vāyodhātuyā kujjhasi? Ye vā pañcakkhandhe dvādasāyatanāni aṭṭhārasa dhātuyo upādāya ayamāyasmā itthannāmoti vuccati, tesu kiṃ rūpakkhandhassa kujjhasi, udāhu vedanā saññā saṅkhāraviññāṇakkhandhassa kujjhasi? Kiṃ vā cakkhāyatanassa kujjhasi, kiṃ rūpāyatanassa kujjhasi…pe… kiṃ manāyatanassa kujjhasi, kiṃ dhammāyatanassa kujjhasi? Kiṃ vā cakkhudhātuyā kujjhasi, kiṃ rūpadhātuyā, kiṃ cakkhuviññāṇadhātuyā…pe… kiṃ manodhātuyā, kiṃ dhammadhātuyā, kiṃ manoviññāṇadhātuyā’’ti? Evañhi dhātuvinibbhogaṃ karoto āragge sāsapassa viya ākāse cittakammassa viya ca kodhassa patiṭṭhānaṭṭhānaṃ na hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "251"
      },
      ". Dhātuvinibbhogaṃ pana kātuṃ asakkontena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dānasaṃvibhāgo"
      },
      " kātabbo. Attano santakaṃ parassa dātabbaṃ, parassa santakaṃ attanā gahetabbaṃ. Sace pana paro bhinnājīvo hoti aparibhogārahaparikkhāro, attano santakameva dātabbaṃ. Tassevaṃ karoto ekanteneva tasmiṃ puggale āghāto vūpasammati. Itarassa ca atītajātito paṭṭhāya anubandhopi kodho taṅkhaṇaññeva vūpasammati, cittalapabbatavihāre tikkhattuṃ vuṭṭhāpitasenāsanena piṇḍapātikattherena ‘‘ayaṃ ",
      ", bhante, aṭṭhakahāpaṇagghanako patto mama mātarā upāsikāya dinno dhammiyalābho, mahāupāsikāya ",
      " puññalābhaṃ karothā’’ti vatvā dinnaṃ pattaṃ laddhamahātherassa viya. Evaṃ mahānubhāvametaṃ dānaṃ nāma. Vuttampi cetaṃ –"
    ],
    "innerText": "251. Dhātuvinibbhogaṃ pana kātuṃ asakkontena dānasaṃvibhāgo kātabbo. Attano santakaṃ parassa dātabbaṃ, parassa santakaṃ attanā gahetabbaṃ. Sace pana paro bhinnājīvo hoti aparibhogārahaparikkhāro, attano santakameva dātabbaṃ. Tassevaṃ karoto ekanteneva tasmiṃ puggale āghāto vūpasammati. Itarassa ca atītajātito paṭṭhāya anubandhopi kodho taṅkhaṇaññeva vūpasammati, cittalapabbatavihāre tikkhattuṃ vuṭṭhāpitasenāsanena piṇḍapātikattherena ‘‘ayaṃ , bhante, aṭṭhakahāpaṇagghanako patto mama mātarā upāsikāya dinno dhammiyalābho, mahāupāsikāya puññalābhaṃ karothā’’ti vatvā dinnaṃ pattaṃ laddhamahātherassa viya. Evaṃ mahānubhāvametaṃ dānaṃ nāma. Vuttampi cetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Adantadamanaṃ dānaṃ, dānaṃ sabbatthasādhakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dānena piyavācāya, unnamanti namanti cā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "252"
      },
      ". Tassevaṃ verīpuggale vūpasantapaṭighassa yathā piyātippiyasahāyakamajjhattesu, evaṃ tasmimpi mettāvasena cittaṃ pavattati. Athānena punappunaṃ mettāyantena attani piyapuggale majjhatte verīpuggaleti catūsu janesu samacittataṃ sampādentena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīmāsambhedo"
      },
      " kātabbo. Tassidaṃ lakkhaṇaṃ, sace imasmiṃ puggale piyamajjhattaverīhi saddhiṃ attacatutthe ekasmiṃ padese nisinne corā āgantvā ‘‘bhante, ekaṃ bhikkhuṃ amhākaṃ dethā’’ti vatvā ‘‘kiṃ kāraṇā’’ti vutte ‘‘taṃ māretvā galalohitaṃ gahetvā balikaraṇatthāyā’’ti vadeyyuṃ, tatra ceso bhikkhu ‘‘asukaṃ vā asukaṃ vā gaṇhantū’’ti cinteyya, akatova hoti sīmāsambhedo. Sacepi ‘‘maṃ gaṇhantu, mā ime tayo’’tipi cinteyya, akatova hoti sīmāsambhedo. Kasmā? Yassa yassa hi gahaṇamicchati, tassa tassa ahitesī hoti, itaresaṃyeva hitesī hoti."
    ],
    "innerText": "252. Tassevaṃ verīpuggale vūpasantapaṭighassa yathā piyātippiyasahāyakamajjhattesu, evaṃ tasmimpi mettāvasena cittaṃ pavattati. Athānena punappunaṃ mettāyantena attani piyapuggale majjhatte verīpuggaleti catūsu janesu samacittataṃ sampādentena sīmāsambhedo kātabbo. Tassidaṃ lakkhaṇaṃ, sace imasmiṃ puggale piyamajjhattaverīhi saddhiṃ attacatutthe ekasmiṃ padese nisinne corā āgantvā ‘‘bhante, ekaṃ bhikkhuṃ amhākaṃ dethā’’ti vatvā ‘‘kiṃ kāraṇā’’ti vutte ‘‘taṃ māretvā galalohitaṃ gahetvā balikaraṇatthāyā’’ti vadeyyuṃ, tatra ceso bhikkhu ‘‘asukaṃ vā asukaṃ vā gaṇhantū’’ti cinteyya, akatova hoti sīmāsambhedo. Sacepi ‘‘maṃ gaṇhantu, mā ime tayo’’tipi cinteyya, akatova hoti sīmāsambhedo. Kasmā? Yassa yassa hi gahaṇamicchati, tassa tassa ahitesī hoti, itaresaṃyeva hitesī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yadā pana catunnaṃ janānamantare ekampi corānaṃ dātabbaṃ na passati, attani ca tesu ca tīsu janesu samameva cittaṃ pavatteti, kato hoti sīmāsambhedo. Tenāhu porāṇā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Attani hitamajjhatte, ahite ca catubbidhe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yadā passati nānattaṃ, hitacittova pāṇinaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Na nikāmalābhī mettāya, kusalīti pavuccati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yadā catasso sīmāyo, sambhinnā honti bhikkhuno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Samaṃ pharati mettāya, sabbalokaṃ sadevakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mahāviseso purimena, yassa sīmā na ñāyatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "253"
      },
      ". Evaṃ ",
      " sīmāsambhedasamakālameva ca iminā bhikkhunā nimittañca upacārañca laddhaṃ hoti. Sīmāsambhede pana kate tameva nimittaṃ āsevanto bhāvento bahulīkaronto appakasireneva pathavīkasiṇe vuttanayeneva appanaṃ pāpuṇāti."
    ],
    "innerText": "253. Evaṃ sīmāsambhedasamakālameva ca iminā bhikkhunā nimittañca upacārañca laddhaṃ hoti. Sīmāsambhede pana kate tameva nimittaṃ āsevanto bhāvento bahulīkaronto appakasireneva pathavīkasiṇe vuttanayeneva appanaṃ pāpuṇāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatānena adhigataṃ hoti pañcaṅgavippahīnaṃ pañcaṅgasamannāgataṃ tividhakalyāṇaṃ dasalakkhaṇasampannaṃ paṭhamajjhānaṃ mettāsahagataṃ. Adhigate ca tasmiṃ tadeva nimittaṃ āsevanto bhāvento bahulīkaronto anupubbena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catukkanaye"
      },
      " dutiyatatiyajjhānāni, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcakanaye"
      },
      " dutiyatatiyacatutthajjhānāni ca pāpuṇāti."
    ],
    "innerText": "Ettāvatānena adhigataṃ hoti pañcaṅgavippahīnaṃ pañcaṅgasamannāgataṃ tividhakalyāṇaṃ dasalakkhaṇasampannaṃ paṭhamajjhānaṃ mettāsahagataṃ. Adhigate ca tasmiṃ tadeva nimittaṃ āsevanto bhāvento bahulīkaronto anupubbena catukkanaye dutiyatatiyajjhānāni, pañcakanaye dutiyatatiyacatutthajjhānāni ca pāpuṇāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So hi paṭhamajjhānādīnaṃ aññataravasena mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati. Tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati (vibha. 642; dī. ni. 1.556). Paṭhamajjhānādivasena appanāppattacittasseva hi ayaṃ vikubbanā sampajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "254"
      },
      ". Ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mettāsahagatenā"
      },
      "ti mettāya samannāgatena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cetasā"
      },
      "ti cittena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekaṃ disa"
      },
      "nti ekamekissā disāya paṭhamapariggahitaṃ sattaṃ upādāya ekadisāpariyāpannasattapharaṇavasena vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pharitvā"
      },
      "ti phusitvā ārammaṇaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viharatī"
      },
      "ti brahmavihārādhiṭṭhitaṃ iriyāpathavihāraṃ pavatteti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathā dutiya"
      },
      "nti yathā puratthimādīsu disāsu yaṃkiñci ekaṃ disaṃ pharitvā viharati, tatheva tadanantaraṃ dutiyaṃ tatiyaṃ catutthañcāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iti uddha"
      },
      "nti eteneva nayena uparimaṃ disanti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adho tiriya"
      },
      "nti adhodisampi tiriyaṃdisampi evameva. Tattha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adho"
      },
      "ti heṭṭhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiriya"
      },
      "nti anudisāsu. Evaṃ sabbadisāsu assamaṇḍale assamiva mettāsahagataṃ cittaṃ sāretipi paccāsāretipīti. Ettāvatā ekaṃ disaṃ pariggahetvā odhiso mettāpharaṇaṃ dassitaṃ."
    ],
    "innerText": "254. Ettha ca mettāsahagatenāti mettāya samannāgatena. Cetasāti cittena. Ekaṃ disanti ekamekissā disāya paṭhamapariggahitaṃ sattaṃ upādāya ekadisāpariyāpannasattapharaṇavasena vuttaṃ. Pharitvāti phusitvā ārammaṇaṃ katvā. Viharatīti brahmavihārādhiṭṭhitaṃ iriyāpathavihāraṃ pavatteti. Tathā dutiyanti yathā puratthimādīsu disāsu yaṃkiñci ekaṃ disaṃ pharitvā viharati, tatheva tadanantaraṃ dutiyaṃ tatiyaṃ catutthañcāti attho. Iti uddhanti eteneva nayena uparimaṃ disanti vuttaṃ hoti. Adho tiriyanti adhodisampi tiriyaṃdisampi evameva. Tattha ca adhoti heṭṭhā. Tiriyanti anudisāsu. Evaṃ sabbadisāsu assamaṇḍale assamiva mettāsahagataṃ cittaṃ sāretipi paccāsāretipīti. Ettāvatā ekaṃ disaṃ pariggahetvā odhiso mettāpharaṇaṃ dassitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbadhī"
      },
      "tiādi pana anodhiso dassanatthaṃ vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbadhī"
      },
      "ti sabbattha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbattatāyā"
      },
      "ti sabbesu hīnamajjhimukkaṭṭhamittasapattamajjhattādippabhedesu attatāya ",
      ". ‘‘Ayaṃ parasatto’’ti vibhāgaṃ akatvā attasamatāyāti vuttaṃ hoti. Atha vā sabbattatāyāti sabbena cittabhāgena īsakampi ",
      " bahi avikkhipamānoti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbāvanta"
      },
      "nti sabbasattavantaṃ, sabbasattayuttanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Loka"
      },
      "nti sattalokaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipulenā"
      },
      "tievamādipariyāyadassanato panettha puna mettāsahagatenāti vuttaṃ. Yasmā vā ettha odhiso pharaṇe viya puna tathāsaddo itisaddo vā na vutto, tasmā puna mettāsahagatena cetasāti vuttaṃ. Nigamavasena vā etaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipulenā"
      },
      "ti ettha ca pharaṇavasena vipulatā daṭṭhabbā. Bhūmivasena pana etaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahaggataṃ"
      },
      " paguṇavasena ca appamāṇasattārammaṇavasena ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appamāṇaṃ,"
      },
      " byāpādapaccatthikappahānena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "averaṃ,"
      },
      " domanassappahānato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abyāpajjaṃ,"
      },
      " niddukkhanti vuttaṃ hoti. Ayaṃ mettāsahagatena cetasātiādinā nayena vuttāya vikubbanāya attho."
    ],
    "innerText": "Sabbadhītiādi pana anodhiso dassanatthaṃ vuttaṃ. Tattha sabbadhīti sabbattha. Sabbattatāyāti sabbesu hīnamajjhimukkaṭṭhamittasapattamajjhattādippabhedesu attatāya . ‘‘Ayaṃ parasatto’’ti vibhāgaṃ akatvā attasamatāyāti vuttaṃ hoti. Atha vā sabbattatāyāti sabbena cittabhāgena īsakampi bahi avikkhipamānoti vuttaṃ hoti. Sabbāvantanti sabbasattavantaṃ, sabbasattayuttanti attho. Lokanti sattalokaṃ. Vipulenātievamādipariyāyadassanato panettha puna mettāsahagatenāti vuttaṃ. Yasmā vā ettha odhiso pharaṇe viya puna tathāsaddo itisaddo vā na vutto, tasmā puna mettāsahagatena cetasāti vuttaṃ. Nigamavasena vā etaṃ vuttaṃ. Vipulenāti ettha ca pharaṇavasena vipulatā daṭṭhabbā. Bhūmivasena pana etaṃ mahaggataṃ paguṇavasena ca appamāṇasattārammaṇavasena ca appamāṇaṃ, byāpādapaccatthikappahānena averaṃ, domanassappahānato abyāpajjaṃ, niddukkhanti vuttaṃ hoti. Ayaṃ mettāsahagatena cetasātiādinā nayena vuttāya vikubbanāya attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "255"
      },
      ". Yathā cāyaṃ appanāppattacittasseva vikubbanā sampajjati, tathā yampi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisambhidāyaṃ"
      },
      " (paṭi. ma. 2.22) ‘‘pañcahākārehi anodhisopharaṇā mettācetovimutti, sattahākārehi odhisopharaṇā mettā cetovimutti, dasahākārehi disāpharaṇā mettā cetovimuttī’’ti vuttaṃ, tampi appanāppattacittasseva sampajjatīti veditabbaṃ."
    ],
    "innerText": "255. Yathā cāyaṃ appanāppattacittasseva vikubbanā sampajjati, tathā yampi paṭisambhidāyaṃ (paṭi. ma. 2.22) ‘‘pañcahākārehi anodhisopharaṇā mettācetovimutti, sattahākārehi odhisopharaṇā mettā cetovimutti, dasahākārehi disāpharaṇā mettā cetovimuttī’’ti vuttaṃ, tampi appanāppattacittasseva sampajjatīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ca sabbe sattā averā abyāpajjā anīghā sukhī attānaṃ pariharantu, sabbe pāṇā, sabbe bhūtā, sabbe puggalā, sabbe attabhāvapariyāpannā averā…pe… pariharantūti imehi pañcahākārehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anodhisopharaṇā mettā cetovimutti"
      },
      " veditabbā."
    ],
    "innerText": "Tattha ca sabbe sattā averā abyāpajjā anīghā sukhī attānaṃ pariharantu, sabbe pāṇā, sabbe bhūtā, sabbe puggalā, sabbe attabhāvapariyāpannā averā…pe… pariharantūti imehi pañcahākārehi anodhisopharaṇā mettā cetovimutti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbā itthiyo averā…pe… attānaṃ pariharantu, sabbe purisā, sabbe ariyā, sabbe anariyā, sabbe devā, sabbe manussā, sabbe vinipātikā averā…pe… pariharantūti imehi sattahākārehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "odhisopharaṇā mettā cetovimutti"
      },
      " veditabbā."
    ],
    "innerText": "Sabbā itthiyo averā…pe… attānaṃ pariharantu, sabbe purisā, sabbe ariyā, sabbe anariyā, sabbe devā, sabbe manussā, sabbe vinipātikā averā…pe… pariharantūti imehi sattahākārehi odhisopharaṇā mettā cetovimutti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbe puratthimāya disāya sattā averā…pe… attānaṃ pariharantu. Sabbe pacchimāya disāya, sabbe uttarāya disāya, sabbe dakkhiṇāya disāya, sabbe puratthimāya anudisāya, sabbe pacchimāya anudisāya, sabbe ",
      " uttarāya anudisāya, sabbe dakkhiṇāya anudisāya, sabbe heṭṭhimāya disāya, sabbe uparimāya disāya sattā averā…pe… pariharantu. Sabbe puratthimāya disāya pāṇā, bhūtā, puggalā, attabhāvapariyāpannā, averā…pe… pariharantu. Sabbā puratthimāya disāya itthiyo, sabbe purisā, ariyā, anariyā, devā, manussā, vinipātikā ",
      " averā…pe… pariharantu. Sabbā pacchimāya disāya, uttarāya, dakkhiṇāya, puratthimāya anudisāya, pacchimāya, uttarāya, dakkhiṇāya anudisāya, heṭṭhimāya disāya, uparimāya disāya itthiyo…pe… vinipātikā averā abyāpajjā anīghā sukhī attānaṃ pariharantūti imehi dasahākārehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "disāpharaṇā mettā cetovimutti"
      },
      " veditabbā."
    ],
    "innerText": "Sabbe puratthimāya disāya sattā averā…pe… attānaṃ pariharantu. Sabbe pacchimāya disāya, sabbe uttarāya disāya, sabbe dakkhiṇāya disāya, sabbe puratthimāya anudisāya, sabbe pacchimāya anudisāya, sabbe uttarāya anudisāya, sabbe dakkhiṇāya anudisāya, sabbe heṭṭhimāya disāya, sabbe uparimāya disāya sattā averā…pe… pariharantu. Sabbe puratthimāya disāya pāṇā, bhūtā, puggalā, attabhāvapariyāpannā, averā…pe… pariharantu. Sabbā puratthimāya disāya itthiyo, sabbe purisā, ariyā, anariyā, devā, manussā, vinipātikā averā…pe… pariharantu. Sabbā pacchimāya disāya, uttarāya, dakkhiṇāya, puratthimāya anudisāya, pacchimāya, uttarāya, dakkhiṇāya anudisāya, heṭṭhimāya disāya, uparimāya disāya itthiyo…pe… vinipātikā averā abyāpajjā anīghā sukhī attānaṃ pariharantūti imehi dasahākārehi disāpharaṇā mettā cetovimutti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "256"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbe"
      },
      "ti anavasesapariyādānametaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattā"
      },
      "ti rūpādīsu khandhesu chandarāgena sattā visattāti sattā. Vuttañhetaṃ bhagavatā –"
    ],
    "innerText": "256. Tattha sabbeti anavasesapariyādānametaṃ. Sattāti rūpādīsu khandhesu chandarāgena sattā visattāti sattā. Vuttañhetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Rūpe kho, rādha, yo chando yo rāgo yā nandī yā taṇhā, tatra satto, tatra visatto, tasmā sattoti vuccati… vedanāya… saññāya… saṅkhāresu… viññāṇe yo chando yo rāgo yā nandī yā taṇhā, tatra satto, tatra visatto, tasmā sattoti vuccatī’’ti (saṃ. ni. 3.161)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ruḷhīsaddena pana vītarāgesupi ayaṃ vohāro vattatiyeva, vilīvamayepi bījanivisese tālavaṇṭavohāro viya. Akkharacintakā pana atthaṃ avicāretvā nāmamattametanti icchanti. Yepi atthaṃ vicārenti, te satvayogena sattāti icchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pāṇanatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāṇā,"
      },
      " assāsapassāsāyattavuttitāyāti attho. Bhūtattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhūtā,"
      },
      " saṃbhūtattā abhinibbattattāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pu"
      },
      "nti vuccati nirayo. Tasmiṃ galantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalā,"
      },
      " gacchantīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attabhāvo"
      },
      " vuccati sarīraṃ. Khandhapañcakameva vā, tamupādāya paññattimattasambhavato. Tasmiṃ attabhāve pariyāpannāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attabhāvapariyāpannā. Pariyāpannā"
      },
      "ti paricchinnā, antogadhāti attho."
    ],
    "innerText": "Pāṇanatāya pāṇā, assāsapassāsāyattavuttitāyāti attho. Bhūtattā bhūtā, saṃbhūtattā abhinibbattattāti attho. Punti vuccati nirayo. Tasmiṃ galantīti puggalā, gacchantīti attho. Attabhāvo vuccati sarīraṃ. Khandhapañcakameva vā, tamupādāya paññattimattasambhavato. Tasmiṃ attabhāve pariyāpannāti attabhāvapariyāpannā. Pariyāpannāti paricchinnā, antogadhāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā ",
      " ca sattāti vacanaṃ, evaṃ sesānipi ruḷhīvasena āropetvā sabbānetāni sabbasattavevacanānīti veditabbāni. Kāmañca aññānipi sabbe jantū sabbe jīvātiādīni sabbasattavevacanāni atthi, pākaṭavasena pana imāneva pañca gahetvā ‘‘pañcahākārehi anodhisopharaṇā mettā cetovimuttī’’ti vuttaṃ."
    ],
    "innerText": "Yathā ca sattāti vacanaṃ, evaṃ sesānipi ruḷhīvasena āropetvā sabbānetāni sabbasattavevacanānīti veditabbāni. Kāmañca aññānipi sabbe jantū sabbe jīvātiādīni sabbasattavevacanāni atthi, pākaṭavasena pana imāneva pañca gahetvā ‘‘pañcahākārehi anodhisopharaṇā mettā cetovimuttī’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ye pana sattā pāṇātiādīnaṃ na kevalaṃ vacanamattatova, atha kho atthatopi nānattameva ",
      " iccheyyuṃ, tesaṃ anodhisopharaṇā virujjhati, tasmā tathā atthaṃ agahetvā imesu pañcasu ākāresu aññataravasena anodhiso mettā pharitabbā."
    ],
    "innerText": "Ye pana sattā pāṇātiādīnaṃ na kevalaṃ vacanamattatova, atha kho atthatopi nānattameva iccheyyuṃ, tesaṃ anodhisopharaṇā virujjhati, tasmā tathā atthaṃ agahetvā imesu pañcasu ākāresu aññataravasena anodhiso mettā pharitabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "257"
      },
      ". Ettha ca sabbe sattā averā hontūti ayamekā appanā. Abyāpajjā hontūti ayamekā appanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abyāpajjā"
      },
      "ti byāpādarahitā. Anīghā hontūti ayamekā appanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anīghā"
      },
      "ti niddukkhā. Sukhī attānaṃ pariharantūti ayamekā appanā. Tasmā imesupi padesu yaṃ yaṃ pākaṭaṃ hoti, tassa tassa vasena mettā pharitabbā. Iti pañcasu ākāresu catunnaṃ appanānaṃ vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anodhisopharaṇe"
      },
      " vīsati appanā honti."
    ],
    "innerText": "257. Ettha ca sabbe sattā averā hontūti ayamekā appanā. Abyāpajjā hontūti ayamekā appanā. Abyāpajjāti byāpādarahitā. Anīghā hontūti ayamekā appanā. Anīghāti niddukkhā. Sukhī attānaṃ pariharantūti ayamekā appanā. Tasmā imesupi padesu yaṃ yaṃ pākaṭaṃ hoti, tassa tassa vasena mettā pharitabbā. Iti pañcasu ākāresu catunnaṃ appanānaṃ vasena anodhisopharaṇe vīsati appanā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Odhisopharaṇe"
      },
      " pana sattasu ākāresu catunnaṃ vasena aṭṭhavīsati. Ettha ca itthiyo purisāti liṅgavasena vuttaṃ. Ariyā anariyāti ariyaputhujjanavasena. Devā manussā vinipātikāti upapattivasena."
    ],
    "innerText": "Odhisopharaṇe pana sattasu ākāresu catunnaṃ vasena aṭṭhavīsati. Ettha ca itthiyo purisāti liṅgavasena vuttaṃ. Ariyā anariyāti ariyaputhujjanavasena. Devā manussā vinipātikāti upapattivasena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Disāpharaṇe"
      },
      " pana sabbe puratthimāya disāya sattātiādinā nayena ekamekissā disāya vīsati vīsati katvā dvesatāni, sabbā puratthimāya disāya itthiyotiādinā nayena ekamekissā disāya aṭṭhavīsati aṭṭhavīsati katvā asīti dvesatānīti cattāri satāni asīti ca appanā. Iti sabbānipi paṭisambhidāyaṃ vuttāni aṭṭhavīsādhikāni pañca appanāsatānīti."
    ],
    "innerText": "Disāpharaṇe pana sabbe puratthimāya disāya sattātiādinā nayena ekamekissā disāya vīsati vīsati katvā dvesatāni, sabbā puratthimāya disāya itthiyotiādinā nayena ekamekissā disāya aṭṭhavīsati aṭṭhavīsati katvā asīti dvesatānīti cattāri satāni asīti ca appanā. Iti sabbānipi paṭisambhidāyaṃ vuttāni aṭṭhavīsādhikāni pañca appanāsatānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iti etāsu appanāsu yassa kassaci vasena mettaṃ cetovimuttiṃ bhāvetvā ayaṃ yogāvacaro ‘‘sukhaṃ supatī’’tiādinā nayena vutte ekādasānisaṃse paṭilabhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "258"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhaṃ supatī"
      },
      "ti yathā sesā janā samparivattamānā kākacchamānā dukkhaṃ supanti, evaṃ asupitvā sukhaṃ supati. Niddaṃ okkantopi samāpattiṃ samāpanno viya hoti."
    ],
    "innerText": "258. Tattha sukhaṃ supatīti yathā sesā janā samparivattamānā kākacchamānā dukkhaṃ supanti, evaṃ asupitvā sukhaṃ supati. Niddaṃ okkantopi samāpattiṃ samāpanno viya hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhaṃ paṭibujjhatī"
      },
      "ti yathā aññe nitthunantā vijambhantā samparivattantā dukkhaṃ paṭibujjhanti, evaṃ appaṭibujjhitvā vikasamānamiva padumaṃ sukhaṃ nibbikāraṃ paṭibujjhati."
    ],
    "innerText": "Sukhaṃ paṭibujjhatīti yathā aññe nitthunantā vijambhantā samparivattantā dukkhaṃ paṭibujjhanti, evaṃ appaṭibujjhitvā vikasamānamiva padumaṃ sukhaṃ nibbikāraṃ paṭibujjhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāpakaṃ supinaṃ passatī"
      },
      "ti supinaṃ passantopi bhaddakameva supinaṃ passati, cetiyaṃ vandanto viya pūjaṃ karonto viya dhammaṃ suṇanto viya ca hoti. Yathā pana aññe attānaṃ corehi samparivāritaṃ viya vāḷehi upaddutaṃ viya papāte patantaṃ viya ca passanti, evaṃ pāpakaṃ supinaṃ na passati."
    ],
    "innerText": "Napāpakaṃ supinaṃ passatīti supinaṃ passantopi bhaddakameva supinaṃ passati, cetiyaṃ vandanto viya pūjaṃ karonto viya dhammaṃ suṇanto viya ca hoti. Yathā pana aññe attānaṃ corehi samparivāritaṃ viya vāḷehi upaddutaṃ viya papāte patantaṃ viya ca passanti, evaṃ pāpakaṃ supinaṃ na passati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manussānaṃ piyo hotī"
      },
      "ti ure āmuttamuttāhāro viya sīse piḷandhamālā viya ca manussānaṃ piyo hoti manāpo."
    ],
    "innerText": "Manussānaṃ piyo hotīti ure āmuttamuttāhāro viya sīse piḷandhamālā viya ca manussānaṃ piyo hoti manāpo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amanussānaṃ piyo hotī"
      },
      "ti yatheva manussānaṃ, evaṃ amanussānampi piyo hoti visākhatthero viya."
    ],
    "innerText": "Amanussānaṃ piyo hotīti yatheva manussānaṃ, evaṃ amanussānampi piyo hoti visākhatthero viya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So kira pāṭaliputte kuṭumbiyo ahosi. So tattheva vasamāno assosi ‘‘tambapaṇṇidīpo kira cetiyamālālaṅkato kāsāvapajjoto icchiticchitaṭṭhāneyeva ettha sakkā nisīdituṃ vā nipajjituṃ vā utusappāyaṃ senāsanasappāyaṃ puggalasappāyaṃ dhammassavanasappāyanti sabbamettha sulabha’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So attano bhogakkhandhaṃ puttadārassa niyyādetvā dussante baddhena ekakahāpaṇeneva gharā nikkhamitvā samuddatīre nāvaṃ udikkhamāno ekamāsaṃ vasi. So vohārakusalatāya imasmiṃ ṭhāne bhaṇḍaṃ kiṇitvā asukasmiṃ vikkiṇanto dhammikāya vaṇijjāya tenevantaramāsena sahassaṃ abhisaṃhari. Anupubbena mahāvihāraṃ āgantvā pabbajjaṃ yāci."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So ",
      " pabbājanatthāya sīmaṃ nīto taṃ sahassatthavikaṃ ovaṭṭikantarena bhūmiyaṃ pātesi. ‘‘Kimeta’’nti ca vutte ‘‘kahāpaṇasahassaṃ, bhante’’ti vatvā ‘‘upāsaka, pabbajitakālato paṭṭhāya na sakkā vicāretuṃ, idānevetaṃ vicārehī’’ti vutte ‘‘visākhassa pabbajjaṭṭhānamāgatā mā rittahatthā gamiṃsū’’ti muñcitvā sīmāmāḷake vippakiritvā pabbajitvā upasampanno."
    ],
    "innerText": "So pabbājanatthāya sīmaṃ nīto taṃ sahassatthavikaṃ ovaṭṭikantarena bhūmiyaṃ pātesi. ‘‘Kimeta’’nti ca vutte ‘‘kahāpaṇasahassaṃ, bhante’’ti vatvā ‘‘upāsaka, pabbajitakālato paṭṭhāya na sakkā vicāretuṃ, idānevetaṃ vicārehī’’ti vutte ‘‘visākhassa pabbajjaṭṭhānamāgatā mā rittahatthā gamiṃsū’’ti muñcitvā sīmāmāḷake vippakiritvā pabbajitvā upasampanno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So pañcavasso hutvā dvemātikā paguṇā katvā pavāretvā attano sappāyaṃ kammaṭṭhānaṃ gahetvā ",
      " ekekasmiṃ vihāre cattāro māse katvā samappavattavāsaṃ vasamāno cari. Evaṃ caramāno –"
    ],
    "innerText": "So pañcavasso hutvā dvemātikā paguṇā katvā pavāretvā attano sappāyaṃ kammaṭṭhānaṃ gahetvā ekekasmiṃ vihāre cattāro māse katvā samappavattavāsaṃ vasamāno cari. Evaṃ caramāno –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vanantare ṭhito thero, visākho gajjamānako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Attano guṇamesanto, imamatthaṃ abhāsatha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yāvatā upasampanno, yāvatā idha āgato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etthantare khalitaṃ natthi, aho lābhā te mārisā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So cittalapabbatavihāraṃ gacchanto dvedhā pathaṃ patvā ‘‘ayaṃ nu kho maggo udāhu aya’’nti cintayanto aṭṭhāsi. Athassa pabbate adhivatthā devatā hatthaṃ pasāretvā ‘‘esa maggo’’ti vatvā dasseti. So cittalapabbatavihāraṃ gantvā tattha cattāro māse vasitvā paccūse gamissāmīti cintetvā nipajji. Caṅkamasīse maṇilarukkhe adhivatthā devatā sopānaphalake nisīditvā parodi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Thero ‘‘ko eso’’ti āha. Ahaṃ, bhante, maṇiliyāti. Kissa rodasīti? Tumhākaṃ gamanaṃ paṭiccāti. Mayi idha vasante tumhākaṃ ko guṇoti? Tumhesu, bhante, idha vasantesu amanussā aññamaññaṃ mettaṃ paṭilabhanti, te dāni tumhesu gatesu kalahaṃ karissanti, duṭṭhullampi kathayissantīti. Thero ‘‘sace mayi idha vasante tumhākaṃ phāsuvihāro hoti, sundara’’nti vatvā aññepi cattāro māse tattheva vasitvā puna tatheva gamanacittaṃ uppādesi. Devatāpi puna tatheva parodi. Etenevupāyena thero tattheva vasitvā tattheva parinibbāyīti evaṃ mettāvihārī bhikkhu amanussānaṃ piyo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devatā rakkhantī"
      },
      "ti puttamiva mātāpitaro devatā rakkhanti."
    ],
    "innerText": "Devatā rakkhantīti puttamiva mātāpitaro devatā rakkhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāssa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aggi vā visaṃ vā satthaṃ vā kamatī"
      },
      "ti mettāvihārissa kāye uttarāya upāsikāya viya aggi vā, saṃyuttabhāṇakacūḷasivattherasseva visaṃ vā, saṃkiccasāmaṇerasseva satthaṃ vā na kamati, na pavisati. Nāssa kāyaṃ vikopetīti vuttaṃ hoti. Dhenuvatthumpi cettha kathayanti ",
      ". Ekā kira dhenu vacchakassa khīradhāraṃ muñcamānā aṭṭhāsi. Eko luddako taṃ vijjhissāmīti hatthena samparivattetvā dīghadaṇḍasattiṃ muñci. Sā tassā sarīraṃ āhacca tālapaṇṇaṃ viya pavaṭṭamānā gatā, neva upacārabalena, na appanābalena, kevalaṃ vacchake balavapiyacittatāya. Evaṃ mahānubhāvā mettāti."
    ],
    "innerText": "Nāssaaggi vā visaṃ vā satthaṃ vā kamatīti mettāvihārissa kāye uttarāya upāsikāya viya aggi vā, saṃyuttabhāṇakacūḷasivattherasseva visaṃ vā, saṃkiccasāmaṇerasseva satthaṃ vā na kamati, na pavisati. Nāssa kāyaṃ vikopetīti vuttaṃ hoti. Dhenuvatthumpi cettha kathayanti . Ekā kira dhenu vacchakassa khīradhāraṃ muñcamānā aṭṭhāsi. Eko luddako taṃ vijjhissāmīti hatthena samparivattetvā dīghadaṇḍasattiṃ muñci. Sā tassā sarīraṃ āhacca tālapaṇṇaṃ viya pavaṭṭamānā gatā, neva upacārabalena, na appanābalena, kevalaṃ vacchake balavapiyacittatāya. Evaṃ mahānubhāvā mettāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tuvaṭaṃ cittaṃ samādhiyatī"
      },
      "ti mettāvihārino khippameva cittaṃ samādhiyati, natthi tassa dandhāyitattaṃ."
    ],
    "innerText": "Tuvaṭaṃ cittaṃ samādhiyatīti mettāvihārino khippameva cittaṃ samādhiyati, natthi tassa dandhāyitattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mukhavaṇṇo vippasīdatī"
      },
      "ti bandhanā pavuttaṃ tālapakkaṃ viya cassa vippasannavaṇṇaṃ mukhaṃ hoti."
    ],
    "innerText": "Mukhavaṇṇo vippasīdatīti bandhanā pavuttaṃ tālapakkaṃ viya cassa vippasannavaṇṇaṃ mukhaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asammūḷho kālaṅkarotī"
      },
      "ti mettāvihārino sammohamaraṇaṃ nāma natthi, asammūḷhova niddaṃ okkamanto viya kālaṃ karoti."
    ],
    "innerText": "Asammūḷho kālaṅkarotīti mettāvihārino sammohamaraṇaṃ nāma natthi, asammūḷhova niddaṃ okkamanto viya kālaṃ karoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttarimappaṭivijjhanto"
      },
      "ti mettāsamāpattito uttariṃ arahattaṃ adhigantuṃ asakkonto ito cavitvā suttappabuddho viya brahmalokamupapajjatīti."
    ],
    "innerText": "Uttarimappaṭivijjhantoti mettāsamāpattito uttariṃ arahattaṃ adhigantuṃ asakkonto ito cavitvā suttappabuddho viya brahmalokamupapajjatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ mettābhāvanāyaṃ vitthārakathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Karuṇābhāvanākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "259"
      },
      ". Karuṇaṃ bhāvetukāmena pana nikkaruṇatāya ādīnavaṃ karuṇāya ca ānisaṃsaṃ paccavekkhitvā karuṇābhāvanā ārabhitabbā. Tañca pana ārabhantena paṭhamaṃ piyapuggalādīsu na ārabhitabbā. Piyo hi piyaṭṭhāneyeva tiṭṭhati. Atippiyasahāyako atippiyasahāyakaṭṭhāneyeva. Majjhatto majjhattaṭṭhāneyeva. Appiyo appiyaṭṭhāneyeva. Verī veriṭṭhāneyeva tiṭṭhati. Liṅgavisabhāgakālakatā akhettameva."
    ],
    "innerText": "259. Karuṇaṃ bhāvetukāmena pana nikkaruṇatāya ādīnavaṃ karuṇāya ca ānisaṃsaṃ paccavekkhitvā karuṇābhāvanā ārabhitabbā. Tañca pana ārabhantena paṭhamaṃ piyapuggalādīsu na ārabhitabbā. Piyo hi piyaṭṭhāneyeva tiṭṭhati. Atippiyasahāyako atippiyasahāyakaṭṭhāneyeva. Majjhatto majjhattaṭṭhāneyeva. Appiyo appiyaṭṭhāneyeva. Verī veriṭṭhāneyeva tiṭṭhati. Liṅgavisabhāgakālakatā akhettameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca bhikkhu karuṇāsahagatena cetasā ekaṃ disaṃ pharitvā viharati? Seyyathāpi nāma ekaṃ puggalaṃ duggataṃ durūpetaṃ disvā karuṇāyeyya, evameva ",
      " sabbasatte karuṇāya pharatī’’ti ",
      " vibhaṅge (vibha. 653) pana vuttattā sabbapaṭhamaṃ tāva kiñcideva karuṇāyitabbarūpaṃ paramakicchappattaṃ duggataṃ durūpetaṃ kapaṇapurisaṃ chinnāhāraṃ kapālaṃ purato ṭhapetvā anāthasālāya nisinnaṃ hatthapādehi paggharantakimigaṇaṃ aṭṭassaraṃ karontaṃ disvā ‘‘kicchaṃ vatāyaṃ satto āpanno, appeva nāma imamhā dukkhā mucceyyā’’ti karuṇā pavattetabbā. Taṃ alabhantena sukhitopi pāpakārī puggalo vajjhena upametvā karuṇāyitabbo."
    ],
    "innerText": "‘‘Kathañca bhikkhu karuṇāsahagatena cetasā ekaṃ disaṃ pharitvā viharati? Seyyathāpi nāma ekaṃ puggalaṃ duggataṃ durūpetaṃ disvā karuṇāyeyya, evameva sabbasatte karuṇāya pharatī’’ti vibhaṅge (vibha. 653) pana vuttattā sabbapaṭhamaṃ tāva kiñcideva karuṇāyitabbarūpaṃ paramakicchappattaṃ duggataṃ durūpetaṃ kapaṇapurisaṃ chinnāhāraṃ kapālaṃ purato ṭhapetvā anāthasālāya nisinnaṃ hatthapādehi paggharantakimigaṇaṃ aṭṭassaraṃ karontaṃ disvā ‘‘kicchaṃ vatāyaṃ satto āpanno, appeva nāma imamhā dukkhā mucceyyā’’ti karuṇā pavattetabbā. Taṃ alabhantena sukhitopi pāpakārī puggalo vajjhena upametvā karuṇāyitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ? Seyyathāpi saha bhaṇḍena gahitacoraṃ ‘‘vadhetha na’’nti rañño āṇāya rājapurisā bandhitvā catukke catukke pahārasatāni dentā āghātanaṃ nenti. Tassa manussā khādanīyampi bhojanīyampi mālāgandhavilepanatambulānipi denti. Kiñcāpi so tāni khādanto ceva paribhuñjanto ca sukhito bhogasamappito viya gacchati, atha kho taṃ neva koci ‘‘sukhito ayaṃ mahābhogo’’ti maññati, aññadatthu ‘‘ayaṃ varāko idāni marissati, yaṃ yadeva hi ayaṃ padaṃ nikkhipati, tena tena santike maraṇassa hotī’’ti taṃ jano karuṇāyati. Evameva karuṇākammaṭṭhānikena bhikkhunā sukhitopi puggalo evaṃ karuṇāyitabbo ‘‘ayaṃ varāko kiñcāpi idāni sukhito susajjito bhoge paribhuñjati, atha kho tīsu dvāresu ekenāpi katassa kalyāṇakammassa abhāvā idāni apāyesu anappakaṃ dukkhaṃ domanassaṃ paṭisaṃvedissatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ taṃ puggalaṃ karuṇāyitvā tato paraṃ eteneva upāyena piyapuggale, tato majjhatte, tato verimhīti anukkamena karuṇā pavattetabbā. Sace panassa pubbe vuttanayeneva verimhi paṭighaṃ uppajjati, taṃ mettāya vuttanayeneva vūpasametabbaṃ. Yopi cettha katakusalo hoti, tampi ñātirogabhogabyasanādīnaṃ aññatarena byasanena samannāgataṃ disvā vā sutvā vā tesaṃ abhāvepi vaṭṭadukkhaṃ anatikkantattā ‘‘dukkhitova aya’’nti evaṃ sabbathāpi karuṇāyitvā vuttanayeneva attani piyapuggale majjhatte verimhīti catūsu janesu sīmāsambhedaṃ katvā ",
      " taṃ nimittaṃ āsevantena bhāventena bahulīkarontena mettāya vuttanayeneva tikacatukkajjhānavasena appanā vaḍḍhetabbā."
    ],
    "innerText": "Evaṃ taṃ puggalaṃ karuṇāyitvā tato paraṃ eteneva upāyena piyapuggale, tato majjhatte, tato verimhīti anukkamena karuṇā pavattetabbā. Sace panassa pubbe vuttanayeneva verimhi paṭighaṃ uppajjati, taṃ mettāya vuttanayeneva vūpasametabbaṃ. Yopi cettha katakusalo hoti, tampi ñātirogabhogabyasanādīnaṃ aññatarena byasanena samannāgataṃ disvā vā sutvā vā tesaṃ abhāvepi vaṭṭadukkhaṃ anatikkantattā ‘‘dukkhitova aya’’nti evaṃ sabbathāpi karuṇāyitvā vuttanayeneva attani piyapuggale majjhatte verimhīti catūsu janesu sīmāsambhedaṃ katvā taṃ nimittaṃ āsevantena bhāventena bahulīkarontena mettāya vuttanayeneva tikacatukkajjhānavasena appanā vaḍḍhetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aṅguttaraṭṭhakathāyaṃ pana paṭhamaṃ veripuggalo karuṇāyitabbo, tasmiṃ cittaṃ muduṃ katvā duggato, tato piyapuggalo, tato attāti ayaṃ kamo vutto, so ‘‘duggataṃ durūpeta’’nti pāḷiyā ",
      " na sameti, tasmā vuttanayenevettha bhāvanamārabhitvā sīmāsambhedaṃ katvā appanā vaḍḍhetabbā. Tato paraṃ ‘‘pañcahākārehi anodhisopharaṇā sattahākārehi odhisopharaṇā dasahākārehi disāpharaṇā’’ti ayaṃ vikubbanā, ‘‘sukhaṃ supatī’’tiādayo ānisaṃsā ca mettāyaṃ vuttanayeneva veditabbāti."
    ],
    "innerText": "Aṅguttaraṭṭhakathāyaṃ pana paṭhamaṃ veripuggalo karuṇāyitabbo, tasmiṃ cittaṃ muduṃ katvā duggato, tato piyapuggalo, tato attāti ayaṃ kamo vutto, so ‘‘duggataṃ durūpeta’’nti pāḷiyā na sameti, tasmā vuttanayenevettha bhāvanamārabhitvā sīmāsambhedaṃ katvā appanā vaḍḍhetabbā. Tato paraṃ ‘‘pañcahākārehi anodhisopharaṇā sattahākārehi odhisopharaṇā dasahākārehi disāpharaṇā’’ti ayaṃ vikubbanā, ‘‘sukhaṃ supatī’’tiādayo ānisaṃsā ca mettāyaṃ vuttanayeneva veditabbāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ karuṇābhāvanāya vitthārakathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Muditābhāvanākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "260"
      },
      ". Muditābhāvanaṃ ārabhantenāpi na paṭhamaṃ piyapuggalādīsu ārabhitabbā. Na hi piyo piyabhāvamatteneva muditāya padaṭṭhānaṃ hoti, pageva majjhattaverino. Liṅgavisabhāgakālakatā akhettameva."
    ],
    "innerText": "260. Muditābhāvanaṃ ārabhantenāpi na paṭhamaṃ piyapuggalādīsu ārabhitabbā. Na hi piyo piyabhāvamatteneva muditāya padaṭṭhānaṃ hoti, pageva majjhattaverino. Liṅgavisabhāgakālakatā akhettameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atippiyasahāyako pana siyā padaṭṭhānaṃ, yo aṭṭhakathāyaṃ soṇḍasahāyoti vutto. So hi muditamuditova hoti, paṭhamaṃ hasitvā pacchā katheti, tasmā so vā paṭhamaṃ muditāya pharitabbo. Piyapuggalaṃ vā sukhitaṃ sajjitaṃ modamānaṃ disvā vā sutvā vā ‘‘modati vatāyaṃ satto, aho sādhu aho suṭṭhū’’ti muditā uppādetabbā. Imameva hi atthavasaṃ paṭicca vibhaṅge (vibha. 663) vuttaṃ ‘‘kathañca bhikkhu muditāsahagatena cetasā ekaṃ disaṃ pharitvā viharati? Seyyathāpi nāma ekaṃ puggalaṃ piyaṃ manāpaṃ disvā mudito assa, evameva sabbasatte muditāya pharatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sacepissa so soṇḍasahāyo vā piyapuggalo vā atīte sukhito ahosi, sampati pana duggato durūpeto, atītameva cassa sukhitabhāvaṃ anussaritvā ‘‘esa atīte evaṃ mahābhogo mahāparivāro niccappamudito ahosī’’ti tamevassa muditākāraṃ gahetvā muditā uppādetabbā ‘‘anāgate vā pana puna taṃ sampattiṃ labhitvā ",
      " hatthikkhandhaassapiṭṭhisuvaṇṇasivikādīhi vicarissatī’’ti anāgatampissa muditākāraṃ gahetvā muditā uppādetabbā."
    ],
    "innerText": "Sacepissa so soṇḍasahāyo vā piyapuggalo vā atīte sukhito ahosi, sampati pana duggato durūpeto, atītameva cassa sukhitabhāvaṃ anussaritvā ‘‘esa atīte evaṃ mahābhogo mahāparivāro niccappamudito ahosī’’ti tamevassa muditākāraṃ gahetvā muditā uppādetabbā ‘‘anāgate vā pana puna taṃ sampattiṃ labhitvā hatthikkhandhaassapiṭṭhisuvaṇṇasivikādīhi vicarissatī’’ti anāgatampissa muditākāraṃ gahetvā muditā uppādetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ piyapuggale muditaṃ uppādetvā atha majjhatte tato verimhīti anukkamena muditā pavattetabbā. Appanā vaḍḍhetabbā. Sace panassa pubbe vuttanayeneva verimhi paṭighaṃ uppajjati, taṃ ",
      " mettāyaṃ vuttanayeneva vūpasametvā ‘‘imesu ca tīsu attani cā’’ti catūsu janesu samacittatāya sīmāsambhedaṃ katvā taṃ nimittaṃ āsevantena bhāventena bahulīkarontena mettāyaṃ vuttanayeneva tikacatukkajjhānavaseneva appanā vaḍḍhetabbā. Tato paraṃ ‘‘pañcahākārehi anodhisopharaṇā sattahākārehi odhisopharaṇā dasahākārehi disāpharaṇā’’ti ayaṃ vikubbanā, ‘‘sukhaṃ supatī’’tiādayo ānisaṃsā ca mettāyaṃ vuttanayeneva veditabbāti."
    ],
    "innerText": "Evaṃ piyapuggale muditaṃ uppādetvā atha majjhatte tato verimhīti anukkamena muditā pavattetabbā. Appanā vaḍḍhetabbā. Sace panassa pubbe vuttanayeneva verimhi paṭighaṃ uppajjati, taṃ mettāyaṃ vuttanayeneva vūpasametvā ‘‘imesu ca tīsu attani cā’’ti catūsu janesu samacittatāya sīmāsambhedaṃ katvā taṃ nimittaṃ āsevantena bhāventena bahulīkarontena mettāyaṃ vuttanayeneva tikacatukkajjhānavaseneva appanā vaḍḍhetabbā. Tato paraṃ ‘‘pañcahākārehi anodhisopharaṇā sattahākārehi odhisopharaṇā dasahākārehi disāpharaṇā’’ti ayaṃ vikubbanā, ‘‘sukhaṃ supatī’’tiādayo ānisaṃsā ca mettāyaṃ vuttanayeneva veditabbāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ muditābhāvanāya vitthārakathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Upekkhābhāvanākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "261"
      },
      ". Upekkhābhāvanaṃ bhāvetukāmena pana mettādīsu paṭiladdhatikacatukkajjhānena paguṇatatiyajjhānā vuṭṭhāya ‘‘sukhitā hontū’’tiādivasena sattakelāyanamanasikārayuttattā, paṭighānunayasamīpacārittā, somanassayogena oḷārikattā ca purimāsu ādīnavaṃ, santasabhāvattā upekkhāya ānisaṃsañca disvā yvāssa pakatimajjhatto puggalo, taṃ ajjhupekkhitvā upekkhā uppādetabbā. Tato piyapuggalādīsu. Vuttañhetaṃ ‘‘kathañca bhikkhu upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati? Seyyathāpi nāma ekaṃ puggalaṃ neva manāpaṃ na amanāpaṃ disvā upekkhako assa, evameva sabbe satte upekkhāya pharatī’’ti (vibha. 673)."
    ],
    "innerText": "261. Upekkhābhāvanaṃ bhāvetukāmena pana mettādīsu paṭiladdhatikacatukkajjhānena paguṇatatiyajjhānā vuṭṭhāya ‘‘sukhitā hontū’’tiādivasena sattakelāyanamanasikārayuttattā, paṭighānunayasamīpacārittā, somanassayogena oḷārikattā ca purimāsu ādīnavaṃ, santasabhāvattā upekkhāya ānisaṃsañca disvā yvāssa pakatimajjhatto puggalo, taṃ ajjhupekkhitvā upekkhā uppādetabbā. Tato piyapuggalādīsu. Vuttañhetaṃ ‘‘kathañca bhikkhu upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati? Seyyathāpi nāma ekaṃ puggalaṃ neva manāpaṃ na amanāpaṃ disvā upekkhako assa, evameva sabbe satte upekkhāya pharatī’’ti (vibha. 673)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmā vuttanayena majjhattapuggale upekkhaṃ uppādetvā atha piyapuggale, tato soṇḍasahāyake, tato verimhīti evaṃ ‘‘imesu ca tīsu attani cā’’ti sabbattha majjhattavasena sīmāsambhedaṃ katvā taṃ nimittaṃ āsevitabbaṃ bhāvetabbaṃ bahulīkātabbaṃ. Tassevaṃ karoto pathavīkasiṇe vuttanayeneva catutthajjhānaṃ uppajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kiṃ ",
      " panetaṃ pathavīkasiṇādīsu uppannatatiyajjhānassāpi uppajjatīti? Nuppajjati. Kasmā? Ārammaṇavisabhāgatāya. Mettādīsu uppannatatiyajjhānasseva pana uppajjati, ārammaṇasabhāgatāyāti. Tato paraṃ pana vikubbanā ca ānisaṃsapaṭilābho ca mettāyaṃ vuttanayeneva veditabboti."
    ],
    "innerText": "Kiṃ panetaṃ pathavīkasiṇādīsu uppannatatiyajjhānassāpi uppajjatīti? Nuppajjati. Kasmā? Ārammaṇavisabhāgatāya. Mettādīsu uppannatatiyajjhānasseva pana uppajjati, ārammaṇasabhāgatāyāti. Tato paraṃ pana vikubbanā ca ānisaṃsapaṭilābho ca mettāyaṃ vuttanayeneva veditabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayaṃ ",
      " upekkhābhāvanāya vitthārakathā."
    ],
    "innerText": "Ayaṃ upekkhābhāvanāya vitthārakathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pakiṇṇakakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "262"
      },
      "."
    ],
    "innerText": "262."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Brahmuttamena kathite, brahmavihāre ime iti viditvā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhiyyo etesu ayaṃ, pakiṇṇakakathāpi viññeyyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Etāsu hi mettākaruṇāmuditāupekkhāsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthato"
      },
      " tāva mejjatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mettā,"
      },
      " siniyhatīti attho. Mitte vā bhavā, mittassa vā esā pavattītipi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mettā"
      },
      ". Paradukkhe sati sādhūnaṃ hadayakampanaṃ karotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karuṇā"
      },
      ". Kiṇāti vā paradukkhaṃ hiṃsati vināsetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karuṇā"
      },
      ". Kiriyati vā dukkhitesu pharaṇavasena pasāriyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karuṇā"
      },
      ". Modanti tāya taṃsamaṅgino, sayaṃ vā modati, modanamattameva vā tanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "muditā"
      },
      ". ‘‘Averā hontū’’tiādibyāpārappahānena majjhattabhāvūpagamanena ca upekkhatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upekkhā"
      },
      "."
    ],
    "innerText": "Etāsu hi mettākaruṇāmuditāupekkhāsu atthato tāva mejjatīti mettā, siniyhatīti attho. Mitte vā bhavā, mittassa vā esā pavattītipi mettā. Paradukkhe sati sādhūnaṃ hadayakampanaṃ karotīti karuṇā. Kiṇāti vā paradukkhaṃ hiṃsati vināsetīti karuṇā. Kiriyati vā dukkhitesu pharaṇavasena pasāriyatīti karuṇā. Modanti tāya taṃsamaṅgino, sayaṃ vā modati, modanamattameva vā tanti muditā. ‘‘Averā hontū’’tiādibyāpārappahānena majjhattabhāvūpagamanena ca upekkhatīti upekkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "263"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇādito"
      },
      " panettha hitākārappavattilakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mettā,"
      },
      " hitūpasaṃhārarasā, āghātavinayapaccupaṭṭhānā, sattānaṃ manāpabhāvadassanapadaṭṭhānā. Byāpādūpasamo etissā sampatti, sinehasambhavo vipatti. Dukkhāpanayanākārappavattilakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karuṇā,"
      },
      " paradukkhāsahanarasā, avihiṃsāpaccupaṭṭhānā, dukkhābhibhūtānaṃ anāthabhāvadassanapadaṭṭhānā. Vihiṃsūpasamo tassā sampatti, sokasambhavo vipatti. Pamodanalakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "muditā,"
      },
      " anissāyanarasā, arativighātapaccupaṭṭhānā, sattānaṃ sampattidassanapadaṭṭhānā. Arativūpasamo tassā sampatti, pahāsasambhavo vipatti. Sattesu majjhattākārappavattilakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upekkhā,"
      },
      " sattesu samabhāvadassanarasā, paṭighānunayavūpasamapaccupaṭṭhānā, ‘‘kammassakā sattā, te kassa ",
      " ruciyā sukhitā vā bhavissanti, dukkhato vā muccissanti, pattasampattito vā na parihāyissantī’’ti evaṃ pavattakammassakatādassanapadaṭṭhānā. Paṭighānunayavūpasamo tassā sampatti, gehasitāya aññāṇupekkhāya sambhavo vipatti."
    ],
    "innerText": "263.Lakkhaṇādito panettha hitākārappavattilakkhaṇā mettā, hitūpasaṃhārarasā, āghātavinayapaccupaṭṭhānā, sattānaṃ manāpabhāvadassanapadaṭṭhānā. Byāpādūpasamo etissā sampatti, sinehasambhavo vipatti. Dukkhāpanayanākārappavattilakkhaṇā karuṇā, paradukkhāsahanarasā, avihiṃsāpaccupaṭṭhānā, dukkhābhibhūtānaṃ anāthabhāvadassanapadaṭṭhānā. Vihiṃsūpasamo tassā sampatti, sokasambhavo vipatti. Pamodanalakkhaṇā muditā, anissāyanarasā, arativighātapaccupaṭṭhānā, sattānaṃ sampattidassanapadaṭṭhānā. Arativūpasamo tassā sampatti, pahāsasambhavo vipatti. Sattesu majjhattākārappavattilakkhaṇā upekkhā, sattesu samabhāvadassanarasā, paṭighānunayavūpasamapaccupaṭṭhānā, ‘‘kammassakā sattā, te kassa ruciyā sukhitā vā bhavissanti, dukkhato vā muccissanti, pattasampattito vā na parihāyissantī’’ti evaṃ pavattakammassakatādassanapadaṭṭhānā. Paṭighānunayavūpasamo tassā sampatti, gehasitāya aññāṇupekkhāya sambhavo vipatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "264"
      },
      ". Catunnampi panetesaṃ brahmavihārānaṃ vipassanāsukhañceva bhavasampatti ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sādhāraṇappayojanaṃ"
      },
      ". Byāpādādipaṭighāto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āveṇikaṃ"
      },
      ". Byāpādapaṭighātappayojanā hettha mettā. Vihiṃsāaratirāgapaṭighātappayojanā itarā. Vuttampi cetaṃ –"
    ],
    "innerText": "264. Catunnampi panetesaṃ brahmavihārānaṃ vipassanāsukhañceva bhavasampatti ca sādhāraṇappayojanaṃ. Byāpādādipaṭighāto āveṇikaṃ. Byāpādapaṭighātappayojanā hettha mettā. Vihiṃsāaratirāgapaṭighātappayojanā itarā. Vuttampi cetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Nissaraṇañhetaṃ, āvuso, byāpādassa yadidaṃ mettā cetovimutti. Nissaraṇañhetaṃ, āvuso, vihesāya yadidaṃ karuṇā cetovimutti. Nissaraṇañhetaṃ, āvuso, aratiyā yadidaṃ muditā cetovimutti. Nissaraṇañhetaṃ, āvuso, rāgassa yadidaṃ upekkhā cetovimuttī’’ti (dī. ni. 3.326; a. ni. 6.13)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "265"
      },
      ". Ekekassa cettha āsannadūravasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dve dve paccatthikā. Mettābrahmavihārassa"
      },
      " hi samīpacāro viya purisassa sapatto guṇadassanasabhāgatāya rāgo āsannapaccatthiko, so lahuṃ otāraṃ labhati, tasmā tato suṭṭhu mettā rakkhitabbā. Pabbatādigahananissito viya purisassa sapatto sabhāgavisabhāgatāya byāpādo dūrapaccatthiko, tasmā tato nibbhayena mettāyitabbaṃ. Mettāyissati ca nāma, kopañca karissatīti aṭṭhānametaṃ."
    ],
    "innerText": "265. Ekekassa cettha āsannadūravasena dve dve paccatthikā. Mettābrahmavihārassa hi samīpacāro viya purisassa sapatto guṇadassanasabhāgatāya rāgo āsannapaccatthiko, so lahuṃ otāraṃ labhati, tasmā tato suṭṭhu mettā rakkhitabbā. Pabbatādigahananissito viya purisassa sapatto sabhāgavisabhāgatāya byāpādo dūrapaccatthiko, tasmā tato nibbhayena mettāyitabbaṃ. Mettāyissati ca nāma, kopañca karissatīti aṭṭhānametaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Karuṇābrahmavihārassa"
      },
      " ‘‘cakkhuviññeyyānaṃ rūpānaṃ iṭṭhānaṃ kantānaṃ manāpānaṃ manoramānaṃ lokāmisapaṭisaṃyuttānaṃ appaṭilābhaṃ vā appaṭilābhato samanupassato pubbe vā paṭiladdhapubbaṃ atītaṃ niruddhaṃ vipariṇataṃ samanussarato uppajjati domanassaṃ, yaṃ evarūpaṃ domanassaṃ, idaṃ vuccati gehasitaṃ domanassa’’ntiādinā (ma. ni. 3.307) nayena āgataṃ gehasitaṃ domanassaṃ vipattidassanasabhāgatāya āsannapaccatthikaṃ. Sabhāgavisabhāgatāya vihiṃsā dūrapaccatthikā ",
      ". Tasmā tato nibbhayena karuṇāyitabbaṃ. Karuṇañca nāma karissati, pāṇiādīhi ca viheṭhissatīti aṭṭhānametaṃ."
    ],
    "innerText": "Karuṇābrahmavihārassa ‘‘cakkhuviññeyyānaṃ rūpānaṃ iṭṭhānaṃ kantānaṃ manāpānaṃ manoramānaṃ lokāmisapaṭisaṃyuttānaṃ appaṭilābhaṃ vā appaṭilābhato samanupassato pubbe vā paṭiladdhapubbaṃ atītaṃ niruddhaṃ vipariṇataṃ samanussarato uppajjati domanassaṃ, yaṃ evarūpaṃ domanassaṃ, idaṃ vuccati gehasitaṃ domanassa’’ntiādinā (ma. ni. 3.307) nayena āgataṃ gehasitaṃ domanassaṃ vipattidassanasabhāgatāya āsannapaccatthikaṃ. Sabhāgavisabhāgatāya vihiṃsā dūrapaccatthikā . Tasmā tato nibbhayena karuṇāyitabbaṃ. Karuṇañca nāma karissati, pāṇiādīhi ca viheṭhissatīti aṭṭhānametaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muditābrahmavihārassa"
      },
      " ‘‘cakkhuviññeyyānaṃ rūpānaṃ iṭṭhānaṃ…pe… lokāmisapaṭisaṃyuttānaṃ paṭilābhaṃ vā paṭilābhato samanupassato pubbe vā paṭiladdhapubbaṃ atītaṃ niruddhaṃ vipariṇataṃ samanussarato uppajjati somanassaṃ, yaṃ evarūpaṃ somanassaṃ, idaṃ vuccati gehasitaṃ somanassa’’ntiādinā (ma. ni. 3.306) nayena āgataṃ gehasitaṃ somanassaṃ sampattidassanasabhāgatāya āsannapaccatthikaṃ, sabhāgavisabhāgatāya arati dūrapaccatthikā. Tasmā tato ",
      " nibbhayena muditā bhāvetabbā. Mudito ca nāma bhavissati, pantasenāsanesu ca adhikusalesu dhammesu vā ukkaṇṭhissatīti aṭṭhānametaṃ."
    ],
    "innerText": "Muditābrahmavihārassa ‘‘cakkhuviññeyyānaṃ rūpānaṃ iṭṭhānaṃ…pe… lokāmisapaṭisaṃyuttānaṃ paṭilābhaṃ vā paṭilābhato samanupassato pubbe vā paṭiladdhapubbaṃ atītaṃ niruddhaṃ vipariṇataṃ samanussarato uppajjati somanassaṃ, yaṃ evarūpaṃ somanassaṃ, idaṃ vuccati gehasitaṃ somanassa’’ntiādinā (ma. ni. 3.306) nayena āgataṃ gehasitaṃ somanassaṃ sampattidassanasabhāgatāya āsannapaccatthikaṃ, sabhāgavisabhāgatāya arati dūrapaccatthikā. Tasmā tato nibbhayena muditā bhāvetabbā. Mudito ca nāma bhavissati, pantasenāsanesu ca adhikusalesu dhammesu vā ukkaṇṭhissatīti aṭṭhānametaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upekkhābrahmavihārassa"
      },
      " pana ‘‘cakkhunā rūpaṃ disvā uppajjati upekkhā bālassa mūḷhassa puthujjanassa anodhijinassa avipākajinassa anādīnavadassāvino assutavato puthujjanassa yā evarūpā upekkhā, rūpaṃ sā nātivattati. Tasmā sā upekkhā gehasitāti vuccatī’’tiādinā (ma. ni. 3.308) nayena āgatā gehasitā aññāṇupekkhā dosaguṇāvicāraṇavasena sabhāgattā āsannapaccatthikā. Sabhāgavisabhāgatāya rāgapaṭighā dūrapaccatthikā. Tasmā tato nibbhayena upekkhitabbaṃ. Upekkhissati ca nāma, rajjissati ca paṭihaññissati cāti aṭṭhānametaṃ."
    ],
    "innerText": "Upekkhābrahmavihārassa pana ‘‘cakkhunā rūpaṃ disvā uppajjati upekkhā bālassa mūḷhassa puthujjanassa anodhijinassa avipākajinassa anādīnavadassāvino assutavato puthujjanassa yā evarūpā upekkhā, rūpaṃ sā nātivattati. Tasmā sā upekkhā gehasitāti vuccatī’’tiādinā (ma. ni. 3.308) nayena āgatā gehasitā aññāṇupekkhā dosaguṇāvicāraṇavasena sabhāgattā āsannapaccatthikā. Sabhāgavisabhāgatāya rāgapaṭighā dūrapaccatthikā. Tasmā tato nibbhayena upekkhitabbaṃ. Upekkhissati ca nāma, rajjissati ca paṭihaññissati cāti aṭṭhānametaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "266"
      },
      ". Sabbesampi ca etesaṃ kattukāmatā chando ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi,"
      },
      " nīvaraṇādivikkhambhanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "majjhaṃ,"
      },
      " appanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariyosānaṃ"
      },
      ". Paññattidhammavasena eko vā satto aneke vā sattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇaṃ"
      },
      ". Upacāre vā appanāya vā pattāya ārammaṇavaḍḍhanaṃ."
    ],
    "innerText": "266. Sabbesampi ca etesaṃ kattukāmatā chando ādi, nīvaraṇādivikkhambhanaṃ majjhaṃ, appanā pariyosānaṃ. Paññattidhammavasena eko vā satto aneke vā sattā ārammaṇaṃ. Upacāre vā appanāya vā pattāya ārammaṇavaḍḍhanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ vaḍḍhanakkamo, yathā hi kusalo kassako kasitabbaṭṭhānaṃ paricchinditvā kasati, evaṃ paṭhamameva ekamāvāsaṃ paricchinditvā tattha sattesu imasmiṃ āvāse sattā averā hontūtiādinā nayena mettā bhāvetabbā. Tattha cittaṃ muduṃ kammaniyaṃ katvā dve āvāsā paricchinditabbā. Tato anukkamena tayo, cattāro, pañca, cha, satta, aṭṭha, nava, dasa, ekā racchā, upaḍḍhagāmo, gāmo, janapado, rajjaṃ, ekā disāti evaṃ yāva ekaṃ cakkavāḷaṃ, tato vā pana bhiyyo tattha tattha sattesu mettā ",
      " bhāvetabbā. Tathā karuṇādayoti ayamettha ārammaṇavaḍḍhanakkamo."
    ],
    "innerText": "Tatrāyaṃ vaḍḍhanakkamo, yathā hi kusalo kassako kasitabbaṭṭhānaṃ paricchinditvā kasati, evaṃ paṭhamameva ekamāvāsaṃ paricchinditvā tattha sattesu imasmiṃ āvāse sattā averā hontūtiādinā nayena mettā bhāvetabbā. Tattha cittaṃ muduṃ kammaniyaṃ katvā dve āvāsā paricchinditabbā. Tato anukkamena tayo, cattāro, pañca, cha, satta, aṭṭha, nava, dasa, ekā racchā, upaḍḍhagāmo, gāmo, janapado, rajjaṃ, ekā disāti evaṃ yāva ekaṃ cakkavāḷaṃ, tato vā pana bhiyyo tattha tattha sattesu mettā bhāvetabbā. Tathā karuṇādayoti ayamettha ārammaṇavaḍḍhanakkamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "267"
      },
      ". Yathā pana kasiṇānaṃ nissando āruppā, samādhinissando nevasaññānāsaññāyatanaṃ, vipassanānissando phalasamāpatti, samathavipassanānissando nirodhasamāpatti, evaṃ purimabrahmavihārattayanissando ettha upekkhābrahmavihāro. Yathā hi thambhe anussāpetvā tulāsaṅghāṭaṃ anāropetvā na sakkā ākāse kūṭagopānasiyo ṭhapetuṃ, evaṃ purimesu tatiyajjhānaṃ vinā na sakkā catutthaṃ bhāvetunti."
    ],
    "innerText": "267. Yathā pana kasiṇānaṃ nissando āruppā, samādhinissando nevasaññānāsaññāyatanaṃ, vipassanānissando phalasamāpatti, samathavipassanānissando nirodhasamāpatti, evaṃ purimabrahmavihārattayanissando ettha upekkhābrahmavihāro. Yathā hi thambhe anussāpetvā tulāsaṅghāṭaṃ anāropetvā na sakkā ākāse kūṭagopānasiyo ṭhapetuṃ, evaṃ purimesu tatiyajjhānaṃ vinā na sakkā catutthaṃ bhāvetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "268"
      },
      ". Ettha ",
      " siyā, kasmā panetā mettākaruṇāmuditāupekkhā brahmavihārāti vuccanti? Kasmā ca catassova? Ko ca etāsaṃ kamo, abhidhamme ca kasmā appamaññāti vuttāti? Vuccate, seṭṭhaṭṭhena tāva niddosabhāvena cettha brahmavihāratā veditabbā. Sattesu sammāpaṭipattibhāvena hi seṭṭhā ete vihārā. Yathā ca brahmāno niddosacittā viharanti, evaṃ etehi sampayuttā yogino brahmasamā hutvā viharantīti seṭṭhaṭṭhena niddosabhāvena ca brahmavihārāti vuccanti."
    ],
    "innerText": "268. Ettha siyā, kasmā panetā mettākaruṇāmuditāupekkhā brahmavihārāti vuccanti? Kasmā ca catassova? Ko ca etāsaṃ kamo, abhidhamme ca kasmā appamaññāti vuttāti? Vuccate, seṭṭhaṭṭhena tāva niddosabhāvena cettha brahmavihāratā veditabbā. Sattesu sammāpaṭipattibhāvena hi seṭṭhā ete vihārā. Yathā ca brahmāno niddosacittā viharanti, evaṃ etehi sampayuttā yogino brahmasamā hutvā viharantīti seṭṭhaṭṭhena niddosabhāvena ca brahmavihārāti vuccanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "269"
      },
      ". Kasmā ca catassovātiādi pañhassa pana idaṃ vissajjanaṃ."
    ],
    "innerText": "269. Kasmā ca catassovātiādi pañhassa pana idaṃ vissajjanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Visuddhimaggādivasā catasso,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Hitādiākāravasā panāsaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Kamo pavattanti ca appamāṇe,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tā gocare yena tadappamaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Etāsu hi yasmā mettā byāpādabahulassa, karuṇā vihesābahulassa, muditā aratibahulassa, upekkhā rāgabahulassa visuddhimaggo. Yasmā ca hitūpasaṃhāraahitāpanayanasampattimodanaanābhogavasena catubbidhoyeva sattesu manasikāro. Yasmā ca yathā mātā daharagilānayobbanappattasakiccapasutesu catūsu puttesu daharassa abhivuḍḍhikāmā hoti, gilānassa gelaññāpanayanakāmā, yobbanappattassa yobbanasampattiyā ciraṭṭhitikāmā, sakakiccapasutassa kismiñci pariyāye abyāvaṭā hoti, tathā appamaññāvihārikenāpi sabbasattesu mettādivasena bhavitabbaṃ. Tasmā ito visuddhimaggādivasā catassova appamaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yasmā ",
      " catassopetā bhāvetukāmena paṭhamaṃ hitākārappavattivasena sattesu paṭipajjitabbaṃ, hitākārappavattilakkhaṇā ca mettā. Tato evaṃ patthitahitānaṃ sattānaṃ dukkhābhibhavaṃ disvā vā sutvā vā sambhāvetvā vā dukkhāpanayanākārappavattivasena, dukkhāpanayanākārappavattilakkhaṇā ca karuṇā. Athevaṃ patthitahitānaṃ patthitadukkhāpagamānañca nesaṃ sampattiṃ disvā sampattipamodanavasena, pamodanalakkhaṇā ca muditā. Tato paraṃ pana kattabbābhāvato ajjhupekkhakattasaṅkhātena majjhattākārena paṭipajjitabbaṃ, majjhattākārappavattilakkhaṇā ca upekkhā ",
      ". Tasmā ito hitādiākāravasā panāsaṃ paṭhamaṃ mettā vuttā, atha karuṇā muditā upekkhāti ayaṃ kamo veditabbo."
    ],
    "innerText": "Yasmā catassopetā bhāvetukāmena paṭhamaṃ hitākārappavattivasena sattesu paṭipajjitabbaṃ, hitākārappavattilakkhaṇā ca mettā. Tato evaṃ patthitahitānaṃ sattānaṃ dukkhābhibhavaṃ disvā vā sutvā vā sambhāvetvā vā dukkhāpanayanākārappavattivasena, dukkhāpanayanākārappavattilakkhaṇā ca karuṇā. Athevaṃ patthitahitānaṃ patthitadukkhāpagamānañca nesaṃ sampattiṃ disvā sampattipamodanavasena, pamodanalakkhaṇā ca muditā. Tato paraṃ pana kattabbābhāvato ajjhupekkhakattasaṅkhātena majjhattākārena paṭipajjitabbaṃ, majjhattākārappavattilakkhaṇā ca upekkhā . Tasmā ito hitādiākāravasā panāsaṃ paṭhamaṃ mettā vuttā, atha karuṇā muditā upekkhāti ayaṃ kamo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yasmā pana sabbāpetā appamāṇe gocare pavattanti. Appamāṇā hi sattā etāsaṃ gocarabhūtā. Ekasattassāpi ca ettake padese mettādayo bhāvetabbāti evaṃ pamāṇaṃ agahetvā sakalapharaṇavaseneva pavattāti. Tena vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Visuddhimaggādivasā catasso,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Hitādiākāravasā panāsaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Kamo pavattanti ca appamāṇe,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tā gocare yena tadappamaññāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "270"
      },
      ". Evaṃ appamāṇagocaratāya ekalakkhaṇāsu cāpi etāsu purimā tisso tikacatukkajjhānikāva honti. Kasmā? Somanassāvippayogato. Kasmā panāyaṃ somanassena avippayogoti? Domanassasamuṭṭhitānaṃ byāpādādīnaṃ nissaraṇattā. Pacchimā pana avasesaekajjhānikāva. Kasmā? Upekkhāvedanāsampayogato. Na hi sattesu majjhattākārappavattā brahmavihārupekkhā upekkhāvedanaṃ vinā vattatīti."
    ],
    "innerText": "270. Evaṃ appamāṇagocaratāya ekalakkhaṇāsu cāpi etāsu purimā tisso tikacatukkajjhānikāva honti. Kasmā? Somanassāvippayogato. Kasmā panāyaṃ somanassena avippayogoti? Domanassasamuṭṭhitānaṃ byāpādādīnaṃ nissaraṇattā. Pacchimā pana avasesaekajjhānikāva. Kasmā? Upekkhāvedanāsampayogato. Na hi sattesu majjhattākārappavattā brahmavihārupekkhā upekkhāvedanaṃ vinā vattatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "271"
      },
      ". Yo panevaṃ vadeyya ‘‘yasmā bhagavatā aṭṭhakanipāte catūsupi appamaññāsu avisesena vuttaṃ ‘tato tvaṃ bhikkhu imaṃ samādhiṃ savitakkampi savicāraṃ bhāveyyāsi, avitakkampi vicāramattaṃ bhāveyyāsi, avitakkampi avicāraṃ bhāveyyāsi, sappītikampi bhāveyyāsi, nippītikampi bhāveyyāsi, sātasahagatampi bhāveyyāsi, upekkhāsahagatampi bhāveyyāsī’ti (a. ni. 8.63), tasmā ",
      " catasso appamaññā catukkapañcakajjhānikā’’ti. So māhevantissa vacanīyo. Evañhi sati kāyānupassanādayopi catukkapañcakajjhānikā siyuṃ, vedanādīsu ca paṭhamajjhānampi natthi, pageva dutiyādīni. Tasmā byañjanacchāyāmattaṃ gahetvā mā bhagavantaṃ abbhācikkhi, gambhīraṃ hi buddhavacanaṃ, taṃ ācariye payirupāsitvā adhippāyato gahetabbaṃ."
    ],
    "innerText": "271. Yo panevaṃ vadeyya ‘‘yasmā bhagavatā aṭṭhakanipāte catūsupi appamaññāsu avisesena vuttaṃ ‘tato tvaṃ bhikkhu imaṃ samādhiṃ savitakkampi savicāraṃ bhāveyyāsi, avitakkampi vicāramattaṃ bhāveyyāsi, avitakkampi avicāraṃ bhāveyyāsi, sappītikampi bhāveyyāsi, nippītikampi bhāveyyāsi, sātasahagatampi bhāveyyāsi, upekkhāsahagatampi bhāveyyāsī’ti (a. ni. 8.63), tasmā catasso appamaññā catukkapañcakajjhānikā’’ti. So māhevantissa vacanīyo. Evañhi sati kāyānupassanādayopi catukkapañcakajjhānikā siyuṃ, vedanādīsu ca paṭhamajjhānampi natthi, pageva dutiyādīni. Tasmā byañjanacchāyāmattaṃ gahetvā mā bhagavantaṃ abbhācikkhi, gambhīraṃ hi buddhavacanaṃ, taṃ ācariye payirupāsitvā adhippāyato gahetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "272"
      },
      ". Ayañhi ",
      " tatrādhippāyo – ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti evaṃ āyācitadhammadesanaṃ kira taṃ bhikkhuṃ yasmā so pubbepi dhammaṃ sutvā tattheva vasati, na samaṇadhammaṃ kātuṃ gacchati, tasmā naṃ bhagavā ‘‘evameva panidhekacce moghapurisā mamaññeva ajjhesanti, dhamme ca bhāsite mamaññeva anubandhitabbaṃ maññantī’’ti apasādetvā puna yasmā so arahattassa upanissayasampanno, tasmā naṃ ovadanto āha – ‘‘tasmātiha te bhikkhu evaṃ sikkhitabbaṃ, ajjhattaṃ me cittaṃ ṭhitaṃ bhavissati susaṇṭhitaṃ, na cuppannā pāpakā akusalā dhammā cittaṃ pariyādāya ṭhassantīti. Evañhi te bhikkhu sikkhitabba’’nti."
    ],
    "innerText": "272. Ayañhi tatrādhippāyo – ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti evaṃ āyācitadhammadesanaṃ kira taṃ bhikkhuṃ yasmā so pubbepi dhammaṃ sutvā tattheva vasati, na samaṇadhammaṃ kātuṃ gacchati, tasmā naṃ bhagavā ‘‘evameva panidhekacce moghapurisā mamaññeva ajjhesanti, dhamme ca bhāsite mamaññeva anubandhitabbaṃ maññantī’’ti apasādetvā puna yasmā so arahattassa upanissayasampanno, tasmā naṃ ovadanto āha – ‘‘tasmātiha te bhikkhu evaṃ sikkhitabbaṃ, ajjhattaṃ me cittaṃ ṭhitaṃ bhavissati susaṇṭhitaṃ, na cuppannā pāpakā akusalā dhammā cittaṃ pariyādāya ṭhassantīti. Evañhi te bhikkhu sikkhitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iminā panassa ovādena niyakajjhattavasena cittekaggatāmatto mūlasamādhi vutto. Tato ‘‘ettakeneva santuṭṭhiṃ anāpajjitvā evaṃ so eva samādhi vaḍḍhetabbo’’ti dassetuṃ ‘‘yato kho te bhikkhu ajjhattaṃ cittaṃ ṭhitaṃ hoti susaṇṭhitaṃ, na cuppannā pāpakā akusalā dhammā cittaṃ pariyādāya tiṭṭhanti. Tato te bhikkhu evaṃ sikkhitabbaṃ mettā me cetovimutti bhāvitā bhavissati bahulīkatā yānikatā vatthukatā anuṭṭhitā paricitā susamāraddhāti. Evañhi te bhikkhu sikkhitabba’’nti evamassa mettāvasena bhāvanaṃ vatvā puna ‘‘yato kho te bhikkhu ayaṃ samādhi evaṃ bhāvito hoti bahulīkato, tato tvaṃ bhikkhu imaṃ mūlasamādhiṃ savitakkampi savicāraṃ bhāveyyāsi…pe… upekkhāsahagatampi bhāveyyāsī’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassattho – yadā te bhikkhu ayaṃ mūlasamādhi evaṃ mettāvasena bhāvito hoti, tadā tvaṃ tāvatakenāpi tuṭṭhiṃ anāpajjitvāva imaṃ mūlasamādhiṃ ",
      " aññesupi ārammaṇesu catukkapañcakajjhānāni pāpayamāno savitakkampi savicārantiādinā nayena bhāveyyāsīti."
    ],
    "innerText": "Tassattho – yadā te bhikkhu ayaṃ mūlasamādhi evaṃ mettāvasena bhāvito hoti, tadā tvaṃ tāvatakenāpi tuṭṭhiṃ anāpajjitvāva imaṃ mūlasamādhiṃ aññesupi ārammaṇesu catukkapañcakajjhānāni pāpayamāno savitakkampi savicārantiādinā nayena bhāveyyāsīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ vatvā ca puna karuṇādiavasesabrahmavihārapubbaṅgamampissa aññesu ārammaṇesu catukkapañcakajjhānavasena bhāvanaṃ kareyyāsīti dassento ‘‘yato kho te bhikkhu ayaṃ samādhi evaṃ bhāvito hoti bahulīkato. Tato te bhikkhu evaṃ sikkhitabbaṃ karuṇā me cetovimuttī’’tiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ mettādipubbaṅgamaṃ catukkapañcakajjhānavasena bhāvanaṃ dassetvā puna kāyānupassanādipubbaṅgamaṃ ",
      " dassetuṃ ‘‘yato kho te bhikkhu ayaṃ samādhi evaṃ bhāvito hoti bahulīkato, tato te bhikkhu evaṃ sikkhitabbaṃ kāye kāyānupassī viharissāmī’’ti ādiṃ vatvā ‘‘yato kho te bhikkhu ayaṃ samādhi evaṃ bhāvito bhavissati subhāvito, tato tvaṃ bhikkhu yena yeneva gagghasi, phāsuññeva gagghasi, yattha yattheva ṭhassasi, phāsuññeva ṭhassasi, yattha yattheva nisīdissasi, phāsuññeva nisīdissasi, yattha yattheva seyyaṃ kappessasi, phāsuññeva seyyaṃ kappessasī’’ti arahattanikūṭena desanaṃ samāpesi. Tasmā tikacatukkajjhānikāva mettādayo, upekkhā pana avasesaekajjhānikāvāti veditabbā. Tatheva ca abhidhamme (dha. sa. 251 ādayo; vibha. 673 ādayo) vibhattāti."
    ],
    "innerText": "Evaṃ mettādipubbaṅgamaṃ catukkapañcakajjhānavasena bhāvanaṃ dassetvā puna kāyānupassanādipubbaṅgamaṃ dassetuṃ ‘‘yato kho te bhikkhu ayaṃ samādhi evaṃ bhāvito hoti bahulīkato, tato te bhikkhu evaṃ sikkhitabbaṃ kāye kāyānupassī viharissāmī’’ti ādiṃ vatvā ‘‘yato kho te bhikkhu ayaṃ samādhi evaṃ bhāvito bhavissati subhāvito, tato tvaṃ bhikkhu yena yeneva gagghasi, phāsuññeva gagghasi, yattha yattheva ṭhassasi, phāsuññeva ṭhassasi, yattha yattheva nisīdissasi, phāsuññeva nisīdissasi, yattha yattheva seyyaṃ kappessasi, phāsuññeva seyyaṃ kappessasī’’ti arahattanikūṭena desanaṃ samāpesi. Tasmā tikacatukkajjhānikāva mettādayo, upekkhā pana avasesaekajjhānikāvāti veditabbā. Tatheva ca abhidhamme (dha. sa. 251 ādayo; vibha. 673 ādayo) vibhattāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "273"
      },
      ". Evaṃ tikacatukkajjhānavasena ceva avasesaekajjhānavasena ca dvidhā ṭhitānampi etāsaṃ subhaparamādivasena aññamaññaṃ asadiso ānubhāvaviseso veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Haliddavasanasuttasmiṃ"
      },
      " hi etā subhaparamādibhāvena visesetvā vuttā. Yathāha – ‘‘subhaparamāhaṃ, bhikkhave, mettaṃ cetovimuttiṃ vadāmi. Ākāsānañcāyatanaparamāhaṃ, bhikkhave, karuṇaṃ cetovimuttiṃ vadāmi. Viññāṇañcāyatanaparamāhaṃ, bhikkhave, muditaṃ cetovimuttiṃ vadāmi. Ākiñcaññāyatanaparamāhaṃ, bhikkhave, upekkhaṃ cetovimuttiṃ vadāmī’’ti (saṃ. ni. 5.235)."
    ],
    "innerText": "273. Evaṃ tikacatukkajjhānavasena ceva avasesaekajjhānavasena ca dvidhā ṭhitānampi etāsaṃ subhaparamādivasena aññamaññaṃ asadiso ānubhāvaviseso veditabbo. Haliddavasanasuttasmiṃ hi etā subhaparamādibhāvena visesetvā vuttā. Yathāha – ‘‘subhaparamāhaṃ, bhikkhave, mettaṃ cetovimuttiṃ vadāmi. Ākāsānañcāyatanaparamāhaṃ, bhikkhave, karuṇaṃ cetovimuttiṃ vadāmi. Viññāṇañcāyatanaparamāhaṃ, bhikkhave, muditaṃ cetovimuttiṃ vadāmi. Ākiñcaññāyatanaparamāhaṃ, bhikkhave, upekkhaṃ cetovimuttiṃ vadāmī’’ti (saṃ. ni. 5.235)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kasmā ",
      " panetā evaṃ vuttāti? Tassa tassa upanissayattā. Mettāvihārissa hi sattā appaṭikkūlā honti. Athassa appaṭikkūlaparicayā appaṭikkūlesu parisuddhavaṇṇesu nīlādīsu cittaṃ upasaṃharato appakasireneva tattha cittaṃ pakkhandati. Iti mettā subhavimokkhassa upanissayo hoti, na tato paraṃ, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "subhaparamā"
      },
      "ti vuttā."
    ],
    "innerText": "Kasmā panetā evaṃ vuttāti? Tassa tassa upanissayattā. Mettāvihārissa hi sattā appaṭikkūlā honti. Athassa appaṭikkūlaparicayā appaṭikkūlesu parisuddhavaṇṇesu nīlādīsu cittaṃ upasaṃharato appakasireneva tattha cittaṃ pakkhandati. Iti mettā subhavimokkhassa upanissayo hoti, na tato paraṃ, tasmā subhaparamāti vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Karuṇāvihārissa pana daṇḍābhighātādirūpanimittaṃ pattadukkhaṃ samanupassantassa karuṇāya pavattisambhavato rūpe ādīnavo parividito hoti. Athassa parividitarūpādīnavattā pathavīkasiṇādīsu aññataraṃ ugghāṭetvā rūpanissaraṇe ākāse cittaṃ upasaṃharato appakasireneva tattha cittaṃ pakkhandati. Iti karuṇā ākāsānañcāyatanassa upanissayo hoti, na tato paraṃ, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ākāsānañcāyatanaparamā"
      },
      "ti vuttā."
    ],
    "innerText": "Karuṇāvihārissa pana daṇḍābhighātādirūpanimittaṃ pattadukkhaṃ samanupassantassa karuṇāya pavattisambhavato rūpe ādīnavo parividito hoti. Athassa parividitarūpādīnavattā pathavīkasiṇādīsu aññataraṃ ugghāṭetvā rūpanissaraṇe ākāse cittaṃ upasaṃharato appakasireneva tattha cittaṃ pakkhandati. Iti karuṇā ākāsānañcāyatanassa upanissayo hoti, na tato paraṃ, tasmā ākāsānañcāyatanaparamāti vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Muditāvihārissa pana tena tena pāmojjakāraṇena uppannapāmojjasattānaṃ viññāṇaṃ samanupassantassa muditāya pavattisambhavato viññāṇaggahaṇaparicitaṃ cittaṃ hoti. Athassa anukkamādhigataṃ ",
      " ākāsānañcāyatanaṃ atikkamma ākāsanimittagocare viññāṇe cittaṃ upasaṃharato appakasireneva tattha cittaṃ pakkhandatīti muditā viññāṇañcāyatanassa upanissayo hoti, na tato paraṃ, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viññāṇañcāyatanaparamā"
      },
      "ti vuttā."
    ],
    "innerText": "Muditāvihārissa pana tena tena pāmojjakāraṇena uppannapāmojjasattānaṃ viññāṇaṃ samanupassantassa muditāya pavattisambhavato viññāṇaggahaṇaparicitaṃ cittaṃ hoti. Athassa anukkamādhigataṃ ākāsānañcāyatanaṃ atikkamma ākāsanimittagocare viññāṇe cittaṃ upasaṃharato appakasireneva tattha cittaṃ pakkhandatīti muditā viññāṇañcāyatanassa upanissayo hoti, na tato paraṃ, tasmā viññāṇañcāyatanaparamāti vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Upekkhāvihārissa pana ‘‘sattā sukhitā vā hontu dukkhato vā vimuccantu, sampattasukhato vā mā vimuccantū’’ti ābhogābhāvato sukhadukkhādiparamatthagāhavimukhabhāvato avijjamānaggahaṇadukkhaṃ cittaṃ hoti. Athassa paramatthagāhato vimukhabhāvaparicitacittassa paramatthato avijjamānaggahaṇadukkhacittassa ca anukkamādhigataṃ viññāṇañcāyatanaṃ samatikkamma sabhāvato avijjamāne paramatthabhūtassa viññāṇassa abhāve cittaṃ upasaṃharato appakasireneva tattha cittaṃ pakkhandati. Iti upekkhā ākiñcaññāyatanassa upanissayo hoti, na tato paraṃ, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ākiñcaññāyatanaparamā"
      },
      "ti vuttāti."
    ],
    "innerText": "Upekkhāvihārissa pana ‘‘sattā sukhitā vā hontu dukkhato vā vimuccantu, sampattasukhato vā mā vimuccantū’’ti ābhogābhāvato sukhadukkhādiparamatthagāhavimukhabhāvato avijjamānaggahaṇadukkhaṃ cittaṃ hoti. Athassa paramatthagāhato vimukhabhāvaparicitacittassa paramatthato avijjamānaggahaṇadukkhacittassa ca anukkamādhigataṃ viññāṇañcāyatanaṃ samatikkamma sabhāvato avijjamāne paramatthabhūtassa viññāṇassa abhāve cittaṃ upasaṃharato appakasireneva tattha cittaṃ pakkhandati. Iti upekkhā ākiñcaññāyatanassa upanissayo hoti, na tato paraṃ, tasmā ākiñcaññāyatanaparamāti vuttāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "274"
      },
      ". Evaṃ subhaparamādivasena etāsaṃ ānubhāvaṃ viditvā puna sabbāpetā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dānādīnaṃ sabbakalyāṇadhammānaṃ paripūrikā"
      },
      "ti veditabbā. Sattesu ",
      " hi hitajjhāsayatāya sattānaṃ dukkhāsahanatāya, pattasampattivisesānaṃ ciraṭṭhitikāmatāya, sabbasattesu ca pakkhapātābhāvena samappavattacittā mahāsattā ‘‘imassa dātabbaṃ, imassa na dātabba’’nti vibhāgaṃ akatvā sabbasattānaṃ sukhanidānaṃ dānaṃ denti. Tesaṃ upaghātaṃ parivajjayantā sīlaṃ samādiyanti. Sīlaparipūraṇatthaṃ nekkhammaṃ bhajanti. Sattānaṃ hitāhitesu asammohatthāya paññaṃ pariyodapenti. Sattānaṃ hitasukhatthāya niccaṃ vīriyamārabhanti. Uttamavīriyavasena vīrabhāvaṃ pattāpi ca sattānaṃ nānappakārakaṃ aparādhaṃ khamanti. ‘‘Idaṃ vo dassāma karissāmā’’ti kataṃ paṭiññaṃ na visaṃvādenti. Tesaṃ hitasukhāya avicalādhiṭṭhānā honti. Tesu avicalāya mettāya pubbakārino honti. Upekkhāya paccupakāraṃ nāsīsantīti evaṃ pāramiyo pūretvā yāva dasabalacatuvesārajjachaasādhāraṇañāṇaaṭṭhārasabuddhadhammappabhede sabbepi kalyāṇadhamme paripūrentīti evaṃ dānādisabbakalyāṇadhammaparipūrikā etāva hontīti."
    ],
    "innerText": "274. Evaṃ subhaparamādivasena etāsaṃ ānubhāvaṃ viditvā puna sabbāpetā dānādīnaṃ sabbakalyāṇadhammānaṃ paripūrikāti veditabbā. Sattesu hi hitajjhāsayatāya sattānaṃ dukkhāsahanatāya, pattasampattivisesānaṃ ciraṭṭhitikāmatāya, sabbasattesu ca pakkhapātābhāvena samappavattacittā mahāsattā ‘‘imassa dātabbaṃ, imassa na dātabba’’nti vibhāgaṃ akatvā sabbasattānaṃ sukhanidānaṃ dānaṃ denti. Tesaṃ upaghātaṃ parivajjayantā sīlaṃ samādiyanti. Sīlaparipūraṇatthaṃ nekkhammaṃ bhajanti. Sattānaṃ hitāhitesu asammohatthāya paññaṃ pariyodapenti. Sattānaṃ hitasukhatthāya niccaṃ vīriyamārabhanti. Uttamavīriyavasena vīrabhāvaṃ pattāpi ca sattānaṃ nānappakārakaṃ aparādhaṃ khamanti. ‘‘Idaṃ vo dassāma karissāmā’’ti kataṃ paṭiññaṃ na visaṃvādenti. Tesaṃ hitasukhāya avicalādhiṭṭhānā honti. Tesu avicalāya mettāya pubbakārino honti. Upekkhāya paccupakāraṃ nāsīsantīti evaṃ pāramiyo pūretvā yāva dasabalacatuvesārajjachaasādhāraṇañāṇaaṭṭhārasabuddhadhammappabhede sabbepi kalyāṇadhamme paripūrentīti evaṃ dānādisabbakalyāṇadhammaparipūrikā etāva hontīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti sādhujanapāmojjatthāya kate visuddhimagge"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Samādhibhāvanādhikāre"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Brahmavihāraniddeso nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Navamo paricchedo."
  }
]