[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Vetullavādo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kīdiso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vetullavādo"
      },
      " nāma, yato mahāvihāravāsino ativiya jigucchiṃsūti? Idāni vetullavādassa sarūpaṃ sabbākārena pakāsetuṃ na sakkā, vetullanāmena potthakānaṃ vā nikāyassa vā etarahi apākaṭabhāvato. Abhidhammapiṭake pana kathāvatthuaṭṭhakathāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kathā. aṭṭha. 793-794 ādayo]"
      },
      " katipayā vetullavādā āgatā. Kathaṃ? –"
    ],
    "innerText": "Kīdiso vetullavādo nāma, yato mahāvihāravāsino ativiya jigucchiṃsūti? Idāni vetullavādassa sarūpaṃ sabbākārena pakāsetuṃ na sakkā, vetullanāmena potthakānaṃ vā nikāyassa vā etarahi apākaṭabhāvato. Abhidhammapiṭake pana kathāvatthuaṭṭhakathāyaṃ [kathā. aṭṭha. 793-794 ādayo] katipayā vetullavādā āgatā. Kathaṃ? –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Paramatthato maggaphalāneva saṅgho, maggaphalehi añño saṅgho nāma natthi, maggaphalāni ca na kiñci paṭiggaṇhanti, tasmā na vattabbaṃ saṅgho dakkhiṇaṃ paṭiggaṇhātī’’ti ca (1)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Maggaphalāneva saṅgho nāma, na ca tāni dakkhiṇaṃ visodhetuṃ sakkonti, tasmā na vattabbaṃ saṅgho dakkhiṇaṃ visodhetī’’ti ca (2)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Maggaphalāneva saṅgho nāma, na ca tāni kiñci bhuñjanti, tasmā na vattabbaṃ saṅgho bhuñjati pivati khādati sāyatī’’ti ca (3)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Maggaphalāneva saṅgho nāma, na ca sakkā tesaṃ kiñci dātuṃ, na ca tehi paṭiggaṇhituṃ, nāpi tesaṃ dānena koci upakāro ijjhati, tasmā na vattabbaṃ saṅghassa dinnaṃ mahapphala’’nti ca (4)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Buddho bhagavā na kiñci paribhuñjati, lokānuvattanatthaṃ pana paribhuñjamānaṃ viya attānaṃ dasseti, tasmā nirupakārattā na vattabbaṃ tasmiṃ dinnaṃ mahapphala’’nti ca (5)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhagavā ",
      " tusitabhavane nibbatto tattheva vasati, na manussalokaṃ āgacchati, nimmitarūpamattakaṃ panettha dassetī’’ti ca (6)."
    ],
    "innerText": "‘‘Bhagavā tusitabhavane nibbatto tattheva vasati, na manussalokaṃ āgacchati, nimmitarūpamattakaṃ panettha dassetī’’ti ca (6)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tusitapure ṭhito bhagavā dhammadesanatthāya abhinimmitaṃ pesesi, tena ceva, tassa ca desanaṃ sampaṭicchitvā āyasmatā ānandena dhammo desito, na buddhena bhagavatā’’ti ca (7)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ekādhippāyena methuno dhammo paṭisevitabbo. Ayaṃ panettha attho – kāruññena vā ekena adhippāyena ekādhippāyo, saṃsāre vā ekato bhavissāmāti itthiyā saddhiṃ buddhapūjādīni katvā paṇidhivasena eko adhippāyo assāti ekādhippāyo, evarūpo dvinnampi janānaṃ ekādhippāyo methuno dhammo paṭisevitabbo’’ti ca (8) evaṃ vetullavādīnaṃ laddhiyo āgatā, ettakāyeva nesaṃ vādā theravādaganthavasena dāni paññāyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha ca ādito catūhi vādehi suttantāgatasaṅgho ca micchā gahito, vinayāgatasaṅgho ca sabbathā paṭikkhitto. Tadanantaraṃ tayo vādā issaranimmānavādānuvattakā. Antimassa pana asaddhammavādabhāvo ativiya pākaṭoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Abhidhammasamuccaye pana vetullapiṭakassa bodhisattapiṭakabhāvo pakāsito, tasmā saddhammapuṇḍarikasuttādike bodhisattapiṭake āgatavādopi ‘‘vetullavādo’’ti veditabbo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhidhammasamuccaye 79-piṭṭhe]"
      },
      "."
    ],
    "innerText": "Abhidhammasamuccaye pana vetullapiṭakassa bodhisattapiṭakabhāvo pakāsito, tasmā saddhammapuṇḍarikasuttādike bodhisattapiṭake āgatavādopi ‘‘vetullavādo’’ti veditabbo [abhidhammasamuccaye 79-piṭṭhe]."
  }
]