[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Phāhiyamaddhānakkamakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phāhiya"
      },
      "nnāmena hi cinabhikkhunā 956-buddhavasse sīhaḷadīpato sakkatabhāsāropitaṃ mahisāsakavinayapiṭakañca dīghāgamo ca saṃyuttāgamo ca sannipātapiṭakañca attanā saha cinaraṭṭhamānītanti tassa addhānakkamakathāyaṃ ",
      " dassitaṃ. Tañca sabbaṃ abhayagirivihāratoyeva laddhamassa, mahāvihāravāsīnaṃ sakkatāropitapiṭakābhāvato. Aṭṭhakathāyaṃ paṭikkhittavaṇṇapiṭakādīni ca tattheva bhaveyyuṃ, mahāvihāravāsīhi tesaṃ appaṭiggahitabhāvato. Tathā ‘‘phāhiyambhikkhussa sīhaḷadīpe paṭivasanakāle (954-956-bu-va) mahāvihāre tisahassamattā bhikkhū vasanti, te theravādapiṭakameva uggaṇhanti, na mahāyānapiṭakaṃ. Abhayagirivihāre pañcasahassamattā bhikkhū vasanti, te pana dvepi piṭakāni uggaṇhanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāyānapiṭaka"
      },
      "ñceva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "theravādapiṭaka"
      },
      "ñcā’’ti ca teneva cinabhikkhunā dassitaṃ."
    ],
    "innerText": "Phāhiyannāmena hi cinabhikkhunā 956-buddhavasse sīhaḷadīpato sakkatabhāsāropitaṃ mahisāsakavinayapiṭakañca dīghāgamo ca saṃyuttāgamo ca sannipātapiṭakañca attanā saha cinaraṭṭhamānītanti tassa addhānakkamakathāyaṃ dassitaṃ. Tañca sabbaṃ abhayagirivihāratoyeva laddhamassa, mahāvihāravāsīnaṃ sakkatāropitapiṭakābhāvato. Aṭṭhakathāyaṃ paṭikkhittavaṇṇapiṭakādīni ca tattheva bhaveyyuṃ, mahāvihāravāsīhi tesaṃ appaṭiggahitabhāvato. Tathā ‘‘phāhiyambhikkhussa sīhaḷadīpe paṭivasanakāle (954-956-bu-va) mahāvihāre tisahassamattā bhikkhū vasanti, te theravādapiṭakameva uggaṇhanti, na mahāyānapiṭakaṃ. Abhayagirivihāre pañcasahassamattā bhikkhū vasanti, te pana dvepi piṭakāni uggaṇhanti mahāyānapiṭakañceva theravādapiṭakañcā’’ti ca teneva cinabhikkhunā dassitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yasmā pana abhayagirivāsino mahāyānapiṭakampi uggaṇhanti, tasmā tasmiṃ vihāre mahāyānikānaṃ padhānācariyabhūtehi assaghosanāgajjunehi kataganthāpi saṃvijjamānāyeva bhaveyyuṃ, tatoyeva tesaṃ nayañca nāmañca ācariyabuddhaghosattheropi aññepi taṃkālikā mahāvihāravāsino sutasampannā therā jāneyyuṃyeva. Apica dakkhiṇaindiyaraṭṭhe samuddasamīpe guntājanapade ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāgārajunakoṇḍaṃ"
      },
      " nāma ṭhānamatthi, yattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāgajjuno"
      },
      " mahāyānikānaṃ padhānācariyabhūto vasanto buddhasāsanaṃ patiṭṭhāpesi. Ācariyabuddhaghosassa ca tandesikabhāvanimittaṃ dissati, taṃ pacchato (33-piṭṭhe) āvibhavissati. Tasmāpi ācariyabuddhaghosatthero nāgajjunassa ca assaghosassa ca nayañca nāmañca jāneyyayevāti sakkā anuminituṃ."
    ],
    "innerText": "Yasmā pana abhayagirivāsino mahāyānapiṭakampi uggaṇhanti, tasmā tasmiṃ vihāre mahāyānikānaṃ padhānācariyabhūtehi assaghosanāgajjunehi kataganthāpi saṃvijjamānāyeva bhaveyyuṃ, tatoyeva tesaṃ nayañca nāmañca ācariyabuddhaghosattheropi aññepi taṃkālikā mahāvihāravāsino sutasampannā therā jāneyyuṃyeva. Apica dakkhiṇaindiyaraṭṭhe samuddasamīpe guntājanapade nāgārajunakoṇḍaṃ nāma ṭhānamatthi, yattha nāgajjuno mahāyānikānaṃ padhānācariyabhūto vasanto buddhasāsanaṃ patiṭṭhāpesi. Ācariyabuddhaghosassa ca tandesikabhāvanimittaṃ dissati, taṃ pacchato (33-piṭṭhe) āvibhavissati. Tasmāpi ācariyabuddhaghosatthero nāgajjunassa ca assaghosassa ca nayañca nāmañca jāneyyayevāti sakkā anuminituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Jānatoyeva pana tesaṃ nayassa vā nāmassa vā attano aṭṭhakathāyamappakāsanaṃ tesaṃ nikāyantarabhāvatoyevassa. Tathā hi tesaṃ assaghosanāgajjunānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "assaghoso"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[(570-670-buddhavassabbhantare)]"
      },
      " theravādato bhinnesu ekādasasu gaṇesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbatthivādagaṇe"
      },
      " pariyāpanno, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāgajjuno"
      },
      " ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāsaṅghika-cetiyavādi"
      },
      "gaṇādīhi jāte ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāyānanikāye"
      },
      " pariyāpanno, ",
      " mahāvihāravāsino ca āditoyeva paṭṭhāya nikāyantarasamayehi asammissanatthaṃ attano piṭakaṃ atīva ādaraṃ katvā rakkhanti, ayañca ācariyabuddhaghoso tesamaññataro. Vuttañhi tassa ganthanigamanesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘mahāvihāravāsīnaṃ vaṃsālaṅkārabhūtenā’’"
      },
      "ti. Tasmā ‘‘ācariyabuddhaghoso tesaṃ nayaṃ jānantoyeva attano ganthesu nikāyantarasamayehi asammissanatthaṃ nappakāsesī’’ti veditabbaṃ."
    ],
    "innerText": "Jānatoyeva pana tesaṃ nayassa vā nāmassa vā attano aṭṭhakathāyamappakāsanaṃ tesaṃ nikāyantarabhāvatoyevassa. Tathā hi tesaṃ assaghosanāgajjunānaṃ assaghoso[(570-670-buddhavassabbhantare)] theravādato bhinnesu ekādasasu gaṇesu sabbatthivādagaṇe pariyāpanno, nāgajjuno ca mahāsaṅghika-cetiyavādigaṇādīhi jāte mahāyānanikāye pariyāpanno, mahāvihāravāsino ca āditoyeva paṭṭhāya nikāyantarasamayehi asammissanatthaṃ attano piṭakaṃ atīva ādaraṃ katvā rakkhanti, ayañca ācariyabuddhaghoso tesamaññataro. Vuttañhi tassa ganthanigamanesu ‘‘mahāvihāravāsīnaṃ vaṃsālaṅkārabhūtenā’’ti. Tasmā ‘‘ācariyabuddhaghoso tesaṃ nayaṃ jānantoyeva attano ganthesu nikāyantarasamayehi asammissanatthaṃ nappakāsesī’’ti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā ca yāni ‘‘bodhimaṇḍasamīpamhi, jāto brāhmaṇamāṇavo’’tiādinā vuttassa mahāvaṃsavacanassa vicāraṇamukhena ācariyabuddhaghosassa vambhanavacanāni dhammānandakosambinā vuttāni, tāni amūlakabhāvena anuvicāritāni. Tathāpi ‘‘ācariyabuddhaghoso bodhimaṇḍasamīpe jāto’’ti etaṃ pana atthaṃ sādhetuṃ daḷhakāraṇaṃ na dissateva ṭhapetvā taṃ mahāvaṃsavacanaṃ, yampi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddhaghosuppattiyaṃ"
      },
      " vuttaṃ, tampi mahāvaṃsameva nissāya vuttavacanattā na daḷhakāraṇaṃ hotīti."
    ],
    "innerText": "Ettāvatā ca yāni ‘‘bodhimaṇḍasamīpamhi, jāto brāhmaṇamāṇavo’’tiādinā vuttassa mahāvaṃsavacanassa vicāraṇamukhena ācariyabuddhaghosassa vambhanavacanāni dhammānandakosambinā vuttāni, tāni amūlakabhāvena anuvicāritāni. Tathāpi ‘‘ācariyabuddhaghoso bodhimaṇḍasamīpe jāto’’ti etaṃ pana atthaṃ sādhetuṃ daḷhakāraṇaṃ na dissateva ṭhapetvā taṃ mahāvaṃsavacanaṃ, yampi buddhaghosuppattiyaṃ vuttaṃ, tampi mahāvaṃsameva nissāya vuttavacanattā na daḷhakāraṇaṃ hotīti."
  }
]