[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Dhutaṅganiddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". Idāni ",
      " yehi appicchatāsantuṭṭhitādīhi guṇehi vuttappakārassa sīlassa vodānaṃ hoti, te guṇe sampādetuṃ yasmā samādinnasīlena yoginā dhutaṅgasamādānaṃ kātabbaṃ. Evañhissa appicchatāsantuṭṭhitāsallekhapavivekāpacayavīriyārambhasubharatādiguṇasalilavikkhālitamalaṃ sīlañceva suparisuddhaṃ bhavissati, vatāni ca sampajjissanti. Iti anavajjasīlabbataguṇaparisuddhasabbasamācāro porāṇe ariyavaṃsattaye patiṭṭhāya catutthassa bhāvanārāmatāsaṅkhātassa ariyavaṃsassa adhigamāraho bhavissati. Tasmā dhutaṅgakathaṃ ārabhissāma."
    ],
    "innerText": "22. Idāni yehi appicchatāsantuṭṭhitādīhi guṇehi vuttappakārassa sīlassa vodānaṃ hoti, te guṇe sampādetuṃ yasmā samādinnasīlena yoginā dhutaṅgasamādānaṃ kātabbaṃ. Evañhissa appicchatāsantuṭṭhitāsallekhapavivekāpacayavīriyārambhasubharatādiguṇasalilavikkhālitamalaṃ sīlañceva suparisuddhaṃ bhavissati, vatāni ca sampajjissanti. Iti anavajjasīlabbataguṇaparisuddhasabbasamācāro porāṇe ariyavaṃsattaye patiṭṭhāya catutthassa bhāvanārāmatāsaṅkhātassa ariyavaṃsassa adhigamāraho bhavissati. Tasmā dhutaṅgakathaṃ ārabhissāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhagavatā hi pariccattalokāmisānaṃ kāye ca jīvite ca anapekkhānaṃ anulomapaṭipadaṃyeva ārādhetukāmānaṃ kulaputtānaṃ terasadhutaṅgāni anuññātāni. Seyyathidaṃ – paṃsukūlikaṅgaṃ, tecīvarikaṅgaṃ, piṇḍapātikaṅgaṃ, sapadānacārikaṅgaṃ, ekāsanikaṅgaṃ, pattapiṇḍikaṅgaṃ, khalupacchābhattikaṅgaṃ, āraññikaṅgaṃ, rukkhamūlikaṅgaṃ, abbhokāsikaṅgaṃ, sosānikaṅgaṃ, yathāsanthatikaṅgaṃ, nesajjikaṅganti. Tattha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Atthato lakkhaṇādīhi, samādānavidhānato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pabhedato bhedato ca, tassa tassānisaṃsato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kusalattikato ceva, dhutādīnaṃ vibhāgato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Samāsabyāsato cāpi, viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthato"
      },
      "ti tāva rathikasusānasaṅkārakūṭādīnaṃ yattha katthaci paṃsūnaṃ upari ṭhitattā abbhuggataṭṭhena tesu tesu paṃsukūlamivāti paṃsukūlaṃ, atha vā paṃsu viya kucchitabhāvaṃ ulatīti paṃsukūlaṃ, kucchitabhāvaṃ gacchatīti vuttaṃ hoti. Evaṃ laddhanibbacanassa paṃsukūlassa dhāraṇaṃ paṃsukūlaṃ ",
      ", taṃ sīlamassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṃsukūliko"
      },
      ". Paṃsukūlikassa aṅgaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṃsukūlikaṅgaṃ"
      },
      ". Aṅganti kāraṇaṃ vuccati. Tasmā yena samādānena so paṃsukūliko hoti, tassetaṃ adhivacananti veditabbaṃ."
    ],
    "innerText": "23. Tattha atthatoti tāva rathikasusānasaṅkārakūṭādīnaṃ yattha katthaci paṃsūnaṃ upari ṭhitattā abbhuggataṭṭhena tesu tesu paṃsukūlamivāti paṃsukūlaṃ, atha vā paṃsu viya kucchitabhāvaṃ ulatīti paṃsukūlaṃ, kucchitabhāvaṃ gacchatīti vuttaṃ hoti. Evaṃ laddhanibbacanassa paṃsukūlassa dhāraṇaṃ paṃsukūlaṃ , taṃ sīlamassāti paṃsukūliko. Paṃsukūlikassa aṅgaṃ paṃsukūlikaṅgaṃ. Aṅganti kāraṇaṃ vuccati. Tasmā yena samādānena so paṃsukūliko hoti, tassetaṃ adhivacananti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Eteneva nayena saṅghāṭiuttarāsaṅgaantaravāsakasaṅkhātaṃ ticīvaraṃ sīlamassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tecīvariko"
      },
      ". Tecīvarikassa aṅgaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tecīvarikaṅgaṃ"
      },
      "."
    ],
    "innerText": "Eteneva nayena saṅghāṭiuttarāsaṅgaantaravāsakasaṅkhātaṃ ticīvaraṃ sīlamassāti tecīvariko. Tecīvarikassa aṅgaṃ tecīvarikaṅgaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhikkhāsaṅkhātānaṃ ",
      " pana āmisapiṇḍānaṃ pātoti piṇḍapāto, parehi dinnānaṃ piṇḍānaṃ patte nipatananti vuttaṃ hoti. Taṃ piṇḍapātaṃ uñchati taṃ taṃ kulaṃ upasaṅkamanto gavesatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "piṇḍapātiko"
      },
      ". Piṇḍāya vā patituṃ vatametassāti piṇḍapātī, patitunti carituṃ, piṇḍapātī eva piṇḍapātiko. Piṇḍapātikassa aṅgaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "piṇḍapātikaṅgaṃ"
      },
      "."
    ],
    "innerText": "Bhikkhāsaṅkhātānaṃ pana āmisapiṇḍānaṃ pātoti piṇḍapāto, parehi dinnānaṃ piṇḍānaṃ patte nipatananti vuttaṃ hoti. Taṃ piṇḍapātaṃ uñchati taṃ taṃ kulaṃ upasaṅkamanto gavesatīti piṇḍapātiko. Piṇḍāya vā patituṃ vatametassāti piṇḍapātī, patitunti carituṃ, piṇḍapātī eva piṇḍapātiko. Piṇḍapātikassa aṅgaṃ piṇḍapātikaṅgaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dānaṃ vuccati avakhaṇḍanaṃ, apetaṃ dānatoti apadānaṃ, anavakhaṇḍananti attho. Saha apadānena sapadānaṃ, avakhaṇḍanarahitaṃ anugharanti vuttaṃ hoti. Sapadānaṃ carituṃ idamassa sīlanti sapadānacārī, sapadānacārī eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sapadānacāriko"
      },
      ". Tassa aṅgaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sapadānacārikaṅgaṃ"
      },
      "."
    ],
    "innerText": "Dānaṃ vuccati avakhaṇḍanaṃ, apetaṃ dānatoti apadānaṃ, anavakhaṇḍananti attho. Saha apadānena sapadānaṃ, avakhaṇḍanarahitaṃ anugharanti vuttaṃ hoti. Sapadānaṃ carituṃ idamassa sīlanti sapadānacārī, sapadānacārī eva sapadānacāriko. Tassa aṅgaṃ sapadānacārikaṅgaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekāsane bhojanaṃ ekāsanaṃ, taṃ sīlamassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekāsaniko"
      },
      ". Tassa aṅgaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekāsanikaṅgaṃ"
      },
      "."
    ],
    "innerText": "Ekāsane bhojanaṃ ekāsanaṃ, taṃ sīlamassāti ekāsaniko. Tassa aṅgaṃ ekāsanikaṅgaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiyabhājanassa paṭikkhittattā kevalaṃ ekasmiṃyeva patte piṇḍo pattapiṇḍo. Idāni pattapiṇḍagahaṇe pattapiṇḍasaññaṃ katvā pattapiṇḍo sīlamassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pattapiṇḍiko"
      },
      ". Tassa aṅgaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pattapiṇḍikaṅgaṃ"
      },
      "."
    ],
    "innerText": "Dutiyabhājanassa paṭikkhittattā kevalaṃ ekasmiṃyeva patte piṇḍo pattapiṇḍo. Idāni pattapiṇḍagahaṇe pattapiṇḍasaññaṃ katvā pattapiṇḍo sīlamassāti pattapiṇḍiko. Tassa aṅgaṃ pattapiṇḍikaṅgaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khalū"
      },
      "ti paṭisedhanatthe nipāto. Pavāritena satā pacchā laddhaṃ bhattaṃ pacchābhattaṃ nāma, tassa pacchābhattassa bhojanaṃ pacchābhattabhojanaṃ, tasmiṃ pacchābhattabhojane pacchābhattasaññaṃ katvā pacchābhattaṃ sīlamassāti pacchābhattiko. Na pacchābhattiko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khalupacchābhattiko"
      },
      ". Samādānavasena paṭikkhittātirittabhojanassetaṃ nāmaṃ. Aṭṭhakathāyaṃ pana vuttaṃ khalūti eko sakuṇo. So mukhena phalaṃ gahetvā tasmiṃ patite puna aññaṃ na khādati. Tādiso ayanti khalupacchābhattiko. Tassa aṅgaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khalupacchābhattikaṅgaṃ"
      },
      "."
    ],
    "innerText": "Khalūti paṭisedhanatthe nipāto. Pavāritena satā pacchā laddhaṃ bhattaṃ pacchābhattaṃ nāma, tassa pacchābhattassa bhojanaṃ pacchābhattabhojanaṃ, tasmiṃ pacchābhattabhojane pacchābhattasaññaṃ katvā pacchābhattaṃ sīlamassāti pacchābhattiko. Na pacchābhattiko khalupacchābhattiko. Samādānavasena paṭikkhittātirittabhojanassetaṃ nāmaṃ. Aṭṭhakathāyaṃ pana vuttaṃ khalūti eko sakuṇo. So mukhena phalaṃ gahetvā tasmiṃ patite puna aññaṃ na khādati. Tādiso ayanti khalupacchābhattiko. Tassa aṅgaṃ khalupacchābhattikaṅgaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Araññe ",
      " nivāso sīlamassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āraññiko"
      },
      ". Tassa aṅgaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āraññikaṅgaṃ"
      },
      "."
    ],
    "innerText": "Araññe nivāso sīlamassāti āraññiko. Tassa aṅgaṃ āraññikaṅgaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rukkhamūle nivāso rukkhamūlaṃ, taṃ sīlamassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rukkhamūliko"
      },
      ". Rukkhamūlikassa aṅgaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rukkhamūlikaṅgaṃ. Abbhokāsikasosānikaṅgesupi"
      },
      " eseva nayo."
    ],
    "innerText": "Rukkhamūle nivāso rukkhamūlaṃ, taṃ sīlamassāti rukkhamūliko. Rukkhamūlikassa aṅgaṃ rukkhamūlikaṅgaṃ. Abbhokāsikasosānikaṅgesupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadeva ",
      " santhataṃ yathāsanthataṃ, idaṃ tuyhaṃ pāpuṇātīti evaṃ paṭhamaṃ uddiṭṭhasenāsanassetaṃ adhivacanaṃ. Tasmiṃ yathāsanthate viharituṃ sīlamassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathāsanthatiko"
      },
      ". Tassa aṅgaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathāsanthatikaṅgaṃ"
      },
      "."
    ],
    "innerText": "Yadeva santhataṃ yathāsanthataṃ, idaṃ tuyhaṃ pāpuṇātīti evaṃ paṭhamaṃ uddiṭṭhasenāsanassetaṃ adhivacanaṃ. Tasmiṃ yathāsanthate viharituṃ sīlamassāti yathāsanthatiko. Tassa aṅgaṃ yathāsanthatikaṅgaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sayanaṃ paṭikkhipitvā nisajjāya viharituṃ sīlamassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nesajjiko"
      },
      ". Tassa aṅgaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nesajjikaṅgaṃ"
      },
      "."
    ],
    "innerText": "Sayanaṃ paṭikkhipitvā nisajjāya viharituṃ sīlamassāti nesajjiko. Tassa aṅgaṃ nesajjikaṅgaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbāneva panetāni tena tena samādānena dhutakilesattā dhutassa bhikkhuno aṅgāni, kilesadhunanato vā dhutanti laddhavohāraṃ ñāṇaṃ aṅgaṃ etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhutaṅgāni"
      },
      ". Atha vā dhutāni ca tāni paṭipakkhaniddhunanato aṅgāni ca paṭipattiyātipi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhutaṅgāni"
      },
      ". Evaṃ tāvettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthato"
      },
      " viññātabbo vinicchayo."
    ],
    "innerText": "Sabbāneva panetāni tena tena samādānena dhutakilesattā dhutassa bhikkhuno aṅgāni, kilesadhunanato vā dhutanti laddhavohāraṃ ñāṇaṃ aṅgaṃ etesanti dhutaṅgāni. Atha vā dhutāni ca tāni paṭipakkhaniddhunanato aṅgāni ca paṭipattiyātipi dhutaṅgāni. Evaṃ tāvettha atthato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbāneva panetāni samādānacetanālakkhaṇāni. Vuttampi cetaṃ ‘‘yo samādiyati, so puggalo. Yena samādiyati, cittacetasikā ete dhammā. Yā samādānacetanā, taṃ dhutaṅgaṃ. Yaṃ paṭikkhipati, taṃ vatthū’’ti. Sabbāneva ca loluppaviddhaṃsanarasāni, nilloluppabhāvapaccupaṭṭhānāni appicchatādiariyadhammapadaṭṭhānāni. Evamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lakkhaṇādīhi"
      },
      " veditabbo vinicchayo."
    ],
    "innerText": "Sabbāneva panetāni samādānacetanālakkhaṇāni. Vuttampi cetaṃ ‘‘yo samādiyati, so puggalo. Yena samādiyati, cittacetasikā ete dhammā. Yā samādānacetanā, taṃ dhutaṅgaṃ. Yaṃ paṭikkhipati, taṃ vatthū’’ti. Sabbāneva ca loluppaviddhaṃsanarasāni, nilloluppabhāvapaccupaṭṭhānāni appicchatādiariyadhammapadaṭṭhānāni. Evamettha lakkhaṇādīhi veditabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Samādānavidhānatotiādīsu pana pañcasu sabbāneva dhutaṅgāni dharamāne bhagavati bhagavatova santike samādātabbāni. Parinibbute mahāsāvakassa santike. Tasmiṃ asati khīṇāsavassa, anāgāmissa, sakadāgāmissa, sotāpannassa, tipiṭakassa, dvipiṭakassa, ekapiṭakassa, ekasaṅgītikassa, aṭṭhakathācariyassa. Tasmiṃ asati dhutaṅgadharassa, tasmimpi asati cetiyaṅgaṇaṃ sammajjitvā ukkuṭikaṃ nisīditvā sammāsambuddhassa santike vadantena viya ",
      " samādātabbāni, apica sayampi samādātuṃ vaṭṭati eva. Ettha ca cetiyapabbate dve bhātikattherānaṃ jeṭṭhakabhātu dhutaṅgappicchatāya vatthu kathetabbaṃ. Ayaṃ tāva sādhāraṇakathā."
    ],
    "innerText": "Samādānavidhānatotiādīsu pana pañcasu sabbāneva dhutaṅgāni dharamāne bhagavati bhagavatova santike samādātabbāni. Parinibbute mahāsāvakassa santike. Tasmiṃ asati khīṇāsavassa, anāgāmissa, sakadāgāmissa, sotāpannassa, tipiṭakassa, dvipiṭakassa, ekapiṭakassa, ekasaṅgītikassa, aṭṭhakathācariyassa. Tasmiṃ asati dhutaṅgadharassa, tasmimpi asati cetiyaṅgaṇaṃ sammajjitvā ukkuṭikaṃ nisīditvā sammāsambuddhassa santike vadantena viya samādātabbāni, apica sayampi samādātuṃ vaṭṭati eva. Ettha ca cetiyapabbate dve bhātikattherānaṃ jeṭṭhakabhātu dhutaṅgappicchatāya vatthu kathetabbaṃ. Ayaṃ tāva sādhāraṇakathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Paṃsukūlikaṅgakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ". Idāni ekekassa samādānavidhānappabhedabhedānisaṃse vaṇṇayissāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṃsukūlikaṅgaṃ"
      },
      " tāva ‘‘gahapatidānacīvaraṃ paṭikkhipāmi, paṃsukūlikaṅgaṃ samādiyāmī’’ti ",
      " imesu dvīsu vacanesu aññatarena samādinnaṃ hoti. Idaṃ tāvettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samādānaṃ"
      },
      "."
    ],
    "innerText": "24. Idāni ekekassa samādānavidhānappabhedabhedānisaṃse vaṇṇayissāma. Paṃsukūlikaṅgaṃ tāva ‘‘gahapatidānacīvaraṃ paṭikkhipāmi, paṃsukūlikaṅgaṃ samādiyāmī’’ti imesu dvīsu vacanesu aññatarena samādinnaṃ hoti. Idaṃ tāvettha samādānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ samādinnadhutaṅgena pana tena sosānikaṃ, pāpaṇikaṃ, rathiyacoḷaṃ, saṅkāracoḷaṃ, sotthiyaṃ, nhānacoḷaṃ, titthacoḷaṃ, gatapaccāgataṃ, aggiḍaḍḍhaṃ, gokhāyitaṃ, upacikākhāyitaṃ, undūrakhāyitaṃ, antacchinnaṃ, dasācchinnaṃ, dhajāhaṭaṃ, thūpacīvaraṃ, samaṇacīvaraṃ, ābhisekikaṃ, iddhimayaṃ, panthikaṃ, vātāhaṭaṃ, devadattiyaṃ, sāmuddiyantietesu aññataraṃ cīvaraṃ gahetvā phāletvā dubbalaṭṭhānaṃ pahāya thiraṭṭhānāni dhovitvā cīvaraṃ katvā porāṇaṃ gahapaticīvaraṃ apanetvā paribhuñjitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sosānika"
      },
      "nti susāne patitakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpaṇika"
      },
      "nti āpaṇadvāre patitakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rathiyacoḷa"
      },
      "nti puññatthikehi vātapānantarena rathikāya chaḍḍitacoḷakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkāracoḷa"
      },
      "nti saṅkāraṭṭhāne chaḍḍitacoḷakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sotthiya"
      },
      "nti gabbhamalaṃ puñchitvā chaḍḍitavatthaṃ. Tissāmaccamātā kira satagghanakena vatthena gabbhamalaṃ puñchāpetvā paṃsukūlikā gaṇhissantīti tālaveḷimagge chaḍḍāpesi. Bhikkhū jiṇṇakaṭṭhānatthameva gaṇhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nhānacoḷa"
      },
      "nti yaṃ bhūtavejjehi sasīsaṃ nhāpitā kāḷakaṇṇicoḷanti chaḍḍetvā gacchanti."
    ],
    "innerText": "Tattha sosānikanti susāne patitakaṃ. Pāpaṇikanti āpaṇadvāre patitakaṃ. Rathiyacoḷanti puññatthikehi vātapānantarena rathikāya chaḍḍitacoḷakaṃ. Saṅkāracoḷanti saṅkāraṭṭhāne chaḍḍitacoḷakaṃ. Sotthiyanti gabbhamalaṃ puñchitvā chaḍḍitavatthaṃ. Tissāmaccamātā kira satagghanakena vatthena gabbhamalaṃ puñchāpetvā paṃsukūlikā gaṇhissantīti tālaveḷimagge chaḍḍāpesi. Bhikkhū jiṇṇakaṭṭhānatthameva gaṇhanti. Nhānacoḷanti yaṃ bhūtavejjehi sasīsaṃ nhāpitā kāḷakaṇṇicoḷanti chaḍḍetvā gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Titthacoḷa"
      },
      "nti nhānatitthe chaḍḍitapilotikā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gatapaccāgata"
      },
      "nti yaṃ manussā susānaṃ gantvā paccāgatā nhatvā chaḍḍenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aggiḍaḍḍha"
      },
      "nti agginā ḍaḍḍhappadesaṃ. Tañhi manussā chaḍḍenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gokhāyitādī"
      },
      "ni pākaṭāneva. Tādisānipi hi manussā chaḍḍenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhajāhaṭa"
      },
      "nti nāvaṃ ārohantā dhajaṃ bandhitvā ārūhanti. Taṃ tesaṃ dassanātikkame gahetuṃ vaṭṭati. Yampi yuddhabhūmiyaṃ dhajaṃ bandhitvā ṭhapitaṃ, taṃ dvinnampi senānaṃ gatakāle gahetuṃ vaṭṭati."
    ],
    "innerText": "Titthacoḷanti nhānatitthe chaḍḍitapilotikā. Gatapaccāgatanti yaṃ manussā susānaṃ gantvā paccāgatā nhatvā chaḍḍenti. Aggiḍaḍḍhanti agginā ḍaḍḍhappadesaṃ. Tañhi manussā chaḍḍenti. Gokhāyitādīni pākaṭāneva. Tādisānipi hi manussā chaḍḍenti. Dhajāhaṭanti nāvaṃ ārohantā dhajaṃ bandhitvā ārūhanti. Taṃ tesaṃ dassanātikkame gahetuṃ vaṭṭati. Yampi yuddhabhūmiyaṃ dhajaṃ bandhitvā ṭhapitaṃ, taṃ dvinnampi senānaṃ gatakāle gahetuṃ vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thūpacīvara"
      },
      "nti ",
      " vammikaṃ parikkhipitvā balikammaṃ kataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaṇacīvara"
      },
      "nti bhikkhusantakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ābhisekika"
      },
      "nti rañño abhisekaṭṭhāne chaḍḍitacīvaraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhimaya"
      },
      "nti ehibhikkhucīvaraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Panthika"
      },
      "nti antarāmagge patitakaṃ. Yaṃ pana sāmikānaṃ satisammosena patitaṃ, taṃ thokaṃ rakkhitvā gahetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vātāhaṭa"
      },
      "nti vātena paharitvā dūre pātitaṃ, taṃ pana sāmike apassantena ",
      " gahetuṃ vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devadattiya"
      },
      "nti anuruddhattherassa viya devatāhi dinnakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāmuddiya"
      },
      "nti samuddavīcīhi thale ussāritaṃ."
    ],
    "innerText": "Thūpacīvaranti vammikaṃ parikkhipitvā balikammaṃ kataṃ. Samaṇacīvaranti bhikkhusantakaṃ. Ābhisekikanti rañño abhisekaṭṭhāne chaḍḍitacīvaraṃ. Iddhimayanti ehibhikkhucīvaraṃ. Panthikanti antarāmagge patitakaṃ. Yaṃ pana sāmikānaṃ satisammosena patitaṃ, taṃ thokaṃ rakkhitvā gahetabbaṃ. Vātāhaṭanti vātena paharitvā dūre pātitaṃ, taṃ pana sāmike apassantena gahetuṃ vaṭṭati. Devadattiyanti anuruddhattherassa viya devatāhi dinnakaṃ. Sāmuddiyanti samuddavīcīhi thale ussāritaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yaṃ pana saṅghassa demāti dinnaṃ, coḷakabhikkhāya vā caramānehi laddhaṃ, na taṃ paṃsukūlaṃ. Bhikkhudattiyepi yaṃ vassaggena gāhetvā vā dīyati, senāsanacīvaraṃ vā hoti, na taṃ paṃsukūlaṃ. No gāhāpetvā dinnameva paṃsukūlaṃ. Tatrapi yaṃ dāyakehi bhikkhussa pādamūle nikkhittaṃ, tena pana bhikkhunā paṃsukūlikassa hatthe ṭhapetvā dinnaṃ, taṃ ekatosuddhikaṃ nāma. Yaṃ bhikkhuno hatthe ṭhapetvā dinnaṃ, tena pana pādamūle ṭhapitaṃ, tampi ekatosuddhikaṃ. Yaṃ bhikkhunopi pādamūle ṭhapitaṃ, tenāpi tatheva dinnaṃ, taṃ ubhatosuddhikaṃ. Yaṃ hatthe ṭhapetvā laddhaṃ, hattheyeva ṭhapitaṃ, taṃ anukkaṭṭhacīvaraṃ nāma. Iti imaṃ paṃsukūlabhedaṃ ñatvā paṃsukūlikena cīvaraṃ paribhuñjitabbanti idamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vidhānaṃ"
      },
      "."
    ],
    "innerText": "Yaṃ pana saṅghassa demāti dinnaṃ, coḷakabhikkhāya vā caramānehi laddhaṃ, na taṃ paṃsukūlaṃ. Bhikkhudattiyepi yaṃ vassaggena gāhetvā vā dīyati, senāsanacīvaraṃ vā hoti, na taṃ paṃsukūlaṃ. No gāhāpetvā dinnameva paṃsukūlaṃ. Tatrapi yaṃ dāyakehi bhikkhussa pādamūle nikkhittaṃ, tena pana bhikkhunā paṃsukūlikassa hatthe ṭhapetvā dinnaṃ, taṃ ekatosuddhikaṃ nāma. Yaṃ bhikkhuno hatthe ṭhapetvā dinnaṃ, tena pana pādamūle ṭhapitaṃ, tampi ekatosuddhikaṃ. Yaṃ bhikkhunopi pādamūle ṭhapitaṃ, tenāpi tatheva dinnaṃ, taṃ ubhatosuddhikaṃ. Yaṃ hatthe ṭhapetvā laddhaṃ, hattheyeva ṭhapitaṃ, taṃ anukkaṭṭhacīvaraṃ nāma. Iti imaṃ paṃsukūlabhedaṃ ñatvā paṃsukūlikena cīvaraṃ paribhuñjitabbanti idamettha vidhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pabhedo,"
      },
      " tayo paṃsukūlikā ukkaṭṭho majjhimo mudūti. Tattha sosānikaṃyeva gaṇhanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkaṭṭho"
      },
      " hoti. Pabbajitā gaṇhissantīti ṭhapitakaṃ gaṇhanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "majjhimo"
      },
      ". Pādamūle ṭhapetvā dinnakaṃ gaṇhanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mudū"
      },
      "ti."
    ],
    "innerText": "Ayaṃ pana pabhedo, tayo paṃsukūlikā ukkaṭṭho majjhimo mudūti. Tattha sosānikaṃyeva gaṇhanto ukkaṭṭho hoti. Pabbajitā gaṇhissantīti ṭhapitakaṃ gaṇhanto majjhimo. Pādamūle ṭhapetvā dinnakaṃ gaṇhanto mudūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesu yassa kassaci attano ruciyā gihidinnakaṃ sāditakkhaṇe dhutaṅgaṃ bhijjati. Ayamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhedo"
      },
      "."
    ],
    "innerText": "Tesu yassa kassaci attano ruciyā gihidinnakaṃ sāditakkhaṇe dhutaṅgaṃ bhijjati. Ayamettha bhedo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ panānisaṃso,"
      },
      " ‘‘paṃsukūlacīvaraṃ nissāya pabbajjā’’ti (mahāva. 128) vacanato nissayānurūpapaṭipattisabbhāvo, paṭhame ariyavaṃse patiṭṭhānaṃ, ārakkhadukkhābhāvo, aparāyattavuttitā, corabhayena abhayatā, paribhogataṇhāya abhāvo, samaṇasāruppaparikkhāratā, ‘‘appāni ceva sulabhāni ca tāni ca anavajjānī’’ti (a. ni. 4.27; itivu. 101) bhagavatā saṃvaṇṇitapaccayatā, pāsādikatā, appicchatādīnaṃ phalanipphatti, sammāpaṭipattiyā anubrūhanaṃ, pacchimāya janatāya diṭṭhānugatiāpādananti."
    ],
    "innerText": "Ayaṃ panānisaṃso, ‘‘paṃsukūlacīvaraṃ nissāya pabbajjā’’ti (mahāva. 128) vacanato nissayānurūpapaṭipattisabbhāvo, paṭhame ariyavaṃse patiṭṭhānaṃ, ārakkhadukkhābhāvo, aparāyattavuttitā, corabhayena abhayatā, paribhogataṇhāya abhāvo, samaṇasāruppaparikkhāratā, ‘‘appāni ceva sulabhāni ca tāni ca anavajjānī’’ti (a. ni. 4.27; itivu. 101) bhagavatā saṃvaṇṇitapaccayatā, pāsādikatā, appicchatādīnaṃ phalanipphatti, sammāpaṭipattiyā anubrūhanaṃ, pacchimāya janatāya diṭṭhānugatiāpādananti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Mārasenavighātāya ",
      ", paṃsukūladharo yati;"
    ],
    "innerText": "Mārasenavighātāya , paṃsukūladharo yati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sannaddhakavaco yuddhe, khattiyo viya sobhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Pahāya ",
      " kāsikādīni, varavatthāni dhāritaṃ;"
    ],
    "innerText": "Pahāya kāsikādīni, varavatthāni dhāritaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yaṃ lokagarunā ko taṃ, paṃsukūlaṃ na dhāraye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tasmā hi attano bhikkhu, paṭiññaṃ samanussaraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yogācārānukūlamhi, paṃsukūle rato siyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ayaṃ tāva paṃsukūlikaṅge samādānavidhānappabhedabhedānisaṃsavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Tecīvarikaṅgakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". Tadanantaraṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tecīvarikaṅgaṃ"
      },
      " ‘‘catutthakacīvaraṃ paṭikkhipāmi, tecīvarikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
    ],
    "innerText": "25. Tadanantaraṃ pana tecīvarikaṅgaṃ ‘‘catutthakacīvaraṃ paṭikkhipāmi, tecīvarikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena pana tecīvarikena cīvaradussaṃ labhitvā yāva aphāsukabhāvena kātuṃ vā na sakkoti, vicārakaṃ vā na labhati, sūciādīsu vāssa kiñci na sampajjati, tāva nikkhipitabbaṃ. Nikkhittapaccayā doso natthi. Rajitakālato pana paṭṭhāya nikkhipituṃ na vaṭṭati, dhutaṅgacoro nāma hoti. Idamassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vidhānaṃ"
      },
      "."
    ],
    "innerText": "Tena pana tecīvarikena cīvaradussaṃ labhitvā yāva aphāsukabhāvena kātuṃ vā na sakkoti, vicārakaṃ vā na labhati, sūciādīsu vāssa kiñci na sampajjati, tāva nikkhipitabbaṃ. Nikkhittapaccayā doso natthi. Rajitakālato pana paṭṭhāya nikkhipituṃ na vaṭṭati, dhutaṅgacoro nāma hoti. Idamassa vidhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhedato"
      },
      " pana ayampi tividho hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkaṭṭhena"
      },
      " rajanakāle paṭhamaṃ antaravāsakaṃ vā uttarāsaṅgaṃ vā rajitvā taṃ nivāsetvā itaraṃ rajitabbaṃ. Taṃ pārupitvā saṅghāṭi rajitabbā. Saṅghāṭiṃ pana nivāsetuṃ na vaṭṭati. Idamassa gāmantasenāsane vattaṃ. Āraññake pana dve ekato dhovitvā rajituṃ vaṭṭati. Yathā pana kañci disvā sakkoti kāsāvaṃ ākaḍḍhitvā uparikātuṃ, evaṃ āsanne ṭhāne nisīditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhimassa"
      },
      " rajanasālāyaṃ rajanakāsāvaṃ nāma hoti, taṃ nivāsetvā vā pārupitvā vā rajanakammaṃ kātuṃ vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mudukassa"
      },
      " sabhāgabhikkhūnaṃ cīvarāni nivāsetvā vā pārupitvā vā rajanakammaṃ kātuṃ vaṭṭati. Tatraṭṭhakapaccattharaṇampi ",
      " tassa vaṭṭati. Pariharituṃ pana na vaṭṭati. Sabhāgabhikkhūnaṃ cīvarampi antarantarā paribhuñjituṃ vaṭṭati. Dhutaṅgatecīvarikassa pana catutthaṃ vattamānaṃ aṃsakāsāvameva vaṭṭati. Tañca kho vitthārato vidatthi, dīghato tihatthameva vaṭṭati."
    ],
    "innerText": "Pabhedato pana ayampi tividho hoti. Tattha ukkaṭṭhena rajanakāle paṭhamaṃ antaravāsakaṃ vā uttarāsaṅgaṃ vā rajitvā taṃ nivāsetvā itaraṃ rajitabbaṃ. Taṃ pārupitvā saṅghāṭi rajitabbā. Saṅghāṭiṃ pana nivāsetuṃ na vaṭṭati. Idamassa gāmantasenāsane vattaṃ. Āraññake pana dve ekato dhovitvā rajituṃ vaṭṭati. Yathā pana kañci disvā sakkoti kāsāvaṃ ākaḍḍhitvā uparikātuṃ, evaṃ āsanne ṭhāne nisīditabbaṃ. Majjhimassa rajanasālāyaṃ rajanakāsāvaṃ nāma hoti, taṃ nivāsetvā vā pārupitvā vā rajanakammaṃ kātuṃ vaṭṭati. Mudukassa sabhāgabhikkhūnaṃ cīvarāni nivāsetvā vā pārupitvā vā rajanakammaṃ kātuṃ vaṭṭati. Tatraṭṭhakapaccattharaṇampi tassa vaṭṭati. Pariharituṃ pana na vaṭṭati. Sabhāgabhikkhūnaṃ cīvarampi antarantarā paribhuñjituṃ vaṭṭati. Dhutaṅgatecīvarikassa pana catutthaṃ vattamānaṃ aṃsakāsāvameva vaṭṭati. Tañca kho vitthārato vidatthi, dīghato tihatthameva vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesaṃ pana tiṇṇampi catutthakacīvaraṃ sāditakkhaṇeyeva dhutaṅgaṃ bhijjati. Ayamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhedo"
      },
      "."
    ],
    "innerText": "Imesaṃ pana tiṇṇampi catutthakacīvaraṃ sāditakkhaṇeyeva dhutaṅgaṃ bhijjati. Ayamettha bhedo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "panānisaṃso,"
      },
      " tecīvariko bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena. Tenassa pakkhino viya samādāyeva gamanaṃ, appasamārambhatā, vatthasannidhiparivajjanaṃ, sallahukavuttitā, atirekacīvaraloluppappahānaṃ, kappiye mattakāritāya sallekhavuttitā, appicchatādīnaṃ phalanipphattīti evamādayo guṇā sampajjantīti."
    ],
    "innerText": "Ayaṃpanānisaṃso, tecīvariko bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena. Tenassa pakkhino viya samādāyeva gamanaṃ, appasamārambhatā, vatthasannidhiparivajjanaṃ, sallahukavuttitā, atirekacīvaraloluppappahānaṃ, kappiye mattakāritāya sallekhavuttitā, appicchatādīnaṃ phalanipphattīti evamādayo guṇā sampajjantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Atirekavatthataṇhaṃ, pahāya sannidhivivajjito dhīro;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Santosasukharasaññū, ticīvaradharo bhavati yogī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tasmā sapattacaraṇo, pakkhīva sacīvarova yogivaro;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sukhamanuvicaritukāmo, cīvaraniyame ratiṃ kayirāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ayaṃ tecīvarikaṅge samādānavidhānappabhedabhedānisaṃsavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Piṇḍapātikaṅgakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piṇḍapātikaṅgampi"
      },
      " ‘‘atirekalābhaṃ paṭikkhipāmi, piṇḍapātikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
    ],
    "innerText": "26.Piṇḍapātikaṅgampi ‘‘atirekalābhaṃ paṭikkhipāmi, piṇḍapātikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena pana piṇḍapātikena ‘‘saṅghabhattaṃ, uddesabhattaṃ, nimantanabhattaṃ, salākabhattaṃ, pakkhikaṃ, uposathikaṃ, pāṭipadikaṃ, āgantukabhattaṃ, gamikabhattaṃ, gilānabhattaṃ, gilānupaṭṭhākabhattaṃ, vihārabhattaṃ, dhurabhattaṃ, vārakabhatta’’nti etāni cuddasa bhattāni na sāditabbāni. Sace pana ‘‘saṅghabhattaṃ gaṇhathā’’tiādinā nayena avatvā ‘‘amhākaṃ gehe saṅgho bhikkhaṃ gaṇhātu, tumhepi bhikkhaṃ ",
      " gaṇhathā’’ti vatvā dinnāni honti, tāni sādituṃ vaṭṭanti. Saṅghato nirāmisasalākāpi vihāre pakkabhattampi vaṭṭatiyevāti idamassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vidhānaṃ"
      },
      "."
    ],
    "innerText": "Tena pana piṇḍapātikena ‘‘saṅghabhattaṃ, uddesabhattaṃ, nimantanabhattaṃ, salākabhattaṃ, pakkhikaṃ, uposathikaṃ, pāṭipadikaṃ, āgantukabhattaṃ, gamikabhattaṃ, gilānabhattaṃ, gilānupaṭṭhākabhattaṃ, vihārabhattaṃ, dhurabhattaṃ, vārakabhatta’’nti etāni cuddasa bhattāni na sāditabbāni. Sace pana ‘‘saṅghabhattaṃ gaṇhathā’’tiādinā nayena avatvā ‘‘amhākaṃ gehe saṅgho bhikkhaṃ gaṇhātu, tumhepi bhikkhaṃ gaṇhathā’’ti vatvā dinnāni honti, tāni sādituṃ vaṭṭanti. Saṅghato nirāmisasalākāpi vihāre pakkabhattampi vaṭṭatiyevāti idamassa vidhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhedato"
      },
      " pana ayampi tividho hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkaṭṭho"
      },
      " puratopi pacchatopi āhaṭabhikkhaṃ gaṇhati, pattadvāre ṭhatvā pattaṃ gaṇhantānampi deti, paṭikkamanaṃ āharitvā dinnabhikkhampi gaṇhati, taṃ divasaṃ pana nisīditvā bhikkhaṃ na gaṇhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhimo"
      },
      " taṃ divasaṃ nisīditvāpi gaṇhati, svātanāya pana nādhivāseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muduko"
      },
      "svātanāyapi punadivasāyapi bhikkhaṃ adhivāseti. Te ubhopi serivihārasukhaṃ na labhanti, ukkaṭṭhova labhati. Ekasmiṃ kira ",
      " gāme ariyavaṃso hoti, ukkaṭṭho itare āha – ‘‘āyāmāvuso, dhammasavanāyā’’ti. Tesu eko ekenamhi, bhante, manussena nisīdāpitoti āha. Aparo mayā, bhante, svātanāya ekassa bhikkhā adhivāsitāti. Evaṃ te ubho parihīnā. Itaro pātova piṇḍāya caritvā gantvā dhammarasaṃ paṭisaṃvedesi."
    ],
    "innerText": "Pabhedato pana ayampi tividho hoti. Tattha ukkaṭṭho puratopi pacchatopi āhaṭabhikkhaṃ gaṇhati, pattadvāre ṭhatvā pattaṃ gaṇhantānampi deti, paṭikkamanaṃ āharitvā dinnabhikkhampi gaṇhati, taṃ divasaṃ pana nisīditvā bhikkhaṃ na gaṇhati. Majjhimo taṃ divasaṃ nisīditvāpi gaṇhati, svātanāya pana nādhivāseti. Mudukosvātanāyapi punadivasāyapi bhikkhaṃ adhivāseti. Te ubhopi serivihārasukhaṃ na labhanti, ukkaṭṭhova labhati. Ekasmiṃ kira gāme ariyavaṃso hoti, ukkaṭṭho itare āha – ‘‘āyāmāvuso, dhammasavanāyā’’ti. Tesu eko ekenamhi, bhante, manussena nisīdāpitoti āha. Aparo mayā, bhante, svātanāya ekassa bhikkhā adhivāsitāti. Evaṃ te ubho parihīnā. Itaro pātova piṇḍāya caritvā gantvā dhammarasaṃ paṭisaṃvedesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesaṃ pana tiṇṇampi saṅghabhattādiatirekalābhaṃ sāditakkhaṇeva dhutaṅgaṃ bhijjati. Ayamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhedo"
      },
      "."
    ],
    "innerText": "Imesaṃ pana tiṇṇampi saṅghabhattādiatirekalābhaṃ sāditakkhaṇeva dhutaṅgaṃ bhijjati. Ayamettha bhedo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ panānisaṃso,"
      },
      " ‘‘piṇḍiyālopabhojanaṃ nissāya pabbajjā’’ti (a. ni. 4.27; itivu. 101) vacanato nissayānurūpapaṭipattisabbhāvo, dutiye ariyavaṃse patiṭṭhānaṃ, aparāyattavuttitā, ‘‘appāni ceva sulabhāni ca tāni ca anavajjānī’’ti bhagavatā saṃvaṇṇitapaccayatā, kosajjanimmaddanatā, parisuddhājīvatā, sekhiyapaṭipattipūraṇaṃ, aparapositā, parānuggahakiriyā, mānappahānaṃ, rasataṇhānivāraṇaṃ, gaṇabhojanaparamparabhojanacārittasikkhāpadehi anāpattitā, appicchatādīnaṃ anulomavuttitā, sammāpaṭipattibrūhanaṃ, pacchimajanatānukampananti."
    ],
    "innerText": "Ayaṃ panānisaṃso, ‘‘piṇḍiyālopabhojanaṃ nissāya pabbajjā’’ti (a. ni. 4.27; itivu. 101) vacanato nissayānurūpapaṭipattisabbhāvo, dutiye ariyavaṃse patiṭṭhānaṃ, aparāyattavuttitā, ‘‘appāni ceva sulabhāni ca tāni ca anavajjānī’’ti bhagavatā saṃvaṇṇitapaccayatā, kosajjanimmaddanatā, parisuddhājīvatā, sekhiyapaṭipattipūraṇaṃ, aparapositā, parānuggahakiriyā, mānappahānaṃ, rasataṇhānivāraṇaṃ, gaṇabhojanaparamparabhojanacārittasikkhāpadehi anāpattitā, appicchatādīnaṃ anulomavuttitā, sammāpaṭipattibrūhanaṃ, pacchimajanatānukampananti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Piṇḍiyālopasantuṭṭho, aparāyattajīviko;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pahīnāhāraloluppo, hoti cātuddiso yati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Vinodayati ",
      " kosajjaṃ, ājīvassa visujjhati;"
    ],
    "innerText": "Vinodayati kosajjaṃ, ājīvassa visujjhati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā hi nātimaññeyya, bhikkhācariyāya sumedhaso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evarūpassa hi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Piṇḍapātikassa bhikkhuno,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Attabharassa anaññaposino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Devāpi pihayanti tādino,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "No ce lābhasilokanissito’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ayaṃ piṇḍapātikaṅge samādānavidhānappabhedabhedānisaṃsavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Sapadānacārikaṅgakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sapadānacārikaṅgampi"
      },
      " ‘‘loluppacāraṃ paṭikkhipāmi, sapadānacārikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
    ],
    "innerText": "27.Sapadānacārikaṅgampi ‘‘loluppacāraṃ paṭikkhipāmi, sapadānacārikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena pana sapadānacārikena gāmadvāre ṭhatvā parissayābhāvo sallakkhetabbo. Yassā racchāya vā gāme vā parissayo hoti, taṃ pahāya aññattha carituṃ vaṭṭati. Yasmiṃ gharadvāre vā racchāya vā gāme vā kiñci na labhati, agāmasaññaṃ katvā gantabbaṃ. Yattha kiñci labhati, taṃ pahāya gantuṃ na vaṭṭati. Iminā ca bhikkhunā kālataraṃ pavisitabbaṃ, evañhi aphāsukaṭṭhānaṃ pahāya aññattha gantuṃ sakkhissati. Sace panassa vihāre dānaṃ dentā antarāmagge vā āgacchantā manussā pattaṃ gahetvā piṇḍapātaṃ denti vaṭṭati. Iminā ca maggaṃ gacchantenāpi bhikkhācāravelāyaṃ sampattagāmaṃ anatikkamitvā caritabbameva. Tattha alabhitvā vā thokaṃ labhitvā vā gāmapaṭipāṭiyā caritabbanti idamassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vidhānaṃ"
      },
      "."
    ],
    "innerText": "Tena pana sapadānacārikena gāmadvāre ṭhatvā parissayābhāvo sallakkhetabbo. Yassā racchāya vā gāme vā parissayo hoti, taṃ pahāya aññattha carituṃ vaṭṭati. Yasmiṃ gharadvāre vā racchāya vā gāme vā kiñci na labhati, agāmasaññaṃ katvā gantabbaṃ. Yattha kiñci labhati, taṃ pahāya gantuṃ na vaṭṭati. Iminā ca bhikkhunā kālataraṃ pavisitabbaṃ, evañhi aphāsukaṭṭhānaṃ pahāya aññattha gantuṃ sakkhissati. Sace panassa vihāre dānaṃ dentā antarāmagge vā āgacchantā manussā pattaṃ gahetvā piṇḍapātaṃ denti vaṭṭati. Iminā ca maggaṃ gacchantenāpi bhikkhācāravelāyaṃ sampattagāmaṃ anatikkamitvā caritabbameva. Tattha alabhitvā vā thokaṃ labhitvā vā gāmapaṭipāṭiyā caritabbanti idamassa vidhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhedato"
      },
      " pana ayampi tividho hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkaṭṭho"
      },
      " purato āhaṭabhikkhampi pacchato āhaṭabhikkhampi paṭikkamanaṃ āharitvā diyyamānampi na gaṇhati, pattadvāre pana pattaṃ vissajjeti ",
      ". Imasmiñhi dhutaṅge mahākassapattherena sadiso nāma natthi. Tassapi pattavissaṭṭhaṭṭhānameva paññāyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhimo"
      },
      " purato vā pacchato vā āhaṭampi paṭikkamanaṃ āhaṭampi gaṇhati, pattadvārepi pattaṃ vissajjeti, na pana bhikkhaṃ āgamayamāno nisīdati. Evaṃ so ukkaṭṭhapiṇḍapātikassa anulometi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muduko"
      },
      " taṃ divasaṃ nisīditvā āgameti."
    ],
    "innerText": "Pabhedato pana ayampi tividho hoti. Tattha ukkaṭṭho purato āhaṭabhikkhampi pacchato āhaṭabhikkhampi paṭikkamanaṃ āharitvā diyyamānampi na gaṇhati, pattadvāre pana pattaṃ vissajjeti . Imasmiñhi dhutaṅge mahākassapattherena sadiso nāma natthi. Tassapi pattavissaṭṭhaṭṭhānameva paññāyati. Majjhimo purato vā pacchato vā āhaṭampi paṭikkamanaṃ āhaṭampi gaṇhati, pattadvārepi pattaṃ vissajjeti, na pana bhikkhaṃ āgamayamāno nisīdati. Evaṃ so ukkaṭṭhapiṇḍapātikassa anulometi. Muduko taṃ divasaṃ nisīditvā āgameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesaṃ pana tiṇṇampi loluppacāre uppannamatte dhutaṅgaṃ bhijjati. Ayamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhedo"
      },
      "."
    ],
    "innerText": "Imesaṃ pana tiṇṇampi loluppacāre uppannamatte dhutaṅgaṃ bhijjati. Ayamettha bhedo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ panānisaṃso,"
      },
      " kulesu niccanavakatā, candūpamatā, kulamaccherappahānaṃ, samānukampitā, kulūpakādīnavābhāvo, avhānānabhinandanā, abhihārena anatthikatā, appicchatādīnaṃ anulomavuttitāti."
    ],
    "innerText": "Ayaṃ panānisaṃso, kulesu niccanavakatā, candūpamatā, kulamaccherappahānaṃ, samānukampitā, kulūpakādīnavābhāvo, avhānānabhinandanā, abhihārena anatthikatā, appicchatādīnaṃ anulomavuttitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Candūpamo ",
      " niccanavo kulesu,"
    ],
    "innerText": "Candūpamo niccanavo kulesu,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Amaccharī sabbasamānukampo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Kulūpakādīnavavippamutto,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Hotīdha bhikkhu sapadānacārī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Loluppacārañca pahāya tasmā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Okkhittacakkhu yugamattadassī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Ākaṅkhamāno bhuvi sericāraṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Careyya dhīro sapadānacāranti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ayaṃ sapadānacārikaṅge samādānavidhānappabhedabhedānisaṃsavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Ekāsanikaṅgakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekāsanikaṅgampi"
      },
      " ‘‘nānāsanabhojanaṃ paṭikkhipāmi, ekāsanikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
    ],
    "innerText": "28.Ekāsanikaṅgampi ‘‘nānāsanabhojanaṃ paṭikkhipāmi, ekāsanikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " pana ekāsanikena āsanasālāyaṃ nisīdantena therāsane anisīditvā ‘‘idaṃ mayhaṃ pāpuṇissatī’’ti patirūpaṃ āsanaṃ sallakkhetvā nisīditabbaṃ. Sacassa vippakate bhojane ācariyo vā upajjhāyo vā āgacchati, uṭṭhāya vattaṃ kātuṃ vaṭṭati. Tipiṭakacūḷābhayatthero panāha ‘‘āsanaṃ vā rakkheyya bhojanaṃ vā, ayañca vippakatabhojano, tasmā vattaṃ karotu, bhojanaṃ pana mā bhuñjatū’’ti. Idamassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vidhānaṃ"
      },
      "."
    ],
    "innerText": "Tena pana ekāsanikena āsanasālāyaṃ nisīdantena therāsane anisīditvā ‘‘idaṃ mayhaṃ pāpuṇissatī’’ti patirūpaṃ āsanaṃ sallakkhetvā nisīditabbaṃ. Sacassa vippakate bhojane ācariyo vā upajjhāyo vā āgacchati, uṭṭhāya vattaṃ kātuṃ vaṭṭati. Tipiṭakacūḷābhayatthero panāha ‘‘āsanaṃ vā rakkheyya bhojanaṃ vā, ayañca vippakatabhojano, tasmā vattaṃ karotu, bhojanaṃ pana mā bhuñjatū’’ti. Idamassa vidhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhedato"
      },
      " pana ayampi tividho hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkaṭṭho"
      },
      " appaṃ vā hotu bahu vā, yamhi bhojane hatthaṃ otāreti, tato aññaṃ gaṇhituṃ na labhati. Sacepi manussā ‘‘therena na kiñci bhutta’’nti sappiādīni āharanti, bhesajjatthameva vaṭṭanti, na āhāratthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhimo"
      },
      " yāva patte bhattaṃ na khīyati, tāva aññaṃ gaṇhituṃ labhati. Ayañhi bhojanapariyantiko nāma hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muduko"
      },
      " yāva āsanā na vuṭṭhāti tāva bhuñjituṃ labhati. So hi udakapariyantiko vā hoti yāva pattadhovanaṃ na gaṇhāti tāva bhuñjanato, āsanapariyantiko vā yāva na vuṭṭhāti tāva bhuñjanato."
    ],
    "innerText": "Pabhedato pana ayampi tividho hoti. Tattha ukkaṭṭho appaṃ vā hotu bahu vā, yamhi bhojane hatthaṃ otāreti, tato aññaṃ gaṇhituṃ na labhati. Sacepi manussā ‘‘therena na kiñci bhutta’’nti sappiādīni āharanti, bhesajjatthameva vaṭṭanti, na āhāratthaṃ. Majjhimo yāva patte bhattaṃ na khīyati, tāva aññaṃ gaṇhituṃ labhati. Ayañhi bhojanapariyantiko nāma hoti. Muduko yāva āsanā na vuṭṭhāti tāva bhuñjituṃ labhati. So hi udakapariyantiko vā hoti yāva pattadhovanaṃ na gaṇhāti tāva bhuñjanato, āsanapariyantiko vā yāva na vuṭṭhāti tāva bhuñjanato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesaṃ ",
      " pana tiṇṇampi nānāsanabhojanaṃ bhuttakkhaṇe dhutaṅgaṃ bhijjati. Ayamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhedo"
      },
      "."
    ],
    "innerText": "Imesaṃ pana tiṇṇampi nānāsanabhojanaṃ bhuttakkhaṇe dhutaṅgaṃ bhijjati. Ayamettha bhedo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ panānisaṃso,"
      },
      " appābādhatā, appātaṅkatā, lahuṭṭhānaṃ, balaṃ, phāsuvihāro, anatirittapaccayā anāpatti, rasataṇhāvinodanaṃ appicchatādīnaṃ anulomavuttitāti."
    ],
    "innerText": "Ayaṃ panānisaṃso, appābādhatā, appātaṅkatā, lahuṭṭhānaṃ, balaṃ, phāsuvihāro, anatirittapaccayā anāpatti, rasataṇhāvinodanaṃ appicchatādīnaṃ anulomavuttitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ekāsanabhojane rataṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Na yatiṃ bhojanapaccayā rujā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Visahanti rase alolupo,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Parihāpeti na kammamattano."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Iti phāsuvihārakāraṇe,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sucisallekharatūpasevite;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Janayetha visuddhamānaso,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ratimekāsanabhojane yatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ayaṃ ekāsanikaṅge samādānavidhānappabhedabhedānisaṃsavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Pattapiṇḍikaṅgakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "29"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pattapiṇḍikaṅgampi"
      },
      " ‘‘dutiyakabhājanaṃ paṭikkhipāmi, pattapiṇḍikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
    ],
    "innerText": "29.Pattapiṇḍikaṅgampi ‘‘dutiyakabhājanaṃ paṭikkhipāmi, pattapiṇḍikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena pana pattapiṇḍikena yāgupānakāle bhājane ṭhapetvā byañjane laddhe byañjanaṃ vā paṭhamaṃ khāditabbaṃ, yāgu vā pātabbā. Sace pana yāguyaṃ pakkhipati, pūtimacchakādimhi byañjane pakkhitte yāgu paṭikūlā hoti, appaṭikūlameva ca katvā bhuñjituṃ vaṭṭati. Tasmā tathārūpaṃ byañjanaṃ sandhāya idaṃ vuttaṃ. Yaṃ pana madhusakkarādikaṃ appaṭikūlaṃ hoti, taṃ pakkhipitabbaṃ. Gaṇhantena ca pamāṇayuttameva gaṇhitabbaṃ. Āmakasākaṃ hatthena gahetvā khādituṃ vaṭṭati. Tathā pana akatvā patteyeva pakkhipitabbaṃ. Dutiyakabhājanassa pana paṭikkhittattā aññaṃ rukkhapaṇṇampi na vaṭṭatīti idamassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vidhānaṃ"
      },
      "."
    ],
    "innerText": "Tena pana pattapiṇḍikena yāgupānakāle bhājane ṭhapetvā byañjane laddhe byañjanaṃ vā paṭhamaṃ khāditabbaṃ, yāgu vā pātabbā. Sace pana yāguyaṃ pakkhipati, pūtimacchakādimhi byañjane pakkhitte yāgu paṭikūlā hoti, appaṭikūlameva ca katvā bhuñjituṃ vaṭṭati. Tasmā tathārūpaṃ byañjanaṃ sandhāya idaṃ vuttaṃ. Yaṃ pana madhusakkarādikaṃ appaṭikūlaṃ hoti, taṃ pakkhipitabbaṃ. Gaṇhantena ca pamāṇayuttameva gaṇhitabbaṃ. Āmakasākaṃ hatthena gahetvā khādituṃ vaṭṭati. Tathā pana akatvā patteyeva pakkhipitabbaṃ. Dutiyakabhājanassa pana paṭikkhittattā aññaṃ rukkhapaṇṇampi na vaṭṭatīti idamassa vidhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhedato"
      },
      " pana ayampi tividho hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkaṭṭhassa"
      },
      " aññatra ucchukhādanakālā kacavarampi chaḍḍetuṃ na vaṭṭati. Odanapiṇḍamacchamaṃsapūvepi bhinditvā ",
      " khādituṃ na vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhimassa"
      },
      " ekena hatthena bhinditvā khādituṃ vaṭṭati, hatthayogī nāmesa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muduko"
      },
      " pana pattayogī nāma hoti, tassa yaṃ sakkā hoti patte pakkhipituṃ, taṃ sabbaṃ hatthena vā dantehi vā bhinditvā khādituṃ vaṭṭati."
    ],
    "innerText": "Pabhedato pana ayampi tividho hoti. Tattha ukkaṭṭhassa aññatra ucchukhādanakālā kacavarampi chaḍḍetuṃ na vaṭṭati. Odanapiṇḍamacchamaṃsapūvepi bhinditvā khādituṃ na vaṭṭati. Majjhimassa ekena hatthena bhinditvā khādituṃ vaṭṭati, hatthayogī nāmesa. Muduko pana pattayogī nāma hoti, tassa yaṃ sakkā hoti patte pakkhipituṃ, taṃ sabbaṃ hatthena vā dantehi vā bhinditvā khādituṃ vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesaṃ pana tiṇṇampi dutiyakabhājanaṃ sāditakkhaṇe dhutaṅgaṃ bhijjati. Ayamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhedo"
      },
      "."
    ],
    "innerText": "Imesaṃ pana tiṇṇampi dutiyakabhājanaṃ sāditakkhaṇe dhutaṅgaṃ bhijjati. Ayamettha bhedo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ panānisaṃso,"
      },
      " nānārasataṇhāvinodanaṃ. Atricchatāya pahānaṃ, āhāre payojanamattadassitā, thālakādipariharaṇakhedābhāvo, avikkhittabhojitā, appicchatādīnaṃ anulomavuttitāti."
    ],
    "innerText": "Ayaṃ panānisaṃso, nānārasataṇhāvinodanaṃ. Atricchatāya pahānaṃ, āhāre payojanamattadassitā, thālakādipariharaṇakhedābhāvo, avikkhittabhojitā, appicchatādīnaṃ anulomavuttitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nānābhājanavikkhepaṃ, hitvā okkhittalocano;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khaṇanto viya mūlāni, rasataṇhāya subbato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Sarūpaṃ ",
      " viya santuṭṭhiṃ, dhārayanto sumānaso;"
    ],
    "innerText": "Sarūpaṃ viya santuṭṭhiṃ, dhārayanto sumānaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paribhuñjeyya āhāraṃ, ko añño pattapiṇḍikoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ pattapiṇḍikaṅge samādānavidhānappabhedabhedānisaṃsavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Khalupacchābhattikaṅgakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khalupacchābhattikaṅgampi"
      },
      " ‘‘atirittabhojanaṃ paṭikkhipāmi, khalupacchābhattikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
    ],
    "innerText": "30.Khalupacchābhattikaṅgampi ‘‘atirittabhojanaṃ paṭikkhipāmi, khalupacchābhattikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena pana khalupacchābhattikena pavāretvā puna bhojanaṃ kappiyaṃ kāretvā na bhuñjitabbaṃ. Idamassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vidhānaṃ"
      },
      "."
    ],
    "innerText": "Tena pana khalupacchābhattikena pavāretvā puna bhojanaṃ kappiyaṃ kāretvā na bhuñjitabbaṃ. Idamassa vidhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhedato"
      },
      " pana ayampi tividho hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkaṭṭho"
      },
      " yasmā paṭhamapiṇḍe pavāraṇā nāma natthi, tasmiṃ pana ajjhohariyamāne aññaṃ paṭikkhipato hoti, tasmā evaṃ pavārito paṭhamapiṇḍaṃ ajjhoharitvā dutiyapiṇḍaṃ na bhuñjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhimo"
      },
      " yasmiṃ bhojane pavārito, tadeva bhuñjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muduko"
      },
      " pana yāva āsanā na vuṭṭhāti tāva bhuñjati."
    ],
    "innerText": "Pabhedato pana ayampi tividho hoti. Tattha ukkaṭṭho yasmā paṭhamapiṇḍe pavāraṇā nāma natthi, tasmiṃ pana ajjhohariyamāne aññaṃ paṭikkhipato hoti, tasmā evaṃ pavārito paṭhamapiṇḍaṃ ajjhoharitvā dutiyapiṇḍaṃ na bhuñjati. Majjhimo yasmiṃ bhojane pavārito, tadeva bhuñjati. Muduko pana yāva āsanā na vuṭṭhāti tāva bhuñjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesaṃ pana tiṇṇampi pavāritānaṃ kappiyaṃ kārāpetvā bhuttakkhaṇe dhutaṅgaṃ bhijjati. Ayamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhedo"
      },
      "."
    ],
    "innerText": "Imesaṃ pana tiṇṇampi pavāritānaṃ kappiyaṃ kārāpetvā bhuttakkhaṇe dhutaṅgaṃ bhijjati. Ayamettha bhedo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "panānisaṃso,"
      },
      " anatirittabhojanāpattiyā dūrabhāvo, odarikattābhāvo, nirāmisasannidhitā, puna pariyesanāya abhāvo, appicchatādīnaṃ anulomavuttitāti."
    ],
    "innerText": "Ayaṃpanānisaṃso, anatirittabhojanāpattiyā dūrabhāvo, odarikattābhāvo, nirāmisasannidhitā, puna pariyesanāya abhāvo, appicchatādīnaṃ anulomavuttitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pariyesanāya khedaṃ, na yāti na karoti sannidhiṃ dhīro;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Odarikattaṃ pajahati, khalupacchābhattiko yogī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Tasmā ",
      " sugatapasatthaṃ, santosaguṇādivuḍḍhisañjananaṃ;"
    ],
    "innerText": "Tasmā sugatapasatthaṃ, santosaguṇādivuḍḍhisañjananaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dose vidhunitukāmo, bhajeyya yogī dhutaṅgamidanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ khalupacchābhattikaṅge samādānavidhānappabhedabhedānisaṃsavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Āraññikaṅgakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āraññikaṅgampi"
      },
      " ‘‘gāmantasenāsanaṃ paṭikkhipāmi, āraññikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
    ],
    "innerText": "31.Āraññikaṅgampi ‘‘gāmantasenāsanaṃ paṭikkhipāmi, āraññikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena pana āraññikena gāmantasenāsanaṃ pahāya araññe aruṇaṃ uṭṭhāpetabbaṃ. Tattha saddhiṃ upacārena gāmoyeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gāmantasenāsanaṃ"
      },
      "."
    ],
    "innerText": "Tena pana āraññikena gāmantasenāsanaṃ pahāya araññe aruṇaṃ uṭṭhāpetabbaṃ. Tattha saddhiṃ upacārena gāmoyeva gāmantasenāsanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gāmo"
      },
      " nāma yo koci ekakuṭiko vā anekakuṭiko vā parikkhitto vā aparikkhitto vā samanusso vā amanusso vā antamaso atirekacātumāsaniviṭṭho yo koci satthopi."
    ],
    "innerText": "Gāmo nāma yo koci ekakuṭiko vā anekakuṭiko vā parikkhitto vā aparikkhitto vā samanusso vā amanusso vā antamaso atirekacātumāsaniviṭṭho yo koci satthopi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gāmūpacāro"
      },
      " nāma parikkhittassa gāmassa sace anurādhapurasseva dve indakhīlā honti, abbhantarime indakhīle ṭhitassa thāmamajjhimassa purisassa leḍḍupāto. Tassa lakkhaṇaṃ yathā taruṇamanussā attano balaṃ dassentā bāhaṃ pasāretvā leḍḍuṃ khipanti, evaṃ khittassa leḍḍussa patanaṭṭhānabbhantaranti vinayadharā. Suttantikā pana kākanivāraṇaniyamena khittassāti vadanti. Aparikkhittagāme yaṃ sabbapaccantimassa gharassa dvāre ṭhito mātugāmo bhājanena udakaṃ chaḍḍeti, tassa patanaṭṭhānaṃ gharūpacāro. Tato vuttanayena eko leḍḍupāto gāmo, dutiyo gāmūpacāro."
    ],
    "innerText": "Gāmūpacāro nāma parikkhittassa gāmassa sace anurādhapurasseva dve indakhīlā honti, abbhantarime indakhīle ṭhitassa thāmamajjhimassa purisassa leḍḍupāto. Tassa lakkhaṇaṃ yathā taruṇamanussā attano balaṃ dassentā bāhaṃ pasāretvā leḍḍuṃ khipanti, evaṃ khittassa leḍḍussa patanaṭṭhānabbhantaranti vinayadharā. Suttantikā pana kākanivāraṇaniyamena khittassāti vadanti. Aparikkhittagāme yaṃ sabbapaccantimassa gharassa dvāre ṭhito mātugāmo bhājanena udakaṃ chaḍḍeti, tassa patanaṭṭhānaṃ gharūpacāro. Tato vuttanayena eko leḍḍupāto gāmo, dutiyo gāmūpacāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Araññaṃ"
      },
      " pana vinayapariyāye tāva ‘‘ṭhapetvā gāmañca gāmūpacārañca sabbametaṃ arañña’’nti (pārā. 92) vuttaṃ. Abhidhammapariyāye ‘‘nikkhamitvā bahi indakhīlā, sabbametaṃ ",
      " arañña’’nti (vibha. 529) vuttaṃ. Imasmiṃ pana suttantikapariyāye ‘‘āraññakaṃ nāma senāsanaṃ pañcadhanusatikaṃ pacchima’’nti idaṃ lakkhaṇaṃ. Taṃ āropitena ācariyadhanunā parikkhittassa gāmassa ",
      " indakhīlato aparikkhittassa paṭhamaleḍḍupātato paṭṭhāya yāva vihāraparikkhepā minitvā vavatthapetabbaṃ."
    ],
    "innerText": "Araññaṃ pana vinayapariyāye tāva ‘‘ṭhapetvā gāmañca gāmūpacārañca sabbametaṃ arañña’’nti (pārā. 92) vuttaṃ. Abhidhammapariyāye ‘‘nikkhamitvā bahi indakhīlā, sabbametaṃ arañña’’nti (vibha. 529) vuttaṃ. Imasmiṃ pana suttantikapariyāye ‘‘āraññakaṃ nāma senāsanaṃ pañcadhanusatikaṃ pacchima’’nti idaṃ lakkhaṇaṃ. Taṃ āropitena ācariyadhanunā parikkhittassa gāmassa indakhīlato aparikkhittassa paṭhamaleḍḍupātato paṭṭhāya yāva vihāraparikkhepā minitvā vavatthapetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sace pana vihāro aparikkhitto hoti, yaṃ sabbapaṭhamaṃ senāsanaṃ vā bhattasālā vā dhuvasannipātaṭṭhānaṃ vā bodhi vā cetiyaṃ vā dūre cepi senāsanato hoti, taṃ paricchedaṃ katvā minitabbanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinayaṭṭhakathāsu"
      },
      " vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhimaṭṭhakathāyaṃ"
      },
      " pana vihārassapi gāmasseva upacāraṃ nīharitvā ubhinnaṃ leḍḍupātānaṃ antarā minitabbanti vuttaṃ. Idamettha pamāṇaṃ."
    ],
    "innerText": "Sace pana vihāro aparikkhitto hoti, yaṃ sabbapaṭhamaṃ senāsanaṃ vā bhattasālā vā dhuvasannipātaṭṭhānaṃ vā bodhi vā cetiyaṃ vā dūre cepi senāsanato hoti, taṃ paricchedaṃ katvā minitabbanti vinayaṭṭhakathāsu vuttaṃ. Majjhimaṭṭhakathāyaṃ pana vihārassapi gāmasseva upacāraṃ nīharitvā ubhinnaṃ leḍḍupātānaṃ antarā minitabbanti vuttaṃ. Idamettha pamāṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sacepi āsanne gāmo hoti, vihāre ṭhitehi mānusakānaṃ saddo suyyati, pabbatanadīādīhi pana antaritattā na sakkā ujuṃ gantuṃ. Yo tassa pakatimaggo hoti, sacepi nāvāya sañcaritabbo, tena maggena pañcadhanusatikaṃ gahetabbaṃ. Yo pana āsannagāmassa aṅgasampādanatthaṃ tato tato maggaṃ pidahati, ayaṃ dhutaṅgacoro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sace pana āraññikassa bhikkhuno upajjhāyo vā ācariyo vā gilāno hoti, tena araññe sappāyaṃ alabhantena gāmantasenāsanaṃ netvā upaṭṭhātabbo. Kālasseva pana nikkhamitvā aṅgayuttaṭṭhāne aruṇaṃ uṭṭhāpetabbaṃ. Sace aruṇuṭṭhānavelāyaṃ tesaṃ ābādho vaḍḍhati, tesaṃyeva kiccaṃ kātabbaṃ. Na dhutaṅgasuddhikena bhavitabbanti idamassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vidhānaṃ"
      },
      "."
    ],
    "innerText": "Sace pana āraññikassa bhikkhuno upajjhāyo vā ācariyo vā gilāno hoti, tena araññe sappāyaṃ alabhantena gāmantasenāsanaṃ netvā upaṭṭhātabbo. Kālasseva pana nikkhamitvā aṅgayuttaṭṭhāne aruṇaṃ uṭṭhāpetabbaṃ. Sace aruṇuṭṭhānavelāyaṃ tesaṃ ābādho vaḍḍhati, tesaṃyeva kiccaṃ kātabbaṃ. Na dhutaṅgasuddhikena bhavitabbanti idamassa vidhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhedato"
      },
      " pana ayampi tividho hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkaṭṭhena"
      },
      " sabbakālaṃ araññe aruṇaṃ uṭṭhāpetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhimo"
      },
      " cattāro vassike māse gāmante vasituṃ labhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muduko"
      },
      " hemantikepi."
    ],
    "innerText": "Pabhedato pana ayampi tividho hoti. Tattha ukkaṭṭhena sabbakālaṃ araññe aruṇaṃ uṭṭhāpetabbaṃ. Majjhimo cattāro vassike māse gāmante vasituṃ labhati. Muduko hemantikepi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesaṃ pana tiṇṇampi yathā paricchinne kāle araññato āgantvā gāmantasenāsane dhammassavanaṃ suṇantānaṃ aruṇe uṭṭhitepi dhutaṅgaṃ na bhijjati. Sutvā gacchantānaṃ antarāmagge uṭṭhitepi na bhijjati. Sace pana uṭṭhitepi dhammakathike muhuttaṃ nipajjitvā gamissāmāti niddāyantānaṃ aruṇaṃ uṭṭhahati, attano vā ruciyā gāmantasenāsane aruṇaṃ uṭṭhapenti, dhutaṅgaṃ bhijjatīti ayamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhedo"
      },
      "."
    ],
    "innerText": "Imesaṃ pana tiṇṇampi yathā paricchinne kāle araññato āgantvā gāmantasenāsane dhammassavanaṃ suṇantānaṃ aruṇe uṭṭhitepi dhutaṅgaṃ na bhijjati. Sutvā gacchantānaṃ antarāmagge uṭṭhitepi na bhijjati. Sace pana uṭṭhitepi dhammakathike muhuttaṃ nipajjitvā gamissāmāti niddāyantānaṃ aruṇaṃ uṭṭhahati, attano vā ruciyā gāmantasenāsane aruṇaṃ uṭṭhapenti, dhutaṅgaṃ bhijjatīti ayamettha bhedo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "panānisaṃso,"
      },
      " āraññiko bhikkhu araññasaññaṃ manasikaronto bhabbo aladdhaṃ vā ",
      " samādhiṃ paṭiladdhuṃ laddhaṃ vā rakkhituṃ, satthāpissa attamano hoti. Yathāha – ‘‘tenāhaṃ, nāgita, tassa bhikkhuno attamano homi araññavihārenā’’ti (a. ni. 6.42; 8.86). Pantasenāsanavāsino cassa asappāyarūpādayo cittaṃ na vikkhipanti, vigatasantāso hoti, jīvitanikantiṃ jahati, pavivekasukharasaṃ assādeti, paṃsukūlikādibhāvopi cassa patirūpo hotīti."
    ],
    "innerText": "Ayaṃpanānisaṃso, āraññiko bhikkhu araññasaññaṃ manasikaronto bhabbo aladdhaṃ vā samādhiṃ paṭiladdhuṃ laddhaṃ vā rakkhituṃ, satthāpissa attamano hoti. Yathāha – ‘‘tenāhaṃ, nāgita, tassa bhikkhuno attamano homi araññavihārenā’’ti (a. ni. 6.42; 8.86). Pantasenāsanavāsino cassa asappāyarūpādayo cittaṃ na vikkhipanti, vigatasantāso hoti, jīvitanikantiṃ jahati, pavivekasukharasaṃ assādeti, paṃsukūlikādibhāvopi cassa patirūpo hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pavivitto asaṃsaṭṭho, pantasenāsane rato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ārādhayanto nāthassa, vanavāsena mānasaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Eko araññe nivasaṃ, yaṃ sukhaṃ labhate yati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rasaṃ tassa na vindanti, api devā saindakā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Paṃsukūlañca esova, kavacaṃ viya dhārayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Araññasaṅgāmagato, avasesadhutāyudho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Samattho nacirasseva, jetuṃ māraṃ savāhiniṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā araññavāsamhi, ratiṃ kayirātha paṇḍitoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ āraññikaṅge samādānavidhānappabhedabhedānisaṃsavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Rukkhamūlikaṅgakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "32"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rukkhamūlikaṅgampi"
      },
      " ‘‘channaṃ paṭikkhipāmi, rukkhamūlikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
    ],
    "innerText": "32.Rukkhamūlikaṅgampi ‘‘channaṃ paṭikkhipāmi, rukkhamūlikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena pana rukkhamūlikena sīmantarikarukkhaṃ, cetiyarukkhaṃ, niyyāsarukkhaṃ, phalarukkhaṃ, vaggulirukkhaṃ, susirarukkhaṃ, vihāramajjhe ṭhitarukkhanti ime rukkhe vivajjetvā vihārapaccante ṭhitarukkho gahetabboti idamassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vidhānaṃ"
      },
      "."
    ],
    "innerText": "Tena pana rukkhamūlikena sīmantarikarukkhaṃ, cetiyarukkhaṃ, niyyāsarukkhaṃ, phalarukkhaṃ, vaggulirukkhaṃ, susirarukkhaṃ, vihāramajjhe ṭhitarukkhanti ime rukkhe vivajjetvā vihārapaccante ṭhitarukkho gahetabboti idamassa vidhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhedato"
      },
      " pana ayampi tividho hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkaṭṭho"
      },
      " yathārucitaṃ rukkhaṃ gahetvā paṭijaggāpetuṃ na labhati. Pādena paṇṇasaṭaṃ apanetvā vasitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhimo"
      },
      " taṃ ṭhānaṃ sampattehiyeva paṭijaggāpetuṃ labhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mudukena"
      },
      " ārāmikasamaṇuddese pakkositvā sodhāpetvā samaṃ kārāpetvā ",
      " vālukaṃ okirāpetvā pākāraparikkhepaṃ kārāpetvā dvāraṃ ",
      " yojāpetvā vasitabbaṃ. Mahadivase pana rukkhamūlikena tattha anisīditvā aññattha paṭicchanne ṭhāne nisīditabbaṃ."
    ],
    "innerText": "Pabhedato pana ayampi tividho hoti. Tattha ukkaṭṭho yathārucitaṃ rukkhaṃ gahetvā paṭijaggāpetuṃ na labhati. Pādena paṇṇasaṭaṃ apanetvā vasitabbaṃ. Majjhimo taṃ ṭhānaṃ sampattehiyeva paṭijaggāpetuṃ labhati. Mudukena ārāmikasamaṇuddese pakkositvā sodhāpetvā samaṃ kārāpetvā vālukaṃ okirāpetvā pākāraparikkhepaṃ kārāpetvā dvāraṃ yojāpetvā vasitabbaṃ. Mahadivase pana rukkhamūlikena tattha anisīditvā aññattha paṭicchanne ṭhāne nisīditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesaṃ pana tiṇṇampi channe vāsaṃ kappitakkhaṇe dhutaṅgaṃ bhijjati. Jānitvā channe aruṇaṃ uṭṭhāpitamatteti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṅguttarabhāṇakā"
      },
      ". Ayamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhedo"
      },
      "."
    ],
    "innerText": "Imesaṃ pana tiṇṇampi channe vāsaṃ kappitakkhaṇe dhutaṅgaṃ bhijjati. Jānitvā channe aruṇaṃ uṭṭhāpitamatteti aṅguttarabhāṇakā. Ayamettha bhedo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ panānisaṃso,"
      },
      " rukkhamūlasenāsanaṃ nissāya pabbajjāti (mahāva. 128) vacanato nissayānurūpapaṭipattisabbhāvo, appāni ceva sulabhāni ca tāni ca anavajjānīti (a. ni. 4.27; itivu. 101) bhagavatā saṃvaṇṇitapaccayatā, abhiṇhaṃ tarupaṇṇavikāradassanena aniccasaññāsamuṭṭhāpanatā, senāsanamaccherakammārāmatānaṃ abhāvo, devatāhi sahavāsitā, appicchatādīnaṃ anulomavuttitāti."
    ],
    "innerText": "Ayaṃ panānisaṃso, rukkhamūlasenāsanaṃ nissāya pabbajjāti (mahāva. 128) vacanato nissayānurūpapaṭipattisabbhāvo, appāni ceva sulabhāni ca tāni ca anavajjānīti (a. ni. 4.27; itivu. 101) bhagavatā saṃvaṇṇitapaccayatā, abhiṇhaṃ tarupaṇṇavikāradassanena aniccasaññāsamuṭṭhāpanatā, senāsanamaccherakammārāmatānaṃ abhāvo, devatāhi sahavāsitā, appicchatādīnaṃ anulomavuttitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vaṇṇito buddhaseṭṭhena, nissayoti ca bhāsito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nivāso pavivittassa, rukkhamūlasamo kuto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āvāsamaccherahare, devatā paripālite;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pavivitte vasanto hi, rukkhamūlamhi subbato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Abhirattāni nīlāni, paṇḍūni patitāni ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Passanto tarupaṇṇāni, niccasaññaṃ panūdati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tasmā hi buddhadāyajjaṃ, bhāvanābhiratālayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vivittaṃ nātimaññeyya, rukkhamūlaṃ vicakkhaṇoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ rukkhamūlikaṅge samādānavidhānappabhedabhedānisaṃsavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Abbhokāsikaṅgakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "33"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abbhokāsikaṅgampi"
      },
      " ‘‘channañca rukkhamūlañca paṭikkhipāmi, abbhokāsikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
    ],
    "innerText": "33.Abbhokāsikaṅgampi ‘‘channañca rukkhamūlañca paṭikkhipāmi, abbhokāsikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassa pana abbhokāsikassa dhammassavanāya vā uposathatthāya vā uposathāgāraṃ pavisituṃ vaṭṭati. Sace paviṭṭhassa devo vassati, deve vassamāne anikkhamitvā vassūparame nikkhamitabbaṃ. Bhojanasālaṃ vā aggisālaṃ vā pavisitvā vattaṃ kātuṃ, bhojanasālāya there bhikkhū bhattena āpucchituṃ, uddisantena vā uddisāpentena vā channaṃ pavisituṃ, bahi dunnikkhittāni mañcapīṭhādīni anto pavesetuñca vaṭṭati. Sace maggaṃ gacchantena vuḍḍhatarānaṃ ",
      " parikkhāro gahito hoti, deve vassante maggamajjhe ṭhitaṃ sālaṃ pavisituṃ vaṭṭati. Sace na kiñci gahitaṃ hoti, sālāya ṭhassāmīti vegena gantuṃ na vaṭṭati. Pakatigatiyā gantvā paviṭṭhena pana yāva vassūparamā ṭhatvā gantabbanti idamassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vidhānaṃ. Rukkhamūlikassā"
      },
      "pi eseva nayo."
    ],
    "innerText": "Tassa pana abbhokāsikassa dhammassavanāya vā uposathatthāya vā uposathāgāraṃ pavisituṃ vaṭṭati. Sace paviṭṭhassa devo vassati, deve vassamāne anikkhamitvā vassūparame nikkhamitabbaṃ. Bhojanasālaṃ vā aggisālaṃ vā pavisitvā vattaṃ kātuṃ, bhojanasālāya there bhikkhū bhattena āpucchituṃ, uddisantena vā uddisāpentena vā channaṃ pavisituṃ, bahi dunnikkhittāni mañcapīṭhādīni anto pavesetuñca vaṭṭati. Sace maggaṃ gacchantena vuḍḍhatarānaṃ parikkhāro gahito hoti, deve vassante maggamajjhe ṭhitaṃ sālaṃ pavisituṃ vaṭṭati. Sace na kiñci gahitaṃ hoti, sālāya ṭhassāmīti vegena gantuṃ na vaṭṭati. Pakatigatiyā gantvā paviṭṭhena pana yāva vassūparamā ṭhatvā gantabbanti idamassa vidhānaṃ. Rukkhamūlikassāpi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhedato"
      },
      " pana ayampi tividho hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkaṭṭhassa"
      },
      " rukkhaṃ vā pabbataṃ vā gehaṃ vā upanissāya vasituṃ na vaṭṭati. Abbhokāseyeva cīvarakuṭiṃ katvā vasitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhimassa"
      },
      " rukkhapabbatagehāni upanissāya anto appavisitvā vasituṃ vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mudukassa"
      },
      " acchannamariyādaṃ pabbhārampi sākhāmaṇḍapopi pīṭhapaṭopi khettarakkhakādīhi chaḍḍitā tatraṭṭhakakuṭikāpi vaṭṭatīti."
    ],
    "innerText": "Pabhedato pana ayampi tividho hoti. Tattha ukkaṭṭhassa rukkhaṃ vā pabbataṃ vā gehaṃ vā upanissāya vasituṃ na vaṭṭati. Abbhokāseyeva cīvarakuṭiṃ katvā vasitabbaṃ. Majjhimassa rukkhapabbatagehāni upanissāya anto appavisitvā vasituṃ vaṭṭati. Mudukassa acchannamariyādaṃ pabbhārampi sākhāmaṇḍapopi pīṭhapaṭopi khettarakkhakādīhi chaḍḍitā tatraṭṭhakakuṭikāpi vaṭṭatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesaṃ pana tiṇṇampi vāsatthāya channaṃ vā rukkhamūlaṃ vā paviṭṭhakkhaṇe dhutaṅgaṃ bhijjati. Jānitvā tattha aruṇaṃ uṭṭhāpitamatteti aṅguttarabhāṇakā. Ayamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhedo"
      },
      "."
    ],
    "innerText": "Imesaṃ pana tiṇṇampi vāsatthāya channaṃ vā rukkhamūlaṃ vā paviṭṭhakkhaṇe dhutaṅgaṃ bhijjati. Jānitvā tattha aruṇaṃ uṭṭhāpitamatteti aṅguttarabhāṇakā. Ayamettha bhedo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ panānisaṃso,"
      },
      " āvāsapalibodhupacchedo, thinamiddhapanūdanaṃ, ‘‘migā viya asaṅgacārino, aniketā viharanti bhikkhavo’’ti (saṃ. ni. 1.224) pasaṃsāya anurūpatā, nissaṅgatā, cātuddisatā, appicchatādīnaṃ anulomavuttitāti."
    ],
    "innerText": "Ayaṃ panānisaṃso, āvāsapalibodhupacchedo, thinamiddhapanūdanaṃ, ‘‘migā viya asaṅgacārino, aniketā viharanti bhikkhavo’’ti (saṃ. ni. 1.224) pasaṃsāya anurūpatā, nissaṅgatā, cātuddisatā, appicchatādīnaṃ anulomavuttitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Anagāriyabhāvassa ",
      ", anurūpe adullabhe;"
    ],
    "innerText": "Anagāriyabhāvassa , anurūpe adullabhe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tārāmaṇivitānamhi, candadīpappabhāsite."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Abbhokāse vasaṃ bhikkhu, migabhūtena cetasā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Thinamiddhaṃ vinodetvā, bhāvanārāmataṃ sito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pavivekarasassādaṃ, nacirasseva vindati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yasmā tasmā hi sappañño, abbhokāsarato siyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ abbhokāsikaṅge samādānavidhānappabhedabhedānisaṃsavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Sosānikaṅgakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "34"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sosānikaṅgampi"
      },
      " ‘‘na susānaṃ paṭikkhipāmi, sosānikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
    ],
    "innerText": "34.Sosānikaṅgampi ‘‘na susānaṃ paṭikkhipāmi, sosānikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena pana sosānikena yaṃ manussā gāmaṃ nivesantā ‘‘idaṃ susāna’’nti vavatthapenti, na tattha vasitabbaṃ. Na hi matasarīre ajjhāpite taṃ susānaṃ nāma hoti, jhāpitakālato pana paṭṭhāya sacepi dvādasavassāni chaḍḍitaṃ, taṃ susānameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmiṃ pana vasantena caṅkamamaṇḍapādīni kāretvā mañcapīṭhaṃ paññapetvā pānīyaparibhojanīyaṃ upaṭṭhāpetvā dhammaṃ vācentena na vasitabbaṃ. Garukaṃ hi idaṃ dhutaṅgaṃ, tasmā uppannaparissayavighātatthāya saṅghattheraṃ vā rājayuttakaṃ vā jānāpetvā appamattena vasitabbaṃ. Caṅkamantena addhakkhikena āḷāhanaṃ olokentena caṅkamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Susānaṃ gacchantenāpi mahāpathā ukkamma uppathamaggena gantabbaṃ. Divāyeva ārammaṇaṃ vavatthapetabbaṃ. Evañhissa taṃ rattiṃ bhayānakaṃ na bhavissati, amanussā rattiṃ viravitvā viravitvā āhiṇḍantāpi na kenaci paharitabbā. Ekadivasampi susānaṃ agantuṃ na vaṭṭati. Majjhimayāmaṃ ",
      " susāne khepetvā pacchimayāme paṭikkamituṃ vaṭṭatīti aṅguttarabhāṇakā. Amanussānaṃ piyaṃ tilapiṭṭhamāsabhattamacchamaṃsakhīratelaguḷādikhajjabhojjaṃ na sevitabbaṃ. Kulagehaṃ na pavisitabbanti idamassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vidhānaṃ"
      },
      "."
    ],
    "innerText": "Susānaṃ gacchantenāpi mahāpathā ukkamma uppathamaggena gantabbaṃ. Divāyeva ārammaṇaṃ vavatthapetabbaṃ. Evañhissa taṃ rattiṃ bhayānakaṃ na bhavissati, amanussā rattiṃ viravitvā viravitvā āhiṇḍantāpi na kenaci paharitabbā. Ekadivasampi susānaṃ agantuṃ na vaṭṭati. Majjhimayāmaṃ susāne khepetvā pacchimayāme paṭikkamituṃ vaṭṭatīti aṅguttarabhāṇakā. Amanussānaṃ piyaṃ tilapiṭṭhamāsabhattamacchamaṃsakhīratelaguḷādikhajjabhojjaṃ na sevitabbaṃ. Kulagehaṃ na pavisitabbanti idamassa vidhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhedato"
      },
      " pana ayampi tividho hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkaṭṭhena"
      },
      " yattha dhuvaḍāhadhuvakuṇapadhuvarodanāni atthi, tattheva vasitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhimassa"
      },
      " tīsu ekasmimpi sati vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mudukassa"
      },
      " vuttanayena susānalakkhaṇaṃ pattamatte vaṭṭati."
    ],
    "innerText": "Pabhedato pana ayampi tividho hoti. Tattha ukkaṭṭhena yattha dhuvaḍāhadhuvakuṇapadhuvarodanāni atthi, tattheva vasitabbaṃ. Majjhimassa tīsu ekasmimpi sati vaṭṭati. Mudukassa vuttanayena susānalakkhaṇaṃ pattamatte vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesaṃ pana tiṇṇampi na susānamhi vāsaṃ kappanena dhutaṅgaṃ bhijjati. Susānaṃ agatadivaseti aṅguttarabhāṇakā. Ayamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhedo"
      },
      "."
    ],
    "innerText": "Imesaṃ pana tiṇṇampi na susānamhi vāsaṃ kappanena dhutaṅgaṃ bhijjati. Susānaṃ agatadivaseti aṅguttarabhāṇakā. Ayamettha bhedo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ panānisaṃso"
      },
      " maraṇassatipaṭilābho, appamādavihāritā, asubhanimittādhigamo, kāmarāgavinodanaṃ, abhiṇhaṃ kāyasabhāvadassanaṃ, saṃvegabahulatā ",
      " ārogyamadādippahānaṃ, bhayabheravasahanatā, amanussānaṃ garubhāvanīyatā, appicchatādīnaṃ anulomavuttitāti."
    ],
    "innerText": "Ayaṃ panānisaṃso maraṇassatipaṭilābho, appamādavihāritā, asubhanimittādhigamo, kāmarāgavinodanaṃ, abhiṇhaṃ kāyasabhāvadassanaṃ, saṃvegabahulatā ārogyamadādippahānaṃ, bhayabheravasahanatā, amanussānaṃ garubhāvanīyatā, appicchatādīnaṃ anulomavuttitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sosānikañhi maraṇānusatippabhāvā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Niddāgatampi na phusanti pamādadosā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Sampassato ca kuṇapāni bahūni tassa,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kāmānubhāvavasagampi na hoti cittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Saṃvegameti vipulaṃ na madaṃ upeti,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sammā atho ghaṭati nibbutimesamāno;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Sosānikaṅgamitinekaguṇāvahattā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nibbānaninnahadayena nisevitabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ sosānikaṅge samādānavidhānappabhedabhedānisaṃsavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "12. Yathāsanthatikaṅgakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathāsanthatikaṅgampi"
      },
      " ‘‘senāsanaloluppaṃ paṭikkhipāmi, yathāsanthatikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
    ],
    "innerText": "35.Yathāsanthatikaṅgampi ‘‘senāsanaloluppaṃ paṭikkhipāmi, yathāsanthatikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena pana yathāsanthatikena yadassa senāsanaṃ ‘‘idaṃ tuyhaṃ pāpuṇātī’’ti gāhitaṃ hoti, teneva tuṭṭhabbaṃ, na añño uṭṭhāpetabbo. Idamassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vidhānaṃ"
      },
      "."
    ],
    "innerText": "Tena pana yathāsanthatikena yadassa senāsanaṃ ‘‘idaṃ tuyhaṃ pāpuṇātī’’ti gāhitaṃ hoti, teneva tuṭṭhabbaṃ, na añño uṭṭhāpetabbo. Idamassa vidhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhedato"
      },
      " pana ayampi tividho hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkaṭṭho"
      },
      " attano pattasenāsanaṃ dūreti vā accāsanneti vā amanussadīghajātikādīhi upaddutanti vā uṇhanti vā sītalanti vā pucchituṃ na labhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhimo"
      },
      " pucchituṃ labhati. Gantvā pana oloketuṃ na labhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muduko"
      },
      " gantvā oloketvā sacassa taṃ na ruccati, aññaṃ gahetuṃ labhati."
    ],
    "innerText": "Pabhedato pana ayampi tividho hoti. Tattha ukkaṭṭho attano pattasenāsanaṃ dūreti vā accāsanneti vā amanussadīghajātikādīhi upaddutanti vā uṇhanti vā sītalanti vā pucchituṃ na labhati. Majjhimo pucchituṃ labhati. Gantvā pana oloketuṃ na labhati. Muduko gantvā oloketvā sacassa taṃ na ruccati, aññaṃ gahetuṃ labhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesaṃ pana tiṇṇampi senāsanaloluppe uppannamatte dhutaṅgaṃ bhijjatīti ayamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhedo"
      },
      "."
    ],
    "innerText": "Imesaṃ pana tiṇṇampi senāsanaloluppe uppannamatte dhutaṅgaṃ bhijjatīti ayamettha bhedo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ panānisaṃso,"
      },
      " ‘‘yaṃ laddhaṃ tena tuṭṭhabba’’nti (jā. 1.1.136; pāci. 793) vuttovādakaraṇaṃ, sabrahmacārīnaṃ hitesitā, hīnapaṇītavikappapariccāgo, anurodhavirodhappahānaṃ, atricchatāya dvārapidahanaṃ, appicchatādīnaṃ anulomavuttitāti."
    ],
    "innerText": "Ayaṃ panānisaṃso, ‘‘yaṃ laddhaṃ tena tuṭṭhabba’’nti (jā. 1.1.136; pāci. 793) vuttovādakaraṇaṃ, sabrahmacārīnaṃ hitesitā, hīnapaṇītavikappapariccāgo, anurodhavirodhappahānaṃ, atricchatāya dvārapidahanaṃ, appicchatādīnaṃ anulomavuttitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Yaṃ ",
      " laddhaṃ tena santuṭṭho, yathāsanthatiko yati;"
    ],
    "innerText": "Yaṃ laddhaṃ tena santuṭṭho, yathāsanthatiko yati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nibbikappo sukhaṃ seti, tiṇasantharakesupi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Na so rajjati seṭṭhamhi, hīnaṃ laddhā na kuppati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabrahmacārinavake, hitena anukampati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tasmā ariyasatāciṇṇaṃ, munipuṅgavavaṇṇitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anuyuñjetha medhāvī, yathāsanthatarāmatanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ yathāsanthatikaṅge samādānavidhānappabhedabhedānisaṃsavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "13. Nesajjikaṅgakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nesajjikaṅgampi"
      },
      " ‘‘seyyaṃ paṭikkhipāmi, nesajjikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
    ],
    "innerText": "36.Nesajjikaṅgampi ‘‘seyyaṃ paṭikkhipāmi, nesajjikaṅgaṃ samādiyāmī’’ti imesaṃ aññataravacanena samādinnaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena pana nesajjikena rattiyā tīsu yāmesu ekaṃ yāmaṃ uṭṭhāya caṅkamitabbaṃ. Iriyāpathesu hi nipajjitumeva na vaṭṭati. Idamassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vidhānaṃ"
      },
      "."
    ],
    "innerText": "Tena pana nesajjikena rattiyā tīsu yāmesu ekaṃ yāmaṃ uṭṭhāya caṅkamitabbaṃ. Iriyāpathesu hi nipajjitumeva na vaṭṭati. Idamassa vidhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhedato"
      },
      " pana ayampi tividho hoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkaṭṭhassa"
      },
      " neva apassenaṃ, na dussapallatthikā, na āyogapaṭṭo vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhimassa"
      },
      " imesu tīsu yaṃkiñci vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mudukassa"
      },
      " apassenampi dussapallatthikāpi āyogapaṭṭopi bibbohanampi pañcaṅgopi sattaṅgopi vaṭṭati. Pañcaṅgo pana piṭṭhiapassayena saddhiṃ kato. Sattaṅgo nāma piṭṭhiapassayena ca ubhatopassesu apassayehi ca saddhiṃ kato. Taṃ kira miḷābhayattherassa akaṃsu. Thero anāgāmī hutvā parinibbāyi."
    ],
    "innerText": "Pabhedato pana ayampi tividho hoti. Tattha ukkaṭṭhassa neva apassenaṃ, na dussapallatthikā, na āyogapaṭṭo vaṭṭati. Majjhimassa imesu tīsu yaṃkiñci vaṭṭati. Mudukassa apassenampi dussapallatthikāpi āyogapaṭṭopi bibbohanampi pañcaṅgopi sattaṅgopi vaṭṭati. Pañcaṅgo pana piṭṭhiapassayena saddhiṃ kato. Sattaṅgo nāma piṭṭhiapassayena ca ubhatopassesu apassayehi ca saddhiṃ kato. Taṃ kira miḷābhayattherassa akaṃsu. Thero anāgāmī hutvā parinibbāyi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesaṃ pana tiṇṇampi seyyaṃ kappitamatte dhutaṅgaṃ bhijjati. Ayamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhedo"
      },
      "."
    ],
    "innerText": "Imesaṃ pana tiṇṇampi seyyaṃ kappitamatte dhutaṅgaṃ bhijjati. Ayamettha bhedo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ panānisaṃso,"
      },
      " ‘‘seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharatī’’ti (dī. ni. 3.320; ma. ni. 1.186) vuttassa cetaso vinibandhassa upacchedanaṃ, sabbakammaṭṭhānānuyogasappāyatā, pāsādikairiyāpathatā, vīriyārambhānukūlatā, sammāpaṭipattiyā anubrūhananti."
    ],
    "innerText": "Ayaṃ panānisaṃso, ‘‘seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharatī’’ti (dī. ni. 3.320; ma. ni. 1.186) vuttassa cetaso vinibandhassa upacchedanaṃ, sabbakammaṭṭhānānuyogasappāyatā, pāsādikairiyāpathatā, vīriyārambhānukūlatā, sammāpaṭipattiyā anubrūhananti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ābhujitvāna pallaṅkaṃ, paṇidhāya ujuṃ tanuṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nisīdanto vikampeti, mārassa hadayaṃ yati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Seyyasukhaṃ ",
      " middhasukhaṃ, hitvā āraddhavīriyo;"
    ],
    "innerText": "Seyyasukhaṃ middhasukhaṃ, hitvā āraddhavīriyo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nisajjābhirato bhikkhu, sobhayanto tapovanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nirāmisaṃ pītisukhaṃ, yasmā samadhigacchati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā samanuyuñjeyya, dhīro nesajjikaṃ vatanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ nesajjikaṅge samādāna vidhānappabheda bhedānisaṃsavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dhutaṅgapakiṇṇakakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ". Idāni ",
      " –"
    ],
    "innerText": "37. Idāni –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kusalattikato ceva, dhutādīnaṃ vibhāgato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Samāsabyāsato cāpi, viññātabbo vinicchayoti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Imissā gāthāya vasena vaṇṇanā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kusalattikato"
      },
      "ti sabbāneva hi dhutaṅgāni sekkhaputhujjanakhīṇāsavānaṃ vasena siyā kusalāni, siyā abyākatāni, natthi dhutaṅgaṃ akusalanti."
    ],
    "innerText": "Tattha kusalattikatoti sabbāneva hi dhutaṅgāni sekkhaputhujjanakhīṇāsavānaṃ vasena siyā kusalāni, siyā abyākatāni, natthi dhutaṅgaṃ akusalanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yo pana vadeyya ‘‘pāpiccho icchāpakato āraññiko hotīti ādivacanato (a. ni. 5.181; pari. 325) akusalampi dhutaṅga’’nti. So vattabbo – na mayaṃ ‘‘akusalacittena araññe na vasatī’’ti vadāma. Yassa hi araññe nivāso, so āraññiko. So ca pāpiccho vā bhaveyya appiccho vā. Imāni pana tena tena samādānena dhutakilesattā dhutassa bhikkhuno aṅgāni, kilesadhunanato vā dhutanti laddhavohāraṃ ñāṇaṃ aṅgametesanti dhutaṅgāni. Atha vā dhutāni ca tāni paṭipakkhaniddhunanato aṅgāni ca paṭipattiyātipi dhutaṅgānīti vuttaṃ. Na ca akusalena koci dhuto nāma hoti, yassetāni aṅgāni bhaveyyuṃ, na ca akusalaṃ kiñci dhunāti, yesaṃ taṃ aṅgantikatvā dhutaṅgānīti vucceyyuṃ. Nāpi akusalaṃ cīvaraloluppādīni ceva niddhunāti paṭipattiyā ca aṅgaṃ hoti. Tasmā suvuttamidaṃ ‘‘natthi akusalaṃ dhutaṅga’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yesampi ",
      " kusalattikavinimuttaṃ dhutaṅgaṃ, tesaṃ atthato dhutaṅgameva natthi. Asantaṃ kassa dhunanato dhutaṅgaṃ nāma bhavissati. Dhutaguṇe samādāya vattatīti vacanavirodhopi ca nesaṃ āpajjati, tasmā taṃ na gahetabba’’nti ayaṃ tāva kusalattikato vaṇṇanā."
    ],
    "innerText": "‘‘Yesampi kusalattikavinimuttaṃ dhutaṅgaṃ, tesaṃ atthato dhutaṅgameva natthi. Asantaṃ kassa dhunanato dhutaṅgaṃ nāma bhavissati. Dhutaguṇe samādāya vattatīti vacanavirodhopi ca nesaṃ āpajjati, tasmā taṃ na gahetabba’’nti ayaṃ tāva kusalattikato vaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhutādīnaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāgato"
      },
      "ti dhuto veditabbo. Dhutavādo veditabbo. Dhutadhammā veditabbā. Dhutaṅgāni veditabbāni. Kassa dhutaṅgasevanā sappāyāti veditabbaṃ."
    ],
    "innerText": "Dhutādīnaṃvibhāgatoti dhuto veditabbo. Dhutavādo veditabbo. Dhutadhammā veditabbā. Dhutaṅgāni veditabbāni. Kassa dhutaṅgasevanā sappāyāti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhuto"
      },
      "ti dhutakileso vā puggalo kilesadhunano vā dhammo."
    ],
    "innerText": "Tattha dhutoti dhutakileso vā puggalo kilesadhunano vā dhammo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhutavādo"
      },
      "ti ettha pana atthi dhuto na dhutavādo, atthi na dhuto dhutavādo, atthi neva dhuto na dhutavādo, atthi dhuto ceva dhutavādo ca."
    ],
    "innerText": "Dhutavādoti ettha pana atthi dhuto na dhutavādo, atthi na dhuto dhutavādo, atthi neva dhuto na dhutavādo, atthi dhuto ceva dhutavādo ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha yo dhutaṅgena attano kilese dhuni, paraṃ pana dhutaṅgena na ovadati, nānusāsati bākulatthero viya, ayaṃ dhuto na dhutavādo. Yathāha, ‘‘tayidaṃ āyasmā bākulo dhuto na dhutavādo’’ti. Yo pana na dhutaṅgena attano kilese dhuni, kevalaṃ aññe dhutaṅgena ovadati anusāsati upanandatthero viya, ayaṃ na dhuto dhutavādo. Yathāha, ‘‘tayidaṃ āyasmā upanando sakyaputto na dhuto dhutavādo’’ti. Yo ubhayavipanno lāḷudāyī viya, ayaṃ neva dhuto na dhutavādo. Yathāha, ‘‘tayidaṃ āyasmā lāḷudāyī neva dhuto na dhutavādo’’ti. Yo pana ubhayasampanno dhammasenāpati viya, ayaṃ dhuto ceva dhutavādo ca. Yathāha, ‘‘tayidaṃ āyasmā sāriputto dhuto ceva dhutavādo cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhutadhammā veditabbā"
      },
      "ti appicchatā, santuṭṭhitā, sallekhatā, pavivekatā, idamatthitāti ime dhutaṅgacetanāya parivārakā pañca dhammā ‘‘appicchataṃyeva nissāyā’’tiādivacanato (a. ni. 5.181; pari. 325) dhutadhammā nāma, tattha appicchatā ca santuṭṭhitā ca alobho. Sallekhatā ca pavivekatā ca dvīsu dhammesu anupatanti alobhe ca amohe ca. Idamatthitā ñāṇameva. Tattha ",
      " ca alobhena paṭikkhepavatthūsu lobhaṃ, amohena tesveva ādīnavapaṭicchādakaṃ mohaṃ dhunāti. Alobhena ca anuññātānaṃ paṭisevanamukhena pavattaṃ kāmasukhānuyogaṃ, amohena dhutaṅgesu atisallekhamukhena pavattaṃ attakilamathānuyogaṃ dhunāti. Tasmā ime dhammā dhutadhammāti veditabbā."
    ],
    "innerText": "Dhutadhammā veditabbāti appicchatā, santuṭṭhitā, sallekhatā, pavivekatā, idamatthitāti ime dhutaṅgacetanāya parivārakā pañca dhammā ‘‘appicchataṃyeva nissāyā’’tiādivacanato (a. ni. 5.181; pari. 325) dhutadhammā nāma, tattha appicchatā ca santuṭṭhitā ca alobho. Sallekhatā ca pavivekatā ca dvīsu dhammesu anupatanti alobhe ca amohe ca. Idamatthitā ñāṇameva. Tattha ca alobhena paṭikkhepavatthūsu lobhaṃ, amohena tesveva ādīnavapaṭicchādakaṃ mohaṃ dhunāti. Alobhena ca anuññātānaṃ paṭisevanamukhena pavattaṃ kāmasukhānuyogaṃ, amohena dhutaṅgesu atisallekhamukhena pavattaṃ attakilamathānuyogaṃ dhunāti. Tasmā ime dhammā dhutadhammāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhutaṅgāni veditabbānī"
      },
      "ti terasa dhutaṅgāni veditabbāni paṃsukūlikaṅgaṃ…pe… nesajjikaṅganti. Tāni atthato lakkhaṇādīhi ca vuttāneva."
    ],
    "innerText": "Dhutaṅgāni veditabbānīti terasa dhutaṅgāni veditabbāni paṃsukūlikaṅgaṃ…pe… nesajjikaṅganti. Tāni atthato lakkhaṇādīhi ca vuttāneva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kassa ",
      " dhutaṅgasevanā sappāyāti rāgacaritassa ceva mohacaritassa ca. Kasmā? Dhutaṅgasevanā hi dukkhāpaṭipadā ceva sallekhavihāro ca. Dukkhāpaṭipadañca nissāya rāgo vūpasammati. Sallekhaṃ nissāya appamattassa moho pahīyati. Āraññikaṅgarukkhamūlikaṅgapaṭisevanā vā ettha dosacaritassāpi sappāyā. Tattha hissa asaṅghaṭṭiyamānassa viharato dosopi vūpasammatīti ayaṃ dhutādīnaṃ vibhāgato vaṇṇanā."
    ],
    "innerText": "Kassa dhutaṅgasevanā sappāyāti rāgacaritassa ceva mohacaritassa ca. Kasmā? Dhutaṅgasevanā hi dukkhāpaṭipadā ceva sallekhavihāro ca. Dukkhāpaṭipadañca nissāya rāgo vūpasammati. Sallekhaṃ nissāya appamattassa moho pahīyati. Āraññikaṅgarukkhamūlikaṅgapaṭisevanā vā ettha dosacaritassāpi sappāyā. Tattha hissa asaṅghaṭṭiyamānassa viharato dosopi vūpasammatīti ayaṃ dhutādīnaṃ vibhāgato vaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samāsabyāsato"
      },
      "ti imāni pana dhutaṅgāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāsato"
      },
      " tīṇi sīsaṅgāni, pañca asambhinnaṅgānīti aṭṭheva honti. Tattha sapadānacārikaṅgaṃ, ekāsanikaṅgaṃ, abbhokāsikaṅganti imāni tīṇi sīsaṅgāni. Sapadānacārikaṅgañhi rakkhanto piṇḍapātikaṅgampi rakkhissati. Ekāsanikaṅgañca rakkhato pattapiṇḍikaṅgakhalupacchābhattikaṅgānipi surakkhanīyāni bhavissanti. Abbhokāsikaṅgaṃ rakkhantassa kiṃ atthi rukkhamūlikaṅgayathāsanthatikaṅgesu rakkhitabbaṃ nāma. Iti imāni tīṇi sīsaṅgāni, āraññikaṅgaṃ, paṃsukūlikaṅgaṃ, tecīvarikaṅgaṃ, nesajjikaṅgaṃ, sosānikaṅganti imāni pañca asambhinnaṅgāni cāti aṭṭheva honti."
    ],
    "innerText": "Samāsabyāsatoti imāni pana dhutaṅgāni samāsato tīṇi sīsaṅgāni, pañca asambhinnaṅgānīti aṭṭheva honti. Tattha sapadānacārikaṅgaṃ, ekāsanikaṅgaṃ, abbhokāsikaṅganti imāni tīṇi sīsaṅgāni. Sapadānacārikaṅgañhi rakkhanto piṇḍapātikaṅgampi rakkhissati. Ekāsanikaṅgañca rakkhato pattapiṇḍikaṅgakhalupacchābhattikaṅgānipi surakkhanīyāni bhavissanti. Abbhokāsikaṅgaṃ rakkhantassa kiṃ atthi rukkhamūlikaṅgayathāsanthatikaṅgesu rakkhitabbaṃ nāma. Iti imāni tīṇi sīsaṅgāni, āraññikaṅgaṃ, paṃsukūlikaṅgaṃ, tecīvarikaṅgaṃ, nesajjikaṅgaṃ, sosānikaṅganti imāni pañca asambhinnaṅgāni cāti aṭṭheva honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Puna dve cīvarapaṭisaṃyuttāni, pañca piṇḍapātapaṭisaṃyuttāni, pañca senāsanapaṭisaṃyuttāni, ekaṃ vīriyapaṭisaṃyuttanti evaṃ cattārova honti. Tattha nesajjikaṅgaṃ vīriyapaṭisaṃyuttaṃ. Itarāni pākaṭāneva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna sabbāneva nissayavasena dve honti paccayanissitāni dvādasa, vīriyanissitaṃ ekanti. Sevitabbāsevitabbavasenapi dveyeva honti. Yassa hi dhutaṅgaṃ sevantassa kammaṭṭhānaṃ vaḍḍhati, tena sevitabbāni. Yassa sevato hāyati, tena na sevitabbāni. Yassa pana sevatopi asevatopi vaḍḍhateva, na hāyati, tenāpi pacchimaṃ janataṃ anukampantena sevitabbāni. Yassāpi ",
      " sevatopi asevatopi na vaḍḍhati, tenāpi sevitabbāniyeva āyatiṃ vāsanatthāyāti."
    ],
    "innerText": "Puna sabbāneva nissayavasena dve honti paccayanissitāni dvādasa, vīriyanissitaṃ ekanti. Sevitabbāsevitabbavasenapi dveyeva honti. Yassa hi dhutaṅgaṃ sevantassa kammaṭṭhānaṃ vaḍḍhati, tena sevitabbāni. Yassa sevato hāyati, tena na sevitabbāni. Yassa pana sevatopi asevatopi vaḍḍhateva, na hāyati, tenāpi pacchimaṃ janataṃ anukampantena sevitabbāni. Yassāpi sevatopi asevatopi na vaḍḍhati, tenāpi sevitabbāniyeva āyatiṃ vāsanatthāyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ sevitabbāsevitabbavasena duvidhānipi sabbāneva cetanāvasena ekavidhāni honti. Ekameva hi dhutaṅgaṃ samādānacetanāti. Aṭṭhakathāyampi vuttaṃ ‘‘yā cetanā, taṃ dhutaṅganti vadantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Byāsato"
      },
      " pana bhikkhūnaṃ terasa, bhikkhunīnaṃ aṭṭha, sāmaṇerānaṃ dvādasa, sikkhamānasāmaṇerīnaṃ satta, upāsakaupāsikānaṃ dveti dvācattālīsa honti. Sace pana abbhokāse āraññikaṅgasampannaṃ susānaṃ hoti, ekopi bhikkhu ekappahārena sabbadhutaṅgāni paribhuñjituṃ sakkoti. Bhikkhunīnaṃ pana āraññikaṅgaṃ khalupacchābhattikaṅgañca dvepi sikkhāpadeneva paṭikkhittāni, abbhokāsikaṅgaṃ, rukkhamūlikaṅgaṃ, sosānikaṅganti imāni tīṇi dupparihārāni. Bhikkhuniyā hi dutiyikaṃ vinā vasituṃ na vaṭṭati. Evarūpe ca ṭhāne samānacchandā dutiyikā dullabhā. Sacepi labheyya saṃsaṭṭhavihārato na mucceyya. Evaṃ sati yassatthāya dhutaṅgaṃ seveyya, svevassā attho na sampajjeyya. Evaṃ paribhuñjituṃ asakkuṇeyyatāya pañca hāpetvā bhikkhunīnaṃ aṭṭheva hontīti veditabbāni. Yathāvuttesu pana ṭhapetvā tecīvarikaṅgaṃ sesāni dvādasa sāmaṇerānaṃ, satta sikkhamānasāmaṇerīnaṃ veditabbāni. Upāsakaupāsikānaṃ pana ekāsanikaṅgaṃ, pattapiṇḍikaṅganti imāni dve patirūpāni ceva sakkā ca paribhuñjitunti dve dhutaṅgānīti evaṃ byāsato dvecattālīsa hontīti ayaṃ samāsabyāsato vaṇṇanā."
    ],
    "innerText": "Byāsato pana bhikkhūnaṃ terasa, bhikkhunīnaṃ aṭṭha, sāmaṇerānaṃ dvādasa, sikkhamānasāmaṇerīnaṃ satta, upāsakaupāsikānaṃ dveti dvācattālīsa honti. Sace pana abbhokāse āraññikaṅgasampannaṃ susānaṃ hoti, ekopi bhikkhu ekappahārena sabbadhutaṅgāni paribhuñjituṃ sakkoti. Bhikkhunīnaṃ pana āraññikaṅgaṃ khalupacchābhattikaṅgañca dvepi sikkhāpadeneva paṭikkhittāni, abbhokāsikaṅgaṃ, rukkhamūlikaṅgaṃ, sosānikaṅganti imāni tīṇi dupparihārāni. Bhikkhuniyā hi dutiyikaṃ vinā vasituṃ na vaṭṭati. Evarūpe ca ṭhāne samānacchandā dutiyikā dullabhā. Sacepi labheyya saṃsaṭṭhavihārato na mucceyya. Evaṃ sati yassatthāya dhutaṅgaṃ seveyya, svevassā attho na sampajjeyya. Evaṃ paribhuñjituṃ asakkuṇeyyatāya pañca hāpetvā bhikkhunīnaṃ aṭṭheva hontīti veditabbāni. Yathāvuttesu pana ṭhapetvā tecīvarikaṅgaṃ sesāni dvādasa sāmaṇerānaṃ, satta sikkhamānasāmaṇerīnaṃ veditabbāni. Upāsakaupāsikānaṃ pana ekāsanikaṅgaṃ, pattapiṇḍikaṅganti imāni dve patirūpāni ceva sakkā ca paribhuñjitunti dve dhutaṅgānīti evaṃ byāsato dvecattālīsa hontīti ayaṃ samāsabyāsato vaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettāvatā ca ‘‘sīle patiṭṭhāya naro sapañño’’ti imissā gāthāya sīlasamādhipaññāmukhena desite visuddhimagge yehi appicchatāsantuṭṭhitādīhi guṇehi vuttappakārassa sīlassa vodānaṃ hoti, tesaṃ sampādanatthaṃ samādātabbadhutaṅgakathā bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti sādhujanapāmojjatthāya kate visuddhimagge"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhutaṅganiddeso nāma dutiyo paricchedo."
  }
]