[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Kammaṭṭhānaggahaṇaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "38"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appicchatādīhī"
      },
      "ti ",
      " appicchatāsantuṭṭhisallekhapavivekāpacayavīriyārambhādīhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyodāte"
      },
      "ti suvisuddhe nirupakkilese. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imasmiṃ sīle"
      },
      "ti yathāvutte catupārisuddhisīle. ‘‘Cittaṃ bhāvaya’’nti imameva desanaṃ sandhāyāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atisaṅkhepadesitattā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ko samādhī"
      },
      "ti sarūpapucchā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kenaṭṭhena samādhī"
      },
      "ti kena atthena samādhīti vuccati, ‘‘samādhī’’ti padaṃ kaṃ abhidheyyatthaṃ nissāya pavattanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katividho"
      },
      "ti pabhedapucchā."
    ],
    "innerText": "38.Appicchatādīhīti appicchatāsantuṭṭhisallekhapavivekāpacayavīriyārambhādīhi. Pariyodāteti suvisuddhe nirupakkilese. Imasmiṃ sīleti yathāvutte catupārisuddhisīle. ‘‘Cittaṃ bhāvaya’’nti imameva desanaṃ sandhāyāha ‘‘atisaṅkhepadesitattā’’ti. Ko samādhīti sarūpapucchā. Kenaṭṭhena samādhīti kena atthena samādhīti vuccati, ‘‘samādhī’’ti padaṃ kaṃ abhidheyyatthaṃ nissāya pavattanti attho. Katividhoti pabhedapucchā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ko samādhī’’ti kāmañcāyaṃ sarūpapucchā, vibhāgavantānaṃ pana sarūpavibhāvanaṃ vibhāgadassanamukheneva hotīti vibhāgo tāva anavasesato dassetabbo. Taṃdassane ca ayamādīnavoti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘samādhi bahuvidho’’"
      },
      "tiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahuvidho"
      },
      "ti kusalādivasena anekavidho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānappakārako"
      },
      "ti ālambanamanasikārachandapaṇidhiadhimokkhaabhinīhārasaññānānattādinānappakāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na sādheyyā"
      },
      "ti lokiyasamādhissa bhāvanā idha adhippetattho, tañca na sādheyya. Jhānavimokkhādīsu hi samādhiṃ uddharitvā tassa labbhamānehi vibhāgehi vissajjane kariyamāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānavibhaṅgādīsu"
      },
      " (vibha. 508 ādayo) āgato sabbo samādhipabhedo vissajjetabbo siyā. Tathā ca sati yvāyaṃ lokiyasamādhissa bhāvanāvidhi adhippeto, tassa vissajjanāya okāsova na bhaveyya. Kiñca yenassa tikacatukkajhānikena hīnādibhedabhinnena pavattivibhāgena brahmapārisajjādivasena navavidho, pañcamajjhānikena vehapphalādivasena dasavidho vā ekādasavidho vā bhavappabhedo nippajjati. Svāssa pavattivibhāgo ayaṃ soti niddhāretvā vuccamāno vikkhepāya siyā, yathā taṃ avisaye. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘uttari ca vikkhepāya saṃvatteyyā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalacittekaggatā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kusalā"
      },
      " anavajjasukhavipākalakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cittekaggatā"
      },
      "."
    ],
    "innerText": "‘‘Ko samādhī’’ti kāmañcāyaṃ sarūpapucchā, vibhāgavantānaṃ pana sarūpavibhāvanaṃ vibhāgadassanamukheneva hotīti vibhāgo tāva anavasesato dassetabbo. Taṃdassane ca ayamādīnavoti dassetuṃ ‘‘samādhi bahuvidho’’tiādi vuttaṃ. Tattha bahuvidhoti kusalādivasena anekavidho. Nānappakārakoti ālambanamanasikārachandapaṇidhiadhimokkhaabhinīhārasaññānānattādinānappakāro. Na sādheyyāti lokiyasamādhissa bhāvanā idha adhippetattho, tañca na sādheyya. Jhānavimokkhādīsu hi samādhiṃ uddharitvā tassa labbhamānehi vibhāgehi vissajjane kariyamāne jhānavibhaṅgādīsu (vibha. 508 ādayo) āgato sabbo samādhipabhedo vissajjetabbo siyā. Tathā ca sati yvāyaṃ lokiyasamādhissa bhāvanāvidhi adhippeto, tassa vissajjanāya okāsova na bhaveyya. Kiñca yenassa tikacatukkajhānikena hīnādibhedabhinnena pavattivibhāgena brahmapārisajjādivasena navavidho, pañcamajjhānikena vehapphalādivasena dasavidho vā ekādasavidho vā bhavappabhedo nippajjati. Svāssa pavattivibhāgo ayaṃ soti niddhāretvā vuccamāno vikkhepāya siyā, yathā taṃ avisaye. Tenāha ‘‘uttari ca vikkhepāya saṃvatteyyā’’ti. Kusalacittekaggatāti kusalā anavajjasukhavipākalakkhaṇā cittekaggatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cittacetasikānaṃ samaṃ avisāravasena sampiṇḍentassa viya ādhānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samādhānaṃ"
      },
      ". Avisāralakkhaṇo ",
      " hi samādhi, sampiṇḍanaraso ca. Sammā avikkhipanavasena ādhānaṃ samādhānaṃ. Avikkhepalakkhaṇo vā hi ",
      " samādhi, vikkhepaviddhaṃsanaraso cāti. Svāyaṃ yasmā ekārammaṇe cittassa ṭhitihetu, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ṭhapananti vuttaṃ hotī’’"
      },
      "ti āha. Tathā hesa ‘‘cittassa ṭhiti saṇṭhiti avaṭṭhitī’’ti (dha. sa. 15) niddiṭṭho. Ekārammaṇaggahaṇañcettha samādhissa santānaṭṭhitibhāvadassanatthaṃ. Tathā hissa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathāyaṃ"
      },
      " dīpacciṭṭhiti nidassitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ānubhāvenā"
      },
      "ti balena, paccayabhāvenāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avikkhipamānā"
      },
      "ti na vikkhipamānā vūpasamamānā. Upasamapaccupaṭṭhāno hi samādhi. Etenassa vikkhepapaṭipakkhataṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avippakiṇṇā"
      },
      "ti avisaṭā. Etena avisāralakkhaṇataṃ."
    ],
    "innerText": "Cittacetasikānaṃ samaṃ avisāravasena sampiṇḍentassa viya ādhānaṃ samādhānaṃ. Avisāralakkhaṇo hi samādhi, sampiṇḍanaraso ca. Sammā avikkhipanavasena ādhānaṃ samādhānaṃ. Avikkhepalakkhaṇo vā hi samādhi, vikkhepaviddhaṃsanaraso cāti. Svāyaṃ yasmā ekārammaṇe cittassa ṭhitihetu, tasmā ‘‘ṭhapananti vuttaṃ hotī’’ti āha. Tathā hesa ‘‘cittassa ṭhiti saṇṭhiti avaṭṭhitī’’ti (dha. sa. 15) niddiṭṭho. Ekārammaṇaggahaṇañcettha samādhissa santānaṭṭhitibhāvadassanatthaṃ. Tathā hissa aṭṭhakathāyaṃ dīpacciṭṭhiti nidassitā. Ānubhāvenāti balena, paccayabhāvenāti attho. Avikkhipamānāti na vikkhipamānā vūpasamamānā. Upasamapaccupaṭṭhāno hi samādhi. Etenassa vikkhepapaṭipakkhataṃ dasseti. Avippakiṇṇāti avisaṭā. Etena avisāralakkhaṇataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sayaṃ na vikkhipati, sampayuttā vā na vikkhipanti etenāti avikkhepo, so lakkhaṇaṃ etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avikkhepalakkhaṇo"
      },
      ". Vikkhepaṃ viddhaṃseti, tathā vā sampajjatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vikkhepaviddhaṃsanaraso"
      },
      ". Uddhacce avikampanavasena paccupatiṭṭhati, sampayuttānaṃ vā taṃ paccupaṭṭhapetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avikampanapaccupaṭṭhāno. Sukha"
      },
      "nti nirāmisaṃ sukhaṃ daṭṭhabbaṃ."
    ],
    "innerText": "Sayaṃ na vikkhipati, sampayuttā vā na vikkhipanti etenāti avikkhepo, so lakkhaṇaṃ etassāti avikkhepalakkhaṇo. Vikkhepaṃ viddhaṃseti, tathā vā sampajjatīti vikkhepaviddhaṃsanaraso. Uddhacce avikampanavasena paccupatiṭṭhati, sampayuttānaṃ vā taṃ paccupaṭṭhapetīti avikampanapaccupaṭṭhāno. Sukhanti nirāmisaṃ sukhaṃ daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "39"
      },
      ". Avikkhepalakkhaṇaṃ nāma samādhissa āveṇiko sabhāvo, na tenassa koci vibhāgo labbhatīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘avikkhepalakkhaṇena tāva ekavidho’’"
      },
      "ti. Sampayuttadhamme ārammaṇe appento viya pavattatīti vitakko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appanā"
      },
      ". Tathā hi so ‘‘appanā byappanā’’ti (dha. sa. 7) niddiṭṭho. Tappamukhatāvasena pana sabbasmiṃ mahaggatānuttare jhānadhamme ‘‘appanā’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathā"
      },
      "vohāro. Tathā tassa anuppattiṭṭhānabhūte parittajhāne upacāravohāro. Gāmādīnaṃ samīpaṭṭhāne gāmūpacārādisamaññā viyāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘upacārappanāvasena duvidho’’"
      },
      "ti. Idha pana samādhivasena veditabbaṃ. Lujjanapalujjanaṭṭhena lokoti vuccati vaṭṭaṃ, tappariyāpannatāya loke niyutto, tattha vā viditoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokiyo"
      },
      ". Tattha apariyāpannatāya lokato uttaro uttiṇṇoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokuttaro"
      },
      ". Kāmañcettha lokiyasamādhi bhāvetabbabhāvena gayhati, ubhayaṃ pana ekajjhaṃ gahetvā tato itaraṃ niddhāretuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘lokiyalokuttaravasena duvidho’’"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sappītikanippītikavasenā"
      },
      "ti saha pītiyā vattatīti sappītiko, pītisampayutto. Natthi etassa pītīti nippītiko, pītivippayutto. Tesaṃ vasena. Sukhena saha ekuppādādibhāvaṃ gatoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhasahagato"
      },
      ", sukhasampayuttoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upekkhāsahagate"
      },
      "pi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upekkhā"
      },
      "ti cettha adukkhamasukhavedanā adhippetā. Sā hi sukhadukkhākārapavattiṃ upekkhati majjhattākārasaṇṭhitattā. Sukhasahagata-padena ",
      " cettha sappītiko, nippītikekadeso ca saṅgahito, upekkhāsahagata-padena pana nippītikekadesovāti ayametesaṃ padānaṃ viseso."
    ],
    "innerText": "39. Avikkhepalakkhaṇaṃ nāma samādhissa āveṇiko sabhāvo, na tenassa koci vibhāgo labbhatīti āha ‘‘avikkhepalakkhaṇena tāva ekavidho’’ti. Sampayuttadhamme ārammaṇe appento viya pavattatīti vitakko appanā. Tathā hi so ‘‘appanā byappanā’’ti (dha. sa. 7) niddiṭṭho. Tappamukhatāvasena pana sabbasmiṃ mahaggatānuttare jhānadhamme ‘‘appanā’’ti aṭṭhakathāvohāro. Tathā tassa anuppattiṭṭhānabhūte parittajhāne upacāravohāro. Gāmādīnaṃ samīpaṭṭhāne gāmūpacārādisamaññā viyāti āha ‘‘upacārappanāvasena duvidho’’ti. Idha pana samādhivasena veditabbaṃ. Lujjanapalujjanaṭṭhena lokoti vuccati vaṭṭaṃ, tappariyāpannatāya loke niyutto, tattha vā viditoti lokiyo. Tattha apariyāpannatāya lokato uttaro uttiṇṇoti lokuttaro. Kāmañcettha lokiyasamādhi bhāvetabbabhāvena gayhati, ubhayaṃ pana ekajjhaṃ gahetvā tato itaraṃ niddhāretuṃ ‘‘lokiyalokuttaravasena duvidho’’ti vuttaṃ. Sappītikanippītikavasenāti saha pītiyā vattatīti sappītiko, pītisampayutto. Natthi etassa pītīti nippītiko, pītivippayutto. Tesaṃ vasena. Sukhena saha ekuppādādibhāvaṃ gatoti sukhasahagato, sukhasampayuttoti attho. Upekkhāsahagatepi eseva nayo. Upekkhāti cettha adukkhamasukhavedanā adhippetā. Sā hi sukhadukkhākārapavattiṃ upekkhati majjhattākārasaṇṭhitattā. Sukhasahagata-padena cettha sappītiko, nippītikekadeso ca saṅgahito, upekkhāsahagata-padena pana nippītikekadesovāti ayametesaṃ padānaṃ viseso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabhāvato, paccayato, phalato ca majjhimapaṇītehi nihīno, tesaṃ vā guṇehi parihīnoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hīno,"
      },
      " attano paccayehi padhānabhāvaṃ nīto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇīto,"
      },
      " ubhinnaṃ majjhe bhavo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "majjhimo"
      },
      ". Sampayogavasena pavattamānena saha vitakkena savitakko, saha vicārena savicāro, savitakko ca so savicāro cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "savitakkasavicāro. Ādi"
      },
      "-saddena avitakkavicāramatto, avitakkāvicāro ca gahito. Tattha vicārato uttari vitakkena sampayogābhāvato avitakko ca so vicāramatto cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avitakkavicāramatto"
      },
      ". Visesanivattiattho vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "matta"
      },
      "-saddo. Savitakkasavicāro hi samādhi vitakkavisiṭṭhena vicārena savicāro, ayaṃ pana vicāramattena vitakkasaṅkhātavisesarahitena, tasmā avitakkavicāramatto. Atha vā bhāvanāya pahīnattā vitakkābhāvenāyaṃ vicāramatto, na vicārato aññassa attano sampayuttadhammassa kassaci abhāvāti dassetuṃ avitakka-vacanena vicāramatta-padaṃ visesetvā vuttaṃ. Ubhayarahito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avitakkāvicāro. Pītisahagatādivasenā"
      },
      "ti pītisahagatasukhasahagataupekkhāsahagatavasena. Yadettha vattabbaṃ, taṃ sukhasahagataduke vuttanayameva. Paṭipakkhehi samantato khaṇḍitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paritto"
      },
      ". Parittanti vā appamattakaṃ vuccati, ayampi appānubhāvatāya paritto viyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paritto"
      },
      ". Kilesavikkhambhanato, vipulaphalato, dīghasantānato ca mahantabhāvaṃ gato, mahantehi vā uḷāracchandādīhi gato paṭipannoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahaggato"
      },
      ". Ārammaṇakaraṇavasenāpi natthi etassa pamāṇakaradhammā, tesaṃ vā paṭipakkhoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appamāṇo"
      },
      "."
    ],
    "innerText": "Sabhāvato, paccayato, phalato ca majjhimapaṇītehi nihīno, tesaṃ vā guṇehi parihīnoti hīno, attano paccayehi padhānabhāvaṃ nīto paṇīto, ubhinnaṃ majjhe bhavo majjhimo. Sampayogavasena pavattamānena saha vitakkena savitakko, saha vicārena savicāro, savitakko ca so savicāro cāti savitakkasavicāro. Ādi-saddena avitakkavicāramatto, avitakkāvicāro ca gahito. Tattha vicārato uttari vitakkena sampayogābhāvato avitakko ca so vicāramatto cāti avitakkavicāramatto. Visesanivattiattho vā matta-saddo. Savitakkasavicāro hi samādhi vitakkavisiṭṭhena vicārena savicāro, ayaṃ pana vicāramattena vitakkasaṅkhātavisesarahitena, tasmā avitakkavicāramatto. Atha vā bhāvanāya pahīnattā vitakkābhāvenāyaṃ vicāramatto, na vicārato aññassa attano sampayuttadhammassa kassaci abhāvāti dassetuṃ avitakka-vacanena vicāramatta-padaṃ visesetvā vuttaṃ. Ubhayarahito avitakkāvicāro. Pītisahagatādivasenāti pītisahagatasukhasahagataupekkhāsahagatavasena. Yadettha vattabbaṃ, taṃ sukhasahagataduke vuttanayameva. Paṭipakkhehi samantato khaṇḍitattā paritto. Parittanti vā appamattakaṃ vuccati, ayampi appānubhāvatāya paritto viyāti paritto. Kilesavikkhambhanato, vipulaphalato, dīghasantānato ca mahantabhāvaṃ gato, mahantehi vā uḷāracchandādīhi gato paṭipannoti mahaggato. Ārammaṇakaraṇavasenāpi natthi etassa pamāṇakaradhammā, tesaṃ vā paṭipakkhoti appamāṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭipajjati jhānaṃ etāyāti paṭipadā, pubbabhāgabhāvanā. Dukkhā kicchā paṭipadā etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhāpaṭipado"
      },
      ". Pakatipaññāya abhivisiṭṭhattā abhiññā nāma appanāvahā bhāvanāpaññā, dandhā mandā abhiññā etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dandhābhiñño"
      },
      ". Dukkhāpaṭipado ca so dandhābhiñño cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhāpaṭipadādandhābhiñño"
      },
      ", samādhi. Tadādivasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catujhānaṅgavasenā"
      },
      "ti catunnaṃ jhānānaṃ aṅgabhāvavasena, catukkanayavasena cetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hānabhāgiyādivasenā"
      },
      "ti hānakoṭṭhāsikādivasena."
    ],
    "innerText": "Paṭipajjati jhānaṃ etāyāti paṭipadā, pubbabhāgabhāvanā. Dukkhā kicchā paṭipadā etassāti dukkhāpaṭipado. Pakatipaññāya abhivisiṭṭhattā abhiññā nāma appanāvahā bhāvanāpaññā, dandhā mandā abhiññā etassāti dandhābhiñño. Dukkhāpaṭipado ca so dandhābhiñño cāti dukkhāpaṭipadādandhābhiñño, samādhi. Tadādivasena. Catujhānaṅgavasenāti catunnaṃ jhānānaṃ aṅgabhāvavasena, catukkanayavasena cetaṃ vuttaṃ. Hānabhāgiyādivasenāti hānakoṭṭhāsikādivasena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Samādhiekakadukavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Channaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anussatiṭṭhānāna"
      },
      "nti buddhānussatiādīnaṃ channaṃ anussatikammaṭṭhānānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imesaṃ vasenā"
      },
      "ti imesaṃ dasannaṃ kammaṭṭhānānaṃ vasena. ‘‘Pubbabhāge ekaggatā’’ti iminā appanāya upakārakanānāvajjanupacārassapi saṅgaho daṭṭhabbo, na ekāvajjanasseva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appanāsamādhīna"
      },
      "nti upakattabbaupakārakasambandhe sāmivacanaṃ ‘‘purisassa attho’’tiādīsu viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parikamma"
      },
      "nti gotrabhu. Aparitto samādhīti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paṭhamassa jhānassā’’"
      },
      "tiādi vuttaṃ."
    ],
    "innerText": "Channaṃanussatiṭṭhānānanti buddhānussatiādīnaṃ channaṃ anussatikammaṭṭhānānaṃ. Imesaṃ vasenāti imesaṃ dasannaṃ kammaṭṭhānānaṃ vasena. ‘‘Pubbabhāge ekaggatā’’ti iminā appanāya upakārakanānāvajjanupacārassapi saṅgaho daṭṭhabbo, na ekāvajjanasseva. Appanāsamādhīnanti upakattabbaupakārakasambandhe sāmivacanaṃ ‘‘purisassa attho’’tiādīsu viya. Parikammanti gotrabhu. Aparitto samādhīti dassetuṃ ‘‘paṭhamassa jhānassā’’tiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tīsu bhūmīsū"
      },
      "ti kāmarūpārūpabhūmīsu. Kusalacittekaggatāya adhippetattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ariyamaggasampayuttā’’"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siyā sappītiko, siyā nippītiko"
      },
      "ti aniyamavacanaṃ upacārasamādhisāmaññena sabbesampi vā jhānānaṃ nānāvajjanavīthiyaṃ upacārasamādhi siyā sappītiko, siyā nippītiko. Ekāvajjanavīthiyaṃ pana ādito dukatikajjhānānaṃ upacārasamādhi sappītikova, itaresaṃ nippītikova, visabhāgavedanassa cittassa āsevanapaccayatābhāvato, ekavīthiyaṃ vedanāparivattanābhāvato ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siyā sukhasahagato, siyā upekkhāsahagato"
      },
      "ti etthāpi vuttanayeneva attho veditabbo. Tattha pana ‘‘dukatikajjhānāna’’nti vuttaṃ, idha ‘‘tikacatukkajjhānāna’’nti vattabbaṃ."
    ],
    "innerText": "Tīsu bhūmīsūti kāmarūpārūpabhūmīsu. Kusalacittekaggatāya adhippetattā ‘‘ariyamaggasampayuttā’’ti vuttaṃ. Siyā sappītiko, siyā nippītikoti aniyamavacanaṃ upacārasamādhisāmaññena sabbesampi vā jhānānaṃ nānāvajjanavīthiyaṃ upacārasamādhi siyā sappītiko, siyā nippītiko. Ekāvajjanavīthiyaṃ pana ādito dukatikajjhānānaṃ upacārasamādhi sappītikova, itaresaṃ nippītikova, visabhāgavedanassa cittassa āsevanapaccayatābhāvato, ekavīthiyaṃ vedanāparivattanābhāvato ca. Siyā sukhasahagato, siyā upekkhāsahagatoti etthāpi vuttanayeneva attho veditabbo. Tattha pana ‘‘dukatikajjhānāna’’nti vuttaṃ, idha ‘‘tikacatukkajjhānāna’’nti vattabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Samādhitikavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭiladdhamatto"
      },
      "ti adhigatamatto anāsevito abahulīkato. So hi paridubbalabhāvena hīno hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nātisubhāvito"
      },
      "ti ativiya paguṇabhāvaṃ apāpito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Subhāvito"
      },
      "ti suṭṭhu bhāvito sammadeva paguṇataṃ upanīto. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vasippatto’’"
      },
      "ti. Chandādīnaṃ hīnatādivasenāpi imesaṃ hīnāditā veditabbā. Tathā hi uḷārapuññaphalakāmatāvasena pavattito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hīno,"
      },
      " lokiyābhiññāsampādanāya pavattito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "majjhimo,"
      },
      " vivekakāmatāya ariyabhāve ṭhitena pavattito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇīto"
      },
      ". Attahitāya bhavasampattiatthaṃ pavattito vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hīno,"
      },
      " kevalaṃ alobhajjhāsayena pavattito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "majjhimo,"
      },
      " parahitāya pavattito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇīto"
      },
      ". Vaṭṭajjhāsayena vā pavattito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hīno,"
      },
      " vivekajjhāsayena pavattito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "majjhimo,"
      },
      " vivaṭṭajjhāsayena lokuttarapādakatthaṃ pavattito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇīto"
      },
      "."
    ],
    "innerText": "Paṭiladdhamattoti adhigatamatto anāsevito abahulīkato. So hi paridubbalabhāvena hīno hoti. Nātisubhāvitoti ativiya paguṇabhāvaṃ apāpito. Subhāvitoti suṭṭhu bhāvito sammadeva paguṇataṃ upanīto. Tenāha ‘‘vasippatto’’ti. Chandādīnaṃ hīnatādivasenāpi imesaṃ hīnāditā veditabbā. Tathā hi uḷārapuññaphalakāmatāvasena pavattito hīno, lokiyābhiññāsampādanāya pavattito majjhimo, vivekakāmatāya ariyabhāve ṭhitena pavattito paṇīto. Attahitāya bhavasampattiatthaṃ pavattito vā hīno, kevalaṃ alobhajjhāsayena pavattito majjhimo, parahitāya pavattito paṇīto. Vaṭṭajjhāsayena vā pavattito hīno, vivekajjhāsayena pavattito majjhimo, vivaṭṭajjhāsayena lokuttarapādakatthaṃ pavattito paṇīto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhiṃ upacārasamādhinā"
      },
      "ti sabbesampi jhānānaṃ upacārasamādhinā saha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitakkamatteyeva ādīnavaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "disvā"
      },
      "ti vitakkeyeva oḷārikato upaṭṭhahante ‘‘cittassa khobhakaradhammo aya’’nti ādīnavaṃ disvā vicārañca santato manasi karitvā. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vicāre adisvā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ sandhāyā"
      },
      "ti taṃ evaṃ paṭiladdhaṃ samādhiṃ sandhāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etaṃ"
      },
      " ‘‘avitakkavicāramatto samādhī’’ti dutiyapadaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuttaṃ. Tīsū"
      },
      "ti ādito tīsu."
    ],
    "innerText": "Saddhiṃ upacārasamādhināti sabbesampi jhānānaṃ upacārasamādhinā saha. Vitakkamatteyeva ādīnavaṃdisvāti vitakkeyeva oḷārikato upaṭṭhahante ‘‘cittassa khobhakaradhammo aya’’nti ādīnavaṃ disvā vicārañca santato manasi karitvā. Tenāha ‘‘vicāre adisvā’’ti. Taṃ sandhāyāti taṃ evaṃ paṭiladdhaṃ samādhiṃ sandhāya. Etaṃ ‘‘avitakkavicāramatto samādhī’’ti dutiyapadaṃ vuttaṃ. Tīsūti ādito tīsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesvevā"
      },
      "ti tesu eva catukkapañcakanayesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatiye catutthe"
      },
      "ti catukkanaye tatiye, pañcakanaye catuttheti yojetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avasāne"
      },
      "ti dvīsupi nayesu pariyosānajjhāne. Yathākkamaṃ catutthe, pañcame vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pītisukhasahagato vā"
      },
      "ti etthāpi heṭṭhā vuttanayeneva attho veditabbo. Ettha ca satipi pītisahagatassāpi samādhissa sukhasahagatatte tīṇipi padāni asaṅkarato dassetuṃ nippītikasukhato sappītikasukhassa visesadassanatthaṃ satthu pītitikadesanāti nippītikasseva sukhassa vasena sukhasahagato samādhi gahitoti daṭṭhabbo."
    ],
    "innerText": "Tesvevāti tesu eva catukkapañcakanayesu. Tatiye catuttheti catukkanaye tatiye, pañcakanaye catuttheti yojetabbaṃ. Avasāneti dvīsupi nayesu pariyosānajjhāne. Yathākkamaṃ catutthe, pañcame vā. Pītisukhasahagato vāti etthāpi heṭṭhā vuttanayeneva attho veditabbo. Ettha ca satipi pītisahagatassāpi samādhissa sukhasahagatatte tīṇipi padāni asaṅkarato dassetuṃ nippītikasukhato sappītikasukhassa visesadassanatthaṃ satthu pītitikadesanāti nippītikasseva sukhassa vasena sukhasahagato samādhi gahitoti daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upacārabhūmiya"
      },
      "nti upacārajjhānasampayuttacittuppāde. Cittuppādo hi sahajātadhammānaṃ uppattiṭṭhānatāya ‘‘bhūmī’’ti vuccati ‘‘sukhabhūmiyaṃ kāmāvacare’’tiādīsu (dha. sa. 988) viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paritto samādhi"
      },
      " kāmāvacarabhāvato."
    ],
    "innerText": "Upacārabhūmiyanti upacārajjhānasampayuttacittuppāde. Cittuppādo hi sahajātadhammānaṃ uppattiṭṭhānatāya ‘‘bhūmī’’ti vuccati ‘‘sukhabhūmiyaṃ kāmāvacare’’tiādīsu (dha. sa. 988) viya. Paritto samādhi kāmāvacarabhāvato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Samādhicatukkavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamasamannāhāro"
      },
      " bhāvanaṃ ārabhantassa ‘‘pathavī pathavī’’tiādinā kammaṭṭhāne paṭhamābhiniveso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa tassa jhānassa upacāra"
      },
      "nti nīvaraṇavitakkavicāranikantiādīnaṃ vūpasame thirabhūtaṃ kāmāvacarajjhānaṃ. ‘‘Yāva appanā’’ti iminā pubbabhāgapaññāya eva abhiññābhāvo vutto viya dissatīti vadanti ",
      ". Appanāpaññā pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhiññāva"
      },
      ". Yadaggena hi pubbabhāgapaññāya dandhasīghatā, tadaggena appanāpaññāyapīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samudācāragahaṇatāyā"
      },
      "ti samudācārassa gahaṇabhāvena, pavattibāhullatoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asukhāsevanā"
      },
      "ti kasirabhāvanā."
    ],
    "innerText": "Paṭhamasamannāhāro bhāvanaṃ ārabhantassa ‘‘pathavī pathavī’’tiādinā kammaṭṭhāne paṭhamābhiniveso. Tassa tassa jhānassa upacāranti nīvaraṇavitakkavicāranikantiādīnaṃ vūpasame thirabhūtaṃ kāmāvacarajjhānaṃ. ‘‘Yāva appanā’’ti iminā pubbabhāgapaññāya eva abhiññābhāvo vutto viya dissatīti vadanti . Appanāpaññā pana abhiññāva. Yadaggena hi pubbabhāgapaññāya dandhasīghatā, tadaggena appanāpaññāyapīti. Samudācāragahaṇatāyāti samudācārassa gahaṇabhāvena, pavattibāhullatoti attho. Asukhāsevanāti kasirabhāvanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Palibodhupacchedādīnī"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena bhāvanāvidhānāparihāpanādiṃ saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asappāyasevī"
      },
      "ti upacārādhigamato pubbe asappāyasevitāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhā paṭipadā"
      },
      ". Pacchā asappāyasevitāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dandhā abhiññā hoti. Sappāyasevino"
      },
      "ti etthāpi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbabhāge"
      },
      "ti upacārajjhānādhigamato ",
      " orabhāge. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aparabhāge"
      },
      "ti tato uddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa vomissakatā"
      },
      "ti yo pubbabhāge asappāyaṃ sevitvā aparabhāge sappāyasevī, tassa dukkhā paṭipadā khippābhiññā. Itarassa sukhā paṭipadā dandhābhiññā hoti. Evaṃ paṭhamacatutthānaṃ vomissakatāya dutiyatatiyāti attho. Akatapalibodhupacchedassa saparipanthatāya paṭipadā dukkhā hoti, itarassa sukhā. Asampāditaappanākosallassa ñāṇassa avisadatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dandhā abhiññā hoti,"
      },
      " visadatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khippā abhiññā"
      },
      "."
    ],
    "innerText": "Palibodhupacchedādīnīti ādi-saddena bhāvanāvidhānāparihāpanādiṃ saṅgaṇhāti. Asappāyasevīti upacārādhigamato pubbe asappāyasevitāya dukkhā paṭipadā. Pacchā asappāyasevitāya dandhā abhiññā hoti. Sappāyasevinoti etthāpi eseva nayo. Pubbabhāgeti upacārajjhānādhigamato orabhāge. Aparabhāgeti tato uddhaṃ. Tassa vomissakatāti yo pubbabhāge asappāyaṃ sevitvā aparabhāge sappāyasevī, tassa dukkhā paṭipadā khippābhiññā. Itarassa sukhā paṭipadā dandhābhiññā hoti. Evaṃ paṭhamacatutthānaṃ vomissakatāya dutiyatatiyāti attho. Akatapalibodhupacchedassa saparipanthatāya paṭipadā dukkhā hoti, itarassa sukhā. Asampāditaappanākosallassa ñāṇassa avisadatāya dandhā abhiññā hoti, visadatāya khippā abhiññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhāavijjāvasenā"
      },
      "ti taṇhāavijjānaṃ abhibhavānabhibhavavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samathavipassanādhikāravasenā"
      },
      "ti samathavipassanāsu asato, sato ca adhikārassa vasena. Taṇhāya samādhissa ujupaṭipakkhattā sā samathapaṭipadāya paripanthinīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘taṇhābhibhūtassa hi dukkhā paṭipadā hotī’’"
      },
      "ti. Abhibhavo cassā itarakilesehi adhikatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anabhibhūtassa"
      },
      " taṇhāyāti adhikārato veditabbaṃ. Tathā avijjā paññāya ujupaṭipakkhāti tadabhibhūtassa dandhābhiññatā vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akatādhikāro"
      },
      "ti bhavantare akataparicayo yathā paguṇaṃ katvā vissaṭṭhagantho appamattakena payogena suppavatti vācuggatova hoti, evaṃ pubbe kataparicayassa bhāvanā appakasireneva ijjhatīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘katādhikārassa sukhā’’"
      },
      "ti. Svāyaṃ akato, kato ca adhikāro samathanissito paṭipadāyaṃ vutto samādhippadhānattā paṭipadāya. Vipassanānissito abhiññāyaṃ ñāṇappadhānattā appanāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kilesindriyavasenā"
      },
      "ti tikkhātikkhānaṃ kilesindriyānaṃ vasena. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tibbakilesassā’’"
      },
      "tiādi ",
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kilesā"
      },
      " kāmacchandādayo, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "indriyāni"
      },
      " saddhādīni."
    ],
    "innerText": "Taṇhāavijjāvasenāti taṇhāavijjānaṃ abhibhavānabhibhavavasena. Samathavipassanādhikāravasenāti samathavipassanāsu asato, sato ca adhikārassa vasena. Taṇhāya samādhissa ujupaṭipakkhattā sā samathapaṭipadāya paripanthinīti āha ‘‘taṇhābhibhūtassa hi dukkhā paṭipadā hotī’’ti. Abhibhavo cassā itarakilesehi adhikatāya anabhibhūtassa taṇhāyāti adhikārato veditabbaṃ. Tathā avijjā paññāya ujupaṭipakkhāti tadabhibhūtassa dandhābhiññatā vuttā. Akatādhikāroti bhavantare akataparicayo yathā paguṇaṃ katvā vissaṭṭhagantho appamattakena payogena suppavatti vācuggatova hoti, evaṃ pubbe kataparicayassa bhāvanā appakasireneva ijjhatīti āha ‘‘katādhikārassa sukhā’’ti. Svāyaṃ akato, kato ca adhikāro samathanissito paṭipadāyaṃ vutto samādhippadhānattā paṭipadāya. Vipassanānissito abhiññāyaṃ ñāṇappadhānattā appanāya. Kilesindriyavasenāti tikkhātikkhānaṃ kilesindriyānaṃ vasena. Tenāha ‘‘tibbakilesassā’’tiādi . Tattha kilesā kāmacchandādayo, indriyāni saddhādīni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathāvuttā paṭipadābhiññā puggalādhiṭṭhānāti dhammaniddesampi puggalādhiṭṭhānamukhena dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yo puggalo’’"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaguṇo"
      },
      "ti na subhāvito vasībhāvaṃ apāpito. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘uparijhānassa paccayo bhavituṃ na sakkotī’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ paritto"
      },
      "ti ayaṃ samādhi appānubhāvatāya paritto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avaḍḍhite"
      },
      "ti ekaṅguladvaṅgulamattampi na vaḍḍhite yathāupaṭṭhite ārammaṇe. Ekaṅgulamattampi hi vaḍḍhitaṃ appamāṇamevāti vadanti. ‘‘Paguṇo subhāvito’’ti vatvā ‘‘uparijhānassa paccayo bhavituṃ sakkotī’’ti iminā yathā paguṇopi uparijhānassa paccayo bhavituṃ asakkonto samādhi parittoyeva hoti, na appamāṇo, evaṃ ñāṇuttarassa ekāsaneneva uparijhānanibbattanenāti subhāvitopi uparijhānassa paccayabhāvasaṅkhātāya subhāvitakiccasiddhiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘appamāṇo’’"
      },
      "tveva vuccati. Apare pana sace subhāvito paguṇo vasībhāvaṃ patto ",
      " uparijhānassa paccayo ahontopi appamāṇo eva, pamāṇakarānaṃ rāgādipaṭipakkhānaṃ suvidūrabhāvatoti vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuttalakkhaṇavomissatāyā"
      },
      "ti yo appaguṇo uparijhānassa paccayo bhavituṃ na sakkoti, vaḍḍhite ārammaṇe pavatto, ayaṃ paritto appamāṇārammaṇo. Yo pana paguṇo uparijhānassa paccayo bhavituṃ sakkoti, avaḍḍhite ārammaṇe pavatto, ayaṃ appamāṇo parittārammaṇoti evaṃ paṭhamacatutthasamādhīnaṃ vuttalakkhaṇassa vomissakabhāvena dutiyatatiyasamādhisaṅgāhako vomissakanayo veditabbo."
    ],
    "innerText": "Yathāvuttā paṭipadābhiññā puggalādhiṭṭhānāti dhammaniddesampi puggalādhiṭṭhānamukhena dassetuṃ ‘‘yo puggalo’’tiādi vuttaṃ. Appaguṇoti na subhāvito vasībhāvaṃ apāpito. Tenāha ‘‘uparijhānassa paccayo bhavituṃ na sakkotī’’ti. Ayaṃ parittoti ayaṃ samādhi appānubhāvatāya paritto. Avaḍḍhiteti ekaṅguladvaṅgulamattampi na vaḍḍhite yathāupaṭṭhite ārammaṇe. Ekaṅgulamattampi hi vaḍḍhitaṃ appamāṇamevāti vadanti. ‘‘Paguṇo subhāvito’’ti vatvā ‘‘uparijhānassa paccayo bhavituṃ sakkotī’’ti iminā yathā paguṇopi uparijhānassa paccayo bhavituṃ asakkonto samādhi parittoyeva hoti, na appamāṇo, evaṃ ñāṇuttarassa ekāsaneneva uparijhānanibbattanenāti subhāvitopi uparijhānassa paccayabhāvasaṅkhātāya subhāvitakiccasiddhiyā ‘‘appamāṇo’’tveva vuccati. Apare pana sace subhāvito paguṇo vasībhāvaṃ patto uparijhānassa paccayo ahontopi appamāṇo eva, pamāṇakarānaṃ rāgādipaṭipakkhānaṃ suvidūrabhāvatoti vadanti. Vuttalakkhaṇavomissatāyāti yo appaguṇo uparijhānassa paccayo bhavituṃ na sakkoti, vaḍḍhite ārammaṇe pavatto, ayaṃ paritto appamāṇārammaṇo. Yo pana paguṇo uparijhānassa paccayo bhavituṃ sakkoti, avaḍḍhite ārammaṇe pavatto, ayaṃ appamāṇo parittārammaṇoti evaṃ paṭhamacatutthasamādhīnaṃ vuttalakkhaṇassa vomissakabhāvena dutiyatatiyasamādhisaṅgāhako vomissakanayo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato"
      },
      "ti tato paṭhamajjhānato uddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Virattapītika"
      },
      "nti atikkantapītikaṃ vā jigucchitapītikaṃ vā. Avayavo samudāyassa aṅganti vuccati, ‘‘senaṅgaṃ rathaṅga’’ntiādīsu viyāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘catunnaṃ jhānānaṃ aṅgabhūtā cattāro samādhī’’"
      },
      "ti."
    ],
    "innerText": "Tatoti tato paṭhamajjhānato uddhaṃ. Virattapītikanti atikkantapītikaṃ vā jigucchitapītikaṃ vā. Avayavo samudāyassa aṅganti vuccati, ‘‘senaṅgaṃ rathaṅga’’ntiādīsu viyāti āha ‘‘catunnaṃ jhānānaṃ aṅgabhūtā cattāro samādhī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hānaṃ bhajatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hānabhāgiyo,"
      },
      " hānabhāgo vā etassa atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hānabhāgiyo,"
      },
      " parihānakoṭṭhāsikoti attho. Ālayassa apekkhāya apariccajanato ṭhitiṃ bhajatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ṭhitibhāgiyo"
      },
      ". Visesaṃ bhajatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visesabhāgiyo. Paccanīkasamudācāravasenā"
      },
      "ti tassa tassa ",
      " jhānassa paccanīkānaṃ nīvaraṇavitakkavicārādīnaṃ pavattivasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadanudhammatāyā"
      },
      "ti tadanurūpabhūtāya satiyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṇṭhānavasenā"
      },
      "ti saṇṭhahanavasena patiṭṭhānavasena. ‘‘Sā pana tadassādasaṅkhātā, tadassādasampayuttakkhandhasaṅkhātā vā micchāsatī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammohavinodaniyaṃ"
      },
      " (vibha. aṭṭha. 799) vuttaṃ. Tattha sāpekkhassa upari visesaṃ nibbattetuṃ asakkuṇeyyattā avigatanikantikā taṃtaṃpariharaṇasatītipi vattuṃ vaṭṭati. Evañca katvā ‘‘satiyā vā nikantiyā vā’’ti vikappavacanañca yuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visesādhigamavasenā"
      },
      "ti visesādhigamassa paccayabhāvavasena, visesaṃ vā adhigacchati etenāti visesādhigamo, tassa vasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibbidāsahagatasaññāmanasikārasamudācāravasenā"
      },
      "ti ādīnavadassanapubbaṅgamanibbindanañāṇasampayuttasaññāya ca ābhogassa ca pavattivasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibbedhabhāgiyatā"
      },
      "ti saccānaṃ nibbijjhanapakkhikatā vipassanāya saṃvattatīti attho."
    ],
    "innerText": "Hānaṃ bhajatīti hānabhāgiyo, hānabhāgo vā etassa atthīti hānabhāgiyo, parihānakoṭṭhāsikoti attho. Ālayassa apekkhāya apariccajanato ṭhitiṃ bhajatīti ṭhitibhāgiyo. Visesaṃ bhajatīti visesabhāgiyo. Paccanīkasamudācāravasenāti tassa tassa jhānassa paccanīkānaṃ nīvaraṇavitakkavicārādīnaṃ pavattivasena. Tadanudhammatāyāti tadanurūpabhūtāya satiyā. Saṇṭhānavasenāti saṇṭhahanavasena patiṭṭhānavasena. ‘‘Sā pana tadassādasaṅkhātā, tadassādasampayuttakkhandhasaṅkhātā vā micchāsatī’’ti sammohavinodaniyaṃ (vibha. aṭṭha. 799) vuttaṃ. Tattha sāpekkhassa upari visesaṃ nibbattetuṃ asakkuṇeyyattā avigatanikantikā taṃtaṃpariharaṇasatītipi vattuṃ vaṭṭati. Evañca katvā ‘‘satiyā vā nikantiyā vā’’ti vikappavacanañca yuttaṃ hoti. Visesādhigamavasenāti visesādhigamassa paccayabhāvavasena, visesaṃ vā adhigacchati etenāti visesādhigamo, tassa vasena. Nibbidāsahagatasaññāmanasikārasamudācāravasenāti ādīnavadassanapubbaṅgamanibbindanañāṇasampayuttasaññāya ca ābhogassa ca pavattivasena. Nibbedhabhāgiyatāti saccānaṃ nibbijjhanapakkhikatā vipassanāya saṃvattatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmasahagatā"
      },
      "ti kāmārammaṇā, kāmasaññāhi vā vokiṇṇā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avitakkasahagatā"
      },
      "ti ‘‘kathaṃ nu kho me avitakkaṃ jhānaṃ bhaveyyā’’ti evaṃ avitakkārammaṇā avitakkavisayā. Kāmañcāyaṃ ‘‘paṭhamassa jhānassā’’tiādiko pāṭho paññāvasena āgato, samādhissāpi panettha saṅgaho ",
      " atthevāti udāharaṇassa sātthakataṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tāya pana paññāya sampayuttā samādhīpi cattāro hontī’’"
      },
      "ti tesaṃ vasena evaṃ vuttanti attho."
    ],
    "innerText": "Kāmasahagatāti kāmārammaṇā, kāmasaññāhi vā vokiṇṇā. Avitakkasahagatāti ‘‘kathaṃ nu kho me avitakkaṃ jhānaṃ bhaveyyā’’ti evaṃ avitakkārammaṇā avitakkavisayā. Kāmañcāyaṃ ‘‘paṭhamassa jhānassā’’tiādiko pāṭho paññāvasena āgato, samādhissāpi panettha saṅgaho atthevāti udāharaṇassa sātthakataṃ dassetuṃ ‘‘tāya pana paññāya sampayuttā samādhīpi cattāro hontī’’ti tesaṃ vasena evaṃ vuttanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāmayassa samādhissa idhādhippetattā upacārekaggatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kāmāvacaro samādhī’’"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhipatiṃ karitvā"
      },
      "ti ‘‘chandavato ce samādhi hoti, mayhampi evaṃ hotī’’ti chandaṃ adhipatiṃ, chandaṃ dhuraṃ jeṭṭhakaṃ pubbaṅgamaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Labhati samādhi"
      },
      "nti evaṃ yaṃ samādhiṃ labhati, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ayaṃ vuccati chandasamādhi,"
      },
      " chandādhipatisamādhīti attho. Evaṃ vīriyasamādhiādayopi veditabbā."
    ],
    "innerText": "Bhāvanāmayassa samādhissa idhādhippetattā upacārekaggatā ‘‘kāmāvacaro samādhī’’ti vuttaṃ. Adhipatiṃ karitvāti ‘‘chandavato ce samādhi hoti, mayhampi evaṃ hotī’’ti chandaṃ adhipatiṃ, chandaṃ dhuraṃ jeṭṭhakaṃ pubbaṅgamaṃ katvā. Labhati samādhinti evaṃ yaṃ samādhiṃ labhati, ayaṃ vuccati chandasamādhi, chandādhipatisamādhīti attho. Evaṃ vīriyasamādhiādayopi veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catukkabhede"
      },
      "ti catukkavasena samādhippabhedaniddese. Aññattha sampayogavasena vicārena saha vattamāno vitakko pañcakanaye dutiyajjhāne viyojitopi na suṭṭhu viyojitoti, tena saddhiṃyeva vicārasamatikkamaṃ dassetuṃ vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vitakkavicārātikkamena tatiya’’"
      },
      "nti. Dvidhā ",
      " bhinditvā catukkabhede vuttaṃ dutiyaṃ jhānanti yojanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcajhānaṅgavasenā"
      },
      "ti pañcannaṃ jhānānaṃ aṅgabhāvavasena samādhissa pañcavidhatā veditabbā."
    ],
    "innerText": "Catukkabhedeti catukkavasena samādhippabhedaniddese. Aññattha sampayogavasena vicārena saha vattamāno vitakko pañcakanaye dutiyajjhāne viyojitopi na suṭṭhu viyojitoti, tena saddhiṃyeva vicārasamatikkamaṃ dassetuṃ vuttaṃ ‘‘vitakkavicārātikkamena tatiya’’nti. Dvidhā bhinditvā catukkabhede vuttaṃ dutiyaṃ jhānanti yojanā. Pañcajhānaṅgavasenāti pañcannaṃ jhānānaṃ aṅgabhāvavasena samādhissa pañcavidhatā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vibhaṅge"
      },
      "ti ñāṇavibhaṅge. Tattha hi ‘‘jhānavimokkhasamādhisamāpattīnaṃ saṃkilesavodāna’’nti, ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘saṃkilesa’’"
      },
      "ntiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hānabhāgiyo dhammo"
      },
      "ti apaguṇehi paṭhamajjhānādīhi vuṭṭhitassa saññāmanasikārānaṃ kāmādianupakkhandanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visesabhāgiyo dhammo"
      },
      "ti paguṇehi paṭhamajjhānādīhi vuṭṭhitassa saññāmanasikārānaṃ dutiyajjhānādianupakkhandanaṃ. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paṭhamassa jhānassa lābhi’’"
      },
      "ntiādi. Tassattho (vibha. aṭṭha. 828) – apaguṇassa paṭhamassa jhānassa lābhīnaṃ tato vuṭṭhitaṃ ārammaṇavasena kāmasahagatā hutvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saññāmanasikārā samudācaranti"
      },
      " codenti tudanti, tassa kāmānupakkhandānaṃ saññāmanasikārānaṃ vasena sā paṭhamajjhānapaññā hāyati, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hānabhāginī paññā. Avitakkasahagatā"
      },
      "ti avitakkaṃ dutiyaṃ jhānaṃ santato paṇītato manasi karoto ārammaṇavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avitakkasahagatā samudācaranti"
      },
      " paguṇapaṭhamajjhānato vuṭṭhitaṃ dutiyajjhānādhigamatthāya codenti tudanti, tassa dutiyajjhānānupakkhandānaṃ saññāmanasikārānaṃ vasena paṭhamajjhānapaññā visesabhūtassa dutiyajjhānassa uppattiyā padaṭṭhānatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visesabhāginī paññā"
      },
      ". Taṃsampayutto samādhi idhādhippeto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iminā nayenā"
      },
      "ti iminā paṭhamajjhāne vuttena vidhinā dutiyajjhānādīsupi hānabhāgiyadhammo, visesabhāgiyadhammo ca veditabbo."
    ],
    "innerText": "40.Vibhaṅgeti ñāṇavibhaṅge. Tattha hi ‘‘jhānavimokkhasamādhisamāpattīnaṃ saṃkilesavodāna’’nti, ettha ‘‘saṃkilesa’’ntiādi vuttaṃ. Tattha hānabhāgiyo dhammoti apaguṇehi paṭhamajjhānādīhi vuṭṭhitassa saññāmanasikārānaṃ kāmādianupakkhandanaṃ. Visesabhāgiyo dhammoti paguṇehi paṭhamajjhānādīhi vuṭṭhitassa saññāmanasikārānaṃ dutiyajjhānādianupakkhandanaṃ. Tenāha ‘‘paṭhamassa jhānassa lābhi’’ntiādi. Tassattho (vibha. aṭṭha. 828) – apaguṇassa paṭhamassa jhānassa lābhīnaṃ tato vuṭṭhitaṃ ārammaṇavasena kāmasahagatā hutvā saññāmanasikārā samudācaranti codenti tudanti, tassa kāmānupakkhandānaṃ saññāmanasikārānaṃ vasena sā paṭhamajjhānapaññā hāyati, tasmā hānabhāginī paññā. Avitakkasahagatāti avitakkaṃ dutiyaṃ jhānaṃ santato paṇītato manasi karoto ārammaṇavasena avitakkasahagatā samudācaranti paguṇapaṭhamajjhānato vuṭṭhitaṃ dutiyajjhānādhigamatthāya codenti tudanti, tassa dutiyajjhānānupakkhandānaṃ saññāmanasikārānaṃ vasena paṭhamajjhānapaññā visesabhūtassa dutiyajjhānassa uppattiyā padaṭṭhānatāya visesabhāginī paññā. Taṃsampayutto samādhi idhādhippeto. Iminā nayenāti iminā paṭhamajjhāne vuttena vidhinā dutiyajjhānādīsupi hānabhāgiyadhammo, visesabhāgiyadhammo ca veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dasapalibodhavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ariyamaggasampayutto"
      },
      "ti ",
      " lokuttaraappamāṇaapariyāpannaggahaṇena lokiyehi asādhāraṇato, sappītikādiggahaṇena sādhāraṇato ca ariyamaggasampayutto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samādhi vutto. Bhāvito hoti"
      },
      " saññāya sampayuttattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ta"
      },
      "nti ariyamaggasamādhiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visu"
      },
      "nti paññābhāvanāya visuṃ katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na vadāma"
      },
      "."
    ],
    "innerText": "41.Ariyamaggasampayuttoti lokuttaraappamāṇaapariyāpannaggahaṇena lokiyehi asādhāraṇato, sappītikādiggahaṇena sādhāraṇato ca ariyamaggasampayutto samādhi vutto. Bhāvito hoti saññāya sampayuttattā. Tanti ariyamaggasamādhiṃ. Visunti paññābhāvanāya visuṃ katvā na vadāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kammaṭṭhānabhāvanaṃ ",
      " paribundheti uparodheti pavattituṃ na detīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "palibodho"
      },
      " ra-kārassa la-kāraṃ katvā, paripanthoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upacchinditvā"
      },
      "ti samāpanena, saṅgahaṇena vā uparundhitvā, apalibodhaṃ katvāti attho."
    ],
    "innerText": "Kammaṭṭhānabhāvanaṃ paribundheti uparodheti pavattituṃ na detīti palibodho ra-kārassa la-kāraṃ katvā, paripanthoti attho. Upacchinditvāti samāpanena, saṅgahaṇena vā uparundhitvā, apalibodhaṃ katvāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Āvasanti etthāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āvāso"
      },
      ". Paricchedavasena veṇiyati dissatīti pariveṇaṃ. Vihāre bhikkhūnaṃ taṃ taṃ vasanaṭṭhānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Svāyaṃ"
      },
      " āvāso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navakammādīsū"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena āvāsassa tadaññaṃ abhivuddhikāraṇaṃ saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāraṇenā"
      },
      "ti ‘‘chāyūdakasampannaṃ sulabhabhikkha’’ntiādinā kāraṇena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apekkhavā"
      },
      "ti sālayo."
    ],
    "innerText": "Āvasanti etthāti āvāso. Paricchedavasena veṇiyati dissatīti pariveṇaṃ. Vihāre bhikkhūnaṃ taṃ taṃ vasanaṭṭhānaṃ. Svāyaṃ āvāso. Navakammādīsūti ādi-saddena āvāsassa tadaññaṃ abhivuddhikāraṇaṃ saṅgaṇhāti. Kāraṇenāti ‘‘chāyūdakasampannaṃ sulabhabhikkha’’ntiādinā kāraṇena. Apekkhavāti sālayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatrā"
      },
      "ti tasmiṃ palibodhābhāve. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pācīnakhaṇḍarāji"
      },
      "nti puratthimadisāyaṃ pabbatakhaṇḍānaṃ antare vanarājiṭṭhānaṃ. ‘‘Nāmā’’ti iminā tassa padesassa ayaṃ samaññāti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisāmitamevā"
      },
      "ti niccakālaṃ paṭisāmetvāva vihārato nikkhamāmīti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhātunidhānaṭṭhāna"
      },
      "nti kāyabandhanadhammakaraṇanhānasāṭikaakkhakadhātusaṅkhātānaṃ paribhogasarīradhātūnaṃ nidahitaṭṭhānaṃ. Īdisassa ayaṃ thero viya alaggacittassa. Etena ‘‘bhikkhunā nāma āvāse evarūpena bhavitabba’’nti ovādo dinno hoti. Ito paresupi vatthūsu eseva nayo."
    ],
    "innerText": "Tatrāti tasmiṃ palibodhābhāve. Pācīnakhaṇḍarājinti puratthimadisāyaṃ pabbatakhaṇḍānaṃ antare vanarājiṭṭhānaṃ. ‘‘Nāmā’’ti iminā tassa padesassa ayaṃ samaññāti dasseti. Paṭisāmitamevāti niccakālaṃ paṭisāmetvāva vihārato nikkhamāmīti dasseti. Dhātunidhānaṭṭhānanti kāyabandhanadhammakaraṇanhānasāṭikaakkhakadhātusaṅkhātānaṃ paribhogasarīradhātūnaṃ nidahitaṭṭhānaṃ. Īdisassa ayaṃ thero viya alaggacittassa. Etena ‘‘bhikkhunā nāma āvāse evarūpena bhavitabba’’nti ovādo dinno hoti. Ito paresupi vatthūsu eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kula"
      },
      "nti kulaggahaṇena kulamanussānaṃ gahaṇaṃ gāmaggahaṇena gāmavāsīnaṃ viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upaṭṭhākakulampī"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pi"
      },
      "-saddena pageva ñātikulanti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddesattha"
      },
      "nti uddisāpanatthaṃ, pāṭhaṃ uddisāpetvā sajjhāyitunti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhevā"
      },
      "ti imasmiṃyeva padese, yattha katthaci vihāreti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ vihāra"
      },
      "nti taṃ koraṇḍakavihāraṃ."
    ],
    "innerText": "Kulanti kulaggahaṇena kulamanussānaṃ gahaṇaṃ gāmaggahaṇena gāmavāsīnaṃ viya. Upaṭṭhākakulampīti pi-saddena pageva ñātikulanti dasseti. Uddesatthanti uddisāpanatthaṃ, pāṭhaṃ uddisāpetvā sajjhāyitunti attho. Idhevāti imasmiṃyeva padese, yattha katthaci vihāreti attho. Taṃ vihāranti taṃ koraṇḍakavihāraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upagato"
      },
      "ti ",
      " vassaṃ upagato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sadā"
      },
      "ti gatakālato pabhuti visesato pavāritadivasato paṭṭhāya sabbadā divase divase. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paridevamānā"
      },
      "ti taṃtaṃvilapanavasena vividhaṃ paridevantī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaṃ pavatti"
      },
      "nti attanā tattha diṭṭhakālato paṭṭhāya pacchā samāgamapariyosānaṃ daharassa sabbaṃ pavattiṃ."
    ],
    "innerText": "Upagatoti vassaṃ upagato. Sadāti gatakālato pabhuti visesato pavāritadivasato paṭṭhāya sabbadā divase divase. Paridevamānāti taṃtaṃvilapanavasena vividhaṃ paridevantī. Sabbaṃ pavattinti attanā tattha diṭṭhakālato paṭṭhāya pacchā samāgamapariyosānaṃ daharassa sabbaṃ pavattiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyasakkhi"
      },
      "nti ",
      " ‘‘passa ima’’nti mukhapaṭiggāhakaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rathavinītapaṭipada"
      },
      "nti dasakathāvatthukittanapubbikaṃ rathavinītūpamāhi vibhāvitaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rathavinītasutte"
      },
      " (ma. ni. 1.252) āgataṃ sattavisuddhipaṭipadaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nālakapaṭipada"
      },
      "nti ‘‘moneyyaṃ te upaññissa’’ntiādinā (su. ni. 706) satthārā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nālakattherassa"
      },
      " desitapaṭipadaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tuvaṭakapaṭipada"
      },
      "nti ‘‘mūlaṃ papañcasaṅkhāyā’’tiādinā (su. ni. 922) bhagavatā desitapaṭipadaṃ. Tattha hi yathākkamaṃ –"
    ],
    "innerText": "Kāyasakkhinti ‘‘passa ima’’nti mukhapaṭiggāhakaṃ katvā. Rathavinītapaṭipadanti dasakathāvatthukittanapubbikaṃ rathavinītūpamāhi vibhāvitaṃ rathavinītasutte (ma. ni. 1.252) āgataṃ sattavisuddhipaṭipadaṃ. Nālakapaṭipadanti ‘‘moneyyaṃ te upaññissa’’ntiādinā (su. ni. 706) satthārā nālakattherassa desitapaṭipadaṃ. Tuvaṭakapaṭipadanti ‘‘mūlaṃ papañcasaṅkhāyā’’tiādinā (su. ni. 922) bhagavatā desitapaṭipadaṃ. Tattha hi yathākkamaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Na munī gāmamāgamma, kulesu sahasā care;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ghāsesanaṃ chinnakatho, na vācaṃ payutaṃ bhaṇe’’. (su. ni. 716);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "‘‘Gāme ca nābhisajjeyya, lābhakamyā janaṃ na lapayeyyā’’ti. (su. ni. 935) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evamādikā paramappicchakathā āgatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catupaccayasantosabhāvanārāmatādīpaka"
      },
      "nti cīvarādīsu catūsu paccayesu santosassa, bhāvanārāmatāya ca pakāsakaṃ."
    ],
    "innerText": "Evamādikā paramappicchakathā āgatā. Catupaccayasantosabhāvanārāmatādīpakanti cīvarādīsu catūsu paccayesu santosassa, bhāvanārāmatāya ca pakāsakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Labbhatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lābho"
      },
      ". Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cattāro paccayā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāparivāre"
      },
      "ti vipulaparivāre. Piṇḍapātaṃ tāva dentā buddhapūjāpattacīvarādīni tassa parivārāni katvā denti, tathā cīvarādidānepi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bāhullikapiṇḍapātikā"
      },
      "ti piṇḍapātikā hutvā paccayabāhullikā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vadantī"
      },
      "ti purimadivase bhikkhāya āhiṇḍanakāle yathāsutaṃ vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niccabyāvaṭo"
      },
      " upāsakādīnaṃ saṅgaṇhane."
    ],
    "innerText": "Labbhatīti lābho. Tenāha ‘‘cattāro paccayā’’ti. Mahāparivāreti vipulaparivāre. Piṇḍapātaṃ tāva dentā buddhapūjāpattacīvarādīni tassa parivārāni katvā denti, tathā cīvarādidānepi. Bāhullikapiṇḍapātikāti piṇḍapātikā hutvā paccayabāhullikā. Vadantīti purimadivase bhikkhāya āhiṇḍanakāle yathāsutaṃ vadanti. Niccabyāvaṭo upāsakādīnaṃ saṅgaṇhane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā"
      },
      "ti gaṇassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So"
      },
      "ti gaṇapalibodho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eva"
      },
      "nti idāni vuccamānākārena gaṇavācakassa pariyesanampi lahukameva icchitabbanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yojanato paraṃ agantvā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attano kamma"
      },
      "nti samaṇadhammamāha."
    ],
    "innerText": "Tassāti gaṇassa. Soti gaṇapalibodho. Evanti idāni vuccamānākārena gaṇavācakassa pariyesanampi lahukameva icchitabbanti āha ‘‘yojanato paraṃ agantvā’’ti. Attano kammanti samaṇadhammamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katākate"
      },
      "ti ",
      " kate ca akate ca kamme jānanavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ussukkaṃ āpajjitabbaṃ, katākate"
      },
      "ti vā appake ca mahante ca kate, yathā ‘‘phalāphale’’ti. Sace bahuṃ avasiṭṭhanti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhārahārā"
      },
      " saṅghakiccapariṇāyakā."
    ],
    "innerText": "Katākateti kate ca akate ca kamme jānanavasena ussukkaṃ āpajjitabbaṃ, katākateti vā appake ca mahante ca kate, yathā ‘‘phalāphale’’ti. Sace bahuṃ avasiṭṭhanti sambandho. Bhārahārā saṅghakiccapariṇāyakā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabbajjāpekkho"
      },
      "ti ",
      " sīhaḷadīpe kira kuladārakānaṃ pabbajjā āvāhavivāhasadisā, tasmā taṃ paricchinnadivasaṃ atikkametuṃ na sakkā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Sace taṃ alabhanto na sakkoti adhivāsetu’’"
      },
      "ntiādinā samāpanena palibodhupacchedo vutto, byatirekato pana ‘‘sace taṃ alabhanto sakkoti adhivāsetuṃ, araññaṃ pavisitvā samaṇadhammova kātabbo’’ti ayamattho dassitoti saṅgahaṇena palibodhupacchedo veditabbo. Esa nayo sesesupi."
    ],
    "innerText": "Pabbajjāpekkhoti sīhaḷadīpe kira kuladārakānaṃ pabbajjā āvāhavivāhasadisā, tasmā taṃ paricchinnadivasaṃ atikkametuṃ na sakkā. ‘‘Sace taṃ alabhanto na sakkoti adhivāsetu’’ntiādinā samāpanena palibodhupacchedo vutto, byatirekato pana ‘‘sace taṃ alabhanto sakkoti adhivāsetuṃ, araññaṃ pavisitvā samaṇadhammova kātabbo’’ti ayamattho dassitoti saṅgahaṇena palibodhupacchedo veditabbo. Esa nayo sesesupi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathā"
      },
      "ti yathā upajjhāyo gilāno yāvajīvaṃ upaṭṭhātabbo, tathā upasampāditaantevāsiko attano kammavācaṃ vatvā upasampādito."
    ],
    "innerText": "Tathāti yathā upajjhāyo gilāno yāvajīvaṃ upaṭṭhātabbo, tathā upasampāditaantevāsiko attano kammavācaṃ vatvā upasampādito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo koci rogo"
      },
      "ti mūlabhūto, anubandho vā attano uppanno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anamatagge"
      },
      "ti anu anu amatagge anādimati."
    ],
    "innerText": "Yo koci rogoti mūlabhūto, anubandho vā attano uppanno. Anamataggeti anu anu amatagge anādimati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Gantho’’ti iminā ganthapalibodho idha vuttoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pariyattiharaṇa’’"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sajjhāyādīhī"
      },
      "ti sajjhāyadhāraṇaparicayapucchādīhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itarassā"
      },
      "ti abyāvaṭassa. Yassa ganthadhuraṃ vissajjetvā ṭhitassāpi gantho vattateva, na tassa gantho palibodho. Yathā tamhi tamhi vatthumhi āgatattherānaṃ, nāpi sabbena sabbaṃ aganthapasutassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhimapaṇṇāsako āgacchati,"
      },
      " suttapadesānaṃ vārānañca sadisatāya byāmuyhanato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puna na olokessāmī"
      },
      "ti kammaṭṭhānaṃ gahetvā ganthadhuraṃ vissajjemīti attho."
    ],
    "innerText": "‘‘Gantho’’ti iminā ganthapalibodho idha vuttoti āha ‘‘pariyattiharaṇa’’nti. Sajjhāyādīhīti sajjhāyadhāraṇaparicayapucchādīhi. Itarassāti abyāvaṭassa. Yassa ganthadhuraṃ vissajjetvā ṭhitassāpi gantho vattateva, na tassa gantho palibodho. Yathā tamhi tamhi vatthumhi āgatattherānaṃ, nāpi sabbena sabbaṃ aganthapasutassa. Majjhimapaṇṇāsako āgacchati, suttapadesānaṃ vārānañca sadisatāya byāmuyhanato. Puna na olokessāmīti kammaṭṭhānaṃ gahetvā ganthadhuraṃ vissajjemīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gāmavāsikattherehī"
      },
      "ti anurādhapuravāsīhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuggahetvā"
      },
      "ti aggahetvā tattha paricayaṃ akatvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcanikāyamaṇḍale"
      },
      "ti dīghāgamādike pañcapi nikāye sikkhitaparisāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parivattessāmī"
      },
      "ti vaṇṇayissāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvaṇṇabheri"
      },
      "nti seṭṭhabheriṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katamācariyānaṃ uggaho"
      },
      "ti katamesaṃ ācariyānaṃ uggaho, kena parivattīyatīti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ācariyamaggo"
      },
      "ti ācariyānaṃ kathāmaggo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attano ācariyāna"
      },
      "nti attano kathetuṃ yuttānaṃ ācariyānaṃ. Suvinicchitā sabbā tipiṭakapariyatti ",
      " etasmiṃ atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbapariyattiko,"
      },
      " tepiṭakoti attho. Pīṭhe nisinno tato otaritvā bhūmiyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṭṭikāya nisīditvā. Gatakassā"
      },
      "ti paṭipattigamanena gatassa diṭṭhasaccassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cīvaraṃ pārupitvā"
      },
      "ti ācariyassa apacitidassanatthaṃ ",
      " parimaṇḍalaṃ cīvaraṃ pārupitvā. Sāṭheyyābhāvato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uju"
      },
      ". Kāraṇākāraṇassa ājānanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ājānīyo"
      },
      "."
    ],
    "innerText": "Gāmavāsikattherehīti anurādhapuravāsīhi. Anuggahetvāti aggahetvā tattha paricayaṃ akatvā. Pañcanikāyamaṇḍaleti dīghāgamādike pañcapi nikāye sikkhitaparisāya. Parivattessāmīti vaṇṇayissāmi. Suvaṇṇabherinti seṭṭhabheriṃ. Katamācariyānaṃ uggahoti katamesaṃ ācariyānaṃ uggaho, kena parivattīyatīti adhippāyo. Ācariyamaggoti ācariyānaṃ kathāmaggo. Attano ācariyānanti attano kathetuṃ yuttānaṃ ācariyānaṃ. Suvinicchitā sabbā tipiṭakapariyatti etasmiṃ atthīti sabbapariyattiko, tepiṭakoti attho. Pīṭhe nisinno tato otaritvā bhūmiyaṃ taṭṭikāya nisīditvā. Gatakassāti paṭipattigamanena gatassa diṭṭhasaccassa. Cīvaraṃ pārupitvāti ācariyassa apacitidassanatthaṃ parimaṇḍalaṃ cīvaraṃ pārupitvā. Sāṭheyyābhāvato uju. Kāraṇākāraṇassa ājānanato ājānīyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pothujjanikā"
      },
      "ti puthujjane bhavā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dupparihārā"
      },
      " bahuparissayatāya. Tathā hissā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uttānaseyyakadārako, taruṇasassa"
      },
      "ñca nidassitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipassanāya palibodho"
      },
      " samathayānikassa, na vipassanāyānikassa. Yebhuyyena hi jhānalābhī samathayānikova hoti vipassanāsukhato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itarenā"
      },
      "ti samathatthikena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avasesā"
      },
      " nava palibodhā."
    ],
    "innerText": "Pothujjanikāti puthujjane bhavā. Dupparihārā bahuparissayatāya. Tathā hissā uttānaseyyakadārako, taruṇasassañca nidassitaṃ. Vipassanāya palibodho samathayānikassa, na vipassanāyānikassa. Yebhuyyena hi jhānalābhī samathayānikova hoti vipassanāsukhato. Itarenāti samathatthikena. Avasesā nava palibodhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Kammaṭṭhānadāyakavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42"
      },
      ". Kammaṭṭhāne niyutto kammaṭṭhāniko, bhāvanamanuyuñjanto. Tena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṭṭhānikena. Paricchinditvā"
      },
      "ti ‘‘imasmiṃ vihāre sabbe bhikkhū’’ti evaṃ paricchinditvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahavāsīnaṃ"
      },
      " bhikkhūnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muducittata"
      },
      "nti attani muducittataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "janeti,"
      },
      " ayañca sahavāsīnaṃ cittamaddavajananādiattho ‘‘manussānaṃ piyo hotī’’tiādinayappavattena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mettānisaṃsasuttena"
      },
      " (a. ni. 11.15; paṭi. ma. 2.22; mi. pa. 4.4.6) dīpetabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anolīnavuttiko hoti"
      },
      " sammāpaṭipattiyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dibbānipi ārammaṇāni"
      },
      " pageva itarāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbattha"
      },
      " sabbasmiṃ samaṇakaraṇīye, sabbasmiṃ vā kammaṭṭhānānuyoge. Pubbāsevanavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthayitabbaṃ"
      },
      ". Yogassa bhāvanāya anuyuñjanaṃ yogānuyogo, tadeva karaṇīyaṭṭhena kammaṃ, tassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yogānuyogakammassa ṭhānaṃ"
      },
      " nipphattihetu."
    ],
    "innerText": "42. Kammaṭṭhāne niyutto kammaṭṭhāniko, bhāvanamanuyuñjanto. Tena kammaṭṭhānikena. Paricchinditvāti ‘‘imasmiṃ vihāre sabbe bhikkhū’’ti evaṃ paricchinditvā. Sahavāsīnaṃ bhikkhūnaṃ. Muducittatanti attani muducittataṃ janeti, ayañca sahavāsīnaṃ cittamaddavajananādiattho ‘‘manussānaṃ piyo hotī’’tiādinayappavattena mettānisaṃsasuttena (a. ni. 11.15; paṭi. ma. 2.22; mi. pa. 4.4.6) dīpetabbo. Anolīnavuttiko hoti sammāpaṭipattiyaṃ. Dibbānipi ārammaṇāni pageva itarāni. Sabbattha sabbasmiṃ samaṇakaraṇīye, sabbasmiṃ vā kammaṭṭhānānuyoge. Pubbāsevanavasena atthayitabbaṃ. Yogassa bhāvanāya anuyuñjanaṃ yogānuyogo, tadeva karaṇīyaṭṭhena kammaṃ, tassa yogānuyogakammassa ṭhānaṃ nipphattihetu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niccaṃ pariharitabbattā"
      },
      "ti sabbatthakakammaṭṭhānaṃ viya ekadāva ananuyuñjitvā sabbakālaṃ pariharaṇīyattā anuyuñjitabbattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evamādiguṇasamannāgata"
      },
      "nti piyabhāvādīhi guṇehi sampannaṃ. Kalyāṇamitto hi saddhāsampanno hoti sīlasampanno sutasampanno cāgasampanno vīriyasampanno satisampanno samādhisampanno paññāsampanno. Tattha saddhāsampattiyā saddahati tathāgatassa bodhiṃ, kammaphalañca, tena sammāsambodhiyā hetubhūtaṃ sattesu hitesitaṃ na pariccajati. Sīlasampattiyā sattānaṃ piyo hoti garu bhāvanīyo codako pāpagarahī vattā vacanakkhamo, sutasampattiyā saccapaṭiccasamuppādādipaṭisaṃyuttānaṃ gambhīrānaṃ kathānaṃ kattā hoti, cāgasampattiyā appiccho hoti ",
      " santuṭṭho pavivitto asaṃsaṭṭho, vīriyasampattiyā āraddhavīriyo hoti attahitaparahitapaṭipattiyaṃ, satisampattiyā ",
      " upaṭṭhitassati hoti, samādhisampattiyā avikkhitto samāhitacitto, paññāsampattiyā aviparītaṃ pajānāti. So satiyā kusalākusalānaṃ dhammānaṃ gatiyo samannesamāno paññāya sattānaṃ hitāhitaṃ yathābhūtaṃ jānitvā samādhinā tattha ekaggacitto hutvā vīriyena satte ahitaṃ nisedhetvā hite niyojeti. Tena vuttaṃ ‘‘piyo…pe… niyojakoti evamādiguṇasamannāgata’’nti."
    ],
    "innerText": "Niccaṃ pariharitabbattāti sabbatthakakammaṭṭhānaṃ viya ekadāva ananuyuñjitvā sabbakālaṃ pariharaṇīyattā anuyuñjitabbattā. Evamādiguṇasamannāgatanti piyabhāvādīhi guṇehi sampannaṃ. Kalyāṇamitto hi saddhāsampanno hoti sīlasampanno sutasampanno cāgasampanno vīriyasampanno satisampanno samādhisampanno paññāsampanno. Tattha saddhāsampattiyā saddahati tathāgatassa bodhiṃ, kammaphalañca, tena sammāsambodhiyā hetubhūtaṃ sattesu hitesitaṃ na pariccajati. Sīlasampattiyā sattānaṃ piyo hoti garu bhāvanīyo codako pāpagarahī vattā vacanakkhamo, sutasampattiyā saccapaṭiccasamuppādādipaṭisaṃyuttānaṃ gambhīrānaṃ kathānaṃ kattā hoti, cāgasampattiyā appiccho hoti santuṭṭho pavivitto asaṃsaṭṭho, vīriyasampattiyā āraddhavīriyo hoti attahitaparahitapaṭipattiyaṃ, satisampattiyā upaṭṭhitassati hoti, samādhisampattiyā avikkhitto samāhitacitto, paññāsampattiyā aviparītaṃ pajānāti. So satiyā kusalākusalānaṃ dhammānaṃ gatiyo samannesamāno paññāya sattānaṃ hitāhitaṃ yathābhūtaṃ jānitvā samādhinā tattha ekaggacitto hutvā vīriyena satte ahitaṃ nisedhetvā hite niyojeti. Tena vuttaṃ ‘‘piyo…pe… niyojakoti evamādiguṇasamannāgata’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Taṃ pana kalyāṇamittaṃ paramukkaṃsagataṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘mamaṃ hī’’"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kārakabhāvaṃ"
      },
      " yogakammassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakāseti"
      },
      " attānaṃ paṭipattiyā amoghabhāvadassanena samuttejanāya, sampahaṃsanāya ca, nanu kathesi paveṇipālanatthanti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evarūpo"
      },
      "ti pesalo hutvā bahussuto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tantidharo"
      },
      "ti suttadharo tattha kehicipi asaṃhīro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaṃsānurakkhako"
      },
      "ti buddhānubuddhavaṃsassa anurakkhako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paveṇipālako"
      },
      "ti paveṇiyā ācariyuggahaṇassa anupālako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ācariyamatiko"
      },
      "ti ācariyamatiyaṃ niyutto tassā anativattanato. Na attanomatiṃ pakāseti kathetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na attanomatiko,"
      },
      " attano matiṃ paggayha vattā na hotīti attho."
    ],
    "innerText": "Taṃ pana kalyāṇamittaṃ paramukkaṃsagataṃ dassetuṃ ‘‘mamaṃ hī’’tiādi vuttaṃ. Kārakabhāvaṃ yogakammassa. Pakāseti attānaṃ paṭipattiyā amoghabhāvadassanena samuttejanāya, sampahaṃsanāya ca, nanu kathesi paveṇipālanatthanti adhippāyo. Evarūpoti pesalo hutvā bahussuto. Tantidharoti suttadharo tattha kehicipi asaṃhīro. Vaṃsānurakkhakoti buddhānubuddhavaṃsassa anurakkhako. Paveṇipālakoti paveṇiyā ācariyuggahaṇassa anupālako. Ācariyamatikoti ācariyamatiyaṃ niyutto tassā anativattanato. Na attanomatiṃ pakāseti kathetīti na attanomatiko, attano matiṃ paggayha vattā na hotīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pubbe vuttakhīṇāsavādayo’’tiādi ekaccakhīṇāsavato bahussutova kammaṭṭhānadāne seyyoti dassanatthaṃ āraddhaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pubbe vuttakhīṇāsavādayo"
      },
      "ti ‘‘yaṃ kammaṭṭhānaṃ gahetukāmo’’tiādinā vuttakhīṇāsavādikā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uggahaparipucchānaṃ visodhitattā"
      },
      "ti uggahetabbato ‘‘uggaho’’ti laddhanāmāya kammaṭṭhānupakārāya pāḷiyā, tadatthaṃ paripucchanato ‘‘paripucchā’’ti laddhasamaññāya atthasaṃvaṇṇanāya ca visesato sodhitattā niggumbaṃ nijjaṭaṃ katvā gahitattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ito cito ca suttañca kāraṇañca sallakkhetvā"
      },
      "ti pañcasupi nikāyesu ito cito ca tassa tassa kammaṭṭhānassa anurūpaṃ suttapadañceva suttānugataṃ yuttiñca suṭṭhu upalakkhetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sappāyāsappāyaṃ yojetvā"
      },
      "ti yassa kammaṭṭhānaṃ ācikkhati, tassa upakārānupakāraṃ yuttiṃ magganena yojetvā, samādāya vā sammadeva hadaye ṭhapetvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāmaggaṃ dassento"
      },
      "ti kammaṭṭhānavidhiṃ mahāmaggaṃ katvā dassento."
    ],
    "innerText": "‘‘Pubbe vuttakhīṇāsavādayo’’tiādi ekaccakhīṇāsavato bahussutova kammaṭṭhānadāne seyyoti dassanatthaṃ āraddhaṃ. Tattha pubbe vuttakhīṇāsavādayoti ‘‘yaṃ kammaṭṭhānaṃ gahetukāmo’’tiādinā vuttakhīṇāsavādikā. Uggahaparipucchānaṃ visodhitattāti uggahetabbato ‘‘uggaho’’ti laddhanāmāya kammaṭṭhānupakārāya pāḷiyā, tadatthaṃ paripucchanato ‘‘paripucchā’’ti laddhasamaññāya atthasaṃvaṇṇanāya ca visesato sodhitattā niggumbaṃ nijjaṭaṃ katvā gahitattā. Ito cito ca suttañca kāraṇañca sallakkhetvāti pañcasupi nikāyesu ito cito ca tassa tassa kammaṭṭhānassa anurūpaṃ suttapadañceva suttānugataṃ yuttiñca suṭṭhu upalakkhetvā. Sappāyāsappāyaṃ yojetvāti yassa kammaṭṭhānaṃ ācikkhati, tassa upakārānupakāraṃ yuttiṃ magganena yojetvā, samādāya vā sammadeva hadaye ṭhapetvāti attho. Mahāmaggaṃ dassentoti kammaṭṭhānavidhiṃ mahāmaggaṃ katvā dassento."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbatthā"
      },
      "ti ",
      " tattha tattha vihāre. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vattapaṭipattiṃ kurumānenā"
      },
      "ti paviṭṭhakāle āgantukavattaṃ, nikkhamanakāle gamikavattanti yathārahaṃ taṃ taṃ vattaṃ pūrentena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbapārihāriyatela"
      },
      "nti sabbesaṃ aṅgānaṃ ",
      ", sabbesaṃ vā bhikkhūnaṃ atthāya pariharitabbatelaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhapemī"
      },
      "ti anujānāpanaṃ. Yaṃ taṃ sammāvattaṃ paññattanti sambandho. Ekadivasaṃ sāyaṃ vissajjitenāpīti yojanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārocetabbaṃ āgamanakāraṇaṃ. Sappāyavelā"
      },
      " sarīracittānaṃ kallasamayo."
    ],
    "innerText": "Sabbatthāti tattha tattha vihāre. Vattapaṭipattiṃ kurumānenāti paviṭṭhakāle āgantukavattaṃ, nikkhamanakāle gamikavattanti yathārahaṃ taṃ taṃ vattaṃ pūrentena. Sabbapārihāriyatelanti sabbesaṃ aṅgānaṃ , sabbesaṃ vā bhikkhūnaṃ atthāya pariharitabbatelaṃ. Ṭhapemīti anujānāpanaṃ. Yaṃ taṃ sammāvattaṃ paññattanti sambandho. Ekadivasaṃ sāyaṃ vissajjitenāpīti yojanā. Ārocetabbaṃ āgamanakāraṇaṃ. Sappāyavelā sarīracittānaṃ kallasamayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Cariyāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "43"
      },
      ". Santāne rāgassa ussannabhāvena caraṇaṃ pavatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rāgacariyā,"
      },
      " sā sassatāsayādayo viya daṭṭhabbā. Tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dosacariyā"
      },
      "dayo. Saṃsaggo sampayogārahavasena veditabbo, yathā ‘‘rāgamohacariyā dosamohacariyā’’tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sannipāto"
      },
      " ekasantatipariyāpannatāvasena, yathā ‘‘rāgadosacariyā rāgadosamohacariyā’’tiādi. Imā eva hi sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘aparāpi catasso’’"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathā"
      },
      "ti yathā rāgādīnaṃ, tathā saddhādīnaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃsaggasannipātavasena"
      },
      " saddhābuddhicariyā saddhāvitakkacariyā buddhivitakkacariyā saddhābuddhivitakkacariyāti. Imā aparāpi catasso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eva"
      },
      "nti saṃsaggasannipātavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃsagga"
      },
      "nti saṃsajjanaṃ missīkaraṇaṃ ‘‘rāgasaddhācariyā dosasaddhācariyā’’tiādinā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anekā"
      },
      "ti tesaṭṭhi, tato atirekāpi vā, tā pana asammohantena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃyuttasuttaṭīkāyaṃ"
      },
      " vitthārato dassitāti tattha vuttanayena veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Pakatī’’"
      },
      "ti iminā asati paṭipakkhabhāvanāyaṃ tattha tattha santāne cariyāya sabhāvabhūtataṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ussannatā"
      },
      " aññadhammehi rāgādīnaṃ adhikatā, yato rāgacariyādīnaṃ paccayasamavāye rāgādayo balavanto honti, abhiṇhañca pavattanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāsaṃ vasenā"
      },
      "ti channaṃ mūlacariyānaṃ vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chaḷeva puggalā honti"
      },
      ". Aññathā anekapuggalā siyuṃ, tathā ca sati adhippetatthasiddhi ca na siyāti adhippāyo."
    ],
    "innerText": "43. Santāne rāgassa ussannabhāvena caraṇaṃ pavatti rāgacariyā, sā sassatāsayādayo viya daṭṭhabbā. Tathā dosacariyādayo. Saṃsaggo sampayogārahavasena veditabbo, yathā ‘‘rāgamohacariyā dosamohacariyā’’tiādi. Sannipāto ekasantatipariyāpannatāvasena, yathā ‘‘rāgadosacariyā rāgadosamohacariyā’’tiādi. Imā eva hi sandhāya ‘‘aparāpi catasso’’ti vuttaṃ. Tathāti yathā rāgādīnaṃ, tathā saddhādīnaṃ saṃsaggasannipātavasena saddhābuddhicariyā saddhāvitakkacariyā buddhivitakkacariyā saddhābuddhivitakkacariyāti. Imā aparāpi catasso. Evanti saṃsaggasannipātavasena. Saṃsagganti saṃsajjanaṃ missīkaraṇaṃ ‘‘rāgasaddhācariyā dosasaddhācariyā’’tiādinā. Anekāti tesaṭṭhi, tato atirekāpi vā, tā pana asammohantena saṃyuttasuttaṭīkāyaṃ vitthārato dassitāti tattha vuttanayena veditabbā. ‘‘Pakatī’’ti iminā asati paṭipakkhabhāvanāyaṃ tattha tattha santāne cariyāya sabhāvabhūtataṃ dasseti. Ussannatā aññadhammehi rāgādīnaṃ adhikatā, yato rāgacariyādīnaṃ paccayasamavāye rāgādayo balavanto honti, abhiṇhañca pavattanti. Tāsaṃ vasenāti channaṃ mūlacariyānaṃ vasena chaḷeva puggalā honti. Aññathā anekapuggalā siyuṃ, tathā ca sati adhippetatthasiddhi ca na siyāti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhā balavatī hoti"
      },
      " rāgussanne santāne tadanuguṇassa dhammassa niyogato adhikabhāvasambhavato. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘rāgassa āsannaguṇattā’’"
      },
      "ti, sinehapariyesanāpariccajanehi sabhāgadhammattāti attho. Sabhāgo hi dūrepi āsanneyevāti sabhāgatālakkhaṇamidha āsannaggahaṇaṃ. Tattha saddhāya siniyhanaṃ pasādavasena akālussiyaṃ alūkhatā ",
      ", rāgassa pana rañjanavasena. Saddhāya pariyesanaṃ adhimuccanavasena tanninnatā, rāgassa taṇhāyanavasena. Saddhāya apariccajanaṃ okappanavasena anupakkhandanaṃ, rāgassa abhisaṅgavasenāti evaṃ bhinnasabhāvānampi ",
      " tesaṃ yathā alūkhatādisāmaññena sabhāgatā, evaṃ taṃsamaṅgīnampi puggalānanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘rāgacaritassa saddhācarito sabhāgo’’"
      },
      "ti."
    ],
    "innerText": "Saddhā balavatī hoti rāgussanne santāne tadanuguṇassa dhammassa niyogato adhikabhāvasambhavato. Tenāha ‘‘rāgassa āsannaguṇattā’’ti, sinehapariyesanāpariccajanehi sabhāgadhammattāti attho. Sabhāgo hi dūrepi āsanneyevāti sabhāgatālakkhaṇamidha āsannaggahaṇaṃ. Tattha saddhāya siniyhanaṃ pasādavasena akālussiyaṃ alūkhatā , rāgassa pana rañjanavasena. Saddhāya pariyesanaṃ adhimuccanavasena tanninnatā, rāgassa taṇhāyanavasena. Saddhāya apariccajanaṃ okappanavasena anupakkhandanaṃ, rāgassa abhisaṅgavasenāti evaṃ bhinnasabhāvānampi tesaṃ yathā alūkhatādisāmaññena sabhāgatā, evaṃ taṃsamaṅgīnampi puggalānanti āha ‘‘rāgacaritassa saddhācarito sabhāgo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññā balavatī hoti"
      },
      " dosussanne santāne tadanuguṇassa dhammassa niyogato adhikabhāvasambhavato. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dosassa āsannaguṇattā’’"
      },
      "ti, anallīyanapariyesanaparivajjanehi sabhāgadhammattāti attho. Tattha paññāya ārammaṇassa anallīyanaṃ tassa yathāsabhāvāvabodhavasena visaṃsaṭṭhatā, dosassa pana byāpajjanavasena. Paññāya pariyesanaṃ yathābhūtadosapavicayo, dosassa abhūtadosanijigīsā. Paññāya parivajjanaṃ nibbindanādivasena ñāṇutrāso, dosassa ahitādhānavasena chaḍḍananti evaṃ bhinnasabhāvānampi tesaṃ yathā anallīyanādisāmaññena sabhāgatā, evaṃ taṃsamaṅgīnampi puggalānanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dosacaritassa buddhicarito sabhāgo’’"
      },
      "ti."
    ],
    "innerText": "Paññā balavatī hoti dosussanne santāne tadanuguṇassa dhammassa niyogato adhikabhāvasambhavato. Tenāha ‘‘dosassa āsannaguṇattā’’ti, anallīyanapariyesanaparivajjanehi sabhāgadhammattāti attho. Tattha paññāya ārammaṇassa anallīyanaṃ tassa yathāsabhāvāvabodhavasena visaṃsaṭṭhatā, dosassa pana byāpajjanavasena. Paññāya pariyesanaṃ yathābhūtadosapavicayo, dosassa abhūtadosanijigīsā. Paññāya parivajjanaṃ nibbindanādivasena ñāṇutrāso, dosassa ahitādhānavasena chaḍḍananti evaṃ bhinnasabhāvānampi tesaṃ yathā anallīyanādisāmaññena sabhāgatā, evaṃ taṃsamaṅgīnampi puggalānanti āha ‘‘dosacaritassa buddhicarito sabhāgo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antarāyakarā vitakkā"
      },
      "ti micchāvitakkā micchāsaṅkappā uppajjanti mohussanne santāne tadanuguṇassa dhammassa yebhuyyena pavattisabbhāvato. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘mohassa āsannalakkhaṇattā’’"
      },
      "ti, anavaṭṭhānacañcalabhāvehi sabhāgadhammattāti attho. Tattha vitakkassa anavaṭṭhānaṃ parikappavasena savipphāratāya, mohassa sammūḷhatāvasena byākulatāya. Tathā vitakkassa lahuparivitakkanena tadaṅgacalatāya cañcalatā, mohassa anogāḷhatāyāti evaṃ bhinnasabhāvānampi tesaṃ yathā anavaṭṭhānādisāmaññena sabhāgatā, evaṃ taṃsamaṅgīnampi puggalānanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘mohacaritassa vitakkacarito sabhāgo’’"
      },
      "ti."
    ],
    "innerText": "Antarāyakarā vitakkāti micchāvitakkā micchāsaṅkappā uppajjanti mohussanne santāne tadanuguṇassa dhammassa yebhuyyena pavattisabbhāvato. Tenāha ‘‘mohassa āsannalakkhaṇattā’’ti, anavaṭṭhānacañcalabhāvehi sabhāgadhammattāti attho. Tattha vitakkassa anavaṭṭhānaṃ parikappavasena savipphāratāya, mohassa sammūḷhatāvasena byākulatāya. Tathā vitakkassa lahuparivitakkanena tadaṅgacalatāya cañcalatā, mohassa anogāḷhatāyāti evaṃ bhinnasabhāvānampi tesaṃ yathā anavaṭṭhānādisāmaññena sabhāgatā, evaṃ taṃsamaṅgīnampi puggalānanti āha ‘‘mohacaritassa vitakkacarito sabhāgo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhā rāgoyeva"
      },
      " sabhāvato, tasmā rāgacariyāvinimuttā taṇhācariyā natthīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃsampayutto"
      },
      "ti tena rāgena sampayutto, dosādayo viya tena vippayutto natthīti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadubhaya"
      },
      "nti taṇhāmānadvayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nātivattatī"
      },
      "ti sabhāvato, sampayogavasena ca na atikkamitvā vaṭṭati. Kāmañcettha yathā rāgadosehi sampayogavasena saha ",
      " vattamānassapi mohassa ussannatāvasena visuṃ cariyābhāvo, na kevalaṃ mohasseva, tathā saddhābuddhivitakkānaṃ. Evaṃ rāgena satipi sampayoge mānassāpi visuṃ cariyābhāvo yutto siyā, evaṃ santepi rāgapaṭighamānadiṭṭhivicikicchāvijjānaṃ viya anusayaṭṭho imesaṃ rāgādīnaṃyeva āveṇiko cariyaṭṭhoti, nattheva mānacariyā. Yato cariyā ‘‘pakatī’’ti vuttā. Pakati ca sabhāvoti. Eteneva diṭṭhiyāpi visuṃ cariyābhāvābhāvo saṃvaṇṇitoti daṭṭhabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhakathāyaṃ"
      },
      " pana mohacariyantogadhāva ",
      " diṭṭhicariyāti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘mohanidānattā cā’’"
      },
      "tiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca"
      },
      "-saddena sampayogaṃ samuccinoti mohanidānattā, mohasampayuttattā cāti."
    ],
    "innerText": "Taṇhā rāgoyeva sabhāvato, tasmā rāgacariyāvinimuttā taṇhācariyā natthīti attho. Taṃsampayuttoti tena rāgena sampayutto, dosādayo viya tena vippayutto natthīti adhippāyo. Tadubhayanti taṇhāmānadvayaṃ. Nātivattatīti sabhāvato, sampayogavasena ca na atikkamitvā vaṭṭati. Kāmañcettha yathā rāgadosehi sampayogavasena saha vattamānassapi mohassa ussannatāvasena visuṃ cariyābhāvo, na kevalaṃ mohasseva, tathā saddhābuddhivitakkānaṃ. Evaṃ rāgena satipi sampayoge mānassāpi visuṃ cariyābhāvo yutto siyā, evaṃ santepi rāgapaṭighamānadiṭṭhivicikicchāvijjānaṃ viya anusayaṭṭho imesaṃ rāgādīnaṃyeva āveṇiko cariyaṭṭhoti, nattheva mānacariyā. Yato cariyā ‘‘pakatī’’ti vuttā. Pakati ca sabhāvoti. Eteneva diṭṭhiyāpi visuṃ cariyābhāvābhāvo saṃvaṇṇitoti daṭṭhabbo. Aṭṭhakathāyaṃ pana mohacariyantogadhāva diṭṭhicariyāti dassetuṃ ‘‘mohanidānattā cā’’tiādi vuttaṃ. Tattha ca-saddena sampayogaṃ samuccinoti mohanidānattā, mohasampayuttattā cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiṃ sappāya"
      },
      "nti kīdisaṃ senāsanādisappāyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbāciṇṇaṃ"
      },
      " purimajātīsu ācaritaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekacce"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upatissattheraṃ"
      },
      " sandhāyāha. Tena hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimuttimagge"
      },
      " tathā vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbe kirā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kira"
      },
      "-saddo arucisūcanattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iṭṭhappayogo"
      },
      " manāpakiriyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Subhakammabahulo"
      },
      " yebhuyyena sobhanakammakārī. Na sabbe rāgacaritā eva honti, aluddhānampi pubbe iṭṭhappayogasubhakammabahulatāsambhavato, saggā cavitvā idhūpapattisambhavato ca. Etena asati pubbahetuniyāme yathāvuttakāraṇamattena na tesaṃ luddhatā, luddhabhāvahetukā ca rāgacariyāti imamatthaṃ dasseti."
    ],
    "innerText": "44.Kiṃ sappāyanti kīdisaṃ senāsanādisappāyaṃ. Pubbāciṇṇaṃ purimajātīsu ācaritaṃ. Ekacceti upatissattheraṃ sandhāyāha. Tena hi vimuttimagge tathā vuttaṃ. Pubbe kirāti kira-saddo arucisūcanattho. Iṭṭhappayogo manāpakiriyā. Subhakammabahulo yebhuyyena sobhanakammakārī. Na sabbe rāgacaritā eva honti, aluddhānampi pubbe iṭṭhappayogasubhakammabahulatāsambhavato, saggā cavitvā idhūpapattisambhavato ca. Etena asati pubbahetuniyāme yathāvuttakāraṇamattena na tesaṃ luddhatā, luddhabhāvahetukā ca rāgacariyāti imamatthaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itare"
      },
      "ti chedanādikammabahulā nirayādito idhūpapannā ca na sabbe dosamohacaritā eva hontīti yojanā. Idhāpi yathāvuttakāraṇassa kodhanabhāve, mūḷhabhāve ca anekantikattā dosamohacaritatāyapi anekaṃsikatā veditabbā. Dhātūnaṃ ussadaniyamo yadi pamāṇato, so natthi, atha sāmatthiyato, sopi ekaṃsiko na upalabbhatīti dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yathāvutteneva nayena ussadaniyamo nāma natthī’’"
      },
      "ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathāvuttenevā"
      },
      "ti ‘‘dvinnaṃ pana dhātūna’’ntiādinā vuttappakāreneva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dosaniyame"
      },
      "ti semhādidosādhikatāya rāgādicarito hotīti dosavasena cariyāniyame ‘‘semhādhiko rāgacarito’’ti vatvā puna ‘‘semhādhiko mohacarito’’ti, ‘‘vātādhiko mohacarito’’ti vatvā puna ‘‘vātādhiko rāgacarito’’ti ca vuttattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tampi"
      },
      " dosavasena niyamavacanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pubbāparaviruddhameva"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aparicchinnavacana"
      },
      "nti ",
      " paricchedakārikāya paññāya na paricchinditvā vuttavacanaṃ, anupaparikkhitavacananti attho."
    ],
    "innerText": "Itareti chedanādikammabahulā nirayādito idhūpapannā ca na sabbe dosamohacaritā eva hontīti yojanā. Idhāpi yathāvuttakāraṇassa kodhanabhāve, mūḷhabhāve ca anekantikattā dosamohacaritatāyapi anekaṃsikatā veditabbā. Dhātūnaṃ ussadaniyamo yadi pamāṇato, so natthi, atha sāmatthiyato, sopi ekaṃsiko na upalabbhatīti dassento āha ‘‘yathāvutteneva nayena ussadaniyamo nāma natthī’’ti. Tattha yathāvuttenevāti ‘‘dvinnaṃ pana dhātūna’’ntiādinā vuttappakāreneva. Dosaniyameti semhādidosādhikatāya rāgādicarito hotīti dosavasena cariyāniyame ‘‘semhādhiko rāgacarito’’ti vatvā puna ‘‘semhādhiko mohacarito’’ti, ‘‘vātādhiko mohacarito’’ti vatvā puna ‘‘vātādhiko rāgacarito’’ti ca vuttattā tampi dosavasena niyamavacanaṃ pubbāparaviruddhameva. Aparicchinnavacananti paricchedakārikāya paññāya na paricchinditvā vuttavacanaṃ, anupaparikkhitavacananti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ussadakittane"
      },
      "ti vipākakathāyaṃ gahitaussadakittane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbahetuniyāmenā"
      },
      "ti purimabhave pavattalobhādihetuniyāmena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niyāmo"
      },
      "ti ca tesaṃyeva lobhādīnaṃ paṭiniyato lubbhanādisabhāvo daṭṭhabbo. Lobho ussado etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lobhussadā,"
      },
      " ussannalobhā, lobhādhikāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amohussadā cā"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca"
      },
      "-saddo sampiṇḍanattho. Tena ye ime lobhussadatādīnaṃ paccekaṃ vomissato ca cuddasa pabhedā icchitā, te anavasesato sampiṇḍeti yathāvuttesu chasveva tesaṃ antogadhattā. Phalabhūtā cettha lobhussadatādayo daṭṭhabbā."
    ],
    "innerText": "Ussadakittaneti vipākakathāyaṃ gahitaussadakittane. Pubbahetuniyāmenāti purimabhave pavattalobhādihetuniyāmena. Niyāmoti ca tesaṃyeva lobhādīnaṃ paṭiniyato lubbhanādisabhāvo daṭṭhabbo. Lobho ussado etesanti lobhussadā, ussannalobhā, lobhādhikāti attho. Amohussadā cāti ettha ca-saddo sampiṇḍanattho. Tena ye ime lobhussadatādīnaṃ paccekaṃ vomissato ca cuddasa pabhedā icchitā, te anavasesato sampiṇḍeti yathāvuttesu chasveva tesaṃ antogadhattā. Phalabhūtā cettha lobhussadatādayo daṭṭhabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " taṃ nesaṃ lobhussadatādīnaṃ paccekaṃ vomissakatādiṃ vibhāgena dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yassa hī’’"
      },
      "tiādi āraddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammāyūhanakkhaṇe"
      },
      "ti kammakaraṇavelāyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lobho balavā"
      },
      "ti lobho tajjāya paccayasāmaggiyā sāmatthiyato adhiko hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alobho mando"
      },
      "ti tappaṭipakkho alobho dubbalo. Kathaṃ panete lobhālobhā aññamaññaṃ ujuvipaccanīkabhūtā ekakkhaṇe pavattantīti? Na kho panetaṃ evaṃ daṭṭhabbaṃ ‘‘ekakkhaṇe pavattantī’’ti. Nikantikkhaṇaṃ pana āyūhanapakkhiyameva katvā evaṃ vuttaṃ. Eseva nayo sesesupi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyādātu"
      },
      "nti abhibhavituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na sakkoti"
      },
      ". Yo hi ‘‘evaṃsundaraṃ evaṃvipulaṃ evaṃmahagghañca na sakkā dātu’’ntiādinā amuttacāgatādivasena pavattāya cetanāya sampayutto alobho, so sammadeva lobhaṃ pariyādātuṃ na sakkoti. Dosamohānaṃ anuppattiyā, tādisapaccayalābhena ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adosāmohā balavanto. Tasmā"
      },
      "ti lobhādosāmohānaṃ balavabhāvato, alobhadosamohānañca dubbalabhāvatoti vuttameva kāraṇaṃ paccāmasati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So"
      },
      "ti taṃsamaṅgīpuggalo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena kammenā"
      },
      "ti tena lobhādiupanissayavatā kusalakammunā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhasīlo"
      },
      "ti sakhilo. Tamevatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘akkodhano’’"
      },
      "ti pariyāyena vadati."
    ],
    "innerText": "Idāni taṃ nesaṃ lobhussadatādīnaṃ paccekaṃ vomissakatādiṃ vibhāgena dassetuṃ ‘‘yassa hī’’tiādi āraddhaṃ. Kammāyūhanakkhaṇeti kammakaraṇavelāyaṃ. Lobho balavāti lobho tajjāya paccayasāmaggiyā sāmatthiyato adhiko hoti. Alobho mandoti tappaṭipakkho alobho dubbalo. Kathaṃ panete lobhālobhā aññamaññaṃ ujuvipaccanīkabhūtā ekakkhaṇe pavattantīti? Na kho panetaṃ evaṃ daṭṭhabbaṃ ‘‘ekakkhaṇe pavattantī’’ti. Nikantikkhaṇaṃ pana āyūhanapakkhiyameva katvā evaṃ vuttaṃ. Eseva nayo sesesupi. Pariyādātunti abhibhavituṃ na sakkoti. Yo hi ‘‘evaṃsundaraṃ evaṃvipulaṃ evaṃmahagghañca na sakkā dātu’’ntiādinā amuttacāgatādivasena pavattāya cetanāya sampayutto alobho, so sammadeva lobhaṃ pariyādātuṃ na sakkoti. Dosamohānaṃ anuppattiyā, tādisapaccayalābhena ca adosāmohā balavanto. Tasmāti lobhādosāmohānaṃ balavabhāvato, alobhadosamohānañca dubbalabhāvatoti vuttameva kāraṇaṃ paccāmasati. Soti taṃsamaṅgīpuggalo. Tena kammenāti tena lobhādiupanissayavatā kusalakammunā. Sukhasīloti sakhilo. Tamevatthaṃ ‘‘akkodhano’’ti pariyāyena vadati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purimanayenevā"
      },
      "ti pubbe vuttanayānusārena mandā alobhādosā lobhadose pariyādātuṃ na sakkonti, amoho pana balavā mohaṃ pariyādātuṃ sakkotīti evaṃ tattha tattha vāre yathārahaṃ atidesattho ",
      " veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duṭṭho"
      },
      "ti kodhano. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dandho"
      },
      "ti mandapañño. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlako"
      },
      "ti sukhasīlo."
    ],
    "innerText": "Purimanayenevāti pubbe vuttanayānusārena mandā alobhādosā lobhadose pariyādātuṃ na sakkonti, amoho pana balavā mohaṃ pariyādātuṃ sakkotīti evaṃ tattha tattha vāre yathārahaṃ atidesattho veditabbo. Duṭṭhoti kodhano. Dandhoti mandapañño. Sīlakoti sukhasīlo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca lobhavasena, dosamohalobhadosalobhamohadosamohalobhadosamohavasenāti tayo ekakā, tayo dukā, eko tikoti lobhādiussadavasena akusalapakkheyeva satta vārā, tathā kusalapakkhe alobhādiussadavasenāti cuddasa vārā labbhanti. Tattha alobhadosāmohā, alobhādosamohā, alobhadosamohā balavantoti āgatehi kusalapakkhe tatiyadutiyapaṭhamavārehi dosussadamohussadadosamohussadavārā gahitā eva honti, tathā akusalapakkhe lobhādosamohā, lobhadosāmohā, lobhādosāmohā balavantoti āgatehi tatiyadutiyapaṭhamavārehi adosussadaamohussadaadosāmohussadavārā gahitā evāti akusalakusalapakkhesu tayo tayo vāre antogadhe katvā aṭṭheva vārā dassitā. Ye pana ubhayesaṃ missatāvasena lobhālobhussadavārādayo apare ekūnapaññāsa vārā dassetabbā, te alabbhanato eva na dassitā. Na hi ekasmiṃ santāne antarena avatthantaraṃ ‘‘lobho ca balavā, alobho cā’’tiādi yujjatīti, paṭipakkhavasena vā hi etesaṃ balavadubbalabhāvo, sahajātadhammavasena ",
      " vā. Tattha lobhassa tāva paṭipakkhavasena alobhena anadhibhūtatāya balavabhāvo, tathā dosamohānaṃ adosāmohehi. Alobhādīnaṃ pana lobhādiabhibhavanato, sabbesañca samānajātiyamabhibhuyya pavattivasena sahajātadhammato balavabhāvo. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathāyaṃ"
      },
      " ‘‘lobho balavā alobho mando, adosāmohā balavanto dosamohā mandā’’ti. So ca nesaṃ mandabalavabhāvo purimūpanissayato tathā āsayassa paribhāvitatāya veditabbo."
    ],
    "innerText": "Ettha ca lobhavasena, dosamohalobhadosalobhamohadosamohalobhadosamohavasenāti tayo ekakā, tayo dukā, eko tikoti lobhādiussadavasena akusalapakkheyeva satta vārā, tathā kusalapakkhe alobhādiussadavasenāti cuddasa vārā labbhanti. Tattha alobhadosāmohā, alobhādosamohā, alobhadosamohā balavantoti āgatehi kusalapakkhe tatiyadutiyapaṭhamavārehi dosussadamohussadadosamohussadavārā gahitā eva honti, tathā akusalapakkhe lobhādosamohā, lobhadosāmohā, lobhādosāmohā balavantoti āgatehi tatiyadutiyapaṭhamavārehi adosussadaamohussadaadosāmohussadavārā gahitā evāti akusalakusalapakkhesu tayo tayo vāre antogadhe katvā aṭṭheva vārā dassitā. Ye pana ubhayesaṃ missatāvasena lobhālobhussadavārādayo apare ekūnapaññāsa vārā dassetabbā, te alabbhanato eva na dassitā. Na hi ekasmiṃ santāne antarena avatthantaraṃ ‘‘lobho ca balavā, alobho cā’’tiādi yujjatīti, paṭipakkhavasena vā hi etesaṃ balavadubbalabhāvo, sahajātadhammavasena vā. Tattha lobhassa tāva paṭipakkhavasena alobhena anadhibhūtatāya balavabhāvo, tathā dosamohānaṃ adosāmohehi. Alobhādīnaṃ pana lobhādiabhibhavanato, sabbesañca samānajātiyamabhibhuyya pavattivasena sahajātadhammato balavabhāvo. Tena vuttaṃ aṭṭhakathāyaṃ ‘‘lobho balavā alobho mando, adosāmohā balavanto dosamohā mandā’’ti. So ca nesaṃ mandabalavabhāvo purimūpanissayato tathā āsayassa paribhāvitatāya veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo luddhoti vutto"
      },
      "ti yo ussadakittane ‘‘luddho’’ti vutto, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ayaṃ"
      },
      " idha cariyāvicāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘rāgacarito’’"
      },
      "ti veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duṭṭhadandhā"
      },
      "ti ‘‘duṭṭho, dandho’’ti ca vuttā yathākkamaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dosamohacaritā. Paññavā"
      },
      "ti sātisayaṃ sappañño. Yato saddhāvitakkesu vijjamānesupi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddhicarito"
      },
      "ti vuccati. Alobhādosānaṃ ",
      " balavabhāvo saddhūpanissayatāya vinā na hotīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘aluddhaaduṭṭhā pasannapakatitāya saddhācaritā’’"
      },
      "ti."
    ],
    "innerText": "Yo luddhoti vuttoti yo ussadakittane ‘‘luddho’’ti vutto, ayaṃ idha cariyāvicāre ‘‘rāgacarito’’ti veditabbo. Duṭṭhadandhāti ‘‘duṭṭho, dandho’’ti ca vuttā yathākkamaṃ dosamohacaritā. Paññavāti sātisayaṃ sappañño. Yato saddhāvitakkesu vijjamānesupi buddhicaritoti vuccati. Alobhādosānaṃ balavabhāvo saddhūpanissayatāya vinā na hotīti āha ‘‘aluddhaaduṭṭhā pasannapakatitāya saddhācaritā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayañca nayo sādhāraṇato vuttoti nibbattitapubbahetuniyāmavaseneva buddhicaritādikepi dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yathā vā’’"
      },
      "tiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "amohaparivārenā"
      },
      "ti amohaparikkhittena, upanissayato sampayogato ca paññāya abhisaṅkhatenāti attho. Sesapadattayepi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lobhādinā vomissaparivārenā"
      },
      "ti ettha lobhamohādinā aññamaññaaviruddhavomissaparivārenāti attho. Avirodho ca yugaggāhavasena appavattiyā veditabbo. Tathā hi saddhānusāridhammānusārigottāni aññamaññampi bhinnasabhāvāneva. Ekaṃsena ca missakacariyāpi sampaṭicchitabbā pubbahetuniyāmena cariyāsiddhito. Tathā ceva ussadakittanaṃ pavattaṃ yathārahaṃ lobhālobhādīnaṃ vipākassa paccayabhāvato. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisambhidāmagge"
      },
      " (paṭi. ma. 1.232) –"
    ],
    "innerText": "Ayañca nayo sādhāraṇato vuttoti nibbattitapubbahetuniyāmavaseneva buddhicaritādikepi dassetuṃ ‘‘yathā vā’’tiādi vuttaṃ. Tattha amohaparivārenāti amohaparikkhittena, upanissayato sampayogato ca paññāya abhisaṅkhatenāti attho. Sesapadattayepi eseva nayo. Lobhādinā vomissaparivārenāti ettha lobhamohādinā aññamaññaaviruddhavomissaparivārenāti attho. Avirodho ca yugaggāhavasena appavattiyā veditabbo. Tathā hi saddhānusāridhammānusārigottāni aññamaññampi bhinnasabhāvāneva. Ekaṃsena ca missakacariyāpi sampaṭicchitabbā pubbahetuniyāmena cariyāsiddhito. Tathā ceva ussadakittanaṃ pavattaṃ yathārahaṃ lobhālobhādīnaṃ vipākassa paccayabhāvato. Tenāha paṭisambhidāmagge (paṭi. ma. 1.232) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Gatisampattiyā ñāṇasampayutte katamesaṃ aṭṭhannaṃ hetūnaṃ paccayā upapatti hoti? Kusalakammassa javanakkhaṇe tayo hetū kusalā tasmiṃ khaṇe jātacetanāya sahajātapaccayā honti, tena vuccati kusalamūlapaccayāpi saṅkhārā. Nikantikkhaṇe dve hetū akusalā tasmiṃ khaṇe jātacetanāya sahajātapaccayā honti, tena vuccati akusalamūlapaccayāpi saṅkhārā. Paṭisandhikkhaṇe tayo hetū abyākatā tasmiṃ khaṇe jātacetanāya sahajātapaccayā honti, tena vuccati nāmarūpapaccayāpi viññāṇaṃ, viññāṇapaccayāpi nāmarūpa’’nti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Ādi ",
      ". Pubbahetuniyāmena ca yathā tihetukassa paññāveyyattiyaṃ, na tathā duhetukassa. Yathā ca duhetukassa itikattabbatā nepakkaṃ, na tathā ahetukassa. Evaṃ lobhussadādayo puggalā rāgacaritādayo hontīti niṭṭhamettha gantabbanti. Yathāvuttamatthaṃ nigamavasena dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evaṃ lobhādīsū’’"
      },
      "tiādi vuttaṃ."
    ],
    "innerText": "Ādi . Pubbahetuniyāmena ca yathā tihetukassa paññāveyyattiyaṃ, na tathā duhetukassa. Yathā ca duhetukassa itikattabbatā nepakkaṃ, na tathā ahetukassa. Evaṃ lobhussadādayo puggalā rāgacaritādayo hontīti niṭṭhamettha gantabbanti. Yathāvuttamatthaṃ nigamavasena dassetuṃ ‘‘evaṃ lobhādīsū’’tiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "45"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatrā"
      },
      "ti ",
      " tasmiṃ pucchāvacane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nayo"
      },
      "ti jānananayo. Puggalādhiṭṭhānena vuttopi attho dhammamukheneva paññāyatīti dhammādhiṭṭhānenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cariyāyo vibhāvaye’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakatigamanenā"
      },
      "ti akittimena sabhāvagamanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cāturiyenā"
      },
      "ti cāturabhāvena siṅgārena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ukkuṭika"
      },
      "nti asamphuṭṭhamajjhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khaṇanto viyā"
      },
      "ti bhūmiṃ khaṇanto viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anukaḍḍhita"
      },
      "nti pādanikkhepasamaye kaḍḍhanto viya pādaṃ nikkhipati. Tenassa padaṃ anukaḍḍhitaṃ pacchato añchitaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paribyākulāyā"
      },
      "ti parito āluḷitāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chambhito viyā"
      },
      "ti vitthāyanto viya. Bhīto viyāti keci. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahasānupīḷita"
      },
      "nti aggapādena, paṇhiyā ca sahasāva sannirujjhitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivaṭṭacchadassā"
      },
      "ti vinivaṭṭacchadanassa pahīnakilesassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idamīdisaṃ pada"
      },
      "nti bhagavato padaṃ disvā vadati."
    ],
    "innerText": "45.Tatrāti tasmiṃ pucchāvacane. Nayoti jānananayo. Puggalādhiṭṭhānena vuttopi attho dhammamukheneva paññāyatīti dhammādhiṭṭhānenāha ‘‘cariyāyo vibhāvaye’’ti. Pakatigamanenāti akittimena sabhāvagamanena. Cāturiyenāti cāturabhāvena siṅgārena. Ukkuṭikanti asamphuṭṭhamajjhaṃ. Khaṇanto viyāti bhūmiṃ khaṇanto viya. Anukaḍḍhitanti pādanikkhepasamaye kaḍḍhanto viya pādaṃ nikkhipati. Tenassa padaṃ anukaḍḍhitaṃ pacchato añchitaṃ hoti. Paribyākulāyāti parito āluḷitāya. Chambhito viyāti vitthāyanto viya. Bhīto viyāti keci. Sahasānupīḷitanti aggapādena, paṇhiyā ca sahasāva sannirujjhitaṃ. Vivaṭṭacchadassāti vinivaṭṭacchadanassa pahīnakilesassa. Idamīdisaṃ padanti bhagavato padaṃ disvā vadati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāsādika"
      },
      "nti pasādāvahaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Madhurākāra"
      },
      "nti iṭṭhākāraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thaddhākāra"
      },
      "nti thambhitākāraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ataramāno"
      },
      "ti nataramāno, saṇikanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samodhāyā"
      },
      "ti sammadeva odhāya avikkhipitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nipajjitvā"
      },
      "ti kāyapasāraṇalakkhaṇāya nipajjāya seyyāya nipajjitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sayati"
      },
      " niddāyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakkhittakāyo"
      },
      "ti avakkhittakāyo avaso viya sahasā patitakāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dussaṇṭhāna"
      },
      "nti virūpasannivesaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vikkhittakāyo"
      },
      "ti ito cito ca khittaaṅgapaccaṅgo."
    ],
    "innerText": "Pāsādikanti pasādāvahaṃ. Madhurākāranti iṭṭhākāraṃ. Thaddhākāranti thambhitākāraṃ. Ataramānoti nataramāno, saṇikanti attho. Samodhāyāti sammadeva odhāya avikkhipitvā. Nipajjitvāti kāyapasāraṇalakkhaṇāya nipajjāya seyyāya nipajjitvā sayati niddāyati. Pakkhittakāyoti avakkhittakāyo avaso viya sahasā patitakāyo. Dussaṇṭhānanti virūpasannivesaṃ. Vikkhittakāyoti ito cito ca khittaaṅgapaccaṅgo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samparivattaka"
      },
      "nti samparivattitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āloḷayamāno"
      },
      " vālikākacavarāni ākulayanto."
    ],
    "innerText": "Samparivattakanti samparivattitvā. Āloḷayamāno vālikākacavarāni ākulayanto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nipuṇamadhurasamasakkaccakārī"
      },
      "ti sukosallaṃ sundaraṃ avisamaṃ sābhisaṅkhārañca karaṇasīlo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gāḷhathaddhavisamakārī"
      },
      "ti thiraṃ asithilaṃ visamañca karaṇasīlo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aparicchinnaṃ"
      },
      " apariniṭṭhitaṃ."
    ],
    "innerText": "Nipuṇamadhurasamasakkaccakārīti sukosallaṃ sundaraṃ avisamaṃ sābhisaṅkhārañca karaṇasīlo. Gāḷhathaddhavisamakārīti thiraṃ asithilaṃ visamañca karaṇasīlo. Aparicchinnaṃ apariniṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mukhapūraka"
      },
      "nti mukhassa pūraṇaṃ mahantaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arasapaṭisaṃvedī"
      },
      "ti narasapaṭisaṃvedī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhājane chaḍḍento"
      },
      "ti bhojanabhājane sitthāni chaḍḍento. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mukhaṃ makkhento"
      },
      "ti bahimukhaṃ makkhento."
    ],
    "innerText": "Mukhapūrakanti mukhassa pūraṇaṃ mahantaṃ. Arasapaṭisaṃvedīti narasapaṭisaṃvedī. Bhājane chaḍḍentoti bhojanabhājane sitthāni chaḍḍento. Mukhaṃ makkhentoti bahimukhaṃ makkhento."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kilantarūpo"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viyā"
      },
      "ti tassa asahanena khedappatto viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññāṇupekkhāyā"
      },
      "ti aññāṇabhūtāya upekkhāya. Aññāṇasaṅkhātāya upekkhāyāti keci."
    ],
    "innerText": "Kilantarūpoviyāti tassa asahanena khedappatto viya. Aññāṇupekkhāyāti aññāṇabhūtāya upekkhāya. Aññāṇasaṅkhātāya upekkhāyāti keci."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Māyā"
      },
      "dīsu ",
      " santadosapaṭicchadanalakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "māyā"
      },
      ". Asantaguṇapakāsanalakkhaṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāṭheyyaṃ"
      },
      ". Unnatilakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "māno"
      },
      ". Asantaguṇasambhāvanāmukhena paṭiggahaṇe amattaññutālakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāpicchatā"
      },
      ". Santaguṇasambhāvanāmukhena paṭiggahaṇe amattaññutālakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahicchatā"
      },
      ". Sakalābhena asantussanalakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asantuṭṭhitā"
      },
      ". Vijjhanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "siṅgaṃ,"
      },
      " siṅgāratānāgarikabhāvasaṅkhātaṃ kilesasiṅgaṃ. Attano sarīrassa, cīvarādiparikkhārassa ca maṇḍanavasena pavattaṃ loluppaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cāpalyaṃ. Evamādayo"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena ahirikānottappamadappamādādayo saṅgayhanti."
    ],
    "innerText": "Māyādīsu santadosapaṭicchadanalakkhaṇā māyā. Asantaguṇapakāsanalakkhaṇaṃ sāṭheyyaṃ. Unnatilakkhaṇo māno. Asantaguṇasambhāvanāmukhena paṭiggahaṇe amattaññutālakkhaṇā pāpicchatā. Santaguṇasambhāvanāmukhena paṭiggahaṇe amattaññutālakkhaṇā mahicchatā. Sakalābhena asantussanalakkhaṇā asantuṭṭhitā. Vijjhanaṭṭhena siṅgaṃ, siṅgāratānāgarikabhāvasaṅkhātaṃ kilesasiṅgaṃ. Attano sarīrassa, cīvarādiparikkhārassa ca maṇḍanavasena pavattaṃ loluppaṃ cāpalyaṃ. Evamādayoti ettha ādi-saddena ahirikānottappamadappamādādayo saṅgayhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Parāparādhassa upanayhanalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upanāho"
      },
      ". Paresaṃ guṇamakkhaṇalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "makkho"
      },
      ". Parassa guṇe ḍaṃsitvā apanento viya yugaggāhalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paḷāso"
      },
      ". Parasampattiusūyanalakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "issā"
      },
      ". Attasampattinigūhanalakkhaṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "macchariyaṃ"
      },
      ". Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena dovacassatāpāpamittatādīnaṃ saṅgaho daṭṭhabbo."
    ],
    "innerText": "Parāparādhassa upanayhanalakkhaṇo upanāho. Paresaṃ guṇamakkhaṇalakkhaṇo makkho. Parassa guṇe ḍaṃsitvā apanento viya yugaggāhalakkhaṇo paḷāso. Parasampattiusūyanalakkhaṇā issā. Attasampattinigūhanalakkhaṇaṃ macchariyaṃ. Idha ādi-saddena dovacassatāpāpamittatādīnaṃ saṅgaho daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anussāhanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "thinaṃ"
      },
      ". Asattivighāto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "middhaṃ"
      },
      ". Cetaso avūpasamo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddhaccaṃ"
      },
      ". Vippaṭisāro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kukkuccaṃ"
      },
      ". Saṃsayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vicikicchā"
      },
      ". Ayoniso daḷhaggāho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādhānaggāhitā"
      },
      ". Yathāgahitassa micchāgāhassa dubbiveṭhiyatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "duppaṭinissaggiyatā"
      },
      ". Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena muṭṭhasaccaasampajaññādīnaṃ saṅgaho daṭṭhabbo."
    ],
    "innerText": "Anussāhanaṃ thinaṃ. Asattivighāto middhaṃ. Cetaso avūpasamo uddhaccaṃ. Vippaṭisāro kukkuccaṃ. Saṃsayo vicikicchā. Ayoniso daḷhaggāho ādhānaggāhitā. Yathāgahitassa micchāgāhassa dubbiveṭhiyatā duppaṭinissaggiyatā. Idha ādi-saddena muṭṭhasaccaasampajaññādīnaṃ saṅgaho daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muttacāgatā"
      },
      "ti vissaṭṭhacāgatā nissaṅgapariccāgo. Yathā māyādayo, tathā pavattā akusalakkhandhā, yathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyānaṃ dassanakāmatā"
      },
      "dayo, tathā pavattā kusalakkhandhā veditabbā."
    ],
    "innerText": "Muttacāgatāti vissaṭṭhacāgatā nissaṅgapariccāgo. Yathā māyādayo, tathā pavattā akusalakkhandhā, yathā ariyānaṃ dassanakāmatādayo, tathā pavattā kusalakkhandhā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pasādanīyaṭṭhānaṃ"
      },
      " nāma vatthuttayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃvejanīyaṭṭhānāni"
      },
      " jātiādīni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalānuyoge"
      },
      "ti kusaladhammabhāvanāyaṃ. ‘‘Evañca evañca karissāmī’’ti kiccānaṃ rattibhāge parivitakkanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rattiṃ dhūmāyanā"
      },
      ". Tathāvitakkitānaṃ tesaṃ divasabhāge anuṭṭhānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "divā pajjalanā. Hurāhuraṃ dhāvanā"
      },
      "ti ito cito ca tattha tattha ārammaṇe cittavosaggo. Tenevāha ‘‘idaṃ pure cittamacāri cārikaṃ, yenicchakaṃ ",
      " yatthakāmaṃ yathāsukha’’nti (dha. pa. 326), ‘‘cittamassa vidhāvatī’’ti (saṃ. ni. 1.55) ca."
    ],
    "innerText": "Pasādanīyaṭṭhānaṃ nāma vatthuttayaṃ. Saṃvejanīyaṭṭhānāni jātiādīni. Kusalānuyogeti kusaladhammabhāvanāyaṃ. ‘‘Evañca evañca karissāmī’’ti kiccānaṃ rattibhāge parivitakkanaṃ rattiṃ dhūmāyanā. Tathāvitakkitānaṃ tesaṃ divasabhāge anuṭṭhānaṃ divā pajjalanā. Hurāhuraṃ dhāvanāti ito cito ca tattha tattha ārammaṇe cittavosaggo. Tenevāha ‘‘idaṃ pure cittamacāri cārikaṃ, yenicchakaṃ yatthakāmaṃ yathāsukha’’nti (dha. pa. 326), ‘‘cittamassa vidhāvatī’’ti (saṃ. ni. 1.55) ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dhammappavattidassanādi ",
      " ca pāḷiyaṃ, aṭṭhakathāyañca anāgatamevāti na sakkā vattunti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sabbākārenā’’"
      },
      "ti vuttaṃ. Kiñci kiñci āgatampi atthevāti hi adhippāyo. ‘‘Na sārato paccetabba’’nti vatvā tattha kāraṇaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘rāgacaritassa hī’’"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appamādavihārino"
      },
      "ti tattha vinidhāya bhāvaṃ paṭipajjanena appamādakārino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhinnalakkhaṇā iriyāpathādayo"
      },
      "ti cāturiyena acāturiyena saṇikaṃ, sahasā ca gamanādayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na upapajjantī"
      },
      "ti na yujjanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchitvā jānitabba"
      },
      "nti dhammappavattiādiṃ pucchitvā jānitabbaṃ."
    ],
    "innerText": "Dhammappavattidassanādi ca pāḷiyaṃ, aṭṭhakathāyañca anāgatamevāti na sakkā vattunti ‘‘sabbākārenā’’ti vuttaṃ. Kiñci kiñci āgatampi atthevāti hi adhippāyo. ‘‘Na sārato paccetabba’’nti vatvā tattha kāraṇaṃ dassento ‘‘rāgacaritassa hī’’tiādimāha. Appamādavihārinoti tattha vinidhāya bhāvaṃ paṭipajjanena appamādakārino. Bhinnalakkhaṇā iriyāpathādayoti cāturiyena acāturiyena saṇikaṃ, sahasā ca gamanādayo. Na upapajjantīti na yujjanti. Pucchitvā jānitabbanti dhammappavattiādiṃ pucchitvā jānitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "46"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sappāyaṃ"
      },
      " hitaṃ, kilesavighātīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhotavedika"
      },
      "nti aparisuddhaparikkhepavedikaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūmaṭṭhaka"
      },
      "nti bhūmitaleyeva uṭṭhāpitaṃ uparimatalarahitaṃ. Ekato onatassa pabbatapādassa heṭṭhābhāgo akatabhittibhūmiparikammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akatapabbhāro. Jatukābharita"
      },
      "nti adhomukhāhi olambamānamukhāhi khuddakavaggulīhi paripuṇṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Oluggavilugga"
      },
      "nti chinnabhinnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ujjaṅgalaṃ"
      },
      " lūkhadhūsaraṃ chāyūdakarahitaṃ. Sīhabyagghādibhayena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāsaṅkaṃ. Durūpa"
      },
      "nti virūpaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dubbaṇṇa"
      },
      "nti asundaravaṇṇaṃ, dussaṇṭhānaṃ vā. Jālākārena katapūvaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jālapūvaṃ. Sāṇi viya kharasamphassa"
      },
      "nti sāṇiphalako viya dukkhasamphassaṃ. Bhārikabhāvena, antarantarā tunnakaraṇena ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kicchapariharaṇaṃ. Āṇigaṇṭhikāhato"
      },
      "ti āṇinā, gaṇṭhiyā ca hatasobho. Idaṃ rāgacaritassa sappāyaṃ, evamassa kilesasamudācāro na hotīti adhippāyo. Eseva nayo sesesupi."
    ],
    "innerText": "46.Sappāyaṃ hitaṃ, kilesavighātīti attho. Adhotavedikanti aparisuddhaparikkhepavedikaṃ. Bhūmaṭṭhakanti bhūmitaleyeva uṭṭhāpitaṃ uparimatalarahitaṃ. Ekato onatassa pabbatapādassa heṭṭhābhāgo akatabhittibhūmiparikammo akatapabbhāro. Jatukābharitanti adhomukhāhi olambamānamukhāhi khuddakavaggulīhi paripuṇṇaṃ. Oluggavilugganti chinnabhinnaṃ. Ujjaṅgalaṃ lūkhadhūsaraṃ chāyūdakarahitaṃ. Sīhabyagghādibhayena sāsaṅkaṃ. Durūpanti virūpaṃ. Dubbaṇṇanti asundaravaṇṇaṃ, dussaṇṭhānaṃ vā. Jālākārena katapūvaṃ jālapūvaṃ. Sāṇi viya kharasamphassanti sāṇiphalako viya dukkhasamphassaṃ. Bhārikabhāvena, antarantarā tunnakaraṇena ca kicchapariharaṇaṃ. Āṇigaṇṭhikāhatoti āṇinā, gaṇṭhiyā ca hatasobho. Idaṃ rāgacaritassa sappāyaṃ, evamassa kilesasamudācāro na hotīti adhippāyo. Eseva nayo sesesupi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Disāmukha"
      },
      "nti disābhimukhaṃ, abbhokāsābhimukhanti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahākasiṇa"
      },
      "nti mahantaṃ kasiṇamaṇḍalaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sesaṃ"
      },
      " senāsanādīsu yaṃ vattabbaṃ mohacaritassa, taṃ dosacaritassa vuttasadisameva."
    ],
    "innerText": "Disāmukhanti disābhimukhaṃ, abbhokāsābhimukhanti adhippāyo. Mahākasiṇanti mahantaṃ kasiṇamaṇḍalaṃ. Sesaṃ senāsanādīsu yaṃ vattabbaṃ mohacaritassa, taṃ dosacaritassa vuttasadisameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitakkavidhāvanasseva paccayo hoti"
      },
      " yathā taṃ āyasmato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "meghiyattherassa. Darīmukhe"
      },
      "ti pabbatavivare. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paritta"
      },
      "nti suppasarāvamattaṃ."
    ],
    "innerText": "Vitakkavidhāvanasseva paccayo hoti yathā taṃ āyasmato meghiyattherassa. Darīmukheti pabbatavivare. Parittanti suppasarāvamattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pabhedaparicchedato nidānaparicchedato vibhāvanaparicchedato sappāyaparicchedatoti paccekaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariccheda"
      },
      "-saddo yojetabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vibhāvanā"
      },
      "ti ‘‘ayaṃ rāgacarito’’tiādinā jānanavibhāvanā. Ekaccakasiṇānussatiṭṭhānamattassa ",
      " pasaṅgena kathitattā vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na ca tāva cariyānukūlaṃ kammaṭṭhānaṃ sabbākārena āvikata’’"
      },
      "nti."
    ],
    "innerText": "Pabhedaparicchedato nidānaparicchedato vibhāvanaparicchedato sappāyaparicchedatoti paccekaṃ pariccheda-saddo yojetabbo. Vibhāvanāti ‘‘ayaṃ rāgacarito’’tiādinā jānanavibhāvanā. Ekaccakasiṇānussatiṭṭhānamattassa pasaṅgena kathitattā vuttaṃ ‘‘na ca tāva cariyānukūlaṃ kammaṭṭhānaṃ sabbākārena āvikata’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Cattālīsakammaṭṭhānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "47"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhātaniddesato"
      },
      "ti ",
      " saṅkhātānaṃ ‘‘cattālīsāyā’’ti saṅkhyāvasena gahitānaṃ uddiṭṭhānaṃ niddesato. ‘‘Ettha ettakāni upacārajjhānāvahāni, ettakāni appanājjhānāvahānī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upacārappanāvahato"
      },
      ". ‘‘Ettakāni ekajjhānikāni, ettakāni dukatikajjhānikāni, ettakāni sakalajjhānikānī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānappabhedato"
      },
      ". ‘‘Etesu aṅgasamatikkamo, etesu ārammaṇasamatikkamo’’ti evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samatikkamato"
      },
      ". ‘‘Ettakānettha vaḍḍhetabbāni, ettakāni na vaḍḍhetabbānī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vaḍḍhanāvaḍḍhanato. Ārammaṇato"
      },
      "ti sabhāvadhammanimittanavattabbavasena, calitācalitavasena ca ārammaṇavibhāgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūmito"
      },
      "ti kāmāvacarādibhūmivibhāgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gahaṇato"
      },
      "ti diṭṭhādivasena gahaṇavibhāgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccayato"
      },
      "ti āruppādīnaṃ yathārahaṃ paccayabhāvato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cariyānukūlato"
      },
      "ti rāgacariyādīnaṃ anukūlabhāvato."
    ],
    "innerText": "47.Saṅkhātaniddesatoti saṅkhātānaṃ ‘‘cattālīsāyā’’ti saṅkhyāvasena gahitānaṃ uddiṭṭhānaṃ niddesato. ‘‘Ettha ettakāni upacārajjhānāvahāni, ettakāni appanājjhānāvahānī’’ti upacārappanāvahato. ‘‘Ettakāni ekajjhānikāni, ettakāni dukatikajjhānikāni, ettakāni sakalajjhānikānī’’ti jhānappabhedato. ‘‘Etesu aṅgasamatikkamo, etesu ārammaṇasamatikkamo’’ti evaṃ samatikkamato. ‘‘Ettakānettha vaḍḍhetabbāni, ettakāni na vaḍḍhetabbānī’’ti vaḍḍhanāvaḍḍhanato. Ārammaṇatoti sabhāvadhammanimittanavattabbavasena, calitācalitavasena ca ārammaṇavibhāgato. Bhūmitoti kāmāvacarādibhūmivibhāgato. Gahaṇatoti diṭṭhādivasena gahaṇavibhāgato. Paccayatoti āruppādīnaṃ yathārahaṃ paccayabhāvato. Cariyānukūlatoti rāgacariyādīnaṃ anukūlabhāvato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammaṭṭhānānī"
      },
      "ti ārammaṇabhāvena yogakammassa pavattiṭṭhānāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catukkajjhānikā"
      },
      "ti catubbidharūpāvacarajjhānavanto, tesaṃ ārammaṇabhūtāti attho. Catukkanayavasena cetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tikacatukkajjhānikesū"
      },
      "ti tikajjhānikesu purimesu brahmavihāresu, catukkajjhānikesu ānāpānakasiṇesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sesesū"
      },
      "ti vuttāvasesesu ekavīsatiyā kammaṭṭhānesu."
    ],
    "innerText": "Kammaṭṭhānānīti ārammaṇabhāvena yogakammassa pavattiṭṭhānāni. Catukkajjhānikāti catubbidharūpāvacarajjhānavanto, tesaṃ ārammaṇabhūtāti attho. Catukkanayavasena cetaṃ vuttaṃ. Tikacatukkajjhānikesūti tikajjhānikesu purimesu brahmavihāresu, catukkajjhānikesu ānāpānakasiṇesu. Sesesūti vuttāvasesesu ekavīsatiyā kammaṭṭhānesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dibbacakkhunā diṭṭhahadayarūpassa sattassa cittaṃ ādikammiko cetopariyañāṇena paricchindituṃ sakkoti, na itarassāti kasiṇapharaṇaṃ cetopariyañāṇassa paccayo hoti. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘parasattānañca cetasā cittamaññātuṃ samattho hotī’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Okāsena paricchinnattā"
      },
      "ti attano ṭhitokāsena paricchinnattā. Tathā uggahakosallassa sampāditattā paricchinnākāreneva tāni upatiṭṭhanti, tasmā na tattha vaḍḍhanāti adhippāyo. Sace pana koci vaḍḍheyya, na tena koci guṇoti dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ānisaṃsābhāvā cā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Tesu panā’’"
      },
      "tiādinā tameva ānisaṃsābhāvaṃ vivarati. Yasmā vaḍḍhitesu kuṇaparāsiyeva vaḍḍhati, avaḍḍhitepi kāmarāgavikkhambhanā ",
      " hotiyeva, tasmā ānisaṃsābhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vibhūtā"
      },
      "ti vipulārammaṇatāya supākaṭā, vaḍḍhitanimittatāya appamāṇārammaṇabhāvena paribyattāti attho."
    ],
    "innerText": "Dibbacakkhunā diṭṭhahadayarūpassa sattassa cittaṃ ādikammiko cetopariyañāṇena paricchindituṃ sakkoti, na itarassāti kasiṇapharaṇaṃ cetopariyañāṇassa paccayo hoti. Tena vuttaṃ ‘‘parasattānañca cetasā cittamaññātuṃ samattho hotī’’ti. Okāsena paricchinnattāti attano ṭhitokāsena paricchinnattā. Tathā uggahakosallassa sampāditattā paricchinnākāreneva tāni upatiṭṭhanti, tasmā na tattha vaḍḍhanāti adhippāyo. Sace pana koci vaḍḍheyya, na tena koci guṇoti dassento āha ‘‘ānisaṃsābhāvā cā’’ti. ‘‘Tesu panā’’tiādinā tameva ānisaṃsābhāvaṃ vivarati. Yasmā vaḍḍhitesu kuṇaparāsiyeva vaḍḍhati, avaḍḍhitepi kāmarāgavikkhambhanā hotiyeva, tasmā ānisaṃsābhāvo. Vibhūtāti vipulārammaṇatāya supākaṭā, vaḍḍhitanimittatāya appamāṇārammaṇabhāvena paribyattāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kevala"
      },
      "nti ",
      " sakalaṃ anavasesaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Pathaviṃ ima’’"
      },
      "nti vacanaṃ upaṭṭhānākārena vuttaṃ, na nimittassa vaḍḍhanenāti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lābhittā"
      },
      "ti sātisayaṃ lābhitāya, ukkaṃsagatavasibhāvatoti attho. Thero hi paramāya vasipattiyā assamaṇḍale assaṃ sārento viya yattha tattha nisinnopi ṭhitopi taṃ jhānaṃ samāpajjateva. Tenassa samantato nimittaṃ vaḍḍhitaṃ viya upaṭṭhāsi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sabbadisāsū’’"
      },
      "tiādi."
    ],
    "innerText": "Kevalanti sakalaṃ anavasesaṃ. ‘‘Pathaviṃ ima’’nti vacanaṃ upaṭṭhānākārena vuttaṃ, na nimittassa vaḍḍhanenāti adhippāyo. Lābhittāti sātisayaṃ lābhitāya, ukkaṃsagatavasibhāvatoti attho. Thero hi paramāya vasipattiyā assamaṇḍale assaṃ sārento viya yattha tattha nisinnopi ṭhitopi taṃ jhānaṃ samāpajjateva. Tenassa samantato nimittaṃ vaḍḍhitaṃ viya upaṭṭhāsi. Tena vuttaṃ ‘‘sabbadisāsū’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuttā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammasaṅgahe"
      },
      " vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahante"
      },
      "ti vipule. Ninnathalādivasena hi ekadese aṭṭhatvā samantato gahaṇavasena sakalasarīre nimittaṃ gaṇhantassa taṃ mahantaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahante"
      },
      " vā sarīre. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appake"
      },
      "ti sarīrassa ekadese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nimittaṃ gaṇhātī"
      },
      "ti yojanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appake"
      },
      " vā khuddake dārakasarīre. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eta"
      },
      "nti asubhanimittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādīnava"
      },
      "nti ‘‘asubharāsi eva vaḍḍhati, na ca koci ānisaṃso’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuttaṃ"
      },
      " ādīnavaṃ."
    ],
    "innerText": "Vuttāti dhammasaṅgahe vuttā. Mahanteti vipule. Ninnathalādivasena hi ekadese aṭṭhatvā samantato gahaṇavasena sakalasarīre nimittaṃ gaṇhantassa taṃ mahantaṃ hoti. Mahante vā sarīre. Appaketi sarīrassa ekadese nimittaṃ gaṇhātīti yojanā. Appake vā khuddake dārakasarīre. Etanti asubhanimittaṃ. Ādīnavanti ‘‘asubharāsi eva vaḍḍhati, na ca koci ānisaṃso’’ti vuttaṃ ādīnavaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sesānipi na vaḍḍhetabbānī"
      },
      "ti saṅkhepato vuttamatthaṃ upapattito vivarituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kasmā’’"
      },
      "tiādi vuttaṃ. Picupiṇḍādivasena upaṭṭhahantampi nimittaṃ vātasaṅghātasannissayanti katvā vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vātarāsiyeva vaḍḍhatī’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Okāsena paricchinna"
      },
      "nti nāsikaggamukhanimittādiokāsena saparicchedaṃ. Vāyokasiṇavaḍḍhane viya na ettha koci guṇo, kevalaṃ vātavaḍḍhanamevāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sādīnavattā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesa"
      },
      "nti brahmavihārānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nimitta"
      },
      "nti ārammaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ca tena attho atthī"
      },
      "ti tena sattarāsivaḍḍhanena pathavīkasiṇādivaḍḍhane viya kiñci payojanaṃ natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariggahavasenā"
      },
      "ti apariggahitassa bhāvanāvisayassa pariggahavasena, na nimittavaḍḍhanavasena. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ekāvāsadviāvāsādinā’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etthā"
      },
      "ti brahmavihārabhāvanāyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadaya"
      },
      "nti yaṃ paṭibhāganimittaṃ ayaṃ yogī. Sīmāsambhedeneva hettha upacārajjhānuppatti, na nimittuppattiyā. Yadi evaṃ kathaṃ parittādiārammaṇatā jhānassāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘parittaappamāṇārammaṇatāpettha pariggahavasenā’’"
      },
      "ti, katipaye satte pariggahetvā pavattā mettādayo parittārammaṇā, bahuke appamāṇārammaṇāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākāsaṃ kasiṇugghāṭimattā"
      },
      " na vaḍḍhetabbanti yojanā. Vakkhati vā yaṃ tena sambandhitabbaṃ. Parikappajameva ārammaṇaṃ vaḍḍhetuṃ sakkā, na itaranti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na hi sakkā sabhāvadhammaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vaḍḍhetu’’"
      },
      "nti ",
      ". Āruppānaṃ parittaappamāṇārammaṇatā parittakasiṇugghāṭimākāse, vipulakasiṇugghāṭimākāse ca pavattiyā veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sesāni"
      },
      " buddhānussatiādīni dasa kammaṭṭhānāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Animittattā"
      },
      "ti paṭibhāganimittābhāvā."
    ],
    "innerText": "Sesānipi na vaḍḍhetabbānīti saṅkhepato vuttamatthaṃ upapattito vivarituṃ ‘‘kasmā’’tiādi vuttaṃ. Picupiṇḍādivasena upaṭṭhahantampi nimittaṃ vātasaṅghātasannissayanti katvā vuttaṃ ‘‘vātarāsiyeva vaḍḍhatī’’ti. Okāsena paricchinnanti nāsikaggamukhanimittādiokāsena saparicchedaṃ. Vāyokasiṇavaḍḍhane viya na ettha koci guṇo, kevalaṃ vātavaḍḍhanamevāti āha ‘‘sādīnavattā’’ti. Tesanti brahmavihārānaṃ. Nimittanti ārammaṇaṃ. Na ca tena attho atthīti tena sattarāsivaḍḍhanena pathavīkasiṇādivaḍḍhane viya kiñci payojanaṃ natthi. Pariggahavasenāti apariggahitassa bhāvanāvisayassa pariggahavasena, na nimittavaḍḍhanavasena. Tenāha ‘‘ekāvāsadviāvāsādinā’’tiādi. Etthāti brahmavihārabhāvanāyaṃ. Yadayanti yaṃ paṭibhāganimittaṃ ayaṃ yogī. Sīmāsambhedeneva hettha upacārajjhānuppatti, na nimittuppattiyā. Yadi evaṃ kathaṃ parittādiārammaṇatā jhānassāti āha ‘‘parittaappamāṇārammaṇatāpettha pariggahavasenā’’ti, katipaye satte pariggahetvā pavattā mettādayo parittārammaṇā, bahuke appamāṇārammaṇāti attho. Ākāsaṃ kasiṇugghāṭimattā na vaḍḍhetabbanti yojanā. Vakkhati vā yaṃ tena sambandhitabbaṃ. Parikappajameva ārammaṇaṃ vaḍḍhetuṃ sakkā, na itaranti āha ‘‘na hi sakkā sabhāvadhammaṃvaḍḍhetu’’nti . Āruppānaṃ parittaappamāṇārammaṇatā parittakasiṇugghāṭimākāse, vipulakasiṇugghāṭimākāse ca pavattiyā veditabbā. Sesāni buddhānussatiādīni dasa kammaṭṭhānāni. Animittattāti paṭibhāganimittābhāvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭibhāganimittārammaṇānī"
      },
      "ti paṭibhāganimittabhūtāni ārammaṇāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sesāni"
      },
      " aṭṭhārasa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sesāni chā"
      },
      "ti cattāro brahmavihārā, ākāsānañcāyatanaṃ, ākiñcaññāyatananti imāni sesāni cha. Vissandamānapubbatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipubbakaṃ"
      },
      ". Paggharamānalohitatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lohitakaṃ"
      },
      ". Kimīnaṃ pacalanena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puḷuvakaṃ,"
      },
      " calitārammaṇaṃ vuttaṃ. Vātapānavivarādīhi antopaviṭṭhassa sūriyālokādikassa calanākāro paññāyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "obhāsamaṇḍalārammaṇa"
      },
      "mpi calitārammaṇaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbabhāge"
      },
      "ti paṭibhāganimittappavattiyā pubbabhāge. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sannisinnamevā"
      },
      "ti santaṃ niccalameva."
    ],
    "innerText": "Paṭibhāganimittārammaṇānīti paṭibhāganimittabhūtāni ārammaṇāni. Sesāni aṭṭhārasa. Sesāni chāti cattāro brahmavihārā, ākāsānañcāyatanaṃ, ākiñcaññāyatananti imāni sesāni cha. Vissandamānapubbatāya vipubbakaṃ. Paggharamānalohitatāya lohitakaṃ. Kimīnaṃ pacalanena puḷuvakaṃ, calitārammaṇaṃ vuttaṃ. Vātapānavivarādīhi antopaviṭṭhassa sūriyālokādikassa calanākāro paññāyatīti obhāsamaṇḍalārammaṇampi calitārammaṇaṃ vuttaṃ. Pubbabhāgeti paṭibhāganimittappavattiyā pubbabhāge. Sannisinnamevāti santaṃ niccalameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devesū"
      },
      "ti kāmāvacaradevesu, tattha asubhānaṃ paṭikūlassa ca āhārassa abhāvato. Assāsapassāsānaṃ brahmaloke abhāvato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ānāpānassati cā’’"
      },
      "ti vuttaṃ."
    ],
    "innerText": "Devesūti kāmāvacaradevesu, tattha asubhānaṃ paṭikūlassa ca āhārassa abhāvato. Assāsapassāsānaṃ brahmaloke abhāvato ‘‘ānāpānassati cā’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhenā"
      },
      "ti diṭṭhena vatthunā kāraṇabhūtena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gahetabbānī"
      },
      "ti uggahetabbāni, uppādetabbauggahanimittānīti attho. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pubbabhāge’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā"
      },
      "ti kāyagatāsatiyā. Ucchusassādīnaṃ pattesu pacalamānavaṇṇaggahaṇamukhena vā tassa gahetabbattā vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vāyokasiṇaṃ diṭṭhaphuṭṭhenā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ādikammikena gahetabbānī"
      },
      "ti ādikammikena na gahetabbāni, bhāvanārambhavasena na paṭṭhapetabbāni, heṭṭhime tayo brahmavihāre, kasiṇesu rūpāvacaracatutthajjhānañca anadhigantvā sampādetuṃ asakkuṇeyyattā."
    ],
    "innerText": "Diṭṭhenāti diṭṭhena vatthunā kāraṇabhūtena. Gahetabbānīti uggahetabbāni, uppādetabbauggahanimittānīti attho. Tenāha ‘‘pubbabhāge’’tiādi. Tassāti kāyagatāsatiyā. Ucchusassādīnaṃ pattesu pacalamānavaṇṇaggahaṇamukhena vā tassa gahetabbattā vuttaṃ ‘‘vāyokasiṇaṃ diṭṭhaphuṭṭhenā’’ti. Na ādikammikena gahetabbānīti ādikammikena na gahetabbāni, bhāvanārambhavasena na paṭṭhapetabbāni, heṭṭhime tayo brahmavihāre, kasiṇesu rūpāvacaracatutthajjhānañca anadhigantvā sampādetuṃ asakkuṇeyyattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imesu pana kammaṭṭhānesū"
      },
      "ti ettha kammaṭṭhānaggahaṇena yathārahaṃ ārammaṇānaṃ, jhānānañca gahaṇaṃ veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhavihārassā"
      },
      "ti diṭṭhadhammasukhavihārassa."
    ],
    "innerText": "Imesu pana kammaṭṭhānesūti ettha kammaṭṭhānaggahaṇena yathārahaṃ ārammaṇānaṃ, jhānānañca gahaṇaṃ veditabbaṃ. Sukhavihārassāti diṭṭhadhammasukhavihārassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Ekādasa kammaṭṭhānāni anukūlānī’’"
      },
      "ti ujuvipaccanīkavasena cetaṃ vuttaṃ. Evaṃ sesesupi. Vakkhati hi ‘‘sabbañceta’’ntiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anukūlāni"
      },
      " rāgavikkhambhanassa upāyabhāvato. Aṭṭha anukūlānīti yojanā. Evaṃ sesesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eka"
      },
      "nti idaṃ anussatiapekkhaṃ anussatīsu ekanti, na mohacaritavitakkacaritāpekkhaṃ tesaṃ aññassāpi anukūlassa alabbhanato ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Saddhācaritassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purimā cha anussatiyo’’"
      },
      "ti idaṃ atisappāyavasena vuttaṃ. Imasseva ujuvipaccanīkaṃ imassa atisappāyanti gahetabbassa visesassa abhāvato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbacaritānaṃ anukūlāni. Paritta"
      },
      "nti sarāvamattaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appamāṇa"
      },
      "nti tato adhikapamāṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parittaṃ"
      },
      " vā suppasarāvamattaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appamāṇaṃ"
      },
      " adhikapamāṇaṃ khalamaṇḍalādikasiṇabhāvena pariggahitaṃ."
    ],
    "innerText": "‘‘Ekādasa kammaṭṭhānāni anukūlānī’’ti ujuvipaccanīkavasena cetaṃ vuttaṃ. Evaṃ sesesupi. Vakkhati hi ‘‘sabbañceta’’ntiādi. Anukūlāni rāgavikkhambhanassa upāyabhāvato. Aṭṭha anukūlānīti yojanā. Evaṃ sesesu. Ekanti idaṃ anussatiapekkhaṃ anussatīsu ekanti, na mohacaritavitakkacaritāpekkhaṃ tesaṃ aññassāpi anukūlassa alabbhanato . ‘‘Saddhācaritassapurimā cha anussatiyo’’ti idaṃ atisappāyavasena vuttaṃ. Imasseva ujuvipaccanīkaṃ imassa atisappāyanti gahetabbassa visesassa abhāvato sabbacaritānaṃ anukūlāni. Parittanti sarāvamattaṃ, appamāṇanti tato adhikapamāṇaṃ. Parittaṃ vā suppasarāvamattaṃ, appamāṇaṃ adhikapamāṇaṃ khalamaṇḍalādikasiṇabhāvena pariggahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattāro dhammā"
      },
      "ti cattāro manasikaraṇīyā dhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttarī"
      },
      "ti sīlasampadā, kalyāṇamittatā, sappāyadhammassavanaṃ, vīriyaṃ; paññāti imesu pañcasu dhammesu patiṭṭhānato upari. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asubhā"
      },
      "ti asubhabhāvanā ekādasasu asubhakammaṭṭhānesu bhāvanānuyogā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mettā"
      },
      "ti anodhiso, odhiso vā pavattā mettābhāvanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ānāpānassatī"
      },
      "ti soḷasavatthukā ānāpānassatisamādhibhāvanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitakkupacchedāyā"
      },
      "ti micchāvitakkānaṃ upacchindanatthāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniccasaññā"
      },
      "ti ‘‘sabbe saṅkhārā aniccā’’ti (a. ni. 3.137; dha. pa. 277; mahāni. 27) evaṃ pavattā aniccānupassanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asmimānasamugghātāyā"
      },
      "ti ‘‘asmī’’ti uppajjanakassa navavidhassāpi mānassa samucchindanāya. Ettha hi ekasseva cattāro dhammā bhāvetabbā vuttā, na ekassa catucariyatāya. Tena viññāyati ‘‘sabbānipi kammaṭṭhānāni sabbākusalavikkhambhanāni sabbakusalaparibrūhanānī’’ti."
    ],
    "innerText": "Cattāro dhammāti cattāro manasikaraṇīyā dhammā. Uttarīti sīlasampadā, kalyāṇamittatā, sappāyadhammassavanaṃ, vīriyaṃ; paññāti imesu pañcasu dhammesu patiṭṭhānato upari. Asubhāti asubhabhāvanā ekādasasu asubhakammaṭṭhānesu bhāvanānuyogā. Mettāti anodhiso, odhiso vā pavattā mettābhāvanā. Ānāpānassatīti soḷasavatthukā ānāpānassatisamādhibhāvanā. Vitakkupacchedāyāti micchāvitakkānaṃ upacchindanatthāya. Aniccasaññāti ‘‘sabbe saṅkhārā aniccā’’ti (a. ni. 3.137; dha. pa. 277; mahāni. 27) evaṃ pavattā aniccānupassanā. Asmimānasamugghātāyāti ‘‘asmī’’ti uppajjanakassa navavidhassāpi mānassa samucchindanāya. Ettha hi ekasseva cattāro dhammā bhāvetabbā vuttā, na ekassa catucariyatāya. Tena viññāyati ‘‘sabbānipi kammaṭṭhānāni sabbākusalavikkhambhanāni sabbakusalaparibrūhanānī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekasseva satta kammaṭṭhānāni vuttāni,"
      },
      " na cāyasmā rāhulo sabbacaritoti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vacanamatte"
      },
      "ti ‘‘asukakammaṭṭhānaṃ asukacaritassa anukūla’’nti evaṃ vuttavacanamatte. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhippāyo"
      },
      "ti tathāvacanassa adhippāyo. So pana ‘‘sabbañceta’’ntiādinā vibhāvito eva."
    ],
    "innerText": "Ekasseva satta kammaṭṭhānāni vuttāni, na cāyasmā rāhulo sabbacaritoti adhippāyo. Vacanamatteti ‘‘asukakammaṭṭhānaṃ asukacaritassa anukūla’’nti evaṃ vuttavacanamatte. Adhippāyoti tathāvacanassa adhippāyo. So pana ‘‘sabbañceta’’ntiādinā vibhāvito eva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "48"
      },
      ". ‘‘Piyo garū’’tiādinā (a. ni. 7.37) vuttappakāraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kalyāṇamittaṃ"
      },
      ". ‘‘Attano pattacīvaraṃ sayameva gahetvā’’tiādinā vuttanayena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upasaṅkamitvā. Somanassameva uppajjati"
      },
      " ‘‘evaṃ bahuparissayoyaṃ attabhāvo ṭhāneyeva mayā niyyātito’’ti. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yathā hī’’"
      },
      "tiādi."
    ],
    "innerText": "48. ‘‘Piyo garū’’tiādinā (a. ni. 7.37) vuttappakāraṃ kalyāṇamittaṃ. ‘‘Attano pattacīvaraṃ sayameva gahetvā’’tiādinā vuttanayena upasaṅkamitvā. Somanassameva uppajjati ‘‘evaṃ bahuparissayoyaṃ attabhāvo ṭhāneyeva mayā niyyātito’’ti. Tenāha ‘‘yathā hī’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atajjanīyo"
      },
      "ti na tajjetabbo na niggahetabbo. Svāyaṃ atajjanīyabhāvo dovacassatāya vā siyā, ācariye aniviṭṭhapematāya vāti tadubhayaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dubbaco vā’’"
      },
      "tiādi vuttaṃ. Yo hi ācariyena tajjiyamāno kopañca dosañca apaccayañca pātukaroti, yo vā ‘‘kimassa ",
      " santike vāsenā’’ti pakkamati, ayaṃ duvidhopi atajjanīyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammenā"
      },
      "ti ovādānusāsanidhammena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gūḷhaṃ gantha"
      },
      "nti kammaṭṭhānaganthaṃ, saccapaṭiccasamuppādādisahitaṃ gambhīraṃ suññatāpaṭisaṃyuttañca."
    ],
    "innerText": "Atajjanīyoti na tajjetabbo na niggahetabbo. Svāyaṃ atajjanīyabhāvo dovacassatāya vā siyā, ācariye aniviṭṭhapematāya vāti tadubhayaṃ dassetuṃ ‘‘dubbaco vā’’tiādi vuttaṃ. Yo hi ācariyena tajjiyamāno kopañca dosañca apaccayañca pātukaroti, yo vā ‘‘kimassa santike vāsenā’’ti pakkamati, ayaṃ duvidhopi atajjanīyo. Dhammenāti ovādānusāsanidhammena. Gūḷhaṃ ganthanti kammaṭṭhānaganthaṃ, saccapaṭiccasamuppādādisahitaṃ gambhīraṃ suññatāpaṭisaṃyuttañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tumhākamatthāyāti vutte"
      },
      "ti ‘‘sataporise papāte patanena tumhākaṃ koci attho hotī’’ti kenaci vutte. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ghaṃsento"
      },
      "ti ‘‘manussakakkena tumhākaṃ koci attho’’ti vutte ghaṃsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niravasesaṃ"
      },
      " attabhāvaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khepetuṃ ussaheyyaṃ"
      },
      ". ‘‘Mama assāsapassāsanirundhanena tumhākaṃ koci rogavūpasamādiko attho atthī’’ti kenaci vutte. Tīhipi bhikkhūhi ācariye bhattipavedanamukhena vīriyārambho eva pavedito."
    ],
    "innerText": "Tumhākamatthāyāti vutteti ‘‘sataporise papāte patanena tumhākaṃ koci attho hotī’’ti kenaci vutte. Ghaṃsentoti ‘‘manussakakkena tumhākaṃ koci attho’’ti vutte ghaṃsento niravasesaṃ attabhāvaṃ khepetuṃ ussaheyyaṃ. ‘‘Mama assāsapassāsanirundhanena tumhākaṃ koci rogavūpasamādiko attho atthī’’ti kenaci vutte. Tīhipi bhikkhūhi ācariye bhattipavedanamukhena vīriyārambho eva pavedito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "49"
      },
      ". Aññattha pavattitvāpi cittaṃ āgamma yattha seti, so tassa āsayo ‘‘migāsayo’’ viya, āsayo eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhāsayo"
      },
      ". So duvidho vipanno, sampannoti. Tattha vipanno sassatādimicchābhinivesanissito. Sampanno duvidho vaṭṭanissito, vivaṭṭanissitoti. Tesu vivaṭṭanissito ajjhāsayo ‘‘sampannajjhāsayenā’’ti idhādhippeto. Idāni naṃ vibhāgena dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘alobhādīnaṃ vasenā’’"
      },
      "tiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chahākārehī"
      },
      "ti alubbhanādīhi chahi ākārehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampannajjhāsayenā"
      },
      "ti pubbabhāgiyānaṃ sīlasampadādīnaṃ sādhanavasena, lokuttarānaṃ upanissayabhāvena ca sampanno ajjhāsayo etassāti sampannajjhāsayo, tena. Alobhādayo hi anekadosavidhamanato, anekaguṇāvahato ca sattānaṃ bahukārā visesato yogino. Tathā hi alobhādayo maccheramalādīnaṃ paṭipakkhabhāvena pavattanti. Vuttaṃ hetaṃ (dha. sa. aṭṭha. 1 mūlarāsīvaṇṇanā) –"
    ],
    "innerText": "49. Aññattha pavattitvāpi cittaṃ āgamma yattha seti, so tassa āsayo ‘‘migāsayo’’ viya, āsayo eva ajjhāsayo. So duvidho vipanno, sampannoti. Tattha vipanno sassatādimicchābhinivesanissito. Sampanno duvidho vaṭṭanissito, vivaṭṭanissitoti. Tesu vivaṭṭanissito ajjhāsayo ‘‘sampannajjhāsayenā’’ti idhādhippeto. Idāni naṃ vibhāgena dassetuṃ ‘‘alobhādīnaṃ vasenā’’tiādi vuttaṃ. Tattha chahākārehīti alubbhanādīhi chahi ākārehi. Sampannajjhāsayenāti pubbabhāgiyānaṃ sīlasampadādīnaṃ sādhanavasena, lokuttarānaṃ upanissayabhāvena ca sampanno ajjhāsayo etassāti sampannajjhāsayo, tena. Alobhādayo hi anekadosavidhamanato, anekaguṇāvahato ca sattānaṃ bahukārā visesato yogino. Tathā hi alobhādayo maccheramalādīnaṃ paṭipakkhabhāvena pavattanti. Vuttaṃ hetaṃ (dha. sa. aṭṭha. 1 mūlarāsīvaṇṇanā) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Alobho maccheramalassa paṭipakkho, adoso dussīlyamalassa, amoho kusalesu dhammesu abhāvanāya. Alobho cettha dānahetu, adoso sīlahetu, amoho bhāvanāhetu. Tesu ca alobhena anadhikaṃ gaṇhāti luddhassa adhikaggahaṇato, adosena anūnaṃ duṭṭhassa ūnaggahaṇato, amohena aviparītaṃ mūḷhassa viparītaggahaṇato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Alobhena ",
      " cettha vijjamānaṃ dosaṃ dosato dhārento dose pavattati, luddho hi dosaṃ paṭicchādeti. Adosena vijjamānaṃ guṇaṃ guṇato dhārento guṇe pavattati, duṭṭho hi guṇaṃ makkheti. Amohena yāthāvasabhāvaṃ yāthāvasabhāvato dhārento yāthāvasabhāve pavattati ",
      ", mūḷho hi tacchaṃ ‘ataccha’nti, atacchañca ‘taccha’nti gaṇhāti. Alobhena ca piyavippayogadukkhaṃ na hoti luddhassa piyasabbhāvato, piyavippayogāsahanato ca, adosena appiyasampayogadukkhaṃ na hoti duṭṭhassa appiyasabbhāvato, appiyasampayogāsahanato ca, amohena icchitālābhadukkhaṃ na hoti, amūḷhassa hi ‘taṃ kutettha labbhā’ti evamādipaccavekkhaṇasabbhāvato."
    ],
    "innerText": "‘‘Alobhena cettha vijjamānaṃ dosaṃ dosato dhārento dose pavattati, luddho hi dosaṃ paṭicchādeti. Adosena vijjamānaṃ guṇaṃ guṇato dhārento guṇe pavattati, duṭṭho hi guṇaṃ makkheti. Amohena yāthāvasabhāvaṃ yāthāvasabhāvato dhārento yāthāvasabhāve pavattati , mūḷho hi tacchaṃ ‘ataccha’nti, atacchañca ‘taccha’nti gaṇhāti. Alobhena ca piyavippayogadukkhaṃ na hoti luddhassa piyasabbhāvato, piyavippayogāsahanato ca, adosena appiyasampayogadukkhaṃ na hoti duṭṭhassa appiyasabbhāvato, appiyasampayogāsahanato ca, amohena icchitālābhadukkhaṃ na hoti, amūḷhassa hi ‘taṃ kutettha labbhā’ti evamādipaccavekkhaṇasabbhāvato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Alobhena cettha jātidukkhaṃ na hoti alobhassa taṇhāpaṭipakkhato, taṇhāmūlakattā ca jātidukkhassa, adosena jarādukkhaṃ na hoti tikkhadosassa khippaṃ jarāsambhavato, amohena maraṇadukkhaṃ na hoti, sammohamaraṇañhi dukkhaṃ, na ca taṃ amūḷhassa hoti. Alobhena ca gahaṭṭhānaṃ, amohena pabbajitānaṃ, adosena pana sabbesampi sukhasaṃvāsatā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Visesato cettha alobhena pettivisaye upapatti na hoti, yebhuyyena hi sattā taṇhāya pettivisayaṃ upapajjanti, taṇhāya ca paṭipakkho alobho. Adosena niraye upapatti na hoti, dosena hi caṇḍajātitāya dosasadisaṃ nirayaṃ upapajjanti, dosassa ca paṭipakkho adoso. Amohena tiracchānayoniyaṃ nibbatti na hoti, mohena hi niccasammūḷhaṃ tiracchānayoniṃ upapajjanti, mohapaṭipakkho ca amoho. Etesu ca alobho rāgavasena upagamanassa abhāvakaro, adoso dosavasena apagamanassa, amoho mohavasena amajjhattabhāvassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Tīhipi ",
      " cetehi yathāpaṭipāṭiyā nekkhammasaññā abyāpādasaññā avihiṃsāsaññāti imā tisso, asubhasaññā appamāṇasaññā dhātusaññāti imā ca tisso saññāyo honti. Alobhena pana kāmasukhallikānuyogaantassa, adosena attakilamathānuyogaantassa parivajjanaṃ hoti, amohena majjhimāya paṭipattiyā paṭipajjanaṃ. Tathā alobhena abhijjhākāyaganthassa pabhedanaṃ hoti, adosena byāpādakāyaganthassa, amohena sesaganthadvayassa. Purimāni ca dve satipaṭṭhānāni purimānaṃ dvinnaṃ ānubhāvena, pacchimāni pacchimasseva ānubhāvena ijjhanti."
    ],
    "innerText": "‘‘Tīhipi cetehi yathāpaṭipāṭiyā nekkhammasaññā abyāpādasaññā avihiṃsāsaññāti imā tisso, asubhasaññā appamāṇasaññā dhātusaññāti imā ca tisso saññāyo honti. Alobhena pana kāmasukhallikānuyogaantassa, adosena attakilamathānuyogaantassa parivajjanaṃ hoti, amohena majjhimāya paṭipattiyā paṭipajjanaṃ. Tathā alobhena abhijjhākāyaganthassa pabhedanaṃ hoti, adosena byāpādakāyaganthassa, amohena sesaganthadvayassa. Purimāni ca dve satipaṭṭhānāni purimānaṃ dvinnaṃ ānubhāvena, pacchimāni pacchimasseva ānubhāvena ijjhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Alobho ",
      " cettha ārogyassa paccayo hoti, aluddho hi lobhanīyampi asappāyaṃ na sevati, tena arogo hoti. Adoso yobbanassa, aduṭṭho hi valitapalitāvahena dosagginā aḍayhamāno dīgharattaṃ yuvā hoti. Amoho dīghāyukatāya, amūḷho hi hitāhitaṃ ñatvā ahitaṃ parivajjento, hitañca paṭisevamāno dīghāyuko hoti."
    ],
    "innerText": "‘‘Alobho cettha ārogyassa paccayo hoti, aluddho hi lobhanīyampi asappāyaṃ na sevati, tena arogo hoti. Adoso yobbanassa, aduṭṭho hi valitapalitāvahena dosagginā aḍayhamāno dīgharattaṃ yuvā hoti. Amoho dīghāyukatāya, amūḷho hi hitāhitaṃ ñatvā ahitaṃ parivajjento, hitañca paṭisevamāno dīghāyuko hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Alobho cettha bhogasampattiyā paccayo cāgena bhogapaṭilābhato, adoso mittasampattiyā mettāya mittānaṃ paṭilābhato, aparihānato ca, amoho attasampattiyā, amūḷho hi attano hitameva karonto attānaṃ sampādeti. Alobho ca dibbavihārassa paccayo hoti, adoso brahmavihārassa, amoho ariyavihārassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Alobhena cettha sakapakkhesu sattasaṅkhāresu nibbuto hoti tesaṃ vināsena abhisaṅgahetukassa dukkhassa abhāvā, adosena parapakkhesu, aduṭṭhassa hi verīsupi verisaññāya abhāvato, amohena udāsīnapakkhesu amūḷhassa sabbābhisaṅgatāya abhāvato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Alobhena ",
      " ca aniccadassanaṃ hoti, luddho hi upabhogāsāya aniccepi saṅkhāre aniccato na passati. Adosena dukkhadassanaṃ, adosajjhāsayo hi pariccattaāghātavatthupariggaho saṅkhāreyeva dukkhato passati. Amohena anattadassanaṃ, amūḷho hi yāthāvagahaṇakusalo apariṇāyakaṃ khandhapañcakaṃ apariṇāyakato bujjhati. Yathā ca etehi aniccadassanādīni, evaṃ etepi aniccadassanādīhi honti. Aniccadassanena hi alobho hoti, dukkhadassanena adoso, anattadassanena amoho. Ko hi nāma ‘aniccamida’nti sammā ñatvā tassatthāya pihaṃ uppādeyya, saṅkhāre vā ‘dukkha’nti jānanto aparampi accantatikhiṇaṃ kodhadukkhaṃ uppādeyya, attasuññatañca bujjhitvā puna sammohaṃ āpajjeyyā’’ti."
    ],
    "innerText": "‘‘Alobhena ca aniccadassanaṃ hoti, luddho hi upabhogāsāya aniccepi saṅkhāre aniccato na passati. Adosena dukkhadassanaṃ, adosajjhāsayo hi pariccattaāghātavatthupariggaho saṅkhāreyeva dukkhato passati. Amohena anattadassanaṃ, amūḷho hi yāthāvagahaṇakusalo apariṇāyakaṃ khandhapañcakaṃ apariṇāyakato bujjhati. Yathā ca etehi aniccadassanādīni, evaṃ etepi aniccadassanādīhi honti. Aniccadassanena hi alobho hoti, dukkhadassanena adoso, anattadassanena amoho. Ko hi nāma ‘aniccamida’nti sammā ñatvā tassatthāya pihaṃ uppādeyya, saṅkhāre vā ‘dukkha’nti jānanto aparampi accantatikhiṇaṃ kodhadukkhaṃ uppādeyya, attasuññatañca bujjhitvā puna sammohaṃ āpajjeyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena vuttaṃ ‘‘pubbabhāgiyānaṃ sīlasampadādīnaṃ sādhanavasena lokuttarānaṃ, upanissayabhāvena ca sampanno ajjhāsayo etassāti sampannajjhāsayo’’ti. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evaṃ tissannaṃ bodhīnaṃ aññataraṃ pāpuṇātī’’"
      },
      "ti."
    ],
    "innerText": "Tena vuttaṃ ‘‘pubbabhāgiyānaṃ sīlasampadādīnaṃ sādhanavasena lokuttarānaṃ, upanissayabhāvena ca sampanno ajjhāsayo etassāti sampannajjhāsayo’’ti. Tenāha ‘‘evaṃ tissannaṃ bodhīnaṃ aññataraṃ pāpuṇātī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " te ajjhāsaye pāḷiyāva vibhāvetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yathāhā’’"
      },
      "tiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chā"
      },
      "ti gaṇanaparicchedo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhāsayā"
      },
      "ti paricchinnadhammanidassanaṃ. Ubhayaṃ pana ekajjhaṃ katvā chabbidhā ajjhāsayāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bodhisattā"
      },
      "ti bujjhanakasattā, bodhiyā vā niyatabhāvena sattā laggā, adhimuttā tanninnā tappoṇāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bodhiparipākāya saṃvattantī"
      },
      "ti yathābhinīhāraṃ attanā pattabbabodhiyā paripācanāya bhavanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alobhajjhāsayā"
      },
      "ti alubbhanākārena pavattaajjhāsayā, ādito ‘‘kathaṃ nu kho mayaṃ sabbattha, sabbadā ca aluddhā eva hessāmā’’ti, majjhe ca alubbhanavaseneva, pacchā ca tasseva rocanavasena pavattaajjhāsayā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lobhe dosadassāvino"
      },
      "ti lubbhanalakkhaṇe lobhe sabbappakārena ādīnavadassāvino. Idaṃ tassa ajjhāsayassa ekadesato brūhanākāradassanaṃ. Lobhe hi ādīnavaṃ, alobhe ca ānisaṃsaṃ passantassa alobhajjhāsayo parivaḍḍhati, svāyaṃ tattha ādīnavānisaṃsadassanavidhi vibhāvitoyeva. Sesapadesupi iminā nayena attho veditabbo. Ayaṃ ",
      " pana viseso – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nekkhamma"
      },
      "nti idha pabbajjā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paviveko"
      },
      " tadaṅgaviveko, vikkhambhanaviveko, kāyaviveko, cittaviveko ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nissaraṇaṃ"
      },
      " nibbānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbabhavagatīsū"
      },
      "ti sabbesu bhavesu, sabbāsu ca gatīsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadadhimuttatāyā"
      },
      "ti yadatthaṃ bhāvanānuyogo, yadatthā ca pabbajjā, tadadhimuttena. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘samādhādhimuttenā’’"
      },
      "tiādi."
    ],
    "innerText": "Idāni te ajjhāsaye pāḷiyāva vibhāvetuṃ ‘‘yathāhā’’tiādi vuttaṃ. Tattha chāti gaṇanaparicchedo. Ajjhāsayāti paricchinnadhammanidassanaṃ. Ubhayaṃ pana ekajjhaṃ katvā chabbidhā ajjhāsayāti attho. Bodhisattāti bujjhanakasattā, bodhiyā vā niyatabhāvena sattā laggā, adhimuttā tanninnā tappoṇāti attho. Bodhiparipākāya saṃvattantīti yathābhinīhāraṃ attanā pattabbabodhiyā paripācanāya bhavanti. Alobhajjhāsayāti alubbhanākārena pavattaajjhāsayā, ādito ‘‘kathaṃ nu kho mayaṃ sabbattha, sabbadā ca aluddhā eva hessāmā’’ti, majjhe ca alubbhanavaseneva, pacchā ca tasseva rocanavasena pavattaajjhāsayā. Lobhe dosadassāvinoti lubbhanalakkhaṇe lobhe sabbappakārena ādīnavadassāvino. Idaṃ tassa ajjhāsayassa ekadesato brūhanākāradassanaṃ. Lobhe hi ādīnavaṃ, alobhe ca ānisaṃsaṃ passantassa alobhajjhāsayo parivaḍḍhati, svāyaṃ tattha ādīnavānisaṃsadassanavidhi vibhāvitoyeva. Sesapadesupi iminā nayena attho veditabbo. Ayaṃ pana viseso – nekkhammanti idha pabbajjā. Paviveko tadaṅgaviveko, vikkhambhanaviveko, kāyaviveko, cittaviveko ca. Nissaraṇaṃ nibbānaṃ. Sabbabhavagatīsūti sabbesu bhavesu, sabbāsu ca gatīsu. Tadadhimuttatāyāti yadatthaṃ bhāvanānuyogo, yadatthā ca pabbajjā, tadadhimuttena. Tenevāha ‘‘samādhādhimuttenā’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Kiṃ caritosī’’"
      },
      "ti pucchito sace ‘‘na jānāmī’’ti vadeyya, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ke vā te dhammā bahulaṃ samudācarantī’’"
      },
      "ti pucchitabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiṃ vā"
      },
      "ti kiṃ asubhaṃ vā anussatiṭṭhānaṃ vā aññaṃ vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiṃ te manasi karoto phāsu hotī"
      },
      "ti cittassa ekaggabhāvena sukhaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittaṃ namatī"
      },
      "ti pakatiyāva abhirativasena namati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evamādīhī"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena iriyāpathādīnaṃ saṅgaho daṭṭhabbo. Tepi hi na sabbassa ekaṃsato byabhicārino eva. Tathā hi samudācāro pucchitabbo vutto. ‘‘Asukañca asukañca manasikāravidhiṃ katipayadivasaṃ anuyuñjāhī’’ti ca vattabbo."
    ],
    "innerText": "50.‘‘Kiṃ caritosī’’ti pucchito sace ‘‘na jānāmī’’ti vadeyya, ‘‘ke vā te dhammā bahulaṃ samudācarantī’’ti pucchitabbo. Kiṃ vāti kiṃ asubhaṃ vā anussatiṭṭhānaṃ vā aññaṃ vā. Kiṃ te manasi karoto phāsu hotīti cittassa ekaggabhāvena sukhaṃ hoti. Cittaṃ namatīti pakatiyāva abhirativasena namati. Evamādīhīti ādi-saddena iriyāpathādīnaṃ saṅgaho daṭṭhabbo. Tepi hi na sabbassa ekaṃsato byabhicārino eva. Tathā hi samudācāro pucchitabbo vutto. ‘‘Asukañca asukañca manasikāravidhiṃ katipayadivasaṃ anuyuñjāhī’’ti ca vattabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Pakatiyā uggahitakammaṭṭhānassā’’"
      },
      "ti idaṃ yaṃ kammaṭṭhānaṃ gahetukāmo, tattha sajjhāyavasena vā manasikāravasena vā kataparicayaṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekaṃ dve nisajjānī"
      },
      "ti ekaṃ vā dve vā uṇhāsanāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sajjhāyaṃ kāretvā"
      },
      " attano sammukhāva adhīyāpetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dātabbaṃ,"
      },
      " so ce aññattha gantukāmoti adhippāyo. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘santike vasantassā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āgatāgatakkhaṇe kathetabbaṃ,"
      },
      " pavattiṃ sutvāti adhippāyo."
    ],
    "innerText": "‘‘Pakatiyā uggahitakammaṭṭhānassā’’ti idaṃ yaṃ kammaṭṭhānaṃ gahetukāmo, tattha sajjhāyavasena vā manasikāravasena vā kataparicayaṃ sandhāya vuttaṃ. Ekaṃ dve nisajjānīti ekaṃ vā dve vā uṇhāsanāni. Sajjhāyaṃ kāretvā attano sammukhāva adhīyāpetvā dātabbaṃ, so ce aññattha gantukāmoti adhippāyo. Tenāha ‘‘santike vasantassā’’ti. Āgatāgatakkhaṇe kathetabbaṃ, pavattiṃ sutvāti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pathavīkasiṇa"
      },
      "nti ",
      " pathavīkasiṇakammaṭṭhānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katassā"
      },
      "ti katassa kasiṇassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ taṃ ākāra"
      },
      "nti ācariyena kammaṭṭhāne vuccamāne padapadatthādhippāyaopammādikaṃ attano ñāṇassa paccupaṭṭhitaṃ taṃ taṃ ākāraṃ, yaṃ yaṃ nimittanti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upanibandhitvā"
      },
      "ti upanetvā nibaddhaṃ viya katvā, hadaye ṭhapetvā apamussantaṃ katvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      " suṭṭhu upaṭṭhitassatitāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nimittaṃ gahetvā"
      },
      " tattha sampajānakāritāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sakkaccaṃ suṇantena. Ta"
      },
      "nti taṃ yathāvuttaṃ suggahitaṃ nissāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itarassā"
      },
      "ti tathā agaṇhantassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbākārenā"
      },
      "ti kassacipi pakārassa tattha asesitattā vuttaṃ."
    ],
    "innerText": "Pathavīkasiṇanti pathavīkasiṇakammaṭṭhānaṃ. Katassāti katassa kasiṇassa. Taṃ taṃ ākāranti ācariyena kammaṭṭhāne vuccamāne padapadatthādhippāyaopammādikaṃ attano ñāṇassa paccupaṭṭhitaṃ taṃ taṃ ākāraṃ, yaṃ yaṃ nimittanti vuttaṃ. Upanibandhitvāti upanetvā nibaddhaṃ viya katvā, hadaye ṭhapetvā apamussantaṃ katvāti attho. Evaṃ suṭṭhu upaṭṭhitassatitāya nimittaṃ gahetvā tattha sampajānakāritāya sakkaccaṃ suṇantena. Tanti taṃ yathāvuttaṃ suggahitaṃ nissāya. Itarassāti tathā agaṇhantassa. Sabbākārenāti kassacipi pakārassa tattha asesitattā vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kammaṭṭhānaggahaṇaniddesavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti tatiyaparicchedavaṇṇanā."
  }
]