[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammāsambuddhassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "book"
    },
    "innerText": "Visuddhimagga-mahāṭīkā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(Dutiyo bhāgo)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "12. Iddhividhaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Abhiññākathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "365"
      },
      ". Saṃvaṇṇanāvasena ",
      " anantarasamādhikathāya āsannapaccakkhataṃ dīpento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ayaṃ samādhibhāvanā’’"
      },
      "ti āha. ‘‘Abhiññā sampādetuṃ yogo kātabbo’’ti vatvā tattha payojanavisese dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evañhī’’"
      },
      "tiādi vuttaṃ. Kiñcāpi thiratarabhāvo, vipassanābhāvanāsukhatā ca samādhibhāvanāya ānisaṃso eva, tathāpi pañca lokiyābhiññā yathāvuttasamādhibhāvanāya ānisaṃsabhāvena pākaṭā paññātāti tāsaṃyeva vasena yogino adhigatānisaṃsatā vuttā, cuddasadhā cittaparidamanena thirataratā vuttā. Lokiyābhiññāsu vasībhāvopi samādhisseva vasībhāvo, tathā ca ‘‘samāhito yathābhūtaṃ pajānātī’’ti (saṃ. ni. 3.5; 4.99; 5.1071; netti. 40; mi. pa. 2.1.14) vacanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sukheneva paññābhāvanaṃ sampādessatī’’"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      "ti yasmā samādhibhāvanāya ānisaṃsalābho thirataratā, sukheneva ca paññābhāvanā ijjhati, tasmā abhiññākathaṃ tāva ārabhissāma, paññābhāvanāya okāse sampattepīti adhippāyo."
    ],
    "innerText": "365. Saṃvaṇṇanāvasena anantarasamādhikathāya āsannapaccakkhataṃ dīpento ‘‘ayaṃ samādhibhāvanā’’ti āha. ‘‘Abhiññā sampādetuṃ yogo kātabbo’’ti vatvā tattha payojanavisese dassetuṃ ‘‘evañhī’’tiādi vuttaṃ. Kiñcāpi thiratarabhāvo, vipassanābhāvanāsukhatā ca samādhibhāvanāya ānisaṃso eva, tathāpi pañca lokiyābhiññā yathāvuttasamādhibhāvanāya ānisaṃsabhāvena pākaṭā paññātāti tāsaṃyeva vasena yogino adhigatānisaṃsatā vuttā, cuddasadhā cittaparidamanena thirataratā vuttā. Lokiyābhiññāsu vasībhāvopi samādhisseva vasībhāvo, tathā ca ‘‘samāhito yathābhūtaṃ pajānātī’’ti (saṃ. ni. 3.5; 4.99; 5.1071; netti. 40; mi. pa. 2.1.14) vacanato ‘‘sukheneva paññābhāvanaṃ sampādessatī’’ti vuttaṃ. Tasmāti yasmā samādhibhāvanāya ānisaṃsalābho thirataratā, sukheneva ca paññābhāvanā ijjhati, tasmā abhiññākathaṃ tāva ārabhissāma, paññābhāvanāya okāse sampattepīti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhagavatā pañca lokikābhiññā vuttāti sambandho. Na catukkajjhānamattameva idha sāsane sampādetabbaṃ, napi iddhividhañāṇameva, atha kho aññampi atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uttaruttaripaṇītapaṇītadhammadesanatthañca"
      },
      "."
    ],
    "innerText": "Bhagavatā pañca lokikābhiññā vuttāti sambandho. Na catukkajjhānamattameva idha sāsane sampādetabbaṃ, napi iddhividhañāṇameva, atha kho aññampi atthīti uttaruttaripaṇītapaṇītadhammadesanatthañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhivikubbana"
      },
      "nti ",
      " iddhisaṅkhātaṃ pakativaṇṇajahanakiriyaṃ, idaṃ iddhīsu vikubbaniddhiyā padhānatāya vuttaṃ, iddhiṃ vikubbanañcāti evaṃ vā attho daṭṭhabbo. Vikubbanassa visuṃ gahaṇampi vuttakāraṇeneva daṭṭhabbaṃ. Ākāsakasiṇavasena arūpasamāpattiyo na sambhavanti, ālokakasiṇañca odātakasiṇantogadhaṃ katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘odātakasiṇapariyantesū’’"
      },
      "ti vuttaṃ kasiṇānulomādicittaparidamanavidhino adhippetattā, ākāsanimmānādiatthaṃ pana tadubhayampi icchitabbameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭha aṭṭhā"
      },
      "ti yathāvuttesu kasiṇesu ekekasmiṃ aṭṭha aṭṭha samāpattiyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kasiṇānulomato"
      },
      "ti kasiṇapaṭipāṭito, paṭipāṭi ca desanāvasena veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhānānulomo"
      },
      " pana paṭipattivasenapi. Ukkamanaṃ ukkantaṃ, ukkantameva ukkantikaṃ, jhānassa ukkantikaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānukkantikaṃ,"
      },
      " tato, jhānalaṅghanatoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṅgasaṅkantito"
      },
      " aṅgātikkamato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittaṃ paridametabbaṃ"
      },
      " yadicchakaṃ yatthicchakaṃ jhānānaṃ samāpajjanādisukhatthaṃ, tesaṃ ārammaṇānañca sallakkhaṇatthaṃ. Evañhissa tattha visavitā samijjhatīti."
    ],
    "innerText": "Iddhivikubbananti iddhisaṅkhātaṃ pakativaṇṇajahanakiriyaṃ, idaṃ iddhīsu vikubbaniddhiyā padhānatāya vuttaṃ, iddhiṃ vikubbanañcāti evaṃ vā attho daṭṭhabbo. Vikubbanassa visuṃ gahaṇampi vuttakāraṇeneva daṭṭhabbaṃ. Ākāsakasiṇavasena arūpasamāpattiyo na sambhavanti, ālokakasiṇañca odātakasiṇantogadhaṃ katvā ‘‘odātakasiṇapariyantesū’’ti vuttaṃ kasiṇānulomādicittaparidamanavidhino adhippetattā, ākāsanimmānādiatthaṃ pana tadubhayampi icchitabbameva. Aṭṭha aṭṭhāti yathāvuttesu kasiṇesu ekekasmiṃ aṭṭha aṭṭha samāpattiyo. Kasiṇānulomatoti kasiṇapaṭipāṭito, paṭipāṭi ca desanāvasena veditabbā. Jhānānulomo pana paṭipattivasenapi. Ukkamanaṃ ukkantaṃ, ukkantameva ukkantikaṃ, jhānassa ukkantikaṃ jhānukkantikaṃ, tato, jhānalaṅghanatoti attho. Aṅgasaṅkantito aṅgātikkamato. Cittaṃ paridametabbaṃ yadicchakaṃ yatthicchakaṃ jhānānaṃ samāpajjanādisukhatthaṃ, tesaṃ ārammaṇānañca sallakkhaṇatthaṃ. Evañhissa tattha visavitā samijjhatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "366"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhānaṃ samāpajjatī"
      },
      "ti kiṃ catubbidhampi jhānaṃ samāpajjati, udāhu ekekanti? Kiñcettha yadi catubbidhampi samāpajjati, aṅgasaṅkantito viseso na siyā, atha ekekaṃ ārammaṇasaṅkantito. Nāyaṃ doso ābhogavasena tesaṃ visesasiddhito. Yadā hi kasiṇānulomameva ābhujitvā tattha tattha kasiṇe jhānāni samāpajjati, na aṅgasaṅkantiṃ, tadā kasiṇānulomo. Yadā pana aṅgasaṅkantiṃ ābhujitvā jhānāni samāpajjati, tadā aṅgasaṅkanti veditabbā. Iminā nayena kasiṇānulomaārammaṇasaṅkantiādīnampi aññamaññaṃ viseso veditabbo. Idaṃ kasiṇānulomaṃ nāma cittaparidamananti adhippāyo."
    ],
    "innerText": "366.Jhānaṃ samāpajjatīti kiṃ catubbidhampi jhānaṃ samāpajjati, udāhu ekekanti? Kiñcettha yadi catubbidhampi samāpajjati, aṅgasaṅkantito viseso na siyā, atha ekekaṃ ārammaṇasaṅkantito. Nāyaṃ doso ābhogavasena tesaṃ visesasiddhito. Yadā hi kasiṇānulomameva ābhujitvā tattha tattha kasiṇe jhānāni samāpajjati, na aṅgasaṅkantiṃ, tadā kasiṇānulomo. Yadā pana aṅgasaṅkantiṃ ābhujitvā jhānāni samāpajjati, tadā aṅgasaṅkanti veditabbā. Iminā nayena kasiṇānulomaārammaṇasaṅkantiādīnampi aññamaññaṃ viseso veditabbo. Idaṃ kasiṇānulomaṃ nāma cittaparidamananti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathevā"
      },
      "ti ",
      " ‘‘paṭipāṭiyā aṭṭhasu kasiṇesu satakkhattumpi sahassakkhattumpī’’ti etassa upasaṃhārattho tathā-saddo. Paṭilomato cettha paṭipāṭi. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paṭilomakkamenā’’"
      },
      "ti. Ayañhettha attho – paṭhamaṃ odātakasiṇe jhānaṃ samāpajjati, tato lohitakasiṇeti yāva pathavīkasiṇā vattabbā."
    ],
    "innerText": "Tathevāti ‘‘paṭipāṭiyā aṭṭhasu kasiṇesu satakkhattumpi sahassakkhattumpī’’ti etassa upasaṃhārattho tathā-saddo. Paṭilomato cettha paṭipāṭi. Tenāha ‘‘paṭilomakkamenā’’ti. Ayañhettha attho – paṭhamaṃ odātakasiṇe jhānaṃ samāpajjati, tato lohitakasiṇeti yāva pathavīkasiṇā vattabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Punappunaṃ samāpajjana"
      },
      "nti ‘‘satakkhattuṃ sahassakkhattu’’nti vuttaṃ bahulākāramāha."
    ],
    "innerText": "Punappunaṃ samāpajjananti ‘‘satakkhattuṃ sahassakkhattu’’nti vuttaṃ bahulākāramāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthevā"
      },
      "ti ",
      " pathavīkasiṇeyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato"
      },
      "ti pacchā tatiyajjhānato vuṭṭhānantarakālaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadevā"
      },
      "ti pathavīkasiṇameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato ākiñcaññāyatana"
      },
      "nti tato pathavīkasiṇugghāṭimākāse pavattitaākāsānañcāyatanasamāpattito vuṭṭhāya viññāṇañcāyatanaṃ amanasikaritvā taṃ laṅghitvā yathāvuttaākāsānañcāyatanaviññāṇassa abhāve pavattitaṃ ākiñcaññāyatanaṃ samāpajjati. Pathavīkasiṇugghāṭimākāsakasiṇaṃ pathavīkasiṇapakkhikameva hotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kasiṇaṃ anukkamitvā’’"
      },
      "ti. Atha vā aṭṭhasu kasiṇesu kassaci ukkamanaṃ idha kasiṇukkantikaṃ nāmāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kasiṇaṃ anukkamitvā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhānukkantika"
      },
      "nti ettha icchitaṃ avadhāraṇena nivattetabbaṃ, ukkamanassa ca sarūpaṃ dassetuṃ ‘‘evaṃ kasiṇa’’ntiādiṃ vatvā puna taṃ pakāraṃ saha nissayena sesakasiṇesu atidisanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evaṃ āpokasiṇādi…pe… kātabbā’’"
      },
      "ti āha. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘iminā nayenā’’"
      },
      "tiādi. Yathā paṭhamajjhānamūlakaṃ pathavīkasiṇādīsu jhānukkantikaṃ dassitaṃ, evaṃ dutiyajjhānādimūlakampi taṃ yathārahaṃ dassetabbaṃ."
    ],
    "innerText": "Tatthevāti pathavīkasiṇeyeva. Tatoti pacchā tatiyajjhānato vuṭṭhānantarakālaṃ. Tadevāti pathavīkasiṇameva. Tato ākiñcaññāyatananti tato pathavīkasiṇugghāṭimākāse pavattitaākāsānañcāyatanasamāpattito vuṭṭhāya viññāṇañcāyatanaṃ amanasikaritvā taṃ laṅghitvā yathāvuttaākāsānañcāyatanaviññāṇassa abhāve pavattitaṃ ākiñcaññāyatanaṃ samāpajjati. Pathavīkasiṇugghāṭimākāsakasiṇaṃ pathavīkasiṇapakkhikameva hotīti vuttaṃ ‘‘kasiṇaṃ anukkamitvā’’ti. Atha vā aṭṭhasu kasiṇesu kassaci ukkamanaṃ idha kasiṇukkantikaṃ nāmāti āha ‘‘kasiṇaṃ anukkamitvā’’ti. Jhānukkantikanti ettha icchitaṃ avadhāraṇena nivattetabbaṃ, ukkamanassa ca sarūpaṃ dassetuṃ ‘‘evaṃ kasiṇa’’ntiādiṃ vatvā puna taṃ pakāraṃ saha nissayena sesakasiṇesu atidisanto ‘‘evaṃ āpokasiṇādi…pe… kātabbā’’ti āha. Tenāha ‘‘iminā nayenā’’tiādi. Yathā paṭhamajjhānamūlakaṃ pathavīkasiṇādīsu jhānukkantikaṃ dassitaṃ, evaṃ dutiyajjhānādimūlakampi taṃ yathārahaṃ dassetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadevā"
      },
      "ti paṭhamajjhānameva. Kasiṇukkantikepi āpokasiṇādimūlikā yojanā vuttanayeneva kātabbā, tathā yathārahaṃ dutiyajjhānādimūlikā."
    ],
    "innerText": "Tadevāti paṭhamajjhānameva. Kasiṇukkantikepi āpokasiṇādimūlikā yojanā vuttanayeneva kātabbā, tathā yathārahaṃ dutiyajjhānādimūlikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lohitakasiṇato ākiñcaññāyatana"
      },
      "nti lohitakasiṇaṃ āvajjento abhimukhaṃ katvā tassa ugghāṭanena upaṭṭhite kasiṇugghāṭimākāse amanasikārena ākāsānañcāyatanajjhānaṃ samāpajjitvā tattha pubbe pavattaviññāṇassa apagamaṃ ārammaṇaṃ katvā ākiñcaññāyatanaṃ samāpajjati."
    ],
    "innerText": "Lohitakasiṇato ākiñcaññāyatananti lohitakasiṇaṃ āvajjento abhimukhaṃ katvā tassa ugghāṭanena upaṭṭhite kasiṇugghāṭimākāse amanasikārena ākāsānañcāyatanajjhānaṃ samāpajjitvā tattha pubbe pavattaviññāṇassa apagamaṃ ārammaṇaṃ katvā ākiñcaññāyatanaṃ samāpajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itaresa"
      },
      "nti avasiṭṭharūpāvacarajjhānānaṃ. Na hi arūpajjhānesu aṅgasaṅkanti atthi, nāpi tāni ",
      " pathavīkasiṇe pavattanti. Yaṃ pana aṅgārammaṇasaṅkantivacane ‘‘nīlakasiṇaṃ ugghāṭetvā ākāsānañcāyatana’’ntiādi vuttaṃ, taṃ yathālābhavasena vuttaṃ, pariyāyena vāti daṭṭhabbaṃ. Nippariyāyato pana yathā aṅgasaṅkanti rūpajjhānesu eva labbhati, evaṃ arūpajjhānesu eva ārammaṇasaṅkanti. Tassa tasseva hi jhānassa ārammaṇantare pavatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇasaṅkanti"
      },
      ". Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sabbakasiṇesu ekasseva jhānassa samāpajjanaṃ ārammaṇasaṅkantikaṃ nāmā’’"
      },
      "ti."
    ],
    "innerText": "Itaresanti avasiṭṭharūpāvacarajjhānānaṃ. Na hi arūpajjhānesu aṅgasaṅkanti atthi, nāpi tāni pathavīkasiṇe pavattanti. Yaṃ pana aṅgārammaṇasaṅkantivacane ‘‘nīlakasiṇaṃ ugghāṭetvā ākāsānañcāyatana’’ntiādi vuttaṃ, taṃ yathālābhavasena vuttaṃ, pariyāyena vāti daṭṭhabbaṃ. Nippariyāyato pana yathā aṅgasaṅkanti rūpajjhānesu eva labbhati, evaṃ arūpajjhānesu eva ārammaṇasaṅkanti. Tassa tasseva hi jhānassa ārammaṇantare pavatti ārammaṇasaṅkanti. Tenāha ‘‘sabbakasiṇesu ekasseva jhānassa samāpajjanaṃ ārammaṇasaṅkantikaṃ nāmā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā ",
      " pana ‘‘sabbakasiṇesū’’ti iminā ākāsaviññāṇakasiṇānampi saṅgaho hotīti na sakkā vattuṃ idha aṭṭhannaṃyeva kasiṇānaṃ adhigatattā, evaṃ sabbampi arūpajjhānaṃ ‘‘ekaṃ jhāna’’nti na sakkā vattuṃ aṭṭhannaṃ samāpattīnaṃ vasena cittaparidamanassa icchitattā. Tasmā āruppajjhānānaṃ vasena aṅgārammaṇasaṅkanti pariyāyena vuttāti veditabbaṃ. Tathā hi pītakasiṇugghāṭimākāse yaṃ paṭhamāruppaviññāṇaṃ, tadārammaṇaṃ viññāṇañcāyatanaṃ sandhāyāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pītakasiṇato viññāṇañcāyatanaṃ samāpajjitvā’’"
      },
      "ti. Iminā nayena sesadvayepi attho veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekantarikavasenā"
      },
      "ti aññattho antara-saddo. Antarameva antarikaṃ, ekajjhaṃ antarikaṃ etasminti ekantarikaṃ, jhānasamāpajjanaṃ, tassa vasena. Yathā aṅgānaṃ, ārammaṇassa ca ekajjhaṃ aññathā viseso hoti, tathā samāpajjanavasenāti. So pana viseso heṭṭhimānaṃ tesaṃ aṅgārammaṇānaṃ samatikkamanavasena hotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ekantarikavasena aṅgānañca ārammaṇānañca saṅkamana’’"
      },
      "nti. ‘‘Idaṃ jhānaṃ pañcaṅgika’’ntiādinā aṅgesu, ‘‘idaṃ pathavīkasiṇa’’ntiādinā ārammaṇesu ca vavatthāpitesu ekajjhaṃ tesaṃ vavatthāpane na koci viseso atthīti aṭṭhakathāsu ayaṃ vidhi nābhato. Evañca katvā jhānukkantikādīsu paṭilomakkamena, anulomapaṭilomakkamena ca ekantarikabhāvena labbhamānampi jhānādīnaṃ ukkamanaṃ na uddhaṭaṃ, tehi nayehi vināpi cittaparidamanaṃ ijjhatīti papañcaparihāratthaṃ vā te aṭṭhakathāsu anāgatāti daṭṭhabbaṃ."
    ],
    "innerText": "Yathā pana ‘‘sabbakasiṇesū’’ti iminā ākāsaviññāṇakasiṇānampi saṅgaho hotīti na sakkā vattuṃ idha aṭṭhannaṃyeva kasiṇānaṃ adhigatattā, evaṃ sabbampi arūpajjhānaṃ ‘‘ekaṃ jhāna’’nti na sakkā vattuṃ aṭṭhannaṃ samāpattīnaṃ vasena cittaparidamanassa icchitattā. Tasmā āruppajjhānānaṃ vasena aṅgārammaṇasaṅkanti pariyāyena vuttāti veditabbaṃ. Tathā hi pītakasiṇugghāṭimākāse yaṃ paṭhamāruppaviññāṇaṃ, tadārammaṇaṃ viññāṇañcāyatanaṃ sandhāyāha ‘‘pītakasiṇato viññāṇañcāyatanaṃ samāpajjitvā’’ti. Iminā nayena sesadvayepi attho veditabbo. Ekantarikavasenāti aññattho antara-saddo. Antarameva antarikaṃ, ekajjhaṃ antarikaṃ etasminti ekantarikaṃ, jhānasamāpajjanaṃ, tassa vasena. Yathā aṅgānaṃ, ārammaṇassa ca ekajjhaṃ aññathā viseso hoti, tathā samāpajjanavasenāti. So pana viseso heṭṭhimānaṃ tesaṃ aṅgārammaṇānaṃ samatikkamanavasena hotīti vuttaṃ ‘‘ekantarikavasena aṅgānañca ārammaṇānañca saṅkamana’’nti. ‘‘Idaṃ jhānaṃ pañcaṅgika’’ntiādinā aṅgesu, ‘‘idaṃ pathavīkasiṇa’’ntiādinā ārammaṇesu ca vavatthāpitesu ekajjhaṃ tesaṃ vavatthāpane na koci viseso atthīti aṭṭhakathāsu ayaṃ vidhi nābhato. Evañca katvā jhānukkantikādīsu paṭilomakkamena, anulomapaṭilomakkamena ca ekantarikabhāvena labbhamānampi jhānādīnaṃ ukkamanaṃ na uddhaṭaṃ, tehi nayehi vināpi cittaparidamanaṃ ijjhatīti papañcaparihāratthaṃ vā te aṭṭhakathāsu anāgatāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "367"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhāvitabhāvano"
      },
      " jhānābhiññāsu akatādhikāro. Tattha upanissayarahitopīti keci. Ādibhūtaṃ yogakammaṃ ādikammaṃ, taṃ etassa atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādikammiko,"
      },
      " pubbe akataparicayo bhāvanaṃ anuyuñjanto. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yogāvacaro’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kasiṇaparikammampi bhāro"
      },
      "ti dosavivajjanādividhinā kasiṇamaṇḍale paṭipatti yāva uggahanimittuppatti kasiṇaparikammaṃ, tampi nāma bhāro, pageva iddhivikubbanāti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nimittuppādana"
      },
      "nti paṭibhāganimittuppādanaṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ vaḍḍhetvā"
      },
      "ti taṃ nimittaṃ, bhāvanañca vaḍḍhetvā. Na hi bhāvanāya vināva nimittavaḍḍhanaṃ labbhati. Keci upacārasamādhiṃ labhitvā appanāsamādhiṃ adhigantuṃ na sakkonti, tādisāpi bahū hontevāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘appanādhigamo bhāro’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appanādhigamo"
      },
      "ti vā aṭṭhannaṃ samāpattīnaṃ adhigamamāha. Aññova samāpattīnaṃ upanissayo ",
      ", añño abhiññānanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paridamitacittassāpi iddhivikubbanaṃ nāma bhāro’’"
      },
      "ti. Khippaṃ nisanti nisāmanaṃ jhānacakkhunā pathavīkasiṇādijhānārammaṇassa dassanaṃ etassāti khippanisanti, sīghataraṃ jhānaṃ samāpajjitā, tassa bhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khippanisantibhāvo"
      },
      ". Ambatarunicitaṃ mahāmahindattherādīhi otiṇṇaṭṭhānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "therambatthalaṃ"
      },
      ". Yathā paṭipakkhavijayāya yodhājīvā nimmalameva asitomarādiṃ gahetvā vicaranti, evaṃ bhikkhunāpi kilesavijayāya nimmalāva jhānābhiññā vaḷañjitabbāti imamatthaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tasmā’’"
      },
      "tiādi vuttaṃ."
    ],
    "innerText": "367.Abhāvitabhāvano jhānābhiññāsu akatādhikāro. Tattha upanissayarahitopīti keci. Ādibhūtaṃ yogakammaṃ ādikammaṃ, taṃ etassa atthīti ādikammiko, pubbe akataparicayo bhāvanaṃ anuyuñjanto. Tenāha ‘‘yogāvacaro’’ti. Kasiṇaparikammampi bhāroti dosavivajjanādividhinā kasiṇamaṇḍale paṭipatti yāva uggahanimittuppatti kasiṇaparikammaṃ, tampi nāma bhāro, pageva iddhivikubbanāti adhippāyo. Nimittuppādananti paṭibhāganimittuppādanaṃ . Taṃ vaḍḍhetvāti taṃ nimittaṃ, bhāvanañca vaḍḍhetvā. Na hi bhāvanāya vināva nimittavaḍḍhanaṃ labbhati. Keci upacārasamādhiṃ labhitvā appanāsamādhiṃ adhigantuṃ na sakkonti, tādisāpi bahū hontevāti āha ‘‘appanādhigamo bhāro’’ti. Appanādhigamoti vā aṭṭhannaṃ samāpattīnaṃ adhigamamāha. Aññova samāpattīnaṃ upanissayo , añño abhiññānanti āha ‘‘paridamitacittassāpi iddhivikubbanaṃ nāma bhāro’’ti. Khippaṃ nisanti nisāmanaṃ jhānacakkhunā pathavīkasiṇādijhānārammaṇassa dassanaṃ etassāti khippanisanti, sīghataraṃ jhānaṃ samāpajjitā, tassa bhāvo khippanisantibhāvo. Ambatarunicitaṃ mahāmahindattherādīhi otiṇṇaṭṭhānaṃ therambatthalaṃ. Yathā paṭipakkhavijayāya yodhājīvā nimmalameva asitomarādiṃ gahetvā vicaranti, evaṃ bhikkhunāpi kilesavijayāya nimmalāva jhānābhiññā vaḷañjitabbāti imamatthaṃ dassetuṃ ‘‘tasmā’’tiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patiṭṭhābhāvo"
      },
      "ti idha parassa upaddavūpasamanaṃ adhippetaṃ. Taṃ hi khippanisantibhāvatopi garutaraṃ accāyikakiccasādhanavasena vidhātabbato durabhisambhavatarattā. Taṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rakkhitatthera"
      },
      "nidassaneneva siddhampi tato garutarena aṅgāravassaparittāṇena vibhāvetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘giribhaṇḍavāhanapūjāya…pe… thero viyā’’"
      },
      "ti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Giribhaṇḍavāhanapūjā"
      },
      " nāma cetiyagirimādiṃ katvā sakaladīpe, samudde ca yāva yojanā mahatī dīpapūjā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pathaviṃ māpetvā"
      },
      "ti mārena pavattitaṃ aṅgāravassaṃ phuliṅgamattenapi yāva manusse na pāpuṇāti, tāvadeva ākāse pathaviṃ nimminitvā."
    ],
    "innerText": "Patiṭṭhābhāvoti idha parassa upaddavūpasamanaṃ adhippetaṃ. Taṃ hi khippanisantibhāvatopi garutaraṃ accāyikakiccasādhanavasena vidhātabbato durabhisambhavatarattā. Taṃ pana rakkhitattheranidassaneneva siddhampi tato garutarena aṅgāravassaparittāṇena vibhāvetuṃ ‘‘giribhaṇḍavāhanapūjāya…pe… thero viyā’’ti āha. Giribhaṇḍavāhanapūjā nāma cetiyagirimādiṃ katvā sakaladīpe, samudde ca yāva yojanā mahatī dīpapūjā. Pathaviṃ māpetvāti mārena pavattitaṃ aṅgāravassaṃ phuliṅgamattenapi yāva manusse na pāpuṇāti, tāvadeva ākāse pathaviṃ nimminitvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Balavapubbayogāna"
      },
      "nti garutarūpanissayānaṃ, iddhividhādīnaṃ hetubhūtamahābhinīhārānanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aggasāvakādīna"
      },
      "nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena ekacce mahāsāvake saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvanānukkamo"
      },
      " yathāvuttaṃ cittaparidamanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisambhidādī"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena ṭhānāṭhānañāṇādīnampi saṅgaho veditabbo, na sesābhiññānameva. Sāvakānampi hi ṭhānāṭhānañāṇādīni padesavasena ijjhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      "ti yasmā pubbahetusampannasseva yathāvuttaṃ bhāvanānukkamaṃ vinā abhiññāyo ijjhanti, na itarassa, tasmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aggidhamanādīhī"
      },
      "ti aggimhi tāpanakoṭṭanādīhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā cā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca"
      },
      "-saddena lākhākārādīnaṃ lākhākoṭṭanādiṃ avuttampi saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chanda…pe… vasenā"
      },
      "ti ‘‘chandavato ce abhiññā sijjhati, mayhampi sijjhatī’’ti kattukamyatāchandaṃ sīsaṃ dhuraṃ jeṭṭhaṃ pubbaṅgamaṃ katvā, chandaṃ vā uppādetvā taṃ bhāvanāya mukhaṃ katvā jhānassa samāpajjanavasena. Eseva ",
      " nayo sesesupi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Āvajjanādivasībhāvavasenā’’"
      },
      "ti idaṃ aṭṭhasupi samāpattīsu sātisayaṃ vasībhāvāpādanaṃ sandhāya vuttaṃ. Tañca kho ādikammikavasena, na ",
      " katādhikāravasenāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pubbahetu…pe… vaṭṭatī’’"
      },
      "ti. Pubbahetusampannassa hi yaṃ jhānaṃ pādakaṃ katvā abhiññā nibbattetabbā, tattheva sātisayaṃ ciṇṇavasitāpi icchitabbā, na sabbatthevāti adhippāyo. ‘‘Catutthajjhānamatte ciṇṇavasinā’’ti vacanato arūpasamāpattiyo vināpi abhiññā ijjhantīti vadanti. Tampi yadi pubbahetusampannassa vasena vuttaṃ, yuttameva. Athetarassa, tesaṃ matimattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā"
      },
      "ti yena pakārena yena vidhinā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etthā"
      },
      "ti etasmiṃ iddhividhanipphādane."
    ],
    "innerText": "Balavapubbayogānanti garutarūpanissayānaṃ, iddhividhādīnaṃ hetubhūtamahābhinīhārānanti attho. Aggasāvakādīnanti ādi-saddena ekacce mahāsāvake saṅgaṇhāti. Bhāvanānukkamo yathāvuttaṃ cittaparidamanaṃ. Paṭisambhidādīti ādi-saddena ṭhānāṭhānañāṇādīnampi saṅgaho veditabbo, na sesābhiññānameva. Sāvakānampi hi ṭhānāṭhānañāṇādīni padesavasena ijjhanti. Tasmāti yasmā pubbahetusampannasseva yathāvuttaṃ bhāvanānukkamaṃ vinā abhiññāyo ijjhanti, na itarassa, tasmā. Aggidhamanādīhīti aggimhi tāpanakoṭṭanādīhi. Yathā cāti ca-saddena lākhākārādīnaṃ lākhākoṭṭanādiṃ avuttampi saṅgaṇhāti. Chanda…pe… vasenāti ‘‘chandavato ce abhiññā sijjhati, mayhampi sijjhatī’’ti kattukamyatāchandaṃ sīsaṃ dhuraṃ jeṭṭhaṃ pubbaṅgamaṃ katvā, chandaṃ vā uppādetvā taṃ bhāvanāya mukhaṃ katvā jhānassa samāpajjanavasena. Eseva nayo sesesupi. ‘‘Āvajjanādivasībhāvavasenā’’ti idaṃ aṭṭhasupi samāpattīsu sātisayaṃ vasībhāvāpādanaṃ sandhāya vuttaṃ. Tañca kho ādikammikavasena, na katādhikāravasenāti āha ‘‘pubbahetu…pe… vaṭṭatī’’ti. Pubbahetusampannassa hi yaṃ jhānaṃ pādakaṃ katvā abhiññā nibbattetabbā, tattheva sātisayaṃ ciṇṇavasitāpi icchitabbā, na sabbatthevāti adhippāyo. ‘‘Catutthajjhānamatte ciṇṇavasinā’’ti vacanato arūpasamāpattiyo vināpi abhiññā ijjhantīti vadanti. Tampi yadi pubbahetusampannassa vasena vuttaṃ, yuttameva. Athetarassa, tesaṃ matimattaṃ. Yathāti yena pakārena yena vidhinā. Etthāti etasmiṃ iddhividhanipphādane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "368"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatrā"
      },
      "ti ca tadeva paccāmasati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāḷinayānusārenevā"
      },
      "ti pāḷigatiyā anusaraṇeneva, pāṭhasaṃvaṇṇanānukkamenevāti attho. ‘‘Catutthajjhānaṃ upasampajja viharatī’’ti vatvā ‘‘so’’ti vuttattā āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘adhigatacatutthajjhāno yogī’’"
      },
      "ti. ‘‘Evaṃ samāhite’’ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "evaṃ"
      },
      "-saddo heṭṭhājhānattayādhigamapaṭipāṭisiddhassa catutthajjhānasamādhānassa nidassanatthoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evanti catutthajjhānakkamanidassanameta’’"
      },
      "nti, catutthajjhānassa, tassa ca adhigamakkamassa nidassanaṃ. Yena samādhānānukkamena catutthajjhānasamādhi laddho, tadubhayanidassananti attho. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘iminā…pe… vuttaṃ hotī’’"
      },
      "ti. Yadipi ‘‘eva’’nti idaṃ āgamanasamādhinā saddhiṃ catutthajjhānasamādhānaṃ dīpeti. Satipārisuddhisamādhi eva pana iddhiyā adhiṭṭhānabhāvato padhānanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘catutthajjhānasamādhinā samāhite’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upekkhāsatipārisuddhibhāvenā"
      },
      "ti upekkhāya janitasatipārisuddhisabbhāvena. Sabbapaccanīkadhammūpakkilesaparisuddhāya hi paccanīkasamanepi abyāvaṭāya pārisuddhiupekkhāya vattamānāya catutthajjhānaṃ, taṃsampayuttadhammā ca suparisuddhā, suvisadā ca honti, satisīsena pana tattha desanā katāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘upekkhāsatipārisuddhibhāvena parisuddhe’’"
      },
      "ti. Parisuddhiyā eva paccayavisesena pavattiviseso pariyodātatā sudhantasuvaṇṇassa nighaṃsanena pabhassaratā viyāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘parisuddhattāyeva pariyodāte, pabhassareti vuttaṃ hotī’’"
      },
      "ti."
    ],
    "innerText": "368.Tatrāti ca tadeva paccāmasati. Pāḷinayānusārenevāti pāḷigatiyā anusaraṇeneva, pāṭhasaṃvaṇṇanānukkamenevāti attho. ‘‘Catutthajjhānaṃ upasampajja viharatī’’ti vatvā ‘‘so’’ti vuttattā āha ‘‘adhigatacatutthajjhāno yogī’’ti. ‘‘Evaṃ samāhite’’ti ettha evaṃ-saddo heṭṭhājhānattayādhigamapaṭipāṭisiddhassa catutthajjhānasamādhānassa nidassanatthoti āha ‘‘evanti catutthajjhānakkamanidassanameta’’nti, catutthajjhānassa, tassa ca adhigamakkamassa nidassanaṃ. Yena samādhānānukkamena catutthajjhānasamādhi laddho, tadubhayanidassananti attho. Tenāha ‘‘iminā…pe… vuttaṃ hotī’’ti. Yadipi ‘‘eva’’nti idaṃ āgamanasamādhinā saddhiṃ catutthajjhānasamādhānaṃ dīpeti. Satipārisuddhisamādhi eva pana iddhiyā adhiṭṭhānabhāvato padhānanti āha ‘‘catutthajjhānasamādhinā samāhite’’ti. Upekkhāsatipārisuddhibhāvenāti upekkhāya janitasatipārisuddhisabbhāvena. Sabbapaccanīkadhammūpakkilesaparisuddhāya hi paccanīkasamanepi abyāvaṭāya pārisuddhiupekkhāya vattamānāya catutthajjhānaṃ, taṃsampayuttadhammā ca suparisuddhā, suvisadā ca honti, satisīsena pana tattha desanā katāti āha ‘‘upekkhāsatipārisuddhibhāvena parisuddhe’’ti. Parisuddhiyā eva paccayavisesena pavattiviseso pariyodātatā sudhantasuvaṇṇassa nighaṃsanena pabhassaratā viyāti āha ‘‘parisuddhattāyeva pariyodāte, pabhassareti vuttaṃ hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhādīnaṃ paccayānaṃ ghātenā"
      },
      "ti sukhasomanassānaṃ, dukkhadomanassānañca yathākkamaṃ rāgadosapaccayānaṃ vikkhambhanena. ‘‘Sukhaṃ somanassassa paccayo, somanassaṃ rāgassa, dukkhaṃ domanassassā’’ti hi vuttaṃ. Yathā rāgādayo cetaso malāsucibhāvena ‘‘aṅgaṇānī’’ti vuccanti, evaṃ upagantvā ",
      " kilesanaṭṭhena upakkilesāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘anaṅgaṇattāyeva vigatūpakkilese’’"
      },
      "ti. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘aṅgaṇena hi taṃ cittaṃ upakkilissatī’’"
      },
      "ti, vibādhīyati upatāpīyatīti ",
      " attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Subhāvitattā"
      },
      "ti paguṇabhāvāpādanena suṭṭhu bhāvitattā. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vasībhāvappatte’’"
      },
      "ti, āvajjanādinā pañcadhā, cuddasavidhena vā paridamanena vasavattitaṃ upagateti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vase vattamānaṃ hi cittaṃ"
      },
      " paguṇabhāvāpattiyā suparimadditaṃ viya cammaṃ, suparikammakatā viya ca lākhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mudunti vuccati. Kammakkhame"
      },
      "ti vikubbanādiiddhikammakkhame. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tañca ubhaya"
      },
      "nti mudutākammaniyadvayaṃ."
    ],
    "innerText": "Sukhādīnaṃ paccayānaṃ ghātenāti sukhasomanassānaṃ, dukkhadomanassānañca yathākkamaṃ rāgadosapaccayānaṃ vikkhambhanena. ‘‘Sukhaṃ somanassassa paccayo, somanassaṃ rāgassa, dukkhaṃ domanassassā’’ti hi vuttaṃ. Yathā rāgādayo cetaso malāsucibhāvena ‘‘aṅgaṇānī’’ti vuccanti, evaṃ upagantvā kilesanaṭṭhena upakkilesāti āha ‘‘anaṅgaṇattāyeva vigatūpakkilese’’ti. Tenāha ‘‘aṅgaṇena hi taṃ cittaṃ upakkilissatī’’ti, vibādhīyati upatāpīyatīti attho. Subhāvitattāti paguṇabhāvāpādanena suṭṭhu bhāvitattā. Tenāha ‘‘vasībhāvappatte’’ti, āvajjanādinā pañcadhā, cuddasavidhena vā paridamanena vasavattitaṃ upagateti attho. Vase vattamānaṃ hi cittaṃ paguṇabhāvāpattiyā suparimadditaṃ viya cammaṃ, suparikammakatā viya ca lākhā mudunti vuccati. Kammakkhameti vikubbanādiiddhikammakkhame. Tañca ubhayanti mudutākammaniyadvayaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāha"
      },
      "ntiādīsu na-kāro paṭisedhattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aha"
      },
      "nti satthā attānaṃ niddisati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhave"
      },
      "ti bhikkhū ālapati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Añña"
      },
      "nti idāni vuccamānacittato aññaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekadhammampī"
      },
      "ti ekampi sabhāvadhammaṃ na samanupassāmīti sambandho. Ayaṃ hettha attho – ahaṃ, bhikkhave, sabbaññutaññāṇena olokentopi aññaṃ ekadhammampi na samanupassāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ"
      },
      " vasībhāvāpādanena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhāvitaṃ,"
      },
      " tathā punappunaṃ karaṇena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahulīkataṃ,"
      },
      " evaṃ savisesamudubhāvappattiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "muduṃ,"
      },
      " kammakkhamatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaniya"
      },
      "ñca hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathayidaṃ citta"
      },
      "nti attano, tesañca paccakkhatāya evamāhāti. Yathā yathāvuttā parisuddhatādayo na vigacchanti, evaṃ subhāvitaṃ cittaṃ."
    ],
    "innerText": "Nāhantiādīsu na-kāro paṭisedhattho. Ahanti satthā attānaṃ niddisati. Bhikkhaveti bhikkhū ālapati. Aññanti idāni vuccamānacittato aññaṃ. Ekadhammampīti ekampi sabhāvadhammaṃ na samanupassāmīti sambandho. Ayaṃ hettha attho – ahaṃ, bhikkhave, sabbaññutaññāṇena olokentopi aññaṃ ekadhammampi na samanupassāmi. Yaṃ vasībhāvāpādanena bhāvitaṃ, tathā punappunaṃ karaṇena bahulīkataṃ, evaṃ savisesamudubhāvappattiyā muduṃ, kammakkhamatāya kammaniyañca hoti. Yathayidaṃ cittanti attano, tesañca paccakkhatāya evamāhāti. Yathā yathāvuttā parisuddhatādayo na vigacchanti, evaṃ subhāvitaṃ cittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha avaṭṭhitaṃ idha ‘‘ṭhitaṃ, āneñjappatta’’nti ca vuttanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘etesu parisuddhatādīsu ṭhitattā ṭhite, ṭhitattāyeva āneñjappatte’’"
      },
      "ti. Yathā mudukammaññatā vasībhāvappattiyā lakkhīyanti, evaṃ vasībhāvappattipi mudukammaññatāhi lakkhīyatīti, mudukammaññabhāvena vā attano vase ṭhitattā ‘‘ṭhite’’ti vuttaṃ. Yathā hi kāraṇena phalaṃ niddharīyati, evaṃ phalenāpi kāraṇaṃ niddharīyatīti niccalabhāvena avaṭṭhānaṃ āneñjappatti. Sā ca sampayuttadhammesu thirabhāvena, paṭipakkhehi akammaniyatāya ca sambhavantī saddhādibalānaṃ ānubhāvena hotīti ‘‘saddhādīhi pariggahitattā āneñjappatte’’ti saṅkhepato vuttamatthaṃ vivarituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘saddhāpariggahitaṃ hī’’"
      },
      "tiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddhāpariggahita"
      },
      "nti evaṃ subhāvitaṃ vasībhāvappattaṃ etaṃ cittaṃ ekaṃsena abhiññāsacchikaraṇīyānaṃ dhammānaṃ abhiññāsacchikiriyāya saṃvattatīti evaṃ pavattāya saddhāya pariggahitaṃ yathāvuttasaddhābalena upatthambhitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assaddhiyenā"
      },
      "ti tappaṭipakkhena assaddhiyena hetunā na iñjati na calati na kampati, aññadatthu upari visesāvahabhāveneva tiṭṭhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vīriyapariggahita"
      },
      "ntiādīsupi ",
      " iminā nayena attho veditabbo. Ayaṃ pana viseso – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vīriyapariggahita"
      },
      "nti vasībhāvāpādanaparidamanasādhanena vīriyena upatthambhitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satipariggahita"
      },
      "nti yathāvutte bhāvanābahulīkāre asammosasādhikāya, kusalānañca dhammānaṃ gatiyo samannesamānāya satiyā ",
      " upatthambhitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādhipariggahita"
      },
      "nti tattheva avikkhepasādhanena samādhānena upatthambhitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāpariggahita"
      },
      "nti tassā eva bhāvanāya upakārānupakāradhammānaṃ pajānanalakkhaṇāya paññāya upatthambhitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Obhāsagata"
      },
      "nti ñāṇobhāsasahagataṃ. Obhāsabhūtena hi yathāvuttasamādhānasaṃvaddhitena ñāṇena saṃkilesapakkhaṃ yāthāvato passanto tato utrasanto ottappanto taṃ adhibhavati, na tena abhibhūyati. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kilesandhakārena na iñjatī’’"
      },
      "ti. Etena ñāṇapariggahitaṃ hirottappabalaṃ dasseti."
    ],
    "innerText": "Tattha avaṭṭhitaṃ idha ‘‘ṭhitaṃ, āneñjappatta’’nti ca vuttanti āha ‘‘etesu parisuddhatādīsu ṭhitattā ṭhite, ṭhitattāyeva āneñjappatte’’ti. Yathā mudukammaññatā vasībhāvappattiyā lakkhīyanti, evaṃ vasībhāvappattipi mudukammaññatāhi lakkhīyatīti, mudukammaññabhāvena vā attano vase ṭhitattā ‘‘ṭhite’’ti vuttaṃ. Yathā hi kāraṇena phalaṃ niddharīyati, evaṃ phalenāpi kāraṇaṃ niddharīyatīti niccalabhāvena avaṭṭhānaṃ āneñjappatti. Sā ca sampayuttadhammesu thirabhāvena, paṭipakkhehi akammaniyatāya ca sambhavantī saddhādibalānaṃ ānubhāvena hotīti ‘‘saddhādīhi pariggahitattā āneñjappatte’’ti saṅkhepato vuttamatthaṃ vivarituṃ ‘‘saddhāpariggahitaṃ hī’’tiādi vuttaṃ. Tattha saddhāpariggahitanti evaṃ subhāvitaṃ vasībhāvappattaṃ etaṃ cittaṃ ekaṃsena abhiññāsacchikaraṇīyānaṃ dhammānaṃ abhiññāsacchikiriyāya saṃvattatīti evaṃ pavattāya saddhāya pariggahitaṃ yathāvuttasaddhābalena upatthambhitaṃ. Assaddhiyenāti tappaṭipakkhena assaddhiyena hetunā na iñjati na calati na kampati, aññadatthu upari visesāvahabhāveneva tiṭṭhati. Vīriyapariggahitantiādīsupi iminā nayena attho veditabbo. Ayaṃ pana viseso – vīriyapariggahitanti vasībhāvāpādanaparidamanasādhanena vīriyena upatthambhitaṃ. Satipariggahitanti yathāvutte bhāvanābahulīkāre asammosasādhikāya, kusalānañca dhammānaṃ gatiyo samannesamānāya satiyā upatthambhitaṃ. Samādhipariggahitanti tattheva avikkhepasādhanena samādhānena upatthambhitaṃ. Paññāpariggahitanti tassā eva bhāvanāya upakārānupakāradhammānaṃ pajānanalakkhaṇāya paññāya upatthambhitaṃ. Obhāsagatanti ñāṇobhāsasahagataṃ. Obhāsabhūtena hi yathāvuttasamādhānasaṃvaddhitena ñāṇena saṃkilesapakkhaṃ yāthāvato passanto tato utrasanto ottappanto taṃ adhibhavati, na tena abhibhūyati. Tenāha ‘‘kilesandhakārena na iñjatī’’ti. Etena ñāṇapariggahitaṃ hirottappabalaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhaṅgasamannāgata"
      },
      "nti catutthajjhānasamādhinā samāhitatā, parisuddhatā, pariyodātatā, anaṅgaṇatā, vigatūpakkilesatā, mudubhāvo, kammaniyatā, āneñjappattiyā ṭhitatā, samāhitassa vā cittassa imāni aṅgānīti ‘‘samāhite’’ti imaṃ aṅgabhāvena aggahetvā ṭhitiāneñjappattiyo visuṃ gahetvā imehi aṭṭhahi aṅgehi samannāgataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhinīhārakkhama"
      },
      "nti iddhividhādiatthaṃ abhinīhārakkhamaṃ tadabhimukhaṃ karaṇayoggaṃ. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘abhiññāsacchikaraṇīyānaṃ dhammānaṃ abhiññāsacchikiriyāyā’’"
      },
      "ti."
    ],
    "innerText": "Aṭṭhaṅgasamannāgatanti catutthajjhānasamādhinā samāhitatā, parisuddhatā, pariyodātatā, anaṅgaṇatā, vigatūpakkilesatā, mudubhāvo, kammaniyatā, āneñjappattiyā ṭhitatā, samāhitassa vā cittassa imāni aṅgānīti ‘‘samāhite’’ti imaṃ aṅgabhāvena aggahetvā ṭhitiāneñjappattiyo visuṃ gahetvā imehi aṭṭhahi aṅgehi samannāgataṃ. Abhinīhārakkhamanti iddhividhādiatthaṃ abhinīhārakkhamaṃ tadabhimukhaṃ karaṇayoggaṃ. Tenāha ‘‘abhiññāsacchikaraṇīyānaṃ dhammānaṃ abhiññāsacchikiriyāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kāmaṃ nīvaraṇāni vikkhambhetvā eva paṭhamajjhānasamadhigamo, vitakkādike vūpasame eva ca dutiyajjhānādisamadhigamo, tathāpi na tathā tehi dūrībhūtā apetā vā yathā catutthajjhānato, cetaso malīnabhāvasaṅkhātauppilābhogakarehi nīvaraṇādīhi suṭṭhu vimuttiyā tassa parisuddhi, pariyodātatā ca yuttāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘nīvaraṇa…pe… pariyodāte’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhānapaṭilābhapaccayāna"
      },
      "nti jhānapaṭilābhahetukānaṃ jhānapaṭilābhaṃ nissāya uppajjanakānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpakāna"
      },
      "nti lāmakānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Icchāvacarāna"
      },
      "nti icchāya avacarānaṃ icchāvasena otiṇṇānaṃ ‘‘aho vata mameva satthā paṭipucchitvā paṭipucchitvā bhikkhūnaṃ dhammaṃ deseyyā’’tiādinayappavattānaṃ mānamāyāsāṭheyyādīnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhijjhādīna"
      },
      "nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddenāpi tesaṃyeva saṅgaho. Abhijjhā cettha paṭhamajjhānena avikkhambhaneyyā, mānādayo ca tadekaṭṭhā daṭṭhabbā ",
      " ‘‘jhānapaṭilābhapaccayāna’’nti anuvattamānattā. Vikkhambhaneyyā pana nīvaraṇaggahaṇeneva gahitā, kathaṃ pana paṭhamajjhānena avikkhambhaneyyā idha vigacchantīti? ‘‘Sabbe kusalā dhammā sabbākusalānaṃ paṭipakkhā’’ti sallekhapaṭipattivasena evaṃ vuttaṃ jhānassa aparāmaṭṭhabhāvadassanato. Ye panettha ‘‘icchāvacarānaṃ abhijjhādīna’’nti imehi padehi kopaapaccayakaāmarāgabyāpādādayo gahitāti adhippāyena ‘‘jhānapaṭilābhapaccayāna’’nti pāṭhaṃ paṭikkhipitvā ‘‘jhānapaṭilābhapaccanīkāna’’nti ",
      " pāṭhoti vadanti, taṃ tesaṃ matimattaṃ tathā pāṭhasseva abhāvato. Jhānapaṭilābhapaccanīkā ca nīvaraṇā ceva tadekaṭṭhā ca tesaṃ dūrībhāvaṃ vatvā puna abhāvavigamacodanāya ayujjamānattā. Nanu ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anaṅgaṇasutta-"
      },
      " (ma. ni. 1.57 ādayo) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vatthasuttesu"
      },
      " (ma. ni. 1.70 ādayo) ayamattho na labbhati, oḷārikānaṃyeva pāpadhammānaṃ tattha adhippetattā? Saccametaṃ, idha pana adhigatacatutthajjhānassa vasena vuttattā sukhumāyeva te gahitā, aṅgaṇūpakkilesatāsāmaññena panettha suttānaṃ apadisanaṃ. Tathā hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘suttānusārenā’’"
      },
      "ti vuttaṃ, na pana suttavasenāti. Avassaṃ ce tamevaṃ sampaṭicchitabbaṃ adhigatajjhānānampi kesañci icchāvacarānaṃ pavattisabbhāvato."
    ],
    "innerText": "Kāmaṃ nīvaraṇāni vikkhambhetvā eva paṭhamajjhānasamadhigamo, vitakkādike vūpasame eva ca dutiyajjhānādisamadhigamo, tathāpi na tathā tehi dūrībhūtā apetā vā yathā catutthajjhānato, cetaso malīnabhāvasaṅkhātauppilābhogakarehi nīvaraṇādīhi suṭṭhu vimuttiyā tassa parisuddhi, pariyodātatā ca yuttāti āha ‘‘nīvaraṇa…pe… pariyodāte’’ti. Jhānapaṭilābhapaccayānanti jhānapaṭilābhahetukānaṃ jhānapaṭilābhaṃ nissāya uppajjanakānaṃ. Pāpakānanti lāmakānaṃ. Icchāvacarānanti icchāya avacarānaṃ icchāvasena otiṇṇānaṃ ‘‘aho vata mameva satthā paṭipucchitvā paṭipucchitvā bhikkhūnaṃ dhammaṃ deseyyā’’tiādinayappavattānaṃ mānamāyāsāṭheyyādīnaṃ. Abhijjhādīnanti ādi-saddenāpi tesaṃyeva saṅgaho. Abhijjhā cettha paṭhamajjhānena avikkhambhaneyyā, mānādayo ca tadekaṭṭhā daṭṭhabbā ‘‘jhānapaṭilābhapaccayāna’’nti anuvattamānattā. Vikkhambhaneyyā pana nīvaraṇaggahaṇeneva gahitā, kathaṃ pana paṭhamajjhānena avikkhambhaneyyā idha vigacchantīti? ‘‘Sabbe kusalā dhammā sabbākusalānaṃ paṭipakkhā’’ti sallekhapaṭipattivasena evaṃ vuttaṃ jhānassa aparāmaṭṭhabhāvadassanato. Ye panettha ‘‘icchāvacarānaṃ abhijjhādīna’’nti imehi padehi kopaapaccayakaāmarāgabyāpādādayo gahitāti adhippāyena ‘‘jhānapaṭilābhapaccayāna’’nti pāṭhaṃ paṭikkhipitvā ‘‘jhānapaṭilābhapaccanīkāna’’nti pāṭhoti vadanti, taṃ tesaṃ matimattaṃ tathā pāṭhasseva abhāvato. Jhānapaṭilābhapaccanīkā ca nīvaraṇā ceva tadekaṭṭhā ca tesaṃ dūrībhāvaṃ vatvā puna abhāvavigamacodanāya ayujjamānattā. Nanu ca anaṅgaṇasutta- (ma. ni. 1.57 ādayo) vatthasuttesu (ma. ni. 1.70 ādayo) ayamattho na labbhati, oḷārikānaṃyeva pāpadhammānaṃ tattha adhippetattā? Saccametaṃ, idha pana adhigatacatutthajjhānassa vasena vuttattā sukhumāyeva te gahitā, aṅgaṇūpakkilesatāsāmaññena panettha suttānaṃ apadisanaṃ. Tathā hi ‘‘suttānusārenā’’ti vuttaṃ, na pana suttavasenāti. Avassaṃ ce tamevaṃ sampaṭicchitabbaṃ adhigatajjhānānampi kesañci icchāvacarānaṃ pavattisabbhāvato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhipādabhāvūpagamenā"
      },
      "ti iddhiyā pādakabhāvassa padaṭṭhānabhāvassa upagamanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvanāpāripūriyā"
      },
      "ti ito paraṃ kattabbassa abhāvavasena abhinīhārakkhamabhāvanāya paripuṇṇattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇītabhāvūpagamenā"
      },
      "ti tato eva padhānabhāvaṃ nītatāya uttamaṭṭhena, atittikaraṭṭhena ca paṇītabhāvassa upagamanena. Ubhayañcetaṃ ṭhitiyā kāraṇavacanaṃ paripuṇṇāya bhāvanāya paṇītabhāvappattiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ṭhite’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Āneñjappatte’’"
      },
      "ti idaṃ ṭhitiyā visesanaṃ. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yathā āneñjappattaṃ hoti, evaṃ ṭhite’’"
      },
      "ti. Imasmiṃ pakkhe ‘‘ṭhite āneñjappatte’’ti ubhayamekaṃ aṅgaṃ, ‘‘samāhite’’ti pana idampi ekamaṅgaṃ. Tenevassa paṭhamavikappato visesaṃ sandhāyāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evampi aṭṭhaṅgasamannāgata’’"
      },
      "nti."
    ],
    "innerText": "Iddhipādabhāvūpagamenāti iddhiyā pādakabhāvassa padaṭṭhānabhāvassa upagamanena. Bhāvanāpāripūriyāti ito paraṃ kattabbassa abhāvavasena abhinīhārakkhamabhāvanāya paripuṇṇattā. Paṇītabhāvūpagamenāti tato eva padhānabhāvaṃ nītatāya uttamaṭṭhena, atittikaraṭṭhena ca paṇītabhāvassa upagamanena. Ubhayañcetaṃ ṭhitiyā kāraṇavacanaṃ paripuṇṇāya bhāvanāya paṇītabhāvappattiyā ‘‘ṭhite’’ti. ‘‘Āneñjappatte’’ti idaṃ ṭhitiyā visesanaṃ. Tenāha ‘‘yathā āneñjappattaṃ hoti, evaṃ ṭhite’’ti. Imasmiṃ pakkhe ‘‘ṭhite āneñjappatte’’ti ubhayamekaṃ aṅgaṃ, ‘‘samāhite’’ti pana idampi ekamaṅgaṃ. Tenevassa paṭhamavikappato visesaṃ sandhāyāha ‘‘evampi aṭṭhaṅgasamannāgata’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dasaiddhikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "369"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nipphattiatthenā"
      },
      "ti sijjhanaṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭilābhaṭṭhenā"
      },
      "ti pāpuṇanaṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ta"
      },
      "nti kāmitaṃ vatthuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samijjhatī"
      },
      "ti nipphajjati. Pabbajjaṃ ādiṃ katvā yāva jhānamaggā ",
      " idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nekkhammaṃ. Ijjhatī"
      },
      "ti pāpuṇīyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭiharatīti pāṭihāriya"
      },
      "nti yasmā paṭipakkhaṃ harati apaneti, tasmā pāṭihāriyaṃ. Attano paṭipakkhaṃ haratīti paṭihāriyaṃ, nekkhammādi, paṭihāriyameva pāṭihāriyaṃ, yathā ‘‘vekataṃ, vesama’’nti ca."
    ],
    "innerText": "369.Nipphattiatthenāti sijjhanaṭṭhena. Paṭilābhaṭṭhenāti pāpuṇanaṭṭhena. Tanti kāmitaṃ vatthuṃ. Samijjhatīti nipphajjati. Pabbajjaṃ ādiṃ katvā yāva jhānamaggā idha nekkhammaṃ. Ijjhatīti pāpuṇīyati. Paṭiharatīti pāṭihāriyanti yasmā paṭipakkhaṃ harati apaneti, tasmā pāṭihāriyaṃ. Attano paṭipakkhaṃ haratīti paṭihāriyaṃ, nekkhammādi, paṭihāriyameva pāṭihāriyaṃ, yathā ‘‘vekataṃ, vesama’’nti ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ijjhanaṭṭhenā"
      },
      "ti nipphajjanaṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upāyasampadāyā"
      },
      "ti sampannaupāyassa, ñāyārambhassāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ijjhatī"
      },
      "ti pasaveti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlavā"
      },
      "ti ācārasīlena sīlavā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kalyāṇadhammo"
      },
      "ti dasakusalakammapathavasena ",
      " sundaradhammo. Sīlasampattiyā vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīlavā"
      },
      ". Dānādisesapuññakiriyavatthuvasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kalyāṇadhammo. Paṇidahissatī"
      },
      "ti patthessati."
    ],
    "innerText": "Ijjhanaṭṭhenāti nipphajjanaṭṭhena. Upāyasampadāyāti sampannaupāyassa, ñāyārambhassāti attho. Ijjhatīti pasaveti. Sīlavāti ācārasīlena sīlavā. Kalyāṇadhammoti dasakusalakammapathavasena sundaradhammo. Sīlasampattiyā vā sīlavā. Dānādisesapuññakiriyavatthuvasena kalyāṇadhammo. Paṇidahissatīti patthessati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ijjhantī"
      },
      "ti vaḍḍhanti, ukkaṃsaṃ pāpuṇantīti attho. Sātisayanipphajjanapaṭilābhasijjhanabuddhiatthe hi iddhi vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sā dasavidhā"
      },
      "ti sabbā iddhiyo ānetvā atthuddhāravasena idhādhippetaṃ iddhiṃ dassetuṃ vuttaṃ. Bahubhāvādikassa adhiṭṭhānaṃ adhiṭṭhahanaṃ etissā atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhiṭṭhānā"
      },
      ". Vividhaṃ rūpanimmānasaṅkhātaṃ kubbanaṃ etissā atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vikubbanā. Manomayā"
      },
      "ti jhānamanena nibbattibhāvato manomayā. Ñāṇassa vipphāro vegāyitattaṃ etissā atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñāṇavipphārā"
      },
      ". Ariyānaṃ ayanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyā"
      },
      ". Yato kutoci kammavipākato jātā iddhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammavipākajā"
      },
      ". Sātisayapuññanibbattā iddhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puññavato iddhi"
      },
      ". Kammavipākajā iddhi jātito paṭṭhāya hoti, itarā yadā tadā puññassa vipaccanakāleti evaṃ vā imāsaṃ viseso veditabbo. Āthabbanavijjābhinibbattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijjāmayā. Sammāpayogo"
      },
      " upāyapayogo ñāyārambho."
    ],
    "innerText": "Ijjhantīti vaḍḍhanti, ukkaṃsaṃ pāpuṇantīti attho. Sātisayanipphajjanapaṭilābhasijjhanabuddhiatthe hi iddhi vuttā. Sā dasavidhāti sabbā iddhiyo ānetvā atthuddhāravasena idhādhippetaṃ iddhiṃ dassetuṃ vuttaṃ. Bahubhāvādikassa adhiṭṭhānaṃ adhiṭṭhahanaṃ etissā atthīti adhiṭṭhānā. Vividhaṃ rūpanimmānasaṅkhātaṃ kubbanaṃ etissā atthīti vikubbanā. Manomayāti jhānamanena nibbattibhāvato manomayā. Ñāṇassa vipphāro vegāyitattaṃ etissā atthīti ñāṇavipphārā. Ariyānaṃ ayanti ariyā. Yato kutoci kammavipākato jātā iddhi kammavipākajā. Sātisayapuññanibbattā iddhi puññavato iddhi. Kammavipākajā iddhi jātito paṭṭhāya hoti, itarā yadā tadā puññassa vipaccanakāleti evaṃ vā imāsaṃ viseso veditabbo. Āthabbanavijjābhinibbattā vijjāmayā. Sammāpayogo upāyapayogo ñāyārambho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "370"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakatiyā eko"
      },
      "ti sabhāvena eko. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahuka"
      },
      "nti bahuṃ. Tena aggahitaparicchedaṃ adhiṭṭhātabbassa anekabhāvaṃ dassetvā puna paricchedato dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sataṃ vā’’"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvajjatī"
      },
      "ti parikammasaṅkhātena ābhogena ābhujati bhāvirūpe tena parikammamanasikārena manasi karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāṇena adhiṭṭhātī"
      },
      "ti tathā parikammaṃ katvā abhiññāñāṇena yathādhippete bahuke adhiṭṭhāti, adhiṭṭhānacittena saheva bahubhāvāpattito bahubhāvāpādakaṃ iddhividhañāṇaṃ pavattento ca tathā adhiṭṭhātīti vuccati. Sesesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eva"
      },
      "nti ",
      " pakārattho evaṃ-saddo, tena sabbampi adhiṭṭhānappakāraṃ saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhiṭṭhānavasenā"
      },
      "ti ‘‘ñāṇena adhiṭṭhātī’’ti (paṭi. ma. 3.10) evaṃ vuttaadhiṭṭhānavasena nipphannattā."
    ],
    "innerText": "370.Pakatiyā ekoti sabhāvena eko. Bahukanti bahuṃ. Tena aggahitaparicchedaṃ adhiṭṭhātabbassa anekabhāvaṃ dassetvā puna paricchedato dassetuṃ ‘‘sataṃ vā’’tiādi vuttaṃ. Āvajjatīti parikammasaṅkhātena ābhogena ābhujati bhāvirūpe tena parikammamanasikārena manasi karoti. Ñāṇena adhiṭṭhātīti tathā parikammaṃ katvā abhiññāñāṇena yathādhippete bahuke adhiṭṭhāti, adhiṭṭhānacittena saheva bahubhāvāpattito bahubhāvāpādakaṃ iddhividhañāṇaṃ pavattento ca tathā adhiṭṭhātīti vuccati. Sesesupi eseva nayo. Evanti pakārattho evaṃ-saddo, tena sabbampi adhiṭṭhānappakāraṃ saṅgaṇhāti. Adhiṭṭhānavasenāti ‘‘ñāṇena adhiṭṭhātī’’ti (paṭi. ma. 3.10) evaṃ vuttaadhiṭṭhānavasena nipphannattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "371"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakativaṇṇa"
      },
      "nti pakatisaṇṭhānaṃ attano pākatikarūpaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakativaṇṇavijahanavikāravasenā"
      },
      "ti attano pakativaṇṇavijahanapubbakassa kumārakavaṇṇādivaṇṇavikārassa vasena."
    ],
    "innerText": "371.Pakativaṇṇanti pakatisaṇṭhānaṃ attano pākatikarūpaṃ. Pakativaṇṇavijahanavikāravasenāti attano pakativaṇṇavijahanapubbakassa kumārakavaṇṇādivaṇṇavikārassa vasena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "372"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imamhā kāyā"
      },
      "ti paccakkhabhāvena ‘‘imamhā’’ti vuttā bhikkhussa karajakāyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññaṃ kāya"
      },
      "nti aññaṃ iddhimayaṃ kāyaṃ. Tato eva iddhimayarūpavantatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpiṃ"
      },
      ". Abhiññāmanena ",
      " nibbattattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manomayaṃ. Nipphattivasenā"
      },
      "ti nipphajjanavasena. Abhiññāñāṇassa hi yathā manomayo kāyo nipphajjati, tathā pavatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manomayiddhi"
      },
      ". Eseva nayo sesesupi. Yadi evaṃ kathamayameva manomayiddhīti? Ruḷhīvesā veditabbā yathā ‘‘manomayo attabhāvo’’ti, yathā vā ‘‘gosamaññā visāṇādimati piṇḍe’’. Atha vā abbhantarato nikkhante, iddhimatā ca ekantasadise imasmiṃ nimmāne supākaṭo manasā nibbattitabhāvoti yathā sātisayo manomayavohāro, na tathā aññāsu adhiṭṭhānavikubbaniddhīsu samaññantaravantāsūti veditabbaṃ."
    ],
    "innerText": "372.Imamhā kāyāti paccakkhabhāvena ‘‘imamhā’’ti vuttā bhikkhussa karajakāyā. Aññaṃ kāyanti aññaṃ iddhimayaṃ kāyaṃ. Tato eva iddhimayarūpavantatāya rūpiṃ. Abhiññāmanena nibbattattā manomayaṃ. Nipphattivasenāti nipphajjanavasena. Abhiññāñāṇassa hi yathā manomayo kāyo nipphajjati, tathā pavatti manomayiddhi. Eseva nayo sesesupi. Yadi evaṃ kathamayameva manomayiddhīti? Ruḷhīvesā veditabbā yathā ‘‘manomayo attabhāvo’’ti, yathā vā ‘‘gosamaññā visāṇādimati piṇḍe’’. Atha vā abbhantarato nikkhante, iddhimatā ca ekantasadise imasmiṃ nimmāne supākaṭo manasā nibbattitabhāvoti yathā sātisayo manomayavohāro, na tathā aññāsu adhiṭṭhānavikubbaniddhīsu samaññantaravantāsūti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "373"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāṇuppattito pubbe vā"
      },
      "ti arahattamaggañāṇuppattito pubbe vā vipassanākkhaṇe, tatopi vā pubbe antimabhavikassa paṭisandhiggahaṇato paṭṭhāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchā vā"
      },
      " yāva khandhaparinibbānā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṅkhaṇe vā"
      },
      " magguppattisamaye. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāṇānubhāvanibbatto viseso"
      },
      "ti sūriyassa uṭṭhitaṭṭhāne, samantato ca ālokakaraṇasamatthatā viya tasseva ñāṇassa ānubhāvena nibbatto sabbaso pahātabbapahānabhāvetabbabhāvanāpāripūrisaṅkhāto viseso. Vatthūni pana anantarāyatāvasena āgatāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniccānupassanāyā"
      },
      "ti saṅkhāre aniccato anupassantiyā balavavipassanāya. Āraddhavipassanassa hi yathāvuttavipassanāya pavattikkhaṇe tato pubbe, pacchā ca pakiṇṇakasammasanavāre niccasaññāya pahānaṭṭho ijjhati. Eseva nayo sabbattha. Kāmaṃ ettakāya saṅkhepakathāyapi adhippetattho pakāsitova ",
      ", vitthārakathāya pana vibhūtataro hotīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vitthārena kathetabba’’"
      },
      "nti."
    ],
    "innerText": "373.Ñāṇuppattito pubbe vāti arahattamaggañāṇuppattito pubbe vā vipassanākkhaṇe, tatopi vā pubbe antimabhavikassa paṭisandhiggahaṇato paṭṭhāya. Pacchā vā yāva khandhaparinibbānā. Taṅkhaṇe vā magguppattisamaye. Ñāṇānubhāvanibbatto visesoti sūriyassa uṭṭhitaṭṭhāne, samantato ca ālokakaraṇasamatthatā viya tasseva ñāṇassa ānubhāvena nibbatto sabbaso pahātabbapahānabhāvetabbabhāvanāpāripūrisaṅkhāto viseso. Vatthūni pana anantarāyatāvasena āgatāni. Aniccānupassanāyāti saṅkhāre aniccato anupassantiyā balavavipassanāya. Āraddhavipassanassa hi yathāvuttavipassanāya pavattikkhaṇe tato pubbe, pacchā ca pakiṇṇakasammasanavāre niccasaññāya pahānaṭṭho ijjhati. Eseva nayo sabbattha. Kāmaṃ ettakāya saṅkhepakathāyapi adhippetattho pakāsitova , vitthārakathāya pana vibhūtataro hotīti āha ‘‘vitthārena kathetabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gabbhagatassevā"
      },
      "ti anādare sāmivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuttanayenā"
      },
      "ti ‘‘pacchimabhavikassā’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bākulattheravatthu"
      },
      "mhi vuttanayena."
    ],
    "innerText": "Gabbhagatassevāti anādare sāmivacanaṃ. Vuttanayenāti ‘‘pacchimabhavikassā’’tiādinā bākulattheravatthumhi vuttanayena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dārubhāraṃ katvā"
      },
      "ti dārubhāraṃ sakaṭe katvā, āropetvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ossajjitvā"
      },
      "ti chaḍḍetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakaṭamūle"
      },
      "ti sakaṭasamīpe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vāḷayakkhānucarite"
      },
      "ti kururehi yakkhehi anuvicaritabbe. Yakkhapariggahitañhi rājagahanagaraṃ."
    ],
    "innerText": "Dārubhāraṃ katvāti dārubhāraṃ sakaṭe katvā, āropetvāti attho. Ossajjitvāti chaḍḍetvā. Sakaṭamūleti sakaṭasamīpe. Vāḷayakkhānucariteti kururehi yakkhehi anuvicaritabbe. Yakkhapariggahitañhi rājagahanagaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "374"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādhito"
      },
      "ti paṭhamajjhānādisamādhito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbe"
      },
      "ti upacārajjhānakkhaṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchā"
      },
      "ti samāpattiyā ciṇṇapariyante. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṅkhaṇe"
      },
      "ti samāpannakkhaṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samathānubhāvanibbatto viseso"
      },
      "ti tasmiṃ tasmiṃ ",
      " jhāne samādhitejena nibbatto nīvaraṇavikkhambhanavitakkādisamatikkamasaññāvedayitanirodhaparissayasahanādiko viseso."
    ],
    "innerText": "374.Samādhitoti paṭhamajjhānādisamādhito. Pubbeti upacārajjhānakkhaṇe. Pacchāti samāpattiyā ciṇṇapariyante. Taṅkhaṇeti samāpannakkhaṇe. Samathānubhāvanibbatto visesoti tasmiṃ tasmiṃ jhāne samādhitejena nibbatto nīvaraṇavikkhambhanavitakkādisamatikkamasaññāvedayitanirodhaparissayasahanādiko viseso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kapotakandarāya"
      },
      "nti evaṃnāmake araññavihāre. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Juṇhāya rattiyā"
      },
      "ti candālokavatiyā rattiyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navoropitehi kesehī"
      },
      "ti itthambhūtalakkhaṇe karaṇavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassā"
      },
      "ti pahārassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā"
      },
      "ti yakkhassa. Khippanisantibhāvassa ukkaṃsagatattā thero tasmiṃ paharante eva samāpattiṃ samāpajjīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paharaṇasamaye samāpattiṃ appesī’’"
      },
      "ti. Pāḷiyaṃ pana ‘‘nisinno hoti aññataraṃ samādhiṃ samāpajjitvā’’ti (udā. 34) vuttaṃ. Ime pana therā samāpattito vuṭṭhānasamakālaṃ tena pahāro dinnoti vadanti."
    ],
    "innerText": "Kapotakandarāyanti evaṃnāmake araññavihāre. Juṇhāya rattiyāti candālokavatiyā rattiyā. Navoropitehi kesehīti itthambhūtalakkhaṇe karaṇavacanaṃ. Yassāti pahārassa. Tassāti yakkhassa. Khippanisantibhāvassa ukkaṃsagatattā thero tasmiṃ paharante eva samāpattiṃ samāpajjīti āha ‘‘paharaṇasamaye samāpattiṃ appesī’’ti. Pāḷiyaṃ pana ‘‘nisinno hoti aññataraṃ samādhiṃ samāpajjitvā’’ti (udā. 34) vuttaṃ. Ime pana therā samāpattito vuṭṭhānasamakālaṃ tena pahāro dinnoti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sañjīvatthera"
      },
      "nti kakusandhassa bhagavato dutiyaṃ aggasāvakaṃ mahātheraṃ sandhāyāha. So hi āyasmā araññādīsu yattha katthaci nisinno appakasireneva nirodhaṃ samāpajjati, tasmā ekadivasaṃ aññatarasmiṃ rukkhamūle nirodhaṃ samāpajji, taṃ sandhāya vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘nirodhasamāpanna’’"
      },
      "ntiādi. Cīvare aṃsumattampi na jhāyittha, sarīre kā kathā. Teneva hi thero ‘‘sañjīvo’’ tveva paññāyittha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayamassā"
      },
      "ti assa āyasmato sañjīvattherassa yo nirodhasamāpattiyaṃ aggiparissayābhāvo, ayaṃ samādhivipphārā ",
      " iddhīti yojanā. Kathaṃ pana nirodhasamāpattiyaṃ samādhivipphārasambhavoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘anupubba…pe… nibbattattā’’"
      },
      "ti."
    ],
    "innerText": "Sañjīvattheranti kakusandhassa bhagavato dutiyaṃ aggasāvakaṃ mahātheraṃ sandhāyāha. So hi āyasmā araññādīsu yattha katthaci nisinno appakasireneva nirodhaṃ samāpajjati, tasmā ekadivasaṃ aññatarasmiṃ rukkhamūle nirodhaṃ samāpajji, taṃ sandhāya vuttaṃ ‘‘nirodhasamāpanna’’ntiādi. Cīvare aṃsumattampi na jhāyittha, sarīre kā kathā. Teneva hi thero ‘‘sañjīvo’’ tveva paññāyittha. Ayamassāti assa āyasmato sañjīvattherassa yo nirodhasamāpattiyaṃ aggiparissayābhāvo, ayaṃ samādhivipphārā iddhīti yojanā. Kathaṃ pana nirodhasamāpattiyaṃ samādhivipphārasambhavoti āha ‘‘anupubba…pe… nibbattattā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamaṃ ṭhapitabhaṇḍakassā"
      },
      "ti sabbapaṭhamaṃ ṭhapitabhaṇḍakassa. Tañhi gahaṇakāle sabbapacchimaṃ gayhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kālaparicchedavasenā"
      },
      "ti ‘‘ettake kāle gate vuṭṭhahissāmī’’ti samāpattito pubbe katakālaparicchedavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhītā viraviṃsū"
      },
      "ti rattandhakāre rūpadassanena ‘‘pisāco uṭṭhahatī’’ti maññamānā. Ettakehi nāma bhaṇḍakehi ajjhotthaṭo nibbikāro ‘‘aho mahānubhāvo, aho vivekavāsī’’ti ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "theragatena pasādena"
      },
      "."
    ],
    "innerText": "Paṭhamaṃ ṭhapitabhaṇḍakassāti sabbapaṭhamaṃ ṭhapitabhaṇḍakassa. Tañhi gahaṇakāle sabbapacchimaṃ gayhati. Kālaparicchedavasenāti ‘‘ettake kāle gate vuṭṭhahissāmī’’ti samāpattito pubbe katakālaparicchedavasena. Bhītā viraviṃsūti rattandhakāre rūpadassanena ‘‘pisāco uṭṭhahatī’’ti maññamānā. Ettakehi nāma bhaṇḍakehi ajjhotthaṭo nibbikāro ‘‘aho mahānubhāvo, aho vivekavāsī’’ti ca theragatena pasādena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tattatelakaṭāha"
      },
      "nti ādhārasīsena ādheyyamāha, kaṭāhe tattatelaṃ kaṭāhena āsiñcīti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivaṭṭamāna"
      },
      "nti katthacipi alagganavasena bhassantaṃ."
    ],
    "innerText": "Tattatelakaṭāhanti ādhārasīsena ādheyyamāha, kaṭāhe tattatelaṃ kaṭāhena āsiñcīti adhippāyo. Vivaṭṭamānanti katthacipi alagganavasena bhassantaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saparivārā"
      },
      "ti pañcahi itthisatehi saparivārā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājānaṃ mettāya pharī"
      },
      "ti odissakamettāsamāpattiyā ",
      " rājānaṃ phusi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khipitu"
      },
      "nti vijjhituṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Oropetu"
      },
      "nti sarasannāhaṃ paṭisaṃharituṃ."
    ],
    "innerText": "Saparivārāti pañcahi itthisatehi saparivārā. Rājānaṃ mettāya pharīti odissakamettāsamāpattiyā rājānaṃ phusi. Khipitunti vijjhituṃ. Oropetunti sarasannāhaṃ paṭisaṃharituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "375"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭikkūlādīsū"
      },
      "ti aniṭṭhādīsu. Aniṭṭhaṃ hi paṭikkūlaṃ, amanuññampi ‘‘paṭikkūla’’nti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādi"
      },
      "-saddena apaṭikkūlādiṃ saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti paṭikkūlārammaṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upekkhako"
      },
      "ti chaḷaṅgupekkhāya upekkhako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti paṭikkūlāpaṭikkūlabhede vatthusmiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sato"
      },
      "ti sativepullappattiyā satimā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampajāno"
      },
      "ti paññāvepullappattiyā sampajānakārī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aya"
      },
      "nti ayaṃ paṭikkūlādivatthūsu apaṭikkūlasaññīvihārādikā khīṇāsavānaṃ aggamaggādhigamasiddhā cittissariyatā. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cetovasippattānaṃ…pe… vuccatī’’"
      },
      "ti."
    ],
    "innerText": "375.Paṭikkūlādīsūti aniṭṭhādīsu. Aniṭṭhaṃ hi paṭikkūlaṃ, amanuññampi ‘‘paṭikkūla’’nti vuccati. Ādi-saddena apaṭikkūlādiṃ saṅgaṇhāti. Tatthāti paṭikkūlārammaṇe. Upekkhakoti chaḷaṅgupekkhāya upekkhako. Tatthāti paṭikkūlāpaṭikkūlabhede vatthusmiṃ. Satoti sativepullappattiyā satimā. Sampajānoti paññāvepullappattiyā sampajānakārī. Ayanti ayaṃ paṭikkūlādivatthūsu apaṭikkūlasaññīvihārādikā khīṇāsavānaṃ aggamaggādhigamasiddhā cittissariyatā. Tenāha ‘‘cetovasippattānaṃ…pe… vuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aniṭṭhe vatthusmiṃ sattasaññite ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mettāpharaṇaṃ vā"
      },
      " dhātuso paccavekkhaṇāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhātumanasikāraṃ vā"
      },
      " gūthādike dhātumanasikāraṃ karontoti yojetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apaṭikkūlasaññī viharatī"
      },
      "ti hitesitāya, dhammasabhāvacintanāya ca na paṭikkūlasaññī hutvā iriyāpathavihārena viharati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iṭṭhe vatthusmiṃ"
      },
      " ñātimittādike. Kesādiasucikoṭṭhāsamattamevāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asubhapharaṇaṃ vā"
      },
      " asubhamanasikāraṃ vā. Tattha rūpadhammajātaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anicca"
      },
      "nti ādiattho iti-saddo, tasmā aniccadukkhānattavipariṇāmadhammoti manasikāraṃ ",
      " vā karontoti yojanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭikkūlāpaṭikkūlesū"
      },
      "ti iṭṭhāniṭṭhāni vatthūni ekajjhaṃ gahetvā vadati. Esa nayo itarattha. Yaṃ vā sattānaṃ paṭhamaṃ paṭikkūlato upaṭṭhitameva pacchā apaṭikkūlato upatiṭṭhati, yañca apaṭikkūlato upaṭṭhitameva pacchā paṭikkūlato upatiṭṭhati, tadubhayepi khīṇāsavo sace ākaṅkhati, vuttanayena apaṭikkūlasaññī vā vihareyya, paṭikkūlasaññī vāti ayamariyiddhi vuttā."
    ],
    "innerText": "Aniṭṭhe vatthusmiṃ sattasaññite mettāpharaṇaṃ vā dhātuso paccavekkhaṇāya dhātumanasikāraṃ vā gūthādike dhātumanasikāraṃ karontoti yojetabbaṃ. Apaṭikkūlasaññī viharatīti hitesitāya, dhammasabhāvacintanāya ca na paṭikkūlasaññī hutvā iriyāpathavihārena viharati. Iṭṭhe vatthusmiṃ ñātimittādike. Kesādiasucikoṭṭhāsamattamevāti asubhapharaṇaṃ vā asubhamanasikāraṃ vā. Tattha rūpadhammajātaṃ aniccanti ādiattho iti-saddo, tasmā aniccadukkhānattavipariṇāmadhammoti manasikāraṃ vā karontoti yojanā. Paṭikkūlāpaṭikkūlesūti iṭṭhāniṭṭhāni vatthūni ekajjhaṃ gahetvā vadati. Esa nayo itarattha. Yaṃ vā sattānaṃ paṭhamaṃ paṭikkūlato upaṭṭhitameva pacchā apaṭikkūlato upatiṭṭhati, yañca apaṭikkūlato upaṭṭhitameva pacchā paṭikkūlato upatiṭṭhati, tadubhayepi khīṇāsavo sace ākaṅkhati, vuttanayena apaṭikkūlasaññī vā vihareyya, paṭikkūlasaññī vāti ayamariyiddhi vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhunā rūpaṃ disvā"
      },
      "ti kāraṇavasena ‘‘cakkhū’’ti laddhavohārena rūpadassanasamatthena cakkhuviññāṇena, cakkhunā vā kāraṇabhūtena, dvārabhūtena vā rūpaṃ passitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Neva sumano hotī"
      },
      "ti gehassitasomanassassāyaṃ paṭikkhepo, na nekkhammapakkhikāya kiriyāsomanassavedanāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chaḷaṅgupekkha"
      },
      "nti iṭṭhāniṭṭhachaḷārammaṇāpāthe parisuddhapakatibhāvāvijahanalakkhaṇaṃ chasu dvāresu pavattiyā ‘‘chaḷaṅgupekkhā’’ti laddhanāmaṃ tatramajjhattupekkhaṃ. Yathāvuttamatthaṃ pāḷiyā samatthetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paṭisambhidāya’’"
      },
      "ntiādi vuttaṃ."
    ],
    "innerText": "Cakkhunā rūpaṃ disvāti kāraṇavasena ‘‘cakkhū’’ti laddhavohārena rūpadassanasamatthena cakkhuviññāṇena, cakkhunā vā kāraṇabhūtena, dvārabhūtena vā rūpaṃ passitvā. Neva sumano hotīti gehassitasomanassassāyaṃ paṭikkhepo, na nekkhammapakkhikāya kiriyāsomanassavedanāya. Chaḷaṅgupekkhanti iṭṭhāniṭṭhachaḷārammaṇāpāthe parisuddhapakatibhāvāvijahanalakkhaṇaṃ chasu dvāresu pavattiyā ‘‘chaḷaṅgupekkhā’’ti laddhanāmaṃ tatramajjhattupekkhaṃ. Yathāvuttamatthaṃ pāḷiyā samatthetuṃ ‘‘paṭisambhidāya’’ntiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "376"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakkhīādīna"
      },
      "nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena devādīnaṃ saṅgaho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vehāsagamanādikā"
      },
      "ti pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena cakkhuvisuddhiādiṃ saṅgaṇhāti. Kusalakammena nibbattitvāpi akusalavipākānubhāvena sukhasamussayato vinipatitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinipātikānaṃ. Jhāna"
      },
      "nti abhiññāpattaṃ jhānaṃ sandhāyāha. Vipassanāpi ukkaṃsagatā ubbegapītisahitā ākāse laṅghāpanamattāpi hotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vipassanaṃ vā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Paṭhamakappikāna’’"
      },
      "nti idaṃ ‘‘ekaccānaṃ manussāna’’nti imassa visesanaṃ daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evamādīna"
      },
      "nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena punabbasumātādīnaṃ saṅgaho daṭṭhabbo."
    ],
    "innerText": "376.Pakkhīādīnanti ādi-saddena devādīnaṃ saṅgaho. Vehāsagamanādikāti pana ādi-saddena cakkhuvisuddhiādiṃ saṅgaṇhāti. Kusalakammena nibbattitvāpi akusalavipākānubhāvena sukhasamussayato vinipatitattā vinipātikānaṃ. Jhānanti abhiññāpattaṃ jhānaṃ sandhāyāha. Vipassanāpi ukkaṃsagatā ubbegapītisahitā ākāse laṅghāpanamattāpi hotīti vuttaṃ ‘‘vipassanaṃ vā’’ti. ‘‘Paṭhamakappikāna’’nti idaṃ ‘‘ekaccānaṃ manussāna’’nti imassa visesanaṃ daṭṭhabbaṃ. Evamādīnanti ādi-saddena punabbasumātādīnaṃ saṅgaho daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "377"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vehāsa"
      },
      "nti bhummatthe upayogavacanaṃ, accantasaṃyoge vā. Cakkavattī hi cakkaratanaṃ purakkhatvā attano bhavanato abbhuggantvā ākāseneva sineruṃ padakkhiṇaṃ katvā sakalacakkavāḷaṃ anusaṃyāyatīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assabandhā"
      },
      "ti assapālā, ye assānaṃ yavadāyakā. Tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gobandhā"
      },
      "."
    ],
    "innerText": "377.Vehāsanti bhummatthe upayogavacanaṃ, accantasaṃyoge vā. Cakkavattī hi cakkaratanaṃ purakkhatvā attano bhavanato abbhuggantvā ākāseneva sineruṃ padakkhiṇaṃ katvā sakalacakkavāḷaṃ anusaṃyāyatīti. Assabandhāti assapālā, ye assānaṃ yavadāyakā. Tathā gobandhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cakkavattiādīnaṃ puññiddhiyā vitthāriyamānāya atipapañco hotīti puññavato iddhiṃ lakkhaṇato dassentena ‘‘paripākaṃ gate puññasambhāre ijjhanakaviseso’’ti ",
      " vatvāpi jotikādīnaṃ puññiddhiṃ ekadesena dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ettha cā’’"
      },
      "tiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suvaṇṇapabbato"
      },
      "ti sabbasuvaṇṇamayo pabbato. Tassa kira gahitagahitaṭṭhāne odhi na paññāyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekasītāmatte"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sītā"
      },
      " nāma kasanavasena naṅgalassa gatamaggo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tumbaṃ"
      },
      " nāma āḷhakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cuddasa maggā"
      },
      "ti catuddasa kasanamaggā."
    ],
    "innerText": "Cakkavattiādīnaṃ puññiddhiyā vitthāriyamānāya atipapañco hotīti puññavato iddhiṃ lakkhaṇato dassentena ‘‘paripākaṃ gate puññasambhāre ijjhanakaviseso’’ti vatvāpi jotikādīnaṃ puññiddhiṃ ekadesena dassetuṃ ‘‘ettha cā’’tiādi vuttaṃ. Tattha suvaṇṇapabbatoti sabbasuvaṇṇamayo pabbato. Tassa kira gahitagahitaṭṭhāne odhi na paññāyati. Ekasītāmatteti ettha sītā nāma kasanavasena naṅgalassa gatamaggo. Tumbaṃ nāma āḷhakaṃ. Cuddasa maggāti catuddasa kasanamaggā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "378"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijjaṃ parijapitvā"
      },
      "ti gandhārīvijjādikaṃ attano vijjaṃ katūpacāraṃ parivattetvā mantapaṭhanakkamena paṭhitvā."
    ],
    "innerText": "378.Vijjaṃ parijapitvāti gandhārīvijjādikaṃ attano vijjaṃ katūpacāraṃ parivattetvā mantapaṭhanakkamena paṭhitvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "379"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammāpayogenā"
      },
      "ti upāyapayogena, yathā yathicchitatthasiddhi hoti, tathā pavattitañāyārambhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa tassa kammassā"
      },
      "ti yathādhippetassa nipphādetabbakammassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ettha cā"
      },
      "ti ‘‘tattha tattha sammāpayogappaccayā ijjhanaṭṭhena iddhī’’ti (paṭi. ma. 3.18) imissā dasamāya iddhiyā niddesepi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purimapāḷisadisāvā’’"
      },
      "ti samādhivipphāraiddhiādīnaṃ niddesasadisāva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakaṭabyūhādikaraṇavasenā"
      },
      "ti sakaṭabyūhacakkabyūhapadumabyūhādīnaṃ saṃvidhānavasena nibbattavisesoti ",
      " sambandho. Gaṇitagandhabbādi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sippakammaṃ"
      },
      ". Sallakattakādi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vejjakammaṃ"
      },
      ". Irubbedādīnaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tiṇṇaṃ vedānaṃ"
      },
      "."
    ],
    "innerText": "379.Sammāpayogenāti upāyapayogena, yathā yathicchitatthasiddhi hoti, tathā pavattitañāyārambhena. Tassa tassa kammassāti yathādhippetassa nipphādetabbakammassa. Ettha cāti ‘‘tattha tattha sammāpayogappaccayā ijjhanaṭṭhena iddhī’’ti (paṭi. ma. 3.18) imissā dasamāya iddhiyā niddesepi. Purimapāḷisadisāvā’’ti samādhivipphāraiddhiādīnaṃ niddesasadisāva. Sakaṭabyūhādikaraṇavasenāti sakaṭabyūhacakkabyūhapadumabyūhādīnaṃ saṃvidhānavasena nibbattavisesoti sambandho. Gaṇitagandhabbādi sippakammaṃ. Sallakattakādi vejjakammaṃ. Irubbedādīnaṃ tiṇṇaṃ vedānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ekopi hutvā bahudhāva hotī’’tiādinā (dī. ni. 1.238; ma. ni. 1.147; saṃ. ni. 5.834; paṭi. ma. 1.102; 3.10) adhiṭṭhāniddhiyā eva gahitattā āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘adhiṭṭhānā iddhiyeva āgatā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imasmiṃ panatthe"
      },
      "ti imasmiṃ abhiññānisaṃsasaṅkhāte, iddhividhasaṅkhāte vā atthe."
    ],
    "innerText": "‘‘Ekopi hutvā bahudhāva hotī’’tiādinā (dī. ni. 1.238; ma. ni. 1.147; saṃ. ni. 5.834; paṭi. ma. 1.102; 3.10) adhiṭṭhāniddhiyā eva gahitattā āha ‘‘adhiṭṭhānā iddhiyeva āgatā’’ti. Imasmiṃ panattheti imasmiṃ abhiññānisaṃsasaṅkhāte, iddhividhasaṅkhāte vā atthe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "380"
      },
      ". ‘‘Ekavidhena ñāṇavatthu’’ntiādīsu (vibha. 751) koṭṭhāsattho vidhasaddo, ‘‘vividhampi senābyūhaṃ dassetī’’tiādīsu (paṭi. ma. 3.13) vikappattho, tadubhayampettha yujjatīti dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘iddhividhāyāti iddhikoṭṭhāsāya, iddhivikappāya vā’’"
      },
      "ti. Iddhi hi abhiññāsu eko koṭṭhāso, vakkhamānehi bhedehi anekappabhedā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuttappakāravasenā"
      },
      "ti vuttassa cuddasappakārassa, cittaparidamanassa samāhitatādippakārassa ca vasena. ‘‘Iddhividhāyā’’ti tadatthassa sampadānavacananti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘iddhividhādhigamatthāyā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Kasiṇārammaṇato apanetvā’’"
      },
      "ti idaṃ abhiññāpādakaparikammacittānaṃ ",
      " samānasantānatāya vuttaṃ, na parikammacittassa kasiṇārammaṇattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhividhābhimukhaṃ pesetī"
      },
      "ti nipphādetabbassa iddhividhassa abhimukhabhāvena pavatteti. Yaṃ hi ‘‘sataṃ homī’’tiādinā parikammacittassa pavattanaṃ, tadevassa abhinīharaṇaṃ, iddhividhābhimukhapesanañca tatheva iddhividhassa pavattanato abhininnāmanaṃ idha parikammacittassa iddhividhe adhimuttīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘adhigantabbaiddhipoṇaṃ iddhipabbhāraṃ karotī’’"
      },
      "ti. Idha paccanubhavanaphusanā sacchikiriyāpattipariyāyā evāti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pāpuṇātīti attho’’"
      },
      "ti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assā"
      },
      "ti iddhividhassa."
    ],
    "innerText": "380. ‘‘Ekavidhena ñāṇavatthu’’ntiādīsu (vibha. 751) koṭṭhāsattho vidhasaddo, ‘‘vividhampi senābyūhaṃ dassetī’’tiādīsu (paṭi. ma. 3.13) vikappattho, tadubhayampettha yujjatīti dassento āha ‘‘iddhividhāyāti iddhikoṭṭhāsāya, iddhivikappāya vā’’ti. Iddhi hi abhiññāsu eko koṭṭhāso, vakkhamānehi bhedehi anekappabhedā ca. Vuttappakāravasenāti vuttassa cuddasappakārassa, cittaparidamanassa samāhitatādippakārassa ca vasena. ‘‘Iddhividhāyā’’ti tadatthassa sampadānavacananti āha ‘‘iddhividhādhigamatthāyā’’ti. ‘‘Kasiṇārammaṇato apanetvā’’ti idaṃ abhiññāpādakaparikammacittānaṃ samānasantānatāya vuttaṃ, na parikammacittassa kasiṇārammaṇattā. Iddhividhābhimukhaṃ pesetīti nipphādetabbassa iddhividhassa abhimukhabhāvena pavatteti. Yaṃ hi ‘‘sataṃ homī’’tiādinā parikammacittassa pavattanaṃ, tadevassa abhinīharaṇaṃ, iddhividhābhimukhapesanañca tatheva iddhividhassa pavattanato abhininnāmanaṃ idha parikammacittassa iddhividhe adhimuttīti āha ‘‘adhigantabbaiddhipoṇaṃ iddhipabbhāraṃ karotī’’ti. Idha paccanubhavanaphusanā sacchikiriyāpattipariyāyā evāti dassento ‘‘pāpuṇātīti attho’’ti āha. Assāti iddhividhassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekopī"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pi"
      },
      "-saddo vakkhamānaṃ bahubhāvaṃ upādāya sampiṇḍanattho. So hissa paṭiyogī ‘‘ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hotī’’ti. So ca kho bahubhāvaṃ nimminitvā ṭhitassa antarāva ekabhāvūpagamo. Yathākālaparicchedaṃ pana saraseneva ekabhāvūpagamo idha nādhippeto aniddhinimmānabhāvato. Tampi pubbe katakālaparicchedavasena siddhattā iddhānubhāvoyevāti keci. Aṭṭhāne vāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pi"
      },
      "-saddo, eko hutvā bahudhāpi hoti, bahudhā hutvā ekopi hotīti sambandho. Imasmiṃ pakkhe pi-saddo vakkhamānaṃ ekabhāvaṃ upādāya ",
      " ‘‘sampiṇḍanattho’’ti vatvā ‘‘so hī’’tiādi sabbaṃ yathārahaṃ vattabbaṃ. Bahubhāvanimmāne payojanaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bahūnaṃ santike’’"
      },
      "tiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahūnaṃ santike"
      },
      "ti attanā nimmitānaṃ bahūnaṃ samīpe, tehi parivārito hutvāti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vā"
      },
      "-saddo avuttavikappattho, tena ‘‘dhammaṃ vā kathetukāmo’’ti evamādi saṅgayhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Ñāṇena adhiṭṭhahanto"
      },
      " evaṃ hotī’’ti ānetvā sambandhitabbaṃ."
    ],
    "innerText": "Ekopīti pi-saddo vakkhamānaṃ bahubhāvaṃ upādāya sampiṇḍanattho. So hissa paṭiyogī ‘‘ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hotī’’ti. So ca kho bahubhāvaṃ nimminitvā ṭhitassa antarāva ekabhāvūpagamo. Yathākālaparicchedaṃ pana saraseneva ekabhāvūpagamo idha nādhippeto aniddhinimmānabhāvato. Tampi pubbe katakālaparicchedavasena siddhattā iddhānubhāvoyevāti keci. Aṭṭhāne vāyaṃ pi-saddo, eko hutvā bahudhāpi hoti, bahudhā hutvā ekopi hotīti sambandho. Imasmiṃ pakkhe pi-saddo vakkhamānaṃ ekabhāvaṃ upādāya ‘‘sampiṇḍanattho’’ti vatvā ‘‘so hī’’tiādi sabbaṃ yathārahaṃ vattabbaṃ. Bahubhāvanimmāne payojanaṃ dassetuṃ ‘‘bahūnaṃ santike’’tiādi vuttaṃ. Tattha bahūnaṃ santiketi attanā nimmitānaṃ bahūnaṃ samīpe, tehi parivārito hutvāti adhippāyo. Vā-saddo avuttavikappattho, tena ‘‘dhammaṃ vā kathetukāmo’’ti evamādi saṅgayhati. ‘‘Ñāṇena adhiṭṭhahanto evaṃ hotī’’ti ānetvā sambandhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "381"
      },
      ". Bhavati ettha iddhīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhūmiyo,"
      },
      " jhānāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etthā"
      },
      "ti ca hetumhi bhummavacanaṃ. Vivekato jātā bhūmi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vivekajabhūmi"
      },
      ". Vivekajaṃ hi paṭhamaṃ jhānaṃ nīvaraṇavivekasambhūtattā. Pītisukhabhūtā bhūmi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pītisukhabhūmi"
      },
      ". Dutiyajjhānañhi pītisukhabhūmibhūtañceva pītisukhasañjātañca samādhivasena. Upari dvīsupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhilābhāyā"
      },
      "ti iddhiyā adhigamāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhipaṭilābhāyā"
      },
      "ti iddhiyā punappunaṃ labhamānāya, bahulīkaraṇāyāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhivikubbanatāyā"
      },
      "ti iddhiyā vividharūpakāraṇāya, vikubbaniddhiyāti attho ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhivisavitāyā"
      },
      "ti iddhiyā vividhānisaṃsapasavanāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhivasitāyā"
      },
      "ti iddhiyā khippanisantiādibhāvāvahavasībhāvatthāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhivesārajjāyā"
      },
      "ti iddhiyā paṭipakkhadūrībhāvena vigatasaṃkilesatāya suṭṭhu visāradabhāvāya. Catutthajjhānaṃ tāva iddhiyā bhūmi hotu tattha patiṭṭhāya nipphādetabbato, itarāni pana kathanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ettha cā’’"
      },
      "tiādi. Tattha tīṇi jhānāni sambhārabhūmiyoti veditabbānīti sambandho. Tatiyajjhāne sukhapharaṇena, paṭhamadutiyesu pītipharaṇena sukhapharaṇena ca hetubhūtenāti yathārahavasena yojanā. Pharaṇaṃ cettha jhānassa subhāvitabhāvena sātisayānaṃ pītisukhānaṃ vasena jhānappaccayādinā sahajātanāmakāyassa paribrūhanaṃ, rūpakāyassa ca taṃsamuṭṭhānehi paṇītarūpehi paripphuṭatā. Tenāha bhagavā ‘‘pītisukhena abhisandeti parisandeti paripūreti parippharatī’’ti (dī. ni. 1.226; ma. ni. 1.427). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhasañña"
      },
      "nti jhānasukhena sahagataṃ saññaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lahusañña"
      },
      "nti taṃsampayuttalahutāsahagataṃ saññaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Okkamitvā"
      },
      "ti anupavisitvā. Tesu hi jhānesu sātisayāya lahutāya sampayuttaṃ sukhaṃ santānavasena pavattento yogī taṃ samokkanto viya hotīti evaṃ vuttaṃ. Saññāsīsena niddeso. Jhānasampayuttā hi lahutā vināpi iddhiyā ākāsaṃ laṅghāpanappamāṇappattā viya hoti. Lahubhāvaggahaṇeneva cettha mudukammaññabhāvāpi gahitā eva. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘lahumudukammaññakāyo hutvā’’"
      },
      "ti."
    ],
    "innerText": "381. Bhavati ettha iddhīti bhūmiyo, jhānāni. Etthāti ca hetumhi bhummavacanaṃ. Vivekato jātā bhūmi vivekajabhūmi. Vivekajaṃ hi paṭhamaṃ jhānaṃ nīvaraṇavivekasambhūtattā. Pītisukhabhūtā bhūmi pītisukhabhūmi. Dutiyajjhānañhi pītisukhabhūmibhūtañceva pītisukhasañjātañca samādhivasena. Upari dvīsupi eseva nayo. Iddhilābhāyāti iddhiyā adhigamāya. Iddhipaṭilābhāyāti iddhiyā punappunaṃ labhamānāya, bahulīkaraṇāyāti attho. Iddhivikubbanatāyāti iddhiyā vividharūpakāraṇāya, vikubbaniddhiyāti attho . Iddhivisavitāyāti iddhiyā vividhānisaṃsapasavanāya. Iddhivasitāyāti iddhiyā khippanisantiādibhāvāvahavasībhāvatthāya. Iddhivesārajjāyāti iddhiyā paṭipakkhadūrībhāvena vigatasaṃkilesatāya suṭṭhu visāradabhāvāya. Catutthajjhānaṃ tāva iddhiyā bhūmi hotu tattha patiṭṭhāya nipphādetabbato, itarāni pana kathanti āha ‘‘ettha cā’’tiādi. Tattha tīṇi jhānāni sambhārabhūmiyoti veditabbānīti sambandho. Tatiyajjhāne sukhapharaṇena, paṭhamadutiyesu pītipharaṇena sukhapharaṇena ca hetubhūtenāti yathārahavasena yojanā. Pharaṇaṃ cettha jhānassa subhāvitabhāvena sātisayānaṃ pītisukhānaṃ vasena jhānappaccayādinā sahajātanāmakāyassa paribrūhanaṃ, rūpakāyassa ca taṃsamuṭṭhānehi paṇītarūpehi paripphuṭatā. Tenāha bhagavā ‘‘pītisukhena abhisandeti parisandeti paripūreti parippharatī’’ti (dī. ni. 1.226; ma. ni. 1.427). Sukhasaññanti jhānasukhena sahagataṃ saññaṃ. Lahusaññanti taṃsampayuttalahutāsahagataṃ saññaṃ. Okkamitvāti anupavisitvā. Tesu hi jhānesu sātisayāya lahutāya sampayuttaṃ sukhaṃ santānavasena pavattento yogī taṃ samokkanto viya hotīti evaṃ vuttaṃ. Saññāsīsena niddeso. Jhānasampayuttā hi lahutā vināpi iddhiyā ākāsaṃ laṅghāpanappamāṇappattā viya hoti. Lahubhāvaggahaṇeneva cettha mudukammaññabhāvāpi gahitā eva. Tenāha ‘‘lahumudukammaññakāyo hutvā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iminā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariyāyenā"
      },
      "ti tiṇṇaṃ jhānānaṃ samāpajjanena sukhalahubhāvappattanāmarūpakāyassa sati cittaparidamane catutthaṃ jhānaṃ sukheneva iddhipaṭilābhāya saṃvattatīti iminā pariyāyena. Pakatibhūmiyā hi adhiṭṭhānabhūtā sambhārabhūmiyo pākārassa nemippadeso viyāti."
    ],
    "innerText": "Imināpariyāyenāti tiṇṇaṃ jhānānaṃ samāpajjanena sukhalahubhāvappattanāmarūpakāyassa sati cittaparidamane catutthaṃ jhānaṃ sukheneva iddhipaṭilābhāya saṃvattatīti iminā pariyāyena. Pakatibhūmiyā hi adhiṭṭhānabhūtā sambhārabhūmiyo pākārassa nemippadeso viyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "382"
      },
      ". Iddhipādaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cattāro"
      },
      "ti gaṇanaparicchedo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhipādā"
      },
      "ti ettha ijjhatīti iddhi, samijjhati nipphajjatīti attho. Ijjhanti vā etāya sattā iddhā vuddhā ukkaṃsagatā hontīti iddhi. Paṭhamenatthena iddhi eva pādoti iddhipādo, iddhikoṭṭhāsoti attho. Dutiyenatthena iddhiyā pādoti iddhipādo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pādo"
      },
      "ti patiṭṭhā, adhigamūpāyoti attho. Tena hi uparūparivisesasaṅkhātaṃ iddhiṃ pajjanti pāpuṇanti. Ayaṃ tāva aṭṭhakathānayo. Tattha iddhi-saddassa paṭhamo kattuattho, dutiyo karaṇattho ",
      " vutto. Pāda-saddassa eko karaṇatthova. Pajjitabbāva iddhi vuttā, na ca ijjhantī, pajjitabbā ca iddhi pajjanakaraṇena pādena samānādhikaraṇā hotīti paṭhamena atthena ‘‘iddhi eva pādo iddhipādo’’ti na sakkā vattuṃ. Tathā iddhikiriyākaraṇena sādhetabbāva vuddhisaṅkhātā iddhi pajjanakiriyākaraṇena pajjitabbāti dvinnaṃ karaṇānaṃ na asamānādhikaraṇatā sambhavatīti dutiyenatthena ‘‘iddhiyā pādo iddhipādo’’ti ca na sakkā vattuṃ. Tasmā paṭhamenatthena samānādhikaraṇasamāso, dutiyena sāmivacanasamāso na yujjatīti paṭhamenatthena iddhiyā pādo iddhipādo, dutiyenatthena iddhi eva pādo iddhipādoti samāso yutto, yathāvuttopi vā, pādassa ijjhamānakoṭṭhāsaijjhanakaraṇūpāyabhāvato."
    ],
    "innerText": "382. Iddhipādaniddese cattāroti gaṇanaparicchedo. Iddhipādāti ettha ijjhatīti iddhi, samijjhati nipphajjatīti attho. Ijjhanti vā etāya sattā iddhā vuddhā ukkaṃsagatā hontīti iddhi. Paṭhamenatthena iddhi eva pādoti iddhipādo, iddhikoṭṭhāsoti attho. Dutiyenatthena iddhiyā pādoti iddhipādo. Pādoti patiṭṭhā, adhigamūpāyoti attho. Tena hi uparūparivisesasaṅkhātaṃ iddhiṃ pajjanti pāpuṇanti. Ayaṃ tāva aṭṭhakathānayo. Tattha iddhi-saddassa paṭhamo kattuattho, dutiyo karaṇattho vutto. Pāda-saddassa eko karaṇatthova. Pajjitabbāva iddhi vuttā, na ca ijjhantī, pajjitabbā ca iddhi pajjanakaraṇena pādena samānādhikaraṇā hotīti paṭhamena atthena ‘‘iddhi eva pādo iddhipādo’’ti na sakkā vattuṃ. Tathā iddhikiriyākaraṇena sādhetabbāva vuddhisaṅkhātā iddhi pajjanakiriyākaraṇena pajjitabbāti dvinnaṃ karaṇānaṃ na asamānādhikaraṇatā sambhavatīti dutiyenatthena ‘‘iddhiyā pādo iddhipādo’’ti ca na sakkā vattuṃ. Tasmā paṭhamenatthena samānādhikaraṇasamāso, dutiyena sāmivacanasamāso na yujjatīti paṭhamenatthena iddhiyā pādo iddhipādo, dutiyenatthena iddhi eva pādo iddhipādoti samāso yutto, yathāvuttopi vā, pādassa ijjhamānakoṭṭhāsaijjhanakaraṇūpāyabhāvato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pubbabhāgachandavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chandahetuko"
      },
      ". Sampayuttachandavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chandādhiko"
      },
      ". Pubbābhisaṅkhāravasena eva pana sahajātachandassāpi adhikatā veditabbā. Atha vā ‘‘chandañce bhikkhu adhipatiṃ karitvā labhati samādhiṃ, labhati cittassekaggataṃ, ayaṃ vuccati chandasamādhī’’ti imāya pāḷiyā chandādhipatisamādhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chandasamādhī"
      },
      "ti adhipati-saddalopaṃ katvā samāso vuttoti viññāyati. Adhipatisaddatthadassanavasena pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathāyaṃ"
      },
      " ‘‘chandahetuko chandādhiko vā samādhī’’ti vuttaṃ. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘chandaṃ adhipatiṃ karitvā’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padhānabhūtā"
      },
      "ti vīriyabhūtāti keci vadanti. Saṅkhatasaṅkhāranivattanatthaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padhānaggahaṇaṃ"
      },
      ". Atha vā taṃ taṃ visesaṃ saṅkharotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅkhāro,"
      },
      " sabbampi vīriyaṃ. Tattha catukiccasādhakato aññassa nivattanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padhānaggahaṇaṃ. Padhānabhūtā"
      },
      " seṭṭhabhūtāti attho. Catubbidhassa pana vīriyassa adhippetattā bahuvacananiddeso. Yo pana ‘‘iddhiyā pādo iddhipādo’’ti evaṃ samāsayojanāvasena pādassa upāyatthataṃ gahetvā iddhipādattho ",
      " vutto, so paṭilābhapubbabhāgānaṃ kattukaraṇiddhibhāvaṃ ‘‘chandiddhipādo’’tiādinā (vibha. 457) vā abhidhamme āgatattā chandādīhi iddhipādehi sādhetabbāya vuddhiyā kattiddhibhāvaṃ, chandādīnaṃ karaṇiddhibhāvañca sandhāya vuttoti veditabbo."
    ],
    "innerText": "Pubbabhāgachandavasena chandahetuko. Sampayuttachandavasena chandādhiko. Pubbābhisaṅkhāravasena eva pana sahajātachandassāpi adhikatā veditabbā. Atha vā ‘‘chandañce bhikkhu adhipatiṃ karitvā labhati samādhiṃ, labhati cittassekaggataṃ, ayaṃ vuccati chandasamādhī’’ti imāya pāḷiyā chandādhipatisamādhi chandasamādhīti adhipati-saddalopaṃ katvā samāso vuttoti viññāyati. Adhipatisaddatthadassanavasena pana aṭṭhakathāyaṃ ‘‘chandahetuko chandādhiko vā samādhī’’ti vuttaṃ. Tenevāha ‘‘chandaṃ adhipatiṃ karitvā’’tiādi. Padhānabhūtāti vīriyabhūtāti keci vadanti. Saṅkhatasaṅkhāranivattanatthaṃ pana padhānaggahaṇaṃ. Atha vā taṃ taṃ visesaṃ saṅkharotīti saṅkhāro, sabbampi vīriyaṃ. Tattha catukiccasādhakato aññassa nivattanatthaṃ padhānaggahaṇaṃ. Padhānabhūtā seṭṭhabhūtāti attho. Catubbidhassa pana vīriyassa adhippetattā bahuvacananiddeso. Yo pana ‘‘iddhiyā pādo iddhipādo’’ti evaṃ samāsayojanāvasena pādassa upāyatthataṃ gahetvā iddhipādattho vutto, so paṭilābhapubbabhāgānaṃ kattukaraṇiddhibhāvaṃ ‘‘chandiddhipādo’’tiādinā (vibha. 457) vā abhidhamme āgatattā chandādīhi iddhipādehi sādhetabbāya vuddhiyā kattiddhibhāvaṃ, chandādīnaṃ karaṇiddhibhāvañca sandhāya vuttoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vīriyiddhipāde ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vīriyasamādhipadhānasaṅkhārasamannāgata’’"
      },
      "nti dvikkhattuṃ vīriyaṃ āgataṃ. Tattha purimaṃ samādhivisesanaṃ vīriyādhipati samādhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vīriyasamādhī"
      },
      "ti. Dutiyaṃ samannāgamaṅgadassanaṃ. Dve eva hi sabbattha samannāgamaṅgāni samādhi ",
      ", padhānasaṅkhāro ca. Chandādayo samādhivisesanāni, padhānasaṅkhāro pana padhānavacaneneva visesito, na chandādīhīti na idha vīriyādhipatitā padhānasaṅkhārassa vuttā hoti. Vīriyañca samādhiṃ visesetvā ṭhitameva samannāgamaṅgavasena padhānasaṅkhāravacanena vuttanti nāpi dvīhi vīriyehi samannāgamo vutto hotīti. Yasmā pana chandādīhi visiṭṭho samādhi, tathā visiṭṭheneva ca tena sampayutto padhānasaṅkhāro, sesadhammā ca, tasmā samādhivisesanānaṃ vasena cattāro iddhipādā vuttā. Visesanabhāvo ca chandādīnaṃ taṃtaṃavassayavasena hotīti."
    ],
    "innerText": "Vīriyiddhipāde ‘‘vīriyasamādhipadhānasaṅkhārasamannāgata’’nti dvikkhattuṃ vīriyaṃ āgataṃ. Tattha purimaṃ samādhivisesanaṃ vīriyādhipati samādhi vīriyasamādhīti. Dutiyaṃ samannāgamaṅgadassanaṃ. Dve eva hi sabbattha samannāgamaṅgāni samādhi , padhānasaṅkhāro ca. Chandādayo samādhivisesanāni, padhānasaṅkhāro pana padhānavacaneneva visesito, na chandādīhīti na idha vīriyādhipatitā padhānasaṅkhārassa vuttā hoti. Vīriyañca samādhiṃ visesetvā ṭhitameva samannāgamaṅgavasena padhānasaṅkhāravacanena vuttanti nāpi dvīhi vīriyehi samannāgamo vutto hotīti. Yasmā pana chandādīhi visiṭṭho samādhi, tathā visiṭṭheneva ca tena sampayutto padhānasaṅkhāro, sesadhammā ca, tasmā samādhivisesanānaṃ vasena cattāro iddhipādā vuttā. Visesanabhāvo ca chandādīnaṃ taṃtaṃavassayavasena hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha vā"
      },
      "tiādinā nissayaṭṭhepi pāda-sadde upāyaṭṭhena chandādīnaṃ iddhipādatā vuttā. Teneva abhidhamme uttaracūḷabhājanīye ‘‘cattāro iddhipādā chandiddhipādo’’tiādinā (vibha. 457) chandādīnameva iddhipādatā vuttā. Pañhāpucchake ca ‘‘cattāro iddhipādā idha bhikkhu chandasamādhī’’tiādināva (vibha. 462) uddesaṃ katvāpi puna chandādīnaṃyeva kusalādibhāvo vibhatto. Upāyiddhipādadassanatthameva hi sutte, abhidhamme ca nissayiddhipādadassanaṃ kataṃ, aññathā catubbidhatā na hotīti."
    ],
    "innerText": "Atha vātiādinā nissayaṭṭhepi pāda-sadde upāyaṭṭhena chandādīnaṃ iddhipādatā vuttā. Teneva abhidhamme uttaracūḷabhājanīye ‘‘cattāro iddhipādā chandiddhipādo’’tiādinā (vibha. 457) chandādīnameva iddhipādatā vuttā. Pañhāpucchake ca ‘‘cattāro iddhipādā idha bhikkhu chandasamādhī’’tiādināva (vibha. 462) uddesaṃ katvāpi puna chandādīnaṃyeva kusalādibhāvo vibhatto. Upāyiddhipādadassanatthameva hi sutte, abhidhamme ca nissayiddhipādadassanaṃ kataṃ, aññathā catubbidhatā na hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "383"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chandādīni aṭṭhā"
      },
      "ti chandasamādhi vīriyasamādhi cittasamādhi vīmaṃsāsamādhīti evaṃ chandādīni aṭṭha. Kāmaṃ cettha catūsupi ṭhānesu samādhi samādhi eva, tathāpi iddhiṃ uppādetukāmatāchandasahitova samādhi iddhipaṭilābhāya saṃvattati, na kevalo. Evaṃ vīriyasamādhiādayopi. Tasmā chandādisahitā ete cattāro ca samādhī, chandādayo ca cattāroti aṭṭha pajjati iddhi etehi pāpuṇīyati, sayaṃ vā pajjanti iddhipaṭilābhāya sampajjantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padānī"
      },
      "ti vuccanti. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘iddhipaṭilābhāya saṃvattantī’’"
      },
      "ti. Yaṃ pana pāḷiyaṃ ‘‘chando na samādhī’’tiādi, taṃ yadipi chandādayo samādhisahitāva iddhiṃ nipphādenti, tathāpi visuṃ ",
      " nesaṃ padabhāvadassanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekato niyuttova,"
      },
      " na ekeko hutvāti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niyuttovā"
      },
      "ti sahito eva, na viyutto."
    ],
    "innerText": "383.Chandādīni aṭṭhāti chandasamādhi vīriyasamādhi cittasamādhi vīmaṃsāsamādhīti evaṃ chandādīni aṭṭha. Kāmaṃ cettha catūsupi ṭhānesu samādhi samādhi eva, tathāpi iddhiṃ uppādetukāmatāchandasahitova samādhi iddhipaṭilābhāya saṃvattati, na kevalo. Evaṃ vīriyasamādhiādayopi. Tasmā chandādisahitā ete cattāro ca samādhī, chandādayo ca cattāroti aṭṭha pajjati iddhi etehi pāpuṇīyati, sayaṃ vā pajjanti iddhipaṭilābhāya sampajjantīti padānīti vuccanti. Tenāha ‘‘iddhipaṭilābhāya saṃvattantī’’ti. Yaṃ pana pāḷiyaṃ ‘‘chando na samādhī’’tiādi, taṃ yadipi chandādayo samādhisahitāva iddhiṃ nipphādenti, tathāpi visuṃ nesaṃ padabhāvadassanaṃ. Ekato niyuttova, na ekeko hutvāti adhippāyo. Niyuttovāti sahito eva, na viyutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "384"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anonata"
      },
      "nti na onataṃ, vīriyena paggahitattā alīnanti attho. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kosajje na iñjatī’’"
      },
      "ti, kosajjanimittaṃ na calatīti ",
      " attho. Uddhaṃ nataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "unnataṃ,"
      },
      " uddhataṃ vikkhittaṃ. Na unnataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anunnataṃ,"
      },
      " avikkhittaṃ samāhitanti attho. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘uddhacce na iñjatī’’"
      },
      "ti. Abhisaṅgavasena nataṃ abhinataṃ, na abhinataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anabhinataṃ,"
      },
      " arattaṃ. Apagamanavasena nataṃ apanataṃ, kodhavasena vimukhaṃ. Na apanataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anapanataṃ,"
      },
      " aduṭṭhaṃ. Diṭṭhiyā ‘‘ahaṃ, mama’’nti nissayavasena na nissitanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anissitaṃ"
      },
      ". Chandarāgavasena na paṭibaddhanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appaṭibaddhaṃ. Rāgo"
      },
      " kevalaṃ āsattimattaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chandarāgo"
      },
      " pana bahalakileso. Tathā hissa dūre ṭhitampi ārammaṇaṃ paṭibaddhameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vippamutta"
      },
      "nti visesato pamuttaṃ. Jhānānaṃ kāmarāgapaṭipakkhatāya āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kāmarāge’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visaṃyutta"
      },
      "nti vivittaṃ saṃkilesato, na vā saṃyuttaṃ catūhipi yogehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimariyādikataṃ"
      },
      " kilesamariyādāya, yathā īsakampi kilesamariyādā na hoti, tathā paṭipannaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekattagata"
      },
      "nti ekaggataṃ upagataṃ accantameva samāhitaṃ. Tato eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nānattakilesehi"
      },
      " nānāsabhāvehi kilesehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na iñjati"
      },
      "."
    ],
    "innerText": "384.Anonatanti na onataṃ, vīriyena paggahitattā alīnanti attho. Tenāha ‘‘kosajje na iñjatī’’ti, kosajjanimittaṃ na calatīti attho. Uddhaṃ nataṃ unnataṃ, uddhataṃ vikkhittaṃ. Na unnataṃ anunnataṃ, avikkhittaṃ samāhitanti attho. Tenāha ‘‘uddhacce na iñjatī’’ti. Abhisaṅgavasena nataṃ abhinataṃ, na abhinataṃ anabhinataṃ, arattaṃ. Apagamanavasena nataṃ apanataṃ, kodhavasena vimukhaṃ. Na apanataṃ anapanataṃ, aduṭṭhaṃ. Diṭṭhiyā ‘‘ahaṃ, mama’’nti nissayavasena na nissitanti anissitaṃ. Chandarāgavasena na paṭibaddhanti appaṭibaddhaṃ. Rāgo kevalaṃ āsattimattaṃ, chandarāgo pana bahalakileso. Tathā hissa dūre ṭhitampi ārammaṇaṃ paṭibaddhameva. Vippamuttanti visesato pamuttaṃ. Jhānānaṃ kāmarāgapaṭipakkhatāya āha ‘‘kāmarāge’’ti. Visaṃyuttanti vivittaṃ saṃkilesato, na vā saṃyuttaṃ catūhipi yogehi. Vimariyādikataṃ kilesamariyādāya, yathā īsakampi kilesamariyādā na hoti, tathā paṭipannaṃ. Ekattagatanti ekaggataṃ upagataṃ accantameva samāhitaṃ. Tato eva nānattakilesehi nānāsabhāvehi kilesehi na iñjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Esa attho"
      },
      "ti kosajjādinimittaṃ. Imassa cittassa āneñjanattho siddho eva āneñjappattiyā pakāsanavasena dassitattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puna vutto"
      },
      "ti iddhiyā bhūmipādapadadassanappasaṅgena ‘‘imāni mūlāni nāmā’’ti mūlabhāvadassanatthaṃ puna vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purimo"
      },
      "ti ‘‘saddhādīhi pariggahitattā’’tiādinā pubbe chadhā dassitanayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aya"
      },
      "nti adhunā soḷasadhā dassitanayo. Suttanaye, paṭisambhidānaye ca dassite tattha sammoho na hoti, na adassiteti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ubhayattha asammohattha’’"
      },
      "nti."
    ],
    "innerText": "Esa atthoti kosajjādinimittaṃ. Imassa cittassa āneñjanattho siddho eva āneñjappattiyā pakāsanavasena dassitattā. Puna vuttoti iddhiyā bhūmipādapadadassanappasaṅgena ‘‘imāni mūlāni nāmā’’ti mūlabhāvadassanatthaṃ puna vutto. Purimoti ‘‘saddhādīhi pariggahitattā’’tiādinā pubbe chadhā dassitanayo. Ayanti adhunā soḷasadhā dassitanayo. Suttanaye, paṭisambhidānaye ca dassite tattha sammoho na hoti, na adassiteti āha ‘‘ubhayattha asammohattha’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "385"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāṇena adhiṭṭhahanto"
      },
      "ti ‘‘kathaṃ panāyaṃ evaṃ hotī’’ti ettha pubbe attanā vuttapadaṃ uddharati adhiṭṭhānavidhiṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘abhiññāpādakaṃ jhānaṃ samāpajjitvā vuṭṭhāyā’’"
      },
      "ti. Ettha anupubbena cattāri jhānāni samāpajjitvā catutthajjhānato vuṭṭhāyāti keci, taṃ ayuttaṃ. Yathicchitajjhānasamāpajjanatthañhi cittaparidamanaṃ, catutthajjhānameva ca abhiññāpādakaṃ, na itarāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parikammaṃ katvā"
      },
      "ti pādakajjhānato vuṭṭhāya kāmāvacaracittena ‘‘sataṃ homī’’tiādinā ",
      " cintanamevettha parikammakaraṇaṃ, tathāvajjanameva ca āvajjanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dutiyampī"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pi"
      },
      "-saddo samuccayattho, tena tatiyampi, tato bhiyyopīti imamatthaṃ dīpeti. Yathā hi jhānabhāvanā, evamabhiññābhāvanāpi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Ekavāraṃ dvevāra’’"
      },
      "nti idampi nidassanamattaṃ daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nimittārammaṇa"
      },
      "nti paṭibhāganimittārammaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parikammacittānī"
      },
      "ti ettha ekekassa parikammacittassa satārammaṇatā ",
      " daṭṭhabbā ‘‘sataṃ homī’’ti pavattanato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahassārammaṇānī"
      },
      "ti etthāpi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaṇṇavasenā"
      },
      "ti attanā parikappitavaṇṇavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "No paṇṇattivasenā"
      },
      "ti na sattapaṇṇattivasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ"
      },
      " adhiṭṭhānacittaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appanācittamivā"
      },
      "ti ivaggahaṇaṃ abhiññācittassa jhānacittassa paṭhamuppattisadisabhāvato vuttaṃ, na tassa appanābhāvato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpāvacaracatutthajjhānika"
      },
      "nti rūpāvacaracatutthajhānavantaṃ, tena sampayuttaṃ."
    ],
    "innerText": "385.Ñāṇena adhiṭṭhahantoti ‘‘kathaṃ panāyaṃ evaṃ hotī’’ti ettha pubbe attanā vuttapadaṃ uddharati adhiṭṭhānavidhiṃ dassetuṃ ‘‘abhiññāpādakaṃ jhānaṃ samāpajjitvā vuṭṭhāyā’’ti. Ettha anupubbena cattāri jhānāni samāpajjitvā catutthajjhānato vuṭṭhāyāti keci, taṃ ayuttaṃ. Yathicchitajjhānasamāpajjanatthañhi cittaparidamanaṃ, catutthajjhānameva ca abhiññāpādakaṃ, na itarāni. Parikammaṃ katvāti pādakajjhānato vuṭṭhāya kāmāvacaracittena ‘‘sataṃ homī’’tiādinā cintanamevettha parikammakaraṇaṃ, tathāvajjanameva ca āvajjanaṃ. Dutiyampīti pi-saddo samuccayattho, tena tatiyampi, tato bhiyyopīti imamatthaṃ dīpeti. Yathā hi jhānabhāvanā, evamabhiññābhāvanāpi. ‘‘Ekavāraṃ dvevāra’’nti idampi nidassanamattaṃ daṭṭhabbaṃ. Nimittārammaṇanti paṭibhāganimittārammaṇaṃ. Parikammacittānīti ettha ekekassa parikammacittassa satārammaṇatā daṭṭhabbā ‘‘sataṃ homī’’ti pavattanato. Sahassārammaṇānīti etthāpi eseva nayo. Vaṇṇavasenāti attanā parikappitavaṇṇavasena. No paṇṇattivasenāti na sattapaṇṇattivasena. Taṃ adhiṭṭhānacittaṃ appanācittamivāti ivaggahaṇaṃ abhiññācittassa jhānacittassa paṭhamuppattisadisabhāvato vuttaṃ, na tassa appanābhāvato. Rūpāvacaracatutthajjhānikanti rūpāvacaracatutthajhānavantaṃ, tena sampayuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "386"
      },
      ". Yadi evaṃ ‘‘āvajjitvā ñāṇena adhiṭṭhātī’’ti paṭisambhidāvacanaṃ kathanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yampī’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatrāpī"
      },
      "ti paṭisambhidāyampi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvajjatī"
      },
      "ti ‘‘bahukaṃ āvajjatī’’ti idaṃ pāṭhapadaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parikammavaseneva vuttaṃ,"
      },
      " na āvajjanavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvajjitvā ñāṇena adhiṭṭhātīti abhiññāñāṇavasena vuttaṃ,"
      },
      " na parikammacittasampayuttassa, aññassa vā kāmāvacarassa ñāṇassa vasena. Na hi tassa tādiso ānubhāvo atthīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      "ti yasmā appanāppattassa abhiññāñāṇasseva vasena adhiṭṭhānaṃ, tasmā. Ayamadhiṭṭhānakkamoti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bahukaṃ āvajjatī’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sanniṭṭhāpanavasenā"
      },
      "ti nipphādanavasena."
    ],
    "innerText": "386. Yadi evaṃ ‘‘āvajjitvā ñāṇena adhiṭṭhātī’’ti paṭisambhidāvacanaṃ kathanti āha ‘‘yampī’’tiādi. Tatrāpīti paṭisambhidāyampi. Āvajjatīti ‘‘bahukaṃ āvajjatī’’ti idaṃ pāṭhapadaṃ parikammavaseneva vuttaṃ, na āvajjanavasena. Āvajjitvā ñāṇena adhiṭṭhātīti abhiññāñāṇavasena vuttaṃ, na parikammacittasampayuttassa, aññassa vā kāmāvacarassa ñāṇassa vasena. Na hi tassa tādiso ānubhāvo atthīti. Tasmāti yasmā appanāppattassa abhiññāñāṇasseva vasena adhiṭṭhānaṃ, tasmā. Ayamadhiṭṭhānakkamoti dassento ‘‘bahukaṃ āvajjatī’’tiādimāha. Tattha sanniṭṭhāpanavasenāti nipphādanavasena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyasakkhidassanattha"
      },
      "nti na kevalaṃ vacanamattameva, atha kho ayametassatthassa attano kāyena sacchikatattā kāyasakkhīti sakkhidassanatthaṃ."
    ],
    "innerText": "Kāyasakkhidassanatthanti na kevalaṃ vacanamattameva, atha kho ayametassatthassa attano kāyena sacchikatattā kāyasakkhīti sakkhidassanatthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kokanada"
      },
      "nti padumavisesanaṃ yathā ‘‘kokāsaka’’nti. Taṃ kira bahupattaṃ, vaṇṇasampannaṃ, ativiya sugandhañca hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāto"
      },
      "ti pageva. Ayañhettha attho – yathā kokanadasaṅkhātaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumaṃ pāto"
      },
      " sūriyassuggamanavelāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "phullaṃ"
      },
      " vikasitaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avītagandhaṃ siyā virocamānaṃ,"
      },
      " evaṃ sarīragandhena, guṇagandhena ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugandhaṃ"
      },
      " saradakāle ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "antalikkhe ādiccamiva"
      },
      " attano tejasā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tapantaṃ"
      },
      " aṅgehi niccharaṇakajutitāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṅgīrasaṃ"
      },
      " sammāsambuddhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "passā"
      },
      "ti."
    ],
    "innerText": "Kokanadanti padumavisesanaṃ yathā ‘‘kokāsaka’’nti. Taṃ kira bahupattaṃ, vaṇṇasampannaṃ, ativiya sugandhañca hoti. Pātoti pageva. Ayañhettha attho – yathā kokanadasaṅkhātaṃ padumaṃ pāto sūriyassuggamanavelāyaṃ phullaṃ vikasitaṃ avītagandhaṃ siyā virocamānaṃ, evaṃ sarīragandhena, guṇagandhena ca sugandhaṃ saradakāle antalikkhe ādiccamiva attano tejasā tapantaṃ aṅgehi niccharaṇakajutitāya aṅgīrasaṃ sammāsambuddhaṃ passāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhabbo"
      },
      "ti paṭipattisāramidaṃ sāsanaṃ, paṭipatti ca pariyattimūlikā, tvañca pariyattiṃ uggahetuṃ ",
      " asamattho, tasmā abhabboti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhabbo nāma na hoti"
      },
      " vāsadhurasseva padhānabhāvato."
    ],
    "innerText": "Abhabboti paṭipattisāramidaṃ sāsanaṃ, paṭipatti ca pariyattimūlikā, tvañca pariyattiṃ uggahetuṃ asamattho, tasmā abhabboti adhippāyo. Abhabbo nāma na hoti vāsadhurasseva padhānabhāvato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhū"
      },
      "ti pabbajitavohārena vuttaṃ, bhāvinaṃ vā bhikkhubhāvaṃ upādāya yathā ‘‘agamā rājagahaṃ buddho’’ti (su. ni. 410). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pilotikakhaṇḍa"
      },
      "nti suvisuddhaṃ coḷakhaṇḍaṃ ",
      ". Rajo haratīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rajoharaṇaṃ. Abhinimminitvā adāsi"
      },
      " tattha pubbe katādhikārattā. Tathā hi yoniso ummujjanto ‘‘attabhāvassa panāyaṃ doso’’ti asubhasaññaṃ, aniccasaññañca paṭilabhitvā nāmarūpapariggahādinā pañcasu khandhesu ñāṇaṃ otāretvā kalāpasammasanādikkamena vipassanaṃ vaḍḍhetvā udayabbayañāṇādipaṭipāṭiyā vipassanaṃ anulomagotrabhusamīpaṃ pāpesi. Obhāsavissajjanapubbikā bhāsitagāthā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "obhāsagāthā"
      },
      "."
    ],
    "innerText": "Bhikkhūti pabbajitavohārena vuttaṃ, bhāvinaṃ vā bhikkhubhāvaṃ upādāya yathā ‘‘agamā rājagahaṃ buddho’’ti (su. ni. 410). Pilotikakhaṇḍanti suvisuddhaṃ coḷakhaṇḍaṃ . Rajo haratīti rajoharaṇaṃ. Abhinimminitvā adāsi tattha pubbe katādhikārattā. Tathā hi yoniso ummujjanto ‘‘attabhāvassa panāyaṃ doso’’ti asubhasaññaṃ, aniccasaññañca paṭilabhitvā nāmarūpapariggahādinā pañcasu khandhesu ñāṇaṃ otāretvā kalāpasammasanādikkamena vipassanaṃ vaḍḍhetvā udayabbayañāṇādipaṭipāṭiyā vipassanaṃ anulomagotrabhusamīpaṃ pāpesi. Obhāsavissajjanapubbikā bhāsitagāthā obhāsagāthā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rāgo rajo"
      },
      " ariyassa vinaye, na ca pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "reṇu vuccati ‘‘rajo’’"
      },
      "ti. Kasmā? Cittassa malīnabhāvakaraṇato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rāgassetaṃ adhivacanaṃ ‘‘rajo’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etaṃ raja"
      },
      "nti etaṃ rāgasaṅkhātaṃ rajaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vippajahitvā"
      },
      "ti aggamaggena visesato pajahanahetu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇḍitā viharanti te"
      },
      "ti te pajahanakā paṇḍitā hutvā viharanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vītarajassa"
      },
      " sabbaso pahīnarāgādirajassa buddhassa bhagavato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāsane"
      },
      ". Tathā hi vadanti –"
    ],
    "innerText": "Rāgo rajo ariyassa vinaye, na ca pana reṇu vuccati ‘‘rajo’’ti. Kasmā? Cittassa malīnabhāvakaraṇato. Rāgassetaṃ adhivacanaṃ ‘‘rajo’’ti. Etaṃ rajanti etaṃ rāgasaṅkhātaṃ rajaṃ. Vippajahitvāti aggamaggena visesato pajahanahetu. Paṇḍitā viharanti teti te pajahanakā paṇḍitā hutvā viharanti. Vītarajassa sabbaso pahīnarāgādirajassa buddhassa bhagavato sāsane. Tathā hi vadanti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Cittamhi saṃkiliṭṭhamhi, saṃkilissanti māṇavā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Citte suddhe visujjhanti, iti vuttaṃ mahesinā’’ti. (dī. ni. aṭṭha. 2.373; ma. ni. aṭṭha. 1.106; saṃ. ni. aṭṭha. 2.3.100; itivu. aṭṭha. 88);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Chaḷabhiññāgahaṇena gahitāya chaḷabhiññāya vibhāvitepi ariyamagge anuttarabhāvasāmaññena phalanibbānehi saddhiṃ saṅgaṇhanto āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘nava lokuttaradhammā’’"
      },
      "ti."
    ],
    "innerText": "Chaḷabhiññāgahaṇena gahitāya chaḷabhiññāya vibhāvitepi ariyamagge anuttarabhāvasāmaññena phalanibbānehi saddhiṃ saṅgaṇhanto āha ‘‘nava lokuttaradhammā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pattassa pidahanākārena hatthaṃ ṭhapento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘hatthaṃ pidahī’’"
      },
      "ti vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hattha"
      },
      "nti vā karaṇatthe upayogavacanaṃ, hatthena pidahīti attho."
    ],
    "innerText": "Pattassa pidahanākārena hatthaṃ ṭhapento ‘‘hatthaṃ pidahī’’ti vutto. Hatthanti vā karaṇatthe upayogavacanaṃ, hatthena pidahīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahassakkhattu"
      },
      "nti ",
      " sahassadhā. Sahassadhā hi attānaṃ ekacitteneva nimminantopi sahassavāraṃ nimminanto viya hoti. Asatipi kiriyābyāvuttiyaṃ tadatthasiddhitoti imamatthaṃ dassetuṃ ‘‘sahassakkhattu’’nti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ambavane"
      },
      "ti ambavane katavihāre. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ramme"
      },
      "ti ramaṇīye. Yāva kālappavedanā, tāva nisīdīti yojanā."
    ],
    "innerText": "Sahassakkhattunti sahassadhā. Sahassadhā hi attānaṃ ekacitteneva nimminantopi sahassavāraṃ nimminanto viya hoti. Asatipi kiriyābyāvuttiyaṃ tadatthasiddhitoti imamatthaṃ dassetuṃ ‘‘sahassakkhattu’’nti vuttaṃ. Ambavaneti ambavane katavihāre. Rammeti ramaṇīye. Yāva kālappavedanā, tāva nisīdīti yojanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniyametvā"
      },
      "ti vaṇṇāvayavasarīrāvayavaparikkhārakiriyāvisesādīhi niyamaṃ akatvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānāvaṇṇe"
      },
      "ti nānākāre yathāvuttavaṇṇādivasena nānāvidhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Missakakese"
      },
      "ti palitehi missitakese. Upaḍḍharattavaṇṇaupaḍḍhapaṇḍuvaṇṇādīsu aññataravaṇṇanti evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upaḍḍharattacīvare"
      },
      ". Padavasena atthassa ",
      ", gamanavasena pāḷiyā bhaṇanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padabhāṇaṃ"
      },
      ". Parikathādivasena dhammassa kathanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammakathā"
      },
      ". Sarena bhaññaṃ suttādīnaṃ uccāraṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sarabhaññaṃ. Aparepī"
      },
      "ti vuttākārato aññepi dīgharassakisathūlādike nānappakārake. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Icchiticchitappakārāyeva hontī"
      },
      "ti yathā yathā icchitā, taṃtaṃpakārāyeva honti. Yattakā hi visesā vaṇṇādivasena tesu icchitā, tattakavisesavantova te honti. Te pana tathā bahudhā bhinnākārepi vaṇṇavasena ārammaṇaṃ katvā ekameva adhiṭṭhānacittaṃ pavattati. Ayaṃ hissa ānubhāvo – yathā ekāva cetanā nānāvisesavantaṃ attabhāvaṃ nibbatteti, tattha bhavapatthanā kammassa visesapaccayo hoti. Acinteyyo ca kammavipākoti ce, idhāpi parikammacittaṃ visesapaccayo hoti, acinteyyo ca iddhivisayoti gahetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Esa nayo"
      },
      "ti yvāyaṃ bahubhāvanimmāne ‘‘abhiññāpādakaṃ jhānaṃ samāpajjitvā’’tiādinā adhiṭṭhānanayo vutto, esa nayo itaresupi adhiṭṭhānesu."
    ],
    "innerText": "Aniyametvāti vaṇṇāvayavasarīrāvayavaparikkhārakiriyāvisesādīhi niyamaṃ akatvā. Nānāvaṇṇeti nānākāre yathāvuttavaṇṇādivasena nānāvidhe. Missakakeseti palitehi missitakese. Upaḍḍharattavaṇṇaupaḍḍhapaṇḍuvaṇṇādīsu aññataravaṇṇanti evaṃ upaḍḍharattacīvare. Padavasena atthassa , gamanavasena pāḷiyā bhaṇanaṃ padabhāṇaṃ. Parikathādivasena dhammassa kathanaṃ dhammakathā. Sarena bhaññaṃ suttādīnaṃ uccāraṇaṃ sarabhaññaṃ. Aparepīti vuttākārato aññepi dīgharassakisathūlādike nānappakārake. Icchiticchitappakārāyeva hontīti yathā yathā icchitā, taṃtaṃpakārāyeva honti. Yattakā hi visesā vaṇṇādivasena tesu icchitā, tattakavisesavantova te honti. Te pana tathā bahudhā bhinnākārepi vaṇṇavasena ārammaṇaṃ katvā ekameva adhiṭṭhānacittaṃ pavattati. Ayaṃ hissa ānubhāvo – yathā ekāva cetanā nānāvisesavantaṃ attabhāvaṃ nibbatteti, tattha bhavapatthanā kammassa visesapaccayo hoti. Acinteyyo ca kammavipākoti ce, idhāpi parikammacittaṃ visesapaccayo hoti, acinteyyo ca iddhivisayoti gahetabbaṃ. Esa nayoti yvāyaṃ bahubhāvanimmāne ‘‘abhiññāpādakaṃ jhānaṃ samāpajjitvā’’tiādinā adhiṭṭhānanayo vutto, esa nayo itaresupi adhiṭṭhānesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iti avisesaṃ atidesena dassetvā visesaṃ sarūpato dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ayaṃ pana viseso’’"
      },
      "tiādi vuttaṃ. Tattha iminā bhikkhunā icchantenāti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maṃ jānissantī"
      },
      "ti ‘‘iddhimā’’ti maṃ jānissanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antarāvā"
      },
      "ti paricchinnakālassa abbhantare eva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pādakajjhāna"
      },
      "ntiādi parikammakaraṇākāradassanatthaṃ vuttaṃ, itaraṃ pana atideseneva vibhāvitanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ akaronto"
      },
      "ti ‘‘eko homī’’ti antarā adhiṭṭhānaṃ akaronto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Yathāparicchinnakālavasenā’’"
      },
      "ti iminā ‘‘sataṃ homī’’tiādinā adhiṭṭhānaṃ karontena kālaparicchedavaseneva kātabbanti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sayameva eko hoti"
      },
      " adhiṭṭhānassa paṭippassaddhattā. Ettha ca parikammādhiṭṭhānacittānaṃ iddhimā vaṇṇavasena sayameva ārammaṇaṃ hoti. Tesu parikammacittāni ",
      " santatipaccuppannārammaṇāni. Adhiṭṭhānacittaṃ sampativattamānārammaṇaṃ adhiṭṭhānassa ekacittakkhaṇikattāti vadanti."
    ],
    "innerText": "Iti avisesaṃ atidesena dassetvā visesaṃ sarūpato dassetuṃ ‘‘ayaṃ pana viseso’’tiādi vuttaṃ. Tattha iminā bhikkhunā icchantenāti sambandho. Maṃ jānissantīti ‘‘iddhimā’’ti maṃ jānissanti. Antarāvāti paricchinnakālassa abbhantare eva. Pādakajjhānantiādi parikammakaraṇākāradassanatthaṃ vuttaṃ, itaraṃ pana atideseneva vibhāvitanti. Evaṃ akarontoti ‘‘eko homī’’ti antarā adhiṭṭhānaṃ akaronto. ‘‘Yathāparicchinnakālavasenā’’ti iminā ‘‘sataṃ homī’’tiādinā adhiṭṭhānaṃ karontena kālaparicchedavaseneva kātabbanti dasseti. Sayameva eko hoti adhiṭṭhānassa paṭippassaddhattā. Ettha ca parikammādhiṭṭhānacittānaṃ iddhimā vaṇṇavasena sayameva ārammaṇaṃ hoti. Tesu parikammacittāni santatipaccuppannārammaṇāni. Adhiṭṭhānacittaṃ sampativattamānārammaṇaṃ adhiṭṭhānassa ekacittakkhaṇikattāti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "387"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Āvibhāva’’"
      },
      "nti padassa heṭṭhā vuttena hoti-saddena sambandho na yujjati upayogavacanena vuttattā, tathā vakkhamānena ca gacchati-saddena attano, paresañca āvibhāvassa icchitattā, nāmapadañca kiriyāpadāpekkhanti kiriyāsāmaññavācinā karoti-saddena yojetvā āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āvibhāvaṃ karotī’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tirobhāva"
      },
      "nti etthāpi eseva nayo ",
      ". Yadi evaṃ kathaṃ paṭisambhidāyanti codanaṃ sandhāyāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘idameva hī’’"
      },
      "tiādi. Kāmaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisambhidāyaṃ"
      },
      " ‘‘āvibhāvanti kenaci anāvaṭaṃ hotī’’tiādinā (paṭi. ma. 3.11) āgataṃ, tampi idameva āvibhāvakaraṇaṃ, tirobhāvakaraṇañca sandhāya vuttaṃ. Sesapadāni tesaṃyeva vevacanāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Andhakāra"
      },
      "nti rattandhakāraṃ, divāpi vā bilaguhādigataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "andhakāraṃ. Paṭicchanna"
      },
      "nti kuṭṭakavāṭādinā paṭicchāditaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāpātha"
      },
      "nti dūratāsukhumataratādinā na āpāthagataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aya"
      },
      "nti iddhimā. Paṭicchannopi dūre ṭhitopi attā vā paro vā yathā dissatīti vibhattiṃ pariṇāmetvā yojetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ālokajāta"
      },
      "nti ālokabhūtaṃ, jātālokaṃ vā."
    ],
    "innerText": "387.‘‘Āvibhāva’’nti padassa heṭṭhā vuttena hoti-saddena sambandho na yujjati upayogavacanena vuttattā, tathā vakkhamānena ca gacchati-saddena attano, paresañca āvibhāvassa icchitattā, nāmapadañca kiriyāpadāpekkhanti kiriyāsāmaññavācinā karoti-saddena yojetvā āha ‘‘āvibhāvaṃ karotī’’ti. Tirobhāvanti etthāpi eseva nayo . Yadi evaṃ kathaṃ paṭisambhidāyanti codanaṃ sandhāyāha ‘‘idameva hī’’tiādi. Kāmaṃ paṭisambhidāyaṃ ‘‘āvibhāvanti kenaci anāvaṭaṃ hotī’’tiādinā (paṭi. ma. 3.11) āgataṃ, tampi idameva āvibhāvakaraṇaṃ, tirobhāvakaraṇañca sandhāya vuttaṃ. Sesapadāni tesaṃyeva vevacanāni. Andhakāranti rattandhakāraṃ, divāpi vā bilaguhādigataṃ andhakāraṃ. Paṭicchannanti kuṭṭakavāṭādinā paṭicchāditaṃ. Anāpāthanti dūratāsukhumataratādinā na āpāthagataṃ. Ayanti iddhimā. Paṭicchannopi dūre ṭhitopi attā vā paro vā yathā dissatīti vibhattiṃ pariṇāmetvā yojetabbaṃ. Ālokajātanti ālokabhūtaṃ, jātālokaṃ vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "388"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etaṃ pana pāṭihāriya"
      },
      "nti āvibhāvapāṭihāriyamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kena katapubba"
      },
      "nti tattha kāyasakkhiṃ pucchitvā ‘‘satthā tāva kāyasakkhī’’ti dassentena ‘‘bhagavatā’’ti vatvā tamatthaṃ vibhāvetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bhagavā hī’’"
      },
      "tiādi vuttaṃ. Sāvatthivāsike passantīti ānetvā sambandho, tathā ‘‘yāva avīciṃ dassesī’’ti. Ākāsagatesu heṭṭhimaheṭṭhimavimānesu uparūparivimānaṃ byavadhāyakesu byūhiyamānesu taggataṃ ākāsaṃ byūḷhaṃ nāma hotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ākāsañca dvidhā viyūhitvā’’"
      },
      "ti."
    ],
    "innerText": "388.Etaṃ pana pāṭihāriyanti āvibhāvapāṭihāriyamāha. Kena katapubbanti tattha kāyasakkhiṃ pucchitvā ‘‘satthā tāva kāyasakkhī’’ti dassentena ‘‘bhagavatā’’ti vatvā tamatthaṃ vibhāvetuṃ ‘‘bhagavā hī’’tiādi vuttaṃ. Sāvatthivāsike passantīti ānetvā sambandho, tathā ‘‘yāva avīciṃ dassesī’’ti. Ākāsagatesu heṭṭhimaheṭṭhimavimānesu uparūparivimānaṃ byavadhāyakesu byūhiyamānesu taggataṃ ākāsaṃ byūḷhaṃ nāma hotīti vuttaṃ ‘‘ākāsañca dvidhā viyūhitvā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayamattho"
      },
      "ti āvibhāvapāṭihāriyassa satthārā katabhāvo. Purimabuddhānaṃ paṭipattiāvajjanaṃ buddhappaveṇiyā anupālanatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Ekena pādenā’’"
      },
      "tiādi tivikkamadassanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nayaṃ deti"
      },
      " yassa nayassa anusārena vācanāmaggaṃ ṭhapesi."
    ],
    "innerText": "Ayamatthoti āvibhāvapāṭihāriyassa satthārā katabhāvo. Purimabuddhānaṃ paṭipattiāvajjanaṃ buddhappaveṇiyā anupālanatthaṃ. ‘‘Ekena pādenā’’tiādi tivikkamadassanaṃ. Nayaṃ deti yassa nayassa anusārena vācanāmaggaṃ ṭhapesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cūḷaanāthapiṇḍiko"
      },
      " nāma anāthapiṇḍikamahāseṭṭhissa kaniṭṭhabhātā."
    ],
    "innerText": "Cūḷaanāthapiṇḍiko nāma anāthapiṇḍikamahāseṭṭhissa kaniṭṭhabhātā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sinerupabbataṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nibbijjhitvā"
      },
      "ti taṃ parisāya dissamānarūpaṃyeva katvā nibbijjhitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      "nti sinerupabbataṃ."
    ],
    "innerText": "Sinerupabbataṃnibbijjhitvāti taṃ parisāya dissamānarūpaṃyeva katvā nibbijjhitvā. Nanti sinerupabbataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anekasatasahassasaṅkhassa okāsalokassa, taṃnivāsisattalokassa ca vivaṭabhāvakaraṇapāṭihāriyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokavivaraṇaṃ nāma. Mahābrahmā"
      },
      "ti sahampatimahābrahmā."
    ],
    "innerText": "Anekasatasahassasaṅkhassa okāsalokassa, taṃnivāsisattalokassa ca vivaṭabhāvakaraṇapāṭihāriyaṃ lokavivaraṇaṃ nāma. Mahābrahmāti sahampatimahābrahmā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Passatha ",
      " tāva apaṇṇakapaṭipadāya phalanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nirayabhayena tajjetvā"
      },
      " satthu anupubbikathānayena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saggasukhena palobhetvā,"
      },
      " na pana saggasampattiyaṃ ninnabhāvāpādanena."
    ],
    "innerText": "Passatha tāva apaṇṇakapaṭipadāya phalanti nirayabhayena tajjetvā satthu anupubbikathānayena saggasukhena palobhetvā, na pana saggasampattiyaṃ ninnabhāvāpādanena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "389"
      },
      ". Yathā āvibhāvakaraṇe ālokakasiṇaṃ samāpajjitabbaṃ ālokanimmānāya, evaṃ tirobhāvakaraṇe andhakāranimmānāya nīlakasiṇaṃ samāpajjitabbaṃ. Kāmañcetaṃ pāḷiyaṃ sarūpato nāgataṃ, ‘‘vivaṭaṃ āvaṭa’’nti (paṭi. ma. 3.11) pana vacanato atthato āgatameva. Odātakasiṇantogadhaṃ vā ālokakasiṇanti vuttovāyamattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Andhakāra"
      },
      "nti andhakāravantaṃ."
    ],
    "innerText": "389. Yathā āvibhāvakaraṇe ālokakasiṇaṃ samāpajjitabbaṃ ālokanimmānāya, evaṃ tirobhāvakaraṇe andhakāranimmānāya nīlakasiṇaṃ samāpajjitabbaṃ. Kāmañcetaṃ pāḷiyaṃ sarūpato nāgataṃ, ‘‘vivaṭaṃ āvaṭa’’nti (paṭi. ma. 3.11) pana vacanato atthato āgatameva. Odātakasiṇantogadhaṃ vā ālokakasiṇanti vuttovāyamattho. Andhakāranti andhakāravantaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "390"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avasese"
      },
      " iṭṭiyattherādike."
    ],
    "innerText": "390.Avasese iṭṭiyattherādike."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "391"
      },
      ". Pākaṭo iddhimā etassa atthīti pākaṭaṃ, pākaṭañca taṃ pāṭihāriyañcāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pākaṭapāṭihāriyaṃ"
      },
      ". Na ettha iddhimā pākaṭoti apākaṭaṃ, apākaṭañca taṃ pāṭihāriyañcāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apākaṭapāṭihāriyaṃ"
      },
      ". Iddhimato eva hi pākaṭāpākaṭabhāvenāyaṃ bhedo, na pāṭihāriyassa. Na hi taṃ apākaṭaṃ atthi."
    ],
    "innerText": "391. Pākaṭo iddhimā etassa atthīti pākaṭaṃ, pākaṭañca taṃ pāṭihāriyañcāti pākaṭapāṭihāriyaṃ. Na ettha iddhimā pākaṭoti apākaṭaṃ, apākaṭañca taṃ pāṭihāriyañcāti apākaṭapāṭihāriyaṃ. Iddhimato eva hi pākaṭāpākaṭabhāvenāyaṃ bhedo, na pāṭihāriyassa. Na hi taṃ apākaṭaṃ atthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttarimanussadhammā"
      },
      "ti manussadhammo vuccati dasa kusalakammapathadhammā, tato manussadhammato uttari. Iddhisaṅkhātaṃ pāṭihāriyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iddhipāṭihāriyaṃ. Āḷinde"
      },
      "ti pamukhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Okāsehī"
      },
      "ti pakira. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhābhisaṅkhāra"
      },
      "nti iddhipayogaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhisaṅkhāsī"
      },
      "ti abhisaṅkhari, akāsīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tālacchiggaḷenā"
      },
      "ti kuñcikacchiddena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aggaḷantarikāyā"
      },
      "ti piṭṭhasaṅghātānaṃ antarena."
    ],
    "innerText": "Uttarimanussadhammāti manussadhammo vuccati dasa kusalakammapathadhammā, tato manussadhammato uttari. Iddhisaṅkhātaṃ pāṭihāriyaṃ iddhipāṭihāriyaṃ. Āḷindeti pamukhe. Okāsehīti pakira. Iddhābhisaṅkhāranti iddhipayogaṃ. Abhisaṅkhāsīti abhisaṅkhari, akāsīti attho. Tālacchiggaḷenāti kuñcikacchiddena. Aggaḷantarikāyāti piṭṭhasaṅghātānaṃ antarena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antarahito"
      },
      "ti antaradhāyitukāmo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bako"
      },
      " brahmā yathā antaradhāyituṃ na sakkoti, tathā katvā bhagavā sayaṃ tassa, brahmagaṇassa ca anāpāthabhāvagamanena antarahito hutvā ‘‘samaṇassa gotamassa ",
      " imasmiṃ ṭhāne atthibhāvo vā natthibhāvo vā na sakkā jānitu’’nti evaṃ brahmagaṇassa vacanokāso mā hotūti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bhavevāha’’"
      },
      "nti imaṃ gāthaṃ abhāsi."
    ],
    "innerText": "Antarahitoti antaradhāyitukāmo. Bako brahmā yathā antaradhāyituṃ na sakkoti, tathā katvā bhagavā sayaṃ tassa, brahmagaṇassa ca anāpāthabhāvagamanena antarahito hutvā ‘‘samaṇassa gotamassa imasmiṃ ṭhāne atthibhāvo vā natthibhāvo vā na sakkā jānitu’’nti evaṃ brahmagaṇassa vacanokāso mā hotūti ‘‘bhavevāha’’nti imaṃ gāthaṃ abhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhavevāhaṃ bhayaṃ disvā"
      },
      "ti ahaṃ bhave saṃsāre jātijarādibhedaṃ bhayaṃ disvā eva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavañca vibhavesina"
      },
      "nti imañca kāmabhavādiṃ tividhampi ",
      " sattabhavaṃ, vibhavesinaṃ vibhavaṃ gavesamānampi pariyesamānampi punappunaṃ bhave eva disvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavaṃ nābhivadi"
      },
      "nti taṇhādiṭṭhivasena kiñci bhavaṃ na abhivadiṃ na gahesiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nandiñca na upādiyi"
      },
      "nti bhavataṇhaṃ na upagacchiṃ, na aggahesinti attho."
    ],
    "innerText": "Tattha bhavevāhaṃ bhayaṃ disvāti ahaṃ bhave saṃsāre jātijarādibhedaṃ bhayaṃ disvā eva. Bhavañca vibhavesinanti imañca kāmabhavādiṃ tividhampi sattabhavaṃ, vibhavesinaṃ vibhavaṃ gavesamānampi pariyesamānampi punappunaṃ bhave eva disvā. Bhavaṃ nābhivadinti taṇhādiṭṭhivasena kiñci bhavaṃ na abhivadiṃ na gahesiṃ. Nandiñca na upādiyinti bhavataṇhaṃ na upagacchiṃ, na aggahesinti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "392"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alaggamāno"
      },
      "ti vinivijjhitvā gamanena kuṭṭādīsu katthaci na laggamāno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvajjitvā kataparikammenā"
      },
      "ti yassa parato gantukāmo, taṃ āvajjitvā ‘‘ākāso hotu, ākāso hotū’’ti evaṃ kataparikammena iddhimatā. Pākārapabbatāpekkhāya ‘‘susiro, chiddo’’ti ca pulliṅgavasena vuttaṃ. Ubbedhavasena pavattaṃ vivaraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "susiraṃ"
      },
      ". Tiriyaṃ pavattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chiddaṃ"
      },
      "."
    ],
    "innerText": "392.Alaggamānoti vinivijjhitvā gamanena kuṭṭādīsu katthaci na laggamāno. Āvajjitvā kataparikammenāti yassa parato gantukāmo, taṃ āvajjitvā ‘‘ākāso hotu, ākāso hotū’’ti evaṃ kataparikammena iddhimatā. Pākārapabbatāpekkhāya ‘‘susiro, chiddo’’ti ca pulliṅgavasena vuttaṃ. Ubbedhavasena pavattaṃ vivaraṃ susiraṃ. Tiriyaṃ pavattaṃ chiddaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yattha katthaci kasiṇe parikammaṃ katvā"
      },
      "ti pathavīkasiṇādīsu yattha katthaci kasiṇe jhānaṃ samāpajjitvā parikammaṃ katvā ‘‘ākāso hotū’’ti adhiṭṭhātabbo. Tattha kāraṇamāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘aṭṭhasamāpattivasībhāvoyeva pamāṇa’’"
      },
      "nti. Tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yaṃ yaṃ icchati, taṃ tadeva hoti"
      },
      ". Etena pathaviyā ummujjananimujjane āpokasiṇasamāpajjanaṃ, udakādīsu pathavīnimmāne pathavīkasiṇasamāpajjanaṃ na ekantato icchitabbanti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eta"
      },
      "nti etaṃ tirokuṭṭādigamanapāṭihāriyakaraṇe ākāsakasiṇasamāpajjanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avassaṃ vattabbaṃ"
      },
      " anucchavikabhāvato. Evañca katvā ‘‘ākāsakasiṇavasena paṭicchannānaṃ vivaṭakaraṇa’’ntiādivacanaṃ viya pathavīkasiṇavasena ‘‘ekopi hutvā bahudhā hotī’’tiādibhāvo ‘‘ākāse vā udake vā pathaviṃ nimminitvā padasā gamanaṃ icchatī’’tiādinā yaṃ pakiṇṇakanaye vuttaṃ, tampi samatthitaṃ hoti."
    ],
    "innerText": "Yattha katthaci kasiṇe parikammaṃ katvāti pathavīkasiṇādīsu yattha katthaci kasiṇe jhānaṃ samāpajjitvā parikammaṃ katvā ‘‘ākāso hotū’’ti adhiṭṭhātabbo. Tattha kāraṇamāha ‘‘aṭṭhasamāpattivasībhāvoyeva pamāṇa’’nti. Tasmā yaṃ yaṃ icchati, taṃ tadeva hoti. Etena pathaviyā ummujjananimujjane āpokasiṇasamāpajjanaṃ, udakādīsu pathavīnimmāne pathavīkasiṇasamāpajjanaṃ na ekantato icchitabbanti vuttaṃ hoti. Etanti etaṃ tirokuṭṭādigamanapāṭihāriyakaraṇe ākāsakasiṇasamāpajjanaṃ avassaṃ vattabbaṃ anucchavikabhāvato. Evañca katvā ‘‘ākāsakasiṇavasena paṭicchannānaṃ vivaṭakaraṇa’’ntiādivacanaṃ viya pathavīkasiṇavasena ‘‘ekopi hutvā bahudhā hotī’’tiādibhāvo ‘‘ākāse vā udake vā pathaviṃ nimminitvā padasā gamanaṃ icchatī’’tiādinā yaṃ pakiṇṇakanaye vuttaṃ, tampi samatthitaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Doso natthī’’ti dvikkhattuṃ baddhaṃ subaddhaṃ viya daḷhīkaraṇaṃ nāma hotīti adhippāyena vatvā tena payojanābhāvaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘puna samāpajjitvā’’"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhiṭṭhitattā ākāso hotiyevā"
      },
      "ti sacepi kiñci antarā upaṭṭhitaṃ pabbatādi siyā, tampi ‘‘ākāso hotū’’ti adhiṭṭhitattā ",
      " ākāso hotiyeva. Idampi aṭṭhānaparikappanamattaṃ, tādisassa upaṭṭhānameva natthīti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘antarā’’"
      },
      "tiādi vuttaṃ."
    ],
    "innerText": "‘‘Doso natthī’’ti dvikkhattuṃ baddhaṃ subaddhaṃ viya daḷhīkaraṇaṃ nāma hotīti adhippāyena vatvā tena payojanābhāvaṃ dassetuṃ ‘‘puna samāpajjitvā’’tiādi vuttaṃ. Adhiṭṭhitattā ākāso hotiyevāti sacepi kiñci antarā upaṭṭhitaṃ pabbatādi siyā, tampi ‘‘ākāso hotū’’ti adhiṭṭhitattā ākāso hotiyeva. Idampi aṭṭhānaparikappanamattaṃ, tādisassa upaṭṭhānameva natthīti dassetuṃ ‘‘antarā’’tiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "393"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paricchinditvā"
      },
      "ti yathicchitaṭṭhānaṃ ñāṇena paricchinditvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatrā"
      },
      "ti tasmiṃ pathaviyā udakabhāvādhiṭṭhāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ayaṃ"
      },
      " yathāvuttapaṭipattivibhāvinī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāḷi"
      },
      ". Parato ‘‘tatrāyaṃ pāḷī’’ti āgataṭṭhānesupi iminā nayena attho veditabbo."
    ],
    "innerText": "393.Paricchinditvāti yathicchitaṭṭhānaṃ ñāṇena paricchinditvā. Tatrāti tasmiṃ pathaviyā udakabhāvādhiṭṭhāne ayaṃ yathāvuttapaṭipattivibhāvinī pāḷi. Parato ‘‘tatrāyaṃ pāḷī’’ti āgataṭṭhānesupi iminā nayena attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So"
      },
      "ti iddhimā. Adhiṭṭhānakāle kālaparicchedaṃ katvā adhiṭṭhātīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paricchinnakālaṃ pana atikkamitvā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakatiyā udakaṃ"
      },
      " animmānaudakaṃ."
    ],
    "innerText": "Soti iddhimā. Adhiṭṭhānakāle kālaparicchedaṃ katvā adhiṭṭhātīti vuttaṃ ‘‘paricchinnakālaṃ pana atikkamitvā’’ti. Pakatiyā udakaṃ animmānaudakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "394"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viparīta"
      },
      "nti yaṃ udakaṃ akkamitvā akkamanto na saṃsīdati, taṃ panettha iddhiyā pathavīnimmānavasena veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pathavīkasiṇa"
      },
      "nti pathavīkasiṇajjhānaṃ."
    ],
    "innerText": "394.Viparītanti yaṃ udakaṃ akkamitvā akkamanto na saṃsīdati, taṃ panettha iddhiyā pathavīnimmānavasena veditabbaṃ. Pathavīkasiṇanti pathavīkasiṇajjhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "395"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pallaṅka"
      },
      "nti samantato ūrubaddhāsanaṃ. Chinnapakkho, asañjātapakkho vā sakuṇo ḍetuṃ na sakkotīti pāḷiyaṃ ‘‘pakkhī sakuṇo’’ti (paṭi. ma. 3.11) pakkhī-saddena visesetvā sakuṇo vuttoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pakkhehi yuttasakuṇo’’"
      },
      "ti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parikammaṃ katvā"
      },
      "ti ‘‘pathavī hotū’’ti parikammaṃ katvā."
    ],
    "innerText": "395.Pallaṅkanti samantato ūrubaddhāsanaṃ. Chinnapakkho, asañjātapakkho vā sakuṇo ḍetuṃ na sakkotīti pāḷiyaṃ ‘‘pakkhī sakuṇo’’ti (paṭi. ma. 3.11) pakkhī-saddena visesetvā sakuṇo vuttoti ‘‘pakkhehi yuttasakuṇo’’ti āha. Parikammaṃ katvāti ‘‘pathavī hotū’’ti parikammaṃ katvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākāse antalikkhe"
      },
      "ti antalikkhasaññite ākāse. Yattha yattha hi āvaraṇaṃ natthi, taṃ taṃ ‘‘ākāsa’’nti vuccati. Ayañca iddhimā na pathaviyā āsanne ākāse gacchati. Yattha pana pakkhīnaṃ agocaro, tattha gacchati, tādisañca loke ‘‘antalikkha’’nti vuccati. Tena vuttaṃ ‘‘antalikkhasaññite ākāse’’ti."
    ],
    "innerText": "Ākāse antalikkheti antalikkhasaññite ākāse. Yattha yattha hi āvaraṇaṃ natthi, taṃ taṃ ‘‘ākāsa’’nti vuccati. Ayañca iddhimā na pathaviyā āsanne ākāse gacchati. Yattha pana pakkhīnaṃ agocaro, tattha gacchati, tādisañca loke ‘‘antalikkha’’nti vuccati. Tena vuttaṃ ‘‘antalikkhasaññite ākāse’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thero"
      },
      "ti pubbe vutta ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tipiṭakacūḷābhayatthero. Samāpattisamāpajjana"
      },
      "nti puna samāpattisamāpajjanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nanu samāhitamevassa citta"
      },
      "nti iddhimato pāṭihāriyavasena pavattamānassa cittaṃ accantaṃ samāhitameva hoti, na aññadā viya asamāhitanti adhippāyo. Taṃ pana therassa matimattaṃ. Pubbe hi pathavīkasiṇaṃ samāpajjitvā pathaviṃ adhiṭṭhāya gacchati, idāni pana ākāso icchitabbo, tasmā ākāsakasiṇaṃ samāpajjitabbameva. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kiñcāpī’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tirokuṭṭapāṭihāriye"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuttanayeneva paṭipajjitabba"
      },
      "nti yathā tattha kuṭṭādi ‘‘ākāso hotū’’ti adhiṭṭhānena ākāso hoti, evaṃ idhāpi pabbatarukkhādiṃ adhiṭṭhānena ākāsaṃ katvā gantabbanti attho. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tirokuṭṭapāṭihāriye vuttanayenevā"
      },
      "ti ‘‘sace panassa bhikkhuno adhiṭṭhahitvā gacchantassā’’tiādinā (visuddhi. 2.392) tattha ",
      " vuttanayena. Etena ‘‘purimādhiṭṭhānabaleneva cassa antarā añño pabbato vā rukkho vā utumayo uṭṭhahissatīti aṭṭhānameveta’’nti nāgādīhi kayiramāno vibandho gamanantarāyaṃ na karotīti dasseti."
    ],
    "innerText": "Theroti pubbe vutta tipiṭakacūḷābhayatthero. Samāpattisamāpajjananti puna samāpattisamāpajjanaṃ. Nanu samāhitamevassa cittanti iddhimato pāṭihāriyavasena pavattamānassa cittaṃ accantaṃ samāhitameva hoti, na aññadā viya asamāhitanti adhippāyo. Taṃ pana therassa matimattaṃ. Pubbe hi pathavīkasiṇaṃ samāpajjitvā pathaviṃ adhiṭṭhāya gacchati, idāni pana ākāso icchitabbo, tasmā ākāsakasiṇaṃ samāpajjitabbameva. Tenāha ‘‘kiñcāpī’’tiādi. Tirokuṭṭapāṭihāriyevuttanayeneva paṭipajjitabbanti yathā tattha kuṭṭādi ‘‘ākāso hotū’’ti adhiṭṭhānena ākāso hoti, evaṃ idhāpi pabbatarukkhādiṃ adhiṭṭhānena ākāsaṃ katvā gantabbanti attho. Atha vā tirokuṭṭapāṭihāriye vuttanayenevāti ‘‘sace panassa bhikkhuno adhiṭṭhahitvā gacchantassā’’tiādinā (visuddhi. 2.392) tattha vuttanayena. Etena ‘‘purimādhiṭṭhānabaleneva cassa antarā añño pabbato vā rukkho vā utumayo uṭṭhahissatīti aṭṭhānameveta’’nti nāgādīhi kayiramāno vibandho gamanantarāyaṃ na karotīti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Okāse"
      },
      "ti janavivitte yuttaṭṭhāne. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pākaṭo hoti"
      },
      " ākāsacārī ayaṃ samaṇoti."
    ],
    "innerText": "Okāseti janavivitte yuttaṭṭhāne. Pākaṭo hoti ākāsacārī ayaṃ samaṇoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "396"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvācattālīsayojanasahassa"
      },
      "ggahaṇaṃ paṭhamakappavasena kataṃ, tato paraṃ pana anukkamena pathaviyā ussitabhāvena tato katipayayojanūnatā siyā, appakaṃ adhikaṃ vā ūnaṃ vā gaṇanūpagaṃ na hotīti tathā vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tīsu dīpesu ekakkhaṇe ālokakaraṇenā"
      },
      "ti yadā yasmiṃ dīpe majjhe tiṭṭhanti, tadā tato purimasmiṃ atthaṃ gacchantā pacchime udentā hutvā ālokakaraṇena. Aññajotīnaṃ vā abhibhavanena, duddasatāya ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahiddhike"
      },
      ". Sattānaṃ sītapariḷāhavūpasamanena, osadhitiṇavanappatīnaṃ paribrūhanena ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahānubhāve. Chupatī"
      },
      "ti phusati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parimajjatī"
      },
      "ti hatthaṃ ito cito ca sañcārento ghaṃseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhiññāpādakajjhānavasenevā"
      },
      "ti yassa kassaci abhiññāpādakajjhānavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eva"
      },
      "-kārena pādakajjhānavisesaṃ nivatteti, na adhiṭṭhānaṃ. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘natthettha kasiṇasamāpattiniyamo’’"
      },
      "ti. Tirokuṭṭapāṭihāriyādīsu viya imasmiṃ nāma kasiṇe jhānaṃ samāpajjitvā adhiṭṭhātabbanti na ettha koci niyamo atthīti attho. Tathā hi pāḷiyaṃ kiñci samāpattiṃ aparāmasitvā ‘‘idha so iddhimā’’tiādi (paṭi. ma. 3.10-11) vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hatthapāse hoti"
      },
      " ‘‘candimasūriye’’ti evaṃ vuttaṃ candimasūriyamaṇḍalaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpagataṃ hatthapāse"
      },
      "ti hatthapāse ṭhitaṃ rūpagataṃ, hatthapāse vā rūpagataṃ. Hatthaṃ vā vaḍḍhetvā parāmasatīti yojanā."
    ],
    "innerText": "396.Dvācattālīsayojanasahassaggahaṇaṃ paṭhamakappavasena kataṃ, tato paraṃ pana anukkamena pathaviyā ussitabhāvena tato katipayayojanūnatā siyā, appakaṃ adhikaṃ vā ūnaṃ vā gaṇanūpagaṃ na hotīti tathā vuttaṃ. Tīsu dīpesu ekakkhaṇe ālokakaraṇenāti yadā yasmiṃ dīpe majjhe tiṭṭhanti, tadā tato purimasmiṃ atthaṃ gacchantā pacchime udentā hutvā ālokakaraṇena. Aññajotīnaṃ vā abhibhavanena, duddasatāya ca mahiddhike. Sattānaṃ sītapariḷāhavūpasamanena, osadhitiṇavanappatīnaṃ paribrūhanena ca mahānubhāve. Chupatīti phusati. Parimajjatīti hatthaṃ ito cito ca sañcārento ghaṃseti. Abhiññāpādakajjhānavasenevāti yassa kassaci abhiññāpādakajjhānavasena. Eva-kārena pādakajjhānavisesaṃ nivatteti, na adhiṭṭhānaṃ. Tenevāha ‘‘natthettha kasiṇasamāpattiniyamo’’ti. Tirokuṭṭapāṭihāriyādīsu viya imasmiṃ nāma kasiṇe jhānaṃ samāpajjitvā adhiṭṭhātabbanti na ettha koci niyamo atthīti attho. Tathā hi pāḷiyaṃ kiñci samāpattiṃ aparāmasitvā ‘‘idha so iddhimā’’tiādi (paṭi. ma. 3.10-11) vuttaṃ. Hatthapāse hoti ‘‘candimasūriye’’ti evaṃ vuttaṃ candimasūriyamaṇḍalaṃ. Rūpagataṃ hatthapāseti hatthapāse ṭhitaṃ rūpagataṃ, hatthapāse vā rūpagataṃ. Hatthaṃ vā vaḍḍhetvā parāmasatīti yojanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Upādinnakaṃ nissāya anupādinnakassa vaḍḍhanaṃ vuttaṃ. Yuttiyā panettha upādinnakassapi vaḍḍhanacchāyā dissati. Attano aṇumahantabhāvāpādane upādinnakassa hāpanaṃ viya vaḍḍhanampi labbhateva. Yathā āyasmato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāmoggallānassa nandopananda"
      },
      "damaneti evaṃ pavattaṃ sahavatthunā theravādaṃ āharitvā tamatthaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tipiṭakacūḷanāgatthero āhā’’"
      },
      "tiādi āraddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiṃ pana na hoti,"
      },
      " hotiyevāti ",
      " adhippāyo. Dve hi paṭisedhā ",
      " pakatiṃ gamentīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Tadā mahantaṃ hoti mahāmoggallānattherassa viyā’’"
      },
      "ti idaṃ yathādhikatatthadassanavasena vuttaṃ, khuddakabhāvāpādanampettha labbhateva."
    ],
    "innerText": "Upādinnakaṃ nissāya anupādinnakassa vaḍḍhanaṃ vuttaṃ. Yuttiyā panettha upādinnakassapi vaḍḍhanacchāyā dissati. Attano aṇumahantabhāvāpādane upādinnakassa hāpanaṃ viya vaḍḍhanampi labbhateva. Yathā āyasmato mahāmoggallānassa nandopanandadamaneti evaṃ pavattaṃ sahavatthunā theravādaṃ āharitvā tamatthaṃ dassetuṃ ‘‘tipiṭakacūḷanāgatthero āhā’’tiādi āraddhaṃ. Kiṃ pana na hoti, hotiyevāti adhippāyo. Dve hi paṭisedhā pakatiṃ gamentīti. ‘‘Tadā mahantaṃ hoti mahāmoggallānattherassa viyā’’ti idaṃ yathādhikatatthadassanavasena vuttaṃ, khuddakabhāvāpādanampettha labbhateva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nandopanandanāgadamanakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Olokesi"
      },
      " buddhāciṇṇavasena ‘‘atthi nu kho assa upanissayo’’ti. Lokiyaṃ ratanattaye pasādalakkhaṇaṃ sāsanāvatāraṃ sandhāyāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘appasanno’’"
      },
      "ti. Micchādiṭṭhito vivecetvā pasādetabboti adhippāyo. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ko nu kho…pe… viveceyyā’’"
      },
      "ti."
    ],
    "innerText": "Olokesi buddhāciṇṇavasena ‘‘atthi nu kho assa upanissayo’’ti. Lokiyaṃ ratanattaye pasādalakkhaṇaṃ sāsanāvatāraṃ sandhāyāha ‘‘appasanno’’ti. Micchādiṭṭhito vivecetvā pasādetabboti adhippāyo. Tenāha ‘‘ko nu kho…pe… viveceyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ divasa"
      },
      "nti yadā bhagavā bhikkhusaṅghaparivuto tāvatiṃsabhavanābhimukho gacchati, taṃ divasabhāgaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āpānabhūmiṃ sajjayiṃsū"
      },
      "ti yattha so nisinno bhojanakiccaṃ karoti, taṃ parivesanaṭṭhānaṃ sittaṃ sammaṭṭhaṃ bhojanūpakaraṇūpanayanādinā sajjayiṃsu paṭiyādesuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tividhanāṭakehī"
      },
      "ti vadhūkumārikaññāvatthāhi tividhāhi nāṭakitthīhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Olokayamāno"
      },
      "ti pekkhanto, vicārento vā."
    ],
    "innerText": "Taṃ divasanti yadā bhagavā bhikkhusaṅghaparivuto tāvatiṃsabhavanābhimukho gacchati, taṃ divasabhāgaṃ. Āpānabhūmiṃ sajjayiṃsūti yattha so nisinno bhojanakiccaṃ karoti, taṃ parivesanaṭṭhānaṃ sittaṃ sammaṭṭhaṃ bhojanūpakaraṇūpanayanādinā sajjayiṃsu paṭiyādesuṃ. Tividhanāṭakehīti vadhūkumārikaññāvatthāhi tividhāhi nāṭakitthīhi. Olokayamānoti pekkhanto, vicārento vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uparūparī"
      },
      "ti matthakamatthake. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavanenā"
      },
      "ti bhavanapadesena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhogehī"
      },
      "ti sarīrabhogehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avakujjenā"
      },
      "ti nikujjitena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gahetvā"
      },
      "ti yathā tāvatiṃsabhavanassa padesopi nāvasissati, evaṃ pariyādāya."
    ],
    "innerText": "Uparūparīti matthakamatthake. Bhavanenāti bhavanapadesena. Bhogehīti sarīrabhogehi. Avakujjenāti nikujjitena. Gahetvāti yathā tāvatiṃsabhavanassa padesopi nāvasissati, evaṃ pariyādāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sineruparibhaṇḍa"
      },
      "nti sinerumekhalaṃ. Sinerussa kira samantato bahalato, puthulato ca pañcayojanasahassaparimāṇāni cattāri paribhaṇḍāni tāvatiṃsabhavanassa ārakkhāya nāgehi, garuḷehi, kumbhaṇḍehi, yakkhehi ca adhiṭṭhitāni, tāni paribhaṇḍabhāvasāmaññena ekajjhaṃ katvā ‘‘paribhaṇḍa’’nti vuttaṃ. Tehi kira sinerussa upaḍḍhaṃ pariyādinnaṃ."
    ],
    "innerText": "Sineruparibhaṇḍanti sinerumekhalaṃ. Sinerussa kira samantato bahalato, puthulato ca pañcayojanasahassaparimāṇāni cattāri paribhaṇḍāni tāvatiṃsabhavanassa ārakkhāya nāgehi, garuḷehi, kumbhaṇḍehi, yakkhehi ca adhiṭṭhitāni, tāni paribhaṇḍabhāvasāmaññena ekajjhaṃ katvā ‘‘paribhaṇḍa’’nti vuttaṃ. Tehi kira sinerussa upaḍḍhaṃ pariyādinnaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attabhāvaṃ vijahitvā"
      },
      "ti manussarūpaṃ antaradhāpetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bādhatī"
      },
      "ti khedamattaṃ uppādeti."
    ],
    "innerText": "Attabhāvaṃ vijahitvāti manussarūpaṃ antaradhāpetvā. Bādhatīti khedamattaṃ uppādeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attabhāvaṃ vijahitvā"
      },
      "ti sukhumattabhāvanimmānena nāgarūpaṃ vijahitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mukhaṃ vivari"
      },
      " ‘‘mukhagataṃ ",
      " samaṇaṃ saṃkhādissāmī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pācīnena ca pacchimena cā"
      },
      "ti nāgassa tathānipannattā vuttaṃ. Suṭṭhu satiyā paccupaṭṭhāpanatthamāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘manasi karohī’’"
      },
      "ti."
    ],
    "innerText": "Attabhāvaṃ vijahitvāti sukhumattabhāvanimmānena nāgarūpaṃ vijahitvā. Mukhaṃ vivari ‘‘mukhagataṃ samaṇaṃ saṃkhādissāmī’’ti. Pācīnena ca pacchimena cāti nāgassa tathānipannattā vuttaṃ. Suṭṭhu satiyā paccupaṭṭhāpanatthamāha ‘‘manasi karohī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādito"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭṭhāya sabbapāṭihāriyānī"
      },
      "ti tadā therena katapāṭihāriyāni sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imaṃ pana ṭhāna"
      },
      "nti imaṃ nāsāvātavissajjanakāraṇaṃ."
    ],
    "innerText": "Āditopaṭṭhāya sabbapāṭihāriyānīti tadā therena katapāṭihāriyāni sandhāya vuttaṃ. Imaṃ pana ṭhānanti imaṃ nāsāvātavissajjanakāraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anubandhī"
      },
      "ti ‘‘na sakkā evaṃmahiddhikassa imassa samaṇassa paṭipaharitu’’nti bhayena palāyantaṃ anubandhi."
    ],
    "innerText": "Anubandhīti ‘‘na sakkā evaṃmahiddhikassa imassa samaṇassa paṭipaharitu’’nti bhayena palāyantaṃ anubandhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekapaṭipāṭiyā"
      },
      "ti ekāya paṭipāṭiyā, nirantaranti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayamevā"
      },
      "ti yā upādinnakaṃ nissāya anupādinnakassa vaḍḍhi, ayameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ettha"
      },
      " edise hatthavaḍḍhanādipāṭihāriye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yutti"
      },
      " yuttarūpā cittato, ututo vā upādinnakarūpānaṃ anuppajjanato. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upādinna"
      },
      "nti sakalameva indriyabaddhaṃ adhippetaṃ. Evampi tassa tathā vaḍḍhi na yujjati evāti vuttanayeneva vaḍḍhi veditabbā. Ekasantāne upādinnaṃ, anupādinnañca sambhinnaṃ viya pavattamānampi atthato asambhinnameva. Tattha yathā āḷhakamatte khīre anekāḷhake udake āsitte yadipi khīraṃ sabbena sambhinnaṃ sabbatthakameva lambamānaṃ hutvā tiṭṭhati, tathāpi na tattha khīraṃ vaḍḍhati, udakameva vaḍḍhati, evamevaṃ yadipi upādinnaṃ anupādinnañca sambhinnaṃ viya pavattati, tathāpi upādinnaṃ na vaḍḍhati, iddhānubhāvena cittajaṃ, tadanusārena utujañca vaḍḍhatīti daṭṭhabbaṃ."
    ],
    "innerText": "Ekapaṭipāṭiyāti ekāya paṭipāṭiyā, nirantaranti attho. Ayamevāti yā upādinnakaṃ nissāya anupādinnakassa vaḍḍhi, ayameva. Ettha edise hatthavaḍḍhanādipāṭihāriye yutti yuttarūpā cittato, ututo vā upādinnakarūpānaṃ anuppajjanato. Atha vā upādinnanti sakalameva indriyabaddhaṃ adhippetaṃ. Evampi tassa tathā vaḍḍhi na yujjati evāti vuttanayeneva vaḍḍhi veditabbā. Ekasantāne upādinnaṃ, anupādinnañca sambhinnaṃ viya pavattamānampi atthato asambhinnameva. Tattha yathā āḷhakamatte khīre anekāḷhake udake āsitte yadipi khīraṃ sabbena sambhinnaṃ sabbatthakameva lambamānaṃ hutvā tiṭṭhati, tathāpi na tattha khīraṃ vaḍḍhati, udakameva vaḍḍhati, evamevaṃ yadipi upādinnaṃ anupādinnañca sambhinnaṃ viya pavattati, tathāpi upādinnaṃ na vaḍḍhati, iddhānubhāvena cittajaṃ, tadanusārena utujañca vaḍḍhatīti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So"
      },
      "ti so iddhimā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ katvā"
      },
      "ti vuttākārena hatthaṃ vā vaḍḍhetvā te vā āgantvā hatthapāse ṭhite katvā. Pādaṭṭhapanādipi vuttanayeneva veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aparopi"
      },
      " iddhimā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathevā"
      },
      "ti pāṭihāriyakaraṇato pubbe viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathūpamameta"
      },
      "nti yathā udakapuṇṇāsu nānāpātīsu bahūhi nānācandamaṇḍalesu dissamānesu na tena candamaṇḍalassa gamanādiuparodho, bahūnañca paccekaṃ dassanaṃ ijjhati, tathūpamametaṃ pāṭihāriyaṃ candimasūriyānaṃ gamanādiuparodhābhāvato, bahūnañca iddhimantānaṃ tattha iddhipayogassa yathicchitaṃ samijjhanatoti adhippāyo."
    ],
    "innerText": "Soti so iddhimā. Evaṃ katvāti vuttākārena hatthaṃ vā vaḍḍhetvā te vā āgantvā hatthapāse ṭhite katvā. Pādaṭṭhapanādipi vuttanayeneva veditabbaṃ. Aparopi iddhimā. Tathevāti pāṭihāriyakaraṇato pubbe viya. Tathūpamametanti yathā udakapuṇṇāsu nānāpātīsu bahūhi nānācandamaṇḍalesu dissamānesu na tena candamaṇḍalassa gamanādiuparodho, bahūnañca paccekaṃ dassanaṃ ijjhati, tathūpamametaṃ pāṭihāriyaṃ candimasūriyānaṃ gamanādiuparodhābhāvato, bahūnañca iddhimantānaṃ tattha iddhipayogassa yathicchitaṃ samijjhanatoti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "397"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paricchedaṃ katvā"
      },
      "ti abhividhivasena pana paricchedaṃ katvā, na mariyādavasena. Tathā hesa brahmaloke attano kāyena vasaṃ vatteti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāḷī"
      },
      "ti paṭisambhidāmaggapāḷi."
    ],
    "innerText": "397.Paricchedaṃ katvāti abhividhivasena pana paricchedaṃ katvā, na mariyādavasena. Tathā hesa brahmaloke attano kāyena vasaṃ vatteti. Pāḷīti paṭisambhidāmaggapāḷi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmalokāpi kāyena vasaṃ vattetī"
      },
      "ti ettha yasmā na brahmalokasseva gamanaṃ adhippetaṃ, nāpi brahmalokassa gamanameva, atha kho ",
      " aññathā aññampi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāva brahmalokā"
      },
      "ti pana dūrāvadhinidassanametaṃ, tasmā ‘‘sace brahmalokaṃ gantukāmā hotī’’ti vatvāpi itarampi dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘santikepi dūre adhiṭṭhātī’’"
      },
      "tiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pi"
      },
      "-saddo samuccayattho, tena vuttāvasesassa adhiṭṭhāniddhiyā nipphādetabbassa sabbassāpi saṅgaho, na vuttassevāti daṭṭhabbaṃ."
    ],
    "innerText": "Yāvabrahmalokāpi kāyena vasaṃ vattetīti ettha yasmā na brahmalokasseva gamanaṃ adhippetaṃ, nāpi brahmalokassa gamanameva, atha kho aññathā aññampi. Yāva brahmalokāti pana dūrāvadhinidassanametaṃ, tasmā ‘‘sace brahmalokaṃ gantukāmā hotī’’ti vatvāpi itarampi dassetuṃ ‘‘santikepi dūre adhiṭṭhātī’’tiādi vuttaṃ. Tattha pi-saddo samuccayattho, tena vuttāvasesassa adhiṭṭhāniddhiyā nipphādetabbassa sabbassāpi saṅgaho, na vuttassevāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yamakapāṭihāriyāvasāne"
      },
      "tiādinā tivikkamassa adhiṭṭhāniddhinipphannatā vuttā, aññattha pana lakkhaṇānisaṃsatā. Tadubhayaṃ yathā aññamaññaṃ na virujjhati, tathā vicāretvā gahetabbaṃ."
    ],
    "innerText": "Yamakapāṭihāriyāvasānetiādinā tivikkamassa adhiṭṭhāniddhinipphannatā vuttā, aññattha pana lakkhaṇānisaṃsatā. Tadubhayaṃ yathā aññamaññaṃ na virujjhati, tathā vicāretvā gahetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nīlamātika"
      },
      "nti nīlavaṇṇodakamātikaṃ."
    ],
    "innerText": "Nīlamātikanti nīlavaṇṇodakamātikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahābodhi"
      },
      "nti aparājitapallaṅkaṃ mahābodhiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Citte uppanne santike akāsī"
      },
      "ti tathā cittuppattisamanantarameva pathaviṃ, samuddañca saṃkhipitvā mahābodhisantike akāsi."
    ],
    "innerText": "Mahābodhinti aparājitapallaṅkaṃ mahābodhiṃ. Citte uppanne santike akāsīti tathā cittuppattisamanantarameva pathaviṃ, samuddañca saṃkhipitvā mahābodhisantike akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nakkhattadivase"
      },
      "ti mahadivase. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Candapūve"
      },
      "ti candasadise candamaṇḍalākāre pūve. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekapattapūramattamakāsī"
      },
      "ti yathā te pamāṇato sarūpeneva antopattapariyāpannā honti, tathā akāsi."
    ],
    "innerText": "Nakkhattadivaseti mahadivase. Candapūveti candasadise candamaṇḍalākāre pūve. Ekapattapūramattamakāsīti yathā te pamāṇato sarūpeneva antopattapariyāpannā honti, tathā akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kākavaliyavatthusmi"
      },
      "ñca ‘‘bhagavā thokaṃ bahuṃ akāsī’’ti ānetvā sambandhitabbaṃ. Taṃ pana vatthuṃ saṅkhepatova dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘mahākassapatthero kirā’’"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samāpattiyā"
      },
      "ti nirodhasamāpattiyā."
    ],
    "innerText": "Kākavaliyavatthusmiñca ‘‘bhagavā thokaṃ bahuṃ akāsī’’ti ānetvā sambandhitabbaṃ. Taṃ pana vatthuṃ saṅkhepatova dassetuṃ ‘‘mahākassapatthero kirā’’tiādi vuttaṃ. Samāpattiyāti nirodhasamāpattiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gaṅgātīre"
      },
      "ti tambapaṇṇidīpe gaṅgānadiyā tīre. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saññaṃ adāsī"
      },
      "ti yathā te yathādhiṭṭhitaṃ sappiṃ passanti, tathā saññaṃ adāsi."
    ],
    "innerText": "Gaṅgātīreti tambapaṇṇidīpe gaṅgānadiyā tīre. Saññaṃ adāsīti yathā te yathādhiṭṭhitaṃ sappiṃ passanti, tathā saññaṃ adāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā"
      },
      "ti yassa brahmuno rūpaṃ daṭṭhukāmo, tassa brahmuno rūpaṃ passati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddaṃ suṇātī"
      },
      "ti dibbāya sotadhātuyā brahmuno saddaṃ suṇāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittaṃ pajānātī"
      },
      "ti cetopariyañāṇena brahmuno cittaṃ pajānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Karajakāyassa vasenā"
      },
      "ti cātumahābhūtikarūpakāyassa vasena. ‘‘Cittaṃ pariṇāmetī’’ti ettha kiṃ taṃ cittaṃ, kathaṃ vā pariṇāmananti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pādakajjhānacittaṃ gahetvā kāye āropetī’’"
      },
      "ti. Kathaṃ ",
      " pana kāye āropetīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kāyānugatikaṃ karotī’’"
      },
      "ti. Evampi saddadandharovāyanti vacanapathaṃ pacchindanto āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dandhagamana’’"
      },
      "nti. Karotīti ",
      " sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyagamanaṃ hi dandhaṃ,"
      },
      " dandhamahābhūtapaccayattāti adhippāyo. Ayañhettha attho – dissamānena kāyena gantukāmatāya vasena cittaṃ pariṇāmento yogī pādakajjhānaṃ samāpajjitvā vuṭṭhāya ‘‘idaṃ cittaṃ kāyo viya dandhagamanaṃ hotū’’ti parikammaṃ karoti. Tathā parikammakaraṇaṃ hi sandhāya ‘‘pādakajjhānacittaṃ gahetvā’’ti vuttaṃ. Parikammaṃ pana katvā puna samāpajjitvā ñāṇena adhiṭṭhahanto taṃ cittaṃ kāye āropeti, kāyānugatikaṃ dandhagamanaṃ karoti."
    ],
    "innerText": "Tassāti yassa brahmuno rūpaṃ daṭṭhukāmo, tassa brahmuno rūpaṃ passati. Saddaṃ suṇātīti dibbāya sotadhātuyā brahmuno saddaṃ suṇāti. Cittaṃ pajānātīti cetopariyañāṇena brahmuno cittaṃ pajānāti. Karajakāyassa vasenāti cātumahābhūtikarūpakāyassa vasena. ‘‘Cittaṃ pariṇāmetī’’ti ettha kiṃ taṃ cittaṃ, kathaṃ vā pariṇāmananti āha ‘‘pādakajjhānacittaṃ gahetvā kāye āropetī’’ti. Kathaṃ pana kāye āropetīti āha ‘‘kāyānugatikaṃ karotī’’ti. Evampi saddadandharovāyanti vacanapathaṃ pacchindanto āha ‘‘dandhagamana’’nti. Karotīti sambandho. Kāyagamanaṃ hi dandhaṃ, dandhamahābhūtapaccayattāti adhippāyo. Ayañhettha attho – dissamānena kāyena gantukāmatāya vasena cittaṃ pariṇāmento yogī pādakajjhānaṃ samāpajjitvā vuṭṭhāya ‘‘idaṃ cittaṃ kāyo viya dandhagamanaṃ hotū’’ti parikammaṃ karoti. Tathā parikammakaraṇaṃ hi sandhāya ‘‘pādakajjhānacittaṃ gahetvā’’ti vuttaṃ. Parikammaṃ pana katvā puna samāpajjitvā ñāṇena adhiṭṭhahanto taṃ cittaṃ kāye āropeti, kāyānugatikaṃ dandhagamanaṃ karoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhasañña"
      },
      "nti sukhasahagataṃ saññaṃ, saññāsīsena niddeso. Lahubhāvena saññātanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lahusaññaṃ"
      },
      ". Kathaṃ pana iddhicittena saha sukhasaññāya sambhavoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sukhasaññā nāma upekkhāsampayuttā saññā’’"
      },
      "ti. Sukhanti saññātanti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhasaññaṃ"
      },
      ". Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘upekkhā hi santaṃ sukhanti vuttā’’"
      },
      "ti ekantagarukehi nīvaraṇehi, oḷārikehi anupasantasabhāvehi ca vitakkādīhi vippayogo cittacetasikānaṃ lahubhāvassa kāraṇanti dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sāyeva…pe… veditabbā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ okkantassā"
      },
      "ti taṃ sukhalahusaññaṃ anuppattassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assā"
      },
      "ti yogino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gantukāmatā eva ettha pamāṇa"
      },
      "nti ettha etasmiṃ dissamānena kāyena gamane yaṃ ṭhānaṃ gantukāmo, taṃ uddissa gantukāmatāvasena pavattaparikammādhiṭṭhānāni eva pamāṇaṃ, tāvatā gamanaṃ ijjhati. Tasmā magganimmānavāyuadhiṭṭhānehi vināpi icchitadesappatti hotīti. Idāni tamevatthaṃ pākaṭataraṃ kātuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sati hī’’"
      },
      "tiādi vuttaṃ."
    ],
    "innerText": "Sukhasaññanti sukhasahagataṃ saññaṃ, saññāsīsena niddeso. Lahubhāvena saññātanti lahusaññaṃ. Kathaṃ pana iddhicittena saha sukhasaññāya sambhavoti āha ‘‘sukhasaññā nāma upekkhāsampayuttā saññā’’ti. Sukhanti saññātanti vā sukhasaññaṃ. Tenevāha ‘‘upekkhā hi santaṃ sukhanti vuttā’’ti ekantagarukehi nīvaraṇehi, oḷārikehi anupasantasabhāvehi ca vitakkādīhi vippayogo cittacetasikānaṃ lahubhāvassa kāraṇanti dassento āha ‘‘sāyeva…pe… veditabbā’’ti. Taṃ okkantassāti taṃ sukhalahusaññaṃ anuppattassa. Assāti yogino. Gantukāmatā eva ettha pamāṇanti ettha etasmiṃ dissamānena kāyena gamane yaṃ ṭhānaṃ gantukāmo, taṃ uddissa gantukāmatāvasena pavattaparikammādhiṭṭhānāni eva pamāṇaṃ, tāvatā gamanaṃ ijjhati. Tasmā magganimmānavāyuadhiṭṭhānehi vināpi icchitadesappatti hotīti. Idāni tamevatthaṃ pākaṭataraṃ kātuṃ ‘‘sati hī’’tiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyaṃ gahetvā"
      },
      "ti karajakāyaṃ ārammaṇakaraṇavasena parikammacittena gahetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Citte āropetī"
      },
      "ti ‘‘ayaṃ kāyo idaṃ cittaṃ viya hotū’’ti pādakajjhānacitte āropeti taggatikaṃ karoti. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cittānugatikaṃ karoti sīghagamana’’"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittagamana"
      },
      "nti cittappavattimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idaṃ pana"
      },
      " cittavasena kāyapariṇāmanapāṭihāriyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittagamanamevā"
      },
      "ti cittena samānagamanameva. Kathaṃ pana kāyo dandhappavattiko lahuparivattinā cittena samānagatiko hotīti? Na sabbathā samānagatiko. Yatheva hi kāyavasena cittapariṇāmane cittaṃ sabbathā kāyena samānagatikaṃ na hoti. Na hi tadā cittaṃ sabhāvasiddhena attano khaṇena avattitvā garuvuttikassa rūpadhammassa khaṇena vattati. ‘‘Idaṃ cittaṃ ayaṃ kāyo viya hotū’’ti pana adhiṭṭhānena ",
      " dandhagatikassa kāyassa anuvattanato yāva icchitaṭṭhānappatti, tāva kāyagatianulomeneva hutvā santānavasena ",
      " pavattamānaṃ cittaṃ kāyagatiyā pariṇāmitaṃ nāma hoti, evaṃ ‘‘ayaṃ kāyo idaṃ cittaṃ viya hotū’’ti adhiṭṭhānena pageva sukhalahusaññāya sampāditattā abhāvitiddhipādānaṃ viya dandhaṃ avattitvā yathā lahukatipayacittavāreheva icchitaṭṭhānappatti hoti, evaṃ pavattamāno kāyo cittagatiyā pariṇāmito nāma hoti, na ekacittakkhaṇeneva icchitaṭṭhānappattiyā."
    ],
    "innerText": "Kāyaṃ gahetvāti karajakāyaṃ ārammaṇakaraṇavasena parikammacittena gahetvā. Citte āropetīti ‘‘ayaṃ kāyo idaṃ cittaṃ viya hotū’’ti pādakajjhānacitte āropeti taggatikaṃ karoti. Tenāha ‘‘cittānugatikaṃ karoti sīghagamana’’nti. Cittagamananti cittappavattimāha. Idaṃ pana cittavasena kāyapariṇāmanapāṭihāriyaṃ. Cittagamanamevāti cittena samānagamanameva. Kathaṃ pana kāyo dandhappavattiko lahuparivattinā cittena samānagatiko hotīti? Na sabbathā samānagatiko. Yatheva hi kāyavasena cittapariṇāmane cittaṃ sabbathā kāyena samānagatikaṃ na hoti. Na hi tadā cittaṃ sabhāvasiddhena attano khaṇena avattitvā garuvuttikassa rūpadhammassa khaṇena vattati. ‘‘Idaṃ cittaṃ ayaṃ kāyo viya hotū’’ti pana adhiṭṭhānena dandhagatikassa kāyassa anuvattanato yāva icchitaṭṭhānappatti, tāva kāyagatianulomeneva hutvā santānavasena pavattamānaṃ cittaṃ kāyagatiyā pariṇāmitaṃ nāma hoti, evaṃ ‘‘ayaṃ kāyo idaṃ cittaṃ viya hotū’’ti adhiṭṭhānena pageva sukhalahusaññāya sampāditattā abhāvitiddhipādānaṃ viya dandhaṃ avattitvā yathā lahukatipayacittavāreheva icchitaṭṭhānappatti hoti, evaṃ pavattamāno kāyo cittagatiyā pariṇāmito nāma hoti, na ekacittakkhaṇeneva icchitaṭṭhānappattiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evañca katvā ‘‘seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyyā’’ti idampi upamāvacanaṃ nippariyāyeneva samatthitaṃ hoti. Avassaṃ cetaṃ evaṃ sampaṭicchitabbaṃ, aññathā suttābhidhammapāṭhehi, vinayaaṭṭhakathāya ca virodho siyā, dhammatā ca vilomitā. ‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampī’’ti (a. ni. 1.11 ādayo) hi ettha aññagahaṇena rūpadhammā gahitā alahuparivattitāya. Abhidhamme (paṭṭhā. 1.1.10-11) ca purejātapaccayo rūpameva vutto, pacchājātapaccayo ca tasseva. Yattha yattha ca dhammā uppajjanti, tattha tattheva bhijjanti. Natthi desantarasaṅkamanaṃ, na ca sabhāvo aññathā hotīti. Na hi iddhibalena dhammānaṃ kenaci lakkhaṇaṃ aññathattaṃ kātuṃ sakkā, bhāvaññathattameva pana kātuṃ sakkā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Tīsupi khaṇesū’’"
      },
      "ti idampi gamanārambhaṃ sandhāya vuttaṃ, na gamananiṭṭhānanti vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thero"
      },
      "ti aṭṭhakathācariyānaṃ antare eko thero. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti idaṃ pāṭihāriyaṃ vibhajitvā vuttapāṭhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sayaṃ gamanameva āgataṃ"
      },
      " ‘‘brahmalokaṃ gacchatī’’ti vuttattā."
    ],
    "innerText": "Evañca katvā ‘‘seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyyā’’ti idampi upamāvacanaṃ nippariyāyeneva samatthitaṃ hoti. Avassaṃ cetaṃ evaṃ sampaṭicchitabbaṃ, aññathā suttābhidhammapāṭhehi, vinayaaṭṭhakathāya ca virodho siyā, dhammatā ca vilomitā. ‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampī’’ti (a. ni. 1.11 ādayo) hi ettha aññagahaṇena rūpadhammā gahitā alahuparivattitāya. Abhidhamme (paṭṭhā. 1.1.10-11) ca purejātapaccayo rūpameva vutto, pacchājātapaccayo ca tasseva. Yattha yattha ca dhammā uppajjanti, tattha tattheva bhijjanti. Natthi desantarasaṅkamanaṃ, na ca sabhāvo aññathā hotīti. Na hi iddhibalena dhammānaṃ kenaci lakkhaṇaṃ aññathattaṃ kātuṃ sakkā, bhāvaññathattameva pana kātuṃ sakkā. ‘‘Tīsupi khaṇesū’’ti idampi gamanārambhaṃ sandhāya vuttaṃ, na gamananiṭṭhānanti vadanti. Theroti aṭṭhakathācariyānaṃ antare eko thero. Idhāti idaṃ pāṭihāriyaṃ vibhajitvā vuttapāṭhe. Sayaṃ gamanameva āgataṃ ‘‘brahmalokaṃ gacchatī’’ti vuttattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhusotādīna"
      },
      "nti cakkhusotādīnaṃ aṅgānaṃ. Tathā hi vuttaṃ ‘‘sabbaṅgapaccaṅga’’nti, sabbaaṅgapaccaṅgavantanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pasādo nāma natthī"
      },
      "ti imināva bhāvajīvitindriyānampi abhāvo vuttoti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rucivasenā"
      },
      "ti icchāvasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññampī"
      },
      "ti bhagavatā kariyamānato aññampi kiriyaṃ karoti. Ayañcettha buddhānubhāvo. Yadi sāvakanimmitesu nānappakāratā natthi, ‘‘sace pana nānāvaṇṇe kātukāmo hotī’’tiādi yaṃ heṭṭhā vuttaṃ, taṃ kathanti? Taṃ tathā tathā parikammaṃ katvā adhiṭṭhahantassa te te vaṇṇavayādivisesā parikammānurūpaṃ ijjhantīti katvā vuttaṃ. Idha pana yathādhiṭṭhite nimmitarūpe sace sāvako ‘‘ime visesā hontū’’ti ",
      " icchati, na ijjhati, buddhānaṃ pana ijjhatīti ayamattho dassitoti na koci virodho."
    ],
    "innerText": "Cakkhusotādīnanti cakkhusotādīnaṃ aṅgānaṃ. Tathā hi vuttaṃ ‘‘sabbaṅgapaccaṅga’’nti, sabbaaṅgapaccaṅgavantanti attho. Pasādo nāma natthīti imināva bhāvajīvitindriyānampi abhāvo vuttoti daṭṭhabbaṃ. Rucivasenāti icchāvasena. Aññampīti bhagavatā kariyamānato aññampi kiriyaṃ karoti. Ayañcettha buddhānubhāvo. Yadi sāvakanimmitesu nānappakāratā natthi, ‘‘sace pana nānāvaṇṇe kātukāmo hotī’’tiādi yaṃ heṭṭhā vuttaṃ, taṃ kathanti? Taṃ tathā tathā parikammaṃ katvā adhiṭṭhahantassa te te vaṇṇavayādivisesā parikammānurūpaṃ ijjhantīti katvā vuttaṃ. Idha pana yathādhiṭṭhite nimmitarūpe sace sāvako ‘‘ime visesā hontū’’ti icchati, na ijjhati, buddhānaṃ pana ijjhatīti ayamattho dassitoti na koci virodho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni yāni tāni ‘‘yāva brahmalokāpi kāyena vasaṃ vattetī’’ti (paṭi. ma. 3.10) pāḷiyā atthadassanavasena vibhattāni ‘‘dūrepi santike adhiṭṭhātī’’tiādīni cuddasa pāṭihāriyāni ",
      ", tattha sikhāppattaṃ kāyena vasavattanapāṭihāriyaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ettha cā’’"
      },
      "tiādi āraddhaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ya"
      },
      "nti kiriyāparāmasanaṃ, tena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘rūpaṃ passatī’’"
      },
      "ti ettha yadetaṃ rūpadassanaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘saddaṃ suṇātī’’"
      },
      "ti ettha yadetaṃ saddasavanaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cittaṃ pajānātī’’"
      },
      "ti ettha yadetaṃ cittajānananti evaṃ dibbacakkhusotacetopariyañāṇakattukaṃ dassanasavanajānanakiriyaṃ parāmasatīti daṭṭhabbaṃ. Ito paresu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "santiṭṭhatī"
      },
      "tiādīsupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yampissā"
      },
      "ti yampi assa. Yogino adhiṭṭhānanti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yañca kho"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kho"
      },
      "-saddo avadhāraṇattho, visesattho vā, tena ayamevettha kāyena vasavattanapāṭihāriyesu ukkaṭṭhataranti dīpeti. Kasmā? ‘‘Ayaṃ nu kho iddhimā, ayaṃ nu kho nimmito’’ti ekaccassa brahmuno āsaṅkuppādanato. Yadaggena cetaṃ adhiṭṭhitaṃ visesato manomayanti vuccati, tadaggena ukkaṭṭhataranti veditabbaṃ. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ettāvatā kāyena vasaṃ vatteti nāmā’’"
      },
      "ti. Yadi evaṃ kasmā idha sesāni gahitānīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sesaṃ…pe… vutta’’"
      },
      "nti."
    ],
    "innerText": "Idāni yāni tāni ‘‘yāva brahmalokāpi kāyena vasaṃ vattetī’’ti (paṭi. ma. 3.10) pāḷiyā atthadassanavasena vibhattāni ‘‘dūrepi santike adhiṭṭhātī’’tiādīni cuddasa pāṭihāriyāni , tattha sikhāppattaṃ kāyena vasavattanapāṭihāriyaṃ dassetuṃ ‘‘ettha cā’’tiādi āraddhaṃ. Tattha yanti kiriyāparāmasanaṃ, tena ‘‘rūpaṃ passatī’’ti ettha yadetaṃ rūpadassanaṃ, ‘‘saddaṃ suṇātī’’ti ettha yadetaṃ saddasavanaṃ, ‘‘cittaṃ pajānātī’’ti ettha yadetaṃ cittajānananti evaṃ dibbacakkhusotacetopariyañāṇakattukaṃ dassanasavanajānanakiriyaṃ parāmasatīti daṭṭhabbaṃ. Ito paresu santiṭṭhatītiādīsupi eseva nayo. Yampissāti yampi assa. Yogino adhiṭṭhānanti sambandho. Yañca khoti ettha kho-saddo avadhāraṇattho, visesattho vā, tena ayamevettha kāyena vasavattanapāṭihāriyesu ukkaṭṭhataranti dīpeti. Kasmā? ‘‘Ayaṃ nu kho iddhimā, ayaṃ nu kho nimmito’’ti ekaccassa brahmuno āsaṅkuppādanato. Yadaggena cetaṃ adhiṭṭhitaṃ visesato manomayanti vuccati, tadaggena ukkaṭṭhataranti veditabbaṃ. Tenāha ‘‘ettāvatā kāyena vasaṃ vatteti nāmā’’ti. Yadi evaṃ kasmā idha sesāni gahitānīti āha ‘‘sesaṃ…pe… vutta’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "398"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idaṃ nānākaraṇa"
      },
      "nti kāmamimāpi dve iddhiyo adhiṭṭhānavaseneva ijjhanti, tathāpi idaṃ idāni vuccamānaṃ imāsaṃ nānākaraṇaṃ viseso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakativaṇṇaṃ vijahitvā"
      },
      "ti attano pakatirūpaṃ vijahitvā apanetvā, paresaṃ adassetvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kumārakavaṇṇa"
      },
      "nti kumārakasaṇṭhānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dassetī"
      },
      "ti tathā vikubbanto attani dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāgavaṇṇaṃ vā"
      },
      "tiādīsupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hatthimpi dassetī"
      },
      "ti attānampi hatthiṃ katvā dasseti, bahiddhāpi hatthiṃ dasseti. Etadatthameva hi idha ‘‘hatthivaṇṇaṃ vā dassetī’’ti avatvā ‘‘hatthimpi dassetī’’ti (paṭi. ma. 3.13) vuttaṃ. Yaṃ pana keci bahiddhā hatthiādidassanavacanaṃ ‘‘pakativaṇṇaṃ vijahitvā’’ti vacanena vikubbaniddhibhāvena virujjhatīti vadanti, tadayuttaṃ. Kasmā? Pakativaṇṇavijahanaṃ nāma attano pakatirūpassa aññesaṃ adassanaṃ, na sabbena sabbaṃ tassa nirodhanaṃ. Evaṃ sati attānaṃ adassetvā bahiddhā hatthiṃ dassento ‘‘pakativaṇṇaṃ vijahitvā hatthiṃ dassetī’’ti ",
      " vuccamāne ko ettha virodho, attanā pana hatthivaṇṇo hutvā bahiddhāpi hatthiṃ dassante vattabbameva natthi. Tenevāha ‘‘bahiddhāpi hatthiādidassanavasena vutta’’nti. Evañca katvā vikubbaniddhibhāvena ca na koci virodho."
    ],
    "innerText": "398.Idaṃ nānākaraṇanti kāmamimāpi dve iddhiyo adhiṭṭhānavaseneva ijjhanti, tathāpi idaṃ idāni vuccamānaṃ imāsaṃ nānākaraṇaṃ viseso. Pakativaṇṇaṃ vijahitvāti attano pakatirūpaṃ vijahitvā apanetvā, paresaṃ adassetvāti attho. Kumārakavaṇṇanti kumārakasaṇṭhānaṃ. Dassetīti tathā vikubbanto attani dasseti. Nāgavaṇṇaṃ vātiādīsupi eseva nayo. Hatthimpi dassetīti attānampi hatthiṃ katvā dasseti, bahiddhāpi hatthiṃ dasseti. Etadatthameva hi idha ‘‘hatthivaṇṇaṃ vā dassetī’’ti avatvā ‘‘hatthimpi dassetī’’ti (paṭi. ma. 3.13) vuttaṃ. Yaṃ pana keci bahiddhā hatthiādidassanavacanaṃ ‘‘pakativaṇṇaṃ vijahitvā’’ti vacanena vikubbaniddhibhāvena virujjhatīti vadanti, tadayuttaṃ. Kasmā? Pakativaṇṇavijahanaṃ nāma attano pakatirūpassa aññesaṃ adassanaṃ, na sabbena sabbaṃ tassa nirodhanaṃ. Evaṃ sati attānaṃ adassetvā bahiddhā hatthiṃ dassento ‘‘pakativaṇṇaṃ vijahitvā hatthiṃ dassetī’’ti vuccamāne ko ettha virodho, attanā pana hatthivaṇṇo hutvā bahiddhāpi hatthiṃ dassante vattabbameva natthi. Tenevāha ‘‘bahiddhāpi hatthiādidassanavasena vutta’’nti. Evañca katvā vikubbaniddhibhāvena ca na koci virodho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pāḷiyañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kumārakavaṇṇaṃ vā"
      },
      "tiādīsu aniyamattho vā-saddo vutto. Tesu ekekasseva karaṇadassanatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hatthimpī"
      },
      "tiādīsu pana hatthiādīnaṃ bahūnaṃ ekajjhaṃ kātabbābhāvadassanatthaṃ samuccayattho pi-saddo vutto. Tena ‘‘hatthimpi dassetī’’tiādīsu dutiye vuttanayeneva attho gahetabbo."
    ],
    "innerText": "Pāḷiyañca kumārakavaṇṇaṃ vātiādīsu aniyamattho vā-saddo vutto. Tesu ekekasseva karaṇadassanatthaṃ. Hatthimpītiādīsu pana hatthiādīnaṃ bahūnaṃ ekajjhaṃ kātabbābhāvadassanatthaṃ samuccayattho pi-saddo vutto. Tena ‘‘hatthimpi dassetī’’tiādīsu dutiye vuttanayeneva attho gahetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iddhimato ",
      " attano kumārakākārena paresaṃ dassanaṃ kumārakavaṇṇanimmānaṃ, na ettha kiñci apubbaṃ pathavīādivatthu nipphādīyatīti kasiṇaniyamena payojanābhāvato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pathavīkasiṇādīsu aññatarārammaṇato’’"
      },
      "ti vuttaṃ. Satipi vā vatthunipphādane yathārahaṃ taṃ pathavīkasiṇādivaseneva ijjhatīti evampettha kasiṇaniyamena payojanaṃ nattheva. Kumārakavaṇṇañhi dassentena nīlavaṇṇaṃ vā dassetabbaṃ siyā, pītādīsu aññataravaṇṇaṃ vā. Tathā sati nīlādikasiṇāni samāpajjitabbānīti āpannova kasiṇaniyamo. Eseva nayo sesesupi. Evamadhiṭṭhite yadeke pathavīkasiṇavasena ‘‘ekopi hutvā bahudhā hotī’’tiādi (dī. ni. 1.238; ma. ni. 1.147; saṃ. ni. 5.842; paṭi. ma. 3.10) bhāvoti evaṃ pavattena kasiṇaniddesena idha vikubbaniddhiniddese ‘‘pathavīkasiṇādīsu aññatarārammaṇato’’tiādivacanassa virodhaṃ āsaṅkanti, so anokāsovāti daṭṭhabbaṃ. Nimminitabbabhāvena attanā icchitoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attano kumārakavaṇṇo,"
      },
      " na pana attano daharakāle kumārakavaṇṇoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāgā"
      },
      "divaṇṇesupi ayaṃ nayo byāpī evāti yadeke ‘‘nāgādinimmāne na yujjati viyā’’ti vadanti, tadapohataṃ daṭṭhabbaṃ."
    ],
    "innerText": "Iddhimato attano kumārakākārena paresaṃ dassanaṃ kumārakavaṇṇanimmānaṃ, na ettha kiñci apubbaṃ pathavīādivatthu nipphādīyatīti kasiṇaniyamena payojanābhāvato ‘‘pathavīkasiṇādīsu aññatarārammaṇato’’ti vuttaṃ. Satipi vā vatthunipphādane yathārahaṃ taṃ pathavīkasiṇādivaseneva ijjhatīti evampettha kasiṇaniyamena payojanaṃ nattheva. Kumārakavaṇṇañhi dassentena nīlavaṇṇaṃ vā dassetabbaṃ siyā, pītādīsu aññataravaṇṇaṃ vā. Tathā sati nīlādikasiṇāni samāpajjitabbānīti āpannova kasiṇaniyamo. Eseva nayo sesesupi. Evamadhiṭṭhite yadeke pathavīkasiṇavasena ‘‘ekopi hutvā bahudhā hotī’’tiādi (dī. ni. 1.238; ma. ni. 1.147; saṃ. ni. 5.842; paṭi. ma. 3.10) bhāvoti evaṃ pavattena kasiṇaniddesena idha vikubbaniddhiniddese ‘‘pathavīkasiṇādīsu aññatarārammaṇato’’tiādivacanassa virodhaṃ āsaṅkanti, so anokāsovāti daṭṭhabbaṃ. Nimminitabbabhāvena attanā icchitoti attano kumārakavaṇṇo, na pana attano daharakāle kumārakavaṇṇoti. Nāgādivaṇṇesupi ayaṃ nayo byāpī evāti yadeke ‘‘nāgādinimmāne na yujjati viyā’’ti vadanti, tadapohataṃ daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahiddhāpī"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pi"
      },
      "-saddena ajjhattaṃ sampiṇḍeti. Ayañhettha attho – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hatthimpi dassetī"
      },
      "tiādi ajjhattaṃ, bahiddhāpi hatthiādidassanavasena vuttaṃ, na ‘‘kumārakavaṇṇaṃ vā’’tiādi viya ajjhattameva kumārakavaṇṇādīnaṃ dassanavasenāti. Yaṃ ettha vattabbaṃ adhiṭṭhānavidhānaṃ, taṃ heṭṭhā vuttameva."
    ],
    "innerText": "Bahiddhāpīti pi-saddena ajjhattaṃ sampiṇḍeti. Ayañhettha attho – hatthimpi dassetītiādi ajjhattaṃ, bahiddhāpi hatthiādidassanavasena vuttaṃ, na ‘‘kumārakavaṇṇaṃ vā’’tiādi viya ajjhattameva kumārakavaṇṇādīnaṃ dassanavasenāti. Yaṃ ettha vattabbaṃ adhiṭṭhānavidhānaṃ, taṃ heṭṭhā vuttameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "399"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāya"
      },
      "nti ",
      " attano karajakāyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuttanayenevā"
      },
      "ti ‘‘ayaṃ kāyo susiro hotū’’ti parikammaṃ katvā puna ‘‘pādakajjhānaṃ samāpajjitvā vuṭṭhāyā’’ti imaṃ heṭṭhā vuttanayānusāramāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññaṃ kāya"
      },
      "nti yaṃ manomayaṃ kāyaṃ nimminitukāmo, taṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muñjamhā"
      },
      "ti muñjatiṇato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Īsika"
      },
      "nti tassa kaṇḍaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kosiyā"
      },
      "ti asikosato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Karaṇḍāyā"
      },
      "ti peḷāya, nimmokatoti ca vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abbāhatī"
      },
      "ti uddharati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavāheyyā"
      },
      "ti ākaḍḍheyya."
    ],
    "innerText": "399.Kāyanti attano karajakāyaṃ. Vuttanayenevāti ‘‘ayaṃ kāyo susiro hotū’’ti parikammaṃ katvā puna ‘‘pādakajjhānaṃ samāpajjitvā vuṭṭhāyā’’ti imaṃ heṭṭhā vuttanayānusāramāha. Aññaṃ kāyanti yaṃ manomayaṃ kāyaṃ nimminitukāmo, taṃ. Muñjamhāti muñjatiṇato. Īsikanti tassa kaṇḍaṃ. Kosiyāti asikosato. Karaṇḍāyāti peḷāya, nimmokatoti ca vadanti. Abbāhatīti uddharati. Pavāheyyāti ākaḍḍheyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iddhividhaniddesavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti dvādasamaparicchedavaṇṇanā."
  }
]