[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Paccaya saṅgaha paramatthadīpanī"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "166"
      },
      ". Evaṃ ",
      " sattahi paricchedehi pathamassa nāmarūpapariccheda ñāṇassa vidhānaṃ dassetvā idāni dutīyassa paccayapariggahañāṇassa vidhānaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yesaṃsaṅkhatadhammāna"
      },
      "ntiādi māha. Idāni yesaṃ saṅkhatadhammānaṃ saṅkhatāsaṅkhatabhūtā yedhammā yathā yehi hetādīhi paccayākārehi paccayā upakārakā honti. Taṃ vibhāgaṃ tesaṃ saṅkhatadhammānaṃ paccayuppannabhūtānaṃ vibhāgañca tesaṃ paccayadhammānaṃ vibhāgañca tesaṃpaccayākārānaṃ iha vibhāgañca imasmiṃ vuccamāne paccayasaṅgahe yathārahaṃ pavakkhāmīti yojanā."
    ],
    "innerText": "166. Evaṃ sattahi paricchedehi pathamassa nāmarūpapariccheda ñāṇassa vidhānaṃ dassetvā idāni dutīyassa paccayapariggahañāṇassa vidhānaṃ dassento yesaṃsaṅkhatadhammānantiādi māha. Idāni yesaṃ saṅkhatadhammānaṃ saṅkhatāsaṅkhatabhūtā yedhammā yathā yehi hetādīhi paccayākārehi paccayā upakārakā honti. Taṃ vibhāgaṃ tesaṃ saṅkhatadhammānaṃ paccayuppannabhūtānaṃ vibhāgañca tesaṃ paccayadhammānaṃ vibhāgañca tesaṃpaccayākārānaṃ iha vibhāgañca imasmiṃ vuccamāne paccayasaṅgahe yathārahaṃ pavakkhāmīti yojanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[224] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[224] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Paccaye dassetu’’nti vuttaṃ. Taṃ taṃ vibhāganti iminā na sameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[225]"
      },
      " Yañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha"
      }
    ],
    "innerText": "[225] Yañca tattha"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Iha imasmiṃ samuccaya saṅgahānantare ṭhāne’’ti iha saddassa atthavibhāvanaṃ vuttaṃ. Taṃpi na yujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Etasmiñhi atthe sati idāni saddo niratthako hotīti, paṭicca phalaṃ samuppajjati etasmāti paṭiccasamuppādo. Tattha paṭiccāti avinā, amuñcitvāti attho. Avijjādiko paccayadhammoti vaṇṇenti. Athavā, samuppajjanaṃ samuppādo. Sahajātadhammehi saheva kalāpavasena abhinibbatti pātubhāvoti attho. Yathāsakaṃ paccayaṃ paṭicca tena avinābhāvīhutvā samuppādo paṭicca samuppādo, atthato pana sabbesaṃ paccayapaccayuppannabhūtānaṃ saṅkhata dhammānaṃ paccayāyattavuttitāsaṅkhātaṃ sabbasaṅkhatasādhāraṇaṃ ekaṃ sāmaññalakkhaṇaṃ. Yaṃ idappaccayatātica vuccati. Tatthaca idappaccaya tāti ayaṃ imassa paccayo ayaṃ imassa paccayoti evaṃ niddisitabbo ayaṃ paccayo etesanti idappaccayā. Saṅkhatadhammā. Idappaccayānaṃ bhāvo idappaccayatā. Yathāvutta sāmaññalakkhaṇaṃ evāti ",
      " attho veditabbo, na paṭicca phalaṃ samuppajjati etasmāti paṭiccasamuppādo. Avijjādiko paccayadhammotica imesaṃ paccayā idappaccayā. Idappaccayāeva idappaccayatātica. Visuddhimagge pana samuppajjanaṃ samuppādoti ayamattho paṭikkhitto. Pāḷiyaṃ pana ayameva adhippeto viya dissati. Yathāha –"
    ],
    "innerText": "Etasmiñhi atthe sati idāni saddo niratthako hotīti, paṭicca phalaṃ samuppajjati etasmāti paṭiccasamuppādo. Tattha paṭiccāti avinā, amuñcitvāti attho. Avijjādiko paccayadhammoti vaṇṇenti. Athavā, samuppajjanaṃ samuppādo. Sahajātadhammehi saheva kalāpavasena abhinibbatti pātubhāvoti attho. Yathāsakaṃ paccayaṃ paṭicca tena avinābhāvīhutvā samuppādo paṭicca samuppādo, atthato pana sabbesaṃ paccayapaccayuppannabhūtānaṃ saṅkhata dhammānaṃ paccayāyattavuttitāsaṅkhātaṃ sabbasaṅkhatasādhāraṇaṃ ekaṃ sāmaññalakkhaṇaṃ. Yaṃ idappaccayatātica vuccati. Tatthaca idappaccaya tāti ayaṃ imassa paccayo ayaṃ imassa paccayoti evaṃ niddisitabbo ayaṃ paccayo etesanti idappaccayā. Saṅkhatadhammā. Idappaccayānaṃ bhāvo idappaccayatā. Yathāvutta sāmaññalakkhaṇaṃ evāti attho veditabbo, na paṭicca phalaṃ samuppajjati etasmāti paṭiccasamuppādo. Avijjādiko paccayadhammotica imesaṃ paccayā idappaccayā. Idappaccayāeva idappaccayatātica. Visuddhimagge pana samuppajjanaṃ samuppādoti ayamattho paṭikkhitto. Pāḷiyaṃ pana ayameva adhippeto viya dissati. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Katamoca bhikkhave paṭiccasamuppādo. Jātipaccayā bhikkhave jarāmaraṇaṃ, uppādāvā tathāgatānaṃ anuppādāvā tathāgatānaṃ ṭhitāva sā dhātu, dhammaṭṭhitatā dhammaniyāmatā idappaccayatāti.La. Avijjāpaccayā saṅkhārā uppādāvā.La. Idappaccayatā. Iti kho bhikkhave tatra tathatā avitathatā anaññathatā idappaccayatā. Ayaṃ vuccati bhikkhave paṭiccasamuppādoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha hi ṭhitāva sā dhātūtiādinā tatra tathatā avitathatātiādināca yathāvuttaṃ idappaccayatā saṅkhātaṃ sāmañña lakkhaṇameva paṭiccasamuppādonāmāti dasseti. Na cettha bhāvasādhane kate sati paṭiccasaddena saha samuppādasaddassa asamānakattutāsaṅkhāto byañjanayuttivirodho atthi. Yo paṭicca kriyāya kattā, tasseva samuppādakriyāyapi kattutā sambhavato. Na hi kriyānāma katturahitāsambhavatīti. Saṅkhatadhammesuca gambhīresu sati aniccatādilakkhaṇaṃ viya idaṃpi saṅkhatalakkhaṇaṃ gambhīrameva hotīti nayidha gambhīravacanavirodho sambhavati. Athakho saṅkhatadhammato saṅkhatalakkhaṇameva gambhīrataraṃ hotīti. Tādisena pana sāmaññalakkhaṇena sampannā yathāvuttā avijjādayo saṅkhatadhammā paṭiccasamuppannānāma. Yathāha-katameca bhikkhave paṭiccasamuppannādhammā jarāmaraṇaṃ bhikkhave paṭiccasamuppannaṃ.La. Avijjā bhikkhave paṭiccasamuppannāti. Iti sabbesaṃ paccayapaccayuppanna bhūtānaṃ saṅkhatadhammānaṃ paccayā satta vuttitāsaṅkhāto paṭiccasamuppādoca so nīyati ñāyati paṭivijjhīyatīti katvā nayocāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭiccasamuppādanayo"
      },
      ". Paṭhapeti saṅkhatadhamme nānāpakārehi paccayabhedehi ",
      " pavatteti deseti etthāti paṭṭhānaṃ. Mahāpakaraṇaṃ. Paṭṭhāne desito nayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭṭhānanayo"
      },
      "."
    ],
    "innerText": "Ettha hi ṭhitāva sā dhātūtiādinā tatra tathatā avitathatātiādināca yathāvuttaṃ idappaccayatā saṅkhātaṃ sāmañña lakkhaṇameva paṭiccasamuppādonāmāti dasseti. Na cettha bhāvasādhane kate sati paṭiccasaddena saha samuppādasaddassa asamānakattutāsaṅkhāto byañjanayuttivirodho atthi. Yo paṭicca kriyāya kattā, tasseva samuppādakriyāyapi kattutā sambhavato. Na hi kriyānāma katturahitāsambhavatīti. Saṅkhatadhammesuca gambhīresu sati aniccatādilakkhaṇaṃ viya idaṃpi saṅkhatalakkhaṇaṃ gambhīrameva hotīti nayidha gambhīravacanavirodho sambhavati. Athakho saṅkhatadhammato saṅkhatalakkhaṇameva gambhīrataraṃ hotīti. Tādisena pana sāmaññalakkhaṇena sampannā yathāvuttā avijjādayo saṅkhatadhammā paṭiccasamuppannānāma. Yathāha-katameca bhikkhave paṭiccasamuppannādhammā jarāmaraṇaṃ bhikkhave paṭiccasamuppannaṃ.La. Avijjā bhikkhave paṭiccasamuppannāti. Iti sabbesaṃ paccayapaccayuppanna bhūtānaṃ saṅkhatadhammānaṃ paccayā satta vuttitāsaṅkhāto paṭiccasamuppādoca so nīyati ñāyati paṭivijjhīyatīti katvā nayocāti paṭiccasamuppādanayo. Paṭhapeti saṅkhatadhamme nānāpakārehi paccayabhedehi pavatteti deseti etthāti paṭṭhānaṃ. Mahāpakaraṇaṃ. Paṭṭhāne desito nayo paṭṭhānanayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmiṃ tasmiṃ paccayadhamme bhāve vijjamāne sati te te bhavanti sīlenāti tabbhāvabhāvino. Saṅkhatadhammā. Tesaṃ bhāvo tabbhāvabhāvibhāvo, imasmiṃ sati idaṃ hoti. Imassa uppādā idaṃ uppajjatīti evaṃ pavatto saṅkhatadhammaniyāmo. Tabbhāvabhāvibhāvoeva ākāro tabbhāvabhāvibhāvākāro. So eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tabbhāvabhāvibhāvākāramattaṃ"
      },
      ". Mattasaddena hetādipaccaya sattiniyamaṃ nivatteti. Tena upalakkhito nayo paṭiccasamuppāda nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āhaccapaccayaṭṭhitiṃ ārabbhā"
      },
      "ti ettha hetu ārammaṇā divasena tathātathā upakārakatāsaṅkhāto paccayasatti viseso āhaccapaccayaṭṭhitināma. So hi avijjāpaccayā saṅkhārātiādīsu viya paccayadhammuddhāramatte aṭṭhatvā hetupaccayo ārammaṇapaccahotiādinā paccayasatti visesuddhāravasena āhacca matthakaṃ pāpetvā desitattā āhaccapaccayaṭṭhitīti vuccati. Paccayadhammā tiṭṭhanti attano paccayuppannābhisaṅkharaṇa kiccaṃ patvā anosakkamānā hutvā pavattanti etāyāti katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārabbhā"
      },
      "ti paṭicca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuccatī"
      },
      "ti bhagavatā kathīyati."
    ],
    "innerText": "Tasmiṃ tasmiṃ paccayadhamme bhāve vijjamāne sati te te bhavanti sīlenāti tabbhāvabhāvino. Saṅkhatadhammā. Tesaṃ bhāvo tabbhāvabhāvibhāvo, imasmiṃ sati idaṃ hoti. Imassa uppādā idaṃ uppajjatīti evaṃ pavatto saṅkhatadhammaniyāmo. Tabbhāvabhāvibhāvoeva ākāro tabbhāvabhāvibhāvākāro. So eva tabbhāvabhāvibhāvākāramattaṃ. Mattasaddena hetādipaccaya sattiniyamaṃ nivatteti. Tena upalakkhito nayo paṭiccasamuppāda nayo. Āhaccapaccayaṭṭhitiṃ ārabbhāti ettha hetu ārammaṇā divasena tathātathā upakārakatāsaṅkhāto paccayasatti viseso āhaccapaccayaṭṭhitināma. So hi avijjāpaccayā saṅkhārātiādīsu viya paccayadhammuddhāramatte aṭṭhatvā hetupaccayo ārammaṇapaccahotiādinā paccayasatti visesuddhāravasena āhacca matthakaṃ pāpetvā desitattā āhaccapaccayaṭṭhitīti vuccati. Paccayadhammā tiṭṭhanti attano paccayuppannābhisaṅkharaṇa kiccaṃ patvā anosakkamānā hutvā pavattanti etāyāti katvā. Ārabbhāti paṭicca. Vuccatīti bhagavatā kathīyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubhayaṃ pana vomissitvā papañcenti ācariyā"
      },
      "ti idaṃ paṭicca samuppādaṃ papañcente sandhāya vuttaṃ. Tehi taṃ papañcayantā paṭṭhāna nayaṃpi āharitvā papañcentīti. Yathā sūriyo udayanto andhakāre vidhametvā dabbasambhāre mahājanassa pākaṭe karoti. Evamevaṃ uppannaṃ catusaccañāṇaṃ avijjandhakāraṃ vidhamitvā catusacca dhammaṃ vidati pākaṭaṃ karotīti vijjā. Tappaṭipakkhattā moho avijjānāma. So hi uppajjamāno dhammesu aññāṇaadassana saṅkhātaṃ andhakāraṃ janetvāva uppajjati. Paṭicca phalaṃ eti āgacchati etasmā etenāti vā paccayo. Avijjāca sā paccayo cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avijjāpaccayo"
      },
      ". Tasmā avijjāpaccayā saṅkhārā sambhavantīti sambandho. Saṅkhataṃ kāyavacīmanokammaṃ abhisaṅkharonti sattā etehīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅkhārā"
      },
      ". Vijānātīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viññāṇaṃ"
      },
      ". Vijānanti sattā etenāti ",
      " vā viññāṇaṃ. Ārammaṇe namatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāmaṃ"
      },
      ". Ruppati vikāraṃ āpajjatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpaṃ"
      },
      ". Adhiṭṭhānaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āyatanaṃ"
      },
      ". Devānaṃ devāyatanamiva. Phusatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "phasso"
      },
      ". Phusanti sampayuttakā dhammā etenāti vā phasso. Vedayatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedanā"
      },
      ". Vedayanti paccanubhavanti sattā etāyātivā vedanā. Tassati paritassatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṇhā"
      },
      ". Niccapipāsavasena ārammaṇahetu niccaṃ cañcalati pattheti vāti attho. Tassanti paritassanti cañcalanti sattā etāyāti vā taṇhā. Upādiyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upādānaṃ"
      },
      ". Amuñcagāhaṃ gaṇhātīti attho. Upādiyanti sattā etenāti vā upādānaṃ."
    ],
    "innerText": "Ubhayaṃ pana vomissitvā papañcenti ācariyāti idaṃ paṭicca samuppādaṃ papañcente sandhāya vuttaṃ. Tehi taṃ papañcayantā paṭṭhāna nayaṃpi āharitvā papañcentīti. Yathā sūriyo udayanto andhakāre vidhametvā dabbasambhāre mahājanassa pākaṭe karoti. Evamevaṃ uppannaṃ catusaccañāṇaṃ avijjandhakāraṃ vidhamitvā catusacca dhammaṃ vidati pākaṭaṃ karotīti vijjā. Tappaṭipakkhattā moho avijjānāma. So hi uppajjamāno dhammesu aññāṇaadassana saṅkhātaṃ andhakāraṃ janetvāva uppajjati. Paṭicca phalaṃ eti āgacchati etasmā etenāti vā paccayo. Avijjāca sā paccayo cāti avijjāpaccayo. Tasmā avijjāpaccayā saṅkhārā sambhavantīti sambandho. Saṅkhataṃ kāyavacīmanokammaṃ abhisaṅkharonti sattā etehīti saṅkhārā. Vijānātīti viññāṇaṃ. Vijānanti sattā etenāti vā viññāṇaṃ. Ārammaṇe namatīti nāmaṃ. Ruppati vikāraṃ āpajjatīti rūpaṃ. Adhiṭṭhānaṭṭhena āyatanaṃ. Devānaṃ devāyatanamiva. Phusatīti phasso. Phusanti sampayuttakā dhammā etenāti vā phasso. Vedayatīti vedanā. Vedayanti paccanubhavanti sattā etāyātivā vedanā. Tassati paritassatīti taṇhā. Niccapipāsavasena ārammaṇahetu niccaṃ cañcalati pattheti vāti attho. Tassanti paritassanti cañcalanti sattā etāyāti vā taṇhā. Upādiyatīti upādānaṃ. Amuñcagāhaṃ gaṇhātīti attho. Upādiyanti sattā etenāti vā upādānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhavati vaḍḍhatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhavo"
      },
      ". Bhavanti jāyanti vaḍḍhanti sukhadukkhāni etenāti vā bhavo. Jananaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jāti"
      },
      ". Jāyanti pātubhavanti saṅkhata dhammā etāyāti vā jāti. Jīraṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jarā"
      },
      ". Jīranti jiṇṇabhāvaṃ gacchanti etāyāti vā jarā. Socanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "soko"
      },
      ". Socanti cittapariḷāhaṃ gacchanti etenāti vā soko. Paridevanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paridevo"
      },
      ". Taṃ taṃ pavattiṃ parikittetvā devanti kandanti etenāti vā paridevo. Khamituṃ sahituṃ dukkaranti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhaṃ"
      },
      ". Dummanassa virūpacittassa bhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "domanassaṃ"
      },
      ". Bhuso āyāsanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upāyāso"
      },
      ". Āyāsananti anassāsanaṃ. Visīdananti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eva"
      },
      "nti iminā yathāvuttena. Avijjādi saṅkhārādipaccayapaccayuppanna paraṃparavidhinā samudayo hotīti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etassakevalassadukkhakkhandhassā"
      },
      "ti avijjādikassa etassa sakalassa dukkharāsissa kenaci sukhena asaṃmissassa vā dukkharāsissa abhinibbatti hotīti attho. Etthaca duvidho paṭiccasamuppādanayo suttantikanayo abhidhammanayoti. Tattha suttantikanayena tāva avijjā catubbidhā dukkhapaṭicchādikā samudayapaṭicchādikā nirodhapaṭicchādikā maggapaṭicchādikācāti. Abhidhammanayena pana pubbantapaṭicchādikā aparanta paṭicchādikā pubbantāparantapaṭicchādikā paṭiccasamuppādapaṭicchādikāti catūhi saddhiṃ aṭṭha vidhāti veditabbā."
    ],
    "innerText": "Bhavati vaḍḍhatīti bhavo. Bhavanti jāyanti vaḍḍhanti sukhadukkhāni etenāti vā bhavo. Jananaṃ jāti. Jāyanti pātubhavanti saṅkhata dhammā etāyāti vā jāti. Jīraṇaṃ jarā. Jīranti jiṇṇabhāvaṃ gacchanti etāyāti vā jarā. Socanaṃ soko. Socanti cittapariḷāhaṃ gacchanti etenāti vā soko. Paridevanaṃ paridevo. Taṃ taṃ pavattiṃ parikittetvā devanti kandanti etenāti vā paridevo. Khamituṃ sahituṃ dukkaranti dukkhaṃ. Dummanassa virūpacittassa bhāvo domanassaṃ. Bhuso āyāsanaṃ upāyāso. Āyāsananti anassāsanaṃ. Visīdananti attho. Evanti iminā yathāvuttena. Avijjādi saṅkhārādipaccayapaccayuppanna paraṃparavidhinā samudayo hotīti sambandho. Etassakevalassadukkhakkhandhassāti avijjādikassa etassa sakalassa dukkharāsissa kenaci sukhena asaṃmissassa vā dukkharāsissa abhinibbatti hotīti attho. Etthaca duvidho paṭiccasamuppādanayo suttantikanayo abhidhammanayoti. Tattha suttantikanayena tāva avijjā catubbidhā dukkhapaṭicchādikā samudayapaṭicchādikā nirodhapaṭicchādikā maggapaṭicchādikācāti. Abhidhammanayena pana pubbantapaṭicchādikā aparanta paṭicchādikā pubbantāparantapaṭicchādikā paṭiccasamuppādapaṭicchādikāti catūhi saddhiṃ aṭṭha vidhāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhārā"
      },
      " suttantikanayena sāsavā kusalākusalacetanā apuññābhisaṅkhāro puññābhisaṅkhāro āneñjā bhisaṅkhāroti pana ",
      " tividhā honti. Tattha dvādasa akusalacetanā apuññāti saṅkhāronāma. Kāmarūpa kusalacetanā puññābhisaṅkhāronāma. Arūpakusalacetanā āneñjātisaṅkhāronāma. Abhidhammanayena pana sabbāpi lokiyalokuttarabhūtā kusalākusalacetanā saṅkhārānāma. Kiriyacetanā pana sabbāpi vibhaṅge nagahitā. Aṭṭhakathāyañca kiriyadhammānaṃ pana yasmā neva avijjā na kusalā kusalamūlāni upanissayapaccayattaṃ labhanti. Tasmā kiriyavasena paccayākāro navuttoti vuttaṃ. Avijjāca kusalākusalamūlā nica kiriyadhammānaṃ upanissaya paccayā na honti. Tasmā kiriyadhammā paṭiccasamuppādadesanāyaṃ nagahitāti vuttaṃ hoti. Saṃyuttepi yato kho bhikkhave bhikkhuno avijjā pahīnā hoti. Vijjāuppannā. So avijjā virāgā vijjuppādā neva puññābhisaṅkhāraṃ abhisaṅkharoti. Na apuññābhisaṅkhāraṃ. Na āneñjābhisaṅkhāraṃ abhisaṅkharotīti vuttaṃ. Attano anurūpapaccayavasena pana tesaṃpi paṭicca samuppādo avāritoyeva. Nahi koci paṭiccasamuppādarahito saṅkhatadhammonāma atthīti. Esa nayo viññāṇādīsupīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viññāṇa"
      },
      "nti bāttiṃsavidhaṃ lokiyavipākaviññāṇaṃ suttantikanayena. Abhidhammanayena pana kiriyacittavajjitaṃ ekūnasattatividhaṃ lokiyalokuttaraviññāṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāmarūpa"
      },
      "nti lokiya viññāṇa sahajātaṃ vedanādikhandhattayaṃ paṭisandhiyaṃ kammajarūpaṃ pavattiyaṃ cittaja rūpañca suttantikanayena. Abhidhammanayena pana sabbaṃ kusalākusala vipākasampayuttaṃ khandhattayaṃ vuttappakārarūpañca. Aṭṭhakathāyaṃ pana laddhapacchājātapaccayaṃ sabbaṃpi catusamuṭṭhānarūpaṃ gahitameva."
    ],
    "innerText": "Saṅkhārā suttantikanayena sāsavā kusalākusalacetanā apuññābhisaṅkhāro puññābhisaṅkhāro āneñjā bhisaṅkhāroti pana tividhā honti. Tattha dvādasa akusalacetanā apuññāti saṅkhāronāma. Kāmarūpa kusalacetanā puññābhisaṅkhāronāma. Arūpakusalacetanā āneñjātisaṅkhāronāma. Abhidhammanayena pana sabbāpi lokiyalokuttarabhūtā kusalākusalacetanā saṅkhārānāma. Kiriyacetanā pana sabbāpi vibhaṅge nagahitā. Aṭṭhakathāyañca kiriyadhammānaṃ pana yasmā neva avijjā na kusalā kusalamūlāni upanissayapaccayattaṃ labhanti. Tasmā kiriyavasena paccayākāro navuttoti vuttaṃ. Avijjāca kusalākusalamūlā nica kiriyadhammānaṃ upanissaya paccayā na honti. Tasmā kiriyadhammā paṭiccasamuppādadesanāyaṃ nagahitāti vuttaṃ hoti. Saṃyuttepi yato kho bhikkhave bhikkhuno avijjā pahīnā hoti. Vijjāuppannā. So avijjā virāgā vijjuppādā neva puññābhisaṅkhāraṃ abhisaṅkharoti. Na apuññābhisaṅkhāraṃ. Na āneñjābhisaṅkhāraṃ abhisaṅkharotīti vuttaṃ. Attano anurūpapaccayavasena pana tesaṃpi paṭicca samuppādo avāritoyeva. Nahi koci paṭiccasamuppādarahito saṅkhatadhammonāma atthīti. Esa nayo viññāṇādīsupīti. Viññāṇanti bāttiṃsavidhaṃ lokiyavipākaviññāṇaṃ suttantikanayena. Abhidhammanayena pana kiriyacittavajjitaṃ ekūnasattatividhaṃ lokiyalokuttaraviññāṇaṃ. Nāmarūpanti lokiya viññāṇa sahajātaṃ vedanādikhandhattayaṃ paṭisandhiyaṃ kammajarūpaṃ pavattiyaṃ cittaja rūpañca suttantikanayena. Abhidhammanayena pana sabbaṃ kusalākusala vipākasampayuttaṃ khandhattayaṃ vuttappakārarūpañca. Aṭṭhakathāyaṃ pana laddhapacchājātapaccayaṃ sabbaṃpi catusamuṭṭhānarūpaṃ gahitameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[226] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[226] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Tadubhayaṃpi idha paṭisandhiviññāṇasahagata’’nti vuttaṃ. Taṃ anupapannaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saḷāyatana"
      },
      "nti cha ajjhattikāyatanāni eva sabbattha pāḷiyaṃ vibhattāni. Ekacce pana ācariyā bāhirāyatanāni phassassa paccayā hontīti katvā tānipi idha gaṇhanti. Taṃpi nidānavagga pāḷiyā sametiyeva. Yathāha –"
    ],
    "innerText": "Saḷāyatananti cha ajjhattikāyatanāni eva sabbattha pāḷiyaṃ vibhattāni. Ekacce pana ācariyā bāhirāyatanāni phassassa paccayā hontīti katvā tānipi idha gaṇhanti. Taṃpi nidānavagga pāḷiyā sametiyeva. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "Katamoca ",
      " bhikkhave lokassa samudayo. Cakkhuñca paṭicca rūpeca uppajjati cakkhuviññāṇaṃ. Tiṇṇaṃ saṅgati phasso. Phassapaccayā vedanā. Vedanāpaccayā taṇhā.La. Domanassupāyāsā sambhavantīti ayaṃ lokassa samudayo. Sotañca.La. Manañca paṭicca dhammeca uppajjati manoviññāṇaṃ. Tiṇṇaṃ saṅgati phasso.La. Lokassa samudayoti."
    ],
    "innerText": "Katamoca bhikkhave lokassa samudayo. Cakkhuñca paṭicca rūpeca uppajjati cakkhuviññāṇaṃ. Tiṇṇaṃ saṅgati phasso. Phassapaccayā vedanā. Vedanāpaccayā taṇhā.La. Domanassupāyāsā sambhavantīti ayaṃ lokassa samudayo. Sotañca.La. Manañca paṭicca dhammeca uppajjati manoviññāṇaṃ. Tiṇṇaṃ saṅgati phasso.La. Lokassa samudayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phassavedanādayopi"
      },
      " nayadvaye taṃ taṃ viññāṇasampayuttā veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhupādānāni"
      },
      " pākaṭāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavo"
      },
      " duvidho kammabhavo upapattibhavoca. Lokiyakusalākusalabhūtā cetanāca. Cetanāsampayuttā abhijjhādayo anabhijjhādayoca kammabhavo. Yathāha-sabbaṃpi bhavagāmikammaṃ kammabhavoti. Kammanibbattā pana sabbepi lokiyavipākakkhandhā sabbānica kammajarūpāni upapattibhavo suttantikanayena. Abhidhammanayena pana lokuttara khandhāpi vibhaṅge āgatāeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jātijarāmaraṇāni"
      },
      " sabbesaṃ saṅkhata dhammānaṃ lakkhaṇapattāni. Sokādīsu ñātibyasanādīhi phuṭṭhassa socanākārena pavattā domanassavedanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sokonāma"
      },
      ". Rodanākārena pavatto aniṭṭho cittajasaddo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paridevonāma"
      },
      ". Kāyikā dukkhavedanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhaṃnāma"
      },
      ". Cetasikā dukkhavedanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "domanassaṃnāma"
      },
      ". Ñātibyasanādinimittaṃ saṃsīdanavisīdanākārapavatto doso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upāyāsonāma"
      },
      ". Ayamettha vibhāgo. Yesaṃ pana khandhadukkhe avijjā appahīnā hoti. Tesaṃ itarasaccesupi sā appahīnāeva hotīti te khandhapavattiyaṃeva sukhasaññaṃ labhanti. Khandhanirodhe dukkhasaññaṃ. Khandhapavattimaggeeva sukhamaggasaññaṃ labhanti. Khandhanirodhamagge dukkhamaggasaññaṃ. Tasmā khandhapavattipaccayabhūtā puññā puññāneñjābhisaṅkhāradhammāeva tesaṃ avijjānivuṭānaṃ sukhakāmānaṃ dukkhapaṭikūlānaṃ sattānaṃ paṭisaraṇā hontīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avijjāpacca yāsaṅkhārā"
      },
      "ti. Etthaca visesato paccuppannakhandhapaṭicchādikāya avijjāya duccaritabhūtā apuññābhisaṅkhārā sambhavanti. Anāgata khandhapaṭicchādikāya avijjāya sucaritabhūtā puññāneñjābhisaṅkhārā sambhavantīti ",
      " veditabbā. Saṅkhāresu sati appahīnabhavataṇhānaṃ sattānaṃ cutianantaraṃ punabhavābhinibbattiyā koci vibandho nāma natthi. Tasmā saṅkhārapaccayā viññāṇaṃ nāmarūpaṃ saḷāyatanaṃ phasso vedanāti ime attabhāvasaññitā pañcadhammā bhavantare pātu bhavanti. Tattha pana viññāṇameva padhānaṃ jeṭṭhakaṃ hotīti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhārapaccayāviññāṇa"
      },
      "nti viññāṇeca sati tassa udayabhūtānaṃ nāmarūpānaṃ uppattiyā vibandhonāma natthīti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viññāṇapaccayānāma rūpa"
      },
      "nti. Ettāvatā sāmaññato paripuṇṇonāma kāyo rūpa kāyoca vutto hoti. Evaṃsantepi tesu dvīsu kāyesu yedhammā sattapaññattiyā padhānaṅgabhūtā honti. Yehica phassā dīni upari aṅgāni āgatāni honti. Yesuca sattā attagāhaṃ daḷhataraṃ gaṇhanti. Te visuṃ nīharitvā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāmarūpapaccayā saḷāyatana"
      },
      "nti vuttaṃ. Nāmarūpe sati tesaṃpi uppattiyā vibandho natthiyeva. Saḷāyatanasamuṭṭhitoca phasso saḷāyatane sati ekantena sambhavatīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saḷāyatanapaccayāphasso"
      },
      "ti. Phassasamuṭṭhitāca vedanā phasse sati ekantena sambhavatiyevāti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "phassapaccayāvedanā"
      },
      "ti. Sukhavedanāsadiso taṇhāya avassayonāma natthīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedanāpaccayātaṇhā"
      },
      "ti. Kāmupādānañcanāma ekasmiṃ ārammaṇe punappunaṃ samudācaritvā daḷhattappattā taṇhāeva, diṭṭhiyoca attanica attano ārammaṇesuca assādana khamana rocana bhūtāya taṇhāya vasena daḷhattaṃ āpajjantīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṇhāpaccayāupādāna"
      },
      "nti. Upādiyantāca tassa tassa upādāniyassa atthassa hitavuḍḍhisaññitaṃ taṃtaṃ kammabhavaṃ āyūhantiyevāti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upādānapaccayābhavo"
      },
      "ti. Bhavasaddo hettha vaḍḍhipariyāyo. Yathā –"
    ],
    "innerText": "Phassavedanādayopi nayadvaye taṃ taṃ viññāṇasampayuttā veditabbā. Taṇhupādānāni pākaṭāni. Bhavo duvidho kammabhavo upapattibhavoca. Lokiyakusalākusalabhūtā cetanāca. Cetanāsampayuttā abhijjhādayo anabhijjhādayoca kammabhavo. Yathāha-sabbaṃpi bhavagāmikammaṃ kammabhavoti. Kammanibbattā pana sabbepi lokiyavipākakkhandhā sabbānica kammajarūpāni upapattibhavo suttantikanayena. Abhidhammanayena pana lokuttara khandhāpi vibhaṅge āgatāeva. Jātijarāmaraṇāni sabbesaṃ saṅkhata dhammānaṃ lakkhaṇapattāni. Sokādīsu ñātibyasanādīhi phuṭṭhassa socanākārena pavattā domanassavedanā sokonāma. Rodanākārena pavatto aniṭṭho cittajasaddo paridevonāma. Kāyikā dukkhavedanā dukkhaṃnāma. Cetasikā dukkhavedanā domanassaṃnāma. Ñātibyasanādinimittaṃ saṃsīdanavisīdanākārapavatto doso upāyāsonāma. Ayamettha vibhāgo. Yesaṃ pana khandhadukkhe avijjā appahīnā hoti. Tesaṃ itarasaccesupi sā appahīnāeva hotīti te khandhapavattiyaṃeva sukhasaññaṃ labhanti. Khandhanirodhe dukkhasaññaṃ. Khandhapavattimaggeeva sukhamaggasaññaṃ labhanti. Khandhanirodhamagge dukkhamaggasaññaṃ. Tasmā khandhapavattipaccayabhūtā puññā puññāneñjābhisaṅkhāradhammāeva tesaṃ avijjānivuṭānaṃ sukhakāmānaṃ dukkhapaṭikūlānaṃ sattānaṃ paṭisaraṇā hontīti vuttaṃ avijjāpacca yāsaṅkhārāti. Etthaca visesato paccuppannakhandhapaṭicchādikāya avijjāya duccaritabhūtā apuññābhisaṅkhārā sambhavanti. Anāgata khandhapaṭicchādikāya avijjāya sucaritabhūtā puññāneñjābhisaṅkhārā sambhavantīti veditabbā. Saṅkhāresu sati appahīnabhavataṇhānaṃ sattānaṃ cutianantaraṃ punabhavābhinibbattiyā koci vibandho nāma natthi. Tasmā saṅkhārapaccayā viññāṇaṃ nāmarūpaṃ saḷāyatanaṃ phasso vedanāti ime attabhāvasaññitā pañcadhammā bhavantare pātu bhavanti. Tattha pana viññāṇameva padhānaṃ jeṭṭhakaṃ hotīti vuttaṃ. Saṅkhārapaccayāviññāṇanti viññāṇeca sati tassa udayabhūtānaṃ nāmarūpānaṃ uppattiyā vibandhonāma natthīti vuttaṃ. Viññāṇapaccayānāma rūpanti. Ettāvatā sāmaññato paripuṇṇonāma kāyo rūpa kāyoca vutto hoti. Evaṃsantepi tesu dvīsu kāyesu yedhammā sattapaññattiyā padhānaṅgabhūtā honti. Yehica phassā dīni upari aṅgāni āgatāni honti. Yesuca sattā attagāhaṃ daḷhataraṃ gaṇhanti. Te visuṃ nīharitvā dassetuṃ nāmarūpapaccayā saḷāyatananti vuttaṃ. Nāmarūpe sati tesaṃpi uppattiyā vibandho natthiyeva. Saḷāyatanasamuṭṭhitoca phasso saḷāyatane sati ekantena sambhavatīti vuttaṃ saḷāyatanapaccayāphassoti. Phassasamuṭṭhitāca vedanā phasse sati ekantena sambhavatiyevāti vuttaṃ phassapaccayāvedanāti. Sukhavedanāsadiso taṇhāya avassayonāma natthīti vuttaṃ vedanāpaccayātaṇhāti. Kāmupādānañcanāma ekasmiṃ ārammaṇe punappunaṃ samudācaritvā daḷhattappattā taṇhāeva, diṭṭhiyoca attanica attano ārammaṇesuca assādana khamana rocana bhūtāya taṇhāya vasena daḷhattaṃ āpajjantīti vuttaṃ taṇhāpaccayāupādānanti. Upādiyantāca tassa tassa upādāniyassa atthassa hitavuḍḍhisaññitaṃ taṃtaṃ kammabhavaṃ āyūhantiyevāti vuttaṃ upādānapaccayābhavoti. Bhavasaddo hettha vaḍḍhipariyāyo. Yathā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Suvijāno bhavaṃ hoti, duvijāno parābhavoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kammabhave sati ekantena punabhavopi sambhavatīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhavapaccayājātī"
      },
      "ti. Jātiyāca sati ekantena jarāmaraṇaṃ hotiyevāti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jātipaccayājarāmaraṇa"
      },
      "nti. Ayamettha tabbhāvabhāvibhāvavidhi. ",
      " Sokādivacanañcettha īdisena tabbhāva bhāvibhāvena pavattassa sakalassa vaṭṭadhammassa ādīnavarāsidassa natthaṃ vuttanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etthā"
      },
      "ti imasmiṃ paccayasaṅgahe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti tasmiṃ paṭiccasamuppādanaye. Addhānavante dhamme bhuso dhāretīti addhā. Kālo. So hi tekālike dhamme santānānupabandhavasena kappaparaṃparā vassa utu māsa pakkha ratti diva paraṃparāca hutvā apatamāne dhārento viya upaṭṭhātīti. Athavā, bhuso dahanti tiṭṭhanti pavattanti tekālikā dhammā etthāti addhā. Kāloyeva. So pana sayaṃ abhinnopi bhedavante dhamme upādāya bhinno viya upacarituṃ yuttoti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tayoaddhā"
      },
      "ti."
    ],
    "innerText": "Kammabhave sati ekantena punabhavopi sambhavatīti vuttaṃ bhavapaccayājātīti. Jātiyāca sati ekantena jarāmaraṇaṃ hotiyevāti vuttaṃ jātipaccayājarāmaraṇanti. Ayamettha tabbhāvabhāvibhāvavidhi. Sokādivacanañcettha īdisena tabbhāva bhāvibhāvena pavattassa sakalassa vaṭṭadhammassa ādīnavarāsidassa natthaṃ vuttanti. Etthāti imasmiṃ paccayasaṅgahe. Tatthāti tasmiṃ paṭiccasamuppādanaye. Addhānavante dhamme bhuso dhāretīti addhā. Kālo. So hi tekālike dhamme santānānupabandhavasena kappaparaṃparā vassa utu māsa pakkha ratti diva paraṃparāca hutvā apatamāne dhārento viya upaṭṭhātīti. Athavā, bhuso dahanti tiṭṭhanti pavattanti tekālikā dhammā etthāti addhā. Kāloyeva. So pana sayaṃ abhinnopi bhedavante dhamme upādāya bhinno viya upacarituṃ yuttoti vuttaṃ tayoaddhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[227]"
      },
      " Yaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[227] Yaṃ pana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Atati satataṃ gacchati pavattatīti addhāti vuttaṃ’’. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evañhi sati addhānanti nasijjhati. Yathā addhānamaggapaṭipannoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṅgānī"
      },
      "ti avayavapadhānaṅgāni. Padhānasambhārāti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākārā"
      },
      "ti avayavakoṭṭhāsā. Koṭṭhāsattho hettha ākārasaddo. Yathā dvattiṃsākārāti. Ākiranti tattha tattha pakiritvā thapitā viya hontīti ākārātipi vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sandhī"
      },
      "ti dvinnaṃ dvinnaṃ saṅkhepānaṃ saṅghaṭanaṭṭhānaṃ. Saṅkhepāti padhānadhammasaṅgahā. Vaṭṭanti punappunaṃ āvaṭṭantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vaṭṭāni"
      },
      ". Mūlayanti sabbepi vaṭṭadhammā ettha tiṭṭhanti tadāyattavuttitāyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mūlāni"
      },
      ". Patiṭṭhā. Pabhavāti attho. Yasmā eko puriso ekāya aṅguliyā samuddo dakaṃ gahetvā mahājanassa mukhe pakkhipitvā catūsu mahāsamuddesu udakassa loṇabhāvaṃ saññāpento viya bhagavāpi avijjā paccayā saṅkhārātiādinā ekameva paccuppannabhavaṃ paripuṇṇaṃ desetvā anamataggassa sakalassa saṃsāravaṭṭassa pavattiṃ ñāpesi. Paripuṇṇaṃ desentenaca nāma tassa ekassa bhavassa hetuca desetabbo hoti. Phalañca desetabbaṃ hoti. Tattha hetū nāma purimabhave siddhā avijjā saṅkhārā. Phalaṃnāma anāgatabhave jāti. ",
      " Iti ekabhavavisayāpi ayaṃ desanā ekadesena atītānāgata sādhāraṇāca hotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avijjāsaṅkhārāatītoaddhā"
      },
      "tiādi. Etthaca addhuno addhāvantānañca abhedaṃ viya katvā vacanaṃ dhammato visuṃ addhāsaṅkhātassa kālassa abhāvaṃ dasseti. Kāloyeva lokaṃ pavatteti nivattetīti pavattaṃ micchāvādañca nīvāreti. Na hi sayaṃ abhāvabhūto kālo kassaci pavattako nivattakoca bhavituṃ yuttoti. Kasmā panettha ekamekassa paccuppannassa attabhāvassa pavattiṃ dassento bhagavā atītabhave hetuñca anāgatabhave phalañca dassetīti. Ahetuvisamahetudiṭṭhīnaṃ nīvāraṇatthaṃ atītahetu dassanaṃ. Ucchedadiṭṭhi nīvāraṇatthaṃ anāgataphaladassanaṃ. Sassata diṭṭhinīvāraṇatthaṃ ubhayadassananti daṭṭhabbaṃ. Tattha ahetu apaccayā sattā pavattanti nivattanti saṃkilissanti visujjhantīti pavattā diṭṭhi ahetudiṭṭhināma. Brahmā pajāpati issaranimmānādivasena abhūta hetudassanaṃ visamahetudiṭṭhināma. Sattā maraṇe ucchijjanti, anāgate jātināma natthīti pavattā diṭṭhi ucchedadiṭṭhināma. Attānicco dhuvo, sova bhavato bhavaṃ sandhāvati saṃsaratīti pavattā diṭṭhi sassatadiṭṭhināma. Evaṃ nicco hutvā sandhāvantopana avijjādīhi sādhetabbo nahoti. Tasmā avijjāsaṅkhārehi bhavantare puna viññāṇuppattiṃ vadantena sassatadiṭṭhi nīvāritā hotīti."
    ],
    "innerText": "Evañhi sati addhānanti nasijjhati. Yathā addhānamaggapaṭipannoti. Aṅgānīti avayavapadhānaṅgāni. Padhānasambhārāti vuttaṃ hoti. Ākārāti avayavakoṭṭhāsā. Koṭṭhāsattho hettha ākārasaddo. Yathā dvattiṃsākārāti. Ākiranti tattha tattha pakiritvā thapitā viya hontīti ākārātipi vadanti. Sandhīti dvinnaṃ dvinnaṃ saṅkhepānaṃ saṅghaṭanaṭṭhānaṃ. Saṅkhepāti padhānadhammasaṅgahā. Vaṭṭanti punappunaṃ āvaṭṭantīti vaṭṭāni. Mūlayanti sabbepi vaṭṭadhammā ettha tiṭṭhanti tadāyattavuttitāyāti mūlāni. Patiṭṭhā. Pabhavāti attho. Yasmā eko puriso ekāya aṅguliyā samuddo dakaṃ gahetvā mahājanassa mukhe pakkhipitvā catūsu mahāsamuddesu udakassa loṇabhāvaṃ saññāpento viya bhagavāpi avijjā paccayā saṅkhārātiādinā ekameva paccuppannabhavaṃ paripuṇṇaṃ desetvā anamataggassa sakalassa saṃsāravaṭṭassa pavattiṃ ñāpesi. Paripuṇṇaṃ desentenaca nāma tassa ekassa bhavassa hetuca desetabbo hoti. Phalañca desetabbaṃ hoti. Tattha hetū nāma purimabhave siddhā avijjā saṅkhārā. Phalaṃnāma anāgatabhave jāti. Iti ekabhavavisayāpi ayaṃ desanā ekadesena atītānāgata sādhāraṇāca hotīti vuttaṃ avijjāsaṅkhārāatītoaddhātiādi. Etthaca addhuno addhāvantānañca abhedaṃ viya katvā vacanaṃ dhammato visuṃ addhāsaṅkhātassa kālassa abhāvaṃ dasseti. Kāloyeva lokaṃ pavatteti nivattetīti pavattaṃ micchāvādañca nīvāreti. Na hi sayaṃ abhāvabhūto kālo kassaci pavattako nivattakoca bhavituṃ yuttoti. Kasmā panettha ekamekassa paccuppannassa attabhāvassa pavattiṃ dassento bhagavā atītabhave hetuñca anāgatabhave phalañca dassetīti. Ahetuvisamahetudiṭṭhīnaṃ nīvāraṇatthaṃ atītahetu dassanaṃ. Ucchedadiṭṭhi nīvāraṇatthaṃ anāgataphaladassanaṃ. Sassata diṭṭhinīvāraṇatthaṃ ubhayadassananti daṭṭhabbaṃ. Tattha ahetu apaccayā sattā pavattanti nivattanti saṃkilissanti visujjhantīti pavattā diṭṭhi ahetudiṭṭhināma. Brahmā pajāpati issaranimmānādivasena abhūta hetudassanaṃ visamahetudiṭṭhināma. Sattā maraṇe ucchijjanti, anāgate jātināma natthīti pavattā diṭṭhi ucchedadiṭṭhināma. Attānicco dhuvo, sova bhavato bhavaṃ sandhāvati saṃsaratīti pavattā diṭṭhi sassatadiṭṭhināma. Evaṃ nicco hutvā sandhāvantopana avijjādīhi sādhetabbo nahoti. Tasmā avijjāsaṅkhārehi bhavantare puna viññāṇuppattiṃ vadantena sassatadiṭṭhi nīvāritā hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kasmā panettha sokādayo aṅgesu nagahitāti. Jātiyā sati sokādayo ekantena sambhavantīti evaṃ tabbhāva bhāvibhāva lakkhaṇassa abhāvato. Satipi hi jātiyā rūpa loke arūpalokeca te na sambhavanti. Kāmalokepi kesañci na sambhavantiyevāti. Yadievaṃ kimatthaṃ tesaṃ vacananti. Jātiyāvā avijjādikassavā vuttappakārassa sakalassa vaṭṭapavattassa mahāādīnavarāsidassanatthanti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sokādivacanaṃ panettha nissanda phalanidassana"
      },
      "nti vuttaṃ. Tattha nissandaphalanidassananti jātiyā mahāādīnava rāsisaṅkhātassa udayaphalassa nidassananti attho. ",
      " Kasmā pana imassa paccuppanna bhavassa atītapaccayā dve avijjā saṅkhārā eva pāḷiyaṃ vuttā. Kiṃ pana te eva dve imassa paccayā hontīti. Aññepi hontiyeva. Atha kasmā te pāḷiyaṃ na vuttāti. Avuttānaṃpi tesaṃ atthato laddhattāti. Kathañca te avuttāpi laddhāti. Tabbhāva bhāvibhāvalakkhaṇena tadavinābhāvibhāvalakkhaṇenaca laddhāti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avijjāsaṅkhāraggahaṇenā"
      },
      "tiādi māha. Esa nayo paratthapi. Tattha avijjā saṅkhāraggahaṇenāti pāḷiyaṃ ādito vuttena avijjāsaṅkhāra vacanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhupādānabhavāpi gahitā bhavantī"
      },
      "ti avijjābhāve bhāvato, abhāveca abhāvato avijjāgahaṇena taṇhupādānānipi gahitāni bhavanti. Saṅkhārabhāveca bhāvato, abhāveca abhāvato saṅkhāraggahaṇena kammabhavopi gahito bhavatīti attho."
    ],
    "innerText": "Kasmā panettha sokādayo aṅgesu nagahitāti. Jātiyā sati sokādayo ekantena sambhavantīti evaṃ tabbhāva bhāvibhāva lakkhaṇassa abhāvato. Satipi hi jātiyā rūpa loke arūpalokeca te na sambhavanti. Kāmalokepi kesañci na sambhavantiyevāti. Yadievaṃ kimatthaṃ tesaṃ vacananti. Jātiyāvā avijjādikassavā vuttappakārassa sakalassa vaṭṭapavattassa mahāādīnavarāsidassanatthanti dassetuṃ sokādivacanaṃ panettha nissanda phalanidassananti vuttaṃ. Tattha nissandaphalanidassananti jātiyā mahāādīnava rāsisaṅkhātassa udayaphalassa nidassananti attho. Kasmā pana imassa paccuppanna bhavassa atītapaccayā dve avijjā saṅkhārā eva pāḷiyaṃ vuttā. Kiṃ pana te eva dve imassa paccayā hontīti. Aññepi hontiyeva. Atha kasmā te pāḷiyaṃ na vuttāti. Avuttānaṃpi tesaṃ atthato laddhattāti. Kathañca te avuttāpi laddhāti. Tabbhāva bhāvibhāvalakkhaṇena tadavinābhāvibhāvalakkhaṇenaca laddhāti dassento avijjāsaṅkhāraggahaṇenātiādi māha. Esa nayo paratthapi. Tattha avijjā saṅkhāraggahaṇenāti pāḷiyaṃ ādito vuttena avijjāsaṅkhāra vacanena. Taṇhupādānabhavāpi gahitā bhavantīti avijjābhāve bhāvato, abhāveca abhāvato avijjāgahaṇena taṇhupādānānipi gahitāni bhavanti. Saṅkhārabhāveca bhāvato, abhāveca abhāvato saṅkhāraggahaṇena kammabhavopi gahito bhavatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Kilesabhāvasāmaññato avijjāgahaṇena taṇhupādānāni. Kammabhāva sāmaññato saṅkhāraggahaṇena kammabhavo gahitoti vuttaṃ. Taṃpi yujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā avijjā saṅkhārā gahitā bhavantīti sambandho. Tadavinā bhāvibhāvena taṇhupādānavacanena avijjāca bhavavacanena saṅkhārāca gahitāti attho. Lakkhaṇadhammānaṃ lakkhitabbadhammehi avinābhāvibhāvato tadavinābhāvibhāvena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jātijarā.La. Gahita"
      },
      "nti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itikatvā"
      },
      "ti iminā kāraṇena. Vīsatākārā bhavantīti sambandho. Pathamaṃ hetupañcakaṃ eko saṅkhepo. Dutīyaṃ phalapañcakaṃ eko. Tatīyaṃ hetupañcakaṃ eko. Catutthaṃ phalapañcakaṃ eko saṅkhepoti catusaṅkhepā honti. Cattāro saṅgahā hontīti attho. Catūsu pana saṅkhepesu siddhesu pathamena dutīyassa dutīyena tatīyassa tatīyena catutthassāti evaṃ tisso sandhiyopi sijjhantiyevāti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tisandhi catusaṅkhepāca bhavantī"
      },
      "ti. Etthaca hetupañcakaṃ phalapañcakanti etaṃ lokassa ",
      " pākaṭavohāravasena vuttaṃ. Hetuphala saddā pana paccayapaccayuppannapariyāyā eva hontīti dutīyapañcakassa pathamaṃ upādāya phalapañcakatā tatīyaṃ upādāya hetupañcakatāca na na sambhavati. Tathā tatīyassapi catutthaṃ upādāya hetupañcakatā dutīyaṃ upādāya phalapañcakatācāti. Evañhi sati hetuto phalameva siyā. Na phalato hetūti codanā anokāsāeva hotīti. Dvīsu pana hetupañcakesu saṅkhārakammabhavānaṃ viseso aṭṭhakathāyaṃ vuttoyeva. Yathāha-dānaṃ dassāmīti cittaṃ uppādetvā māsaṃpi saṃvaccharaṃpi dānupakaraṇāni sajjantassa uppannā purimacetanāyo āyūhanasaṅkhārānāma. Paṭiggāhakānaṃ pana hatthe dakkhiṇaṃ patiṭṭhāpayato uppannā cetanā bhavoti vuccati. Ekāvajjanesuvā chasu javanesu cetanā āyūhana saṅkhārānāma. Sattamajavanacetanā bhavo. Yākācivā pana cetanā bhavo. Taṃsampayuttā āyūhana saṅkhārānāmāti. Kammabhavo upapattibhavoti dve bhavā dvādasasu aṅgesu ekasseva bhava aṅgassa avayavānāma hontīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammabhavasaṅkhātobhave kadeso"
      },
      "tiādi. Etthaca saṅkhārakammabhavānaṃ viseso vutta nayeneva veditabbo."
    ],
    "innerText": "Tathā avijjā saṅkhārā gahitā bhavantīti sambandho. Tadavinā bhāvibhāvena taṇhupādānavacanena avijjāca bhavavacanena saṅkhārāca gahitāti attho. Lakkhaṇadhammānaṃ lakkhitabbadhammehi avinābhāvibhāvato tadavinābhāvibhāvena jātijarā.La. Gahitanti vuttaṃ. Itikatvāti iminā kāraṇena. Vīsatākārā bhavantīti sambandho. Pathamaṃ hetupañcakaṃ eko saṅkhepo. Dutīyaṃ phalapañcakaṃ eko. Tatīyaṃ hetupañcakaṃ eko. Catutthaṃ phalapañcakaṃ eko saṅkhepoti catusaṅkhepā honti. Cattāro saṅgahā hontīti attho. Catūsu pana saṅkhepesu siddhesu pathamena dutīyassa dutīyena tatīyassa tatīyena catutthassāti evaṃ tisso sandhiyopi sijjhantiyevāti vuttaṃ tisandhi catusaṅkhepāca bhavantīti. Etthaca hetupañcakaṃ phalapañcakanti etaṃ lokassa pākaṭavohāravasena vuttaṃ. Hetuphala saddā pana paccayapaccayuppannapariyāyā eva hontīti dutīyapañcakassa pathamaṃ upādāya phalapañcakatā tatīyaṃ upādāya hetupañcakatāca na na sambhavati. Tathā tatīyassapi catutthaṃ upādāya hetupañcakatā dutīyaṃ upādāya phalapañcakatācāti. Evañhi sati hetuto phalameva siyā. Na phalato hetūti codanā anokāsāeva hotīti. Dvīsu pana hetupañcakesu saṅkhārakammabhavānaṃ viseso aṭṭhakathāyaṃ vuttoyeva. Yathāha-dānaṃ dassāmīti cittaṃ uppādetvā māsaṃpi saṃvaccharaṃpi dānupakaraṇāni sajjantassa uppannā purimacetanāyo āyūhanasaṅkhārānāma. Paṭiggāhakānaṃ pana hatthe dakkhiṇaṃ patiṭṭhāpayato uppannā cetanā bhavoti vuccati. Ekāvajjanesuvā chasu javanesu cetanā āyūhana saṅkhārānāma. Sattamajavanacetanā bhavo. Yākācivā pana cetanā bhavo. Taṃsampayuttā āyūhana saṅkhārānāmāti. Kammabhavo upapattibhavoti dve bhavā dvādasasu aṅgesu ekasseva bhava aṅgassa avayavānāma hontīti vuttaṃ kammabhavasaṅkhātobhave kadesotiādi. Etthaca saṅkhārakammabhavānaṃ viseso vutta nayeneva veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[228]"
      },
      " Yaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[228] Yaṃ pana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Kammabhavasaṅkhāto bhavekadesoti ettha āyatiṃ paṭisandhiyā paccayacetanā saṅkhārāti veditabbā’’ti vuttaṃ. Taṃ idha na yujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesaṃ dvinnaṃpi dvīsu hetupañcakesu saṅgahitattāti. Yathā rutapāḷinayenavā etaṃ vuttanti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avasesācā"
      },
      "ti idaṃ jātijarāmaraṇehi saddhiṃ viññāṇādiphalapañcakaṃ sandhāya vuttaṃ. Etthaca yadetaṃ pubbe jātijarāmaraṇaggahaṇena viññāṇādi phala pañcakaṃ gahitaṃ. Taṃ atthato upapattibhavoeva. Nahi phalapañcakato añño upapattibhavonāma atthīti. Evaṃ santepi dhammavibhāga rakkhaṇatthaṃ upapattibhavasaddena catutthapañcakaṃ gahitanti yuttaṃ. Dvādasasu ",
      " aṅgesu avijjānāma moho. Soca akusalamūlaṃ. Taṇhānāma lobho. Soca akusala mūlanti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avijjā taṇhāvasena dve mūlānī"
      },
      "ti. Athavā, mūlanti sīsaṃ. Dve vaṭṭasīsānīti attho. Aṭṭhakathāyaṃ pana purimaṃ pañcakadvayaṃ ekaṃ bhavacakkaṃ pacchimaṃ pañcakadvayaṃ ekaṃ bhavacakkanti katvā purimaṃ avijjāmūlaṃ. Tañca diṭṭhicaritānaṃvā apāyagāmīnaṃvā cakkaṃ. Pacchimaṃ taṇhāmūlaṃ. Tañca rāgacaritānaṃvā sugatigāmīnaṃvā cakkanti dassitaṃ. Cakkanti pana yato paṭṭhāya vaṭṭasantānassa ārabbho hoti. Tasmiṃ puna āgateeva cakkaṃnāma siyā. Tasmā idha dutīyena hetuphala yugaḷena saddhiṃ sabbaṃ ekameva cakkanti yuttaṃ."
    ],
    "innerText": "Tesaṃ dvinnaṃpi dvīsu hetupañcakesu saṅgahitattāti. Yathā rutapāḷinayenavā etaṃ vuttanti daṭṭhabbaṃ. Avasesācāti idaṃ jātijarāmaraṇehi saddhiṃ viññāṇādiphalapañcakaṃ sandhāya vuttaṃ. Etthaca yadetaṃ pubbe jātijarāmaraṇaggahaṇena viññāṇādi phala pañcakaṃ gahitaṃ. Taṃ atthato upapattibhavoeva. Nahi phalapañcakato añño upapattibhavonāma atthīti. Evaṃ santepi dhammavibhāga rakkhaṇatthaṃ upapattibhavasaddena catutthapañcakaṃ gahitanti yuttaṃ. Dvādasasu aṅgesu avijjānāma moho. Soca akusalamūlaṃ. Taṇhānāma lobho. Soca akusala mūlanti vuttaṃ avijjā taṇhāvasena dve mūlānīti. Athavā, mūlanti sīsaṃ. Dve vaṭṭasīsānīti attho. Aṭṭhakathāyaṃ pana purimaṃ pañcakadvayaṃ ekaṃ bhavacakkaṃ pacchimaṃ pañcakadvayaṃ ekaṃ bhavacakkanti katvā purimaṃ avijjāmūlaṃ. Tañca diṭṭhicaritānaṃvā apāyagāmīnaṃvā cakkaṃ. Pacchimaṃ taṇhāmūlaṃ. Tañca rāgacaritānaṃvā sugatigāmīnaṃvā cakkanti dassitaṃ. Cakkanti pana yato paṭṭhāya vaṭṭasantānassa ārabbho hoti. Tasmiṃ puna āgateeva cakkaṃnāma siyā. Tasmā idha dutīyena hetuphala yugaḷena saddhiṃ sabbaṃ ekameva cakkanti yuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kasmā panettha āgamanasambhāresu avijjāeva sīsaṃ katvā vuttā. Gamanasambhāresuca taṇhāeva. Nanu ubhayattha ubhayaṃpi sīsaṃ katvā vattabbanti. Vuccate, sukhavedanāsadiso hi taṇhāya āhāronāma natthi. Tasmā vedanaṅgato paraṃ vaṭṭaṅgaṃ ghaṭentena vedanā nurūpātaṇhāeva vattabbā. Na avijjāti gamanasambhāresu tāva avijjāya okāso natthi. Sabbapathamaṃ ārabbhaṭṭhāneca sabbapadhānā avijjāeva vattabbā hoti. Sāca saṅkhāruppādane avirajjhanakaṅgabhūtāti na tesaṃ antare ekassa aṅgassa atthāya kiñci vattabbaṃ atthīti āgamanasambhāresu taṇhāya okāso natthīti. Ayañhi paṭiccasamuppādadesanānāma padhānaṅgapariggaha vasena pavattā. Na labbhamāna sabbadhamma pariggaha vasenāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "Yaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "Yaṃ pana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Pubbantassa avijjāmūlaṃ. Aparantassa taṇhāmūlanti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha pubbantassāti pubbassa hetuphalakoṭṭhāsassa. Aparantassāti pacchimassa hetuphala koṭṭhāsassāti atthoti. Kasmā panetāni dvemūlānināma hontīti āha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesamevaca mūlānaṃ, nirodhena nirujjhatī"
      },
      "ti."
    ],
    "innerText": "Tesamevaca mūlānaṃ, nirodhena nirujjhatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesaṃ samudayena sakalavaṭṭaṃ samudeti. Nirodhenaca nirujjhati. Tasmā tāni dvemūlānināmāti vuttaṃ hoti. Keci pana paṭiloma ",
      " paṭiccasamuppāda dassanametanti vadanti. Paṭiloma paṭicca samuppādonāma avijjānirodhā saṅkhāranirodho saṅkhāranirodhā viññāṇanirodhotiādiko nirodhavāro. Idāni sokādi vacanaṃ na kevalaṃ nissandaphala nidassanatthameva hoti. Athakho jarāmaraṇena saddhiṃ ekaṃ aṅgaṃ hutvā upari vaṭṭamūladhammapaṭipādakānaṃ dukkhadhammānaṃ nidassanatthaṃpi hotīti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jarāmaraṇa mucchāyā"
      },
      "tiādi māha. Tattha mucchāsaddena sokādīnaṃ gahaṇaṃ. Tepi hi sayaṃ āsavasambhūtā hutvā puna āsavuppādāya paccayā hontīti etena tesaṃ jarāmaraṇaṅge gahaṇaṃ siddhaṃ bhavati. Jarāmaraṇamucchāya abhiṇhaso pīḷitānaṃ bālānaṃ āsavā abhiṇhaso samuppajjanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsavānaṃsamuppādāavijjāca pavaḍḍhati"
      },
      ". Āsavasamudayā avijjāsamudayoti hi vuttaṃ. Evañca sati avijjāpaccayā saṅkhārāti puna ābandhameva vaṭṭanti attho. Etthaca –"
    ],
    "innerText": "Tesaṃ samudayena sakalavaṭṭaṃ samudeti. Nirodhenaca nirujjhati. Tasmā tāni dvemūlānināmāti vuttaṃ hoti. Keci pana paṭiloma paṭiccasamuppāda dassanametanti vadanti. Paṭiloma paṭicca samuppādonāma avijjānirodhā saṅkhāranirodho saṅkhāranirodhā viññāṇanirodhotiādiko nirodhavāro. Idāni sokādi vacanaṃ na kevalaṃ nissandaphala nidassanatthameva hoti. Athakho jarāmaraṇena saddhiṃ ekaṃ aṅgaṃ hutvā upari vaṭṭamūladhammapaṭipādakānaṃ dukkhadhammānaṃ nidassanatthaṃpi hotīti dassento jarāmaraṇa mucchāyātiādi māha. Tattha mucchāsaddena sokādīnaṃ gahaṇaṃ. Tepi hi sayaṃ āsavasambhūtā hutvā puna āsavuppādāya paccayā hontīti etena tesaṃ jarāmaraṇaṅge gahaṇaṃ siddhaṃ bhavati. Jarāmaraṇamucchāya abhiṇhaso pīḷitānaṃ bālānaṃ āsavā abhiṇhaso samuppajjanti. Āsavānaṃsamuppādāavijjāca pavaḍḍhati. Āsavasamudayā avijjāsamudayoti hi vuttaṃ. Evañca sati avijjāpaccayā saṅkhārāti puna ābandhameva vaṭṭanti attho. Etthaca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nānā byasanaphuṭṭhassa, sokādīnaṃ pavattito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Avijjā taṇhā vaḍḍhanti, yato vaṭṭaṃ pavattatī tipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vattabbaṃ. Yathāha-katamoca bhikkhave dukkhassa vipāko. Sammohavepakkaṃ vāhaṃ bhikkhave dukkhaṃ vadāmi. Pariyeṭṭhivepakkaṃvāti tattha sammoho avijjā. Pariyeṭṭhi taṇhā. Tadubhayaṃ vipākaṃ etassāti katvājarāmaraṇasokādikaṃ dukkhaṃ sammohavepakkaṃ pariyeṭṭhivepakkantica vuccatīti. Tattha sammohonāma ñātibyasanā dinā phuṭṭhosocati paridevati uratāḷi kandati, sammohaṃ āpajjatīti evaṃ āgato sammoho. Pariyiṭṭhināma yathā jigacchāti pīḷito. Bhojanaṃ pattheti pariyesati pipāsābhipīḷito. Pāṇiyaṃ pattheti pariyesati, evaṃ kenaci dukkhena phuṭṭho sukhaṃ pattheti pariyesatīti evaṃ pavattā pariyiṭṭhitaṇhā. Ettha pana yasmā jarāmaraṇasadisaṃ mahantaṃ visaṭaṃ niyatañca imassa lokassa dukkhaṭṭhānaṃnāma natthi. Dukkhanissaraṇatthañca satthusāsanaṃ. Tasmā ayaṃ paṭiccasamuppādadesanā jarāmaraṇanidānā hoti. Yathāha-kicchaṃ vatāyaṃ loko āpanno jāyatica jiyyatica ",
      " miyyatica cavatica upapajjatica. Athaca panimassaṃ dukkhassa nissaraṇaṃ nappajānāti jarāmaraṇassātiādi. Yesu pana aṅgesu ādito paṭṭhāya ñātesu jarāmaraṇaṃ samūlaṃ khanitvā tato attānaṃ mocetuṃ sakkoti. Tāni dassetuṃ jātiādīni purimāni aṅgāni desitāni. Apica. Ekasmiṃ bhave ṭhatvā āgamanasambhārehica gamanasambhārehica āgatiyāca gatiyāca saddhiṃ attabhāvanibbattiyā dassitāya atīte anāgateca sakalasaṃsāre tasmiṃ tasmiṃ bhave tassa tassa attabhāvassa nibbatti dassitāeva hoti. Sabbānica diṭṭhigatāni nivattitāni. Bhavacakkañca anādimantaṃ hutvā ābandhatiyeva. Tasmā jarāmaraṇavacanenavā sokādivacanenavā avijjaṃ acintetvā vaṭṭapavattassa mahāādīnavarāsidassanameva paccetabbanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Icceva"
      },
      "ntiādi nigamanaṃ. Iccevaṃ avijjāpaccayā saṅkhārātiādinā nayena paṭhapesīti sambandho. Iccevaṃ ābandhaṃ anādikaṃ tebhūmakaṃ vaṭṭantipi yojenti."
    ],
    "innerText": "Vattabbaṃ. Yathāha-katamoca bhikkhave dukkhassa vipāko. Sammohavepakkaṃ vāhaṃ bhikkhave dukkhaṃ vadāmi. Pariyeṭṭhivepakkaṃvāti tattha sammoho avijjā. Pariyeṭṭhi taṇhā. Tadubhayaṃ vipākaṃ etassāti katvājarāmaraṇasokādikaṃ dukkhaṃ sammohavepakkaṃ pariyeṭṭhivepakkantica vuccatīti. Tattha sammohonāma ñātibyasanā dinā phuṭṭhosocati paridevati uratāḷi kandati, sammohaṃ āpajjatīti evaṃ āgato sammoho. Pariyiṭṭhināma yathā jigacchāti pīḷito. Bhojanaṃ pattheti pariyesati pipāsābhipīḷito. Pāṇiyaṃ pattheti pariyesati, evaṃ kenaci dukkhena phuṭṭho sukhaṃ pattheti pariyesatīti evaṃ pavattā pariyiṭṭhitaṇhā. Ettha pana yasmā jarāmaraṇasadisaṃ mahantaṃ visaṭaṃ niyatañca imassa lokassa dukkhaṭṭhānaṃnāma natthi. Dukkhanissaraṇatthañca satthusāsanaṃ. Tasmā ayaṃ paṭiccasamuppādadesanā jarāmaraṇanidānā hoti. Yathāha-kicchaṃ vatāyaṃ loko āpanno jāyatica jiyyatica miyyatica cavatica upapajjatica. Athaca panimassaṃ dukkhassa nissaraṇaṃ nappajānāti jarāmaraṇassātiādi. Yesu pana aṅgesu ādito paṭṭhāya ñātesu jarāmaraṇaṃ samūlaṃ khanitvā tato attānaṃ mocetuṃ sakkoti. Tāni dassetuṃ jātiādīni purimāni aṅgāni desitāni. Apica. Ekasmiṃ bhave ṭhatvā āgamanasambhārehica gamanasambhārehica āgatiyāca gatiyāca saddhiṃ attabhāvanibbattiyā dassitāya atīte anāgateca sakalasaṃsāre tasmiṃ tasmiṃ bhave tassa tassa attabhāvassa nibbatti dassitāeva hoti. Sabbānica diṭṭhigatāni nivattitāni. Bhavacakkañca anādimantaṃ hutvā ābandhatiyeva. Tasmā jarāmaraṇavacanenavā sokādivacanenavā avijjaṃ acintetvā vaṭṭapavattassa mahāādīnavarāsidassanameva paccetabbanti. Iccevantiādi nigamanaṃ. Iccevaṃ avijjāpaccayā saṅkhārātiādinā nayena paṭhapesīti sambandho. Iccevaṃ ābandhaṃ anādikaṃ tebhūmakaṃ vaṭṭantipi yojenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha iccevaṃ ābandhanti jarāmaraṇamucchāyātiādinā vutta nayena punappunaṃ ābandhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anādika"
      },
      "nti kasmā vuttaṃ. Nanu avijjā ādimhi vuttāti. Vuccate, vaṭṭassa ādibhūtattā sā ādimhi vuttā na hoti. Vaṭṭakathāya sīsa bhūtattāeva sā ādimhi vuttā. Evaṃ vuttāya pana tāya vaṭṭassa anādikabhāvopi dassito. Avijjā hi nāma bahiddhā na labbhati. Sattasantāne eva labbhatīti paccakkhatova siddhametaṃ. Tasmā idha atītabhave avijjāya siddhāya tassāadhiṭṭhānabhūto attabhāvopi tasmiṃ bhave sijjhatiyeva. Sijjhanto ca imassaṃ dasanoyaṃ vutta nayena aññāya avijjāya eva sijjhati, na aññathā. Evañca sabhi puna tassapi adhiṭṭhānabhūto attabhāvo sijjhatiyevāti avijjā attabhāvocāti ubhayaṃ petaṃ anavaṭṭhitaṃ anādikameva hotīti. Vaṭṭassa pana tividhassapi padhānapaccayabhūtattā sā vaṭṭakathāya sīsabhūtā hoti. Yadi sā vaṭṭassa ādibhūtā na hoti. Atha tassāpi paccayo vattabboti. Saccaṃ. Tassā pana ",
      " paccaye vuttepi tassa paccayassapi paccayo vattabboti āgacchatiyeva. Evañca sati tassa tassāti niṭṭhānameva napaññā yeyyāti. Aññattha pana vuttoyeva. Yathāha-āsavasamudayā avijjāsamudayoti. Yathācāha-avijjaṃ pāhaṃ bhikkhave sāhāraṃ sanidānaṃ vadāmi. Kocassā āhāro. Pañcanīvaraṇā tissa vacanīyanti. Yathācāha-avijjā paccayo, saṅkhārā paccayuppannā. Ubhayametaṃ paṭicca samuppannanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhapesī"
      },
      "ti paññāpesi desesīti attho. [Paṭiccasamuppādanayo.]"
    ],
    "innerText": "Tattha iccevaṃ ābandhanti jarāmaraṇamucchāyātiādinā vutta nayena punappunaṃ ābandhaṃ. Anādikanti kasmā vuttaṃ. Nanu avijjā ādimhi vuttāti. Vuccate, vaṭṭassa ādibhūtattā sā ādimhi vuttā na hoti. Vaṭṭakathāya sīsa bhūtattāeva sā ādimhi vuttā. Evaṃ vuttāya pana tāya vaṭṭassa anādikabhāvopi dassito. Avijjā hi nāma bahiddhā na labbhati. Sattasantāne eva labbhatīti paccakkhatova siddhametaṃ. Tasmā idha atītabhave avijjāya siddhāya tassāadhiṭṭhānabhūto attabhāvopi tasmiṃ bhave sijjhatiyeva. Sijjhanto ca imassaṃ dasanoyaṃ vutta nayena aññāya avijjāya eva sijjhati, na aññathā. Evañca sabhi puna tassapi adhiṭṭhānabhūto attabhāvo sijjhatiyevāti avijjā attabhāvocāti ubhayaṃ petaṃ anavaṭṭhitaṃ anādikameva hotīti. Vaṭṭassa pana tividhassapi padhānapaccayabhūtattā sā vaṭṭakathāya sīsabhūtā hoti. Yadi sā vaṭṭassa ādibhūtā na hoti. Atha tassāpi paccayo vattabboti. Saccaṃ. Tassā pana paccaye vuttepi tassa paccayassapi paccayo vattabboti āgacchatiyeva. Evañca sati tassa tassāti niṭṭhānameva napaññā yeyyāti. Aññattha pana vuttoyeva. Yathāha-āsavasamudayā avijjāsamudayoti. Yathācāha-avijjaṃ pāhaṃ bhikkhave sāhāraṃ sanidānaṃ vadāmi. Kocassā āhāro. Pañcanīvaraṇā tissa vacanīyanti. Yathācāha-avijjā paccayo, saṅkhārā paccayuppannā. Ubhayametaṃ paṭicca samuppannanti. Paṭhapesīti paññāpesi desesīti attho. [Paṭiccasamuppādanayo.]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "167"
      },
      ". Idāni paṭṭhānanayaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetupaccayo"
      },
      "tiādi āraddhaṃ. Tatthahetuca so paccayocāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetupaccayo,"
      },
      " hetu hutvā paccayo hetubhāvena paccayoti vuttaṃ hoti. Tattha kenaṭṭhena hetūti mūlaṭṭhena, koca mūlaṭṭhoti. Rukkhānaṃ rukkhamūlassa viya bhūmiyaṃ sahajātadhammānaṃ ārammaṇesu suppatiṭṭhi tabhāvasādhanaṭṭho mūlaṭṭhonāma. Sahajātadhammānaṃ kusalādi bhāvasādhanaṭṭho mūlaṭṭhonāmātipi vadanti. Yaṃ panettha vattabbaṃ. Taṃ heṭṭhā vuttameva. Saddatthato pana hinonti vuddhiviruḷhivepullapattivasena suṭṭhu patiṭṭhahanti sahajātadhammā ettha etenavā ārammaṇe daḷhanipātinā thāmabalasampannenāti hetu. Paccaya saddo pana upakārakaṭṭho. Upakārakotica sayaṃ yādisena sabhāvena upalabbhamāne anuppannāvā dhammā uppajjanti. Uppannāvā tiṭṭhanti ṭhitāvā uparuparivuddhiviruḷhiyā paccayattaṃ upagacchanti. Tādi senasabhāvena upaladdhiyeva. Nahi sabhāvadhammesu īhāvā byāpārovā upalabbhati. Yena kattāvā kāretāvā upalabbheyyāti. Tathā upaladdhiyaṃ pana sati anurūpānaṃ paccayuppannadhammānaṃ anuppannānaṃvā uppajjanato uppannānaṃvā ṭhitibhāvapattito ṭhitānaṃ vā uparuparivuddhiviruḷhiyā paccayattupagamanato suṭṭhu karānto viya sādhento viya hotīti katvā upakārako tveva vuccatīti. Iti ārammaṇe thirabhāvavuddhi viruḷhibhāvasādhana saṅkhātena mūlabhāvena upakārakā chahetudhammā hetupaccayo nāma."
    ],
    "innerText": "167. Idāni paṭṭhānanayaṃ dassetuṃ hetupaccayotiādi āraddhaṃ. Tatthahetuca so paccayocāti hetupaccayo, hetu hutvā paccayo hetubhāvena paccayoti vuttaṃ hoti. Tattha kenaṭṭhena hetūti mūlaṭṭhena, koca mūlaṭṭhoti. Rukkhānaṃ rukkhamūlassa viya bhūmiyaṃ sahajātadhammānaṃ ārammaṇesu suppatiṭṭhi tabhāvasādhanaṭṭho mūlaṭṭhonāma. Sahajātadhammānaṃ kusalādi bhāvasādhanaṭṭho mūlaṭṭhonāmātipi vadanti. Yaṃ panettha vattabbaṃ. Taṃ heṭṭhā vuttameva. Saddatthato pana hinonti vuddhiviruḷhivepullapattivasena suṭṭhu patiṭṭhahanti sahajātadhammā ettha etenavā ārammaṇe daḷhanipātinā thāmabalasampannenāti hetu. Paccaya saddo pana upakārakaṭṭho. Upakārakotica sayaṃ yādisena sabhāvena upalabbhamāne anuppannāvā dhammā uppajjanti. Uppannāvā tiṭṭhanti ṭhitāvā uparuparivuddhiviruḷhiyā paccayattaṃ upagacchanti. Tādi senasabhāvena upaladdhiyeva. Nahi sabhāvadhammesu īhāvā byāpārovā upalabbhati. Yena kattāvā kāretāvā upalabbheyyāti. Tathā upaladdhiyaṃ pana sati anurūpānaṃ paccayuppannadhammānaṃ anuppannānaṃvā uppajjanato uppannānaṃvā ṭhitibhāvapattito ṭhitānaṃ vā uparuparivuddhiviruḷhiyā paccayattupagamanato suṭṭhu karānto viya sādhento viya hotīti katvā upakārako tveva vuccatīti. Iti ārammaṇe thirabhāvavuddhi viruḷhibhāvasādhana saṅkhātena mūlabhāvena upakārakā chahetudhammā hetupaccayo nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Āramanti ",
      " cittacetasikā dhammā suṭṭhu ratiṃ anubhavantā viya ajjholambamānā pavattanti etthāti ārammaṇaṃ. Ārammaṇabhāneva upakārakā chaḷārammaṇadhammā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇapaccayo"
      },
      ". Adhipati saddattho heṭṭhā vuttoyeva. Adhipati bhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhipatipaccayo"
      },
      ". So duvidho ārammaṇādhipati sahājātādhipativasena. Ārammaṇadhammāpi hi keci garukatā attano ārammaṇikadhamme sāmino viya dāse attano vasevattayamānā attani niccaṃ ninnapoṇapabbhāreeva karontīti. Natthi antaraṃ etassāti anantaro, anantarabhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantarapaccayo"
      },
      ". Suṭṭhu anantarabhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samanantarapaccayo"
      },
      ". Imesaṃ dvinnaṃ paccayānaṃ dhammato viseso natthi. Atthato pana purimacitte niruddhepi pacchā santānaṃ ucchijjituṃ adatvā santānānubandhavasena sārammaṇadhamma bhāvena attasadisassa dhammantarassa uppādanaṃ anantarapaccayatā. Dhammantare uppādiyamānepi yaṃkiñci dhammaṃ anuppādetvā paṭisandhādīnaṃ kiccaṭṭhānānaṃ paṭipāṭiyā cittaniyāmaṃ nāma sādhetvā anurūpasseva dhammantarassa uppādanaṃ samanantarapaccayatāti. Evañhi sati nirodhā vuṭṭhahantassa asaññasattā cavantassaca purimapacchimabhāgapavattānaṃ cittuppādānaṃpi anantaratā samanantaratāca upapannā hotīti. Nahi abhāva bhūto antare kālo tesaṃ antaraṃ karotināma. Naca aññasantānabhūto antare rūpadhammo. Aññañhi rūpasantānaṃ, aññaṃ arūpasantānaṃ. Aṭṭhakathāyaṃ pana kālānantaratā samanantarapaccayoti vādaṃ paṭikkhipitvā saṇṭhānābhāvato suṭṭhu anantarāti samanantarāti vuttaṃ. Etena yathāsaṇṭhānavantānaṃ rūpadhammānaṃ anantaratānāma majjhe paricchedasahitāyeva hoti. Na tathā saṇṭhānarahitānaṃ arūpadhammānaṃ. Tasmā purimapacchimānaṃ tesaṃ ekībhūtānaṃ viya pavattisamanantaratānāma. Tathā pavattana samatthatā samanantarapaccayatāti dasseti."
    ],
    "innerText": "Āramanti cittacetasikā dhammā suṭṭhu ratiṃ anubhavantā viya ajjholambamānā pavattanti etthāti ārammaṇaṃ. Ārammaṇabhāneva upakārakā chaḷārammaṇadhammā ārammaṇapaccayo. Adhipati saddattho heṭṭhā vuttoyeva. Adhipati bhāvena upakārako dhammo adhipatipaccayo. So duvidho ārammaṇādhipati sahājātādhipativasena. Ārammaṇadhammāpi hi keci garukatā attano ārammaṇikadhamme sāmino viya dāse attano vasevattayamānā attani niccaṃ ninnapoṇapabbhāreeva karontīti. Natthi antaraṃ etassāti anantaro, anantarabhāvena upakārako dhammo anantarapaccayo. Suṭṭhu anantarabhāvena upakārako dhammo samanantarapaccayo. Imesaṃ dvinnaṃ paccayānaṃ dhammato viseso natthi. Atthato pana purimacitte niruddhepi pacchā santānaṃ ucchijjituṃ adatvā santānānubandhavasena sārammaṇadhamma bhāvena attasadisassa dhammantarassa uppādanaṃ anantarapaccayatā. Dhammantare uppādiyamānepi yaṃkiñci dhammaṃ anuppādetvā paṭisandhādīnaṃ kiccaṭṭhānānaṃ paṭipāṭiyā cittaniyāmaṃ nāma sādhetvā anurūpasseva dhammantarassa uppādanaṃ samanantarapaccayatāti. Evañhi sati nirodhā vuṭṭhahantassa asaññasattā cavantassaca purimapacchimabhāgapavattānaṃ cittuppādānaṃpi anantaratā samanantaratāca upapannā hotīti. Nahi abhāva bhūto antare kālo tesaṃ antaraṃ karotināma. Naca aññasantānabhūto antare rūpadhammo. Aññañhi rūpasantānaṃ, aññaṃ arūpasantānaṃ. Aṭṭhakathāyaṃ pana kālānantaratā samanantarapaccayoti vādaṃ paṭikkhipitvā saṇṭhānābhāvato suṭṭhu anantarāti samanantarāti vuttaṃ. Etena yathāsaṇṭhānavantānaṃ rūpadhammānaṃ anantaratānāma majjhe paricchedasahitāyeva hoti. Na tathā saṇṭhānarahitānaṃ arūpadhammānaṃ. Tasmā purimapacchimānaṃ tesaṃ ekībhūtānaṃ viya pavattisamanantaratānāma. Tathā pavattana samatthatā samanantarapaccayatāti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ye pana dhammā attani jāte eva jāyanti, no ajāte. Attanā sahevaca jāyanti, no pure pacchāca, tesaṃ jātatthāya viya ",
      " sayaṃ tehi saha jātabhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahajātapaccayo"
      },
      ". Pakāsassa padīpo viya. Padīpajālañhi uppajjamānaṃ pakāsasaṅkhātena ālokena saheva uppajjatīti. Aññamaññaṃ upatthambhantaṃ tidaṇḍaṃ viya aññamaññaṃ upatthambhanavasena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññamaññapaccayo"
      },
      ". Evañca sati imassa paccayassa purimena saha viseso pākaṭo hoti. Nahi saha jātasaddo evarūpaṃ aññamaññopatthambhanaṃ bodhetīti. Nissayanti etthāti nissayo. Nissayabhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissayapaccayo"
      },
      ". So pana sahajātanissayo vatthupurejāta nissayoti duvidho hoti. Tattha sahajātova samāno paṭakoṭṭhako viya cittakammānaṃ patiṭṭhābhāvena upakārako dhammo sahajātanissayo. Pathavī viya tiṇarukkhādīnaṃ pure jāto hutvā adhiṭṭhānabhāvena upakārako vatthupurejāta nissayo. Balavataro pana nissayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upanissayo"
      },
      ". Yathā hi sālibhattassa uppattiyā sūdovā ukkhalivākaṭṭhaṃvā aggivānissayo eva hoti, na upanissayo. Sālikhettavuṭṭhidhārā eva pana upanissayo, na hi tāsuasati bhattuppattiyā sūdādīnaṃpi thāmonāma atthīti. Tathā yahiṃ paccaye asati nissayadhammāpi natthi. Kuto nissitadhammā. So paccayo nissayatopi balavataraṭṭhena upanissayoti vuccatīti."
    ],
    "innerText": "Ye pana dhammā attani jāte eva jāyanti, no ajāte. Attanā sahevaca jāyanti, no pure pacchāca, tesaṃ jātatthāya viya sayaṃ tehi saha jātabhāvena upakārako dhammo sahajātapaccayo. Pakāsassa padīpo viya. Padīpajālañhi uppajjamānaṃ pakāsasaṅkhātena ālokena saheva uppajjatīti. Aññamaññaṃ upatthambhantaṃ tidaṇḍaṃ viya aññamaññaṃ upatthambhanavasena upakārako dhammo aññamaññapaccayo. Evañca sati imassa paccayassa purimena saha viseso pākaṭo hoti. Nahi saha jātasaddo evarūpaṃ aññamaññopatthambhanaṃ bodhetīti. Nissayanti etthāti nissayo. Nissayabhāvena upakārako dhammo nissayapaccayo. So pana sahajātanissayo vatthupurejāta nissayoti duvidho hoti. Tattha sahajātova samāno paṭakoṭṭhako viya cittakammānaṃ patiṭṭhābhāvena upakārako dhammo sahajātanissayo. Pathavī viya tiṇarukkhādīnaṃ pure jāto hutvā adhiṭṭhānabhāvena upakārako vatthupurejāta nissayo. Balavataro pana nissayo upanissayo. Yathā hi sālibhattassa uppattiyā sūdovā ukkhalivākaṭṭhaṃvā aggivānissayo eva hoti, na upanissayo. Sālikhettavuṭṭhidhārā eva pana upanissayo, na hi tāsuasati bhattuppattiyā sūdādīnaṃpi thāmonāma atthīti. Tathā yahiṃ paccaye asati nissayadhammāpi natthi. Kuto nissitadhammā. So paccayo nissayatopi balavataraṭṭhena upanissayoti vuccatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So pana ārammaṇūpanissayo anantarūpanissayo pakatūpanissayoti tividho hoti. Tattha garukatā ārammaṇa dhammā garukatattāeva adhipatibhūtā balava nissayabhūtāca honti. Anantarapaccayadhammāca tehi vinā cittasantānapavattiyā eva abhāvato balavanissayāeva honti. Pakatūpanissayoti ettha pana pakato upanissayoti pakatūpanissayo. Pakatotica yathā kate sati anurūpe kāle tasmiṃsantāne ekantena paccayuppannadhammā pātubhavanti, tathā suṭṭhu katoti attho. Karaṇañcettha saddhā sīlaṃ sutaṃ cāgo paññātica rāgo doso moho māno diṭṭhi patthanātica vuttānaṃ dhammānaṃ attano ",
      " santāne pubbabhāge vuttappakārena suṭṭhu uppādanaṃ. Kāyikaṃ sukhaṃ kāyikaṃ dukkhaṃ puggalo utu bhojanaṃ senāsananti evaṃ vuttānaṃ dhammānaṃ suṭṭhu upasevanañca veditabbaṃ."
    ],
    "innerText": "So pana ārammaṇūpanissayo anantarūpanissayo pakatūpanissayoti tividho hoti. Tattha garukatā ārammaṇa dhammā garukatattāeva adhipatibhūtā balava nissayabhūtāca honti. Anantarapaccayadhammāca tehi vinā cittasantānapavattiyā eva abhāvato balavanissayāeva honti. Pakatūpanissayoti ettha pana pakato upanissayoti pakatūpanissayo. Pakatotica yathā kate sati anurūpe kāle tasmiṃsantāne ekantena paccayuppannadhammā pātubhavanti, tathā suṭṭhu katoti attho. Karaṇañcettha saddhā sīlaṃ sutaṃ cāgo paññātica rāgo doso moho māno diṭṭhi patthanātica vuttānaṃ dhammānaṃ attano santāne pubbabhāge vuttappakārena suṭṭhu uppādanaṃ. Kāyikaṃ sukhaṃ kāyikaṃ dukkhaṃ puggalo utu bhojanaṃ senāsananti evaṃ vuttānaṃ dhammānaṃ suṭṭhu upasevanañca veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puretaraṃ uppajjitvā vattamānabhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purejātapaccayo"
      },
      ". So duvidho ārammaṇapurejāta nissaya purejāta vasena. Nissayārammaṇadhammā eva hi keci purejāta tāmattavisiṭṭhā purejātapaccayoti vuttāti. Ācariyānandattherena pana nissayārammaṇākārādīhi visiṭṭhā purejātākārena upakārakatā purejātapaccayatāti vuttaṃ. Evaṃ santepi pure jātatāvisiṭṭhehi nissayārammaṇasattivisesehi añño visuṃ purejātasattivisesonāma nadissatiyeva. Pure ropetvā jātānaṃ rukkhapotakānaṃ viya pacchā āsiñciyamānaṃ udakaṃ pure jātānaṃ catusamuṭṭhānikarūpadhammānaṃ vuddhaviruḷhabhāvañca pacchāpi attanā sadisassa rūpasantānassa pavattiyā paccayabhāvañca pāpetvā upatthambhanavasena upakārako pacchājāto arūpadhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pacchā jātapaccayo"
      },
      ". Aṭṭhakathāyaṃ pana gijjhapotakasarīrānaṃ āhārāsā cetanāviyāti vuttaṃ. Mūlaṭīkāyañca etena manosañce tanāhāravasena pavattamānehi arūpadhammehi rūpakāyassa upatthambhita bhāvaṃ dasseti, teneva āhārāsā viyāti avatvā cetanāgahaṇaṃ karotīti vuttaṃ. Sā pana pacchājātā sasampayuttā āhārāsā cetanā purejātānaṃ tesaṃ gijjhasarīrarūpānaṃ cirakālaṃ kabaḷīkārāhārena vināpi amilāta bhāvaṃ uparūparica vuddhaviruḷharūpasantānuppattiyā paccayabhāvaṃ pāpetvā upatthambhatiyeva. Yasmā supākaṭena pacchājātapaccayeka desena sakalassa pacchājātapaccayassa sādhanatthāya ayaṃ upamā idha vuttā viya dissati. Cetanā gahaṇañca pacchājāta paccayaṃ patvāpi cetanāeva padhānā jātāti dassanatthaṃ gahitanti na na sakkā vattuṃ. Evañhi sati pacchājātassa atthassa pacchā jātāya eva upamāya sādhanaṃ upapannaṃ hotīti. Yathāvutta ṭīkāpāṭhepi ayamattho labbhatiyeva."
    ],
    "innerText": "Puretaraṃ uppajjitvā vattamānabhāvena upakārako dhammo purejātapaccayo. So duvidho ārammaṇapurejāta nissaya purejāta vasena. Nissayārammaṇadhammā eva hi keci purejāta tāmattavisiṭṭhā purejātapaccayoti vuttāti. Ācariyānandattherena pana nissayārammaṇākārādīhi visiṭṭhā purejātākārena upakārakatā purejātapaccayatāti vuttaṃ. Evaṃ santepi pure jātatāvisiṭṭhehi nissayārammaṇasattivisesehi añño visuṃ purejātasattivisesonāma nadissatiyeva. Pure ropetvā jātānaṃ rukkhapotakānaṃ viya pacchā āsiñciyamānaṃ udakaṃ pure jātānaṃ catusamuṭṭhānikarūpadhammānaṃ vuddhaviruḷhabhāvañca pacchāpi attanā sadisassa rūpasantānassa pavattiyā paccayabhāvañca pāpetvā upatthambhanavasena upakārako pacchājāto arūpadhammo pacchā jātapaccayo. Aṭṭhakathāyaṃ pana gijjhapotakasarīrānaṃ āhārāsā cetanāviyāti vuttaṃ. Mūlaṭīkāyañca etena manosañce tanāhāravasena pavattamānehi arūpadhammehi rūpakāyassa upatthambhita bhāvaṃ dasseti, teneva āhārāsā viyāti avatvā cetanāgahaṇaṃ karotīti vuttaṃ. Sā pana pacchājātā sasampayuttā āhārāsā cetanā purejātānaṃ tesaṃ gijjhasarīrarūpānaṃ cirakālaṃ kabaḷīkārāhārena vināpi amilāta bhāvaṃ uparūparica vuddhaviruḷharūpasantānuppattiyā paccayabhāvaṃ pāpetvā upatthambhatiyeva. Yasmā supākaṭena pacchājātapaccayeka desena sakalassa pacchājātapaccayassa sādhanatthāya ayaṃ upamā idha vuttā viya dissati. Cetanā gahaṇañca pacchājāta paccayaṃ patvāpi cetanāeva padhānā jātāti dassanatthaṃ gahitanti na na sakkā vattuṃ. Evañhi sati pacchājātassa atthassa pacchā jātāya eva upamāya sādhanaṃ upapannaṃ hotīti. Yathāvutta ṭīkāpāṭhepi ayamattho labbhatiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Āsevanti ",
      " taṃ suṭṭhu bhajanti aparāparaṃ uppajjamānā dhammā suṭṭhu sevamānā viya bhajamānā viya tassa purimassa sabbapāripūraṃ ākāraṃ gahetvā eva punappunaṃ pavattantīti āsevanaṃ. Āsevetivā te dhamme attano parivāsaṃ suṭṭhu gāhāpeti. Vaḍḍhetītivā āsevanaṃ. Apica kusalādibhāvena attanā sadisassa payogena karaṇīyassa anantaradhammassa punappunaṃ karaṇaṃ pavattanaṃ attasadisassavā attasadisabhāvāpādanaṃ vāsanaṃ āsevanaṭṭhoti mūlaṭīkāyaṃ vuttaṃ. Tattha payogena karaṇīyassāti etena āvajjanadvayañca sabbavipākadhammeca nivatteti. Nahi āvajjana dvayassa dvattikkhattuṃ pavattamānassapi vaḍḍhetuṃvā hāpetuṃvā payogena karaṇīyatānāma atthi paridubbalattā. Vipākesuca ariyaphalāni parikammapayogena karaṇīyānipi maggacetanānubhāvena vinā kevalena tena payogeneva sādhetabbāni na honti. Kevalaṃ kammavegena santāne pātitesu lokiyavipākesu vattabbameva natthīti. Punappunaṃ karaṇaṃ pavattananti uparupari paguṇa balavabhāvāpādanena saha pavattanaṃ sandhāya vuttaṃ. Evañhi sati pariyattidhamma vijjāsippuggahaṇesu purimābhiyogo viya āsevanaṭṭhena anantare pavattānaṃ sajātiyānaṃ dhammānaṃ paguṇabalavabhāvāya upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āsevanapaccayo"
      },
      " nāmāti siddhaṃ hotīti."
    ],
    "innerText": "Āsevanti taṃ suṭṭhu bhajanti aparāparaṃ uppajjamānā dhammā suṭṭhu sevamānā viya bhajamānā viya tassa purimassa sabbapāripūraṃ ākāraṃ gahetvā eva punappunaṃ pavattantīti āsevanaṃ. Āsevetivā te dhamme attano parivāsaṃ suṭṭhu gāhāpeti. Vaḍḍhetītivā āsevanaṃ. Apica kusalādibhāvena attanā sadisassa payogena karaṇīyassa anantaradhammassa punappunaṃ karaṇaṃ pavattanaṃ attasadisassavā attasadisabhāvāpādanaṃ vāsanaṃ āsevanaṭṭhoti mūlaṭīkāyaṃ vuttaṃ. Tattha payogena karaṇīyassāti etena āvajjanadvayañca sabbavipākadhammeca nivatteti. Nahi āvajjana dvayassa dvattikkhattuṃ pavattamānassapi vaḍḍhetuṃvā hāpetuṃvā payogena karaṇīyatānāma atthi paridubbalattā. Vipākesuca ariyaphalāni parikammapayogena karaṇīyānipi maggacetanānubhāvena vinā kevalena tena payogeneva sādhetabbāni na honti. Kevalaṃ kammavegena santāne pātitesu lokiyavipākesu vattabbameva natthīti. Punappunaṃ karaṇaṃ pavattananti uparupari paguṇa balavabhāvāpādanena saha pavattanaṃ sandhāya vuttaṃ. Evañhi sati pariyattidhamma vijjāsippuggahaṇesu purimābhiyogo viya āsevanaṭṭhena anantare pavattānaṃ sajātiyānaṃ dhammānaṃ paguṇabalavabhāvāya upakārako dhammo āsevanapaccayo nāmāti siddhaṃ hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kāyaṅgavācaṅgacittaṅgābhisaṅkharaṇabhūtena cittappayogasaṅkhāte na kiriyābhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammapaccayo"
      },
      ". So duvidho sahajātanānākkhaṇikavasena. Tattha jeṭṭhasissa mahā vaḍḍhakiādayo viya sakiccaparakiccasādhanavasena pavattā sabbāpi sahajātacetanā sahajātapaccayo. Yathā pana itthipurisānaṃ sakiṃ sannipātappayogo kāmasukhānubhavanakiccañca kālantare puttapātubhāvatthāyavatthumhi bījanidhāna kiccañca sampādeti. Evamevaṃ yathāvuttābhisaṅkharaṇakiccañca tadabhisaṅkharaṇavegajanitaṃ kālantare vipākakaṭattārūpānaṃ pātubhāvatthāya santāne kiriyā visesanidhāna kiccañca sampādetvā niruddhā kusalākusala cetanā nānākkhaṇikakammapaccayonāma. ",
      " Vipaccanamattabhāvena upakārako dhammo vipākapaccayo. Vipaccana bhāvoca nāma loke sabbesaṃ pupphaphalādīnaṃ suṭṭhu vipakkabhāvaṃ pattakāle sabbākārena mandabhāvo hoti. Evaṃ nirussāhasanta bhāvasaṅkhākena mandamandākārena santāne pātubhāvo. Tatoyevaca vipākānaṃ pavatti avibhūtā hoti. Sabbarattiṃ niddāyantassa purimabhavasiddhe kammādi ārammaṇe pavattānipi tāni vuṭṭhitakāle kiñcijānanacitta pavattiyā paccayā nahontīti. Pañcaviññāṇādīni pana pacchājānanacitta pavattiyā paccayā hontānipi vatthārammaṇa ghaṭṭanānubhāva balena saheva honti. Na tesaṃ ussāhabyāpāramatta vasenāti daṭṭhabbaṃ."
    ],
    "innerText": "Kāyaṅgavācaṅgacittaṅgābhisaṅkharaṇabhūtena cittappayogasaṅkhāte na kiriyābhāvena upakārako dhammo kammapaccayo. So duvidho sahajātanānākkhaṇikavasena. Tattha jeṭṭhasissa mahā vaḍḍhakiādayo viya sakiccaparakiccasādhanavasena pavattā sabbāpi sahajātacetanā sahajātapaccayo. Yathā pana itthipurisānaṃ sakiṃ sannipātappayogo kāmasukhānubhavanakiccañca kālantare puttapātubhāvatthāyavatthumhi bījanidhāna kiccañca sampādeti. Evamevaṃ yathāvuttābhisaṅkharaṇakiccañca tadabhisaṅkharaṇavegajanitaṃ kālantare vipākakaṭattārūpānaṃ pātubhāvatthāya santāne kiriyā visesanidhāna kiccañca sampādetvā niruddhā kusalākusala cetanā nānākkhaṇikakammapaccayonāma. Vipaccanamattabhāvena upakārako dhammo vipākapaccayo. Vipaccana bhāvoca nāma loke sabbesaṃ pupphaphalādīnaṃ suṭṭhu vipakkabhāvaṃ pattakāle sabbākārena mandabhāvo hoti. Evaṃ nirussāhasanta bhāvasaṅkhākena mandamandākārena santāne pātubhāvo. Tatoyevaca vipākānaṃ pavatti avibhūtā hoti. Sabbarattiṃ niddāyantassa purimabhavasiddhe kammādi ārammaṇe pavattānipi tāni vuṭṭhitakāle kiñcijānanacitta pavattiyā paccayā nahontīti. Pañcaviññāṇādīni pana pacchājānanacitta pavattiyā paccayā hontānipi vatthārammaṇa ghaṭṭanānubhāva balena saheva honti. Na tesaṃ ussāhabyāpāramatta vasenāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Arūpino tayo āhārā sahajātadhammānaṃ jananaṭṭhena upatthambhanaṭṭhenaca, kabaḷīkārāhāro pana imassa catusamuṭṭhāni kassa kāyassa upatthambhanaṭṭheneva upakārakatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āhārapaccayo"
      },
      ". Apica, āhāraṭṭhonāma upatthambhanappadhāno hoti. Teneva hi pāḷiyaṃ kabaḷīkāro āhāro āhārasamuṭṭhānassa rūpassa āhārapaccayena paccayoti avatvā imassa kāyassa āhārapaccayena paccayotveva vuttaṃ. Tasmā arūpāhārānaṃpi āhāraṭṭho upatthambhanavaseneva veditabbo. Janayantāpi hi āhārā attanā janitānañca tadaññesañcasantānaṭṭhitiyā paccayabhāvatthāya upatthambhanena saheva janentīti."
    ],
    "innerText": "Arūpino tayo āhārā sahajātadhammānaṃ jananaṭṭhena upatthambhanaṭṭhenaca, kabaḷīkārāhāro pana imassa catusamuṭṭhāni kassa kāyassa upatthambhanaṭṭheneva upakārakatā āhārapaccayo. Apica, āhāraṭṭhonāma upatthambhanappadhāno hoti. Teneva hi pāḷiyaṃ kabaḷīkāro āhāro āhārasamuṭṭhānassa rūpassa āhārapaccayena paccayoti avatvā imassa kāyassa āhārapaccayena paccayotveva vuttaṃ. Tasmā arūpāhārānaṃpi āhāraṭṭho upatthambhanavaseneva veditabbo. Janayantāpi hi āhārā attanā janitānañca tadaññesañcasantānaṭṭhitiyā paccayabhāvatthāya upatthambhanena saheva janentīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Issariyaṭṭhena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "indriyapaccayo"
      },
      ". So tividho sahajātādivasena. Tattha sahajātadhammānaṃ attano attano kiccesu issarabhūtā arūpindriyadhammā sahajātindriyapaccayo. Pacchā jātānaṃ pañcaviññāṇa dhammānaṃ dassanādi kiccesu issarabhūtā pure jātā pañcapasādindriyadhammā pure jātindriyapaccayo. Sahajātānaṃ kaṭattārūpānaṃ ciratarapavattiyaṃ issarabhūtaṃ rūpajīvitaṃ rūpajīvitindriyapaccayo. Kasmā panettha bhāvindriyadvayaṃ idha na gahitanti. Vuccate, yassa janakattaṃvā upatthambhakattaṃvā anupālakattaṃvā atthi. So paccayadhammonāma. Bhāvadvayassa ",
      " pana sahajāta dhammānaṃ atthāya etaṃ tayaṃpi natthi. Kevalaṃ pana taṃsahite santāne kammādīhi attano attano paccayehi pavattamānānaṃ catusamuṭṭhānikadhammānaṃ itthākārādivaseneva yo pavattiniyamo atthi, so bhāvarūpā nubhāvena siddho. Tasmā tesaṃ dhammānaṃ tādise niyāmakicce issarattāyeva dvayaṃ indriyaṃnāma hoti. Na indriyapaccayatte nāti taṃ idha nagahitanti daṭṭhabbaṃ. Ārammaṇaṃ upagantvā tasmiṃ bhusaṃ daḷhaṃ nipatitvā viya jhāyanaṭṭhena olokanaṭṭhena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānapaccayo"
      },
      ". Duggati sugati nibbāna sampāpakaṭṭhena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "maggapaccayo"
      },
      ". Etthaca yenayena sammādassanādinā lakkhaṇavisesena sampannattā kusalabhūtā sammādiṭṭhādayo sugati nibbāna sampāpakaṭṭhena maggapaccayānāma honti. Abyākatabhūtānaṃpi tesaṃ so so lakkhaṇaviseso atthiyevāti tesampi tenevaṭṭhena maggapaccayatā vuttāti daṭṭhabbā. Satipi maggaṅgānaṃ taṃtaṃ sampāpakaṭṭhenaca upakārakatte taṃsamuṭṭhitānaṃ rūpadhammānaṃ so attho na pāpuṇāti. Tesaṃ pana maggapaccayadhammehi samuṭṭhitattāyeva maggapaccayuppannatā paccetabbā. Esanayo hetukammindriyajhāna paccayesupīti."
    ],
    "innerText": "Issariyaṭṭhena upakārako dhammo indriyapaccayo. So tividho sahajātādivasena. Tattha sahajātadhammānaṃ attano attano kiccesu issarabhūtā arūpindriyadhammā sahajātindriyapaccayo. Pacchā jātānaṃ pañcaviññāṇa dhammānaṃ dassanādi kiccesu issarabhūtā pure jātā pañcapasādindriyadhammā pure jātindriyapaccayo. Sahajātānaṃ kaṭattārūpānaṃ ciratarapavattiyaṃ issarabhūtaṃ rūpajīvitaṃ rūpajīvitindriyapaccayo. Kasmā panettha bhāvindriyadvayaṃ idha na gahitanti. Vuccate, yassa janakattaṃvā upatthambhakattaṃvā anupālakattaṃvā atthi. So paccayadhammonāma. Bhāvadvayassa pana sahajāta dhammānaṃ atthāya etaṃ tayaṃpi natthi. Kevalaṃ pana taṃsahite santāne kammādīhi attano attano paccayehi pavattamānānaṃ catusamuṭṭhānikadhammānaṃ itthākārādivaseneva yo pavattiniyamo atthi, so bhāvarūpā nubhāvena siddho. Tasmā tesaṃ dhammānaṃ tādise niyāmakicce issarattāyeva dvayaṃ indriyaṃnāma hoti. Na indriyapaccayatte nāti taṃ idha nagahitanti daṭṭhabbaṃ. Ārammaṇaṃ upagantvā tasmiṃ bhusaṃ daḷhaṃ nipatitvā viya jhāyanaṭṭhena olokanaṭṭhena upakārako dhammo jhānapaccayo. Duggati sugati nibbāna sampāpakaṭṭhena upakārako dhammo maggapaccayo. Etthaca yenayena sammādassanādinā lakkhaṇavisesena sampannattā kusalabhūtā sammādiṭṭhādayo sugati nibbāna sampāpakaṭṭhena maggapaccayānāma honti. Abyākatabhūtānaṃpi tesaṃ so so lakkhaṇaviseso atthiyevāti tesampi tenevaṭṭhena maggapaccayatā vuttāti daṭṭhabbā. Satipi maggaṅgānaṃ taṃtaṃ sampāpakaṭṭhenaca upakārakatte taṃsamuṭṭhitānaṃ rūpadhammānaṃ so attho na pāpuṇāti. Tesaṃ pana maggapaccayadhammehi samuṭṭhitattāyeva maggapaccayuppannatā paccetabbā. Esanayo hetukammindriyajhāna paccayesupīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekuppādatādīhi pakārehi samaṃ ekībhūto viya hutvā aññamaññayuttabhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampayuttapaccayo"
      },
      ". Samānepi sahajātabhāvena nissaya nissita bhāvenaca yuttabhāve ekuppādatādikassa sampayogalakkhaṇassa virahato vippayuttabhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vippayuttapaccayo"
      },
      ". Yattha sampayuttā saṅkā sambhavati, tattheva tadāsaṅkā vigamanatthaṃ ayaṃ vippayuttapaccayonāma vuttoti tadāsaṅkhā rahitesu ārammaṇānantarādīsu vippayuttapaccayapasaṅgo natthīti veditabbo. Heṭṭhāvuttappakāresu eva paccayadhammesu yo yo atthitā saṅkhātena khaṇapaccuppanna samaṅgibhāvena tādisasseva khaṇapaccuppanna samaṅgino dhammassa sahajātādivasena upakārako so so ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthipaccayo"
      },
      ". Yasmiṃ vijjāmāne sati añño uppajjituṃ okāsaṃ ",
      " nalabhati. So tassa aññassa okāsadāna saṅkhātena sayaṃ antarahitabhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "natthipaccayo"
      },
      ". Ayaṃpi visuṃ sattiviseso na hoti. Teneva cittena gacchati nisīdati tiṭṭhatītiādinā pacchimacitte ṭhitānaṃpi purimacittaṃ vattatiyevāti lokassa abhimāno hoti. Tasmā yattha atthitāsaṅkā sambhavati. Tattha tadāsaṅkā nivattanatthaṃ ayaṃ paccayo vuttoti veditabbo."
    ],
    "innerText": "Ekuppādatādīhi pakārehi samaṃ ekībhūto viya hutvā aññamaññayuttabhāvena upakārako dhammo sampayuttapaccayo. Samānepi sahajātabhāvena nissaya nissita bhāvenaca yuttabhāve ekuppādatādikassa sampayogalakkhaṇassa virahato vippayuttabhāvena upakārako dhammo vippayuttapaccayo. Yattha sampayuttā saṅkā sambhavati, tattheva tadāsaṅkā vigamanatthaṃ ayaṃ vippayuttapaccayonāma vuttoti tadāsaṅkhā rahitesu ārammaṇānantarādīsu vippayuttapaccayapasaṅgo natthīti veditabbo. Heṭṭhāvuttappakāresu eva paccayadhammesu yo yo atthitā saṅkhātena khaṇapaccuppanna samaṅgibhāvena tādisasseva khaṇapaccuppanna samaṅgino dhammassa sahajātādivasena upakārako so so atthipaccayo. Yasmiṃ vijjāmāne sati añño uppajjituṃ okāsaṃ nalabhati. So tassa aññassa okāsadāna saṅkhātena sayaṃ antarahitabhāvena upakārako dhammo natthipaccayo. Ayaṃpi visuṃ sattiviseso na hoti. Teneva cittena gacchati nisīdati tiṭṭhatītiādinā pacchimacitte ṭhitānaṃpi purimacittaṃ vattatiyevāti lokassa abhimāno hoti. Tasmā yattha atthitāsaṅkā sambhavati. Tattha tadāsaṅkā nivattanatthaṃ ayaṃ paccayo vuttoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vināsaṃ gato vigato. Yasmiṃ avigate añño uppajjituṃ okāsaṃ nalabhati, so tassa okāsadānasaṅkhātena sayaṃ vigatabhāvena upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vigatapaccayo"
      },
      ". Vattamānatā saṅkhātena avigatabhāvena tādisasseva dhammassa upakārako dhammo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avigatapaccayo"
      },
      ". Purimapaccaya dukameva cettha nānattha pasaṅganivattanatthaṃ ñāṇavisadatthañca pariyāyantarena vigatadukaṃnāma katvā desitanti veditabbaṃ. Tathā hi atthīti kho kaccāna ayameko anto. Natthīti ayaṃ dutīyo antotiādinā nānāatthadīpakā atthi natthi saddā sāsane lokeca dissanti. Pubbe vuttasseva ca atthassa puna pariyāyantarena vacanaṃ sotūnaṃ ñāṇavisadatthāya hotīti. Ṭīkākārā pana bahuṃ tesaṃ paccaya dukānaṃ nānatthasambhavaṃ vaṇṇentiyevāti. [Paccayuddeso]"
    ],
    "innerText": "Vināsaṃ gato vigato. Yasmiṃ avigate añño uppajjituṃ okāsaṃ nalabhati, so tassa okāsadānasaṅkhātena sayaṃ vigatabhāvena upakārako dhammo vigatapaccayo. Vattamānatā saṅkhātena avigatabhāvena tādisasseva dhammassa upakārako dhammo avigatapaccayo. Purimapaccaya dukameva cettha nānattha pasaṅganivattanatthaṃ ñāṇavisadatthañca pariyāyantarena vigatadukaṃnāma katvā desitanti veditabbaṃ. Tathā hi atthīti kho kaccāna ayameko anto. Natthīti ayaṃ dutīyo antotiādinā nānāatthadīpakā atthi natthi saddā sāsane lokeca dissanti. Pubbe vuttasseva ca atthassa puna pariyāyantarena vacanaṃ sotūnaṃ ñāṇavisadatthāya hotīti. Ṭīkākārā pana bahuṃ tesaṃ paccaya dukānaṃ nānatthasambhavaṃ vaṇṇentiyevāti. [Paccayuddeso]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "168"
      },
      ". Idāni yathā uddiṭṭhe catuvīsatipaccaye pathamaṃ chahi rāsīhi saṅgahetvā puna rāsīnaṃ anukkamena tesaṃ paccayānaṃ niddesaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chadhānāmantunāmassā"
      },
      "ti gāthādvaya māha. Nāmaṃ nāmassa chadhā chabbidhehi paccayehi paccayo hoti. Nāmaṃ nāmarūpīnaṃ pañcadhā. Puna nāmaṃ rūpassa ekadhā, rūpaṃ nāmassa ekadhāeva. Paññattināmarūpāni nāmassa duvidhā, dvayaṃ nāmarūpaṃ dvayasseva nāmarūpassa navadhāti evaṃ chakkapañcakādivasena paccayā chabbidhā honti. Kathaṃ hontīti yojanā."
    ],
    "innerText": "168. Idāni yathā uddiṭṭhe catuvīsatipaccaye pathamaṃ chahi rāsīhi saṅgahetvā puna rāsīnaṃ anukkamena tesaṃ paccayānaṃ niddesaṃ dassento chadhānāmantunāmassāti gāthādvaya māha. Nāmaṃ nāmassa chadhā chabbidhehi paccayehi paccayo hoti. Nāmaṃ nāmarūpīnaṃ pañcadhā. Puna nāmaṃ rūpassa ekadhā, rūpaṃ nāmassa ekadhāeva. Paññattināmarūpāni nāmassa duvidhā, dvayaṃ nāmarūpaṃ dvayasseva nāmarūpassa navadhāti evaṃ chakkapañcakādivasena paccayā chabbidhā honti. Kathaṃ hontīti yojanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[229]"
      },
      " Yaṃpana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[229] Yaṃpana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Paññattināmarūpāni nāmassa dvidhā dvipakārā paccayā hontīti vuttaṃ’’. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paccayakathā ",
      " hi nāma paccayato paccayuppannato paccayasattitoti tīhi pakārehi vuttāyeva suvuttā hotīti. Yasmā pana anantarādipaccayānāma cittasantānassa avicchedāya kiccaṭṭhānānukkamapaṭipādanāya eva ca honti. Tasmā kusalādīsu arūpadhammesu yokoci dhammo yassa kassaci aviruddhassa dhammassa paccayo na na hotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantaraniruddhācittacetasikādhammā"
      },
      "tiādi. Tattha aviruddhassātietena aññamaññaviruddhānaṃ kusalākusalānaṃ somanassadomanassānañca aññamaññaṃ anantara paccayapaṭikkhepo veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭuppannāna"
      },
      "nti punuppannānaṃ paṭipāṭiyā uppannānaṃvā. Punappunaṃ santānaparibhāvanāvasena pavatto āsevanapaccayonāma, kevalaṃ payogasādhanīyesu javavega sahitesu cittuppādesu eva labbhatīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purimāni javanānī"
      },
      "tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "javanānī"
      },
      "ti maggaphalajavanavajjāni lokiya kusalā kusalakriyajavanāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pacchimānaṃjavanāna"
      },
      "nti phalajavanavajjānaṃ kusalākusalakriyajavanānaṃ. Bhinnajātikā hi dhammā aññamaññaṃ sabbākārapāripūraṃ parivāsaṃnāma gahetuṃvā gāhāpetuṃpā na sakkonti. Yadi sakkuṇeyyuṃ, jātimattenapi dhammā pubbāparaṃ abhinnāeva siyunti. Tasmā bhinnajātikaṃ phalajavanaṃ maggato parivāsaṃ gahetuṃ na sakkoti. Maggopi attano parivāsaṃ phalassa dātuṃ na sakkoti. Phalacittānica parikammapayogabalena javana kiccāni honti, na aññamaññaṃ parivāsadāna gahaṇa balenāti. Yasmā kāmāvacarabhāvato mahaggatā nuttara bhāvappattināma āsevanabalena hoti, tasmā gotrabhu jhāna maggānaṃ bhūmi bhedo idha appamāṇanti daṭṭhabbaṃ."
    ],
    "innerText": "Paccayakathā hi nāma paccayato paccayuppannato paccayasattitoti tīhi pakārehi vuttāyeva suvuttā hotīti. Yasmā pana anantarādipaccayānāma cittasantānassa avicchedāya kiccaṭṭhānānukkamapaṭipādanāya eva ca honti. Tasmā kusalādīsu arūpadhammesu yokoci dhammo yassa kassaci aviruddhassa dhammassa paccayo na na hotīti vuttaṃ anantaraniruddhācittacetasikādhammātiādi. Tattha aviruddhassātietena aññamaññaviruddhānaṃ kusalākusalānaṃ somanassadomanassānañca aññamaññaṃ anantara paccayapaṭikkhepo veditabbo. Paṭuppannānanti punuppannānaṃ paṭipāṭiyā uppannānaṃvā. Punappunaṃ santānaparibhāvanāvasena pavatto āsevanapaccayonāma, kevalaṃ payogasādhanīyesu javavega sahitesu cittuppādesu eva labbhatīti vuttaṃ purimāni javanānītiādi. Tattha javanānīti maggaphalajavanavajjāni lokiya kusalā kusalakriyajavanāni pacchimānaṃjavanānanti phalajavanavajjānaṃ kusalākusalakriyajavanānaṃ. Bhinnajātikā hi dhammā aññamaññaṃ sabbākārapāripūraṃ parivāsaṃnāma gahetuṃvā gāhāpetuṃpā na sakkonti. Yadi sakkuṇeyyuṃ, jātimattenapi dhammā pubbāparaṃ abhinnāeva siyunti. Tasmā bhinnajātikaṃ phalajavanaṃ maggato parivāsaṃ gahetuṃ na sakkoti. Maggopi attano parivāsaṃ phalassa dātuṃ na sakkoti. Phalacittānica parikammapayogabalena javana kiccāni honti, na aññamaññaṃ parivāsadāna gahaṇa balenāti. Yasmā kāmāvacarabhāvato mahaggatā nuttara bhāvappattināma āsevanabalena hoti, tasmā gotrabhu jhāna maggānaṃ bhūmi bhedo idha appamāṇanti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hetu.La. Nāmarūpāna"
      },
      "nti ettha hetumaggaṅgāni ahetukavajjitānaṃ, jhānaṅgāni pañcaviññāṇavajjitānaṃ sahajātānaṃ nāmarūpānaṃ. Sahajātarūpalakkhaṇaṃ pana sayameva vakkhati. Cetanānāma pavattamānā dve kiccāni sādheti sahajātānaṃ saṃvidhānañca āyatiṃ vipākapātu bhāvatthāya tasmiṃ santāne attano pavattā kārasaṅkhāta bījanidhānañcāti. Tattha saṃvidhānakiccaṃ sabbacetanā sādhāraṇaṃ ",
      " hoti. Bījanidhānakiccaṃ pana kusalākusalabhāvappattāyaeva cetanāya hotīti vuttaṃ sahajātācetanātiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahajātācetanā"
      },
      "ti antamaso pañcaviññāṇa sahajātāpi cetanā. Sāpi hi sahajātānaṃ saṃvidahanasaṅkhātena kammabhāvena pavattattā kammaṃevanāma hotīti. Yasmā attano pavattākārasaṅkhātassa vipākabījassa nidahanaṃnāma, na tāvadeva bījakiccaṃ sampādeti. Ambabījādīni viya pariṇatabhāvaṃ patvā khaṇantareeva sampādetīti vuttaṃ nānākkhaṇikā cetanātiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nānākkhaṇikācetanā"
      },
      "ti attano paccayuppannadhamma pavattikkhaṇato visuṃ bhūte atītakāle siddhā kusalā kusalacetanā. Kusalākusalacetanātivā pāṭho siyā."
    ],
    "innerText": "Hetu.La. Nāmarūpānanti ettha hetumaggaṅgāni ahetukavajjitānaṃ, jhānaṅgāni pañcaviññāṇavajjitānaṃ sahajātānaṃ nāmarūpānaṃ. Sahajātarūpalakkhaṇaṃ pana sayameva vakkhati. Cetanānāma pavattamānā dve kiccāni sādheti sahajātānaṃ saṃvidhānañca āyatiṃ vipākapātu bhāvatthāya tasmiṃ santāne attano pavattā kārasaṅkhāta bījanidhānañcāti. Tattha saṃvidhānakiccaṃ sabbacetanā sādhāraṇaṃ hoti. Bījanidhānakiccaṃ pana kusalākusalabhāvappattāyaeva cetanāya hotīti vuttaṃ sahajātācetanātiādi. Tattha sahajātācetanāti antamaso pañcaviññāṇa sahajātāpi cetanā. Sāpi hi sahajātānaṃ saṃvidahanasaṅkhātena kammabhāvena pavattattā kammaṃevanāma hotīti. Yasmā attano pavattākārasaṅkhātassa vipākabījassa nidahanaṃnāma, na tāvadeva bījakiccaṃ sampādeti. Ambabījādīni viya pariṇatabhāvaṃ patvā khaṇantareeva sampādetīti vuttaṃ nānākkhaṇikā cetanātiādi. Tattha nānākkhaṇikācetanāti attano paccayuppannadhamma pavattikkhaṇato visuṃ bhūte atītakāle siddhā kusalā kusalacetanā. Kusalākusalacetanātivā pāṭho siyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipākakkhandhāaññamaññaṃsahajātānaṃrūpāna"
      },
      "nti ettha aññamaññassaca sahajātarūpānañcāti attho. Yathānāma pure jātā sālarukkhapotakā pacchā anuvassaṃ vassantānaṃ vuṭṭhidhārānaṃ vasena vuddhiṃ viruḷhiṃ vepullaṃ patvā tasmiṃ ṭhāne yāvakappāvasānāpi mahantassa sālavanasaṇḍassa pavattiyā paccayā honti. Evaṃ paṭisandhikkhaṇato paṭṭhāya purimacittakkhaṇesu uppannā sakalasarīre kammajakāyo cittajakāyo utujakāyo āhāraja kāyoti sabbe sakalasarīraṭṭhakā catusamuṭṭhānika rūpadhammā pacchājātānaṃ pathamabhavaṅgādīnaṃ cittacetasikānaṃ vasena vuddhiṃ viruḷhiṃ vepullaṃ patvā uparupari catusamuṭṭhānika rūpaparaṃparāpavattiyā paccayattaṃ upagacchantīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pacchājātā cittacetasikā dhammā"
      },
      "tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purejātassā"
      },
      "ti ātītānantaracitte jātassāti vadanti. Yāva aṭṭhamacittāvā purejātassa. Ettako hi kālo rūpadhammānaṃ vaḍḍhanakālonāma. Tatoparaṃ hāyanakāle pacchājātena payojanaṃ natthīti. Yāva soḷasamacittā eva vā purejātassa. Yadaggena hi maraṇāsannakāle vatthurūpaṃ cuticittassa purejātapaccayataṃ upagacchati. Tadaggena cuticittaṃpi tassa vatthurūpassa pacchājātapaccayo na hotīti navattabbo. Tathā sesarūpānañca. Yathā hi upatthambhanto āhāro ",
      " vaḍḍhanapakkhe ṭhitameva upatthambhati. Hāyanapakkhe ṭhitaṃ nupatthambhatīti natthi. Tadāpi tadanurūpassa upatthambhanassa icchitabbattā. Evamayaṃpīti."
    ],
    "innerText": "Vipākakkhandhāaññamaññaṃsahajātānaṃrūpānanti ettha aññamaññassaca sahajātarūpānañcāti attho. Yathānāma pure jātā sālarukkhapotakā pacchā anuvassaṃ vassantānaṃ vuṭṭhidhārānaṃ vasena vuddhiṃ viruḷhiṃ vepullaṃ patvā tasmiṃ ṭhāne yāvakappāvasānāpi mahantassa sālavanasaṇḍassa pavattiyā paccayā honti. Evaṃ paṭisandhikkhaṇato paṭṭhāya purimacittakkhaṇesu uppannā sakalasarīre kammajakāyo cittajakāyo utujakāyo āhāraja kāyoti sabbe sakalasarīraṭṭhakā catusamuṭṭhānika rūpadhammā pacchājātānaṃ pathamabhavaṅgādīnaṃ cittacetasikānaṃ vasena vuddhiṃ viruḷhiṃ vepullaṃ patvā uparupari catusamuṭṭhānika rūpaparaṃparāpavattiyā paccayattaṃ upagacchantīti vuttaṃ pacchājātā cittacetasikā dhammātiādi. Tattha purejātassāti ātītānantaracitte jātassāti vadanti. Yāva aṭṭhamacittāvā purejātassa. Ettako hi kālo rūpadhammānaṃ vaḍḍhanakālonāma. Tatoparaṃ hāyanakāle pacchājātena payojanaṃ natthīti. Yāva soḷasamacittā eva vā purejātassa. Yadaggena hi maraṇāsannakāle vatthurūpaṃ cuticittassa purejātapaccayataṃ upagacchati. Tadaggena cuticittaṃpi tassa vatthurūpassa pacchājātapaccayo na hotīti navattabbo. Tathā sesarūpānañca. Yathā hi upatthambhanto āhāro vaḍḍhanapakkhe ṭhitameva upatthambhati. Hāyanapakkhe ṭhitaṃ nupatthambhatīti natthi. Tadāpi tadanurūpassa upatthambhanassa icchitabbattā. Evamayaṃpīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Arūpadhammānaṃ ānubhāvonāma mahāvipphāro hoti. Tasmā te kāyekadese vatthumhi uppannāpi sakalaṃ imaṃ catujakāyaṃ upatthambhetuṃ sakkontiyevāti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "imassakāyassā"
      },
      "ti. Cakkhādīni pasādavatthūni rūpādīhi sahaladdhaghaṭṭanānieva viññāṇassa ādhārabhāvaṃ gacchanti. Ghaṭṭanañca ṭhitipattakāleevāti tesaṃ niccakālaṃpi attano viññāṇassa purejātapaccayatā siddhi hoti. Viññāṇañcanāma pañcavokārabhave vatthunissayena vinā uppajjituṃ nasakkotīti, yadā purejātaṃvā vaḍḍhanapakkhe ṭhitaṃvā vatthuṃ na labhati, tadā paṭisandhikālevā maraṇāsannakālevā yaṃ yaṃ labhati, taṃ taṃ nissāya uppajjatiyeva. Yadā pana pure jātaṃ suṭṭhu balavantañca vatthuṃ labhati, tadā tadeva nissāya pavattati. Tañca niyamato pavattikāleeva labbhati, no paṭisandhikāle. Nahi tadā viññāṇapaccayena uppannaṃ vatthupurejātaṃ bhavituṃ sakkotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chavatthūni pavattiya"
      },
      "nti."
    ],
    "innerText": "Arūpadhammānaṃ ānubhāvonāma mahāvipphāro hoti. Tasmā te kāyekadese vatthumhi uppannāpi sakalaṃ imaṃ catujakāyaṃ upatthambhetuṃ sakkontiyevāti vuttaṃ imassakāyassāti. Cakkhādīni pasādavatthūni rūpādīhi sahaladdhaghaṭṭanānieva viññāṇassa ādhārabhāvaṃ gacchanti. Ghaṭṭanañca ṭhitipattakāleevāti tesaṃ niccakālaṃpi attano viññāṇassa purejātapaccayatā siddhi hoti. Viññāṇañcanāma pañcavokārabhave vatthunissayena vinā uppajjituṃ nasakkotīti, yadā purejātaṃvā vaḍḍhanapakkhe ṭhitaṃvā vatthuṃ na labhati, tadā paṭisandhikālevā maraṇāsannakālevā yaṃ yaṃ labhati, taṃ taṃ nissāya uppajjatiyeva. Yadā pana pure jātaṃ suṭṭhu balavantañca vatthuṃ labhati, tadā tadeva nissāya pavattati. Tañca niyamato pavattikāleeva labbhati, no paṭisandhikāle. Nahi tadā viññāṇapaccayena uppannaṃ vatthupurejātaṃ bhavituṃ sakkotīti vuttaṃ chavatthūni pavattiyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcālambaṇānica pañcaviññāṇavīthiyā"
      },
      "ti idaṃ niyamasiddhigahaṇa vasena vuttaṃ. Sabbāni pana paccuppannabhūtāni nipphannarūpāni manoviññāṇa vīthiyā purejātapaccayā hontiyeva. Evañca katvā paṭṭhāne paccuppanno dhammo paccuppannassa dhammassa purejātapaccayena paccayo. Ārammaṇapurejātaṃ cakkhuṃ aniccato dukkhato anattato vipassati. Sotaṃ, ghānaṃ, jivhaṃ, kāyaṃ, rūpe, sadde, gandhe, rase, phoṭṭhabbe, vatthuṃ, paccuppanne khandhe aniccato dukkhato anattato vipassati, paccuppannaṃ cakkhuṃ assādeti abhinandatītiādi vuttaṃ. Aṭṭhakathāyañca uppādakkhaṇaṃ atikkamitvā ṭhitipattaṃ aṭṭhārasavidhaṃ rūpameva purejātapaccayoti vuttanti. Etthaca kiñcāpi paṭṭhāne paccuppannārammaṇaṃ paṭisandhicittaṃ paccuppannārammaṇassa bhavaṅgassaanantarapaccayena paccayoti evaṃ paṭisandhibhavaṅgānaṃpi paccuppannārammaṇatāya vuttattā ",
      " paccuppannabhūtāni kammanimitta gatinimittāni ārabbha pavatti kāle paṭisandhicittānaṃpi ārammaṇapurejātaṃ labbhamānaṃ viya dissati. Evaṃsantepi purejātapaccayassa paccaniye paṭisandhikkhaṇe vipākā byākato eko khandhotiādinā pāḷiyaṃeva taṃ paṭikkhittanti. Etthaca āruppe viya paṭisandhikkhaṇepi vatthupure jātassa abhāvā aparibyattattāvā tassa ārammaṇassa ārammaṇamattabhāveeva ṭhitattā paṭikkhittanti kāraṇaṃ vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇamevagarukata"
      },
      "nti paccavekkhanavasena assādanādivasenaca garukataṃ iṭṭhārammaṇa māha. Tañca kho tassatassa puggalassa icchāvasena veditabbaṃ. Gūthakuṇapādīnipi hi tadabhinandantānaṃ kimimakkhika sunakha gijjha kākādīnaṃ garukatānieva ārammaṇāni hontīti."
    ],
    "innerText": "Pañcālambaṇānica pañcaviññāṇavīthiyāti idaṃ niyamasiddhigahaṇa vasena vuttaṃ. Sabbāni pana paccuppannabhūtāni nipphannarūpāni manoviññāṇa vīthiyā purejātapaccayā hontiyeva. Evañca katvā paṭṭhāne paccuppanno dhammo paccuppannassa dhammassa purejātapaccayena paccayo. Ārammaṇapurejātaṃ cakkhuṃ aniccato dukkhato anattato vipassati. Sotaṃ, ghānaṃ, jivhaṃ, kāyaṃ, rūpe, sadde, gandhe, rase, phoṭṭhabbe, vatthuṃ, paccuppanne khandhe aniccato dukkhato anattato vipassati, paccuppannaṃ cakkhuṃ assādeti abhinandatītiādi vuttaṃ. Aṭṭhakathāyañca uppādakkhaṇaṃ atikkamitvā ṭhitipattaṃ aṭṭhārasavidhaṃ rūpameva purejātapaccayoti vuttanti. Etthaca kiñcāpi paṭṭhāne paccuppannārammaṇaṃ paṭisandhicittaṃ paccuppannārammaṇassa bhavaṅgassaanantarapaccayena paccayoti evaṃ paṭisandhibhavaṅgānaṃpi paccuppannārammaṇatāya vuttattā paccuppannabhūtāni kammanimitta gatinimittāni ārabbha pavatti kāle paṭisandhicittānaṃpi ārammaṇapurejātaṃ labbhamānaṃ viya dissati. Evaṃsantepi purejātapaccayassa paccaniye paṭisandhikkhaṇe vipākā byākato eko khandhotiādinā pāḷiyaṃeva taṃ paṭikkhittanti. Etthaca āruppe viya paṭisandhikkhaṇepi vatthupure jātassa abhāvā aparibyattattāvā tassa ārammaṇassa ārammaṇamattabhāveeva ṭhitattā paṭikkhittanti kāraṇaṃ vadanti. Ārammaṇamevagarukatanti paccavekkhanavasena assādanādivasenaca garukataṃ iṭṭhārammaṇa māha. Tañca kho tassatassa puggalassa icchāvasena veditabbaṃ. Gūthakuṇapādīnipi hi tadabhinandantānaṃ kimimakkhika sunakha gijjha kākādīnaṃ garukatānieva ārammaṇāni hontīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[230]"
      },
      " Yaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[230] Yaṃ pana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Garukatanti garuṃ katvā paccavekkhita’’ntiādi vuttaṃ. Taṃ anupapannaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cakkhuṃ garuṃ katvā assādeti abhinandatītiādinā assā danādivasenapi assa niddesassa pavattattāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rāgādayo pana dhammā"
      },
      "ti etena rāgo doso moho māno diṭṭhi patthanāti evaṃ vuttehi dhammehi saha dasa akusalakammapathā pañcaanantariya kammānica gahitāni honti. Tattha anantariyavajjāni tāni samatikkamamukhena yathārahaṃ ajjhattaṃ sabbesaṃ catubhūmaka kusalānaṃ anantariyakammāni pana kāmāvacarakusalānameva uppattiyā balavanissayā honti. Tāniyevaca sabbāni yathārahaṃ ajjhattañca bahiddhāca rāgādīnaṃ pāṇātipātādīnañca sabbesaṃ akusalānaṃ kāyikasukhadukkhādīnañca abyākatadhammānaṃ uppattiyā balava nissayā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhādayo"
      },
      "ti etena saddhā sīlaṃ sutaṃ cāgo paññāti evaṃ vuttehi dhammehi saha sabbe dānasīlādayo catubhūmakaku salānaṃ rāgādi akusalānaṃ sukhadukkhādicatubhūmaka abyākatā nañca uppattiyā balavanissayā hontīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhaṃ dukkhaṃ puggalo bhojanaṃ utusenāsana"
      },
      "nti etena nibbānavajjā sabbe catubhūmakā byākatā ",
      " gahitā, tepi hi yathārahaṃ ajjhattañca bahiddhāca kusalākusalā byākatadhammānaṃ uppattiyā balavanissayā hontīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammaṃvipākāna"
      },
      "nti ettha suṭṭhu balavaṃ kammaṃ adhippetaṃ, na dubbalanti. Kasmā panettha rūpadhammā paccayuppannesu na gahitā. Nanu tesaṃpi bahiddhā rukkhatiṇādīnaṃ vuddhiviruḷhi vepullatthāya ajjhattañca ārogyādiatthāya pathavirasa āporasa vassodaka bijamūlabhesajjādayo balavanissayā hontīti. Ayaṃ panattho mūlaṭīkāyaṃ kathitoyeva. Vuttañhi tattha –"
    ],
    "innerText": "Cakkhuṃ garuṃ katvā assādeti abhinandatītiādinā assā danādivasenapi assa niddesassa pavattattāti. Rāgādayo pana dhammāti etena rāgo doso moho māno diṭṭhi patthanāti evaṃ vuttehi dhammehi saha dasa akusalakammapathā pañcaanantariya kammānica gahitāni honti. Tattha anantariyavajjāni tāni samatikkamamukhena yathārahaṃ ajjhattaṃ sabbesaṃ catubhūmaka kusalānaṃ anantariyakammāni pana kāmāvacarakusalānameva uppattiyā balavanissayā honti. Tāniyevaca sabbāni yathārahaṃ ajjhattañca bahiddhāca rāgādīnaṃ pāṇātipātādīnañca sabbesaṃ akusalānaṃ kāyikasukhadukkhādīnañca abyākatadhammānaṃ uppattiyā balava nissayā honti. Saddhādayoti etena saddhā sīlaṃ sutaṃ cāgo paññāti evaṃ vuttehi dhammehi saha sabbe dānasīlādayo catubhūmakaku salānaṃ rāgādi akusalānaṃ sukhadukkhādicatubhūmaka abyākatā nañca uppattiyā balavanissayā hontīti. Sukhaṃ dukkhaṃ puggalo bhojanaṃ utusenāsananti etena nibbānavajjā sabbe catubhūmakā byākatā gahitā, tepi hi yathārahaṃ ajjhattañca bahiddhāca kusalākusalā byākatadhammānaṃ uppattiyā balavanissayā hontīti. Kammaṃvipākānanti ettha suṭṭhu balavaṃ kammaṃ adhippetaṃ, na dubbalanti. Kasmā panettha rūpadhammā paccayuppannesu na gahitā. Nanu tesaṃpi bahiddhā rukkhatiṇādīnaṃ vuddhiviruḷhi vepullatthāya ajjhattañca ārogyādiatthāya pathavirasa āporasa vassodaka bijamūlabhesajjādayo balavanissayā hontīti. Ayaṃ panattho mūlaṭīkāyaṃ kathitoyeva. Vuttañhi tattha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Nahi rūpābyākataṃ pakatūpanissayaṃ labhati. Acetanena rūpasantānena pakatasseva abhāvato. Yathā hi arūpasantānena kattubhūtena saddhādayo nipphāditā utubhojanādayoca upasevitā. Na evaṃ rūpasantānena. Yasmiñca utubījādike kammādikeca sati rūpaṃ pavattati. Na taṃ tena rūpena pakataṃ hoti. Sacetanasseva hi uppādanupasevanapayogavasena cetanaṃ pakappanaṃ pakaraṇaṃ. Rūpañca acetananti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idaṃ vuttaṃ hoti, duvidhaṃ santānaṃ rūpasantānaṃ arūpasantānanti. Tattha yena santānena pubbe kiñci suṭṭhuuppāditaṃvā hoti upasevitaṃvā, tasseva pubbe attanā uppāditupasevitā dhammā kālantare attano upanissayapaccayā honti. Pakaraṇasaṅkhātañca tathā uppādanupasevanaṃnāma sacetane arūpasantāneeva labbhati, na acetane rūpasantāneti. Tasmā rūpadhammā upanissayaṃnāma nalabbhantīti. Imasmiṃ sati idaṃ hoti, asati na hotīti evaṃ vuttena suttantikapariyāyena pana upanissayo nāma rūpadhammānaṃ majjhepi vattabboyevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[231] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[231] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Yathārahaṃ ajjhattañca bahiddhāca rāgādayo.La. Senāsanañcāti’’ viyojetvā ‘‘rāgādayo hi ajjhattaṃ nipphādikā. Puggalādayo bahiddhā sevitāti’’ vuttaṃ. Taṃ nasundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na ",
      " hi attano parassaca uppannā rāgādayo parassa attano ca santāne rāgādīnaṃ balavanissayā na honti. Samānacchandānaṃ itthi purisādīnaṃ manopadosika devādīnañcettha rāgādayo nidassanaṃ."
    ],
    "innerText": "Na hi attano parassaca uppannā rāgādayo parassa attano ca santāne rāgādīnaṃ balavanissayā na honti. Samānacchandānaṃ itthi purisādīnaṃ manopadosika devādīnañcettha rāgādayo nidassanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[232]"
      },
      " Yāca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha"
      }
    ],
    "innerText": "[232] Yāca tattha"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Yathāṭhitavasena yojanaṃ’’ katvā ‘‘attanohi rāgādayo’’tiādinā atthavibhāvanā katā. Sāpi anupapannāyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tāya hi attano rāgādayo saddhādayoca ajjhattaṃ kusalādīnaṃ attano saddhāyo pana bahiddhā kusalassāti evaṃ aparipuṇṇassa atthassa vibhāvitattāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[233]"
      },
      " Yañca"
    ],
    "innerText": "[233] Yañca"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘Tatthā’tiādinā attanorāgādayonissāyaajjhattaṃ kusalākusalānameva uppattividhānaṃ vuttaṃ. Taṃpi anupapannameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nayadassanamattabhūtaṃpi hi saṃvaṇṇanāvākyaṃnāma nayamukhaṃ paripuṇṇaṃ katvā vattabbaṃ hotīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Garukataṃārammaṇa"
      },
      "nti ettha sabbaṃ lokiyakusalaṃ heṭṭhimamaggaphalanibbānāni ca kāmāvacara kusalassa arahattamaggaphalanibbānāni catunnaṃ ñāṇasampayutta mahākriyajavanānaṃ. Nibbānaṃ aṭṭhavidhalokuttarassa thapetvā paṭighadvaya momūha dvaya dukkhasahagata kāyaviññāṇāni avasesaṃ sabbaṃ lokiya kusalākusalābyākatadhammajātaṃ lobhasahagatacittassāti evaṃ paccaya paccayuppanna vibhāgo veditabbo."
    ],
    "innerText": "Nayadassanamattabhūtaṃpi hi saṃvaṇṇanāvākyaṃnāma nayamukhaṃ paripuṇṇaṃ katvā vattabbaṃ hotīti. Garukataṃārammaṇanti ettha sabbaṃ lokiyakusalaṃ heṭṭhimamaggaphalanibbānāni ca kāmāvacara kusalassa arahattamaggaphalanibbānāni catunnaṃ ñāṇasampayutta mahākriyajavanānaṃ. Nibbānaṃ aṭṭhavidhalokuttarassa thapetvā paṭighadvaya momūha dvaya dukkhasahagata kāyaviññāṇāni avasesaṃ sabbaṃ lokiya kusalākusalābyākatadhammajātaṃ lobhasahagatacittassāti evaṃ paccaya paccayuppanna vibhāgo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[234]"
      },
      " Yaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[234] Yaṃ pana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Garuka taṃālambaṇanti paccavekkhanaassādādinā garukataṃ ārammaṇa’’nti vatvā taṃ vibhāventena ‘‘tañhi jhānamagga phalavipassanā nibbānādibhedaṃ paccavekkhana assādādimaggaphalādidhamme attādhīne karotīti ārammaṇādhipatināmā’’ti vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dāna ",
      " sīla uposathakamma pubbe suciṇṇagotrabhu vodāna maggaphala nibbānāniceva rāgadiṭṭhicakkhusotādīnicāti pana vattabbaṃ. Vipassanātica idaṃ gotrabhuvodānāniyeva sandhāya vuttaṃ siyā. Naca tāni nibbānārammaṇāni vipassanānāma hontīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātānaṃnāmarūpāna"
      },
      "nti dvihetuka tihetuka javanasaha jātānanti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññamaññaṃ sahajāta rūpānañcā"
      },
      "ti aññamaññassaca paṭisandhikkhaṇe kammasamuṭṭhānarūpānaṃ pavattiyaṃ citta samuṭṭhānarūpānañca. Esa nayo paratthapi. Pañcavokārabhave paṭisandhikkhaṇe viññāṇaṃ vatthunā vinā patiṭṭhaṃ nalabhati. Vatthucatena vinā patiṭṭhaṃ nalabhatīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisandhikkhaṇe vatthuvipākā aññamañña"
      },
      "nti. Aññamaññapaccaye yo attano upatthambhakaṃ paccupatthambhati. Soeva paccayuppannabhāvaṃ gacchati. Cittasamuṭṭhāna rūpānica cittaṃ kiñci upatthambhetuṃ nasakkonti. Tathā upādārūpānica mahābhūteti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cittacetasikādhammāaññamañña"
      },
      "ntiādi."
    ],
    "innerText": "Dāna sīla uposathakamma pubbe suciṇṇagotrabhu vodāna maggaphala nibbānāniceva rāgadiṭṭhicakkhusotādīnicāti pana vattabbaṃ. Vipassanātica idaṃ gotrabhuvodānāniyeva sandhāya vuttaṃ siyā. Naca tāni nibbānārammaṇāni vipassanānāma hontīti. Sahajātānaṃnāmarūpānanti dvihetuka tihetuka javanasaha jātānanti adhippāyo. Aññamaññaṃ sahajāta rūpānañcāti aññamaññassaca paṭisandhikkhaṇe kammasamuṭṭhānarūpānaṃ pavattiyaṃ citta samuṭṭhānarūpānañca. Esa nayo paratthapi. Pañcavokārabhave paṭisandhikkhaṇe viññāṇaṃ vatthunā vinā patiṭṭhaṃ nalabhati. Vatthucatena vinā patiṭṭhaṃ nalabhatīti vuttaṃ paṭisandhikkhaṇe vatthuvipākā aññamaññanti. Aññamaññapaccaye yo attano upatthambhakaṃ paccupatthambhati. Soeva paccayuppannabhāvaṃ gacchati. Cittasamuṭṭhāna rūpānica cittaṃ kiñci upatthambhetuṃ nasakkonti. Tathā upādārūpānica mahābhūteti vuttaṃ cittacetasikādhammāaññamaññantiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[235] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[235] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Yasmā pana aññamaññuvatthambhanavaseneva aññamaññapaccayatā. Na sahajātamattatoti pavattiyaṃ rūpaṃ nāmānaṃ aññamaññapaccayo na hoti. Tasmā vuttaṃ cittacetasikā dhammā aññamaññanti’’ vuttaṃ. Tattha na sahajātamattatoti etena yadi sahajātamattato aññamaññapaccayatāsiyā. Evaṃsati pavattiyaṃ rūpaṃ nāmānaṃ aññamaññapaccayo siyāti anuññātaṃ hoti. Sahajātapaccayepi pana pavattiyaṃ rūpaṃ nāmānaṃ paccayo nahotiyeva. Tasmā na sundarametanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chavatthūni sattannaṃ viññāṇadhātūna"
      },
      "nti ettha vatthusahajāta nissayo vatthupurejātanissayo vatthārammaṇapurejātanissayoti tividho vatthunissayo. Tattha paṭisandhikkhaṇe vatthu vipākānaṃ khandhānaṃ vatthusahajātanissayo. Yaṃ pana pavattiyaṃ purejātaṃ, vatthuṃ nissāya cittaṃ uppajjati, taṃ tassa cittassa vatthupurejātanissayonāma. Yaṃ pana purejātaṃ vatthu yassa cittassa ",
      " nissayoceva hoti ārammaṇañca, taṃ tassa vatthārammaṇa purejātanissayonāma. Vuttañhetaṃ paṭṭhāne ārammaṇa nissaya purejātavippayutta atthiavigatanti tīṇīti. Kathañca taṃ cittassa nissayoca ārammaṇañca hotīti. Paccuppannaṃ vatthuṃ ārabbha sammasanavasenavā assādanādivasenavā iddhividhakiccādhiṭṭhānavasenavā cittaṃ uppajjati, evaṃ taṃ cittassa nissayoca ārammaṇañca hotīti. Vuttañhetaṃ paṭṭhāne-ajjhattaṃ vatthuṃ aniccato dukkhato vipassati, assādeti. Abhinandati. Taṃ ārabbha rāgo uppajjati, diṭṭhi uppajjati, vicikicchā uppajjati, uddhaccaṃ uppajjati. Domanassaṃ uppajjatīti."
    ],
    "innerText": "Chavatthūni sattannaṃ viññāṇadhātūnanti ettha vatthusahajāta nissayo vatthupurejātanissayo vatthārammaṇapurejātanissayoti tividho vatthunissayo. Tattha paṭisandhikkhaṇe vatthu vipākānaṃ khandhānaṃ vatthusahajātanissayo. Yaṃ pana pavattiyaṃ purejātaṃ, vatthuṃ nissāya cittaṃ uppajjati, taṃ tassa cittassa vatthupurejātanissayonāma. Yaṃ pana purejātaṃ vatthu yassa cittassa nissayoceva hoti ārammaṇañca, taṃ tassa vatthārammaṇa purejātanissayonāma. Vuttañhetaṃ paṭṭhāne ārammaṇa nissaya purejātavippayutta atthiavigatanti tīṇīti. Kathañca taṃ cittassa nissayoca ārammaṇañca hotīti. Paccuppannaṃ vatthuṃ ārabbha sammasanavasenavā assādanādivasenavā iddhividhakiccādhiṭṭhānavasenavā cittaṃ uppajjati, evaṃ taṃ cittassa nissayoca ārammaṇañca hotīti. Vuttañhetaṃ paṭṭhāne-ajjhattaṃ vatthuṃ aniccato dukkhato vipassati, assādeti. Abhinandati. Taṃ ārabbha rāgo uppajjati, diṭṭhi uppajjati, vicikicchā uppajjati, uddhaccaṃ uppajjati. Domanassaṃ uppajjatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha pana ācariyā imaṃ vatthārammaṇapurejātanissayaṃnāma maraṇāsannakāleeva vācanāmaggaṃ āropayiṃsu. Ayaṃpanettha tesaṃ adhippāyo. Aṭṭhakathāyaṃ tāva aniṭṭhe ṭhāne āvajjanena vinā vīthicittānaṃ pavatti paṭisiddhā hoti. Tathā ekāvajjanavīthi yañca cittānaṃ ārammaṇaṃnāma dhammatoca kālatoca abhinnameva icchanti aṭṭhakathācariyā. Pakatikāleca cittānināma pacceka vatthunissayāni honti. Tasmā yadā paccuppannaṃ ajjhattaṃ vatthuṃ ārabbhaaniccādivasena sammasanti, etaṃ mamātivā assādenti, tadāyaṃ vatthu āvajjitaṃ hoti. Javanānipi tadeva gaṇhanti. Na attano attano nissayavatthūni. Yadi hi tānivā aññaṃvā ārammaṇaṃ gaṇheyyuṃ. Nirāvajjanānināma javanāni honti. Kasmā, āvajjanena āvajjitaṃ agahetvā aññaṃ gahetvā pavattanatoti. Bhinnā rammaṇānicanāma honti. Pacchā uppannāni paccekavatthūnivā aññaṃvā gahetvā pavattanatoti. Naca tathā sakkā bhavituṃ aṭṭhakathā virodhato. Tasmā so vatthārammaṇa purejātapaccayo pakati kāle na sakkā laddhunti. Maraṇāsannakāle pana sabbāni āvajjanādīni cittāni ekameva vatthuṃ nissāya pavattantīti taṃ ārabbha pavattānaṃ āvajjanādīnaṃ tesaṃ tadeva vatthuca ārammaṇañca hoti. Evañhi sati tesaṃ nirāvajjanatāvā bhinnārammaṇatāvā natthīti ayaṃ tesaṃ adhippāyoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " pana yadi āvajjanena āvajjitaṃ vatthuṃ agahetvā attano attano nissayavatthūni gaṇheyyuṃ. Nirāvajjanānināma javanāni bhaveyyunti idaṃ tāva na yujjati. Āvajjanena āvajji tappakārasseva gahaṇato. Yathā hi āvajjanaṃpi vatthuntveva āvajjati. Tathā javanānica vatthuntveva javanti. No aññathāti natthi javanānaṃ nirāvajjanatāti. Yathā ca nirāvajjanatā natthi, tathā bhinnārammaṇatāpi tesaṃ natthiyeva. Kasmā, vibhāgassa asambhavato. Nahi santatighanavasena ekībhūtamiva pubbāparaṃ pavatta mānesu bahūsu vatthusu ekamekaṃ vatthuṃ idamevāti visuṃ katvā āvajjanaṃvājavanānivā gahetuṃ sakkonti. Naca tathā asakkuṇeyyesu ṭhānesu ekantena dhammatovā kālatovā bhinnā rammaṇatānāma sakkā laddhunti iti bhinnārammaṇatāpi tesaṃ natthi yevāti. Ettāvatā imassa vatthārammaṇapurejātanissaya vidhānassa pakatikālepi labbhamānatā sādhitā hotīti."
    ],
    "innerText": "Tattha pana yadi āvajjanena āvajjitaṃ vatthuṃ agahetvā attano attano nissayavatthūni gaṇheyyuṃ. Nirāvajjanānināma javanāni bhaveyyunti idaṃ tāva na yujjati. Āvajjanena āvajji tappakārasseva gahaṇato. Yathā hi āvajjanaṃpi vatthuntveva āvajjati. Tathā javanānica vatthuntveva javanti. No aññathāti natthi javanānaṃ nirāvajjanatāti. Yathā ca nirāvajjanatā natthi, tathā bhinnārammaṇatāpi tesaṃ natthiyeva. Kasmā, vibhāgassa asambhavato. Nahi santatighanavasena ekībhūtamiva pubbāparaṃ pavatta mānesu bahūsu vatthusu ekamekaṃ vatthuṃ idamevāti visuṃ katvā āvajjanaṃvājavanānivā gahetuṃ sakkonti. Naca tathā asakkuṇeyyesu ṭhānesu ekantena dhammatovā kālatovā bhinnā rammaṇatānāma sakkā laddhunti iti bhinnārammaṇatāpi tesaṃ natthi yevāti. Ettāvatā imassa vatthārammaṇapurejātanissaya vidhānassa pakatikālepi labbhamānatā sādhitā hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica, sabbaṃ paccuppannaṃ attano rūpakāyaṃ ārabbha rūpaṃ me aniccantivā etaṃ mamātivā samanupassantānaṃ ajjhattarūpesu idaṃ nāmarūpaṃ tassacittassa ārammaṇaṃ nahotīti navattabbaṃ. Ārammaṇa bhūtesu pana tesu kiñci ārammaṇamattaṃ kiñci ārammaṇapurejātaṃ kiñci vatthārammaṇapurejātaṃ hotīti sakkā vattunti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kabaḷī kāro āhāro"
      },
      "ti kāmāvacarasattānaṃ paṭisandhito paṭṭhāya uppanno catusamuṭṭhānika rūpāhāroceva bahiddhāhāroca. Gabbhaseyyakānañhi yāva mātuyā āhārapharaṇaṃ nalabbhati, tāva kalalādikālesu tisamuṭṭhāniko ajjhattāhāroyeva upatthambhanakiccaṃ sādheti. Vuttañhetaṃ paṭṭhāne-paṭisandhikkhaṇe kabaḷīkāro āhāro imassa kāyassa āhārapaccayena paccayoti, ojaṭṭhamakarūpasamuṭṭhāpanaṃ panassa bahiddhāhārupatthambhanaṃ laddhakāleyevāti daṭṭhabbaṃ. Yadievaṃ –"
    ],
    "innerText": "Apica, sabbaṃ paccuppannaṃ attano rūpakāyaṃ ārabbha rūpaṃ me aniccantivā etaṃ mamātivā samanupassantānaṃ ajjhattarūpesu idaṃ nāmarūpaṃ tassacittassa ārammaṇaṃ nahotīti navattabbaṃ. Ārammaṇa bhūtesu pana tesu kiñci ārammaṇamattaṃ kiñci ārammaṇapurejātaṃ kiñci vatthārammaṇapurejātaṃ hotīti sakkā vattunti. Kabaḷī kāro āhāroti kāmāvacarasattānaṃ paṭisandhito paṭṭhāya uppanno catusamuṭṭhānika rūpāhāroceva bahiddhāhāroca. Gabbhaseyyakānañhi yāva mātuyā āhārapharaṇaṃ nalabbhati, tāva kalalādikālesu tisamuṭṭhāniko ajjhattāhāroyeva upatthambhanakiccaṃ sādheti. Vuttañhetaṃ paṭṭhāne-paṭisandhikkhaṇe kabaḷīkāro āhāro imassa kāyassa āhārapaccayena paccayoti, ojaṭṭhamakarūpasamuṭṭhāpanaṃ panassa bahiddhāhārupatthambhanaṃ laddhakāleyevāti daṭṭhabbaṃ. Yadievaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Yañcassa bhuñjati mātā, annaṃ pānañca bhojanaṃ. Tena so tattha yāpeti, mātukucchigato tiroti"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kasmā ",
      " vuttanti. Pākaṭāhārena tassa yakkhassa bodhanatthanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imassakāyassā"
      },
      "ti gabbhaseyyakānaṃ tāva paṭisandhicittassa uppādakkhaṇe ekasamuṭṭhānikassa ṭhitibhaṅgakkhaṇesu dvisamuṭṭhāni kassa tatoparaṃ tisamuṭṭhānikassa ojāpharaṇakāle catusamuṭṭhānikassaca kāyassa. Itaresaṃpi yathāsambhavaṃ vattabbaṃ. Rūpaloke pana vināpi duvidhena ojāhārakiccena appanāpatta kammavisesena siddhassa suciraṃpi addhānaṃ pharituṃ samatthassa rūpa jīvitindriyassa tathārūpānañca bhavaṅgapariyāpannānaṃ arūpāhārānaṃ vasena anekakappānipi attabhāvassa pavatti veditabbā. Etenupāyena kammajakāyabahutaresu devesu petanirayesuca suciraṃpi kālaṃ bahiddhāhārena vinā attabhāvassa pavatti vattabbā. Tesu pana ajjhattāhāropi labbhatiyevāti kiñcāpi okkantikkhaṇe vipākakkhandhāpi vatthussa vippayuttapaccayā honti. Te pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cittacetasikādhammā sahajātarūpāna"
      },
      "nti ettha saṅgayhissantīti katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "okkantikkhaṇevatthuvipākāna"
      },
      "nti vuttaṃ."
    ],
    "innerText": "Kasmā vuttanti. Pākaṭāhārena tassa yakkhassa bodhanatthanti. Imassakāyassāti gabbhaseyyakānaṃ tāva paṭisandhicittassa uppādakkhaṇe ekasamuṭṭhānikassa ṭhitibhaṅgakkhaṇesu dvisamuṭṭhāni kassa tatoparaṃ tisamuṭṭhānikassa ojāpharaṇakāle catusamuṭṭhānikassaca kāyassa. Itaresaṃpi yathāsambhavaṃ vattabbaṃ. Rūpaloke pana vināpi duvidhena ojāhārakiccena appanāpatta kammavisesena siddhassa suciraṃpi addhānaṃ pharituṃ samatthassa rūpa jīvitindriyassa tathārūpānañca bhavaṅgapariyāpannānaṃ arūpāhārānaṃ vasena anekakappānipi attabhāvassa pavatti veditabbā. Etenupāyena kammajakāyabahutaresu devesu petanirayesuca suciraṃpi kālaṃ bahiddhāhārena vinā attabhāvassa pavatti vattabbā. Tesu pana ajjhattāhāropi labbhatiyevāti kiñcāpi okkantikkhaṇe vipākakkhandhāpi vatthussa vippayuttapaccayā honti. Te pana cittacetasikādhammā sahajātarūpānanti ettha saṅgayhissantīti katvā okkantikkhaṇevatthuvipākānanti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbathā"
      },
      "ti sabbapakāraṃ sahajātantiādinā yojetabbaṃ. Pakāroca tividho hoti sahajātapaccayotiādivasena veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpajīvitamiccaya"
      },
      "nti evaṃ porāṇehi vutto ayaṃ atthipaccayo avigatapaccayocāti yojetabbaṃ. Nanu kabaḷīkārāhāro rūpajīvitindriyañca sahajāte saṅgahetabbaṃ. Evañhi sati tividhova atthipaccayo siyāti.Na. Sahajananasaṅkhātassa sahuppādanalakkhaṇassa abhāvā. Sahuppādanalakkhaṇo hi sahajātapaccayo. Kabaḷīkārāhāroca ojaṭṭhamakarūpāni uppādentopi attano ṭhitikkhaṇeeva uppādeti, no uppādakkhaṇe. Yathāca mahābhūtā sahajātarūpāni upatthambhantā attanā saha uppādanapubbakāeva upatthambhanti, na tathā so āhāro. So pana vināva sahuppādanakiccena sahajātānipi asahajātānipi upatthambhatīti rūpajīvitaṃpi saha uppādanakiccena vināva saha jātarūpāni anupāleti. Iti ime dvepi dhammā sahajāta lakkhaṇābhāvāeva sahajātapaccaye asaṅgahitā. Idāni sabbepi ",
      " catuvīsatipaccayā saṅgayhamānā cattāropaccayā hontīti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇūpanissaya.La. Samodhānaṃ gacchantī"
      },
      "ti vuttaṃ. Tatrāyaṃ samodhānavidhi, catuvīsatiyā paccayesu adhipati paccayo tāva duvidho ārammaṇasahajātavasena. Tattha ārammaṇādhipati tīsu kammavajjesu samodhānaṃ gacchati. Ārammaṇa mattaṃpi hi kammena saha samodhānaṃ nagacchati. Kuto adhipati bhūtanti."
    ],
    "innerText": "Sabbathāti sabbapakāraṃ sahajātantiādinā yojetabbaṃ. Pakāroca tividho hoti sahajātapaccayotiādivasena veditabbo. Rūpajīvitamiccayanti evaṃ porāṇehi vutto ayaṃ atthipaccayo avigatapaccayocāti yojetabbaṃ. Nanu kabaḷīkārāhāro rūpajīvitindriyañca sahajāte saṅgahetabbaṃ. Evañhi sati tividhova atthipaccayo siyāti.Na. Sahajananasaṅkhātassa sahuppādanalakkhaṇassa abhāvā. Sahuppādanalakkhaṇo hi sahajātapaccayo. Kabaḷīkārāhāroca ojaṭṭhamakarūpāni uppādentopi attano ṭhitikkhaṇeeva uppādeti, no uppādakkhaṇe. Yathāca mahābhūtā sahajātarūpāni upatthambhantā attanā saha uppādanapubbakāeva upatthambhanti, na tathā so āhāro. So pana vināva sahuppādanakiccena sahajātānipi asahajātānipi upatthambhatīti rūpajīvitaṃpi saha uppādanakiccena vināva saha jātarūpāni anupāleti. Iti ime dvepi dhammā sahajāta lakkhaṇābhāvāeva sahajātapaccaye asaṅgahitā. Idāni sabbepi catuvīsatipaccayā saṅgayhamānā cattāropaccayā hontīti dassetuṃ ārammaṇūpanissaya.La. Samodhānaṃ gacchantīti vuttaṃ. Tatrāyaṃ samodhānavidhi, catuvīsatiyā paccayesu adhipati paccayo tāva duvidho ārammaṇasahajātavasena. Tattha ārammaṇādhipati tīsu kammavajjesu samodhānaṃ gacchati. Ārammaṇa mattaṃpi hi kammena saha samodhānaṃ nagacchati. Kuto adhipati bhūtanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha siyā, kasmā ārammaṇamattaṃpi.La. Na gacchatīti vuttaṃ. Nanu kammārammaṇāpi paṭisandhibhavaṅgacutiyo hontīti. Saccaṃ. Ettha pana mūlaṭīkāyaṃ kammaṃ pana tasmiṃ kate pavattamānānaṃ katūpacita bhāvena kammapaccayo hoti. Na ārammaṇākārena. Visaya mattatāvasenaca ārammaṇapaccayo hoti. Na santānavisesanaṃ katvā phaluppādanasaṅkhātena kammapaccayākārena. Tasmā te paccayākāravisabhāgattā saha ghaṭanaṃ nagacchantīti visajjitanti. Sahajātādhipati pana atthipaccaye. Nissayapaccayo tividho sahajāto vatthupurejāto vatthārammaṇapurejātoti. Tattha purimā dve atthipaccaye, pacchimo pana dvīsu ārammaṇatthi paccayesu. So ce garukato hoti upanissayepīti. Purejātapaccayo tividho ārammaṇapurejāto vatthupure jāto vatthārammaṇapurejātoti. Tattha vatthupurejāto atthipaccaye. Itare dve dvīsu ārammaṇatthipaccayesu. Tece garukatā honti. Upanissayepīti. Kammapaccayo duvidho sahajāto nānākkhaṇikoti. Tattha sahajāto atthipaccaye. Nānākkhaṇiko pana duvidho balavā dubbaloca. Tatthaca balavā duvidho akāliko kālikoca, tadubhayāpi upanissaye. Dubbalo pana visuṃ kammapaccayoyeva. Sabbo āhārapaccayo sabboca indriyapaccayo atthipaccaye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vippayuttapaccayo catubbidho sahajāto vatthupurejāto vatthārammaṇapurejāto pacchājātoti. Tattha purimā dve pacchimoca atthipaccaye. Tatīyo pana dvīsu ārammaṇatthi paccayesu. ",
      " So ce garukato hoti, upanissayepīti. Sesesu pana sattarasapaccayesu hetu, sahajāta, aññamañña, vipāka, jhāna, magga, sampayutta, avigatavasena aṭṭhapaccayā pacchā jātoca atthipaccaye. Anantara samanantara āsevana natthi vigata vasena pañcapaccayā upanissayeti. Iti sabbepi catuvīsatipaccayā sabhāgasaṅgahavasena saṃkhippamānā ārammaṇādīsu catūsu paccayesu samodhānaṃ gacchantīti."
    ],
    "innerText": "Vippayuttapaccayo catubbidho sahajāto vatthupurejāto vatthārammaṇapurejāto pacchājātoti. Tattha purimā dve pacchimoca atthipaccaye. Tatīyo pana dvīsu ārammaṇatthi paccayesu. So ce garukato hoti, upanissayepīti. Sesesu pana sattarasapaccayesu hetu, sahajāta, aññamañña, vipāka, jhāna, magga, sampayutta, avigatavasena aṭṭhapaccayā pacchā jātoca atthipaccaye. Anantara samanantara āsevana natthi vigata vasena pañcapaccayā upanissayeti. Iti sabbepi catuvīsatipaccayā sabhāgasaṅgahavasena saṃkhippamānā ārammaṇādīsu catūsu paccayesu samodhānaṃ gacchantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[236] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[236] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Tesu catūsu ekekasmiṃpi sabbe catuvīsatipaccayā samodhānaṃ gacchantīti iminā adhippāyena yaṃ vuttaṃ ‘‘nahi so kocipaccayoti’’ādi. Taṃ sabbaṃpi ācariyassa matimattameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[237]"
      },
      " Yañhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha"
      }
    ],
    "innerText": "[237] Yañhi tattha"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Nahi so kocipaccayo atthi. Yo cittacetasi kānaṃ ārammaṇabhāvaṃ nagaccheyyāti’’ vuttaṃ, taṃ tāva na yujjati. Nahi idha dhammasarūpamattena samodhānaṃ adhippetaṃ. Paccayaṭṭhena saheva adhippetaṃ. Naca hetādipaccayaṭṭho ārammaṇādipaccayaṭṭho hotīti. Esanayo ‘‘saka sakapaccayuppannassaca upanissayabhāvaṃ nagacchatīti’’ etthāpi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha pana yo sakasakapaccayuppannassa upanissayabhāvaṃ nagacchati. Nahi so koci paccayo atthīti yojanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[238]"
      },
      " Yañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha"
      }
    ],
    "innerText": "[238] Yañca tattha"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Kammahetukattāca lokappavattiyā phalahetūpacāra vasena sabbepi kammasabhāvaṃ nātivattantīti’’ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[239]"
      },
      " Yañca"
    ],
    "innerText": "[239] Yañca"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Teca paramatthato lokasammutivasenaca vijjamānā yevāti’’ vuttaṃ. Tadubhayaṃ pana sabbaso sāsanayutti yāpi viruddhamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etthā"
      },
      "ti ",
      " etasmiṃ paṭṭhānanaye. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbatthāpī"
      },
      "ti sabbesu saha jātasabhāgesu paccayesu. Yasmā pana paṭisandhiviññāṇaṃnāma nāmarūpānaṃ aññamaññapaṭibaddhaokāse cutiparicchinnassa sakalassa tassa tassa bhavassa sīsabhūtaṃ bījabhūtañca hoti. Yato sakalakāyabhūtassa nānārūpārūpasantānassa nibbatti hoti. Bījato viya mahārukkhassa. Yathāha –"
    ],
    "innerText": "Etthāti etasmiṃ paṭṭhānanaye. Sabbatthāpīti sabbesu saha jātasabhāgesu paccayesu. Yasmā pana paṭisandhiviññāṇaṃnāma nāmarūpānaṃ aññamaññapaṭibaddhaokāse cutiparicchinnassa sakalassa tassa tassa bhavassa sīsabhūtaṃ bījabhūtañca hoti. Yato sakalakāyabhūtassa nānārūpārūpasantānassa nibbatti hoti. Bījato viya mahārukkhassa. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Viññāṇañca hi ānanda mātukucchismiṃ na okkamissatha. Apinukho nāmarūpaṃ mātukucchismiṃ samuccissathāti. No hetaṃ bhante. Viññāṇañca hi ānanda mātukucchismiṃ okkamitvā vokkamissatha. Apinukho nāmarūpaṃ itthattāya abhinibbattissathāti. Nohetaṃ bhante. Viññāṇañca hi ānanda daharasseva sato vocchijjissatha kumārassavā kumārikāyavā. Apinukho nāmarūpaṃ vuddhiṃ viruḷhiṃ vepullaṃ āpajjissathāti. Nohetaṃ bhante. Tasmā hi ānanda eseva hetu esa nidānaṃ esa samudayo esa paccayo nāmarūpassa. Yadidaṃ viññāṇanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha samuccissathāti vaḍḍhissatha. Nāmarūpañhi viññāṇassa vaḍḍhiyevāti. Vokkamissathāti bhijjissatha. Itthatthāyāti īdisassa attabhāvassa atthāyāti attho. Vuddhiṃ viruḷhiṃ vepullanti pathamavayavasena vuddhiṃ. Majjhimavayavasena viruḷhiṃ. Pacchimavayavasena vepullanti aṭṭhakathāyaṃ vuttaṃ. Tasmā paṭisandhikkhaṇe rūpuppattiyā ekantena viññāṇapaccayatā veditabbā. Evaṃ uppannañca panetaṃ paṭisandhirūpaṃ puna sayaṃ tasmiṃ bhave yāva cutiyā pavattamānānaṃ sabbāsaṃ catusamuṭṭhānikarūpasantatīnaṃ sita bhūtaṃ bījabhūtañca hoti. Atibalavantaṃpi hi cittaṃ purimuppannāya rūpapaveṇiyā asati rūpaṃ janetuṃ nasakkoti. Evaṃ utu āhārāpīti. Tatoyeva hi arūpabhave kāmāvacarādīni rūpajanakacittānipi tattha rūpaṃ najanentīti. Asaññasattepi utu samuṭṭhānarūpasantatiyo pathamuppannāya kammajarūpasantatiyā vijja mānattāeva uppajjantīti. Vuttañhi vibhaṅgaṭīkāyaṃ arūpaṃ pana rūpassa okāso ",
      " na hotīti yasmiṃ rūpe sati cittaṃ aññaṃ rūpaṃ uppādeyya. Tadeva tattha natthīti attho. Purimarūpassāpi hi paccayabhāvo atthi puttassa pitisadisatādassanatoti. Etthaca puttassa pitisadisatādassanatoti etena imamatthaṃ dasseti. Yathā tiṇarukkhānaṃ bījabhāvasaṅkhātaṃ niyāmarūpaṃnāma atthi. Yassa ānubhāvena tannibbattātiṇarukkhā vaḍḍhantā yathāvā tathāvā avaḍḍhitvāattanā samānabījehieva tiṇarukkhehi sabbaso sadisā kāraṃ gahetvā vaḍḍhanti. Evamevaṃ gabbhaseyyakānaṃ sattānaṃ yoni bhāvasaṅkhātaṃ niyāma rūpaṃnāma atthi. Yassānubhāvena te samāna jātikehieva kulehi visesato mātāpitūhi eva sabbaso sadisarūpasaṇṭhānā honti. Iti bījaniyāmo viya yoniniyāmopi hoti. Soca paṭisandhirūpasseva ānubhāvoti veditabbo."
    ],
    "innerText": "Tattha samuccissathāti vaḍḍhissatha. Nāmarūpañhi viññāṇassa vaḍḍhiyevāti. Vokkamissathāti bhijjissatha. Itthatthāyāti īdisassa attabhāvassa atthāyāti attho. Vuddhiṃ viruḷhiṃ vepullanti pathamavayavasena vuddhiṃ. Majjhimavayavasena viruḷhiṃ. Pacchimavayavasena vepullanti aṭṭhakathāyaṃ vuttaṃ. Tasmā paṭisandhikkhaṇe rūpuppattiyā ekantena viññāṇapaccayatā veditabbā. Evaṃ uppannañca panetaṃ paṭisandhirūpaṃ puna sayaṃ tasmiṃ bhave yāva cutiyā pavattamānānaṃ sabbāsaṃ catusamuṭṭhānikarūpasantatīnaṃ sita bhūtaṃ bījabhūtañca hoti. Atibalavantaṃpi hi cittaṃ purimuppannāya rūpapaveṇiyā asati rūpaṃ janetuṃ nasakkoti. Evaṃ utu āhārāpīti. Tatoyeva hi arūpabhave kāmāvacarādīni rūpajanakacittānipi tattha rūpaṃ najanentīti. Asaññasattepi utu samuṭṭhānarūpasantatiyo pathamuppannāya kammajarūpasantatiyā vijja mānattāeva uppajjantīti. Vuttañhi vibhaṅgaṭīkāyaṃ arūpaṃ pana rūpassa okāso na hotīti yasmiṃ rūpe sati cittaṃ aññaṃ rūpaṃ uppādeyya. Tadeva tattha natthīti attho. Purimarūpassāpi hi paccayabhāvo atthi puttassa pitisadisatādassanatoti. Etthaca puttassa pitisadisatādassanatoti etena imamatthaṃ dasseti. Yathā tiṇarukkhānaṃ bījabhāvasaṅkhātaṃ niyāmarūpaṃnāma atthi. Yassa ānubhāvena tannibbattātiṇarukkhā vaḍḍhantā yathāvā tathāvā avaḍḍhitvāattanā samānabījehieva tiṇarukkhehi sabbaso sadisā kāraṃ gahetvā vaḍḍhanti. Evamevaṃ gabbhaseyyakānaṃ sattānaṃ yoni bhāvasaṅkhātaṃ niyāma rūpaṃnāma atthi. Yassānubhāvena te samāna jātikehieva kulehi visesato mātāpitūhi eva sabbaso sadisarūpasaṇṭhānā honti. Iti bījaniyāmo viya yoniniyāmopi hoti. Soca paṭisandhirūpasseva ānubhāvoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica, ayaṃ yoniniyāmonāma kalalakālādīsu puttānaṃ sarīresu mātāpitūhi samudāgataṃ utujarūpasantānaṃeva. Yassa ānubhāvena taṃsantānaṃ samānajātikasattasaṇṭhānasadisaṃ attano ñātikulasadisañca hoti. Yathāhiitthibhāvādirūpaṃ sattānaṃ itthiliṅgādīni bījarūpañca tiṇarukkhānaṃ taṃtaṃvaṇṇasaṇṭhānā dīni niyāmeti. Evaṃ yonirūpaṃ nānājātivasena sattānaṃ niyāmakaṃ vavatthāpakaṃ hotīti. Ettāvatā pavattiyaṃ thapetvā cittajarūpaṃ sabbesaṃ tisamuṭṭhānikarūpānaṃ uppattiyā cittanirapekkhatā purimuppanna rūpapaveṇi paṭibaddhatāca sādhitā hoti. Tenevaca tesaṃ cittassa ṭhitibhaṅgakkhaṇesupi cittarahite nirodhasamāpatti kālepi uppatti hotīti. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahajātarūpanti panetthā"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itī"
      },
      "tiādi nigamanaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sambhavaṃ"
      },
      "ti yathā sambhavaṃ. Sambhavātivā sambhūtā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhattañcā"
      },
      "ti ajjhattabhūtāca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahiddhācā"
      },
      "ti bahiddhābhūtāca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhatā"
      },
      "ti saṅkhatabhūtā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaṅkhatā"
      },
      "ti asaṅkhatabhūtā. Evaṃ tekālikāca kālamuttāca ajjhattabahiddhā sambhūtāca. Tathā saṅkhatāsaṅkhatabhūtāca paññatti nāmarūpānaṃ vasena tividhā ṭhitā dhammā paṭṭhāne sabbathā catuvīsati paccayānāma ",
      " hontīti yojanā. Etthaca tividhā ṭhitānaṃ dhammānaṃ tekālikādibhāve sati catuvīsatipaccayānaṃpi yathāsambhavaṃ tekālikādibhedo siddho hoti. Tattha ārammaṇaadhipati upanissayapaccayā tekālikā kālamuttāca honti."
    ],
    "innerText": "Apica, ayaṃ yoniniyāmonāma kalalakālādīsu puttānaṃ sarīresu mātāpitūhi samudāgataṃ utujarūpasantānaṃeva. Yassa ānubhāvena taṃsantānaṃ samānajātikasattasaṇṭhānasadisaṃ attano ñātikulasadisañca hoti. Yathāhiitthibhāvādirūpaṃ sattānaṃ itthiliṅgādīni bījarūpañca tiṇarukkhānaṃ taṃtaṃvaṇṇasaṇṭhānā dīni niyāmeti. Evaṃ yonirūpaṃ nānājātivasena sattānaṃ niyāmakaṃ vavatthāpakaṃ hotīti. Ettāvatā pavattiyaṃ thapetvā cittajarūpaṃ sabbesaṃ tisamuṭṭhānikarūpānaṃ uppattiyā cittanirapekkhatā purimuppanna rūpapaveṇi paṭibaddhatāca sādhitā hoti. Tenevaca tesaṃ cittassa ṭhitibhaṅgakkhaṇesupi cittarahite nirodhasamāpatti kālepi uppatti hotīti. Tena vuttaṃ sahajātarūpanti panetthātiādi. Itītiādi nigamanaṃ. Tattha sambhavaṃti yathā sambhavaṃ. Sambhavātivā sambhūtā. Ajjhattañcāti ajjhattabhūtāca. Bahiddhācāti bahiddhābhūtāca. Saṅkhatāti saṅkhatabhūtā. Asaṅkhatāti asaṅkhatabhūtā. Evaṃ tekālikāca kālamuttāca ajjhattabahiddhā sambhūtāca. Tathā saṅkhatāsaṅkhatabhūtāca paññatti nāmarūpānaṃ vasena tividhā ṭhitā dhammā paṭṭhāne sabbathā catuvīsati paccayānāma hontīti yojanā. Etthaca tividhā ṭhitānaṃ dhammānaṃ tekālikādibhāve sati catuvīsatipaccayānaṃpi yathāsambhavaṃ tekālikādibhedo siddho hoti. Tattha ārammaṇaadhipati upanissayapaccayā tekālikā kālamuttāca honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[240] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[240] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Ārammaṇaadhipatiupanissayapaccayānaṃ tikālikānanti’’ vuttaṃ. Taṃ na yujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paññattinibbānānaṃpi kālamuttānaṃ tesu paviṭṭhattāti. Tattha imasmiṃ bhave abhinavānaṃ dhanadhaññabhogānaṃvā vijjāsippasutapari yattīnaṃvā sīlasamādhipaññānaṃvā bhavantare bhavasampattibhoga sampatti maggaphalasampattīnaṃvā paṭilābhatthāya pubbayogaṃ karontassa anāgatānaṃ tāsaṃ upanissayapaccayatā veditabbā. Paṭṭhāne pana anāgataṃ cakkhusampadaṃ patthayamāno sota, ghāna, jivhā, kāyasampadaṃ, vaṇṇasampadaṃ, sadda, gandha, rasa, phoṭṭhabbasampadaṃ patthayamāno anāgate khandhe patthayamāno dānaṃ deti sīlaṃ samādiyatītiādinā bhavantarapariyāpannāeva sampattiyo vuttā. Tā pana dānādīnaṃ kammānaṃ anurūpavasena vuttāti daṭṭhabbā. Kammapaccayo pana paccuppannātītavasena dvikāliko. Anantara samanantara āsevana natthi vigata paccayā atītakālikā. Sesā pannarasa paccayā paccuppannakālikāti. Ajjhattabahiddhāduke ārammaṇā dhipati sahajāta aññamañña nissaya upanissaya purejāta āhāra atthi avigatā ajjhattabahiddhā honti. Sesā cuddasa paccayā ajjhattāva. Ārammaṇa adhipati upanissayā saṅkhatā asaṅkhatāca honti. Sesā saṅkhatāvāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcavidhaṃpiarūpa"
      },
      "nti pavuccati. Kasmā, kadācipi rūpasaṅkhātaṃ saṇṭhānatthaṃ anupagamanato nāmantica pavuccati. Kasmā, adhivacanasaṅkhātanāmābhidhānavaseneva suṇantehi gahetabbabhāvupagamanatoti."
    ],
    "innerText": "Paññattinibbānānaṃpi kālamuttānaṃ tesu paviṭṭhattāti. Tattha imasmiṃ bhave abhinavānaṃ dhanadhaññabhogānaṃvā vijjāsippasutapari yattīnaṃvā sīlasamādhipaññānaṃvā bhavantare bhavasampattibhoga sampatti maggaphalasampattīnaṃvā paṭilābhatthāya pubbayogaṃ karontassa anāgatānaṃ tāsaṃ upanissayapaccayatā veditabbā. Paṭṭhāne pana anāgataṃ cakkhusampadaṃ patthayamāno sota, ghāna, jivhā, kāyasampadaṃ, vaṇṇasampadaṃ, sadda, gandha, rasa, phoṭṭhabbasampadaṃ patthayamāno anāgate khandhe patthayamāno dānaṃ deti sīlaṃ samādiyatītiādinā bhavantarapariyāpannāeva sampattiyo vuttā. Tā pana dānādīnaṃ kammānaṃ anurūpavasena vuttāti daṭṭhabbā. Kammapaccayo pana paccuppannātītavasena dvikāliko. Anantara samanantara āsevana natthi vigata paccayā atītakālikā. Sesā pannarasa paccayā paccuppannakālikāti. Ajjhattabahiddhāduke ārammaṇā dhipati sahajāta aññamañña nissaya upanissaya purejāta āhāra atthi avigatā ajjhattabahiddhā honti. Sesā cuddasa paccayā ajjhattāva. Ārammaṇa adhipati upanissayā saṅkhatā asaṅkhatāca honti. Sesā saṅkhatāvāti. Pañcavidhaṃpiarūpanti pavuccati. Kasmā, kadācipi rūpasaṅkhātaṃ saṇṭhānatthaṃ anupagamanato nāmantica pavuccati. Kasmā, adhivacanasaṅkhātanāmābhidhānavaseneva suṇantehi gahetabbabhāvupagamanatoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "169"
      },
      ". Paññapīyatīti paññatti. Ayaṃpi eko vacanatthoti lokiyamahājanehi thapīyati. Voharīyati ceva sampaṭicchī yaticāti ",
      " attho. Yokoci sammutisaccabhūto byañjanattho. Tathā paññāpetabbā atthā paññapīyanti etāyāti paññatti. Byañjanatthajotako paññattisaddoti evaṃ duvidhā paññattīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatoavasesā.La. Duvidhāhotī"
      },
      "ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāpīyattā paññattī"
      },
      "ti attha paññattimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāpanatopaññattī"
      },
      "ti saddapaññattiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃtaṃbhūtavipariṇāmākāra"
      },
      "nti pathaviyādīnaṃ tesaṃ tesaṃ mahābhūtānaṃ adhimattabhāvappakārasaṅkhātaṃ tathā tathā pariṇā mākāraṃ. Pavattivisesākāranti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upādāyā"
      },
      "ti paṭicca. Nissāya. Pathamaṃ cittena gahetvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathātathā paññattā"
      },
      "ti ayaṃ pathavīnāma ayaṃ pabbatonāmāti evamādi nayena mahājanena paññattā, kathitā, voharitāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pathavipabbatādikā"
      },
      "tiādisaddena nadi samuddādikāyo saṅgaṇhati. Ayaṃ samūhapaññattināma."
    ],
    "innerText": "169. Paññapīyatīti paññatti. Ayaṃpi eko vacanatthoti lokiyamahājanehi thapīyati. Voharīyati ceva sampaṭicchī yaticāti attho. Yokoci sammutisaccabhūto byañjanattho. Tathā paññāpetabbā atthā paññapīyanti etāyāti paññatti. Byañjanatthajotako paññattisaddoti evaṃ duvidhā paññattīti vuttaṃ tatoavasesā.La. Duvidhāhotīti. Tattha paññāpīyattā paññattīti attha paññattimāha. Paññāpanatopaññattīti saddapaññattiṃ. Taṃtaṃbhūtavipariṇāmākāranti pathaviyādīnaṃ tesaṃ tesaṃ mahābhūtānaṃ adhimattabhāvappakārasaṅkhātaṃ tathā tathā pariṇā mākāraṃ. Pavattivisesākāranti attho. Upādāyāti paṭicca. Nissāya. Pathamaṃ cittena gahetvāti attho. Tathātathā paññattāti ayaṃ pathavīnāma ayaṃ pabbatonāmāti evamādi nayena mahājanena paññattā, kathitā, voharitāti attho. Pathavipabbatādikātiādisaddena nadi samuddādikāyo saṅgaṇhati. Ayaṃ samūhapaññattināma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[241] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[241] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Saṇṭhānapaññattīti’’ vuttā. Sā yuttā viya nadissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nahi idha saṇṭhānaṃ padhānaṃ hotīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sambhārasannivesākāra"
      },
      "nti kaṭṭhādīnaṃ sambhārānaṃ tathā tathā sannivesākāraṃ. Etthāpi ādisaddena nāvādayo saṅgaṇhati. Ayaṃ saṇṭhāna paññatti. Kaṭṭhādayo eva hi gehākārena saṇṭhitā gehanti rathākārena saṇṭhitā rathoti vuccantīti."
    ],
    "innerText": "Nahi idha saṇṭhānaṃ padhānaṃ hotīti. Sambhārasannivesākāranti kaṭṭhādīnaṃ sambhārānaṃ tathā tathā sannivesākāraṃ. Etthāpi ādisaddena nāvādayo saṅgaṇhati. Ayaṃ saṇṭhāna paññatti. Kaṭṭhādayo eva hi gehākārena saṇṭhitā gehanti rathākārena saṇṭhitā rathoti vuccantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[242] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[242] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Samūhapaññattīti’’ vuttaṃ. Taṃ na yujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nahi idha samūho padhānanti. Purisapuggalādikā sattapaññatti upādāpaññattītipi vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Candāvaṭṭanādika"
      },
      "nti candasūriyādīnaṃ sineruṃ padakkhiṇaṃ katvā āvaṭṭanādikaṃ. Yato candimasūriyā udenti, sā pubbadisānāma. Pubbataraṃ laddhappakāsattā. Yattha pana atthaṃ gacchanti, sā pacchimadisānāma. Pacchāladdhapakāsattā. Tāsaṃ dakkhiṇapassā disā vuḍḍhiatthena dakkhiṇadisānāma. Itarā pana uccataraṭṭhena uttarādisāti vuccati. Yadā sūriyo udeti, tadā sakalassa ",
      " ahassa pubbabhāgattā pubbanhoti vuccatīti. Evamādikā disā paññatti kālapaññattiyonāma. Ādisaddena thalaninnādikā desapaññatti saṅgahitāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asamphuṭṭhākāranti"
      },
      " mahābhūtānaṃ aññamaññaṃ asamphusanākāraṃ. Ayaṃ ākāsapaññattināma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ taṃ bhūtanimitta"
      },
      "nti pathavīkasiṇādikaṃ uddhumātakādikañca bhūtanimittaṃ. Nīlakasiṇādikaṃ vaṇṇanimittañca ettheva saṅgayhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvanā visesa"
      },
      "nti parikammādikaṃ bhāvanāvisesaṃca. Etena parikammanimitta uggahanimitta paṭibhāganimittānaṃ siddhakāraṇaṃ vadati. Ayaṃ nimittapaññattināma."
    ],
    "innerText": "Nahi idha samūho padhānanti. Purisapuggalādikā sattapaññatti upādāpaññattītipi vuccati. Candāvaṭṭanādikanti candasūriyādīnaṃ sineruṃ padakkhiṇaṃ katvā āvaṭṭanādikaṃ. Yato candimasūriyā udenti, sā pubbadisānāma. Pubbataraṃ laddhappakāsattā. Yattha pana atthaṃ gacchanti, sā pacchimadisānāma. Pacchāladdhapakāsattā. Tāsaṃ dakkhiṇapassā disā vuḍḍhiatthena dakkhiṇadisānāma. Itarā pana uccataraṭṭhena uttarādisāti vuccati. Yadā sūriyo udeti, tadā sakalassa ahassa pubbabhāgattā pubbanhoti vuccatīti. Evamādikā disā paññatti kālapaññattiyonāma. Ādisaddena thalaninnādikā desapaññatti saṅgahitāti. Asamphuṭṭhākāranti mahābhūtānaṃ aññamaññaṃ asamphusanākāraṃ. Ayaṃ ākāsapaññattināma. Taṃ taṃ bhūtanimittanti pathavīkasiṇādikaṃ uddhumātakādikañca bhūtanimittaṃ. Nīlakasiṇādikaṃ vaṇṇanimittañca ettheva saṅgayhati. Bhāvanā visesanti parikammādikaṃ bhāvanāvisesaṃca. Etena parikammanimitta uggahanimitta paṭibhāganimittānaṃ siddhakāraṇaṃ vadati. Ayaṃ nimittapaññattināma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evamādibhedā"
      },
      "ti ettha ādisaddena aṭṭhakathāyaṃ āgatā upādāpaññatti upanidhāpaññattiādayo saṅgahitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paramatthato avijjamānāpī"
      },
      "ti etena sammutito laddhabhāvaṃ dasseti. Teneva hi tāsaṃ vijjamānabhāvaṃ gahetvā tathā tathā voharantānaṃ musāvādonāma nahotīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthacchāyākārenā"
      },
      "ti taṃ taṃ bhūtādīnaṃ paramatthānaṃ samūhasaṇṭhānādichāyākārena. Atthacchā yākārenātivā saddābhidheyyasaṅkhātena dabbapaṭibimbākārena saviggahākārenāti attho, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṃtaṃupādāyā"
      },
      "ti paramatthadhammānaṃ taṃtaṃpavattivisesaṃ upādāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upanidhāyā"
      },
      "ti olumbiya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parikappiyamānā"
      },
      "ti parikappabuddhiyā parikappetvā gayhamānā. Ettha pana evamādipabhedā ālambaṇabhūtā parikappiyamānā sabbā paññatti paññāpīyatīti atthena paññattīti yojanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhāyatī"
      },
      "ti gaṇīyati. Gaṇanupagaṃ katvā thapīyatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaññāyatī"
      },
      "ti sammannīyati. Nāmaṃ, nāmakammaṃ, nāmadheyyaṃ, nirutti, byañjanaṃ, abhilāpoti ime cha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāma nāmakammā"
      },
      ". Tattha atthe namatīti nāmaṃ. Atthavisayaṃ eva hutvā pavattatīti attho. Attanica atthaṃ nāmetīti nāmaṃ. Piṭakattayasaṅkhāte hi nāme sati taduggaṇhantānaṃ sabbe tadatthā padepade vākyevākye āgacchanti yevāti."
    ],
    "innerText": "Evamādibhedāti ettha ādisaddena aṭṭhakathāyaṃ āgatā upādāpaññatti upanidhāpaññattiādayo saṅgahitā. Paramatthato avijjamānāpīti etena sammutito laddhabhāvaṃ dasseti. Teneva hi tāsaṃ vijjamānabhāvaṃ gahetvā tathā tathā voharantānaṃ musāvādonāma nahotīti. Atthacchāyākārenāti taṃ taṃ bhūtādīnaṃ paramatthānaṃ samūhasaṇṭhānādichāyākārena. Atthacchā yākārenātivā saddābhidheyyasaṅkhātena dabbapaṭibimbākārena saviggahākārenāti attho, taṃtaṃupādāyāti paramatthadhammānaṃ taṃtaṃpavattivisesaṃ upādāya. Upanidhāyāti olumbiya. Parikappiyamānāti parikappabuddhiyā parikappetvā gayhamānā. Ettha pana evamādipabhedā ālambaṇabhūtā parikappiyamānā sabbā paññatti paññāpīyatīti atthena paññattīti yojanā. Saṅkhāyatīti gaṇīyati. Gaṇanupagaṃ katvā thapīyatīti attho. Samaññāyatīti sammannīyati. Nāmaṃ, nāmakammaṃ, nāmadheyyaṃ, nirutti, byañjanaṃ, abhilāpoti ime cha nāma nāmakammā. Tattha atthe namatīti nāmaṃ. Atthavisayaṃ eva hutvā pavattatīti attho. Attanica atthaṃ nāmetīti nāmaṃ. Piṭakattayasaṅkhāte hi nāme sati taduggaṇhantānaṃ sabbe tadatthā padepade vākyevākye āgacchanti yevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica suṇantānaṃ ñāṇaṃ taṃtaṃatthābhimukhaṃ nāmetīti nāmaṃ nāmagahaṇavasena kattabbattā nāmameva kammanti nāmakammaṃ. Dhīyati dhārīyatīti ",
      " dheyyaṃ. Nāmameva dheyyanti nāmadheyyaṃ. Aviditapakkhe ṭhito attho etāya tato nīharitvā vuccati kathīyatīti nirutti. Atthassa byañjanato pākaṭakaraṇato byañjanaṃ. Abhibyattaṃ katvā lapīyati kathīyati attho etenāti abhilāpo. Etthaca vaṇṇapaññatti, akkharapaññatti, sarapaññatti, dīghapaññatti, rassa paññatti. Byañjanavaggaghosāghosapaññatti, liṅgapaññatti. Padapaññatti, vākyapaññattiyopi etasseva pabhedāti daṭṭhabbā. Paramatthato vijjamānesu atthesu pavattā paññatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijjamānapaññatti"
      },
      " nāma. Avijja mānesu bhūmipabbatādīsu pavattā paññatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avijjamānapaññatti"
      },
      " nāma. Etā eva samāsaṭṭhānaṃ patvā dvipadasaṃyogavasena itarā catassopi hontīti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatthā"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etāya paññāpentī"
      },
      "ti etena vijjamānaṃ atthaṃ paññapenti etāyāti vijjamānapaññattīti imamatthaṃ vadati. Esanayo paratthapi. Cha abhiññā assāti chaḷabhiññoti katvā visesanabhūtānaṃ channaṃ abhiññānaṃ vijjamānattā visesitabbabhūtassa puggalassa avijjamānattā chaḷa bhiññoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijjamānenaavijjamānapaññatti"
      },
      " nāma. Itthī avijjamānā saddo vijjamānoti itthiyāsaddo itthisaddoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avijjamānena vijjamāna paññatti"
      },
      " nāma. Cakkhuca cakkhuviññāṇañca ubhayaṃpi vijjāmānanti cakkhusmiṃ viññāṇaṃ cakkhuviññāṇanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijjamānenavijjamānapaññatti"
      },
      " nāma. Rājāca puttoca dvepi avijjamānāevāti rañño putto rājaputtoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avijjamānenaavijjamānapaññatti"
      },
      "nāmāti imamatthaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ubhinna"
      },
      "ntiādimāha."
    ],
    "innerText": "Apica suṇantānaṃ ñāṇaṃ taṃtaṃatthābhimukhaṃ nāmetīti nāmaṃ nāmagahaṇavasena kattabbattā nāmameva kammanti nāmakammaṃ. Dhīyati dhārīyatīti dheyyaṃ. Nāmameva dheyyanti nāmadheyyaṃ. Aviditapakkhe ṭhito attho etāya tato nīharitvā vuccati kathīyatīti nirutti. Atthassa byañjanato pākaṭakaraṇato byañjanaṃ. Abhibyattaṃ katvā lapīyati kathīyati attho etenāti abhilāpo. Etthaca vaṇṇapaññatti, akkharapaññatti, sarapaññatti, dīghapaññatti, rassa paññatti. Byañjanavaggaghosāghosapaññatti, liṅgapaññatti. Padapaññatti, vākyapaññattiyopi etasseva pabhedāti daṭṭhabbā. Paramatthato vijjamānesu atthesu pavattā paññatti vijjamānapaññatti nāma. Avijja mānesu bhūmipabbatādīsu pavattā paññatti avijjamānapaññatti nāma. Etā eva samāsaṭṭhānaṃ patvā dvipadasaṃyogavasena itarā catassopi hontīti dassetuṃ tatthātiādi vuttaṃ. Etāya paññāpentīti etena vijjamānaṃ atthaṃ paññapenti etāyāti vijjamānapaññattīti imamatthaṃ vadati. Esanayo paratthapi. Cha abhiññā assāti chaḷabhiññoti katvā visesanabhūtānaṃ channaṃ abhiññānaṃ vijjamānattā visesitabbabhūtassa puggalassa avijjamānattā chaḷa bhiññoti vijjamānenaavijjamānapaññatti nāma. Itthī avijjamānā saddo vijjamānoti itthiyāsaddo itthisaddoti avijjamānena vijjamāna paññatti nāma. Cakkhuca cakkhuviññāṇañca ubhayaṃpi vijjāmānanti cakkhusmiṃ viññāṇaṃ cakkhuviññāṇanti vijjamānenavijjamānapaññatti nāma. Rājāca puttoca dvepi avijjamānāevāti rañño putto rājaputtoti avijjamānenaavijjamānapaññattināmāti imamatthaṃ dassento ubhinnantiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha pana vacanato ca vacanatthatoca vinimuttā saddasabhāvā nāmapaññattināma visuṃ natthīti vadanti. Taṃ na yujjati. Atthajotaka bhāvena visuṃ siddhattā. Saddo hi nāma akkharapadabyañjanabhāvaṃ upagatoyeva atthajotane samattho hoti. Paramattha saddoca khaṇiko cuṇṇavicuṇṇabhūto tabbhāvaṃ upagato nahotīti. Tasmā saddasabhāvānāma paññattināma visuṃ atthiyeva. Atthibhāvocassā vacanasaddaṃ sutvā anantare akkhara pada byañjanagocaracittassa tadanantareca tadatthavijānanacittassa pavattiyā pākaṭoti ",
      " dassento gāthādvayaṃ āha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vacīghosā nusārenā"
      },
      "ti uccāriyamānasaddasaṅkhātassa vacīghosassa ārammaṇakaraṇasaṅkhātena anusārena uppannāya sotaviññāṇa vīthiyā pavattiyā anantare uppannassa manodvārassa gocara bhūtā sāyaṃ paññattīti sambandho. Kīdisī pana sāyaṃ paññattīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthāyassā.La. Tatopara"
      },
      "nti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatopara"
      },
      "nti tato nāmapaññattārammaṇassa manodvārassa uppattito paraṃ atthā viññāyantīti sambandho. Yassā nāmapaññattiyā anusārena paramatthapaññattibhūtā atthā viññāyanti. Sā ayaṃ paññatti lokasaṅketanimmitāti viññeyyāti yojanā."
    ],
    "innerText": "Ettha pana vacanato ca vacanatthatoca vinimuttā saddasabhāvā nāmapaññattināma visuṃ natthīti vadanti. Taṃ na yujjati. Atthajotaka bhāvena visuṃ siddhattā. Saddo hi nāma akkharapadabyañjanabhāvaṃ upagatoyeva atthajotane samattho hoti. Paramattha saddoca khaṇiko cuṇṇavicuṇṇabhūto tabbhāvaṃ upagato nahotīti. Tasmā saddasabhāvānāma paññattināma visuṃ atthiyeva. Atthibhāvocassā vacanasaddaṃ sutvā anantare akkhara pada byañjanagocaracittassa tadanantareca tadatthavijānanacittassa pavattiyā pākaṭoti dassento gāthādvayaṃ āha. Tattha vacīghosā nusārenāti uccāriyamānasaddasaṅkhātassa vacīghosassa ārammaṇakaraṇasaṅkhātena anusārena uppannāya sotaviññāṇa vīthiyā pavattiyā anantare uppannassa manodvārassa gocara bhūtā sāyaṃ paññattīti sambandho. Kīdisī pana sāyaṃ paññattīti āha atthāyassā.La. Tatoparanti. Tattha tatoparanti tato nāmapaññattārammaṇassa manodvārassa uppattito paraṃ atthā viññāyantīti sambandho. Yassā nāmapaññattiyā anusārena paramatthapaññattibhūtā atthā viññāyanti. Sā ayaṃ paññatti lokasaṅketanimmitāti viññeyyāti yojanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Etthaca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sotaviññāṇavīthiyā"
      },
      "ti ettha atītasaddamattā rammaṇā tadanuvattikānāma manoviññāṇavīthipi saṅgahitāti daṭṭhabbā. Vuttañhi sāratthadīpaniyaṃ-tena vuttavacane yattakāni akkharāni honti. Tesu ekamekaṃ paccuppannaṃ atītañca gahetvā sota viññāṇavīthiyā manoviññāṇavīthiyāca uppajjitvā niruddhāya avasāne tāni akkharāni sampiṇḍetvā akkharasamūhaṃ gahetvā ekā manoviññāṇavīthi uppajjitvā nirujjhati. Tadanantaraṃ ayaṃ akkharasamūho etassa nāmanti nāmapaññattigahaṇavasena aparāya manoviññāṇa vīthiyā uppajjitvā niruddhāya tadanantaraṃ uppannāya manoviññāṇa vīthiyā ayametassa atthoti pakatiyā tadatthavijānanaṃ sambhavatīti. Maṇisāramañjūsāyaṃ pana tadanuvattikavīthito paraṃ ekaṃ vinicchayavīthiṃ viññattigahaṇavīthiñca vadati. Tato paraṃ ekakkhare sadde ekatthajotikāya nāmapaññattiyā gahaṇaṃ hoti. Yā vadantassa pubbabhāge manasā vavatthāpito paññattisaddonāma vuccati. Tatoparaṃ tadatthagahaṇanti. Īdisesu pana ṭhānesu tattha tattha javanavīthivārānaṃ paṭipāṭikathanaṃnāma padhānapākaṭagahaṇavasenevāti daṭṭhabbaṃ. Ekaccharakkhaṇe aneka koṭisatasahassāni cittāni uppajjantīti hi vuttaṃ. Tathā –"
    ],
    "innerText": "Etthaca sotaviññāṇavīthiyāti ettha atītasaddamattā rammaṇā tadanuvattikānāma manoviññāṇavīthipi saṅgahitāti daṭṭhabbā. Vuttañhi sāratthadīpaniyaṃ-tena vuttavacane yattakāni akkharāni honti. Tesu ekamekaṃ paccuppannaṃ atītañca gahetvā sota viññāṇavīthiyā manoviññāṇavīthiyāca uppajjitvā niruddhāya avasāne tāni akkharāni sampiṇḍetvā akkharasamūhaṃ gahetvā ekā manoviññāṇavīthi uppajjitvā nirujjhati. Tadanantaraṃ ayaṃ akkharasamūho etassa nāmanti nāmapaññattigahaṇavasena aparāya manoviññāṇa vīthiyā uppajjitvā niruddhāya tadanantaraṃ uppannāya manoviññāṇa vīthiyā ayametassa atthoti pakatiyā tadatthavijānanaṃ sambhavatīti. Maṇisāramañjūsāyaṃ pana tadanuvattikavīthito paraṃ ekaṃ vinicchayavīthiṃ viññattigahaṇavīthiñca vadati. Tato paraṃ ekakkhare sadde ekatthajotikāya nāmapaññattiyā gahaṇaṃ hoti. Yā vadantassa pubbabhāge manasā vavatthāpito paññattisaddonāma vuccati. Tatoparaṃ tadatthagahaṇanti. Īdisesu pana ṭhānesu tattha tattha javanavīthivārānaṃ paṭipāṭikathanaṃnāma padhānapākaṭagahaṇavasenevāti daṭṭhabbaṃ. Ekaccharakkhaṇe aneka koṭisatasahassāni cittāni uppajjantīti hi vuttaṃ. Tathā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ekamatto bhave rasso, dvimatto dīghamuccate;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Timattotupluto ñeyyo, byañjanaṃ addhamattikanticaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na ca paramatthasaddasaṅghāṭānaṃ satasahassaṃpi ekakkharaṃnāma bhavituṃ pahoti. Tasmā idha bahuṃ vicāraṇā amhehi nakatāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti paramatthadīpaniyānāma abhidhammatthasaṅgahassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catutthavaṇṇanāya aṭṭhamassa paccayasaṅgahassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paramatthadīpanā niṭṭhitā."
  }
]