[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Samuccaya saṅgaha paramatthadīpanī"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "162"
      },
      ". Evaṃ ",
      " chahi paricchedehi cattāro paramatthe dassetvā idāni tesaṃ taṃtaṃrāsisaṅkhātaṃ samuccayaṃ dassento ādigātha māha. Ye salakkhaṇā dvāsattatividhā vatthudhammā mayā vuttā. Idāni tesaṃ samuccayaṃ yathāyogaṃ pavakkhāmīti yojanā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "salakkhaṇāvatthudhammā"
      },
      "ti padehi dasavidhāni anipphannarūpāni paṭikkhipati. Na hi tāni attano āvenikabhūtena sabhāva lakkhaṇena aniccatādi sāmaññalakkhaṇenaca salakkhaṇāni honti. Ekantaparamatthatāya abhāvato. Tatoyevaca vatthudhammāca nahonti. Sarūpato anupalabbhamānattā. Dabbavācako hi idha vatthusaddo. Dabbañcanāma idha sarūpato labbhamāno sabhāvo eva. Etena nibbānassapi maggaphala paccavekkhanañāṇesu sarūpato labbhamāna sabhāvatā vuttā hoti. Anipphannarūpānaṃ viya ca vatthudhamma sannissayena dissamānadhammamattabhāvaṃ vā paññattidhammānaṃ viya parikappitākāramattabhāvaṃvā sasavisāṇa kacchapalomādīnaṃ viya sabbaso abhūta parikappita mattabhāvaṃvā nivāretīti veditabbaṃ. Etthaca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvāsattatividhāsalakkhaṇāvatthudhammā"
      },
      "ti vacane payojanaṃ nadissati. Tesu hi dvāsattatividhesu ekacce eva dhammā purimesu tīsu saṅgahesu āgatā. Pacchimeca sabbasaṅgahe anipphannarūpānipi adhippetānievāti. Etthaca vatthudhammāsalakkhaṇāti padehi anipphannarūpānaṃ salakkhaṇatā paṭikkhipane yaṃ vattabbaṃ. Taṃ rūpasamuddesa dīpaniyaṃ vuttamevāti. Ekantākusalajātiyānaṃ āsava catukkādīnaṃ saṅgaho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akusalasaṅgaho,"
      },
      " na akusala sampayuttattāyeva akusalabhūtānaṃ cittaphassādīnanti. Kusalā kusalābyākatamissakānaṃ saṅgaho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "missakasaṅgaho"
      },
      "."
    ],
    "innerText": "162. Evaṃ chahi paricchedehi cattāro paramatthe dassetvā idāni tesaṃ taṃtaṃrāsisaṅkhātaṃ samuccayaṃ dassento ādigātha māha. Ye salakkhaṇā dvāsattatividhā vatthudhammā mayā vuttā. Idāni tesaṃ samuccayaṃ yathāyogaṃ pavakkhāmīti yojanā. Tattha salakkhaṇāvatthudhammāti padehi dasavidhāni anipphannarūpāni paṭikkhipati. Na hi tāni attano āvenikabhūtena sabhāva lakkhaṇena aniccatādi sāmaññalakkhaṇenaca salakkhaṇāni honti. Ekantaparamatthatāya abhāvato. Tatoyevaca vatthudhammāca nahonti. Sarūpato anupalabbhamānattā. Dabbavācako hi idha vatthusaddo. Dabbañcanāma idha sarūpato labbhamāno sabhāvo eva. Etena nibbānassapi maggaphala paccavekkhanañāṇesu sarūpato labbhamāna sabhāvatā vuttā hoti. Anipphannarūpānaṃ viya ca vatthudhamma sannissayena dissamānadhammamattabhāvaṃ vā paññattidhammānaṃ viya parikappitākāramattabhāvaṃvā sasavisāṇa kacchapalomādīnaṃ viya sabbaso abhūta parikappita mattabhāvaṃvā nivāretīti veditabbaṃ. Etthaca dvāsattatividhāsalakkhaṇāvatthudhammāti vacane payojanaṃ nadissati. Tesu hi dvāsattatividhesu ekacce eva dhammā purimesu tīsu saṅgahesu āgatā. Pacchimeca sabbasaṅgahe anipphannarūpānipi adhippetānievāti. Etthaca vatthudhammāsalakkhaṇāti padehi anipphannarūpānaṃ salakkhaṇatā paṭikkhipane yaṃ vattabbaṃ. Taṃ rūpasamuddesa dīpaniyaṃ vuttamevāti. Ekantākusalajātiyānaṃ āsava catukkādīnaṃ saṅgaho akusalasaṅgaho, na akusala sampayuttattāyeva akusalabhūtānaṃ cittaphassādīnanti. Kusalā kusalābyākatamissakānaṃ saṅgaho missakasaṅgaho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bodhi vuccati catūsu maggesu ñāṇaṃ, bujjhanti etāyāti katvā. Bodhiyā pakkhā bodhipakkhā. Bodhisambhārāti attho. Bodhi pakkhesu bhavā ",
      " antogadhāti bodhipakkhiyā. Tesaṃ saṅgahoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bodhipakkhiyasaṅgaho"
      },
      ". Sabbesaṃ anavasesānaṃ paramatthadhammānaṃ saṅgaho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbasaṅgaho"
      },
      ". Cirapārivāsiyaṭṭhena madaniyaṭṭhenaca āsava sadisattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āsavā"
      },
      ". Yadica tadubhayaṭṭhena āsavānāma siyuṃ. Ime lobhādayo eva āsavānāma siyuṃ. Pupphāsavādayo hi loke cha pañca rattimattaṃ vā sattaṭṭharattimattaṃ vā sayaṃpi kumbhesu parivāsaṃ gaṇhanti. Kumbheca parivāsaṃ gāhāpenti. Ime pana anamatagge saṃsāre sayaṃpi sattasantāne parivāsaṃ gaṇhanti. Sattasantānañca parivāsaṃ gāhāpenti. Sakalaṃ sattasantānaṃ sadā āsavapūritameva hoti. Yathāha-cakkhuṃ loke piyarūpaṃ sātarūpaṃ etthesā taṇhā uppajjamānā uppajjati. Ettha nivīsamānā nivīsatītiādi. Tattha esā taṇhā pariyuṭṭhānavasena uppajjamānā ettheva uppajjati. Uppajjitvāca puna anusayabhāvena parivāsaṃ katvā nivīsamānā ettheva nivīsatīti attho. Yāvaca ariyamaggadhovanaṃ nalabbhati. Tāva santānaṃ gūthapūritakūpaṃ viya dubbisodhaṃ katvā pavattati. Pupphāsavādayoca madaṃ janentā muhuttameva janenti. Ime pana yāva ariyamaggaṃ nalabhati. Tāva niccamadaṃ janenti. Tasmā ekantena imeyeva cirapārivāsiyaṭṭhena madani yaṭṭhenaca āsavānāma bhavituṃ arahantīti."
    ],
    "innerText": "Bodhi vuccati catūsu maggesu ñāṇaṃ, bujjhanti etāyāti katvā. Bodhiyā pakkhā bodhipakkhā. Bodhisambhārāti attho. Bodhi pakkhesu bhavā antogadhāti bodhipakkhiyā. Tesaṃ saṅgahoti bodhipakkhiyasaṅgaho. Sabbesaṃ anavasesānaṃ paramatthadhammānaṃ saṅgaho sabbasaṅgaho. Cirapārivāsiyaṭṭhena madaniyaṭṭhenaca āsava sadisattā āsavā. Yadica tadubhayaṭṭhena āsavānāma siyuṃ. Ime lobhādayo eva āsavānāma siyuṃ. Pupphāsavādayo hi loke cha pañca rattimattaṃ vā sattaṭṭharattimattaṃ vā sayaṃpi kumbhesu parivāsaṃ gaṇhanti. Kumbheca parivāsaṃ gāhāpenti. Ime pana anamatagge saṃsāre sayaṃpi sattasantāne parivāsaṃ gaṇhanti. Sattasantānañca parivāsaṃ gāhāpenti. Sakalaṃ sattasantānaṃ sadā āsavapūritameva hoti. Yathāha-cakkhuṃ loke piyarūpaṃ sātarūpaṃ etthesā taṇhā uppajjamānā uppajjati. Ettha nivīsamānā nivīsatītiādi. Tattha esā taṇhā pariyuṭṭhānavasena uppajjamānā ettheva uppajjati. Uppajjitvāca puna anusayabhāvena parivāsaṃ katvā nivīsamānā ettheva nivīsatīti attho. Yāvaca ariyamaggadhovanaṃ nalabbhati. Tāva santānaṃ gūthapūritakūpaṃ viya dubbisodhaṃ katvā pavattati. Pupphāsavādayoca madaṃ janentā muhuttameva janenti. Ime pana yāva ariyamaggaṃ nalabhati. Tāva niccamadaṃ janenti. Tasmā ekantena imeyeva cirapārivāsiyaṭṭhena madani yaṭṭhenaca āsavānāma bhavituṃ arahantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Visandanaṭṭhenavā āsavasadisattā āsavā, yathā hi kudhita kuṭṭhino mahāvaṇamukhehi yūsasaṅkhāto āsavo visanditvā pilotikakhaṇḍāni dūseti, evaṃ imepi chahidvārehi visanditvā chaḷārammaṇānidūsentīti. Āyataṃvā saṃsāradukkhaṃ savantipasavanti vaḍḍhentīti āsavā. Athavā, bhavato ābhavaggā dhammato āgotratumhā savanti ārammaṇakaraṇavasena pavattantīti āsavā. Āsaddassa avadhiatthajotakattā. Avadhica duvidho mariyādavisayo abhividhivisayocāti tattha yassa sambandhinīkriyā avadhibhūtaṃ attānaṃ bahikatvā pavattati. So mariyādavisayo nāma. Yathā āpātaliputtā devo vuṭṭhoti. Yassa sambandhinīkriyā avadhibhūtaṃ attānaṃ byāpetvā anto katvā pavattati, so ",
      " abhividhivisayonāma. Yathā ābrahmalokā bhagavato kittisaddo abbhuggatoti. Idha pana abhividhivisayo daṭṭhabbo. Tasmā bhavaggañca gotrabhuñca byāpetvā anto katvā savantīti attho veditabbo."
    ],
    "innerText": "Visandanaṭṭhenavā āsavasadisattā āsavā, yathā hi kudhita kuṭṭhino mahāvaṇamukhehi yūsasaṅkhāto āsavo visanditvā pilotikakhaṇḍāni dūseti, evaṃ imepi chahidvārehi visanditvā chaḷārammaṇānidūsentīti. Āyataṃvā saṃsāradukkhaṃ savantipasavanti vaḍḍhentīti āsavā. Athavā, bhavato ābhavaggā dhammato āgotratumhā savanti ārammaṇakaraṇavasena pavattantīti āsavā. Āsaddassa avadhiatthajotakattā. Avadhica duvidho mariyādavisayo abhividhivisayocāti tattha yassa sambandhinīkriyā avadhibhūtaṃ attānaṃ bahikatvā pavattati. So mariyādavisayo nāma. Yathā āpātaliputtā devo vuṭṭhoti. Yassa sambandhinīkriyā avadhibhūtaṃ attānaṃ byāpetvā anto katvā pavattati, so abhividhivisayonāma. Yathā ābrahmalokā bhagavato kittisaddo abbhuggatoti. Idha pana abhividhivisayo daṭṭhabbo. Tasmā bhavaggañca gotrabhuñca byāpetvā anto katvā savantīti attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[204] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[204] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Avadhica mariyādaabhividhivasena duvidhoti vatvā puna taṃ vibhāvento ‘‘tattha āpātaliputtā devo vuṭṭhotiādīsuviya kriyaṃ bahikatvā pavatto mariyādo. Ābhavaggāsaddo abbhuggatotiādīsuviya kriyaṃ byāpetvā pavatto abhividhī’’ti vadati. Taṃ na yujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na hi avavidhivisayabhūto bhavaggo lokattayabyāpakaṃ saddassa abbhuggamanakriyaṃ byāpetvā pavattati. Naca avadhibhūto attho kriyaṃ bahivā antovā katvā pavattatīti yutto. Kriyāeva pana taṃ bahivā antovā katvā pavattatīti yutto. Evañca katvā mūlaṭīkāyaṃ-duvidhohi avadhi abhividhivisayo anabhividhivisayoca. Abhividhivisayaṃ kriyābyāpetvā pavattati, ābhavaggā bhagavato yaso gatoti. Itaraṃ bahikatvā, āpātaliputtā vuṭṭho devoti. Kāmeti icchatīti kāmo. Soeva āsavoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmāsavo"
      },
      ". Kāmīyativā oḷārikena kāmena icchīyatīti kāmo. Pañcakāmaguṇamukhena desito sabbo kāmāvacaradhammo. Idha pana taṃ nāmena tadārammaṇā taṇhāeva adhippetā, kāmoeva āsavoti kāmāsavo. Kāmāvacaradhammesu assādanābhinandana vasena pavatto kāmarāgo. Therena pana ayamatthova icchito. Vakkhati hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmabhava nāmena tabbatthukā taṇhā adhippetā"
      },
      "ti."
    ],
    "innerText": "Na hi avavidhivisayabhūto bhavaggo lokattayabyāpakaṃ saddassa abbhuggamanakriyaṃ byāpetvā pavattati. Naca avadhibhūto attho kriyaṃ bahivā antovā katvā pavattatīti yutto. Kriyāeva pana taṃ bahivā antovā katvā pavattatīti yutto. Evañca katvā mūlaṭīkāyaṃ-duvidhohi avadhi abhividhivisayo anabhividhivisayoca. Abhividhivisayaṃ kriyābyāpetvā pavattati, ābhavaggā bhagavato yaso gatoti. Itaraṃ bahikatvā, āpātaliputtā vuṭṭho devoti. Kāmeti icchatīti kāmo. Soeva āsavoti kāmāsavo. Kāmīyativā oḷārikena kāmena icchīyatīti kāmo. Pañcakāmaguṇamukhena desito sabbo kāmāvacaradhammo. Idha pana taṃ nāmena tadārammaṇā taṇhāeva adhippetā, kāmoeva āsavoti kāmāsavo. Kāmāvacaradhammesu assādanābhinandana vasena pavatto kāmarāgo. Therena pana ayamatthova icchito. Vakkhati hi kāmabhava nāmena tabbatthukā taṇhā adhippetāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[205] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[205] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Purimatthova vutto. So anupapanno, theramatānugatassa idhādhippetassa atthassa avuttattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavāsavo"
      },
      "ti ",
      " ettha duvidho bhavo kammabhavo upapattibhavo ca. Tattha mahaggatakusaladhammā kammabhavo. Taṃnibbattā vipāka dhammā upapattibhavo. Idhapi bhavasaddena tadārammaṇā taṇhāeva adhippetā. Bhavoeva āsavoti bhavāsavo. Tasmiṃ duvidhe bhave nikantivasena pavatto rūpārūparāgo."
    ],
    "innerText": "Bhavāsavoti ettha duvidho bhavo kammabhavo upapattibhavo ca. Tattha mahaggatakusaladhammā kammabhavo. Taṃnibbattā vipāka dhammā upapattibhavo. Idhapi bhavasaddena tadārammaṇā taṇhāeva adhippetā. Bhavoeva āsavoti bhavāsavo. Tasmiṃ duvidhe bhave nikantivasena pavatto rūpārūparāgo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[206]"
      },
      " Yaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[206] Yaṃ pana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Sassata diṭṭhisahagatoca rāgo ettheva saṅgayhatī’’ti vuttaṃ. Taṃ na yuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhavāsavo catūsu diṭṭhigata vippayutta lobhasahagatesu cittuppādesu uppajjatīti hi aṭṭhakathākaṇḍe vuttaṃ. Yattha pana kāmataṇhā bhavataṇhā vibhavataṇhāti āgataṃ. Tattheva sassatadiṭṭhi sahagato rāgo yākāci kusalākusala kammabhavanikanti yākāci upapattibhavapatthanā. Sabbā bhavataṇhāyaṃ saṅgahitāti yuttā. Idha pana yathāvuttaṃ bhavāsavaṃ thapetvā sabbo lobho kāmāsave eva saṅgahitoti yuttoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[207]"
      },
      " Eteneva yañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha"
      },
      " vuttaṃ."
    ],
    "innerText": "[207] Eteneva yañca tattha vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Tatiyo bhādiṭṭhisahagato’’ti. Taṃpi paṭikkhittaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yākāci diṭṭhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭhāsavo"
      },
      ". Yokoci moho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avijjāsavo"
      },
      ". Ettha siyā, kasmā ime eva āsavāti vuttā. Nanu aññepi mānādayo cirapārivāsiyaṭṭhādiyuttā eva hontīti. Saccaṃ. Imesu pana kāmāsave parivuṭṭhe sati sabbekāmavisayā mānādayo parivuṭṭhāeva honti. Tasmiṃ vimutte vimuttāeva, tathā bhavāsave parivuṭṭhe sati bhavavisayā. Diṭṭhāsaveca parivuṭṭhe sati diṭṭhivisayāti. Avijjāpana tesaṃ tiṇṇaṃpi mūlabhūtāti. Iti ime eva pārivāsiyaṭṭhādīsu padhānabhūtā honti. Itare pana tadanubandhamattāeva sampajjantīti na te āsavāti visuṃ vattuṃ arahantīti. Attani patitaṃ janaṃ anassāsikaṃ katvā ajjhottha ranto ",
      " hanati māretīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ogho"
      },
      ". Pakatimahogho. Tathā avahananaṭṭhena duttaraṭṭhenaca oghasadisāti oghā. Yadica avahaññanaṭṭheca duttaraṭṭhenaca oghānāma siyuntiādiko pasaṅgo mānādīnañca oghabhāva parihāro vutta nayena veditabbo."
    ],
    "innerText": "Yākāci diṭṭhi diṭṭhāsavo. Yokoci moho avijjāsavo. Ettha siyā, kasmā ime eva āsavāti vuttā. Nanu aññepi mānādayo cirapārivāsiyaṭṭhādiyuttā eva hontīti. Saccaṃ. Imesu pana kāmāsave parivuṭṭhe sati sabbekāmavisayā mānādayo parivuṭṭhāeva honti. Tasmiṃ vimutte vimuttāeva, tathā bhavāsave parivuṭṭhe sati bhavavisayā. Diṭṭhāsaveca parivuṭṭhe sati diṭṭhivisayāti. Avijjāpana tesaṃ tiṇṇaṃpi mūlabhūtāti. Iti ime eva pārivāsiyaṭṭhādīsu padhānabhūtā honti. Itare pana tadanubandhamattāeva sampajjantīti na te āsavāti visuṃ vattuṃ arahantīti. Attani patitaṃ janaṃ anassāsikaṃ katvā ajjhottha ranto hanati māretīti ogho. Pakatimahogho. Tathā avahananaṭṭhena duttaraṭṭhenaca oghasadisāti oghā. Yadica avahaññanaṭṭheca duttaraṭṭhenaca oghānāma siyuntiādiko pasaṅgo mānādīnañca oghabhāva parihāro vutta nayena veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vaṭṭasmiṃvā bhavayantakevā satte yojentīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yogā"
      },
      ". Bhavantaracutiyā saha bhavantarapaṭisandhiṃ gantenti ghaṭentīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ganthā. Abhijjhā"
      },
      "ti sabbassa rāgassetaṃ nāmaṃ. Tasmā rūpārūpa rāgāpi ettha saṅgahitāti daṭṭhabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Byāpādo"
      },
      "tipi sabbo doso eva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idaṃ saccāti niveso"
      },
      "ti idameva saccaṃ, moghamaññanti pavatto micchābhiniveso. Vaṭṭadukkhato vimuttiyā amaggabhūtaṃyeva gosīlagovatādikaṃ parato āmasanaṃ tathā tathā kappetvā gahaṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīlabbataparāmāso"
      },
      ". Etthaca paratoti bhūtasabhāvapaccanikatoti attho. Kāyasaddo pana sabbattha rūpakāye nāmakāyeca pavattoti atitakāyena paccuppanna kāyaṃ paccuppannakāyenaca anāgatakāyaṃ gantheti ghaṭetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyagantho"
      },
      ". Athavā, kāye gaṇṭhoti kāyagaṇṭho. Ajjhatta gaṇṭhoti attho. Nigaṇṭhonāṭaputtotiādīsuviya gaṇṭhasaddo gaṇṭhiyaṃ pavatto. Bhusaṃ ādiyanti amuñcanagāhaṃ gaṇhantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upādānāni"
      },
      ". Kilesabhūto kāmoeva upādānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmu pādānaṃ"
      },
      ". Vatthubhūtaṃvā kāmaṃ upādiyatīti kāmupādānaṃ."
    ],
    "innerText": "Vaṭṭasmiṃvā bhavayantakevā satte yojentīti yogā. Bhavantaracutiyā saha bhavantarapaṭisandhiṃ gantenti ghaṭentīti ganthā. Abhijjhāti sabbassa rāgassetaṃ nāmaṃ. Tasmā rūpārūpa rāgāpi ettha saṅgahitāti daṭṭhabbā. Byāpādotipi sabbo doso eva. Idaṃ saccāti nivesoti idameva saccaṃ, moghamaññanti pavatto micchābhiniveso. Vaṭṭadukkhato vimuttiyā amaggabhūtaṃyeva gosīlagovatādikaṃ parato āmasanaṃ tathā tathā kappetvā gahaṇaṃ sīlabbataparāmāso. Etthaca paratoti bhūtasabhāvapaccanikatoti attho. Kāyasaddo pana sabbattha rūpakāye nāmakāyeca pavattoti atitakāyena paccuppanna kāyaṃ paccuppannakāyenaca anāgatakāyaṃ gantheti ghaṭetīti kāyagantho. Athavā, kāye gaṇṭhoti kāyagaṇṭho. Ajjhatta gaṇṭhoti attho. Nigaṇṭhonāṭaputtotiādīsuviya gaṇṭhasaddo gaṇṭhiyaṃ pavatto. Bhusaṃ ādiyanti amuñcanagāhaṃ gaṇhantīti upādānāni. Kilesabhūto kāmoeva upādānaṃ kāmu pādānaṃ. Vatthubhūtaṃvā kāmaṃ upādiyatīti kāmupādānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dvāsaṭṭhidiṭṭhiyo tividha mahādiṭṭhiyo aññāpivā sāsane lokeca sandissamānā viparītagāhabhūtā diṭṭhiyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭhupādānaṃ"
      },
      ". Yathāgahitaṃvā purimadiṭṭhiṃ idameva saccaṃ moghamaññanti upādiyatīti diṭṭhupādānaṃ. Goṇakukkurādīnaṃ taṃtaṃpakaticārittaṃ sīlaṃ nāma. Tameva suṭṭhuṃ samādinnaṃ vataṃnāma. Tadubhayaṃ saṃsāramuttiyā maggoti daḷhagahaṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīlabbatu pādānaṃ nāma. Attavādupādāna"
      },
      "nti ettha attā vuccati parikappabuddhiyā gahito ekekasmiṃ satta santāne padhānissaro. Yaṃ lokiyamahājanā sattotivā puggalotivā jīvotivā tathāgatotivā lokotivā sañjānanti. Yañca nānātitthiyā issaranimmitaṃvā adhiccasamuppannaṃvā accantasassataṃvā ",
      " ekaccasassataṃvā ucchedaṃvā paññapentīti. Taṃ attānaṃ abhivadanticeva upādiyantica sattā etenāti attavā dupādānaṃ. Vīsatividhā sakkāyadiṭṭhi. Tattha abhivadantīti visiṭṭhaṃ padhānaṃ katvā vadanti. Upādiyantīti daḷhaṃ ādiyanti. Yathāha –"
    ],
    "innerText": "Dvāsaṭṭhidiṭṭhiyo tividha mahādiṭṭhiyo aññāpivā sāsane lokeca sandissamānā viparītagāhabhūtā diṭṭhiyo diṭṭhupādānaṃ. Yathāgahitaṃvā purimadiṭṭhiṃ idameva saccaṃ moghamaññanti upādiyatīti diṭṭhupādānaṃ. Goṇakukkurādīnaṃ taṃtaṃpakaticārittaṃ sīlaṃ nāma. Tameva suṭṭhuṃ samādinnaṃ vataṃnāma. Tadubhayaṃ saṃsāramuttiyā maggoti daḷhagahaṇaṃ sīlabbatu pādānaṃ nāma. Attavādupādānanti ettha attā vuccati parikappabuddhiyā gahito ekekasmiṃ satta santāne padhānissaro. Yaṃ lokiyamahājanā sattotivā puggalotivā jīvotivā tathāgatotivā lokotivā sañjānanti. Yañca nānātitthiyā issaranimmitaṃvā adhiccasamuppannaṃvā accantasassataṃvā ekaccasassataṃvā ucchedaṃvā paññapentīti. Taṃ attānaṃ abhivadanticeva upādiyantica sattā etenāti attavā dupādānaṃ. Vīsatividhā sakkāyadiṭṭhi. Tattha abhivadantīti visiṭṭhaṃ padhānaṃ katvā vadanti. Upādiyantīti daḷhaṃ ādiyanti. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha katamā sakkāyadiṭṭhi. Idha assutavā puthujjano rūpaṃ attato samanupassati. Rūpavantaṃvā attānaṃ. Attani vā rūpaṃ. Rūpasmiṃvā attānaṃ. Vedanaṃ attato samanupassati. Vedanāvantaṃvā attānaṃ. Attanivā vedanaṃ. Vedanāpavā attānaṃ. Saññaṃ. Saṅkhāre. Viññāṇanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha rūpaṃ attato samanupassatīti rūpameva attāti gaṇhāti. Rūpavantaṃvā attānanti attā me rūpavāti gaṇhāti. Attani vā rūpanti attānaṃ paṭicca rūpaṃ tiṭṭhatīti gaṇhāti. Rūpasmiṃvā attānanti rūpaṃ paṭicca attā tiṭṭhatīti gaṇhāti. Kathaṃ rūpakāyaṃ uddissa ajja ahaṃ thaddhomhīti vā ajja ahaṃ mudukomhītivā vadanto pathavi saṅkhātaṃ rūpaṃ attato samanupassatināma. Ajja mama kāyo thaddhotivā mudūtivā vadanto sesadhammevā dhammamuttakaṃvā attānaṃ gahetvā taṃ attānaṃ pathavīvantaṃ samanupassatināma. Ajja thaddhabhāvovā mudubhāvovā mayi jātoti vadanto attani pathaviṃsa manupassatināma. Ajjāhaṃ thaddhabhāve ṭhitomhi mudubhāve ṭhito mhīti vadantopathavimhi attānaṃ samanussatināma. Ayaṃ pathavimhi caturāvatthikāya saṃkkāyadiṭṭhiyā pavattākāro. Sesesu sattavīsatirūpesu yathāsambhavaṃ vattabbo. Ahaṃ marāmi marissāmītiādinā hi aniccatāyaṃpi sādiṭṭhi pavattatiyeva. Sesarūpesu vattabbaṃ natthi. Idaṃ nāma ahaṃ pubbe saṃbhuñjiṃ. Ajja saṃbhuñjāmi. Parato saṃbhuñjissāmītivā sukhitomhi dukkhitomhītivā vedanaṃ attato samanupassati. Ajja mama kāyo sukhito dukkhitotivā mamacittaṃ sukhitaṃ dukkhitantivā attānaṃ vedanāvantaṃ samanupassati. Ajjasukhaṃvā dukkhaṃvā mayijātanti attani vedanaṃ samanupassati. Ajjāhaṃ sukhita bhāve ṭhitomhi dukkhitabhāve ṭhitomhīti vedanāya attānaṃ samanupassatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Saññāya ",
      " sabbesuca paññāsamattesu saṅkhāresu visuṃ visuṃ vitthāretvā vattabbo. Ahaṃ passāmīti cakkhuviññāṇaṃ attato samanupassati. Dassanaṃ meti attānaṃ viññāṇavantaṃ samanupassati. Mayidassanaṃnāma atthīti attani viññāṇaṃ samanupassati, ahaṃ dassane samatthomhīti viññāṇasmiṃ attānaṃ samanupassati. Ese vanayo sesesu pañcasu viññāṇesūti. Aha masmi ahaṃ eko satto ekopuggalo eko jīvo eko loko eko naro manusso devosakko brahmātivā ahaṃgacchāmi ahaṃ tiṭṭhāmi ahaṃ nisīdāmi ahaṃ nippajjāmi ahaṃ samiñjemi pasāremītiādinā vā khandhapañcakaṃvā ekamekaṃvā khandhaṃ samūhato gahetvā pavattipi vattabbā. Apariññātavatthukānañhi ekamuhutta mattepi yaṃkiñci attanovā parassavā attapaṭisaṃyuttavacanaṃ kathentānaṃ cittaṃvā vacanaṃvā yathāvutte rūpārūpadhamme kadāci attato upādiyitvā pavattati. Kadāci attaparivāra bhāvena. Kadāci attanissitabhāvena. Kadāci attanissayabhāvena. Kadāci ekekadhammavasena. Kadāci samūhadhammavasenāti."
    ],
    "innerText": "Saññāya sabbesuca paññāsamattesu saṅkhāresu visuṃ visuṃ vitthāretvā vattabbo. Ahaṃ passāmīti cakkhuviññāṇaṃ attato samanupassati. Dassanaṃ meti attānaṃ viññāṇavantaṃ samanupassati. Mayidassanaṃnāma atthīti attani viññāṇaṃ samanupassati, ahaṃ dassane samatthomhīti viññāṇasmiṃ attānaṃ samanupassati. Ese vanayo sesesu pañcasu viññāṇesūti. Aha masmi ahaṃ eko satto ekopuggalo eko jīvo eko loko eko naro manusso devosakko brahmātivā ahaṃgacchāmi ahaṃ tiṭṭhāmi ahaṃ nisīdāmi ahaṃ nippajjāmi ahaṃ samiñjemi pasāremītiādinā vā khandhapañcakaṃvā ekamekaṃvā khandhaṃ samūhato gahetvā pavattipi vattabbā. Apariññātavatthukānañhi ekamuhutta mattepi yaṃkiñci attanovā parassavā attapaṭisaṃyuttavacanaṃ kathentānaṃ cittaṃvā vacanaṃvā yathāvutte rūpārūpadhamme kadāci attato upādiyitvā pavattati. Kadāci attaparivāra bhāvena. Kadāci attanissitabhāvena. Kadāci attanissayabhāvena. Kadāci ekekadhammavasena. Kadāci samūhadhammavasenāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yasmā pana attanimittaṃnāma vasavattanākāraṃ paṭicca upaṭṭhāti. Vasavattanā kāroca rūpārūpadhammānaṃ paccayāyatta vuttikattaṃ khaṇi kattañca suṭṭhu passantānaṃ natthi. Tasmā pariññātavattukānaṃ atta paṭisaṃyuttavacanaṃ kathentānaṃpi cittaṃ paduminipatte udakabindu viya tesu dhammesu alaggitvāeva pavattatīti veditabbaṃ. Sattānaṃ cittasantāne kusale dhamme anuppannevā uppādetuṃ uppannevā vā setuṃ adatvā nīvārentīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nīvaraṇāni"
      },
      ". Kāmanaṭṭhena kāmo, chandanaṭṭhenachandoti kāmacchando. Balavarāgo. Soevanīvaraṇanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmacchandanīvaraṇaṃ"
      },
      ". Paṭṭhāneāruppekāmacchandaṃ nīvaraṇaṃ paṭiccauddhaccanīvaraṇanti vuttattā pana thapetvā rūpārūparāge avaseso sabbolobho kāmacchande asaṅgahitonāma natthi. Jhānapaṭipakkhabhāvopana pañcakāmaguṇikarāgasseva hotīti veditabbo. Byāpajjanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "byāpādo"
      },
      ". Cittassa pūtibhāvoti attho. Yokocidoso. Kasmā panettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "thinamiddha nīvaraṇa"
      },
      "nti ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddhacca kukkucca nīvaraṇa"
      },
      "nti ",
      " ca dve dve dhammā ekaṃ nīvaraṇaṃ katvā vuttāti. Kiccato paccayato paṭipakkhatoca sadisattā. Tathā hi kiccato tāva thinamiddhadvayaṃ cittuppādānaṃ līnabhāvā pādanakiccaṃ. Uddhaccakukkuccadvayaṃ avūpasantabhāvāpādanakiccaṃ. Paccayato purimadvayaṃ tandivijambhi tatāpaccayaṃ. Pacchimadvayaṃ ñātibyasanādivitakkapaccayaṃ. Paṭipakkhato purimadvayaṃ vīriyapaṭipakkhaṃ. Pacchimadvayaṃ samathapaṭipakkhanti."
    ],
    "innerText": "Yasmā pana attanimittaṃnāma vasavattanākāraṃ paṭicca upaṭṭhāti. Vasavattanā kāroca rūpārūpadhammānaṃ paccayāyatta vuttikattaṃ khaṇi kattañca suṭṭhu passantānaṃ natthi. Tasmā pariññātavattukānaṃ atta paṭisaṃyuttavacanaṃ kathentānaṃpi cittaṃ paduminipatte udakabindu viya tesu dhammesu alaggitvāeva pavattatīti veditabbaṃ. Sattānaṃ cittasantāne kusale dhamme anuppannevā uppādetuṃ uppannevā vā setuṃ adatvā nīvārentīti nīvaraṇāni. Kāmanaṭṭhena kāmo, chandanaṭṭhenachandoti kāmacchando. Balavarāgo. Soevanīvaraṇanti kāmacchandanīvaraṇaṃ. Paṭṭhāneāruppekāmacchandaṃ nīvaraṇaṃ paṭiccauddhaccanīvaraṇanti vuttattā pana thapetvā rūpārūparāge avaseso sabbolobho kāmacchande asaṅgahitonāma natthi. Jhānapaṭipakkhabhāvopana pañcakāmaguṇikarāgasseva hotīti veditabbo. Byāpajjanaṃ byāpādo. Cittassa pūtibhāvoti attho. Yokocidoso. Kasmā panettha thinamiddha nīvaraṇanti ca uddhacca kukkucca nīvaraṇanti ca dve dve dhammā ekaṃ nīvaraṇaṃ katvā vuttāti. Kiccato paccayato paṭipakkhatoca sadisattā. Tathā hi kiccato tāva thinamiddhadvayaṃ cittuppādānaṃ līnabhāvā pādanakiccaṃ. Uddhaccakukkuccadvayaṃ avūpasantabhāvāpādanakiccaṃ. Paccayato purimadvayaṃ tandivijambhi tatāpaccayaṃ. Pacchimadvayaṃ ñātibyasanādivitakkapaccayaṃ. Paṭipakkhato purimadvayaṃ vīriyapaṭipakkhaṃ. Pacchimadvayaṃ samathapaṭipakkhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anusentīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anusayā"
      },
      ". Anurūpaṃ kāraṇaṃ labhitvā uppajjantīti attho. Anuanu sentītivā anusayā. Yāva maggaṃ napaṭilabhati. Tāva antarā aparikkhiyyamānā hutvā kāraṇalābhe sati punappunaṃ uppajjantīti attho. Uppajjanañcettha appahīnaṭṭhena uppajjanā rahabhāvo veditabbo. Na pana sarūpato uppatti, kathaṃ viññā yatīti ce. Yassa kāmarāgānusayo uppajjati, tasseva paṭighānusayo uppajjatīti vuttattā. Evañca katvā pāḷiyaṃ puthujjanassa sattapi anusayā anusayavāre saha anusentīti uppajjanavāre saha uppajjantīti vuttā. Yathāha puthujjanassa avijjānusayoca anuseti. Kāmarāga. Paṭigha. Māna. Diṭṭhi. Vicikicchā. Bhavarāganusayoca anusetīti. Tathā uppajjanavārepīti."
    ],
    "innerText": "Anusentīti anusayā. Anurūpaṃ kāraṇaṃ labhitvā uppajjantīti attho. Anuanu sentītivā anusayā. Yāva maggaṃ napaṭilabhati. Tāva antarā aparikkhiyyamānā hutvā kāraṇalābhe sati punappunaṃ uppajjantīti attho. Uppajjanañcettha appahīnaṭṭhena uppajjanā rahabhāvo veditabbo. Na pana sarūpato uppatti, kathaṃ viññā yatīti ce. Yassa kāmarāgānusayo uppajjati, tasseva paṭighānusayo uppajjatīti vuttattā. Evañca katvā pāḷiyaṃ puthujjanassa sattapi anusayā anusayavāre saha anusentīti uppajjanavāre saha uppajjantīti vuttā. Yathāha puthujjanassa avijjānusayoca anuseti. Kāmarāga. Paṭigha. Māna. Diṭṭhi. Vicikicchā. Bhavarāganusayoca anusetīti. Tathā uppajjanavārepīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Apica, sarūpato pariyuṭṭhānaṃ apatvā santāne pavattamānehi kusalākusalā byākatacittuppādehi saha anurūpā aviruddhā hutvā senti. Visuṃ sampayuttadhammabhāvena avuṭṭhitā hutvā sayitā hontīti anusayā. Anu anu sentītivā anusayā. Pakatiyā yathānusayitesueva kāmarāgādīsu punappunaṃ uppajjitvā diguṇa tiguṇādi vasena punappunaṃ senti. Sayanākārena uparupari paliveṭhentīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tīsu rāgādīnaṃ avatthāsu pathamāvatthāya ṭhitānaṃ kāmarāgā dīnametaṃ adhivacanaṃ. Tisso hi avatthā anusayāvatthā pariyuṭṭhānāvatthā vītikkamāvatthāti. Tattha ye kāmarāgādayo uppajjitvā kāyaṅgavācaṅgaṃ cālenti, tesaṃ tathāpavattā avatthā vītikkamāvatthānāma. Ye manasmiṃ eva javanacittasahajātā hutvā pavattanti, tesaṃ tathāpavattā avatthā pariyuṭṭhānāvatthānāma. Ye ",
      " pana javanasahajātabhāvaṃpi apatvā vāsanādhātuyo viya cikkasantānā nusayitā hutvā pariyuṭṭhānappattiyā bījabhāvena tiṭṭhanti, subhanimittādikeca ārammaṇe āpātamāgate yesaṃ vasena āvajjanaṃ rāgādipātubhāvatthāya ayoniso bhavaṅgaṃ āvaṭṭeti, abhāvitañca cittaṃ yesaṃ vasena damathaṃ naupeti, tesaṃ tathā pavattā avatthā anusayāvatthānāma. Tadavatthikā kāmarāgādayo anusayānāma. Te pana aparamatthabhūtāpi na honti. Ekantaparamatthajātikattā. Naca kusalābyākatabhūtā ekantākusalajātikattā. Nāpi kusalābyākataviruddhā, visuṃ sampayuttadhammabhāvena anupaladdhattā. Nāpi kālattayavinimuttā, tekālikadhammasannissayena pavattanato. Yadā pana te samuṭṭha hitvā pariyuṭṭhānabhāvaṃ gacchanti, tadā visuṃ sampayuttadhamma bhāvañca gacchanti. Sārammaṇādibhāvoca tesaṃ paribyatto hoti. Etadatthaṃ sandhāya kathāvatthumhi tesaṃ sārammaṇadhammabhāvo saṅkhārakkhandhabhāvoca patiṭṭhāpito hotīti."
    ],
    "innerText": "Tīsu rāgādīnaṃ avatthāsu pathamāvatthāya ṭhitānaṃ kāmarāgā dīnametaṃ adhivacanaṃ. Tisso hi avatthā anusayāvatthā pariyuṭṭhānāvatthā vītikkamāvatthāti. Tattha ye kāmarāgādayo uppajjitvā kāyaṅgavācaṅgaṃ cālenti, tesaṃ tathāpavattā avatthā vītikkamāvatthānāma. Ye manasmiṃ eva javanacittasahajātā hutvā pavattanti, tesaṃ tathāpavattā avatthā pariyuṭṭhānāvatthānāma. Ye pana javanasahajātabhāvaṃpi apatvā vāsanādhātuyo viya cikkasantānā nusayitā hutvā pariyuṭṭhānappattiyā bījabhāvena tiṭṭhanti, subhanimittādikeca ārammaṇe āpātamāgate yesaṃ vasena āvajjanaṃ rāgādipātubhāvatthāya ayoniso bhavaṅgaṃ āvaṭṭeti, abhāvitañca cittaṃ yesaṃ vasena damathaṃ naupeti, tesaṃ tathā pavattā avatthā anusayāvatthānāma. Tadavatthikā kāmarāgādayo anusayānāma. Te pana aparamatthabhūtāpi na honti. Ekantaparamatthajātikattā. Naca kusalābyākatabhūtā ekantākusalajātikattā. Nāpi kusalābyākataviruddhā, visuṃ sampayuttadhammabhāvena anupaladdhattā. Nāpi kālattayavinimuttā, tekālikadhammasannissayena pavattanato. Yadā pana te samuṭṭha hitvā pariyuṭṭhānabhāvaṃ gacchanti, tadā visuṃ sampayuttadhamma bhāvañca gacchanti. Sārammaṇādibhāvoca tesaṃ paribyatto hoti. Etadatthaṃ sandhāya kathāvatthumhi tesaṃ sārammaṇadhammabhāvo saṅkhārakkhandhabhāvoca patiṭṭhāpito hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā pana phaladhārimhi rukkhamhi visakaṇṭake dinne rukkhānusayito phaluppattiyā paccayabhūto sineho parikkhayaṃ gacchati. Samaye uppajjissamānāni phalāni nuppajjanti. Evaṃ sānusaye citta santāne yasmiṃ khaṇe maggo pātubhavati, tasmiṃ sahamagguppādā so so anusayo parikkhayaṃ gacchati. Parikkhīṇassa pana puna pariyuṭṭhānaṃnāma natthi, kuto vītikkamoti imamatthaṃ sandhāya maggo anāgatasāmaññaṃ kilesajātaṃ pajahatīti tattha tattha vutto. Tattha anāgatasāmaññanti anāgatasammataṃ, na ekanta anāgataṃ. Teneva hi aṭṭhakathāyaṃ maggo yekilese pajahati, te atītākivā anāgatātivā paccuppannātivā navattabbāti vuttaṃ. Etenaca maggo kilesamukhena yāni kusalākusalakammānica upādinnakakhandhapañcakeca pajahati, te atītātivāanāgatātivā paccuppannātivā navattabbāti dīpeti. Yadi evaṃ maggena pahīnā sabbe tebhūmakadhammā kālavimuttānāma ataṅkhatā nāma apaccayānāma siyunti.Na. Tekālikajātikattā saṅkhata sapaccayajātikattā ",
      " ca. Te hi magge anuppanne ime nāmadhammā uppajjissanti nirujjhissantīti evaṃ saṅkhatalakkhaṇaṃ āhacca ñāṇena gahitattā lakkhaṇavasena tebhūmakādibhāvaṃ bhajantīti. Evañca katvā visuṃ sampayuttadhammabhāvaṃ apattānaṃ anusayāvatthāya vā vāsanāvatthāyavā kammasamaṅgītāvatthāyavā āsayajjhāsayā dhimutticaritavatthāsuvā ṭhitānaṃ sabhāvānaṃ jātivasena paramattha dhammatā akusalāditāca paccetabbā hotīti."
    ],
    "innerText": "Yathā pana phaladhārimhi rukkhamhi visakaṇṭake dinne rukkhānusayito phaluppattiyā paccayabhūto sineho parikkhayaṃ gacchati. Samaye uppajjissamānāni phalāni nuppajjanti. Evaṃ sānusaye citta santāne yasmiṃ khaṇe maggo pātubhavati, tasmiṃ sahamagguppādā so so anusayo parikkhayaṃ gacchati. Parikkhīṇassa pana puna pariyuṭṭhānaṃnāma natthi, kuto vītikkamoti imamatthaṃ sandhāya maggo anāgatasāmaññaṃ kilesajātaṃ pajahatīti tattha tattha vutto. Tattha anāgatasāmaññanti anāgatasammataṃ, na ekanta anāgataṃ. Teneva hi aṭṭhakathāyaṃ maggo yekilese pajahati, te atītākivā anāgatātivā paccuppannātivā navattabbāti vuttaṃ. Etenaca maggo kilesamukhena yāni kusalākusalakammānica upādinnakakhandhapañcakeca pajahati, te atītātivāanāgatātivā paccuppannātivā navattabbāti dīpeti. Yadi evaṃ maggena pahīnā sabbe tebhūmakadhammā kālavimuttānāma ataṅkhatā nāma apaccayānāma siyunti.Na. Tekālikajātikattā saṅkhata sapaccayajātikattā ca. Te hi magge anuppanne ime nāmadhammā uppajjissanti nirujjhissantīti evaṃ saṅkhatalakkhaṇaṃ āhacca ñāṇena gahitattā lakkhaṇavasena tebhūmakādibhāvaṃ bhajantīti. Evañca katvā visuṃ sampayuttadhammabhāvaṃ apattānaṃ anusayāvatthāya vā vāsanāvatthāyavā kammasamaṅgītāvatthāyavā āsayajjhāsayā dhimutticaritavatthāsuvā ṭhitānaṃ sabhāvānaṃ jātivasena paramattha dhammatā akusalāditāca paccetabbā hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[208] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[208] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Appahīnā hi kilesā kāraṇalābhe sati uppajjanā rahā santāne anuanusayitā viya hontīti tadavatthā anusayāti vuccanti. Te pana nippariyāyato anāgata kilesā. Atītapaccuppannāpi taṃsabhāvattā tathā vuccantī’’ti vuttaṃ. Tattha anusayānāma santāne kadācipi anuppanna pubbā anāgata kilesā evāti katvā santāne anu anusayitā viya hontīti vuttaṃ. Taṃ na yujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na hi te anuanusayitā viya honti. Ekantena anusayitāeva hontīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[209]"
      },
      " Yañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha"
      }
    ],
    "innerText": "[209] Yañca tattha"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Te pana nippariyāyato anāgatakilesā’’ti vuttaṃ. Taṃpi na yuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na hi maggena appahīnā anusayā anāgatānāma honti. Pahīnāpica nippariyāyato anāgatāti nasakkā vattuṃ. Anāgata sāmaññassa adhippetattāti. Etena atītapaccuppannāpi taṃsabhāvattātathā vuccantīti idaṃvipaṭikkhittaṃ hoti. Apica, uppādaṭṭhitibhaṅga pattānaṃeva ekantena tekālikatā hotīti tadapattānaṃ anusayānaṃ paccuppannatā pariyāyova vattuṃ yutto. Evañca katvā pāḷiyaṃ yassa kāmarāganusayo uppajjati, tassa paṭighānusayo uppajjatītiādinā paccuppannakāliko uppādavāro eva vutto, na nirodhavāro, naca atītānāgata vārāti. Yaṃ pana ",
      " paṭisambhidāmagge hañci paccuppanne kilese pajahati. Tena hi ratto rāgaṃ pajahati, duṭṭho dosaṃ, muḷho mohanti vuttaṃ. Taṃ pariyuṭṭhānapattānaṃ ekantapaccuppannakkhaṇaṃ sandhāya vuttanti daṭṭhabbaṃ. Teneva hi aṭṭhakathāyaṃ vattamānuppannaṃ bhutvā vigatuppannaṃ okāsakatuppannaṃ samudācāruppannanti catubbidhaṃ uppannaṃ na maggavajjhaṃ. Bhūmiladdhuppannaṃ ārammaṇā dhiggahi tuppannaṃ avikkhambhituppannaṃ asamugghāṭituppannanti catubbidhaṃ maggavajjhanti vuttaṃ. Tattha vattamānuppannaṃ samudā cāruppannanti idaṃ dvayaṃ khaṇapaccuppannameva. Bhutvāvigatuppannaṃ atītameva. Okāsa katuppannaṃ anāgatameva. Tadubhayaṃ pana paccuppannasamīpattā uppannanti vuttaṃ. Samīpapaccuppannanti vuttaṃ hoti."
    ],
    "innerText": "Na hi maggena appahīnā anusayā anāgatānāma honti. Pahīnāpica nippariyāyato anāgatāti nasakkā vattuṃ. Anāgata sāmaññassa adhippetattāti. Etena atītapaccuppannāpi taṃsabhāvattātathā vuccantīti idaṃvipaṭikkhittaṃ hoti. Apica, uppādaṭṭhitibhaṅga pattānaṃeva ekantena tekālikatā hotīti tadapattānaṃ anusayānaṃ paccuppannatā pariyāyova vattuṃ yutto. Evañca katvā pāḷiyaṃ yassa kāmarāganusayo uppajjati, tassa paṭighānusayo uppajjatītiādinā paccuppannakāliko uppādavāro eva vutto, na nirodhavāro, naca atītānāgata vārāti. Yaṃ pana paṭisambhidāmagge hañci paccuppanne kilese pajahati. Tena hi ratto rāgaṃ pajahati, duṭṭho dosaṃ, muḷho mohanti vuttaṃ. Taṃ pariyuṭṭhānapattānaṃ ekantapaccuppannakkhaṇaṃ sandhāya vuttanti daṭṭhabbaṃ. Teneva hi aṭṭhakathāyaṃ vattamānuppannaṃ bhutvā vigatuppannaṃ okāsakatuppannaṃ samudācāruppannanti catubbidhaṃ uppannaṃ na maggavajjhaṃ. Bhūmiladdhuppannaṃ ārammaṇā dhiggahi tuppannaṃ avikkhambhituppannaṃ asamugghāṭituppannanti catubbidhaṃ maggavajjhanti vuttaṃ. Tattha vattamānuppannaṃ samudā cāruppannanti idaṃ dvayaṃ khaṇapaccuppannameva. Bhutvāvigatuppannaṃ atītameva. Okāsa katuppannaṃ anāgatameva. Tadubhayaṃ pana paccuppannasamīpattā uppannanti vuttaṃ. Samīpapaccuppannanti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhūmiladdhuppannaṃnāma attano khandhesu anusayitānaṃ maggena appahīnānaṃ anusayānaṃeva nāmaṃ. Ārammaṇādhiggahituppannaṃ nāma subhanimittādike ārammaṇe sakiṃ javitvā yāva tammūlako pariyuṭṭhānavego na vūpasammati, tāva adhimattathāmagata bhāvena ṭhitānaṃ tesaññeva nāmaṃ. Anusayā hi nāma anamatagge saṃsāre punappunaṃ pariyuṭṭhānapattānaṃ kilesānaṃ vasena uparupari thira tara daḷhatara pattiyā pakatiyāpi thāmagatāevanāma honti. Na yenavā tenavā vāyāmena pajahituṃ sakkuṇeyyā. Evaṃ santepi yadā yo yo anusayo paccayalābhena pariyuṭṭhāna bahulo hoti, tadā so so visesena adhimattathāma gatabhāvaṃ patvā ṭhito hoti. Yadā yo yo paṭipakkhadhamma samādānena niggahapatto hoti, tadā so so mandathāma gatabhāvaṃ patvā ṭhito hotīti. Avikkhambhituppannaṃnāma samatha vipassanāhi suṭṭhuaniggahitānaṃ tesaññeva nāmaṃ. Asamugghāṭi tuppannaṃnāma maggena appahīnānaṃ bhūmiladdhānaṃ tesaṃeva nāmanti. Yasmā pana lokuttaradhammānāma kilesānaṃ accantapaṭipakkhā hontīti heṭṭhimā maggaṭṭhaphalaṭṭhā sekkhā attano maggaphalakkhaṇesu upari maggājjhehipi anusayehi sānusayātivā nirānusayātivā thāmavatātivā athāmagatātivā navattabbā. Tasmā anusayānaṃ tādise paccuppanna bhāve satipi hañci paccuppanne kilese pajahati. ",
      " Tenahi thāmagato anusayaṃ pajahatīti vutta doso natthīti veditabboti. Kāmarāgoeva anusayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmarāgānusayo"
      },
      "."
    ],
    "innerText": "Bhūmiladdhuppannaṃnāma attano khandhesu anusayitānaṃ maggena appahīnānaṃ anusayānaṃeva nāmaṃ. Ārammaṇādhiggahituppannaṃ nāma subhanimittādike ārammaṇe sakiṃ javitvā yāva tammūlako pariyuṭṭhānavego na vūpasammati, tāva adhimattathāmagata bhāvena ṭhitānaṃ tesaññeva nāmaṃ. Anusayā hi nāma anamatagge saṃsāre punappunaṃ pariyuṭṭhānapattānaṃ kilesānaṃ vasena uparupari thira tara daḷhatara pattiyā pakatiyāpi thāmagatāevanāma honti. Na yenavā tenavā vāyāmena pajahituṃ sakkuṇeyyā. Evaṃ santepi yadā yo yo anusayo paccayalābhena pariyuṭṭhāna bahulo hoti, tadā so so visesena adhimattathāma gatabhāvaṃ patvā ṭhito hoti. Yadā yo yo paṭipakkhadhamma samādānena niggahapatto hoti, tadā so so mandathāma gatabhāvaṃ patvā ṭhito hotīti. Avikkhambhituppannaṃnāma samatha vipassanāhi suṭṭhuaniggahitānaṃ tesaññeva nāmaṃ. Asamugghāṭi tuppannaṃnāma maggena appahīnānaṃ bhūmiladdhānaṃ tesaṃeva nāmanti. Yasmā pana lokuttaradhammānāma kilesānaṃ accantapaṭipakkhā hontīti heṭṭhimā maggaṭṭhaphalaṭṭhā sekkhā attano maggaphalakkhaṇesu upari maggājjhehipi anusayehi sānusayātivā nirānusayātivā thāmavatātivā athāmagatātivā navattabbā. Tasmā anusayānaṃ tādise paccuppanna bhāve satipi hañci paccuppanne kilese pajahati. Tenahi thāmagato anusayaṃ pajahatīti vutta doso natthīti veditabboti. Kāmarāgoeva anusayo kāmarāgānusayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Saṃyojenti bandhantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃyojanāni,"
      },
      " tāni pana sakkāyadiṭṭhi vicikicchā sīlabbataparāmāso kāmacchando byāpādoti pañca orambhāgiyāni. Rūparāgo arūparāgo māno uddhaccaṃ avijjāti pañca uddhaṃbhāgiyānīti suttante abhidhammeca dasasaṃyojanāni āgatāni. Itarāni pana abhidhammeeva āgatānīti tato visesakaraṇatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suttante"
      },
      "ti vuttaṃ. Kamo pana dvinnaṃpi pāḷiyā nasameti. Sabhāga dhammasaṅgahavasena pana idha aññathā kamo vutto siyāti. Cittaṃ kilissanti vibādhenti upatāpenticāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kilesā"
      },
      ". Kilissantivā malīnabhāvaṃ nihīnabhāvañca gacchanti sattā etehīti kilesā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmabhavanāmenā"
      },
      "ti vatthukāmadīpakena kāmanāmena rūpārūpabhavadīpakena ca bhavanāmena. Tādisaṃ kāma bhavasaṅkhātaṃ ārammaṇabhūtaṃ vatthu etissāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tabbatthukā. Tathā pavatta"
      },
      "nti sīlabbatāni parato āmasanākārena idaṃ me saccaṃ moghamaññanti abhinivisanākārena khandhesu attābhinivesākārenaca pavattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthuto"
      },
      "ti sabhāvadhammato. Ayaṃ pāpasaṅgaho akusalaṅgaho navadhā vuttoti yojanā. [Akusalasaṅgaho]"
    ],
    "innerText": "Saṃyojenti bandhantīti saṃyojanāni, tāni pana sakkāyadiṭṭhi vicikicchā sīlabbataparāmāso kāmacchando byāpādoti pañca orambhāgiyāni. Rūparāgo arūparāgo māno uddhaccaṃ avijjāti pañca uddhaṃbhāgiyānīti suttante abhidhammeca dasasaṃyojanāni āgatāni. Itarāni pana abhidhammeeva āgatānīti tato visesakaraṇatthaṃ suttanteti vuttaṃ. Kamo pana dvinnaṃpi pāḷiyā nasameti. Sabhāga dhammasaṅgahavasena pana idha aññathā kamo vutto siyāti. Cittaṃ kilissanti vibādhenti upatāpenticāti kilesā. Kilissantivā malīnabhāvaṃ nihīnabhāvañca gacchanti sattā etehīti kilesā. Kāmabhavanāmenāti vatthukāmadīpakena kāmanāmena rūpārūpabhavadīpakena ca bhavanāmena. Tādisaṃ kāma bhavasaṅkhātaṃ ārammaṇabhūtaṃ vatthu etissāti tabbatthukā. Tathā pavattanti sīlabbatāni parato āmasanākārena idaṃ me saccaṃ moghamaññanti abhinivisanākārena khandhesu attābhinivesākārenaca pavattaṃ. Vatthutoti sabhāvadhammato. Ayaṃ pāpasaṅgaho akusalaṅgaho navadhā vuttoti yojanā. [Akusalasaṅgaho]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "163"
      },
      ". Missaka saṅgahe pāṇātipātādīni pāpakammāni karontānaṃpi cittassa ārammaṇe ujukaraṇaṃnāma jhānena vinā na sijjhatīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sattajhānaṅgānī"
      },
      "ti. Kalyāṇevā pāpakevā ārammaṇe ujukaṃ cittapaṭipādanasaṅkhātassa upanijjhāyana kiccassa aṅgānīti attho. Tattha domanassaṃ akusalajjhānaṅgaṃ. Sesāni kusalākusalābyākatānīti. Kalyāṇakamma pāpakammasaṅkhātāsu sugati duggati vivaṭṭasaṅkhātāsuca nānādisāsu taṃtaṃdisāti mukhappavattisaṅkhātā cittassa gatināma sammāvā micchāvā pavattehi dassanādīhi eva sijjhatīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvādasamaggaṅgānī"
      },
      "ti. Cittassa ujugatiyāvā vaṅkagatiyāvā gamanassa pathaṅgāni upāyaṅgānīti attho. ",
      " Tattha micchādiṭṭhi micchāsaṅkappa micchāvāyāma micchāsamādhayo pāpakamma duggatibhava saṅkhātāsu ahitadisāsu cittassa vaṅkagatiyā gamanassa upāyaṅgāni, itarāni kalyāṇakamma sugatibhava vivaṭṭadhammasaṅkhātāsu hitadisāsu ujugatiyāti daṭṭhabbaṃ. Tattha pāṇātipātakamme vitakka vicāra domanassekaggatā saṅkhātaṃ caturaṅgikajjhānaṃ micchāsaṅkappa micchāvāyāma micchāsamādhi saṅkhāto tiyaṅgīkamaggoca veditabbo. Evaṃ sesesu sucaritaduccaritakammesu jhānamaggā uddharitabbā. Vibhaṅge pana suttantesuca micchāvācā micchākammanto micchāājīvo micchāsatīti imepi cattāro āgatā. Ime pana visuṃ cetasikadhammā nahonti. Tathā tathā pavattānaṃ catunnaṃ khandhānaṃ adhivacananti katvā idha nagahitā."
    ],
    "innerText": "163. Missaka saṅgahe pāṇātipātādīni pāpakammāni karontānaṃpi cittassa ārammaṇe ujukaraṇaṃnāma jhānena vinā na sijjhatīti vuttaṃ sattajhānaṅgānīti. Kalyāṇevā pāpakevā ārammaṇe ujukaṃ cittapaṭipādanasaṅkhātassa upanijjhāyana kiccassa aṅgānīti attho. Tattha domanassaṃ akusalajjhānaṅgaṃ. Sesāni kusalākusalābyākatānīti. Kalyāṇakamma pāpakammasaṅkhātāsu sugati duggati vivaṭṭasaṅkhātāsuca nānādisāsu taṃtaṃdisāti mukhappavattisaṅkhātā cittassa gatināma sammāvā micchāvā pavattehi dassanādīhi eva sijjhatīti vuttaṃ dvādasamaggaṅgānīti. Cittassa ujugatiyāvā vaṅkagatiyāvā gamanassa pathaṅgāni upāyaṅgānīti attho. Tattha micchādiṭṭhi micchāsaṅkappa micchāvāyāma micchāsamādhayo pāpakamma duggatibhava saṅkhātāsu ahitadisāsu cittassa vaṅkagatiyā gamanassa upāyaṅgāni, itarāni kalyāṇakamma sugatibhava vivaṭṭadhammasaṅkhātāsu hitadisāsu ujugatiyāti daṭṭhabbaṃ. Tattha pāṇātipātakamme vitakka vicāra domanassekaggatā saṅkhātaṃ caturaṅgikajjhānaṃ micchāsaṅkappa micchāvāyāma micchāsamādhi saṅkhāto tiyaṅgīkamaggoca veditabbo. Evaṃ sesesu sucaritaduccaritakammesu jhānamaggā uddharitabbā. Vibhaṅge pana suttantesuca micchāvācā micchākammanto micchāājīvo micchāsatīti imepi cattāro āgatā. Ime pana visuṃ cetasikadhammā nahonti. Tathā tathā pavattānaṃ catunnaṃ khandhānaṃ adhivacananti katvā idha nagahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[210]"
      },
      " Yaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[210] Yaṃ pana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sugati duggatīnaṃ nibbānassa ca abhimukhaṃ pāpanato maggā; Tesaṃ pathabhūtāni aṅgāni maṅgānī’’ti vuttaṃ; Taṃ na sundaraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na hi aṅgāni maggānaṃ pathabhūtānināma honti; Maggasaddoyeva pathapariyāyo aṭṭhakathāsu vutto na aṅgasaddoti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[211]"
      },
      " Yañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha"
      }
    ],
    "innerText": "[211] Yañca tattha"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Maggassavā aṭṭhaṅgikassa aṅgāni maggaṅgānī’’ti vuttaṃ. Taṃpi anupapannaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha hi katthaci citte tiyaṅgiko katthaci caturaṅgikotiādinā nānāmaggova adhippetoti. Ādhipaccaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "indriyāni"
      },
      ". Kiñca ādhipaccaṃ. Attādhīnavuttike dhamme attano gatiyaṃ sabbaso vattetuṃ samatthabhāvo. Iti tesu tesu kiccesu attano ādhipaccasaṅkhātaṃ indaṭṭhaṃ karonti sādhentīti indriyāni. Indaṭṭhaṃ kārentītipi indriyāni. Issarā adhipatinoti vuttaṃ hoti. Tattha pañcacakkhādīni dassanādikiccesu cakkhuviññāṇādīnaṃ issarāhonti. Balavadubbalamanda tikkhādīsu attākārānuvattāpanato. Bhāvadvayaṃ itthākārādivasena pavattiyaṃ catusamuṭṭhānika rūpānaṃ sakalakhandhapañcakasseva vā issaro hoti. Aññathā appavattito. ",
      " Tathā hi yasmiṃ santāne paṭisandhiyaṃ itthibhāvo pavattati. Tasmiṃ sabbe kammādipaccayā catusamuṭṭhānarūpasantatiṃ samuṭṭhāpentā itthākārasahitameva samuṭṭhāpenti, no aññathā. Chandacittādhippāyāpi tasmiṃ mandākārasahitāva pavattanti. Tabbiparītena purisasantānaṃ veditabbaṃ. Jīvitadvayaṃ rūpā rūpasantatīnaṃ ratti diva māsa saṃvaccharānukkamena addhānapharaṇe sahajātadhammānaṃ issaro hoti. Tesaṃ tadāyattavutti kattā. Mano vijānanakicce. Vedanāpañcakaṃ tathā tathā ārammaṇarasānubhavane. Saddhā ārammaṇāvīmuccane. Vīriyaṃ kammani alīna vuttibhāve. Sati ārammaṇupaṭṭhāne. Samādhi ārammaṇe niccalaṭṭhi tiyaṃ. Paññā asammohakicce sampayuttadhammānaṃ issaro hoti. Anaññābhibhavanīyabhāvena pavattanato. Yathā hi silāyaṃ pathavī sahajātehi anabhibhavanīyā hoti. Attanāvate abhibhavitvā visuṃ avijjamāneviya katvā pavattati. Yathā ca udake āpo aggimhi tejo vāte vāyo. Evaṃ sampadamidaṃ daṭṭhabbaṃ."
    ],
    "innerText": "Idha hi katthaci citte tiyaṅgiko katthaci caturaṅgikotiādinā nānāmaggova adhippetoti. Ādhipaccaṭṭhena indriyāni. Kiñca ādhipaccaṃ. Attādhīnavuttike dhamme attano gatiyaṃ sabbaso vattetuṃ samatthabhāvo. Iti tesu tesu kiccesu attano ādhipaccasaṅkhātaṃ indaṭṭhaṃ karonti sādhentīti indriyāni. Indaṭṭhaṃ kārentītipi indriyāni. Issarā adhipatinoti vuttaṃ hoti. Tattha pañcacakkhādīni dassanādikiccesu cakkhuviññāṇādīnaṃ issarāhonti. Balavadubbalamanda tikkhādīsu attākārānuvattāpanato. Bhāvadvayaṃ itthākārādivasena pavattiyaṃ catusamuṭṭhānika rūpānaṃ sakalakhandhapañcakasseva vā issaro hoti. Aññathā appavattito. Tathā hi yasmiṃ santāne paṭisandhiyaṃ itthibhāvo pavattati. Tasmiṃ sabbe kammādipaccayā catusamuṭṭhānarūpasantatiṃ samuṭṭhāpentā itthākārasahitameva samuṭṭhāpenti, no aññathā. Chandacittādhippāyāpi tasmiṃ mandākārasahitāva pavattanti. Tabbiparītena purisasantānaṃ veditabbaṃ. Jīvitadvayaṃ rūpā rūpasantatīnaṃ ratti diva māsa saṃvaccharānukkamena addhānapharaṇe sahajātadhammānaṃ issaro hoti. Tesaṃ tadāyattavutti kattā. Mano vijānanakicce. Vedanāpañcakaṃ tathā tathā ārammaṇarasānubhavane. Saddhā ārammaṇāvīmuccane. Vīriyaṃ kammani alīna vuttibhāve. Sati ārammaṇupaṭṭhāne. Samādhi ārammaṇe niccalaṭṭhi tiyaṃ. Paññā asammohakicce sampayuttadhammānaṃ issaro hoti. Anaññābhibhavanīyabhāvena pavattanato. Yathā hi silāyaṃ pathavī sahajātehi anabhibhavanīyā hoti. Attanāvate abhibhavitvā visuṃ avijjamāneviya katvā pavattati. Yathā ca udake āpo aggimhi tejo vāte vāyo. Evaṃ sampadamidaṃ daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aññāyittha paṭivijjhitthāti aññātaṃ. Na aññātaṃ anaññātaṃ. Catusaccadhammo. Amataṃvā padaṃ. Anaññātaṃ ñassāmi jānissāmīti anaññātaññassāmi. Ākhyātikaṃpi hi padaṃ saññāsaddabhāve ṭhitaṃ nāmikaṭṭhāne tiṭṭhati. Yathā makkhaligosālo ehipassi koti. Evañhi sati tassa padantarena saha samāsabhāvo navirujjhatīti. Anaññātaññassāmīti evaṃ paṭipannassa indriyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anaññā taññassāmītindriyaṃ"
      },
      ". Ādimanasikārato paṭṭhāya tādisena ussāhena saha vipassanaṃ ārabhantassa tasmiṃ ussāhe apaṭipassaddheyeva sotāmattimaggaṃ paṭilabhantassa indriyanti vuttaṃ hoti. Ājānātīti aññaṃ. Tameva indriyanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññindriyaṃ,"
      },
      " pathamamaggena anaññātaṃ ñatvāpi kilesappahānakiccassa apariniṭṭhitattā tassa jānanakiccassa vippakatabhāvena yathā diṭṭhe tasmiṃ catusaccadhamme amatapadeeva vā punappunaṃ jānanakicca yuttānaṃ indriyanti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññātāvindriya"
      },
      "nti aññā tāvino ",
      " pariniṭṭhita ājānana kiccassa khīṇāsavassa indriyanti aññātāvindriyaṃ. Tividhaṃ petaṃ tathārūpe jānane sampayutta dhammānaṃ issaro hotīti veditabbaṃ."
    ],
    "innerText": "Aññāyittha paṭivijjhitthāti aññātaṃ. Na aññātaṃ anaññātaṃ. Catusaccadhammo. Amataṃvā padaṃ. Anaññātaṃ ñassāmi jānissāmīti anaññātaññassāmi. Ākhyātikaṃpi hi padaṃ saññāsaddabhāve ṭhitaṃ nāmikaṭṭhāne tiṭṭhati. Yathā makkhaligosālo ehipassi koti. Evañhi sati tassa padantarena saha samāsabhāvo navirujjhatīti. Anaññātaññassāmīti evaṃ paṭipannassa indriyaṃ anaññā taññassāmītindriyaṃ. Ādimanasikārato paṭṭhāya tādisena ussāhena saha vipassanaṃ ārabhantassa tasmiṃ ussāhe apaṭipassaddheyeva sotāmattimaggaṃ paṭilabhantassa indriyanti vuttaṃ hoti. Ājānātīti aññaṃ. Tameva indriyanti aññindriyaṃ, pathamamaggena anaññātaṃ ñatvāpi kilesappahānakiccassa apariniṭṭhitattā tassa jānanakiccassa vippakatabhāvena yathā diṭṭhe tasmiṃ catusaccadhamme amatapadeeva vā punappunaṃ jānanakicca yuttānaṃ indriyanti vuttaṃ hoti. Aññātāvindriyanti aññā tāvino pariniṭṭhita ājānana kiccassa khīṇāsavassa indriyanti aññātāvindriyaṃ. Tividhaṃ petaṃ tathārūpe jānane sampayutta dhammānaṃ issaro hotīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha imesaṃ sattānaṃ pākaṭe rūpakāye attagāhadaḷhattaṃ tabbimuttica imesaṃ apariññāya pariññāyaca hotīti dīpetuṃ ādito pañca pasādindriyāni vuttāni. Tassa attassa itthipuma tābhedo imesaṃ vasena hoti. Tasmiṃ vā itthipurisa gāho tabbimuttica imesaṃ apariññāya pariññāyaca hotīti dīpetuṃ kadanantaraṃ bhāvindriyadvayaṃ vuttaṃ. Soca attā imassa vasena jīvasaññaṃ labhati. Tasmiṃvā jīvagāho tabbimuttica imassa apariññāya pariññāyaca hotīti dīpetuṃ tadanantaraṃ jīvitindriyaṃ vuttaṃ. Idaṃ pana bhāvindriyato pure vattabbaṃpi rūpārūpa missakattā idha vuttanti daṭṭhabbaṃ. Nāmakāye attagāhadaḷhattaṃ tabbimuttica imassa apariññāya pariññāyaca hotīti dīpetuṃ nāmindriyesu manindriyaṃ ādito vuttaṃ. Soca arūpī attā imesaṃ vasena saṃkiliṭṭho vipphanditoca hoti. Tasmiṃvā sukhitadukkhitagāho tabbimuttica imesaṃ apariññāya pariññāyaca hotīti dīpetuṃ tadanantaraṃ pedanindriyapañcakaṃ vuttaṃ. Tassa saṃkiliṭṭhassa vodānappattiyā taṃtaṃgāhavimuttiyāvā paṭipattidassanatthaṃ tadanantaraṃ saddhādipañcindriyaṃ vuttaṃ. Tāya paṭipattiyā vodānappatti yā ādi majjha pariyosāna dassanatthaṃ ante tīṇi lokuttarindriyāni vuttānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[212] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[212] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Ettāvatā adhippetatthasiddhīti aññesaṃ agahaṇanti’’ vuttaṃ. Taṃ na yujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nahi santesupi aññesu indriyabhāvārahesu dhammesu ettāvatā adhippetatthasiddhiyā tesaṃ aññesaṃ bhagavato therassaca agahaṇanti yuttaṃ vattuṃ. Indriyabhāvārahassa aññassa asambhavato. Yadi hi sambhaveyya, sataṃpi sahassaṃpi gaṇhissatiyevāti. ",
      " Baliyanti uppannuppanne paṭipakkhadhamme sahanti maddantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "balāni"
      },
      ". Yathā abalānaṃ baliyanti. Maddantenaṃ parissayāti. Etthaca abalāti dubbalā. Nanti hīnavīriyaṃ janaṃ. Baliyantīti balasā karonti ajjhottharanti. Parissayāti abalā rāgādi parissayāti attho. Apica, paṭipakkhadhammehi akampiyaṭṭhena akkho bhaṇiyaṭṭhena balānināma. Tasmā assaddhiyasaṅkhātena paṭipakkhadhammena kampetuṃ asakkuṇeyyatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddhābalaṃ"
      },
      "nāma. Kosajjasaṅkhātena kampetuṃ asakkuṇeyyatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vīriyabalaṃ"
      },
      "nāma. Muṭṭhasaccena kampetuṃ asakkuṇeyyatā",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satibalaṃ"
      },
      "nāma. Uddhaccena kampetuṃ asakkuṇeyyatā",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samādhibalaṃ"
      },
      "nāma. Avijjāyakampetuṃ asakkuṇeyyatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññābalaṃ"
      },
      " nāma. Sesadukadvayaṃ pana aññamaññaṃ paṭipakkhenayojetabbaṃ."
    ],
    "innerText": "Nahi santesupi aññesu indriyabhāvārahesu dhammesu ettāvatā adhippetatthasiddhiyā tesaṃ aññesaṃ bhagavato therassaca agahaṇanti yuttaṃ vattuṃ. Indriyabhāvārahassa aññassa asambhavato. Yadi hi sambhaveyya, sataṃpi sahassaṃpi gaṇhissatiyevāti. Baliyanti uppannuppanne paṭipakkhadhamme sahanti maddantīti balāni. Yathā abalānaṃ baliyanti. Maddantenaṃ parissayāti. Etthaca abalāti dubbalā. Nanti hīnavīriyaṃ janaṃ. Baliyantīti balasā karonti ajjhottharanti. Parissayāti abalā rāgādi parissayāti attho. Apica, paṭipakkhadhammehi akampiyaṭṭhena akkho bhaṇiyaṭṭhena balānināma. Tasmā assaddhiyasaṅkhātena paṭipakkhadhammena kampetuṃ asakkuṇeyyatā saddhābalaṃnāma. Kosajjasaṅkhātena kampetuṃ asakkuṇeyyatā vīriyabalaṃnāma. Muṭṭhasaccena kampetuṃ asakkuṇeyyatāsatibalaṃnāma. Uddhaccena kampetuṃ asakkuṇeyyatāsamādhibalaṃnāma. Avijjāyakampetuṃ asakkuṇeyyatā paññābalaṃ nāma. Sesadukadvayaṃ pana aññamaññaṃ paṭipakkhenayojetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[213] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[213] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Pāpabaladukaṃ paṭipakkhena yojetuṃ nalabbhatīti katvā ‘‘ahirikānottappadvayaṃ pana sampayuttadhammesu thirabhāve nevāti’’ vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sampayuttadhammesu thirabhāvotica paṭipakkhehi akampiyatā tica atthato nānattābhāvatoti. Vīriyasamādhibalāni kusalākusalābyākatāni. Ahirikānottappāni akusalabalāni. Sesāni kusalābyākatānīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhipatī"
      },
      "ti ettha patīti sāmi issaro. So pana padesa issaro sakalissaroti duvidho. Tattha indriyāni paresaṃ visaye sayaṃ paravase vattitvā attano visayeeva parehi attano vase vattāpentīti padesissarā nāma. Pubbāti saṅkhāravasena pubbāgamanavasena vā visesetvā pavattaṃ adhipatiṭṭhānaṃ patvā pana añño dutiyo issaronāma natthi. Tasmā adhiko patīti adhipati. Attā dhīnavuttīnaṃ patīti adhipatītica vadanti."
    ],
    "innerText": "Sampayuttadhammesu thirabhāvotica paṭipakkhehi akampiyatā tica atthato nānattābhāvatoti. Vīriyasamādhibalāni kusalākusalābyākatāni. Ahirikānottappāni akusalabalāni. Sesāni kusalābyākatānīti. Adhipatīti ettha patīti sāmi issaro. So pana padesa issaro sakalissaroti duvidho. Tattha indriyāni paresaṃ visaye sayaṃ paravase vattitvā attano visayeeva parehi attano vase vattāpentīti padesissarā nāma. Pubbāti saṅkhāravasena pubbāgamanavasena vā visesetvā pavattaṃ adhipatiṭṭhānaṃ patvā pana añño dutiyo issaronāma natthi. Tasmā adhiko patīti adhipati. Attā dhīnavuttīnaṃ patīti adhipatītica vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Chandoeva adhipatīti chandādhipati. Chandavato kiṃnāma kammaṃ nasijjhatīti evaṃ pubbābhisaṅkhāravasenavā pubbe atītabhavesu suṭṭhu āsevitachandāgamanavasenavā tesu tesu kalyāṇa pāpakammesu sampayuttadhamme mahoghoviya tiṇapaṇṇakasaṭe attaparādhīne ",
      " niccaṃ paggahitadhure katvā pavatto kattukamyatā chando. Esa nayo sesesupi. Nanu cettha pacchimā tayo dhammā adhipatibhāvaṃ gaṇhantā indriyabhāvaṃ avijahitvāva gaṇhantīti adhipatibhūtāva samānā indriyakiccavasena paravasepi vattantīti. Saccaṃ, aññaṃ pana adhipatikiccaṃ, aññaṃ indriyakiccanti natthettha dosoti. Yathā hi rājā cakkavattī ekassa attano purohitassa santike ekaṃ dibbavijjaṃ gaṇhāti. Na ettāvatā rājā cakkavattināma nahoti. Naca vijjāhetu aññassa vasena vattati. Aññañhi cakkavatti rajjakiccaṃ, aññaṃ vijjāgahaṇa kiccanti. Evaṃ sampadamidaṃ daṭṭhabbaṃ. Tattha adhipatikiccaṃnāma taṃtaṃkicca visesaṃ anapekkhitvā atulyabalena abhibhavitvā sahajāta dhamme attano attano kiccesu anivattamāne katvā dhura vāhitā. Indriyakiccaṃ pana vijānanādikiccaṃ ārabbha pavuccatīti."
    ],
    "innerText": "Chandoeva adhipatīti chandādhipati. Chandavato kiṃnāma kammaṃ nasijjhatīti evaṃ pubbābhisaṅkhāravasenavā pubbe atītabhavesu suṭṭhu āsevitachandāgamanavasenavā tesu tesu kalyāṇa pāpakammesu sampayuttadhamme mahoghoviya tiṇapaṇṇakasaṭe attaparādhīne niccaṃ paggahitadhure katvā pavatto kattukamyatā chando. Esa nayo sesesupi. Nanu cettha pacchimā tayo dhammā adhipatibhāvaṃ gaṇhantā indriyabhāvaṃ avijahitvāva gaṇhantīti adhipatibhūtāva samānā indriyakiccavasena paravasepi vattantīti. Saccaṃ, aññaṃ pana adhipatikiccaṃ, aññaṃ indriyakiccanti natthettha dosoti. Yathā hi rājā cakkavattī ekassa attano purohitassa santike ekaṃ dibbavijjaṃ gaṇhāti. Na ettāvatā rājā cakkavattināma nahoti. Naca vijjāhetu aññassa vasena vattati. Aññañhi cakkavatti rajjakiccaṃ, aññaṃ vijjāgahaṇa kiccanti. Evaṃ sampadamidaṃ daṭṭhabbaṃ. Tattha adhipatikiccaṃnāma taṃtaṃkicca visesaṃ anapekkhitvā atulyabalena abhibhavitvā sahajāta dhamme attano attano kiccesu anivattamāne katvā dhura vāhitā. Indriyakiccaṃ pana vijānanādikiccaṃ ārabbha pavuccatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Āharanti sahajātādipaccayasāmaññato atirekena asādhāraṇapaccayasattivisesena haranti pavattentīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āhārā"
      },
      ". Āharantivā ajjhattasambhūtā te te paccayadhammā paccayuppannadhammāca attānañceva attano attano paccayakiccaṃ paccayuppannakiccañca suṭṭhu haranti vahanti etehīti āhārā. Yathāhasabbe sattā āhāraṭṭhitikāti. Etthaca sabbe sattāti etena sabbe ajjhattasambhūtā paccayapaccayuppannadhammā vuttā. Āhāraṭṭhitikāti paccayaṭṭhitikā. Yathārahaṃ catuvīsatipaccayehi ṭhitisabhāvāti attho. Nanucettha paccayāhārova vutto. Na āhārapaccayo. Idha pana catubbidho āhārapaccayadhammova vuttoti. Saccaṃ, paccayaṭṭhena pana āhāranāmakānaṃ sabbesaṃ catuvīsatipaccayadhammānaṃ majjhe yedhammā cattāro āhārāti visesetvā vuttā. Te tesaṃ paccayāhārānaṃpi āhārabhūtāti siddhā hontīti. Imasmiṃ atthe catunnaṃ āhārānaṃ mahanta bhāvo pākaṭo hotīti."
    ],
    "innerText": "Āharanti sahajātādipaccayasāmaññato atirekena asādhāraṇapaccayasattivisesena haranti pavattentīti āhārā. Āharantivā ajjhattasambhūtā te te paccayadhammā paccayuppannadhammāca attānañceva attano attano paccayakiccaṃ paccayuppannakiccañca suṭṭhu haranti vahanti etehīti āhārā. Yathāhasabbe sattā āhāraṭṭhitikāti. Etthaca sabbe sattāti etena sabbe ajjhattasambhūtā paccayapaccayuppannadhammā vuttā. Āhāraṭṭhitikāti paccayaṭṭhitikā. Yathārahaṃ catuvīsatipaccayehi ṭhitisabhāvāti attho. Nanucettha paccayāhārova vutto. Na āhārapaccayo. Idha pana catubbidho āhārapaccayadhammova vuttoti. Saccaṃ, paccayaṭṭhena pana āhāranāmakānaṃ sabbesaṃ catuvīsatipaccayadhammānaṃ majjhe yedhammā cattāro āhārāti visesetvā vuttā. Te tesaṃ paccayāhārānaṃpi āhārabhūtāti siddhā hontīti. Imasmiṃ atthe catunnaṃ āhārānaṃ mahanta bhāvo pākaṭo hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yathā yavabījānaṃvā sālibījānaṃvā ānubhāvo nāma kaḷiraṅkurānaṃ uppādāna padhānaṃ hoti. Tatoparaṃ pana sassabhāvaṃ ",
      " patvā cha pañca māse vaḍḍhiyāvā ṭhitiyāvā pathavi rasaāporasānaṃ ānubhāvo padhānaṃ hoti. Evamevaṃ kabaḷī kārāhārūpajīvīnaṃ kāmasattānaṃ kammassa ānubhāvonāma paṭisandhirūpuppādane padhānaṃ hoti. Tatoparaṃ pana yāvatāyukaṃ vaḍḍhīyāvāṭhitiyāvā utuāhārānaṃ ānubhāvo padhānaṃ hoti. Kammajarūpāni hi yāva āsannamaraṇā pavattamānānipi utuāhārehi anuggahitānieva pavattanti. Utuca āhāru patthambhitoyeva attano kiccaṃ karoti. Tasmā tesaṃ sattānaṃ catusantatirūpaṃ kabaḷīkārāhārena anupatthambhīyamānaṃ ciraṃ napavattati. Upatthambhīyamānaṃeva yāvatāyukaṃ pavattati. Yathāca sakuṇāvā ḍaṃsamakasā dayovā tuṇḍena āhāraṃ gahetvā attabhāvaṃ posenti. Tuṇḍe asante āhāraṃ alabhantā maranti. Evameva ime sattā phassena ārammaṇesu rasaṃ gahetvā vedanāsaṅkhātaṃ upabhogaparibhogaṃ sampādetvā taṇhāvepullaṃ patvā tividhaṃ vaṭṭaṃ pūretvā yāvajjatanāpi vaṭṭe anukaṇṭhamānā pavattanti."
    ],
    "innerText": "Tattha yathā yavabījānaṃvā sālibījānaṃvā ānubhāvo nāma kaḷiraṅkurānaṃ uppādāna padhānaṃ hoti. Tatoparaṃ pana sassabhāvaṃ patvā cha pañca māse vaḍḍhiyāvā ṭhitiyāvā pathavi rasaāporasānaṃ ānubhāvo padhānaṃ hoti. Evamevaṃ kabaḷī kārāhārūpajīvīnaṃ kāmasattānaṃ kammassa ānubhāvonāma paṭisandhirūpuppādane padhānaṃ hoti. Tatoparaṃ pana yāvatāyukaṃ vaḍḍhīyāvāṭhitiyāvā utuāhārānaṃ ānubhāvo padhānaṃ hoti. Kammajarūpāni hi yāva āsannamaraṇā pavattamānānipi utuāhārehi anuggahitānieva pavattanti. Utuca āhāru patthambhitoyeva attano kiccaṃ karoti. Tasmā tesaṃ sattānaṃ catusantatirūpaṃ kabaḷīkārāhārena anupatthambhīyamānaṃ ciraṃ napavattati. Upatthambhīyamānaṃeva yāvatāyukaṃ pavattati. Yathāca sakuṇāvā ḍaṃsamakasā dayovā tuṇḍena āhāraṃ gahetvā attabhāvaṃ posenti. Tuṇḍe asante āhāraṃ alabhantā maranti. Evameva ime sattā phassena ārammaṇesu rasaṃ gahetvā vedanāsaṅkhātaṃ upabhogaparibhogaṃ sampādetvā taṇhāvepullaṃ patvā tividhaṃ vaṭṭaṃ pūretvā yāvajjatanāpi vaṭṭe anukaṇṭhamānā pavattanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadi hi phassonāma na siyā, ārammaṇarasaṃ alabhitvā vedanā paribhogarahitena taṇhuppattiyā okāso natthīti tividhavaṭṭameva nasiyāti. Yathāca te sakuṇādayo pakkhe viyūhitvā antarā apatamānā rukkhato rukkhaṃ vanato vanaṃ vicaritvā attānaṃ yāpenti. Pakkhesu asantesu gamanaṃ asampādentā patitvā maranti. Evamevaṃ ime sattā āyūhanalakkhaṇāya cetanāya cetayitvā kammasamaṅgitaṃ sampādetvā bhavato bhavaṃ vicaritvā yāvajjatanā vaṭṭe saṃsaranti. Yadi hi cetanānāma na siyā, kammavaṭṭassa abhāvo. Tadabhāveca vipākavaṭṭassa abhāvo. Tadabhāveca tadanusayitassa kilesavaṭṭassa abhāvoti vaṭṭaṃnāma na siyāti. Yathāca te sakuṇādayo cakkhunā gocaraṭṭhānaṃvā taṃtaṃdisābhāgaṃvā vibhāvetvā yāvajīvaṃ attānaṃ yāpenti. Cakkhusmiṃ asante kiñcigahetabbavatthuṃvā gantabbaṭṭhānaṃvā alabhitvā tattheva maranti. Evamevaṃ ",
      " sampayuttā dhammā ārammaṇavijānalakkhaṇena viññāṇena taṃtaṃārammaṇaṃ labhitvā tasmiṃ tasmiṃ phassādayo uppādetvā tividhaṃ vaṭṭaṃ vaṭṭenti. Yadi hi viññāṇaṃnāma na siyā, phassādīnaṃ ārammaṇalābhoyeva natthīti vaṭṭameva na siyāti. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cattāro āhārā.La. Viññāṇaṃ catuttha"
      },
      "nti. Saṃyuttakeca –"
    ],
    "innerText": "Yadi hi phassonāma na siyā, ārammaṇarasaṃ alabhitvā vedanā paribhogarahitena taṇhuppattiyā okāso natthīti tividhavaṭṭameva nasiyāti. Yathāca te sakuṇādayo pakkhe viyūhitvā antarā apatamānā rukkhato rukkhaṃ vanato vanaṃ vicaritvā attānaṃ yāpenti. Pakkhesu asantesu gamanaṃ asampādentā patitvā maranti. Evamevaṃ ime sattā āyūhanalakkhaṇāya cetanāya cetayitvā kammasamaṅgitaṃ sampādetvā bhavato bhavaṃ vicaritvā yāvajjatanā vaṭṭe saṃsaranti. Yadi hi cetanānāma na siyā, kammavaṭṭassa abhāvo. Tadabhāveca vipākavaṭṭassa abhāvo. Tadabhāveca tadanusayitassa kilesavaṭṭassa abhāvoti vaṭṭaṃnāma na siyāti. Yathāca te sakuṇādayo cakkhunā gocaraṭṭhānaṃvā taṃtaṃdisābhāgaṃvā vibhāvetvā yāvajīvaṃ attānaṃ yāpenti. Cakkhusmiṃ asante kiñcigahetabbavatthuṃvā gantabbaṭṭhānaṃvā alabhitvā tattheva maranti. Evamevaṃ sampayuttā dhammā ārammaṇavijānalakkhaṇena viññāṇena taṃtaṃārammaṇaṃ labhitvā tasmiṃ tasmiṃ phassādayo uppādetvā tividhaṃ vaṭṭaṃ vaṭṭenti. Yadi hi viññāṇaṃnāma na siyā, phassādīnaṃ ārammaṇalābhoyeva natthīti vaṭṭameva na siyāti. Tenāha cattāro āhārā.La. Viññāṇaṃ catutthanti. Saṃyuttakeca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Cattārome bhikkhave āhārā bhūtānaṃ vā sattānaṃ ṭhitiyā sambhavesīnaṃvā sattānaṃ anuggahāya kabaḷīkāro āhāro oḷārikovā sukhumovā, phasso dutīyo, manosañcetanā tatīyā, viññāṇaṃ catutthanti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha bhūtānanti vuddhippattānaṃ. Sambhavesīnanti kalalādi kāle ṭhitānaṃ. Catunnaṃpana āhārānaṃ yathāsambhavaṃ anamatagge saṃsāravaṭṭevā tasmiṃ tasmiṃ bhavevā ṭhitiyāvā anuggahāyavā pavatti ākāro vuttanayena veditabbo. Aṭṭhakathāyaṃ pana kopanettha āhāro. Kiṃ āhāretīti. Kabaḷīkārā hāro ojaṭṭhamakarūpāni āhāreti. Phassāhāro tisso vedanā. Manosañcetanāhāro tayo bhave. Viññāṇā hāro paṭisandhināmarūpanti vuttaṃ. Taṃ pākaṭaphalavasena vuttanti daṭṭhabbaṃ. Ojaṭṭhamakarūpuppādanaṃ pana kabaḷīkārāhārassa mahantaṃ kiccaṃ nahoti. Catusantatirūpupatthambhanameva mahantaṃ. Teneva hi pāḷiyaṃ ṭhitiyātica anuggahāyātica vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica yathā upanissayāsevanapaccayā suttanti kapariyāyā abhidhammapariyāyātica duvidhā honti. Tathā āhārapaccayopi duvidho. Tattha yaṃ vuttaṃ manosañcetanāhāro tayobhaveti. Taṃ suttantikapariyāyaṃ sandhāya vuttaṃ. Nahi paṭṭhāne arūpā hārā asahajātānaṃ dhammānaṃ āhāraṭṭhena paccayānāma hontīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcaviññāṇesu jhānaṅgāni nalabbhanti"
      },
      ". Tāni hi dubbalakiccaṭṭhānavatthukattā rūpādīsu abhinipātamattāni hontīti na tesu vijjamānā vedanā ekaggatā jhānakiccaṃ sādhentīti. Vitakkapacchimakaṃ jhānantica ",
      " vuttaṃ. Jhānaṅgānaṃ nāyakabhūtoca vitakko tesu natthīti tattha tāvedanā ekaggatāyo taṃ na sādhentīti. Vīriyupatthambharahitā dhammā sampayuttadhammesu thirabhāvappattā nahontīti avīriyesu soḷasāhetukacittesu samādhibalakiccaṃ na sādheti. Vīriyapacchimakaṃ balanti hi vuttanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avīriyesu balāni nalabbhantī"
      },
      "ti. Heturahitā ca dhammā vaṭṭassa vivaṭṭassaca pattiyā pathabhāvaṃ nagacchanti. Hetupacchimako maggoti hi vuttanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ahetukesu maggaṅgāni na labbhantī"
      },
      "ti. Vicikicchāsampayuttecitte ekaggatā adhimokkharahi tattā ekantena saṃsappanasabhāvāya vicikicchāya abhibhūtattā ca maggindriyabalabhāvāya balavatī nahotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vicikicchā citte ekaggatā maggindriyabalabhāvaṃ na gacchatī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvihetuka tihetuka javanesvevā"
      },
      "ti ettha dvihetuka tihetukasaddena momūhadvayahasanajavanāni nivatteti. Javanasaddena tibhūmakāni dvihetukatihetukavipākāni nivatteti."
    ],
    "innerText": "Apica yathā upanissayāsevanapaccayā suttanti kapariyāyā abhidhammapariyāyātica duvidhā honti. Tathā āhārapaccayopi duvidho. Tattha yaṃ vuttaṃ manosañcetanāhāro tayobhaveti. Taṃ suttantikapariyāyaṃ sandhāya vuttaṃ. Nahi paṭṭhāne arūpā hārā asahajātānaṃ dhammānaṃ āhāraṭṭhena paccayānāma hontīti. Pañcaviññāṇesu jhānaṅgāni nalabbhanti. Tāni hi dubbalakiccaṭṭhānavatthukattā rūpādīsu abhinipātamattāni hontīti na tesu vijjamānā vedanā ekaggatā jhānakiccaṃ sādhentīti. Vitakkapacchimakaṃ jhānantica vuttaṃ. Jhānaṅgānaṃ nāyakabhūtoca vitakko tesu natthīti tattha tāvedanā ekaggatāyo taṃ na sādhentīti. Vīriyupatthambharahitā dhammā sampayuttadhammesu thirabhāvappattā nahontīti avīriyesu soḷasāhetukacittesu samādhibalakiccaṃ na sādheti. Vīriyapacchimakaṃ balanti hi vuttanti āha avīriyesu balāni nalabbhantīti. Heturahitā ca dhammā vaṭṭassa vivaṭṭassaca pattiyā pathabhāvaṃ nagacchanti. Hetupacchimako maggoti hi vuttanti āha ahetukesu maggaṅgāni na labbhantīti. Vicikicchāsampayuttecitte ekaggatā adhimokkharahi tattā ekantena saṃsappanasabhāvāya vicikicchāya abhibhūtattā ca maggindriyabalabhāvāya balavatī nahotīti vuttaṃ vicikicchā citte ekaggatā maggindriyabalabhāvaṃ na gacchatīti. Dvihetuka tihetuka javanesvevāti ettha dvihetuka tihetukasaddena momūhadvayahasanajavanāni nivatteti. Javanasaddena tibhūmakāni dvihetukatihetukavipākāni nivatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[214] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[214] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Dvihetukatihetukagahaṇena ekahetukesu adhipatīnaṃ abhāvaṃ dassetī’’ti vuttaṃ, javanabhāvasāmaññattā pana hasanacittepi tesaṃ abhāvo dassetabboyeva hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathāsambhava"
      },
      "nti laddhapubbāti saṅkhārassa laddhapubbāgamassa ca ekekassa adhipatino sambhavānurūpaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekova labbhati"
      },
      ". Na dutiyo. Itarathā adhipatieva nasiyāti. Evañca katvā paṭṭhāne yathā indriyapaccayavibhaṅge arūpinoindriyā sampayuttakānaṃdhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ indriyapaccayena paccayoti vuttaṃ. Na tathā adhipatipaccayavibhaṅge. Tattha pana chandādhipati chandasampayuttakānantiādinā ekekādhipati vibhāgavaseneva vuttanti. Evañhi sati adhipati indriyānaṃ viseso pākaṭo hotīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Naveritā"
      },
      "ti nava īritā kathitā. Kusalā kusalā byākatehi samākiṇṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kusalādi samākiṇṇo"
      },
      ". [Missakasaṅgaho]"
    ],
    "innerText": "Yathāsambhavanti laddhapubbāti saṅkhārassa laddhapubbāgamassa ca ekekassa adhipatino sambhavānurūpaṃ ekova labbhati. Na dutiyo. Itarathā adhipatieva nasiyāti. Evañca katvā paṭṭhāne yathā indriyapaccayavibhaṅge arūpinoindriyā sampayuttakānaṃdhammānaṃ taṃsamuṭṭhānānañca rūpānaṃ indriyapaccayena paccayoti vuttaṃ. Na tathā adhipatipaccayavibhaṅge. Tattha pana chandādhipati chandasampayuttakānantiādinā ekekādhipati vibhāgavaseneva vuttanti. Evañhi sati adhipati indriyānaṃ viseso pākaṭo hotīti. Naveritāti nava īritā kathitā. Kusalā kusalā byākatehi samākiṇṇo kusalādi samākiṇṇo. [Missakasaṅgaho]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "164"
      },
      ". Cattāri ",
      " saccāni bujjhatīti bodhi. Bujjhantivā tāni taṃ samaṅgino etāyāti bodhi. Catumaggañāṇaṃ. Vuttañhetaṃ mahā niddese bodhi vuccati catūsu maggesu-ñāṇanti. Pakkhoti koṭṭhāso sambhāro. Bodhiyā pakkhe bhavāti bodhipakkhiyā. Adhisīlā dhicittā dhipaññā saṅkhātāsu tīsu sikkhāsu pariyāpannānaṃ satthusāsanadhammānaṃ etaṃnāmaṃ. Te pana koṭṭhāsato satta vidhā hontīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cattārosatipaṭṭhānā"
      },
      "tiādi. Sampayutta dhammesu pamukhā padhānā hutvā kāyādīsu ārammaṇesu tiṭṭhanti nānārammaṇesu cittagamanaṃ nivattetvā tesveva kāyādīsu citta nibandhanavasena pavattantīti paṭṭhānāni. Satieva paṭṭhānānīti sati paṭṭhānāni. Cattārisatipaṭṭhānānīti vattabbe dhammabhāvaṃ apekkhitvā cattārosatipaṭṭhānā tivuttanti daṭṭhabbaṃ. Kāyeanupassanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyā nupassanā"
      },
      ". Rūpakāye rūpasamūhe assāsapassāsādikassa avayavakāyassa taṃtaṃkāyabhāvenavā aniccādibhāvenavā yāva tasmiṃ tasmiṃ kāye sammoho pahiyyati. Tāva punappunaṃ nirantaraṃ samanupassanāti attho. Navappabhedāsu vedanāsu sukhavedanādi kāyaavayavavedanāya taṃtaṃ vedanābhāvena udayabbayavasena ca anupassanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedanānupassanā"
      },
      ". Soḷasa pabhedesu sarāgā dīsu cittesu sarāgādikassa avayavacittassa taṃtaṃ cittabhāvena udayabbayavasenaca anupassanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cittānupassanā"
      },
      ". Pañcapabhedesu nīvaraṇādīsu dhammesu kāmacchandādikassa avayavadhammassa taṃ taṃ dhammabhāvena udayabbayavasenaca anupassanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammānupassanā"
      },
      "."
    ],
    "innerText": "164. Cattāri saccāni bujjhatīti bodhi. Bujjhantivā tāni taṃ samaṅgino etāyāti bodhi. Catumaggañāṇaṃ. Vuttañhetaṃ mahā niddese bodhi vuccati catūsu maggesu-ñāṇanti. Pakkhoti koṭṭhāso sambhāro. Bodhiyā pakkhe bhavāti bodhipakkhiyā. Adhisīlā dhicittā dhipaññā saṅkhātāsu tīsu sikkhāsu pariyāpannānaṃ satthusāsanadhammānaṃ etaṃnāmaṃ. Te pana koṭṭhāsato satta vidhā hontīti āha cattārosatipaṭṭhānātiādi. Sampayutta dhammesu pamukhā padhānā hutvā kāyādīsu ārammaṇesu tiṭṭhanti nānārammaṇesu cittagamanaṃ nivattetvā tesveva kāyādīsu citta nibandhanavasena pavattantīti paṭṭhānāni. Satieva paṭṭhānānīti sati paṭṭhānāni. Cattārisatipaṭṭhānānīti vattabbe dhammabhāvaṃ apekkhitvā cattārosatipaṭṭhānā tivuttanti daṭṭhabbaṃ. Kāyeanupassanā kāyā nupassanā. Rūpakāye rūpasamūhe assāsapassāsādikassa avayavakāyassa taṃtaṃkāyabhāvenavā aniccādibhāvenavā yāva tasmiṃ tasmiṃ kāye sammoho pahiyyati. Tāva punappunaṃ nirantaraṃ samanupassanāti attho. Navappabhedāsu vedanāsu sukhavedanādi kāyaavayavavedanāya taṃtaṃ vedanābhāvena udayabbayavasena ca anupassanā vedanānupassanā. Soḷasa pabhedesu sarāgā dīsu cittesu sarāgādikassa avayavacittassa taṃtaṃ cittabhāvena udayabbayavasenaca anupassanā cittānupassanā. Pañcapabhedesu nīvaraṇādīsu dhammesu kāmacchandādikassa avayavadhammassa taṃ taṃ dhammabhāvena udayabbayavasenaca anupassanā dhammānupassanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[215]"
      },
      " Yaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[215] Yaṃ pana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Kucchitānaṃ kesādīnaṃ āyoti kāyo. Assāsa passāsānaṃvā samūho kāyo’’ti vuttaṃ. Taṃ na sundara meva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[216]"
      },
      " Yañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha"
      }
    ],
    "innerText": "[216] Yañca tattha"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Kāyassa anupassanā kāyānupassanā’’ti vuttaṃ. Taṃpi na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kāye ",
      " kāyānupassī viharatīti hi vuttaṃ. Etena hi kāye anupassanā kāyānupassanāti ayamatthova padhānato dassitoti."
    ],
    "innerText": "Kāye kāyānupassī viharatīti hi vuttaṃ. Etena hi kāye anupassanā kāyānupassanāti ayamatthova padhānato dassitoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[217]"
      },
      " Yañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha"
      }
    ],
    "innerText": "[217] Yañca tattha"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Vedanānaṃ vasena anupassanā’’ti vuttaṃ. Taṃpi na sundaraṃ. Vedanāsu vedanānupassīti hi vuttaṃ. Tathā cittānupassanā padepi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[218]"
      },
      " Yaṃpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha"
      }
    ],
    "innerText": "[218] Yaṃpi tattha"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Saññāsaṅkhārānaṃ dhammānaṃ bhinnalakkhaṇānameva anupassanā dhammānupassanā’’ti vuttaṃ. Taṃpi na sundarameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na hi katthaci pāḷiyaṃ saññāsaṅkhārāva visesetvā dhammāti vuttā atthīti. Pāḷiyañhi chanīvaraṇā pathamaṃ dhammāti vuttā. Tato pañcupādānakkhandhā. Tato dvādasāyatanāni. Tato sattabojjhaṅgā. Tato cattāri saccānīti. Yadievaṃ ekāya dhammānupassanāya vuttāya itarāpi siddhāti satipaṭṭhānaṃ ekameva vattabbaṃ, na cattāroti.Na. Yo hi dhammānupassanāyaṃ rūpakkhandho vutto. So ruppanalakkhaṇānupassanavasena vutto. Ruppanalakkhaṇañhi nibbattitapara matthadhammo. Soca tathā anupassantassa visesato sukhumassa attavipallāsassa pahānāya hotīti. Kāyoti pana taṃtaṃ samūhabhūtarūpadhammavasena veditabbo. Naruppanalakkhaṇavasena. Naca taṃtaṃ kāyabhāvena gahito taṃtaṃ rūpadhammasamūho nibbattita paramatthadhammonāma hoti. Paññattimissakattā. Soca tathā anupassantassa visesato oḷārikassa subhādi vipallāsassa pahānāya hotīti. Tathā vedanācittesupi oḷārikavipallāso sukhumavipallāsoti dve dve vipallāsā honti. Tattha attupanibandhā niccasukha vipallāsā oḷārikā. Attavipallāso sukhumo. Tattha vedanā cittā nupassanā oḷārikavipallāsānaṃ pahānāya visuṃ vuttā. Dhammesu vedanākkhandhaviññāṇakkhandhā sukhuma vipallāsa pahānāyāti. Tasmā cattārova satipaṭṭhānā vattabbāti. Sammā padahanti etehīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammappadhānāni"
      },
      ". Kāmaṃ tacoca ",
      " nhāruca, aṭṭhica avasissatu. Upassussatu me sarīre maṃsalohitaṃ. Yantaṃ purisathāmena purisaparakkamena pattabbaṃ. Na taṃ apatvā vīriyassa saṇṭhānaṃ bhavissatīti evaṃ anivattanavutti vasena pavattassa sammāvāyāmassa etaṃ nāmaṃ. So pana tathā pavatto ekopi samāno kiccasiddhivasena catudhā hotīti. Vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uppannāna"
      },
      "ntiādi."
    ],
    "innerText": "Na hi katthaci pāḷiyaṃ saññāsaṅkhārāva visesetvā dhammāti vuttā atthīti. Pāḷiyañhi chanīvaraṇā pathamaṃ dhammāti vuttā. Tato pañcupādānakkhandhā. Tato dvādasāyatanāni. Tato sattabojjhaṅgā. Tato cattāri saccānīti. Yadievaṃ ekāya dhammānupassanāya vuttāya itarāpi siddhāti satipaṭṭhānaṃ ekameva vattabbaṃ, na cattāroti.Na. Yo hi dhammānupassanāyaṃ rūpakkhandho vutto. So ruppanalakkhaṇānupassanavasena vutto. Ruppanalakkhaṇañhi nibbattitapara matthadhammo. Soca tathā anupassantassa visesato sukhumassa attavipallāsassa pahānāya hotīti. Kāyoti pana taṃtaṃ samūhabhūtarūpadhammavasena veditabbo. Naruppanalakkhaṇavasena. Naca taṃtaṃ kāyabhāvena gahito taṃtaṃ rūpadhammasamūho nibbattita paramatthadhammonāma hoti. Paññattimissakattā. Soca tathā anupassantassa visesato oḷārikassa subhādi vipallāsassa pahānāya hotīti. Tathā vedanācittesupi oḷārikavipallāso sukhumavipallāsoti dve dve vipallāsā honti. Tattha attupanibandhā niccasukha vipallāsā oḷārikā. Attavipallāso sukhumo. Tattha vedanā cittā nupassanā oḷārikavipallāsānaṃ pahānāya visuṃ vuttā. Dhammesu vedanākkhandhaviññāṇakkhandhā sukhuma vipallāsa pahānāyāti. Tasmā cattārova satipaṭṭhānā vattabbāti. Sammā padahanti etehīti sammappadhānāni. Kāmaṃ tacoca nhāruca, aṭṭhica avasissatu. Upassussatu me sarīre maṃsalohitaṃ. Yantaṃ purisathāmena purisaparakkamena pattabbaṃ. Na taṃ apatvā vīriyassa saṇṭhānaṃ bhavissatīti evaṃ anivattanavutti vasena pavattassa sammāvāyāmassa etaṃ nāmaṃ. So pana tathā pavatto ekopi samāno kiccasiddhivasena catudhā hotīti. Vuttaṃ uppannānantiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uppannānaṃpāpakāna"
      },
      "nti asukasmiṃ kāle dese ṭhāne vā ahaṃ idañcidañca nāma pāpaṃ akāsiṃ, idañcidañcanāma mayhaṃ uppannanti evaṃ attano santāne uppannabhāvena viditānaṃ akusalānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pahānāyā"
      },
      "ti tesaṃ attano santāne ajjatagge yāvaparinibbānāpuna anuppādadhammatāpādanakaraṇatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vāyāmo"
      },
      "ti sīla pūraṇa samatha vipassanābhāvanākammesu daḷhaṃ vāyāmo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuppannāna"
      },
      "nti attano santāne uppannapubbanti aviditānaṃ parasantānesuvā suttantesuvā disvāvā sutvāvā viditānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuppādāyā"
      },
      "ti yesaṃ akusala mūlānaṃ atthitāya imesaṃ sattānaṃ īdisāni kilesajātāni vā pāpakammānivā uppajjanti. Tāni mayi vijjantieva. Ahaṃpi tehi kilesehivā kammehivā aparimuttoyeva. Ahaṃpi svevā parasuvevā bhavantaresuvā tāni attano santāne uppādessā miyevāti evaṃ paccavekkhitvā tesaṃ akusalamūlānaṃ attano santāne uppattiyā paccayasamucchindanatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuppannānaṃkusalāna"
      },
      "nti catubhūmakesu kusaladhammesu sattavisuddhipabhedesu imenāma visuddhidhammā mayā appattā anadhigatāeva hontīti evaṃ ñatvā samaye anatikkanteeva appattānaṃ anadhigatānaṃ upari visuddhidhammānaṃ adhigamanatthāya."
    ],
    "innerText": "Tattha uppannānaṃpāpakānanti asukasmiṃ kāle dese ṭhāne vā ahaṃ idañcidañca nāma pāpaṃ akāsiṃ, idañcidañcanāma mayhaṃ uppannanti evaṃ attano santāne uppannabhāvena viditānaṃ akusalānaṃ. Pahānāyāti tesaṃ attano santāne ajjatagge yāvaparinibbānāpuna anuppādadhammatāpādanakaraṇatthaṃ. Vāyāmoti sīla pūraṇa samatha vipassanābhāvanākammesu daḷhaṃ vāyāmo. Anuppannānanti attano santāne uppannapubbanti aviditānaṃ parasantānesuvā suttantesuvā disvāvā sutvāvā viditānaṃ. Anuppādāyāti yesaṃ akusala mūlānaṃ atthitāya imesaṃ sattānaṃ īdisāni kilesajātāni vā pāpakammānivā uppajjanti. Tāni mayi vijjantieva. Ahaṃpi tehi kilesehivā kammehivā aparimuttoyeva. Ahaṃpi svevā parasuvevā bhavantaresuvā tāni attano santāne uppādessā miyevāti evaṃ paccavekkhitvā tesaṃ akusalamūlānaṃ attano santāne uppattiyā paccayasamucchindanatthaṃ. Anuppannānaṃkusalānanti catubhūmakesu kusaladhammesu sattavisuddhipabhedesu imenāma visuddhidhammā mayā appattā anadhigatāeva hontīti evaṃ ñatvā samaye anatikkanteeva appattānaṃ anadhigatānaṃ upari visuddhidhammānaṃ adhigamanatthāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppannānaṃ kusalānaṃ bhiyyo bhāvāyā"
      },
      "ti yāni sīlādīni kusalāni mayi uppannāni. Tāni yāva niyāmaṃ naokkamanti, tāva mayhaṃ etānīti vattuṃ nārahanti. Svevā parasuvevā bhavantaraṃ patvāvā bhijjissanti yevāti evaṃ paccavekkhitvā attano santāne uppannānaṃ tesaṃ sabbaso akuppadhammatāpādanavasena suṭṭhutaraṃ vaḍḍhanatthāya. Etesu pana catūsu mukhesu yena kenaci ekena mukhena ",
      " uppanno vāyāmo catukiccasādhakoeva hotīti veditabbo. Aṭṭhakathāyaṃ pana maggakkhaṇe eva ekassa tassa catukiccasādhakatā vuttāti."
    ],
    "innerText": "Uppannānaṃ kusalānaṃ bhiyyo bhāvāyāti yāni sīlādīni kusalāni mayi uppannāni. Tāni yāva niyāmaṃ naokkamanti, tāva mayhaṃ etānīti vattuṃ nārahanti. Svevā parasuvevā bhavantaraṃ patvāvā bhijjissanti yevāti evaṃ paccavekkhitvā attano santāne uppannānaṃ tesaṃ sabbaso akuppadhammatāpādanavasena suṭṭhutaraṃ vaḍḍhanatthāya. Etesu pana catūsu mukhesu yena kenaci ekena mukhena uppanno vāyāmo catukiccasādhakoeva hotīti veditabbo. Aṭṭhakathāyaṃ pana maggakkhaṇe eva ekassa tassa catukiccasādhakatā vuttāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ijjhanaṃ iddhi, tassa tassa yogakammassa siddhi samiddhi nibbattīti attho. Sā pana saṅkhepato abhiññeyyānaṃ dhammānaṃ abhiññāsiddhi, pariññeyyānaṃ pariññāsiddhi, pahātabbānaṃ pahānasiddhi, sacchikā tabbānaṃ sacchikaraṇasiddhi, bhāvetabbānaṃ bhāvanāsiddhīti pañcavidhā hoti. Ijjhatītivā iddhi satthusāsane yogakammena ijjhantānaṃ sabbesaṃ mahaggata lokuttaradhammānaṃ nāmaṃ. Pajjati etenāti pādo. Iddhiyā pādoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iddhipādo"
      },
      ". Iddhipattiyā balavupāyo padhānakāraṇanti vuttaṃ hoti. So pana catunnaṃ adhipatidhammānaṃ vasena catudhā hotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cattāro iddhipādā"
      },
      "tiādi. Adhipatibhūto chandova iddhipādoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chandiddhipādo"
      },
      ". Esanayo sesesupīti. Etthaca sabbe mahaggatānuttarabhūtā uttarimanussa dhammānāma napākatikena chandenavā vīriyenavā cittenavā paññāya vā adhigantabbā honti. Yena kenaci palibodhena paṭibāhituṃ asakkuṇeyyena adhipatibhāvapattena chandādināeva adhigantabbā. Tasmā ime cattāro dhammā adhipatibhūtāva idha adhippetāti daṭṭhabbāti."
    ],
    "innerText": "Ijjhanaṃ iddhi, tassa tassa yogakammassa siddhi samiddhi nibbattīti attho. Sā pana saṅkhepato abhiññeyyānaṃ dhammānaṃ abhiññāsiddhi, pariññeyyānaṃ pariññāsiddhi, pahātabbānaṃ pahānasiddhi, sacchikā tabbānaṃ sacchikaraṇasiddhi, bhāvetabbānaṃ bhāvanāsiddhīti pañcavidhā hoti. Ijjhatītivā iddhi satthusāsane yogakammena ijjhantānaṃ sabbesaṃ mahaggata lokuttaradhammānaṃ nāmaṃ. Pajjati etenāti pādo. Iddhiyā pādoti iddhipādo. Iddhipattiyā balavupāyo padhānakāraṇanti vuttaṃ hoti. So pana catunnaṃ adhipatidhammānaṃ vasena catudhā hotīti vuttaṃ cattāro iddhipādātiādi. Adhipatibhūto chandova iddhipādoti chandiddhipādo. Esanayo sesesupīti. Etthaca sabbe mahaggatānuttarabhūtā uttarimanussa dhammānāma napākatikena chandenavā vīriyenavā cittenavā paññāya vā adhigantabbā honti. Yena kenaci palibodhena paṭibāhituṃ asakkuṇeyyena adhipatibhāvapattena chandādināeva adhigantabbā. Tasmā ime cattāro dhammā adhipatibhūtāva idha adhippetāti daṭṭhabbāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[219]"
      },
      " Yaṃpana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[219] Yaṃpana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Ijjhati adhiṭṭhānādikaṃ etāyāti iddhi, iddhividhaññāṇaṃ. Iddhiyā pādo iddhipādo’’ti vuttaṃ. Taṃ saṃyuttake katamāca bhikkhave iddhi. Idha bhikkhave bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti. Ekopi hutvā bahudhā hoti.La. Yāva brahmalokāpi kāyena vasaṃ vatteti. Ayaṃ vuccati bhikkhave iddhīti imāya pāḷiyā sameti. Evaṃsantepi idha abhidhammapariyāyova adhippetoti taṃ na yujjatiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vibhaṅge pana pathamavāre lokiya lokuttaramissakā citta cetasikarāsīeva iddhipādāti vuttā. Aṭṭhakathāyañca-pathamajjhāna parikammaṃhi ",
      " iddhipādonāma. Pathamajjhānaṃ iddhināma.La. Nevasaññā nāsaññāyatanajjhānaparikammaṃ iddhipādonāma. Nevasaññānāsaññā yatanajjhānaṃ iddhināma. Sotāpattimaggassa vipassanā iddhipādo nāma. Sotāpattimaggo iddhināma.La. Arahattamaggassa vipassanā iddhipādonāma. Arahattamaggo iddhināmātica. Pathamajjhānaṃ iddhipādonāma. Dutiyajjhānaṃ iddhināma. La. Ākiñcaññāyatanajjhānaṃ iddhi pādonāma. Nevasaññā nāsaññā yatanajjhānaṃ iddhināma. Sotā pattimaggo iddhipādonāma. Sakadāgāmimaggo iddhināma.La. Arahattamaggo iddhināmāti ca vuttaṃ. Taṃtaṃ pādakajjhānaṃ iddhipādonāma. Tato tato vuṭṭhahitvā uppāditamaggo iddhināmātipi vattuṃ vaṭṭatiyeva. Idha pana uttaracūḷabhājaniye āgatanayena cattāro adhipatidhammāeva iddhipādāti vuttā."
    ],
    "innerText": "Vibhaṅge pana pathamavāre lokiya lokuttaramissakā citta cetasikarāsīeva iddhipādāti vuttā. Aṭṭhakathāyañca-pathamajjhāna parikammaṃhi iddhipādonāma. Pathamajjhānaṃ iddhināma.La. Nevasaññā nāsaññāyatanajjhānaparikammaṃ iddhipādonāma. Nevasaññānāsaññā yatanajjhānaṃ iddhināma. Sotāpattimaggassa vipassanā iddhipādo nāma. Sotāpattimaggo iddhināma.La. Arahattamaggassa vipassanā iddhipādonāma. Arahattamaggo iddhināmātica. Pathamajjhānaṃ iddhipādonāma. Dutiyajjhānaṃ iddhināma. La. Ākiñcaññāyatanajjhānaṃ iddhi pādonāma. Nevasaññā nāsaññā yatanajjhānaṃ iddhināma. Sotā pattimaggo iddhipādonāma. Sakadāgāmimaggo iddhināma.La. Arahattamaggo iddhināmāti ca vuttaṃ. Taṃtaṃ pādakajjhānaṃ iddhipādonāma. Tato tato vuṭṭhahitvā uppāditamaggo iddhināmātipi vattuṃ vaṭṭatiyeva. Idha pana uttaracūḷabhājaniye āgatanayena cattāro adhipatidhammāeva iddhipādāti vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha pana lokuttarabhūtāeva adhippetā. Idha lokiya lokuttara missakabhūtāti. Indriyabalāni atthato heṭṭhā vuttāneva. Pākaṭaṭṭhānato pana catūsu sotāpattiyaṅgesu saddhāya thāmo veditabbo. Yathāha-kattha bhikkhave saddhindriyaṃ daṭṭhabbaṃ. Catūsu sotāpattiyaṅgesu ettha saddhindriyaṃ daṭṭhabbanti. Catūsu sammappadhānesu vīriyassa. Yathāha-kattha bhikkhave vīriyindriyaṃ daṭṭhabbaṃ. Catūsu sammappadhānesu ettha vīriyindriyaṃ daṭṭhabbanti. Catūsu satipaṭṭhānesu satiyā. Yathāha-kattha bhikkhavesatindriyaṃ daṭṭhabbaṃ. Catūsu satipaṭṭhānesuettha satindriyaṃ daṭṭhabbanti. Catūsu jhānesu samādhissa. Yathāha-kattha bhikkhave samādhindriyaṃ daṭṭhabbaṃ. Catūsu jhānesu ettha samādhindriyaṃ daṭṭhabbanti. Catūsu ariyasaccesu paññāya thāmo veditabbo. Yathāha-kattha bhikkhave paññindriyaṃ daṭṭhabbaṃ. Catūsu ariyasaccesu ettha paññindriyaṃ daṭṭhabbanti. Sambodhi vuccati catūsu maggesu ñāṇaṃ, samantato bujjhati paṭivijjhati bujjhanti vā etāyāti katvā. Sā hi catusaccadhammaṃ bujjhamānā ekakkhaṇe soḷasahi atthehi saddhiṃ samantato bujjhati, na ekadesa toti tassā sambodhiyā samuṭṭhāpanaṭṭhena sambodhiyā aṅgo sahakārībalavapaccayoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sambojjhaṅgo"
      },
      ". Satieva sambojjhaṅgo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satisambojjhaṅgo"
      },
      ". ",
      " Sā hi kāyādīsu catūsu attano gocaresu bhāvanāvasena suṭṭhusaṃvaḍḍhamānā anupubbena sabbapamāda pakkhaṃ vidhametvā sabbaṃ appamādapakkhañca pūretvā catumaggaññāṇa saṅkhātaṃ sambodhiṃ samuṭṭhāpetīti. Vipassanāya bhūmibhūte ajjhatta bahiddhādhamme vicināti kakkhaḷattaphusanādīhi aniccatādīhica vividhā kārehi cuṇṇavicuṇṇaṃ kurumānoviya tesu daṭṭhabbākāraṃ asesaṃ upadhāretīti dhammavicayo. Soeva sambojjhaṅgoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammavicaya sambojjhaṅgo"
      },
      ". Sopi hi attano gocarabhūtesu tesu dhammesu bhāvanāvasena suṭṭhusaṃvaḍḍhamāno anupubbena sabbaṃsammoha pakkhaṃ vidhametvā sabbaṃ asammohapakkhaṃ pūretvā sayaṃ catumaggañāṇa sambodhi hutvā samuṭṭhahatīti. Sammappadhānavīriyameva sambojjhaṅgoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vīriyasambojjhaṅgo"
      },
      ". Tampi hi catubbidhesu attano gocaresu bhāvanāvasena suṭṭhu saṃvaḍḍhamānaṃ anupubbena sabbaṃ kusalesu dhammesu līnasaṅkoca kosajjapakkhaṃ kilesajātaṃ vidhametvā sabbaṃ dhurasaṃpaggahapakkhaṃ pūretvā vuttappakāraṃ sambodhiṃ samuṭṭhā petīti."
    ],
    "innerText": "Tattha pana lokuttarabhūtāeva adhippetā. Idha lokiya lokuttara missakabhūtāti. Indriyabalāni atthato heṭṭhā vuttāneva. Pākaṭaṭṭhānato pana catūsu sotāpattiyaṅgesu saddhāya thāmo veditabbo. Yathāha-kattha bhikkhave saddhindriyaṃ daṭṭhabbaṃ. Catūsu sotāpattiyaṅgesu ettha saddhindriyaṃ daṭṭhabbanti. Catūsu sammappadhānesu vīriyassa. Yathāha-kattha bhikkhave vīriyindriyaṃ daṭṭhabbaṃ. Catūsu sammappadhānesu ettha vīriyindriyaṃ daṭṭhabbanti. Catūsu satipaṭṭhānesu satiyā. Yathāha-kattha bhikkhavesatindriyaṃ daṭṭhabbaṃ. Catūsu satipaṭṭhānesuettha satindriyaṃ daṭṭhabbanti. Catūsu jhānesu samādhissa. Yathāha-kattha bhikkhave samādhindriyaṃ daṭṭhabbaṃ. Catūsu jhānesu ettha samādhindriyaṃ daṭṭhabbanti. Catūsu ariyasaccesu paññāya thāmo veditabbo. Yathāha-kattha bhikkhave paññindriyaṃ daṭṭhabbaṃ. Catūsu ariyasaccesu ettha paññindriyaṃ daṭṭhabbanti. Sambodhi vuccati catūsu maggesu ñāṇaṃ, samantato bujjhati paṭivijjhati bujjhanti vā etāyāti katvā. Sā hi catusaccadhammaṃ bujjhamānā ekakkhaṇe soḷasahi atthehi saddhiṃ samantato bujjhati, na ekadesa toti tassā sambodhiyā samuṭṭhāpanaṭṭhena sambodhiyā aṅgo sahakārībalavapaccayoti sambojjhaṅgo. Satieva sambojjhaṅgo satisambojjhaṅgo. Sā hi kāyādīsu catūsu attano gocaresu bhāvanāvasena suṭṭhusaṃvaḍḍhamānā anupubbena sabbapamāda pakkhaṃ vidhametvā sabbaṃ appamādapakkhañca pūretvā catumaggaññāṇa saṅkhātaṃ sambodhiṃ samuṭṭhāpetīti. Vipassanāya bhūmibhūte ajjhatta bahiddhādhamme vicināti kakkhaḷattaphusanādīhi aniccatādīhica vividhā kārehi cuṇṇavicuṇṇaṃ kurumānoviya tesu daṭṭhabbākāraṃ asesaṃ upadhāretīti dhammavicayo. Soeva sambojjhaṅgoti dhammavicaya sambojjhaṅgo. Sopi hi attano gocarabhūtesu tesu dhammesu bhāvanāvasena suṭṭhusaṃvaḍḍhamāno anupubbena sabbaṃsammoha pakkhaṃ vidhametvā sabbaṃ asammohapakkhaṃ pūretvā sayaṃ catumaggañāṇa sambodhi hutvā samuṭṭhahatīti. Sammappadhānavīriyameva sambojjhaṅgoti vīriyasambojjhaṅgo. Tampi hi catubbidhesu attano gocaresu bhāvanāvasena suṭṭhu saṃvaḍḍhamānaṃ anupubbena sabbaṃ kusalesu dhammesu līnasaṅkoca kosajjapakkhaṃ kilesajātaṃ vidhametvā sabbaṃ dhurasaṃpaggahapakkhaṃ pūretvā vuttappakāraṃ sambodhiṃ samuṭṭhā petīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pītiyeva sambojjhaṅgo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pīti sambojjhaṅgo"
      },
      ". Sāpi hi vuttappakāresu gocaresu suṭṭhu saṃvaḍḍhamānā kusalesu dhammesu sabbaṃ cittassa aratiukkaṇṭhapakkhaṃ vidhametvā sabbaṃ dhammarati dhammanandidhammārāma pakkhaṃ pūretvā vuttappakāraṃ sambodhiṃ samuṭṭhāpeti. Passaddhieva sambojjhaṅgo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "passaddhi sambojjhaṅgo"
      },
      ". Sāpi hi vuttapakāresu gocaresu bhāvanāvasena suṭṭhu saṃvaḍḍhamānā sabbaṃ cittassa sārambha darathapakkhaṃ vidhametvā sabbaṃ vūpasantasītalapakkhaṃ pūretvā vuttappakāraṃ sambodhiṃ samuṭṭhāpeti. Samādhieva sambojjhaṅgoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samādhi sambojjhaṅgo"
      },
      ". Tassa sambodhisamuṭṭhāpanatā pākaṭā. Tatramajjhattatā saṅkhātā upekkhāeva sambojjhaṅgoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upekkhā sambojjhaṅgo"
      },
      ". Sāpihi vuttappakāresu satiādīnaṃ gocaresu bhāvanāvasena suṭṭhu saṃvaḍḍhamānā sabbaṃ cittassa līnuddhaccapakkhaṃ vidhametvā samavāhitapakkhaṃ pūretvā vuttappakāraṃ sambodhiṃ samuṭṭhāpetīti. Sammā aviparītato dassanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammādiṭṭhi"
      },
      ". Sā pana dukkhe ",
      " ñāṇaṃ, dukkhasamudaye ñāṇaṃ, dukkhanirodhe ñāṇaṃ, dukkhaniro dhagāminipaṭipadāya ñāṇanti catubbidhā hoti. Sammā aviparītato saṃkappanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammāsaṅkappo"
      },
      ". Yathā sammādiṭṭhi daṭṭhabbasabhāvesu pharamānā pavattati tathā tassā saṃvidhānanti attho. Teneva hi so paññākkhandhe saṅgahitoti. Yathāha-yācāvuso visākha sammādiṭṭhi, yoca sammāsaṅkappo, ime dhammā paññākkhandhe saṅgahitāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammāvācā"
      },
      " dayo pubbe vuttatthāyeva. Sammā vāyamanti ekenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammāvāyāmo"
      },
      ". Catukiccasādhakaṃ sammappadhāna vīriyaṃ. Passaddhidvayaṃ passaddhisāmaññena ekaṃ katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cuddasete sabhāvato"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattadhā"
      },
      "ti vuttappakārānaṃ satipaṭṭhānacatukka sammappadhānacatukkādīnaṃ vasena sattadhā. Idāni tesaṃ cuddasannaṃ kiccānaṃ ṭhānabhedaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅkappapassaddhicā"
      },
      "tiādimāha."
    ],
    "innerText": "Pītiyeva sambojjhaṅgo pīti sambojjhaṅgo. Sāpi hi vuttappakāresu gocaresu suṭṭhu saṃvaḍḍhamānā kusalesu dhammesu sabbaṃ cittassa aratiukkaṇṭhapakkhaṃ vidhametvā sabbaṃ dhammarati dhammanandidhammārāma pakkhaṃ pūretvā vuttappakāraṃ sambodhiṃ samuṭṭhāpeti. Passaddhieva sambojjhaṅgo passaddhi sambojjhaṅgo. Sāpi hi vuttapakāresu gocaresu bhāvanāvasena suṭṭhu saṃvaḍḍhamānā sabbaṃ cittassa sārambha darathapakkhaṃ vidhametvā sabbaṃ vūpasantasītalapakkhaṃ pūretvā vuttappakāraṃ sambodhiṃ samuṭṭhāpeti. Samādhieva sambojjhaṅgoti samādhi sambojjhaṅgo. Tassa sambodhisamuṭṭhāpanatā pākaṭā. Tatramajjhattatā saṅkhātā upekkhāeva sambojjhaṅgoti upekkhā sambojjhaṅgo. Sāpihi vuttappakāresu satiādīnaṃ gocaresu bhāvanāvasena suṭṭhu saṃvaḍḍhamānā sabbaṃ cittassa līnuddhaccapakkhaṃ vidhametvā samavāhitapakkhaṃ pūretvā vuttappakāraṃ sambodhiṃ samuṭṭhāpetīti. Sammā aviparītato dassanaṃ sammādiṭṭhi. Sā pana dukkhe ñāṇaṃ, dukkhasamudaye ñāṇaṃ, dukkhanirodhe ñāṇaṃ, dukkhaniro dhagāminipaṭipadāya ñāṇanti catubbidhā hoti. Sammā aviparītato saṃkappanaṃ sammāsaṅkappo. Yathā sammādiṭṭhi daṭṭhabbasabhāvesu pharamānā pavattati tathā tassā saṃvidhānanti attho. Teneva hi so paññākkhandhe saṅgahitoti. Yathāha-yācāvuso visākha sammādiṭṭhi, yoca sammāsaṅkappo, ime dhammā paññākkhandhe saṅgahitāti. Sammāvācā dayo pubbe vuttatthāyeva. Sammā vāyamanti ekenāti sammāvāyāmo. Catukiccasādhakaṃ sammappadhāna vīriyaṃ. Passaddhidvayaṃ passaddhisāmaññena ekaṃ katvā cuddasete sabhāvatoti vuttaṃ. Sattadhāti vuttappakārānaṃ satipaṭṭhānacatukka sammappadhānacatukkādīnaṃ vasena sattadhā. Idāni tesaṃ cuddasannaṃ kiccānaṃ ṭhānabhedaṃ dassetuṃ saṅkappapassaddhicātiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[220]"
      },
      " Yaṃpana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[220] Yaṃpana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Sattadhā tattha saṅgahoti vatvā puna taṃ dassetuṃ saṅkappapassaddhicātiādimāhā’’ti vuttaṃ. Taṃ na yujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na hi tattha satta sarūpaṃ labbhatīti. Saṅkappo viratittayañca ekaṃ maggaṅgaṭṭhānaṃ pāpuṇāti. Passaddhica pītica upekkhāca ekaṃ bojjhaṅgaṭṭhānaṃ. Chandoca cittañca ekaṃ iddhipādaṭṭhānanti evaṃ navadhammā ekaṭṭhānikā honti. Ekaṃ vīriyaṃ catusammappadhāna iddhi pādindriya balabojjhaṅga maggaṅga vasena navaṭṭhānikaṃ. Ekā sati catusatipaṭṭhāna indriya bala bojjhaṅga maggaṅga vasena aṭṭhaṭṭhānikā. Eko samādhi indriya bala bojjhaṅga maggaṅga vasena catuṭṭhāniko. Ekāpaññā iddhipādindriya bala bojjhaṅga maggaṅga vasena pañcaṭṭhānikā. Ekā saddhā indriya bala vasena duṭṭhānikāti. Te pana sattatiṃsa pabhedā dhammā pubbabhāge nānārammaṇā nānākhaṇikāca honti. Maggaphalesu pana navaṭṭhānikaṃ vīriyaṃ ekameva nibbānaṃ ārammaṇaṃkatvā navasuṭhānesu atta paṭipakkhānaṃ pāpa dhammānaṃ paccaya yamugghātavasena nava kiccāni sādhayamānaṃ ekameva pavattati. Esa nayo aṭṭhaṭṭhānikādīsu. Tasmā te ekakkhaṇe ekacitte sabbe ekato upalabbhantīti ",
      " vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbe lokuttare hontī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navāsaṅkappa pītiyo"
      },
      "ti ettha vāsaddo kvaci saddattho. Saṅkappo kvaci dutīyajjhānikā dikepītica kvaci catutthajjhānikādike lokuttare nahontīti attho."
    ],
    "innerText": "Na hi tattha satta sarūpaṃ labbhatīti. Saṅkappo viratittayañca ekaṃ maggaṅgaṭṭhānaṃ pāpuṇāti. Passaddhica pītica upekkhāca ekaṃ bojjhaṅgaṭṭhānaṃ. Chandoca cittañca ekaṃ iddhipādaṭṭhānanti evaṃ navadhammā ekaṭṭhānikā honti. Ekaṃ vīriyaṃ catusammappadhāna iddhi pādindriya balabojjhaṅga maggaṅga vasena navaṭṭhānikaṃ. Ekā sati catusatipaṭṭhāna indriya bala bojjhaṅga maggaṅga vasena aṭṭhaṭṭhānikā. Eko samādhi indriya bala bojjhaṅga maggaṅga vasena catuṭṭhāniko. Ekāpaññā iddhipādindriya bala bojjhaṅga maggaṅga vasena pañcaṭṭhānikā. Ekā saddhā indriya bala vasena duṭṭhānikāti. Te pana sattatiṃsa pabhedā dhammā pubbabhāge nānārammaṇā nānākhaṇikāca honti. Maggaphalesu pana navaṭṭhānikaṃ vīriyaṃ ekameva nibbānaṃ ārammaṇaṃkatvā navasuṭhānesu atta paṭipakkhānaṃ pāpa dhammānaṃ paccaya yamugghātavasena nava kiccāni sādhayamānaṃ ekameva pavattati. Esa nayo aṭṭhaṭṭhānikādīsu. Tasmā te ekakkhaṇe ekacitte sabbe ekato upalabbhantīti vuttaṃ sabbe lokuttare hontīti. Navāsaṅkappa pītiyoti ettha vāsaddo kvaci saddattho. Saṅkappo kvaci dutīyajjhānikā dikepītica kvaci catutthajjhānikādike lokuttare nahontīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokiyepī"
      },
      "ti sīlavisodhanādivasena pavatte kāmā vacarakusalādike lokiyakusala kriyacittuppādepi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā yoga"
      },
      "nti sīlavisodhanakamma samathakammanāmarūpapariggahādikammesu yujjitabbānaṃ viratittayādīnaṃ anurūpaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chabbisuddhipavattiya"
      },
      "nti sīla visuddhādīnaṃ channaṃ visuddhīnaṃ anukkamena pavattikāle. Etena diṭṭheva dhamme maggaphalapatiṭṭhābhāvatthāya pūrite catupārisuddhi sīlepi saddhāsatiādayo bodhipakkhiyesu saṅgahitā eva honti. Tathā maggapādakatthāya uppāditesu mahaggatajjhānesu mīti dasseti. Tathā hi bojjhaṅgasaṃyuttake –"
    ],
    "innerText": "Lokiyepīti sīlavisodhanādivasena pavatte kāmā vacarakusalādike lokiyakusala kriyacittuppādepi. Yathā yoganti sīlavisodhanakamma samathakammanāmarūpapariggahādikammesu yujjitabbānaṃ viratittayādīnaṃ anurūpaṃ. Chabbisuddhipavattiyanti sīla visuddhādīnaṃ channaṃ visuddhīnaṃ anukkamena pavattikāle. Etena diṭṭheva dhamme maggaphalapatiṭṭhābhāvatthāya pūrite catupārisuddhi sīlepi saddhāsatiādayo bodhipakkhiyesu saṅgahitā eva honti. Tathā maggapādakatthāya uppāditesu mahaggatajjhānesu mīti dasseti. Tathā hi bojjhaṅgasaṃyuttake –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Evaṃ bhāvito kho kuṇḍaliya indriyasaṃvaro tīṇi sucaritāni paripūreti. Evaṃ bhāvitāni tīṇi sucaritāni cattāro satipaṭṭhāne paripūrenti. Evaṃ bhāvitā cattāro satipaṭṭhānā satta bojjhaṅge paripūrenti. Evaṃ bhāvitā satta bojjhaṅge vijjāvimuttiyo paripūrentīti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Aṭṭhakathāyaṃpi nakevalaṃ balavavipassanā maggaphalesueva bojjhaṅge uddharanti. Vipassanāpādaka kasiṇajjhāna ānāpāṇā suka brahmavihārajjhānesupi uddharantīti vuttaṃ. [Bodhipakkhiyasaṅgaho]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "165"
      },
      ". Sabbasaṅgahe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcakkhandhā"
      },
      "ti pañca rāsayo. Atītādi bheda bhinnānaṃ rūpānaṃ khandho rāsīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpakkhandho"
      },
      ". Ekasmiṃ ruppana lakkhaṇe rāsiṃ katvā ñāṇena pariggahitā rūpadhammāeva. Tathā ekasmiṃ vedayitalakkhaṇe sañjānana lakkhaṇe rāsiṃ katvā pariggahitā atītādibhedabhinnā vedanāsaññāyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedanākkhandho saññākkhandho"
      },
      " canāma. Saṅkharontīti saṅkhārā. Phassa cetanā dayo. Tehi chasuvā upapattidvāresu tīsuvā kammadvāresu ekato saṅgamma samāgamma phusanacetayitādīhi attano attano ",
      " kiccehi dassanasavanādīni sādhāraṇakiccānivā kāyika vācasikamānasikānivā sayana nisajjaṭṭhāna gamana kathana cintanādīni sabbāni kiccāni karonti vidahantīti. Vuttañhetaṃ saṃyuttake –"
    ],
    "innerText": "165. Sabbasaṅgahe pañcakkhandhāti pañca rāsayo. Atītādi bheda bhinnānaṃ rūpānaṃ khandho rāsīti rūpakkhandho. Ekasmiṃ ruppana lakkhaṇe rāsiṃ katvā ñāṇena pariggahitā rūpadhammāeva. Tathā ekasmiṃ vedayitalakkhaṇe sañjānana lakkhaṇe rāsiṃ katvā pariggahitā atītādibhedabhinnā vedanāsaññāyo vedanākkhandho saññākkhandho canāma. Saṅkharontīti saṅkhārā. Phassa cetanā dayo. Tehi chasuvā upapattidvāresu tīsuvā kammadvāresu ekato saṅgamma samāgamma phusanacetayitādīhi attano attano kiccehi dassanasavanādīni sādhāraṇakiccānivā kāyika vācasikamānasikānivā sayana nisajjaṭṭhāna gamana kathana cintanādīni sabbāni kiccāni karonti vidahantīti. Vuttañhetaṃ saṃyuttake –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Kiñca bhikkhave saṅkhāre vadetha. Saṅkhataṃ abhisaṅkharontīti kho bhikkhave tasmā saṅkhārāti vuccanti. Kiñca saṅkhataṃ abhi saṅkharonti, rūpaṃ rūpatthāya saṅkhataṃ abhisaṅkharonti. Vedanaṃ vedanatthāya saṅkhataṃ abhisaṅkharonti. Saññaṃ saññatthāya saṅkhata abhisaṅkharonti. Saṅkhāre saṅkhāratthāya saṅkhata mabhisaṅkharonti. Viññāṇaṃ viññāṇatthāya saṅkhata mabhi saṅkharontīti. Saṅkhata mabhisaṅkharontīti kho bhikkhave tasmā saṅkhārāti vuccantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha rūpaṃ rūpatthāya saṅkhatamabhisaṅkharontīti yasmiṃ yasmiṃ kāle sayana nisajjādivasena pavattā yā yā rūpavikati icchīyati, tasmiṃtasmiṃ kāle tassā tassā rūpavikatiyā jātatthāya iriyāpatha parivattanādi vasena taṃ taṃ rūpavikatiṃ saṅkhataṃ abhisaṅkharontīti attho. Khajjabhojjādikaṃ vatthālaṅkārādikaṃ mañca pīṭha geha rathādikaṃ sabbaṃ upabhoga paribhogabhūtaṃ bāhira rūpaṃpi gahetvā yojetuṃ vaṭṭatiyeva. Vedananti diṭṭhadhammikaṃ samparāyikañca sabbaṃpi vedanaṃ. Tattha diṭṭhadhammikaṃ vedanaṃ saṅkhataṃ abhisaṅkharontā cittakammanaccagītādīni taṃ taṃ vedanupakaraṇāni sampādana vasena samparāyikañca abhisaṅkharontā mānusakaṃvā dibbaṃvā taṃtaṃ vedanaṃ patthetvā dāna sīlādi sampādana vasena abhisaṅkharonti. Esanayo sesesupi. Saṅkhāresu pana phassaṃ phassatthāya cetanaṃ cetanatthāyātiādinā dānaṃ dānatthāya sīlaṃ sīlatthāya pāṇātipātaṃ pāṇātipātatthāyātiādinā vā sabbaṃ lokapavattiṃ ñatvā vitthāretabbāti. Ettha siyā, kasmā saṅkhāresu pākaṭā cetanādayo vitakkādayo lobhādayo saddhāsatipaññādayoca dhamme visuṃ visuṃ khandhabhāvena avatvā vedanāsaññāva vuttāti. Vuccate."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā ",
      " hi cheko mahābhisakko bhesajjamūlāni gahetvā cuṇṇaṃ karonto tesu mūlesu imāni thūlānipi mudūni honti. Imāni khuddakānipi kakkhaḷāni hontīti ñatvā tato pathamataraṃ kakkhaḷāni visuṃ uddharitvā suṭṭhu koṭṭetvā cuṇṇaṃ karoti. Sesāni pana sabbāni mudūni ekato katvā koṭṭetvā cuṇṇaṃ karoti. Tato ubhayāni missetvā silāyaṃ pisetvā bhesajjakamme upaneti. Evaṃ karonto nakilamati. Evamevaṃ bhagavāpi nāmarūpadhammesu tilakkhaṇaṃ āropetvā niccasukhaatta vipallāsānaṃ pahānatthāya anuyuñjantā devamanussā vibhāge akate tīsu dhammesu kilamissantīti ñatvā nāmadhammesu vedanāsaññācittasaṅkhāte tayo dhamme visuṃ uddharitvā ekamekaṃ khandhaṃ nāma katvā desesi. Tathā hi yathā macchānāma udake sati ukkaṇṭhitā nāma natthi. Asati pana ekantena ukkaṇṭhitāyeva honti. Yathāvā madhukarāvā bhamarāvā yasmiṃ vane puppharasa phalarase labhanti, tattha ukkaṇṭhitānāma natthi. Alabhamānā pana ekantena ukkaṇṭhitāeva honti. Evameva imesaṃ sattānaṃ sukha saññitesu patisaraṇesu vedanāsadisaṃ patisaraṇaṃnāma natthi. Manussadevabrahmasampattiyo assādentāpi sukhavedanatthāyaeva assādenti. Yadica tāhi vinā yathicchitaṃ sukhavedanaṃ labheyyuṃ. Konāma tā sādiyissati. Tathā phassacetanādīhi vitakkavicāravīriyādīhi lobhadosādīhi saddhāsatipaññādīhi ca saṅkhārakkhandhadhammehi diṭṭhadhammikaṃ samparāyikañca yaṃkiñci saṅkhataṃ abhisaṅkharontāpi sukhavedanatthāyaeva abhisaṅkharonti. Yadica tādisena abhisaṅkharaṇena vināpi yathicchitaṃ sukhaṃ labheyyuṃ, tehi dhammehi attho natthīti konāma te dhamme abhisaṅkharissatīti."
    ],
    "innerText": "Yathā hi cheko mahābhisakko bhesajjamūlāni gahetvā cuṇṇaṃ karonto tesu mūlesu imāni thūlānipi mudūni honti. Imāni khuddakānipi kakkhaḷāni hontīti ñatvā tato pathamataraṃ kakkhaḷāni visuṃ uddharitvā suṭṭhu koṭṭetvā cuṇṇaṃ karoti. Sesāni pana sabbāni mudūni ekato katvā koṭṭetvā cuṇṇaṃ karoti. Tato ubhayāni missetvā silāyaṃ pisetvā bhesajjakamme upaneti. Evaṃ karonto nakilamati. Evamevaṃ bhagavāpi nāmarūpadhammesu tilakkhaṇaṃ āropetvā niccasukhaatta vipallāsānaṃ pahānatthāya anuyuñjantā devamanussā vibhāge akate tīsu dhammesu kilamissantīti ñatvā nāmadhammesu vedanāsaññācittasaṅkhāte tayo dhamme visuṃ uddharitvā ekamekaṃ khandhaṃ nāma katvā desesi. Tathā hi yathā macchānāma udake sati ukkaṇṭhitā nāma natthi. Asati pana ekantena ukkaṇṭhitāyeva honti. Yathāvā madhukarāvā bhamarāvā yasmiṃ vane puppharasa phalarase labhanti, tattha ukkaṇṭhitānāma natthi. Alabhamānā pana ekantena ukkaṇṭhitāeva honti. Evameva imesaṃ sattānaṃ sukha saññitesu patisaraṇesu vedanāsadisaṃ patisaraṇaṃnāma natthi. Manussadevabrahmasampattiyo assādentāpi sukhavedanatthāyaeva assādenti. Yadica tāhi vinā yathicchitaṃ sukhavedanaṃ labheyyuṃ. Konāma tā sādiyissati. Tathā phassacetanādīhi vitakkavicāravīriyādīhi lobhadosādīhi saddhāsatipaññādīhi ca saṅkhārakkhandhadhammehi diṭṭhadhammikaṃ samparāyikañca yaṃkiñci saṅkhataṃ abhisaṅkharontāpi sukhavedanatthāyaeva abhisaṅkharonti. Yadica tādisena abhisaṅkharaṇena vināpi yathicchitaṃ sukhaṃ labheyyuṃ, tehi dhammehi attho natthīti konāma te dhamme abhisaṅkharissatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iti sukhasaññitesu dhammesu vedanānāma imesaṃ sattānaṃ paramukkaṃsagataṃ sukhasaññitaṭṭhānaṃ hoti. Tasmā bhagavā taṃ visuṃ ekaṃ khandhaṃ katvā khandhadesanaṃ desetīti. Tathā imesaṃ sattānaṃ attasaññitesu patisaraṇesu saññāsadisaṃ patisaraṇaṃ nāma natthi. Tathā hi tasmiṃ tasmiṃ sattanikāye uppannā te te sattā ",
      " attāno attano visayesu sabbaṃ jānitabbaṃ saññāya sañjānitvā viññuttaṃ āpajjanti. Tathā viññuttaṃ āpajjantā yattakaṃ pare jānanti. Tattakaṃ mayaṃpi jānāma. Ko amhākaṃ uttaritaroti evaṃ loke ñāṇasammabhaṃ saññaṃ paramaṃ attānaṃ katvā vicaranti. Iti attasaññitesu dhammesu saññānāma imesaṃ sattānaṃ paramukkaṃ sagataṃ attasaññitaṭṭhānaṃ hoti. Tasmā bhagavātaṃpi visuṃ ekaṃ khandhaṃ katvā khandhadesanaṃ desetīti. Tathā imesaṃ sattānaṃ niccasaññitesu patisaraṇesu cittasadisaṃ patisaṃraṇaṃ nāma natthi. Tathā hi sattā sukhaṃ dukkhaṃnāma aniccaṃ sukhapattānaṃ dukkhaṃ natthi. Dukkha pattānaṃ sukhaṃ natthītivā. Saññānāma aniccā, kadāci pamussati kadāci napamussatītivā. Vīriyaṃnāma aniccaṃ. Kadāci ārabhati, kadāci na ārabhatītivā. Lobhonāma anicco. Kadāci uppajjati, kadāci nauppajjatītivā. Dosonāma anicco. Kadāci uppajjati, kadāci na uppajjatītivā. Saddhānāma aniccā. Kadāci pasannacitto hoti, kadāci appasannacitto hotītivā. Paññānāma aniccā. Jānitabbaṃpi kadāci jānāti, kadāci na jānātītivā evaṃ cetasikadhammānaṃ anicca bhāvonāma kesañci lokiyajanānaṃpi pākaṭo hoti. Na pana cittassa. Na hi sattā cittaṃnāma aniccaṃ. Kadāci uppajjati, kadāci na uppajjatīti gaṇhanti. Taṃ pana sayaṃ niccaṃ pavattamānaṃ hutvā kadāci sukhena yuttaṃ hoti, kadāci dukkhenātiādinā tasmiṃ niccasaññameva uppādentīti. Iti cittaṃnāma niccasaññitesu dhammesu paramukkaṃ sagataṃ niccasaññitaṭṭhānaṃ hoti. Tasmā bhagavā taṃpi visuṃ ekaṃ khandhaṃ katvā khandhadesanaṃ desetīti."
    ],
    "innerText": "Iti sukhasaññitesu dhammesu vedanānāma imesaṃ sattānaṃ paramukkaṃsagataṃ sukhasaññitaṭṭhānaṃ hoti. Tasmā bhagavā taṃ visuṃ ekaṃ khandhaṃ katvā khandhadesanaṃ desetīti. Tathā imesaṃ sattānaṃ attasaññitesu patisaraṇesu saññāsadisaṃ patisaraṇaṃ nāma natthi. Tathā hi tasmiṃ tasmiṃ sattanikāye uppannā te te sattā attāno attano visayesu sabbaṃ jānitabbaṃ saññāya sañjānitvā viññuttaṃ āpajjanti. Tathā viññuttaṃ āpajjantā yattakaṃ pare jānanti. Tattakaṃ mayaṃpi jānāma. Ko amhākaṃ uttaritaroti evaṃ loke ñāṇasammabhaṃ saññaṃ paramaṃ attānaṃ katvā vicaranti. Iti attasaññitesu dhammesu saññānāma imesaṃ sattānaṃ paramukkaṃ sagataṃ attasaññitaṭṭhānaṃ hoti. Tasmā bhagavātaṃpi visuṃ ekaṃ khandhaṃ katvā khandhadesanaṃ desetīti. Tathā imesaṃ sattānaṃ niccasaññitesu patisaraṇesu cittasadisaṃ patisaṃraṇaṃ nāma natthi. Tathā hi sattā sukhaṃ dukkhaṃnāma aniccaṃ sukhapattānaṃ dukkhaṃ natthi. Dukkha pattānaṃ sukhaṃ natthītivā. Saññānāma aniccā, kadāci pamussati kadāci napamussatītivā. Vīriyaṃnāma aniccaṃ. Kadāci ārabhati, kadāci na ārabhatītivā. Lobhonāma anicco. Kadāci uppajjati, kadāci nauppajjatītivā. Dosonāma anicco. Kadāci uppajjati, kadāci na uppajjatītivā. Saddhānāma aniccā. Kadāci pasannacitto hoti, kadāci appasannacitto hotītivā. Paññānāma aniccā. Jānitabbaṃpi kadāci jānāti, kadāci na jānātītivā evaṃ cetasikadhammānaṃ anicca bhāvonāma kesañci lokiyajanānaṃpi pākaṭo hoti. Na pana cittassa. Na hi sattā cittaṃnāma aniccaṃ. Kadāci uppajjati, kadāci na uppajjatīti gaṇhanti. Taṃ pana sayaṃ niccaṃ pavattamānaṃ hutvā kadāci sukhena yuttaṃ hoti, kadāci dukkhenātiādinā tasmiṃ niccasaññameva uppādentīti. Iti cittaṃnāma niccasaññitesu dhammesu paramukkaṃ sagataṃ niccasaññitaṭṭhānaṃ hoti. Tasmā bhagavā taṃpi visuṃ ekaṃ khandhaṃ katvā khandhadesanaṃ desetīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[221]"
      },
      " Yaṃpana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[221] Yaṃpana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Bhājana bhojana byañjana bhattakāraka bhuñjaka vikappavasena pañceva vuttā’’ti vatvā taṃ vibhāvantena ‘‘rūpañhi vedanā nissayattā bhājanaṭṭhāniyaṃ. Vedanā bhuñjitabbattā bhojanaṭṭhāniyā. Saññā vedanassāda lābha hetuttā byañjanaṭṭhāniyā. Saṅkhārā abhisaṅkharaṇato bhattakārakaṭṭhāniyā. Viññāṇaṃ upabhuñjakattā bhuñjakaṭṭhāniyaṃ. Ettāvatāca adhippe tatthasiddhīti pañceva vuttā’’ti vuttaṃ. Taṃ sārato nadaṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na hi taṃ aṭṭhakathāyaṃ etapparamavinicchaye āgataṃ. Upamādīpaneeva āgataṃ. Na ca bhagavatā bhājanādivikappasiddhimattaṃ uddissa pañceva khandhā vuttāti sakkā vattuṃ. Tathāsiddhassa atthassa payojanābhāvatoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[222]"
      },
      " Yañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha"
      }
    ],
    "innerText": "[222] Yañca tattha"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Desanākkamepi idameva kāraṇaṃ. Yattha bhuñjati, yañca bhuñjati, yenaca bhuñjati, yoca bhojako, yoca bhuñjitā. Tesaṃ anukkamena dassetukāmattā’’ti vuttaṃ. Taṃpi asāraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catunnaṃ upādānānaṃ visayabhūtā khandhā upādānakkhandhā. Sabba sabhāgadhamma pariyādānavasena sāsavā anāsavāca dhammā pañcakkhandhāti vuttā, vipassanā bhūmipariggahavasena sāsavāeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcupādānakkhandhā"
      },
      "ti vuttā. Āyatanti attano phaluppattiyā bhusaṃ ussahantā viya hontīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āyatanāni"
      },
      ". Āyatanasaddo pana chasu ajjhattikesu dvāradhammesu pavattamāno sañjātidesaṭṭhena nivāsaṭṭhānaṭṭhena ākaraṭṭhena, chasu bāhiresu ārammaṇadhammesu pavattamāno samosaraṇaṭṭhena, ubhayatthapi kāraṇaṭṭhena pavattati. Tattha citta cetasikā dhammā ekasmiṃvā bhave anamataggevā saṃsāre punappunaṃ saha jāyamānā cakkhādīsu chasu dvārapadesesueva jāyanti, na aññattha. Santānānubandhavasena nivasantāpi tesveva nivasanti, na aññattha. Ākiritvā thapitā viya pavattamānāpi tesveva pavattanti, na aññattha. Tasmā cakkhādīni chasañjātidesaṭṭhena nivāsaṭṭhānaṭṭhena ākaraṭṭhenaca āyatanānināma. Devāyatanaṃ viya adhiṭṭhānaṭṭhenātipi vattuṃ vaṭṭatiyeva."
    ],
    "innerText": "Catunnaṃ upādānānaṃ visayabhūtā khandhā upādānakkhandhā. Sabba sabhāgadhamma pariyādānavasena sāsavā anāsavāca dhammā pañcakkhandhāti vuttā, vipassanā bhūmipariggahavasena sāsavāeva pañcupādānakkhandhāti vuttā. Āyatanti attano phaluppattiyā bhusaṃ ussahantā viya hontīti āyatanāni. Āyatanasaddo pana chasu ajjhattikesu dvāradhammesu pavattamāno sañjātidesaṭṭhena nivāsaṭṭhānaṭṭhena ākaraṭṭhena, chasu bāhiresu ārammaṇadhammesu pavattamāno samosaraṇaṭṭhena, ubhayatthapi kāraṇaṭṭhena pavattati. Tattha citta cetasikā dhammā ekasmiṃvā bhave anamataggevā saṃsāre punappunaṃ saha jāyamānā cakkhādīsu chasu dvārapadesesueva jāyanti, na aññattha. Santānānubandhavasena nivasantāpi tesveva nivasanti, na aññattha. Ākiritvā thapitā viya pavattamānāpi tesveva pavattanti, na aññattha. Tasmā cakkhādīni chasañjātidesaṭṭhena nivāsaṭṭhānaṭṭhena ākaraṭṭhenaca āyatanānināma. Devāyatanaṃ viya adhiṭṭhānaṭṭhenātipi vattuṃ vaṭṭatiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathāca sampannapupphaphalesu khemesu rukkhesu tato tato pakkhino nilinatthāya āhāratthāyaca niccaṃ samosaranti. Evaṃ rūpādīsu ",
      " chasuṭhānesu tato tato cittacetasikā dhammā ārammaṇakaraṇatthāya niccaṃ samosaranti. Tasmā rūpādīni cha samosaraṇaṭṭhena āyatanānināma. Tadubhayāni pana tesaṃ citta cetasikānaṃ kāraṇaṭṭhena āyatanānināma. Cakkhuca taṃ āyatanañcāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhāyatanaṃ"
      },
      ". Evaṃ sesāni. Tattha cakkhusotāni sattānaṃ hitakriyāsu bahupakārattā kāmarūpa byāpitattā ca pākaṭānītiādimhi vuttāni. Tehi āsannattā tadanantaraṃ ghānaṃ. Tato jivhāti imāni cattāri padesāyatanānināma. Tato sakalakāyabyāpako kāyo. Tato tesaṃ sabbesaṃ gocaravisayaggāhakaṃ manoti. Sesāni pana tesaṃ visayattā tadanukkameneva vuttānīti."
    ],
    "innerText": "Yathāca sampannapupphaphalesu khemesu rukkhesu tato tato pakkhino nilinatthāya āhāratthāyaca niccaṃ samosaranti. Evaṃ rūpādīsu chasuṭhānesu tato tato cittacetasikā dhammā ārammaṇakaraṇatthāya niccaṃ samosaranti. Tasmā rūpādīni cha samosaraṇaṭṭhena āyatanānināma. Tadubhayāni pana tesaṃ citta cetasikānaṃ kāraṇaṭṭhena āyatanānināma. Cakkhuca taṃ āyatanañcāti cakkhāyatanaṃ. Evaṃ sesāni. Tattha cakkhusotāni sattānaṃ hitakriyāsu bahupakārattā kāmarūpa byāpitattā ca pākaṭānītiādimhi vuttāni. Tehi āsannattā tadanantaraṃ ghānaṃ. Tato jivhāti imāni cattāri padesāyatanānināma. Tato sakalakāyabyāpako kāyo. Tato tesaṃ sabbesaṃ gocaravisayaggāhakaṃ manoti. Sesāni pana tesaṃ visayattā tadanukkameneva vuttānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kassaci pana puggalassavā sattassavā manussassavā devassavā brahmunovā vase avattitvā attanoeva sabhāvaṃ dhārentīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhātuyo"
      },
      ". Visuṃ visuṃ vavatthitasabhāvattāvā yathāsabhāvaṃ dhārīyanti sallakkhīyanti vavatthapīyantīti dhātuyo. Apica, nissatta nijjīvaṭṭhena dhātuyo. Tattha nissattaṭṭhenāti sattākārā bhāvaṭṭhena sattakiccābhāvaṭṭhena. Ko panettha sattākāro kiṃ sattakiccanti. Jīvayogo sattākāro. Īhāca byāpāro ca sattakiccaṃ. Nijjīvaṭṭhenāti ekasmiṃ bhave yāva namarati. Bhavaparaṃparāyavā yāva saṃsāro na nivattati. Tāva abhijjamāno acchijjamāno ekova vattatīti evaṃ gahitassa jīvassa abhāvaṭṭhena. Cakkhādayoca dhammā sabbaso sattākārarahitā satta kiccarahitāca honti. Naca sayaṃ jīvānāma honti. Nāpi jīvayogāti. Iti nissattaṭṭhena nijjīvaṭṭhenacatedhātuyonāmāti. Tesaṃ pana daṭṭhabbākāro aṭṭhakathāyaṃ vutto. Yathāha-bheritalaṃ viya cakkhudhātu daṭṭhabbā. Daṇḍo viya rūpadhātu. Saddoviya cakkhuviññāṇadhātu. Tathā ādāsatalaṃ viya cakkhudhātu. Mukhaṃ viya rūpadhātu. Mukhanimittaṃ viya cakkhuviññāṇadhātu. Athavā, ucchuyanta kilayantaṃ viya cakkhudhātu. Yantacakkayaṭṭhi viya rūpadhātu. Ucchurasa telāni viya cakkhuviññāṇadhātu. Tathā adharāraṇi viya ",
      " cakkhudhātu. Uttarāraṇi viya rūpadhātu. Aggi viya cakkhuviññāṇadhātu. Esanayo sotaviññāṇadhātuādīsu. Manodhātu pana yathāsambhavato cakkhuviññāṇadhātuādīnaṃ purecarānucarā viya daṭṭhabbā."
    ],
    "innerText": "Kassaci pana puggalassavā sattassavā manussassavā devassavā brahmunovā vase avattitvā attanoeva sabhāvaṃ dhārentīti dhātuyo. Visuṃ visuṃ vavatthitasabhāvattāvā yathāsabhāvaṃ dhārīyanti sallakkhīyanti vavatthapīyantīti dhātuyo. Apica, nissatta nijjīvaṭṭhena dhātuyo. Tattha nissattaṭṭhenāti sattākārā bhāvaṭṭhena sattakiccābhāvaṭṭhena. Ko panettha sattākāro kiṃ sattakiccanti. Jīvayogo sattākāro. Īhāca byāpāro ca sattakiccaṃ. Nijjīvaṭṭhenāti ekasmiṃ bhave yāva namarati. Bhavaparaṃparāyavā yāva saṃsāro na nivattati. Tāva abhijjamāno acchijjamāno ekova vattatīti evaṃ gahitassa jīvassa abhāvaṭṭhena. Cakkhādayoca dhammā sabbaso sattākārarahitā satta kiccarahitāca honti. Naca sayaṃ jīvānāma honti. Nāpi jīvayogāti. Iti nissattaṭṭhena nijjīvaṭṭhenacatedhātuyonāmāti. Tesaṃ pana daṭṭhabbākāro aṭṭhakathāyaṃ vutto. Yathāha-bheritalaṃ viya cakkhudhātu daṭṭhabbā. Daṇḍo viya rūpadhātu. Saddoviya cakkhuviññāṇadhātu. Tathā ādāsatalaṃ viya cakkhudhātu. Mukhaṃ viya rūpadhātu. Mukhanimittaṃ viya cakkhuviññāṇadhātu. Athavā, ucchuyanta kilayantaṃ viya cakkhudhātu. Yantacakkayaṭṭhi viya rūpadhātu. Ucchurasa telāni viya cakkhuviññāṇadhātu. Tathā adharāraṇi viya cakkhudhātu. Uttarāraṇi viya rūpadhātu. Aggi viya cakkhuviññāṇadhātu. Esanayo sotaviññāṇadhātuādīsu. Manodhātu pana yathāsambhavato cakkhuviññāṇadhātuādīnaṃ purecarānucarā viya daṭṭhabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dhammadhātuyā vedanākkhandho sallamiva sūlamivaca daṭṭhabbo. Saññā saṅkhārakkhandhā vedanāsalla sūlayogā āturā viya daṭṭhabbā. Puthujjanānaṃvā saññā āsā dukkhajananato rittamuṭṭhi viya ayathābhuccanimittagāhato vanamigoviya. Saṅkhārā paṭisandhiyaṃ pakkhipanato aṅgārakāsuyaṃ khipanapurisā viya. Jātidukkhānubandhato rājapurisānubandhacoro viya. Sabbānatthāvahassa khandhasantānassa hetuto visarukkhabījāni viya. Rūpaṃ nānāvidhupaddavanimittato khura cakkaṃviya daṭṭhabbaṃ. Asaṅkhatāpidhātu amatato santato khemato ca daṭṭhabbā. Kasmā, sabbānatthapaṭipakkhabhūtattā. Manoviññāṇadhātu gahitārammaṇaṃ muñcitvāpi aññaṃ gahetvā pavattanato vanamakkaṭo viya, duddamanato assakhaluṅgo viya, yattha kāmanipātito vehāsaṃ khittadaṇḍo viya, lobhadosādi nānāppakāra kilesayogato raṅganaṭo viya daṭṭhabbāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ariyasaccānī"
      },
      "ti ettha santassa dhammassa bhāvo saccaṃ. Santassāti bhūtassa tathassa aviparītassa. Apica, kenaṭṭhena saccanti. Tathaṭṭhena avitathaṭṭhena anaññathaṭṭhena. Yañhi cakkhussa dukkhattaṃ, taṃ tathaṃ hoti avitathaṃ anaññathaṃ. Dukkhadukkha saṅkhāradukkha vipariṇāmadukkha saṅkhātehi tīhi dukkhehi taṃ samaṅgipuggalassa abhiṇhapīḷanato. Tattha saṅkhāradukkhaṃ nāma kammajānaṃ uppattiyā pageva taṃtaṃkammā bhisaṅkharaṇadukkhaṃ. Tathā utujādīnaṃ uppattiyā pageva taṃtaṃ utucittāhārānaṃ abhisaṅkharaṇadukkhaṃ."
    ],
    "innerText": "Dhammadhātuyā vedanākkhandho sallamiva sūlamivaca daṭṭhabbo. Saññā saṅkhārakkhandhā vedanāsalla sūlayogā āturā viya daṭṭhabbā. Puthujjanānaṃvā saññā āsā dukkhajananato rittamuṭṭhi viya ayathābhuccanimittagāhato vanamigoviya. Saṅkhārā paṭisandhiyaṃ pakkhipanato aṅgārakāsuyaṃ khipanapurisā viya. Jātidukkhānubandhato rājapurisānubandhacoro viya. Sabbānatthāvahassa khandhasantānassa hetuto visarukkhabījāni viya. Rūpaṃ nānāvidhupaddavanimittato khura cakkaṃviya daṭṭhabbaṃ. Asaṅkhatāpidhātu amatato santato khemato ca daṭṭhabbā. Kasmā, sabbānatthapaṭipakkhabhūtattā. Manoviññāṇadhātu gahitārammaṇaṃ muñcitvāpi aññaṃ gahetvā pavattanato vanamakkaṭo viya, duddamanato assakhaluṅgo viya, yattha kāmanipātito vehāsaṃ khittadaṇḍo viya, lobhadosādi nānāppakāra kilesayogato raṅganaṭo viya daṭṭhabbāti. Ariyasaccānīti ettha santassa dhammassa bhāvo saccaṃ. Santassāti bhūtassa tathassa aviparītassa. Apica, kenaṭṭhena saccanti. Tathaṭṭhena avitathaṭṭhena anaññathaṭṭhena. Yañhi cakkhussa dukkhattaṃ, taṃ tathaṃ hoti avitathaṃ anaññathaṃ. Dukkhadukkha saṅkhāradukkha vipariṇāmadukkha saṅkhātehi tīhi dukkhehi taṃ samaṅgipuggalassa abhiṇhapīḷanato. Tattha saṅkhāradukkhaṃ nāma kammajānaṃ uppattiyā pageva taṃtaṃkammā bhisaṅkharaṇadukkhaṃ. Tathā utujādīnaṃ uppattiyā pageva taṃtaṃ utucittāhārānaṃ abhisaṅkharaṇadukkhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cakkhu hi nāma rūpibrahmānaṃpi purimabhave jhānabhāvanā saṅkhātaṃ mahantaṃ kammābhisaṅkharaṇa dukkhaṃ anubhavantānaṃyeva uppajjati. No aññathā. Kāmasattānaṃ pana purimabhave kammasaṅkhāradukkhaṃ anubhavitvā uppannaṃpi yāvajīvaṃ pavattiyā āhārādisaṅkhāradukkhañca paṭijaggana dukkhañca ",
      " anubhavantānaññeva pavattati, no aññathā. Pavattamānañca paccayavekallevā jāte antarāyevā āgate yadākadāci bhijjati. Maraṇakālaṃ patvā pana ekantena bhijjatiyeva. Tasmā taṃ assādetvā tadatthāya kammaṃvā āhārādipaccayaṃvā paṭijagganaṃ vā saṅkharontānaṃ anamatagge saṃsāre saṅkhāradukkhassa pariyantonāma natthi. Iti sabbaṃ cakkhu apariyantena saṅkhāradukkhena puggalaṃ abhiṇhaṃ pīḷetiyeva. Idamassa saṅkhāradukkhaṃ. Idaṃ cakkhu nāma paccayavekallevā jāte antarāyevā āgate yadā kadāci bhijjanajātikaṃ. Tasmā tassa bhijjanabhayena pageva paccaya sampādanadukkhaṃ rakkhāvaraṇaguttisaṃvidhānadukkhaṃ bhijjananimittāni disvā vā bhijjamānevā bhinnevā socanaparidevanādidukkhañca vipariṇāma dukkhaṃnāma. Iti sabbaṃ cakkhu apariyantena vipariṇāmadukkhena puggalaṃ abhiṇhaṃ pīḷetiyeva. Idamassa vipariṇāmadukkhaṃ. Dukkhadukkhaṃ pana tadubhayena dukkhena saheva sijjhati. Evaṃ cakkhu dukkhadukkha saṅkhāra dukkha vipariṇāma dukkhasaṅkhātehi tīhi dukkhehi taṃ samaṅgipuggalaṃ abhiṇhaṃ pīḷetiyeva. Yañca tassa tathāpīḷanaṃ, taṃ tathaṃ hoti, avitathaṃ, anaññathaṃ. Tasmā cakkhu dukkhasaccaṃnāma. Esa nayo sotādīsu tebhūmakadhammesu."
    ],
    "innerText": "Cakkhu hi nāma rūpibrahmānaṃpi purimabhave jhānabhāvanā saṅkhātaṃ mahantaṃ kammābhisaṅkharaṇa dukkhaṃ anubhavantānaṃyeva uppajjati. No aññathā. Kāmasattānaṃ pana purimabhave kammasaṅkhāradukkhaṃ anubhavitvā uppannaṃpi yāvajīvaṃ pavattiyā āhārādisaṅkhāradukkhañca paṭijaggana dukkhañca anubhavantānaññeva pavattati, no aññathā. Pavattamānañca paccayavekallevā jāte antarāyevā āgate yadākadāci bhijjati. Maraṇakālaṃ patvā pana ekantena bhijjatiyeva. Tasmā taṃ assādetvā tadatthāya kammaṃvā āhārādipaccayaṃvā paṭijagganaṃ vā saṅkharontānaṃ anamatagge saṃsāre saṅkhāradukkhassa pariyantonāma natthi. Iti sabbaṃ cakkhu apariyantena saṅkhāradukkhena puggalaṃ abhiṇhaṃ pīḷetiyeva. Idamassa saṅkhāradukkhaṃ. Idaṃ cakkhu nāma paccayavekallevā jāte antarāyevā āgate yadā kadāci bhijjanajātikaṃ. Tasmā tassa bhijjanabhayena pageva paccaya sampādanadukkhaṃ rakkhāvaraṇaguttisaṃvidhānadukkhaṃ bhijjananimittāni disvā vā bhijjamānevā bhinnevā socanaparidevanādidukkhañca vipariṇāma dukkhaṃnāma. Iti sabbaṃ cakkhu apariyantena vipariṇāmadukkhena puggalaṃ abhiṇhaṃ pīḷetiyeva. Idamassa vipariṇāmadukkhaṃ. Dukkhadukkhaṃ pana tadubhayena dukkhena saheva sijjhati. Evaṃ cakkhu dukkhadukkha saṅkhāra dukkha vipariṇāma dukkhasaṅkhātehi tīhi dukkhehi taṃ samaṅgipuggalaṃ abhiṇhaṃ pīḷetiyeva. Yañca tassa tathāpīḷanaṃ, taṃ tathaṃ hoti, avitathaṃ, anaññathaṃ. Tasmā cakkhu dukkhasaccaṃnāma. Esa nayo sotādīsu tebhūmakadhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sesasaccesupi yaṃ lobhasseva dukkhasamudayattaṃ. Yaṃ nibbānasseva dukkhanirodhattaṃ. Yaṃ aṭṭhaṅgikamaggasseva dukkhanirodhamaggattaṃ taṃ kathaṃ hotītiādinā vattabbaṃ. Yāvaca lobho na pahiyyati. Tāva cakkhādīni assādetiyeva. Yāvaca tāni assādeti. Tāva tesaṃ pavattiyā kammādīni saṅkharontiyeva. Yāvaca kammādīni saṅkharonti. Tāva cakkhādīni pavattantiyeva. Yāvacatāni pavattanti. Tāva tesaṃ vuttappakārehi saṅkhāra dukkhādīhi namuccatiyeva. Tasmā lobhassa dukkhasamudayattaṃ tathaṃ hoti. Cakkhādīsuca pavattamānesu vuttappakāraṃ sabbaṃ dukkhaṃ āgacchatiyeva. Apavattamānesu nāgacchati. Tasmā tesaṃ pavattinirodhabhūtassa nibbānasseva dukkhanirodhattaṃ tathaṃ hoti. Tathā lobhapahānato añño dukkhamuttimaggonāma natthi. Aṭṭhaṅgikamaggoca uppajja māno ",
      " ekantena taṃ pajahati. Tasmā aṭṭhaṅgikamaggasseva dukkhanirodhamaggattaṃ tathaṃ hoti, avitathaṃ, anaññathanti."
    ],
    "innerText": "Sesasaccesupi yaṃ lobhasseva dukkhasamudayattaṃ. Yaṃ nibbānasseva dukkhanirodhattaṃ. Yaṃ aṭṭhaṅgikamaggasseva dukkhanirodhamaggattaṃ taṃ kathaṃ hotītiādinā vattabbaṃ. Yāvaca lobho na pahiyyati. Tāva cakkhādīni assādetiyeva. Yāvaca tāni assādeti. Tāva tesaṃ pavattiyā kammādīni saṅkharontiyeva. Yāvaca kammādīni saṅkharonti. Tāva cakkhādīni pavattantiyeva. Yāvacatāni pavattanti. Tāva tesaṃ vuttappakārehi saṅkhāra dukkhādīhi namuccatiyeva. Tasmā lobhassa dukkhasamudayattaṃ tathaṃ hoti. Cakkhādīsuca pavattamānesu vuttappakāraṃ sabbaṃ dukkhaṃ āgacchatiyeva. Apavattamānesu nāgacchati. Tasmā tesaṃ pavattinirodhabhūtassa nibbānasseva dukkhanirodhattaṃ tathaṃ hoti. Tathā lobhapahānato añño dukkhamuttimaggonāma natthi. Aṭṭhaṅgikamaggoca uppajja māno ekantena taṃ pajahati. Tasmā aṭṭhaṅgikamaggasseva dukkhanirodhamaggattaṃ tathaṃ hoti, avitathaṃ, anaññathanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃsantepi saccasaddo pariyāya saccesupi vattatīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cattāriariyasaccānī"
      },
      "ti. Tattha dukkhasacce tāva sakkāyapariyā pannā ajjhattadhammāeva ariyasaccaṃnāma. Teyeva hi asmimānassa adhiṭṭhānabhūtā hutvā yāvataṃ mānaṃ na samūhanati. Tāva dukkhakiccaṃ karonti. Dukkhapariññācanāma yāvadeva asmimānasamugghātāya hoti. Asmimānoca tesveva ajjhattadhammesu nivisatīti tesu pariññātesu pariññākiccaṃ siddhameva hotīti. Tabbiparī tena pana anindriya baddhadhammā maggaphaladhammāca aṭṭhaṅgikavajjā udayabbaya pīḷanato saṅkhāradukkhavipariṇāmadukkhehica aparimuttattā dukkhasaccaṃ nāma. Samudayasacce eko lobhoyeva ariyasaccaṃnāma. Sohi attasamaṅgino satte attanica ārammaṇadhammesuca assādaṃ janayitvā niccaṃ vaṭṭadukkhato anukkaṇṭhamāne karotīti tesaṃ lobhasadiso añño ñātivā mittovā sahāyovā attāvā attaniyaṃvā natthiviya khāyati. Tasmā taṃsadiso añño koci vaṭṭadukkhasaṃvidhāyakonāma natthi. Tañca pajahituṃ sakkontassa añño dujjahonāma natthi. Avasesāpana sabbepi sāsavā kusalākusaladhammā samudayasaccaṃnāma."
    ],
    "innerText": "Evaṃsantepi saccasaddo pariyāya saccesupi vattatīti vuttaṃ cattāriariyasaccānīti. Tattha dukkhasacce tāva sakkāyapariyā pannā ajjhattadhammāeva ariyasaccaṃnāma. Teyeva hi asmimānassa adhiṭṭhānabhūtā hutvā yāvataṃ mānaṃ na samūhanati. Tāva dukkhakiccaṃ karonti. Dukkhapariññācanāma yāvadeva asmimānasamugghātāya hoti. Asmimānoca tesveva ajjhattadhammesu nivisatīti tesu pariññātesu pariññākiccaṃ siddhameva hotīti. Tabbiparī tena pana anindriya baddhadhammā maggaphaladhammāca aṭṭhaṅgikavajjā udayabbaya pīḷanato saṅkhāradukkhavipariṇāmadukkhehica aparimuttattā dukkhasaccaṃ nāma. Samudayasacce eko lobhoyeva ariyasaccaṃnāma. Sohi attasamaṅgino satte attanica ārammaṇadhammesuca assādaṃ janayitvā niccaṃ vaṭṭadukkhato anukkaṇṭhamāne karotīti tesaṃ lobhasadiso añño ñātivā mittovā sahāyovā attāvā attaniyaṃvā natthiviya khāyati. Tasmā taṃsadiso añño koci vaṭṭadukkhasaṃvidhāyakonāma natthi. Tañca pajahituṃ sakkontassa añño dujjahonāma natthi. Avasesāpana sabbepi sāsavā kusalākusaladhammā samudayasaccaṃnāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha siyā, nanu avijjāpi sabbassa vaṭṭadukkhassa mūlabhāvena vuttāti sāpi samudaye ariyasacceeva vattabbāti. Vuccate, yathāhi eko cheko uyyānapālo sampattiyuttaṃ bhūmi bhāgaṃ labhitvā attano ñāṇabalena bhūmibhāgañca nānābījānica abhisaṅkharitvā nandanasadisaṃ uyyānaṃ māpesi. Tattha bhūmi uyyāna pālassa bījānaṃ rukkhānañca patiṭṭhānakiccaṃ sādheti. Bījānica aṅkuruppādanakiccaṃ sādhenti, uyyānapāloyeva pana sabbakiccāni sādheti. So hi bhūmiyaṃ bījesu rukkhesuca yaṃyaṃ kattabbaṃ hoti. Taṃ sabbaṃ karoti. Mametanti pariggaṇhāti rakkhati. Tato uppanne bhoge bhuñjati. Tasmā ko idaṃ māpesi, kassedaṃ uyyānanti vutte uyyānapāloyeva māpesi. Tassedaṃ uyyānaṃ icceva vuccati. ",
      " Na bhūmiṃ māpesi. Bījāni māpenti. Tesaṃ idaṃ uyyānanti vuccati. Kā pana uyyānasampattiyā paccayaparaṃparāti vutte pana bhūmieva ādito vattabbā. Na uyyānapālo. Naca bījānīti. Evaṃ sampadamidaṃ daṭṭhabbaṃ. Paṭiccasamuppāda nayañhi patvā paccayaparaṃ paravasena dukkha dhammānaṃ pavatti nivattividhāne avijjāeva ādi pabhavapadhānabhūtā hoti, na taṇhā. Saccadesanāyaṃ pana tesaṃ nibbattakadhammavidhāne taṇhāeva sāmijeṭṭhaka padhānabhūtā hoti. Na avijjāti natthi samudayāriyasaccabhāve avijjāya okāsoti daṭṭhabbo. Kilesānaṃ tadaṅganirodhavikkhambhana nirodhā nirodhasaccaṃnāma. Nibbānaṃ nirodhāriyasaccaṃnāma. Chasu lokiyavisuddhīsu maggaṅgāni maggasaccaṃ nāma. Aṭṭhaṅgiko lokuttaramaggoeva maggaariyasaccaṃnāmāti."
    ],
    "innerText": "Ettha siyā, nanu avijjāpi sabbassa vaṭṭadukkhassa mūlabhāvena vuttāti sāpi samudaye ariyasacceeva vattabbāti. Vuccate, yathāhi eko cheko uyyānapālo sampattiyuttaṃ bhūmi bhāgaṃ labhitvā attano ñāṇabalena bhūmibhāgañca nānābījānica abhisaṅkharitvā nandanasadisaṃ uyyānaṃ māpesi. Tattha bhūmi uyyāna pālassa bījānaṃ rukkhānañca patiṭṭhānakiccaṃ sādheti. Bījānica aṅkuruppādanakiccaṃ sādhenti, uyyānapāloyeva pana sabbakiccāni sādheti. So hi bhūmiyaṃ bījesu rukkhesuca yaṃyaṃ kattabbaṃ hoti. Taṃ sabbaṃ karoti. Mametanti pariggaṇhāti rakkhati. Tato uppanne bhoge bhuñjati. Tasmā ko idaṃ māpesi, kassedaṃ uyyānanti vutte uyyānapāloyeva māpesi. Tassedaṃ uyyānaṃ icceva vuccati. Na bhūmiṃ māpesi. Bījāni māpenti. Tesaṃ idaṃ uyyānanti vuccati. Kā pana uyyānasampattiyā paccayaparaṃparāti vutte pana bhūmieva ādito vattabbā. Na uyyānapālo. Naca bījānīti. Evaṃ sampadamidaṃ daṭṭhabbaṃ. Paṭiccasamuppāda nayañhi patvā paccayaparaṃ paravasena dukkha dhammānaṃ pavatti nivattividhāne avijjāeva ādi pabhavapadhānabhūtā hoti, na taṇhā. Saccadesanāyaṃ pana tesaṃ nibbattakadhammavidhāne taṇhāeva sāmijeṭṭhaka padhānabhūtā hoti. Na avijjāti natthi samudayāriyasaccabhāve avijjāya okāsoti daṭṭhabbo. Kilesānaṃ tadaṅganirodhavikkhambhana nirodhā nirodhasaccaṃnāma. Nibbānaṃ nirodhāriyasaccaṃnāma. Chasu lokiyavisuddhīsu maggaṅgāni maggasaccaṃ nāma. Aṭṭhaṅgiko lokuttaramaggoeva maggaariyasaccaṃnāmāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ariyasaddo cettha katthaci kadāci kesañci kutoci kathañci avitathabhāvena uttamatthavācakoti. Vibhāvaniyaṃ pana aṭṭhakathāyaṃ vuttanayena saccasaddassa attho vibhāvito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhaṃariya sacca"
      },
      "nti ettha pīḷanaṭṭho, saṅkhataṭṭho, santāpaṭṭho, vipariṇāmaṭṭhoti imehi catūhi atthehi cakkhādikassa ekekassa tebhūmakadhammassa dukkhasaccatā veditabbā. Tattha saṅkhataṭṭha vipariṇāmaṭṭhā pubbe saṅkhāra dukkhavipariṇāmadukkhesu vuttanayāeva. Padatthatopana paccayehi saṅkharīyatīti saṅkhato. Pageva kammādipaccayābhisaṅkharaṇadukkhena vinā na uppajjati, napavattatīti vuttaṃ hoti. Virūpo hutvā pariṇāmo vipariṇāmo. Parihāniceva paribhedoca. Pīḷanaṭṭhoti ettha pīḷitabbanti pīḷanaṃ. Pīḷetīti pīḷanaṃ. Pīḷīyate pīḷanaṃ. Atthoti sabhāvo. Pīḷanaṃ attho yassāti viggaho. Tattha yathā ekissā duggatitthiyā kucchimhi putto uppajjati. Soca nānārogehi sayaṃ niccaṃ pīḷito hutvā paṭijagganadukkhehi mātarañca niccaṃ pīḷetiyeva. Yañca tassā kucchimhi tādisassa puttassa uppajjanaṃ, tañca tassā itthiyā pīḷanakiccameva hoti. Evamevaṃ ye cakkhādayo dhammā jarāmaraṇehi niccaṃ pīḷīyanti, te paṭijagganadukkhehi taṃ samaṅgīnaṃ puggalaṃ niccaṃ pīḷentiyeva. Yañca tassa santāne tesaṃ uppajjanaṃ, tañca tassa pīḷanakiccamevāti. Yathāhayo ",
      " bhikkhave cakkhussa uppādo ṭhiti abhinibbatti pātubhāvo. Dukkhasseso uppādo. Rogānaṃ ṭhiti jarāmaraṇassa pātubhāvo. Yo bhikkhave sotassa ghānassa jivhāya kāyassa manassa uppādotiādi."
    ],
    "innerText": "Ariyasaddo cettha katthaci kadāci kesañci kutoci kathañci avitathabhāvena uttamatthavācakoti. Vibhāvaniyaṃ pana aṭṭhakathāyaṃ vuttanayena saccasaddassa attho vibhāvito dukkhaṃariya saccanti ettha pīḷanaṭṭho, saṅkhataṭṭho, santāpaṭṭho, vipariṇāmaṭṭhoti imehi catūhi atthehi cakkhādikassa ekekassa tebhūmakadhammassa dukkhasaccatā veditabbā. Tattha saṅkhataṭṭha vipariṇāmaṭṭhā pubbe saṅkhāra dukkhavipariṇāmadukkhesu vuttanayāeva. Padatthatopana paccayehi saṅkharīyatīti saṅkhato. Pageva kammādipaccayābhisaṅkharaṇadukkhena vinā na uppajjati, napavattatīti vuttaṃ hoti. Virūpo hutvā pariṇāmo vipariṇāmo. Parihāniceva paribhedoca. Pīḷanaṭṭhoti ettha pīḷitabbanti pīḷanaṃ. Pīḷetīti pīḷanaṃ. Pīḷīyate pīḷanaṃ. Atthoti sabhāvo. Pīḷanaṃ attho yassāti viggaho. Tattha yathā ekissā duggatitthiyā kucchimhi putto uppajjati. Soca nānārogehi sayaṃ niccaṃ pīḷito hutvā paṭijagganadukkhehi mātarañca niccaṃ pīḷetiyeva. Yañca tassā kucchimhi tādisassa puttassa uppajjanaṃ, tañca tassā itthiyā pīḷanakiccameva hoti. Evamevaṃ ye cakkhādayo dhammā jarāmaraṇehi niccaṃ pīḷīyanti, te paṭijagganadukkhehi taṃ samaṅgīnaṃ puggalaṃ niccaṃ pīḷentiyeva. Yañca tassa santāne tesaṃ uppajjanaṃ, tañca tassa pīḷanakiccamevāti. Yathāhayo bhikkhave cakkhussa uppādo ṭhiti abhinibbatti pātubhāvo. Dukkhasseso uppādo. Rogānaṃ ṭhiti jarāmaraṇassa pātubhāvo. Yo bhikkhave sotassa ghānassa jivhāya kāyassa manassa uppādotiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Santāpaṭṭhoti rāgaggiādīhi ekādasahi aggīhi bhusaṃ paridayhanaṭṭho. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Cakkhuṃ ādittaṃ. Kena ādittaṃ. Rāgagginā ādittaṃ. Dosagginā. Mohagginā. Jātiyā. Jarāya. Maraṇena. Sokena. Paridevena. Dukkhena. Domanassena. Upāyāsena ādittanti vadāmi. Sotaṃ ādittaṃ. Ghānaṃ ādittaṃ. Jivhā ādittā. Kāyo āditto. Mano ādittoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ādipanaṃ santāpanaṃ paridayhananti idha atthato ekanti. Ettha siyā, ariyamaggopi cirakālaṃ pāramitābhisaṅkharaṇadukkhena antimabhaveca sīlādivisuddhibhāvanābhisaṅkharaṇadukkhena puggalaṃ susaṃ pīḷetiyeva. Tathā vipariṇāmadhammoca. Tasmā sopi piḷanādiatthena dukkhasaccasaṅgaho siyāti.Na. Sabbadukkhasanti vaṃhattā. So hi vuttappakāraṃ abhisaṅkharaṇadukkhaṃ paripuṇṇaṃ anubhūtassa puggalassa sakiṃ uppajjamāno sabbaṃ kilesajātaṃ khepento uppajjati. Nirujjhamānoca sabbaṃ āyatiṃ anamatagge saṃsāre vaṭṭadukkhaṃ vūpasamento nirujjhati. Vūpasantaṃca anāgata dukkhaṃ upādāya vuttappakāraṃ abhisaṅkharaṇadukkhaṃ gaṇanupagaṃ nahoti. Bhijjantoca anuttaraṃ vimuttisukhaṃ datvāva bhijjati. Tasmā tassa vipariṇāmapaccayāpi puggalassa kāci hānināma natthīti na so dukkhasaccasaṅgahoti. Lokiyadhammā pana uppajjamānā pavatta mānāca pubbe vuttapakārehi saṅkhāradukkhehi bhusaṃ pīḷetvā eva uppajjanti pavattantica. Nirujjhamānā mahantaṃ pariḷāhadukkhaṃ janetvā apariyante khuracakkasadise vaṭṭadukkhayante puggalaṃ yojentāva nirujjhanti. Tasmā teeva pīḷanādiatthehi ekantadukkhā hontīti. Etena nibbānassapi sampāpakapaccayābhisaṅkharaṇalesaṃ gahetvā dukkhasaccattapasaṅgo nivattito hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhasamudayo"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyasacca"
      },
      "nti ettha bhavābhavasaṅkhātaṃ dukkhakkhandhaṃ samudeti. Punappunaṃ abbocchinnaṃ katvā udayati uṭṭhāpeti vaḍḍhetivāti dukkhasamudayo, āyūhanaṭṭho, nidānaṭṭho, saṃyogaṭṭho, palibodhaṭṭhoti catūhi atthehi lobhassa dukkhasamudayatā veditabbā. Tattha āyūhanaṭṭhoti bhavābhava saṅkhātassa ekekasmiṃ bhavepi vatthukāmapaṭisaṃyuttassa dukkhakkhandhassa bhiyyo paribyūhanaṭṭho rāsikaraṇaṭṭho nidānaṭṭhoti tadeva nirantaraṃ katvā anuppadānaṭṭho niyyātanaṭṭhoti vuttaṃ hoti. Saṃyogaṭṭhoti dukkhakkhandhasmiṃeva daḷhaṃ bandhanaṭṭho. Palibodhaṭṭhoti tato tassa tassa muccanupāyassa nīvāraṇa vasena palibundhanaṭṭho uparundhanaṭṭhoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhanirodho ariyasacca"
      },
      "nti ettha vaṭṭadukkhassa nirujjhanaṃ anuppāda dhammatāpatti vasena khiyyānaṃ dukkhanirodho. Dukkhaṃ vā nirujjhati napavattati etasminti dukkhanirodho. Nissaraṇaṭṭho vivekaṭṭho, asaṅkhataṭṭho, amataṭṭhoti catūhi atthehi nibbānassa dukkhanirodhatā veditabbā. Tattha nissaraṇaṭṭhoti nissaraṇa vimuttiyā vimuccanaṭṭho. Vivekaṭṭhoti vaṭṭadukkhapalibodhato viviccanaṭṭho. Asaṅkhataṭṭhoti saṅkhāradukkhassa abhāvaṭṭho. Amataṭṭhoti maraṇadukkhassa abhāvaṭṭhoti."
    ],
    "innerText": "Dukkhasamudayoariyasaccanti ettha bhavābhavasaṅkhātaṃ dukkhakkhandhaṃ samudeti. Punappunaṃ abbocchinnaṃ katvā udayati uṭṭhāpeti vaḍḍhetivāti dukkhasamudayo, āyūhanaṭṭho, nidānaṭṭho, saṃyogaṭṭho, palibodhaṭṭhoti catūhi atthehi lobhassa dukkhasamudayatā veditabbā. Tattha āyūhanaṭṭhoti bhavābhava saṅkhātassa ekekasmiṃ bhavepi vatthukāmapaṭisaṃyuttassa dukkhakkhandhassa bhiyyo paribyūhanaṭṭho rāsikaraṇaṭṭho nidānaṭṭhoti tadeva nirantaraṃ katvā anuppadānaṭṭho niyyātanaṭṭhoti vuttaṃ hoti. Saṃyogaṭṭhoti dukkhakkhandhasmiṃeva daḷhaṃ bandhanaṭṭho. Palibodhaṭṭhoti tato tassa tassa muccanupāyassa nīvāraṇa vasena palibundhanaṭṭho uparundhanaṭṭhoti attho. Dukkhanirodho ariyasaccanti ettha vaṭṭadukkhassa nirujjhanaṃ anuppāda dhammatāpatti vasena khiyyānaṃ dukkhanirodho. Dukkhaṃ vā nirujjhati napavattati etasminti dukkhanirodho. Nissaraṇaṭṭho vivekaṭṭho, asaṅkhataṭṭho, amataṭṭhoti catūhi atthehi nibbānassa dukkhanirodhatā veditabbā. Tattha nissaraṇaṭṭhoti nissaraṇa vimuttiyā vimuccanaṭṭho. Vivekaṭṭhoti vaṭṭadukkhapalibodhato viviccanaṭṭho. Asaṅkhataṭṭhoti saṅkhāradukkhassa abhāvaṭṭho. Amataṭṭhoti maraṇadukkhassa abhāvaṭṭhoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhanirodhagāminipaṭipadā"
      },
      "ti ettha dukkhanirodhaṃ gameti sampāpetīti dukkhanirodhagāminī. Attano santāne paṭilābhakaraṇa vasena paṭipajjitabbāti paṭipadā. Dukkhanirodhagāminīca sā paṭipadā cāti viggaho. Niyyānaṭṭho, hetvaṭṭho, dassanaṭṭho, adhipateyyaṭṭhoti catūhi atthehi aṭṭhaṅgikamaggassa dukkhanirodhamaggatā veditabbā. Tattha niyyānaṭṭhoti avijjāpaccayā saṅkhārātiādikaṃ vaṭṭasotaṃ paṭinivattetvā avijjānirodhā saṅkhāranirodhotiādikaṃ vaṭṭapaṭisotaṃ abhimukhaṃ niggamanaṭṭho. Hetvaṭṭhoti sabbesaṃ ariyaguṇānaṃ suppatiṭṭhitabhāva sādhanaṭṭho. Dassanaṭṭhoti aññāṇaadassanasaṅkhātassa sammohassa pahāna vasena catusaccadhammassa paṭivijjhanaṭṭho. Adhipateyyaṭṭhoti taṇhā dāsabyavimuttiyā ",
      " bhūjissabhāvapattivasena sayameva attano adhipati hutvā virocanaṭṭho. Lokiyamaggā hi taṇhāya ārammaṇabhāve ṭhitā taṇhādāsabyaṃ nātivattantīti. Etthaca ime sattānāma ekantena dukkhapaṭikūlā honti dukkhabhīrukā. Yeca attani dukkhaṃ janenti. Tesu verisaññaṃ uppādenti. Attano pana ekantadukkhaṃvā ekantadukkhajanakaṃvā te najānanti. Tasmā te attano dukkhamuttiyā yaṃ yaṃ kammaṃ āyūhanti. Taṃ taṃ attano dukkhavaḍḍhiyāeva sampajjati. Kiṃ pana ekantadukkhaṃ, kiṃca ekanta dukkhajanakanti. Atītānāgatapaccuppannabhūtā attano attano attahāvapariyāpannā tebhūmakadhammāeva attano attano ekantadukkhānāma. Kasmā, tehi mutteeva sabbadukkhehi muccanato, amutteca amuccanatoti. Attano taṇhāeva attano ekantadukkhajanakaṃnāma. Kasmā, tāya pahīnāyaeva ekanta dukkhehi muccanato, apahīnāyaca amuccanatoti."
    ],
    "innerText": "Dukkhanirodhagāminipaṭipadāti ettha dukkhanirodhaṃ gameti sampāpetīti dukkhanirodhagāminī. Attano santāne paṭilābhakaraṇa vasena paṭipajjitabbāti paṭipadā. Dukkhanirodhagāminīca sā paṭipadā cāti viggaho. Niyyānaṭṭho, hetvaṭṭho, dassanaṭṭho, adhipateyyaṭṭhoti catūhi atthehi aṭṭhaṅgikamaggassa dukkhanirodhamaggatā veditabbā. Tattha niyyānaṭṭhoti avijjāpaccayā saṅkhārātiādikaṃ vaṭṭasotaṃ paṭinivattetvā avijjānirodhā saṅkhāranirodhotiādikaṃ vaṭṭapaṭisotaṃ abhimukhaṃ niggamanaṭṭho. Hetvaṭṭhoti sabbesaṃ ariyaguṇānaṃ suppatiṭṭhitabhāva sādhanaṭṭho. Dassanaṭṭhoti aññāṇaadassanasaṅkhātassa sammohassa pahāna vasena catusaccadhammassa paṭivijjhanaṭṭho. Adhipateyyaṭṭhoti taṇhā dāsabyavimuttiyā bhūjissabhāvapattivasena sayameva attano adhipati hutvā virocanaṭṭho. Lokiyamaggā hi taṇhāya ārammaṇabhāve ṭhitā taṇhādāsabyaṃ nātivattantīti. Etthaca ime sattānāma ekantena dukkhapaṭikūlā honti dukkhabhīrukā. Yeca attani dukkhaṃ janenti. Tesu verisaññaṃ uppādenti. Attano pana ekantadukkhaṃvā ekantadukkhajanakaṃvā te najānanti. Tasmā te attano dukkhamuttiyā yaṃ yaṃ kammaṃ āyūhanti. Taṃ taṃ attano dukkhavaḍḍhiyāeva sampajjati. Kiṃ pana ekantadukkhaṃ, kiṃca ekanta dukkhajanakanti. Atītānāgatapaccuppannabhūtā attano attano attahāvapariyāpannā tebhūmakadhammāeva attano attano ekantadukkhānāma. Kasmā, tehi mutteeva sabbadukkhehi muccanato, amutteca amuccanatoti. Attano taṇhāeva attano ekantadukkhajanakaṃnāma. Kasmā, tāya pahīnāyaeva ekanta dukkhehi muccanato, apahīnāyaca amuccanatoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tathā ime sattā ekantena sukhakāmā honti sukhābhinandino. Yeca attani sukhaṃ janenti. Tesu piyamittasaññaṃ uppādenti. Attanopana ekantasukhaṃvā ekantasukhamaggaṃvāte najānanti. Tasmā te attano sukhavaḍḍhiyā yaṃ yaṃ kammaṃ āyūhanti. Taṃ taṃ attano dukkhavaḍḍhiyāeva sampajjati. Kiṃ pana ekantasukhaṃ koca ekanta sukhamaggoti. Ekantadukkhadhammassa abhāvoeva attano ekanta sukhaṃnāma. Ekantadukkhajanakassa pahānamaggoeva attano ekanta sukhamaggonāmāti imamatthaṃ dassento imāni catusaccapadāni kathesīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[223]"
      },
      " Yaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[223] Yaṃ pana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Dukkhassa anuppādanirodho ettha etenātivā dukkhanirodho’’ti vuttaṃ. Tattha etenāti idaṃ nayujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na hi nibbānaṃ dukkhassa anuppādanirodha kriyāsādhane dukkhena sahakārī kāraṇaṃ hotīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sesacetasikā"
      },
      "ti vedanā saññāhi sesā paññāsa cetasikā. Atītādivasena tividha bhinnānaṃ ",
      " ajjhattādi oḷārikādi hīnādi dūrādivasena duvidhabhinnānañca dhammānaṃ rāsaṭṭhena khandhavohāro hoti. Nibbānassa pana tādi so bhedo natthīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhedābhāvenā"
      },
      "tiādi. Tañhi atītādike tividhabhede ekaṃpi na hoti. Kasmā. Aniddisitabba dhammattā. Tañhi tekālikadhammānaṃ khayavirāganirodhabhūto animitta dhammoyeva hoti. Tasmā idaṃ atīte asukabuddhakāle nibbānaṃ. Idaṃ anāgate. Idaṃ etarahīti evaṃ kālabhedena niddisitabbaṃ nahoti. Tathā disā desaṭhānabhedena parinibbutapuggalabhedena ca. Kevalaṃ pana anamatagge saṃsāravaṭṭe yattakāni anattha padāni dissanti. Tappaṭipakkhasiddhehi guṇapadehieva taṃ kathe tabbanti. Dukesu pana ajjhattadukaṃ patvā taṃ bahiddhāeva hoti. Na ajjhattaṃ. Oḷārikadukaṃ patvā sukhumameva hoti, na oḷārikaṃ. Hīnadukaṃ patvā paṇītameva hoti, na hīnaṃ. Dūre dukaṃ patvā dūreeva hoti, na santiketi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khandhasaṅgahanissaṭa"
      },
      "nti khandhasaṅgahato vimuttaṃ."
    ],
    "innerText": "Na hi nibbānaṃ dukkhassa anuppādanirodha kriyāsādhane dukkhena sahakārī kāraṇaṃ hotīti. Sesacetasikāti vedanā saññāhi sesā paññāsa cetasikā. Atītādivasena tividha bhinnānaṃ ajjhattādi oḷārikādi hīnādi dūrādivasena duvidhabhinnānañca dhammānaṃ rāsaṭṭhena khandhavohāro hoti. Nibbānassa pana tādi so bhedo natthīti vuttaṃ bhedābhāvenātiādi. Tañhi atītādike tividhabhede ekaṃpi na hoti. Kasmā. Aniddisitabba dhammattā. Tañhi tekālikadhammānaṃ khayavirāganirodhabhūto animitta dhammoyeva hoti. Tasmā idaṃ atīte asukabuddhakāle nibbānaṃ. Idaṃ anāgate. Idaṃ etarahīti evaṃ kālabhedena niddisitabbaṃ nahoti. Tathā disā desaṭhānabhedena parinibbutapuggalabhedena ca. Kevalaṃ pana anamatagge saṃsāravaṭṭe yattakāni anattha padāni dissanti. Tappaṭipakkhasiddhehi guṇapadehieva taṃ kathe tabbanti. Dukesu pana ajjhattadukaṃ patvā taṃ bahiddhāeva hoti. Na ajjhattaṃ. Oḷārikadukaṃ patvā sukhumameva hoti, na oḷārikaṃ. Hīnadukaṃ patvā paṇītameva hoti, na hīnaṃ. Dūre dukaṃ patvā dūreeva hoti, na santiketi. Khandhasaṅgahanissaṭanti khandhasaṅgahato vimuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvārālambaṇabhedenā"
      },
      "ti dvārachakka ārammaṇachakkānaṃ bhedena. Āyatanāni dvādasa bhavantīti yojanā. Etthaca dvārachakkaṃ dhammārammaṇaṃevāti sesadhammālambaṇaṃ sandhāya ārammaṇachakkaṃ vuttanti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvārā.La. Pariyāyenā"
      },
      "ti channaṃ dvārānaṃ channaṃ ālambaṇānaṃ tesu dvārālambaṇesu uppannānaṃ viññāṇānañca kamena dhātuyo aṭṭhārasa bhavantīti yojanā. Etthapi dvārachakke manodvāraṃ viññāṇekadesameva hoti. Dvārachakkaṃ viññāṇasattakañca dhammā lambaṇekadesamevāti. Maggo lokuttaro maggonāma matoti yojanā. Maggayuttā ekūnatiṃsadhammā phalabhūtāca sattatiṃsa dhammā catusacca vinissaṭā catūhi ariyasaccehi vinissaṭā vimuttā. Yamettha vattabbaṃ, taṃ heṭṭhā vuttamevāti."
    ],
    "innerText": "Dvārālambaṇabhedenāti dvārachakka ārammaṇachakkānaṃ bhedena. Āyatanāni dvādasa bhavantīti yojanā. Etthaca dvārachakkaṃ dhammārammaṇaṃevāti sesadhammālambaṇaṃ sandhāya ārammaṇachakkaṃ vuttanti daṭṭhabbaṃ. Dvārā.La. Pariyāyenāti channaṃ dvārānaṃ channaṃ ālambaṇānaṃ tesu dvārālambaṇesu uppannānaṃ viññāṇānañca kamena dhātuyo aṭṭhārasa bhavantīti yojanā. Etthapi dvārachakke manodvāraṃ viññāṇekadesameva hoti. Dvārachakkaṃ viññāṇasattakañca dhammā lambaṇekadesamevāti. Maggo lokuttaro maggonāma matoti yojanā. Maggayuttā ekūnatiṃsadhammā phalabhūtāca sattatiṃsa dhammā catusacca vinissaṭā catūhi ariyasaccehi vinissaṭā vimuttā. Yamettha vattabbaṃ, taṃ heṭṭhā vuttamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti paramatthadīpaniyānāma abhidhammatthasaṅgahassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catutthavaṇṇanāya samuccaya saṅgahassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paramatthadīpanā niṭṭhitā."
  }
]