[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Pakiṇṇaka saṅgaha paramatthadīpanī"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "129"
      },
      ". Evaṃ ",
      " visuṃ visuṃ cittacetasikānaṃ niddesaṃ dassetvā idāni puna ubhinnaṃ niddesaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampayuttāyathāyoga"
      },
      "ntiādimāha. Yathāyogaṃ sampayuttā sabhāvato tepaññāsa cittacetasikā ye dhammā mayā visuṃ visuṃ niddiṭṭhā. Idāni yathā rahaṃ tesaṃ ubhinnaṃ saṅgahonāma niyyateti yojanā. Tattha attano attano bhāvo sabhāvo. Dhammānaṃ āvenikalakkhaṇanti vuttaṃ hoti. Cittaṃ tāva bhūmijātisampayogādibhedena ekūna navutividhaṃpi attano ārammaṇa vijānanasaṅkhātena āvenikalakkhaṇena ekameva hoti. Phassopi bhūmijātisampayo gādibhedena ekūnanavutividhopi phusanalakkhaṇena ekova hoti tathā vedanāsaññādayoti evaṃ sabhāvato tepaññāsa eva hontīti. Vedanāhetuto kiccadvārālambaṇavatthuto pavatto saṅgahoti sambandho. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedanāhetuto"
      },
      "ti vedanābheda hetubhedato. Evaṃ kiccadvārālambaṇa vatthutoti etthapi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittuppādavasenevā"
      },
      "ti cittavaseneva niyyateti sambandho. Evasaddena cetasike nivatteti. Ettāvatā channaṃ pakiṇṇakasaṅgahānaṃ vacanattho idheva tāva therena dassito hoti vedanābhedena cittacetasikānaṃ saṅgaho vedanāsaṅgaho, hetubhedena cittacetasikānaṃ saṅgaho hetusaṅgahotiādinā."
    ],
    "innerText": "129. Evaṃ visuṃ visuṃ cittacetasikānaṃ niddesaṃ dassetvā idāni puna ubhinnaṃ niddesaṃ dassento sampayuttāyathāyogantiādimāha. Yathāyogaṃ sampayuttā sabhāvato tepaññāsa cittacetasikā ye dhammā mayā visuṃ visuṃ niddiṭṭhā. Idāni yathā rahaṃ tesaṃ ubhinnaṃ saṅgahonāma niyyateti yojanā. Tattha attano attano bhāvo sabhāvo. Dhammānaṃ āvenikalakkhaṇanti vuttaṃ hoti. Cittaṃ tāva bhūmijātisampayogādibhedena ekūna navutividhaṃpi attano ārammaṇa vijānanasaṅkhātena āvenikalakkhaṇena ekameva hoti. Phassopi bhūmijātisampayo gādibhedena ekūnanavutividhopi phusanalakkhaṇena ekova hoti tathā vedanāsaññādayoti evaṃ sabhāvato tepaññāsa eva hontīti. Vedanāhetuto kiccadvārālambaṇavatthuto pavatto saṅgahoti sambandho. Tattha vedanāhetutoti vedanābheda hetubhedato. Evaṃ kiccadvārālambaṇa vatthutoti etthapi. Cittuppādavasenevāti cittavaseneva niyyateti sambandho. Evasaddena cetasike nivatteti. Ettāvatā channaṃ pakiṇṇakasaṅgahānaṃ vacanattho idheva tāva therena dassito hoti vedanābhedena cittacetasikānaṃ saṅgaho vedanāsaṅgaho, hetubhedena cittacetasikānaṃ saṅgaho hetusaṅgahotiādinā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[83] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[83] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Cittuppādasaddena cetasikadhammepi gahetvā aññaṃ nivatte tabbaṃ apassanto ‘‘na katthaci taṃvirahenā’’ti vadati. Taṃ nayujjatiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na hi idha ettakā cetasikā sukhasahagatā, ettakā dukkha sahagatātiādinā ekopi saṅgaho cetasikehi nīto nāma ",
      " atthi. Sukhasahagataṃ kusalavipākaṃ kāyaviññāṇamekamevātiādinā pana cittenaeva nīhoti. Citte pana siddhe ceta sikāpi siddhāevāti katvā cittuppādavasenevāti idaṃ vuttanti daṭṭhabbaṃ."
    ],
    "innerText": "Na hi idha ettakā cetasikā sukhasahagatā, ettakā dukkha sahagatātiādinā ekopi saṅgaho cetasikehi nīto nāma atthi. Sukhasahagataṃ kusalavipākaṃ kāyaviññāṇamekamevātiādinā pana cittenaeva nīhoti. Citte pana siddhe ceta sikāpi siddhāevāti katvā cittuppādavasenevāti idaṃ vuttanti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "130"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti tesu chasu saṅgahesu. Vedanābhedena taṃsampayuttānaṃ cittacetasikānaṃ saṅgaho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedanāsaṅgaho"
      },
      "."
    ],
    "innerText": "130.Tatthāti tesu chasu saṅgahesu. Vedanābhedena taṃsampayuttānaṃ cittacetasikānaṃ saṅgaho vedanāsaṅgaho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[84] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[84] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Sukhādivedanānaṃ taṃsahagatacittuppādānañca vibhāgavasena saṅgaho vedanāsaṅgaho’’ti vuttaṃ. Tattha casaddena vedanāsaṅgahoca vedanāsahagata cittuppāda saṅgahocāti imasmiṃ atthe vedanāsaṅgahoti ekasesaniddeso hotīti dasseti. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha hi vedanābhedo imassa saṅgahassa nissayadhammapariggahatthaṃeva vutto. Na vedanānaṃca visuṃ saṅgahadassanatthanti. Tattha",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tividhā vedanā"
      },
      "ti kasmā vuttaṃ. Nanu saṃyuttake dvepi tissopi pañcapi chapi aṭṭhārasapi chattiṃsapi aṭṭhasataṃpi vedanā vuttāti. Saccaṃ. Anubhavanalakkhaṇena pana vedanā tividhāeva hoti. Ye hi keci yaṃkiñci ārammaṇaṃ anubhavanti. Te taṃ sātatovā anubhavanti asātatovā majjhattatovā. Tato añño pakāro natthīti. Aññe pana pabhedā tena tena pariyāyena vuttā. Tattha hi dve kāyikacetasikavasena vuttā. Yathāha-katamāca bhikkhave dve vedanā kāyikāca cetasikācāti. Sukhadukkha vasenavā upekkhaṃ sukhe saṅgahetvā. Yathāha-dve vedanā vuttā bhagavatā sukhāvedanā dukkhāvedanā. Yāyaṃ bhante adukkha masukhā vedanā. Santasmiṃ esāpaṇīte sukhe vuttā bhagavatāti."
    ],
    "innerText": "Idha hi vedanābhedo imassa saṅgahassa nissayadhammapariggahatthaṃeva vutto. Na vedanānaṃca visuṃ saṅgahadassanatthanti. Tatthatividhā vedanāti kasmā vuttaṃ. Nanu saṃyuttake dvepi tissopi pañcapi chapi aṭṭhārasapi chattiṃsapi aṭṭhasataṃpi vedanā vuttāti. Saccaṃ. Anubhavanalakkhaṇena pana vedanā tividhāeva hoti. Ye hi keci yaṃkiñci ārammaṇaṃ anubhavanti. Te taṃ sātatovā anubhavanti asātatovā majjhattatovā. Tato añño pakāro natthīti. Aññe pana pabhedā tena tena pariyāyena vuttā. Tattha hi dve kāyikacetasikavasena vuttā. Yathāha-katamāca bhikkhave dve vedanā kāyikāca cetasikācāti. Sukhadukkha vasenavā upekkhaṃ sukhe saṅgahetvā. Yathāha-dve vedanā vuttā bhagavatā sukhāvedanā dukkhāvedanā. Yāyaṃ bhante adukkha masukhā vedanā. Santasmiṃ esāpaṇīte sukhe vuttā bhagavatāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Anavajjapakkhikaṃ upekkhaṃ sukhe sāvajjapakkhikañca dukkhe saṅgahetvā dve vuttāti vuttaṃ. Taṃ pāḷiyaṃ anāgataṃpi yujjatiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Indriyabhedavasena ",
      " pañca. Phassabhedavasena cha. Upavicārabheda vasena aṭṭhārasa. Cha gehassitāni cha nekkhammassitānīti evaṃ paccekaṃ dvādasannaṃ somanassa domanassaupekkhānaṃ vasena chattiṃsa. Tāyeva kālattayavasena aṭṭhasataṃ vedanā vuttāti. Yañca katthaci sutte yaṃkiñci vedayitaṃ sabbaṃ taṃ dukkhasminti vuttaṃ. Taṃ saṅkhāradukkhatāvasena vuttanti. Heṭṭhā pana cittaniddese cittāni indriyabhedavasena niddiṭṭhānīti katvā idhapi indriyabhedavaseneva cittāni saṅgahetuṃ puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhaṃ.La. Pañcadhā hotī"
      },
      "ti vuttaṃ. Ettha ca yesu dhammesu ādhi paccavasena sukhadukkhāni indriyāni nāma honti. Tesaṃ kāyika mānasikavasena duvidhattā tānipi sukhindriyaṃ somanassindriyaṃ dukkhindriyaṃ domanassindriyanti dvidhā vuttāni. Upekkhāya pana ādhipaccaṭṭhānabhūtā dhammā mānasikāeva hontītisā upekkhindriyanti ekadhāva vuttāti. Apica, tepi pariyāyena duvidhā honti. Cakkhādipasādakāya nissitānaṃpi sabbhāvato. Vedanāpana ekarasattā ekadhāva vuttāti."
    ],
    "innerText": "Indriyabhedavasena pañca. Phassabhedavasena cha. Upavicārabheda vasena aṭṭhārasa. Cha gehassitāni cha nekkhammassitānīti evaṃ paccekaṃ dvādasannaṃ somanassa domanassaupekkhānaṃ vasena chattiṃsa. Tāyeva kālattayavasena aṭṭhasataṃ vedanā vuttāti. Yañca katthaci sutte yaṃkiñci vedayitaṃ sabbaṃ taṃ dukkhasminti vuttaṃ. Taṃ saṅkhāradukkhatāvasena vuttanti. Heṭṭhā pana cittaniddese cittāni indriyabhedavasena niddiṭṭhānīti katvā idhapi indriyabhedavaseneva cittāni saṅgahetuṃ puna sukhaṃ.La. Pañcadhā hotīti vuttaṃ. Ettha ca yesu dhammesu ādhi paccavasena sukhadukkhāni indriyāni nāma honti. Tesaṃ kāyika mānasikavasena duvidhattā tānipi sukhindriyaṃ somanassindriyaṃ dukkhindriyaṃ domanassindriyanti dvidhā vuttāni. Upekkhāya pana ādhipaccaṭṭhānabhūtā dhammā mānasikāeva hontītisā upekkhindriyanti ekadhāva vuttāti. Apica, tepi pariyāyena duvidhā honti. Cakkhādipasādakāya nissitānaṃpi sabbhāvato. Vedanāpana ekarasattā ekadhāva vuttāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Kāyika mānasika sātabhedato sukhadukkhāni dvidhā vuttānī’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha sabhāvato iṭṭhāniṭṭhaphoṭṭhabbā nubhavanalakkhaṇāni sukha dukkhāni. Sabhāvatovā parikappanatovā iṭṭhāniṭṭhamajjhattānubhavana lakkhaṇāni itarānīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sesānī"
      },
      "ti yathāvutta sukhadukkhato manassa domanassayuttehi sesāni bāttiṃsa kāmāvacaracittāni tevīsati pañcamajjhānikacittānicāti sabbāni pañcapaññāsacittāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekatthā"
      },
      "ti ekasmiṃ citte. Itarā hi upekkhāvedanā."
    ],
    "innerText": "Tattha sabhāvato iṭṭhāniṭṭhaphoṭṭhabbā nubhavanalakkhaṇāni sukha dukkhāni. Sabhāvatovā parikappanatovā iṭṭhāniṭṭhamajjhattānubhavana lakkhaṇāni itarānīti. Sesānīti yathāvutta sukhadukkhato manassa domanassayuttehi sesāni bāttiṃsa kāmāvacaracittāni tevīsati pañcamajjhānikacittānicāti sabbāni pañcapaññāsacittāni. Ekatthāti ekasmiṃ citte. Itarā hi upekkhāvedanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "131"
      },
      ". Hetūnaṃ bhedena taṃsampayuttānaṃ cittacetasikāna saṅgaho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetusaṅgaho"
      },
      "."
    ],
    "innerText": "131. Hetūnaṃ bhedena taṃsampayuttānaṃ cittacetasikāna saṅgaho hetusaṅgaho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[85] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[85] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Lobhādihetūnaṃ vibhāgavasena taṃsampayuttadhammavasenaca saṅgaho hetusaṅgaho’’ti vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kāraṇaṃ ",
      " vuttameva. Hetūnāma chabbidhā bhavantīti sambandho. Tattha hetukiccaṃnāma ārammaṇe sampayuttadhammānaṃ suppatiṭṭhitabhāva sādhanaṃ. Yathā hi rukkhassa mūlāni sayaṃ anto pathaviyaṃ vaddhitvā pathaviraseca āporaseca gahetvā rukkhaṃ yāva aggā abhiharanti. Vātevā mahoghevā āgate rukkhaṃ suṭṭhu ākaḍḍhitvā tiṭṭhanti, evaṃ rukkho vuddho viruḷho vipulo ciraṭṭhitikoca hoti. Evamevaṃ imepi dhammā sayaṃ ārammaṇesu thirapattā hutvā sampayuttadhamme tattha vuddhe viruḷhe vipule ciraṭṭhitikeca sādhentīti. Ahetukacittānipana jalatale amūlakasevā lāni viya ārammaṇe suṭṭhu patiṭṭhitāni na hontīti daṭṭhabbaṃ. Apare pana dhammānaṃ kusalādibhāvasādhanaṃ hetukiccanti vadanti. Evaṃsante yesaṃ sahajātahetu natthi. Tesaṃ akusalabhāvo abyākatabhāvoca nasampajjeyya. Yānica laddhahetupaccayāni rūpāni. Tesañca kusalādibhāvo āpajjeyyāti vatvā taṃvādaṃ paṭipakkhipanti. Yathā pana loke andhakāronāma kenaci paccaya visesena sādhetabbo na hoti. Yattha āloko natthi. Tattha so attano dhammatāya siddho hoti. Evamevaṃ dhammesu muyhanakriyābhūto mohandhakāropi attano dhammatāya eva akusalo bhavituṃ arahati. Tathā hi icchānāma atthi. Sāmuyhanakriyāya yuttā lagganabhāvaṃ patvā lobho akusalo nāma hoti. Saddhāya yuttā pana dhammacchandabhāvaṃ patvā kusalacchandonāma hoti. Tathā akkhantināma atthi. Sāpi muyhana kriyāya yuttā paṭighabhāvaṃ patvā doso akusalonāma hoti. Saddhāya yuttā pana uppannaṃ kāmavitakkaṃ nādhivāsetītiādinā nayena pāpadhamma pāpārammaṇa virodhabhāvaṃ patvā alobho kusalonāma hoti. Muyhanakriyā pana asukena yuttā akusalonāma. Asukena yuttā kusalonāmāti natthi. Ambilatthāya aññena saṃyogakiccarahito jātiambilaraso viya ekantaakusalajātikāeva hotīti. Yoca dhammo kusalo akusaloca na hoti. So abyākatoti ettakameva ",
      " dhammānaṃ abyākatabhāvasiddhiyā kāraṇaṃ. Tasmā ahetukacittānaṃ rūpanibbānānañca abyākatabhāvopi attano dhamma tāyaeva siddho. Tattha moho sesamūlānaṃpi mūlaṃ hoti. Rajjanadussanānipi hi muyhananisandānieva honti. Alobhādīnañca kusalabhāvo avijjānusayena saheva siddhoti. Tāni pana lobhādīni lobhasahagatādīnaṃ visesamūlāni honti. Rajjanādi nisandāni hi diṭṭhimānādīni. Arajjanādinisandāni ca saddhādīnīti. Yasmā pana hetuyonāma sampayuttesu padhānadhammā honti. Tasmā sahetukavipākakriyānaṃ abyākatabhāvo pana hetu mukhenapi vattuṃ yutto."
    ],
    "innerText": "Kāraṇaṃ vuttameva. Hetūnāma chabbidhā bhavantīti sambandho. Tattha hetukiccaṃnāma ārammaṇe sampayuttadhammānaṃ suppatiṭṭhitabhāva sādhanaṃ. Yathā hi rukkhassa mūlāni sayaṃ anto pathaviyaṃ vaddhitvā pathaviraseca āporaseca gahetvā rukkhaṃ yāva aggā abhiharanti. Vātevā mahoghevā āgate rukkhaṃ suṭṭhu ākaḍḍhitvā tiṭṭhanti, evaṃ rukkho vuddho viruḷho vipulo ciraṭṭhitikoca hoti. Evamevaṃ imepi dhammā sayaṃ ārammaṇesu thirapattā hutvā sampayuttadhamme tattha vuddhe viruḷhe vipule ciraṭṭhitikeca sādhentīti. Ahetukacittānipana jalatale amūlakasevā lāni viya ārammaṇe suṭṭhu patiṭṭhitāni na hontīti daṭṭhabbaṃ. Apare pana dhammānaṃ kusalādibhāvasādhanaṃ hetukiccanti vadanti. Evaṃsante yesaṃ sahajātahetu natthi. Tesaṃ akusalabhāvo abyākatabhāvoca nasampajjeyya. Yānica laddhahetupaccayāni rūpāni. Tesañca kusalādibhāvo āpajjeyyāti vatvā taṃvādaṃ paṭipakkhipanti. Yathā pana loke andhakāronāma kenaci paccaya visesena sādhetabbo na hoti. Yattha āloko natthi. Tattha so attano dhammatāya siddho hoti. Evamevaṃ dhammesu muyhanakriyābhūto mohandhakāropi attano dhammatāya eva akusalo bhavituṃ arahati. Tathā hi icchānāma atthi. Sāmuyhanakriyāya yuttā lagganabhāvaṃ patvā lobho akusalo nāma hoti. Saddhāya yuttā pana dhammacchandabhāvaṃ patvā kusalacchandonāma hoti. Tathā akkhantināma atthi. Sāpi muyhana kriyāya yuttā paṭighabhāvaṃ patvā doso akusalonāma hoti. Saddhāya yuttā pana uppannaṃ kāmavitakkaṃ nādhivāsetītiādinā nayena pāpadhamma pāpārammaṇa virodhabhāvaṃ patvā alobho kusalonāma hoti. Muyhanakriyā pana asukena yuttā akusalonāma. Asukena yuttā kusalonāmāti natthi. Ambilatthāya aññena saṃyogakiccarahito jātiambilaraso viya ekantaakusalajātikāeva hotīti. Yoca dhammo kusalo akusaloca na hoti. So abyākatoti ettakameva dhammānaṃ abyākatabhāvasiddhiyā kāraṇaṃ. Tasmā ahetukacittānaṃ rūpanibbānānañca abyākatabhāvopi attano dhamma tāyaeva siddho. Tattha moho sesamūlānaṃpi mūlaṃ hoti. Rajjanadussanānipi hi muyhananisandānieva honti. Alobhādīnañca kusalabhāvo avijjānusayena saheva siddhoti. Tāni pana lobhādīni lobhasahagatādīnaṃ visesamūlāni honti. Rajjanādi nisandāni hi diṭṭhimānādīni. Arajjanādinisandāni ca saddhādīnīti. Yasmā pana hetuyonāma sampayuttesu padhānadhammā honti. Tasmā sahetukavipākakriyānaṃ abyākatabhāvo pana hetu mukhenapi vattuṃ yutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[86]"
      },
      " Ettāvatā yaṃ vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[86] Ettāvatā yaṃ vuttaṃ vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Apare pana kusalādīnaṃ kusalādibhāvasādhanaṃ hetu bhāvo’’ti vadanti. Evaṃ sati hetūnaṃ attano kusalā dibhāvasādhano añño hetu maggitabbo siyā. Atha sesasampayuttahetupaṭibaddho tesaṃ kusalādibhāvo, evampi momūha cittasampayuttassa hetuno akusala bhāvo appaṭibaddho siyā. Atha tassa sabhāvato akusalabhāvopi siyā. Evaṃsati sesahetūnampi sabhāvato kusalādibhāvoti tesaṃ viya sampayutta dhammānampi so hetupaṭibaddho nasiyā, yadica hetupaṭibaddho kusalādibhāvo. Tadā ahetukānaṃ abyākatabhāvo nasiyāti alamatinippīḷanenāti taṃ paṭikkhittaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathāca laddhajjhānapaccayesu rūpārūpadhammesu jhānaṅgāni arūpadhammesueva upanijjhānaṭṭhaṃ pharanti, na rūpadhammesu. Te pana jhānadhamma samuṭṭhi tattāeva jhānapaccayuppannesu vuttā. Evameva hetuyopi arūpa dhammesueva kusalādibhāvaṃ pharanti. Na rūpadhammesu. Te pana hetu samuṭṭhitattāeva hetupaccayuppannesu vuttāti na tesaṃ rūpadhammānaṃ kusalādibhāvāpatti codetabbāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[87]"
      },
      " Yañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[87] Yañca vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Kusalādibhāvo pana kusalākusalānaṃ yoniso ayoniso manasikārapaṭibaddho’’ti vuttaṃ. Taṃpi vicāre tabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā hi sūriyāloke āgate divā balānaṃ haṃsādīnaṃ okāso hoti. Rattandhakāle āgate rattibalānaṃ ulūkādīnaṃ okāso hoti. Naca te ālokandhakārā tesaṃ vaṇṇādivisesaṃ sāmenti. Taṃ pana tesaṃ yoniyoeva sādhenti. Tattha āloko viya yonisomanasikāro daṭṭhabbo. Andhakāro viya itaro. Te sattā viya kusalākusalā. Vaṇṇādiviseso viya kusalādibhāvo. Yoniyo viya hetuyo daṭṭhabbāti. Abyākatānaṃ panāti sabbaṃ yo dhammo kusalo akusaloca na hoti. So abyākatoti vuttapakkhe patatiyevāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti hetusaṅgahe. Sahetukānaṃ pariggahasukhatthaṃ idha vajjetabbānipi ahetukāni pathamaṃ uddhaṭāni. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sesāni pana. La. Sahetukā nevā"
      },
      "ti. Tesaṃvā ahetukanāmaṃpi hetūnaṃ vaseneva visuṃ siddhanti tesaṃpi idha saṅgahaṇaṃ aviruddhaṃ hoti. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ahetu kāṭṭhārasekā"
      },
      "tiādi. Sabhāva bhedena chabbidhāpi hetuyo kusalā kusalā byākatajātibhedena navadhā hontīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lobho dosocā"
      },
      "tiādi."
    ],
    "innerText": "Tathā hi sūriyāloke āgate divā balānaṃ haṃsādīnaṃ okāso hoti. Rattandhakāle āgate rattibalānaṃ ulūkādīnaṃ okāso hoti. Naca te ālokandhakārā tesaṃ vaṇṇādivisesaṃ sāmenti. Taṃ pana tesaṃ yoniyoeva sādhenti. Tattha āloko viya yonisomanasikāro daṭṭhabbo. Andhakāro viya itaro. Te sattā viya kusalākusalā. Vaṇṇādiviseso viya kusalādibhāvo. Yoniyo viya hetuyo daṭṭhabbāti. Abyākatānaṃ panāti sabbaṃ yo dhammo kusalo akusaloca na hoti. So abyākatoti vuttapakkhe patatiyevāti. Tatthāti hetusaṅgahe. Sahetukānaṃ pariggahasukhatthaṃ idha vajjetabbānipi ahetukāni pathamaṃ uddhaṭāni. Tenāha sesāni pana. La. Sahetukā nevāti. Tesaṃvā ahetukanāmaṃpi hetūnaṃ vaseneva visuṃ siddhanti tesaṃpi idha saṅgahaṇaṃ aviruddhaṃ hoti. Tenāha ahetu kāṭṭhārasekātiādi. Sabhāva bhedena chabbidhāpi hetuyo kusalā kusalā byākatajātibhedena navadhā hontīti vuttaṃ lobho dosocātiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "132"
      },
      ". Cuddasannaṃ kiccānaṃ bhedena taṃkiccavantānaṃ cittacetasikānaṃ saṅgaho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiccasaṅgaho"
      },
      "."
    ],
    "innerText": "132. Cuddasannaṃ kiccānaṃ bhedena taṃkiccavantānaṃ cittacetasikānaṃ saṅgaho kiccasaṅgaho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[88] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[88] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Paṭisandhādīnaṃ kiccānaṃ vibhāgavasena taṃkiccavantānañca paricchedavasena saṅgaho kiccasaṅgaho’’ti vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yena ekakammena eko upapattibhavonibbattati. Tasmiṃ sarasenavā laddhavibādhanenavā parikkhīṇe so bhavo nirujjhati. Ekassa ",
      " kammassa okāso hoti. Tasmā tato nibbatta bhavato cutassa antarā khaṇamattaṃpi aṭṭhatvā laddhokāsena ekena kammena puna bhavantarādi paṭisandhāna vasena abhinibbatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisandhikiccaṃ"
      },
      ". Tathā nibbattassa upapattibhavasantānassa yāva taṃ kammaṃ nakhiyyati. Tāva aviccheda pavattipaccayaṅgabhāvena pavatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhavaṅgakiccaṃ"
      },
      ". Tassa hi tathā pavattiyā sati āyupabandhāca usmā pabandhāca pavattantiyevāti ete tayo dhammā imaṃ kāyaṃ abhijjamānaṃ rakkhantīti. Yathāha –"
    ],
    "innerText": "Yena ekakammena eko upapattibhavonibbattati. Tasmiṃ sarasenavā laddhavibādhanenavā parikkhīṇe so bhavo nirujjhati. Ekassa kammassa okāso hoti. Tasmā tato nibbatta bhavato cutassa antarā khaṇamattaṃpi aṭṭhatvā laddhokāsena ekena kammena puna bhavantarādi paṭisandhāna vasena abhinibbatti paṭisandhikiccaṃ. Tathā nibbattassa upapattibhavasantānassa yāva taṃ kammaṃ nakhiyyati. Tāva aviccheda pavattipaccayaṅgabhāvena pavatti bhavaṅgakiccaṃ. Tassa hi tathā pavattiyā sati āyupabandhāca usmā pabandhāca pavattantiyevāti ete tayo dhammā imaṃ kāyaṃ abhijjamānaṃ rakkhantīti. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āyu usmāca viññāṇaṃ, yadā kāyaṃ jahanti maṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Apaviddho tadā seti, niratthaṃva kaliṅgaranti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Āvajjanaṃ cittasantānassa āvaṭṭanaṃ, taṃvā āvajjeti āvaṭṭeti, āvaṭṭativā taṃ ettha etenātivā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āvajjanaṃ"
      },
      ". Bhavaṅga vīthito okkamitvā ārammaṇantarābhimukhaṃ pavattatīti attho. Āvajjetivā ārammaṇantare ābhogaṃ karotīti āvajjanaṃ. Dassanādīni pākaṭāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Voṭṭhabbana"
      },
      "nti visuṃ avacchinditvā thapanaṃ idaṃ nīlantivā pītakantivā subhantivāasubhantivā asaṅkaratothapanaṃ niyamananti vuttaṃ hoti. Javanantivā javotivā vegotivā atthato ekaṃ. Asaninipāto viya vegasahitassa ekekassa pittassa pavatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "javanakiccaṃ"
      },
      "."
    ],
    "innerText": "Āvajjanaṃ cittasantānassa āvaṭṭanaṃ, taṃvā āvajjeti āvaṭṭeti, āvaṭṭativā taṃ ettha etenātivā āvajjanaṃ. Bhavaṅga vīthito okkamitvā ārammaṇantarābhimukhaṃ pavattatīti attho. Āvajjetivā ārammaṇantare ābhogaṃ karotīti āvajjanaṃ. Dassanādīni pākaṭāni. Voṭṭhabbananti visuṃ avacchinditvā thapanaṃ idaṃ nīlantivā pītakantivā subhantivāasubhantivā asaṅkaratothapanaṃ niyamananti vuttaṃ hoti. Javanantivā javotivā vegotivā atthato ekaṃ. Asaninipāto viya vegasahitassa ekekassa pittassa pavatti javanakiccaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[89]"
      },
      " Yaṃpana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[89] Yaṃpana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Ārammaṇe taṃtaṃkiccasādhanavasena anekakkhattuṃ ekakkhattuṃvā javamānassa viya pavatti javanakicca’’nti vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na hi javamānassa cittassa ekavāramattena nivattināma atthi. Maggātiññājavanānipi hi ekāvajjanaparikammacittato paṭṭhāya ekavegena pavattajavamānacittasantānapatitāni eva honti. Na pana tāni visuṃ siddhena javena javantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[90] Tattha"
      },
      " ca"
    ],
    "innerText": "[90] Tattha ca"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "Javamānassa ",
      " viya pavattīti etena visuṃ visuṃ uppajjitvā niruddhā naṃ khaṇikadhammānaṃ sīghagamanasaṅkhāto javonāma visuṃ natthi. Bahukkhattuṃ pavattivasena pana sīghagacchantapurisa sadisattā eva javananti vuccatīti dassitaṃ hoti. Taṃpi na sundaraṃ."
    ],
    "innerText": "Javamānassa viya pavattīti etena visuṃ visuṃ uppajjitvā niruddhā naṃ khaṇikadhammānaṃ sīghagamanasaṅkhāto javonāma visuṃ natthi. Bahukkhattuṃ pavattivasena pana sīghagacchantapurisa sadisattā eva javananti vuccatīti dassitaṃ hoti. Taṃpi na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Asaninipāto viya vegasahitassa ekekassa cittassa pavattijavanakiccanti hi heṭṭhā vuttaṃ. Bhavaṅgacittañhi dīghaṃ addhānaṃ pūretvā pavattaṃpi nadisote vuyhamānaṃ sukkhapaṇṇaṃ viya vegarahitaṃ hoti. Javanacittaṃ pana ekamekaṃpi samānaṃ indena vissaṭṭha vajiraṃ viya vegasahitameva pavattatīti daṭṭhabbaṃ. Taṃ ārammaṇaṃ etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tadārammaṇaṃ"
      },
      ". Yaṃ javanena gahitaṃ, tadevassa ārammaṇanti vuttaṃ hoti. Yaṃ javanena gahitārammaṇaṃ, tasseva gahitattā tadārammaṇaṃ nāmāti hi vuttaṃ. Tassavā javanassa ārammaṇaṃ assa ārammaṇanti tadārammaṇaṃ. Idha pana tadārammaṇabhāvo adhippeto. Nibbattamānabhavato vacanaṃ muccanaṃ parigaḷanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cuti"
      },
      ". Idāni tāni kiccāni aniyamato na pavattanti. Ṭhānaniyameneva pavattantīti dassetuṃ ṭhānabhedo vutto. Tiṭṭhati pavattati taṃtaṃ kiccavantaṃ cittaṃ etthāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ṭhānaṃ"
      },
      ". Okāso. Taṃtaṃ antarākāloti vuttaṃ hoti. Kālopi hi kālavantānaṃ pavattivisayattā ṭhānanti vuccati. Paṭisandhiyā ṭhānaṃ paṭisandhiṭṭhānaṃ. Paṭisandhakālo paṭisandhikkhaṇoti vuttaṃ hoti. Evaṃ sesesupi."
    ],
    "innerText": "Asaninipāto viya vegasahitassa ekekassa cittassa pavattijavanakiccanti hi heṭṭhā vuttaṃ. Bhavaṅgacittañhi dīghaṃ addhānaṃ pūretvā pavattaṃpi nadisote vuyhamānaṃ sukkhapaṇṇaṃ viya vegarahitaṃ hoti. Javanacittaṃ pana ekamekaṃpi samānaṃ indena vissaṭṭha vajiraṃ viya vegasahitameva pavattatīti daṭṭhabbaṃ. Taṃ ārammaṇaṃ etassāti tadārammaṇaṃ. Yaṃ javanena gahitaṃ, tadevassa ārammaṇanti vuttaṃ hoti. Yaṃ javanena gahitārammaṇaṃ, tasseva gahitattā tadārammaṇaṃ nāmāti hi vuttaṃ. Tassavā javanassa ārammaṇaṃ assa ārammaṇanti tadārammaṇaṃ. Idha pana tadārammaṇabhāvo adhippeto. Nibbattamānabhavato vacanaṃ muccanaṃ parigaḷanaṃ cuti. Idāni tāni kiccāni aniyamato na pavattanti. Ṭhānaniyameneva pavattantīti dassetuṃ ṭhānabhedo vutto. Tiṭṭhati pavattati taṃtaṃ kiccavantaṃ cittaṃ etthāti ṭhānaṃ. Okāso. Taṃtaṃ antarākāloti vuttaṃ hoti. Kālopi hi kālavantānaṃ pavattivisayattā ṭhānanti vuccati. Paṭisandhiyā ṭhānaṃ paṭisandhiṭṭhānaṃ. Paṭisandhakālo paṭisandhikkhaṇoti vuttaṃ hoti. Evaṃ sesesupi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[91] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[91] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Paṭisandhiyā ṭhānaṃ paṭisandhiṭṭhānanti vatvā kāmaṃ paṭisandhivini muttaṃ ṭhānaṃnāma natthi. Sukhaggahaṇatthaṃ pana silā puttakassa sarīrantiādīsu viya abhedepi bhedaparikappanāti daṭṭhabba’’nti vuttaṃ. Taṃ na gahetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kālo hi nāma sabhāvato avijjamānopi cittassa visuṃ ārammaṇabhūto eko paññattidhammo. Tathā hi aṭṭhakathāyaṃ imesaṃ aṭṭhannaṃ mahāvipākacittānaṃ vipaccanaṭṭhānaṃ veditabbaṃ. Etāni hi catūsu ",
      " ṭhānesu vipaccanti. Paṭisandhiyaṃ bhavaṅge cutiyaṃ tadārammaṇeti vatvā taṃ vitthārentena paṭisandhiggahaṇakāle paṭisandhihutvā vipaccanti. Asaṅkhyeyyaṃpi āyu kālaṃ bhavaṅgaṃ hutvā maraṇa kāle cuti hutvāti kālova vuttoti. Itarathā kiccāni viya ṭhānānipi cuddasavidhānieva vattabbāni siyunti. Ṭhānānaṃ vitthārabhedo pana upari dvīsu pavattisaṅgahesu cittapavattividhānānusārena veditabboti. Yasmā omakaṃ dvihetukakusalaṃ sayaṃ so manassayuttaṃpi samānaṃ atidubbalattā somanassa paṭisandhiṃ dātuṃ nasakkoti. Tasmā somanassasantīraṇaṃ paṭisandhiṭṭhānaṃ nagacchatīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dveupekkhāsahagatasantīraṇānicevā"
      },
      "ti. Tathā hi paṭṭhāne pītisahagatattike paṭiccavāre hetupaccanike taṃ paṭi sandhiṭṭhānena uddhaṭanti. Manodvārāvajjanaṃ parittārammaṇevā avibhūtā rammaṇevā dvattikkhattuṃ pavattamānaṃpi vipāka santānato laddhapaccayabhāvena dubbalattā javanavegarahitameva hotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āvajjana dvaya vajjitānī"
      },
      "ti."
    ],
    "innerText": "Kālo hi nāma sabhāvato avijjamānopi cittassa visuṃ ārammaṇabhūto eko paññattidhammo. Tathā hi aṭṭhakathāyaṃ imesaṃ aṭṭhannaṃ mahāvipākacittānaṃ vipaccanaṭṭhānaṃ veditabbaṃ. Etāni hi catūsu ṭhānesu vipaccanti. Paṭisandhiyaṃ bhavaṅge cutiyaṃ tadārammaṇeti vatvā taṃ vitthārentena paṭisandhiggahaṇakāle paṭisandhihutvā vipaccanti. Asaṅkhyeyyaṃpi āyu kālaṃ bhavaṅgaṃ hutvā maraṇa kāle cuti hutvāti kālova vuttoti. Itarathā kiccāni viya ṭhānānipi cuddasavidhānieva vattabbāni siyunti. Ṭhānānaṃ vitthārabhedo pana upari dvīsu pavattisaṅgahesu cittapavattividhānānusārena veditabboti. Yasmā omakaṃ dvihetukakusalaṃ sayaṃ so manassayuttaṃpi samānaṃ atidubbalattā somanassa paṭisandhiṃ dātuṃ nasakkoti. Tasmā somanassasantīraṇaṃ paṭisandhiṭṭhānaṃ nagacchatīti vuttaṃ dveupekkhāsahagatasantīraṇānicevāti. Tathā hi paṭṭhāne pītisahagatattike paṭiccavāre hetupaccanike taṃ paṭi sandhiṭṭhānena uddhaṭanti. Manodvārāvajjanaṃ parittārammaṇevā avibhūtā rammaṇevā dvattikkhattuṃ pavattamānaṃpi vipāka santānato laddhapaccayabhāvena dubbalattā javanavegarahitameva hotīti vuttaṃ āvajjana dvaya vajjitānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[92] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[92] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Ārammaṇarasānubhavanā bhāvato’’ti kāraṇaṃ vuttaṃ. Taṃ a kāraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na hi ārammaṇa rasānubhavanaṃ javanakicca siddhiyā javananāma lābhassaca kāraṇaṃ hoti. Taṃ pana javanakiccasiddhiyā phalame vahotīti. Yasmā pana phalacittaṃ āsevanabhāvarahitaṃpi magga cetanāya mahānubhāvattā parikammabhāvanābalena ca pavattattā ārammaṇe vegasahitameva patatīti tassajavanesu gahaṇaṃkataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[93] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[93] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Maggābhiññājavanānaṃ ekavārameva pavattattā javanakiccaṃ na sampajjatīti adhippāyena ‘‘ekacittakkhaṇikaṃpi lokuttara maggāditaṃ taṃsabhāvavantatāya javanakiccaṃ nāmā’’ti vatvā sabbaññutaññāṇopamāya tamatthaṃ vibhāveti. Taṃ na yujjatiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " samānakiccagaṇanāni cittāni saṅgahetvā dassetuṃ tesu panātiādimāha. Paṭisandhādayo nāma cittuppādāti sambandho."
    ],
    "innerText": "Idāni samānakiccagaṇanāni cittāni saṅgahetvā dassetuṃ tesu panātiādimāha. Paṭisandhādayo nāma cittuppādāti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[94] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[94] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Nāmakiccabhedenātipi yojeti. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nāmabhedassa visuṃ vattabbābhāvatoti. Ekakiccaṭṭhāna dvikiccaṭṭhāna tikiccaṭṭhāna catukiccaṭṭhāna pañcakiccaṭṭhānāni cittāni yathākkamaṃ aṭṭhasaṭṭhica tathā dveca navaca aṭṭhaca dveca niddiseti yojanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "133"
      },
      ". Cakkhādīnaṃ dvārānaṃ bhedena cittacetasikānaṃ saṅgaho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvārasaṅgaho"
      },
      "."
    ],
    "innerText": "133. Cakkhādīnaṃ dvārānaṃ bhedena cittacetasikānaṃ saṅgaho dvārasaṅgaho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[95] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[95] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Dvārānañca dvārapavattacittānañca paricchedavasena saṅgaho dvārasaṅgaho’’ti vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dve janā aranti gacchanti etenāti dvāraṃ. Nagarassa anto janā bahijanāca yena chiddamaggena nikkhamanti pavisantica, tassetaṃ nāmaṃ. Dve janā aranti gacchanti etthāti dvārantipī vadanti. Apica, duvidhaṃ dvāraṃ ākāsadvāraṃ maṇḍadvāranti. Tattha ākāsadvāraṃnāma yathāvutto chiddamaggo. Maṇḍadvāraṃnāma ādāsa paṭṭamayo ālokamaggo. Taṃ pana puññavantānaṃ gehesu yojīyati. Yathā ca tesu, tathā sattānaṃ sarīresupi dveeva honti. Navadvāro mahāvaṇoti hi chiddadvāraṃ vuttaṃ. Navanavutilomakūpasahassā nipi chiddadvārānieva. Idha pana ādāsapaṭṭasadisaṃ maṇḍadvāraṃ adhippetaṃ. Taṃpi hi ārammaṇikadhammānaṃ ārammaṇadhammānañca niggamana pavisana mukhapathabhāvato dvārasadisattā dvāranti vuccatīti. Taṃ pana rūpamaṇḍa dvāraṃ arūpamaṇḍadvāranti duvidhaṃ. Rūpamaṇḍadvāraṃpi kammavisesamahābhūta visesasiddhena maṇḍabhāvavisesena pañcavidhanti dassetuṃ cakkhudvārantiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhumevacakkhudvāra"
      },
      "nti yasmiṃ cakkhumhi canda maṇḍalādīni rūpa nimittāni paññāyanti. Āvajjanādīnica yamhi paññātāni tāni nimittāni gaṇhanti. Tasmā tadeva cakkhu tesaṃ dvinnaṃ visayavisa yibhāvupagamanassa ",
      " mukhapathabhūtattā cakkhudvāraṃnāmāti attho. Athavā, yena cakkhumaṇḍena bahiddhā candamaṇḍalādīni rūpāni anto āvajjanādīnaṃ visayabhāvaṃ upagacchanti. Yenaca anto āvajjanādīni bahiddhā tesaṃ rūpānaṃ visayibhāvaṃ upagacchanti. Tameva yathāvutta kāraṇena cakkhudvāraṃ nāmāti attho. Evaṃ sesesupi."
    ],
    "innerText": "Dve janā aranti gacchanti etenāti dvāraṃ. Nagarassa anto janā bahijanāca yena chiddamaggena nikkhamanti pavisantica, tassetaṃ nāmaṃ. Dve janā aranti gacchanti etthāti dvārantipī vadanti. Apica, duvidhaṃ dvāraṃ ākāsadvāraṃ maṇḍadvāranti. Tattha ākāsadvāraṃnāma yathāvutto chiddamaggo. Maṇḍadvāraṃnāma ādāsa paṭṭamayo ālokamaggo. Taṃ pana puññavantānaṃ gehesu yojīyati. Yathā ca tesu, tathā sattānaṃ sarīresupi dveeva honti. Navadvāro mahāvaṇoti hi chiddadvāraṃ vuttaṃ. Navanavutilomakūpasahassā nipi chiddadvārānieva. Idha pana ādāsapaṭṭasadisaṃ maṇḍadvāraṃ adhippetaṃ. Taṃpi hi ārammaṇikadhammānaṃ ārammaṇadhammānañca niggamana pavisana mukhapathabhāvato dvārasadisattā dvāranti vuccatīti. Taṃ pana rūpamaṇḍa dvāraṃ arūpamaṇḍadvāranti duvidhaṃ. Rūpamaṇḍadvāraṃpi kammavisesamahābhūta visesasiddhena maṇḍabhāvavisesena pañcavidhanti dassetuṃ cakkhudvārantiādimāha. Tattha cakkhumevacakkhudvāranti yasmiṃ cakkhumhi canda maṇḍalādīni rūpa nimittāni paññāyanti. Āvajjanādīnica yamhi paññātāni tāni nimittāni gaṇhanti. Tasmā tadeva cakkhu tesaṃ dvinnaṃ visayavisa yibhāvupagamanassa mukhapathabhūtattā cakkhudvāraṃnāmāti attho. Athavā, yena cakkhumaṇḍena bahiddhā candamaṇḍalādīni rūpāni anto āvajjanādīnaṃ visayabhāvaṃ upagacchanti. Yenaca anto āvajjanādīni bahiddhā tesaṃ rūpānaṃ visayibhāvaṃ upagacchanti. Tameva yathāvutta kāraṇena cakkhudvāraṃ nāmāti attho. Evaṃ sesesupi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[96] Ṭīkāsu"
      },
      " pana"
    ],
    "innerText": "[96] Ṭīkāsu pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Āvajjanādīnaṃ arūpadhammānaṃ pavattimukhabhāvato dvārasadisattā dvārānī’’ti vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rūpādīnaṃ ārammaṇānaṃpi pavattimukhabhūtattā. Vakkhati hi chabbidhā visayapavattiyoti. Etthaca visayānaṃ rūpādīnaṃ ārammaṇānaṃ dvāresu āpātā gamana saṅkhātā pavattiyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visayapavattiyo"
      },
      "ti vuccantīti. Tattha cakkhumeva cakkhudvāranti etena cakkhussa dvāraṃ cakkhudvāranti atthaṃ nivatteti. Tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sotādayo sota dvārādīnī"
      },
      "ti etena sota meva sotadvāraṃ.La. Manoeva manodvāraṃ. Na manānaṃ dvāraṃ manodvāranti imamatthaṃ atidissati. Tassa pana manassa bahuvidhattā idha adhippetaṃ manaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manodvāraṃ pana bhavaṅganti pavuccatī"
      },
      "ti vuttaṃ."
    ],
    "innerText": "Rūpādīnaṃ ārammaṇānaṃpi pavattimukhabhūtattā. Vakkhati hi chabbidhā visayapavattiyoti. Etthaca visayānaṃ rūpādīnaṃ ārammaṇānaṃ dvāresu āpātā gamana saṅkhātā pavattiyo visayapavattiyoti vuccantīti. Tattha cakkhumeva cakkhudvāranti etena cakkhussa dvāraṃ cakkhudvāranti atthaṃ nivatteti. Tathā sotādayo sota dvārādīnīti etena sota meva sotadvāraṃ.La. Manoeva manodvāraṃ. Na manānaṃ dvāraṃ manodvāranti imamatthaṃ atidissati. Tassa pana manassa bahuvidhattā idha adhippetaṃ manaṃ dassento manodvāraṃ pana bhavaṅganti pavuccatīti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[97] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[97] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Āvajjanādīnaṃ manānaṃ dvāranti manodvāra’’ntipi vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kāraṇaṃ vuttameva. Tattha sabbaṃ ekūnanavutividhaṃpi cittaṃ manodvāra mevanāma hoti. Idha pana upapattidvārameva adhippetanti katvā bhavaṅganti pavuccatīti vuttaṃ. Paṭisandhito paṭṭhāya yāvatāyukaṃ nadisotamiva pavattamānaṃ ekūnavīsatividhaṃ bhavaṅgacittameva idha manodvāranti vuccati, kathīyatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[98] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[98] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Yathā gāmassa dvāraṃnāma gāmānantarameva hoti. Evaṃ āvajjanādīnaṃ manānaṃ pavattimukhaṭṭhena dvāraṃnāma āvajjanānantaraṃ bhavaṅgameva siyā. Na tato purimāni bhavaṅgānīti adhippāyena yaṃ vuttaṃ ‘‘bhavaṅganti āvajjānānantaraṃ bhavaṅga’’nti. Taṃ na gahetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evañhi ",
      " sati yesu cakkhupasādādīsu rūpādīni āpātaṃ nāgacchanti. Tānipi āvajjanādīnaṃ vīthicittānaṃ pavattimukhāni eva na hontīti katvā dvārānināma nasiyuṃ. Na ca tathā sakkā vattuṃ. Pāḷiyameva tesaṃ dvārarūpabhāvassa vuttattā. Idhaca vakkhati pasādaviññattisaṅkhātaṃ sattavidhaṃpi dvārarūpaṃnāmāti."
    ],
    "innerText": "Evañhi sati yesu cakkhupasādādīsu rūpādīni āpātaṃ nāgacchanti. Tānipi āvajjanādīnaṃ vīthicittānaṃ pavattimukhāni eva na hontīti katvā dvārānināma nasiyuṃ. Na ca tathā sakkā vattuṃ. Pāḷiyameva tesaṃ dvārarūpabhāvassa vuttattā. Idhaca vakkhati pasādaviññattisaṅkhātaṃ sattavidhaṃpi dvārarūpaṃnāmāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[99]"
      },
      " Yañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha"
      }
    ],
    "innerText": "[99] Yañca tattha"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sāvajjanaṃ bhavaṅgantu, manodvāranti vuccatīti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sādhakavacanaṃ āhaṭaṃ; Taṃpi idha nayujjatiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tañhi āvajjanaṃpi manodvārapakkhikaṃ katvā dīpetīti. Yattha pana cakkhuñca paṭicca rūpeca uppajjati cakkhuviññāṇaṃ. Sotañca. La. Manañca paṭicca dhammeca uppajjati manoviññāṇanti vuttaṃ. Tattheva taṃ yuttaṃ. Tattha hi cakkhuviññāṇuppattiyā catūsu paccayesu cakkhurūpāni eva sarūpato vuttānīti itare āvajjanañca sampayuttakkhandhā cāti dve paccayā casaddena gahitā, evaṃ sotaviññāṇādīsupi. Manoviññāṇe pana manañcāti ettha bhavaṅgacittena saha āvajjanaṃ gahetvā casaddena sampayuttakkhandhā gahitā. Evañhi sati cattā ropaccayā hontīti. Vuttañhetaṃ dhātuvibhaṅgaṭṭhakathāyaṃ paṭiccāti nāma āgataṭṭhāne āvajjanaṃ visuṃ nakātabbaṃ. Bhavaṅganissitakameva kātabbanti. Tasmā idha manoti sahāvajjanakaṃ bhavaṅgaṃ. Mano viññāṇanti javanamanoviññāṇanti. Etthaca paṭiccātināma āgataṭṭhāneti etena aññattha pana āvajjanaṃ dvārapakkhikaṃ nakātabbanti siddhaṃ hoti. Paṭiccāti āgatattāyevaca bhavaṅgaṃpi āvajjanā nantaraṃ bhavaṅgadvayameva imissaṃ pāḷiyaṃ gahetabbaṃ. Sannihitapaccayānaṃ eva tattha adhippetattāti. Idha pana dvārabhāvā rahassa sabbassa upapattidhammassa pariggahitattā sabbaṃ bhavaṅgaṃ adhippetaṃ. Na hi kiñci bhavaṅgaṃ nāma atthi. Yaṃ manodvārabhāvārahaṃ na siyāti niṭṭhamettha gantabbanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti niddhāraṇe bhummaṃ, tesu chasu dvāresu cakkhu dvāreti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathāraha"
      },
      "nti ārammaṇabhūmipuggalamanasikārā dīnaṃ anurūpavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbathāpī"
      },
      "ti visuṃ visuṃ chacattālīsa bhedasaṅkhātena ",
      " sabbapakārenapi agahita gahaṇa vasena, catupaññā sāti sambandho. Sabbathāpītivā āvajjanādi tadārammaṇa pariyo sānavasena anekakiccabhedayuttena sabbapakārenapi, kāmāvacarānevāti sambandho. Yāni āvajjanādīni kiccāni dvāravikāraṃ paṭicca pavattanti, taṃ kiccavantānieva dvāre niyuttānīti atthena dvārikānināma honti. Paṭisandhi bhavaṅga cuti kiccānipana dvāravikārena vinā kevalaṃ kammavaseneva sijjhanti. Tasmā taṃkiccavantāni dvārikānināma nahontīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekūna.La. Dvāravimuttānī"
      },
      "ti ettha ca dvāravikāronāma attani ārammaṇānaṃ āpātāgamanavasena bhavaṅgassa calanaṃ, cakkhādīnañca attani viññāṇuppādana sattivisesa yogo daṭṭhabbo."
    ],
    "innerText": "Tañhi āvajjanaṃpi manodvārapakkhikaṃ katvā dīpetīti. Yattha pana cakkhuñca paṭicca rūpeca uppajjati cakkhuviññāṇaṃ. Sotañca. La. Manañca paṭicca dhammeca uppajjati manoviññāṇanti vuttaṃ. Tattheva taṃ yuttaṃ. Tattha hi cakkhuviññāṇuppattiyā catūsu paccayesu cakkhurūpāni eva sarūpato vuttānīti itare āvajjanañca sampayuttakkhandhā cāti dve paccayā casaddena gahitā, evaṃ sotaviññāṇādīsupi. Manoviññāṇe pana manañcāti ettha bhavaṅgacittena saha āvajjanaṃ gahetvā casaddena sampayuttakkhandhā gahitā. Evañhi sati cattā ropaccayā hontīti. Vuttañhetaṃ dhātuvibhaṅgaṭṭhakathāyaṃ paṭiccāti nāma āgataṭṭhāne āvajjanaṃ visuṃ nakātabbaṃ. Bhavaṅganissitakameva kātabbanti. Tasmā idha manoti sahāvajjanakaṃ bhavaṅgaṃ. Mano viññāṇanti javanamanoviññāṇanti. Etthaca paṭiccātināma āgataṭṭhāneti etena aññattha pana āvajjanaṃ dvārapakkhikaṃ nakātabbanti siddhaṃ hoti. Paṭiccāti āgatattāyevaca bhavaṅgaṃpi āvajjanā nantaraṃ bhavaṅgadvayameva imissaṃ pāḷiyaṃ gahetabbaṃ. Sannihitapaccayānaṃ eva tattha adhippetattāti. Idha pana dvārabhāvā rahassa sabbassa upapattidhammassa pariggahitattā sabbaṃ bhavaṅgaṃ adhippetaṃ. Na hi kiñci bhavaṅgaṃ nāma atthi. Yaṃ manodvārabhāvārahaṃ na siyāti niṭṭhamettha gantabbanti. Tatthāti niddhāraṇe bhummaṃ, tesu chasu dvāresu cakkhu dvāreti sambandho. Yathārahanti ārammaṇabhūmipuggalamanasikārā dīnaṃ anurūpavasena. Sabbathāpīti visuṃ visuṃ chacattālīsa bhedasaṅkhātena sabbapakārenapi agahita gahaṇa vasena, catupaññā sāti sambandho. Sabbathāpītivā āvajjanādi tadārammaṇa pariyo sānavasena anekakiccabhedayuttena sabbapakārenapi, kāmāvacarānevāti sambandho. Yāni āvajjanādīni kiccāni dvāravikāraṃ paṭicca pavattanti, taṃ kiccavantānieva dvāre niyuttānīti atthena dvārikānināma honti. Paṭisandhi bhavaṅga cuti kiccānipana dvāravikārena vinā kevalaṃ kammavaseneva sijjhanti. Tasmā taṃkiccavantāni dvārikānināma nahontīti vuttaṃ ekūna.La. Dvāravimuttānīti ettha ca dvāravikāronāma attani ārammaṇānaṃ āpātāgamanavasena bhavaṅgassa calanaṃ, cakkhādīnañca attani viññāṇuppādana sattivisesa yogo daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[100] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[100] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Cakkhādidvāresu apavattanato manodvārasaṅkhāta bhavaṅgato ārammaṇantaragahaṇavasena apavattitoca dvāravimuttānī’’ti vuttaṃ, taṃ aṭṭhakathāyapi saha nasameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭisandhi bhavaṅga cuti vasenāti hi vuttaṃ. Etena hi kiccasīseneva cittānaṃ dvārika dvāravimuttabhāgo therena dassito. Teneva hi heṭṭhāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcadvārāvajjana.La. Tadārammaṇavasenā"
      },
      "tiādinā kiccasīseneva cittānaṃ cakkhudvārikādibhāvo vuttoti. Nanu cakkhādidvāresu apavattanatoti iminā etadatthova vuttoti ce. Na. Adhippetatthavirahassa apasaṅga nivattakassaca saṃvaṇṇanā vākyassa payojanābhāvatoti. Chadvārikāniceva santīraṇa tadārammaṇakiccānaṃ vasena dvāravimuttānica paṭisandhādikiccānaṃ vasenāti adhippāyo. Pañcadvārikānica chadvārikānica ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcachadvārikāni"
      },
      ". Kadāci chadvārikāniceva tāni kadāci dvāravimuttānicāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chadvārikavimuttāni"
      },
      ". Dvārasaddo cetthaadhikāravasena yojīyati."
    ],
    "innerText": "Paṭisandhi bhavaṅga cuti vasenāti hi vuttaṃ. Etena hi kiccasīseneva cittānaṃ dvārika dvāravimuttabhāgo therena dassito. Teneva hi heṭṭhāpi pañcadvārāvajjana.La. Tadārammaṇavasenātiādinā kiccasīseneva cittānaṃ cakkhudvārikādibhāvo vuttoti. Nanu cakkhādidvāresu apavattanatoti iminā etadatthova vuttoti ce. Na. Adhippetatthavirahassa apasaṅga nivattakassaca saṃvaṇṇanā vākyassa payojanābhāvatoti. Chadvārikāniceva santīraṇa tadārammaṇakiccānaṃ vasena dvāravimuttānica paṭisandhādikiccānaṃ vasenāti adhippāyo. Pañcadvārikānica chadvārikānica pañcachadvārikāni. Kadāci chadvārikāniceva tāni kadāci dvāravimuttānicāti chadvārikavimuttāni. Dvārasaddo cetthaadhikāravasena yojīyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[101] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[101] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Chadvārikānica chadvārikavimuttānicā’’tipi vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Heṭṭhā cuṇṇiyavākye tathā asutattāti. Ekadvārikacittāni. La. Sabbathā dvāravimuttānica yathākkamaṃ chattiṃsati.La. Navadhā ceti pañcadhā paridīpayeti yojanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "134"
      },
      ". Rūpādīnaṃ ārammaṇānaṃ bhedena cittacetasikānaṃ saṅgaho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇasaṅgaho"
      },
      "."
    ],
    "innerText": "134. Rūpādīnaṃ ārammaṇānaṃ bhedena cittacetasikānaṃ saṅgaho ārammaṇasaṅgaho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[102] Ṭīkāsu"
      },
      " pana"
    ],
    "innerText": "[102] Ṭīkāsu pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Ārammaṇānaṃ sarūpato vibhāgato taṃvisayacittato ca saṅgaho ārammaṇasaṅgaho’’ti vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayañhi cittacetasikānaṃ eva saṅgaho. Na ārammaṇānanti. Rūpādīnaṃ vacanattho upari āgamissati. Dubbalapurisena daṇḍādiviya cittacetasikehi ālambīyati amuñcamānehi gaṇhīyatīti ālambaṇaṃ. Ārammaṇasadde pana sati cittacetasikāni āgantvā ettha ramantīti ārammaṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[103]"
      },
      " Yaṃpana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[103] Yaṃpana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Dubbalapurisena daṇḍādiviya cittacetasikehi ālambīyati. Tānivā āgantvā ettha ramantīti ālambaṇa’’nti vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Visuṃ siddhāni hi etāni padānīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpamevā"
      },
      "ti vaṇṇāyatanameva. Pañcārammaṇavimuttaṃ yaṃkiñci dhammajātaṃ vijjamānaṃpiavijjamānaṃpi bhūtaṃpi abhūtaṃpi dhammārammaṇameva. Taṃ pana sabhāga koṭṭhāsato saṅgayhamānaṃ chabbidhaṃ hotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammārammaṇaṃ pana.La. Chadhā saṅgayhatī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti tesu rūpādīsu chasu. Cakkhudvāre ghaṭṭayamāna rūpānusāreneva uppannāni cakkhudvārikacittāni aññāni ārammaṇāni ālambituṃ nalabhanti. Rūpānipi ghaṭṭanarahitāni atītānāgatāni ālambituṃ nalabhantīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhudvārikacittānaṃ sabbesaṃpi rūpameva ārammaṇaṃ. Tañha paccuppanna"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sotadvārikā dīsupi esevanayo"
      },
      ". Tattha taṃ taṃ kāraṇaṃ paṭicca uppannaṃ paccuppannaṃ. Vattamānanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chabbidhaṃpī"
      },
      "ti rūpādivasena chabbidhaṃpi. Atikkantabhāvaṃ itaṃ gataṃ ",
      " pavattanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atītaṃ"
      },
      ". Āgacchati āgacchitthāti āgataṃ. Paccuppannaṃ, atītañca. Na āgatanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāgataṃ"
      },
      ". Uppādajātikā saṅkhatadhammāeva tīsu kālesu anupatanti. Tasmā uppādarahitā asaṅkhatabhūtā nibbānapaññattiyo kālavimuttaṃnāmāti veditabbā."
    ],
    "innerText": "Visuṃ siddhāni hi etāni padānīti. Rūpamevāti vaṇṇāyatanameva. Pañcārammaṇavimuttaṃ yaṃkiñci dhammajātaṃ vijjamānaṃpiavijjamānaṃpi bhūtaṃpi abhūtaṃpi dhammārammaṇameva. Taṃ pana sabhāga koṭṭhāsato saṅgayhamānaṃ chabbidhaṃ hotīti vuttaṃ dhammārammaṇaṃ pana.La. Chadhā saṅgayhatīti. Tatthāti tesu rūpādīsu chasu. Cakkhudvāre ghaṭṭayamāna rūpānusāreneva uppannāni cakkhudvārikacittāni aññāni ārammaṇāni ālambituṃ nalabhanti. Rūpānipi ghaṭṭanarahitāni atītānāgatāni ālambituṃ nalabhantīti vuttaṃ cakkhudvārikacittānaṃ sabbesaṃpi rūpameva ārammaṇaṃ. Tañha paccuppannanti. Sotadvārikā dīsupi esevanayo. Tattha taṃ taṃ kāraṇaṃ paṭicca uppannaṃ paccuppannaṃ. Vattamānanti attho. Chabbidhaṃpīti rūpādivasena chabbidhaṃpi. Atikkantabhāvaṃ itaṃ gataṃ pavattanti atītaṃ. Āgacchati āgacchitthāti āgataṃ. Paccuppannaṃ, atītañca. Na āgatanti anāgataṃ. Uppādajātikā saṅkhatadhammāeva tīsu kālesu anupatanti. Tasmā uppādarahitā asaṅkhatabhūtā nibbānapaññattiyo kālavimuttaṃnāmāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[104] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[104] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Vināsābhāvato atītādikālavasena navattabbattā nibbānaṃ paññattica kālavimuttaṃnāmā’’ti vuttaṃ. Taṃ vicāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbepi hi saṅkhatadhammā anāgatabhāva pubbakāeva honti. Tasmā te yadā paccayasāmaggiṃ labhitvā uppajjissantīti vattabbapakkhe tiṭṭhanti, tadā anāgatānāma. Yadā paccayasāmaggiṃ labhitvā uppannā, yadā paccuppannānāma. Yadā niruddhā, tadā atītānāma. Evaṃ uppādajātikānaññeva uppādamūlikā tekālikatā siddhā. Uppādarahitānaṃ pana anāgatāvatthāpi natthi. Kuto paccuppannātītā vatthāti. Tasmā nibbānapaññattīnaṃ kālattaya vimuttatā hotīti. Vināsābhāvatoti idaṃ pana atītakālavimuttiyāeva kāraṇanti na tena tāsaṃ itarakālavimuttiṃ sādhetīti daṭṭhabbaṃ. Yathārahavibhāgo pana idheva tesūtiādinā pacchā āgamissati. Dvāravimuttānañca chabbidhaṃpi ārammaṇaṃ hotīti sambandho. Yathā pana āvajjanādīnaṃ chadvārikacittānaṃ ārammaṇaṃ bhavantarepi imasmiṃ bhavepi purimabhāge kenaci dvārena gahitaṃpi agahitaṃpi hoti. Na tathā imesanti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhavantare chadvāragahita"
      },
      "nti vuttaṃ. Bhavavisesañhi patthetvā kammaṃ katvā tattha nibbattānaṃ ārammaṇaṃ bhavantarepi kenaci dvārena gahitaṃpi hoti yevāti."
    ],
    "innerText": "Sabbepi hi saṅkhatadhammā anāgatabhāva pubbakāeva honti. Tasmā te yadā paccayasāmaggiṃ labhitvā uppajjissantīti vattabbapakkhe tiṭṭhanti, tadā anāgatānāma. Yadā paccayasāmaggiṃ labhitvā uppannā, yadā paccuppannānāma. Yadā niruddhā, tadā atītānāma. Evaṃ uppādajātikānaññeva uppādamūlikā tekālikatā siddhā. Uppādarahitānaṃ pana anāgatāvatthāpi natthi. Kuto paccuppannātītā vatthāti. Tasmā nibbānapaññattīnaṃ kālattaya vimuttatā hotīti. Vināsābhāvatoti idaṃ pana atītakālavimuttiyāeva kāraṇanti na tena tāsaṃ itarakālavimuttiṃ sādhetīti daṭṭhabbaṃ. Yathārahavibhāgo pana idheva tesūtiādinā pacchā āgamissati. Dvāravimuttānañca chabbidhaṃpi ārammaṇaṃ hotīti sambandho. Yathā pana āvajjanādīnaṃ chadvārikacittānaṃ ārammaṇaṃ bhavantarepi imasmiṃ bhavepi purimabhāge kenaci dvārena gahitaṃpi agahitaṃpi hoti. Na tathā imesanti dassetuṃ bhavantare chadvāragahitanti vuttaṃ. Bhavavisesañhi patthetvā kammaṃ katvā tattha nibbattānaṃ ārammaṇaṃ bhavantarepi kenaci dvārena gahitaṃpi hoti yevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[105] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[105] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Taṃ pana nesaṃ ārammaṇaṃ na āvajjanassa viya kenaci agahitameva gocarabhāvaṃ gacchatīti dassetuṃ chadvāra gahitanti vutta’’nti vuttaṃ. Taṃ na yujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañcadvārā vajjanassapi hi ārammaṇaṃ pubbe kenaci dvārantarena gahitaṃpi agahitaṃpi hotiyeva. Tathā hi idaṃ nāma labhissāmi ",
      " bhuñjissāmi passissāmīti pubbe gahitaṃ pacchā āvajjanassa ārammaṇaṃ na na hotīti. Naca ekāvajjanavīthiyaṃ pubbe kenaci cittena agahitabhāvo idha pamāṇanti. Yathā ca pañcadvārikacittānaṃ ārammaṇaṃ ekantapaccuppannameva hoti. Yathā ca manodvārikacittānaṃ ārammaṇaṃ tekālikaṃvā kālavimuttasā maññaṃvā hoti. Na tathā imesanti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccuppannamatītaṃ paññattibhūtaṃvā"
      },
      "ti vuttaṃ. Yathā ca chadvārikacittānaṃ ārammaṇaṃ āgamasiddhavohārayuttaṃpi tabbohāravinimuttaṃpi hoti. Na tathā imesanti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kamma kamma nimitta gatinimitta sammata"
      },
      "nti vuttaṃ."
    ],
    "innerText": "Pañcadvārā vajjanassapi hi ārammaṇaṃ pubbe kenaci dvārantarena gahitaṃpi agahitaṃpi hotiyeva. Tathā hi idaṃ nāma labhissāmi bhuñjissāmi passissāmīti pubbe gahitaṃ pacchā āvajjanassa ārammaṇaṃ na na hotīti. Naca ekāvajjanavīthiyaṃ pubbe kenaci cittena agahitabhāvo idha pamāṇanti. Yathā ca pañcadvārikacittānaṃ ārammaṇaṃ ekantapaccuppannameva hoti. Yathā ca manodvārikacittānaṃ ārammaṇaṃ tekālikaṃvā kālavimuttasā maññaṃvā hoti. Na tathā imesanti dassetuṃ paccuppannamatītaṃ paññattibhūtaṃvāti vuttaṃ. Yathā ca chadvārikacittānaṃ ārammaṇaṃ āgamasiddhavohārayuttaṃpi tabbohāravinimuttaṃpi hoti. Na tathā imesanti dassetuṃ kamma kamma nimitta gatinimitta sammatanti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[106] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[106] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Nāpi nesaṃ ārammaṇaṃ maraṇāsannato purimabhāgajavanānaṃ viya kammakammanimittādivasena āgamasiddhavohāravinimuttanti dassetuṃ kamma.La. Sammatanti āhā’’ti vuttaṃ. Taṃpi na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Maraṇā sannato purimabhāgepi hi sattā attanā katakammaṃvā cetiyādīni kamma, pakaraṇānivā ārammaṇaṃ karontiyeva. Tadāpi hi kammaṃ kammameva, kammupakaraṇānica kammanimittāniyeva. Kamma siddhiyānimittaṃ kāraṇaṃ kammanimittanti katvā. Kammassa nimittaṃ ārammaṇaṃ kammanimittantipi vadanti. Ajātasatturājā viyaca supinadassanādivasena gatinimittānipi ārammaṇaṃ karontiyeva. Rājā hi dvīsu bhavesu pitaraṃ māreti. Māritakālatoca paṭṭhāya tassa niddāyantassa gatinimittāni upaṭṭhahantīti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathāsambhava"
      },
      "nti taṃ taṃ paṭisandhādīnaṃ chadvāragahitādivasena sambhavantassa ārammaṇassa anurūpato. Yathāsambhavavibhāgo pana upari maraṇuppattiyaṃ āgamissati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yebhuyyenā"
      },
      "ti bāhullena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavantare"
      },
      "ti atītānantarabhave tatthaca maraṇāsannakāle. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chadvāra gahita"
      },
      "nti chahi dvārehi maraṇāsannajavanehi gahitaṃ. Ettha ca yebhuyyenāti etena bhavantare chadvāragahitanti imassa vidhānassa anekaṃsabhāvaṃ viseseti. Kasmā. Agahitassapi sambhavato. Yañhi asaññibhavato cutānaṃ kamma kammanimitta gatinimitta sammataṃ ",
      " arūpabhavato cutānañca gatinimittasammataṃ kāmapaṭisandhi bhavaṅgacutīnaṃ ārammaṇaṃ. Taṃ bhavantare kenaci dvārena agahita meva hotīti. Etthaca yasmā paṭṭhāne arūpabhave duvidhopi purejātapaccayo paṭisiddho. Aṭṭhakathāsuca tato cutānaṃ kāmapaṭisandhiyā paccuppannagatinimittārammaṇatāpi vuttā. Gatinimittañca nāma rūpārammaṇameva dīpenti. Tasmā tesaṃ kāmapaṭisandhiyāpi gatinimittasammataṃ bhavantare kenaci dvārena agahitameva hotīti veditabbaṃ. Apica, maraṇāsannakāle kammabalena kammādīnaṃ upaṭṭhānaṃnāma yebhuyyena saṃmuḷhamaraṇena marantānameva hoti. Itaresaṃ pana paresaṃ payogabalenapi attanā pakatiyā suṭṭhu āsevitānaṃ anussaraṇabalenapi dhammikaupāsakādīnaṃ viya devalokato āgantvā gaṇhantānaṃ devānaṃ ānubhāvenapi hotiyeva. Nirayapālāpi nirayato āgantvā gaṇhantiyeva. Revativimānañcettha vattabbaṃ. Tañhi dve nirayapālā gahetvā pathamaṃ tāvatiṃsābhavanaṃ netvā pacchā nirayaṃ nayiṃsu. Te hi yakkha jātikattā vessavaṇaparisāviya tāvatiṃsā bhavanaṃpi gantuṃ sakkontiyeva. Yamassa dūtā dve yakkhāti hi pāḷiyaṃ vuttaṃ. Vessavaṇadūtā idha yamassa dūtāti vuttātipi vadanti. Tasmā ye kasiṇāsubhādīni samathanimittāni suṭṭhu āsevitvā upacārajjhāne ṭhatvā tāneva nimittāni gahetvā maranti. Tesaṃpi kāmapaṭisandhiyā ārammaṇaṃ bhavantare kenaci dvārena agahitameva siyā. Upacārajjhānabaleneva brahmalokato idhauppajjantānaṃpi esevanayoti."
    ],
    "innerText": "Maraṇā sannato purimabhāgepi hi sattā attanā katakammaṃvā cetiyādīni kamma, pakaraṇānivā ārammaṇaṃ karontiyeva. Tadāpi hi kammaṃ kammameva, kammupakaraṇānica kammanimittāniyeva. Kamma siddhiyānimittaṃ kāraṇaṃ kammanimittanti katvā. Kammassa nimittaṃ ārammaṇaṃ kammanimittantipi vadanti. Ajātasatturājā viyaca supinadassanādivasena gatinimittānipi ārammaṇaṃ karontiyeva. Rājā hi dvīsu bhavesu pitaraṃ māreti. Māritakālatoca paṭṭhāya tassa niddāyantassa gatinimittāni upaṭṭhahantīti. Tattha yathāsambhavanti taṃ taṃ paṭisandhādīnaṃ chadvāragahitādivasena sambhavantassa ārammaṇassa anurūpato. Yathāsambhavavibhāgo pana upari maraṇuppattiyaṃ āgamissati. Yebhuyyenāti bāhullena. Bhavantareti atītānantarabhave tatthaca maraṇāsannakāle. Chadvāra gahitanti chahi dvārehi maraṇāsannajavanehi gahitaṃ. Ettha ca yebhuyyenāti etena bhavantare chadvāragahitanti imassa vidhānassa anekaṃsabhāvaṃ viseseti. Kasmā. Agahitassapi sambhavato. Yañhi asaññibhavato cutānaṃ kamma kammanimitta gatinimitta sammataṃ arūpabhavato cutānañca gatinimittasammataṃ kāmapaṭisandhi bhavaṅgacutīnaṃ ārammaṇaṃ. Taṃ bhavantare kenaci dvārena agahita meva hotīti. Etthaca yasmā paṭṭhāne arūpabhave duvidhopi purejātapaccayo paṭisiddho. Aṭṭhakathāsuca tato cutānaṃ kāmapaṭisandhiyā paccuppannagatinimittārammaṇatāpi vuttā. Gatinimittañca nāma rūpārammaṇameva dīpenti. Tasmā tesaṃ kāmapaṭisandhiyāpi gatinimittasammataṃ bhavantare kenaci dvārena agahitameva hotīti veditabbaṃ. Apica, maraṇāsannakāle kammabalena kammādīnaṃ upaṭṭhānaṃnāma yebhuyyena saṃmuḷhamaraṇena marantānameva hoti. Itaresaṃ pana paresaṃ payogabalenapi attanā pakatiyā suṭṭhu āsevitānaṃ anussaraṇabalenapi dhammikaupāsakādīnaṃ viya devalokato āgantvā gaṇhantānaṃ devānaṃ ānubhāvenapi hotiyeva. Nirayapālāpi nirayato āgantvā gaṇhantiyeva. Revativimānañcettha vattabbaṃ. Tañhi dve nirayapālā gahetvā pathamaṃ tāvatiṃsābhavanaṃ netvā pacchā nirayaṃ nayiṃsu. Te hi yakkha jātikattā vessavaṇaparisāviya tāvatiṃsā bhavanaṃpi gantuṃ sakkontiyeva. Yamassa dūtā dve yakkhāti hi pāḷiyaṃ vuttaṃ. Vessavaṇadūtā idha yamassa dūtāti vuttātipi vadanti. Tasmā ye kasiṇāsubhādīni samathanimittāni suṭṭhu āsevitvā upacārajjhāne ṭhatvā tāneva nimittāni gahetvā maranti. Tesaṃpi kāmapaṭisandhiyā ārammaṇaṃ bhavantare kenaci dvārena agahitameva siyā. Upacārajjhānabaleneva brahmalokato idhauppajjantānaṃpi esevanayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "Yaṃpana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "Yaṃpana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Kevalaṃ kammabaleneva tesaṃ asaññibhavato cutānaṃ paṭisandhiyā kammanimittādikaṃ ārammaṇaṃ upaṭṭhātī’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha kammanimittādikanti ettha ādisaddena kammaṃpi gahetabba meva. Na hi tassa agahaṇe kāraṇaṃ atthīti. Tāni pana sabbānipi kevalaṃ paṭisandhijanakassa kammassa ānubhāveneva paṭisandhiyaṃ upaṭṭhahantīti ",
      " veditabbaṃ. Anāgataṃ pana nimittaṃ upaṭṭhahamānaṃ gatinimittameva siyā. Naca tassa visuṃ upaṭṭhātabbakiccaṃ atthi. Paccuppanna gatinimitte siddhe siddhameva hotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccuppannamatītaṃ paññatti bhūtaṃvā"
      },
      "ti."
    ],
    "innerText": "Tattha kammanimittādikanti ettha ādisaddena kammaṃpi gahetabba meva. Na hi tassa agahaṇe kāraṇaṃ atthīti. Tāni pana sabbānipi kevalaṃ paṭisandhijanakassa kammassa ānubhāveneva paṭisandhiyaṃ upaṭṭhahantīti veditabbaṃ. Anāgataṃ pana nimittaṃ upaṭṭhahamānaṃ gatinimittameva siyā. Naca tassa visuṃ upaṭṭhātabbakiccaṃ atthi. Paccuppanna gatinimitte siddhe siddhameva hotīti vuttaṃ paccuppannamatītaṃ paññatti bhūtaṃvāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[107] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[107] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Anāgataṃnāma atītaṃ viya anubhūtañca na hoti. Naca paccuppannagatinimittaṃ viya āpātamāgata’’nti kāraṇaṃ vuttaṃ. Taṃ akāraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pasaṅgassa anivattitattā. Gatinimittañhi nāma paccuppannaṃpi anubhūtaṃ na hoti. Taṃpi kammabaleneva āpātamāgataṃ. Evaṃsante anāgataṃpi kammabalena āpātamāgatameva siyāti ayaṃ pasaṅgo pākatikoeva hotīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesū"
      },
      "ti yathāvuttesu ārammaṇikacittesu. Rūpādīsu pañcasu ekekaṃ ārammaṇaṃ etesanti samāso. Rūpādīni pañca ārammaṇāni etassāti viggaho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sesānī"
      },
      "ti pañcaviññāṇasampaṭicchana dvayato sesāni santīraṇa mahāvipākāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbathāpi kāmāvacarā lambaṇānevā"
      },
      "ti paṭisandhādīhi nānākiccehi rūpādīsu nānārammaṇesu pavattena sabba pakārenapi kāmāvacarālambaṇikāniyeva. Tāni hi sabbaññubuddhānaṃ uppannānipi vikappasattirahitattā avijjamāne paññattidhammeca sukhume mahaggatadhammeca gambhīre lokuttaradhammeca ālambituṃ na sakkontīti. Tattha santīraṇattayaṃ tāva santīraṇakiccavasena rūpādipañcālambaṇe pavattati. Tadārammaṇādivasena pana sabbānipi ekādasavipākāni chasu parittārammaṇesu pavattantīti."
    ],
    "innerText": "Pasaṅgassa anivattitattā. Gatinimittañhi nāma paccuppannaṃpi anubhūtaṃ na hoti. Taṃpi kammabaleneva āpātamāgataṃ. Evaṃsante anāgataṃpi kammabalena āpātamāgatameva siyāti ayaṃ pasaṅgo pākatikoeva hotīti. Tesūti yathāvuttesu ārammaṇikacittesu. Rūpādīsu pañcasu ekekaṃ ārammaṇaṃ etesanti samāso. Rūpādīni pañca ārammaṇāni etassāti viggaho. Sesānīti pañcaviññāṇasampaṭicchana dvayato sesāni santīraṇa mahāvipākāni. Sabbathāpi kāmāvacarā lambaṇānevāti paṭisandhādīhi nānākiccehi rūpādīsu nānārammaṇesu pavattena sabba pakārenapi kāmāvacarālambaṇikāniyeva. Tāni hi sabbaññubuddhānaṃ uppannānipi vikappasattirahitattā avijjamāne paññattidhammeca sukhume mahaggatadhammeca gambhīre lokuttaradhammeca ālambituṃ na sakkontīti. Tattha santīraṇattayaṃ tāva santīraṇakiccavasena rūpādipañcālambaṇe pavattati. Tadārammaṇādivasena pana sabbānipi ekādasavipākāni chasu parittārammaṇesu pavattantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[108] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[108] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Vipākāni tāva santīraṇādivasena rūpādipañcālambaṇe’’ti vuttaṃ. Tattha santīraṇādivasenāti navattabbaṃ. Santīraṇavasena icceva vattabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yo panettha cittānaṃ ārammaṇesu pavattivibhāgo vattabbo. So aṭṭhakathākaṇḍe gahetabbo. Lokuttaradhammā atigambhīrattā ",
      " ñāṇasseva visayabhūtāti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akusala.La. Lokuttara vajjita sabbā rammaṇānī"
      },
      "ti. Tattha tāni laddhasamāpattīnaṃ uppannakāleeva mahaggatārammaṇāni. Tesuca dve dosamūlacittāni parihīnajjhānāni ārabbha uppannakāleti daṭṭhabbaṃ. Ñāṇaṃpi anadhigatāni lokuttarāni ālambituṃ na sakkotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñāṇasampayutta.La. Vajjitasabbā rammaṇānī"
      },
      "ti. Tattha ñāṇasampayuttakāmakusalāni puthujjanānaṃ ajjhānalābhīnaṃ uppannakāle paññattiyā saha kāmāvacarārammaṇāni. Tāneva sotāpattimaggato pure gotrabhukkhaṇe puthujjanānaṃ nibbānārammaṇāni. Jhānalābhīnaṃ tāneva abhiññākusalañca mahaggatārammaṇānipi. Heṭṭhimaphalaṭṭhānaṃ attanā adhigata maggaphalanibbānā rammaṇānipīti veditabbāni. Yathā cettha ariyā attanā adhigata maggaphalāniyeva ālambituṃ sakkonti. Tathā jhānalābhinopi attanā adhigatajjhānānieva ālambituṃ sakkontīti veditabbaṃ. Ettha siyā-ye ca jhānāni patthenti. Jhānaparikammaṃpi karonti. Yeca jhānasuttāni saṃvaṇṇenti. Te alābhino mahaggatajjhānāni ālambituṃ sakkonti, nasakkontīti. Na sakkonti. Te hi jhānānināma evaṃ mahānubhāvāni evaṃ mahānisaṃsānīti sutvāvā sutapariyattibalena siddhe ākāra sallakkhaṇaññāṇe ṭhatvā vā anumānavaseneva tāni patthenti. Parikammaṃpi karonti. Suttānipi saṃvaṇṇentīti. Itarathā puthujjanāpi lokuttaradhamme patthenti, maggaparikammaṃpi karonti. Maggaphala nibbānavacanānivikathenti saṃvaṇṇentīti tesaṃpi te ārammaṇabhūtā eva siyunti. Tesaṃ pana cittāni jhānādīnaṃ paññattiguṇe eva anubhontīti veditabbāni. Paṇītadhammānañhi paññattiyopi paṇitarūpāeva hontīti. Mahiddhiko hi paracittavidū. Māro deva puttopi rūpajjhānacittaṃ vaṭṭanissitameva passati. Vivaṭṭanissitaṃ na passati. Arūpajjhānacittaṃ pana vaṭṭanissitaṃpi napassatīti aṅguttare navanipāte aṭṭhakathāyaṃ vuttaṃ. Ye pana aggamaggaphalāni paṭivijjhanti. Tesaṃ uppannāniññaṇasampayuttakāmakriyajavanāni kriyābhiññājavanañca puggalānurūpaṃ paññattiyā saha catubbhūmakadhammesu kiñci ārammaṇaṃ ",
      " kātuṃ nasakkontīti natthi. Tathā tesaṃ purecāri kamanodvārāvajjanañcāti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ṭhāṇasampayutta.La. Sabbathāpisabbā rammaṇānī"
      },
      "ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbathāpī"
      },
      "ti sabbakāmāvacara sabbamahaggata sabbalokuttara sabbapaññatti sabbapaccuppannādi pakārenapītiattho. Idañca sabbaññubuddhānaṃ uppannāni sandhāya vuttaṃ. Itarāni pana pacceka buddhānaṃ uppannānipi padesasabbārammaṇānieva honti. Tāni hi ekaṃ pathavidhātuṃpi sabbehi anavasesapakārehi jānituṃ nasakkontīti. Āruppesu dutīyacatutthāni pathamatatīyāruppa viññāṇā rammaṇattā mahaggatā rammaṇāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sesānī"
      },
      "ti abhiññā dvaya dutīyacatutthāruppehi avasesāni sabbānipi ekavīsatividhāni mahaggatacittāni kasiṇādi paññattārammaṇānīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcavīsā"
      },
      "ti pañcadvārāvajjana tevīsati kāmavipāka hasanacittāni sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parittamhī"
      },
      "ti kāmāvacarā lambaṇe evāti attho. Tañhi appānubhāvato paṭibandhakadhammehi parisamantato dīyati avakhaṇḍīyati nittejabhāvaṃ pāpīyatīti parittanti vuccati."
    ],
    "innerText": "Yo panettha cittānaṃ ārammaṇesu pavattivibhāgo vattabbo. So aṭṭhakathākaṇḍe gahetabbo. Lokuttaradhammā atigambhīrattā ñāṇasseva visayabhūtāti vuttaṃ. Akusala.La. Lokuttara vajjita sabbā rammaṇānīti. Tattha tāni laddhasamāpattīnaṃ uppannakāleeva mahaggatārammaṇāni. Tesuca dve dosamūlacittāni parihīnajjhānāni ārabbha uppannakāleti daṭṭhabbaṃ. Ñāṇaṃpi anadhigatāni lokuttarāni ālambituṃ na sakkotīti vuttaṃ ñāṇasampayutta.La. Vajjitasabbā rammaṇānīti. Tattha ñāṇasampayuttakāmakusalāni puthujjanānaṃ ajjhānalābhīnaṃ uppannakāle paññattiyā saha kāmāvacarārammaṇāni. Tāneva sotāpattimaggato pure gotrabhukkhaṇe puthujjanānaṃ nibbānārammaṇāni. Jhānalābhīnaṃ tāneva abhiññākusalañca mahaggatārammaṇānipi. Heṭṭhimaphalaṭṭhānaṃ attanā adhigata maggaphalanibbānā rammaṇānipīti veditabbāni. Yathā cettha ariyā attanā adhigata maggaphalāniyeva ālambituṃ sakkonti. Tathā jhānalābhinopi attanā adhigatajjhānānieva ālambituṃ sakkontīti veditabbaṃ. Ettha siyā-ye ca jhānāni patthenti. Jhānaparikammaṃpi karonti. Yeca jhānasuttāni saṃvaṇṇenti. Te alābhino mahaggatajjhānāni ālambituṃ sakkonti, nasakkontīti. Na sakkonti. Te hi jhānānināma evaṃ mahānubhāvāni evaṃ mahānisaṃsānīti sutvāvā sutapariyattibalena siddhe ākāra sallakkhaṇaññāṇe ṭhatvā vā anumānavaseneva tāni patthenti. Parikammaṃpi karonti. Suttānipi saṃvaṇṇentīti. Itarathā puthujjanāpi lokuttaradhamme patthenti, maggaparikammaṃpi karonti. Maggaphala nibbānavacanānivikathenti saṃvaṇṇentīti tesaṃpi te ārammaṇabhūtā eva siyunti. Tesaṃ pana cittāni jhānādīnaṃ paññattiguṇe eva anubhontīti veditabbāni. Paṇītadhammānañhi paññattiyopi paṇitarūpāeva hontīti. Mahiddhiko hi paracittavidū. Māro deva puttopi rūpajjhānacittaṃ vaṭṭanissitameva passati. Vivaṭṭanissitaṃ na passati. Arūpajjhānacittaṃ pana vaṭṭanissitaṃpi napassatīti aṅguttare navanipāte aṭṭhakathāyaṃ vuttaṃ. Ye pana aggamaggaphalāni paṭivijjhanti. Tesaṃ uppannāniññaṇasampayuttakāmakriyajavanāni kriyābhiññājavanañca puggalānurūpaṃ paññattiyā saha catubbhūmakadhammesu kiñci ārammaṇaṃ kātuṃ nasakkontīti natthi. Tathā tesaṃ purecāri kamanodvārāvajjanañcāti vuttaṃ ṭhāṇasampayutta.La. Sabbathāpisabbā rammaṇānīti. Tattha sabbathāpīti sabbakāmāvacara sabbamahaggata sabbalokuttara sabbapaññatti sabbapaccuppannādi pakārenapītiattho. Idañca sabbaññubuddhānaṃ uppannāni sandhāya vuttaṃ. Itarāni pana pacceka buddhānaṃ uppannānipi padesasabbārammaṇānieva honti. Tāni hi ekaṃ pathavidhātuṃpi sabbehi anavasesapakārehi jānituṃ nasakkontīti. Āruppesu dutīyacatutthāni pathamatatīyāruppa viññāṇā rammaṇattā mahaggatā rammaṇāni. Sesānīti abhiññā dvaya dutīyacatutthāruppehi avasesāni sabbānipi ekavīsatividhāni mahaggatacittāni kasiṇādi paññattārammaṇānīti attho. Pañcavīsāti pañcadvārāvajjana tevīsati kāmavipāka hasanacittāni sandhāya vuttaṃ. Parittamhīti kāmāvacarā lambaṇe evāti attho. Tañhi appānubhāvato paṭibandhakadhammehi parisamantato dīyati avakhaṇḍīyati nittejabhāvaṃ pāpīyatīti parittanti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "135"
      },
      ". Cakkhādīnaṃ vatthūnaṃ bhedena tabbatthukānaṃ cittacetasi kānaṃ saṅgaho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vatthusaṅgaho"
      },
      "."
    ],
    "innerText": "135. Cakkhādīnaṃ vatthūnaṃ bhedena tabbatthukānaṃ cittacetasi kānaṃ saṅgaho vatthusaṅgaho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[109] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[109] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Vatthuvibhāgato tabbatthukacittaparicchedavasenaca saṅgaho vatthusaṅgaho’’ti vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vasantipatiṭṭhahanti cittacetasikāetesūtivatthūni, cakkhuvatthuca. La. Kāyavatthucahadayavatthucātiyojanā. Cakkhumeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhuvatthu"
      },
      " tathā sotādīniyeva sotavatthādīni. Vākyasaṅkhepo hesa pāṭho. Peyyālanayotipi antadīpakanayotipi vattuṃ yujjati. Keci pana dvandasamāsaṃ maññanti. Tesaṃ casaddo nayujjati. Parato vatthusaddo casaddoca pubbapadesu ānetabbotipi vadanti. Tesaṃ hadayavatthūti samāsapadaṃ nayujjati. Avibhattikaniddesotipi apare. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāni kāmaloke sabbānipi labbhantī"
      },
      "ti kāmataṇhā dhina kammanibbattānaṃ attabhāvānaṃeva paripuṇṇindriyatā sambhavato sabbānipi ",
      " tāni cha vatthūni kāmalokeeva labbhanti. Tathā hi cakkhādīsu vatthūsu santesu evarūpādīnaṃ paribhogo sampajjati. Tasmā rūpādīsu kāmavatthūsu abhiratā kāmataṇhā sadā cakkhādīnaṃ pañcannaṃ vatthūnaṃpi sampattiṃ patthetiyeva. Yathāca sabbakammiko amacco sadā rañño icchameva pūrayamāno sabbāni rājakammāni sampādeti. Evameva kāmāvacarakammaṃpi sadā kāmataṇhāya icchameva pūrayamānaṃ paripuṇṇindriyaṃ attabhāvaṃ nibbatteti. Tasmā kāmataṇhādhinakammanibbattā kāmasattāeva paripuṇṇindriyā hontīti. Yathā ca dassanasavanānuttariya dhammabhūtāni cakkhusotāni buddhadassana dhammassavanā divasena sattānaṃ visuddhiyāpi honti, na tathā ghānādittayaṃ. Taṃ pana kevalaṃ kāmaparibhogatthāyaeva hoti. Tasmā taṃ kāmavirāgabhāvanā kammanibbattesu brahmattabhāvesu naupalabbhatīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpaloke pana ghānādittayaṃ natthī"
      },
      "ti. Idañca pasādarūpattayaṃ sandhāya vuttaṃ. Sasambhāraghāna jivhā kāya saṇṭhānānipana suṭṭhuparipuṇṇānieva hontīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arūpalokepana sabbānipi nasaṃvijjantī"
      },
      "ti rūpavirāga bhāvanā kammanibbatte tasmiṃ loke ajjhattabahiddhāsantānesupi sabbena sabbaṃ rūpapavattiyāeva abhāvato. Tattha nibbattā hi sattā suddhe ākāsataleeva cittapabandhamattā hutvā tiṭṭhantīti. Imasmiṃ saṅgahe pana cittāni sattaviññāṇa dhātuvasena gahetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha pañcaviññāṇadhātuyo"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti tesu chasu vatthūsu. Pañcaviññāṇāni eva nisattanijīvaṭṭhena dhātuyoti viggaho. Evaṃ sesesupi. Vijānanakiccābhāvato mananamattā dhātūti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manodhātu"
      },
      ". Pañcadvāre āvajjanamatta sampaṭicchanamatta kiccāni hi visesajānana kiccāni nahontīti. Pañcaviññāṇāni pana paccakkhato dassanādivasena thokaṃ visesajānanakiccāni honti. Avasesā pana santīraṇādayo ārammaṇasabhāva vicāraṇā divasena atireka visiṭṭhajānanakiccayuttattā na manodhātuyo viya mananamattā honti. Nāpi pañcaviññāṇadhātuyoviya vijānana mattā. Athakho mananaṭṭhena manoca taṃ vijānanaṭṭhena viññāṇañcāti katvā ",
      " manoviññāṇadhātuyonāma. Atisaya visesajānana dhātuyoti attho. Pariyāyapadānañhi visesana samāse atisayattho viññāyati. Yathā padaṭṭhānanti."
    ],
    "innerText": "Vasantipatiṭṭhahanti cittacetasikāetesūtivatthūni, cakkhuvatthuca. La. Kāyavatthucahadayavatthucātiyojanā. Cakkhumeva cakkhuvatthu tathā sotādīniyeva sotavatthādīni. Vākyasaṅkhepo hesa pāṭho. Peyyālanayotipi antadīpakanayotipi vattuṃ yujjati. Keci pana dvandasamāsaṃ maññanti. Tesaṃ casaddo nayujjati. Parato vatthusaddo casaddoca pubbapadesu ānetabbotipi vadanti. Tesaṃ hadayavatthūti samāsapadaṃ nayujjati. Avibhattikaniddesotipi apare. Tāni kāmaloke sabbānipi labbhantīti kāmataṇhā dhina kammanibbattānaṃ attabhāvānaṃeva paripuṇṇindriyatā sambhavato sabbānipi tāni cha vatthūni kāmalokeeva labbhanti. Tathā hi cakkhādīsu vatthūsu santesu evarūpādīnaṃ paribhogo sampajjati. Tasmā rūpādīsu kāmavatthūsu abhiratā kāmataṇhā sadā cakkhādīnaṃ pañcannaṃ vatthūnaṃpi sampattiṃ patthetiyeva. Yathāca sabbakammiko amacco sadā rañño icchameva pūrayamāno sabbāni rājakammāni sampādeti. Evameva kāmāvacarakammaṃpi sadā kāmataṇhāya icchameva pūrayamānaṃ paripuṇṇindriyaṃ attabhāvaṃ nibbatteti. Tasmā kāmataṇhādhinakammanibbattā kāmasattāeva paripuṇṇindriyā hontīti. Yathā ca dassanasavanānuttariya dhammabhūtāni cakkhusotāni buddhadassana dhammassavanā divasena sattānaṃ visuddhiyāpi honti, na tathā ghānādittayaṃ. Taṃ pana kevalaṃ kāmaparibhogatthāyaeva hoti. Tasmā taṃ kāmavirāgabhāvanā kammanibbattesu brahmattabhāvesu naupalabbhatīti vuttaṃ rūpaloke pana ghānādittayaṃ natthīti. Idañca pasādarūpattayaṃ sandhāya vuttaṃ. Sasambhāraghāna jivhā kāya saṇṭhānānipana suṭṭhuparipuṇṇānieva hontīti. Arūpalokepana sabbānipi nasaṃvijjantīti rūpavirāga bhāvanā kammanibbatte tasmiṃ loke ajjhattabahiddhāsantānesupi sabbena sabbaṃ rūpapavattiyāeva abhāvato. Tattha nibbattā hi sattā suddhe ākāsataleeva cittapabandhamattā hutvā tiṭṭhantīti. Imasmiṃ saṅgahe pana cittāni sattaviññāṇa dhātuvasena gahetuṃ tattha pañcaviññāṇadhātuyotiādi vuttaṃ. Tatthāti tesu chasu vatthūsu. Pañcaviññāṇāni eva nisattanijīvaṭṭhena dhātuyoti viggaho. Evaṃ sesesupi. Vijānanakiccābhāvato mananamattā dhātūti manodhātu. Pañcadvāre āvajjanamatta sampaṭicchanamatta kiccāni hi visesajānana kiccāni nahontīti. Pañcaviññāṇāni pana paccakkhato dassanādivasena thokaṃ visesajānanakiccāni honti. Avasesā pana santīraṇādayo ārammaṇasabhāva vicāraṇā divasena atireka visiṭṭhajānanakiccayuttattā na manodhātuyo viya mananamattā honti. Nāpi pañcaviññāṇadhātuyoviya vijānana mattā. Athakho mananaṭṭhena manoca taṃ vijānanaṭṭhena viññāṇañcāti katvā manoviññāṇadhātuyonāma. Atisaya visesajānana dhātuyoti attho. Pariyāyapadānañhi visesana samāse atisayattho viññāyati. Yathā padaṭṭhānanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[110] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[110] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Manoyeva viññāṇaṃ manoviññāṇanti vā. Manaso viññāṇaṃ manoviññāṇa’’nti vā vuttaṃ. Tattha manoyeva viññāṇanti idaṃ tāva na yujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na hi aññamaññaṃ visesetvā abhirekaṭṭhadīpake padaṭṭhānantiādike visesanasamāse avadhāraṇa viggaho katthaci dissati yujjaticāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[111]"
      },
      " Manaso viññāṇanti idaṃpi nayujjatiyeva."
    ],
    "innerText": "[111] Manaso viññāṇanti idaṃpi nayujjatiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Manasoti hi manodhātuttikasaṅkhātassa manassa. Tattha sampaṭicchanadvayaṃ santīraṇādikassa manoviññāṇapabandhassa paccayabhūtaṃ hoti. Pañcadvārāvajjanaṃ pana parato dvārantare pavattamānaṃ tasseva manoviññāṇapabandhassa paccayuppannabhūtaṃ hotītikatvā ādimhi paccayabhūtassa ceva ante dvārantare paccayuppannabhūtassa ca manassa sambandhiviññāṇanti attho. Athavā, pañcaviññāṇavajjitāni sabbāni viññāṇāni mananakiccattā manonāma. Ārammaṇe pana abhinipāta mattāni pañcaviññāṇāni mananakiccāni nahontīti dassanādīni eva nāma. Pañcadvārāvajjanañca manato jātaṃpi manassa paccayo nahoti. Dassanādīnaṃ eva paccayo. Sampaṭicchanadvayañca manassa paccayo hontaṃpi manato jātaṃ nahoti. Dassanādito eva jātaṃ. Santīraṇādīni pana attano pure pacchāpavattānaṃ dvinnaṃ dvinnaṃ manānaṃ eva majjhe jātānīti attano paccaya paccayuppannabhūtassa manassa sambandhiviññāṇanti attho. Evañca sati pañcaviññāṇaṃpi dvinnaṃ manodhātūnaṃ antare pavattattā manaso paccaya paccayuppannabhūtassa sambandhiviññāṇaṃ manoviññāṇanti vattabbameva siyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[112] Ṭīkāyaṃ"
      },
      " pana"
    ],
    "innerText": "[112] Ṭīkāyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Manato jātaṃ viññāṇantipi vuttaṃ. Taṃpi vuttanayena nayujjatiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Avasesā pana manoviññāṇadhātusaṅkhātāca santīraṇa.La. Pannarasarūpāvacaravasena tiṃsadhammā hadayaṃ nissāyeva pavattantīti yojanā. Casaddo panettha avasesānaṃ chasattati dhammānaṃ manoviññāṇadhātubhāvaṃ sambhāveti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[113] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[113] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Sampiṇḍanatthaṃ gahetvā ‘‘na kevalaṃ manodhātuyevā’’ti vuttaṃ. Taṃ na yujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evañhi sati avasesāca manoviññāṇadhātusaṅkhātāti vuttaṃ siyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[114]"
      },
      " Yāca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ṭīkāsu"
      }
    ],
    "innerText": "[114] Yāca ṭīkāsu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Santīraṇa.La. Rūpāvacaravasena pavattā, avasesā manoviññāṇa dhātusaṅkhātāca tiṃsa dhammāti yojanā. Sāpi na sundarā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atthagatiyā avisadattāti. Tattha kasmā te nissāyeva pavattantīti. Āruppesu anuppajjanato, kasmāca tattha nuppajjantīti vuccate. Santīraṇamahāvipākāni tāva tattha nuppajjanti pañcannaṃ dvārānaṃ attano kiccānañca tattha abhāvato. Paṭighacittadvayaṃpi nuppajjati. Anīvaraṇāvatthassa paṭighassa abhāvato. Ekanta nīvaraṇānañca jhānabhūmīsu asambhavato. Ettha pana yadi anīvaraṇāvattho paṭigho natthi. Pāḷiyaṃ dutīyajjhāneeva domassindriyassa aparisesanirodhavacanaṃ aṭṭhakathāsuca dutīyajjhānūpacāre tassa uppattisambhavavacanaṃ viruddhaṃ siyā. Tasmā attano sahāyapaccaya bhūtassa oḷārikassa kāmarāgassa jhānabhūmīsu abhāvato paṭighacittadvayaṃ tattha nuppajjatīti yuttantipi vadanti. Ṭīkākārāpana dutīyajjhānūpacāre tassa uppattisambhava vacanaṃ parikappavacanamattanti katvā ",
      " purimakāraṇameva icchanti. Yadi panetaṃ parikappavacanamattaṃ siyā pāḷivacanaṃpi parikappavacanamattameva siyā. Tasmā pacchimakā raṇameva yuttarūpanti amhākaṃ khanti. Hasanacittaṃpi nuppajjati arūpīnaṃ hasanakiccassa abhāvato. Kāyābhāvatotipi yujjati. Sotāpattimaggacittaṃpi nuppajjati. Paratoghosābhāvena tatthuppannassa puthujjanassa dhammābhisamayābhāvato buddhapaccekabuddhānañca tattha anuppajjanato. Teneva hi tatthuppanno puthujjano aṭṭhasu akkhaṇayuttesu vuttoti. Rūpāvacaracittānipi tattha nuppajjanti rūpavirāgabhāvanāya rūpanimittārammaṇānaṃ tesaṃ samatikkantattāti."
    ],
    "innerText": "Atthagatiyā avisadattāti. Tattha kasmā te nissāyeva pavattantīti. Āruppesu anuppajjanato, kasmāca tattha nuppajjantīti vuccate. Santīraṇamahāvipākāni tāva tattha nuppajjanti pañcannaṃ dvārānaṃ attano kiccānañca tattha abhāvato. Paṭighacittadvayaṃpi nuppajjati. Anīvaraṇāvatthassa paṭighassa abhāvato. Ekanta nīvaraṇānañca jhānabhūmīsu asambhavato. Ettha pana yadi anīvaraṇāvattho paṭigho natthi. Pāḷiyaṃ dutīyajjhāneeva domassindriyassa aparisesanirodhavacanaṃ aṭṭhakathāsuca dutīyajjhānūpacāre tassa uppattisambhavavacanaṃ viruddhaṃ siyā. Tasmā attano sahāyapaccaya bhūtassa oḷārikassa kāmarāgassa jhānabhūmīsu abhāvato paṭighacittadvayaṃ tattha nuppajjatīti yuttantipi vadanti. Ṭīkākārāpana dutīyajjhānūpacāre tassa uppattisambhava vacanaṃ parikappavacanamattanti katvā purimakāraṇameva icchanti. Yadi panetaṃ parikappavacanamattaṃ siyā pāḷivacanaṃpi parikappavacanamattameva siyā. Tasmā pacchimakā raṇameva yuttarūpanti amhākaṃ khanti. Hasanacittaṃpi nuppajjati arūpīnaṃ hasanakiccassa abhāvato. Kāyābhāvatotipi yujjati. Sotāpattimaggacittaṃpi nuppajjati. Paratoghosābhāvena tatthuppannassa puthujjanassa dhammābhisamayābhāvato buddhapaccekabuddhānañca tattha anuppajjanato. Teneva hi tatthuppanno puthujjano aṭṭhasu akkhaṇayuttesu vuttoti. Rūpāvacaracittānipi tattha nuppajjanti rūpavirāgabhāvanāya rūpanimittārammaṇānaṃ tesaṃ samatikkantattāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Avasesā manoviññāṇadhātusaṅkhātā kusalākusalakriyānuttaravasena dve cattālīsadhammā hadayaṃ nissāyavā anissāyavā pavattantīti yojanā. Nissāyavā pañcavokāre anissāyavā catuvokāreti adhippāyo. Kusalānica akusalānica kriyānica anuttarānicāti viggaho. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kusalānī"
      },
      "ti pañcarūpa kusalato avasesāni dvādasalokiyakusalāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akusalānī"
      },
      "ti paṭighadvayato avasesāni dasaakusalāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kriyānī"
      },
      "ti pañcadvārāvajjana hasana pañcarūpakrito avasesāni terasakriyacittāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuttarānī"
      },
      "ti pathamamaggato avasesāni sattaanuttaracittāni. Kāme chavatthuṃ nissitā sattadhātuyo matā. Rūpe tivatthuṃ nissitā catubbidhā dhātuyo matā. Āruppe kiñcivatthuṃ anissitā ekā dhātu matāti yojanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tecattālīsā"
      },
      "ti pañcaviññāṇa manodhātuttikehi saddhiṃ santīraṇādike tiṃsadhamme sandhāya vuttanti."
    ],
    "innerText": "Avasesā manoviññāṇadhātusaṅkhātā kusalākusalakriyānuttaravasena dve cattālīsadhammā hadayaṃ nissāyavā anissāyavā pavattantīti yojanā. Nissāyavā pañcavokāre anissāyavā catuvokāreti adhippāyo. Kusalānica akusalānica kriyānica anuttarānicāti viggaho. Tattha kusalānīti pañcarūpa kusalato avasesāni dvādasalokiyakusalāni. Akusalānīti paṭighadvayato avasesāni dasaakusalāni. Kriyānīti pañcadvārāvajjana hasana pañcarūpakrito avasesāni terasakriyacittāni. Anuttarānīti pathamamaggato avasesāni sattaanuttaracittāni. Kāme chavatthuṃ nissitā sattadhātuyo matā. Rūpe tivatthuṃ nissitā catubbidhā dhātuyo matā. Āruppe kiñcivatthuṃ anissitā ekā dhātu matāti yojanā. Tecattālīsāti pañcaviññāṇa manodhātuttikehi saddhiṃ santīraṇādike tiṃsadhamme sandhāya vuttanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti paramatthadīpaniyānāma abhidhammatthasaṅgahassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catutthavaṇṇanāya pakiṇṇakasaṅgahassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paramatthadīpanā niṭṭhitā."
  }
]