[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Pathamagāthā-paramatthadīpanī"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Abhidhammatthasaṅgahaṃ kattukāmo anuruddhatthero saṅgahārabbhe tāva sappayojane pañcapiṇḍatthe dassento ādigātha māha. Pañcapiṇḍatthānāma ratanattayavandanā, ganthābhidheyyo, ganthappakāro, ganthābhidhānaṃ, ganthappayojanaṃ. Tattha tīsu ratanesu nippaccakārakaraṇaṃ ratanattayavandanānāma. Sā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammāsambuddhamatulaṃ sasaddhammagaṇuttamaṃ abhivādiyā"
      },
      "ti etehi padehi dassitā. Sakalena ganthena abhihitā padhānatthabhūtā cattāro abhidhammatthā ganthābhidheyyo. So abhidhammatthasaṅgahantipade ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhidhammattha"
      },
      " saddena dassito."
    ],
    "innerText": "1. Abhidhammatthasaṅgahaṃ kattukāmo anuruddhatthero saṅgahārabbhe tāva sappayojane pañcapiṇḍatthe dassento ādigātha māha. Pañcapiṇḍatthānāma ratanattayavandanā, ganthābhidheyyo, ganthappakāro, ganthābhidhānaṃ, ganthappayojanaṃ. Tattha tīsu ratanesu nippaccakārakaraṇaṃ ratanattayavandanānāma. Sā sammāsambuddhamatulaṃ sasaddhammagaṇuttamaṃ abhivādiyāti etehi padehi dassitā. Sakalena ganthena abhihitā padhānatthabhūtā cattāro abhidhammatthā ganthābhidheyyo. So abhidhammatthasaṅgahantipade abhidhammattha saddena dassito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[1] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[1] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Saṅgahitabhāvopi abhidheyyoyevāti katvā abhidheyyo abhidhammatthasaṅgahapadena dassitotivuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na hi so appadhānatthabhūto saṅgahitabhāvo imasmiṃ piṇḍatthadassane abhidheyyo nāma bhavituṃ yuttoti. Ito paṭṭhāyaca ṭīkāyanti vutte imassa saṅgahassa dvīsu sīhaḷaṭīkāsu pathamāṭīkā daṭṭhabbā. Vibhāvaniyanti vutte etarahi pākaṭā dutīyā. Ṭīkāsūti vutte dvepi. Mahāṭīkāyanti vutte visuddhimagge mahāṭīkā daṭṭhabbā. Yañca vacanaṃ vibhāvaniyaṃpi āgataṃ, aññatthāpi āgataṃ, taṃpi idha vibhāvaniyaṃtveva vuccati āsannattāti. Sabhāgadhammasaṅgahavasena ganthavidhānākāro ganthappakāro. So pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅgaha"
      },
      " saddena dassito."
    ],
    "innerText": "Na hi so appadhānatthabhūto saṅgahitabhāvo imasmiṃ piṇḍatthadassane abhidheyyo nāma bhavituṃ yuttoti. Ito paṭṭhāyaca ṭīkāyanti vutte imassa saṅgahassa dvīsu sīhaḷaṭīkāsu pathamāṭīkā daṭṭhabbā. Vibhāvaniyanti vutte etarahi pākaṭā dutīyā. Ṭīkāsūti vutte dvepi. Mahāṭīkāyanti vutte visuddhimagge mahāṭīkā daṭṭhabbā. Yañca vacanaṃ vibhāvaniyaṃpi āgataṃ, aññatthāpi āgataṃ, taṃpi idha vibhāvaniyaṃtveva vuccati āsannattāti. Sabhāgadhammasaṅgahavasena ganthavidhānākāro ganthappakāro. So pana saṅgaha saddena dassito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[2] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[2] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "Abhidhammatthasaṅgahapadenāti ",
      " vuttaṃ. Taṃ na sundaraṃ."
    ],
    "innerText": "Abhidhammatthasaṅgahapadenāti vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na hi abhidhammatthasaddo ganthavidhānākāraṃ dīpetīti. Atthā nugatā ganthasamaññā vanthābhidhānaṃ. Taṃ abhidhammattha saṅgahapadena dassitaṃ. Saṅgahaganthe kate sati taduggahaparipucchādivasena anāyāsato laddhabbaṃ dhammānaṃ sarūpāvabodhādikaṃ anupādāparinibbānantaṃ ganthassa phalānuphalaṃ ganthappayojanaṃ taṃpi abhidhammatthasaṅgahapadeneva sāmatthiyato dassitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[3] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[3] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Saṅgahasaddenāti vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na hi abhidhammatthasaddena vinā anāyāsato saṃsiddhimattadīpakena saṅgahasaddamattena tādiso anupādāparinibbānanto payo janaviseso sakkā viññātuṃ, asaddhamma saṅgahānaṃpi loke sandissanatoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Tattha ratanattayavandanā tāva asaṅkheyyaappameyyappayojanā hoti. Yathāha –"
    ],
    "innerText": "2. Tattha ratanattayavandanā tāva asaṅkheyyaappameyyappayojanā hoti. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Te tādise pūjayato, nibbute akuto bhaye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na sakkā puññaṃ saṅkhātuṃ, yamettha mapi kenacīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ya metthamapītiettha yenakenaci api manussenavā devenavā brahmunāvā saṅkhātuṃ na sakkāti yojanā. Ṭīkākārāpi taṃ payojanaṃ tattha tattha bahudhā papañcenti. Saṅgahakārā pana antarāyanīvāraṇameva visesato paccāsīsanti. Saṅgahakārā tica buddhaghosattherādayo aṭṭhakathācariyā vuccanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nippaccakārassetassa,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Katassa ratanattaye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Ānubhāvena sosetvā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Antarāye asesatoti hi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Kathañca ",
      " ratanattayavandanāya antarāyanīvāraṇaṃ hotīti. Vuccate-ratanattayavandanā hi nāma vandanākiriyābhinipphādako sattakkhattuṃ sattakkhattuṃ anekakoṭisatasahassavāre pavattamāno mahanto puññābhisando puññappavāho. So ca anuttaresu buddhādīsu puññakkhettesu saṃvaḍḍhitattā therassa ca uḷāracchandasaddhābuddhiguṇehi paribhāvitattā mahājutiko mahapphalo mahānisaṃso ca puññātisayo hoti. So sayaṃ payogasampattibhāve ṭhatvā bahiddhā vipattipaccaye apanetvā sampattipaccaye upanetvā atipaṇītautucittāhāra samuṭṭhitānaṃ sarīraṭṭhakadhātūnaṃ upabrūhanaṃ katvā paṭisandhito paṭṭhāya laddho kāsassa janakakammassa anubalaṃ deti. Aladdhokāsassa ca puññantarassa okāsalābhaṃ karoti. Atha laddhānubalena laddho kāsena ca tadubhayena puññena nibbattā rūpārūpasantatiyo therasantāne yamakamahānadiyo viya balavabalavanti yo hutvā pavattanti. Tadā tasmiṃ iṭṭhaphalaghanaparipūrite therasantāne aniṭṭhaphalabhūtānaṃ rogādi antarāyānaṃ uppattiyā okāso nāma natthīti iṭṭhaphalasantānavibādhakāni aniṭṭhaphalasantānajanakāni ca apuññakammāni dūrato apanītāneva honti. Na hi kammānināma puññāni apuññāni ca attano vipākuppattiyā okāse asati vipaccantīti. Tato tasmiṃ santāne āyuvaṇṇā dayo iṭṭhaphaladhammā yāva ganthaniṭṭhānā yāva āyukappapariyo sānāpi vā vaḍḍhanapakkhe ṭhatvā pavattanti. Yathāha –"
    ],
    "innerText": "3. Kathañca ratanattayavandanāya antarāyanīvāraṇaṃ hotīti. Vuccate-ratanattayavandanā hi nāma vandanākiriyābhinipphādako sattakkhattuṃ sattakkhattuṃ anekakoṭisatasahassavāre pavattamāno mahanto puññābhisando puññappavāho. So ca anuttaresu buddhādīsu puññakkhettesu saṃvaḍḍhitattā therassa ca uḷāracchandasaddhābuddhiguṇehi paribhāvitattā mahājutiko mahapphalo mahānisaṃso ca puññātisayo hoti. So sayaṃ payogasampattibhāve ṭhatvā bahiddhā vipattipaccaye apanetvā sampattipaccaye upanetvā atipaṇītautucittāhāra samuṭṭhitānaṃ sarīraṭṭhakadhātūnaṃ upabrūhanaṃ katvā paṭisandhito paṭṭhāya laddho kāsassa janakakammassa anubalaṃ deti. Aladdhokāsassa ca puññantarassa okāsalābhaṃ karoti. Atha laddhānubalena laddho kāsena ca tadubhayena puññena nibbattā rūpārūpasantatiyo therasantāne yamakamahānadiyo viya balavabalavanti yo hutvā pavattanti. Tadā tasmiṃ iṭṭhaphalaghanaparipūrite therasantāne aniṭṭhaphalabhūtānaṃ rogādi antarāyānaṃ uppattiyā okāso nāma natthīti iṭṭhaphalasantānavibādhakāni aniṭṭhaphalasantānajanakāni ca apuññakammāni dūrato apanītāneva honti. Na hi kammānināma puññāni apuññāni ca attano vipākuppattiyā okāse asati vipaccantīti. Tato tasmiṃ santāne āyuvaṇṇā dayo iṭṭhaphaladhammā yāva ganthaniṭṭhānā yāva āyukappapariyo sānāpi vā vaḍḍhanapakkhe ṭhatvā pavattanti. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Abhi vādanasīlissa, niccaṃ vuḍḍhāpacāyino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cattāro dhammā vaḍḍhanti, āyuvaṇṇo sukhaṃ balanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ tāya vandanāya antarāyanīvāraṇaṃ hotīti. Tasmā saṅgahārabbhe ratanattayavandanākaraṇaṃ therassa attanā ārabbha mānasaṅgahassa anantarāyena parisamāpanutthaṃ. Na kevalañca therasseva, sotūnañca saṅgahaṃ gaṇhantānaṃ ādimhiyeva ratanattaya vandanā siddhito anantarāyena gahaṇa kiccasampajjanatthanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[4] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[4] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "Sattasu ",
      " javanesu pathamajavana vaseneva vandanā payojanaṃ vibhāvitaṃ viya dissati. ‘‘Diṭṭhadhammavedanīyabhūtā’’ti hi tattha vuttaṃ. Taṃ na sundaraṃ."
    ],
    "innerText": "Sattasu javanesu pathamajavana vaseneva vandanā payojanaṃ vibhāvitaṃ viya dissati. ‘‘Diṭṭhadhammavedanīyabhūtā’’ti hi tattha vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Upatthambhanakiccasseva idha adhippetattā. Tassa ca sattasupi javanesu upaladdhattāti. Yathā hi āhārarūpassa dvīsu kiccesu ojaṭṭhamakarūpajananakiccaṃ parittakaṃ appamattakaṃ hoti. Catussanta tirūpupatthambhanakiccameva mahantaṃ adhimattaṃ. Tathāhi paṭṭhānepi tadupatthambhanakiccameva gahetvā kabaḷīkāro āhāro imassa kāyassa āhārapaccayena paccayoti vibhaṅgavāro vibhatto. Evamevaṃ idhapi pathamajavanassa avunāva vipākajananakiccaṃ parittakaṃ appamattakaṃ hoti. Ahetukavipākamattaṃ janetīti aṭṭhakathāsu vuttaṃ. Kammantarupatthambhanakiccameva mahantaṃ adhimattaṃ. Tañca sattasupi javanesu upalabbhati yevāti. Yasmā pana ganthābhidheyye ganthappakāre ganthappayojane ca ādito vivitesati sotu janānaṃ ganthassavane ussāho jāyati. Tasmā tesaṃ ganthā bhidheyyādīnaṃ dassanaṃ ganthe ussāhajananatthaṃ. Ganthābhidhānadassanaṃ vohārasukhatthanti. Idamettha piṇḍatthadassanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Ayaṃ pana padattho. Sammāca bujjhi sāmañca bujjhīti sammā sambuddho. Ettha ca sammāsaddo aviparītatthe nipāto. So bujjhitabbesu ñeyyadhammesu bujjhanakriyāya asesabyāvibhāvaṃ dīpeti. Tathāhi padesañāṇe ṭhitā paccekabuddhādayo attano visaye eva aviparītaṃ bujjhanti. Avisaye pana andhakāre paviṭṭhāviya hontīti aṭṭhakathāyaṃ vuttaṃ. Visayo ca tesaṃ appamattakova sabbaññuvisayaṃ upādāya yathā hattha puṭe ākāso appamattakova ajaṭākāsaṃ upādāyāti. Te hi phassādīsu dhammesu ekadhammampi sabbākārato bujjhituṃ nasakkontīti. Sabbaññubuddhānaṃ pana avisayo nāma natthi, yattha te viparītaṃ bujjheyyuṃ. Te hi anamatagge saṃsāre anantāsu ca ",
      " lokadhātūsu tiyaddhagate addhamuttake ca dhamme hatthamaṇike viya samasame katvā bujjhanti. Sabbe dhammā sabbākārena buddhassa bhagavato ñāṇamukhe āpāta māgacchantīti hi vuttaṃ. Tattha ñāṇamukheti sabbaññuṃmahābhavaṅgaṃ sandhāyāha. Tattha hi te dhammā bodhimaṇḍe sabbaṃ abhidhammaṃ sammasanato paṭṭhāya niccakālaṃ upaṭṭhahantīti. Sabbaññubuddhā pana yattake dhamme vicāretuṃ icchanti. Tattake dhamme āvajjanāya visuṃ katvā āvajjitvā vicārentīti. Nanu dhammā mahantā bhavaṅgaṃ parittakanti na codetabbametaṃ. Arūpadhammānañhi paramukkaṃsapattānaṃ esa ānubhāvoti. Saṃsaddo pana sāmanti etassa atthe upasaggo. So bhagavato paṭivedhadhammesu anācariyakataṃ dīpeti. Na me ācariyo atthīti hi vuttaṃ. Nanu bhagavato tatīyacatutthāruppa samāpattiyo āḷārudakamūlikāti. Saccaṃ. Tā pana analaṅkaritvā laddhamattāva hutvā chaḍḍitattā pacchā bujjhanakriyāya pādakamattāpi nahonti. Kuto paṭivedhadhammāti. Tasmā tā bhagavato buddhabhāve sācariyakataṃ na sādhentīti. Ayamettha pāḷi anugato attho. Yathāha –"
    ],
    "innerText": "4. Ayaṃ pana padattho. Sammāca bujjhi sāmañca bujjhīti sammā sambuddho. Ettha ca sammāsaddo aviparītatthe nipāto. So bujjhitabbesu ñeyyadhammesu bujjhanakriyāya asesabyāvibhāvaṃ dīpeti. Tathāhi padesañāṇe ṭhitā paccekabuddhādayo attano visaye eva aviparītaṃ bujjhanti. Avisaye pana andhakāre paviṭṭhāviya hontīti aṭṭhakathāyaṃ vuttaṃ. Visayo ca tesaṃ appamattakova sabbaññuvisayaṃ upādāya yathā hattha puṭe ākāso appamattakova ajaṭākāsaṃ upādāyāti. Te hi phassādīsu dhammesu ekadhammampi sabbākārato bujjhituṃ nasakkontīti. Sabbaññubuddhānaṃ pana avisayo nāma natthi, yattha te viparītaṃ bujjheyyuṃ. Te hi anamatagge saṃsāre anantāsu ca lokadhātūsu tiyaddhagate addhamuttake ca dhamme hatthamaṇike viya samasame katvā bujjhanti. Sabbe dhammā sabbākārena buddhassa bhagavato ñāṇamukhe āpāta māgacchantīti hi vuttaṃ. Tattha ñāṇamukheti sabbaññuṃmahābhavaṅgaṃ sandhāyāha. Tattha hi te dhammā bodhimaṇḍe sabbaṃ abhidhammaṃ sammasanato paṭṭhāya niccakālaṃ upaṭṭhahantīti. Sabbaññubuddhā pana yattake dhamme vicāretuṃ icchanti. Tattake dhamme āvajjanāya visuṃ katvā āvajjitvā vicārentīti. Nanu dhammā mahantā bhavaṅgaṃ parittakanti na codetabbametaṃ. Arūpadhammānañhi paramukkaṃsapattānaṃ esa ānubhāvoti. Saṃsaddo pana sāmanti etassa atthe upasaggo. So bhagavato paṭivedhadhammesu anācariyakataṃ dīpeti. Na me ācariyo atthīti hi vuttaṃ. Nanu bhagavato tatīyacatutthāruppa samāpattiyo āḷārudakamūlikāti. Saccaṃ. Tā pana analaṅkaritvā laddhamattāva hutvā chaḍḍitattā pacchā bujjhanakriyāya pādakamattāpi nahonti. Kuto paṭivedhadhammāti. Tasmā tā bhagavato buddhabhāve sācariyakataṃ na sādhentīti. Ayamettha pāḷi anugato attho. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Tattha katamo ca puggalo sammāsambuddho. Idhekacco puggalo pubbe ananussutesu dhammesu sāmaṃ saccāni abhisambujjhi. Tattha ca sabbaññutaṃ pāpuṇāti. Balesu ca vasibhāvaṃ. Ayaṃ vuccati puggalo sammāsambuddhoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatthāti nimitte bhummaṃ. Balesūti dasabala ñāṇesu. Vasibhāvanti issarabhāvaṃ. Etthaca pubbe. La. Sāmantietena saṃsaddassa atthaṃ dasseti. Tatthātiādinā [sammāsaddassaatthanti. Sammāsambuddhapadaṃ]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". Idāni thero attano vandanaṃ suṭṭhubalavaṃ karonto atulanti āha. Anekaguṇapadavisayā hi vandanā suṭṭhutaraṃ balavatī hotīti. Nanu ekaguṇapadavisayāpi vandanā antarā yanīvāraṇesamatthā siyāti kiṃ dutīyenāti. Na na samatthā. Viññujātikā pana satthuguṇatthomane mattakārino nāma na honti ",
      ". Thero ca tesaṃ aññataro. Tvaṃ pana aviññujātiko. Tasmā mattaṃ karonto codesīti. Apica. Na kevalaṃ antarā yanīvāraṇameva vandanāya icchitabbaṃ hoti. Athakho paññāpāṭavādiatthopi icchitabboyeva. Sopi hi anāyāsena gantha niṭṭhānassa ganthapārisuddhiyā ca paccayo hotīti. Anussatiṭṭhānesu hi cittabhāvanā cittasamādhānāvahā hoti. Citta samādhāne ca sati paññātikkhāsūrā hutvā pahati. Samāhito bhikkhave yathābhūtaṃ pajānātīti hi vuttaṃ. Tasmā tadatthāyapi attano vandanā suṭṭhu balavatī kātabbāyevāti."
    ],
    "innerText": "5. Idāni thero attano vandanaṃ suṭṭhubalavaṃ karonto atulanti āha. Anekaguṇapadavisayā hi vandanā suṭṭhutaraṃ balavatī hotīti. Nanu ekaguṇapadavisayāpi vandanā antarā yanīvāraṇesamatthā siyāti kiṃ dutīyenāti. Na na samatthā. Viññujātikā pana satthuguṇatthomane mattakārino nāma na honti . Thero ca tesaṃ aññataro. Tvaṃ pana aviññujātiko. Tasmā mattaṃ karonto codesīti. Apica. Na kevalaṃ antarā yanīvāraṇameva vandanāya icchitabbaṃ hoti. Athakho paññāpāṭavādiatthopi icchitabboyeva. Sopi hi anāyāsena gantha niṭṭhānassa ganthapārisuddhiyā ca paccayo hotīti. Anussatiṭṭhānesu hi cittabhāvanā cittasamādhānāvahā hoti. Citta samādhāne ca sati paññātikkhāsūrā hutvā pahati. Samāhito bhikkhave yathābhūtaṃ pajānātīti hi vuttaṃ. Tasmā tadatthāyapi attano vandanā suṭṭhu balavatī kātabbāyevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[5] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[5] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Yathāvuttavacanattha yogepi sammāsambuddhasaddassa bhagavati samaññāvasena pavattattā atulanti iminā vise setī’’ti vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Mahantañhi satthuguṇapadānaṃ majjhe etaṃ sammāsambuddhapadaṃ, cando viya tārakānaṃ majjhe. Tasmā taṃ sabhāvaniruttiṃ jānantānaṃsantike bhāvatthasuññaṃ satthusamaññāmattaṃ bhavituṃ nārahati. Aññesaṃ pana padasahassaṃ vuccamānaṃpi satthu samaññāmattameva sampajjatīti. Tulayitabbo aññena saha pamitabboti tulo. Na tulo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atulo,"
      },
      " natthitulo sadiso etassāti vā atulo. Bhagavā. Na hi atthi bhagavato attanā sadiso koci lokasminti. Yathāha –"
    ],
    "innerText": "Mahantañhi satthuguṇapadānaṃ majjhe etaṃ sammāsambuddhapadaṃ, cando viya tārakānaṃ majjhe. Tasmā taṃ sabhāvaniruttiṃ jānantānaṃsantike bhāvatthasuññaṃ satthusamaññāmattaṃ bhavituṃ nārahati. Aññesaṃ pana padasahassaṃ vuccamānaṃpi satthu samaññāmattameva sampajjatīti. Tulayitabbo aññena saha pamitabboti tulo. Na tulo atulo, natthitulo sadiso etassāti vā atulo. Bhagavā. Na hi atthi bhagavato attanā sadiso koci lokasminti. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Na me ācariyo atthi, sadiso me na vijjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sadevakasmiṃ lokasmiṃ, natthi me paṭipuggaloti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anacchariyañcetaṃ, yaṃ buddhabhūtassa atulattaṃ. Sampatijātassapi panassa atulatā paññāyati. Tadā hi mahāpuriso sampatijātova samāno puratthimadisābhimukho aṭṭhāsi. Tasmiṃ disā bhāge anantāni cakkavāḷāni ekaṅgaṇāni ahesuṃ. Tesu ṭhitā devabrahmāno mahāpurisa idha tumhehi sadiso natthi. Kuto uttaritaroti ",
      " paramāya pujāya pūjesuṃ. Evaṃ sesadisāsupi. Tadā mahāpuriso attano sabbalokaggabhāvaṃ ñatvā aggohamasmi lokassa, seṭṭhohamasmilokassa, jeṭṭhohamasmilokassa ayamanti mājāti, natthi dāni punabbhavoti evaṃ achambhivācaṃ nicchāresīti. Idaṃpi anacchariyaṃ, yaṃ pacchimabhavaṃ pattassa atulattaṃ. Yadā pana so sumedhabhūto dīpaṅkarabuddhassa santike niyatabyākaraṇaṃ gaṇhi. Tadāpi thapetvā dīpaṅkarasammāsambuddhaṃ pāramitāguṇehi tena sadiso koci nattheva. Natthibhāvocassa tadā pavatte hi dasasahassilokadhātukampanādīhi asādhāraṇapāṭihāriyehi dīpetabbo. Tāni hi paccekabodhisattānaṃ satasahassaṃpi pavattetuṃ na sakkhissatiyeva. Kuto sāvakabodhi sattānanti. Teneva hi tadā pavattipāramipavicayaññāṇaṃ attano visaye sabbaññuthaññāṇagatikanti aṭṭhakathāyaṃ vuttaṃ. Sāvakabodhisattāpi hi yato paṭṭhāya attano bodhiyā anurūpe sambhāradhamme sayameva jānituṃ sakkonti. Tato paṭṭhāya anivattidhammā hutvā vattānusārimahāputhujjanabhāvaṃ atikkamitvā bodhisattabhūmiṃ okkantā honti. Ekena pariyāyena niyatā sambodhiparāyanā ca nāma honti. Tadā eva buddhānaṃ sammukhibhāve sati niyatabyākaraṇaṃ labhanti. Sabbaññu bodhisatta paccekabodhisattesu vattabbameva natthīti."
    ],
    "innerText": "Anacchariyañcetaṃ, yaṃ buddhabhūtassa atulattaṃ. Sampatijātassapi panassa atulatā paññāyati. Tadā hi mahāpuriso sampatijātova samāno puratthimadisābhimukho aṭṭhāsi. Tasmiṃ disā bhāge anantāni cakkavāḷāni ekaṅgaṇāni ahesuṃ. Tesu ṭhitā devabrahmāno mahāpurisa idha tumhehi sadiso natthi. Kuto uttaritaroti paramāya pujāya pūjesuṃ. Evaṃ sesadisāsupi. Tadā mahāpuriso attano sabbalokaggabhāvaṃ ñatvā aggohamasmi lokassa, seṭṭhohamasmilokassa, jeṭṭhohamasmilokassa ayamanti mājāti, natthi dāni punabbhavoti evaṃ achambhivācaṃ nicchāresīti. Idaṃpi anacchariyaṃ, yaṃ pacchimabhavaṃ pattassa atulattaṃ. Yadā pana so sumedhabhūto dīpaṅkarabuddhassa santike niyatabyākaraṇaṃ gaṇhi. Tadāpi thapetvā dīpaṅkarasammāsambuddhaṃ pāramitāguṇehi tena sadiso koci nattheva. Natthibhāvocassa tadā pavatte hi dasasahassilokadhātukampanādīhi asādhāraṇapāṭihāriyehi dīpetabbo. Tāni hi paccekabodhisattānaṃ satasahassaṃpi pavattetuṃ na sakkhissatiyeva. Kuto sāvakabodhi sattānanti. Teneva hi tadā pavattipāramipavicayaññāṇaṃ attano visaye sabbaññuthaññāṇagatikanti aṭṭhakathāyaṃ vuttaṃ. Sāvakabodhisattāpi hi yato paṭṭhāya attano bodhiyā anurūpe sambhāradhamme sayameva jānituṃ sakkonti. Tato paṭṭhāya anivattidhammā hutvā vattānusārimahāputhujjanabhāvaṃ atikkamitvā bodhisattabhūmiṃ okkantā honti. Ekena pariyāyena niyatā sambodhiparāyanā ca nāma honti. Tadā eva buddhānaṃ sammukhibhāve sati niyatabyākaraṇaṃ labhanti. Sabbaññu bodhisatta paccekabodhisattesu vattabbameva natthīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[6] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[6] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Samitatthe yyakārassa akārassa vā vasena etaṃ siddhanti vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na hi tulasaddo dhātusiddho kammasādhano ca bhavituṃ na yutto. Tulayituṃ asakkuṇeyyoti atulo. Appame yyoti hi ṭīkāyaṃ vuttaṃ. Etena tulasaddo kammasādhanoti dipeti. Evañca sati kammasādhaneneva tadatthasiddhito kiṃ tato samitatthe yyakārassaakārassa vā cintāyāti. Vatticchānugato saddappayogoti katvā etaṃ vuttanti ce. Na. Yathā ",
      " sutaṃ yuttaṃ vajjetvā assutassa parikappanāya payo janābhāvatoti. [Atula padaṃ]"
    ],
    "innerText": "Na hi tulasaddo dhātusiddho kammasādhano ca bhavituṃ na yutto. Tulayituṃ asakkuṇeyyoti atulo. Appame yyoti hi ṭīkāyaṃ vuttaṃ. Etena tulasaddo kammasādhanoti dipeti. Evañca sati kammasādhaneneva tadatthasiddhito kiṃ tato samitatthe yyakārassaakārassa vā cintāyāti. Vatticchānugato saddappayogoti katvā etaṃ vuttanti ce. Na. Yathā sutaṃ yuttaṃ vajjetvā assutassa parikappanāya payo janābhāvatoti. [Atula padaṃ]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". Imehi pana dvīhi padehi satthu tisso sampadā vibhā vitā honti. Hetusampadā phalasampadā sattupakārasampadācāti. Tattha satthu mahākaruṇā samaṅgitā bodhisambhārasambharaṇañca hetusampadānāma. Bodhimaṇḍe pavattitā catuvīsati koṭisabhasahassasaṅkhā mahāvajiraññāṇasaṅkhātā sabbaññumahā vipassanāpi ettheva saṅgahitā. Sā hi mahābodhiyā padaṭṭhāna bhūtāti. Pahāna sampadāyameva vā sā saṅgahitāti daṭṭhabbā. Phalasampadā catubbidhā pahānasampadā ñāṇasampadā ānubhāvasampadā rūpakāyasampadā cāti. Tattha saha vāsanāya kilesappahānaṃ pahānasampadā nāma. Pahānassa sabbapāripūritāti attho. Atthato pana ariyamaggo, aggamaggaññāṇameva vā. Sabbaññuta ññāṇa dasabalaññāṇādīni ñāṇasampadā."
    ],
    "innerText": "6. Imehi pana dvīhi padehi satthu tisso sampadā vibhā vitā honti. Hetusampadā phalasampadā sattupakārasampadācāti. Tattha satthu mahākaruṇā samaṅgitā bodhisambhārasambharaṇañca hetusampadānāma. Bodhimaṇḍe pavattitā catuvīsati koṭisabhasahassasaṅkhā mahāvajiraññāṇasaṅkhātā sabbaññumahā vipassanāpi ettheva saṅgahitā. Sā hi mahābodhiyā padaṭṭhāna bhūtāti. Pahāna sampadāyameva vā sā saṅgahitāti daṭṭhabbā. Phalasampadā catubbidhā pahānasampadā ñāṇasampadā ānubhāvasampadā rūpakāyasampadā cāti. Tattha saha vāsanāya kilesappahānaṃ pahānasampadā nāma. Pahānassa sabbapāripūritāti attho. Atthato pana ariyamaggo, aggamaggaññāṇameva vā. Sabbaññuta ññāṇa dasabalaññāṇādīni ñāṇasampadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[7] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[7] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Etāsu dvīsu sampadāsu ñāṇasampadā pathamaṃ vuttā, tato pahānasampadā. Pahānasampadāyeva pana pathamaṃ vattabbā. Sā hi ñāṇasampadāyapubbaṅgamabhūtā paccayabhūtā ca. Mahāṭīkāyañca sāyeva pathamaṃ vuttāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[8]"
      },
      " Yañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[8] Yañca vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Sabbaññutaññāṇapadaṭṭhānaṃ aggamaggaññāṇa’’nti ñāṇasampadāyaṃ vuttaṃ. Taṃpi na yujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Aggamaggaññāṇañhi pahānasampadā eva bhavituṃ arahati. Na hi maggaññāṇato aññā pahānasampadānāma atthīti. Yañca koci vadeyya maggaññāṇaṃ ñāṇañca hoti pahānañca. Tasmā ubhayattha vattuṃ yuttanti. Taṃpi na yujjati. Evañhi sati sampadāsaṅkaro hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[9]"
      },
      " Tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[9] Tathā vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "Ñāṇasampadāyaṃ ",
      " sabbaññutaññāṇaṃ sabbapathamaṃ vattabbaṃpi na vuttaṃ. Taṃpi na sundaraṃ."
    ],
    "innerText": "Ñāṇasampadāyaṃ sabbaññutaññāṇaṃ sabbapathamaṃ vattabbaṃpi na vuttaṃ. Taṃpi na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Nanu ‘‘tammūlakāni ca dasabalādi ññāṇānī’’ti ettha ādisaddena sabbaññutaññāṇaṃpi gahitanti ce. Taṃpi na yujjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na hi appadhānaṃ sarūpato niddisitvā padhānaṃ pākaṭaṃ ādisaddena gahitanti ñāyāgataṃ hotīti. Acinteyyānubhāvehi sīlā diguṇehi iddhi dhammehi ca sampadā ānubhāvasampadā. Lakkhaṇā nubyañjanappaṭimaṇḍitassa rūpakāyassa sampatti rūpakāyasampadā. Sattupakāroduvidho āsayasampadā, payogasampadā ca. Ajjhāsayassa uḷāratā kāyavacīpayogassa ca parisuddhatāti attho. Tattha devadattādīsu virodhisattesupi niccaṃ hitajjhāsayatā āsaya sampadā. Loke abhiññātānaṃ rājūnaṃ rājamahāmattānaṃ seṭṭhi gahapatīnaṃ devarājūnampi dhammaṃ desentassa lābhasakkārādi nirapekkhatāvasena desanāpayogasuddhi payogasampadā. Tattha dve pahānañāṇasampadā sammāsambuddhapadena vibhāvitā. Dvīhi ānu bhāvarūpakāyasampadāhi saha dve sattupakārasampadā atulapadena. Hetusampadā pana dvīhipi padehi sāmatthiyato vibhāvitā. Na hi tādisiyā hetusampadāya vinā itarāsaṃ pavatti atthīti. [Sampadā]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". Punapi thero attano vandanaṃ balavataraṃ karonto sasaddhammagaṇuttamanti āha. Etena dhammasaṅghānaṃpi vandanā katā hoti. Dūratohaṃ namassissaṃ, sasaṅghaṃ lokanāyakanti hi vutte saṅghassapi namanakriyāpatti sahasaddena viññāyati. Eva midaṃ daṭṭhabbaṃ. Tattha namassissanti namassiṃ."
    ],
    "innerText": "7. Punapi thero attano vandanaṃ balavataraṃ karonto sasaddhammagaṇuttamanti āha. Etena dhammasaṅghānaṃpi vandanā katā hoti. Dūratohaṃ namassissaṃ, sasaṅghaṃ lokanāyakanti hi vutte saṅghassapi namanakriyāpatti sahasaddena viññāyati. Eva midaṃ daṭṭhabbaṃ. Tattha namassissanti namassiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[10]"
      },
      " Yampana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhāvaniyaṃ"
      }
    ],
    "innerText": "[10] Yampana vibhāvaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Guṇībhūtānaṃpi hi dhammasaṅghānaṃ abhivādetabba bhāvo sahayogena viññāyatī’’ti vuttaṃ. Tattha abhivādetabba bhāvoti navattabbaṃ. Abhivāditabhāvoti pana abhivādananti ",
      " vā vattabbaṃ. Evañhi sati idha adhippetassa kriyā samavāyassa siddhattā dhammasaṅghānaṃpi therassa vandanā kriyāpatti siddhā hotīti. Itarathā tabbapaccayassa arahatthadīpanato abhivādanā rahatā saṅkhāta guṇasamavāyo vutto siyā. Soca idha nādhippeto. Attano nidassanena ca saha na sameti saputtadāro āgatoti."
    ],
    "innerText": "‘‘Guṇībhūtānaṃpi hi dhammasaṅghānaṃ abhivādetabba bhāvo sahayogena viññāyatī’’ti vuttaṃ. Tattha abhivādetabba bhāvoti navattabbaṃ. Abhivāditabhāvoti pana abhivādananti vā vattabbaṃ. Evañhi sati idha adhippetassa kriyā samavāyassa siddhattā dhammasaṅghānaṃpi therassa vandanā kriyāpatti siddhā hotīti. Itarathā tabbapaccayassa arahatthadīpanato abhivādanā rahatā saṅkhāta guṇasamavāyo vutto siyā. Soca idha nādhippeto. Attano nidassanena ca saha na sameti saputtadāro āgatoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Apica thero imaṃ ganthaṃ racayissāmīti pubbabhāgeyeva tīṇi ratanāni vandi, atha taṃ attano vandanaṃ ganthappaṭiññāya saha ghaṭetvā dassento imaṃ gāthaṃ racayītipi na na sakkā vattunti. Tathāhi abhivādiyāti vuttaṃ. Na abhivādiyāmīti. Esanayo aññatthapi. Tattha saddhammena ca gaṇuttamena ca attanā nimmitena sakalalokassa saraṇabhūtena saha vattatīti sasaddhamma gaṇuttamo. Sammāsambuddho. Na hi paranimmitena saddhammena gaṇuttamena ca sahitā sāvakā sasaddhammāti ca sagaṇuttamāti ca vuccanti. Na ca attanoeva saraṇabhūtena saddhammena sabrahmacārigaṇuttamena ca sahitā paccekabuddhā tathā thomanaṃ arahantīti, tasmā idaṃpi satthu asādhāraṇaguṇapadameva hotīti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha dhāretīti dhammo. Ke dhāreti, attānaṃ dhārente. Dhammo have rakkhati dhammacārinti hi vuttaṃ. Kathañca dhāreti, catūsu apāyesu vaṭṭadukkhesuca apatamāne karonto. Kiñca dhāraṇaṃnāma, yesaṃ vasena sattā apāyesuvā vaṭṭadukkhesuvā patanti, tesaṃ kilesānaṃ ekadesenavā sabbasovā samucchindanaṃ. Imasmiṃ atthe cattāro ariyamaggā nibbānañca nippariyāyato dhammonāma. Ariyamaggā hi kilese samucchindantā nibbānena saheva hutvā samucchindanti. Na vināti, tasmā teyeva pañca ekantato dhammonāmāti. Pariyattidhammo pana dhāraṇupāyoyeva hoti. Cattāri sāmaññaphalānica dhāraṇaphalāniyeva honti, kilesānaṃ paṭippassambhanavasena pavattattā dhāraṇānukūlappavattāni ca. Tasmā ete pañca pariyāyadhammāyevāti. Athavā ",
      ", dhārīyatīti dhammo. Dhāraṇārahoti vuttaṃ hoti. Yo hi dhārentaṃ ekantena dukkhato moceti. Aggasukheca patiṭṭhāpeti. Soyeva dhāraṇārahattā idha dhammonāmāti. Kopana soti, yathā puttadhammāyeva. Tehi keci bhāvanā vasena keci sacchikiriyavasena keci diṭṭhadhammasukhavihāravasena keci uggaha dhāraṇavasena dhārīyanti. Te ca evaṃ dhārīyamānā dhārentaṃ yathārahaṃ apāyadukkhato vaṭṭadukkhatoca mocenti, aggeca phalasukhevā nibbānasukhevā patiṭṭhāpentīti. Dhārentivā sappurisājanā apāyesu vaṭṭadukkhesuca attānaṃ apata mānaṃ vahanti etenāti dhammo. Dharantivā ettha dhammadīpā dhammappaṭisaraṇā janā laddhappatiṭṭhā hontīti dhammotipi yujjatiyeva. Kasmā panettha dhammo dasavidhova vutto. Nanu paṭipattidhammena saha ekādasavidhova vattabboti. Saccaṃ. Sopana paṭipattidhammo maggassa pubbabhāgappaṭipadāeva hotīti pubbacetanā viya dāne magge eva so saṅgahito. Tasmā dhammo dasavidhova sabbattha vuttoti daṭṭhabbo."
    ],
    "innerText": "Tattha dhāretīti dhammo. Ke dhāreti, attānaṃ dhārente. Dhammo have rakkhati dhammacārinti hi vuttaṃ. Kathañca dhāreti, catūsu apāyesu vaṭṭadukkhesuca apatamāne karonto. Kiñca dhāraṇaṃnāma, yesaṃ vasena sattā apāyesuvā vaṭṭadukkhesuvā patanti, tesaṃ kilesānaṃ ekadesenavā sabbasovā samucchindanaṃ. Imasmiṃ atthe cattāro ariyamaggā nibbānañca nippariyāyato dhammonāma. Ariyamaggā hi kilese samucchindantā nibbānena saheva hutvā samucchindanti. Na vināti, tasmā teyeva pañca ekantato dhammonāmāti. Pariyattidhammo pana dhāraṇupāyoyeva hoti. Cattāri sāmaññaphalānica dhāraṇaphalāniyeva honti, kilesānaṃ paṭippassambhanavasena pavattattā dhāraṇānukūlappavattāni ca. Tasmā ete pañca pariyāyadhammāyevāti. Athavā , dhārīyatīti dhammo. Dhāraṇārahoti vuttaṃ hoti. Yo hi dhārentaṃ ekantena dukkhato moceti. Aggasukheca patiṭṭhāpeti. Soyeva dhāraṇārahattā idha dhammonāmāti. Kopana soti, yathā puttadhammāyeva. Tehi keci bhāvanā vasena keci sacchikiriyavasena keci diṭṭhadhammasukhavihāravasena keci uggaha dhāraṇavasena dhārīyanti. Te ca evaṃ dhārīyamānā dhārentaṃ yathārahaṃ apāyadukkhato vaṭṭadukkhatoca mocenti, aggeca phalasukhevā nibbānasukhevā patiṭṭhāpentīti. Dhārentivā sappurisājanā apāyesu vaṭṭadukkhesuca attānaṃ apata mānaṃ vahanti etenāti dhammo. Dharantivā ettha dhammadīpā dhammappaṭisaraṇā janā laddhappatiṭṭhā hontīti dhammotipi yujjatiyeva. Kasmā panettha dhammo dasavidhova vutto. Nanu paṭipattidhammena saha ekādasavidhova vattabboti. Saccaṃ. Sopana paṭipattidhammo maggassa pubbabhāgappaṭipadāeva hotīti pubbacetanā viya dāne magge eva so saṅgahito. Tasmā dhammo dasavidhova sabbattha vuttoti daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica, yadaggena pariyattidhammo idha dhammasmiṃ saṅgahito. Tadaggena pariyattidhārakopi saṅghe vandaneyye saṅgahitoti yutto. Yadaggenaca puthujjanakalyāṇako saṅghe sekkhesu saṅgahito. Tadaggena tassa kalyāṇahetubhūto paṭipatti dhammopi dhamme vandaneyye saṅgahitoti daṭṭhabbo. So hi puthujjanabhūtopi yehi dhammehi samannāgatattā sekhe sotāpatti phalasacchikiriyāya paṭipanne saṅgahito. Te pana dhammā sekkhe sotāpattimagge asaṅgahitāti nasakkā vattunti. Ettāvatā ye vadanti saṅghaṃ saraṇaṃ gacchāmīti, ettha puthujjana kalyāṇako saṅghe asaṅgahito. Na hi taṃsaraṇaṃ gacchantassa saraṇagamanaṃ sampajjatīti. Tesaṃ taṃ paṭikkhittaṃ hoti. Evaṃ pana vattabbo, yo vo ānanda mayā dhammoca vinayoca desito paññatto, so vo mamaccayena satthāti evaṃ satthuṭhāne thapetvā bhagavatā saṃvaṇṇito pariyattidhammo dhammasaraṇe saṅgahitoti ",
      " yutto, taṃ dhārentopana kalyāṇappaṭipattiyaṃ ṭhitopi atthi. Aṭṭhitopi atthi. Yo aṭṭhito, so attanopi saraṇaṃ nahoti. Kuto parassa. Satthārā ca anekesu suttasahassesu so garahito. Tasmā so saṅghasaraṇe asaṅgahito. Itarova saṅgahitoti yuttoti."
    ],
    "innerText": "Apica, yadaggena pariyattidhammo idha dhammasmiṃ saṅgahito. Tadaggena pariyattidhārakopi saṅghe vandaneyye saṅgahitoti yutto. Yadaggenaca puthujjanakalyāṇako saṅghe sekkhesu saṅgahito. Tadaggena tassa kalyāṇahetubhūto paṭipatti dhammopi dhamme vandaneyye saṅgahitoti daṭṭhabbo. So hi puthujjanabhūtopi yehi dhammehi samannāgatattā sekhe sotāpatti phalasacchikiriyāya paṭipanne saṅgahito. Te pana dhammā sekkhe sotāpattimagge asaṅgahitāti nasakkā vattunti. Ettāvatā ye vadanti saṅghaṃ saraṇaṃ gacchāmīti, ettha puthujjana kalyāṇako saṅghe asaṅgahito. Na hi taṃsaraṇaṃ gacchantassa saraṇagamanaṃ sampajjatīti. Tesaṃ taṃ paṭikkhittaṃ hoti. Evaṃ pana vattabbo, yo vo ānanda mayā dhammoca vinayoca desito paññatto, so vo mamaccayena satthāti evaṃ satthuṭhāne thapetvā bhagavatā saṃvaṇṇito pariyattidhammo dhammasaraṇe saṅgahitoti yutto, taṃ dhārentopana kalyāṇappaṭipattiyaṃ ṭhitopi atthi. Aṭṭhitopi atthi. Yo aṭṭhito, so attanopi saraṇaṃ nahoti. Kuto parassa. Satthārā ca anekesu suttasahassesu so garahito. Tasmā so saṅghasaraṇe asaṅgahito. Itarova saṅgahitoti yuttoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Santānaṃ dhammoti saddhammo. Samitakilesānaṃ tatoyeva pasatthānaṃ pūjitānaṃ sappurisānaṃ paṇḍitānañca dhammoti attho. Yoca santānaṃ dhammo, sopi ekantena santoyeva hotīti santo dhammotipi saddhammo. Pasattho pūjito dhammoti attho. Sacco vā. Ayañhi aññatitthiyadhammo viya dhārentaṃ navisaṃvādeti. So hi ayaṃ me hitoti dhārentassa ahitoyeva sampajjati. Ayaṃ pana tathādhārentassa hitoyeva sampajjatīti. [Saddhammapadaṃ]. Gaṇuttamapade loke samāna diṭṭhisīlānaṃ sahadhammikānaṃ samūho gaṇoti vuccati. Idha pana uttamehi sīlādiguṇehi yutto bhagavato sāvakasaṅgho uttamoca so gaṇocāti atthena uttamagaṇonāma. Soyeva idha gaṇuttamoti vuccati yathā muniseṭṭho munivaroti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "[11] Vibhāvaniyaṃ"
      },
      " pana"
    ],
    "innerText": "[11] Vibhāvaniyaṃ pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Gaṇānaṃ gaṇesuvā devamanussādisamūhesu uttamo gaṇuttamo’’ti ca vuttaṃ. Taṃ na sundaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Etasmiñhi atthe sati uttamasaddo padhānabhūto hoti. Soca guṇamhiyeva pavattatīti tena idha ariyasaṅgho vuttoti nasijjhatīti. Etthaca gaṇoti saṅghoyeva vuccati. Soca saṅgho duvidho sammutisaṅgho, dakkhiṇeyyasaṅghoti. Tattha samaggena saṅghena kataṃ upasampadākammaṃ sammutināma. Tāya sammutiyā upasampannabhūmiṃ patvā ṭhito bhikkhusaṅgho sammutisaṅghonāma. So vinayakammesu pasiddho. Dakkhiṇeyyasaṅgho nāma aṭṭha ariyapuggalasamūho. Sopana kiñcāpi sammutisaṅghepi antogadhoyeva hoti. Tathāpi saraṇagamana vandanā māna ",
      " pūjāsakkārānussatiṭṭhānesu anuttara puññakkhetta vise sapariggahatthaṃ bhagavatā tathā tathā saṃvaṇṇetvā so visuṃ vuttoti daṭṭhabbo. Puthujjanasaṅghohi puññakkhettaṃ samānopi anuttaraṃ puññakkhettaṃ nahoti. Kasmā. Sālikkhette tiṇānaṃ viya khettaduṭṭhānaṃ sakkāyadiṭṭhi vicikicchānusayānaṃ sabbhāvāti. Puññakkhettabhāvo panassa purime saddhammapade vuttanayena veditabboti. [Sasaddhammagaṇuttamapadaṃ]"
    ],
    "innerText": "Etasmiñhi atthe sati uttamasaddo padhānabhūto hoti. Soca guṇamhiyeva pavattatīti tena idha ariyasaṅgho vuttoti nasijjhatīti. Etthaca gaṇoti saṅghoyeva vuccati. Soca saṅgho duvidho sammutisaṅgho, dakkhiṇeyyasaṅghoti. Tattha samaggena saṅghena kataṃ upasampadākammaṃ sammutināma. Tāya sammutiyā upasampannabhūmiṃ patvā ṭhito bhikkhusaṅgho sammutisaṅghonāma. So vinayakammesu pasiddho. Dakkhiṇeyyasaṅgho nāma aṭṭha ariyapuggalasamūho. Sopana kiñcāpi sammutisaṅghepi antogadhoyeva hoti. Tathāpi saraṇagamana vandanā māna pūjāsakkārānussatiṭṭhānesu anuttara puññakkhetta vise sapariggahatthaṃ bhagavatā tathā tathā saṃvaṇṇetvā so visuṃ vuttoti daṭṭhabbo. Puthujjanasaṅghohi puññakkhettaṃ samānopi anuttaraṃ puññakkhettaṃ nahoti. Kasmā. Sālikkhette tiṇānaṃ viya khettaduṭṭhānaṃ sakkāyadiṭṭhi vicikicchānusayānaṃ sabbhāvāti. Puññakkhettabhāvo panassa purime saddhammapade vuttanayena veditabboti. [Sasaddhammagaṇuttamapadaṃ]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhivādiyā"
      },
      "ti visesato vanditvā. Ettha ca ayaṃ loke sīlādiguṇayutto seṭṭho vandaneyyoti evaṃ seṭṭha cittaṃ paccupaṭṭhāpetvā vandanto visesato vandatīti vuccati. Vandanā pana tividhā kāyavandanādivasena. Yathāha –"
    ],
    "innerText": "8.Abhivādiyāti visesato vanditvā. Ettha ca ayaṃ loke sīlādiguṇayutto seṭṭho vandaneyyoti evaṃ seṭṭha cittaṃ paccupaṭṭhāpetvā vandanto visesato vandatīti vuccati. Vandanā pana tividhā kāyavandanādivasena. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Tisso imā bhikkhave vandanā, katamā tisso. Kāyena vandati, vācāya vandati, manasā vandatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha seṭṭhacittaṃ paccupaṭṭhāpetvā jāṇudvaya kapparadvaya nalāṭa saṅkhātāni pañca aṅgāni bhūmiyaṃ patiṭṭhāpetvā vandaneyyānaṃ abhimukhaṃ nippajjanto kāyena vandatināma. Yaṃ sandhāya pañcappatiṭṭhitena vanditvāti tattha tattha vuttaṃ. Yāyaca avandiyaṭṭhānesu vandantassa āpatti hotīti. Guṇapadāni vācāya pavattento vācāya vandatināma. Namo buddhassa, namatthu buddhassa, namo vimuttiyā, namo vimuttānaṃ, vipassissa namatthūti evamādīsupi vācā vandanāyeva. Guṇapadāni anugantvā guṇe anussaranto manasā vandatināmāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāsissa"
      },
      "nti kathessāmi. Kāmañca thero imaṃ saṅgahaṃ racayanto potthakāruḷhaṃ katvāva racayissati. Ganthakammaṃ nāma vācākammesu pasiddhanti katvā bhāsissanti vuttanti daṭṭhabbaṃ."
    ],
    "innerText": "9.Bhāsissanti kathessāmi. Kāmañca thero imaṃ saṅgahaṃ racayanto potthakāruḷhaṃ katvāva racayissati. Ganthakammaṃ nāma vācākammesu pasiddhanti katvā bhāsissanti vuttanti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhidhammatthasaṅgaha"
      },
      "nti pade abhidhamme vuttā atthā abhidhammatthā. Te saṅgayhanti ettha etenātivā abhidhammatthasaṅgaho. Saṅgayhantitica therena saṃkhipitvā gayhanti kathīyantīti attho. Abhidhammeti cettha abhiatireko abhivise soca dhammo abhidhammo. Dhammoti ca vinayapāḷito aññaṃpāḷi dvayaṃ ",
      " vuccati. Yo vo ānanda mayā dhammoca vinayoca desito paññattoti hi vuttaṃ. Tañca pāḷidvayaṃ āṇāvidhānasaṅkhātaṃ vinayana kiccaṃ vajjetvā kusalādike yathāpavatte paramatthadhamme eva dīpetīti. Evaṃ dīpentesuca tesu dvīsu dhammesu yo itarato atirekoca hoti visesoca. Ayameva abhidhammo nāma. Itaropana dhammoyeva. Evañca katvā dhammo abhidhammo vinayo abhivinayoti idaṃ catukkaṃ veditabbaṃ. Tattha dhammonāma suttantapiṭakaṃ. Abhidhammonāma yattapakaraṇāni. Vinayonāma ubhato vibhaṅgo, abhivinayonāma khandhakaparivārāti aṭṭhakathāsu vuttaṃ. Atirekavisesatā cettha kusalādi vasena khandhādivasena saṅgahādivasena tathā tathā desetabbappakārānaṃ anavasesavibhattivasenavā suddhadhammādhiṭṭhāna desanāpavattivasenavā veditabbā. Yato sabbaññubuddhā imaṃ abhidhammadesanaṃ devesueva desenti. Na hi manussā evarūpaṃ tayo māse nirantaraṃ pavattanayogyaṃ kathāmaggaṃ ekena iriyāpathena ādito paṭṭhāya pariyosānaṃ pāpetvā paṭiggahetuṃ sakkonti, naca eva rūpo ekamātikānubandho kathāmaggo nānākhaṇesu nānājanānaṃ desetuṃ sakkuṇeyyo hotīti. Kecipana vinayapāḷitopi abhirekavisesataṃ tassa vaṇṇenti. Taṃ aṭṭhasāliniyā na sameti. Tattha hi dhammanāmikānaṃ dvinnaṃ pāḷīnaṃ majjheeva ayaṃ atirekavisesatā vicāritā. Naca yujjati vinayena saha tathā vicāretuṃ asamānakiccavisayattā. Vinayo hi kāyavācānaṃ vinayanakicco, ajjhācāravisayoca. Dhammo pana dhammavibhāgakicco dhammappavatti visayocāti. Kecipana vadanti evaṃ santepi vinayo eva sabbajeṭṭhako siyā. Vinayaṃ vivaṇṇentassa hi pācittiyāpatti hoti. Dhammaṃ vivaṇṇentassa dukkaṭāpattimattāti, taṃ nayujjati. Vinayo hi āṇācakkaṃ. Dhammoca dhammacakkaṃ. Tattha vinayaṃ vivaṇṇento satthu āṇācakke pahāraṃ deti. Satthari agāravo mahanto hoti. Yassaca satthari agāravo, tassa dhammasaṅghesu tīsu sikkhāsuca agāravo siddho hoti. Tasmā vinaya vivaṇṇane ",
      " āpatti mahantī hoti. Na sabbajeṭṭhakattāti. Apica, vinayonāma sāsanassa mūlaṃ. Vinaye aṭṭhite sāsanaṃ natiṭṭhati. Tasmā sāsanassa ciraṭṭhitatthaṃpi vinayavivaṇṇane mahatī āpatti paññattāti."
    ],
    "innerText": "10.Abhidhammatthasaṅgahanti pade abhidhamme vuttā atthā abhidhammatthā. Te saṅgayhanti ettha etenātivā abhidhammatthasaṅgaho. Saṅgayhantitica therena saṃkhipitvā gayhanti kathīyantīti attho. Abhidhammeti cettha abhiatireko abhivise soca dhammo abhidhammo. Dhammoti ca vinayapāḷito aññaṃpāḷi dvayaṃ vuccati. Yo vo ānanda mayā dhammoca vinayoca desito paññattoti hi vuttaṃ. Tañca pāḷidvayaṃ āṇāvidhānasaṅkhātaṃ vinayana kiccaṃ vajjetvā kusalādike yathāpavatte paramatthadhamme eva dīpetīti. Evaṃ dīpentesuca tesu dvīsu dhammesu yo itarato atirekoca hoti visesoca. Ayameva abhidhammo nāma. Itaropana dhammoyeva. Evañca katvā dhammo abhidhammo vinayo abhivinayoti idaṃ catukkaṃ veditabbaṃ. Tattha dhammonāma suttantapiṭakaṃ. Abhidhammonāma yattapakaraṇāni. Vinayonāma ubhato vibhaṅgo, abhivinayonāma khandhakaparivārāti aṭṭhakathāsu vuttaṃ. Atirekavisesatā cettha kusalādi vasena khandhādivasena saṅgahādivasena tathā tathā desetabbappakārānaṃ anavasesavibhattivasenavā suddhadhammādhiṭṭhāna desanāpavattivasenavā veditabbā. Yato sabbaññubuddhā imaṃ abhidhammadesanaṃ devesueva desenti. Na hi manussā evarūpaṃ tayo māse nirantaraṃ pavattanayogyaṃ kathāmaggaṃ ekena iriyāpathena ādito paṭṭhāya pariyosānaṃ pāpetvā paṭiggahetuṃ sakkonti, naca eva rūpo ekamātikānubandho kathāmaggo nānākhaṇesu nānājanānaṃ desetuṃ sakkuṇeyyo hotīti. Kecipana vinayapāḷitopi abhirekavisesataṃ tassa vaṇṇenti. Taṃ aṭṭhasāliniyā na sameti. Tattha hi dhammanāmikānaṃ dvinnaṃ pāḷīnaṃ majjheeva ayaṃ atirekavisesatā vicāritā. Naca yujjati vinayena saha tathā vicāretuṃ asamānakiccavisayattā. Vinayo hi kāyavācānaṃ vinayanakicco, ajjhācāravisayoca. Dhammo pana dhammavibhāgakicco dhammappavatti visayocāti. Kecipana vadanti evaṃ santepi vinayo eva sabbajeṭṭhako siyā. Vinayaṃ vivaṇṇentassa hi pācittiyāpatti hoti. Dhammaṃ vivaṇṇentassa dukkaṭāpattimattāti, taṃ nayujjati. Vinayo hi āṇācakkaṃ. Dhammoca dhammacakkaṃ. Tattha vinayaṃ vivaṇṇento satthu āṇācakke pahāraṃ deti. Satthari agāravo mahanto hoti. Yassaca satthari agāravo, tassa dhammasaṅghesu tīsu sikkhāsuca agāravo siddho hoti. Tasmā vinaya vivaṇṇane āpatti mahantī hoti. Na sabbajeṭṭhakattāti. Apica, vinayonāma sāsanassa mūlaṃ. Vinaye aṭṭhite sāsanaṃ natiṭṭhati. Tasmā sāsanassa ciraṭṭhitatthaṃpi vinayavivaṇṇane mahatī āpatti paññattāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti paramatthadīpaniyā nāma abhidhammattha saṅgahassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catutthavaṇṇanāya pathamagāthāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paramatthadīpanā niṭṭhitā."
  }
]