[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "16. Indriyapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tividho indriyapaccayo sahajātindriyapaccayo pure jātindriyapaccayo rūpajīvitindriyapaccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha pannarasindriyadhammā sahajātindriyapaccayo nāma, jīvitindriyaṃ manindriyaṃ sukhindriyaṃ dukkhindriyaṃ somanassindriyaṃ domanassindriyaṃ upekkhindriyaṃ saddhindriyaṃ vīriyindriyaṃ satindriyaṃ samādhindriyaṃ paññindriyaṃ anaññātaññassāmītindriyaṃ aññindriyaṃ aññātāvindriyanti. Tehi sahajātā cittacetasikadhammā ca rūpadhammā ca tassa paccayuppannā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pañcindriyarūpāni purejātindriyapaccayo, cakkhundriyaṃ sotindriyaṃ ghānindriyaṃ jivhindriyaṃ kāyindriyaṃ. Pañcaviññāṇacitta cetasika dhammā tassa paccayuppannā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ekaṃ rūpajīvitindriyaṃ rūpajīvitindriyapaccayo. Sabbāni kammaja rūpāni jīvitarūpavajjitāni tassa paccayuppannāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kenaṭṭhena indriyanti. Issariyaṭṭhena indriyaṃ. Tattha kattha issariyanti. Attano attano paccayuppannesu dhammesu issariyaṃ. Kasmiṃ kasmiṃ kicce issariyanti ",
      ". Attano attano kicce issariyaṃ. Nāmajīvitaṃ sampayuttadhammānaṃ jīvanakicce issariyaṃ. Jīvanakicceti āyuvaḍḍhanakicce, santatiṭhitiyā cirakālaṭhitikicceti attho. Manindriyaṃ ārammaṇaggahaṇakicce sampayuttadhammānaṃ issariyaṃ. Avaseso indriyaṭṭho pubbe indriyayamakadīpaniyaṃ vuttoyeva."
    ],
    "innerText": "Kenaṭṭhena indriyanti. Issariyaṭṭhena indriyaṃ. Tattha kattha issariyanti. Attano attano paccayuppannesu dhammesu issariyaṃ. Kasmiṃ kasmiṃ kicce issariyanti . Attano attano kicce issariyaṃ. Nāmajīvitaṃ sampayuttadhammānaṃ jīvanakicce issariyaṃ. Jīvanakicceti āyuvaḍḍhanakicce, santatiṭhitiyā cirakālaṭhitikicceti attho. Manindriyaṃ ārammaṇaggahaṇakicce sampayuttadhammānaṃ issariyaṃ. Avaseso indriyaṭṭho pubbe indriyayamakadīpaniyaṃ vuttoyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha vadeyya, dve itthindriyapurisindriyadhammā indriyabhūtā samānāpi kasmā indriyapaccaye visuṃ na gahitāti. Paccayakiccassa abhāvato. Tividhañhi paccayakiccaṃ jananakiccañca upatthambhanakiccañca anupālanakiccañca. Tattha yo paccayo paccayuppannadhammassa uppādāya paccayo hoti, yasmiṃ asati paccayuppanno dhammo na uppajjati, tassa paccayakiccaṃ jananakiccaṃ nāma. Yathā anantarapaccayo. Yo paccayo paccayuppannadhammassa ṭhitiyā ca vuḍḍhiyā ca viruḷhiyā ca paccayo hoti, yasmiṃ asati paccayuppanno dhammo na tiṭṭhati na vaḍḍhati na virūhati, tassa paccayakiccaṃ upatthambhanakiccaṃ nāma. Yathā pacchājātapaccayo. Yo paccayo paccayuppannassa dhammassa pavattiyā paccayo hoti, yena vinā paccayuppanno dhammo cirakālaṃ na pavattati, santati gamanaṃ chijjati, tassa paccaya kiccaṃ anupālanakiccaṃ nāma. Yathā rūpa jīvitindriyapaccayo. Ete pana dve indriyadhammā tesu tīsu paccaya kiccesu ekakiccaṃpi nasādhenti, tasmā ete dve dhammā indriya paccaye visuṃ na gahitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Etaṃ sante ete dve dhammā indriyātipi na vattabbāti. No na vattabbā. Kasmā. Indriyakiccasabbhāvatoti. Kiṃ pana etesaṃ indriyakiccanti. Liṅganimittakuttaākappesu issaratā indriya kiccaṃ. Tathā hi yassa puggalassa paṭisandhikkhaṇe itthindriyarūpaṃ uppajjati, tassa santāne catūhi kammādīhi paccayehi uppannā pañcakkhandha dhammā itthibhāvāya pariṇamanti, so attabhāvo ekantena itthiliṅga itthinimitta itthikutta itthākappayutto hoti, no aññathā. Na ca itthindriyarūpaṃ te pañcakkhandhadhamme janeti, na ca upatthambhati, nāpi anupāleti, atha kho te dhammā attano attano paccayehi uppajjamānā evañcevañca uppajjantūti āṇaṃ ṭhapentaṃ viya tesu attano anubhāvaṃ pavatteti. Te ca dhammā tatheva uppajjanti, no aññathāti. Ayaṃ itthindriyarūpassa itthiliṅgādīsu issaratā. Esa nayo purisindriyarūpassa purisaliṅgādīsu issaratāyaṃ. Evaṃ ete dve dhammā liṅgādīsu indriyakicca sabbhāvato indriyā nāma hontīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hadayavatthurūpaṃ pana dvinnaṃ viññāṇadhātūnaṃ nissayavatthukiccaṃ sādhayamānaṃpi tāsu indriyakiccaṃ na sādheti. Na hi bhāvita cittassa puggalassa hadayarūpe pasannevā ",
      " appasanne vā jātepi manoviññāṇadhātuyo tadanuvattikā hontīti. Indriya paccayadīpanā niṭṭhitā."
    ],
    "innerText": "Hadayavatthurūpaṃ pana dvinnaṃ viññāṇadhātūnaṃ nissayavatthukiccaṃ sādhayamānaṃpi tāsu indriyakiccaṃ na sādheti. Na hi bhāvita cittassa puggalassa hadayarūpe pasannevā appasanne vā jātepi manoviññāṇadhātuyo tadanuvattikā hontīti. Indriya paccayadīpanā niṭṭhitā."
  }
]