[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "15. Āhārapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Duvidho āhārapaccayo rūpāhārapaccayo arūpāhāra paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha rūpāhārapaccayo nāma kabaḷīkārāhārasaṅkhātaṃ oja rūpaṃ vuccati. So ca ajjhattāhāro bahiddhāhāroti duvidho. Kabaḷīkārāhārabhakkhānaṃ sattānaṃ sabbepi catusamuṭṭhānikarūpadhammā tassa duvidhassa rūpāhārassa paccayuppannā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Arūpāhāro pana tividho phassāhāro manosañcetanā hāro viññāṇāhāro ca. Tayopete dhammā sahajātānaṃ nāmarūpadhammānaṃ āhārapaccayo honti. Sahajātā ca nāmarūpa dhammā tesaṃ paccayuppannā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kenaṭṭhena āhāroti. Bhusaṃ haraṇaṭṭhena āhāro. Bhusaṃ haraṇaṭṭhenātica daḷhaṃ pavattāpanaṭṭhena, cirakālaṃ ṭhitiyā vuḍḍhiyā viruḷhiyā vepullāya upatthambhanaṭṭhenāti vuttaṃ hoti. Jananakiccayuttopi āhāro upatthambhanakiccappadhāno hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha duvidho rūpāhāro ajjhattasantāne catusamuṭṭhānikaṃ rūpakāyaṃ upabrūhayanto bhusaṃ harati, daḷhaṃ pavatteti, ciraṃ addhānaṃ gameti, taṃ taṃ āyukappapariyosānaṃ pāpetīti āhāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Phassāhāro ",
      " ārammaṇesu iṭṭhāniṭṭharasaṃ nīharanto sampayuttadhamme bhusaṃ harati. Manosañcetanāhāro kāyavacī manokammesu ussāhaṃ janento sampayuttadhamme bhusaṃ harati. Viññāṇāhāro ārammaṇavijānanaṭṭhena pubbaṅgamakiccaṃ vahanto sampayuttadhamme bhusaṃ harati, daḷhaṃ pavatteti, ciraṃ addhānaṃ gametīti āhāro. Sampayuttadhamme bhusaṃ haranto sahajātarūpadhammepi bhusaṃ haratiyeva."
    ],
    "innerText": "Phassāhāro ārammaṇesu iṭṭhāniṭṭharasaṃ nīharanto sampayuttadhamme bhusaṃ harati. Manosañcetanāhāro kāyavacī manokammesu ussāhaṃ janento sampayuttadhamme bhusaṃ harati. Viññāṇāhāro ārammaṇavijānanaṭṭhena pubbaṅgamakiccaṃ vahanto sampayuttadhamme bhusaṃ harati, daḷhaṃ pavatteti, ciraṃ addhānaṃ gametīti āhāro. Sampayuttadhamme bhusaṃ haranto sahajātarūpadhammepi bhusaṃ haratiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha suttantanayopi vattabbo. Yathā sakuṇā nāma cakkhūhi disāvidisaṃ vibhāvetvā pattehi rukkhato rukkhaṃ vanato vanaṃ ākāsena pakkhanditvā tuṇḍakehi phalāphalāni tuditvā yāvajīvaṃ attānaṃ yāpenti. Tathā ime sattā chahi viññāṇehi ārammaṇāni vibhāvetvā chahi manosañcetanāhārehi ārammaṇavatthuppaṭilābhatthāya ussukkanaṃ katvā chahi phassāhārehi ārammaṇesu rasaṃ pātubhavantaṃ katvā sukhadukkhaṃ anubhavanti. Viññāṇehi vā ārammaṇāni vibhāvetvā nāmarūpa sampattiṃ sādhenti. Phassehi ārammaṇesu rasaṃ pātubhavantaṃ katvā ārammaṇarasānubhavanaṃ vedanaṃ sampādetvā taṇhāvepullaṃ āpajjanti. Cetanāhi taṇhāmūlakāni nānākammāni pasavetvā bhavato bhavaṃ saṃsaranti. Evaṃ āhāradhammānaṃ mahantaṃ āhārakiccaṃ veditabbanti. Āhārapaccayadīpanā niṭṭhitā."
  }
]