[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "19. Sampayuttapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sampayuttapaccayo vippayuttapaccayoti ekaṃ dukkaṃ. Atthi paccayo natthi paccayoti ekaṃ dukkaṃ. Vigatapaccayo avigata paccayoti ekaṃ dukkaṃ. Imāni tīṇi paccayadukkāni visuṃ paccaya visesāni na honti. Pubbe āgatesu paccayesu keci paccayā attano paccayuppannehi sampayuttā hutvā paccayattaṃ gacchanti, keci vippayuttā hutvā, keci vijjamānā hutvā, keci avijjamānā hutvā, keci vigatā hutvā, keci avigatā hutvā paccayattaṃ gacchantīti dassanatthaṃ imāni tīṇi paccayadukkāni vuttāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ",
      " ca atthīti kho kaccāna ayameko anto, natthīti kho dutiyo antoti evarūpesu ṭhānesu atthinatthisaddā sassatucchedesupavattanti, tasmā evarūpānaṃ atthānaṃ nivattanatthaṃ puna vigatadukkaṃ vuttaṃ."
    ],
    "innerText": "Ettha ca atthīti kho kaccāna ayameko anto, natthīti kho dutiyo antoti evarūpesu ṭhānesu atthinatthisaddā sassatucchedesupavattanti, tasmā evarūpānaṃ atthānaṃ nivattanatthaṃ puna vigatadukkaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sabbepi sahajātā cittacetasikā dhammā aññamaññassa paccayā ceva honti paccayuppannā ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kenaṭṭhena sampayutto. Ekuppādatā ekanirodhatā ekavatthukatā ekārammaṇatāti imehi catūhi sampayogaṅgehi samannāgato hutvā saṃyutto ekībhāvaṃ gatoti sampayutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha ekībhāvaṃ gatoti cakkhuviññāṇaṃ phassādīhi sattahi cetasikehi saha ekībhāvaṃ gataṃ hoti, dassananti ekaṃ vohāraṃ gacchati. Aṭṭha dhammā visuṃ visuṃ vohāraṃ na gacchanti, vinibbhujjitvā viññātuṃ na sakkoti. Esa nayo sesesu sabbacittuppādesūti. Sampayuttapaccayadīpanā niṭṭhitā."
  }
]