[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "11. Pacchājātapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pacchimaṃ pacchimaṃ paccuppannaṃ cittaṃ purejātassa paccuppannassa catu samuṭṭhānikassa rūpakāyassa vuḍḍhiviruḷhiyā pacchājātapaccayo. Yathā taṃ pacchimavassesu anuvassaṃ vassamānāni vassodakāni purimavassesu jātānaṃ rukkhapotakānaṃ vuḍḍhiviruḷhiyā pacchājāta paccayā hontīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha pacchimaṃ pacchimaṃ cittanti paṭhamabhavaṅgato paṭṭhāya yāva cuti cittā sabbaṃ cittaṃ vuccati. Purejātassāti paṭisandhicittena sahuppannaṃ kammajarūpakāyaṃ ādiṃ katvā ajjhattasantānapariyāpanno sabbo catusamuṭṭhānikarūpakāyo vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭisandhicittena sahuppannassa kammajarūpakāyassa paṭhama bhavaṅgādīni pannarasabhavaṅgacittāni pacchājātapaccayā honti. Paṭisandhi cittaṃ pana tena kāyena sahuppannattā ",
      " pacchajātaṃ na hoti. Soḷasamabhavaṅgacittañca tassa kāyassa bhijjanakkhette uppannattā paccayo na hoti. Tasmā pannarasabhavaṅgacittānīti vuttaṃ."
    ],
    "innerText": "Paṭisandhicittena sahuppannassa kammajarūpakāyassa paṭhama bhavaṅgādīni pannarasabhavaṅgacittāni pacchājātapaccayā honti. Paṭisandhi cittaṃ pana tena kāyena sahuppannattā pacchajātaṃ na hoti. Soḷasamabhavaṅgacittañca tassa kāyassa bhijjanakkhette uppannattā paccayo na hoti. Tasmā pannarasabhavaṅgacittānīti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paṭisandhicittassa ṭhitikkhaṇe pana dve rūpakāyā uppajjanti kammajarūpakāyo ca utujarūpakāyoca. Tathā bhaṅgakkhaṇepi. Paṭhamabhavaṅgassa uppādakkhaṇe pana tayo rūpakāyā uppajjanti kammajarūpakāyo ca utujarūpakāyo ca cittajarūpakāyo ca. Yadā bahiddhāhārappharaṇaṃ labhitvā ajjhattāhāro āhārajarūpakāyaṃ janeti, tato paṭṭhāya catusamuṭṭhānikā cattāro rūpakāyā dīpa jālā viya pavattanti. Te uppādakkhaṇaṃ atikkamma yāva ṭhitibhāvena dharanti, tāva pannarasacittāni tesaṃ kāyānaṃ pacchājātapaccayā hontiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vuḍḍhiviruḷhiyāti catusamuṭṭhānikarūpasantatiyā uparūpari vuḍḍhiyā ca viruḷhiyā ca. Tathāhi purimā purimā cattāro rūpakāyā sace pacchājāta paccayaṃ punappunaṃ labhanti, evaṃ sati te nirujjhantāpi pacchārūpasantatiparamparānaṃ vuḍḍhiyā ca viruḷhiyā ca vepullāya ca balava paccayā hutvā nirujjhantīti. Pacchājātapaccayadīpanā niṭṭhitā."
  }
]