[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "12. Āsevanapaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dvādasa akusalacittāni sattarasa lokiyakusala cittāni āvajjanadvayavajjitāni aṭṭhārasakiriyacittānīti satta cattālīsaṃ lokiyajavanacittāni āsevanapaccayo. Tesu nirantarappavattaṃ javanasantatiṃ patvā purimaṃ purimaṃ javanacittaṃ āsevana paccayo. Catūhi maggacittehi pacchimaṃ pacchimaṃ cittaṃ āsevanapaccayuppannaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kenaṭṭhena āsevananti. Uparūparipaguṇabhāvavaḍḍhanatthaṃthāma balavaḍḍhanatthañca parivāsaggāhāpanaṭṭhena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha paguṇabhāvoti punappunaṃ sajjhāyitassa pāḷipāṭhassa sukhena pavattanaṃ viya javanaṭṭhānajavanakiccasaṅkhāte ṭhānakiccavisese pacchima pacchimacittassa sukhena pavattanaṃ. Parivāso nāma koseyyavatthaṃ punappunaṃ sugandhena parivāsanaṃ viya cittasantāne punappunnaṃ rajjanadussanādinā vā arajjana adussanādinā vā parivāsanaṃ. Purimasmiṃ javanacitte niruddhepi tassa javanavego na nirujjhati, pacchimaṃ cittasantānaṃ pharamāno pavattatiyeva. Tasmā pacchimaṃ pacchimaṃ javanacittaṃ uppajjamānaṃ tena vegena paggahitaṃ balavataraṃ hutvā uppajjati. Evaṃ ",
      " purimacittaṃ attano parivāsaṃ pacchimacittaṃ gaṇhāpeti. Pacchimañca cittaṃ purimassa cittassa parivāsaṃ gahetvā pavattati. Evaṃ santepi so āsevanavego pakatiyā sattahi cittavārehi parikkhayaṃ gacchati, tato paraṃ tadārammaṇavipāka cittaṃ vā uppajjati, bhavaṅga cittavāro vā pavattati."
    ],
    "innerText": "Tattha paguṇabhāvoti punappunaṃ sajjhāyitassa pāḷipāṭhassa sukhena pavattanaṃ viya javanaṭṭhānajavanakiccasaṅkhāte ṭhānakiccavisese pacchima pacchimacittassa sukhena pavattanaṃ. Parivāso nāma koseyyavatthaṃ punappunaṃ sugandhena parivāsanaṃ viya cittasantāne punappunnaṃ rajjanadussanādinā vā arajjana adussanādinā vā parivāsanaṃ. Purimasmiṃ javanacitte niruddhepi tassa javanavego na nirujjhati, pacchimaṃ cittasantānaṃ pharamāno pavattatiyeva. Tasmā pacchimaṃ pacchimaṃ javanacittaṃ uppajjamānaṃ tena vegena paggahitaṃ balavataraṃ hutvā uppajjati. Evaṃ purimacittaṃ attano parivāsaṃ pacchimacittaṃ gaṇhāpeti. Pacchimañca cittaṃ purimassa cittassa parivāsaṃ gahetvā pavattati. Evaṃ santepi so āsevanavego pakatiyā sattahi cittavārehi parikkhayaṃ gacchati, tato paraṃ tadārammaṇavipāka cittaṃ vā uppajjati, bhavaṅga cittavāro vā pavattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha suttantāsevanapaccayopi vattabbo. Satipaṭṭhānaṃ bhāveti, sammappadhānaṃ bhāveti, satisambojjhaṅgaṃ bhāveti, dhamma vicayasambojjhaṅgaṃ bhāveti, sammādiṭṭhiṃ bhāveti, sammāsaṅkappaṃ bhāvetītiādinā bahūsu ṭhānesu vutto. Tattha bhāvetīti ekaṃpi divasaṃ bhāveti, sattapi divasāni bhāveti, ekaṃpi māsaṃ bhāveti, sattapi māsāni bhāveti, ekaṃpi saṃvaccharaṃ bhāveti, sattapi saṃvaccharāni bhāvetīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Purimapurimesu bhavesu āsevitāni bhāvitāni bahulī katāni kusalāni vā akusalāni vā pacchimapacchimesu bhavesu balavatarānaṃ kusalānaṃ vā akusalānaṃ vā uppattiyā āsevana paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kālantare vā bhavantare vā tādisānaṃ kusalākusalānaṃ uppattiyā paccayo upanissayapaccayo nāma. Tesaṃyeva balavataratthāya paccayo āsevanapaccayo nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Lokepi mahantesu cittabhāvanākammesu vācā bhāvanākammesu kāyabhāvanākammesu aṅgapaccaṅgabhāvanākammesu kammāyatanasippāyatanavijjāṭhānesu ca āsevanā bhāvanā bahulīkammānaṃ nissandaguṇā nāma sandissantiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sabbesaṃ khaṇikadhammānaṃ majjhe evarūpassa āsevana paccayassa vijjamānattā purisabalapurisathāmānaṃ uparūpari vaḍḍhana vasena cirakālaṃ pavattitāni purisakammāni nipphattiṃ pāpuṇanti, sabbaññubuddhabhāvaṃpi gacchanti. Āsevanapaccayadīpanā niṭṭhitā."
  }
]