[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Adhipatipaccayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Duvidho adhipatipaccayo ārammaṇādhipatipaccayo saha jātādhipatipaccayo ca. Tattha katamo ārammaṇādhipatipaccayo. Ārammaṇapaccaye vuttesu ārammaṇesu yāni ārammaṇāni atiiṭṭhāni honti atikantāni atimanāpāni garukatāni. Tāni ārammaṇāni ārammaṇādhipatipaccayo. Tattha atiiṭṭhānīti sabhāvato iṭṭhāni vā hontu aniṭṭhāni vā, tena tena puggalena atiicchitāni ārammaṇāni idha atiiṭṭhāni nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tāni pana dhammato dve dosamūlacittuppāde ca dve momūha cittuppāde ca dukkhasahagatakāyaviññāṇacittuppāde ca ṭhapetvā avasesāni sabbāni kāmāvacaracittacetasikāni ca rūpārūpa lokuttaracittacetasikāni ca sabbāni atiiṭṭharūpāni ca honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesupi ",
      " kāmārammaṇāni garuṃ karontasseva ārammaṇā dhipatipaccayo. Garuṃ akarontassa ārammaṇādhipatipaccayo na hoti. Jhānalābhino pana attanā paṭiladdhāni mahaggatajhānāni ariyasāvakā ca attanā paṭiladdhe lokuttaradhamme garuṃ akarontā nāma natthi."
    ],
    "innerText": "Tesupi kāmārammaṇāni garuṃ karontasseva ārammaṇā dhipatipaccayo. Garuṃ akarontassa ārammaṇādhipatipaccayo na hoti. Jhānalābhino pana attanā paṭiladdhāni mahaggatajhānāni ariyasāvakā ca attanā paṭiladdhe lokuttaradhamme garuṃ akarontā nāma natthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katame dhammā tassa paccayassa paccayuppannā. Aṭṭha lobha mūlacittāni aṭṭha kāmāvacarakusalacittāni cattāri kāmāvacara ñāṇasampayuttakiriyacittāni aṭṭha lokuttaracittāni tassa paccayassa paccayuppannā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha lokiyāni chaḷārammaṇāni lobhamūlacittānaṃ paccayo. Sattarasa lokiyakusalāni catunnaṃ ñāṇavippayutta kusalānaṃ. Tāni kusalāniceva heṭṭhimamaggaphalāni ca nibbānañca catunnaṃ ñāṇasampayuttakusalānaṃ. Arahattamaggaphalāni ca nibbānañca catunnaṃ ñāṇasampayuttakiriyānaṃ. Nibbānaṃ aṭṭhannaṃ lokuttara cittānanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kenaṭṭhena ārammaṇaṃ, kenaṭṭhena adhipati. Ālambi tabbaṭṭhena ārammaṇaṃ, ādhipaccaṭṭhena adhipati. Ko ādhipaccaṭṭho. Attānaṃ garuṃ katvā pavattesu cittacetasikesu issarabhāvo ādhipaccaṭṭho. Loke sāmikā viya ārammaṇādhipatipaccaya dhammā daṭṭhabbā, dāsā viya paccayuppannadhammā daṭṭhabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sutasomajātake rājā porisādo manussamaṃsaṃ garuṃ karonto manussamaṃsahetu rajjaṃ pahāya araññe vicarati. Tattha manussamaṃse gandharasa dhammā ārammaṇādhipatipaccayo. Rañño porisādassa lobhamūlacittaṃ paccayuppannadhammo. Rājā suta somo saccadhammaṃ garuṃ katvā saccadhammahetu rajjasampattiñca ñāti saṅghañca attano jīvitañca chaṭṭetvā puna rañño porisādassa hatthaṃ upagato. Tattha saccadhammo ārammaṇādhipatipaccayo. Rañño sutasomassa kusalacittaṃ paccayuppannadhammo. Esanayo sabbesu garukatesu ārammaṇesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katamo sahajātādhipatipaccayo. Adhipatibhāvaṃ pattā cattāro dhammā adhipatipaccayo, chando cittaṃ vīriyaṃ vīmaṃsā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katame dhammā tassa paccayassa paccayuppannā. Adhipati sampayuttā cittacetasikā ca adhipatisamuṭṭhitā cittajarūpadhammā ca tassa paccayassa paccayuppannā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kenaṭṭhena sahajāto, kenaṭṭhena adhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sahuppādanaṭṭhena sahajāto, sahajātānaṃ dhammānaṃ abhibhavanaṭṭhena adhipati. Tattha sahuppādanaṭṭhenāti ",
      " yo dhammo sayaṃ uppajjamāno attanā sahajātadhamme ca attanā saheva uppādeti, tassa attanā sahajātadhammānaṃ sahuppādanaṭṭhena."
    ],
    "innerText": "Sahuppādanaṭṭhena sahajāto, sahajātānaṃ dhammānaṃ abhibhavanaṭṭhena adhipati. Tattha sahuppādanaṭṭhenāti yo dhammo sayaṃ uppajjamāno attanā sahajātadhamme ca attanā saheva uppādeti, tassa attanā sahajātadhammānaṃ sahuppādanaṭṭhena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abhibhavanaṭṭhenāti ajjhottharaṇaṭṭhena. Yathā rājā cakkavatti attano puññiddhiyā sakaladīpavāsino abhibhavanto ajjhottharanto attano vase vattāpeti, sakaladīpavāsino ca tassa vase vattanti. Tathā adhipatiṭṭhānapattā ime cattāro dhammā attano attano visaye sahajātadhamme abhibhavantā ajjhottharantā attano vase vattāpenti, sahajātadhammā ca tesaṃ vase vattanti. Yathā vā silāthambhe pathavidhātu udakakkhandhe āpodhātu aggikkhandhe tejodhātu vātakkhandhe vāyodhātu attanā sahajātā tisso dhātuyo abhibhavantā ajjhottharantā attano gatiṃ gamāpenti, sahajātadhātuyo ca tāsaṃ gatiṃ gacchanti, evameva adhipatiṭṭhānapattā ime cattāro dhammā attano balena sahajātadhamme attano gatiṃ gamāpenti, sahajātadhammā ca tesaṃ gatiṃ gacchanti, evaṃ sahajātadhammānaṃ abhibhavanaṭṭhena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha vadeyyuṃ, yadi sahajātadhammānaṃ abhibhavanaṭṭhena adhipatināma siyā. Evaṃ sati tiṭṭhatu chando, lobho eva adhipatināma siyā, so hi chandatopi balavataro hutvā saha jātadhamme abhibhavanto pavattatīti. Vuccate, bālaputhujjanesu eva lobho chandato balavataro hoti, paṇḍitesu pana chando eva lobhato balavataro hutvā sahajātadhamme abhi bhavanto pavattati. Sace hi lobho eva chandato balavataro siyā, kathaṃ ime sattā lobhassa hatthagatā bhavasampatti bhogasammattiyo chaṭṭetvā nekkhammadhamme pūretvā vaṭṭadukkhato nissareyyuṃ. Yasmā pana chando eva lobhato balavataro hoti, tasmā ime sattā lobhassa hatthagatā bhavasampatti bhogasampattiyo chaṭṭetvā nekkhammadhamme pūretvā vaṭṭadukkhato nissaranti. Tasmā chando eva lobhato balavataro hoti, chando eva adhipati, na lobhoti. Esa nayo dosādīsupīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha loke mahantesu sudukkaresu purisakammesu paccupaṭṭhitesu ime cattāro dhammā kammasiddhiyā saṃvattanti. Kathaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hīnacchandā bahujjanā mahantāni sudukkarāni purisakammāni disvā nivattacchandā honti. Kātuṃ na icchanti, amhākaṃ avisayoti nirapekkhā ṭhapenti. Chandādhiko pana tādisāni purisakammāni disvā uggatacchando hoti, ativiya ",
      " kātuṃ icchati, mama visayo esoti adhiṭṭhānaṃ gacchati. So chandena abhikaḍḍhito yāva taṃ kammaṃ na sijjhati, tāva antarā taṃ kammaṃ chaṭṭetuṃ na sakkoti. Evañca sati atimahantaṃpi taṃ kammaṃ ekasmiṃ kāle siddhaṃ bhavissati."
    ],
    "innerText": "Hīnacchandā bahujjanā mahantāni sudukkarāni purisakammāni disvā nivattacchandā honti. Kātuṃ na icchanti, amhākaṃ avisayoti nirapekkhā ṭhapenti. Chandādhiko pana tādisāni purisakammāni disvā uggatacchando hoti, ativiya kātuṃ icchati, mama visayo esoti adhiṭṭhānaṃ gacchati. So chandena abhikaḍḍhito yāva taṃ kammaṃ na sijjhati, tāva antarā taṃ kammaṃ chaṭṭetuṃ na sakkoti. Evañca sati atimahantaṃpi taṃ kammaṃ ekasmiṃ kāle siddhaṃ bhavissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hīnavīriyā ca bahujjanā tādisāni kammāni disvā nivatta vīriyā honti, idaṃ me kammaṃ karontassa bahuṃ kāyadukkhaṃ vā cetodukkhaṃ vā bhavissatīti nivattanti. Vīriyādhiko pana tādisāni purisakammāni disvā uggatavīriyo hoti, idāneva uṭṭhahitvā kātuṃ icchati. So cirakālaṃpi taṃ kammaṃ karonto bahuṃ kāyadukkhaṃ vā cetodukkhaṃ vā anubhavantopi tasmiṃ vīriya kamme nanibbindati, mahantena kammavīriyena vinā bhavituṃ na sakkoti, tādisena vīriyena rattidivaṃ khepento cittasukhaṃ vindati. Evañca sati atimahantaṃpi taṃ kammaṃ ekasmiṃ kāle siddhaṃ bhavissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hīnacittā ca bahujjanā tādisāni kammāni disvā nivattacittā honti. Puna ārammaṇaṃpi na karonti. Cittādhiko pana tādisāni kammāni disvā uggatacitto hoti, cittaṃ vinodetuṃpi na sakkoti, niccakālaṃ tattha nibandhacitto hoti. So cittavasiko hutvā cirakālaṃpi taṃ kammaṃ karonto bahuṃ kāyadukkhaṃvāpītiādinā chandādhipatinayena vattabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Mandapaññā ca bahujjanā tādisāni kammāni disvā nivattapaññā honti, kammānaṃ ādimpi na passanti, antapi na passanti, andhakāre pavisantā viya honti, tāni kammāni kātuṃ cittaṃpi na namati. Paññādhiko pana tādisāni kammāni disvā uggatapañño hoti, kammānaṃ ādiṃpi passati, antaṃpi passati, phalaṃpi passati, ānisaṃsaṃpi passati. Sukhena kammasiddhiyā nānāupāyaṃpi passati. So cirakālaṃpi taṃ kammaṃ karontotiādinā vīriyādhipatinayena vattabbaṃ. Idha pana mahatiyā kammavīmaṃsāyāti ca tādisiyā kamma vīmaṃsāyāti ca vattabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ loke mahantesu sudukkaresu purisakammesu paccupaṭṭhitesu ime cattāro dhammā kammasiddhiyā saṃvattanti. Imesañca catunnaṃ adhipatīnaṃ vijjamānattā loke purisavisesā nāma dissanti, sabbaññubuddhā nāma dissanti, sabbaññubodhisattā nāma dissanti, paccekabuddhā nāma dissanti, paccekabodhisattānāma dissanti, aggasāvakānāma mahāsāvakā nāma sāvakabodhisattā nāma dissanti. Lokepi evarūpānaṃ purisavisesānaṃ vasena satta lokassa atthāya hitāya sukhāya paññāsippavisesā ca paribhogavatthuvisesā ca dissantīti. Adhipatipaccayadīpanā niṭṭhitā."
  }
]