[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Sīhaḷadīpikasāsanavaṃsakathāmaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Idāni ",
      " sīhaḷadīpasāsanakathāmaggaṃ vattuṃ okāso anuppatto, tasmā taṃ vakkhāmi."
    ],
    "innerText": "2. Idāni sīhaḷadīpasāsanakathāmaggaṃ vattuṃ okāso anuppatto, tasmā taṃ vakkhāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sīhaḷadīpañhi sāsanassa patiṭṭhānabhūtattā cetiyagabbhasadisaṃ hoti. Sammāsambuddho kira sīhaḷadīpaṃ dharamānakālepi tikkhattuṃ agamāsi. Paṭhamaṃ yakkhānaṃ damanatthaṃ ekakova gantvā yakkhe dametvā mayi parinibbute sīhaḷadīpe sāsanaṃ patiṭṭhahissatīti tambapaṇṇidīpe ārakkhaṃ karonto tikkhattuṃ dīpaṃ āviñchi. Dutiyaṃ mātulabhāgineyyānaṃ nāgarā jūnaṃ damanatthāya ekakova gantvā te dametvā agamāsi. Tatiyaṃ pañcabhikkhusataparivāro gantvā mahācetiyaṭṭhāne ca thūpārāmacetiyaṭṭhāne ca mahābodhipatiṭṭhitaṭṭhāne ca mahiyaṅgaṇacetiyaṭṭhāne ca mudiṅgaṇacetiyaṭṭhāne ca dīghavāpi cetiyaṭṭhāne ca kalyāṇiyacetiyaṭṭhāne ca nirodhasamāpattiṃ samāpajjitvā nisīdi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tadā ca pana sāsanaṃ ogāhetvāna tāva tiṭṭhati. Pacchā pana yathāvuttattheraparamparāya samabhiniviṭṭhena mahāmoggaliputtatissattherena pesito mahindatthero jinacakke pañcatiṃsādhike dvisate sampatte dutiyakattikamāse iṭṭiyena uttiyena sambulena bhaddasālena cāti etehi therehi saddhiṃ sīhaḷadīpaṃ agamāsi. Soṇuttarattherādayo jinacakke pañcatiṃsādhike dvisate sampatte dutiyakattikamāseyeva sāsanassa patiṭṭhāpanatthāya attano attano sampattabhārabhūtaṃ taṃ taṃ ṭhānaṃ agamaṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Mahāmahindatthero pana sattamāsāni āgametvā jinacakke chattiṃsādhike dvisate sampatte jeṭṭhamāsassa puṇṇamiyaṃ sīhaḷadīpaṃ sāsanassa patiṭṭhāpanatthāya agamāsi. Teneva tesu navasu ṭhānesu sīhaḷadīpaṃ chattiṃsādhike dvisa te ",
      " agamāsi. Aññāni pana aṭṭha ṭhānāni pañcatiṃsādhikadvisateyeva agamāsīti visuṃva vatthapetabbo."
    ],
    "innerText": "Mahāmahindatthero pana sattamāsāni āgametvā jinacakke chattiṃsādhike dvisate sampatte jeṭṭhamāsassa puṇṇamiyaṃ sīhaḷadīpaṃ sāsanassa patiṭṭhāpanatthāya agamāsi. Teneva tesu navasu ṭhānesu sīhaḷadīpaṃ chattiṃsādhike dvisa te agamāsi. Aññāni pana aṭṭha ṭhānāni pañcatiṃsādhikadvisateyeva agamāsīti visuṃva vatthapetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kasmā pana mahāmahindatthero sattamāsāni āgametvā sabbapacchā sīhaḷadīpaṃ gacchatīti. Sīhaḷadīpe muṭabhivo nāma rājā jarādubbalo ahoti, sāsanaṃ paggahetuṃ asamattho, tassa pana putto devānaṃ piya tisso nāma rājakumāro daharo sāsanaṃ paggahetuṃ samattho bhavissati, so ca devānaṃ viyatisso rajjaṃ tāva labhatu vedissakagirinagare mātuyā saddhiṃ ñātake tāva passāmīti apekkhitvā sattamāsāni āgametvā chattiṃsādhikadvisateyeva jinacakke mahāmahindatthero sīhaḷadīpaṃ gacchatīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Mahāmahindatthero ca iṭṭiyādīhi therehi catūhi bhāgineyyena sumanasāmaṇerena bhaṇḍukena nāma upāsake na cāti etehi saddhiṃ chattiṃsādhike dvisate jinacakke jeṭṭhamāsapuṇṇamiyaṃ suvaṇṇahaṃsā viya jeṭṭhamāse nabhaṃ uggantvā ākāsamaggena anurādhapurassa puratthimadisābhāge missa kapabbatakūṭe patiṭṭhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Jeṭṭhamāsassa ca puṇṇamiyaṃ laṅkādīpe jeṭṭhamūlanakkhattasabhā hutvā manussā chaṇaṃ akaṃsu. Tenevāha sāratthadīpaniyaṃ nāma vinayaḍīkāyaṃ, jeṭṭhamāsassa puṇṇamiyaṃ jeṭṭhanakkhattaṃ mūlanakkhattaṃ vā hotīti. Tattha ca puṇṇaminakkhattaṃ rājamattante puṇṇaminakkhattavicāraṇanayena vuttanti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Devānaṃ piya tisso ca rājā nakkhattaṃ nāma ghosāpetvā chaṇaṃ kārethāti amacce āṇāpetvā cattālī sapurisasahassaparivāro nagaramhā nikkhamitvā yena missa kapabbato, tena pāyāsi migavaṃ kīḷitukāmo. Atha tasmiṃ pabbate adhivatthā ekā devatā migarūpena rājānaṃ phalobhetvā pakkositvā therassa abhimukhaṃ akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Thero ",
      " rājānaṃ āgacchantaṃ disvā mamaṃyeva rājā passatu mā itareti adhiṭṭhahitvā tissa tissa ito ehīti āha. Rājā taṃ sutvā cintesi, imasmiṃ dīpe jāto sakalopi manusso maṃ tissoti nāmaṃ gahetvā ālapituṃ samattho nāma natthi, ayaṃ pana bhinnabhinnapaṭadharo bhaṇḍukāsāva vasano maṃ nāmena ālapati, ko nukho ayaṃ bhavissati, manusso vā amanusso vāti. Thero āha,–"
    ],
    "innerText": "Thero rājānaṃ āgacchantaṃ disvā mamaṃyeva rājā passatu mā itareti adhiṭṭhahitvā tissa tissa ito ehīti āha. Rājā taṃ sutvā cintesi, imasmiṃ dīpe jāto sakalopi manusso maṃ tissoti nāmaṃ gahetvā ālapituṃ samattho nāma natthi, ayaṃ pana bhinnabhinnapaṭadharo bhaṇḍukāsāva vasano maṃ nāmena ālapati, ko nukho ayaṃ bhavissati, manusso vā amanusso vāti. Thero āha,–"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Samaṇā mayaṃ mahārāja, dhammarājassa sāvakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Taveva anukampāya, jambudīpā idhāgatāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tadā ca devānaṃ piyatisso rājā asokaraññā pesitena abhisekena ekamāsābhisitto ahosi. Visākhapuṇṇamāyaṃ hissa abhisekamakaṃsu. So ca asokaraññā pesite dhammapaṇṇākāre ratanattayaguṇappaṭisaṃyuttaṃ sāsanappavattiṃ acirasutaṃ anussaramāno taṃ therassa samaṇā mayaṃ mahārāja, dhammarājassa sāvakāti vacanaṃ sutvā ayyā nukho āgatāti tāvadeva āvudhaṃ nikkhipitvā ekamantaṃ nisīdi sammodanīyaṃ kathaṃ kathayamāno. Yathāha,–"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āvudhaṃ nikkhipitvāna, ekamantaṃ upāvisi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nisajja rājā sammodi, bahuṃ atthūpasañhitanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sammodanīyaṃ kathañca kurumāneyeva tasmiṃ tānipi cattālīsapurisasahassāni āgantvā samparivāresuṃ. Tadāthero itarepi cha jane dassesi. Rājā disvā ime kadā āgatāti āha. Mayā saddhiṃyeva mahārājāti. Idāni pana jambudīpe aññepi evarūpā samaṇā santīti. Santi ",
      " mahārāja etarahijambudīpo kālāvapajjoto isivātapaṭivāto, tasmiṃ–"
    ],
    "innerText": "Sammodanīyaṃ kathañca kurumāneyeva tasmiṃ tānipi cattālīsapurisasahassāni āgantvā samparivāresuṃ. Tadāthero itarepi cha jane dassesi. Rājā disvā ime kadā āgatāti āha. Mayā saddhiṃyeva mahārājāti. Idāni pana jambudīpe aññepi evarūpā samaṇā santīti. Santi mahārāja etarahijambudīpo kālāvapajjoto isivātapaṭivāto, tasmiṃ–"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tevijjā iddhipattā ca, cetopariyakovidā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khīṇāsavā arahanto, bahū buddhassa sāvakāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhante kena āgatatthāti. Neva mahārāja udakena, na thalenāti. Rājā ākāsena āgatāti aññāsi. Thero atthi nukho rañño passāveyyattikanti vīmaṃsanatthāya āsannaṃ ambarukkhaṃ ārabbha pañhaṃ pucchi, –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kinnāmo mahārāja ayaṃ rukkhoti. Ambarukkho nāma bhanteti. Imaṃ pana mahārāja ambaṃ muñcitvā añño ambo atthi vā natthi vāti. Atthi bhante aññepi bahū ambarukkhāti. Imañca ambaṃ te ca ambe muñcitvā atthi nukho mahārāja aññe rukkhāti. Atthi bhante, te pana na ambarukkhāti. Aññe ca ambe anambe ca muñcitvā atthi pana añño rukkhoti. Ayameva bhante amba rukkhoti. Sādhu mahārāja paṇḍitosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atthi pana mahārāja te ñātakāti. Atthi bhante bahūjanāti. Te muñcitvā keci aññātakāpi atthi mahārājāti. Aññātakā bhante ñātakehi bahutarāti. Tavañātake ca aññātake ca muñcitvā atthañño koci mahārājāti. Ahameva bhanteti. Sādhu mahārāja attā nāma attano neva ñātako na aññātakoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha thero paṇḍito rājā sakkhissati dhammaṃ aññātunti cūḷahatthipadopamasuttaṃ kathesi. Kathāpariyosāne rājā tīsu saraṇesu patiṭṭhahi saddhiṃ cattālīsāya pāṇasahassehīti. Tato paraṃ yaṃ yaṃ vattabbaṃ, taṃ taṃ samantapāsādikādīsu vuttanayena veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iccevaṃ sīhaḷadīpe sāsanānuggahaṇa mahindattherato āgatā ",
      " sissaparamparā bahū honti, gaṇanapathaṃ vīti vattā. Kathaṃ. Mahāmahindattherassa sisso ariṭṭho nāma thero, tassa sisso tissadatto, tassa sisso kāḷasumano, tassa sisso dīgho, tassa sisso dīgha sumano, tassa sisso kāḷasumano, tassa sisso nāgo, tassa sisso buddharakkhito, tassa sisso tisso, tassa sisso revo, tassa sisso sumano, tassa sisso cūḷanāgo, tassa sisso dhammapāli etā, tassa sisso khemo, tassa sisso upalisso, tassa sisso phussadevo, tassa sisso sumano, tassa sisso mahāpadumo, tassa sisso mahāsīvo, tassa sisso upāli, tassa sisso mahānāgo, tassa sisso abhayo, tassa sisso tisso, tassa sisso sumano, tassa sisso cūḷābhayo, tassa sisso tisso, tassa sisso cūḷadevo, tassa sisso sīvoti. Ayaṃ yāva potthakāruḷasaṅkhātā catutthasaṅgītikā, tāva theraparamparāti daṭṭhabbā."
    ],
    "innerText": "Iccevaṃ sīhaḷadīpe sāsanānuggahaṇa mahindattherato āgatā sissaparamparā bahū honti, gaṇanapathaṃ vīti vattā. Kathaṃ. Mahāmahindattherassa sisso ariṭṭho nāma thero, tassa sisso tissadatto, tassa sisso kāḷasumano, tassa sisso dīgho, tassa sisso dīgha sumano, tassa sisso kāḷasumano, tassa sisso nāgo, tassa sisso buddharakkhito, tassa sisso tisso, tassa sisso revo, tassa sisso sumano, tassa sisso cūḷanāgo, tassa sisso dhammapāli etā, tassa sisso khemo, tassa sisso upalisso, tassa sisso phussadevo, tassa sisso sumano, tassa sisso mahāpadumo, tassa sisso mahāsīvo, tassa sisso upāli, tassa sisso mahānāgo, tassa sisso abhayo, tassa sisso tisso, tassa sisso sumano, tassa sisso cūḷābhayo, tassa sisso tisso, tassa sisso cūḷadevo, tassa sisso sīvoti. Ayaṃ yāva potthakāruḷasaṅkhātā catutthasaṅgītikā, tāva theraparamparāti daṭṭhabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vuttañhetaṃ aṭṭhakathāyaṃ,– yāvajjabhanā tesaṃyeva antevāsikaparamparabhūtāya ācariyaparamparāya ābhatantiti veditabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ tesaṃ sissaparamparabhūtā ācariyaparamparā yāvajjatanā sāsane pākaṭā hutvā āgacchantīti veditabba."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sāsane vinayadharehi nāma tilakkhaṇasampannehi bhavitabbaṃ. Tīṇi hi vinayadharassa lakkhaṇāni icchi tabbāni. Katamāni tīṇi. Suttañcassa svāgataṃ hoti suppavatti suvinicchitaṃ suttato anubyañjanatoti idamekaṃ lakkhaṇaṃ, vinaye kho pana ṭhito hoti asaṃhīroti idaṃ dutiyaṃ, ācariyaparamparā kho panassa suggahitā hoti sumanasikatā supadhāritāti idaṃ tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " ācariyaparamparā kho panassa suggahitā hotīti theraparamparā vaṃsaparamparā cassa suṭṭhugahitā hoti. Sumanasikatāti suṭṭhu manasikatā, āvajjitamatte ñajjali tappadīpo viya hoti."
    ],
    "innerText": "Tattha ācariyaparamparā kho panassa suggahitā hotīti theraparamparā vaṃsaparamparā cassa suṭṭhugahitā hoti. Sumanasikatāti suṭṭhu manasikatā, āvajjitamatte ñajjali tappadīpo viya hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Supadhāritāti suṭṭhu upadhāritā, pubbāparānusandhito atthato kāraṇato ca upa dhāritā. Attano matiṃ pahāya ācariyasuddhiyā vattā hoti, mayhaṃ ācariyo asukācariyassa santike uggaṇhi, so asukassāti evaṃ sabbaṃ ācariyaparamparaṃ thera vādaṅgaṃ āharitvā yāva upālitthero sammāsambuddhassa santike uggaṇhīti pāpetvā ṭhapeti. Tatopi āharitvā upālitthero sammāsambuddhassa santike uggaṇhi, dāsakatthero attano upajjhāyassa upālittherassa, soṇakatthero attano upajjhāyassa dosakattherassa, siggavatthero attano upajjhāyassa soṇakattherassa, moggaliputtatissatthero attano upajjhāyassa siggavattherassa caṇḍa vajjittherassa cāti evaṃ sabbaṃ ācariyaparamparaṃ theravādaṅgaṃ āharitvā attano ācariyaṃ pāpetvā ṭhapeti. Evaṃ uggahitā hi ācariyaparamparā suggahitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ asakkontena pana dve tayo parivaṭṭā uggahetabbā. Sabbapacchimena hi nayena yathā ācariyo ca ācariyācariyo ca pāḷiñca paripuñchañca vadanti, tathā ñātuṃ vattatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathā vuttattheraparamparā pana bhagavato dharamānakālato paṭṭhāya yāva potthakāruḷā mukhapāṭheneva piṭakattayaṃ dhāresuṃ, paripuṇṇaṃ pana katvā potthake likhitvā na ṭhapenti. Evaṃ mahātherā dukkarakammaṃ katvā sāsanaṃ paggaṇhiṃsu. Tatridaṃ vatthu,–"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sīhaḷadīpe kira caṇḍālatissabhayena saṅkhubbhitvā devo ",
      " ca avassitvā dubbhikkhabhayaṃ uppajji. Tadā akko devānamindo āgantvā tumhe bhante piṭakaṃ dhāretuṃ na sakkhissatha, nāvaṃ pana ārūhitvā jambudīpaṃ gacchatha, sace nāvā appahonakā bhaveyya, kaṭṭhena vā veḷunā vā taratha, abhayatthāya pana mayaṃ rakkhissāmāti āha."
    ],
    "innerText": "Sīhaḷadīpe kira caṇḍālatissabhayena saṅkhubbhitvā devo ca avassitvā dubbhikkhabhayaṃ uppajji. Tadā akko devānamindo āgantvā tumhe bhante piṭakaṃ dhāretuṃ na sakkhissatha, nāvaṃ pana ārūhitvā jambudīpaṃ gacchatha, sace nāvā appahonakā bhaveyya, kaṭṭhena vā veḷunā vā taratha, abhayatthāya pana mayaṃ rakkhissāmāti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tadā saṭṭhimattā bhikkhū samuddatīraṃ gantvā puna etadahosi,– mayaṃ jambudīpaṃ na gacchissāma, idheva vasitvā tepiṭakaṃ dhārissāmāti. Tato pacchā nāvā titthato nivattitvā sīhaḷadīpekadesaṃ malayajanapadaṃ gantvā mūlaphalādīhiyeva yāpetvā sajjhāyaṃ akaṃsu. Chātakabhayena atipīḷitā hutvā evampi kātuṃ asakkonto vāḷukatale uraṃ ṭhapetvā sīsena sīsaṃ abhimukhaṃ katvā vācaṃ anicchāretvā manasāyeva akaṃsu. Evaṃ dvādasavassāni saddhiṃ aṭṭhakathāya tepiṭakaṃ rakkhitvā sāsanaṃ anuggahesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dvādasavassesu pana atikkantesu taṃ bhayaṃ vūpasamitvā pubbe jambudīpaṃ gacchantā sattabhikkhusatā āgantvā sīhaḷadīpekadesaṃ rāmajanapade maṇḍalārāmavihāraṃ āpajjiṃsu. Tepi saṭṭhimattā bhikkhū tameva vihāraṃ gantvā aññamaññaṃ sammantetvā sajjhāyiṃsu. Tadā aññamaññaṃ samenti, na virujjhanti, gaṅgādakena viya yamunodakaṃ saṃsandenti. Evaṃ piṭakattayaṃ mukhapāṭheneva dhāretvā mahātherā dukkarakammaṃ karontīti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yampi pariyattiṃ ekapadamattampi avirajjhitvā dhārenti, taṃ dukkarakammameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sīhaḷadīpe kira punabbasukassa nāma kuṭumbikassa putto tissatthero buddhavacanaṃ uggaṇhitvā imaṃ jambudīpaṃ āgantvā yonakadhammarakkhitattherassa santike buddhavacanaṃ uggaṇhitvā gacchanto nāvaṃ abhirūhanatitthe ekasmiṃ pade uppannakaṅkho yojanasatamaggaṃ nivattitvā ācariyassa santikaṃ āgacchanto ",
      " antarāmagge ekassa kuṭumbikassa pañhaṃ kathesi. So pasīditvā satasahassagghanakaṃ kampalaṃ adāsi. Sopi taṃ āharitvā ācariyassa adāsi. Thero vā siyā koṭṭetvā nisīdanaṭṭhāne paribhaṇḍaṃ kāresi. Kimatthāyāti. Pacchimāya janatāya anuggahatthāya. Evaṃ kirassa ahosi,– amhākaṃ gatamaggaṃ āvajjitvā anāgate sabrahmacārino paṭipattiṃ pūretabbaṃ maññissantīti. Tissattheropi ācariyassa santike kaṅkhaṃ chinditvā sīhaḷadīpameva sakaṭṭhānaṃ āgamāsīti. Iccevaṃ pariyattiṃ ekapadamattampi avirajjhitvā dhāraṇampi dukkarakammamevāti daṭṭhabbaṃ."
    ],
    "innerText": "Sīhaḷadīpe kira punabbasukassa nāma kuṭumbikassa putto tissatthero buddhavacanaṃ uggaṇhitvā imaṃ jambudīpaṃ āgantvā yonakadhammarakkhitattherassa santike buddhavacanaṃ uggaṇhitvā gacchanto nāvaṃ abhirūhanatitthe ekasmiṃ pade uppannakaṅkho yojanasatamaggaṃ nivattitvā ācariyassa santikaṃ āgacchanto antarāmagge ekassa kuṭumbikassa pañhaṃ kathesi. So pasīditvā satasahassagghanakaṃ kampalaṃ adāsi. Sopi taṃ āharitvā ācariyassa adāsi. Thero vā siyā koṭṭetvā nisīdanaṭṭhāne paribhaṇḍaṃ kāresi. Kimatthāyāti. Pacchimāya janatāya anuggahatthāya. Evaṃ kirassa ahosi,– amhākaṃ gatamaggaṃ āvajjitvā anāgate sabrahmacārino paṭipattiṃ pūretabbaṃ maññissantīti. Tissattheropi ācariyassa santike kaṅkhaṃ chinditvā sīhaḷadīpameva sakaṭṭhānaṃ āgamāsīti. Iccevaṃ pariyattiṃ ekapadamattampi avirajjhitvā dhāraṇampi dukkarakammamevāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yampi yebhuyyena paguṇaṃ na karonti, tassa anantaradhānatthāya asammosatthāya uggahadhāraṇādivasena rakkhanampi karonti, taṃ dukkarakammameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sīhaḷadīpeyeva kira mahābhaye ekasseva bhikkhuno mahāniddeso paguṇo ahosi. Atha catunikāyikatissattherassa upajjhāyo mahātipiṭakatthero nāma mahārakkhitattheraṃāha,– āvuso mahārakkhita asukassa santike mahāniddesaṃ gaṇhāhīti. Pāpokirāyaṃ bhante na gaṇhāmīti. Gaṇhāvuso ahaṃ te santike nisīdissāmīti. Sādhu bhante tumhesu nisinnesu gaṇhissāmīti paṭṭhapatvā rattindivaṃ nirantaraṃ pariyāpuṇanto osānadivase heṭṭhāmañce itthiṃ disvā bhante sutaṃyeva me pubbe, sacāhaṃ evaṃ jāneyyaṃ, na īdisassa santike dhammaṃ pariyāpuṇeyyanti āha. Tassa pana santike bahū mahātherā uggaṇhitvā mahāniddesaṃ patiṭṭhāpesuṃ. Evaṃ yaṃ yebhuyyena paguṇaṃ na karonti, tassa anantaradhānatthāya asammosattāya uggahadhāraṇādivasena rakkhanampi dukkarakammaṃ yevāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iccevaṃ bhagavato dharamānakālato pabhuti cirakālaṃ yathāvuttamahātheraparamparā pariyattiṃ mukhapāṭheneva dhāresuṃ ",
      ". Ahovata porāṇikānaṃ mahātherānaṃ satipaññāsamādhivepullatāya hi te mukhapāṭheneva dhāretu sakkāti. Mukhapāṭheneva porāṇakattherānaṃ pariyattidhāraṇaṃ pañcanavutādhikāni catusatāni ahosi."
    ],
    "innerText": "Iccevaṃ bhagavato dharamānakālato pabhuti cirakālaṃ yathāvuttamahātheraparamparā pariyattiṃ mukhapāṭheneva dhāresuṃ . Ahovata porāṇikānaṃ mahātherānaṃ satipaññāsamādhivepullatāya hi te mukhapāṭheneva dhāretu sakkāti. Mukhapāṭheneva porāṇakattherānaṃ pariyattidhāraṇaṃ pañcanavutādhikāni catusatāni ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhagavato parinibbānato mahāvaṃsasāratthasaṅgahesu āgatanayena jinacakke paṇṇāssādhike catusate sampatte tambapaṇṇidīpe rājūnaṃ aṭṭhārasamako’saddhātissassa nāma rañño putto vaṭṭagāmaṇi nāma rājā rajjaṃ patvā chavassakāle anāgate sattā hīnasatipaññāsamādhikā hutvā na sakkhissanti mukhapāṭhena dhāretunti upaparikkhitvā pubbe vuttehi mahātherehi anupubbena āgatā pañcamattā mahātherasatā vaṭṭagāmaṇirājānaṃ nissāya tambapaṇṇidīpekadese malayajanapade ālokaleṇe aṭṭhakathāya sahapiṭakattayaṃ potthake āropesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tañca yathāvuttasaṅgītiyo upanidhāya catutthasaṅgītiyeva nāmāti veditabbā. Vuttañhetaṃ sāratthadīpaniyaṃ nāma vinayaṭīkāyaṃ,– catutthasaṅgītisadisā hi potthakārohasaṅgītīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sīhaḷadīpe pana vaṭṭagāmaṇirājā marammaraṭṭhe sirikhettanagare eko nāma kukkuṭasīsarājā ca ekakālena rajjaṃ kāresi. Amarapuramāpakassa rañño kāle sīhaḷadīpabhikkhuhi idha pesitasandesakathāyaṃ pana tettiṃsādhikacatusate sampatte potthakāruḷaṃ akaṃsūti āgataṃ. Vuttañhetaṃ tattha,– tettiṃsādhikacatuvassasataparimāṇakālanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Idaṃ sīhaḷadīpe yāva potthakāruḷhā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sāsanassa patiṭṭhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athāparaṃ ",
      " jambudīpe sīhaḷadīpe ca bhikkhū visuṃ visuṃ gaṇavasena bhijjiṃsu, yathā anotattadahato nikkhamananadiyā gaṅgāyamunādivasena bhijjantīti. Tattha jambudīpe gaṇānaṃ bhijjamānataṃ upariyeva vakkhāma."
    ],
    "innerText": "Athāparaṃ jambudīpe sīhaḷadīpe ca bhikkhū visuṃ visuṃ gaṇavasena bhijjiṃsu, yathā anotattadahato nikkhamananadiyā gaṅgāyamunādivasena bhijjantīti. Tattha jambudīpe gaṇānaṃ bhijjamānataṃ upariyeva vakkhāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sīhaḷadīpe pana gaṇānaṃ bhijjamānatā evaṃ daṭṭhabbā. Kathaṃ. Sīhaḷadīpe hi sāsanassa patiṭṭhamānakālato aṭṭhārasādhi kadvivassasate sampatte vaṭṭagāmaṇiraññā kārāvite abhayagirivihāre parivārakhandhakaṃ pāṭhato ca atthato ca vipallāsaṃ katvā mahāvihāravāsigaṇato puthu hutvā eko gaṇo bhijji, so abhayagirivāsigaṇo nāma, dhammarucigaṇoti ca tasseva nāmaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abhayagirivāsigaṇassa bhijjamānato dvecattālīsādhikativassasate sampatte mahāsenena nāma raññā kārāpite jetavanavihāre bhikkhū ubhatovisaṅgapāṭhe viparītavasena abhisaṅkharitvā abhayagirivāsigaṇato visuṃ eko gaṇo ahosi, so jetavanavāsigaṇo nāma, sāgaliyagaṇoti ca tasseva nāmaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Jetavana vāsigaṇassa bhijjamānakālato ekapaññāsavassādhikānaṃ tiṇṇaṃ vassasatānaṃ upari kurundavāsino ca kolambavāsino ca bhikkhū bhāgineyyaṃ dāṭhāpatiṃ nāma rājānaṃ nissāya ubhatovibhaṅgaparivārakhandhakapāṭhe viparītavasena abhisaṅkharitvā vuttehi dvīhi gaṇehi visuṃ hutvā mahāvihāra vāsigaṇhattamaṃ tulayitvā upadhāretvā mahāvihāranāmaṃ gahetvā eko gaṇo bhijji. Evaṃ sīhaḷadīpe mahāmahindattherādīnaṃ vaṃsabhūtena mahāvihāravāsi gaṇena saddhiṃ cattāro gaṇā bhijjiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha mahāvihāravāsi gaṇoyeva eko dhammavādī ahosi, sesā pana adhammavādino. Te ca tayo adhammavādino gaṇā bhūtatthaṃ pahāya abhūtatthena dhammaṃ agaruṃ katvā cariṃsūti ",
      " vacanato sīhaḷadīpe adhammavādino tayopi alajjino gaṇā parimaṇḍalasuppaṭicchannādisikkhāpadāni anādiyitvā vicariṃsu. Tato paṭṭhāya sāsane ekaccānaṃ bhikkhūnaṃ nānappakāravasena nivāsanapārupanādīni dissantiti veditabbaṃ."
    ],
    "innerText": "Tattha mahāvihāravāsi gaṇoyeva eko dhammavādī ahosi, sesā pana adhammavādino. Te ca tayo adhammavādino gaṇā bhūtatthaṃ pahāya abhūtatthena dhammaṃ agaruṃ katvā cariṃsūti vacanato sīhaḷadīpe adhammavādino tayopi alajjino gaṇā parimaṇḍalasuppaṭicchannādisikkhāpadāni anādiyitvā vicariṃsu. Tato paṭṭhāya sāsane ekaccānaṃ bhikkhūnaṃ nānappakāravasena nivāsanapārupanādīni dissantiti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Adhammavādigaṇānaṃ bhijjamānakālato sattavīsādhikānaṃ pañcasatānaṃ vassānañca upari sirisaṅghabodhi nāma rājā mahāvihāra gaṇassa pakkho hutvā adhammavādinā tayo gaṇe niggahitvā jinasāsanaṃ paggahesi. So ca sirisaṅgha bodhirājā amhākaṃ marammaraṭṭhe arimandananagare anuruddhena nāma raññā samakālavasena rajjasampattiṃ anubhavi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato pacchā sīhaḷadīpe vohārakatissassa nāma rañño kāle kapilena nāma amaccena saddhiṃ mantetvā mahāvihāra vāsino bhikkhū nissāya adhammavādigaṇe niggaṇhitvā jinasāsanaṃ paggaṇhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato pacchā ca goṭṭhābhayassa nāma rañño kāle abhayagiri vāsino bhikkhū parasamuddaṃ pabbājetvā mahāvihāra vāsino bhikkhū nissāya sāsanaṃ visodhayi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato pacchāpi goṭṭhābhayarañño puttabhūtassa mahāsenassa nāma rañño kāle abhayagirivāsīnaṃ bhikkhūnaṃ abbhantare saṅghamitto nāma eko bhikkhu rañño padhānācariyo hutvā mahāmahindattherādīnaṃ arahantānaṃ nivāsaṭṭhānabhūtaṃ mahāvihārārāmaṃ vinassituṃ mahāsenaraññā mantetvā ārabhi. Tadā navavassāni mahāvihāre bhikkhu sañño ahosi. Ahovata mahātherānaṃ mahiddhikānaṃ nivāsaṭṭhānaṃ alajjino bhikkhū vinassāpesuṃ, suvaṇṇahaṃssānaṃ nivāsaṭṭhānaṃ kākā viyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Jetavanavāsīnañca bhikkhūnaṃ abbhantare eko tisso nāma bhikkhu teneva raññā mantetvā mahāvihāre sīmaṃ samūhani ",
      ". Achekattā pana tesaṃ sīmasamūhanakammaṃ na sampajjīti. Ahovata dussīlānaṃ pāpakānaṃ kammaṃ acchariyaṃ, seyyathāpi nāma sākhamigo aggaggho kāsivatthaṃ mahagghaṃ bhinnati, evameva bhinditabbavatthunā bhedakapuggalo ativiya dūro ahosīti. Bhavanti cettha, –"
    ],
    "innerText": "Jetavanavāsīnañca bhikkhūnaṃ abbhantare eko tisso nāma bhikkhu teneva raññā mantetvā mahāvihāre sīmaṃ samūhani . Achekattā pana tesaṃ sīmasamūhanakammaṃ na sampajjīti. Ahovata dussīlānaṃ pāpakānaṃ kammaṃ acchariyaṃ, seyyathāpi nāma sākhamigo aggaggho kāsivatthaṃ mahagghaṃ bhinnati, evameva bhinditabbavatthunā bhedakapuggalo ativiya dūro ahosīti. Bhavanti cettha, –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yathā sākhamigo pāpo, appagghoyeva kāsikaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mahagghaṃ kacca bhinnaṃbhinnaṃ, mahussāhena chindati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Evaṃ adhammavādī pāpo, dhammavādigaṇaṃ subhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mahussāhena bhindayi, aho acchariyo ayaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ārakā dūrato āsuṃ, bhinditabbehi bhedakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhūmitova bhavagganto, aho kammaṃ ajānatanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iccevaṃ adhammavādigaṇānaṃ balavatāya dhammavādigaṇo parihāyati. Yathā hi gijjhasakuṇassa pakkhavātena suvaṇṇahaṃsā pakatiyā ṭhātuṃ na sakkonti, evameva adhammavādīnaṃ balavatāya dhammavādī parihāyati. Byagghavane viya suvaṇṇamigo nillayitvā gocaraṃ gaṇhāti, yathārucivasena dhammaṃ carituṃ okāsaṃ na labhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sīhaḷadīpe sāsanassa patiṭṭhānato dvisattatādhikānaṃ catusatānaṃ vassasahassānañca upari sammāsambuddhassa parinibbānato aṭṭhasattasatādhikānaṃ vassasahassānaṃ upari mahārājā nāma bhūpālo rajjaṃ kāresi. So pana rājā ñadumbaragirivāsikassapattheraggamukhā mahāvihāravāsino bhikkhū tameva rājānaṃ nissāya sāsane malaṃ visodhesuṃ, yathā heraññiko hiraññe malanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Mahāvihāravāsigaṇato aññe adhammavādinā uppabbā jetvā ",
      " visodhesuṃ. So ca mahārājā amhākaṃ marammaraṭṭhe arimaddananagare narapaticaññisūnā nāma raññā samakāla vasena rajjaṃ kāresīti veditabbo."
    ],
    "innerText": "Mahāvihāravāsigaṇato aññe adhammavādinā uppabbā jetvā visodhesuṃ. So ca mahārājā amhākaṃ marammaraṭṭhe arimaddananagare narapaticaññisūnā nāma raññā samakāla vasena rajjaṃ kāresīti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato pacchā vi vijayabāhurājānaṃ parakkamabāhurājānañca nissāya mahāvihāra vāsino bhikkhū sāsanaṃ parisuddhaṃ akaṃsu, adhammavādino sabbepi uppabbājetvā mahāvihāravāsigaṇoyeva eko patiṭṭhahi, yathā abbhādiupakkilesamalehi vimutto nisānāthoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sirisaṅghabodhirājā vohārikatissarājā goṭṭhābhayarājāti ete rājāno sāsanaṃ visodhentopi sabbena sabbaṃ adhammavādigaṇānaṃ avinassanato sāsanaṃ parisuddhaṃ na tāva ahosi. Sirisaṅghabodhirañño mahārañño vijayabāhurañño parakkamabāhuraññoti etesaṃyeva rājūnaṃ kāle sabbena sabbaṃ adhammavādīnaṃ vinassanato sāsanaṃ parisuddhaṃ ahosi. Tadā pana adhammavādinā sīsampi uṭṭhahituṃ na sakkā, yathā aruṇugge kosiyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Aparabhāge pana ciraṃ kālaṃ atikkante micchādiṭṭhikānaṃ vijātiyānaṃ bhayena laṅkādīpe sāsanaṃ osakkitvā gaṇapūraṇamattassapi bhikkhusaṅghassa avijjamānatāya mahāvijayabāhurañño kāle rāmaññadesato saṅghaṃ ānetvā sāsanaṃ patiṭṭhāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato pacchā ca vimaladhammasūriyassa nāma rañño kāle rakkhāpuraraṭṭhato saṅghaṃ ānetvā sāsanaṃ patiṭṭhāpesi. Tato pacchā ca vimalassa nāma rañño kāle tatoyeva saṅghaṃ ānetvā sāsanaṃ patiṭṭhāpesi. Tato pacchā ca kittissirirājasīhassa nāma rañño kāle syāmaraṭṭhato saṅghaṃ ānetvā tatheva akāsīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ayaṃ sīhaḷadīpe sāsanassa osakkanakathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato ",
      " pacchā jinasāsane navutādhike aṭṭhavassasate sampatte buddhadāsassa nāma rañño kāle eko dhamma kathikatthero ṭhapetvā vinayapiṭakaṃ abhidhammapiṭakañca avasesaṃ suttantapiṭakaṃ sīhaḷabhāsāya parivattitvā abhisaṅkharitvā ṭhapesi. Tañca kāraṇaṃ cūḷavaṃse vuttaṃ."
    ],
    "innerText": "Tato pacchā jinasāsane navutādhike aṭṭhavassasate sampatte buddhadāsassa nāma rañño kāle eko dhamma kathikatthero ṭhapetvā vinayapiṭakaṃ abhidhammapiṭakañca avasesaṃ suttantapiṭakaṃ sīhaḷabhāsāya parivattitvā abhisaṅkharitvā ṭhapesi. Tañca kāraṇaṃ cūḷavaṃse vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassa kira buddhadāsassa rañño puttā asītimattā asītimahāsāvakānaṃ nāmeneva vohāritā ahesuṃ. Tesu puttesu sāriputtattherassa nāmena vohārito eko upatisso nāma rājakumāro pitari devaṅgate dvecattālīsavassāni rajjaṃ karesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato pacchā kaniṭṭho mahānāmo nāma rājakumāro dvāvīsavassāni rajjaṃ kāresi. Tassa rañño kāle jina cakke tettiṃsādhikanavasatavasse sīhaḷadīpe chasaṭṭhimattānaṃ rājūnaṃ pūraṇakāle buddhaghoso nāma thero sīhaḷadīpaṃ gantvā sīhaḷabhāsāya likhite aṭṭhakathāganthe māgadhabhāsāya parivattitvā likhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So pana mahānāma rājā amhākaṃ marammaraṭṭhe siripaccayanagare savilaññikrovi nāmakena raññā samakālo hutvā rajjaṃ kāresi. Parittaniddāne pana brūmavi?Thī? Nāmakena raññā samakālo hutvā rajjaṃ kāresīti vuttaṃ. Taṃ na yujjatiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sīhaḷadīpe pana kittissirimegho nāma rājā hutvā navame vasse tasmiṃyeva dīpe rājūnaṃ dvāsaṭṭhimattānaṃ pūraṇakāle jinacakke tiṃsādhike aṭṭhasatavasse jambudīpe kaliṅgapurato kuhasivassa nāma rañño jāmātā dantakumāro hemamālaṃ nāma rājadhītaṃ gahetvā dāṭhādhātuṃ thenetvā navāya taritvā sīhaḷadīpaṃ agamāsi. Jinacakke tiṃsādhikaaṭṭhavassasate jeṭṭhatissarājā navavassāni rajjaṃ kāresi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Buddhadāsarājā ",
      " ekūnatiṃsati vassāni upalissarājā cadvicattālīsavassāni mahānāmarājā dvāvīsavassānīti sabbāni sampiṇḍitvā jinasāsanaṃ dvattiṃsādhikanavavassasatappamāṇaṃ hoti."
    ],
    "innerText": "Buddhadāsarājā ekūnatiṃsati vassāni upalissarājā cadvicattālīsavassāni mahānāmarājā dvāvīsavassānīti sabbāni sampiṇḍitvā jinasāsanaṃ dvattiṃsādhikanavavassasatappamāṇaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmiñca kāle yadā dvīhi vassehi ūnaṃ ahosi, tadā mahānāmarañño kāle tiṃsādhikanavavassasatamatte sāsane buddhaghoso nāma thero laṅkādīpaṃ agamāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Amarapuramāpakassa rañño kāle sīhaḷadīpikehi bhikkhūhi pesitasannesapaṇṇe pana chapaṇṇāsādhikanavavassasatātikkante sūti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha ṭhatvā buddhaghosattherassa aṭṭhuppattiṃsaṅkhepamattaṃ vakkhāma. Kathaṃ. Sīhaḷabhāsakkharehi parivattitaṃ pariyattisāsanaṃ māgadhasāsakkharena ko nāma puggalo parivattituṃ sakkhissatīti mahātherā nimantayitvā tāvatiṃsabhavanaṃ gantvā ghosaṃ devaputtaṃ disvā saddhiṃ sakkena devānamindena taṃ yācitvā bodhirukkhasamīpe ghosagāme kesassa nāma brāhmaṇassa kesiyā nāma brāhmaṇiyā kucchimhi paṭisandhiṃ gaṇhāpesuṃ. Khādatha bhonto pivatha bhontotiādinā brāhmaṇānaṃ aññamaññaṃ ghosakāle vijāyanattā ghosoti nāmaṃ akāsi. Sattavassikakāle so tiṇṇaṃ vedānaṃ pāragū ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho ekena arahantena saddhiṃ vedakathaṃ sallapanto taṃ kathaṃ niṭṭhāpetvā kusalā dhammā akusalā dhammā abyākatā dhammātiādinā paramatthavedaṃ nāma buddhamantaṃ pucchi. Tadā so sutvā uggaṇhitukāmo hutvā tassa arahantassa santike pabbajitvā devasikaṃ devasikaṃ piṭakattayaṃ saṭṭhimattehi padasahassehi sajjhāyaṃ akāsi, vācuggataṃ akāsi. Ekamāseneva tiṇṇaṃ piṭakānaṃ pāragū ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato ",
      " paccā raho ekakova nisinnassa etadahosi,– buddhabhāsite piṭakattaye mama vā paññā adhikā, udāhu upajjhāyassa vāti. Taṃ kāraṇaṃ ñatvā upajjhācariyo niggahaṃ katvā ovadi. So saṃvegappatto hutvā khamāpetuṃ vandi. Upajjhācariyo tvaṃ āvuso sīhaḷadīpaṃ gantvā piṭakattayaṃ sīhaḷassāsakkharena likhitaṃ māgadhabhāsakkharena likhāhi, evaṃ sati ahaṃ khamissāmīti āha."
    ],
    "innerText": "Tato paccā raho ekakova nisinnassa etadahosi,– buddhabhāsite piṭakattaye mama vā paññā adhikā, udāhu upajjhāyassa vāti. Taṃ kāraṇaṃ ñatvā upajjhācariyo niggahaṃ katvā ovadi. So saṃvegappatto hutvā khamāpetuṃ vandi. Upajjhācariyo tvaṃ āvuso sīhaḷadīpaṃ gantvā piṭakattayaṃ sīhaḷassāsakkharena likhitaṃ māgadhabhāsakkharena likhāhi, evaṃ sati ahaṃ khamissāmīti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Buddhaghoso ca pitaraṃ micchādiṭṭhibhāvato mocetvā ācariyassa vacanaṃ sirasā paṭiggahetvā piṭakattayaṃ likhituṃ sīhaḷadīpaṃ nāvāya agamāsi. Tadā samuddamajjhe tīhi divasehi tarante buddhadattatthero ca sīhaḷadīpato nāvāya āgacchanto antarāmagge devāna ānubhāvena aññamaññaṃ passitvā kāraṇaṃ pucchitvā jāni. Jānitvā ca buddhadattatthero evamāha,- mayā āvuso kato jinālaṅkāro appassāroti maññitvā piṭakattayaṃ parivattituṃ likhituṃ okāsaṃ nādāsuṃ, tvaṃ pana piṭakattayaṃ saṃvaṇṇehīti vatvā attano sakkena devānamindena dinnaṃ haritakiphalaṃ ayomayalekhana daṇḍaṃ nisitasilañca buddhaghosattherassa adāsi. Evaṃ tesaṃ dvinnaṃ therānaṃ aññamaññaṃ sallapantānaṃyeva nāvā sayameva apanetvā gacchiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Buddhaghosatthero ca sīhaḷadīpaṃ patvā paṭhamaṃ saṅghapālattheraṃ passitvā piṭakattayaṃ māgadhabhāsakkharena parivattetuṃ āgatomhīti kāraṇaṃ ārocetvā sīhaḷabhikkhū ca sīle patiṭṭhāyātiādigāthaṃ niyyādetvā imissā gāthāya atthaṃ piṭakattayaṃ āloletvā saṃvaṇṇehīti uyyojesuṃ, tasmiṃyeva divase sāyanhakālato paṭṭhāya yathāvuttagāthaṃ pamukhaṃ katvā visuddhimaggaṃ akāsi. Katvā taṃ kammaṃ nipphādetvā tassa ñāṇappabhavaṃ vīmaṃsetukāmo devānamindo tañca ganthaṃ antaradhāpesi. Punāpi thero akāsi ",
      ". Tatheva devānamindo antaradhāpesi. Punāpi thero akāsi. Evaṃ tikkhattuṃ kārāpetvā pubbaganthepi dassesi. Tiṇṇampi ganthānaṃ aññamaññaṃ ekapadamattenapi visesatā natthi saṅghapālatthero ca taṃ ārādhayitvā piṭakattayaṃ niyyādesi. Evaṃ visuddhimagge saṅghapālattherassa yācanaṃ ārabbha visuddhimaggo katoti āgataṃ. Buddhaghosuppattikathāyaṃ pana saṅgharājattherassa āyācanaṃ ārabbhāti āgataṃ."
    ],
    "innerText": "Buddhaghosatthero ca sīhaḷadīpaṃ patvā paṭhamaṃ saṅghapālattheraṃ passitvā piṭakattayaṃ māgadhabhāsakkharena parivattetuṃ āgatomhīti kāraṇaṃ ārocetvā sīhaḷabhikkhū ca sīle patiṭṭhāyātiādigāthaṃ niyyādetvā imissā gāthāya atthaṃ piṭakattayaṃ āloletvā saṃvaṇṇehīti uyyojesuṃ, tasmiṃyeva divase sāyanhakālato paṭṭhāya yathāvuttagāthaṃ pamukhaṃ katvā visuddhimaggaṃ akāsi. Katvā taṃ kammaṃ nipphādetvā tassa ñāṇappabhavaṃ vīmaṃsetukāmo devānamindo tañca ganthaṃ antaradhāpesi. Punāpi thero akāsi . Tatheva devānamindo antaradhāpesi. Punāpi thero akāsi. Evaṃ tikkhattuṃ kārāpetvā pubbaganthepi dassesi. Tiṇṇampi ganthānaṃ aññamaññaṃ ekapadamattenapi visesatā natthi saṅghapālatthero ca taṃ ārādhayitvā piṭakattayaṃ niyyādesi. Evaṃ visuddhimagge saṅghapālattherassa yācanaṃ ārabbha visuddhimaggo katoti āgataṃ. Buddhaghosuppattikathāyaṃ pana saṅgharājattherassa āyācanaṃ ārabbhāti āgataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ buddhaghosuppattikathāyaṃ āgatanayena dassitabuddhaghosuppattikathāsaṅkhepo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Cūḷavaṃse panevaṃ āgato. Buddhaghosatthero nāma mahābodhirukkhasamīpe ekasmiṃ brāhmaṇagāme vijāto tiṇṇampi vedānaṃ pāragū ahosi tesu tesu vādesu ca aticheko. So aññehi ca saddhiṃ pucchābyākaraṇakammaṃ kattukāmo jambunīpatale āhiṇḍanto ekaṃ vihāraṃ patvā tasmiṃ vā āgantukabhāvena nisīdi. Tasmiñca vihāre revato nāma thero vasi. Tena therena saddhiṃ bhallapanto so brāhmaṇamāṇavo tīsu vedesu aloletvā pañhaṃ pucchi. Pucchitaṃ pucchitaṃ thero byākāsi. Therassa pana pucchitaṃ pañhaṃ māṇavo na sakkā byākātuṃ. Atha māṇavo pucchi,–ko nāmāyaṃ bhante mantoti. Buddhamanto nāmāyanti vutte uggaṇhitukāmo hutvā therassa santike pabbajitvā piṭakattayaṃ uggaṇhi. Aciraneva tiṇṇampi piṭakānaṃ pāragū ahosi. Buddhasseva ghoso yassa atthīti buddhaghosoti nāmena pākaṭo ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Buddhaghoso ca āyasmato revatassa santike nisīdanto ñāṇodayaṃ nāma ganthaṃ aṭṭhassāliniñca nāma ganthaṃ akāsi. Tato pacchā parittaṭṭhakathaṃ kattukāmo hutvā ārabhi. Tadā ācariyo evamāha,– jambudīpe pana āvuso pāḷimattaṃyeva atthi, aṭṭhakathā pana natthi, ācariyavādo ca ",
      " bhinno hutvā atthi, teneva mahāmahindhattherena ānitā aṭṭhakathā tīsu ca saṅgītīsu āruḷo pāḷiyo sāriputtattherādīhi desito kathāmaggo sīhaḷadīpe atthi, tvaṃ gantvā māgadhabhāsakkharena likhehīti uyyojiyamāno buddhaghosatthero sīhaḷadīpaṃ gantvā anurādhapure mahāvihāraṃ pavisitvā saṅghapālattherassa santike saddhiṃ sīhaḷaṭṭhakathāya theravāde sutvā aṭṭhakathaṃ karissamīti ārocesi. Sīhaḷabhikkhū ca pubbe vuttanayeneva sīle patiṭṭhāyātiādi gāthā niyyādesuṃ. Buddhaghoso ca saddhiṃ aṭṭhakathāya piṭakattayaṃ saṅkhipitvā visuddhimaggaṃ akāsi."
    ],
    "innerText": "Buddhaghoso ca āyasmato revatassa santike nisīdanto ñāṇodayaṃ nāma ganthaṃ aṭṭhassāliniñca nāma ganthaṃ akāsi. Tato pacchā parittaṭṭhakathaṃ kattukāmo hutvā ārabhi. Tadā ācariyo evamāha,– jambudīpe pana āvuso pāḷimattaṃyeva atthi, aṭṭhakathā pana natthi, ācariyavādo ca bhinno hutvā atthi, teneva mahāmahindhattherena ānitā aṭṭhakathā tīsu ca saṅgītīsu āruḷo pāḷiyo sāriputtattherādīhi desito kathāmaggo sīhaḷadīpe atthi, tvaṃ gantvā māgadhabhāsakkharena likhehīti uyyojiyamāno buddhaghosatthero sīhaḷadīpaṃ gantvā anurādhapure mahāvihāraṃ pavisitvā saṅghapālattherassa santike saddhiṃ sīhaḷaṭṭhakathāya theravāde sutvā aṭṭhakathaṃ karissamīti ārocesi. Sīhaḷabhikkhū ca pubbe vuttanayeneva sīle patiṭṭhāyātiādi gāthā niyyādesuṃ. Buddhaghoso ca saddhiṃ aṭṭhakathāya piṭakattayaṃ saṅkhipitvā visuddhimaggaṃ akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pubbe vuttanayeneva sakko antaradhāpetvā tikkhattuṃ kārāpesi. Saṅghapālattheropi arādhayitvā piṭakattayaṃ niyyādesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kiñcāpi nānā ganthesu nānākārehi buddhaghosuppatti āgatā, tathāpi buddhaghosattherassa sīhaḷadīpaṃ gantvā piṭakattayassa likhanaṃ aṭṭhakathānañca karaṇameva pamāṇanti manokiliṭṭhaṃ na uppādetabbanti. Buddhaghosatthero vikaṭattayaṃ likhitvā jambudīpaṃ paccāgamāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iccevaṃ pāḷibhāsāya pariyattiṃ parivattitvā pacchā ācariyaparamparasissānusissavasena sīhaḷadīpe jinacakkaṃ majjhanti kaṃsumāsī viya atidibbati, anekakoṭippamāṇehi sotāpannasakadāgāmianāgāmiarahantehi laṅkādīpaṃ atisobhati, sabbapāliphullena tiyojanikapāricchattakarukkhena tāvatiṃsabhavanaṃ viya satapattapadumādīhi mahāpokkharaṇī viya tesu tesu ṭhānesu maggamahāmaggaāpakagharadvāratitthavanapabbataguhamandiravihārasālādīsu aladdhamaggaphalaṭṭhānaṃ nāma kiñci natthi, thokaṃ āgametvā piṇḍāya patiṭṭhamānapadesepi maggaphalāni labhiṃsuyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Maggaphalāni sacchikarontānaṃ puggalānaṃ bāhullatāya ayaṃ ",
      " puthujjano ayaṃ puthujjanoti aṅguliṃ pasāretvā dassetabbo hoti. Ekasmiṃ kāle sīhaḷadīpe puthujjana bhikkhu nāma natthi. Tathā hi vuttaṃ vibhaṅgaṭṭhakathāyaṃ, ekavāraṃ puthujjanabhikkhu nāma natthīti."
    ],
    "innerText": "Maggaphalāni sacchikarontānaṃ puggalānaṃ bāhullatāya ayaṃ puthujjano ayaṃ puthujjanoti aṅguliṃ pasāretvā dassetabbo hoti. Ekasmiṃ kāle sīhaḷadīpe puthujjana bhikkhu nāma natthi. Tathā hi vuttaṃ vibhaṅgaṭṭhakathāyaṃ, ekavāraṃ puthujjanabhikkhu nāma natthīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abhiññālābhīnaṃ kira mahiddhikānaṃ gamanāgamanavasena sūriyossāsaṃ alabhitvā dhaññakoṭṭakā mātugāmā dhaññakoṭṭituṃ okāsaṃ na labhiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Devalokato sumanasāmaṇero dakkhiṇakkhakaṃ sīhaḷadīpaṃ anetvā tassa pāṭihāriyaṃ dassanavasena uddhakabindhūhi tiyojanasataṃ sakalampi laṅkādīpaṃ byāpatvā bhagavatā paribhuttacetiyaṅgaṇaṃ viya hutvā navāya gacchantā mahāsamudde udakato nāḷikeramattampi disvā sakalaṅkādīpaṃ pūjenti, mahāmahindattherassa santike ariṭṭhattherena saddhiṃ pañcamattā bhikkhusatā paṭhamaṃ tāva vinayapiṭakaṃ uggaṇhiṃsūti imehi kāraṇehi laṅkādīpaṃ jinacakkassa patiṭṭhānaṃ hutvā varadīpanti nāmaṃ paṭilabhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sīhaḷadīpeyeva piṭakattayaṃ potthakāruḷavasena patiṭṭhāpetvā tato pacchā coranāgassa nāma rañño kāle sakalalaṅkādīpaṃ dubbhikkhabhayena pīḷetvā piṭakattayaṃ dhārentā bhikkhū jambudīpaṃ āgamaṃsu. Anāgantvā tattheva ṭhitāpi bhikkhū chātakabhayena pīḷetvā udarapaṭalaṃ bandhitvā kucchiṃ vālukarāsimhi ṭhapetvā piṭakattayaṃ dhāresuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kuṭa kaṇṇatissassa rañño kāleyeva dubbhikkhabhayaṃ vūpasamitvā jambudīpato bhikkhū puna gantvā sīhaḷadīpe ṭhitehi bhikkhūhi saddhiṃ mahāvihāre piṭakattayaṃ avirodhāpetvā samasamaṃ katvā ṭhapesuṃ. Ṭhapetvā ca pana sīhaḷadīpeyeva suṭṭhu dhāresuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattheva aṭṭhakathāyo buddhaghosatthero māgadhabhāsāya parivattetvā viraci. Pacchā ca yebhuyyena tattheva aṭṭhakathāṭīkāanumadhulakkhaṇagaṇṭhiganthantarāni ",
      " akaṃsu. Puna sāsanaṃ nabhe ravinduva pākaṭanti."
    ],
    "innerText": "Tattheva aṭṭhakathāyo buddhaghosatthero māgadhabhāsāya parivattetvā viraci. Pacchā ca yebhuyyena tattheva aṭṭhakathāṭīkāanumadhulakkhaṇagaṇṭhiganthantarāni akaṃsu. Puna sāsanaṃ nabhe ravinduva pākaṭanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha buddhavaṃsaṭṭhakathaṃ buddhadattatthere akāsi. Itivuttodānacariyāpiṭakatherātherīvimānavatthupetavatthunettiaṭṭhakathāyo ācariyadhammapālatthero akāsi. So ca ācariyadhammapālatthero sīhaḷadīpassa samīpe damilaraṭṭhe badaratitthamhi nivāsitattā sīhaḷadīpeyeva saṅgahetvā vattabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paṭisambhidāmaggaṭṭhakathaṃ mahānāmo nāma thero ākāsi. Mahāniddesaṭṭhakathaṃ upaseno nāma thero akāsi. Abhidhammaṭīkaṃ pana ānandatthero akāsi. Sā ca sabbāsaṃ ṭīkānaṃ ādibhūtattā mūlaṭīkāti pākaṭā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Visuddhimaggassa mahāṭīkaṃ dīghanikāyaṭṭhakathāya ṭīkaṃ majjhimanikāyaṭṭhakathāya ṭīkaṃ saṃyuttanikāyaṭṭhakathāya ṭīkañhāti imāyo ācariyadhammapālatthero akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sāratthadīpaniṃ nāma vinayaṭīkaṃ aṅguttaranikāyaṭīkañca parakkamabāhuraññā yācito sāriputtatthero akāsi. Vimativinodaniṃ nāma vinayaṭīkaṃ damilaraṭṭhavāsikassapatthero akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anuṭīkaṃ pana ācariyadhammapālatthero. Sā ca mūlaṭīkāya anuttānatthāni uttānāni saṃvaṇṇitattā anuṭīkā tivuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Visuddhimaggassa cūḷaṭīkaṃ makhudīpaniñca aññetarā therā akaṃsu. Sā ca mūlaṭīkāya atthāvasesāti ca anuttānatthāti ca katvā mūlaṭīkāya saddhiṃ saṃsanditvā katattā madhura sattā ca madhudīpaninti vuccati. Mohavicchedaniṃ pana lakkhaṇaganthaṃ kassapatthero akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ābhidhammāvatāraṃ pana rupārūpavibhāgaṃ vinayavinicchayañca buddha dattatthero. Vinayasaṅgahaṃ sāriputtatthero. Khuddasikkhaṃ dhammasiritthero ",
      ". Paramatthavinicchayaṃ nāmarūpaparicchedaṃ abhidhammatthasaṅgañca anuruddhatthero. Saccasaṅkhepaṃ dhammapālatthero. Khemaṃ khematthero. Te ca saṅkhepato saṃvaṇṇitattā sukhena ca lakkhaṇiyattā lakkhaṇaganthāti vuccanti."
    ],
    "innerText": "Ābhidhammāvatāraṃ pana rupārūpavibhāgaṃ vinayavinicchayañca buddha dattatthero. Vinayasaṅgahaṃ sāriputtatthero. Khuddasikkhaṃ dhammasiritthero . Paramatthavinicchayaṃ nāmarūpaparicchedaṃ abhidhammatthasaṅgañca anuruddhatthero. Saccasaṅkhepaṃ dhammapālatthero. Khemaṃ khematthero. Te ca saṅkhepato saṃvaṇṇitattā sukhena ca lakkhaṇiyattā lakkhaṇaganthāti vuccanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tesaṃ pana saṃvaṇṇanāsu abhidhammatthasaṅgahassa porāṇaṭīkaṃ navavimalabuddhitthero akāsi. Saccaṃsaṅkhepanāmarūpaparicchedakhemāabhidhammāvatārānaṃ porāṇaṭīkaṃ vācissaramahāsāmitthero. Paramatthavinicchayassa porāṇaṭīkaṃ mahābodhitthero."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abhidhamatthasaṅgahābhidhammāvatārābhinava ṭīkāyo sumaṅgalasāmitthero. Saccasaṅkhepābhinavaṭīkaṃ araññavāsitthero. Nāmarūpaparicchedābhinavaṭīkaṃ mahāsāmitthero. Paramatthavinicchayābhinavaṭīkaṃ aññataratthero. Vinayavinicchayaṭīkaṃ revatatthero. Khuddasikkhāya purāṇaṭīkaṃ mahāyasatthero. Tāyayeva abhinavaṭīkaṃ saṅgharakkhitattheroti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vajirabuddhiṃ nāma vinayagaṇṭhipadatthaṃ vajirabuddhitthero. Cūḷagaṇṭhiṃ majjhimagaṇṭhiṃ mahāgaṇṭhiñca sīhaḷadīpavāsino therā. Te ca padakkamena asaṃvaṇṇetvā anuttānatthāyeva saṃvaṇṇitattā gaṇṭhipadatthāti vuccanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abhidhānappadīpikaṃ pana mahāmoggalānatthero. Atthabyakkhānaṃ cūḷabuddhatthero. Vuttodayaṃ sambandhacintanaṃ subodhālaṅkārañca saṅgharakkhitatthero. Byākaraṇaṃ moggalānatthero."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Mahāvaṃsaṃ cūḷavaṃsaṃ dīpavaṃsaṃ thūpavaṃsaṃ bodhivaṃsaṃ dhātuvaṃ sañca sīhaḷadīpavāsino therā. Dāṭhādhātuvaṃsaṃ pana dhammakittitthero akāsi. Ete ca pāḷimuttakavasena vuttattā ganthantarāti vuccanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iccevaṃ buddhaghosādayo thera varā yathābalaṃ yathāsattiṃ pariyattiṃ sāsanaṃ upatthambhetvā bahūhi mūlehi bahuhisākhāhi bahūhi ca viṭapehi upatthambhiyamāno vepullamā pajjamāno ",
      " mahānigrodharukkho viya thiraṃ hutvā cirakālaṃ tiṭṭhatīti veditabbaṃ."
    ],
    "innerText": "Iccevaṃ buddhaghosādayo thera varā yathābalaṃ yathāsattiṃ pariyattiṃ sāsanaṃ upatthambhetvā bahūhi mūlehi bahuhisākhāhi bahūhi ca viṭapehi upatthambhiyamāno vepullamā pajjamāno mahānigrodharukkho viya thiraṃ hutvā cirakālaṃ tiṭṭhatīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idaṃ sīhaḷadīpe potthakāruḷhato pacchā sāsanassa patiṭṭhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Etepi ca mahāthero, yathāsattiṃ yathābalaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aṭṭhakathādayo katvā, maccumukhaṃ upāgamuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Seyyathāpi ca lokasmiṃ, obhāsitvāna candimā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āvahitvāna sattānaṃ, hitaṃ atthaṃva gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Evameva mahātherā, ñāṇobhāsehi bhāsiya;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āvahitvāna sattānaṃ, hitaṃ atthaṃva gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti sāsanavaṃse sīhaḷadīpikasāsanavaṃsakathāmaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nāma dutiyo paricchedo."
  }
]