[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "4. Yonakaraṭṭhasāsanavaṃsakathāmaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Idāni pana yonakaraṭṭhe sāsanassuppattiṃ kathessāmi ",
      ". Bhagavā hi veneyyahitāvaho yonakaraṭṭhe mamasāsanaṃ cirakālaṃ pabhiṭṭhahissatīti āpekkhitvā saddhiṃ bhikkhu saṅghena desacārikaṃ āhiṇḍanto labhuñjaṃ nāma nagaraṃ agamāsi. Tadā eko nesādo hariphalaṃ datvā taṃ paribhuñjitvā haribīje khipite pathaviyaṃ apatitvā ākāseyeva patiṭṭhāsi. Taṃ disvā sitaṃ patvākāsi. Tamatthaṃ disvā ānandatthero pucchi. Anāgate kho ānanda imasmiṃ ṭhāne mama dhātucetiyaṃ patiṭṭhahissati, sāsanaṃ virūḷamāpajjissatīti byākāsi. Bhagavatā pana hariphalassa bhuñjitaṭṭhānattāharibhuñjoti tassa raṭṭhassa nāmaṃ ahosi. Dvinnaṃ tāpasānaṃ ṭhapitaṃ jalasuttikaṃ paṭicca yonakānaṃ bhāsāya labhuñjoti nāmaṃ ahosi."
    ],
    "innerText": "4. Idāni pana yonakaraṭṭhe sāsanassuppattiṃ kathessāmi . Bhagavā hi veneyyahitāvaho yonakaraṭṭhe mamasāsanaṃ cirakālaṃ pabhiṭṭhahissatīti āpekkhitvā saddhiṃ bhikkhu saṅghena desacārikaṃ āhiṇḍanto labhuñjaṃ nāma nagaraṃ agamāsi. Tadā eko nesādo hariphalaṃ datvā taṃ paribhuñjitvā haribīje khipite pathaviyaṃ apatitvā ākāseyeva patiṭṭhāsi. Taṃ disvā sitaṃ patvākāsi. Tamatthaṃ disvā ānandatthero pucchi. Anāgate kho ānanda imasmiṃ ṭhāne mama dhātucetiyaṃ patiṭṭhahissati, sāsanaṃ virūḷamāpajjissatīti byākāsi. Bhagavatā pana hariphalassa bhuñjitaṭṭhānattāharibhuñjoti tassa raṭṭhassa nāmaṃ ahosi. Dvinnaṃ tāpasānaṃ ṭhapitaṃ jalasuttikaṃ paṭicca yonakānaṃ bhāsāya labhuñjoti nāmaṃ ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tadā tattha mapinnāya nāma ekissā mātikāya samīpe nisinno eko lavakulikajeṭṭhako attano puttaṃ sattavassikaṃ bhagavato niyyādetvā pabbājesi. Kammaṭṭhānānuyogavasena acireneva arahattaṃ pāpuṇi. Sattavassi kassaca sāmaṇerassa arahattaṃ sacchikataṭṭhānataṃ paṭicca yonakabhāsāya etaṃ ṭhānaṃ caṅgamaṅgha iti vuccati. Cirakāla vasena jaṅgamaṅgha iti vuccati. Tato paṭṭhāyayeva yonakaraṭṭhe sāsanaṃ patiṭṭhātīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Idaṃ yonakaraṭṭhe paṭhamaṃ sāsanassa patiṭṭhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sāsane pana pañcatiṃsādhike dvivassasate sampatte mahārakkhitatthero yonakaraṭṭhaṃ gantvā kambojakhemāvara haribhuñjāyuddhayādīsu anekesu raṭṭhesu sāsanaṃ patiṭṭhāpeti. Tāni hi sabbāni raṭṭhāni saṅgahetvā dassentehi aṭṭhakathācariyehi yonakalokanti okāsakālokavācakena sāmaññasaddena vuttaṃ. Pakati hesā ganthakārānaṃ yena ",
      " kenacākārena atthantarassa viññāpanāti."
    ],
    "innerText": "Sāsane pana pañcatiṃsādhike dvivassasate sampatte mahārakkhitatthero yonakaraṭṭhaṃ gantvā kambojakhemāvara haribhuñjāyuddhayādīsu anekesu raṭṭhesu sāsanaṃ patiṭṭhāpeti. Tāni hi sabbāni raṭṭhāni saṅgahetvā dassentehi aṭṭhakathācariyehi yonakalokanti okāsakālokavācakena sāmaññasaddena vuttaṃ. Pakati hesā ganthakārānaṃ yena kenacākārena atthantarassa viññāpanāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Mahārakkhitatthero ca saddhiṃ pañcahi bhikkhūhi pāṭaliputtato anilapathamaggena yonakalokaṃ āgantvā kāḷakārāmasuttena yonake pasādesi. Sattatisahassādhikapāṇasatasahassaṃ maggaphalālaṅkāraṃ adāsi. Santike cassa dasasahassāni pabbajiṃsu. Evaṃ so tatthasāsanaṃ patiṭṭhāpesi. Tathā ca vuttaṃ aṭṭhakathāyaṃ,–"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yonakaraṭṭhaṃ tadā gantvā, so mahārakkhito isi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kāḷakārāmasuttena, te pasādesi yonaketi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato paṭṭhāya tesaṃ sissaparamparā bahū honti, gaṇanapathaṃ vītivattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Idaṃ yonakaraṭṭhe mahārakkhitattherādayo paṭicca"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyaṃ sāsanassa patiṭṭhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yonakaraṭṭhe lakunnanagare jinacakke pañcavassasate maṇimayaṃ buddhappaṭimaṃ māpetvā visukammadevaputto nāgasenattherassa adāsi. Nāgesenatthero ca tasmiṃ paṭimamhi dhātu āgantvā patiṭṭhātūti adhiṭṭhāsi. Adhiṭṭhānavaseneva sattadhātuyo āgantvā tattha patiṭṭhahitvā pāṭihāriyaṃ dassesunti rājavaṃse vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tañca vacanaṃ mama parinibbānato pañcavassasate atikkante ete uppajjissantīti milindapañhāyaṃ vuttavacanena kālaparimāṇavasena ca sameti. Yonakaraṭṭhe milindarañño kāle jinacakke pañcavassasateyeva nāgasenattheraṃ paṭissa jinacakkaṃ virūḷaṃ hutvā patiṭṭhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Idaṃ yonakaraṭṭhe nāgasenattheraṃ paṭicca tatiyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sāsanassa patiṭṭhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kaliyuge ",
      " pañcasaṭṭhivasselabhuñjanagarato saṅkamitvā kyuṅgaranagare māpikassa baññācomaṅgara nāmakassa rañño kāle majjhimadesato kassapatthero pañcahi therehi saddhiṃ āgacchi."
    ],
    "innerText": "Kaliyuge pañcasaṭṭhivasselabhuñjanagarato saṅkamitvā kyuṅgaranagare māpikassa baññācomaṅgara nāmakassa rañño kāle majjhimadesato kassapatthero pañcahi therehi saddhiṃ āgacchi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tadā so rājā vihāraṃ katvā tesaṃ adāsi. Sīhaḷadīpato ca dhātuyo ānetvā eko thero āgacchi. Dhātuto pāṭihāriyaṃ disvā pasīditvā labhuñjacetiya nidhānaṃ akāsi. Te ca there paṭicca yonakaraṭṭhe sāsana vaṃso āgato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Idaṃ yonakaraṭṭhe catutthaṃ sāsanassa patiṭṭhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kaliyuge dvāsaṭṭhādhike sattasate sampatthe cinaraṭṭhindo rājā abhibhavitvā sakalampi yonakaraṭṭhaṃ saṅkhubtitaṃ hoti. Tadā mahādhammagambhīratthero mahāmedhaṅkaratthe rocāti dve thero yonakaraṭṭhato saddhiṃ bahūhi bhikkhūhi sīhaḷadīpaṃ agamaṃsu. Tadā ca sīhaḷadīpe dubbhikkhabhayena abhibhūto hutvā tato syāmaraṭṭhe sokkatayanagaraṃ puna agamaṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato pacchā lakunnanagaraṃ gantvā sāsanaṃ paggaṇhantānaṃ lajjipesalānaṃ bhikkhūnaṃ santike puna sikkhaṃ gaṇhiṃsu. Te ca thero syāmaraṭṭhe yonakaraṭṭhe ca sabbattha sāsanaṃ patiṭṭhāpesunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Idaṃ yonakaraṭṭhe pattalaṅke dve there paṭicca pañcamaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sāsanassa patiṭṭhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kaliyuge pañcavīsādhike aṭṭhavassasate sampatte sirisaddhammalokapaticakkavattirājā labhuñjacetiyaṃ puna mahantaṃ katvā ",
      " tassa cetiyassa samīpe cattāro vihāre kārāpetvā mahāmedhaṅkarattherassa sāriputtattherassa ca adāsi. Tadāpi te dve therā sāsanaṃ parisuddhaṃ katvā patiṭṭhāpesunti."
    ],
    "innerText": "Kaliyuge pañcavīsādhike aṭṭhavassasate sampatte sirisaddhammalokapaticakkavattirājā labhuñjacetiyaṃ puna mahantaṃ katvā tassa cetiyassa samīpe cattāro vihāre kārāpetvā mahāmedhaṅkarattherassa sāriputtattherassa ca adāsi. Tadāpi te dve therā sāsanaṃ parisuddhaṃ katvā patiṭṭhāpesunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Idaṃ yonakaraṭṭhe mahāmedhaṅkarasāriputtatthere"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭicca chaṭṭhaṃ sāsanassa patiṭṭhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kaliyuge tecattālīsādhike navavassasate sampatte haṃsāvatīnagare anekasetibhindo nāma rājā yonakaraṭṭhaṃ abhibhavitvā attano hatthagataṃ katvā bali bhuñjanatthāya jeṭṭhaputtassa anuruddhassa nāma rājakumārassa datvā bahūhi amaccehi saddhiṃ tattha gantvā anurājatāvena rajjaṃ kārāpesi. Sāsanañca visodhāpetuṃ saddhammacakkasāmittheraṃ tena saddhiṃ pahiṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anekasetibhinno kira rājā yonakaraṭṭhaṃ vijayakāle paṭhamaṃ sāsanassa patiṭṭhānabhūtamidanti katvā taṃraṭṭhavāsino karamarānītabhāvena na aggahesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathāvuttattheravaṃsesu ca eko lakunnanagare araññavāsī thero tattha nagare ajja asukasmiṃ ṭhāne eko matoti gihīnaṃ kathetvā yathākathitaṃ bhūtaṃ hutvā ayaṃ abhiññālābhīti pākaṭo ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmiṃyeva ca nagare mahāmaṅgalo nāma thero anekasetibhindassa rañño yujjhituṃ āgatakāle anekasetibhindo rājā maṃ pakkosissati, samānajātikaṃ dūtaṃ pessessatīti pakkositakālato paṭhamamevavadi. Yathāvuttaniyāmeneva pakkosanato ayaṃ abhiññā lābhīti kitti ghoso ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha nagare ñāṇavilāsatthero saṅkhyāpakāsakaṃ nāma ",
      " pakaraṇaṃ akāsi. Taṃḷīkaṃ pana pattalaṅkattherassa vihāre vasanto sirimaṅgalonāma thero akāsi."
    ],
    "innerText": "Tattha nagare ñāṇavilāsatthero saṅkhyāpakāsakaṃ nāma pakaraṇaṃ akāsi. Taṃḷīkaṃ pana pattalaṅkattherassa vihāre vasanto sirimaṅgalonāma thero akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Visuddhimaggadīpaniṃ pana saṃññvattaaraññavāsī uttarārāmo nāma eko thero. Maṅgaladīpaniṃ sirimaṅgalatthero. Uppātasantiṃ aññataro thero. Taṃ kira uppātasantiṃ sajjhāyitvā cīnarañño senaṃ ajinīti. Iccevaṃ yonakaraṭṭhe abhiññālābhīnaṃ ganthakārānañca therānaṃ ānubhāvena jinasāsanaṃ parisuddhaṃ hutvā patiṭṭhāti. Evaṃ hetuphalasambandhavasena ādi anta sambandhavasena ca yathāvuttehi tīhi nayehi theraparamparā ghaṭṭetvā gahetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti sāsanavaṃse yonakaraṭṭhasāsanavaṃsakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Maggo nāma catuttho paricchedo."
  }
]