[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "7. Kasmiragandhāraraṭṭhasāsanavaṃsakathāmaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". Idāni yathāvuttamātikāvasena kasmīravandhāraraṭṭhasāsanavaṃsakathāmaggaṃ vattuṃ okāso anuppatto, tasmā taṃ vakkhāmi."
    ],
    "innerText": "7. Idāni yathāvuttamātikāvasena kasmīravandhāraraṭṭhasāsanavaṃsakathāmaggaṃ vattuṃ okāso anuppatto, tasmā taṃ vakkhāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatiyasaṅgītāvasāne hi mahāmoggaliputtatissatthero majjhanti kattheraṃ kasmīragandhāraraṭṭhaṃ pesesi,-tvaṃ etaṃ raṭṭhaṃ gantvā ettha sāsanaṃ pabhiṭṭhāpehīti. Ettha ca kasmīragandhāraraṭṭhaṃ nāma cīnaraṭṭhasamīpe tiṭṭhati. Teneva hi adhunā kasmīragandhāraraṭṭhavāsino cinaraṭṭhavāsinoca manussā aravāḷassa nāma nāgarājassa uppajjanakālato paṭṭhāya yāvajjatanā nāgarūpaṃ katvā mānenti pūjenti sakkaronti, vatthabhājanādīsupi nāgarūpameva te yebhuyyena karontīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Soca majjhantikattheropi catūhi bhikkhūhi saddhiṃ attha pañcamo hutvā pāṭaliputtato vehāsaṃ abbhuggantvā himavati aravāḷadahassa upari otari. Tena kho pana samayena kasmīragandhāraraṭṭhe sassapākasamaye aravāḷo nāma nāgarājā aravāḷadahe nisīditvā karakavassaṃ nāma vassāpetvā sassaṃ harāpetvā mahāsamuddaṃ pāpesi. Teroca aravāḷadahassa upari otaritvā aravāḷadahapiṭṭhikaṃ caṅkamatipi tiṭṭhatipi nisīdatipi seyyampi kappeti. Nāgamāṇavakā taṃ disvā aravāḷassa nāgarājassa ārocesuṃ, - mahārāja eko chinnabhinnapaṭadharo bhaṇḍukāsāvavasano amhākaṃ udakaṃ dūsetīti. Tadā pana thero attānaṃyeva ",
      " nāgānaṃ dasseti. Nagarājā tāvadeva kodhābhibhūto nikkhamitvā theraṃ disvā makkhaṃ assahamāno antalikkhe anekāni bhiṃsanakāni nimmini. Tato tato bhusāvātā vāyanti, rukkhā chijjanti, pabbatakūṭā patanti meghāgajjanti, vijjuṃlatā niccharanti, asaniyo phalanti, bhinnaṃ viya gaganaṃ udakaṃ paggharati, bhayānakarūpā nāgakumārā sannipatanti, sayampi dhūmāyati pajjalati, paharaṇavuṭṭhiyo vissajjeti, ko ayaṃmuṇḍako chinnabhinnapaṭadharotiādīhi pharusavacanehi theraṃ santajjeti, etha gaṇhatha hanatha niddhamatha imaṃ samaṇanti nāgabalaṃ āṇāpesi."
    ],
    "innerText": "Soca majjhantikattheropi catūhi bhikkhūhi saddhiṃ attha pañcamo hutvā pāṭaliputtato vehāsaṃ abbhuggantvā himavati aravāḷadahassa upari otari. Tena kho pana samayena kasmīragandhāraraṭṭhe sassapākasamaye aravāḷo nāma nāgarājā aravāḷadahe nisīditvā karakavassaṃ nāma vassāpetvā sassaṃ harāpetvā mahāsamuddaṃ pāpesi. Teroca aravāḷadahassa upari otaritvā aravāḷadahapiṭṭhikaṃ caṅkamatipi tiṭṭhatipi nisīdatipi seyyampi kappeti. Nāgamāṇavakā taṃ disvā aravāḷassa nāgarājassa ārocesuṃ, - mahārāja eko chinnabhinnapaṭadharo bhaṇḍukāsāvavasano amhākaṃ udakaṃ dūsetīti. Tadā pana thero attānaṃyeva nāgānaṃ dasseti. Nagarājā tāvadeva kodhābhibhūto nikkhamitvā theraṃ disvā makkhaṃ assahamāno antalikkhe anekāni bhiṃsanakāni nimmini. Tato tato bhusāvātā vāyanti, rukkhā chijjanti, pabbatakūṭā patanti meghāgajjanti, vijjuṃlatā niccharanti, asaniyo phalanti, bhinnaṃ viya gaganaṃ udakaṃ paggharati, bhayānakarūpā nāgakumārā sannipatanti, sayampi dhūmāyati pajjalati, paharaṇavuṭṭhiyo vissajjeti, ko ayaṃmuṇḍako chinnabhinnapaṭadharotiādīhi pharusavacanehi theraṃ santajjeti, etha gaṇhatha hanatha niddhamatha imaṃ samaṇanti nāgabalaṃ āṇāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Thero sabbaṃ taṃ bhiṃsanakaṃ attano iddhibalena paṭibāhitvā nāgarājānaṃ āha,–"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sadevakopi ce loko, āgantvā tāsayeyya maṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na me paṭibalo assa, janetuṃ bhayabheravaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sacepi tvaṃ mahiṃ sabba, sasamuddaṃ sapabbataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ukkhipitvā mahānāga, khipeyyāsi mamūpari."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Neva me sakkuṇeyyāsi, janetuṃ bhayabheravaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aññadatthu tavevassa, vighāto uragādhipāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ vutte nāgarājā vihatānubhāvo nipphalavāyāmo dukkhī dummano ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Taṃ thero taṅkhaṇānurūpāya dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā tīsu saraṇesu pañcasuca sīlesu patiṭṭhāpesi saddhiṃ caturāsītiyā nāgasahassehi. Aññepi bahū himavantavāsino yakkhāca gandhabbāca kumbhaṇḍāca therassa dhammakathaṃ sutvā saraṇesuca sīlesuca patiṭṭhahiṃsu. Pañcakopi yakkho saddhiṃ bhariyāya yakkhiniyā pañcahica puttasatehi paṭhame ",
      " phale patiṭṭhito. Athāyasmā majjhanti katthero sabbenāgayakkharakkhase āmantetvā evamāha,-"
    ],
    "innerText": "Taṃ thero taṅkhaṇānurūpāya dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā tīsu saraṇesu pañcasuca sīlesu patiṭṭhāpesi saddhiṃ caturāsītiyā nāgasahassehi. Aññepi bahū himavantavāsino yakkhāca gandhabbāca kumbhaṇḍāca therassa dhammakathaṃ sutvā saraṇesuca sīlesuca patiṭṭhahiṃsu. Pañcakopi yakkho saddhiṃ bhariyāya yakkhiniyā pañcahica puttasatehi paṭhame phale patiṭṭhito. Athāyasmā majjhanti katthero sabbenāgayakkharakkhase āmantetvā evamāha,-"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mādāni kodhaṃ janayittha, ito uddhaṃ yathā pure;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sassaghātañca mā kattha, sukhakāmā hi pāṇino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Karotha mettaṃ sattesu, vasantu manujā sukhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Te sabbepi sādhu bhanteti therassa vacanaṃ paṭissuṇitvā yathānusiṭṭhaṃ paṭipajjiṃsu. Taṃ divasameva nāgarājassa pūjāsamayo hoti. Atha nāgarājā attano ratanamayaṃ pallaṅkaṃ āharāpetvā therassa paññapesi. Nisīdi thero pallaṅke. Nāgarājāpi theraṃ bījayamāno samīpe aṭṭhāsi. Tasmiṃ khaṇe kasmīragandhāraraṭṭhavāsino āgantvā theraṃ disvā amhākaṃ nāgarājatopi thero mahiddhikataroti therameva vanditvā nisinnā. Thero tesaṃ āsivisopamasuttaṃ kathesi. Suttapariyosāne asītiyāpāṇasahassānaṃ dhammābhisamayo ahosi. Kulasatasahassañca pabbaji. Tato pabhuti ca kasmīragandhāro yāvajjetanā kāsāvapajjotā isivātapaṭivātāeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Gantvā kasmīragandhāraṃ, isi majjhantiko tadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duṭṭhaṃ nāgaṃ pasādetvā, mocesi bandhanā bahūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Adhunā pana kasmīragandhāraraṭṭhe sāsanassa atthaṅgatassaviya sūriyassa obhāso na paññāyati, tasmā tattha sāsanassa patiṭṭhāne vitthārena vattabbakiccaṃ natthīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti sāsanavaṃse kasmīragandhāraraṭṭhasāsanavaṃsakathāmaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nāma sattamo paricchedo."
  }
]