[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "9. Mahāraṭṭhasāsanavaṃsakathāmaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ". Ito paraṃ mahāraṭṭhasāsanavaṃsakathāmaggaṃ kathayissāmi yathāvuttamātikāvasena."
    ],
    "innerText": "9. Ito paraṃ mahāraṭṭhasāsanavaṃsakathāmaggaṃ kathayissāmi yathāvuttamātikāvasena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatiyasaṅgītāvasāne hi mahāmoggaliputtatissatthero mahādhammarakkhittheraṃ mahāraṭṭhaṃ pesesi,-tvaṃ etaṃ raṭṭhaṃ gantvā ettha sāsanaṃ patiṭṭhāpesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Mahādhammarakkhitattheroca attapañcamo hutvā mahāraṭṭhaṃ gantvā mahānāradakassapajātakakathāya mahāraṭṭhake pasādetvā ",
      " caturāsītipāṇasahassāni maggaphalesu patiṭṭhāpesi. Terasasahassāni pabbajiṃsu. Evaṃ so tattha sāsanaṃ patiṭṭhāpesi."
    ],
    "innerText": "Mahādhammarakkhitattheroca attapañcamo hutvā mahāraṭṭhaṃ gantvā mahānāradakassapajātakakathāya mahāraṭṭhake pasādetvā caturāsītipāṇasahassāni maggaphalesu patiṭṭhāpesi. Terasasahassāni pabbajiṃsu. Evaṃ so tattha sāsanaṃ patiṭṭhāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mahāraṭṭhaṃ isi gantvā, so mahā dhammarakkhito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Jātakaṃ kathayitvāna, pasādesi mahājananti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha kira manussā pubbe aggihutādimicchākammaṃ yebhuyyena akaṃsu. Teneva thero mahānāradakassapajātakakathaṃ desesi. Tato paṭṭhāya tattha manussā jātaka kathaṃ yebhuyyena sotuṃ ativiya icchanti. Bhikkhūca yebhuyyena gahaṭṭhānaṃ jātakakathaṃyeva desenti. Visesato pana vassantarajātakakathaṃ te manussā bahūhi dātabbavatthūhi pūjetvā suṇanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tañca mahāraṭṭhaṃ nāma syāmaraṭṭhasamīpe ṭhitaṃ, teneva syāmaraṭṭhavāsinopi bhikkhū gahaṭṭhāca yebhuyyena sotuṃ icchantīti. Mahādhammarakkhitattheropi mahāraṭṭhavāsīhi saddhiṃ sakalasyāmaraṭṭhavāsīnaṃ dhammaṃ desesi, amatarasaṃ pāyesi, yathā yonakadhammarakkhitatthero aparantaraṭṭhaṃ gantvā sakalamarammaraṭṭhavāsīnanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yaṃ pana yonakaraṭṭhasāsanavaṃsakathāyaṃ vuttaṃ, tampi sabbaṃ etthāpi daṭṭhabbaṃyeva, tehi tassa ekasadisattena ṭhitattāti. Tathā hi nāgasenattheropi yonakaraṭṭhe vasitvā syāmaraṭṭhādīsupi sāsanaṃ patiṭṭhāpesi. Yonakaraṭṭhavāsino mahādhammagambhīrattheramahāmedhaṅkarattherāca saddhiṃ bahūhi bhikkhūhi sīhaḷadīpaṃ gantvā tato punāgantvā syāmaraṭṭhe sokkatayanagaraṃ patvā tattha nisīditvā sāsanaṃ paggaṇhitvā pacchā lakunnanagare nisīditvā sāsanaṃ paggaṇhi. Evaṃ yonakaraṭṭhe sāsanaṃ ṭhitaṃ syāmādīsupi ṭhitaṃyevāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Buddhassa bhagavato parinibbānato dvisatādhikānaṃ dvinnaṃ vassasahassānaṃ ",
      " upari navutime vassa sīhaḷadīpe rajjaṃ pattassa kittissirirājasīhamahārājassa abhisekato tatiye vasse teneva kittissirirājasīhamahāraññā pahitapaṇṇākārasāsanaṃ āgamma sarāmādhipatidhammikamahārājādhirājenāṇattehi laṅkādīpaṃ āgatehi upālitthe rādīhi patiṭṭhāpito vaṃso upālivaṃsoti pākaṭo. Soca duvidho pubbārāmavihāravāsīabhayagirivihāravāsīvasenāti. Evaṃ mahānagarayonakalyāmaraṭṭhesu sāsanaṃ thiraṃ hutvā tiṭṭhatīti veditabbanti."
    ],
    "innerText": "Buddhassa bhagavato parinibbānato dvisatādhikānaṃ dvinnaṃ vassasahassānaṃ upari navutime vassa sīhaḷadīpe rajjaṃ pattassa kittissirirājasīhamahārājassa abhisekato tatiye vasse teneva kittissirirājasīhamahāraññā pahitapaṇṇākārasāsanaṃ āgamma sarāmādhipatidhammikamahārājādhirājenāṇattehi laṅkādīpaṃ āgatehi upālitthe rādīhi patiṭṭhāpito vaṃso upālivaṃsoti pākaṭo. Soca duvidho pubbārāmavihāravāsīabhayagirivihāravāsīvasenāti. Evaṃ mahānagarayonakalyāmaraṭṭhesu sāsanaṃ thiraṃ hutvā tiṭṭhatīti veditabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti sāsanavaṃse mahāraṭṭhasāsanavaṃsakathāmaggo nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Navamo paricchedo."
  }
]