[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammāsambuddhassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "book"
    },
    "innerText": "Cūḷaganthavaṃsapāḷi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "1. Piṭakattayaparicchedo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Namassetvāna sambuddhaṃ, aggavaṃsavaraṃvaraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Natvāna dhammaṃ buddhajaṃ, saṅghañcāpiniraṅgaṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ganthavaṃsampi nissāya, ganthavaṃsaṃ pakathissaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tipeṭakasamāhāraṃ, sādhunaṃ jaṅghadāsakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vimatinodanamārambhaṃ, taṃ me suṇātha sādhavo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbampi buddhavacanaṃ, vimutti ca sahetukaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Hoti ekavidhaṃyeva, tividhaṃ piṭakena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tañca sabbampi kevalaṃ, pañcavidhaṃ nikāyato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Aṅgato ca navavidhaṃ, dhammakkhandhagaṇanato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Caturāsīti sahassa, dhammakkhandhapabhedananti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ piṭakato piṭakañhi tividhaṃ hoti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vinayapiṭakaṃ, abhidhammapiṭakaṃ suttantapiṭakanti. Tattha katamaṃ vinaya piṭakaṃ? Pārājikakaṇḍaṃ, pācittiyakaṇḍaṃ, mahāvaggakaṇḍaṃ, cullavaggakaṇḍaṃ, parivārakaṇḍanti. Imāni kaṇḍāni vinayapiṭakaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katamaṃ abhidhammapiṭakaṃ? Dhammasaṅgaṇī-pakaraṇaṃ, vibhaṅga-pakaraṇaṃ, dhātukathā-pakaraṇaṃ, puggalapaññatti-pakaraṇaṃ, kathāvatthu-pakaraṇaṃ, yamaka-pakaraṇaṃ, paṭṭhāna-pakaraṇanti. Imāni satta pakaraṇāni abhidhammapiṭakaṃ nāma. Katamaṃ suttantapiṭakaṃ? Sīlakkhandhavaggādikaṃ, avasesaṃ buddhavacanaṃ suttantapiṭakaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ nikāyato? Nikāyā pañca vidhā honti. Dīghanikāyo, majjhimanikāyo, saṃyuttanikāyo, aṅguttaranikāyo, khuddakanikāyoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha katamo dīgha-nikāyo? Sīlakkhandhavaggo, mahāvaggo, pāthikavaggoti, ime tayo vaggā dīghanikāyo nāma. Imesu tīsu vaggesu, catutiṃsa vaggāni ca honti. [Catutiṃseva suttantā, sīlakkhandhavaggādikā, yassa bhavanti so yeva dīghanikāya nāma hoti.]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katamo majjhimanikāyo? Mūlapaṇṇāso, majjhimapaṇṇāso, uparipaṇṇāsoti, ime tayo paṇṇāsā majjhimanikāyo nāma. Imesu tīsu paṇṇāsesu dvepaññāsādhika-sutta-satāni honti [diyaḍḍhasatasuttantā, dvi suttaṃ yassa santiso, majjhimanikāyo nāmo mūlapaṇṇāsamādi hoti.]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katamo saṃyuttanikāyo? Sagāthāvaggo, nidānavaggo, khandhakavaggo, saḷāyatanavaggo, mahāvaggoti, ime pañca vaggā saṃyuttanikāyo nāma. Imesu pañcasu vaggesu dvāsaṭṭhisuttasattasatādhikasatta-suttasahassāni honti. [Dvāsaṭṭhi-satta-satāni, sattasahassakāni ca.] Suttāni yassa honti so, sagāthādikavaggako, saṃyuttanikāyo nāmo veditabbo ca viññūnāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katamo aṅguttaranikāyo? Ekkanipāto, dukkanipāto, tikkanipāto, catukkanipāto, pañcakanipāto, chakkanipāto, sattakanipāto, aṭṭhakanipāto, navakanipāto, dasakanipāto, ekādasanipātoti, ime ekādasa nipātā aṅguttaranikāyo nāma. Imesu ekādasa nipātesu satta-paññāsa-pañca-satādhikanava-sutta-sahassāni honti. [Navasuttasahassāni, pañcasatamattāni ca, sattapaññāsādhikāni, suttāni yassa honti so, aṅguttaranikāyoti, ekkanipātakādikoti.]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katamo khuddakanikāyo? Khuddakapāṭho, dhammapadaṃ, udānaṃ, itivuttakaṃ, suttanipāto, vimānavatthu, petavatthu, therakathā, therīkathā, jātakaṃ, mahāniddeso, paṭisambhidāmaggo, apadānaṃ, buddhavaṃso, cariyāpiṭakaṃ, vinayapiṭakaṃ, abhidhammapiṭakanti. Imesu sattarasasu ganthesu anekāni sutta-sahassāni honti. [Anekāni sutta-sahassāni, niddiṭṭhāni mahesinā, nikāye pañcame ime, khuddake iti visuteti.]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ aṅgato aṅgahi nava vidhaṃ hoti? Suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthā, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallanti, navappabhedaṃ hoti. Tattha ubhato vibhaṅganiddesakhandhakaparivārā, suttanipāte, maṅgalasutta, ratanasutta, tuvaṭṭakasuttāni. Aññampi suttanāmakaṃ tathāgatavacanaṃ, suttanti veditabbaṃ. Sabbaṃ sagāthakaṃ geyyanti veditabbaṃ. Visesanasaṃyuttake sakalopi sagāthakavaggo, sakalaṃ abhidhammapiṭakaṃ nigāthakañca suttayañca aññampi aṭṭhahi aṅgehi asaṅgahitaṃ buddhavacanaṃ taṃ veyyākaraṇanti veditabbaṃ. Dhammapadaṃ, therakathā, therīkathā, suttanipāte, no suttanāmikā suddhikagāthā, gāthāti veditabbā. Somanassa ñāṇamayikagāthā paṭika-saṃyuttā dve asītisuttantā udānanti veditabbā. Vuttañhetaṃ bhagavatātiādinayappavattā dasuttarasatasuttantā, itivuttakanti veditabbā. Apaṇṇakajātakādīni paññāsādikāni. Pañcajātakasatāni, jātakanti veditabbaṃ. Cattāro me bhikkhave acchariyā abhūtadhammā, ānandetiādinayappavattā sabbepi acchariya abhūtadhammapaṭisaṃyuttā suttantā abhūtadhammanti veditabbā. Cullavedalla, mahāvedalla, sammādiṭṭhi, sakkapañha, saṅkhārabhājaniya, mahāpuṇṇamasuttantādayo sabbepi vedañca tuṭṭhiñca laddhā [puccha] laddhā pucchitasuttantā, vedallanti veditabbā. Katamāni caturāsīti dhammakkhandhasahassāni dujānāni, caturāsīti dhammakkhandhasahassāni sace vitthārena kathissaṃ atipapañco bhavissati. Tasmā naya vasena kathissāmi. Ekaṃ vatthu, eko dhammakkhandho, ekaṃ nidānaṃ eko dhammakkhandho, ekaṃ pañhā pucchantaṃ eko dhammakkhandho, ekaṃ pañhā visajjanaṃ eko dhammakkhandho, caturāsīti dhammakkhandhasahassāni kena bhāsitāni, kattha bhāsitāni, kadā bhāsitāni, kamārabbha bhāsitāni, kimatthaṃ bhāsitāni, kena dhāritāni, kenābhatāni, kimatthaṃ pariyāpuṇitabbāni. Tatrāyaṃ visajjanā, kena bhāsitānīti? Buddhānu buddhehi bhāsitāni. Kattha bhāsitānīti? Devesu ca mānussesu ca, bhāsitāni. Kadā bhāsitānīti? Bhagavato dharamānakāle ceva pacchimakāle ca bhāsitāni. Katamārabbha bhāsitānīti? Pañcavaggiyādike veneyya bandhave ārabbha bhāsitānīti. Kimatthaṃ bhāsitānīti? Tivajjañca avajjañca ñatvā vajjaṃ pahāya avajje paṭipattitvā nibbānapariyante. Diṭṭha-dhammikasamparāyikatthe sampāpuṇituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kena dhāritānīti? Anubuddhehi ceva sissānusissehi ca dhāritāni. Kenā bhatānīti? Ācariya paraṃparehi ābhatāni. Kimatthaṃ pariyāpuṇitabbānīti? Vajjañca avajjañca ñatvā vajjaṃ pahāya avajje paṭipattitvā nibbānapariyante diṭṭhadhammikasamparāyikatthe, saṃpāpuṇituṃ, yadevaṃ tāya nibbānapariyante diṭṭhadhammikasamparāyikatthe sādhikāni honti. Teva tattha kehi appamattena pariyāpuṇitabbāni dhāretabbāni dhāretabbāni vācetabbāni sajjhāyaṃ kātabbānīti [iti cullaganthavaṃse piṭakattaya dīpako nāma paṭhamo paricchedo.]"
  }
]