[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Nidānavaggapāḷi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Nidānasaṃyutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Paṭiccasamuppādasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tenāvuso ",
      " bhagavatā…pe… sammāsambuddhena nidānavaggasaṃyutte paṭhamaṃ saṃgītaṃ paṭiccasamuppādasuttaṃ kattha taṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tenāvuso bhagavatā…pe… sammāsambuddhena nidānavaggasaṃyutte paṭhamaṃ saṃgītaṃ paṭiccasamuppādasuttaṃ kattha taṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante pañcasate janapadavāsino bhikkhū ārabbha bhāsitaṃ. Pañcasatā bhante janapadavāsino bhikkhū sabbe ugghāṭitaññuno dhutaṅgadharā āraddhavīriyā yuttayogā vipassakā saṇhaṃ sukhumaṃ suññataṃ paccayākāradhammadesanaṃ patthayamānā bhagavantaṃ abhivādetvā bhagavantaṃ parivāretvā nisīdiṃsu. Tasmiṃ vatthusmiṃ ‘‘paṭiccasamuppādaṃ vo bhikkhave desessāmi, taṃ suṇātha sādhukaṃ manasi karotha, bhāsissāmī’’ti evamādinā bhante bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante pañcasate janapadavāsino bhikkhū ārabbha bhāsitaṃ. Pañcasatā bhante janapadavāsino bhikkhū sabbe ugghāṭitaññuno dhutaṅgadharā āraddhavīriyā yuttayogā vipassakā saṇhaṃ sukhumaṃ suññataṃ paccayākāradhammadesanaṃ patthayamānā bhagavantaṃ abhivādetvā bhagavantaṃ parivāretvā nisīdiṃsu. Tasmiṃ vatthusmiṃ ‘‘paṭiccasamuppādaṃ vo bhikkhave desessāmi, taṃ suṇātha sādhukaṃ manasi karotha, bhāsissāmī’’ti evamādinā bhante bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamo ",
      " ca bhikkhave paṭiccasamuppādo. Avijjāpaccayā bhikkhave saṅkhārā, saṅkhārapaccayā viññāṇaṃ (peyyāla) jātipaccayā jarāmaraṇaṃ sokaparidevadukkhadomanassupāsā sambhavanti, evametassa kevalassa dukkhandhassa samudayo hoti. Ayaṃ vuccati bhikkhave paṭiccasamuppādo."
    ],
    "innerText": "Katamo ca bhikkhave paṭiccasamuppādo. Avijjāpaccayā bhikkhave saṅkhārā, saṅkhārapaccayā viññāṇaṃ (peyyāla) jātipaccayā jarāmaraṇaṃ sokaparidevadukkhadomanassupāsā sambhavanti, evametassa kevalassa dukkhandhassa samudayo hoti. Ayaṃ vuccati bhikkhave paṭiccasamuppādo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Avijjāya tveva asesavirāganirodho saṅkhāranirodho (peyyāla) jātinirodhā jarāmaraṇaṃ sokaparidevadukkhadomanassupāyāsā nirujjhanti, evametassa kevalassa dukkhakkhandhassa nirodho hoti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Vibhaṅgasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tatthāvuso ",
      " dutiyaṃ saṃgītaṃ vibhaṅgasuttaṃ bhagavatā kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tatthāvuso dutiyaṃ saṃgītaṃ vibhaṅgasuttaṃ bhagavatā kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante pañcasate janapadavāsino vipañcitaññuno bhikkhū ārabbha bhāsitaṃ. Pañcasatā bhante janapadavāsikā bhikkhū vipañcitaññuno dhutaṅgadharā āraddhavīriyā yuttayogā vissakā saṇhaṃ sukhumaṃ suññatapaṭisaṃyuttaṃ paccayākāradhammadesanaṃ patthayamānā bhagavantaṃ parivāretvā nisīdiṃsu. Tasmiṃ vatthusmiṃ ‘‘paṭicca samuppādaṃ vo bhikkhave dedessāmi vibhajissāmi, taṃ suṇātha sādhukaṃ manasikarotha, bhāsissāmī’’ti evamādinā bhante bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante pañcasate janapadavāsino vipañcitaññuno bhikkhū ārabbha bhāsitaṃ. Pañcasatā bhante janapadavāsikā bhikkhū vipañcitaññuno dhutaṅgadharā āraddhavīriyā yuttayogā vissakā saṇhaṃ sukhumaṃ suññatapaṭisaṃyuttaṃ paccayākāradhammadesanaṃ patthayamānā bhagavantaṃ parivāretvā nisīdiṃsu. Tasmiṃ vatthusmiṃ ‘‘paṭicca samuppādaṃ vo bhikkhave dedessāmi vibhajissāmi, taṃ suṇātha sādhukaṃ manasikarotha, bhāsissāmī’’ti evamādinā bhante bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pañcaverabhayasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " pañcaverabhayasuttaṃ ",
      " panāvuso bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – pañcaverabhayasuttaṃ panāvuso bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante anāthapiṇḍikaṃ gahapatiṃ ārabbha ‘‘yato kho gahapati ariyasāvakassa pañca bhayāni verāni vūpasantāni honti, catūhi ca sotāpattiyaṅgehi samannāgato hoti, ariyo cassa ñāyo paññāya sudiṭṭho hoti suppaṭividdho, so ākaṅkhamāno attanāva attānaṃ byākareyya khīṇanirayomi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto, sotāpannohamasmi avinipātadhammo niyato sambodhiparāyano’’ti evaṃ kho bhante bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante anāthapiṇḍikaṃ gahapatiṃ ārabbha ‘‘yato kho gahapati ariyasāvakassa pañca bhayāni verāni vūpasantāni honti, catūhi ca sotāpattiyaṅgehi samannāgato hoti, ariyo cassa ñāyo paññāya sudiṭṭho hoti suppaṭividdho, so ākaṅkhamāno attanāva attānaṃ byākareyya khīṇanirayomi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto, sotāpannohamasmi avinipātadhammo niyato sambodhiparāyano’’ti evaṃ kho bhante bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " kathañcāvusotattha ",
      " bhagavatā ariyasāvakassa pañcannaṃ bhayānaṃ verānaṃ vūpasantatā pakāsitā."
    ],
    "innerText": "Pucchā – kathañcāvusotattha bhagavatā ariyasāvakassa pañcannaṃ bhayānaṃ verānaṃ vūpasantatā pakāsitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " ‘‘katamāni ",
      " pañca bhayāni verāni vūpasantāni honti. Yaṃ gahapati pāṇātipātī pāṇātipātapaccayā diṭṭhadhammikampi bhayaṃ veraṃ pasavati, samparāyikampi bhayaṃ veraṃ pasavati, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedayati. Pāṇātipātā ṭiviratassa evaṃ taṃ bhayaṃ veraṃ vūpasantaṃ hotī’’ti evamādinā bhante tattha bhagavatā ariyasāvakassa pañcannaṃ bhayānaṃ verānaṃ vūpasantatā pakāsitā."
    ],
    "innerText": "Vissajjanā – ‘‘katamāni pañca bhayāni verāni vūpasantāni honti. Yaṃ gahapati pāṇātipātī pāṇātipātapaccayā diṭṭhadhammikampi bhayaṃ veraṃ pasavati, samparāyikampi bhayaṃ veraṃ pasavati, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedayati. Pāṇātipātā ṭiviratassa evaṃ taṃ bhayaṃ veraṃ vūpasantaṃ hotī’’ti evamādinā bhante tattha bhagavatā ariyasāvakassa pañcannaṃ bhayānaṃ verānaṃ vūpasantatā pakāsitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " kathañcāvuso ",
      " tattha bhagavatā ariyasāvakassa catūhi sotāpattiyaṅgehi samannāgatatā pakāsitā."
    ],
    "innerText": "Pucchā – kathañcāvuso tattha bhagavatā ariyasāvakassa catūhi sotāpattiyaṅgehi samannāgatatā pakāsitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " katamehi catūhi sotāpattiyaṅgehi samannāgato hoti. Idha gahapati ariyasāvako buddhe aveccappasādena samannāgato hoti ‘‘itipiso bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaropurisadammasārathi satthādevamanussānaṃ buddho bhagavā’’ti evamādinā bhante tattha bhagavatā ariyasāvakassa catūhi sotāpattiyaṅgehi samannāgatatā pakāsitā."
    ],
    "innerText": "Vissajjanā – katamehi catūhi sotāpattiyaṅgehi samannāgato hoti. Idha gahapati ariyasāvako buddhe aveccappasādena samannāgato hoti ‘‘itipiso bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaropurisadammasārathi satthādevamanussānaṃ buddho bhagavā’’ti evamādinā bhante tattha bhagavatā ariyasāvakassa catūhi sotāpattiyaṅgehi samannāgatatā pakāsitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " kathañcāvuso ",
      " tattha bhagavatā ariyasāvakena ariyassa ñāyassa paññāya sudiṭṭhatā suppaṭividdhatā pakāsitā."
    ],
    "innerText": "Pucchā – kathañcāvuso tattha bhagavatā ariyasāvakena ariyassa ñāyassa paññāya sudiṭṭhatā suppaṭividdhatā pakāsitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " katamo cassa ariyo ñāyo paññāya sudiṭṭho hoti suppaṭividdho. Idha gahapati ariyasāvako paṭiccasamuppādaññeva sādhukaṃ yoniso manasi karoti ‘‘iti imasmiṃ sati idaṃ hoti, imasmiṃ asati idaṃ na hoti, imassuppādā idaṃ uppajjati, imassa nirodhā idaṃ nirujjhati, yadidaṃ avijjāpaccayā (peyyāla) evametassa kevalassa dukkhakkhandhassa nirodho hotī’’ti, evaṃ kho bhante bhagavatā tattha ariyasāvakena ariyassa ñāyassa paññāya sudiṭṭhatā suppaṭividdhatā pakāsitā."
    ],
    "innerText": "Vissajjanā – katamo cassa ariyo ñāyo paññāya sudiṭṭho hoti suppaṭividdho. Idha gahapati ariyasāvako paṭiccasamuppādaññeva sādhukaṃ yoniso manasi karoti ‘‘iti imasmiṃ sati idaṃ hoti, imasmiṃ asati idaṃ na hoti, imassuppādā idaṃ uppajjati, imassa nirodhā idaṃ nirujjhati, yadidaṃ avijjāpaccayā (peyyāla) evametassa kevalassa dukkhakkhandhassa nirodho hotī’’ti, evaṃ kho bhante bhagavatā tattha ariyasāvakena ariyassa ñāyassa paññāya sudiṭṭhatā suppaṭividdhatā pakāsitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yato ",
      " kho gahapati ariyasāvakassa imāni pañca bhayāni verāni vūpasantāni honti. Imehi catūhi sotāpattiyaṅgehi samannāgato hoti. Ayañcassa ariyo ñāyo paññāya sudiṭṭho hoti suppaṭividdho–"
    ],
    "innerText": "Yato kho gahapati ariyasāvakassa imāni pañca bhayāni verāni vūpasantāni honti. Imehi catūhi sotāpattiyaṅgehi samannāgato hoti. Ayañcassa ariyo ñāyo paññāya sudiṭṭho hoti suppaṭividdho–"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dukkhasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " dukkhasuttaṃ ",
      " panāvuso bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – dukkhasuttaṃ panāvuso bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘dukkhassa bhikkhave samudayañca atthaṅgamañca desessāmī’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘dukkhassa bhikkhave samudayañca atthaṅgamañca desessāmī’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " kathañcāvuso ",
      " tattha bhagavatā dukkhasamudayo pakāsito."
    ],
    "innerText": "Pucchā – kathañcāvuso tattha bhagavatā dukkhasamudayo pakāsito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " katamo ca bhikkhave dukkhassa samudayo. Cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā. Ayaṃ kho bhikkhave dukkhassa samudayo. Sotañca paṭicca sadde ca uppajjati sotaviññāṇaṃ…pe… ghānañca paṭicca gandhe ca…pe… jivhañca paṭicca rase ca…pe… kāyañca paṭicca phoṭṭhabbe ca…pe… manañca paṭicca dhamme ca uppajjati manoviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā. Ayaṃ kho bhikkhave dukkhassa samudayoti evaṃkho bhante tattha bhagavatā dukkhassa samudayo pakāsito."
    ],
    "innerText": "Vissajjanā – katamo ca bhikkhave dukkhassa samudayo. Cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā. Ayaṃ kho bhikkhave dukkhassa samudayo. Sotañca paṭicca sadde ca uppajjati sotaviññāṇaṃ…pe… ghānañca paṭicca gandhe ca…pe… jivhañca paṭicca rase ca…pe… kāyañca paṭicca phoṭṭhabbe ca…pe… manañca paṭicca dhamme ca uppajjati manoviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā. Ayaṃ kho bhikkhave dukkhassa samudayoti evaṃkho bhante tattha bhagavatā dukkhassa samudayo pakāsito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " kathañcāvuso ",
      " tattha bhagavatā dukkhassa atthaṅgamo pakāsito."
    ],
    "innerText": "Pucchā – kathañcāvuso tattha bhagavatā dukkhassa atthaṅgamo pakāsito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " katamo ca bhikkhave dukkhassa atthaṅgamo. Cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā, tassāyeva taṇhāya asesavirāganirodhā upādānanirodho upādānanirodhā bhavanirodho, bhavanirodhā jātinirodho, jātinirodhā jarāmaraṇaṃ sokaparidevadukkhadomanassupāyāsā nirujjhanti. Evametassa kevalassa dukkhakkhandhassa nirodho hotīti evamādinā bhante tattha bhagavatā dukkhassa atthaṅgamo pakāsito."
    ],
    "innerText": "Vissajjanā – katamo ca bhikkhave dukkhassa atthaṅgamo. Cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā, tassāyeva taṇhāya asesavirāganirodhā upādānanirodho upādānanirodhā bhavanirodho, bhavanirodhā jātinirodho, jātinirodhā jarāmaraṇaṃ sokaparidevadukkhadomanassupāyāsā nirujjhanti. Evametassa kevalassa dukkhakkhandhassa nirodho hotīti evamādinā bhante tattha bhagavatā dukkhassa atthaṅgamo pakāsito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Puttamaṃsūpamasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " puttamaṃsūpamasuttaṃ ",
      " panāvuso bhagavatā kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – puttamaṃsūpamasuttaṃ panāvuso bhagavatā kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante sambahule adhunā pabbajite bhikkhū ārabbha bhāsitaṃ. Bhagavato ca bhante bhikkhusaṅghassa ca mahālābhasakkāro udapādi, ekacce ca bhante bhikkhū navā acirapabbajitā kulaputtā āhāraṃ apaccavekkhitvā paribhuñjiṃsu. Tasmiṃ bhante vatthusmiṃ ‘‘cattārome bhikkhave āhārā bhūtānaṃ vā sattānaṃ ṭhitiyā sambhavesīnaṃ vā anuggahāya. Katame cattāro kabaḷīkāro āhāro oḷāriko vā sukhumo vā phasso dutiyo manosañcetanā tatiyā viññāṇaṃ catuttha’’nti evaṃ kho bhante bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante sambahule adhunā pabbajite bhikkhū ārabbha bhāsitaṃ. Bhagavato ca bhante bhikkhusaṅghassa ca mahālābhasakkāro udapādi, ekacce ca bhante bhikkhū navā acirapabbajitā kulaputtā āhāraṃ apaccavekkhitvā paribhuñjiṃsu. Tasmiṃ bhante vatthusmiṃ ‘‘cattārome bhikkhave āhārā bhūtānaṃ vā sattānaṃ ṭhitiyā sambhavesīnaṃ vā anuggahāya. Katame cattāro kabaḷīkāro āhāro oḷāriko vā sukhumo vā phasso dutiyo manosañcetanā tatiyā viññāṇaṃ catuttha’’nti evaṃ kho bhante bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " kathañcāvuso ",
      " tattha kabaḷīkārassa āhārassa daṭṭhabbākāro bhagavatā pakāsito."
    ],
    "innerText": "Pucchā – kathañcāvuso tattha kabaḷīkārassa āhārassa daṭṭhabbākāro bhagavatā pakāsito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " seyyathāpi bhikkhave dve jāyampatikā parittaṃ sambalaṃ ādāya kantāramaggaṃ paṭipajjeyyuṃ. Tesamassa ekaputtako piyo manāpoti evamādinā bhante tattha bhagavatā ",
      " kabaḷīkārassa āhārassa daṭṭhabbākāro pakāsito."
    ],
    "innerText": "Vissajjanā – seyyathāpi bhikkhave dve jāyampatikā parittaṃ sambalaṃ ādāya kantāramaggaṃ paṭipajjeyyuṃ. Tesamassa ekaputtako piyo manāpoti evamādinā bhante tattha bhagavatā kabaḷīkārassa āhārassa daṭṭhabbākāro pakāsito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " kathañcāvuso ",
      " tattha bhagavatā phassāhārassa daṭṭhabbākāro pakāsito."
    ],
    "innerText": "Pucchā – kathañcāvuso tattha bhagavatā phassāhārassa daṭṭhabbākāro pakāsito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " seyyathāpi bhikkhave gāvī niccammā kuṭṭaṃ ce nissāya tiṭṭheyya, ye kuṭṭanissitā pāṇā, te naṃ khādeyyuṃ. Rukkhaṃ ce nissāya tiṭṭheyya. Udakaṃ ce nissāya tiṭṭheyya. Ākāsaṃ ce nissāya tiṭṭheyya, ye ākāsanissitā pāṇā, te naṃ khādeyyunti evamādinā bhante tattha bhagavatā phassassa āhārassa daṭṭhabbākāro vitthāretvā pakāsito."
    ],
    "innerText": "Vissajjanā – seyyathāpi bhikkhave gāvī niccammā kuṭṭaṃ ce nissāya tiṭṭheyya, ye kuṭṭanissitā pāṇā, te naṃ khādeyyuṃ. Rukkhaṃ ce nissāya tiṭṭheyya. Udakaṃ ce nissāya tiṭṭheyya. Ākāsaṃ ce nissāya tiṭṭheyya, ye ākāsanissitā pāṇā, te naṃ khādeyyunti evamādinā bhante tattha bhagavatā phassassa āhārassa daṭṭhabbākāro vitthāretvā pakāsito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evameva ",
      " khvāhaṃ bhikkhave phassāhāro daṭṭhabboti vadāmi."
    ],
    "innerText": "Evameva khvāhaṃ bhikkhave phassāhāro daṭṭhabboti vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " kathañcāvuso ",
      " tattha bhagavatā manosañcetanāhārassa daṭṭhabbākāro pakāsito."
    ],
    "innerText": "Pucchā – kathañcāvuso tattha bhagavatā manosañcetanāhārassa daṭṭhabbākāro pakāsito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " seyyathāpi bhikkhave aṅgārakāsu sādhikaporisā puṇṇā aṅgārānaṃ vītaccikānaṃ vītadhūmānaṃ. Atha puriso āgaccheyya jīvitukāmo amaritukāmo sukha kāmo dukkhappaṭikūloti evamādinā bhante tattha bhagavatā manosañcetanāhārassa daṭṭhabbākāro vitthārena pakāsito."
    ],
    "innerText": "Vissajjanā – seyyathāpi bhikkhave aṅgārakāsu sādhikaporisā puṇṇā aṅgārānaṃ vītaccikānaṃ vītadhūmānaṃ. Atha puriso āgaccheyya jīvitukāmo amaritukāmo sukha kāmo dukkhappaṭikūloti evamādinā bhante tattha bhagavatā manosañcetanāhārassa daṭṭhabbākāro vitthārena pakāsito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " kathañcāvuso ",
      " tattha bhagavatā viññāṇāhārassa daṭṭhabbākāro pakāsito."
    ],
    "innerText": "Pucchā – kathañcāvuso tattha bhagavatā viññāṇāhārassa daṭṭhabbākāro pakāsito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " seyyathāpi bhikkhave coraṃ āgucāriṃ gahetvā rañño dasseyyuṃ ‘‘ayaṃ te devacoro āgucārī, imassa yaṃ icchasi, taṃ daṇḍaṃ paṇehī’’ti evamādinā bhante tattha bhagavatā viññāṇāhārassa daṭṭhabbākāro pakāsito."
    ],
    "innerText": "Vissajjanā – seyyathāpi bhikkhave coraṃ āgucāriṃ gahetvā rañño dasseyyuṃ ‘‘ayaṃ te devacoro āgucārī, imassa yaṃ icchasi, taṃ daṇḍaṃ paṇehī’’ti evamādinā bhante tattha bhagavatā viññāṇāhārassa daṭṭhabbākāro pakāsito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Susimaparibbājakasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tenāvuso ",
      " bhagavatā…pe… sammāsambuddhena susimaparibbājaka suttaṃ kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tenāvuso bhagavatā…pe… sammāsambuddhena susimaparibbājaka suttaṃ kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " rājagahe bhante āyasmantaṃ susimaṃ ārabbha bhāsitaṃ. Āyasmā bhante susimo yāvatako bhikkhūhi saddhiṃ ahosi kathāsallāpo, taṃ sabbaṃ bhagavato ārocesi. Tasmiṃ vatthusmiṃ ‘‘pubbe kho susima dhammaṭṭhitiñāṇaṃ, pacchā nibbāne ñāṇa’’nti evamādinā bhante bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – rājagahe bhante āyasmantaṃ susimaṃ ārabbha bhāsitaṃ. Āyasmā bhante susimo yāvatako bhikkhūhi saddhiṃ ahosi kathāsallāpo, taṃ sabbaṃ bhagavato ārocesi. Tasmiṃ vatthusmiṃ ‘‘pubbe kho susima dhammaṭṭhitiñāṇaṃ, pacchā nibbāne ñāṇa’’nti evamādinā bhante bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " kathañcāvuso ",
      " tattha bhagavā āyasmato susimattherassa sampatiarahattapattassa anuyogavasena paṭipucchitvā paṭipucchitvā uttari dhammadesanaṃ vitthāretvā desesi."
    ],
    "innerText": "Pucchā – kathañcāvuso tattha bhagavā āyasmato susimattherassa sampatiarahattapattassa anuyogavasena paṭipucchitvā paṭipucchitvā uttari dhammadesanaṃ vitthāretvā desesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " jātipaccayā jarāmaraṇanti susima passasīti. Evaṃ bhante. Bhavapaccayā jātīti susima passasīti. Evaṃ bhanteti evamādinā bhante bhagavā tattha āyasmato susimassa sampatiarahattapattassa uttaripi anuyogavasena paṭipucchitvā paṭipucchitvā vitthārato dhammaṃ desesi."
    ],
    "innerText": "Vissajjanā – jātipaccayā jarāmaraṇanti susima passasīti. Evaṃ bhante. Bhavapaccayā jātīti susima passasīti. Evaṃ bhanteti evamādinā bhante bhagavā tattha āyasmato susimassa sampatiarahattapattassa uttaripi anuyogavasena paṭipucchitvā paṭipucchitvā vitthārato dhammaṃ desesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassa ",
      " me bhante bhagavā accayaṃ accayato paṭiggaṇhātu āyatiṃsaṃvarāya–"
    ],
    "innerText": "Tassa me bhante bhagavā accayaṃ accayato paṭiggaṇhātu āyatiṃsaṃvarāya–"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Abhisamayasaṃyutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nakhasikhāsutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " abhisamayasaṃyutte ",
      " panāvuso paṭhamaṃ saṃgītaṃ nakhasikhāsuttaṃ bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – abhisamayasaṃyutte panāvuso paṭhamaṃ saṃgītaṃ nakhasikhāsuttaṃ bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘taṃ kiṃ maññatha bhikkhave, katamaṃ nu kho bahutaraṃ, yo vāyaṃ mayā paritto nakhasikhāyaṃ paṃsuāropito, ayaṃ vā mahāpathavī’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘taṃ kiṃ maññatha bhikkhave, katamaṃ nu kho bahutaraṃ, yo vāyaṃ mayā paritto nakhasikhāyaṃ paṃsuāropito, ayaṃ vā mahāpathavī’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Dhātusaṃyutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Caṅkamasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " dhātusaṃyutte ",
      " panāvuso caṅkamasuttaṃ bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – dhātusaṃyutte panāvuso caṅkamasuttaṃ bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " rājagahe bhante sambahule bhikkhū ārabbha ‘‘dhātusova bhikkhave sattā saṃsandanti samenti, hīnādhimuttikā hīnādhimuttikehi saddhiṃ saṃsandanti samenti, kalyāṇādhimuttikā kalyāṇādhimuttikehi saddhiṃ saṃsandanti samentī’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – rājagahe bhante sambahule bhikkhū ārabbha ‘‘dhātusova bhikkhave sattā saṃsandanti samenti, hīnādhimuttikā hīnādhimuttikehi saddhiṃ saṃsandanti samenti, kalyāṇādhimuttikā kalyāṇādhimuttikehi saddhiṃ saṃsandanti samentī’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Assaddhasaṃsandanasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " assaddhasaṃsandanasuttaṃ ",
      " panāvuso bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – assaddhasaṃsandanasuttaṃ panāvuso bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘dhātusova bhikkhave sattā saṃsandanti samenti, assaddhā assaddhehi saddhiṃ saṃsandanti samenti, ahirikā ahirikehi saddhiṃ saṃsandanti samenti, anottappino. Appassutā. Kusītā. Muṭṭhassatino. Duppaññā duppaññehi saddhiṃ saṃsandanti samentī’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘dhātusova bhikkhave sattā saṃsandanti samenti, assaddhā assaddhehi saddhiṃ saṃsandanti samenti, ahirikā ahirikehi saddhiṃ saṃsandanti samenti, anottappino. Appassutā. Kusītā. Muṭṭhassatino. Duppaññā duppaññehi saddhiṃ saṃsandanti samentī’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Anamataggasaṃyutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pathavīsutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " anamataggasaṃyutte ",
      " āvuso dutiyaṃ saṃgītaṃ pathavīsuttaṃ kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – anamataggasaṃyutte āvuso dutiyaṃ saṃgītaṃ pathavīsuttaṃ kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘anamataggoyaṃ bhikkhave saṃsāro, pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Seyyathāpi bhikkhave puriso imaṃ mahāpathaviṃ kolaṭṭhimattaṃ kolaṭṭhimattaṃ mattikāguḷikaṃ karitvā nikkhipeyya ‘ayaṃ me piyā, tassa me pitu ayaṃ pitā’ti. Apariyādinnāva bhikkhave tassa purisassa pitupitaro assu. Athāyaṃ mahāpathavī parikkhayaṃ pariyādānaṃ gaccheyya. Taṃ kissahetu, anamataggoyaṃ bhikkhave saṃsāro, pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhā saṃyojanānaṃ sandhāvataṃ saṃsarataṃ’’ evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘anamataggoyaṃ bhikkhave saṃsāro, pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Seyyathāpi bhikkhave puriso imaṃ mahāpathaviṃ kolaṭṭhimattaṃ kolaṭṭhimattaṃ mattikāguḷikaṃ karitvā nikkhipeyya ‘ayaṃ me piyā, tassa me pitu ayaṃ pitā’ti. Apariyādinnāva bhikkhave tassa purisassa pitupitaro assu. Athāyaṃ mahāpathavī parikkhayaṃ pariyādānaṃ gaccheyya. Taṃ kissahetu, anamataggoyaṃ bhikkhave saṃsāro, pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhā saṃyojanānaṃ sandhāvataṃ saṃsarataṃ’’ evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " dīgharattaṃ vo bhikkhave dukkhaṃ paccanubhūtaṃ tibbaṃ paccanubhūtaṃ byasanaṃ paccanubhūtaṃ kaṭasī vaḍḍhitā."
    ],
    "innerText": "Evaṃ dīgharattaṃ vo bhikkhave dukkhaṃ paccanubhūtaṃ tibbaṃ paccanubhūtaṃ byasanaṃ paccanubhūtaṃ kaṭasī vaḍḍhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Alameva ",
      " sabbasaṅkhāresu nibbindituṃ,"
    ],
    "innerText": "Alameva sabbasaṅkhāresu nibbindituṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Alaṃ virajjituṃ, alaṃ vimuccituṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Assusutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tatthāvuso tatiyaṃ saṃgītaṃ assusuttaṃ bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tatthāvuso tatiyaṃ saṃgītaṃ assusuttaṃ bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante sambahuleyeva bhikkhū ārabbha ‘‘taṃ kiṃ maññatha bhikkhave, katamaṃ nu kho bahutaraṃ, yaṃ vā vo iminā dīghena addhunā sandhāvataṃ saṃsarataṃ amanāpasampayogā manāpavippayogā kandantānaṃ rodantānaṃ assu passannaṃ paggharitaṃ, yaṃ vā catūsu mahāsamuddesu udaka’’nti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante sambahuleyeva bhikkhū ārabbha ‘‘taṃ kiṃ maññatha bhikkhave, katamaṃ nu kho bahutaraṃ, yaṃ vā vo iminā dīghena addhunā sandhāvataṃ saṃsarataṃ amanāpasampayogā manāpavippayogā kandantānaṃ rodantānaṃ assu passannaṃ paggharitaṃ, yaṃ vā catūsu mahāsamuddesu udaka’’nti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sāsapasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tatthāvuso ",
      " chaṭṭhaṃ saṃgītaṃ sāsapasuttaṃ bhagavatā kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tatthāvuso chaṭṭhaṃ saṃgītaṃ sāsapasuttaṃ bhagavatā kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante aññataraṃ bhikkhuṃ ārabbha bhāsitaṃ. Aññataro bhante bhikkhu bhagavantaṃ etadavoca ‘‘kīvadīgho nu kho bhante kappo’’ti. Tasmiṃ bhante vatthusmiṃ ‘‘dīgho kho bhikkhu kappo, so na sukaro saṅkhātuṃ ettakāni vassāni itivā, (peyyāla) ettakāni vassasatasahassāni itivāti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante aññataraṃ bhikkhuṃ ārabbha bhāsitaṃ. Aññataro bhante bhikkhu bhagavantaṃ etadavoca ‘‘kīvadīgho nu kho bhante kappo’’ti. Tasmiṃ bhante vatthusmiṃ ‘‘dīgho kho bhikkhu kappo, so na sukaro saṅkhātuṃ ettakāni vassāni itivā, (peyyāla) ettakāni vassasatasahassāni itivāti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Gaṅgāsutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tenāvuso…pe… ",
      " sammāsambuddhena anamataggasaṃyutte gaṅgāsuttaṃ kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tenāvuso…pe… sammāsambuddhena anamataggasaṃyutte gaṅgāsuttaṃ kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " rājagahe bhante aññataraṃ brāhmaṇaṃ ārabbha bhāsitaṃ. Aññataro bhante brāhmaṇo bhagavantaṃ etadavoca ‘‘kīva-"
    ],
    "innerText": "Vissajjanā – rājagahe bhante aññataraṃ brāhmaṇaṃ ārabbha bhāsitaṃ. Aññataro bhante brāhmaṇo bhagavantaṃ etadavoca ‘‘kīva-"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bahukā ",
      " nu kho bho gotama kappā abbhatītā atikkantā’’ti. Tasmiṃ bhante vatthusmiṃ ‘‘bahukā kho brāhmaṇa kappā abbhatītā atikkantā, te na sukarā saṅkhātuṃ ‘ettakā kappā’ iti vā ‘ettakāni kappasatāni’ iti vā ‘ettakāni kappasahassāni’ itivā ‘ettakāni kappasatasahassāni’ iti vā’’ti eva mādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Bahukā nu kho bho gotama kappā abbhatītā atikkantā’’ti. Tasmiṃ bhante vatthusmiṃ ‘‘bahukā kho brāhmaṇa kappā abbhatītā atikkantā, te na sukarā saṅkhātuṃ ‘ettakā kappā’ iti vā ‘ettakāni kappasatāni’ iti vā ‘ettakāni kappasahassāni’ itivā ‘ettakāni kappasatasahassāni’ iti vā’’ti eva mādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Puggalasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " puggalasuttaṃ ",
      " panāvuso bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – puggalasuttaṃ panāvuso bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " rājagahe bhante sambahule bhikkhū ārabbha ‘‘anamataggoyaṃ bhikkhave saṃsāro, pubbākoṭi na paññāyati avijjā nīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Ekapuggalassa bhikkhave kappaṃ sandhāvato saṃsarato siyā evaṃ mahā aṭṭhikaṅkalo aṭṭhipuñjo aṭṭhirāsi, yathā yaṃ vepullo pabbato. Sace saṃhārako assa, sambhatañca na vinassetyā’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – rājagahe bhante sambahule bhikkhū ārabbha ‘‘anamataggoyaṃ bhikkhave saṃsāro, pubbākoṭi na paññāyati avijjā nīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Ekapuggalassa bhikkhave kappaṃ sandhāvato saṃsarato siyā evaṃ mahā aṭṭhikaṅkalo aṭṭhipuñjo aṭṭhirāsi, yathā yaṃ vepullo pabbato. Sace saṃhārako assa, sambhatañca na vinassetyā’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Duggatasutta, sukhitasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tatthāvuso ",
      " duggatasuttañca sukhitasuttañca bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tatthāvuso duggatasuttañca sukhitasuttañca bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘anamataggoyaṃ bhikkhave saṃsāro, pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Yaṃ bhikkhave passeyyātha duggataṃ durūpetaṃ, niṭṭhamettha gantabbaṃ ‘amhehipi evarūpaṃ paccanubhūtaṃ iminā dīghena addhunā’ti, yaṃ bhikkhave passeyyātha sukhitaṃ susajjitaṃ,"
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘anamataggoyaṃ bhikkhave saṃsāro, pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Yaṃ bhikkhave passeyyātha duggataṃ durūpetaṃ, niṭṭhamettha gantabbaṃ ‘amhehipi evarūpaṃ paccanubhūtaṃ iminā dīghena addhunā’ti, yaṃ bhikkhave passeyyātha sukhitaṃ susajjitaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Niṭṭhamettha ",
      " gantabbaṃ, ‘‘amhehipi paccanubhūtaṃ iminā dīghena addhunā’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Niṭṭhamettha gantabbaṃ, ‘‘amhehipi paccanubhūtaṃ iminā dīghena addhunā’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Tiṃsamattasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tiṃsamattasuttaṃ ",
      " panāvuso bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tiṃsamattasuttaṃ panāvuso bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " rājagahe bhante tiṃsamatte pāveyyake bhikkhū ārabbha ‘‘anamataggoyaṃ bhikkhave saṃsāro, pubbākoṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Taṃ kiṃ maññatha bhikkhave, katamaṃ nu kho bahutaraṃ, yaṃ vā vo iminā dīghena addhunā sandhāvataṃ saṃsarataṃ sīsacchinnānaṃ lohitaṃ passannaṃ paggharitaṃ, yaṃ vā catūsu mahāsamuddesu udaka’’nti evamādinā bhavagatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – rājagahe bhante tiṃsamatte pāveyyake bhikkhū ārabbha ‘‘anamataggoyaṃ bhikkhave saṃsāro, pubbākoṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Taṃ kiṃ maññatha bhikkhave, katamaṃ nu kho bahutaraṃ, yaṃ vā vo iminā dīghena addhunā sandhāvataṃ saṃsarataṃ sīsacchinnānaṃ lohitaṃ passannaṃ paggharitaṃ, yaṃ vā catūsu mahāsamuddesu udaka’’nti evamādinā bhavagatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Mātusutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " mātusuttādīni ",
      " panāvuso chasuttāni bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – mātusuttādīni panāvuso chasuttāni bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘anamataggoyaṃ bhikkhave saṃsāro, pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Na so bhikkhave satto sulabharūpo, yo na mātābhūtapubbo iminā dīghena addhunā. Yo na pitābhūtapubbo. Yo na bhātābhūtapubbo. Yo na bhaginibhūtapubbo. Yo na puttabhūtapubbo. Yo na dhītābhūtapubbo ",
      " iminā dīghena addhunā’’ti evamādinā bhante bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘anamataggoyaṃ bhikkhave saṃsāro, pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Na so bhikkhave satto sulabharūpo, yo na mātābhūtapubbo iminā dīghena addhunā. Yo na pitābhūtapubbo. Yo na bhātābhūtapubbo. Yo na bhaginibhūtapubbo. Yo na puttabhūtapubbo. Yo na dhītābhūtapubbo iminā dīghena addhunā’’ti evamādinā bhante bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Kassapasaṃyutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Candūpamasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " kassapasaṃyutte ",
      " panāvuso candūpamasuttaṃ bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – kassapasaṃyutte panāvuso candūpamasuttaṃ bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘candūpamā bhikkhave kulāni upasaṅkamatha apakasseva kāyaṃ apakassa cittaṃ niccanavakā kulesu appagabbhā. Seyyathāpi bhikkhave puriso jarudapānaṃ vā olokeyya pabbatavisamaṃ vā nadīviduggaṃ vā apakasseva kāyaṃ apakassa cittaṃ. Evameva kho bhikkhave candūpamā kulāni upasaṅkamatha apakasseva kāyaṃ apakassa cittaṃ niccanavakā kulesu appagabbhā’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘candūpamā bhikkhave kulāni upasaṅkamatha apakasseva kāyaṃ apakassa cittaṃ niccanavakā kulesu appagabbhā. Seyyathāpi bhikkhave puriso jarudapānaṃ vā olokeyya pabbatavisamaṃ vā nadīviduggaṃ vā apakasseva kāyaṃ apakassa cittaṃ. Evameva kho bhikkhave candūpamā kulāni upasaṅkamatha apakasseva kāyaṃ apakassa cittaṃ niccanavakā kulesu appagabbhā’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Taṃ ",
      " kiṃ maññatha bhikkhave, kathaṃ rūpā bhikkhu arahati kulāni upasaṅkamituṃ."
    ],
    "innerText": "Taṃ kiṃ maññatha bhikkhave, kathaṃ rūpā bhikkhu arahati kulāni upasaṅkamituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " kathañcāvuso ",
      " tattha bhagavatā parisuddhāparisuddha dhammadesanaṃ dassetvā bhikkhūnaṃ ovādo dinno."
    ],
    "innerText": "Pucchā – kathañcāvuso tattha bhagavatā parisuddhāparisuddha dhammadesanaṃ dassetvā bhikkhūnaṃ ovādo dinno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " ‘‘taṃ kiṃ maññatha bhikkhave, kathaṃ rūpassa bhikkhuno aparisuddhā dhammadesanā hoti, kathaṃ rūpassa bhikkhuno parisuddhā dhammadesanā ",
      " hotī’’ti evamādinā parisuddhāparisuddhadhammadesanā vitthārato dassetvā ‘‘kassapena vā hi vo bhikkhave ovadissāmi yo vā panassa kassapasadiso, ovaditehi ca pana vo tathattāya paṭipajjitabba’’nti. Evaṃ kho bhante bhagavato bhikkhūnaṃ ovādo dinno."
    ],
    "innerText": "Vissajjanā – ‘‘taṃ kiṃ maññatha bhikkhave, kathaṃ rūpassa bhikkhuno aparisuddhā dhammadesanā hoti, kathaṃ rūpassa bhikkhuno parisuddhā dhammadesanā hotī’’ti evamādinā parisuddhāparisuddhadhammadesanā vitthārato dassetvā ‘‘kassapena vā hi vo bhikkhave ovadissāmi yo vā panassa kassapasadiso, ovaditehi ca pana vo tathattāya paṭipajjitabba’’nti. Evaṃ kho bhante bhagavato bhikkhūnaṃ ovādo dinno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yo ",
      " hi koci bhikkhave bhikkhu evaṃcitto paresaṃ dhammaṃ deseti ‘‘aho vata me dhammaṃ suṇeyyuṃ, sutvā ca pana dhammaṃ pasīdeyyuṃ, pasannā ca me pasannākāraṃ kareyyuṃ–"
    ],
    "innerText": "Yo hi koci bhikkhave bhikkhu evaṃcitto paresaṃ dhammaṃ deseti ‘‘aho vata me dhammaṃ suṇeyyuṃ, sutvā ca pana dhammaṃ pasīdeyyuṃ, pasannā ca me pasannākāraṃ kareyyuṃ–"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehi passiko opaneyyiko paccattaṃ veditabbo viññūhi–"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kassapena ",
      " vā hi vo bhikkhave ovadissāmi yo vā panassa kassapasadiso, ovaditehi ca pana vo tathattāya paṭipajjitabbaṃ–"
    ],
    "innerText": "Kassapena vā hi vo bhikkhave ovadissāmi yo vā panassa kassapasadiso, ovaditehi ca pana vo tathattāya paṭipajjitabbaṃ–"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Kulūpakasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tenāvuso ",
      " bhagavatā…pe… sammāsambuddhena kassapasaṃyutte catutthaṃ kulūpakasuttaṃ kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tenāvuso bhagavatā…pe… sammāsambuddhena kassapasaṃyutte catutthaṃ kulūpakasuttaṃ kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘taṃ kiṃ maññatha bhikkhave, kathaṃ rūpo bhikkhu arahati kulūpako hotuṃ, kathaṃ rūpo bhikkhu na arahati kulūpako hotu’’nti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘taṃ kiṃ maññatha bhikkhave, kathaṃ rūpo bhikkhu arahati kulūpako hotuṃ, kathaṃ rūpo bhikkhu na arahati kulūpako hotu’’nti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kassapena ",
      " vā hi vo bhikkhave ovadissāmi yo vā panassa kassapasadiso, ovaditehi ca pana vo tathattāya paṭipajjitabbaṃ."
    ],
    "innerText": "Kassapena vā hi vo bhikkhave ovadissāmi yo vā panassa kassapasadiso, ovaditehi ca pana vo tathattāya paṭipajjitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dutiya ovādasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tatthevāvuso ",
      " bhagavatā dutiya ovādasuttaṃ kattha kena saddhiṃ kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tatthevāvuso bhagavatā dutiya ovādasuttaṃ kattha kena saddhiṃ kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " rājagahe bhante āyasmatā mahākassapena saddhiṃ ‘‘ovada kassapa bhikkhū, karohi kassapa bhikkhūnaṃ dhammiṃ kathaṃ, ahaṃ vā kassapa bhikkhū ovadeyyaṃ tvaṃ vā, ahaṃ vā bhikkhūnaṃ dhammiṃ kathaṃ kareyyaṃ tvaṃ vā’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – rājagahe bhante āyasmatā mahākassapena saddhiṃ ‘‘ovada kassapa bhikkhū, karohi kassapa bhikkhūnaṃ dhammiṃ kathaṃ, ahaṃ vā kassapa bhikkhū ovadeyyaṃ tvaṃ vā, ahaṃ vā bhikkhūnaṃ dhammiṃ kathaṃ kareyyaṃ tvaṃ vā’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yassa ",
      " kassaci bhante saddhā natthi kusalesu dhammesu, hirī natthi. Ottappaṃ natthi. Vīriyaṃ natthi. Paññā natthi kusalesu dhammesu."
    ],
    "innerText": "Yassa kassaci bhante saddhā natthi kusalesu dhammesu, hirī natthi. Ottappaṃ natthi. Vīriyaṃ natthi. Paññā natthi kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Tatiya ovādasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tatthevāvuso ",
      " bhagavatā tatiyaovādasuttaṃ kattha kena saddhiṃ kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tatthevāvuso bhagavatā tatiyaovādasuttaṃ kattha kena saddhiṃ kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " rājagahe bhante āyasmatāyeva mahākassapena saddhiṃ ‘‘ovada kassapa bhikkhū. Karohi kassapa bhikkhūnaṃ dhammiṃ kathaṃ, ahaṃ vā kassapa bhikkhū ovadeyyaṃ tvaṃ vā. Ahaṃ vā bhikkhūnaṃ dhammaṃ kathaṃ kareyyaṃ tvaṃ vā’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – rājagahe bhante āyasmatāyeva mahākassapena saddhiṃ ‘‘ovada kassapa bhikkhū. Karohi kassapa bhikkhūnaṃ dhammiṃ kathaṃ, ahaṃ vā kassapa bhikkhū ovadeyyaṃ tvaṃ vā. Ahaṃ vā bhikkhūnaṃ dhammaṃ kathaṃ kareyyaṃ tvaṃ vā’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dubbacā ",
      " kho bhante etarahi bhikkhū dovacassakaraṇehi dhammehi samannāgatā akkhamā appadakkhiṇaggāhino anusāsaniṃ–"
    ],
    "innerText": "Dubbacā kho bhante etarahi bhikkhū dovacassakaraṇehi dhammehi samannāgatā akkhamā appadakkhiṇaggāhino anusāsaniṃ–"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Saddhammappatirūpakasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tatthevāvuso ",
      " bhagavatā pariyosānaṃ saddhammappatirūpakasuttaṃ kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tatthevāvuso bhagavatā pariyosānaṃ saddhammappatirūpakasuttaṃ kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante āyasmantaṃyeva mahākassapaṃ ārabbha bhāsitaṃ. Āyasmā bhante mahākassapo bhagavantaṃ etadevoca ‘‘ko nu kho bhante hetu ko paccayo, yena pubbe appatarāni ceva sikkhāpadāni ahesuṃ, bahutarā ca bhikkhū aññāya saṇṭhahiṃsu. Ko pana bhante hetu ko paccayo, yenetarahi bahutarāni ceva sakkhāpadāni appatarā ca bhikkhū aññāya saṇṭhahantī’’ti. Tasmiṃ bhante vatthusmiṃ ‘‘evañcetaṃ kassapa hoti sattesu hāyamānesu saddhamme antaradhāyamāne bahutarāniceva sikkhāpadāni ",
      " honti, appatarāca bhikkhū aññāya saṇṭhahantī’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante āyasmantaṃyeva mahākassapaṃ ārabbha bhāsitaṃ. Āyasmā bhante mahākassapo bhagavantaṃ etadevoca ‘‘ko nu kho bhante hetu ko paccayo, yena pubbe appatarāni ceva sikkhāpadāni ahesuṃ, bahutarā ca bhikkhū aññāya saṇṭhahiṃsu. Ko pana bhante hetu ko paccayo, yenetarahi bahutarāni ceva sakkhāpadāni appatarā ca bhikkhū aññāya saṇṭhahantī’’ti. Tasmiṃ bhante vatthusmiṃ ‘‘evañcetaṃ kassapa hoti sattesu hāyamānesu saddhamme antaradhāyamāne bahutarāniceva sikkhāpadāni honti, appatarāca bhikkhū aññāya saṇṭhahantī’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Lābhasakkārasaṃyutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Mīḷhakasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tenāvuso…pe… ",
      " sammāsambuddhena lābhasakkāraṃyutte pañcamaṃ saṃgītaṃ mīḷhakasuttaṃ kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tenāvuso…pe… sammāsambuddhena lābhasakkāraṃyutte pañcamaṃ saṃgītaṃ mīḷhakasuttaṃ kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘dāruṇo bhikkhave lābhasakkārasiloko pharuso antarāyiko anuttarassa yogakkhemassa adhigamāya. Seyyathāpi bhikkhave mīḷhakā gūthādī gūthapūrā puṇṇā gūthassa, purato cassa mahāgūthapuñjo, sā tena aññā mīḷhakā atimaññeyya ‘‘ahamhi gūthādī gūthapūrā puṇṇā gūthassa, purato ca myāyaṃ mahāgūthapuñjo’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘dāruṇo bhikkhave lābhasakkārasiloko pharuso antarāyiko anuttarassa yogakkhemassa adhigamāya. Seyyathāpi bhikkhave mīḷhakā gūthādī gūthapūrā puṇṇā gūthassa, purato cassa mahāgūthapuñjo, sā tena aññā mīḷhakā atimaññeyya ‘‘ahamhi gūthādī gūthapūrā puṇṇā gūthassa, purato ca myāyaṃ mahāgūthapuñjo’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Taṃ ",
      " hi tassa bhikkhave moghapurisassa hoti dīgharattaṃ ahitāya dukkhāya."
    ],
    "innerText": "Taṃ hi tassa bhikkhave moghapurisassa hoti dīgharattaṃ ahitāya dukkhāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ dāruṇo kho bhikkhave lābhasakkārasiloko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmātiha ",
      " bhikkhave evaṃ sikkhitabbaṃ, ‘‘uppannaṃ lābhasakkārasi lokaṃ pajahissāma, na ca no uppanno lābhasakkārasiloko cittaṃ pariyādāya ṭhassabhī’’ti, evañhi kho bhikkhave sikkhitabbaṃ."
    ],
    "innerText": "Tasmātiha bhikkhave evaṃ sikkhitabbaṃ, ‘‘uppannaṃ lābhasakkārasi lokaṃ pajahissāma, na ca no uppanno lābhasakkārasiloko cittaṃ pariyādāya ṭhassabhī’’ti, evañhi kho bhikkhave sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ekaputtakasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tattho āvuso porāṇakehi dhammasaṃgāhakehi saṃgītaṃ ekaputtakasuttaṃ kattha kaṃ ārabbhaṃ kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tattho āvuso porāṇakehi dhammasaṃgāhakehi saṃgītaṃ ekaputtakasuttaṃ kattha kaṃ ārabbhaṃ kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘dāruṇo bhikkhave lābhasakkārasiloko kaṭuko pharuso antarāyiko anuttarassa yogakkhemassa adhigamāya, saddhā bhikkhave upāsikā ekaputtakaṃ piyaṃ manāpaṃ evaṃ sammāāyācamānā ",
      " āyāceyya tādiso tāta bhavāhi, yādiso citto ca gahapati hatthako ca āḷavako’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘dāruṇo bhikkhave lābhasakkārasiloko kaṭuko pharuso antarāyiko anuttarassa yogakkhemassa adhigamāya, saddhā bhikkhave upāsikā ekaputtakaṃ piyaṃ manāpaṃ evaṃ sammāāyācamānā āyāceyya tādiso tāta bhavāhi, yādiso citto ca gahapati hatthako ca āḷavako’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Esā ",
      " bhikkhave tulā etaṃ pamāṇaṃ mama sāvakānaṃ upāsakānaṃ yadidaṃ citto ca gahapati hatthako ca āḷavako."
    ],
    "innerText": "Esā bhikkhave tulā etaṃ pamāṇaṃ mama sāvakānaṃ upāsakānaṃ yadidaṃ citto ca gahapati hatthako ca āḷavako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sace kho tvaṃ tāta agārasmā anagāriyaṃ pabbajasi, tādiso tāta bhavāhi, yādisā sāriputtamoggallānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Mā ca kho tvaṃ tāta sekhaṃ appattamānasaṃ lābhasakkārasiloko anupāpuṇātu–"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " dāruṇo bhikkhave lābhasakkārasiloko kaṭuko pharuso antarāyiko anuttarassa yogakkhemassa adhigamāya."
    ],
    "innerText": "Evaṃ dāruṇo bhikkhave lābhasakkārasiloko kaṭuko pharuso antarāyiko anuttarassa yogakkhemassa adhigamāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ekavītusutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tattheva ",
      " āvuso porāṇakehi dhammasaṃgāyakehi saṃgītaṃ ekadhītusuttaṃ bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tattheva āvuso porāṇakehi dhammasaṃgāyakehi saṃgītaṃ ekadhītusuttaṃ bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃyeva bhante sambahule bhikkhū ārabbha ‘‘dāruṇo bhikkhave lābhasakkārasiloko kaṭuko pharuso antarāyiko anuttarassa yogakkhemassa adhigamāya. Saddhā bhikkhave upāsikā ekaṃ dhītaraṃ piyaṃ manāpaṃ evaṃ sammā āyācamānā āyāceyya ‘tādisā ayye bhavāhi, yādisā khujjuttarā ca upāsikā veḷukaṇḍakiyā ca nandamātā’ti. Esā bhikkhave tulā etaṃ pamāṇaṃ mama sāvikānaṃ upāsikānaṃ, yadidaṃ khujjuttarā ca upāsikā veḷukaṇḍakiyā ca nandamātā’’ti evamādinā bhante bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃyeva bhante sambahule bhikkhū ārabbha ‘‘dāruṇo bhikkhave lābhasakkārasiloko kaṭuko pharuso antarāyiko anuttarassa yogakkhemassa adhigamāya. Saddhā bhikkhave upāsikā ekaṃ dhītaraṃ piyaṃ manāpaṃ evaṃ sammā āyācamānā āyāceyya ‘tādisā ayye bhavāhi, yādisā khujjuttarā ca upāsikā veḷukaṇḍakiyā ca nandamātā’ti. Esā bhikkhave tulā etaṃ pamāṇaṃ mama sāvikānaṃ upāsikānaṃ, yadidaṃ khujjuttarā ca upāsikā veḷukaṇḍakiyā ca nandamātā’’ti evamādinā bhante bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sace ",
      " kho tvaṃ ayye agārasmā anagāriyaṃ pabbajasi, bhādisā ayye bhavāhi, yādisā khemā ca bhikkhunī uppalavaṇṇā ca–"
    ],
    "innerText": "Sace kho tvaṃ ayye agārasmā anagāriyaṃ pabbajasi, bhādisā ayye bhavāhi, yādisā khemā ca bhikkhunī uppalavaṇṇā ca–"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmātiha ",
      " bhikkhave evaṃ sikkhitabbaṃ."
    ],
    "innerText": "Tasmātiha bhikkhave evaṃ sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Rāhulasaṃyutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " rāhulasaṃyuttaṃ ",
      " panāvuso bhagavatā kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – rāhulasaṃyuttaṃ panāvuso bhagavatā kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante āyasmantaṃ rāhulaṃ ārabbha bhāsitaṃ. Āyasmā bhante rāhulo bhagavantaṃ etadavoca ‘‘sādhu me bhante bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti, tasmiṃ bhante vatthusmiṃ ‘‘taṃ kiṃ maññasi rāhula, cakkhuniccaṃ vā aniccaṃ vāti. Aniccaṃ bhante. Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vāti. Dukkhaṃ bhante. Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ ‘etaṃ mama, eso hamasmi, eso me attā’ti. No hetaṃ bhante’’ti evamādinā bhante bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante āyasmantaṃ rāhulaṃ ārabbha bhāsitaṃ. Āyasmā bhante rāhulo bhagavantaṃ etadavoca ‘‘sādhu me bhante bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti, tasmiṃ bhante vatthusmiṃ ‘‘taṃ kiṃ maññasi rāhula, cakkhuniccaṃ vā aniccaṃ vāti. Aniccaṃ bhante. Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vāti. Dukkhaṃ bhante. Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ ‘etaṃ mama, eso hamasmi, eso me attā’ti. No hetaṃ bhante’’ti evamādinā bhante bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Lakkhaṇasaṃyutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Aṭṭhisutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " lakkhaṇasaṃyutte ",
      " panāvuso porāṇakehi dhammasaṃgāhakattherehi paṭhamaṃ saṃgītaṃ aṭṭhisuttaṃ bhagavatā kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – lakkhaṇasaṃyutte panāvuso porāṇakehi dhammasaṃgāhakattherehi paṭhamaṃ saṃgītaṃ aṭṭhisuttaṃ bhagavatā kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " rājagahe bhante āyasmantañca lakkhaṇaṃ āyasmantañca mahāmoggallānaṃ ārabbha bhāsitaṃ. Āyasmā bhante lakkhaṇo bhagavatā sammukhe āyasmantaṃ mahāmoggallānaṃ etadavoca ",
      " ‘‘idhāyasmā mahāmoggallāno gijjhakūṭā pabbatā orohanto aññatarasmiṃ padese sitaṃ pātvākāsi, ko nu kho āvuso moggallāna hetu, ko paccayo sitassa pātukammāyā’’ti. Āyasmā ca bhante mahāmoggallāno ‘‘idhāhaṃ āvuso gijjhakūṭā pabbatā orohanto addasaṃ aṭṭhikasaṅkhalikaṃ vehāsaṃ gacchantiṃ’’ti evamādinā ārocesi. Tasmiṃ bhante vatthusmiṃ ‘‘cakkhubhūtā vata bhikkhave sāvakā viharanti, ñāṇabhūtā vata bhikkhave sāvakā viharanti, yatrahi nāma sāvako evarūpaṃ ñassati vā dakkhati vā sakkhiṃ vā karissatī’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – rājagahe bhante āyasmantañca lakkhaṇaṃ āyasmantañca mahāmoggallānaṃ ārabbha bhāsitaṃ. Āyasmā bhante lakkhaṇo bhagavatā sammukhe āyasmantaṃ mahāmoggallānaṃ etadavoca ‘‘idhāyasmā mahāmoggallāno gijjhakūṭā pabbatā orohanto aññatarasmiṃ padese sitaṃ pātvākāsi, ko nu kho āvuso moggallāna hetu, ko paccayo sitassa pātukammāyā’’ti. Āyasmā ca bhante mahāmoggallāno ‘‘idhāhaṃ āvuso gijjhakūṭā pabbatā orohanto addasaṃ aṭṭhikasaṅkhalikaṃ vehāsaṃ gacchantiṃ’’ti evamādinā ārocesi. Tasmiṃ bhante vatthusmiṃ ‘‘cakkhubhūtā vata bhikkhave sāvakā viharanti, ñāṇabhūtā vata bhikkhave sāvakā viharanti, yatrahi nāma sāvako evarūpaṃ ñassati vā dakkhati vā sakkhiṃ vā karissatī’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Acchariyaṃ ",
      " vata bho, abbhutaṃ vata bho;"
    ],
    "innerText": "Acchariyaṃ vata bho, abbhutaṃ vata bho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evarūpopi nāma satto bhavissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Piṇḍasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tenāvuso ",
      " jānatā…pe… sammāsambuddhena lakkhaṇasaṃyutte tatiyaṃ saṃgītaṃ piṇḍasuttaṃ kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tenāvuso jānatā…pe… sammāsambuddhena lakkhaṇasaṃyutte tatiyaṃ saṃgītaṃ piṇḍasuttaṃ kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " rājagahe bhante āyasmantañca lakkhaṇaṃ āyasmantañca mahāmoggallānaṃ ārabbha bhāsitaṃ. Āyasmā bhante lakkhaṇo bhaggavato sammukhe āyasmantaṃ mahāmoggallānaṃ etadavoca ‘‘idhāyasmā mahāmoggallāno gijjhakūṭā pabbatā orohanto aññatarasmiṃ padese sitaṃ pātvākāsi ",
      ", ko nukho āvuso moggallānahetu, ko paccayo sitassa pātukammāyā’’ti. Āyasmā ca bhante mahāmoggallāno ‘‘idhāhaṃ āvuso gijjhakūṭā pabbatā orohanto addasaṃ maṃsapiṇḍaṃ vehāsaṃ gacchantaṃ, tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā vitacchenti virājenti. Sā sudaṃ aṭṭassaraṃ karotī’’ti evamādinā ārocesi. Tasmiṃ bhante vatthusmiṃ ‘‘cakkhubhūtā vata bhikkhave sāvakā viharanti, ñāṇabhūtā vata bhikkhave sāvakā viharanti, yatrahi nāma sāvako evarūpaṃ ñassati vā dakkhati vā sakkhiṃ vā karissatī’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – rājagahe bhante āyasmantañca lakkhaṇaṃ āyasmantañca mahāmoggallānaṃ ārabbha bhāsitaṃ. Āyasmā bhante lakkhaṇo bhaggavato sammukhe āyasmantaṃ mahāmoggallānaṃ etadavoca ‘‘idhāyasmā mahāmoggallāno gijjhakūṭā pabbatā orohanto aññatarasmiṃ padese sitaṃ pātvākāsi , ko nukho āvuso moggallānahetu, ko paccayo sitassa pātukammāyā’’ti. Āyasmā ca bhante mahāmoggallāno ‘‘idhāhaṃ āvuso gijjhakūṭā pabbatā orohanto addasaṃ maṃsapiṇḍaṃ vehāsaṃ gacchantaṃ, tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā vitacchenti virājenti. Sā sudaṃ aṭṭassaraṃ karotī’’ti evamādinā ārocesi. Tasmiṃ bhante vatthusmiṃ ‘‘cakkhubhūtā vata bhikkhave sāvakā viharanti, ñāṇabhūtā vata bhikkhave sāvakā viharanti, yatrahi nāma sāvako evarūpaṃ ñassati vā dakkhati vā sakkhiṃ vā karissatī’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Asilomasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tattheva ",
      " āvuso porāṇakehi dhammasaṃgāhakehi mahātherehi saṃgītaṃ asilomasuttaṃ bhagavatā kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tattheva āvuso porāṇakehi dhammasaṃgāhakehi mahātherehi saṃgītaṃ asilomasuttaṃ bhagavatā kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " rājagahe bhante āyasmantañca lakkhaṇaṃ āyasmantañca mahāmoggallānaṃ ārabbha bhāsitaṃ. Āyasmā bhante lakkhaṇo bhagavato sammukhe āyasmantaṃ mahāmoggallānaṃ ",
      " etadavoca ‘‘ko nu kho āvuso moggallāna hetu, ko paccayo sitassa pātukammāyā’’ti. Āyasmā ca bhante mahāmoggallānatthero ‘‘idhāhaṃ āvuso gijjhakūṭā pabbatā orohanto addasaṃ asilomaṃ vehāsaṃ gacchantaṃ’’ti evamādinā ārocesi. Tasmiṃ bhante vatthusmiṃ cakkhubhūtā vata bhikkhave sāvakā viharanti, ñāṇabhūtā vata bhikkhave sāvakā viharanti. (Peyyāla) eso bhikkhave satto imasmiṃyeva rājagahe sūkariko ahosī’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – rājagahe bhante āyasmantañca lakkhaṇaṃ āyasmantañca mahāmoggallānaṃ ārabbha bhāsitaṃ. Āyasmā bhante lakkhaṇo bhagavato sammukhe āyasmantaṃ mahāmoggallānaṃ etadavoca ‘‘ko nu kho āvuso moggallāna hetu, ko paccayo sitassa pātukammāyā’’ti. Āyasmā ca bhante mahāmoggallānatthero ‘‘idhāhaṃ āvuso gijjhakūṭā pabbatā orohanto addasaṃ asilomaṃ vehāsaṃ gacchantaṃ’’ti evamādinā ārocesi. Tasmiṃ bhante vatthusmiṃ cakkhubhūtā vata bhikkhave sāvakā viharanti, ñāṇabhūtā vata bhikkhave sāvakā viharanti. (Peyyāla) eso bhikkhave satto imasmiṃyeva rājagahe sūkariko ahosī’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sūcilomasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tattheva ",
      " āvuso porāṇakehi dhammasaṃgāhakamahātherehi saṃgītaṃ sūcilomasuttaṃ bhagavatā kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tattheva āvuso porāṇakehi dhammasaṃgāhakamahātherehi saṃgītaṃ sūcilomasuttaṃ bhagavatā kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " tattheva bhante rājagahe āyasmantañca lakkhaṇaṃ āyasmantañca mahāmoggallānaṃ ārabbha bhāsitaṃ. Āyasmā bhante lakkhaṇo bhagavato sammukhe tatheva avoca."
    ],
    "innerText": "Vissajjanā – tattheva bhante rājagahe āyasmantañca lakkhaṇaṃ āyasmantañca mahāmoggallānaṃ ārabbha bhāsitaṃ. Āyasmā bhante lakkhaṇo bhagavato sammukhe tatheva avoca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Āyasmā ",
      " ca bhante mahāmoggallāno tatheva ārocesi. Tasmiṃ bhante vatthusmiṃ ‘‘cakkhubhūtā vata bhikkhave sāvakā viharanti, ñāṇabhūtā vata bhikkhave sāvakā viharanti, (peyyāla) eso bhikkhave satto imasmiṃyeva rājagahe sūto ahosī’’ti evamādinā bhagavatā bhāsitā."
    ],
    "innerText": "Āyasmā ca bhante mahāmoggallāno tatheva ārocesi. Tasmiṃ bhante vatthusmiṃ ‘‘cakkhubhūtā vata bhikkhave sāvakā viharanti, ñāṇabhūtā vata bhikkhave sāvakā viharanti, (peyyāla) eso bhikkhave satto imasmiṃyeva rājagahe sūto ahosī’’ti evamādinā bhagavatā bhāsitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pāpabhikkhusutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tattheva ",
      " āvuso porāṇakehi dhammasaṃgāhakamahātherehi saṃgītāni pāpabhikkhusuttādīni pañcasuttāni bhagavatā kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitāni."
    ],
    "innerText": "Pucchā – tattheva āvuso porāṇakehi dhammasaṃgāhakamahātherehi saṃgītāni pāpabhikkhusuttādīni pañcasuttāni bhagavatā kattha kaṃ ārabbha kismiṃ vatthusmiṃ kathañca bhāsitāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " rājagahe āyasmantañca lakkhaṇaṃ āyasmantañca mahāmoggallānaṃ ārabbha bhāsitāni. Āyasmā bhante lakkhaṇo bhagavato sammukhe pubbe vuttanayeneva ārocesi. Āyasmā ca bhante mahāmoggallāno ‘‘idhāhaṃ āvuso gijjhakūṭā pabbatā orohanto addasaṃ bhikkhuṃ vehāsaṃ gacchantaṃ. Addasaṃ bhikkhuniṃ vehāsaṃ gacchantiṃ. Addasaṃ sikkhamānaṃ vehāsaṃ gacchantiṃ. Addasaṃ sāmaṇeraṃ vehāsaṃ gacchantaṃ. Addasaṃ sāmaṇeriṃ vehāsaṃ gacchantiṃ. Tassā saṅghāṭipi ādittā sampajjalitā sajotibhūtā, pattopi āditto sampajjalito sajotibhūto, kāyabandhanampi ādittaṃ sampajjalitaṃ sajotibhūtaṃ ",
      ", kāyopi āditto sampajjalito sajotibhūto, sā sudaṃ aṭṭassaraṃ karotī’’ti evamādinā ārocesi. Tasmiṃ bhante vatthusmiṃ ‘‘cakkhubhūtā vata bhikkhave sāvakā viharanti ñāṇabhūtā vata bhikkhave sāvakā viharanti. (Peyyāla). Eso bhikkhave bhikkhu kassapassasammāsambuddhassa pāvacane pāpabhikkhu ahosi. Esā bhikkhave bhikkhunī kassapassa sammāsambuddhassa pāvacane pāpabhikkhunī ahosi. Esā bhikkhave sikkhamānā kassapassa sammāsambuddhassa pāvacane pāpasikkhamānā ahosi. Eso bhikkhave sāmaṇero kassapassasammāsambuddhassa pāvacane pāpasāmaṇero ahosi. Esā bhikkhave sāmaṇerī kassapassa sammāsambuddhassa pāvacane pāpasāmaṇerī ahosī’’ti evamādinā bhagavatā bhāsitāni."
    ],
    "innerText": "Vissajjanā – rājagahe āyasmantañca lakkhaṇaṃ āyasmantañca mahāmoggallānaṃ ārabbha bhāsitāni. Āyasmā bhante lakkhaṇo bhagavato sammukhe pubbe vuttanayeneva ārocesi. Āyasmā ca bhante mahāmoggallāno ‘‘idhāhaṃ āvuso gijjhakūṭā pabbatā orohanto addasaṃ bhikkhuṃ vehāsaṃ gacchantaṃ. Addasaṃ bhikkhuniṃ vehāsaṃ gacchantiṃ. Addasaṃ sikkhamānaṃ vehāsaṃ gacchantiṃ. Addasaṃ sāmaṇeraṃ vehāsaṃ gacchantaṃ. Addasaṃ sāmaṇeriṃ vehāsaṃ gacchantiṃ. Tassā saṅghāṭipi ādittā sampajjalitā sajotibhūtā, pattopi āditto sampajjalito sajotibhūto, kāyabandhanampi ādittaṃ sampajjalitaṃ sajotibhūtaṃ , kāyopi āditto sampajjalito sajotibhūto, sā sudaṃ aṭṭassaraṃ karotī’’ti evamādinā ārocesi. Tasmiṃ bhante vatthusmiṃ ‘‘cakkhubhūtā vata bhikkhave sāvakā viharanti ñāṇabhūtā vata bhikkhave sāvakā viharanti. (Peyyāla). Eso bhikkhave bhikkhu kassapassasammāsambuddhassa pāvacane pāpabhikkhu ahosi. Esā bhikkhave bhikkhunī kassapassa sammāsambuddhassa pāvacane pāpabhikkhunī ahosi. Esā bhikkhave sikkhamānā kassapassa sammāsambuddhassa pāvacane pāpasikkhamānā ahosi. Eso bhikkhave sāmaṇero kassapassasammāsambuddhassa pāvacane pāpasāmaṇero ahosi. Esā bhikkhave sāmaṇerī kassapassa sammāsambuddhassa pāvacane pāpasāmaṇerī ahosī’’ti evamādinā bhagavatā bhāsitāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Opammasaṃyutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nakhasikhasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " opammasaṃyutte ",
      " āvuso porāṇakehi dhammasaṃgāhakamahātherehi saṃgītaṃ nakhasikhasuttaṃ bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – opammasaṃyutte āvuso porāṇakehi dhammasaṃgāhakamahātherehi saṃgītaṃ nakhasikhasuttaṃ bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘taṃ kiṃ maññatha bhikkhave, katamaṃ nu kho bahutaraṃ, yo cāyaṃ mayā paritto ",
      " nakhasikhāyaṃ paṃsu āropito, yā cāyaṃ mahāpathavī’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante sambahule bhikkhū ārabbha ‘‘taṃ kiṃ maññatha bhikkhave, katamaṃ nu kho bahutaraṃ, yo cāyaṃ mayā paritto nakhasikhāyaṃ paṃsu āropito, yā cāyaṃ mahāpathavī’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Taṃ kiṃ maññatha bhikkhave, katamaṃ nu kho bahutaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmātiha ",
      " bhikkhave evaṃ sikkhitabbaṃ."
    ],
    "innerText": "Tasmātiha bhikkhave evaṃ sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Āṇisutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " tattheva āvuso porāṇakehi dhammasaṃgāhakamahātherehi saṃgītaṃ āṇisuttaṃ bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – tattheva āvuso porāṇakehi dhammasaṃgāhakamahātherehi saṃgītaṃ āṇisuttaṃ bhagavatā kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃyeva bhante sambahule bhikkhū ārabbha ‘‘bhūtapubbaṃ bhikkhave dasārahānaṃ ānako nāma mudiṅgo ahosi, tassa dasārahā ānake ghaṭite aññaṃ āṇiṃ odahiṃsu, ahu kho so bhikkhave samayo yaṃ ānakassa mudiṅgassa porāṇaṃ pokkharaphalakaṃ antaradhāyi ",
      ", āṇisaṅghāṭova avasissī’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃyeva bhante sambahule bhikkhū ārabbha ‘‘bhūtapubbaṃ bhikkhave dasārahānaṃ ānako nāma mudiṅgo ahosi, tassa dasārahā ānake ghaṭite aññaṃ āṇiṃ odahiṃsu, ahu kho so bhikkhave samayo yaṃ ānakassa mudiṅgassa porāṇaṃ pokkharaphalakaṃ antaradhāyi , āṇisaṅghāṭova avasissī’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Bhikkhusaṃyutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Navasutta"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā –"
      },
      " bhikkhusaṃyutte ",
      " āvuso bhagavatā navasuttaṃ kattha kaṃ ārabbha kathañca bhāsitaṃ."
    ],
    "innerText": "Pucchā – bhikkhusaṃyutte āvuso bhagavatā navasuttaṃ kattha kaṃ ārabbha kathañca bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjanā –"
      },
      " sāvatthiyaṃ bhante aññataraṃ navaṃ bhikkhuṃ ārabbha bhāsitaṃ. Aññataro bhante navo bhikkhu pacchābhattaṃ piṇḍapātapaṭikkanto vihāraṃ pavisitvā apposukko tuṇhībhūto saṅkasāyabhi, na bhikkhūnaṃ veyyāvaccaṃ karoti cīvarakārasamaye tasmiṃ bhante vatthusmiṃ ‘‘mā kho tumhe bhikkhave etassa bhikkhuno ujjhāyitthā eso kho bhikkhave bhikkhu catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhamma sukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī’’ti evamādinā bhagavatā bhāsitaṃ."
    ],
    "innerText": "Vissajjanā – sāvatthiyaṃ bhante aññataraṃ navaṃ bhikkhuṃ ārabbha bhāsitaṃ. Aññataro bhante navo bhikkhu pacchābhattaṃ piṇḍapātapaṭikkanto vihāraṃ pavisitvā apposukko tuṇhībhūto saṅkasāyabhi, na bhikkhūnaṃ veyyāvaccaṃ karoti cīvarakārasamaye tasmiṃ bhante vatthusmiṃ ‘‘mā kho tumhe bhikkhave etassa bhikkhuno ujjhāyitthā eso kho bhikkhave bhikkhu catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhamma sukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī’’ti evamādinā bhagavatā bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ahampi ",
      " kho bhante sakaṃ kiccaṃ karomi,"
    ],
    "innerText": "Ahampi kho bhante sakaṃ kiccaṃ karomi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Eso ",
      " kho bhikkhave bhikkhu catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī –"
    ],
    "innerText": "Eso kho bhikkhave bhikkhu catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nayidaṃ sithilamārabbha, nayidaṃ appena thāmasā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Nibbānaṃ adhigantabbaṃ, sabbadukkhappamocanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Ayañca daharo bhikkhu, ayamuttamapuriso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhāreti antimaṃ dehaṃ, jetvā māraṃ savāhiniṃ–"
  }
]