[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Nandiyarājavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "11. Nandiyarājassa vatthumhi ayamānupubbīkathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ito ",
      " kira kappasatasahassamatthake padumuttaro nāma satthā loke udapādi sadevakaṃ lokaṃ saṃsārakantārā uttārento. Tasmiṃ kira samaye eko kuṭumbiko satthu dhammadesanaṃ sutvā pasannamānaso buddhapamukhaṃ bhikkhusaṅghaṃ nimantetvā mahādānaṃ sajjetvā attano bhavanaṃ devabhavanamiva alaṅkaritvā buddhārahaṃ mahāsanaṃ paññāpetvā gantvā bhagavantaṃ yāci kāloyaṃ bhante bhagavato bhattaggassa upasaṅkamanāyāti. Atha bhagavā bhikkhusaṅghaparivuto mahatā buddhānubhāvena gantvā nisīdi paññattavarabuddhāsane, tato kuṭumbiko haṭṭho udaggo sapariso bhagavantaṃ parivisati anekehi madhurannapānādīhi. Tadā tassa bhagavato sāsane dhutaṅgadharānaṃ aggo vasabhattheronāma mahāsāvako sapadānavattena piṇḍāya caramāno tassa kuṭumbikassa gehadvāre aṭṭhāsi, atha so theraṃ disvā bhante satthā antogehe nisinno, tumhepi pavisathāti yāci, thero apavisitvāva agamāsi, kuṭumbiko bhagavantaṃ upasaṅkamitvā tamattaṃ vatvā kiṃ bhante sadevake loke bhagavatāpi uttaritaro guṇena saṃvijjatīti āha. Athassa satthā puttopamaṃ dassetvā therassa guṇe vaṇṇento evamāha."
    ],
    "innerText": "Ito kira kappasatasahassamatthake padumuttaro nāma satthā loke udapādi sadevakaṃ lokaṃ saṃsārakantārā uttārento. Tasmiṃ kira samaye eko kuṭumbiko satthu dhammadesanaṃ sutvā pasannamānaso buddhapamukhaṃ bhikkhusaṅghaṃ nimantetvā mahādānaṃ sajjetvā attano bhavanaṃ devabhavanamiva alaṅkaritvā buddhārahaṃ mahāsanaṃ paññāpetvā gantvā bhagavantaṃ yāci kāloyaṃ bhante bhagavato bhattaggassa upasaṅkamanāyāti. Atha bhagavā bhikkhusaṅghaparivuto mahatā buddhānubhāvena gantvā nisīdi paññattavarabuddhāsane, tato kuṭumbiko haṭṭho udaggo sapariso bhagavantaṃ parivisati anekehi madhurannapānādīhi. Tadā tassa bhagavato sāsane dhutaṅgadharānaṃ aggo vasabhattheronāma mahāsāvako sapadānavattena piṇḍāya caramāno tassa kuṭumbikassa gehadvāre aṭṭhāsi, atha so theraṃ disvā bhante satthā antogehe nisinno, tumhepi pavisathāti yāci, thero apavisitvāva agamāsi, kuṭumbiko bhagavantaṃ upasaṅkamitvā tamattaṃ vatvā kiṃ bhante sadevake loke bhagavatāpi uttaritaro guṇena saṃvijjatīti āha. Athassa satthā puttopamaṃ dassetvā therassa guṇe vaṇṇento evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      "."
    ],
    "innerText": "1."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pālenti nimmalaṃ katvā, pātimokkhādisaṃvaraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Samādinnadhutaṅgāca, appicchā munisūnavo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      "."
    ],
    "innerText": "2."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nicca mantakayuddhamhi, naddhā yodhāva dappitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Puññānaṃ vatthubhūtā te, devamānusakā dinaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      "."
    ],
    "innerText": "3."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dhāremahaṃ vaṇṇavantaṃ, sīveyyampica cīvaraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Buddhaputtā mahānāgā na dhārenti tathāvidhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      "."
    ],
    "innerText": "4."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Dhārenti ",
      " te paṃsukūlaṃ, saṅghāṭetvā pilotike;"
    ],
    "innerText": "Dhārenti te paṃsukūlaṃ, saṅghāṭetvā pilotike;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vaṇacchādanacolaṃva, icchālobha vivajjitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      "."
    ],
    "innerText": "5."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sādiyāmi sadā hambho, upāsakanimantanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Neva sādenti sambuddha, putto pāsakayācanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      "."
    ],
    "innerText": "6."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sapadānena yaṃ laddhaṃ, lūkhaṃvāpi paṇītakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tena tussanti me puttā, rasagedhavivajjitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      "."
    ],
    "innerText": "7."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nipajjāmi ahaṃ sādhu, santhate sayane subhe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na te seyyaṃ pakappenti, saṃsārabhayabhīrukā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      "."
    ],
    "innerText": "8."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ṭhānā sanagamanena, kappenti iriyāpathaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nekabhūmisamākiṇṇa, pāsādesu vasāmahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      "."
    ],
    "innerText": "9."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Buddhaputtā tathācchannaṃ, na kadā pavisanti te;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rukkhamūle susānasmiṃ, abbhokāse ramanti te."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      "."
    ],
    "innerText": "10."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Bhāvetvā bhavanāsāya, hetuṃ bhāvanamuttamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ahaṃ gāme vasissāmi, pāpento janataṃ sivaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      "."
    ],
    "innerText": "11."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ramanti mama puttā te, pantasenāsane kakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Tesaṃ mahattaro santo, theroyaṃ vasabho mahā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhutapāpo dhutaṅgaggo, ñātoyaṃ mama sāsaneti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhagavā hatthaṃ ukkhipitvā candamaṇḍale paharanto viya therassa guṇe pakāsesi, tato so tassa guṇakathaṃ sutvā sayampitaṃ ṭhānantaraṃ kāmayamāno yannūnāhaṃ anāgate aññatarassa sammāsambuddhassa sāsane dhutaṅgadharānaṃ aggo bhavissāmīti taṃ ṭhānantaraṃ patthento bhagavato pādamūle nipajji, satthā taṃ kāraṇaṃ upaparikkhitvā ito kappasatasahassamatthake gotamo nāma satthā uppajjissati. Tvaṃ tadā dhutaṅgadharānaṃ aggo hutvā kassa poti paññāyissatīti byākaraṇa ",
      " madāsi. Tato paṭṭhāya so somanasso puññakammaṃ katvā tato cuto devamanussesu devissariyaṃ anubhavanto vipassīsammāsambuddhakāle ekasāṭako nāma brāhmaṇo hutvā mahādānaṃ adāsi. Tato cuto kassapasammāsambuddhe parinibbute bārāṇasīnagare bārāṇasīseṭṭhi hutvā nibbatto dānādīni puññāni katvā tato cavitvā saṃsāre saṃsaranto dasavassasahassā yukesu manussesu bārāṇasiyaṃ eko kuṭumbiko hutvā nibbatti. So panāyaṃ kuṭumbiko araññe jaṅghāvihāraṃ anuvicaranto paccantime janapade araññāyatane aññataraṃ paccekabuddhaṃ addasa. So ca paccekabuddho tattha cīvarakammaṃ karonto anuvāte appahonte saṃharitvā ṭhapetuṃ āraddho. Kuṭumbiko taṃ disvā bhante kiṃ karothāti pucchi. So paccekabuddho appicchatāya tena puṭṭho na kiñci vutto hoti. So cīvaradussaṃ nappahotīti ñatvā attano uttarasāṭakaṃ paccekabuddhassa pādamūle ṭhapetvā agamāsi. Paccekabuddho taṃ gahetvā anuvātakaṃ āropento cīvaraṃ katvā pārupi. Kuṭumbiko jīvitapariyosāne kālaṃ katvā tāvatiṃsabhavane nibbattitvā tattha yāvatāyukaṃ dibbasampattiṃ anubhavitvā tato cavitvā bārāṇasito tiyojanamattake ṭhāne aññatarasmiṃ nagare nibbatti, tassa mātāpitaro nandiyoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nandītināmaṃ itisabbattha]"
      },
      " nāmaṃ akaṃsu, tassa satta bhātaro ahesuṃ, sesā cha bhātaro nānākammantesu byāvaṭā mātāpitunnaṃ posenti. Nandiyo pana akammasīlo geheyeva vasati. Tasmā tassa sesā kujjhanti. Mātāpitaropi nandiyaṃ āmantetvā ovadanti. So tuṇhī hoteva. Athāparasmiṃ samaye gāme nakkhattaṃ saṅghuṭṭhaṃ, tadā so mātaraṃ āha. Amma sāṭakaṃ dehi, nakkhattaṃ kīḷissāmīti, sā dhota- vatthaṃ ",
      " nīharitvā adāsi, amma thūlaṃ idanti, sā aññaṃ nīharitvā adāsi, tampi paṭikkhipi. Atha naṃ mātā āha. Tāta yādise mayaṃ gehe jātā, natthi ito sukhumatarassa paṭilābhāya puññanti, labhanaṭṭhānaṃ gamissāmi ammāti. Putta ahaṃ ajjeva tava bārāṇasīnagare rajjapaṭilābhaṃ icchāmīti āha. So sādhu ammāti mātaraṃ vanditvā padakkhiṇaṃ katvā pakkāmi. Mātuyā panassa evaṃ ahosi. Kahaṃ so gamissati, pubbeviya idhavā etthavā gehe nisīditvā āgacchatīti, so pana puññaniyāmena codiyamāno gāmato nikkhamitvā bārāṇasiṃ gantvā senaguttassa gehe paṭivasati, athekadivasaṃ so tassa kammakārehi saddhiṃ sallapanto nisīditvā pacalāyanto supinaṃ addasa. Mukhena antaṃ nikkhamitvā sakalajambudīpe pattharitvā antokucchimeva pāvisi. Pabuddho so bhīto mahāsaddamakāsi. Atha naṃ mahāsenagutto pucchi. Nandiyo supinaṃ addasanti āha. Atha tena kīdisanti puṭṭho kathesi, tato senagutto taṃ attano kulūpagaṃ paribbājikaṃ pucchi ko tassa vipākoti. Paribbājikā yadi bho itthī passati. Sattadivasabbhantareyeva abhisekaṃ labhati, yadi puriso passati, tatheva rājā hotīti kathesi. Senagutto tassā taṃ kathaṃ sutvā imaṃ mama ñātiṃ karomīti attano satta dhītare pakkositvā paṭipāṭiyā pucchi. Nandiyassa santike vasathāti, sesā sabbā na icchiṃsu, na mayaṃ jānāma etaṃ adhunāgataṃ kulavantaṃ vā dukkulavantaṃvāti. Atha kaṇiṭṭhikaṃ pucchi. Sā yassa maṃ mātāpitaro dassanti. Tesaṃ vacanaṃ na bhindissāmīti sampaṭicchi, atha senagutto nandiyaṃ pakkositvā attano dhītaraṃ datvā tassa mahāsampatti madāsi. Tato sattame divase nandiyo tattha tattha āhiṇḍanto rañño maṅgaluyyānaṃ passissāmīti gantvā dhaṅgalasilāpaṭṭesasīsaṃ pārupitvā nipajji, so ca bārāṇasīrañño kālaṅkatassa sattamo ",
      " divaso hoti. Amaccāca purohitoca rañño sarīrakiccaṃ kāretvā rājaṅgaṇe nisīditvā mantayiṃsu. Rañño ekāva dhītā atthi, putto panassa natthi. Arājikaṃ rajjaṃ na tiṭṭhati. Phussarathaṃ vissajjessāmāti. Te kumudapattavaṇṇe cattāro sindhave yojetvā setacchattapamukhaṃpañcavidharājakakudhabhaṇḍaṃ rathasmiṃyeva ṭhapetvā rathaṃ vissajjetvā pacchato turiyāni paggaṇhāpesuṃ. Ratho pācīdvārena nikkhamitvā uyyānābhimukho ahosi. Paricayena uyyānābhimukho gacchati. Nivattemāti keci āhaṃsu. Purohito mā nivārayitthāti āha. Ratho kumārakaṃ padakkhiṇaṃ katvā ārohaṇasajjo hutvā aṭṭhāsi. Purohito pārupaṇakaṇṇaṃ apanetvā pādatalāni olokento tiṭṭhatu ayaṃ dīpo. Dvisahassadīpa parivāresu catūsu mahādīpesu ekarajjaṃ kātuṃ samatthotivatvā tassa dhitiṃ upadhāretuṃ tikkhattuṃ turiyāni paggaṇhāpesi. Atha kumāro mukhaṃ vivaritvā oloketvā kena kāraṇena āgatatthāti āha, deva tumhākaṃ rajjaṃ pāpuṇātīti, rājā kahanti, devattaṃ gato sāmīti, kati divasā atikkantāti, ajja sattamo divasoti. Putto vā dhītā vā natthīti, dhītā atthi deva. Putto na vijjatīti, tenahi karissāmi rajjanti, te tāvadeva abhisekamaṇḍapaṃ kāretvā rājadhītaraṃ sabbālaṅkārehi alaṅkāritvā uyyānaṃ netvā kumārassa abhisekaṃ akaṃsu, athassa katābhisekassa satasahassagghanakaṃ vatthaṃ ānesuṃ, so kimidaṃ tātāti āha, nivāsanavatthaṃ devāti, nanu tātā thūlaṃti, manussānaṃ paribhogavatthesu ito sukhumataraṃ natthi devāti, tumhākaṃ rājā evarūpaṃ nivāsesīti, āma devāti. Na maññe puññavā tumhākaṃ rājāti vatvā handa suvaṇṇabhiṅkāraṃ āharatha, labhissāma vatthanti, te suvaṇṇabhiṅkāraṃ āhariṃsu, so uṭṭhāya hatthe dhovitvā mukhaṃ vikkhāletvā hatthena udakaṃ ādāya puratthimadisāya abbhukkiri, ",
      " tāvadeva ghanapathaviṃ bhinditvā soḷasakapparukkhā uṭṭhahiṃsu, puna udakaṃ hatthena gahetvā dakkhiṇaṃ pacchimaṃ uttaranti evaṃ catassopi disā abbhukkiri, sabbadisāsu soḷasa soḷasa hutvā catusaṭṭhikapparukkhā uṭṭhahiṃsu, so ekaṃ dibbadussaṃ nivāsetvā ekaṃ pārupitvā nandiyarañño vijite suttakantikā itthiyo mā suttaṃ kantantūti bheriṃ carāpethāti vatvā chattaṃ ussāpetvā alaṅkatapaṭiyatto hatthikkhandhavaragato nagaraṃ pavisitvā pāsādamabhiruyha mahāsampattiṃ anubhavi. Aho tadā paccekabuddhassa dinnānuvātakassa vipāko. Tenāhu porāṇā."
    ],
    "innerText": "Evaṃ bhagavā hatthaṃ ukkhipitvā candamaṇḍale paharanto viya therassa guṇe pakāsesi, tato so tassa guṇakathaṃ sutvā sayampitaṃ ṭhānantaraṃ kāmayamāno yannūnāhaṃ anāgate aññatarassa sammāsambuddhassa sāsane dhutaṅgadharānaṃ aggo bhavissāmīti taṃ ṭhānantaraṃ patthento bhagavato pādamūle nipajji, satthā taṃ kāraṇaṃ upaparikkhitvā ito kappasatasahassamatthake gotamo nāma satthā uppajjissati. Tvaṃ tadā dhutaṅgadharānaṃ aggo hutvā kassa poti paññāyissatīti byākaraṇa madāsi. Tato paṭṭhāya so somanasso puññakammaṃ katvā tato cuto devamanussesu devissariyaṃ anubhavanto vipassīsammāsambuddhakāle ekasāṭako nāma brāhmaṇo hutvā mahādānaṃ adāsi. Tato cuto kassapasammāsambuddhe parinibbute bārāṇasīnagare bārāṇasīseṭṭhi hutvā nibbatto dānādīni puññāni katvā tato cavitvā saṃsāre saṃsaranto dasavassasahassā yukesu manussesu bārāṇasiyaṃ eko kuṭumbiko hutvā nibbatti. So panāyaṃ kuṭumbiko araññe jaṅghāvihāraṃ anuvicaranto paccantime janapade araññāyatane aññataraṃ paccekabuddhaṃ addasa. So ca paccekabuddho tattha cīvarakammaṃ karonto anuvāte appahonte saṃharitvā ṭhapetuṃ āraddho. Kuṭumbiko taṃ disvā bhante kiṃ karothāti pucchi. So paccekabuddho appicchatāya tena puṭṭho na kiñci vutto hoti. So cīvaradussaṃ nappahotīti ñatvā attano uttarasāṭakaṃ paccekabuddhassa pādamūle ṭhapetvā agamāsi. Paccekabuddho taṃ gahetvā anuvātakaṃ āropento cīvaraṃ katvā pārupi. Kuṭumbiko jīvitapariyosāne kālaṃ katvā tāvatiṃsabhavane nibbattitvā tattha yāvatāyukaṃ dibbasampattiṃ anubhavitvā tato cavitvā bārāṇasito tiyojanamattake ṭhāne aññatarasmiṃ nagare nibbatti, tassa mātāpitaro nandiyoti [nandītināmaṃ itisabbattha] nāmaṃ akaṃsu, tassa satta bhātaro ahesuṃ, sesā cha bhātaro nānākammantesu byāvaṭā mātāpitunnaṃ posenti. Nandiyo pana akammasīlo geheyeva vasati. Tasmā tassa sesā kujjhanti. Mātāpitaropi nandiyaṃ āmantetvā ovadanti. So tuṇhī hoteva. Athāparasmiṃ samaye gāme nakkhattaṃ saṅghuṭṭhaṃ, tadā so mātaraṃ āha. Amma sāṭakaṃ dehi, nakkhattaṃ kīḷissāmīti, sā dhota- vatthaṃ nīharitvā adāsi, amma thūlaṃ idanti, sā aññaṃ nīharitvā adāsi, tampi paṭikkhipi. Atha naṃ mātā āha. Tāta yādise mayaṃ gehe jātā, natthi ito sukhumatarassa paṭilābhāya puññanti, labhanaṭṭhānaṃ gamissāmi ammāti. Putta ahaṃ ajjeva tava bārāṇasīnagare rajjapaṭilābhaṃ icchāmīti āha. So sādhu ammāti mātaraṃ vanditvā padakkhiṇaṃ katvā pakkāmi. Mātuyā panassa evaṃ ahosi. Kahaṃ so gamissati, pubbeviya idhavā etthavā gehe nisīditvā āgacchatīti, so pana puññaniyāmena codiyamāno gāmato nikkhamitvā bārāṇasiṃ gantvā senaguttassa gehe paṭivasati, athekadivasaṃ so tassa kammakārehi saddhiṃ sallapanto nisīditvā pacalāyanto supinaṃ addasa. Mukhena antaṃ nikkhamitvā sakalajambudīpe pattharitvā antokucchimeva pāvisi. Pabuddho so bhīto mahāsaddamakāsi. Atha naṃ mahāsenagutto pucchi. Nandiyo supinaṃ addasanti āha. Atha tena kīdisanti puṭṭho kathesi, tato senagutto taṃ attano kulūpagaṃ paribbājikaṃ pucchi ko tassa vipākoti. Paribbājikā yadi bho itthī passati. Sattadivasabbhantareyeva abhisekaṃ labhati, yadi puriso passati, tatheva rājā hotīti kathesi. Senagutto tassā taṃ kathaṃ sutvā imaṃ mama ñātiṃ karomīti attano satta dhītare pakkositvā paṭipāṭiyā pucchi. Nandiyassa santike vasathāti, sesā sabbā na icchiṃsu, na mayaṃ jānāma etaṃ adhunāgataṃ kulavantaṃ vā dukkulavantaṃvāti. Atha kaṇiṭṭhikaṃ pucchi. Sā yassa maṃ mātāpitaro dassanti. Tesaṃ vacanaṃ na bhindissāmīti sampaṭicchi, atha senagutto nandiyaṃ pakkositvā attano dhītaraṃ datvā tassa mahāsampatti madāsi. Tato sattame divase nandiyo tattha tattha āhiṇḍanto rañño maṅgaluyyānaṃ passissāmīti gantvā dhaṅgalasilāpaṭṭesasīsaṃ pārupitvā nipajji, so ca bārāṇasīrañño kālaṅkatassa sattamo divaso hoti. Amaccāca purohitoca rañño sarīrakiccaṃ kāretvā rājaṅgaṇe nisīditvā mantayiṃsu. Rañño ekāva dhītā atthi, putto panassa natthi. Arājikaṃ rajjaṃ na tiṭṭhati. Phussarathaṃ vissajjessāmāti. Te kumudapattavaṇṇe cattāro sindhave yojetvā setacchattapamukhaṃpañcavidharājakakudhabhaṇḍaṃ rathasmiṃyeva ṭhapetvā rathaṃ vissajjetvā pacchato turiyāni paggaṇhāpesuṃ. Ratho pācīdvārena nikkhamitvā uyyānābhimukho ahosi. Paricayena uyyānābhimukho gacchati. Nivattemāti keci āhaṃsu. Purohito mā nivārayitthāti āha. Ratho kumārakaṃ padakkhiṇaṃ katvā ārohaṇasajjo hutvā aṭṭhāsi. Purohito pārupaṇakaṇṇaṃ apanetvā pādatalāni olokento tiṭṭhatu ayaṃ dīpo. Dvisahassadīpa parivāresu catūsu mahādīpesu ekarajjaṃ kātuṃ samatthotivatvā tassa dhitiṃ upadhāretuṃ tikkhattuṃ turiyāni paggaṇhāpesi. Atha kumāro mukhaṃ vivaritvā oloketvā kena kāraṇena āgatatthāti āha, deva tumhākaṃ rajjaṃ pāpuṇātīti, rājā kahanti, devattaṃ gato sāmīti, kati divasā atikkantāti, ajja sattamo divasoti. Putto vā dhītā vā natthīti, dhītā atthi deva. Putto na vijjatīti, tenahi karissāmi rajjanti, te tāvadeva abhisekamaṇḍapaṃ kāretvā rājadhītaraṃ sabbālaṅkārehi alaṅkāritvā uyyānaṃ netvā kumārassa abhisekaṃ akaṃsu, athassa katābhisekassa satasahassagghanakaṃ vatthaṃ ānesuṃ, so kimidaṃ tātāti āha, nivāsanavatthaṃ devāti, nanu tātā thūlaṃti, manussānaṃ paribhogavatthesu ito sukhumataraṃ natthi devāti, tumhākaṃ rājā evarūpaṃ nivāsesīti, āma devāti. Na maññe puññavā tumhākaṃ rājāti vatvā handa suvaṇṇabhiṅkāraṃ āharatha, labhissāma vatthanti, te suvaṇṇabhiṅkāraṃ āhariṃsu, so uṭṭhāya hatthe dhovitvā mukhaṃ vikkhāletvā hatthena udakaṃ ādāya puratthimadisāya abbhukkiri, tāvadeva ghanapathaviṃ bhinditvā soḷasakapparukkhā uṭṭhahiṃsu, puna udakaṃ hatthena gahetvā dakkhiṇaṃ pacchimaṃ uttaranti evaṃ catassopi disā abbhukkiri, sabbadisāsu soḷasa soḷasa hutvā catusaṭṭhikapparukkhā uṭṭhahiṃsu, so ekaṃ dibbadussaṃ nivāsetvā ekaṃ pārupitvā nandiyarañño vijite suttakantikā itthiyo mā suttaṃ kantantūti bheriṃ carāpethāti vatvā chattaṃ ussāpetvā alaṅkatapaṭiyatto hatthikkhandhavaragato nagaraṃ pavisitvā pāsādamabhiruyha mahāsampattiṃ anubhavi. Aho tadā paccekabuddhassa dinnānuvātakassa vipāko. Tenāhu porāṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      "."
    ],
    "innerText": "12."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yathā sāsapamattamhā, bījā nigrodhapādapo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Jāyate satasākhaḍḍho, mahānīlambudopamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      "."
    ],
    "innerText": "13."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tatheva puññakammamhā, aṇumhā vipulaṃ phalaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Hotīti appapuññanti, nāvamaññeyya paṇḍitoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ gacchante kāle ekadivasaṃ devī rañño sampattiṃ disvā aho tapassīti kāruññākāraṃ dassesi. Kimidaṃ devīti ca puṭṭhā atimahatī te deva sampatti. Atītamaddhānaṃ kalyāṇaṃ katattā. Idāni anāgatassatthāya kusalaṃ karothāti āha. Kassa dassāma. Sīlavantā natthīti. Asuñño deva jambudīpo arahantehi, tumhe dānaṃ sajjetha, ahaṃ arahante lacchāmīti āha. Punadivase rājā mahārahaṃ dānaṃ sajjāpesi. Devī sace imissā disāya arahanto atthi, idhā gantvā amhākaṃ bhikkhaṃ gaṇhantūti uttarahimavantābhimukhī pupphāni uddhaṃ khipitvā urena nipajji. Atha tāni pupphāni ākāsato gantvā himavantapadese vasantānaṃ padumavatiyā puttānaṃ pañcasatānaṃpaccekabuddhānaṃ jeṭṭhakamahāpadumapaccekabuddhassa pādamūle patiṃsu. Tathāhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      "."
    ],
    "innerText": "14."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Aho ",
      " passatha bho dāni, vimhayaṃ puññakammuno;"
    ],
    "innerText": "Aho passatha bho dāni, vimhayaṃ puññakammuno;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Acetanāpi pupphāni, dūtakiccesu byāvaṭā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      "."
    ],
    "innerText": "15."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kattukāmena lokasmiṃ, sakalaṃ attano vasaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbatthāmena kattabbaṃ, puññaṃ paññavatā sadāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato mahāpadumapaccekabuddho taṃ ñatvā sesabhātare āmantesi. Mārisā nandiyarājā tumhe nimantesi. Adhivāsetha tassa nimantananti. Te adhivāsetvā tāvadeva ākāsenā gantvā uttaradvāre otariṃsu. Manussā pañcasatā deva paccekabuddhā āgatāti rañño ārocesuṃ, rājā saddhiṃ deviyā gantvā vanditvā patte gahetvā paccekabuddhe pāsādaṃ āropetvā tattha tesaṃ dānaṃ datvā bhattakiccāvasāne rājā saṅghattherassa devī saṅghanavakassa ca pādamūle nipajjitvā ayyā paccayehi na kilamissantu, mayaṃ puññena na hāyissāma, amhākaṃ idha vāsāya paṭiññaṃ dethāti paṭiññaṃ kāretvā uyyāne nivāsaṭṭhānādayo kāretvā yāvajīvaṃ paccakabuddhe upaṭṭhahitvā tesu parinibbutesu sādhukīḷanaṃ kāretvā candanā garuādīhi sarīrakiccaṃ kāretvā dhātuyo gahetvā cetiyaṃ patiṭṭhāpetvā evarūpānampi mahānubhāvānaṃ mahesīnaṃ maraṇaṃ bhavissati, kimaṅgaṃ pana mādisānanti saṃvegajāto jeṭṭhaputtaṃ rajje patiṭṭhāpetvā sayaṃ pabbajaṃ pabbaji, devīpi raññe pabbajite ahaṃ kiṃkarissāmīti pabbajitvā dvepi uyyāne vasantā jhānābhiññaṃ nibbattetvā jhānasukhena vītināmentā āyupariyosāne brahmaloke nibbattiṃsu. Te amhākaṃ bhagavato kāle brāhmaṇakule nibbattitvā buddhasāsane pabbajiṃsu, tadā nandiyarājā dhutaṅgadharānaṃ aggo mahākassapattheronāma hutvā cando viya suriyo viyaca loke pākaṭo hutvā bhagavati pari- nibbute ",
      " buddhasāsanaṃ ativiya sobheti. Bhariyāpissa bhaddakāpiḷānī nāma ahosīti."
    ],
    "innerText": "Tato mahāpadumapaccekabuddho taṃ ñatvā sesabhātare āmantesi. Mārisā nandiyarājā tumhe nimantesi. Adhivāsetha tassa nimantananti. Te adhivāsetvā tāvadeva ākāsenā gantvā uttaradvāre otariṃsu. Manussā pañcasatā deva paccekabuddhā āgatāti rañño ārocesuṃ, rājā saddhiṃ deviyā gantvā vanditvā patte gahetvā paccekabuddhe pāsādaṃ āropetvā tattha tesaṃ dānaṃ datvā bhattakiccāvasāne rājā saṅghattherassa devī saṅghanavakassa ca pādamūle nipajjitvā ayyā paccayehi na kilamissantu, mayaṃ puññena na hāyissāma, amhākaṃ idha vāsāya paṭiññaṃ dethāti paṭiññaṃ kāretvā uyyāne nivāsaṭṭhānādayo kāretvā yāvajīvaṃ paccakabuddhe upaṭṭhahitvā tesu parinibbutesu sādhukīḷanaṃ kāretvā candanā garuādīhi sarīrakiccaṃ kāretvā dhātuyo gahetvā cetiyaṃ patiṭṭhāpetvā evarūpānampi mahānubhāvānaṃ mahesīnaṃ maraṇaṃ bhavissati, kimaṅgaṃ pana mādisānanti saṃvegajāto jeṭṭhaputtaṃ rajje patiṭṭhāpetvā sayaṃ pabbajaṃ pabbaji, devīpi raññe pabbajite ahaṃ kiṃkarissāmīti pabbajitvā dvepi uyyāne vasantā jhānābhiññaṃ nibbattetvā jhānasukhena vītināmentā āyupariyosāne brahmaloke nibbattiṃsu. Te amhākaṃ bhagavato kāle brāhmaṇakule nibbattitvā buddhasāsane pabbajiṃsu, tadā nandiyarājā dhutaṅgadharānaṃ aggo mahākassapattheronāma hutvā cando viya suriyo viyaca loke pākaṭo hutvā bhagavati pari- nibbute buddhasāsanaṃ ativiya sobheti. Bhariyāpissa bhaddakāpiḷānī nāma ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      "."
    ],
    "innerText": "16."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Datvā pureko vipine caranto,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Paccekabuddhassanuvātamattaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Katvā saraṭṭhaṃ kurudīpasobhaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mahānubhāvo vasudhā dhiposi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      "."
    ],
    "innerText": "17."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tumheca bhonto khalu sīlavante,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dadātha dānāni anappakāni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Taṃ vo patiṭṭhāca bhavantarasmiṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cintāmaṇiṃ kappataruṃva sāranti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nandiyarājassa vatthuṃ pathamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "12. Aññataramanussassa vatthumhi ayamānupubbīkathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Amhākaṃ bhagavati parinibbute pāṭaliputtasamīpe aññatarasmiṃ gāme aññataro duggatamanusso vasati, so panekadivasaṃ aññataraṃ gāmaṃ gacchanto dve sāṭake nivāsetvā mahantaṃ aṭaviṃpāpuṇi, tadevaṃ gacchantaṃ disvā etassa vatthaṃ gaṇhissāmīti eko coro anubandhi, so dūratova āgacchantaṃ coraṃ disvā cintesi, ahametasmā palāyituṃ vā tena saddhiṃyujjhituṃ vā na sakkomi, ayamāgantvā avassaṃ anicchantassāpi me vatthaṃ gaṇhissati. Mayāpissa niratthakena harituṃ na sakkā, dānavasenassa dassāmīti sanniṭṭhāna makāsi, atha coro āgantvā vatthakaṃ parāmasi, atha so puriso cittaṃ pasādetvā imaṃ mama vatthadānaṃ bhavabhogasukhatthāya paccayo hotūti vatthaṃ datvā ducchāditattā mahāmaggaṃ pahāya aññena jaṅghāmaggena gacchanto āsivisena daṭṭho kālaṃ katvā himavantappadese ",
      " dvādasayojanike kanakavimāne nekaccharāsahassaparivuto nibbatti. Vimānaṃ panassa parivāretvā tiyojanike ṭhāne kapparukkhā nibbattiṃsu, so mahantaṃ dibbasampattiṃ disvā somanassaṃ pavedento āha."
    ],
    "innerText": "Amhākaṃ bhagavati parinibbute pāṭaliputtasamīpe aññatarasmiṃ gāme aññataro duggatamanusso vasati, so panekadivasaṃ aññataraṃ gāmaṃ gacchanto dve sāṭake nivāsetvā mahantaṃ aṭaviṃpāpuṇi, tadevaṃ gacchantaṃ disvā etassa vatthaṃ gaṇhissāmīti eko coro anubandhi, so dūratova āgacchantaṃ coraṃ disvā cintesi, ahametasmā palāyituṃ vā tena saddhiṃyujjhituṃ vā na sakkomi, ayamāgantvā avassaṃ anicchantassāpi me vatthaṃ gaṇhissati. Mayāpissa niratthakena harituṃ na sakkā, dānavasenassa dassāmīti sanniṭṭhāna makāsi, atha coro āgantvā vatthakaṃ parāmasi, atha so puriso cittaṃ pasādetvā imaṃ mama vatthadānaṃ bhavabhogasukhatthāya paccayo hotūti vatthaṃ datvā ducchāditattā mahāmaggaṃ pahāya aññena jaṅghāmaggena gacchanto āsivisena daṭṭho kālaṃ katvā himavantappadese dvādasayojanike kanakavimāne nekaccharāsahassaparivuto nibbatti. Vimānaṃ panassa parivāretvā tiyojanike ṭhāne kapparukkhā nibbattiṃsu, so mahantaṃ dibbasampattiṃ disvā somanassaṃ pavedento āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      "."
    ],
    "innerText": "1."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pariṇāmitamattena, dānassa sakasantakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dadāti vipulaṃ bhogaṃ, dibbamissariyaṃ varaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      "."
    ],
    "innerText": "2."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dvādasayojanubbedhaṃ, duddikkhaṃ cakkhumūsanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kūṭā gāravarupetaṃ, sabbasovaṇṇayaṃ subhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      "."
    ],
    "innerText": "3."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mama puññena nibbattaṃ, nekarāgaddhajākulaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tatheva parisuddhehi, vitānehi ca laṅkataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      "."
    ],
    "innerText": "4."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pāsādapariyantamhi, dibbavatthāni lambare;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vāteritā te sobhanti, avhentāva sudhāsino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      "."
    ],
    "innerText": "5."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pāsādassa samantā me, bhūmibhāge tiyojane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Icchiticchitadātāro, jātāsuṃ surapādapā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      "."
    ],
    "innerText": "6."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tattha naccehi gītehi, vādehi turiyehi ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ne kaccharāsahassehi, modāmi bhavane mama."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      "."
    ],
    "innerText": "7."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Na sammā dinnavatthassa, akkhette phalamī disaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khette sammā dadantassa, ko phalaṃ vaṇṇayissatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      "."
    ],
    "innerText": "8."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Evaṃ vidhampi kusalaṃ manujo karitvā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Pappoti dibbavibhavaṃ munivaṇṇanīyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Mantvāna bho dadatha dānavaraṃ susīle,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saddhāya suddhamanasāssa visesabhāgīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aññataramanussassa vatthuṃ dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "13. Visamalomakumārassa vatthumhi ayamānupubbīkathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atīte ",
      " kira imasmiṃ jambudīpe kassapo nāma sammāsambuddho pāramiyo pūretvā sabbaññutaṃ patto lokassa dukkhāpanudo sukhāvaho paṭivasati lokaṃ nibbāṇamahānagaravare paripūrento. Tasmiṃ samaye aññataro puriso satthu dhammadesanaṃ sutvā pasanno bhikkhusaṅghassa dānaṃ dento sīlaṃ rakkhanto uposathakammaṃ karonto nānāvidhāni puññakammāni katvā suttappabuddhoviya gantvā devaloke nibbatti sabbaratanamaye dibbavidhāne devaccharāsahassaparivuto. Tattha yāvatāyukaṃ ṭhatvā tato cuto amhākaṃ bhagavati parinibbute jambudīpe pāṭaliputtanagare āṇācakkavattidhammāsokamahānarindassa aggamahesiyā kucchimhi nibbatti. Tassa nāmaṃ karonto sīse lomaṃ visamaṃ hutvā jātatthā visamalomakumāroti sañjāniṃsu. So kamena viññutaṃ patto balasampanno ahosi. Mahāthāmo abhirūpoca ahosi. Dassanīyo pāsādiko yasaparivārasampanno paṭivasati. Tato aparena samayena dhammāsokamahānarindo caturāsītisahassarājaparivuto anantabalavāhano kī ḷā pa ro himavantaṃ gantvā yathābhirantaṃ kīḷitvā āgacchanto candabhāgaṃ nāma gaṅgaṃ sampāpuṇi. Sā pana yojanavitthatā tigāvutagambhīrā ahosi. Tadā sā adhunāgatehi oghehi mahāpheṇasamākulā bahūmiyo ubhokūle uttarantī mahāvegā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahāvegāgacchantī itisabbattha]"
      },
      " gacchanti. Tadā rājā gaṅgaṃ disvā ko nāmettha puriso evaṃvidhaṃ mahāgaṅgaṃ tarituṃ samattho bhavissatīti āha. Taṃ sutvā visamaloma kumāro āgantvā vanditvā ahaṃ deva gaṅgaṃ taritvā gantuñca āgantuñca sakkomīti āha. Rājā sādhūti sampaṭicchi. Atha kumāro gāḷhaṃ nivāsetvā makaradantiyā ",
      " kese bandhitvā gaṅgākūle ṭhito aṭṭhārasahatthaṃ abbhuggantvā usabhamattaṭṭhāne patitvā taritu mārabhi. Tato caṇḍasotaṃ chinditvā taranto gamanā gamanakāle gaṇhanatthāya āgate caṇḍasuṃsumāre pāṇinā paharitvā cuṇṇavicuṇṇaṃ karonto vīsasataṃ māretvā uttāretvā talamuggamma rājānaṃ vanditvā aṭṭhāsi. Rājā taṃ kāraṇaṃ disvā bhayappatto eso kho maṃ māretvā rajjampi gahituṃ samattho. Etaṃ māretuṃ vaṭṭatīti cintetvā nagaraṃ sampatto kumāraṃ pakkosāpetvā amacce āha. Imaṃ bhaṇe bandhanāgāre karothāti. Te tathā kariṃsu, athassa bandhanāgāre vasantassa cattāro māsā atikkantā. Tato rājā catumāsaccayena dīghato saṭṭhihatthappamāṇe saṭṭhiveḷukalāpe āharāpetvā gaṇṭhiyo sodhāpetvā anto ayosāraṃ pūretvā rājaṅgaṇe ṭhapāpetvā visamalomakumāraṃ bandhanāgārato āhārāpetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āṇāpetvā itisabbattha]"
      },
      " amacce evamāha. Bhaṇe svāyaṃ kumāro iminā khaggena ime veḷukalāpe caturaṅgulaṃ katvā chindatu. No ce chindituṃ sakkoti. Taṃ mārethāti āha, taṃ sutvā kumāro ahaṃ bandhanāgāre ci ra vu ttho jighacchāpīḷito āhārena kilamiṃ, yannūnāhaṃ āhāraṃ bhuñcitvā chindeyyanti. Te natthi dāni tuyhaṃ āhāranti āhaṃsu. Tenahi pokkharaṇiyā pānīyaṃ pivissāmīti āha. Te sādhūti pokkharaṇiṃ nesuṃ. Kumāro pokkharaṇiṃ otaritvā nahāyitvā nimuggo yāvadatthaṃ kalalaṃ bhuñcitvā pānīyaṃ pivitvā uṭṭhāya asipattaṃ gahetvā mahājanānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahājanānaṃpassantameva itisabbattha]"
      },
      " passantānameva aṭṭhāsītihatthaṭṭhānaṃ ākāsaṃ ullaṅghitvā sabbaveḷukalāpe caturaṅgulamattena khaṇḍākhaṇḍaṃ kurumāno otaritvā mūle thūlaayasalākaṃ patvā kiṇīti saddaṃ sutvā asipattaṃ vissajjetvā rodamāno aṭṭhāsi. Tato rājapurisehi kimattaṃ rodasīti vutte ",
      " ettakānaṃ purisānamantare mayhaṃ ekopi suhado natti. Sace bhaveyya, imesaṃ veḷukalāpānamantare ayo sāraṃ atthibhāvaṃ katheyya, ahaṃ pana jānamāno ime veḷu kalāpe aṅgulaṅgulesu chindeyyanti āha. Tato rājā kumārena katakammaṃ oloketvā pasanno uparājaṭṭhānaṃ bahuñca vibhavaṃ dāpesi, evamassa balasampattilābho nāma na jātigottakulapadesādīnaṃ balaṃ. Na pāṇātipātādiduccaritānaṃ balaṃ. Kassetaṃ balanti. Kassapasammāsambuddhakāle bhikkhusaṅghassa dinnadānādisucaritakammavipākaṃ. Tena vuttaṃ."
    ],
    "innerText": "Atīte kira imasmiṃ jambudīpe kassapo nāma sammāsambuddho pāramiyo pūretvā sabbaññutaṃ patto lokassa dukkhāpanudo sukhāvaho paṭivasati lokaṃ nibbāṇamahānagaravare paripūrento. Tasmiṃ samaye aññataro puriso satthu dhammadesanaṃ sutvā pasanno bhikkhusaṅghassa dānaṃ dento sīlaṃ rakkhanto uposathakammaṃ karonto nānāvidhāni puññakammāni katvā suttappabuddhoviya gantvā devaloke nibbatti sabbaratanamaye dibbavidhāne devaccharāsahassaparivuto. Tattha yāvatāyukaṃ ṭhatvā tato cuto amhākaṃ bhagavati parinibbute jambudīpe pāṭaliputtanagare āṇācakkavattidhammāsokamahānarindassa aggamahesiyā kucchimhi nibbatti. Tassa nāmaṃ karonto sīse lomaṃ visamaṃ hutvā jātatthā visamalomakumāroti sañjāniṃsu. So kamena viññutaṃ patto balasampanno ahosi. Mahāthāmo abhirūpoca ahosi. Dassanīyo pāsādiko yasaparivārasampanno paṭivasati. Tato aparena samayena dhammāsokamahānarindo caturāsītisahassarājaparivuto anantabalavāhano kī ḷā pa ro himavantaṃ gantvā yathābhirantaṃ kīḷitvā āgacchanto candabhāgaṃ nāma gaṅgaṃ sampāpuṇi. Sā pana yojanavitthatā tigāvutagambhīrā ahosi. Tadā sā adhunāgatehi oghehi mahāpheṇasamākulā bahūmiyo ubhokūle uttarantī mahāvegā [mahāvegāgacchantī itisabbattha] gacchanti. Tadā rājā gaṅgaṃ disvā ko nāmettha puriso evaṃvidhaṃ mahāgaṅgaṃ tarituṃ samattho bhavissatīti āha. Taṃ sutvā visamaloma kumāro āgantvā vanditvā ahaṃ deva gaṅgaṃ taritvā gantuñca āgantuñca sakkomīti āha. Rājā sādhūti sampaṭicchi. Atha kumāro gāḷhaṃ nivāsetvā makaradantiyā kese bandhitvā gaṅgākūle ṭhito aṭṭhārasahatthaṃ abbhuggantvā usabhamattaṭṭhāne patitvā taritu mārabhi. Tato caṇḍasotaṃ chinditvā taranto gamanā gamanakāle gaṇhanatthāya āgate caṇḍasuṃsumāre pāṇinā paharitvā cuṇṇavicuṇṇaṃ karonto vīsasataṃ māretvā uttāretvā talamuggamma rājānaṃ vanditvā aṭṭhāsi. Rājā taṃ kāraṇaṃ disvā bhayappatto eso kho maṃ māretvā rajjampi gahituṃ samattho. Etaṃ māretuṃ vaṭṭatīti cintetvā nagaraṃ sampatto kumāraṃ pakkosāpetvā amacce āha. Imaṃ bhaṇe bandhanāgāre karothāti. Te tathā kariṃsu, athassa bandhanāgāre vasantassa cattāro māsā atikkantā. Tato rājā catumāsaccayena dīghato saṭṭhihatthappamāṇe saṭṭhiveḷukalāpe āharāpetvā gaṇṭhiyo sodhāpetvā anto ayosāraṃ pūretvā rājaṅgaṇe ṭhapāpetvā visamalomakumāraṃ bandhanāgārato āhārāpetvā [āṇāpetvā itisabbattha] amacce evamāha. Bhaṇe svāyaṃ kumāro iminā khaggena ime veḷukalāpe caturaṅgulaṃ katvā chindatu. No ce chindituṃ sakkoti. Taṃ mārethāti āha, taṃ sutvā kumāro ahaṃ bandhanāgāre ci ra vu ttho jighacchāpīḷito āhārena kilamiṃ, yannūnāhaṃ āhāraṃ bhuñcitvā chindeyyanti. Te natthi dāni tuyhaṃ āhāranti āhaṃsu. Tenahi pokkharaṇiyā pānīyaṃ pivissāmīti āha. Te sādhūti pokkharaṇiṃ nesuṃ. Kumāro pokkharaṇiṃ otaritvā nahāyitvā nimuggo yāvadatthaṃ kalalaṃ bhuñcitvā pānīyaṃ pivitvā uṭṭhāya asipattaṃ gahetvā mahājanānaṃ [mahājanānaṃpassantameva itisabbattha] passantānameva aṭṭhāsītihatthaṭṭhānaṃ ākāsaṃ ullaṅghitvā sabbaveḷukalāpe caturaṅgulamattena khaṇḍākhaṇḍaṃ kurumāno otaritvā mūle thūlaayasalākaṃ patvā kiṇīti saddaṃ sutvā asipattaṃ vissajjetvā rodamāno aṭṭhāsi. Tato rājapurisehi kimattaṃ rodasīti vutte ettakānaṃ purisānamantare mayhaṃ ekopi suhado natti. Sace bhaveyya, imesaṃ veḷukalāpānamantare ayo sāraṃ atthibhāvaṃ katheyya, ahaṃ pana jānamāno ime veḷu kalāpe aṅgulaṅgulesu chindeyyanti āha. Tato rājā kumārena katakammaṃ oloketvā pasanno uparājaṭṭhānaṃ bahuñca vibhavaṃ dāpesi, evamassa balasampattilābho nāma na jātigottakulapadesādīnaṃ balaṃ. Na pāṇātipātādiduccaritānaṃ balaṃ. Kassetaṃ balanti. Kassapasammāsambuddhakāle bhikkhusaṅghassa dinnadānādisucaritakammavipākaṃ. Tena vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      "."
    ],
    "innerText": "1."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kassapassa munindassa, kāle aññataro naro;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sambuddhamupasaṃkamma, sutvā dhammaṃ sudesitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      "."
    ],
    "innerText": "2."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Paṭiladdhasaddho hutvā, sīlavantāna bhikkhunaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Madhurannapāne pacure, adāsi sumano tadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      "."
    ],
    "innerText": "3."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Adāsi cīvare patte, tatheva kāyabandhane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Adā khīrasalākañca, bahū kattarayaṭṭhiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      "."
    ],
    "innerText": "4."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Adā supassayaṃ dānaṃ, mañcapīṭhādikaṃ tathā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pāvāra kambalādīni, adā sītanivāraṇe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      "."
    ],
    "innerText": "5."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Adā bhesajjadānāni, ārogyatthāya bhikkhunaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evaṃ nānāvidhaṃ puññaṃ, katvāna tidivaṃ gato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      "."
    ],
    "innerText": "6."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tattha dibbavimānamhi, uppanno so mahiddhiko;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Devaccharāparivuto, devasenāpurakkhato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      "."
    ],
    "innerText": "7."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dibbehi naccagītehi, dibbavāditatantihi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Modamāno anekehi, dibbasampattiyā saha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      "."
    ],
    "innerText": "8."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yāvatāyuṃ tahiṃ ṭhatvā, jambudīpe manorame;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pure pāṭaliputtamhi, dhammāsokassa rājino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      "."
    ],
    "innerText": "9."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Putto ",
      " hutvāna nibbatti, mahāthāmo mahābalo;"
    ],
    "innerText": "Putto hutvāna nibbatti, mahāthāmo mahābalo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mahāyaso mahābhogo, āsi buddhādimāmako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      "."
    ],
    "innerText": "10."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kātabbaṃ kusalaṃ tasmā, bhavasampatti micchatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pāletabba matho sīlaṃ, bhāvetabbañca bhāvananti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato kumāro uparājaṭṭhānaṃ labhitvā sampattiṃanubhavamāno moggaliputtatissattheramādiṃ katvā mahābhikkhusaṅghassa cīvarapiṇḍapātasenāsanagilānapaccayadānā divasena sakkāraṃ katvā sīlaṃ rakkhitvā uposathakammaṃ katvā āyupariyosāne yathākammaṃ gatoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      "."
    ],
    "innerText": "11."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Evaṃvidhaṃ sucaritaṃ sumano karitvā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Bhāgissa nekavibhavassa bhavābhavesu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tumhepi bho sucaritaṃ vibhavānurūpaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Katvāna nibbutipadaṃ karagaṃ karothāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Visamalomakumārassa vatthuṃ tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "14. Kañcanadeviyā vatthumhi ayamānupubbīkathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Jambudīpe kira devaputtanagaraṃ nāma dassanīyaṃ ekaṃ nagaraṃ ahosi. Tasmiṃ samaye manussā yebhuyyena pattamahaṃ nāma pūjaṃ karonti, bhagavatā paribhuttapattaṃ gahetvā katānekapūjāvidhānā ussavaṃ karonti. Taṃ pattamahanti vuccati. Tasmiṃ samaye devaputtanagare rājā sabbaratanamayaṃ rathaṃ sabbālaṅkārehi alaṅkārāpetvā kumudapattavaṇṇe cattāro sindhave yojetvā susikkhitasippācariyehi sattaratanapariniṭṭhite asītihatthaveḷagge satthunā paribhuttaṃ selamayapattaṃ muttājālādīhi alaṅkaritvā veḷaggaṃ āropetvā veḷuṃ ",
      " rathe ṭhapāpetvā nagaraṃ devanagaraṃ viya alaṅkaritvā dhajapatākādayo ussāpetvā toraṇaggha kapantiyoca puṇṇaghaṭadīpamālādayoca patiṭṭhāpetvā anekehi pūjāvidhānehi nagaraṃ padakkhiṇaṃ kāretvā nagaramajjhe susajjitaratanamaṇḍape pattadhātuṃ ṭhapetvā sattame divase mahādhammasavaṇaṃ kārāpesi. Tadā tasmiṃ janapade bahū manussāca devatāca yakkharakkhasanāgasupaṇṇādayoca manussavesena yebhuyyena taṃ samāgamaṃ otaranti, evamacchariyaṃ taṃ pūjāvidhānaṃ ahosi."
    ],
    "innerText": "Jambudīpe kira devaputtanagaraṃ nāma dassanīyaṃ ekaṃ nagaraṃ ahosi. Tasmiṃ samaye manussā yebhuyyena pattamahaṃ nāma pūjaṃ karonti, bhagavatā paribhuttapattaṃ gahetvā katānekapūjāvidhānā ussavaṃ karonti. Taṃ pattamahanti vuccati. Tasmiṃ samaye devaputtanagare rājā sabbaratanamayaṃ rathaṃ sabbālaṅkārehi alaṅkārāpetvā kumudapattavaṇṇe cattāro sindhave yojetvā susikkhitasippācariyehi sattaratanapariniṭṭhite asītihatthaveḷagge satthunā paribhuttaṃ selamayapattaṃ muttājālādīhi alaṅkaritvā veḷaggaṃ āropetvā veḷuṃ rathe ṭhapāpetvā nagaraṃ devanagaraṃ viya alaṅkaritvā dhajapatākādayo ussāpetvā toraṇaggha kapantiyoca puṇṇaghaṭadīpamālādayoca patiṭṭhāpetvā anekehi pūjāvidhānehi nagaraṃ padakkhiṇaṃ kāretvā nagaramajjhe susajjitaratanamaṇḍape pattadhātuṃ ṭhapetvā sattame divase mahādhammasavaṇaṃ kārāpesi. Tadā tasmiṃ janapade bahū manussāca devatāca yakkharakkhasanāgasupaṇṇādayoca manussavesena yebhuyyena taṃ samāgamaṃ otaranti, evamacchariyaṃ taṃ pūjāvidhānaṃ ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tadā eko nāgarājā uttamarūpadharaṃ agatapubbapurisaṃ ekaṃ kumārikaṃ dhammaparisantare nisinnaṃ disvā tassā paṭibaddhacitto anekākārehi taṃ yā ci tvā tassā aladdhamāno kujjhitvā nāsāvātaṃ vissajjesi imaṃ māressāmīti. Taṃ tassā saddhābalena kiñci upaddavaṃ kātuṃ samattho nāhosi. Athassā nāgo pādato paṭṭhāya yāvasakalasarīraṃ bhogena veṭhetvā sīse phaṇaṃ katvā bhāyāpento aṭṭhāsi. Anaññavihitāya tāya dhammasavaṇabalena aṇumattampi dukkhaṃ nāhosi. Pabhātāya rattiyā taṃ disvā manussā kimetanti kāraṇaṃ pucchiṃsu, sāpi tesaṃ kathetvā evaṃ saccakiriyamakāsi. Tathāhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      "."
    ],
    "innerText": "1."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Brahmacārī ahosāhaṃ, sañjātā idha mānuse;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tena saccena maṃ nāgo, khippameva pamuñcatu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      "."
    ],
    "innerText": "2."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kāmāturassa nāgassa, nokāsamakariṃyato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tena saccena maṃ nāgo, khippameva muñcatu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      "."
    ],
    "innerText": "3."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Visavātena khittassa, kupitassoragassahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Akuddhā tena saccena, so maṃ khippaṃ pamuñcatu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      "."
    ],
    "innerText": "4."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Saddhammaṃ suṇamānāhaṃ, garugāravabhattiyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Assosiṃ tena saccena, khippaṃ nāgo pamuñcatu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      "."
    ],
    "innerText": "5."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Akkharaṃvā ",
      " padaṃvāpi, avināsetvāva ādito;"
    ],
    "innerText": "Akkharaṃvā padaṃvāpi, avināsetvāva ādito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Assosiṃ tena saccena, khippaṃ nāgo pamuñcatūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saccakiriyāvasāne nāgarājā tassā atīva pasanno bhogaṃ viniveṭhetvā phaṇasataṃ māpetvā taṃ phaṇagabbhe nisīdāpetvā bahūhi nāgamānavakehi saddhiṃ udakapūjaṃ nāma pūja makāsi, taṃ disvā bahū nagaravāsino acchariyabbhutajātā aṭṭhārasakoṭidhanena pūja makaṃsu. Tathāhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      "."
    ],
    "innerText": "6."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Natthi saddhāsamo loke, suhado sabbakāmado;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Passathassā balaṃ saddhā, pūjentevaṃ naro ragā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      "."
    ],
    "innerText": "7."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Idha lokeva sālattha, bhavabhoga manappakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā saddhena kātabbaṃ, ratanattayagāravanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Athevaṃ sā paṭiladdhamahāvibhavā yāvajīvaṃ komāriya brahmacāriṇī hutvā āyupariyosāne kālaṃ katvā tasmiṃyeva nagare rañño aggamahesiyā kucchimhi paṭisandhiṃ gaṇhitvā dasamāsaccayena mātukucchito nikkhami. Nikkhantadivase panassā sakaladevaputtanagare ratanavassaṃ vassi. Tenassā kañjanadevīti nāmaṃ kariṃsu. Samantapāsādikā ahosi. Abhirūpā devaccharapaṭibhāgā. Mukhato uppalagandho vāyati. Sarīrato candanagandho vāyati. Sakalasarīrato bālasuriyo viya raṃsiyo nicchārentī caturatanagabbhe padīpakiccaṃ nāma natthi. Sabbo gabbho sarīrā lokena eko bhāso hoti, tassā rūpasampatti sakalajambudīpe pākaṭā ahosi. Tato sakalajambudīpavāsī rājāno tassā atthāya piturañño paṇṇākārāni pahiṇiṃsu. Sā pana pañcakāme ananulittā pitaraṃ anujānāpetvā bhikkhunū passayaṃ gantvā pabbajitvā vipassanaṃ vaḍḍhetvā saha paṭisambhidāhi arahattaṃ pāpuṇīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      "."
    ],
    "innerText": "8."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Sutvāna ",
      " sādaravasena kumārikevaṃ;"
    ],
    "innerText": "Sutvāna sādaravasena kumārikevaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dhammañhi sīlamamalaṃ paripālayantī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Laddhāna nekavibhavaṃ vibhavaṃ payātā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mā bho pamajjatha sadā kusalappayogeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kañcanadeviyā vatthuṃ catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "15. Byagghassa vatthumhi ayamānupubbīkathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Jambudīpe cūlaraṭṭhā sanne bārāṇasīnagare ekaṃ paṃsupabbataṃ vinivijjhitvā mahāmaggo hoti, tattha vemajjhe eko byaggho attano andhapitaraṃ pabbataguhāyaṃ katvā posento vasati. Tasseva pabbatassa vanadvāre tuṇḍilo nāma eko suvapotako rukkhasmiṃ vasati. Te ubhopi aññamaññaṃ piyasahāyā ahesuṃ, tasmiṃ samaye paccantagāmavāsī eko manusso attano mātugāmena saddhiṃ kalahaṃ katvā bārāṇasiṃ gacchanto taṃ vanadvāraṃ sampāpuṇi. Atha suvapotako parihīnattabhāvaṃ dukkhitaṃ taṃ disvā kampamānahadayo taṃ pakkositvā bho kuhiṃ gacchasīti āha, tena parakhaṇḍaṃ gacchāmīti vutte tuṇḍilo bho imasmiṃ vanakhaṇḍamajjhe eko byaggho vasati. Kakkhalo pharuso sampattasampatte māretvā khādati. Mā tvaṃ tena gacchāti āha. Svāyaṃ dubbhago manusso hitakāmassa tassa vacanaṃ anādiyitvā gacchāmevāti āha. Tuṇḍilo tenahi samma yadi anivattamāno gacchasi. Eso byaggho mama sahāyo. Me vacanaṃ tava santikā sutvā na gaṇhātīti. Tassa taṃ anādiyanto so suvarāje paduṭṭhacitto muggarena paharitvā māretvā araṇiṃ aggiṃ katvā maṃsaṃ khādi. Asappurisasaṃsaggo nāme sa idha lokaparalokesu dukkhāvahoyeva. Tathāhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      "."
    ],
    "innerText": "1."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Mayā ",
      " kataṃ mayhamidaṃ, iti vessānaraṃ naro;"
    ],
    "innerText": "Mayā kataṃ mayhamidaṃ, iti vessānaraṃ naro;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Samāliṅgati sappemo, dahatevassa viggahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      "."
    ],
    "innerText": "2."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Madhukhīrādidānena, pemasā paripālito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sorago kupitovassa, ḍasatevassa viggahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      "."
    ],
    "innerText": "3."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Evaṃ nihīnajaccena, pāpena akataññunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Narā dhamena dīnena, katopi khaṇasaṅgamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      "."
    ],
    "innerText": "4."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Asādhuko ayaṃtevaṃ, jānamānena jantunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Muhuttampi na kātabbo, saṅgamo so anatthadoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato so asappuriso maṃsaṃ khāditvā gacchanto vanakhaṇḍamajjhaṃ sampāpuṇi. Atha byaggho taṃ disvā mahānādaṃ karonto gahaṇatthāya uṭṭhāsi. So byagghaṃ disvā bhayappatto tuṇḍilassa vacanaṃ saritvā ahaṃ bho tava sahāyatuṇḍilassa santikā āgatomhīti āha, taṃ sutvā byaggho attamano ehi sammāti taṃ pakkositvā attano vasanaṭṭhānaṃ netvā khāditabbāhārena taṃ santappetvā pitusantike nisīdāpetvā puna vanakhaṇḍa magamāsi. Athassa pitā puttassa gatakāle tena saddhiṃ sallapanto tassa vacanānusārena tuṇḍilaṃ māretvā khāditabhāvaṃ aññāsi. Tato so puttassa āgatakāle tava sahāyo tena māritoti āha. Taṃ sutvā byaggho anattamano vegena tassa vasanaṭṭhānaṃ gantvā samma tuṇḍilāti saddaṃ katvā apassanto luñcitapattaṃcassa disvā nissaṃsayaṃ tena mārito me sahāyoti socanto paridevanto āgañchi. Atha so asappuriso tasmiṃ tattha gate tassa pitaraṃ pāsāṇena paharitvā māretvā byagghaṃca dāni māressāmīti byagghāgamanamaggaṃ olokento nilīno aṭṭhāsi. Tasmiṃ khaṇe byagghopi āgañchi. So tassā gatakāle tassa tejena bhīto gantvā ",
      " jīvitaṃ me sāmi dehīti pādamūle urena nipajji, byaggho pana tena katakammaṃ disvā tasmiṃ cittaṃ nibbāpetvā mama sahāyassa sāsanamādāyāgatassa dubbhituṃ na yuttanti cintento taṃ samassāsetvā gaccha sammāti sukhaṃ pesesi. Evañhi sappurisasamāgamo nāma idha lokaparalokesu sukhāvahoyeva, vuttaṃhi."
    ],
    "innerText": "Tato so asappuriso maṃsaṃ khāditvā gacchanto vanakhaṇḍamajjhaṃ sampāpuṇi. Atha byaggho taṃ disvā mahānādaṃ karonto gahaṇatthāya uṭṭhāsi. So byagghaṃ disvā bhayappatto tuṇḍilassa vacanaṃ saritvā ahaṃ bho tava sahāyatuṇḍilassa santikā āgatomhīti āha, taṃ sutvā byaggho attamano ehi sammāti taṃ pakkositvā attano vasanaṭṭhānaṃ netvā khāditabbāhārena taṃ santappetvā pitusantike nisīdāpetvā puna vanakhaṇḍa magamāsi. Athassa pitā puttassa gatakāle tena saddhiṃ sallapanto tassa vacanānusārena tuṇḍilaṃ māretvā khāditabhāvaṃ aññāsi. Tato so puttassa āgatakāle tava sahāyo tena māritoti āha. Taṃ sutvā byaggho anattamano vegena tassa vasanaṭṭhānaṃ gantvā samma tuṇḍilāti saddaṃ katvā apassanto luñcitapattaṃcassa disvā nissaṃsayaṃ tena mārito me sahāyoti socanto paridevanto āgañchi. Atha so asappuriso tasmiṃ tattha gate tassa pitaraṃ pāsāṇena paharitvā māretvā byagghaṃca dāni māressāmīti byagghāgamanamaggaṃ olokento nilīno aṭṭhāsi. Tasmiṃ khaṇe byagghopi āgañchi. So tassā gatakāle tassa tejena bhīto gantvā jīvitaṃ me sāmi dehīti pādamūle urena nipajji, byaggho pana tena katakammaṃ disvā tasmiṃ cittaṃ nibbāpetvā mama sahāyassa sāsanamādāyāgatassa dubbhituṃ na yuttanti cintento taṃ samassāsetvā gaccha sammāti sukhaṃ pesesi. Evañhi sappurisasamāgamo nāma idha lokaparalokesu sukhāvahoyeva, vuttaṃhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      "."
    ],
    "innerText": "5."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sabbhireva samāsetha, sabbhi kubbetha santhavaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbattha santhavo tena, seyyo hoti na pāpiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      "."
    ],
    "innerText": "6."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sukhāvaho dukkhanudo, sadā sabbhi samāgamo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā sappuriseheva, saṅgamo hotu jantunaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato so byaggho tena mettacittānubhāvena kālaṃ katvā sagge nibbattoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      "."
    ],
    "innerText": "7."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Evaṃvidhopi pharuso paramaṃsabhojī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Byaggho dayāyupagato sugatiṃ sumedho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tasmā karotha karuṇaṃ satataṃ janānaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Taṃ vo dadāti vibhavañca bhavesu bhoganti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Byagghassa vatthuṃ pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "16. Phalakakhaṇḍadinnassa vatthumhi ayamānupubbīkathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sāvatthiyaṃ kireko manusso uttarāpathaṃ gacchāmīti addhānamaggapaṭipanno gimhānamāse majjhaṇhe bahalātapena kilanto hutvā rukkhacchāyaṃ pavisitvā tambulaṃ khādanto phalake nisīdi. Atha uttarāpathenāgacchānto eko tatheva ātapena kilanto āgantvā purimassa santike nisīditvā bho pānīyaṃ atthīti pucchi. Itaro pānīyaṃ natthīti āha. Athassa ",
      " so mayhampi bho tambulaṃ dehi pipāsitomhiti vatvāpi na labhi. Catukahāpaṇena ekaṃ tambulapaṇṇaṃ kiṇitvā laddho tattheva nisīditvā khāditvā pipāsaṃ vinodetvā tena upakārena tassa sinehaṃ katvā attano gamanaṭṭhāna magamāsi, athā parabhāge so paṭṭanaṃ gantvā nāvāya vaṇijjatthāya gacchanto samuddamajjhaṃ pāpuṇi. Tato sattame divase nāvā bhijji. Manussā macchakacchapānaṃ bhakkhā jātā. So eva puriso arogo hutvā ekaṃ phalakakhaṇḍaṃ ure katvā samuddaṃ tarati. Athe taropi tatheva nāvāya bhinnāya seso hutvā samuddaṃ taranto purimena samāgami. Atha te sattadivasaṃ samudde tarantā aññamaññaṃ sañjāniṃsu. Tesu kahāpaṇe datvā tambulaṃ gahito ekaṃ phalakakhaṇḍaṃ ure katvā tarati. Itarassetaṃ natthi. Atha so kahāpaṇe gahetvā dinnatambulamattasso pakāraṃ saritvā attano phalakakhaṇḍaṃ tassa adāsi. So tasmiṃ sayitvā taranto taṃ pahāya agamāsi, aparo anādhārakena taranto ossaṭṭhaviriyo udake osīditumārati. Tasmiṃ khaṇe samudde adhivatthā maṇimekhalā nāma devadhītā osīdantaṃ taṃ disvā sappurisoti tassa guṇānussarantī vegenā gantvā taṃ attano ānubhāvena samuddatīraṃ pāpesi. Itaraṃpi sā etasseva guṇānubhāvena tīraṃ pāpesi. Atha phalakenotiṇṇapuriso taṃ disvā vimhito kathaṃ purato ahosi sammāti pucchi. So na jānāmi. Apica kho sukheneva tīraṃ pattosmīti āha. Atha devadhītā dissamānakasarīreneva attanā ānītabhāvaṃ ārocentī āha."
    ],
    "innerText": "Sāvatthiyaṃ kireko manusso uttarāpathaṃ gacchāmīti addhānamaggapaṭipanno gimhānamāse majjhaṇhe bahalātapena kilanto hutvā rukkhacchāyaṃ pavisitvā tambulaṃ khādanto phalake nisīdi. Atha uttarāpathenāgacchānto eko tatheva ātapena kilanto āgantvā purimassa santike nisīditvā bho pānīyaṃ atthīti pucchi. Itaro pānīyaṃ natthīti āha. Athassa so mayhampi bho tambulaṃ dehi pipāsitomhiti vatvāpi na labhi. Catukahāpaṇena ekaṃ tambulapaṇṇaṃ kiṇitvā laddho tattheva nisīditvā khāditvā pipāsaṃ vinodetvā tena upakārena tassa sinehaṃ katvā attano gamanaṭṭhāna magamāsi, athā parabhāge so paṭṭanaṃ gantvā nāvāya vaṇijjatthāya gacchanto samuddamajjhaṃ pāpuṇi. Tato sattame divase nāvā bhijji. Manussā macchakacchapānaṃ bhakkhā jātā. So eva puriso arogo hutvā ekaṃ phalakakhaṇḍaṃ ure katvā samuddaṃ tarati. Athe taropi tatheva nāvāya bhinnāya seso hutvā samuddaṃ taranto purimena samāgami. Atha te sattadivasaṃ samudde tarantā aññamaññaṃ sañjāniṃsu. Tesu kahāpaṇe datvā tambulaṃ gahito ekaṃ phalakakhaṇḍaṃ ure katvā tarati. Itarassetaṃ natthi. Atha so kahāpaṇe gahetvā dinnatambulamattasso pakāraṃ saritvā attano phalakakhaṇḍaṃ tassa adāsi. So tasmiṃ sayitvā taranto taṃ pahāya agamāsi, aparo anādhārakena taranto ossaṭṭhaviriyo udake osīditumārati. Tasmiṃ khaṇe samudde adhivatthā maṇimekhalā nāma devadhītā osīdantaṃ taṃ disvā sappurisoti tassa guṇānussarantī vegenā gantvā taṃ attano ānubhāvena samuddatīraṃ pāpesi. Itaraṃpi sā etasseva guṇānubhāvena tīraṃ pāpesi. Atha phalakenotiṇṇapuriso taṃ disvā vimhito kathaṃ purato ahosi sammāti pucchi. So na jānāmi. Apica kho sukheneva tīraṃ pattosmīti āha. Atha devadhītā dissamānakasarīreneva attanā ānītabhāvaṃ ārocentī āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      "."
    ],
    "innerText": "1."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yo mātaraṃ pitaraṃvā, dhammena idha posati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rakkhanti taṃ sadā devā, samudde vā thalepi vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      "."
    ],
    "innerText": "2."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yo ce buddhañca dhammañca, saṃghañca saraṇaṃ gato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rakkhanti taṃ sadā devā, samudde vā thalepi vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      "."
    ],
    "innerText": "3."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Pañcavidhaṃ ",
      " aṭṭhavidhaṃ, pātimokkhañca saṃvaraṃ;"
    ],
    "innerText": "Pañcavidhaṃ aṭṭhavidhaṃ, pātimokkhañca saṃvaraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pāleti yo taṃ pālenti, devā sabbattha sabbadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      "."
    ],
    "innerText": "4."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kāyena vācā manasā, sucarittaṃ caratī dha yo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pālenti taṃ sadā devā, samudde vā thalepi vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      "."
    ],
    "innerText": "5."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yo sappurisadhammesu, ṭhito dha katavediko;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pālenti taṃ sadā devā, samudde vā thalepi vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tato so āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      "."
    ],
    "innerText": "6."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Neva dānaṃ adāsāhaṃ, na sīlaṃ paripālayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Kena me puññakammena, mamaṃ rakkhanti devatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchāmi saṃsayaṃ tuyhaṃ, taṃ me akkhāhi devateti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Devatā āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      "."
    ],
    "innerText": "7."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Agādhā pārage bhīme, sāgare duritā kare;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhinnanāvo taranto tvaṃ, hadaye katvā kaliṅgaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      "."
    ],
    "innerText": "8."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ṭhatvā sappurise dhamme, attāna manavekkhiya;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khaṇasanthavassa purisassa, adāsi phalakaṃ sakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      "."
    ],
    "innerText": "9."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Taṃ tuyhaṃ mittadhammañca, dānañca phalakassa te;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Patiṭṭhāsi samuddasmiṃ, evaṃ jānāhi mārisāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evañca vatvā sā te dibbāhārena santappetvā dibbavatthālaṅkārehi alaṅkaritvā attano ānubhāvena sāvatthinagareyeva te patiṭṭhāpesi. Tato paṭṭhāya tameva ārammaṇaṃ katvā te dānaṃ dadantā sīlaṃ rakkhantā uposathakammaṃ karontā āyupariyosāne saggaparāyaṇā ahesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      "."
    ],
    "innerText": "10."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Evaṃ parittakusalenapi sāgarasmiṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sattā labhanti saraṇaṃ khalu devatāhi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tumhepi sappurisataṃ na vināsayantā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mā bho pamajjatha sadā kusalappayogeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Phalakakhaṇḍadinnassa vatthuṃ chaṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "17. Corasahāyassa vatthumhi ayamānupubbīkathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Amhākaṃ ",
      " bhagavati parinibbute jambudīpe devadahanagare eko manusso dukkhito tattha tattha vicaranto paccante aññataraṃ gāmaṃ gantvā tattha ekasmiṃ kulagehe nivāsaṃ kappesi. Tattha manussā tassa yāgubhattaṃ datvā posesuṃ, tato so tattha manussehi mittasanthavaṃ katvā katipāhaṃ tattha vasitvā aññaṭṭhānaṃ gantvā aparabhāge corakammaṃ karonto jīvikaṃ kappeti. Athekadivasaṃ corentaṃ taṃ rājapurisā gahetvā rañño dassesuṃ. Rājā taṃ bandhanāgāre karothāti āṇāpesi, te taṃ bandhanāgāraṃ netvā saṅkhalikāhi bandhitvā ārakkhakānaṃ paṭipādetvā agamaṃsu, bandhanāgāre vasantassa tassa dvādasasaṃvaccharāni atikkantāni. Tato aparabhāge tassa pubbasahāyo paccantagāmavāsī manusso kenaci kammena devadaha māgato tattha tattha āhiṇḍanto bandhanāgāre baddhaṃ taṃ addasa. Disvā tassa hadayaṃ kampi, so roditvā paridevitvā kiṃ te mayā kattabbaṃ sammāti pucchi. Tato tena samma bandhanāgāre vasantassa me idāni dvādasasaṃvaccharāni atikkantāni, ettakaṃ kālaṃ dubbhojanādinā mahādukkhaṃ anubhomi. Yāvāhaṃ āhāraṃ pariyesitvā bhuñjitvā āgamissāmi. Tāva maṃ ito muñcanupāyaṃ jānāhīti vutte so sappuriso."
    ],
    "innerText": "Amhākaṃ bhagavati parinibbute jambudīpe devadahanagare eko manusso dukkhito tattha tattha vicaranto paccante aññataraṃ gāmaṃ gantvā tattha ekasmiṃ kulagehe nivāsaṃ kappesi. Tattha manussā tassa yāgubhattaṃ datvā posesuṃ, tato so tattha manussehi mittasanthavaṃ katvā katipāhaṃ tattha vasitvā aññaṭṭhānaṃ gantvā aparabhāge corakammaṃ karonto jīvikaṃ kappeti. Athekadivasaṃ corentaṃ taṃ rājapurisā gahetvā rañño dassesuṃ. Rājā taṃ bandhanāgāre karothāti āṇāpesi, te taṃ bandhanāgāraṃ netvā saṅkhalikāhi bandhitvā ārakkhakānaṃ paṭipādetvā agamaṃsu, bandhanāgāre vasantassa tassa dvādasasaṃvaccharāni atikkantāni. Tato aparabhāge tassa pubbasahāyo paccantagāmavāsī manusso kenaci kammena devadaha māgato tattha tattha āhiṇḍanto bandhanāgāre baddhaṃ taṃ addasa. Disvā tassa hadayaṃ kampi, so roditvā paridevitvā kiṃ te mayā kattabbaṃ sammāti pucchi. Tato tena samma bandhanāgāre vasantassa me idāni dvādasasaṃvaccharāni atikkantāni, ettakaṃ kālaṃ dubbhojanādinā mahādukkhaṃ anubhomi. Yāvāhaṃ āhāraṃ pariyesitvā bhuñjitvā āgamissāmi. Tāva maṃ ito muñcanupāyaṃ jānāhīti vutte so sappuriso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      "."
    ],
    "innerText": "1."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Rūpena kintu guṇasīlavivajjitena,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Micchālayassa kitavassa dhiyā kimatthaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Dānā dicāgavigatena dhanena kiṃ vā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mittena kiṃ byasanakālaparammukhenāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evañca pana vatvā sādhu samma karomi te vacananti ārakkhakānaṃ santikaṃ gantvā bhonto yāveso bhattaṃ bhuñjitvā āgacchati. Tāvāhaṃ tassa pāṭibhogo bhavissāmi. Vissajjetha ",
      " nanti āha, tehi na sakkā bho etaṃ vissajjetuṃ, api ca kho yāvāyaṃ āgacchati. Tāva tvaṃ ayasaṅkhalikāya baddho nisīdissasi, evaṃ taṃ vissajjessāma, no ce na sakkāti āhaṃsu, so evampi hotu sammāti vatvā tassa pādato saṅkhalikaṃ muñcitvā attano pāde katvā bandhanāgāraṃ pavisitvā itaraṃ muñcāpesi. Sopi asappuriso bandhanā mutto na puna taṃ ṭhāna magamāsi, aho akataññuno pakatiṃ ñātuṃ bhāriyaṃ. Yathāha."
    ],
    "innerText": "Evañca pana vatvā sādhu samma karomi te vacananti ārakkhakānaṃ santikaṃ gantvā bhonto yāveso bhattaṃ bhuñjitvā āgacchati. Tāvāhaṃ tassa pāṭibhogo bhavissāmi. Vissajjetha nanti āha, tehi na sakkā bho etaṃ vissajjetuṃ, api ca kho yāvāyaṃ āgacchati. Tāva tvaṃ ayasaṅkhalikāya baddho nisīdissasi, evaṃ taṃ vissajjessāma, no ce na sakkāti āhaṃsu, so evampi hotu sammāti vatvā tassa pādato saṅkhalikaṃ muñcitvā attano pāde katvā bandhanāgāraṃ pavisitvā itaraṃ muñcāpesi. Sopi asappuriso bandhanā mutto na puna taṃ ṭhāna magamāsi, aho akataññuno pakatiṃ ñātuṃ bhāriyaṃ. Yathāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      "."
    ],
    "innerText": "2."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vāripūre yathā sobbhe, nevanto visamaṃ samaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paññāyatevaṃsādhussa, bhāvaṃ manasi sambhavaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      "."
    ],
    "innerText": "3."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Bhāsanti mukhato ekaṃ, cintenti manasā paraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kāyenekaṃ karontevaṃ, pakatāyamasādhunaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      "."
    ],
    "innerText": "4."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tesaṃ yo bhāvamaññāsi, sova paṇḍitajātiko;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bahussutopi soyeva, paracittavidūpi so."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassa bandhanāgāre vasantassa dvādasasaṃvaccharāni atikkantāni. Ettakaṃ kālaṃ jighacchāpīḷitena tena āhārattāya paro na yācitapubbo, anucchiṭṭhāhāraṃ labhanadivasato alabhanadivasāyeva bahutarā honti, atha dvādasasaṃvaccharātikkame rañño putto nibbatti. Tadā rājā attano vijite sabbabandhanāgārāni vivarāpesi. Antamaso migapakkhinopi bandhanā muñcāpesi. Dvāre vivaṭamatteyeva bandhanāgāre manussā icchiticchitaṭṭhānaṃ agamaṃsu. So panekova tehi saddhiṃ agantvā ohīyi. Ārakkhakehi tvaṃ bho kasmā na gacchasīti vutte ahaṃ bho paññātabhāvena idāni na gamissāmi. Atīva parihīnagattosmi. Andhakāre gamissāmīti vatvā andhakāre āgate nikkhamma antonagare vissāsikānaṃ abhāvena kuto āhāraṃ labhissāmīti cintento nikkhamma rattandhakāre āmakasusāna ",
      " magamāsi. Etthāhāraṃ labhissāmīti. Tattha so adhunā nikkhittamatamanussaṃ disvā manussaṭṭhinā maṃsaṃ chinditvā sīsakapāle pakkhipitvā tīhi manussasīsehi katauddhane ṭhapetvā citakato omukkaalātehi aggiṃ katvā susānaṃ nibbāpanatthāyā bhataudakena manussaṭṭhinā ālolento maṃsaṃ pacitvā otāretvā sākhābhaṅgena hirikopīṇaṃ paṭicchādetvā nivatthapilokikaṃ vātāvaraṇaṃ katvānisīdi. Tasmiṃ khaṇe tattha pippalīrukkhe adhivatthā devatā tassa taṃ kiriyaṃ disvā pucchissāmi tāva nanti taṃ upasaṅkamitvā evamāha. Bho tvaṃ ghanataratimirākule mahārattiyaṃ tattha tattha vikiṇṇanaraṭṭhisamākiṇṇe soṇasigālādikuṇapādakākule manussamaṃsabhakkhayakkharakkhasākule tattha tattha pajjalantānekacitakabhayānake susāne manussamaṃsaṃ pacitvā kiṃkarosīti pucchantī āha."
    ],
    "innerText": "Athassa bandhanāgāre vasantassa dvādasasaṃvaccharāni atikkantāni. Ettakaṃ kālaṃ jighacchāpīḷitena tena āhārattāya paro na yācitapubbo, anucchiṭṭhāhāraṃ labhanadivasato alabhanadivasāyeva bahutarā honti, atha dvādasasaṃvaccharātikkame rañño putto nibbatti. Tadā rājā attano vijite sabbabandhanāgārāni vivarāpesi. Antamaso migapakkhinopi bandhanā muñcāpesi. Dvāre vivaṭamatteyeva bandhanāgāre manussā icchiticchitaṭṭhānaṃ agamaṃsu. So panekova tehi saddhiṃ agantvā ohīyi. Ārakkhakehi tvaṃ bho kasmā na gacchasīti vutte ahaṃ bho paññātabhāvena idāni na gamissāmi. Atīva parihīnagattosmi. Andhakāre gamissāmīti vatvā andhakāre āgate nikkhamma antonagare vissāsikānaṃ abhāvena kuto āhāraṃ labhissāmīti cintento nikkhamma rattandhakāre āmakasusāna magamāsi. Etthāhāraṃ labhissāmīti. Tattha so adhunā nikkhittamatamanussaṃ disvā manussaṭṭhinā maṃsaṃ chinditvā sīsakapāle pakkhipitvā tīhi manussasīsehi katauddhane ṭhapetvā citakato omukkaalātehi aggiṃ katvā susānaṃ nibbāpanatthāyā bhataudakena manussaṭṭhinā ālolento maṃsaṃ pacitvā otāretvā sākhābhaṅgena hirikopīṇaṃ paṭicchādetvā nivatthapilokikaṃ vātāvaraṇaṃ katvānisīdi. Tasmiṃ khaṇe tattha pippalīrukkhe adhivatthā devatā tassa taṃ kiriyaṃ disvā pucchissāmi tāva nanti taṃ upasaṅkamitvā evamāha. Bho tvaṃ ghanataratimirākule mahārattiyaṃ tattha tattha vikiṇṇanaraṭṭhisamākiṇṇe soṇasigālādikuṇapādakākule manussamaṃsabhakkhayakkharakkhasākule tattha tattha pajjalantānekacitakabhayānake susāne manussamaṃsaṃ pacitvā kiṃkarosīti pucchantī āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      "."
    ],
    "innerText": "5."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Rattandhakāre kuṇapādakehi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Samākule sīvathikāya majjhe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Manussamaṃsaṃ pacasī dha sīse,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vadehi kiṃ tena payojanaṃ teti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Atha so āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      "."
    ],
    "innerText": "6."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Na yāgahetu na ca dānahetu,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Susānamajjhamhi pacāmi maṃsaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Khudāsamaṃ natthi narassa aññaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khudāvināsāya pacāmimambhoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato devatā taṃ tathā hotu, iminā pilotikena vātāvaraṇaṃ karosi. Kimatthametanti pucchantī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      "."
    ],
    "innerText": "7."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Nivatthasākho ",
      " hirisaṃvarāya,"
    ],
    "innerText": "Nivatthasākho hirisaṃvarāya,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Pilotikaṃ tattha pasārayanto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Karosi vātāvaraṇañca samma,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kimatthametaṃ vada pucchito meti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "So tassā cikkhanto āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      "."
    ],
    "innerText": "8."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Subhā subhāmissitasītavāto,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sayaṃ acittova acittabhāvā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Dehaṃ phusitvāna asādhukassa,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Akataññuno mittapadhaṃsakassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      "."
    ],
    "innerText": "9."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Samāvahanto yadi me sarīre,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "children": [
      "Phusāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[phusātisāsaṅgatimajjadāni itikattaci]"
      },
      " taṃ vāyu mamā visitvā;"
    ],
    "innerText": "Phusāti [phusātisāsaṅgatimajjadāni itikattaci] taṃ vāyu mamā visitvā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Dukkhaṃ dadātīti visaṃva taṃ bho,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Parivajjituṃ baddhamimaṃ kucelanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Devatā āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      "."
    ],
    "innerText": "10."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ki makāsi bho so katanāsako te,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dhanañca dhaññaṃ tava nāsayī ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Mātā pitā bandhavo khetta vatthū,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vināsitā tena vadehi kiṃ teti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tato so āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      "."
    ],
    "innerText": "11."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yaṃ rājato hoti bhayaṃ mahantaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sabbassa haraṇādivadhādikañca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Akataññunā sappurisena hoti,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ārāva so bho parivajjanīyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      "."
    ],
    "innerText": "12."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Yamatthi ",
      " corāribhayañhi loke,"
    ],
    "innerText": "Yamatthi corāribhayañhi loke,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Atho dakenāpi ca pāvakena;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Akataññunā taṃ sakalampi hoti,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ārāva so bho parivajjanīyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      "."
    ],
    "innerText": "13."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pāṇātipātampi adinnadānaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Parassa dārūpagamaṃ musā ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Majjassa pānaṃ kalahañca pesunaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Samphaṃ giraṃ dhuttajanehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[akkhadhuttādiyogaṃ itikatthaci]"
      },
      " yogaṃ."
    ],
    "innerText": "Samphaṃ giraṃ dhuttajanehi [akkhadhuttādiyogaṃ itikatthaci] yogaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      "."
    ],
    "innerText": "14."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sabbaṃ anatthaṃ asivaṃ aniṭṭhaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "children": [
      "Apāyikaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[apāyikaṃ itikatthaci]"
      },
      " dukkhamananta maññaṃ;"
    ],
    "innerText": "Apāyikaṃ [apāyikaṃ itikatthaci] dukkhamananta maññaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Akataññunā sappurisena hoti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ārāva so bho parivajjanīyoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vatvā attanā asappurisasaṃsaggenānubhūtaṃ sabbaṃ dukkhaṃ kathesi, tato devatā ahampi bho satthuno maṅgalasuttadesanādivase imasmiṃyeva rukkhe nisinno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Asevanā ca bālānaṃ, paṇḍitānañca sevanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pūjā ca pūjanīyyānaṃ, etaṃ maṅgala muttamanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Gāthāya bālassa dose assosiṃti vatvā tassa pasanno taṃ attano vimānaṃ netvā nahāpetvā dibbavatthālaṅkārehi alaṅkaritvā dibbannapānaṃ datvā mahantaṃ sakkārasammānaṃ katvā attano ānubhāvena tasmiṃ nagare rajje abhisiñcāpesi. So tattha rajjaṃ karonto dānādīni puññāni katvā āyupariyosāne yathākammaṃ gatoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      "."
    ],
    "innerText": "15."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Evaṃ ",
      " asādhujanasaṅgamasannivāsaṃ,"
    ],
    "innerText": "Evaṃ asādhujanasaṅgamasannivāsaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sañcajja sādhusucisajjanasaṅgamena;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Dānādi nekakusalaṃ paripūrayantā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saggā pavaggavibhavaṃ abhisambhunāthāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Corasahāyassa vatthuṃ sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "18. Maruttabrāhmaṇassa vatthumhi ayamānupubbīkathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Jambudīpe candabhāgā nāma gaṅgātīre homagāmaṃ nāma atthi. Tasmiṃ eko marutto nāma brāhmaṇo paṭivasati. Tadā so vohāratthāya takkasīlaṃ gantvā gehaṃ āgacchanto antarāmagge ekāya sālāya kuṭṭharogā turaṃ sunakhaṃ disvā tasmiṃ kāruññena nīlavallitakkambilena madditvā pāyesi. Sunakho vūpasantarogo pākatiko hutvā brāhmaṇena attano katūpakāraṃ sallakkhento teneva saddhiṃ agamāsi. Aparabhāge brāhmaṇassa bhariyā gabbhaṃ paṭilabhi, paripuṇṇagabbhāya tāya vijāyanakāle dārako tiriyampatitvā antogabbheyeva mato. Tadā taṃ satthena khaṇḍākhaṇḍikaṃ chinditvā nīhariṃsu, atha brāhmaṇo taṃ disvā nibbindahadayo gharāvāsaṃ pahāya isipabbajjaṃ pabbajitvā araññe viharati. Athassa bhariyā aññena saddhiṃ saṃvasantī ayaṃ maṃ pahāya pabbajitoti brāhmaṇe paduṭṭhacittā bho brāhmaṇaṃ mārehīti sāmikena saddhiṃ mantesi. Tesaṃ mantanaṃ sunakho sutvā brāhmaṇeneva saddhiṃ carati. Athekadivasaṃ tassā sāmiko tā pa saṃ māressāmīti dhanu kalāpaṃ gahetvā nikkhami, tadā tāpaso phalāphalatthāya araññaṃ gato. Su na kho assameyeva o hī yi. Puriso tāpasassāgamanamaggaṃ olokento gacchantare ",
      " nilīno acchi. Sunakho tassa pamādaṃ oloketvā dhanuno guṇaṃ khāditvā chindi. So puna guṇaṃ pākatikaṃ katvā āropesi. Evaṃ so āropitaṃ āropitaṃ khādateva, atha so pāpapuriso tāpasassāgamanaṃ ñatvā taṃ māressāmīti dhanunā saddhiṃ agamāsi. Athassa sunakho pāde ḍasitvā pātetvā tassa mukhaṃ khāditvā dubbalaṃ katvā bhuṅkāramakāsi, evañhi sappurisā attano upakārakānaṃ paccupakāraṃ karonti. Vuttañhi."
    ],
    "innerText": "Jambudīpe candabhāgā nāma gaṅgātīre homagāmaṃ nāma atthi. Tasmiṃ eko marutto nāma brāhmaṇo paṭivasati. Tadā so vohāratthāya takkasīlaṃ gantvā gehaṃ āgacchanto antarāmagge ekāya sālāya kuṭṭharogā turaṃ sunakhaṃ disvā tasmiṃ kāruññena nīlavallitakkambilena madditvā pāyesi. Sunakho vūpasantarogo pākatiko hutvā brāhmaṇena attano katūpakāraṃ sallakkhento teneva saddhiṃ agamāsi. Aparabhāge brāhmaṇassa bhariyā gabbhaṃ paṭilabhi, paripuṇṇagabbhāya tāya vijāyanakāle dārako tiriyampatitvā antogabbheyeva mato. Tadā taṃ satthena khaṇḍākhaṇḍikaṃ chinditvā nīhariṃsu, atha brāhmaṇo taṃ disvā nibbindahadayo gharāvāsaṃ pahāya isipabbajjaṃ pabbajitvā araññe viharati. Athassa bhariyā aññena saddhiṃ saṃvasantī ayaṃ maṃ pahāya pabbajitoti brāhmaṇe paduṭṭhacittā bho brāhmaṇaṃ mārehīti sāmikena saddhiṃ mantesi. Tesaṃ mantanaṃ sunakho sutvā brāhmaṇeneva saddhiṃ carati. Athekadivasaṃ tassā sāmiko tā pa saṃ māressāmīti dhanu kalāpaṃ gahetvā nikkhami, tadā tāpaso phalāphalatthāya araññaṃ gato. Su na kho assameyeva o hī yi. Puriso tāpasassāgamanamaggaṃ olokento gacchantare nilīno acchi. Sunakho tassa pamādaṃ oloketvā dhanuno guṇaṃ khāditvā chindi. So puna guṇaṃ pākatikaṃ katvā āropesi. Evaṃ so āropitaṃ āropitaṃ khādateva, atha so pāpapuriso tāpasassāgamanaṃ ñatvā taṃ māressāmīti dhanunā saddhiṃ agamāsi. Athassa sunakho pāde ḍasitvā pātetvā tassa mukhaṃ khāditvā dubbalaṃ katvā bhuṅkāramakāsi, evañhi sappurisā attano upakārakānaṃ paccupakāraṃ karonti. Vuttañhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      "."
    ],
    "innerText": "1."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Upakāraṃ karonto so, sunakho katavediko;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sattūpaghātakaṃ katvā, isino dāsi jīvitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      "."
    ],
    "innerText": "2."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tiracchānāpi jānanti, guṇamattani kataṃ sadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Iti utvāna medhāvī, kataññū hontu pāṇinoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato tāpaso sunakhassa saddenā gantvā tassa taṃ vippakāraṃ disvā kāruññena paṭijiggitvā vūpasantavaṇaṃ balappattaṃ posetvā tattheva vasanto jhānābhiññaṃ nibbattetvā āyupariyosāne brāhmalokaparāyaṇo ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      "."
    ],
    "innerText": "3."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sutvāna sādhu sunakhena katūpakāraṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Mettiṃdisassa pakataṃ isinā ca sutvā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Sammā karotha karuṇañca parūpakāraṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Taṃ sabbadā bhavati vo bhavabhogahetūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Maruttabrāhmaṇassa vatthuṃ aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "19. Pānīyadinnassa vatthumhi ayamānupubbīkathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Jambudīpe ",
      " aññatarasmiṃ janapade kire ko manusso raṭṭhato raṭṭhaṃ janapadato janapadaṃ vicaranto anukkamena candabhāgānadītīraṃ patvā nāvaṃ abhiruhitvā paratīraṃ gacchati. Athāparā gabbhinitthī tāya eva nāvāya gacchati, atha nāvā gaṅgāmajjhappattakāle tassā kammajavātā caliṃsu. Tato sā vijāyitumasakkontī kilantā pānīyaṃ me detha, pipāsitāmhiti manusse yāci. Te tassā vacanaṃ asuṇantā viya pānīyaṃ nādaṃsu, atha so jānapadiko tassā karuṇāyanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[karuṇāyapānīyaṃ, karuṇāyantopānīyaṃ, karuṇāyatoyaṃ iticakatthaci]"
      },
      " toyaṃ gahetvā mukhe āsiñci, tasmiṃ khaṇe sā laddhassāsā sukhena dārakaṃ vijāyi, atha te tīraṃ patvā katipayadivasena attano attano ṭhānaṃ pāpuṇiṃsu. Athāparabhāge so jānapadiko aññatarakiccaṃ paṭicca tassā itthiyā vasananagaraṃ patvā tattha tattha āhiṇḍanto nivāsanaṭṭhānaṃ alabhitvā nagaradvāre sālaṃ gantvā tattha nipajji. Tasmiṃyeva divase corā nagaraṃ pavisitvā rājagehe sandhiṃ chinditvā dhanasāraṃ gahetvā gacchantā rājapurisehi anubandhā gantvā tāyeva sālāya chaḍḍetvā palāyiṃsu. Atha rājapurisā āgantvā core apassantā taṃ jānapadikaṃ disvā ayaṃ coroti gahetvā pacchābāhaṃ gāḷhaṃ bandhitvā puna divase rañño dassesuṃ. Raññā kasmā bhaṇe corakamma makāsīti pucchito nāhaṃ deva coro, āgantukomhīti vutte rājā core pariyesitvā alabhanto ayameva coro, imaṃ mārethāti āṇāpesi. Rājapurisehi taṃ gāḷhaṃ bandhitvā āghātanaṃ nīte sā itthī taṃ tathā nīyamānaṃ disvā sañjānitvā kampamānahadayā muhuttena rañño santikaṃ gantvā vanditvā deva eso ",
      " na coro āgantuko muñcathetaṃ devāti āha. Rājā tassā kathaṃ asaddahanto yajjetaṃ mocetu micchasi. Tassagghanakaṃ dhanaṃ datvā muñcāpehīti, sā sāmi mama gehe dhanaṃ natthi. Apica mama sattaputtehi saddhiṃ maṃ dāsiṃ karohi, etaṃ muñca devāti āha, atha rājā tvaṃ etaṃ adhunāgatoti vadasi. Etaṃ nissāya puttehi saddhiṃ attānaṃ dāsattaṃ sāvesi. Kimeso te ñāti vā, udāhu upakārakoti pucchanto āha."
    ],
    "innerText": "Jambudīpe aññatarasmiṃ janapade kire ko manusso raṭṭhato raṭṭhaṃ janapadato janapadaṃ vicaranto anukkamena candabhāgānadītīraṃ patvā nāvaṃ abhiruhitvā paratīraṃ gacchati. Athāparā gabbhinitthī tāya eva nāvāya gacchati, atha nāvā gaṅgāmajjhappattakāle tassā kammajavātā caliṃsu. Tato sā vijāyitumasakkontī kilantā pānīyaṃ me detha, pipāsitāmhiti manusse yāci. Te tassā vacanaṃ asuṇantā viya pānīyaṃ nādaṃsu, atha so jānapadiko tassā karuṇāyanto [karuṇāyapānīyaṃ, karuṇāyantopānīyaṃ, karuṇāyatoyaṃ iticakatthaci] toyaṃ gahetvā mukhe āsiñci, tasmiṃ khaṇe sā laddhassāsā sukhena dārakaṃ vijāyi, atha te tīraṃ patvā katipayadivasena attano attano ṭhānaṃ pāpuṇiṃsu. Athāparabhāge so jānapadiko aññatarakiccaṃ paṭicca tassā itthiyā vasananagaraṃ patvā tattha tattha āhiṇḍanto nivāsanaṭṭhānaṃ alabhitvā nagaradvāre sālaṃ gantvā tattha nipajji. Tasmiṃyeva divase corā nagaraṃ pavisitvā rājagehe sandhiṃ chinditvā dhanasāraṃ gahetvā gacchantā rājapurisehi anubandhā gantvā tāyeva sālāya chaḍḍetvā palāyiṃsu. Atha rājapurisā āgantvā core apassantā taṃ jānapadikaṃ disvā ayaṃ coroti gahetvā pacchābāhaṃ gāḷhaṃ bandhitvā puna divase rañño dassesuṃ. Raññā kasmā bhaṇe corakamma makāsīti pucchito nāhaṃ deva coro, āgantukomhīti vutte rājā core pariyesitvā alabhanto ayameva coro, imaṃ mārethāti āṇāpesi. Rājapurisehi taṃ gāḷhaṃ bandhitvā āghātanaṃ nīte sā itthī taṃ tathā nīyamānaṃ disvā sañjānitvā kampamānahadayā muhuttena rañño santikaṃ gantvā vanditvā deva eso na coro āgantuko muñcathetaṃ devāti āha. Rājā tassā kathaṃ asaddahanto yajjetaṃ mocetu micchasi. Tassagghanakaṃ dhanaṃ datvā muñcāpehīti, sā sāmi mama gehe dhanaṃ natthi. Apica mama sattaputtehi saddhiṃ maṃ dāsiṃ karohi, etaṃ muñca devāti āha, atha rājā tvaṃ etaṃ adhunāgatoti vadasi. Etaṃ nissāya puttehi saddhiṃ attānaṃ dāsattaṃ sāvesi. Kimeso te ñāti vā, udāhu upakārakoti pucchanto āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      "."
    ],
    "innerText": "1."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kiṃte bhoti ayaṃ poso, tuvaṃ pucchāmi saṃsayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhātā vā te pitā hoti, pati vā devaro tava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      "."
    ],
    "innerText": "2."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ñāti sālohito kinnu, udāhu iṇadāyako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Athopakārako kinnu, kasmāssa desi jīvitaṃti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tato sā āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      "."
    ],
    "innerText": "3."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Eso me puriso deva, katapubbopakārako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Atāṇamekikaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[attānamekikaṃ itikatthaci]"
      },
      " ceso, dukkhitaṃ maraṇe ṭhitaṃ."
    ],
    "innerText": "Atāṇamekikaṃ [attānamekikaṃ itikatthaci] ceso, dukkhitaṃ maraṇe ṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      "."
    ],
    "innerText": "4."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vijāyitu masakkontiṃ, gabbhiniṃ dukkhavediniṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Toyena maṃ upaṭṭhāsi, tenāhaṃ sukhitā tadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      "."
    ],
    "innerText": "5."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Bhaṅgakallolamālāya, uttarantaṃ mahaṇṇavaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pahāya pātuṃ kūpassa, yāti loko pipāsito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      "."
    ],
    "innerText": "6."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tatheva vijjamānesu, janesu manujādhipa,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ekasseva manasmiṃhi, guṇaṃ tiṭṭhati sādhukaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      "."
    ],
    "innerText": "7."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pahatvāna mataṃ hatthiṃ, maṃsatthī keci jantuno;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anubandhanti maṃsatthaṃ, sasaṃ dhāvanta mekakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      "."
    ],
    "innerText": "8."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Tatheva ",
      " vijjamānesu, janesu manujādhipa;"
    ],
    "innerText": "Tatheva vijjamānesu, janesu manujādhipa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Guṇavanta manubandhanti, sappurisaṃ katavedikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      "."
    ],
    "innerText": "9."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tasmā sappurise dhamme, patiṭṭhāsmi narādhipa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anussaranti etena, katapubbū pakārakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      "."
    ],
    "innerText": "10."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ahañca mama puttā ca, etenamha sukhāpitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Jīvitampi pariccajja, muccanīyo ayaṃ mayāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato rājā dovārikaṃ pakkositvā tampi pucchitvā adhunāgatabhāvaṃ ñatvā tassā sappurisadhamme santuṭṭho tesaṃ ubhinnampi mahantaṃ yasaṃ anuppadāsi. Te laddhayasā ta to paṭṭhāya dānādīni puññakammāni katvā saggaparāyaṇā ahesunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      "."
    ],
    "innerText": "11."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dhamme patiṭṭhitamanā api mātugāmā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Evaṃ labhanti vibhavañca pasaṃsanañca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Dhammañca sādhucaritaṃ manasīkaronto,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammesu vattatha sadā sucisajjanāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pānīyadinnassa vatthuṃ navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "20. Sahāyassa pariccattajīvitakassa vatthumhi ayamānupubbīkathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhagavati parinibbute sāvatthiyaṃ somabrāhmaṇo somadattabrāhmaṇoti dve brāhmaṇā vasanti. Tattha somadattabrāhmaṇena saddhiṃ somabrāhmaṇo yebhuyyena dūtaṃ kīḷati. Athekadivasaṃ somadatto somabrāhmaṇaṃ tena parājetvā tassa uttarāsaṅgañca lañchanamuddikañca gahetvā attano gehaṃ gacchanto somabrāhmaṇassa ehi gehaṃ gacchā- māti ",
      " āha. Tato somo nāhaṃ samma ekasāṭako hutvā antaravīthiṃ otarituṃ sakkomi. Gamanato ettheva me ṭhānaṃ varataranti āha, somadattena evaṃ sati samma imaṃ uttarāsaṅgaṃ gaṇhāti tassa taṃ datvā idāni samma ehīti vuttopi nāgacchati. Puna tena bho kasmā nāgacchasīti puṭṭho samma mama hatthe muddikaṃ apassantā me puttadārādayo mayā saddhiṃ kalahaṃ karontīti āha, atha so evaṃ sante yadā te pahoti. Tadā mayhaṃ dehīti muddikampi datvā taṃ gahetvā gehaṃ agamāsi. Atha te ettakena sahāyā ahesuṃ. Aparabhāge somadattabrāhmaṇaṃ ayaṃ paradārakammaṃ akāsīti manussā gahetvā rañño dassesuṃ. Rājā tassa rūpasampattiṃ disvā rājāṇaṃ akatvā mā bho puna evamakāsīti ovaditvā vissajjesi. Rājā naṃ yāvatatiyavāraṃ ovadanto vissajjetvā catutthevāre gacchathetaṃ āghātanaṃ netvā mārethāti āṇāpesi. Evaṃ pāpakamme niratā anekākārena ovadantāpi na sakkā nivāretuṃ. Tathāhi."
    ],
    "innerText": "Bhagavati parinibbute sāvatthiyaṃ somabrāhmaṇo somadattabrāhmaṇoti dve brāhmaṇā vasanti. Tattha somadattabrāhmaṇena saddhiṃ somabrāhmaṇo yebhuyyena dūtaṃ kīḷati. Athekadivasaṃ somadatto somabrāhmaṇaṃ tena parājetvā tassa uttarāsaṅgañca lañchanamuddikañca gahetvā attano gehaṃ gacchanto somabrāhmaṇassa ehi gehaṃ gacchā- māti āha. Tato somo nāhaṃ samma ekasāṭako hutvā antaravīthiṃ otarituṃ sakkomi. Gamanato ettheva me ṭhānaṃ varataranti āha, somadattena evaṃ sati samma imaṃ uttarāsaṅgaṃ gaṇhāti tassa taṃ datvā idāni samma ehīti vuttopi nāgacchati. Puna tena bho kasmā nāgacchasīti puṭṭho samma mama hatthe muddikaṃ apassantā me puttadārādayo mayā saddhiṃ kalahaṃ karontīti āha, atha so evaṃ sante yadā te pahoti. Tadā mayhaṃ dehīti muddikampi datvā taṃ gahetvā gehaṃ agamāsi. Atha te ettakena sahāyā ahesuṃ. Aparabhāge somadattabrāhmaṇaṃ ayaṃ paradārakammaṃ akāsīti manussā gahetvā rañño dassesuṃ. Rājā tassa rūpasampattiṃ disvā rājāṇaṃ akatvā mā bho puna evamakāsīti ovaditvā vissajjesi. Rājā naṃ yāvatatiyavāraṃ ovadanto vissajjetvā catutthevāre gacchathetaṃ āghātanaṃ netvā mārethāti āṇāpesi. Evaṃ pāpakamme niratā anekākārena ovadantāpi na sakkā nivāretuṃ. Tathāhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      "."
    ],
    "innerText": "1."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Soṇā ceva sigālā ca, vāyasā nīlamakkhikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Iccete kuṇape sattā, na sakkā te nisedhituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      "."
    ],
    "innerText": "2."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tathā pāṇātipātesu, paradāre surāya ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Musāvādesu theyyesu, sattasattā na vāriyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato rājapurisā taṃ bandhitvā pakkamiṃsu. Tadā somabrāhmaṇo somadattaṃ tathā nīyamānaṃ disvā kampamānahadayo rājapurisānaṃ santikaṃ gantvā imaṃ bho muhuttaṃ mā māretha. Yāva rājānaṃ jānāpessāmīti vatvā rañño santikaṃ gantvā vanditvā ṭhito deva mama jīvitaṃ somadattassa brāhmaṇassa dassāmi. Etaṃ muñcatha. Yadi māretukāmā, maṃ mārethāti āha. Rājā tuṇhī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tuṭṭho itikatthaci]"
      },
      " ahosi, rājapurisā somadattaṃ muñcitvā ",
      " somabrāhmaṇaṃ āghātanaṃ netvā māresuṃ, aho kataññuno kataveditā."
    ],
    "innerText": "Tato rājapurisā taṃ bandhitvā pakkamiṃsu. Tadā somabrāhmaṇo somadattaṃ tathā nīyamānaṃ disvā kampamānahadayo rājapurisānaṃ santikaṃ gantvā imaṃ bho muhuttaṃ mā māretha. Yāva rājānaṃ jānāpessāmīti vatvā rañño santikaṃ gantvā vanditvā ṭhito deva mama jīvitaṃ somadattassa brāhmaṇassa dassāmi. Etaṃ muñcatha. Yadi māretukāmā, maṃ mārethāti āha. Rājā tuṇhī [tuṭṭho itikatthaci] ahosi, rājapurisā somadattaṃ muñcitvā somabrāhmaṇaṃ āghātanaṃ netvā māresuṃ, aho kataññuno kataveditā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Hoti cettha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      "."
    ],
    "innerText": "3."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kakūpakāra mattānaṃ, sarantā keci mānusā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Jīvitaṃ denti somova, somadattassa attanoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So tena jīvitadānena devaloke nibbattitvā mahante kanakavimāne devaccharāsahassaparivuto dibbasampattimanubhonto paṭivasati. Tadā somadattabrāhmaṇo eso maṃ maraṇappattaṃ mocesīti vatvā tassatthāya dānaṃ datvā pattiṃ adāsi. Tāvadevassa tato bahutaraṃ devissariyaṃ ahosi devānubhāvañca. Tato so somadevo attano devissariyaṃ olokento sahāyassa attano jīvitadānaṃ addasa. Disvā attabhāvaṃ vijahitvā māṇavakavaṇṇena somadattabrāhmaṇaṃ upasaṅkamitvā paṭisanthāraṃ katvā attānaṃ devaloke nibbattabhāvaṃ pakāsetvā taṃ gahetvā attano ānubhāvena devalokaṃ netvā yathākāmaṃ sampatti manubhavāti vatvā sattāhaṃ devassariyaṃ datvā sattame divase netvā tassa geheyeva patiṭṭhāpesi. Tattha hi dibbasampatti manubhūtassa manussasampatti paṭikkulā hoti. Tato so dibbasampattimanussaranto kiso dubbalo uppaṇḍuppaṇḍukajāto ahosi. Athekadivasaṃ devaputto taṃ olokento tathā dukkhappattaṃ disvā na sakkā manussena dibbasampattimanubhavitunti icchiticchitasampattidāyakaṃ ekaṃ cintāmaṇiṃ datvā tassa bhariyampi attano ānubhāvena rūpavanthaṃ yasavantaṃ vaṇṇavantaṃ atikkantamanussitthivaṇṇaṃ akāsi, aparabhāge te jayampatikā paccakkhato diṭṭhadibbasampattivibhavā dānaṃ datvā sīlaṃ rakkhitvā sahāyadevaputtassa santikeyeva nibbattiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      "."
    ],
    "innerText": "4."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Mandena ",
      " nanditamanā upakārakena,"
    ],
    "innerText": "Mandena nanditamanā upakārakena,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Pāṇampi denti sujanā iti cintayitvā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Mittaddu mā bhavatha bho upakārakassa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pāsaṃsiyā bhavatha sādhujanehi niccaṃti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sahāyassa pariccattajīvitakassa vatthuṃ dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nandiyarājavaggo dutiyo."
  }
]