[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "children": [
      "3. ",
      " Dhātuparamparākathā"
    ],
    "innerText": "3. Dhātuparamparākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dhātusu pana vibhajitvā dīyamānesu satthuno nalāṭadhātu kosinārakānaṃ mallānaṃ laddhakoṭṭhāseyeva ahosi. Mahākassapatthero te upasaṅkamitvā satthuno nalāṭadhātu tumhākaṃ koṭṭhāse ahosi, taṃ gahetuṃ āgato, bhagavā hi dharamāneyeva tambapaṇṇidīpassa anujāni, ‘tasmā taṃ amhākaṃ dethā’ti. Taṃ sutvā mallarājāno?’Evaṃ patigaṇhatha bhante dhātu’ti mahākassapattherassa adaṃsu. So attano saddhivihārikaṃ mahānandattheraṃ pakkosāpetvā nalāṭadhātuṃ therassa niyyādetvā’ imaṃ dhātuṃ tambapaṇṇi dīpe mahāvālukagaṅgāya dakkhiṇabhāge serunāma dahassa ante varāha nāma soṇḍimatthake kākavaṇṇatisso nāma rājā patiṭṭhāpessati, cetiyaṃ saṅghārāmaṃ kārāpessati, tvaṃ imaṃ dhātuṃ gahetvā vesāliyaṃ upanissāya mahāvanavihāre kuṭāgārasālāyaṃ satthuno vasitagandhakuṭiyaṃ ṭhapetvā dhātupūjaṃ katvā āyusaṅkhāre ossaṭṭhe parinibbāpayamāne attano saddhivihārikassa candaguttattherassa dhātuvaṃsaṃ kathetvā appamatto hohī’ti vatvā dhātuṃ therassa datvā anupādisesanibbānadhātuyā parinibbāyi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sāvako satthukappo so pabhīnnapaṭisambhido;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gahetvā mānayī dhātuṃ mahānando mahāvane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassa therassa saddhivihāriko candaguttatthero dhātuṃ gahetvā ākāsaṃ uggantvā sāvatthīyaṃ jetavanamahāvihāre dasabalena vasitagandhakuṭiyaṃ ṭhapetvā dhātupūjaṃ katvā ciraṃ vihāsi. Sopi āyusaṅkhāre ossaṭṭhe parinibbāpayamāne attano. Saddhivihārikaṃ bhaddasenattheraṃ pakkosāpetvā dhātuṃ therassa niyyādetvā dhātuvaṃsaṃ kathetvā anusāsitvā anupādisesāya nibbānadhātuyā parinibbāyi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Candagutto mahāpañño chaḷabhiñño visārado;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ramme jetavane dhātuṃ ṭhapetvā vandanaṃ akā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassa ",
      " sisso bhaddasenatthero dhātuṃ gahetvā ākāsena gantvā dhammacakkappavattane isipatane mahā vihāre satthuno vasitagandhakuṭiyaṃ ṭhapetvā gandhamālādīhi pūjetvā ciraṃ vihāsi. So parinibbāpayamāno attano saddhivihārikassa jayasenattherassa dhātuṃ niyyādetvā dhātuvaṃsaṃ kathetvā anupādisesāya nibbānadhātuyā parinibbāyi."
    ],
    "innerText": "Tassa sisso bhaddasenatthero dhātuṃ gahetvā ākāsena gantvā dhammacakkappavattane isipatane mahā vihāre satthuno vasitagandhakuṭiyaṃ ṭhapetvā gandhamālādīhi pūjetvā ciraṃ vihāsi. So parinibbāpayamāno attano saddhivihārikassa jayasenattherassa dhātuṃ niyyādetvā dhātuvaṃsaṃ kathetvā anupādisesāya nibbānadhātuyā parinibbāyi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Bhaddaseno mahāthero katakicco mahāisi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhātuṃ ṭhapetvā isipatane vanditvā nibbutiṃ gato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So pana jayasenatthero taṃ dhātuṃ gahetvā veluvanamahāvihāre satthuno vasitagandhakuṭiyaṃ ṭhapetvā gandhamālādīhi pūjetvā ciraṃ vasitvā parinibbāpayamāno attano saddhivihārikassa mahāsaṅgharakkhitattherassa dhātuṃ niyyādetvā dhātuvaṃsaṃ kathetvā anupādisesāya nibbānadhātuyā parinibbāyi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Gahetvāna dhātuvaraṃ jayaseno mahāmuni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nidhāya veluvane ramme akā pūjaṃ manoramaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So panāyasmā saṅgharakkhitatthero dhātuṃ gahetvā ākāsena āgantvā kosambiṃ upanissāya ghosita seṭṭhinā kārāpite ghositārāme bhagavato vasitagandhakuṭiyaṃ ṭhapetvā gandhamālādīhi pūjaṃ katvā ciraṃ vihāsi. So’pi parinibbāpayamāno attano saddhivihārikaṃ mahādevattheraṃ pakkosāpetvā dhātuvaṃsaṃ kathetvā appamatto hohī’ti vatvā anupādisesāya nibbānadhātuyā parinibbāyi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Saṅgharakkhitavhayo thero cando viya supākaṭo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ṭhapetvā ghositārāme akā pūjaṃ manoramaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassa therassa saddhivihāriko mahādevatthero dhātuṃ gahetvā devānampiyatissassa mahārañño bhātu mahānāgassa uparājassa mahāgāme setacchattaṃ ussāpitakāle hatthoṭṭha nāmajanapade kukkuṭapabbatantare mahāsālarukkhamūle ākāsato otaritvā nisīdi. Tasmiṃ samaye mahākāḷo nāma upāsako attano puttadārehi saddhiṃ mālāgandhavilepanaṃ dhajapatākādīni gāhāpetvā divasassa tikkhattuṃ mahantehi pūjāvidhānehi dhātuṃ pariharitvā ciraṃ vasi. Māsassa aṭṭha-uposathadivase ",
      " dhātuto chabbaṇṇaraṃsiyo uggacchiṃsu. Tasmiṃ samaye so padeso buddhassa dharamānakālo viya ahosi. Janapadavāsī manussāpi therassa santike sīlāni gaṇhanti, uposathavāsaṃ vasanti, dānaṃ denti, cetiyassa mahantaṃ pūjaṃ karontī. Tato aparabhāge uparājā mahāgāme viharanto bheriṃ carāpesi? Yo amhākaṃ dasabalassa dhātuṃ gahetvā idhāgato, tassa mahantaṃ sampattiṃ dassāmīti. Tasmiṃ kāle kuṭumbiko mahākāḷo uparājaṃ passissāmīti tassa anucchavikaṃ paṇṇākāraṃ gahetvā rājadvāre ṭhatvā sāsanaṃ pahiṇi. Uparājā taṃ pakkosāpesi. So gantvā vanditvā ṭhito taṃ paṇṇākāraṃ rājapurisānaṃ paṭicchāpesi. Uparājā? Mātula mahākāḷa, tumhākaṃ janapade amhākaṃ satthuno dhātu atthī’ti āha. Mahākāḷo upa rājassa kathaṃ sutvā atthi deva, mayhaṃ kulupagattherassa santike ādāsamaṇḍalappamāṇaṃ satthuno nalāṭadhātu chabbaṇṇaraṃsīhi ākāsappadese sūriyasahassacandasahassānaṃ uṭṭhitakālo viya obhāseti. So janapado buddhassa uppannakālo viya ahosīti āha. Tassa kuṭumbikassa kathaṃ suṇantassaeva rañño sakalasarīraṃ pañcavaṇṇāya pītiyā paripuṇṇaṃ ahosi. Ativiya somanassappatto rājā mayhaṃ mātulassa mahākāḷassa satasahassaṃ kahāpaṇāni ca catusindhavayuttarathañca suvaṇṇālaṅkārehi susajjitaṃ ekaṃ assañca udakaphāsukaṭṭhānake khettañca pañcadāsīsatañca dethā’ti vatvā aññañca pasādaṃ dāpesi. So uparājā ettakaṃ kuṭumbikassa dāpetvā taṃ divasameva nagare bheriṃ carāpetvā hatthassarathayānāni gahetvā kuṭumbikaṃ maggadesakaṃ katvā anupubbena hatthoṭṭhajanapadaṃ patvā ramaṇīye bhūmippadese khandhāvāraṃ bandhitvā amaccagaṇaparivuto kuṭumbikaṃ gahetvā therassa vasanaṭṭhānaṃ gantvā vanditvā ekamantaṃ aṭṭhāsi. Sesā amaccā kuṭumbiko ca theraṃ vanditvā ekamantaṃ ",
      " aṭṭhaṃsu. Uparājā theraṃ vanditvā sārāṇīyaṃ kathaṃ katvā ekamantaṃ nisinno paṭisanthāramakāsi. Mahādevattheropi sammodanīyaṃ kathaṃ katvā kissa tvaṃ mahārāja idhāgatosi āgatakāraṇaṃ me ārocehī’ti āha. Bhante tumhākaṃ. Santike amhākaṃ bhagavato nalāṭadhātu atthī kira. Taṃ vandissāmi’ti āgatomhī’ti āha. Thero? Bhaddakaṃ mahā rāja tayā katanti vatvā dhātugharadvāraṃ vivaritvā mahārāja buddhassa nalāṭadhātu atidullabhā’ti āha. Rājā soḷasehi gandhodakehi nahāyitvā sabbālaṅkārapatimaṇḍito ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggayha namassamāno aṭṭhāsi. Buddhārammaṇāya pītiyā sakalasarīraṃ phuṭaṃ ahosi."
    ],
    "innerText": "Tassa therassa saddhivihāriko mahādevatthero dhātuṃ gahetvā devānampiyatissassa mahārañño bhātu mahānāgassa uparājassa mahāgāme setacchattaṃ ussāpitakāle hatthoṭṭha nāmajanapade kukkuṭapabbatantare mahāsālarukkhamūle ākāsato otaritvā nisīdi. Tasmiṃ samaye mahākāḷo nāma upāsako attano puttadārehi saddhiṃ mālāgandhavilepanaṃ dhajapatākādīni gāhāpetvā divasassa tikkhattuṃ mahantehi pūjāvidhānehi dhātuṃ pariharitvā ciraṃ vasi. Māsassa aṭṭha-uposathadivase dhātuto chabbaṇṇaraṃsiyo uggacchiṃsu. Tasmiṃ samaye so padeso buddhassa dharamānakālo viya ahosi. Janapadavāsī manussāpi therassa santike sīlāni gaṇhanti, uposathavāsaṃ vasanti, dānaṃ denti, cetiyassa mahantaṃ pūjaṃ karontī. Tato aparabhāge uparājā mahāgāme viharanto bheriṃ carāpesi? Yo amhākaṃ dasabalassa dhātuṃ gahetvā idhāgato, tassa mahantaṃ sampattiṃ dassāmīti. Tasmiṃ kāle kuṭumbiko mahākāḷo uparājaṃ passissāmīti tassa anucchavikaṃ paṇṇākāraṃ gahetvā rājadvāre ṭhatvā sāsanaṃ pahiṇi. Uparājā taṃ pakkosāpesi. So gantvā vanditvā ṭhito taṃ paṇṇākāraṃ rājapurisānaṃ paṭicchāpesi. Uparājā? Mātula mahākāḷa, tumhākaṃ janapade amhākaṃ satthuno dhātu atthī’ti āha. Mahākāḷo upa rājassa kathaṃ sutvā atthi deva, mayhaṃ kulupagattherassa santike ādāsamaṇḍalappamāṇaṃ satthuno nalāṭadhātu chabbaṇṇaraṃsīhi ākāsappadese sūriyasahassacandasahassānaṃ uṭṭhitakālo viya obhāseti. So janapado buddhassa uppannakālo viya ahosīti āha. Tassa kuṭumbikassa kathaṃ suṇantassaeva rañño sakalasarīraṃ pañcavaṇṇāya pītiyā paripuṇṇaṃ ahosi. Ativiya somanassappatto rājā mayhaṃ mātulassa mahākāḷassa satasahassaṃ kahāpaṇāni ca catusindhavayuttarathañca suvaṇṇālaṅkārehi susajjitaṃ ekaṃ assañca udakaphāsukaṭṭhānake khettañca pañcadāsīsatañca dethā’ti vatvā aññañca pasādaṃ dāpesi. So uparājā ettakaṃ kuṭumbikassa dāpetvā taṃ divasameva nagare bheriṃ carāpetvā hatthassarathayānāni gahetvā kuṭumbikaṃ maggadesakaṃ katvā anupubbena hatthoṭṭhajanapadaṃ patvā ramaṇīye bhūmippadese khandhāvāraṃ bandhitvā amaccagaṇaparivuto kuṭumbikaṃ gahetvā therassa vasanaṭṭhānaṃ gantvā vanditvā ekamantaṃ aṭṭhāsi. Sesā amaccā kuṭumbiko ca theraṃ vanditvā ekamantaṃ aṭṭhaṃsu. Uparājā theraṃ vanditvā sārāṇīyaṃ kathaṃ katvā ekamantaṃ nisinno paṭisanthāramakāsi. Mahādevattheropi sammodanīyaṃ kathaṃ katvā kissa tvaṃ mahārāja idhāgatosi āgatakāraṇaṃ me ārocehī’ti āha. Bhante tumhākaṃ. Santike amhākaṃ bhagavato nalāṭadhātu atthī kira. Taṃ vandissāmi’ti āgatomhī’ti āha. Thero? Bhaddakaṃ mahā rāja tayā katanti vatvā dhātugharadvāraṃ vivaritvā mahārāja buddhassa nalāṭadhātu atidullabhā’ti āha. Rājā soḷasehi gandhodakehi nahāyitvā sabbālaṅkārapatimaṇḍito ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggayha namassamāno aṭṭhāsi. Buddhārammaṇāya pītiyā sakalasarīraṃ phuṭaṃ ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "(Rājā pītivegena imā gāthā āha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Namāmi vīra pāde te cakkaṅkita tale subhe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vandite naradevehi amataṃ dehi vandite."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Lokanātha tuvaṃ eko saraṇaṃ sabbapāṇinaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Loke tayā samo natthi tārehi janataṃ bahuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mahaṇṇave mayaṃ bhante nimuggā dīghasambhave;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Appatissā appatiṭṭhā saṃsarāma ciraṃ tahiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Etarahi tumhe āpajja patiṭṭhaṃ adhigacchare;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tumhākaṃ vandanaṃ katvā uttiṇṇamha bhavaṇṇavā’ti.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmiṃ khaṇe dhātuto rasmiyo nikkhamiṃsu. Sakala laṅkādīpaṃ suvaṇṇarasadhārāhi sañchannaṃ viya ahosi. Mahantaṃ pītisomanassaṃ uppajji. Rājā mahantaṃ somanassaṃ patto hutvā haṭṭhatuṭṭho ahosi. So dhātugharato nikkhamitvā therena saddhiṃ alaṅkatamaṇḍape ekamantaṃ nisīdi. Ekamantaṃ nisinno (nisajjādose vajjetvā seyyathidaṃ? Atiduraccāsanta-uparivāta-unnatappadesa-atisammukha-atipacachā’ti. ",
      " Atidūre nisinno sace kathetukāmo uccāsaddena kathetabbaṃ hoti. Accāsanne nisinno saṅkaraṃ karoti. Uparivāte nisinno sarīragandho vāyati. Unnatappadese nisinno agāravaṃ karoti. Atisammukhe nisinno cakkhunā cakkhuṃ paharitvā daṭṭhabbaṃ hoti. Atipacchā nisinno gīvaṃ parivattetvā daṭṭhabbaṃ hoti. Iti nisajjādosaṃ vajjetvā nisinno). Evamāha. Bhante imaṃ dhātuṃ mayhaṃ detha. Mahantaṃ pūjāsakkaraṃ katvā pariharāmīti. Bhaddakaṃ mahārāja imāya dhātuyā sammāsambuddho dharamānoyeva vyākaraṇaṃ akāsi. Tumhākaṃ vaṃse jāto kākavaṇṇatisso nāma rājā imasmiṃ dīpe mahāvālukagaṅgāya dakkhiṇatīre seru nāma dahassa ante varāha nāma soṇḍiyā matthake patiṭṭhapetvā mahantaṃ thūpaṃ karissatī’ti vatvā satthā tattha samāpattiṃ samāpajjitvā pañcasatakhīṇāsavehi saddhiṃ tikkhattuṃ padakkhiṇaṃ katvā gato. Tasmā gaṇhatha mahārājā’ti vatvā dhātuṃ adāsi."
    ],
    "innerText": "Tasmiṃ khaṇe dhātuto rasmiyo nikkhamiṃsu. Sakala laṅkādīpaṃ suvaṇṇarasadhārāhi sañchannaṃ viya ahosi. Mahantaṃ pītisomanassaṃ uppajji. Rājā mahantaṃ somanassaṃ patto hutvā haṭṭhatuṭṭho ahosi. So dhātugharato nikkhamitvā therena saddhiṃ alaṅkatamaṇḍape ekamantaṃ nisīdi. Ekamantaṃ nisinno (nisajjādose vajjetvā seyyathidaṃ? Atiduraccāsanta-uparivāta-unnatappadesa-atisammukha-atipacachā’ti. Atidūre nisinno sace kathetukāmo uccāsaddena kathetabbaṃ hoti. Accāsanne nisinno saṅkaraṃ karoti. Uparivāte nisinno sarīragandho vāyati. Unnatappadese nisinno agāravaṃ karoti. Atisammukhe nisinno cakkhunā cakkhuṃ paharitvā daṭṭhabbaṃ hoti. Atipacchā nisinno gīvaṃ parivattetvā daṭṭhabbaṃ hoti. Iti nisajjādosaṃ vajjetvā nisinno). Evamāha. Bhante imaṃ dhātuṃ mayhaṃ detha. Mahantaṃ pūjāsakkaraṃ katvā pariharāmīti. Bhaddakaṃ mahārāja imāya dhātuyā sammāsambuddho dharamānoyeva vyākaraṇaṃ akāsi. Tumhākaṃ vaṃse jāto kākavaṇṇatisso nāma rājā imasmiṃ dīpe mahāvālukagaṅgāya dakkhiṇatīre seru nāma dahassa ante varāha nāma soṇḍiyā matthake patiṭṭhapetvā mahantaṃ thūpaṃ karissatī’ti vatvā satthā tattha samāpattiṃ samāpajjitvā pañcasatakhīṇāsavehi saddhiṃ tikkhattuṃ padakkhiṇaṃ katvā gato. Tasmā gaṇhatha mahārājā’ti vatvā dhātuṃ adāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rājā dhātuṃ gahetvā caturassapallaṅke dhātukaraṇḍakaṃ nidahitvā karaṇḍake dhātuṃ patiṭṭhāpetvā taṃ kumudapattasannihamaṅgalasindhavayuttarathe ṭhapetvā samantā ārakkhaṃ saṃvidahitvā (rājā dhātuṃ gahetvā) pañcaṅgaturiye paggaṇhāpayamāno pacchā āgacchatu’ti mahājanassa sāsanaṃ vatvā mahādevattherassa santikaṃ gantvā? Tumhe bhante, dhātuyā upaṭṭhānaṃ karonto āgacchathā’ti āha. Thero tassa kathaṃ sutvā;’mahārāja ayaṃ dhātu paramparā āgatā. Ahaṃ bhagavato dhammabhaṇḍāgārikaānandatthero viya imaṃ dhātuṃ pariharissāmī’ti vatvā attano paccayadāyakaṃ kuṭumbikaṃ āpucchitvā pattacīvaramādāya dhātuṃ upaṭṭhahiyamāno pacchato pacchato gacchati. Rājā dhātuṃ gahetvā anupubbena mahāgāmaṃ patto mahāsenaguttaṃ pakkosāpetvā nagaraṃ alaṅkarāpehī’ti āha. So nagare bheriṃ carāpetvā aṭṭhārasa vīthiyo sammajjantu, puṇṇaghaṭe ṭhapentu, dhajapatākādayo ussāpentu, toraṇāni ussāpentu, pañcavaṇṇāni pupphāni ",
      " okirantu, sakalanagaraṃ alaṅkarontu, gandhamālādayo gahetvā suddhuttarāsaṅgā hutvā sakalanāgarā paṭipathaṃ āgacchantuti āṇāpesi. Tato mahājano sabbaturiyāni ghosāpayamāno gandhamālādihattho paṭipathaṃ nikkhanto. Devamanussā bhikkhubhikkhuniyo upāsakopāsikā appamāṇā ahesuṃ. (Gandhamālādi puṇṇaghaṭasamussitadhajākiṇṇā) parisā velukkhepasahassāni pavattayiṃsu. Sugandhavātābhighātasamuddaghoso viya sakalanagaraṃ ekaninnādajātaṃ. So rājā nagare bandhanāgāre sabbasatte bandhanā muñcantu, dhammena samena anusāsantuti vatvā dhātuṃ gahetvā attano nagaraṃ pavesetvā attano rājanivesanaṃ āgantvā nāṭakīnaṃ saññamadāsi dhātuṃ vandantuti. Nāṭakī nānābharaṇehi patimaṇḍitā rājagehato nikkhamitvā dhātuṃ vanditvā attano attano hatthagatāni turiyabhaṇḍāni sādhukaṃ paggaṇhitvā mahantaṃ pūjamakaṃsu."
    ],
    "innerText": "Rājā dhātuṃ gahetvā caturassapallaṅke dhātukaraṇḍakaṃ nidahitvā karaṇḍake dhātuṃ patiṭṭhāpetvā taṃ kumudapattasannihamaṅgalasindhavayuttarathe ṭhapetvā samantā ārakkhaṃ saṃvidahitvā (rājā dhātuṃ gahetvā) pañcaṅgaturiye paggaṇhāpayamāno pacchā āgacchatu’ti mahājanassa sāsanaṃ vatvā mahādevattherassa santikaṃ gantvā? Tumhe bhante, dhātuyā upaṭṭhānaṃ karonto āgacchathā’ti āha. Thero tassa kathaṃ sutvā;’mahārāja ayaṃ dhātu paramparā āgatā. Ahaṃ bhagavato dhammabhaṇḍāgārikaānandatthero viya imaṃ dhātuṃ pariharissāmī’ti vatvā attano paccayadāyakaṃ kuṭumbikaṃ āpucchitvā pattacīvaramādāya dhātuṃ upaṭṭhahiyamāno pacchato pacchato gacchati. Rājā dhātuṃ gahetvā anupubbena mahāgāmaṃ patto mahāsenaguttaṃ pakkosāpetvā nagaraṃ alaṅkarāpehī’ti āha. So nagare bheriṃ carāpetvā aṭṭhārasa vīthiyo sammajjantu, puṇṇaghaṭe ṭhapentu, dhajapatākādayo ussāpentu, toraṇāni ussāpentu, pañcavaṇṇāni pupphāni okirantu, sakalanagaraṃ alaṅkarontu, gandhamālādayo gahetvā suddhuttarāsaṅgā hutvā sakalanāgarā paṭipathaṃ āgacchantuti āṇāpesi. Tato mahājano sabbaturiyāni ghosāpayamāno gandhamālādihattho paṭipathaṃ nikkhanto. Devamanussā bhikkhubhikkhuniyo upāsakopāsikā appamāṇā ahesuṃ. (Gandhamālādi puṇṇaghaṭasamussitadhajākiṇṇā) parisā velukkhepasahassāni pavattayiṃsu. Sugandhavātābhighātasamuddaghoso viya sakalanagaraṃ ekaninnādajātaṃ. So rājā nagare bandhanāgāre sabbasatte bandhanā muñcantu, dhammena samena anusāsantuti vatvā dhātuṃ gahetvā attano nagaraṃ pavesetvā attano rājanivesanaṃ āgantvā nāṭakīnaṃ saññamadāsi dhātuṃ vandantuti. Nāṭakī nānābharaṇehi patimaṇḍitā rājagehato nikkhamitvā dhātuṃ vanditvā attano attano hatthagatāni turiyabhaṇḍāni sādhukaṃ paggaṇhitvā mahantaṃ pūjamakaṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato vaḍḍhakiṃ pakkosāpetvā rājanivesanato nātidūre nāccāsante subhumitale dhātugharaṃ kārāpetvā mālākammalatākammādiṃ patiṭṭhāpetvā dhātughare vicittamaṇḍapaṃ kārāpetvāna sattaratanamayaṃ dhātukaraṇḍakaṃ kārāpetvā dhātukaraṇḍake dhātuṃ ṭhapetvā ratanapallaṅka matthake dhātuṃ ṭhapetvā upari vicittavitānaṃ bandhitvā sāṇiyā parikkhipāpetvā mahantena parivārena mahantaṃ dhātupūjaṃ akāsi. Mahājanā gandhamālaṃ gahetvā māsassa aṭṭhūposathadivase dhātuyā mahantaṃ pūjaṃ akaṃsu. Dhātuto raṃsiyo samuggacchanti. Mahājanā vimbhayajātā sādhukāraṃ karonti. Somanassabhūtā sakalanagaravāsino buddhārammaṇa pītiṃ gahetvā divase divase dhātuyā mahantaṃ pūjaṃ karontā vītināmenti. Pañcasīlāni rakkhanti, buddhamāmakā dhammamāmakā saṅghamāmakā hutvā saraṇāni gacchanti. Rājā mahājanassa ovadati. ‘‘Mettaṃ bhāvetha, karuṇaṃ muditaṃ upekkhaṃ bhāvetha, kule jeṭṭhāpacāyanakammaṃ karothā‘‘ti. Ovaditvā bhikkhusaṅghassapi cattāro paccaye gaṅgāya maho-ghappavattanakālo ",
      " viya mahādānaṃ pavattesi. Mātāpituṭṭhāne ṭhatvā bhikkhusaṅghaṃ saṅgaṇhi. Mahājanā tassa ovāde ṭhatvā dānādīni puññāni katvā yebhuyyena tasmiṃ kāle matā saggaṃ gatā."
    ],
    "innerText": "Tato vaḍḍhakiṃ pakkosāpetvā rājanivesanato nātidūre nāccāsante subhumitale dhātugharaṃ kārāpetvā mālākammalatākammādiṃ patiṭṭhāpetvā dhātughare vicittamaṇḍapaṃ kārāpetvāna sattaratanamayaṃ dhātukaraṇḍakaṃ kārāpetvā dhātukaraṇḍake dhātuṃ ṭhapetvā ratanapallaṅka matthake dhātuṃ ṭhapetvā upari vicittavitānaṃ bandhitvā sāṇiyā parikkhipāpetvā mahantena parivārena mahantaṃ dhātupūjaṃ akāsi. Mahājanā gandhamālaṃ gahetvā māsassa aṭṭhūposathadivase dhātuyā mahantaṃ pūjaṃ akaṃsu. Dhātuto raṃsiyo samuggacchanti. Mahājanā vimbhayajātā sādhukāraṃ karonti. Somanassabhūtā sakalanagaravāsino buddhārammaṇa pītiṃ gahetvā divase divase dhātuyā mahantaṃ pūjaṃ karontā vītināmenti. Pañcasīlāni rakkhanti, buddhamāmakā dhammamāmakā saṅghamāmakā hutvā saraṇāni gacchanti. Rājā mahājanassa ovadati. ‘‘Mettaṃ bhāvetha, karuṇaṃ muditaṃ upekkhaṃ bhāvetha, kule jeṭṭhāpacāyanakammaṃ karothā‘‘ti. Ovaditvā bhikkhusaṅghassapi cattāro paccaye gaṅgāya maho-ghappavattanakālo viya mahādānaṃ pavattesi. Mātāpituṭṭhāne ṭhatvā bhikkhusaṅghaṃ saṅgaṇhi. Mahājanā tassa ovāde ṭhatvā dānādīni puññāni katvā yebhuyyena tasmiṃ kāle matā saggaṃ gatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kalyāṇavaggamhi patiṭṭhitā janā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dānādi puññāni karitva sabbadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Cutā cutā sabbajanā sumānasā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gatā asesaṃ sugatiṃ subhe ratā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Rājā dhātuyā mahantaṃ pūjaṃ karonto mahagāme vihāsi. Tena patiṭṭhāpitavihārā kathetabbā? Kathaṃ? Lenavihāraṃ candagirivihāraṃ koṭipabbatavihāraṃ nagaraṅgaṇavihāraṃ selakā vihāraṃ talākāvihāranti evamādayo vihāre patiṭṭhāpetvā tipiṭakamahāariṭṭhattherassa dakkhiṇodakaṃ datvā mahāvihāre niyyādesi. Evaṃ so rājā yāvajīvaṃ dhātuṃ pariharitvā pacchime kāle maraṇamañce nipanno attano puttaṃ yaṭālatissa kumāraṃ pakkosāpetvā; tāta tissa, amhehi pariharita nalāṭadhātu pūjehī’ti dhātuvaṃsaṃ kathetvā puttaṃ anusāsitvā kālaṃ katvā saggapuraṃ gato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Rājā mahānāgavaro yasassi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Katvāpi rajjaṃ matimā susaddho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Mānetva saṅghaṃ catupaccayehi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Agā asoko varadevalokaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassa putto yaṭālatissakumāro pitu accayena pitarā vuttaniyāmeneva dhātuyā mahantaṃ pūjaṃ kāresi. So’pi divasassa tayo vāre dhātupaṭṭhānaṃ karonto rajjaṃ kāretvā ciraṃ vihāsi. Iminā’pi patiṭṭhāpitavihārā kathetabbā; dhammasālavihāraṃ mahādhammasālavihāraṃ selābhayavihāranti evamādayo ",
      " patiṭṭhāpetvā-tipiṭakamahāariṭṭhattherassa saddhivihāriko tipiṭakamahāabhayatthero uparājassa mahānāgassa ayyako. Tassa therassa dakkhiṇodakaṃ adāsi. So’pi rājā yāvajīvaṃ dhātuṃ pariharitvā pacchime kāle maraṇamañce nipanno attano puttaṃ goṭhābhayakumāraṃ pakkosāpetvā’dhātuyā mahantaṃ pūjaṃ karonto appamatto hohī’ti vatvā dhātuvaṃsaṃ kathetvā kālaṃ katvā sagge nibbatti."
    ],
    "innerText": "Tassa putto yaṭālatissakumāro pitu accayena pitarā vuttaniyāmeneva dhātuyā mahantaṃ pūjaṃ kāresi. So’pi divasassa tayo vāre dhātupaṭṭhānaṃ karonto rajjaṃ kāretvā ciraṃ vihāsi. Iminā’pi patiṭṭhāpitavihārā kathetabbā; dhammasālavihāraṃ mahādhammasālavihāraṃ selābhayavihāranti evamādayo patiṭṭhāpetvā-tipiṭakamahāariṭṭhattherassa saddhivihāriko tipiṭakamahāabhayatthero uparājassa mahānāgassa ayyako. Tassa therassa dakkhiṇodakaṃ adāsi. So’pi rājā yāvajīvaṃ dhātuṃ pariharitvā pacchime kāle maraṇamañce nipanno attano puttaṃ goṭhābhayakumāraṃ pakkosāpetvā’dhātuyā mahantaṃ pūjaṃ karonto appamatto hohī’ti vatvā dhātuvaṃsaṃ kathetvā kālaṃ katvā sagge nibbatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yaṭṭhālako nāma mahāmahīpati,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Mahājanassatthakaro guṇālayo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "So dhātupūjaṃ vipulaṃ anekadhā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Katvā gato devapuraṃ anindito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassa putto goṭhābhayakumāro pitu accayena pitarā vuttaniyāmeneva dhātuyā mahantaṃ pūjaṃ katvā goṭhābhaya mahārājā hutvā rajjaṃ karonto kācaragāme dasabhātike rājāno ghātetvā daṇḍakammatthāya goṭhābhayamahātherassa hatthoṭṭhajanapade vasantassa mattikalenavihāraṃ khīrasāla vihāraṃ nāgamahāvihāraṃ kumbhaselavihāraṃ cetiyapabbatavihāraṃ sānupabbatavihāraṃ kaṇikāra selavihāraṃ ambasela vihāraṃ tindukalena vihāraṃ karaṇḍakavihāraṃ godhasālavihāraṃ vālukatitthavihāranti evamādayo gaṅgāya paratīre pañcasatavihāre orimatīre pañcasatavihāre cā’ti vihārasahassaṃ kāretvā attano sadisanāmassa goṭhābhayattherassa dakkhiṇodakaṃ datvā adāsi. So yāvajīvaṃ dhātupūjaṃ katvā pacchime kāle maraṇamañce nipanno attano puttaṃ kākavaṇṇatissa kumāraṃ pakkosāpetvā āliṅgitvā;’tāta tissa, ayaṃ nalāṭadhātu amhākaṃ paramparāya āgatā. Tvaṃ kira dhātuṃ gahetvā mahāgaṅgāya passe seru nāma dahassa ante varāha nāma soṇḍiyā matthake patiṭṭhāpetvā saṅghārāmaṃ kārāpessasī’ti satthā jīvamāno vyākaraṇamakāsi. Tasmā tvaṃ imaṃ dhātuṃ gahetvā mamaccayena tasmiṃ ṭhāne patiṭṭhāpehī’ti puttaṃ anusāsitvā kālakiriyaṃ katvā sagge nibbatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Goṭhābhayo ",
      " nāma mahīpatissaro,"
    ],
    "innerText": "Goṭhābhayo nāma mahīpatissaro,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Mahājane tosayi appamatto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "So dhātupūjaṃ vipulaṃ karitvā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Agā asoko varadevalokaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mahānando mahāpañño candagutto bahussuto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhaddaseno mahāthero bhaddadhamme visārado."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Jayaseno ca so vīro thero so saṅgharakkhito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Devatthero ca medhāvī rakkhakā dhātu bhaddakā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Uparājā mahānāgo yaṭṭhālako mahābalo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Goṭhābhayo mahāpuñño kākavaṇṇo ca vīriyavā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ete therā ca rājāno puññavanto sumānasā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhātu paramparānītā dhātā dhātusukovidā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kassapādīnatherānaṃ paramparāyamāgatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mahānāgādi hatthato yāva tissamupāgatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti ariyajanappasādanatthāya kate dhātuvaṃse"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhātuparamparā kathā nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tatiyo paricchedo."
  }
]