[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Dhātugabba rūpavaṇṇanākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". Evaṃ rājā dhātugabbhe kattabba kammaṃ niṭṭhāpetvā cātuddasi divase vihāraṃ gantvā bhikkhusaṅghaṃ sannipātesi, sannipatti bhikkhū tiṃsa sahassāni ahesuṃ rājā bhikkhusaṅghaṃ vaṇditvā evamāha. Dhātugabbhe mayā kattabbakammaṃ niṭṭhāpitaṃ, sve āsāḷabhimuposatha divase uttarasāḷha nakkhattena dhātunidhānaṃ bhavissati dhātuyo janātha bhanteti bhikkhusaṅghassa bhāraṃ katvā nagaramevāgañji."
    ],
    "innerText": "23. Evaṃ rājā dhātugabbhe kattabba kammaṃ niṭṭhāpetvā cātuddasi divase vihāraṃ gantvā bhikkhusaṅghaṃ sannipātesi, sannipatti bhikkhū tiṃsa sahassāni ahesuṃ rājā bhikkhusaṅghaṃ vaṇditvā evamāha. Dhātugabbhe mayā kattabbakammaṃ niṭṭhāpitaṃ, sve āsāḷabhimuposatha divase uttarasāḷha nakkhattena dhātunidhānaṃ bhavissati dhātuyo janātha bhanteti bhikkhusaṅghassa bhāraṃ katvā nagaramevāgañji."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha bhikkhusaṅgho dhātu āharaṇakaṃ bhikkhuṃ gavesanto pūjā pariveṇa vāsikaṃ soḷasa vassuddesikaṃ chaḷabhiññaṃ soṇuttaraṃ nāma sāmaṇeraṃ disvā taṃ pakkosāpetvā āvuso soṇuttara rājā dhātugabbhaṃ niṭṭhāpetvā dhātu ābharaṇaṃ bhikkhusaṅghassa bhāramakāsi. Tasmā tayā dhātuyo āharitabbāti āharāmi bhante dhātuyo kuto lacchāmīti pucchi tassa bhikkhusaṅgho evamāha. Āvuso soṇuttara tatāgato maraṇamañce nipanno sakkaṃ devarājānaṃ āmantetvā mayhaṃ aṭṭhadoṇappamāṇesu sārīrika dhātusu ekaṃ doṇaṃ koḷiyarājuhi sakkataṃ, anāgate tambapaṇṇi dīpe mahācetiye patiṭṭhahissatīti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " bhagavati parinibbute doṇa brāhmaṇo dhātuyo aṭṭha koṭṭhāse katvā aṭṭhannaṃ nagaravāsīnaṃ adāsi te attano attano nagare cetiyaṃ kāretvā parihariṃsu tesu rāmagāme koḷiyehi katacetiye mahoghena bhinne dhātukaraṇḍako samuddaṃ pavisitvā ratanavālukā piṭṭhe chabbaṇṇaraṃsi samākiṇṇo aṭṭhāsi."
    ],
    "innerText": "Atha bhagavati parinibbute doṇa brāhmaṇo dhātuyo aṭṭha koṭṭhāse katvā aṭṭhannaṃ nagaravāsīnaṃ adāsi te attano attano nagare cetiyaṃ kāretvā parihariṃsu tesu rāmagāme koḷiyehi katacetiye mahoghena bhinne dhātukaraṇḍako samuddaṃ pavisitvā ratanavālukā piṭṭhe chabbaṇṇaraṃsi samākiṇṇo aṭṭhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nāgā disvā mañjerika nāga bhavanaṃ gantvā mahākāḷa nāga rañño ārocesuṃ so dasakoṭi nāga sahassa parivuto āgantvā gaṇdhamālādīhi pūjetvā suvaṇṇa-pavāḷa-miṇi-rajatadhaje ussāpetvā pañcaṅgika turiya paggahīta nānāvidha nāga nāṭakānaṃ majjhahato dhākukaraṇḍaṃ maṇicaṅgoṭake ṭhapetvā sīsenādāya mahāsakkāra sammānaṃ karonto nāgabhavanaṃ netvā channavuti koṭidhane pūjetvā sabbaratanehi cetiyañca cetiyagharañca māpetvā dhātuyo pariharati. Mahākassapatthero ajātasattuno dhātunidhānaṃ karonto rāmagāme dhātuyo ṭhapetvā sesa dhātuyo āharitvā adāsi rājā rāmagāme dhātuyo kasmā nāhaṭāti pucchi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Thero mahārāja tāsaṃ antarāyo natthi anāgate tambapaṇṇidīpe mahācetiye patiṭṭhahissantīti āha. Asoko dhammarājāpi dhātunidhānaṃ ugghāṭetvā olokento aṭṭhamaṃ dhātudoṇaṃ adisvā aparaṃ dhātuṃ doṇaṃ kattha bhanteti pucchi mahārāja taṃ koḷiyehi gaṅgātīre kata cetiye patiṭṭhitaṃ, mahoghena cetiye bhinne mahāsamuddaṃ pāvisi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Taṃ nāgā disvā attano nāgabhavanaṃ netvā pariharantīti khīṇāsavā āhaṃsu rājā nāgabhavanaṃ nāma mama āṇāpavattanaṭṭhānaṃ, tampi āharāmi bhanteti āha. Mahārāja tā dhātuyo anāgate tambapaṇṇidīpe mahācetiye patiṭṭhahissantiti nivāresuṃ. Tasmā tvaṃ mañcherika nāga bhavanaṃ gantvā taṃ pavattiṃ nāga rañño nivedetvā dhātuyo āhara, sve dhātu nidhānaṃ bhavissatīti. Soṇuttaro sādhūti sampaṭicchitvā attano pariveṇaṃ agamāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rājāpi nagaraṃ antvā nagare bheriṃ carāpesi- sve dhātunidhānaṃ bhavissati nāgarā attano attano vibhavānurūpena alaṅkaritvā gaṇdhamālādīni gahetvā mahācetiyaṅgaṇaṃ otarantuti. Sakkopi vissakammaṃ āṇāpesi-sve mahācetiye dhātunidhānaṃ bhavissati. Sakala tampapaṇṇidīpaṃ alaṅkarohīti. So punadivase ekūnayojanasatikaṃ tambapaṇṇidīpaṃ kasīṇamaṇḍalaṃ viya samaṃ katvā rajatapaṭṭasadisaṃ vālukākiṇṇaṃpañcavaṇṇapupphasamākūlaṃ katvā ",
      " samantato puṇṇaghaṭapantiyo ṭhapāpetvā sāṇīhi parikkhipitvā upari celavitānaṃ baṇdhitvā pathavitale thalapadumāni ākāse olambaka padumāni dassetvā alaṅkata devasabhaṃ viya sajjesi. Mahāsamuddañca sannisinnaṃ pañcavidha padumasañcannaṃ akāsi."
    ],
    "innerText": "Rājāpi nagaraṃ antvā nagare bheriṃ carāpesi- sve dhātunidhānaṃ bhavissati nāgarā attano attano vibhavānurūpena alaṅkaritvā gaṇdhamālādīni gahetvā mahācetiyaṅgaṇaṃ otarantuti. Sakkopi vissakammaṃ āṇāpesi-sve mahācetiye dhātunidhānaṃ bhavissati. Sakala tampapaṇṇidīpaṃ alaṅkarohīti. So punadivase ekūnayojanasatikaṃ tambapaṇṇidīpaṃ kasīṇamaṇḍalaṃ viya samaṃ katvā rajatapaṭṭasadisaṃ vālukākiṇṇaṃpañcavaṇṇapupphasamākūlaṃ katvā samantato puṇṇaghaṭapantiyo ṭhapāpetvā sāṇīhi parikkhipitvā upari celavitānaṃ baṇdhitvā pathavitale thalapadumāni ākāse olambaka padumāni dassetvā alaṅkata devasabhaṃ viya sajjesi. Mahāsamuddañca sannisinnaṃ pañcavidha padumasañcannaṃ akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dhātu ānubhāvena sakala cakkavāḷaṃ gabbhokkamanābhisambodhikālādisu viya sajjitaṃ ahosi nāgarāpa nagara vīthiyo sammajjitvā muttāphala sadisaṃ vālukaṃ okiritvā lājapañcamaka pupphāni samokiritvā nānāvirāga dhajapaṭākāyo ussāpetvā suvaṇṇaghaṭa kadalitoraṇa mālagaghikādīhi alaṅkaritvā nagaraṃ sajjesu. Rājā nagarassa catusu dvāresu anāthānaṃ manussānaṃ paribhotthāya nānāppakāra khādanīya bhojanīya gaṇdhamāla vatthābharaṇa pañcavidhi mudhavāsa sahita tāmbulāni ca ṭhapāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha rājā sabbābharaṇa vibhūsito kumuda pannavaṇṇa catusiṇdhavayutta rathavaramāruyha alaṅkataṃ kaṇḍulaṃ hatthiṃ purato katvā suvaṇṇacaṅgoṭakaṃ sīse katvā setacchattassa heṭṭhā aṭṭhāsi. Tasmiṃ khaṇe sakkaṃ devarājānaṃ devaccharā viya nānābharaṇavibhūsitā devakaññupamā aneka sahassa nāṭakitthiyo ceva dasamahāyodhā ca caturaṅginī senā ca rājānaṃ parivāresuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tathā aṭṭhuttara sahassa itthiyo ca puṇṇaghaṭe garahatvā parivāresuṃ. Aṭṭhuttara sahassa aṭṭhuttara sarassappamāṇeyeva purisā ceva itthiyo ca pupphasamuggāni daṇḍadīpikā nānāvaṇṇa dhaje ca gahetvā parivāresuṃ. Evaṃ rājā mahantena rājānubhāvena naṇdanavanaṃ nikkhanta devarājā viya nikkhami. Tadā nānāvidha turiya ghosehi ceva hatthassa ratha saddehi ca mahāpathavibhijjanākārappattā viya ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmiṃ khaṇe soṇuttaro attano pariveṇeyeva nisinno turiya ghosena rañño nikkhantabhāvaṃ ñatvā abhiññāpādakaṃ catutthajjhānaṃ samāpajjitvā adhiṭṭhayā pathaviyaṃ nimujjitvā mañjerika nāgabhavane mahākāḷānāgarañño purato pāturahosi. Nāgarājā soṇuttaraṃ disvā uṭṭhāyāsanā abhivādetvā gaṇdhodakena pāde dhovitvā vaṇṇa gaṇdha sampanna kusumehi pūjetvā ekāmantaṃ nisīditvā kuto āgatattha bhanteti pucchi tambapaṇṇi dīpato āgatamhāhi vutte kimatthāyāti pucchi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Mahārāja tambapaṇṇidīpe duṭṭhagāmaṇi abhaya mahārājā mahā cetiyaṃ kārento dhātuyo bhikkhusaṅghassa bhāramakāsi. Mahāvihāre tiṃsamattāni bhikkhusahassāni sannipatitvā mahāthūpatthāya ṭhapitadhātuyo ",
      " mahākāḷa nāga rañño santike ṭhitā, tassa taṃ pavattiṃ kathetvā dhātuyo āharāti maṃ pesesuṃ, tasmā idhāgatomhīti āha."
    ],
    "innerText": "Mahārāja tambapaṇṇidīpe duṭṭhagāmaṇi abhaya mahārājā mahā cetiyaṃ kārento dhātuyo bhikkhusaṅghassa bhāramakāsi. Mahāvihāre tiṃsamattāni bhikkhusahassāni sannipatitvā mahāthūpatthāya ṭhapitadhātuyo mahākāḷa nāga rañño santike ṭhitā, tassa taṃ pavattiṃ kathetvā dhātuyo āharāti maṃ pesesuṃ, tasmā idhāgatomhīti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Taṃ sutvā nāgarājā pabbatena viya ajjhotthaṭo mahantena madāmanassena abhibhūto evaṃ cintesi mayaṃ pana imā dhātuyo pūjetvā apāyato muñcitvā sagge nibbattissamāti amaññimha. Ayaṃ pana bhikkhu mahiddhiko mahānubhāvo, sace imā dhātuyo imasmiṃ ṭhāne ṭhito bhaveyyuṃ, amhe abhibhavitvāpi gaṇhituṃ sakkuṇeyya. Dhātuyo apanetuṃ vaṭṭatīti cintetvā parisaṃ olokento parisa pariyante ṭhitaṃ vāsuladattaṃ nāma attano bhāgineyyaṃ disvā tassa saññamadāsi so mātulassa adhippāyaṃ ñatvā cetiyagharaṃ gantvā dhātukaraṇḍakaṃ ādāya gilitvā sinerupabbata pādamūlaṃ gantvā-"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yojanasatāmāvaṭṭaṃ dīghaṃ tisata yojanaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Phaṇānekasahassāni-māpisitvā mahiddhiko,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Sineru pādamūlamhi-dhumāyanto ca pajjalaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ābhujitvāna so bhoge-nipajji vālukātale;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Anekāni sahassāni-attanā sadise ahi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Māpayitvā sayāpesi-samantā parivārite,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Bahū devā ca nāgā ca-osariṃsu tahiṃ tadā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yuddhaṃ ubhinnaṃ nāgānaṃ-sassissāma mayaṃ iti;’’"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato nāgarājā bhāgineyyena dhātuyo apanītabhāvaṃ ñatvā evamāha- mama santike dhātuyo natthi, tumhe idha papañca akatvā sīghaṃ gantvā bhikkhusaṅghassa taṃ pavattiṃ ārocetha bhikkhusaṅgho aññato dhātuṃ pariyesissatīti sāmaṇero ādite paṭṭhāya dhātu āgamanaṃ vatvā dhātuyo tava santikeyeva, papañcaṃ akatvā dehīti codesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato nāgarājā sāmaṇerena mūlamhi gahitabhāvaṃ ñatvā yena kenaci pariyāyena dhātuyo adatvāva pesituṃ vaṭṭatīti cintetvā sāmaṇeraṃ dhātugharaṃ netvā cetiyañca cetiyagharañca dassesi. Taṃ pana cetiyañca cetiyagharañca sabbaratanamayameva ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vuttañhetaṃ mahāvaṃse"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Anekadhā anekehi ratanehi susaṅkhataṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cetiyaṃ cetiyagharaṃ-passa bhikkhu sunimmita’’nti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dassetvā ca pana cetiyagharato oruyha addhacaṇdakapāsāṇe pavāḷapadumamhi ṭhatvā imassa cetiyassa cetiyagharassa ca agghaṃ karohi ",
      " bhanteti āha sāmaṇero na sakkoma mahārāja agghaṃ kātuṃ, sakalepi tambhapaṇṇidīpe ratanāni imaṃ addhacaṇdaka pāsāṇaṃ nāgghatīti āha."
    ],
    "innerText": "Dassetvā ca pana cetiyagharato oruyha addhacaṇdakapāsāṇe pavāḷapadumamhi ṭhatvā imassa cetiyassa cetiyagharassa ca agghaṃ karohi bhanteti āha sāmaṇero na sakkoma mahārāja agghaṃ kātuṃ, sakalepi tambhapaṇṇidīpe ratanāni imaṃ addhacaṇdaka pāsāṇaṃ nāgghatīti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nāgarājā evaṃ sante mahāsakkāraṭṭhānato appasakkāraṭṭhānaṃ dhātūnaṃ nayanaṃ ayuttaṃ nanu bhikkhūti āha. Sāmaṇero evamāhamahārāja buddhā nāma dhammagarukā, na āmisa garukaṃ, tumhesu cakkavāḷappamāṇaṃ ratanagharaṃ māpetvā sabbaratanassa pūretvā dhātuyo pariharantesupi ekanāgopi dhammābhisamayaṃ kātuṃ samattho nāma natthi yasmā-"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Saccābhisamayo nāga-tumhākampi na vijjati. Saccābhisamayaṭṭhānaṃ-netuṃ yuttañhi dhātuyo. Saṃsāradukkhamokkhāya-uppajjanta tathāgatā, buddhassa vetthādīppāyo-tena nessāmi dhātuyo. Dhātunidhānaṃ ajjeva-so hi rājā karissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmā papañcamakaritvā-lahuṃ me dehi dhātuye’’ti-āha. Evaṃ vutte nāgarājā appaṭihāno yutvā attano bhāgineyyena dhātuyo gopitoti maññamāno evamāha. Tumhe bhante cetiye dhātūnaṃ atthibhāvaṃ vā natthibhāvaṃ vā ajānantā dehi dehīti vadatha. Ahaṃ natthīti vadāmi. Sace passatha gahetvā gacchathāti. Gaṇhāmi mahārājāti, gaṇha bhikkhūti. Gaṇhāmi mahārājāti, gaṇha bhikkhūti tikkhattuṃ paṭiññaṃ gahetvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sukhumaṃ karaṃ māpayitvā-thikkhū tatra ṭhitoca so,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Bhāgineyyassa vadane-hatthampakkhippa tāvade,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Dhātukaraṇḍamadāya-tiṭṭha nāgāti bhāsiha,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nimujjitvā pathaviyaṃ-pariveṇamhi uṭṭhahi;’’"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tadā sāmaṇerassa nāgena saddhiṃ yuddhaṃ passissāmāti samāgatā deva-nāga parisāpa bhikkhunāgassa vijayaṃ disvā haṭṭhā pamodito dhātuyo pūjayantāva teneva saha āgamuṃ, nāgarājā sāmaṇerassa gata kāle bhikkhuṃ vañcetvā pesitomhīti haṭṭhatuṭṭho dhātuyo gahetvā āgamatthāya bhāgineyyassa sāsanaṃ pesesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Bhāgineyyo’tha kucchimhi-apassitvā karaṇḍakaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Paridevamāno āgantvā-mātulassa nivedayi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tadā so nāgarājāpi-vañcitamha mayaṃ iti,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paridevi nāgā sabbepi-parideviṃsu piṇḍitā;’’"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato ",
      " nāgabhavane sabbe nāgā samāgantvā kese muñcitvā ubhohi hatthehi hadaye gahetvā nīluppala sadisehi nettehi vilīna sokamiva assudhāraṃ pavattayamānā-"
    ],
    "innerText": "Tato nāgabhavane sabbe nāgā samāgantvā kese muñcitvā ubhohi hatthehi hadaye gahetvā nīluppala sadisehi nettehi vilīna sokamiva assudhāraṃ pavattayamānā-"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Paridevamānā āgantvā-nāgā saṅghassa santike,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bahudhā parideviṃsa-dhātāharaṇa dukkhitā’’ti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paridevitvā ca bhikkhusaṅghassa evamāhaṃsu- bhante kassaci pīḷaṃ akatvā amhākaṃ puññānubhāvena labhitvā cīraparihaṭa dhātuyo kasmā anavasesaṃ katvā aharāpetha amhākaṃ saggamokkhantarāyaṃ karothāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "’Tesaṃ saṅgho’nukampāya-thokaṃ dhātumadāpayi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Te tena tuṭṭhā gantvāna-pūjābhaṇḍāni āharuṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato sakko devānamiṇdo vissakammaṃ āmantetvā sāmaṇerassa uṭṭhitaṭṭhāne sattaratanamayaṃ maṇḍapaṃ māpehīti āha. So tasmiyeva khaṇe maṇḍapaṃ māpesi atha sakko dvīsu devalokesu devaparisāya parivuto suvaṇṇacaṅgoṭakena saddhiṃ ratana pallaṅkamādāya āgantvā tasmiṃ maṇḍape patiṭṭhāpetvā sāmaṇerassa hatthato dhātukaraṇḍakaṃ gahetvā tasmiṃ pallaṅke patiṭṭhāpesi. Tadā-"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "’Brahmā chattamadhāresi-santusito vālavijaniṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Maṇitālavaṇṭaṃ suyāmo-sakko saṅkhantu sodakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Cattāro tu mahārāja-aṭṭhaṃsu khaggapāṇino,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Samuggahatthā dvattiṃsā-devaputtā mahiddhikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pāricchattaka pupphehi pūjayantā tahiṃ ṭhitā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kumāriyopi dvattiṃsā-daṇḍidīpadharā ṭhitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Palāpetvā duṭṭhayakkhe-yakkhasenāpati pana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aṭṭhavīsati aṭṭhaṃsu-ārakkhaṃ kurumānakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vīṇaṃ vādayamānova-aṭṭhā pañcasikho tahiṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Raṅgabhūmiṃ māpayitvā-timbarū turiyaghosavā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Anekā devaputtā ca-sādhugītappayojakā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mahākālo nāgarājā-thūyamāno anekadhā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dibbaturiyāni vajjanti-dibbasaṅgiti vattati,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dibbagaṇdhā ca vassāni-vassāpenti ca devatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tadā iṇdaguttatthero mārassa paṭibāhanatthāya cakkavāḷapariyantaṃ katvā ākāse lohachattaṃ māpesi. Pañcanikāyika therā ",
      " dhātuyo parivāretvā pañcasu ṭhānesu nisīditvā gaṇasajjhāyamakaṃsu. Tasmiṃ kāle rājā taṃ ṭhanaṃ āgantvā sisato suvaṇṇa caṅgoṭakaṃ otāretvā dhātu caṅgoṭakaṃ attano caṅgoṭake ṭhapetvā pallaṅke patiṭṭhāpetvā gaṇdhamālādīhi pūjetvā pañcapatiṭṭhitena vaṇditvā sirasi añjaliṃ paggayha akkhīni ummīletvā olokento aṭṭhāsi. Tasmiṃ khaṇe dhātumatthake setacchattaṃ dissati chattagāhaka brahmā na dissati. Tathā tālavaṇṭa vijani ādayo dissanti gāhakā na dissanti dibbaturiyaghosa saṅgitiyo suyyanti gaṇdhabba devatā na dissanti. Rājā etaṃ acchariyaṃ disvā iṇdaguttattheraṃ evamāha-devatā dibbachattena pūjesuṃ ahaṃ mānusa kacchattena pūjemi bhanneti. Thero yuttaṃ mahārājāti āha. Rājā attano suvaṇṇapiṇḍike setacchattena pūjetvā suvaṇṇabhiṃkāraṃ gahetvā abhisekodakaṃ datvā taṃ divasaṃ sakalatambapaṇṇi dīpe rajjaṃ adāsi."
    ],
    "innerText": "Tadā iṇdaguttatthero mārassa paṭibāhanatthāya cakkavāḷapariyantaṃ katvā ākāse lohachattaṃ māpesi. Pañcanikāyika therā dhātuyo parivāretvā pañcasu ṭhānesu nisīditvā gaṇasajjhāyamakaṃsu. Tasmiṃ kāle rājā taṃ ṭhanaṃ āgantvā sisato suvaṇṇa caṅgoṭakaṃ otāretvā dhātu caṅgoṭakaṃ attano caṅgoṭake ṭhapetvā pallaṅke patiṭṭhāpetvā gaṇdhamālādīhi pūjetvā pañcapatiṭṭhitena vaṇditvā sirasi añjaliṃ paggayha akkhīni ummīletvā olokento aṭṭhāsi. Tasmiṃ khaṇe dhātumatthake setacchattaṃ dissati chattagāhaka brahmā na dissati. Tathā tālavaṇṭa vijani ādayo dissanti gāhakā na dissanti dibbaturiyaghosa saṅgitiyo suyyanti gaṇdhabba devatā na dissanti. Rājā etaṃ acchariyaṃ disvā iṇdaguttattheraṃ evamāha-devatā dibbachattena pūjesuṃ ahaṃ mānusa kacchattena pūjemi bhanneti. Thero yuttaṃ mahārājāti āha. Rājā attano suvaṇṇapiṇḍike setacchattena pūjetvā suvaṇṇabhiṃkāraṃ gahetvā abhisekodakaṃ datvā taṃ divasaṃ sakalatambapaṇṇi dīpe rajjaṃ adāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato sabbaturiyāni paggaṇhiṃsu, gaṇdhamālādīhi pūjetva mahantaṃ sakkāramakaṃsu puna rājā theraṃ pucchi - amhākaṃ satthā dibbamānusakāni dve chattāni dhāresi bhante. Na dve chattāni tīṇi chattāni mahārājāti. Aññaṃ chattaṃ napassāmi bhanneti. Sīlapatiṭṭhaṃ samādhidaṇḍakaṃ iṇdriyasalākaṃ balamālaṃ maggaphalapatta sañchannaṃ vimuttivarasetacchattaṃ ussāpetvā ñāṇābhisekampatto dhammaratana cakkaṃ pavattetvā dasasahassa cakkavāḷesu buddharajjaṃ hatthagataṃ katvā rajjaṃ kāresīti rājā tīṇicchatta dhārakassa satthuno tikkhattuṃ rajjaṃ dammīti tikkhattuṃ dhātuyo rajjena pūjesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato rājā devamanussesu dibbagaṇdhamālādīhi pūjentesu anekesu turiyaghosa saṅgitesu vattamānesu dhātukaraṇḍakaṃ sīsenādāya ratanamaṇḍapato nikkhamitvā bhikkhusaṅgha parivuto mahācetiyaṃ padakkhiṇaṃ katvā pācīnadvārenāruyha dhātugabbhaṃ otari. Tato mahācetiyaṃ parivāretvā channavuti koṭippamāṇa arahanto aṭṭhaṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rājā sīsato dhātukaraṇḍakaṃ otāretvā mahārahe sayanapiṭṭhe ṭhapessāmīti cintesi tasmiṃ khaṇe dhātukaraṇḍako rañño sīsato satta tālappamāṇe ṭhāne gantvā sayameva vicari dhātuyo ākāsamuggantvā dvattiṃsa mahā purisalakkhaṇa asiti anubyañjanā byāmappabhā patimaṇḍitaṃ ketumālopa sobhitaṃ nila-pīta-lohitādi bheda vicitra raṃsijālā samujjalaṃ buddhavesaṃ gahetvā gaṇḍambamūle ",
      " yamaka pāṭihāriyaṃ sadisa yamaka pāṭihāriyaṃ akaṃsu. Taṃ dhātupāṭihāriyaṃ disvā pasīditvā arahattampattā devamanussā dvādasakoṭiyo ahesuṃ. Sesaphalattayaṃ pattā gaṇanapathamatītā ahesuṃ. Evaṃ dhātuyo anekadhā pāṭihāriyaṃ dassetvā buddhavesaṃ vissajjetvā karaṇḍakaṃ pavisitvā tena saddhiṃ otaritvā rañño sīse patiṭṭhahiṃsu."
    ],
    "innerText": "Rājā sīsato dhātukaraṇḍakaṃ otāretvā mahārahe sayanapiṭṭhe ṭhapessāmīti cintesi tasmiṃ khaṇe dhātukaraṇḍako rañño sīsato satta tālappamāṇe ṭhāne gantvā sayameva vicari dhātuyo ākāsamuggantvā dvattiṃsa mahā purisalakkhaṇa asiti anubyañjanā byāmappabhā patimaṇḍitaṃ ketumālopa sobhitaṃ nila-pīta-lohitādi bheda vicitra raṃsijālā samujjalaṃ buddhavesaṃ gahetvā gaṇḍambamūle yamaka pāṭihāriyaṃ sadisa yamaka pāṭihāriyaṃ akaṃsu. Taṃ dhātupāṭihāriyaṃ disvā pasīditvā arahattampattā devamanussā dvādasakoṭiyo ahesuṃ. Sesaphalattayaṃ pattā gaṇanapathamatītā ahesuṃ. Evaṃ dhātuyo anekadhā pāṭihāriyaṃ dassetvā buddhavesaṃ vissajjetvā karaṇḍakaṃ pavisitvā tena saddhiṃ otaritvā rañño sīse patiṭṭhahiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Rājā amatena viya abhisitto saphalaṃ manussatta paṭilābhaṃ maññamāno ubhohi hatthehi dhātukaraṇḍakaṃ gahetvā nāṭaka parivuto alaṅkata sayana samīpaṃ gantvā dhātucaṅgoṭakaṃ ratanapallaṅke ṭhapetvā gaṇdhavāsitodakena hatthe dhovitvā vatujātiya gaṇdhena ubbaṭṭetvā ratanakaraṇḍakaṃ vicaritvā dhātuyo gahetvā evaṃ cintesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Anākulā kehicipi yadi hessasti dhātuyo,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Janassa saraṇaṃ hutvā yadi ṭhassanti dhātuyo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Satthunipannā kārena parinibbāna mañcake,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nipajjantu supaññatte-sayanamhi mahārahe’’ti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ cintetvā pana varasayanapiṭṭhe dhātuyo ṭhapesi tasmiṃ khaṇe dhātuyo raññā cintita niyāmeneva mahārahe sayane buddhavesena sayiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Āsāḷahi sukkapakkhassa pannarasa uposathe,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uttarāsāḷha nakkhatte evaṃ dhātu patiṭṭhitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saha dhātu patiṭṭhānā akampittha mahāmahī, pāṭihīrāni nekāni pavattiṃsu anekadhā.’’"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tadahi udakapariyantaṃ katvā ayaṃ mahāpathavī saṅkampi sampakampi sampavedhi, mahāsamuddo saṅkhūbhi, ākāse vijjullatā nicchariṃsu. Khaṇikavassaṃ vassi, cha devalokā ekakolāhala mahosi rājā etaṃ acchariyaṃ disvā pasanno attano kañcana mālika setacchattena dhātuyo pūjetvā tambapaṇṇidipe rajjaṃ sattāhaṃ datvā tiṃsa satasahassagghanakaṃ alaṅkāra bhaṇḍaṃ omuñcitvā pūjesi. Tathā sabbāpi nāṭakitthiyo amaccā sesa mahājano devā ca sabbābharaṇāni pūjesuṃ tasmā-"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tiṭṭhantaṃ sugataṃ tilokamahitaṃ yo pūjaye sādaraṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yo vā sāsapa bījamattampi taṃ dhātuṃ naro pūjaye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tesaṃ puññaphalaṃ samānamīti taṃ cittappasāde same,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ñatvā taṃ parinibbutepi sugate dhātuṃ budho pūjaye’ti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato ",
      " rājā cīvaravatthāni ceva guḷa-sappi ādi bhesajjāni ca saṅghassa datvā sabbarattiṃ gaṇasajjhāyaṃ kāresi puna divase nagare bheriṃ carāpesi mahājano imaṃ sattāhaṃ gaṇdhamālādīni ādiya gantvā dhātuyo vaṇdatūti iṇdaguttattheropi sakala tambapaṇṇi dīpe manussā dhātuyo vaṇditukāmā, taṃ khaṇaṃyeva āgantvā vaṇditvā yathāṭṭhānaṃ gacchantūti adhiṭṭhāsi."
    ],
    "innerText": "Tato rājā cīvaravatthāni ceva guḷa-sappi ādi bhesajjāni ca saṅghassa datvā sabbarattiṃ gaṇasajjhāyaṃ kāresi puna divase nagare bheriṃ carāpesi mahājano imaṃ sattāhaṃ gaṇdhamālādīni ādiya gantvā dhātuyo vaṇdatūti iṇdaguttattheropi sakala tambapaṇṇi dīpe manussā dhātuyo vaṇditukāmā, taṃ khaṇaṃyeva āgantvā vaṇditvā yathāṭṭhānaṃ gacchantūti adhiṭṭhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Te tatheva dhātuyo vaṇditvā gamiṃsu rājā sattāhaṃ saṅghassa mahādānaṃ pavattetvā sattāhassa accayena dhātugabbhe mayā kattabbakiccaṃ niṭṭhāpitaṃ, dhātugabbhaṃ pidahatha bhanteti saṅghassa ārocesi. Saṅgho uttarasumana sāmaṇere āmantetvā tumhehi pubbe āhaṭa medavaṇṇa pāsāṇena dhātu gabbhaṃ pidahathāti āha. Te sādhūti sampaṭicchitvā dhātugabbhaṃ pidahiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato khīṇāsavā dhātugabbhe gaṇdhā mā susantu mālā mā milāyantu. Dīpā mā nibbāyantu ratanāni mā vivaṇṇāni hontu pūjanīyabhaṇḍāni mā nassantu. Medavaṇṇa pāsāṇā saṇdhiyantu, paccatthikānaṃ okāso mā hotūti adhiṭṭhahiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ rājā dhātu nidhāpetvā puna nagare bheriṃ carāpesi mahā cetiye dhātuṃ nidhāpetvā dhātuṃ āharitvā nidhānaṃ karontūti. Mahājano attano attano balānurūpena suvaṇṇa rajatādi karaṇḍe kārāpetvā tattha dhātuyo patiṭṭhāpetvā dhātunidhānassupari medavaṇṇa pāsāṇa piṭṭhiyaṃ nidahiṃsu. Sabbehi sannihita dhātuyo sahassamattā ahesunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iti sādhujana manopasādanatthāya kate thūpavaṃse dhātunidhāna kathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ". Tato rājā taṃ sabbaṃ pidahetvā cetiyaṃ karonto udarena saddhiṃ caturassa koṭṭhakaṃ niṭṭhāpesi atha chattakamme sudhākamme ca aniṭṭhiteyeva māraṇantika rogena gilāno hutvā dīghavāpito kaniṭṭhabhātaraṃ pakkosāpetvā cetiye aniṭṭhitaṃ chattakammaṃ sudhākammañca sīghaṃ niṭṭhāpetvā maṃ tosehi tātāti āha. So rañño dubbalabhāvaṃ ñatvā antare aniṭṭhitakammaṃ kātuṃ na sakkāti suddhavatthehi kañcukaṃ kāretvā cetiye paṭimuñcāpetvā cittakārehi kañcuka matthake vedikā ca puṇṇaghaṭa pañcaṅguli pantiyo ca kārāpesi."
    ],
    "innerText": "24. Tato rājā taṃ sabbaṃ pidahetvā cetiyaṃ karonto udarena saddhiṃ caturassa koṭṭhakaṃ niṭṭhāpesi atha chattakamme sudhākamme ca aniṭṭhiteyeva māraṇantika rogena gilāno hutvā dīghavāpito kaniṭṭhabhātaraṃ pakkosāpetvā cetiye aniṭṭhitaṃ chattakammaṃ sudhākammañca sīghaṃ niṭṭhāpetvā maṃ tosehi tātāti āha. So rañño dubbalabhāvaṃ ñatvā antare aniṭṭhitakammaṃ kātuṃ na sakkāti suddhavatthehi kañcukaṃ kāretvā cetiye paṭimuñcāpetvā cittakārehi kañcuka matthake vedikā ca puṇṇaghaṭa pañcaṅguli pantiyo ca kārāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Naḷakārehi veḷumaya chattaṃ kāretvā kharapattamaye caṇdasūriyamaṇḍale muddhani vedikā kāretvā lākhākukuṭṭhakehi taṃ vicittaṃ katvā thūpakammaṃ niṭṭhitanti rañño arocesi rājā tena hi maṃ ",
      " mahācetiyaṃ dassehīti vatvā sivikāya nipajjitvā cetiyā padakkhiṇaṃ katvā dakkhiṇadvāre bhūmisayanaṃ paññāpetvā tattha nipanno dakkhiṇena passena sayitvā mahāthūpaṃ vāmapassena sayitvā lohapāsādaṃ olokento pasanna citto ahosi. Tadā rañño sāsanassa bahūpakārabhāvaṃ sallakkhetvā gilāna pucchanatthāya tato tato āgatā bhikkhu channavuti koṭiyo rājānaṃ parivāretvā aṭṭhaṃsu. Tato saṅgho vagga vaggā hutvā gaṇasajjhāyaṃ akāsi."
    ],
    "innerText": "Naḷakārehi veḷumaya chattaṃ kāretvā kharapattamaye caṇdasūriyamaṇḍale muddhani vedikā kāretvā lākhākukuṭṭhakehi taṃ vicittaṃ katvā thūpakammaṃ niṭṭhitanti rañño arocesi rājā tena hi maṃ mahācetiyaṃ dassehīti vatvā sivikāya nipajjitvā cetiyā padakkhiṇaṃ katvā dakkhiṇadvāre bhūmisayanaṃ paññāpetvā tattha nipanno dakkhiṇena passena sayitvā mahāthūpaṃ vāmapassena sayitvā lohapāsādaṃ olokento pasanna citto ahosi. Tadā rañño sāsanassa bahūpakārabhāvaṃ sallakkhetvā gilāna pucchanatthāya tato tato āgatā bhikkhu channavuti koṭiyo rājānaṃ parivāretvā aṭṭhaṃsu. Tato saṅgho vagga vaggā hutvā gaṇasajjhāyaṃ akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Rājā tasmiṃ samāgame theraputtābhayattheraṃ adisvā evaṃ cintesi. So mayi damiḷehi saddhiṃ aṭṭhavīsati mahāyuddhe kayiramāse apaccosakakitvā idāni maraṇayuddhe vattamāṇe mayhaṃ parājayaṃ disvā maññe nāgacchatīti. Tadā thero kariṇda nadī sīse pajjalita pabbate vasanto rañño parivitakkaṃ ñatvā pañcasata khīṇāsava parivusetā ākāsenāgantvā rañño purato pāturahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Rājā theraṃ disvā attano purato nisīdāpetvā evamāha bhante tumhehi saddhiṃ dasamahā yodhe gahetvā damiḷehi saddhi yujdhiṃ. Idāni ekakova maccūnā saddhiṃ yujjhituṃ ārabhiṃ. Maccu sattumpana parājetuṃ na sakkomīti. Tato-"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Theraputtābhayatthero mā bhāyi manujādhipa,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kilesa sattuṃ ajinitvā ajeyyo maccūsattuko;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iti vatvā evaṃ anusāsi. Mahārāja sabboyeva loka sannivāse jātiyā anugato, jarāya anusaṭo, vyādhinā abhibhūto, maraṇena abbhāhato. Tetāha-"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yathāpi selā vipulā-nahaṃ āhacca pabbatā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Samantā anupariyeyyuṃ-nippothentā catuddisaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Evaṃ jarā ca maccu ca-adhivattanti pāṇino,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Khattiyo brāhmaṇe vesse sudde caṇḍāla pukkuse,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na kiñci parivajjeti-sabbamevābhimaddati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Na tattha hatthinaṃ bhūmi-na rathānaṃ na pattiyā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na cāpi mantayuddhena-sakkā jetuṃ dhanena vā’’ti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmā idaṃ maraṇaṃ nāma mahāyasānaṃ mahāsammatādīnaṃ mahā puññānaṃ jotiyādīnaṃ mahāthāmānaṃ baladevādīnaṃ iddhimantānaṃ mahāmoggallānādīnaṃ paññāvantānaṃ sāriputtādīnaṃ sayambhūñāṇena adhigata saccānaṃ, paccekabuddhānaṃ sabbaguṇasamannāgatānaṃ sammāsambuddhānampi upari nirāsaṅkameva patati kimaṅgapanaññesu sattesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmā- "
    ],
    "innerText": "Tasmā-"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mahāyasā rājavarā gatā te sabbe mahāsammata ādayopi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aniccabhāvaṃ baladeva ādi mahābalā ceva tathā gamiṃsu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ye puññavantāni gatā pasiddhiṃ mahaddhanaṃ jotiyameṇḍakādī,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upāvisiṃ vaccumukhaṃ sabhogā sabbepi te rāhumukhaṃ sasīva;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yo iddhimantesu tathāgatassa puttesuseṭṭho iti vissutopi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Thero mahārājasaheva iddhibalena so maccumukhaṃ paviṭṭho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sabbesu sattesu jinaṃ ṭhapetvā nevatthi paññāya samopi yena,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "So dhammasenāpati sāvakopi gato mahārāja aniccataṃ’ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sayambhūñāṇassa balena santiṃ gatā mahārāja sayambhūnopi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbepi te ñāṇabalūpa pannā aniccataṃ neva atikkamiṃsu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tilokanātho purisuttamo so aniccabhāvaṃ samatikkamitvā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nāsakkhi gantuṃ sugatopi rāja aññesu sattesu kathāva natthi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tasmā mahārāja bhavesu sattā sabbepi nāsuṃ maraṇā vimuttā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbampi saṅkhāragataṃ aniccaṃ dūkkhaṃ anattāti vicintayassu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dutiye attabhāvepi dhammacchaṇdo mahā hi te,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upaṭṭhite devaloke hitvā dibbasukhaṃ tuvaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Idhāgamma bahuṃ puññaṃ akāsi ca anekadhā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Karaṇampeka rajjassa sāsanajjotanāya te;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mahā rāja kataṃ puññaṃ yāvajja divasā tayā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbaṃ anussaretheva sukhaṃ sajju bhavissati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Taṃ sutvā tuṭṭhamānaso rājā bhante tumhe maccuyuddhepi apassayāti vatvā laddhassāso puññapotthakaṃ vācetuṃ āṇāpesi lekhako puññapotthakaṃ evaṃ vācesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ekūnasatavihārā mahārājena kāritā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ekūnasatakoṭīhi vihāro maricaṭṭi ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Uttamo lohapāsādo tiṃsakoṭīhi kārito,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mahāthūpe anagghāni kāritā catuvīsati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mahāthūpamhi sesāni karitāni subuddhinā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Koṭisahassaṃ agghanti mahārāja tayā puna;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Koḷamba nāma maleya akkhakkhāyika chātake,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kuṇḍalāni mahagghāni duve datvāna gaṇhiya;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Khīṇāsavānaṃ ",
      " pañcannaṃ mahātherānamuttamo,"
    ],
    "innerText": "Khīṇāsavānaṃ pañcannaṃ mahātherānamuttamo,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dinno pasannacittena kaṅgu ambila piṇḍako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Cūḷaṅgaṇiya yuddhamhi parajjhitvā palāyatā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kālaṃ ghosāpayitvāna āgatassa vihāyasā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Khīṇāsavassa yatino attānamanapekkhiya,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dinnaṃ saraka bhattanti puññapotthaṃ avācayi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". Taṃ sutvā rājā tussitvā ṭhapehi ṭhapehi bhaṇeti vatvā evamāha. Maricavaṭṭi vihāramahasattāhe thūpāramhasattāhe ca cātuddisa ubhato saṅghassa mahārahaṃ mahādānaṃ pavattesiṃ. Catuvīsati mahāvisākhapūjā kāresiṃ tambapaṇṇidīpe mahābhikkhusaṅghassa tikkhattuṃ cīvaramadāsiṃ satta satta dīnāni laṅkā rajjaṃ sāsanassa pañcakkhattuṃ adāsiṃ sappi sannitta suparisuddha vaṭṭiyā dvādasaṭhānesu, sattaṃ dīpasahassaṃ jālesiṃ aṭṭhārassu ṭhānesu gilānānaṃ vejjehi bhesajjañca bhattañca niccaṃ dāpesi. Catucattālīsa ṭhānesu telullopakañca adāsiṃ. Tattakesuyeva ṭhānesu ghatapakkajālapūve bhattena saddhiṃ niccaṃ dāpesiṃ."
    ],
    "innerText": "25. Taṃ sutvā rājā tussitvā ṭhapehi ṭhapehi bhaṇeti vatvā evamāha. Maricavaṭṭi vihāramahasattāhe thūpāramhasattāhe ca cātuddisa ubhato saṅghassa mahārahaṃ mahādānaṃ pavattesiṃ. Catuvīsati mahāvisākhapūjā kāresiṃ tambapaṇṇidīpe mahābhikkhusaṅghassa tikkhattuṃ cīvaramadāsiṃ satta satta dīnāni laṅkā rajjaṃ sāsanassa pañcakkhattuṃ adāsiṃ sappi sannitta suparisuddha vaṭṭiyā dvādasaṭhānesu, sattaṃ dīpasahassaṃ jālesiṃ aṭṭhārassu ṭhānesu gilānānaṃ vejjehi bhesajjañca bhattañca niccaṃ dāpesi. Catucattālīsa ṭhānesu telullopakañca adāsiṃ. Tattakesuyeva ṭhānesu ghatapakkajālapūve bhattena saddhiṃ niccaṃ dāpesiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Māse māse aṭṭhasu uposathadivasesu laṅkādīpe sabbavihāresu dīpatelaṃ dāpesiṃ. Āmisa dānato dhammadānaṃ mahantanti sutvā heṭṭhaṃ lohapāsāde dhammāsane nisīditvā maṅgala suttaṃ osāretuṃ ārabhitvāpi saṅgha gāravena osāretuṃ nāsakkhiṃ. Tato paṭṭhāya dhammadesake sakkaritvā sabbavihāresu dhammakathaṃ kathāpesiṃ ekekassa dhammakathikassa nāḷa nāḷippamāṇāni sappiphāṇita sakkharāni caturaṅgula muṭṭhippamāṇaṃ yaṭṭhimadhukaṃ sāṭakadvayañca māsassa aṭṭhasu uposatha disesu dāpesiṃ. Etaṃ sabbampi issariye ṭhatvā dinnattā mama cittaṃ sa ārādheti. Jīvitaṃ pana anapekkhitvā duggatena mayā dinnadānadvayameva ārādhetīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Taṃ sutvā abhayatthero mahārāja pasādanīyaṭṭhāneyeva pasādaṃ akāsi taṃ pana piṇḍapātadvayaṃ parissa pīḷaṃ akatvā laddha dhammika paccayattā attānaṃ anavaloketvā asajjamānena dinnattā paṭiggāhakānaṃ yāvadatthaṃ katvā dinnattā pītipāmojjaṃjanayitvā balava saddhāya dinnattā deyyadhammassa niravasesaṃ paribhogaṃ gatattāti imehi pañcahi kāraṇehi mahantatti vatvā mahārāja kaṅgu ambili piṇḍagāhakattheresu maliyamahādevatthero samantakūṭe pañcannaṃ bhikkhusatānaṃ datvā paribhuñji pathavi cālanaka dhammaguttatthero kalyāṇīya vihāre pañcannaṃ bhikkhusatānaṃ datvā paribhuñji."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Talaṅgaravāsī ",
      " dhammaguttattheropi piyaṅgudīpe dvādasannaṃ bhikkhusahassānaṃ datvā paribhuñji. Maṅgaṇavāsī cuḷatissatthero kelāsakūṭe vihāre saṭṭhisahassānaṃ bhikkhūnaṃ datvā paribhuñji mahābhaggattheropi ukkānagara vihāre sattasatānaṃ bhikkhūnaṃ datvā paribhuñji saraka bhattagāhakatthero pana piyaṅgudīpe dvādasannaṃ bhikkhusahassānaṃ datvā paribhogamakāsīti vatvā rañño cittaṃ hāsesi."
    ],
    "innerText": "Talaṅgaravāsī dhammaguttattheropi piyaṅgudīpe dvādasannaṃ bhikkhusahassānaṃ datvā paribhuñji. Maṅgaṇavāsī cuḷatissatthero kelāsakūṭe vihāre saṭṭhisahassānaṃ bhikkhūnaṃ datvā paribhuñji mahābhaggattheropi ukkānagara vihāre sattasatānaṃ bhikkhūnaṃ datvā paribhuñji saraka bhattagāhakatthero pana piyaṅgudīpe dvādasannaṃ bhikkhusahassānaṃ datvā paribhogamakāsīti vatvā rañño cittaṃ hāsesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Rājā cittaṃ pasādetvā evamāha-ahambhante catuvīsati vassāni rajjaṃ kārento bhikkhusaṅghassa pahūpakāro ahosiṃ. Kāyopi me saṅghassa upakārako hotu saṅghadāsassa me sarīraṃ mahācetiyassa dassanaṭṭhāne saṅghassa kammamālake jhāpethāti. Tato kaniṭṭhaṃ āmantetvā’tāta! Tissa! Mahāthūpe aniṭṭhitaṃ kammaṃ sādhukaṃ niṭṭhāpesi. Sāyaṃ pāto ca mahāthūpe pupphapūjaṃ kāretvā tikkhattuṃ upahāraṃ kārehi. Mayā ṭhapitaṃ dānavaṭṭaṃ sabbaṃ aparihāpetvā saṅghassa kattabbakiccesu sadā appamatto hohī’ti anusāyitvā tuṇhi ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmiṃ khaṇe bhikkhu gaṇasajjhāyaṃ ārabhiṃsu devatā pana chadeva lokato cha rathe gahetvā ādāya paṭipāṭiyā ṭhapetvā mahārāja amhākaṃ devaloko ramaṇīyo, amhākaṃ devaloko ramaṇīyoti vatvā attano attano devalokaṃ āgamanatthāya yāciṃsu rājā tesaṃ vacanaṃ sutvā yāvāhaṃ dhammaṃ suṇāmi- tāva adhivāsethāti te hatthasaññāya nivāresi saṅgho gaṇasajjhāyaṃ nivāresīti maññitvā sajjhāyaṃ ṭhapāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Rājā kasmā bhante gaṇasajjhāyaṃ ṭhapethāti āha. Mahārāja tayā hatthasaññāya nivāritattāti. Bhante tumhākaṃ saññaṃ nādāsiṃ. Devatā chadevalokato cha rathe ānetvā attano attano devalokaṃ gantuṃ yācanti tasmā tesaṃ yāvāhaṃ dhammaṃ suṇāmi tāva āgamethāti saññaṃ adāsinti taṃ sutvā keci ayaṃ rājā maraṇabhayabhito vippalapati, maraṇato abhāyanaka satto nāma natthīti maññiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato abhayatthero āha kathaṃ mahārāja saddahituṃ sakkā cha devalokato cha rathā ānītāti taṃ sutvā rājā ākāse pupphadāmāni khipāpesi. Tāni gantvā visuṃ rathadhure olambiṃsu mahājano ākāse olambantāni pupphadāmāni disvā nikkaṅkho ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato rājā theraṃ pucchi-katamo pana bhante devaloko ramaṇīyoti. Tusitabhavanaṃ pana mahārāja ramaṇīyaṃ, buddhabhāvāya samayaṃ olokento metteyyo bodhisattopi tasmiṃyeva vasatīti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Taṃ ",
      " sutvā rājā tasmiṃ ālayaṃ katvā mahāthūpaṃ olokento nipannova cavitvā suttappabuddho viya tusita bhavanato āhaṭa. Rathe nibbattitvā attano katapuññassa thalaṃ mahājanassa pākaṭaṃ kātuṃ ratheyeva ṭhatvā dibbābharaṇa vibhūsito mahājanassa passantasseva tikkhattuṃ mahāthūpaṃ padakkhiṇaṃ katvā bhikkhusaṅghañca vaṇditvā tusitabhavanaṃ agamāsi."
    ],
    "innerText": "Taṃ sutvā rājā tasmiṃ ālayaṃ katvā mahāthūpaṃ olokento nipannova cavitvā suttappabuddho viya tusita bhavanato āhaṭa. Rathe nibbattitvā attano katapuññassa thalaṃ mahājanassa pākaṭaṃ kātuṃ ratheyeva ṭhatvā dibbābharaṇa vibhūsito mahājanassa passantasseva tikkhattuṃ mahāthūpaṃ padakkhiṇaṃ katvā bhikkhusaṅghañca vaṇditvā tusitabhavanaṃ agamāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Evaṃ asāre nicaye dhanānaṃ aniccasaṅghaṃ sattaṃ sapaññā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Katvana cāgaṃ ratanattayamahi ādāya sāraṃ sugatiṃ vajanti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Rañño nāṭakatthiyo matabhāvaṃ ñatvā yattha ṭhitā makuḷaṃ mocayiṃsu tatthaṃ ṭhāne katasālā makuḷamuttasālānāmajātā. Rañño sarīrasmiṃ citakaṃ āropite yattha mahājano hatthe paggahetvā viraci. Tattha katasālā viracitthasālā nāma jātā. Rañño sarīraṃ yattha jhāpesuṃ - so sīmāmālako rājamālako nāma jāto. Atha rañño kaniṭṭhabhātā saddhātissamahārājā nāma hutvā cetiye aniṭṭhataṃ jattakammaṃ sudhākammañca niṭṭhāpetvā thūpamakāsīti"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iti sādhujana manopasādanatthāya kate thūpavaṃse mahācetiye katā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". Etarahi duṭṭhagāmaṇi abhaya mahārājassa pitā kākavaṇṇatissa rājā metteyyassa bhagavato pitā bhavissati. Vihāramahādevī mātā bhavissati. Duṭṭhagāmiṇi abhayo aggasāvako bhavissati. Kaniṭṭho dutiya sāvako bhavisasati. Rañño pitucchā anuḷādevī aggamahesī bhavissati. Rañño putto sāli rājakumāro putto bhavissati. Bhaṇḍāgārika saṅghāmacco aggupaṭṭhāko bhavissati tassāmaccassa dhītā aggupaṭṭhāyikā bhavissatīti evaṃ sabbepi katādhikārā hetu sampannā tassa bhagavato dhammaṃ sutvā dukkhassantaṃ karitvā anupādisesāya nibbānadhātuyā parinibbāyissantīti."
    ],
    "innerText": "26. Etarahi duṭṭhagāmaṇi abhaya mahārājassa pitā kākavaṇṇatissa rājā metteyyassa bhagavato pitā bhavissati. Vihāramahādevī mātā bhavissati. Duṭṭhagāmiṇi abhayo aggasāvako bhavissati. Kaniṭṭho dutiya sāvako bhavisasati. Rañño pitucchā anuḷādevī aggamahesī bhavissati. Rañño putto sāli rājakumāro putto bhavissati. Bhaṇḍāgārika saṅghāmacco aggupaṭṭhāko bhavissati tassāmaccassa dhītā aggupaṭṭhāyikā bhavissatīti evaṃ sabbepi katādhikārā hetu sampannā tassa bhagavato dhammaṃ sutvā dukkhassantaṃ karitvā anupādisesāya nibbānadhātuyā parinibbāyissantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettāvatā ca"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      "."
    ],
    "innerText": "27."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mahiṇdasena nāmamhi vasanto pariveṇake,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pattacīvarapādo? Yo piṭakattaya pārago;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Saddhāsilaguṇupeto sabbasattahite rato,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tena sādhu samajjhiṭṭho yamahaṃ kātumārabhiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sodāni niṭṭhaṃ sampatto thūpavaṃso anākulo,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paripuṇṇo saṅkhathā sādhu paṇḍitehi pasaṃsito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Yaṃ ",
      " pattaṃ kusalaṃ kammaṃ karontena imaṃ mayaṃ,"
    ],
    "innerText": "Yaṃ pattaṃ kusalaṃ kammaṃ karontena imaṃ mayaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tena etena puññena sattā gacchantu nibbutiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Anantarāyena yathā ca siddhiṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Mūpāgato thūpavarassa vaṃso,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tatheva saddhammasitā janānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mano rathā sīghamupentu siddhiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Parisambhidāmaggassa yena līlattha dīpani"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ṭīkā viracitā sādhu saddhammodaya kāminā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tathā pakaraṇe saccasaṅkhepe atthadīpanā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhīmatā sukatā yena suṭṭhu sīhaḷa bhāsato"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Visuddhimagga saṅkhepe yena atthappakāsanā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yogī namupakārāya katā sīhaḷabhāsato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Parakkama nariṇdassa sabbabhūpāna ketuno,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammāgāre niyutto yo piṭakattaya pārago;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sāsanaṃ suṭṭhitaṃ yassa antevāsika bhikkhusu,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tena vācissaratthera pādena likhito ayanti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Thūpavaṃso niṭṭhito."
  }
]