[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Thūpasādhana lābhakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". Atha rājā thūpatthāya uppannāni suvaṇṇādīni āharāpetvā bhaṇḍāgāresu rāsiṃ kāresi tato sabbasambhāre samatte visākha puṇṇamuposathadivase patta visākha nakkhatte mahāthūpakaraṇatthāya bhūmiparikammaṃ ārabhi. Rājā thupaṭṭhāne patiṭṭhāpitaṃ silāthūpaṃ harāpetvā thirabhāvatthāya samantato hatthipākāra pariyantaṃ gambhīrato sataratanappamāṇaṃ bhūmiṃ khanāpetvā paṃsuṃ apanetvā ",
      " yodhehi guḷapāsāṇe attharāpetvā kammārakūṭehi āhanāpetvā cuṇṇavicuṇṇe kāresi."
    ],
    "innerText": "20. Atha rājā thūpatthāya uppannāni suvaṇṇādīni āharāpetvā bhaṇḍāgāresu rāsiṃ kāresi tato sabbasambhāre samatte visākha puṇṇamuposathadivase patta visākha nakkhatte mahāthūpakaraṇatthāya bhūmiparikammaṃ ārabhi. Rājā thupaṭṭhāne patiṭṭhāpitaṃ silāthūpaṃ harāpetvā thirabhāvatthāya samantato hatthipākāra pariyantaṃ gambhīrato sataratanappamāṇaṃ bhūmiṃ khanāpetvā paṃsuṃ apanetvā yodhehi guḷapāsāṇe attharāpetvā kammārakūṭehi āhanāpetvā cuṇṇavicuṇṇe kāresi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato cammavinaddhehi pādehi mahā hatthīhi maddāpetvā pāsāṇakoṭṭimassupari navanīta mattikaṃ attharāpesi. Ākāsa gaṅgāyahi tipatitaṭṭhāne udakabindūni uggantvā samantā tiṃsa yojanappamāṇapadese patanti yattha sayañjātasālī uppajjatti taṃ ṭhānaṃ niccameva tintattā nintasīsakoḷaṃ nāma chātaṃ. Tattha mattikā sukhumuttā navanīta mattikāti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Taṃ tato khīṇasavā sāmaṇerā āharanti tāya sabbattha mattikākiccanti ñātabbaṃ. Mattikopari iṭṭhakā attharāpesi. Iṭṭhakopari kharasukammaṃ, tassoparikuruviṇdapāsāṇaṃ, tassopariayojālaṃ, tassopari khīṇāsava sāmaṇerehi himavantato āhaṭaṃ sugaṇdhamārumbaṃ, tassopari khīrapāsāṇaṃ, tassopari eḷikapāsāṇaṃ, tassopari sīlaṃ attharāpesi. Sabbamattikākicce navanītamattikā eva ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Silāsatthāropari rasodaka santintena kapittha niyyāsena aṭṭhaṅgulabahalatambalohapaṭṭaṃ, tassopari tilatelayantintāya manosilāya sattaṅgula bahalaṃ rajatapaṭṭaṃ attharāpesi evaṃ rājā sabbākārena bhūmiparikammaṃ kārāpetvā āsāḷahi sukkapakkhassa cātuddasa divase bhikkhusaṅghā sannipātetvā evamāha. Sve puṇṇamuposathadivase uttarāsāḷha nakkhattena mahācetiye maṅgaliṭṭhakaṃ patiṭṭhāpessāmi sve thūpūṭṭhāne sabbo saṅgho santipatatūti nagare bheriṃ carāpesi mahājano uposathiko hutvā gaṇdhamālādīni gahetvā thūpaṭṭhāne sannipatatūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato visākhasiri devanāmake dve amacce āṇāpesi. Tumhe gantvā mahā cetiyaṭṭhānaṃ alaṅkarothāti. Te gantvā samantato rajatapaṭṭavaṇṇavālukaṃ okīrāpetvā lājapañcamakāni pupphāni vikiritvā kadalitoraṇaṃ ussāpetvā puṇṇaghaṭe ṭhapāpetvā maṇivaṇṇe veḷumhi pañcapaṇṇadhajaṃ baṇdhāpetvā gaṇdhasampannāni nānāvidha kusumānisaṇtharāpetvā nānāppakārehi taṃ ṭhānaṃ alaṅkariṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha rājā sakalanagarañca vihāragāmi maggañca alaṅkārāpesi pabhātāya rattiyā nagare catusu dvāresu massu kammatthāya nahāpite, nahāpanatthāyanahāpanake, alaṅkāratthāya kappakeva nānāvirāga vattha gaṇdhamālādīni ca sūpavyañjana sampannāni madhurabhattāni ca ṭhapāpetvā sabbe nagarā ca jānapadā ca yathāruciṃ massūkammaṃ kāretvā nahātvā bhuñjitvā vatthābharaṇādīhi alaṅkaritvā mahācetiyaṭṭhānaṃ āgacchantūti āyuttakehi ārocāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sayampi ",
      " sabbābharaṇa vibhūsito cattālīsa purisa sahassehi saddhiṃ uposako hutvā anekehi sumaṇḍita pasādhitehi amaccehi gahitārakkho alaṅkatāhi devakañña pamāhi nāṭakitthihi parivuto amaragaṇa parivuto devarājā viya attano sirisampattihā mahājanaṃ tosayanto anekehi turiya saṅghuṭṭhehi vattamānehi aparaṇhe mahāthūpaṭṭhānaṃ upagañji. Mahā cetiyaṭṭhāna maṅgalatthāya puṭabaddhāni vatthāni aṭṭhuttara sahassaṃ ṭhapāpesi. Catusu passesu vattharāsiṃ kāresi tela-madhu-sakkara-phāṇitādīni ca ṭhapāpesi."
    ],
    "innerText": "Sayampi sabbābharaṇa vibhūsito cattālīsa purisa sahassehi saddhiṃ uposako hutvā anekehi sumaṇḍita pasādhitehi amaccehi gahitārakkho alaṅkatāhi devakañña pamāhi nāṭakitthihi parivuto amaragaṇa parivuto devarājā viya attano sirisampattihā mahājanaṃ tosayanto anekehi turiya saṅghuṭṭhehi vattamānehi aparaṇhe mahāthūpaṭṭhānaṃ upagañji. Mahā cetiyaṭṭhāna maṅgalatthāya puṭabaddhāni vatthāni aṭṭhuttara sahassaṃ ṭhapāpesi. Catusu passesu vattharāsiṃ kāresi tela-madhu-sakkara-phāṇitādīni ca ṭhapāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha nānādesato bahū bhikkhū āgamiṃsu rājagahā samantā iṇdiguttatthero nāma asīti bhikkhusahassāni gahetvā ākāsenāgañchi tathā bārāṇasiyaṃ isipatane mahā vihārato dhammasenatthero nāma dvādasa bhikkhusahassāni. Sāvatthiyaṃ jetavana vihārato piyadassi nāma thero saṭṭhi bhikkhu sahassāni vesāliyaṃ mahā vanato buddharakkhitatthero aṭṭhārasa bhikkhu sahassāni, kosambiyaṃ ghositārāmato mahādhammarakkhitatthero tiṃsa bhikkhusahassāni. Ujjeniyaṃ dakkhiṇagiri mahā vihārato dhammarakkhitatthero cattālīsa bhikkhusahassāni-pāṭaliputte asokārāmato mittiṇṇatthero bhikkhūnaṃ satasahassāni saṭṭhiñca sahassāni gaṇdhāra raṭṭhato attinna thero nāma bhikkhūnaṃ dve satasahassāni asītiñca sahassāni. Mahāpallava bhogato mahādevatthero bhikkhūnaṃ cattāri satasahassāni saṭṭhiñca sahassāni yonakaraṭṭhe alasaṇdā nagarato yonaka dhammarakkhitatthero tiṃsa bhikkhu sahassāni. Viñjhāṭavivattaniya senāsanato uttaratthero asīti bhikkhusahassāni. Mahābodhimaṇḍa vihārato cittaguttatthero tiṃsa bhikkhusahassāni vanavāsibhogato caṇdaguttatthero asīti bhikkhusahassāni. Kelāsa mahāvihārato suribhaguttatthero channavuti sahassāni gahetvā ākāsenāgañchi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Bhikkhūnaṃ dīpavāsīnaṃ-āgatānañca sabbaso,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gaṇanāya paricchedo-porāṇehi na bhāsito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Samāgatānaṃ bhikkhūnaṃ-sabbesaṃ taṃ samāgame,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vuttā khīṇāsavāyeva-te channavuti koṭiyo;’’"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha saṅgho parikkhitta pavāḷavedikā viya majjhe rañño okāse ṭhapetvā aññamaññaṃ aghaṭṭetvā aṭṭhāsi. Pācinapasse buddharakkhitanāmako khīṇāsāvatthero attanāsadisanāmake pañcasatakhīṇāsave gahetvā aṭṭhāsi. Tathā dakkhiṇapasse pacchimapasse uttarapasse ",
      " ca dhammarakkhita - saṅgharakkhita - ānaṇda nāmakā khīṇāsavattherā attanā sadisanāmake pañcapañcasata khīṇāsave gahetvā aṭṭhaṃsu piyadassi nāma khīṇāsavatthero mahābhikkhusaṅghaṃ gahetvā pubbuttara kaṇṇe aṭṭhāsi."
    ],
    "innerText": "Atha saṅgho parikkhitta pavāḷavedikā viya majjhe rañño okāse ṭhapetvā aññamaññaṃ aghaṭṭetvā aṭṭhāsi. Pācinapasse buddharakkhitanāmako khīṇāsāvatthero attanāsadisanāmake pañcasatakhīṇāsave gahetvā aṭṭhāsi. Tathā dakkhiṇapasse pacchimapasse uttarapasse ca dhammarakkhita - saṅgharakkhita - ānaṇda nāmakā khīṇāsavattherā attanā sadisanāmake pañcapañcasata khīṇāsave gahetvā aṭṭhaṃsu piyadassi nāma khīṇāsavatthero mahābhikkhusaṅghaṃ gahetvā pubbuttara kaṇṇe aṭṭhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Rājā kira saṅghamajjhaṃ pavisantoyeva sace mayā kayiramānaṃ cetiyakammaṃ anantarāyena niṭṭhaṃ gacchati pācina-dakkhiṇa-pacchima-uttarapassesu buddharakkhita-cammarakkhita-saṅgharakkhita-ānaṇda nāmakā therā attanāsadisanāmake pañcapañcasatabhikkhu gahetvā tiṭṭhantu piyadassi nāma thero pubbuttarakaṇṇe bhikkhusaṅghaṃ gahetvā tiṭṭhatūti cintesi. Therāpi rañño adhippāyaṃ ñatvā tathā ṭhitāti vadantī siddhatthero pana maṅgalo-sumano-padumo-sīvali-caṇdagutto-sūriyagutto-iṇdagu- tto-sāgaro-cittaseno -jayaseno-acaloti imehi ekādasahi therehi parivuto puṇṇaghaṭe pūrato katvā puratthābhimukho aṭṭhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha rājā tathā ṭhitaṃ bhikkhusaṅghaṃ disvā pasannacitto gaṇdhamālādīhi pūjetvā padakkhiṇaṃ katvā catūsu ṭhānesu vanditvā puṇṇasaṭaṭṭhānaṃ pavisitvā suyaṇṇakhīle paṭimukkaṃrajatamayaṃ paribbhamana daṇḍaṃ vijjamānamātāpitūnaṃ ubhato sujātena sumaṇḍita pasādhitena abhimaṅgala sammatena amaccaputtena gāhāpetvā mahantaṃ cetiyāvaṭṭaṃ kāretuṃ ārabhi. Tathā kārentaṃ pana siddhatthatthero nivāresi. Evaṃ kirassa ahosi - yadi mahārājā mahantaṃ cetiyaṃ karoti, aniṭṭhiteyeva marissati anāgate dupparihariyañca bhavissatīti. Tasmiṃ khaṇe bhikkhusaṅgho mahā rāja thero pāṇḍito, therassa vacanaṃ kātuṃ vaṭṭatīti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Rājā bhikkhusaṅghassa adhippāyaṃ ñatvā thero karotīti maññamāno kīdisaṃ bhante pamāṇaṃ karomīti āha. Thero mama gatagataṭṭhānato cetiyāvaṭṭaṃ karohīti vatvā upadisanto āvijjhitvā agamāsi. Rājā therassa vuttanayena cetiyāvaṭṭaṃ kāretvā theraṃ upasaṅkamitvā nāmaṃ pucchitvā gaṇdhamālādīhi pūjetvā vambatvā parivāretvā ṭhite sesa ekādasa there ca upasaṅkamitvā pūjetvā vaṇditvā tesaṃ nāmāni ca pucchitvā paribbhamana daṇḍagāhakassa amacca puttassa tāma pucchi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ahaṃ deva suppatiṭṭhita brahmā nāmāti vutte tava pitā kiṃ nāmoti pucchitvāna naṇdiseno nāmāti vutte mātunāmaṃ pucchi. Sumanādevī nāmāti vutte sabbesaṃ nāmāni abhimaṅgalasammatāni, mayā kayaramānaṃ cetiyakammaṃ avassaṃ niṭṭhānaṃ gacchatiti haṭṭho ahosi, tato rājā majjhe aṭṭha suvaṇṇaghaṭe ",
      " rajataghaṭe ca ṭhapāpetvā te parivāretvā aṭṭhuttarasayassa puṇṇaghaṭe ṭhapāpesi."
    ],
    "innerText": "Ahaṃ deva suppatiṭṭhita brahmā nāmāti vutte tava pitā kiṃ nāmoti pucchitvāna naṇdiseno nāmāti vutte mātunāmaṃ pucchi. Sumanādevī nāmāti vutte sabbesaṃ nāmāni abhimaṅgalasammatāni, mayā kayaramānaṃ cetiyakammaṃ avassaṃ niṭṭhānaṃ gacchatiti haṭṭho ahosi, tato rājā majjhe aṭṭha suvaṇṇaghaṭe rajataghaṭe ca ṭhapāpetvā te parivāretvā aṭṭhuttarasayassa puṇṇaghaṭe ṭhapāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha aṭṭha suvaṇṇiṭṭhakā ṭhapāpesi. Tāsu ekekaṃ parivāretvā aṭṭhuttarasata aṭṭhuttarasata rajatiṭṭhakāyo. Aṭṭhuttarasata aṭṭhuttarasata vatthāni ca ṭhapāpesi. Atha suppatiṭṭhita brahmanāmena amaccaputtena ekaṃ suvaṇṇiṭṭhakaṃ gāhāpetvā tena sadisa nāmehi ca jīvamānaka mātāpitūhi sattahi amaccaputtehi sesa sattiṭṭhakāyo gāhāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmiṃ khaṇe mittatthero nāma puratthima disābhāge paribbhamita lekhāya bhūmiyaṃ gaṇdhapiṇḍaṃ ṭhapesi. Jayasenatthero nāma udakaṃ āsiñcitvā santintetvā samaṃ akāsi. Suppatiṭṭhitabrahmā bhadda nakkhattena evaṃ nānāvidha maṅgalānisaṅkhaṭaṭṭhāne paṭhamaṃ maṅgalikaṭṭhakaṃ patiṭṭhāpesi. Sumanattheronāma jātisumanapupphehi taṃ pūjesi. Tasmiṃ khaṇe udakapariyantaṃ katvā mahāpathavi kampo ahosi. Eteneva nayena sesa sattiṭṭhakāyopi patiṭṭhāpesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato rājā rajatiṭṭhakāyopi patiṭṭhāpetvā gaṇdhamālādīhi pūjetvā maṅgalavidhānaṃ niṭṭhāpetvā suvaṇṇapelāyapupphāni gāhāpetvā pācīnapasse bhikkhusaṅghassa purato ṭhitaṃ mahā buddharakkhitattheraṃ upasaṅkamitvā gaṇdhamālādīhi pūjetvā vaṇditvā therassa parivāretvā ṭhita bhikkhūnañca nāmāni pucchitvā tato dakkhiṇapasse ṭhitaṃ mahādhammarakkhitattheraṃ pacchimapasse ṭhitaṃ mahāsaṅgharakkhitattheraṃ uttarapasse ṭhitaṃ ānaṇdattherañca upasaṅkamitvā gaṇdhamālādīhi pūjetvā pañcapatiṭṭhitena vaṇditvā tatheva nāmāni pucchitvā pubbuttara kaṇṇaṃ gantvā tattha ṭhitaṃ piyadassi mahātheraṃ vaṇditvā pūjetvā nāmāni pucchitvā santike aṭṭhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Thero maṅgalaṃ vaḍḍhento rañño dhammaṃ desesi. Maṅgalapariyosāne sampatta gihiparisāsu cattālīsa sahassāni arahanto patiṭṭhahiṃsu. Cattālīsa sahassāni sotāpattiphalo sahassaṃ sakadāgāmiphale, sahassaṃ anāgāmiphale, bhikkhūnaṃ pana aṭṭhārasasahassāni arahattaṃ pāpuṇiṃsu. Bhikkhunīnaṃ catuddasa sahassānīti."
  }
]