[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "6. Pāsādikasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "164"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sakkesu viharati vedhaññā nāma sakyā, tesaṃ ambavane pāsāde."
    ],
    "innerText": "164. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sakkesu viharati vedhaññā nāma sakyā, tesaṃ ambavane pāsāde."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nigaṇṭhanāṭaputtakālaṅkiriyā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena nigaṇṭho nāṭaputto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nāthaputto (sī. pī.)]"
      },
      " pāvāyaṃ adhunākālaṅkato hoti. Tassa kālaṅkiriyāya bhinnā nigaṇṭhā dvedhikajātā bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti – ‘‘na tvaṃ imaṃ dhammavinayaṃ ājānāsi, ahaṃ imaṃ dhammavinayaṃ ājānāmi, kiṃ tvaṃ imaṃ dhammavinayaṃ ājānissasi? Micchāpaṭipanno tvamasi, ahamasmi sammāpaṭipanno. Sahitaṃ me, asahitaṃ te. Purevacanīyaṃ pacchā avaca, pacchāvacanīyaṃ pure avaca. Adhiciṇṇaṃ te viparāvattaṃ, āropito te vādo, niggahito tvamasi, cara vādappamokkhāya, nibbeṭhehi vā sace pahosī’’ti. Vadhoyeva kho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vadhoyeveko (ka.)]"
      },
      " maññe nigaṇṭhesu nāṭaputtiyesu vattati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anuvattati (syā. ka.)]"
      },
      ". Yepi nigaṇṭhassa nāṭaputtassa sāvakā gihī odātavasanā ",
      ", tepi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[te tesu (ka.)]"
      },
      " nigaṇṭhesu nāṭaputtiyesu nibbinnarūpā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nibbindarūpā (ka.)]"
      },
      " virattarūpā paṭivānarūpā, yathā taṃ durakkhāte dhammavinaye duppavedite aniyyānike anupasamasaṃvattanike asammāsambuddhappavedite bhinnathūpe appaṭisaraṇe."
    ],
    "innerText": "Tena kho pana samayena nigaṇṭho nāṭaputto [nāthaputto (sī. pī.)] pāvāyaṃ adhunākālaṅkato hoti. Tassa kālaṅkiriyāya bhinnā nigaṇṭhā dvedhikajātā bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti – ‘‘na tvaṃ imaṃ dhammavinayaṃ ājānāsi, ahaṃ imaṃ dhammavinayaṃ ājānāmi, kiṃ tvaṃ imaṃ dhammavinayaṃ ājānissasi? Micchāpaṭipanno tvamasi, ahamasmi sammāpaṭipanno. Sahitaṃ me, asahitaṃ te. Purevacanīyaṃ pacchā avaca, pacchāvacanīyaṃ pure avaca. Adhiciṇṇaṃ te viparāvattaṃ, āropito te vādo, niggahito tvamasi, cara vādappamokkhāya, nibbeṭhehi vā sace pahosī’’ti. Vadhoyeva kho [vadhoyeveko (ka.)] maññe nigaṇṭhesu nāṭaputtiyesu vattati [anuvattati (syā. ka.)]. Yepi nigaṇṭhassa nāṭaputtassa sāvakā gihī odātavasanā , tepi [te tesu (ka.)] nigaṇṭhesu nāṭaputtiyesu nibbinnarūpā [nibbindarūpā (ka.)] virattarūpā paṭivānarūpā, yathā taṃ durakkhāte dhammavinaye duppavedite aniyyānike anupasamasaṃvattanike asammāsambuddhappavedite bhinnathūpe appaṭisaraṇe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "165"
      },
      ". Atha kho cundo samaṇuddeso pāvāyaṃ vassaṃvuṭṭho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vassaṃvuttho (sī. syā. pī.)]"
      },
      " yena sāmagāmo, yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno ",
      " kho cundo samaṇuddeso āyasmantaṃ ānandaṃ etadavoca – ‘‘nigaṇṭho, bhante, nāṭaputto pāvāyaṃ adhunākālaṅkato. Tassa kālaṅkiriyāya bhinnā nigaṇṭhā dvedhikajātā…pe… bhinnathūpe appaṭisaraṇe’’ti."
    ],
    "innerText": "165. Atha kho cundo samaṇuddeso pāvāyaṃ vassaṃvuṭṭho [vassaṃvuttho (sī. syā. pī.)] yena sāmagāmo, yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho cundo samaṇuddeso āyasmantaṃ ānandaṃ etadavoca – ‘‘nigaṇṭho, bhante, nāṭaputto pāvāyaṃ adhunākālaṅkato. Tassa kālaṅkiriyāya bhinnā nigaṇṭhā dvedhikajātā…pe… bhinnathūpe appaṭisaraṇe’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " vutte, āyasmā ānando cundaṃ samaṇuddesaṃ etadavoca – ‘‘atthi kho idaṃ, āvuso cunda, kathāpābhataṃ bhagavantaṃ dassanāya. Āyāmāvuso ",
      " cunda, yena bhagavā tenupasaṅkamissāma; upasaṅkamitvā etamatthaṃ bhagavato ārocessāmā’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āroceyyāmāti (syā.)]"
      },
      ". ‘‘Evaṃ, bhante’’ti kho cundo samaṇuddeso āyasmato ānandassa paccassosi."
    ],
    "innerText": "Evaṃ vutte, āyasmā ānando cundaṃ samaṇuddesaṃ etadavoca – ‘‘atthi kho idaṃ, āvuso cunda, kathāpābhataṃ bhagavantaṃ dassanāya. Āyāmāvuso cunda, yena bhagavā tenupasaṅkamissāma; upasaṅkamitvā etamatthaṃ bhagavato ārocessāmā’’ti [āroceyyāmāti (syā.)]. ‘‘Evaṃ, bhante’’ti kho cundo samaṇuddeso āyasmato ānandassa paccassosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho āyasmā ca ānando cundo ca samaṇuddeso yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘ayaṃ, bhante, cundo samaṇuddeso evamāha, ‘nigaṇṭho, bhante, nāṭaputto pāvāyaṃ adhunākālaṅkato, tassa kālaṅkiriyāya bhinnā nigaṇṭhā…pe… bhinnathūpe appaṭisaraṇe’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Asammāsambuddhappaveditadhammavinayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "166"
      },
      ". ‘‘Evaṃ hetaṃ, cunda, hoti durakkhāte dhammavinaye duppavedite ",
      " aniyyānike anupasamasaṃvattanike asammāsambuddhappavedite. Idha, cunda, satthā ca hoti asammāsambuddho, dhammo ca durakkhāto duppavedito aniyyāniko anupasamasaṃvattaniko asammāsambuddhappavedito, sāvako ca tasmiṃ dhamme na dhammānudhammappaṭipanno viharati na sāmīcippaṭipanno na anudhammacārī, vokkamma ca tamhā dhammā vattati. So ",
      " evamassa vacanīyo – ‘tassa te, āvuso, lābhā, tassa te suladdhaṃ, satthā ca te asammāsambuddho, dhammo ca durakkhāto duppavedito aniyyāniko anupasamasaṃvattaniko asammāsambuddhappavedito. Tvañca tasmiṃ dhamme na dhammānudhammappaṭipanno viharasi, na sāmīcippaṭipanno, na anudhammacārī, vokkamma ca tamhā dhammā vattasī’ti. Iti kho, cunda, satthāpi tattha gārayho, dhammopi tattha gārayho, sāvako ca tattha evaṃ pāsaṃso. Yo kho, cunda, evarūpaṃ sāvakaṃ evaṃ vadeyya – ‘etāyasmā tathā paṭipajjatu, yathā te satthārā dhammo desito paññatto’ti. Yo ca samādapeti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samādāpeti (sī. ṭṭha.)]"
      },
      ", yañca samādapeti, yo ca samādapito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samādāpito (sī. ṭṭha.)]"
      },
      " tathattāya paṭipajjati. Sabbe te bahuṃ apuññaṃ pasavanti. Taṃ kissa hetu? Evaṃ hetaṃ, cunda, hoti durakkhāte dhammavinaye duppavedite aniyyānike anupasamasaṃvattanike asammāsambuddhappavedite."
    ],
    "innerText": "166. ‘‘Evaṃ hetaṃ, cunda, hoti durakkhāte dhammavinaye duppavedite aniyyānike anupasamasaṃvattanike asammāsambuddhappavedite. Idha, cunda, satthā ca hoti asammāsambuddho, dhammo ca durakkhāto duppavedito aniyyāniko anupasamasaṃvattaniko asammāsambuddhappavedito, sāvako ca tasmiṃ dhamme na dhammānudhammappaṭipanno viharati na sāmīcippaṭipanno na anudhammacārī, vokkamma ca tamhā dhammā vattati. So evamassa vacanīyo – ‘tassa te, āvuso, lābhā, tassa te suladdhaṃ, satthā ca te asammāsambuddho, dhammo ca durakkhāto duppavedito aniyyāniko anupasamasaṃvattaniko asammāsambuddhappavedito. Tvañca tasmiṃ dhamme na dhammānudhammappaṭipanno viharasi, na sāmīcippaṭipanno, na anudhammacārī, vokkamma ca tamhā dhammā vattasī’ti. Iti kho, cunda, satthāpi tattha gārayho, dhammopi tattha gārayho, sāvako ca tattha evaṃ pāsaṃso. Yo kho, cunda, evarūpaṃ sāvakaṃ evaṃ vadeyya – ‘etāyasmā tathā paṭipajjatu, yathā te satthārā dhammo desito paññatto’ti. Yo ca samādapeti [samādāpeti (sī. ṭṭha.)], yañca samādapeti, yo ca samādapito [samādāpito (sī. ṭṭha.)] tathattāya paṭipajjati. Sabbe te bahuṃ apuññaṃ pasavanti. Taṃ kissa hetu? Evaṃ hetaṃ, cunda, hoti durakkhāte dhammavinaye duppavedite aniyyānike anupasamasaṃvattanike asammāsambuddhappavedite."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "167"
      },
      ". ‘‘Idha ",
      " pana, cunda, satthā ca hoti asammāsambuddho, dhammo ca durakkhāto duppavedito aniyyāniko anupasamasaṃvattaniko asammāsambuddhappavedito, sāvako ca tasmiṃ dhamme ",
      " dhammānudhammappaṭipanno viharati sāmīcippaṭipanno anudhammacārī, samādāya taṃ dhammaṃ vattati. So evamassa vacanīyo – ‘tassa te, āvuso, alābhā, tassa te dulladdhaṃ, satthā ca te asammāsambuddho ",
      ", dhammo ca durakkhāto duppavedito aniyyāniko anupasamasaṃvattaniko asammāsambuddhappavedito. Tvañca ",
      " tasmiṃ dhamme dhammānudhammappaṭipanno viharasi sāmīcippaṭipanno anudhammacārī, samādāya taṃ dhammaṃ vattasī’ti. Iti kho, cunda, satthāpi tattha gārayho, dhammopi tattha gārayho, sāvakopi tattha evaṃ gārayho. Yo kho, cunda, evarūpaṃ sāvakaṃ evaṃ vadeyya – ‘addhāyasmā ñāyappaṭipanno ñāyamārādhessatī’ti. Yo ca pasaṃsati, yañca pasaṃsati, yo ca pasaṃsito bhiyyoso mattāya vīriyaṃ ārabhati. Sabbe te bahuṃ apuññaṃ pasavanti. Taṃ kissa hetu? Evañhetaṃ, cunda, hoti durakkhāte dhammavinaye duppavedite aniyyānike anupasamasaṃvattanike asammāsambuddhappavedite."
    ],
    "innerText": "167. ‘‘Idha pana, cunda, satthā ca hoti asammāsambuddho, dhammo ca durakkhāto duppavedito aniyyāniko anupasamasaṃvattaniko asammāsambuddhappavedito, sāvako ca tasmiṃ dhamme dhammānudhammappaṭipanno viharati sāmīcippaṭipanno anudhammacārī, samādāya taṃ dhammaṃ vattati. So evamassa vacanīyo – ‘tassa te, āvuso, alābhā, tassa te dulladdhaṃ, satthā ca te asammāsambuddho , dhammo ca durakkhāto duppavedito aniyyāniko anupasamasaṃvattaniko asammāsambuddhappavedito. Tvañca tasmiṃ dhamme dhammānudhammappaṭipanno viharasi sāmīcippaṭipanno anudhammacārī, samādāya taṃ dhammaṃ vattasī’ti. Iti kho, cunda, satthāpi tattha gārayho, dhammopi tattha gārayho, sāvakopi tattha evaṃ gārayho. Yo kho, cunda, evarūpaṃ sāvakaṃ evaṃ vadeyya – ‘addhāyasmā ñāyappaṭipanno ñāyamārādhessatī’ti. Yo ca pasaṃsati, yañca pasaṃsati, yo ca pasaṃsito bhiyyoso mattāya vīriyaṃ ārabhati. Sabbe te bahuṃ apuññaṃ pasavanti. Taṃ kissa hetu? Evañhetaṃ, cunda, hoti durakkhāte dhammavinaye duppavedite aniyyānike anupasamasaṃvattanike asammāsambuddhappavedite."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sammāsambuddhappaveditadhammavinayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "168"
      },
      ". ‘‘Idha pana, cunda, satthā ca hoti sammāsambuddho, dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito, sāvako ca tasmiṃ dhamme na dhammānudhammappaṭipanno viharati, na sāmīcippaṭipanno, na anudhammacārī, vokkamma ca tamhā dhammā vattati. So evamassa vacanīyo – ‘tassa te, āvuso, alābhā, tassa te dulladdhaṃ, satthā ca te sammāsambuddho, dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito. Tvañca tasmiṃ dhamme na dhammānudhammappaṭipanno viharasi, na sāmīcippaṭipanno, na anudhammacārī, vokkamma ca tamhā dhammā vattasī’ti. Iti kho, cunda, satthāpi tattha pāsaṃso, dhammopi tattha pāsaṃso, sāvako ca tattha evaṃ gārayho. Yo kho, cunda, evarūpaṃ ",
      " sāvakaṃ evaṃ vadeyya – ‘etāyasmā tathā paṭipajjatu yathā te satthārā dhammo desito paññatto’ti. Yo ca samādapeti, yañca samādapeti, yo ca samādapito tathattāya paṭipajjati. Sabbe te bahuṃ puññaṃ pasavanti. Taṃ kissa hetu? Evañhetaṃ ",
      ", cunda, hoti svākkhāte dhammavinaye suppavedite niyyānike upasamasaṃvattanike sammāsambuddhappavedite."
    ],
    "innerText": "168. ‘‘Idha pana, cunda, satthā ca hoti sammāsambuddho, dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito, sāvako ca tasmiṃ dhamme na dhammānudhammappaṭipanno viharati, na sāmīcippaṭipanno, na anudhammacārī, vokkamma ca tamhā dhammā vattati. So evamassa vacanīyo – ‘tassa te, āvuso, alābhā, tassa te dulladdhaṃ, satthā ca te sammāsambuddho, dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito. Tvañca tasmiṃ dhamme na dhammānudhammappaṭipanno viharasi, na sāmīcippaṭipanno, na anudhammacārī, vokkamma ca tamhā dhammā vattasī’ti. Iti kho, cunda, satthāpi tattha pāsaṃso, dhammopi tattha pāsaṃso, sāvako ca tattha evaṃ gārayho. Yo kho, cunda, evarūpaṃ sāvakaṃ evaṃ vadeyya – ‘etāyasmā tathā paṭipajjatu yathā te satthārā dhammo desito paññatto’ti. Yo ca samādapeti, yañca samādapeti, yo ca samādapito tathattāya paṭipajjati. Sabbe te bahuṃ puññaṃ pasavanti. Taṃ kissa hetu? Evañhetaṃ , cunda, hoti svākkhāte dhammavinaye suppavedite niyyānike upasamasaṃvattanike sammāsambuddhappavedite."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "169"
      },
      ". ‘‘Idha ",
      " pana, cunda, satthā ca hoti sammāsambuddho, dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito, sāvako ca tasmiṃ dhamme dhammānudhammappaṭipanno viharati sāmīcippaṭipanno anudhammacārī, samādāya taṃ dhammaṃ vattati. So evamassa vacanīyo – ‘tassa te, āvuso, lābhā, tassa te suladdhaṃ, satthā ca te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[satthā ca te arahaṃ (syā.)]"
      },
      " sammāsambuddho ",
      ", dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito. Tvañca tasmiṃ dhamme dhammānudhammappaṭipanno viharasi sāmīcippaṭipanno anudhammacārī, samādāya taṃ dhammaṃ vattasī’ti. Iti kho, cunda, satthāpi tattha pāsaṃso, dhammopi tattha pāsaṃso, sāvakopi tattha evaṃ pāsaṃso. Yo kho, cunda, evarūpaṃ sāvakaṃ evaṃ vadeyya – ‘addhāyasmā ñāyappaṭipanno ñāyamārādhessatī’ti. Yo ca pasaṃsati, yañca pasaṃsati, yo ca pasaṃsito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pasattho (syā.)]"
      },
      " bhiyyoso mattāya vīriyaṃ ārabhati. Sabbe te bahuṃ puññaṃ pasavanti. Taṃ kissa hetu? Evañhetaṃ, cunda, hoti svākkhāte ",
      " dhammavinaye suppavedite niyyānike upasamasaṃvattanike sammāsambuddhappavedite."
    ],
    "innerText": "169. ‘‘Idha pana, cunda, satthā ca hoti sammāsambuddho, dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito, sāvako ca tasmiṃ dhamme dhammānudhammappaṭipanno viharati sāmīcippaṭipanno anudhammacārī, samādāya taṃ dhammaṃ vattati. So evamassa vacanīyo – ‘tassa te, āvuso, lābhā, tassa te suladdhaṃ, satthā ca te [satthā ca te arahaṃ (syā.)] sammāsambuddho , dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito. Tvañca tasmiṃ dhamme dhammānudhammappaṭipanno viharasi sāmīcippaṭipanno anudhammacārī, samādāya taṃ dhammaṃ vattasī’ti. Iti kho, cunda, satthāpi tattha pāsaṃso, dhammopi tattha pāsaṃso, sāvakopi tattha evaṃ pāsaṃso. Yo kho, cunda, evarūpaṃ sāvakaṃ evaṃ vadeyya – ‘addhāyasmā ñāyappaṭipanno ñāyamārādhessatī’ti. Yo ca pasaṃsati, yañca pasaṃsati, yo ca pasaṃsito [pasattho (syā.)] bhiyyoso mattāya vīriyaṃ ārabhati. Sabbe te bahuṃ puññaṃ pasavanti. Taṃ kissa hetu? Evañhetaṃ, cunda, hoti svākkhāte dhammavinaye suppavedite niyyānike upasamasaṃvattanike sammāsambuddhappavedite."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sāvakānutappasatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "170"
      },
      ". ‘‘Idha pana, cunda, satthā ca loke udapādi arahaṃ sammāsambuddho, dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito, aviññāpitatthā cassa honti sāvakā saddhamme, na ca tesaṃ kevalaṃ paripūraṃ brahmacariyaṃ āvikataṃ hoti uttānīkataṃ sabbasaṅgāhapadakataṃ sappāṭihīrakataṃ ",
      " yāva devamanussehi suppakāsitaṃ. Atha nesaṃ satthuno antaradhānaṃ hoti. Evarūpo kho, cunda, satthā sāvakānaṃ kālaṅkato anutappo hoti. Taṃ kissa hetu? Satthā ca no loke udapādi arahaṃ sammāsambuddho, dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito, aviññāpitatthā camha saddhamme, na ca no kevalaṃ paripūraṃ brahmacariyaṃ āvikataṃ hoti ",
      " uttānīkataṃ sabbasaṅgāhapadakataṃ sappāṭihīrakataṃ yāva devamanussehi suppakāsitaṃ. Atha no satthuno antaradhānaṃ hotīti. Evarūpo kho, cunda, satthā sāvakānaṃ kālaṅkato anutappo hoti."
    ],
    "innerText": "170. ‘‘Idha pana, cunda, satthā ca loke udapādi arahaṃ sammāsambuddho, dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito, aviññāpitatthā cassa honti sāvakā saddhamme, na ca tesaṃ kevalaṃ paripūraṃ brahmacariyaṃ āvikataṃ hoti uttānīkataṃ sabbasaṅgāhapadakataṃ sappāṭihīrakataṃ yāva devamanussehi suppakāsitaṃ. Atha nesaṃ satthuno antaradhānaṃ hoti. Evarūpo kho, cunda, satthā sāvakānaṃ kālaṅkato anutappo hoti. Taṃ kissa hetu? Satthā ca no loke udapādi arahaṃ sammāsambuddho, dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito, aviññāpitatthā camha saddhamme, na ca no kevalaṃ paripūraṃ brahmacariyaṃ āvikataṃ hoti uttānīkataṃ sabbasaṅgāhapadakataṃ sappāṭihīrakataṃ yāva devamanussehi suppakāsitaṃ. Atha no satthuno antaradhānaṃ hotīti. Evarūpo kho, cunda, satthā sāvakānaṃ kālaṅkato anutappo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sāvakānanutappasatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "171"
      },
      ". ‘‘Idha pana, cunda, satthā ca loke udapādi arahaṃ sammāsambuddho. Dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito. Viññāpitatthā cassa honti ",
      " sāvakā saddhamme, kevalañca tesaṃ paripūraṃ brahmacariyaṃ āvikataṃ hoti uttānīkataṃ sabbasaṅgāhapadakataṃ sappāṭihīrakataṃ yāva devamanussehi suppakāsitaṃ. Atha nesaṃ satthuno antaradhānaṃ hoti. Evarūpo kho, cunda, satthā sāvakānaṃ kālaṅkato ananutappo hoti ",
      ". Taṃ kissa hetu? Satthā ca no loke udapādi arahaṃ sammāsambuddho. Dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito. Viññāpitatthā camha saddhamme, kevalañca no paripūraṃ brahmacariyaṃ āvikataṃ hoti uttānīkataṃ sabbasaṅgāhapadakataṃ sappāṭihīrakataṃ yāva devamanussehi suppakāsitaṃ ",
      ". Atha no satthuno antaradhānaṃ hotīti. Evarūpo kho, cunda, satthā sāvakānaṃ kālaṅkato ananutappo hoti."
    ],
    "innerText": "171. ‘‘Idha pana, cunda, satthā ca loke udapādi arahaṃ sammāsambuddho. Dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito. Viññāpitatthā cassa honti sāvakā saddhamme, kevalañca tesaṃ paripūraṃ brahmacariyaṃ āvikataṃ hoti uttānīkataṃ sabbasaṅgāhapadakataṃ sappāṭihīrakataṃ yāva devamanussehi suppakāsitaṃ. Atha nesaṃ satthuno antaradhānaṃ hoti. Evarūpo kho, cunda, satthā sāvakānaṃ kālaṅkato ananutappo hoti . Taṃ kissa hetu? Satthā ca no loke udapādi arahaṃ sammāsambuddho. Dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito. Viññāpitatthā camha saddhamme, kevalañca no paripūraṃ brahmacariyaṃ āvikataṃ hoti uttānīkataṃ sabbasaṅgāhapadakataṃ sappāṭihīrakataṃ yāva devamanussehi suppakāsitaṃ . Atha no satthuno antaradhānaṃ hotīti. Evarūpo kho, cunda, satthā sāvakānaṃ kālaṅkato ananutappo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Brahmacariyaaparipūrādikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "172"
      },
      ". ‘‘Etehi cepi, cunda, aṅgehi samannāgataṃ brahmacariyaṃ hoti, no ca kho satthā hoti thero rattaññū cirapabbajito addhagato vayoanuppatto. Evaṃ taṃ brahmacariyaṃ aparipūraṃ hoti tenaṅgena."
    ],
    "innerText": "172. ‘‘Etehi cepi, cunda, aṅgehi samannāgataṃ brahmacariyaṃ hoti, no ca kho satthā hoti thero rattaññū cirapabbajito addhagato vayoanuppatto. Evaṃ taṃ brahmacariyaṃ aparipūraṃ hoti tenaṅgena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yato ca kho, cunda, etehi ceva aṅgehi samannāgataṃ brahmacariyaṃ hoti, satthā ca hoti thero rattaññū cirapabbajito addhagato vayoanuppatto. Evaṃ taṃ brahmacariyaṃ paripūraṃ hoti tenaṅgena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "173"
      },
      ". ‘‘Etehi cepi, cunda, aṅgehi samannāgataṃ brahmacariyaṃ hoti, satthā ca hoti thero rattaññū cirapabbajito addhagato vayoanuppatto ",
      ", no ca khvassa therā bhikkhū sāvakā honti viyattā vinītā visāradā pattayogakkhemā. Alaṃ samakkhātuṃ saddhammassa, alaṃ uppannaṃ ",
      " parappavādaṃ sahadhammehi suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desetuṃ. Evaṃ taṃ brahmacariyaṃ aparipūraṃ hoti tenaṅgena."
    ],
    "innerText": "173. ‘‘Etehi cepi, cunda, aṅgehi samannāgataṃ brahmacariyaṃ hoti, satthā ca hoti thero rattaññū cirapabbajito addhagato vayoanuppatto , no ca khvassa therā bhikkhū sāvakā honti viyattā vinītā visāradā pattayogakkhemā. Alaṃ samakkhātuṃ saddhammassa, alaṃ uppannaṃ parappavādaṃ sahadhammehi suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desetuṃ. Evaṃ taṃ brahmacariyaṃ aparipūraṃ hoti tenaṅgena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yato ca kho, cunda, etehi ceva aṅgehi samannāgataṃ brahmacariyaṃ hoti, satthā ca hoti thero rattaññū cirapabbajito addhagato vayoanuppatto, therā cassa bhikkhū sāvakā honti viyattā vinītā visāradā pattayogakkhemā. Alaṃ samakkhātuṃ saddhammassa, alaṃ uppannaṃ parappavādaṃ sahadhammehi suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desetuṃ. Evaṃ taṃ brahmacariyaṃ paripūraṃ hoti tenaṅgena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "174"
      },
      ". ‘‘Etehi cepi, cunda, aṅgehi samannāgataṃ brahmacariyaṃ hoti, satthā ca hoti thero rattaññū cirapabbajito addhagato vayoanuppatto, therā cassa bhikkhū sāvakā honti viyattā ",
      " vinītā visāradā pattayogakkhemā. Alaṃ samakkhātuṃ saddhammassa, alaṃ uppannaṃ parappavādaṃ sahadhammehi suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desetuṃ. No ca khvassa majjhimā bhikkhū sāvakā honti…pe… majjhimā cassa bhikkhū sāvakā honti, no ca khvassa navā bhikkhū sāvakā honti…pe… navā cassa bhikkhū sāvakā honti, no ca khvassa therā bhikkhuniyo sāvikā honti…pe… therā cassa bhikkhuniyo sāvikā honti, no ca khvassa majjhimā ",
      " bhikkhuniyo sāvikā honti…pe… majjhimā cassa bhikkhuniyo sāvikā honti ",
      ", no ca khvassa navā bhikkhuniyo sāvikā honti…pe… navā cassa bhikkhuniyo sāvikā honti, no ca khvassa upāsakā sāvakā honti gihī odātavasanā brahmacārino…pe… upāsakā cassa sāvakā honti gihī odātavasanā brahmacārino, no ca khvassa upāsakā sāvakā honti gihī odātavasanā kāmabhogino…pe… upāsakā cassa sāvakā honti gihī odātavasanā kāmabhogino, no ca khvassa upāsikā sāvikā honti gihiniyo odātavasanā brahmacāriniyo…pe… upāsikā cassa sāvikā honti gihiniyo odātavasanā brahmacāriniyo, no ca khvassa upāsikā sāvikā honti gihiniyo odātavasanā kāmabhoginiyo…pe… upāsikā cassa sāvikā honti gihiniyo odātavasanā kāmabhoginiyo, no ca khvassa brahmacariyaṃ hoti iddhañceva phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsitaṃ…pe… brahmacariyañcassa hoti iddhañceva phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ yāva ",
      " devamanussehi suppakāsitaṃ, no ca kho lābhaggayasaggappattaṃ. Evaṃ taṃ brahmacariyaṃ aparipūraṃ hoti tenaṅgena."
    ],
    "innerText": "174. ‘‘Etehi cepi, cunda, aṅgehi samannāgataṃ brahmacariyaṃ hoti, satthā ca hoti thero rattaññū cirapabbajito addhagato vayoanuppatto, therā cassa bhikkhū sāvakā honti viyattā vinītā visāradā pattayogakkhemā. Alaṃ samakkhātuṃ saddhammassa, alaṃ uppannaṃ parappavādaṃ sahadhammehi suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desetuṃ. No ca khvassa majjhimā bhikkhū sāvakā honti…pe… majjhimā cassa bhikkhū sāvakā honti, no ca khvassa navā bhikkhū sāvakā honti…pe… navā cassa bhikkhū sāvakā honti, no ca khvassa therā bhikkhuniyo sāvikā honti…pe… therā cassa bhikkhuniyo sāvikā honti, no ca khvassa majjhimā bhikkhuniyo sāvikā honti…pe… majjhimā cassa bhikkhuniyo sāvikā honti , no ca khvassa navā bhikkhuniyo sāvikā honti…pe… navā cassa bhikkhuniyo sāvikā honti, no ca khvassa upāsakā sāvakā honti gihī odātavasanā brahmacārino…pe… upāsakā cassa sāvakā honti gihī odātavasanā brahmacārino, no ca khvassa upāsakā sāvakā honti gihī odātavasanā kāmabhogino…pe… upāsakā cassa sāvakā honti gihī odātavasanā kāmabhogino, no ca khvassa upāsikā sāvikā honti gihiniyo odātavasanā brahmacāriniyo…pe… upāsikā cassa sāvikā honti gihiniyo odātavasanā brahmacāriniyo, no ca khvassa upāsikā sāvikā honti gihiniyo odātavasanā kāmabhoginiyo…pe… upāsikā cassa sāvikā honti gihiniyo odātavasanā kāmabhoginiyo, no ca khvassa brahmacariyaṃ hoti iddhañceva phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsitaṃ…pe… brahmacariyañcassa hoti iddhañceva phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsitaṃ, no ca kho lābhaggayasaggappattaṃ. Evaṃ taṃ brahmacariyaṃ aparipūraṃ hoti tenaṅgena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yato ca kho, cunda, etehi ceva aṅgehi samannāgataṃ brahmacariyaṃ hoti, satthā ca hoti thero rattaññū cirapabbajito addhagato vayoanuppatto, therā cassa bhikkhū sāvakā honti viyattā vinītā visāradā pattayogakkhemā. Alaṃ samakkhātuṃ saddhammassa, alaṃ uppannaṃ parappavādaṃ sahadhammehi suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desetuṃ. Majjhimā cassa bhikkhū sāvakā honti…pe… navā cassa bhikkhū sāvakā honti…pe… therā cassa bhikkhuniyo sāvikā ",
      " honti…pe… majjhimā cassa bhikkhuniyo sāvikā honti…pe… navā cassa bhikkhuniyo sāvikā honti…pe… upāsakā cassa sāvakā honti…pe… gihī odātavasanā brahmacārino ",
      ". Upāsakā cassa sāvakā honti gihī odātavasanā kāmabhogino…pe… upāsikā cassa sāvikā honti gihiniyo odātavasanā brahmacāriniyo…pe… upāsikā cassa sāvikā honti gihiniyo odātavasanā kāmabhoginiyo…pe… brahmacariyañcassa hoti iddhañceva phītañca vitthārikaṃ ",
      " bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsitaṃ, lābhaggappattañca yasaggappattañca. Evaṃ taṃ brahmacariyaṃ paripūraṃ hoti tenaṅgena."
    ],
    "innerText": "‘‘Yato ca kho, cunda, etehi ceva aṅgehi samannāgataṃ brahmacariyaṃ hoti, satthā ca hoti thero rattaññū cirapabbajito addhagato vayoanuppatto, therā cassa bhikkhū sāvakā honti viyattā vinītā visāradā pattayogakkhemā. Alaṃ samakkhātuṃ saddhammassa, alaṃ uppannaṃ parappavādaṃ sahadhammehi suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desetuṃ. Majjhimā cassa bhikkhū sāvakā honti…pe… navā cassa bhikkhū sāvakā honti…pe… therā cassa bhikkhuniyo sāvikā honti…pe… majjhimā cassa bhikkhuniyo sāvikā honti…pe… navā cassa bhikkhuniyo sāvikā honti…pe… upāsakā cassa sāvakā honti…pe… gihī odātavasanā brahmacārino . Upāsakā cassa sāvakā honti gihī odātavasanā kāmabhogino…pe… upāsikā cassa sāvikā honti gihiniyo odātavasanā brahmacāriniyo…pe… upāsikā cassa sāvikā honti gihiniyo odātavasanā kāmabhoginiyo…pe… brahmacariyañcassa hoti iddhañceva phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsitaṃ, lābhaggappattañca yasaggappattañca. Evaṃ taṃ brahmacariyaṃ paripūraṃ hoti tenaṅgena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "175"
      },
      ". ‘‘Ahaṃ kho pana, cunda, etarahi satthā loke uppanno arahaṃ sammāsambuddho. Dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito. Viññāpitatthā ca me sāvakā saddhamme, kevalañca tesaṃ paripūraṃ brahmacariyaṃ āvikataṃ uttānīkataṃ sabbasaṅgāhapadakataṃ sappāṭihīrakataṃ yāva devamanussehi suppakāsitaṃ. Ahaṃ kho pana, cunda, etarahi satthā thero rattaññū cirapabbajito addhagato vayoanuppatto."
    ],
    "innerText": "175. ‘‘Ahaṃ kho pana, cunda, etarahi satthā loke uppanno arahaṃ sammāsambuddho. Dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito. Viññāpitatthā ca me sāvakā saddhamme, kevalañca tesaṃ paripūraṃ brahmacariyaṃ āvikataṃ uttānīkataṃ sabbasaṅgāhapadakataṃ sappāṭihīrakataṃ yāva devamanussehi suppakāsitaṃ. Ahaṃ kho pana, cunda, etarahi satthā thero rattaññū cirapabbajito addhagato vayoanuppatto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Santi kho pana me, cunda, etarahi therā bhikkhū sāvakā honti viyattā vinītā visāradā pattayogakkhemā. Alaṃ samakkhātuṃ saddhammassa, alaṃ uppannaṃ parappavādaṃ sahadhammehi suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desetuṃ. Santi kho pana me, cunda ",
      ", etarahi majjhimā bhikkhū sāvakā…pe… santi kho pana me, cunda, etarahi navā bhikkhū sāvakā…pe… santi kho pana me, cunda, etarahi therā bhikkhuniyo sāvikā…pe… santi kho ",
      " pana me, cunda, etarahi majjhimā bhikkhuniyo sāvikā…pe… santi kho pana me, cunda, etarahi navā bhikkhuniyo sāvikā…pe… santi kho pana me, cunda, etarahi upāsakā sāvakā gihī odātavasanā brahmacārino…pe… santi kho pana me, cunda, etarahi upāsakā sāvakā gihī odātavasanā kāmabhogino…pe… santi kho pana me, cunda, etarahi upāsikā sāvikā gihiniyo odātavasanā brahmacāriniyo…pe… santi kho pana ",
      " me, cunda, etarahi upāsikā sāvikā gihiniyo odātavasanā kāmabhoginiyo…pe… etarahi kho pana me, cunda, brahmacariyaṃ iddhañceva phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsitaṃ."
    ],
    "innerText": "‘‘Santi kho pana me, cunda, etarahi therā bhikkhū sāvakā honti viyattā vinītā visāradā pattayogakkhemā. Alaṃ samakkhātuṃ saddhammassa, alaṃ uppannaṃ parappavādaṃ sahadhammehi suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desetuṃ. Santi kho pana me, cunda , etarahi majjhimā bhikkhū sāvakā…pe… santi kho pana me, cunda, etarahi navā bhikkhū sāvakā…pe… santi kho pana me, cunda, etarahi therā bhikkhuniyo sāvikā…pe… santi kho pana me, cunda, etarahi majjhimā bhikkhuniyo sāvikā…pe… santi kho pana me, cunda, etarahi navā bhikkhuniyo sāvikā…pe… santi kho pana me, cunda, etarahi upāsakā sāvakā gihī odātavasanā brahmacārino…pe… santi kho pana me, cunda, etarahi upāsakā sāvakā gihī odātavasanā kāmabhogino…pe… santi kho pana me, cunda, etarahi upāsikā sāvikā gihiniyo odātavasanā brahmacāriniyo…pe… santi kho pana me, cunda, etarahi upāsikā sāvikā gihiniyo odātavasanā kāmabhoginiyo…pe… etarahi kho pana me, cunda, brahmacariyaṃ iddhañceva phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "176"
      },
      ". ‘‘Yāvatā kho, cunda, etarahi satthāro loke uppannā, nāhaṃ, cunda, aññaṃ ekasatthārampi samanupassāmi evaṃlābhaggayasaggappattaṃ yatharivāhaṃ. Yāvatā kho pana, cunda, etarahi saṅgho vā gaṇo vā loke uppanno; nāhaṃ, cunda, aññaṃ ekaṃ saṃghampi samanupassāmi evaṃlābhaggayasaggappattaṃ yatharivāyaṃ, cunda, bhikkhusaṅgho. Yaṃ kho taṃ, cunda, sammā vadamāno vadeyya – ‘sabbākārasampannaṃ sabbākāraparipūraṃ anūnamanadhikaṃ svākkhātaṃ kevalaṃ paripūraṃ brahmacariyaṃ suppakāsita’nti. Idameva taṃ sammā vadamāno vadeyya – ‘sabbākārasampannaṃ…pe… suppakāsita’nti."
    ],
    "innerText": "176. ‘‘Yāvatā kho, cunda, etarahi satthāro loke uppannā, nāhaṃ, cunda, aññaṃ ekasatthārampi samanupassāmi evaṃlābhaggayasaggappattaṃ yatharivāhaṃ. Yāvatā kho pana, cunda, etarahi saṅgho vā gaṇo vā loke uppanno; nāhaṃ, cunda, aññaṃ ekaṃ saṃghampi samanupassāmi evaṃlābhaggayasaggappattaṃ yatharivāyaṃ, cunda, bhikkhusaṅgho. Yaṃ kho taṃ, cunda, sammā vadamāno vadeyya – ‘sabbākārasampannaṃ sabbākāraparipūraṃ anūnamanadhikaṃ svākkhātaṃ kevalaṃ paripūraṃ brahmacariyaṃ suppakāsita’nti. Idameva taṃ sammā vadamāno vadeyya – ‘sabbākārasampannaṃ…pe… suppakāsita’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Udako ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[uddako (sī. syā. pī.)]"
      },
      " sudaṃ, cunda, rāmaputto evaṃ vācaṃ bhāsati – ‘passaṃ na passatī’ti. Kiñca ",
      " passaṃ na passatīti? Khurassa sādhunisitassa talamassa passati, dhārañca khvassa na passati. Idaṃ vuccati – ‘passaṃ na passatī’ti. Yaṃ kho panetaṃ, cunda, udakena rāmaputtena bhāsitaṃ hīnaṃ gammaṃ pothujjanikaṃ anariyaṃ anatthasaṃhitaṃ khurameva sandhāya. Yañca taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yañcetaṃ (syā. ka.)]"
      },
      ", cunda, sammā vadamāno vadeyya – ‘passaṃ ",
      " na passatī’ti, idameva taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[idamevetaṃ (ka.)]"
      },
      " sammā vadamāno vadeyya – ‘passaṃ na passatī’ti. Kiñca passaṃ na passatīti? Evaṃ sabbākārasampannaṃ sabbākāraparipūraṃ anūnamanadhikaṃ svākkhātaṃ kevalaṃ paripūraṃ brahmacariyaṃ suppakāsitanti, iti hetaṃ passati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[suppakāsitaṃ, iti hetaṃ na passatīti (syā. ka.)]"
      },
      ". Idamettha apakaḍḍheyya, evaṃ taṃ parisuddhataraṃ assāti, iti hetaṃ na passati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na passatīti (syā. ka.)]"
      },
      ". Idamettha upakaḍḍheyya, evaṃ taṃ paripūraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[parisuddhataraṃ (syā. ka.), paripūrataraṃ (?)]"
      },
      " assāti, iti ",
      " hetaṃ na passati. Idaṃ vuccati cunda – ‘passaṃ na passatī’ti. Yaṃ kho taṃ, cunda, sammā vadamāno vadeyya – ‘sabbākārasampannaṃ…pe… brahmacariyaṃ suppakāsita’nti. Idameva taṃ sammā vadamāno vadeyya – ‘sabbākārasampannaṃ sabbākāraparipūraṃ anūnamanadhikaṃ svākkhātaṃ kevalaṃ paripūraṃ brahmacariyaṃ suppakāsita’nti."
    ],
    "innerText": "‘‘Udako [uddako (sī. syā. pī.)] sudaṃ, cunda, rāmaputto evaṃ vācaṃ bhāsati – ‘passaṃ na passatī’ti. Kiñca passaṃ na passatīti? Khurassa sādhunisitassa talamassa passati, dhārañca khvassa na passati. Idaṃ vuccati – ‘passaṃ na passatī’ti. Yaṃ kho panetaṃ, cunda, udakena rāmaputtena bhāsitaṃ hīnaṃ gammaṃ pothujjanikaṃ anariyaṃ anatthasaṃhitaṃ khurameva sandhāya. Yañca taṃ [yañcetaṃ (syā. ka.)], cunda, sammā vadamāno vadeyya – ‘passaṃ na passatī’ti, idameva taṃ [idamevetaṃ (ka.)] sammā vadamāno vadeyya – ‘passaṃ na passatī’ti. Kiñca passaṃ na passatīti? Evaṃ sabbākārasampannaṃ sabbākāraparipūraṃ anūnamanadhikaṃ svākkhātaṃ kevalaṃ paripūraṃ brahmacariyaṃ suppakāsitanti, iti hetaṃ passati [suppakāsitaṃ, iti hetaṃ na passatīti (syā. ka.)]. Idamettha apakaḍḍheyya, evaṃ taṃ parisuddhataraṃ assāti, iti hetaṃ na passati [na passatīti (syā. ka.)]. Idamettha upakaḍḍheyya, evaṃ taṃ paripūraṃ [parisuddhataraṃ (syā. ka.), paripūrataraṃ (?)] assāti, iti hetaṃ na passati. Idaṃ vuccati cunda – ‘passaṃ na passatī’ti. Yaṃ kho taṃ, cunda, sammā vadamāno vadeyya – ‘sabbākārasampannaṃ…pe… brahmacariyaṃ suppakāsita’nti. Idameva taṃ sammā vadamāno vadeyya – ‘sabbākārasampannaṃ sabbākāraparipūraṃ anūnamanadhikaṃ svākkhātaṃ kevalaṃ paripūraṃ brahmacariyaṃ suppakāsita’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Saṅgāyitabbadhammo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "177"
      },
      ". Tasmātiha, cunda, ye vo mayā dhammā abhiññā desitā, tattha sabbeheva saṅgamma samāgamma atthena atthaṃ byañjanena byañjanaṃ saṅgāyitabbaṃ na vivaditabbaṃ, yathayidaṃ brahmacariyaṃ addhaniyaṃ assa ciraṭṭhitikaṃ, tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. Katame ca te, cunda ",
      ", dhammā mayā abhiññā desitā, yattha sabbeheva saṅgamma samāgamma atthena atthaṃ byañjanena byañjanaṃ saṅgāyitabbaṃ na vivaditabbaṃ, yathayidaṃ brahmacariyaṃ addhaniyaṃ assa ciraṭṭhitikaṃ, tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ? Seyyathidaṃ – cattāro satipaṭṭhānā, cattāro sammappadhānā, cattāro iddhipādā, pañcindriyāni, pañca balāni, satta bojjhaṅgā ",
      ", ariyo aṭṭhaṅgiko maggo. Ime kho te, cunda, dhammā mayā abhiññā desitā. Yattha sabbeheva saṅgamma samāgamma atthena atthaṃ byañjanena byañjanaṃ saṅgāyitabbaṃ na vivaditabbaṃ, yathayidaṃ brahmacariyaṃ addhaniyaṃ assa ciraṭṭhitikaṃ, tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ."
    ],
    "innerText": "177. Tasmātiha, cunda, ye vo mayā dhammā abhiññā desitā, tattha sabbeheva saṅgamma samāgamma atthena atthaṃ byañjanena byañjanaṃ saṅgāyitabbaṃ na vivaditabbaṃ, yathayidaṃ brahmacariyaṃ addhaniyaṃ assa ciraṭṭhitikaṃ, tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. Katame ca te, cunda , dhammā mayā abhiññā desitā, yattha sabbeheva saṅgamma samāgamma atthena atthaṃ byañjanena byañjanaṃ saṅgāyitabbaṃ na vivaditabbaṃ, yathayidaṃ brahmacariyaṃ addhaniyaṃ assa ciraṭṭhitikaṃ, tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ? Seyyathidaṃ – cattāro satipaṭṭhānā, cattāro sammappadhānā, cattāro iddhipādā, pañcindriyāni, pañca balāni, satta bojjhaṅgā , ariyo aṭṭhaṅgiko maggo. Ime kho te, cunda, dhammā mayā abhiññā desitā. Yattha sabbeheva saṅgamma samāgamma atthena atthaṃ byañjanena byañjanaṃ saṅgāyitabbaṃ na vivaditabbaṃ, yathayidaṃ brahmacariyaṃ addhaniyaṃ assa ciraṭṭhitikaṃ, tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Saññāpetabbavidhi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "178"
      },
      ". ‘‘Tesañca ",
      " vo, cunda, samaggānaṃ sammodamānānaṃ avivadamānānaṃ sikkhataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sikkhitabbaṃ (bahūsu)]"
      },
      " aññataro sabrahmacārī saṅghe dhammaṃ bhāseyya. Tatra ce tumhākaṃ evamassa – ‘ayaṃ kho āyasmā atthañceva micchā gaṇhāti, byañjanāni ca micchā ropetī’ti. Tassa neva abhinanditabbaṃ na paṭikkositabbaṃ, anabhinanditvā appaṭikkositvā so evamassa vacanīyo – ‘imassa nu kho, āvuso, atthassa imāni vā byañjanāni etāni vā byañjanāni katamāni opāyikatarāni, imesañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[imesaṃ vā (syā. pī. ka.), imesaṃ (sī.)]"
      },
      " byañjanānaṃ ayaṃ vā attho eso vā attho ",
      " katamo opāyikataro’ti ",
      "? So ce evaṃ vadeyya – ‘imassa kho, āvuso, atthassa imāneva byañjanāni opāyikatarāni, yā ceva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yañceva (sī. ka.), ṭīkā oloketabbā]"
      },
      " etāni; imesañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[imedaṃ (sabbattha)]"
      },
      " byañjanānaṃ ayameva attho opāyikataro, yā ceva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yañceva (sī. ka.), ṭīkā oloketabbā]"
      },
      " eso’ti. So neva ussādetabbo na apasādetabbo, anussādetvā anapasādetvā sveva sādhukaṃ saññāpetabbo tassa ca atthassa tesañca byañjanānaṃ nisantiyā."
    ],
    "innerText": "178. ‘‘Tesañca vo, cunda, samaggānaṃ sammodamānānaṃ avivadamānānaṃ sikkhataṃ [sikkhitabbaṃ (bahūsu)] aññataro sabrahmacārī saṅghe dhammaṃ bhāseyya. Tatra ce tumhākaṃ evamassa – ‘ayaṃ kho āyasmā atthañceva micchā gaṇhāti, byañjanāni ca micchā ropetī’ti. Tassa neva abhinanditabbaṃ na paṭikkositabbaṃ, anabhinanditvā appaṭikkositvā so evamassa vacanīyo – ‘imassa nu kho, āvuso, atthassa imāni vā byañjanāni etāni vā byañjanāni katamāni opāyikatarāni, imesañca [imesaṃ vā (syā. pī. ka.), imesaṃ (sī.)] byañjanānaṃ ayaṃ vā attho eso vā attho katamo opāyikataro’ti ? So ce evaṃ vadeyya – ‘imassa kho, āvuso, atthassa imāneva byañjanāni opāyikatarāni, yā ceva [yañceva (sī. ka.), ṭīkā oloketabbā] etāni; imesañca [imedaṃ (sabbattha)] byañjanānaṃ ayameva attho opāyikataro, yā ceva [yañceva (sī. ka.), ṭīkā oloketabbā] eso’ti. So neva ussādetabbo na apasādetabbo, anussādetvā anapasādetvā sveva sādhukaṃ saññāpetabbo tassa ca atthassa tesañca byañjanānaṃ nisantiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "179"
      },
      ". ‘‘Aparopi ce, cunda, sabrahmacārī saṅghe dhammaṃ bhāseyya. Tatra ce tumhākaṃ evamassa – ‘ayaṃ kho āyasmā atthañhi kho micchā gaṇhāti byañjanāni sammā ",
      " ropetī’ti. Tassa neva abhinanditabbaṃ na paṭikkositabbaṃ, anabhinanditvā appaṭikkositvā so evamassa vacanīyo – ‘imesaṃ nu kho, āvuso, byañjanānaṃ ayaṃ vā attho eso vā attho katamo opāyikataro’ti? So ce evaṃ vadeyya – ‘imesaṃ kho, āvuso, byañjanānaṃ ayameva attho opāyikataro, yā ceva eso’ti. So neva ussādetabbo na apasādetabbo, anussādetvā anapasādetvā sveva sādhukaṃ saññāpetabbo tasseva atthassa nisantiyā."
    ],
    "innerText": "179. ‘‘Aparopi ce, cunda, sabrahmacārī saṅghe dhammaṃ bhāseyya. Tatra ce tumhākaṃ evamassa – ‘ayaṃ kho āyasmā atthañhi kho micchā gaṇhāti byañjanāni sammā ropetī’ti. Tassa neva abhinanditabbaṃ na paṭikkositabbaṃ, anabhinanditvā appaṭikkositvā so evamassa vacanīyo – ‘imesaṃ nu kho, āvuso, byañjanānaṃ ayaṃ vā attho eso vā attho katamo opāyikataro’ti? So ce evaṃ vadeyya – ‘imesaṃ kho, āvuso, byañjanānaṃ ayameva attho opāyikataro, yā ceva eso’ti. So neva ussādetabbo na apasādetabbo, anussādetvā anapasādetvā sveva sādhukaṃ saññāpetabbo tasseva atthassa nisantiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "180"
      },
      ". ‘‘Aparopi ce, cunda, sabrahmacārī saṅghe dhammaṃ bhāseyya. Tatra ce tumhākaṃ evamassa – ‘ayaṃ kho āyasmā atthañhi kho sammā gaṇhāti byañjanāni micchā ropetī’ti. Tassa neva abhinanditabbaṃ na paṭikkositabbaṃ; anabhinanditvā appaṭikkositvā so ",
      " evamassa vacanīyo – ‘imassa nu kho, āvuso, atthassa imāni vā byañjanāni etāni vā byañjanāni katamāni opāyikatarānī’ti? So ce evaṃ vadeyya – ‘imassa kho, āvuso, atthassa imāneva byañjanāni opayikatarāni, yāni ceva etānī’ti ",
      ". So neva ussādetabbo na apasādetabbo; anussādetvā anapasādetvā sveva sādhukaṃ saññāpetabbo tesaññeva byañjanānaṃ nisantiyā."
    ],
    "innerText": "180. ‘‘Aparopi ce, cunda, sabrahmacārī saṅghe dhammaṃ bhāseyya. Tatra ce tumhākaṃ evamassa – ‘ayaṃ kho āyasmā atthañhi kho sammā gaṇhāti byañjanāni micchā ropetī’ti. Tassa neva abhinanditabbaṃ na paṭikkositabbaṃ; anabhinanditvā appaṭikkositvā so evamassa vacanīyo – ‘imassa nu kho, āvuso, atthassa imāni vā byañjanāni etāni vā byañjanāni katamāni opāyikatarānī’ti? So ce evaṃ vadeyya – ‘imassa kho, āvuso, atthassa imāneva byañjanāni opayikatarāni, yāni ceva etānī’ti . So neva ussādetabbo na apasādetabbo; anussādetvā anapasādetvā sveva sādhukaṃ saññāpetabbo tesaññeva byañjanānaṃ nisantiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "181"
      },
      ". ‘‘Aparopi ce, cunda, sabrahmacārī saṅghe dhammaṃ bhāseyya. Tatra ce tumhākaṃ evamassa – ‘ayaṃ kho āyasmā atthañceva sammā gaṇhāti byañjanāni ",
      " ca sammā ropetī’ti. Tassa ‘sādhū’ti bhāsitaṃ abhinanditabbaṃ anumoditabbaṃ; tassa ‘sādhū’ti bhāsitaṃ abhinanditvā anumoditvā so evamassa vacanīyo – ‘lābhā no āvuso, suladdhaṃ no āvuso, ye mayaṃ āyasmantaṃ tādisaṃ sabrahmacāriṃ passāma evaṃ atthupetaṃ byañjanupeta’nti."
    ],
    "innerText": "181. ‘‘Aparopi ce, cunda, sabrahmacārī saṅghe dhammaṃ bhāseyya. Tatra ce tumhākaṃ evamassa – ‘ayaṃ kho āyasmā atthañceva sammā gaṇhāti byañjanāni ca sammā ropetī’ti. Tassa ‘sādhū’ti bhāsitaṃ abhinanditabbaṃ anumoditabbaṃ; tassa ‘sādhū’ti bhāsitaṃ abhinanditvā anumoditvā so evamassa vacanīyo – ‘lābhā no āvuso, suladdhaṃ no āvuso, ye mayaṃ āyasmantaṃ tādisaṃ sabrahmacāriṃ passāma evaṃ atthupetaṃ byañjanupeta’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paccayānuññātakāraṇaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "182"
      },
      ". ‘‘Na vo ahaṃ, cunda, diṭṭhadhammikānaṃyeva āsavānaṃ ",
      " saṃvarāya dhammaṃ desemi. Na panāhaṃ, cunda, samparāyikānaṃyeva āsavānaṃ paṭighātāya dhammaṃ desemi. Diṭṭhadhammikānaṃ cevāhaṃ, cunda, āsavānaṃ saṃvarāya dhammaṃ desemi; samparāyikānañca āsavānaṃ paṭighātāya. Tasmātiha, cunda, yaṃ vo mayā cīvaraṃ anuññātaṃ, alaṃ vo taṃ – yāvadeva sītassa paṭighātāya, uṇhassa paṭighātāya, ḍaṃsamakasavātātapasarīsapa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[siriṃsapa (syā.)]"
      },
      " samphassānaṃ paṭighātāya, yāvadeva hirikopīnapaṭicchādanatthaṃ. Yo ",
      " vo mayā piṇḍapāto anuññāto, alaṃ vo so yāvadeva imassa kāyassa ṭhitiyā yāpanāya vihiṃsūparatiyā brahmacariyānuggahāya, iti purāṇañca vedanaṃ paṭihaṅkhāmi, navañca vedanaṃ na uppādessāmi, yātrā ca me bhavissati anavajjatā ca phāsuvihāro ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cāti (bahūsu)]"
      },
      ". Yaṃ vo mayā senāsanaṃ anuññātaṃ, alaṃ vo taṃ yāvadeva sītassa paṭighātāya, uṇhassa paṭighātāya, ḍaṃsamakasavātātapasarīsapasamphassānaṃ paṭighātāya, yāvadeva utuparissayavinodana paṭisallānārāmatthaṃ. Yo vo mayā gilānapaccayabhesajja parikkhāro anuññāto, alaṃ vo so yāvadeva uppannānaṃ veyyābādhikānaṃ vedanānaṃ paṭighātāya abyāpajjaparamatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abyāpajjhaparamatāyāti (sī. syā. pī.), abyābajjhaparamatāya (?)]"
      },
      "."
    ],
    "innerText": "182. ‘‘Na vo ahaṃ, cunda, diṭṭhadhammikānaṃyeva āsavānaṃ saṃvarāya dhammaṃ desemi. Na panāhaṃ, cunda, samparāyikānaṃyeva āsavānaṃ paṭighātāya dhammaṃ desemi. Diṭṭhadhammikānaṃ cevāhaṃ, cunda, āsavānaṃ saṃvarāya dhammaṃ desemi; samparāyikānañca āsavānaṃ paṭighātāya. Tasmātiha, cunda, yaṃ vo mayā cīvaraṃ anuññātaṃ, alaṃ vo taṃ – yāvadeva sītassa paṭighātāya, uṇhassa paṭighātāya, ḍaṃsamakasavātātapasarīsapa [siriṃsapa (syā.)] samphassānaṃ paṭighātāya, yāvadeva hirikopīnapaṭicchādanatthaṃ. Yo vo mayā piṇḍapāto anuññāto, alaṃ vo so yāvadeva imassa kāyassa ṭhitiyā yāpanāya vihiṃsūparatiyā brahmacariyānuggahāya, iti purāṇañca vedanaṃ paṭihaṅkhāmi, navañca vedanaṃ na uppādessāmi, yātrā ca me bhavissati anavajjatā ca phāsuvihāro ca [cāti (bahūsu)]. Yaṃ vo mayā senāsanaṃ anuññātaṃ, alaṃ vo taṃ yāvadeva sītassa paṭighātāya, uṇhassa paṭighātāya, ḍaṃsamakasavātātapasarīsapasamphassānaṃ paṭighātāya, yāvadeva utuparissayavinodana paṭisallānārāmatthaṃ. Yo vo mayā gilānapaccayabhesajja parikkhāro anuññāto, alaṃ vo so yāvadeva uppannānaṃ veyyābādhikānaṃ vedanānaṃ paṭighātāya abyāpajjaparamatāya [abyāpajjhaparamatāyāti (sī. syā. pī.), abyābajjhaparamatāya (?)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sukhallikānuyogo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "183"
      },
      ". ‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘sukhallikānuyogamanuyuttā samaṇā sakyaputtiyā viharantī’ti. Evaṃvādino ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vadamānā (syā.)]"
      },
      ", cunda, aññatitthiyā ",
      " paribbājakā evamassu vacanīyā – ‘katamo so ",
      ", āvuso, sukhallikānuyogo? Sukhallikānuyogā hi bahū anekavihitā nānappakārakā’ti."
    ],
    "innerText": "183. ‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘sukhallikānuyogamanuyuttā samaṇā sakyaputtiyā viharantī’ti. Evaṃvādino [vadamānā (syā.)], cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘katamo so , āvuso, sukhallikānuyogo? Sukhallikānuyogā hi bahū anekavihitā nānappakārakā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Cattārome, cunda, sukhallikānuyogā hīnā gammā pothujjanikā anariyā anatthasaṃhitā na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattanti. Katame cattāro?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha, cunda, ekacco bālo pāṇe vadhitvā vadhitvā attānaṃ sukheti pīṇeti. Ayaṃ paṭhamo sukhallikānuyogo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, cunda, idhekacco ",
      " adinnaṃ ādiyitvā ādiyitvā attānaṃ sukheti pīṇeti. Ayaṃ dutiyo sukhallikānuyogo."
    ],
    "innerText": "‘‘Puna caparaṃ, cunda, idhekacco adinnaṃ ādiyitvā ādiyitvā attānaṃ sukheti pīṇeti. Ayaṃ dutiyo sukhallikānuyogo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, cunda, idhekacco musā bhaṇitvā bhaṇitvā attānaṃ sukheti pīṇeti. Ayaṃ tatiyo sukhallikānuyogo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, cunda, idhekacco pañcahi kāmaguṇehi samappito samaṅgībhūto paricāreti. Ayaṃ catuttho sukhallikānuyogo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ime kho, cunda, cattāro sukhallikānuyogā hīnā gammā pothujjanikā anariyā anatthasaṃhitā na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘‘ime cattāro sukhallikānuyoge anuyuttā samaṇā sakyaputtiyā viharantī’ti. Te vo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[te (sī. pī.)]"
      },
      " ‘māhevaṃ’ tissu vacanīyā. Na te vo sammā vadamānā vadeyyuṃ, abbhācikkheyyuṃ asatā abhūtena."
    ],
    "innerText": "‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘‘ime cattāro sukhallikānuyoge anuyuttā samaṇā sakyaputtiyā viharantī’ti. Te vo [te (sī. pī.)] ‘māhevaṃ’ tissu vacanīyā. Na te vo sammā vadamānā vadeyyuṃ, abbhācikkheyyuṃ asatā abhūtena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "184"
      },
      ". ‘‘Cattārome, cunda, sukhallikānuyogā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattanti. Katame cattāro?"
    ],
    "innerText": "184. ‘‘Cattārome, cunda, sukhallikānuyogā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattanti. Katame cattāro?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha ",
      ", cunda, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Ayaṃ paṭhamo sukhallikānuyogo."
    ],
    "innerText": "‘‘Idha , cunda, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Ayaṃ paṭhamo sukhallikānuyogo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, cunda, bhikkhu vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharati. Ayaṃ dutiyo sukhallikānuyogo."
    ],
    "innerText": "‘‘Puna caparaṃ, cunda, bhikkhu vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharati. Ayaṃ dutiyo sukhallikānuyogo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, cunda, bhikkhu pītiyā ca virāgā…pe… tatiyaṃ ",
      " jhānaṃ upasampajja viharati. Ayaṃ tatiyo sukhallikānuyogo."
    ],
    "innerText": "‘‘Puna caparaṃ, cunda, bhikkhu pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharati. Ayaṃ tatiyo sukhallikānuyogo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, cunda, bhikkhu sukhassa ca pahānā ",
      " dukkhassa ca pahānā…pe… catutthaṃ jhānaṃ upasampajja viharati. Ayaṃ catuttho sukhallikānuyogo."
    ],
    "innerText": "‘‘Puna caparaṃ, cunda, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā…pe… catutthaṃ jhānaṃ upasampajja viharati. Ayaṃ catuttho sukhallikānuyogo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ime kho, cunda, cattāro sukhallikānuyogā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘‘ime cattāro sukhallikānuyoge anuyuttā samaṇā sakyaputtiyā viharantī’ti. Te vo ‘evaṃ’ tissu vacanīyā. Sammā te vo vadamānā vadeyyuṃ, na te vo abbhācikkheyyuṃ asatā abhūtena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sukhallikānuyogānisaṃso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "185"
      },
      ". ‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘ime panāvuso, cattāro sukhallikānuyoge anuyuttānaṃ viharataṃ kati phalāni katānisaṃsā pāṭikaṅkhā’ti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘ime kho, āvuso, cattāro sukhallikānuyoge anuyuttānaṃ viharataṃ cattāri phalāni cattāro ",
      " ānisaṃsā pāṭikaṅkhā. Katame cattāro? Idhāvuso, bhikkhu tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpanno hoti avinipātadhammo niyato sambodhiparāyaṇo. Idaṃ paṭhamaṃ phalaṃ, paṭhamo ānisaṃso. Puna caparaṃ, āvuso, bhikkhu tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmī hoti, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ ",
      " karoti. Idaṃ dutiyaṃ phalaṃ, dutiyo ānisaṃso. Puna caparaṃ, āvuso, bhikkhu pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti, tattha parinibbāyī anāvattidhammo tasmā lokā. Idaṃ tatiyaṃ phalaṃ, tatiyo ānisaṃso. Puna caparaṃ, āvuso, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Idaṃ catutthaṃ phalaṃ catuttho ānisaṃso. Ime ",
      " kho, āvuso, cattāro sukhallikānuyoge anuyuttānaṃ viharataṃ imāni cattāri phalāni, cattāro ānisaṃsā pāṭikaṅkhā’’ti."
    ],
    "innerText": "185. ‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘ime panāvuso, cattāro sukhallikānuyoge anuyuttānaṃ viharataṃ kati phalāni katānisaṃsā pāṭikaṅkhā’ti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘ime kho, āvuso, cattāro sukhallikānuyoge anuyuttānaṃ viharataṃ cattāri phalāni cattāro ānisaṃsā pāṭikaṅkhā. Katame cattāro? Idhāvuso, bhikkhu tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpanno hoti avinipātadhammo niyato sambodhiparāyaṇo. Idaṃ paṭhamaṃ phalaṃ, paṭhamo ānisaṃso. Puna caparaṃ, āvuso, bhikkhu tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmī hoti, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karoti. Idaṃ dutiyaṃ phalaṃ, dutiyo ānisaṃso. Puna caparaṃ, āvuso, bhikkhu pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti, tattha parinibbāyī anāvattidhammo tasmā lokā. Idaṃ tatiyaṃ phalaṃ, tatiyo ānisaṃso. Puna caparaṃ, āvuso, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Idaṃ catutthaṃ phalaṃ catuttho ānisaṃso. Ime kho, āvuso, cattāro sukhallikānuyoge anuyuttānaṃ viharataṃ imāni cattāri phalāni, cattāro ānisaṃsā pāṭikaṅkhā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Khīṇāsavaabhabbaṭhānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "186"
      },
      ". ‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati yaṃ aññatitthiyā ",
      " paribbājakā evaṃ vadeyyuṃ – ‘aṭṭhitadhammā samaṇā sakyaputtiyā viharantī’ti. Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘atthi kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena sāvakānaṃ dhammā desitā paññattā yāvajīvaṃ anatikkamanīyā. Seyyathāpi, āvuso, indakhīlo vā ayokhīlo vā gambhīranemo sunikhāto acalo asampavedhī. Evameva kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena sāvakānaṃ dhammā desitā paññattā yāvajīvaṃ anatikkamanīyā. Yo so, āvuso, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto, abhabbo so nava ṭhānāni ajjhācarituṃ. Abhabbo, āvuso, khīṇāsavo bhikkhu sañcicca ",
      " pāṇaṃ jīvitā voropetuṃ; abhabbo khīṇāsavo bhikkhu adinnaṃ theyyasaṅkhātaṃ ādiyituṃ; abhabbo khīṇāsavo bhikkhu methunaṃ dhammaṃ paṭisevituṃ; abhabbo khīṇāsavo bhikkhu sampajānamusā bhāsituṃ; abhabbo khīṇāsavo bhikkhu sannidhikārakaṃ kāme paribhuñjituṃ seyyathāpi pubbe āgārikabhūto; abhabbo khīṇāsavo bhikkhu chandāgatiṃ gantuṃ; abhabbo khīṇāsavo bhikkhu dosāgatiṃ gantuṃ; abhabbo khīṇāsavo bhikkhu mohāgatiṃ gantuṃ; abhabbo khīṇāsavo bhikkhu bhayāgatiṃ gantuṃ. Yo so, āvuso, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto, abhabbo so imāni nava ṭhānāni ajjhācaritu’’nti."
    ],
    "innerText": "186. ‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘aṭṭhitadhammā samaṇā sakyaputtiyā viharantī’ti. Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘atthi kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena sāvakānaṃ dhammā desitā paññattā yāvajīvaṃ anatikkamanīyā. Seyyathāpi, āvuso, indakhīlo vā ayokhīlo vā gambhīranemo sunikhāto acalo asampavedhī. Evameva kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena sāvakānaṃ dhammā desitā paññattā yāvajīvaṃ anatikkamanīyā. Yo so, āvuso, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto, abhabbo so nava ṭhānāni ajjhācarituṃ. Abhabbo, āvuso, khīṇāsavo bhikkhu sañcicca pāṇaṃ jīvitā voropetuṃ; abhabbo khīṇāsavo bhikkhu adinnaṃ theyyasaṅkhātaṃ ādiyituṃ; abhabbo khīṇāsavo bhikkhu methunaṃ dhammaṃ paṭisevituṃ; abhabbo khīṇāsavo bhikkhu sampajānamusā bhāsituṃ; abhabbo khīṇāsavo bhikkhu sannidhikārakaṃ kāme paribhuñjituṃ seyyathāpi pubbe āgārikabhūto; abhabbo khīṇāsavo bhikkhu chandāgatiṃ gantuṃ; abhabbo khīṇāsavo bhikkhu dosāgatiṃ gantuṃ; abhabbo khīṇāsavo bhikkhu mohāgatiṃ gantuṃ; abhabbo khīṇāsavo bhikkhu bhayāgatiṃ gantuṃ. Yo so, āvuso, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto, abhabbo so imāni nava ṭhānāni ajjhācaritu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pañhābyākaraṇaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "187"
      },
      ". ‘‘Ṭhānaṃ ",
      " kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘atītaṃ kho addhānaṃ ārabbha samaṇo gotamo atīrakaṃ ñāṇadassanaṃ paññapeti, no ca kho anāgataṃ addhānaṃ ārabbha atīrakaṃ ñāṇadassanaṃ paññapeti, tayidaṃ kiṃsu tayidaṃ kathaṃsū’ti? Te ca aññatitthiyā ",
      " paribbājakā aññavihitakena ñāṇadassanena aññavihitakaṃ ñāṇadassanaṃ paññapetabbaṃ maññanti yathariva bālā abyattā. Atītaṃ kho, cunda, addhānaṃ ārabbha tathāgatassa satānusāri ñāṇaṃ hoti; so yāvatakaṃ ākaṅkhati tāvatakaṃ anussarati. Anāgatañca kho addhānaṃ ārabbha tathāgatassa bodhijaṃ ñāṇaṃ uppajjati – ‘ayamantimā ",
      " jāti, natthidāni punabbhavo’ti. ‘Atītaṃ cepi, cunda, hoti abhūtaṃ atacchaṃ anatthasaṃhitaṃ, na taṃ tathāgato byākaroti. Atītaṃ cepi, cunda, hoti bhūtaṃ tacchaṃ anatthasaṃhitaṃ, tampi tathāgato na byākaroti. Atītaṃ cepi cunda, hoti bhūtaṃ tacchaṃ atthasaṃhitaṃ, tatra kālaññū tathāgato hoti tassa pañhassa veyyākaraṇāya. Anāgataṃ cepi, cunda, hoti abhūtaṃ atacchaṃ anatthasaṃhitaṃ, na taṃ tathāgato byākaroti…pe… tassa pañhassa veyyākaraṇāya. Paccuppannaṃ cepi, cunda, hoti abhūtaṃ atacchaṃ anatthasaṃhitaṃ, na taṃ tathāgato byākaroti. Paccuppannaṃ cepi, cunda, hoti bhūtaṃ tacchaṃ ",
      " anatthasaṃhitaṃ, tampi tathāgato na byākaroti. Paccuppannaṃ cepi, cunda, hoti bhūtaṃ tacchaṃ atthasaṃhitaṃ, tatra kālaññū tathāgato hoti tassa pañhassa veyyākaraṇāya."
    ],
    "innerText": "187. ‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘atītaṃ kho addhānaṃ ārabbha samaṇo gotamo atīrakaṃ ñāṇadassanaṃ paññapeti, no ca kho anāgataṃ addhānaṃ ārabbha atīrakaṃ ñāṇadassanaṃ paññapeti, tayidaṃ kiṃsu tayidaṃ kathaṃsū’ti? Te ca aññatitthiyā paribbājakā aññavihitakena ñāṇadassanena aññavihitakaṃ ñāṇadassanaṃ paññapetabbaṃ maññanti yathariva bālā abyattā. Atītaṃ kho, cunda, addhānaṃ ārabbha tathāgatassa satānusāri ñāṇaṃ hoti; so yāvatakaṃ ākaṅkhati tāvatakaṃ anussarati. Anāgatañca kho addhānaṃ ārabbha tathāgatassa bodhijaṃ ñāṇaṃ uppajjati – ‘ayamantimā jāti, natthidāni punabbhavo’ti. ‘Atītaṃ cepi, cunda, hoti abhūtaṃ atacchaṃ anatthasaṃhitaṃ, na taṃ tathāgato byākaroti. Atītaṃ cepi, cunda, hoti bhūtaṃ tacchaṃ anatthasaṃhitaṃ, tampi tathāgato na byākaroti. Atītaṃ cepi cunda, hoti bhūtaṃ tacchaṃ atthasaṃhitaṃ, tatra kālaññū tathāgato hoti tassa pañhassa veyyākaraṇāya. Anāgataṃ cepi, cunda, hoti abhūtaṃ atacchaṃ anatthasaṃhitaṃ, na taṃ tathāgato byākaroti…pe… tassa pañhassa veyyākaraṇāya. Paccuppannaṃ cepi, cunda, hoti abhūtaṃ atacchaṃ anatthasaṃhitaṃ, na taṃ tathāgato byākaroti. Paccuppannaṃ cepi, cunda, hoti bhūtaṃ tacchaṃ anatthasaṃhitaṃ, tampi tathāgato na byākaroti. Paccuppannaṃ cepi, cunda, hoti bhūtaṃ tacchaṃ atthasaṃhitaṃ, tatra kālaññū tathāgato hoti tassa pañhassa veyyākaraṇāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "188"
      },
      ". ‘‘Iti kho, cunda, atītānāgatapaccuppannesu dhammesu tathāgato kālavādī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kālavādī saccavādī (syā.)]"
      },
      " bhūtavādī atthavādī dhammavādī vinayavādī, tasmā ‘tathāgato’ti vuccati. Yañca kho, cunda, sadevakassa lokassa samārakassa sabrahmakassa sassamaṇabrāhmaṇiyā pajāya sadevamanussāya diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, sabbaṃ tathāgatena abhisambuddhaṃ, tasmā ‘tathāgato’ti vuccati. Yañca, cunda, rattiṃ tathāgato anuttaraṃ sammāsambodhiṃ abhisambujjhati, yañca rattiṃ anupādisesāya nibbānadhātuyā parinibbāyati, yaṃ etasmiṃ antare bhāsati ",
      " lapati niddisati. Sabbaṃ taṃ tatheva hoti no aññathā, tasmā ‘tathāgato’ti vuccati. Yathāvādī, cunda, tathāgato tathākārī, yathākārī tathāvādī. Iti yathāvādī tathākārī, yathākārī tathāvādī, tasmā ‘tathāgato’ti vuccati. Sadevake loke, cunda, samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya tathāgato abhibhū anabhibhūto aññadatthudaso vasavattī, tasmā ‘tathāgato’ti vuccati."
    ],
    "innerText": "188. ‘‘Iti kho, cunda, atītānāgatapaccuppannesu dhammesu tathāgato kālavādī [kālavādī saccavādī (syā.)] bhūtavādī atthavādī dhammavādī vinayavādī, tasmā ‘tathāgato’ti vuccati. Yañca kho, cunda, sadevakassa lokassa samārakassa sabrahmakassa sassamaṇabrāhmaṇiyā pajāya sadevamanussāya diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, sabbaṃ tathāgatena abhisambuddhaṃ, tasmā ‘tathāgato’ti vuccati. Yañca, cunda, rattiṃ tathāgato anuttaraṃ sammāsambodhiṃ abhisambujjhati, yañca rattiṃ anupādisesāya nibbānadhātuyā parinibbāyati, yaṃ etasmiṃ antare bhāsati lapati niddisati. Sabbaṃ taṃ tatheva hoti no aññathā, tasmā ‘tathāgato’ti vuccati. Yathāvādī, cunda, tathāgato tathākārī, yathākārī tathāvādī. Iti yathāvādī tathākārī, yathākārī tathāvādī, tasmā ‘tathāgato’ti vuccati. Sadevake loke, cunda, samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya tathāgato abhibhū anabhibhūto aññadatthudaso vasavattī, tasmā ‘tathāgato’ti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Abyākataṭṭhānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "189"
      },
      ". ‘‘Ṭhānaṃ ",
      " kho panetaṃ, cunda, vijjati yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kiṃ nu kho, āvuso, hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘abyākataṃ kho, āvuso, bhagavatā ",
      " – ‘‘hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’’nti."
    ],
    "innerText": "189. ‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kiṃ nu kho, āvuso, hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘abyākataṃ kho, āvuso, bhagavatā – ‘‘hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kiṃ panāvuso, na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘etampi kho, āvuso, bhagavatā abyākataṃ – ‘‘na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kiṃ panāvuso, hoti ca na ca hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘abyākataṃ ",
      " kho etaṃ, āvuso, bhagavatā – ‘‘hoti ca na ca hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’’nti."
    ],
    "innerText": "‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kiṃ panāvuso, hoti ca na ca hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘abyākataṃ kho etaṃ, āvuso, bhagavatā – ‘‘hoti ca na ca hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kiṃ panāvuso, neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘etampi kho, āvuso, bhagavatā abyākataṃ – ‘‘neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kasmā panetaṃ, āvuso, samaṇena gotamena abyākata’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘na hetaṃ, āvuso, atthasaṃhitaṃ na dhammasaṃhitaṃ ",
      " na ādibrahmacariyakaṃ na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati, tasmā taṃ bhagavatā abyākata’nti."
    ],
    "innerText": "‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kasmā panetaṃ, āvuso, samaṇena gotamena abyākata’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘na hetaṃ, āvuso, atthasaṃhitaṃ na dhammasaṃhitaṃ na ādibrahmacariyakaṃ na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati, tasmā taṃ bhagavatā abyākata’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Byākataṭṭhānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "190"
      },
      ". ‘‘Ṭhānaṃ ",
      " kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kiṃ panāvuso, samaṇena gotamena byākata’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘idaṃ dukkhanti kho, āvuso, bhagavatā byākataṃ, ayaṃ dukkhasamudayoti kho, āvuso, bhagavatā byākataṃ, ayaṃ dukkhanirodhoti kho, āvuso, bhagavatā byākataṃ, ayaṃ dukkhanirodhagāminī paṭipadāti ",
      " kho, āvuso, bhagavatā byākata’nti."
    ],
    "innerText": "190. ‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kiṃ panāvuso, samaṇena gotamena byākata’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘idaṃ dukkhanti kho, āvuso, bhagavatā byākataṃ, ayaṃ dukkhasamudayoti kho, āvuso, bhagavatā byākataṃ, ayaṃ dukkhanirodhoti kho, āvuso, bhagavatā byākataṃ, ayaṃ dukkhanirodhagāminī paṭipadāti kho, āvuso, bhagavatā byākata’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ṭhānaṃ ",
      " kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kasmā panetaṃ, āvuso, samaṇena gotamena byākata’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘etañhi, āvuso, atthasaṃhitaṃ, etaṃ dhammasaṃhitaṃ, etaṃ ādibrahmacariyakaṃ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati. Tasmā taṃ bhagavatā byākata’nti."
    ],
    "innerText": "‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kasmā panetaṃ, āvuso, samaṇena gotamena byākata’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘etañhi, āvuso, atthasaṃhitaṃ, etaṃ dhammasaṃhitaṃ, etaṃ ādibrahmacariyakaṃ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati. Tasmā taṃ bhagavatā byākata’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pubbantasahagatadiṭṭhinissayā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "191"
      },
      ". ‘‘Yepi te, cunda, pubbantasahagatā diṭṭhinissayā, tepi vo mayā byākatā, yathā te byākātabbā. Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tattha (syā. ka.)]"
      },
      " byākarissāmi? Yepi te, cunda, aparantasahagatā diṭṭhinissayā, tepi vo mayā byākatā, yathā te byākātabbā. Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā byākarissāmi? Katame ca te, cunda, pubbantasahagatā diṭṭhinissayā, ye vo mayā byākatā, yathā te byākātabbā. (Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā byākarissāmi) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[(yathā ca te na byākātabbā) sabbattha]"
      },
      "? Santi kho, cunda, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘sassato attā ca loko ca, idameva saccaṃ moghamañña’nti. Santi pana, cunda, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘asassato attā ca loko ca…pe… sassato ca asassato ca attā ca loko ca… neva sassato nāsassato attā ca loko ca… sayaṃkato ",
      " attā ca loko ca… paraṃkato attā ",
      " ca loko ca… sayaṃkato ca ",
      " paraṃkato ca attā ca loko ca… asayaṃkāro ",
      " aparaṃkāro adhiccasamuppanno attā ca loko ca, idameva saccaṃ moghamañña’nti. Sassataṃ sukhadukkhaṃ… asassataṃ sukhadukkhaṃ… sassatañca asassatañca sukhadukkhaṃ… nevasassataṃ nāsassataṃ sukhadukkhaṃ… sayaṃkataṃ sukhadukkhaṃ… paraṃkataṃ sukhadukkhaṃ… sayaṃkatañca paraṃkatañca sukhadukkhaṃ… asayaṃkāraṃ aparaṃkāraṃ adhiccasamuppannaṃ sukhadukkhaṃ, idameva saccaṃ moghamañña’nti."
    ],
    "innerText": "191. ‘‘Yepi te, cunda, pubbantasahagatā diṭṭhinissayā, tepi vo mayā byākatā, yathā te byākātabbā. Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā [tattha (syā. ka.)] byākarissāmi? Yepi te, cunda, aparantasahagatā diṭṭhinissayā, tepi vo mayā byākatā, yathā te byākātabbā. Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā byākarissāmi? Katame ca te, cunda, pubbantasahagatā diṭṭhinissayā, ye vo mayā byākatā, yathā te byākātabbā. (Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā byākarissāmi) [(yathā ca te na byākātabbā) sabbattha]? Santi kho, cunda, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘sassato attā ca loko ca, idameva saccaṃ moghamañña’nti. Santi pana, cunda, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘asassato attā ca loko ca…pe… sassato ca asassato ca attā ca loko ca… neva sassato nāsassato attā ca loko ca… sayaṃkato attā ca loko ca… paraṃkato attā ca loko ca… sayaṃkato ca paraṃkato ca attā ca loko ca… asayaṃkāro aparaṃkāro adhiccasamuppanno attā ca loko ca, idameva saccaṃ moghamañña’nti. Sassataṃ sukhadukkhaṃ… asassataṃ sukhadukkhaṃ… sassatañca asassatañca sukhadukkhaṃ… nevasassataṃ nāsassataṃ sukhadukkhaṃ… sayaṃkataṃ sukhadukkhaṃ… paraṃkataṃ sukhadukkhaṃ… sayaṃkatañca paraṃkatañca sukhadukkhaṃ… asayaṃkāraṃ aparaṃkāraṃ adhiccasamuppannaṃ sukhadukkhaṃ, idameva saccaṃ moghamañña’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "192"
      },
      ". ‘‘Tatra, cunda, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘sassato attā ca loko ca, idameva saccaṃ moghamañña’nti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘atthi nu kho idaṃ, āvuso, vuccati – ‘‘sassato attā ca loko cā’’ti? Yañca kho te evamāhaṃsu – ‘idameva saccaṃ moghamañña’nti. Taṃ tesaṃ nānujānāmi. Taṃ kissa hetu? Aññathāsaññinopi hettha, cunda, santeke sattā. Imāyapi kho ahaṃ, cunda, paññattiyā neva attanā samasamaṃ samanupassāmi kuto bhiyyo. Atha kho ahameva tattha bhiyyo yadidaṃ adhipaññatti."
    ],
    "innerText": "192. ‘‘Tatra, cunda, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘sassato attā ca loko ca, idameva saccaṃ moghamañña’nti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘atthi nu kho idaṃ, āvuso, vuccati – ‘‘sassato attā ca loko cā’’ti? Yañca kho te evamāhaṃsu – ‘idameva saccaṃ moghamañña’nti. Taṃ tesaṃ nānujānāmi. Taṃ kissa hetu? Aññathāsaññinopi hettha, cunda, santeke sattā. Imāyapi kho ahaṃ, cunda, paññattiyā neva attanā samasamaṃ samanupassāmi kuto bhiyyo. Atha kho ahameva tattha bhiyyo yadidaṃ adhipaññatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "193"
      },
      ". ‘‘Tatra, cunda, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘asassato attā ca loko ca…pe… sassato ca asassato ca attā ca loko ca… nevasassato nāsassato attā ",
      " ca loko ca… sayaṃkato attā ca loko ca… paraṃkato attā ca loko ca… sayaṃkato ca paraṃkato ca attā ca loko ca… asayaṃkāro aparaṃkāro adhiccasamuppanno attā ca loko ca… sassataṃ sukhadukkhaṃ… asassataṃ ",
      " sukhadukkhaṃ… sassatañca asassatañca sukhadukkhaṃ… nevasassataṃ nāsassataṃ sukhadukkhaṃ… sayaṃkataṃ sukhadukkhaṃ… paraṃkataṃ sukhadukkhaṃ… sayaṃkatañca paraṃkatañca sukhadukkhaṃ… asayaṃkāraṃ aparaṃkāraṃ adhiccasamuppannaṃ sukhadukkhaṃ, idameva saccaṃ moghamañña’nti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘atthi nu kho idaṃ, āvuso, vuccati – ‘‘asayaṃkāraṃ aparaṃkāraṃ adhiccasamuppannaṃ sukhadukkha’’’nti? Yañca kho te evamāhaṃsu – ‘idameva saccaṃ moghamañña’nti. Taṃ tesaṃ nānujānāmi. Taṃ kissa hetu? Aññathāsaññinopi hettha, cunda, santeke sattā. Imāyapi kho ahaṃ, cunda, paññattiyā neva attanā samasamaṃ samanupassāmi kuto bhiyyo. Atha kho ahameva tattha bhiyyo yadidaṃ adhipaññatti. Ime kho te, cunda, pubbantasahagatā diṭṭhinissayā, ye vo mayā byākatā, yathā te byākātabbā ",
      ". Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā byākarissāmīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[byākarissāmīti (sī. ka.)]"
      },
      "?"
    ],
    "innerText": "193. ‘‘Tatra, cunda, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘asassato attā ca loko ca…pe… sassato ca asassato ca attā ca loko ca… nevasassato nāsassato attā ca loko ca… sayaṃkato attā ca loko ca… paraṃkato attā ca loko ca… sayaṃkato ca paraṃkato ca attā ca loko ca… asayaṃkāro aparaṃkāro adhiccasamuppanno attā ca loko ca… sassataṃ sukhadukkhaṃ… asassataṃ sukhadukkhaṃ… sassatañca asassatañca sukhadukkhaṃ… nevasassataṃ nāsassataṃ sukhadukkhaṃ… sayaṃkataṃ sukhadukkhaṃ… paraṃkataṃ sukhadukkhaṃ… sayaṃkatañca paraṃkatañca sukhadukkhaṃ… asayaṃkāraṃ aparaṃkāraṃ adhiccasamuppannaṃ sukhadukkhaṃ, idameva saccaṃ moghamañña’nti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘atthi nu kho idaṃ, āvuso, vuccati – ‘‘asayaṃkāraṃ aparaṃkāraṃ adhiccasamuppannaṃ sukhadukkha’’’nti? Yañca kho te evamāhaṃsu – ‘idameva saccaṃ moghamañña’nti. Taṃ tesaṃ nānujānāmi. Taṃ kissa hetu? Aññathāsaññinopi hettha, cunda, santeke sattā. Imāyapi kho ahaṃ, cunda, paññattiyā neva attanā samasamaṃ samanupassāmi kuto bhiyyo. Atha kho ahameva tattha bhiyyo yadidaṃ adhipaññatti. Ime kho te, cunda, pubbantasahagatā diṭṭhinissayā, ye vo mayā byākatā, yathā te byākātabbā . Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā byākarissāmīti [byākarissāmīti (sī. ka.)]?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Aparantasahagatadiṭṭhinissayā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "194"
      },
      ". ‘‘Katame ",
      " ca te, cunda, aparantasahagatā diṭṭhinissayā, ye vo mayā byākatā, yathā te byākātabbā. (Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā byākarissāmī) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[( ) etthantare pāṭho sabbatthapi paripuṇṇo dissati]"
      },
      "? Santi, cunda, eke ",
      " samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘rūpī attā hoti arogo paraṃ maraṇā, idameva saccaṃ moghamañña’nti. Santi pana, cunda, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘arūpī attā hoti…pe… rūpī ca arūpī ca attā hoti… nevarūpī nārūpī attā hoti… saññī ",
      " attā hoti… asaññī attā hoti… nevasaññīnāsaññī attā hoti… attā ucchijjati vinassati na hoti paraṃ maraṇā, idameva saccaṃ moghamañña’nti. Tatra, cunda, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘rūpī attā hoti arogo paraṃ maraṇā, idameva saccaṃ moghamañña’nti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘atthi nu kho idaṃ, āvuso, vuccati – ‘‘rūpī attā hoti arogo paraṃ maraṇā’’’ti? Yañca kho te evamāhaṃsu – ‘idameva saccaṃ moghamañña’nti. Taṃ tesaṃ nānujānāmi. Taṃ kissa hetu? Aññathāsaññinopi hettha, cunda, santeke sattā. Imāyapi kho ahaṃ, cunda, paññattiyā neva attanā samasamaṃ samanupassāmi kuto bhiyyo. Atha kho ahameva tattha bhiyyo yadidaṃ adhipaññatti."
    ],
    "innerText": "194. ‘‘Katame ca te, cunda, aparantasahagatā diṭṭhinissayā, ye vo mayā byākatā, yathā te byākātabbā. (Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā byākarissāmī) [( ) etthantare pāṭho sabbatthapi paripuṇṇo dissati]? Santi, cunda, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘rūpī attā hoti arogo paraṃ maraṇā, idameva saccaṃ moghamañña’nti. Santi pana, cunda, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘arūpī attā hoti…pe… rūpī ca arūpī ca attā hoti… nevarūpī nārūpī attā hoti… saññī attā hoti… asaññī attā hoti… nevasaññīnāsaññī attā hoti… attā ucchijjati vinassati na hoti paraṃ maraṇā, idameva saccaṃ moghamañña’nti. Tatra, cunda, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘rūpī attā hoti arogo paraṃ maraṇā, idameva saccaṃ moghamañña’nti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘atthi nu kho idaṃ, āvuso, vuccati – ‘‘rūpī attā hoti arogo paraṃ maraṇā’’’ti? Yañca kho te evamāhaṃsu – ‘idameva saccaṃ moghamañña’nti. Taṃ tesaṃ nānujānāmi. Taṃ kissa hetu? Aññathāsaññinopi hettha, cunda, santeke sattā. Imāyapi kho ahaṃ, cunda, paññattiyā neva attanā samasamaṃ samanupassāmi kuto bhiyyo. Atha kho ahameva tattha bhiyyo yadidaṃ adhipaññatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "195"
      },
      ". ‘‘Tatra, cunda, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘arūpī attā hoti…pe… rūpī ca arūpī ca attā hoti… nevarūpīnārūpī attā hoti… saññī attā hoti… asaññī attā hoti… nevasaññīnāsaññī ",
      " attā hoti… attā ucchijjati vinassati na hoti paraṃ maraṇā, idameva saccaṃ moghamañña’nti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘atthi nu kho idaṃ, āvuso, vuccati – ‘‘attā ucchijjati vinassati na hoti paraṃ maraṇā’’’ti? Yañca kho te, cunda, evamāhaṃsu – ‘idameva saccaṃ moghamañña’nti. Taṃ tesaṃ nānujānāmi. Taṃ kissa hetu? Aññathāsaññinopi hettha, cunda, santeke sattā. Imāyapi kho ahaṃ, cunda, paññattiyā neva attanā ",
      " samasamaṃ samanupassāmi, kuto bhiyyo. Atha kho ahameva tattha bhiyyo yadidaṃ adhipaññatti. Ime kho te, cunda, aparantasahagatā diṭṭhinissayā, ye vo mayā byākatā ",
      ", yathā te byākātabbā. Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā byākarissāmīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[byākarissāmīti (sī. ka.)]"
      },
      "?"
    ],
    "innerText": "195. ‘‘Tatra, cunda, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘arūpī attā hoti…pe… rūpī ca arūpī ca attā hoti… nevarūpīnārūpī attā hoti… saññī attā hoti… asaññī attā hoti… nevasaññīnāsaññī attā hoti… attā ucchijjati vinassati na hoti paraṃ maraṇā, idameva saccaṃ moghamañña’nti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘atthi nu kho idaṃ, āvuso, vuccati – ‘‘attā ucchijjati vinassati na hoti paraṃ maraṇā’’’ti? Yañca kho te, cunda, evamāhaṃsu – ‘idameva saccaṃ moghamañña’nti. Taṃ tesaṃ nānujānāmi. Taṃ kissa hetu? Aññathāsaññinopi hettha, cunda, santeke sattā. Imāyapi kho ahaṃ, cunda, paññattiyā neva attanā samasamaṃ samanupassāmi, kuto bhiyyo. Atha kho ahameva tattha bhiyyo yadidaṃ adhipaññatti. Ime kho te, cunda, aparantasahagatā diṭṭhinissayā, ye vo mayā byākatā , yathā te byākātabbā. Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā byākarissāmīti [byākarissāmīti (sī. ka.)]?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "196"
      },
      ". ‘‘Imesañca, cunda, pubbantasahagatānaṃ diṭṭhinissayānaṃ imesañca aparantasahagatānaṃ diṭṭhinissayānaṃ ",
      " pahānāya samatikkamāya evaṃ mayā cattāro satipaṭṭhānā desitā paññattā. Katame cattāro? Idha, cunda, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Vedanāsu vedanānupassī…pe… citte cittānupassī… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesañca cunda, pubbantasahagatānaṃ diṭṭhinissayānaṃ imesañca aparantasahagatānaṃ diṭṭhinissayānaṃ ",
      " pahānāya samatikkamāya. Evaṃ mayā ime cattāro satipaṭṭhānā desitā paññattā’’ti."
    ],
    "innerText": "196. ‘‘Imesañca, cunda, pubbantasahagatānaṃ diṭṭhinissayānaṃ imesañca aparantasahagatānaṃ diṭṭhinissayānaṃ pahānāya samatikkamāya evaṃ mayā cattāro satipaṭṭhānā desitā paññattā. Katame cattāro? Idha, cunda, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Vedanāsu vedanānupassī…pe… citte cittānupassī… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesañca cunda, pubbantasahagatānaṃ diṭṭhinissayānaṃ imesañca aparantasahagatānaṃ diṭṭhinissayānaṃ pahānāya samatikkamāya. Evaṃ mayā ime cattāro satipaṭṭhānā desitā paññattā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "197"
      },
      ". Tena kho pana samayena āyasmā upavāṇo bhagavato piṭṭhito ṭhito hoti bhagavantaṃ bījayamāno. Atha kho āyasmā upavāṇo bhagavantaṃ etadavoca – ‘‘acchariyaṃ, bhante, abbhutaṃ, bhante! Pāsādiko vatāyaṃ, bhante, dhammapariyāyo; supāsādiko vatāyaṃ bhante, dhammapariyāyo, ko nāmāyaṃ bhante dhammapariyāyo’’ti? ‘‘Tasmātiha tvaṃ, upavāṇa, imaṃ dhammapariyāyaṃ ‘pāsādiko’ tveva naṃ dhārehī’’ti. Idamavoca bhagavā. Attamano āyasmā upavāṇo bhagavato bhāsitaṃ abhinandīti."
    ],
    "innerText": "197. Tena kho pana samayena āyasmā upavāṇo bhagavato piṭṭhito ṭhito hoti bhagavantaṃ bījayamāno. Atha kho āyasmā upavāṇo bhagavantaṃ etadavoca – ‘‘acchariyaṃ, bhante, abbhutaṃ, bhante! Pāsādiko vatāyaṃ, bhante, dhammapariyāyo; supāsādiko vatāyaṃ bhante, dhammapariyāyo, ko nāmāyaṃ bhante dhammapariyāyo’’ti? ‘‘Tasmātiha tvaṃ, upavāṇa, imaṃ dhammapariyāyaṃ ‘pāsādiko’ tveva naṃ dhārehī’’ti. Idamavoca bhagavā. Attamano āyasmā upavāṇo bhagavato bhāsitaṃ abhinandīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pāsādikasuttaṃ niṭṭhitaṃ chaṭṭhaṃ."
  }
]