[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammāsambuddhassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "nikaya"
    },
    "innerText": "Dīghanikāye"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "book"
    },
    "innerText": "Sīlakkhandhavaggaṭīkā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subsubhead"
    },
    "innerText": "Ganthārambhakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Saṃvaṇṇanārambhe ",
      " ratanattayavandanā saṃvaṇṇetabbassa dhammassa pabhavanissayavisuddhipaṭivedanatthaṃ, taṃ pana dhammasaṃvaṇṇanāsu viññūnaṃ bahumānuppādanatthaṃ, taṃ sammadeva tesaṃ uggahadhāraṇādikkamaladdhabbāya sammāpaṭipattiyā sabbahitasukhanipphādanatthaṃ. Atha vā maṅgalabhāvato, sabbakiriyāsu pubbakiccabhāvato, paṇḍitehi sammācaritabhāvato, āyatiṃ paresaṃ diṭṭhānugatiāpajjanato ca saṃvaṇṇanāyaṃ ratanattayapaṇāmakiriyā. Atha vā ratanattayapaṇāmakaraṇaṃ pūjanīyapūjāpuññavisesanibbattanatthaṃ, taṃ attano yathāladdhasampattinimittakassa kammassa balānuppādanatthaṃ, antarā ca tassa asaṅkocanatthaṃ, tadubhayaṃ anantarāyena aṭṭhakathāya parisamāpanatthaṃ. Idameva ca payojanaṃ ācariyena idhādhippetaṃ. Tathā hi vakkhati – ‘‘iti me pasannamatino…pe… tassānubhāvenā’’ti. Vatthuttayapūjā hi niratisayapuññakkhettasambuddhiyā aparimeyyappabhāvo ",
      " puññātisayoti bahuvidhantarāyepi lokasannivāse antarāyanibandhanasakalasaṃkilesaviddhaṃsanāya pahoti, bhayādiupaddavañca nivāreti. Yathāha –"
    ],
    "innerText": "Saṃvaṇṇanārambhe ratanattayavandanā saṃvaṇṇetabbassa dhammassa pabhavanissayavisuddhipaṭivedanatthaṃ, taṃ pana dhammasaṃvaṇṇanāsu viññūnaṃ bahumānuppādanatthaṃ, taṃ sammadeva tesaṃ uggahadhāraṇādikkamaladdhabbāya sammāpaṭipattiyā sabbahitasukhanipphādanatthaṃ. Atha vā maṅgalabhāvato, sabbakiriyāsu pubbakiccabhāvato, paṇḍitehi sammācaritabhāvato, āyatiṃ paresaṃ diṭṭhānugatiāpajjanato ca saṃvaṇṇanāyaṃ ratanattayapaṇāmakiriyā. Atha vā ratanattayapaṇāmakaraṇaṃ pūjanīyapūjāpuññavisesanibbattanatthaṃ, taṃ attano yathāladdhasampattinimittakassa kammassa balānuppādanatthaṃ, antarā ca tassa asaṅkocanatthaṃ, tadubhayaṃ anantarāyena aṭṭhakathāya parisamāpanatthaṃ. Idameva ca payojanaṃ ācariyena idhādhippetaṃ. Tathā hi vakkhati – ‘‘iti me pasannamatino…pe… tassānubhāvenā’’ti. Vatthuttayapūjā hi niratisayapuññakkhettasambuddhiyā aparimeyyappabhāvo puññātisayoti bahuvidhantarāyepi lokasannivāse antarāyanibandhanasakalasaṃkilesaviddhaṃsanāya pahoti, bhayādiupaddavañca nivāreti. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pūjārahe pūjayato, buddhe yadi va sāvake’’tiādi (dha. pa. 1.195; apa. 1.10.1), tathā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Ye ",
      " bhikkhave buddhe pasannā, agge te pasannā. Agge kho pana pasannānaṃ aggo vipāko hotī’’tiādi (a. ni. 4.34; itivu. 90)."
    ],
    "innerText": "‘‘Ye bhikkhave buddhe pasannā, agge te pasannā. Agge kho pana pasannānaṃ aggo vipāko hotī’’tiādi (a. ni. 4.34; itivu. 90)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Buddhoti ",
      " kittayantassa, kāye bhavati yā pīti;"
    ],
    "innerText": "‘‘Buddhoti kittayantassa, kāye bhavati yā pīti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Varameva hi sā pīti, kasiṇenapi jambudīpassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammoti…pe… saṅghoti…pe… dīpassā’’ti. (dī. ni. aṭṭha. 1.6);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tathā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Yasmiṃ, mahānāma, samaye ariyasāvako tathāgataṃ anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosa…pe… na mohapariyuṭṭhitaṃ cittaṃ hotī’’tiādi (a. ni. 6.10; 11.11),"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Araññe rukkhamūle vā…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Bhayaṃ vā chambhitattaṃ vā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Lomahaṃso na hessatī’’ti. (saṃ. ni. 1.249) ca"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yassa vatthuttayassa vandanaṃ kattukāmo, tassa guṇātisayayogasandassanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘karuṇāsītalahadaya’’"
      },
      "ntiādinā gāthattayamāha. Guṇātisayayogena hi vandanārahabhāvo, vandanārahe ca katā vandanā yathādhippetappayojanaṃ sādhetīti. Tattha yassā desanāya saṃvaṇṇanaṃ kattukāmo, sā na vinayadesanā viya karuṇāppadhānā, nāpi abhidhammadesanā viya paññāppadhānā, atha kho karuṇāpaññāppadhānāti tadubhayappadhānameva tāva sammāsambuddhassa thomanaṃ kātuṃ taṃmūlakattā sesaratanānaṃ ‘‘karuṇāsītalahadaya’’ntiādi vuttaṃ."
    ],
    "innerText": "Tattha yassa vatthuttayassa vandanaṃ kattukāmo, tassa guṇātisayayogasandassanatthaṃ ‘‘karuṇāsītalahadaya’’ntiādinā gāthattayamāha. Guṇātisayayogena hi vandanārahabhāvo, vandanārahe ca katā vandanā yathādhippetappayojanaṃ sādhetīti. Tattha yassā desanāya saṃvaṇṇanaṃ kattukāmo, sā na vinayadesanā viya karuṇāppadhānā, nāpi abhidhammadesanā viya paññāppadhānā, atha kho karuṇāpaññāppadhānāti tadubhayappadhānameva tāva sammāsambuddhassa thomanaṃ kātuṃ taṃmūlakattā sesaratanānaṃ ‘‘karuṇāsītalahadaya’’ntiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " kiratīti karuṇā, paradukkhaṃ vikkhipati, apanetīti attho. Atha vā kiṇātīti karuṇā, paradukkhe sati kāruṇikaṃ hiṃsati, vibādhatīti attho, paradukkhe sati sādhūnaṃ ",
      " kampanaṃ hadayakhedaṃ karotīti vā karuṇā. Atha vā kamiti sukhaṃ, taṃ rundhatīti karuṇā. Esā hi paradukkhāpanayanakāmatālakkhaṇā, attasukhanirapekkhatāya kāruṇikānaṃ sukhaṃ rundhati vibandhatīti. Karuṇāya sītalaṃ karuṇāsītalaṃ, karuṇāsītalaṃ hadayaṃ assāti karuṇāsītalahadayo, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karuṇāsītalahadayaṃ."
      },
      " Tattha kiñcāpi paresaṃ hitopasaṃhārasukhādiaparihānicchanasabhāvatāya, byāpādāratīnaṃ ujuvipaccanīkatāya ca sattasantānagatasantāpavicchedanākārappavattiyā mettāmuditānampi cittasītalabhāvakāraṇatā upalabbhati, tathāpi ",
      " dukkhāpanayanākārappavattiyā parūpatāpāsahanarasā avihiṃsābhūtā karuṇā visesena bhagavato cittassa cittapassaddhi viya sītībhāvanimittanti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘karuṇāsītalahadaya’’"
      },
      "nti. Karuṇāmukhena vā mettāmuditānampi hadayasītalabhāvakāraṇatā vuttāti daṭṭhabbaṃ."
    ],
    "innerText": "Tattha kiratīti karuṇā, paradukkhaṃ vikkhipati, apanetīti attho. Atha vā kiṇātīti karuṇā, paradukkhe sati kāruṇikaṃ hiṃsati, vibādhatīti attho, paradukkhe sati sādhūnaṃ kampanaṃ hadayakhedaṃ karotīti vā karuṇā. Atha vā kamiti sukhaṃ, taṃ rundhatīti karuṇā. Esā hi paradukkhāpanayanakāmatālakkhaṇā, attasukhanirapekkhatāya kāruṇikānaṃ sukhaṃ rundhati vibandhatīti. Karuṇāya sītalaṃ karuṇāsītalaṃ, karuṇāsītalaṃ hadayaṃ assāti karuṇāsītalahadayo, taṃ karuṇāsītalahadayaṃ. Tattha kiñcāpi paresaṃ hitopasaṃhārasukhādiaparihānicchanasabhāvatāya, byāpādāratīnaṃ ujuvipaccanīkatāya ca sattasantānagatasantāpavicchedanākārappavattiyā mettāmuditānampi cittasītalabhāvakāraṇatā upalabbhati, tathāpi dukkhāpanayanākārappavattiyā parūpatāpāsahanarasā avihiṃsābhūtā karuṇā visesena bhagavato cittassa cittapassaddhi viya sītībhāvanimittanti vuttaṃ ‘‘karuṇāsītalahadaya’’nti. Karuṇāmukhena vā mettāmuditānampi hadayasītalabhāvakāraṇatā vuttāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā asādhāraṇañāṇavisesanibandhanabhūtā sātisayaṃ niravasesañca sabbaññutaññāṇaṃ viya savisayabyāpitāya mahākaruṇābhāvaṃ upagatā karuṇāva bhagavato atisayena hadayasītalabhāvahetūti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘karuṇāsītalahadaya’’"
      },
      "nti. Atha vā satipi mettāmuditānaṃ sātisaye hadayasītībhāvanibandhanatte sakalabuddhaguṇavisesakāraṇatāya tāsampi kāraṇanti karuṇāva bhagavato hadayasītalabhāvakāraṇaṃ vuttā. Karuṇānidānā hi sabbepi buddhaguṇā. Karuṇānubhāvanibbāpiyamānasaṃsāradukkhasantāpassa hi bhagavato paradukkhāpanayanakāmatāya anekānipi asaṅkheyyāni kappānaṃ akilantarūpasseva niravasesabuddhakaradhammasambharaṇaniyatassa samadhigatadhammādhipateyyassa ca sannihitesupi sattasaṅkhārasamupanītahadayūpatāpanimittesu na īsakampi ",
      " cittasītībhāvassaññathattamahosīti. Etasmiñca atthavikappe tīsupi avatthāsu bhagavato karuṇā saṅgahitāti daṭṭhabbaṃ."
    ],
    "innerText": "Atha vā asādhāraṇañāṇavisesanibandhanabhūtā sātisayaṃ niravasesañca sabbaññutaññāṇaṃ viya savisayabyāpitāya mahākaruṇābhāvaṃ upagatā karuṇāva bhagavato atisayena hadayasītalabhāvahetūti āha ‘‘karuṇāsītalahadaya’’nti. Atha vā satipi mettāmuditānaṃ sātisaye hadayasītībhāvanibandhanatte sakalabuddhaguṇavisesakāraṇatāya tāsampi kāraṇanti karuṇāva bhagavato hadayasītalabhāvakāraṇaṃ vuttā. Karuṇānidānā hi sabbepi buddhaguṇā. Karuṇānubhāvanibbāpiyamānasaṃsāradukkhasantāpassa hi bhagavato paradukkhāpanayanakāmatāya anekānipi asaṅkheyyāni kappānaṃ akilantarūpasseva niravasesabuddhakaradhammasambharaṇaniyatassa samadhigatadhammādhipateyyassa ca sannihitesupi sattasaṅkhārasamupanītahadayūpatāpanimittesu na īsakampi cittasītībhāvassaññathattamahosīti. Etasmiñca atthavikappe tīsupi avatthāsu bhagavato karuṇā saṅgahitāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pajānātīti paññā, yathāsabhāvaṃ pakārehi paṭivijjhatīti attho. Paññāva ñeyyāvaraṇappahānato pakārehi dhammasabhāvāvajotanaṭṭhena pajjototi paññāpajjoto, savāsanappahānato visesena hataṃ samugghāṭitaṃ vihataṃ, paññāpajjotena vihataṃ paññāpajjotavihataṃ. Muyhanti tena, sayaṃ vā muyhati, mohanamattameva vā tanti moho, avijjā, sveva visayasabhāvapaṭicchādanato andhakārasarikkhatāya tamo viyāti tamo, paññāpajjotavihato mohatamo etassāti paññāpajjotavihatamohatamo, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāpajjotavihatamohatamaṃ"
      },
      ". Sabbesampi hi khīṇāsavānaṃ satipi paññāpajjotena avijjāndhakārassa vihatabhāve saddhādhimuttehi viya diṭṭhippattānaṃ sāvakehi, paccekasambuddhehi ca savāsanappahānena sammāsambuddhānaṃ kilesappahānassa viseso vijjatīti sātisayena avijjāppahānena bhagavantaṃ thomento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paññāpajjotavihatamohatama’’"
      },
      "nti."
    ],
    "innerText": "Pajānātīti paññā, yathāsabhāvaṃ pakārehi paṭivijjhatīti attho. Paññāva ñeyyāvaraṇappahānato pakārehi dhammasabhāvāvajotanaṭṭhena pajjototi paññāpajjoto, savāsanappahānato visesena hataṃ samugghāṭitaṃ vihataṃ, paññāpajjotena vihataṃ paññāpajjotavihataṃ. Muyhanti tena, sayaṃ vā muyhati, mohanamattameva vā tanti moho, avijjā, sveva visayasabhāvapaṭicchādanato andhakārasarikkhatāya tamo viyāti tamo, paññāpajjotavihato mohatamo etassāti paññāpajjotavihatamohatamo, taṃ paññāpajjotavihatamohatamaṃ. Sabbesampi hi khīṇāsavānaṃ satipi paññāpajjotena avijjāndhakārassa vihatabhāve saddhādhimuttehi viya diṭṭhippattānaṃ sāvakehi, paccekasambuddhehi ca savāsanappahānena sammāsambuddhānaṃ kilesappahānassa viseso vijjatīti sātisayena avijjāppahānena bhagavantaṃ thomento āha ‘‘paññāpajjotavihatamohatama’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " vā antarena paropadesaṃ attano santāne accantaṃ avijjāndhakāravigamassa nibbattitattā, tattha ca sabbaññutāya, balesu ca vasībhāvassa samadhigatattā, parasantatiyañca dhammadesanātisayānubhāvena sammadeva tassa pavattitattā bhagavāva visesato mohatamavigamena thometabboti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paññāpajjotavihatamohatama’’"
      },
      "nti. Imasmiñca atthavikappe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paññāpajjoto’’"
      },
      "ti padena bhagavato paṭivedhapaññā viya desanāpaññāpi sāmaññaniddesena ekasesanayena vā saṅgahitāti daṭṭhabbaṃ."
    ],
    "innerText": "Atha vā antarena paropadesaṃ attano santāne accantaṃ avijjāndhakāravigamassa nibbattitattā, tattha ca sabbaññutāya, balesu ca vasībhāvassa samadhigatattā, parasantatiyañca dhammadesanātisayānubhāvena sammadeva tassa pavattitattā bhagavāva visesato mohatamavigamena thometabboti āha ‘‘paññāpajjotavihatamohatama’’nti. Imasmiñca atthavikappe ‘‘paññāpajjoto’’ti padena bhagavato paṭivedhapaññā viya desanāpaññāpi sāmaññaniddesena ekasesanayena vā saṅgahitāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " vā bhagavato ñāṇassa ñeyyapariyantikattā sakalañeyyadhammasabhāvābodhanasamatthena anāvaraṇañāṇasaṅkhātena paññāpajjotena sabbañeyyadhammasabhāvacchādakassa mohandhakārassa vidhamitattā anaññasādhāraṇo bhagavato mohatamavināsoti katvā vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paññāpajjotavihatamohatama’’"
      },
      "nti. Ettha ca mohatamavidhamanante adhigatattā anāvaraṇañāṇaṃ kāraṇūpacārena sakasantāne mohatamavidhamanaṃ daṭṭhabbaṃ. Abhinīhārasampattiyā savāsanappahānameva hi kilesānaṃ ‘‘ñeyyāvaraṇappahāna’’nti, parasantāne pana mohatamavidhamanassa kāraṇabhāvato anāvaraṇañāṇaṃ ‘‘mohatamavidhamana’’nti vuccatīti."
    ],
    "innerText": "Atha vā bhagavato ñāṇassa ñeyyapariyantikattā sakalañeyyadhammasabhāvābodhanasamatthena anāvaraṇañāṇasaṅkhātena paññāpajjotena sabbañeyyadhammasabhāvacchādakassa mohandhakārassa vidhamitattā anaññasādhāraṇo bhagavato mohatamavināsoti katvā vuttaṃ ‘‘paññāpajjotavihatamohatama’’nti. Ettha ca mohatamavidhamanante adhigatattā anāvaraṇañāṇaṃ kāraṇūpacārena sakasantāne mohatamavidhamanaṃ daṭṭhabbaṃ. Abhinīhārasampattiyā savāsanappahānameva hi kilesānaṃ ‘‘ñeyyāvaraṇappahāna’’nti, parasantāne pana mohatamavidhamanassa kāraṇabhāvato anāvaraṇañāṇaṃ ‘‘mohatamavidhamana’’nti vuccatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kiṃ pana kāraṇaṃ avijjāvigghāto yeveko pahānasampattivasena bhagavato thomanānimittaṃ gayhati, na pana sātisayaniravasesakilesappahānanti? Tappahānavacaneneva tadekaṭṭhatāya sakalasaṃkilesagaṇasamugghātajotitabhāvato. Na hi so tādiso kileso atthi, yo niravasesaavijjāppahānena na pahīyatīti. Atha vā vijjā viya sakalakusaladhammasamuppattiyā niravasesākusaladhammanibbattiyā, saṃsārappavattiyā ca avijjā padhānakāraṇanti tabbigghātavacanena sakalasaṃkilesagaṇasamugghāto vuttoyeva hotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paññāpajjotavihatamohatama’’"
      },
      "nti."
    ],
    "innerText": "Kiṃ pana kāraṇaṃ avijjāvigghāto yeveko pahānasampattivasena bhagavato thomanānimittaṃ gayhati, na pana sātisayaniravasesakilesappahānanti? Tappahānavacaneneva tadekaṭṭhatāya sakalasaṃkilesagaṇasamugghātajotitabhāvato. Na hi so tādiso kileso atthi, yo niravasesaavijjāppahānena na pahīyatīti. Atha vā vijjā viya sakalakusaladhammasamuppattiyā niravasesākusaladhammanibbattiyā, saṃsārappavattiyā ca avijjā padhānakāraṇanti tabbigghātavacanena sakalasaṃkilesagaṇasamugghāto vuttoyeva hotīti vuttaṃ ‘‘paññāpajjotavihatamohatama’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Narā ca amarā ca narāmarā, saha narāmarehīti sanarāmaro, sanarāmaro ca so loko cāti sanarāmaraloko, tassa garuti sanarāmaralokagaru, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sanarāmaralokagaruṃ."
      },
      " Etena devamanussānaṃ ",
      " viya tadavasiṭṭhasattānampi yathārahaṃ guṇavisesāvahato bhagavato upakāritaṃ ",
      " dasseti. Na cettha padhānāpadhānabhāvo codetabbo. Añño hi saddakkamo, añño atthakkamo. Edisesu hi samāsapadesu ",
      " padhānampi appadhānaṃ viya niddisīyati yathā – ‘‘sarājikāya parisāyā’’ti (apa. aṭṭha. 1.82). Kāmañcettha sattasaṅkhārabhājanavasena tividho loko, garubhāvassa pana adhippetattā garukaraṇasamatthasseva yujjanato sattalokassavasena attho gahetabbo. So hi lokiyanti ettha puññapāpāni tabbipāko cāti ‘‘loko’’ti vuccati. Amaraggahaṇena cettha upapattidevā adhippetā."
    ],
    "innerText": "Narā ca amarā ca narāmarā, saha narāmarehīti sanarāmaro, sanarāmaro ca so loko cāti sanarāmaraloko, tassa garuti sanarāmaralokagaru, taṃ sanarāmaralokagaruṃ. Etena devamanussānaṃ viya tadavasiṭṭhasattānampi yathārahaṃ guṇavisesāvahato bhagavato upakāritaṃ dasseti. Na cettha padhānāpadhānabhāvo codetabbo. Añño hi saddakkamo, añño atthakkamo. Edisesu hi samāsapadesu padhānampi appadhānaṃ viya niddisīyati yathā – ‘‘sarājikāya parisāyā’’ti (apa. aṭṭha. 1.82). Kāmañcettha sattasaṅkhārabhājanavasena tividho loko, garubhāvassa pana adhippetattā garukaraṇasamatthasseva yujjanato sattalokassavasena attho gahetabbo. So hi lokiyanti ettha puññapāpāni tabbipāko cāti ‘‘loko’’ti vuccati. Amaraggahaṇena cettha upapattidevā adhippetā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā samūhattho loka-saddo samudāyavasena lokīyati paññāpīyatīti. Saha narehīti sanarā, sanarā ca te amarā ceti sanarāmarā, tesaṃ lokoti sanarāmaralokoti purimanayeneva yojetabbaṃ. Amara-saddena cettha visuddhidevāpi saṅgayhanti. Te hi maraṇābhāvato paramatthato amarā. Narāmarānaṃyeva ca gahaṇaṃ ukkaṭṭhaniddesavasena, yathā – ‘‘satthā devamanussāna’’nti (dī. ni. 1.157). Tathā hi sabbānatthapariharaṇapubbaṅgamāya niravasesahitasukhavidhānatapparāya niratisayāya payogasampattiyā sadevamanussāya pajāya accantupakāritāya, aparimitanirupamappabhāvaguṇavisesasamaṅgitāya ca sabbasattuttamo bhagavā aparimāṇāsu lokadhātūsu aparimāṇānaṃ sattānaṃ uttamaṃ gāravaṭṭhānaṃ, tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sanarāmaralokagaru’’"
      },
      "nti."
    ],
    "innerText": "Atha vā samūhattho loka-saddo samudāyavasena lokīyati paññāpīyatīti. Saha narehīti sanarā, sanarā ca te amarā ceti sanarāmarā, tesaṃ lokoti sanarāmaralokoti purimanayeneva yojetabbaṃ. Amara-saddena cettha visuddhidevāpi saṅgayhanti. Te hi maraṇābhāvato paramatthato amarā. Narāmarānaṃyeva ca gahaṇaṃ ukkaṭṭhaniddesavasena, yathā – ‘‘satthā devamanussāna’’nti (dī. ni. 1.157). Tathā hi sabbānatthapariharaṇapubbaṅgamāya niravasesahitasukhavidhānatapparāya niratisayāya payogasampattiyā sadevamanussāya pajāya accantupakāritāya, aparimitanirupamappabhāvaguṇavisesasamaṅgitāya ca sabbasattuttamo bhagavā aparimāṇāsu lokadhātūsu aparimāṇānaṃ sattānaṃ uttamaṃ gāravaṭṭhānaṃ, tena vuttaṃ – ‘‘sanarāmaralokagaru’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sobhanaṃ gataṃ gamanaṃ etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugato."
      },
      " Bhagavato hi veneyyajanupasaṅkamanaṃ ekantena tesaṃ hitasukhanipphādanato sobhanaṃ, tathā lakkhaṇānubyañjana (dī. ni. 2.33; 3.198-200; ma. ni. 2.385, 386) paṭimaṇḍitarūpakāyatāyadutavilambita- khalitānukaḍḍhananippīḷanukkuṭikakuṭilākulatādidosarahitaṃ vilāsitarājahaṃsavasabhavāraṇamigarājagamanaṃ kāyagamanaṃ ",
      " ñāṇagamanañca vipulanimmalakaruṇāsativīriyādiguṇavisesasahitamabhinīhārato yāva mahābodhi anavajjatāya sobhanamevāti."
    ],
    "innerText": "Sobhanaṃ gataṃ gamanaṃ etassāti sugato. Bhagavato hi veneyyajanupasaṅkamanaṃ ekantena tesaṃ hitasukhanipphādanato sobhanaṃ, tathā lakkhaṇānubyañjana (dī. ni. 2.33; 3.198-200; ma. ni. 2.385, 386) paṭimaṇḍitarūpakāyatāyadutavilambita- khalitānukaḍḍhananippīḷanukkuṭikakuṭilākulatādidosarahitaṃ vilāsitarājahaṃsavasabhavāraṇamigarājagamanaṃ kāyagamanaṃ ñāṇagamanañca vipulanimmalakaruṇāsativīriyādiguṇavisesasahitamabhinīhārato yāva mahābodhi anavajjatāya sobhanamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā sayambhuñāṇena sakalampi lokaṃ pariññābhisamayavasena parijānanto ñāṇena sammā gato avagatoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugato."
      },
      " Tathā lokasamudayaṃ ",
      " pahānābhisamayavasena pajahanto anuppattidhammataṃ āpādento sammā gato atītoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugato."
      },
      " Lokanirodhaṃ nibbānaṃ sacchikiriyābhisamayavasena sammā gato adhigatoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugato."
      },
      " Lokanirodhagāminipaṭipadaṃ bhāvanābhisamayavasena sammā gato paṭipannoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugato."
      },
      " Sotāpattimaggena ye kilesā pahīnā, te kilese na puneti, na pacceti, na paccāgacchatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugato"
      },
      "tiādinā nayena ayamattho vibhāvetabbo ",
      ". Atha vā sundaraṃ ṭhānaṃ sammāsambodhiṃ nibbānameva vā gato adhigatoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugato."
      },
      " Yasmā vā bhūtaṃ tacchaṃ atthasañhitaṃ vineyyānaṃ yathārahaṃ kālayuttameva ca dhammaṃ bhāsati, tasmā sammā gadatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugato,"
      },
      " da-kārassa ta-kāraṃ katvā. Iti sobhanagamanatādīhi sugato, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugataṃ."
      }
    ],
    "innerText": "Atha vā sayambhuñāṇena sakalampi lokaṃ pariññābhisamayavasena parijānanto ñāṇena sammā gato avagatoti sugato. Tathā lokasamudayaṃ pahānābhisamayavasena pajahanto anuppattidhammataṃ āpādento sammā gato atītoti sugato. Lokanirodhaṃ nibbānaṃ sacchikiriyābhisamayavasena sammā gato adhigatoti sugato. Lokanirodhagāminipaṭipadaṃ bhāvanābhisamayavasena sammā gato paṭipannoti sugato. Sotāpattimaggena ye kilesā pahīnā, te kilese na puneti, na pacceti, na paccāgacchatīti sugatotiādinā nayena ayamattho vibhāvetabbo . Atha vā sundaraṃ ṭhānaṃ sammāsambodhiṃ nibbānameva vā gato adhigatoti sugato. Yasmā vā bhūtaṃ tacchaṃ atthasañhitaṃ vineyyānaṃ yathārahaṃ kālayuttameva ca dhammaṃ bhāsati, tasmā sammā gadatīti sugato, da-kārassa ta-kāraṃ katvā. Iti sobhanagamanatādīhi sugato, taṃ sugataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puññapāpakammehi upapajjanavasena gantabbato gatiyo, upapattibhavavisesā. Tā pana nirayādivasena pañcavidhā, tāhi sakalassāpi bhavagāmikammassa ariyamaggādhigamena avipākārahabhāvakaraṇena nivattitattā bhagavā pañcahipi gatīhi suṭṭhu mutto visaṃyuttoti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘gativimutta’’"
      },
      "nti. Etena bhagavato katthacipi gatiyā apariyāpannataṃ dasseti, yato bhagavā ‘‘devātidevo’’ti vuccati, tenevāha –"
    ],
    "innerText": "Puññapāpakammehi upapajjanavasena gantabbato gatiyo, upapattibhavavisesā. Tā pana nirayādivasena pañcavidhā, tāhi sakalassāpi bhavagāmikammassa ariyamaggādhigamena avipākārahabhāvakaraṇena nivattitattā bhagavā pañcahipi gatīhi suṭṭhu mutto visaṃyuttoti āha – ‘‘gativimutta’’nti. Etena bhagavato katthacipi gatiyā apariyāpannataṃ dasseti, yato bhagavā ‘‘devātidevo’’ti vuccati, tenevāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yena devūpapatyassa, gandhabbo vā vihaṅgamo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Yakkhattaṃ yena gaccheyyaṃ, manussattañca abbaje;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Te mayhaṃ āsavā khīṇā, viddhastā vinaḷīkatā’’ti. (a. ni. 4.36);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Taṃtaṃgatisaṃvattanakānañhi ",
      " kammakilesānaṃ aggamaggena bodhimūleyeva suppahīnattā natthi bhagavato gatipariyāpannatāti accantameva bhagavā sabbabhavayonigativiññāṇaṭṭhitisattāvāsasattanikāyehi suparimutto, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gativimuttaṃ. Vande"
      },
      "ti namāmi, thomemīti vā attho."
    ],
    "innerText": "Taṃtaṃgatisaṃvattanakānañhi kammakilesānaṃ aggamaggena bodhimūleyeva suppahīnattā natthi bhagavato gatipariyāpannatāti accantameva bhagavā sabbabhavayonigativiññāṇaṭṭhitisattāvāsasattanikāyehi suparimutto, taṃ gativimuttaṃ. Vandeti namāmi, thomemīti vā attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gativimutta"
      },
      "nti anupādisesanibbānadhātuppattiyā bhagavantaṃ thometi. Ettha hi dvīhākārehi bhagavato thomanā veditabbā – attahitasampattito, parahitapaṭipattito ca. Tesu attahitasampatti anāvaraṇañāṇādhigamato, savāsanānaṃ sabbesaṃ kilesānaṃ accantappahānato, anupādisesanibbānappattito ca veditabbā. Parahitapaṭipatti lābhasakkārādinirapekkhacittassa ",
      " sabbadukkhaniyyānikadhammadesanāto, viruddhesupi niccaṃ hitajjhāsayato, ñāṇaparipākakālāgamanato ca. Sā panettha āsayato payogato ca duvidhā parahitapaṭipatti, tividhā ca attahitasampatti pakāsitā hoti. Kathaṃ? ‘‘Karuṇāsītalahadaya’’nti etena āsayato parahitapaṭipatti, sammā gadanatthena sugata-saddena payogato parahitapaṭipatti, ‘‘paññāpajjotavihatamohatamaṃ gativimutta’’nti etehi catusaccapaṭivedhatthena ca sugata-saddena tividhāpi ",
      " attahitasampatti, avasiṭṭhena, ‘‘paññāpajjotavihatamohatama’’nti etena ca sabbāpi attahitasampattiparahitapaṭipatti pakāsitā hotīti."
    ],
    "innerText": "Atha vā gativimuttanti anupādisesanibbānadhātuppattiyā bhagavantaṃ thometi. Ettha hi dvīhākārehi bhagavato thomanā veditabbā – attahitasampattito, parahitapaṭipattito ca. Tesu attahitasampatti anāvaraṇañāṇādhigamato, savāsanānaṃ sabbesaṃ kilesānaṃ accantappahānato, anupādisesanibbānappattito ca veditabbā. Parahitapaṭipatti lābhasakkārādinirapekkhacittassa sabbadukkhaniyyānikadhammadesanāto, viruddhesupi niccaṃ hitajjhāsayato, ñāṇaparipākakālāgamanato ca. Sā panettha āsayato payogato ca duvidhā parahitapaṭipatti, tividhā ca attahitasampatti pakāsitā hoti. Kathaṃ? ‘‘Karuṇāsītalahadaya’’nti etena āsayato parahitapaṭipatti, sammā gadanatthena sugata-saddena payogato parahitapaṭipatti, ‘‘paññāpajjotavihatamohatamaṃ gativimutta’’nti etehi catusaccapaṭivedhatthena ca sugata-saddena tividhāpi attahitasampatti, avasiṭṭhena, ‘‘paññāpajjotavihatamohatama’’nti etena ca sabbāpi attahitasampattiparahitapaṭipatti pakāsitā hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā tīhākārehi bhagavato thomanā veditabbā – hetuto, phalato, upakārato ca. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetu"
      },
      " mahākaruṇā, sā paṭhamapadena nidassitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phalaṃ"
      },
      " catubbidhaṃ – ñāṇasampadā, pahānasampadā, ānubhāvasampadā, rūpakāyasampadā cāti. Tāsu ñāṇappahānasampadā dutiyapadena saccappaṭivedhatthena ca sugata-saddena pakāsitā honti. Ānubhāvasampadā tatiyapadena, rūpakāyasampadā ",
      " yathāvuttakāyagamanasobhanatthena sugata-saddena, lakkhaṇānubyañjanapāripūriyā (dī. ni. 2.33; 3.198-200; ma. ni. 2.385-386) vinā tadabhāvato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upakāro"
      },
      " antaraṃ abāhiraṃ karitvā tividhayānamukhena vimuttidhammadesanā, so sammā gadanatthena sugata-saddena pakāsito hotīti veditabbaṃ."
    ],
    "innerText": "Atha vā tīhākārehi bhagavato thomanā veditabbā – hetuto, phalato, upakārato ca. Tattha hetu mahākaruṇā, sā paṭhamapadena nidassitā. Phalaṃ catubbidhaṃ – ñāṇasampadā, pahānasampadā, ānubhāvasampadā, rūpakāyasampadā cāti. Tāsu ñāṇappahānasampadā dutiyapadena saccappaṭivedhatthena ca sugata-saddena pakāsitā honti. Ānubhāvasampadā tatiyapadena, rūpakāyasampadā yathāvuttakāyagamanasobhanatthena sugata-saddena, lakkhaṇānubyañjanapāripūriyā (dī. ni. 2.33; 3.198-200; ma. ni. 2.385-386) vinā tadabhāvato. Upakāro antaraṃ abāhiraṃ karitvā tividhayānamukhena vimuttidhammadesanā, so sammā gadanatthena sugata-saddena pakāsito hotīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ‘‘karuṇāsītalahadaya’’nti etena sammāsambodhiyā mūlaṃ dasseti. Mahākaruṇāsañcoditamānaso hi bhagavā saṃsārapaṅkato sattānaṃ samuddharaṇatthaṃ katābhinīhāro anupubbena pāramiyo pūretvā anuttaraṃ sammāsambodhiṃ adhigatoti karuṇā sammāsambodhiyā mūlaṃ. ‘‘Paññāpajjotavihatamohatama’’nti etena sammāsambodhiṃ dasseti. Anāvaraṇañāṇapadaṭṭhānañhi maggañāṇaṃ, maggañāṇapadaṭṭhānañca anāvaraṇañāṇaṃ ‘‘sammāsambodhī’’ti vuccatīti. Sammā gadanatthena sugata-saddena sammāsambodhiyā paṭipattiṃ dasseti, līnuddhaccapatiṭṭhānāyūhanakāmasukhallikattakilamathānuyoga- sassatucchedābhinivesādiantadvayarahitāya karuṇāpaññāpariggahitāya ",
      " majjhimāya paṭipattiyā pakāsanato sugata-saddassa. Itarehi sammāsambodhiyā padhānāppadhānabhedaṃ payojanaṃ dasseti. Saṃsāramahoghato sattasantāraṇañcettha padhānaṃ payojanaṃ, tadaññamappadhānaṃ. Tesu padhānena parahitappaṭipattiṃ dasseti, itarena attahitasampattiṃ, tadubhayena attahitāya paṭipannādīsu (pu. pa. 24, 173) catūsu puggalesu bhagavato catutthapuggalabhāvaṃ dasseti. Tena ca anuttaradakkhiṇeyyabhāvaṃ uttamavandanīyabhāvaṃ, attano ca vandanakiriyāya khettaṅgatabhāvaṃ dasseti."
    ],
    "innerText": "Tattha ‘‘karuṇāsītalahadaya’’nti etena sammāsambodhiyā mūlaṃ dasseti. Mahākaruṇāsañcoditamānaso hi bhagavā saṃsārapaṅkato sattānaṃ samuddharaṇatthaṃ katābhinīhāro anupubbena pāramiyo pūretvā anuttaraṃ sammāsambodhiṃ adhigatoti karuṇā sammāsambodhiyā mūlaṃ. ‘‘Paññāpajjotavihatamohatama’’nti etena sammāsambodhiṃ dasseti. Anāvaraṇañāṇapadaṭṭhānañhi maggañāṇaṃ, maggañāṇapadaṭṭhānañca anāvaraṇañāṇaṃ ‘‘sammāsambodhī’’ti vuccatīti. Sammā gadanatthena sugata-saddena sammāsambodhiyā paṭipattiṃ dasseti, līnuddhaccapatiṭṭhānāyūhanakāmasukhallikattakilamathānuyoga- sassatucchedābhinivesādiantadvayarahitāya karuṇāpaññāpariggahitāya majjhimāya paṭipattiyā pakāsanato sugata-saddassa. Itarehi sammāsambodhiyā padhānāppadhānabhedaṃ payojanaṃ dasseti. Saṃsāramahoghato sattasantāraṇañcettha padhānaṃ payojanaṃ, tadaññamappadhānaṃ. Tesu padhānena parahitappaṭipattiṃ dasseti, itarena attahitasampattiṃ, tadubhayena attahitāya paṭipannādīsu (pu. pa. 24, 173) catūsu puggalesu bhagavato catutthapuggalabhāvaṃ dasseti. Tena ca anuttaradakkhiṇeyyabhāvaṃ uttamavandanīyabhāvaṃ, attano ca vandanakiriyāya khettaṅgatabhāvaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca karuṇāggahaṇena lokiyesu mahaggatabhāvappattāsādhāraṇaguṇadīpanato bhagavato sabbalokiyaguṇasampatti ",
      " dassitā hoti, paññāggahaṇena sabbaññutaññāṇapadaṭṭhānamaggañāṇadīpanato sabbalokuttaraguṇasampatti. Tadubhayaggahaṇasiddho hi attho ‘‘sanarāmaralokagaru’’ntiādinā vipañcīyatīti. Karuṇāggahaṇena ca upagamanaṃ nirupakkilesaṃ ",
      " dasseti, paññāggahaṇena apagamanaṃ. Tathā karuṇāggahaṇena lokasamaññānurūpaṃ bhagavato pavattiṃ dasseti, lokavohāravisayattā karuṇāya, paññāggahaṇena samaññāyānavidhāvanaṃ. Sabhāvānavabodhena hi dhammānaṃ samaññaṃ atidhāvitvā sattādiparāmasanaṃ hotīti. Tathā karuṇāggahaṇena mahākaruṇāsamāpattivihāraṃ dasseti, paññāggahaṇena tīsu kālesu appaṭihatañāṇaṃ, catusaccañāṇaṃ, catuppaṭisambhidāñāṇaṃ, catuvessārajjañāṇaṃ. Karuṇāggahaṇena mahākaruṇāsamāpattiñāṇassa gahitattā sesāsādhāraṇañāṇāni, cha abhiññā, aṭṭhasu parisāsu (ma. ni. 1.151) akampanañāṇāni, dasa balāni, cuddasa buddhañāṇāni, soḷasa ñāṇacariyā, aṭṭhārasa buddhadhammā, (dī. ni. aṭṭha. 3.305; vibha. mūla. ṭī. ganthārambhavaṇṇanāya) catucattārīsa ñāṇavatthūni, (saṃ. ni. 2.34) sattasattati ñāṇavatthūnīti (saṃ. ni. 2.34) evamādīnaṃ anekesaṃ paññāppabhedānaṃ vasena ñāṇacāraṃ dasseti."
    ],
    "innerText": "Ettha ca karuṇāggahaṇena lokiyesu mahaggatabhāvappattāsādhāraṇaguṇadīpanato bhagavato sabbalokiyaguṇasampatti dassitā hoti, paññāggahaṇena sabbaññutaññāṇapadaṭṭhānamaggañāṇadīpanato sabbalokuttaraguṇasampatti. Tadubhayaggahaṇasiddho hi attho ‘‘sanarāmaralokagaru’’ntiādinā vipañcīyatīti. Karuṇāggahaṇena ca upagamanaṃ nirupakkilesaṃ dasseti, paññāggahaṇena apagamanaṃ. Tathā karuṇāggahaṇena lokasamaññānurūpaṃ bhagavato pavattiṃ dasseti, lokavohāravisayattā karuṇāya, paññāggahaṇena samaññāyānavidhāvanaṃ. Sabhāvānavabodhena hi dhammānaṃ samaññaṃ atidhāvitvā sattādiparāmasanaṃ hotīti. Tathā karuṇāggahaṇena mahākaruṇāsamāpattivihāraṃ dasseti, paññāggahaṇena tīsu kālesu appaṭihatañāṇaṃ, catusaccañāṇaṃ, catuppaṭisambhidāñāṇaṃ, catuvessārajjañāṇaṃ. Karuṇāggahaṇena mahākaruṇāsamāpattiñāṇassa gahitattā sesāsādhāraṇañāṇāni, cha abhiññā, aṭṭhasu parisāsu (ma. ni. 1.151) akampanañāṇāni, dasa balāni, cuddasa buddhañāṇāni, soḷasa ñāṇacariyā, aṭṭhārasa buddhadhammā, (dī. ni. aṭṭha. 3.305; vibha. mūla. ṭī. ganthārambhavaṇṇanāya) catucattārīsa ñāṇavatthūni, (saṃ. ni. 2.34) sattasattati ñāṇavatthūnīti (saṃ. ni. 2.34) evamādīnaṃ anekesaṃ paññāppabhedānaṃ vasena ñāṇacāraṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā karuṇāggahaṇena caraṇasampattiṃ, paññāggahaṇena vijjāsampattiṃ. Karuṇāggahaṇena sattādhipatitā, paññāggahaṇena dhammādhipatitā. Karuṇāggahaṇena lokanāthabhāvo, paññāggahaṇena attanāthabhāvo. Tathā karuṇāggahaṇena pubbakāribhāvo, paññāggahaṇena kataññutā ",
      ". Tathā karuṇāggahaṇena aparantapatā, paññāggahaṇena anattantapatā. Karuṇāggahaṇena vā buddhakaradhammasiddhi, paññāggahaṇena buddhabhāvasiddhi. Tathā karuṇāggahaṇena paresaṃ tāraṇaṃ, paññāggahaṇena sayaṃ tāraṇaṃ. Tathā karuṇāggahaṇena sabbasattesu anuggahacittatā, paññāggahaṇena sabbadhammesu virattacittatā dassitā hoti. Sabbesañca ",
      " buddhaguṇānaṃ karuṇā ādi, tannidānabhāvato. Paññā pariyosānaṃ, tato uttarikaraṇīyābhāvato. Iti ādipariyosānadassanena sabbe buddhaguṇā dassitā honti. Tathā karuṇāggahaṇena sīlakkhandhapubbaṅgamo samādhikkhandho dassito hoti. Karuṇānidānañhi sīlaṃ, tato pāṇātipātādiviratippavattito, sā ca jhānattayasampayoginīti. Paññāvacanena paññākkhandho. Sīlañca sabbabuddhaguṇānamādi, samādhi majjhe, paññā pariyosānanti. Evampi ādimajjhapariyosānakalyāṇā sabbe buddhaguṇā dassitā honti, nayato dassitattā. Eso eva hi niravasesato buddhaguṇānaṃ dassanupāyo, yadidaṃ nayaggāhaṇaṃ. Aññathā ko nāma samattho bhagavato guṇe anupadaṃ niravasesato dassetuṃ. Tenevāha –"
    ],
    "innerText": "Tathā karuṇāggahaṇena caraṇasampattiṃ, paññāggahaṇena vijjāsampattiṃ. Karuṇāggahaṇena sattādhipatitā, paññāggahaṇena dhammādhipatitā. Karuṇāggahaṇena lokanāthabhāvo, paññāggahaṇena attanāthabhāvo. Tathā karuṇāggahaṇena pubbakāribhāvo, paññāggahaṇena kataññutā . Tathā karuṇāggahaṇena aparantapatā, paññāggahaṇena anattantapatā. Karuṇāggahaṇena vā buddhakaradhammasiddhi, paññāggahaṇena buddhabhāvasiddhi. Tathā karuṇāggahaṇena paresaṃ tāraṇaṃ, paññāggahaṇena sayaṃ tāraṇaṃ. Tathā karuṇāggahaṇena sabbasattesu anuggahacittatā, paññāggahaṇena sabbadhammesu virattacittatā dassitā hoti. Sabbesañca buddhaguṇānaṃ karuṇā ādi, tannidānabhāvato. Paññā pariyosānaṃ, tato uttarikaraṇīyābhāvato. Iti ādipariyosānadassanena sabbe buddhaguṇā dassitā honti. Tathā karuṇāggahaṇena sīlakkhandhapubbaṅgamo samādhikkhandho dassito hoti. Karuṇānidānañhi sīlaṃ, tato pāṇātipātādiviratippavattito, sā ca jhānattayasampayoginīti. Paññāvacanena paññākkhandho. Sīlañca sabbabuddhaguṇānamādi, samādhi majjhe, paññā pariyosānanti. Evampi ādimajjhapariyosānakalyāṇā sabbe buddhaguṇā dassitā honti, nayato dassitattā. Eso eva hi niravasesato buddhaguṇānaṃ dassanupāyo, yadidaṃ nayaggāhaṇaṃ. Aññathā ko nāma samattho bhagavato guṇe anupadaṃ niravasesato dassetuṃ. Tenevāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Buddhopi buddhassa bhaṇeyya vaṇṇaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Kappampi ce aññamabhāsamāno;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "children": [
      "Khīyetha ",
      " kappo ciradīghamantare,"
    ],
    "innerText": "Khīyetha kappo ciradīghamantare,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vaṇṇo na khīyetha tathāgatassā’’ti. (dī. ni. aṭṭha. 1.304; dī. ni. aṭṭha. 3.141; ma. ni. aṭṭha. 3.425, udā. aṭṭha. 53; bu. vaṃ. aṭṭha. 4.4; cariyā. aṭṭha. nidānakathāyaṃ, pakiṇṇakakathāyaṃ; apa. aṭṭha. 2.6.20);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Teneva ca āyasmatā sāriputtattherenāpi buddhaguṇaparicchedanaṃ pati anuyuttena ‘‘no hetaṃ bhante’’ti (dī. ni. 2.145) paṭikkhipitvā, ‘‘api ca me bhante dhammanvayo vidito’’ti (dī. ni. 2.146) vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ saṅkhepena sakalasabbaññuguṇehi bhagavantaṃ abhitthavitvā idāni saddhammaṃ thometuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘buddhopī’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddho"
      },
      "ti kattuniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddhabhāva"
      },
      "nti kammaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvetvā, sacchikatvā"
      },
      "ti ca pubbakālakiriyāniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ya"
      },
      "nti aniyamato kammaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upagato"
      },
      "ti ",
      " aparakālakiriyāniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vande"
      },
      "ti kiriyāniddeso, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ta"
      },
      "nti ",
      " niyamanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhamma"
      },
      "nti vandanakiriyāya kammaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gatamalaṃ, anuttara"
      },
      "nti ca tabbisesanaṃ."
    ],
    "innerText": "Evaṃ saṅkhepena sakalasabbaññuguṇehi bhagavantaṃ abhitthavitvā idāni saddhammaṃ thometuṃ ‘‘buddhopī’’tiādimāha. Tattha buddhoti kattuniddeso. Buddhabhāvanti kammaniddeso. Bhāvetvā, sacchikatvāti ca pubbakālakiriyāniddeso. Yanti aniyamato kammaniddeso. Upagatoti aparakālakiriyāniddeso. Vandeti kiriyāniddeso, tanti niyamanaṃ. Dhammanti vandanakiriyāya kammaniddeso. Gatamalaṃ, anuttaranti ca tabbisesanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha buddha-saddassa tāva ‘‘bujjhitā saccānīti buddho, bodhetā pajāyāti buddho’’tiādinā (mahāni. 192; cūḷani. 95-97; paṭi. ma. 1.162) niddesanayena attho veditabbo. Atha vā savāsanāya aññāṇaniddāya accantavigamato, buddhiyā vā vikasitabhāvato buddhavāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddho,"
      },
      " jāgaraṇavikasanatthavasena. Atha vā kassacipi ñeyyadhammassa anavabuddhassa abhāvena ñeyyavisesassa kammabhāvena aggahaṇato kammavacanicchāya abhāvena avagamanatthavaseneva kattuniddeso labbhatīti buddhavāti buddho, yathā ‘‘dikkhito na dadātī’’ti, atthato pana pāramitāparibhāvito sayambhūñāṇena saha vāsanāya vihataviddhastaniravasesakileso mahākaruṇāsabbaññutaññāṇādiaparimeyya guṇagaṇādhāro khandhasantāno buddho. Yathāha –"
    ],
    "innerText": "Tattha buddha-saddassa tāva ‘‘bujjhitā saccānīti buddho, bodhetā pajāyāti buddho’’tiādinā (mahāni. 192; cūḷani. 95-97; paṭi. ma. 1.162) niddesanayena attho veditabbo. Atha vā savāsanāya aññāṇaniddāya accantavigamato, buddhiyā vā vikasitabhāvato buddhavāti buddho, jāgaraṇavikasanatthavasena. Atha vā kassacipi ñeyyadhammassa anavabuddhassa abhāvena ñeyyavisesassa kammabhāvena aggahaṇato kammavacanicchāya abhāvena avagamanatthavaseneva kattuniddeso labbhatīti buddhavāti buddho, yathā ‘‘dikkhito na dadātī’’ti, atthato pana pāramitāparibhāvito sayambhūñāṇena saha vāsanāya vihataviddhastaniravasesakileso mahākaruṇāsabbaññutaññāṇādiaparimeyya guṇagaṇādhāro khandhasantāno buddho. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Buddhoti yo so bhagavā sayambhū anācariyako pubbe ananussutesu dhammesu sāmaṃ saccāni abhisambujjhi, tattha ca sabbaññutaṃ patto, balesu ca vasībhāva’’nti (mahāni. 192; cūḷani. 95-97; paṭi. ma. 1.162)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Api"
      },
      "-saddo sambhāvane, tena ‘‘evaṃ guṇavisesayutto sopi nāma bhagavā’’ti vakkhamānaguṇe ",
      " dhamme sambhāvanaṃ dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddhabhāva"
      },
      "nti sammāsambodhiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvetvā"
      },
      "ti uppādetvā, vaḍḍhetvā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacchikatvā"
      },
      "ti paccakkhaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upagato"
      },
      "ti patto, adhigatoti attho, etassa ‘‘buddhabhāva’’nti etena sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gatamala"
      },
      "nti vigatamalaṃ, niddosanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vande"
      },
      "ti paṇamāmi, thomemi ",
      " vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuttara"
      },
      "nti uttararahitaṃ, lokuttaranti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhamma"
      },
      "nti yathānusiṭṭhaṃ paṭipajjamāne apāyato ca, saṃsārato ca apatamāne katvā dhārayatīti dhammo."
    ],
    "innerText": "Api-saddo sambhāvane, tena ‘‘evaṃ guṇavisesayutto sopi nāma bhagavā’’ti vakkhamānaguṇe dhamme sambhāvanaṃ dīpeti. Buddhabhāvanti sammāsambodhiṃ. Bhāvetvāti uppādetvā, vaḍḍhetvā ca. Sacchikatvāti paccakkhaṃ katvā. Upagatoti patto, adhigatoti attho, etassa ‘‘buddhabhāva’’nti etena sambandho. Gatamalanti vigatamalaṃ, niddosanti attho. Vandeti paṇamāmi, thomemi vā. Anuttaranti uttararahitaṃ, lokuttaranti attho. Dhammanti yathānusiṭṭhaṃ paṭipajjamāne apāyato ca, saṃsārato ca apatamāne katvā dhārayatīti dhammo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayañhettha saṅkhepattho – evaṃ vividhaguṇasamannāgato buddhopi bhagavā yaṃ ariyasaṅkhātaṃ dhammaṃ bhāvetvā, phalanibbānasaṅkhātaṃ pana sacchikatvā anuttaraṃ sammāsambodhiṃ adhigato, tametaṃ buddhānampi buddhabhāvahetubhūtaṃ sabbadosamalarahitaṃ attano uttaritarābhāvena anuttaraṃ paṭivedhasaddhammaṃ namāmīti. Pariyattisaddhammassāpi tappakāsanattā idha saṅgaho daṭṭhabbo. Atha ",
      " vā ‘‘abhidhammanayasamuddaṃ bhāvetvā adhigacchi, tīṇi piṭakāni sammasī’’ti ca aṭṭhakathāyaṃ vuttattā pariyattidhammassāpi sacchikiriyāsammasanapariyāyo labbhatīti sopi idha vutto yevāti daṭṭhabbo. Tathā ‘‘yaṃ dhammaṃ bhāvetvā, sacchikatvā’’ti ca vuttattā buddhakaradhammabhūtāhi pāramitāhi saha pubbabhāge adhisīlasikkhādayopi idha dhamma-saddena saṅgahitāti veditabbā. Tāpi hi vigatapaṭipakkhatāya vigatamalā, anaññasādhāraṇatāya anuttarā cāti. Tathā hi sattānaṃ sakalavaṭṭadukkhanissaraṇāya katamahābhinīhāro mahākaruṇādhivāsapesalajjhāsayo paññāvisesapariyodātanimmalānaṃ dānadamasaññamādīnaṃ uttamadhammānaṃ satasahassādhikāni kappānaṃ cattāri asaṅkheyyāni sakkaccaṃ nirantaraṃ niravasesaṃ bhāvanāpaccakkhakaraṇehi kammādīsu adhigatavasībhāvo, acchariyācinteyyamahānubhāvo, adhisīlaadhicittānaṃ paramukkaṃsapāramippatto bhagavā paccayākāre catuvīsatikoṭisatasahassamukhena mahāvajirañāṇaṃ pesetvā anuttaraṃ sammāsambodhiṃ abhisambuddhoti."
    ],
    "innerText": "Ayañhettha saṅkhepattho – evaṃ vividhaguṇasamannāgato buddhopi bhagavā yaṃ ariyasaṅkhātaṃ dhammaṃ bhāvetvā, phalanibbānasaṅkhātaṃ pana sacchikatvā anuttaraṃ sammāsambodhiṃ adhigato, tametaṃ buddhānampi buddhabhāvahetubhūtaṃ sabbadosamalarahitaṃ attano uttaritarābhāvena anuttaraṃ paṭivedhasaddhammaṃ namāmīti. Pariyattisaddhammassāpi tappakāsanattā idha saṅgaho daṭṭhabbo. Atha vā ‘‘abhidhammanayasamuddaṃ bhāvetvā adhigacchi, tīṇi piṭakāni sammasī’’ti ca aṭṭhakathāyaṃ vuttattā pariyattidhammassāpi sacchikiriyāsammasanapariyāyo labbhatīti sopi idha vutto yevāti daṭṭhabbo. Tathā ‘‘yaṃ dhammaṃ bhāvetvā, sacchikatvā’’ti ca vuttattā buddhakaradhammabhūtāhi pāramitāhi saha pubbabhāge adhisīlasikkhādayopi idha dhamma-saddena saṅgahitāti veditabbā. Tāpi hi vigatapaṭipakkhatāya vigatamalā, anaññasādhāraṇatāya anuttarā cāti. Tathā hi sattānaṃ sakalavaṭṭadukkhanissaraṇāya katamahābhinīhāro mahākaruṇādhivāsapesalajjhāsayo paññāvisesapariyodātanimmalānaṃ dānadamasaññamādīnaṃ uttamadhammānaṃ satasahassādhikāni kappānaṃ cattāri asaṅkheyyāni sakkaccaṃ nirantaraṃ niravasesaṃ bhāvanāpaccakkhakaraṇehi kammādīsu adhigatavasībhāvo, acchariyācinteyyamahānubhāvo, adhisīlaadhicittānaṃ paramukkaṃsapāramippatto bhagavā paccayākāre catuvīsatikoṭisatasahassamukhena mahāvajirañāṇaṃ pesetvā anuttaraṃ sammāsambodhiṃ abhisambuddhoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ",
      " ca ‘‘bhāvetvā’’ti etena vijjāsampadāya dhammaṃ thometi, ‘sacchikatvā’ti etena vimuttisampadāya. Tathā paṭhamena jhānasampadāya, dutiyena vimokkhasampadāya. Paṭhamena vā samādhisampadāya, dutiyena samāpattisampadāya. Atha vā paṭhamena khayañāṇabhāvena, dutiyena anuppādañāṇabhāvena. Purimena vā vijjūpamatāya, dutiyena vajirūpamatāya. Purimena vā virāgasampattiyā, dutiyena nirodhasampattiyā. Tathā paṭhamena niyyānabhāvena, dutiyena nissaraṇabhāvena. Paṭhamena vā hetubhāvena, dutiyena asaṅkhatabhāvena. Paṭhamena vā dassanabhāvena, dutiyena vivekabhāvena. Paṭhamena vā adhipatibhāvena, dutiyena amatabhāvena dhammaṃ thometi. Atha vā ‘‘yaṃ dhammaṃ bhāvetvā buddhabhāvaṃ upagato’’ti etena svākkhātatāya dhammaṃ thometi, ‘‘sacchikatvā’’ti ",
      " etena sandiṭṭhikatāya. Tathā purimena akālikatāya, pacchimena ehipassikatāya. Purimena vā opaneyyikatāya, pacchimena paccattaṃ veditabbatāya dhammaṃ thometi."
    ],
    "innerText": "Ettha ca ‘‘bhāvetvā’’ti etena vijjāsampadāya dhammaṃ thometi, ‘sacchikatvā’ti etena vimuttisampadāya. Tathā paṭhamena jhānasampadāya, dutiyena vimokkhasampadāya. Paṭhamena vā samādhisampadāya, dutiyena samāpattisampadāya. Atha vā paṭhamena khayañāṇabhāvena, dutiyena anuppādañāṇabhāvena. Purimena vā vijjūpamatāya, dutiyena vajirūpamatāya. Purimena vā virāgasampattiyā, dutiyena nirodhasampattiyā. Tathā paṭhamena niyyānabhāvena, dutiyena nissaraṇabhāvena. Paṭhamena vā hetubhāvena, dutiyena asaṅkhatabhāvena. Paṭhamena vā dassanabhāvena, dutiyena vivekabhāvena. Paṭhamena vā adhipatibhāvena, dutiyena amatabhāvena dhammaṃ thometi. Atha vā ‘‘yaṃ dhammaṃ bhāvetvā buddhabhāvaṃ upagato’’ti etena svākkhātatāya dhammaṃ thometi, ‘‘sacchikatvā’’ti etena sandiṭṭhikatāya. Tathā purimena akālikatāya, pacchimena ehipassikatāya. Purimena vā opaneyyikatāya, pacchimena paccattaṃ veditabbatāya dhammaṃ thometi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Gatamala’’nti iminā saṃkilesābhāvadīpanena dhammassa parisuddhataṃ dasseti, ‘‘anuttara’’nti etena aññassa visiṭṭhassa abhāvadīpanena vipulaparipuṇṇataṃ. Paṭhamena vā pahānasampadaṃ dhammassa dasseti, dutiyena pabhāvasampadaṃ. Bhāvetabbatāya vā dhammassa gatamalabhāvo yojetabbo ",
      ". Bhāvanāguṇena hi so dosānaṃ samugghātako hotīti. Sacchikātabbabhāvena anuttarabhāvo yojetabbo. Sacchikiriyānibbattito hi taduttarikaraṇīyābhāvato anaññasādhāraṇatāya anuttaroti. Tathā ‘‘bhāvetvā’’ti etena saha pubbabhāgasīlādīhi sekkhā sīlasamādhipaññākkhandhā dassitā honti, ‘‘sacchikatvā’’ti etena saha asaṅkhatāya dhātuyā asekkhā sīlasamādhipaññākkhandhā dassitā hontīti."
    ],
    "innerText": "‘‘Gatamala’’nti iminā saṃkilesābhāvadīpanena dhammassa parisuddhataṃ dasseti, ‘‘anuttara’’nti etena aññassa visiṭṭhassa abhāvadīpanena vipulaparipuṇṇataṃ. Paṭhamena vā pahānasampadaṃ dhammassa dasseti, dutiyena pabhāvasampadaṃ. Bhāvetabbatāya vā dhammassa gatamalabhāvo yojetabbo . Bhāvanāguṇena hi so dosānaṃ samugghātako hotīti. Sacchikātabbabhāvena anuttarabhāvo yojetabbo. Sacchikiriyānibbattito hi taduttarikaraṇīyābhāvato anaññasādhāraṇatāya anuttaroti. Tathā ‘‘bhāvetvā’’ti etena saha pubbabhāgasīlādīhi sekkhā sīlasamādhipaññākkhandhā dassitā honti, ‘‘sacchikatvā’’ti etena saha asaṅkhatāya dhātuyā asekkhā sīlasamādhipaññākkhandhā dassitā hontīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ saṅkhepeneva sabbadhammaguṇehi saddhammaṃ abhitthavitvā, idāni ariyasaṅghaṃ thometuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sugatassā’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugatassā"
      },
      "ti sambandhaniddeso, tassa ‘‘puttāna’’nti etena sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Orasāna"
      },
      "nti puttavisesanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mārasenamathanāna"
      },
      "nti ",
      " orasaputtabhāve kāraṇaniddeso, tena kilesappahānameva bhagavato orasaputtabhāvakāraṇaṃ anujānātīti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhanna"
      },
      "nti gaṇanaparicchedaniddeso, tena ca satipi tesaṃ sattavisesabhāvena anekasatasahassasaṅkhyabhāve imaṃ gaṇanaparicchedaṃ nātivattantīti dasseti, maggaṭṭhaphalaṭṭhabhāvānativattanato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samūha"
      },
      "nti samudāyaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ariyasaṅgha"
      },
      "nti guṇavisiṭṭhasaṅghātabhāvaniddeso, tena asatipi ariyapuggalānaṃ kāyasāmaggiyaṃ ariyasaṅghabhāvaṃ dasseti, diṭṭhisīlasāmaññena saṃhatabhāvato. Tattha urasi bhavā jātā, saṃvaddhā ca orasā. Yathā hi sattānaṃ orasaputtā attajātatāya pitusantakassa dāyajjassa visesena bhāgino honti, evametepi ariyapuggalā sammāsambuddhassa savanante ariyāya jātiyā jātatāya bhagavato santakassa vimuttisukhassa, ariyadhammaratanassa ca ekantabhāginoti orasā viya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "orasā."
      },
      " Atha vā bhagavato dhammadesanānubhāvena ariyabhūmiṃ okkamamānā, okkantā ca ariyasāvakā bhagavato urovāyāmajanitābhijātatāya nippariyāyena ‘‘orasaputtā’’ti vattabbataṃ arahanti. Sāvakehi pavattiyamānāpi hi dhammadesanā bhagavato ‘‘dhammadesanā’’ icceva vuccati, taṃmūlakattā, lakkhaṇādivisesābhāvato ca."
    ],
    "innerText": "Evaṃ saṅkhepeneva sabbadhammaguṇehi saddhammaṃ abhitthavitvā, idāni ariyasaṅghaṃ thometuṃ ‘‘sugatassā’’tiādimāha. Tattha sugatassāti sambandhaniddeso, tassa ‘‘puttāna’’nti etena sambandho. Orasānanti puttavisesanaṃ. Mārasenamathanānanti orasaputtabhāve kāraṇaniddeso, tena kilesappahānameva bhagavato orasaputtabhāvakāraṇaṃ anujānātīti dasseti. Aṭṭhannanti gaṇanaparicchedaniddeso, tena ca satipi tesaṃ sattavisesabhāvena anekasatasahassasaṅkhyabhāve imaṃ gaṇanaparicchedaṃ nātivattantīti dasseti, maggaṭṭhaphalaṭṭhabhāvānativattanato. Samūhanti samudāyaniddeso. Ariyasaṅghanti guṇavisiṭṭhasaṅghātabhāvaniddeso, tena asatipi ariyapuggalānaṃ kāyasāmaggiyaṃ ariyasaṅghabhāvaṃ dasseti, diṭṭhisīlasāmaññena saṃhatabhāvato. Tattha urasi bhavā jātā, saṃvaddhā ca orasā. Yathā hi sattānaṃ orasaputtā attajātatāya pitusantakassa dāyajjassa visesena bhāgino honti, evametepi ariyapuggalā sammāsambuddhassa savanante ariyāya jātiyā jātatāya bhagavato santakassa vimuttisukhassa, ariyadhammaratanassa ca ekantabhāginoti orasā viya orasā. Atha vā bhagavato dhammadesanānubhāvena ariyabhūmiṃ okkamamānā, okkantā ca ariyasāvakā bhagavato urovāyāmajanitābhijātatāya nippariyāyena ‘‘orasaputtā’’ti vattabbataṃ arahanti. Sāvakehi pavattiyamānāpi hi dhammadesanā bhagavato ‘‘dhammadesanā’’ icceva vuccati, taṃmūlakattā, lakkhaṇādivisesābhāvato ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadipi ariyasāvakānaṃ ariyamaggādhigamasamaye bhagavato viya tadantarāyakaraṇatthaṃ devaputtamāro ",
      ", māravāhinī vā na ekantena apasādeti, tehi pana apasādetabbatāya kāraṇe vimathite tepi vimathitā ",
      " eva nāma hontīti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘mārasenamathanāna’’"
      },
      "nti. Imasmiṃ panatthe ‘māramārasenamathanāna’nti vattabbe ‘‘mārasenamathanāna’’nti ekadesasarūpekaseso katoti daṭṭhabbaṃ. Atha vā khandhābhisaṅkhāramārānaṃ viya devaputtamārassāpi guṇamāraṇe ",
      " sahāyabhāvūpagamanato kilesabalakāyo ‘‘senā’’ti vuccati. Yathāha – ‘‘kāmā te paṭhamā senā’’tiādi (su. ni. 438; mahāni. 28, 68; cūḷani. 47). Sā ca tehi diyaḍḍhasahassabhedā, anantabhedā vā kilesavāhinī satidhammavicayavīriyasamathādiguṇapaharaṇehi odhiso vimathitā, vihatā, viddhastā cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mārasenamathanā,"
      },
      " ariyasāvakā. Etena tesaṃ bhagavato anujātaputtataṃ dasseti."
    ],
    "innerText": "Yadipi ariyasāvakānaṃ ariyamaggādhigamasamaye bhagavato viya tadantarāyakaraṇatthaṃ devaputtamāro , māravāhinī vā na ekantena apasādeti, tehi pana apasādetabbatāya kāraṇe vimathite tepi vimathitā eva nāma hontīti āha – ‘‘mārasenamathanāna’’nti. Imasmiṃ panatthe ‘māramārasenamathanāna’nti vattabbe ‘‘mārasenamathanāna’’nti ekadesasarūpekaseso katoti daṭṭhabbaṃ. Atha vā khandhābhisaṅkhāramārānaṃ viya devaputtamārassāpi guṇamāraṇe sahāyabhāvūpagamanato kilesabalakāyo ‘‘senā’’ti vuccati. Yathāha – ‘‘kāmā te paṭhamā senā’’tiādi (su. ni. 438; mahāni. 28, 68; cūḷani. 47). Sā ca tehi diyaḍḍhasahassabhedā, anantabhedā vā kilesavāhinī satidhammavicayavīriyasamathādiguṇapaharaṇehi odhiso vimathitā, vihatā, viddhastā cāti mārasenamathanā, ariyasāvakā. Etena tesaṃ bhagavato anujātaputtataṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ārakattā kilesehi, anaye na iriyanato, aye ca iriyanato ariyā, niruttinayena. Atha vā sadevakena lokena ‘‘saraṇa’’nti araṇīyato upagantabbato, upagatānañca tadatthasiddhito ariyā, ariyānaṃ saṅghoti ariyasaṅgho, ariyo ca so, saṅgho cāti vā ariyasaṅgho, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyasaṅghaṃ."
      },
      " Bhagavato aparabhāge buddhadhammaratanānampi samadhigamo saṅgharatanādhīnoti assa ariyasaṅghassa bahūpakārataṃ dassetuṃ idheva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sirasā vande’’"
      },
      "ti vuttanti daṭṭhabbaṃ."
    ],
    "innerText": "Ārakattā kilesehi, anaye na iriyanato, aye ca iriyanato ariyā, niruttinayena. Atha vā sadevakena lokena ‘‘saraṇa’’nti araṇīyato upagantabbato, upagatānañca tadatthasiddhito ariyā, ariyānaṃ saṅghoti ariyasaṅgho, ariyo ca so, saṅgho cāti vā ariyasaṅgho, taṃ ariyasaṅghaṃ. Bhagavato aparabhāge buddhadhammaratanānampi samadhigamo saṅgharatanādhīnoti assa ariyasaṅghassa bahūpakārataṃ dassetuṃ idheva ‘‘sirasā vande’’ti vuttanti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca ‘‘sugatassa orasānaṃ puttāna’’nti etena ariyasaṅghassa pabhavasampadaṃ dasseti, ‘‘mārasenamathanāna’’nti etena pahānasampadaṃ, sakalasaṃkilesappahānadīpanato. ‘‘Aṭṭhannampi samūha’’nti etena ñāṇasampadaṃ, maggaṭṭhaphalaṭṭhabhāvadīpanato. ‘‘Ariyasaṅgha’’nti etena pabhavasampadaṃ dasseti, sabbasaṅghānaṃ aggabhāvadīpanato. Atha vā ‘‘sugatassa orasānaṃ puttāna’’nti ariyasaṅghassa visuddhanissayabhāvadīpanaṃ, ‘‘mārasenamathanāna’’nti sammāujuñāyasāmīcippaṭipannabhāvadīpanaṃ, ‘‘aṭṭhannampi samūha’’nti āhuneyyādibhāvadīpanaṃ, ‘‘ariyasaṅgha’’nti anuttarapuññakkhettabhāvadīpanaṃ. Tathā ‘‘sugatassa orasānaṃ puttāna’’nti etena ariyasaṅghassa lokuttarasaraṇagamanasabbhāvaṃ dīpeti. Lokuttarasaraṇagamanena hi te bhagavato orasaputtā jātā. ‘‘Mārasenamathanāna’’nti ",
      " etena abhinīhārasampadāsiddhaṃ pubbabhāge sammāpaṭipattiṃ dasseti. Katābhinīhārā hi sammā paṭipannā māraṃ, māraparisaṃ vā abhivijinanti. ‘‘Aṭṭhannampi samūha’’nti etena ",
      " viddhastavipakkhe sekkhāsekkhadhamme dasseti, puggalādhiṭṭhānena maggaphaladhammānaṃ pakāsitattā. ‘‘Ariyasaṅgha’’nti aggadakkhiṇeyyabhāvaṃ dasseti. Saraṇagamanañca sāvakānaṃ sabbaguṇānamādi, sapubbabhāgappaṭipadā sekkhā sīlakkhandhādayo majjhe, asekkhā sīlakkhandhādayo ",
      " pariyosānanti ādimajjhapariyosānakalyāṇā saṅkhepato sabbe ariyasaṅghaguṇā pakāsitā honti."
    ],
    "innerText": "Ettha ca ‘‘sugatassa orasānaṃ puttāna’’nti etena ariyasaṅghassa pabhavasampadaṃ dasseti, ‘‘mārasenamathanāna’’nti etena pahānasampadaṃ, sakalasaṃkilesappahānadīpanato. ‘‘Aṭṭhannampi samūha’’nti etena ñāṇasampadaṃ, maggaṭṭhaphalaṭṭhabhāvadīpanato. ‘‘Ariyasaṅgha’’nti etena pabhavasampadaṃ dasseti, sabbasaṅghānaṃ aggabhāvadīpanato. Atha vā ‘‘sugatassa orasānaṃ puttāna’’nti ariyasaṅghassa visuddhanissayabhāvadīpanaṃ, ‘‘mārasenamathanāna’’nti sammāujuñāyasāmīcippaṭipannabhāvadīpanaṃ, ‘‘aṭṭhannampi samūha’’nti āhuneyyādibhāvadīpanaṃ, ‘‘ariyasaṅgha’’nti anuttarapuññakkhettabhāvadīpanaṃ. Tathā ‘‘sugatassa orasānaṃ puttāna’’nti etena ariyasaṅghassa lokuttarasaraṇagamanasabbhāvaṃ dīpeti. Lokuttarasaraṇagamanena hi te bhagavato orasaputtā jātā. ‘‘Mārasenamathanāna’’nti etena abhinīhārasampadāsiddhaṃ pubbabhāge sammāpaṭipattiṃ dasseti. Katābhinīhārā hi sammā paṭipannā māraṃ, māraparisaṃ vā abhivijinanti. ‘‘Aṭṭhannampi samūha’’nti etena viddhastavipakkhe sekkhāsekkhadhamme dasseti, puggalādhiṭṭhānena maggaphaladhammānaṃ pakāsitattā. ‘‘Ariyasaṅgha’’nti aggadakkhiṇeyyabhāvaṃ dasseti. Saraṇagamanañca sāvakānaṃ sabbaguṇānamādi, sapubbabhāgappaṭipadā sekkhā sīlakkhandhādayo majjhe, asekkhā sīlakkhandhādayo pariyosānanti ādimajjhapariyosānakalyāṇā saṅkhepato sabbe ariyasaṅghaguṇā pakāsitā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ gāthāttayena saṅkhepato sakalaguṇasaṅkittanamukhena ratanattayassa paṇāmaṃ katvā, idāni taṃ nipaccakāraṃ yathādhippete payojane pariṇāmento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘iti me’’"
      },
      "tiādimāha. Tattha ratijananaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ratanaṃ,"
      },
      " buddhadhammasaṅghā. Tesañhi ‘‘itipi so bhagavā’’tiādinā yathābhūtaguṇe āvajjantassa amatādhigamahetubhūtaṃ anappakaṃ pītipāmojjaṃ uppajjati. Yathāha –"
    ],
    "innerText": "Evaṃ gāthāttayena saṅkhepato sakalaguṇasaṅkittanamukhena ratanattayassa paṇāmaṃ katvā, idāni taṃ nipaccakāraṃ yathādhippete payojane pariṇāmento ‘‘iti me’’tiādimāha. Tattha ratijananaṭṭhena ratanaṃ, buddhadhammasaṅghā. Tesañhi ‘‘itipi so bhagavā’’tiādinā yathābhūtaguṇe āvajjantassa amatādhigamahetubhūtaṃ anappakaṃ pītipāmojjaṃ uppajjati. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Yasmiṃ, mahānāma, samaye ariyasāvako tathāgataṃ anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti, ujugatamevassa tasmiṃ samaye cittaṃ hoti tathāgataṃ ārabbha. Ujugatacitto kho pana, mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ, pamuditassa pīti jāyatī’’tiādi (a. ni. 6.10; a. ni. 11.11)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Cittīkatādibhāvo vā ratanaṭṭho. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Cittīkataṃ mahagghañca, atulaṃ dullabhadassanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anomasattaparibhogaṃ, ratanaṃ tena vuccatī’’ti. (khu. pā. aṭṭha. 6.3; dī. ni. aṭṭha. 2.33; su. ni. aṭṭha. 1.226; mahāni. aṭṭha. 50);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cittīkatabhāvādayo ",
      " ca anaññasādhāraṇā buddhādīsu eva labbhantīti. Vandanāva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vandanāmayaṃ,"
      },
      " yathā ‘‘dānamayaṃ, sīlamaya’’nti (dī. ni. 3.305; itivu. 60; netti. 34). Vandanā cettha kāyavācācittehi tiṇṇaṃ ratanānaṃ guṇaninnatā, thomanā vā. Pujjabhavaphalanibbattanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puññaṃ,"
      },
      " attano santānaṃ puṇātīti vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvihatantarāyo"
      },
      "ti suṭṭhu vihatantarāyo, etena attano pasādasampattiyā, rattanattayassa ",
      " ca khettabhāvasampattiyā taṃ puññaṃ atthappakāsanassa upaghātakaupaddavānaṃ vihanane samatthanti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hutvā"
      },
      "ti pubbakālakiriyā, tassa ‘‘atthaṃ pakāsayissāmī’’ti etena sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā"
      },
      "ti yaṃ ratanattayavandanāmayaṃ puññaṃ, tassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ānubhāvenā"
      },
      "ti balena."
    ],
    "innerText": "Cittīkatabhāvādayo ca anaññasādhāraṇā buddhādīsu eva labbhantīti. Vandanāva vandanāmayaṃ, yathā ‘‘dānamayaṃ, sīlamaya’’nti (dī. ni. 3.305; itivu. 60; netti. 34). Vandanā cettha kāyavācācittehi tiṇṇaṃ ratanānaṃ guṇaninnatā, thomanā vā. Pujjabhavaphalanibbattanato puññaṃ, attano santānaṃ puṇātīti vā. Suvihatantarāyoti suṭṭhu vihatantarāyo, etena attano pasādasampattiyā, rattanattayassa ca khettabhāvasampattiyā taṃ puññaṃ atthappakāsanassa upaghātakaupaddavānaṃ vihanane samatthanti dasseti. Hutvāti pubbakālakiriyā, tassa ‘‘atthaṃ pakāsayissāmī’’ti etena sambandho. Tassāti yaṃ ratanattayavandanāmayaṃ puññaṃ, tassa. Ānubhāvenāti balena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " ratanattayassa nipaccakārakaraṇe payojanaṃ dassetvā, idāni yassā dhammadesanāya atthaṃ saṃvaṇṇetukāmo, tassā tāva guṇābhitthavanavasena upaññāpanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dīghassā’’"
      },
      "tiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dīghasuttaṅkitassā"
      },
      "ti dīghappamāṇasuttalakkhitassa, etena ‘‘dīgho’’ti ayaṃ imassa āgamassa atthānugatā samaññāti dasseti. Nanu ca suttāniyeva āgamo, kassa pana suttehi aṅkananti? Saccametaṃ paramatthato, suttāni pana upādāyapaññatto āgamo. Yathā hi atthabyañjanasamudāye ‘‘sutta’’nti vohāro, evaṃ suttasamudāye ‘‘āgamo’’ti vohāro. Paṭiccasamuppādādinipuṇatthasabbhāvato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nipuṇassa."
      },
      " Āgamissanti ettha, etena, etasmā vā attatthaparatthādayoti āgamo, āgamo ca so varo cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āgamavaro,"
      },
      " āgamasammatehi vā varoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āgamavaro,"
      },
      " tassa. Buddhānaṃ anubuddhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddhānubuddhā,"
      },
      " buddhānaṃ saccapaṭivedhaṃ anugamma paṭividdhasaccā aggasāvakādayo ",
      " ariyā. Tehi atthasaṃvaṇṇanāvasena, guṇasaṃvaṇṇanāvasena ca saṃvaṇṇitassa. Atha vā buddhā ca anubuddhā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddhānubuddhā"
      },
      "ti yojetabbaṃ. Sammāsambuddheneva hi tiṇṇampi piṭakānaṃ atthavaṇṇanākkamo bhāsito, yā ‘‘pakiṇṇakadesanā’’ti vuccati, tato saṅgāyanādivasena sāvakehīti ācariyā vadanti."
    ],
    "innerText": "Evaṃ ratanattayassa nipaccakārakaraṇe payojanaṃ dassetvā, idāni yassā dhammadesanāya atthaṃ saṃvaṇṇetukāmo, tassā tāva guṇābhitthavanavasena upaññāpanatthaṃ ‘‘dīghassā’’tiādi vuttaṃ. Tattha dīghasuttaṅkitassāti dīghappamāṇasuttalakkhitassa, etena ‘‘dīgho’’ti ayaṃ imassa āgamassa atthānugatā samaññāti dasseti. Nanu ca suttāniyeva āgamo, kassa pana suttehi aṅkananti? Saccametaṃ paramatthato, suttāni pana upādāyapaññatto āgamo. Yathā hi atthabyañjanasamudāye ‘‘sutta’’nti vohāro, evaṃ suttasamudāye ‘‘āgamo’’ti vohāro. Paṭiccasamuppādādinipuṇatthasabbhāvato nipuṇassa. Āgamissanti ettha, etena, etasmā vā attatthaparatthādayoti āgamo, āgamo ca so varo cāti āgamavaro, āgamasammatehi vā varoti āgamavaro, tassa. Buddhānaṃ anubuddhā buddhānubuddhā, buddhānaṃ saccapaṭivedhaṃ anugamma paṭividdhasaccā aggasāvakādayo ariyā. Tehi atthasaṃvaṇṇanāvasena, guṇasaṃvaṇṇanāvasena ca saṃvaṇṇitassa. Atha vā buddhā ca anubuddhā ca buddhānubuddhāti yojetabbaṃ. Sammāsambuddheneva hi tiṇṇampi piṭakānaṃ atthavaṇṇanākkamo bhāsito, yā ‘‘pakiṇṇakadesanā’’ti vuccati, tato saṅgāyanādivasena sāvakehīti ācariyā vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhāvahaguṇassā"
      },
      "ti buddhādīsu pasādāvahasampattikassa. Ayañhi āgamo brahmajālādīsu (dī. ni. 1.5-7, 26-28) sīladiṭṭhādīnaṃ anavasesaniddesādivasena, mahāpadānādīsu (dī. ni. 2.3-5) purimabuddhānampi guṇaniddesādivasena, pāthikasuttādīsu (dī. ni. 3.3,4) titthiye nimadditvā appaṭivattiyasīhanāda nadanādivasena, anuttariyasuttādīsu (a. ni. 6.8) ca visesato buddhaguṇavibhāvanena ratanattaye sātisayappasādaṃ āvahati. Saṃvaṇṇanāsu cāyaṃ ācariyassa pakati, yā taṃtaṃsaṃvaṇṇanāsu ādito tassa tassa saṃvaṇṇetabbassa dhammassa visesaguṇakittanena thomanā. Tathā hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "papañcasūdanīsāratthappakāsinīmanorathapūraṇīsu aṭṭhasālinī"
      },
      "ādīsu ca yathākkamaṃ ‘‘paravādamathanassa ñāṇappabhedajananassa ",
      " dhammakathikapuṅgavānaṃ vicittappaṭibhānajananassa tassa gambhīrañāṇehi ogāḷhassa abhiṇhaso nānānayavicittassa abhidhammassā’’tiādinā thomanā katā."
    ],
    "innerText": "Saddhāvahaguṇassāti buddhādīsu pasādāvahasampattikassa. Ayañhi āgamo brahmajālādīsu (dī. ni. 1.5-7, 26-28) sīladiṭṭhādīnaṃ anavasesaniddesādivasena, mahāpadānādīsu (dī. ni. 2.3-5) purimabuddhānampi guṇaniddesādivasena, pāthikasuttādīsu (dī. ni. 3.3,4) titthiye nimadditvā appaṭivattiyasīhanāda nadanādivasena, anuttariyasuttādīsu (a. ni. 6.8) ca visesato buddhaguṇavibhāvanena ratanattaye sātisayappasādaṃ āvahati. Saṃvaṇṇanāsu cāyaṃ ācariyassa pakati, yā taṃtaṃsaṃvaṇṇanāsu ādito tassa tassa saṃvaṇṇetabbassa dhammassa visesaguṇakittanena thomanā. Tathā hi papañcasūdanīsāratthappakāsinīmanorathapūraṇīsu aṭṭhasālinīādīsu ca yathākkamaṃ ‘‘paravādamathanassa ñāṇappabhedajananassa dhammakathikapuṅgavānaṃ vicittappaṭibhānajananassa tassa gambhīrañāṇehi ogāḷhassa abhiṇhaso nānānayavicittassa abhidhammassā’’tiādinā thomanā katā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Attho kathīyati etāyāti atthakathā, sā eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathā,"
      },
      " ttha-kārassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ṭṭha"
      },
      "-kāraṃ katvā, yathā ‘‘dukkhassa pīḷanaṭṭho’’ti (paṭi. ma. 2.8). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādito"
      },
      " tiādimhi paṭhamasaṅgītiyaṃ. Chaḷabhiññatāya paramena cittavasībhāvena samannāgatattā, jhānādīsu pañcavidhavasitāsabbhāvato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca vasino,"
      },
      " therā mahākassapādayo. Tesaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satehi pañcahi"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yā"
      },
      "ti yā aṭṭhakathā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅgītā"
      },
      "ti atthaṃ pakāsetuṃ yuttaṭṭhāne ‘‘ayaṃ etassa attho, ayaṃ etassa attho’’ti saṅgahetvā vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anusaṅgītā"
      },
      " ca yasattherādīhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pacchāpi"
      },
      " dutiyatatiyasaṅgītīsu, iminā attano saṃvaṇṇanāya āgamanasuddhiṃ dasseti."
    ],
    "innerText": "Attho kathīyati etāyāti atthakathā, sā eva aṭṭhakathā, ttha-kārassa ṭṭha-kāraṃ katvā, yathā ‘‘dukkhassa pīḷanaṭṭho’’ti (paṭi. ma. 2.8). Ādito tiādimhi paṭhamasaṅgītiyaṃ. Chaḷabhiññatāya paramena cittavasībhāvena samannāgatattā, jhānādīsu pañcavidhavasitāsabbhāvato ca vasino, therā mahākassapādayo. Tesaṃ satehi pañcahi. Yāti yā aṭṭhakathā. Saṅgītāti atthaṃ pakāsetuṃ yuttaṭṭhāne ‘‘ayaṃ etassa attho, ayaṃ etassa attho’’ti saṅgahetvā vuttā. Anusaṅgītā ca yasattherādīhi pacchāpi dutiyatatiyasaṅgītīsu, iminā attano saṃvaṇṇanāya āgamanasuddhiṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sīhassa lānato gahaṇato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīhaḷo,"
      },
      " sīhakumāro. Taṃvaṃsajātatāya tambapaṇṇidīpe khattiyānaṃ, tesaṃ nivāsatāya tambapaṇṇidīpassa ca sīhaḷabhāvo veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ābhatā"
      },
      "ti jambudīpato ānītā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Athā"
      },
      "ti pacchā. Aparabhāge hi asaṅkaratthaṃ sīhaḷabhāsāya aṭṭhakathā ṭhapitāti. Tenassa mūlaṭṭhakathā sabbasādhāraṇā na hotīti idaṃ atthappakāsanaṃ ekantena karaṇīyanti dasseti. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dīpavāsīnamatthāyā’’"
      },
      "ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dīpavāsīna"
      },
      "nti jambudīpavāsīnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dīpavāsīna"
      },
      "nti vā sīhaḷadīpavāsīnaṃ atthāya sīhaḷabhāsāya ṭhapitāti yojanā."
    ],
    "innerText": "Sīhassa lānato gahaṇato sīhaḷo, sīhakumāro. Taṃvaṃsajātatāya tambapaṇṇidīpe khattiyānaṃ, tesaṃ nivāsatāya tambapaṇṇidīpassa ca sīhaḷabhāvo veditabbo. Ābhatāti jambudīpato ānītā. Athāti pacchā. Aparabhāge hi asaṅkaratthaṃ sīhaḷabhāsāya aṭṭhakathā ṭhapitāti. Tenassa mūlaṭṭhakathā sabbasādhāraṇā na hotīti idaṃ atthappakāsanaṃ ekantena karaṇīyanti dasseti. Tenevāha – ‘‘dīpavāsīnamatthāyā’’ti. Tattha dīpavāsīnanti jambudīpavāsīnaṃ. Dīpavāsīnanti vā sīhaḷadīpavāsīnaṃ atthāya sīhaḷabhāsāya ṭhapitāti yojanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apanetvānā"
      },
      "ti kañcukasadisaṃ sīhaḷabhāsaṃ apanetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato"
      },
      "ti aṭṭhakathāto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aha"
      },
      "nti attānaṃ niddisati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manoramaṃ bhāsa"
      },
      "nti māgadhabhāsaṃ. Sā hi sabhāvaniruttibhūtā paṇḍitānaṃ manaṃ ramayatīti. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tantinayānucchavika’’"
      },
      "nti, pāḷigatiyā anulomikaṃ pāḷibhāsāyānuvidhāyininti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vigatadosa"
      },
      "nti asabhāvaniruttibhāsantararahitaṃ."
    ],
    "innerText": "Apanetvānāti kañcukasadisaṃ sīhaḷabhāsaṃ apanetvā. Tatoti aṭṭhakathāto. Ahanti attānaṃ niddisati. Manoramaṃ bhāsanti māgadhabhāsaṃ. Sā hi sabhāvaniruttibhūtā paṇḍitānaṃ manaṃ ramayatīti. Tenevāha – ‘‘tantinayānucchavika’’nti, pāḷigatiyā anulomikaṃ pāḷibhāsāyānuvidhāyininti attho. Vigatadosanti asabhāvaniruttibhāsantararahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samayaṃ avilomento"
      },
      "ti siddhantaṃ avirodhento, etena atthadosābhāvamāha. Aviruddhattā eva hi theravādāpi idha pakāsiyissanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Theravaṃsapadīpāna"
      },
      "nti thirehi sīlakkhandhādīhi samannāgatattā therā, mahākassapādayo. Tehi āgatā ācariyaparamparā theravaṃso, tappariyāpannā ",
      " hutvā āgamādhigamasampannattā paññāpajjotena tassa samujjalanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "theravaṃsapadīpā,"
      },
      " mahāvihāravāsino therā, tesaṃ. Vividhehi ākārehi nicchīyatīti vinicchayo, gaṇṭhiṭṭhānesu khīlamaddanākārena pavattā vimaticchedakathā. Suṭṭhu nipuṇo saṇho vinicchayo etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sunipuṇavinicchayā. "
      },
      " Atha vā vinicchinotīti vinicchayo, yathāvuttavisayaṃ ñāṇaṃ. Suṭṭhu nipuṇo cheko vinicchayo etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sunipuṇavinicchayā,"
      },
      " etena mahākassapāditheraparamparābhato, tatoyeva ca aviparīto saṇhasukhumo mahāvihāravāsīnaṃ ",
      " vinicchayoti tassa pamāṇabhūtataṃ dasseti."
    ],
    "innerText": "Samayaṃ avilomentoti siddhantaṃ avirodhento, etena atthadosābhāvamāha. Aviruddhattā eva hi theravādāpi idha pakāsiyissanti. Theravaṃsapadīpānanti thirehi sīlakkhandhādīhi samannāgatattā therā, mahākassapādayo. Tehi āgatā ācariyaparamparā theravaṃso, tappariyāpannā hutvā āgamādhigamasampannattā paññāpajjotena tassa samujjalanato theravaṃsapadīpā, mahāvihāravāsino therā, tesaṃ. Vividhehi ākārehi nicchīyatīti vinicchayo, gaṇṭhiṭṭhānesu khīlamaddanākārena pavattā vimaticchedakathā. Suṭṭhu nipuṇo saṇho vinicchayo etesanti sunipuṇavinicchayā. Atha vā vinicchinotīti vinicchayo, yathāvuttavisayaṃ ñāṇaṃ. Suṭṭhu nipuṇo cheko vinicchayo etesanti sunipuṇavinicchayā, etena mahākassapāditheraparamparābhato, tatoyeva ca aviparīto saṇhasukhumo mahāvihāravāsīnaṃ vinicchayoti tassa pamāṇabhūtataṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sujanassa cā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca"
      },
      "-saddo sampiṇḍanattho, tena na kevalaṃ jambudīpavāsīnameva atthāya, atha kho sādhujanatosanatthañcāti dasseti, tena ca tambapaṇṇidīpavāsīnampi atthāyāti ayamattho siddho hoti, uggahaṇādisukaratāya tesampi bahupakārattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ciraṭṭhitattha"
      },
      "nti ciraṭṭhitiatthaṃ ",
      ", cirakālaṭṭhitiyāti attho. Idañhi atthappakāsanaṃ aviparītabyañjanasunikkhepassa atthasunayassa ca upāyabhāvato saddhammassa ciraṭṭhitiyā saṃvattati. Vuttañhetaṃ bhagavatā –"
    ],
    "innerText": "Sujanassa cāti ca-saddo sampiṇḍanattho, tena na kevalaṃ jambudīpavāsīnameva atthāya, atha kho sādhujanatosanatthañcāti dasseti, tena ca tambapaṇṇidīpavāsīnampi atthāyāti ayamattho siddho hoti, uggahaṇādisukaratāya tesampi bahupakārattā. Ciraṭṭhitatthanti ciraṭṭhitiatthaṃ , cirakālaṭṭhitiyāti attho. Idañhi atthappakāsanaṃ aviparītabyañjanasunikkhepassa atthasunayassa ca upāyabhāvato saddhammassa ciraṭṭhitiyā saṃvattati. Vuttañhetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Dveme, bhikkhave, dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattanti. Katame dve? Sunikkhattañca padabyañjanaṃ, attho ca sunīto’’ti (a. ni. 2.21)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yaṃ atthavaṇṇanaṃ kattukāmo, tassā mahattaṃ pariharituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sīlakathā’’"
      },
      "tiādi vuttaṃ. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na taṃ idha vicārayissāmī’’"
      },
      "ti. Atha vā yaṃ aṭṭhakathaṃ kattukāmo, tadekadesabhāvena visuddhimaggo ca gahetabboti kathikānaṃ upadesaṃ karonto tattha vicāritadhamme uddesavasena dasseti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sīlakathā’’"
      },
      " tiādinā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīlakathā"
      },
      "ti cārittavārittādivasena sīlavitthārakathā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhutadhammā"
      },
      "ti piṇḍapātikaṅgādayo (visuddhi. 1.22; theragā. aṭṭha. 2.845, 849) terasa kilesadhunanakadhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammaṭṭhānāni sabbānī"
      },
      "ti pāḷiyaṃ āgatāni aṭṭhatiṃsa, aṭṭhakathāyaṃ dveti niravasesāni yogakammassa bhāvanāya pavattiṭṭhānāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cariyāvidhānasahito"
      },
      "ti rāgacaritādīnaṃ sabhāvādividhānena sahito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhānāni"
      },
      " cattāri rūpāvacarajjhānāni, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāpattiyo"
      },
      " catasso arūpasamāpattiyo. Aṭṭhapi vā paṭiladdhamattāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānāni,"
      },
      " samāpajjanavasībhāvappattiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāpattiyo. Jhānāni"
      },
      " vā rūpārūpāvacarajjhānāni ",
      ", ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāpattiyo"
      },
      " phalasamāpattinirodhasamāpattiyo."
    ],
    "innerText": "Yaṃ atthavaṇṇanaṃ kattukāmo, tassā mahattaṃ pariharituṃ ‘‘sīlakathā’’tiādi vuttaṃ. Tenevāha – ‘‘na taṃ idha vicārayissāmī’’ti. Atha vā yaṃ aṭṭhakathaṃ kattukāmo, tadekadesabhāvena visuddhimaggo ca gahetabboti kathikānaṃ upadesaṃ karonto tattha vicāritadhamme uddesavasena dasseti ‘‘sīlakathā’’ tiādinā. Tattha sīlakathāti cārittavārittādivasena sīlavitthārakathā. Dhutadhammāti piṇḍapātikaṅgādayo (visuddhi. 1.22; theragā. aṭṭha. 2.845, 849) terasa kilesadhunanakadhammā. Kammaṭṭhānāni sabbānīti pāḷiyaṃ āgatāni aṭṭhatiṃsa, aṭṭhakathāyaṃ dveti niravasesāni yogakammassa bhāvanāya pavattiṭṭhānāni. Cariyāvidhānasahitoti rāgacaritādīnaṃ sabhāvādividhānena sahito. Jhānāni cattāri rūpāvacarajjhānāni, samāpattiyo catasso arūpasamāpattiyo. Aṭṭhapi vā paṭiladdhamattāni jhānāni, samāpajjanavasībhāvappattiyā samāpattiyo. Jhānāni vā rūpārūpāvacarajjhānāni , samāpattiyo phalasamāpattinirodhasamāpattiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Lokiyalokuttarabhedā cha abhiññāyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbā abhiññāyo."
      },
      " Ñāṇavibhaṅgādīsu āgatanayena ekavidhādinā paññāya saṅkaletvā sampiṇḍetvā nicchayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāsaṅkalananicchayo."
      }
    ],
    "innerText": "Lokiyalokuttarabhedā cha abhiññāyo sabbā abhiññāyo. Ñāṇavibhaṅgādīsu āgatanayena ekavidhādinā paññāya saṅkaletvā sampiṇḍetvā nicchayo paññāsaṅkalananicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paccayadhammānaṃ hetādīnaṃ paccayuppannadhammānaṃ hetupaccayādibhāvo paccayākāro, tassa desanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccayākāradesanā,"
      },
      " paṭiccasamuppādakathāti attho. Sā pana ghanavinibbhogassa sudukkaratāya saṇhasukhumā, nikāyantaraladdhisaṅkararahitā, ekattanayādisahitā ca tattha vicāritāti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘suparisuddhanipuṇanayā’’"
      },
      "ti. Paṭisambhidādīsu āgatanayaṃ avissajjetvāva vicāritattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avimuttatanti maggā."
      }
    ],
    "innerText": "Paccayadhammānaṃ hetādīnaṃ paccayuppannadhammānaṃ hetupaccayādibhāvo paccayākāro, tassa desanā paccayākāradesanā, paṭiccasamuppādakathāti attho. Sā pana ghanavinibbhogassa sudukkaratāya saṇhasukhumā, nikāyantaraladdhisaṅkararahitā, ekattanayādisahitā ca tattha vicāritāti āha – ‘‘suparisuddhanipuṇanayā’’ti. Paṭisambhidādīsu āgatanayaṃ avissajjetvāva vicāritattā avimuttatanti maggā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iti"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pana sabba"
      },
      "nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iti"
      },
      "-saddo parisamāpane, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pana"
      },
      "-saddo vacanālaṅkāre, etaṃ sabbanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti imissā aṭṭhakathāyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na vicārayissāmi,"
      },
      " punaruttibhāvatoti adhippāyo."
    ],
    "innerText": "Itipana sabbanti iti-saddo parisamāpane, pana-saddo vacanālaṅkāre, etaṃ sabbanti attho. Idhāti imissā aṭṭhakathāyaṃ. Na vicārayissāmi, punaruttibhāvatoti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni tasseva avicāraṇassa ekantakāraṇaṃ niddhārento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘majjhe visuddhimaggo’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘majjhe ṭhatvā’’"
      },
      "ti etena majjhebhāvadīpanena visesato catunnaṃ āgamānaṃ sādhāraṇaṭṭhakathā visuddhimaggo, na sumaṅgalavilāsinīādayo viya asādhāraṇaṭṭhakathāti dasseti. ‘‘Visesato’’ti idaṃ vinayābhidhammānampi visuddhimaggo yathārahaṃ atthavaṇṇanā hoti yevāti katvā vuttaṃ."
    ],
    "innerText": "Idāni tasseva avicāraṇassa ekantakāraṇaṃ niddhārento ‘‘majjhe visuddhimaggo’’tiādimāha. Tattha ‘‘majjhe ṭhatvā’’ti etena majjhebhāvadīpanena visesato catunnaṃ āgamānaṃ sādhāraṇaṭṭhakathā visuddhimaggo, na sumaṅgalavilāsinīādayo viya asādhāraṇaṭṭhakathāti dasseti. ‘‘Visesato’’ti idaṃ vinayābhidhammānampi visuddhimaggo yathārahaṃ atthavaṇṇanā hoti yevāti katvā vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iccevā"
      },
      "ti iti eva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tampī"
      },
      "ti visuddhimaggampi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etāyā"
      },
      "ti sumaṅgalavilāsiniyā. Ettha ca ‘‘sīhaḷadīpaṃ ābhatā’’tiādinā atthappakāsanassa nimittaṃ dasseti, ‘‘dīpavāsīnamatthāya, sujanassa ca tuṭṭhatthaṃ, ciraṭṭhitatthañca dhammassā’’ti etena payojanaṃ, avasiṭṭhena karaṇappakāraṃ. Sīlakathādīnaṃ avicāraṇampi hi idha karaṇappakāro evāti."
    ],
    "innerText": "Iccevāti iti eva. Tampīti visuddhimaggampi. Etāyāti sumaṅgalavilāsiniyā. Ettha ca ‘‘sīhaḷadīpaṃ ābhatā’’tiādinā atthappakāsanassa nimittaṃ dasseti, ‘‘dīpavāsīnamatthāya, sujanassa ca tuṭṭhatthaṃ, ciraṭṭhitatthañca dhammassā’’ti etena payojanaṃ, avasiṭṭhena karaṇappakāraṃ. Sīlakathādīnaṃ avicāraṇampi hi idha karaṇappakāro evāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ganthārambhakathāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subsubhead"
    },
    "innerText": "Nidānakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vibhāgavantānaṃ ",
      " sabhāvavibhāvanaṃ vibhāgadassanavaseneva hotīti paṭhamaṃ tāva vaggasuttavasena ",
      " vibhāgaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tattha dīghāgamo nāmā’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatthā"
      },
      "ti ‘‘dīghassa āgamavarassa atthaṃ pakāsayissāmī’’ti yadidaṃ vuttaṃ, tasmiṃ vacane. Yassa atthaṃ pakāsayissāmīti paṭiññātaṃ, so ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dīghāgamo nāma"
      },
      " vaggasuttavasena evaṃ vibhāgoti attho. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatthā"
      },
      "ti ‘‘dīghāgamanissitamattha’’nti etasmiṃ vacane. Yo dīghāgamo vutto, so vaggādivasena edisoti attho. Attano saṃvaṇṇanāya paṭhamamahāsaṅgītiyaṃ nikkhittānukkameneva pavattabhāvadassanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tassa vaggesu…pe… vuttaṃ nidānamādī’’"
      },
      "ti āha. Kasmā pana catūsu āgamesu dīghāgamo paṭhamaṃ saṅgīto, tattha ca sīlakkhandhavaggo ādito nikkhitto, tasmiñca brahmajālanti? Nāyamanuyogo katthacipi na pavattati, api ca saddhāvahaguṇato dīghanikāyo paṭhamaṃ saṅgīto. Saddhā hi kusaladhammānaṃ bījaṃ. Yathāha – ‘‘saddhā bījaṃ tapo vuṭṭhī’’ti, (saṃ. ni. 1.197; su. ni. 77) saddhāvahaguṇatā cassa dassitāyeva. Kiñca katipayasuttasaṅgahato, appaparimāṇato ca gahaṇadhāraṇādisukhato. Tathāhesa catuttiṃsasuttasaṅgaho catusaṭṭhibhāṇavāraparimāṇo ca. Sīlakathābāhullato pana sīlakkhandhavaggo paṭhamaṃ nikkhitto. Sīlañhi sāsanassa ādi, sīlapatiṭṭhānattā sabbaguṇānaṃ. Tenevāha – ‘‘tasmā tiha, tvaṃ bhikkhu, ādimeva visodhehi kusalesu dhammesu. Ko cādi kusalānaṃ dhammānaṃ? Sīlañca suvisuddha’’ntiādi (saṃ. ni. 5.395). Etena cassa vaggassa anvatthasaññatā vuttā hoti. Diṭṭhiviniveṭhanakathābhāvato pana suttantapiṭakassa niravasesadiṭṭhivibhajanaṃ brahmajālaṃ paṭhamaṃ nikkhittanti daṭṭhabbaṃ. Tepiṭake hi buddhavacane brahmajālasadisaṃ diṭṭhigatāni niggumbaṃ nijjaṭaṃ katvā vibhattasuttaṃ natthīti."
    ],
    "innerText": "Vibhāgavantānaṃ sabhāvavibhāvanaṃ vibhāgadassanavaseneva hotīti paṭhamaṃ tāva vaggasuttavasena vibhāgaṃ dassetuṃ ‘‘tattha dīghāgamo nāmā’’tiādimāha. Tattha tatthāti ‘‘dīghassa āgamavarassa atthaṃ pakāsayissāmī’’ti yadidaṃ vuttaṃ, tasmiṃ vacane. Yassa atthaṃ pakāsayissāmīti paṭiññātaṃ, so dīghāgamo nāma vaggasuttavasena evaṃ vibhāgoti attho. Atha vā tatthāti ‘‘dīghāgamanissitamattha’’nti etasmiṃ vacane. Yo dīghāgamo vutto, so vaggādivasena edisoti attho. Attano saṃvaṇṇanāya paṭhamamahāsaṅgītiyaṃ nikkhittānukkameneva pavattabhāvadassanatthaṃ ‘‘tassa vaggesu…pe… vuttaṃ nidānamādī’’ti āha. Kasmā pana catūsu āgamesu dīghāgamo paṭhamaṃ saṅgīto, tattha ca sīlakkhandhavaggo ādito nikkhitto, tasmiñca brahmajālanti? Nāyamanuyogo katthacipi na pavattati, api ca saddhāvahaguṇato dīghanikāyo paṭhamaṃ saṅgīto. Saddhā hi kusaladhammānaṃ bījaṃ. Yathāha – ‘‘saddhā bījaṃ tapo vuṭṭhī’’ti, (saṃ. ni. 1.197; su. ni. 77) saddhāvahaguṇatā cassa dassitāyeva. Kiñca katipayasuttasaṅgahato, appaparimāṇato ca gahaṇadhāraṇādisukhato. Tathāhesa catuttiṃsasuttasaṅgaho catusaṭṭhibhāṇavāraparimāṇo ca. Sīlakathābāhullato pana sīlakkhandhavaggo paṭhamaṃ nikkhitto. Sīlañhi sāsanassa ādi, sīlapatiṭṭhānattā sabbaguṇānaṃ. Tenevāha – ‘‘tasmā tiha, tvaṃ bhikkhu, ādimeva visodhehi kusalesu dhammesu. Ko cādi kusalānaṃ dhammānaṃ? Sīlañca suvisuddha’’ntiādi (saṃ. ni. 5.395). Etena cassa vaggassa anvatthasaññatā vuttā hoti. Diṭṭhiviniveṭhanakathābhāvato pana suttantapiṭakassa niravasesadiṭṭhivibhajanaṃ brahmajālaṃ paṭhamaṃ nikkhittanti daṭṭhabbaṃ. Tepiṭake hi buddhavacane brahmajālasadisaṃ diṭṭhigatāni niggumbaṃ nijjaṭaṃ katvā vibhattasuttaṃ natthīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Paṭhamamahāsaṅgītikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yassā ",
      " paṭhamamahāsaṅgītiyaṃ nikkhittānukkamena saṃvaṇṇanaṃ kattukāmo, taṃ, tassā ca tantiāruḷhāya idha vacane kāraṇaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paṭhamamahāsaṅgīti…pe… veditabbā’’"
      },
      "ti āha. Tattha yathāpaccayaṃ tattha tattha desitattā ",
      ", paññattattā ca vippakiṇṇānaṃ dhammavinayānaṃ saṅgahetvā gāyanaṃ kathanaṃ saṅgīti, etena taṃtaṃsikkhāpadānaṃ suttānañca ādipariyosānesu, antarantarā ca sambandhavasena ṭhapitaṃ saṅgītikāravacanaṃ saṅgahitaṃ hoti. Mahāvisayattā, pūjanīyattā ca mahatī saṅgīti mahāsaṅgīti, paṭhamā mahāsaṅgīti paṭhamamahāsaṅgīti, tassā pavattikālo paṭhamamahāsaṅgītikālo, tasmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭhamamahāsaṅgītikāle. Nidāna"
      },
      "nti ca desanaṃ desakālādivasena aviditaṃ viditaṃ katvā nidassetīti nidānaṃ. Sattānaṃ dassanānuttariyasaraṇādipaṭilābhahetubhūtāsu vijjamānāsupi aññāsu bhagavato kiriyāsu ‘‘buddho bodheyya’’nti (bu. vaṃ. aṭṭha. ratanacaṅkamanakaṇḍavaṇṇanā; cariyā. uddhānagāthāvaṇṇanā) paṭiññāya anulomato veneyyānaṃ maggaphalappattīnaṃ hetubhūtā kiriyā nippariyāyena buddhakiccanti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dhammacakkappavattanañhi ādiṃ katvā’’"
      },
      "ti. Tattha saddhindriyādidhammoyeva pavattanaṭṭhena cakkanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammacakkaṃ."
      },
      " Atha vā cakkanti āṇā, dhammato anapetattā dhammañca taṃ cakkañcāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammacakkaṃ,"
      },
      " dhammena ñāyena cakkantipi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammacakkaṃ."
      },
      " Yathāha –"
    ],
    "innerText": "Yassā paṭhamamahāsaṅgītiyaṃ nikkhittānukkamena saṃvaṇṇanaṃ kattukāmo, taṃ, tassā ca tantiāruḷhāya idha vacane kāraṇaṃ dassento ‘‘paṭhamamahāsaṅgīti…pe… veditabbā’’ti āha. Tattha yathāpaccayaṃ tattha tattha desitattā , paññattattā ca vippakiṇṇānaṃ dhammavinayānaṃ saṅgahetvā gāyanaṃ kathanaṃ saṅgīti, etena taṃtaṃsikkhāpadānaṃ suttānañca ādipariyosānesu, antarantarā ca sambandhavasena ṭhapitaṃ saṅgītikāravacanaṃ saṅgahitaṃ hoti. Mahāvisayattā, pūjanīyattā ca mahatī saṅgīti mahāsaṅgīti, paṭhamā mahāsaṅgīti paṭhamamahāsaṅgīti, tassā pavattikālo paṭhamamahāsaṅgītikālo, tasmiṃ paṭhamamahāsaṅgītikāle. Nidānanti ca desanaṃ desakālādivasena aviditaṃ viditaṃ katvā nidassetīti nidānaṃ. Sattānaṃ dassanānuttariyasaraṇādipaṭilābhahetubhūtāsu vijjamānāsupi aññāsu bhagavato kiriyāsu ‘‘buddho bodheyya’’nti (bu. vaṃ. aṭṭha. ratanacaṅkamanakaṇḍavaṇṇanā; cariyā. uddhānagāthāvaṇṇanā) paṭiññāya anulomato veneyyānaṃ maggaphalappattīnaṃ hetubhūtā kiriyā nippariyāyena buddhakiccanti āha – ‘‘dhammacakkappavattanañhi ādiṃ katvā’’ti. Tattha saddhindriyādidhammoyeva pavattanaṭṭhena cakkanti dhammacakkaṃ. Atha vā cakkanti āṇā, dhammato anapetattā dhammañca taṃ cakkañcāti dhammacakkaṃ, dhammena ñāyena cakkantipi dhammacakkaṃ. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Dhammañca pavatteti cakkañcāti dhammacakkaṃ, cakkañca pavatteti dhammañcāti dhammacakkaṃ, dhammena pavattetīti dhammacakkaṃ, dhammacariyāya pavattetīti dhammacakka’’ntiādi (paṭi. ma. 2, 39, 41)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Katabuddhakicce’’"
      },
      "ti etena buddhakattabbassa kassacipi asesitabhāvaṃ dasseti. Nanu ca sāvakehi vinītāpi vineyyā ",
      " bhagavatāyeva vinītā honti, yato sāvakabhāsitaṃ suttaṃ ‘‘buddhavacana’’nti vuccati, sāvakavineyyā ca na tāva vinītāti? Nāyaṃ doso tesaṃ vinayanupāyassa sāvakesu ṭhapitattā. Tenevāha –"
    ],
    "innerText": "‘‘Katabuddhakicce’’ti etena buddhakattabbassa kassacipi asesitabhāvaṃ dasseti. Nanu ca sāvakehi vinītāpi vineyyā bhagavatāyeva vinītā honti, yato sāvakabhāsitaṃ suttaṃ ‘‘buddhavacana’’nti vuccati, sāvakavineyyā ca na tāva vinītāti? Nāyaṃ doso tesaṃ vinayanupāyassa sāvakesu ṭhapitattā. Tenevāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Na tāvāhaṃ, pāpima, parinibbāyissāmi, yāva me bhikkhū na sāvakā bhavissanti viyattā vinītā visāradā bahussutā dhammadharā…pe… uppannaṃ parappavādaṃ saha ",
      " dhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desessa’’ntiādi (dī. ni. 2.168; saṃ. ni. 5.822; udā. 51)."
    ],
    "innerText": "‘‘Na tāvāhaṃ, pāpima, parinibbāyissāmi, yāva me bhikkhū na sāvakā bhavissanti viyattā vinītā visāradā bahussutā dhammadharā…pe… uppannaṃ parappavādaṃ saha dhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desessa’’ntiādi (dī. ni. 2.168; saṃ. ni. 5.822; udā. 51)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Kusinārāya’’"
      },
      "ntiādi bhagavato parinibbutadesakālavisesadassanaṃ ‘‘aparinibbuto bhagavā’’ti gāhassa micchābhāvadassanatthaṃ, loke jātasaṃvaddhabhāvadassanatthañca ",
      ". Tathā hi manussabhāvassa supākaṭakaraṇatthaṃ mahābodhisattā carimabhave dārapariggahādīnipi karontīti. Upādīyate kammakilesehīti upādi, vipākakkhandhā kaṭattā ca rūpaṃ. So pana upādi kilesābhisaṅkhāramāranimmathanena nibbānappattiyaṃ anossaṭṭho, idha khandhamaccumāranimmathanena ossaṭṭho nissesitoti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anupādisesā,"
      },
      " nibbānadhātu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibbānadhātū"
      },
      "ti cettha nibbutimattaṃ adhippetaṃ, itthambhūtalakkhaṇe cāyaṃ karaṇaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Dhātubhājanadivase’’"
      },
      "ti idaṃ na ‘‘sannipatitāna’’nti etassa visesanaṃ, ussāhajananassa pana visesanaṃ, ‘‘dhātubhājanadivase bhikkhūnaṃ ussāhaṃ janesī’’ti. Dhātubhājanadivasato hi purimapurimataradivasesu bhikkhū samāgatāti. Atha vā dhātubhājanadivase ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sannipatitānaṃ"
      },
      " kāyasāmaggīvasena sahitānanti attho. Saṅghassa thero ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅghatthero,"
      },
      " so pana saṅgho kiṃ parimāṇānanti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sattannaṃ bhikkhusatasahassāna’’"
      },
      "nti. Niccasāpekkhatāya hi edisesu samāso hotiyeva, yathā – ‘‘devadattassa garukula’’nti."
    ],
    "innerText": "‘‘Kusinārāya’’ntiādi bhagavato parinibbutadesakālavisesadassanaṃ ‘‘aparinibbuto bhagavā’’ti gāhassa micchābhāvadassanatthaṃ, loke jātasaṃvaddhabhāvadassanatthañca . Tathā hi manussabhāvassa supākaṭakaraṇatthaṃ mahābodhisattā carimabhave dārapariggahādīnipi karontīti. Upādīyate kammakilesehīti upādi, vipākakkhandhā kaṭattā ca rūpaṃ. So pana upādi kilesābhisaṅkhāramāranimmathanena nibbānappattiyaṃ anossaṭṭho, idha khandhamaccumāranimmathanena ossaṭṭho nissesitoti ayaṃ anupādisesā, nibbānadhātu. Nibbānadhātūti cettha nibbutimattaṃ adhippetaṃ, itthambhūtalakkhaṇe cāyaṃ karaṇaniddeso. ‘‘Dhātubhājanadivase’’ti idaṃ na ‘‘sannipatitāna’’nti etassa visesanaṃ, ussāhajananassa pana visesanaṃ, ‘‘dhātubhājanadivase bhikkhūnaṃ ussāhaṃ janesī’’ti. Dhātubhājanadivasato hi purimapurimataradivasesu bhikkhū samāgatāti. Atha vā dhātubhājanadivase sannipatitānaṃ kāyasāmaggīvasena sahitānanti attho. Saṅghassa thero saṅghatthero, so pana saṅgho kiṃ parimāṇānanti āha – ‘‘sattannaṃ bhikkhusatasahassāna’’nti. Niccasāpekkhatāya hi edisesu samāso hotiyeva, yathā – ‘‘devadattassa garukula’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Āyasmā mahākassapo puna dullabhabhāvaṃ maññamāno bhikkhūnaṃ ",
      " ussāhaṃ janesīti sambandho. ‘‘Dhātubhājanadivase sannipatitāna’’nti idaṃ ‘‘bhikkhūnaṃ ussāhaṃ janesī’’ti ettha ‘‘bhikkhūna’’nti imināpi padena sambandhanīyaṃ. Subhaddena vuḍḍhapabbajitena vuttavacanamanussarantoti sambandho. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anussaranto"
      },
      " dhammasaṃvegavasenāti adhippāyo. ‘‘Saddhammaṃ antaradhāpeyyuṃ saṅgāyeyyaṃ…pe… ciraṭṭhitikaṃ tassa kimaññaṃ āṇaṇyaṃ bhavissatī’’ti etesaṃ padānaṃ ‘‘iti cintayanto’’ti etena sambandho. Tathā ‘‘yañcāha’’nti etassa ‘‘anuggahito pasaṃsito’’ti etena sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ pāpabhikkhū"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ya"
      },
      "nti nipātamattaṃ, kāraṇaniddeso vā, yena kāraṇena antaradhāpeyyuṃ, tadetaṃ kāraṇaṃ vijjatīti attho, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "addhaniya"
      },
      "nti addhānamaggagāmi, addhānakkhamanti attho."
    ],
    "innerText": "Āyasmā mahākassapo puna dullabhabhāvaṃ maññamāno bhikkhūnaṃ ussāhaṃ janesīti sambandho. ‘‘Dhātubhājanadivase sannipatitāna’’nti idaṃ ‘‘bhikkhūnaṃ ussāhaṃ janesī’’ti ettha ‘‘bhikkhūna’’nti imināpi padena sambandhanīyaṃ. Subhaddena vuḍḍhapabbajitena vuttavacanamanussarantoti sambandho. Tattha anussaranto dhammasaṃvegavasenāti adhippāyo. ‘‘Saddhammaṃ antaradhāpeyyuṃ saṅgāyeyyaṃ…pe… ciraṭṭhitikaṃ tassa kimaññaṃ āṇaṇyaṃ bhavissatī’’ti etesaṃ padānaṃ ‘‘iti cintayanto’’ti etena sambandho. Tathā ‘‘yañcāha’’nti etassa ‘‘anuggahito pasaṃsito’’ti etena sambandho. Yaṃ pāpabhikkhūti ettha yanti nipātamattaṃ, kāraṇaniddeso vā, yena kāraṇena antaradhāpeyyuṃ, tadetaṃ kāraṇaṃ vijjatīti attho, addhaniyanti addhānamaggagāmi, addhānakkhamanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yañcāha"
      },
      "nti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ya"
      },
      "nti yasmā, yena kāraṇenāti vuttaṃ hoti, kiriyāparāmasanaṃ vā etaṃ, tena ‘‘anuggahito pasaṃsito’’ti ettha anuggaṇhanaṃ pasaṃsanañca parāmasati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Cīvare sādhāraṇaparibhogenā’’"
      },
      "ti ettha ‘‘attanā samasamaṭṭhapanenā’’ti idha attanā-saddaṃ ānetvā cīvare attanā ",
      " sādhāraṇaparibhogenāti yojetabbaṃ. Yassa yena hi sambandho dūraṭṭhampi ca tassa tanti atha vā bhagavatā cīvare sādhāraṇaparibhogena bhagavatā anuggahitoti yojanīyaṃ, etassāpi hi karaṇaniddesassa sahayogakattutthajotakattasambhavato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāvade"
      },
      "ti yāvadeva, yattakaṃ kālaṃ, yattake vā samāpattivihāre, abhiññāvihāre vā ākaṅkhanto viharāmi ceva voharāmi ca, tathā kassapopīti attho. Idañca navānupubbavihārachaḷabhiññabhāvasāmaññena thutimattaṃ vuttanti daṭṭhabbaṃ. Na hi āyasmā mahākassapo bhagavā viya devasikaṃ catuvīsatikoṭisatasahassasaṅkhyā samāpattiyo samāpajjati, yamakapāṭihāriyādivasena vā abhiññāyo vaḷañjetīti. Tenevāha – ‘‘navānupubbavihārachaḷabhiññāppabhede’’ti ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa kimaññaṃ āṇaṇyaṃ bhavissati,"
      },
      " aññatra dhammavinayasaṅgāyanāti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Nanu maṃ bhagavā’’"
      },
      "tiādinā vuttamevatthaṃ upamāvasena vibhāveti."
    ],
    "innerText": "Yañcāhanti ettha yanti yasmā, yena kāraṇenāti vuttaṃ hoti, kiriyāparāmasanaṃ vā etaṃ, tena ‘‘anuggahito pasaṃsito’’ti ettha anuggaṇhanaṃ pasaṃsanañca parāmasati. ‘‘Cīvare sādhāraṇaparibhogenā’’ti ettha ‘‘attanā samasamaṭṭhapanenā’’ti idha attanā-saddaṃ ānetvā cīvare attanā sādhāraṇaparibhogenāti yojetabbaṃ. Yassa yena hi sambandho dūraṭṭhampi ca tassa tanti atha vā bhagavatā cīvare sādhāraṇaparibhogena bhagavatā anuggahitoti yojanīyaṃ, etassāpi hi karaṇaniddesassa sahayogakattutthajotakattasambhavato. Yāvadeti yāvadeva, yattakaṃ kālaṃ, yattake vā samāpattivihāre, abhiññāvihāre vā ākaṅkhanto viharāmi ceva voharāmi ca, tathā kassapopīti attho. Idañca navānupubbavihārachaḷabhiññabhāvasāmaññena thutimattaṃ vuttanti daṭṭhabbaṃ. Na hi āyasmā mahākassapo bhagavā viya devasikaṃ catuvīsatikoṭisatasahassasaṅkhyā samāpattiyo samāpajjati, yamakapāṭihāriyādivasena vā abhiññāyo vaḷañjetīti. Tenevāha – ‘‘navānupubbavihārachaḷabhiññāppabhede’’ti . Tassa kimaññaṃ āṇaṇyaṃ bhavissati, aññatra dhammavinayasaṅgāyanāti adhippāyo. ‘‘Nanu maṃ bhagavā’’tiādinā vuttamevatthaṃ upamāvasena vibhāveti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato para"
      },
      "nti tato bhikkhūnaṃ ussāhajananato parato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pure adhammo dippatī"
      },
      "ti apināma dibbati, yāva adhammo dhammaṃ paṭibāhituṃ samattho hoti, tato puretaramevāti attho. Āsanne anicchite hi ayaṃ pure-saddo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dippatī"
      },
      "ti ca dippissati. Puresaddasanniyogena hi anāgatatthe ayaṃ vattamānappayogo, yathā – ‘‘purā vassati devo’’ti."
    ],
    "innerText": "Tato paranti tato bhikkhūnaṃ ussāhajananato parato. Pure adhammo dippatīti apināma dibbati, yāva adhammo dhammaṃ paṭibāhituṃ samattho hoti, tato puretaramevāti attho. Āsanne anicchite hi ayaṃ pure-saddo. Dippatīti ca dippissati. Puresaddasanniyogena hi anāgatatthe ayaṃ vattamānappayogo, yathā – ‘‘purā vassati devo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Sakalanavaṅgasatthusāsanapariyattidhare…pe… ekūnapañcasate pariggahesī’’"
      },
      "ti etena sukkhavipassakakhīṇāsavapariyantānaṃ yathāvuttapuggalānaṃ satipi āgamādhigamasabbhāve saha paṭisambhidāhi pana tevijjādiguṇayuttānaṃ āgamādhigamasampattiyā ukkaṃsagatattā saṅgītiyā bahupakārataṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idaṃ vuttaṃ"
      },
      " saṅgītikkhandhake, (pārā. 437) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apaccakkhaṃ nāma natthi"
      },
      " paguṇappavattibhāvato, samantapāsādikāyaṃ pana ‘‘asammukhā paṭiggahitaṃ nāma natthī’’ti (pārā. aṭṭha. paṭhamamahāsaṅgītikathā) vuttaṃ, taṃ ‘‘dve sahassāni bhikkhuto’’ti vuttampi bhagavato santike paṭiggahitamevāti katvā vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Caturāsītisahassānī"
      },
      "ti dhammakkhandhe sandhāyāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavattino"
      },
      "ti paguṇāni. Ānandattherassa navappāyāya parisāya vibbhamanena mahākassapatthero evamāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na vāyaṃ kumārako mattamaññāsī’’"
      },
      "ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "matta"
      },
      "nti pamāṇaṃ. Chandā āgamanaṃ viyāti padavibhāgo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Kiñcāpi sekkho’’"
      },
      "ti idaṃ ",
      " na sekkhānaṃ agatigamanasabbhāvena vuttaṃ, asekkhānameva pana uccinitattāti daṭṭhabbaṃ ",
      ". Paṭhamamaggeneva hi cattāri agatigamanāni pahīyantīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Abhabbo chandā…pe… agatiṃ gantu’’"
      },
      "nti ca dhammasaṅgītiyā tassa yogyabhāvadassanena vijjamānaguṇakathanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyatto"
      },
      "ti adhīto."
    ],
    "innerText": "‘‘Sakalanavaṅgasatthusāsanapariyattidhare…pe… ekūnapañcasate pariggahesī’’ti etena sukkhavipassakakhīṇāsavapariyantānaṃ yathāvuttapuggalānaṃ satipi āgamādhigamasabbhāve saha paṭisambhidāhi pana tevijjādiguṇayuttānaṃ āgamādhigamasampattiyā ukkaṃsagatattā saṅgītiyā bahupakārataṃ dasseti. Idaṃ vuttaṃ saṅgītikkhandhake, (pārā. 437) apaccakkhaṃ nāma natthi paguṇappavattibhāvato, samantapāsādikāyaṃ pana ‘‘asammukhā paṭiggahitaṃ nāma natthī’’ti (pārā. aṭṭha. paṭhamamahāsaṅgītikathā) vuttaṃ, taṃ ‘‘dve sahassāni bhikkhuto’’ti vuttampi bhagavato santike paṭiggahitamevāti katvā vuttaṃ. Caturāsītisahassānīti dhammakkhandhe sandhāyāha. Pavattinoti paguṇāni. Ānandattherassa navappāyāya parisāya vibbhamanena mahākassapatthero evamāha – ‘‘na vāyaṃ kumārako mattamaññāsī’’ti. Tattha mattanti pamāṇaṃ. Chandā āgamanaṃ viyāti padavibhāgo. ‘‘Kiñcāpi sekkho’’ti idaṃ na sekkhānaṃ agatigamanasabbhāvena vuttaṃ, asekkhānameva pana uccinitattāti daṭṭhabbaṃ . Paṭhamamaggeneva hi cattāri agatigamanāni pahīyantīti. ‘‘Abhabbo chandā…pe… agatiṃ gantu’’nti ca dhammasaṅgītiyā tassa yogyabhāvadassanena vijjamānaguṇakathanaṃ. Pariyattoti adhīto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāvo ",
      " caranti etthāti gocaro, gocaro viya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gocaro,"
      },
      " bhikkhācaraṇaṭṭhānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visabhāgapuggalo"
      },
      " subhaddasadiso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattipañjara"
      },
      "nti sattikhaggādihatthehi purisehi mallarājūnaṃ bhagavato dhātuārakkhakaraṇaṃ sandhāyāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ palibodhaṃ chinditvā taṃ karaṇīyaṃ karotū"
      },
      "ti saṅgāhakena chinditabbaṃ chinditvā ekantakaraṇīyaṃ karotūti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahājana"
      },
      "nti bahujanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gandhakuṭiṃ vanditvā"
      },
      " paribhogacetiyabhāvatoti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā ta"
      },
      "nti yathā aññopi yathāvuttasabhāvo, evanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃvejesī"
      },
      "ti ‘‘nanu bhagavatā paṭikacceva akkhātaṃ – ‘sabbeheva piyehi manāpehi nānābhāvo vinābhāvo’’’tiādinā (dī. ni. 2.183; saṃ. ni. 5.379; a. ni. 10.48; cūḷava. 437) saṃvegaṃ janesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ussannadhātuka"
      },
      "nti upacitadosaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhesajjamattā"
      },
      "ti appakaṃ bhesajjaṃ. Appattho hi ayaṃ mattā-saddo, ‘‘mattāsukhapariccāgo’’tiādīsu (dha. pa. 290) viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dutiyadivase"
      },
      "ti devatāya saṃvejitadivasato, jetavanavihāraṃ paviṭṭhadivasato vā dutiyadivase. Āṇāva cakkaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āṇācakkaṃ."
      }
    ],
    "innerText": "Gāvo caranti etthāti gocaro, gocaro viya gocaro, bhikkhācaraṇaṭṭhānaṃ. Visabhāgapuggalo subhaddasadiso. Sattipañjaranti sattikhaggādihatthehi purisehi mallarājūnaṃ bhagavato dhātuārakkhakaraṇaṃ sandhāyāha. Taṃ palibodhaṃ chinditvā taṃ karaṇīyaṃ karotūti saṅgāhakena chinditabbaṃ chinditvā ekantakaraṇīyaṃ karotūti attho. Mahājananti bahujanaṃ. Gandhakuṭiṃ vanditvā paribhogacetiyabhāvatoti adhippāyo. Yathā tanti yathā aññopi yathāvuttasabhāvo, evanti attho. Saṃvejesīti ‘‘nanu bhagavatā paṭikacceva akkhātaṃ – ‘sabbeheva piyehi manāpehi nānābhāvo vinābhāvo’’’tiādinā (dī. ni. 2.183; saṃ. ni. 5.379; a. ni. 10.48; cūḷava. 437) saṃvegaṃ janesi. Ussannadhātukanti upacitadosaṃ. Bhesajjamattāti appakaṃ bhesajjaṃ. Appattho hi ayaṃ mattā-saddo, ‘‘mattāsukhapariccāgo’’tiādīsu (dha. pa. 290) viya. Dutiyadivaseti devatāya saṃvejitadivasato, jetavanavihāraṃ paviṭṭhadivasato vā dutiyadivase. Āṇāva cakkaṃ āṇācakkaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etadagga"
      },
      "nti eso aggo. Liṅgavipallāsena hi ayaṃ niddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadida"
      },
      "nti ca yo ayaṃ, yadidaṃ khandhapañcakanti vā yojetabbaṃ. ‘‘Paṭhamaṃ ",
      " āvuso upāli pārājikaṃ kattha paññatta’’nti kasmā vuttaṃ, nanu tassa saṅgītiyā purimakāle paṭhamabhāvo na yuttoti? No na yutto, bhagavatā paññattānukkamena pātimokkhuddesānukkamena ca paṭhamabhāvassa siddhattā. Yebhuyyena hi tīṇi piṭakāni bhagavato dharamānakāle ṭhitānukkameneva saṅgītāni, visesato vinayābhidhammapiṭakānīti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Vatthumpi pucchī’’"
      },
      "tiādi ‘kattha paññatta’ntiādinā dassitena saha tadavasiṭṭhampi saṅgahetvā dassanavasena vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamapārājike"
      },
      "ti paṭhamapārājikapāḷiyaṃ (pārā. 24), tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na hi tathāgatā ekabyañjanampi niratthakaṃ vadantī’’"
      },
      "ti."
    ],
    "innerText": "Etadagganti eso aggo. Liṅgavipallāsena hi ayaṃ niddeso. Yadidanti ca yo ayaṃ, yadidaṃ khandhapañcakanti vā yojetabbaṃ. ‘‘Paṭhamaṃ āvuso upāli pārājikaṃ kattha paññatta’’nti kasmā vuttaṃ, nanu tassa saṅgītiyā purimakāle paṭhamabhāvo na yuttoti? No na yutto, bhagavatā paññattānukkamena pātimokkhuddesānukkamena ca paṭhamabhāvassa siddhattā. Yebhuyyena hi tīṇi piṭakāni bhagavato dharamānakāle ṭhitānukkameneva saṅgītāni, visesato vinayābhidhammapiṭakānīti daṭṭhabbaṃ. ‘‘Vatthumpi pucchī’’tiādi ‘kattha paññatta’ntiādinā dassitena saha tadavasiṭṭhampi saṅgahetvā dassanavasena vuttaṃ. Paṭhamapārājiketi paṭhamapārājikapāḷiyaṃ (pārā. 24), tenevāha – ‘‘na hi tathāgatā ekabyañjanampi niratthakaṃ vadantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Jātakādike ",
      " khuddakanikāyapariyāpanne, yebhuyyena ca dhammaniddesabhūte tādise abhidhammapiṭake saṅgaṇhituṃ yuttaṃ, na pana dīghanikāyādippakāre suttantapiṭake, nāpi paññattiniddesabhūte vinayapiṭaketi dīghabhāṇakā ‘‘jātakādīnaṃ abhidhammapiṭake saṅgaho’’ti vadanti. Cariyāpiṭakabuddhavaṃsānañcettha aggahaṇaṃ, jātakagatikattā. Majjhimabhāṇakā pana ‘‘aṭṭhuppattivasena desitānaṃ jātakādīnaṃ yathānulomadesanābhāvato tādise suttantapiṭake saṅgaho yutto, na pana sabhāvadhammaniddesabhūte yathādhammasāsane abhidhammapiṭake’’ti jātakādīnaṃ suttantapiṭakapariyāpannataṃ kathayanti. Tattha ca yuttaṃ vicāretvā gahetabbaṃ."
    ],
    "innerText": "Jātakādike khuddakanikāyapariyāpanne, yebhuyyena ca dhammaniddesabhūte tādise abhidhammapiṭake saṅgaṇhituṃ yuttaṃ, na pana dīghanikāyādippakāre suttantapiṭake, nāpi paññattiniddesabhūte vinayapiṭaketi dīghabhāṇakā ‘‘jātakādīnaṃ abhidhammapiṭake saṅgaho’’ti vadanti. Cariyāpiṭakabuddhavaṃsānañcettha aggahaṇaṃ, jātakagatikattā. Majjhimabhāṇakā pana ‘‘aṭṭhuppattivasena desitānaṃ jātakādīnaṃ yathānulomadesanābhāvato tādise suttantapiṭake saṅgaho yutto, na pana sabhāvadhammaniddesabhūte yathādhammasāsane abhidhammapiṭake’’ti jātakādīnaṃ suttantapiṭakapariyāpannataṃ kathayanti. Tattha ca yuttaṃ vicāretvā gahetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " nimittapayojanakāladesakārakakaraṇappakārehi paṭhamaṃ saṅgītiṃ dassetvā idāni tattha vavatthāpitasiddhesu dhammavinayesu nānappakārakosallatthaṃ ekavidhādibhede dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evameta’’"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimuttirasa"
      },
      "nti vimuttiguṇaṃ, vimuttisampattikaṃ vā, aggaphalanipphādanato, vimuttikiccaṃ vā, kilesānaṃ ",
      " accantaṃ vimuttisampādanato. Keci pana ‘‘vimuttiassāda’’nti vadanti."
    ],
    "innerText": "Evaṃ nimittapayojanakāladesakārakakaraṇappakārehi paṭhamaṃ saṅgītiṃ dassetvā idāni tattha vavatthāpitasiddhesu dhammavinayesu nānappakārakosallatthaṃ ekavidhādibhede dassetuṃ ‘‘evameta’’ntiādimāha. Tattha vimuttirasanti vimuttiguṇaṃ, vimuttisampattikaṃ vā, aggaphalanipphādanato, vimuttikiccaṃ vā, kilesānaṃ accantaṃ vimuttisampādanato. Keci pana ‘‘vimuttiassāda’’nti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kiñcāpi avisesena sabbampi buddhavacanaṃ kilesavinayanena vinayo, yathānusiṭṭhaṃ paṭipajjamāne apāyapatanādito dhāraṇena dhammo, idhādhippete pana dhammavinaye niddhāretuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tattha vinayapiṭaka’’"
      },
      "ntiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avasesaṃ buddhavacanaṃ dhammo,"
      },
      " khandhādivasena sabhāvadhammadesanābāhullato. Atha vā yadipi dhammoyeva vinayopi, pariyattiyādibhāvato, vinayasaddasannidhāne pana bhinnādhikaraṇabhāvena payutto dhamma-saddo vinayatantividhuraṃ tantiṃ dīpeti yathā ‘‘puññañāṇasambhārā, gobalibaddha’’nti ca."
    ],
    "innerText": "Kiñcāpi avisesena sabbampi buddhavacanaṃ kilesavinayanena vinayo, yathānusiṭṭhaṃ paṭipajjamāne apāyapatanādito dhāraṇena dhammo, idhādhippete pana dhammavinaye niddhāretuṃ ‘‘tattha vinayapiṭaka’’ntiādimāha. Avasesaṃ buddhavacanaṃ dhammo, khandhādivasena sabhāvadhammadesanābāhullato. Atha vā yadipi dhammoyeva vinayopi, pariyattiyādibhāvato, vinayasaddasannidhāne pana bhinnādhikaraṇabhāvena payutto dhamma-saddo vinayatantividhuraṃ tantiṃ dīpeti yathā ‘‘puññañāṇasambhārā, gobalibaddha’’nti ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Anekajātisaṃsāra’’"
      },
      "nti ayaṃ gāthā bhagavatā attano sabbaññutañāṇapadaṭṭhānaṃ arahattappattiṃ paccavekkhantena ekūnavīsatimassa paccavekkhaṇañāṇassa anantaraṃ bhāsitā. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘idaṃ paṭhamabuddhavacana’’"
      },
      "nti. Idaṃ kira sabbabuddhehi avijahitaṃ udānaṃ. Ayamassa saṅkhepattho – ahaṃ imassa attabhāvagehassa kārakaṃ taṇhāvaḍḍhakiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gavesanto"
      },
      " yena ñāṇena taṃ daṭṭhuṃ sakkā, tassa bodhiñāṇassatthāya dīpaṅkarapādamūle katābhinīhāro ",
      " ettakaṃ kālaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anekajātisaṃsāraṃ"
      },
      " anekajātisatasahassasaṅkhyaṃ saṃsāravaṭṭaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anibbisaṃ"
      },
      " taṃ ñāṇaṃ avindanto alabhantoyeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sandhāvissaṃ"
      },
      " saṃsariṃ. Yasmā jarāvyādhimaraṇamissatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jāti"
      },
      " nāmesā punappunaṃ upagantuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhā,"
      },
      " na ca sā tasmiṃ adiṭṭhe nivattati, tasmā taṃ gavesanto sandhāvissanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhosī"
      },
      "ti idāni mayā sabbaññutañāṇaṃ paṭivijjhantena diṭṭho asi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puna geha"
      },
      "nti puna imaṃ attabhāvasaṅkhātaṃ mama gehaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na kāhasi"
      },
      " na karissasi. Tava ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbā"
      },
      " avasesākilesa",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "phāsukā"
      },
      " mayā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhaggā."
      },
      " Imassa tayā katassa attabhāvagehassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kūṭaṃ"
      },
      " avijjāsaṅkhātaṃ kaṇṇikamaṇḍalaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visaṅkhataṃ"
      },
      " viddhaṃsitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visaṅkhāraṃ"
      },
      " nibbānaṃ ārammaṇakaraṇavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gataṃ"
      },
      " anupaviṭṭhaṃ idāni mama cittaṃ, ahañca ",
      " taṇhānaṃ khayasaṅkhātaṃ arahattamaggaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhagā"
      },
      " adhigato pattosmīti. Ayaṃ manasā pavattitadhammānamādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Yadā have pātubhavanti dhammā’’"
      },
      "ti (udā. 1, 2, 3) ayaṃ pana vācāya pavattitadhammānaṃ ādīti vadanti. Antojappanavasena kira bhagavā ‘‘anekajātisaṃsāra’’ntiādimāha (dha. pa. 153). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Pāṭipadadivase’’"
      },
      "ti idaṃ ‘‘sabbaññubhāvappattassā’’ti ",
      " na etena sambandhitabbaṃ, ‘‘paccavekkhantassa uppannā’’ti etena pana sambandhitabbaṃ. Visākhapuṇṇamāyameva hi bhagavā paccūsasamaye sabbaññutaṃ pattoti."
    ],
    "innerText": "‘‘Anekajātisaṃsāra’’nti ayaṃ gāthā bhagavatā attano sabbaññutañāṇapadaṭṭhānaṃ arahattappattiṃ paccavekkhantena ekūnavīsatimassa paccavekkhaṇañāṇassa anantaraṃ bhāsitā. Tenāha ‘‘idaṃ paṭhamabuddhavacana’’nti. Idaṃ kira sabbabuddhehi avijahitaṃ udānaṃ. Ayamassa saṅkhepattho – ahaṃ imassa attabhāvagehassa kārakaṃ taṇhāvaḍḍhakiṃ gavesanto yena ñāṇena taṃ daṭṭhuṃ sakkā, tassa bodhiñāṇassatthāya dīpaṅkarapādamūle katābhinīhāro ettakaṃ kālaṃ anekajātisaṃsāraṃ anekajātisatasahassasaṅkhyaṃ saṃsāravaṭṭaṃ anibbisaṃ taṃ ñāṇaṃ avindanto alabhantoyeva sandhāvissaṃ saṃsariṃ. Yasmā jarāvyādhimaraṇamissatāya jāti nāmesā punappunaṃ upagantuṃ dukkhā, na ca sā tasmiṃ adiṭṭhe nivattati, tasmā taṃ gavesanto sandhāvissanti attho. Diṭṭhosīti idāni mayā sabbaññutañāṇaṃ paṭivijjhantena diṭṭho asi. Puna gehanti puna imaṃ attabhāvasaṅkhātaṃ mama gehaṃ. Na kāhasi na karissasi. Tava sabbā avasesākilesaphāsukā mayā bhaggā. Imassa tayā katassa attabhāvagehassa kūṭaṃ avijjāsaṅkhātaṃ kaṇṇikamaṇḍalaṃ visaṅkhataṃ viddhaṃsitaṃ. Visaṅkhāraṃ nibbānaṃ ārammaṇakaraṇavasena gataṃ anupaviṭṭhaṃ idāni mama cittaṃ, ahañca taṇhānaṃ khayasaṅkhātaṃ arahattamaggaṃ ajjhagā adhigato pattosmīti. Ayaṃ manasā pavattitadhammānamādi. ‘‘Yadā have pātubhavanti dhammā’’ti (udā. 1, 2, 3) ayaṃ pana vācāya pavattitadhammānaṃ ādīti vadanti. Antojappanavasena kira bhagavā ‘‘anekajātisaṃsāra’’ntiādimāha (dha. pa. 153). ‘‘Pāṭipadadivase’’ti idaṃ ‘‘sabbaññubhāvappattassā’’ti na etena sambandhitabbaṃ, ‘‘paccavekkhantassa uppannā’’ti etena pana sambandhitabbaṃ. Visākhapuṇṇamāyameva hi bhagavā paccūsasamaye sabbaññutaṃ pattoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vayadhammā"
      },
      "ti aniccalakkhaṇamukhena dukkhānattalakkhaṇampi saṅkhārānaṃ vibhāveti ‘‘yadaniccaṃ taṃ dukkhaṃ, yaṃ dukkhaṃ tadanattā’’ti (saṃ. ni. 3.15; paṭi. ma. 2.10) vacanato. Lakkhaṇattayavibhāvananayeneva ca tadārammaṇaṃ vipassanaṃ dassento sabbatitthiyānaṃ avisayabhūtaṃ buddhāveṇikaṃ catusaccakammaṭṭhānādhiṭṭhānaṃ aviparītaṃ nibbānagāminippaṭipadaṃ pakāsetīti daṭṭhabbaṃ. Idāni tattha sammāpaṭipattiyaṃ niyojeti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘appamādena sampādethā’’"
      },
      "ti. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vayadhammā saṅkhārā’’"
      },
      "ti etena saṅkhepena saṃvejetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘appamādena sampādethā’’"
      },
      "ti saṅkhepeneva niravasesaṃ sammāpaṭipattiṃ dasseti. Appamādapadañhi sikkhāttayasaṅgahitaṃ kevalaparipuṇṇaṃ sāsanaṃ pariyādiyitvā tiṭṭhatīti."
    ],
    "innerText": "Vayadhammāti aniccalakkhaṇamukhena dukkhānattalakkhaṇampi saṅkhārānaṃ vibhāveti ‘‘yadaniccaṃ taṃ dukkhaṃ, yaṃ dukkhaṃ tadanattā’’ti (saṃ. ni. 3.15; paṭi. ma. 2.10) vacanato. Lakkhaṇattayavibhāvananayeneva ca tadārammaṇaṃ vipassanaṃ dassento sabbatitthiyānaṃ avisayabhūtaṃ buddhāveṇikaṃ catusaccakammaṭṭhānādhiṭṭhānaṃ aviparītaṃ nibbānagāminippaṭipadaṃ pakāsetīti daṭṭhabbaṃ. Idāni tattha sammāpaṭipattiyaṃ niyojeti ‘‘appamādena sampādethā’’ti. Atha vā ‘‘vayadhammā saṅkhārā’’ti etena saṅkhepena saṃvejetvā ‘‘appamādena sampādethā’’ti saṅkhepeneva niravasesaṃ sammāpaṭipattiṃ dasseti. Appamādapadañhi sikkhāttayasaṅgahitaṃ kevalaparipuṇṇaṃ sāsanaṃ pariyādiyitvā tiṭṭhatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamasaṅgītiyaṃ asaṅgītaṃ"
      },
      " saṅgītikkhandhakakathāvatthuppakaraṇādi. Keci pana ‘‘subhasuttampi (dī. ni. 1.444) paṭhamasaṅgītiyaṃ asaṅgīta’’nti vadanti, taṃ pana na yujjati. Paṭhamasaṅgītito ",
      " puretarameva hi āyasmatā ānandena jetavane viharantena subhassa māṇavassa bhāsitanti."
    ],
    "innerText": "Paṭhamasaṅgītiyaṃ asaṅgītaṃ saṅgītikkhandhakakathāvatthuppakaraṇādi. Keci pana ‘‘subhasuttampi (dī. ni. 1.444) paṭhamasaṅgītiyaṃ asaṅgīta’’nti vadanti, taṃ pana na yujjati. Paṭhamasaṅgītito puretarameva hi āyasmatā ānandena jetavane viharantena subhassa māṇavassa bhāsitanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Daḷhikammasithilīkaraṇappayojanā"
      },
      " yathākkamaṃ pakatisāvajjapaṇṇattisāvajjesu sikkhāpadesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tenā"
      },
      "ti vividhanayattādinā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eta"
      },
      "nti vividhavisesanayattāti gāthāvacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etassā"
      },
      "ti vinayassa."
    ],
    "innerText": "Daḷhikammasithilīkaraṇappayojanā yathākkamaṃ pakatisāvajjapaṇṇattisāvajjesu sikkhāpadesu. Tenāti vividhanayattādinā. Etanti vividhavisesanayattāti gāthāvacanaṃ. Etassāti vinayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attatthaparatthādibhede"
      },
      "ti ",
      " yo taṃ suttaṃ sajjhāyati, suṇāti, vāceti, cinteti, deseti ca, suttena saṅgahito sīlādiattho tassāpi hoti, tena parassa sādhetabbato parassāpi hotīti, tadubhayaṃ taṃ suttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sūceti"
      },
      " dīpeti. Tathā diṭṭhadhammikasamparāyikaṃ lokiyalokuttarañcāti evamādibhede atthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attha"
      },
      "-saddo cāyaṃ hitapariyāyavacanaṃ, na bhāsitatthavacanaṃ, yadi siyā, suttaṃ attanopi bhāsitatthaṃ sūceti, parassāpīti ayamattho vutto siyā. Suttena ca yo attho pakāsito so tasseva hotīti, na tena parattho sūcito hoti, tena sūcetabbassa paratthassa nivattetabbassa abhāvā atthagahaṇañca na kattabbaṃ. Attatthaparatthavinimmuttassa bhāsitatthassa abhāvā ādiggahaṇañca na kattabbaṃ. Tasmā yathāvuttassa hitapariyāyassa atthassa sutte asambhavato suttadhārassa puggalassa vasena attatthaparatthā vuttā."
    ],
    "innerText": "Attatthaparatthādibhedeti yo taṃ suttaṃ sajjhāyati, suṇāti, vāceti, cinteti, deseti ca, suttena saṅgahito sīlādiattho tassāpi hoti, tena parassa sādhetabbato parassāpi hotīti, tadubhayaṃ taṃ suttaṃ sūceti dīpeti. Tathā diṭṭhadhammikasamparāyikaṃ lokiyalokuttarañcāti evamādibhede atthe ādi-saddena saṅgaṇhāti. Attha-saddo cāyaṃ hitapariyāyavacanaṃ, na bhāsitatthavacanaṃ, yadi siyā, suttaṃ attanopi bhāsitatthaṃ sūceti, parassāpīti ayamattho vutto siyā. Suttena ca yo attho pakāsito so tasseva hotīti, na tena parattho sūcito hoti, tena sūcetabbassa paratthassa nivattetabbassa abhāvā atthagahaṇañca na kattabbaṃ. Attatthaparatthavinimmuttassa bhāsitatthassa abhāvā ādiggahaṇañca na kattabbaṃ. Tasmā yathāvuttassa hitapariyāyassa atthassa sutte asambhavato suttadhārassa puggalassa vasena attatthaparatthā vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " vā suttaṃ anapekkhitvā ye attatthādayo atthappabhedā vuttā ‘‘na haññadatthatthipasaṃsalābhā’’ti etassa padassa niddese (mahāni. 63; cūḷani. 85) ‘‘attattho, parattho, ubhayattho, diṭṭhadhammiko attho, samparāyiko attho, uttāno attho, gambhīro attho, gūḷho attho, paṭicchanno attho, neyyo attho, nīto attho, anavajjo attho, nikkileso attho, vodāno attho, paramattho’’ti te suttaṃ sūcetīti attho. Imasmiṃ atthavikappe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attha"
      },
      "-saddo bhāsitatthapariyāyopi hoti. Ettha hi purimakā pañca atthappabhedā hitapariyāyā, tato pare cha bhāsitatthabhedā, pacchimakā pana ubhayasabhāvā. Tattha duradhigamatāya vibhāvane aladdhagādho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gambhīro. "
      },
      " Na vivaṭo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gūḷho."
      },
      " Mūludakādayo viya paṃsunā akkharasannivesādinā tirohito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭicchanno"
      },
      ". Niddhāretvā ",
      " ñāpetabbo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "neyyo."
      },
      " Yathārutavasena veditabbo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nīto. Anavajjanikkilesavodānā"
      },
      " pariyāyavasena vuttā, kusalavipākakiriyādhammavasena vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paramattho"
      },
      " nibbānaṃ, dhammānaṃ aviparītasabhāvo eva vā. Atha vā ‘‘attanā ca appiccho hotī’’ti attatthaṃ, ‘‘appicchākathañca paresaṃ kattā hotī’’ti paratthaṃ sūceti. Evaṃ ‘‘attanā ca pāṇātipātā paṭivirato hotī’’tiādi (a. ni. 4.99, 265) suttāni yojetabbāni. Vinayābhidhammehi ca visesetvā sutta-saddassa attho vattabbo. Tasmā veneyyajjhāsayavasappavattāya desanāya attahitaparahitatādīni sātisayaṃ pakāsitāni hoti tapparabhāvato, na āṇādhammasabhāvavasappavattāyāti idameva ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atthānaṃ sūcanato sutta’’"
      },
      "nti vuttaṃ."
    ],
    "innerText": "Atha vā suttaṃ anapekkhitvā ye attatthādayo atthappabhedā vuttā ‘‘na haññadatthatthipasaṃsalābhā’’ti etassa padassa niddese (mahāni. 63; cūḷani. 85) ‘‘attattho, parattho, ubhayattho, diṭṭhadhammiko attho, samparāyiko attho, uttāno attho, gambhīro attho, gūḷho attho, paṭicchanno attho, neyyo attho, nīto attho, anavajjo attho, nikkileso attho, vodāno attho, paramattho’’ti te suttaṃ sūcetīti attho. Imasmiṃ atthavikappe attha-saddo bhāsitatthapariyāyopi hoti. Ettha hi purimakā pañca atthappabhedā hitapariyāyā, tato pare cha bhāsitatthabhedā, pacchimakā pana ubhayasabhāvā. Tattha duradhigamatāya vibhāvane aladdhagādho gambhīro. Na vivaṭo gūḷho. Mūludakādayo viya paṃsunā akkharasannivesādinā tirohito paṭicchanno. Niddhāretvā ñāpetabbo neyyo. Yathārutavasena veditabbo nīto. Anavajjanikkilesavodānā pariyāyavasena vuttā, kusalavipākakiriyādhammavasena vā. Paramattho nibbānaṃ, dhammānaṃ aviparītasabhāvo eva vā. Atha vā ‘‘attanā ca appiccho hotī’’ti attatthaṃ, ‘‘appicchākathañca paresaṃ kattā hotī’’ti paratthaṃ sūceti. Evaṃ ‘‘attanā ca pāṇātipātā paṭivirato hotī’’tiādi (a. ni. 4.99, 265) suttāni yojetabbāni. Vinayābhidhammehi ca visesetvā sutta-saddassa attho vattabbo. Tasmā veneyyajjhāsayavasappavattāya desanāya attahitaparahitatādīni sātisayaṃ pakāsitāni hoti tapparabhāvato, na āṇādhammasabhāvavasappavattāyāti idameva ca ‘‘atthānaṃ sūcanato sutta’’nti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sutte ca āṇādhammasabhāvā ca veneyyajjhāsayaṃ anuvattanti, na vinayābhidhammesu viya veneyyajjhāsayo āṇādhammasabhāve. Tasmā veneyyānaṃ ekantahitapaṭilābhasaṃvattanikā suttantadesanā hotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘suvuttā cetthā’’"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pasavatī"
      },
      "ti phalati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Suttāṇā’’"
      },
      "ti etassa atthaṃ pakāsetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘suṭṭhu ca ne tāyatī’’"
      },
      "ti vuttaṃ. Attatthādividhānesu ca suttassa pamāṇabhāvo, attatthādīnañca saṅgāhakattaṃ yojetabbaṃ tadatthappakāsanapadhānattā suttassa. Vinayābhidhammehi visesanañca yojetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eta"
      },
      "nti ‘‘atthānaṃ sūcanato’’tiādikaṃ atthavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etassā"
      },
      "ti suttassa."
    ],
    "innerText": "Sutte ca āṇādhammasabhāvā ca veneyyajjhāsayaṃ anuvattanti, na vinayābhidhammesu viya veneyyajjhāsayo āṇādhammasabhāve. Tasmā veneyyānaṃ ekantahitapaṭilābhasaṃvattanikā suttantadesanā hotīti ‘‘suvuttā cetthā’’tiādi vuttaṃ. Pasavatīti phalati. ‘‘Suttāṇā’’ti etassa atthaṃ pakāsetuṃ ‘‘suṭṭhu ca ne tāyatī’’ti vuttaṃ. Attatthādividhānesu ca suttassa pamāṇabhāvo, attatthādīnañca saṅgāhakattaṃ yojetabbaṃ tadatthappakāsanapadhānattā suttassa. Vinayābhidhammehi visesanañca yojetabbaṃ. Etanti ‘‘atthānaṃ sūcanato’’tiādikaṃ atthavacanaṃ. Etassāti suttassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhikkamantī"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhi"
      },
      "-saddo kamanakiriyāya vuddhibhāvaṃ atirekataṃ dīpeti, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhiññātā abhilakkhitā"
      },
      "ti ettha ñāṇalakkhaṇakiriyānaṃ supākaṭatāvisesaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhikkantenā"
      },
      "ti ",
      " ettha kantiyā adhikattaṃ visiṭṭhatanti yuttaṃ kiriyāvisesakattā upasaggassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhirājā abhivinaye"
      },
      "ti pana pūjitaparicchinnesu rājavinayesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhi"
      },
      "-saddo pavattatīti kathametaṃ yujjeyyāti ",
      "? Pūjanaparicchedanakiriyādīpanato, tāhi ca kiriyāhi rājavinayānaṃ yuttattā. Ettha hi atimālādīsu ati-saddo viya, abhi-saddo yathā saha sādhanena kiriyaṃ vadatīti abhirājaabhivinaya-saddā siddhā, evaṃ abhidhammasadde abhi-saddo saha sādhanena vuḍḍhiyādikiriyaṃ dīpetīti ayamattho dassitoti daṭṭhabbo."
    ],
    "innerText": "Abhikkamantīti ettha abhi-saddo kamanakiriyāya vuddhibhāvaṃ atirekataṃ dīpeti, abhiññātā abhilakkhitāti ettha ñāṇalakkhaṇakiriyānaṃ supākaṭatāvisesaṃ, abhikkantenāti ettha kantiyā adhikattaṃ visiṭṭhatanti yuttaṃ kiriyāvisesakattā upasaggassa. Abhirājā abhivinayeti pana pūjitaparicchinnesu rājavinayesu abhi-saddo pavattatīti kathametaṃ yujjeyyāti ? Pūjanaparicchedanakiriyādīpanato, tāhi ca kiriyāhi rājavinayānaṃ yuttattā. Ettha hi atimālādīsu ati-saddo viya, abhi-saddo yathā saha sādhanena kiriyaṃ vadatīti abhirājaabhivinaya-saddā siddhā, evaṃ abhidhammasadde abhi-saddo saha sādhanena vuḍḍhiyādikiriyaṃ dīpetīti ayamattho dassitoti daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāvanāpharaṇavuḍḍhīhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuḍḍhimantopi dhammā vuttā. Ārammaṇādīhī"
      },
      "ti ārammaṇasampayuttakammadvārapaṭipadādīhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avisiṭṭha"
      },
      "nti aññamaññavisiṭṭhesu vinayasuttābhidhammesu avisiṭṭhaṃ samānaṃ. Taṃ piṭakasaddanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathāvuttenā"
      },
      "ti ‘‘evaṃ duvidhatthenā’’tiādinā vuttappakārena."
    ],
    "innerText": "Bhāvanāpharaṇavuḍḍhīhi vuḍḍhimantopi dhammā vuttā. Ārammaṇādīhīti ārammaṇasampayuttakammadvārapaṭipadādīhi. Avisiṭṭhanti aññamaññavisiṭṭhesu vinayasuttābhidhammesu avisiṭṭhaṃ samānaṃ. Taṃ piṭakasaddanti attho. Yathāvuttenāti ‘‘evaṃ duvidhatthenā’’tiādinā vuttappakārena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathetabbānaṃ atthānaṃ desakāyattena āṇādividhinā atisajjanaṃ pabodhanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "desanā."
      },
      " Sāsitabbapuggalagatena yathāparādhādisāsitabbabhāvena anusāsanaṃ vinayanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāsanaṃ."
      },
      " Kathetabbassa saṃvarāsaṃvarādino atthassa kathanaṃ vacanapaṭibaddhatākaraṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kathā."
      },
      " Kathīyati vā etthāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kathā."
      },
      " Saṃvarāsaṃvarassa kathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃvarāsaṃvarakathā."
      },
      " Esa nayo itaresupi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bheda"
      },
      "-saddo visuṃ visuṃ yojetabbo ‘‘desanābhedaṃ sāsanabhedaṃ kathābhedañca yathārahaṃ paridīpaye’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bheda"
      },
      "nti ca nānattanti attho. Sikkhā ca pahānāni ca gambhīrabhāvo ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sikkhāppahānagambhīrabhāvaṃ,"
      },
      " tañca paridīpaye. Ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathā"
      },
      "ti upārambhanissaraṇadhammakosarakkhaṇahetupariyāpuṇanaṃ ",
      " suppaṭipatti duppaṭipattīti etehi pakārehi. Āṇaṃ paṇetuṃ arahatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āṇāraho"
      },
      " sammāsambuddhattā. Vohāraparamatthānampi sabbhāvato āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āṇābāhullato"
      },
      "ti. Ito paresupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacurāparādhā"
      },
      " seyyasakādayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhāsayo"
      },
      " āsayova atthato diṭṭhi, ñāṇañca. Vuttañcetaṃ –"
    ],
    "innerText": "Kathetabbānaṃ atthānaṃ desakāyattena āṇādividhinā atisajjanaṃ pabodhanaṃ desanā. Sāsitabbapuggalagatena yathāparādhādisāsitabbabhāvena anusāsanaṃ vinayanaṃ sāsanaṃ. Kathetabbassa saṃvarāsaṃvarādino atthassa kathanaṃ vacanapaṭibaddhatākaraṇaṃ kathā. Kathīyati vā etthāti kathā. Saṃvarāsaṃvarassa kathā saṃvarāsaṃvarakathā. Esa nayo itaresupi. Bheda-saddo visuṃ visuṃ yojetabbo ‘‘desanābhedaṃ sāsanabhedaṃ kathābhedañca yathārahaṃ paridīpaye’’ti. Bhedanti ca nānattanti attho. Sikkhā ca pahānāni ca gambhīrabhāvo ca sikkhāppahānagambhīrabhāvaṃ, tañca paridīpaye. Ettha yathāti upārambhanissaraṇadhammakosarakkhaṇahetupariyāpuṇanaṃ suppaṭipatti duppaṭipattīti etehi pakārehi. Āṇaṃ paṇetuṃ arahatīti āṇāraho sammāsambuddhattā. Vohāraparamatthānampi sabbhāvato āha āṇābāhullatoti. Ito paresupi eseva nayo. Pacurāparādhā seyyasakādayo. Ajjhāsayo āsayova atthato diṭṭhi, ñāṇañca. Vuttañcetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sassatucchedadiṭṭhi ca, khanti cevānulomike;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yathābhūtañca yaṃ ñāṇaṃ, etaṃ āsayasaddita’’nti. (visuddhi. ṭī. 1.136);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anusayā"
      },
      " kāmarāgabhavarāgadiṭṭhipaṭighavicikicchāmānāvijjāvasena satta anāgatā kilesā, atītā paccuppannā ca tatheva vuccanti. Na hi kālabhedena dhammānaṃ sabhāvabhedo atthīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cariyā"
      },
      "ti cha mūlacariyā, antarabhedena anekavidhā, saṃsaggavasena tesaṭṭhi honti. Te pana amhehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asammohantaradhānasuttaṭīkāyaṃ"
      },
      " vibhāgato dassitā, atthikehi tato gahetabbā. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cariyā"
      },
      "ti caritaṃ, taṃ sucaritaduccaritavasena duvidhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhimutti"
      },
      " nāma sattānaṃ pubbaparicayavasena abhiruci, sā duvidhā hīnapaṇītabhedena. Ghanavinibbhogābhāvato diṭṭhimānataṇhāvasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ahaṃ mamā’’ti saññino."
      },
      " Mahanto saṃvaro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asaṃvaro."
      },
      " Buddhiattho hi aya’makāro yathā ‘‘asekkhā dhammā’’ti (dha. sa. 11)."
    ],
    "innerText": "Anusayā kāmarāgabhavarāgadiṭṭhipaṭighavicikicchāmānāvijjāvasena satta anāgatā kilesā, atītā paccuppannā ca tatheva vuccanti. Na hi kālabhedena dhammānaṃ sabhāvabhedo atthīti. Cariyāti cha mūlacariyā, antarabhedena anekavidhā, saṃsaggavasena tesaṭṭhi honti. Te pana amhehi asammohantaradhānasuttaṭīkāyaṃ vibhāgato dassitā, atthikehi tato gahetabbā. Atha vā cariyāti caritaṃ, taṃ sucaritaduccaritavasena duvidhaṃ. Adhimutti nāma sattānaṃ pubbaparicayavasena abhiruci, sā duvidhā hīnapaṇītabhedena. Ghanavinibbhogābhāvato diṭṭhimānataṇhāvasena ‘‘ahaṃ mamā’’ti saññino. Mahanto saṃvaro asaṃvaro. Buddhiattho hi aya’makāro yathā ‘‘asekkhā dhammā’’ti (dha. sa. 11)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tīsupi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cetesu ete dhammatthadesanā paṭivedhā"
      },
      "ti ettha tantiattho tantidesanā tantiatthapaṭivedho ca tantivisayā hontīti vinayapiṭakādīnaṃ atthadesanāpaṭivedhādhārabhāvo ",
      " yutto, piṭakāni pana tanti yevāti tesaṃ dhammādhārabhāvo kathaṃ yujjeyyāti? Tantisamudāyassa avayavatantiyā ādhārabhāvato. Avayavassa hi samudāyo ādhārabhāvena vuccati, yathā – ‘‘rukkhe sākhā’’ti. Dhammādīnañca dukkhogāhabhāvato tehi vinayādayo gambhīrāti vinayādīnañca catubbidho gambhīrabhāvo vutto. Tasmā dhammādayo eva dukkhogāhattā gambhīrā, na vinayādayoti na codetabbametaṃ samukhena, visayavisayīmukhena ca vinayādīnaṃyeva gambhīrabhāvassa vuttattā. Dhammo hi vinayādayo, tesaṃ visayo attho, dhammatthavisayā ca desanāpaṭivedhoti. Tattha paṭivedhassa dukkarabhāvato dhammatthānaṃ, desanāñāṇassa dukkarabhāvato desanāya ca dukkhogāhabhāvo veditabbo, paṭivedhassa pana uppādetuṃ asakkuṇeyyattā, tabbisayañāṇuppattiyā ca dukkarabhāvato dukkhogāhatā veditabbā."
    ],
    "innerText": "Tīsupicetesu ete dhammatthadesanā paṭivedhāti ettha tantiattho tantidesanā tantiatthapaṭivedho ca tantivisayā hontīti vinayapiṭakādīnaṃ atthadesanāpaṭivedhādhārabhāvo yutto, piṭakāni pana tanti yevāti tesaṃ dhammādhārabhāvo kathaṃ yujjeyyāti? Tantisamudāyassa avayavatantiyā ādhārabhāvato. Avayavassa hi samudāyo ādhārabhāvena vuccati, yathā – ‘‘rukkhe sākhā’’ti. Dhammādīnañca dukkhogāhabhāvato tehi vinayādayo gambhīrāti vinayādīnañca catubbidho gambhīrabhāvo vutto. Tasmā dhammādayo eva dukkhogāhattā gambhīrā, na vinayādayoti na codetabbametaṃ samukhena, visayavisayīmukhena ca vinayādīnaṃyeva gambhīrabhāvassa vuttattā. Dhammo hi vinayādayo, tesaṃ visayo attho, dhammatthavisayā ca desanāpaṭivedhoti. Tattha paṭivedhassa dukkarabhāvato dhammatthānaṃ, desanāñāṇassa dukkarabhāvato desanāya ca dukkhogāhabhāvo veditabbo, paṭivedhassa pana uppādetuṃ asakkuṇeyyattā, tabbisayañāṇuppattiyā ca dukkarabhāvato dukkhogāhatā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Hetumhi ñāṇaṃ dhammapaṭisambhidā’’"
      },
      "ti etena vacanena dhammassa hetubhāvo kathaṃ ñātabboti? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Dhammapaṭisambhidā’’"
      },
      "ti etassa samāsapadassa avayavapadatthaṃ dassentena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘hetumhi ñāṇa’’"
      },
      "nti vuttattā. ‘‘Dhamme paṭisambhidā’’ti ettha hi ‘‘dhamme’’ti etassa atthaṃ dassentena ‘‘hetumhī’’ti vuttaṃ, ‘‘paṭisambhidā’’ti etassa ca atthaṃ dassentena ‘‘ñāṇa’’nti. Tasmā hetudhamma-saddā ekatthā, ñāṇapaṭisambhidā-saddā cāti imamatthaṃ vadantena sādhito dhammassa hetubhāvo, atthassa hetuphalabhāvo ca evameva daṭṭhabbo."
    ],
    "innerText": "‘‘Hetumhi ñāṇaṃ dhammapaṭisambhidā’’ti etena vacanena dhammassa hetubhāvo kathaṃ ñātabboti? ‘‘Dhammapaṭisambhidā’’ti etassa samāsapadassa avayavapadatthaṃ dassentena ‘‘hetumhi ñāṇa’’nti vuttattā. ‘‘Dhamme paṭisambhidā’’ti ettha hi ‘‘dhamme’’ti etassa atthaṃ dassentena ‘‘hetumhī’’ti vuttaṃ, ‘‘paṭisambhidā’’ti etassa ca atthaṃ dassentena ‘‘ñāṇa’’nti. Tasmā hetudhamma-saddā ekatthā, ñāṇapaṭisambhidā-saddā cāti imamatthaṃ vadantena sādhito dhammassa hetubhāvo, atthassa hetuphalabhāvo ca evameva daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathādhamma"
      },
      "nti cettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhamma"
      },
      "-saddo hetuṃ hetuphalañca sabbaṃ saṅgaṇhāti. Sabhāvavācako hesa, na pariyattihetubhāvavācako, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathādhamma"
      },
      "nti yo yo avijjāsaṅkhārādidhammo ",
      ", tasmiṃ tasminti attho. Dhammānurūpaṃ vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathādhammaṃ."
      },
      " Desanāpi hi paṭivedho viya aviparītasavisayavibhāvanato dhammānurūpaṃ pavattati, yato ‘aviparītābhilāpo’ti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammābhilāpo"
      },
      "ti atthabyañjanako aviparītābhilāpo, etena ‘‘tatra dhammaniruttābhilāpe ñāṇaṃ niruttipaṭisambhidā’’ti (vibha. 718) ettha vuttaṃ sabhāvadhammaniruttiṃ dasseti, saddasabhāvattā desanāya. Tathā hi niruttipaṭisambhidāya ",
      " parittārammaṇādibhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisambhidāvibhaṅgapāḷiyaṃ"
      },
      " (vibha. 749) vutto. Aṭṭhakathāyañca ‘‘taṃ sabhāvaniruttiṃ saddaṃ ārammaṇaṃ katvā’’tiādinā (vibha. aṭṭha. 642) saddārammaṇatā ",
      " dassitā. ‘‘Imassa atthassa ayaṃ saddo vācako’’ti vacanavacanīye vavatthapetvā taṃtaṃvacanīya vibhāvanavasena pavattito hi saddo desanāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Anulomādivasena vā kathana’’"
      },
      "nti etena tassā dhammaniruttiyā abhilāpaṃ kathanaṃ tassa vacanassa pavattanaṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Adhippāyo’’"
      },
      "ti etena ‘‘desanāti paññattī’’ti etaṃ vacanaṃ dhammaniruttābhilāpaṃ sandhāya vuttaṃ, na tabbinimuttaṃ paññattiṃ sandhāyāti dasseti."
    ],
    "innerText": "Yathādhammanti cettha dhamma-saddo hetuṃ hetuphalañca sabbaṃ saṅgaṇhāti. Sabhāvavācako hesa, na pariyattihetubhāvavācako, tasmā yathādhammanti yo yo avijjāsaṅkhārādidhammo , tasmiṃ tasminti attho. Dhammānurūpaṃ vā yathādhammaṃ. Desanāpi hi paṭivedho viya aviparītasavisayavibhāvanato dhammānurūpaṃ pavattati, yato ‘aviparītābhilāpo’ti vuccati. Dhammābhilāpoti atthabyañjanako aviparītābhilāpo, etena ‘‘tatra dhammaniruttābhilāpe ñāṇaṃ niruttipaṭisambhidā’’ti (vibha. 718) ettha vuttaṃ sabhāvadhammaniruttiṃ dasseti, saddasabhāvattā desanāya. Tathā hi niruttipaṭisambhidāya parittārammaṇādibhāvo paṭisambhidāvibhaṅgapāḷiyaṃ (vibha. 749) vutto. Aṭṭhakathāyañca ‘‘taṃ sabhāvaniruttiṃ saddaṃ ārammaṇaṃ katvā’’tiādinā (vibha. aṭṭha. 642) saddārammaṇatā dassitā. ‘‘Imassa atthassa ayaṃ saddo vācako’’ti vacanavacanīye vavatthapetvā taṃtaṃvacanīya vibhāvanavasena pavattito hi saddo desanāti. ‘‘Anulomādivasena vā kathana’’nti etena tassā dhammaniruttiyā abhilāpaṃ kathanaṃ tassa vacanassa pavattanaṃ dasseti. ‘‘Adhippāyo’’ti etena ‘‘desanāti paññattī’’ti etaṃ vacanaṃ dhammaniruttābhilāpaṃ sandhāya vuttaṃ, na tabbinimuttaṃ paññattiṃ sandhāyāti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nanu ca ‘‘dhammo tantī’’ti imasmiṃ pakkhe dhammassa saddasabhāvattā dhammadesanānaṃ viseso na siyāti? Na, tesaṃ tesaṃ atthānaṃ bodhakabhāvena ñāto, uggahaṇādivasena ca pubbe vavatthāpito saddappabandho dhammo, pacchā paresaṃ avabodhanatthaṃ pavattito tadatthappakāsako ",
      " saddo desanāti. Atha vā yathāvuttasaddasamuṭṭhāpako cittuppādo desanā, musāvādādayo viya. ‘‘Vacanassa pavattana’’nti ca yathāvuttacittuppādavasena yujjati. So hi vacanaṃ pavatteti, tañca tena pavattīyati desīyati. ‘‘So ca lokiyalokuttaro’’ti evaṃ vuttaṃ abhisamayaṃ yena pakārena abhisameti, yaṃ abhisameti, yo ca tassa sabhāvo, tehi pākaṭaṃ kātuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘visayato asammohato ca atthānurūpaṃ dhammesū’’"
      },
      "tiādimāha. Tattha hi visayato atthādianurūpaṃ dhammādīsu avabodho avijjādidhammasaṅkhārādiatthatadubhayapaññāpanārammaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokiyo abhisamayo,"
      },
      " asammohato atthādianurūpaṃ dhammādīsu avabodho nibbānārammaṇo maggasampayutto yathāvuttadhammatthapaññattīsu sammohaviddhaṃsano ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokuttaro abhisamayo"
      },
      "ti. Abhisamayato aññampi paṭivedhatthaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tesaṃ tesaṃ vā’’"
      },
      "tiādimāha. ‘Paṭivedhanaṃ paṭivedho’ti iminā hi vacanatthena abhisamayo, ‘paṭivijjhīyatīti paṭivedho’ti iminā taṃtaṃrūpādidhammānaṃ aviparītasabhāvo ca ‘‘paṭivedho’’ti vuccatīti."
    ],
    "innerText": "Nanu ca ‘‘dhammo tantī’’ti imasmiṃ pakkhe dhammassa saddasabhāvattā dhammadesanānaṃ viseso na siyāti? Na, tesaṃ tesaṃ atthānaṃ bodhakabhāvena ñāto, uggahaṇādivasena ca pubbe vavatthāpito saddappabandho dhammo, pacchā paresaṃ avabodhanatthaṃ pavattito tadatthappakāsako saddo desanāti. Atha vā yathāvuttasaddasamuṭṭhāpako cittuppādo desanā, musāvādādayo viya. ‘‘Vacanassa pavattana’’nti ca yathāvuttacittuppādavasena yujjati. So hi vacanaṃ pavatteti, tañca tena pavattīyati desīyati. ‘‘So ca lokiyalokuttaro’’ti evaṃ vuttaṃ abhisamayaṃ yena pakārena abhisameti, yaṃ abhisameti, yo ca tassa sabhāvo, tehi pākaṭaṃ kātuṃ ‘‘visayato asammohato ca atthānurūpaṃ dhammesū’’tiādimāha. Tattha hi visayato atthādianurūpaṃ dhammādīsu avabodho avijjādidhammasaṅkhārādiatthatadubhayapaññāpanārammaṇo lokiyo abhisamayo, asammohato atthādianurūpaṃ dhammādīsu avabodho nibbānārammaṇo maggasampayutto yathāvuttadhammatthapaññattīsu sammohaviddhaṃsano lokuttaro abhisamayoti. Abhisamayato aññampi paṭivedhatthaṃ dassetuṃ ‘‘tesaṃ tesaṃ vā’’tiādimāha. ‘Paṭivedhanaṃ paṭivedho’ti iminā hi vacanatthena abhisamayo, ‘paṭivijjhīyatīti paṭivedho’ti iminā taṃtaṃrūpādidhammānaṃ aviparītasabhāvo ca ‘‘paṭivedho’’ti vuccatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathāvuttehi dhammādīhi piṭakānaṃ gambhīrabhāvaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘idāni yasmā etesu piṭakesū’’"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo cetthā"
      },
      "ti etesu taṃtaṃpiṭakagatesu dhammādīsu yo paṭivedho, etesu ca piṭakesu tesaṃ tesaṃ dhammānaṃ yo aviparītasabhāvoti yojetabbaṃ. Dukkhogāhatā ca avijjāsaṅkhārādīnaṃ ",
      " dhammatthānaṃ duppaṭivijjhatāya, tesaṃ paññāpanassa dukkarabhāvato taṃdesanāya, paṭivedhanasaṅkhātassa paṭivedhassa uppādanavisayikaraṇānaṃ asakkuṇeyyattā, aviparītasabhāvasaṅkhātassa paṭivedhassa duviññeyyatāya eva veditabbā."
    ],
    "innerText": "Yathāvuttehi dhammādīhi piṭakānaṃ gambhīrabhāvaṃ dassetuṃ ‘‘idāni yasmā etesu piṭakesū’’tiādimāha. Yo cetthāti etesu taṃtaṃpiṭakagatesu dhammādīsu yo paṭivedho, etesu ca piṭakesu tesaṃ tesaṃ dhammānaṃ yo aviparītasabhāvoti yojetabbaṃ. Dukkhogāhatā ca avijjāsaṅkhārādīnaṃ dhammatthānaṃ duppaṭivijjhatāya, tesaṃ paññāpanassa dukkarabhāvato taṃdesanāya, paṭivedhanasaṅkhātassa paṭivedhassa uppādanavisayikaraṇānaṃ asakkuṇeyyattā, aviparītasabhāvasaṅkhātassa paṭivedhassa duviññeyyatāya eva veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ya"
      },
      "nti ",
      " yaṃ pariyattiduggahaṇaṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attha"
      },
      "nti bhāsitatthaṃ, payojanatthañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na upaparikkhantī"
      },
      "ti na vicārenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na nijjhānaṃ khamantī"
      },
      "ti nijjhānapaññaṃ nakkhamanti, nijjhāyitvā ",
      " paññāya disvā rocetvā gahetabbā na hontīti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itī"
      },
      "ti evaṃ etāya pariyattiyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vādappamokkhānisaṃsā"
      },
      " attano upari parehi āropitavādassa niggahassa pamokkhappayojanā hutvā dhammaṃ pariyāpuṇanti, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vādappamokkhā"
      },
      " vā nindāpamokkhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa catthāyā"
      },
      "ti yassa ca sīlādipūraṇassa anupādāvimokkhassa vā atthāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammaṃ pariyāpuṇanti"
      },
      " ñāyena pariyāpuṇantīti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assā"
      },
      "ti assa dhammassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānubhontī"
      },
      "ti na vindanti. Tesaṃ te dhammā duggahitattā upārambhamānadabbamakkhapalāsādihetubhāvena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dīgharattaṃ ahitāya dukkhāya saṃvattanti."
      },
      " Bhaṇḍāgāre niyutto bhaṇḍāgāriko, bhaṇḍāgāriko viya bhaṇḍāgāriko, dhammaratanānupālako. Aññatthaṃ anapekkhitvā bhaṇḍāgārikasseva sato pariyatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhaṇḍāgārikapariyatti."
      }
    ],
    "innerText": "Yanti yaṃ pariyattiduggahaṇaṃ sandhāya vuttaṃ. Atthanti bhāsitatthaṃ, payojanatthañca. Na upaparikkhantīti na vicārenti. Na nijjhānaṃ khamantīti nijjhānapaññaṃ nakkhamanti, nijjhāyitvā paññāya disvā rocetvā gahetabbā na hontīti adhippāyo. Itīti evaṃ etāya pariyattiyā. Vādappamokkhānisaṃsā attano upari parehi āropitavādassa niggahassa pamokkhappayojanā hutvā dhammaṃ pariyāpuṇanti, vādappamokkhā vā nindāpamokkhā. Yassa catthāyāti yassa ca sīlādipūraṇassa anupādāvimokkhassa vā atthāya dhammaṃ pariyāpuṇanti ñāyena pariyāpuṇantīti adhippāyo. Assāti assa dhammassa. Nānubhontīti na vindanti. Tesaṃ te dhammā duggahitattā upārambhamānadabbamakkhapalāsādihetubhāvena dīgharattaṃ ahitāya dukkhāya saṃvattanti. Bhaṇḍāgāre niyutto bhaṇḍāgāriko, bhaṇḍāgāriko viya bhaṇḍāgāriko, dhammaratanānupālako. Aññatthaṃ anapekkhitvā bhaṇḍāgārikasseva sato pariyatti bhaṇḍāgārikapariyatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Tāsaṃyevā’’"
      },
      "ti avadhāraṇaṃ pāpuṇitabbānaṃ chaḷabhiññācatuppaṭisambhidādīnaṃ vinaye pabhedavacanābhāvaṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Verañjakaṇḍe"
      },
      " (pārā. 12) hi tisso vijjāva vibhattā. Dutiye pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tāsaṃyevā’’"
      },
      "ti avadhāraṇaṃ catasso paṭisambhidā apekkhitvā kataṃ, na tisso vijjā. Tā hi chasu abhiññāsu antogadhāti sutte vibhattā yevāti."
    ],
    "innerText": "‘‘Tāsaṃyevā’’ti avadhāraṇaṃ pāpuṇitabbānaṃ chaḷabhiññācatuppaṭisambhidādīnaṃ vinaye pabhedavacanābhāvaṃ sandhāya vuttaṃ. Verañjakaṇḍe (pārā. 12) hi tisso vijjāva vibhattā. Dutiye pana ‘‘tāsaṃyevā’’ti avadhāraṇaṃ catasso paṭisambhidā apekkhitvā kataṃ, na tisso vijjā. Tā hi chasu abhiññāsu antogadhāti sutte vibhattā yevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duggahitaṃ gaṇhāti,"
      },
      " ‘‘tathāhaṃ bhagavatā dhammaṃ desitaṃ ājānāmi, yathā tadevidaṃ viññāṇaṃ sandhāvati saṃsarati anañña’’ntiādinā (ma. ni. 1.396). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammacinta"
      },
      "nti ",
      " dhammasabhāvavicāraṇaṃ, ‘‘cittuppādamatteneva dānaṃ hoti, sayameva cittaṃ attano ārammaṇaṃ hoti, sabbaṃ cittaṃ asabhāvadhammārammaṇa’’nti ca evamādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesa"
      },
      "nti tesaṃ piṭakānaṃ."
    ],
    "innerText": "Duggahitaṃ gaṇhāti, ‘‘tathāhaṃ bhagavatā dhammaṃ desitaṃ ājānāmi, yathā tadevidaṃ viññāṇaṃ sandhāvati saṃsarati anañña’’ntiādinā (ma. ni. 1.396). Dhammacintanti dhammasabhāvavicāraṇaṃ, ‘‘cittuppādamatteneva dānaṃ hoti, sayameva cittaṃ attano ārammaṇaṃ hoti, sabbaṃ cittaṃ asabhāvadhammārammaṇa’’nti ca evamādi. Tesanti tesaṃ piṭakānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eta"
      },
      "nti etaṃ buddhavacanaṃ. Atthānulomato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anulomiko. "
      },
      " Anulomikataṃyeva vibhāvetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kasmā panā’’"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekanikāyampī"
      },
      "ti ekasamūhampi ",
      ". Poṇikā cikkhallikā ca khattiyā, tesaṃ nivāso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "poṇikanikāyo cikkhallikanikāyo"
      },
      " ca."
    ],
    "innerText": "Etanti etaṃ buddhavacanaṃ. Atthānulomato anulomiko. Anulomikataṃyeva vibhāvetuṃ ‘‘kasmā panā’’tiādi vuttaṃ. Ekanikāyampīti ekasamūhampi . Poṇikā cikkhallikā ca khattiyā, tesaṃ nivāso poṇikanikāyo cikkhallikanikāyo ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navappabheda"
      },
      "nti ettha kathaṃ navappabhedaṃ? Sagāthakañhi suttaṃ geyyaṃ, niggāthakañca suttaṃ veyyākaraṇaṃ, tadubhayavinimuttañca suttaṃ udānādivisesasaññārahitaṃ natthi, yaṃ suttaṅgaṃ siyā, maṅgalasuttādīnañca (khu. pā. 5.2; su. ni. 225) suttaṅgasaṅgaho na siyā, gāthābhāvato, dhammapadādīnaṃ viya, geyyaṅgasaṅgaho vā siyā, sagāthakattā, sagāthavaggassa viya, tathā ubhatovibhaṅgādīsu sagāthakappadesānanti? Vuccate –"
    ],
    "innerText": "Navappabhedanti ettha kathaṃ navappabhedaṃ? Sagāthakañhi suttaṃ geyyaṃ, niggāthakañca suttaṃ veyyākaraṇaṃ, tadubhayavinimuttañca suttaṃ udānādivisesasaññārahitaṃ natthi, yaṃ suttaṅgaṃ siyā, maṅgalasuttādīnañca (khu. pā. 5.2; su. ni. 225) suttaṅgasaṅgaho na siyā, gāthābhāvato, dhammapadādīnaṃ viya, geyyaṅgasaṅgaho vā siyā, sagāthakattā, sagāthavaggassa viya, tathā ubhatovibhaṅgādīsu sagāthakappadesānanti? Vuccate –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Suttanti ",
      " sāmaññavidhi, visesavidhayo pare;"
    ],
    "innerText": "‘‘Suttanti sāmaññavidhi, visesavidhayo pare;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sanimittā niruḷhattā sahatāññena nāññato’’. (sārattha. ṭī. 1.paṭhamamahāsaṅgītikathāvaṇṇanā);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbassāpi hi buddhavacanassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suttanti"
      },
      " ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāmaññavidhi."
      },
      " Tenevāha āyasmā mahākaccāno nettiyaṃ – ‘‘navavidhasuttantapariyeṭṭhī’’ti (netti. saṅgahavāra). ‘‘Ettakaṃ tassa bhagavato suttāgataṃ suttapariyāpannaṃ (pāci. 255, 1242), sakavāde pañcasuttasatānī’’ti (dha. sa. aṭṭha. nidānakathā; kathā. aṭṭha. nidānakathā) evamādi ca etassa atthassa sādhakaṃ."
    ],
    "innerText": "Sabbassāpi hi buddhavacanassa suttanti ayaṃ sāmaññavidhi. Tenevāha āyasmā mahākaccāno nettiyaṃ – ‘‘navavidhasuttantapariyeṭṭhī’’ti (netti. saṅgahavāra). ‘‘Ettakaṃ tassa bhagavato suttāgataṃ suttapariyāpannaṃ (pāci. 255, 1242), sakavāde pañcasuttasatānī’’ti (dha. sa. aṭṭha. nidānakathā; kathā. aṭṭha. nidānakathā) evamādi ca etassa atthassa sādhakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visesavidhayo"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pare sanimittā"
      },
      " tadekadesesu geyyādayo visesavidhayo tena tena nimittena patiṭṭhitā. Tathā hi geyyassa sagāthakattaṃ tabbhāvanimittaṃ. Lokepi hi sasilokaṃ sagāthakaṃ (netti. aṭṭha. 13) cuṇṇiyaganthaṃ ‘geyya’nti vadanti. Gāthāvirahe pana sati pucchaṃ katvā vissajjanabhāvo veyyākaraṇassa tabbhāvanimittaṃ. Pucchāvissajjanañhi ‘byākaraṇa’nti vuccati, byākaraṇameva veyyākaraṇaṃ. Evaṃ sante sagāthakādīnampi pucchaṃ katvā vissajjanavasena pavattānaṃ veyyākaraṇabhāvo āpajjatīti? Nāpajjati, geyyādisaññānaṃ anokāsabhāvato, ‘gāthāvirahe satī’ti visesitattā ca. Tathā hi dhammapadādīsu kevalaṃ gāthābandhesu, sagāthakattepi somanassañāṇamayikagāthāyuttesu, ‘vuttañheta’ntiādivacanasambandhesu, abbhutadhammapaṭisaṃyuttesu ca suttavisesesu yathākkamaṃ gāthāudānaitivuttakaabbhutadhammasaññā patiṭṭhitā, tathā satipi ",
      " gāthābandhabhāve bhagavato atītāsu jātīsu cariyānubhāvappakāsakesu jātakasaññā, satipi pañhāvissajjanabhāve, sagāthakatte ca kesuci suttantesu vedassa labhāpanato vedallasaññā patiṭṭhitāti evaṃ tena tena sagāthakattādinā nimittena tesu tesu suttavisesesu geyyādisaññā patiṭṭhitāti visesavidhayo suttaṅgato pare geyyādayo. Yaṃ panettha geyyaṅgādinimittarahitaṃ, taṃ suttaṅgaṃ visesasaññāparihārena sāmaññasaññāya pavattanatoti. Nanu ca sagāthakaṃ suttaṃ geyyaṃ, niggāthakaṃ suttaṃ veyyākaraṇanti suttaṅgaṃ na sambhavatīti codanā tadavatthā vāti? Na tadavatthā, sodhitattā. Sodhitañhi pubbe gāthāvirahe sati pucchāvissajjanabhāvo veyyākaraṇassa tabbhāvanimittanti."
    ],
    "innerText": "Visesavidhayopare sanimittā tadekadesesu geyyādayo visesavidhayo tena tena nimittena patiṭṭhitā. Tathā hi geyyassa sagāthakattaṃ tabbhāvanimittaṃ. Lokepi hi sasilokaṃ sagāthakaṃ (netti. aṭṭha. 13) cuṇṇiyaganthaṃ ‘geyya’nti vadanti. Gāthāvirahe pana sati pucchaṃ katvā vissajjanabhāvo veyyākaraṇassa tabbhāvanimittaṃ. Pucchāvissajjanañhi ‘byākaraṇa’nti vuccati, byākaraṇameva veyyākaraṇaṃ. Evaṃ sante sagāthakādīnampi pucchaṃ katvā vissajjanavasena pavattānaṃ veyyākaraṇabhāvo āpajjatīti? Nāpajjati, geyyādisaññānaṃ anokāsabhāvato, ‘gāthāvirahe satī’ti visesitattā ca. Tathā hi dhammapadādīsu kevalaṃ gāthābandhesu, sagāthakattepi somanassañāṇamayikagāthāyuttesu, ‘vuttañheta’ntiādivacanasambandhesu, abbhutadhammapaṭisaṃyuttesu ca suttavisesesu yathākkamaṃ gāthāudānaitivuttakaabbhutadhammasaññā patiṭṭhitā, tathā satipi gāthābandhabhāve bhagavato atītāsu jātīsu cariyānubhāvappakāsakesu jātakasaññā, satipi pañhāvissajjanabhāve, sagāthakatte ca kesuci suttantesu vedassa labhāpanato vedallasaññā patiṭṭhitāti evaṃ tena tena sagāthakattādinā nimittena tesu tesu suttavisesesu geyyādisaññā patiṭṭhitāti visesavidhayo suttaṅgato pare geyyādayo. Yaṃ panettha geyyaṅgādinimittarahitaṃ, taṃ suttaṅgaṃ visesasaññāparihārena sāmaññasaññāya pavattanatoti. Nanu ca sagāthakaṃ suttaṃ geyyaṃ, niggāthakaṃ suttaṃ veyyākaraṇanti suttaṅgaṃ na sambhavatīti codanā tadavatthā vāti? Na tadavatthā, sodhitattā. Sodhitañhi pubbe gāthāvirahe sati pucchāvissajjanabhāvo veyyākaraṇassa tabbhāvanimittanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yañca vuttaṃ – ‘‘gāthābhāvato maṅgalasuttādīnaṃ (khu. pā. 5.1, 2, 3) suttaṅgasaṅgaho ",
      " na siyā’’ti, taṃ na, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niruḷhattā. "
      },
      " Niruḷho hi maṅgalasuttādīnaṃ suttabhāvo. Na hi tāni dhammapadabuddhavaṃsādayo ",
      " viya gāthābhāvena paññātāni, atha kho suttabhāvena. Teneva hi aṭṭhakathāyaṃ ‘‘suttanāmaka’’nti nāmaggahaṇaṃ kataṃ. Yañca pana vuttaṃ – ‘‘sagāthakattā geyyaṅgasaṅgaho siyā’’ti, tadapi natthi, yasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahatāññena."
      },
      " Saha gāthāhīti hi sagāthakaṃ. Sahabhāvo nāma atthato aññena hoti, na ca maṅgalasuttādīsu kathāvinimutto koci suttapadeso atthi, yo ‘saha gāthāhī’ti vucceyya, na ca samudāyo nāma koci atthi, yadapi vuttaṃ – ‘‘ubhatovibhaṅgādīsu sagāthakappadesānaṃ geyyaṅgasaṅgaho siyā’’ti tadapi na, aññato. Aññā eva hi tā gāthā jātakādipariyāpannattā. Ato na tāhi ubhatovibhaṅgādīnaṃ geyyaṅgabhāvoti. Evaṃ suttādīnaṃ aṅgānaṃ aññamaññasaṅkarābhāvo veditabbo."
    ],
    "innerText": "Yañca vuttaṃ – ‘‘gāthābhāvato maṅgalasuttādīnaṃ (khu. pā. 5.1, 2, 3) suttaṅgasaṅgaho na siyā’’ti, taṃ na, niruḷhattā. Niruḷho hi maṅgalasuttādīnaṃ suttabhāvo. Na hi tāni dhammapadabuddhavaṃsādayo viya gāthābhāvena paññātāni, atha kho suttabhāvena. Teneva hi aṭṭhakathāyaṃ ‘‘suttanāmaka’’nti nāmaggahaṇaṃ kataṃ. Yañca pana vuttaṃ – ‘‘sagāthakattā geyyaṅgasaṅgaho siyā’’ti, tadapi natthi, yasmā sahatāññena. Saha gāthāhīti hi sagāthakaṃ. Sahabhāvo nāma atthato aññena hoti, na ca maṅgalasuttādīsu kathāvinimutto koci suttapadeso atthi, yo ‘saha gāthāhī’ti vucceyya, na ca samudāyo nāma koci atthi, yadapi vuttaṃ – ‘‘ubhatovibhaṅgādīsu sagāthakappadesānaṃ geyyaṅgasaṅgaho siyā’’ti tadapi na, aññato. Aññā eva hi tā gāthā jātakādipariyāpannattā. Ato na tāhi ubhatovibhaṅgādīnaṃ geyyaṅgabhāvoti. Evaṃ suttādīnaṃ aṅgānaṃ aññamaññasaṅkarābhāvo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ayaṃ dhammo…pe… ayaṃ vinayo, imāni caturāsīti dhammakkhandhasahassānī’’ti buddhavacanaṃ dhammavinayādibhedena vavatthapetvā saṅgāyantena mahākassapappamukhena vasigaṇena anekacchariyapātubhāvapaṭimaṇḍitāya saṅgītiyā imassa dīghāgamassa paṭhamamajjhimabuddhavacanādibhāvo vavatthāpitoti dasseti, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evametaṃ abhedato’’"
      },
      "tiādinā."
    ],
    "innerText": "‘‘Ayaṃ dhammo…pe… ayaṃ vinayo, imāni caturāsīti dhammakkhandhasahassānī’’ti buddhavacanaṃ dhammavinayādibhedena vavatthapetvā saṅgāyantena mahākassapappamukhena vasigaṇena anekacchariyapātubhāvapaṭimaṇḍitāya saṅgītiyā imassa dīghāgamassa paṭhamamajjhimabuddhavacanādibhāvo vavatthāpitoti dasseti, ‘‘evametaṃ abhedato’’tiādinā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nidānakathāvaṇṇanā niṭṭhitā."
  }
]