[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "4. Mahāsudassanasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Kusāvatīrājadhānīvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "241"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti mahāsudassanasuttaṃ. Tatrāyaṃ apubbapadavaṇṇanā – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbaratanamayo"
      },
      "ti ettha ekā iṭṭhakā sovaṇṇamayā, ekā rūpiyamayā, ekā veḷuriyamayā, ekā phalikamayā, ekā lohitaṅkamayā, ekā masāragallamayā, ekā sabbaratanamayā, ayaṃ pākāro sabbapākārānaṃ anto ubbedhena saṭṭhihattho ahosi. Eke pana therā – ‘‘nagaraṃ nāma anto ṭhatvā olokentānaṃ dassanīyaṃ vaṭṭati, tasmā sabbabāhiro saṭṭhihattho, sesā anupubbanīcā’’ti vadanti. Eke – ‘‘bahi ṭhatvā olokentānaṃ dassanīyaṃ vaṭṭati, tasmā sabbaabbhantarimo saṭṭhihattho, sesā anupubbanīcā’’ti. Eke – ‘‘anto ca bahi ca ṭhatvā olokentānaṃ dassanīyaṃ vaṭṭati, tasmā majjhe pākāro saṭṭhihattho, anto ca bahi ca tayo tayo anupubbanīcā’’ti."
    ],
    "innerText": "241.Evaṃme sutanti mahāsudassanasuttaṃ. Tatrāyaṃ apubbapadavaṇṇanā – sabbaratanamayoti ettha ekā iṭṭhakā sovaṇṇamayā, ekā rūpiyamayā, ekā veḷuriyamayā, ekā phalikamayā, ekā lohitaṅkamayā, ekā masāragallamayā, ekā sabbaratanamayā, ayaṃ pākāro sabbapākārānaṃ anto ubbedhena saṭṭhihattho ahosi. Eke pana therā – ‘‘nagaraṃ nāma anto ṭhatvā olokentānaṃ dassanīyaṃ vaṭṭati, tasmā sabbabāhiro saṭṭhihattho, sesā anupubbanīcā’’ti vadanti. Eke – ‘‘bahi ṭhatvā olokentānaṃ dassanīyaṃ vaṭṭati, tasmā sabbaabbhantarimo saṭṭhihattho, sesā anupubbanīcā’’ti. Eke – ‘‘anto ca bahi ca ṭhatvā olokentānaṃ dassanīyaṃ vaṭṭati, tasmā majjhe pākāro saṭṭhihattho, anto ca bahi ca tayo tayo anupubbanīcā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Esikā"
      },
      "ti esikatthambho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiporisaṅgā"
      },
      "ti ekaṃ porisaṃ majjhimapurisassa attano hatthena pañcahatthaṃ, tena tiporisaparikkhepā pannarasahatthaparimāṇāti attho. Te pana kathaṃ ṭhitāti? Nagarassa bāhirapasse ekekaṃ mahādvārabāhaṃ nissāya ekeko, ekekaṃ khuddakadvārabāhaṃ nissāya ekeko, mahādvārakhuddakadvārānaṃ antarā tayo tayoti. Tālapantīsu sabbaratanamayānaṃ tālānaṃ ekaṃ sovaṇṇamayanti pākāre vuttalakkhaṇameva veditabbaṃ, paṇṇaphalesupi eseva nayo. Tā pana tālapantiyo asītihatthā ubbedhena, vippakiṇṇavāluke samatale bhūmibhāge pākārantare ekekā hutvā ṭhitā."
    ],
    "innerText": "Esikāti esikatthambho. Tiporisaṅgāti ekaṃ porisaṃ majjhimapurisassa attano hatthena pañcahatthaṃ, tena tiporisaparikkhepā pannarasahatthaparimāṇāti attho. Te pana kathaṃ ṭhitāti? Nagarassa bāhirapasse ekekaṃ mahādvārabāhaṃ nissāya ekeko, ekekaṃ khuddakadvārabāhaṃ nissāya ekeko, mahādvārakhuddakadvārānaṃ antarā tayo tayoti. Tālapantīsu sabbaratanamayānaṃ tālānaṃ ekaṃ sovaṇṇamayanti pākāre vuttalakkhaṇameva veditabbaṃ, paṇṇaphalesupi eseva nayo. Tā pana tālapantiyo asītihatthā ubbedhena, vippakiṇṇavāluke samatale bhūmibhāge pākārantare ekekā hutvā ṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaggū"
      },
      "ti cheko sundaro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rajanīyo"
      },
      "ti rañjetuṃ samattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khamanīyo"
      },
      "ti divasampi suyyamāno khamateva, na bībhaccheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Madanīyo"
      },
      "ti ",
      " mānamadapurisamadajanano. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcaṅgikassā"
      },
      "ti ātataṃ vitataṃ ātatavitataṃ ",
      " susiraṃ ghananti imehi pañcahaṅgehi samannāgatassa. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ātataṃ"
      },
      " nāma cammapariyonaddhesu bherīādīsu ekatalaṃ tūriyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitataṃ"
      },
      " nāma ubhayatalaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ātatavitataṃ"
      },
      " nāma sabbato pariyonaddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Susiraṃ"
      },
      " nāma vaṃsādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ghanaṃ"
      },
      " nāma sammādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvinītassā"
      },
      "ti ākaḍḍhanasithilakaraṇādīhi sumucchitassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suppaṭitāḷitassā"
      },
      "ti pamāṇe ṭhitabhāvajānanatthaṃ suṭṭhu paṭitāḷitassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukusalehi samannāhatassā"
      },
      "ti ye vādituṃ chekā kusalā, tehi vāditassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhuttā"
      },
      "ti akkhadhuttā,. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Soṇḍā"
      },
      "ti surāsoṇḍā. Teyeva punappunaṃ pātukāmatāvasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pipāsā. Paricāresu"
      },
      "nti (dī. ni. 2.132) hatthaṃ vā pādaṃ vā cāletvā naccantā kīḷiṃsu."
    ],
    "innerText": "Vaggūti cheko sundaro. Rajanīyoti rañjetuṃ samattho. Khamanīyoti divasampi suyyamāno khamateva, na bībhaccheti. Madanīyoti mānamadapurisamadajanano. Pañcaṅgikassāti ātataṃ vitataṃ ātatavitataṃ susiraṃ ghananti imehi pañcahaṅgehi samannāgatassa. Tattha ātataṃ nāma cammapariyonaddhesu bherīādīsu ekatalaṃ tūriyaṃ. Vitataṃ nāma ubhayatalaṃ. Ātatavitataṃ nāma sabbato pariyonaddhaṃ. Susiraṃ nāma vaṃsādi. Ghanaṃ nāma sammādi. Suvinītassāti ākaḍḍhanasithilakaraṇādīhi sumucchitassa. Suppaṭitāḷitassāti pamāṇe ṭhitabhāvajānanatthaṃ suṭṭhu paṭitāḷitassa. Sukusalehi samannāhatassāti ye vādituṃ chekā kusalā, tehi vāditassa. Dhuttāti akkhadhuttā,. Soṇḍāti surāsoṇḍā. Teyeva punappunaṃ pātukāmatāvasena pipāsā. Paricāresunti (dī. ni. 2.132) hatthaṃ vā pādaṃ vā cāletvā naccantā kīḷiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Cakkaratanavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "243"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīsaṃ nhātassā"
      },
      "ti sīsena saddhiṃ gandhodakena nahātassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uposathikassā"
      },
      "ti samādinnauposathaṅgassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uparipāsādavaragatassā"
      },
      "ti pāsādavarassa upari gatassa, subhojanaṃ bhuñjitvā pāsādavarassa uparimahātale sirigabbhaṃ pavisitvā sīlāni āvajjantassa. Tadā kira rājā pātova satasahassaṃ vissajjetvā mahādānaṃ datvā soḷasahi gandhodakaghaṭehi sīsaṃ nahāyitvā katapātarāso suddhaṃ uttarāsaṅgaṃ ekaṃsaṃ karitvā uparipāsādassa sirisayane pallaṅkaṃ ābhujitvā nisinno attano dānādimayaṃ puññasamudāyaṃ āvajjanto nisīdi. Ayaṃ sabbacakkavattīnaṃ dhammatā."
    ],
    "innerText": "243.Sīsaṃ nhātassāti sīsena saddhiṃ gandhodakena nahātassa. Uposathikassāti samādinnauposathaṅgassa. Uparipāsādavaragatassāti pāsādavarassa upari gatassa, subhojanaṃ bhuñjitvā pāsādavarassa uparimahātale sirigabbhaṃ pavisitvā sīlāni āvajjantassa. Tadā kira rājā pātova satasahassaṃ vissajjetvā mahādānaṃ datvā soḷasahi gandhodakaghaṭehi sīsaṃ nahāyitvā katapātarāso suddhaṃ uttarāsaṅgaṃ ekaṃsaṃ karitvā uparipāsādassa sirisayane pallaṅkaṃ ābhujitvā nisinno attano dānādimayaṃ puññasamudāyaṃ āvajjanto nisīdi. Ayaṃ sabbacakkavattīnaṃ dhammatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesaṃ taṃ āvajjantānaṃyeva vuttappakārapuññakammapaccayautusamuṭṭhānaṃ nīlamaṇisaṅghātasadisaṃ pācīnasamuddajalatalaṃ bhindamānaṃ viya, ākāsaṃ alaṅkurumānaṃ viya dibbaṃ cakkaratanaṃ pātubhavati. Taṃ mahāsudassanassāpi tatheva pāturahosi. Tayidaṃ dibbānubhāvayuttattā dibbanti vuttaṃ. Sahassaṃ assa arānanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahassāraṃ."
      },
      " Saha nemiyā, saha nābhiyā cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sanemikaṃ sanābhikaṃ."
      },
      " Sabbehi ākārehi paripuṇṇanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbākāraparipūraṃ."
      }
    ],
    "innerText": "Tesaṃ taṃ āvajjantānaṃyeva vuttappakārapuññakammapaccayautusamuṭṭhānaṃ nīlamaṇisaṅghātasadisaṃ pācīnasamuddajalatalaṃ bhindamānaṃ viya, ākāsaṃ alaṅkurumānaṃ viya dibbaṃ cakkaratanaṃ pātubhavati. Taṃ mahāsudassanassāpi tatheva pāturahosi. Tayidaṃ dibbānubhāvayuttattā dibbanti vuttaṃ. Sahassaṃ assa arānanti sahassāraṃ. Saha nemiyā, saha nābhiyā cāti sanemikaṃ sanābhikaṃ. Sabbehi ākārehi paripuṇṇanti sabbākāraparipūraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha cakkañca taṃ ratijananaṭṭhena ratanañcāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkaratanaṃ."
      },
      " Yāya pana taṃ nābhiyā ‘‘sanābhika’’nti vuttaṃ, sā indanīlamayā hoti, majjhe panassā sārarajatamayā panāḷi, yāya ",
      " suddhasiniddhadantapantiyā hasamānā viya virocati, majjhe chiddena viya candamaṇḍalena, ubhosupi bāhirantesu rajatapaṭṭena kataparikkhepā hoti. Tesu panassa nābhipanāḷiparikkhepapaṭṭesu ",
      " yuttayuttaṭṭhānesu paricchedalekhā suvibhattāva hutvā paññāyanti. Ayaṃ tāva assa nābhiyā sabbākāraparipūratā."
    ],
    "innerText": "Tattha cakkañca taṃ ratijananaṭṭhena ratanañcāti cakkaratanaṃ. Yāya pana taṃ nābhiyā ‘‘sanābhika’’nti vuttaṃ, sā indanīlamayā hoti, majjhe panassā sārarajatamayā panāḷi, yāya suddhasiniddhadantapantiyā hasamānā viya virocati, majjhe chiddena viya candamaṇḍalena, ubhosupi bāhirantesu rajatapaṭṭena kataparikkhepā hoti. Tesu panassa nābhipanāḷiparikkhepapaṭṭesu yuttayuttaṭṭhānesu paricchedalekhā suvibhattāva hutvā paññāyanti. Ayaṃ tāva assa nābhiyā sabbākāraparipūratā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yehi ",
      " pana taṃ – ‘‘arehi sahassāra’’nti vuttaṃ, te sattaratanamayā sūriyarasmiyo viya pabhāsampannā honti, tesampi ghaṭakamaṇikaparicchedalekhādīni suvibhattāneva hutvā paññāyanti. Ayamassa arānaṃ sabbākāraparipūratā."
    ],
    "innerText": "Yehi pana taṃ – ‘‘arehi sahassāra’’nti vuttaṃ, te sattaratanamayā sūriyarasmiyo viya pabhāsampannā honti, tesampi ghaṭakamaṇikaparicchedalekhādīni suvibhattāneva hutvā paññāyanti. Ayamassa arānaṃ sabbākāraparipūratā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yāya pana taṃ nemiyā – ‘‘sanemika’’nti vuttaṃ, sā bālasūriyarasmikalāpasiriṃ avahasamānā viya surattasuddhasiniddhapavāḷamayā hoti. Sandhīsu panassā sañjhārāgasassirikā rattajambunadapaṭṭā vaṭṭaparicchedalekhā suvibhattā hutvā paññāyanti. Ayamassa nemiyā sabbākāraparipūratā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nemimaṇḍalapiṭṭhiyaṃ panassa dasannaṃ dasannaṃ arānaṃ antare dhamanavaṃso viya anto susiro chiddamaṇḍalakhacito vātagāhī pavāḷadaṇḍo hoti, yassa vāteritassa sukusalasamannāhatassa pañcaṅgikatūriyassa viya saddo vaggu ca rajanīyo ca kamanīyo ca madanīyo ca hoti. Tassa kho pana pavāḷadaṇḍassa upari setacchattaṃ ubhosu passesu samosaritakusumadāmānaṃ dve pantiyoti evaṃ samosaritakusumadāmapantisatadvayaparivārasetacchattasatadhārinā pavāḷadaṇḍasatena samupasobhitanemiparikkhepassa dvinnampi nābhipanāḷīnaṃ anto dve sīhamukhāni honti, yehi tālakkhandhappamāṇā puṇṇacandakiraṇakalāpasassirīkā taruṇaravisamānarattakambalageṇḍukapariyantā ākāsagaṅgāgatisobhaṃ avahasamānā viya dve muttakalāpā olambanti. Yehi cakkaratanena saddhiṃ ākāse samparivattamānehi tīṇi cakkāni ekato parivattantāni viya khāyanti. Ayamassa sabbaso sabbākāraparipūratā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Taṃ panetaṃ evaṃ sabbākāraparipūraṃ pakatiyā sāyamāsabhattaṃ bhuñjitvā attano attano gharadvāre paññattāsanesu nisīditvā pavattakathāsallāpesu manussesu vīthicatukkādīsu ",
      " kīḷamāne dārakajane nātiuccena nātinīcena vanasaṇḍamatthakāsannena ākāsappadesena upasobhayamānaṃ viya, rukkhasākhaggāni dvādasayojanato paṭṭhāya suyyamānena madhurassarena ",
      " sattānaṃ sotāni odhāpayamānaṃ yojanato paṭṭhāya nānappabhāsamudayasamujjalena vaṇṇena nayanāni samākaḍḍhantaṃ viya, rañño cakkavattissa puññānubhāvaṃ ugghosayantaṃ viya, rājadhāniyā abhimukhaṃ āgacchati."
    ],
    "innerText": "Taṃ panetaṃ evaṃ sabbākāraparipūraṃ pakatiyā sāyamāsabhattaṃ bhuñjitvā attano attano gharadvāre paññattāsanesu nisīditvā pavattakathāsallāpesu manussesu vīthicatukkādīsu kīḷamāne dārakajane nātiuccena nātinīcena vanasaṇḍamatthakāsannena ākāsappadesena upasobhayamānaṃ viya, rukkhasākhaggāni dvādasayojanato paṭṭhāya suyyamānena madhurassarena sattānaṃ sotāni odhāpayamānaṃ yojanato paṭṭhāya nānappabhāsamudayasamujjalena vaṇṇena nayanāni samākaḍḍhantaṃ viya, rañño cakkavattissa puññānubhāvaṃ ugghosayantaṃ viya, rājadhāniyā abhimukhaṃ āgacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassa cakkaratanassa saddasavaneneva – ‘‘kuto nu kho, kassa nu kho ayaṃ saddo’’ti āvajjitahadayānaṃ puratthimadisaṃ ālokayamānānaṃ tesaṃ manussānaṃ aññataro aññataraṃ evamāha ",
      " – ‘‘passatha, bho, acchariyaṃ, ayaṃ puṇṇacando pubbe eko uggacchati, ajjeva pana attadutiyo uggato, etañhi rājahaṃsamithunamiva puṇṇacandamithunaṃ pubbāpariyena gaganatalaṃ abhilaṅghatī’’ti. Tamañño āha – ‘‘kiṃ kathesi, samma, kuhiṃ nāma tayā dve puṇṇacandā ekato uggacchantā diṭṭhapubbā, nanu esa tapanīyaraṃsidhāro piñcharakiraṇo divākaro uggato’’ti, tamañño hasitaṃ katvā evamāha – ‘‘kiṃ ummattosi, nanu idāneva divākaro atthaṅgato, so kathaṃ imaṃ puṇṇacandaṃ anubandhamāno uggacchissati? Addhā panetaṃ anekaratanappabhāsamudayujjalaṃ ekassāpi puññavato vimānaṃ bhavissatī’’ti. Te sabbepi apasārayantā aññe evamāhaṃsu – ‘‘bho, kiṃ bahuṃ vilapatha, nevāyaṃ puṇṇacando, na sūriyo na devavimānaṃ. Na hetesaṃ evarūpā sirisampatti atthi, cakkaratanena pana etena bhavitabba’’nti."
    ],
    "innerText": "Athassa cakkaratanassa saddasavaneneva – ‘‘kuto nu kho, kassa nu kho ayaṃ saddo’’ti āvajjitahadayānaṃ puratthimadisaṃ ālokayamānānaṃ tesaṃ manussānaṃ aññataro aññataraṃ evamāha – ‘‘passatha, bho, acchariyaṃ, ayaṃ puṇṇacando pubbe eko uggacchati, ajjeva pana attadutiyo uggato, etañhi rājahaṃsamithunamiva puṇṇacandamithunaṃ pubbāpariyena gaganatalaṃ abhilaṅghatī’’ti. Tamañño āha – ‘‘kiṃ kathesi, samma, kuhiṃ nāma tayā dve puṇṇacandā ekato uggacchantā diṭṭhapubbā, nanu esa tapanīyaraṃsidhāro piñcharakiraṇo divākaro uggato’’ti, tamañño hasitaṃ katvā evamāha – ‘‘kiṃ ummattosi, nanu idāneva divākaro atthaṅgato, so kathaṃ imaṃ puṇṇacandaṃ anubandhamāno uggacchissati? Addhā panetaṃ anekaratanappabhāsamudayujjalaṃ ekassāpi puññavato vimānaṃ bhavissatī’’ti. Te sabbepi apasārayantā aññe evamāhaṃsu – ‘‘bho, kiṃ bahuṃ vilapatha, nevāyaṃ puṇṇacando, na sūriyo na devavimānaṃ. Na hetesaṃ evarūpā sirisampatti atthi, cakkaratanena pana etena bhavitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ pavattasallāpasseva tassa janassa candamaṇḍalaṃ ohāya taṃ cakkaratanaṃ abhimukhaṃ hoti. Tato tehi – ‘‘kassa nu kho idaṃ nibbatta’’nti vutte bhavanti vattāro – ‘‘na kassaci aññassa, nanu amhākaṃ mahārājā pūritacakkavattivatto, tassetaṃ nibbatta’’nti. Atha so ca mahājano, yo ca añño passati, sabbo cakkaratanameva anugacchati. Taṃ cāpi cakkaratanaṃ raññoyeva atthāya attano āgatabhāvaṃ ñāpetukāmaṃ viya sattakkhattuṃ pākāramatthakeneva ",
      " nagaraṃ anusaṃyāyitvā, atha rañño antepuraṃ padakkhiṇaṃ katvā, antepurassa ca uttarasīhapañjarasadise ṭhāne yathā gandhapupphādīhi sukhena sakkā hoti pūjetuṃ, evaṃ akkhāhataṃ viya tiṭṭhati."
    ],
    "innerText": "Evaṃ pavattasallāpasseva tassa janassa candamaṇḍalaṃ ohāya taṃ cakkaratanaṃ abhimukhaṃ hoti. Tato tehi – ‘‘kassa nu kho idaṃ nibbatta’’nti vutte bhavanti vattāro – ‘‘na kassaci aññassa, nanu amhākaṃ mahārājā pūritacakkavattivatto, tassetaṃ nibbatta’’nti. Atha so ca mahājano, yo ca añño passati, sabbo cakkaratanameva anugacchati. Taṃ cāpi cakkaratanaṃ raññoyeva atthāya attano āgatabhāvaṃ ñāpetukāmaṃ viya sattakkhattuṃ pākāramatthakeneva nagaraṃ anusaṃyāyitvā, atha rañño antepuraṃ padakkhiṇaṃ katvā, antepurassa ca uttarasīhapañjarasadise ṭhāne yathā gandhapupphādīhi sukhena sakkā hoti pūjetuṃ, evaṃ akkhāhataṃ viya tiṭṭhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ṭhitassa panassa vātapānachiddādīhi pavisitvā nānāvirāgaratanappabhāsamujjalaṃ antopāsādaṃ alaṅkurumānaṃ pabhāsamūhaṃ disvā dassanatthāya sañjātābhilāso ",
      " rājā hoti. Parijanopissa piyavacanapābhatena āgantvā tamatthaṃ nivedeti. Atha rājā balavapītipāmojjaphuṭasarīro pallaṅkaṃ mocetvā uṭṭhāyāsanā sīhapañjarasamīpaṃ gantvā taṃ cakkaratanaṃ disvā ‘‘sutaṃ kho pana meta’’ntiādikaṃ cintanaṃ cintayati. Mahāsudassanassāpi sabbaṃ taṃ tatheva ahosi. Tena vuttaṃ – ‘‘disvā rañño mahāsudassanassa…pe… assaṃ nu kho ahaṃ rājā cakkavattī’’ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "so hoti rājā cakkavattī"
      },
      "ti kittāvatā cakkavattī hotīti? Ekaṅguladvaṅgulamattampi cakkaratane ākāsaṃ abbhuggantvā pavatte idāni tassa pavattāpanatthaṃ yaṃ kātabbaṃ, taṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atha kho ānandā"
      },
      "tiādimāha."
    ],
    "innerText": "Evaṃ ṭhitassa panassa vātapānachiddādīhi pavisitvā nānāvirāgaratanappabhāsamujjalaṃ antopāsādaṃ alaṅkurumānaṃ pabhāsamūhaṃ disvā dassanatthāya sañjātābhilāso rājā hoti. Parijanopissa piyavacanapābhatena āgantvā tamatthaṃ nivedeti. Atha rājā balavapītipāmojjaphuṭasarīro pallaṅkaṃ mocetvā uṭṭhāyāsanā sīhapañjarasamīpaṃ gantvā taṃ cakkaratanaṃ disvā ‘‘sutaṃ kho pana meta’’ntiādikaṃ cintanaṃ cintayati. Mahāsudassanassāpi sabbaṃ taṃ tatheva ahosi. Tena vuttaṃ – ‘‘disvā rañño mahāsudassanassa…pe… assaṃ nu kho ahaṃ rājā cakkavattī’’ti. Tattha so hoti rājā cakkavattīti kittāvatā cakkavattī hotīti? Ekaṅguladvaṅgulamattampi cakkaratane ākāsaṃ abbhuggantvā pavatte idāni tassa pavattāpanatthaṃ yaṃ kātabbaṃ, taṃ dassento atha kho ānandātiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "244"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uṭṭhāyāsanā"
      },
      "ti nisinnāsanato uṭṭhahitvā cakkaratanasamīpaṃ āgantvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvaṇṇabhiṅkāraṃ gahetvā"
      },
      "ti hatthisoṇḍasadisapanāḷiṃ suvaṇṇabhiṅkāraṃ ukkhipitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anvadeva rājā mahāsudassano saddhiṃ caturaṅginiyā senāyā"
      },
      "ti sabbacakkavattīnañhi udakena abbhukkiritvā – ‘‘abhivijinātu bhavaṃ cakkaratana’’nti vacanasamanantarameva vehāsaṃ abbhuggantvā cakkaratanaṃ pavattati. Yassa pavatti samakālameva so rājā cakkavattī nāma hoti. Pavatte pana cakkaratane taṃ anubandhamānova rājā cakkavattiyānavaraṃ āruyha vehāsaṃ abbhuggacchati. Athassa chattacāmarādihattho parijano ceva antepurajano ca tato nānākārakañcukakavacādisannāhavibhūsitena vividhābharaṇappabhāsamujjalena samussitaddhajapaṭākapaṭimaṇḍitena attano attano balakāyena saddhiṃ uparājasenāpatipabhutayopi vehāsaṃ abbhuggantvā rājānameva parivārenti."
    ],
    "innerText": "244. Tattha uṭṭhāyāsanāti nisinnāsanato uṭṭhahitvā cakkaratanasamīpaṃ āgantvā. Suvaṇṇabhiṅkāraṃ gahetvāti hatthisoṇḍasadisapanāḷiṃ suvaṇṇabhiṅkāraṃ ukkhipitvā. Anvadeva rājā mahāsudassano saddhiṃ caturaṅginiyā senāyāti sabbacakkavattīnañhi udakena abbhukkiritvā – ‘‘abhivijinātu bhavaṃ cakkaratana’’nti vacanasamanantarameva vehāsaṃ abbhuggantvā cakkaratanaṃ pavattati. Yassa pavatti samakālameva so rājā cakkavattī nāma hoti. Pavatte pana cakkaratane taṃ anubandhamānova rājā cakkavattiyānavaraṃ āruyha vehāsaṃ abbhuggacchati. Athassa chattacāmarādihattho parijano ceva antepurajano ca tato nānākārakañcukakavacādisannāhavibhūsitena vividhābharaṇappabhāsamujjalena samussitaddhajapaṭākapaṭimaṇḍitena attano attano balakāyena saddhiṃ uparājasenāpatipabhutayopi vehāsaṃ abbhuggantvā rājānameva parivārenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rājayuttā pana janasaṅgahatthaṃ nagaravīthīsu bheriyo carāpenti – ‘‘tātā, amhākaṃ rañño cakkaratanaṃ nibbattaṃ, attano vibhavānurūpena maṇḍitapasādhikā sannipatathā’’ti. Mahājano ",
      " pana pakatiyā cakkaratanasaddeneva sabbakiccāni pahāya gandhapupphādīni ādāya sannipatitova sopi sabbo vehāsaṃ abbhuggantvā rājānameva parivāreti. Yassa yassa hi raññā saddhiṃ gantukāmatācittaṃ uppajjati, so so ākāsagatova hoti. Evaṃ dvādasayojanāyāmavitthārā parisā hoti. Tattha ekapurisopi chinnabhinnasarīro vā kiliṭṭhavattho vā ",
      " natthi. Suciparivāro hi rājā cakkavattī. Cakkavattiparisā nāma vijjādharapurisā viya ākāse gacchamānā indanīlamaṇitale vippakiṇṇaratanasadisā hoti. Mahāsudassanassāpi tatheva ahosi. Tena vuttaṃ – ‘‘anvadeva rājā mahāsudassano saddhiṃ caturaṅginiyā senāyā’’ti."
    ],
    "innerText": "Rājayuttā pana janasaṅgahatthaṃ nagaravīthīsu bheriyo carāpenti – ‘‘tātā, amhākaṃ rañño cakkaratanaṃ nibbattaṃ, attano vibhavānurūpena maṇḍitapasādhikā sannipatathā’’ti. Mahājano pana pakatiyā cakkaratanasaddeneva sabbakiccāni pahāya gandhapupphādīni ādāya sannipatitova sopi sabbo vehāsaṃ abbhuggantvā rājānameva parivāreti. Yassa yassa hi raññā saddhiṃ gantukāmatācittaṃ uppajjati, so so ākāsagatova hoti. Evaṃ dvādasayojanāyāmavitthārā parisā hoti. Tattha ekapurisopi chinnabhinnasarīro vā kiliṭṭhavattho vā natthi. Suciparivāro hi rājā cakkavattī. Cakkavattiparisā nāma vijjādharapurisā viya ākāse gacchamānā indanīlamaṇitale vippakiṇṇaratanasadisā hoti. Mahāsudassanassāpi tatheva ahosi. Tena vuttaṃ – ‘‘anvadeva rājā mahāsudassano saddhiṃ caturaṅginiyā senāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Taṃ pana cakkaratanaṃ rukkhaggānaṃ uparūpari nātiuccena nātinīcena gaganappadesena pavattati. Yathā rukkhānaṃ pupphaphalapallavehi atthikā, tāni sukhena gahetuṃ sakkonti. Yathā ca bhūmiyaṃ ṭhitā ‘‘esa rājā, esa uparājā, esa senāpatī’’ti sallakkhetuṃ sakkonti. Ṭhānādīsu ca iriyāpathesu yo yena icchati, so teneva gacchati. Cittakammādisippapasutā cettha attano attano kiccaṃ karontāyeva gacchanti. Yatheva hi bhūmiyaṃ, tathā tesaṃ sabbakiccāni ākāseva ijjhanti. Evaṃ cakkavattiparisaṃ gahetvā taṃ cakkaratanaṃ vāmapassena sineruṃ pahāya mahāsamuddassa uparibhāgena sattasahassayojanappamāṇaṃ pubbavidehaṃ gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yo vinibbedhena dvādasayojanāya, parikkhepato chattiṃsayojanāya parisāya sannivesakkhamo ",
      " sulabhāhārūpakaraṇo chāyudakasampanno sucisamatalo ramaṇīyo bhūmibhāgo, tassa uparibhāge taṃ cakkaratanaṃ akkhāhataṃ viya tiṭṭhati. Atha tena saññāṇena so mahājano otaritvā yathāruci nahānabhojanādīni sabbakiccāni karonto vāsaṃ kappeti. Mahāsudassanassāpi sabbaṃ tatheva ahosi. Tena vuttaṃ – ‘‘yasmiṃ kho panānanda, padese cakkaratanaṃ patiṭṭhāti, tattha so rājā mahāsudassano vāsaṃ upagacchi saddhiṃ caturaṅginiyā senāyā’’ti."
    ],
    "innerText": "Tattha yo vinibbedhena dvādasayojanāya, parikkhepato chattiṃsayojanāya parisāya sannivesakkhamo sulabhāhārūpakaraṇo chāyudakasampanno sucisamatalo ramaṇīyo bhūmibhāgo, tassa uparibhāge taṃ cakkaratanaṃ akkhāhataṃ viya tiṭṭhati. Atha tena saññāṇena so mahājano otaritvā yathāruci nahānabhojanādīni sabbakiccāni karonto vāsaṃ kappeti. Mahāsudassanassāpi sabbaṃ tatheva ahosi. Tena vuttaṃ – ‘‘yasmiṃ kho panānanda, padese cakkaratanaṃ patiṭṭhāti, tattha so rājā mahāsudassano vāsaṃ upagacchi saddhiṃ caturaṅginiyā senāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vāsaṃ upagate cakkavattimhi ye tattha rājāno, te ‘‘paracakkaṃ āgata’’nti sutvāpi na balakāyaṃ sannipātetvā yuddhasajjā honti. Cakkaratanassa hi uppattisamanantarameva natthi so satto nāma, yo paccatthikasaññāya taṃ rājānaṃ ārabbha ",
      " āvudhaṃ ukkhipituṃ visaheyya. Ayamānubhāvo cakkaratanassa."
    ],
    "innerText": "Evaṃ vāsaṃ upagate cakkavattimhi ye tattha rājāno, te ‘‘paracakkaṃ āgata’’nti sutvāpi na balakāyaṃ sannipātetvā yuddhasajjā honti. Cakkaratanassa hi uppattisamanantarameva natthi so satto nāma, yo paccatthikasaññāya taṃ rājānaṃ ārabbha āvudhaṃ ukkhipituṃ visaheyya. Ayamānubhāvo cakkaratanassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Cakkānubhāvena ",
      " hi tassa rañño,"
    ],
    "innerText": "Cakkānubhāvena hi tassa rañño,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Arī asesā damathaṃ upenti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arindamaṃ"
      },
      " nāma narādhipassa,"
    ],
    "innerText": "Arindamaṃ nāma narādhipassa,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Teneva taṃ vuccati tassa cakkanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmā sabbepi te rājāno attano attano rajjasirivibhavānurūpaṃ pābhataṃ gahetvā taṃ rājānaṃ upagamma onatasirā attano moḷimaṇippabhābhisekena tassa pādapūjaṃ karontā – ‘‘ehi kho, mahārājā’’tiādīhi vacanehi tassa kiṃkārapaṭisāvitaṃ āpajjanti. Mahāsudassanassāpi tatheva akaṃsu. Tena vuttaṃ – ‘‘ye kho, panānanda, puratthimāya disāya…pe… anusāsa, mahārājā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "svāgata"
      },
      "nti su āgataṃ. Ekasmiñhi āgate socanti, gate nandanti. Ekasmiṃ āgate nandanti, gate socanti, tādiso tvaṃ āgamananandano, gamanasocano. Tasmā tava āgamanaṃ suāgamananti vuttaṃ hoti. Evaṃ vutte pana rājā cakkavattī nāpi – ‘‘ettakaṃ nāma me anuvassaṃ baliṃ upakappethā’’ti vadati, nāpi aññassa bhogaṃ acchinditvā aññassa deti. Attano pana dhammarājabhāvassa anurūpāya paññāya pāṇātipātādīni upaparikkhitvā pemanīyena mañjunā sarena – ‘‘passatha tātā, pāṇātipāto nāmesa āsevito bhāvito bahulīkato nirayasaṃvattaniko hotī’’tiādinā nayena dhammaṃ desetvā ‘‘pāṇo na hantabbo’’tiādikaṃ ",
      " ovādaṃ deti. Mahāsudassanopi tatheva akāsi, tena vuttaṃ – ‘‘rājā mahāsudassano evamāha – ‘pāṇo na hantabbo…pe… yathābhuttañca bhuñjathā’ti’’. Kiṃ pana sabbepi rañño imaṃ ovādaṃ gaṇhantīti? Buddhassāpi tāva sabbe na gaṇhanti, rañño kiṃ gaṇhissantīti. Tasmā ye paṇḍitā vibhāvino, te gaṇhanti. Sabbe pana anuyantā bhavanti. Tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ye kho panānandā"
      },
      "tiādimāha."
    ],
    "innerText": "Tattha svāgatanti su āgataṃ. Ekasmiñhi āgate socanti, gate nandanti. Ekasmiṃ āgate nandanti, gate socanti, tādiso tvaṃ āgamananandano, gamanasocano. Tasmā tava āgamanaṃ suāgamananti vuttaṃ hoti. Evaṃ vutte pana rājā cakkavattī nāpi – ‘‘ettakaṃ nāma me anuvassaṃ baliṃ upakappethā’’ti vadati, nāpi aññassa bhogaṃ acchinditvā aññassa deti. Attano pana dhammarājabhāvassa anurūpāya paññāya pāṇātipātādīni upaparikkhitvā pemanīyena mañjunā sarena – ‘‘passatha tātā, pāṇātipāto nāmesa āsevito bhāvito bahulīkato nirayasaṃvattaniko hotī’’tiādinā nayena dhammaṃ desetvā ‘‘pāṇo na hantabbo’’tiādikaṃ ovādaṃ deti. Mahāsudassanopi tatheva akāsi, tena vuttaṃ – ‘‘rājā mahāsudassano evamāha – ‘pāṇo na hantabbo…pe… yathābhuttañca bhuñjathā’ti’’. Kiṃ pana sabbepi rañño imaṃ ovādaṃ gaṇhantīti? Buddhassāpi tāva sabbe na gaṇhanti, rañño kiṃ gaṇhissantīti. Tasmā ye paṇḍitā vibhāvino, te gaṇhanti. Sabbe pana anuyantā bhavanti. Tasmā ye kho panānandātiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha taṃ cakkaratanaṃ evaṃ pubbavidehavāsīnaṃ ovāde dinne katapātarāse cakkavattibalena vehāsaṃ abbhuggantvā puratthimasamuddaṃ ajjhogāhati. Yathā yathā ca taṃ ajjhogāhati, tathā tathā agadagandhaṃ ghāyitvā saṅkhittaphaṇo nāgarājā viya, saṅkhittaūmivipphāraṃ hutvā ogacchamānaṃ mahāsamuddasalilaṃ yojanamattaṃ ogantvā antosamudde veḷuriyabhitti viya tiṭṭhati. Taṅkhaṇaññeva ca tassa rañño puññasiriṃ daṭṭhukāmāni viya mahāsamuddatale vippakiṇṇāni ",
      " nānāratanāni tato tato āgantvā taṃ padesaṃ pūrayanti. Atha sā rājaparisā taṃ nānāratanaparipūraṃ mahāsamuddatalaṃ disvā yathāruci ucchaṅgādīhi ādiyati, yathāruci ādinnaratanāya pana parisāya taṃ cakkaratanaṃ paṭinivattati. Paṭinivattamāne ca tasmiṃ parisā aggato hoti, majjhe rājā, ante cakkaratanaṃ. Tampi jalanidhijalaṃ palobhiyamānamiva cakkaratanasiriyā, asahamānamiva ca tena viyogaṃ nemimaṇḍalapariyantaṃ abhihanantaṃ nirantarameva upagacchati. Evaṃ rājā cakkavattī puratthimamahāsamuddapariyantaṃ pubbavidehaṃ abhivijinitvā dakkhiṇasamuddapariyantaṃ jambudīpaṃ vijetukāmo cakkaratanadesitena maggena dakkhiṇasamuddābhimukho gacchati. Mahāsudassanopi tatheva agamāsi. Tena vuttaṃ – ‘‘atha kho, ānanda, cakkaratanaṃ puratthimaṃ samuddaṃ ajjhogāhetvā paccuttaritvā dakkhiṇaṃ disaṃ pavattī’’ti."
    ],
    "innerText": "Atha taṃ cakkaratanaṃ evaṃ pubbavidehavāsīnaṃ ovāde dinne katapātarāse cakkavattibalena vehāsaṃ abbhuggantvā puratthimasamuddaṃ ajjhogāhati. Yathā yathā ca taṃ ajjhogāhati, tathā tathā agadagandhaṃ ghāyitvā saṅkhittaphaṇo nāgarājā viya, saṅkhittaūmivipphāraṃ hutvā ogacchamānaṃ mahāsamuddasalilaṃ yojanamattaṃ ogantvā antosamudde veḷuriyabhitti viya tiṭṭhati. Taṅkhaṇaññeva ca tassa rañño puññasiriṃ daṭṭhukāmāni viya mahāsamuddatale vippakiṇṇāni nānāratanāni tato tato āgantvā taṃ padesaṃ pūrayanti. Atha sā rājaparisā taṃ nānāratanaparipūraṃ mahāsamuddatalaṃ disvā yathāruci ucchaṅgādīhi ādiyati, yathāruci ādinnaratanāya pana parisāya taṃ cakkaratanaṃ paṭinivattati. Paṭinivattamāne ca tasmiṃ parisā aggato hoti, majjhe rājā, ante cakkaratanaṃ. Tampi jalanidhijalaṃ palobhiyamānamiva cakkaratanasiriyā, asahamānamiva ca tena viyogaṃ nemimaṇḍalapariyantaṃ abhihanantaṃ nirantarameva upagacchati. Evaṃ rājā cakkavattī puratthimamahāsamuddapariyantaṃ pubbavidehaṃ abhivijinitvā dakkhiṇasamuddapariyantaṃ jambudīpaṃ vijetukāmo cakkaratanadesitena maggena dakkhiṇasamuddābhimukho gacchati. Mahāsudassanopi tatheva agamāsi. Tena vuttaṃ – ‘‘atha kho, ānanda, cakkaratanaṃ puratthimaṃ samuddaṃ ajjhogāhetvā paccuttaritvā dakkhiṇaṃ disaṃ pavattī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ pavattamānassa pana tassa pavattanavidhānaṃ, senāsanniveso, paṭirājāgamanaṃ, tesaṃ anusāsanippadānaṃ dakkhiṇasamuddaajjhogāhanaṃ samuddasalilassa ogacchamānaṃ ratanānaṃ ādānanti sabbaṃ purimanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vijinitvā pana taṃ dasasahassayojanappamāṇaṃ jambudīpaṃ dakkhiṇasamuddatopi paccuttaritvā sattayojanasahassappamāṇaṃ aparagoyānaṃ vijetuṃ pubbe vuttanayeneva gantvā tampi samuddapariyantaṃ tatheva abhivijinitvā pacchimasamuddatopi uttaritvā aṭṭhayojanasahassappamāṇaṃ uttarakuruṃ vijetuṃ tatheva gantvā tampi samuddapariyantaṃ tatheva abhivijiya uttarasamuddato paccuttarati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā ",
      " raññā cakkavattinā cāturantāya pathaviyā ādhipaccaṃ adhigataṃ hoti. So evaṃ vijitavijayo attano rajjasirisampattidassanatthaṃ sapariso uddhaṃ gaganatalaṃ abhilaṅghitvā suvikasitapadumakumudapuṇḍarīkavanavicitte cattāro jātassare viya pañcasatapañcasataparittadīpaparivāre cattāro mahādīpe oloketvā cakkaratanadesiteneva maggena ",
      " yathānukkamaṃ attano rājadhāniṃ paccāgacchati. Atha taṃ cakkaratanaṃ antepuradvāraṃ sobhayamānaṃ viya hutvā tiṭṭhati."
    ],
    "innerText": "Ettāvatā raññā cakkavattinā cāturantāya pathaviyā ādhipaccaṃ adhigataṃ hoti. So evaṃ vijitavijayo attano rajjasirisampattidassanatthaṃ sapariso uddhaṃ gaganatalaṃ abhilaṅghitvā suvikasitapadumakumudapuṇḍarīkavanavicitte cattāro jātassare viya pañcasatapañcasataparittadīpaparivāre cattāro mahādīpe oloketvā cakkaratanadesiteneva maggena yathānukkamaṃ attano rājadhāniṃ paccāgacchati. Atha taṃ cakkaratanaṃ antepuradvāraṃ sobhayamānaṃ viya hutvā tiṭṭhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ patiṭṭhite pana tasmiṃ cakkaratane rājantepure ukkāhi vā dīpikāhi vā kiñci ",
      " karaṇīyaṃ na hoti, cakkaratanobhāsoyeva rattiṃ andhakāraṃ vidhamatiyeva. Ye pana andhakāratthikā honti, tesaṃ andhakārameva hoti. Mahāsudassanassāpi sabbametaṃ tatheva ahosi. Tena vuttaṃ – ‘‘dakkhiṇaṃ samuddaṃ ajjhogāhetvā…pe… evarūpaṃ cakkaratanaṃ pāturahosī’’ti."
    ],
    "innerText": "Evaṃ patiṭṭhite pana tasmiṃ cakkaratane rājantepure ukkāhi vā dīpikāhi vā kiñci karaṇīyaṃ na hoti, cakkaratanobhāsoyeva rattiṃ andhakāraṃ vidhamatiyeva. Ye pana andhakāratthikā honti, tesaṃ andhakārameva hoti. Mahāsudassanassāpi sabbametaṃ tatheva ahosi. Tena vuttaṃ – ‘‘dakkhiṇaṃ samuddaṃ ajjhogāhetvā…pe… evarūpaṃ cakkaratanaṃ pāturahosī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hatthiratanavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "246"
      },
      ". Evaṃ pātubhūtacakkaratanasseva cakkavattino amaccā pakatimaṅgalahatthiṭṭhānaṃ samaṃ sucibhūmibhāgaṃ kāretvā haricandanādīhi surabhigandhehi upalimpāpetvā heṭṭhā vicittavaṇṇasurabhikusumasamokiṇṇaṃ upari suvaṇṇatārakānaṃ antarantarā samosaritamanuññakusumadāmapaṭimaṇḍitavitānaṃ devavimānaṃ viya abhisaṅkharitvā – ‘‘evarūpassa nāma deva hatthiratanassa āgamanaṃ cintethā’’ti vadanti. So pubbe vuttanayeneva mahādānaṃ datvā sīlāni ca samādāya taṃ puññasampattiṃ āvajjanto nisīdi. Athassa puññānubhāvacodito chaddantakulā vā uposathakulā vā taṃ sakkāravisesaṃ anubhavitukāmo taruṇaravimaṇḍalābhirattacaraṇagīvāmukhapaṭimaṇḍitavisuddhasetasarīro sattapatiṭṭho susaṇṭhitaaṅgapaccaṅgasanniveso vikasitarattapadumacārupokkharo iddhimā yogī viya vehāsagamanasamattho manosilācuṇṇarañjitapariyanto viya rajatapabbato hatthiseṭṭho āgantvā tasmiṃ padese tiṭṭhati. So chaddantakulā āgacchanto sabbakaniṭṭho āgacchati. Uposathakulā āgacchanto sabbajeṭṭho. Pāḷiyaṃ pana uposatho nāgarājā icceva āgataṃ. Nāgarājā nāma kassaci aparibhogo, sabbakaniṭṭho āgacchatīti aṭṭhakathāsu vuttaṃ. Svāyaṃ pūritacakkavattivattānaṃ cakkavattīnaṃ vuttanayeneva cintayantānaṃ āgacchati. Mahāsudassanassa pana sayameva pakatimaṅgalahatthiṭṭhānaṃ āgantvā taṃ hatthiṃ apanetvā tattha aṭṭhāsi. Tena vuttaṃ – ‘‘puna caparaṃ ānanda…pe… nāgarājā’’ti."
    ],
    "innerText": "246. Evaṃ pātubhūtacakkaratanasseva cakkavattino amaccā pakatimaṅgalahatthiṭṭhānaṃ samaṃ sucibhūmibhāgaṃ kāretvā haricandanādīhi surabhigandhehi upalimpāpetvā heṭṭhā vicittavaṇṇasurabhikusumasamokiṇṇaṃ upari suvaṇṇatārakānaṃ antarantarā samosaritamanuññakusumadāmapaṭimaṇḍitavitānaṃ devavimānaṃ viya abhisaṅkharitvā – ‘‘evarūpassa nāma deva hatthiratanassa āgamanaṃ cintethā’’ti vadanti. So pubbe vuttanayeneva mahādānaṃ datvā sīlāni ca samādāya taṃ puññasampattiṃ āvajjanto nisīdi. Athassa puññānubhāvacodito chaddantakulā vā uposathakulā vā taṃ sakkāravisesaṃ anubhavitukāmo taruṇaravimaṇḍalābhirattacaraṇagīvāmukhapaṭimaṇḍitavisuddhasetasarīro sattapatiṭṭho susaṇṭhitaaṅgapaccaṅgasanniveso vikasitarattapadumacārupokkharo iddhimā yogī viya vehāsagamanasamattho manosilācuṇṇarañjitapariyanto viya rajatapabbato hatthiseṭṭho āgantvā tasmiṃ padese tiṭṭhati. So chaddantakulā āgacchanto sabbakaniṭṭho āgacchati. Uposathakulā āgacchanto sabbajeṭṭho. Pāḷiyaṃ pana uposatho nāgarājā icceva āgataṃ. Nāgarājā nāma kassaci aparibhogo, sabbakaniṭṭho āgacchatīti aṭṭhakathāsu vuttaṃ. Svāyaṃ pūritacakkavattivattānaṃ cakkavattīnaṃ vuttanayeneva cintayantānaṃ āgacchati. Mahāsudassanassa pana sayameva pakatimaṅgalahatthiṭṭhānaṃ āgantvā taṃ hatthiṃ apanetvā tattha aṭṭhāsi. Tena vuttaṃ – ‘‘puna caparaṃ ānanda…pe… nāgarājā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " pātubhūtaṃ pana taṃ hatthiratanaṃ disvā hatthigopakādayo haṭṭhatuṭṭhā vegena gantvā rañño ārocenti. Rājā turitaturito āgantvā taṃ disvā pasannacitto – ‘‘bhaddakaṃ vata bho hatthiyānaṃ, sace damathaṃ upeyyā’’ti cintayanto hatthaṃ ",
      " pasāreti. Atha so gharadhenuvacchako viya kaṇṇe olambitvā sūratabhāvaṃ dassento rājānaṃ upasaṅkamati. Rājā taṃ ārohitukāmo hoti. Athassa parijanā adhippāyaṃ ñatvā taṃ hatthiratanaṃ suvaṇṇaddhajaṃ suvaṇṇālaṅkāraṃ hemajālapaṭicchannaṃ katvā upanenti. Rājā taṃ anisīdāpetvāva sattaratanamayāya nisseṇiyā āruyha ākāsagamananinnacitto hoti. Tassa saha cittuppādeneva so nāgarājā rājahaṃso viya indanīlamaṇippabhājālaṃ nīlagaganatalaṃ abhilaṅghati. Tato cakkacārikāya vuttanayeneva sakalarājaparisā. Iti sapariso rājā antopātarāseyeva sakalapathaviṃ anusaṃyāyitvā rājadhāniṃ paccāgacchati. Evaṃ mahiddhikaṃ cakkavattino hatthiratanaṃ hoti. Mahāsudassanassāpi tādisameva ahosi. Tena vuttaṃ – ‘‘disvā rañño…pe… pāturahosī’’ti."
    ],
    "innerText": "Evaṃ pātubhūtaṃ pana taṃ hatthiratanaṃ disvā hatthigopakādayo haṭṭhatuṭṭhā vegena gantvā rañño ārocenti. Rājā turitaturito āgantvā taṃ disvā pasannacitto – ‘‘bhaddakaṃ vata bho hatthiyānaṃ, sace damathaṃ upeyyā’’ti cintayanto hatthaṃ pasāreti. Atha so gharadhenuvacchako viya kaṇṇe olambitvā sūratabhāvaṃ dassento rājānaṃ upasaṅkamati. Rājā taṃ ārohitukāmo hoti. Athassa parijanā adhippāyaṃ ñatvā taṃ hatthiratanaṃ suvaṇṇaddhajaṃ suvaṇṇālaṅkāraṃ hemajālapaṭicchannaṃ katvā upanenti. Rājā taṃ anisīdāpetvāva sattaratanamayāya nisseṇiyā āruyha ākāsagamananinnacitto hoti. Tassa saha cittuppādeneva so nāgarājā rājahaṃso viya indanīlamaṇippabhājālaṃ nīlagaganatalaṃ abhilaṅghati. Tato cakkacārikāya vuttanayeneva sakalarājaparisā. Iti sapariso rājā antopātarāseyeva sakalapathaviṃ anusaṃyāyitvā rājadhāniṃ paccāgacchati. Evaṃ mahiddhikaṃ cakkavattino hatthiratanaṃ hoti. Mahāsudassanassāpi tādisameva ahosi. Tena vuttaṃ – ‘‘disvā rañño…pe… pāturahosī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Assaratanavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "247"
      },
      ". Evaṃ pātubhūtahatthiratanassa pana cakkavattino amaccā pakatimaṅgalaassaṭṭhānaṃ sucisamatalaṃ kāretvā alaṅkaritvā ca purimanayeneva rañño tassa āgamanacintanatthaṃ ussāhaṃ janenti. So purimanayeneva katadānamānanasakkāro samādinnasīlabbato pāsādatale sukhanisinno puññasampattiṃ samanussarati. Athassa puññānubhāvacodito sindhavakulato vijjulatāvinaddhasaradakālasetavalāhakarāsisassirīko rattapādo rattatuṇḍo candappabhāpuñjasadisasuddhasiniddhaghanasaṃhatasarīro kākagīvā viya indanīlamaṇi viya ca kāḷavaṇṇena sīsena samannāgatattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāḷasīso"
      },
      "ti suṭṭhu kappetvā ṭhapitehi viya muñjasadisehi saṇhavaṭṭaujugatehi kesehi samannāgatattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "muñjakeso"
      },
      " vehāsaṅgamo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "valāhako nāma assarājā"
      },
      " āgantvā tasmiṃ ṭhāne patiṭṭhāti. Mahāsudassanassa panesa hatthiratanaṃ viya āgato. Sesaṃ sabbaṃ hatthiratane ",
      " vuttanayeneva veditabbaṃ. Evarūpaṃ assaratanaṃ sandhāya bhagavā – ‘‘puna ca para’’ntiādimāha."
    ],
    "innerText": "247. Evaṃ pātubhūtahatthiratanassa pana cakkavattino amaccā pakatimaṅgalaassaṭṭhānaṃ sucisamatalaṃ kāretvā alaṅkaritvā ca purimanayeneva rañño tassa āgamanacintanatthaṃ ussāhaṃ janenti. So purimanayeneva katadānamānanasakkāro samādinnasīlabbato pāsādatale sukhanisinno puññasampattiṃ samanussarati. Athassa puññānubhāvacodito sindhavakulato vijjulatāvinaddhasaradakālasetavalāhakarāsisassirīko rattapādo rattatuṇḍo candappabhāpuñjasadisasuddhasiniddhaghanasaṃhatasarīro kākagīvā viya indanīlamaṇi viya ca kāḷavaṇṇena sīsena samannāgatattā kāḷasīsoti suṭṭhu kappetvā ṭhapitehi viya muñjasadisehi saṇhavaṭṭaujugatehi kesehi samannāgatattā muñjakeso vehāsaṅgamo valāhako nāma assarājā āgantvā tasmiṃ ṭhāne patiṭṭhāti. Mahāsudassanassa panesa hatthiratanaṃ viya āgato. Sesaṃ sabbaṃ hatthiratane vuttanayeneva veditabbaṃ. Evarūpaṃ assaratanaṃ sandhāya bhagavā – ‘‘puna ca para’’ntiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Maṇiratanavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "248"
      },
      ". Evaṃ pātubhūtaassaratanassa pana rañño cakkavattino catuhatthāyāmaṃ sakaṭanābhisamapariṇāhaṃ ubhosu antesu kaṇṇikapariyantato viniggatehi suparisuddhamuttākalāpehi dvīhi kañcanapadumehi alaṅkataṃ caturāsītimaṇisahassaparivāraṃ tārāgaṇaparivutassa ",
      " puṇṇacandasassiriṃ pharamānaṃ ",
      " viya vepullapabbatato maṇiratanaṃ āgacchati. Tassevaṃ āgatassa muttājālake ṭhapetvā veḷuparamparāya saṭṭhihatthappamāṇaṃ ākāsaṃ āropitassa rattibhāge samantā yojanappamāṇaṃ okāsaṃ ābhā pharati, yāya sabbo so okāso aruṇuggamanavelā viya sañjātāloko hoti. Tato kassakā kasikammaṃ vāṇijā āpaṇugghāṭanaṃ te te sippino taṃ taṃ kammantaṃ payojenti ‘‘divā’’ti maññamānā. Mahāsudassanassāpi sabbaṃ taṃ tatheva ahosi. Tena vuttaṃ – ‘‘puna ca paraṃ ānanda,…pe… maṇiratanaṃ pāturahosī’’ti."
    ],
    "innerText": "248. Evaṃ pātubhūtaassaratanassa pana rañño cakkavattino catuhatthāyāmaṃ sakaṭanābhisamapariṇāhaṃ ubhosu antesu kaṇṇikapariyantato viniggatehi suparisuddhamuttākalāpehi dvīhi kañcanapadumehi alaṅkataṃ caturāsītimaṇisahassaparivāraṃ tārāgaṇaparivutassa puṇṇacandasassiriṃ pharamānaṃ viya vepullapabbatato maṇiratanaṃ āgacchati. Tassevaṃ āgatassa muttājālake ṭhapetvā veḷuparamparāya saṭṭhihatthappamāṇaṃ ākāsaṃ āropitassa rattibhāge samantā yojanappamāṇaṃ okāsaṃ ābhā pharati, yāya sabbo so okāso aruṇuggamanavelā viya sañjātāloko hoti. Tato kassakā kasikammaṃ vāṇijā āpaṇugghāṭanaṃ te te sippino taṃ taṃ kammantaṃ payojenti ‘‘divā’’ti maññamānā. Mahāsudassanassāpi sabbaṃ taṃ tatheva ahosi. Tena vuttaṃ – ‘‘puna ca paraṃ ānanda,…pe… maṇiratanaṃ pāturahosī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Itthiratanavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "249"
      },
      ". Evaṃ pātubhūtamaṇiratanassa pana cakkavattino visayasukhavisesassa visesakāraṇaṃ itthiratanaṃ pātubhavati. Maddarājakulato vā hissa aggamahesiṃ ānenti, uttarakuruto vā puññānubhāvena sayaṃ āgacchati. Avasesā panassā sampatti – ‘‘puna ca paraṃ, ānanda, rañño mahāsudassanassa itthiratanaṃ pāturahosi, abhirūpā dassanīyā’’tiādinā nayena pāḷiyaṃyeva āgatā."
    ],
    "innerText": "249. Evaṃ pātubhūtamaṇiratanassa pana cakkavattino visayasukhavisesassa visesakāraṇaṃ itthiratanaṃ pātubhavati. Maddarājakulato vā hissa aggamahesiṃ ānenti, uttarakuruto vā puññānubhāvena sayaṃ āgacchati. Avasesā panassā sampatti – ‘‘puna ca paraṃ, ānanda, rañño mahāsudassanassa itthiratanaṃ pāturahosi, abhirūpā dassanīyā’’tiādinā nayena pāḷiyaṃyeva āgatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha saṇṭhānapāripūriyā adhikaṃ rūpaṃ assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhirūpā. "
      },
      " Dissamānāva cakkhūni piṇayati, tasmā aññaṃ kiccavikkhepaṃ hitvāpi daṭṭhabbāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dassanīyā."
      },
      " Dissamānāva somanassavasena cittaṃ pasādetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāsādikā. Paramāyā"
      },
      "ti evaṃ pasādāvahattā uttamāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaṇṇapokkharatāyā"
      },
      "ti vaṇṇasundaratāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samannāgatā"
      },
      "ti upetā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhirūpā"
      },
      " vā yasmā nātidīghā nātirassā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dassanīyā"
      },
      " yasmā nātikisā nātithūlā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāsādikā"
      },
      " yasmā nātikāḷikā nāccodātā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paramāya vaṇṇapokkharatāya samannāgatā"
      },
      " yasmā abhikkantā mānusivaṇṇaṃ appattā dibbavaṇṇaṃ. Manussānañhi vaṇṇābhā bahi na niccharati. Devānaṃ pana atidūrampi niccharati."
    ],
    "innerText": "Tattha saṇṭhānapāripūriyā adhikaṃ rūpaṃ assāti abhirūpā. Dissamānāva cakkhūni piṇayati, tasmā aññaṃ kiccavikkhepaṃ hitvāpi daṭṭhabbāti dassanīyā. Dissamānāva somanassavasena cittaṃ pasādetīti pāsādikā. Paramāyāti evaṃ pasādāvahattā uttamāya. Vaṇṇapokkharatāyāti vaṇṇasundaratāya. Samannāgatāti upetā. Abhirūpā vā yasmā nātidīghā nātirassā. Dassanīyā yasmā nātikisā nātithūlā. Pāsādikā yasmā nātikāḷikā nāccodātā. Paramāya vaṇṇapokkharatāya samannāgatā yasmā abhikkantā mānusivaṇṇaṃ appattā dibbavaṇṇaṃ. Manussānañhi vaṇṇābhā bahi na niccharati. Devānaṃ pana atidūrampi niccharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassā pana dvādasahatthappamāṇaṃ padesaṃ sarīrābhā obhāseti. Nātidīghādīsu cassā paṭhamayugaḷena ārohasampatti, dutiyayugaḷena pariṇāhasampatti, tatiyayugaḷena vaṇṇasampatti vuttā. Chahi vāpi etehi kāyavipattiyā abhāvo, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atikkantā mānusivaṇṇa"
      },
      "nti iminā kāyasampatti vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tūlapicuno vā kappāsapicuno"
      },
      " vāti sappimaṇḍe pakkhipitvā ṭhapitassa satavāravihatassa tūlapicuno vā kappāsapicuno vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīte"
      },
      "ti rañño sītakāle. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uṇhe"
      },
      "ti rañño uṇhakāle. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Candanagandho"
      },
      "ti niccakālameva supisitassa ",
      " abhinavassa catujjātisamāyojitassa ",
      " haricandanassa gandho kāyato vāyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppalagandho vāyatī"
      },
      "ti hasitakathitakālesu mukhato taṅkhaṇaṃ vikasitasseva nīluppalassa atisurabhigandho vāyati."
    ],
    "innerText": "Tassā pana dvādasahatthappamāṇaṃ padesaṃ sarīrābhā obhāseti. Nātidīghādīsu cassā paṭhamayugaḷena ārohasampatti, dutiyayugaḷena pariṇāhasampatti, tatiyayugaḷena vaṇṇasampatti vuttā. Chahi vāpi etehi kāyavipattiyā abhāvo, atikkantā mānusivaṇṇanti iminā kāyasampatti vuttā. Tūlapicuno vā kappāsapicuno vāti sappimaṇḍe pakkhipitvā ṭhapitassa satavāravihatassa tūlapicuno vā kappāsapicuno vā. Sīteti rañño sītakāle. Uṇheti rañño uṇhakāle. Candanagandhoti niccakālameva supisitassa abhinavassa catujjātisamāyojitassa haricandanassa gandho kāyato vāyati. Uppalagandho vāyatīti hasitakathitakālesu mukhato taṅkhaṇaṃ vikasitasseva nīluppalassa atisurabhigandho vāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ rūpasamphassagandhasampattiyuttāya panassā sarīrasampattiyā anurūpaṃ ācāraṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṃ kho panā"
      },
      "tiādi vuttaṃ. Tattha rājānaṃ disvā nisinnāsanato aggidaḍḍhā viya paṭhamameva uṭṭhātīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pubbuṭṭhāyinī."
      },
      " Tasmiṃ nisinne tassa tālavaṇṭena bījanādikiccaṃ katvā pacchā nipatati nisīdatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pacchānipātinī."
      },
      " Kiṃ karomi, te devāti vācāya kiṃ-kāraṃ paṭisāvetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiṃ kārapaṭissāvinī."
      },
      " Rañño manāpameva carati karotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manāpacārinī."
      },
      " Yaṃ rañño piyaṃ tadeva vadatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "piyavādinī."
      }
    ],
    "innerText": "Evaṃ rūpasamphassagandhasampattiyuttāya panassā sarīrasampattiyā anurūpaṃ ācāraṃ dassetuṃ taṃ kho panātiādi vuttaṃ. Tattha rājānaṃ disvā nisinnāsanato aggidaḍḍhā viya paṭhamameva uṭṭhātīti pubbuṭṭhāyinī. Tasmiṃ nisinne tassa tālavaṇṭena bījanādikiccaṃ katvā pacchā nipatati nisīdatīti pacchānipātinī. Kiṃ karomi, te devāti vācāya kiṃ-kāraṃ paṭisāvetīti kiṃ kārapaṭissāvinī. Rañño manāpameva carati karotīti manāpacārinī. Yaṃ rañño piyaṃ tadeva vadatīti piyavādinī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni – ‘‘svāssā ācāro bhāvavisuddhiyāva, na sāṭheyyanā’’ti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṃ kho panā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "no aticarī"
      },
      "ti na atikkamitvā cari, ṭhapetvā rājānaṃ aññaṃ purisaṃ cittenapi na patthesīti vuttaṃ hoti."
    ],
    "innerText": "Idāni – ‘‘svāssā ācāro bhāvavisuddhiyāva, na sāṭheyyanā’’ti dassetuṃ taṃ kho panātiādimāha. Tattha no aticarīti na atikkamitvā cari, ṭhapetvā rājānaṃ aññaṃ purisaṃ cittenapi na patthesīti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha ye tassā ādimhi ‘‘abhirūpā’’tiādayo, ante ‘‘pubbuṭṭhāyinī’’tiādayo guṇā vuttā, te pakatiguṇā eva. ‘‘Atikkantā mānusivaṇṇa’’ntiādayo pana cakkavattino puññaṃ upanissāya cakkaratanapātubhāvato paṭṭhāya purimakammānubhāvena nibbattāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Abhirūpatādikāpi ",
      " vā cakkaratanapātubhāvato paṭṭhāya sabbākāraparipūrā jātā. Tenāha – ‘‘evarūpaṃ itthiratanaṃ pāturahosī’’ti."
    ],
    "innerText": "Abhirūpatādikāpi vā cakkaratanapātubhāvato paṭṭhāya sabbākāraparipūrā jātā. Tenāha – ‘‘evarūpaṃ itthiratanaṃ pāturahosī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Gahapatiratanavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "250"
      },
      ". Evaṃ pātubhūtaitthiratanassa pana rañño cakkavattino dhanakaraṇīyānaṃ kiccānaṃ yathāsukhaṃ pavattanatthaṃ gahapatiratanaṃ pātubhavati. So pakatiyāva mahābhogo, mahābhogakule jāto. Rañño dhanarāsivaḍḍhako seṭṭhigahapati hoti. Cakkaratanānubhāvasahitaṃ panassa kammavipākajaṃ dibbacakkhu pātubhavati, yena antopathaviyampi yojanabbhantare nidhiṃ passati, so taṃ sampattiṃ disvā tuṭṭhamānaso gantvā rājānaṃ dhanena pavāretvā sabbāni dhanakaraṇīyāni sampādeti ",
      ". Mahāsudassanassāpi tatheva sampādesi. Tena vuttaṃ – ‘‘puna caparaṃ ānanda…pe… evarūpaṃ gahapatiratanaṃ pāturahosī’’ti."
    ],
    "innerText": "250. Evaṃ pātubhūtaitthiratanassa pana rañño cakkavattino dhanakaraṇīyānaṃ kiccānaṃ yathāsukhaṃ pavattanatthaṃ gahapatiratanaṃ pātubhavati. So pakatiyāva mahābhogo, mahābhogakule jāto. Rañño dhanarāsivaḍḍhako seṭṭhigahapati hoti. Cakkaratanānubhāvasahitaṃ panassa kammavipākajaṃ dibbacakkhu pātubhavati, yena antopathaviyampi yojanabbhantare nidhiṃ passati, so taṃ sampattiṃ disvā tuṭṭhamānaso gantvā rājānaṃ dhanena pavāretvā sabbāni dhanakaraṇīyāni sampādeti . Mahāsudassanassāpi tatheva sampādesi. Tena vuttaṃ – ‘‘puna caparaṃ ānanda…pe… evarūpaṃ gahapatiratanaṃ pāturahosī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pariṇāyakaratanavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "251"
      },
      ". Evaṃ ",
      " pātubhūtagahapatiratanassa pana rañño cakkavattissa sabbakiccasaṃvidhānasamatthaṃ pariṇāyakaratanaṃ pātubhavati. So rañño jeṭṭhaputtova hoti. Pakatiyā eva so paṇḍito byatto medhāvī vibhāvī. Rañño puññānubhāvaṃ nissāya panassa attano kammānubhāvena paracittañāṇaṃ uppajjati. Yena dvādasayojanāya rājaparisāya cittācāraṃ ñatvā rañño hite ca ahite ca vavatthapetuṃ samattho hoti, sopi taṃ attano ānubhāvaṃ disvā tuṭṭhahadayo rājānaṃ sabbakiccānusāsanena pavāreti. Mahāsudassanampi tatheva pavāresi. Tena vuttaṃ – ‘‘puna caparaṃ…pe… pariṇāyakaratanaṃ pāturahosī’’ti."
    ],
    "innerText": "251. Evaṃ pātubhūtagahapatiratanassa pana rañño cakkavattissa sabbakiccasaṃvidhānasamatthaṃ pariṇāyakaratanaṃ pātubhavati. So rañño jeṭṭhaputtova hoti. Pakatiyā eva so paṇḍito byatto medhāvī vibhāvī. Rañño puññānubhāvaṃ nissāya panassa attano kammānubhāvena paracittañāṇaṃ uppajjati. Yena dvādasayojanāya rājaparisāya cittācāraṃ ñatvā rañño hite ca ahite ca vavatthapetuṃ samattho hoti, sopi taṃ attano ānubhāvaṃ disvā tuṭṭhahadayo rājānaṃ sabbakiccānusāsanena pavāreti. Mahāsudassanampi tatheva pavāresi. Tena vuttaṃ – ‘‘puna caparaṃ…pe… pariṇāyakaratanaṃ pāturahosī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ṭhapetabbaṃ ṭhapetu"
      },
      "nti tasmiṃ tasmiṃ ṭhānantare ṭhapetabbaṃ ṭhapetuṃ."
    ],
    "innerText": "Tattha ṭhapetabbaṃ ṭhapetunti tasmiṃ tasmiṃ ṭhānantare ṭhapetabbaṃ ṭhapetuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Catuiddhisamannāgatavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "252"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samavepākiniyā"
      },
      "ti samavipācaniyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gahaṇiyā"
      },
      "ti kammajatejodhātuyā. Tattha yassa bhuttamattova āhāro jīrati, yassa vā ",
      " pana puṭabhattaṃ viya tattheva tiṭṭhati, ubhopete na samavepākiniyā samannāgatā. Yassa pana puna bhattakāle bhattachando uppajjateva, ayaṃ samavepākiniyā samannāgatoti."
    ],
    "innerText": "252.Samavepākiniyāti samavipācaniyā. Gahaṇiyāti kammajatejodhātuyā. Tattha yassa bhuttamattova āhāro jīrati, yassa vā pana puṭabhattaṃ viya tattheva tiṭṭhati, ubhopete na samavepākiniyā samannāgatā. Yassa pana puna bhattakāle bhattachando uppajjateva, ayaṃ samavepākiniyā samannāgatoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dhammapāsādapokkharaṇivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "253"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Māpesi kho"
      },
      "ti nagare bheriṃ carāpetvā janarāsiṃ kāretvā na māpesi, rañño pana saha cittuppādeneva bhūmiṃ bhinditvā caturāsīti pokkharaṇīsahassāni nibbattiṃsu. Tāni sandhāyetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvīhi vedikāhī"
      },
      "ti ekāya iṭṭhakānaṃ pariyanteyeva parikkhittā ekāya pariveṇaparicchedapariyante. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etadahosī"
      },
      "ti kasmā ahosi? Ekadivasaṃ kira nahatvā ca pivitvā ca gacchantaṃ mahājanaṃ mahāpuriso oloketvā ime ummattakaveseneva gacchanti. Sace etesaṃ ettha piḷandhanapupphāni bhaveyyuṃ, bhaddakaṃ siyāti. Athassa etadahosi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbotuka"
      },
      "nti ",
      " pupphaṃ nāma ekasmiṃyeva utumhi pupphati. Ahaṃ pana tathā karissāmi – ‘‘yathā sabbesu utūsu pupphissatī’’ti cintesiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ropāpesī"
      },
      "ti nānāvaṇṇauppalabījādīni tato tato āharāpetvā na ropāpesi, saha cittuppādeneva panassa sabbaṃ ijjhati. Taṃ loko raññā ropitanti maññi. Tena vuttaṃ – ‘‘ropāpesī’’ti. Tato paṭṭhāya mahājano nānappakāraṃ jalajathalajamālaṃ piḷandhitvā nakkhattaṃ kīḷamāno ",
      " viya gacchati."
    ],
    "innerText": "253.Māpesi khoti nagare bheriṃ carāpetvā janarāsiṃ kāretvā na māpesi, rañño pana saha cittuppādeneva bhūmiṃ bhinditvā caturāsīti pokkharaṇīsahassāni nibbattiṃsu. Tāni sandhāyetaṃ vuttaṃ. Dvīhi vedikāhīti ekāya iṭṭhakānaṃ pariyanteyeva parikkhittā ekāya pariveṇaparicchedapariyante. Etadahosīti kasmā ahosi? Ekadivasaṃ kira nahatvā ca pivitvā ca gacchantaṃ mahājanaṃ mahāpuriso oloketvā ime ummattakaveseneva gacchanti. Sace etesaṃ ettha piḷandhanapupphāni bhaveyyuṃ, bhaddakaṃ siyāti. Athassa etadahosi. Tattha sabbotukanti pupphaṃ nāma ekasmiṃyeva utumhi pupphati. Ahaṃ pana tathā karissāmi – ‘‘yathā sabbesu utūsu pupphissatī’’ti cintesiṃ. Ropāpesīti nānāvaṇṇauppalabījādīni tato tato āharāpetvā na ropāpesi, saha cittuppādeneva panassa sabbaṃ ijjhati. Taṃ loko raññā ropitanti maññi. Tena vuttaṃ – ‘‘ropāpesī’’ti. Tato paṭṭhāya mahājano nānappakāraṃ jalajathalajamālaṃ piḷandhitvā nakkhattaṃ kīḷamāno viya gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "254"
      },
      ". Atha rājā tato uttaripi janaṃ sukhasamappitaṃ kātukāmo – ‘‘yaṃnūnāhaṃ imāsaṃ pokkharaṇīnaṃ tīre’’tiādinā janassa sukhavidhānaṃ cintetvā sabbaṃ akāsi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nhāpesu"
      },
      "nti añño sarīraṃ ubbaṭṭesi, añño cuṇṇāni yojesi, añño tīre nahāyantassa udakaṃ āhari, añño vatthāni paṭiggahesi ceva adāsi ca."
    ],
    "innerText": "254. Atha rājā tato uttaripi janaṃ sukhasamappitaṃ kātukāmo – ‘‘yaṃnūnāhaṃ imāsaṃ pokkharaṇīnaṃ tīre’’tiādinā janassa sukhavidhānaṃ cintetvā sabbaṃ akāsi. Tattha nhāpesunti añño sarīraṃ ubbaṭṭesi, añño cuṇṇāni yojesi, añño tīre nahāyantassa udakaṃ āhari, añño vatthāni paṭiggahesi ceva adāsi ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭṭhapesi kho"
      },
      "ti kathaṃ paṭṭhapesi? Itthīnañca purisānañca anucchavike alaṅkāre kāretvā itthimattameva tattha paricāravasena sesaṃ sabbaṃ pariccāgavasena ṭhapetvā rājā mahāsudassano dānaṃ deti, taṃ paribhuñjathāti bheriṃ carāpesi. Mahājano pokkharaṇītīraṃ āgantvā nahatvā vatthāni parivattetvā nānāgandhehi vilitto piḷandhanavicittamālo dānaggaṃ ",
      " gantvā anekappakāresu yāgubhattakhajjakesu aṭṭhavidhapānesu ca yo yaṃ icchati, so taṃ khāditvā ca pivitvā ca nānāvaṇṇāni khomasukhumāni vatthāni nivāsetvā sampattiṃ anubhavitvā yesaṃ tādisāni atthi, te ohāya gacchanti. Yesaṃ pana natthi, te gahetvā gacchanti. Hatthiassayānādīsupi nisīditvā thokaṃ vicaritvā anatthikā ohāya, atthikā gahetvā gacchanti. Varasayanesu nipajjitvā sampattiṃ anubhavitvā anatthikā ohāya, atthikā gahetvā gacchanti. Itthīhipi saddhiṃ sampattiṃ anubhavitvā anatthikā ohāya, atthikā gahetvā gacchanti. Sattavidharatanapasādhanāni ca pasādhetvāpi sampattiṃ anubhavitvā anatthikā ohāya, atthikā gahetvā gacchanti. Tampi dānaṃ uṭṭhāya samuṭṭhāya dīyateva. Jambudīpavāsikānaṃ aññaṃ kammaṃ natthi, rañño dānaṃ paribhuñjantāva vicaranti."
    ],
    "innerText": "Paṭṭhapesi khoti kathaṃ paṭṭhapesi? Itthīnañca purisānañca anucchavike alaṅkāre kāretvā itthimattameva tattha paricāravasena sesaṃ sabbaṃ pariccāgavasena ṭhapetvā rājā mahāsudassano dānaṃ deti, taṃ paribhuñjathāti bheriṃ carāpesi. Mahājano pokkharaṇītīraṃ āgantvā nahatvā vatthāni parivattetvā nānāgandhehi vilitto piḷandhanavicittamālo dānaggaṃ gantvā anekappakāresu yāgubhattakhajjakesu aṭṭhavidhapānesu ca yo yaṃ icchati, so taṃ khāditvā ca pivitvā ca nānāvaṇṇāni khomasukhumāni vatthāni nivāsetvā sampattiṃ anubhavitvā yesaṃ tādisāni atthi, te ohāya gacchanti. Yesaṃ pana natthi, te gahetvā gacchanti. Hatthiassayānādīsupi nisīditvā thokaṃ vicaritvā anatthikā ohāya, atthikā gahetvā gacchanti. Varasayanesu nipajjitvā sampattiṃ anubhavitvā anatthikā ohāya, atthikā gahetvā gacchanti. Itthīhipi saddhiṃ sampattiṃ anubhavitvā anatthikā ohāya, atthikā gahetvā gacchanti. Sattavidharatanapasādhanāni ca pasādhetvāpi sampattiṃ anubhavitvā anatthikā ohāya, atthikā gahetvā gacchanti. Tampi dānaṃ uṭṭhāya samuṭṭhāya dīyateva. Jambudīpavāsikānaṃ aññaṃ kammaṃ natthi, rañño dānaṃ paribhuñjantāva vicaranti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "255"
      },
      ". Atha brāhmaṇagahapatikā cintesuṃ – ‘‘ayaṃ rājā evarūpaṃ dānaṃ dadantopi ‘mayhaṃ taṇḍulādīni vā khīrādīni vā dethā’ti na kiñci āharāpeti, na kho pana amhākaṃ – ‘rājā āharāpetī’ti tuṇhīmāsituṃ patirūpa’’nti te bahuṃ sāpateyyaṃ saṃharitvā rañño upanāmesuṃ. Tasmā – ‘‘atha kho, ānanda, brāhmaṇagahapatikā’’tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ samacintesu"
      },
      "nti kasmā evaṃ cintesuṃ? Kassaci gharato appaṃ ābhataṃ, kassaci bahu. Tasmiṃ paṭisaṃhariyamāne ",
      " – ‘‘kiṃ taveva gharato sundaraṃ ābhataṃ, na mayhaṃ gharato, kiṃ taveva gharato bahu ",
      ", na mayha’’nti evaṃ kalahasaddopi uppajjeyya, so mā uppajjitthāti evaṃ samacintesuṃ."
    ],
    "innerText": "255. Atha brāhmaṇagahapatikā cintesuṃ – ‘‘ayaṃ rājā evarūpaṃ dānaṃ dadantopi ‘mayhaṃ taṇḍulādīni vā khīrādīni vā dethā’ti na kiñci āharāpeti, na kho pana amhākaṃ – ‘rājā āharāpetī’ti tuṇhīmāsituṃ patirūpa’’nti te bahuṃ sāpateyyaṃ saṃharitvā rañño upanāmesuṃ. Tasmā – ‘‘atha kho, ānanda, brāhmaṇagahapatikā’’tiādimāha. Evaṃ samacintesunti kasmā evaṃ cintesuṃ? Kassaci gharato appaṃ ābhataṃ, kassaci bahu. Tasmiṃ paṭisaṃhariyamāne – ‘‘kiṃ taveva gharato sundaraṃ ābhataṃ, na mayhaṃ gharato, kiṃ taveva gharato bahu , na mayha’’nti evaṃ kalahasaddopi uppajjeyya, so mā uppajjitthāti evaṃ samacintesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "256"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ehi tvaṃ sammā"
      },
      "ti ehi tvaṃ vayassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammaṃ nāma pāsāda"
      },
      "nti pāsādassa nāmaṃ āropetvāva āṇāpesi. Vissakammo pana kīva mahanto deva pāsādo hotūti paṭipucchitvā dīghato yojanaṃ vitthārato aḍḍhayojanaṃ sabbaratanamayova hotūti vuttepi ‘evaṃ hotu, bhaddaṃ tava vacana’nti tassa paṭissuṇitvā dhammarājānaṃ sampaṭicchāpetvā māpesi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "evaṃ bhaddaṃ tavāti kho ānandā"
      },
      "ti evaṃ bhaddaṃ tava iti kho ānanda. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭissutvā"
      },
      "ti sampaṭicchitvā, vatvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tuṇhībhāvenā"
      },
      "ti samaṇadhammapaṭipattikaraṇokāso ",
      " me bhavissatīti icchanto tuṇhībhāvena adhivāsesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāramayo"
      },
      "ti candanasāramayo."
    ],
    "innerText": "256.Ehi tvaṃ sammāti ehi tvaṃ vayassa. Dhammaṃ nāma pāsādanti pāsādassa nāmaṃ āropetvāva āṇāpesi. Vissakammo pana kīva mahanto deva pāsādo hotūti paṭipucchitvā dīghato yojanaṃ vitthārato aḍḍhayojanaṃ sabbaratanamayova hotūti vuttepi ‘evaṃ hotu, bhaddaṃ tava vacana’nti tassa paṭissuṇitvā dhammarājānaṃ sampaṭicchāpetvā māpesi. Tattha evaṃ bhaddaṃ tavāti kho ānandāti evaṃ bhaddaṃ tava iti kho ānanda. Paṭissutvāti sampaṭicchitvā, vatvāti attho. Tuṇhībhāvenāti samaṇadhammapaṭipattikaraṇokāso me bhavissatīti icchanto tuṇhībhāvena adhivāsesi. Sāramayoti candanasāramayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "257"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvīhi vedikāhī"
      },
      "ti ettha ekā vedikā panassa uṇhīsamatthake ahosi, ekā heṭṭhā paricchedamatthake."
    ],
    "innerText": "257.Dvīhi vedikāhīti ettha ekā vedikā panassa uṇhīsamatthake ahosi, ekā heṭṭhā paricchedamatthake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "258"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duddikkho ahosī"
      },
      "ti duuddikkho, pabhāsampattiyā duddasoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Musatī"
      },
      "ti harati phandāpeti niccalabhāvena patiṭṭhātuṃ na deti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viddhe"
      },
      "ti ubbiddhe, meghavigamena dūrībhūteti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Deve"
      },
      "ti ākāse."
    ],
    "innerText": "258.Duddikkho ahosīti duuddikkho, pabhāsampattiyā duddasoti attho. Musatīti harati phandāpeti niccalabhāvena patiṭṭhātuṃ na deti. Viddheti ubbiddhe, meghavigamena dūrībhūteti attho. Deveti ākāse."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "259"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Māpesi kho"
      },
      "ti ahaṃ imasmiṃ ṭhāne pokkharaṇiṃ māpemi, tumhākaṃ gharāni bhindathāti na evaṃ kāretvā māpesi. Cittuppādavaseneva panassa bhūmiṃ bhinditvā tathārūpā pokkharaṇī ahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te sabbakāmehī"
      },
      "ti sabbehi icchiticchitavatthūhi, samaṇe samaṇaparikkhārehi, brāhmaṇe brāhmaṇaparikkhārehi santappesīti."
    ],
    "innerText": "259.Māpesi khoti ahaṃ imasmiṃ ṭhāne pokkharaṇiṃ māpemi, tumhākaṃ gharāni bhindathāti na evaṃ kāretvā māpesi. Cittuppādavaseneva panassa bhūmiṃ bhinditvā tathārūpā pokkharaṇī ahosi. Te sabbakāmehīti sabbehi icchiticchitavatthūhi, samaṇe samaṇaparikkhārehi, brāhmaṇe brāhmaṇaparikkhārehi santappesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamabhāṇavāravaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Jhānasampattivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "260"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahiddhiko"
      },
      "ti cittuppādavaseneva caturāsītipokkharaṇīsahassānaṃ nibbattisaṅkhātāya mahatiyā ",
      " iddhiyā samannāgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahānubhāvo"
      },
      "ti tesaṃyeva anubhavitabbānaṃ mahantatāya mahānubhāvena samannāgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seyyathida"
      },
      "nti nipāto, tassa – ‘‘katamesaṃ tiṇṇa’’nti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dānassā"
      },
      "ti sampattipariccāgassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Damassā"
      },
      "ti āḷavakasutte paññā damoti āgato. Idha attānaṃ ",
      " damentena kataṃ uposathakammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃyamassā"
      },
      "ti sīlassa."
    ],
    "innerText": "260.Mahiddhikoti cittuppādavaseneva caturāsītipokkharaṇīsahassānaṃ nibbattisaṅkhātāya mahatiyā iddhiyā samannāgato. Mahānubhāvoti tesaṃyeva anubhavitabbānaṃ mahantatāya mahānubhāvena samannāgato. Seyyathidanti nipāto, tassa – ‘‘katamesaṃ tiṇṇa’’nti attho. Dānassāti sampattipariccāgassa. Damassāti āḷavakasutte paññā damoti āgato. Idha attānaṃ damentena kataṃ uposathakammaṃ. Saṃyamassāti sīlassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Bodhisattapubbayogavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ṭhatvā panassa pubbayogo veditabbo – rājā kira pubbe gahapatikule nibbatti. Tena ca samayena dharamānakasseva kassapabuddhassa sāsane eko thero araññe vāsaṃ vasati, bodhisatto attano ",
      " kammena araññaṃ paviṭṭho theraṃ disvā upasaṅkamitvā vanditvā therassa nisajjanaṭṭhānacaṅkamanaṭṭhānāni oloketvā pucchi – ‘‘idheva, bhante, ayyo vasatī’’ti? Āma, upāsakāti sutvā – ‘‘idheva ayyassa paṇṇasālaṃ kātuṃ vaṭṭatī’’ti cintetvā attano kammaṃ pahāya dabbasambhāraṃ koṭṭetvā paṇṇasālaṃ katvā chādetvā bhittiyo mattikāya limpitvā dvāraṃ yojetvā kaṭṭhattharaṇaṃ katvā – ‘‘karissati nu kho paribhogaṃ, na karissatī’’ti ekamantaṃ nisīdi. Thero antogāmato āgantvā paṇṇasālaṃ pavisitvā kaṭṭhattharaṇe nisīdi. Upāsakopi āgantvā vanditvā samīpe nisinno ‘‘phāsukā, bhante, paṇṇasālā’’ti pucchi. Phāsukā, bhaddamukha, pabbajitasāruppāti. Vasissatha, bhante, idhāti? Āma, upāsakāti, so adhivāsanākārena vasissatīti ñatvā nibaddhaṃ mayhaṃ gharadvāraṃ āgantabbanti paṭijānāpetvā – ‘‘ekaṃ me, bhante, varaṃ dethā’’ti āha. Atikkantavarā, upāsaka, pabbajitāti. Bhante, yañca kappati, yañca anavajjanti. Vadehi upāsakāti. Bhante, nibaddhavasanaṭṭhāne nāma manussā maṅgale vā amaṅgale vā āgamanaṃ icchanti, anāgacchantassa kujjhanti. Tasmā aññaṃ nimantitaṭṭhānaṃ gantvāpi mayhaṃ gharaṃ pavisitvāva bhattakiccaṃ niṭṭhāpetabbanti. Thero adhivāsesi."
    ],
    "innerText": "Idha ṭhatvā panassa pubbayogo veditabbo – rājā kira pubbe gahapatikule nibbatti. Tena ca samayena dharamānakasseva kassapabuddhassa sāsane eko thero araññe vāsaṃ vasati, bodhisatto attano kammena araññaṃ paviṭṭho theraṃ disvā upasaṅkamitvā vanditvā therassa nisajjanaṭṭhānacaṅkamanaṭṭhānāni oloketvā pucchi – ‘‘idheva, bhante, ayyo vasatī’’ti? Āma, upāsakāti sutvā – ‘‘idheva ayyassa paṇṇasālaṃ kātuṃ vaṭṭatī’’ti cintetvā attano kammaṃ pahāya dabbasambhāraṃ koṭṭetvā paṇṇasālaṃ katvā chādetvā bhittiyo mattikāya limpitvā dvāraṃ yojetvā kaṭṭhattharaṇaṃ katvā – ‘‘karissati nu kho paribhogaṃ, na karissatī’’ti ekamantaṃ nisīdi. Thero antogāmato āgantvā paṇṇasālaṃ pavisitvā kaṭṭhattharaṇe nisīdi. Upāsakopi āgantvā vanditvā samīpe nisinno ‘‘phāsukā, bhante, paṇṇasālā’’ti pucchi. Phāsukā, bhaddamukha, pabbajitasāruppāti. Vasissatha, bhante, idhāti? Āma, upāsakāti, so adhivāsanākārena vasissatīti ñatvā nibaddhaṃ mayhaṃ gharadvāraṃ āgantabbanti paṭijānāpetvā – ‘‘ekaṃ me, bhante, varaṃ dethā’’ti āha. Atikkantavarā, upāsaka, pabbajitāti. Bhante, yañca kappati, yañca anavajjanti. Vadehi upāsakāti. Bhante, nibaddhavasanaṭṭhāne nāma manussā maṅgale vā amaṅgale vā āgamanaṃ icchanti, anāgacchantassa kujjhanti. Tasmā aññaṃ nimantitaṭṭhānaṃ gantvāpi mayhaṃ gharaṃ pavisitvāva bhattakiccaṃ niṭṭhāpetabbanti. Thero adhivāsesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So paṇṇasālāya kaṭasāṭakaṃ pattharitvā mañcapīṭhaṃ paññapesi, apassenaṃ nikkhipi, pādakathalikaṃ ṭhapesi, pokkharaṇiṃ khaṇi, caṅkamaṃ katvā vālikaṃ okiri, mige āgantvā bhittiṃ ghaṃsitvā mattikaṃ pātente disvā kaṇṭakavatiṃ parikkhipi. Pokkharaṇiṃ otaritvā udakaṃ āḷulikaṃ karonte disvā anto pāsāṇehi cinitvā bahi kaṇṭakavatiṃ parikkhipitvā antovatipariyante tālapantiyo ropeti, mahācaṅkame sammaṭṭhaṭṭhānaṃ āḷulente disvā caṅkamampi vatiyā parikkhipitvā antovatipariyante tālapantiṃ ropesi. Evaṃ ",
      " āvāsaṃ niṭṭhapetvā ",
      " therassa ticīvaraṃ, piṇḍapātaṃ, osadhaṃ, paribhogabhājanaṃ, ārakaṇṭakaṃ, pipphalikaṃ, nakhacchedanaṃ, sūciṃ, kattarayaṭṭhiṃ, upāhanaṃ, udakatumbaṃ, chattaṃ, dīpakapallakaṃ, malaharaṇiṃ. Parissāvanaṃ, dhamakaraṇaṃ, pattaṃ, thālakaṃ, yaṃ vā panaññampi pabbajitānaṃ paribhogajātaṃ, sabbaṃ adāsi. Therassa bodhisattena adinnaparikkhāro nāma nāhosi. So sīlāni rakkhanto uposathaṃ karonto yāvajīvaṃ ",
      " theraṃ upaṭṭhahi. Thero tattheva vasanto arahattaṃ patvā parinibbāyi."
    ],
    "innerText": "So paṇṇasālāya kaṭasāṭakaṃ pattharitvā mañcapīṭhaṃ paññapesi, apassenaṃ nikkhipi, pādakathalikaṃ ṭhapesi, pokkharaṇiṃ khaṇi, caṅkamaṃ katvā vālikaṃ okiri, mige āgantvā bhittiṃ ghaṃsitvā mattikaṃ pātente disvā kaṇṭakavatiṃ parikkhipi. Pokkharaṇiṃ otaritvā udakaṃ āḷulikaṃ karonte disvā anto pāsāṇehi cinitvā bahi kaṇṭakavatiṃ parikkhipitvā antovatipariyante tālapantiyo ropeti, mahācaṅkame sammaṭṭhaṭṭhānaṃ āḷulente disvā caṅkamampi vatiyā parikkhipitvā antovatipariyante tālapantiṃ ropesi. Evaṃ āvāsaṃ niṭṭhapetvā therassa ticīvaraṃ, piṇḍapātaṃ, osadhaṃ, paribhogabhājanaṃ, ārakaṇṭakaṃ, pipphalikaṃ, nakhacchedanaṃ, sūciṃ, kattarayaṭṭhiṃ, upāhanaṃ, udakatumbaṃ, chattaṃ, dīpakapallakaṃ, malaharaṇiṃ. Parissāvanaṃ, dhamakaraṇaṃ, pattaṃ, thālakaṃ, yaṃ vā panaññampi pabbajitānaṃ paribhogajātaṃ, sabbaṃ adāsi. Therassa bodhisattena adinnaparikkhāro nāma nāhosi. So sīlāni rakkhanto uposathaṃ karonto yāvajīvaṃ theraṃ upaṭṭhahi. Thero tattheva vasanto arahattaṃ patvā parinibbāyi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bodhisattopi yāvatāyukaṃ puññaṃ katvā devaloke nibbattitvā tato cuto manussalokaṃ āgacchanto kusāvatiyā rājadhāniyā nibbattitvā mahāsudassano rājā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Evaṃ nātimahantampi, puññaṃ āyatane kataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mahāvipākaṃ hotīti, kattabbaṃ taṃ vibhāvinā’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāviyūha"
      },
      "nti rajatamayaṃ mahākūṭāgāraṃ. Tattha vasitukāmo hutvā agamāsi, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ettāvatā kāmavitakkā"
      },
      "ti kāmavitakka tayā ettāvatā nivattitabbaṃ, ito paraṃ tuyhaṃ abhūmi, idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānāgāraṃ"
      },
      " nāma, nayidaṃ tayā saddhiṃ vasanaṭṭhānanti evaṃ tayo vitakke kūṭāgāradvāreyeva nivattesi."
    ],
    "innerText": "Mahāviyūhanti rajatamayaṃ mahākūṭāgāraṃ. Tattha vasitukāmo hutvā agamāsi, ettāvatā kāmavitakkāti kāmavitakka tayā ettāvatā nivattitabbaṃ, ito paraṃ tuyhaṃ abhūmi, idaṃ jhānāgāraṃ nāma, nayidaṃ tayā saddhiṃ vasanaṭṭhānanti evaṃ tayo vitakke kūṭāgāradvāreyeva nivattesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "261"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamajjhāna"
      },
      "ntiādīsu visuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kasiṇaparikammakiccaṃ"
      },
      " nāma natthi. Nīlakasiṇena atthe sati nīlamaṇiṃ, pītakasiṇena atthe sati suvaṇṇaṃ, lohitakasiṇena atthe sati rattamaṇiṃ, odātakasiṇena atthe sati rajatanti olokitaolokitaṭṭhāne kasiṇameva paññāyati."
    ],
    "innerText": "261.Paṭhamajjhānantiādīsu visuṃ kasiṇaparikammakiccaṃ nāma natthi. Nīlakasiṇena atthe sati nīlamaṇiṃ, pītakasiṇena atthe sati suvaṇṇaṃ, lohitakasiṇena atthe sati rattamaṇiṃ, odātakasiṇena atthe sati rajatanti olokitaolokitaṭṭhāne kasiṇameva paññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "262"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mettāsahagatenā"
      },
      "tiādīsu yaṃ vattabbaṃ, taṃ sabbampi visuddhimagge vuttameva. Iti pāḷiyaṃ cattāri jhānāni, cattāri appamaññāneva vuttāni. Mahāpuriso pana sabbāpi aṭṭha samāpattiyo, pañca abhiññāyo ca nibbattetvā anulomapaṭilomādivasena cuddasahākārehi samāpattiyo pavisanto madhupaṭalaṃ paviṭṭhabhamaro madhurasena viya samāpattisukheneva yāpeti."
    ],
    "innerText": "262.Mettāsahagatenātiādīsu yaṃ vattabbaṃ, taṃ sabbampi visuddhimagge vuttameva. Iti pāḷiyaṃ cattāri jhānāni, cattāri appamaññāneva vuttāni. Mahāpuriso pana sabbāpi aṭṭha samāpattiyo, pañca abhiññāyo ca nibbattetvā anulomapaṭilomādivasena cuddasahākārehi samāpattiyo pavisanto madhupaṭalaṃ paviṭṭhabhamaro madhurasena viya samāpattisukheneva yāpeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Caturāsītinagarasahassādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "263"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusāvatīrājadhānippamukhānī"
      },
      "ti ",
      " kusāvatī rājadhānī tesaṃ nagarānaṃ pamukhā sabbaseṭṭhāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhattābhihāro"
      },
      "ti ",
      " abhiharitabbabhattaṃ."
    ],
    "innerText": "263.Kusāvatīrājadhānippamukhānīti kusāvatī rājadhānī tesaṃ nagarānaṃ pamukhā sabbaseṭṭhāti attho. Bhattābhihāroti abhiharitabbabhattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "264"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vassasatassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vassasatassā"
      },
      "ti kasmā evaṃ cintesi? Tesaṃ saddena ukkaṇṭhitvā, ‘‘samāpannassa saddo kaṇṭako’’ti (a. ni. 10.72) hi vuttaṃ. Tasmā saddena ukkaṇṭhito mahāpuriso. Atha kasmā mā āgacchantūti na vadati? Idāni rājā na passatīti nibaddhavattaṃ na labhissanti, taṃ tesaṃ mā uppajjitthāti na vadati."
    ],
    "innerText": "264.Vassasatassavassasatassāti kasmā evaṃ cintesi? Tesaṃ saddena ukkaṇṭhitvā, ‘‘samāpannassa saddo kaṇṭako’’ti (a. ni. 10.72) hi vuttaṃ. Tasmā saddena ukkaṇṭhito mahāpuriso. Atha kasmā mā āgacchantūti na vadati? Idāni rājā na passatīti nibaddhavattaṃ na labhissanti, taṃ tesaṃ mā uppajjitthāti na vadati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Subhaddādeviupasaṅkamanavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "265"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etadahosī"
      },
      "ti kadā etaṃ ahosi. Rañño kālaṅkiriyadivase. Tadā kira devatā cintesuṃ – ‘‘rājā anāthakālaṅkiriyaṃ mā karotu, orodhehi bahūhi dhītūhi puttehi parivāritova karotū’’ti. Atha deviṃ āvaṭṭetvā tassā evaṃ cittaṃ uppādesuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pītāni vatthānī"
      },
      "ti tāni kira pakatiyā rañño manāpāni, tasmā tāni pārupathāti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ettheva devi tiṭṭhā"
      },
      "ti devi imaṃ jhānāgāraṃ nāma tumhehi saddhiṃ vasanaṭṭhānaṃ na hoti, jhānarativindanaṭṭhānaṃ mama, mā idha pāvisīti."
    ],
    "innerText": "265.Etadahosīti kadā etaṃ ahosi. Rañño kālaṅkiriyadivase. Tadā kira devatā cintesuṃ – ‘‘rājā anāthakālaṅkiriyaṃ mā karotu, orodhehi bahūhi dhītūhi puttehi parivāritova karotū’’ti. Atha deviṃ āvaṭṭetvā tassā evaṃ cittaṃ uppādesuṃ. Pītāni vatthānīti tāni kira pakatiyā rañño manāpāni, tasmā tāni pārupathāti āha. Ettheva devi tiṭṭhāti devi imaṃ jhānāgāraṃ nāma tumhehi saddhiṃ vasanaṭṭhānaṃ na hoti, jhānarativindanaṭṭhānaṃ mama, mā idha pāvisīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "266"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etadahosī"
      },
      "ti loke sattā nāma maraṇāsannakāle ativiya virocanti, tenassa rañño vippasannaindriyabhāvaṃ disvā evaṃ ahosi, tato mā rañño kālaṅkiriyā ahosīti tassa kālaṅkiriyaṃ anicchamānā sampati guṇamassa kathayitvā tiṭṭhamānākāraṃ karissāmīti cintetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "imāni te devā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chandaṃ janehī"
      },
      "ti pemaṃ uppādehi, ratiṃ karohi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jīvite apekkha"
      },
      "nti jīvite sāpekkhaṃ, ālayaṃ, taṇhaṃ karohīti attho."
    ],
    "innerText": "266.Etadahosīti loke sattā nāma maraṇāsannakāle ativiya virocanti, tenassa rañño vippasannaindriyabhāvaṃ disvā evaṃ ahosi, tato mā rañño kālaṅkiriyā ahosīti tassa kālaṅkiriyaṃ anicchamānā sampati guṇamassa kathayitvā tiṭṭhamānākāraṃ karissāmīti cintetvā imāni te devātiādimāha. Tattha chandaṃ janehīti pemaṃ uppādehi, ratiṃ karohi. Jīvite apekkhanti jīvite sāpekkhaṃ, ālayaṃ, taṇhaṃ karohīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ kho maṃ tvaṃ devī"
      },
      "ti ‘‘mayaṃ kho, deva, itthiyo nāma pabbajitānaṃ upacārakathaṃ na jānāma, kathaṃ vadāma mahārājā’’ti rājānaṃ ‘‘pabbajito aya’’nti maññamānāya deviyā vutte – ‘‘evaṃ kho maṃ, tvaṃ devi, samudācarāhī’’tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Garahitā"
      },
      "ti buddhehi paccekabuddhehi sāvakehi aññehi ca paṇḍitehi bahussutehi garahitā. Kiṃ kāraṇā? Sāpekkhakālakiriyā ",
      " hi attanoyeva gehe yakkhakukkuraajagoṇamahiṃsamūsikakukkuṭaūkāmaṅgulādibhāvena nibbattanakāraṇaṃ hoti."
    ],
    "innerText": "Evaṃ kho maṃ tvaṃ devīti ‘‘mayaṃ kho, deva, itthiyo nāma pabbajitānaṃ upacārakathaṃ na jānāma, kathaṃ vadāma mahārājā’’ti rājānaṃ ‘‘pabbajito aya’’nti maññamānāya deviyā vutte – ‘‘evaṃ kho maṃ, tvaṃ devi, samudācarāhī’’tiādimāha. Garahitāti buddhehi paccekabuddhehi sāvakehi aññehi ca paṇḍitehi bahussutehi garahitā. Kiṃ kāraṇā? Sāpekkhakālakiriyā hi attanoyeva gehe yakkhakukkuraajagoṇamahiṃsamūsikakukkuṭaūkāmaṅgulādibhāvena nibbattanakāraṇaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "268"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kho, ānanda, subhaddā devī assūni puñchitvā"
      },
      "ti devī ekamantaṃ gantvā roditvā kanditvā assūni puñchitvā etadavoca."
    ],
    "innerText": "268.Athakho, ānanda, subhaddā devī assūni puñchitvāti devī ekamantaṃ gantvā roditvā kanditvā assūni puñchitvā etadavoca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Brahmalokūpagamavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "269"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gahapatissa vā"
      },
      "ti kasmā ",
      " āha? Tesaṃ kira soṇaseṭṭhiputtādīnaṃ viya mahatī sampatti hoti, soṇassa kira seṭṭhiputtassa ekā bhattapāti dve satasahassāni agghati. Iti tesaṃ tādisaṃ bhattaṃ bhuttānaṃ muhuttaṃ bhattasammado bhattamucchā bhattakilamatho hoti."
    ],
    "innerText": "269.Gahapatissa vāti kasmā āha? Tesaṃ kira soṇaseṭṭhiputtādīnaṃ viya mahatī sampatti hoti, soṇassa kira seṭṭhiputtassa ekā bhattapāti dve satasahassāni agghati. Iti tesaṃ tādisaṃ bhattaṃ bhuttānaṃ muhuttaṃ bhattasammado bhattamucchā bhattakilamatho hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "271"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ tena samayena ajjhāvasāmī"
      },
      "ti yattha vasāmi, taṃ ekaṃyeva nagaraṃ hoti, avasesesu puttadhītādayo ceva dāsamanussā ca vasiṃsu. Pāsādakūṭāgāresupi eseva nayo. Pallaṅkādīsupi ekaṃyeva pallaṅkaṃ paribhuñjati, sesā puttādīnaṃ paribhogā honti. Itthīsupi ekāva paccupaṭṭhāti, sesā parivāramattā honti, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paridahāmī"
      },
      "ti ekameva dussayugaṃ nivāsemi, sesāni parivāretvā vicarantānaṃ asītisahassādhikānaṃ soḷasannaṃ purisasatasahassānaṃ honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhuñjāmī"
      },
      "ti paramappamāṇena nāḷikodanamattaṃ bhuñjāmi, sesaṃ parivāretvā vicarantānaṃ cattālīsasahassādhikānaṃ aṭṭhannaṃ purisasatasahassānaṃ hotīti dasseti. Ekathālipāko hi dasannaṃ janānaṃ pahoti."
    ],
    "innerText": "271.Yaṃ tena samayena ajjhāvasāmīti yattha vasāmi, taṃ ekaṃyeva nagaraṃ hoti, avasesesu puttadhītādayo ceva dāsamanussā ca vasiṃsu. Pāsādakūṭāgāresupi eseva nayo. Pallaṅkādīsupi ekaṃyeva pallaṅkaṃ paribhuñjati, sesā puttādīnaṃ paribhogā honti. Itthīsupi ekāva paccupaṭṭhāti, sesā parivāramattā honti, paridahāmīti ekameva dussayugaṃ nivāsemi, sesāni parivāretvā vicarantānaṃ asītisahassādhikānaṃ soḷasannaṃ purisasatasahassānaṃ honti. Bhuñjāmīti paramappamāṇena nāḷikodanamattaṃ bhuñjāmi, sesaṃ parivāretvā vicarantānaṃ cattālīsasahassādhikānaṃ aṭṭhannaṃ purisasatasahassānaṃ hotīti dasseti. Ekathālipāko hi dasannaṃ janānaṃ pahoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Etāni pana caturāsīti nagarasahassāni ceva pāsādasahassāni ca kūṭāgārasahassāni ca ekissāyeva paṇṇasālāya nissandena nibbattāni. Caturāsīti pallaṅkasahassāni nipajjanatthāya dinnamañcakassa nissandena nibbattāni. Caturāsīti hatthisahassāni assasahassāni rathasahassāni nisīdanatthāya dinnapīṭhassa nissandena nibbattāni. Caturāsīti maṇisahassāni ekadīpassa nissandena nibbattāni. Caturāsīti pokkharaṇīsahassāni ekapokkharaṇiyā nissandena nibbattāni. Caturāsīti itthisahassāni puttasahassāni gahapatisahassāni paribhogabhājanapattathālaka dhamakaraṇa parissāvana ārakaṇṭaka pipphalaka nakhacchedana kuñcikakaṇṇamalaharaṇī pādakathalika upāhana chatta kattarayaṭṭhidānassa nissandena nibbattāni. Caturāsīti dhenusahassāni gorasadānassa nissandena nibbattāni. Caturāsīti vatthakoṭisahassāni ",
      " nivāsanapārupanadānassa nissandena nibbattāni ",
      ". Caturāsīti thālipākasahassāni bhojanadānassa nissandena nibbattānīti veditabbāni."
    ],
    "innerText": "Etāni pana caturāsīti nagarasahassāni ceva pāsādasahassāni ca kūṭāgārasahassāni ca ekissāyeva paṇṇasālāya nissandena nibbattāni. Caturāsīti pallaṅkasahassāni nipajjanatthāya dinnamañcakassa nissandena nibbattāni. Caturāsīti hatthisahassāni assasahassāni rathasahassāni nisīdanatthāya dinnapīṭhassa nissandena nibbattāni. Caturāsīti maṇisahassāni ekadīpassa nissandena nibbattāni. Caturāsīti pokkharaṇīsahassāni ekapokkharaṇiyā nissandena nibbattāni. Caturāsīti itthisahassāni puttasahassāni gahapatisahassāni paribhogabhājanapattathālaka dhamakaraṇa parissāvana ārakaṇṭaka pipphalaka nakhacchedana kuñcikakaṇṇamalaharaṇī pādakathalika upāhana chatta kattarayaṭṭhidānassa nissandena nibbattāni. Caturāsīti dhenusahassāni gorasadānassa nissandena nibbattāni. Caturāsīti vatthakoṭisahassāni nivāsanapārupanadānassa nissandena nibbattāni . Caturāsīti thālipākasahassāni bhojanadānassa nissandena nibbattānīti veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "272"
      },
      ". Evaṃ bhagavā mahāsudassanassa sampattiṃ ādito paṭṭhāya vitthārena kathetvā sabbaṃ taṃ dārakānaṃ paṃsvāgārakīḷanaṃ ",
      " viya dassento parinibbānamañcake nipannova ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "passānandā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipariṇatā"
      },
      "ti pakativijahanena nibbutapadīpo viya apaññattikabhāvaṃ gatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ aniccā kho, ānanda, saṅkhārā"
      },
      "ti evaṃ hutvā abhāvaṭṭhena aniccā."
    ],
    "innerText": "272. Evaṃ bhagavā mahāsudassanassa sampattiṃ ādito paṭṭhāya vitthārena kathetvā sabbaṃ taṃ dārakānaṃ paṃsvāgārakīḷanaṃ viya dassento parinibbānamañcake nipannova passānandātiādimāha. Tattha vipariṇatāti pakativijahanena nibbutapadīpo viya apaññattikabhāvaṃ gatā. Evaṃ aniccā kho, ānanda, saṅkhārāti evaṃ hutvā abhāvaṭṭhena aniccā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettāvatā bhagavā yathā nāma puriso satahatthubbedhe campakarukkhe nisseṇiṃ bandhitvā abhiruhitvā campakapupphaṃ ādāya nisseṇiṃ muñcanto otareyya, evameva nisseṇiṃ bandhanto viya anekavassakoṭisatasahassubbedhaṃ mahāsudassanasampattiṃ āruyha sampattimatthake ṭhitaṃ aniccalakkhaṇaṃ ādāya nisseṇiṃ muñcanto viya otiṇṇo. Teneva pubbe vasabharājā dīghabhāṇakattherānaṃ lohapāsādassa pācīnapasse ambalaṭṭhikāyaṃ imaṃ suttaṃ sajjhāyantānaṃ sutvā – ‘‘kiṃ, bho, mayhaṃ ayyakena ettha vuttaṃ, attano khāditapītaṭṭhāne sampattimeva kathetī’’ti cintento – ‘‘evaṃ aniccā kho, ānanda, saṅkhārā’’ti vuttakāle ‘‘imaṃ, bho, disvā pañcahi cakkhūhi cakkhumatā evaṃ vutta’’nti vāmahatthaṃ samiñjitvā dakkhiṇahatthena apphoṭetvā – ‘‘sādhu sādhū’’ti tuṭṭhahadayo sādhukāraṃ adāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ addhuvā"
      },
      "ti evaṃ udakapupphuḷādayo viya dhuvabhāvavirahitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ anassāsikā"
      },
      "ti evaṃ supinake pītapānīyaṃ viya anulittacandanaṃ viya ca assāsavirahitā."
    ],
    "innerText": "Evaṃ addhuvāti evaṃ udakapupphuḷādayo viya dhuvabhāvavirahitā. Evaṃ anassāsikāti evaṃ supinake pītapānīyaṃ viya anulittacandanaṃ viya ca assāsavirahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sarīraṃ nikkhipeyyā"
      },
      "ti sarīraṃ chaḍḍeyya. Idāni aññassa sarīrassa nikkhepo vā paṭijagganaṃ vā natthi kilesapahīnattā, ānanda, tathāgatassāti vadati. Idaṃ pana vatvā puna theraṃ āmantesi, cakkavattino ānubhāvo nāma rañño pabbajitassa sattame divase antaradhāyati. Mahāsudassanassa pana kālaṅkiriyato sattameva divase sattaratanapākārā sattaratanatālā caturāsīti pokkharaṇīsahassāni dhammapāsādo dhammapokkharaṇī cakkaratananti sabbametaṃ antaradhāyīti. Hatthiādīsu pana ayaṃ dhammatā khīṇāyukā saheva kālaṅkaronti. Āyusese ",
      " sati hatthiratanaṃ uposathakulaṃ gacchati, assaratanaṃ valāhakakulaṃ, maṇiratanaṃ vepullapabbatameva ",
      " gacchati. Itthiratanassa ",
      " ānubhāvo antaradhāyati. Gahapatiratanassa cakkhu pākatikameva hoti. Pariṇāyakaratanassa veyyattiyaṃ nassati."
    ],
    "innerText": "Sarīraṃ nikkhipeyyāti sarīraṃ chaḍḍeyya. Idāni aññassa sarīrassa nikkhepo vā paṭijagganaṃ vā natthi kilesapahīnattā, ānanda, tathāgatassāti vadati. Idaṃ pana vatvā puna theraṃ āmantesi, cakkavattino ānubhāvo nāma rañño pabbajitassa sattame divase antaradhāyati. Mahāsudassanassa pana kālaṅkiriyato sattameva divase sattaratanapākārā sattaratanatālā caturāsīti pokkharaṇīsahassāni dhammapāsādo dhammapokkharaṇī cakkaratananti sabbametaṃ antaradhāyīti. Hatthiādīsu pana ayaṃ dhammatā khīṇāyukā saheva kālaṅkaronti. Āyusese sati hatthiratanaṃ uposathakulaṃ gacchati, assaratanaṃ valāhakakulaṃ, maṇiratanaṃ vepullapabbatameva gacchati. Itthiratanassa ānubhāvo antaradhāyati. Gahapatiratanassa cakkhu pākatikameva hoti. Pariṇāyakaratanassa veyyattiyaṃ nassati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idamavoca bhagavā"
      },
      "ti idaṃ pāḷiyaṃ āruḷhañca anāruḷhañca sabbaṃ bhagavā avoca. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "Idamavoca bhagavāti idaṃ pāḷiyaṃ āruḷhañca anāruḷhañca sabbaṃ bhagavā avoca. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti sumaṅgalavilāsiniyā dīghanikāyaṭṭhakathāyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahāsudassanasuttavaṇṇanā niṭṭhitā."
  }
]