[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "7. Lakkhaṇasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dvattiṃsamahāpurisalakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "199"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti lakkhaṇasuttaṃ. Tatrāyamanuttānapadavaṇṇanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvattiṃsimānī"
      },
      "ti dvattiṃsa imāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāpurisalakkhaṇānī"
      },
      "ti mahāpurisabyañjanāni mahāpurisanimittāni ‘‘ayaṃ mahāpuriso’’ti sañjānanakāraṇāni. ‘‘Yehi samannāgatassa mahāpurisassā’’tiādi mahāpadāne vitthāritanayeneva veditabbaṃ."
    ],
    "innerText": "199.Evaṃme sutanti lakkhaṇasuttaṃ. Tatrāyamanuttānapadavaṇṇanā. Dvattiṃsimānīti dvattiṃsa imāni. Mahāpurisalakkhaṇānīti mahāpurisabyañjanāni mahāpurisanimittāni ‘‘ayaṃ mahāpuriso’’ti sañjānanakāraṇāni. ‘‘Yehi samannāgatassa mahāpurisassā’’tiādi mahāpadāne vitthāritanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Bāhirakāpi isayo dhārenti, no ca kho jānanti ‘imassa kammassa katattā imaṃ lakkhaṇaṃ paṭilabhatī’ti’’ kasmā āha? Aṭṭhuppattiyā anurūpattā. Idañhi suttaṃ saaṭṭhuppattikaṃ. Sā panassa aṭṭhuppatti kattha samuṭṭhitā? Antogāme manussānaṃ antare. Tadā kira sāvatthivāsino attano attano gehesu ca gehadvāresu ca santhāgārādīsu ca nisīditvā kathaṃ samuṭṭhāpesuṃ – ‘‘bhagavato asītianubyañjanāni byāmappabhā dvattiṃsamahāpurisalakkhaṇāni, yehi ca bhagavato kāyo, sabbaphāliphullo viya pāricchattako, vikasitamiva kamalavanaṃ, nānāratanavicittaṃ viya suvaṇṇatoraṇaṃ, tārāmaricivirocamiva gaganatalaṃ, ito cito ca vidhāvamānā vipphandamānā chabbaṇṇarasmiyo muñcanto ativiya sobhati. Bhagavato ca iminā nāma kammena idaṃ lakkhaṇaṃ nibbattanti kathitaṃ natthi, yāguuḷuṅkamattampi pana kaṭacchubhattamattaṃ vā pubbe dinnapaccayā evaṃ uppajjatīti bhagavatā vuttaṃ. Kiṃ nu kho satthā kammaṃ akāsi, yenassa imāni lakkhaṇāni nibbattantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athāyasmā ānando antogāme caranto imaṃ kathāsallāpaṃ sutvā katabhattakicco vihāraṃ āgantvā satthu vattaṃ katvā vanditvā ṭhito ‘‘mayā, bhante, antogāme ekā kathā sutā’’ti āha. Tato ",
      " bhagavatā ‘‘kiṃ te, ānanda, suta’’nti vutte sabbaṃ ārocesi. Satthā therassa vacanaṃ ",
      " sutvā parivāretvā nisinne bhikkhū āmantetvā ‘‘dvattiṃsimāni, bhikkhave, mahāpurisassa mahāpurisalakkhaṇānī’’ti paṭipāṭiyā lakkhaṇāni dassetvā yena kammena yaṃ nibbattaṃ, tassa dassanatthaṃ evamāha."
    ],
    "innerText": "Athāyasmā ānando antogāme caranto imaṃ kathāsallāpaṃ sutvā katabhattakicco vihāraṃ āgantvā satthu vattaṃ katvā vanditvā ṭhito ‘‘mayā, bhante, antogāme ekā kathā sutā’’ti āha. Tato bhagavatā ‘‘kiṃ te, ānanda, suta’’nti vutte sabbaṃ ārocesi. Satthā therassa vacanaṃ sutvā parivāretvā nisinne bhikkhū āmantetvā ‘‘dvattiṃsimāni, bhikkhave, mahāpurisassa mahāpurisalakkhaṇānī’’ti paṭipāṭiyā lakkhaṇāni dassetvā yena kammena yaṃ nibbattaṃ, tassa dassanatthaṃ evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Suppatiṭṭhitapādatālakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "201"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purimaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jāti"
      },
      "ntiādīsu pubbe nivutthakkhandhā jātavasena ‘‘jātī’’ti vuttā. Tathā bhavanavasena ‘‘bhavo’’ti, nivutthavasena ālayaṭṭhena vā ‘‘niketo’’ti. Tiṇṇampi padānaṃ pubbe nivutthakkhandhasantāne ṭhitoti attho. Idāni yasmā taṃ khandhasantānaṃ devalokādīsupi vattati. Lakkhaṇanibbattanasamatthaṃ pana kusalakammaṃ tattha na sukaraṃ, manussabhūtasseva sukaraṃ. Tasmā yathābhūtena yaṃ kammaṃ kataṃ, taṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pubbe manussabhūto samāno"
      },
      "ti āha. Akāraṇaṃ vā etaṃ. Hatthiassamigamahiṃsavānarādibhūtopi mahāpuriso pāramiyo pūretiyeva. Yasmā pana evarūpe attabhāve ṭhitena katakammaṃ na sakkā sukhena dīpetuṃ, manussabhāve ṭhitena katakammaṃ pana sakkā sukhena dīpetuṃ. Tasmā ‘‘pubbe manussabhūto samāno’’ti āha."
    ],
    "innerText": "201.Purimaṃjātintiādīsu pubbe nivutthakkhandhā jātavasena ‘‘jātī’’ti vuttā. Tathā bhavanavasena ‘‘bhavo’’ti, nivutthavasena ālayaṭṭhena vā ‘‘niketo’’ti. Tiṇṇampi padānaṃ pubbe nivutthakkhandhasantāne ṭhitoti attho. Idāni yasmā taṃ khandhasantānaṃ devalokādīsupi vattati. Lakkhaṇanibbattanasamatthaṃ pana kusalakammaṃ tattha na sukaraṃ, manussabhūtasseva sukaraṃ. Tasmā yathābhūtena yaṃ kammaṃ kataṃ, taṃ dassento pubbe manussabhūto samānoti āha. Akāraṇaṃ vā etaṃ. Hatthiassamigamahiṃsavānarādibhūtopi mahāpuriso pāramiyo pūretiyeva. Yasmā pana evarūpe attabhāve ṭhitena katakammaṃ na sakkā sukhena dīpetuṃ, manussabhāve ṭhitena katakammaṃ pana sakkā sukhena dīpetuṃ. Tasmā ‘‘pubbe manussabhūto samāno’’ti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Daḷhasamādāno"
      },
      "ti thiragahaṇo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalesu dhammesū"
      },
      "ti dasakusalakammapathesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avatthitasamādāno"
      },
      "ti niccalagahaṇo anivattitagahaṇo. Mahāsattassa hi akusalakammato aggiṃ patvā kukkuṭapattaṃ viya cittaṃ paṭikuṭati, kusalaṃ patvā vitānaṃ viya pasāriyati. Tasmā daḷhasamādāno hoti avatthitasamādāno. Na sakkā kenaci samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kusalasamādānaṃ vissajjāpetuṃ."
    ],
    "innerText": "Daḷhasamādānoti thiragahaṇo. Kusalesu dhammesūti dasakusalakammapathesu. Avatthitasamādānoti niccalagahaṇo anivattitagahaṇo. Mahāsattassa hi akusalakammato aggiṃ patvā kukkuṭapattaṃ viya cittaṃ paṭikuṭati, kusalaṃ patvā vitānaṃ viya pasāriyati. Tasmā daḷhasamādāno hoti avatthitasamādāno. Na sakkā kenaci samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kusalasamādānaṃ vissajjāpetuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrimāni vatthūni – pubbe kira mahāpuriso kalandakayoniyaṃ nibbatti. Atha deve vuṭṭhe ogho āgantvā kulāvakaṃ gahetvā samuddameva pavesesi. Mahāpuriso ‘‘puttake nīharissāmī’’ti naṅguṭṭhaṃ temetvā temetvā samuddato udakaṃ bahi khipi. Sattame divase sakko āvajjitvā tattha āgamma ‘‘kiṃ karosī’’ti pucchi? So tassa ārocesi. Sakko mahāsamuddato udakassa dunnīharaṇīyabhāvaṃ kathesi. Bodhisatto ",
      " tādisena kusītena saddhiṃ kathetumpi na vaṭṭati. ‘‘Mā idha tiṭṭhā’’ti apasāresi. Sakko ‘‘anomapurisena gahitagahaṇaṃ na sakkā vissajjāpetu’’nti tuṭṭho tassa puttake ānetvā adāsi. Mahājanakakālepi mahāsamuddaṃ taramāno ‘‘kasmā mahāsamuddaṃ tarasī’’ti devatāya puṭṭho ‘‘pāraṃ gantvā kulasantake raṭṭhe rajjaṃ gahetvā dānaṃ dātuṃ tarāmī’’ti āha. Tato devatāya – ‘‘ayaṃ mahāsamuddo gambhīro ",
      " ceva puthulo ca, kadā naṃ tarissatī’’ti vutte so āha ‘‘taveso mahāsamuddasadiso, mayhaṃ pana ajjhāsayaṃ āgamma khuddakamātikā viya khāyati. Tvaṃyeva maṃ dakkhissasi samuddaṃ taritvā samuddapārato dhanaṃ āharitvā kulasantakaṃ rajjaṃ gahetvā dānaṃ dadamāna’’nti. Devatā ‘‘anomapurisena gahitagahaṇaṃ na sakkā vissajjāpetu’’nti bodhisattaṃ āliṅgetvā haritvā uyyāne nipajjāpesi. So chattaṃ ussāpetvā divase divase pañcasatasahassapariccāgaṃ katvā aparabhāge nikkhamma pabbajito. Evaṃ mahāsatto na sakkā kenaci samaṇena vā…pe… brahmunā vā kusalasamādānaṃ vissajjāpetuṃ. Tena vuttaṃ – ‘‘daḷhasamādāno ahosi kusalesu dhammesu avatthitasamādāno’’ti."
    ],
    "innerText": "Tatrimāni vatthūni – pubbe kira mahāpuriso kalandakayoniyaṃ nibbatti. Atha deve vuṭṭhe ogho āgantvā kulāvakaṃ gahetvā samuddameva pavesesi. Mahāpuriso ‘‘puttake nīharissāmī’’ti naṅguṭṭhaṃ temetvā temetvā samuddato udakaṃ bahi khipi. Sattame divase sakko āvajjitvā tattha āgamma ‘‘kiṃ karosī’’ti pucchi? So tassa ārocesi. Sakko mahāsamuddato udakassa dunnīharaṇīyabhāvaṃ kathesi. Bodhisatto tādisena kusītena saddhiṃ kathetumpi na vaṭṭati. ‘‘Mā idha tiṭṭhā’’ti apasāresi. Sakko ‘‘anomapurisena gahitagahaṇaṃ na sakkā vissajjāpetu’’nti tuṭṭho tassa puttake ānetvā adāsi. Mahājanakakālepi mahāsamuddaṃ taramāno ‘‘kasmā mahāsamuddaṃ tarasī’’ti devatāya puṭṭho ‘‘pāraṃ gantvā kulasantake raṭṭhe rajjaṃ gahetvā dānaṃ dātuṃ tarāmī’’ti āha. Tato devatāya – ‘‘ayaṃ mahāsamuddo gambhīro ceva puthulo ca, kadā naṃ tarissatī’’ti vutte so āha ‘‘taveso mahāsamuddasadiso, mayhaṃ pana ajjhāsayaṃ āgamma khuddakamātikā viya khāyati. Tvaṃyeva maṃ dakkhissasi samuddaṃ taritvā samuddapārato dhanaṃ āharitvā kulasantakaṃ rajjaṃ gahetvā dānaṃ dadamāna’’nti. Devatā ‘‘anomapurisena gahitagahaṇaṃ na sakkā vissajjāpetu’’nti bodhisattaṃ āliṅgetvā haritvā uyyāne nipajjāpesi. So chattaṃ ussāpetvā divase divase pañcasatasahassapariccāgaṃ katvā aparabhāge nikkhamma pabbajito. Evaṃ mahāsatto na sakkā kenaci samaṇena vā…pe… brahmunā vā kusalasamādānaṃ vissajjāpetuṃ. Tena vuttaṃ – ‘‘daḷhasamādāno ahosi kusalesu dhammesu avatthitasamādāno’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni yesu kusalesu dhammesu avatthitasamādāno ahosi, te dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyasucarite"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dānasaṃvibhāge"
      },
      "ti ettha ca dānameva diyyanavasena dānaṃ, saṃvibhāgakaraṇavasena saṃvibhāgo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlasamādāne"
      },
      "ti pañcasīladasasīlacatupārisuddhisīlapūraṇakāle. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uposathūpavāse"
      },
      "ti cātuddasikādibhedassa uposathassa upavasanakāle. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Matteyyatāyā"
      },
      "ti mātukātabbavatte. Sesapadesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññataraññataresu cā"
      },
      "ti aññesu ca evarūpesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhikusalesū"
      },
      "ti ettha atthi kusalā, atthi adhikusalā. Sabbepi kāmāvacarā kusalā kusalā nāma, rūpāvacarā adhikusalā. Ubhopi te kusalā nāma, arūpāvacarā adhikusalā. Sabbepi te kusalā ",
      " nāma, sāvakapāramīpaṭilābhapaccayā kusalā adhikusalā nāma. Tepi kusalā nāma, paccekabodhipaṭilābhapaccayā kusalā adhikusalā. Tepi kusalā nāma, sabbaññutaññāṇappaṭilābhapaccayā pana kusalā idha ‘‘adhikusalā’’ti adhippetā. Tesu adhikusalesu dhammesu daḷhasamādāno ahosi avatthitasamādāno."
    ],
    "innerText": "Idāni yesu kusalesu dhammesu avatthitasamādāno ahosi, te dassetuṃ kāyasucaritetiādimāha. Dānasaṃvibhāgeti ettha ca dānameva diyyanavasena dānaṃ, saṃvibhāgakaraṇavasena saṃvibhāgo. Sīlasamādāneti pañcasīladasasīlacatupārisuddhisīlapūraṇakāle. Uposathūpavāseti cātuddasikādibhedassa uposathassa upavasanakāle. Matteyyatāyāti mātukātabbavatte. Sesapadesupi eseva nayo. Aññataraññataresu cāti aññesu ca evarūpesu. Adhikusalesūti ettha atthi kusalā, atthi adhikusalā. Sabbepi kāmāvacarā kusalā kusalā nāma, rūpāvacarā adhikusalā. Ubhopi te kusalā nāma, arūpāvacarā adhikusalā. Sabbepi te kusalā nāma, sāvakapāramīpaṭilābhapaccayā kusalā adhikusalā nāma. Tepi kusalā nāma, paccekabodhipaṭilābhapaccayā kusalā adhikusalā. Tepi kusalā nāma, sabbaññutaññāṇappaṭilābhapaccayā pana kusalā idha ‘‘adhikusalā’’ti adhippetā. Tesu adhikusalesu dhammesu daḷhasamādāno ahosi avatthitasamādāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṭattā upacitattā"
      },
      "ti ettha sakimpi kataṃ katameva, abhiṇhakaraṇena pana upacitaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ussannattā"
      },
      "ti piṇḍīkataṃ rāsīkataṃ kammaṃ ussannanti vuccati. Tasmā ‘‘ussannattā’’ti vadanto mayā katakammassa cakkavāḷaṃ atisambādhaṃ, bhavaggaṃ atinīcaṃ, evaṃ me ussannaṃ kammanti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipulattā"
      },
      "ti appamāṇattā. Iminā ‘‘anantaṃ aparimāṇaṃ mayā kataṃ kamma’’nti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhiggaṇhātī"
      },
      "ti ",
      " adhibhavati, aññehi devehi atirekaṃ labhatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭilabhatī"
      },
      "ti adhigacchati."
    ],
    "innerText": "Kaṭattā upacitattāti ettha sakimpi kataṃ katameva, abhiṇhakaraṇena pana upacitaṃ hoti. Ussannattāti piṇḍīkataṃ rāsīkataṃ kammaṃ ussannanti vuccati. Tasmā ‘‘ussannattā’’ti vadanto mayā katakammassa cakkavāḷaṃ atisambādhaṃ, bhavaggaṃ atinīcaṃ, evaṃ me ussannaṃ kammanti dasseti. Vipulattāti appamāṇattā. Iminā ‘‘anantaṃ aparimāṇaṃ mayā kataṃ kamma’’nti dasseti. Adhiggaṇhātīti adhibhavati, aññehi devehi atirekaṃ labhatīti attho. Paṭilabhatīti adhigacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbāvantehi pādatalehī"
      },
      "ti idaṃ ‘‘samaṃ pādaṃ bhūmiyaṃ nikkhipatī’’ti etassa vitthāravacanaṃ. Tattha sabbāvantehīti sabbapadesavantehi, na ekena padesena paṭhamaṃ phusati, na ekena ",
      " pacchā, sabbeheva pādatalehi samaṃ phusati, samaṃ uddharati. Sacepi hi tathāgato ‘‘anekasataporisaṃ narakaṃ akkamissāmī’’ti pādaṃ abhinīharati. Tāvadeva ninnaṭṭhānaṃ vātapūritā viya kammārabhastā unnamitvā pathavisamaṃ hoti. Unnataṭṭhānampi anto pavisati. ‘‘Dūre akkamissāmī’’ti abhinīharantassa sineruppamāṇopi pabbato suseditavettaṅkuro viya onamitvā pādasamīpaṃ āgacchati. Tathā hissa yamakapāṭihāriyaṃ katvā ‘‘yugandharapabbataṃ akkamissāmī’’ti pāde abhinīhaṭe pabbato onamitvā pādasamīpaṃ āgato. Sopi taṃ akkamitvā dutiyapādena tāvatiṃsabhavanaṃ akkami. Na hi cakkalakkhaṇena patiṭṭhātabbaṭṭhānaṃ visamaṃ bhavituṃ sakkoti. Khāṇu vā kaṇṭako vā sakkharā vā kathalā vā uccārapassāvakheḷasiṅghāṇikādīni vā purimataraṃ vā apagacchanti, tattha tattheva vā pathaviṃ pavisanti. Tathāgatassa hi sīlatejena puññatejena dhammatejena dasannaṃ pāramīnaṃ ",
      " ānubhāvena ayaṃ mahāpathavī sammā mudupupphābhikiṇṇā hoti."
    ],
    "innerText": "Sabbāvantehi pādatalehīti idaṃ ‘‘samaṃ pādaṃ bhūmiyaṃ nikkhipatī’’ti etassa vitthāravacanaṃ. Tattha sabbāvantehīti sabbapadesavantehi, na ekena padesena paṭhamaṃ phusati, na ekena pacchā, sabbeheva pādatalehi samaṃ phusati, samaṃ uddharati. Sacepi hi tathāgato ‘‘anekasataporisaṃ narakaṃ akkamissāmī’’ti pādaṃ abhinīharati. Tāvadeva ninnaṭṭhānaṃ vātapūritā viya kammārabhastā unnamitvā pathavisamaṃ hoti. Unnataṭṭhānampi anto pavisati. ‘‘Dūre akkamissāmī’’ti abhinīharantassa sineruppamāṇopi pabbato suseditavettaṅkuro viya onamitvā pādasamīpaṃ āgacchati. Tathā hissa yamakapāṭihāriyaṃ katvā ‘‘yugandharapabbataṃ akkamissāmī’’ti pāde abhinīhaṭe pabbato onamitvā pādasamīpaṃ āgato. Sopi taṃ akkamitvā dutiyapādena tāvatiṃsabhavanaṃ akkami. Na hi cakkalakkhaṇena patiṭṭhātabbaṭṭhānaṃ visamaṃ bhavituṃ sakkoti. Khāṇu vā kaṇṭako vā sakkharā vā kathalā vā uccārapassāvakheḷasiṅghāṇikādīni vā purimataraṃ vā apagacchanti, tattha tattheva vā pathaviṃ pavisanti. Tathāgatassa hi sīlatejena puññatejena dhammatejena dasannaṃ pāramīnaṃ ānubhāvena ayaṃ mahāpathavī sammā mudupupphābhikiṇṇā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "202"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāgarapariyanta"
      },
      "nti sāgarasīmaṃ. Na hi tassa rajjaṃ karontassa antarā rukkho vā pabbato vā nadī vā sīmā hoti mahāsamuddova sīmā. Tena vuttaṃ ‘‘sāgarapariyanta’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akhilamanimittamakaṇṭaka"
      },
      "nti niccoraṃ. Corā hi kharasamphassaṭṭhena khilā, upaddavapaccayaṭṭhena nimittā, vijjhanaṭṭhena kaṇṭakāti vuccanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddha"
      },
      "nti samiddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phīta"
      },
      "nti sabbasampattiphāliphullaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khema"
      },
      "nti nibbhayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siva"
      },
      "nti nirupaddavaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nirabbuda"
      },
      "nti abbudavirahitaṃ, gumbaṃ gumbaṃ hutvā carantehi corehi virahitanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akkhambhiyo"
      },
      "ti avikkhambhanīyo. Na naṃ koci ṭhānato cāletuṃ sakkoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccatthikenā"
      },
      "ti paṭipakkhaṃ icchantena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccāmittenā"
      },
      "ti paṭiviruddhena amittena. Ubhayampetaṃ sapattavevacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abbhantarehī"
      },
      "ti anto uṭṭhitehi rāgādīhi."
    ],
    "innerText": "202.Sāgarapariyantanti sāgarasīmaṃ. Na hi tassa rajjaṃ karontassa antarā rukkho vā pabbato vā nadī vā sīmā hoti mahāsamuddova sīmā. Tena vuttaṃ ‘‘sāgarapariyanta’’nti. Akhilamanimittamakaṇṭakanti niccoraṃ. Corā hi kharasamphassaṭṭhena khilā, upaddavapaccayaṭṭhena nimittā, vijjhanaṭṭhena kaṇṭakāti vuccanti. Iddhanti samiddhaṃ. Phītanti sabbasampattiphāliphullaṃ. Khemanti nibbhayaṃ. Sivanti nirupaddavaṃ. Nirabbudanti abbudavirahitaṃ, gumbaṃ gumbaṃ hutvā carantehi corehi virahitanti attho. Akkhambhiyoti avikkhambhanīyo. Na naṃ koci ṭhānato cāletuṃ sakkoti. Paccatthikenāti paṭipakkhaṃ icchantena. Paccāmittenāti paṭiviruddhena amittena. Ubhayampetaṃ sapattavevacanaṃ. Abbhantarehīti anto uṭṭhitehi rāgādīhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bāhirehī"
      },
      "ti ",
      " samaṇādīhi. Tathā hi naṃ bāhirā devadattakokālikādayo samaṇāpi soṇadaṇḍakūṭadaṇḍādayo brāhmaṇāpi sakkasadisā devatāpi satta vassāni anubandhamāno māropi bakādayo brahmānopi vikkhambhetuṃ nāsakkhiṃsu."
    ],
    "innerText": "Bāhirehīti samaṇādīhi. Tathā hi naṃ bāhirā devadattakokālikādayo samaṇāpi soṇadaṇḍakūṭadaṇḍādayo brāhmaṇāpi sakkasadisā devatāpi satta vassāni anubandhamāno māropi bakādayo brahmānopi vikkhambhetuṃ nāsakkhiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā bhagavatā kammañca kammasarikkhakañca lakkhaṇañca lakkhaṇānisaṃso ca vutto hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammaṃ"
      },
      " nāma satasahassakappādhikāni cattāri asaṅkhyeyyāni daḷhavīriyena hutvā kataṃ kammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma daḷhena hutvā katabhāvaṃ sadevako loko jānātūti suppatiṭṭhitapādamahāpurisalakkhaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma suppatiṭṭhitapādatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇānisaṃso"
      },
      " nāma paccatthikehi avikkhambhanīyatā."
    ],
    "innerText": "Ettāvatā bhagavatā kammañca kammasarikkhakañca lakkhaṇañca lakkhaṇānisaṃso ca vutto hoti. Kammaṃ nāma satasahassakappādhikāni cattāri asaṅkhyeyyāni daḷhavīriyena hutvā kataṃ kammaṃ. Kammasarikkhakaṃ nāma daḷhena hutvā katabhāvaṃ sadevako loko jānātūti suppatiṭṭhitapādamahāpurisalakkhaṇaṃ. Lakkhaṇaṃ nāma suppatiṭṭhitapādatā. Lakkhaṇānisaṃso nāma paccatthikehi avikkhambhanīyatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "203"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthetaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuccatī"
      },
      "ti tattha vutte kammādibhede aparampi idaṃ vuccati, gāthābandhaṃ sandhāya vuttaṃ. Etā pana gāthā porāṇakattherā ‘‘ānandattherena ṭhapitā vaṇṇanāgāthā’’ti vatvā gatā. Aparabhāge therā ‘‘ekapadiko atthuddhāro’’ti āhaṃsu."
    ],
    "innerText": "203.Tatthetaṃvuccatīti tattha vutte kammādibhede aparampi idaṃ vuccati, gāthābandhaṃ sandhāya vuttaṃ. Etā pana gāthā porāṇakattherā ‘‘ānandattherena ṭhapitā vaṇṇanāgāthā’’ti vatvā gatā. Aparabhāge therā ‘‘ekapadiko atthuddhāro’’ti āhaṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sacce"
      },
      "ti vacīsacce. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhamme"
      },
      "ti dasakusalakammapathadhamme. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dame"
      },
      "ti indriyadamane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃyame"
      },
      "ti sīlasaṃyame. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Soceyyasīlālayuposathesu cā’’"
      },
      "ti ettha kāyasoceyyādi tividhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "soceyyaṃ."
      },
      " Ālayabhūtaṃ sīlameva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīlālayo."
      },
      " Uposathakammaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uposatho. Ahiṃsāyā"
      },
      "ti avihiṃsāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samattamācarī"
      },
      "ti sakalaṃ acari."
    ],
    "innerText": "Tattha sacceti vacīsacce. Dhammeti dasakusalakammapathadhamme. Dameti indriyadamane. Saṃyameti sīlasaṃyame. ‘‘Soceyyasīlālayuposathesu cā’’ti ettha kāyasoceyyādi tividhaṃ soceyyaṃ. Ālayabhūtaṃ sīlameva sīlālayo. Uposathakammaṃ uposatho. Ahiṃsāyāti avihiṃsāya. Samattamācarīti sakalaṃ acari."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anvabhī"
      },
      "ti anubhavi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Veyyañjanikā"
      },
      "ti lakkhaṇapāṭhakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parābhibhū"
      },
      "ti pare abhibhavanasamattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattubhī"
      },
      "ti sapattehi akkhambhiyo hoti."
    ],
    "innerText": "Anvabhīti anubhavi. Veyyañjanikāti lakkhaṇapāṭhakā. Parābhibhūti pare abhibhavanasamattho. Sattubhīti sapattehi akkhambhiyo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na so gacchati jātu khambhana"
      },
      "nti so ekaṃseneva aggapuggalo vikkhambhetabbataṃ na gacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Esā hi tassa dhammatā"
      },
      "ti tassa hi esā dhammatā ayaṃ sabhāvo."
    ],
    "innerText": "Na so gacchati jātu khambhananti so ekaṃseneva aggapuggalo vikkhambhetabbataṃ na gacchati. Esā hi tassa dhammatāti tassa hi esā dhammatā ayaṃ sabhāvo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pādatalacakkalakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "204"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubbegauttāsabhaya"
      },
      "nti ubbegabhayañceva uttāsabhayañca. Tattha corato vā rājato vā paccatthikato vā vilopanabandhanādinissayaṃ bhayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ubbego"
      },
      " nāma, taṃmuhuttikaṃ caṇḍahatthiassādīni vā ahiyakkhādayo vā paṭicca lomahaṃsanakaraṃ bhayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uttāsabhayaṃ"
      },
      " nāma. Taṃ sabbaṃ apanuditā ",
      " vūpasametā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃvidhātā"
      },
      "ti saṃvidahitā. Kathaṃ saṃvidahati? Aṭaviyaṃ sāsaṅkaṭṭhānesu dānasālaṃ kāretvā tattha āgate bhojetvā manusse datvā ativāheti, taṃ ṭhānaṃ pavisituṃ asakkontānaṃ manusse pesetvā paveseti. Nagarādīsupi tesu tesu ṭhānesu ārakkhaṃ ṭhapeti, evaṃ saṃvidahati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saparivārañca dānaṃ adāsī"
      },
      "ti annaṃ pānanti dasavidhaṃ dānavatthuṃ."
    ],
    "innerText": "204.Ubbegauttāsabhayanti ubbegabhayañceva uttāsabhayañca. Tattha corato vā rājato vā paccatthikato vā vilopanabandhanādinissayaṃ bhayaṃ ubbego nāma, taṃmuhuttikaṃ caṇḍahatthiassādīni vā ahiyakkhādayo vā paṭicca lomahaṃsanakaraṃ bhayaṃ uttāsabhayaṃ nāma. Taṃ sabbaṃ apanuditā vūpasametā. Saṃvidhātāti saṃvidahitā. Kathaṃ saṃvidahati? Aṭaviyaṃ sāsaṅkaṭṭhānesu dānasālaṃ kāretvā tattha āgate bhojetvā manusse datvā ativāheti, taṃ ṭhānaṃ pavisituṃ asakkontānaṃ manusse pesetvā paveseti. Nagarādīsupi tesu tesu ṭhānesu ārakkhaṃ ṭhapeti, evaṃ saṃvidahati. Saparivārañca dānaṃ adāsīti annaṃ pānanti dasavidhaṃ dānavatthuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anna"
      },
      "nti yāgubhattaṃ. Taṃ dadanto na dvāre ṭhapetvā adāsi, atha kho antonivesane haritupalittaṭṭhāne lājā ceva pupphāni ca vikiritvā āsanaṃ paññapetvā vitānaṃ bandhitvā gandhadhūmādīhi sakkāraṃ katvā bhikkhusaṅghaṃ nisīdāpetvā yāguṃ adāsi. Yāguṃ dento ca sabyañjanaṃ adāsi. Yāgupānāvasāne pāde dhovitvā telena makkhetvā nānappakārakaṃ anantaṃ khajjakaṃ datvā pariyosāne anekasūpaṃ anekabyañjanaṃ paṇītabhojanaṃ adāsi ",
      ". Pānaṃ dento ambapānādiaṭṭhavidhaṃ ",
      " pānaṃ adāsi, tampi yāgubhattaṃ datvā. Vatthaṃ dento na suddhavatthameva adāsi, ekapaṭṭadupaṭṭādipahonakaṃ pana datvā sucimpi adāsi, suttampi adāsi, suttaṃ vaṭṭesi, sūcikammakaraṇaṭṭhāne bhikkhūnaṃ āsanāni, yāgubhattaṃ, pādamakkhanaṃ, piṭṭhimakkhanaṃ, rajanaṃ, paṇḍupalāsaṃ, rajanadoṇikaṃ, antamaso cīvararajanakaṃ kappiyakārakampi adāsi."
    ],
    "innerText": "Tattha annanti yāgubhattaṃ. Taṃ dadanto na dvāre ṭhapetvā adāsi, atha kho antonivesane haritupalittaṭṭhāne lājā ceva pupphāni ca vikiritvā āsanaṃ paññapetvā vitānaṃ bandhitvā gandhadhūmādīhi sakkāraṃ katvā bhikkhusaṅghaṃ nisīdāpetvā yāguṃ adāsi. Yāguṃ dento ca sabyañjanaṃ adāsi. Yāgupānāvasāne pāde dhovitvā telena makkhetvā nānappakārakaṃ anantaṃ khajjakaṃ datvā pariyosāne anekasūpaṃ anekabyañjanaṃ paṇītabhojanaṃ adāsi . Pānaṃ dento ambapānādiaṭṭhavidhaṃ pānaṃ adāsi, tampi yāgubhattaṃ datvā. Vatthaṃ dento na suddhavatthameva adāsi, ekapaṭṭadupaṭṭādipahonakaṃ pana datvā sucimpi adāsi, suttampi adāsi, suttaṃ vaṭṭesi, sūcikammakaraṇaṭṭhāne bhikkhūnaṃ āsanāni, yāgubhattaṃ, pādamakkhanaṃ, piṭṭhimakkhanaṃ, rajanaṃ, paṇḍupalāsaṃ, rajanadoṇikaṃ, antamaso cīvararajanakaṃ kappiyakārakampi adāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāna"
      },
      "nti upāhanaṃ. Taṃ dadantopi upāhanatthavikaṃ upāhanadaṇḍakaṃ makkhanatelaṃ heṭṭhā vuttāni ca annādīni tasseva parivāraṃ katvā adāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mālaṃ"
      },
      " dentopi na suddhamālameva adāsi, atha kho naṃ gandhehi missetvā heṭṭhimāni cattāri tasseva parivāraṃ katvā adāsi. Bodhicetiyaāsanapotthakādipūjanatthāya ceva cetiyagharadhūpanatthāya ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gandhaṃ"
      },
      " dentopi na suddhagandhameva adāsi, gandhapisanakanisadāya ceva pakkhipanakabhājanena ca saddhiṃ heṭṭhimāni pañca tassa parivāraṃ katvā adāsi. Cetiyapūjādīnaṃ atthāya haritālamanosilācīnapiṭṭhādi",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vilepanaṃ"
      },
      " dentopi na suddhavilepanameva adāsi, vilepanabhājanena saddhiṃ heṭṭhimāni cha tassa parivāraṃ katvā adāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seyyā"
      },
      "ti mañcapīṭhaṃ. Taṃ dentopi na suddhakameva adāsi, kojavakambalapaccattharaṇamañcappaṭipādakehi saddhiṃ antamaso maṅgulasodhanadaṇḍakaṃ heṭṭhimāni ca satta tassa parivāraṃ katvā adāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvasathaṃ"
      },
      " dentopi na gehamattameva adāsi, atha kho naṃ mālākammalatākammapaṭimaṇḍitaṃ supaññattaṃ mañcapīṭhaṃ kāretvā heṭṭhimāni aṭṭha tassa parivāraṃ katvā adāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padīpeyya"
      },
      "nti padīpatelaṃ. Taṃ dento cetiyaṅgaṇe bodhiyaṅgaṇe dhammassavanagge vasanagehe potthakavācanaṭṭhāne iminā dīpaṃ jālāpethāti na suddhatelameva adāsi, vaṭṭi kapallakatelabhājanādīhi saddhiṃ heṭṭhimāni nava tassa parivāraṃ katvā adāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvibhattantarānī"
      },
      "ti suvibhattaantarāni."
    ],
    "innerText": "Yānanti upāhanaṃ. Taṃ dadantopi upāhanatthavikaṃ upāhanadaṇḍakaṃ makkhanatelaṃ heṭṭhā vuttāni ca annādīni tasseva parivāraṃ katvā adāsi. Mālaṃ dentopi na suddhamālameva adāsi, atha kho naṃ gandhehi missetvā heṭṭhimāni cattāri tasseva parivāraṃ katvā adāsi. Bodhicetiyaāsanapotthakādipūjanatthāya ceva cetiyagharadhūpanatthāya ca gandhaṃ dentopi na suddhagandhameva adāsi, gandhapisanakanisadāya ceva pakkhipanakabhājanena ca saddhiṃ heṭṭhimāni pañca tassa parivāraṃ katvā adāsi. Cetiyapūjādīnaṃ atthāya haritālamanosilācīnapiṭṭhādivilepanaṃ dentopi na suddhavilepanameva adāsi, vilepanabhājanena saddhiṃ heṭṭhimāni cha tassa parivāraṃ katvā adāsi. Seyyāti mañcapīṭhaṃ. Taṃ dentopi na suddhakameva adāsi, kojavakambalapaccattharaṇamañcappaṭipādakehi saddhiṃ antamaso maṅgulasodhanadaṇḍakaṃ heṭṭhimāni ca satta tassa parivāraṃ katvā adāsi. Āvasathaṃ dentopi na gehamattameva adāsi, atha kho naṃ mālākammalatākammapaṭimaṇḍitaṃ supaññattaṃ mañcapīṭhaṃ kāretvā heṭṭhimāni aṭṭha tassa parivāraṃ katvā adāsi. Padīpeyyanti padīpatelaṃ. Taṃ dento cetiyaṅgaṇe bodhiyaṅgaṇe dhammassavanagge vasanagehe potthakavācanaṭṭhāne iminā dīpaṃ jālāpethāti na suddhatelameva adāsi, vaṭṭi kapallakatelabhājanādīhi saddhiṃ heṭṭhimāni nava tassa parivāraṃ katvā adāsi. Suvibhattantarānīti suvibhattaantarāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājāno"
      },
      "ti abhisittā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhogiyā"
      },
      "ti bhojakā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kumārā"
      },
      "ti rājakumārā. Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma saparivāraṃ dānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma saparivāraṃ katvā dānaṃ adāsīti iminā kāraṇena sadevako loko jānātūti nibbattaṃ cakkalakkhaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma tadeva cakkalakkhaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ānisaṃso"
      },
      " mahāparivāratā."
    ],
    "innerText": "Rājānoti abhisittā. Bhogiyāti bhojakā kumārāti rājakumārā. Idha kammaṃ nāma saparivāraṃ dānaṃ. Kammasarikkhakaṃ nāma saparivāraṃ katvā dānaṃ adāsīti iminā kāraṇena sadevako loko jānātūti nibbattaṃ cakkalakkhaṇaṃ. Lakkhaṇaṃ nāma tadeva cakkalakkhaṇaṃ. Ānisaṃso mahāparivāratā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "205"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthetaṃ vuccatī"
      },
      "ti imā tadatthaparidīpanā gāthā vuccanti. Duvidhā hi gāthā honti – tadatthaparidīpanā ca visesatthaparidīpanā ca. Tattha pāḷiāgatameva atthaṃ paridīpanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tadatthaparidīpanā"
      },
      " nāma. Pāḷiyaṃ anāgataṃ paridīpanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visesatthaparidīpanā"
      },
      " nāma. Imā pana tadatthaparidīpanā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pure"
      },
      "ti pubbe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puratthā"
      },
      "ti tasseva vevacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purimāsu jātīsū"
      },
      "ti imissā jātiyā ",
      " pubbekatakammapaṭikkhepadīpanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubbegauttāsabhayāpanūdano"
      },
      "ti ubbegabhayassa ca uttāsabhayassa ca apanūdano. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ussuko"
      },
      "ti adhimutto."
    ],
    "innerText": "205.Tatthetaṃ vuccatīti imā tadatthaparidīpanā gāthā vuccanti. Duvidhā hi gāthā honti – tadatthaparidīpanā ca visesatthaparidīpanā ca. Tattha pāḷiāgatameva atthaṃ paridīpanā tadatthaparidīpanā nāma. Pāḷiyaṃ anāgataṃ paridīpanā visesatthaparidīpanā nāma. Imā pana tadatthaparidīpanā. Tattha pureti pubbe. Puratthāti tasseva vevacanaṃ. Purimāsu jātīsūti imissā jātiyā pubbekatakammapaṭikkhepadīpanaṃ. Ubbegauttāsabhayāpanūdanoti ubbegabhayassa ca uttāsabhayassa ca apanūdano. Ussukoti adhimutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satapuññalakkhaṇa"
      },
      "nti satena satena puññakammena nibbattaṃ ekekaṃ lakkhaṇaṃ. Evaṃ sante yo koci buddho bhaveyyāti na rocayiṃsu, anantesu pana cakkavāḷesu sabbe sattā ekekaṃ kammaṃ satakkhattuṃ kareyyuṃ, ettakehi janehi kataṃ kammaṃ bodhisatto ekova ekekaṃ sataguṇaṃ katvā nibbatto. Tasmā ‘‘satapuññalakkhaṇo’’ti imamatthaṃ rocayiṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manussāsurasakkarakkhasā"
      },
      "ti manussā ca asurā ca sakkā ca rakkhasā ca."
    ],
    "innerText": "Satapuññalakkhaṇanti satena satena puññakammena nibbattaṃ ekekaṃ lakkhaṇaṃ. Evaṃ sante yo koci buddho bhaveyyāti na rocayiṃsu, anantesu pana cakkavāḷesu sabbe sattā ekekaṃ kammaṃ satakkhattuṃ kareyyuṃ, ettakehi janehi kataṃ kammaṃ bodhisatto ekova ekekaṃ sataguṇaṃ katvā nibbatto. Tasmā ‘‘satapuññalakkhaṇo’’ti imamatthaṃ rocayiṃsu. Manussāsurasakkarakkhasāti manussā ca asurā ca sakkā ca rakkhasā ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Āyatapaṇhitāditilakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "206"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antarā"
      },
      "ti paṭisandhito sarasacutiyā antare. Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma pāṇātipātā virati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma pāṇātipātaṃ karonto padasaddasavanabhayā ",
      " aggaggapādehi akkamantā gantvā paraṃ pātenti. Atha te iminā kāraṇena tesaṃ taṃ kammaṃ jano jānātūti antovaṅkapādā vā bahivaṅkapādā vā ukkuṭikapādā vā aggakoṇḍā vā paṇhikoṇḍā vā bhavanti. Aggapādehi gantvā parassa amāritabhāvaṃ pana tathāgatassa sadevako loko iminā kāraṇena jānātūti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āyatapaṇhi"
      },
      " mahāpurisalakkhaṇaṃ nibbattati ",
      ". Tathā paraṃ ghātentā unnatakāyena gacchantā aññe passissantīti onatā gantvā paraṃ ghātenti. Atha te evamime gantvā paraṃ ghātayiṃsūti nesaṃ taṃ kammaṃ iminā kāraṇena paro jānātūti khujjā vā vāmanā vā pīṭhasappi vā bhavanti. Tathāgatassa pana evaṃ gantvā paresaṃ aghātitabhāvaṃ iminā kāraṇena sadevako loko jānātūti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmujugatta"
      },
      "mahāpurisalakkhaṇaṃ nibbattati. Tathā paraṃ ghātentā āvudhaṃ vā muggaraṃ vā gaṇhitvā muṭṭhikatahatthā paraṃ ghātenti. Te evaṃ tesaṃ parassa ghātitabhāvaṃ iminā kāraṇena jano jānātūti rassaṅgulī vā rassahatthā vā vaṅkaṅgulī vā phaṇahatthakā vā bhavanti. Tathāgatassa pana evaṃ paresaṃ aghātitabhāvaṃ sadevako loko iminā kāraṇena jānātūti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dīghaṅguli"
      },
      "mahāpurisalakkhaṇaṃ nibbattati. Idamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammasarikkhakaṃ."
      },
      " Idameva pana lakkhaṇattayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lakkhaṇaṃ"
      },
      " nāma. Dīghāyukabhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lakkhaṇānisaṃso."
      }
    ],
    "innerText": "206.Antarāti paṭisandhito sarasacutiyā antare. Idha kammaṃ nāma pāṇātipātā virati. Kammasarikkhakaṃ nāma pāṇātipātaṃ karonto padasaddasavanabhayā aggaggapādehi akkamantā gantvā paraṃ pātenti. Atha te iminā kāraṇena tesaṃ taṃ kammaṃ jano jānātūti antovaṅkapādā vā bahivaṅkapādā vā ukkuṭikapādā vā aggakoṇḍā vā paṇhikoṇḍā vā bhavanti. Aggapādehi gantvā parassa amāritabhāvaṃ pana tathāgatassa sadevako loko iminā kāraṇena jānātūti āyatapaṇhi mahāpurisalakkhaṇaṃ nibbattati . Tathā paraṃ ghātentā unnatakāyena gacchantā aññe passissantīti onatā gantvā paraṃ ghātenti. Atha te evamime gantvā paraṃ ghātayiṃsūti nesaṃ taṃ kammaṃ iminā kāraṇena paro jānātūti khujjā vā vāmanā vā pīṭhasappi vā bhavanti. Tathāgatassa pana evaṃ gantvā paresaṃ aghātitabhāvaṃ iminā kāraṇena sadevako loko jānātūti brahmujugattamahāpurisalakkhaṇaṃ nibbattati. Tathā paraṃ ghātentā āvudhaṃ vā muggaraṃ vā gaṇhitvā muṭṭhikatahatthā paraṃ ghātenti. Te evaṃ tesaṃ parassa ghātitabhāvaṃ iminā kāraṇena jano jānātūti rassaṅgulī vā rassahatthā vā vaṅkaṅgulī vā phaṇahatthakā vā bhavanti. Tathāgatassa pana evaṃ paresaṃ aghātitabhāvaṃ sadevako loko iminā kāraṇena jānātūti dīghaṅgulimahāpurisalakkhaṇaṃ nibbattati. Idamettha kammasarikkhakaṃ. Idameva pana lakkhaṇattayaṃ lakkhaṇaṃ nāma. Dīghāyukabhāvo lakkhaṇānisaṃso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "207"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maraṇavadhabhayattano"
      },
      "ti ettha maraṇasaṅkhāto vadho maraṇavadho, maraṇavadhato bhayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "maraṇavadhabhayaṃ,"
      },
      " taṃ attano jānitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭivirato paraṃmāraṇāyā"
      },
      "ti yathā mayhaṃ maraṇato bhayaṃ mama jīvitaṃ ",
      " piyaṃ, evaṃ paresampīti ñatvā paraṃ māraṇato paṭivirato ahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sucaritenā"
      },
      "ti suciṇṇena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saggamagamā"
      },
      "ti saggaṃ gato."
    ],
    "innerText": "207.Maraṇavadhabhayattanoti ettha maraṇasaṅkhāto vadho maraṇavadho, maraṇavadhato bhayaṃ maraṇavadhabhayaṃ, taṃ attano jānitvā. Paṭivirato paraṃmāraṇāyāti yathā mayhaṃ maraṇato bhayaṃ mama jīvitaṃ piyaṃ, evaṃ paresampīti ñatvā paraṃ māraṇato paṭivirato ahosi. Sucaritenāti suciṇṇena. Saggamagamāti saggaṃ gato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Caviya punaridhāgato"
      },
      "ti cavitvā puna idhāgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dīghapāsaṇhiko"
      },
      "ti dīghapaṇhiko. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brahmāva sujū"
      },
      "ti brahmā viya suṭṭhu uju."
    ],
    "innerText": "Caviya punaridhāgatoti cavitvā puna idhāgato. Dīghapāsaṇhikoti dīghapaṇhiko. Brahmāva sujūti brahmā viya suṭṭhu uju."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Subhujo"
      },
      "ti sundarabhujo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Susū"
      },
      "ti mahallakakālepi taruṇarūpo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Susaṇṭhito"
      },
      "ti susaṇṭhānasampanno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mudutalunaṅguliyassā"
      },
      "ti mudū ca talunā ca aṅguliyo assa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tībhī"
      },
      "ti tīhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purisavaraggalakkhaṇehī"
      },
      "ti purisavarassa ",
      " aggalakkhaṇehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cirayapanāyā"
      },
      "ti ciraṃ yāpanāya, dīghāyukabhāvāya."
    ],
    "innerText": "Subhujoti sundarabhujo. Susūti mahallakakālepi taruṇarūpo. Susaṇṭhitoti susaṇṭhānasampanno. Mudutalunaṅguliyassāti mudū ca talunā ca aṅguliyo assa. Tībhīti tīhi. Purisavaraggalakkhaṇehīti purisavarassa aggalakkhaṇehi. Cirayapanāyāti ciraṃ yāpanāya, dīghāyukabhāvāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ciraṃ yapetī"
      },
      "ti ciraṃ yāpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cirataraṃ pabbajati yadi tato"
      },
      "ti tato cirataraṃ yāpeti, yadi pabbajatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāpayati"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca vasiddhibhāvanāyā"
      },
      "ti vasippatto hutvā iddhibhāvanāya yāpeti."
    ],
    "innerText": "Ciraṃ yapetīti ciraṃ yāpeti. Cirataraṃ pabbajati yadi tatoti tato cirataraṃ yāpeti, yadi pabbajatīti attho. Yāpayatica vasiddhibhāvanāyāti vasippatto hutvā iddhibhāvanāya yāpeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sattussadatālakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "208"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rasitāna"
      },
      "nti rasasampannānaṃ. ‘‘Khādanīyāna’’ntiādīsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khādanīyāni"
      },
      " nāma piṭṭhakhajjakādīni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhojanīyānī"
      },
      "ti pañca bhojanāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāyanīyānī"
      },
      "ti sāyitabbāni sappinavanītādīni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lehanīyānī"
      },
      "ti nillehitabbāni piṭṭhapāyāsādīni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pānānī"
      },
      "ti aṭṭha pānakāni."
    ],
    "innerText": "208.Rasitānanti rasasampannānaṃ. ‘‘Khādanīyāna’’ntiādīsu khādanīyāni nāma piṭṭhakhajjakādīni. Bhojanīyānīti pañca bhojanāni. Sāyanīyānīti sāyitabbāni sappinavanītādīni. Lehanīyānīti nillehitabbāni piṭṭhapāyāsādīni. Pānānīti aṭṭha pānakāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma kappasatasahassādhikāni cattāri asaṅkhyeyyāni dinnaṃ idaṃ paṇītabhojanadānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma lūkhabhojane kucchigate lohitaṃ sussati, maṃsaṃ milāyati. Tasmā lūkhadāyakā sattā iminā kāraṇena nesaṃ lūkhabhojanassa dinnabhāvaṃ jano jānātūti appamaṃsā appalohitā manussapetā viya dullabhannapānā bhavanti. Paṇītabhojane pana kucchigate maṃsalohitaṃ vaḍḍhati, paripuṇṇakāyā pāsādikā abhirūpadassanā honti. Tasmā tathāgatassa dīgharattaṃ paṇītabhojanadāyakattaṃ sadevako loko iminā kāraṇena jānātūti sattussadamahāpurisalakkhaṇaṃ nibbattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma sattussadalakkhaṇameva. Paṇītalābhitā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānisaṃso."
      }
    ],
    "innerText": "Idha kammaṃ nāma kappasatasahassādhikāni cattāri asaṅkhyeyyāni dinnaṃ idaṃ paṇītabhojanadānaṃ. Kammasarikkhakaṃ nāma lūkhabhojane kucchigate lohitaṃ sussati, maṃsaṃ milāyati. Tasmā lūkhadāyakā sattā iminā kāraṇena nesaṃ lūkhabhojanassa dinnabhāvaṃ jano jānātūti appamaṃsā appalohitā manussapetā viya dullabhannapānā bhavanti. Paṇītabhojane pana kucchigate maṃsalohitaṃ vaḍḍhati, paripuṇṇakāyā pāsādikā abhirūpadassanā honti. Tasmā tathāgatassa dīgharattaṃ paṇītabhojanadāyakattaṃ sadevako loko iminā kāraṇena jānātūti sattussadamahāpurisalakkhaṇaṃ nibbattati. Lakkhaṇaṃ nāma sattussadalakkhaṇameva. Paṇītalābhitā ānisaṃso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "209"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khajjabhojjamathaleyyasāyita"
      },
      "nti ",
      " khajjakañca bhojanañca lehanīyañca sāyanīyañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttamaggarasadāyako"
      },
      "ti uttamo aggarasadāyako, uttamānaṃ vā aggarasānaṃ dāyako."
    ],
    "innerText": "209.Khajjabhojjamathaleyyasāyitanti khajjakañca bhojanañca lehanīyañca sāyanīyañca. Uttamaggarasadāyakoti uttamo aggarasadāyako, uttamānaṃ vā aggarasānaṃ dāyako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satta cussade"
      },
      "ti satta ca ussade. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadatthajotaka"
      },
      "nti khajjabhojjādijotakaṃ, tesaṃ lābhasaṃvattanikanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabbajampi cā"
      },
      "ti pabbajamānopi ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadādhigacchatī"
      },
      "ti taṃ adhigacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lābhiruttama"
      },
      "nti lābhi uttamaṃ."
    ],
    "innerText": "Satta cussadeti satta ca ussade. Tadatthajotakanti khajjabhojjādijotakaṃ, tesaṃ lābhasaṃvattanikanti attho. Pabbajampi cāti pabbajamānopi ca. Tadādhigacchatīti taṃ adhigacchati. Lābhiruttamanti lābhi uttamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Karacaraṇādilakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "210"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dānenā"
      },
      "tiādīsu ",
      " ekacco dāneneva saṅgaṇhitabbo hoti, taṃ dānena saṅgahesi. Pabbajitānaṃ pabbajitaparikkhāraṃ, gihīnaṃ gihiparikkhāraṃ adāsi."
    ],
    "innerText": "210.Dānenātiādīsu ekacco dāneneva saṅgaṇhitabbo hoti, taṃ dānena saṅgahesi. Pabbajitānaṃ pabbajitaparikkhāraṃ, gihīnaṃ gihiparikkhāraṃ adāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Peyyavajjenā"
      },
      "ti ekacco hi ‘‘ayaṃ dātabbaṃ nāma deti, ekena pana vacanena sabbaṃ makkhetvā nāseti, kiṃ etassa dāna’’nti vattā hoti. Ekacco ‘‘ayaṃ kiñcāpi dānaṃ na deti, kathento pana telena viya makkheti. Eso detu vā mā vā, vacanameva ",
      " tassa sahassaṃ agghatī’’ti vattā hoti. Evarūpo puggalo dānaṃ na paccāsīsati, piyavacanameva paccāsīsati. Taṃ piyavacanena saṅgahesi."
    ],
    "innerText": "Peyyavajjenāti ekacco hi ‘‘ayaṃ dātabbaṃ nāma deti, ekena pana vacanena sabbaṃ makkhetvā nāseti, kiṃ etassa dāna’’nti vattā hoti. Ekacco ‘‘ayaṃ kiñcāpi dānaṃ na deti, kathento pana telena viya makkheti. Eso detu vā mā vā, vacanameva tassa sahassaṃ agghatī’’ti vattā hoti. Evarūpo puggalo dānaṃ na paccāsīsati, piyavacanameva paccāsīsati. Taṃ piyavacanena saṅgahesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthacariyāyā"
      },
      "ti atthasaṃvaḍḍhanakathāya. Ekacco hi neva dānaṃ, na piyavacanaṃ paccāsīsati. Attano hitakathaṃ vaḍḍhitakathameva paccāsīsati. Evarūpaṃ puggalaṃ ‘‘idaṃ te kātabbaṃ, idaṃ te na kātabbaṃ. Evarūpo puggalo sevitabbo, evarūpo puggalo na sevitabbo’’ti evaṃ atthacariyāya saṅgahesi."
    ],
    "innerText": "Atthacariyāyāti atthasaṃvaḍḍhanakathāya. Ekacco hi neva dānaṃ, na piyavacanaṃ paccāsīsati. Attano hitakathaṃ vaḍḍhitakathameva paccāsīsati. Evarūpaṃ puggalaṃ ‘‘idaṃ te kātabbaṃ, idaṃ te na kātabbaṃ. Evarūpo puggalo sevitabbo, evarūpo puggalo na sevitabbo’’ti evaṃ atthacariyāya saṅgahesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samānattatāyā"
      },
      "ti samānasukhadukkhabhāvena. Ekacco hi dānādīsu ekampi na paccāsīsati, ekāsane nisajjaṃ, ekapallaṅke sayanaṃ, ekato bhojananti evaṃ samānasukhadukkhataṃ paccāsīsati. Tattha jātiyā hīno bhogena adhiko dussaṅgaho hoti. Na hi sakkā tena saddhiṃ ekaparibhogo kātuṃ, tathā akariyamāne ca so kujjhati. Bhogena hīno jātiyā adhikopi dussaṅgaho hoti. So hi ‘‘ahaṃ jātimā’’ti bhogasampannena saddhiṃ ekaparibhogaṃ na icchati, tasmiṃ akariyamāne kujjhati. Ubhohipi hīno pana susaṅgaho hoti. Na hi so itarena saddhiṃ ekaparibhogaṃ icchati, na akariyamāne ca kujjhati. Ubhohi ",
      " sadisopi susaṅgahoyeva. Bhikkhūsu dussīlo dussaṅgaho hoti. Na hi sakkā tena saddhiṃ ekaparibhogo kātuṃ, tathā akariyamāne ca kujjhati. Sīlavā susaṅgaho hoti. Sīlavā hi adīyamānepi akariyamānepi na kujjhati. Aññaṃ attanā ",
      " saddhiṃ paribhogaṃ akarontampi na pāpakena cittena passati. Paribhogopi tena saddhiṃ sukaro hoti. Tasmā evarūpaṃ puggalaṃ evaṃ samānattatāya saṅgahesi."
    ],
    "innerText": "Samānattatāyāti samānasukhadukkhabhāvena. Ekacco hi dānādīsu ekampi na paccāsīsati, ekāsane nisajjaṃ, ekapallaṅke sayanaṃ, ekato bhojananti evaṃ samānasukhadukkhataṃ paccāsīsati. Tattha jātiyā hīno bhogena adhiko dussaṅgaho hoti. Na hi sakkā tena saddhiṃ ekaparibhogo kātuṃ, tathā akariyamāne ca so kujjhati. Bhogena hīno jātiyā adhikopi dussaṅgaho hoti. So hi ‘‘ahaṃ jātimā’’ti bhogasampannena saddhiṃ ekaparibhogaṃ na icchati, tasmiṃ akariyamāne kujjhati. Ubhohipi hīno pana susaṅgaho hoti. Na hi so itarena saddhiṃ ekaparibhogaṃ icchati, na akariyamāne ca kujjhati. Ubhohi sadisopi susaṅgahoyeva. Bhikkhūsu dussīlo dussaṅgaho hoti. Na hi sakkā tena saddhiṃ ekaparibhogo kātuṃ, tathā akariyamāne ca kujjhati. Sīlavā susaṅgaho hoti. Sīlavā hi adīyamānepi akariyamānepi na kujjhati. Aññaṃ attanā saddhiṃ paribhogaṃ akarontampi na pāpakena cittena passati. Paribhogopi tena saddhiṃ sukaro hoti. Tasmā evarūpaṃ puggalaṃ evaṃ samānattatāya saṅgahesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Susaṅgahitāssa hontī"
      },
      "ti susaṅgahitā assa honti. Detu vā mā vā detu, karotu vā mā vā karotu, susaṅgahitāva honti, na bhijjanti. ‘‘Yadāssa dātabbaṃ hoti, tadā deti. Idāni maññe natthi, tena na deti. Kiṃ mayaṃ dadamānameva upaṭṭhahāma? Adentaṃ akarontaṃ na upaṭṭhahāmā’’ti evaṃ cintenti."
    ],
    "innerText": "Susaṅgahitāssa hontīti susaṅgahitā assa honti. Detu vā mā vā detu, karotu vā mā vā karotu, susaṅgahitāva honti, na bhijjanti. ‘‘Yadāssa dātabbaṃ hoti, tadā deti. Idāni maññe natthi, tena na deti. Kiṃ mayaṃ dadamānameva upaṭṭhahāma? Adentaṃ akarontaṃ na upaṭṭhahāmā’’ti evaṃ cintenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma dīgharattaṃ kataṃ dānādisaṅgahakammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma yo evaṃ asaṅgāhako hoti, so iminā kāraṇenassa asaṅgāhakabhāvaṃ jano jānātūti thaddhahatthapādo ceva hoti, visamaṭṭhitāvayavalakkhaṇo ca. Tathāgatassa pana dīgharattaṃ saṅgāhakabhāvaṃ sadevako loko iminā kāraṇena jānātūti imāni dve ",
      " lakkhaṇāni nibbattanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma idameva lakkhaṇadvayaṃ. Susaṅgahitaparijanatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānisaṃso."
      }
    ],
    "innerText": "Idha kammaṃ nāma dīgharattaṃ kataṃ dānādisaṅgahakammaṃ. Kammasarikkhakaṃ nāma yo evaṃ asaṅgāhako hoti, so iminā kāraṇenassa asaṅgāhakabhāvaṃ jano jānātūti thaddhahatthapādo ceva hoti, visamaṭṭhitāvayavalakkhaṇo ca. Tathāgatassa pana dīgharattaṃ saṅgāhakabhāvaṃ sadevako loko iminā kāraṇena jānātūti imāni dve lakkhaṇāni nibbattanti. Lakkhaṇaṃ nāma idameva lakkhaṇadvayaṃ. Susaṅgahitaparijanatā ānisaṃso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "211"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kariyā"
      },
      "ti karitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cariyā"
      },
      "ti caritvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anavamatenā"
      },
      "ti anavaññātena. ‘‘Anapamodenā’’tipi pāṭho, na appamodena, na dīnena na gabbhitenāti attho."
    ],
    "innerText": "211.Kariyāti karitvā. Cariyāti caritvā. Anavamatenāti anavaññātena. ‘‘Anapamodenā’’tipi pāṭho, na appamodena, na dīnena na gabbhitenāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Caviyā"
      },
      "ti cavitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atirucira suvaggu dassaneyya"
      },
      "nti atirucirañca supāsādikaṃ suvaggu ca suṭṭhu chekaṃ dassaneyyañca daṭṭhabbayuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Susu kumāro"
      },
      "ti suṭṭhu sukumāro."
    ],
    "innerText": "Caviyāti cavitvā. Atirucira suvaggu dassaneyyanti atirucirañca supāsādikaṃ suvaggu ca suṭṭhu chekaṃ dassaneyyañca daṭṭhabbayuttaṃ. Susu kumāroti suṭṭhu sukumāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parijanassavo"
      },
      "ti parijano assavo vacanakaro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vidheyyo"
      },
      "ti kattabbākattabbesu yathāruci vidhātabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahima"
      },
      "nti mahiṃ imaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piyavadū hitasukhataṃ jigīsamāno"
      },
      "ti piyavado hutvā hitañca sukhañca pariyesamāno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vacanapaṭikarassā bhippasannā"
      },
      "ti vacanapaṭikarā assa abhippasannā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammānudhamma"
      },
      "nti dhammañca anudhammañca."
    ],
    "innerText": "Parijanassavoti parijano assavo vacanakaro. Vidheyyoti kattabbākattabbesu yathāruci vidhātabbo. Mahimanti mahiṃ imaṃ. Piyavadū hitasukhataṃ jigīsamānoti piyavado hutvā hitañca sukhañca pariyesamāno. Vacanapaṭikarassā bhippasannāti vacanapaṭikarā assa abhippasannā. Dhammānudhammanti dhammañca anudhammañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ussaṅkhapādādilakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "212"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthūpasaṃhita"
      },
      "nti ",
      " idhalokaparalokatthanissitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammūpasaṃhita"
      },
      "nti dasakusalakammapathanissitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahujanaṃ nidaṃsesī"
      },
      "ti bahujanassa nidaṃsanakathaṃ kathesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṇīna"
      },
      "nti sattānaṃ. ‘‘Aggo’’tiādīni sabbāni aññamaññavevacanāni. Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma dīgharattaṃ bhāsitā uddhaṅgamanīyā atthūpasaṃhitā vācā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma yo evarūpaṃ uggatavācaṃ na bhāsati, so iminā kāraṇena uggatavācāya abhāsanaṃ jano jānātūti adhosaṅkhapādo ca hoti adhonatalomo ca. Tathāgatassa pana dīgharattaṃ evarūpāya uggatavācāya bhāsitabhāvaṃ sadevako loko iminā kāraṇena jānātūti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ussaṅkhapādalakkhaṇañca uddhaggalomalakkhaṇañca"
      },
      " nibbattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma idameva lakkhaṇadvayaṃ. Uttamabhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānisaṃso."
      }
    ],
    "innerText": "212.Atthūpasaṃhitanti idhalokaparalokatthanissitaṃ. Dhammūpasaṃhitanti dasakusalakammapathanissitaṃ. Bahujanaṃ nidaṃsesīti bahujanassa nidaṃsanakathaṃ kathesi. Pāṇīnanti sattānaṃ. ‘‘Aggo’’tiādīni sabbāni aññamaññavevacanāni. Idha kammaṃ nāma dīgharattaṃ bhāsitā uddhaṅgamanīyā atthūpasaṃhitā vācā. Kammasarikkhakaṃ nāma yo evarūpaṃ uggatavācaṃ na bhāsati, so iminā kāraṇena uggatavācāya abhāsanaṃ jano jānātūti adhosaṅkhapādo ca hoti adhonatalomo ca. Tathāgatassa pana dīgharattaṃ evarūpāya uggatavācāya bhāsitabhāvaṃ sadevako loko iminā kāraṇena jānātūti ussaṅkhapādalakkhaṇañca uddhaggalomalakkhaṇañca nibbattati. Lakkhaṇaṃ nāma idameva lakkhaṇadvayaṃ. Uttamabhāvo ānisaṃso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "213"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eraya"
      },
      "nti ",
      " bhaṇanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahujanaṃ nidaṃsayī"
      },
      "ti bahujanassa hitaṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammayāga"
      },
      "nti dhammadānayaññaṃ."
    ],
    "innerText": "213.Erayanti bhaṇanto. Bahujanaṃ nidaṃsayīti bahujanassa hitaṃ dasseti. Dhammayāganti dhammadānayaññaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubbhamuppatitalomavā saso"
      },
      "ti so esa uddhaggatalomavā hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pādagaṇṭhirahū"
      },
      "ti pādagopphakā ahesuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhusaṇṭhitā"
      },
      "ti suṭṭhu saṇṭhitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maṃsalohitācitā"
      },
      "ti maṃsena ca lohitena ca ācitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tacotthatā"
      },
      "ti tacena pariyonaddhā niguḷhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vajatī"
      },
      "ti gacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anomanikkamo"
      },
      "ti anomavihārī seṭṭhavihārī."
    ],
    "innerText": "Ubbhamuppatitalomavā sasoti so esa uddhaggatalomavā hoti. Pādagaṇṭhirahūti pādagopphakā ahesuṃ. Sādhusaṇṭhitāti suṭṭhu saṇṭhitā. Maṃsalohitācitāti maṃsena ca lohitena ca ācitā. Tacotthatāti tacena pariyonaddhā niguḷhā. Vajatīti gacchati. Anomanikkamoti anomavihārī seṭṭhavihārī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Eṇijaṅghalakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "214"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sippaṃ vā"
      },
      "tiādīsu sippaṃ nāma dve sippāni – hīnañca sippaṃ, ukkaṭṭhañca sippaṃ. Hīnaṃ nāma sippaṃ naḷakārasippaṃ, kumbhakārasippaṃ pesakārasippaṃ nahāpitasippaṃ. Ukkaṭṭhaṃ nāma sippaṃ lekhā muddā gaṇanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijjā"
      },
      "ti ahivijjādianekavidhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Caraṇa"
      },
      "nti pañcasīlaṃ dasasīlaṃ pātimokkhasaṃvarasīlaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kamma"
      },
      "nti kammassakatājānanapaññā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kilisseyyu"
      },
      "nti kilameyyuṃ. Antevāsikavattaṃ nāma dukkhaṃ, taṃ nesaṃ mā ciramahosīti cintesi."
    ],
    "innerText": "214.Sippaṃ vātiādīsu sippaṃ nāma dve sippāni – hīnañca sippaṃ, ukkaṭṭhañca sippaṃ. Hīnaṃ nāma sippaṃ naḷakārasippaṃ, kumbhakārasippaṃ pesakārasippaṃ nahāpitasippaṃ. Ukkaṭṭhaṃ nāma sippaṃ lekhā muddā gaṇanā. Vijjāti ahivijjādianekavidhā. Caraṇanti pañcasīlaṃ dasasīlaṃ pātimokkhasaṃvarasīlaṃ. Kammanti kammassakatājānanapaññā. Kilisseyyunti kilameyyuṃ. Antevāsikavattaṃ nāma dukkhaṃ, taṃ nesaṃ mā ciramahosīti cintesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājārahānī"
      },
      "ti rañño anurūpāni hatthiassādīni, tāniyeva rañño senāya aṅgabhūtattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rājaṅgānī"
      },
      "ti vuccanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājūpabhogānī"
      },
      "ti rañño ",
      " upabhogaparibhogabhaṇḍāni, tāni ceva sattaratanāni ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājānucchavikānī"
      },
      "ti rañño anucchavikāni. Tesaṃyeva sabbesaṃ idaṃ gahaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaṇārahānī"
      },
      "ti ",
      " samaṇānaṃ anurūpāni cīvarādīni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaṇaṅgānī"
      },
      "ti samaṇānaṃ koṭṭhāsabhūtā catasso parisā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaṇūpabhogānī"
      },
      "ti samaṇānaṃ upabhogaparikkhārā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaṇānucchavikānī"
      },
      "ti tesaṃyeva adhivacanaṃ."
    ],
    "innerText": "Rājārahānīti rañño anurūpāni hatthiassādīni, tāniyeva rañño senāya aṅgabhūtattā rājaṅgānīti vuccanti. Rājūpabhogānīti rañño upabhogaparibhogabhaṇḍāni, tāni ceva sattaratanāni ca. Rājānucchavikānīti rañño anucchavikāni. Tesaṃyeva sabbesaṃ idaṃ gahaṇaṃ. Samaṇārahānīti samaṇānaṃ anurūpāni cīvarādīni. Samaṇaṅgānīti samaṇānaṃ koṭṭhāsabhūtā catasso parisā. Samaṇūpabhogānīti samaṇānaṃ upabhogaparikkhārā. Samaṇānucchavikānīti tesaṃyeva adhivacanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma dīgharattaṃ sakkaccaṃ sippādivācanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma yo evaṃ sakkaccaṃ sippaṃ avācento antevāsike ukkuṭikāsanajaṅghapesanikādīhi kilameti, tassa jaṅghamaṃsaṃ likhitvā pātitaṃ viya hoti. Tathāgatassa pana sakkaccaṃ vācitabhāvaṃ sadevako loko iminā kāraṇena jānātūti anupubbauggatavaṭṭitaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "eṇijaṅghalakkhaṇaṃ"
      },
      " nibbattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma idameva lakkhaṇaṃ. Anucchavikalābhitā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānisaṃso."
      }
    ],
    "innerText": "Idha pana kammaṃ nāma dīgharattaṃ sakkaccaṃ sippādivācanaṃ. Kammasarikkhakaṃ nāma yo evaṃ sakkaccaṃ sippaṃ avācento antevāsike ukkuṭikāsanajaṅghapesanikādīhi kilameti, tassa jaṅghamaṃsaṃ likhitvā pātitaṃ viya hoti. Tathāgatassa pana sakkaccaṃ vācitabhāvaṃ sadevako loko iminā kāraṇena jānātūti anupubbauggatavaṭṭitaṃ eṇijaṅghalakkhaṇaṃ nibbattati. Lakkhaṇaṃ nāma idameva lakkhaṇaṃ. Anucchavikalābhitā ānisaṃso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "215"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadūpaghātāyā"
      },
      "ti yaṃ sippaṃ kassaci upaghātāya na hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kilissatī"
      },
      "ti kilamissati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhumattacotthatā"
      },
      "ti sukhumattacena pariyonaddhā. Kiṃ pana aññena kammena aññaṃ lakkhaṇaṃ nibbattatīti? Na nibbattati. Yaṃ pana nibbattati, taṃ anubyañjanaṃ hoti, tasmā idha vuttaṃ."
    ],
    "innerText": "215.Yadūpaghātāyāti yaṃ sippaṃ kassaci upaghātāya na hoti. Kilissatīti kilamissati. Sukhumattacotthatāti sukhumattacena pariyonaddhā. Kiṃ pana aññena kammena aññaṃ lakkhaṇaṃ nibbattatīti? Na nibbattati. Yaṃ pana nibbattati, taṃ anubyañjanaṃ hoti, tasmā idha vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sukhumacchavilakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "216"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaṇaṃ vā"
      },
      "ti samitapāpaṭṭhena samaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brāhmaṇaṃ vā"
      },
      "ti bāhitapāpaṭṭhena brāhmaṇaṃ."
    ],
    "innerText": "216.Samaṇaṃ vāti samitapāpaṭṭhena samaṇaṃ. Brāhmaṇaṃ vāti bāhitapāpaṭṭhena brāhmaṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāpañño"
      },
      "tiādīsu mahāpaññādīhi samannāgato hotīti attho. Tatridaṃ mahāpaññādīnaṃ nānattaṃ."
    ],
    "innerText": "Mahāpaññotiādīsu mahāpaññādīhi samannāgato hotīti attho. Tatridaṃ mahāpaññādīnaṃ nānattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāpaññā?"
      },
      " Mahante sīlakkhandhe pariggaṇhātīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāpaññā,"
      },
      " mahante samādhikkhandhe paññākkhandhe vimuttikkhandhe vimuttiñāṇadassanakkhandhe pariggaṇhātīti mahāpaññā. Mahantāni ṭhānāṭhānāni mahantā vihārasamāpattiyo mahantāni ariyasaccāni mahante satipaṭṭhāne sammappadhāne iddhipāde mahantāni indriyāni balāni mahante bojjhaṅge mahante ariyamagge mahantāni sāmaññaphalāni mahantā abhiññāyo mahantaṃ paramatthaṃ nibbānaṃ pariggaṇhātīti mahāpaññā."
    ],
    "innerText": "Tattha katamā mahāpaññā? Mahante sīlakkhandhe pariggaṇhātīti mahāpaññā, mahante samādhikkhandhe paññākkhandhe vimuttikkhandhe vimuttiñāṇadassanakkhandhe pariggaṇhātīti mahāpaññā. Mahantāni ṭhānāṭhānāni mahantā vihārasamāpattiyo mahantāni ariyasaccāni mahante satipaṭṭhāne sammappadhāne iddhipāde mahantāni indriyāni balāni mahante bojjhaṅge mahante ariyamagge mahantāni sāmaññaphalāni mahantā abhiññāyo mahantaṃ paramatthaṃ nibbānaṃ pariggaṇhātīti mahāpaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puthupaññā?"
      },
      " Puthunānākhandhesu ñāṇaṃ pavattatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puthupaññā."
      },
      " Puthunānādhātūsu puthunānāāyatanesu ",
      " puthunānāpaṭiccasamuppādesu puthunānāsuññatamanupalabbhesu puthunānāatthesu dhammesu niruttīsu paṭibhānesu. Puthunānāsīlakkhandhesu puthunānāsamādhipaññāvimuttivimuttiñādassanakkhandhesu puthunānāṭhānāṭhānesu puthunānāvihārasamāpattīsu puthunānāariyasaccesu puthunānāsatipaṭṭhānesu sammappadhānesu iddhipādesu indriyesu balesu bojjhaṅgesu puthunānāariyamaggesu sāmaññaphalesu abhiññāsu puthujjanasādhāraṇe dhamme samatikkamma paramatthe nibbāne ñāṇaṃ pavattatīti puthupaññā."
    ],
    "innerText": "Katamā puthupaññā? Puthunānākhandhesu ñāṇaṃ pavattatīti puthupaññā. Puthunānādhātūsu puthunānāāyatanesu puthunānāpaṭiccasamuppādesu puthunānāsuññatamanupalabbhesu puthunānāatthesu dhammesu niruttīsu paṭibhānesu. Puthunānāsīlakkhandhesu puthunānāsamādhipaññāvimuttivimuttiñādassanakkhandhesu puthunānāṭhānāṭhānesu puthunānāvihārasamāpattīsu puthunānāariyasaccesu puthunānāsatipaṭṭhānesu sammappadhānesu iddhipādesu indriyesu balesu bojjhaṅgesu puthunānāariyamaggesu sāmaññaphalesu abhiññāsu puthujjanasādhāraṇe dhamme samatikkamma paramatthe nibbāne ñāṇaṃ pavattatīti puthupaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hāsapaññā?"
      },
      " Idhekacco hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo sīlaṃ paripūreti indriyasaṃvaraṃ paripūreti bhojane mattaññutaṃ jāgariyānuyogaṃ sīlakkhandhaṃ samādhikkhandhaṃ paññākkhandhaṃ vimuttikkhandhaṃ ",
      " vimuttiñāṇadassanakkhandhaṃ paripūretīti hāsapaññā. Hāsabahulo…pe… pāmojjabahulo ṭhānāṭhānaṃ paṭivijjhatīti hāsapaññā. Hāsabahulo vihārasamāpattiyo paripūretīti hāsapaññā. Hāsabahulo ariyasaccāni paṭivijjhatīti hāsapaññā. Satipaṭṭhāne sammappadhāne iddhipāde indriyāni balāni bojjhaṅge ariyamaggaṃ bhāvetīti hāsapaññā. Hāsabahulo sāmaññaphalāni sacchikarotīti hāsapaññā. Abhiññāyo paṭivijjhatīti hāsapaññā. Hāsabahulo vedatuṭṭhipāmojjabahulo paramatthaṃ nibbānaṃ sacchikarotīti hāsapaññā."
    ],
    "innerText": "Katamā hāsapaññā? Idhekacco hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo sīlaṃ paripūreti indriyasaṃvaraṃ paripūreti bhojane mattaññutaṃ jāgariyānuyogaṃ sīlakkhandhaṃ samādhikkhandhaṃ paññākkhandhaṃ vimuttikkhandhaṃ vimuttiñāṇadassanakkhandhaṃ paripūretīti hāsapaññā. Hāsabahulo…pe… pāmojjabahulo ṭhānāṭhānaṃ paṭivijjhatīti hāsapaññā. Hāsabahulo vihārasamāpattiyo paripūretīti hāsapaññā. Hāsabahulo ariyasaccāni paṭivijjhatīti hāsapaññā. Satipaṭṭhāne sammappadhāne iddhipāde indriyāni balāni bojjhaṅge ariyamaggaṃ bhāvetīti hāsapaññā. Hāsabahulo sāmaññaphalāni sacchikarotīti hāsapaññā. Abhiññāyo paṭivijjhatīti hāsapaññā. Hāsabahulo vedatuṭṭhipāmojjabahulo paramatthaṃ nibbānaṃ sacchikarotīti hāsapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "javanapaññā?"
      },
      " Yaṃkiñci rūpaṃ atītānāgatapaccuppannaṃ yaṃ dūre santike vā, sabbaṃ taṃ rūpaṃ aniccato khippaṃ javatīti javanapaññā. Dukkhato khippaṃ anattato khippaṃ javatīti javanapaññā. Yā kāci vedanā…pe… yaṃkiñci viññāṇaṃ atītānāgatapaccuppannaṃ, sabbaṃ taṃ viññāṇaṃ aniccato dukkhato anattato khippaṃ javatīti javanapaññā. Cakkhu…pe… jarāmaraṇaṃ atītānāgatapaccuppannaṃ aniccato dukkhato anattato khippaṃ javatīti javanapaññā. Rūpaṃ atītānāgatapaccuppannaṃ aniccaṃ khayaṭṭhena dukkhaṃ bhayaṭṭhena anattā asārakaṭṭhenāti tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā rūpanirodhe nibbāne khippaṃ javatīti javanapaññā. Vedanā saññā saṅkhārā viññāṇaṃ cakkhu…pe… jarāmaraṇaṃ atītānāgatapaccuppannaṃ aniccaṃ khayaṭṭhena…pe… vibhūtaṃ katvā jarāmaraṇanirodhe nibbāne khippaṃ javatīti javanapaññā. Rūpaṃ atītānāgatapaccuppannaṃ ",
      ". Cakkhuṃ…pe… jarāmaraṇaṃ aniccaṃ saṅkhataṃ paṭiccasamuppannaṃ khayadhammaṃ vayadhammaṃ virāgadhammaṃ nirodhadhammanti tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā jarāmaraṇanirodhe nibbāne khippaṃ javatīti javanapaññā."
    ],
    "innerText": "Katamā javanapaññā? Yaṃkiñci rūpaṃ atītānāgatapaccuppannaṃ yaṃ dūre santike vā, sabbaṃ taṃ rūpaṃ aniccato khippaṃ javatīti javanapaññā. Dukkhato khippaṃ anattato khippaṃ javatīti javanapaññā. Yā kāci vedanā…pe… yaṃkiñci viññāṇaṃ atītānāgatapaccuppannaṃ, sabbaṃ taṃ viññāṇaṃ aniccato dukkhato anattato khippaṃ javatīti javanapaññā. Cakkhu…pe… jarāmaraṇaṃ atītānāgatapaccuppannaṃ aniccato dukkhato anattato khippaṃ javatīti javanapaññā. Rūpaṃ atītānāgatapaccuppannaṃ aniccaṃ khayaṭṭhena dukkhaṃ bhayaṭṭhena anattā asārakaṭṭhenāti tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā rūpanirodhe nibbāne khippaṃ javatīti javanapaññā. Vedanā saññā saṅkhārā viññāṇaṃ cakkhu…pe… jarāmaraṇaṃ atītānāgatapaccuppannaṃ aniccaṃ khayaṭṭhena…pe… vibhūtaṃ katvā jarāmaraṇanirodhe nibbāne khippaṃ javatīti javanapaññā. Rūpaṃ atītānāgatapaccuppannaṃ . Cakkhuṃ…pe… jarāmaraṇaṃ aniccaṃ saṅkhataṃ paṭiccasamuppannaṃ khayadhammaṃ vayadhammaṃ virāgadhammaṃ nirodhadhammanti tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā jarāmaraṇanirodhe nibbāne khippaṃ javatīti javanapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikkhapaññā?"
      },
      " Khippaṃ kilese chindatīti tikkhapaññā. Uppannaṃ kāmavitakkaṃ nādhivāseti, uppannaṃ byāpādavitakkaṃ, uppannaṃ vihiṃsāvitakkaṃ, uppannuppanne pāpake akusale dhamme uppannaṃ rāgaṃ dosaṃ mohaṃ kodhaṃ upanāhaṃ makkhaṃ paḷāsaṃ issaṃ macchariyaṃ māyaṃ sāṭheyyaṃ thambhaṃ sārambhaṃ ",
      " mānaṃ atimānaṃ madaṃ pamādaṃ sabbe kilese sabbe duccarite sabbe abhisaṅkhāre sabbe bhavagāmikamme nādhivāseti pajahati vinodeti byantī karoti anabhāvaṃ gametīti tikkhapaññā. Ekasmiṃ āsane cattāro ariyamaggā cattāri sāmaññaphalāni catasso paṭisambhidāyo cha abhiññāyo adhigatā honti sacchikatā phassitā paññāyāti tikkhapaññā."
    ],
    "innerText": "Katamā tikkhapaññā? Khippaṃ kilese chindatīti tikkhapaññā. Uppannaṃ kāmavitakkaṃ nādhivāseti, uppannaṃ byāpādavitakkaṃ, uppannaṃ vihiṃsāvitakkaṃ, uppannuppanne pāpake akusale dhamme uppannaṃ rāgaṃ dosaṃ mohaṃ kodhaṃ upanāhaṃ makkhaṃ paḷāsaṃ issaṃ macchariyaṃ māyaṃ sāṭheyyaṃ thambhaṃ sārambhaṃ mānaṃ atimānaṃ madaṃ pamādaṃ sabbe kilese sabbe duccarite sabbe abhisaṅkhāre sabbe bhavagāmikamme nādhivāseti pajahati vinodeti byantī karoti anabhāvaṃ gametīti tikkhapaññā. Ekasmiṃ āsane cattāro ariyamaggā cattāri sāmaññaphalāni catasso paṭisambhidāyo cha abhiññāyo adhigatā honti sacchikatā phassitā paññāyāti tikkhapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nibbedhikapaññā?"
      },
      " Idhekacco sabbasaṅkhāresu ubbegabahulo hoti uttāsabahulo ukkaṇṭhanabahulo aratibahulo anabhiratibahulo bahimukho na ramati sabbasaṅkhāresu, anibbiddhapubbaṃ apadālitapubbaṃ lobhakkhandhaṃ nibbijjhati padāletīti nibbedhikapaññā. Anibbiddhapubbaṃ apadālitapubbaṃ dosakkhandhaṃ mohakkhandhaṃ kodhaṃ upanāhaṃ…pe… sabbe bhavagāmikamme nibbijjhati padāletīti nibbedhikapaññāti (paṭi. ma. 3.3)."
    ],
    "innerText": "Katamā nibbedhikapaññā? Idhekacco sabbasaṅkhāresu ubbegabahulo hoti uttāsabahulo ukkaṇṭhanabahulo aratibahulo anabhiratibahulo bahimukho na ramati sabbasaṅkhāresu, anibbiddhapubbaṃ apadālitapubbaṃ lobhakkhandhaṃ nibbijjhati padāletīti nibbedhikapaññā. Anibbiddhapubbaṃ apadālitapubbaṃ dosakkhandhaṃ mohakkhandhaṃ kodhaṃ upanāhaṃ…pe… sabbe bhavagāmikamme nibbijjhati padāletīti nibbedhikapaññāti (paṭi. ma. 3.3)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "217"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabbajitaṃ upāsitā"
      },
      "ti paṇḍitaṃ pabbajitaṃ upasaṅkamitvā payirupāsitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthantaro"
      },
      "ti yathā eke randhagavesino upārambhacittatāya dosaṃ abbhantaraṃ karitvā nisāmayanti, evaṃ anisāmetvā atthaṃ abbhantaraṃ katvā atthayuttaṃ kathaṃ nisāmayi upadhārayi."
    ],
    "innerText": "217.Pabbajitaṃ upāsitāti paṇḍitaṃ pabbajitaṃ upasaṅkamitvā payirupāsitā. Atthantaroti yathā eke randhagavesino upārambhacittatāya dosaṃ abbhantaraṃ karitvā nisāmayanti, evaṃ anisāmetvā atthaṃ abbhantaraṃ katvā atthayuttaṃ kathaṃ nisāmayi upadhārayi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭilābhagatenā"
      },
      "ti paṭilābhatthāya gatena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppādanimittakovidā"
      },
      "ti uppāde ca nimitte ca chekā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avecca dakkhitī"
      },
      "ti ñatvā passissati."
    ],
    "innerText": "Paṭilābhagatenāti paṭilābhatthāya gatena. Uppādanimittakovidāti uppāde ca nimitte ca chekā. Avecca dakkhitīti ñatvā passissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthānusiṭṭhīsu pariggahesu cā"
      },
      "ti ye atthānusāsanesu pariggahā atthānatthaṃ pariggāhakāni ñāṇāni, tesūti attho."
    ],
    "innerText": "Atthānusiṭṭhīsu pariggahesu cāti ye atthānusāsanesu pariggahā atthānatthaṃ pariggāhakāni ñāṇāni, tesūti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Suvaṇṇavaṇṇalakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "218"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akkodhano"
      },
      "ti ",
      " na anāgāmimaggena kodhassa pahīnattā, atha kho sacepi me kodho uppajjeyya, khippameva naṃ paṭivinodeyyanti evaṃ akkodhavasikattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nābhisajjī"
      },
      "ti kuṭilakaṇṭako viya tattha tattha mammaṃ tudanto viya na laggi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na kuppi na byāpajjī"
      },
      "tiādīsu ",
      " pubbuppattiko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kopo. "
      },
      " Tato balavataro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "byāpādo."
      },
      " Tato balavatarā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "patitthiyanā."
      },
      " Taṃ sabbaṃ akaronto na kuppi na byāpajji na patitthiyi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaccaya"
      },
      "nti domanassaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na pātvākāsī"
      },
      "ti na kāyavikārena vā vacīvikārena vā pākaṭamakāsi."
    ],
    "innerText": "218.Akkodhanoti na anāgāmimaggena kodhassa pahīnattā, atha kho sacepi me kodho uppajjeyya, khippameva naṃ paṭivinodeyyanti evaṃ akkodhavasikattā. Nābhisajjīti kuṭilakaṇṭako viya tattha tattha mammaṃ tudanto viya na laggi. Na kuppi na byāpajjītiādīsu pubbuppattiko kopo. Tato balavataro byāpādo. Tato balavatarā patitthiyanā. Taṃ sabbaṃ akaronto na kuppi na byāpajji na patitthiyi. Appaccayanti domanassaṃ. Na pātvākāsīti na kāyavikārena vā vacīvikārena vā pākaṭamakāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha kammaṃ nāma dīgharattaṃ akkodhanatā ceva ",
      " sukhumattharaṇādidānañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma kodhanassa chavivaṇṇo āvilo hoti mukhaṃ duddasiyaṃ vatthacchādanasadisañca maṇḍanaṃ nāma natthi. Tasmā yo kodhano ceva vatthacchādanānañca adātā, so iminā kāraṇenassa jano kodhanādibhāvaṃ jānātūti dubbaṇṇo hoti dussaṇṭhāno. Akkodhanassa pana mukhaṃ virocati, chavivaṇṇo vippasīdati. Sattā hi catūhi kāraṇehi pāsādikā honti āmisadānena vā vatthadānena vā sammajjanena vā akkodhanatāya vā. Imāni cattāripi kāraṇāni dīgharattaṃ tathāgatena katāneva. Tenassa imesaṃ katabhāvaṃ sadevako loko iminā kāraṇena jānātūti suvaṇṇavaṇṇaṃ mahāpurisalakkhaṇaṃ nibbattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma idameva lakkhaṇaṃ. Sukhumattharaṇādilābhitā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānisaṃso."
      }
    ],
    "innerText": "Idha kammaṃ nāma dīgharattaṃ akkodhanatā ceva sukhumattharaṇādidānañca. Kammasarikkhakaṃ nāma kodhanassa chavivaṇṇo āvilo hoti mukhaṃ duddasiyaṃ vatthacchādanasadisañca maṇḍanaṃ nāma natthi. Tasmā yo kodhano ceva vatthacchādanānañca adātā, so iminā kāraṇenassa jano kodhanādibhāvaṃ jānātūti dubbaṇṇo hoti dussaṇṭhāno. Akkodhanassa pana mukhaṃ virocati, chavivaṇṇo vippasīdati. Sattā hi catūhi kāraṇehi pāsādikā honti āmisadānena vā vatthadānena vā sammajjanena vā akkodhanatāya vā. Imāni cattāripi kāraṇāni dīgharattaṃ tathāgatena katāneva. Tenassa imesaṃ katabhāvaṃ sadevako loko iminā kāraṇena jānātūti suvaṇṇavaṇṇaṃ mahāpurisalakkhaṇaṃ nibbattati. Lakkhaṇaṃ nāma idameva lakkhaṇaṃ. Sukhumattharaṇādilābhitā ānisaṃso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "219"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhivissajī"
      },
      "ti abhivissajjesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahimiva suro abhivassa"
      },
      "nti suro vuccati devo, mahāpathaviṃ abhivassanto devo viya."
    ],
    "innerText": "219.Abhivissajīti abhivissajjesi. Mahimiva suro abhivassanti suro vuccati devo, mahāpathaviṃ abhivassanto devo viya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suravarataroriva indo"
      },
      "ti surānaṃ varataro indo viya."
    ],
    "innerText": "Suravarataroriva indoti surānaṃ varataro indo viya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apabbajjamiccha"
      },
      "nti apabbajjaṃ gihibhāvaṃ icchanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahatimahi"
      },
      "nti mahantiṃ pathaviṃ."
    ],
    "innerText": "Apabbajjamicchanti apabbajjaṃ gihibhāvaṃ icchanto. Mahatimahinti mahantiṃ pathaviṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Acchādanavatthamokkhapāvuraṇāna"
      },
      "nti acchādanānañceva vatthānañca uttamapāvuraṇānañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Panāso"
      },
      "ti vināso."
    ],
    "innerText": "Acchādanavatthamokkhapāvuraṇānanti acchādanānañceva vatthānañca uttamapāvuraṇānañca. Panāsoti vināso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Kosohitavatthaguyhalakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "220"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mātarampi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puttena samānetā ahosī"
      },
      "ti imaṃ kammaṃ rajje patiṭṭhitena sakkā kātuṃ. Tasmā bodhisattopi rajjaṃ kārayamāno antonagare catukkādīsu catūsu nagaradvāresu bahinagare catūsu disāsu imaṃ kammaṃ karothāti manusse ṭhapesi. Te mātaraṃ kuhiṃ me putto puttaṃ ",
      " na passāmīti vilapantiṃ pariyesamānaṃ disvā ehi, amma, puttaṃ dakkhasīti taṃ ādāya gantvā nahāpetvā bhojetvā puttamassā pariyesitvā dassenti. Esa nayo sabbattha."
    ],
    "innerText": "220.Mātarampiputtena samānetā ahosīti imaṃ kammaṃ rajje patiṭṭhitena sakkā kātuṃ. Tasmā bodhisattopi rajjaṃ kārayamāno antonagare catukkādīsu catūsu nagaradvāresu bahinagare catūsu disāsu imaṃ kammaṃ karothāti manusse ṭhapesi. Te mātaraṃ kuhiṃ me putto puttaṃ na passāmīti vilapantiṃ pariyesamānaṃ disvā ehi, amma, puttaṃ dakkhasīti taṃ ādāya gantvā nahāpetvā bhojetvā puttamassā pariyesitvā dassenti. Esa nayo sabbattha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma dīgharattaṃ ñātīnaṃ samaṅgibhāvakaraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma ñātayo hi samaṅgībhūtā aññamaññassa vajjaṃ paṭicchādenti. Kiñcāpi hi te kalahakāle kalahaṃ karonti, ekassa pana dose uppanne aññaṃ jānāpetuṃ na icchanti. Ayaṃ nāma etassa dosoti vutte sabbe uṭṭhahitvā ",
      " kena diṭṭhaṃ kena sutaṃ, amhākaṃ ñātīsu evarūpaṃ kattā nāma natthīti. Tathāgatena ca taṃ ñātisaṅgahaṃ karontena dīgharattaṃ idaṃ vajjappaṭicchādanakammaṃ nāma kataṃ hoti. Athassa sadevako loko iminā kāraṇena evarūpassa kammassa katabhāvaṃ jānātūti kosohitavatthaguyhalakkhaṇaṃ nibbattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma idameva lakkhaṇaṃ. Pahūtaputtatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānisaṃso."
      }
    ],
    "innerText": "Idha kammaṃ nāma dīgharattaṃ ñātīnaṃ samaṅgibhāvakaraṇaṃ. Kammasarikkhakaṃ nāma ñātayo hi samaṅgībhūtā aññamaññassa vajjaṃ paṭicchādenti. Kiñcāpi hi te kalahakāle kalahaṃ karonti, ekassa pana dose uppanne aññaṃ jānāpetuṃ na icchanti. Ayaṃ nāma etassa dosoti vutte sabbe uṭṭhahitvā kena diṭṭhaṃ kena sutaṃ, amhākaṃ ñātīsu evarūpaṃ kattā nāma natthīti. Tathāgatena ca taṃ ñātisaṅgahaṃ karontena dīgharattaṃ idaṃ vajjappaṭicchādanakammaṃ nāma kataṃ hoti. Athassa sadevako loko iminā kāraṇena evarūpassa kammassa katabhāvaṃ jānātūti kosohitavatthaguyhalakkhaṇaṃ nibbattati. Lakkhaṇaṃ nāma idameva lakkhaṇaṃ. Pahūtaputtatā ānisaṃso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "221"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthachādiya"
      },
      "nti vatthena chādetabbaṃ vatthaguyhaṃ."
    ],
    "innerText": "221.Vatthachādiyanti vatthena chādetabbaṃ vatthaguyhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amittatāpanā"
      },
      "ti amittānaṃ patāpanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gihissa pītiṃ jananā"
      },
      "ti gihibhūtassa sato pītijananā."
    ],
    "innerText": "Amittatāpanāti amittānaṃ patāpanā. Gihissa pītiṃ jananāti gihibhūtassa sato pītijananā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Parimaṇḍalādilakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "222"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaṃ jānātī"
      },
      "ti ‘‘ayaṃ tārukkhasamo ayaṃ pokkharasātisamo’’ti evaṃ tena tena samaṃ jānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāmaṃ jānātī"
      },
      "ti sayaṃ jānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purisaṃ jānātī"
      },
      "ti ‘‘ayaṃ seṭṭhasammato’’ti purisaṃ jānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purisavisesaṃ jānātī"
      },
      "ti muggaṃ māsena samaṃ akatvā guṇavisiṭṭhassa visesaṃ jānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayamidamarahatī"
      },
      "ti ayaṃ puriso idaṃ nāma dānasakkāraṃ arahati ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purisavisesakaro ahosī"
      },
      "ti purisavisesaṃ ñatvā kārako ahosi. Yo yaṃ arahati, tasseva taṃ adāsi. Yo hi kahāpaṇārahassa aḍḍhaṃ deti, so parassa aḍḍhaṃ nāseti. Yo dve kahāpaṇe deti, so attano kahāpaṇaṃ nāseti. Tasmā idaṃ ubhayampi akatvā yo yaṃ arahati, tassa tadeva adāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhādhana"
      },
      "ntiādīsu sampattipaṭilābhaṭṭhena saddhādīnaṃ dhanabhāvo veditabbo."
    ],
    "innerText": "222.Samaṃ jānātīti ‘‘ayaṃ tārukkhasamo ayaṃ pokkharasātisamo’’ti evaṃ tena tena samaṃ jānāti. Sāmaṃ jānātīti sayaṃ jānāti. Purisaṃ jānātīti ‘‘ayaṃ seṭṭhasammato’’ti purisaṃ jānāti. Purisavisesaṃ jānātīti muggaṃ māsena samaṃ akatvā guṇavisiṭṭhassa visesaṃ jānāti. Ayamidamarahatīti ayaṃ puriso idaṃ nāma dānasakkāraṃ arahati . Purisavisesakaro ahosīti purisavisesaṃ ñatvā kārako ahosi. Yo yaṃ arahati, tasseva taṃ adāsi. Yo hi kahāpaṇārahassa aḍḍhaṃ deti, so parassa aḍḍhaṃ nāseti. Yo dve kahāpaṇe deti, so attano kahāpaṇaṃ nāseti. Tasmā idaṃ ubhayampi akatvā yo yaṃ arahati, tassa tadeva adāsi. Saddhādhanantiādīsu sampattipaṭilābhaṭṭhena saddhādīnaṃ dhanabhāvo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma dīgharattaṃ purisavisesaṃ ñatvā kataṃ samasaṅgahakammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma tadassa ",
      " kammaṃ sadevako loko iminā kāraṇena jānātūti imāni dve lakkhaṇāni nibbattanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma idameva lakkhaṇadvayaṃ. Dhanasampatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānisaṃso."
      }
    ],
    "innerText": "Idha kammaṃ nāma dīgharattaṃ purisavisesaṃ ñatvā kataṃ samasaṅgahakammaṃ. Kammasarikkhakaṃ nāma tadassa kammaṃ sadevako loko iminā kāraṇena jānātūti imāni dve lakkhaṇāni nibbattanti. Lakkhaṇaṃ nāma idameva lakkhaṇadvayaṃ. Dhanasampatti ānisaṃso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "223"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tuliyā"
      },
      "ti tulayitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭivicayā"
      },
      "ti paṭivicinitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahājanasaṅgāhaka"
      },
      "nti mahājanasaṅgahaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samekkhamāno"
      },
      "ti samaṃ pekkhamāno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atinipuṇā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manujā"
      },
      "ti atinipuṇā sukhumapaññā lakkhaṇapāṭhakamanussā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahuvividhā gihīnaṃ arahānī"
      },
      "ti bahū vividhāni gihīnaṃ anucchavikāni paṭilabhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Daharo susu kumāro"
      },
      " ‘‘ayaṃ daharo kumāro paṭilabhissatī’’ti byākaṃsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahīpatissā"
      },
      "ti rañño."
    ],
    "innerText": "223.Tuliyāti tulayitvā. Paṭivicayāti paṭivicinitvā. Mahājanasaṅgāhakanti mahājanasaṅgahaṇaṃ. Samekkhamānoti samaṃ pekkhamāno. Atinipuṇāmanujāti atinipuṇā sukhumapaññā lakkhaṇapāṭhakamanussā. Bahuvividhā gihīnaṃ arahānīti bahū vividhāni gihīnaṃ anucchavikāni paṭilabhati. Daharo susu kumāro ‘‘ayaṃ daharo kumāro paṭilabhissatī’’ti byākaṃsu mahīpatissāti rañño."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sīhapubbaddhakāyādilakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "224"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yogakkhemakāmo"
      },
      "ti yogato khemakāmo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāyā"
      },
      "ti kammassakatapaññāya. Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma mahājanassa atthakāmatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma taṃ mahājanassa atthakāmatāya vaḍḍhimeva paccāsīsitabhāvaṃ sadevako loko iminā kāraṇena jānātūti imāni samantaparipūrāni aparihīnāni tīṇi lakkhaṇāni nibbattanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma idameva lakkhaṇattayaṃ. Dhanādīhi ceva saddhādīhi ca aparihāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānisaṃso."
      }
    ],
    "innerText": "224.Yogakkhemakāmoti yogato khemakāmo. Paññāyāti kammassakatapaññāya. Idha kammaṃ nāma mahājanassa atthakāmatā. Kammasarikkhakaṃ nāma taṃ mahājanassa atthakāmatāya vaḍḍhimeva paccāsīsitabhāvaṃ sadevako loko iminā kāraṇena jānātūti imāni samantaparipūrāni aparihīnāni tīṇi lakkhaṇāni nibbattanti. Lakkhaṇaṃ nāma idameva lakkhaṇattayaṃ. Dhanādīhi ceva saddhādīhi ca aparihāni ānisaṃso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "225"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhāyā"
      },
      "ti okappanasaddhāya pasādasaddhāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlenā"
      },
      "ti pañcasīlena dasasīlena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sutenā"
      },
      "ti pariyattisavanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddhiyā"
      },
      "ti etesaṃ buddhiyā ",
      ", ‘‘kinti etehi vaḍḍheyyu’’nti evaṃ cintesīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammenā"
      },
      "ti lokiyadhammena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahūhi sādhūhī"
      },
      "ti aññehipi bahūhi uttamaguṇehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asahānadhammata"
      },
      "nti aparihīnadhammaṃ."
    ],
    "innerText": "225.Saddhāyāti okappanasaddhāya pasādasaddhāya. Sīlenāti pañcasīlena dasasīlena. Sutenāti pariyattisavanena. Buddhiyāti etesaṃ buddhiyā , ‘‘kinti etehi vaḍḍheyyu’’nti evaṃ cintesīti attho. Dhammenāti lokiyadhammena. Bahūhi sādhūhīti aññehipi bahūhi uttamaguṇehi. Asahānadhammatanti aparihīnadhammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Rasaggasaggitālakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "226"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samābhivāhiniyo"
      },
      "ti yathā tilaphalamattampi jivhagge ṭhapitaṃ sabbattha pharati, evaṃ samā hutvā vahanti. Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma aviheṭhanakammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma pāṇiādīhi pahāraṃ laddhassa tattha tattha lohitaṃ saṇṭhāti, gaṇṭhi gaṇṭhi hutvā antova pubbaṃ gaṇhāti, antova bhijjati, evaṃ so bahurogo hoti. Tathāgatena pana dīgharattaṃ imaṃ ārogyakaraṇakammaṃ kataṃ. Tadassa sadevako loko iminā kāraṇena jānātūti ārogyakaraṃ rasaggasaggilakkhaṇaṃ nibbattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma idameva lakkhaṇaṃ. Appābādhatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānisaṃso."
      }
    ],
    "innerText": "226.Samābhivāhiniyoti yathā tilaphalamattampi jivhagge ṭhapitaṃ sabbattha pharati, evaṃ samā hutvā vahanti. Idha kammaṃ nāma aviheṭhanakammaṃ. Kammasarikkhakaṃ nāma pāṇiādīhi pahāraṃ laddhassa tattha tattha lohitaṃ saṇṭhāti, gaṇṭhi gaṇṭhi hutvā antova pubbaṃ gaṇhāti, antova bhijjati, evaṃ so bahurogo hoti. Tathāgatena pana dīgharattaṃ imaṃ ārogyakaraṇakammaṃ kataṃ. Tadassa sadevako loko iminā kāraṇena jānātūti ārogyakaraṃ rasaggasaggilakkhaṇaṃ nibbattati. Lakkhaṇaṃ nāma idameva lakkhaṇaṃ. Appābādhatā ānisaṃso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "227"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maraṇavadhenā"
      },
      "ti ",
      " ‘‘etaṃ māretha etaṃ ghātethā’’ti evaṃ āṇattena maraṇavadhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubbādhanāyā"
      },
      "ti ",
      " bandhanāgārappavesanena."
    ],
    "innerText": "227.Maraṇavadhenāti ‘‘etaṃ māretha etaṃ ghātethā’’ti evaṃ āṇattena maraṇavadhena. Ubbādhanāyāti bandhanāgārappavesanena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Abhinīlanettādilakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "228"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ca visaṭa"
      },
      "nti kakkaṭako viya akkhīni nīharitvā na kodhavasena pekkhitā ahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ca visācī"
      },
      "ti vaṅkakkhikoṭiyā pekkhitāpi nāhosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ca pana viceyya pekkhitā"
      },
      "ti viceyya pekkhitā nāma yo kujjhitvā yadā naṃ paro oloketi, tadā nimmīleti na oloketi, puna gacchantaṃ kujjhitvā oloketi, evarūpo nāhosi. ‘‘Vineyyapekkhitā’’tipi pāṭho, ayamevattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ujuṃ tathā pasaṭamujumano"
      },
      "ti ujumano hutvā uju pekkhitā hoti, yathā ca ujuṃ, tathā pasaṭaṃ vipulaṃ vitthataṃ pekkhitā hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piyadassano"
      },
      "ti piyāyamānehi passitabbo."
    ],
    "innerText": "228.Na ca visaṭanti kakkaṭako viya akkhīni nīharitvā na kodhavasena pekkhitā ahosi. Na ca visācīti vaṅkakkhikoṭiyā pekkhitāpi nāhosi. Na ca pana viceyya pekkhitāti viceyya pekkhitā nāma yo kujjhitvā yadā naṃ paro oloketi, tadā nimmīleti na oloketi, puna gacchantaṃ kujjhitvā oloketi, evarūpo nāhosi. ‘‘Vineyyapekkhitā’’tipi pāṭho, ayamevattho. Ujuṃ tathā pasaṭamujumanoti ujumano hutvā uju pekkhitā hoti, yathā ca ujuṃ, tathā pasaṭaṃ vipulaṃ vitthataṃ pekkhitā hoti. Piyadassanoti piyāyamānehi passitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma dīgharattaṃ mahājanassa piyacakkhunā olokanakammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma kujjhitvā olokento kāṇo viya kākakkhi viya hoti, vaṅkakkhi pana āvilakkhi ca hotiyeva. Pasannacittassa pana olokayato ",
      " akkhīnaṃ pañcavaṇṇo pasādo paññāyati. Tathāgato ca tathā olokesi. Athassa taṃ dīgharattaṃ piyacakkhunā olokitabhāvaṃ sadevako loko iminā kāraṇena jānātūti imāni nettasampattikarāni dve mahāpurisalakkhaṇāni nibbattanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma idameva lakkhaṇadvayaṃ. Piyadassanatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānisaṃso. Abhiyogino"
      },
      "ti lakkhaṇasatthe yuttā."
    ],
    "innerText": "Idha kammaṃ nāma dīgharattaṃ mahājanassa piyacakkhunā olokanakammaṃ. Kammasarikkhakaṃ nāma kujjhitvā olokento kāṇo viya kākakkhi viya hoti, vaṅkakkhi pana āvilakkhi ca hotiyeva. Pasannacittassa pana olokayato akkhīnaṃ pañcavaṇṇo pasādo paññāyati. Tathāgato ca tathā olokesi. Athassa taṃ dīgharattaṃ piyacakkhunā olokitabhāvaṃ sadevako loko iminā kāraṇena jānātūti imāni nettasampattikarāni dve mahāpurisalakkhaṇāni nibbattanti. Lakkhaṇaṃ nāma idameva lakkhaṇadvayaṃ. Piyadassanatā ānisaṃso. Abhiyoginoti lakkhaṇasatthe yuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Uṇhīsasīsalakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "230"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahujanapubbaṅgamo ahosī"
      },
      "ti bahujanassa pubbaṅgamo ahosi gaṇajeṭṭhako. Tassa diṭṭhānugatiṃ aññe āpajjiṃsu. Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma pubbaṅgamatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma yo pubbaṅgamo hutvā dānādīni kusalakammāni karoti, so amaṅkubhūto sīsaṃ ukkhipitvā pītipāmojjena paripuṇṇasīso vicarati, mahāpuriso ca hoti. Tathāgato ca tathā akāsi. Athassa sadevako loko iminā kāraṇena idaṃ pubbaṅgamakammaṃ jānātūti uṇhīsasīsalakkhaṇaṃ nibbattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma idameva lakkhaṇaṃ. Mahājanānuvattanatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānisaṃso."
      }
    ],
    "innerText": "230.Bahujanapubbaṅgamo ahosīti bahujanassa pubbaṅgamo ahosi gaṇajeṭṭhako. Tassa diṭṭhānugatiṃ aññe āpajjiṃsu. Idha kammaṃ nāma pubbaṅgamatā. Kammasarikkhakaṃ nāma yo pubbaṅgamo hutvā dānādīni kusalakammāni karoti, so amaṅkubhūto sīsaṃ ukkhipitvā pītipāmojjena paripuṇṇasīso vicarati, mahāpuriso ca hoti. Tathāgato ca tathā akāsi. Athassa sadevako loko iminā kāraṇena idaṃ pubbaṅgamakammaṃ jānātūti uṇhīsasīsalakkhaṇaṃ nibbattati. Lakkhaṇaṃ nāma idameva lakkhaṇaṃ. Mahājanānuvattanatā ānisaṃso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "231"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahujanaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hessatī"
      },
      "ti bahujanassa bhavissati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭibhogiyā"
      },
      "ti ",
      " veyyāvaccakarā, etassa bahū veyyāvaccakarā bhavissantīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhiharanti tadā"
      },
      "ti daharakāleyeva tadā evaṃ byākaronti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭihāraka"
      },
      "nti veyyāvaccakarabhāvaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visavī"
      },
      "ti ciṇṇavasī."
    ],
    "innerText": "231.Bahujanaṃhessatīti bahujanassa bhavissati. Paṭibhogiyāti veyyāvaccakarā, etassa bahū veyyāvaccakarā bhavissantīti attho. Abhiharanti tadāti daharakāleyeva tadā evaṃ byākaronti. Paṭihārakanti veyyāvaccakarabhāvaṃ. Visavīti ciṇṇavasī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ekekalomatādilakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "232"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upavattatī"
      },
      "ti ajjhāsayaṃ anuvattati, idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma dīgharattaṃ saccakathanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma dīgharattaṃ advejjhakathāya parisuddhakathāya kathitabhāvamassa sadevako loko iminā kāraṇena jānātūti ekekalomalakkhaṇañca uṇṇālakkhaṇañca nibbattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma idameva lakkhaṇadvayaṃ. Mahājanassa ajjhāsayānukūlena anuvattanatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānisaṃso. Ekekalomūpacitaṅgavā"
      },
      "ti ekekehi lomehi upacitasarīro."
    ],
    "innerText": "232.Upavattatīti ajjhāsayaṃ anuvattati, idha kammaṃ nāma dīgharattaṃ saccakathanaṃ. Kammasarikkhakaṃ nāma dīgharattaṃ advejjhakathāya parisuddhakathāya kathitabhāvamassa sadevako loko iminā kāraṇena jānātūti ekekalomalakkhaṇañca uṇṇālakkhaṇañca nibbattati. Lakkhaṇaṃ nāma idameva lakkhaṇadvayaṃ. Mahājanassa ajjhāsayānukūlena anuvattanatā ānisaṃso. Ekekalomūpacitaṅgavāti ekekehi lomehi upacitasarīro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Cattālīsādilakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "234"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhejjapariso"
      },
      "ti ",
      " abhinditabbapariso. Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma dīgharattaṃ apisuṇavācāya kathanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma pisuṇavācassa kira samaggabhāvaṃ bhindanato dantā aparipuṇṇā ceva honti viraḷā ca. Tathāgatassa pana dīgharattaṃ apisuṇavācataṃ sadevako loko iminā kāraṇena jānātūti idaṃ lakkhaṇadvayaṃ nibbattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma idameva lakkhaṇadvayaṃ. Abhejjaparisatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānisaṃso. Caturo dasā"
      },
      "ti cattāro dasa cattālīsaṃ."
    ],
    "innerText": "234.Abhejjaparisoti abhinditabbapariso. Idha kammaṃ nāma dīgharattaṃ apisuṇavācāya kathanaṃ. Kammasarikkhakaṃ nāma pisuṇavācassa kira samaggabhāvaṃ bhindanato dantā aparipuṇṇā ceva honti viraḷā ca. Tathāgatassa pana dīgharattaṃ apisuṇavācataṃ sadevako loko iminā kāraṇena jānātūti idaṃ lakkhaṇadvayaṃ nibbattati. Lakkhaṇaṃ nāma idameva lakkhaṇadvayaṃ. Abhejjaparisatā ānisaṃso. Caturo dasāti cattāro dasa cattālīsaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pahūtajivhādilakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "236"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādeyyavāco hotī"
      },
      "ti gahetabbavacano hoti. Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma dīgharattaṃ apharusavāditā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma ye pharusavācā honti, te iminā kāraṇena nesaṃ jivhaṃ parivattetvā parivattetvā pharusavācāya kathitabhāvaṃ jano jānātūti baddhajivhā vā honti, gūḷhajivhā vā dvijivhā vā mammanā vā. Ye pana jivhaṃ parivattetvā parivattetvā pharusavācaṃ na vadanti, te baddhajivhā gūḷhajivhā dvijivhā na honti. Mudu nesaṃ jivhā hoti rattakambalavaṇṇā. Tasmā tathāgatassa dīgharattaṃ jivhaṃ parivattetvā pharusāya vācāya akathitabhāvaṃ sadevako loko iminā kāraṇena jānātūti pahūtajivhālakkhaṇaṃ nibbattati. Pharusavācaṃ kathentānañca saddo bhijjati. Te saddabhedaṃ katvā pharusavācāya kathitabhāvaṃ jano jānātūti ",
      " chinnassarā vā honti bhinnassarā vā kākassarā vā. Ye pana sarabhedakaraṃ pharusavācaṃ na kathenti, tesaṃ saddo madhuro ca hoti pemanīyo. Tasmā tathāgatassa dīgharattaṃ sarabhedakarāya pharusavācāya akathitabhāvaṃ sadevako loko iminā kāraṇena jānātūti brahmassaralakkhaṇaṃ nibbattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma idameva lakkhaṇadvayaṃ. Ādeyyavacanatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānisaṃso."
      }
    ],
    "innerText": "236.Ādeyyavāco hotīti gahetabbavacano hoti. Idha kammaṃ nāma dīgharattaṃ apharusavāditā. Kammasarikkhakaṃ nāma ye pharusavācā honti, te iminā kāraṇena nesaṃ jivhaṃ parivattetvā parivattetvā pharusavācāya kathitabhāvaṃ jano jānātūti baddhajivhā vā honti, gūḷhajivhā vā dvijivhā vā mammanā vā. Ye pana jivhaṃ parivattetvā parivattetvā pharusavācaṃ na vadanti, te baddhajivhā gūḷhajivhā dvijivhā na honti. Mudu nesaṃ jivhā hoti rattakambalavaṇṇā. Tasmā tathāgatassa dīgharattaṃ jivhaṃ parivattetvā pharusāya vācāya akathitabhāvaṃ sadevako loko iminā kāraṇena jānātūti pahūtajivhālakkhaṇaṃ nibbattati. Pharusavācaṃ kathentānañca saddo bhijjati. Te saddabhedaṃ katvā pharusavācāya kathitabhāvaṃ jano jānātūti chinnassarā vā honti bhinnassarā vā kākassarā vā. Ye pana sarabhedakaraṃ pharusavācaṃ na kathenti, tesaṃ saddo madhuro ca hoti pemanīyo. Tasmā tathāgatassa dīgharattaṃ sarabhedakarāya pharusavācāya akathitabhāvaṃ sadevako loko iminā kāraṇena jānātūti brahmassaralakkhaṇaṃ nibbattati. Lakkhaṇaṃ nāma idameva lakkhaṇadvayaṃ. Ādeyyavacanatā ānisaṃso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "237"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubbādhika"
      },
      "nti akkosayuttattā ābādhakariṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahujanappamaddana"
      },
      "nti bahujanānaṃ pamaddaniṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abāḷhaṃ giraṃ so na bhaṇi pharusa"
      },
      "nti ettha akāro parato bhaṇisaddena yojetabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bāḷha"
      },
      "nti balavaṃ atipharusaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bāḷhaṃ giraṃ so na abhaṇī"
      },
      "ti ayamettha attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Susaṃhita"
      },
      "nti suṭṭhu pemasañhitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakhila"
      },
      "nti ",
      " mudukaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vācā"
      },
      "ti vācāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṇṇasukhā"
      },
      "ti kaṇṇasukhāyo. ‘‘Kaṇṇasukha’’ntipi pāṭho, yathā kaṇṇānaṃ sukhaṃ hoti, evaṃ erayatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vedayathā"
      },
      "ti vedayittha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brahmassaratta"
      },
      "nti brahmassarataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahuno bahu"
      },
      "nti bahujanassa bahuṃ. ‘‘Bahūnaṃ bahunti’’pi pāṭho, bahujanānaṃ bahunti attho."
    ],
    "innerText": "237.Ubbādhikanti akkosayuttattā ābādhakariṃ bahujanappamaddananti bahujanānaṃ pamaddaniṃ abāḷhaṃ giraṃ so na bhaṇi pharusanti ettha akāro parato bhaṇisaddena yojetabbo. Bāḷhanti balavaṃ atipharusaṃ. Bāḷhaṃ giraṃ so na abhaṇīti ayamettha attho. Susaṃhitanti suṭṭhu pemasañhitaṃ. Sakhilanti mudukaṃ. Vācāti vācāyo. Kaṇṇasukhāti kaṇṇasukhāyo. ‘‘Kaṇṇasukha’’ntipi pāṭho, yathā kaṇṇānaṃ sukhaṃ hoti, evaṃ erayatīti attho. Vedayathāti vedayittha. Brahmassarattanti brahmassarataṃ. Bahuno bahunti bahujanassa bahuṃ. ‘‘Bahūnaṃ bahunti’’pi pāṭho, bahujanānaṃ bahunti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sīhahanulakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "238"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appadhaṃsiko hotī"
      },
      "ti guṇato vā ṭhānato vā padhaṃsetuṃ cāvetuṃ asakkuṇeyyo. Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma palāpakathāya akathanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma ye taṃ kathenti, te iminā kāraṇena nesaṃ hanukaṃ cāletvā cāletvā palāpakathāya kathitabhāvaṃ jano jānātūti antopaviṭṭhahanukā vā vaṅkahanukā vā pabbhārahanukā vā honti. Tathāgato pana tathā na kathesi. Tenassa hanukaṃ cāletvā cāletvā dīgharattaṃ palāpakathāya akathitabhāvaṃ sadevako loko iminā kāraṇena jānātūti sīhahanulakkhaṇaṃ nibbattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma idameva lakkhaṇaṃ. Appadhaṃsikatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānisaṃso."
      }
    ],
    "innerText": "238.Appadhaṃsiko hotīti guṇato vā ṭhānato vā padhaṃsetuṃ cāvetuṃ asakkuṇeyyo. Idha kammaṃ nāma palāpakathāya akathanaṃ. Kammasarikkhakaṃ nāma ye taṃ kathenti, te iminā kāraṇena nesaṃ hanukaṃ cāletvā cāletvā palāpakathāya kathitabhāvaṃ jano jānātūti antopaviṭṭhahanukā vā vaṅkahanukā vā pabbhārahanukā vā honti. Tathāgato pana tathā na kathesi. Tenassa hanukaṃ cāletvā cāletvā dīgharattaṃ palāpakathāya akathitabhāvaṃ sadevako loko iminā kāraṇena jānātūti sīhahanulakkhaṇaṃ nibbattati. Lakkhaṇaṃ nāma idameva lakkhaṇaṃ. Appadhaṃsikatā ānisaṃso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "239"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avikiṇṇavacanabyappatho cā"
      },
      "ti avikiṇṇavacanānaṃ viya purimabodhisattānaṃ vacanapatho assāti avikiṇṇavacanabyappatho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvidugamavaratarahanuttamalatthā"
      },
      "ti dvīhi dvīhi gacchatīti ",
      " dvidugamo, dvīhi dvīhīti catūhi, catuppadānaṃ varatarassa sīhasseva hanubhāvaṃ alatthāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manujādhipatī"
      },
      "ti manujānaṃ adhipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathatto"
      },
      "ti tathasabhāvo."
    ],
    "innerText": "239.Avikiṇṇavacanabyappatho cāti avikiṇṇavacanānaṃ viya purimabodhisattānaṃ vacanapatho assāti avikiṇṇavacanabyappatho. Dvidugamavaratarahanuttamalatthāti dvīhi dvīhi gacchatīti dvidugamo, dvīhi dvīhīti catūhi, catuppadānaṃ varatarassa sīhasseva hanubhāvaṃ alatthāti attho. Manujādhipatīti manujānaṃ adhipati. Tathattoti tathasabhāvo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Samadantādilakkhaṇavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "240"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suciparivāro"
      },
      "ti ",
      " parisuddhaparivāro. Idha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " nāma sammājīvatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasarikkhakaṃ"
      },
      " nāma yo visamena saṃkiliṭṭhājīvena jīvitaṃ kappeti, tassa dantāpi visamā honti dāṭhāpi kiliṭṭhā. Tathāgatassa pana samena suddhājīvena jīvitaṃ kappitabhāvaṃ sadevako loko iminā kāraṇena jānātūti samadantalakkhaṇañca susukkadāṭhālakkhaṇañca nibbattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaṃ"
      },
      " nāma idameva lakkhaṇadvayaṃ. Suciparivāratā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānisaṃso."
      }
    ],
    "innerText": "240.Suciparivāroti parisuddhaparivāro. Idha kammaṃ nāma sammājīvatā. Kammasarikkhakaṃ nāma yo visamena saṃkiliṭṭhājīvena jīvitaṃ kappeti, tassa dantāpi visamā honti dāṭhāpi kiliṭṭhā. Tathāgatassa pana samena suddhājīvena jīvitaṃ kappitabhāvaṃ sadevako loko iminā kāraṇena jānātūti samadantalakkhaṇañca susukkadāṭhālakkhaṇañca nibbattati. Lakkhaṇaṃ nāma idameva lakkhaṇadvayaṃ. Suciparivāratā ānisaṃso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "241"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avassajī"
      },
      "ti ",
      " pahāsi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tidivapuravarasamo"
      },
      "ti tidivapuravarena sakkena samo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lapanaja"
      },
      "nti mukhajaṃ, dantanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dijasamasukkasucisobhanadanto"
      },
      "ti dve vāre jātattā dijanāmakā sukkā suci sobhanā ca dantā assāti dijasamasukkasucisobhanadanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ca janapadatudana"
      },
      "nti yo tassa cakkavāḷaparicchinno janapado, tassa aññena tudanaṃ pīḷā vā ābādho vā natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hitamapi ca bahujana sukhañca carantī"
      },
      "ti bahujanā samānasukhadukkhā hutvā tasmiṃ janapade aññamaññassa hitañceva sukhañca caranti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipāpo"
      },
      "ti vigatapāpo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vigatadarathakilamatho"
      },
      "ti vigatakāyikadarathakilamatho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Malakhilakalikilese panudehī"
      },
      "ti rāgādimalānañceva rāgādikhilānañca dosakalīnañca sabbakilesānañca apanudehi. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "241.Avassajīti pahāsi tidivapuravarasamoti tidivapuravarena sakkena samo. Lapanajanti mukhajaṃ, dantanti attho. Dijasamasukkasucisobhanadantoti dve vāre jātattā dijanāmakā sukkā suci sobhanā ca dantā assāti dijasamasukkasucisobhanadanto. Na ca janapadatudananti yo tassa cakkavāḷaparicchinno janapado, tassa aññena tudanaṃ pīḷā vā ābādho vā natthi. Hitamapi ca bahujana sukhañca carantīti bahujanā samānasukhadukkhā hutvā tasmiṃ janapade aññamaññassa hitañceva sukhañca caranti. Vipāpoti vigatapāpo. Vigatadarathakilamathoti vigatakāyikadarathakilamatho. Malakhilakalikilese panudehīti rāgādimalānañceva rāgādikhilānañca dosakalīnañca sabbakilesānañca apanudehi. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sumaṅgalavilāsiniyā dīghanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Lakkhaṇasuttavaṇṇanā niṭṭhitā."
  }
]