[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammāsambuddhassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "nikaya"
    },
    "innerText": "Dīghanikāyo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "book"
    },
    "innerText": "Pāthikavaggapāḷi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "1. Pāthikasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sunakkhattavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā mallesu viharati anupiyaṃ nāma ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anuppiyaṃ nāma (syā.)]"
      },
      " mallānaṃ nigamo. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya anupiyaṃ piṇḍāya pāvisi. Atha kho bhagavato etadahosi – ‘‘atippago kho tāva anupiyāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anupiyaṃ (ka.)]"
      },
      " piṇḍāya carituṃ. Yaṃnūnāhaṃ yena bhaggavagottassa paribbājakassa ārāmo, yena bhaggavagotto paribbājako tenupasaṅkameyya’’nti."
    ],
    "innerText": "1. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā mallesu viharati anupiyaṃ nāma [anuppiyaṃ nāma (syā.)] mallānaṃ nigamo. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya anupiyaṃ piṇḍāya pāvisi. Atha kho bhagavato etadahosi – ‘‘atippago kho tāva anupiyāyaṃ [anupiyaṃ (ka.)] piṇḍāya carituṃ. Yaṃnūnāhaṃ yena bhaggavagottassa paribbājakassa ārāmo, yena bhaggavagotto paribbājako tenupasaṅkameyya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Atha ",
      " kho bhagavā yena bhaggavagottassa paribbājakassa ārāmo, yena bhaggavagotto paribbājako tenupasaṅkami. Atha kho bhaggavagotto paribbājako bhagavantaṃ etadavoca – ‘‘etu kho, bhante, bhagavā. Svāgataṃ, bhante, bhagavato. Cirassaṃ kho, bhante, bhagavā imaṃ pariyāyamakāsi yadidaṃ idhāgamanāya. Nisīdatu, bhante, bhagavā, idamāsanaṃ paññatta’’nti. Nisīdi bhagavā paññatte āsane. Bhaggavagottopi kho paribbājako aññataraṃ ",
      " nīcaṃ āsanaṃ gahetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho bhaggavagotto paribbājako bhagavantaṃ etadavoca – ‘‘purimāni, bhante, divasāni ",
      " purimatarāni sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ etadavoca – ‘paccakkhāto dāni mayā, bhaggava, bhagavā. Na dānāhaṃ bhagavantaṃ uddissa viharāmī’ti. Kaccetaṃ, bhante, tatheva, yathā sunakkhatto licchaviputto avacā’’ti? ‘‘Tatheva kho etaṃ, bhaggava, yathā sunakkhatto licchaviputto avaca’’."
    ],
    "innerText": "2. Atha kho bhagavā yena bhaggavagottassa paribbājakassa ārāmo, yena bhaggavagotto paribbājako tenupasaṅkami. Atha kho bhaggavagotto paribbājako bhagavantaṃ etadavoca – ‘‘etu kho, bhante, bhagavā. Svāgataṃ, bhante, bhagavato. Cirassaṃ kho, bhante, bhagavā imaṃ pariyāyamakāsi yadidaṃ idhāgamanāya. Nisīdatu, bhante, bhagavā, idamāsanaṃ paññatta’’nti. Nisīdi bhagavā paññatte āsane. Bhaggavagottopi kho paribbājako aññataraṃ nīcaṃ āsanaṃ gahetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho bhaggavagotto paribbājako bhagavantaṃ etadavoca – ‘‘purimāni, bhante, divasāni purimatarāni sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ etadavoca – ‘paccakkhāto dāni mayā, bhaggava, bhagavā. Na dānāhaṃ bhagavantaṃ uddissa viharāmī’ti. Kaccetaṃ, bhante, tatheva, yathā sunakkhatto licchaviputto avacā’’ti? ‘‘Tatheva kho etaṃ, bhaggava, yathā sunakkhatto licchaviputto avaca’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Purimāni, bhaggava, divasāni purimatarāni sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho, bhaggava, sunakkhatto licchaviputto maṃ etadavoca – ‘paccakkhāmi dānāhaṃ, bhante, bhagavantaṃ. Na dānāhaṃ, bhante, bhagavantaṃ uddissa viharissāmī’ti. ‘Evaṃ vutte, ahaṃ, bhaggava, sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘api nu tāhaṃ, sunakkhatta, evaṃ avacaṃ, ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhī’ti? ‘No hetaṃ, bhante’. ‘Tvaṃ ",
      " vā pana maṃ evaṃ avaca – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmī’ti? ‘No hetaṃ, bhante’. ‘Iti kira, sunakkhatta, nevāhaṃ taṃ vadāmi – ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhīti. Napi kira maṃ tvaṃ vadesi – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmīti. Evaṃ sante, moghapurisa, ko santo kaṃ paccācikkhasi? Passa, moghapurisa, yāvañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yāva ca (ka.)]"
      },
      " te idaṃ aparaddha’nti."
    ],
    "innerText": "3. Purimāni, bhaggava, divasāni purimatarāni sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho, bhaggava, sunakkhatto licchaviputto maṃ etadavoca – ‘paccakkhāmi dānāhaṃ, bhante, bhagavantaṃ. Na dānāhaṃ, bhante, bhagavantaṃ uddissa viharissāmī’ti. ‘Evaṃ vutte, ahaṃ, bhaggava, sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘api nu tāhaṃ, sunakkhatta, evaṃ avacaṃ, ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhī’ti? ‘No hetaṃ, bhante’. ‘Tvaṃ vā pana maṃ evaṃ avaca – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmī’ti? ‘No hetaṃ, bhante’. ‘Iti kira, sunakkhatta, nevāhaṃ taṃ vadāmi – ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhīti. Napi kira maṃ tvaṃ vadesi – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmīti. Evaṃ sante, moghapurisa, ko santo kaṃ paccācikkhasi? Passa, moghapurisa, yāvañca [yāva ca (ka.)] te idaṃ aparaddha’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". ‘Na hi pana me, bhante, bhagavā uttarimanussadhammā iddhipāṭihāriyaṃ karotī’ti. ‘Api nu tāhaṃ, sunakkhatta, evaṃ avacaṃ – ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhi, ahaṃ te uttarimanussadhammā iddhipāṭihāriyaṃ karissāmī’ti? ‘No hetaṃ, bhante’. ‘Tvaṃ vā pana maṃ evaṃ avaca – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmi, bhagavā me uttarimanussadhammā iddhipāṭihāriyaṃ karissatī’ti? ‘No hetaṃ, bhante’. ‘Iti kira, sunakkhatta, nevāhaṃ taṃ vadāmi – ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhi, ahaṃ te uttarimanussadhammā iddhipāṭihāriyaṃ karissāmī’ti; napi kira maṃ tvaṃ vadesi – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmi, bhagavā me uttarimanussadhammā iddhipāṭihāriyaṃ karissatī’ti. Evaṃ sante, moghapurisa ",
      ", ko santo kaṃ paccācikkhasi? Taṃ kiṃ maññasi, sunakkhatta, kate vā uttarimanussadhammā iddhipāṭihāriye akate vā uttarimanussadhammā ",
      " iddhipāṭihāriye yassatthāya mayā dhammo desito so niyyāti takkarassa sammā dukkhakkhayāyā’ti? ‘Kate ",
      " vā, bhante, uttarimanussadhammā iddhipāṭihāriye akate vā uttarimanussadhammā iddhipāṭihāriye yassatthāya bhagavatā dhammo desito so niyyāti takkarassa sammā dukkhakkhayāyā’ti. ‘Iti kira, sunakkhatta, kate vā uttarimanussadhammā iddhipāṭihāriye, akate vā uttarimanussadhammā iddhipāṭihāriye, yassatthāya mayā dhammo desito, so niyyāti takkarassa ",
      " sammā dukkhakkhayāya. Tatra, sunakkhatta, kiṃ uttarimanussadhammā iddhipāṭihāriyaṃ kataṃ karissati? Passa, moghapurisa, yāvañca te idaṃ aparaddha’nti."
    ],
    "innerText": "4. ‘Na hi pana me, bhante, bhagavā uttarimanussadhammā iddhipāṭihāriyaṃ karotī’ti. ‘Api nu tāhaṃ, sunakkhatta, evaṃ avacaṃ – ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhi, ahaṃ te uttarimanussadhammā iddhipāṭihāriyaṃ karissāmī’ti? ‘No hetaṃ, bhante’. ‘Tvaṃ vā pana maṃ evaṃ avaca – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmi, bhagavā me uttarimanussadhammā iddhipāṭihāriyaṃ karissatī’ti? ‘No hetaṃ, bhante’. ‘Iti kira, sunakkhatta, nevāhaṃ taṃ vadāmi – ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhi, ahaṃ te uttarimanussadhammā iddhipāṭihāriyaṃ karissāmī’ti; napi kira maṃ tvaṃ vadesi – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmi, bhagavā me uttarimanussadhammā iddhipāṭihāriyaṃ karissatī’ti. Evaṃ sante, moghapurisa , ko santo kaṃ paccācikkhasi? Taṃ kiṃ maññasi, sunakkhatta, kate vā uttarimanussadhammā iddhipāṭihāriye akate vā uttarimanussadhammā iddhipāṭihāriye yassatthāya mayā dhammo desito so niyyāti takkarassa sammā dukkhakkhayāyā’ti? ‘Kate vā, bhante, uttarimanussadhammā iddhipāṭihāriye akate vā uttarimanussadhammā iddhipāṭihāriye yassatthāya bhagavatā dhammo desito so niyyāti takkarassa sammā dukkhakkhayāyā’ti. ‘Iti kira, sunakkhatta, kate vā uttarimanussadhammā iddhipāṭihāriye, akate vā uttarimanussadhammā iddhipāṭihāriye, yassatthāya mayā dhammo desito, so niyyāti takkarassa sammā dukkhakkhayāya. Tatra, sunakkhatta, kiṃ uttarimanussadhammā iddhipāṭihāriyaṃ kataṃ karissati? Passa, moghapurisa, yāvañca te idaṃ aparaddha’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". ‘Na hi pana me, bhante, bhagavā aggaññaṃ paññapetī’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paññāpetīti (pī.)]"
      },
      "? ‘Api nu tāhaṃ, sunakkhatta, evaṃ avacaṃ – ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhi, ahaṃ te aggaññaṃ paññapessāmī’ti? ‘No hetaṃ, bhante’. ‘Tvaṃ vā pana maṃ evaṃ avaca – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmi, bhagavā me aggaññaṃ paññapessatī’ti? ‘No hetaṃ, bhante’. ‘Iti kira, sunakkhatta, nevāhaṃ taṃ vadāmi – ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhi, ahaṃ te aggaññaṃ paññapessāmīti. Napi kira maṃ tvaṃ vadesi – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmi, bhagavā me aggaññaṃ paññapessatī’ti. Evaṃ sante, moghapurisa, ko santo kaṃ paccācikkhasi? Taṃ kiṃ maññasi, sunakkhatta, paññatte vā aggaññe, apaññatte vā aggaññe, yassatthāya mayā dhammo desito, so niyyāti takkarassa sammā dukkhakkhayāyā’ti? ‘Paññatte vā, bhante, aggaññe, apaññatte vā aggaññe, yassatthāya bhagavatā dhammo desito, so niyyāti takkarassa sammā dukkhakkhayāyā’ti. ‘Iti ",
      " kira, sunakkhatta, paññatte vā aggaññe, apaññatte vā aggaññe, yassatthāya mayā dhammo desito, so niyyāti takkarassa sammā dukkhakkhayāya. Tatra, sunakkhatta, kiṃ aggaññaṃ paññattaṃ ",
      " karissati? Passa, moghapurisa, yāvañca te idaṃ aparaddhaṃ’."
    ],
    "innerText": "5. ‘Na hi pana me, bhante, bhagavā aggaññaṃ paññapetī’ti [paññāpetīti (pī.)]? ‘Api nu tāhaṃ, sunakkhatta, evaṃ avacaṃ – ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhi, ahaṃ te aggaññaṃ paññapessāmī’ti? ‘No hetaṃ, bhante’. ‘Tvaṃ vā pana maṃ evaṃ avaca – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmi, bhagavā me aggaññaṃ paññapessatī’ti? ‘No hetaṃ, bhante’. ‘Iti kira, sunakkhatta, nevāhaṃ taṃ vadāmi – ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhi, ahaṃ te aggaññaṃ paññapessāmīti. Napi kira maṃ tvaṃ vadesi – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmi, bhagavā me aggaññaṃ paññapessatī’ti. Evaṃ sante, moghapurisa, ko santo kaṃ paccācikkhasi? Taṃ kiṃ maññasi, sunakkhatta, paññatte vā aggaññe, apaññatte vā aggaññe, yassatthāya mayā dhammo desito, so niyyāti takkarassa sammā dukkhakkhayāyā’ti? ‘Paññatte vā, bhante, aggaññe, apaññatte vā aggaññe, yassatthāya bhagavatā dhammo desito, so niyyāti takkarassa sammā dukkhakkhayāyā’ti. ‘Iti kira, sunakkhatta, paññatte vā aggaññe, apaññatte vā aggaññe, yassatthāya mayā dhammo desito, so niyyāti takkarassa sammā dukkhakkhayāya. Tatra, sunakkhatta, kiṃ aggaññaṃ paññattaṃ karissati? Passa, moghapurisa, yāvañca te idaṃ aparaddhaṃ’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". ‘Anekapariyāyena kho te, sunakkhatta, mama vaṇṇo bhāsito vajjigāme – itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato ",
      " lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavāti. Iti kho te, sunakkhatta, anekapariyāyena mama vaṇṇo bhāsito vajjigāme."
    ],
    "innerText": "6. ‘Anekapariyāyena kho te, sunakkhatta, mama vaṇṇo bhāsito vajjigāme – itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavāti. Iti kho te, sunakkhatta, anekapariyāyena mama vaṇṇo bhāsito vajjigāme."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Anekapariyāyena ",
      " kho te, sunakkhatta, dhammassa vaṇṇo bhāsito vajjigāme – svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhīti. Iti kho te, sunakkhatta, anekapariyāyena dhammassa vaṇṇo bhāsito vajjigāme."
    ],
    "innerText": "‘Anekapariyāyena kho te, sunakkhatta, dhammassa vaṇṇo bhāsito vajjigāme – svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhīti. Iti kho te, sunakkhatta, anekapariyāyena dhammassa vaṇṇo bhāsito vajjigāme."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘Anekapariyāyena kho te, sunakkhatta, saṅghassa vaṇṇo bhāsito vajjigāme – suppaṭipanno bhagavato sāvakasaṅgho, ujuppaṭipanno bhagavato sāvakasaṅgho, ñāyappaṭipanno bhagavato sāvakasaṅgho, sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā, esa bhagavato sāvakasaṅgho, āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassāti. Iti kho te, sunakkhatta, anekapariyāyena saṅghassa vaṇṇo bhāsito vajjigāme."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Ārocayāmi kho te, sunakkhatta, paṭivedayāmi kho te, sunakkhatta. Bhavissanti kho te, sunakkhatta, vattāro, no visahi sunakkhatto licchaviputto samaṇe gotame brahmacariyaṃ carituṃ, so avisahanto ",
      " sikkhaṃ paccakkhāya hīnāyāvattoti. Iti kho te, sunakkhatta, bhavissanti vattāro’ti."
    ],
    "innerText": "‘Ārocayāmi kho te, sunakkhatta, paṭivedayāmi kho te, sunakkhatta. Bhavissanti kho te, sunakkhatta, vattāro, no visahi sunakkhatto licchaviputto samaṇe gotame brahmacariyaṃ carituṃ, so avisahanto sikkhaṃ paccakkhāya hīnāyāvattoti. Iti kho te, sunakkhatta, bhavissanti vattāro’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ pi ",
      " kho, bhaggava, sunakkhatto licchaviputto mayā vuccamāno apakkameva imasmā dhammavinayā, yathā taṃ āpāyiko nerayiko."
    ],
    "innerText": "Evaṃ pi kho, bhaggava, sunakkhatto licchaviputto mayā vuccamāno apakkameva imasmā dhammavinayā, yathā taṃ āpāyiko nerayiko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Korakkhattiyavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". ‘‘Ekamidāhaṃ, bhaggava, samayaṃ thūlūsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bumūsu (sī. pī.)]"
      },
      " viharāmi uttarakā nāma thūlūnaṃ nigamo. Atha khvāhaṃ, bhaggava, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sunakkhattena licchaviputtena pacchāsamaṇena uttarakaṃ piṇḍāya pāvisiṃ. Tena kho pana samayena acelo korakkhattiyo kukkuravatiko catukkuṇḍiko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[catukuṇḍiko (sī. pī.) catukoṇḍiko (syā. ka.)]"
      },
      " chamānikiṇṇaṃ bhakkhasaṃ mukheneva khādati, mukheneva bhuñjati. Addasā kho, bhaggava, sunakkhatto licchaviputto acelaṃ korakkhattiyaṃ kukkuravatikaṃ ",
      " catukkuṇḍikaṃ chamānikiṇṇaṃ bhakkhasaṃ mukheneva khādantaṃ mukheneva bhuñjantaṃ. Disvānassa etadahosi – ‘sādhurūpo vata, bho, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[arahaṃ (sī. syā. pī.)]"
      },
      " samaṇo catukkuṇḍiko chamānikiṇṇaṃ bhakkhasaṃ mukheneva khādati, mukheneva bhuñjatī’ti."
    ],
    "innerText": "7. ‘‘Ekamidāhaṃ, bhaggava, samayaṃ thūlūsu [bumūsu (sī. pī.)] viharāmi uttarakā nāma thūlūnaṃ nigamo. Atha khvāhaṃ, bhaggava, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sunakkhattena licchaviputtena pacchāsamaṇena uttarakaṃ piṇḍāya pāvisiṃ. Tena kho pana samayena acelo korakkhattiyo kukkuravatiko catukkuṇḍiko [catukuṇḍiko (sī. pī.) catukoṇḍiko (syā. ka.)] chamānikiṇṇaṃ bhakkhasaṃ mukheneva khādati, mukheneva bhuñjati. Addasā kho, bhaggava, sunakkhatto licchaviputto acelaṃ korakkhattiyaṃ kukkuravatikaṃ catukkuṇḍikaṃ chamānikiṇṇaṃ bhakkhasaṃ mukheneva khādantaṃ mukheneva bhuñjantaṃ. Disvānassa etadahosi – ‘sādhurūpo vata, bho, ayaṃ [arahaṃ (sī. syā. pī.)] samaṇo catukkuṇḍiko chamānikiṇṇaṃ bhakkhasaṃ mukheneva khādati, mukheneva bhuñjatī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha khvāhaṃ, bhaggava, sunakkhattassa licchaviputtassa cetasā cetoparivitakkamaññāya sunakkhattaṃ ",
      " licchaviputtaṃ etadavocaṃ – ‘tvampi nāma, moghapurisa, samaṇo sakyaputtiyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[moghapurisa sakyaputtiyo (sī. syā. pī.)]"
      },
      " paṭijānissasī’ti! ‘Kiṃ pana maṃ, bhante, bhagavā evamāha – ‘tvampi ",
      " nāma, moghapurisa, samaṇo sakyaputtiyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[moghapurisa sakyaputtiyo (sī. syā. pī.)]"
      },
      " paṭijānissasī’ti? ‘Nanu te, sunakkhatta, imaṃ acelaṃ korakkhattiyaṃ kukkuravatikaṃ catukkuṇḍikaṃ chamānikiṇṇaṃ bhakkhasaṃ mukheneva khādantaṃ mukheneva ",
      " bhuñjantaṃ disvāna etadahosi – sādhurūpo vata, bho, ayaṃ samaṇo catukkuṇḍiko chamānikiṇṇaṃ bhakkhasaṃ mukheneva khādati, mukheneva bhuñjatī’ti? ‘Evaṃ, bhante. Kiṃ pana, bhante, bhagavā arahattassa maccharāyatī’ti? ‘Na kho ahaṃ, moghapurisa, arahattassa maccharāyāmi. Api ca, tuyhevetaṃ pāpakaṃ diṭṭhigataṃ uppannaṃ, taṃ pajaha. Mā te ahosi dīgharattaṃ ahitāya dukkhāya. Yaṃ kho panetaṃ, sunakkhatta, maññasi acelaṃ korakkhattiyaṃ – sādhurūpo ayaṃ samaṇoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[maññasi ‘‘acelo korakhattiyo sādhurūpo arahaṃ samaṇoti’’ (syā.)]"
      },
      ". So sattamaṃ divasaṃ alasakena kālaṅkarissati. Kālaṅkato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kālakato (sī. syā. pī.)]"
      },
      " ca kālakañcikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kālakañjā (sī. pī.), kālakañjikā (syā.)]"
      },
      " nāma asurā sabbanihīno asurakāyo, tatra upapajjissati. Kālaṅkatañca naṃ bīraṇatthambake susāne chaḍḍessanti. Ākaṅkhamāno ca tvaṃ, sunakkhatta, acelaṃ korakkhattiyaṃ upasaṅkamitvā puccheyyāsi – jānāsi, āvuso korakkhattiya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[acela korakhattiya (ka.)]"
      },
      ", attano gatinti? Ṭhānaṃ kho panetaṃ, sunakkhatta, vijjati yaṃ te acelo korakkhattiyo byākarissati – jānāmi, āvuso sunakkhatta, attano gatiṃ; kālakañcikā nāma asurā sabbanihīno asurakāyo, tatrāmhi upapannoti."
    ],
    "innerText": "‘‘Atha khvāhaṃ, bhaggava, sunakkhattassa licchaviputtassa cetasā cetoparivitakkamaññāya sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘tvampi nāma, moghapurisa, samaṇo sakyaputtiyo [moghapurisa sakyaputtiyo (sī. syā. pī.)] paṭijānissasī’ti! ‘Kiṃ pana maṃ, bhante, bhagavā evamāha – ‘tvampi nāma, moghapurisa, samaṇo sakyaputtiyo [moghapurisa sakyaputtiyo (sī. syā. pī.)] paṭijānissasī’ti? ‘Nanu te, sunakkhatta, imaṃ acelaṃ korakkhattiyaṃ kukkuravatikaṃ catukkuṇḍikaṃ chamānikiṇṇaṃ bhakkhasaṃ mukheneva khādantaṃ mukheneva bhuñjantaṃ disvāna etadahosi – sādhurūpo vata, bho, ayaṃ samaṇo catukkuṇḍiko chamānikiṇṇaṃ bhakkhasaṃ mukheneva khādati, mukheneva bhuñjatī’ti? ‘Evaṃ, bhante. Kiṃ pana, bhante, bhagavā arahattassa maccharāyatī’ti? ‘Na kho ahaṃ, moghapurisa, arahattassa maccharāyāmi. Api ca, tuyhevetaṃ pāpakaṃ diṭṭhigataṃ uppannaṃ, taṃ pajaha. Mā te ahosi dīgharattaṃ ahitāya dukkhāya. Yaṃ kho panetaṃ, sunakkhatta, maññasi acelaṃ korakkhattiyaṃ – sādhurūpo ayaṃ samaṇoti [maññasi ‘‘acelo korakhattiyo sādhurūpo arahaṃ samaṇoti’’ (syā.)]. So sattamaṃ divasaṃ alasakena kālaṅkarissati. Kālaṅkato [kālakato (sī. syā. pī.)] ca kālakañcikā [kālakañjā (sī. pī.), kālakañjikā (syā.)] nāma asurā sabbanihīno asurakāyo, tatra upapajjissati. Kālaṅkatañca naṃ bīraṇatthambake susāne chaḍḍessanti. Ākaṅkhamāno ca tvaṃ, sunakkhatta, acelaṃ korakkhattiyaṃ upasaṅkamitvā puccheyyāsi – jānāsi, āvuso korakkhattiya [acela korakhattiya (ka.)], attano gatinti? Ṭhānaṃ kho panetaṃ, sunakkhatta, vijjati yaṃ te acelo korakkhattiyo byākarissati – jānāmi, āvuso sunakkhatta, attano gatiṃ; kālakañcikā nāma asurā sabbanihīno asurakāyo, tatrāmhi upapannoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yena acelo korakkhattiyo tenupasaṅkami; upasaṅkamitvā acelaṃ korakkhattiyaṃ etadavoca ",
      " – ‘byākato khosi, āvuso korakkhattiya, samaṇena gotamena – acelo korakkhattiyo sattamaṃ divasaṃ alasakena kālaṅkarissati. Kālaṅkato ",
      " ca kālakañcikā nāma asurā sabbanihīno asurakāyo ",
      ", tatra upapajjissati. Kālaṅkatañca naṃ bīraṇatthambake susāne chaḍḍessantī’ti. Yena tvaṃ, āvuso korakkhattiya, mattaṃ mattañca bhattaṃ bhuñjeyyāsi, mattaṃ mattañca pānīyaṃ piveyyāsi. Yathā samaṇassa gotamassa micchā assa vacana’nti."
    ],
    "innerText": "‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yena acelo korakkhattiyo tenupasaṅkami; upasaṅkamitvā acelaṃ korakkhattiyaṃ etadavoca – ‘byākato khosi, āvuso korakkhattiya, samaṇena gotamena – acelo korakkhattiyo sattamaṃ divasaṃ alasakena kālaṅkarissati. Kālaṅkato ca kālakañcikā nāma asurā sabbanihīno asurakāyo , tatra upapajjissati. Kālaṅkatañca naṃ bīraṇatthambake susāne chaḍḍessantī’ti. Yena tvaṃ, āvuso korakkhattiya, mattaṃ mattañca bhattaṃ bhuñjeyyāsi, mattaṃ mattañca pānīyaṃ piveyyāsi. Yathā samaṇassa gotamassa micchā assa vacana’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ". ‘‘Atha kho, bhaggava, sunakkhatto licchaviputto ekadvīhikāya sattarattindivāni gaṇesi, yathā taṃ tathāgatassa asaddahamāno. Atha kho, bhaggava, acelo korakkhattiyo sattamaṃ divasaṃ alasakena kālamakāsi. Kālaṅkato ca kālakañcikā nāma asurā sabbanihīno asurakāyo, tatra upapajji. Kālaṅkatañca naṃ bīraṇatthambake susāne chaḍḍesuṃ."
    ],
    "innerText": "8. ‘‘Atha kho, bhaggava, sunakkhatto licchaviputto ekadvīhikāya sattarattindivāni gaṇesi, yathā taṃ tathāgatassa asaddahamāno. Atha kho, bhaggava, acelo korakkhattiyo sattamaṃ divasaṃ alasakena kālamakāsi. Kālaṅkato ca kālakañcikā nāma asurā sabbanihīno asurakāyo, tatra upapajji. Kālaṅkatañca naṃ bīraṇatthambake susāne chaḍḍesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ". ‘‘Assosi ",
      " kho, bhaggava, sunakkhatto licchaviputto – ‘acelo kira korakkhattiyo alasakena kālaṅkato bīraṇatthambake susāne chaḍḍito’ti. Atha kho, bhaggava, sunakkhatto licchaviputto yena bīraṇatthambakaṃ susānaṃ, yena acelo korakkhattiyo tenupasaṅkami; upasaṅkamitvā acelaṃ korakkhattiyaṃ tikkhattuṃ pāṇinā ākoṭesi – ‘jānāsi, āvuso korakkhattiya, attano gati’nti? Atha kho, bhaggava, acelo korakkhattiyo pāṇinā piṭṭhiṃ paripuñchanto vuṭṭhāsi. ‘Jānāmi, āvuso sunakkhatta, attano gatiṃ. Kālakañcikā nāma asurā sabbanihīno asurakāyo, tatrāmhi upapanno’ti vatvā tattheva uttāno papati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paripati (syā. ka.)]"
      },
      "."
    ],
    "innerText": "9. ‘‘Assosi kho, bhaggava, sunakkhatto licchaviputto – ‘acelo kira korakkhattiyo alasakena kālaṅkato bīraṇatthambake susāne chaḍḍito’ti. Atha kho, bhaggava, sunakkhatto licchaviputto yena bīraṇatthambakaṃ susānaṃ, yena acelo korakkhattiyo tenupasaṅkami; upasaṅkamitvā acelaṃ korakkhattiyaṃ tikkhattuṃ pāṇinā ākoṭesi – ‘jānāsi, āvuso korakkhattiya, attano gati’nti? Atha kho, bhaggava, acelo korakkhattiyo pāṇinā piṭṭhiṃ paripuñchanto vuṭṭhāsi. ‘Jānāmi, āvuso sunakkhatta, attano gatiṃ. Kālakañcikā nāma asurā sabbanihīno asurakāyo, tatrāmhi upapanno’ti vatvā tattheva uttāno papati [paripati (syā. ka.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ". ‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho ahaṃ, bhaggava ",
      ", sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘taṃ kiṃ maññasi, sunakkhatta, yatheva te ahaṃ acelaṃ korakkhattiyaṃ ārabbha byākāsiṃ, tatheva taṃ vipākaṃ, aññathā vā’ti? ‘Yatheva me, bhante, bhagavā acelaṃ korakkhattiyaṃ ārabbha byākāsi, tatheva taṃ vipākaṃ, no aññathā’ti. ‘Taṃ ",
      " kiṃ maññasi, sunakkhatta, yadi evaṃ sante kataṃ vā hoti uttarimanussadhammā iddhipāṭihāriyaṃ, akataṃ vāti? ‘Addhā kho, bhante, evaṃ sante kataṃ hoti uttarimanussadhammā iddhipāṭihāriyaṃ, no akata’nti. ‘Evampi kho maṃ tvaṃ, moghapurisa, uttarimanussadhammā iddhipāṭihāriyaṃ karontaṃ evaṃ vadesi – na hi pana me, bhante, bhagavā uttarimanussadhammā iddhipāṭihāriyaṃ karotīti. Passa, moghapurisa, yāvañca te idaṃ aparaddha’nti. ‘‘Evampi kho, bhaggava, sunakkhatto licchaviputto mayā vuccamāno apakkameva imasmā dhammavinayā, yathā taṃ āpāyiko nerayiko."
    ],
    "innerText": "10. ‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho ahaṃ, bhaggava , sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘taṃ kiṃ maññasi, sunakkhatta, yatheva te ahaṃ acelaṃ korakkhattiyaṃ ārabbha byākāsiṃ, tatheva taṃ vipākaṃ, aññathā vā’ti? ‘Yatheva me, bhante, bhagavā acelaṃ korakkhattiyaṃ ārabbha byākāsi, tatheva taṃ vipākaṃ, no aññathā’ti. ‘Taṃ kiṃ maññasi, sunakkhatta, yadi evaṃ sante kataṃ vā hoti uttarimanussadhammā iddhipāṭihāriyaṃ, akataṃ vāti? ‘Addhā kho, bhante, evaṃ sante kataṃ hoti uttarimanussadhammā iddhipāṭihāriyaṃ, no akata’nti. ‘Evampi kho maṃ tvaṃ, moghapurisa, uttarimanussadhammā iddhipāṭihāriyaṃ karontaṃ evaṃ vadesi – na hi pana me, bhante, bhagavā uttarimanussadhammā iddhipāṭihāriyaṃ karotīti. Passa, moghapurisa, yāvañca te idaṃ aparaddha’nti. ‘‘Evampi kho, bhaggava, sunakkhatto licchaviputto mayā vuccamāno apakkameva imasmā dhammavinayā, yathā taṃ āpāyiko nerayiko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Acelakaḷāramaṭṭakavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". ‘‘Ekamidāhaṃ, bhaggava, samayaṃ vesāliyaṃ viharāmi mahāvane kūṭāgārasālāyaṃ. Tena kho pana samayena acelo kaḷāramaṭṭako vesāliyaṃ paṭivasati lābhaggappatto ceva yasaggappatto ca vajjigāme. Tassa sattavatapadāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sattavattapadāni (syā. pī.)]"
      },
      " samattāni samādinnāni honti – ‘yāvajīvaṃ acelako assaṃ, na vatthaṃ paridaheyyaṃ, yāvajīvaṃ brahmacārī assaṃ, na methunaṃ dhammaṃ paṭiseveyyaṃ, yāvajīvaṃ surāmaṃseneva yāpeyyaṃ, na odanakummāsaṃ ",
      " bhuñjeyyaṃ. Puratthimena vesāliṃ udenaṃ nāma cetiyaṃ, taṃ nātikkameyyaṃ, dakkhiṇena vesāliṃ gotamakaṃ nāma cetiyaṃ, taṃ nātikkameyyaṃ, pacchimena vesāliṃ sattambaṃ nāma cetiyaṃ, taṃ ",
      " nātikkameyyaṃ, uttarena vesāliṃ bahuputtaṃ ",
      " nāma ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bahuputtakaṃ nāma (syā.)]"
      },
      " cetiyaṃ taṃ nātikkameyya’nti. So imesaṃ sattannaṃ vatapadānaṃ samādānahetu lābhaggappatto ceva yasaggappatto ca vajjigāme."
    ],
    "innerText": "11. ‘‘Ekamidāhaṃ, bhaggava, samayaṃ vesāliyaṃ viharāmi mahāvane kūṭāgārasālāyaṃ. Tena kho pana samayena acelo kaḷāramaṭṭako vesāliyaṃ paṭivasati lābhaggappatto ceva yasaggappatto ca vajjigāme. Tassa sattavatapadāni [sattavattapadāni (syā. pī.)] samattāni samādinnāni honti – ‘yāvajīvaṃ acelako assaṃ, na vatthaṃ paridaheyyaṃ, yāvajīvaṃ brahmacārī assaṃ, na methunaṃ dhammaṃ paṭiseveyyaṃ, yāvajīvaṃ surāmaṃseneva yāpeyyaṃ, na odanakummāsaṃ bhuñjeyyaṃ. Puratthimena vesāliṃ udenaṃ nāma cetiyaṃ, taṃ nātikkameyyaṃ, dakkhiṇena vesāliṃ gotamakaṃ nāma cetiyaṃ, taṃ nātikkameyyaṃ, pacchimena vesāliṃ sattambaṃ nāma cetiyaṃ, taṃ nātikkameyyaṃ, uttarena vesāliṃ bahuputtaṃ nāma [bahuputtakaṃ nāma (syā.)] cetiyaṃ taṃ nātikkameyya’nti. So imesaṃ sattannaṃ vatapadānaṃ samādānahetu lābhaggappatto ceva yasaggappatto ca vajjigāme."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ". ‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yena acelo kaḷāramaṭṭako tenupasaṅkami; upasaṅkamitvā acelaṃ kaḷāramaṭṭakaṃ pañhaṃ apucchi. Tassa acelo kaḷāramaṭṭako pañhaṃ puṭṭho na sampāyāsi. Asampāyanto kopañca dosañca appaccayañca pātvākāsi. Atha kho, bhaggava, sunakkhattassa licchaviputtassa etadahosi – ‘sādhurūpaṃ vata bho arahantaṃ samaṇaṃ āsādimhase ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[asādiyimhase (syā.)]"
      },
      ". Mā vata no ahosi dīgharattaṃ ahitāya dukkhāyā’ti."
    ],
    "innerText": "12. ‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yena acelo kaḷāramaṭṭako tenupasaṅkami; upasaṅkamitvā acelaṃ kaḷāramaṭṭakaṃ pañhaṃ apucchi. Tassa acelo kaḷāramaṭṭako pañhaṃ puṭṭho na sampāyāsi. Asampāyanto kopañca dosañca appaccayañca pātvākāsi. Atha kho, bhaggava, sunakkhattassa licchaviputtassa etadahosi – ‘sādhurūpaṃ vata bho arahantaṃ samaṇaṃ āsādimhase [asādiyimhase (syā.)]. Mā vata no ahosi dīgharattaṃ ahitāya dukkhāyā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". ‘‘Atha ",
      " kho, bhaggava, sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho ahaṃ, bhaggava, sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘tvampi nāma, moghapurisa, samaṇo sakyaputtiyo paṭijānissasī’ti! ‘Kiṃ pana maṃ, bhante, bhagavā evamāha – tvampi nāma, moghapurisa, samaṇo sakyaputtiyo paṭijānissasī’ti? ‘Nanu tvaṃ, sunakkhatta, acelaṃ kaḷāramaṭṭakaṃ upasaṅkamitvā pañhaṃ apucchi. Tassa te acelo kaḷāramaṭṭako pañhaṃ puṭṭho na sampāyāsi. Asampāyanto kopañca dosañca ",
      " appaccayañca pātvākāsi. Tassa te etadahosi – ‘‘sādhurūpaṃ vata, bho, arahantaṃ samaṇaṃ āsādimhase. Mā vata no ahosi dīgharattaṃ ahitāya dukkhāyā’ti. ‘Evaṃ, bhante. Kiṃ pana, bhante, bhagavā arahattassa maccharāyatī’ti? ‘Na ",
      " kho ahaṃ, moghapurisa, arahattassa maccharāyāmi, api ca tuyhevetaṃ pāpakaṃ diṭṭhigataṃ uppannaṃ, taṃ pajaha. Mā te ahosi dīgharattaṃ ahitāya dukkhāya. Yaṃ kho panetaṃ, sunakkhatta, maññasi acelaṃ kaḷāramaṭṭakaṃ – sādhurūpo ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[arahaṃ (syā.)]"
      },
      " samaṇoti, so nacirasseva parihito sānucāriko vicaranto odanakummāsaṃ bhuñjamāno sabbāneva vesāliyāni cetiyāni samatikkamitvā yasā nihīno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yasānikiṇṇo (ka.)]"
      },
      " kālaṃ karissatī’ti."
    ],
    "innerText": "13. ‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho ahaṃ, bhaggava, sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘tvampi nāma, moghapurisa, samaṇo sakyaputtiyo paṭijānissasī’ti! ‘Kiṃ pana maṃ, bhante, bhagavā evamāha – tvampi nāma, moghapurisa, samaṇo sakyaputtiyo paṭijānissasī’ti? ‘Nanu tvaṃ, sunakkhatta, acelaṃ kaḷāramaṭṭakaṃ upasaṅkamitvā pañhaṃ apucchi. Tassa te acelo kaḷāramaṭṭako pañhaṃ puṭṭho na sampāyāsi. Asampāyanto kopañca dosañca appaccayañca pātvākāsi. Tassa te etadahosi – ‘‘sādhurūpaṃ vata, bho, arahantaṃ samaṇaṃ āsādimhase. Mā vata no ahosi dīgharattaṃ ahitāya dukkhāyā’ti. ‘Evaṃ, bhante. Kiṃ pana, bhante, bhagavā arahattassa maccharāyatī’ti? ‘Na kho ahaṃ, moghapurisa, arahattassa maccharāyāmi, api ca tuyhevetaṃ pāpakaṃ diṭṭhigataṃ uppannaṃ, taṃ pajaha. Mā te ahosi dīgharattaṃ ahitāya dukkhāya. Yaṃ kho panetaṃ, sunakkhatta, maññasi acelaṃ kaḷāramaṭṭakaṃ – sādhurūpo ayaṃ [arahaṃ (syā.)] samaṇoti, so nacirasseva parihito sānucāriko vicaranto odanakummāsaṃ bhuñjamāno sabbāneva vesāliyāni cetiyāni samatikkamitvā yasā nihīno [yasānikiṇṇo (ka.)] kālaṃ karissatī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Atha kho, bhaggava, acelo kaḷāramaṭṭako nacirasseva parihito sānucāriko vicaranto odanakummāsaṃ bhuñjamāno sabbāneva vesāliyāni cetiyāni samatikkamitvā yasā nihīno kālamakāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". ‘‘Assosi kho, bhaggava, sunakkhatto licchaviputto – ‘acelo kira kaḷāramaṭṭako parihito sānucāriko vicaranto odanakummāsaṃ bhuñjamāno sabbāneva vesāliyāni cetiyāni samatikkamitvā yasā nihīno kālaṅkato’ti. Atha kho, bhaggava, sunakkhatto ",
      " licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho ahaṃ, bhaggava, sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘taṃ kiṃ maññasi, sunakkhatta, yatheva te ahaṃ acelaṃ kaḷāramaṭṭakaṃ ārabbha byākāsiṃ, tatheva taṃ vipākaṃ, aññathā vā’ti? ‘Yatheva ",
      " me, bhante, bhagavā acelaṃ kaḷāramaṭṭakaṃ ārabbha byākāsi, tatheva taṃ vipākaṃ, no ",
      " aññathā’ti. ‘Taṃ kiṃ maññasi, sunakkhatta, yadi evaṃ sante kataṃ ",
      " vā hoti uttarimanussadhammā iddhipāṭihāriyaṃ akataṃ vā’ti? ‘Addhā kho, bhante, evaṃ sante kataṃ hoti uttarimanussadhammā iddhipāṭihāriyaṃ, no akata’nti. ‘Evampi kho maṃ tvaṃ, moghapurisa, uttarimanussadhammā iddhipāṭihāriyaṃ karontaṃ evaṃ vadesi – na hi pana me, bhante, bhagavā uttarimanussadhammā iddhipāṭihāriyaṃ karotī’’ti. Passa, moghapurisa, yāvañca te idaṃ aparaddha’nti. ‘‘Eva’mpi kho, bhaggava, sunakkhatto licchaviputto mayā vuccamāno apakkameva imasmā dhammavinayā, yathā taṃ āpāyiko nerayiko."
    ],
    "innerText": "14. ‘‘Assosi kho, bhaggava, sunakkhatto licchaviputto – ‘acelo kira kaḷāramaṭṭako parihito sānucāriko vicaranto odanakummāsaṃ bhuñjamāno sabbāneva vesāliyāni cetiyāni samatikkamitvā yasā nihīno kālaṅkato’ti. Atha kho, bhaggava, sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho ahaṃ, bhaggava, sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘taṃ kiṃ maññasi, sunakkhatta, yatheva te ahaṃ acelaṃ kaḷāramaṭṭakaṃ ārabbha byākāsiṃ, tatheva taṃ vipākaṃ, aññathā vā’ti? ‘Yatheva me, bhante, bhagavā acelaṃ kaḷāramaṭṭakaṃ ārabbha byākāsi, tatheva taṃ vipākaṃ, no aññathā’ti. ‘Taṃ kiṃ maññasi, sunakkhatta, yadi evaṃ sante kataṃ vā hoti uttarimanussadhammā iddhipāṭihāriyaṃ akataṃ vā’ti? ‘Addhā kho, bhante, evaṃ sante kataṃ hoti uttarimanussadhammā iddhipāṭihāriyaṃ, no akata’nti. ‘Evampi kho maṃ tvaṃ, moghapurisa, uttarimanussadhammā iddhipāṭihāriyaṃ karontaṃ evaṃ vadesi – na hi pana me, bhante, bhagavā uttarimanussadhammā iddhipāṭihāriyaṃ karotī’’ti. Passa, moghapurisa, yāvañca te idaṃ aparaddha’nti. ‘‘Eva’mpi kho, bhaggava, sunakkhatto licchaviputto mayā vuccamāno apakkameva imasmā dhammavinayā, yathā taṃ āpāyiko nerayiko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Acelapāthikaputtavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". ‘‘Ekamidāhaṃ, bhaggava, samayaṃ tattheva vesāliyaṃ viharāmi mahāvane kūṭāgārasālāyaṃ. Tena kho pana samayena acelo pāthikaputto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pāṭikaputto (sī. syā. pī.)]"
      },
      " vesāliyaṃ paṭivasati lābhaggappatto ceva yasaggappatto ca vajjigāme. So vesāliyaṃ parisati evaṃ vācaṃ bhāsati – ‘samaṇopi gotamo ñāṇavādo, ahampi ñāṇavādo. Ñāṇavādo kho pana ñāṇavādena arahati uttarimanussadhammā iddhipāṭihāriyaṃ dassetuṃ. Samaṇo gotamo upaḍḍhapathaṃ āgaccheyya, ahampi upaḍḍhapathaṃ gaccheyyaṃ. Te tattha ubhopi uttarimanussadhammā iddhipāṭihāriyaṃ kareyyāma. Ekaṃ ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyaṃ karissati, dvāhaṃ karissāmi. Dve ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni ",
      " karissati, cattārāhaṃ karissāmi ",
      ". Cattāri ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni karissati, aṭṭhāhaṃ karissāmi. Iti yāvatakaṃ yāvatakaṃ samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyaṃ karissati, taddiguṇaṃ taddiguṇāhaṃ karissāmī’ti."
    ],
    "innerText": "15. ‘‘Ekamidāhaṃ, bhaggava, samayaṃ tattheva vesāliyaṃ viharāmi mahāvane kūṭāgārasālāyaṃ. Tena kho pana samayena acelo pāthikaputto [pāṭikaputto (sī. syā. pī.)] vesāliyaṃ paṭivasati lābhaggappatto ceva yasaggappatto ca vajjigāme. So vesāliyaṃ parisati evaṃ vācaṃ bhāsati – ‘samaṇopi gotamo ñāṇavādo, ahampi ñāṇavādo. Ñāṇavādo kho pana ñāṇavādena arahati uttarimanussadhammā iddhipāṭihāriyaṃ dassetuṃ. Samaṇo gotamo upaḍḍhapathaṃ āgaccheyya, ahampi upaḍḍhapathaṃ gaccheyyaṃ. Te tattha ubhopi uttarimanussadhammā iddhipāṭihāriyaṃ kareyyāma. Ekaṃ ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyaṃ karissati, dvāhaṃ karissāmi. Dve ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni karissati, cattārāhaṃ karissāmi . Cattāri ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni karissati, aṭṭhāhaṃ karissāmi. Iti yāvatakaṃ yāvatakaṃ samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyaṃ karissati, taddiguṇaṃ taddiguṇāhaṃ karissāmī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". ‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho, bhaggava, sunakkhatto licchaviputto maṃ etadavoca – ‘acelo, bhante, pāthikaputto vesāliyaṃ paṭivasati lābhaggappatto ceva yasaggappatto ca vajjigāme. So vesāliyaṃ parisati evaṃ vācaṃ bhāsati – samaṇopi ",
      " gotamo ",
      " ñāṇavādo, ahampi ñāṇavādo. Ñāṇavādo kho pana ñāṇavādena arahati uttarimanussadhammā iddhipāṭihāriyaṃ dassetuṃ. Samaṇo gotamo upaḍḍhapathaṃ āgaccheyya, ahampi upaḍḍhapathaṃ gaccheyyaṃ. Te tattha ubhopi uttarimanussadhammā iddhipāṭihāriyaṃ kareyyāma. Ekaṃ ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyaṃ karissati, dvāhaṃ karissāmi. Dve ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni karissati, cattārāhaṃ karissāmi. Cattāri ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni karissati, aṭṭhāhaṃ karissāmi. Iti yāvatakaṃ yāvatakaṃ samaṇo gotamo uttari manussadhammā iddhipāṭihāriyaṃ karissati, taddiguṇaṃ taddiguṇāhaṃ karissāmī’’ti."
    ],
    "innerText": "16. ‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho, bhaggava, sunakkhatto licchaviputto maṃ etadavoca – ‘acelo, bhante, pāthikaputto vesāliyaṃ paṭivasati lābhaggappatto ceva yasaggappatto ca vajjigāme. So vesāliyaṃ parisati evaṃ vācaṃ bhāsati – samaṇopi gotamo ñāṇavādo, ahampi ñāṇavādo. Ñāṇavādo kho pana ñāṇavādena arahati uttarimanussadhammā iddhipāṭihāriyaṃ dassetuṃ. Samaṇo gotamo upaḍḍhapathaṃ āgaccheyya, ahampi upaḍḍhapathaṃ gaccheyyaṃ. Te tattha ubhopi uttarimanussadhammā iddhipāṭihāriyaṃ kareyyāma. Ekaṃ ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyaṃ karissati, dvāhaṃ karissāmi. Dve ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni karissati, cattārāhaṃ karissāmi. Cattāri ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni karissati, aṭṭhāhaṃ karissāmi. Iti yāvatakaṃ yāvatakaṃ samaṇo gotamo uttari manussadhammā iddhipāṭihāriyaṃ karissati, taddiguṇaṃ taddiguṇāhaṃ karissāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ vutte, ahaṃ, bhaggava, sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘abhabbo kho, sunakkhatta, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi ",
      " tassa vipateyyā’ti."
    ],
    "innerText": "‘‘Evaṃ vutte, ahaṃ, bhaggava, sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘abhabbo kho, sunakkhatta, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ". ‘Rakkhatetaṃ, bhante, bhagavā vācaṃ, rakkhatetaṃ sugato vāca’nti. ‘Kiṃ ",
      " pana maṃ tvaṃ, sunakkhatta, evaṃ vadesi – rakkhatetaṃ, bhante, bhagavā vācaṃ, rakkhatetaṃ sugato vāca’nti? ‘Bhagavatā cassa, bhante, esā vācā ekaṃsena odhāritā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ovāditā (ka.)]"
      },
      " – abhabbo acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyāti. Acelo ca, bhante, pāthikaputto virūparūpena bhagavato sammukhībhāvaṃ āgaccheyya, tadassa bhagavato musā’ti."
    ],
    "innerText": "17. ‘Rakkhatetaṃ, bhante, bhagavā vācaṃ, rakkhatetaṃ sugato vāca’nti. ‘Kiṃ pana maṃ tvaṃ, sunakkhatta, evaṃ vadesi – rakkhatetaṃ, bhante, bhagavā vācaṃ, rakkhatetaṃ sugato vāca’nti? ‘Bhagavatā cassa, bhante, esā vācā ekaṃsena odhāritā [ovāditā (ka.)] – abhabbo acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyāti. Acelo ca, bhante, pāthikaputto virūparūpena bhagavato sammukhībhāvaṃ āgaccheyya, tadassa bhagavato musā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". ‘Api nu, sunakkhatta, tathāgato taṃ vācaṃ bhāseyya yā sā vācā dvayagāminī’ti? ‘Kiṃ pana, bhante, bhagavatā acelo pāthikaputto cetasā ",
      " ceto paricca vidito – abhabbo acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti?"
    ],
    "innerText": "18. ‘Api nu, sunakkhatta, tathāgato taṃ vācaṃ bhāseyya yā sā vācā dvayagāminī’ti? ‘Kiṃ pana, bhante, bhagavatā acelo pāthikaputto cetasā ceto paricca vidito – abhabbo acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Udāhu ",
      ", devatā bhagavato etamatthaṃ ārocesuṃ – abhabbo, bhante, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā bhagavato sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti?"
    ],
    "innerText": "‘Udāhu , devatā bhagavato etamatthaṃ ārocesuṃ – abhabbo, bhante, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā bhagavato sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ". ‘Cetasā ceto paricca vidito ceva me, sunakkhatta ",
      ", acelo pāthikaputto abhabbo acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti."
    ],
    "innerText": "19. ‘Cetasā ceto paricca vidito ceva me, sunakkhatta , acelo pāthikaputto abhabbo acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Devatāpi me etamatthaṃ ārocesuṃ – abhabbo ",
      ", bhante, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā bhagavato sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti."
    ],
    "innerText": "‘Devatāpi me etamatthaṃ ārocesuṃ – abhabbo , bhante, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā bhagavato sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Ajitopi nāma licchavīnaṃ senāpati adhunā kālaṅkato tāvatiṃsakāyaṃ upapanno. Sopi maṃ upasaṅkamitvā evamārocesi – alajjī, bhante, acelo pāthikaputto; musāvādī, bhante, acelo pāthikaputto. Mampi, bhante, acelo pāthikaputto byākāsi vajjigāme – ajito licchavīnaṃ senāpati mahānirayaṃ upapannoti. Na kho panāhaṃ, bhante, mahānirayaṃ upapanno; tāvatiṃsakāyamhi upapanno. Alajjī, bhante, acelo pāthikaputto; musāvādī, bhante, acelo pāthikaputto; abhabbo ca, bhante, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā bhagavato sammukhībhāvaṃ āgantuṃ. Sacepissa ",
      " evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti."
    ],
    "innerText": "‘Ajitopi nāma licchavīnaṃ senāpati adhunā kālaṅkato tāvatiṃsakāyaṃ upapanno. Sopi maṃ upasaṅkamitvā evamārocesi – alajjī, bhante, acelo pāthikaputto; musāvādī, bhante, acelo pāthikaputto. Mampi, bhante, acelo pāthikaputto byākāsi vajjigāme – ajito licchavīnaṃ senāpati mahānirayaṃ upapannoti. Na kho panāhaṃ, bhante, mahānirayaṃ upapanno; tāvatiṃsakāyamhi upapanno. Alajjī, bhante, acelo pāthikaputto; musāvādī, bhante, acelo pāthikaputto; abhabbo ca, bhante, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā bhagavato sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Iti kho, sunakkhatta, cetasā ceto paricca vidito ceva me acelo pāthikaputto abhabbo acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā ",
      " mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyāti. Devatāpi me etamatthaṃ ārocesuṃ – abhabbo, bhante ",
      ", acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā bhagavato sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti."
    ],
    "innerText": "‘Iti kho, sunakkhatta, cetasā ceto paricca vidito ceva me acelo pāthikaputto abhabbo acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyāti. Devatāpi me etamatthaṃ ārocesuṃ – abhabbo, bhante , acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā bhagavato sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘So kho panāhaṃ, sunakkhatta, vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātappaṭikkanto yena acelassa pāthikaputtassa ārāmo tenupasaṅkamissāmi divāvihārāya. Yassadāni tvaṃ, sunakkhatta, icchasi, tassa ārocehī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Iddhipāṭihāriyakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". ‘‘Atha ",
      " khvāhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[atha kho svāhaṃ (syā.)]"
      },
      ", bhaggava, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya vesāliṃ piṇḍāya pāvisiṃ. Vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātappaṭikkanto yena acelassa pāthikaputtassa ārāmo tenupasaṅkamiṃ divāvihārāya. Atha kho, bhaggava, sunakkhatto licchaviputto taramānarūpo vesāliṃ pavisitvā yena abhiññātā abhiññātā licchavī tenupasaṅkami; upasaṅkamitvā abhiññāte abhiññāte licchavī etadavoca – ‘esāvuso, bhagavā vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātappaṭikkanto yena acelassa pāthikaputtassa ārāmo tenupasaṅkami divāvihārāya. Abhikkamathāyasmanto abhikkamathāyasmanto, sādhurūpānaṃ samaṇānaṃ uttarimanussadhammā iddhipāṭihāriyaṃ bhavissatī’ti ",
      ". Atha kho, bhaggava, abhiññātānaṃ abhiññātānaṃ licchavīnaṃ etadahosi – ‘sādhurūpānaṃ kira, bho, samaṇānaṃ uttarimanussadhammā ",
      " iddhipāṭihāriyaṃ bhavissati; handa vata, bho, gacchāmā’ti. Yena ca abhiññātā abhiññātā brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nānātitthiya (syā.)]"
      },
      " samaṇabrāhmaṇā tenupasaṅkami. Upasaṅkamitvā abhiññāte abhiññāte nānātitthiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nānātitthiya (syā.)]"
      },
      " samaṇabrāhmaṇe etadavoca – ‘esāvuso, bhagavā vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātappaṭikkanto yena acelassa pāthikaputtassa ārāmo tenupasaṅkami divāvihārāya. Abhikkamathāyasmanto abhikkamathāyasmanto, sādhurūpānaṃ samaṇānaṃ uttarimanussadhammā iddhipāṭihāriyaṃ bhavissatī’ti. Atha ",
      " kho, bhaggava, abhiññātānaṃ abhiññātānaṃ nānātitthiyānaṃ samaṇabrāhmaṇānaṃ etadahosi – ‘sādhurūpānaṃ kira, bho, samaṇānaṃ uttarimanussadhammā iddhipāṭihāriyaṃ bhavissati; handa vata, bho, gacchāmā’ti."
    ],
    "innerText": "20. ‘‘Atha khvāhaṃ [atha kho svāhaṃ (syā.)], bhaggava, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya vesāliṃ piṇḍāya pāvisiṃ. Vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātappaṭikkanto yena acelassa pāthikaputtassa ārāmo tenupasaṅkamiṃ divāvihārāya. Atha kho, bhaggava, sunakkhatto licchaviputto taramānarūpo vesāliṃ pavisitvā yena abhiññātā abhiññātā licchavī tenupasaṅkami; upasaṅkamitvā abhiññāte abhiññāte licchavī etadavoca – ‘esāvuso, bhagavā vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātappaṭikkanto yena acelassa pāthikaputtassa ārāmo tenupasaṅkami divāvihārāya. Abhikkamathāyasmanto abhikkamathāyasmanto, sādhurūpānaṃ samaṇānaṃ uttarimanussadhammā iddhipāṭihāriyaṃ bhavissatī’ti . Atha kho, bhaggava, abhiññātānaṃ abhiññātānaṃ licchavīnaṃ etadahosi – ‘sādhurūpānaṃ kira, bho, samaṇānaṃ uttarimanussadhammā iddhipāṭihāriyaṃ bhavissati; handa vata, bho, gacchāmā’ti. Yena ca abhiññātā abhiññātā brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā [nānātitthiya (syā.)] samaṇabrāhmaṇā tenupasaṅkami. Upasaṅkamitvā abhiññāte abhiññāte nānātitthiye [nānātitthiya (syā.)] samaṇabrāhmaṇe etadavoca – ‘esāvuso, bhagavā vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātappaṭikkanto yena acelassa pāthikaputtassa ārāmo tenupasaṅkami divāvihārāya. Abhikkamathāyasmanto abhikkamathāyasmanto, sādhurūpānaṃ samaṇānaṃ uttarimanussadhammā iddhipāṭihāriyaṃ bhavissatī’ti. Atha kho, bhaggava, abhiññātānaṃ abhiññātānaṃ nānātitthiyānaṃ samaṇabrāhmaṇānaṃ etadahosi – ‘sādhurūpānaṃ kira, bho, samaṇānaṃ uttarimanussadhammā iddhipāṭihāriyaṃ bhavissati; handa vata, bho, gacchāmā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha ",
      " kho, bhaggava, abhiññātā abhiññātā licchavī, abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā yena acelassa pāthikaputtassa ārāmo tenupasaṅkamiṃsu. Sā esā, bhaggava, parisā mahā hoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[parisā hoti (sī. syā. pī.)]"
      },
      " anekasatā anekasahassā."
    ],
    "innerText": "‘‘Atha kho, bhaggava, abhiññātā abhiññātā licchavī, abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā yena acelassa pāthikaputtassa ārāmo tenupasaṅkamiṃsu. Sā esā, bhaggava, parisā mahā hoti [parisā hoti (sī. syā. pī.)] anekasatā anekasahassā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". ‘‘Assosi kho, bhaggava, acelo pāthikaputto – ‘abhikkantā kira abhiññātā abhiññātā licchavī, abhikkantā abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā. Samaṇopi gotamo mayhaṃ ārāme divāvihāraṃ nisinno’ti. Sutvānassa bhayaṃ chambhitattaṃ lomahaṃso udapādi. Atha kho, bhaggava, acelo pāthikaputto ",
      " bhīto saṃviggo lomahaṭṭhajāto yena tindukakhāṇuparibbājakārāmo tenupasaṅkami."
    ],
    "innerText": "21. ‘‘Assosi kho, bhaggava, acelo pāthikaputto – ‘abhikkantā kira abhiññātā abhiññātā licchavī, abhikkantā abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā. Samaṇopi gotamo mayhaṃ ārāme divāvihāraṃ nisinno’ti. Sutvānassa bhayaṃ chambhitattaṃ lomahaṃso udapādi. Atha kho, bhaggava, acelo pāthikaputto bhīto saṃviggo lomahaṭṭhajāto yena tindukakhāṇuparibbājakārāmo tenupasaṅkami."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Assosi kho, bhaggava, sā parisā – ‘acelo kira pāthikaputto bhīto saṃviggo lomahaṭṭhajāto yena tindukakhāṇuparibbājakārāmo ",
      " tenupasaṅkanto’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tenupasaṅkamanto (sī. pī. ka.)]"
      },
      ". Atha kho, bhaggava, sā parisā aññataraṃ purisaṃ āmantesi –"
    ],
    "innerText": "‘‘Assosi kho, bhaggava, sā parisā – ‘acelo kira pāthikaputto bhīto saṃviggo lomahaṭṭhajāto yena tindukakhāṇuparibbājakārāmo tenupasaṅkanto’ti [tenupasaṅkamanto (sī. pī. ka.)]. Atha kho, bhaggava, sā parisā aññataraṃ purisaṃ āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Ehi tvaṃ, bho purisa, yena tindukakhāṇuparibbājakārāmo, yena acelo pāthikaputto tenupasaṅkama. Upasaṅkamitvā acelaṃ pāthikaputtaṃ evaṃ vadehi – abhikkamāvuso, pāthikaputta, abhikkantā abhiññātā abhiññātā licchavī, abhikkantā abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā, samaṇopi gotamo āyasmato ārāme divāvihāraṃ nisinno; bhāsitā kho pana te esā, āvuso pāthikaputta, vesāliyaṃ parisati vācā samaṇopi gotamo ñāṇavādo, ahampi ñāṇavādo. Ñāṇavādo kho pana ñāṇavādena arahati uttarimanussadhammā iddhipāṭihāriyaṃ dassetuṃ. Samaṇo ",
      " gotamo upaḍḍhapathaṃ āgaccheyya ahampi upaḍḍhapathaṃ gaccheyyaṃ. Te tattha ubhopi uttarimanussadhammā iddhipāṭihāriyaṃ kareyyāma. Ekaṃ ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyaṃ karissati, dvāhaṃ karissāmi. Dve ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni karissati, cattārāhaṃ karissāmi. Cattāri ce samaṇo gotamo ",
      " uttarimanussadhammā iddhipāṭihāriyāni karissati ",
      ", aṭṭhāhaṃ karissāmi. Iti yāvatakaṃ yāvatakaṃ samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyaṃ karissati, taddiguṇaṃ taddiguṇāhaṃ karissāmī’ti abhikkamasseva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhikkamayeva (sī. syā. pī.)]"
      },
      " kho; āvuso pāthikaputta, upaḍḍhapathaṃ. Sabbapaṭhamaṃyeva āgantvā samaṇo gotamo āyasmato ārāme divāvihāraṃ nisinno’ti."
    ],
    "innerText": "‘Ehi tvaṃ, bho purisa, yena tindukakhāṇuparibbājakārāmo, yena acelo pāthikaputto tenupasaṅkama. Upasaṅkamitvā acelaṃ pāthikaputtaṃ evaṃ vadehi – abhikkamāvuso, pāthikaputta, abhikkantā abhiññātā abhiññātā licchavī, abhikkantā abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā, samaṇopi gotamo āyasmato ārāme divāvihāraṃ nisinno; bhāsitā kho pana te esā, āvuso pāthikaputta, vesāliyaṃ parisati vācā samaṇopi gotamo ñāṇavādo, ahampi ñāṇavādo. Ñāṇavādo kho pana ñāṇavādena arahati uttarimanussadhammā iddhipāṭihāriyaṃ dassetuṃ. Samaṇo gotamo upaḍḍhapathaṃ āgaccheyya ahampi upaḍḍhapathaṃ gaccheyyaṃ. Te tattha ubhopi uttarimanussadhammā iddhipāṭihāriyaṃ kareyyāma. Ekaṃ ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyaṃ karissati, dvāhaṃ karissāmi. Dve ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni karissati, cattārāhaṃ karissāmi. Cattāri ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni karissati , aṭṭhāhaṃ karissāmi. Iti yāvatakaṃ yāvatakaṃ samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyaṃ karissati, taddiguṇaṃ taddiguṇāhaṃ karissāmī’ti abhikkamasseva [abhikkamayeva (sī. syā. pī.)] kho; āvuso pāthikaputta, upaḍḍhapathaṃ. Sabbapaṭhamaṃyeva āgantvā samaṇo gotamo āyasmato ārāme divāvihāraṃ nisinno’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". ‘‘Evaṃ, bhoti kho, bhaggava, so puriso tassā parisāya paṭissutvā yena tindukakhāṇuparibbājakārāmo, yena acelo pāthikaputto tenupasaṅkami. Upasaṅkamitvā acelaṃ pāthikaputtaṃ etadavoca – ‘abhikkamāvuso pāthikaputta, abhikkantā abhiññātā abhiññātā licchavī, abhikkantā abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā. Samaṇopi gotamo āyasmato ārāme divāvihāraṃ nisinno. Bhāsitā ",
      " kho pana te esā, āvuso pāthikaputta, vesāliyaṃ parisati vācā – samaṇopi gotamo ñāṇavādo; ahampi ñāṇavādo. Ñāṇavādo kho pana ñāṇavādena arahati uttarimanussadhammā iddhipāṭihāriyaṃ dassetuṃ…pe… taddiguṇaṃ taddiguṇāhaṃ karissāmīti. Abhikkamasseva kho, āvuso pāthikaputta, upaḍḍhapathaṃ. Sabbapaṭhamaṃyeva āgantvā samaṇo gotamo āyasmato ārāme divāvihāraṃ nisinno’ti."
    ],
    "innerText": "22. ‘‘Evaṃ, bhoti kho, bhaggava, so puriso tassā parisāya paṭissutvā yena tindukakhāṇuparibbājakārāmo, yena acelo pāthikaputto tenupasaṅkami. Upasaṅkamitvā acelaṃ pāthikaputtaṃ etadavoca – ‘abhikkamāvuso pāthikaputta, abhikkantā abhiññātā abhiññātā licchavī, abhikkantā abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā. Samaṇopi gotamo āyasmato ārāme divāvihāraṃ nisinno. Bhāsitā kho pana te esā, āvuso pāthikaputta, vesāliyaṃ parisati vācā – samaṇopi gotamo ñāṇavādo; ahampi ñāṇavādo. Ñāṇavādo kho pana ñāṇavādena arahati uttarimanussadhammā iddhipāṭihāriyaṃ dassetuṃ…pe… taddiguṇaṃ taddiguṇāhaṃ karissāmīti. Abhikkamasseva kho, āvuso pāthikaputta, upaḍḍhapathaṃ. Sabbapaṭhamaṃyeva āgantvā samaṇo gotamo āyasmato ārāme divāvihāraṃ nisinno’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ vutte, bhaggava, acelo pāthikaputto ‘āyāmi āvuso, āyāmi ",
      " āvuso’ti vatvā tattheva saṃsappati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṃsabbati (ka.)]"
      },
      ", na sakkoti āsanāpi vuṭṭhātuṃ. Atha kho so, bhaggava, puriso acelaṃ pāthikaputtaṃ etadavoca – ‘kiṃ su nāma te, āvuso pāthikaputta, pāvaḷā su nāma te pīṭhakasmiṃ allīnā, pīṭhakaṃ su nāma te pāvaḷāsu allīnaṃ? Āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappasi, na sakkosi āsanāpi vuṭṭhātu’nti. Evampi kho, bhaggava, vuccamāno acelo pāthikaputto ‘āyāmi āvuso, āyāmi āvuso’ti vatvā tattheva saṃsappati ",
      ", na sakkoti āsanāpi vuṭṭhātuṃ."
    ],
    "innerText": "‘‘Evaṃ vutte, bhaggava, acelo pāthikaputto ‘āyāmi āvuso, āyāmi āvuso’ti vatvā tattheva saṃsappati [saṃsabbati (ka.)], na sakkoti āsanāpi vuṭṭhātuṃ. Atha kho so, bhaggava, puriso acelaṃ pāthikaputtaṃ etadavoca – ‘kiṃ su nāma te, āvuso pāthikaputta, pāvaḷā su nāma te pīṭhakasmiṃ allīnā, pīṭhakaṃ su nāma te pāvaḷāsu allīnaṃ? Āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappasi, na sakkosi āsanāpi vuṭṭhātu’nti. Evampi kho, bhaggava, vuccamāno acelo pāthikaputto ‘āyāmi āvuso, āyāmi āvuso’ti vatvā tattheva saṃsappati , na sakkoti āsanāpi vuṭṭhātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". ‘‘Yadā kho so, bhaggava, puriso aññāsi – ‘parābhūtarūpo ayaṃ acelo pāthikaputto. Āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti. Atha taṃ parisaṃ āgantvā evamārocesi – ‘parābhūtarūpo, bho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[parābhūtarūpo bho ayaṃ (syā. ka.), parābhūtarūpo (sī. pī.)]"
      },
      ", acelo pāthikaputto. Āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti. Evaṃ vutte, ahaṃ, bhaggava, taṃ parisaṃ etadavocaṃ – ‘abhabbo kho, āvuso, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā ",
      " mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ‘ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyya’nti, muddhāpi tassa vipateyyāti."
    ],
    "innerText": "23. ‘‘Yadā kho so, bhaggava, puriso aññāsi – ‘parābhūtarūpo ayaṃ acelo pāthikaputto. Āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti. Atha taṃ parisaṃ āgantvā evamārocesi – ‘parābhūtarūpo, bho [parābhūtarūpo bho ayaṃ (syā. ka.), parābhūtarūpo (sī. pī.)], acelo pāthikaputto. Āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti. Evaṃ vutte, ahaṃ, bhaggava, taṃ parisaṃ etadavocaṃ – ‘abhabbo kho, āvuso, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ‘ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyya’nti, muddhāpi tassa vipateyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamabhāṇavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ". ‘‘Atha ",
      " kho, bhaggava, aññataro licchavimahāmatto uṭṭhāyāsanā taṃ parisaṃ etadavoca – ‘tena hi, bho, muhuttaṃ tāva āgametha, yāvāhaṃ gacchāmi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paccāgacchāmi (?)]"
      },
      ". Appeva nāma ahampi sakkuṇeyyaṃ acelaṃ pāthikaputtaṃ imaṃ parisaṃ ānetu’nti."
    ],
    "innerText": "24. ‘‘Atha kho, bhaggava, aññataro licchavimahāmatto uṭṭhāyāsanā taṃ parisaṃ etadavoca – ‘tena hi, bho, muhuttaṃ tāva āgametha, yāvāhaṃ gacchāmi [paccāgacchāmi (?)]. Appeva nāma ahampi sakkuṇeyyaṃ acelaṃ pāthikaputtaṃ imaṃ parisaṃ ānetu’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha kho so, bhaggava, licchavimahāmatto yena tindukakhāṇuparibbājakārāmo, yena acelo pāthikaputto tenupasaṅkami. Upasaṅkamitvā acelaṃ pāthikaputtaṃ etadavoca – ‘abhikkamāvuso pāthikaputta, abhikkantaṃ te seyyo, abhikkantā abhiññātā abhiññātā ",
      " licchavī, abhikkantā abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā. Samaṇopi gotamo āyasmato ārāme divāvihāraṃ nisinno. Bhāsitā kho pana te esā, āvuso pāthikaputta, vesāliyaṃ parisati vācā – samaṇopi gotamo ñāṇavādo…pe… taddiguṇaṃ taddiguṇāhaṃ karissāmīti. Abhikkamasseva kho, āvuso pāthikaputta, upaḍḍhapathaṃ. Sabbapaṭhamaṃyeva āgantvā samaṇo gotamo āyasmato ārāme divāvihāraṃ nisinno. Bhāsitā kho panesā, āvuso pāthikaputta, samaṇena gotamena parisati vācā – abhabbo kho acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyāti. Abhikkamāvuso pāthikaputta, abhikkamaneneva te jayaṃ karissāma, samaṇassa gotamassa parājaya’nti."
    ],
    "innerText": "‘‘Atha kho so, bhaggava, licchavimahāmatto yena tindukakhāṇuparibbājakārāmo, yena acelo pāthikaputto tenupasaṅkami. Upasaṅkamitvā acelaṃ pāthikaputtaṃ etadavoca – ‘abhikkamāvuso pāthikaputta, abhikkantaṃ te seyyo, abhikkantā abhiññātā abhiññātā licchavī, abhikkantā abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā. Samaṇopi gotamo āyasmato ārāme divāvihāraṃ nisinno. Bhāsitā kho pana te esā, āvuso pāthikaputta, vesāliyaṃ parisati vācā – samaṇopi gotamo ñāṇavādo…pe… taddiguṇaṃ taddiguṇāhaṃ karissāmīti. Abhikkamasseva kho, āvuso pāthikaputta, upaḍḍhapathaṃ. Sabbapaṭhamaṃyeva āgantvā samaṇo gotamo āyasmato ārāme divāvihāraṃ nisinno. Bhāsitā kho panesā, āvuso pāthikaputta, samaṇena gotamena parisati vācā – abhabbo kho acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyāti. Abhikkamāvuso pāthikaputta, abhikkamaneneva te jayaṃ karissāma, samaṇassa gotamassa parājaya’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ vutte, bhaggava, acelo pāthikaputto ‘āyāmi āvuso, āyāmi āvuso’ti vatvā tattheva saṃsappati, na sakkoti ",
      " āsanāpi vuṭṭhātuṃ. Atha kho so, bhaggava, licchavimahāmatto acelaṃ pāthikaputtaṃ etadavoca – ‘kiṃ su nāma te, āvuso pāthikaputta, pāvaḷā su nāma te pīṭhakasmiṃ allīnā, pīṭhakaṃ su nāma te pāvaḷāsu allīnaṃ ",
      "? Āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappasi, na sakkosi āsanāpi vuṭṭhātu’nti ",
      ". Evampi kho, bhaggava, vuccamāno acelo pāthikaputto ‘āyāmi āvuso, āyāmi āvuso’ti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātuṃ."
    ],
    "innerText": "‘‘Evaṃ vutte, bhaggava, acelo pāthikaputto ‘āyāmi āvuso, āyāmi āvuso’ti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātuṃ. Atha kho so, bhaggava, licchavimahāmatto acelaṃ pāthikaputtaṃ etadavoca – ‘kiṃ su nāma te, āvuso pāthikaputta, pāvaḷā su nāma te pīṭhakasmiṃ allīnā, pīṭhakaṃ su nāma te pāvaḷāsu allīnaṃ ? Āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappasi, na sakkosi āsanāpi vuṭṭhātu’nti . Evampi kho, bhaggava, vuccamāno acelo pāthikaputto ‘āyāmi āvuso, āyāmi āvuso’ti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". ‘‘Yadā kho so, bhaggava, licchavimahāmatto aññāsi – ‘parābhūtarūpo ayaṃ acelo pāthikaputto āyāmi āvuso, āyāmi ",
      " āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti. Atha taṃ parisaṃ āgantvā evamārocesi – ‘parābhūtarūpo, bho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[parābhūtarūpo (sī. pī.), parābhūtarūpo ayaṃ (syā.)]"
      },
      ", acelo pāthikaputto āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti. Evaṃ vutte, ahaṃ, bhaggava, taṃ parisaṃ etadavocaṃ – ‘abhabbo kho, āvuso, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyya. Sace pāyasmantānaṃ licchavīnaṃ evamassa – mayaṃ acelaṃ pāthikaputtaṃ varattāhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yāhi varattāhi (syā. ka.)]"
      },
      " bandhitvā goyugehi āviñcheyyāmāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āviñjeyyāmāti (syā.), āvijjheyyāmāti (sī. pī.)]"
      },
      ", tā varattā chijjeyyuṃ pāthikaputto vā. Abhabbo pana acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa ",
      " evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti."
    ],
    "innerText": "25. ‘‘Yadā kho so, bhaggava, licchavimahāmatto aññāsi – ‘parābhūtarūpo ayaṃ acelo pāthikaputto āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti. Atha taṃ parisaṃ āgantvā evamārocesi – ‘parābhūtarūpo, bho [parābhūtarūpo (sī. pī.), parābhūtarūpo ayaṃ (syā.)], acelo pāthikaputto āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti. Evaṃ vutte, ahaṃ, bhaggava, taṃ parisaṃ etadavocaṃ – ‘abhabbo kho, āvuso, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyya. Sace pāyasmantānaṃ licchavīnaṃ evamassa – mayaṃ acelaṃ pāthikaputtaṃ varattāhi [yāhi varattāhi (syā. ka.)] bandhitvā goyugehi āviñcheyyāmāti [āviñjeyyāmāti (syā.), āvijjheyyāmāti (sī. pī.)], tā varattā chijjeyyuṃ pāthikaputto vā. Abhabbo pana acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". ‘‘Atha kho, bhaggava, jāliyo dārupattikantevāsī uṭṭhāyāsanā taṃ parisaṃ etadavoca – ‘tena hi, bho, muhuttaṃ tāva āgametha, yāvāhaṃ gacchāmi; appeva nāma ahampi sakkuṇeyyaṃ acelaṃ pāthikaputtaṃ imaṃ parisaṃ ānetu’’nti."
    ],
    "innerText": "26. ‘‘Atha kho, bhaggava, jāliyo dārupattikantevāsī uṭṭhāyāsanā taṃ parisaṃ etadavoca – ‘tena hi, bho, muhuttaṃ tāva āgametha, yāvāhaṃ gacchāmi; appeva nāma ahampi sakkuṇeyyaṃ acelaṃ pāthikaputtaṃ imaṃ parisaṃ ānetu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha ",
      " kho, bhaggava, jāliyo dārupattikantevāsī yena tindukakhāṇuparibbājakārāmo, yena acelo pāthikaputto tenupasaṅkami. Upasaṅkamitvā acelaṃ pāthikaputtaṃ ",
      " etadavoca – ‘abhikkamāvuso pāthikaputta, abhikkantaṃ te seyyo. Abhikkantā abhiññātā abhiññātā licchavī, abhikkantā abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā. Samaṇopi gotamo āyasmato ārāme divāvihāraṃ nisinno. Bhāsitā kho pana te esā, āvuso pāthikaputta, vesāliyaṃ parisati vācā – samaṇopi gotamo ñāṇavādo…pe… taddiguṇaṃ taddiguṇāhaṃ karissāmīti. Abhikkamasseva, kho āvuso pāthikaputta, upaḍḍhapathaṃ. Sabbapaṭhamaṃyeva āgantvā samaṇo gotamo āyasmato ārāme divāvihāraṃ ",
      " nisinno. Bhāsitā kho panesā, āvuso pāthikaputta, samaṇena gotamena parisati vācā – abhabbo acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyya. Sace pāyasmantānaṃ licchavīnaṃ evamassa – mayaṃ acelaṃ pāthikaputtaṃ varattāhi bandhitvā goyugehi āviñcheyyāmāti. Tā varattā chijjeyyuṃ pāthikaputto vā. Abhabbo pana acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ āgaccheyyanti, muddhāpi tassa vipateyyāti. Abhikkamāvuso pāthikaputta, abhikkamaneneva te jayaṃ karissāma, samaṇassa gotamassa parājaya’nti."
    ],
    "innerText": "‘‘Atha kho, bhaggava, jāliyo dārupattikantevāsī yena tindukakhāṇuparibbājakārāmo, yena acelo pāthikaputto tenupasaṅkami. Upasaṅkamitvā acelaṃ pāthikaputtaṃ etadavoca – ‘abhikkamāvuso pāthikaputta, abhikkantaṃ te seyyo. Abhikkantā abhiññātā abhiññātā licchavī, abhikkantā abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā. Samaṇopi gotamo āyasmato ārāme divāvihāraṃ nisinno. Bhāsitā kho pana te esā, āvuso pāthikaputta, vesāliyaṃ parisati vācā – samaṇopi gotamo ñāṇavādo…pe… taddiguṇaṃ taddiguṇāhaṃ karissāmīti. Abhikkamasseva, kho āvuso pāthikaputta, upaḍḍhapathaṃ. Sabbapaṭhamaṃyeva āgantvā samaṇo gotamo āyasmato ārāme divāvihāraṃ nisinno. Bhāsitā kho panesā, āvuso pāthikaputta, samaṇena gotamena parisati vācā – abhabbo acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyya. Sace pāyasmantānaṃ licchavīnaṃ evamassa – mayaṃ acelaṃ pāthikaputtaṃ varattāhi bandhitvā goyugehi āviñcheyyāmāti. Tā varattā chijjeyyuṃ pāthikaputto vā. Abhabbo pana acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ āgaccheyyanti, muddhāpi tassa vipateyyāti. Abhikkamāvuso pāthikaputta, abhikkamaneneva te jayaṃ karissāma, samaṇassa gotamassa parājaya’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ ",
      " vutte, bhaggava, acelo pāthikaputto ",
      " ‘āyāmi āvuso, āyāmi āvuso’ti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātuṃ. Atha kho, bhaggava, jāliyo dārupattikantevāsī acelaṃ pāthikaputtaṃ etadavoca – ‘kiṃ su nāma te, āvuso pāthikaputta, pāvaḷā su nāma te pīṭhakasmiṃ allīnā, pīṭhakaṃ su nāma te pāvaḷāsu allīnaṃ? Āyāmi āvuso, āyāmi āvusoti vatvā tattheva ",
      " saṃsappasi, na sakkosi āsanāpi vuṭṭhātu’nti. Evampi kho, bhaggava, vuccamāno acelo pāthikaputto ‘‘āyāmi āvuso, āyāmi āvuso’’ti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātunti."
    ],
    "innerText": "‘‘Evaṃ vutte, bhaggava, acelo pāthikaputto ‘āyāmi āvuso, āyāmi āvuso’ti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātuṃ. Atha kho, bhaggava, jāliyo dārupattikantevāsī acelaṃ pāthikaputtaṃ etadavoca – ‘kiṃ su nāma te, āvuso pāthikaputta, pāvaḷā su nāma te pīṭhakasmiṃ allīnā, pīṭhakaṃ su nāma te pāvaḷāsu allīnaṃ? Āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappasi, na sakkosi āsanāpi vuṭṭhātu’nti. Evampi kho, bhaggava, vuccamāno acelo pāthikaputto ‘‘āyāmi āvuso, āyāmi āvuso’’ti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      ". ‘‘Yadā kho, bhaggava, jāliyo dārupattikantevāsī aññāsi – ‘parābhūtarūpo ayaṃ acelo pāthikaputto ‘āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti, atha naṃ etadavoca –"
    ],
    "innerText": "27. ‘‘Yadā kho, bhaggava, jāliyo dārupattikantevāsī aññāsi – ‘parābhūtarūpo ayaṃ acelo pāthikaputto ‘āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti, atha naṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Bhūtapubbaṃ, āvuso pāthikaputta, sīhassa migarañño etadahosi – yaṃnūnāhaṃ aññataraṃ vanasaṇḍaṃ nissāya āsayaṃ kappeyyaṃ. Tatrāsayaṃ kappetvā sāyanhasamayaṃ āsayā nikkhameyyaṃ, āsayā nikkhamitvā vijambheyyaṃ, vijambhitvā samantā catuddisā anuvilokeyyaṃ, samantā catuddisā anuviloketvā tikkhattuṃ sīhanādaṃ nadeyyaṃ, tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkameyyaṃ. So varaṃ varaṃ migasaṃghe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[migasaṃghaṃ (syā. ka.)]"
      },
      " vadhitvā mudumaṃsāni mudumaṃsāni bhakkhayitvā tameva āsayaṃ ajjhupeyya’nti."
    ],
    "innerText": "‘Bhūtapubbaṃ, āvuso pāthikaputta, sīhassa migarañño etadahosi – yaṃnūnāhaṃ aññataraṃ vanasaṇḍaṃ nissāya āsayaṃ kappeyyaṃ. Tatrāsayaṃ kappetvā sāyanhasamayaṃ āsayā nikkhameyyaṃ, āsayā nikkhamitvā vijambheyyaṃ, vijambhitvā samantā catuddisā anuvilokeyyaṃ, samantā catuddisā anuviloketvā tikkhattuṃ sīhanādaṃ nadeyyaṃ, tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkameyyaṃ. So varaṃ varaṃ migasaṃghe [migasaṃghaṃ (syā. ka.)] vadhitvā mudumaṃsāni mudumaṃsāni bhakkhayitvā tameva āsayaṃ ajjhupeyya’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Atha ",
      " kho, āvuso, so sīho migarājā aññataraṃ vanasaṇḍaṃ nissāya āsayaṃ kappesi. Tatrāsayaṃ kappetvā sāyanhasamayaṃ ",
      " āsayā nikkhami, āsayā nikkhamitvā vijambhi, vijambhitvā samantā catuddisā anuvilokesi, samantā catuddisā anuviloketvā tikkhattuṃ sīhanādaṃ nadi, tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkāmi. So varaṃ varaṃ migasaṅghe vadhitvā mudumaṃsāni mudumaṃsāni bhakkhayitvā tameva āsayaṃ ajjhupesi."
    ],
    "innerText": "‘Atha kho, āvuso, so sīho migarājā aññataraṃ vanasaṇḍaṃ nissāya āsayaṃ kappesi. Tatrāsayaṃ kappetvā sāyanhasamayaṃ āsayā nikkhami, āsayā nikkhamitvā vijambhi, vijambhitvā samantā catuddisā anuvilokesi, samantā catuddisā anuviloketvā tikkhattuṃ sīhanādaṃ nadi, tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkāmi. So varaṃ varaṃ migasaṅghe vadhitvā mudumaṃsāni mudumaṃsāni bhakkhayitvā tameva āsayaṃ ajjhupesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      ". ‘Tasseva ",
      " kho, āvuso pāthikaputta, sīhassa migarañño vighāsasaṃvaḍḍho jarasiṅgālo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[jarasigālo (sī. syā. pī.)]"
      },
      " ditto ceva balavā ca. Atha kho, āvuso, tassa jarasiṅgālassa etadahosi – ko cāhaṃ, ko sīho migarājā. Yaṃnūnāhampi aññataraṃ vanasaṇḍaṃ nissāya āsayaṃ kappeyyaṃ. Tatrāsayaṃ kappetvā sāyanhasamayaṃ āsayā nikkhameyyaṃ, āsayā ",
      " nikkhamitvā vijambheyyaṃ, vijambhitvā samantā catuddisā anuvilokeyyaṃ, samantā catuddisā anuviloketvā tikkhattuṃ sīhanādaṃ nadeyyaṃ, tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkameyyaṃ. So varaṃ varaṃ migasaṅghe vadhitvā mudumaṃsāni mudumaṃsāni bhakkhayitvā tameva āsayaṃ ajjhupeyya’nti."
    ],
    "innerText": "28. ‘Tasseva kho, āvuso pāthikaputta, sīhassa migarañño vighāsasaṃvaḍḍho jarasiṅgālo [jarasigālo (sī. syā. pī.)] ditto ceva balavā ca. Atha kho, āvuso, tassa jarasiṅgālassa etadahosi – ko cāhaṃ, ko sīho migarājā. Yaṃnūnāhampi aññataraṃ vanasaṇḍaṃ nissāya āsayaṃ kappeyyaṃ. Tatrāsayaṃ kappetvā sāyanhasamayaṃ āsayā nikkhameyyaṃ, āsayā nikkhamitvā vijambheyyaṃ, vijambhitvā samantā catuddisā anuvilokeyyaṃ, samantā catuddisā anuviloketvā tikkhattuṃ sīhanādaṃ nadeyyaṃ, tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkameyyaṃ. So varaṃ varaṃ migasaṅghe vadhitvā mudumaṃsāni mudumaṃsāni bhakkhayitvā tameva āsayaṃ ajjhupeyya’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Atha kho so, āvuso, jarasiṅgālo aññataraṃ vanasaṇḍaṃ nissāya āsayaṃ kappesi. Tatrāsayaṃ kappetvā sāyanhasamayaṃ āsayā nikkhami, āsayā nikkhamitvā vijambhi, vijambhitvā samantā catuddisā anuvilokesi, samantā catuddisā anuviloketvā tikkhattuṃ sīhanādaṃ nadissāmīti siṅgālakaṃyeva anadi bheraṇḍakaṃyeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhedaṇḍakaṃyeva (ka.)]"
      },
      " anadi, ke ca chave siṅgāle, ke pana sīhanādeti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sīhanāde (?)]"
      },
      "."
    ],
    "innerText": "‘Atha kho so, āvuso, jarasiṅgālo aññataraṃ vanasaṇḍaṃ nissāya āsayaṃ kappesi. Tatrāsayaṃ kappetvā sāyanhasamayaṃ āsayā nikkhami, āsayā nikkhamitvā vijambhi, vijambhitvā samantā catuddisā anuvilokesi, samantā catuddisā anuviloketvā tikkhattuṃ sīhanādaṃ nadissāmīti siṅgālakaṃyeva anadi bheraṇḍakaṃyeva [bhedaṇḍakaṃyeva (ka.)] anadi, ke ca chave siṅgāle, ke pana sīhanādeti [sīhanāde (?)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Evameva kho tvaṃ, āvuso pāthikaputta, sugatāpadānesu jīvamāno sugatātirittāni bhuñjamāno tathāgate ",
      " arahante sammāsambuddhe āsādetabbaṃ maññasi. Ke ca chave pāthikaputte, kā ca tathāgatānaṃ arahantānaṃ sammāsambuddhānaṃ āsādanā’ti."
    ],
    "innerText": "‘Evameva kho tvaṃ, āvuso pāthikaputta, sugatāpadānesu jīvamāno sugatātirittāni bhuñjamāno tathāgate arahante sammāsambuddhe āsādetabbaṃ maññasi. Ke ca chave pāthikaputte, kā ca tathāgatānaṃ arahantānaṃ sammāsambuddhānaṃ āsādanā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "29"
      },
      ". ‘‘Yato kho, bhaggava, jāliyo dārupattikantevāsī iminā opammena neva asakkhi acelaṃ pāthikaputtaṃ tamhā āsanā cāvetuṃ. Atha naṃ etadavoca –"
    ],
    "innerText": "29. ‘‘Yato kho, bhaggava, jāliyo dārupattikantevāsī iminā opammena neva asakkhi acelaṃ pāthikaputtaṃ tamhā āsanā cāvetuṃ. Atha naṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘Sīhoti ",
      " attānaṃ samekkhiyāna,"
    ],
    "innerText": "‘Sīhoti attānaṃ samekkhiyāna,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Amaññi kotthu migarājāhamasmi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "children": [
      "Tatheva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tameva (syā.)]"
      },
      " so siṅgālakaṃ anadi,"
    ],
    "innerText": "Tatheva [tameva (syā.)] so siṅgālakaṃ anadi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ke ca chave siṅgāle ke pana sīhanāde’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Evameva ",
      " kho tvaṃ, āvuso pāthikaputta, sugatāpadānesu jīvamāno sugatātirittāni bhuñjamāno tathāgate arahante sammāsambuddhe āsādetabbaṃ maññasi. Ke ca chave pāthikaputte, kā ca tathāgatānaṃ arahantānaṃ sammāsambuddhānaṃ āsādanā’ti."
    ],
    "innerText": "‘Evameva kho tvaṃ, āvuso pāthikaputta, sugatāpadānesu jīvamāno sugatātirittāni bhuñjamāno tathāgate arahante sammāsambuddhe āsādetabbaṃ maññasi. Ke ca chave pāthikaputte, kā ca tathāgatānaṃ arahantānaṃ sammāsambuddhānaṃ āsādanā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ". ‘‘Yato kho, bhaggava, jāliyo dārupattikantevāsī imināpi opammena neva asakkhi acelaṃ pāthikaputtaṃ tamhā āsanā cāvetuṃ. Atha naṃ etadavoca –"
    ],
    "innerText": "30. ‘‘Yato kho, bhaggava, jāliyo dārupattikantevāsī imināpi opammena neva asakkhi acelaṃ pāthikaputtaṃ tamhā āsanā cāvetuṃ. Atha naṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘Aññaṃ ",
      " anucaṅkamanaṃ, attānaṃ vighāse samekkhiya;"
    ],
    "innerText": "‘Aññaṃ anucaṅkamanaṃ, attānaṃ vighāse samekkhiya;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yāva attānaṃ na passati, kotthu tāva byagghoti maññati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Tatheva ",
      " so siṅgālakaṃ anadi;"
    ],
    "innerText": "Tatheva so siṅgālakaṃ anadi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ke ca chave siṅgāle ke pana sīhanāde’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘Evameva kho tvaṃ, āvuso pāthikaputta, sugatāpadānesu jīvamāno sugatātirittāni bhuñjamāno tathāgate arahante sammāsambuddhe āsādetabbaṃ maññasi. Ke ca chave pāthikaputte, kā ca tathāgatānaṃ arahantānaṃ sammāsambuddhānaṃ āsādanā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ". ‘‘Yato kho, bhaggava, jāliyo dārupattikantevāsī imināpi ",
      " opammena neva asakkhi acelaṃ pāthikaputtaṃ tamhā āsanā cāvetuṃ. Atha naṃ etadavoca –"
    ],
    "innerText": "31. ‘‘Yato kho, bhaggava, jāliyo dārupattikantevāsī imināpi opammena neva asakkhi acelaṃ pāthikaputtaṃ tamhā āsanā cāvetuṃ. Atha naṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘Bhutvāna bheke ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhiṅge (ka.)]"
      },
      " khalamūsikāyo,"
    ],
    "innerText": "‘Bhutvāna bheke [bhiṅge (ka.)] khalamūsikāyo,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "children": [
      "Kaṭasīsu khittāni ca koṇapāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kūṇapāni (syā.)]"
      },
      ";"
    ],
    "innerText": "Kaṭasīsu khittāni ca koṇapāni [kūṇapāni (syā.)];"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Mahāvane suññavane vivaḍḍho,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Amaññi kotthu migarājāhamasmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tatheva so siṅgālakaṃ anadi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ke ca chave siṅgāle ke pana sīhanāde’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Evameva kho tvaṃ, āvuso pāthikaputta, sugatāpadānesu jīvamāno sugatātirittāni bhuñjamāno ",
      " tathāgate arahante sammāsambuddhe āsādetabbaṃ maññasi. Ke ca chave pāthikaputte, kā ca tathāgatānaṃ arahantānaṃ sammāsambuddhānaṃ āsādanā’ti."
    ],
    "innerText": "‘Evameva kho tvaṃ, āvuso pāthikaputta, sugatāpadānesu jīvamāno sugatātirittāni bhuñjamāno tathāgate arahante sammāsambuddhe āsādetabbaṃ maññasi. Ke ca chave pāthikaputte, kā ca tathāgatānaṃ arahantānaṃ sammāsambuddhānaṃ āsādanā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "32"
      },
      ". ‘‘Yato kho, bhaggava, jāliyo dārupattikantevāsī imināpi opammena neva asakkhi ",
      " acelaṃ pāthikaputtaṃ tamhā āsanā cāvetuṃ. Atha taṃ parisaṃ āgantvā evamārocesi – ‘parābhūtarūpo, bho, acelo pāthikaputto āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti."
    ],
    "innerText": "32. ‘‘Yato kho, bhaggava, jāliyo dārupattikantevāsī imināpi opammena neva asakkhi acelaṃ pāthikaputtaṃ tamhā āsanā cāvetuṃ. Atha taṃ parisaṃ āgantvā evamārocesi – ‘parābhūtarūpo, bho, acelo pāthikaputto āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "33"
      },
      ". ‘‘Evaṃ ",
      " vutte, ahaṃ, bhaggava, taṃ parisaṃ etadavocaṃ – ‘abhabbo kho, āvuso, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyya. Sacepāyasmantānaṃ licchavīnaṃ evamassa – mayaṃ acelaṃ pāthikaputtaṃ varattāhi bandhitvā nāgehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[goyugehi (sabbattha) aṭṭhakathā passitabbā]"
      },
      " āviñcheyyāmāti ",
      ". Tā varattā chijjeyyuṃ pāthikaputto vā. Abhabbo pana acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti."
    ],
    "innerText": "33. ‘‘Evaṃ vutte, ahaṃ, bhaggava, taṃ parisaṃ etadavocaṃ – ‘abhabbo kho, āvuso, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyya. Sacepāyasmantānaṃ licchavīnaṃ evamassa – mayaṃ acelaṃ pāthikaputtaṃ varattāhi bandhitvā nāgehi [goyugehi (sabbattha) aṭṭhakathā passitabbā] āviñcheyyāmāti . Tā varattā chijjeyyuṃ pāthikaputto vā. Abhabbo pana acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "34"
      },
      ". ‘‘Atha khvāhaṃ, bhaggava, taṃ parisaṃ dhammiyā kathāya sandassesiṃ samādapesiṃ samuttejesiṃ sampahaṃsesiṃ, taṃ parisaṃ dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā mahābandhanā mokkhaṃ karitvā caturāsītipāṇasahassāni mahāviduggā uddharitvā tejodhātuṃ samāpajjitvā sattatālaṃ vehāsaṃ abbhuggantvā aññaṃ sattatālampi acciṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[aggiṃ (syā.)]"
      },
      " abhinimminitvā pajjalitvā dhūmāyitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dhūpāyitvā (sī. pī.)]"
      },
      " mahāvane kūṭāgārasālāyaṃ paccuṭṭhāsiṃ."
    ],
    "innerText": "34. ‘‘Atha khvāhaṃ, bhaggava, taṃ parisaṃ dhammiyā kathāya sandassesiṃ samādapesiṃ samuttejesiṃ sampahaṃsesiṃ, taṃ parisaṃ dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā mahābandhanā mokkhaṃ karitvā caturāsītipāṇasahassāni mahāviduggā uddharitvā tejodhātuṃ samāpajjitvā sattatālaṃ vehāsaṃ abbhuggantvā aññaṃ sattatālampi acciṃ [aggiṃ (syā.)] abhinimminitvā pajjalitvā dhūmāyitvā [dhūpāyitvā (sī. pī.)] mahāvane kūṭāgārasālāyaṃ paccuṭṭhāsiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ". ‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho ahaṃ, bhaggava, sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘taṃ kiṃ maññasi, sunakkhatta, yatheva te ahaṃ acelaṃ pāthikaputtaṃ ārabbha byākāsiṃ, tatheva taṃ vipākaṃ aññathā vā’ti? ‘Yatheva me, bhante, bhagavā acelaṃ pāthikaputtaṃ ārabbha byākāsi, tatheva taṃ vipākaṃ, no aññathā’ti."
    ],
    "innerText": "35. ‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho ahaṃ, bhaggava, sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘taṃ kiṃ maññasi, sunakkhatta, yatheva te ahaṃ acelaṃ pāthikaputtaṃ ārabbha byākāsiṃ, tatheva taṃ vipākaṃ aññathā vā’ti? ‘Yatheva me, bhante, bhagavā acelaṃ pāthikaputtaṃ ārabbha byākāsi, tatheva taṃ vipākaṃ, no aññathā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Taṃ ",
      " kiṃ maññasi, sunakkhatta, yadi evaṃ sante kataṃ vā hoti uttarimanussadhammā iddhipāṭihāriyaṃ, akataṃ vā’ti? ‘Addhā kho, bhante, evaṃ sante kataṃ hoti uttarimanussadhammā iddhipāṭihāriyaṃ, no akata’nti. ‘Evampi kho ",
      " maṃ tvaṃ, moghapurisa, uttarimanussadhammā ",
      " iddhipāṭihāriyaṃ karontaṃ evaṃ vadesi – na hi pana me, bhante, bhagavā uttarimanussadhammā iddhipāṭihāriyaṃ karotīti. Passa, moghapurisa, yāvañca te idaṃ aparaddhaṃ’ti."
    ],
    "innerText": "‘Taṃ kiṃ maññasi, sunakkhatta, yadi evaṃ sante kataṃ vā hoti uttarimanussadhammā iddhipāṭihāriyaṃ, akataṃ vā’ti? ‘Addhā kho, bhante, evaṃ sante kataṃ hoti uttarimanussadhammā iddhipāṭihāriyaṃ, no akata’nti. ‘Evampi kho maṃ tvaṃ, moghapurisa, uttarimanussadhammā iddhipāṭihāriyaṃ karontaṃ evaṃ vadesi – na hi pana me, bhante, bhagavā uttarimanussadhammā iddhipāṭihāriyaṃ karotīti. Passa, moghapurisa, yāvañca te idaṃ aparaddhaṃ’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Evampi kho, bhaggava, sunakkhatto licchaviputto mayā vuccamāno apakkameva imasmā dhammavinayā, yathā taṃ āpāyiko nerayiko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Aggaññapaññattikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ". ‘‘Aggaññañcāhaṃ, bhaggava, pajānāmi. Tañca pajānāmi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[‘‘tañcapajānāmī’’ti idaṃ syāpotthakenatthi]"
      },
      ", tato ca uttaritaraṃ pajānāmi, tañca pajānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pajānanaṃ (syā. ka.) aṭṭhakathāsaṃvaṇṇanā passitabbā]"
      },
      " na parāmasāmi, aparāmasato ca me paccattaññeva nibbuti viditā, yadabhijānaṃ tathāgato no anayaṃ āpajjati ",
      "."
    ],
    "innerText": "36. ‘‘Aggaññañcāhaṃ, bhaggava, pajānāmi. Tañca pajānāmi [‘‘tañcapajānāmī’’ti idaṃ syāpotthakenatthi], tato ca uttaritaraṃ pajānāmi, tañca pajānaṃ [pajānanaṃ (syā. ka.) aṭṭhakathāsaṃvaṇṇanā passitabbā] na parāmasāmi, aparāmasato ca me paccattaññeva nibbuti viditā, yadabhijānaṃ tathāgato no anayaṃ āpajjati ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ". ‘‘Santi, bhaggava, eke samaṇabrāhmaṇā issarakuttaṃ brahmakuttaṃ ācariyakaṃ aggaññaṃ paññapenti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto issarakuttaṃ brahmakuttaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te ca me evaṃ puṭṭhā, ‘āmo’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āmāti (syā.)]"
      },
      " paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘kathaṃvihitakaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kathaṃ vihitakaṃno pana (ka.)]"
      },
      " tumhe āyasmanto issarakuttaṃ brahmakuttaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te mayā puṭṭhā na sampāyanti, asampāyantā mamaññeva paṭipucchanti. Tesāhaṃ puṭṭho byākaromi –"
    ],
    "innerText": "37. ‘‘Santi, bhaggava, eke samaṇabrāhmaṇā issarakuttaṃ brahmakuttaṃ ācariyakaṃ aggaññaṃ paññapenti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto issarakuttaṃ brahmakuttaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te ca me evaṃ puṭṭhā, ‘āmo’ti [āmāti (syā.)] paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘kathaṃvihitakaṃ pana [kathaṃ vihitakaṃno pana (ka.)] tumhe āyasmanto issarakuttaṃ brahmakuttaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te mayā puṭṭhā na sampāyanti, asampāyantā mamaññeva paṭipucchanti. Tesāhaṃ puṭṭho byākaromi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "38"
      },
      ". ‘Hoti kho so, āvuso, samayo yaṃ kadāci karahaci dīghassa addhuno accayena ayaṃ loko saṃvaṭṭati. Saṃvaṭṭamāne loke yebhuyyena sattā ābhassarasaṃvattanikā honti. Te tattha honti manomayā pītibhakkhā sayaṃpabhā antalikkhacarā subhaṭṭhāyino ciraṃ dīghamaddhānaṃ tiṭṭhanti."
    ],
    "innerText": "38. ‘Hoti kho so, āvuso, samayo yaṃ kadāci karahaci dīghassa addhuno accayena ayaṃ loko saṃvaṭṭati. Saṃvaṭṭamāne loke yebhuyyena sattā ābhassarasaṃvattanikā honti. Te tattha honti manomayā pītibhakkhā sayaṃpabhā antalikkhacarā subhaṭṭhāyino ciraṃ dīghamaddhānaṃ tiṭṭhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Hoti kho so, āvuso, samayo yaṃ kadāci karahaci dīghassa addhuno accayena ayaṃ loko vivaṭṭati. Vivaṭṭamāne loke suññaṃ brahmavimānaṃ pātubhavati. Atha kho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[atha (sī. syā. pī.)]"
      },
      " aññataro ",
      " satto āyukkhayā vā puññakkhayā vā ābhassarakāyā cavitvā suññaṃ brahmavimānaṃ upapajjati ",
      ". So ",
      " tattha hoti manomayo pītibhakkho sayaṃpabho antalikkhacaro subhaṭṭhāyī, ciraṃ dīghamaddhānaṃ tiṭṭhati."
    ],
    "innerText": "‘Hoti kho so, āvuso, samayo yaṃ kadāci karahaci dīghassa addhuno accayena ayaṃ loko vivaṭṭati. Vivaṭṭamāne loke suññaṃ brahmavimānaṃ pātubhavati. Atha kho [atha (sī. syā. pī.)] aññataro satto āyukkhayā vā puññakkhayā vā ābhassarakāyā cavitvā suññaṃ brahmavimānaṃ upapajjati . So tattha hoti manomayo pītibhakkho sayaṃpabho antalikkhacaro subhaṭṭhāyī, ciraṃ dīghamaddhānaṃ tiṭṭhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Tassa tattha ekakassa dīgharattaṃ nivusitattā anabhirati paritassanā uppajjati – aho vata aññepi sattā itthattaṃ āgaccheyyunti. Atha aññepi sattā āyukkhayā vā puññakkhayā vā ",
      " ābhassarakāyā cavitvā brahmavimānaṃ upapajjanti tassa sattassa sahabyataṃ. Tepi tattha honti manomayā pītibhakkhā sayaṃpabhā antalikkhacarā subhaṭṭhāyino, ciraṃ dīghamaddhānaṃ tiṭṭhanti."
    ],
    "innerText": "‘Tassa tattha ekakassa dīgharattaṃ nivusitattā anabhirati paritassanā uppajjati – aho vata aññepi sattā itthattaṃ āgaccheyyunti. Atha aññepi sattā āyukkhayā vā puññakkhayā vā ābhassarakāyā cavitvā brahmavimānaṃ upapajjanti tassa sattassa sahabyataṃ. Tepi tattha honti manomayā pītibhakkhā sayaṃpabhā antalikkhacarā subhaṭṭhāyino, ciraṃ dīghamaddhānaṃ tiṭṭhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "39"
      },
      ". ‘Tatrāvuso, yo so satto paṭhamaṃ upapanno, tassa evaṃ hoti – ahamasmi brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sañjitā (sī. pī.), sajjitā (syā. kaṃ.)]"
      },
      " vasī pitā bhūtabhabyānaṃ, mayā ime sattā nimmitā. Taṃ kissa hetu? Mamañhi pubbe etadahosi – aho vata aññepi sattā itthattaṃ āgaccheyyunti; iti mama ca manopaṇidhi. Ime ca sattā itthattaṃ āgatāti."
    ],
    "innerText": "39. ‘Tatrāvuso, yo so satto paṭhamaṃ upapanno, tassa evaṃ hoti – ahamasmi brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā [sañjitā (sī. pī.), sajjitā (syā. kaṃ.)] vasī pitā bhūtabhabyānaṃ, mayā ime sattā nimmitā. Taṃ kissa hetu? Mamañhi pubbe etadahosi – aho vata aññepi sattā itthattaṃ āgaccheyyunti; iti mama ca manopaṇidhi. Ime ca sattā itthattaṃ āgatāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘Yepi te sattā pacchā upapannā, tesampi evaṃ hoti – ayaṃ kho bhavaṃ brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā vasī pitā bhūtabhabyānaṃ; iminā mayaṃ bhotā brahmunā nimmitā. Taṃ kissa hetu? Imañhi mayaṃ addasāma idha paṭhamaṃ upapannaṃ; mayaṃ panāmha pacchā upapannāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ". ‘Tatrāvuso ",
      ", yo so satto paṭhamaṃ upapanno, so dīghāyukataro ca hoti vaṇṇavantataro ca mahesakkhataro ca. Ye pana te sattā pacchā upapannā, te appāyukatarā ca honti dubbaṇṇatarā ca appesakkhatarā ca."
    ],
    "innerText": "40. ‘Tatrāvuso , yo so satto paṭhamaṃ upapanno, so dīghāyukataro ca hoti vaṇṇavantataro ca mahesakkhataro ca. Ye pana te sattā pacchā upapannā, te appāyukatarā ca honti dubbaṇṇatarā ca appesakkhatarā ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Ṭhānaṃ kho panetaṃ, āvuso, vijjati, yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ",
      " ātappamanvāya padhānamanvāya ",
      " anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati; tato paraṃ nānussarati."
    ],
    "innerText": "‘Ṭhānaṃ kho panetaṃ, āvuso, vijjati, yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati; tato paraṃ nānussarati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘So ",
      " evamāha – yo kho so bhavaṃ brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā vasī pitā bhūtabhabyānaṃ, yena mayaṃ bhotā brahmunā nimmitā. So nicco dhuvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sassato dīghāyuko (syā. ka.)]"
      },
      " sassato avipariṇāmadhammo sassatisamaṃ tatheva ṭhassati. Ye pana mayaṃ ahumhā tena bhotā brahmunā nimmitā, te mayaṃ aniccā addhuvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[addhuvā asassatā (syā. ka.)]"
      },
      " appāyukā cavanadhammā itthattaṃ āgatā’ti. Evaṃvihitakaṃ no tumhe āyasmanto issarakuttaṃ brahmakuttaṃ ācariyakaṃ aggaññaṃ paññapethāti. ‘Te evamāhaṃsu – evaṃ kho no, āvuso gotama, sutaṃ, yathevāyasmā gotamo āhā’ti. ‘‘Aggaññañcāhaṃ, bhaggava, pajānāmi. Tañca pajānāmi, tato ca uttaritaraṃ pajānāmi, tañca pajānaṃ na parāmasāmi, aparāmasato ca me paccattaññeva nibbuti viditā. Yadabhijānaṃ tathāgato no anayaṃ āpajjati."
    ],
    "innerText": "‘So evamāha – yo kho so bhavaṃ brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā vasī pitā bhūtabhabyānaṃ, yena mayaṃ bhotā brahmunā nimmitā. So nicco dhuvo [sassato dīghāyuko (syā. ka.)] sassato avipariṇāmadhammo sassatisamaṃ tatheva ṭhassati. Ye pana mayaṃ ahumhā tena bhotā brahmunā nimmitā, te mayaṃ aniccā addhuvā [addhuvā asassatā (syā. ka.)] appāyukā cavanadhammā itthattaṃ āgatā’ti. Evaṃvihitakaṃ no tumhe āyasmanto issarakuttaṃ brahmakuttaṃ ācariyakaṃ aggaññaṃ paññapethāti. ‘Te evamāhaṃsu – evaṃ kho no, āvuso gotama, sutaṃ, yathevāyasmā gotamo āhā’ti. ‘‘Aggaññañcāhaṃ, bhaggava, pajānāmi. Tañca pajānāmi, tato ca uttaritaraṃ pajānāmi, tañca pajānaṃ na parāmasāmi, aparāmasato ca me paccattaññeva nibbuti viditā. Yadabhijānaṃ tathāgato no anayaṃ āpajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ". ‘‘Santi, bhaggava, eke samaṇabrāhmaṇā khiḍḍāpadosikaṃ ācariyakaṃ aggaññaṃ paññapenti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto khiḍḍāpadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te ca me evaṃ puṭṭhā ‘āmo’ti paṭijānanti. Tyāhaṃ ",
      " evaṃ vadāmi – ‘kathaṃvihitakaṃ pana tumhe āyasmanto khiḍḍāpadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te mayā puṭṭhā na sampāyanti, asampāyantā mamaññeva paṭipucchanti, tesāhaṃ puṭṭho byākaromi ",
      " –"
    ],
    "innerText": "41. ‘‘Santi, bhaggava, eke samaṇabrāhmaṇā khiḍḍāpadosikaṃ ācariyakaṃ aggaññaṃ paññapenti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto khiḍḍāpadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te ca me evaṃ puṭṭhā ‘āmo’ti paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘kathaṃvihitakaṃ pana tumhe āyasmanto khiḍḍāpadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te mayā puṭṭhā na sampāyanti, asampāyantā mamaññeva paṭipucchanti, tesāhaṃ puṭṭho byākaromi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42"
      },
      ". ‘Santāvuso, khiḍḍāpadosikā nāma devā. Te ativelaṃ hassakhiḍḍāratidhammasamāpannā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[hasakhiḍḍāratidhammasamāpannā (ka.)]"
      },
      " viharanti. Tesaṃ ativelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati sammussati, satiyā sammosā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[satiyā sammosāya (syā.)]"
      },
      " te devā tamhā kāyā cavanti."
    ],
    "innerText": "42. ‘Santāvuso, khiḍḍāpadosikā nāma devā. Te ativelaṃ hassakhiḍḍāratidhammasamāpannā [hasakhiḍḍāratidhammasamāpannā (ka.)] viharanti. Tesaṃ ativelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati sammussati, satiyā sammosā [satiyā sammosāya (syā.)] te devā tamhā kāyā cavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Ṭhānaṃ ",
      " kho panetaṃ, āvuso, vijjati, yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati, itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati, agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati; tato paraṃ nānussarati."
    ],
    "innerText": "‘Ṭhānaṃ kho panetaṃ, āvuso, vijjati, yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati, itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati, agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati; tato paraṃ nānussarati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘So evamāha – ye kho te bhonto devā na khiḍḍāpadosikā te na ativelaṃ hassakhiḍḍāratidhammasamāpannā viharanti. Tesaṃ nātivelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati na sammussati, satiyā asammosā te devā tamhā kāyā na cavanti, niccā dhuvā sassatā ",
      " avipariṇāmadhammā sassatisamaṃ tatheva ṭhassanti. Ye pana mayaṃ ahumhā khiḍḍāpadosikā te mayaṃ ativelaṃ hassakhiḍḍāratidhammasamāpannā viharimhā, tesaṃ no ativelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati sammussati, satiyā sammosā evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sammosā eva (sī. pī.) sammosā te (syā. ka.)]"
      },
      " mayaṃ tamhā kāyā cutā, aniccā addhuvā appāyukā cavanadhammā itthattaṃ āgatāti. Evaṃvihitakaṃ no ",
      " tumhe āyasmanto khiḍḍāpadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti. ‘Te ",
      " evamāhaṃsu – evaṃ kho no, āvuso gotama, sutaṃ, yathevāyasmā gotamo āhā’ti. ‘‘Aggaññañcāhaṃ, bhaggava, pajānāmi…pe… yadabhijānaṃ tathāgato no anayaṃ āpajjati."
    ],
    "innerText": "‘So evamāha – ye kho te bhonto devā na khiḍḍāpadosikā te na ativelaṃ hassakhiḍḍāratidhammasamāpannā viharanti. Tesaṃ nātivelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati na sammussati, satiyā asammosā te devā tamhā kāyā na cavanti, niccā dhuvā sassatā avipariṇāmadhammā sassatisamaṃ tatheva ṭhassanti. Ye pana mayaṃ ahumhā khiḍḍāpadosikā te mayaṃ ativelaṃ hassakhiḍḍāratidhammasamāpannā viharimhā, tesaṃ no ativelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati sammussati, satiyā sammosā evaṃ [sammosā eva (sī. pī.) sammosā te (syā. ka.)] mayaṃ tamhā kāyā cutā, aniccā addhuvā appāyukā cavanadhammā itthattaṃ āgatāti. Evaṃvihitakaṃ no tumhe āyasmanto khiḍḍāpadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti. ‘Te evamāhaṃsu – evaṃ kho no, āvuso gotama, sutaṃ, yathevāyasmā gotamo āhā’ti. ‘‘Aggaññañcāhaṃ, bhaggava, pajānāmi…pe… yadabhijānaṃ tathāgato no anayaṃ āpajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "43"
      },
      ". ‘‘Santi, bhaggava, eke samaṇabrāhmaṇā manopadosikaṃ ācariyakaṃ aggaññaṃ paññapenti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto manopadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te ca me evaṃ puṭṭhā ‘āmo’ti paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘kathaṃvihitakaṃ pana tumhe āyasmanto manopadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te mayā puṭṭhā na sampāyanti, asampāyantā mamaññeva paṭipucchanti. Tesāhaṃ puṭṭho byākaromi –"
    ],
    "innerText": "43. ‘‘Santi, bhaggava, eke samaṇabrāhmaṇā manopadosikaṃ ācariyakaṃ aggaññaṃ paññapenti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto manopadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te ca me evaṃ puṭṭhā ‘āmo’ti paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘kathaṃvihitakaṃ pana tumhe āyasmanto manopadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te mayā puṭṭhā na sampāyanti, asampāyantā mamaññeva paṭipucchanti. Tesāhaṃ puṭṭho byākaromi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44"
      },
      ". ‘Santāvuso, manopadosikā nāma devā. Te ativelaṃ aññamaññaṃ upanijjhāyanti. Te ativelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni ",
      " padūsenti. Te aññamaññaṃ paduṭṭhacittā kilantakāyā kilantacittā. Te devā tamhā kāyā cavanti."
    ],
    "innerText": "44. ‘Santāvuso, manopadosikā nāma devā. Te ativelaṃ aññamaññaṃ upanijjhāyanti. Te ativelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni padūsenti. Te aññamaññaṃ paduṭṭhacittā kilantakāyā kilantacittā. Te devā tamhā kāyā cavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘Ṭhānaṃ kho panetaṃ, āvuso, vijjati, yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati, tato paraṃ nānussarati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘So evamāha – ye kho te bhonto devā na manopadosikā te nātivelaṃ ",
      " aññamaññaṃ upanijjhāyanti. Te nātivelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni nappadūsenti. Te aññamaññaṃ appaduṭṭhacittā akilantakāyā akilantacittā. Te devā tamhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[akilantacittā tamhā (ka.)]"
      },
      " kāyā ",
      " na cavanti, niccā dhuvā sassatā avipariṇāmadhammā sassatisamaṃ tatheva ṭhassanti. Ye pana mayaṃ ahumhā manopadosikā, te mayaṃ ativelaṃ aññamaññaṃ upanijjhāyimhā. Te mayaṃ ativelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni padūsimhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[padosiyimhā (syā.), padūsayimhā (?)]"
      },
      ". Te mayaṃ aññamaññaṃ paduṭṭhacittā kilantakāyā kilantacittā. Evaṃ mayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kilantacittāeva mayaṃ (sī. pī.), kilantacittā (ka.)]"
      },
      " tamhā kāyā cutā, aniccā addhuvā appāyukā cavanadhammā itthattaṃ āgatāti. Evaṃvihitakaṃ no tumhe āyasmanto manopadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti. ‘Te evamāhaṃsu – evaṃ kho no, āvuso gotama, sutaṃ, yathevāyasmā gotamo āhā’ti. ‘‘Aggaññañcāhaṃ, bhaggava, pajānāmi…pe… yadabhijānaṃ tathāgato no anayaṃ āpajjati."
    ],
    "innerText": "‘So evamāha – ye kho te bhonto devā na manopadosikā te nātivelaṃ aññamaññaṃ upanijjhāyanti. Te nātivelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni nappadūsenti. Te aññamaññaṃ appaduṭṭhacittā akilantakāyā akilantacittā. Te devā tamhā [akilantacittā tamhā (ka.)] kāyā na cavanti, niccā dhuvā sassatā avipariṇāmadhammā sassatisamaṃ tatheva ṭhassanti. Ye pana mayaṃ ahumhā manopadosikā, te mayaṃ ativelaṃ aññamaññaṃ upanijjhāyimhā. Te mayaṃ ativelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni padūsimhā [padosiyimhā (syā.), padūsayimhā (?)]. Te mayaṃ aññamaññaṃ paduṭṭhacittā kilantakāyā kilantacittā. Evaṃ mayaṃ [kilantacittāeva mayaṃ (sī. pī.), kilantacittā (ka.)] tamhā kāyā cutā, aniccā addhuvā appāyukā cavanadhammā itthattaṃ āgatāti. Evaṃvihitakaṃ no tumhe āyasmanto manopadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti. ‘Te evamāhaṃsu – evaṃ kho no, āvuso gotama, sutaṃ, yathevāyasmā gotamo āhā’ti. ‘‘Aggaññañcāhaṃ, bhaggava, pajānāmi…pe… yadabhijānaṃ tathāgato no anayaṃ āpajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "45"
      },
      ". ‘‘Santi, bhaggava, eke samaṇabrāhmaṇā adhiccasamuppannaṃ ācariyakaṃ aggaññaṃ paññapenti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto adhiccasamuppannaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te ca me evaṃ puṭṭhā ‘āmo’ti paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘kathaṃvihitakaṃ pana tumhe āyasmanto adhiccasamuppannaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te ",
      " mayā puṭṭhā na ",
      " sampāyanti, asampāyantā mamaññeva paṭipucchanti. Tesāhaṃ puṭṭho byākaromi –"
    ],
    "innerText": "45. ‘‘Santi, bhaggava, eke samaṇabrāhmaṇā adhiccasamuppannaṃ ācariyakaṃ aggaññaṃ paññapenti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto adhiccasamuppannaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te ca me evaṃ puṭṭhā ‘āmo’ti paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘kathaṃvihitakaṃ pana tumhe āyasmanto adhiccasamuppannaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te mayā puṭṭhā na sampāyanti, asampāyantā mamaññeva paṭipucchanti. Tesāhaṃ puṭṭho byākaromi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "46"
      },
      ". ‘Santāvuso, asaññasattā nāma devā. Saññuppādā ca pana te devā tamhā kāyā cavanti."
    ],
    "innerText": "46. ‘Santāvuso, asaññasattā nāma devā. Saññuppādā ca pana te devā tamhā kāyā cavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘Ṭhānaṃ kho panetaṃ, āvuso, vijjati. Yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[idaṃ padaṃ brahmajālasutte na dissati. evaṃ (pī. ka.)]"
      },
      " saññuppādaṃ anussarati, tato paraṃ nānussarati."
    ],
    "innerText": "‘Ṭhānaṃ kho panetaṃ, āvuso, vijjati. Yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ [idaṃ padaṃ brahmajālasutte na dissati. evaṃ (pī. ka.)] saññuppādaṃ anussarati, tato paraṃ nānussarati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘So evamāha – adhiccasamuppanno attā ca loko ca. Taṃ kissa hetu? Ahañhi ",
      " pubbe nāhosiṃ, somhi etarahi ahutvā santatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sattakāya (sī. pī.), sattāya (ka. sī.)]"
      },
      " pariṇatoti. Evaṃvihitakaṃ no tumhe āyasmanto adhiccasamuppannaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? ‘Te evamāhaṃsu – evaṃ kho no, āvuso gotama, sutaṃ yathevāyasmā gotamo āhā’ti. ‘‘Aggaññañcāhaṃ, bhaggava, pajānāmi tañca ",
      " pajānāmi, tato ca uttaritaraṃ pajānāmi, tañca pajānaṃ na parāmasāmi, aparāmasato ca me paccattaññeva nibbuti viditā. Yadabhijānaṃ tathāgato no anayaṃ āpajjati."
    ],
    "innerText": "‘So evamāha – adhiccasamuppanno attā ca loko ca. Taṃ kissa hetu? Ahañhi pubbe nāhosiṃ, somhi etarahi ahutvā santatāya [sattakāya (sī. pī.), sattāya (ka. sī.)] pariṇatoti. Evaṃvihitakaṃ no tumhe āyasmanto adhiccasamuppannaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? ‘Te evamāhaṃsu – evaṃ kho no, āvuso gotama, sutaṃ yathevāyasmā gotamo āhā’ti. ‘‘Aggaññañcāhaṃ, bhaggava, pajānāmi tañca pajānāmi, tato ca uttaritaraṃ pajānāmi, tañca pajānaṃ na parāmasāmi, aparāmasato ca me paccattaññeva nibbuti viditā. Yadabhijānaṃ tathāgato no anayaṃ āpajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "47"
      },
      ". ‘‘Evaṃvādiṃ kho maṃ, bhaggava, evamakkhāyiṃ eke samaṇabrāhmaṇā asatā tucchā musā abhūtena abbhācikkhanti – ‘viparīto samaṇo gotamo bhikkhavo ca. Samaṇo gotamo evamāha – yasmiṃ samaye subhaṃ vimokkhaṃ upasampajja viharati, sabbaṃ tasmiṃ samaye asubhantveva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[asubhanteva (sī. syā. pī.)]"
      },
      " pajānātī’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sañjānātīti (sī. pī.)]"
      },
      ". Na ",
      " kho panāhaṃ, bhaggava, evaṃ vadāmi – ‘yasmiṃ samaye subhaṃ vimokkhaṃ upasampajja viharati, sabbaṃ tasmiṃ samaye asubhantveva pajānātī’ti. Evañca khvāhaṃ, bhaggava, vadāmi – ‘yasmiṃ samaye subhaṃ vimokkhaṃ upasampajja viharati, subhantveva tasmiṃ samaye pajānātī’ti."
    ],
    "innerText": "47. ‘‘Evaṃvādiṃ kho maṃ, bhaggava, evamakkhāyiṃ eke samaṇabrāhmaṇā asatā tucchā musā abhūtena abbhācikkhanti – ‘viparīto samaṇo gotamo bhikkhavo ca. Samaṇo gotamo evamāha – yasmiṃ samaye subhaṃ vimokkhaṃ upasampajja viharati, sabbaṃ tasmiṃ samaye asubhantveva [asubhanteva (sī. syā. pī.)] pajānātī’ti [sañjānātīti (sī. pī.)]. Na kho panāhaṃ, bhaggava, evaṃ vadāmi – ‘yasmiṃ samaye subhaṃ vimokkhaṃ upasampajja viharati, sabbaṃ tasmiṃ samaye asubhantveva pajānātī’ti. Evañca khvāhaṃ, bhaggava, vadāmi – ‘yasmiṃ samaye subhaṃ vimokkhaṃ upasampajja viharati, subhantveva tasmiṃ samaye pajānātī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Te ",
      " ca, bhante, viparītā, ye bhagavantaṃ viparītato dahanti bhikkhavo ca. Evaṃpasanno ahaṃ, bhante, bhagavati. Pahoti ",
      " me bhagavā tathā dhammaṃ desetuṃ, yathā ahaṃ subhaṃ vimokkhaṃ upasampajja vihareyya’’nti."
    ],
    "innerText": "‘‘Te ca, bhante, viparītā, ye bhagavantaṃ viparītato dahanti bhikkhavo ca. Evaṃpasanno ahaṃ, bhante, bhagavati. Pahoti me bhagavā tathā dhammaṃ desetuṃ, yathā ahaṃ subhaṃ vimokkhaṃ upasampajja vihareyya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "48"
      },
      ". ‘‘Dukkaraṃ kho etaṃ, bhaggava, tayā aññadiṭṭhikena aññakhantikena aññarucikena aññatrāyogena aññatrācariyakena subhaṃ vimokkhaṃ upasampajja viharituṃ. Iṅgha tvaṃ, bhaggava, yo ca te ayaṃ mayi pasādo, tameva tvaṃ sādhukamanurakkhā’’ti. ‘‘Sace taṃ, bhante, mayā dukkaraṃ aññadiṭṭhikena aññakhantikena aññarucikena aññatrāyogena aññatrācariyakena subhaṃ vimokkhaṃ upasampajja viharituṃ. Yo ca me ayaṃ, bhante, bhagavati pasādo, tamevāhaṃ sādhukamanurakkhissāmī’’ti. Idamavoca bhagavā. Attamano bhaggavagotto paribbājako bhagavato bhāsitaṃ abhinandīti."
    ],
    "innerText": "48. ‘‘Dukkaraṃ kho etaṃ, bhaggava, tayā aññadiṭṭhikena aññakhantikena aññarucikena aññatrāyogena aññatrācariyakena subhaṃ vimokkhaṃ upasampajja viharituṃ. Iṅgha tvaṃ, bhaggava, yo ca te ayaṃ mayi pasādo, tameva tvaṃ sādhukamanurakkhā’’ti. ‘‘Sace taṃ, bhante, mayā dukkaraṃ aññadiṭṭhikena aññakhantikena aññarucikena aññatrāyogena aññatrācariyakena subhaṃ vimokkhaṃ upasampajja viharituṃ. Yo ca me ayaṃ, bhante, bhagavati pasādo, tamevāhaṃ sādhukamanurakkhissāmī’’ti. Idamavoca bhagavā. Attamano bhaggavagotto paribbājako bhagavato bhāsitaṃ abhinandīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      "Pāthikasuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pāṭikasuttantaṃ (sī. syā. kaṃ. pī.)]"
      },
      " niṭṭhitaṃ paṭhamaṃ."
    ],
    "innerText": "Pāthikasuttaṃ [pāṭikasuttantaṃ (sī. syā. kaṃ. pī.)] niṭṭhitaṃ paṭhamaṃ."
  }
]