[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "8. Siṅgālasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nidānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "242"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti siṅgālasuttaṃ. Tatrāyamanuttānapadavaṇṇanā – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "veḷuvane kalandakanivāpe"
      },
      "ti veḷuvananti tassa uyyānassa nāmaṃ. Taṃ kira veḷūhi parikkhittaṃ ahosi aṭṭhārasahatthena ca pākārena gopuraṭṭālakayuttaṃ nīlobhāsaṃ manoramaṃ, tena veḷuvananti vuccati. Kalandakānañcettha nivāpaṃ adaṃsu, tena kalandakanivāpoti vuccati."
    ],
    "innerText": "242.Evaṃme sutanti siṅgālasuttaṃ. Tatrāyamanuttānapadavaṇṇanā – veḷuvane kalandakanivāpeti veḷuvananti tassa uyyānassa nāmaṃ. Taṃ kira veḷūhi parikkhittaṃ ahosi aṭṭhārasahatthena ca pākārena gopuraṭṭālakayuttaṃ nīlobhāsaṃ manoramaṃ, tena veḷuvananti vuccati. Kalandakānañcettha nivāpaṃ adaṃsu, tena kalandakanivāpoti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pubbe kira aññataro rājā tattha uyyānakīḷanatthaṃ āgato surāmadena matto divā niddaṃ okkami. Parijanopissa ‘‘sutto rājā’’ti pupphaphalādīhi palobhiyamāno ito cito ca pakkāmi. Atha surāgandhena aññatarasmā susirarukkhā kaṇhasappo nikkhamitvā rañño abhimukho āgacchati, taṃ disvā rukkhadevatā ‘‘rañño jīvitaṃ dammī’’ti kāḷakavesena āgantvā kaṇṇamūle saddamakāsi. Rājā paṭibujjhi. Kaṇhasappo nivatto. So taṃ disvā ‘‘imāya kāḷakāya mama jīvitaṃ dinna’’nti kāḷakānaṃ tattha nivāpaṃ paṭṭhapesi, abhayaghosañca ghosāpesi. Tasmā taṃ tato pabhuti ‘‘kalandakanivāpo’’ti saṅkhyaṃ gataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kalandakā"
      },
      "ti hi kāḷakānaṃ etaṃ nāmaṃ."
    ],
    "innerText": "Pubbe kira aññataro rājā tattha uyyānakīḷanatthaṃ āgato surāmadena matto divā niddaṃ okkami. Parijanopissa ‘‘sutto rājā’’ti pupphaphalādīhi palobhiyamāno ito cito ca pakkāmi. Atha surāgandhena aññatarasmā susirarukkhā kaṇhasappo nikkhamitvā rañño abhimukho āgacchati, taṃ disvā rukkhadevatā ‘‘rañño jīvitaṃ dammī’’ti kāḷakavesena āgantvā kaṇṇamūle saddamakāsi. Rājā paṭibujjhi. Kaṇhasappo nivatto. So taṃ disvā ‘‘imāya kāḷakāya mama jīvitaṃ dinna’’nti kāḷakānaṃ tattha nivāpaṃ paṭṭhapesi, abhayaghosañca ghosāpesi. Tasmā taṃ tato pabhuti ‘‘kalandakanivāpo’’ti saṅkhyaṃ gataṃ. Kalandakāti hi kāḷakānaṃ etaṃ nāmaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena kho pana samayenā"
      },
      "ti yasmiṃ samaye bhagavā rājagahaṃ gocaragāmaṃ katvā veḷuvane kalandakanivāpe viharati, tena samayena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siṅgālako gahapatiputto"
      },
      "ti siṅgālakoti tassa nāmaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gahapatiputto"
      },
      "ti gahapatissa putto gahapatiputto. Tassa kira pitā gahapatimahāsālo, nidahitvā ṭhapitā cassa gehe cattālīsa dhanakoṭiyo ",
      " atthi. So bhagavati niṭṭhaṅgato upāsako sotāpanno, bhariyāpissa sotāpannāyeva. Putto panassa assaddho appasanno. Atha naṃ mātāpitaro abhikkhaṇaṃ evaṃ ovadanti – ‘‘tāta satthāraṃ upasaṅkama, dhammasenāpatiṃ mahāmoggallānaṃ ",
      " mahākassapaṃ asītimahāsāvake upasaṅkamā’’ti. So evamāha – ‘‘natthi mama tumhākaṃ samaṇānaṃ upasaṅkamanakiccaṃ, samaṇānaṃ santikaṃ gantvā vanditabbaṃ hoti, onamitvā vandantassa piṭṭhi rujjati, jāṇukāni kharāni honti, bhūmiyaṃ nisīditabbaṃ ",
      " hoti, tattha nisinnassa vatthāni kilissanti jīranti, samīpe nisinnakālato paṭṭhāya kathāsallāpo hoti, tasmiṃ sati vissāso uppajjati, tato nimantetvā cīvarapiṇḍapātādīni dātabbāni honti. Evaṃ sante attho parihāyati, natthi mayhaṃ tumhākaṃ samaṇānaṃ upasaṅkamanakicca’’nti. Iti naṃ yāvajīvaṃ ovadantāpi mātāpitaro sāsane upanetuṃ nāsakkhiṃsu."
    ],
    "innerText": "Tena kho pana samayenāti yasmiṃ samaye bhagavā rājagahaṃ gocaragāmaṃ katvā veḷuvane kalandakanivāpe viharati, tena samayena. Siṅgālako gahapatiputtoti siṅgālakoti tassa nāmaṃ. Gahapatiputtoti gahapatissa putto gahapatiputto. Tassa kira pitā gahapatimahāsālo, nidahitvā ṭhapitā cassa gehe cattālīsa dhanakoṭiyo atthi. So bhagavati niṭṭhaṅgato upāsako sotāpanno, bhariyāpissa sotāpannāyeva. Putto panassa assaddho appasanno. Atha naṃ mātāpitaro abhikkhaṇaṃ evaṃ ovadanti – ‘‘tāta satthāraṃ upasaṅkama, dhammasenāpatiṃ mahāmoggallānaṃ mahākassapaṃ asītimahāsāvake upasaṅkamā’’ti. So evamāha – ‘‘natthi mama tumhākaṃ samaṇānaṃ upasaṅkamanakiccaṃ, samaṇānaṃ santikaṃ gantvā vanditabbaṃ hoti, onamitvā vandantassa piṭṭhi rujjati, jāṇukāni kharāni honti, bhūmiyaṃ nisīditabbaṃ hoti, tattha nisinnassa vatthāni kilissanti jīranti, samīpe nisinnakālato paṭṭhāya kathāsallāpo hoti, tasmiṃ sati vissāso uppajjati, tato nimantetvā cīvarapiṇḍapātādīni dātabbāni honti. Evaṃ sante attho parihāyati, natthi mayhaṃ tumhākaṃ samaṇānaṃ upasaṅkamanakicca’’nti. Iti naṃ yāvajīvaṃ ovadantāpi mātāpitaro sāsane upanetuṃ nāsakkhiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Athassa pitā maraṇamañce nipanno ‘‘mama puttassa ovādaṃ dātuṃ vaṭṭatī’’ti cintetvā puna cintesi – ‘‘disā tāta namassāhī’’ti evamassa ovādaṃ dassāmi, so atthaṃ ajānanto disā namassissati, atha naṃ satthā vā sāvakā vā passitvā ‘‘kiṃ karosī’’ti pucchissanti. Tato ‘‘mayhaṃ pitā disā namassanaṃ karohīti maṃ ovadī’’ti vakkhati. Athassa te ‘‘na tuyhaṃ pitā etā disā namassāpeti, imā pana disā namassāpetī’’ti dhammaṃ desessanti. So buddhasāsane guṇaṃ ñatvā ‘‘puññakammaṃ karissatī’’ti. Atha naṃ āmantāpetvā ‘‘tāta, pātova uṭṭhāya cha disā namasseyyāsī’’ti āha. Maraṇamañce nipannassa kathā nāma yāvajīvaṃ anussaraṇīyā hoti. Tasmā so gahapatiputto taṃ pituvacanaṃ anussaranto tathā akāsi. Tasmā ‘‘kālasseva uṭṭhāya rājagahā nikkhamitvā’’tiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "243"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puthudisā"
      },
      "ti bahudisā. Idāni tā dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puratthimaṃ disa"
      },
      "ntiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāvisī"
      },
      "ti na tāva paviṭṭho, pavisissāmīti nikkhantattā pana antarāmagge vattamānopi evaṃ vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Addasā kho bhagavā"
      },
      "ti na idāneva addasa, paccūsasamayepi buddhacakkhunā lokaṃ volokento etaṃ disā namassamānaṃ disvā ‘‘ajja ahaṃ siṅgālassa gahapatiputtassa gihivinayaṃ siṅgālasuttantaṃ kathessāmi, mahājanassa sā kathā saphalā bhavissati, gantabbaṃ mayā etthā’’ti. Tasmā ",
      " pātova nikkhamitvā rājagahaṃ piṇḍāya pāvisi, pavisanto ca naṃ tatheva addasa. Tena vuttaṃ – ‘‘addasā kho bhagavā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etadavocā"
      },
      "ti so kira avidūre ṭhitampi satthāraṃ na passati, disāyeva namassati. Athaṃ naṃ bhagavā sūriyarasmisamphassena vikasamānaṃ mahāpadumaṃ viya mukhaṃ vivaritvā ‘‘kiṃ nu kho tvaṃ, gahapatiputtā’’tiādikaṃ etadavoca."
    ],
    "innerText": "243.Puthudisāti bahudisā. Idāni tā dassento puratthimaṃ disantiādimāha. Pāvisīti na tāva paviṭṭho, pavisissāmīti nikkhantattā pana antarāmagge vattamānopi evaṃ vuccati. Addasā kho bhagavāti na idāneva addasa, paccūsasamayepi buddhacakkhunā lokaṃ volokento etaṃ disā namassamānaṃ disvā ‘‘ajja ahaṃ siṅgālassa gahapatiputtassa gihivinayaṃ siṅgālasuttantaṃ kathessāmi, mahājanassa sā kathā saphalā bhavissati, gantabbaṃ mayā etthā’’ti. Tasmā pātova nikkhamitvā rājagahaṃ piṇḍāya pāvisi, pavisanto ca naṃ tatheva addasa. Tena vuttaṃ – ‘‘addasā kho bhagavā’’ti. Etadavocāti so kira avidūre ṭhitampi satthāraṃ na passati, disāyeva namassati. Athaṃ naṃ bhagavā sūriyarasmisamphassena vikasamānaṃ mahāpadumaṃ viya mukhaṃ vivaritvā ‘‘kiṃ nu kho tvaṃ, gahapatiputtā’’tiādikaṃ etadavoca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Chadisādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "244"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kathaṃ pana, bhante"
      },
      "ti so kira taṃ bhagavato vacanaṃ sutvāva cintesi ‘‘yā kira mama pitarā cha disā namassitabbā’’ti vuttā, na kira tā etā, aññā kira ariyasāvakena cha disā namassitabbā. Handāhaṃ ariyasāvakena namassitabbā disāyeva pucchitvā namassāmīti. So tā pucchanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathā kathaṃ pana, bhante"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathā"
      },
      "ti nipātamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathaṃ panā"
      },
      "ti idameva pucchāpadaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammakilesā"
      },
      "ti tehi kammehi sattā kilissanti, tasmā kammakilesāti vuccanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhānehī"
      },
      "ti kāraṇehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apāyamukhānī"
      },
      "ti vināsamukhāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So"
      },
      "ti so sotāpanno ariyasāvako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cuddasa pāpakāpagato"
      },
      "ti etehi cuddasahi pāpakehi lāmakehi apagato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chaddisāpaṭicchādī"
      },
      "ti cha disā paṭicchādento. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubholokavijayāyā"
      },
      "ti ubhinnaṃ idhalokaparalokānaṃ vijinanatthāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayañceva loko āraddho hotī"
      },
      "ti evarūpassa hi idha loke pañca verāni na honti, tenassa ayañceva loko āraddho hoti paritosito ceva nipphādito ca. Paralokepi pañca verāni na honti, tenassa paro ca loko ārādhito hoti. Tasmā so kāyassa bhedā parammaraṇā sugatiṃ saggaṃ lokaṃ upapajjati."
    ],
    "innerText": "244.Yathākathaṃ pana, bhanteti so kira taṃ bhagavato vacanaṃ sutvāva cintesi ‘‘yā kira mama pitarā cha disā namassitabbā’’ti vuttā, na kira tā etā, aññā kira ariyasāvakena cha disā namassitabbā. Handāhaṃ ariyasāvakena namassitabbā disāyeva pucchitvā namassāmīti. So tā pucchanto yathā kathaṃ pana, bhantetiādimāha. Tattha yathāti nipātamattaṃ. Kathaṃ panāti idameva pucchāpadaṃ. Kammakilesāti tehi kammehi sattā kilissanti, tasmā kammakilesāti vuccanti. Ṭhānehīti kāraṇehi. Apāyamukhānīti vināsamukhāni. Soti so sotāpanno ariyasāvako. Cuddasa pāpakāpagatoti etehi cuddasahi pāpakehi lāmakehi apagato. Chaddisāpaṭicchādīti cha disā paṭicchādento. Ubholokavijayāyāti ubhinnaṃ idhalokaparalokānaṃ vijinanatthāya. Ayañceva loko āraddho hotīti evarūpassa hi idha loke pañca verāni na honti, tenassa ayañceva loko āraddho hoti paritosito ceva nipphādito ca. Paralokepi pañca verāni na honti, tenassa paro ca loko ārādhito hoti. Tasmā so kāyassa bhedā parammaraṇā sugatiṃ saggaṃ lokaṃ upapajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "245"
      },
      ". Iti bhagavā saṅkhepena mātikaṃ ṭhapetvā idāni tameva vitthārento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "katamassa cattāro kammakilesā"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammakileso"
      },
      "ti kammañca taṃ kilesasampayuttattā kileso cāti kammakileso. Sakilesoyeva hi pāṇaṃ hanati, nikkileso na hanati, tasmā pāṇātipāto ‘‘kammakileso’’ti vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adinnādānādīsu"
      },
      "pi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Athāpara"
      },
      "nti aparampi etadatthaparidīpakameva gāthābandhaṃ avocāti attho."
    ],
    "innerText": "245. Iti bhagavā saṅkhepena mātikaṃ ṭhapetvā idāni tameva vitthārento katamassa cattāro kammakilesātiādimāha. Kammakilesoti kammañca taṃ kilesasampayuttattā kileso cāti kammakileso. Sakilesoyeva hi pāṇaṃ hanati, nikkileso na hanati, tasmā pāṇātipāto ‘‘kammakileso’’ti vutto. Adinnādānādīsupi eseva nayo. Athāparanti aparampi etadatthaparidīpakameva gāthābandhaṃ avocāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Catuṭhānādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "246"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpakammaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karotī"
      },
      "ti idaṃ bhagavā yasmā kārake dassite akārako pākaṭo hoti, tasmā ‘‘pāpakammaṃ na karotī’’ti mātikaṃ ṭhapetvāpi desanākusalatāya paṭhamataraṃ kārakaṃ dassento āha ",
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chandāgatiṃ gacchanto"
      },
      "ti chandena pemena agatiṃ gacchanto akattabbaṃ karonto. Parapadesupi eseva nayo. Tattha yo ‘‘ayaṃ me mitto vā sambhatto vā sandiṭṭho vā ñātako vā lañjaṃ vā pana me detī’’ti chandavasena assāmikaṃ sāmikaṃ karoti, ayaṃ chandāgatiṃ gacchanto pāpakammaṃ karoti nāma. Yo ‘‘ayaṃ me verī’’ti pakativeravasena taṅkhaṇuppannakodhavasena ",
      " vā sāmikaṃ assāmikaṃ karoti, ayaṃ dosāgatiṃ gacchanto pāpakammaṃ karoti nāma. Yo pana mandattā momūhattā yaṃ vā taṃ vā vatvā assāmikaṃ sāmikaṃ karoti, ayaṃ mohāgatiṃ gacchanto pāpakammaṃ karoti nāma. Yo pana ‘‘ayaṃ rājavallabho vā visamanissito vā anatthampi me kareyyā’’ti bhīto assāmikaṃ sāmikaṃ karoti, ayaṃ bhayāgatiṃ gacchanto pāpakammaṃ karoti nāma. Yo pana yaṃkiñci bhājento ‘‘ayaṃ me sandiṭṭho vā sambhatto vā’’ti pemavasena atirekaṃ deti, ‘‘ayaṃ me verī’’ti dosavasena ūnakaṃ deti, momūhattā dinnādinnaṃ ajānamāno kassaci ūnaṃ kassaci adhikaṃ deti, ‘‘ayaṃ imasmiṃ adiyyamāne mayhaṃ anatthampi kareyyā’’ti bhīto kassaci atirekaṃ deti, so catubbidhopi yathānukkamena chandāgatiādīni gacchanto pāpakammaṃ karoti nāma."
    ],
    "innerText": "246.Pāpakammaṃkarotīti idaṃ bhagavā yasmā kārake dassite akārako pākaṭo hoti, tasmā ‘‘pāpakammaṃ na karotī’’ti mātikaṃ ṭhapetvāpi desanākusalatāya paṭhamataraṃ kārakaṃ dassento āha . Tattha chandāgatiṃ gacchantoti chandena pemena agatiṃ gacchanto akattabbaṃ karonto. Parapadesupi eseva nayo. Tattha yo ‘‘ayaṃ me mitto vā sambhatto vā sandiṭṭho vā ñātako vā lañjaṃ vā pana me detī’’ti chandavasena assāmikaṃ sāmikaṃ karoti, ayaṃ chandāgatiṃ gacchanto pāpakammaṃ karoti nāma. Yo ‘‘ayaṃ me verī’’ti pakativeravasena taṅkhaṇuppannakodhavasena vā sāmikaṃ assāmikaṃ karoti, ayaṃ dosāgatiṃ gacchanto pāpakammaṃ karoti nāma. Yo pana mandattā momūhattā yaṃ vā taṃ vā vatvā assāmikaṃ sāmikaṃ karoti, ayaṃ mohāgatiṃ gacchanto pāpakammaṃ karoti nāma. Yo pana ‘‘ayaṃ rājavallabho vā visamanissito vā anatthampi me kareyyā’’ti bhīto assāmikaṃ sāmikaṃ karoti, ayaṃ bhayāgatiṃ gacchanto pāpakammaṃ karoti nāma. Yo pana yaṃkiñci bhājento ‘‘ayaṃ me sandiṭṭho vā sambhatto vā’’ti pemavasena atirekaṃ deti, ‘‘ayaṃ me verī’’ti dosavasena ūnakaṃ deti, momūhattā dinnādinnaṃ ajānamāno kassaci ūnaṃ kassaci adhikaṃ deti, ‘‘ayaṃ imasmiṃ adiyyamāne mayhaṃ anatthampi kareyyā’’ti bhīto kassaci atirekaṃ deti, so catubbidhopi yathānukkamena chandāgatiādīni gacchanto pāpakammaṃ karoti nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ariyasāvako pana jīvitakkhayaṃ pāpuṇantopi chandāgatiādīni na gacchati. Tena vuttaṃ – ‘‘imehi catūhi ṭhānehi pāpakammaṃ na karotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nihīyati yaso tassā"
      },
      "ti tassa agatigāmino kittiyasopi parivārayasopi nihīyati parihāyati."
    ],
    "innerText": "Nihīyati yaso tassāti tassa agatigāmino kittiyasopi parivārayasopi nihīyati parihāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Chaapāyamukhādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "247"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Surāmerayamajjappamādaṭṭhānānuyogo"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "surā"
      },
      "ti piṭṭhasurā pūvasurā odanasurā kiṇṇapakkhittā sambhārasaṃyuttāti pañca surā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Meraya"
      },
      "nti pupphāsavo phalāsavo madhvāsavo guḷāsavo sambhārasaṃyuttoti pañca āsavā. Taṃ sabbampi madakaraṇavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "majjaṃ. Pamādaṭṭhāna"
      },
      "nti pamādakāraṇaṃ. Yāya cetanāya taṃ majjaṃ pivati, tassa etaṃ adhivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuyogo"
      },
      "ti tassa surāmerayamajjappamādaṭṭhānassa anuanuyogo punappunaṃ karaṇaṃ. Yasmā panetaṃ anuyuttassa uppannā ceva ",
      " bhogā parihāyanti, anuppannā ca nuppajjanti, tasmā ‘‘bhogānaṃ apāyamukha’’nti ",
      " vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vikālavisikhācariyānuyogo"
      },
      "ti avelāya visikhāsu cariyānuyuttatā."
    ],
    "innerText": "247.Surāmerayamajjappamādaṭṭhānānuyogoti ettha surāti piṭṭhasurā pūvasurā odanasurā kiṇṇapakkhittā sambhārasaṃyuttāti pañca surā. Merayanti pupphāsavo phalāsavo madhvāsavo guḷāsavo sambhārasaṃyuttoti pañca āsavā. Taṃ sabbampi madakaraṇavasena majjaṃ. Pamādaṭṭhānanti pamādakāraṇaṃ. Yāya cetanāya taṃ majjaṃ pivati, tassa etaṃ adhivacanaṃ. Anuyogoti tassa surāmerayamajjappamādaṭṭhānassa anuanuyogo punappunaṃ karaṇaṃ. Yasmā panetaṃ anuyuttassa uppannā ceva bhogā parihāyanti, anuppannā ca nuppajjanti, tasmā ‘‘bhogānaṃ apāyamukha’’nti vuttaṃ. Vikālavisikhācariyānuyogoti avelāya visikhāsu cariyānuyuttatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samajjābhicaraṇa"
      },
      "nti naccādidassanavasena samajjāgamanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ālasyānuyogo"
      },
      "ti kāyālasiyatāya yuttappayuttatā."
    ],
    "innerText": "Samajjābhicaraṇanti naccādidassanavasena samajjāgamanaṃ. Ālasyānuyogoti kāyālasiyatāya yuttappayuttatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Surāmerayassa chaādīnavādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "248"
      },
      ". Evaṃ ",
      " channaṃ apāyamukhānaṃ mātikaṃ ṭhapetvā idāni tāni vibhajanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cha kho me, gahapatiputta ādīnavā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sandiṭṭhikā"
      },
      "ti sāmaṃ passitabbā, idhalokabhāvinī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhanajānī"
      },
      "ti dhanahāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kalahappavaḍḍhanī"
      },
      "ti vācākalahassa ceva hatthaparāmāsādikāyakalahassa ca vaḍḍhanī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rogānaṃ āyatana"
      },
      "nti tesaṃ tesaṃ akkhirogādīnaṃ khettaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akittisañjananī"
      },
      "ti suraṃ pivitvā hi mātarampi paharanti pitarampi, aññaṃ bahumpi avattabbaṃ vadanti, akattabbaṃ karonti. Tena garahampi daṇḍampi hatthapādādichedampi pāpuṇanti, idhalokepi paralokepi akittiṃ pāpuṇanti, iti tesaṃ sā surā akittisañjananī nāma hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kopīnanidaṃsanī"
      },
      "ti guyhaṭṭhānañhi vivariyamānaṃ hiriṃ kopeti vināseti, tasmā ‘‘kopīna’’nti vuccati, surāmadamattā ca taṃ taṃ aṅgaṃ vivaritvā vicaranti, tena nesaṃ sā surā kopīnassa nidaṃsanato ‘‘kopīnanidaṃsanī’’ti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāya dubbalikaraṇī"
      },
      "ti sāgatattherassa viya kammassakatapaññaṃ dubbalaṃ karoti, tasmā ‘‘paññāya dubbalikaraṇī’’ti vuccati. Maggapaññaṃ pana dubbalaṃ kātuṃ na sakkoti. Adhigatamaggānañhi sā antomukhameva na pavisati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chaṭṭhaṃ pada"
      },
      "nti chaṭṭhaṃ kāraṇaṃ."
    ],
    "innerText": "248. Evaṃ channaṃ apāyamukhānaṃ mātikaṃ ṭhapetvā idāni tāni vibhajanto cha kho me, gahapatiputta ādīnavātiādimāha. Tattha sandiṭṭhikāti sāmaṃ passitabbā, idhalokabhāvinī. Dhanajānīti dhanahāni. Kalahappavaḍḍhanīti vācākalahassa ceva hatthaparāmāsādikāyakalahassa ca vaḍḍhanī. Rogānaṃ āyatananti tesaṃ tesaṃ akkhirogādīnaṃ khettaṃ. Akittisañjananīti suraṃ pivitvā hi mātarampi paharanti pitarampi, aññaṃ bahumpi avattabbaṃ vadanti, akattabbaṃ karonti. Tena garahampi daṇḍampi hatthapādādichedampi pāpuṇanti, idhalokepi paralokepi akittiṃ pāpuṇanti, iti tesaṃ sā surā akittisañjananī nāma hoti. Kopīnanidaṃsanīti guyhaṭṭhānañhi vivariyamānaṃ hiriṃ kopeti vināseti, tasmā ‘‘kopīna’’nti vuccati, surāmadamattā ca taṃ taṃ aṅgaṃ vivaritvā vicaranti, tena nesaṃ sā surā kopīnassa nidaṃsanato ‘‘kopīnanidaṃsanī’’ti vuccati. Paññāya dubbalikaraṇīti sāgatattherassa viya kammassakatapaññaṃ dubbalaṃ karoti, tasmā ‘‘paññāya dubbalikaraṇī’’ti vuccati. Maggapaññaṃ pana dubbalaṃ kātuṃ na sakkoti. Adhigatamaggānañhi sā antomukhameva na pavisati. Chaṭṭhaṃ padanti chaṭṭhaṃ kāraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "249"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attāpissa agutto arakkhito hotī"
      },
      "ti avelāya caranto hi khāṇukaṇṭakādīnipi akkamati, ahināpi yakkhādīhipi samāgacchati, taṃ taṃ ṭhānaṃ gacchatīti ñatvā verinopi naṃ nilīyitvā gaṇhanti vā hananti vā. Evaṃ attāpissa agutto hoti arakkhito. Puttadārāpi ‘‘amhākaṃ pitā amhākaṃ sāmi rattiṃ vicarati, kimaṅgaṃ pana maya’’nti itissa puttadhītaropi bhariyāpi ",
      " bahi patthanaṃ katvā rattiṃ carantā anayabyasanaṃ pāpuṇanti. Evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puttadāropissa agutto arakkhito hoti. Sāpateyya"
      },
      "nti tassa puttadāraparijanassa rattiṃ caraṇakabhāvaṃ ñatvā corā suññaṃ ",
      " gehaṃ pavisitvā yaṃ icchanti, taṃ haranti. Evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāpateyyampissa aguttaṃ arakkhitaṃ hoti. Saṅkiyo ca hotī"
      },
      "ti aññehi katapāpakammesupi ‘‘iminā kataṃ bhavissatī’’ti saṅkitabbo hoti. Yassa yassa gharadvārena yāti, tattha yaṃ aññena corakammaṃ paradārikakammaṃ vā kataṃ, taṃ ‘‘iminā kata’’nti vutte abhūtaṃ asantampi tasmiṃ rūhati patiṭṭhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahūnañca dukkhadhammāna"
      },
      "nti ettakaṃ dukkhaṃ, ettakaṃ domanassanti vattuṃ na sakkā, aññasmiṃ puggale asati sabbaṃ vikālacārimhi āharitabbaṃ hoti, iti so bahūnaṃ dukkhadhammānaṃ purakkhato puregāmī hoti."
    ],
    "innerText": "249.Attāpissa agutto arakkhito hotīti avelāya caranto hi khāṇukaṇṭakādīnipi akkamati, ahināpi yakkhādīhipi samāgacchati, taṃ taṃ ṭhānaṃ gacchatīti ñatvā verinopi naṃ nilīyitvā gaṇhanti vā hananti vā. Evaṃ attāpissa agutto hoti arakkhito. Puttadārāpi ‘‘amhākaṃ pitā amhākaṃ sāmi rattiṃ vicarati, kimaṅgaṃ pana maya’’nti itissa puttadhītaropi bhariyāpi bahi patthanaṃ katvā rattiṃ carantā anayabyasanaṃ pāpuṇanti. Evaṃ puttadāropissa agutto arakkhito hoti. Sāpateyyanti tassa puttadāraparijanassa rattiṃ caraṇakabhāvaṃ ñatvā corā suññaṃ gehaṃ pavisitvā yaṃ icchanti, taṃ haranti. Evaṃ sāpateyyampissa aguttaṃ arakkhitaṃ hoti. Saṅkiyo ca hotīti aññehi katapāpakammesupi ‘‘iminā kataṃ bhavissatī’’ti saṅkitabbo hoti. Yassa yassa gharadvārena yāti, tattha yaṃ aññena corakammaṃ paradārikakammaṃ vā kataṃ, taṃ ‘‘iminā kata’’nti vutte abhūtaṃ asantampi tasmiṃ rūhati patiṭṭhāti. Bahūnañca dukkhadhammānanti ettakaṃ dukkhaṃ, ettakaṃ domanassanti vattuṃ na sakkā, aññasmiṃ puggale asati sabbaṃ vikālacārimhi āharitabbaṃ hoti, iti so bahūnaṃ dukkhadhammānaṃ purakkhato puregāmī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "250"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nacca"
      },
      "nti ‘‘kasmiṃ ṭhāne naṭanāṭakādinaccaṃ atthī’’ti pucchitvā yasmiṃ gāme vā nigame vā taṃ atthi, tattha gantabbaṃ hoti, tassa ‘‘sve naccadassanaṃ gamissāmī’’ti ajja vatthagandhamālādīni paṭiyādentasseva sakaladivasampi kammacchedo hoti, naccadassanena ekāhampi dvīhampi tīhampi tattheva hoti, atha vuṭṭhisampattiyādīni labhitvāpi vappādikāle vappādīni akarontassa anuppannā bhogā nuppajjanti, tassa bahi gatabhāvaṃ ñatvā anārakkhe gehe corā yaṃ icchanti, taṃ karonti, tenassa uppannāpi bhogā vinassanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kva gīta"
      },
      "ntiādīsupi eseva nayo. Tesaṃ nānākaraṇaṃ brahmajāle vuttameva."
    ],
    "innerText": "250.Kvanaccanti ‘‘kasmiṃ ṭhāne naṭanāṭakādinaccaṃ atthī’’ti pucchitvā yasmiṃ gāme vā nigame vā taṃ atthi, tattha gantabbaṃ hoti, tassa ‘‘sve naccadassanaṃ gamissāmī’’ti ajja vatthagandhamālādīni paṭiyādentasseva sakaladivasampi kammacchedo hoti, naccadassanena ekāhampi dvīhampi tīhampi tattheva hoti, atha vuṭṭhisampattiyādīni labhitvāpi vappādikāle vappādīni akarontassa anuppannā bhogā nuppajjanti, tassa bahi gatabhāvaṃ ñatvā anārakkhe gehe corā yaṃ icchanti, taṃ karonti, tenassa uppannāpi bhogā vinassanti. Kva gītantiādīsupi eseva nayo. Tesaṃ nānākaraṇaṃ brahmajāle vuttameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "251"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jayaṃ vera"
      },
      "nti ‘‘jitaṃ mayā’’ti parisamajjhe parassa sāṭakaṃ vā veṭhanaṃ vā gaṇhāti, so ‘‘parisamajjhe me avamānaṃ karosi, hotu, sikkhāpessāmi na’’nti tattha veraṃ bandhati, evaṃ jinanto sayaṃ veraṃ pasavati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jino"
      },
      "ti aññena jito samāno yaṃ tena tassa veṭhanaṃ vā sāṭako vā aññaṃ vā pana hiraññasuvaṇṇādivittaṃ gahitaṃ, taṃ anusocati ‘‘ahosi vata me, taṃ taṃ vata me natthī’’ti tappaccayā socati. Evaṃ so jino vittaṃ anusocati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabhāgatassa vacanaṃ na rūhatī"
      },
      "ti vinicchayaṭṭhāne sakkhipuṭṭhassa sato vacanaṃ na rūhati, na patiṭṭhāti, ‘‘ayaṃ akkhasoṇḍo jūtakaro, mā tassa vacanaṃ gaṇhitthā’’ti vattāro bhavanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mittāmaccānaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paribhūto hotī"
      },
      "ti tañhi mitāmaccā evaṃ vadanti – ‘‘samma, tvampi nāma kulaputto jūtakaro chinnabhinnako hutvā vicarasi, na te idaṃ jātigottānaṃ anurūpaṃ, ito paṭṭhāya mā evaṃ kareyyāsī’’ti. So evaṃ vuttopi tesaṃ vacanaṃ na karoti. Tato tena saddhiṃ ekato na tiṭṭhanti ",
      " na nisīdanti. Tassa kāraṇā sakkhipuṭṭhāpi na kathenti. Evaṃ mittāmaccānaṃ paribhūto hoti."
    ],
    "innerText": "251.Jayaṃ veranti ‘‘jitaṃ mayā’’ti parisamajjhe parassa sāṭakaṃ vā veṭhanaṃ vā gaṇhāti, so ‘‘parisamajjhe me avamānaṃ karosi, hotu, sikkhāpessāmi na’’nti tattha veraṃ bandhati, evaṃ jinanto sayaṃ veraṃ pasavati. Jinoti aññena jito samāno yaṃ tena tassa veṭhanaṃ vā sāṭako vā aññaṃ vā pana hiraññasuvaṇṇādivittaṃ gahitaṃ, taṃ anusocati ‘‘ahosi vata me, taṃ taṃ vata me natthī’’ti tappaccayā socati. Evaṃ so jino vittaṃ anusocati. Sabhāgatassa vacanaṃ na rūhatīti vinicchayaṭṭhāne sakkhipuṭṭhassa sato vacanaṃ na rūhati, na patiṭṭhāti, ‘‘ayaṃ akkhasoṇḍo jūtakaro, mā tassa vacanaṃ gaṇhitthā’’ti vattāro bhavanti. Mittāmaccānaṃparibhūto hotīti tañhi mitāmaccā evaṃ vadanti – ‘‘samma, tvampi nāma kulaputto jūtakaro chinnabhinnako hutvā vicarasi, na te idaṃ jātigottānaṃ anurūpaṃ, ito paṭṭhāya mā evaṃ kareyyāsī’’ti. So evaṃ vuttopi tesaṃ vacanaṃ na karoti. Tato tena saddhiṃ ekato na tiṭṭhanti na nisīdanti. Tassa kāraṇā sakkhipuṭṭhāpi na kathenti. Evaṃ mittāmaccānaṃ paribhūto hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvāhavivāhakāna"
      },
      "nti āvāhakā nāma ye tassa gharato dārikaṃ gahetukāmā. Vivāhakā nāma ye tassa gehe dārikaṃ dātukāmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apatthito hotī"
      },
      "ti anicchito hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nālaṃ dārabharaṇāyā"
      },
      "ti dārabharaṇāya na samattho. Etassa gehe dārikā dinnāpi etassa gehato āgatāpi amhehi eva positabbā bhavissatiyeva."
    ],
    "innerText": "Āvāhavivāhakānanti āvāhakā nāma ye tassa gharato dārikaṃ gahetukāmā. Vivāhakā nāma ye tassa gehe dārikaṃ dātukāmā. Apatthito hotīti anicchito hoti. Nālaṃ dārabharaṇāyāti dārabharaṇāya na samattho. Etassa gehe dārikā dinnāpi etassa gehato āgatāpi amhehi eva positabbā bhavissatiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pāpamittatāya chaādīnavādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "252"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhuttā"
      },
      "ti akkhadhuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Soṇḍā"
      },
      "ti itthisoṇḍā bhattasoṇḍā pūvasoṇḍā mūlakasoṇḍā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pipāsā"
      },
      "ti pānasoṇḍā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nekatikā"
      },
      "ti patirūpakena vañcanakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vañcanikā"
      },
      "ti sammukhāvañcanāhi ",
      " vañcanikā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāhasikā"
      },
      "ti ekāgārikādisāhasikakammakārino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tyāssa mittā hontī"
      },
      "ti te assa mittā honti. Aññehi sappurisehi saddhiṃ na ramati gandhamālādīhi alaṅkaritvā varasayanaṃ āropitasūkaro gūthakūpamiva, te pāpamitteyeva upasaṅkamati. Tasmā diṭṭhe ceva dhamme samparāyañca bahuṃ anatthaṃ nigacchati."
    ],
    "innerText": "252.Dhuttāti akkhadhuttā. Soṇḍāti itthisoṇḍā bhattasoṇḍā pūvasoṇḍā mūlakasoṇḍā. Pipāsāti pānasoṇḍā. Nekatikāti patirūpakena vañcanakā. Vañcanikāti sammukhāvañcanāhi vañcanikā. Sāhasikāti ekāgārikādisāhasikakammakārino. Tyāssa mittā hontīti te assa mittā honti. Aññehi sappurisehi saddhiṃ na ramati gandhamālādīhi alaṅkaritvā varasayanaṃ āropitasūkaro gūthakūpamiva, te pāpamitteyeva upasaṅkamati. Tasmā diṭṭhe ceva dhamme samparāyañca bahuṃ anatthaṃ nigacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "253"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atisītanti kammaṃ na karotī"
      },
      "ti manussehi kālasseva vuṭṭhāya ‘‘etha bho kammantaṃ gacchāmā’’ti vutto ‘‘atisītaṃ tāva, aṭṭhīni bhijjanti viya, gacchatha tumhe pacchā jānissāmī’’ti aggiṃ tapanto nisīdati. Te gantvā kammaṃ karonti. Itarassa kammaṃ parihāyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atiuṇha"
      },
      "ntiādīsupi eseva nayo."
    ],
    "innerText": "253.Atisītanti kammaṃ na karotīti manussehi kālasseva vuṭṭhāya ‘‘etha bho kammantaṃ gacchāmā’’ti vutto ‘‘atisītaṃ tāva, aṭṭhīni bhijjanti viya, gacchatha tumhe pacchā jānissāmī’’ti aggiṃ tapanto nisīdati. Te gantvā kammaṃ karonti. Itarassa kammaṃ parihāyati. Atiuṇhantiādīsupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hoti pānasakhā nāmā"
      },
      "ti ekacco pānaṭṭhāne surāgeheyeva sahāyo hoti. ‘‘Pannasakhā’’tipi pāṭho, ayamevattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammiyasammiyo"
      },
      "ti samma sammāti vadanto sammukheyeva sahāyo hoti, parammukhe verīsadiso otārameva gavesati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthesu"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jātesū"
      },
      "ti tathārūpesu kiccesu samuppannesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Verappasavo"
      },
      "ti verabahulatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anatthatā"
      },
      "ti anatthakāritā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukadariyatā"
      },
      "ti suṭṭhu kadariyatā thaddhamacchariyabhāvo ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Udakamiva iṇaṃ vigāhatī"
      },
      "ti pāsāṇo udakaṃ viya saṃsīdanto iṇaṃ vigāhati."
    ],
    "innerText": "Hoti pānasakhā nāmāti ekacco pānaṭṭhāne surāgeheyeva sahāyo hoti. ‘‘Pannasakhā’’tipi pāṭho, ayamevattho. Sammiyasammiyoti samma sammāti vadanto sammukheyeva sahāyo hoti, parammukhe verīsadiso otārameva gavesati. Atthesujātesūti tathārūpesu kiccesu samuppannesu. Verappasavoti verabahulatā. Anatthatāti anatthakāritā. Sukadariyatāti suṭṭhu kadariyatā thaddhamacchariyabhāvo . Udakamiva iṇaṃ vigāhatīti pāsāṇo udakaṃ viya saṃsīdanto iṇaṃ vigāhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rattinuṭṭhānadessinā"
      },
      "ti rattiṃ anuṭṭhānasīlena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atisāyamidaṃ ahū"
      },
      "ti idaṃ atisāyaṃ jātanti ye evaṃ vatvā kammaṃ na karonti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iti vissaṭṭhakammante"
      },
      "ti evaṃ vatvā pariccattakammante. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthā accenti māṇave"
      },
      "ti evarūpe puggale atthā atikkamanti, tesu na tiṭṭhanti."
    ],
    "innerText": "Rattinuṭṭhānadessināti rattiṃ anuṭṭhānasīlena. Atisāyamidaṃ ahūti idaṃ atisāyaṃ jātanti ye evaṃ vatvā kammaṃ na karonti. Iti vissaṭṭhakammanteti evaṃ vatvā pariccattakammante. Atthā accenti māṇaveti evarūpe puggale atthā atikkamanti, tesu na tiṭṭhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiṇā bhiyyo"
      },
      "ti tiṇatopi uttari. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So sukhaṃ na vihāyatī"
      },
      "ti so puriso sukhaṃ na jahāti, sukhasamaṅgīyeva hoti. Iminā kathāmaggena imamatthaṃ dasseti ‘‘gihibhūtena satā ettakaṃ kammaṃ na kātabbaṃ, karontassa vaḍḍhi nāma natthi. Idhaloke paraloke garahameva pāpuṇātī’’ti."
    ],
    "innerText": "Tiṇā bhiyyoti tiṇatopi uttari. So sukhaṃ na vihāyatīti so puriso sukhaṃ na jahāti, sukhasamaṅgīyeva hoti. Iminā kathāmaggena imamatthaṃ dasseti ‘‘gihibhūtena satā ettakaṃ kammaṃ na kātabbaṃ, karontassa vaḍḍhi nāma natthi. Idhaloke paraloke garahameva pāpuṇātī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Mittapatirūpakādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "254"
      },
      ". Idāni ",
      " yo evaṃ karoto anattho uppajjati, aññāni vā pana yāni kānici bhayāni yekeci upaddavā yekeci upasaggā, sabbe te bālaṃ nissāya uppajjanti. Tasmā ‘‘evarūpā bālā na sevitabbā’’ti bāle mittapatirūpake amitte dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cattārome, gahapatiputta amittā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññadatthuharo"
      },
      "ti sayaṃ tucchahattho āgantvā ekaṃsena yaṃkiñci haratiyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vacīparamo"
      },
      "ti vacanaparamo vacanamatteneva dāyako kārako viya hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuppiyabhāṇī"
      },
      "ti anuppiyaṃ bhaṇati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apāyasahāyo"
      },
      "ti bhogānaṃ apāyesu sahāyo hoti."
    ],
    "innerText": "254. Idāni yo evaṃ karoto anattho uppajjati, aññāni vā pana yāni kānici bhayāni yekeci upaddavā yekeci upasaggā, sabbe te bālaṃ nissāya uppajjanti. Tasmā ‘‘evarūpā bālā na sevitabbā’’ti bāle mittapatirūpake amitte dassetuṃ cattārome, gahapatiputta amittātiādimāha. Tattha aññadatthuharoti sayaṃ tucchahattho āgantvā ekaṃsena yaṃkiñci haratiyeva. Vacīparamoti vacanaparamo vacanamatteneva dāyako kārako viya hoti. Anuppiyabhāṇīti anuppiyaṃ bhaṇati. Apāyasahāyoti bhogānaṃ apāyesu sahāyo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "255"
      },
      ". Evaṃ cattāro amitte dassetvā puna tattha ekekaṃ catūhi kāraṇehi vibhajanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catūhi kho, gahapatiputtā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññadatthuharo hotī"
      },
      "ti ekaṃsena hārakoyeva hoti. Sahāyassa gehaṃ rittahattho āgantvā nivatthasāṭakādīnaṃ vaṇṇaṃ bhāsati, so ‘‘ativiya tvaṃ samma imassa vaṇṇaṃ bhāsasī’’ti aññaṃ nivāsetvā taṃ deti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appena bahumicchatī"
      },
      "ti yaṃkiñci appakaṃ datvā tassa santikā bahuṃ pattheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhayassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiccaṃ karotī"
      },
      "ti attano bhaye uppanne tassa dāso viya hutvā taṃ taṃ kiccaṃ karoti, ayaṃ sabbadā na karoti, bhaye ",
      " uppanne karoti, na pemenāti amitto nāma jāto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sevati atthakāraṇā"
      },
      "ti mittasanthavavasena na sevati, attano atthameva paccāsīsanto sevati."
    ],
    "innerText": "255. Evaṃ cattāro amitte dassetvā puna tattha ekekaṃ catūhi kāraṇehi vibhajanto catūhi kho, gahapatiputtātiādimāha. Tattha aññadatthuharo hotīti ekaṃsena hārakoyeva hoti. Sahāyassa gehaṃ rittahattho āgantvā nivatthasāṭakādīnaṃ vaṇṇaṃ bhāsati, so ‘‘ativiya tvaṃ samma imassa vaṇṇaṃ bhāsasī’’ti aññaṃ nivāsetvā taṃ deti. Appena bahumicchatīti yaṃkiñci appakaṃ datvā tassa santikā bahuṃ pattheti. Bhayassakiccaṃ karotīti attano bhaye uppanne tassa dāso viya hutvā taṃ taṃ kiccaṃ karoti, ayaṃ sabbadā na karoti, bhaye uppanne karoti, na pemenāti amitto nāma jāto. Sevati atthakāraṇāti mittasanthavavasena na sevati, attano atthameva paccāsīsanto sevati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "256"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atītena paṭisantharatī"
      },
      "ti sahāye āgate ‘‘hiyyo vā pare vā na āgatosi, amhākaṃ imasmiṃ vāre sassaṃ ativiya nipphannaṃ, bahūni sāliyavabījādīni ṭhapetvā maggaṃ olokentā nisīdimha, ajja pana sabbaṃ khīṇa’’nti evaṃ atītena saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāgatenā"
      },
      "ti ‘‘imasmiṃ vāre amhākaṃ sassaṃ manāpaṃ bhavissati, phalabhārabharitā sāliādayo, sassasaṅgahe kate tumhākaṃ saṅgahaṃ kātuṃ samatthā bhavissāmā’’ti evaṃ anāgatena saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niratthakenā"
      },
      "ti hatthikkhandhe vā assapiṭṭhe vā nisinno sahāyaṃ disvā ‘‘ehi, bho, idha nisīdā’’ti vadati. Manāpaṃ sāṭakaṃ nivāsetvā ‘‘sahāyakassa vata me anucchaviko añño pana mayhaṃ natthī’’ti vadati, evaṃ niratthakena saṅgaṇhāti nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccuppannesu kiccesu byasanaṃ dassetī"
      },
      "ti ‘‘sakaṭena me attho’’ti vutte ‘‘cakkamassa bhinnaṃ, akkho chinno’’tiādīni vadati."
    ],
    "innerText": "256.Atītena paṭisantharatīti sahāye āgate ‘‘hiyyo vā pare vā na āgatosi, amhākaṃ imasmiṃ vāre sassaṃ ativiya nipphannaṃ, bahūni sāliyavabījādīni ṭhapetvā maggaṃ olokentā nisīdimha, ajja pana sabbaṃ khīṇa’’nti evaṃ atītena saṅgaṇhāti. Anāgatenāti ‘‘imasmiṃ vāre amhākaṃ sassaṃ manāpaṃ bhavissati, phalabhārabharitā sāliādayo, sassasaṅgahe kate tumhākaṃ saṅgahaṃ kātuṃ samatthā bhavissāmā’’ti evaṃ anāgatena saṅgaṇhāti. Niratthakenāti hatthikkhandhe vā assapiṭṭhe vā nisinno sahāyaṃ disvā ‘‘ehi, bho, idha nisīdā’’ti vadati. Manāpaṃ sāṭakaṃ nivāsetvā ‘‘sahāyakassa vata me anucchaviko añño pana mayhaṃ natthī’’ti vadati, evaṃ niratthakena saṅgaṇhāti nāma. Paccuppannesu kiccesu byasanaṃ dassetīti ‘‘sakaṭena me attho’’ti vutte ‘‘cakkamassa bhinnaṃ, akkho chinno’’tiādīni vadati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "257"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpakampissa anujānātī"
      },
      "ti pāṇātipātādīsu yaṃkiñci karomāti vutte ‘‘sādhu samma ",
      " karomā’’ti anujānāti. Kalyāṇepi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahāyo hotī"
      },
      "ti ‘‘asukaṭṭhāne suraṃ pivanti, ehi tattha gacchāmā’’ti vutte sādhūti gacchati. Esa nayo sabbattha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iti viññāyā"
      },
      "ti ‘‘mittapatirūpakā ete’’ti evaṃ jānitvā."
    ],
    "innerText": "257.Pāpakampissa anujānātīti pāṇātipātādīsu yaṃkiñci karomāti vutte ‘‘sādhu samma karomā’’ti anujānāti. Kalyāṇepi eseva nayo. Sahāyo hotīti ‘‘asukaṭṭhāne suraṃ pivanti, ehi tattha gacchāmā’’ti vutte sādhūti gacchati. Esa nayo sabbattha. Iti viññāyāti ‘‘mittapatirūpakā ete’’ti evaṃ jānitvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Suhadamittādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "260"
      },
      ". Evaṃ na sevitabbe pāpamitte dassetvā idāni sevitabbe kalyāṇamitte dassento puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cattārome, gahapatiputtā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suhadā"
      },
      "ti sundarahadayā."
    ],
    "innerText": "260. Evaṃ na sevitabbe pāpamitte dassetvā idāni sevitabbe kalyāṇamitte dassento puna cattārome, gahapatiputtātiādimāha. Tattha suhadāti sundarahadayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "261"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pamattaṃ rakkhatī"
      },
      "ti majjaṃ pivitvā gāmamajjhe vā gāmadvāre vā magge vā nipannaṃ disvā ‘‘evaṃnipannassa kocideva nivāsanapārupanampi hareyyā’’ti samīpe nisīditvā pabuddhakāle gahetvā gacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pamattassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāpateyya"
      },
      "nti sahāyo ",
      " bahigato vā hoti suraṃ pivitvā vā pamatto, gehaṃ anārakkhaṃ ‘‘kocideva yaṃkiñci hareyyā’’ti gehaṃ pavisitvā tassa dhanaṃ rakkhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhītassā"
      },
      "ti kismiñcideva bhaye uppanne ‘‘mā bhāyi, mādise sahāye ṭhite kiṃ bhāyasī’’ti taṃ bhayaṃ haranto paṭisaraṇaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taddiguṇaṃ bhoga"
      },
      "nti kiccakaraṇīye uppanne sahāyaṃ attano santikaṃ āgataṃ disvā vadati ‘‘kasmā āgatosī’’ti? Rājakule kammaṃ atthīti. Kiṃ laddhuṃ vaṭṭatīti? Eko kahāpaṇoti. ‘‘Nagare kammaṃ nāma na ekakahāpaṇena nipphajjati, dve gaṇhāhī’’ti evaṃ yattakaṃ vadati, tato diguṇaṃ deti."
    ],
    "innerText": "261.Pamattaṃ rakkhatīti majjaṃ pivitvā gāmamajjhe vā gāmadvāre vā magge vā nipannaṃ disvā ‘‘evaṃnipannassa kocideva nivāsanapārupanampi hareyyā’’ti samīpe nisīditvā pabuddhakāle gahetvā gacchati. Pamattassasāpateyyanti sahāyo bahigato vā hoti suraṃ pivitvā vā pamatto, gehaṃ anārakkhaṃ ‘‘kocideva yaṃkiñci hareyyā’’ti gehaṃ pavisitvā tassa dhanaṃ rakkhati. Bhītassāti kismiñcideva bhaye uppanne ‘‘mā bhāyi, mādise sahāye ṭhite kiṃ bhāyasī’’ti taṃ bhayaṃ haranto paṭisaraṇaṃ hoti. Taddiguṇaṃ bhoganti kiccakaraṇīye uppanne sahāyaṃ attano santikaṃ āgataṃ disvā vadati ‘‘kasmā āgatosī’’ti? Rājakule kammaṃ atthīti. Kiṃ laddhuṃ vaṭṭatīti? Eko kahāpaṇoti. ‘‘Nagare kammaṃ nāma na ekakahāpaṇena nipphajjati, dve gaṇhāhī’’ti evaṃ yattakaṃ vadati, tato diguṇaṃ deti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "262"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Guyhamassa ācikkhatī"
      },
      "ti attano guyhaṃ nigūhituṃ yuttakathaṃ aññassa akathetvā tasseva ācikkhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Guyhamassa parigūhatī"
      },
      "ti tena kathitaṃ guyhaṃ yathā añño na jānāti, evaṃ rakkhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āpadāsu na vijahatī"
      },
      "ti uppanne bhaye na pariccajati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jīvitampissa atthāyā"
      },
      "ti attano jīvitampi tassa sahāyassa atthāya pariccattameva hoti, attano jīvitaṃ agaṇetvāpi tassa kammaṃ karotiyeva."
    ],
    "innerText": "262.Guyhamassa ācikkhatīti attano guyhaṃ nigūhituṃ yuttakathaṃ aññassa akathetvā tasseva ācikkhati. Guyhamassa parigūhatīti tena kathitaṃ guyhaṃ yathā añño na jānāti, evaṃ rakkhati. Āpadāsu na vijahatīti uppanne bhaye na pariccajati. Jīvitampissa atthāyāti attano jīvitampi tassa sahāyassa atthāya pariccattameva hoti, attano jīvitaṃ agaṇetvāpi tassa kammaṃ karotiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "263"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpā nivāretī"
      },
      "ti amhesu passantesu passantesu tvaṃ evaṃ kātuṃ na labhasi, pañca verāni dasa akusalakammapathe mā karohīti nivāreti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kalyāṇe nivesetī"
      },
      "ti kalyāṇakamme tīsu saraṇesu pañcasīlesu dasakusalakammapathesu vattassu, dānaṃ dehi puññaṃ karohi dhammaṃ suṇāhīti evaṃ kalyāṇe niyojeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assutaṃ sāvetī"
      },
      "ti assutapubbaṃ sukhumaṃ nipuṇaṃ ",
      " kāraṇaṃ sāveti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saggassa magga"
      },
      "nti idaṃ kammaṃ katvā sagge nibbattantīti evaṃ saggassa maggaṃ ācikkhati."
    ],
    "innerText": "263.Pāpā nivāretīti amhesu passantesu passantesu tvaṃ evaṃ kātuṃ na labhasi, pañca verāni dasa akusalakammapathe mā karohīti nivāreti. Kalyāṇe nivesetīti kalyāṇakamme tīsu saraṇesu pañcasīlesu dasakusalakammapathesu vattassu, dānaṃ dehi puññaṃ karohi dhammaṃ suṇāhīti evaṃ kalyāṇe niyojeti. Assutaṃ sāvetīti assutapubbaṃ sukhumaṃ nipuṇaṃ kāraṇaṃ sāveti. Saggassa magganti idaṃ kammaṃ katvā sagge nibbattantīti evaṃ saggassa maggaṃ ācikkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "264"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhavenassa na nandatī"
      },
      "ti tassa abhavena avuḍḍhiyā puttadārassa vā parijanassa vā tathārūpaṃ pārijuññaṃ disvā vā sutvā vā na nandati, anattamano hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavenā"
      },
      "ti vuḍḍhiyā tathārūpassa sampattiṃ vā ",
      " issariyappaṭilābhaṃ vā disvā vā sutvā vā nandati, attamano hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avaṇṇaṃ bhaṇamānaṃ nivāretī"
      },
      "ti ‘‘asuko virūpo na pāsādiko dujjātiko dussīlo’’ti vā vutte ‘‘evaṃ mā bhaṇi, rūpavā ca so pāsādiko ",
      " ca sujāto ca sīlasampanno cā’’tiādīhi vacanehi paraṃ attano sahāyassa avaṇṇaṃ bhaṇamānaṃ nivāreti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaṇṇaṃ bhaṇamānaṃ pasaṃsatī"
      },
      "ti ‘‘asuko rūpavā pāsādiko sujāto sīlasampanno’’ti vutte ‘‘aho suṭṭhu vadasi, subhāsitaṃ tayā, evametaṃ, esa puriso rūpavā pāsādiko sujāto sīlasampanno’’ti evaṃ attano sahāyakassa paraṃ vaṇṇaṃ bhaṇamānaṃ pasaṃsati."
    ],
    "innerText": "264.Abhavenassa na nandatīti tassa abhavena avuḍḍhiyā puttadārassa vā parijanassa vā tathārūpaṃ pārijuññaṃ disvā vā sutvā vā na nandati, anattamano hoti. Bhavenāti vuḍḍhiyā tathārūpassa sampattiṃ vā issariyappaṭilābhaṃ vā disvā vā sutvā vā nandati, attamano hoti. Avaṇṇaṃ bhaṇamānaṃ nivāretīti ‘‘asuko virūpo na pāsādiko dujjātiko dussīlo’’ti vā vutte ‘‘evaṃ mā bhaṇi, rūpavā ca so pāsādiko ca sujāto ca sīlasampanno cā’’tiādīhi vacanehi paraṃ attano sahāyassa avaṇṇaṃ bhaṇamānaṃ nivāreti. Vaṇṇaṃ bhaṇamānaṃ pasaṃsatīti ‘‘asuko rūpavā pāsādiko sujāto sīlasampanno’’ti vutte ‘‘aho suṭṭhu vadasi, subhāsitaṃ tayā, evametaṃ, esa puriso rūpavā pāsādiko sujāto sīlasampanno’’ti evaṃ attano sahāyakassa paraṃ vaṇṇaṃ bhaṇamānaṃ pasaṃsati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "265"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jalaṃ aggīva bhāsatī"
      },
      "ti rattiṃ pabbatamatthake jalamāno aggi viya virocati."
    ],
    "innerText": "265.Jalaṃ aggīva bhāsatīti rattiṃ pabbatamatthake jalamāno aggi viya virocati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhoge saṃharamānassā"
      },
      "ti attānampi parampi apīḷetvā dhammena samena bhoge sampiṇḍentassa rāsiṃ karontassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhamarasseva irīyato"
      },
      "ti yathā bhamaro pupphānaṃ vaṇṇagandhaṃ apothayaṃ tuṇḍenapi pakkhehipi rasaṃ āharitvā anupubbena cakkappamāṇaṃ madhupaṭalaṃ karoti, evaṃ anupubbena mahantaṃ bhogarāsiṃ karontassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhogā sannicayaṃ yantī"
      },
      "ti tassa bhogā nicayaṃ gacchanti. Kathaṃ? Anupubbena upacikāhi saṃvaḍḍhiyamāno vammiko viya. Tenāha ‘‘vammikovupacīyatī’’ti. Yathā vammiko upaciyati, evaṃ nicayaṃ yantīti attho."
    ],
    "innerText": "Bhoge saṃharamānassāti attānampi parampi apīḷetvā dhammena samena bhoge sampiṇḍentassa rāsiṃ karontassa. Bhamarasseva irīyatoti yathā bhamaro pupphānaṃ vaṇṇagandhaṃ apothayaṃ tuṇḍenapi pakkhehipi rasaṃ āharitvā anupubbena cakkappamāṇaṃ madhupaṭalaṃ karoti, evaṃ anupubbena mahantaṃ bhogarāsiṃ karontassa. Bhogā sannicayaṃ yantīti tassa bhogā nicayaṃ gacchanti. Kathaṃ? Anupubbena upacikāhi saṃvaḍḍhiyamāno vammiko viya. Tenāha ‘‘vammikovupacīyatī’’ti. Yathā vammiko upaciyati, evaṃ nicayaṃ yantīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samāhatvā"
      },
      "ti samāharitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alamattho"
      },
      "ti yuttasabhāvo samattho vā pariyattarūpo gharāvāsaṃ saṇṭhāpetuṃ."
    ],
    "innerText": "Samāhatvāti samāharitvā. Alamatthoti yuttasabhāvo samattho vā pariyattarūpo gharāvāsaṃ saṇṭhāpetuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni yathā vā gharāvāso saṇṭhapetabbo, tathā ovadanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catudhā vibhaje bhoge"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sa ve mittāni ganthatī"
      },
      "ti so evaṃ vibhajanto mittāni ganthati nāma abhejjamānāni ṭhapeti. Yassa hi bhogā santi, so eva mitte ṭhapetuṃ sakkoti, na itaro."
    ],
    "innerText": "Idāni yathā vā gharāvāso saṇṭhapetabbo, tathā ovadanto catudhā vibhaje bhogetiādimāha. Tattha sa ve mittāni ganthatīti so evaṃ vibhajanto mittāni ganthati nāma abhejjamānāni ṭhapeti. Yassa hi bhogā santi, so eva mitte ṭhapetuṃ sakkoti, na itaro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekena"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhoge bhuñjeyyā"
      },
      "ti ekena koṭṭhāsena bhoge bhuñjeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvīhi kammaṃ payojaye"
      },
      "ti dvīhi koṭṭhāsehi kasivāṇijjādikammaṃ payojeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catutthañca nidhāpeyyā"
      },
      "ti catutthaṃ koṭṭhāsaṃ nidhāpetvā ṭhapeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āpadāsu bhavissatī"
      },
      "ti kulānañhi na sabbakālaṃ ekasadisaṃ vattati, kadāci rājādivasena āpadāpi uppajjanti, tasmā ",
      " evaṃ āpadāsu uppannāsu bhavissatīti ‘‘ekaṃ koṭṭhāsaṃ nidhāpeyyā’’ti āha ",
      ". Imesu pana catūsu koṭṭhāsesu katarakoṭṭhāsaṃ gahetvā kusalaṃ kātabbanti? ‘‘Bhoge bhuñjeyyā’’ti vuttakoṭṭhāsaṃ. Tato gaṇhitvā bhikkhūnampi kapaṇaddhikādīnampi dātabbaṃ, pesakāranhāpitādīnampi vetanaṃ dātabbaṃ."
    ],
    "innerText": "Ekenabhoge bhuñjeyyāti ekena koṭṭhāsena bhoge bhuñjeyya. Dvīhi kammaṃ payojayeti dvīhi koṭṭhāsehi kasivāṇijjādikammaṃ payojeyya. Catutthañca nidhāpeyyāti catutthaṃ koṭṭhāsaṃ nidhāpetvā ṭhapeyya. Āpadāsu bhavissatīti kulānañhi na sabbakālaṃ ekasadisaṃ vattati, kadāci rājādivasena āpadāpi uppajjanti, tasmā evaṃ āpadāsu uppannāsu bhavissatīti ‘‘ekaṃ koṭṭhāsaṃ nidhāpeyyā’’ti āha . Imesu pana catūsu koṭṭhāsesu katarakoṭṭhāsaṃ gahetvā kusalaṃ kātabbanti? ‘‘Bhoge bhuñjeyyā’’ti vuttakoṭṭhāsaṃ. Tato gaṇhitvā bhikkhūnampi kapaṇaddhikādīnampi dātabbaṃ, pesakāranhāpitādīnampi vetanaṃ dātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Chaddisāpaṭicchādanakaṇḍavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "266"
      },
      ". Iti bhagavā ettakena kathāmaggena evaṃ gahapatiputtassa ariyasāvako catūhi kāraṇehi akusalaṃ pahāya chahi kāraṇehi bhogānaṃ apāyamukhaṃ vajjetvā soḷasa mittāni sevanto gharāvāsaṃ saṇṭhapetvā dārabharaṇaṃ karonto dhammikena ājīvena jīvati, devamanussānañca antare aggikkhandho viya virocatīti vajjanīyadhammavajjanatthaṃ sevitabbadhammasevanatthañca ovādaṃ datvā idāni namassitabbā cha disā dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kathañca gahapatiputtā"
      },
      "tiādimāha."
    ],
    "innerText": "266. Iti bhagavā ettakena kathāmaggena evaṃ gahapatiputtassa ariyasāvako catūhi kāraṇehi akusalaṃ pahāya chahi kāraṇehi bhogānaṃ apāyamukhaṃ vajjetvā soḷasa mittāni sevanto gharāvāsaṃ saṇṭhapetvā dārabharaṇaṃ karonto dhammikena ājīvena jīvati, devamanussānañca antare aggikkhandho viya virocatīti vajjanīyadhammavajjanatthaṃ sevitabbadhammasevanatthañca ovādaṃ datvā idāni namassitabbā cha disā dassento kathañca gahapatiputtātiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chaddisāpaṭicchādī"
      },
      "ti yathā chahi disāhi āgamanabhayaṃ na āgacchati, khemaṃ hoti nibbhayaṃ evaṃ viharanto ‘‘chaddisāpaṭicchādī’’ti vuccati. ‘‘Puratthimā disā mātāpitaro veditabbā’’tiādīsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mātāpitaro"
      },
      " pubbupakāritāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puratthimā disā"
      },
      "ti veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ācariyā"
      },
      " dakkhiṇeyyatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dakkhiṇā disā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puttadārā"
      },
      " piṭṭhito anubandhanavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pacchimā disā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mittāmaccā"
      },
      " yasmā so mittāmacce nissāya te te dukkhavisese uttarati, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uttarā disā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dāsakammakarā"
      },
      " pādamūle patiṭṭhānavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "heṭṭhimā disā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaṇabrāhmaṇā"
      },
      " guṇehi upari ṭhitabhāvena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uparimā disā"
      },
      "ti veditabbā."
    ],
    "innerText": "Tattha chaddisāpaṭicchādīti yathā chahi disāhi āgamanabhayaṃ na āgacchati, khemaṃ hoti nibbhayaṃ evaṃ viharanto ‘‘chaddisāpaṭicchādī’’ti vuccati. ‘‘Puratthimā disā mātāpitaro veditabbā’’tiādīsu mātāpitaro pubbupakāritāya puratthimā disāti veditabbā. Ācariyā dakkhiṇeyyatāya dakkhiṇā disāti. Puttadārā piṭṭhito anubandhanavasena pacchimā disāti. Mittāmaccā yasmā so mittāmacce nissāya te te dukkhavisese uttarati, tasmā uttarā disāti. Dāsakammakarā pādamūle patiṭṭhānavasena heṭṭhimā disāti. Samaṇabrāhmaṇā guṇehi upari ṭhitabhāvena uparimā disāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "267"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhato ne bharissāmī"
      },
      "ti ahaṃ mātāpitūhi thaññaṃ pāyetvā hatthapāde vaḍḍhetvā mukhena siṅghāṇikaṃ apanetvā nahāpetvā maṇḍetvā bhato bharito jaggito, svāhaṃ ajja te mahallake pādadhovananhāpanayāgubhattadānādīhi bharissāmi."
    ],
    "innerText": "267.Bhato ne bharissāmīti ahaṃ mātāpitūhi thaññaṃ pāyetvā hatthapāde vaḍḍhetvā mukhena siṅghāṇikaṃ apanetvā nahāpetvā maṇḍetvā bhato bharito jaggito, svāhaṃ ajja te mahallake pādadhovananhāpanayāgubhattadānādīhi bharissāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiccaṃ nesaṃ karissāmī"
      },
      "ti attano kammaṃ ṭhapetvā mātāpitūnaṃ rājakulādīsu uppannaṃ kiccaṃ ",
      " gantvā karissāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kulavaṃsaṃ saṇṭhapessāmī"
      },
      "ti mātāpitūnaṃ santakaṃ khettavatthuhiraññasuvaṇṇādiṃ avināsetvā rakkhantopi ",
      " kulavaṃsaṃ saṇṭhapeti nāma. Mātāpitaro adhammikavaṃsato hāretvā ",
      " dhammikavaṃse ṭhapentopi, kulavaṃsena āgatāni salākabhattādīni anupacchinditvā pavattentopi kulavaṃsaṃ saṇṭhapeti nāma. Idaṃ sandhāya vuttaṃ – ‘‘kulavaṃsaṃ saṇṭhapessāmī’’ti."
    ],
    "innerText": "Kiccaṃ nesaṃ karissāmīti attano kammaṃ ṭhapetvā mātāpitūnaṃ rājakulādīsu uppannaṃ kiccaṃ gantvā karissāmi. Kulavaṃsaṃ saṇṭhapessāmīti mātāpitūnaṃ santakaṃ khettavatthuhiraññasuvaṇṇādiṃ avināsetvā rakkhantopi kulavaṃsaṃ saṇṭhapeti nāma. Mātāpitaro adhammikavaṃsato hāretvā dhammikavaṃse ṭhapentopi, kulavaṃsena āgatāni salākabhattādīni anupacchinditvā pavattentopi kulavaṃsaṃ saṇṭhapeti nāma. Idaṃ sandhāya vuttaṃ – ‘‘kulavaṃsaṃ saṇṭhapessāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dāyajjaṃ paṭipajjāmī"
      },
      "ti mātāpitaro attano ovāde avattamāne micchāpaṭipanne dārake vinicchayaṃ patvā aputte karonti, te dāyajjārahā na honti. Ovāde vattamāne pana kulasantakassa sāmike karonti, ahaṃ evaṃ vattissāmīti adhippāyena ‘‘dāyajjaṃ paṭipajjāmī’’ti vuttaṃ."
    ],
    "innerText": "Dāyajjaṃ paṭipajjāmīti mātāpitaro attano ovāde avattamāne micchāpaṭipanne dārake vinicchayaṃ patvā aputte karonti, te dāyajjārahā na honti. Ovāde vattamāne pana kulasantakassa sāmike karonti, ahaṃ evaṃ vattissāmīti adhippāyena ‘‘dāyajjaṃ paṭipajjāmī’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dakkhiṇaṃ anuppadassāmī"
      },
      "ti tesaṃ pattidānaṃ katvā tatiyadivasato paṭṭhāya dānaṃ anuppadassāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpā nivārentī"
      },
      "ti pāṇātipātādīnaṃ diṭṭhadhammikasamparāyikaṃ ādīnavaṃ vatvā, ‘‘tāta, mā evarūpaṃ karī’’ti nivārenti, katampi garahanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kalyāṇe nivesentī"
      },
      "ti anāthapiṇḍiko viya lañjaṃ datvāpi sīlasamādānādīsu nivesenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sippaṃ sikkhāpentī"
      },
      "ti attano ovāde ṭhitabhāvaṃ ñatvā vaṃsānugataṃ muddāgaṇanādisippaṃ sikkhāpenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patirūpenā"
      },
      "ti kulasīlarūpādīhi anurūpena."
    ],
    "innerText": "Dakkhiṇaṃ anuppadassāmīti tesaṃ pattidānaṃ katvā tatiyadivasato paṭṭhāya dānaṃ anuppadassāmi. Pāpā nivārentīti pāṇātipātādīnaṃ diṭṭhadhammikasamparāyikaṃ ādīnavaṃ vatvā, ‘‘tāta, mā evarūpaṃ karī’’ti nivārenti, katampi garahanti. Kalyāṇe nivesentīti anāthapiṇḍiko viya lañjaṃ datvāpi sīlasamādānādīsu nivesenti. Sippaṃ sikkhāpentīti attano ovāde ṭhitabhāvaṃ ñatvā vaṃsānugataṃ muddāgaṇanādisippaṃ sikkhāpenti. Patirūpenāti kulasīlarūpādīhi anurūpena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaye dāyajjaṃ niyyādentī"
      },
      "ti samaye dhanaṃ denti. Tattha niccasamayo kālasamayoti dve samayā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niccasamaye"
      },
      " denti nāma ‘‘uṭṭhāya samuṭṭhāya imaṃ gaṇhitabbaṃ gaṇha, ayaṃ te paribbayo hotu, iminā kusalaṃ karohī’’ti denti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kālasamaye"
      },
      " denti nāma sikhāṭhapanaāvāhavivāhādisamaye denti. Apica pacchime kāle maraṇamañce nipannassa ‘‘iminā kusalaṃ karohī’’ti dentāpi samaye denti nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭicchannā hotī"
      },
      "ti yaṃ puratthimadisato bhayaṃ āgaccheyya, yathā taṃ nāgacchati, evaṃ pihitā hoti. Sace hi puttā vippaṭipannā, assu, mātāpitaro daharakālato paṭṭhāya jagganādīhi sammā paṭipannā, ete dārakā, mātāpitūnaṃ appatirūpāti etaṃ bhayaṃ āgaccheyya. Puttā sammā paṭipannā, mātāpitaro vippaṭipannā, mātāpitaro puttānaṃ nānurūpāti etaṃ bhayaṃ āgaccheyya. Ubhosu vippaṭipannesu duvidhampi taṃ bhayaṃ hoti. Sammā ",
      " paṭipannesu sabbaṃ na hoti. Tena vuttaṃ – ‘‘paṭicchannā hoti khemā appaṭibhayā’’ti."
    ],
    "innerText": "Samaye dāyajjaṃ niyyādentīti samaye dhanaṃ denti. Tattha niccasamayo kālasamayoti dve samayā. Niccasamaye denti nāma ‘‘uṭṭhāya samuṭṭhāya imaṃ gaṇhitabbaṃ gaṇha, ayaṃ te paribbayo hotu, iminā kusalaṃ karohī’’ti denti. Kālasamaye denti nāma sikhāṭhapanaāvāhavivāhādisamaye denti. Apica pacchime kāle maraṇamañce nipannassa ‘‘iminā kusalaṃ karohī’’ti dentāpi samaye denti nāma. Paṭicchannā hotīti yaṃ puratthimadisato bhayaṃ āgaccheyya, yathā taṃ nāgacchati, evaṃ pihitā hoti. Sace hi puttā vippaṭipannā, assu, mātāpitaro daharakālato paṭṭhāya jagganādīhi sammā paṭipannā, ete dārakā, mātāpitūnaṃ appatirūpāti etaṃ bhayaṃ āgaccheyya. Puttā sammā paṭipannā, mātāpitaro vippaṭipannā, mātāpitaro puttānaṃ nānurūpāti etaṃ bhayaṃ āgaccheyya. Ubhosu vippaṭipannesu duvidhampi taṃ bhayaṃ hoti. Sammā paṭipannesu sabbaṃ na hoti. Tena vuttaṃ – ‘‘paṭicchannā hoti khemā appaṭibhayā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evañca ",
      " pana vatvā bhagavā siṅgālakaṃ etadavoca – ‘‘na kho te, gahapatiputta, pitā lokasammataṃ puratthimaṃ disaṃ namassāpeti. Mātāpitaro pana ",
      " puratthimadisāsadise katvā namassāpeti. Ayañhi te pitarā puratthimā disā akkhātā, no aññā’’ti."
    ],
    "innerText": "Evañca pana vatvā bhagavā siṅgālakaṃ etadavoca – ‘‘na kho te, gahapatiputta, pitā lokasammataṃ puratthimaṃ disaṃ namassāpeti. Mātāpitaro pana puratthimadisāsadise katvā namassāpeti. Ayañhi te pitarā puratthimā disā akkhātā, no aññā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "268"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uṭṭhānenā"
      },
      "ti āsanā uṭṭhānena. Antevāsikena hi ācariyaṃ dūratova āgacchantaṃ disvā āsanā vuṭṭhāya paccuggamanaṃ katvā hatthato bhaṇḍakaṃ gahetvā āsanaṃ paññapetvā nisīdāpetvā bījanapādadhovanapādamakkhanāni kātabbāni. Taṃ sandhāya vuttaṃ ‘‘uṭṭhānenā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upaṭṭhānenā"
      },
      "ti divasassa tikkhattuṃ upaṭṭhānagamanena. Sippuggahaṇakāle pana avassakameva gantabbaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sussūsāyā"
      },
      "ti saddahitvā savanena. Asaddahitvā suṇanto hi visesaṃ nādhigacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāricariyāyā"
      },
      "ti avasesakhuddakapāricariyāya. Antevāsikena hi ācariyassa pātova vuṭṭhāya mukhodakadantakaṭṭhaṃ datvā bhattakiccakālepi pānīyaṃ gahetvā paccupaṭṭhānādīni katvā vanditvā gantabbaṃ. Kiliṭṭhavatthādīni dhovitabbāni, sāyaṃ nahānodakaṃ paccupaṭṭhapetabbaṃ. Aphāsukāle upaṭṭhātabbaṃ. Pabbajitenapi sabbaṃ antevāsikavattaṃ kātabbaṃ. Idaṃ sandhāya vuttaṃ – ‘‘pāricariyāyā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakkaccaṃ sippapaṭiggahaṇenā"
      },
      "ti sakkaccaṃ paṭiggahaṇaṃ nāma thokaṃ gahetvā bahuvāre sajjhāyakaraṇaṃ, ekapadampi visuddhameva gahetabbaṃ."
    ],
    "innerText": "268.Uṭṭhānenāti āsanā uṭṭhānena. Antevāsikena hi ācariyaṃ dūratova āgacchantaṃ disvā āsanā vuṭṭhāya paccuggamanaṃ katvā hatthato bhaṇḍakaṃ gahetvā āsanaṃ paññapetvā nisīdāpetvā bījanapādadhovanapādamakkhanāni kātabbāni. Taṃ sandhāya vuttaṃ ‘‘uṭṭhānenā’’ti. Upaṭṭhānenāti divasassa tikkhattuṃ upaṭṭhānagamanena. Sippuggahaṇakāle pana avassakameva gantabbaṃ hoti. Sussūsāyāti saddahitvā savanena. Asaddahitvā suṇanto hi visesaṃ nādhigacchati. Pāricariyāyāti avasesakhuddakapāricariyāya. Antevāsikena hi ācariyassa pātova vuṭṭhāya mukhodakadantakaṭṭhaṃ datvā bhattakiccakālepi pānīyaṃ gahetvā paccupaṭṭhānādīni katvā vanditvā gantabbaṃ. Kiliṭṭhavatthādīni dhovitabbāni, sāyaṃ nahānodakaṃ paccupaṭṭhapetabbaṃ. Aphāsukāle upaṭṭhātabbaṃ. Pabbajitenapi sabbaṃ antevāsikavattaṃ kātabbaṃ. Idaṃ sandhāya vuttaṃ – ‘‘pāricariyāyā’’ti. Sakkaccaṃ sippapaṭiggahaṇenāti sakkaccaṃ paṭiggahaṇaṃ nāma thokaṃ gahetvā bahuvāre sajjhāyakaraṇaṃ, ekapadampi visuddhameva gahetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvinītaṃ vinentī"
      },
      "ti ‘‘evaṃ te nisīditabbaṃ, evaṃ ṭhātabbaṃ, evaṃ khāditabbaṃ, evaṃ bhuñjitabbaṃ, pāpamittā vajjetabbā, kalyāṇamittā sevitabbā’’ti evaṃ ācāraṃ sikkhāpenti vinenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suggahitaṃ gāhāpentī"
      },
      "ti yathā suggahitaṃ gaṇhāti, evaṃ atthañca byañjanañca sodhetvā payogaṃ dassetvā gaṇhāpenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mittāmaccesu paṭiyādentī"
      },
      "ti ‘‘ayaṃ amhākaṃ antevāsiko byatto bahussuto mayā samasamo, etaṃ sallakkheyyāthā’’ti evaṃ guṇaṃ kathetvā mittāmaccesu patiṭṭhapenti."
    ],
    "innerText": "Suvinītaṃ vinentīti ‘‘evaṃ te nisīditabbaṃ, evaṃ ṭhātabbaṃ, evaṃ khāditabbaṃ, evaṃ bhuñjitabbaṃ, pāpamittā vajjetabbā, kalyāṇamittā sevitabbā’’ti evaṃ ācāraṃ sikkhāpenti vinenti. Suggahitaṃ gāhāpentīti yathā suggahitaṃ gaṇhāti, evaṃ atthañca byañjanañca sodhetvā payogaṃ dassetvā gaṇhāpenti. Mittāmaccesu paṭiyādentīti ‘‘ayaṃ amhākaṃ antevāsiko byatto bahussuto mayā samasamo, etaṃ sallakkheyyāthā’’ti evaṃ guṇaṃ kathetvā mittāmaccesu patiṭṭhapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Disāsu parittāṇaṃ karontī"
      },
      "ti sippasikkhāpanenevassa sabbadisāsu ",
      " rakkhaṃ karonti. Uggahitasippo hi yaṃ yaṃ disaṃ gantvā sippaṃ dasseti, tattha tatthassa lābhasakkāro uppajjati. So ācariyena kato nāma hoti, guṇaṃ kathentopissa mahājano ācariyapāde dhovitvā vasitaantevāsiko ",
      " vata ayanti paṭhamaṃ ācariyasseva guṇaṃ kathenti, brahmalokappamāṇopissa lābho uppajjamāno ācariyasantakova hoti. Apica yaṃ vijjaṃ parijappitvā gacchantaṃ aṭaviyaṃ corā na passanti, amanussā vā dīghajātiādayo vā na viheṭhenti, taṃ sikkhāpentāpi disāsu parittāṇaṃ karonti. Yaṃ vā so disaṃ gato hoti, tato ",
      " kaṅkhaṃ uppādetvā attano santikaṃ āgatamanusse ‘‘etissaṃ disāyaṃ amhākaṃ antevāsiko vasati, tassa ca mayhañca imasmiṃ sippe nānākaraṇaṃ natthi, gacchatha tameva pucchathā’’ti evaṃ antevāsikaṃ paggaṇhantāpi tassa tattha lābhasakkāruppattiyā parittāṇaṃ karonti nāma, patiṭṭhaṃ karontīti attho. Sesamettha purimanayeneva yojetabbaṃ."
    ],
    "innerText": "Disāsu parittāṇaṃ karontīti sippasikkhāpanenevassa sabbadisāsu rakkhaṃ karonti. Uggahitasippo hi yaṃ yaṃ disaṃ gantvā sippaṃ dasseti, tattha tatthassa lābhasakkāro uppajjati. So ācariyena kato nāma hoti, guṇaṃ kathentopissa mahājano ācariyapāde dhovitvā vasitaantevāsiko vata ayanti paṭhamaṃ ācariyasseva guṇaṃ kathenti, brahmalokappamāṇopissa lābho uppajjamāno ācariyasantakova hoti. Apica yaṃ vijjaṃ parijappitvā gacchantaṃ aṭaviyaṃ corā na passanti, amanussā vā dīghajātiādayo vā na viheṭhenti, taṃ sikkhāpentāpi disāsu parittāṇaṃ karonti. Yaṃ vā so disaṃ gato hoti, tato kaṅkhaṃ uppādetvā attano santikaṃ āgatamanusse ‘‘etissaṃ disāyaṃ amhākaṃ antevāsiko vasati, tassa ca mayhañca imasmiṃ sippe nānākaraṇaṃ natthi, gacchatha tameva pucchathā’’ti evaṃ antevāsikaṃ paggaṇhantāpi tassa tattha lābhasakkāruppattiyā parittāṇaṃ karonti nāma, patiṭṭhaṃ karontīti attho. Sesamettha purimanayeneva yojetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "269"
      },
      ". Tatiyadisāvāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammānanāyā"
      },
      "ti devamāte tissamāteti evaṃ sambhāvitakathākathanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anavamānanāyā"
      },
      "ti yathā dāsakammakarādayo pothetvā viheṭhetvā kathenti, evaṃ hīḷetvā vimānetvā akathanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anaticariyāyā"
      },
      "ti taṃ atikkamitvā bahi aññāya itthiyā saddhiṃ paricaranto taṃ aticarati nāma, tathā akaraṇena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Issariyavossaggenā"
      },
      "ti itthiyo hi mahālatāsadisampi ābharaṇaṃ labhitvā bhattaṃ vicāretuṃ alabhamānā kujjhanti, kaṭacchuṃ hatthe ṭhapetvā tava ruciyā karohīti bhattagehe vissaṭṭhe sabbaṃ issariyaṃ vissaṭṭhaṃ nāma hoti, evaṃ karaṇenāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alaṅkārānuppadānenā"
      },
      "ti attano vibhavānurūpena alaṅkāradānena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Susaṃvihitakammantā"
      },
      "ti yāgubhattapacanakālādīni anatikkamitvā tassa tassa sādhukaṃ karaṇena suṭṭhu saṃvihitakammantā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅgahitaparijanā"
      },
      "ti sammānanādīhi ceva paheṇakapesanādīhi ca saṅgahitaparijanā. Idha parijano nāma sāmikassa ceva attano ca ñātijano. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anaticārinī"
      },
      "ti sāmikaṃ muñcitvā aññaṃ manasāpi na pattheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sambhata"
      },
      "nti kasivāṇijjādīni katvā ābhatadhanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dakkhā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca hotī"
      },
      "ti yāgubhattasampādanādīsu chekā nipuṇā hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Analasā"
      },
      "ti nikkosajjā. Yathā aññā kusītā nisinnaṭṭhāne nisinnāva honti ṭhitaṭṭhāne ṭhitāva, evaṃ ahutvā vipphāritena cittena sabbakiccāni nipphādeti. Sesamidhāpi purimanayeneva yojetabbaṃ."
    ],
    "innerText": "269. Tatiyadisāvāre sammānanāyāti devamāte tissamāteti evaṃ sambhāvitakathākathanena. Anavamānanāyāti yathā dāsakammakarādayo pothetvā viheṭhetvā kathenti, evaṃ hīḷetvā vimānetvā akathanena. Anaticariyāyāti taṃ atikkamitvā bahi aññāya itthiyā saddhiṃ paricaranto taṃ aticarati nāma, tathā akaraṇena. Issariyavossaggenāti itthiyo hi mahālatāsadisampi ābharaṇaṃ labhitvā bhattaṃ vicāretuṃ alabhamānā kujjhanti, kaṭacchuṃ hatthe ṭhapetvā tava ruciyā karohīti bhattagehe vissaṭṭhe sabbaṃ issariyaṃ vissaṭṭhaṃ nāma hoti, evaṃ karaṇenāti attho. Alaṅkārānuppadānenāti attano vibhavānurūpena alaṅkāradānena. Susaṃvihitakammantāti yāgubhattapacanakālādīni anatikkamitvā tassa tassa sādhukaṃ karaṇena suṭṭhu saṃvihitakammantā. Saṅgahitaparijanāti sammānanādīhi ceva paheṇakapesanādīhi ca saṅgahitaparijanā. Idha parijano nāma sāmikassa ceva attano ca ñātijano. Anaticārinīti sāmikaṃ muñcitvā aññaṃ manasāpi na pattheti. Sambhatanti kasivāṇijjādīni katvā ābhatadhanaṃ. Dakkhāca hotīti yāgubhattasampādanādīsu chekā nipuṇā hoti. Analasāti nikkosajjā. Yathā aññā kusītā nisinnaṭṭhāne nisinnāva honti ṭhitaṭṭhāne ṭhitāva, evaṃ ahutvā vipphāritena cittena sabbakiccāni nipphādeti. Sesamidhāpi purimanayeneva yojetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "270"
      },
      ". Catutthadisāvāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avisaṃvādanatāyā"
      },
      "ti yassa yassa nāmaṃ gaṇhāti, taṃ taṃ avisaṃvādetvā idampi amhākaṃ gehe atthi, idampi atthi, gahetvā gacchāhīti evaṃ avisaṃvādetvā dānena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aparapajā cassa paṭipūjentī"
      },
      "ti sahāyassa puttadhītaro pajā nāma, tesaṃ pana puttadhītaro ca nattupanattakā ca aparapajā nāma. Te paṭipūjenti keḷāyanti mamāyanti maṅgalakālādīsu tesaṃ maṅgalādīni karonti. Sesamidhāpi purimanayeneva veditabbaṃ."
    ],
    "innerText": "270. Catutthadisāvāre avisaṃvādanatāyāti yassa yassa nāmaṃ gaṇhāti, taṃ taṃ avisaṃvādetvā idampi amhākaṃ gehe atthi, idampi atthi, gahetvā gacchāhīti evaṃ avisaṃvādetvā dānena. Aparapajā cassa paṭipūjentīti sahāyassa puttadhītaro pajā nāma, tesaṃ pana puttadhītaro ca nattupanattakā ca aparapajā nāma. Te paṭipūjenti keḷāyanti mamāyanti maṅgalakālādīsu tesaṃ maṅgalādīni karonti. Sesamidhāpi purimanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "271"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathābalaṃ kammantasaṃvidhānenā"
      },
      "ti daharehi kātabbaṃ mahallakehi, mahallakehi vā kātabbaṃ daharehi, itthīhi kātabbaṃ purisehi, purisehi vā kātabbaṃ itthīhi akāretvā tassa tassa balānurūpeneva kammantasaṃvidhānena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhattavetanānuppadānenā"
      },
      "ti ayaṃ khuddakaputto, ayaṃ ekavihārīti ",
      " tassa tassa anurūpaṃ sallakkhetvā bhattadānena ceva paribbayadānena ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gilānupaṭṭhānenā"
      },
      "ti aphāsukakāle kammaṃ akāretvā sappāyabhesajjādīni datvā paṭijagganena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Acchariyānaṃ rasānaṃ saṃvibhāgenā"
      },
      "ti acchariye madhurarase labhitvā sayameva akhāditvā tesampi tato saṃvibhāgakaraṇena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaye vossaggenā"
      },
      "ti niccasamaye ca kālasamaye ca vossajjanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niccasamaye"
      },
      " vossajjanaṃ nāma sakaladivasaṃ kammaṃ karontā kilamanti. Tasmā yathā na kilamanti, evaṃ velaṃ ñatvā vissajjanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kālasamaye"
      },
      " vossaggo nāma chaṇanakkhattakīḷādīsu alaṅkārabhaṇḍakhādanīyabhojanīyādīni datvā vissajjanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dinnādāyino"
      },
      "ti corikāya kiñci agahetvā sāmikehi dinnasseva ādāyino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukatakammakarā"
      },
      "ti ‘‘kiṃ etassa kammena katena, na mayaṃ ",
      " kiñci labhāmā’’ti anujjhāyitvā tuṭṭhahadayā yathā taṃ kammaṃ sukataṃ hoti, evaṃ kārakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kittivaṇṇaharā"
      },
      "ti parisamajjhe kathāya sampattāya ‘‘ko amhākaṃ sāmikehi sadiso atthi, mayaṃ attano dāsabhāvampi na jānāma, tesaṃ sāmikabhāvampi na jānāma, evaṃ no anukampantī’’ti guṇakathāhārakā. Sesamidhāpi purimanayeneva yojetabbaṃ."
    ],
    "innerText": "271.Yathābalaṃ kammantasaṃvidhānenāti daharehi kātabbaṃ mahallakehi, mahallakehi vā kātabbaṃ daharehi, itthīhi kātabbaṃ purisehi, purisehi vā kātabbaṃ itthīhi akāretvā tassa tassa balānurūpeneva kammantasaṃvidhānena. Bhattavetanānuppadānenāti ayaṃ khuddakaputto, ayaṃ ekavihārīti tassa tassa anurūpaṃ sallakkhetvā bhattadānena ceva paribbayadānena ca. Gilānupaṭṭhānenāti aphāsukakāle kammaṃ akāretvā sappāyabhesajjādīni datvā paṭijagganena. Acchariyānaṃ rasānaṃ saṃvibhāgenāti acchariye madhurarase labhitvā sayameva akhāditvā tesampi tato saṃvibhāgakaraṇena. Samaye vossaggenāti niccasamaye ca kālasamaye ca vossajjanena. Niccasamaye vossajjanaṃ nāma sakaladivasaṃ kammaṃ karontā kilamanti. Tasmā yathā na kilamanti, evaṃ velaṃ ñatvā vissajjanaṃ. Kālasamaye vossaggo nāma chaṇanakkhattakīḷādīsu alaṅkārabhaṇḍakhādanīyabhojanīyādīni datvā vissajjanaṃ. Dinnādāyinoti corikāya kiñci agahetvā sāmikehi dinnasseva ādāyino. Sukatakammakarāti ‘‘kiṃ etassa kammena katena, na mayaṃ kiñci labhāmā’’ti anujjhāyitvā tuṭṭhahadayā yathā taṃ kammaṃ sukataṃ hoti, evaṃ kārakā. Kittivaṇṇaharāti parisamajjhe kathāya sampattāya ‘‘ko amhākaṃ sāmikehi sadiso atthi, mayaṃ attano dāsabhāvampi na jānāma, tesaṃ sāmikabhāvampi na jānāma, evaṃ no anukampantī’’ti guṇakathāhārakā. Sesamidhāpi purimanayeneva yojetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "272"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mettena kāyakammenā"
      },
      "tiādīsu mettacittaṃ paccupaṭṭhapetvā katāni kāyakammādīni mettāni nāma vuccanti. Tattha bhikkhū nimantessāmīti vihāragamanaṃ ",
      ", dhamakaraṇaṃ gahetvā udakaparissāvanaṃ, piṭṭhiparikammapādaparikammādikaraṇañca mettaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyakammaṃ"
      },
      " nāma. Bhikkhū piṇḍāya paviṭṭhe disvā ‘‘sakkaccaṃ yāguṃ detha, bhattaṃ dethā’’tiādivacanañceva, sādhukāraṃ datvā dhammasavanañca sakkaccaṃ paṭisanthārakaraṇādīni ca mettaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vacīkammaṃ"
      },
      " nāma. ‘‘Amhākaṃ kulūpakattherā averā hontu abyāpajjā’’ti evaṃ cintanaṃ mettaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manokammaṃ"
      },
      " nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāvaṭadvāratāyā"
      },
      "ti apihitadvāratāya. Tattha sabbadvārāni vivaritvāpi sīlavantānaṃ adāyako akārako pihitadvāroyeva. Sabbadvārāni pana pidahitvāpi tesaṃ dāyako kārako vivaṭadvāroyeva. Iti sīlavantesu gehadvāraṃ āgatesu santaṃyeva natthīti avatvā dātabbaṃ. Evaṃ anāvaṭadvāratā nāma hoti."
    ],
    "innerText": "272.Mettena kāyakammenātiādīsu mettacittaṃ paccupaṭṭhapetvā katāni kāyakammādīni mettāni nāma vuccanti. Tattha bhikkhū nimantessāmīti vihāragamanaṃ , dhamakaraṇaṃ gahetvā udakaparissāvanaṃ, piṭṭhiparikammapādaparikammādikaraṇañca mettaṃ kāyakammaṃ nāma. Bhikkhū piṇḍāya paviṭṭhe disvā ‘‘sakkaccaṃ yāguṃ detha, bhattaṃ dethā’’tiādivacanañceva, sādhukāraṃ datvā dhammasavanañca sakkaccaṃ paṭisanthārakaraṇādīni ca mettaṃ vacīkammaṃ nāma. ‘‘Amhākaṃ kulūpakattherā averā hontu abyāpajjā’’ti evaṃ cintanaṃ mettaṃ manokammaṃ nāma. Anāvaṭadvāratāyāti apihitadvāratāya. Tattha sabbadvārāni vivaritvāpi sīlavantānaṃ adāyako akārako pihitadvāroyeva. Sabbadvārāni pana pidahitvāpi tesaṃ dāyako kārako vivaṭadvāroyeva. Iti sīlavantesu gehadvāraṃ āgatesu santaṃyeva natthīti avatvā dātabbaṃ. Evaṃ anāvaṭadvāratā nāma hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āmisānuppadānenā"
      },
      "ti purebhattaṃ paribhuñjitabbakaṃ āmisaṃ nāma, tasmā sīlavantānaṃ yāgubhattasampadānenāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kalyāṇena manasā anukampantī"
      },
      "ti ‘‘sabbe sattā sukhitā hontu averā arogā abyāpajjā’’ti evaṃ hitapharaṇena. Apica upaṭṭhākānaṃ gehaṃ aññe sīlavante sabrahmacārī gahetvā pavisantāpi kalyāṇena cetasā anukampanti nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sutaṃ pariyodāpentī"
      },
      "ti yaṃ tesaṃ pakatiyā sutaṃ atthi, tassa atthaṃ kathetvā kaṅkhaṃ vinodenti, tathattāya vā paṭipajjāpenti. Sesamidhāpi purimanayeneva yojetabbaṃ."
    ],
    "innerText": "Āmisānuppadānenāti purebhattaṃ paribhuñjitabbakaṃ āmisaṃ nāma, tasmā sīlavantānaṃ yāgubhattasampadānenāti attho. Kalyāṇena manasā anukampantīti ‘‘sabbe sattā sukhitā hontu averā arogā abyāpajjā’’ti evaṃ hitapharaṇena. Apica upaṭṭhākānaṃ gehaṃ aññe sīlavante sabrahmacārī gahetvā pavisantāpi kalyāṇena cetasā anukampanti nāma. Sutaṃ pariyodāpentīti yaṃ tesaṃ pakatiyā sutaṃ atthi, tassa atthaṃ kathetvā kaṅkhaṃ vinodenti, tathattāya vā paṭipajjāpenti. Sesamidhāpi purimanayeneva yojetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "273"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alamatto"
      },
      "ti ",
      " puttadārabharaṇaṃ katvā agāraṃ ajjhāvasanasamattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇḍito"
      },
      "ti disānamassanaṭṭhāne paṇḍito hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṇho"
      },
      "ti ",
      " sukhumatthadassanena saṇhavācābhaṇanena vā saṇho hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭibhānavā"
      },
      "ti disānamassanaṭṭhāne paṭibhānavā hutvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nivātavuttī"
      },
      "ti nīcavutti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthaddho"
      },
      "ti thambharahito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uṭṭhānako"
      },
      "ti uṭṭhānavīriyasampanno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Analaso"
      },
      "ti nikkosajjo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Acchinnavuttī"
      },
      "ti nirantarakaraṇavasena akhaṇḍavutti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Medhāvī"
      },
      "ti ṭhānuppattiyā paññāya samannāgato."
    ],
    "innerText": "273.Alamattoti puttadārabharaṇaṃ katvā agāraṃ ajjhāvasanasamattho. Paṇḍitoti disānamassanaṭṭhāne paṇḍito hutvā. Saṇhoti sukhumatthadassanena saṇhavācābhaṇanena vā saṇho hutvā. Paṭibhānavāti disānamassanaṭṭhāne paṭibhānavā hutvā nivātavuttīti nīcavutti. Atthaddhoti thambharahito. Uṭṭhānakoti uṭṭhānavīriyasampanno. Analasoti nikkosajjo. Acchinnavuttīti nirantarakaraṇavasena akhaṇḍavutti. Medhāvīti ṭhānuppattiyā paññāya samannāgato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅgāhako"
      },
      "ti catūhi saṅgahavatthūhi saṅgahakaro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mittakaro"
      },
      "ti mittagavesano. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vadaññū"
      },
      "ti pubbakārinā, vuttavacanaṃ jānāti. Sahāyakassa gharaṃ gatakāle ‘‘mayhaṃ sahāyakassa veṭhanaṃ detha, sāṭakaṃ detha, manussānaṃ bhattavetanaṃ dethā’’ti vuttavacanamanussaranto tassa attano gehaṃ ",
      " āgatassa tattakaṃ vā tato atirekaṃ vā paṭikattāti attho. Apica sahāyakassa gharaṃ gantvā imaṃ nāma gaṇhissāmīti āgataṃ sahāyakaṃ lajjāya gaṇhituṃ asakkontaṃ anicchāritampi tassa vācaṃ ñatvā yena atthena so āgato, taṃ nipphādento vadaññū nāma. Yena yena vā pana sahāyakassa ūnaṃ hoti, oloketvā taṃ taṃ dentopi vadaññūyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Netā"
      },
      "ti taṃ taṃ atthaṃ dassento paññāya netā. Vividhāni kāraṇāni dassento netīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinetā."
      },
      " Punappunaṃ netīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anunetā."
      }
    ],
    "innerText": "Saṅgāhakoti catūhi saṅgahavatthūhi saṅgahakaro. Mittakaroti mittagavesano. Vadaññūti pubbakārinā, vuttavacanaṃ jānāti. Sahāyakassa gharaṃ gatakāle ‘‘mayhaṃ sahāyakassa veṭhanaṃ detha, sāṭakaṃ detha, manussānaṃ bhattavetanaṃ dethā’’ti vuttavacanamanussaranto tassa attano gehaṃ āgatassa tattakaṃ vā tato atirekaṃ vā paṭikattāti attho. Apica sahāyakassa gharaṃ gantvā imaṃ nāma gaṇhissāmīti āgataṃ sahāyakaṃ lajjāya gaṇhituṃ asakkontaṃ anicchāritampi tassa vācaṃ ñatvā yena atthena so āgato, taṃ nipphādento vadaññū nāma. Yena yena vā pana sahāyakassa ūnaṃ hoti, oloketvā taṃ taṃ dentopi vadaññūyeva. Netāti taṃ taṃ atthaṃ dassento paññāya netā. Vividhāni kāraṇāni dassento netīti vinetā. Punappunaṃ netīti anunetā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tattha tatthā"
      },
      "ti tasmiṃ tasmiṃ puggale. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rathassāṇīva yāyato"
      },
      "ti yathā āṇiyā satiyeva ratho yāti, asati na yāti, evaṃ imesu saṅgahesu satiyeva loko vattati, asati na vattati. Tena vuttaṃ – ‘‘ete kho saṅgahā loke, rathassāṇīva yāyato’’ti."
    ],
    "innerText": "Tattha tatthāti tasmiṃ tasmiṃ puggale. Rathassāṇīva yāyatoti yathā āṇiyā satiyeva ratho yāti, asati na yāti, evaṃ imesu saṅgahesu satiyeva loko vattati, asati na vattati. Tena vuttaṃ – ‘‘ete kho saṅgahā loke, rathassāṇīva yāyato’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na mātā puttakāraṇā"
      },
      "ti yadi mātā ete saṅgahe puttassa na kareyya, puttakāraṇā mānaṃ vā pūjaṃ vā na labheyya."
    ],
    "innerText": "Na mātā puttakāraṇāti yadi mātā ete saṅgahe puttassa na kareyya, puttakāraṇā mānaṃ vā pūjaṃ vā na labheyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅgahā ete"
      },
      "ti upayogavacane paccattaṃ. ‘‘Saṅgahe ete’’ti vā pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammapekkhantī"
      },
      "ti sammā pekkhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāsaṃsā ca bhavantī"
      },
      "ti pasaṃsanīyā ca bhavanti."
    ],
    "innerText": "Saṅgahā eteti upayogavacane paccattaṃ. ‘‘Saṅgahe ete’’ti vā pāṭho. Sammapekkhantīti sammā pekkhanti. Pāsaṃsā ca bhavantīti pasaṃsanīyā ca bhavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "274"
      },
      ". Iti bhagavā yā disā sandhāya te gahapatiputta pitā āha ‘‘disā namasseyyāsī’’ti, imā tā cha disā. Yadi tvaṃ pitu vacanaṃ karosi, imā disā namassāti dassento siṅgālassa pucchāya ṭhatvā desanaṃ matthakaṃ pāpetvā rājagahaṃ piṇḍāya ",
      " pāvisi ",
      ". Siṅgālakopi saraṇesu patiṭṭhāya cattālīsakoṭidhanaṃ buddhasāsane vikiritvā puññakammaṃ katvā saggaparāyaṇo ahosi. Imasmiñca pana sutte yaṃ gihīhi kattabbaṃ kammaṃ nāma, taṃ akathitaṃ natthi, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gihivinayo nāmāyaṃ suttanto."
      },
      " Tasmā imaṃ sutvā yathānusiṭṭhaṃ paṭipajjamānassa vuddhiyeva pāṭikaṅkhā, no parihānīti."
    ],
    "innerText": "274. Iti bhagavā yā disā sandhāya te gahapatiputta pitā āha ‘‘disā namasseyyāsī’’ti, imā tā cha disā. Yadi tvaṃ pitu vacanaṃ karosi, imā disā namassāti dassento siṅgālassa pucchāya ṭhatvā desanaṃ matthakaṃ pāpetvā rājagahaṃ piṇḍāya pāvisi . Siṅgālakopi saraṇesu patiṭṭhāya cattālīsakoṭidhanaṃ buddhasāsane vikiritvā puññakammaṃ katvā saggaparāyaṇo ahosi. Imasmiñca pana sutte yaṃ gihīhi kattabbaṃ kammaṃ nāma, taṃ akathitaṃ natthi, gihivinayo nāmāyaṃ suttanto. Tasmā imaṃ sutvā yathānusiṭṭhaṃ paṭipajjamānassa vuddhiyeva pāṭikaṅkhā, no parihānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sumaṅgalavilāsiniyā dīghanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Siṅgālasuttavaṇṇanā niṭṭhitā."
  }
]