[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammāsambuddhassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "nikaya"
    },
    "innerText": "Dīghanikāyo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "book"
    },
    "innerText": "Sīlakkhandhavaggapāḷi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "1. Brahmajālasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Paribbājakakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā antarā ca rājagahaṃ antarā ca nāḷandaṃ addhānamaggappaṭipanno hoti mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi. Suppiyopi kho paribbājako antarā ca rājagahaṃ antarā ca nāḷandaṃ addhānamaggappaṭipanno hoti saddhiṃ antevāsinā brahmadattena māṇavena. Tatra sudaṃ suppiyo paribbājako anekapariyāyena buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati; suppiyassa pana paribbājakassa antevāsī brahmadatto māṇavo anekapariyāyena buddhassa vaṇṇaṃ bhāsati, dhammassa ",
      " vaṇṇaṃ bhāsati, saṅghassa vaṇṇaṃ bhāsati. Itiha te ubho ācariyantevāsī aññamaññassa ujuvipaccanīkavādā bhagavantaṃ piṭṭhito piṭṭhito anubandhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anubaddhā (ka. sī. pī.)]"
      },
      " honti bhikkhusaṅghañca."
    ],
    "innerText": "1. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā antarā ca rājagahaṃ antarā ca nāḷandaṃ addhānamaggappaṭipanno hoti mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi. Suppiyopi kho paribbājako antarā ca rājagahaṃ antarā ca nāḷandaṃ addhānamaggappaṭipanno hoti saddhiṃ antevāsinā brahmadattena māṇavena. Tatra sudaṃ suppiyo paribbājako anekapariyāyena buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati; suppiyassa pana paribbājakassa antevāsī brahmadatto māṇavo anekapariyāyena buddhassa vaṇṇaṃ bhāsati, dhammassa vaṇṇaṃ bhāsati, saṅghassa vaṇṇaṃ bhāsati. Itiha te ubho ācariyantevāsī aññamaññassa ujuvipaccanīkavādā bhagavantaṃ piṭṭhito piṭṭhito anubandhā [anubaddhā (ka. sī. pī.)] honti bhikkhusaṅghañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Atha kho bhagavā ambalaṭṭhikāyaṃ rājāgārake ekarattivāsaṃ upagacchi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[upagañchi (sī. syā. kaṃ. pī.)]"
      },
      " saddhiṃ ",
      " bhikkhusaṅghena. Suppiyopi kho paribbājako ambalaṭṭhikāyaṃ rājāgārake ekarattivāsaṃ upagacchi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[upagañchi (sī. syā. kaṃ. pī.)]"
      },
      " antevāsinā brahmadattena māṇavena. Tatrapi sudaṃ suppiyo paribbājako anekapariyāyena buddhassa ",
      " avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati; suppiyassa pana ",
      " paribbājakassa antevāsī brahmadatto māṇavo anekapariyāyena buddhassa vaṇṇaṃ bhāsati, dhammassa vaṇṇaṃ bhāsati, saṅghassa vaṇṇaṃ bhāsati. Itiha te ubho ācariyantevāsī aññamaññassa ujuvipaccanīkavādā viharanti."
    ],
    "innerText": "2. Atha kho bhagavā ambalaṭṭhikāyaṃ rājāgārake ekarattivāsaṃ upagacchi [upagañchi (sī. syā. kaṃ. pī.)] saddhiṃ bhikkhusaṅghena. Suppiyopi kho paribbājako ambalaṭṭhikāyaṃ rājāgārake ekarattivāsaṃ upagacchi [upagañchi (sī. syā. kaṃ. pī.)] antevāsinā brahmadattena māṇavena. Tatrapi sudaṃ suppiyo paribbājako anekapariyāyena buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati; suppiyassa pana paribbājakassa antevāsī brahmadatto māṇavo anekapariyāyena buddhassa vaṇṇaṃ bhāsati, dhammassa vaṇṇaṃ bhāsati, saṅghassa vaṇṇaṃ bhāsati. Itiha te ubho ācariyantevāsī aññamaññassa ujuvipaccanīkavādā viharanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Atha kho sambahulānaṃ bhikkhūnaṃ rattiyā paccūsasamayaṃ paccuṭṭhitānaṃ maṇḍalamāḷe sannisinnānaṃ sannipatitānaṃ ayaṃ saṅkhiyadhammo udapādi – ‘‘acchariyaṃ, āvuso, abbhutaṃ, āvuso, yāvañcidaṃ tena bhagavatā jānatā passatā arahatā sammāsambuddhena sattānaṃ nānādhimuttikatā suppaṭividitā. Ayañhi suppiyo paribbājako anekapariyāyena buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati; suppiyassa pana paribbājakassa antevāsī brahmadatto māṇavo anekapariyāyena buddhassa vaṇṇaṃ bhāsati, dhammassa vaṇṇaṃ bhāsati, saṅghassa vaṇṇaṃ bhāsati. Itihame ubho ācariyantevāsī aññamaññassa ujuvipaccanīkavādā bhagavantaṃ piṭṭhito piṭṭhito anubandhā ",
      " honti bhikkhusaṅghañcā’’ti."
    ],
    "innerText": "3. Atha kho sambahulānaṃ bhikkhūnaṃ rattiyā paccūsasamayaṃ paccuṭṭhitānaṃ maṇḍalamāḷe sannisinnānaṃ sannipatitānaṃ ayaṃ saṅkhiyadhammo udapādi – ‘‘acchariyaṃ, āvuso, abbhutaṃ, āvuso, yāvañcidaṃ tena bhagavatā jānatā passatā arahatā sammāsambuddhena sattānaṃ nānādhimuttikatā suppaṭividitā. Ayañhi suppiyo paribbājako anekapariyāyena buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati; suppiyassa pana paribbājakassa antevāsī brahmadatto māṇavo anekapariyāyena buddhassa vaṇṇaṃ bhāsati, dhammassa vaṇṇaṃ bhāsati, saṅghassa vaṇṇaṃ bhāsati. Itihame ubho ācariyantevāsī aññamaññassa ujuvipaccanīkavādā bhagavantaṃ piṭṭhito piṭṭhito anubandhā honti bhikkhusaṅghañcā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Atha kho bhagavā tesaṃ bhikkhūnaṃ imaṃ saṅkhiyadhammaṃ viditvā yena maṇḍalamāḷo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘kāyanuttha, bhikkhave, etarahi kathāya sannisinnā sannipatitā, kā ca pana vo antarākathā vippakatā’’ti? Evaṃ vutte te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, amhākaṃ rattiyā paccūsasamayaṃ paccuṭṭhitānaṃ maṇḍalamāḷe sannisinnānaṃ sannipatitānaṃ ayaṃ saṅkhiyadhammo udapādi – ‘acchariyaṃ, āvuso, abbhutaṃ, āvuso, yāvañcidaṃ tena bhagavatā jānatā passatā arahatā sammāsambuddhena sattānaṃ nānādhimuttikatā suppaṭividitā. Ayañhi suppiyo paribbājako anekapariyāyena buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa ",
      " avaṇṇaṃ bhāsati; suppiyassa pana paribbājakassa antevāsī brahmadatto māṇavo anekapariyāyena buddhassa vaṇṇaṃ bhāsati, dhammassa vaṇṇaṃ bhāsati, saṅghassa vaṇṇaṃ bhāsati. Itihame ubho ācariyantevāsī aññamaññassa ujuvipaccanīkavādā bhagavantaṃ piṭṭhito piṭṭhito ",
      " anubandhā honti bhikkhusaṅghañcā’ti. Ayaṃ kho no, bhante, antarākathā vippakatā, atha bhagavā anuppatto’’ti."
    ],
    "innerText": "4. Atha kho bhagavā tesaṃ bhikkhūnaṃ imaṃ saṅkhiyadhammaṃ viditvā yena maṇḍalamāḷo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘kāyanuttha, bhikkhave, etarahi kathāya sannisinnā sannipatitā, kā ca pana vo antarākathā vippakatā’’ti? Evaṃ vutte te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, amhākaṃ rattiyā paccūsasamayaṃ paccuṭṭhitānaṃ maṇḍalamāḷe sannisinnānaṃ sannipatitānaṃ ayaṃ saṅkhiyadhammo udapādi – ‘acchariyaṃ, āvuso, abbhutaṃ, āvuso, yāvañcidaṃ tena bhagavatā jānatā passatā arahatā sammāsambuddhena sattānaṃ nānādhimuttikatā suppaṭividitā. Ayañhi suppiyo paribbājako anekapariyāyena buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati; suppiyassa pana paribbājakassa antevāsī brahmadatto māṇavo anekapariyāyena buddhassa vaṇṇaṃ bhāsati, dhammassa vaṇṇaṃ bhāsati, saṅghassa vaṇṇaṃ bhāsati. Itihame ubho ācariyantevāsī aññamaññassa ujuvipaccanīkavādā bhagavantaṃ piṭṭhito piṭṭhito anubandhā honti bhikkhusaṅghañcā’ti. Ayaṃ kho no, bhante, antarākathā vippakatā, atha bhagavā anuppatto’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". ‘‘Mamaṃ vā, bhikkhave, pare avaṇṇaṃ bhāseyyuṃ, dhammassa vā avaṇṇaṃ bhāseyyuṃ, saṅghassa vā avaṇṇaṃ ",
      " bhāseyyuṃ, tatra tumhehi na āghāto na appaccayo na cetaso anabhiraddhi karaṇīyā. Mamaṃ vā, bhikkhave ",
      ", pare avaṇṇaṃ bhāseyyuṃ, dhammassa vā avaṇṇaṃ bhāseyyuṃ, saṅghassa vā avaṇṇaṃ bhāseyyuṃ, tatra ce tumhe assatha kupitā vā anattamanā vā, tumhaṃ yevassa tena antarāyo. Mamaṃ vā, bhikkhave, pare avaṇṇaṃ bhāseyyuṃ, dhammassa vā avaṇṇaṃ bhāseyyuṃ, saṅghassa vā avaṇṇaṃ bhāseyyuṃ, tatra ce tumhe assatha kupitā vā anattamanā vā, api nu tumhe paresaṃ subhāsitaṃ dubbhāsitaṃ ājāneyyāthā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Mamaṃ vā, bhikkhave, pare avaṇṇaṃ bhāseyyuṃ, dhammassa vā avaṇṇaṃ bhāseyyuṃ, saṅghassa vā avaṇṇaṃ bhāseyyuṃ, tatra tumhehi abhūtaṃ abhūtato nibbeṭhetabbaṃ – ‘itipetaṃ abhūtaṃ, itipetaṃ atacchaṃ, natthi cetaṃ amhesu, na ca panetaṃ amhesu saṃvijjatī’ti."
    ],
    "innerText": "5. ‘‘Mamaṃ vā, bhikkhave, pare avaṇṇaṃ bhāseyyuṃ, dhammassa vā avaṇṇaṃ bhāseyyuṃ, saṅghassa vā avaṇṇaṃ bhāseyyuṃ, tatra tumhehi na āghāto na appaccayo na cetaso anabhiraddhi karaṇīyā. Mamaṃ vā, bhikkhave , pare avaṇṇaṃ bhāseyyuṃ, dhammassa vā avaṇṇaṃ bhāseyyuṃ, saṅghassa vā avaṇṇaṃ bhāseyyuṃ, tatra ce tumhe assatha kupitā vā anattamanā vā, tumhaṃ yevassa tena antarāyo. Mamaṃ vā, bhikkhave, pare avaṇṇaṃ bhāseyyuṃ, dhammassa vā avaṇṇaṃ bhāseyyuṃ, saṅghassa vā avaṇṇaṃ bhāseyyuṃ, tatra ce tumhe assatha kupitā vā anattamanā vā, api nu tumhe paresaṃ subhāsitaṃ dubbhāsitaṃ ājāneyyāthā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Mamaṃ vā, bhikkhave, pare avaṇṇaṃ bhāseyyuṃ, dhammassa vā avaṇṇaṃ bhāseyyuṃ, saṅghassa vā avaṇṇaṃ bhāseyyuṃ, tatra tumhehi abhūtaṃ abhūtato nibbeṭhetabbaṃ – ‘itipetaṃ abhūtaṃ, itipetaṃ atacchaṃ, natthi cetaṃ amhesu, na ca panetaṃ amhesu saṃvijjatī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". ‘‘Mamaṃ vā, bhikkhave, pare vaṇṇaṃ bhāseyyuṃ, dhammassa vā vaṇṇaṃ bhāseyyuṃ, saṅghassa vā vaṇṇaṃ bhāseyyuṃ, tatra tumhehi na ānando na somanassaṃ na cetaso uppilāvitattaṃ karaṇīyaṃ. Mamaṃ vā, bhikkhave, pare vaṇṇaṃ bhāseyyuṃ, dhammassa vā vaṇṇaṃ bhāseyyuṃ, saṅghassa vā vaṇṇaṃ bhāseyyuṃ, tatra ce tumhe assatha ānandino sumanā uppilāvitā tumhaṃ yevassa tena antarāyo. Mamaṃ vā, bhikkhave, pare vaṇṇaṃ bhāseyyuṃ, dhammassa vā vaṇṇaṃ bhāseyyuṃ, saṅghassa vā vaṇṇaṃ bhāseyyuṃ, tatra tumhehi bhūtaṃ bhūtato paṭijānitabbaṃ – ‘itipetaṃ bhūtaṃ, itipetaṃ tacchaṃ, atthi cetaṃ amhesu, saṃvijjati ca panetaṃ amhesū’ti."
    ],
    "innerText": "6. ‘‘Mamaṃ vā, bhikkhave, pare vaṇṇaṃ bhāseyyuṃ, dhammassa vā vaṇṇaṃ bhāseyyuṃ, saṅghassa vā vaṇṇaṃ bhāseyyuṃ, tatra tumhehi na ānando na somanassaṃ na cetaso uppilāvitattaṃ karaṇīyaṃ. Mamaṃ vā, bhikkhave, pare vaṇṇaṃ bhāseyyuṃ, dhammassa vā vaṇṇaṃ bhāseyyuṃ, saṅghassa vā vaṇṇaṃ bhāseyyuṃ, tatra ce tumhe assatha ānandino sumanā uppilāvitā tumhaṃ yevassa tena antarāyo. Mamaṃ vā, bhikkhave, pare vaṇṇaṃ bhāseyyuṃ, dhammassa vā vaṇṇaṃ bhāseyyuṃ, saṅghassa vā vaṇṇaṃ bhāseyyuṃ, tatra tumhehi bhūtaṃ bhūtato paṭijānitabbaṃ – ‘itipetaṃ bhūtaṃ, itipetaṃ tacchaṃ, atthi cetaṃ amhesu, saṃvijjati ca panetaṃ amhesū’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Cūḷasīlaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". ‘‘Appamattakaṃ kho panetaṃ, bhikkhave, oramattakaṃ sīlamattakaṃ, yena puthujjano ",
      " tathāgatassa vaṇṇaṃ vadamāno vadeyya. Katamañca taṃ, bhikkhave, appamattakaṃ oramattakaṃ sīlamattakaṃ, yena puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya?"
    ],
    "innerText": "7. ‘‘Appamattakaṃ kho panetaṃ, bhikkhave, oramattakaṃ sīlamattakaṃ, yena puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya. Katamañca taṃ, bhikkhave, appamattakaṃ oramattakaṃ sīlamattakaṃ, yena puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ". ‘‘‘Pāṇātipātaṃ ",
      " pahāya pāṇātipātā paṭivirato samaṇo gotamo nihitadaṇḍo, nihitasattho, lajjī, dayāpanno, sabbapāṇabhūtahitānukampī viharatī’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "8. ‘‘‘Pāṇātipātaṃ pahāya pāṇātipātā paṭivirato samaṇo gotamo nihitadaṇḍo, nihitasattho, lajjī, dayāpanno, sabbapāṇabhūtahitānukampī viharatī’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Adinnādānaṃ pahāya adinnādānā paṭivirato samaṇo gotamo dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharatī’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Abrahmacariyaṃ pahāya brahmacārī samaṇo gotamo ārācārī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anācārī (ka.)]"
      },
      " virato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṭivirato (katthaci)]"
      },
      " methunā gāmadhammā’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "‘‘‘Abrahmacariyaṃ pahāya brahmacārī samaṇo gotamo ārācārī [anācārī (ka.)] virato [paṭivirato (katthaci)] methunā gāmadhammā’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ". ‘‘‘Musāvādaṃ pahāya musāvādā paṭivirato samaṇo gotamo saccavādī saccasandho theto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ṭheto (syā. kaṃ.)]"
      },
      " paccayiko avisaṃvādako lokassā’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "9. ‘‘‘Musāvādaṃ pahāya musāvādā paṭivirato samaṇo gotamo saccavādī saccasandho theto [ṭheto (syā. kaṃ.)] paccayiko avisaṃvādako lokassā’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato samaṇo gotamo, ito sutvā na amutra akkhātā imesaṃ bhedāya, amutra vā sutvā na imesaṃ akkhātā amūsaṃ bhedāya. Iti bhinnānaṃ vā sandhātā, sahitānaṃ vā anuppadātā samaggārāmo samaggarato samagganandī ",
      " samaggakaraṇiṃ vācaṃ bhāsitā’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "‘‘‘Pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato samaṇo gotamo, ito sutvā na amutra akkhātā imesaṃ bhedāya, amutra vā sutvā na imesaṃ akkhātā amūsaṃ bhedāya. Iti bhinnānaṃ vā sandhātā, sahitānaṃ vā anuppadātā samaggārāmo samaggarato samagganandī samaggakaraṇiṃ vācaṃ bhāsitā’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato samaṇo gotamo, yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṃ vācaṃ bhāsitā’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Samphappalāpaṃ pahāya samphappalāpā paṭivirato samaṇo gotamo kālavādī bhūtavādī atthavādī dhammavādī vinayavādī, nidhānavatiṃ vācaṃ bhāsitā kālena sāpadesaṃ ",
      " pariyantavatiṃ atthasaṃhita’nti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "‘‘‘Samphappalāpaṃ pahāya samphappalāpā paṭivirato samaṇo gotamo kālavādī bhūtavādī atthavādī dhammavādī vinayavādī, nidhānavatiṃ vācaṃ bhāsitā kālena sāpadesaṃ pariyantavatiṃ atthasaṃhita’nti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ". ‘Bījagāmabhūtagāmasamārambhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samārabbhā (sī. ka.)]"
      },
      " paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave…pe…."
    ],
    "innerText": "10. ‘Bījagāmabhūtagāmasamārambhā [samārabbhā (sī. ka.)] paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Ekabhattiko samaṇo gotamo rattūparato virato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṭivirato (katthaci)]"
      },
      " vikālabhojanā…."
    ],
    "innerText": "‘‘‘Ekabhattiko samaṇo gotamo rattūparato virato [paṭivirato (katthaci)] vikālabhojanā…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Naccagītavāditavisūkadassanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[naccagītavāditavisukadassanā (ka.)]"
      },
      " paṭivirato samaṇo gotamo…."
    ],
    "innerText": "Naccagītavāditavisūkadassanā [naccagītavāditavisukadassanā (ka.)] paṭivirato samaṇo gotamo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Mālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato samaṇo gotamo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Uccāsayanamahāsayanā paṭivirato samaṇo gotamo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Jātarūparajatapaṭiggahaṇā paṭivirato samaṇo gotamo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Āmakadhaññapaṭiggahaṇā paṭivirato samaṇo gotamo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Āmakamaṃsapaṭiggahaṇā paṭivirato samaṇo gotamo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Itthikumārikapaṭiggahaṇā paṭivirato samaṇo gotamo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dāsidāsapaṭiggahaṇā ",
      " paṭivirato samaṇo gotamo…."
    ],
    "innerText": "Dāsidāsapaṭiggahaṇā paṭivirato samaṇo gotamo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ajeḷakapaṭiggahaṇā paṭivirato samaṇo gotamo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kukkuṭasūkarapaṭiggahaṇā paṭivirato samaṇo gotamo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hatthigavassavaḷavapaṭiggahaṇā paṭivirato samaṇo gotamo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Khettavatthupaṭiggahaṇā paṭivirato samaṇo gotamo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dūteyyapahiṇagamanānuyogā paṭivirato samaṇo gotamo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kayavikkayā paṭivirato samaṇo gotamo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tulākūṭakaṃsakūṭamānakūṭā paṭivirato samaṇo gotamo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ukkoṭanavañcananikatisāciyogā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sāviyogā (syā. kaṃ. ka.)]"
      },
      " paṭivirato samaṇo gotamo…."
    ],
    "innerText": "Ukkoṭanavañcananikatisāciyogā [sāviyogā (syā. kaṃ. ka.)] paṭivirato samaṇo gotamo…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Chedanavadhabandhanaviparāmosaālopasahasākārā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cūḷasīlaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Majjhimasīlaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". ‘‘‘Yathā ",
      " vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ bījagāmabhūtagāmasamārambhaṃ anuyuttā viharanti, seyyathidaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[seyyathīdaṃ (sī. syā.)]"
      },
      " – mūlabījaṃ khandhabījaṃ phaḷubījaṃ aggabījaṃ bījabījameva pañcamaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pañcamaṃ iti vā (sī. syā. ka.)]"
      },
      "; iti evarūpā bījagāmabhūtagāmasamārambhā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "11. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ bījagāmabhūtagāmasamārambhaṃ anuyuttā viharanti, seyyathidaṃ [seyyathīdaṃ (sī. syā.)] – mūlabījaṃ khandhabījaṃ phaḷubījaṃ aggabījaṃ bījabījameva pañcamaṃ [pañcamaṃ iti vā (sī. syā. ka.)]; iti evarūpā bījagāmabhūtagāmasamārambhā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ". ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ sannidhikāraparibhogaṃ anuyuttā viharanti ",
      ", seyyathidaṃ – annasannidhiṃ pānasannidhiṃ vatthasannidhiṃ yānasannidhiṃ sayanasannidhiṃ gandhasannidhiṃ āmisasannidhiṃ iti vā iti evarūpā sannidhikāraparibhogā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "12. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ sannidhikāraparibhogaṃ anuyuttā viharanti , seyyathidaṃ – annasannidhiṃ pānasannidhiṃ vatthasannidhiṃ yānasannidhiṃ sayanasannidhiṃ gandhasannidhiṃ āmisasannidhiṃ iti vā iti evarūpā sannidhikāraparibhogā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ visūkadassanaṃ anuyuttā viharanti, seyyathidaṃ – naccaṃ gītaṃ vāditaṃ pekkhaṃ akkhānaṃ pāṇissaraṃ vetāḷaṃ kumbhathūṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kumbhathūnaṃ (syā. ka.), kumbhathūṇaṃ (sī.)]"
      },
      " sobhanakaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sobhanagharakaṃ (sī.), sobhanagarakaṃ (syā. kaṃ. pī.)]"
      },
      " caṇḍālaṃ vaṃsaṃ dhovanaṃ hatthiyuddhaṃ assayuddhaṃ mahiṃsayuddhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahisayuddhaṃ (sī. syā. kaṃ. pī.)]"
      },
      " usabhayuddhaṃ ajayuddhaṃ meṇḍayuddhaṃ kukkuṭayuddhaṃ vaṭṭakayuddhaṃ daṇḍayuddhaṃ muṭṭhiyuddhaṃ nibbuddhaṃ uyyodhikaṃ balaggaṃ senābyūhaṃ anīkadassanaṃ iti vā iti evarūpā visūkadassanā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "13. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ visūkadassanaṃ anuyuttā viharanti, seyyathidaṃ – naccaṃ gītaṃ vāditaṃ pekkhaṃ akkhānaṃ pāṇissaraṃ vetāḷaṃ kumbhathūṇaṃ [kumbhathūnaṃ (syā. ka.), kumbhathūṇaṃ (sī.)] sobhanakaṃ [sobhanagharakaṃ (sī.), sobhanagarakaṃ (syā. kaṃ. pī.)] caṇḍālaṃ vaṃsaṃ dhovanaṃ hatthiyuddhaṃ assayuddhaṃ mahiṃsayuddhaṃ [mahisayuddhaṃ (sī. syā. kaṃ. pī.)] usabhayuddhaṃ ajayuddhaṃ meṇḍayuddhaṃ kukkuṭayuddhaṃ vaṭṭakayuddhaṃ daṇḍayuddhaṃ muṭṭhiyuddhaṃ nibbuddhaṃ uyyodhikaṃ balaggaṃ senābyūhaṃ anīkadassanaṃ iti vā iti evarūpā visūkadassanā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ jūtappamādaṭṭhānānuyogaṃ anuyuttā viharanti, seyyathidaṃ – aṭṭhapadaṃ dasapadaṃ ākāsaṃ parihārapathaṃ santikaṃ khalikaṃ ghaṭikaṃ salākahatthaṃ akkhaṃ paṅgacīraṃ vaṅkakaṃ mokkhacikaṃ ciṅgulikaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ciṅgulakaṃ (ka. sī.)]"
      },
      " pattāḷhakaṃ rathakaṃ dhanukaṃ ",
      " akkharikaṃ manesikaṃ yathāvajjaṃ iti ",
      " vā iti evarūpā jūtappamādaṭṭhānānuyogā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "14. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ jūtappamādaṭṭhānānuyogaṃ anuyuttā viharanti, seyyathidaṃ – aṭṭhapadaṃ dasapadaṃ ākāsaṃ parihārapathaṃ santikaṃ khalikaṃ ghaṭikaṃ salākahatthaṃ akkhaṃ paṅgacīraṃ vaṅkakaṃ mokkhacikaṃ ciṅgulikaṃ [ciṅgulakaṃ (ka. sī.)] pattāḷhakaṃ rathakaṃ dhanukaṃ akkharikaṃ manesikaṃ yathāvajjaṃ iti vā iti evarūpā jūtappamādaṭṭhānānuyogā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te ",
      " evarūpaṃ uccāsayanamahāsayanaṃ anuyuttā viharanti, seyyathidaṃ – āsandiṃ pallaṅkaṃ gonakaṃ cittakaṃ paṭikaṃ paṭalikaṃ tūlikaṃ vikatikaṃ uddalomiṃ ekantalomiṃ kaṭṭissaṃ koseyyaṃ kuttakaṃ hatthattharaṃ assattharaṃ rathattharaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[hatthattharaṇaṃ assattharaṇaṃ rathattharaṇaṃ (sī. ka. pī.)]"
      },
      " ajinappaveṇiṃ kadalimigapavarapaccattharaṇaṃ sauttaracchadaṃ ubhatolohitakūpadhānaṃ iti vā iti evarūpā uccāsayanamahāsayanā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "15. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ uccāsayanamahāsayanaṃ anuyuttā viharanti, seyyathidaṃ – āsandiṃ pallaṅkaṃ gonakaṃ cittakaṃ paṭikaṃ paṭalikaṃ tūlikaṃ vikatikaṃ uddalomiṃ ekantalomiṃ kaṭṭissaṃ koseyyaṃ kuttakaṃ hatthattharaṃ assattharaṃ rathattharaṃ [hatthattharaṇaṃ assattharaṇaṃ rathattharaṇaṃ (sī. ka. pī.)] ajinappaveṇiṃ kadalimigapavarapaccattharaṇaṃ sauttaracchadaṃ ubhatolohitakūpadhānaṃ iti vā iti evarūpā uccāsayanamahāsayanā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ maṇḍanavibhūsanaṭṭhānānuyogaṃ anuyuttā viharanti, seyyathidaṃ – ucchādanaṃ parimaddanaṃ nhāpanaṃ sambāhanaṃ ādāsaṃ añjanaṃ mālāgandhavilepanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mālāvilepanaṃ (sī. syā. kaṃ. pī.)]"
      },
      " mukhacuṇṇaṃ mukhalepanaṃ hatthabandhaṃ sikhābandhaṃ daṇḍaṃ nāḷikaṃ asiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[khaggaṃ (sī. pī.), asiṃ khaggaṃ (syā. kaṃ.)]"
      },
      " chattaṃ citrupāhanaṃ uṇhīsaṃ maṇiṃ vālabījaniṃ odātāni vatthāni dīghadasāni iti vā iti evarūpā maṇḍanavibhūsanaṭṭhānānuyogā ",
      " paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "16. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ maṇḍanavibhūsanaṭṭhānānuyogaṃ anuyuttā viharanti, seyyathidaṃ – ucchādanaṃ parimaddanaṃ nhāpanaṃ sambāhanaṃ ādāsaṃ añjanaṃ mālāgandhavilepanaṃ [mālāvilepanaṃ (sī. syā. kaṃ. pī.)] mukhacuṇṇaṃ mukhalepanaṃ hatthabandhaṃ sikhābandhaṃ daṇḍaṃ nāḷikaṃ asiṃ [khaggaṃ (sī. pī.), asiṃ khaggaṃ (syā. kaṃ.)] chattaṃ citrupāhanaṃ uṇhīsaṃ maṇiṃ vālabījaniṃ odātāni vatthāni dīghadasāni iti vā iti evarūpā maṇḍanavibhūsanaṭṭhānānuyogā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ". ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ tiracchānakathaṃ anuyuttā viharanti, seyyathidaṃ – rājakathaṃ corakathaṃ mahāmattakathaṃ senākathaṃ bhayakathaṃ yuddhakathaṃ annakathaṃ pānakathaṃ vatthakathaṃ sayanakathaṃ mālākathaṃ gandhakathaṃ ñātikathaṃ yānakathaṃ gāmakathaṃ nigamakathaṃ nagarakathaṃ janapadakathaṃ itthikathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[itthikathaṃ purisakathaṃ (syā. kaṃ. ka.)]"
      },
      " sūrakathaṃ ",
      " visikhākathaṃ kumbhaṭṭhānakathaṃ pubbapetakathaṃ nānattakathaṃ lokakkhāyikaṃ samuddakkhāyikaṃ itibhavābhavakathaṃ iti vā iti evarūpāya tiracchānakathāya paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "17. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ tiracchānakathaṃ anuyuttā viharanti, seyyathidaṃ – rājakathaṃ corakathaṃ mahāmattakathaṃ senākathaṃ bhayakathaṃ yuddhakathaṃ annakathaṃ pānakathaṃ vatthakathaṃ sayanakathaṃ mālākathaṃ gandhakathaṃ ñātikathaṃ yānakathaṃ gāmakathaṃ nigamakathaṃ nagarakathaṃ janapadakathaṃ itthikathaṃ [itthikathaṃ purisakathaṃ (syā. kaṃ. ka.)] sūrakathaṃ visikhākathaṃ kumbhaṭṭhānakathaṃ pubbapetakathaṃ nānattakathaṃ lokakkhāyikaṃ samuddakkhāyikaṃ itibhavābhavakathaṃ iti vā iti evarūpāya tiracchānakathāya paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". ‘‘‘Yathā ",
      " vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ viggāhikakathaṃ anuyuttā viharanti, seyyathidaṃ – na tvaṃ imaṃ dhammavinayaṃ ājānāsi, ahaṃ imaṃ dhammavinayaṃ ājānāmi, kiṃ tvaṃ imaṃ dhammavinayaṃ ājānissasi, micchā paṭipanno tvamasi, ahamasmi sammā paṭipanno, sahitaṃ me, asahitaṃ te, purevacanīyaṃ pacchā avaca, pacchāvacanīyaṃ pure avaca, adhiciṇṇaṃ te viparāvattaṃ, āropito te vādo, niggahito tvamasi, cara vādappamokkhāya, nibbeṭhehi vā sace pahosīti iti vā iti evarūpāya viggāhikakathāya ",
      " paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "18. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ viggāhikakathaṃ anuyuttā viharanti, seyyathidaṃ – na tvaṃ imaṃ dhammavinayaṃ ājānāsi, ahaṃ imaṃ dhammavinayaṃ ājānāmi, kiṃ tvaṃ imaṃ dhammavinayaṃ ājānissasi, micchā paṭipanno tvamasi, ahamasmi sammā paṭipanno, sahitaṃ me, asahitaṃ te, purevacanīyaṃ pacchā avaca, pacchāvacanīyaṃ pure avaca, adhiciṇṇaṃ te viparāvattaṃ, āropito te vādo, niggahito tvamasi, cara vādappamokkhāya, nibbeṭhehi vā sace pahosīti iti vā iti evarūpāya viggāhikakathāya paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ". ‘‘‘Yathā ",
      " vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ dūteyyapahiṇagamanānuyogaṃ anuyuttā viharanti, seyyathidaṃ – raññaṃ, rājamahāmattānaṃ, khattiyānaṃ, brāhmaṇānaṃ, gahapatikānaṃ, kumārānaṃ ‘‘idha gaccha, amutrāgaccha, idaṃ hara, amutra idaṃ āharā’’ti iti vā iti evarūpā dūteyyapahiṇagamanānuyogā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "19. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ dūteyyapahiṇagamanānuyogaṃ anuyuttā viharanti, seyyathidaṃ – raññaṃ, rājamahāmattānaṃ, khattiyānaṃ, brāhmaṇānaṃ, gahapatikānaṃ, kumārānaṃ ‘‘idha gaccha, amutrāgaccha, idaṃ hara, amutra idaṃ āharā’’ti iti vā iti evarūpā dūteyyapahiṇagamanānuyogā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te kuhakā ca honti, lapakā ca nemittikā ca nippesikā ca, lābhena lābhaṃ nijigīṃsitāro ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[lābhena lābhaṃ nijigiṃ bhitāro (sī. syā.), lābhena ca lābhaṃ nijigīsitāro (pī.)]"
      },
      " iti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[iti vā, iti (syā. kaṃ. ka.)]"
      },
      " evarūpā kuhanalapanā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "20. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te kuhakā ca honti, lapakā ca nemittikā ca nippesikā ca, lābhena lābhaṃ nijigīṃsitāro ca [lābhena lābhaṃ nijigiṃ bhitāro (sī. syā.), lābhena ca lābhaṃ nijigīsitāro (pī.)] iti [iti vā, iti (syā. kaṃ. ka.)] evarūpā kuhanalapanā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Majjhimasīlaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Mahāsīlaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". ‘‘‘Yathā ",
      " vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti ",
      ", seyyathidaṃ – aṅgaṃ nimittaṃ uppātaṃ supinaṃ lakkhaṇaṃ mūsikacchinnaṃ aggihomaṃ dabbihomaṃ thusahomaṃ kaṇahomaṃ taṇḍulahomaṃ sappihomaṃ telahomaṃ mukhahomaṃ lohitahomaṃ aṅgavijjā vatthuvijjā ",
      " khattavijjā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[khettavijjā (bahūsu)]"
      },
      " sivavijjā bhūtavijjā bhūrivijjā ahivijjā visavijjā vicchikavijjā mūsikavijjā sakuṇavijjā vāyasavijjā pakkajjhānaṃ saraparittāṇaṃ migacakkaṃ iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "21. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti , seyyathidaṃ – aṅgaṃ nimittaṃ uppātaṃ supinaṃ lakkhaṇaṃ mūsikacchinnaṃ aggihomaṃ dabbihomaṃ thusahomaṃ kaṇahomaṃ taṇḍulahomaṃ sappihomaṃ telahomaṃ mukhahomaṃ lohitahomaṃ aṅgavijjā vatthuvijjā khattavijjā [khettavijjā (bahūsu)] sivavijjā bhūtavijjā bhūrivijjā ahivijjā visavijjā vicchikavijjā mūsikavijjā sakuṇavijjā vāyasavijjā pakkajjhānaṃ saraparittāṇaṃ migacakkaṃ iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – maṇilakkhaṇaṃ vatthalakkhaṇaṃ daṇḍalakkhaṇaṃ satthalakkhaṇaṃ asilakkhaṇaṃ usulakkhaṇaṃ dhanulakkhaṇaṃ āvudhalakkhaṇaṃ itthilakkhaṇaṃ purisalakkhaṇaṃ kumāralakkhaṇaṃ kumārilakkhaṇaṃ dāsalakkhaṇaṃ dāsilakkhaṇaṃ hatthilakkhaṇaṃ ",
      " assalakkhaṇaṃ mahiṃsalakkhaṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahisalakkhaṇaṃ (sī. syā. kaṃ. pī.)]"
      },
      " usabhalakkhaṇaṃ golakkhaṇaṃ ajalakkhaṇaṃ meṇḍalakkhaṇaṃ kukkuṭalakkhaṇaṃ vaṭṭakalakkhaṇaṃ godhālakkhaṇaṃ kaṇṇikālakkhaṇaṃ kacchapalakkhaṇaṃ migalakkhaṇaṃ iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "22. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – maṇilakkhaṇaṃ vatthalakkhaṇaṃ daṇḍalakkhaṇaṃ satthalakkhaṇaṃ asilakkhaṇaṃ usulakkhaṇaṃ dhanulakkhaṇaṃ āvudhalakkhaṇaṃ itthilakkhaṇaṃ purisalakkhaṇaṃ kumāralakkhaṇaṃ kumārilakkhaṇaṃ dāsalakkhaṇaṃ dāsilakkhaṇaṃ hatthilakkhaṇaṃ assalakkhaṇaṃ mahiṃsalakkhaṇaṃ [mahisalakkhaṇaṃ (sī. syā. kaṃ. pī.)] usabhalakkhaṇaṃ golakkhaṇaṃ ajalakkhaṇaṃ meṇḍalakkhaṇaṃ kukkuṭalakkhaṇaṃ vaṭṭakalakkhaṇaṃ godhālakkhaṇaṃ kaṇṇikālakkhaṇaṃ kacchapalakkhaṇaṃ migalakkhaṇaṃ iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – raññaṃ niyyānaṃ bhavissati, raññaṃ ",
      " aniyyānaṃ bhavissati, abbhantarānaṃ raññaṃ upayānaṃ bhavissati, bāhirānaṃ raññaṃ ",
      " apayānaṃ bhavissati, bāhirānaṃ raññaṃ upayānaṃ bhavissati, abbhantarānaṃ raññaṃ apayānaṃ bhavissati, abbhantarānaṃ raññaṃ jayo bhavissati, bāhirānaṃ raññaṃ parājayo bhavissati, bāhirānaṃ raññaṃ jayo bhavissati, abbhantarānaṃ raññaṃ parājayo bhavissati, iti imassa jayo bhavissati, imassa parājayo bhavissati iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "23. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – raññaṃ niyyānaṃ bhavissati, raññaṃ aniyyānaṃ bhavissati, abbhantarānaṃ raññaṃ upayānaṃ bhavissati, bāhirānaṃ raññaṃ apayānaṃ bhavissati, bāhirānaṃ raññaṃ upayānaṃ bhavissati, abbhantarānaṃ raññaṃ apayānaṃ bhavissati, abbhantarānaṃ raññaṃ jayo bhavissati, bāhirānaṃ raññaṃ parājayo bhavissati, bāhirānaṃ raññaṃ jayo bhavissati, abbhantarānaṃ raññaṃ parājayo bhavissati, iti imassa jayo bhavissati, imassa parājayo bhavissati iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ". ‘‘‘Yathā ",
      " vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – candaggāho bhavissati, sūriyaggāho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[suriyaggāho (sī. syā. kaṃ. pī.)]"
      },
      " bhavissati, nakkhattaggāho bhavissati, candimasūriyānaṃ pathagamanaṃ bhavissati, candimasūriyānaṃ uppathagamanaṃ bhavissati, nakkhattānaṃ pathagamanaṃ bhavissati, nakkhattānaṃ uppathagamanaṃ bhavissati, ukkāpāto bhavissati, disāḍāho bhavissati, bhūmicālo bhavissati, devadudrabhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[devadundubhi (syā. kaṃ. pī.)]"
      },
      " bhavissati, candimasūriyanakkhattānaṃ uggamanaṃ ogamanaṃ saṃkilesaṃ vodānaṃ bhavissati, evaṃvipāko candaggāho bhavissati, evaṃvipāko sūriyaggāho bhavissati, evaṃvipāko nakkhattaggāho bhavissati, evaṃvipākaṃ candimasūriyānaṃ pathagamanaṃ bhavissati, evaṃvipākaṃ candimasūriyānaṃ ",
      " uppathagamanaṃ bhavissati, evaṃvipākaṃ nakkhattānaṃ pathagamanaṃ bhavissati, evaṃvipākaṃ nakkhattānaṃ uppathagamanaṃ bhavissati, evaṃvipāko ukkāpāto bhavissati, evaṃvipāko disāḍāho bhavissati, evaṃvipāko bhūmicālo bhavissati, evaṃvipāko devadudrabhi bhavissati, evaṃvipākaṃ candimasūriyanakkhattānaṃ uggamanaṃ ogamanaṃ saṃkilesaṃ vodānaṃ bhavissati iti vā ",
      " iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "24. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – candaggāho bhavissati, sūriyaggāho [suriyaggāho (sī. syā. kaṃ. pī.)] bhavissati, nakkhattaggāho bhavissati, candimasūriyānaṃ pathagamanaṃ bhavissati, candimasūriyānaṃ uppathagamanaṃ bhavissati, nakkhattānaṃ pathagamanaṃ bhavissati, nakkhattānaṃ uppathagamanaṃ bhavissati, ukkāpāto bhavissati, disāḍāho bhavissati, bhūmicālo bhavissati, devadudrabhi [devadundubhi (syā. kaṃ. pī.)] bhavissati, candimasūriyanakkhattānaṃ uggamanaṃ ogamanaṃ saṃkilesaṃ vodānaṃ bhavissati, evaṃvipāko candaggāho bhavissati, evaṃvipāko sūriyaggāho bhavissati, evaṃvipāko nakkhattaggāho bhavissati, evaṃvipākaṃ candimasūriyānaṃ pathagamanaṃ bhavissati, evaṃvipākaṃ candimasūriyānaṃ uppathagamanaṃ bhavissati, evaṃvipākaṃ nakkhattānaṃ pathagamanaṃ bhavissati, evaṃvipākaṃ nakkhattānaṃ uppathagamanaṃ bhavissati, evaṃvipāko ukkāpāto bhavissati, evaṃvipāko disāḍāho bhavissati, evaṃvipāko bhūmicālo bhavissati, evaṃvipāko devadudrabhi bhavissati, evaṃvipākaṃ candimasūriyanakkhattānaṃ uggamanaṃ ogamanaṃ saṃkilesaṃ vodānaṃ bhavissati iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". ‘‘‘Yathā ",
      " vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – suvuṭṭhikā bhavissati, dubbuṭṭhikā bhavissati, subhikkhaṃ bhavissati, dubbhikkhaṃ bhavissati, khemaṃ bhavissati, bhayaṃ bhavissati, rogo bhavissati, ārogyaṃ bhavissati, muddā, gaṇanā, saṅkhānaṃ, kāveyyaṃ, lokāyataṃ iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "25. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – suvuṭṭhikā bhavissati, dubbuṭṭhikā bhavissati, subhikkhaṃ bhavissati, dubbhikkhaṃ bhavissati, khemaṃ bhavissati, bhayaṃ bhavissati, rogo bhavissati, ārogyaṃ bhavissati, muddā, gaṇanā, saṅkhānaṃ, kāveyyaṃ, lokāyataṃ iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti ",
      ", seyyathidaṃ – āvāhanaṃ vivāhanaṃ saṃvaraṇaṃ vivaraṇaṃ saṃkiraṇaṃ ",
      " vikiraṇaṃ subhagakaraṇaṃ dubbhagakaraṇaṃ viruddhagabbhakaraṇaṃ jivhānibandhanaṃ hanusaṃhananaṃ hatthābhijappanaṃ hanujappanaṃ kaṇṇajappanaṃ ādāsapañhaṃ kumārikapañhaṃ devapañhaṃ ādiccupaṭṭhānaṃ mahatupaṭṭhānaṃ abbhujjalanaṃ sirivhāyanaṃ iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "26. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti , seyyathidaṃ – āvāhanaṃ vivāhanaṃ saṃvaraṇaṃ vivaraṇaṃ saṃkiraṇaṃ vikiraṇaṃ subhagakaraṇaṃ dubbhagakaraṇaṃ viruddhagabbhakaraṇaṃ jivhānibandhanaṃ hanusaṃhananaṃ hatthābhijappanaṃ hanujappanaṃ kaṇṇajappanaṃ ādāsapañhaṃ kumārikapañhaṃ devapañhaṃ ādiccupaṭṭhānaṃ mahatupaṭṭhānaṃ abbhujjalanaṃ sirivhāyanaṃ iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      ". ‘‘‘Yathā ",
      " vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – santikammaṃ paṇidhikammaṃ bhūtakammaṃ bhūrikammaṃ vassakammaṃ vossakammaṃ vatthukammaṃ vatthuparikammaṃ ācamanaṃ nhāpanaṃ juhanaṃ vamanaṃ virecanaṃ uddhaṃvirecanaṃ adhovirecanaṃ sīsavirecanaṃ kaṇṇatelaṃ nettatappanaṃ natthukammaṃ añjanaṃ paccañjanaṃ sālākiyaṃ sallakattiyaṃ dārakatikicchā mūlabhesajjānaṃ anuppadānaṃ osadhīnaṃ paṭimokkho iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
    ],
    "innerText": "27. ‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – santikammaṃ paṇidhikammaṃ bhūtakammaṃ bhūrikammaṃ vassakammaṃ vossakammaṃ vatthukammaṃ vatthuparikammaṃ ācamanaṃ nhāpanaṃ juhanaṃ vamanaṃ virecanaṃ uddhaṃvirecanaṃ adhovirecanaṃ sīsavirecanaṃ kaṇṇatelaṃ nettatappanaṃ natthukammaṃ añjanaṃ paccañjanaṃ sālākiyaṃ sallakattiyaṃ dārakatikicchā mūlabhesajjānaṃ anuppadānaṃ osadhīnaṃ paṭimokkho iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idaṃ kho, bhikkhave, appamattakaṃ oramattakaṃ sīlamattakaṃ, yena puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahāsīlaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pubbantakappikā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      ". ‘‘Atthi ",
      ", bhikkhave, aññeva dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ. Katame ca te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ?"
    ],
    "innerText": "28. ‘‘Atthi , bhikkhave, aññeva dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ. Katame ca te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "29"
      },
      ". ‘‘Santi ",
      ", bhikkhave, eke samaṇabrāhmaṇā pubbantakappikā pubbantānudiṭṭhino, pubbantaṃ ārabbha anekavihitāni adhimuttipadāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[adhivuttipadāni (sī. pī.)]"
      },
      " abhivadanti aṭṭhārasahi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha pubbantakappikā pubbantānudiṭṭhino pubbantaṃ ārabbha anekavihitāni ",
      " adhimuttipadāni abhivadanti aṭṭhārasahi vatthūhi?"
    ],
    "innerText": "29. ‘‘Santi , bhikkhave, eke samaṇabrāhmaṇā pubbantakappikā pubbantānudiṭṭhino, pubbantaṃ ārabbha anekavihitāni adhimuttipadāni [adhivuttipadāni (sī. pī.)] abhivadanti aṭṭhārasahi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha pubbantakappikā pubbantānudiṭṭhino pubbantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti aṭṭhārasahi vatthūhi?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sassatavādo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ". ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā sassatavādā, sassataṃ attānañca lokañca paññapenti catūhi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi?"
    ],
    "innerText": "30. ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā sassatavādā, sassataṃ attānañca lokañca paññapenti catūhi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ". ‘‘Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte ( ) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[(parisuddhe pariyodāte anaṅgaṇe vigatūpattilese) (syā. ka.)]"
      },
      " anekavihitaṃ ",
      " pubbenivāsaṃ anussarati. Seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekānipi jātisatāni anekānipi jātisahassāni anekānipi jātisatasahassāni – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ ",
      " anussarati."
    ],
    "innerText": "31. ‘‘Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte ( ) [(parisuddhe pariyodāte anaṅgaṇe vigatūpattilese) (syā. ka.)] anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekānipi jātisatāni anekānipi jātisahassāni anekānipi jātisatasahassāni – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So ",
      " evamāha – ‘sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito; te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisamaṃ. Taṃ kissa hetu? Ahañhi ātappamanvāya padhānamanvāya ",
      " anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusāmi, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarāmi seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi ",
      " jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekānipi jātisatāni anekānipi jātisahassāni anekānipi jātisatasahassāni – amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapannoti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarāmi. Imināmahaṃ etaṃ jānāmi ‘‘yathā sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito; te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’’nti. Idaṃ, bhikkhave, paṭhamaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti."
    ],
    "innerText": "‘‘So evamāha – ‘sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito; te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisamaṃ. Taṃ kissa hetu? Ahañhi ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusāmi, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarāmi seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekānipi jātisatāni anekānipi jātisahassāni anekānipi jātisatasahassāni – amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapannoti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarāmi. Imināmahaṃ etaṃ jānāmi ‘‘yathā sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito; te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’’nti. Idaṃ, bhikkhave, paṭhamaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "32"
      },
      ". ‘‘Dutiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha sassatavādā sassataṃ attānañca lokañca paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ – ekampi saṃvaṭṭavivaṭṭaṃ dvepi saṃvaṭṭavivaṭṭāni tīṇipi saṃvaṭṭavivaṭṭāni cattāripi saṃvaṭṭavivaṭṭāni pañcapi ",
      " saṃvaṭṭavivaṭṭāni dasapi saṃvaṭṭavivaṭṭāni – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī ",
      " evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati."
    ],
    "innerText": "32. ‘‘Dutiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha sassatavādā sassataṃ attānañca lokañca paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ – ekampi saṃvaṭṭavivaṭṭaṃ dvepi saṃvaṭṭavivaṭṭāni tīṇipi saṃvaṭṭavivaṭṭāni cattāripi saṃvaṭṭavivaṭṭāni pañcapi saṃvaṭṭavivaṭṭāni dasapi saṃvaṭṭavivaṭṭāni – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So ",
      " evamāha – ‘sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito; te ca ",
      " sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisamaṃ. Taṃ kissa hetu? Ahañhi ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusāmi yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarāmi. Seyyathidaṃ – ekampi saṃvaṭṭavivaṭṭaṃ dvepi saṃvaṭṭavivaṭṭāni tīṇipi saṃvaṭṭavivaṭṭāni cattāripi saṃvaṭṭavivaṭṭāni pañcapi saṃvaṭṭavivaṭṭāni dasapi saṃvaṭṭavivaṭṭāni. Amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapannoti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarāmi. Imināmahaṃ etaṃ jānāmi ‘‘yathā sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito, te ca ",
      " sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’’nti. Idaṃ, bhikkhave, dutiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti."
    ],
    "innerText": "‘‘So evamāha – ‘sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito; te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisamaṃ. Taṃ kissa hetu? Ahañhi ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusāmi yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarāmi. Seyyathidaṃ – ekampi saṃvaṭṭavivaṭṭaṃ dvepi saṃvaṭṭavivaṭṭāni tīṇipi saṃvaṭṭavivaṭṭāni cattāripi saṃvaṭṭavivaṭṭāni pañcapi saṃvaṭṭavivaṭṭāni dasapi saṃvaṭṭavivaṭṭāni. Amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapannoti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarāmi. Imināmahaṃ etaṃ jānāmi ‘‘yathā sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito, te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’’nti. Idaṃ, bhikkhave, dutiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "33"
      },
      ". ‘‘Tatiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha sassatavādā sassataṃ attānañca lokañca paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya ",
      " tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ – dasapi saṃvaṭṭavivaṭṭāni vīsampi saṃvaṭṭavivaṭṭāni tiṃsampi saṃvaṭṭavivaṭṭāni cattālīsampi saṃvaṭṭavivaṭṭāni – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati."
    ],
    "innerText": "33. ‘‘Tatiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha sassatavādā sassataṃ attānañca lokañca paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ – dasapi saṃvaṭṭavivaṭṭāni vīsampi saṃvaṭṭavivaṭṭāni tiṃsampi saṃvaṭṭavivaṭṭāni cattālīsampi saṃvaṭṭavivaṭṭāni – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So ",
      " evamāha – ‘sassato attā ca loko ",
      " ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito; te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisamaṃ. Taṃ kissa hetu? Ahañhi ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusāmi, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarāmi. Seyyathidaṃ – dasapi saṃvaṭṭavivaṭṭāni vīsampi saṃvaṭṭavivaṭṭāni tiṃsampi ",
      " saṃvaṭṭavivaṭṭāni cattālīsampi saṃvaṭṭavivaṭṭāni – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapannoti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarāmi. Imināmahaṃ etaṃ jānāmi ‘‘yathā sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito, te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’’nti. Idaṃ, bhikkhave, tatiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti."
    ],
    "innerText": "‘‘So evamāha – ‘sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito; te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisamaṃ. Taṃ kissa hetu? Ahañhi ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusāmi, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarāmi. Seyyathidaṃ – dasapi saṃvaṭṭavivaṭṭāni vīsampi saṃvaṭṭavivaṭṭāni tiṃsampi saṃvaṭṭavivaṭṭāni cattālīsampi saṃvaṭṭavivaṭṭāni – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapannoti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarāmi. Imināmahaṃ etaṃ jānāmi ‘‘yathā sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito, te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’’nti. Idaṃ, bhikkhave, tatiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "34"
      },
      ". ‘‘Catutthe ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha sassatavādā sassataṃ attānañca lokañca paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā takkī hoti vīmaṃsī, so takkapariyāhataṃ vīmaṃsānucaritaṃ sayaṃ paṭibhānaṃ evamāha – ‘sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito; te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’nti ",
      ". Idaṃ, bhikkhave, catutthaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti."
    ],
    "innerText": "34. ‘‘Catutthe ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha sassatavādā sassataṃ attānañca lokañca paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā takkī hoti vīmaṃsī, so takkapariyāhataṃ vīmaṃsānucaritaṃ sayaṃ paṭibhānaṃ evamāha – ‘sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito; te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’nti . Idaṃ, bhikkhave, catutthaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ". ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā sassatavādā sassataṃ attānañca lokañca paññapenti, sabbe te imeheva catūhi vatthūhi, etesaṃ vā aññatarena; natthi ito bahiddhā."
    ],
    "innerText": "35. ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā sassatavādā sassataṃ attānañca lokañca paññapenti, sabbe te imeheva catūhi vatthūhi, etesaṃ vā aññatarena; natthi ito bahiddhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ". ‘‘Tayidaṃ ",
      ", bhikkhave, tathāgato pajānāti – ‘ime diṭṭhiṭṭhānā evaṃgahitā evaṃparāmaṭṭhā evaṃgatikā bhavanti evaṃabhisamparāyā’ti, tañca tathāgato pajānāti, tato ca uttaritaraṃ pajānāti; tañca pajānanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pajānaṃ (?) dī. ni. 3.36 pāḷiaṭṭhakathā passitabbaṃ]"
      },
      " na ",
      " parāmasati, aparāmasato cassa paccattaññeva nibbuti viditā. Vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto, bhikkhave, tathāgato."
    ],
    "innerText": "36. ‘‘Tayidaṃ , bhikkhave, tathāgato pajānāti – ‘ime diṭṭhiṭṭhānā evaṃgahitā evaṃparāmaṭṭhā evaṃgatikā bhavanti evaṃabhisamparāyā’ti, tañca tathāgato pajānāti, tato ca uttaritaraṃ pajānāti; tañca pajānanaṃ [pajānaṃ (?) dī. ni. 3.36 pāḷiaṭṭhakathā passitabbaṃ] na parāmasati, aparāmasato cassa paccattaññeva nibbuti viditā. Vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto, bhikkhave, tathāgato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ". ‘‘Ime kho te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā ",
      " nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
    ],
    "innerText": "37. ‘‘Ime kho te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamabhāṇavāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ekaccasassatavādo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "38"
      },
      ". ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca ",
      " paññapenti catūhi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi vatthūhi?"
    ],
    "innerText": "38. ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi vatthūhi?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "39"
      },
      ". ‘‘Hoti kho so, bhikkhave, samayo, yaṃ kadāci karahaci dīghassa addhuno accayena ayaṃ loko saṃvaṭṭati. Saṃvaṭṭamāne loke yebhuyyena sattā ābhassarasaṃvattanikā honti. Te tattha honti manomayā pītibhakkhā sayaṃpabhā antalikkhacarā subhaṭṭhāyino, ciraṃ dīghamaddhānaṃ tiṭṭhanti."
    ],
    "innerText": "39. ‘‘Hoti kho so, bhikkhave, samayo, yaṃ kadāci karahaci dīghassa addhuno accayena ayaṃ loko saṃvaṭṭati. Saṃvaṭṭamāne loke yebhuyyena sattā ābhassarasaṃvattanikā honti. Te tattha honti manomayā pītibhakkhā sayaṃpabhā antalikkhacarā subhaṭṭhāyino, ciraṃ dīghamaddhānaṃ tiṭṭhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ". ‘‘Hoti kho so, bhikkhave, samayo, yaṃ kadāci karahaci dīghassa addhuno accayena ayaṃ loko vivaṭṭati. Vivaṭṭamāne loke suññaṃ brahmavimānaṃ pātubhavati. Atha kho aññataro satto āyukkhayā ",
      " vā puññakkhayā vā ābhassarakāyā cavitvā suññaṃ brahmavimānaṃ upapajjati. So ",
      " tattha hoti manomayo pītibhakkho sayaṃpabho antalikkhacaro subhaṭṭhāyī, ciraṃ dīghamaddhānaṃ tiṭṭhati."
    ],
    "innerText": "40. ‘‘Hoti kho so, bhikkhave, samayo, yaṃ kadāci karahaci dīghassa addhuno accayena ayaṃ loko vivaṭṭati. Vivaṭṭamāne loke suññaṃ brahmavimānaṃ pātubhavati. Atha kho aññataro satto āyukkhayā vā puññakkhayā vā ābhassarakāyā cavitvā suññaṃ brahmavimānaṃ upapajjati. So tattha hoti manomayo pītibhakkho sayaṃpabho antalikkhacaro subhaṭṭhāyī, ciraṃ dīghamaddhānaṃ tiṭṭhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ". ‘‘Tassa tattha ekakassa dīgharattaṃ nivusitattā anabhirati paritassanā upapajjati – ‘aho vata aññepi sattā itthattaṃ āgaccheyyu’nti. Atha aññepi sattā āyukkhayā vā puññakkhayā vā ābhassarakāyā cavitvā brahmavimānaṃ upapajjanti tassa sattassa sahabyataṃ. Tepi tattha honti manomayā pītibhakkhā sayaṃpabhā antalikkhacarā subhaṭṭhāyino, ciraṃ dīghamaddhānaṃ tiṭṭhanti."
    ],
    "innerText": "41. ‘‘Tassa tattha ekakassa dīgharattaṃ nivusitattā anabhirati paritassanā upapajjati – ‘aho vata aññepi sattā itthattaṃ āgaccheyyu’nti. Atha aññepi sattā āyukkhayā vā puññakkhayā vā ābhassarakāyā cavitvā brahmavimānaṃ upapajjanti tassa sattassa sahabyataṃ. Tepi tattha honti manomayā pītibhakkhā sayaṃpabhā antalikkhacarā subhaṭṭhāyino, ciraṃ dīghamaddhānaṃ tiṭṭhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42"
      },
      ". ‘‘Tatra ",
      ", bhikkhave, yo so satto paṭhamaṃ upapanno tassa evaṃ hoti – ‘ahamasmi brahmā mahābrahmā ",
      " abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sajjitā (syā. kaṃ.)]"
      },
      " vasī pitā bhūtabhabyānaṃ. Mayā ime sattā nimmitā. Taṃ kissa hetu? Mamañhi pubbe etadahosi – ‘‘aho vata aññepi sattā itthattaṃ āgaccheyyu’’nti. Iti mama ca manopaṇidhi, ime ca sattā itthattaṃ āgatā’ti."
    ],
    "innerText": "42. ‘‘Tatra , bhikkhave, yo so satto paṭhamaṃ upapanno tassa evaṃ hoti – ‘ahamasmi brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā [sajjitā (syā. kaṃ.)] vasī pitā bhūtabhabyānaṃ. Mayā ime sattā nimmitā. Taṃ kissa hetu? Mamañhi pubbe etadahosi – ‘‘aho vata aññepi sattā itthattaṃ āgaccheyyu’’nti. Iti mama ca manopaṇidhi, ime ca sattā itthattaṃ āgatā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yepi te sattā pacchā upapannā, tesampi evaṃ hoti – ‘ayaṃ kho bhavaṃ brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā vasī pitā bhūtabhabyānaṃ. Iminā mayaṃ bhotā brahmunā nimmitā. Taṃ kissa hetu? Imañhi mayaṃ addasāma idha paṭhamaṃ upapannaṃ, mayaṃ panamha pacchā upapannā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "43"
      },
      ". ‘‘Tatra, bhikkhave, yo so satto paṭhamaṃ upapanno, so dīghāyukataro ca hoti vaṇṇavantataro ca mahesakkhataro ca. Ye pana te sattā pacchā upapannā, te appāyukatarā ca honti dubbaṇṇatarā ca appesakkhatarā ca."
    ],
    "innerText": "43. ‘‘Tatra, bhikkhave, yo so satto paṭhamaṃ upapanno, so dīghāyukataro ca hoti vaṇṇavantataro ca mahesakkhataro ca. Ye pana te sattā pacchā upapannā, te appāyukatarā ca honti dubbaṇṇatarā ca appesakkhatarā ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44"
      },
      ". ‘‘Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati, yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ",
      " ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati ",
      ", tato paraṃ nānussarati."
    ],
    "innerText": "44. ‘‘Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati, yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati , tato paraṃ nānussarati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So evamāha – ‘yo kho so bhavaṃ brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā vasī pitā bhūtabhabyānaṃ, yena mayaṃ bhotā brahmunā nimmitā, so nicco dhuvo sassato avipariṇāmadhammo sassatisamaṃ tatheva ṭhassati. Ye pana mayaṃ ahumhā tena bhotā brahmunā ",
      " nimmitā, te mayaṃ aniccā addhuvā appāyukā cavanadhammā itthattaṃ āgatā’ti. Idaṃ kho, bhikkhave, paṭhamaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti."
    ],
    "innerText": "‘‘So evamāha – ‘yo kho so bhavaṃ brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā vasī pitā bhūtabhabyānaṃ, yena mayaṃ bhotā brahmunā nimmitā, so nicco dhuvo sassato avipariṇāmadhammo sassatisamaṃ tatheva ṭhassati. Ye pana mayaṃ ahumhā tena bhotā brahmunā nimmitā, te mayaṃ aniccā addhuvā appāyukā cavanadhammā itthattaṃ āgatā’ti. Idaṃ kho, bhikkhave, paṭhamaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "45"
      },
      ". ‘‘Dutiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha ekaccasassatikā ekaccaasassatikā ",
      " ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti? Santi, bhikkhave, khiḍḍāpadosikā nāma devā, te ativelaṃ hassakhiḍḍāratidhammasamāpannā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[hasakhiḍḍāratidhammasamāpannā (ka.)]"
      },
      " viharanti. Tesaṃ ativelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati sammussati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pamussati (sī. syā.)]"
      },
      ". Satiyā sammosā te devā tamhā kāyā cavanti."
    ],
    "innerText": "45. ‘‘Dutiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti? Santi, bhikkhave, khiḍḍāpadosikā nāma devā, te ativelaṃ hassakhiḍḍāratidhammasamāpannā [hasakhiḍḍāratidhammasamāpannā (ka.)] viharanti. Tesaṃ ativelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati sammussati [pamussati (sī. syā.)]. Satiyā sammosā te devā tamhā kāyā cavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "46"
      },
      ". ‘‘Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya ",
      " anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati, tato paraṃ nānussarati."
    ],
    "innerText": "46. ‘‘Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati, tato paraṃ nānussarati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So evamāha – ‘ye kho te bhonto devā na khiḍḍāpadosikā, te na ativelaṃ hassakhiḍḍāratidhammasamāpannā viharanti. Tesaṃ na ativelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati na sammussati. Satiyā ",
      " asammosā te devā tamhā kāyā na cavanti; niccā dhuvā sassatā avipariṇāmadhammā sassatisamaṃ tatheva ṭhassanti ",
      ". Ye pana mayaṃ ahumhā khiḍḍāpadosikā, te mayaṃ ativelaṃ hassakhiḍḍāratidhammasamāpannā viharimhā. Tesaṃ no ativelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati sammussati. Satiyā sammosā evaṃ mayaṃ tamhā kāyā cutā aniccā addhuvā appāyukā cavanadhammā itthattaṃ āgatā’ti. Idaṃ, bhikkhave, dutiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti."
    ],
    "innerText": "‘‘So evamāha – ‘ye kho te bhonto devā na khiḍḍāpadosikā, te na ativelaṃ hassakhiḍḍāratidhammasamāpannā viharanti. Tesaṃ na ativelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati na sammussati. Satiyā asammosā te devā tamhā kāyā na cavanti; niccā dhuvā sassatā avipariṇāmadhammā sassatisamaṃ tatheva ṭhassanti . Ye pana mayaṃ ahumhā khiḍḍāpadosikā, te mayaṃ ativelaṃ hassakhiḍḍāratidhammasamāpannā viharimhā. Tesaṃ no ativelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati sammussati. Satiyā sammosā evaṃ mayaṃ tamhā kāyā cutā aniccā addhuvā appāyukā cavanadhammā itthattaṃ āgatā’ti. Idaṃ, bhikkhave, dutiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "47"
      },
      ". ‘‘Tatiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti? Santi, bhikkhave, manopadosikā nāma ",
      " devā, te ativelaṃ aññamaññaṃ upanijjhāyanti. Te ativelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni padūsenti. Te aññamaññaṃ paduṭṭhacittā kilantakāyā kilantacittā ",
      ". Te devā tamhā kāyā cavanti."
    ],
    "innerText": "47. ‘‘Tatiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti? Santi, bhikkhave, manopadosikā nāma devā, te ativelaṃ aññamaññaṃ upanijjhāyanti. Te ativelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni padūsenti. Te aññamaññaṃ paduṭṭhacittā kilantakāyā kilantacittā . Te devā tamhā kāyā cavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "48"
      },
      ". ‘‘Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya ",
      " sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati, tato paraṃ nānussarati."
    ],
    "innerText": "48. ‘‘Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati, tato paraṃ nānussarati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So evamāha – ‘ye kho te bhonto devā na manopadosikā, te nātivelaṃ aññamaññaṃ upanijjhāyanti. Te nātivelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni nappadūsenti. Te aññamaññaṃ appaduṭṭhacittā akilantakāyā akilantacittā. Te devā tamhā kāyā na cavanti, niccā dhuvā sassatā avipariṇāmadhammā sassatisamaṃ tatheva ",
      " ṭhassanti. Ye pana mayaṃ ahumhā manopadosikā, te mayaṃ ativelaṃ aññamaññaṃ upanijjhāyimhā. Te mayaṃ ativelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni padūsimhā, te mayaṃ aññamaññaṃ paduṭṭhacittā kilantakāyā kilantacittā. Evaṃ mayaṃ tamhā kāyā cutā aniccā addhuvā appāyukā cavanadhammā itthattaṃ āgatā’ti ",
      ". Idaṃ, bhikkhave, tatiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti."
    ],
    "innerText": "‘‘So evamāha – ‘ye kho te bhonto devā na manopadosikā, te nātivelaṃ aññamaññaṃ upanijjhāyanti. Te nātivelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni nappadūsenti. Te aññamaññaṃ appaduṭṭhacittā akilantakāyā akilantacittā. Te devā tamhā kāyā na cavanti, niccā dhuvā sassatā avipariṇāmadhammā sassatisamaṃ tatheva ṭhassanti. Ye pana mayaṃ ahumhā manopadosikā, te mayaṃ ativelaṃ aññamaññaṃ upanijjhāyimhā. Te mayaṃ ativelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni padūsimhā, te mayaṃ aññamaññaṃ paduṭṭhacittā kilantakāyā kilantacittā. Evaṃ mayaṃ tamhā kāyā cutā aniccā addhuvā appāyukā cavanadhammā itthattaṃ āgatā’ti . Idaṃ, bhikkhave, tatiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "49"
      },
      ". ‘‘Catutthe ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā takkī hoti vīmaṃsī. So takkapariyāhataṃ vīmaṃsānucaritaṃ sayaṃpaṭibhānaṃ evamāha – ‘yaṃ kho idaṃ vuccati cakkhuṃ itipi sotaṃ itipi ghānaṃ itipi jivhā itipi kāyo itipi, ayaṃ attā anicco addhuvo asassato vipariṇāmadhammo. Yañca kho idaṃ vuccati cittanti vā manoti vā viññāṇanti vā ayaṃ attā nicco dhuvo sassato avipariṇāmadhammo sassatisamaṃ tatheva ṭhassatī’ti. Idaṃ, bhikkhave, catutthaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti."
    ],
    "innerText": "49. ‘‘Catutthe ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā takkī hoti vīmaṃsī. So takkapariyāhataṃ vīmaṃsānucaritaṃ sayaṃpaṭibhānaṃ evamāha – ‘yaṃ kho idaṃ vuccati cakkhuṃ itipi sotaṃ itipi ghānaṃ itipi jivhā itipi kāyo itipi, ayaṃ attā anicco addhuvo asassato vipariṇāmadhammo. Yañca kho idaṃ vuccati cittanti vā manoti vā viññāṇanti vā ayaṃ attā nicco dhuvo sassato avipariṇāmadhammo sassatisamaṃ tatheva ṭhassatī’ti. Idaṃ, bhikkhave, catutthaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50"
      },
      ". ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi ",
      " vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti, sabbe te imeheva catūhi vatthūhi, etesaṃ vā aññatarena; natthi ito bahiddhā."
    ],
    "innerText": "50. ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti, sabbe te imeheva catūhi vatthūhi, etesaṃ vā aññatarena; natthi ito bahiddhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "51"
      },
      ". ‘‘Tayidaṃ ",
      ", bhikkhave, tathāgato pajānāti – ‘ime diṭṭhiṭṭhānā ",
      " evaṃgahitā evaṃparāmaṭṭhā evaṃgatikā bhavanti evaṃabhisamparāyā’ti. Tañca tathāgato pajānāti, tato ca uttaritaraṃ pajānāti, tañca pajānanaṃ na parāmasati, aparāmasato cassa paccattaññeva nibbuti viditā. Vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto, bhikkhave, tathāgato."
    ],
    "innerText": "51. ‘‘Tayidaṃ , bhikkhave, tathāgato pajānāti – ‘ime diṭṭhiṭṭhānā evaṃgahitā evaṃparāmaṭṭhā evaṃgatikā bhavanti evaṃabhisamparāyā’ti. Tañca tathāgato pajānāti, tato ca uttaritaraṃ pajānāti, tañca pajānanaṃ na parāmasati, aparāmasato cassa paccattaññeva nibbuti viditā. Vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto, bhikkhave, tathāgato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "52"
      },
      ". ‘‘Ime kho te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ ",
      " abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
    ],
    "innerText": "52. ‘‘Ime kho te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Antānantavādo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "53"
      },
      ". ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi?"
    ],
    "innerText": "53. ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "54"
      },
      ". ‘‘Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite ",
      " citte antasaññī lokasmiṃ viharati."
    ],
    "innerText": "54. ‘‘Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte antasaññī lokasmiṃ viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘So evamāha – ‘antavā ayaṃ loko parivaṭumo. Taṃ kissa hetu? Ahañhi ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusāmi, yathāsamāhite citte antasaññī lokasmiṃ viharāmi. Imināmahaṃ etaṃ jānāmi – yathā antavā ayaṃ loko parivaṭumo’ti. Idaṃ, bhikkhave, paṭhamaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "55"
      },
      ". ‘‘Dutiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha antānantikā antānantaṃ lokassa paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ ",
      " phusati, yathāsamāhite citte anantasaññī lokasmiṃ viharati."
    ],
    "innerText": "55. ‘‘Dutiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha antānantikā antānantaṃ lokassa paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anantasaññī lokasmiṃ viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So ",
      " evamāha – ‘ananto ayaṃ loko apariyanto. Ye te samaṇabrāhmaṇā evamāhaṃsu – ‘‘antavā ayaṃ loko parivaṭumo’’ti, tesaṃ musā. Ananto ayaṃ loko apariyanto. Taṃ kissa hetu? Ahañhi ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusāmi ",
      ", yathāsamāhite citte anantasaññī lokasmiṃ viharāmi. Imināmahaṃ etaṃ jānāmi – yathā ananto ayaṃ loko apariyanto’ti. Idaṃ, bhikkhave, dutiyaṃ ",
      " ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti."
    ],
    "innerText": "‘‘So evamāha – ‘ananto ayaṃ loko apariyanto. Ye te samaṇabrāhmaṇā evamāhaṃsu – ‘‘antavā ayaṃ loko parivaṭumo’’ti, tesaṃ musā. Ananto ayaṃ loko apariyanto. Taṃ kissa hetu? Ahañhi ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusāmi , yathāsamāhite citte anantasaññī lokasmiṃ viharāmi. Imināmahaṃ etaṃ jānāmi – yathā ananto ayaṃ loko apariyanto’ti. Idaṃ, bhikkhave, dutiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "56"
      },
      ". ‘‘Tatiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha antānantikā antānantaṃ lokassa paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte uddhamadho antasaññī lokasmiṃ viharati, tiriyaṃ anantasaññī."
    ],
    "innerText": "56. ‘‘Tatiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha antānantikā antānantaṃ lokassa paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte uddhamadho antasaññī lokasmiṃ viharati, tiriyaṃ anantasaññī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘So evamāha – ‘antavā ca ayaṃ loko ananto ca. Ye te samaṇabrāhmaṇā evamāhaṃsu – ‘‘antavā ayaṃ loko parivaṭumo’’ti, tesaṃ musā. Yepi te samaṇabrāhmaṇā evamāhaṃsu – ‘‘ananto ayaṃ loko apariyanto’’ti, tesampi musā. Antavā ca ayaṃ loko ananto ca. Taṃ kissa hetu? Ahañhi ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusāmi, yathāsamāhite citte uddhamadho antasaññī lokasmiṃ viharāmi, tiriyaṃ anantasaññī. Imināmahaṃ etaṃ jānāmi – yathā antavā ca ayaṃ loko ananto cā’ti. Idaṃ, bhikkhave, tatiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "57"
      },
      ". ‘‘Catutthe ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha antānantikā antānantaṃ lokassa paññapenti? Idha, bhikkhave, ekacco ",
      " samaṇo vā brāhmaṇo vā takkī hoti vīmaṃsī. So takkapariyāhataṃ vīmaṃsānucaritaṃ sayaṃpaṭibhānaṃ evamāha – ‘nevāyaṃ loko antavā, na panānanto. Ye te samaṇabrāhmaṇā evamāhaṃsu – ‘‘antavā ayaṃ loko parivaṭumo’’ti, tesaṃ musā. Yepi te samaṇabrāhmaṇā ",
      " evamāhaṃsu – ‘‘ananto ayaṃ loko apariyanto’’ti, tesampi musā. Yepi te samaṇabrāhmaṇā evamāhaṃsu – ‘‘antavā ca ayaṃ loko ananto cā’’ti, tesampi musā. Nevāyaṃ loko antavā ",
      ", na panānanto’ti. Idaṃ, bhikkhave ",
      ", catutthaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti."
    ],
    "innerText": "57. ‘‘Catutthe ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha antānantikā antānantaṃ lokassa paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā takkī hoti vīmaṃsī. So takkapariyāhataṃ vīmaṃsānucaritaṃ sayaṃpaṭibhānaṃ evamāha – ‘nevāyaṃ loko antavā, na panānanto. Ye te samaṇabrāhmaṇā evamāhaṃsu – ‘‘antavā ayaṃ loko parivaṭumo’’ti, tesaṃ musā. Yepi te samaṇabrāhmaṇā evamāhaṃsu – ‘‘ananto ayaṃ loko apariyanto’’ti, tesampi musā. Yepi te samaṇabrāhmaṇā evamāhaṃsu – ‘‘antavā ca ayaṃ loko ananto cā’’ti, tesampi musā. Nevāyaṃ loko antavā , na panānanto’ti. Idaṃ, bhikkhave , catutthaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "58"
      },
      ". ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā antānantikā antānantaṃ lokassa paññapenti, sabbe te imeheva catūhi vatthūhi, etesaṃ vā aññatarena; natthi ito bahiddhā."
    ],
    "innerText": "58. ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā antānantikā antānantaṃ lokassa paññapenti, sabbe te imeheva catūhi vatthūhi, etesaṃ vā aññatarena; natthi ito bahiddhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "59"
      },
      ". ‘‘Tayidaṃ, bhikkhave, tathāgato pajānāti – ‘ime diṭṭhiṭṭhānā evaṃgahitā evaṃparāmaṭṭhā evaṃgatikā bhavanti evaṃabhisamparāyā’ti. Tañca tathāgato pajānāti, tato ca uttaritaraṃ pajānāti, tañca pajānanaṃ na parāmasati, aparāmasato cassa paccattaññeva nibbuti viditā. Vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto, bhikkhave, tathāgato."
    ],
    "innerText": "59. ‘‘Tayidaṃ, bhikkhave, tathāgato pajānāti – ‘ime diṭṭhiṭṭhānā evaṃgahitā evaṃparāmaṭṭhā evaṃgatikā bhavanti evaṃabhisamparāyā’ti. Tañca tathāgato pajānāti, tato ca uttaritaraṃ pajānāti, tañca pajānanaṃ na parāmasati, aparāmasato cassa paccattaññeva nibbuti viditā. Vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto, bhikkhave, tathāgato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "60"
      },
      ". ‘‘Ime kho te, bhikkhave, dhammā gambhīrā duddasā ",
      " duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
    ],
    "innerText": "60. ‘‘Ime kho te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Amarāvikkhepavādo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "61"
      },
      ". ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā amarāvikkhepikā, tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi?"
    ],
    "innerText": "61. ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā amarāvikkhepikā, tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "62"
      },
      ". ‘‘Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ‘idaṃ kusala’nti yathābhūtaṃ nappajānāti, ‘idaṃ akusala’nti yathābhūtaṃ nappajānāti. Tassa evaṃ hoti – ‘ahaṃ kho ‘‘idaṃ kusala’’nti yathābhūtaṃ nappajānāmi, ‘‘idaṃ akusala’’nti ",
      " yathābhūtaṃ nappajānāmi. Ahañce kho pana ‘‘idaṃ ",
      " kusala’’nti yathābhūtaṃ appajānanto, ‘‘idaṃ akusala’’nti yathābhūtaṃ appajānanto, ‘idaṃ kusala’nti vā byākareyyaṃ, ‘idaṃ akusala’nti vā byākareyyaṃ, taṃ mamassa musā. Yaṃ mamassa musā ",
      ", so mamassa vighāto. Yo mamassa vighāto so mamassa antarāyo’ti. Iti so musāvādabhayā musāvādaparijegucchā nevidaṃ kusalanti byākaroti, na panidaṃ akusalanti byākaroti, tattha tattha pañhaṃ puṭṭho samāno vācāvikkhepaṃ āpajjati amarāvikkhepaṃ – ‘evantipi me no; tathātipi me no; aññathātipi me no; notipi me ",
      " no; no notipi me no’ti. Idaṃ, bhikkhave, paṭhamaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ."
    ],
    "innerText": "62. ‘‘Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ‘idaṃ kusala’nti yathābhūtaṃ nappajānāti, ‘idaṃ akusala’nti yathābhūtaṃ nappajānāti. Tassa evaṃ hoti – ‘ahaṃ kho ‘‘idaṃ kusala’’nti yathābhūtaṃ nappajānāmi, ‘‘idaṃ akusala’’nti yathābhūtaṃ nappajānāmi. Ahañce kho pana ‘‘idaṃ kusala’’nti yathābhūtaṃ appajānanto, ‘‘idaṃ akusala’’nti yathābhūtaṃ appajānanto, ‘idaṃ kusala’nti vā byākareyyaṃ, ‘idaṃ akusala’nti vā byākareyyaṃ, taṃ mamassa musā. Yaṃ mamassa musā , so mamassa vighāto. Yo mamassa vighāto so mamassa antarāyo’ti. Iti so musāvādabhayā musāvādaparijegucchā nevidaṃ kusalanti byākaroti, na panidaṃ akusalanti byākaroti, tattha tattha pañhaṃ puṭṭho samāno vācāvikkhepaṃ āpajjati amarāvikkhepaṃ – ‘evantipi me no; tathātipi me no; aññathātipi me no; notipi me no; no notipi me no’ti. Idaṃ, bhikkhave, paṭhamaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "63"
      },
      ". ‘‘Dutiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ‘idaṃ kusala’nti yathābhūtaṃ nappajānāti, ‘idaṃ akusala’nti yathābhūtaṃ nappajānāti. Tassa evaṃ hoti – ‘ahaṃ kho ‘‘idaṃ kusala’’nti yathābhūtaṃ nappajānāmi, ‘‘idaṃ akusala’’nti yathābhūtaṃ nappajānāmi. Ahañce kho pana ‘‘idaṃ kusala’’nti yathābhūtaṃ appajānanto, ‘‘idaṃ akusala’’nti yathābhūtaṃ appajānanto, ‘‘idaṃ kusala’’nti vā byākareyyaṃ, ‘‘idaṃ akusala’nti vā byākareyyaṃ, tattha me assa chando vā rāgo vā doso vā paṭigho vā. Yattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yo (?)]"
      },
      " me assa chando vā rāgo vā doso vā paṭigho vā, taṃ mamassa upādānaṃ. Yaṃ mamassa upādānaṃ, so mamassa vighāto. Yo mamassa vighāto, so mamassa antarāyo’ti. Iti ",
      " so upādānabhayā upādānaparijegucchā nevidaṃ kusalanti byākaroti, na panidaṃ akusalanti byākaroti, tattha tattha pañhaṃ puṭṭho samāno vācāvikkhepaṃ āpajjati amarāvikkhepaṃ – ‘evantipi me no; tathātipi me no; aññathātipi ",
      " me no; notipi me no; no notipi me no’ti. Idaṃ, bhikkhave, dutiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā amarāvikkhepikā ",
      " tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ."
    ],
    "innerText": "63. ‘‘Dutiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ‘idaṃ kusala’nti yathābhūtaṃ nappajānāti, ‘idaṃ akusala’nti yathābhūtaṃ nappajānāti. Tassa evaṃ hoti – ‘ahaṃ kho ‘‘idaṃ kusala’’nti yathābhūtaṃ nappajānāmi, ‘‘idaṃ akusala’’nti yathābhūtaṃ nappajānāmi. Ahañce kho pana ‘‘idaṃ kusala’’nti yathābhūtaṃ appajānanto, ‘‘idaṃ akusala’’nti yathābhūtaṃ appajānanto, ‘‘idaṃ kusala’’nti vā byākareyyaṃ, ‘‘idaṃ akusala’nti vā byākareyyaṃ, tattha me assa chando vā rāgo vā doso vā paṭigho vā. Yattha [yo (?)] me assa chando vā rāgo vā doso vā paṭigho vā, taṃ mamassa upādānaṃ. Yaṃ mamassa upādānaṃ, so mamassa vighāto. Yo mamassa vighāto, so mamassa antarāyo’ti. Iti so upādānabhayā upādānaparijegucchā nevidaṃ kusalanti byākaroti, na panidaṃ akusalanti byākaroti, tattha tattha pañhaṃ puṭṭho samāno vācāvikkhepaṃ āpajjati amarāvikkhepaṃ – ‘evantipi me no; tathātipi me no; aññathātipi me no; notipi me no; no notipi me no’ti. Idaṃ, bhikkhave, dutiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "64"
      },
      ". ‘‘Tatiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ‘idaṃ kusala’nti yathābhūtaṃ nappajānāti, ‘idaṃ akusala’nti yathābhūtaṃ nappajānāti. Tassa evaṃ hoti – ‘ahaṃ kho ‘‘idaṃ kusala’’nti yathābhūtaṃ nappajānāmi, ‘‘idaṃ akusala’nti yathābhūtaṃ nappajānāmi. Ahañce kho pana ‘‘idaṃ kusala’’nti yathābhūtaṃ appajānanto ‘‘idaṃ akusala’’nti yathābhūtaṃ appajānanto ‘‘idaṃ kusala’’nti vā byākareyyaṃ, ‘‘idaṃ akusala’’nti vā byākareyyaṃ. Santi hi kho samaṇabrāhmaṇā paṇḍitā nipuṇā ",
      " kataparappavādā vālavedhirūpā, te bhindantā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vobhindantā (sī. pī.)]"
      },
      " maññe caranti paññāgatena diṭṭhigatāni, te maṃ tattha samanuyuñjeyyuṃ samanugāheyyuṃ samanubhāseyyuṃ. Ye maṃ tattha samanuyuñjeyyuṃ samanugāheyyuṃ samanubhāseyyuṃ, tesāhaṃ na sampāyeyyaṃ. Yesāhaṃ na sampāyeyyaṃ, so mamassa vighāto. Yo mamassa vighāto, so mamassa ",
      " antarāyo’ti. Iti so anuyogabhayā anuyogaparijegucchā nevidaṃ kusalanti byākaroti, na panidaṃ akusalanti byākaroti, tattha tattha pañhaṃ puṭṭho samāno vācāvikkhepaṃ āpajjati amarāvikkhepaṃ – ‘evantipi me no; tathātipi me no; aññathātipi me no; notipi me no; no notipi me no’ti. Idaṃ, bhikkhave, tatiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha ",
      " eke samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ."
    ],
    "innerText": "64. ‘‘Tatiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ‘idaṃ kusala’nti yathābhūtaṃ nappajānāti, ‘idaṃ akusala’nti yathābhūtaṃ nappajānāti. Tassa evaṃ hoti – ‘ahaṃ kho ‘‘idaṃ kusala’’nti yathābhūtaṃ nappajānāmi, ‘‘idaṃ akusala’nti yathābhūtaṃ nappajānāmi. Ahañce kho pana ‘‘idaṃ kusala’’nti yathābhūtaṃ appajānanto ‘‘idaṃ akusala’’nti yathābhūtaṃ appajānanto ‘‘idaṃ kusala’’nti vā byākareyyaṃ, ‘‘idaṃ akusala’’nti vā byākareyyaṃ. Santi hi kho samaṇabrāhmaṇā paṇḍitā nipuṇā kataparappavādā vālavedhirūpā, te bhindantā [vobhindantā (sī. pī.)] maññe caranti paññāgatena diṭṭhigatāni, te maṃ tattha samanuyuñjeyyuṃ samanugāheyyuṃ samanubhāseyyuṃ. Ye maṃ tattha samanuyuñjeyyuṃ samanugāheyyuṃ samanubhāseyyuṃ, tesāhaṃ na sampāyeyyaṃ. Yesāhaṃ na sampāyeyyaṃ, so mamassa vighāto. Yo mamassa vighāto, so mamassa antarāyo’ti. Iti so anuyogabhayā anuyogaparijegucchā nevidaṃ kusalanti byākaroti, na panidaṃ akusalanti byākaroti, tattha tattha pañhaṃ puṭṭho samāno vācāvikkhepaṃ āpajjati amarāvikkhepaṃ – ‘evantipi me no; tathātipi me no; aññathātipi me no; notipi me no; no notipi me no’ti. Idaṃ, bhikkhave, tatiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "65"
      },
      ". ‘‘Catutthe ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā mando hoti momūho. So mandattā momūhattā tattha tattha pañhaṃ puṭṭho samāno vācāvikkhepaṃ āpajjati amarāvikkhepaṃ – ‘atthi paro loko’ti iti ce maṃ pucchasi, ‘atthi paro loko’ti iti ce me ",
      " assa, ‘atthi paro loko’ti iti te naṃ byākareyyaṃ, ‘evantipi me no, tathātipi me no, aññathātipi me no, notipi me no, no notipi me no’ti. ‘Natthi paro loko…pe… ‘atthi ca natthi ca paro loko…pe… ‘nevatthi na natthi paro loko…pe… ‘atthi sattā opapātikā ",
      " …pe… ‘natthi sattā opapātikā…pe… ‘atthi ca natthi ca sattā opapātikā…pe… ‘nevatthi na natthi sattā opapātikā…pe… ‘atthi sukatadukkaṭānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sukaṭadukkaṭānaṃ (sī. syā. kaṃ.)]"
      },
      " kammānaṃ phalaṃ vipāko…pe… ‘natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko…pe… ‘atthi ca natthi ca sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko…pe… ‘nevatthi na natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko…pe… ‘hoti tathāgato paraṃ maraṇā…pe… ‘na hoti tathāgato paraṃ maraṇā…pe… ‘hoti ca na ca hoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na hoti ca (sī. ka.)]"
      },
      " tathāgato paraṃ maraṇā…pe… ‘neva hoti na na hoti tathāgato paraṃ maraṇāti iti ce maṃ pucchasi, ‘neva hoti na na hoti tathāgato paraṃ maraṇā’ti iti ce me assa, ‘neva hoti na na hoti tathāgato paraṃ maraṇā’ti iti te naṃ byākareyyaṃ, ‘evantipi me no, tathātipi me no, aññathātipi me no, notipi me no, no notipi me no’ti. Idaṃ, bhikkhave, catutthaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ."
    ],
    "innerText": "65. ‘‘Catutthe ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā mando hoti momūho. So mandattā momūhattā tattha tattha pañhaṃ puṭṭho samāno vācāvikkhepaṃ āpajjati amarāvikkhepaṃ – ‘atthi paro loko’ti iti ce maṃ pucchasi, ‘atthi paro loko’ti iti ce me assa, ‘atthi paro loko’ti iti te naṃ byākareyyaṃ, ‘evantipi me no, tathātipi me no, aññathātipi me no, notipi me no, no notipi me no’ti. ‘Natthi paro loko…pe… ‘atthi ca natthi ca paro loko…pe… ‘nevatthi na natthi paro loko…pe… ‘atthi sattā opapātikā …pe… ‘natthi sattā opapātikā…pe… ‘atthi ca natthi ca sattā opapātikā…pe… ‘nevatthi na natthi sattā opapātikā…pe… ‘atthi sukatadukkaṭānaṃ [sukaṭadukkaṭānaṃ (sī. syā. kaṃ.)] kammānaṃ phalaṃ vipāko…pe… ‘natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko…pe… ‘atthi ca natthi ca sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko…pe… ‘nevatthi na natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko…pe… ‘hoti tathāgato paraṃ maraṇā…pe… ‘na hoti tathāgato paraṃ maraṇā…pe… ‘hoti ca na ca hoti [na hoti ca (sī. ka.)] tathāgato paraṃ maraṇā…pe… ‘neva hoti na na hoti tathāgato paraṃ maraṇāti iti ce maṃ pucchasi, ‘neva hoti na na hoti tathāgato paraṃ maraṇā’ti iti ce me assa, ‘neva hoti na na hoti tathāgato paraṃ maraṇā’ti iti te naṃ byākareyyaṃ, ‘evantipi me no, tathātipi me no, aññathātipi me no, notipi me no, no notipi me no’ti. Idaṃ, bhikkhave, catutthaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "66"
      },
      ". ‘‘Imehi ",
      " kho te, bhikkhave, samaṇabrāhmaṇā amarāvikkhepikā ",
      " tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ ",
      ", sabbe te imeheva catūhi vatthūhi, etesaṃ vā aññatarena, natthi ito bahiddhā…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
    ],
    "innerText": "66. ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ , sabbe te imeheva catūhi vatthūhi, etesaṃ vā aññatarena, natthi ito bahiddhā…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Adhiccasamuppannavādo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "67"
      },
      ". ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi. Te ca bhonto samaṇabrāhmaṇā ",
      " kimāgamma kimārabbha adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi?"
    ],
    "innerText": "67. ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "68"
      },
      ". ‘‘Santi, bhikkhave, asaññasattā nāma devā. Saññuppādā ca pana te devā tamhā kāyā cavanti. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati, yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte saññuppādaṃ anussarati, tato paraṃ ",
      " nānussarati. So evamāha – ‘adhiccasamuppanno attā ca loko ca. Taṃ kissa hetu? Ahañhi pubbe nāhosiṃ, somhi etarahi ahutvā santatāya pariṇato’ti. Idaṃ, bhikkhave, paṭhamaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca ",
      " lokañca paññapenti."
    ],
    "innerText": "68. ‘‘Santi, bhikkhave, asaññasattā nāma devā. Saññuppādā ca pana te devā tamhā kāyā cavanti. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati, yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte saññuppādaṃ anussarati, tato paraṃ nānussarati. So evamāha – ‘adhiccasamuppanno attā ca loko ca. Taṃ kissa hetu? Ahañhi pubbe nāhosiṃ, somhi etarahi ahutvā santatāya pariṇato’ti. Idaṃ, bhikkhave, paṭhamaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "69"
      },
      ". ‘‘Dutiye ",
      " ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā takkī hoti vīmaṃsī. So takkapariyāhataṃ vīmaṃsānucaritaṃ sayaṃpaṭibhānaṃ evamāha – ‘adhiccasamuppanno attā ca loko cā’ti. Idaṃ, bhikkhave, dutiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti."
    ],
    "innerText": "69. ‘‘Dutiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā takkī hoti vīmaṃsī. So takkapariyāhataṃ vīmaṃsānucaritaṃ sayaṃpaṭibhānaṃ evamāha – ‘adhiccasamuppanno attā ca loko cā’ti. Idaṃ, bhikkhave, dutiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "70"
      },
      ". ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti, sabbe te imeheva dvīhi vatthūhi, etesaṃ vā aññatarena, natthi ito bahiddhā…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
    ],
    "innerText": "70. ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti, sabbe te imeheva dvīhi vatthūhi, etesaṃ vā aññatarena, natthi ito bahiddhā…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "71"
      },
      ". ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā pubbantakappikā pubbantānudiṭṭhino pubbantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti aṭṭhārasahi ",
      " vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā pubbantakappikā pubbantānudiṭṭhino pubbantamārabbha anekavihitāni adhimuttipadāni abhivadanti, sabbe te imeheva aṭṭhārasahi vatthūhi, etesaṃ vā aññatarena, natthi ito ",
      " bahiddhā."
    ],
    "innerText": "71. ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā pubbantakappikā pubbantānudiṭṭhino pubbantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti aṭṭhārasahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā pubbantakappikā pubbantānudiṭṭhino pubbantamārabbha anekavihitāni adhimuttipadāni abhivadanti, sabbe te imeheva aṭṭhārasahi vatthūhi, etesaṃ vā aññatarena, natthi ito bahiddhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "72"
      },
      ". ‘‘Tayidaṃ, bhikkhave, tathāgato pajānāti – ‘ime diṭṭhiṭṭhānā evaṃgahitā evaṃparāmaṭṭhā evaṃgatikā bhavanti evaṃabhisamparāyā’ti. Tañca tathāgato pajānāti, tato ca uttaritaraṃ pajānāti, tañca pajānanaṃ na parāmasati, aparāmasato cassa paccattaññeva nibbuti viditā. Vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto, bhikkhave, tathāgato."
    ],
    "innerText": "72. ‘‘Tayidaṃ, bhikkhave, tathāgato pajānāti – ‘ime diṭṭhiṭṭhānā evaṃgahitā evaṃparāmaṭṭhā evaṃgatikā bhavanti evaṃabhisamparāyā’ti. Tañca tathāgato pajānāti, tato ca uttaritaraṃ pajānāti, tañca pajānanaṃ na parāmasati, aparāmasato cassa paccattaññeva nibbuti viditā. Vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto, bhikkhave, tathāgato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "73"
      },
      ". ‘‘Ime ",
      " kho te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti ",
      ", yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
    ],
    "innerText": "73. ‘‘Ime kho te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti , yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyabhāṇavāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Aparantakappikā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "74"
      },
      ". ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā aparantakappikā aparantānudiṭṭhino, aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[catucattālīsāya (syā. kaṃ.)]"
      },
      " vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya vatthūhi?"
    ],
    "innerText": "74. ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā aparantakappikā aparantānudiṭṭhino, aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya [catucattālīsāya (syā. kaṃ.)] vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya vatthūhi?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Saññīvādo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "75"
      },
      ". ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā uddhamāghātanikā ",
      " saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi. Te ",
      " ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi ",
      " vatthūhi?"
    ],
    "innerText": "75. ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "76"
      },
      ". ‘‘‘Rūpī attā hoti arogo paraṃ maraṇā saññī’ti naṃ paññapenti. ‘Arūpī attā hoti arogo paraṃ maraṇā saññī’ti naṃ paññapenti. ‘Rūpī ca arūpī ca attā hoti…pe… nevarūpī nārūpī attā hoti… antavā attā hoti… anantavā attā hoti… antavā ca anantavā ca attā hoti… nevantavā nānantavā attā hoti… ekattasaññī attā hoti… nānattasaññī attā hoti… parittasaññī attā hoti… appamāṇasaññī attā hoti… ekantasukhī attā hoti… ekantadukkhī attā hoti. Sukhadukkhī attā hoti. Adukkhamasukhī attā hoti arogo paraṃ maraṇā saññī’ti naṃ paññapenti."
    ],
    "innerText": "76. ‘‘‘Rūpī attā hoti arogo paraṃ maraṇā saññī’ti naṃ paññapenti. ‘Arūpī attā hoti arogo paraṃ maraṇā saññī’ti naṃ paññapenti. ‘Rūpī ca arūpī ca attā hoti…pe… nevarūpī nārūpī attā hoti… antavā attā hoti… anantavā attā hoti… antavā ca anantavā ca attā hoti… nevantavā nānantavā attā hoti… ekattasaññī attā hoti… nānattasaññī attā hoti… parittasaññī attā hoti… appamāṇasaññī attā hoti… ekantasukhī attā hoti… ekantadukkhī attā hoti. Sukhadukkhī attā hoti. Adukkhamasukhī attā hoti arogo paraṃ maraṇā saññī’ti naṃ paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "77"
      },
      ". ‘‘Imehi ",
      " kho te, bhikkhave, samaṇabrāhmaṇā uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti, sabbe te imeheva soḷasahi vatthūhi, etesaṃ vā aññatarena, natthi ito bahiddhā…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
    ],
    "innerText": "77. ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti, sabbe te imeheva soḷasahi vatthūhi, etesaṃ vā aññatarena, natthi ito bahiddhā…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Asaññīvādo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "78"
      },
      ". ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha uddhamāghātanikā ",
      " asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi?"
    ],
    "innerText": "78. ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "79"
      },
      ". ‘‘‘Rūpī attā hoti arogo paraṃ maraṇā asaññī’ti naṃ paññapenti. ‘Arūpī attā hoti arogo paraṃ maraṇā asaññī’ti naṃ paññapenti. ‘Rūpī ca arūpī ca attā hoti…pe… nevarūpī nārūpī attā hoti… antavā attā hoti… anantavā attā hoti… antavā ca anantavā ca attā hoti… nevantavā nānantavā attā hoti arogo paraṃ maraṇā asaññī’ti naṃ paññapenti."
    ],
    "innerText": "79. ‘‘‘Rūpī attā hoti arogo paraṃ maraṇā asaññī’ti naṃ paññapenti. ‘Arūpī attā hoti arogo paraṃ maraṇā asaññī’ti naṃ paññapenti. ‘Rūpī ca arūpī ca attā hoti…pe… nevarūpī nārūpī attā hoti… antavā attā hoti… anantavā attā hoti… antavā ca anantavā ca attā hoti… nevantavā nānantavā attā hoti arogo paraṃ maraṇā asaññī’ti naṃ paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "80"
      },
      ". ‘‘Imehi ",
      " kho te, bhikkhave, samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti, sabbe te imeheva aṭṭhahi vatthūhi, etesaṃ vā aññatarena, natthi ito bahiddhā…pe… ",
      " yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
    ],
    "innerText": "80. ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti, sabbe te imeheva aṭṭhahi vatthūhi, etesaṃ vā aññatarena, natthi ito bahiddhā…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nevasaññīnāsaññīvādo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "81"
      },
      ". ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā, uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi?"
    ],
    "innerText": "81. ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā, uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "82"
      },
      ". ‘‘‘Rūpī attā hoti arogo paraṃ maraṇā nevasaññīnāsaññī’ti naṃ paññapenti ‘arūpī ",
      " attā hoti…pe… rūpī ca arūpī ca attā hoti… nevarūpī nārūpī attā hoti… antavā attā hoti… anantavā attā hoti… antavā ca anantavā ca attā hoti… nevantavā nānantavā attā hoti arogo paraṃ maraṇā nevasaññīnāsaññī’ti naṃ paññapenti."
    ],
    "innerText": "82. ‘‘‘Rūpī attā hoti arogo paraṃ maraṇā nevasaññīnāsaññī’ti naṃ paññapenti ‘arūpī attā hoti…pe… rūpī ca arūpī ca attā hoti… nevarūpī nārūpī attā hoti… antavā attā hoti… anantavā attā hoti… antavā ca anantavā ca attā hoti… nevantavā nānantavā attā hoti arogo paraṃ maraṇā nevasaññīnāsaññī’ti naṃ paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "83"
      },
      ". ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti, sabbe te imeheva aṭṭhahi vatthūhi…pe… ",
      " yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
    ],
    "innerText": "83. ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti, sabbe te imeheva aṭṭhahi vatthūhi…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ucchedavādo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "84"
      },
      ". ‘‘Santi ",
      ", bhikkhave, eke samaṇabrāhmaṇā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi. Te ca bhonto ",
      " samaṇabrāhmaṇā kimāgamma kimārabbha ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi?"
    ],
    "innerText": "84. ‘‘Santi , bhikkhave, eke samaṇabrāhmaṇā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "85"
      },
      ". ‘‘Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā evaṃvādī hoti evaṃdiṭṭhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[evaṃdiṭṭhī (ka. pī.)]"
      },
      " – ‘yato kho, bho, ayaṃ attā rūpī cātumahābhūtiko mātāpettikasambhavo kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti."
    ],
    "innerText": "85. ‘‘Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā evaṃvādī hoti evaṃdiṭṭhi [evaṃdiṭṭhī (ka. pī.)] – ‘yato kho, bho, ayaṃ attā rūpī cātumahābhūtiko mātāpettikasambhavo kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "86"
      },
      ". ‘‘Tamañño evamāha – ‘atthi ",
      " kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho, bho, añño attā dibbo rūpī kāmāvacaro kabaḷīkārāhārabhakkho. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti."
    ],
    "innerText": "86. ‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho, bho, añño attā dibbo rūpī kāmāvacaro kabaḷīkārāhārabhakkho. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "87"
      },
      ". ‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho, bho, añño attā dibbo rūpī manomayo sabbaṅgapaccaṅgī ahīnindriyo. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti."
    ],
    "innerText": "87. ‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho, bho, añño attā dibbo rūpī manomayo sabbaṅgapaccaṅgī ahīnindriyo. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "88"
      },
      ". ‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā ",
      " sammā samucchinno hoti. Atthi kho ",
      ", bho, añño attā sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ ",
      " amanasikārā ‘‘ananto ākāso’’ti ākāsānañcāyatanūpago. Taṃ tvaṃ na jānāsi ",
      " na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti."
    ],
    "innerText": "88. ‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho , bho, añño attā sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘‘ananto ākāso’’ti ākāsānañcāyatanūpago. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "89"
      },
      ". ‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho, bho, añño attā sabbaso ākāsānañcāyatanaṃ samatikkamma ‘‘anantaṃ viññāṇa’’nti viññāṇañcāyatanūpago. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti."
    ],
    "innerText": "89. ‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho, bho, añño attā sabbaso ākāsānañcāyatanaṃ samatikkamma ‘‘anantaṃ viññāṇa’’nti viññāṇañcāyatanūpago. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "90"
      },
      ". ‘‘Tamañño evamāha – ‘atthi kho, bho, so attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho, bho, añño attā sabbaso viññāṇañcāyatanaṃ samatikkamma ‘‘natthi kiñcī’’ti ākiñcaññāyatanūpago. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho ",
      ", bho, ayaṃ attā sammā samucchinno hotī’’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti."
    ],
    "innerText": "90. ‘‘Tamañño evamāha – ‘atthi kho, bho, so attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho, bho, añño attā sabbaso viññāṇañcāyatanaṃ samatikkamma ‘‘natthi kiñcī’’ti ākiñcaññāyatanūpago. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho , bho, ayaṃ attā sammā samucchinno hotī’’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "91"
      },
      ". ‘Tamañño evamāha – ‘‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho, bho, añño attā ",
      " sabbaso ākiñcaññāyatanaṃ samatikkamma ‘‘santametaṃ paṇītameta’’nti nevasaññānāsaññāyatanūpago. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti."
    ],
    "innerText": "91. ‘Tamañño evamāha – ‘‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho, bho, añño attā sabbaso ākiñcaññāyatanaṃ samatikkamma ‘‘santametaṃ paṇītameta’’nti nevasaññānāsaññāyatanūpago. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "92"
      },
      ". ‘‘Imehi ",
      " kho te, bhikkhave, samaṇabrāhmaṇā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā ",
      " vā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti, sabbe te imeheva sattahi vatthūhi…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
    ],
    "innerText": "92. ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti, sabbe te imeheva sattahi vatthūhi…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Diṭṭhadhammanibbānavādo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "93"
      },
      ". ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha diṭṭhadhammanibbānavādā ",
      " sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi?"
    ],
    "innerText": "93. ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "94"
      },
      ". ‘‘Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā evaṃvādī hoti evaṃdiṭṭhi – ‘‘yato kho, bho, ayaṃ attā pañcahi kāmaguṇehi samappito samaṅgībhūto paricāreti, ettāvatā kho, bho, ayaṃ attā paramadiṭṭhadhammanibbānaṃ patto hotī’ti. Ittheke sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti."
    ],
    "innerText": "94. ‘‘Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā evaṃvādī hoti evaṃdiṭṭhi – ‘‘yato kho, bho, ayaṃ attā pañcahi kāmaguṇehi samappito samaṅgībhūto paricāreti, ettāvatā kho, bho, ayaṃ attā paramadiṭṭhadhammanibbānaṃ patto hotī’ti. Ittheke sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "95"
      },
      ". ‘‘Tamañño evamāha –‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā paramadiṭṭhadhammanibbānaṃ patto hoti. Taṃ kissa hetu? Kāmā hi, bho, aniccā dukkhā vipariṇāmadhammā, tesaṃ vipariṇāmaññathābhāvā uppajjanti sokaparidevadukkhadomanassupāyāsā. Yato kho ",
      ", bho, ayaṃ attā vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati, ettāvatā kho, bho, ayaṃ ",
      " attā paramadiṭṭhadhammanibbānaṃ patto hotī’ti. Ittheke sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti."
    ],
    "innerText": "95. ‘‘Tamañño evamāha –‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā paramadiṭṭhadhammanibbānaṃ patto hoti. Taṃ kissa hetu? Kāmā hi, bho, aniccā dukkhā vipariṇāmadhammā, tesaṃ vipariṇāmaññathābhāvā uppajjanti sokaparidevadukkhadomanassupāyāsā. Yato kho , bho, ayaṃ attā vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati, ettāvatā kho, bho, ayaṃ attā paramadiṭṭhadhammanibbānaṃ patto hotī’ti. Ittheke sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "96"
      },
      ". ‘‘Tamañño ",
      " evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā paramadiṭṭhadhammanibbānaṃ patto hoti. Taṃ kissa hetu? Yadeva tattha vitakkitaṃ vicāritaṃ, etenetaṃ oḷārikaṃ akkhāyati. Yato kho, bho, ayaṃ attā vitakkavicārānaṃ ",
      " vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati, ettāvatā kho, bho, ayaṃ attā paramadiṭṭhadhammanibbānaṃ patto hotī’ti. Ittheke sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti."
    ],
    "innerText": "96. ‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā paramadiṭṭhadhammanibbānaṃ patto hoti. Taṃ kissa hetu? Yadeva tattha vitakkitaṃ vicāritaṃ, etenetaṃ oḷārikaṃ akkhāyati. Yato kho, bho, ayaṃ attā vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati, ettāvatā kho, bho, ayaṃ attā paramadiṭṭhadhammanibbānaṃ patto hotī’ti. Ittheke sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "97"
      },
      ". ‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā paramadiṭṭhadhammanibbānaṃ patto hoti. Taṃ kissa hetu? Yadeva tattha pītigataṃ cetaso uppilāvitattaṃ, etenetaṃ oḷārikaṃ akkhāyati. Yato kho, bho, ayaṃ attā pītiyā ca virāgā upekkhako ca viharati, sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti ‘‘upekkhako satimā sukhavihārī’’ti, tatiyaṃ jhānaṃ upasampajja viharati, ettāvatā kho, bho, ayaṃ attā paramadiṭṭhadhammanibbānaṃ patto hotī’ti. Ittheke sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti."
    ],
    "innerText": "97. ‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā paramadiṭṭhadhammanibbānaṃ patto hoti. Taṃ kissa hetu? Yadeva tattha pītigataṃ cetaso uppilāvitattaṃ, etenetaṃ oḷārikaṃ akkhāyati. Yato kho, bho, ayaṃ attā pītiyā ca virāgā upekkhako ca viharati, sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti ‘‘upekkhako satimā sukhavihārī’’ti, tatiyaṃ jhānaṃ upasampajja viharati, ettāvatā kho, bho, ayaṃ attā paramadiṭṭhadhammanibbānaṃ patto hotī’ti. Ittheke sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "98"
      },
      ". ‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā paramadiṭṭhadhammanibbānaṃ patto hoti. Taṃ kissa hetu? Yadeva tattha sukhamiti cetaso ābhogo, etenetaṃ oḷārikaṃ akkhāyati. Yato kho, bho, ayaṃ attā sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ ",
      " upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati, ettāvatā ",
      " kho, bho, ayaṃ attā paramadiṭṭhadhammanibbānaṃ patto hotī’ti. Ittheke sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti."
    ],
    "innerText": "98. ‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā paramadiṭṭhadhammanibbānaṃ patto hoti. Taṃ kissa hetu? Yadeva tattha sukhamiti cetaso ābhogo, etenetaṃ oḷārikaṃ akkhāyati. Yato kho, bho, ayaṃ attā sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati, ettāvatā kho, bho, ayaṃ attā paramadiṭṭhadhammanibbānaṃ patto hotī’ti. Ittheke sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "99"
      },
      ". ‘‘Imehi ",
      " kho te, bhikkhave, samaṇabrāhmaṇā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti, sabbe te imeheva pañcahi vatthūhi…pe… ",
      " yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
    ],
    "innerText": "99. ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti, sabbe te imeheva pañcahi vatthūhi…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "100"
      },
      ". ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti, sabbe te imeheva catucattārīsāya vatthūhi…pe… ",
      " yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
    ],
    "innerText": "100. ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti, sabbe te imeheva catucattārīsāya vatthūhi…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "101"
      },
      ". ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā pubbantakappikā ca aparantakappikā ca pubbantāparantakappikā ca pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti dvāsaṭṭhiyā vatthūhi."
    ],
    "innerText": "101. ‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā pubbantakappikā ca aparantakappikā ca pubbantāparantakappikā ca pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti dvāsaṭṭhiyā vatthūhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "102"
      },
      ". ‘‘Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā pubbantakappikā vā aparantakappikā vā pubbantāparantakappikā vā pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni ",
      " abhivadanti, sabbe te imeheva dvāsaṭṭhiyā vatthūhi, etesaṃ vā aññatarena; natthi ito bahiddhā."
    ],
    "innerText": "102. ‘‘Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā pubbantakappikā vā aparantakappikā vā pubbantāparantakappikā vā pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti, sabbe te imeheva dvāsaṭṭhiyā vatthūhi, etesaṃ vā aññatarena; natthi ito bahiddhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "103"
      },
      ". ‘‘Tayidaṃ, bhikkhave, tathāgato pajānāti – ‘ime diṭṭhiṭṭhānā evaṃgahitā evaṃparāmaṭṭhā evaṃgatikā bhavanti evaṃabhisamparāyā’ti. Tañca tathāgato pajānāti, tato ca uttaritaraṃ pajānāti, tañca pajānanaṃ na parāmasati, aparāmasato cassa paccattaññeva nibbuti ",
      " viditā. Vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto, bhikkhave, tathāgato."
    ],
    "innerText": "103. ‘‘Tayidaṃ, bhikkhave, tathāgato pajānāti – ‘ime diṭṭhiṭṭhānā evaṃgahitā evaṃparāmaṭṭhā evaṃgatikā bhavanti evaṃabhisamparāyā’ti. Tañca tathāgato pajānāti, tato ca uttaritaraṃ pajānāti, tañca pajānanaṃ na parāmasati, aparāmasato cassa paccattaññeva nibbuti viditā. Vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto, bhikkhave, tathāgato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "104"
      },
      ". ‘‘Ime ",
      " kho te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
    ],
    "innerText": "104. ‘‘Ime kho te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Paritassitavipphanditavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "105"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi ",
      ", tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
    ],
    "innerText": "105. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi , tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "106"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
    ],
    "innerText": "106. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "107"
      },
      ". ‘‘Tatra ",
      ", bhikkhave, ye te samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
    ],
    "innerText": "107. ‘‘Tatra , bhikkhave, ye te samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "108"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
    ],
    "innerText": "108. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "109"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
    ],
    "innerText": "109. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "110"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā pubbantānudiṭṭhino pubbantaṃ ",
      " ārabbha anekavihitāni adhimuttipadāni abhivadanti aṭṭhārasahi ",
      " vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
    ],
    "innerText": "110. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā pubbantānudiṭṭhino pubbantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti aṭṭhārasahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "111"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
    ],
    "innerText": "111. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "112"
      },
      ". ‘‘Tatra ",
      ", bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
    ],
    "innerText": "112. ‘‘Tatra , bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "113"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
    ],
    "innerText": "113. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "114"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
    ],
    "innerText": "114. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "115"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
    ],
    "innerText": "115. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "116"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
    ],
    "innerText": "116. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "117"
      },
      ". ‘‘Tatra ",
      ", bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā ca aparantakappikā ca ",
      " pubbantāparantakappikā ca pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti dvāsaṭṭhiyā vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
    ],
    "innerText": "117. ‘‘Tatra , bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā ca aparantakappikā ca pubbantāparantakappikā ca pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti dvāsaṭṭhiyā vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Phassapaccayāvāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "118"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā sassatavādā ",
      " sassataṃ attānañca lokañca paññapenti catūhi vatthūhi, tadapi phassapaccayā."
    ],
    "innerText": "118. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi, tadapi phassapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "119"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi vatthūhi, tadapi phassapaccayā."
    ],
    "innerText": "119. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi vatthūhi, tadapi phassapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "120"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi, tadapi phassapaccayā."
    ],
    "innerText": "120. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi, tadapi phassapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "121"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi, tadapi phassapaccayā."
    ],
    "innerText": "121. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi, tadapi phassapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "122"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi, tadapi phassapaccayā."
    ],
    "innerText": "122. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi, tadapi phassapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "123"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā pubbantānudiṭṭhino pubbantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti ",
      " aṭṭhārasahi vatthūhi, tadapi phassapaccayā."
    ],
    "innerText": "123. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā pubbantānudiṭṭhino pubbantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti aṭṭhārasahi vatthūhi, tadapi phassapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "124"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi, tadapi phassapaccayā."
    ],
    "innerText": "124. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi, tadapi phassapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "125"
      },
      ". ‘‘Tatra ",
      ", bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, tadapi phassapaccayā."
    ],
    "innerText": "125. ‘‘Tatra , bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, tadapi phassapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "126"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, tadapi phassapaccayā."
    ],
    "innerText": "126. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, tadapi phassapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "127"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi, tadapi phassapaccayā."
    ],
    "innerText": "127. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi, tadapi phassapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "128"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi, tadapi phassapaccayā."
    ],
    "innerText": "128. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi, tadapi phassapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "129"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā aparantakappikā ",
      " aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya vatthūhi, tadapi phassapaccayā."
    ],
    "innerText": "129. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya vatthūhi, tadapi phassapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "130"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā ca aparantakappikā ",
      " ca pubbantāparantakappikā ca pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti dvāsaṭṭhiyā vatthūhi, tadapi phassapaccayā."
    ],
    "innerText": "130. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā ca aparantakappikā ca pubbantāparantakappikā ca pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti dvāsaṭṭhiyā vatthūhi, tadapi phassapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Netaṃ ṭhānaṃ vijjativāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "131"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "131. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "132"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ekaccasassatikā ekacca asassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "132. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ekaccasassatikā ekacca asassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "133"
      },
      ". ‘‘Tatra ",
      ", bhikkhave, ye te samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "133. ‘‘Tatra , bhikkhave, ye te samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "134"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "134. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "135"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "135. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "136"
      },
      ". ‘‘Tatra ",
      ", bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā pubbantānudiṭṭhino pubbantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti aṭṭhārasahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "136. ‘‘Tatra , bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā pubbantānudiṭṭhino pubbantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti aṭṭhārasahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "137"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā ",
      " saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "137. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "138"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā, uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "138. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā, uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "139"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "139. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "140"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "140. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "141"
      },
      ". ‘‘Tatra ",
      ", bhikkhave, ye te samaṇabrāhmaṇā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "141. ‘‘Tatra , bhikkhave, ye te samaṇabrāhmaṇā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "142"
      },
      ". ‘‘Tatra ",
      ", bhikkhave, ye te samaṇabrāhmaṇā aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "142. ‘‘Tatra , bhikkhave, ye te samaṇabrāhmaṇā aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "143"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā ca aparantakappikā ca pubbantāparantakappikā ca pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti dvāsaṭṭhiyā vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "143. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā ca aparantakappikā ca pubbantāparantakappikā ca pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti dvāsaṭṭhiyā vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Diṭṭhigatikādhiṭṭhānavaṭṭakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "144"
      },
      ". ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi, yepi te samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā…pe… yepi te samaṇabrāhmaṇā antānantikā… yepi te samaṇabrāhmaṇā amarāvikkhepikā… yepi te samaṇabrāhmaṇā ",
      " adhiccasamuppannikā… yepi te samaṇabrāhmaṇā pubbantakappikā… yepi te samaṇabrāhmaṇā uddhamāghātanikā saññīvādā… yepi te samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā… yepi te samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā… yepi te samaṇabrāhmaṇā ucchedavādā… yepi te samaṇabrāhmaṇā diṭṭhadhammanibbānavādā… yepi te samaṇabrāhmaṇā aparantakappikā… yepi te samaṇabrāhmaṇā pubbantakappikā ca aparantakappikā ",
      " ca pubbantāparantakappikā ca pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti dvāsaṭṭhiyā vatthūhi, sabbe te chahi phassāyatanehi phussa phussa paṭisaṃvedenti tesaṃ vedanāpaccayā taṇhā, taṇhāpaccayā upādānaṃ, upādānapaccayā bhavo, bhavapaccayā jāti, jātipaccayā jarāmaraṇaṃ sokaparidevadukkhadomanassupāyāsā sambhavanti."
    ],
    "innerText": "144. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi, yepi te samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā…pe… yepi te samaṇabrāhmaṇā antānantikā… yepi te samaṇabrāhmaṇā amarāvikkhepikā… yepi te samaṇabrāhmaṇā adhiccasamuppannikā… yepi te samaṇabrāhmaṇā pubbantakappikā… yepi te samaṇabrāhmaṇā uddhamāghātanikā saññīvādā… yepi te samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā… yepi te samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā… yepi te samaṇabrāhmaṇā ucchedavādā… yepi te samaṇabrāhmaṇā diṭṭhadhammanibbānavādā… yepi te samaṇabrāhmaṇā aparantakappikā… yepi te samaṇabrāhmaṇā pubbantakappikā ca aparantakappikā ca pubbantāparantakappikā ca pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti dvāsaṭṭhiyā vatthūhi, sabbe te chahi phassāyatanehi phussa phussa paṭisaṃvedenti tesaṃ vedanāpaccayā taṇhā, taṇhāpaccayā upādānaṃ, upādānapaccayā bhavo, bhavapaccayā jāti, jātipaccayā jarāmaraṇaṃ sokaparidevadukkhadomanassupāyāsā sambhavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Vivaṭṭakathādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "145"
      },
      ". ‘‘Yato ",
      " kho, bhikkhave, bhikkhu channaṃ phassāyatanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti, ayaṃ imehi sabbeheva uttaritaraṃ pajānāti."
    ],
    "innerText": "145. ‘‘Yato kho, bhikkhave, bhikkhu channaṃ phassāyatanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti, ayaṃ imehi sabbeheva uttaritaraṃ pajānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "146"
      },
      ". ‘‘Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā pubbantakappikā vā aparantakappikā vā pubbantāparantakappikā vā pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti, sabbe te imeheva dvāsaṭṭhiyā vatthūhi antojālīkatā, ettha sitāva ummujjamānā ummujjanti, ettha pariyāpannā antojālīkatāva ummujjamānā ummujjanti."
    ],
    "innerText": "146. ‘‘Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā pubbantakappikā vā aparantakappikā vā pubbantāparantakappikā vā pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti, sabbe te imeheva dvāsaṭṭhiyā vatthūhi antojālīkatā, ettha sitāva ummujjamānā ummujjanti, ettha pariyāpannā antojālīkatāva ummujjamānā ummujjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, dakkho kevaṭṭo vā kevaṭṭantevāsī vā sukhumacchikena jālena parittaṃ udakadahaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[udakarahadaṃ (sī. syā. pī.)]"
      },
      " otthareyya. Tassa evamassa – ‘ye kho keci imasmiṃ udakadahe oḷārikā pāṇā, sabbe te antojālīkatā. Ettha sitāva ummujjamānā ",
      " ummujjanti; ettha pariyāpannā antojālīkatāva ",
      " ummujjamānā ummujjantī’ti; evameva kho, bhikkhave, ye hi keci samaṇā vā brāhmaṇā vā pubbantakappikā vā aparantakappikā vā pubbantāparantakappikā vā pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti, sabbe te imeheva dvāsaṭṭhiyā vatthūhi antojālīkatā ettha sitāva ummujjamānā ummujjanti, ettha pariyāpannā antojālīkatāva ummujjamānā ummujjanti."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, dakkho kevaṭṭo vā kevaṭṭantevāsī vā sukhumacchikena jālena parittaṃ udakadahaṃ [udakarahadaṃ (sī. syā. pī.)] otthareyya. Tassa evamassa – ‘ye kho keci imasmiṃ udakadahe oḷārikā pāṇā, sabbe te antojālīkatā. Ettha sitāva ummujjamānā ummujjanti; ettha pariyāpannā antojālīkatāva ummujjamānā ummujjantī’ti; evameva kho, bhikkhave, ye hi keci samaṇā vā brāhmaṇā vā pubbantakappikā vā aparantakappikā vā pubbantāparantakappikā vā pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti, sabbe te imeheva dvāsaṭṭhiyā vatthūhi antojālīkatā ettha sitāva ummujjamānā ummujjanti, ettha pariyāpannā antojālīkatāva ummujjamānā ummujjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "147"
      },
      ". ‘‘Ucchinnabhavanettiko, bhikkhave, tathāgatassa kāyo tiṭṭhati. Yāvassa kāyo ṭhassati, tāva naṃ dakkhanti devamanussā. Kāyassa bhedā uddhaṃ jīvitapariyādānā na naṃ dakkhanti devamanussā."
    ],
    "innerText": "147. ‘‘Ucchinnabhavanettiko, bhikkhave, tathāgatassa kāyo tiṭṭhati. Yāvassa kāyo ṭhassati, tāva naṃ dakkhanti devamanussā. Kāyassa bhedā uddhaṃ jīvitapariyādānā na naṃ dakkhanti devamanussā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, ambapiṇḍiyā vaṇṭacchinnāya yāni kānici ambāni vaṇṭapaṭibandhāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vaṇṭūpanibandhanāni (sī. pī.), vaṇḍapaṭibaddhāni (ka.)]"
      },
      ", sabbāni tāni tadanvayāni bhavanti; evameva kho, bhikkhave, ucchinnabhavanettiko tathāgatassa kāyo tiṭṭhati, yāvassa kāyo ṭhassati, tāva naṃ dakkhanti devamanussā, kāyassa bhedā uddhaṃ jīvitapariyādānā na naṃ dakkhanti devamanussā’’ti."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, ambapiṇḍiyā vaṇṭacchinnāya yāni kānici ambāni vaṇṭapaṭibandhāni [vaṇṭūpanibandhanāni (sī. pī.), vaṇḍapaṭibaddhāni (ka.)], sabbāni tāni tadanvayāni bhavanti; evameva kho, bhikkhave, ucchinnabhavanettiko tathāgatassa kāyo tiṭṭhati, yāvassa kāyo ṭhassati, tāva naṃ dakkhanti devamanussā, kāyassa bhedā uddhaṃ jīvitapariyādānā na naṃ dakkhanti devamanussā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "148"
      },
      ". Evaṃ ",
      " vutte āyasmā ānando bhagavantaṃ etadavoca – ‘‘acchariyaṃ, bhante, abbhutaṃ, bhante, ko nāmo ayaṃ, bhante, dhammapariyāyo’’ti? ‘‘Tasmātiha tvaṃ, ānanda, imaṃ dhammapariyāyaṃ atthajālantipi naṃ dhārehi, dhammajālantipi naṃ dhārehi, brahmajālantipi naṃ dhārehi, diṭṭhijālantipi naṃ dhārehi, anuttaro ",
      " saṅgāmavijayotipi naṃ dhārehī’’ti. Idamavoca bhagavā."
    ],
    "innerText": "148. Evaṃ vutte āyasmā ānando bhagavantaṃ etadavoca – ‘‘acchariyaṃ, bhante, abbhutaṃ, bhante, ko nāmo ayaṃ, bhante, dhammapariyāyo’’ti? ‘‘Tasmātiha tvaṃ, ānanda, imaṃ dhammapariyāyaṃ atthajālantipi naṃ dhārehi, dhammajālantipi naṃ dhārehi, brahmajālantipi naṃ dhārehi, diṭṭhijālantipi naṃ dhārehi, anuttaro saṅgāmavijayotipi naṃ dhārehī’’ti. Idamavoca bhagavā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "149"
      },
      ". Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Imasmiñca pana veyyākaraṇasmiṃ bhaññamāne dasasahassī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sahassī (katthaci)]"
      },
      " lokadhātu akampitthāti."
    ],
    "innerText": "149. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Imasmiñca pana veyyākaraṇasmiṃ bhaññamāne dasasahassī [sahassī (katthaci)] lokadhātu akampitthāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Brahmajālasuttaṃ niṭṭhitaṃ paṭhamaṃ."
  }
]