[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "5. Sampasādanīyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sāriputtasīhanādo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "141"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā nāḷandāyaṃ viharati pāvārikambavane. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘evaṃpasanno ahaṃ, bhante, bhagavati, na cāhu na ca bhavissati na cetarahi vijjati añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro yadidaṃ sambodhiya’’nti."
    ],
    "innerText": "141. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā nāḷandāyaṃ viharati pāvārikambavane. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘evaṃpasanno ahaṃ, bhante, bhagavati, na cāhu na ca bhavissati na cetarahi vijjati añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro yadidaṃ sambodhiya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "142"
      },
      ". ‘‘Uḷārā kho te ayaṃ, sāriputta, āsabhī vācā bhāsitā, ekaṃso gahito, sīhanādo nadito – ‘evaṃpasanno ahaṃ, bhante, bhagavati; na cāhu na ca bhavissati na cetarahi vijjati añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro yadidaṃ sambodhiya’nti. Kiṃ te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kiṃ nu (sī. pī.), kiṃ nu kho te (syā.)]"
      },
      ", sāriputta, ye te ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto cetasā ceto paricca viditā – ‘evaṃsīlā te bhagavanto ahesuṃ itipi, evaṃdhammā te bhagavanto ahesuṃ itipi ",
      ", evaṃpaññā te bhagavanto ahesuṃ itipi, evaṃvihārī te bhagavanto ahesuṃ itipi, evaṃvimuttā te bhagavanto ahesuṃ itipī’’’ti? ‘‘No hetaṃ, bhante’’."
    ],
    "innerText": "142. ‘‘Uḷārā kho te ayaṃ, sāriputta, āsabhī vācā bhāsitā, ekaṃso gahito, sīhanādo nadito – ‘evaṃpasanno ahaṃ, bhante, bhagavati; na cāhu na ca bhavissati na cetarahi vijjati añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro yadidaṃ sambodhiya’nti. Kiṃ te [kiṃ nu (sī. pī.), kiṃ nu kho te (syā.)], sāriputta, ye te ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto cetasā ceto paricca viditā – ‘evaṃsīlā te bhagavanto ahesuṃ itipi, evaṃdhammā te bhagavanto ahesuṃ itipi , evaṃpaññā te bhagavanto ahesuṃ itipi, evaṃvihārī te bhagavanto ahesuṃ itipi, evaṃvimuttā te bhagavanto ahesuṃ itipī’’’ti? ‘‘No hetaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiṃ pana te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kiṃ pana (sī. pī.)]"
      },
      ", sāriputta, ye te bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā ",
      ", sabbe te bhagavanto cetasā ceto paricca viditā, `evaṃsīlā te bhagavanto bhavissanti itipi, evaṃdhammā…pe… evaṃpaññā… evaṃvihārī… evaṃvimuttā te bhagavanto bhavissanti itipī’’’ti? ‘‘No hetaṃ, bhante’’."
    ],
    "innerText": "‘‘Kiṃ pana te [kiṃ pana (sī. pī.)], sāriputta, ye te bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā , sabbe te bhagavanto cetasā ceto paricca viditā, `evaṃsīlā te bhagavanto bhavissanti itipi, evaṃdhammā…pe… evaṃpaññā… evaṃvihārī… evaṃvimuttā te bhagavanto bhavissanti itipī’’’ti? ‘‘No hetaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiṃ ",
      " pana te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kiṃ pana (sī. pī.)]"
      },
      ", sāriputta, ahaṃ etarahi arahaṃ sammāsambuddho cetasā ceto paricca vidito – ‘evaṃsīlo bhagavā itipi, evaṃdhammo…pe… evaṃpañño ",
      "… evaṃvihārī… evaṃvimutto bhagavā itipī’’’ti? ‘‘No hetaṃ, bhante’’."
    ],
    "innerText": "‘‘Kiṃ pana te [kiṃ pana (sī. pī.)], sāriputta, ahaṃ etarahi arahaṃ sammāsambuddho cetasā ceto paricca vidito – ‘evaṃsīlo bhagavā itipi, evaṃdhammo…pe… evaṃpañño … evaṃvihārī… evaṃvimutto bhagavā itipī’’’ti? ‘‘No hetaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ettha ca hi te, sāriputta, atītānāgatapaccuppannesu arahantesu sammāsambuddhesu cetopariyañāṇaṃ natthi. Atha kiṃ carahi te ayaṃ, sāriputta, uḷārā āsabhī vācā bhāsitā, ekaṃso gahito, sīhanādo nadito – ‘evaṃpasanno ahaṃ, bhante, bhagavati, na cāhu na ca bhavissati na cetarahi vijjati añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro yadidaṃ sambodhiya’’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "143"
      },
      ". ‘‘Na kho me ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na kho panetaṃ (syā. ka.)]"
      },
      ", bhante, atītānāgatapaccuppannesu arahantesu sammāsambuddhesu cetopariyañāṇaṃ atthi. Api ca, me ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[me bhante (sī. pī. ka.)]"
      },
      " dhammanvayo vidito. Seyyathāpi, bhante ",
      ", rañño paccantimaṃ nagaraṃ daḷhuddhāpaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[daḷhuddāpaṃ (sī. pī. ka.)]"
      },
      " daḷhapākāratoraṇaṃ ekadvāraṃ. Tatrassa dovāriko paṇḍito byatto medhāvī aññātānaṃ nivāretā, ñātānaṃ pavesetā. So tassa nagarassa samantā anupariyāyapathaṃ anukkamamāno na passeyya pākārasandhiṃ vā pākāravivaraṃ vā antamaso biḷāranikkhamanamattampi. Tassa evamassa – ‘ye kho keci oḷārikā pāṇā imaṃ nagaraṃ ",
      " pavisanti vā nikkhamanti vā, sabbe te imināva dvārena pavisanti vā nikkhamanti vā’ti. Evameva kho me, bhante, dhammanvayo vidito. Ye te, bhante, ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe catūsu satipaṭṭhānesu suppatiṭṭhitacittā, satta sambojjhaṅge yathābhūtaṃ bhāvetvā anuttaraṃ sammāsambodhiṃ abhisambujjhiṃsu. Yepi te, bhante, bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe catūsu satipaṭṭhānesu suppatiṭṭhitacittā, satta sambojjhaṅge yathābhūtaṃ bhāvetvā anuttaraṃ sammāsambodhiṃ abhisambujjhissanti. Bhagavāpi, bhante, etarahi arahaṃ sammāsambuddho pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe catūsu satipaṭṭhānesu suppatiṭṭhitacitto ",
      " satta sambojjhaṅge yathābhūtaṃ bhāvetvā anuttaraṃ sammāsambodhiṃ abhisambuddho."
    ],
    "innerText": "143. ‘‘Na kho me [na kho panetaṃ (syā. ka.)], bhante, atītānāgatapaccuppannesu arahantesu sammāsambuddhesu cetopariyañāṇaṃ atthi. Api ca, me [me bhante (sī. pī. ka.)] dhammanvayo vidito. Seyyathāpi, bhante , rañño paccantimaṃ nagaraṃ daḷhuddhāpaṃ [daḷhuddāpaṃ (sī. pī. ka.)] daḷhapākāratoraṇaṃ ekadvāraṃ. Tatrassa dovāriko paṇḍito byatto medhāvī aññātānaṃ nivāretā, ñātānaṃ pavesetā. So tassa nagarassa samantā anupariyāyapathaṃ anukkamamāno na passeyya pākārasandhiṃ vā pākāravivaraṃ vā antamaso biḷāranikkhamanamattampi. Tassa evamassa – ‘ye kho keci oḷārikā pāṇā imaṃ nagaraṃ pavisanti vā nikkhamanti vā, sabbe te imināva dvārena pavisanti vā nikkhamanti vā’ti. Evameva kho me, bhante, dhammanvayo vidito. Ye te, bhante, ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe catūsu satipaṭṭhānesu suppatiṭṭhitacittā, satta sambojjhaṅge yathābhūtaṃ bhāvetvā anuttaraṃ sammāsambodhiṃ abhisambujjhiṃsu. Yepi te, bhante, bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe catūsu satipaṭṭhānesu suppatiṭṭhitacittā, satta sambojjhaṅge yathābhūtaṃ bhāvetvā anuttaraṃ sammāsambodhiṃ abhisambujjhissanti. Bhagavāpi, bhante, etarahi arahaṃ sammāsambuddho pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe catūsu satipaṭṭhānesu suppatiṭṭhitacitto satta sambojjhaṅge yathābhūtaṃ bhāvetvā anuttaraṃ sammāsambodhiṃ abhisambuddho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "144"
      },
      ". ‘‘Idhāhaṃ, bhante, yena bhagavā ",
      " tenupasaṅkamiṃ dhammassavanāya. Tassa me, bhante, bhagavā dhammaṃ deseti uttaruttaraṃ paṇītapaṇītaṃ kaṇhasukkasappaṭibhāgaṃ. Yathā yathā me, bhante, bhagavā dhammaṃ desesi uttaruttaraṃ paṇītapaṇītaṃ kaṇhasukkasappaṭibhāgaṃ, tathā tathāhaṃ tasmiṃ dhamme abhiññā ",
      " idhekaccaṃ dhammaṃ dhammesu niṭṭhamagamaṃ; satthari pasīdiṃ – ‘sammāsambuddho bhagavā, svākkhāto bhagavatā dhammo, suppaṭipanno sāvakasaṅgho’ti."
    ],
    "innerText": "144. ‘‘Idhāhaṃ, bhante, yena bhagavā tenupasaṅkamiṃ dhammassavanāya. Tassa me, bhante, bhagavā dhammaṃ deseti uttaruttaraṃ paṇītapaṇītaṃ kaṇhasukkasappaṭibhāgaṃ. Yathā yathā me, bhante, bhagavā dhammaṃ desesi uttaruttaraṃ paṇītapaṇītaṃ kaṇhasukkasappaṭibhāgaṃ, tathā tathāhaṃ tasmiṃ dhamme abhiññā idhekaccaṃ dhammaṃ dhammesu niṭṭhamagamaṃ; satthari pasīdiṃ – ‘sammāsambuddho bhagavā, svākkhāto bhagavatā dhammo, suppaṭipanno sāvakasaṅgho’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Kusaladhammadesanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "145"
      },
      ". ‘‘Aparaṃ ",
      " pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti kusalesu dhammesu. Tatrime kusalā dhammā seyyathidaṃ, cattāro satipaṭṭhānā, cattāro sammappadhānā, cattāro iddhipādā, pañcindriyāni, pañca balāni, satta bojjhaṅgā, ariyo aṭṭhaṅgiko maggo. Idha, bhante, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Etadānuttariyaṃ, bhante, kusalesu dhammesu. Taṃ bhagavā asesamabhijānāti, taṃ bhagavato asesamabhijānato uttari abhiññeyyaṃ natthi, yadabhijānaṃ añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro assa, yadidaṃ kusalesu dhammesu."
    ],
    "innerText": "145. ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti kusalesu dhammesu. Tatrime kusalā dhammā seyyathidaṃ, cattāro satipaṭṭhānā, cattāro sammappadhānā, cattāro iddhipādā, pañcindriyāni, pañca balāni, satta bojjhaṅgā, ariyo aṭṭhaṅgiko maggo. Idha, bhante, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Etadānuttariyaṃ, bhante, kusalesu dhammesu. Taṃ bhagavā asesamabhijānāti, taṃ bhagavato asesamabhijānato uttari abhiññeyyaṃ natthi, yadabhijānaṃ añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro assa, yadidaṃ kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Āyatanapaṇṇattidesanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "146"
      },
      ". ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti āyatanapaṇṇattīsu. Chayimāni, bhante, ajjhattikabāhirāni āyatanāni. Cakkhuñceva rūpā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[rūpāni (ka.)]"
      },
      " ca, sotañceva saddā ca, ghānañceva gandhā ca, jivhā ceva rasā ca, kāyo ceva phoṭṭhabbā ca, mano ceva dhammā ca. Etadānuttariyaṃ, bhante, āyatanapaṇṇattīsu. Taṃ bhagavā asesamabhijānāti, taṃ bhagavato asesamabhijānato uttari abhiññeyyaṃ natthi, yadabhijānaṃ ",
      " añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro assa yadidaṃ āyatanapaṇṇattīsu."
    ],
    "innerText": "146. ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti āyatanapaṇṇattīsu. Chayimāni, bhante, ajjhattikabāhirāni āyatanāni. Cakkhuñceva rūpā [rūpāni (ka.)] ca, sotañceva saddā ca, ghānañceva gandhā ca, jivhā ceva rasā ca, kāyo ceva phoṭṭhabbā ca, mano ceva dhammā ca. Etadānuttariyaṃ, bhante, āyatanapaṇṇattīsu. Taṃ bhagavā asesamabhijānāti, taṃ bhagavato asesamabhijānato uttari abhiññeyyaṃ natthi, yadabhijānaṃ añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro assa yadidaṃ āyatanapaṇṇattīsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Gabbhāvakkantidesanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "147"
      },
      ". ‘‘Aparaṃ ",
      " pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti gabbhāvakkantīsu. Catasso imā, bhante, gabbhāvakkantiyo. Idha ",
      ", bhante, ekacco asampajāno mātukucchiṃ okkamati; asampajāno mātukucchismiṃ ṭhāti; asampajāno mātukucchimhā nikkhamati. Ayaṃ paṭhamā gabbhāvakkanti."
    ],
    "innerText": "147. ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti gabbhāvakkantīsu. Catasso imā, bhante, gabbhāvakkantiyo. Idha , bhante, ekacco asampajāno mātukucchiṃ okkamati; asampajāno mātukucchismiṃ ṭhāti; asampajāno mātukucchimhā nikkhamati. Ayaṃ paṭhamā gabbhāvakkanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, bhante, idhekacco sampajāno mātukucchiṃ okkamati; asampajāno mātukucchismiṃ ṭhāti; asampajāno mātukucchimhā nikkhamati. Ayaṃ dutiyā gabbhāvakkanti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhante, idhekacco sampajāno mātukucchiṃ okkamati; asampajāno mātukucchismiṃ ṭhāti; asampajāno mātukucchimhā nikkhamati. Ayaṃ dutiyā gabbhāvakkanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhante, idhekacco sampajāno mātukucchiṃ okkamati; sampajāno mātukucchismiṃ ṭhāti; asampajāno mātukucchimhā nikkhamati. Ayaṃ tatiyā gabbhāvakkanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhante, idhekacco sampajāno mātukucchiṃ okkamati; sampajāno mātukucchismiṃ ṭhāti; sampajāno mātukucchimhā nikkhamati. Ayaṃ catutthā gabbhāvakkanti. Etadānuttariyaṃ, bhante, gabbhāvakkantīsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ādesanavidhādesanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "148"
      },
      ". ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti ādesanavidhāsu. Catasso imā, bhante, ādesanavidhā. Idha, bhante, ekacco nimittena ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So ",
      " bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Ayaṃ paṭhamā ādesanavidhā."
    ],
    "innerText": "148. ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti ādesanavidhāsu. Catasso imā, bhante, ādesanavidhā. Idha, bhante, ekacco nimittena ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Ayaṃ paṭhamā ādesanavidhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhante, idhekacco na heva kho nimittena ādisati. Api ca kho manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Ayaṃ dutiyā ādesanavidhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhante, idhekacco na heva kho nimittena ādisati, nāpi manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati. Api ",
      " ca kho vitakkayato vicārayato vitakkavipphārasaddaṃ sutvā ādisati ",
      " – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Ayaṃ tatiyā ādesanavidhā."
    ],
    "innerText": "‘‘Puna caparaṃ, bhante, idhekacco na heva kho nimittena ādisati, nāpi manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati. Api ca kho vitakkayato vicārayato vitakkavipphārasaddaṃ sutvā ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Ayaṃ tatiyā ādesanavidhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhante, idhekacco na heva kho nimittena ādisati, nāpi manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati, nāpi vitakkayato vicārayato vitakkavipphārasaddaṃ ",
      " sutvā ādisati. Api ca kho avitakkaṃ avicāraṃ samādhiṃ samāpannassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vitakkavicārasamādhisamāpannassa (syā. ka.) a. ni. 3.61 passitabbaṃ]"
      },
      " cetasā ceto paricca pajānāti – ‘yathā imassa bhoto manosaṅkhārā paṇihitā. Tathā imassa cittassa anantarā imaṃ nāma vitakkaṃ vitakkessatī’ti. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Ayaṃ catutthā ādesanavidhā. Etadānuttariyaṃ, bhante, ādesanavidhāsu."
    ],
    "innerText": "‘‘Puna caparaṃ, bhante, idhekacco na heva kho nimittena ādisati, nāpi manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati, nāpi vitakkayato vicārayato vitakkavipphārasaddaṃ sutvā ādisati. Api ca kho avitakkaṃ avicāraṃ samādhiṃ samāpannassa [vitakkavicārasamādhisamāpannassa (syā. ka.) a. ni. 3.61 passitabbaṃ] cetasā ceto paricca pajānāti – ‘yathā imassa bhoto manosaṅkhārā paṇihitā. Tathā imassa cittassa anantarā imaṃ nāma vitakkaṃ vitakkessatī’ti. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Ayaṃ catutthā ādesanavidhā. Etadānuttariyaṃ, bhante, ādesanavidhāsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dassanasamāpattidesanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "149"
      },
      ". ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti dassanasamāpattīsu. Catasso imā, bhante, dassanasamāpattiyo. Idha, bhante, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte imameva kāyaṃ uddhaṃ pādatalā ",
      " adho kesamatthakā tacapariyantaṃ pūraṃ nānappakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā lomā nakhā dantā taco maṃsaṃ nhāru aṭṭhi aṭṭhimiñjaṃ vakkaṃ hadayaṃ yakanaṃ kilomakaṃ pihakaṃ papphāsaṃ antaṃ antaguṇaṃ udariyaṃ karīsaṃ pittaṃ semhaṃ pubbo lohitaṃ sedo medo assu vasā kheḷo siṅghānikā lasikā mutta’nti. Ayaṃ paṭhamā dassanasamāpatti."
    ],
    "innerText": "149. ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti dassanasamāpattīsu. Catasso imā, bhante, dassanasamāpattiyo. Idha, bhante, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte imameva kāyaṃ uddhaṃ pādatalā adho kesamatthakā tacapariyantaṃ pūraṃ nānappakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā lomā nakhā dantā taco maṃsaṃ nhāru aṭṭhi aṭṭhimiñjaṃ vakkaṃ hadayaṃ yakanaṃ kilomakaṃ pihakaṃ papphāsaṃ antaṃ antaguṇaṃ udariyaṃ karīsaṃ pittaṃ semhaṃ pubbo lohitaṃ sedo medo assu vasā kheḷo siṅghānikā lasikā mutta’nti. Ayaṃ paṭhamā dassanasamāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ ",
      ", bhante, idhekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte imameva kāyaṃ uddhaṃ pādatalā adho kesamatthakā tacapariyantaṃ pūraṃ nānappakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā ",
      " lomā…pe… lasikā mutta’nti. Atikkamma ca purisassa chavimaṃsalohitaṃ aṭṭhiṃ paccavekkhati. Ayaṃ dutiyā dassanasamāpatti."
    ],
    "innerText": "‘‘Puna caparaṃ , bhante, idhekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte imameva kāyaṃ uddhaṃ pādatalā adho kesamatthakā tacapariyantaṃ pūraṃ nānappakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā lomā…pe… lasikā mutta’nti. Atikkamma ca purisassa chavimaṃsalohitaṃ aṭṭhiṃ paccavekkhati. Ayaṃ dutiyā dassanasamāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhante, idhekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte imameva kāyaṃ uddhaṃ pādatalā adho kesamatthakā tacapariyantaṃ pūraṃ nānappakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā lomā…pe… lasikā mutta’nti. Atikkamma ca purisassa chavimaṃsalohitaṃ aṭṭhiṃ paccavekkhati. Purisassa ca viññāṇasotaṃ pajānāti, ubhayato abbocchinnaṃ idha loke patiṭṭhitañca paraloke patiṭṭhitañca. Ayaṃ tatiyā dassanasamāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, bhante, idhekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte imameva kāyaṃ uddhaṃ pādatalā adho kesamatthakā tacapariyantaṃ pūraṃ nānappakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā lomā…pe… lasikā mutta’nti. Atikkamma ca purisassa ",
      " chavimaṃsalohitaṃ aṭṭhiṃ paccavekkhati. Purisassa ca viññāṇasotaṃ pajānāti, ubhayato abbocchinnaṃ idha loke appatiṭṭhitañca paraloke appatiṭṭhitañca. Ayaṃ catutthā dassanasamāpatti. Etadānuttariyaṃ, bhante, dassanasamāpattīsu."
    ],
    "innerText": "‘‘Puna caparaṃ, bhante, idhekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte imameva kāyaṃ uddhaṃ pādatalā adho kesamatthakā tacapariyantaṃ pūraṃ nānappakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā lomā…pe… lasikā mutta’nti. Atikkamma ca purisassa chavimaṃsalohitaṃ aṭṭhiṃ paccavekkhati. Purisassa ca viññāṇasotaṃ pajānāti, ubhayato abbocchinnaṃ idha loke appatiṭṭhitañca paraloke appatiṭṭhitañca. Ayaṃ catutthā dassanasamāpatti. Etadānuttariyaṃ, bhante, dassanasamāpattīsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Puggalapaṇṇattidesanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "150"
      },
      ". ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti puggalapaṇṇattīsu. Sattime, bhante, puggalā. Ubhatobhāgavimutto paññāvimutto kāyasakkhī diṭṭhippatto saddhāvimutto dhammānusārī saddhānusārī. Etadānuttariyaṃ, bhante, puggalapaṇṇattīsu."
    ],
    "innerText": "150. ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti puggalapaṇṇattīsu. Sattime, bhante, puggalā. Ubhatobhāgavimutto paññāvimutto kāyasakkhī diṭṭhippatto saddhāvimutto dhammānusārī saddhānusārī. Etadānuttariyaṃ, bhante, puggalapaṇṇattīsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Padhānadesanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "151"
      },
      ". ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ ",
      " deseti padhānesu. Sattime, bhante sambojjhaṅgā satisambojjhaṅgo dhammavicayasambojjhaṅgo vīriyasambojjhaṅgo pītisambojjhaṅgo passaddhisambojjhaṅgo samādhisambojjhaṅgo ",
      " upekkhāsambojjhaṅgo. Etadānuttariyaṃ, bhante, padhānesu."
    ],
    "innerText": "151. ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti padhānesu. Sattime, bhante sambojjhaṅgā satisambojjhaṅgo dhammavicayasambojjhaṅgo vīriyasambojjhaṅgo pītisambojjhaṅgo passaddhisambojjhaṅgo samādhisambojjhaṅgo upekkhāsambojjhaṅgo. Etadānuttariyaṃ, bhante, padhānesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Paṭipadādesanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "152"
      },
      ". ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti paṭipadāsu. Catasso imā, bhante, paṭipadā dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññāti. Tatra, bhante, yāyaṃ paṭipadā dukkhā dandhābhiññā, ayaṃ, bhante, paṭipadā ubhayeneva hīnā akkhāyati dukkhattā ca dandhattā ca. Tatra, bhante, yāyaṃ paṭipadā dukkhā khippābhiññā, ayaṃ pana, bhante, paṭipadā dukkhattā hīnā ",
      " akkhāyati ",
      ". Tatra, bhante, yāyaṃ paṭipadā sukhā dandhābhiññā, ayaṃ pana, bhante, paṭipadā dandhattā hīnā akkhāyati. Tatra, bhante, yāyaṃ paṭipadā sukhā khippābhiññā, ayaṃ pana, bhante, paṭipadā ubhayeneva paṇītā akkhāyati sukhattā ca khippattā ca. Etadānuttariyaṃ, bhante, paṭipadāsu."
    ],
    "innerText": "152. ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti paṭipadāsu. Catasso imā, bhante, paṭipadā dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññāti. Tatra, bhante, yāyaṃ paṭipadā dukkhā dandhābhiññā, ayaṃ, bhante, paṭipadā ubhayeneva hīnā akkhāyati dukkhattā ca dandhattā ca. Tatra, bhante, yāyaṃ paṭipadā dukkhā khippābhiññā, ayaṃ pana, bhante, paṭipadā dukkhattā hīnā akkhāyati . Tatra, bhante, yāyaṃ paṭipadā sukhā dandhābhiññā, ayaṃ pana, bhante, paṭipadā dandhattā hīnā akkhāyati. Tatra, bhante, yāyaṃ paṭipadā sukhā khippābhiññā, ayaṃ pana, bhante, paṭipadā ubhayeneva paṇītā akkhāyati sukhattā ca khippattā ca. Etadānuttariyaṃ, bhante, paṭipadāsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Bhassasamācārādidesanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "153"
      },
      ". ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti bhassasamācāre. Idha, bhante, ekacco na ceva musāvādupasañhitaṃ vācaṃ bhāsati na ca vebhūtiyaṃ na ca pesuṇiyaṃ na ca sārambhajaṃ jayāpekkho; mantā mantā ca vācaṃ bhāsati nidhānavatiṃ kālena. Etadānuttariyaṃ, bhante, bhassasamācāre."
    ],
    "innerText": "153. ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti bhassasamācāre. Idha, bhante, ekacco na ceva musāvādupasañhitaṃ vācaṃ bhāsati na ca vebhūtiyaṃ na ca pesuṇiyaṃ na ca sārambhajaṃ jayāpekkho; mantā mantā ca vācaṃ bhāsati nidhānavatiṃ kālena. Etadānuttariyaṃ, bhante, bhassasamācāre."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti purisasīlasamācāre. Idha, bhante, ekacco sacco cassa saddho ca, na ca kuhako, na ca lapako, na ca nemittiko, na ca nippesiko, na ca lābhena ",
      " lābhaṃ nijigīsanako ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[jijigiṃsanako (syā.), nijigiṃsitā (sī. pī.)]"
      },
      ", indriyesu guttadvāro, bhojane mattaññū, samakārī, jāgariyānuyogamanuyutto, atandito, āraddhavīriyo, jhāyī, satimā, kalyāṇapaṭibhāno, gatimā, dhitimā, matimā, na ca kāmesu giddho, sato ca nipako ca. Etadānuttariyaṃ, bhante, purisasīlasamācāre."
    ],
    "innerText": "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti purisasīlasamācāre. Idha, bhante, ekacco sacco cassa saddho ca, na ca kuhako, na ca lapako, na ca nemittiko, na ca nippesiko, na ca lābhena lābhaṃ nijigīsanako [jijigiṃsanako (syā.), nijigiṃsitā (sī. pī.)], indriyesu guttadvāro, bhojane mattaññū, samakārī, jāgariyānuyogamanuyutto, atandito, āraddhavīriyo, jhāyī, satimā, kalyāṇapaṭibhāno, gatimā, dhitimā, matimā, na ca kāmesu giddho, sato ca nipako ca. Etadānuttariyaṃ, bhante, purisasīlasamācāre."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Anusāsanavidhādesanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "154"
      },
      ". ‘‘Aparaṃ ",
      " pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti anusāsanavidhāsu. Catasso imā bhante anusāsanavidhā – jānāti ",
      ", bhante, bhagavā aparaṃ puggalaṃ paccattaṃ yonisomanasikārā ‘ayaṃ puggalo yathānusiṭṭhaṃ tathā paṭipajjamāno tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpanno bhavissati avinipātadhammo niyato sambodhiparāyaṇo’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo yathānusiṭṭhaṃ tathā paṭipajjamāno tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmī bhavissati, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karissatī’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo yathānusiṭṭhaṃ tathā paṭipajjamāno pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko bhavissati tattha parinibbāyī anāvattidhammo tasmā ",
      " lokā’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo yathānusiṭṭhaṃ tathā paṭipajjamāno āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissatī’ti. Etadānuttariyaṃ, bhante, anusāsanavidhāsu."
    ],
    "innerText": "154. ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti anusāsanavidhāsu. Catasso imā bhante anusāsanavidhā – jānāti , bhante, bhagavā aparaṃ puggalaṃ paccattaṃ yonisomanasikārā ‘ayaṃ puggalo yathānusiṭṭhaṃ tathā paṭipajjamāno tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpanno bhavissati avinipātadhammo niyato sambodhiparāyaṇo’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo yathānusiṭṭhaṃ tathā paṭipajjamāno tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmī bhavissati, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karissatī’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo yathānusiṭṭhaṃ tathā paṭipajjamāno pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko bhavissati tattha parinibbāyī anāvattidhammo tasmā lokā’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo yathānusiṭṭhaṃ tathā paṭipajjamāno āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissatī’ti. Etadānuttariyaṃ, bhante, anusāsanavidhāsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Parapuggalavimuttiñāṇadesanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "155"
      },
      ". ‘‘Aparaṃ ",
      " pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti parapuggalavimuttiñāṇe. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpanno bhavissati avinipātadhammo niyato sambodhiparāyaṇo’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā ",
      " – ‘ayaṃ puggalo tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmī bhavissati, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karissatī’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko bhavissati tattha parinibbāyī anāvattidhammo tasmā lokā’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ ",
      " diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissatī’ti. Etadānuttariyaṃ, bhante, parapuggalavimuttiñāṇe."
    ],
    "innerText": "155. ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti parapuggalavimuttiñāṇe. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpanno bhavissati avinipātadhammo niyato sambodhiparāyaṇo’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmī bhavissati, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karissatī’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko bhavissati tattha parinibbāyī anāvattidhammo tasmā lokā’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissatī’ti. Etadānuttariyaṃ, bhante, parapuggalavimuttiñāṇe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sassatavādadesanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "156"
      },
      ". ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti sassatavādesu. Tayome, bhante, sassatavādā. Idha, bhante, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ, ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekānipi jātisatāni anekānipi jātisahassāni anekānipi jātisatasahassāni, ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī ",
      " evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro ",
      " evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. So evamāha – ‘atītaṃpāhaṃ addhānaṃ jānāmi – saṃvaṭṭi vā loko vivaṭṭi vāti. Anāgataṃpāhaṃ addhānaṃ jānāmi – saṃvaṭṭissati vā loko vivaṭṭissati vāti. Sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito. Te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’nti. Ayaṃ paṭhamo sassatavādo."
    ],
    "innerText": "156. ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti sassatavādesu. Tayome, bhante, sassatavādā. Idha, bhante, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ, ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekānipi jātisatāni anekānipi jātisahassāni anekānipi jātisatasahassāni, ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. So evamāha – ‘atītaṃpāhaṃ addhānaṃ jānāmi – saṃvaṭṭi vā loko vivaṭṭi vāti. Anāgataṃpāhaṃ addhānaṃ jānāmi – saṃvaṭṭissati vā loko vivaṭṭissati vāti. Sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito. Te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’nti. Ayaṃ paṭhamo sassatavādo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhante, idhekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ, ekampi saṃvaṭṭavivaṭṭaṃ dvepi saṃvaṭṭavivaṭṭāni tīṇipi saṃvaṭṭavivaṭṭāni cattāripi saṃvaṭṭavivaṭṭāni pañcapi saṃvaṭṭavivaṭṭāni dasapi saṃvaṭṭavivaṭṭāni, ‘amutrāsiṃ evaṃnāmo evaṃgotto ",
      " evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. So evamāha – ‘atītaṃpāhaṃ addhānaṃ jānāmi saṃvaṭṭi vā loko vivaṭṭi vāti ",
      ". Anāgataṃpāhaṃ addhānaṃ jānāmi ",
      " saṃvaṭṭissati vā loko vivaṭṭissati vāti. Sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito. Te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’nti. Ayaṃ dutiyo sassatavādo."
    ],
    "innerText": "‘‘Puna caparaṃ, bhante, idhekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ, ekampi saṃvaṭṭavivaṭṭaṃ dvepi saṃvaṭṭavivaṭṭāni tīṇipi saṃvaṭṭavivaṭṭāni cattāripi saṃvaṭṭavivaṭṭāni pañcapi saṃvaṭṭavivaṭṭāni dasapi saṃvaṭṭavivaṭṭāni, ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. So evamāha – ‘atītaṃpāhaṃ addhānaṃ jānāmi saṃvaṭṭi vā loko vivaṭṭi vāti . Anāgataṃpāhaṃ addhānaṃ jānāmi saṃvaṭṭissati vā loko vivaṭṭissati vāti. Sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito. Te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’nti. Ayaṃ dutiyo sassatavādo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhante, idhekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ, dasapi saṃvaṭṭavivaṭṭāni vīsampi saṃvaṭṭavivaṭṭāni tiṃsampi saṃvaṭṭavivaṭṭāni cattālīsampi saṃvaṭṭavivaṭṭāni, ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. So evamāha – ‘atītaṃpāhaṃ addhānaṃ jānāmi saṃvaṭṭipi loko vivaṭṭipīti; anāgataṃpāhaṃ addhānaṃ jānāmi saṃvaṭṭissatipi loko vivaṭṭissatipīti. Sassato attā ca loko ca vañjho kūṭaṭṭho ",
      " esikaṭṭhāyiṭṭhito. Te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’nti. Ayaṃ tatiyo sassatavādo, etadānuttariyaṃ, bhante, sassatavādesu."
    ],
    "innerText": "‘‘Puna caparaṃ, bhante, idhekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ, dasapi saṃvaṭṭavivaṭṭāni vīsampi saṃvaṭṭavivaṭṭāni tiṃsampi saṃvaṭṭavivaṭṭāni cattālīsampi saṃvaṭṭavivaṭṭāni, ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. So evamāha – ‘atītaṃpāhaṃ addhānaṃ jānāmi saṃvaṭṭipi loko vivaṭṭipīti; anāgataṃpāhaṃ addhānaṃ jānāmi saṃvaṭṭissatipi loko vivaṭṭissatipīti. Sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito. Te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’nti. Ayaṃ tatiyo sassatavādo, etadānuttariyaṃ, bhante, sassatavādesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pubbenivāsānussatiñāṇadesanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "157"
      },
      ". ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti pubbenivāsānussatiñāṇe. Idha, bhante, ekacco samaṇo vā ",
      " brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ, ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi ",
      " jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe ",
      " anekepi saṃvaṭṭavivaṭṭakappe, ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Santi, bhante, devā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sattā (syā.)]"
      },
      ", yesaṃ na sakkā gaṇanāya vā saṅkhānena vā āyu saṅkhātuṃ. Api ca, yasmiṃ yasmiṃ attabhāve abhinivuṭṭhapubbo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhinivutthapubbo (sī. syā. pī.)]"
      },
      " hoti yadi vā rūpīsu yadi vā arūpīsu yadi vā saññīsu yadi vā asaññīsu yadi vā nevasaññīnāsaññīsu. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Etadānuttariyaṃ, bhante, pubbenivāsānussatiñāṇe."
    ],
    "innerText": "157. ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti pubbenivāsānussatiñāṇe. Idha, bhante, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ, ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe, ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Santi, bhante, devā [sattā (syā.)], yesaṃ na sakkā gaṇanāya vā saṅkhānena vā āyu saṅkhātuṃ. Api ca, yasmiṃ yasmiṃ attabhāve abhinivuṭṭhapubbo [abhinivutthapubbo (sī. syā. pī.)] hoti yadi vā rūpīsu yadi vā arūpīsu yadi vā saññīsu yadi vā asaññīsu yadi vā nevasaññīnāsaññīsu. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Etadānuttariyaṃ, bhante, pubbenivāsānussatiñāṇe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Cutūpapātañāṇadesanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "158"
      },
      ". ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti sattānaṃ cutūpapātañāṇe. Idha, bhante, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate yathākammūpage satte pajānāti – ‘ime ",
      " vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ ",
      " nirayaṃ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ ",
      " maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte ",
      " suvaṇṇe dubbaṇṇe sugate duggate yathākammūpage satte pajānāti. Etadānuttariyaṃ, bhante, sattānaṃ cutūpapātañāṇe."
    ],
    "innerText": "158. ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti sattānaṃ cutūpapātañāṇe. Idha, bhante, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate yathākammūpage satte pajānāti. Etadānuttariyaṃ, bhante, sattānaṃ cutūpapātañāṇe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Iddhividhadesanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "159"
      },
      ". ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti iddhividhāsu. Dvemā, bhante, iddhividhāyo – atthi, bhante, iddhi sāsavā saupadhikā, ‘no ariyā’ti vuccati. Atthi, bhante, iddhi anāsavā anupadhikā ‘ariyā’ti vuccati. ‘‘Katamā ca, bhante, iddhi sāsavā saupadhikā, ‘no ariyā’ti vuccati? Idha, bhante, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ iddhividhaṃ paccanubhoti. Ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṃ tirobhāvaṃ ",
      " tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati seyyathāpi ākāse. Pathaviyāpi ummujjanimujjaṃ karoti, seyyathāpi udake. Udakepi abhijjamāne gacchati, seyyathāpi pathaviyaṃ. Ākāsepi pallaṅkena kamati, seyyathāpi pakkhī sakuṇo. Imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parāmasati parimajjati. Yāva brahmalokāpi kāyena vasaṃ vatteti. Ayaṃ, bhante, iddhi sāsavā saupadhikā, ‘no ariyā’ti vuccati."
    ],
    "innerText": "159. ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti iddhividhāsu. Dvemā, bhante, iddhividhāyo – atthi, bhante, iddhi sāsavā saupadhikā, ‘no ariyā’ti vuccati. Atthi, bhante, iddhi anāsavā anupadhikā ‘ariyā’ti vuccati. ‘‘Katamā ca, bhante, iddhi sāsavā saupadhikā, ‘no ariyā’ti vuccati? Idha, bhante, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ iddhividhaṃ paccanubhoti. Ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṃ tirobhāvaṃ tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati seyyathāpi ākāse. Pathaviyāpi ummujjanimujjaṃ karoti, seyyathāpi udake. Udakepi abhijjamāne gacchati, seyyathāpi pathaviyaṃ. Ākāsepi pallaṅkena kamati, seyyathāpi pakkhī sakuṇo. Imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parāmasati parimajjati. Yāva brahmalokāpi kāyena vasaṃ vatteti. Ayaṃ, bhante, iddhi sāsavā saupadhikā, ‘no ariyā’ti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā pana, bhante, iddhi anāsavā anupadhikā, ‘ariyā’ti vuccati? Idha, bhante, bhikkhu sace ākaṅkhati – ‘paṭikūle appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘appaṭikūle paṭikūlasaññī ",
      " vihareyya’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūle ca appaṭikūle ca appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūle ca appaṭikūle ca paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūlañca appaṭikūlañca tadubhayaṃ abhinivajjetvā upekkhako vihareyyaṃ sato sampajāno’ti, upekkhako tattha viharati sato sampajāno. Ayaṃ, bhante, iddhi anāsavā anupadhikā ‘ariyā’ti vuccati. Etadānuttariyaṃ, bhante, iddhividhāsu ",
      ". Taṃ bhagavā asesamabhijānāti, taṃ bhagavato asesamabhijānato uttari abhiññeyyaṃ natthi, yadabhijānaṃ añño samaṇo ",
      " vā brāhmaṇo vā bhagavatā bhiyyobhiññataro assa yadidaṃ iddhividhāsu."
    ],
    "innerText": "‘‘Katamā pana, bhante, iddhi anāsavā anupadhikā, ‘ariyā’ti vuccati? Idha, bhante, bhikkhu sace ākaṅkhati – ‘paṭikūle appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘appaṭikūle paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūle ca appaṭikūle ca appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūle ca appaṭikūle ca paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūlañca appaṭikūlañca tadubhayaṃ abhinivajjetvā upekkhako vihareyyaṃ sato sampajāno’ti, upekkhako tattha viharati sato sampajāno. Ayaṃ, bhante, iddhi anāsavā anupadhikā ‘ariyā’ti vuccati. Etadānuttariyaṃ, bhante, iddhividhāsu . Taṃ bhagavā asesamabhijānāti, taṃ bhagavato asesamabhijānato uttari abhiññeyyaṃ natthi, yadabhijānaṃ añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro assa yadidaṃ iddhividhāsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Aññathāsatthuguṇadassanaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "160"
      },
      ". ‘‘Yaṃ ",
      " taṃ, bhante, saddhena kulaputtena pattabbaṃ āraddhavīriyena thāmavatā purisathāmena purisavīriyena purisaparakkamena purisadhorayhena, anuppattaṃ taṃ bhagavatā. Na ca, bhante, bhagavā kāmesu kāmasukhallikānuyogamanuyutto hīnaṃ gammaṃ pothujjanikaṃ anariyaṃ anatthasaṃhitaṃ, na ca attakilamathānuyogamanuyutto dukkhaṃ anariyaṃ anatthasaṃhitaṃ. Catunnañca bhagavā jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī."
    ],
    "innerText": "160. ‘‘Yaṃ taṃ, bhante, saddhena kulaputtena pattabbaṃ āraddhavīriyena thāmavatā purisathāmena purisavīriyena purisaparakkamena purisadhorayhena, anuppattaṃ taṃ bhagavatā. Na ca, bhante, bhagavā kāmesu kāmasukhallikānuyogamanuyutto hīnaṃ gammaṃ pothujjanikaṃ anariyaṃ anatthasaṃhitaṃ, na ca attakilamathānuyogamanuyutto dukkhaṃ anariyaṃ anatthasaṃhitaṃ. Catunnañca bhagavā jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Anuyogadānappakāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "161"
      },
      ". ‘‘Sace maṃ, bhante, evaṃ puccheyya – ‘kiṃ nu kho, āvuso sāriputta, ahesuṃ atītamaddhānaṃ aññe samaṇā vā brāhmaṇā vā bhagavatā bhiyyobhiññatarā sambodhiya’nti, evaṃ puṭṭho ahaṃ, bhante, ‘no’ti vadeyyaṃ. ‘Kiṃ panāvuso sāriputta, bhavissanti anāgatamaddhānaṃ aññe samaṇā vā brāhmaṇā vā bhagavatā bhiyyobhiññatarā sambodhiya’nti, evaṃ puṭṭho ahaṃ, bhante, ‘no’ti vadeyyaṃ ",
      ". ‘Kiṃ panāvuso sāriputta, atthetarahi añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro sambodhiya’nti, evaṃ puṭṭho ahaṃ, bhante, ‘no’ti vadeyyaṃ."
    ],
    "innerText": "161. ‘‘Sace maṃ, bhante, evaṃ puccheyya – ‘kiṃ nu kho, āvuso sāriputta, ahesuṃ atītamaddhānaṃ aññe samaṇā vā brāhmaṇā vā bhagavatā bhiyyobhiññatarā sambodhiya’nti, evaṃ puṭṭho ahaṃ, bhante, ‘no’ti vadeyyaṃ. ‘Kiṃ panāvuso sāriputta, bhavissanti anāgatamaddhānaṃ aññe samaṇā vā brāhmaṇā vā bhagavatā bhiyyobhiññatarā sambodhiya’nti, evaṃ puṭṭho ahaṃ, bhante, ‘no’ti vadeyyaṃ . ‘Kiṃ panāvuso sāriputta, atthetarahi añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro sambodhiya’nti, evaṃ puṭṭho ahaṃ, bhante, ‘no’ti vadeyyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace pana maṃ, bhante, evaṃ puccheyya – ‘kiṃ nu kho, āvuso sāriputta, ahesuṃ atītamaddhānaṃ aññe samaṇā vā brāhmaṇā vā bhagavatā samasamā sambodhiya’nti, evaṃ puṭṭho ahaṃ, bhante, ‘eva’nti vadeyyaṃ. ‘Kiṃ panāvuso sāriputta, bhavissanti anāgatamaddhānaṃ aññe samaṇā vā brāhmaṇā vā bhagavatā samasamā sambodhiya’nti, evaṃ puṭṭho ahaṃ, bhante, ‘‘eva’’nti vadeyyaṃ ",
      ". ‘Kiṃ panāvuso sāriputta, atthetarahi aññe samaṇā vā brāhmaṇā vā bhagavatā samasamā sambodhiya’nti, evaṃ puṭṭho ahaṃ bhante ‘no’ti vadeyyaṃ."
    ],
    "innerText": "‘‘Sace pana maṃ, bhante, evaṃ puccheyya – ‘kiṃ nu kho, āvuso sāriputta, ahesuṃ atītamaddhānaṃ aññe samaṇā vā brāhmaṇā vā bhagavatā samasamā sambodhiya’nti, evaṃ puṭṭho ahaṃ, bhante, ‘eva’nti vadeyyaṃ. ‘Kiṃ panāvuso sāriputta, bhavissanti anāgatamaddhānaṃ aññe samaṇā vā brāhmaṇā vā bhagavatā samasamā sambodhiya’nti, evaṃ puṭṭho ahaṃ, bhante, ‘‘eva’’nti vadeyyaṃ . ‘Kiṃ panāvuso sāriputta, atthetarahi aññe samaṇā vā brāhmaṇā vā bhagavatā samasamā sambodhiya’nti, evaṃ puṭṭho ahaṃ bhante ‘no’ti vadeyyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace pana maṃ, bhante, evaṃ puccheyya – ‘kiṃ panāyasmā sāriputto ekaccaṃ abbhanujānāti ",
      ", ekaccaṃ na abbhanujānātī’ti, evaṃ puṭṭho ahaṃ, bhante, evaṃ byākareyyaṃ ",
      " – ‘sammukhā metaṃ, āvuso, bhagavato sutaṃ, sammukhā paṭiggahitaṃ – ‘‘ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā mayā samasamā sambodhiya’’nti. Sammukhā metaṃ, āvuso, bhagavato sutaṃ, sammukhā paṭiggahitaṃ – ‘‘bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā mayā samasamā sambodhiya’’nti. Sammukhā metaṃ, āvuso, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘‘aṭṭhānametaṃ anavakāso yaṃ ekissā lokadhātuyā dve arahanto sammāsambuddhā apubbaṃ acarimaṃ uppajjeyyuṃ, netaṃ ṭhānaṃ vijjatī’’’ti."
    ],
    "innerText": "‘‘Sace pana maṃ, bhante, evaṃ puccheyya – ‘kiṃ panāyasmā sāriputto ekaccaṃ abbhanujānāti , ekaccaṃ na abbhanujānātī’ti, evaṃ puṭṭho ahaṃ, bhante, evaṃ byākareyyaṃ – ‘sammukhā metaṃ, āvuso, bhagavato sutaṃ, sammukhā paṭiggahitaṃ – ‘‘ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā mayā samasamā sambodhiya’’nti. Sammukhā metaṃ, āvuso, bhagavato sutaṃ, sammukhā paṭiggahitaṃ – ‘‘bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā mayā samasamā sambodhiya’’nti. Sammukhā metaṃ, āvuso, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘‘aṭṭhānametaṃ anavakāso yaṃ ekissā lokadhātuyā dve arahanto sammāsambuddhā apubbaṃ acarimaṃ uppajjeyyuṃ, netaṃ ṭhānaṃ vijjatī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kaccāhaṃ, bhante, evaṃ ",
      " puṭṭho evaṃ byākaramāno vuttavādī ceva bhagavato homi, na ca bhagavantaṃ abhūtena abbhācikkhāmi, dhammassa cānudhammaṃ byākaromi, na ca koci sahadhammiko vādānuvādo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vādānupāto (sī.)]"
      },
      " gārayhaṃ ṭhānaṃ āgacchatī’’ti? ‘‘Taggha tvaṃ, sāriputta, evaṃ puṭṭho evaṃ byākaramāno vuttavādī ceva me hosi, na ca maṃ abhūtena abbhācikkhasi, dhammassa cānudhammaṃ byākarosi, na ca koci sahadhammiko vādānuvādo gārayhaṃ ṭhānaṃ āgacchatī’’ti."
    ],
    "innerText": "‘‘Kaccāhaṃ, bhante, evaṃ puṭṭho evaṃ byākaramāno vuttavādī ceva bhagavato homi, na ca bhagavantaṃ abhūtena abbhācikkhāmi, dhammassa cānudhammaṃ byākaromi, na ca koci sahadhammiko vādānuvādo [vādānupāto (sī.)] gārayhaṃ ṭhānaṃ āgacchatī’’ti? ‘‘Taggha tvaṃ, sāriputta, evaṃ puṭṭho evaṃ byākaramāno vuttavādī ceva me hosi, na ca maṃ abhūtena abbhācikkhasi, dhammassa cānudhammaṃ byākarosi, na ca koci sahadhammiko vādānuvādo gārayhaṃ ṭhānaṃ āgacchatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Acchariyaabbhutaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "162"
      },
      ". Evaṃ ",
      " vutte, āyasmā udāyī bhagavantaṃ etadavoca – ‘‘acchariyaṃ, bhante, abbhutaṃ, bhante, tathāgatassa appicchatā santuṭṭhitā sallekhatā. Yatra hi nāma tathāgato evaṃmahiddhiko evaṃmahānubhāvo, atha ca pana nevattānaṃ pātukarissati! Ekamekañcepi ito, bhante, dhammaṃ aññatitthiyā paribbājakā attani samanupasseyyuṃ, te tāvatakeneva paṭākaṃ parihareyyuṃ. Acchariyaṃ, bhante, abbhutaṃ, bhante, tathāgatassa appicchatā santuṭṭhitā sallekhatā. Yatra hi nāma tathāgato evaṃ mahiddhiko evaṃmahānubhāvo. Atha ca pana nevattānaṃ pātukarissatī’’ti!"
    ],
    "innerText": "162. Evaṃ vutte, āyasmā udāyī bhagavantaṃ etadavoca – ‘‘acchariyaṃ, bhante, abbhutaṃ, bhante, tathāgatassa appicchatā santuṭṭhitā sallekhatā. Yatra hi nāma tathāgato evaṃmahiddhiko evaṃmahānubhāvo, atha ca pana nevattānaṃ pātukarissati! Ekamekañcepi ito, bhante, dhammaṃ aññatitthiyā paribbājakā attani samanupasseyyuṃ, te tāvatakeneva paṭākaṃ parihareyyuṃ. Acchariyaṃ, bhante, abbhutaṃ, bhante, tathāgatassa appicchatā santuṭṭhitā sallekhatā. Yatra hi nāma tathāgato evaṃ mahiddhiko evaṃmahānubhāvo. Atha ca pana nevattānaṃ pātukarissatī’’ti!"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Passa kho tvaṃ, udāyi, ‘tathāgatassa appicchatā santuṭṭhitā sallekhatā. Yatra hi nāma tathāgato evaṃmahiddhiko evaṃmahānubhāvo, atha ca pana nevattānaṃ pātukarissati’! Ekamekañcepi ito, udāyi, dhammaṃ aññatitthiyā paribbājakā attani samanupasseyyuṃ, te tāvatakeneva paṭākaṃ ",
      " parihareyyuṃ. Passa kho tvaṃ, udāyi, ‘tathāgatassa appicchatā santuṭṭhitā sallekhatā. Yatra hi nāma tathāgato evaṃmahiddhiko evaṃmahānubhāvo, atha ca pana nevattānaṃ pātukarissatī’’’ti!"
    ],
    "innerText": "‘‘Passa kho tvaṃ, udāyi, ‘tathāgatassa appicchatā santuṭṭhitā sallekhatā. Yatra hi nāma tathāgato evaṃmahiddhiko evaṃmahānubhāvo, atha ca pana nevattānaṃ pātukarissati’! Ekamekañcepi ito, udāyi, dhammaṃ aññatitthiyā paribbājakā attani samanupasseyyuṃ, te tāvatakeneva paṭākaṃ parihareyyuṃ. Passa kho tvaṃ, udāyi, ‘tathāgatassa appicchatā santuṭṭhitā sallekhatā. Yatra hi nāma tathāgato evaṃmahiddhiko evaṃmahānubhāvo, atha ca pana nevattānaṃ pātukarissatī’’’ti!"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "163"
      },
      ". Atha ",
      " kho bhagavā āyasmantaṃ sāriputtaṃ āmantesi – ‘‘tasmā tiha tvaṃ, sāriputta, imaṃ dhammapariyāyaṃ abhikkhaṇaṃ bhāseyyāsi bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ. Yesampi hi, sāriputta, moghapurisānaṃ bhavissati tathāgate kaṅkhā vā vimati vā, tesamimaṃ dhammapariyāyaṃ sutvā tathāgate kaṅkhā vā vimati vā, sā pahīyissatī’’ti. Iti hidaṃ āyasmā sāriputto ",
      " bhagavato sammukhā sampasādaṃ pavedesi. Tasmā imassa veyyākaraṇassa sampasādanīyaṃ tveva adhivacananti."
    ],
    "innerText": "163. Atha kho bhagavā āyasmantaṃ sāriputtaṃ āmantesi – ‘‘tasmā tiha tvaṃ, sāriputta, imaṃ dhammapariyāyaṃ abhikkhaṇaṃ bhāseyyāsi bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ. Yesampi hi, sāriputta, moghapurisānaṃ bhavissati tathāgate kaṅkhā vā vimati vā, tesamimaṃ dhammapariyāyaṃ sutvā tathāgate kaṅkhā vā vimati vā, sā pahīyissatī’’ti. Iti hidaṃ āyasmā sāriputto bhagavato sammukhā sampasādaṃ pavedesi. Tasmā imassa veyyākaraṇassa sampasādanīyaṃ tveva adhivacananti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sampasādanīyasuttaṃ niṭṭhitaṃ pañcamaṃ."
  }
]