[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "6. Mahālisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Brāhmaṇadūtavatthuvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "359"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me sutaṃ – ekaṃ samayaṃ bhagavā vesāliya"
      },
      "nti mahālisuttaṃ. Tatrāyaṃ apubbapadavaṇṇanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vesāliya"
      },
      "nti punappunaṃ visālabhāvūpagamanato vesālīti laddhanāmake nagare. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāvane"
      },
      "ti bahinagare himavantena saddhiṃ ekābaddhaṃ hutvā ṭhitaṃ sayaṃ jātavanaṃ atthi, yaṃ mahantabhāveneva mahāvananti vuccati, tasmiṃ mahāvane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kūṭāgārasālāya"
      },
      "nti tasmiṃ vanasaṇḍe saṅghārāmaṃ patiṭṭhapesuṃ. Tattha kaṇṇikaṃ yojetvā thambhānaṃ upari kūṭāgārasālāsaṅkhepena devavimānasadisaṃ pāsādaṃ akaṃsu, taṃ upādāya sakalopi saṅghārāmo ‘‘kūṭāgārasālā’’ti paññāyittha. Bhagavā taṃ vesāliṃ upanissāya tasmiṃ saṅghārāme viharati. Tena vuttaṃ – ‘‘vesāliyaṃ viharati mahāvane kūṭāgārasālāya’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kosalakā"
      },
      "ti kosalaraṭṭhavāsino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Māgadhakā"
      },
      "ti magadharaṭṭhavāsino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Karaṇīyenā"
      },
      "ti avassaṃ kattabbakammena. Yañhi akātumpi vaṭṭati, taṃ kiccanti vuccati, yaṃ avassaṃ kātabbameva, taṃ karaṇīyaṃ nāma."
    ],
    "innerText": "359.Evaṃme sutaṃ – ekaṃ samayaṃ bhagavā vesāliyanti mahālisuttaṃ. Tatrāyaṃ apubbapadavaṇṇanā. Vesāliyanti punappunaṃ visālabhāvūpagamanato vesālīti laddhanāmake nagare. Mahāvaneti bahinagare himavantena saddhiṃ ekābaddhaṃ hutvā ṭhitaṃ sayaṃ jātavanaṃ atthi, yaṃ mahantabhāveneva mahāvananti vuccati, tasmiṃ mahāvane. Kūṭāgārasālāyanti tasmiṃ vanasaṇḍe saṅghārāmaṃ patiṭṭhapesuṃ. Tattha kaṇṇikaṃ yojetvā thambhānaṃ upari kūṭāgārasālāsaṅkhepena devavimānasadisaṃ pāsādaṃ akaṃsu, taṃ upādāya sakalopi saṅghārāmo ‘‘kūṭāgārasālā’’ti paññāyittha. Bhagavā taṃ vesāliṃ upanissāya tasmiṃ saṅghārāme viharati. Tena vuttaṃ – ‘‘vesāliyaṃ viharati mahāvane kūṭāgārasālāya’’nti. Kosalakāti kosalaraṭṭhavāsino. Māgadhakāti magadharaṭṭhavāsino. Karaṇīyenāti avassaṃ kattabbakammena. Yañhi akātumpi vaṭṭati, taṃ kiccanti vuccati, yaṃ avassaṃ kātabbameva, taṃ karaṇīyaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "360"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisallīno bhagavā"
      },
      "ti nānārammaṇacārato paṭikkamma sallīno nilīno, ekībhāvaṃ upagamma ekattārammaṇe jhānaratiṃ anubhavatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthevā"
      },
      "ti tasmiññeva vihāre. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekamanta"
      },
      "nti ",
      " tasmā ṭhānā apakkamma tāsu tāsu rukkhacchāyāsu nisīdiṃsu."
    ],
    "innerText": "360.Paṭisallīno bhagavāti nānārammaṇacārato paṭikkamma sallīno nilīno, ekībhāvaṃ upagamma ekattārammaṇe jhānaratiṃ anubhavatīti attho. Tatthevāti tasmiññeva vihāre. Ekamantanti tasmā ṭhānā apakkamma tāsu tāsu rukkhacchāyāsu nisīdiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Oṭṭhaddhalicchavīvatthuvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "361"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Oṭṭhaddho"
      },
      "ti addhoṭṭhatāya evaṃladdhanāmo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahatiyā licchavīparisāyā"
      },
      "ti purebhattaṃ buddhappamukhassa bhikkhusaṅghassa dānaṃ datvā bhagavato santike uposathaṅgāni adhiṭṭhahitvā gandhamālādīni gāhāpetvā ugghosanāya mahatiṃ licchavirājaparisaṃ sannipātāpetvā tāya nīlapītādivaṇṇavatthābharaṇavilepanapaṭimaṇḍitāya ",
      " tāvatiṃsaparisasappaṭibhāgāya mahatiyā licchaviparisāya saddhiṃ upasaṅkami. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akālo kho mahālī"
      },
      "ti ",
      " tassa oṭṭhaddhassa mahālīti mūlanāmaṃ, tena mūlanāmamattena naṃ thero mahālīti ālapati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekamantaṃ nisīdī"
      },
      "ti patirūpāsu rukkhacchāyāsu tāya licchaviparisāya saddhiṃ ratanattayassa vaṇṇaṃ kathayanto nisīdi."
    ],
    "innerText": "361.Oṭṭhaddhoti addhoṭṭhatāya evaṃladdhanāmo. Mahatiyā licchavīparisāyāti purebhattaṃ buddhappamukhassa bhikkhusaṅghassa dānaṃ datvā bhagavato santike uposathaṅgāni adhiṭṭhahitvā gandhamālādīni gāhāpetvā ugghosanāya mahatiṃ licchavirājaparisaṃ sannipātāpetvā tāya nīlapītādivaṇṇavatthābharaṇavilepanapaṭimaṇḍitāya tāvatiṃsaparisasappaṭibhāgāya mahatiyā licchaviparisāya saddhiṃ upasaṅkami. Akālo kho mahālīti tassa oṭṭhaddhassa mahālīti mūlanāmaṃ, tena mūlanāmamattena naṃ thero mahālīti ālapati. Ekamantaṃ nisīdīti patirūpāsu rukkhacchāyāsu tāya licchaviparisāya saddhiṃ ratanattayassa vaṇṇaṃ kathayanto nisīdi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "362"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīho samaṇuddeso"
      },
      "ti āyasmato nāgitassa bhāgineyyo sattavassakāle pabbajitvā sāsane yuttapayutto ‘‘sīho’’ti evaṃnāmako sāmaṇero, so kira taṃ mahāparisaṃ disvā – ‘‘ayaṃ parisā mahatī, sakalaṃ vihāraṃ pūretvā nisinnā, addhā bhagavā ajja imissā parisāya mahantena ussāhena dhammaṃ desessati, yaṃnūnāhaṃ upajjhāyassācikkhitvā bhagavato mahāparisāya sannipatitabhāvaṃ ārocāpeyya’’nti cintetvā yenāyasmā nāgito tenupasaṅkami. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhante kassapā"
      },
      "ti theraṃ gottena ālapati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Esā janatā"
      },
      "ti eso janasamūho."
    ],
    "innerText": "362.Sīho samaṇuddesoti āyasmato nāgitassa bhāgineyyo sattavassakāle pabbajitvā sāsane yuttapayutto ‘‘sīho’’ti evaṃnāmako sāmaṇero, so kira taṃ mahāparisaṃ disvā – ‘‘ayaṃ parisā mahatī, sakalaṃ vihāraṃ pūretvā nisinnā, addhā bhagavā ajja imissā parisāya mahantena ussāhena dhammaṃ desessati, yaṃnūnāhaṃ upajjhāyassācikkhitvā bhagavato mahāparisāya sannipatitabhāvaṃ ārocāpeyya’’nti cintetvā yenāyasmā nāgito tenupasaṅkami. Bhante kassapāti theraṃ gottena ālapati. Esā janatāti eso janasamūho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tvaññeva bhagavato ārocehī"
      },
      "ti sīho kira bhagavato vissāsiko, ayañhi thero thūlasarīro, tenassa sarīragarutāya uṭṭhānanisajjādīsu ālasiyabhāvo īsakaṃ appahīno viya hoti. Athāyaṃ sāmaṇero bhagavato kālena kālaṃ vattaṃ karoti. Tena naṃ thero ‘‘tvampi dasabalassa vissāsiko’’ti vatvā gaccha tvaññevārocehīti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vihārapacchāyāya"
      },
      "nti vihārachāyāyaṃ, kūṭāgāramahāgehacchāyāya pharitokāseti attho. Sā kira kūṭāgārasālā dakkhiṇuttarato ",
      " dīghā pācīnamukhā, tenassā purato mahatī chāyā patthaṭā hoti, sīho tattha bhagavato āsanaṃ paññapesi."
    ],
    "innerText": "Tvaññeva bhagavato ārocehīti sīho kira bhagavato vissāsiko, ayañhi thero thūlasarīro, tenassa sarīragarutāya uṭṭhānanisajjādīsu ālasiyabhāvo īsakaṃ appahīno viya hoti. Athāyaṃ sāmaṇero bhagavato kālena kālaṃ vattaṃ karoti. Tena naṃ thero ‘‘tvampi dasabalassa vissāsiko’’ti vatvā gaccha tvaññevārocehīti āha. Vihārapacchāyāyanti vihārachāyāyaṃ, kūṭāgāramahāgehacchāyāya pharitokāseti attho. Sā kira kūṭāgārasālā dakkhiṇuttarato dīghā pācīnamukhā, tenassā purato mahatī chāyā patthaṭā hoti, sīho tattha bhagavato āsanaṃ paññapesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "363"
      },
      ". Atha kho bhagavā dvārantarehi ceva vātapānantarehi ca nikkhamitvā vidhāvantāhi vippharantīhi chabbaṇṇāhi buddharasmīhi saṃsūcitanikkhamano valāhakantarato puṇṇacando viya kūṭāgārasālato nikkhamitvā paññattavarabuddhāsane nisīdi. Tena vuttaṃ – ‘‘atha kho bhagavā vihārā nikkhamma vihārapacchāyāya paññatte āsane nisīdī’’ti."
    ],
    "innerText": "363. Atha kho bhagavā dvārantarehi ceva vātapānantarehi ca nikkhamitvā vidhāvantāhi vippharantīhi chabbaṇṇāhi buddharasmīhi saṃsūcitanikkhamano valāhakantarato puṇṇacando viya kūṭāgārasālato nikkhamitvā paññattavarabuddhāsane nisīdi. Tena vuttaṃ – ‘‘atha kho bhagavā vihārā nikkhamma vihārapacchāyāya paññatte āsane nisīdī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "364-365"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purimāni"
      },
      ", ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhante, divasāni purimatarānī"
      },
      "ti ettha hiyyo divasaṃ purimaṃ nāma, tato paraṃ purimataraṃ. Tato paṭṭhāya pana sabbāni purimāni ceva purimatarāni ca honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadagge"
      },
      "ti mūladivasato paṭṭhāya yaṃ divasaṃ aggaṃ parakoṭiṃ katvā viharāmīti attho, yāva vihāsinti vuttaṃ hoti. Idāni tassa parimāṇaṃ dassento ‘‘naciraṃ tīṇi vassānī’’ti āha. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yadagge"
      },
      "ti yaṃ divasaṃ aggaṃ katvā naciraṃ tīṇi vassāni viharāmītipi attho ",
      ". Yaṃ divasaṃ ādiṃ katvā naciraṃ vihāsiṃ tīṇiyeva vassānīti vuttaṃ hoti. Ayaṃ kira bhagavato pattacīvaraṃ gaṇhanto tīṇi saṃvaccharāni bhagavantaṃ upaṭṭhāsi, taṃ sandhāya evaṃ vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piyarūpānī"
      },
      "ti piyajātikāni sātajātikāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmūpasaṃhitānī"
      },
      "ti kāmassādayuttāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rajanīyānī"
      },
      "ti rāgajanakāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "No ca kho dibbāni saddānī"
      },
      "ti kasmā sunakkhatto tāni na suṇāti? So kira bhagavantaṃ upasaṅkamitvā dibbacakkhuparikammaṃ yāci, tassa bhagavā ācikkhi, so yathānusiṭṭhaṃ paṭipanno dibbacakkhuṃ uppādetvā devatānaṃ rūpāni disvā cintesi ‘‘imasmiṃ sarīrasaṇṭhāne saddena madhurena bhavitabbaṃ, kathaṃ nu kho naṃ suṇeyya’’nti bhagavantaṃ upasaṅkamitvā dibbasotaparikammaṃ pucchi. Ayañca atīte ekaṃ sīlavantaṃ bhikkhuṃ kaṇṇasakkhaliyaṃ paharitvā ",
      " badhiramakāsi. Tasmā parikammaṃ karontopi abhabbo dibbasotādhigamāya. Tenassa na bhagavā parikammaṃ kathesi. So ettāvatā bhagavati āghātaṃ bandhitvā cintesi – ‘‘addhā samaṇassa gotamassa evaṃ hoti – ‘ahampi khattiyo ayampi khattiyo, sacassa ñāṇaṃ vaḍḍhissati, ayampi sabbaññū bhavissatī’ti usūyāya mayhaṃ na kathesī’’ti. So anukkamena gihibhāvaṃ patvā tamatthaṃ mahālilicchavino kathento evamāha."
    ],
    "innerText": "364-365.Purimāni, bhante, divasāni purimatarānīti ettha hiyyo divasaṃ purimaṃ nāma, tato paraṃ purimataraṃ. Tato paṭṭhāya pana sabbāni purimāni ceva purimatarāni ca honti. Yadaggeti mūladivasato paṭṭhāya yaṃ divasaṃ aggaṃ parakoṭiṃ katvā viharāmīti attho, yāva vihāsinti vuttaṃ hoti. Idāni tassa parimāṇaṃ dassento ‘‘naciraṃ tīṇi vassānī’’ti āha. Atha vā yadaggeti yaṃ divasaṃ aggaṃ katvā naciraṃ tīṇi vassāni viharāmītipi attho . Yaṃ divasaṃ ādiṃ katvā naciraṃ vihāsiṃ tīṇiyeva vassānīti vuttaṃ hoti. Ayaṃ kira bhagavato pattacīvaraṃ gaṇhanto tīṇi saṃvaccharāni bhagavantaṃ upaṭṭhāsi, taṃ sandhāya evaṃ vadati. Piyarūpānīti piyajātikāni sātajātikāni. Kāmūpasaṃhitānīti kāmassādayuttāni. Rajanīyānīti rāgajanakāni. No ca kho dibbāni saddānīti kasmā sunakkhatto tāni na suṇāti? So kira bhagavantaṃ upasaṅkamitvā dibbacakkhuparikammaṃ yāci, tassa bhagavā ācikkhi, so yathānusiṭṭhaṃ paṭipanno dibbacakkhuṃ uppādetvā devatānaṃ rūpāni disvā cintesi ‘‘imasmiṃ sarīrasaṇṭhāne saddena madhurena bhavitabbaṃ, kathaṃ nu kho naṃ suṇeyya’’nti bhagavantaṃ upasaṅkamitvā dibbasotaparikammaṃ pucchi. Ayañca atīte ekaṃ sīlavantaṃ bhikkhuṃ kaṇṇasakkhaliyaṃ paharitvā badhiramakāsi. Tasmā parikammaṃ karontopi abhabbo dibbasotādhigamāya. Tenassa na bhagavā parikammaṃ kathesi. So ettāvatā bhagavati āghātaṃ bandhitvā cintesi – ‘‘addhā samaṇassa gotamassa evaṃ hoti – ‘ahampi khattiyo ayampi khattiyo, sacassa ñāṇaṃ vaḍḍhissati, ayampi sabbaññū bhavissatī’ti usūyāya mayhaṃ na kathesī’’ti. So anukkamena gihibhāvaṃ patvā tamatthaṃ mahālilicchavino kathento evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "366-371"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekaṃsabhāvito"
      },
      "ti ekaṃsāya ekakoṭṭhāsāya bhāvito, dibbānaṃ vā rūpānaṃ dassanatthāya dibbānaṃ vā saddānaṃ savanatthāya bhāvitoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiriya"
      },
      "nti anudisāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubhayaṃsabhāvito"
      },
      "ti ubhayaṃsāya ubhayakoṭṭhāsāya bhāvitoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ kho mahāli hetū"
      },
      "ti ayaṃ dibbānaṃyeva rūpānaṃ dassanāya ekaṃsabhāvito samādhi hetu. Imamatthaṃ sutvā so licchavī cintesi – ‘‘idaṃ dibbasotena saddasuṇanaṃ imasmiṃ sāsane uttamatthabhūtaṃ maññe imassa nūna atthāya ete ",
      " bhikkhū paññāsampi saṭṭhipi vassāni apaṇṇakaṃ brahmacariyaṃ caranti, yaṃnūnāhaṃ dasabalaṃ etamatthaṃ puccheyya’’nti."
    ],
    "innerText": "366-371.Ekaṃsabhāvitoti ekaṃsāya ekakoṭṭhāsāya bhāvito, dibbānaṃ vā rūpānaṃ dassanatthāya dibbānaṃ vā saddānaṃ savanatthāya bhāvitoti attho. Tiriyanti anudisāya. Ubhayaṃsabhāvitoti ubhayaṃsāya ubhayakoṭṭhāsāya bhāvitoti attho. Ayaṃ kho mahāli hetūti ayaṃ dibbānaṃyeva rūpānaṃ dassanāya ekaṃsabhāvito samādhi hetu. Imamatthaṃ sutvā so licchavī cintesi – ‘‘idaṃ dibbasotena saddasuṇanaṃ imasmiṃ sāsane uttamatthabhūtaṃ maññe imassa nūna atthāya ete bhikkhū paññāsampi saṭṭhipi vassāni apaṇṇakaṃ brahmacariyaṃ caranti, yaṃnūnāhaṃ dasabalaṃ etamatthaṃ puccheyya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "372"
      },
      ". Tato tamatthaṃ pucchanto ‘‘etāsaṃ nūna, bhante’’tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādhibhāvanāna"
      },
      "nti ettha samādhiyeva samādhibhāvanā, ubhayaṃsabhāvitānaṃ samādhīnanti attho. Atha yasmā sāsanato bāhirā etā samādhibhāvanā, na ajjhattikā. Tasmā tā paṭikkhipitvā yadatthaṃ bhikkhū brahmacariyaṃ caranti, taṃ dassento bhagavā ‘‘na kho mahālī’’tiādimāha."
    ],
    "innerText": "372. Tato tamatthaṃ pucchanto ‘‘etāsaṃ nūna, bhante’’tiādimāha. Samādhibhāvanānanti ettha samādhiyeva samādhibhāvanā, ubhayaṃsabhāvitānaṃ samādhīnanti attho. Atha yasmā sāsanato bāhirā etā samādhibhāvanā, na ajjhattikā. Tasmā tā paṭikkhipitvā yadatthaṃ bhikkhū brahmacariyaṃ caranti, taṃ dassento bhagavā ‘‘na kho mahālī’’tiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Catuariyaphalavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "373"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiṇṇaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃyojanāna"
      },
      "nti sakkāyadiṭṭhiādīnaṃ tiṇṇaṃ bandhanānaṃ. Tāni hi vaṭṭadukkhamaye rathe satte saṃyojenti, tasmā saṃyojanānīti vuccanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sotāpanno"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hotī"
      },
      "ti maggasotaṃ āpanno hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avinipātadhammo"
      },
      "ti catūsu apāyesu apatanadhammo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niyato"
      },
      "ti dhammaniyāmena niyato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sambodhiparāyaṇo"
      },
      "ti uparimaggattayasaṅkhātā sambodhi paraṃ ayanaṃ assa, anena vā pattabbāti sambodhiparāyaṇo."
    ],
    "innerText": "373.Tiṇṇaṃsaṃyojanānanti sakkāyadiṭṭhiādīnaṃ tiṇṇaṃ bandhanānaṃ. Tāni hi vaṭṭadukkhamaye rathe satte saṃyojenti, tasmā saṃyojanānīti vuccanti. Sotāpannohotīti maggasotaṃ āpanno hoti. Avinipātadhammoti catūsu apāyesu apatanadhammo. Niyatoti dhammaniyāmena niyato. Sambodhiparāyaṇoti uparimaggattayasaṅkhātā sambodhi paraṃ ayanaṃ assa, anena vā pattabbāti sambodhiparāyaṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tanuttā"
      },
      "ti pariyuṭṭhānamandatāya ca kadāci karahaci uppattiyā ca tanubhāvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Orambhāgiyāna"
      },
      "nti heṭṭhābhāgiyānaṃ, ye hi baddho upari suddhāvāsabhūmiyaṃ nibbattituṃ na sakkoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Opapātiko"
      },
      "ti sesayonipaṭikkhepavacanametaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tattha parinibbāyī"
      },
      "ti tasmiṃ uparibhaveyeva parinibbānadhammo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāvattidhammo"
      },
      "ti tato brahmalokā puna paṭisandhivasena anāvattanadhammo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cetovimutti"
      },
      "nti cittavisuddhiṃ, sabbakilesabandhanavimuttassa arahattaphalacittassetaṃ adhivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāvimutti"
      },
      "nti etthāpi sabbakilesabandhanavimuttā arahattaphalapaññāva paññāvimuttīti veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭheva dhamme"
      },
      "ti imasmiṃyeva attabhāve. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saya"
      },
      "nti sāmaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhiññā"
      },
      "ti abhijānitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacchikatvā"
      },
      "ti paccakkhaṃ katvā. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhiññā sacchikatvā"
      },
      "ti abhiññāya abhivisiṭṭhena ñāṇena sacchikaritvātipi attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasampajjā"
      },
      "ti patvā paṭilabhitvā. Idaṃ sutvā licchavirājā cintesi – ‘‘ayaṃ pana dhammo na sakuṇena viya uppatitvā, nāpi godhāya viya urena gantvā sakkā paṭivijjhituṃ ",
      ", addhā pana imaṃ paṭivijjhantassa pubbabhāgappaṭipadāya bhavitabbaṃ, pucchāmi tāva na’’nti."
    ],
    "innerText": "Tanuttāti pariyuṭṭhānamandatāya ca kadāci karahaci uppattiyā ca tanubhāvā. Orambhāgiyānanti heṭṭhābhāgiyānaṃ, ye hi baddho upari suddhāvāsabhūmiyaṃ nibbattituṃ na sakkoti. Opapātikoti sesayonipaṭikkhepavacanametaṃ. Tattha parinibbāyīti tasmiṃ uparibhaveyeva parinibbānadhammo. Anāvattidhammoti tato brahmalokā puna paṭisandhivasena anāvattanadhammo. Cetovimuttinti cittavisuddhiṃ, sabbakilesabandhanavimuttassa arahattaphalacittassetaṃ adhivacanaṃ. Paññāvimuttinti etthāpi sabbakilesabandhanavimuttā arahattaphalapaññāva paññāvimuttīti veditabbā. Diṭṭheva dhammeti imasmiṃyeva attabhāve. Sayanti sāmaṃ. Abhiññāti abhijānitvā. Sacchikatvāti paccakkhaṃ katvā. Atha vā abhiññā sacchikatvāti abhiññāya abhivisiṭṭhena ñāṇena sacchikaritvātipi attho. Upasampajjāti patvā paṭilabhitvā. Idaṃ sutvā licchavirājā cintesi – ‘‘ayaṃ pana dhammo na sakuṇena viya uppatitvā, nāpi godhāya viya urena gantvā sakkā paṭivijjhituṃ , addhā pana imaṃ paṭivijjhantassa pubbabhāgappaṭipadāya bhavitabbaṃ, pucchāmi tāva na’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ariyaaṭṭhaṅgikamaggavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "374-375"
      },
      ". Tato bhagavantaṃ pucchanto ‘‘atthi pana bhante’’tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhaṅgiko"
      },
      "ti pañcaṅgikaṃ turiyaṃ viya aṭṭhaṅgiko gāmo viya ca aṭṭhaṅgamattoyeva hutvā aṭṭhaṅgiko, na aṅgato añño maggo nāma atthi. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘seyyathidaṃ, sammādiṭṭhi…pe… sammāsamādhī’’"
      },
      "ti. Tattha ",
      " sammādassanalakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammādiṭṭhi."
      },
      " Sammā abhiniropanalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammāsaṅkappo."
      },
      " Sammā pariggahaṇalakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammāvācā."
      },
      " Sammā samuṭṭhāpanalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammākammanto."
      },
      " Sammā vodāpanalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammāājīvo. "
      },
      " Sammā paggahalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammāvāyāmo."
      },
      " Sammā upaṭṭhānalakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammāsati."
      },
      " Sammā samādhānalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammāsamādhi."
      },
      " Etesu ekekassa tīṇi tīṇi ",
      " kiccāni honti. Seyyathidaṃ, sammādiṭṭhi tāva aññehipi attano paccanīkakilesehi saddhiṃ micchādiṭṭhiṃ pajahati, nirodhaṃ ārammaṇaṃ karoti, sampayuttadhamme ca passati tappaṭicchādakamohavidhamanavasena asammohato. Sammāsaṅkappādayopi tatheva micchāsaṅkappādīni pajahanti, nirodhañca ārammaṇaṃ karonti, visesato panettha sammāsaṅkappo sahajātadhamme abhiniropeti. Sammāvācā sammā pariggaṇhati. Sammākammanto sammā samuṭṭhāpeti. Sammāājīvo sammā vodāpeti. Sammāvāyāmo sammā paggaṇhati. Sammāsati sammā upaṭṭhāpeti. Sammāsamādhi sammā padahati."
    ],
    "innerText": "374-375. Tato bhagavantaṃ pucchanto ‘‘atthi pana bhante’’tiādimāha. Aṭṭhaṅgikoti pañcaṅgikaṃ turiyaṃ viya aṭṭhaṅgiko gāmo viya ca aṭṭhaṅgamattoyeva hutvā aṭṭhaṅgiko, na aṅgato añño maggo nāma atthi. Tenevāha – ‘‘seyyathidaṃ, sammādiṭṭhi…pe… sammāsamādhī’’ti. Tattha sammādassanalakkhaṇā sammādiṭṭhi. Sammā abhiniropanalakkhaṇo sammāsaṅkappo. Sammā pariggahaṇalakkhaṇā sammāvācā. Sammā samuṭṭhāpanalakkhaṇo sammākammanto. Sammā vodāpanalakkhaṇo sammāājīvo. Sammā paggahalakkhaṇo sammāvāyāmo. Sammā upaṭṭhānalakkhaṇā sammāsati. Sammā samādhānalakkhaṇo sammāsamādhi. Etesu ekekassa tīṇi tīṇi kiccāni honti. Seyyathidaṃ, sammādiṭṭhi tāva aññehipi attano paccanīkakilesehi saddhiṃ micchādiṭṭhiṃ pajahati, nirodhaṃ ārammaṇaṃ karoti, sampayuttadhamme ca passati tappaṭicchādakamohavidhamanavasena asammohato. Sammāsaṅkappādayopi tatheva micchāsaṅkappādīni pajahanti, nirodhañca ārammaṇaṃ karonti, visesato panettha sammāsaṅkappo sahajātadhamme abhiniropeti. Sammāvācā sammā pariggaṇhati. Sammākammanto sammā samuṭṭhāpeti. Sammāājīvo sammā vodāpeti. Sammāvāyāmo sammā paggaṇhati. Sammāsati sammā upaṭṭhāpeti. Sammāsamādhi sammā padahati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Api cesā sammādiṭṭhi nāma pubbabhāge nānākkhaṇā nānārammaṇā hoti, maggakkhaṇe ekakkhaṇā ekārammaṇā. Kiccato pana ‘‘dukkhe ñāṇa’’ntiādīni cattāri nāmāni labhati. Sammāsaṅkappādayopi pubbabhāge nānākkhaṇā nānārammaṇā honti. Maggakkhaṇe ekakkhaṇā ekārammaṇā. Tesu sammāsaṅkappo kiccato ‘‘nekkhammasaṅkappo’’tiādīni tīṇi nāmāni labhati. Sammā vācādayo tisso viratiyopi honti, cetanādayopi honti, maggakkhaṇe pana viratiyeva. Sammāvāyāmo sammāsatīti idampi dvayaṃ kiccato sammappadhānasatipaṭṭhānavasena cattāri nāmāni labhati. Sammāsamādhi pana pubbabhāgepi maggakkhaṇepi sammāsamādhiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iti ",
      " imesu aṭṭhasu dhammesu bhagavatā nibbānādhigamāya paṭipannassa yogino bahukārattā paṭhamaṃ sammādiṭṭhi desitā. Ayañhi ‘‘paññāpajjoto paññāsattha’’nti (dha. sa. 20) ca vuttā. Tasmā etāya pubbabhāge vipassanāñāṇasaṅkhātāya sammādiṭṭhiyā avijjandhakāraṃ vidhamitvā kilesacore ghātento khemena ",
      " yogāvacaro nibbānaṃ pāpuṇāti. Tena vuttaṃ – ‘‘nibbānādhigamāya paṭipannassa yogino bahukārattā paṭhamaṃ sammādiṭṭhi desitā’’ti."
    ],
    "innerText": "Iti imesu aṭṭhasu dhammesu bhagavatā nibbānādhigamāya paṭipannassa yogino bahukārattā paṭhamaṃ sammādiṭṭhi desitā. Ayañhi ‘‘paññāpajjoto paññāsattha’’nti (dha. sa. 20) ca vuttā. Tasmā etāya pubbabhāge vipassanāñāṇasaṅkhātāya sammādiṭṭhiyā avijjandhakāraṃ vidhamitvā kilesacore ghātento khemena yogāvacaro nibbānaṃ pāpuṇāti. Tena vuttaṃ – ‘‘nibbānādhigamāya paṭipannassa yogino bahukārattā paṭhamaṃ sammādiṭṭhi desitā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sammāsaṅkappo pana tassā bahukāro, tasmā tadanantaraṃ vutto. Yathā hi heraññiko hatthena parivaṭṭetvā parivaṭṭetvā cakkhunā kahāpaṇaṃ olokento – ‘‘ayaṃ cheko, ayaṃ kūṭo’’ti jānāti. Evaṃ yogāvacaropi pubbabhāge vitakkena vitakketvā vipassanāpaññāya olokayamāno – ‘‘ime dhammā kāmāvacarā, ime dhammā rūpāvacarādayo’’ti pajānāti. Yathā vā pana purisena koṭiyaṃ gahetvā parivaṭṭetvā parivaṭṭetvā dinnaṃ mahārukkhaṃ tacchako vāsiyā tacchetvā kamme upaneti, evaṃ vitakkena vitakketvā vitakketvā dinne dhamme yogāvacaro paññāya – ‘‘ime kāmāvacarā, ime rūpāvacarā’’tiādinā nayena paricchinditvā kamme upaneti ",
      ". Tena vuttaṃ – ‘‘sammāsaṅkappo pana tassā bahukāro, tasmā tadanantaraṃ vutto’’ti. Svāyaṃ yathā sammādiṭṭhiyā evaṃ sammāvācāyapi upakārako. Yathāha – ‘‘pubbe kho, visākha, vitakketvā vicāretvā pacchā vācaṃ bhindatī’’ti, (ma. ni. 1.463) tasmā tadanantaraṃ sammāvācā vuttā."
    ],
    "innerText": "Sammāsaṅkappo pana tassā bahukāro, tasmā tadanantaraṃ vutto. Yathā hi heraññiko hatthena parivaṭṭetvā parivaṭṭetvā cakkhunā kahāpaṇaṃ olokento – ‘‘ayaṃ cheko, ayaṃ kūṭo’’ti jānāti. Evaṃ yogāvacaropi pubbabhāge vitakkena vitakketvā vipassanāpaññāya olokayamāno – ‘‘ime dhammā kāmāvacarā, ime dhammā rūpāvacarādayo’’ti pajānāti. Yathā vā pana purisena koṭiyaṃ gahetvā parivaṭṭetvā parivaṭṭetvā dinnaṃ mahārukkhaṃ tacchako vāsiyā tacchetvā kamme upaneti, evaṃ vitakkena vitakketvā vitakketvā dinne dhamme yogāvacaro paññāya – ‘‘ime kāmāvacarā, ime rūpāvacarā’’tiādinā nayena paricchinditvā kamme upaneti . Tena vuttaṃ – ‘‘sammāsaṅkappo pana tassā bahukāro, tasmā tadanantaraṃ vutto’’ti. Svāyaṃ yathā sammādiṭṭhiyā evaṃ sammāvācāyapi upakārako. Yathāha – ‘‘pubbe kho, visākha, vitakketvā vicāretvā pacchā vācaṃ bhindatī’’ti, (ma. ni. 1.463) tasmā tadanantaraṃ sammāvācā vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yasmā pana – ‘‘idañcidañca karissāmā’’ti paṭhamaṃ vācāya saṃvidahitvā loke kammante payojenti; tasmā vācā kāyakammassa upakārikāti sammāvācāya anantaraṃ sammākammanto vutto. Catubbidhaṃ pana vacīduccaritaṃ, tividhañca kāyaduccaritaṃ pahāya ubhayaṃ sucaritaṃ pūrentasseva yasmā ājīvaṭṭhamakaṃ sīlaṃ pūreti, na itarassa, tasmā tadubhayānantaraṃ sammāājīvo vutto. Evaṃ visuddhājīvena pana ‘‘parisuddho me ājīvo’’ti ettāvatā ca paritosaṃ katvā suttapamattena viharituṃ na yuttaṃ, atha kho ‘‘sabbiriyāpathesu idaṃ vīriyaṃ samārabhitabba’’nti dassetuṃ tadanantaraṃ sammāvāyāmo vutto. Tato ‘‘āraddhavīriyenapi kāyādīsu catūsu vatthūsu ",
      " sati sūpaṭṭhitā kātabbā’’ti dassanatthaṃ tadanantaraṃ sammāsati ",
      " desitā. Yasmā panevaṃ sūpaṭṭhitā sati samādhissupakārānupakārānaṃ dhammānaṃ gatiyo samannesitvā pahoti ekattārammaṇe cittaṃ samādhātuṃ, tasmā sammāsatiyā anantaraṃ sammāsamādhi desitoti veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etesaṃ dhammānaṃ sacchikiriyāyā"
      },
      "ti etesaṃ sotāpattiphalādīnaṃ paccakkhakiriyatthāya."
    ],
    "innerText": "Yasmā pana – ‘‘idañcidañca karissāmā’’ti paṭhamaṃ vācāya saṃvidahitvā loke kammante payojenti; tasmā vācā kāyakammassa upakārikāti sammāvācāya anantaraṃ sammākammanto vutto. Catubbidhaṃ pana vacīduccaritaṃ, tividhañca kāyaduccaritaṃ pahāya ubhayaṃ sucaritaṃ pūrentasseva yasmā ājīvaṭṭhamakaṃ sīlaṃ pūreti, na itarassa, tasmā tadubhayānantaraṃ sammāājīvo vutto. Evaṃ visuddhājīvena pana ‘‘parisuddho me ājīvo’’ti ettāvatā ca paritosaṃ katvā suttapamattena viharituṃ na yuttaṃ, atha kho ‘‘sabbiriyāpathesu idaṃ vīriyaṃ samārabhitabba’’nti dassetuṃ tadanantaraṃ sammāvāyāmo vutto. Tato ‘‘āraddhavīriyenapi kāyādīsu catūsu vatthūsu sati sūpaṭṭhitā kātabbā’’ti dassanatthaṃ tadanantaraṃ sammāsati desitā. Yasmā panevaṃ sūpaṭṭhitā sati samādhissupakārānupakārānaṃ dhammānaṃ gatiyo samannesitvā pahoti ekattārammaṇe cittaṃ samādhātuṃ, tasmā sammāsatiyā anantaraṃ sammāsamādhi desitoti veditabbo. Etesaṃ dhammānaṃ sacchikiriyāyāti etesaṃ sotāpattiphalādīnaṃ paccakkhakiriyatthāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dve pabbajitavatthuvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "376-377"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekamidāha"
      },
      "nti idaṃ kasmā āraddhaṃ? Ayaṃ kira rājā – ‘‘rūpaṃ attā’’ti evaṃladdhiko, tenassa desanāya cittaṃ nādhimuccati. Atha bhagavatā tassa laddhiyā āvikaraṇatthaṃ ekaṃ kāraṇaṃ āharituṃ idamāraddhaṃ. Tatrāyaṃ saṅkhepattho – ‘‘ahaṃ ekaṃ samayaṃ ghositārāme viharāmi, tatra vasantaṃ maṃ te dve pabbajitā evaṃ pucchiṃsu. Athāhaṃ tesaṃ buddhuppādaṃ dassetvā tantidhammaṃ nāma kathento idamavocaṃ – ‘‘āvuso, saddhāsampanno nāma kulaputto evarūpassa satthu sāsane pabbajito, evaṃ tividhaṃ sīlaṃ pūretvā paṭhamajjhānādīni patvā ṭhito ‘taṃ jīva’ntiādīni vadeyya, yuttaṃ nu kho etamassā’’ti? Tato tehi ‘‘yutta’’nti vutte ‘‘ahaṃ kho panetaṃ, āvuso, evaṃ jānāmi, evaṃ passāmi, atha ca panāhaṃ na vadāmī’’ti taṃ vādaṃ paṭikkhipitvā uttari khīṇāsavaṃ dassetvā ‘‘imassa evaṃ vattuṃ na yutta’’nti avocaṃ. Te mama vacanaṃ sutvā attamanā ahesunti. Evaṃ vutte sopi attamano ahosi ",
      ". Tenāha – ‘‘idamavoca bhagavā. Attamano oṭṭhaddho licchavī bhagavato bhāsitaṃ abhinandī’’ti."
    ],
    "innerText": "376-377.Ekamidāhanti idaṃ kasmā āraddhaṃ? Ayaṃ kira rājā – ‘‘rūpaṃ attā’’ti evaṃladdhiko, tenassa desanāya cittaṃ nādhimuccati. Atha bhagavatā tassa laddhiyā āvikaraṇatthaṃ ekaṃ kāraṇaṃ āharituṃ idamāraddhaṃ. Tatrāyaṃ saṅkhepattho – ‘‘ahaṃ ekaṃ samayaṃ ghositārāme viharāmi, tatra vasantaṃ maṃ te dve pabbajitā evaṃ pucchiṃsu. Athāhaṃ tesaṃ buddhuppādaṃ dassetvā tantidhammaṃ nāma kathento idamavocaṃ – ‘‘āvuso, saddhāsampanno nāma kulaputto evarūpassa satthu sāsane pabbajito, evaṃ tividhaṃ sīlaṃ pūretvā paṭhamajjhānādīni patvā ṭhito ‘taṃ jīva’ntiādīni vadeyya, yuttaṃ nu kho etamassā’’ti? Tato tehi ‘‘yutta’’nti vutte ‘‘ahaṃ kho panetaṃ, āvuso, evaṃ jānāmi, evaṃ passāmi, atha ca panāhaṃ na vadāmī’’ti taṃ vādaṃ paṭikkhipitvā uttari khīṇāsavaṃ dassetvā ‘‘imassa evaṃ vattuṃ na yutta’’nti avocaṃ. Te mama vacanaṃ sutvā attamanā ahesunti. Evaṃ vutte sopi attamano ahosi . Tenāha – ‘‘idamavoca bhagavā. Attamano oṭṭhaddho licchavī bhagavato bhāsitaṃ abhinandī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti sumaṅgalavilāsiniyā dīghanikāyaṭṭhakathāyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahālisuttavaṇṇanā niṭṭhitā."
  }
]