[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "4. Soṇadaṇḍasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Campeyyakabrāhmaṇagahapatikā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "300"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā aṅgesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi yena campā tadavasari. Tatra sudaṃ bhagavā campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Tena kho pana samayena soṇadaṇḍo brāhmaṇo campaṃ ajjhāvasati sattussadaṃ satiṇakaṭṭhodakaṃ sadhaññaṃ rājabhoggaṃ raññā māgadhena seniyena bimbisārena dinnaṃ rājadāyaṃ brahmadeyyaṃ."
    ],
    "innerText": "300. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā aṅgesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi yena campā tadavasari. Tatra sudaṃ bhagavā campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Tena kho pana samayena soṇadaṇḍo brāhmaṇo campaṃ ajjhāvasati sattussadaṃ satiṇakaṭṭhodakaṃ sadhaññaṃ rājabhoggaṃ raññā māgadhena seniyena bimbisārena dinnaṃ rājadāyaṃ brahmadeyyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "301"
      },
      ". Assosuṃ kho campeyyakā brāhmaṇagahapatikā – ‘‘samaṇo khalu bho gotamo sakyaputto sakyakulā pabbajito aṅgesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi campaṃ anuppatto campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ ",
      " hotī’’ti. Atha ",
      " kho campeyyakā brāhmaṇagahapatikā campāya nikkhamitvā saṅghasaṅghī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṅghā saṅghī (sī. syā. pī.)]"
      },
      " gaṇībhūtā yena gaggarā pokkharaṇī tenupasaṅkamanti."
    ],
    "innerText": "301. Assosuṃ kho campeyyakā brāhmaṇagahapatikā – ‘‘samaṇo khalu bho gotamo sakyaputto sakyakulā pabbajito aṅgesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi campaṃ anuppatto campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’ti. Atha kho campeyyakā brāhmaṇagahapatikā campāya nikkhamitvā saṅghasaṅghī [saṅghā saṅghī (sī. syā. pī.)] gaṇībhūtā yena gaggarā pokkharaṇī tenupasaṅkamanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "302"
      },
      ". Tena kho pana samayena soṇadaṇḍo brāhmaṇo uparipāsāde divāseyyaṃ upagato hoti. Addasā kho soṇadaṇḍo brāhmaṇo campeyyake brāhmaṇagahapatike campāya nikkhamitvā saṅghasaṅghī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṅghe saṅghī (sī. pī.) saṅghā saṅghī (syā.)]"
      },
      " gaṇībhūte yena gaggarā pokkharaṇī tenupasaṅkamante. Disvā khattaṃ āmantesi – ‘‘kiṃ nu kho, bho khatte, campeyyakā brāhmaṇagahapatikā campāya ",
      " nikkhamitvā saṅghasaṅghī gaṇībhūtā yena gaggarā pokkharaṇī tenupasaṅkamantī’’ti? ‘‘Atthi kho, bho, samaṇo gotamo sakyaputto sakyakulā pabbajito aṅgesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi campaṃ anuppatto campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Tamete bhavantaṃ gotamaṃ dassanāya upasaṅkamantī’’ti. ‘‘Tena hi, bho khatte, yena campeyyakā brāhmaṇagahapatikā tenupasaṅkama, upasaṅkamitvā campeyyake brāhmaṇagahapatike evaṃ vadehi – ‘soṇadaṇḍo, bho, brāhmaṇo evamāha – āgamentu kira bhavanto, soṇadaṇḍopi brāhmaṇo samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’’ti. ‘‘Evaṃ, bho’’ti kho so khattā soṇadaṇḍassa ",
      " brāhmaṇassa paṭissutvā yena campeyyakā brāhmaṇagahapatikā tenupasaṅkami; upasaṅkamitvā campeyyake brāhmaṇagahapatike etadavoca – ‘‘soṇadaṇḍo ",
      " bho brāhmaṇo evamāha – ‘āgamentu kira bhavanto, soṇadaṇḍopi brāhmaṇo samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’’ti."
    ],
    "innerText": "302. Tena kho pana samayena soṇadaṇḍo brāhmaṇo uparipāsāde divāseyyaṃ upagato hoti. Addasā kho soṇadaṇḍo brāhmaṇo campeyyake brāhmaṇagahapatike campāya nikkhamitvā saṅghasaṅghī [saṅghe saṅghī (sī. pī.) saṅghā saṅghī (syā.)] gaṇībhūte yena gaggarā pokkharaṇī tenupasaṅkamante. Disvā khattaṃ āmantesi – ‘‘kiṃ nu kho, bho khatte, campeyyakā brāhmaṇagahapatikā campāya nikkhamitvā saṅghasaṅghī gaṇībhūtā yena gaggarā pokkharaṇī tenupasaṅkamantī’’ti? ‘‘Atthi kho, bho, samaṇo gotamo sakyaputto sakyakulā pabbajito aṅgesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi campaṃ anuppatto campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Tamete bhavantaṃ gotamaṃ dassanāya upasaṅkamantī’’ti. ‘‘Tena hi, bho khatte, yena campeyyakā brāhmaṇagahapatikā tenupasaṅkama, upasaṅkamitvā campeyyake brāhmaṇagahapatike evaṃ vadehi – ‘soṇadaṇḍo, bho, brāhmaṇo evamāha – āgamentu kira bhavanto, soṇadaṇḍopi brāhmaṇo samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’’ti. ‘‘Evaṃ, bho’’ti kho so khattā soṇadaṇḍassa brāhmaṇassa paṭissutvā yena campeyyakā brāhmaṇagahapatikā tenupasaṅkami; upasaṅkamitvā campeyyake brāhmaṇagahapatike etadavoca – ‘‘soṇadaṇḍo bho brāhmaṇo evamāha – ‘āgamentu kira bhavanto, soṇadaṇḍopi brāhmaṇo samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Soṇadaṇḍaguṇakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "303"
      },
      ". Tena kho pana samayena nānāverajjakānaṃ brāhmaṇānaṃ pañcamattāni brāhmaṇasatāni campāyaṃ paṭivasanti kenacideva karaṇīyena. Assosuṃ kho te brāhmaṇā – ‘‘soṇadaṇḍo kira brāhmaṇo samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’ti. Atha kho te brāhmaṇā yena soṇadaṇḍo brāhmaṇo tenupasaṅkamiṃsu; upasaṅkamitvā soṇadaṇḍaṃ brāhmaṇaṃ etadavocuṃ – ‘‘saccaṃ kira bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’ti? ‘‘Evaṃ kho me, bho, hoti – ‘ahampi samaṇaṃ gotamaṃ dassanāya upasaṅkamissāmī’’’ti."
    ],
    "innerText": "303. Tena kho pana samayena nānāverajjakānaṃ brāhmaṇānaṃ pañcamattāni brāhmaṇasatāni campāyaṃ paṭivasanti kenacideva karaṇīyena. Assosuṃ kho te brāhmaṇā – ‘‘soṇadaṇḍo kira brāhmaṇo samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’ti. Atha kho te brāhmaṇā yena soṇadaṇḍo brāhmaṇo tenupasaṅkamiṃsu; upasaṅkamitvā soṇadaṇḍaṃ brāhmaṇaṃ etadavocuṃ – ‘‘saccaṃ kira bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’ti? ‘‘Evaṃ kho me, bho, hoti – ‘ahampi samaṇaṃ gotamaṃ dassanāya upasaṅkamissāmī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Mā bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkami. Na arahati bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ. Sace bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamissati, bhoto ",
      " soṇadaṇḍassa yaso hāyissati, samaṇassa gotamassa yaso abhivaḍḍhissati. Yampi bhoto soṇadaṇḍassa yaso hāyissati, samaṇassa gotamassa yaso abhivaḍḍhissati ",
      ", imināpaṅgena na arahati bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ; samaṇotveva gotamo arahati bhavantaṃ soṇadaṇḍaṃ dassanāya upasaṅkamituṃ."
    ],
    "innerText": "‘‘Mā bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkami. Na arahati bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ. Sace bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamissati, bhoto soṇadaṇḍassa yaso hāyissati, samaṇassa gotamassa yaso abhivaḍḍhissati. Yampi bhoto soṇadaṇḍassa yaso hāyissati, samaṇassa gotamassa yaso abhivaḍḍhissati , imināpaṅgena na arahati bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ; samaṇotveva gotamo arahati bhavantaṃ soṇadaṇḍaṃ dassanāya upasaṅkamituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhavañhi soṇadaṇḍo ubhato sujāto mātito ca pitito ca, saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. Yampi bhavaṃ soṇadaṇḍo ubhato sujāto mātito ca pitito ca, saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena, imināpaṅgena na arahati bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ; samaṇotveva gotamo arahati bhavantaṃ soṇadaṇḍaṃ dassanāya ",
      " upasaṅkamituṃ."
    ],
    "innerText": "‘‘Bhavañhi soṇadaṇḍo ubhato sujāto mātito ca pitito ca, saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. Yampi bhavaṃ soṇadaṇḍo ubhato sujāto mātito ca pitito ca, saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena, imināpaṅgena na arahati bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ; samaṇotveva gotamo arahati bhavantaṃ soṇadaṇḍaṃ dassanāya upasaṅkamituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Bhavañhi soṇadaṇḍo aḍḍho mahaddhano mahābhogo…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhavañhi soṇadaṇḍo ajjhāyako ",
      ", mantadharo, tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ padako veyyākaraṇo, lokāyatamahāpurisalakkhaṇesu anavayo…pe…"
    ],
    "innerText": "‘‘Bhavañhi soṇadaṇḍo ajjhāyako , mantadharo, tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ padako veyyākaraṇo, lokāyatamahāpurisalakkhaṇesu anavayo…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhavañhi soṇadaṇḍo abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[brahmaḍḍhī (sī.), brahmavaccasī (pī.)]"
      },
      " akhuddāvakāso dassanāya…pe…"
    ],
    "innerText": "‘‘Bhavañhi soṇadaṇḍo abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī [brahmaḍḍhī (sī.), brahmavaccasī (pī.)] akhuddāvakāso dassanāya…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Bhavañhi soṇadaṇḍo sīlavā vuddhasīlī vuddhasīlena samannāgato…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhavañhi soṇadaṇḍo kalyāṇavāco kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[aneḷagalāya (sī. pī.), anelagaḷāya (ka)]"
      },
      " atthassa viññāpaniyā…pe…"
    ],
    "innerText": "‘‘Bhavañhi soṇadaṇḍo kalyāṇavāco kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya [aneḷagalāya (sī. pī.), anelagaḷāya (ka)] atthassa viññāpaniyā…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhavañhi soṇadaṇḍo bahūnaṃ ācariyapācariyo tīṇi māṇavakasatāni mante vāceti. Bahū kho pana nānādisā nānājanapadā māṇavakā āgacchanti ",
      " bhoto soṇadaṇḍassa santike mantatthikā mante adhiyitukāmā ",
      " …pe…"
    ],
    "innerText": "‘‘Bhavañhi soṇadaṇḍo bahūnaṃ ācariyapācariyo tīṇi māṇavakasatāni mante vāceti. Bahū kho pana nānādisā nānājanapadā māṇavakā āgacchanti bhoto soṇadaṇḍassa santike mantatthikā mante adhiyitukāmā …pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Bhavañhi soṇadaṇḍo jiṇṇo vuddho mahallako addhagato vayoanuppatto; samaṇo gotamo taruṇo ceva taruṇapabbajito ca…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhavañhi ",
      " soṇadaṇḍo rañño māgadhassa seniyassa bimbisārassa sakkato garukato mānito pūjito apacito…pe…"
    ],
    "innerText": "‘‘Bhavañhi soṇadaṇḍo rañño māgadhassa seniyassa bimbisārassa sakkato garukato mānito pūjito apacito…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Bhavañhi soṇadaṇḍo brāhmaṇassa pokkharasātissa sakkato garukato mānito pūjito apacito…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Bhavañhi soṇadaṇḍo campaṃ ajjhāvasati sattussadaṃ satiṇakaṭṭhodakaṃ sadhaññaṃ rājabhoggaṃ, raññā māgadhena seniyena bimbisārena dinnaṃ, rājadāyaṃ brahmadeyyaṃ. Yampi bhavaṃ soṇadaṇḍo campaṃ ajjhāvasati sattussadaṃ satiṇakaṭṭhodakaṃ sadhaññaṃ rājabhoggaṃ, raññā māgadhena seniyena bimbisārena dinnaṃ, rājadāyaṃ brahmadeyyaṃ. Imināpaṅgena na arahati bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ; samaṇotveva gotamo arahati bhavantaṃ soṇadaṇḍaṃ dassanāya upasaṅkamitu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Buddhaguṇakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "304"
      },
      ". Evaṃ vutte, soṇadaṇḍo brāhmaṇo te brāhmaṇe etadavoca –"
    ],
    "innerText": "304. Evaṃ vutte, soṇadaṇḍo brāhmaṇo te brāhmaṇe etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tena ",
      " hi, bho, mamapi suṇātha, yathā mayameva arahāma taṃ bhavantaṃ gotamaṃ dassanāya upasaṅkamituṃ; natveva arahati so bhavaṃ gotamo amhākaṃ dassanāya upasaṅkamituṃ. Samaṇo khalu, bho, gotamo ubhato sujāto mātito ca pitito ca, saṃsuddhagahaṇiko yāva sattamā pitāmahayugā, akkhitto anupakkuṭṭho jātivādena. Yampi bho samaṇo gotamo ubhato sujāto mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā ",
      " pitāmahayugā, akkhitto anupakkuṭṭho jātivādena, imināpaṅgena na arahati so bhavaṃ gotamo amhākaṃ dassanāya upasaṅkamituṃ ",
      "; atha kho mayameva arahāma taṃ bhavantaṃ gotamaṃ dassanāya upasaṅkamituṃ."
    ],
    "innerText": "‘‘Tena hi, bho, mamapi suṇātha, yathā mayameva arahāma taṃ bhavantaṃ gotamaṃ dassanāya upasaṅkamituṃ; natveva arahati so bhavaṃ gotamo amhākaṃ dassanāya upasaṅkamituṃ. Samaṇo khalu, bho, gotamo ubhato sujāto mātito ca pitito ca, saṃsuddhagahaṇiko yāva sattamā pitāmahayugā, akkhitto anupakkuṭṭho jātivādena. Yampi bho samaṇo gotamo ubhato sujāto mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā, akkhitto anupakkuṭṭho jātivādena, imināpaṅgena na arahati so bhavaṃ gotamo amhākaṃ dassanāya upasaṅkamituṃ ; atha kho mayameva arahāma taṃ bhavantaṃ gotamaṃ dassanāya upasaṅkamituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo mahantaṃ ñātisaṅghaṃ ohāya pabbajito…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo pahūtaṃ hiraññasuvaṇṇaṃ ohāya pabbajito bhūmigatañca vehāsaṭṭhaṃ ca…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Samaṇo ",
      " khalu, bho, gotamo daharova samāno yuvā susukāḷakeso bhadrena yobbanena samannāgato paṭhamena vayasā agārasmā anagāriyaṃ pabbajito…pe…"
    ],
    "innerText": "‘‘Samaṇo khalu, bho, gotamo daharova samāno yuvā susukāḷakeso bhadrena yobbanena samannāgato paṭhamena vayasā agārasmā anagāriyaṃ pabbajito…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo akāmakānaṃ mātāpitūnaṃ assumukhānaṃ rudantānaṃ kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajito…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato, brahmavaṇṇī, brahmavacchasī, akhuddāvakāso dassanāya…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo sīlavā ariyasīlī kusalasīlī kusalasīlena samannāgato…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo kalyāṇavāco kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo bahūnaṃ ācariyapācariyo…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo khīṇakāmarāgo vigatacāpallo…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo kammavādī kiriyavādī apāpapurekkhāro brahmaññāya pajāya…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo uccā kulā pabbajito asambhinnakhattiyakulā…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Samaṇo khalu, bho, gotamo aḍḍhā ",
      " kulā pabbajito mahaddhanā mahābhogā…pe…"
    ],
    "innerText": "‘‘Samaṇo khalu, bho, gotamo aḍḍhā kulā pabbajito mahaddhanā mahābhogā…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Samaṇaṃ ",
      " khalu, bho, gotamaṃ tiroraṭṭhā tirojanapadā pañhaṃ pucchituṃ āgacchanti…pe…"
    ],
    "innerText": "‘‘Samaṇaṃ khalu, bho, gotamaṃ tiroraṭṭhā tirojanapadā pañhaṃ pucchituṃ āgacchanti…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇaṃ khalu, bho, gotamaṃ anekāni devatāsahassāni pāṇehi saraṇaṃ gatāni…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Samaṇaṃ ",
      " khalu, bho, gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ ti…pe…"
    ],
    "innerText": "‘‘Samaṇaṃ khalu, bho, gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ ti…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo dvattiṃsamahāpurisalakkhaṇehi samannāgato…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo ehisvāgatavādī sakhilo sammodako abbhākuṭiko uttānamukho pubbabhāsī…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo catunnaṃ parisānaṃ sakkato garukato mānito pūjito apacito…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇe khalu, bho, gotame bahū devā ca manussā ca abhippasannā…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo yasmiṃ gāme vā nigame vā paṭivasati, na tasmiṃ gāme vā nigame vā amanussā manusse viheṭhenti…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo saṅghī gaṇī gaṇācariyo puthutitthakarānaṃ aggamakkhāyati. Yathā kho pana, bho, etesaṃ samaṇabrāhmaṇānaṃ yathā vā tathā vā yaso samudāgacchati, na hevaṃ samaṇassa gotamassa yaso samudāgato. Atha kho anuttarāya vijjācaraṇasampadāya samaṇassa gotamassa yaso samudāgato…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Samaṇaṃ khalu, bho, gotamaṃ rājā māgadho seniyo bimbisāro saputto sabhariyo sapariso ",
      " sāmacco pāṇehi saraṇaṃ gato…pe…"
    ],
    "innerText": "‘‘Samaṇaṃ khalu, bho, gotamaṃ rājā māgadho seniyo bimbisāro saputto sabhariyo sapariso sāmacco pāṇehi saraṇaṃ gato…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Samaṇaṃ ",
      " khalu, bho, gotamaṃ rājā pasenadi kosalo saputto sabhariyo sapariso sāmacco pāṇehi saraṇaṃ gato…pe…"
    ],
    "innerText": "‘‘Samaṇaṃ khalu, bho, gotamaṃ rājā pasenadi kosalo saputto sabhariyo sapariso sāmacco pāṇehi saraṇaṃ gato…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇaṃ khalu, bho, gotamaṃ brāhmaṇo pokkharasāti saputto sabhariyo sapariso sāmacco pāṇehi saraṇaṃ gato…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Samaṇo ",
      " khalu, bho, gotamo rañño māgadhassa seniyassa bimbisārassa sakkato garukato mānito pūjito apacito…pe…"
    ],
    "innerText": "‘‘Samaṇo khalu, bho, gotamo rañño māgadhassa seniyassa bimbisārassa sakkato garukato mānito pūjito apacito…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo rañño pasenadissa kosalassa sakkato garukato mānito pūjito apacito…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaṇo khalu, bho, gotamo brāhmaṇassa pokkharasātissa sakkato garukato mānito pūjito apacito…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Samaṇo ",
      " khalu, bho, gotamo campaṃ anuppatto, campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Ye kho pana, bho, keci samaṇā vā brāhmaṇā vā amhākaṃ gāmakhettaṃ āgacchanti atithī no te honti. Atithī kho panamhehi sakkātabbā garukātabbā mānetabbā pūjetabbā apacetabbā. Yampi, bho, samaṇo gotamo campaṃ anuppatto campāyaṃ viharati gaggarāya pokkharaṇiyā tīre, atithimhākaṃ samaṇo gotamo; atithi kho panamhehi sakkātabbo garukātabbo mānetabbo pūjetabbo apacetabbo. Imināpaṅgena na arahati so bhavaṃ gotamo amhākaṃ dassanāya upasaṅkamituṃ. Atha kho mayameva arahāma taṃ bhavantaṃ gotamaṃ dassanāya upasaṅkamituṃ. Ettake kho ahaṃ, bho, tassa bhoto gotamassa vaṇṇe pariyāpuṇāmi, no ca kho so bhavaṃ gotamo ettakavaṇṇo. Aparimāṇavaṇṇo hi so bhavaṃ gotamo’’ti."
    ],
    "innerText": "‘‘Samaṇo khalu, bho, gotamo campaṃ anuppatto, campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Ye kho pana, bho, keci samaṇā vā brāhmaṇā vā amhākaṃ gāmakhettaṃ āgacchanti atithī no te honti. Atithī kho panamhehi sakkātabbā garukātabbā mānetabbā pūjetabbā apacetabbā. Yampi, bho, samaṇo gotamo campaṃ anuppatto campāyaṃ viharati gaggarāya pokkharaṇiyā tīre, atithimhākaṃ samaṇo gotamo; atithi kho panamhehi sakkātabbo garukātabbo mānetabbo pūjetabbo apacetabbo. Imināpaṅgena na arahati so bhavaṃ gotamo amhākaṃ dassanāya upasaṅkamituṃ. Atha kho mayameva arahāma taṃ bhavantaṃ gotamaṃ dassanāya upasaṅkamituṃ. Ettake kho ahaṃ, bho, tassa bhoto gotamassa vaṇṇe pariyāpuṇāmi, no ca kho so bhavaṃ gotamo ettakavaṇṇo. Aparimāṇavaṇṇo hi so bhavaṃ gotamo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "305"
      },
      ". Evaṃ ",
      " vutte, te brāhmaṇā soṇadaṇḍaṃ brāhmaṇaṃ etadavocuṃ – ‘‘yathā kho bhavaṃ soṇadaṇḍo samaṇassa gotamassa vaṇṇe bhāsati ito cepi so bhavaṃ gotamo yojanasate viharati, alameva saddhena kulaputtena dassanāya upasaṅkamituṃ api puṭosenā’’ti. ‘‘Tena hi, bho, sabbeva mayaṃ samaṇaṃ gotamaṃ dassanāya upasaṅkamissāmā’’ti."
    ],
    "innerText": "305. Evaṃ vutte, te brāhmaṇā soṇadaṇḍaṃ brāhmaṇaṃ etadavocuṃ – ‘‘yathā kho bhavaṃ soṇadaṇḍo samaṇassa gotamassa vaṇṇe bhāsati ito cepi so bhavaṃ gotamo yojanasate viharati, alameva saddhena kulaputtena dassanāya upasaṅkamituṃ api puṭosenā’’ti. ‘‘Tena hi, bho, sabbeva mayaṃ samaṇaṃ gotamaṃ dassanāya upasaṅkamissāmā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Soṇadaṇḍaparivitakko"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "306"
      },
      ". Atha ",
      " kho soṇadaṇḍo brāhmaṇo mahatā brāhmaṇagaṇena saddhiṃ yena gaggarā pokkharaṇī tenupasaṅkami. Atha kho soṇadaṇḍassa brāhmaṇassa tirovanasaṇḍagatassa evaṃ cetaso parivitakko udapādi – ‘‘ahañceva kho pana samaṇaṃ gotamaṃ pañhaṃ puccheyyaṃ; tatra ce maṃ samaṇo gotamo evaṃ vadeyya – ‘na kho esa, brāhmaṇa, pañho evaṃ pucchitabbo, evaṃ nāmesa, brāhmaṇa ",
      ", pañho pucchitabbo’ti, tena maṃ ayaṃ parisā paribhaveyya ",
      " – ‘bālo soṇadaṇḍo brāhmaṇo abyatto, nāsakkhi samaṇaṃ gotamaṃ yoniso pañhaṃ pucchitu’nti. Yaṃ kho panāyaṃ parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Mamañceva kho pana samaṇo gotamo pañhaṃ puccheyya, tassa cāhaṃ pañhassa veyyākaraṇena cittaṃ na ārādheyyaṃ; tatra ce maṃ samaṇo gotamo evaṃ vadeyya – ‘na kho esa, brāhmaṇa, pañho evaṃ byākātabbo, evaṃ nāmesa, brāhmaṇa, pañho byākātabbo’ti, tena maṃ ayaṃ parisā paribhaveyya – ‘bālo soṇadaṇḍo brāhmaṇo abyatto, nāsakkhi ",
      " samaṇassa gotamassa pañhassa veyyākaraṇena cittaṃ ārādhetu’nti. Yaṃ kho panāyaṃ parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Ahañceva kho pana evaṃ samīpagato samāno adisvāva samaṇaṃ gotamaṃ nivatteyyaṃ, tena maṃ ayaṃ parisā paribhaveyya – ‘bālo soṇadaṇḍo brāhmaṇo abyatto mānathaddho bhīto ca, no visahati samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ, kathañhi nāma evaṃ samīpagato samāno adisvā samaṇaṃ gotamaṃ nivattissatī’ti. Yaṃ kho panāyaṃ parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ, yasoladdhā kho panamhākaṃ bhogā’’ti."
    ],
    "innerText": "306. Atha kho soṇadaṇḍo brāhmaṇo mahatā brāhmaṇagaṇena saddhiṃ yena gaggarā pokkharaṇī tenupasaṅkami. Atha kho soṇadaṇḍassa brāhmaṇassa tirovanasaṇḍagatassa evaṃ cetaso parivitakko udapādi – ‘‘ahañceva kho pana samaṇaṃ gotamaṃ pañhaṃ puccheyyaṃ; tatra ce maṃ samaṇo gotamo evaṃ vadeyya – ‘na kho esa, brāhmaṇa, pañho evaṃ pucchitabbo, evaṃ nāmesa, brāhmaṇa , pañho pucchitabbo’ti, tena maṃ ayaṃ parisā paribhaveyya – ‘bālo soṇadaṇḍo brāhmaṇo abyatto, nāsakkhi samaṇaṃ gotamaṃ yoniso pañhaṃ pucchitu’nti. Yaṃ kho panāyaṃ parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Mamañceva kho pana samaṇo gotamo pañhaṃ puccheyya, tassa cāhaṃ pañhassa veyyākaraṇena cittaṃ na ārādheyyaṃ; tatra ce maṃ samaṇo gotamo evaṃ vadeyya – ‘na kho esa, brāhmaṇa, pañho evaṃ byākātabbo, evaṃ nāmesa, brāhmaṇa, pañho byākātabbo’ti, tena maṃ ayaṃ parisā paribhaveyya – ‘bālo soṇadaṇḍo brāhmaṇo abyatto, nāsakkhi samaṇassa gotamassa pañhassa veyyākaraṇena cittaṃ ārādhetu’nti. Yaṃ kho panāyaṃ parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Ahañceva kho pana evaṃ samīpagato samāno adisvāva samaṇaṃ gotamaṃ nivatteyyaṃ, tena maṃ ayaṃ parisā paribhaveyya – ‘bālo soṇadaṇḍo brāhmaṇo abyatto mānathaddho bhīto ca, no visahati samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ, kathañhi nāma evaṃ samīpagato samāno adisvā samaṇaṃ gotamaṃ nivattissatī’ti. Yaṃ kho panāyaṃ parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ, yasoladdhā kho panamhākaṃ bhogā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "307"
      },
      ". Atha kho soṇadaṇḍo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Campeyyakāpi kho brāhmaṇagahapatikā ",
      " appekacce bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu; appekacce bhagavatā saddhiṃ sammodiṃsu; sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu; appekacce yena bhagavā tenañjaliṃ paṇāmetvā ekamantaṃ nisīdiṃsu; appekacce nāmagottaṃ sāvetvā ekamantaṃ nisīdiṃsu; appekacce tuṇhībhūtā ekamantaṃ nisīdiṃsu."
    ],
    "innerText": "307. Atha kho soṇadaṇḍo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Campeyyakāpi kho brāhmaṇagahapatikā appekacce bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu; appekacce bhagavatā saddhiṃ sammodiṃsu; sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu; appekacce yena bhagavā tenañjaliṃ paṇāmetvā ekamantaṃ nisīdiṃsu; appekacce nāmagottaṃ sāvetvā ekamantaṃ nisīdiṃsu; appekacce tuṇhībhūtā ekamantaṃ nisīdiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "308"
      },
      ". Tatrapi ",
      " sudaṃ soṇadaṇḍo brāhmaṇo etadeva bahulamanuvitakkento nisinno hoti – ‘‘ahañceva kho ",
      " pana samaṇaṃ gotamaṃ pañhaṃ puccheyyaṃ; tatra ce maṃ samaṇo gotamo evaṃ vadeyya – ‘na kho esa, brāhmaṇa, pañho evaṃ pucchitabbo, evaṃ nāmesa, brāhmaṇa, pañho pucchitabbo’ti, tena maṃ ayaṃ parisā paribhaveyya – ‘bālo soṇadaṇḍo brāhmaṇo abyatto, nāsakkhi samaṇaṃ gotamaṃ yoniso pañhaṃ pucchitu’nti. Yaṃ kho panāyaṃ parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Mamañceva kho pana samaṇo gotamo pañhaṃ puccheyya, tassa cāhaṃ pañhassa veyyākaraṇena ",
      " cittaṃ na ārādheyyaṃ; tatra ce maṃ samaṇo gotamo evaṃ vadeyya – ‘na kho esa, brāhmaṇa, pañho evaṃ byākātabbo, evaṃ nāmesa, brāhmaṇa, pañho byākātabbo’ti, tena maṃ ayaṃ parisā paribhaveyya – ‘bālo soṇadaṇḍo brāhmaṇo abyatto, nāsakkhi samaṇassa gotamassa pañhassa veyyākaraṇena cittaṃ ārādhetu’nti. Yaṃ kho panāyaṃ parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Aho vata maṃ samaṇo gotamo sake ācariyake tevijjake pañhaṃ puccheyya, addhā vatassāhaṃ cittaṃ ārādheyyaṃ pañhassa veyyākaraṇenā’’ti."
    ],
    "innerText": "308. Tatrapi sudaṃ soṇadaṇḍo brāhmaṇo etadeva bahulamanuvitakkento nisinno hoti – ‘‘ahañceva kho pana samaṇaṃ gotamaṃ pañhaṃ puccheyyaṃ; tatra ce maṃ samaṇo gotamo evaṃ vadeyya – ‘na kho esa, brāhmaṇa, pañho evaṃ pucchitabbo, evaṃ nāmesa, brāhmaṇa, pañho pucchitabbo’ti, tena maṃ ayaṃ parisā paribhaveyya – ‘bālo soṇadaṇḍo brāhmaṇo abyatto, nāsakkhi samaṇaṃ gotamaṃ yoniso pañhaṃ pucchitu’nti. Yaṃ kho panāyaṃ parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Mamañceva kho pana samaṇo gotamo pañhaṃ puccheyya, tassa cāhaṃ pañhassa veyyākaraṇena cittaṃ na ārādheyyaṃ; tatra ce maṃ samaṇo gotamo evaṃ vadeyya – ‘na kho esa, brāhmaṇa, pañho evaṃ byākātabbo, evaṃ nāmesa, brāhmaṇa, pañho byākātabbo’ti, tena maṃ ayaṃ parisā paribhaveyya – ‘bālo soṇadaṇḍo brāhmaṇo abyatto, nāsakkhi samaṇassa gotamassa pañhassa veyyākaraṇena cittaṃ ārādhetu’nti. Yaṃ kho panāyaṃ parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Aho vata maṃ samaṇo gotamo sake ācariyake tevijjake pañhaṃ puccheyya, addhā vatassāhaṃ cittaṃ ārādheyyaṃ pañhassa veyyākaraṇenā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Brāhmaṇapaññatti"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "309"
      },
      ". Atha kho bhagavato soṇadaṇḍassa brāhmaṇassa cetasā cetoparivitakkamaññāya etadahosi – ‘‘vihaññati kho ayaṃ soṇadaṇḍo brāhmaṇo ",
      " sakena cittena. Yaṃnūnāhaṃ soṇadaṇḍaṃ brāhmaṇaṃ sake ācariyake tevijjake pañhaṃ puccheyya’’nti. Atha kho bhagavā soṇadaṇḍaṃ ",
      " brāhmaṇaṃ etadavoca – ‘‘katihi pana, brāhmaṇa, aṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti?"
    ],
    "innerText": "309. Atha kho bhagavato soṇadaṇḍassa brāhmaṇassa cetasā cetoparivitakkamaññāya etadahosi – ‘‘vihaññati kho ayaṃ soṇadaṇḍo brāhmaṇo sakena cittena. Yaṃnūnāhaṃ soṇadaṇḍaṃ brāhmaṇaṃ sake ācariyake tevijjake pañhaṃ puccheyya’’nti. Atha kho bhagavā soṇadaṇḍaṃ brāhmaṇaṃ etadavoca – ‘‘katihi pana, brāhmaṇa, aṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "310"
      },
      ". Atha kho soṇadaṇḍassa brāhmaṇassa etadahosi – ‘‘yaṃ ",
      " vata no ahosi icchitaṃ, yaṃ ākaṅkhitaṃ, yaṃ adhippetaṃ, yaṃ abhipatthitaṃ – ‘aho vata maṃ samaṇo gotamo sake ācariyake tevijjake pañhaṃ puccheyya, addhā vatassāhaṃ cittaṃ ārādheyyaṃ pañhassa veyyākaraṇenā’ti, tatra maṃ samaṇo gotamo sake ācariyake tevijjake pañhaṃ pucchati. Addhā vatassāhaṃ cittaṃ ārādhessāmi pañhassa veyyākaraṇenā’’ti."
    ],
    "innerText": "310. Atha kho soṇadaṇḍassa brāhmaṇassa etadahosi – ‘‘yaṃ vata no ahosi icchitaṃ, yaṃ ākaṅkhitaṃ, yaṃ adhippetaṃ, yaṃ abhipatthitaṃ – ‘aho vata maṃ samaṇo gotamo sake ācariyake tevijjake pañhaṃ puccheyya, addhā vatassāhaṃ cittaṃ ārādheyyaṃ pañhassa veyyākaraṇenā’ti, tatra maṃ samaṇo gotamo sake ācariyake tevijjake pañhaṃ pucchati. Addhā vatassāhaṃ cittaṃ ārādhessāmi pañhassa veyyākaraṇenā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "311"
      },
      ". Atha kho soṇadaṇḍo brāhmaṇo abbhunnāmetvā kāyaṃ anuviloketvā parisaṃ bhagavantaṃ etadavoca – ‘‘pañcahi, bho gotama, aṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyya. Katamehi pañcahi? Idha, bho gotama, brāhmaṇo ubhato sujāto hoti mātito ca pitito ca, saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena; ajjhāyako hoti mantadharo tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo; abhirūpo hoti ",
      " dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya; sīlavā hoti vuddhasīlī vuddhasīlena samannāgato; paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Imehi kho, bho gotama, pañcahi aṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti."
    ],
    "innerText": "311. Atha kho soṇadaṇḍo brāhmaṇo abbhunnāmetvā kāyaṃ anuviloketvā parisaṃ bhagavantaṃ etadavoca – ‘‘pañcahi, bho gotama, aṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyya. Katamehi pañcahi? Idha, bho gotama, brāhmaṇo ubhato sujāto hoti mātito ca pitito ca, saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena; ajjhāyako hoti mantadharo tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo; abhirūpo hoti dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya; sīlavā hoti vuddhasīlī vuddhasīlena samannāgato; paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Imehi kho, bho gotama, pañcahi aṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Imesaṃ pana, brāhmaṇa, pañcannaṃ aṅgānaṃ sakkā ekaṃ aṅgaṃ ṭhapayitvā catūhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapetuṃ; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti? ‘‘Sakkā ",
      ", bho gotama. Imesañhi, bho gotama, pañcannaṃ aṅgānaṃ vaṇṇaṃ ṭhapayāma. Kiñhi vaṇṇo karissati? Yato kho, bho gotama, brāhmaṇo ubhato sujāto hoti mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā ",
      " akkhitto anupakkuṭṭho jātivādena; ajjhāyako ca hoti mantadharo ca tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo; sīlavā ca hoti vuddhasīlī vuddhasīlena samannāgato; paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Imehi kho bho gotama catūhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno ",
      " sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti."
    ],
    "innerText": "‘‘Imesaṃ pana, brāhmaṇa, pañcannaṃ aṅgānaṃ sakkā ekaṃ aṅgaṃ ṭhapayitvā catūhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapetuṃ; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti? ‘‘Sakkā , bho gotama. Imesañhi, bho gotama, pañcannaṃ aṅgānaṃ vaṇṇaṃ ṭhapayāma. Kiñhi vaṇṇo karissati? Yato kho, bho gotama, brāhmaṇo ubhato sujāto hoti mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena; ajjhāyako ca hoti mantadharo ca tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo; sīlavā ca hoti vuddhasīlī vuddhasīlena samannāgato; paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Imehi kho bho gotama catūhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "312"
      },
      ". ‘‘Imesaṃ pana, brāhmaṇa, catunnaṃ aṅgānaṃ sakkā ekaṃ aṅgaṃ ṭhapayitvā tīhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapetuṃ; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti? ‘‘Sakkā, bho gotama. Imesañhi, bho gotama, catunnaṃ aṅgānaṃ mante ṭhapayāma. Kiñhi mantā karissanti? Yato kho, bho gotama, brāhmaṇo ubhato sujāto hoti mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena; sīlavā ca hoti vuddhasīlī vuddhasīlena samannāgato; paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Imehi kho, bho gotama, tīhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti."
    ],
    "innerText": "312. ‘‘Imesaṃ pana, brāhmaṇa, catunnaṃ aṅgānaṃ sakkā ekaṃ aṅgaṃ ṭhapayitvā tīhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapetuṃ; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti? ‘‘Sakkā, bho gotama. Imesañhi, bho gotama, catunnaṃ aṅgānaṃ mante ṭhapayāma. Kiñhi mantā karissanti? Yato kho, bho gotama, brāhmaṇo ubhato sujāto hoti mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena; sīlavā ca hoti vuddhasīlī vuddhasīlena samannāgato; paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Imehi kho, bho gotama, tīhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Imesaṃ pana, brāhmaṇa, tiṇṇaṃ aṅgānaṃ sakkā ekaṃ aṅgaṃ ṭhapayitvā dvīhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapetuṃ; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana ",
      " musāvādaṃ āpajjeyyā’’ti? ‘‘Sakkā, bho gotama. Imesañhi, bho gotama, tiṇṇaṃ aṅgānaṃ jātiṃ ṭhapayāma. Kiñhi jāti karissati? Yato kho, bho gotama, brāhmaṇo sīlavā hoti vuddhasīlī vuddhasīlena samannāgato; paṇḍito ca hoti ",
      " medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Imehi ",
      " kho, bho gotama, dvīhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti."
    ],
    "innerText": "‘‘Imesaṃ pana, brāhmaṇa, tiṇṇaṃ aṅgānaṃ sakkā ekaṃ aṅgaṃ ṭhapayitvā dvīhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapetuṃ; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti? ‘‘Sakkā, bho gotama. Imesañhi, bho gotama, tiṇṇaṃ aṅgānaṃ jātiṃ ṭhapayāma. Kiñhi jāti karissati? Yato kho, bho gotama, brāhmaṇo sīlavā hoti vuddhasīlī vuddhasīlena samannāgato; paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Imehi kho, bho gotama, dvīhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "313"
      },
      ". Evaṃ ",
      " vutte, te brāhmaṇā soṇadaṇḍaṃ brāhmaṇaṃ etadavocuṃ – ‘‘mā bhavaṃ soṇadaṇḍo evaṃ avaca, mā bhavaṃ soṇadaṇḍo evaṃ avaca. Apavadateva bhavaṃ soṇadaṇḍo vaṇṇaṃ, apavadati mante, apavadati jātiṃ ekaṃsena. Bhavaṃ soṇadaṇḍo samaṇasseva gotamassa vādaṃ anupakkhandatī’’ti."
    ],
    "innerText": "313. Evaṃ vutte, te brāhmaṇā soṇadaṇḍaṃ brāhmaṇaṃ etadavocuṃ – ‘‘mā bhavaṃ soṇadaṇḍo evaṃ avaca, mā bhavaṃ soṇadaṇḍo evaṃ avaca. Apavadateva bhavaṃ soṇadaṇḍo vaṇṇaṃ, apavadati mante, apavadati jātiṃ ekaṃsena. Bhavaṃ soṇadaṇḍo samaṇasseva gotamassa vādaṃ anupakkhandatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "314"
      },
      ". Atha kho bhagavā te brāhmaṇe etadavoca – ‘‘sace kho tumhākaṃ brāhmaṇānaṃ evaṃ hoti – ‘appassuto ca soṇadaṇḍo brāhmaṇo, akalyāṇavākkaraṇo ca soṇadaṇḍo brāhmaṇo, duppañño ca soṇadaṇḍo brāhmaṇo, na ca pahoti soṇadaṇḍo brāhmaṇo samaṇena gotamena saddhiṃ asmiṃ vacane paṭimantetu’nti, tiṭṭhatu soṇadaṇḍo brāhmaṇo, tumhe mayā saddhiṃ mantavho asmiṃ vacane. Sace pana tumhākaṃ brāhmaṇānaṃ evaṃ hoti – ‘bahussuto ca soṇadaṇḍo brāhmaṇo, kalyāṇavākkaraṇo ca soṇadaṇḍo brāhmaṇo, paṇḍito ca soṇadaṇḍo brāhmaṇo, pahoti ca soṇadaṇḍo brāhmaṇo samaṇena gotamena saddhiṃ asmiṃ vacane paṭimantetu’nti, tiṭṭhatha tumhe, soṇadaṇḍo brāhmaṇo mayā saddhiṃ paṭimantetū’’ti."
    ],
    "innerText": "314. Atha kho bhagavā te brāhmaṇe etadavoca – ‘‘sace kho tumhākaṃ brāhmaṇānaṃ evaṃ hoti – ‘appassuto ca soṇadaṇḍo brāhmaṇo, akalyāṇavākkaraṇo ca soṇadaṇḍo brāhmaṇo, duppañño ca soṇadaṇḍo brāhmaṇo, na ca pahoti soṇadaṇḍo brāhmaṇo samaṇena gotamena saddhiṃ asmiṃ vacane paṭimantetu’nti, tiṭṭhatu soṇadaṇḍo brāhmaṇo, tumhe mayā saddhiṃ mantavho asmiṃ vacane. Sace pana tumhākaṃ brāhmaṇānaṃ evaṃ hoti – ‘bahussuto ca soṇadaṇḍo brāhmaṇo, kalyāṇavākkaraṇo ca soṇadaṇḍo brāhmaṇo, paṇḍito ca soṇadaṇḍo brāhmaṇo, pahoti ca soṇadaṇḍo brāhmaṇo samaṇena gotamena saddhiṃ asmiṃ vacane paṭimantetu’nti, tiṭṭhatha tumhe, soṇadaṇḍo brāhmaṇo mayā saddhiṃ paṭimantetū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "315"
      },
      ". Evaṃ vutte, soṇadaṇḍo brāhmaṇo bhagavantaṃ etadavoca – ‘‘tiṭṭhatu bhavaṃ gotamo, tuṇhī bhavaṃ gotamo hotu, ahameva tesaṃ sahadhammena ",
      " paṭivacanaṃ karissāmī’’ti. Atha kho soṇadaṇḍo brāhmaṇo te brāhmaṇe etadavoca – ‘‘mā bhavanto evaṃ avacuttha, mā bhavanto evaṃ avacuttha – ‘apavadateva bhavaṃ soṇadaṇḍo vaṇṇaṃ, apavadati mante, apavadati jātiṃ ekaṃsena. Bhavaṃ soṇadaṇḍo ",
      " samaṇasseva gotamassa vādaṃ anupakkhandatī’ti. Nāhaṃ, bho, apavadāmi vaṇṇaṃ vā mante vā jātiṃ vā’’ti."
    ],
    "innerText": "315. Evaṃ vutte, soṇadaṇḍo brāhmaṇo bhagavantaṃ etadavoca – ‘‘tiṭṭhatu bhavaṃ gotamo, tuṇhī bhavaṃ gotamo hotu, ahameva tesaṃ sahadhammena paṭivacanaṃ karissāmī’’ti. Atha kho soṇadaṇḍo brāhmaṇo te brāhmaṇe etadavoca – ‘‘mā bhavanto evaṃ avacuttha, mā bhavanto evaṃ avacuttha – ‘apavadateva bhavaṃ soṇadaṇḍo vaṇṇaṃ, apavadati mante, apavadati jātiṃ ekaṃsena. Bhavaṃ soṇadaṇḍo samaṇasseva gotamassa vādaṃ anupakkhandatī’ti. Nāhaṃ, bho, apavadāmi vaṇṇaṃ vā mante vā jātiṃ vā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "316"
      },
      ". Tena ",
      " kho pana samayena soṇadaṇḍassa brāhmaṇassa bhāgineyyo aṅgako nāma māṇavako tassaṃ parisāyaṃ nisinno hoti. Atha kho soṇadaṇḍo brāhmaṇo te brāhmaṇe etadavoca ",
      " – ‘‘passanti no bhonto imaṃ aṅgakaṃ māṇavakaṃ amhākaṃ bhāgineyya’’nti? ‘‘Evaṃ, bho’’. ‘‘Aṅgako kho, bho, māṇavako abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya, nāssa imissaṃ parisāyaṃ samasamo atthi vaṇṇena ṭhapetvā samaṇaṃ gotamaṃ. Aṅgako kho māṇavako ajjhāyako mantadharo, tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo. Ahamassa mante vācetā. Aṅgako kho māṇavako ubhato sujāto mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. Ahamassa mātāpitaro jānāmi. Aṅgako kho māṇavako pāṇampi haneyya, adinnampi ādiyeyya ",
      ", paradārampi gaccheyya, musāvādampi bhaṇeyya, majjampi piveyya, ettha dāni, bho, kiṃ vaṇṇo karissati, kiṃ mantā, kiṃ jāti? Yato kho, bho, brāhmaṇo sīlavā ca hoti vuddhasīlī vuddhasīlena samannāgato, paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Imehi kho, bho, dvīhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti."
    ],
    "innerText": "316. Tena kho pana samayena soṇadaṇḍassa brāhmaṇassa bhāgineyyo aṅgako nāma māṇavako tassaṃ parisāyaṃ nisinno hoti. Atha kho soṇadaṇḍo brāhmaṇo te brāhmaṇe etadavoca – ‘‘passanti no bhonto imaṃ aṅgakaṃ māṇavakaṃ amhākaṃ bhāgineyya’’nti? ‘‘Evaṃ, bho’’. ‘‘Aṅgako kho, bho, māṇavako abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya, nāssa imissaṃ parisāyaṃ samasamo atthi vaṇṇena ṭhapetvā samaṇaṃ gotamaṃ. Aṅgako kho māṇavako ajjhāyako mantadharo, tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo. Ahamassa mante vācetā. Aṅgako kho māṇavako ubhato sujāto mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. Ahamassa mātāpitaro jānāmi. Aṅgako kho māṇavako pāṇampi haneyya, adinnampi ādiyeyya , paradārampi gaccheyya, musāvādampi bhaṇeyya, majjampi piveyya, ettha dāni, bho, kiṃ vaṇṇo karissati, kiṃ mantā, kiṃ jāti? Yato kho, bho, brāhmaṇo sīlavā ca hoti vuddhasīlī vuddhasīlena samannāgato, paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Imehi kho, bho, dvīhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sīlapaññākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "317"
      },
      ". ‘‘Imesaṃ pana, brāhmaṇa, dvinnaṃ aṅgānaṃ sakkā ekaṃ aṅgaṃ ṭhapayitvā ekena aṅgena samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapetuṃ; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti? ‘‘No ",
      " hidaṃ, bho gotama. Sīlaparidhotā hi, bho gotama, paññā; paññāparidhotaṃ sīlaṃ. Yattha sīlaṃ tattha paññā, yattha paññā tattha sīlaṃ. Sīlavato paññā, paññavato sīlaṃ. Sīlapaññāṇañca pana lokasmiṃ aggamakkhāyati. Seyyathāpi, bho gotama, hatthena vā hatthaṃ dhoveyya, pādena vā pādaṃ dhoveyya; evameva kho, bho gotama, sīlaparidhotā paññā, paññāparidhotaṃ ",
      " sīlaṃ. Yattha sīlaṃ tattha paññā, yattha paññā tattha sīlaṃ. Sīlavato paññā, paññavato sīlaṃ. Sīlapaññāṇañca pana lokasmiṃ aggamakkhāyatī’’ti. ‘‘Evametaṃ, brāhmaṇa, evametaṃ, brāhmaṇa, sīlaparidhotā hi, brāhmaṇa, paññā, paññāparidhotaṃ sīlaṃ. Yattha sīlaṃ tattha paññā, yattha paññā tattha sīlaṃ. Sīlavato paññā, paññavato sīlaṃ. Sīlapaññāṇañca pana lokasmiṃ aggamakkhāyati. Seyyathāpi, brāhmaṇa, hatthena vā hatthaṃ dhoveyya, pādena vā pādaṃ dhoveyya; evameva kho, brāhmaṇa, sīlaparidhotā paññā, paññāparidhotaṃ ",
      " sīlaṃ. Yattha sīlaṃ tattha paññā, yattha paññā tattha sīlaṃ. Sīlavato paññā, paññavato sīlaṃ. Sīlapaññāṇañca pana lokasmiṃ aggamakkhāyati ",
      "."
    ],
    "innerText": "317. ‘‘Imesaṃ pana, brāhmaṇa, dvinnaṃ aṅgānaṃ sakkā ekaṃ aṅgaṃ ṭhapayitvā ekena aṅgena samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapetuṃ; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti? ‘‘No hidaṃ, bho gotama. Sīlaparidhotā hi, bho gotama, paññā; paññāparidhotaṃ sīlaṃ. Yattha sīlaṃ tattha paññā, yattha paññā tattha sīlaṃ. Sīlavato paññā, paññavato sīlaṃ. Sīlapaññāṇañca pana lokasmiṃ aggamakkhāyati. Seyyathāpi, bho gotama, hatthena vā hatthaṃ dhoveyya, pādena vā pādaṃ dhoveyya; evameva kho, bho gotama, sīlaparidhotā paññā, paññāparidhotaṃ sīlaṃ. Yattha sīlaṃ tattha paññā, yattha paññā tattha sīlaṃ. Sīlavato paññā, paññavato sīlaṃ. Sīlapaññāṇañca pana lokasmiṃ aggamakkhāyatī’’ti. ‘‘Evametaṃ, brāhmaṇa, evametaṃ, brāhmaṇa, sīlaparidhotā hi, brāhmaṇa, paññā, paññāparidhotaṃ sīlaṃ. Yattha sīlaṃ tattha paññā, yattha paññā tattha sīlaṃ. Sīlavato paññā, paññavato sīlaṃ. Sīlapaññāṇañca pana lokasmiṃ aggamakkhāyati. Seyyathāpi, brāhmaṇa, hatthena vā hatthaṃ dhoveyya, pādena vā pādaṃ dhoveyya; evameva kho, brāhmaṇa, sīlaparidhotā paññā, paññāparidhotaṃ sīlaṃ. Yattha sīlaṃ tattha paññā, yattha paññā tattha sīlaṃ. Sīlavato paññā, paññavato sīlaṃ. Sīlapaññāṇañca pana lokasmiṃ aggamakkhāyati ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "318"
      },
      ". ‘‘Katamaṃ pana taṃ, brāhmaṇa, sīlaṃ? Katamā sā paññā’’ti? ‘‘Ettakaparamāva mayaṃ, bho gotama, etasmiṃ atthe. Sādhu vata bhavantaṃyeva gotamaṃ paṭibhātu etassa bhāsitassa attho’’ti. ‘‘Tena hi, brāhmaṇa, suṇohi; sādhukaṃ manasikarohi; bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho soṇadaṇḍo brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca – ‘‘idha, brāhmaṇa, tathāgato loke uppajjati arahaṃ sammāsambuddho…pe… (yathā 190-212 anucchedesu tathā vitthāretabbaṃ). Evaṃ kho, brāhmaṇa, bhikkhu sīlasampanno hoti. Idaṃ kho taṃ, brāhmaṇa, sīlaṃ…pe… paṭhamaṃ jhānaṃ upasampajja viharati…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati…pe… ñāṇadassanāya cittaṃ abhinīharati, abhininnāmeti. Idampissa hoti paññāya…pe… ",
      " nāparaṃ itthattāyāti pajānāti, idampissa hoti paññāya ayaṃ kho sā, brāhmaṇa, paññā’’ti."
    ],
    "innerText": "318. ‘‘Katamaṃ pana taṃ, brāhmaṇa, sīlaṃ? Katamā sā paññā’’ti? ‘‘Ettakaparamāva mayaṃ, bho gotama, etasmiṃ atthe. Sādhu vata bhavantaṃyeva gotamaṃ paṭibhātu etassa bhāsitassa attho’’ti. ‘‘Tena hi, brāhmaṇa, suṇohi; sādhukaṃ manasikarohi; bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho soṇadaṇḍo brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca – ‘‘idha, brāhmaṇa, tathāgato loke uppajjati arahaṃ sammāsambuddho…pe… (yathā 190-212 anucchedesu tathā vitthāretabbaṃ). Evaṃ kho, brāhmaṇa, bhikkhu sīlasampanno hoti. Idaṃ kho taṃ, brāhmaṇa, sīlaṃ…pe… paṭhamaṃ jhānaṃ upasampajja viharati…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati…pe… ñāṇadassanāya cittaṃ abhinīharati, abhininnāmeti. Idampissa hoti paññāya…pe… nāparaṃ itthattāyāti pajānāti, idampissa hoti paññāya ayaṃ kho sā, brāhmaṇa, paññā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Soṇadaṇḍaupāsakattapaṭivedanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "319"
      },
      ". Evaṃ vutte, soṇadaṇḍo brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ ",
      ", bho gotama, abhikkantaṃ, bho gotama ",
      ". Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya, ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi, dhammañca, bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gataṃ ",
      ". Adhivāsetu ca me bhavaṃ gotamo svātanāya bhattaṃ saddhiṃ bhikkhusaṅghenā’’ti. Adhivāsesi bhagavā tuṇhībhāvena."
    ],
    "innerText": "319. Evaṃ vutte, soṇadaṇḍo brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ , bho gotama, abhikkantaṃ, bho gotama . Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya, ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi, dhammañca, bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gataṃ . Adhivāsetu ca me bhavaṃ gotamo svātanāya bhattaṃ saddhiṃ bhikkhusaṅghenā’’ti. Adhivāsesi bhagavā tuṇhībhāvena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "320"
      },
      ". Atha kho soṇadaṇḍo brāhmaṇo bhagavato adhivāsanaṃ viditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho soṇadaṇḍo brāhmaṇo tassā rattiyā accayena sake nivesane paṇītaṃ khādanīyaṃ bhojanīyaṃ paṭiyādāpetvā bhagavato kālaṃ ārocāpesi – ‘‘kālo, bho gotama, niṭṭhitaṃ bhatta’’nti. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya saddhiṃ bhikkhusaṅghena yena soṇadaṇḍassa brāhmaṇassa nivesanaṃ tenupasaṅkami ",
      "; upasaṅkamitvā paññatte āsane nisīdi. Atha kho soṇadaṇḍo brāhmaṇo buddhappamukhaṃ bhikkhusaṅghaṃ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi."
    ],
    "innerText": "320. Atha kho soṇadaṇḍo brāhmaṇo bhagavato adhivāsanaṃ viditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho soṇadaṇḍo brāhmaṇo tassā rattiyā accayena sake nivesane paṇītaṃ khādanīyaṃ bhojanīyaṃ paṭiyādāpetvā bhagavato kālaṃ ārocāpesi – ‘‘kālo, bho gotama, niṭṭhitaṃ bhatta’’nti. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya saddhiṃ bhikkhusaṅghena yena soṇadaṇḍassa brāhmaṇassa nivesanaṃ tenupasaṅkami ; upasaṅkamitvā paññatte āsane nisīdi. Atha kho soṇadaṇḍo brāhmaṇo buddhappamukhaṃ bhikkhusaṅghaṃ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "321"
      },
      ". Atha kho soṇadaṇḍo brāhmaṇo bhagavantaṃ bhuttāviṃ onītapattapāṇiṃ aññataraṃ nīcaṃ āsanaṃ gahetvā ekamantaṃ nisīdi. Ekamantaṃ ",
      " nisinno kho soṇadaṇḍo brāhmaṇo bhagavantaṃ etadavoca – ‘‘ahañceva kho pana, bho gotama, parisagato samāno āsanā vuṭṭhahitvā bhavantaṃ gotamaṃ abhivādeyyaṃ, tena maṃ sā parisā paribhaveyya. Yaṃ kho pana sā parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Ahañceva kho pana, bho gotama, parisagato samāno añjaliṃ paggaṇheyyaṃ, āsanā me taṃ bhavaṃ gotamo paccuṭṭhānaṃ dhāretu. Ahañceva ",
      " kho pana, bho gotama, parisagato samāno veṭhanaṃ omuñceyyaṃ, sirasā me taṃ bhavaṃ gotamo abhivādanaṃ dhāretu. Ahañceva kho pana, bho gotama, yānagato samāno yānā paccorohitvā bhavantaṃ gotamaṃ abhivādeyyaṃ, tena maṃ sā parisā paribhaveyya. Yaṃ kho pana sā parisā paribhaveyya, yasopi tassa hāyetha, yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Ahañceva kho pana, bho gotama, yānagato samāno patodalaṭṭhiṃ abbhunnāmeyyaṃ, yānā me taṃ bhavaṃ gotamo paccorohanaṃ dhāretu. Ahañceva ",
      " kho pana, bho gotama, yānagato samāno chattaṃ apanāmeyyaṃ, sirasā me taṃ bhavaṃ gotamo abhivādanaṃ dhāretū’’ti."
    ],
    "innerText": "321. Atha kho soṇadaṇḍo brāhmaṇo bhagavantaṃ bhuttāviṃ onītapattapāṇiṃ aññataraṃ nīcaṃ āsanaṃ gahetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho soṇadaṇḍo brāhmaṇo bhagavantaṃ etadavoca – ‘‘ahañceva kho pana, bho gotama, parisagato samāno āsanā vuṭṭhahitvā bhavantaṃ gotamaṃ abhivādeyyaṃ, tena maṃ sā parisā paribhaveyya. Yaṃ kho pana sā parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Ahañceva kho pana, bho gotama, parisagato samāno añjaliṃ paggaṇheyyaṃ, āsanā me taṃ bhavaṃ gotamo paccuṭṭhānaṃ dhāretu. Ahañceva kho pana, bho gotama, parisagato samāno veṭhanaṃ omuñceyyaṃ, sirasā me taṃ bhavaṃ gotamo abhivādanaṃ dhāretu. Ahañceva kho pana, bho gotama, yānagato samāno yānā paccorohitvā bhavantaṃ gotamaṃ abhivādeyyaṃ, tena maṃ sā parisā paribhaveyya. Yaṃ kho pana sā parisā paribhaveyya, yasopi tassa hāyetha, yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Ahañceva kho pana, bho gotama, yānagato samāno patodalaṭṭhiṃ abbhunnāmeyyaṃ, yānā me taṃ bhavaṃ gotamo paccorohanaṃ dhāretu. Ahañceva kho pana, bho gotama, yānagato samāno chattaṃ apanāmeyyaṃ, sirasā me taṃ bhavaṃ gotamo abhivādanaṃ dhāretū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "322"
      },
      ". Atha kho bhagavā soṇadaṇḍaṃ brāhmaṇaṃ dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā uṭṭhāyāsanā pakkāmīti."
    ],
    "innerText": "322. Atha kho bhagavā soṇadaṇḍaṃ brāhmaṇaṃ dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā uṭṭhāyāsanā pakkāmīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Soṇadaṇḍasuttaṃ niṭṭhitaṃ catutthaṃ."
  }
]