[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "5. Cūḷayamakavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Sāleyyakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "439"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ yena sālā nāma kosalānaṃ brāhmaṇagāmo tadavasari. Assosuṃ kho sāleyyakā brāhmaṇagahapatikā – ‘‘samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ sālaṃ anuppatto. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ; kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti’. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’ti."
    ],
    "innerText": "439. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ yena sālā nāma kosalānaṃ brāhmaṇagāmo tadavasari. Assosuṃ kho sāleyyakā brāhmaṇagahapatikā – ‘‘samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ sālaṃ anuppatto. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ; kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti’. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho sāleyyakā brāhmaṇagahapatikā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā appekacce bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu; appekacce bhagavatā saddhiṃ sammodiṃsu, sammodanīyaṃ kathaṃ ",
      " sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu; appekacce yena bhagavā tenañjaliṃ paṇāmetvā ekamantaṃ nisīdiṃsu; appekacce bhagavato santike nāmagottaṃ sāvetvā ekamantaṃ nisīdiṃsu; appekacce tuṇhībhūtā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho sāleyyakā brāhmaṇagahapatikā bhagavantaṃ etadavocuṃ – ‘‘ko nu kho, bho gotama, hetu, ko paccayo, yena midhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti ",
      "? Ko pana, bho gotama, hetu, ko paccayo, yena midhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti?"
    ],
    "innerText": "Atha kho sāleyyakā brāhmaṇagahapatikā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā appekacce bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu; appekacce bhagavatā saddhiṃ sammodiṃsu, sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu; appekacce yena bhagavā tenañjaliṃ paṇāmetvā ekamantaṃ nisīdiṃsu; appekacce bhagavato santike nāmagottaṃ sāvetvā ekamantaṃ nisīdiṃsu; appekacce tuṇhībhūtā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho sāleyyakā brāhmaṇagahapatikā bhagavantaṃ etadavocuṃ – ‘‘ko nu kho, bho gotama, hetu, ko paccayo, yena midhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti ? Ko pana, bho gotama, hetu, ko paccayo, yena midhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Adhammacariyāvisamacariyāhetu kho, gahapatayo, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Dhammacariyāsamacariyāhetu ",
      " kho, gahapatayo, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti ",
      "."
    ],
    "innerText": "‘‘Adhammacariyāvisamacariyāhetu kho, gahapatayo, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Dhammacariyāsamacariyāhetu kho, gahapatayo, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na kho mayaṃ imassa bhoto gotamassa saṃkhittena bhāsitassa, vitthārena atthaṃ avibhattassa, vitthārena atthaṃ ājānāma. Sādhu no bhavaṃ gotamo tathā dhammaṃ desetu, yathā mayaṃ imassa bhoto gotamassa saṃkhittena bhāsitassa, vitthārena atthaṃ avibhattassa, vitthārena atthaṃ ājāneyyāmā’’ti. ‘‘Tena hi, gahapatayo, suṇātha, sādhukaṃ manasi karotha, bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho sāleyyakā brāhmaṇagahapatikā bhagavato paccassosuṃ. Bhagavā ",
      " etadavoca –"
    ],
    "innerText": "‘‘Na kho mayaṃ imassa bhoto gotamassa saṃkhittena bhāsitassa, vitthārena atthaṃ avibhattassa, vitthārena atthaṃ ājānāma. Sādhu no bhavaṃ gotamo tathā dhammaṃ desetu, yathā mayaṃ imassa bhoto gotamassa saṃkhittena bhāsitassa, vitthārena atthaṃ avibhattassa, vitthārena atthaṃ ājāneyyāmā’’ti. ‘‘Tena hi, gahapatayo, suṇātha, sādhukaṃ manasi karotha, bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho sāleyyakā brāhmaṇagahapatikā bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "440"
      },
      ". ‘‘Tividhaṃ kho, gahapatayo, kāyena adhammacariyāvisamacariyā hoti, catubbidhaṃ vācāya adhammacariyāvisamacariyā hoti, tividhaṃ manasā adhammacariyāvisamacariyā hoti."
    ],
    "innerText": "440. ‘‘Tividhaṃ kho, gahapatayo, kāyena adhammacariyāvisamacariyā hoti, catubbidhaṃ vācāya adhammacariyāvisamacariyā hoti, tividhaṃ manasā adhammacariyāvisamacariyā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, gahapatayo, tividhaṃ kāyena adhammacariyāvisamacariyā hoti? Idha, gahapatayo, ekacco pāṇātipātī hoti, luddo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[luddo dāruṇo (ka.) ṭīkā oloketabbā]"
      },
      " lohitapāṇi hatappahate niviṭṭho adayāpanno pāṇabhūtesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sabbapāṇabhūtesu (syā. kaṃ. ka.)]"
      },
      "."
    ],
    "innerText": "‘‘Kathañca, gahapatayo, tividhaṃ kāyena adhammacariyāvisamacariyā hoti? Idha, gahapatayo, ekacco pāṇātipātī hoti, luddo [luddo dāruṇo (ka.) ṭīkā oloketabbā] lohitapāṇi hatappahate niviṭṭho adayāpanno pāṇabhūtesu [sabbapāṇabhūtesu (syā. kaṃ. ka.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Adinnādāyī kho pana hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ, gāmagataṃ vā araññagataṃ vā, taṃ adinnaṃ theyyasaṅkhātaṃ ādātā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kāmesumicchācārī kho pana hoti. Yā tā māturakkhitā piturakkhitā mātāpiturakkhitā bhāturakkhitā bhaginirakkhitā ñātirakkhitā gottarakkhitā dhammarakkhitā sassāmikā saparidaṇḍā antamaso mālāguḷaparikkhittāpi, tathārūpāsu cārittaṃ āpajjitā hoti. Evaṃ kho, gahapatayo, tividhaṃ kāyena adhammacariyāvisamacariyā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", gahapatayo, catubbidhaṃ vācāya adhammacariyāvisamacariyā hoti? Idha, gahapatayo, ekacco musāvādī hoti. Sabhāgato vā parisāgato vā, ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā, abhinīto sakkhipuṭṭho – ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti ",
      ", so ajānaṃ vā āha – ‘jānāmī’ti, jānaṃ vā āha – ‘na jānāmī’ti, apassaṃ vā āha – ‘passāmī’ti, passaṃ vā āha – ‘na passāmī’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[so āha ajānaṃ vā ahaṃ jānāmīti jānaṃ vā ahaṃ na jānāmīti apassaṃ vā ahaṃ passāmīti passaṃ vā ahaṃ na passāmīti (ka.)]"
      },
      ". Iti attahetu vā parahetu vā āmisakiñcikkhahetu vā sampajānamusā bhāsitā hoti."
    ],
    "innerText": "‘‘Kathañca , gahapatayo, catubbidhaṃ vācāya adhammacariyāvisamacariyā hoti? Idha, gahapatayo, ekacco musāvādī hoti. Sabhāgato vā parisāgato vā, ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā, abhinīto sakkhipuṭṭho – ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti , so ajānaṃ vā āha – ‘jānāmī’ti, jānaṃ vā āha – ‘na jānāmī’ti, apassaṃ vā āha – ‘passāmī’ti, passaṃ vā āha – ‘na passāmī’ti [so āha ajānaṃ vā ahaṃ jānāmīti jānaṃ vā ahaṃ na jānāmīti apassaṃ vā ahaṃ passāmīti passaṃ vā ahaṃ na passāmīti (ka.)]. Iti attahetu vā parahetu vā āmisakiñcikkhahetu vā sampajānamusā bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pisuṇavāco kho pana hoti. Ito sutvā amutra akkhātā ",
      " imesaṃ bhedāya, amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya. Iti samaggānaṃ vā bhettā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhedakā (ka.), bhedetā (syā. kaṃ.), tadaṭṭhakathāyaṃ pana bhettāti dissati]"
      },
      ", bhinnānaṃ vā anuppadātā, vaggārāmo vaggarato vagganandī vaggakaraṇiṃ vācaṃ bhāsitā hoti."
    ],
    "innerText": "‘‘Pisuṇavāco kho pana hoti. Ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya. Iti samaggānaṃ vā bhettā [bhedakā (ka.), bhedetā (syā. kaṃ.), tadaṭṭhakathāyaṃ pana bhettāti dissati], bhinnānaṃ vā anuppadātā, vaggārāmo vaggarato vagganandī vaggakaraṇiṃ vācaṃ bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pharusavāco kho pana hoti. Yā sā vācā aṇḍakā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kaṇḍakā (ka.)]"
      },
      " kakkasā parakaṭukā parābhisajjanī kodhasāmantā asamādhisaṃvattanikā ",
      ", tathārūpiṃ vācaṃ bhāsitā hoti."
    ],
    "innerText": "‘‘Pharusavāco kho pana hoti. Yā sā vācā aṇḍakā [kaṇḍakā (ka.)] kakkasā parakaṭukā parābhisajjanī kodhasāmantā asamādhisaṃvattanikā , tathārūpiṃ vācaṃ bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samphappalāpī kho pana hoti. Akālavādī abhūtavādī anatthavādī adhammavādī avinayavādī. Anidhānavatiṃ vācaṃ bhāsitā hoti akālena anapadesaṃ apariyantavatiṃ anatthasaṃhitaṃ. Evaṃ kho, gahapatayo, catubbidhaṃ vācāya adhammacariyāvisamacariyā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, gahapatayo, tividhaṃ manasā adhammacariyāvisamacariyā hoti? Idha, gahapatayo, ekacco abhijjhālu hoti, yaṃ taṃ parassa paravittūpakaraṇaṃ taṃ abhijjhātā hoti – ‘aho vata yaṃ parassa taṃ mamassā’’’ti!"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Byāpannacitto kho pana hoti paduṭṭhamanasaṅkappo – ‘ime sattā haññantu vā vajjhantu vā ucchijjantu vā vinassantu vā mā vā ahesu’’’nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mā vā ahesuṃ iti vāti (sī. pī. ka.)]"
      },
      "."
    ],
    "innerText": "‘‘Byāpannacitto kho pana hoti paduṭṭhamanasaṅkappo – ‘ime sattā haññantu vā vajjhantu vā ucchijjantu vā vinassantu vā mā vā ahesu’’’nti [mā vā ahesuṃ iti vāti (sī. pī. ka.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Micchādiṭṭhiko kho pana hoti viparītadassano – ‘natthi dinnaṃ natthi yiṭṭhaṃ natthi hutaṃ, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, natthi ayaṃ loko natthi paro loko, natthi mātā natthi pitā, natthi sattā opapātikā ",
      ", natthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ",
      " ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Evaṃ kho, gahapatayo, tividhaṃ manasā adhammacariyāvisamacariyā ",
      " hoti."
    ],
    "innerText": "‘‘Micchādiṭṭhiko kho pana hoti viparītadassano – ‘natthi dinnaṃ natthi yiṭṭhaṃ natthi hutaṃ, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, natthi ayaṃ loko natthi paro loko, natthi mātā natthi pitā, natthi sattā opapātikā , natthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Evaṃ kho, gahapatayo, tividhaṃ manasā adhammacariyāvisamacariyā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Evaṃ adhammacariyāvisamacariyāhetu kho, gahapatayo, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "441"
      },
      ". ‘‘Tividhaṃ kho, gahapatayo, kāyena dhammacariyāsamacariyā hoti, catubbidhaṃ vācāya dhammacariyāsamacariyā hoti, tividhaṃ manasā dhammacariyāsamacariyā hoti."
    ],
    "innerText": "441. ‘‘Tividhaṃ kho, gahapatayo, kāyena dhammacariyāsamacariyā hoti, catubbidhaṃ vācāya dhammacariyāsamacariyā hoti, tividhaṃ manasā dhammacariyāsamacariyā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, gahapatayo, tividhaṃ kāyena dhammacariyāsamacariyā hoti? Idha, gahapatayo, ekacco pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti, nihitadaṇḍo nihitasattho lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Adinnādānaṃ pahāya adinnādānā paṭivirato hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ, gāmagataṃ vā araññagataṃ vā, taṃ nādinnaṃ theyyasaṅkhātaṃ ādātā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kāmesumicchācāraṃ pahāya kāmesumicchācārā paṭivirato hoti. Yā tā māturakkhitā piturakkhitā mātāpiturakkhitā bhāturakkhitā bhaginirakkhitā ñātirakkhitā gottarakkhitā dhammarakkhitā sassāmikā saparidaṇḍā antamaso mālāguḷaparikkhittāpi, tathārūpāsu na cārittaṃ āpajjitā hoti. Evaṃ kho, gahapatayo, tividhaṃ kāyena dhammacariyāsamacariyā ",
      " hoti."
    ],
    "innerText": "‘‘Kāmesumicchācāraṃ pahāya kāmesumicchācārā paṭivirato hoti. Yā tā māturakkhitā piturakkhitā mātāpiturakkhitā bhāturakkhitā bhaginirakkhitā ñātirakkhitā gottarakkhitā dhammarakkhitā sassāmikā saparidaṇḍā antamaso mālāguḷaparikkhittāpi, tathārūpāsu na cārittaṃ āpajjitā hoti. Evaṃ kho, gahapatayo, tividhaṃ kāyena dhammacariyāsamacariyā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, gahapatayo, catubbidhaṃ vācāya dhammacariyāsamacariyā hoti? Idha, gahapatayo, ekacco musāvādaṃ pahāya musāvādā paṭivirato hoti. Sabhāgato vā parisāgato vā, ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā, abhinīto sakkhipuṭṭho – ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti, so ",
      " ajānaṃ vā āha – ‘na jānāmī’ti, jānaṃ vā āha – ‘jānāmī’ti, apassaṃ vā āha – ‘na passāmī’ti, passaṃ vā āha ",
      " – ‘passāmī’ti. Iti attahetu vā parahetu vā āmisakiñcikkhahetu vā na sampajānamusā bhāsitā hoti."
    ],
    "innerText": "‘‘Kathañca, gahapatayo, catubbidhaṃ vācāya dhammacariyāsamacariyā hoti? Idha, gahapatayo, ekacco musāvādaṃ pahāya musāvādā paṭivirato hoti. Sabhāgato vā parisāgato vā, ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā, abhinīto sakkhipuṭṭho – ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti, so ajānaṃ vā āha – ‘na jānāmī’ti, jānaṃ vā āha – ‘jānāmī’ti, apassaṃ vā āha – ‘na passāmī’ti, passaṃ vā āha – ‘passāmī’ti. Iti attahetu vā parahetu vā āmisakiñcikkhahetu vā na sampajānamusā bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pisuṇaṃ ",
      " vācaṃ pahāya pisuṇāya vācāya paṭivirato hoti, ito sutvā na amutra akkhātā imesaṃ bhedāya, amutra vā sutvā na imesaṃ akkhātā amūsaṃ bhedāya. Iti bhinnānaṃ vā sandhātā, sahitānaṃ vā anuppadātā, samaggārāmo samaggarato samagganandī samaggakaraṇiṃ vācaṃ bhāsitā hoti."
    ],
    "innerText": "‘‘Pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato hoti, ito sutvā na amutra akkhātā imesaṃ bhedāya, amutra vā sutvā na imesaṃ akkhātā amūsaṃ bhedāya. Iti bhinnānaṃ vā sandhātā, sahitānaṃ vā anuppadātā, samaggārāmo samaggarato samagganandī samaggakaraṇiṃ vācaṃ bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti. Yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā – tathārūpiṃ vācaṃ bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti. Kālavādī bhūtavādī atthavādī dhammavādī vinayavādī nidhānavatiṃ vācaṃ bhāsitā hoti kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ. Evaṃ kho, gahapatayo, catubbidhaṃ vācāya dhammacariyāsamacariyā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, gahapatayo, tividhaṃ manasā dhammacariyāsamacariyā hoti? Idha, gahapatayo, ekacco anabhijjhālu hoti, yaṃ taṃ parassa paravittūpakaraṇaṃ taṃ nābhijjhātā hoti – ‘aho vata yaṃ parassa taṃ mamassā’ti!"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Abyāpannacitto kho pana hoti appaduṭṭhamanasaṅkappo – ‘ime sattā averā abyābajjhā anīghā sukhī attānaṃ pariharantū’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammādiṭṭhiko kho pana hoti aviparītadassano – ‘atthi dinnaṃ atthi yiṭṭhaṃ ",
      " atthi hutaṃ, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, atthi ayaṃ loko atthi paro loko, atthi mātā atthi pitā, atthi sattā opapātikā, atthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Evaṃ kho, gahapatayo, tividhaṃ manasā dhammacariyāsamacariyā hoti."
    ],
    "innerText": "‘‘Sammādiṭṭhiko kho pana hoti aviparītadassano – ‘atthi dinnaṃ atthi yiṭṭhaṃ atthi hutaṃ, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, atthi ayaṃ loko atthi paro loko, atthi mātā atthi pitā, atthi sattā opapātikā, atthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Evaṃ kho, gahapatayo, tividhaṃ manasā dhammacariyāsamacariyā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Evaṃ dhammacariyāsamacariyāhetu kho, gahapatayo, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "442"
      },
      ". ‘‘Ākaṅkheyya ",
      " ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā khattiyamahāsālānaṃ sahabyataṃ upapajjeyya’nti; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā khattiyamahāsālānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī."
    ],
    "innerText": "442. ‘‘Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā khattiyamahāsālānaṃ sahabyataṃ upapajjeyya’nti; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā khattiyamahāsālānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā brāhmaṇamahāsālānaṃ…pe… gahapatimahāsālānaṃ sahabyataṃ upapajjeyya’nti; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā gahapatimahāsālānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeya’nti; ṭhānaṃ kho panetaṃ ",
      " vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī."
    ],
    "innerText": "‘‘Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeya’nti; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā tāvatiṃsānaṃ devānaṃ…pe… yāmānaṃ devānaṃ… tusitānaṃ devānaṃ… nimmānaratīnaṃ devānaṃ… paranimmitavasavattīnaṃ devānaṃ… brahmakāyikānaṃ devānaṃ sahabyataṃ upapajjeyya’nti; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā brahmakāyikānaṃ devānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā ābhānaṃ devānaṃ sahabyataṃ upapajjeyya’nti; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā ābhānaṃ devānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā parittābhānaṃ devānaṃ…pe… appamāṇābhānaṃ devānaṃ… ābhassarānaṃ devānaṃ… parittasubhānaṃ ",
      " devānaṃ… appamāṇasubhānaṃ devānaṃ… subhakiṇhānaṃ devānaṃ… vehapphalānaṃ devānaṃ… avihānaṃ ",
      " devānaṃ… atappānaṃ devānaṃ… sudassānaṃ devānaṃ… sudassīnaṃ devānaṃ… akaniṭṭhānaṃ devānaṃ… ākāsānañcāyatanūpagānaṃ devānaṃ… viññāṇañcāyatanūpagānaṃ devānaṃ ",
      "… ākiñcaññāyatanūpagānaṃ devānaṃ… nevasaññānāsaññāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjeyya’nti; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā nevasaññānāsaññāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī."
    ],
    "innerText": "‘‘Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā parittābhānaṃ devānaṃ…pe… appamāṇābhānaṃ devānaṃ… ābhassarānaṃ devānaṃ… parittasubhānaṃ devānaṃ… appamāṇasubhānaṃ devānaṃ… subhakiṇhānaṃ devānaṃ… vehapphalānaṃ devānaṃ… avihānaṃ devānaṃ… atappānaṃ devānaṃ… sudassānaṃ devānaṃ… sudassīnaṃ devānaṃ… akaniṭṭhānaṃ devānaṃ… ākāsānañcāyatanūpagānaṃ devānaṃ… viññāṇañcāyatanūpagānaṃ devānaṃ … ākiñcaññāyatanūpagānaṃ devānaṃ… nevasaññānāsaññāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjeyya’nti; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā nevasaññānāsaññāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya’nti; ṭhānaṃ kho panetaṃ vijjati, yaṃ so āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "443"
      },
      ". Evaṃ ",
      " vutte, sāleyyakā brāhmaṇagahapatikā bhagavantaṃ etadavocuṃ – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya, cakkhumanto rūpāni dakkhantīti. Evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Ete mayaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāma dhammañca bhikkhusaṅghañca. Upāsake no bhavaṃ gotamo dhāretu ajjatagge pāṇupete ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pāṇupetaṃ (ka.)]"
      },
      " saraṇaṃ gate’’ti."
    ],
    "innerText": "443. Evaṃ vutte, sāleyyakā brāhmaṇagahapatikā bhagavantaṃ etadavocuṃ – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya, cakkhumanto rūpāni dakkhantīti. Evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Ete mayaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāma dhammañca bhikkhusaṅghañca. Upāsake no bhavaṃ gotamo dhāretu ajjatagge pāṇupete [pāṇupetaṃ (ka.)] saraṇaṃ gate’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sāleyyakasuttaṃ niṭṭhitaṃ paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Verañjakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "444"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena verañjakā brāhmaṇagahapatikā sāvatthiyaṃ paṭivasanti kenacideva karaṇīyena. Assosuṃ ",
      " kho verañjakā brāhmaṇagahapatikā – ‘‘samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ; kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti’. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’ti."
    ],
    "innerText": "444. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena verañjakā brāhmaṇagahapatikā sāvatthiyaṃ paṭivasanti kenacideva karaṇīyena. Assosuṃ kho verañjakā brāhmaṇagahapatikā – ‘‘samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ; kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti’. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho verañjakā brāhmaṇagahapatikā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā appekacce bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu; appekacce bhagavatā saddhiṃ sammodiṃsu, sammodanīyaṃ kathaṃ ",
      " sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu; appekacce yena bhagavā tenañjaliṃ paṇāmetvā ekamantaṃ nisīdiṃsu; appekacce bhagavato santike ",
      " nāmagottaṃ sāvetvā ekamantaṃ nisīdiṃsu; appekacce tuṇhībhūtā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho verañjakā brāhmaṇagahapatikā bhagavantaṃ etadavocuṃ – ‘‘ko nu kho, bho gotama, hetu, ko paccayo yena midhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti? Ko pana, bho gotama, hetu, ko paccayo yena midhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti?"
    ],
    "innerText": "Atha kho verañjakā brāhmaṇagahapatikā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā appekacce bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu; appekacce bhagavatā saddhiṃ sammodiṃsu, sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu; appekacce yena bhagavā tenañjaliṃ paṇāmetvā ekamantaṃ nisīdiṃsu; appekacce bhagavato santike nāmagottaṃ sāvetvā ekamantaṃ nisīdiṃsu; appekacce tuṇhībhūtā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho verañjakā brāhmaṇagahapatikā bhagavantaṃ etadavocuṃ – ‘‘ko nu kho, bho gotama, hetu, ko paccayo yena midhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti? Ko pana, bho gotama, hetu, ko paccayo yena midhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Adhammacariyāvisamacariyāhetu kho, gahapatayo, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Dhammacariyāsamacariyāhetu kho, gahapatayo ",
      ", evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti."
    ],
    "innerText": "‘‘Adhammacariyāvisamacariyāhetu kho, gahapatayo, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Dhammacariyāsamacariyāhetu kho, gahapatayo , evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na kho mayaṃ imassa bhoto gotamassa saṃkhittena bhāsitassa, vitthārena atthaṃ avibhattassa, vitthārena atthaṃ ājānāma. Sādhu no bhavaṃ gotamo tathā dhammaṃ desetu yathā mayaṃ imassa bhoto gotamassa saṃkhittena bhāsitassa, vitthārena atthaṃ avibhattassa, vitthārena atthaṃ ",
      " ājāneyyāmā’’ti. ‘‘Tena hi, gahapatayo, suṇātha sādhukaṃ manasi karotha, bhāsissāmī’’ti. ‘‘Evaṃ bho’’ti kho verañjakā brāhmaṇagahapatikā bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "‘‘Na kho mayaṃ imassa bhoto gotamassa saṃkhittena bhāsitassa, vitthārena atthaṃ avibhattassa, vitthārena atthaṃ ājānāma. Sādhu no bhavaṃ gotamo tathā dhammaṃ desetu yathā mayaṃ imassa bhoto gotamassa saṃkhittena bhāsitassa, vitthārena atthaṃ avibhattassa, vitthārena atthaṃ ājāneyyāmā’’ti. ‘‘Tena hi, gahapatayo, suṇātha sādhukaṃ manasi karotha, bhāsissāmī’’ti. ‘‘Evaṃ bho’’ti kho verañjakā brāhmaṇagahapatikā bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "445"
      },
      ". ‘‘Tividhaṃ kho, gahapatayo, kāyena adhammacārī visamacārī hoti, catubbidhaṃ vācāya adhammacārī visamacārī hoti, tividhaṃ manasā adhammacārī visamacārī hoti."
    ],
    "innerText": "445. ‘‘Tividhaṃ kho, gahapatayo, kāyena adhammacārī visamacārī hoti, catubbidhaṃ vācāya adhammacārī visamacārī hoti, tividhaṃ manasā adhammacārī visamacārī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, gahapatayo ",
      ", tividhaṃ kāyena adhammacārī visamacārī hoti? Idha, gahapatayo, ekacco pāṇātipātī hoti. Luddo lohitapāṇi hatappahate niviṭṭho adayāpanno pāṇabhūtesu. Adinnādāyī kho pana hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ… taṃ adinnaṃ theyyasaṅkhātaṃ ādātā hoti. Kāmesumicchācārī kho pana hoti. Yā tā māturakkhitā… tathārūpāsu cārittaṃ āpajjitā hoti. Evaṃ kho, gahapatayo, tividhaṃ kāyena adhammacārī visamacārī hoti."
    ],
    "innerText": "‘‘Kathañca, gahapatayo , tividhaṃ kāyena adhammacārī visamacārī hoti? Idha, gahapatayo, ekacco pāṇātipātī hoti. Luddo lohitapāṇi hatappahate niviṭṭho adayāpanno pāṇabhūtesu. Adinnādāyī kho pana hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ… taṃ adinnaṃ theyyasaṅkhātaṃ ādātā hoti. Kāmesumicchācārī kho pana hoti. Yā tā māturakkhitā… tathārūpāsu cārittaṃ āpajjitā hoti. Evaṃ kho, gahapatayo, tividhaṃ kāyena adhammacārī visamacārī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, gahapatayo, catubbidhaṃ vācāya adhammacārī visamacārī hoti? Idha, gahapatayo, ekacco musāvādī hoti. Sabhāgato vā… sampajānamusā bhāsitā hoti. Pisuṇavāco kho pana hoti. Ito sutvā amutra akkhātā… vaggakaraṇiṃ vācaṃ bhāsitā hoti. Pharusavāco kho pana hoti. Yā sā vācā aṇḍakā kakkasā… tathārūpiṃ vācaṃ bhāsitā hoti. Samphappalāpī kho pana hoti. Akālavādī… apariyantavatiṃ anatthasaṃhitaṃ. Evaṃ kho, gahapatayo, catubbidhaṃ vācāya adhammacārī visamacārī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, gahapatayo, tividhaṃ manasā adhammacārī visamacārī hoti? Idha, gahapatayo, ekacco abhijjhālu hoti…pe… taṃ mamassā’ti. Byāpannacitto kho pana hoti paduṭṭhamanasaṅkappo – ime sattā haññantu vā… mā vā ahesu’nti. Micchādiṭṭhiko kho pana ",
      " hoti viparītadassano – ‘natthi dinnaṃ, natthi yiṭṭhaṃ… sacchikatvā pavedentī’ti. Evaṃ ",
      " kho, gahapatayo, tividhaṃ manasā adhammacārī visamacārī hoti."
    ],
    "innerText": "‘‘Kathañca, gahapatayo, tividhaṃ manasā adhammacārī visamacārī hoti? Idha, gahapatayo, ekacco abhijjhālu hoti…pe… taṃ mamassā’ti. Byāpannacitto kho pana hoti paduṭṭhamanasaṅkappo – ime sattā haññantu vā… mā vā ahesu’nti. Micchādiṭṭhiko kho pana hoti viparītadassano – ‘natthi dinnaṃ, natthi yiṭṭhaṃ… sacchikatvā pavedentī’ti. Evaṃ kho, gahapatayo, tividhaṃ manasā adhammacārī visamacārī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Evaṃ adhammacariyāvisamacariyāhetu kho, gahapatayo, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "446"
      },
      ". ‘‘Tividhaṃ ",
      " kho, gahapatayo, kāyena dhammacārī samacārī hoti, catubbidhaṃ vācāya dhammacārī samacārī hoti, tividhaṃ manasā dhammacārī samacārī hoti."
    ],
    "innerText": "446. ‘‘Tividhaṃ kho, gahapatayo, kāyena dhammacārī samacārī hoti, catubbidhaṃ vācāya dhammacārī samacārī hoti, tividhaṃ manasā dhammacārī samacārī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, gahapatayo, tividhaṃ kāyena dhammacārī samacārī hoti? Idha, gahapatayo, ekacco pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti, nihitadaṇḍo nihitasattho lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati. Adinnādānaṃ pahāya adinnādānā paṭivirato hoti, yaṃ taṃ parassa… taṃ nādinnaṃ theyyasaṅkhātaṃ ādātā hoti. Kāmesumicchācāraṃ pahāya… tathārūpāsu na cārittaṃ āpajjitā hoti. Evaṃ kho, gahapatayo, tividhaṃ kāyena dhammacārī samacārī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, gahapatayo, catubbidhaṃ vācāya dhammacārī samacārī hoti? Idha, gahapatayo, ekacco musāvādaṃ pahāya musāvādā paṭivirato hoti. Sabhāgato vā…pe… na sampajānamusā bhāsitā hoti. Pisuṇaṃ vācaṃ pahāya… samaggakaraṇiṃ vācaṃ bhāsitā hoti. Pharusaṃ vācaṃ pahāya… tathārūpiṃ vācaṃ bhāsitā hoti. Samphappalāpaṃ pahāya… kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ ",
      ". Evaṃ kho, gahapatayo, catubbidhaṃ vācāya dhammacārī samacārī hoti."
    ],
    "innerText": "‘‘Kathañca, gahapatayo, catubbidhaṃ vācāya dhammacārī samacārī hoti? Idha, gahapatayo, ekacco musāvādaṃ pahāya musāvādā paṭivirato hoti. Sabhāgato vā…pe… na sampajānamusā bhāsitā hoti. Pisuṇaṃ vācaṃ pahāya… samaggakaraṇiṃ vācaṃ bhāsitā hoti. Pharusaṃ vācaṃ pahāya… tathārūpiṃ vācaṃ bhāsitā hoti. Samphappalāpaṃ pahāya… kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ . Evaṃ kho, gahapatayo, catubbidhaṃ vācāya dhammacārī samacārī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, gahapatayo, tividhaṃ manasā dhammacārī samacārī hoti? Idha, gahapatayo, ekacco anabhijjhālu hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ taṃ nābhijjhātā hoti ‘aho vata yaṃ parassa, taṃ mamassā’ti. Abyāpannacitto kho pana hoti appaduṭṭhamanasaṅkappo – ‘ime sattā averā abyābajjhā anīghā sukhī attānaṃ pariharantū’ti. Sammādiṭṭhiko kho pana hoti aviparītadassano – ‘atthi dinnaṃ, atthi yiṭṭhaṃ… sayaṃ abhiññā sacchikatvā pavedentī’ti. Evaṃ kho, gahapatayo, tividhaṃ manasā dhammacārī samacārī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ ",
      " dhammacariyāsamacariyāhetu kho, gahapatayo, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
    ],
    "innerText": "‘‘Evaṃ dhammacariyāsamacariyāhetu kho, gahapatayo, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "447"
      },
      ". ‘‘Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā khattiyamahāsālānaṃ sahabyataṃ upapajjeyya’nti ",
      "; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā khattiyamahāsālānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī."
    ],
    "innerText": "447. ‘‘Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā khattiyamahāsālānaṃ sahabyataṃ upapajjeyya’nti ; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā khattiyamahāsālānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā brāhmaṇamahāsālānaṃ gahapatimahāsālānaṃ sahabyataṃ upapajjeyya’nti; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā gahapatimahāsālānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu ",
      "? Tathā hi so dhammacārī samacārī."
    ],
    "innerText": "‘‘Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā brāhmaṇamahāsālānaṃ gahapatimahāsālānaṃ sahabyataṃ upapajjeyya’nti; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā gahapatimahāsālānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu ? Tathā hi so dhammacārī samacārī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ākaṅkeyya ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeyya’nti; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā tāvatiṃsānaṃ devānaṃ… yāmānaṃ devānaṃ… tusitānaṃ devānaṃ… nimmānaratīnaṃ devānaṃ… paranimmitavasavattīnaṃ devānaṃ… brahmakāyikānaṃ devānaṃ sahabyataṃ upapajjeyya’nti; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā brahmakāyikānaṃ devānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā ābhānaṃ devānaṃ sahabyataṃ upapajjeyya’nti; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā ābhānaṃ devānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ākaṅkheyya ",
      " ce, gahapatayo, dhammacārī samacārī ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā parittābhānaṃ devānaṃ…pe… appamāṇābhānaṃ devānaṃ… ābhassarānaṃ devānaṃ… parittasubhānaṃ devānaṃ… appamāṇasubhānaṃ devānaṃ… subhakiṇhānaṃ devānaṃ ",
      "… vehapphalānaṃ devānaṃ… avihānaṃ devānaṃ… atappānaṃ devānaṃ… sudassānaṃ devānaṃ… sudassīnaṃ devānaṃ… akaniṭṭhānaṃ devānaṃ… ākāsānañcāyatanūpagānaṃ devānaṃ… viññāṇañcāyatanūpagānaṃ ",
      " devānaṃ… ākiñcaññāyatanūpagānaṃ devānaṃ… nevasaññānāsaññāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjeyya’nti; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā nevasaññānāsaññāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī."
    ],
    "innerText": "‘‘Ākaṅkheyya ce, gahapatayo, dhammacārī samacārī ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā parittābhānaṃ devānaṃ…pe… appamāṇābhānaṃ devānaṃ… ābhassarānaṃ devānaṃ… parittasubhānaṃ devānaṃ… appamāṇasubhānaṃ devānaṃ… subhakiṇhānaṃ devānaṃ … vehapphalānaṃ devānaṃ… avihānaṃ devānaṃ… atappānaṃ devānaṃ… sudassānaṃ devānaṃ… sudassīnaṃ devānaṃ… akaniṭṭhānaṃ devānaṃ… ākāsānañcāyatanūpagānaṃ devānaṃ… viññāṇañcāyatanūpagānaṃ devānaṃ… ākiñcaññāyatanūpagānaṃ devānaṃ… nevasaññānāsaññāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjeyya’nti; ṭhānaṃ kho panetaṃ vijjati, yaṃ so kāyassa bhedā paraṃ maraṇā nevasaññānāsaññāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjeyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ākaṅkheyya ce gahapatayo dhammacārī samacārī – ‘aho vatāhaṃ āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya’nti; ṭhānaṃ kho panetaṃ vijjati, ‘yaṃ so āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya. Taṃ kissa hetu? Tathā hi so dhammacārī samacārī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "448"
      },
      ". Evaṃ vutte, verañjakā brāhmaṇagahapatikā bhagavantaṃ etadavocuṃ – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya, cakkhumanto rūpāni dakkhantīti; evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Ete mayaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāma ",
      " dhammañca bhikkhusaṅghañca. Upāsake no bhavaṃ gotamo dhāretu ajjatagge pāṇupete saraṇaṃ gate’’ti."
    ],
    "innerText": "448. Evaṃ vutte, verañjakā brāhmaṇagahapatikā bhagavantaṃ etadavocuṃ – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya, cakkhumanto rūpāni dakkhantīti; evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Ete mayaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāma dhammañca bhikkhusaṅghañca. Upāsake no bhavaṃ gotamo dhāretu ajjatagge pāṇupete saraṇaṃ gate’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Verañjakasuttaṃ niṭṭhitaṃ dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Mahāvedallasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "449"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā mahākoṭṭhiko sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mahākoṭṭhiko āyasmantaṃ sāriputtaṃ etadavoca ",
      " –"
    ],
    "innerText": "449. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā mahākoṭṭhiko sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mahākoṭṭhiko āyasmantaṃ sāriputtaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Duppañño duppañño’ti, āvuso, vuccati. Kittāvatā nu kho, āvuso, duppaññoti vuccatī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Nappajānāti nappajānātī’ti kho, āvuso, tasmā duppaññoti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kiñca nappajānāti? ‘Idaṃ dukkha’nti nappajānāti, ‘ayaṃ dukkhasamudayo’ti nappajānāti, ‘ayaṃ dukkhanirodho’ti nappajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti nappajānāti. ‘Nappajānāti nappajānātī’ti kho, āvuso, tasmā duppaññoti vuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Sādhāvuso’ti kho āyasmā mahākoṭṭhiko āyasmato sāriputtassa bhāsitaṃ abhinanditvā anumoditvā āyasmantaṃ sāriputtaṃ uttariṃ pañhaṃ apucchi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Paññavā paññavā’ti, āvuso, vuccati. Kittāvatā nu kho, āvuso, paññavāti vuccatī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Pajānāti pajānātī’ti kho, āvuso, tasmā paññavāti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiñca pajānāti? ‘Idaṃ dukkha’nti pajānāti, ‘ayaṃ dukkhasamudayo’ti pajānāti, ‘ayaṃ dukkhanirodho’ti ",
      " pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti pajānāti. ‘Pajānāti pajānātī’ti kho, āvuso, tasmā paññavāti vuccatī’’ti."
    ],
    "innerText": "‘‘Kiñca pajānāti? ‘Idaṃ dukkha’nti pajānāti, ‘ayaṃ dukkhasamudayo’ti pajānāti, ‘ayaṃ dukkhanirodho’ti pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti pajānāti. ‘Pajānāti pajānātī’ti kho, āvuso, tasmā paññavāti vuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Viññāṇaṃ viññāṇa’nti, āvuso, vuccati. Kittāvatā nu kho, āvuso, viññāṇanti vuccatī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Vijānāti vijānātī’ti kho, āvuso, tasmā viññāṇanti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kiñca vijānāti? Sukhantipi vijānāti, dukkhantipi vijānāti, adukkhamasukhantipi vijānāti. ‘Vijānāti vijānātī’ti kho, āvuso, tasmā viññāṇanti vuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yā cāvuso, paññā yañca viññāṇaṃ – ime dhammā saṃsaṭṭhā udāhu visaṃsaṭṭhā? Labbhā ca panimesaṃ dhammānaṃ vinibbhujitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vinibbhujjitvā vinibbhujjitvā (ka.)]"
      },
      " vinibbhujitvā nānākaraṇaṃ paññāpetu’’nti? ‘‘Yā cāvuso, paññā yañca viññāṇaṃ – ime dhammā saṃsaṭṭhā, no visaṃsaṭṭhā. Na ca labbhā imesaṃ dhammānaṃ vinibbhujitvā vinibbhujitvā nānākaraṇaṃ paññāpetuṃ. Yaṃ hāvuso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yañcāvuso (syā. kaṃ. ka.)]"
      },
      ", pajānāti taṃ vijānāti, yaṃ vijānāti taṃ pajānāti. Tasmā ",
      " ime dhammā saṃsaṭṭhā, no visaṃsaṭṭhā. Na ca labbhā imesaṃ dhammānaṃ vinibbhujitvā vinibbhujitvā nānākaraṇaṃ paññāpetu’’nti."
    ],
    "innerText": "‘‘Yā cāvuso, paññā yañca viññāṇaṃ – ime dhammā saṃsaṭṭhā udāhu visaṃsaṭṭhā? Labbhā ca panimesaṃ dhammānaṃ vinibbhujitvā [vinibbhujjitvā vinibbhujjitvā (ka.)] vinibbhujitvā nānākaraṇaṃ paññāpetu’’nti? ‘‘Yā cāvuso, paññā yañca viññāṇaṃ – ime dhammā saṃsaṭṭhā, no visaṃsaṭṭhā. Na ca labbhā imesaṃ dhammānaṃ vinibbhujitvā vinibbhujitvā nānākaraṇaṃ paññāpetuṃ. Yaṃ hāvuso [yañcāvuso (syā. kaṃ. ka.)], pajānāti taṃ vijānāti, yaṃ vijānāti taṃ pajānāti. Tasmā ime dhammā saṃsaṭṭhā, no visaṃsaṭṭhā. Na ca labbhā imesaṃ dhammānaṃ vinibbhujitvā vinibbhujitvā nānākaraṇaṃ paññāpetu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yā cāvuso, paññā yañca viññāṇaṃ – imesaṃ dhammānaṃ saṃsaṭṭhānaṃ no visaṃsaṭṭhānaṃ kiṃ nānākaraṇa’’nti? ‘‘Yā cāvuso, paññā yañca viññāṇaṃ – imesaṃ ",
      " dhammānaṃ saṃsaṭṭhānaṃ no visaṃsaṭṭhānaṃ paññā bhāvetabbā, viññāṇaṃ pariññeyyaṃ. Idaṃ nesaṃ nānākaraṇa’’nti."
    ],
    "innerText": "‘‘Yā cāvuso, paññā yañca viññāṇaṃ – imesaṃ dhammānaṃ saṃsaṭṭhānaṃ no visaṃsaṭṭhānaṃ kiṃ nānākaraṇa’’nti? ‘‘Yā cāvuso, paññā yañca viññāṇaṃ – imesaṃ dhammānaṃ saṃsaṭṭhānaṃ no visaṃsaṭṭhānaṃ paññā bhāvetabbā, viññāṇaṃ pariññeyyaṃ. Idaṃ nesaṃ nānākaraṇa’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "450"
      },
      ". ‘‘‘Vedanā vedanā’ti, āvuso, vuccati. Kittāvatā nu kho, āvuso ",
      ", vedanāti vuccatī’’ti?"
    ],
    "innerText": "450. ‘‘‘Vedanā vedanā’ti, āvuso, vuccati. Kittāvatā nu kho, āvuso , vedanāti vuccatī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Vedeti vedetī’ti kho, āvuso, tasmā vedanāti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiñca ",
      " vedeti? Sukhampi vedeti, dukkhampi vedeti, adukkhamasukhampi vedeti. ‘Vedeti vedetī’ti kho, āvuso, tasmā vedanāti vuccatī’’ti."
    ],
    "innerText": "‘‘Kiñca vedeti? Sukhampi vedeti, dukkhampi vedeti, adukkhamasukhampi vedeti. ‘Vedeti vedetī’ti kho, āvuso, tasmā vedanāti vuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Saññā saññā’ti, āvuso, vuccati. Kittāvatā nu kho, āvuso, saññāti vuccatī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Sañjānāti sañjānātī’ti kho, āvuso, tasmā saññāti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kiñca sañjānāti? Nīlakampi sañjānāti, pītakampi sañjānāti, lohitakampi sañjānāti, odātampi sañjānāti. ‘Sañjānāti sañjānātī’ti kho, āvuso, tasmā saññāti vuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yā cāvuso, vedanā yā ca saññā yañca viññāṇaṃ – ime dhammā saṃsaṭṭhā udāhu visaṃsaṭṭhā? Labbhā ca panimesaṃ dhammānaṃ vinibbhujitvā vinibbhujitvā nānākaraṇaṃ paññāpetu’’nti? ‘‘Yā cāvuso, vedanā yā ca saññā yañca viññāṇaṃ – ime dhammā saṃsaṭṭhā, no visaṃsaṭṭhā. Na ca labbhā imesaṃ dhammānaṃ vinibbhujitvā vinibbhujitvā nānākaraṇaṃ paññāpetuṃ. Yaṃ hāvuso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yañcāvuso (syā. kaṃ. ka.)]"
      },
      ", vedeti taṃ sañjānāti, yaṃ sañjānāti taṃ vijānāti. Tasmā ime dhammā saṃsaṭṭhā no visaṃsaṭṭhā. Na ca labbhā imesaṃ dhammānaṃ vinibbhujitvā vinibbhujitvā nānākaraṇaṃ paññāpetu’’nti."
    ],
    "innerText": "‘‘Yā cāvuso, vedanā yā ca saññā yañca viññāṇaṃ – ime dhammā saṃsaṭṭhā udāhu visaṃsaṭṭhā? Labbhā ca panimesaṃ dhammānaṃ vinibbhujitvā vinibbhujitvā nānākaraṇaṃ paññāpetu’’nti? ‘‘Yā cāvuso, vedanā yā ca saññā yañca viññāṇaṃ – ime dhammā saṃsaṭṭhā, no visaṃsaṭṭhā. Na ca labbhā imesaṃ dhammānaṃ vinibbhujitvā vinibbhujitvā nānākaraṇaṃ paññāpetuṃ. Yaṃ hāvuso [yañcāvuso (syā. kaṃ. ka.)], vedeti taṃ sañjānāti, yaṃ sañjānāti taṃ vijānāti. Tasmā ime dhammā saṃsaṭṭhā no visaṃsaṭṭhā. Na ca labbhā imesaṃ dhammānaṃ vinibbhujitvā vinibbhujitvā nānākaraṇaṃ paññāpetu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "451"
      },
      ". ‘‘Nissaṭṭhena hāvuso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nissaṭṭhena panāvuso (?)]"
      },
      ", pañcahi indriyehi parisuddhena manoviññāṇena kiṃ neyya’’nti?"
    ],
    "innerText": "451. ‘‘Nissaṭṭhena hāvuso [nissaṭṭhena panāvuso (?)], pañcahi indriyehi parisuddhena manoviññāṇena kiṃ neyya’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Nissaṭṭhena āvuso, pañcahi indriyehi parisuddhena manoviññāṇena ‘ananto ākāso’ti ākāsānañcāyatanaṃ ",
      " neyyaṃ, ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ neyyaṃ, ‘natthi kiñcī’ti ākiñcaññāyatanaṃ neyya’’nti."
    ],
    "innerText": "‘‘Nissaṭṭhena āvuso, pañcahi indriyehi parisuddhena manoviññāṇena ‘ananto ākāso’ti ākāsānañcāyatanaṃ neyyaṃ, ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ neyyaṃ, ‘natthi kiñcī’ti ākiñcaññāyatanaṃ neyya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Neyyaṃ panāvuso, dhammaṃ kena pajānātī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Neyyaṃ ",
      " kho, āvuso, dhammaṃ paññācakkhunā pajānātī’’ti."
    ],
    "innerText": "‘‘Neyyaṃ kho, āvuso, dhammaṃ paññācakkhunā pajānātī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Paññā panāvuso, kimatthiyā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Paññā kho, āvuso, abhiññatthā pariññatthā pahānatthā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "452"
      },
      ". ‘‘Kati ",
      " panāvuso, paccayā sammādiṭṭhiyā uppādāyā’’ti?"
    ],
    "innerText": "452. ‘‘Kati panāvuso, paccayā sammādiṭṭhiyā uppādāyā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dve kho, āvuso, paccayā sammādiṭṭhiyā uppādāya – parato ca ghoso, yoniso ca manasikāro. Ime kho, āvuso, dve paccayā sammādiṭṭhiyā uppādāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katihi panāvuso, aṅgehi anuggahitā sammādiṭṭhi cetovimuttiphalā ca hoti cetovimuttiphalānisaṃsā ca, paññāvimuttiphalā ca hoti paññāvimuttiphalānisaṃsā cā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcahi kho, āvuso, aṅgehi anuggahitā sammādiṭṭhi cetovimuttiphalā ca hoti cetovimuttiphalānisaṃsā ca, paññāvimuttiphalā ca hoti paññāvimuttiphalānisaṃsā ca. Idhāvuso, sammādiṭṭhi sīlānuggahitā ca hoti, sutānuggahitā ca hoti, sākacchānuggahitā ca hoti, samathānuggahitā ca hoti, vipassanānuggahitā ca hoti. Imehi kho, āvuso, pañcahaṅgehi anuggahitā sammādiṭṭhi cetovimuttiphalā ca hoti cetovimuttiphalānisaṃsā ca, paññāvimuttiphalā ca hoti paññāvimuttiphalānisaṃsā cā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "453"
      },
      ". ‘‘Kati panāvuso, bhavā’’ti?"
    ],
    "innerText": "453. ‘‘Kati panāvuso, bhavā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tayome, āvuso, bhavā – kāmabhavo ",
      ", rūpabhavo, arūpabhavo’’ti."
    ],
    "innerText": "‘‘Tayome, āvuso, bhavā – kāmabhavo , rūpabhavo, arūpabhavo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathaṃ panāvuso, āyatiṃ punabbhavābhinibbatti hotī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Avijjānīvaraṇānaṃ ",
      " kho, āvuso, sattānaṃ taṇhāsaṃyojanānaṃ tatratatrābhinandanā – evaṃ āyatiṃ punabbhavābhinibbatti hotī’’ti."
    ],
    "innerText": "‘‘Avijjānīvaraṇānaṃ kho, āvuso, sattānaṃ taṇhāsaṃyojanānaṃ tatratatrābhinandanā – evaṃ āyatiṃ punabbhavābhinibbatti hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathaṃ panāvuso, āyatiṃ punabbhavābhinibbatti na hotī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Avijjāvirāgā kho, āvuso, vijjuppādā taṇhānirodhā – evaṃ āyatiṃ punabbhavābhinibbatti na hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "454"
      },
      ". ‘‘Katamaṃ panāvuso, paṭhamaṃ jhāna’’nti?"
    ],
    "innerText": "454. ‘‘Katamaṃ panāvuso, paṭhamaṃ jhāna’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idhāvuso, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati – idaṃ vuccati, āvuso, paṭhamaṃ jhāna’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Paṭhamaṃ panāvuso, jhānaṃ katiaṅgika’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Paṭhamaṃ kho, āvuso, jhānaṃ pañcaṅgikaṃ. Idhāvuso, paṭhamaṃ jhānaṃ samāpannassa bhikkhuno vitakko ca vattati, vicāro ca pīti ca sukhañca cittekaggatā ca. Paṭhamaṃ kho, āvuso, jhānaṃ evaṃ pañcaṅgika’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Paṭhamaṃ panāvuso, jhānaṃ kataṅgavippahīnaṃ kataṅgasamannāgata’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Paṭhamaṃ kho, āvuso, jhānaṃ pañcaṅgavippahīnaṃ, pañcaṅgasamannāgataṃ. Idhāvuso, paṭhamaṃ jhānaṃ samāpannassa bhikkhuno kāmacchando pahīno ",
      " hoti, byāpādo pahīno hoti, thīnamiddhaṃ pahīnaṃ hoti, uddhaccakukkuccaṃ pahīnaṃ ",
      " hoti, vicikicchā pahīnā hoti; vitakko ca vattati, vicāro ca pīti ca sukhañca cittekaggatā ca. Paṭhamaṃ kho, āvuso, jhānaṃ evaṃ pañcaṅgavippahīnaṃ pañcaṅgasamannāgata’’nti."
    ],
    "innerText": "‘‘Paṭhamaṃ kho, āvuso, jhānaṃ pañcaṅgavippahīnaṃ, pañcaṅgasamannāgataṃ. Idhāvuso, paṭhamaṃ jhānaṃ samāpannassa bhikkhuno kāmacchando pahīno hoti, byāpādo pahīno hoti, thīnamiddhaṃ pahīnaṃ hoti, uddhaccakukkuccaṃ pahīnaṃ hoti, vicikicchā pahīnā hoti; vitakko ca vattati, vicāro ca pīti ca sukhañca cittekaggatā ca. Paṭhamaṃ kho, āvuso, jhānaṃ evaṃ pañcaṅgavippahīnaṃ pañcaṅgasamannāgata’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "455"
      },
      ". ‘‘Pañcimāni ",
      ", āvuso, indriyāni nānāvisayāni nānāgocarāni, na aññamaññassa ",
      " gocaravisayaṃ paccanubhonti, seyyathidaṃ – cakkhundriyaṃ, sotindriyaṃ, ghānindriyaṃ, jivhindriyaṃ, kāyindriyaṃ. Imesaṃ kho, āvuso, pañcannaṃ indriyānaṃ nānāvisayānaṃ nānāgocarānaṃ, na aññamaññassa gocaravisayaṃ paccanubhontānaṃ, kiṃ paṭisaraṇaṃ, ko ca nesaṃ gocaravisayaṃ paccanubhotī’’ti?"
    ],
    "innerText": "455. ‘‘Pañcimāni , āvuso, indriyāni nānāvisayāni nānāgocarāni, na aññamaññassa gocaravisayaṃ paccanubhonti, seyyathidaṃ – cakkhundriyaṃ, sotindriyaṃ, ghānindriyaṃ, jivhindriyaṃ, kāyindriyaṃ. Imesaṃ kho, āvuso, pañcannaṃ indriyānaṃ nānāvisayānaṃ nānāgocarānaṃ, na aññamaññassa gocaravisayaṃ paccanubhontānaṃ, kiṃ paṭisaraṇaṃ, ko ca nesaṃ gocaravisayaṃ paccanubhotī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcimāni, āvuso, indriyāni nānāvisayāni nānāgocarāni, na aññamaññassa gocaravisayaṃ paccanubhonti, seyyathidaṃ – cakkhundriyaṃ, sotindriyaṃ, ghānindriyaṃ, jivhindriyaṃ, kāyindriyaṃ. Imesaṃ kho, āvuso, pañcannaṃ indriyānaṃ nānāvisayānaṃ nānāgocarānaṃ, na aññamaññassa gocaravisayaṃ paccanubhontānaṃ, mano paṭisaraṇaṃ, mano ca nesaṃ gocaravisayaṃ paccanubhotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "456"
      },
      ". ‘‘Pañcimāni, āvuso, indriyāni, seyyathidaṃ – cakkhundriyaṃ, sotindriyaṃ, ghānindriyaṃ, jivhindriyaṃ, kāyindriyaṃ. Imāni kho, āvuso, pañcindriyāni kiṃ paṭicca tiṭṭhantī’’ti?"
    ],
    "innerText": "456. ‘‘Pañcimāni, āvuso, indriyāni, seyyathidaṃ – cakkhundriyaṃ, sotindriyaṃ, ghānindriyaṃ, jivhindriyaṃ, kāyindriyaṃ. Imāni kho, āvuso, pañcindriyāni kiṃ paṭicca tiṭṭhantī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcimāni, āvuso, indriyāni, seyyathidaṃ – cakkhundriyaṃ, sotindriyaṃ, ghānindriyaṃ, jivhindriyaṃ, kāyindriyaṃ. Imāni kho, āvuso, pañcindriyāni āyuṃ paṭicca tiṭṭhantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Āyu panāvuso, kiṃ paṭicca tiṭṭhatī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Āyu usmaṃ paṭicca tiṭṭhatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Usmā panāvuso, kiṃ paṭicca tiṭṭhatī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Usmā āyuṃ paṭicca tiṭṭhatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idāneva kho mayaṃ, āvuso, āyasmato sāriputtassa bhāsitaṃ evaṃ ājānāma – ‘āyu ",
      " usmaṃ paṭicca tiṭṭhatī’ti. Idāneva pana mayaṃ, āvuso, āyasmato ",
      " sāriputtassa bhāsitaṃ evaṃ ājānāma – ‘usmā āyuṃ paṭicca tiṭṭhatī’ti."
    ],
    "innerText": "‘‘Idāneva kho mayaṃ, āvuso, āyasmato sāriputtassa bhāsitaṃ evaṃ ājānāma – ‘āyu usmaṃ paṭicca tiṭṭhatī’ti. Idāneva pana mayaṃ, āvuso, āyasmato sāriputtassa bhāsitaṃ evaṃ ājānāma – ‘usmā āyuṃ paṭicca tiṭṭhatī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yathā kathaṃ panāvuso, imassa bhāsitassa attho daṭṭhabbo’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tena hāvuso, upamaṃ te karissāmi; upamāyapidhekacce viññū purisā bhāsitassa atthaṃ ājānanti. Seyyathāpi, āvuso, telappadīpassa jhāyato acciṃ paṭicca ābhā paññāyati, ābhaṃ paṭicca acci paññāyati; evameva kho, āvuso, āyu usmaṃ paṭicca tiṭṭhati, usmā āyuṃ paṭicca tiṭṭhatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "457"
      },
      ". ‘‘Teva ",
      " nu kho, āvuso, āyusaṅkhārā, te vedaniyā dhammā udāhu aññe āyusaṅkhārā aññe vedaniyā dhammā’’ti? ‘‘Na kho ",
      ", āvuso, teva āyusaṅkhārā te vedaniyā dhammā. Te ca hāvuso, āyusaṅkhārā abhaviṃsu te vedaniyā dhammā, na yidaṃ saññāvedayitanirodhaṃ samāpannassa bhikkhuno vuṭṭhānaṃ paññāyetha. Yasmā ca kho, āvuso, aññe āyusaṅkhārā aññe vedaniyā dhammā, tasmā saññāvedayitanirodhaṃ samāpannassa bhikkhuno vuṭṭhānaṃ paññāyatī’’ti."
    ],
    "innerText": "457. ‘‘Teva nu kho, āvuso, āyusaṅkhārā, te vedaniyā dhammā udāhu aññe āyusaṅkhārā aññe vedaniyā dhammā’’ti? ‘‘Na kho , āvuso, teva āyusaṅkhārā te vedaniyā dhammā. Te ca hāvuso, āyusaṅkhārā abhaviṃsu te vedaniyā dhammā, na yidaṃ saññāvedayitanirodhaṃ samāpannassa bhikkhuno vuṭṭhānaṃ paññāyetha. Yasmā ca kho, āvuso, aññe āyusaṅkhārā aññe vedaniyā dhammā, tasmā saññāvedayitanirodhaṃ samāpannassa bhikkhuno vuṭṭhānaṃ paññāyatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yadā nu kho, āvuso, imaṃ kāyaṃ kati dhammā jahanti; athāyaṃ kāyo ujjhito avakkhitto seti, yathā kaṭṭhaṃ acetana’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yadā kho, āvuso, imaṃ kāyaṃ tayo dhammā jahanti – āyu usmā ca viññāṇaṃ; athāyaṃ kāyo ujjhito avakkhitto seti, yathā kaṭṭhaṃ acetana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yvāyaṃ, āvuso, mato kālaṅkato, yo cāyaṃ bhikkhu saññāvedayitanirodhaṃ samāpanno – imesaṃ kiṃ nānākaraṇa’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yvāyaṃ, āvuso, mato kālaṅkato tassa kāyasaṅkhārā niruddhā paṭippassaddhā ",
      ", vacīsaṅkhārā niruddhā paṭippassaddhā, cittasaṅkhārā niruddhā paṭippassaddhā, āyu parikkhīṇo, usmā vūpasantā, indriyāni paribhinnāni. Yo cāyaṃ bhikkhu saññāvedayitanirodhaṃ samāpanno tassapi kāyasaṅkhārā niruddhā paṭippassaddhā, vacīsaṅkhārā niruddhā paṭippassaddhā, cittasaṅkhārā niruddhā paṭippassaddhā, āyu na parikkhīṇo, usmā avūpasantā, indriyāni vippasannāni. Yvāyaṃ, āvuso, mato kālaṅkato, yo cāyaṃ bhikkhu saññāvedayitanirodhaṃ samāpanno – idaṃ nesaṃ nānākaraṇa’’nti."
    ],
    "innerText": "‘‘Yvāyaṃ, āvuso, mato kālaṅkato tassa kāyasaṅkhārā niruddhā paṭippassaddhā , vacīsaṅkhārā niruddhā paṭippassaddhā, cittasaṅkhārā niruddhā paṭippassaddhā, āyu parikkhīṇo, usmā vūpasantā, indriyāni paribhinnāni. Yo cāyaṃ bhikkhu saññāvedayitanirodhaṃ samāpanno tassapi kāyasaṅkhārā niruddhā paṭippassaddhā, vacīsaṅkhārā niruddhā paṭippassaddhā, cittasaṅkhārā niruddhā paṭippassaddhā, āyu na parikkhīṇo, usmā avūpasantā, indriyāni vippasannāni. Yvāyaṃ, āvuso, mato kālaṅkato, yo cāyaṃ bhikkhu saññāvedayitanirodhaṃ samāpanno – idaṃ nesaṃ nānākaraṇa’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "458"
      },
      ". ‘‘Kati ",
      " panāvuso, paccayā adukkhamasukhāya cetovimuttiyā samāpattiyā’’ti?"
    ],
    "innerText": "458. ‘‘Kati panāvuso, paccayā adukkhamasukhāya cetovimuttiyā samāpattiyā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Cattāro kho, āvuso, paccayā adukkhamasukhāya cetovimuttiyā samāpattiyā. Idhāvuso, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. Ime kho, āvuso, cattāro paccayā adukkhamasukhāya cetovimuttiyā samāpattiyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kati panāvuso, paccayā animittāya cetovimuttiyā samāpattiyā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dve kho, āvuso, paccayā animittāya cetovimuttiyā samāpattiyā ",
      " – sabbanimittānañca amanasikāro, animittāya ca dhātuyā manasikāro. Ime kho, āvuso, dve paccayā animittāya cetovimuttiyā samāpattiyā’’ti."
    ],
    "innerText": "‘‘Dve kho, āvuso, paccayā animittāya cetovimuttiyā samāpattiyā – sabbanimittānañca amanasikāro, animittāya ca dhātuyā manasikāro. Ime kho, āvuso, dve paccayā animittāya cetovimuttiyā samāpattiyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kati panāvuso, paccayā animittāya cetovimuttiyā ṭhitiyā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tayo kho, āvuso, paccayā animittāya cetovimuttiyā ",
      " ṭhitiyā ",
      " – sabbanimittānañca amanasikāro, animittāya ca dhātuyā manasikāro, pubbe ca abhisaṅkhāro. Ime kho, āvuso, tayo paccayā animittāya cetovimuttiyā ṭhitiyā’’ti."
    ],
    "innerText": "‘‘Tayo kho, āvuso, paccayā animittāya cetovimuttiyā ṭhitiyā – sabbanimittānañca amanasikāro, animittāya ca dhātuyā manasikāro, pubbe ca abhisaṅkhāro. Ime kho, āvuso, tayo paccayā animittāya cetovimuttiyā ṭhitiyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kati panāvuso, paccayā animittāya cetovimuttiyā vuṭṭhānāyā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dve kho, āvuso, paccayā animittāya cetovimuttiyā vuṭṭhānāya – sabbanimittānañca manasikāro, animittāya ca dhātuyā amanasikāro. Ime kho, āvuso, dve paccayā animittāya cetovimuttiyā vuṭṭhānāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "459"
      },
      ". ‘‘Yā cāyaṃ, āvuso, appamāṇā cetovimutti, yā ca ākiñcaññā cetovimutti, yā ca suññatā cetovimutti, yā ca animittā cetovimutti – ime dhammā nānātthā ceva nānābyañjanā ca udāhu ekatthā byañjanameva nāna’’nti?"
    ],
    "innerText": "459. ‘‘Yā cāyaṃ, āvuso, appamāṇā cetovimutti, yā ca ākiñcaññā cetovimutti, yā ca suññatā cetovimutti, yā ca animittā cetovimutti – ime dhammā nānātthā ceva nānābyañjanā ca udāhu ekatthā byañjanameva nāna’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yā cāyaṃ, āvuso, appamāṇā cetovimutti, yā ca ākiñcaññā cetovimutti, yā ca suññatā cetovimutti, yā ca animittā cetovimutti – atthi kho, āvuso, pariyāyo yaṃ pariyāyaṃ āgamma ime dhammā nānātthā ceva nānābyañjanā ca; atthi ca kho, āvuso, pariyāyo yaṃ pariyāyaṃ āgamma ime dhammā ekatthā, byañjanameva nānaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ",
      " cāvuso, pariyāyo yaṃ pariyāyaṃ āgamma ime dhammā nānātthā ceva nānābyañjanā ca’’?"
    ],
    "innerText": "‘‘Katamo cāvuso, pariyāyo yaṃ pariyāyaṃ āgamma ime dhammā nānātthā ceva nānābyañjanā ca’’?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idhāvuso, bhikkhu mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena ",
      " cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā viharati. Karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho ",
      " tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā viharati. Ayaṃ vuccatāvuso, appamāṇā cetovimutti’’."
    ],
    "innerText": "‘‘Idhāvuso, bhikkhu mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā viharati. Karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā viharati. Ayaṃ vuccatāvuso, appamāṇā cetovimutti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā cāvuso, ākiñcaññā cetovimutti’’?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idhāvuso, bhikkhu sabbaso viññāṇañcāyatanaṃ samatikkamma natthi kiñcīti ākiñcaññāyatanaṃ upasampajja viharati. Ayaṃ vuccatāvuso, ākiñcaññā cetovimutti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā cāvuso, suññatā cetovimutti’’?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idhāvuso, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā iti paṭisañcikkhati – ‘suññamidaṃ attena vā attaniyena vā’ti. Ayaṃ ",
      " vuccatāvuso, suññatā cetovimutti’’."
    ],
    "innerText": "‘‘Idhāvuso, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā iti paṭisañcikkhati – ‘suññamidaṃ attena vā attaniyena vā’ti. Ayaṃ vuccatāvuso, suññatā cetovimutti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā cāvuso, animittā cetovimutti’’?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idhāvuso, bhikkhu sabbanimittānaṃ amanasikārā animittaṃ cetosamādhiṃ upasampajja viharati. Ayaṃ vuccatāvuso, animittā cetovimutti. Ayaṃ kho, āvuso, pariyāyo yaṃ pariyāyaṃ āgamma ime dhammā nānātthā ceva nānābyañjanā ca’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo cāvuso, pariyāyo yaṃ pariyāyaṃ āgamma ime dhammā ekatthā byañjanameva nānaṃ’’?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Rāgo kho, āvuso, pamāṇakaraṇo, doso pamāṇakaraṇo, moho pamāṇakaraṇo. Te khīṇāsavassa bhikkhuno pahīnā ",
      " ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Yāvatā kho, āvuso, appamāṇā cetovimuttiyo, akuppā tāsaṃ cetovimutti aggamakkhāyati. Sā kho panākuppā cetovimutti suññā rāgena, suññā dosena, suññā mohena. Rāgo kho, āvuso, kiñcano, doso kiñcano, moho kiñcano. Te khīṇāsavassa bhikkhuno pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Yāvatā kho, āvuso, ākiñcaññā cetovimuttiyo, akuppā tāsaṃ cetovimutti aggamakkhāyati. Sā kho panākuppā cetovimutti suññā rāgena, suññā dosena ",
      ", suññā mohena. Rāgo kho, āvuso, nimittakaraṇo, doso nimittakaraṇo, moho nimittakaraṇo. Te ",
      " khīṇāsavassa bhikkhuno pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Yāvatā kho, āvuso, animittā cetovimuttiyo, akuppā tāsaṃ cetovimutti aggamakkhāyati. Sā kho panākuppā cetovimutti suññā rāgena, suññā dosena, suññā mohena. Ayaṃ kho, āvuso, pariyāyo yaṃ pariyāyaṃ āgamma ime dhammā ekatthā byañjanameva nāna’’nti."
    ],
    "innerText": "‘‘Rāgo kho, āvuso, pamāṇakaraṇo, doso pamāṇakaraṇo, moho pamāṇakaraṇo. Te khīṇāsavassa bhikkhuno pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Yāvatā kho, āvuso, appamāṇā cetovimuttiyo, akuppā tāsaṃ cetovimutti aggamakkhāyati. Sā kho panākuppā cetovimutti suññā rāgena, suññā dosena, suññā mohena. Rāgo kho, āvuso, kiñcano, doso kiñcano, moho kiñcano. Te khīṇāsavassa bhikkhuno pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Yāvatā kho, āvuso, ākiñcaññā cetovimuttiyo, akuppā tāsaṃ cetovimutti aggamakkhāyati. Sā kho panākuppā cetovimutti suññā rāgena, suññā dosena , suññā mohena. Rāgo kho, āvuso, nimittakaraṇo, doso nimittakaraṇo, moho nimittakaraṇo. Te khīṇāsavassa bhikkhuno pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Yāvatā kho, āvuso, animittā cetovimuttiyo, akuppā tāsaṃ cetovimutti aggamakkhāyati. Sā kho panākuppā cetovimutti suññā rāgena, suññā dosena, suññā mohena. Ayaṃ kho, āvuso, pariyāyo yaṃ pariyāyaṃ āgamma ime dhammā ekatthā byañjanameva nāna’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavocāyasmā sāriputto. Attamano āyasmā mahākoṭṭhiko āyasmato sāriputtassa bhāsitaṃ abhinandīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahāvedallasuttaṃ niṭṭhitaṃ tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Cūḷavedallasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "460"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho visākho upāsako yena dhammadinnā bhikkhunī tenupasaṅkami; upasaṅkamitvā dhammadinnaṃ bhikkhuniṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho visākho upāsako dhammadinnaṃ bhikkhuniṃ etadavoca – ‘‘‘sakkāyo sakkāyo’ti, ayye, vuccati. Katamo nu kho, ayye, sakkāyo vutto bhagavatā’’ti? ‘‘Pañca kho ime, āvuso visākha, upādānakkhandhā sakkāyo vutto bhagavatā, seyyathidaṃ – rūpupādānakkhandho, vedanupādānakkhandho, saññupādānakkhandho, saṅkhārupādānakkhandho, viññāṇupādānakkhandho. Ime kho, āvuso visākha, pañcupādānakkhandhā sakkāyo vutto bhagavatā’’ti."
    ],
    "innerText": "460. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho visākho upāsako yena dhammadinnā bhikkhunī tenupasaṅkami; upasaṅkamitvā dhammadinnaṃ bhikkhuniṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho visākho upāsako dhammadinnaṃ bhikkhuniṃ etadavoca – ‘‘‘sakkāyo sakkāyo’ti, ayye, vuccati. Katamo nu kho, ayye, sakkāyo vutto bhagavatā’’ti? ‘‘Pañca kho ime, āvuso visākha, upādānakkhandhā sakkāyo vutto bhagavatā, seyyathidaṃ – rūpupādānakkhandho, vedanupādānakkhandho, saññupādānakkhandho, saṅkhārupādānakkhandho, viññāṇupādānakkhandho. Ime kho, āvuso visākha, pañcupādānakkhandhā sakkāyo vutto bhagavatā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhayye’’ti kho visākho upāsako dhammadinnāya bhikkhuniyā bhāsitaṃ abhinanditvā anumoditvā dhammadinnaṃ bhikkhuniṃ uttariṃ pañhaṃ apucchi – ‘‘‘sakkāyasamudayo sakkāyasamudayo’ti, ayye, vuccati. Katamo nu kho, ayye, sakkāyasamudayo vutto bhagavatā’’ti? ‘‘Yāyaṃ, āvuso visākha, taṇhā ponobbhavikā nandīrāgasahagatā tatratatrābhinandinī, seyyathidaṃ – kāmataṇhā bhavataṇhā vibhavataṇhā; ayaṃ kho, āvuso visākha, sakkāyasamudayo vutto bhagavatā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Sakkāyanirodho ",
      " sakkāyanirodho’ti, ayye, vuccati. Katamo nu kho, ayye, sakkāyanirodho vutto bhagavatā’’ti?"
    ],
    "innerText": "‘‘‘Sakkāyanirodho sakkāyanirodho’ti, ayye, vuccati. Katamo nu kho, ayye, sakkāyanirodho vutto bhagavatā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo ",
      " kho, āvuso visākha, tassāyeva taṇhāya asesavirāganirodho cāgo paṭinissaggo mutti anālayo; ayaṃ kho, āvuso visākha, sakkāyanirodho vutto bhagavatā’’ti."
    ],
    "innerText": "‘‘Yo kho, āvuso visākha, tassāyeva taṇhāya asesavirāganirodho cāgo paṭinissaggo mutti anālayo; ayaṃ kho, āvuso visākha, sakkāyanirodho vutto bhagavatā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Sakkāyanirodhagāminī paṭipadā sakkāyanirodhagāminī paṭipadā’ti, ayye, vuccati. Katamā nu kho, ayye, sakkāyanirodhagāminī paṭipadā vuttā bhagavatā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ayameva kho, āvuso visākha, ariyo aṭṭhaṅgiko maggo sakkāyanirodhagāminī paṭipadā vuttā bhagavatā, seyyathidaṃ ",
      " – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhī’’ti."
    ],
    "innerText": "‘‘Ayameva kho, āvuso visākha, ariyo aṭṭhaṅgiko maggo sakkāyanirodhagāminī paṭipadā vuttā bhagavatā, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taññeva nu kho, ayye, upādānaṃ te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[teva (sī.)]"
      },
      " pañcupādānakkhandhā udāhu aññatra pañcahupādānakkhandhehi upādāna’’nti? ‘‘Na kho, āvuso visākha, taññeva upādānaṃ te pañcupādānakkhandhā, nāpi ",
      " aññatra pañcahupādānakkhandhehi upādānaṃ. Yo kho, āvuso visākha, pañcasu upādānakkhandhesu chandarāgo taṃ tattha upādāna’’nti."
    ],
    "innerText": "‘‘Taññeva nu kho, ayye, upādānaṃ te [teva (sī.)] pañcupādānakkhandhā udāhu aññatra pañcahupādānakkhandhehi upādāna’’nti? ‘‘Na kho, āvuso visākha, taññeva upādānaṃ te pañcupādānakkhandhā, nāpi aññatra pañcahupādānakkhandhehi upādānaṃ. Yo kho, āvuso visākha, pañcasu upādānakkhandhesu chandarāgo taṃ tattha upādāna’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "461"
      },
      ". ‘‘Kathaṃ panāyye, sakkāyadiṭṭhi hotī’’ti? ‘‘Idhāvuso visākha, assutavā puthujjano, ariyānaṃ adassāvī ariyadhammassa akovido ariyadhamme avinīto, sappurisānaṃ adassāvī sappurisadhammassa akovido sappurisadhamme avinīto, rūpaṃ attato samanupassati, rūpavantaṃ vā attānaṃ, attani vā rūpaṃ, rūpasmiṃ vā attānaṃ. Vedanaṃ…pe… saññaṃ… saṅkhāre… viññāṇaṃ attato samanupassati, viññāṇavantaṃ vā attānaṃ, attani vā viññāṇaṃ, viññāṇasmiṃ vā attānaṃ. Evaṃ kho ",
      ", āvuso visākha, sakkāyadiṭṭhi hotī’’ti."
    ],
    "innerText": "461. ‘‘Kathaṃ panāyye, sakkāyadiṭṭhi hotī’’ti? ‘‘Idhāvuso visākha, assutavā puthujjano, ariyānaṃ adassāvī ariyadhammassa akovido ariyadhamme avinīto, sappurisānaṃ adassāvī sappurisadhammassa akovido sappurisadhamme avinīto, rūpaṃ attato samanupassati, rūpavantaṃ vā attānaṃ, attani vā rūpaṃ, rūpasmiṃ vā attānaṃ. Vedanaṃ…pe… saññaṃ… saṅkhāre… viññāṇaṃ attato samanupassati, viññāṇavantaṃ vā attānaṃ, attani vā viññāṇaṃ, viññāṇasmiṃ vā attānaṃ. Evaṃ kho , āvuso visākha, sakkāyadiṭṭhi hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathaṃ panāyye, sakkāyadiṭṭhi na hotī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idhāvuso visākha, sutavā ariyasāvako, ariyānaṃ dassāvī ariyadhammassa kovido ariyadhamme suvinīto, sappurisānaṃ dassāvī sappurisadhammassa kovido sappurisadhamme suvinīto, na rūpaṃ attato samanupassati, na rūpavantaṃ vā attānaṃ, na attani vā rūpaṃ, na rūpasmiṃ vā attānaṃ. Na vedanaṃ…pe… na saññaṃ… na saṅkhāre…pe… na viññāṇaṃ attato samanupassati, na viññāṇavantaṃ vā attānaṃ ",
      ", na attani vā viññāṇaṃ, na viññāṇasmiṃ vā attānaṃ. Evaṃ kho, āvuso visākha, sakkāyadiṭṭhi na hotī’’ti."
    ],
    "innerText": "‘‘Idhāvuso visākha, sutavā ariyasāvako, ariyānaṃ dassāvī ariyadhammassa kovido ariyadhamme suvinīto, sappurisānaṃ dassāvī sappurisadhammassa kovido sappurisadhamme suvinīto, na rūpaṃ attato samanupassati, na rūpavantaṃ vā attānaṃ, na attani vā rūpaṃ, na rūpasmiṃ vā attānaṃ. Na vedanaṃ…pe… na saññaṃ… na saṅkhāre…pe… na viññāṇaṃ attato samanupassati, na viññāṇavantaṃ vā attānaṃ , na attani vā viññāṇaṃ, na viññāṇasmiṃ vā attānaṃ. Evaṃ kho, āvuso visākha, sakkāyadiṭṭhi na hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "462"
      },
      ". ‘‘Katamo panāyye, ariyo aṭṭhaṅgiko maggo’’ti?"
    ],
    "innerText": "462. ‘‘Katamo panāyye, ariyo aṭṭhaṅgiko maggo’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ayameva kho, āvuso visākha, ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto ",
      " sammāājīvo sammāvāyāmo sammāsati sammāsamādhī’’ti. ‘‘Ariyo panāyye, aṭṭhaṅgiko maggo saṅkhato udāhu asaṅkhato’’ti?"
    ],
    "innerText": "‘‘Ayameva kho, āvuso visākha, ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhī’’ti. ‘‘Ariyo panāyye, aṭṭhaṅgiko maggo saṅkhato udāhu asaṅkhato’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ariyo kho, āvuso visākha, aṭṭhaṅgiko maggo saṅkhato’’ti ",
      "."
    ],
    "innerText": "‘‘Ariyo kho, āvuso visākha, aṭṭhaṅgiko maggo saṅkhato’’ti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ariyena nu kho, ayye, aṭṭhaṅgikena maggena tayo khandhā saṅgahitā udāhu tīhi khandhehi ariyo aṭṭhaṅgiko maggo saṅgahito’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na kho, āvuso visākha, ariyena aṭṭhaṅgikena maggena tayo khandhā saṅgahitā; tīhi ca kho, āvuso visākha, khandhehi ariyo aṭṭhaṅgiko maggo saṅgahito. Yā cāvuso visākha, sammāvācā yo ca sammākammanto yo ca sammāājīvo ime dhammā ",
      " sīlakkhandhe saṅgahitā. Yo ca sammāvāyāmo yā ca sammāsati yo ca sammāsamādhi ime dhammā samādhikkhandhe saṅgahitā. Yā ca sammādiṭṭhi yo ca sammāsaṅkappo, ime dhammā paññākkhandhe saṅgahitā’’ti."
    ],
    "innerText": "‘‘Na kho, āvuso visākha, ariyena aṭṭhaṅgikena maggena tayo khandhā saṅgahitā; tīhi ca kho, āvuso visākha, khandhehi ariyo aṭṭhaṅgiko maggo saṅgahito. Yā cāvuso visākha, sammāvācā yo ca sammākammanto yo ca sammāājīvo ime dhammā sīlakkhandhe saṅgahitā. Yo ca sammāvāyāmo yā ca sammāsati yo ca sammāsamādhi ime dhammā samādhikkhandhe saṅgahitā. Yā ca sammādiṭṭhi yo ca sammāsaṅkappo, ime dhammā paññākkhandhe saṅgahitā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo panāyye, samādhi, katame dhammā samādhinimittā, katame dhammā samādhiparikkhārā, katamā samādhibhāvanā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yā kho, āvuso visākha, cittassa ekaggatā ayaṃ samādhi; cattāro satipaṭṭhānā samādhinimittā; cattāro sammappadhānā samādhiparikkhārā. Yā tesaṃyeva dhammānaṃ āsevanā bhāvanā bahulīkammaṃ, ayaṃ ettha samādhibhāvanā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "463"
      },
      ". ‘‘Kati panāyye, saṅkhārā’’ti?"
    ],
    "innerText": "463. ‘‘Kati panāyye, saṅkhārā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tayome, āvuso visākha, saṅkhārā – kāyasaṅkhāro, vacīsaṅkhāro, cittasaṅkhāro’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo panāyye, kāyasaṅkhāro, katamo vacīsaṅkhāro, katamo cittasaṅkhāro’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Assāsapassāsā kho, āvuso visākha, kāyasaṅkhāro, vitakkavicārā vacīsaṅkhāro, saññā ca vedanā ca cittasaṅkhāro’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kasmā panāyye, assāsapassāsā kāyasaṅkhāro, kasmā vitakkavicārā vacīsaṅkhāro, kasmā saññā ca vedanā ca cittasaṅkhāro’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Assāsapassāsā kho, āvuso ",
      " visākha, kāyikā ete dhammā kāyappaṭibaddhā, tasmā assāsapassāsā kāyasaṅkhāro. Pubbe kho, āvuso visākha, vitakketvā vicāretvā pacchā vācaṃ bhindati, tasmā vitakkavicārā vacīsaṅkhāro. Saññā ca vedanā ca cetasikā ete dhammā ",
      " cittappaṭibaddhā, tasmā saññā ca vedanā ca cittasaṅkhāro’’ti."
    ],
    "innerText": "‘‘Assāsapassāsā kho, āvuso visākha, kāyikā ete dhammā kāyappaṭibaddhā, tasmā assāsapassāsā kāyasaṅkhāro. Pubbe kho, āvuso visākha, vitakketvā vicāretvā pacchā vācaṃ bhindati, tasmā vitakkavicārā vacīsaṅkhāro. Saññā ca vedanā ca cetasikā ete dhammā cittappaṭibaddhā, tasmā saññā ca vedanā ca cittasaṅkhāro’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "464"
      },
      ". ‘‘Kathaṃ ",
      " panāyye, saññāvedayitanirodhasamāpatti hotī’’ti?"
    ],
    "innerText": "464. ‘‘Kathaṃ panāyye, saññāvedayitanirodhasamāpatti hotī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na kho, āvuso visākha, saññāvedayitanirodhaṃ samāpajjantassa bhikkhuno evaṃ hoti – ‘ahaṃ saññāvedayitanirodhaṃ samāpajjissa’nti vā, ‘ahaṃ saññāvedayitanirodhaṃ samāpajjāmī’ti vā, ‘ahaṃ saññāvedayitanirodhaṃ samāpanno’ti vā. Atha khvāssa pubbeva tathā cittaṃ bhāvitaṃ hoti yaṃ taṃ tathattāya upanetī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Saññāvedayitanirodhaṃ samāpajjantassa ",
      " panāyye, bhikkhuno katame dhammā paṭhamaṃ nirujjhanti – yadi vā kāyasaṅkhāro, yadi vā vacīsaṅkhāro, yadi vā cittasaṅkhāro’’ti? ‘‘Saññāvedayitanirodhaṃ samāpajjantassa kho, āvuso visākha, bhikkhuno paṭhamaṃ nirujjhati vacīsaṅkhāro, tato kāyasaṅkhāro, tato cittasaṅkhāro’’ti."
    ],
    "innerText": "‘‘Saññāvedayitanirodhaṃ samāpajjantassa panāyye, bhikkhuno katame dhammā paṭhamaṃ nirujjhanti – yadi vā kāyasaṅkhāro, yadi vā vacīsaṅkhāro, yadi vā cittasaṅkhāro’’ti? ‘‘Saññāvedayitanirodhaṃ samāpajjantassa kho, āvuso visākha, bhikkhuno paṭhamaṃ nirujjhati vacīsaṅkhāro, tato kāyasaṅkhāro, tato cittasaṅkhāro’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathaṃ panāyye, saññāvedayitanirodhasamāpattiyā vuṭṭhānaṃ hotī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na kho, āvuso visākha, saññāvedayitanirodhasamāpattiyā vuṭṭhahantassa bhikkhuno evaṃ hoti – ‘ahaṃ saññāvedayitanirodhasamāpattiyā vuṭṭhahissa’nti vā, ‘ahaṃ saññāvedayitanirodhasamāpattiyā vuṭṭhahāmī’ti vā, ‘ahaṃ saññāvedayitanirodhasamāpattiyā vuṭṭhito’ti vā. Atha khvāssa pubbeva tathā cittaṃ bhāvitaṃ hoti yaṃ taṃ tathattāya upanetī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Saññāvedayitanirodhasamāpattiyā vuṭṭhahantassa panāyye, bhikkhuno katame dhammā paṭhamaṃ uppajjanti – yadi vā kāyasaṅkhāro, yadi vā vacīsaṅkhāro, yadi ",
      " vā cittasaṅkhāro’’ti? ‘‘Saññāvedayitanirodhasamāpattiyā vuṭṭhahantassa kho, āvuso visākha, bhikkhuno paṭhamaṃ uppajjati cittasaṅkhāro, tato kāyasaṅkhāro, tato vacīsaṅkhāro’’ti."
    ],
    "innerText": "‘‘Saññāvedayitanirodhasamāpattiyā vuṭṭhahantassa panāyye, bhikkhuno katame dhammā paṭhamaṃ uppajjanti – yadi vā kāyasaṅkhāro, yadi vā vacīsaṅkhāro, yadi vā cittasaṅkhāro’’ti? ‘‘Saññāvedayitanirodhasamāpattiyā vuṭṭhahantassa kho, āvuso visākha, bhikkhuno paṭhamaṃ uppajjati cittasaṅkhāro, tato kāyasaṅkhāro, tato vacīsaṅkhāro’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Saññāvedayitanirodhasamāpattiyā vuṭṭhitaṃ panāyye, bhikkhuṃ kati phassā phusantī’’ti? ‘‘Saññāvedayitanirodhasamāpattiyā vuṭṭhitaṃ kho, āvuso ",
      " visākha, bhikkhuṃ tayo phassā phusanti – suññato phasso, animitto phasso, appaṇihito phasso’’ti."
    ],
    "innerText": "‘‘Saññāvedayitanirodhasamāpattiyā vuṭṭhitaṃ panāyye, bhikkhuṃ kati phassā phusantī’’ti? ‘‘Saññāvedayitanirodhasamāpattiyā vuṭṭhitaṃ kho, āvuso visākha, bhikkhuṃ tayo phassā phusanti – suññato phasso, animitto phasso, appaṇihito phasso’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Saññāvedayitanirodhasamāpattiyā vuṭṭhitassa panāyye, bhikkhuno kiṃninnaṃ cittaṃ hoti kiṃpoṇaṃ kiṃpabbhāra’’nti? ‘‘Saññāvedayitanirodhasamāpattiyā vuṭṭhitassa kho, āvuso visākha, bhikkhuno vivekaninnaṃ cittaṃ hoti, vivekapoṇaṃ vivekapabbhāra’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "465"
      },
      ". ‘‘Kati ",
      " panāyye, vedanā’’ti?"
    ],
    "innerText": "465. ‘‘Kati panāyye, vedanā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tisso kho imā, āvuso visākha, vedanā – sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā panāyye, sukhā vedanā, katamā dukkhā vedanā, katamā adukkhamasukhā vedanā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yaṃ kho, āvuso visākha, kāyikaṃ vā cetasikaṃ vā sukhaṃ sātaṃ vedayitaṃ – ayaṃ sukhā vedanā. Yaṃ kho, āvuso visākha, kāyikaṃ vā cetasikaṃ vā dukkhaṃ asātaṃ vedayitaṃ – ayaṃ dukkhā vedanā. Yaṃ kho, āvuso visākha, kāyikaṃ vā cetasikaṃ vā neva sātaṃ nāsātaṃ vedayitaṃ – ayaṃ adukkhamasukhā ",
      " vedanā’’ti."
    ],
    "innerText": "‘‘Yaṃ kho, āvuso visākha, kāyikaṃ vā cetasikaṃ vā sukhaṃ sātaṃ vedayitaṃ – ayaṃ sukhā vedanā. Yaṃ kho, āvuso visākha, kāyikaṃ vā cetasikaṃ vā dukkhaṃ asātaṃ vedayitaṃ – ayaṃ dukkhā vedanā. Yaṃ kho, āvuso visākha, kāyikaṃ vā cetasikaṃ vā neva sātaṃ nāsātaṃ vedayitaṃ – ayaṃ adukkhamasukhā vedanā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sukhā panāyye, vedanā kiṃsukhā kiṃdukkhā, dukkhā vedanā kiṃsukhā kiṃdukkhā, adukkhamasukhā vedanā kiṃsukhā kiṃdukkhā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sukhā kho, āvuso visākha, vedanā ṭhitisukhā vipariṇāmadukkhā; dukkhā vedanā ṭhitidukkhā vipariṇāmasukhā ",
      "; adukkhamasukhā vedanā ñāṇasukhā aññāṇadukkhā’’ti."
    ],
    "innerText": "‘‘Sukhā kho, āvuso visākha, vedanā ṭhitisukhā vipariṇāmadukkhā; dukkhā vedanā ṭhitidukkhā vipariṇāmasukhā ; adukkhamasukhā vedanā ñāṇasukhā aññāṇadukkhā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sukhāya panāyye, vedanāya kiṃ anusayo anuseti, dukkhāya vedanāya kiṃ anusayo anuseti, adukkhamasukhāya vedanāya kiṃ anusayo anusetī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sukhāya kho, āvuso visākha, vedanāya rāgānusayo anuseti, dukkhāya vedanāya paṭighānusayo anuseti, adukkhamasukhāya vedanāya avijjānusayo anusetī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sabbāya nu kho, ayye, sukhāya vedanāya rāgānusayo anuseti, sabbāya dukkhāya vedanāya paṭighānusayo anuseti, sabbāya adukkhamasukhāya vedanāya avijjānusayo anusetī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na kho, āvuso visākha, sabbāya sukhāya vedanāya rāgānusayo anuseti, na sabbāya dukkhāya vedanāya paṭighānusayo anuseti, na sabbāya adukkhamasukhāya vedanāya avijjānusayo anusetī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sukhāya ",
      " panāyye, vedanāya kiṃ pahātabbaṃ, dukkhāya vedanāya kiṃ pahātabbaṃ, adukkhamasukhāya vedanāya kiṃ pahātabba’’nti?"
    ],
    "innerText": "‘‘Sukhāya panāyye, vedanāya kiṃ pahātabbaṃ, dukkhāya vedanāya kiṃ pahātabbaṃ, adukkhamasukhāya vedanāya kiṃ pahātabba’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sukhāya kho, āvuso visākha, vedanāya rāgānusayo pahātabbo, dukkhāya vedanāya paṭighānusayo pahātabbo, adukkhamasukhāya vedanāya avijjānusayo pahātabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sabbāya ",
      " nu kho, ayye, sukhāya vedanāya rāgānusayo pahātabbo, sabbāya dukkhāya vedanāya paṭighānusayo pahātabbo, sabbāya adukkhamasukhāya vedanāya avijjānusayo pahātabbo’’ti?"
    ],
    "innerText": "‘‘Sabbāya nu kho, ayye, sukhāya vedanāya rāgānusayo pahātabbo, sabbāya dukkhāya vedanāya paṭighānusayo pahātabbo, sabbāya adukkhamasukhāya vedanāya avijjānusayo pahātabbo’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na kho, āvuso visākha, sabbāya sukhāya vedanāya rāgānusayo pahātabbo, na sabbāya dukkhāya vedanāya paṭighānusayo pahātabbo ",
      ", na sabbāya adukkhamasukhāya vedanāya avijjānusayo pahātabbo. Idhāvuso visākha, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Rāgaṃ tena pajahati, na tattha rāgānusayo anuseti. Idhāvuso visākha, bhikkhu iti paṭisañcikkhati – ‘kudāssu nāmāhaṃ tadāyatanaṃ upasampajja viharissāmi yadariyā etarahi āyatanaṃ upasampajja viharantī’ti? Iti anuttaresu vimokkhesu pihaṃ upaṭṭhāpayato ",
      " uppajjati pihāppaccayā domanassaṃ. Paṭighaṃ tena pajahati, na tattha paṭighānusayo anuseti. Idhāvuso visākha, bhikkhu sukhassa ca pahānā, dukkhassa ca pahānā, pubbeva somanassadomanassānaṃ atthaṅgamā, adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. Avijjaṃ tena pajahati, na tattha avijjānusayo anusetī’’ti."
    ],
    "innerText": "‘‘Na kho, āvuso visākha, sabbāya sukhāya vedanāya rāgānusayo pahātabbo, na sabbāya dukkhāya vedanāya paṭighānusayo pahātabbo , na sabbāya adukkhamasukhāya vedanāya avijjānusayo pahātabbo. Idhāvuso visākha, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Rāgaṃ tena pajahati, na tattha rāgānusayo anuseti. Idhāvuso visākha, bhikkhu iti paṭisañcikkhati – ‘kudāssu nāmāhaṃ tadāyatanaṃ upasampajja viharissāmi yadariyā etarahi āyatanaṃ upasampajja viharantī’ti? Iti anuttaresu vimokkhesu pihaṃ upaṭṭhāpayato uppajjati pihāppaccayā domanassaṃ. Paṭighaṃ tena pajahati, na tattha paṭighānusayo anuseti. Idhāvuso visākha, bhikkhu sukhassa ca pahānā, dukkhassa ca pahānā, pubbeva somanassadomanassānaṃ atthaṅgamā, adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. Avijjaṃ tena pajahati, na tattha avijjānusayo anusetī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "466"
      },
      ". ‘‘Sukhāya panāyye, vedanāya kiṃ paṭibhāgo’’ti?"
    ],
    "innerText": "466. ‘‘Sukhāya panāyye, vedanāya kiṃ paṭibhāgo’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sukhāya kho, āvuso visākha, vedanāya dukkhā vedanā paṭibhāgo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dukkhāya pannāyye, vedanāya kiṃ paṭibhāgo’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dukkhāya kho, āvuso visākha, vedanāya sukhā vedanā paṭibhāgo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Adukkhamasukhāya panāyye, vedanāya kiṃ paṭibhāgo’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Adukkhamasukhāya kho, āvuso visākha, vedanāya avijjā paṭibhāgo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Avijjāya panāyye, kiṃ paṭibhāgo’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Avijjāya kho, āvuso visākha, vijjā paṭibhāgo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Vijjāya panāyye, kiṃ paṭibhāgo’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Vijjāya kho, āvuso visākha, vimutti paṭibhāgo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Vimuttiyā panāyye ",
      ", kiṃ paṭibhāgo’’ti?"
    ],
    "innerText": "‘‘Vimuttiyā panāyye , kiṃ paṭibhāgo’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Vimuttiyā kho, āvuso visākha, nibbānaṃ paṭibhāgo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Nibbānassa panāyye, kiṃ paṭibhāgo’’ti? ‘‘Accayāsi, āvuso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[accasarāvuso (sī. pī.), accassarāvuso (syā. kaṃ.)]"
      },
      " visākha, pañhaṃ, nāsakkhi pañhānaṃ pariyantaṃ gahetuṃ. Nibbānogadhañhi, āvuso visākha, brahmacariyaṃ, nibbānaparāyanaṃ nibbānapariyosānaṃ. Ākaṅkhamāno ca tvaṃ, āvuso visākha, bhagavantaṃ upasaṅkamitvā etamatthaṃ puccheyyāsi, yathā ca te bhagavā byākaroti tathā naṃ dhāreyyāsī’’ti."
    ],
    "innerText": "‘‘Nibbānassa panāyye, kiṃ paṭibhāgo’’ti? ‘‘Accayāsi, āvuso [accasarāvuso (sī. pī.), accassarāvuso (syā. kaṃ.)] visākha, pañhaṃ, nāsakkhi pañhānaṃ pariyantaṃ gahetuṃ. Nibbānogadhañhi, āvuso visākha, brahmacariyaṃ, nibbānaparāyanaṃ nibbānapariyosānaṃ. Ākaṅkhamāno ca tvaṃ, āvuso visākha, bhagavantaṃ upasaṅkamitvā etamatthaṃ puccheyyāsi, yathā ca te bhagavā byākaroti tathā naṃ dhāreyyāsī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "467"
      },
      ". Atha kho visākho upāsako dhammadinnāya bhikkhuniyā bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā dhammadinnaṃ bhikkhuniṃ abhivādetvā padakkhiṇaṃ katvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho visākho upāsako yāvatako ahosi dhammadinnāya bhikkhuniyā saddhiṃ kathāsallāpo taṃ sabbaṃ bhagavato ārocesi. Evaṃ vutte, bhagavā visākhaṃ upāsakaṃ etadavoca – ‘‘paṇḍitā, visākha, dhammadinnā bhikkhunī, mahāpaññā, visākha, dhammadinnā bhikkhunī. Maṃ cepi tvaṃ, visākha, etamatthaṃ puccheyyāsi, ahampi taṃ evamevaṃ byākareyyaṃ, yathā ",
      " taṃ dhammadinnāya bhikkhuniyā byākataṃ. Eso cevetassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[esovetassa (syā. kaṃ.)]"
      },
      " attho. Evañca naṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[evametaṃ (sī. syā. kaṃ.)]"
      },
      " dhārehī’’ti."
    ],
    "innerText": "467. Atha kho visākho upāsako dhammadinnāya bhikkhuniyā bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā dhammadinnaṃ bhikkhuniṃ abhivādetvā padakkhiṇaṃ katvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho visākho upāsako yāvatako ahosi dhammadinnāya bhikkhuniyā saddhiṃ kathāsallāpo taṃ sabbaṃ bhagavato ārocesi. Evaṃ vutte, bhagavā visākhaṃ upāsakaṃ etadavoca – ‘‘paṇḍitā, visākha, dhammadinnā bhikkhunī, mahāpaññā, visākha, dhammadinnā bhikkhunī. Maṃ cepi tvaṃ, visākha, etamatthaṃ puccheyyāsi, ahampi taṃ evamevaṃ byākareyyaṃ, yathā taṃ dhammadinnāya bhikkhuniyā byākataṃ. Eso cevetassa [esovetassa (syā. kaṃ.)] attho. Evañca naṃ [evametaṃ (sī. syā. kaṃ.)] dhārehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Attamano visākho upāsako bhagavato bhāsitaṃ abhinandīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cūḷavedallasuttaṃ niṭṭhitaṃ catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Cūḷadhammasamādānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "468"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘cattārimāni, bhikkhave, dhammasamādānāni. Katamāni cattāri? Atthi, bhikkhave, dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ; atthi, bhikkhave ",
      ", dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ; atthi, bhikkhave, dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ; atthi, bhikkhave, dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ’’."
    ],
    "innerText": "468. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘cattārimāni, bhikkhave, dhammasamādānāni. Katamāni cattāri? Atthi, bhikkhave, dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ; atthi, bhikkhave , dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ; atthi, bhikkhave, dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ; atthi, bhikkhave, dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "469"
      },
      ". ‘‘Katamañca, bhikkhave, dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ? Santi, bhikkhave, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘natthi kāmesu doso’ti. Te kāmesu pātabyataṃ āpajjanti. Te kho moḷibaddhāhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[moḷibandhāhi (syā. kaṃ. ka.)]"
      },
      " paribbājikāhi paricārenti. Te evamāhaṃsu – ‘kiṃsu nāma te bhonto samaṇabrāhmaṇā kāmesu anāgatabhayaṃ sampassamānā kāmānaṃ pahānamāhaṃsu, kāmānaṃ pariññaṃ paññapenti? Sukho imissā paribbājikāya taruṇāya mudukāya lomasāya bāhāya samphasso’ti te kāmesu pātabyataṃ āpajjanti. Te kāmesu pātabyataṃ āpajjitvā kāyassa bhedā paraṃ maraṇā apāyaṃ ",
      " duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Te tattha dukkhā tibbā kharā kaṭukā vedanā vedayanti. Te evamāhaṃsu – ‘idaṃ kho te bhonto samaṇabrāhmaṇā kāmesu anāgatabhayaṃ sampassamānā kāmānaṃ pahānamāhaṃsu, kāmānaṃ pariññaṃ paññapenti, ime hi mayaṃ kāmahetu kāmanidānaṃ ",
      " dukkhā tibbā kharā kaṭukā vedanā vedayāmā’ti. Seyyathāpi, bhikkhave, gimhānaṃ pacchime māse māluvāsipāṭikā phaleyya. Atha kho taṃ, bhikkhave, māluvābījaṃ aññatarasmiṃ sālamūle nipateyya. Atha kho, bhikkhave, yā tasmiṃ sāle adhivatthā devatā sā bhītā saṃviggā santāsaṃ āpajjeyya. Atha kho, bhikkhave, tasmiṃ sāle adhivatthāya devatāya mittāmaccā ñātisālohitā ārāmadevatā vanadevatā rukkhadevatā osadhitiṇavanappatīsu adhivatthā devatā saṅgamma samāgamma evaṃ samassāseyyuṃ – ‘mā bhavaṃ bhāyi, mā bhavaṃ bhāyi; appeva nāmetaṃ māluvābījaṃ ",
      " moro vā gileyya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[moro vā gileyya, godhā vā khādeyya (ka.)]"
      },
      ", mago vā khādeyya, davaḍāho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vanadāho (ka.)]"
      },
      " vā ḍaheyya, vanakammikā vā uddhareyyuṃ, upacikā vā uṭṭhaheyyuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[udrabheyyuṃ (sī. pī. ka.)]"
      },
      ", abījaṃ vā panassā’ti. Atha kho taṃ, bhikkhave, māluvābījaṃ neva moro gileyya, na mago khādeyya, na davaḍāho ḍaheyya, na vanakammikā uddhareyyuṃ, na upacikā uṭṭhaheyyuṃ, bījañca panassa taṃ pāvussakena meghena abhippavuṭṭhaṃ ",
      " sammadeva viruheyya. Sāssa māluvālatā taruṇā mudukā lomasā vilambinī, sā taṃ sālaṃ upaniseveyya. Atha kho, bhikkhave, tasmiṃ sāle adhivatthāya devatāya evamassa – ‘kiṃsu nāma te ",
      " bhonto mittāmaccā ñātisālohitā ārāmadevatā vanadevatā rukkhadevatā osadhitiṇavanappatīsu adhivatthā devatā māluvābīje anāgatabhayaṃ sampassamānā saṅgamma samāgamma evaṃ samassāsesuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samassāseyyuṃ (ka.)]"
      },
      " – ‘‘mā bhavaṃ bhāyi mā bhavaṃ bhāyi, appeva nāmetaṃ māluvābījaṃ moro vā gileyya, mago vā khādeyya, davaḍāho vā ḍaheyya, vanakammikā vā uddhareyyuṃ, upacikā vā uṭṭhaheyyuṃ, abījaṃ vā panassā’’ti; sukho imissā māluvālatāya taruṇāya mudukāya lomasāya vilambiniyā samphasso’ti. Sā taṃ sālaṃ anuparihareyya. Sā taṃ sālaṃ anupariharitvā upari viṭabhiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[viṭapaṃ (syā. ṭṭha.)]"
      },
      " kareyya. Upari viṭabhiṃ karitvā oghanaṃ janeyya. Oghanaṃ janetvā ye tassa sālassa mahantā mahantā khandhā te padāleyya. Atha kho, bhikkhave, tasmiṃ sāle adhivatthāya devatāya evamassa – ‘idaṃ kho te bhonto mittāmaccā ñātisālohitā ārāmadevatā vanadevatā rukkhadevatā osadhitiṇavanappatīsu adhivatthā devatā māluvābīje anāgatabhayaṃ sampassamānā saṅgamma samāgamma evaṃ samassāsesuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samassāseyyuṃ (ka.)]"
      },
      " – ‘‘mā bhavaṃ bhāyi mā bhavaṃ bhāyi, appeva nāmetaṃ māluvābījaṃ moro vā gileyya, mago ",
      " vā khādeyya, davaḍāho vā ḍaheyya, vanakammikā vā uddhareyyuṃ, upacikā vā uṭṭhaheyyuṃ abījaṃ vā panassā’’ti. Yañcāhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yaṃ vāhaṃ (ka.), svāhaṃ (syā. kaṃ.)]"
      },
      " māluvābījahetu dukkhā tibbā kharā kaṭukā vedanā vedayāmī’ti. Evameva kho, bhikkhave, santi eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino ‘natthi kāmesu doso’ti ",
      ". Te kāmesu pātabyataṃ āpajjanti. Te moḷibaddhāhi paribbājikāhi paricārenti. Te evamāhaṃsu – ‘kiṃsu nāma te bhonto samaṇabrāhmaṇā kāmesu anāgatabhayaṃ sampassamānā kāmānaṃ pahānamāhaṃsu, kāmānaṃ pariññaṃ paññapenti? Sukho imissā paribbājikāya taruṇāya mudukāya lomasāya bāhāya samphasso’ti. Te kāmesu pātabyataṃ āpajjanti. Te kāmesu pātabyataṃ āpajjitvā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Te tattha dukkhā tibbā kharā ",
      " kaṭukā vedanā vedayanti. Te evamāhaṃsu – ‘idaṃ kho te bhonto samaṇabrāhmaṇā kāmesu anāgatabhayaṃ sampassamānā kāmānaṃ pahānamāhaṃsu, kāmānaṃ pariññaṃ paññapenti. Ime hi ",
      " mayaṃ kāmahetu kāmanidānaṃ dukkhā tibbā kharā kaṭukā vedanā vedayāmā’ti. Idaṃ vuccati, bhikkhave, dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ."
    ],
    "innerText": "469. ‘‘Katamañca, bhikkhave, dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ? Santi, bhikkhave, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘natthi kāmesu doso’ti. Te kāmesu pātabyataṃ āpajjanti. Te kho moḷibaddhāhi [moḷibandhāhi (syā. kaṃ. ka.)] paribbājikāhi paricārenti. Te evamāhaṃsu – ‘kiṃsu nāma te bhonto samaṇabrāhmaṇā kāmesu anāgatabhayaṃ sampassamānā kāmānaṃ pahānamāhaṃsu, kāmānaṃ pariññaṃ paññapenti? Sukho imissā paribbājikāya taruṇāya mudukāya lomasāya bāhāya samphasso’ti te kāmesu pātabyataṃ āpajjanti. Te kāmesu pātabyataṃ āpajjitvā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Te tattha dukkhā tibbā kharā kaṭukā vedanā vedayanti. Te evamāhaṃsu – ‘idaṃ kho te bhonto samaṇabrāhmaṇā kāmesu anāgatabhayaṃ sampassamānā kāmānaṃ pahānamāhaṃsu, kāmānaṃ pariññaṃ paññapenti, ime hi mayaṃ kāmahetu kāmanidānaṃ dukkhā tibbā kharā kaṭukā vedanā vedayāmā’ti. Seyyathāpi, bhikkhave, gimhānaṃ pacchime māse māluvāsipāṭikā phaleyya. Atha kho taṃ, bhikkhave, māluvābījaṃ aññatarasmiṃ sālamūle nipateyya. Atha kho, bhikkhave, yā tasmiṃ sāle adhivatthā devatā sā bhītā saṃviggā santāsaṃ āpajjeyya. Atha kho, bhikkhave, tasmiṃ sāle adhivatthāya devatāya mittāmaccā ñātisālohitā ārāmadevatā vanadevatā rukkhadevatā osadhitiṇavanappatīsu adhivatthā devatā saṅgamma samāgamma evaṃ samassāseyyuṃ – ‘mā bhavaṃ bhāyi, mā bhavaṃ bhāyi; appeva nāmetaṃ māluvābījaṃ moro vā gileyya [moro vā gileyya, godhā vā khādeyya (ka.)], mago vā khādeyya, davaḍāho [vanadāho (ka.)] vā ḍaheyya, vanakammikā vā uddhareyyuṃ, upacikā vā uṭṭhaheyyuṃ [udrabheyyuṃ (sī. pī. ka.)], abījaṃ vā panassā’ti. Atha kho taṃ, bhikkhave, māluvābījaṃ neva moro gileyya, na mago khādeyya, na davaḍāho ḍaheyya, na vanakammikā uddhareyyuṃ, na upacikā uṭṭhaheyyuṃ, bījañca panassa taṃ pāvussakena meghena abhippavuṭṭhaṃ sammadeva viruheyya. Sāssa māluvālatā taruṇā mudukā lomasā vilambinī, sā taṃ sālaṃ upaniseveyya. Atha kho, bhikkhave, tasmiṃ sāle adhivatthāya devatāya evamassa – ‘kiṃsu nāma te bhonto mittāmaccā ñātisālohitā ārāmadevatā vanadevatā rukkhadevatā osadhitiṇavanappatīsu adhivatthā devatā māluvābīje anāgatabhayaṃ sampassamānā saṅgamma samāgamma evaṃ samassāsesuṃ [samassāseyyuṃ (ka.)] – ‘‘mā bhavaṃ bhāyi mā bhavaṃ bhāyi, appeva nāmetaṃ māluvābījaṃ moro vā gileyya, mago vā khādeyya, davaḍāho vā ḍaheyya, vanakammikā vā uddhareyyuṃ, upacikā vā uṭṭhaheyyuṃ, abījaṃ vā panassā’’ti; sukho imissā māluvālatāya taruṇāya mudukāya lomasāya vilambiniyā samphasso’ti. Sā taṃ sālaṃ anuparihareyya. Sā taṃ sālaṃ anupariharitvā upari viṭabhiṃ [viṭapaṃ (syā. ṭṭha.)] kareyya. Upari viṭabhiṃ karitvā oghanaṃ janeyya. Oghanaṃ janetvā ye tassa sālassa mahantā mahantā khandhā te padāleyya. Atha kho, bhikkhave, tasmiṃ sāle adhivatthāya devatāya evamassa – ‘idaṃ kho te bhonto mittāmaccā ñātisālohitā ārāmadevatā vanadevatā rukkhadevatā osadhitiṇavanappatīsu adhivatthā devatā māluvābīje anāgatabhayaṃ sampassamānā saṅgamma samāgamma evaṃ samassāsesuṃ [samassāseyyuṃ (ka.)] – ‘‘mā bhavaṃ bhāyi mā bhavaṃ bhāyi, appeva nāmetaṃ māluvābījaṃ moro vā gileyya, mago vā khādeyya, davaḍāho vā ḍaheyya, vanakammikā vā uddhareyyuṃ, upacikā vā uṭṭhaheyyuṃ abījaṃ vā panassā’’ti. Yañcāhaṃ [yaṃ vāhaṃ (ka.), svāhaṃ (syā. kaṃ.)] māluvābījahetu dukkhā tibbā kharā kaṭukā vedanā vedayāmī’ti. Evameva kho, bhikkhave, santi eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino ‘natthi kāmesu doso’ti . Te kāmesu pātabyataṃ āpajjanti. Te moḷibaddhāhi paribbājikāhi paricārenti. Te evamāhaṃsu – ‘kiṃsu nāma te bhonto samaṇabrāhmaṇā kāmesu anāgatabhayaṃ sampassamānā kāmānaṃ pahānamāhaṃsu, kāmānaṃ pariññaṃ paññapenti? Sukho imissā paribbājikāya taruṇāya mudukāya lomasāya bāhāya samphasso’ti. Te kāmesu pātabyataṃ āpajjanti. Te kāmesu pātabyataṃ āpajjitvā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Te tattha dukkhā tibbā kharā kaṭukā vedanā vedayanti. Te evamāhaṃsu – ‘idaṃ kho te bhonto samaṇabrāhmaṇā kāmesu anāgatabhayaṃ sampassamānā kāmānaṃ pahānamāhaṃsu, kāmānaṃ pariññaṃ paññapenti. Ime hi mayaṃ kāmahetu kāmanidānaṃ dukkhā tibbā kharā kaṭukā vedanā vedayāmā’ti. Idaṃ vuccati, bhikkhave, dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "470"
      },
      ". ‘‘Katamañca, bhikkhave, dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ? Idha, bhikkhave, ekacco acelako hoti muttācāro hatthāpalekhano, naehibhaddantiko, natiṭṭhabhaddantiko, nābhihaṭaṃ, na uddissakataṃ, na nimantanaṃ sādiyati, so na kumbhimukhā paṭiggaṇhāti, na kaḷopimukhā paṭiggaṇhāti, na eḷakamantaraṃ, na daṇḍamantaraṃ, na musalamantaraṃ, na dvinnaṃ bhuñjamānānaṃ, na gabbhiniyā, na pāyamānāya, na purisantaragatāya, na saṅkittīsu, na yattha sā upaṭṭhito ",
      " hoti, na yattha makkhikā saṇḍasaṇḍacārinī, na macchaṃ, na maṃsaṃ, na suraṃ, na merayaṃ, na thusodakaṃ pivati. So ekāgāriko vā hoti ekālopiko, dvāgāriko vā hoti dvālopiko…pe… sattāgāriko vā hoti sattālopiko. Ekissāpi dattiyā yāpeti, dvīhipi dattīhi yāpeti… sattahipi dattīhi yāpeti. Ekāhikampi āhāraṃ āhāreti, dvīhikampi āhāraṃ āhāreti… sattāhikampi āhāraṃ āhāreti. Iti evarūpaṃ addhamāsikampi pariyāyabhattabhojanānuyogamanuyutto viharati. So sākabhakkho vā hoti ",
      ", sāmākabhakkho vā hoti, nīvārabhakkho vā hoti, daddulabhakkho vā hoti, haṭabhakkho vā hoti, kaṇabhakkho vā hoti, ācāmabhakkho vā hoti, piññākabhakkho vā hoti, tiṇabhakkho vā hoti, gomayabhakkho vā hoti, vanamūlaphalāhāro yāpeti pavattaphalabhojī. So sāṇānipi dhāreti, masāṇānipi dhāreti, chavadussānipi dhāreti, paṃsukūlānipi dhāreti, tirīṭānipi dhāreti, ajinampi dhāreti, ajinakkhipampi dhāreti, kusacīrampi dhāreti, vākacīrampi dhāreti, phalakacīrampi dhāreti, kesakambalampi dhāreti, vāḷakambalampi dhāreti, ulūkapakkhampi dhāreti, kesamassulocakopi hoti, kesamassulocanānuyogamanuyutto, ubbhaṭṭhakopi hoti, āsanapaṭikkhitto, ukkuṭikopi hoti ukkuṭikappadhānamanuyutto, kaṇṭakāpassayikopi hoti, kaṇṭakāpassaye seyyaṃ ",
      " kappeti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[passa ma. ni. 1.155 mahāsīhanādasutte]"
      },
      ", sāyatatiyakampi udakorohanānuyogamanuyutto viharati. Iti evarūpaṃ anekavihitaṃ kāyassa ātāpanaparitāpanānuyogamanuyutto viharati ",
      ". So kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Idaṃ vuccati, bhikkhave, dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ."
    ],
    "innerText": "470. ‘‘Katamañca, bhikkhave, dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ? Idha, bhikkhave, ekacco acelako hoti muttācāro hatthāpalekhano, naehibhaddantiko, natiṭṭhabhaddantiko, nābhihaṭaṃ, na uddissakataṃ, na nimantanaṃ sādiyati, so na kumbhimukhā paṭiggaṇhāti, na kaḷopimukhā paṭiggaṇhāti, na eḷakamantaraṃ, na daṇḍamantaraṃ, na musalamantaraṃ, na dvinnaṃ bhuñjamānānaṃ, na gabbhiniyā, na pāyamānāya, na purisantaragatāya, na saṅkittīsu, na yattha sā upaṭṭhito hoti, na yattha makkhikā saṇḍasaṇḍacārinī, na macchaṃ, na maṃsaṃ, na suraṃ, na merayaṃ, na thusodakaṃ pivati. So ekāgāriko vā hoti ekālopiko, dvāgāriko vā hoti dvālopiko…pe… sattāgāriko vā hoti sattālopiko. Ekissāpi dattiyā yāpeti, dvīhipi dattīhi yāpeti… sattahipi dattīhi yāpeti. Ekāhikampi āhāraṃ āhāreti, dvīhikampi āhāraṃ āhāreti… sattāhikampi āhāraṃ āhāreti. Iti evarūpaṃ addhamāsikampi pariyāyabhattabhojanānuyogamanuyutto viharati. So sākabhakkho vā hoti , sāmākabhakkho vā hoti, nīvārabhakkho vā hoti, daddulabhakkho vā hoti, haṭabhakkho vā hoti, kaṇabhakkho vā hoti, ācāmabhakkho vā hoti, piññākabhakkho vā hoti, tiṇabhakkho vā hoti, gomayabhakkho vā hoti, vanamūlaphalāhāro yāpeti pavattaphalabhojī. So sāṇānipi dhāreti, masāṇānipi dhāreti, chavadussānipi dhāreti, paṃsukūlānipi dhāreti, tirīṭānipi dhāreti, ajinampi dhāreti, ajinakkhipampi dhāreti, kusacīrampi dhāreti, vākacīrampi dhāreti, phalakacīrampi dhāreti, kesakambalampi dhāreti, vāḷakambalampi dhāreti, ulūkapakkhampi dhāreti, kesamassulocakopi hoti, kesamassulocanānuyogamanuyutto, ubbhaṭṭhakopi hoti, āsanapaṭikkhitto, ukkuṭikopi hoti ukkuṭikappadhānamanuyutto, kaṇṭakāpassayikopi hoti, kaṇṭakāpassaye seyyaṃ kappeti [passa ma. ni. 1.155 mahāsīhanādasutte], sāyatatiyakampi udakorohanānuyogamanuyutto viharati. Iti evarūpaṃ anekavihitaṃ kāyassa ātāpanaparitāpanānuyogamanuyutto viharati . So kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Idaṃ vuccati, bhikkhave, dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "471"
      },
      ". ‘‘Katamañca, bhikkhave, dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ? Idha ",
      ", bhikkhave, ekacco pakatiyā tibbarāgajātiko hoti, so abhikkhaṇaṃ rāgajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti; pakatiyā tibbadosajātiko hoti, so abhikkhaṇaṃ dosajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti; pakatiyā tibbamohajātiko hoti, so abhikkhaṇaṃ mohajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. So sahāpi dukkhena, sahāpi domanassena, assumukhopi rudamāno paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati. So kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Idaṃ vuccati, bhikkhave, dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ."
    ],
    "innerText": "471. ‘‘Katamañca, bhikkhave, dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ? Idha , bhikkhave, ekacco pakatiyā tibbarāgajātiko hoti, so abhikkhaṇaṃ rāgajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti; pakatiyā tibbadosajātiko hoti, so abhikkhaṇaṃ dosajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti; pakatiyā tibbamohajātiko hoti, so abhikkhaṇaṃ mohajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. So sahāpi dukkhena, sahāpi domanassena, assumukhopi rudamāno paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati. So kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Idaṃ vuccati, bhikkhave, dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "472"
      },
      ". ‘‘Katamañca, bhikkhave, dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ? Idha, bhikkhave, ekacco pakatiyā na tibbarāgajātiko hoti, so na abhikkhaṇaṃ rāgajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti; pakatiyā na tibbadosajātiko hoti, so na abhikkhaṇaṃ dosajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti; pakatiyā na tibbamohajātiko hoti ",
      ", so na abhikkhaṇaṃ mohajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. So vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ ",
      " pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ… catutthaṃ jhānaṃ upasampajja viharati. So kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Idaṃ vuccati, bhikkhave, dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ. Imāni kho, bhikkhave, cattāri dhammasamādānānī’’ti."
    ],
    "innerText": "472. ‘‘Katamañca, bhikkhave, dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ? Idha, bhikkhave, ekacco pakatiyā na tibbarāgajātiko hoti, so na abhikkhaṇaṃ rāgajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti; pakatiyā na tibbadosajātiko hoti, so na abhikkhaṇaṃ dosajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti; pakatiyā na tibbamohajātiko hoti , so na abhikkhaṇaṃ mohajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. So vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ… catutthaṃ jhānaṃ upasampajja viharati. So kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Idaṃ vuccati, bhikkhave, dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ. Imāni kho, bhikkhave, cattāri dhammasamādānānī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idamavoca ",
      " bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti."
    ],
    "innerText": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cūḷadhammasamādānasuttaṃ niṭṭhitaṃ pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Mahādhammasamādānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "473"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘yebhuyyena, bhikkhave, sattā evaṃkāmā evaṃchandā evaṃadhippāyā – ‘aho vata aniṭṭhā akantā amanāpā dhammā parihāyeyyuṃ, iṭṭhā kantā manāpā dhammā abhivaḍḍheyyu’nti. Tesaṃ, bhikkhave, sattānaṃ evaṃkāmānaṃ evaṃchandānaṃ evaṃadhippāyānaṃ aniṭṭhā akantā amanāpā dhammā abhivaḍḍhanti, iṭṭhā kantā manāpā dhammā parihāyanti. Tatra tumhe, bhikkhave, kaṃ hetuṃ paccethā’’ti? ‘‘Bhagavaṃmūlakā ",
      " no, bhante, dhammā, bhagavaṃnettikā, bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaññeva paṭibhātu etassa bhāsitassa attho; bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha, bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "473. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘yebhuyyena, bhikkhave, sattā evaṃkāmā evaṃchandā evaṃadhippāyā – ‘aho vata aniṭṭhā akantā amanāpā dhammā parihāyeyyuṃ, iṭṭhā kantā manāpā dhammā abhivaḍḍheyyu’nti. Tesaṃ, bhikkhave, sattānaṃ evaṃkāmānaṃ evaṃchandānaṃ evaṃadhippāyānaṃ aniṭṭhā akantā amanāpā dhammā abhivaḍḍhanti, iṭṭhā kantā manāpā dhammā parihāyanti. Tatra tumhe, bhikkhave, kaṃ hetuṃ paccethā’’ti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā, bhagavaṃnettikā, bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaññeva paṭibhātu etassa bhāsitassa attho; bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha, bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "474"
      },
      ". ‘‘Idha, bhikkhave, assutavā puthujjano, ariyānaṃ adassāvī ariyadhammassa akovido ariyadhamme avinīto, sappurisānaṃ adassāvī sappurisadhammassa akovido sappurisadhamme avinīto, sevitabbe dhamme na jānāti asevitabbe dhamme na jānāti, bhajitabbe ",
      " dhamme na jānāti abhajitabbe dhamme na jānāti. So sevitabbe dhamme ajānanto asevitabbe dhamme ajānanto, bhajitabbe dhamme ajānanto abhajitabbe dhamme ajānanto, asevitabbe dhamme sevati sevitabbe dhamme na sevati, abhajitabbe dhamme bhajati bhajitabbe dhamme na bhajati. Tassa asevitabbe dhamme sevato sevitabbe dhamme asevato, abhajitabbe dhamme bhajato bhajitabbe dhamme abhajato aniṭṭhā akantā amanāpā dhammā ",
      " abhivaḍḍhanti, iṭṭhā kantā manāpā dhammā parihāyanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ aviddasuno."
    ],
    "innerText": "474. ‘‘Idha, bhikkhave, assutavā puthujjano, ariyānaṃ adassāvī ariyadhammassa akovido ariyadhamme avinīto, sappurisānaṃ adassāvī sappurisadhammassa akovido sappurisadhamme avinīto, sevitabbe dhamme na jānāti asevitabbe dhamme na jānāti, bhajitabbe dhamme na jānāti abhajitabbe dhamme na jānāti. So sevitabbe dhamme ajānanto asevitabbe dhamme ajānanto, bhajitabbe dhamme ajānanto abhajitabbe dhamme ajānanto, asevitabbe dhamme sevati sevitabbe dhamme na sevati, abhajitabbe dhamme bhajati bhajitabbe dhamme na bhajati. Tassa asevitabbe dhamme sevato sevitabbe dhamme asevato, abhajitabbe dhamme bhajato bhajitabbe dhamme abhajato aniṭṭhā akantā amanāpā dhammā abhivaḍḍhanti, iṭṭhā kantā manāpā dhammā parihāyanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ aviddasuno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sutavā ca kho, bhikkhave, ariyasāvako, ariyānaṃ dassāvī ariyadhammassa kovido ariyadhamme ",
      " suvinīto, sappurisānaṃ dassāvī sappurisadhammassa kovido sappurisadhamme suvinīto, sevitabbe dhamme jānāti asevitabbe dhamme jānāti, bhajitabbe dhamme jānāti abhajitabbe dhamme jānāti. So sevitabbe dhamme jānanto asevitabbe dhamme jānanto, bhajitabbe dhamme jānanto abhajitabbe dhamme jānanto, asevitabbe dhamme na sevati sevitabbe dhamme sevati, abhajitabbe dhamme na bhajati bhajitabbe dhamme bhajati. Tassa asevitabbe dhamme asevato sevitabbe dhamme sevato, abhajitabbe dhamme abhajato bhajitabbe dhamme bhajato, aniṭṭhā akantā amanāpā dhammā parihāyanti, iṭṭhā kantā manāpā dhammā abhivaḍḍhanti. Taṃ ",
      " kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ viddasuno."
    ],
    "innerText": "‘‘Sutavā ca kho, bhikkhave, ariyasāvako, ariyānaṃ dassāvī ariyadhammassa kovido ariyadhamme suvinīto, sappurisānaṃ dassāvī sappurisadhammassa kovido sappurisadhamme suvinīto, sevitabbe dhamme jānāti asevitabbe dhamme jānāti, bhajitabbe dhamme jānāti abhajitabbe dhamme jānāti. So sevitabbe dhamme jānanto asevitabbe dhamme jānanto, bhajitabbe dhamme jānanto abhajitabbe dhamme jānanto, asevitabbe dhamme na sevati sevitabbe dhamme sevati, abhajitabbe dhamme na bhajati bhajitabbe dhamme bhajati. Tassa asevitabbe dhamme asevato sevitabbe dhamme sevato, abhajitabbe dhamme abhajato bhajitabbe dhamme bhajato, aniṭṭhā akantā amanāpā dhammā parihāyanti, iṭṭhā kantā manāpā dhammā abhivaḍḍhanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ viddasuno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "475"
      },
      ". ‘‘Cattārimāni, bhikkhave, dhammasamādānāni. Katamāni cattāri? Atthi, bhikkhave, dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ; atthi, bhikkhave, dhammasamādānaṃ ",
      " paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ; atthi, bhikkhave, dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ; atthi, bhikkhave, dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ."
    ],
    "innerText": "475. ‘‘Cattārimāni, bhikkhave, dhammasamādānāni. Katamāni cattāri? Atthi, bhikkhave, dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ; atthi, bhikkhave, dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ; atthi, bhikkhave, dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ; atthi, bhikkhave, dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "476"
      },
      ". ‘‘Tatra, bhikkhave, yamidaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yadidaṃ (sī.)]"
      },
      " dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ, taṃ avidvā avijjāgato yathābhūtaṃ nappajānāti – ‘idaṃ kho dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipāka’nti. Taṃ avidvā avijjāgato yathābhūtaṃ appajānanto taṃ sevati, taṃ na parivajjeti. Tassa taṃ sevato, taṃ aparivajjayato, aniṭṭhā akantā amanāpā dhammā abhivaḍḍhanti, iṭṭhā kantā manāpā dhammā parihāyanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ aviddasuno."
    ],
    "innerText": "476. ‘‘Tatra, bhikkhave, yamidaṃ [yadidaṃ (sī.)] dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ, taṃ avidvā avijjāgato yathābhūtaṃ nappajānāti – ‘idaṃ kho dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipāka’nti. Taṃ avidvā avijjāgato yathābhūtaṃ appajānanto taṃ sevati, taṃ na parivajjeti. Tassa taṃ sevato, taṃ aparivajjayato, aniṭṭhā akantā amanāpā dhammā abhivaḍḍhanti, iṭṭhā kantā manāpā dhammā parihāyanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ aviddasuno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, yamidaṃ dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ taṃ avidvā avijjāgato yathābhūtaṃ nappajānāti – ‘idaṃ kho dhammasamādānaṃ paccuppannasukhaṃ ",
      " āyatiṃ dukkhavipāka’nti. Taṃ avidvā avijjāgato yathābhūtaṃ appajānanto taṃ sevati, taṃ na parivajjeti. Tassa taṃ sevato, taṃ ",
      " aparivajjayato, aniṭṭhā akantā amanāpā dhammā abhivaḍḍhanti, iṭṭhā kantā manāpā dhammā parihāyanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ aviddasuno."
    ],
    "innerText": "‘‘Tatra, bhikkhave, yamidaṃ dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ taṃ avidvā avijjāgato yathābhūtaṃ nappajānāti – ‘idaṃ kho dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipāka’nti. Taṃ avidvā avijjāgato yathābhūtaṃ appajānanto taṃ sevati, taṃ na parivajjeti. Tassa taṃ sevato, taṃ aparivajjayato, aniṭṭhā akantā amanāpā dhammā abhivaḍḍhanti, iṭṭhā kantā manāpā dhammā parihāyanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ aviddasuno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra ",
      ", bhikkhave, yamidaṃ dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ, taṃ avidvā avijjāgato yathābhūtaṃ nappajānāti – ‘idaṃ kho dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipāka’nti. Taṃ avidvā avijjāgato yathābhūtaṃ appajānanto taṃ na sevati, taṃ parivajjeti. Tassa taṃ asevato, taṃ parivajjayato, aniṭṭhā ",
      " akantā amanāpā dhammā abhivaḍḍhanti, iṭṭhā kantā manāpā dhammā parihāyanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ aviddasuno."
    ],
    "innerText": "‘‘Tatra , bhikkhave, yamidaṃ dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ, taṃ avidvā avijjāgato yathābhūtaṃ nappajānāti – ‘idaṃ kho dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipāka’nti. Taṃ avidvā avijjāgato yathābhūtaṃ appajānanto taṃ na sevati, taṃ parivajjeti. Tassa taṃ asevato, taṃ parivajjayato, aniṭṭhā akantā amanāpā dhammā abhivaḍḍhanti, iṭṭhā kantā manāpā dhammā parihāyanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ aviddasuno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tatra, bhikkhave, yamidaṃ dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ, taṃ avidvā avijjāgato yathābhūtaṃ nappajānāti – ‘idaṃ kho dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipāka’nti. Taṃ avidvā avijjāgato yathābhūtaṃ appajānanto taṃ na sevati, taṃ parivajjeti. Tassa taṃ asevato, taṃ parivajjayato, aniṭṭhā akantā amanāpā dhammā abhivaḍḍhanti, iṭṭhā kantā manāpā dhammā parihāyanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ aviddasuno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "477"
      },
      ". ‘‘Tatra, bhikkhave, yamidaṃ dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ taṃ vidvā vijjāgato yathābhūtaṃ pajānāti – ‘idaṃ ",
      " kho dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipāka’nti. Taṃ vidvā vijjāgato yathābhūtaṃ pajānanto taṃ na sevati, taṃ parivajjeti. Tassa taṃ asevato, taṃ parivajjayato, aniṭṭhā akantā amanāpā dhammā parihāyanti, iṭṭhā kantā manāpā dhammā abhivaḍḍhanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ viddasuno."
    ],
    "innerText": "477. ‘‘Tatra, bhikkhave, yamidaṃ dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ taṃ vidvā vijjāgato yathābhūtaṃ pajānāti – ‘idaṃ kho dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipāka’nti. Taṃ vidvā vijjāgato yathābhūtaṃ pajānanto taṃ na sevati, taṃ parivajjeti. Tassa taṃ asevato, taṃ parivajjayato, aniṭṭhā akantā amanāpā dhammā parihāyanti, iṭṭhā kantā manāpā dhammā abhivaḍḍhanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ viddasuno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, yamidaṃ dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ taṃ vidvā vijjāgato yathābhūtaṃ pajānāti – ‘idaṃ kho dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipāka’nti. Taṃ vidvā vijjāgato yathābhūtaṃ pajānanto taṃ na sevati, taṃ parivajjeti. Tassa taṃ asevato, taṃ parivajjayato ",
      ", aniṭṭhā akantā amanāpā dhammā parihāyanti, iṭṭhā kantā manāpā dhammā abhivaḍḍhanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ viddasuno."
    ],
    "innerText": "‘‘Tatra, bhikkhave, yamidaṃ dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ taṃ vidvā vijjāgato yathābhūtaṃ pajānāti – ‘idaṃ kho dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipāka’nti. Taṃ vidvā vijjāgato yathābhūtaṃ pajānanto taṃ na sevati, taṃ parivajjeti. Tassa taṃ asevato, taṃ parivajjayato , aniṭṭhā akantā amanāpā dhammā parihāyanti, iṭṭhā kantā manāpā dhammā abhivaḍḍhanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ viddasuno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra ",
      ", bhikkhave, yamidaṃ dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ taṃ vidvā vijjāgato yathābhūtaṃ pajānāti – ‘idaṃ kho dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipāka’nti. Taṃ vidvā vijjāgato yathābhūtaṃ pajānanto taṃ sevati, taṃ na parivajjeti. Tassa taṃ sevato, taṃ aparivajjayato, aniṭṭhā akantā amanāpā dhammā parihāyanti, iṭṭhā kantā manāpā dhammā abhivaḍḍhanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ viddasuno."
    ],
    "innerText": "‘‘Tatra , bhikkhave, yamidaṃ dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ taṃ vidvā vijjāgato yathābhūtaṃ pajānāti – ‘idaṃ kho dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipāka’nti. Taṃ vidvā vijjāgato yathābhūtaṃ pajānanto taṃ sevati, taṃ na parivajjeti. Tassa taṃ sevato, taṃ aparivajjayato, aniṭṭhā akantā amanāpā dhammā parihāyanti, iṭṭhā kantā manāpā dhammā abhivaḍḍhanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ viddasuno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, yamidaṃ dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ ",
      " taṃ vidvā vijjāgato yathābhūtaṃ pajānāti – ‘idaṃ kho dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipāka’nti. Taṃ vidvā vijjāgato yathābhūtaṃ pajānanto taṃ sevati, taṃ na parivajjeti. Tassa taṃ sevato, taṃ aparivajjayato, aniṭṭhā akantā amanāpā dhammā parihāyanti, iṭṭhā kantā manāpā dhammā abhivaḍḍhanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ viddasuno."
    ],
    "innerText": "‘‘Tatra, bhikkhave, yamidaṃ dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ taṃ vidvā vijjāgato yathābhūtaṃ pajānāti – ‘idaṃ kho dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipāka’nti. Taṃ vidvā vijjāgato yathābhūtaṃ pajānanto taṃ sevati, taṃ na parivajjeti. Tassa taṃ sevato, taṃ aparivajjayato, aniṭṭhā akantā amanāpā dhammā parihāyanti, iṭṭhā kantā manāpā dhammā abhivaḍḍhanti. Taṃ kissa hetu? Evañhetaṃ, bhikkhave, hoti yathā taṃ viddasuno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "478"
      },
      ". ‘‘Katamañca ",
      ", bhikkhave, dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ? Idha, bhikkhave, ekacco sahāpi dukkhena sahāpi domanassena pāṇātipātī hoti, pāṇātipātapaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena adinnādāyī hoti, adinnādānapaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena kāmesu micchācārī hoti, kāmesu micchācārapaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena musāvādī hoti, musāvādapaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena pisuṇavāco hoti, pisuṇavācāpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena pharusavāco hoti, pharusavācāpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena samphappalāpī hoti, samphappalāpapaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi ",
      " dukkhena sahāpi domanassena abhijjhālu ",
      " hoti, abhijjhāpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena byāpannacitto hoti, byāpādapaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena micchādiṭṭhi hoti, micchādiṭṭhipaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti. So ",
      " kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Idaṃ vuccati, bhikkhave, dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ."
    ],
    "innerText": "478. ‘‘Katamañca , bhikkhave, dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ? Idha, bhikkhave, ekacco sahāpi dukkhena sahāpi domanassena pāṇātipātī hoti, pāṇātipātapaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena adinnādāyī hoti, adinnādānapaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena kāmesu micchācārī hoti, kāmesu micchācārapaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena musāvādī hoti, musāvādapaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena pisuṇavāco hoti, pisuṇavācāpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena pharusavāco hoti, pharusavācāpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena samphappalāpī hoti, samphappalāpapaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena abhijjhālu hoti, abhijjhāpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena byāpannacitto hoti, byāpādapaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena micchādiṭṭhi hoti, micchādiṭṭhipaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti. So kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Idaṃ vuccati, bhikkhave, dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "479"
      },
      ". ‘‘Katamañca, bhikkhave, dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ? Idha, bhikkhave, ekacco sahāpi sukhena sahāpi somanassena pāṇātipātī hoti, pāṇātipātapaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena adinnādāyī hoti, adinnādānapaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena kāmesumicchācārī hoti, kāmesumicchācārapaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena musāvādī hoti, musāvādapaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena pisuṇavāco hoti, pisuṇavācāpaccayā ca sukhaṃ ",
      " somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena pharusavāco hoti, pharusavācāpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena samphappalāpī hoti, samphappalāpapaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi ",
      " sukhena sahāpi somanassena abhijjhālu hoti, abhijjhāpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena byāpannacitto hoti, byāpādapaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena micchādiṭṭhi hoti, micchādiṭṭhipaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti. So kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Idaṃ vuccati, bhikkhave, dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ."
    ],
    "innerText": "479. ‘‘Katamañca, bhikkhave, dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ? Idha, bhikkhave, ekacco sahāpi sukhena sahāpi somanassena pāṇātipātī hoti, pāṇātipātapaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena adinnādāyī hoti, adinnādānapaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena kāmesumicchācārī hoti, kāmesumicchācārapaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena musāvādī hoti, musāvādapaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena pisuṇavāco hoti, pisuṇavācāpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena pharusavāco hoti, pharusavācāpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena samphappalāpī hoti, samphappalāpapaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena abhijjhālu hoti, abhijjhāpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena byāpannacitto hoti, byāpādapaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena micchādiṭṭhi hoti, micchādiṭṭhipaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti. So kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Idaṃ vuccati, bhikkhave, dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "480"
      },
      ". ‘‘Katamañca, bhikkhave, dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ? Idha, bhikkhave, ekacco sahāpi dukkhena sahāpi domanassena pāṇātipātā paṭivirato hoti, pāṇātipātā veramaṇīpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti ",
      "; sahāpi dukkhena sahāpi domanassena adinnādānā paṭivirato hoti, adinnādānā veramaṇīpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena kāmesumicchācārā paṭivirato hoti, kāmesumicchācārā veramaṇīpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena musāvādā paṭivirato hoti, musāvādā veramaṇīpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena pisuṇāya vācāya paṭivirato hoti ",
      ", pisuṇāya vācāya veramaṇīpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti ",
      "; sahāpi dukkhena sahāpi domanassena pharusāya vācāya paṭivirato hoti, pharusāya vācāya veramaṇīpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena samphappalāpā paṭivirato hoti, samphappalāpā veramaṇīpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena anabhijjhālu hoti, anabhijjhāpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena abyāpannacitto hoti, abyāpādapaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena ",
      " sahāpi domanassena sammādiṭṭhi hoti, sammādiṭṭhipaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti. So kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Idaṃ vuccati, bhikkhave, dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ."
    ],
    "innerText": "480. ‘‘Katamañca, bhikkhave, dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ? Idha, bhikkhave, ekacco sahāpi dukkhena sahāpi domanassena pāṇātipātā paṭivirato hoti, pāṇātipātā veramaṇīpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti ; sahāpi dukkhena sahāpi domanassena adinnādānā paṭivirato hoti, adinnādānā veramaṇīpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena kāmesumicchācārā paṭivirato hoti, kāmesumicchācārā veramaṇīpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena musāvādā paṭivirato hoti, musāvādā veramaṇīpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena pisuṇāya vācāya paṭivirato hoti , pisuṇāya vācāya veramaṇīpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti ; sahāpi dukkhena sahāpi domanassena pharusāya vācāya paṭivirato hoti, pharusāya vācāya veramaṇīpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena samphappalāpā paṭivirato hoti, samphappalāpā veramaṇīpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena anabhijjhālu hoti, anabhijjhāpaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena abyāpannacitto hoti, abyāpādapaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti; sahāpi dukkhena sahāpi domanassena sammādiṭṭhi hoti, sammādiṭṭhipaccayā ca dukkhaṃ domanassaṃ paṭisaṃvedeti. So kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Idaṃ vuccati, bhikkhave, dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "481"
      },
      ". ‘‘Katamañca, bhikkhave, dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ? Idha, bhikkhave, ekacco sahāpi sukhena sahāpi somanassena pāṇātipātā paṭivirato hoti, pāṇātipātā veramaṇīpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena adinnādānā paṭivirato hoti, adinnādānā veramaṇīpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena kāmesumicchācārā paṭivirato hoti, kāmesumicchācārā veramaṇīpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena ",
      " sahāpi somanassena musāvādā paṭivirato hoti, musāvādā veramaṇīpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena pisuṇāya vācāya paṭivirato hoti, pisuṇāya vācāya ",
      " veramaṇīpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena pharusāya vācāya paṭivirato hoti, pharusāya vācāya veramaṇīpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena samphappalāpā paṭivirato hoti, samphappalāpā veramaṇīpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena anabhijjhālu hoti, anabhijjhāpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena abyāpannacitto hoti, abyāpādapaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena sammādiṭṭhi hoti, sammādiṭṭhipaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti. So kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Idaṃ, vuccati, bhikkhave, dhammasamādānaṃ paccuppannasukhañceva ",
      " āyatiñca sukhavipākaṃ. Imāni kho, bhikkhave, cattāri dhammasamādānāni."
    ],
    "innerText": "481. ‘‘Katamañca, bhikkhave, dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ? Idha, bhikkhave, ekacco sahāpi sukhena sahāpi somanassena pāṇātipātā paṭivirato hoti, pāṇātipātā veramaṇīpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena adinnādānā paṭivirato hoti, adinnādānā veramaṇīpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena kāmesumicchācārā paṭivirato hoti, kāmesumicchācārā veramaṇīpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena musāvādā paṭivirato hoti, musāvādā veramaṇīpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena pisuṇāya vācāya paṭivirato hoti, pisuṇāya vācāya veramaṇīpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena pharusāya vācāya paṭivirato hoti, pharusāya vācāya veramaṇīpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena samphappalāpā paṭivirato hoti, samphappalāpā veramaṇīpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena anabhijjhālu hoti, anabhijjhāpaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena abyāpannacitto hoti, abyāpādapaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti; sahāpi sukhena sahāpi somanassena sammādiṭṭhi hoti, sammādiṭṭhipaccayā ca sukhaṃ somanassaṃ paṭisaṃvedeti. So kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Idaṃ, vuccati, bhikkhave, dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ. Imāni kho, bhikkhave, cattāri dhammasamādānāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "482"
      },
      ". ‘‘Seyyathāpi, bhikkhave, tittakālābu visena saṃsaṭṭho. Atha puriso āgaccheyya jīvitukāmo amaritukāmo sukhakāmo dukkhappaṭikūlo. Tamenaṃ evaṃ vadeyyuṃ – ‘ambho purisa, ayaṃ tittakālābu visena saṃsaṭṭho, sace ākaṅkhasi piva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pipa (sī. pī.)]"
      },
      ". Tassa ",
      " te pivato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pipato (sī. pī.)]"
      },
      " ceva nacchādessati ",
      " vaṇṇenapi gandhenapi rasenapi, pivitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pītvā (sī.)]"
      },
      " ca pana maraṇaṃ vā nigacchasi maraṇamattaṃ vā dukkha’nti. So taṃ appaṭisaṅkhāya piveyya, nappaṭinissajjeyya. Tassa taṃ pivato ceva nacchādeyya vaṇṇenapi gandhenapi rasenapi, pivitvā ca pana maraṇaṃ vā nigaccheyya maraṇamattaṃ vā dukkhaṃ. Tathūpamāhaṃ, bhikkhave, imaṃ dhammasamādānaṃ vadāmi, yamidaṃ dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ."
    ],
    "innerText": "482. ‘‘Seyyathāpi, bhikkhave, tittakālābu visena saṃsaṭṭho. Atha puriso āgaccheyya jīvitukāmo amaritukāmo sukhakāmo dukkhappaṭikūlo. Tamenaṃ evaṃ vadeyyuṃ – ‘ambho purisa, ayaṃ tittakālābu visena saṃsaṭṭho, sace ākaṅkhasi piva [pipa (sī. pī.)]. Tassa te pivato [pipato (sī. pī.)] ceva nacchādessati vaṇṇenapi gandhenapi rasenapi, pivitvā [pītvā (sī.)] ca pana maraṇaṃ vā nigacchasi maraṇamattaṃ vā dukkha’nti. So taṃ appaṭisaṅkhāya piveyya, nappaṭinissajjeyya. Tassa taṃ pivato ceva nacchādeyya vaṇṇenapi gandhenapi rasenapi, pivitvā ca pana maraṇaṃ vā nigaccheyya maraṇamattaṃ vā dukkhaṃ. Tathūpamāhaṃ, bhikkhave, imaṃ dhammasamādānaṃ vadāmi, yamidaṃ dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "483"
      },
      ". ‘‘Seyyathāpi, bhikkhave, āpānīyakaṃso vaṇṇasampanno gandhasampanno rasasampanno. So ca kho visena saṃsaṭṭho. Atha puriso āgaccheyya jīvitukāmo amaritukāmo sukhakāmo dukkhappaṭikūlo. Tamenaṃ evaṃ vadeyyuṃ – ‘ambho purisa, ayaṃ āpānīyakaṃso vaṇṇasampanno gandhasampanno rasasampanno. So ca kho visena saṃsaṭṭho, sace ākaṅkhasi piva. Tassa te pivatohi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pivatopi (ka.)]"
      },
      " kho chādessati vaṇṇenapi gandhenapi rasenapi, pivitvā ca pana maraṇaṃ vā nigacchasi maraṇamattaṃ vā dukkha’nti. So taṃ appaṭisaṅkhāya ",
      " piveyya, nappaṭinissajjeyya. Tassa taṃ pivatohi kho chādeyya vaṇṇenapi gandhenapi rasenapi, pivitvā ca pana maraṇaṃ vā nigaccheyya maraṇamattaṃ vā dukkhaṃ. Tathūpamāhaṃ, bhikkhave, imaṃ dhammasamādānaṃ vadāmi, yamidaṃ dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ."
    ],
    "innerText": "483. ‘‘Seyyathāpi, bhikkhave, āpānīyakaṃso vaṇṇasampanno gandhasampanno rasasampanno. So ca kho visena saṃsaṭṭho. Atha puriso āgaccheyya jīvitukāmo amaritukāmo sukhakāmo dukkhappaṭikūlo. Tamenaṃ evaṃ vadeyyuṃ – ‘ambho purisa, ayaṃ āpānīyakaṃso vaṇṇasampanno gandhasampanno rasasampanno. So ca kho visena saṃsaṭṭho, sace ākaṅkhasi piva. Tassa te pivatohi [pivatopi (ka.)] kho chādessati vaṇṇenapi gandhenapi rasenapi, pivitvā ca pana maraṇaṃ vā nigacchasi maraṇamattaṃ vā dukkha’nti. So taṃ appaṭisaṅkhāya piveyya, nappaṭinissajjeyya. Tassa taṃ pivatohi kho chādeyya vaṇṇenapi gandhenapi rasenapi, pivitvā ca pana maraṇaṃ vā nigaccheyya maraṇamattaṃ vā dukkhaṃ. Tathūpamāhaṃ, bhikkhave, imaṃ dhammasamādānaṃ vadāmi, yamidaṃ dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "484"
      },
      ". ‘‘Seyyathāpi, bhikkhave, pūtimuttaṃ nānābhesajjehi saṃsaṭṭhaṃ. Atha ",
      " puriso āgaccheyya paṇḍukarogī. Tamenaṃ evaṃ vadeyyuṃ – ‘ambho purisa, idaṃ pūtimuttaṃ nānābhesajjehi saṃsaṭṭhaṃ, sace ākaṅkhasi piva. Tassa te pivatohi kho nacchādessati vaṇṇenapi gandhenapi rasenapi, pivitvā ca pana sukhī bhavissasī’ti. So taṃ paṭisaṅkhāya piveyya, nappaṭinissajjeyya. Tassa taṃ pivatohi kho nacchādeyya vaṇṇenapi gandhenapi rasenapi, pivitvā ",
      " ca pana sukhī assa. Tathūpamāhaṃ, bhikkhave, imaṃ dhammasamādānaṃ vadāmi, yamidaṃ dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ."
    ],
    "innerText": "484. ‘‘Seyyathāpi, bhikkhave, pūtimuttaṃ nānābhesajjehi saṃsaṭṭhaṃ. Atha puriso āgaccheyya paṇḍukarogī. Tamenaṃ evaṃ vadeyyuṃ – ‘ambho purisa, idaṃ pūtimuttaṃ nānābhesajjehi saṃsaṭṭhaṃ, sace ākaṅkhasi piva. Tassa te pivatohi kho nacchādessati vaṇṇenapi gandhenapi rasenapi, pivitvā ca pana sukhī bhavissasī’ti. So taṃ paṭisaṅkhāya piveyya, nappaṭinissajjeyya. Tassa taṃ pivatohi kho nacchādeyya vaṇṇenapi gandhenapi rasenapi, pivitvā ca pana sukhī assa. Tathūpamāhaṃ, bhikkhave, imaṃ dhammasamādānaṃ vadāmi, yamidaṃ dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "485"
      },
      ". ‘‘Seyyathāpi, bhikkhave, dadhi ca madhu ca sappi ca phāṇitañca ekajjhaṃ saṃsaṭṭhaṃ. Atha puriso āgaccheyya lohitapakkhandiko. Tamenaṃ evaṃ vadeyyuṃ – ‘ambho purisa, idaṃ ",
      " dadhiṃ ca madhuṃ ca sappiṃ ca phāṇitañca ekajjhaṃ saṃsaṭṭhaṃ, sace ākaṅkhasi piva. Tassa te pivato ceva chādessati vaṇṇenapi gandhenapi rasenapi, pivitvā ca pana sukhī bhavissasī’ti. So taṃ paṭisaṅkhāya piveyya, nappaṭinissajjeyya. Tassa taṃ pivato ceva chādeyya vaṇṇenapi gandhenapi rasenapi, pivitvā ca pana sukhī assa. Tathūpamāhaṃ, bhikkhave, imaṃ dhammasamādānaṃ vadāmi, yamidaṃ dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ."
    ],
    "innerText": "485. ‘‘Seyyathāpi, bhikkhave, dadhi ca madhu ca sappi ca phāṇitañca ekajjhaṃ saṃsaṭṭhaṃ. Atha puriso āgaccheyya lohitapakkhandiko. Tamenaṃ evaṃ vadeyyuṃ – ‘ambho purisa, idaṃ dadhiṃ ca madhuṃ ca sappiṃ ca phāṇitañca ekajjhaṃ saṃsaṭṭhaṃ, sace ākaṅkhasi piva. Tassa te pivato ceva chādessati vaṇṇenapi gandhenapi rasenapi, pivitvā ca pana sukhī bhavissasī’ti. So taṃ paṭisaṅkhāya piveyya, nappaṭinissajjeyya. Tassa taṃ pivato ceva chādeyya vaṇṇenapi gandhenapi rasenapi, pivitvā ca pana sukhī assa. Tathūpamāhaṃ, bhikkhave, imaṃ dhammasamādānaṃ vadāmi, yamidaṃ dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "486"
      },
      ". ‘‘Seyyathāpi, bhikkhave, vassānaṃ pacchime māse saradasamaye viddhe vigatavalāhake deve ādicco nabhaṃ abbhussakkamāno sabbaṃ ākāsagataṃ tamagataṃ abhivihacca bhāsate ca tapate ca virocate ca; evameva ",
      " kho, bhikkhave, yamidaṃ dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ tadaññe puthusamaṇabrāhmaṇaparappavāde abhivihacca bhāsate ca tapate ca virocate cā’’ti."
    ],
    "innerText": "486. ‘‘Seyyathāpi, bhikkhave, vassānaṃ pacchime māse saradasamaye viddhe vigatavalāhake deve ādicco nabhaṃ abbhussakkamāno sabbaṃ ākāsagataṃ tamagataṃ abhivihacca bhāsate ca tapate ca virocate ca; evameva kho, bhikkhave, yamidaṃ dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ tadaññe puthusamaṇabrāhmaṇaparappavāde abhivihacca bhāsate ca tapate ca virocate cā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahādhammasamādānasuttaṃ niṭṭhitaṃ chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Vīmaṃsakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "487"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘vīmaṃsakena, bhikkhave, bhikkhunā parassa cetopariyāyaṃ ajānantena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ājānantena (pī. ka.), ajānantena kinti (?)]"
      },
      " tathāgate samannesanā kātabbā ‘sammāsambuddho vā no vā’ iti viññāṇāyā’’ti. ‘‘Bhagavaṃmūlakā no, bhante, dhammā, bhagavaṃnettikā bhagavaṃpaṭisaraṇā; sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho; bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha, bhāsissāmī’’ti ",
      ". ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "487. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘vīmaṃsakena, bhikkhave, bhikkhunā parassa cetopariyāyaṃ ajānantena [ājānantena (pī. ka.), ajānantena kinti (?)] tathāgate samannesanā kātabbā ‘sammāsambuddho vā no vā’ iti viññāṇāyā’’ti. ‘‘Bhagavaṃmūlakā no, bhante, dhammā, bhagavaṃnettikā bhagavaṃpaṭisaraṇā; sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho; bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha, bhāsissāmī’’ti . ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "488"
      },
      ". ‘‘Vīmaṃsakena, bhikkhave, bhikkhunā parassa cetopariyāyaṃ ajānantena dvīsu dhammesu tathāgato samannesitabbo cakkhusotaviññeyyesu dhammesu – ‘ye saṃkiliṭṭhā cakkhusotaviññeyyā dhammā, saṃvijjanti vā te tathāgatassa no vā’ti? Tamenaṃ samannesamāno evaṃ jānāti – ‘ye saṃkiliṭṭhā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṃvijjantī’ti."
    ],
    "innerText": "488. ‘‘Vīmaṃsakena, bhikkhave, bhikkhunā parassa cetopariyāyaṃ ajānantena dvīsu dhammesu tathāgato samannesitabbo cakkhusotaviññeyyesu dhammesu – ‘ye saṃkiliṭṭhā cakkhusotaviññeyyā dhammā, saṃvijjanti vā te tathāgatassa no vā’ti? Tamenaṃ samannesamāno evaṃ jānāti – ‘ye saṃkiliṭṭhā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṃvijjantī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yato naṃ samannesamāno evaṃ jānāti – ‘ye saṃkiliṭṭhā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṃvijjantī’ti, tato naṃ uttariṃ samannesati – ‘ye vītimissā cakkhusotaviññeyyā dhammā, saṃvijjanti vā te tathāgatassa no ",
      " vā’ti? Tamenaṃ samannesamāno evaṃ jānāti – ‘ye vītimissā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṃvijjantī’ti."
    ],
    "innerText": "‘‘Yato naṃ samannesamāno evaṃ jānāti – ‘ye saṃkiliṭṭhā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṃvijjantī’ti, tato naṃ uttariṃ samannesati – ‘ye vītimissā cakkhusotaviññeyyā dhammā, saṃvijjanti vā te tathāgatassa no vā’ti? Tamenaṃ samannesamāno evaṃ jānāti – ‘ye vītimissā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṃvijjantī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yato naṃ samannesamāno evaṃ jānāti – ‘ye vītimissā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṃvijjantī’ti, tato naṃ uttariṃ samannesati – ‘ye vodātā cakkhusotaviññeyyā ",
      " dhammā, saṃvijjanti vā te tathāgatassa no vā’ti? Tamenaṃ samannesamāno evaṃ ",
      " jānāti – ‘ye vodātā cakkhusotaviññeyyā dhammā, saṃvijjanti te tathāgatassā’ti."
    ],
    "innerText": "‘‘Yato naṃ samannesamāno evaṃ jānāti – ‘ye vītimissā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṃvijjantī’ti, tato naṃ uttariṃ samannesati – ‘ye vodātā cakkhusotaviññeyyā dhammā, saṃvijjanti vā te tathāgatassa no vā’ti? Tamenaṃ samannesamāno evaṃ jānāti – ‘ye vodātā cakkhusotaviññeyyā dhammā, saṃvijjanti te tathāgatassā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yato naṃ samannesamāno evaṃ jānāti – ‘ye vodātā cakkhusotaviññeyyā dhammā, saṃvijjanti te tathāgatassā’ti, tato naṃ uttariṃ samannesati – ‘dīgharattaṃ samāpanno ayamāyasmā imaṃ kusalaṃ dhammaṃ, udāhu ittarasamāpanno’ti? Tamenaṃ samannesamāno evaṃ jānāti – ‘dīgharattaṃ samāpanno ayamāyasmā imaṃ kusalaṃ dhammaṃ, nāyamāyasmā ittarasamāpanno’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yato naṃ samannesamāno evaṃ jānāti – ‘dīgharattaṃ samāpanno ayamāyasmā imaṃ kusalaṃ dhammaṃ, nāyamāyasmā ittarasamāpanno’ti, tato naṃ uttariṃ samannesati – ‘ñattajjhāpanno ayamāyasmā bhikkhu yasappatto, saṃvijjantassa idhekacce ādīnavā’ti? Na tāva, bhikkhave, bhikkhuno idhekacce ādīnavā saṃvijjanti yāva na ñattajjhāpanno hoti yasappatto. Yato ca kho, bhikkhave, bhikkhu ñattajjhāpanno hoti yasappatto ",
      ", athassa idhekacce ādīnavā saṃvijjanti. Tamenaṃ samannesamāno evaṃ jānāti – ‘ñattajjhāpanno ayamāyasmā bhikkhu yasappatto, nāssa idhekacce ādīnavā saṃvijjantī’ti."
    ],
    "innerText": "‘‘Yato naṃ samannesamāno evaṃ jānāti – ‘dīgharattaṃ samāpanno ayamāyasmā imaṃ kusalaṃ dhammaṃ, nāyamāyasmā ittarasamāpanno’ti, tato naṃ uttariṃ samannesati – ‘ñattajjhāpanno ayamāyasmā bhikkhu yasappatto, saṃvijjantassa idhekacce ādīnavā’ti? Na tāva, bhikkhave, bhikkhuno idhekacce ādīnavā saṃvijjanti yāva na ñattajjhāpanno hoti yasappatto. Yato ca kho, bhikkhave, bhikkhu ñattajjhāpanno hoti yasappatto , athassa idhekacce ādīnavā saṃvijjanti. Tamenaṃ samannesamāno evaṃ jānāti – ‘ñattajjhāpanno ayamāyasmā bhikkhu yasappatto, nāssa idhekacce ādīnavā saṃvijjantī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yato naṃ samannesamāno evaṃ jānāti – ‘ñattajjhāpanno ayamāyasmā ",
      " bhikkhu yasappatto, nāssa idhekacce ādīnavā saṃvijjantī’ti, tato naṃ uttariṃ samannesati – ‘abhayūparato ayamāyasmā, nāyamāyasmā bhayūparato; vītarāgattā kāme na sevati khayā rāgassā’ti? Tamenaṃ samannesamāno evaṃ jānāti – ‘abhayūparato ayamāyasmā, nāyamāyasmā bhayūparato; vītarāgattā kāme na sevati khayā rāgassā’ti. Tañce, bhikkhave, bhikkhuṃ pare evaṃ puccheyyuṃ – ‘ke panāyasmato ākārā, ke anvayā, yenāyasmā evaṃ vadesi – abhayūparato ayamāyasmā, nāyamāyasmā bhayūparato; vītarāgattā kāme na sevati khayā rāgassā’ti. Sammā byākaramāno, bhikkhave, bhikkhu evaṃ byākareyya – ‘tathā hi pana ayamāyasmā saṅghe vā viharanto eko vā viharanto, ye ca tattha sugatā ye ca tattha duggatā, ye ca tattha gaṇamanusāsanti, ye ca idhekacce āmisesu saṃdissanti, ye ca idhekacce āmisena anupalittā, nāyamāyasmā taṃ tena avajānāti ",
      ". Sammukhā kho pana metaṃ bhagavato ",
      " sutaṃ sammukhā paṭiggahitaṃ – abhayūparatohamasmi, nāhamasmi bhayūparato, vītarāgattā kāme na sevāmi khayā rāgassā’ti."
    ],
    "innerText": "‘‘Yato naṃ samannesamāno evaṃ jānāti – ‘ñattajjhāpanno ayamāyasmā bhikkhu yasappatto, nāssa idhekacce ādīnavā saṃvijjantī’ti, tato naṃ uttariṃ samannesati – ‘abhayūparato ayamāyasmā, nāyamāyasmā bhayūparato; vītarāgattā kāme na sevati khayā rāgassā’ti? Tamenaṃ samannesamāno evaṃ jānāti – ‘abhayūparato ayamāyasmā, nāyamāyasmā bhayūparato; vītarāgattā kāme na sevati khayā rāgassā’ti. Tañce, bhikkhave, bhikkhuṃ pare evaṃ puccheyyuṃ – ‘ke panāyasmato ākārā, ke anvayā, yenāyasmā evaṃ vadesi – abhayūparato ayamāyasmā, nāyamāyasmā bhayūparato; vītarāgattā kāme na sevati khayā rāgassā’ti. Sammā byākaramāno, bhikkhave, bhikkhu evaṃ byākareyya – ‘tathā hi pana ayamāyasmā saṅghe vā viharanto eko vā viharanto, ye ca tattha sugatā ye ca tattha duggatā, ye ca tattha gaṇamanusāsanti, ye ca idhekacce āmisesu saṃdissanti, ye ca idhekacce āmisena anupalittā, nāyamāyasmā taṃ tena avajānāti . Sammukhā kho pana metaṃ bhagavato sutaṃ sammukhā paṭiggahitaṃ – abhayūparatohamasmi, nāhamasmi bhayūparato, vītarāgattā kāme na sevāmi khayā rāgassā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "489"
      },
      ". ‘‘Tatra ",
      ", bhikkhave, tathāgatova uttariṃ paṭipucchitabbo – ‘ye saṃkiliṭṭhā cakkhusotaviññeyyā dhammā, saṃvijjanti vā te tathāgatassa no vā’ti? Byākaramāno, bhikkhave, tathāgato evaṃ byākareyya – ‘ye saṃkiliṭṭhā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṃvijjantī’’’ti."
    ],
    "innerText": "489. ‘‘Tatra , bhikkhave, tathāgatova uttariṃ paṭipucchitabbo – ‘ye saṃkiliṭṭhā cakkhusotaviññeyyā dhammā, saṃvijjanti vā te tathāgatassa no vā’ti? Byākaramāno, bhikkhave, tathāgato evaṃ byākareyya – ‘ye saṃkiliṭṭhā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṃvijjantī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ye vītimissā cakkhusotaviññeyyā dhammā, saṃvijjanti vā te tathāgatassa no vāti? Byākaramāno, bhikkhave, tathāgato evaṃ byākareyya – ‘ye vītimissā cakkhusotaviññeyyā dhammā, na te tathāgatassa saṃvijjantī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye vodātā cakkhusotaviññeyyā dhammā, saṃvijjanti vā te tathāgatassa no vāti? Byākaramāno, bhikkhave, tathāgato evaṃ byākareyya – ‘ye vodātā cakkhusotaviññeyyā dhammā, saṃvijjanti te tathāgatassa; etaṃpathohamasmi, etaṃgocaro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[etapathohamasmi etagocaro (sī. syā. kaṃ. pī.)]"
      },
      ", no ca tena tammayo’ti."
    ],
    "innerText": "‘‘Ye vodātā cakkhusotaviññeyyā dhammā, saṃvijjanti vā te tathāgatassa no vāti? Byākaramāno, bhikkhave, tathāgato evaṃ byākareyya – ‘ye vodātā cakkhusotaviññeyyā dhammā, saṃvijjanti te tathāgatassa; etaṃpathohamasmi, etaṃgocaro [etapathohamasmi etagocaro (sī. syā. kaṃ. pī.)], no ca tena tammayo’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃvādiṃ kho, bhikkhave, satthāraṃ arahati sāvako upasaṅkamituṃ dhammassavanāya. Tassa satthā dhammaṃ deseti uttaruttariṃ paṇītapaṇītaṃ kaṇhasukkasappaṭibhāgaṃ. Yathā yathā kho, bhikkhave, bhikkhuno satthā dhammaṃ deseti uttaruttariṃ paṇītapaṇītaṃ kaṇhasukkasappaṭibhāgaṃ tathā tathā so tasmiṃ dhamme abhiññāya idhekaccaṃ dhammaṃ dhammesu ",
      " niṭṭhaṃ gacchati, satthari pasīdati – ‘sammāsambuddho bhagavā, svākkhāto bhagavatā dhammo, suppaṭipanno saṅgho’ti. Tañce, bhikkhave, bhikkhuṃ pare evaṃ puccheyyuṃ – ‘ke panāyasmato ākārā, ke anvayā, yenāyasmā evaṃ vadesi – sammāsambuddho bhagavā ",
      ", svākkhāto bhagavatā dhammo, suppaṭipanno saṅgho’ti? Sammā byākaramāno, bhikkhave, bhikkhu evaṃ byākareyya – ‘idhāhaṃ, āvuso, yena bhagavā tenupasaṅkamiṃ dhammassavanāya. Tassa me bhagavā dhammaṃ deseti uttaruttariṃ paṇītapaṇītaṃ kaṇhasukkasappaṭibhāgaṃ. Yathā yathā me, āvuso ",
      ", bhagavā dhammaṃ deseti uttaruttariṃ paṇītapaṇītaṃ kaṇhasukkasappaṭibhāgaṃ tathā tathāhaṃ tasmiṃ dhamme abhiññāya idhekaccaṃ dhammaṃ dhammesu niṭṭhamagamaṃ, satthari pasīdiṃ – sammāsambuddho bhagavā, svākkhāto bhagavatā, dhammo, suppaṭipanno saṅgho’ti."
    ],
    "innerText": "‘‘Evaṃvādiṃ kho, bhikkhave, satthāraṃ arahati sāvako upasaṅkamituṃ dhammassavanāya. Tassa satthā dhammaṃ deseti uttaruttariṃ paṇītapaṇītaṃ kaṇhasukkasappaṭibhāgaṃ. Yathā yathā kho, bhikkhave, bhikkhuno satthā dhammaṃ deseti uttaruttariṃ paṇītapaṇītaṃ kaṇhasukkasappaṭibhāgaṃ tathā tathā so tasmiṃ dhamme abhiññāya idhekaccaṃ dhammaṃ dhammesu niṭṭhaṃ gacchati, satthari pasīdati – ‘sammāsambuddho bhagavā, svākkhāto bhagavatā dhammo, suppaṭipanno saṅgho’ti. Tañce, bhikkhave, bhikkhuṃ pare evaṃ puccheyyuṃ – ‘ke panāyasmato ākārā, ke anvayā, yenāyasmā evaṃ vadesi – sammāsambuddho bhagavā , svākkhāto bhagavatā dhammo, suppaṭipanno saṅgho’ti? Sammā byākaramāno, bhikkhave, bhikkhu evaṃ byākareyya – ‘idhāhaṃ, āvuso, yena bhagavā tenupasaṅkamiṃ dhammassavanāya. Tassa me bhagavā dhammaṃ deseti uttaruttariṃ paṇītapaṇītaṃ kaṇhasukkasappaṭibhāgaṃ. Yathā yathā me, āvuso , bhagavā dhammaṃ deseti uttaruttariṃ paṇītapaṇītaṃ kaṇhasukkasappaṭibhāgaṃ tathā tathāhaṃ tasmiṃ dhamme abhiññāya idhekaccaṃ dhammaṃ dhammesu niṭṭhamagamaṃ, satthari pasīdiṃ – sammāsambuddho bhagavā, svākkhāto bhagavatā, dhammo, suppaṭipanno saṅgho’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "490"
      },
      ". ‘‘Yassa ",
      " kassaci, bhikkhave, imehi ākārehi imehi padehi imehi byañjanehi tathāgate saddhā niviṭṭhā hoti mūlajātā patiṭṭhitā, ayaṃ vuccati, bhikkhave, ākāravatī saddhā dassanamūlikā, daḷhā; asaṃhāriyā samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṃ. Evaṃ kho, bhikkhave, tathāgate dhammasamannesanā hoti. Evañca pana tathāgato dhammatāsusamanniṭṭho hotī’’ti."
    ],
    "innerText": "490. ‘‘Yassa kassaci, bhikkhave, imehi ākārehi imehi padehi imehi byañjanehi tathāgate saddhā niviṭṭhā hoti mūlajātā patiṭṭhitā, ayaṃ vuccati, bhikkhave, ākāravatī saddhā dassanamūlikā, daḷhā; asaṃhāriyā samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṃ. Evaṃ kho, bhikkhave, tathāgate dhammasamannesanā hoti. Evañca pana tathāgato dhammatāsusamanniṭṭho hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vīmaṃsakasuttaṃ niṭṭhitaṃ sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Kosambiyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "491"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Tena kho pana samayena kosambiyaṃ bhikkhū bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti. Te na ceva aññamaññaṃ saññāpenti na ca saññattiṃ upenti, na ca aññamaññaṃ nijjhāpenti, na ca nijjhattiṃ upenti. Atha kho aññataro ",
      " bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘idha, bhante, kosambiyaṃ bhikkhū bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti, te na ceva aññamaññaṃ saññāpenti, na ca saññattiṃ upenti, na ca aññamaññaṃ nijjhāpenti, na ca nijjhattiṃ upentī’’ti."
    ],
    "innerText": "491. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Tena kho pana samayena kosambiyaṃ bhikkhū bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti. Te na ceva aññamaññaṃ saññāpenti na ca saññattiṃ upenti, na ca aññamaññaṃ nijjhāpenti, na ca nijjhattiṃ upenti. Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘idha, bhante, kosambiyaṃ bhikkhū bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti, te na ceva aññamaññaṃ saññāpenti, na ca saññattiṃ upenti, na ca aññamaññaṃ nijjhāpenti, na ca nijjhattiṃ upentī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā aññataraṃ bhikkhuṃ āmantesi – ‘‘ehi tvaṃ, bhikkhu, mama vacanena te bhikkhū āmantehi – ‘satthā vo āyasmante āmantetī’’’ti. ‘‘Evaṃ ",
      ", bhante’’ti kho so bhikkhu bhagavato paṭissutvā yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū etadavoca – ‘‘satthā āyasmante āmantetī’’ti. ‘‘Evamāvuso’’ti kho te bhikkhū tassa bhikkhuno paṭissutvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ ",
      " nisinne kho te bhikkhū bhagavā etadavoca – ‘‘saccaṃ kira tumhe, bhikkhave, bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharatha, te na ceva aññamaññaṃ saññāpetha, na ca saññattiṃ upetha, na ca aññamaññaṃ nijjhāpetha, na ca nijjhattiṃ upethā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, bhikkhave, yasmiṃ tumhe samaye bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ ",
      " mukhasattīhi vitudantā viharatha, api nu tumhākaṃ tasmiṃ samaye mettaṃ kāyakammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, mettaṃ vacīkammaṃ…pe… mettaṃ manokammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho cā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kira, bhikkhave, yasmiṃ tumhe samaye bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharatha, neva tumhākaṃ ",
      " tasmiṃ samaye mettaṃ kāyakammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, na mettaṃ vacīkammaṃ…pe… na mettaṃ manokammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca. Atha kiñcarahi tumhe, moghapurisā, kiṃ jānantā kiṃ passantā bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharatha, te na ceva aññamaññaṃ saññāpetha, na ca saññattiṃ upetha, na ca aññamaññaṃ nijjhāpetha, na ca nijjhattiṃ upetha ",
      "? Tañhi tumhākaṃ, moghapurisā, bhavissati dīgharattaṃ ahitāya dukkhāyā’’ti."
    ],
    "innerText": "Atha kho bhagavā aññataraṃ bhikkhuṃ āmantesi – ‘‘ehi tvaṃ, bhikkhu, mama vacanena te bhikkhū āmantehi – ‘satthā vo āyasmante āmantetī’’’ti. ‘‘Evaṃ , bhante’’ti kho so bhikkhu bhagavato paṭissutvā yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū etadavoca – ‘‘satthā āyasmante āmantetī’’ti. ‘‘Evamāvuso’’ti kho te bhikkhū tassa bhikkhuno paṭissutvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinne kho te bhikkhū bhagavā etadavoca – ‘‘saccaṃ kira tumhe, bhikkhave, bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharatha, te na ceva aññamaññaṃ saññāpetha, na ca saññattiṃ upetha, na ca aññamaññaṃ nijjhāpetha, na ca nijjhattiṃ upethā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, bhikkhave, yasmiṃ tumhe samaye bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharatha, api nu tumhākaṃ tasmiṃ samaye mettaṃ kāyakammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, mettaṃ vacīkammaṃ…pe… mettaṃ manokammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho cā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kira, bhikkhave, yasmiṃ tumhe samaye bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharatha, neva tumhākaṃ tasmiṃ samaye mettaṃ kāyakammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, na mettaṃ vacīkammaṃ…pe… na mettaṃ manokammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca. Atha kiñcarahi tumhe, moghapurisā, kiṃ jānantā kiṃ passantā bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharatha, te na ceva aññamaññaṃ saññāpetha, na ca saññattiṃ upetha, na ca aññamaññaṃ nijjhāpetha, na ca nijjhattiṃ upetha ? Tañhi tumhākaṃ, moghapurisā, bhavissati dīgharattaṃ ahitāya dukkhāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "492"
      },
      ". Atha kho bhagavā bhikkhū āmantesi – ‘‘chayime, bhikkhave, dhammā sāraṇīyā piyakaraṇā garukaraṇā saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattanti. Katame cha? Idha, bhikkhave, bhikkhuno mettaṃ kāyakammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati."
    ],
    "innerText": "492. Atha kho bhagavā bhikkhū āmantesi – ‘‘chayime, bhikkhave, dhammā sāraṇīyā piyakaraṇā garukaraṇā saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattanti. Katame cha? Idha, bhikkhave, bhikkhuno mettaṃ kāyakammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhuno mettaṃ vacīkammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo ",
      " garukaraṇo saṅgahāya avivādāya sāmaggiyā ekibhāvāya saṃvattati."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhuno mettaṃ vacīkammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekibhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhuno mettaṃ manokammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu ye te lābhā dhammikā dhammaladdhā antamaso pattapariyāpannamattampi, tathārūpehi lābhehi appaṭivibhattabhogī hoti sīlavantehi sabrahmacārīhi sādhāraṇabhogī. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu yāni tāni sīlāni akhaṇḍāni acchiddāni asabalāni akammāsāni bhujissāni viññuppasatthāni ",
      " aparāmaṭṭhāni samādhisaṃvattanikāni tathārūpesu sīlesu sīlasāmaññagato viharati sabrahmacārīhi āvi ceva raho ca. Ayampi dhammo ",
      " sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu yāni tāni sīlāni akhaṇḍāni acchiddāni asabalāni akammāsāni bhujissāni viññuppasatthāni aparāmaṭṭhāni samādhisaṃvattanikāni tathārūpesu sīlesu sīlasāmaññagato viharati sabrahmacārīhi āvi ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu yāyaṃ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya tathārūpāya diṭṭhiyā diṭṭhisāmaññagato viharati sabrahmacārīhi āvi ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ime kho, bhikkhave, cha sāraṇīyā dhammā piyakaraṇā garukaraṇā saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattanti. Imesaṃ kho, bhikkhave, channaṃ sāraṇīyānaṃ dhammānaṃ etaṃ aggaṃ etaṃ saṅgāhikaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṅgāhakaṃ (?)]"
      },
      " etaṃ saṅghāṭanikaṃ – yadidaṃ yāyaṃ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya. Seyyathāpi, bhikkhave, kūṭāgārassa etaṃ aggaṃ etaṃ saṅgāhikaṃ etaṃ saṅghāṭanikaṃ yadidaṃ kūṭaṃ; evameva kho, bhikkhave ",
      ", imesaṃ channaṃ sāraṇīyānaṃ dhammānaṃ etaṃ aggaṃ etaṃ saṅgāhikaṃ etaṃ saṅghāṭanikaṃ ",
      " yadidaṃ yāyaṃ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya."
    ],
    "innerText": "‘‘Ime kho, bhikkhave, cha sāraṇīyā dhammā piyakaraṇā garukaraṇā saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattanti. Imesaṃ kho, bhikkhave, channaṃ sāraṇīyānaṃ dhammānaṃ etaṃ aggaṃ etaṃ saṅgāhikaṃ [saṅgāhakaṃ (?)] etaṃ saṅghāṭanikaṃ – yadidaṃ yāyaṃ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya. Seyyathāpi, bhikkhave, kūṭāgārassa etaṃ aggaṃ etaṃ saṅgāhikaṃ etaṃ saṅghāṭanikaṃ yadidaṃ kūṭaṃ; evameva kho, bhikkhave , imesaṃ channaṃ sāraṇīyānaṃ dhammānaṃ etaṃ aggaṃ etaṃ saṅgāhikaṃ etaṃ saṅghāṭanikaṃ yadidaṃ yāyaṃ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "493"
      },
      ". ‘‘Kathañca, bhikkhave, yāyaṃ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya? Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā iti paṭisañcikkhati – ‘atthi nu ",
      " kho me taṃ pariyuṭṭhānaṃ ajjhattaṃ appahīnaṃ, yenāhaṃ pariyuṭṭhānena pariyuṭṭhitacitto yathābhūtaṃ nappajāneyyaṃ na passeyya’nti? Sace, bhikkhave, bhikkhu kāmarāgapariyuṭṭhito hoti, pariyuṭṭhitacittova hoti. Sace, bhikkhave, bhikkhu byāpādapariyuṭṭhito hoti, pariyuṭṭhitacittova hoti. Sace, bhikkhave, bhikkhu thīnamiddhapariyuṭṭhito hoti, pariyuṭṭhitacittova hoti. Sace, bhikkhave, bhikkhu uddhaccakukkuccapariyuṭṭhito hoti, pariyuṭṭhitacittova hoti. Sace, bhikkhave, bhikkhu vicikicchāpariyuṭṭhito hoti, pariyuṭṭhitacittova hoti. Sace, bhikkhave, bhikkhu idhalokacintāya pasuto hoti, pariyuṭṭhitacittova hoti. Sace, bhikkhave, bhikkhu paralokacintāya pasuto hoti, pariyuṭṭhitacittova hoti. Sace, bhikkhave, bhikkhu bhaṇḍanajāto kalahajāto vivādāpanno aññamaññaṃ mukhasattīhi vitudanto viharati, pariyuṭṭhitacittova hoti ",
      ". So evaṃ pajānāti – ‘natthi kho me taṃ pariyuṭṭhānaṃ ajjhattaṃ appahīnaṃ, yenāhaṃ pariyuṭṭhānena pariyuṭṭhitacitto yathābhūtaṃ nappajāneyyaṃ na passeyyaṃ. Suppaṇihitaṃ me mānasaṃ saccānaṃ bodhāyā’ti. Idamassa paṭhamaṃ ñāṇaṃ adhigataṃ hoti ariyaṃ lokuttaraṃ asādhāraṇaṃ puthujjanehi."
    ],
    "innerText": "493. ‘‘Kathañca, bhikkhave, yāyaṃ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya? Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā iti paṭisañcikkhati – ‘atthi nu kho me taṃ pariyuṭṭhānaṃ ajjhattaṃ appahīnaṃ, yenāhaṃ pariyuṭṭhānena pariyuṭṭhitacitto yathābhūtaṃ nappajāneyyaṃ na passeyya’nti? Sace, bhikkhave, bhikkhu kāmarāgapariyuṭṭhito hoti, pariyuṭṭhitacittova hoti. Sace, bhikkhave, bhikkhu byāpādapariyuṭṭhito hoti, pariyuṭṭhitacittova hoti. Sace, bhikkhave, bhikkhu thīnamiddhapariyuṭṭhito hoti, pariyuṭṭhitacittova hoti. Sace, bhikkhave, bhikkhu uddhaccakukkuccapariyuṭṭhito hoti, pariyuṭṭhitacittova hoti. Sace, bhikkhave, bhikkhu vicikicchāpariyuṭṭhito hoti, pariyuṭṭhitacittova hoti. Sace, bhikkhave, bhikkhu idhalokacintāya pasuto hoti, pariyuṭṭhitacittova hoti. Sace, bhikkhave, bhikkhu paralokacintāya pasuto hoti, pariyuṭṭhitacittova hoti. Sace, bhikkhave, bhikkhu bhaṇḍanajāto kalahajāto vivādāpanno aññamaññaṃ mukhasattīhi vitudanto viharati, pariyuṭṭhitacittova hoti . So evaṃ pajānāti – ‘natthi kho me taṃ pariyuṭṭhānaṃ ajjhattaṃ appahīnaṃ, yenāhaṃ pariyuṭṭhānena pariyuṭṭhitacitto yathābhūtaṃ nappajāneyyaṃ na passeyyaṃ. Suppaṇihitaṃ me mānasaṃ saccānaṃ bodhāyā’ti. Idamassa paṭhamaṃ ñāṇaṃ adhigataṃ hoti ariyaṃ lokuttaraṃ asādhāraṇaṃ puthujjanehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "494"
      },
      ". ‘‘Puna caparaṃ, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘imaṃ nu kho ahaṃ diṭṭhiṃ āsevanto bhāvento bahulīkaronto labhāmi paccattaṃ samathaṃ, labhāmi paccattaṃ nibbuti’nti? So evaṃ pajānāti – ‘imaṃ kho ahaṃ diṭṭhiṃ āsevanto bhāvento bahulīkaronto labhāmi paccattaṃ ",
      " samathaṃ, labhāmi paccattaṃ nibbuti’nti. Idamassa dutiyaṃ ñāṇaṃ adhigataṃ hoti ariyaṃ lokuttaraṃ asādhāraṇaṃ puthujjanehi."
    ],
    "innerText": "494. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘imaṃ nu kho ahaṃ diṭṭhiṃ āsevanto bhāvento bahulīkaronto labhāmi paccattaṃ samathaṃ, labhāmi paccattaṃ nibbuti’nti? So evaṃ pajānāti – ‘imaṃ kho ahaṃ diṭṭhiṃ āsevanto bhāvento bahulīkaronto labhāmi paccattaṃ samathaṃ, labhāmi paccattaṃ nibbuti’nti. Idamassa dutiyaṃ ñāṇaṃ adhigataṃ hoti ariyaṃ lokuttaraṃ asādhāraṇaṃ puthujjanehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "495"
      },
      ". ‘‘Puna caparaṃ, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yathā rūpāyāhaṃ diṭṭhiyā samannāgato, atthi nu kho ito bahiddhā añño samaṇo ",
      " vā brāhmaṇo vā ",
      " tathārūpāya diṭṭhiyā samannāgato’ti? So evaṃ pajānāti – ‘yathārūpāyāhaṃ diṭṭhiyā samannāgato, natthi ito bahiddhā añño samaṇo vā brāhmaṇo vā tathārūpāya diṭṭhiyā samannāgato’ti. Idamassa tatiyaṃ ñāṇaṃ adhigataṃ hoti ariyaṃ lokuttaraṃ asādhāraṇaṃ puthujjanehi."
    ],
    "innerText": "495. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yathā rūpāyāhaṃ diṭṭhiyā samannāgato, atthi nu kho ito bahiddhā añño samaṇo vā brāhmaṇo vā tathārūpāya diṭṭhiyā samannāgato’ti? So evaṃ pajānāti – ‘yathārūpāyāhaṃ diṭṭhiyā samannāgato, natthi ito bahiddhā añño samaṇo vā brāhmaṇo vā tathārūpāya diṭṭhiyā samannāgato’ti. Idamassa tatiyaṃ ñāṇaṃ adhigataṃ hoti ariyaṃ lokuttaraṃ asādhāraṇaṃ puthujjanehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "496"
      },
      ". ‘‘Puna caparaṃ, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yathārūpāya dhammatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya dhammatāya samannāgato’ti. Kathaṃrūpāya ca, bhikkhave, dhammatāya diṭṭhisampanno puggalo samannāgato? Dhammatā esā, bhikkhave, diṭṭhisampannassa puggalassa – ‘kiñcāpi tathārūpiṃ āpattiṃ āpajjati, yathārūpāya āpattiyā vuṭṭhānaṃ paññāyati, atha kho naṃ khippameva satthari vā viññūsu vā sabrahmacārīsu deseti vivarati uttānīkaroti; desetvā vivaritvā uttānīkatvā āyatiṃ saṃvaraṃ āpajjati’. Seyyathāpi, bhikkhave, daharo kumāro mando uttānaseyyako hatthena vā pādena vā aṅgāraṃ akkamitvā khippameva paṭisaṃharati; evameva kho, bhikkhave, dhammatā esā diṭṭhisampannassa puggalassa – ‘kiñcāpi tathārūpiṃ ",
      " āpattiṃ āpajjati yathārūpāya āpattiyā vuṭṭhānaṃ paññāyati, atha kho naṃ khippameva satthari vā viññūsu vā sabrahmacārīsu deseti vivarati ",
      " uttānīkaroti; desetvā vivaritvā uttānīkatvā āyatiṃ saṃvaraṃ āpajjati’. So evaṃ pajānāti – ‘yathārūpāya dhammatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya dhammatāya samannāgato’ti. Idamassa catutthaṃ ñāṇaṃ adhigataṃ hoti ariyaṃ lokuttaraṃ asādhāraṇaṃ puthujjanehi."
    ],
    "innerText": "496. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yathārūpāya dhammatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya dhammatāya samannāgato’ti. Kathaṃrūpāya ca, bhikkhave, dhammatāya diṭṭhisampanno puggalo samannāgato? Dhammatā esā, bhikkhave, diṭṭhisampannassa puggalassa – ‘kiñcāpi tathārūpiṃ āpattiṃ āpajjati, yathārūpāya āpattiyā vuṭṭhānaṃ paññāyati, atha kho naṃ khippameva satthari vā viññūsu vā sabrahmacārīsu deseti vivarati uttānīkaroti; desetvā vivaritvā uttānīkatvā āyatiṃ saṃvaraṃ āpajjati’. Seyyathāpi, bhikkhave, daharo kumāro mando uttānaseyyako hatthena vā pādena vā aṅgāraṃ akkamitvā khippameva paṭisaṃharati; evameva kho, bhikkhave, dhammatā esā diṭṭhisampannassa puggalassa – ‘kiñcāpi tathārūpiṃ āpattiṃ āpajjati yathārūpāya āpattiyā vuṭṭhānaṃ paññāyati, atha kho naṃ khippameva satthari vā viññūsu vā sabrahmacārīsu deseti vivarati uttānīkaroti; desetvā vivaritvā uttānīkatvā āyatiṃ saṃvaraṃ āpajjati’. So evaṃ pajānāti – ‘yathārūpāya dhammatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya dhammatāya samannāgato’ti. Idamassa catutthaṃ ñāṇaṃ adhigataṃ hoti ariyaṃ lokuttaraṃ asādhāraṇaṃ puthujjanehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "497"
      },
      ". ‘‘Puna caparaṃ, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yathārūpāya dhammatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya dhammatāya samannāgato’ti. Kathaṃrūpāya ca, bhikkhave, dhammatāya diṭṭhisampanno puggalo samannāgato? Dhammatā esā, bhikkhave, diṭṭhisampannassa puggalassa – ‘kiñcāpi yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni tattha ussukkaṃ āpanno hoti, atha khvāssa tibbāpekkhā hoti adhisīlasikkhāya adhicittasikkhāya adhipaññāsikkhāya’. Seyyathāpi, bhikkhave, gāvī taruṇavacchā thambañca ālumpati vacchakañca apacinati; evameva kho, bhikkhave ",
      ", dhammatā esā diṭṭhisampannassa puggalassa – ‘kiñcāpi yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni tattha ussukkaṃ āpanno hoti, atha khvāssa tibbāpekkhā hoti adhisīlasikkhāya adhicittasikkhāya adhipaññāsikkhāya’. So evaṃ pajānāti – ‘yathārūpāya dhammatāya diṭṭhisampanno puggalo ",
      " samannāgato, ahampi tathārūpāya dhammatāya samannāgato’ti. Idamassa pañcamaṃ ñāṇaṃ adhigataṃ hoti ariyaṃ lokuttaraṃ asādhāraṇaṃ puthujjanehi."
    ],
    "innerText": "497. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yathārūpāya dhammatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya dhammatāya samannāgato’ti. Kathaṃrūpāya ca, bhikkhave, dhammatāya diṭṭhisampanno puggalo samannāgato? Dhammatā esā, bhikkhave, diṭṭhisampannassa puggalassa – ‘kiñcāpi yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni tattha ussukkaṃ āpanno hoti, atha khvāssa tibbāpekkhā hoti adhisīlasikkhāya adhicittasikkhāya adhipaññāsikkhāya’. Seyyathāpi, bhikkhave, gāvī taruṇavacchā thambañca ālumpati vacchakañca apacinati; evameva kho, bhikkhave , dhammatā esā diṭṭhisampannassa puggalassa – ‘kiñcāpi yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni tattha ussukkaṃ āpanno hoti, atha khvāssa tibbāpekkhā hoti adhisīlasikkhāya adhicittasikkhāya adhipaññāsikkhāya’. So evaṃ pajānāti – ‘yathārūpāya dhammatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya dhammatāya samannāgato’ti. Idamassa pañcamaṃ ñāṇaṃ adhigataṃ hoti ariyaṃ lokuttaraṃ asādhāraṇaṃ puthujjanehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "498"
      },
      ". ‘‘Puna ",
      " caparaṃ, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yathārūpāya balatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya balatāya samannāgato’ti. Kathaṃrūpāya ca, bhikkhave, balatāya diṭṭhisampanno puggalo samannāgato? Balatā esā, bhikkhave, diṭṭhisampannassa puggalassa yaṃ tathāgatappavedite dhammavinaye desiyamāne aṭṭhiṃkatvā manasikatvā sabbacetasā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sabbacetaso (sī. syā. kaṃ. pī.), sabbaṃ cetasā (ka.)]"
      },
      " samannāharitvā ohitasoto dhammaṃ suṇāti. So evaṃ pajānāti – ‘yathārūpāya balatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya balatāya samannāgato’ti. Idamassa chaṭṭhaṃ ñāṇaṃ adhigataṃ hoti ariyaṃ lokuttaraṃ asādhāraṇaṃ puthujjanehi."
    ],
    "innerText": "498. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yathārūpāya balatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya balatāya samannāgato’ti. Kathaṃrūpāya ca, bhikkhave, balatāya diṭṭhisampanno puggalo samannāgato? Balatā esā, bhikkhave, diṭṭhisampannassa puggalassa yaṃ tathāgatappavedite dhammavinaye desiyamāne aṭṭhiṃkatvā manasikatvā sabbacetasā [sabbacetaso (sī. syā. kaṃ. pī.), sabbaṃ cetasā (ka.)] samannāharitvā ohitasoto dhammaṃ suṇāti. So evaṃ pajānāti – ‘yathārūpāya balatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya balatāya samannāgato’ti. Idamassa chaṭṭhaṃ ñāṇaṃ adhigataṃ hoti ariyaṃ lokuttaraṃ asādhāraṇaṃ puthujjanehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "499"
      },
      ". ‘‘Puna caparaṃ, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yathārūpāya balatāya ",
      " diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya balatāya samannāgato’ti. Kathaṃrūpāya ca, bhikkhave, balatāya diṭṭhisampanno puggalo samannāgato? Balatā esā, bhikkhave, diṭṭhisampannassa puggalassa yaṃ tathāgatappavedite dhammavinaye desiyamāne labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ. So evaṃ pajānāti – ‘yathārūpāya balatāya diṭṭhisampanno puggalo ",
      " samannāgato, ahampi tathārūpāya balatāya samannāgato’ti. Idamassa sattamaṃ ñāṇaṃ adhigataṃ hoti ariyaṃ lokuttaraṃ asādhāraṇaṃ puthujjanehi."
    ],
    "innerText": "499. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yathārūpāya balatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya balatāya samannāgato’ti. Kathaṃrūpāya ca, bhikkhave, balatāya diṭṭhisampanno puggalo samannāgato? Balatā esā, bhikkhave, diṭṭhisampannassa puggalassa yaṃ tathāgatappavedite dhammavinaye desiyamāne labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ. So evaṃ pajānāti – ‘yathārūpāya balatāya diṭṭhisampanno puggalo samannāgato, ahampi tathārūpāya balatāya samannāgato’ti. Idamassa sattamaṃ ñāṇaṃ adhigataṃ hoti ariyaṃ lokuttaraṃ asādhāraṇaṃ puthujjanehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "500"
      },
      ". ‘‘Evaṃ sattaṅgasamannāgatassa kho, bhikkhave, ariyasāvakassa dhammatā susamanniṭṭhā hoti sotāpattiphalasacchikiriyāya. Evaṃ sattaṅgasamannāgato ",
      " kho, bhikkhave, ariyasāvako sotāpattiphalasamannāgato hotī’’ti."
    ],
    "innerText": "500. ‘‘Evaṃ sattaṅgasamannāgatassa kho, bhikkhave, ariyasāvakassa dhammatā susamanniṭṭhā hoti sotāpattiphalasacchikiriyāya. Evaṃ sattaṅgasamannāgato kho, bhikkhave, ariyasāvako sotāpattiphalasamannāgato hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kosambiyasuttaṃ niṭṭhitaṃ aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Brahmanimantanikasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "501"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "501. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ekamidāhaṃ, bhikkhave, samayaṃ ukkaṭṭhāyaṃ viharāmi subhagavane sālarājamūle. Tena kho pana, bhikkhave, samayena bakassa brahmuno evarūpaṃ pāpakaṃ diṭṭhigataṃ uppannaṃ hoti – ‘idaṃ niccaṃ, idaṃ dhuvaṃ, idaṃ sassataṃ, idaṃ kevalaṃ, idaṃ acavanadhammaṃ, idañhi na jāyati na jīyati na mīyati na cavati na upapajjati, ito ca panaññaṃ uttari nissaraṇaṃ natthī’ti. Atha khvāhaṃ, bhikkhave, bakassa brahmuno cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva – ukkaṭṭhāyaṃ subhagavane sālarājamūle antarahito tasmiṃ brahmaloke pāturahosiṃ. Addasā kho maṃ, bhikkhave, bako brahmā dūratova āgacchantaṃ; disvāna maṃ etadavoca – ‘ehi kho, mārisa, svāgataṃ, mārisa! Cirassaṃ kho, mārisa, imaṃ pariyāyamakāsi yadidaṃ idhāgamanāya. Idañhi, mārisa, niccaṃ, idaṃ dhuvaṃ, idaṃ sassataṃ, idaṃ kevalaṃ, idaṃ acavanadhammaṃ, idañhi na jāyati na jīyati na mīyati na cavati na upapajjati. Ito ca panaññaṃ uttari nissaraṇaṃ natthī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vutte, ahaṃ, bhikkhave, bakaṃ brahmānaṃ etadavocaṃ ",
      " – ‘‘avijjāgato vata, bho, bako brahmā; avijjāgato vata, bho, bako brahmā; yatra hi nāma aniccaṃyeva samānaṃ niccanti vakkhati, addhuvaṃyeva samānaṃ dhuvanti vakkhati, asassataṃyeva samānaṃ sassatanti vakkhati, akevalaṃyeva samānaṃ ",
      " kevalanti vakkhati, cavanadhammaṃyeva samānaṃ acavanadhammanti vakkhati; yattha ca pana jāyati jīyati mīyati cavati upapajjati tañca vakkhati – ‘idañhi na jāyati na jīyati na mīyati na cavati na upapajjatī’ti; santañca panaññaṃ uttari nissaraṇaṃ ‘natthaññaṃ uttari nissaraṇa’nti vakkhatī’’ti."
    ],
    "innerText": "Evaṃ vutte, ahaṃ, bhikkhave, bakaṃ brahmānaṃ etadavocaṃ – ‘‘avijjāgato vata, bho, bako brahmā; avijjāgato vata, bho, bako brahmā; yatra hi nāma aniccaṃyeva samānaṃ niccanti vakkhati, addhuvaṃyeva samānaṃ dhuvanti vakkhati, asassataṃyeva samānaṃ sassatanti vakkhati, akevalaṃyeva samānaṃ kevalanti vakkhati, cavanadhammaṃyeva samānaṃ acavanadhammanti vakkhati; yattha ca pana jāyati jīyati mīyati cavati upapajjati tañca vakkhati – ‘idañhi na jāyati na jīyati na mīyati na cavati na upapajjatī’ti; santañca panaññaṃ uttari nissaraṇaṃ ‘natthaññaṃ uttari nissaraṇa’nti vakkhatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "502"
      },
      ". ‘‘Atha ",
      " kho, bhikkhave, māro pāpimā aññataraṃ brahmapārisajjaṃ anvāvisitvā maṃ etadavoca – ‘bhikkhu, bhikkhu, metamāsado metamāsado, eso hi, bhikkhu, brahmā mahābrahmā ",
      " abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sajjitā (syā. kaṃ. ka.), sañjitā (sī. pī.)]"
      },
      " vasī pitā bhūtabhabyānaṃ. Ahesuṃ kho ye, bhikkhu, tayā pubbe samaṇabrāhmaṇā lokasmiṃ pathavīgarahakā pathavījigucchakā, āpagarahakā āpajigucchakā, tejagarahakā tejajigucchakā, vāyagarahakā vāyajigucchakā, bhūtagarahakā bhūtajigucchakā, devagarahakā devajigucchakā, pajāpatigarahakā pajāpatijigucchakā, brahmagarahakā brahmajigucchakā – te kāyassa bhedā pāṇupacchedā hīne kāye patiṭṭhitā ahesuṃ. Ye pana, bhikkhu, tayā pubbe samaṇabrāhmaṇā lokasmiṃ pathavīpasaṃsakā pathavābhinandino, āpapasaṃsakā āpābhinandino, tejapasaṃsakā tejābhinandino, vāyapasaṃsakā ",
      " vāyābhinandino, bhūtapasaṃsakā bhūtābhinandino, devapasaṃsakā devābhinandino, pajāpatipasaṃsakā pajāpatābhinandino, brahmapasaṃsakā brahmābhinandino – te kāyassa bhedā pāṇupacchedā paṇīte kāye patiṭṭhitā. Taṃ tāhaṃ, bhikkhu, evaṃ vadāmi – ‘iṅgha tvaṃ, mārisa, yadeva te brahmā āha tadeva tvaṃ karohi, mā tvaṃ brahmuno vacanaṃ upātivattittho’. Sace kho tvaṃ, bhikkhu, brahmuno vacanaṃ upātivattissasi, seyyathāpi nāma puriso siriṃ āgacchantiṃ daṇḍena paṭippaṇāmeyya, seyyathāpi vā pana, bhikkhu, puriso narakappapāte papatanto hatthehi ca pādehi ca pathaviṃ virādheyya, evaṃ sampadamidaṃ, bhikkhu, tuyhaṃ bhavissati. ‘Iṅghaṃ tvaṃ, mārisa, yadeva te brahmā āha tadeva tvaṃ karohi, mā tvaṃ brahmuno vacanaṃ upātivattittho. Nanu tvaṃ, bhikkhu, passasi brahmaparisaṃ sannipatita’nti? Iti kho maṃ, bhikkhave, māro pāpimā brahmaparisaṃ upanesi."
    ],
    "innerText": "502. ‘‘Atha kho, bhikkhave, māro pāpimā aññataraṃ brahmapārisajjaṃ anvāvisitvā maṃ etadavoca – ‘bhikkhu, bhikkhu, metamāsado metamāsado, eso hi, bhikkhu, brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā [sajjitā (syā. kaṃ. ka.), sañjitā (sī. pī.)] vasī pitā bhūtabhabyānaṃ. Ahesuṃ kho ye, bhikkhu, tayā pubbe samaṇabrāhmaṇā lokasmiṃ pathavīgarahakā pathavījigucchakā, āpagarahakā āpajigucchakā, tejagarahakā tejajigucchakā, vāyagarahakā vāyajigucchakā, bhūtagarahakā bhūtajigucchakā, devagarahakā devajigucchakā, pajāpatigarahakā pajāpatijigucchakā, brahmagarahakā brahmajigucchakā – te kāyassa bhedā pāṇupacchedā hīne kāye patiṭṭhitā ahesuṃ. Ye pana, bhikkhu, tayā pubbe samaṇabrāhmaṇā lokasmiṃ pathavīpasaṃsakā pathavābhinandino, āpapasaṃsakā āpābhinandino, tejapasaṃsakā tejābhinandino, vāyapasaṃsakā vāyābhinandino, bhūtapasaṃsakā bhūtābhinandino, devapasaṃsakā devābhinandino, pajāpatipasaṃsakā pajāpatābhinandino, brahmapasaṃsakā brahmābhinandino – te kāyassa bhedā pāṇupacchedā paṇīte kāye patiṭṭhitā. Taṃ tāhaṃ, bhikkhu, evaṃ vadāmi – ‘iṅgha tvaṃ, mārisa, yadeva te brahmā āha tadeva tvaṃ karohi, mā tvaṃ brahmuno vacanaṃ upātivattittho’. Sace kho tvaṃ, bhikkhu, brahmuno vacanaṃ upātivattissasi, seyyathāpi nāma puriso siriṃ āgacchantiṃ daṇḍena paṭippaṇāmeyya, seyyathāpi vā pana, bhikkhu, puriso narakappapāte papatanto hatthehi ca pādehi ca pathaviṃ virādheyya, evaṃ sampadamidaṃ, bhikkhu, tuyhaṃ bhavissati. ‘Iṅghaṃ tvaṃ, mārisa, yadeva te brahmā āha tadeva tvaṃ karohi, mā tvaṃ brahmuno vacanaṃ upātivattittho. Nanu tvaṃ, bhikkhu, passasi brahmaparisaṃ sannipatita’nti? Iti kho maṃ, bhikkhave, māro pāpimā brahmaparisaṃ upanesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ ",
      " vutte, ahaṃ, bhikkhave, māraṃ pāpimantaṃ etadavocaṃ – ‘jānāmi kho tāhaṃ, pāpima; mā tvaṃ maññittho – na maṃ jānātī’ti. Māro tvamasi, pāpima. Yo ceva, pāpima, brahmā, yā ca brahmaparisā, ye ca brahmapārisajjā, sabbeva tava hatthagatā sabbeva tava vasaṃgatā. Tuyhañhi, pāpima, evaṃ hoti – ‘esopi me assa hatthagato, esopi me assa vasaṃgato’ti. Ahaṃ kho pana, pāpima, neva tava hatthagato neva tava vasaṃgato’’ti."
    ],
    "innerText": "‘‘Evaṃ vutte, ahaṃ, bhikkhave, māraṃ pāpimantaṃ etadavocaṃ – ‘jānāmi kho tāhaṃ, pāpima; mā tvaṃ maññittho – na maṃ jānātī’ti. Māro tvamasi, pāpima. Yo ceva, pāpima, brahmā, yā ca brahmaparisā, ye ca brahmapārisajjā, sabbeva tava hatthagatā sabbeva tava vasaṃgatā. Tuyhañhi, pāpima, evaṃ hoti – ‘esopi me assa hatthagato, esopi me assa vasaṃgato’ti. Ahaṃ kho pana, pāpima, neva tava hatthagato neva tava vasaṃgato’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "503"
      },
      ". ‘‘Evaṃ ",
      " vutte, bhikkhave, bako brahmā maṃ etadavoca – ‘ahañhi, mārisa, niccaṃyeva ",
      " samānaṃ niccanti vadāmi, dhuvaṃyeva ",
      " samānaṃ dhuvanti vadāmi, sassataṃyeva samānaṃ sassatanti vadāmi, kevalaṃyeva samānaṃ kevalanti vadāmi, acavanadhammaṃyeva samānaṃ acavanadhamma’nti vadāmi, yattha ca pana na jāyati na jīyati na mīyati na cavati na upapajjati tadevāhaṃ vadāmi – ‘idañhi na jāyati na jīyati na mīyati na cavati na upapajjatī’ti. Asantañca panaññaṃ uttari nissaraṇaṃ ‘natthaññaṃ uttari nissaraṇa’nti vadāmi. Ahesuṃ kho, bhikkhu, tayā pubbe samaṇabrāhmaṇā lokasmiṃ yāvatakaṃ tuyhaṃ kasiṇaṃ āyu tāvatakaṃ tesaṃ tapokammameva ahosi. Te kho evaṃ jāneyyuṃ – ‘santañca panaññaṃ uttari nissaraṇaṃ atthaññaṃ uttari nissaraṇanti, asantaṃ vā aññaṃ uttari nissaraṇaṃ natthaññaṃ uttari nissaraṇa’nti. Taṃ tāhaṃ, bhikkhu, evaṃ vadāmi – ‘na cevaññaṃ uttari nissaraṇaṃ dakkhissasi, yāvadeva ca pana kilamathassa vighātassa bhāgī bhavissasi. Sace kho tvaṃ, bhikkhu, pathaviṃ ajjhosissasi, opasāyiko me bhavissasi vatthusāyiko, yathākāmakaraṇīyo bāhiteyyo. Sace āpaṃ… tejaṃ… vāyaṃ… bhūte… deve… pajāpatiṃ… brahmaṃ ajjhosissasi, opasāyiko me bhavissasi vatthusāyiko, yathākāmakaraṇīyo bāhiteyyo’ti."
    ],
    "innerText": "503. ‘‘Evaṃ vutte, bhikkhave, bako brahmā maṃ etadavoca – ‘ahañhi, mārisa, niccaṃyeva samānaṃ niccanti vadāmi, dhuvaṃyeva samānaṃ dhuvanti vadāmi, sassataṃyeva samānaṃ sassatanti vadāmi, kevalaṃyeva samānaṃ kevalanti vadāmi, acavanadhammaṃyeva samānaṃ acavanadhamma’nti vadāmi, yattha ca pana na jāyati na jīyati na mīyati na cavati na upapajjati tadevāhaṃ vadāmi – ‘idañhi na jāyati na jīyati na mīyati na cavati na upapajjatī’ti. Asantañca panaññaṃ uttari nissaraṇaṃ ‘natthaññaṃ uttari nissaraṇa’nti vadāmi. Ahesuṃ kho, bhikkhu, tayā pubbe samaṇabrāhmaṇā lokasmiṃ yāvatakaṃ tuyhaṃ kasiṇaṃ āyu tāvatakaṃ tesaṃ tapokammameva ahosi. Te kho evaṃ jāneyyuṃ – ‘santañca panaññaṃ uttari nissaraṇaṃ atthaññaṃ uttari nissaraṇanti, asantaṃ vā aññaṃ uttari nissaraṇaṃ natthaññaṃ uttari nissaraṇa’nti. Taṃ tāhaṃ, bhikkhu, evaṃ vadāmi – ‘na cevaññaṃ uttari nissaraṇaṃ dakkhissasi, yāvadeva ca pana kilamathassa vighātassa bhāgī bhavissasi. Sace kho tvaṃ, bhikkhu, pathaviṃ ajjhosissasi, opasāyiko me bhavissasi vatthusāyiko, yathākāmakaraṇīyo bāhiteyyo. Sace āpaṃ… tejaṃ… vāyaṃ… bhūte… deve… pajāpatiṃ… brahmaṃ ajjhosissasi, opasāyiko me bhavissasi vatthusāyiko, yathākāmakaraṇīyo bāhiteyyo’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahampi kho evaṃ, brahme, jānāmi – sace pathaviṃ ajjhosissāmi, opasāyiko te bhavissāmi vatthusāyiko, yathākāmakaraṇīyo ",
      " bāhiteyyo. ‘Sace āpaṃ… tejaṃ… vāyaṃ… bhūte… deve… pajāpatiṃ… brahmaṃ ajjhosissāmi, opasāyiko te bhavissāmi vatthusāyiko, yathākāmakaraṇīyo bāhiteyyo’ti api ca te ahaṃ, brahme, gatiñca pajānāmi, jutiñca pajānāmi – evaṃ mahiddhiko bako brahmā, evaṃ mahānubhāvo bako brahmā, evaṃ mahesakkho bako brahmā’’ti."
    ],
    "innerText": "‘‘Ahampi kho evaṃ, brahme, jānāmi – sace pathaviṃ ajjhosissāmi, opasāyiko te bhavissāmi vatthusāyiko, yathākāmakaraṇīyo bāhiteyyo. ‘Sace āpaṃ… tejaṃ… vāyaṃ… bhūte… deve… pajāpatiṃ… brahmaṃ ajjhosissāmi, opasāyiko te bhavissāmi vatthusāyiko, yathākāmakaraṇīyo bāhiteyyo’ti api ca te ahaṃ, brahme, gatiñca pajānāmi, jutiñca pajānāmi – evaṃ mahiddhiko bako brahmā, evaṃ mahānubhāvo bako brahmā, evaṃ mahesakkho bako brahmā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yathākathaṃ ",
      " pana me tvaṃ, mārisa, gatiñca pajānāsi, jutiñca pajānāsi – ‘evaṃ mahiddhiko bako brahmā, evaṃ mahānubhāvo bako brahmā, evaṃ mahesakkho bako brahmā’ti?"
    ],
    "innerText": "‘‘Yathākathaṃ pana me tvaṃ, mārisa, gatiñca pajānāsi, jutiñca pajānāsi – ‘evaṃ mahiddhiko bako brahmā, evaṃ mahānubhāvo bako brahmā, evaṃ mahesakkho bako brahmā’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yāvatā candimasūriyā, pariharanti disā bhanti virocanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Tāva sahassadhā loko, ettha te vattate ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vattatī (sī. syā. kaṃ. pī.)]"
      },
      " vaso."
    ],
    "innerText": "Tāva sahassadhā loko, ettha te vattate [vattatī (sī. syā. kaṃ. pī.)] vaso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Paroparañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[parovarañca (sī. pī.)]"
      },
      " jānāsi, atho rāgavirāginaṃ;"
    ],
    "innerText": "‘‘Paroparañca [parovarañca (sī. pī.)] jānāsi, atho rāgavirāginaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Itthabhāvaññathābhāvaṃ, sattānaṃ āgatiṃ gati’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ kho te ahaṃ, brahme, gatiñca pajānāmi jutiñca pajānāmi – ‘evaṃ mahiddhiko bako brahmā, evaṃ mahānubhāvo bako ",
      " brahmā, evaṃ mahesakkho bako brahmā’ti."
    ],
    "innerText": "‘‘Evaṃ kho te ahaṃ, brahme, gatiñca pajānāmi jutiñca pajānāmi – ‘evaṃ mahiddhiko bako brahmā, evaṃ mahānubhāvo bako brahmā, evaṃ mahesakkho bako brahmā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "504"
      },
      ". ‘‘Atthi kho, brahme, añño kāyo, taṃ tvaṃ na jānāsi na passasi; tamahaṃ jānāmi passāmi. Atthi kho, brahme, ābhassarā nāma kāyo yato tvaṃ cuto idhūpapanno. Tassa te aticiranivāsena sā sati pamuṭṭhā, tena taṃ tvaṃ na jānāsi na passasi; tamahaṃ jānāmi passāmi. Evampi kho ahaṃ, brahme, neva te samasamo abhiññāya, kuto nīceyyaṃ? Atha ",
      " kho ahameva tayā bhiyyo. Atthi kho, brahme, subhakiṇho nāma kāyo, vehapphalo nāma kāyo, abhibhū nāma kāyo, taṃ tvaṃ na jānāsi na passasi; tamahaṃ jānāmi passāmi. Evampi kho ahaṃ, brahme, neva te samasamo abhiññāya, kuto nīceyyaṃ? Atha kho ahameva tayā bhiyyo. Pathaviṃ kho ahaṃ, brahme, pathavito abhiññāya yāvatā pathaviyā pathavattena ananubhūtaṃ tadabhiññāya pathaviṃ nāpahosiṃ, pathaviyā nāpahosiṃ, pathavito nāpahosiṃ, pathaviṃ meti nāpahosiṃ, pathaviṃ nābhivadiṃ. Evampi kho ahaṃ, brahme, neva te samasamo abhiññāya, kuto nīceyyaṃ? Atha kho ahameva tayā bhiyyo. Āpaṃ kho ahaṃ, brahme…pe… tejaṃ kho ahaṃ, brahme…pe… vāyaṃ kho ahaṃ, brahme…pe… bhūte kho ahaṃ, brahme…pe… deve kho ahaṃ, brahme…pe… pajāpatiṃ kho ahaṃ, brahme…pe… brahmaṃ kho ahaṃ, brahme…pe… ābhassare kho ahaṃ, brahme…pe… subhakiṇhe kho ahaṃ, brahme… ",
      " …pe… vehapphale kho ahaṃ, brahme…pe… abhibhuṃ kho ahaṃ, brahme…pe… sabbaṃ kho ahaṃ, brahme, sabbato abhiññāya yāvatā sabbassa sabbattena ananubhūtaṃ tadabhiññāya sabbaṃ nāpahosiṃ sabbasmiṃ nāpahosiṃ sabbato nāpahosiṃ sabbaṃ meti nāpahosiṃ, sabbaṃ nābhivadiṃ. Evampi kho ahaṃ, brahme, neva te samasamo abhiññāya, kuto nīceyyaṃ? Atha kho ahameva tayā bhiyyo’’ti."
    ],
    "innerText": "504. ‘‘Atthi kho, brahme, añño kāyo, taṃ tvaṃ na jānāsi na passasi; tamahaṃ jānāmi passāmi. Atthi kho, brahme, ābhassarā nāma kāyo yato tvaṃ cuto idhūpapanno. Tassa te aticiranivāsena sā sati pamuṭṭhā, tena taṃ tvaṃ na jānāsi na passasi; tamahaṃ jānāmi passāmi. Evampi kho ahaṃ, brahme, neva te samasamo abhiññāya, kuto nīceyyaṃ? Atha kho ahameva tayā bhiyyo. Atthi kho, brahme, subhakiṇho nāma kāyo, vehapphalo nāma kāyo, abhibhū nāma kāyo, taṃ tvaṃ na jānāsi na passasi; tamahaṃ jānāmi passāmi. Evampi kho ahaṃ, brahme, neva te samasamo abhiññāya, kuto nīceyyaṃ? Atha kho ahameva tayā bhiyyo. Pathaviṃ kho ahaṃ, brahme, pathavito abhiññāya yāvatā pathaviyā pathavattena ananubhūtaṃ tadabhiññāya pathaviṃ nāpahosiṃ, pathaviyā nāpahosiṃ, pathavito nāpahosiṃ, pathaviṃ meti nāpahosiṃ, pathaviṃ nābhivadiṃ. Evampi kho ahaṃ, brahme, neva te samasamo abhiññāya, kuto nīceyyaṃ? Atha kho ahameva tayā bhiyyo. Āpaṃ kho ahaṃ, brahme…pe… tejaṃ kho ahaṃ, brahme…pe… vāyaṃ kho ahaṃ, brahme…pe… bhūte kho ahaṃ, brahme…pe… deve kho ahaṃ, brahme…pe… pajāpatiṃ kho ahaṃ, brahme…pe… brahmaṃ kho ahaṃ, brahme…pe… ābhassare kho ahaṃ, brahme…pe… subhakiṇhe kho ahaṃ, brahme… …pe… vehapphale kho ahaṃ, brahme…pe… abhibhuṃ kho ahaṃ, brahme…pe… sabbaṃ kho ahaṃ, brahme, sabbato abhiññāya yāvatā sabbassa sabbattena ananubhūtaṃ tadabhiññāya sabbaṃ nāpahosiṃ sabbasmiṃ nāpahosiṃ sabbato nāpahosiṃ sabbaṃ meti nāpahosiṃ, sabbaṃ nābhivadiṃ. Evampi kho ahaṃ, brahme, neva te samasamo abhiññāya, kuto nīceyyaṃ? Atha kho ahameva tayā bhiyyo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace ",
      " kho, mārisa, sabbassa sabbattena ananubhūtaṃ, tadabhiññāya mā heva te rittakameva ahosi, tucchakameva ahosī’’ti ",
      "."
    ],
    "innerText": "‘‘Sace kho, mārisa, sabbassa sabbattena ananubhūtaṃ, tadabhiññāya mā heva te rittakameva ahosi, tucchakameva ahosī’’ti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Viññāṇaṃ anidassanaṃ anantaṃ sabbato pabhaṃ’, taṃ pathaviyā pathavattena ananubhūtaṃ, āpassa āpattena ananubhūtaṃ, tejassa tejattena ananubhūtaṃ, vāyassa vāyattena ananubhūtaṃ, bhūtānaṃ bhūtattena ananubhūtaṃ, devānaṃ devattena ananubhūtaṃ, pajāpatissa pajāpatittena ananubhūtaṃ, brahmānaṃ brahmattena ananubhūtaṃ, ābhassarānaṃ ābhassarattena ananubhūtaṃ, subhakiṇhānaṃ subhakiṇhattena ananubhūtaṃ, vehapphalānaṃ vehapphalatte ",
      " ananubhūtaṃ, abhibhussa abhibhuttena ananubhūtaṃ, sabbassa sabbattena ananubhūtaṃ’’."
    ],
    "innerText": "‘‘‘Viññāṇaṃ anidassanaṃ anantaṃ sabbato pabhaṃ’, taṃ pathaviyā pathavattena ananubhūtaṃ, āpassa āpattena ananubhūtaṃ, tejassa tejattena ananubhūtaṃ, vāyassa vāyattena ananubhūtaṃ, bhūtānaṃ bhūtattena ananubhūtaṃ, devānaṃ devattena ananubhūtaṃ, pajāpatissa pajāpatittena ananubhūtaṃ, brahmānaṃ brahmattena ananubhūtaṃ, ābhassarānaṃ ābhassarattena ananubhūtaṃ, subhakiṇhānaṃ subhakiṇhattena ananubhūtaṃ, vehapphalānaṃ vehapphalatte ananubhūtaṃ, abhibhussa abhibhuttena ananubhūtaṃ, sabbassa sabbattena ananubhūtaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Handa carahi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[handa ca hi (sī. pī.)]"
      },
      " te, mārisa, passa antaradhāyāmī’’ti. ‘Handa carahi me tvaṃ, brahme, antaradhāyassu, sace visahasī’ti. Atha kho, bhikkhave, bako brahmā ‘antaradhāyissāmi samaṇassa gotamassa, antaradhāyissāmi samaṇassa gotamassā’ti nevassu me sakkoti antaradhāyituṃ."
    ],
    "innerText": "‘‘Handa carahi [handa ca hi (sī. pī.)] te, mārisa, passa antaradhāyāmī’’ti. ‘Handa carahi me tvaṃ, brahme, antaradhāyassu, sace visahasī’ti. Atha kho, bhikkhave, bako brahmā ‘antaradhāyissāmi samaṇassa gotamassa, antaradhāyissāmi samaṇassa gotamassā’ti nevassu me sakkoti antaradhāyituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ vutte, ahaṃ, bhikkhave, bakaṃ brahmānaṃ etadavocaṃ – ‘handa carahi te brahme antaradhāyāmī’ti. ‘Handa carahi me tvaṃ, mārisa, antaradhāyassu sace visahasī’ti. Atha kho ahaṃ, bhikkhave, tathārūpaṃ iddhābhisaṅkhāraṃ abhisaṅkhāsiṃ – ‘ettāvatā brahmā ca brahmaparisā ca brahmapārisajjā ca saddañca me sossanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saddameva suyyanti (ka.)]"
      },
      ", na ca maṃ dakkhantī’ti. Antarahito imaṃ gāthaṃ abhāsiṃ –"
    ],
    "innerText": "‘‘Evaṃ vutte, ahaṃ, bhikkhave, bakaṃ brahmānaṃ etadavocaṃ – ‘handa carahi te brahme antaradhāyāmī’ti. ‘Handa carahi me tvaṃ, mārisa, antaradhāyassu sace visahasī’ti. Atha kho ahaṃ, bhikkhave, tathārūpaṃ iddhābhisaṅkhāraṃ abhisaṅkhāsiṃ – ‘ettāvatā brahmā ca brahmaparisā ca brahmapārisajjā ca saddañca me sossanti [saddameva suyyanti (ka.)], na ca maṃ dakkhantī’ti. Antarahito imaṃ gāthaṃ abhāsiṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Bhavevāhaṃ bhayaṃ disvā, bhavañca vibhavesinaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhavaṃ nābhivadiṃ kiñci, nandiñca na upādiyi’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha ",
      " kho, bhikkhave, brahmā ca brahmaparisā ca brahmapārisajjā ca acchariyabbhutacittajātā ahesuṃ – ‘acchariyaṃ vata bho, abbhutaṃ vata bho! Samaṇassa gotamassa mahiddhikatā mahānubhāvatā, na ca vata no ito pubbe diṭṭho vā, suto vā, añño ",
      " samaṇo vā brāhmaṇo vā evaṃ mahiddhiko evaṃ mahānubhāvo yathāyaṃ samaṇo gotamo sakyaputto sakyakulā pabbajito. Bhavarāmāya vata, bho, pajāya bhavaratāya bhavasammuditāya samūlaṃ bhavaṃ udabbahī’ti."
    ],
    "innerText": "‘‘Atha kho, bhikkhave, brahmā ca brahmaparisā ca brahmapārisajjā ca acchariyabbhutacittajātā ahesuṃ – ‘acchariyaṃ vata bho, abbhutaṃ vata bho! Samaṇassa gotamassa mahiddhikatā mahānubhāvatā, na ca vata no ito pubbe diṭṭho vā, suto vā, añño samaṇo vā brāhmaṇo vā evaṃ mahiddhiko evaṃ mahānubhāvo yathāyaṃ samaṇo gotamo sakyaputto sakyakulā pabbajito. Bhavarāmāya vata, bho, pajāya bhavaratāya bhavasammuditāya samūlaṃ bhavaṃ udabbahī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "505"
      },
      ". ‘‘Atha kho, bhikkhave, māro pāpimā aññataraṃ brahmapārisajjaṃ anvāvisitvā maṃ etadavoca – ‘sace kho tvaṃ, mārisa, evaṃ pajānāsi, sace tvaṃ evaṃ anubuddho, mā sāvake upanesi, mā pabbajite; mā sāvakānaṃ dhammaṃ desesi, mā pabbajitānaṃ; mā sāvakesu gedhimakāsi, mā pabbajitesu. Ahesuṃ kho, bhikkhu, tayā pubbe samaṇabrāhmaṇā lokasmiṃ arahanto sammāsambuddhā paṭijānamānā ",
      ". Te sāvake upanesuṃ pabbajite, sāvakānaṃ dhammaṃ desesuṃ pabbajitānaṃ, sāvakesu gedhimakaṃsu pabbajitesu, te sāvake upanetvā pabbajite, sāvakānaṃ dhammaṃ desetvā pabbajitānaṃ, sāvakesu gedhitacittā pabbajitesu, kāyassa bhedā pāṇupacchedā hīne kāye patiṭṭhitā. Ahesuṃ ye pana, bhikkhu, tayā pubbe samaṇabrāhmaṇā lokasmiṃ arahanto sammāsambuddhā paṭijānamānā. Te na sāvake upanesuṃ na pabbajite, na sāvakānaṃ dhammaṃ desesuṃ na pabbajitānaṃ, na sāvakesu ",
      " gedhimakaṃsu na pabbajitesu, te na sāvake upanetvā na pabbajite, na sāvakānaṃ dhammaṃ desetvā na pabbajitānaṃ, na sāvakesu gedhitacittā na pabbajitesu, kāyassa bhedā pāṇupacchedā paṇīte kāye patiṭṭhitā. Taṃ tāhaṃ, bhikkhu, evaṃ vadāmi – iṅgha tvaṃ, mārisa, appossukko diṭṭhadhammasukhavihāramanuyutto viharassu, anakkhātaṃ kusalañhi, mārisa, mā paraṃ ovadāhī’ti."
    ],
    "innerText": "505. ‘‘Atha kho, bhikkhave, māro pāpimā aññataraṃ brahmapārisajjaṃ anvāvisitvā maṃ etadavoca – ‘sace kho tvaṃ, mārisa, evaṃ pajānāsi, sace tvaṃ evaṃ anubuddho, mā sāvake upanesi, mā pabbajite; mā sāvakānaṃ dhammaṃ desesi, mā pabbajitānaṃ; mā sāvakesu gedhimakāsi, mā pabbajitesu. Ahesuṃ kho, bhikkhu, tayā pubbe samaṇabrāhmaṇā lokasmiṃ arahanto sammāsambuddhā paṭijānamānā . Te sāvake upanesuṃ pabbajite, sāvakānaṃ dhammaṃ desesuṃ pabbajitānaṃ, sāvakesu gedhimakaṃsu pabbajitesu, te sāvake upanetvā pabbajite, sāvakānaṃ dhammaṃ desetvā pabbajitānaṃ, sāvakesu gedhitacittā pabbajitesu, kāyassa bhedā pāṇupacchedā hīne kāye patiṭṭhitā. Ahesuṃ ye pana, bhikkhu, tayā pubbe samaṇabrāhmaṇā lokasmiṃ arahanto sammāsambuddhā paṭijānamānā. Te na sāvake upanesuṃ na pabbajite, na sāvakānaṃ dhammaṃ desesuṃ na pabbajitānaṃ, na sāvakesu gedhimakaṃsu na pabbajitesu, te na sāvake upanetvā na pabbajite, na sāvakānaṃ dhammaṃ desetvā na pabbajitānaṃ, na sāvakesu gedhitacittā na pabbajitesu, kāyassa bhedā pāṇupacchedā paṇīte kāye patiṭṭhitā. Taṃ tāhaṃ, bhikkhu, evaṃ vadāmi – iṅgha tvaṃ, mārisa, appossukko diṭṭhadhammasukhavihāramanuyutto viharassu, anakkhātaṃ kusalañhi, mārisa, mā paraṃ ovadāhī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ vutte, ahaṃ, bhikkhave, māraṃ pāpimantaṃ etadavocaṃ – ‘jānāmi kho tāhaṃ, pāpima, mā tvaṃ maññittho – na maṃ jānātī’ti. Māro tvamasi, pāpima. Na maṃ tvaṃ, pāpima, hitānukampī evaṃ vadesi; ahitānukampī maṃ tvaṃ, pāpima, evaṃ vadesi. Tuyhañhi, pāpima, evaṃ hoti – ‘yesaṃ samaṇo gotamo dhammaṃ desessati, te me visayaṃ upātivattissantī’ti. Asammāsambuddhāva pana te ",
      ", pāpima, samānā sammāsambuddhāmhāti paṭijāniṃsu. Ahaṃ kho pana, pāpima, sammāsambuddhova samāno sammāsambuddhomhīti paṭijānāmi. Desentopi hi, pāpima, tathāgato sāvakānaṃ dhammaṃ tādisova adesentopi hi, pāpima, tathāgato sāvakānaṃ dhammaṃ tādisova. Upanentopi hi, pāpima, tathāgato sāvake ",
      " tādisova, anupanentopi hi, pāpima, tathāgato sāvake tādisova. Taṃ kissa hetu? Tathāgatassa, pāpima, ye āsavā saṃkilesikā ponobbhavikā sadarā dukkhavipākā āyatiṃ jātijarāmaraṇiyā – te pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ ",
      " anuppādadhammā. Seyyathāpi, pāpima, tālo matthakacchinno abhabbo puna virūḷhiyā; evameva kho, pāpima, tathāgatassa ye āsavā saṃkilesikā ponobbhavikā sadarā dukkhavipākā āyatiṃ jātijarāmaraṇiyā – te pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammāti."
    ],
    "innerText": "‘‘Evaṃ vutte, ahaṃ, bhikkhave, māraṃ pāpimantaṃ etadavocaṃ – ‘jānāmi kho tāhaṃ, pāpima, mā tvaṃ maññittho – na maṃ jānātī’ti. Māro tvamasi, pāpima. Na maṃ tvaṃ, pāpima, hitānukampī evaṃ vadesi; ahitānukampī maṃ tvaṃ, pāpima, evaṃ vadesi. Tuyhañhi, pāpima, evaṃ hoti – ‘yesaṃ samaṇo gotamo dhammaṃ desessati, te me visayaṃ upātivattissantī’ti. Asammāsambuddhāva pana te , pāpima, samānā sammāsambuddhāmhāti paṭijāniṃsu. Ahaṃ kho pana, pāpima, sammāsambuddhova samāno sammāsambuddhomhīti paṭijānāmi. Desentopi hi, pāpima, tathāgato sāvakānaṃ dhammaṃ tādisova adesentopi hi, pāpima, tathāgato sāvakānaṃ dhammaṃ tādisova. Upanentopi hi, pāpima, tathāgato sāvake tādisova, anupanentopi hi, pāpima, tathāgato sāvake tādisova. Taṃ kissa hetu? Tathāgatassa, pāpima, ye āsavā saṃkilesikā ponobbhavikā sadarā dukkhavipākā āyatiṃ jātijarāmaraṇiyā – te pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Seyyathāpi, pāpima, tālo matthakacchinno abhabbo puna virūḷhiyā; evameva kho, pāpima, tathāgatassa ye āsavā saṃkilesikā ponobbhavikā sadarā dukkhavipākā āyatiṃ jātijarāmaraṇiyā – te pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Iti hidaṃ mārassa ca anālapanatāya brahmuno ca abhinimantanatāya, tasmā imassa veyyākaraṇassa brahmanimantanikaṃteva adhivacana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Brahmanimantanikasuttaṃ niṭṭhitaṃ navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Māratajjanīyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "506"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ āyasmā mahāmoggallāno bhaggesu viharati susumāragire bhesakaḷāvane migadāye. Tena kho pana samayena āyasmā mahāmoggallāno abbhokāse caṅkamati. Tena kho pana samayena māro pāpimā āyasmato mahāmoggallānassa kucchigato hoti koṭṭhamanupaviṭṭho. Atha kho āyasmato mahāmoggallānassa etadahosi – ‘‘kiṃ nu kho me kucchi garugaro viya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[garu garu viya (sī. pī. ṭīkāyaṃ pāṭhantaraṃ)]"
      },
      "? Māsācitaṃ maññe’’ti. Atha kho āyasmā mahāmoggallāno caṅkamā orohitvā vihāraṃ pavisitvā paññatte āsane nisīdi. Nisajja kho āyasmā mahāmoggallāno paccattaṃ yoniso manasākāsi. Addasā kho āyasmā mahāmoggallāno māraṃ pāpimantaṃ kucchigataṃ koṭṭhamanupaviṭṭhaṃ. Disvāna ",
      " māraṃ pāpimantaṃ etadavoca – ‘‘nikkhama, pāpima; nikkhama, pāpima! Mā tathāgataṃ vihesesi, mā tathāgatasāvakaṃ. Mā te ahosi dīgharattaṃ ahitāya dukkhāyā’’ti. Atha kho mārassa pāpimato etadahosi – ‘‘ajānameva kho maṃ ayaṃ samaṇo apassaṃ evamāha – ‘nikkhama, pāpima; nikkhama, pāpima! Mā tathāgataṃ vihesesi, mā tathāgatasāvakaṃ. Mā te ahosi dīgharattaṃ ahitāya dukkhāyā’ti. Yopissa so satthā sopi maṃ neva khippaṃ jāneyya, kuto pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kuto ca pana (syā.)]"
      },
      " maṃ ayaṃ sāvako jānissatī’’ti? Atha kho āyasmā mahāmoggallāno ",
      " māraṃ pāpimantaṃ etadavoca – ‘‘evampi kho tāhaṃ, pāpima, jānāmi, mā tvaṃ maññittho – ‘na maṃ jānātī’ti. Māro tvamasi, pāpima; tuyhañhi, pāpima, evaṃ hoti – ‘ajānameva kho maṃ ayaṃ samaṇo apassaṃ evamāha – nikkhama, pāpima; nikkhama, pāpima! Mā tathāgataṃ vihesesi, mā tathāgatasāvakaṃ. Mā te ahosi dīgharattaṃ ahitāya dukkhāyāti. Yopissa so satthā sopi maṃ neva khippaṃ jāneyya, kuto pana maṃ ayaṃ sāvako jānissatī’’’ti?"
    ],
    "innerText": "506. Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā mahāmoggallāno bhaggesu viharati susumāragire bhesakaḷāvane migadāye. Tena kho pana samayena āyasmā mahāmoggallāno abbhokāse caṅkamati. Tena kho pana samayena māro pāpimā āyasmato mahāmoggallānassa kucchigato hoti koṭṭhamanupaviṭṭho. Atha kho āyasmato mahāmoggallānassa etadahosi – ‘‘kiṃ nu kho me kucchi garugaro viya [garu garu viya (sī. pī. ṭīkāyaṃ pāṭhantaraṃ)]? Māsācitaṃ maññe’’ti. Atha kho āyasmā mahāmoggallāno caṅkamā orohitvā vihāraṃ pavisitvā paññatte āsane nisīdi. Nisajja kho āyasmā mahāmoggallāno paccattaṃ yoniso manasākāsi. Addasā kho āyasmā mahāmoggallāno māraṃ pāpimantaṃ kucchigataṃ koṭṭhamanupaviṭṭhaṃ. Disvāna māraṃ pāpimantaṃ etadavoca – ‘‘nikkhama, pāpima; nikkhama, pāpima! Mā tathāgataṃ vihesesi, mā tathāgatasāvakaṃ. Mā te ahosi dīgharattaṃ ahitāya dukkhāyā’’ti. Atha kho mārassa pāpimato etadahosi – ‘‘ajānameva kho maṃ ayaṃ samaṇo apassaṃ evamāha – ‘nikkhama, pāpima; nikkhama, pāpima! Mā tathāgataṃ vihesesi, mā tathāgatasāvakaṃ. Mā te ahosi dīgharattaṃ ahitāya dukkhāyā’ti. Yopissa so satthā sopi maṃ neva khippaṃ jāneyya, kuto pana [kuto ca pana (syā.)] maṃ ayaṃ sāvako jānissatī’’ti? Atha kho āyasmā mahāmoggallāno māraṃ pāpimantaṃ etadavoca – ‘‘evampi kho tāhaṃ, pāpima, jānāmi, mā tvaṃ maññittho – ‘na maṃ jānātī’ti. Māro tvamasi, pāpima; tuyhañhi, pāpima, evaṃ hoti – ‘ajānameva kho maṃ ayaṃ samaṇo apassaṃ evamāha – nikkhama, pāpima; nikkhama, pāpima! Mā tathāgataṃ vihesesi, mā tathāgatasāvakaṃ. Mā te ahosi dīgharattaṃ ahitāya dukkhāyāti. Yopissa so satthā sopi maṃ neva khippaṃ jāneyya, kuto pana maṃ ayaṃ sāvako jānissatī’’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho mārassa pāpimato etadahosi – ‘‘jāname kho maṃ ayaṃ samaṇo passaṃ evamāha – ‘nikkhama, pāpima; nikkhama, pāpima! Mā tathāgataṃ vihesesi, mā tathāgatasāvakaṃ. Mā te ahosi dīgharattaṃ ahitāya dukkhāyā’’’ti. Atha kho māro pāpimā āyasmato ",
      " mahāmoggallānassa mukhato uggantvā paccaggaḷe aṭṭhāsi."
    ],
    "innerText": "Atha kho mārassa pāpimato etadahosi – ‘‘jāname kho maṃ ayaṃ samaṇo passaṃ evamāha – ‘nikkhama, pāpima; nikkhama, pāpima! Mā tathāgataṃ vihesesi, mā tathāgatasāvakaṃ. Mā te ahosi dīgharattaṃ ahitāya dukkhāyā’’’ti. Atha kho māro pāpimā āyasmato mahāmoggallānassa mukhato uggantvā paccaggaḷe aṭṭhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "507"
      },
      ". Addasā ",
      " kho āyasmā mahāmoggallāno māraṃ pāpimantaṃ paccaggaḷe ṭhitaṃ; disvāna māraṃ pāpimantaṃ etadavoca – ‘etthāpi kho tāhaṃ, pāpima, passāmi; mā tvaṃ maññittho ‘‘na maṃ passatī’’ti. Eso tvaṃ, pāpima, paccaggaḷe ṭhito. Bhūtapubbāhaṃ, pāpima, dūsī nāma māro ahosiṃ, tassa me kāḷī nāma bhaginī. Tassā tvaṃ putto. So me tvaṃ bhāgineyyo ahosi. Tena kho pana, pāpima, samayena kakusandho bhagavā arahaṃ sammāsambuddho loke uppanno hoti. Kakusandhassa kho pana, pāpima, bhagavato arahato ",
      " sammāsambuddhassa vidhurasañjīvaṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Yāvatā kho pana, pāpima, kakusandhassa bhagavato ",
      " arahato sammāsambuddhassa sāvakā. Tesu na ca koci āyasmatā vidhurena samasamo hoti yadidaṃ dhammadesanāya. Iminā kho evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[etaṃ (sī. syā. pī.)]"
      },
      ", pāpima, pariyāyena āyasmato vidhurassa vidhuroteva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vidhurassa vidhuro vidhurotveva (sī. syā. kaṃ. pī.)]"
      },
      " samaññā udapādi."
    ],
    "innerText": "507. Addasā kho āyasmā mahāmoggallāno māraṃ pāpimantaṃ paccaggaḷe ṭhitaṃ; disvāna māraṃ pāpimantaṃ etadavoca – ‘etthāpi kho tāhaṃ, pāpima, passāmi; mā tvaṃ maññittho ‘‘na maṃ passatī’’ti. Eso tvaṃ, pāpima, paccaggaḷe ṭhito. Bhūtapubbāhaṃ, pāpima, dūsī nāma māro ahosiṃ, tassa me kāḷī nāma bhaginī. Tassā tvaṃ putto. So me tvaṃ bhāgineyyo ahosi. Tena kho pana, pāpima, samayena kakusandho bhagavā arahaṃ sammāsambuddho loke uppanno hoti. Kakusandhassa kho pana, pāpima, bhagavato arahato sammāsambuddhassa vidhurasañjīvaṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Yāvatā kho pana, pāpima, kakusandhassa bhagavato arahato sammāsambuddhassa sāvakā. Tesu na ca koci āyasmatā vidhurena samasamo hoti yadidaṃ dhammadesanāya. Iminā kho evaṃ [etaṃ (sī. syā. pī.)], pāpima, pariyāyena āyasmato vidhurassa vidhuroteva [vidhurassa vidhuro vidhurotveva (sī. syā. kaṃ. pī.)] samaññā udapādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Āyasmā pana, pāpima, sañjīvo araññagatopi rukkhamūlagatopi suññāgāragatopi appakasireneva saññāvedayitanirodhaṃ samāpajjati. Bhūtapubbaṃ, pāpima, āyasmā sañjīvo aññatarasmiṃ rukkhamūle saññāvedayitanirodhaṃ samāpanno nisinno hoti. Addasaṃsu kho, pāpima, gopālakā pasupālakā kassakā pathāvino āyasmantaṃ sañjīvaṃ aññatarasmiṃ rukkhamūle saññāvedayitanirodhaṃ samāpannaṃ nisinnaṃ; disvāna tesaṃ etadahosi – ‘acchariyaṃ vata, bho, abbhutaṃ vata, bho! Ayaṃ samaṇo nisinnakova kālaṅkato! Handa naṃ dahāmā’ti. Atha kho te, pāpima, gopālakā pasupālakā kassakā pathāvino tiṇañca kaṭṭhañca gomayañca saṃkaḍḍhitvā āyasmato sañjīvassa kāye upacinitvā aggiṃ datvā pakkamiṃsu. Atha kho, pāpima, āyasmā sañjīvo tassā rattiyā accayena tāya samāpattiyā vuṭṭhahitvā cīvarāni papphoṭetvā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya gāmaṃ piṇḍāya pāvisi. Addasaṃsu kho te, pāpima, gopālakā pasupālakā kassakā pathāvino āyasmantaṃ sañjīvaṃ piṇḍāya carantaṃ; disvāna nesaṃ ",
      " etadahosi – ‘acchariyaṃ vata, bho, abbhutaṃ vata, bho! Ayaṃ samaṇo nisinnakova kālaṅkato, svāyaṃ paṭisañjīvito’ti ",
      ". Iminā kho evaṃ, pāpima, pariyāyena āyasmato sañjīvassa sañjīvoteva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sañjīvo sañjīvotveva (sī. syā. kaṃ. pī.)]"
      },
      " samaññā udapādi."
    ],
    "innerText": "‘‘Āyasmā pana, pāpima, sañjīvo araññagatopi rukkhamūlagatopi suññāgāragatopi appakasireneva saññāvedayitanirodhaṃ samāpajjati. Bhūtapubbaṃ, pāpima, āyasmā sañjīvo aññatarasmiṃ rukkhamūle saññāvedayitanirodhaṃ samāpanno nisinno hoti. Addasaṃsu kho, pāpima, gopālakā pasupālakā kassakā pathāvino āyasmantaṃ sañjīvaṃ aññatarasmiṃ rukkhamūle saññāvedayitanirodhaṃ samāpannaṃ nisinnaṃ; disvāna tesaṃ etadahosi – ‘acchariyaṃ vata, bho, abbhutaṃ vata, bho! Ayaṃ samaṇo nisinnakova kālaṅkato! Handa naṃ dahāmā’ti. Atha kho te, pāpima, gopālakā pasupālakā kassakā pathāvino tiṇañca kaṭṭhañca gomayañca saṃkaḍḍhitvā āyasmato sañjīvassa kāye upacinitvā aggiṃ datvā pakkamiṃsu. Atha kho, pāpima, āyasmā sañjīvo tassā rattiyā accayena tāya samāpattiyā vuṭṭhahitvā cīvarāni papphoṭetvā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya gāmaṃ piṇḍāya pāvisi. Addasaṃsu kho te, pāpima, gopālakā pasupālakā kassakā pathāvino āyasmantaṃ sañjīvaṃ piṇḍāya carantaṃ; disvāna nesaṃ etadahosi – ‘acchariyaṃ vata, bho, abbhutaṃ vata, bho! Ayaṃ samaṇo nisinnakova kālaṅkato, svāyaṃ paṭisañjīvito’ti . Iminā kho evaṃ, pāpima, pariyāyena āyasmato sañjīvassa sañjīvoteva [sañjīvo sañjīvotveva (sī. syā. kaṃ. pī.)] samaññā udapādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "508"
      },
      ". ‘‘Atha kho, pāpima, dūsissa mārassa etadahosi – ‘imesaṃ kho ahaṃ bhikkhūnaṃ sīlavantānaṃ kalyāṇadhammānaṃ neva jānāmi āgatiṃ vā gatiṃ vā. Yaṃnūnāhaṃ brāhmaṇagahapatike anvāviseyyaṃ ",
      " – etha, tumhe bhikkhū sīlavante kalyāṇadhamme akkosatha paribhāsatha rosetha vihesetha. Appeva nāma tumhehi akkosiyamānānaṃ paribhāsiyamānānaṃ rosiyamānānaṃ vihesiyamānānaṃ siyā cittassa aññathattaṃ, yathā taṃ dūsī ",
      " māro labhetha otāra’nti. Atha kho te, pāpima, dūsī māro brāhmaṇagahapatike anvāvisi – ‘etha, tumhe bhikkhū sīlavante kalyāṇadhamme akkosatha paribhāsatha rosetha vihesetha. Appeva nāma tumhehi akkosiyamānānaṃ paribhāsiyamānānaṃ rosiyamānānaṃ vihesiyamānānaṃ siyā cittassa aññathattaṃ, yathā taṃ dūsī māro labhetha otāra’nti."
    ],
    "innerText": "508. ‘‘Atha kho, pāpima, dūsissa mārassa etadahosi – ‘imesaṃ kho ahaṃ bhikkhūnaṃ sīlavantānaṃ kalyāṇadhammānaṃ neva jānāmi āgatiṃ vā gatiṃ vā. Yaṃnūnāhaṃ brāhmaṇagahapatike anvāviseyyaṃ – etha, tumhe bhikkhū sīlavante kalyāṇadhamme akkosatha paribhāsatha rosetha vihesetha. Appeva nāma tumhehi akkosiyamānānaṃ paribhāsiyamānānaṃ rosiyamānānaṃ vihesiyamānānaṃ siyā cittassa aññathattaṃ, yathā taṃ dūsī māro labhetha otāra’nti. Atha kho te, pāpima, dūsī māro brāhmaṇagahapatike anvāvisi – ‘etha, tumhe bhikkhū sīlavante kalyāṇadhamme akkosatha paribhāsatha rosetha vihesetha. Appeva nāma tumhehi akkosiyamānānaṃ paribhāsiyamānānaṃ rosiyamānānaṃ vihesiyamānānaṃ siyā cittassa aññathattaṃ, yathā taṃ dūsī māro labhetha otāra’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha kho te, pāpima, brāhmaṇagahapatikā anvāvisiṭṭhā dūsinā mārena bhikkhū sīlavante kalyāṇadhamme akkosanti paribhāsanti rosenti vihesenti – ‘ime pana muṇḍakā samaṇakā ibbhā kiṇhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kaṇhā (syā. kaṃ. ka.)]"
      },
      " bandhupādāpaccā ‘‘jhāyinosmā jhāyinosmā’’ti pattakkhandhā adhomukhā madhurakajātā jhāyanti pajjhāyanti nijjhāyanti apajjhāyanti. Seyyathāpi nāma ulūko ",
      " rukkhasākhāyaṃ mūsikaṃ maggayamāno jhāyati pajjhāyati nijjhāyati apajjhāyati; evamevime muṇḍakā samaṇakā ibbhā kiṇhā bandhupādāpaccā ‘‘jhāyinosmā jhāyinosmā’’ti pattakkhandhā adhomukhā madhurakajātā jhāyanti pajjhāyanti nijjhāyanti apajjhāyanti. Seyyathāpi nāma kotthu nadītīre macche maggayamāno jhāyati pajjhāyati nijjhāyati apajjhāyati; evamevime muṇḍakā samaṇakā ibbhā kiṇhā bandhupādāpaccā ‘‘jhāyinosmā jhāyinosmā’’ti pattakkhandhā adhomukhā madhurakajātā jhāyanti pajjhāyanti nijjhāyanti apajjhāyanti. Seyyathāpi nāma biḷāro sandhisamalasaṅkaṭīre mūsikaṃ maggayamāno jhāyati pajjhāyati nijjhāyati apajjhāyati; evamevime muṇḍakā samaṇakā ibbhā kiṇhā bandhupādāpaccā ‘‘jhāyinosmā jhāyinosmā’’ti pattakkhandhā adhomukhā madhurakajātā jhāyanti pajjhāyanti nijjhāyanti apajjhāyanti. Seyyathāpi nāma gadrabho vahacchinno sandhisamalasaṅkaṭīre jhāyati pajjhāyati nijjhāyati apajjhāyati, evamevime muṇḍakā samaṇakā ibbhā kiṇhā bandhupādāpaccā ‘‘jhāyinosmā jhāyinosmā’’ti pattakkhandhā adhomukhā madhurakajātā jhāyanti pajjhāyanti nijjhāyanti apajjhāyantī’’ti."
    ],
    "innerText": "‘‘Atha kho te, pāpima, brāhmaṇagahapatikā anvāvisiṭṭhā dūsinā mārena bhikkhū sīlavante kalyāṇadhamme akkosanti paribhāsanti rosenti vihesenti – ‘ime pana muṇḍakā samaṇakā ibbhā kiṇhā [kaṇhā (syā. kaṃ. ka.)] bandhupādāpaccā ‘‘jhāyinosmā jhāyinosmā’’ti pattakkhandhā adhomukhā madhurakajātā jhāyanti pajjhāyanti nijjhāyanti apajjhāyanti. Seyyathāpi nāma ulūko rukkhasākhāyaṃ mūsikaṃ maggayamāno jhāyati pajjhāyati nijjhāyati apajjhāyati; evamevime muṇḍakā samaṇakā ibbhā kiṇhā bandhupādāpaccā ‘‘jhāyinosmā jhāyinosmā’’ti pattakkhandhā adhomukhā madhurakajātā jhāyanti pajjhāyanti nijjhāyanti apajjhāyanti. Seyyathāpi nāma kotthu nadītīre macche maggayamāno jhāyati pajjhāyati nijjhāyati apajjhāyati; evamevime muṇḍakā samaṇakā ibbhā kiṇhā bandhupādāpaccā ‘‘jhāyinosmā jhāyinosmā’’ti pattakkhandhā adhomukhā madhurakajātā jhāyanti pajjhāyanti nijjhāyanti apajjhāyanti. Seyyathāpi nāma biḷāro sandhisamalasaṅkaṭīre mūsikaṃ maggayamāno jhāyati pajjhāyati nijjhāyati apajjhāyati; evamevime muṇḍakā samaṇakā ibbhā kiṇhā bandhupādāpaccā ‘‘jhāyinosmā jhāyinosmā’’ti pattakkhandhā adhomukhā madhurakajātā jhāyanti pajjhāyanti nijjhāyanti apajjhāyanti. Seyyathāpi nāma gadrabho vahacchinno sandhisamalasaṅkaṭīre jhāyati pajjhāyati nijjhāyati apajjhāyati, evamevime muṇḍakā samaṇakā ibbhā kiṇhā bandhupādāpaccā ‘‘jhāyinosmā jhāyinosmā’’ti pattakkhandhā adhomukhā madhurakajātā jhāyanti pajjhāyanti nijjhāyanti apajjhāyantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ye kho pana, pāpima, tena samayena manussā kālaṅkaronti yebhuyyena kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "509"
      },
      ". ‘‘Atha ",
      " kho, pāpima, kakusandho bhagavā arahaṃ sammāsambuddho bhikkhū ",
      " āmantesi – ‘anvāviṭṭhā kho, bhikkhave, brāhmaṇagahapatikā dūsinā mārena – etha, tumhe bhikkhū sīlavante kalyāṇadhamme akkosatha paribhāsatha rosetha vihesetha, appeva nāma tumhehi akkosiyamānānaṃ paribhāsiyamānānaṃ rosiyamānānaṃ vihesiyamānānaṃ siyā cittassa aññathattaṃ, yathā taṃ dūsī māro labhetha otāra’nti. Etha, tumhe, bhikkhave, mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharatha, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā viharatha. Karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharatha, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā viharathā’ti."
    ],
    "innerText": "509. ‘‘Atha kho, pāpima, kakusandho bhagavā arahaṃ sammāsambuddho bhikkhū āmantesi – ‘anvāviṭṭhā kho, bhikkhave, brāhmaṇagahapatikā dūsinā mārena – etha, tumhe bhikkhū sīlavante kalyāṇadhamme akkosatha paribhāsatha rosetha vihesetha, appeva nāma tumhehi akkosiyamānānaṃ paribhāsiyamānānaṃ rosiyamānānaṃ vihesiyamānānaṃ siyā cittassa aññathattaṃ, yathā taṃ dūsī māro labhetha otāra’nti. Etha, tumhe, bhikkhave, mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharatha, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā viharatha. Karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharatha, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā viharathā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha kho te, pāpima, bhikkhū kakusandhena bhagavatā arahatā sammāsambuddhena evaṃ ovadiyamānā evaṃ anusāsiyamānā araññagatāpi rukkhamūlagatāpi suññāgāragatāpi mettāsahagatena cetasā ekaṃ disaṃ pharitvā vihariṃsu, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā vihariṃsu. Karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā vihariṃsu, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā vihariṃsu ",
      "."
    ],
    "innerText": "‘‘Atha kho te, pāpima, bhikkhū kakusandhena bhagavatā arahatā sammāsambuddhena evaṃ ovadiyamānā evaṃ anusāsiyamānā araññagatāpi rukkhamūlagatāpi suññāgāragatāpi mettāsahagatena cetasā ekaṃ disaṃ pharitvā vihariṃsu, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā vihariṃsu. Karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā vihariṃsu, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyābajjhena pharitvā vihariṃsu ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "510"
      },
      ". ‘‘Atha kho, pāpima, dūsissa mārassa etadahosi – ‘evampi kho ahaṃ karonto imesaṃ bhikkhūnaṃ sīlavantānaṃ kalyāṇadhammānaṃ neva jānāmi āgatiṃ vā gatiṃ vā, yaṃnūnāhaṃ brāhmaṇagahapatike anvāviseyyaṃ – etha, tumhe bhikkhū sīlavante kalyāṇadhamme sakkarotha garuṃ karotha mānetha ",
      " pūjetha ",
      ", appeva nāma tumhehi sakkariyamānānaṃ garukariyamānānaṃ māniyamānānaṃ pūjiyamānānaṃ siyā cittassa aññathattaṃ, yathā taṃ dūsī māro labhetha otāra’nti ",
      ". Atha kho te, pāpima, dūsī māro brāhmaṇagahapatike anvāvisi – ‘etha, tumhe bhikkhū sīlavante kalyāṇadhamme sakkarotha garuṃ karotha mānetha pūjetha, appeva nāma tumhehi sakkariyamānānaṃ garukariyamānānaṃ māniyamānānaṃ pūjiyamānānaṃ siyā cittassa aññathattaṃ, yathā taṃ dūsī māro labhetha otāra’nti. Atha kho te, pāpima, brāhmaṇagahapatikā anvāviṭṭhā dūsinā mārena bhikkhū sīlavante kalyāṇadhamme sakkaronti garuṃ karonti mānenti pūjenti."
    ],
    "innerText": "510. ‘‘Atha kho, pāpima, dūsissa mārassa etadahosi – ‘evampi kho ahaṃ karonto imesaṃ bhikkhūnaṃ sīlavantānaṃ kalyāṇadhammānaṃ neva jānāmi āgatiṃ vā gatiṃ vā, yaṃnūnāhaṃ brāhmaṇagahapatike anvāviseyyaṃ – etha, tumhe bhikkhū sīlavante kalyāṇadhamme sakkarotha garuṃ karotha mānetha pūjetha , appeva nāma tumhehi sakkariyamānānaṃ garukariyamānānaṃ māniyamānānaṃ pūjiyamānānaṃ siyā cittassa aññathattaṃ, yathā taṃ dūsī māro labhetha otāra’nti . Atha kho te, pāpima, dūsī māro brāhmaṇagahapatike anvāvisi – ‘etha, tumhe bhikkhū sīlavante kalyāṇadhamme sakkarotha garuṃ karotha mānetha pūjetha, appeva nāma tumhehi sakkariyamānānaṃ garukariyamānānaṃ māniyamānānaṃ pūjiyamānānaṃ siyā cittassa aññathattaṃ, yathā taṃ dūsī māro labhetha otāra’nti. Atha kho te, pāpima, brāhmaṇagahapatikā anvāviṭṭhā dūsinā mārena bhikkhū sīlavante kalyāṇadhamme sakkaronti garuṃ karonti mānenti pūjenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ye kho pana, pāpima, tena samayena manussā kālaṅkaronti yebhuyyena kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "511"
      },
      ". ‘‘Atha ",
      " kho, pāpima, kakusandho bhagavā arahaṃ sammāsambuddho bhikkhū āmantesi – ‘anvāviṭṭhā kho, bhikkhave, brāhmaṇagahapatikā dūsinā mārena – etha, tumhe bhikkhū sīlavante kalyāṇadhamme sakkarotha garuṃ karotha mānetha pūjetha, appeva nāma tumhehi sakkariyamānānaṃ garukariyamānānaṃ māniyamānānaṃ pūjiyamānānaṃ siyā cittassa aññathattaṃ, yathā taṃ dūsī māro labhetha otāranti. Etha, tumhe, bhikkhave, asubhānupassino kāye viharatha, āhāre paṭikūlasaññino, sabbaloke anabhiratisaññino ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anabhiratasaññīno (sī. syā. kaṃ. pī.)]"
      },
      ", sabbasaṅkhāresu aniccānupassino’ti."
    ],
    "innerText": "511. ‘‘Atha kho, pāpima, kakusandho bhagavā arahaṃ sammāsambuddho bhikkhū āmantesi – ‘anvāviṭṭhā kho, bhikkhave, brāhmaṇagahapatikā dūsinā mārena – etha, tumhe bhikkhū sīlavante kalyāṇadhamme sakkarotha garuṃ karotha mānetha pūjetha, appeva nāma tumhehi sakkariyamānānaṃ garukariyamānānaṃ māniyamānānaṃ pūjiyamānānaṃ siyā cittassa aññathattaṃ, yathā taṃ dūsī māro labhetha otāranti. Etha, tumhe, bhikkhave, asubhānupassino kāye viharatha, āhāre paṭikūlasaññino, sabbaloke anabhiratisaññino [anabhiratasaññīno (sī. syā. kaṃ. pī.)], sabbasaṅkhāresu aniccānupassino’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Atha kho te, pāpima, bhikkhū kakusandhena bhagavatā arahatā sammāsambuddhena evaṃ ovadiyamānā evaṃ anusāsiyamānā araññagatāpi rukkhamūlagatāpi suññāgāragatāpi asubhānupassino kāye vihariṃsu, āhāre paṭikūlasaññino, sabbaloke anabhiratisaññino, sabbasaṅkhāresu aniccānupassino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "512"
      },
      ". ‘‘Atha kho, pāpima, kakusandho bhagavā arahaṃ sammāsambuddho pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya āyasmatā vidhurena pacchāsamaṇena gāmaṃ piṇḍāya pāvisi. Atha kho, pāpima, dūsī māro aññataraṃ kumārakaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kumāraṃ (sī. pī.)]"
      },
      " anvāvisitvā sakkharaṃ gahetvā āyasmato vidhurassa sīse pahāramadāsi; sīsaṃ vobhindi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sīsaṃ te bhindissāmīti (ka.)]"
      },
      ". Atha kho, pāpima, āyasmā vidhuro bhinnena sīsena lohitena gaḷantena kakusandhaṃyeva bhagavantaṃ ",
      " arahantaṃ sammāsambuddhaṃ piṭṭhito piṭṭhito anubandhi. Atha kho ",
      ", pāpima, kakusandho bhagavā arahaṃ sammāsambuddho nāgāpalokitaṃ apalokesi ",
      " – ‘na vāyaṃ dūsī māro mattamaññāsī’ti. Sahāpalokanāya ca pana, pāpima, dūsī māro tamhā ca ṭhānā cavi mahānirayañca upapajji."
    ],
    "innerText": "512. ‘‘Atha kho, pāpima, kakusandho bhagavā arahaṃ sammāsambuddho pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya āyasmatā vidhurena pacchāsamaṇena gāmaṃ piṇḍāya pāvisi. Atha kho, pāpima, dūsī māro aññataraṃ kumārakaṃ [kumāraṃ (sī. pī.)] anvāvisitvā sakkharaṃ gahetvā āyasmato vidhurassa sīse pahāramadāsi; sīsaṃ vobhindi [sīsaṃ te bhindissāmīti (ka.)]. Atha kho, pāpima, āyasmā vidhuro bhinnena sīsena lohitena gaḷantena kakusandhaṃyeva bhagavantaṃ arahantaṃ sammāsambuddhaṃ piṭṭhito piṭṭhito anubandhi. Atha kho , pāpima, kakusandho bhagavā arahaṃ sammāsambuddho nāgāpalokitaṃ apalokesi – ‘na vāyaṃ dūsī māro mattamaññāsī’ti. Sahāpalokanāya ca pana, pāpima, dūsī māro tamhā ca ṭhānā cavi mahānirayañca upapajji."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tassa kho pana, pāpima, mahānirayassa tayo nāmadheyyā honti – chaphassāyataniko itipi, saṅkusamāhato itipi, paccattavedaniyo itipi. Atha kho maṃ, pāpima, nirayapālā upasaṅkamitvā etadavocuṃ – yadā kho te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yato te (ka.)]"
      },
      ", mārisa, saṅkunā saṅku hadaye samāgaccheyya. Atha naṃ tvaṃ jāneyyāsi – ‘vassasahassaṃ me niraye paccamānassā’ti. So kho ahaṃ, pāpima, bahūni vassāni bahūni vassasatāni bahūni vassasahassāni tasmiṃ mahāniraye apacciṃ. Dasavassasahassāni tasseva mahānirayassa ussade apacciṃ vuṭṭhānimaṃ nāma vedanaṃ vediyamāno. Tassa mayhaṃ, pāpima, evarūpo kāyo hoti, seyyathāpi manussassa. Evarūpaṃ sīsaṃ hoti, seyyathāpi macchassa."
    ],
    "innerText": "‘‘Tassa kho pana, pāpima, mahānirayassa tayo nāmadheyyā honti – chaphassāyataniko itipi, saṅkusamāhato itipi, paccattavedaniyo itipi. Atha kho maṃ, pāpima, nirayapālā upasaṅkamitvā etadavocuṃ – yadā kho te [yato te (ka.)], mārisa, saṅkunā saṅku hadaye samāgaccheyya. Atha naṃ tvaṃ jāneyyāsi – ‘vassasahassaṃ me niraye paccamānassā’ti. So kho ahaṃ, pāpima, bahūni vassāni bahūni vassasatāni bahūni vassasahassāni tasmiṃ mahāniraye apacciṃ. Dasavassasahassāni tasseva mahānirayassa ussade apacciṃ vuṭṭhānimaṃ nāma vedanaṃ vediyamāno. Tassa mayhaṃ, pāpima, evarūpo kāyo hoti, seyyathāpi manussassa. Evarūpaṃ sīsaṃ hoti, seyyathāpi macchassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "513"
      },
      "."
    ],
    "innerText": "513."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kīdiso nirayo āsi, yattha dūsī apaccatha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vidhuraṃ sāvakamāsajja, kakusandhañca brāhmaṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sataṃ āsi ayosaṅkū, sabbe paccattavedanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Īdiso nirayo āsi, yattha dūsī apaccatha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vidhuraṃ sāvakamāsajja, kakusandhañca brāhmaṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo etamabhijānāti, bhikkhu buddhassa sāvako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Tādisaṃ ",
      " bhikkhumāsajja, kaṇha dukkhaṃ nigacchasi."
    ],
    "innerText": "Tādisaṃ bhikkhumāsajja, kaṇha dukkhaṃ nigacchasi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Majjhe sarassa tiṭṭhanti, vimānā kappaṭṭhāyino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Veḷuriyavaṇṇā rucirā, accimanto pabhassarā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Accharā tattha naccanti, puthu nānattavaṇṇiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Yo ",
      " etamabhijānāti, bhikkhu buddhassa sāvako;"
    ],
    "innerText": "‘‘Yo etamabhijānāti, bhikkhu buddhassa sāvako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tādisaṃ bhikkhumāsajja, kaṇha dukkhaṃ nigacchasi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo ve buddhena codito, bhikkhu saṅghassa pekkhato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Migāramātupāsādaṃ, pādaṅguṭṭhena kampayi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo etamabhijānāti, bhikkhu buddhassa sāvako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tādisaṃ bhikkhumāsajja, kaṇha dukkhaṃ nigacchasi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo vejayantaṃ pāsādaṃ, pādaṅguṭṭhena kampayi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Iddhibalenupatthaddho, saṃvejesi ca devatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo etamabhijānāti, bhikkhu buddhassa sāvako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tādisaṃ bhikkhumāsajja, kaṇha dukkhaṃ nigacchasi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo vejayantapāsāde, sakkaṃ so paripucchati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Api vāsava jānāsi, taṇhākkhayavimuttiyo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tassa sakko viyākāsi, pañhaṃ puṭṭho yathātathaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo etamabhijānāti, bhikkhu buddhassa sāvako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tādisaṃ bhikkhumāsajja, kaṇha dukkhaṃ nigacchasi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo brahmaṃ paripucchati, sudhammāyābhito sabhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "children": [
      "Ajjāpi ",
      " tyāvuso diṭṭhi, yā te diṭṭhi pure ahu;"
    ],
    "innerText": "Ajjāpi tyāvuso diṭṭhi, yā te diṭṭhi pure ahu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Passasi vītivattantaṃ, brahmaloke pabhassaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Tassa ",
      " brahmā viyākāsi, anupubbaṃ yathātathaṃ;"
    ],
    "innerText": "‘‘Tassa brahmā viyākāsi, anupubbaṃ yathātathaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na me mārisa sā diṭṭhi, yā me diṭṭhi pure ahu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Passāmi vītivattantaṃ, brahmaloke pabhassaraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sohaṃ ajja kathaṃ vajjaṃ, ahaṃ niccomhi sassato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo etamabhijānāti, bhikkhu buddhassa sāvako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tādisaṃ bhikkhumāsajja, kaṇha dukkhaṃ nigacchasi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo mahāmeruno kūṭaṃ, vimokkhena aphassayi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vanaṃ pubbavidehānaṃ, ye ca bhūmisayā narā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo etamabhijānāti, bhikkhu buddhassa sāvako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tādisaṃ bhikkhumāsajja, kaṇha dukkhaṃ nigacchasi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Na ",
      " ve aggi cetayati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[veṭhayati (sī.)]"
      },
      ", ‘ahaṃ bālaṃ ḍahāmī’ti;"
    ],
    "innerText": "‘‘Na ve aggi cetayati [veṭhayati (sī.)], ‘ahaṃ bālaṃ ḍahāmī’ti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bālo ca jalitaṃ aggiṃ, āsajja naṃ sa ḍayhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Evameva tuvaṃ māra, āsajja naṃ tathāgataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sayaṃ ḍahissasi attānaṃ, bālo aggiṃva saṃphusaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Apuññaṃ pasavī māro, āsajja naṃ tathāgataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kinnu maññasi pāpima, na me pāpaṃ vipaccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Karoto cīyati pāpaṃ, cirarattāya antaka;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Māra nibbinda buddhamhā, āsaṃ mākāsi bhikkhusu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Iti ",
      " māraṃ atajjesi, bhikkhu bhesakaḷāvane;"
    ],
    "innerText": "‘‘Iti māraṃ atajjesi, bhikkhu bhesakaḷāvane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tato so dummano yakkho, natatthevantaradhāyathā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Māratajjanīyasuttaṃ niṭṭhitaṃ dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cūḷayamakavaggo niṭṭhito pañcamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassuddānaṃ ",
      " –"
    ],
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sāleyya verañjaduve ca tuṭṭhi, cūḷamahādhammasamādānañca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vīmaṃsakā kosambi ca brāhmaṇo, dūsī ca māro dasamo ca vaggo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sāleyyavaggo niṭṭhito pañcamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idaṃ vaggānamuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mūlapariyāyo ceva, sīhanādo ca uttamo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kakaco ceva gosiṅgo, sāleyyo ca ime pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mūlapaṇṇāsakaṃ samattaṃ."
  }
]