[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "5. Saḷāyatanavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Anāthapiṇḍikovādasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "383"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " . Evaṃ"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena anāthapiṇḍiko gahapati ābādhiko hoti dukkhito bāḷhagilāno. Atha kho anāthapiṇḍiko gahapati aññataraṃ purisaṃ āmantesi – ''ehi tvaṃ, ambho purisa, yena bhagavā tenupasaṅkama; upasaṅkamitvā mama vacancyena bhagavato pāde sirasā vandāhi "
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vandāhi evañca vadehi (sabbattha) aññasuttesu pana natthi]"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " – 'anāthapiṇḍiko, bhante, gahapati ābādhiko dukkhito bāḷhagilāno. So bhagavato pāde sirasā vandatī'ti. Yena cāyasmā sāriputto tenupasaṅkama; upasaṅkamitvā mama vacantena āyasmato sāriputtassa pāde sirasā vandāhi"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "– 'anāthapiṇḍiko, bhante, gahapati ābādhiko dukkhito bāḷhagilāno. So āyasmato sāriputtassa pāde sirasā vandatī'ti. Evañca vadehi – 'sādhu kira, bhante, āyasmā sāriputto yena anāthapiṇḍikassa gahapatissa nivesanaṃ tenupasaṅkamatu anukampaṃ upādāyā''ti."
      }
    ],
    "innerText": "383 . Evaṃme sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena anāthapiṇḍiko gahapati ābādhiko hoti dukkhito bāḷhagilāno. Atha kho anāthapiṇḍiko gahapati aññataraṃ purisaṃ āmantesi – ''ehi tvaṃ, ambho purisa, yena bhagavā tenupasaṅkama; upasaṅkamitvā mama vacancyena bhagavato pāde sirasā vandāhi [vandāhi evañca vadehi (sabbattha) aññasuttesu pana natthi] – 'anāthapiṇḍiko, bhante, gahapati ābādhiko dukkhito bāḷhagilāno. So bhagavato pāde sirasā vandatī'ti. Yena cāyasmā sāriputto tenupasaṅkama; upasaṅkamitvā mama vacantena āyasmato sāriputtassa pāde sirasā vandāhi– 'anāthapiṇḍiko, bhante, gahapati ābādhiko dukkhito bāḷhagilāno. So āyasmato sāriputtassa pāde sirasā vandatī'ti. Evañca vadehi – 'sādhu kira, bhante, āyasmā sāriputto yena anāthapiṇḍikassa gahapatissa nivesanaṃ tenupasaṅkamatu anukampaṃ upādāyā''ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "''Evaṃ, bhante''ti kho so puriso anāthapiṇḍikassa gahapatissa paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so puriso bhagavantaṃ etadavoca – ''anāthapiṇḍiko, bhante, gahapati ābādhiko dukkhito bāḷhagilāno. So bhagavato pāde sirasā vandatī''ti. Yena cāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmantaṃ sāriputtaṃ abhivādetvā ekamantaṃ nisīdi. Ekamanthaṃ"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "nisinno kho so puriso āyasmantaṃ sāriputtaṃ etadavoca – ''anāthapiṇḍiko, bhante, gahapati ābādhiko dukkhito bāḷhagilāno. So āyasmato sāriputtassa pāde sirasā vandati; evañca vadeti—'sādhu kira, bhante, āyasmā sāriputto yena anāthapiṇḍikassa"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "gahapatissa nivesanaṃ tenupasaṅkamatu anukampaṃ"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "upādāyā'''ti. Adhivāsesi kho āyasmā sāriputto tuṇhībhāvena."
      }
    ],
    "innerText": "''Evaṃ, bhante''ti kho so puriso anāthapiṇḍikassa gahapatissa paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so puriso bhagavantaṃ etadavoca – ''anāthapiṇḍiko, bhante, gahapati ābādhiko dukkhito bāḷhagilāno. So bhagavato pāde sirasā vandatī''ti. Yena cāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmantaṃ sāriputtaṃ abhivādetvā ekamantaṃ nisīdi. Ekamanthaṃnisinno kho so puriso āyasmantaṃ sāriputtaṃ etadavoca – ''anāthapiṇḍiko, bhante, gahapati ābādhiko dukkhito bāḷhagilāno. So āyasmato sāriputtassa pāde sirasā vandati; evañca vadeti—'sādhu kira, bhante, āyasmā sāriputto yena anāthapiṇḍikassagahapatissa nivesanaṃ tenupasaṅkamatu anukampaṃupādāyā'''ti. Adhivāsesi kho āyasmā sāriputto tuṇhībhāvena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "384"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " . Atha kho āyasmā sāriputto nivāsetvā pattacīvaramādāya āyasmatā ānandena pacchāsamaṇena yena anāthapiṇḍikassa gahapatissa nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "To install āsane nisīdi. Nisajja kho āyasmā sāriputto anāthapiṇḍikaṃ gahapatiṃ etadavoca — ''kacci te, gahapati, khamanīyaṃ, kacci yāpanīyaṃ? Kacci te dukkha vedanā paṭikkamanti, no abhikkamanti; paṭikkamosānaṃ paññāyati, no abhikkamo''ti?"
      }
    ],
    "innerText": "384 . Atha kho āyasmā sāriputto nivāsetvā pattacīvaramādāya āyasmatā ānandena pacchāsamaṇena yena anāthapiṇḍikassa gahapatissa nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatteTo install āsane nisīdi. Nisajja kho āyasmā sāriputto anāthapiṇḍikaṃ gahapatiṃ etadavoca — ''kacci te, gahapati, khamanīyaṃ, kacci yāpanīyaṃ? Kacci te dukkha vedanā paṭikkamanti, no abhikkamanti; paṭikkamosānaṃ paññāyati, no abhikkamo''ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na me, bhante sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. Seyyathāpi, bhante sāriputta, balavā puriso tiṇhena sikharena ",
      " muddhani ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[muddhānaṃ (sī. syā. kaṃ. pī.)]"
      },
      " abhimattheyya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhimantheyya (sī. pī.)]"
      },
      "; evameva kho me, bhante sāriputta, adhimattā vātā muddhani ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ohananti (syā. kaṃ.)]"
      },
      " ūhananti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[adhimattā vātā sīlaṃ parikantanti (sī. syā. kaṃ.)]"
      },
      ". Na me, bhante sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. Seyyathāpi, bhante sāriputta, balavā puriso daḷhena varattakhaṇḍena sīse sīsaveṭhaṃ dadeyya; evameva kho me, bhante sāriputta, adhimattā sīse sīsavedanā. Na me, bhante sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. Seyyathāpi, bhante sāriputta, dakkho goghātako vā goghātakantevāsī vā tiṇhena govikantanena kucchiṃ parikanteyya; evameva kho me, bhante sāriputta, adhimattā vātā kucchiṃ parikantanti. Na me, bhante sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. Seyyathāpi, bhante sāriputta, dve balavanto purisā dubbalataraṃ purisaṃ nānābāhāsu gahetvā aṅgārakāsuyā santāpeyyuṃ, samparitāpeyyuṃ; evameva kho me, bhante sāriputta, adhimatto kāyasmiṃ ḍāho. Na me, bhante sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā ",
      " abhikkamanti, no paṭikkamanti; abhikkamosānaṃ ",
      " paññāyati, no paṭikkamo’’ti."
    ],
    "innerText": "‘‘Na me, bhante sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. Seyyathāpi, bhante sāriputta, balavā puriso tiṇhena sikharena muddhani [muddhānaṃ (sī. syā. kaṃ. pī.)] abhimattheyya [abhimantheyya (sī. pī.)]; evameva kho me, bhante sāriputta, adhimattā vātā muddhani [ohananti (syā. kaṃ.)] ūhananti [adhimattā vātā sīlaṃ parikantanti (sī. syā. kaṃ.)]. Na me, bhante sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. Seyyathāpi, bhante sāriputta, balavā puriso daḷhena varattakhaṇḍena sīse sīsaveṭhaṃ dadeyya; evameva kho me, bhante sāriputta, adhimattā sīse sīsavedanā. Na me, bhante sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. Seyyathāpi, bhante sāriputta, dakkho goghātako vā goghātakantevāsī vā tiṇhena govikantanena kucchiṃ parikanteyya; evameva kho me, bhante sāriputta, adhimattā vātā kucchiṃ parikantanti. Na me, bhante sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. Seyyathāpi, bhante sāriputta, dve balavanto purisā dubbalataraṃ purisaṃ nānābāhāsu gahetvā aṅgārakāsuyā santāpeyyuṃ, samparitāpeyyuṃ; evameva kho me, bhante sāriputta, adhimatto kāyasmiṃ ḍāho. Na me, bhante sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "385"
      },
      ". ‘‘Tasmātiha ",
      " te, gahapati, evaṃ sikkhitabbaṃ – ‘na cakkhuṃ upādiyissāmi, na ca me cakkhunissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ."
    ],
    "innerText": "385. ‘‘Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na cakkhuṃ upādiyissāmi, na ca me cakkhunissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na sotaṃ upādiyissāmi, na ca me sotanissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na ghānaṃ upādiyissāmi, na ca me ghānanissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na jivhaṃ upādiyissāmi, na ca me jivhānissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na kāyaṃ upādiyissāmi, na ca me kāyanissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na manaṃ upādiyissāmi, na ca me manonissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na rūpaṃ upādiyissāmi, na ca me rūpanissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na saddaṃ upādiyissāmi…pe… na gandhaṃ upādiyissāmi… na rasaṃ upādiyissāmi… na phoṭṭhabbaṃ upādiyissāmi… na dhammaṃ upādiyissāmi na ",
      " ca me dhammanissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ."
    ],
    "innerText": "‘‘Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na rūpaṃ upādiyissāmi, na ca me rūpanissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na saddaṃ upādiyissāmi…pe… na gandhaṃ upādiyissāmi… na rasaṃ upādiyissāmi… na phoṭṭhabbaṃ upādiyissāmi… na dhammaṃ upādiyissāmi na ca me dhammanissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na cakkhuviññāṇaṃ upādiyissāmi, na ca me cakkhuviññāṇanissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na sotaviññāṇaṃ upādiyissāmi… na ghānaviññāṇaṃ upādiyissāmi… na jivhāviññāṇaṃ upādiyissāmi… na kāyaviññāṇaṃ upādiyissāmi… na manoviññāṇaṃ upādiyissāmi na ca me manoviññāṇanissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tasmātiha ",
      " te, gahapati, evaṃ sikkhitabbaṃ – ‘na cakkhusamphassaṃ upādiyissāmi, na ca ",
      " me cakkhusamphassanissitaṃ ",
      " viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na sotasamphassaṃ upādiyissāmi… na ghānasamphassaṃ upādiyissāmi… na jivhāsamphassaṃ upādiyissāmi… na kāyasamphassaṃ upādiyissāmi… na manosamphassaṃ upādiyissāmi, na ca me manosamphassanissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ."
    ],
    "innerText": "‘‘Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na cakkhusamphassaṃ upādiyissāmi, na ca me cakkhusamphassanissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na sotasamphassaṃ upādiyissāmi… na ghānasamphassaṃ upādiyissāmi… na jivhāsamphassaṃ upādiyissāmi… na kāyasamphassaṃ upādiyissāmi… na manosamphassaṃ upādiyissāmi, na ca me manosamphassanissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na cakkhusamphassajaṃ vedanaṃ upādiyissāmi, na ca me cakkhusamphassajāvedanānissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te ",
      ", gahapati, evaṃ sikkhitabbaṃ – ‘na sotasamphassajaṃ vedanaṃ upādiyissāmi… na ghānasamphassajaṃ vedanaṃ upādiyissāmi… na jivhāsamphassajaṃ vedanaṃ upādiyissāmi… na kāyasamphassajaṃ vedanaṃ upādiyissāmi… na manosamphassajaṃ vedanaṃ upādiyissāmi, na ca me manosamphassajāvedanānissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ."
    ],
    "innerText": "‘‘Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na cakkhusamphassajaṃ vedanaṃ upādiyissāmi, na ca me cakkhusamphassajāvedanānissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te , gahapati, evaṃ sikkhitabbaṃ – ‘na sotasamphassajaṃ vedanaṃ upādiyissāmi… na ghānasamphassajaṃ vedanaṃ upādiyissāmi… na jivhāsamphassajaṃ vedanaṃ upādiyissāmi… na kāyasamphassajaṃ vedanaṃ upādiyissāmi… na manosamphassajaṃ vedanaṃ upādiyissāmi, na ca me manosamphassajāvedanānissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "386"
      },
      ". ‘‘Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na pathavīdhātuṃ upādiyissāmi, na ca me pathavīdhātunissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na āpodhātuṃ upādiyissāmi… na tejodhātuṃ upādiyissāmi… na vāyodhātuṃ upādiyissāmi… na ākāsadhātuṃ upādiyissāmi… na viññāṇadhātuṃ upādiyissāmi, na ca me viññāṇadhātunissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ."
    ],
    "innerText": "386. ‘‘Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na pathavīdhātuṃ upādiyissāmi, na ca me pathavīdhātunissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na āpodhātuṃ upādiyissāmi… na tejodhātuṃ upādiyissāmi… na vāyodhātuṃ upādiyissāmi… na ākāsadhātuṃ upādiyissāmi… na viññāṇadhātuṃ upādiyissāmi, na ca me viññāṇadhātunissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na rūpaṃ upādiyissāmi, na ca me rūpanissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na vedanaṃ upādiyissāmi… na saññaṃ upādiyissāmi… na saṅkhāre upādiyissāmi… na viññāṇaṃ upādiyissāmi, na ca me viññāṇanissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na ākāsānañcāyatanaṃ ",
      " upādiyissāmi ",
      ", na ca me ākāsānañcāyatananissitaṃ viññāṇaṃ bhavissatī’ti ",
      ". Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na viññāṇañcāyatanaṃ upādiyissāmi… na ākiñcaññāyatanaṃ ",
      " upādiyissāmi… na nevasaññānāsaññāyatanaṃ upādiyissāmi na ca me nevasaññānāsaññāyatananissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ."
    ],
    "innerText": "‘‘Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na ākāsānañcāyatanaṃ upādiyissāmi , na ca me ākāsānañcāyatananissitaṃ viññāṇaṃ bhavissatī’ti . Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na viññāṇañcāyatanaṃ upādiyissāmi… na ākiñcaññāyatanaṃ upādiyissāmi… na nevasaññānāsaññāyatanaṃ upādiyissāmi na ca me nevasaññānāsaññāyatananissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na idhalokaṃ upādiyissāmi, na ca me idhalokanissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘na paralokaṃ upādiyissāmi, na ca me paralokanissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabbaṃ. Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘yampi me diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anupariyesitaṃ anucaritaṃ manasā tampi na upādiyissāmi, na ca me taṃnissitaṃ viññāṇaṃ bhavissatī’ti. Evañhi te, gahapati, sikkhitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "387"
      },
      ". Evaṃ vutte, anāthapiṇḍiko gahapati parodi, assūni pavattesi. Atha kho āyasmā ānando anāthapiṇḍikaṃ gahapatiṃ etadavoca – ‘‘olīyasi kho tvaṃ, gahapati, saṃsīdasi kho tvaṃ, gahapatī’’ti? ‘‘Nāhaṃ, bhante ānanda, olīyāmi, napi saṃsīdāmi; api ca me dīgharattaṃ satthā payirupāsito manobhāvanīyā ca bhikkhū; na ca me evarūpī dhammī ",
      " kathā sutapubbā’’ti. ‘‘Na kho, gahapati, gihīnaṃ odātavasanānaṃ evarūpī dhammī kathā paṭibhāti; pabbajitānaṃ kho, gahapati, evarūpī dhammī kathā paṭibhātī’’ti. ‘‘Tena hi, bhante sāriputta, gihīnampi odātavasanānaṃ evarūpī dhammī kathā paṭibhātu. Santi hi, bhante, kulaputtā apparajakkhajātikā, assavanatā dhammassa parihāyanti; bhavissanti dhammassa aññātāro’’ti."
    ],
    "innerText": "387. Evaṃ vutte, anāthapiṇḍiko gahapati parodi, assūni pavattesi. Atha kho āyasmā ānando anāthapiṇḍikaṃ gahapatiṃ etadavoca – ‘‘olīyasi kho tvaṃ, gahapati, saṃsīdasi kho tvaṃ, gahapatī’’ti? ‘‘Nāhaṃ, bhante ānanda, olīyāmi, napi saṃsīdāmi; api ca me dīgharattaṃ satthā payirupāsito manobhāvanīyā ca bhikkhū; na ca me evarūpī dhammī kathā sutapubbā’’ti. ‘‘Na kho, gahapati, gihīnaṃ odātavasanānaṃ evarūpī dhammī kathā paṭibhāti; pabbajitānaṃ kho, gahapati, evarūpī dhammī kathā paṭibhātī’’ti. ‘‘Tena hi, bhante sāriputta, gihīnampi odātavasanānaṃ evarūpī dhammī kathā paṭibhātu. Santi hi, bhante, kulaputtā apparajakkhajātikā, assavanatā dhammassa parihāyanti; bhavissanti dhammassa aññātāro’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmā ca sāriputto āyasmā ca ānando anāthapiṇḍikaṃ gahapatiṃ iminā ovādena ovaditvā uṭṭhāyāsanā pakkamiṃsu. Atha kho anāthapiṇḍiko gahapati, acirapakkante āyasmante ca sāriputte āyasmante ca ānande ",
      ", kālamakāsi tusitaṃ kāyaṃ upapajji. Atha kho anāthapiṇḍiko devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ ",
      " jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ",
      " ṭhito kho anāthapiṇḍiko devaputto bhagavantaṃ gāthāhi ajjhabhāsi –"
    ],
    "innerText": "Atha kho āyasmā ca sāriputto āyasmā ca ānando anāthapiṇḍikaṃ gahapatiṃ iminā ovādena ovaditvā uṭṭhāyāsanā pakkamiṃsu. Atha kho anāthapiṇḍiko gahapati, acirapakkante āyasmante ca sāriputte āyasmante ca ānande , kālamakāsi tusitaṃ kāyaṃ upapajji. Atha kho anāthapiṇḍiko devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho anāthapiṇḍiko devaputto bhagavantaṃ gāthāhi ajjhabhāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Idañhi taṃ jetavanaṃ, isisaṅghanisevitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āvutthaṃ dhammarājena, pītisañjananaṃ mama."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kammaṃ vijjā ca dhammo ca, sīlaṃ jīvitamuttamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etena maccā sujjhanti, na gottena dhanena vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tasmā hi paṇḍito poso, sampassaṃ atthamattano;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yoniso vicine dhammaṃ, evaṃ tattha visujjhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Sāriputtova ",
      " paññāya, sīlena upasamena;"
    ],
    "innerText": "‘‘Sāriputtova paññāya, sīlena upasamena;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yopi pāraṅgato bhikkhu, etāvaparamo siyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca anāthapiṇḍiko devaputto. Samanuñño satthā ahosi. Atha kho anāthapiṇḍiko devaputto – ‘‘samanuñño me satthā’’ti bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "388"
      },
      ". Atha kho bhagavā tassā rattiyā accayena bhikkhū āmantesi – ‘‘imaṃ, bhikkhave, rattiṃ aññataro devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho so devaputto maṃ gāthāhi ajjhabhāsi –"
    ],
    "innerText": "388. Atha kho bhagavā tassā rattiyā accayena bhikkhū āmantesi – ‘‘imaṃ, bhikkhave, rattiṃ aññataro devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho so devaputto maṃ gāthāhi ajjhabhāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Idañhi taṃ jetavanaṃ, isisaṅghanisevitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āvutthaṃ dhammarājena, pītisañjananaṃ mama."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kammaṃ vijjā ca dhammo ca, sīlaṃ jīvitamuttamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etena maccā sujjhanti, na gottena dhanena vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Tasmā ",
      " hi paṇḍito poso, sampassaṃ atthamattano;"
    ],
    "innerText": "‘‘Tasmā hi paṇḍito poso, sampassaṃ atthamattano;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yoniso vicine dhammaṃ, evaṃ tattha visujjhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sāriputtova paññāya, sīlena upasamena;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yopi pāraṅgato bhikkhu, etāvaparamo siyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idamavoca ",
      ", bhikkhave, so devaputto. ‘Samanuñño me satthā’ti maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyī’’ti."
    ],
    "innerText": "‘‘Idamavoca , bhikkhave, so devaputto. ‘Samanuñño me satthā’ti maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " vutte, āyasmā ānando bhagavantaṃ etadavoca – ‘‘so hi nūna so, bhante, anāthapiṇḍiko devaputto bhavissati. Anāthapiṇḍiko, bhante, gahapati āyasmante sāriputte abhippasanno ahosī’’ti. ‘‘Sādhu, sādhu, ānanda! Yāvatakaṃ kho, ānanda, takkāya pattabbaṃ, anuppattaṃ taṃ tayā. Anāthapiṇḍiko so, ānanda, devaputto’’ti."
    ],
    "innerText": "Evaṃ vutte, āyasmā ānando bhagavantaṃ etadavoca – ‘‘so hi nūna so, bhante, anāthapiṇḍiko devaputto bhavissati. Anāthapiṇḍiko, bhante, gahapati āyasmante sāriputte abhippasanno ahosī’’ti. ‘‘Sādhu, sādhu, ānanda! Yāvatakaṃ kho, ānanda, takkāya pattabbaṃ, anuppattaṃ taṃ tayā. Anāthapiṇḍiko so, ānanda, devaputto’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Attamano āyasmā ānando bhagavato bhāsitaṃ abhinandīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anāthapiṇḍikovādasuttaṃ niṭṭhitaṃ paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Channovādasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "389"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena āyasmā ca sāriputto āyasmā ca mahācundo āyasmā ca channo gijjhakūṭe pabbate viharanti. Tena kho pana samayena āyasmā channo ābādhiko hoti dukkhito bāḷhagilāno. Atha kho āyasmā sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā mahācundo tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahācundaṃ etadavoca – ‘‘āyāmāvuso cunda, yenāyasmā channo tenupasaṅkamissāma gilānapucchakā’’ti. ‘‘Evamāvuso’’ti kho āyasmā mahācundo āyasmato sāriputtassa paccassosi."
    ],
    "innerText": "389. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena āyasmā ca sāriputto āyasmā ca mahācundo āyasmā ca channo gijjhakūṭe pabbate viharanti. Tena kho pana samayena āyasmā channo ābādhiko hoti dukkhito bāḷhagilāno. Atha kho āyasmā sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā mahācundo tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahācundaṃ etadavoca – ‘‘āyāmāvuso cunda, yenāyasmā channo tenupasaṅkamissāma gilānapucchakā’’ti. ‘‘Evamāvuso’’ti kho āyasmā mahācundo āyasmato sāriputtassa paccassosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmā ca sāriputto āyasmā ca mahācundo yenāyasmā channo tenupasaṅkamiṃsu; upasaṅkamitvā āyasmatā channena saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ ",
      " sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ channaṃ etadavoca – ‘‘kacci te, āvuso channa, khamanīyaṃ, kacci yāpanīyaṃ? Kacci te dukkhā vedanā paṭikkamanti, no abhikkamanti; paṭikkamosānaṃ paññāyati, no abhikkamo’’ti?"
    ],
    "innerText": "Atha kho āyasmā ca sāriputto āyasmā ca mahācundo yenāyasmā channo tenupasaṅkamiṃsu; upasaṅkamitvā āyasmatā channena saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ channaṃ etadavoca – ‘‘kacci te, āvuso channa, khamanīyaṃ, kacci yāpanīyaṃ? Kacci te dukkhā vedanā paṭikkamanti, no abhikkamanti; paṭikkamosānaṃ paññāyati, no abhikkamo’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na me, āvuso sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. Seyyathāpi ",
      ", āvuso sāriputta, balavā puriso ",
      " tiṇhena sikharena muddhani abhimattheyya; evameva kho me, āvuso sāriputta, adhimattā vātā muddhani ūhananti. Na me, āvuso sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati no paṭikkamo. Seyyathāpi, āvuso sāriputta, balavā puriso daḷhena varattakkhaṇḍena sīse sīsaveṭhaṃ dadeyya; evameva kho me, āvuso sāriputta, adhimattā sīse sīsavedanā. Na me, āvuso sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. Seyyathāpi, āvuso ",
      " sāriputta, dakkho goghātako vā goghātakantevāsī vā tiṇhena govikantanena kucchiṃ parikanteyya; evameva kho me, āvuso sāriputta, adhimattā vātā kucchiṃ parikantanti. Na me, āvuso sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. Seyyathāpi, āvuso sāriputta, dve balavanto purisā dubbalataraṃ purisaṃ nānābāhāsu gahetvā aṅgārakāsuyā santāpeyyuṃ samparitāpeyyuṃ; evameva kho me, āvuso sāriputta, adhimatto ",
      " kāyasmiṃ ḍāho. Na me, āvuso sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. Satthaṃ, āvuso sāriputta, āharissāmi, nāvakaṅkhāmi jīvita’’nti."
    ],
    "innerText": "‘‘Na me, āvuso sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. Seyyathāpi , āvuso sāriputta, balavā puriso tiṇhena sikharena muddhani abhimattheyya; evameva kho me, āvuso sāriputta, adhimattā vātā muddhani ūhananti. Na me, āvuso sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati no paṭikkamo. Seyyathāpi, āvuso sāriputta, balavā puriso daḷhena varattakkhaṇḍena sīse sīsaveṭhaṃ dadeyya; evameva kho me, āvuso sāriputta, adhimattā sīse sīsavedanā. Na me, āvuso sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. Seyyathāpi, āvuso sāriputta, dakkho goghātako vā goghātakantevāsī vā tiṇhena govikantanena kucchiṃ parikanteyya; evameva kho me, āvuso sāriputta, adhimattā vātā kucchiṃ parikantanti. Na me, āvuso sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. Seyyathāpi, āvuso sāriputta, dve balavanto purisā dubbalataraṃ purisaṃ nānābāhāsu gahetvā aṅgārakāsuyā santāpeyyuṃ samparitāpeyyuṃ; evameva kho me, āvuso sāriputta, adhimatto kāyasmiṃ ḍāho. Na me, āvuso sāriputta, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. Satthaṃ, āvuso sāriputta, āharissāmi, nāvakaṅkhāmi jīvita’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "390"
      },
      ". ‘‘Māyasmā channo satthaṃ āharesi. Yāpetāyasmā channo. Yāpentaṃ mayaṃ āyasmantaṃ channaṃ icchāma. Sace āyasmato channassa natthi sappāyāni bhojanāni, ahaṃ āyasmato channassa sappāyāni bhojanāni pariyesissāmi. Sace āyasmato channassa natthi sappāyāni bhesajjāni, ahaṃ āyasmato channassa sappāyāni bhesajjāni pariyesissāmi. Sace āyasmato channassa natthi patirūpā upaṭṭhākā, ahaṃ āyasmantaṃ channaṃ upaṭṭhahissāmi. Māyasmā channo satthaṃ āharesi. Yāpetāyasmā channo. Yāpentaṃ mayaṃ āyasmantaṃ channaṃ icchāmā’’ti."
    ],
    "innerText": "390. ‘‘Māyasmā channo satthaṃ āharesi. Yāpetāyasmā channo. Yāpentaṃ mayaṃ āyasmantaṃ channaṃ icchāma. Sace āyasmato channassa natthi sappāyāni bhojanāni, ahaṃ āyasmato channassa sappāyāni bhojanāni pariyesissāmi. Sace āyasmato channassa natthi sappāyāni bhesajjāni, ahaṃ āyasmato channassa sappāyāni bhesajjāni pariyesissāmi. Sace āyasmato channassa natthi patirūpā upaṭṭhākā, ahaṃ āyasmantaṃ channaṃ upaṭṭhahissāmi. Māyasmā channo satthaṃ āharesi. Yāpetāyasmā channo. Yāpentaṃ mayaṃ āyasmantaṃ channaṃ icchāmā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Napi me, āvuso sāriputta, natthi sappāyāni bhojanāni; napi me natthi sappāyāni bhesajjāni; napi me natthi patirūpā upaṭṭhākā; api cāvuso sāriputta ",
      ", pariciṇṇo me satthā dīgharattaṃ manāpeneva no amanāpena. Etañhi, āvuso sāriputta, sāvakassa patirūpaṃ yaṃ satthāraṃ paricareyya manāpeneva no amanāpena. ‘Anupavajjaṃ channo bhikkhu satthaṃ āharissatī’ti evametaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[evameva kho tvaṃ (ka.)]"
      },
      ", āvuso sāriputta, dhārehī’’ti. ‘‘Puccheyyāma mayaṃ āyasmantaṃ channaṃ kañcideva desaṃ, sace āyasmā ",
      " channo okāsaṃ karoti pañhassa veyyākaraṇāyā’’ti. ‘‘Pucchāvuso sāriputta, sutvā vedissāmī’’ti."
    ],
    "innerText": "‘‘Napi me, āvuso sāriputta, natthi sappāyāni bhojanāni; napi me natthi sappāyāni bhesajjāni; napi me natthi patirūpā upaṭṭhākā; api cāvuso sāriputta , pariciṇṇo me satthā dīgharattaṃ manāpeneva no amanāpena. Etañhi, āvuso sāriputta, sāvakassa patirūpaṃ yaṃ satthāraṃ paricareyya manāpeneva no amanāpena. ‘Anupavajjaṃ channo bhikkhu satthaṃ āharissatī’ti evametaṃ [evameva kho tvaṃ (ka.)], āvuso sāriputta, dhārehī’’ti. ‘‘Puccheyyāma mayaṃ āyasmantaṃ channaṃ kañcideva desaṃ, sace āyasmā channo okāsaṃ karoti pañhassa veyyākaraṇāyā’’ti. ‘‘Pucchāvuso sāriputta, sutvā vedissāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "391"
      },
      ". ‘‘Cakkhuṃ, āvuso channa, cakkhuviññāṇaṃ cakkhuviññāṇaviññātabbe dhamme ‘etaṃ mama, esohamasmi, eso ",
      " me attā’ti samanupassasi? Sotaṃ, āvuso channa, sotaviññāṇaṃ…pe… ghānaṃ, āvuso channa, ghānaviññāṇaṃ… jivhaṃ, āvuso channa, jivhāviññāṇaṃ ",
      "… kāyaṃ, āvuso channa, kāyaviññāṇaṃ… manaṃ, āvuso channa, manoviññāṇaṃ manoviññāṇaviññātabbe dhamme ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassasī’’ti?"
    ],
    "innerText": "391. ‘‘Cakkhuṃ, āvuso channa, cakkhuviññāṇaṃ cakkhuviññāṇaviññātabbe dhamme ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassasi? Sotaṃ, āvuso channa, sotaviññāṇaṃ…pe… ghānaṃ, āvuso channa, ghānaviññāṇaṃ… jivhaṃ, āvuso channa, jivhāviññāṇaṃ … kāyaṃ, āvuso channa, kāyaviññāṇaṃ… manaṃ, āvuso channa, manoviññāṇaṃ manoviññāṇaviññātabbe dhamme ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassasī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Cakkhuṃ, āvuso sāriputta, cakkhuviññāṇaṃ cakkhuviññāṇaviññātabbe dhamme ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassāmi. Sotaṃ, āvuso sāriputta…pe… ghānaṃ, āvuso sāriputta… jivhaṃ, āvuso sāriputta… kāyaṃ, āvuso sāriputta… manaṃ, āvuso sāriputta, manoviññāṇaṃ manoviññāṇaviññātabbe dhamme ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "392"
      },
      ". ‘‘Cakkhusmiṃ, āvuso channa, cakkhuviññāṇe cakkhuviññāṇaviññātabbesu dhammesu kiṃ disvā kiṃ abhiññāya cakkhuṃ cakkhuviññāṇaṃ cakkhuviññāṇaviññātabbe dhamme ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassasi? Sotasmiṃ, āvuso channa, sotaviññāṇe ",
      "… ghānasmiṃ, āvuso channa, ghānaviññāṇe… jivhāya, āvuso channa, jivhāviññāṇe… kāyasmiṃ, āvuso channa, kāyaviññāṇe… manasmiṃ, āvuso channa, manoviññāṇe manoviññāṇaviññātabbesu dhammesu kiṃ disvā kiṃ abhiññāya manaṃ manoviññāṇaṃ manoviññāṇaviññātabbe dhamme ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassasī’’ti?"
    ],
    "innerText": "392. ‘‘Cakkhusmiṃ, āvuso channa, cakkhuviññāṇe cakkhuviññāṇaviññātabbesu dhammesu kiṃ disvā kiṃ abhiññāya cakkhuṃ cakkhuviññāṇaṃ cakkhuviññāṇaviññātabbe dhamme ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassasi? Sotasmiṃ, āvuso channa, sotaviññāṇe … ghānasmiṃ, āvuso channa, ghānaviññāṇe… jivhāya, āvuso channa, jivhāviññāṇe… kāyasmiṃ, āvuso channa, kāyaviññāṇe… manasmiṃ, āvuso channa, manoviññāṇe manoviññāṇaviññātabbesu dhammesu kiṃ disvā kiṃ abhiññāya manaṃ manoviññāṇaṃ manoviññāṇaviññātabbe dhamme ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassasī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cakkhusmiṃ ",
      ", āvuso sāriputta, cakkhuviññāṇe cakkhuviññāṇaviññātabbesu dhammesu nirodhaṃ disvā nirodhaṃ abhiññāya cakkhuṃ cakkhuviññāṇaṃ cakkhuviññāṇaviññātabbe dhamme ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassāmi. Sotasmiṃ, āvuso sāriputta, sotaviññāṇe… ghānasmiṃ, āvuso sāriputta, ghānaviññāṇe… jivhāya, āvuso sāriputta, jivhāviññāṇe… kāyasmiṃ, āvuso sāriputta, kāyaviññāṇe… manasmiṃ, āvuso sāriputta, manoviññāṇe manoviññāṇaviññātabbesu ",
      " dhammesu nirodhaṃ disvā nirodhaṃ abhiññā manaṃ manoviññāṇaṃ manoviññāṇaviññātabbe ",
      " dhamme ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassāmī’’ti."
    ],
    "innerText": "‘‘Cakkhusmiṃ , āvuso sāriputta, cakkhuviññāṇe cakkhuviññāṇaviññātabbesu dhammesu nirodhaṃ disvā nirodhaṃ abhiññāya cakkhuṃ cakkhuviññāṇaṃ cakkhuviññāṇaviññātabbe dhamme ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassāmi. Sotasmiṃ, āvuso sāriputta, sotaviññāṇe… ghānasmiṃ, āvuso sāriputta, ghānaviññāṇe… jivhāya, āvuso sāriputta, jivhāviññāṇe… kāyasmiṃ, āvuso sāriputta, kāyaviññāṇe… manasmiṃ, āvuso sāriputta, manoviññāṇe manoviññāṇaviññātabbesu dhammesu nirodhaṃ disvā nirodhaṃ abhiññā manaṃ manoviññāṇaṃ manoviññāṇaviññātabbe dhamme ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "393"
      },
      ". Evaṃ vutte, āyasmā mahācundo āyasmantaṃ channaṃ etadavoca – ‘‘tasmātiha, āvuso channa, idampi tassa bhagavato sāsanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vacanaṃ (sī.)]"
      },
      ", niccakappaṃ manasi kātabbaṃ – ‘nissitassa calitaṃ, anissitassa calitaṃ ",
      " natthi. Calite asati passaddhi, passaddhiyā sati nati na hoti. Natiyā asati āgatigati na hoti. Āgatigatiyā asati cutūpapāto na hoti. Cutūpapāte asati nevidha na huraṃ na ubhayamantarena. Esevanto dukkhassā’’’ti. Atha kho āyasmā ca sāriputto āyasmā ca mahācundo āyasmantaṃ channaṃ iminā ovādena ovaditvā uṭṭhāyāsanā pakkamiṃsu."
    ],
    "innerText": "393. Evaṃ vutte, āyasmā mahācundo āyasmantaṃ channaṃ etadavoca – ‘‘tasmātiha, āvuso channa, idampi tassa bhagavato sāsanaṃ [vacanaṃ (sī.)], niccakappaṃ manasi kātabbaṃ – ‘nissitassa calitaṃ, anissitassa calitaṃ natthi. Calite asati passaddhi, passaddhiyā sati nati na hoti. Natiyā asati āgatigati na hoti. Āgatigatiyā asati cutūpapāto na hoti. Cutūpapāte asati nevidha na huraṃ na ubhayamantarena. Esevanto dukkhassā’’’ti. Atha kho āyasmā ca sāriputto āyasmā ca mahācundo āyasmantaṃ channaṃ iminā ovādena ovaditvā uṭṭhāyāsanā pakkamiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "394"
      },
      ". Atha kho āyasmā channo acirapakkante āyasmante ca sāriputte āyasmante ca mahācunde satthaṃ āharesi. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘āyasmatā, bhante, channena satthaṃ āharitaṃ. Tassa kā gati, ko abhisamparāyo’’ti? ‘‘Nanu te, sāriputta, channena bhikkhunā sammukhāyeva anupavajjatā byākatā’’ti? ‘‘Atthi, bhante, pubbajiraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pappajitañhitaṃ (ka.), upavajjitaṃ (ka.), pubbavijjanaṃ, pubbavijjhanaṃ, pubbaviciraṃ (saṃyuttake)]"
      },
      " nāma vajjigāmo. Tatthāyasmato channassa mittakulāni suhajjakulāni upavajjakulānī’’ti. ‘‘Honti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[posanti (ka.)]"
      },
      " hete, sāriputta, channassa bhikkhuno mittakulāni suhajjakulāni upavajjakulāni. Nāhaṃ, sāriputta, ettāvatā ",
      " ‘saupavajjo’ti vadāmi. Yo kho, sāriputta, imañca kāyaṃ nikkhipati aññañca kāyaṃ upādiyati tamahaṃ ‘saupavajjo’ti vadāmi. Taṃ channassa bhikkhuno natthi. ‘Anupavajjo channo bhikkhu satthaṃ āharesī’ti evametaṃ, sāriputta, dhārehī’’ti."
    ],
    "innerText": "394. Atha kho āyasmā channo acirapakkante āyasmante ca sāriputte āyasmante ca mahācunde satthaṃ āharesi. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘āyasmatā, bhante, channena satthaṃ āharitaṃ. Tassa kā gati, ko abhisamparāyo’’ti? ‘‘Nanu te, sāriputta, channena bhikkhunā sammukhāyeva anupavajjatā byākatā’’ti? ‘‘Atthi, bhante, pubbajiraṃ [pappajitañhitaṃ (ka.), upavajjitaṃ (ka.), pubbavijjanaṃ, pubbavijjhanaṃ, pubbaviciraṃ (saṃyuttake)] nāma vajjigāmo. Tatthāyasmato channassa mittakulāni suhajjakulāni upavajjakulānī’’ti. ‘‘Honti [posanti (ka.)] hete, sāriputta, channassa bhikkhuno mittakulāni suhajjakulāni upavajjakulāni. Nāhaṃ, sāriputta, ettāvatā ‘saupavajjo’ti vadāmi. Yo kho, sāriputta, imañca kāyaṃ nikkhipati aññañca kāyaṃ upādiyati tamahaṃ ‘saupavajjo’ti vadāmi. Taṃ channassa bhikkhuno natthi. ‘Anupavajjo channo bhikkhu satthaṃ āharesī’ti evametaṃ, sāriputta, dhārehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idamavoca ",
      " bhagavā. Attamano āyasmā sāriputto bhagavato bhāsitaṃ abhinandīti."
    ],
    "innerText": "Idamavoca bhagavā. Attamano āyasmā sāriputto bhagavato bhāsitaṃ abhinandīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Channovādasuttaṃ niṭṭhitaṃ dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Puṇṇovādasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "395"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā puṇṇo sāyanhasamayaṃ paṭisallānā vuṭṭhito yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā puṇṇo bhagavantaṃ etadavoca – ‘‘sādhu maṃ, bhante, bhagavā saṃkhittena ovādena ovadatu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Tena hi, puṇṇa, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā puṇṇo bhagavato paccassosi. Bhagavā etadavoca –"
    ],
    "innerText": "395. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā puṇṇo sāyanhasamayaṃ paṭisallānā vuṭṭhito yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā puṇṇo bhagavantaṃ etadavoca – ‘‘sādhu maṃ, bhante, bhagavā saṃkhittena ovādena ovadatu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Tena hi, puṇṇa, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā puṇṇo bhagavato paccassosi. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Santi kho, puṇṇa, cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Taṃ ce bhikkhu abhinandati abhivadati ajjhosāya tiṭṭhati. Tassa taṃ abhinandato abhivadato ajjhosāya tiṭṭhato uppajjati nandī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nandi (syā. kaṃ.)]"
      },
      ". ‘Nandīsamudayā dukkhasamudayo, puṇṇā’ti vadāmi."
    ],
    "innerText": "‘‘Santi kho, puṇṇa, cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Taṃ ce bhikkhu abhinandati abhivadati ajjhosāya tiṭṭhati. Tassa taṃ abhinandato abhivadato ajjhosāya tiṭṭhato uppajjati nandī [nandi (syā. kaṃ.)]. ‘Nandīsamudayā dukkhasamudayo, puṇṇā’ti vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Santi kho, puṇṇa, sotaviññeyyā saddā… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā… manoviññeyyā dhammā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Taṃ ce bhikkhu abhinandati abhivadati ajjhosāya tiṭṭhati. Tassa taṃ abhinandato abhivadato ",
      " ajjhosāya tiṭṭhato uppajjati nandī. ‘Nandīsamudayā dukkhasamudayo, puṇṇā’ti vadāmi."
    ],
    "innerText": "‘‘Santi kho, puṇṇa, sotaviññeyyā saddā… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā… manoviññeyyā dhammā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Taṃ ce bhikkhu abhinandati abhivadati ajjhosāya tiṭṭhati. Tassa taṃ abhinandato abhivadato ajjhosāya tiṭṭhato uppajjati nandī. ‘Nandīsamudayā dukkhasamudayo, puṇṇā’ti vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Santi ",
      " ca kho, puṇṇa, cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Taṃ ce bhikkhu nābhinandati nābhivadati nājjhosāya tiṭṭhati. Tassa taṃ anabhinandato anabhivadato anajjhosāya tiṭṭhato nandī nirujjhati. ‘Nandīnirodhā dukkhanirodho, puṇṇā’ti vadāmi."
    ],
    "innerText": "‘‘Santi ca kho, puṇṇa, cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Taṃ ce bhikkhu nābhinandati nābhivadati nājjhosāya tiṭṭhati. Tassa taṃ anabhinandato anabhivadato anajjhosāya tiṭṭhato nandī nirujjhati. ‘Nandīnirodhā dukkhanirodho, puṇṇā’ti vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Santi ",
      " ca kho, puṇṇa, sotaviññeyyā saddā… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā… manoviññeyyā dhammā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā ",
      " rajanīyā. Taṃ ce bhikkhu nābhinandati nābhivadati nājjhosāya tiṭṭhati. Tassa taṃ anabhinandato anabhivadato anajjhosāya tiṭṭhato nandī nirujjhati. ‘Nandīnirodhā dukkhanirodho, puṇṇā’ti vadāmi."
    ],
    "innerText": "‘‘Santi ca kho, puṇṇa, sotaviññeyyā saddā… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā… manoviññeyyā dhammā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Taṃ ce bhikkhu nābhinandati nābhivadati nājjhosāya tiṭṭhati. Tassa taṃ anabhinandato anabhivadato anajjhosāya tiṭṭhato nandī nirujjhati. ‘Nandīnirodhā dukkhanirodho, puṇṇā’ti vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Iminā ca tvaṃ puṇṇa, mayā saṃkhittena ovādena ovadito katarasmiṃ janapade viharissasī’’ti? ‘‘Imināhaṃ, bhante, bhagavatā saṃkhittena ovādena ovadito, atthi sunāparanto nāma janapado, tatthāhaṃ viharissāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "396"
      },
      ". ‘‘Caṇḍā kho, puṇṇa, sunāparantakā manussā; pharusā kho, puṇṇa, sunāparantakā manussā. Sace taṃ, puṇṇa, sunāparantakā manussā akkosissanti paribhāsissanti, tattha te, puṇṇa, kinti bhavissatī’’ti? ‘‘Sace maṃ, bhante, sunāparantakā manussā akkosissanti paribhāsissanti, tattha me evaṃ bhavissati – ‘bhaddakā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhadrakā (ka.)]"
      },
      " vatime sunāparantakā ",
      " manussā, subhaddakā vatime sunāparantakā manussā, yaṃ me nayime pāṇinā pahāraṃ dentī’ti. Evamettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[evammettha (?)]"
      },
      ", bhagavā, bhavissati; evamettha, sugata, bhavissatī’’ti."
    ],
    "innerText": "396. ‘‘Caṇḍā kho, puṇṇa, sunāparantakā manussā; pharusā kho, puṇṇa, sunāparantakā manussā. Sace taṃ, puṇṇa, sunāparantakā manussā akkosissanti paribhāsissanti, tattha te, puṇṇa, kinti bhavissatī’’ti? ‘‘Sace maṃ, bhante, sunāparantakā manussā akkosissanti paribhāsissanti, tattha me evaṃ bhavissati – ‘bhaddakā [bhadrakā (ka.)] vatime sunāparantakā manussā, subhaddakā vatime sunāparantakā manussā, yaṃ me nayime pāṇinā pahāraṃ dentī’ti. Evamettha [evammettha (?)], bhagavā, bhavissati; evamettha, sugata, bhavissatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace pana te, puṇṇa, sunāparantakā manussā pāṇinā pahāraṃ dassanti, tattha pana te, puṇṇa, kinti bhavissatī’’ti? ‘‘Sace me, bhante, sunāparantakā manussā pāṇinā pahāraṃ dassanti, tattha me evaṃ bhavissati – ‘bhaddakā vatime sunāparantakā manussā, subhaddakā vatime sunāparantakā manussā, yaṃ me nayime leḍḍunā pahāraṃ dentī’ti. Evamettha, bhagavā, bhavissati; evamettha, sugata, bhavissatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace pana te, puṇṇa, sunāparantakā manussā leḍḍunā pahāraṃ dassanti, tattha pana te, puṇṇa, kinti bhavissatī’’ti? ‘‘Sace me, bhante, sunāparantakā manussā ",
      " leḍḍunā pahāraṃ dassanti, tattha me evaṃ bhavissati – ‘bhaddakā vatime sunāparantakā manussā, subhaddakā vatime sunāparantakā manussā, yaṃ me nayime daṇḍena pahāraṃ dentī’ti. Evamettha, bhagavā, bhavissati; evamettha, sugata, bhavissatī’’ti."
    ],
    "innerText": "‘‘Sace pana te, puṇṇa, sunāparantakā manussā leḍḍunā pahāraṃ dassanti, tattha pana te, puṇṇa, kinti bhavissatī’’ti? ‘‘Sace me, bhante, sunāparantakā manussā leḍḍunā pahāraṃ dassanti, tattha me evaṃ bhavissati – ‘bhaddakā vatime sunāparantakā manussā, subhaddakā vatime sunāparantakā manussā, yaṃ me nayime daṇḍena pahāraṃ dentī’ti. Evamettha, bhagavā, bhavissati; evamettha, sugata, bhavissatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace ",
      " pana te, puṇṇa, sunāparantakā manussā daṇḍena pahāraṃ dassanti, tattha pana te, puṇṇa, kinti bhavissatī’’ti? ‘‘Sace me, bhante, sunāparantakā manussā daṇḍena pahāraṃ dassanti, tattha me evaṃ bhavissati – ‘bhaddakā vatime sunāparantakā manussā, subhaddakā vatime ",
      " sunāparantakā manussā, yaṃ me nayime satthena pahāraṃ dentī’ti. Evamettha, bhagavā, bhavissati; evamettha, sugata, bhavissatī’’ti."
    ],
    "innerText": "‘‘Sace pana te, puṇṇa, sunāparantakā manussā daṇḍena pahāraṃ dassanti, tattha pana te, puṇṇa, kinti bhavissatī’’ti? ‘‘Sace me, bhante, sunāparantakā manussā daṇḍena pahāraṃ dassanti, tattha me evaṃ bhavissati – ‘bhaddakā vatime sunāparantakā manussā, subhaddakā vatime sunāparantakā manussā, yaṃ me nayime satthena pahāraṃ dentī’ti. Evamettha, bhagavā, bhavissati; evamettha, sugata, bhavissatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace pana te, puṇṇa, sunāparantakā manussā satthena pahāraṃ dassanti, tattha pana te, puṇṇa, kinti bhavissatī’’ti? ‘‘Sace me, bhante, sunāparantakā manussā satthena pahāraṃ dassanti, tattha me evaṃ bhavissati – ‘bhaddakā vatime sunāparantakā manussā, subhaddakā vatime sunāparantakā manussā, yaṃ maṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yaṃ me (sī. pī. ka.)]"
      },
      " nayime tiṇhena satthena jīvitā voropentī’ti. Evamettha, bhagavā, bhavissati; evamettha, sugata, bhavissatī’’ti."
    ],
    "innerText": "‘‘Sace pana te, puṇṇa, sunāparantakā manussā satthena pahāraṃ dassanti, tattha pana te, puṇṇa, kinti bhavissatī’’ti? ‘‘Sace me, bhante, sunāparantakā manussā satthena pahāraṃ dassanti, tattha me evaṃ bhavissati – ‘bhaddakā vatime sunāparantakā manussā, subhaddakā vatime sunāparantakā manussā, yaṃ maṃ [yaṃ me (sī. pī. ka.)] nayime tiṇhena satthena jīvitā voropentī’ti. Evamettha, bhagavā, bhavissati; evamettha, sugata, bhavissatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace pana taṃ, puṇṇa, sunāparantakā manussā tiṇhena satthena jīvitā voropessanti, tattha pana te, puṇṇa, kinti bhavissatī’’ti? ‘‘Sace maṃ, bhante, sunāparantakā manussā tiṇhena satthena jīvitā voropessanti, tattha me evaṃ bhavissati – ‘santi kho bhagavato sāvakā kāye ca jīvite ca aṭṭīyamānā harāyamānā jigucchamānā satthahārakaṃ pariyesanti. Taṃ me idaṃ apariyiṭṭhaṃyeva satthahārakaṃ laddha’nti. Evamettha, bhagavā, bhavissati; evamettha, sugata, bhavissatī’’ti. ‘‘Sādhu, sādhu, puṇṇa! Sakkhissasi kho tvaṃ, puṇṇa, iminā damūpasamena samannāgato sunāparantasmiṃ janapade viharituṃ. Yassadāni tvaṃ, puṇṇa, kālaṃ maññasī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "397"
      },
      ". Atha kho āyasmā puṇṇo bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā ",
      " padakkhiṇaṃ katvā senāsanaṃ saṃsāmetvā pattacīvaramādāya yena sunāparanto janapado tena ",
      " cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena sunāparanto janapado tadavasari. Tatra sudaṃ āyasmā puṇṇo sunāparantasmiṃ janapade viharati. Atha kho āyasmā puṇṇo tenevantaravassena pañcamattāni upāsakasatāni paṭivedesi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṭipādesi (sī. pī.), paṭidesesi (syā. kaṃ.)]"
      },
      ", tenevantaravassena pañcamattāni upāsikasatāni paṭivedesi, tenevantaravassena tisso vijjā sacchākāsi. Atha kho āyasmā puṇṇo aparena samayena parinibbāyi."
    ],
    "innerText": "397. Atha kho āyasmā puṇṇo bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā senāsanaṃ saṃsāmetvā pattacīvaramādāya yena sunāparanto janapado tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena sunāparanto janapado tadavasari. Tatra sudaṃ āyasmā puṇṇo sunāparantasmiṃ janapade viharati. Atha kho āyasmā puṇṇo tenevantaravassena pañcamattāni upāsakasatāni paṭivedesi [paṭipādesi (sī. pī.), paṭidesesi (syā. kaṃ.)], tenevantaravassena pañcamattāni upāsikasatāni paṭivedesi, tenevantaravassena tisso vijjā sacchākāsi. Atha kho āyasmā puṇṇo aparena samayena parinibbāyi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘yo so, bhante, puṇṇo nāma ",
      " kulaputto bhagavatā saṃkhittena ovādena ovadito so kālaṅkato. Tassa kā gati, ko abhisamparāyo’’ti? ‘‘Paṇḍito, bhikkhave, puṇṇo kulaputto paccapādi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saccavādī dhammavādī (ka.)]"
      },
      " dhammassānudhammaṃ, na ca maṃ dhammādhikaraṇaṃ viheṭhesi. Parinibbuto, bhikkhave, puṇṇo kulaputto’’ti."
    ],
    "innerText": "Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘yo so, bhante, puṇṇo nāma kulaputto bhagavatā saṃkhittena ovādena ovadito so kālaṅkato. Tassa kā gati, ko abhisamparāyo’’ti? ‘‘Paṇḍito, bhikkhave, puṇṇo kulaputto paccapādi [saccavādī dhammavādī (ka.)] dhammassānudhammaṃ, na ca maṃ dhammādhikaraṇaṃ viheṭhesi. Parinibbuto, bhikkhave, puṇṇo kulaputto’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Puṇṇovādasuttaṃ niṭṭhitaṃ tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Nandakovādasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "398"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho mahāpajāpatigotamī pañcamattehi bhikkhunisatehi saddhiṃ yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho mahāpajāpatigotamī bhagavantaṃ etadavoca – ‘‘ovadatu, bhante, bhagavā bhikkhuniyo; anusāsatu, bhante, bhagavā bhikkhuniyo; karotu, bhante, bhagavā bhikkhunīnaṃ dhammiṃ katha’’nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dhammikathanti (syā. kaṃ. ka.)]"
      },
      "."
    ],
    "innerText": "398. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho mahāpajāpatigotamī pañcamattehi bhikkhunisatehi saddhiṃ yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho mahāpajāpatigotamī bhagavantaṃ etadavoca – ‘‘ovadatu, bhante, bhagavā bhikkhuniyo; anusāsatu, bhante, bhagavā bhikkhuniyo; karotu, bhante, bhagavā bhikkhunīnaṃ dhammiṃ katha’’nti [dhammikathanti (syā. kaṃ. ka.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena therā bhikkhū bhikkhuniyo ovadanti pariyāyena. Āyasmā nandako na icchati bhikkhuniyo ovadituṃ pariyāyena. Atha ",
      " kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘kassa nu kho, ānanda, ajja pariyāyo bhikkhuniyo ovadituṃ pariyāyenā’’ti? ‘‘Sabbeheva, bhante, kato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nandakassa bhante (sī. pī.)]"
      },
      " pariyāyo bhikkhuniyo ovadituṃ pariyāyena. Ayaṃ, bhante, āyasmā nandako na icchati bhikkhuniyo ovadituṃ pariyāyenā’’ti."
    ],
    "innerText": "Tena kho pana samayena therā bhikkhū bhikkhuniyo ovadanti pariyāyena. Āyasmā nandako na icchati bhikkhuniyo ovadituṃ pariyāyena. Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘kassa nu kho, ānanda, ajja pariyāyo bhikkhuniyo ovadituṃ pariyāyenā’’ti? ‘‘Sabbeheva, bhante, kato [nandakassa bhante (sī. pī.)] pariyāyo bhikkhuniyo ovadituṃ pariyāyena. Ayaṃ, bhante, āyasmā nandako na icchati bhikkhuniyo ovadituṃ pariyāyenā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā āyasmantaṃ nandakaṃ āmantesi – ‘‘ovada, nandaka, bhikkhuniyo; anusāsa, nandaka, bhikkhuniyo; karohi tvaṃ, brāhmaṇa, bhikkhunīnaṃ dhammiṃ katha’’nti. ‘‘Evaṃ, bhante’’ti kho āyasmā ",
      " nandako bhagavato paṭissutvā ",
      " pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi. Sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto attadutiyo yena rājakārāmo tenupasaṅkami. Addasaṃsu kho tā bhikkhuniyo āyasmantaṃ nandakaṃ dūratova āgacchantaṃ. Disvāna āsanaṃ paññāpesuṃ, udakañca pādānaṃ upaṭṭhapesuṃ. Nisīdi kho āyasmā nandako paññatte āsane. Nisajja pāde pakkhālesi. Tāpi kho bhikkhuniyo āyasmantaṃ nandakaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho tā bhikkhuniyo āyasmā nandako etadavoca – ‘‘paṭipucchakathā kho, bhaginiyo, bhavissati. Tattha ājānantīhi – ‘ājānāmā’ tissa vacanīyaṃ, na ājānantīhi – ‘na ājānāmā’ tissa vacanīyaṃ. Yassā vā panassa kaṅkhā vā vimati vā ",
      " ahameva tattha paṭipucchitabbo – ‘idaṃ, bhante, kathaṃ; imassa kvattho’’’ti? ‘‘Ettakenapi mayaṃ, bhante, ayyassa nandakassa attamanā abhiraddhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhinandāma (syā. kaṃ.)]"
      },
      " yaṃ no ayyo nandako pavāretī’’ti."
    ],
    "innerText": "Atha kho bhagavā āyasmantaṃ nandakaṃ āmantesi – ‘‘ovada, nandaka, bhikkhuniyo; anusāsa, nandaka, bhikkhuniyo; karohi tvaṃ, brāhmaṇa, bhikkhunīnaṃ dhammiṃ katha’’nti. ‘‘Evaṃ, bhante’’ti kho āyasmā nandako bhagavato paṭissutvā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi. Sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto attadutiyo yena rājakārāmo tenupasaṅkami. Addasaṃsu kho tā bhikkhuniyo āyasmantaṃ nandakaṃ dūratova āgacchantaṃ. Disvāna āsanaṃ paññāpesuṃ, udakañca pādānaṃ upaṭṭhapesuṃ. Nisīdi kho āyasmā nandako paññatte āsane. Nisajja pāde pakkhālesi. Tāpi kho bhikkhuniyo āyasmantaṃ nandakaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho tā bhikkhuniyo āyasmā nandako etadavoca – ‘‘paṭipucchakathā kho, bhaginiyo, bhavissati. Tattha ājānantīhi – ‘ājānāmā’ tissa vacanīyaṃ, na ājānantīhi – ‘na ājānāmā’ tissa vacanīyaṃ. Yassā vā panassa kaṅkhā vā vimati vā ahameva tattha paṭipucchitabbo – ‘idaṃ, bhante, kathaṃ; imassa kvattho’’’ti? ‘‘Ettakenapi mayaṃ, bhante, ayyassa nandakassa attamanā abhiraddhā [abhinandāma (syā. kaṃ.)] yaṃ no ayyo nandako pavāretī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "399"
      },
      ". ‘‘Taṃ kiṃ maññatha, bhaginiyo, cakkhu niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ ",
      ", bhante’’. ‘‘Taṃ kiṃ maññatha, bhaginiyo, sotaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… ghānaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’… ‘‘jivhā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’… ‘‘kāyo nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’… ‘‘mano nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ ",
      ", kallaṃ ",
      " nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Pubbeva no etaṃ, bhante, yathābhūtaṃ sammappaññāya sudiṭṭhaṃ – ‘itipime cha ajjhattikā āyatanā aniccā’’’ti. ‘‘Sādhu, sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
    ],
    "innerText": "399. ‘‘Taṃ kiṃ maññatha, bhaginiyo, cakkhu niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ , bhante’’. ‘‘Taṃ kiṃ maññatha, bhaginiyo, sotaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… ghānaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’… ‘‘jivhā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’… ‘‘kāyo nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’… ‘‘mano nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ , kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Pubbeva no etaṃ, bhante, yathābhūtaṃ sammappaññāya sudiṭṭhaṃ – ‘itipime cha ajjhattikā āyatanā aniccā’’’ti. ‘‘Sādhu, sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "400"
      },
      ". ‘‘Taṃ kiṃ maññatha, bhaginiyo, rūpā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, bhaginiyo, saddā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante…pe… gandhā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’… ‘‘rasā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’… ‘‘phoṭṭhabbā niccā vā aniccā vā’’ti? ‘‘Aniccā ",
      ", bhante’’… ‘‘dhammā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Pubbeva no etaṃ, bhante, yathābhūtaṃ sammappaññāya sudiṭṭhaṃ – ‘itipime cha bāhirā āyatanā aniccā’’’ti ",
      ". ‘‘Sādhu, sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
    ],
    "innerText": "400. ‘‘Taṃ kiṃ maññatha, bhaginiyo, rūpā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, bhaginiyo, saddā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante…pe… gandhā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’… ‘‘rasā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’… ‘‘phoṭṭhabbā niccā vā aniccā vā’’ti? ‘‘Aniccā , bhante’’… ‘‘dhammā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Pubbeva no etaṃ, bhante, yathābhūtaṃ sammappaññāya sudiṭṭhaṃ – ‘itipime cha bāhirā āyatanā aniccā’’’ti . ‘‘Sādhu, sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "401"
      },
      ". ‘‘Taṃ kiṃ maññatha, bhaginiyo, cakkhuviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ ",
      " kiṃ maññatha, bhaginiyo, sotaviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… ghānaviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’… ‘‘jivhāviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’… ‘‘kāyaviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’… ‘‘manoviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vāti’’? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso ",
      " me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Pubbeva no etaṃ, bhante, yathābhūtaṃ sammappaññāya sudiṭṭhaṃ – ‘itipime cha viññāṇakāyā aniccā’’’ti. ‘‘Sādhu, sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
    ],
    "innerText": "401. ‘‘Taṃ kiṃ maññatha, bhaginiyo, cakkhuviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, bhaginiyo, sotaviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… ghānaviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’… ‘‘jivhāviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’… ‘‘kāyaviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’… ‘‘manoviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vāti’’? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Pubbeva no etaṃ, bhante, yathābhūtaṃ sammappaññāya sudiṭṭhaṃ – ‘itipime cha viññāṇakāyā aniccā’’’ti. ‘‘Sādhu, sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "402"
      },
      ". ‘‘Seyyathāpi ",
      ", bhaginiyo, telappadīpassa jhāyato telampi aniccaṃ vipariṇāmadhammaṃ, vaṭṭipi aniccā vipariṇāmadhammā, accipi aniccā vipariṇāmadhammā, ābhāpi aniccā vipariṇāmadhammā. Yo nu kho, bhaginiyo, evaṃ vadeyya – ‘amussa telappadīpassa jhāyato telampi aniccaṃ vipariṇāmadhammaṃ, vaṭṭipi aniccā vipariṇāmadhammā, accipi aniccā vipariṇāmadhammā; yā ca khvāssa ābhā sā niccā dhuvā sassatā avipariṇāmadhammā’ti; sammā nu kho so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Amussa hi, bhante, telappadīpassa jhāyato telampi aniccaṃ vipariṇāmadhammaṃ, vaṭṭipi aniccā vipariṇāmadhammā, accipi aniccā vipariṇāmadhammā; pagevassa ābhā aniccā vipariṇāmadhammā’’ti. ‘‘Evameva kho, bhaginiyo, yo nu kho evaṃ vadeyya – ‘cha khome ajjhattikā āyatanā aniccā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[aniccā vipariṇāmadhammā (?)]"
      },
      "; yañca kho cha ajjhattike āyatane paṭicca paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā taṃ niccaṃ dhuvaṃ sassataṃ avipariṇāmadhamma’nti; sammā ",
      " nu kho so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Tajjaṃ ",
      " tajjaṃ, bhante, paccayaṃ paṭicca tajjā tajjā vedanā uppajjanti. Tajjassa ",
      " tajjassa paccayassa nirodhā tajjā tajjā vedanā nirujjhantī’’ti. ‘‘Sādhu, sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
    ],
    "innerText": "402. ‘‘Seyyathāpi , bhaginiyo, telappadīpassa jhāyato telampi aniccaṃ vipariṇāmadhammaṃ, vaṭṭipi aniccā vipariṇāmadhammā, accipi aniccā vipariṇāmadhammā, ābhāpi aniccā vipariṇāmadhammā. Yo nu kho, bhaginiyo, evaṃ vadeyya – ‘amussa telappadīpassa jhāyato telampi aniccaṃ vipariṇāmadhammaṃ, vaṭṭipi aniccā vipariṇāmadhammā, accipi aniccā vipariṇāmadhammā; yā ca khvāssa ābhā sā niccā dhuvā sassatā avipariṇāmadhammā’ti; sammā nu kho so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Amussa hi, bhante, telappadīpassa jhāyato telampi aniccaṃ vipariṇāmadhammaṃ, vaṭṭipi aniccā vipariṇāmadhammā, accipi aniccā vipariṇāmadhammā; pagevassa ābhā aniccā vipariṇāmadhammā’’ti. ‘‘Evameva kho, bhaginiyo, yo nu kho evaṃ vadeyya – ‘cha khome ajjhattikā āyatanā aniccā [aniccā vipariṇāmadhammā (?)]; yañca kho cha ajjhattike āyatane paṭicca paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā taṃ niccaṃ dhuvaṃ sassataṃ avipariṇāmadhamma’nti; sammā nu kho so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Tajjaṃ tajjaṃ, bhante, paccayaṃ paṭicca tajjā tajjā vedanā uppajjanti. Tajjassa tajjassa paccayassa nirodhā tajjā tajjā vedanā nirujjhantī’’ti. ‘‘Sādhu, sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "403"
      },
      ". ‘‘Seyyathāpi, bhaginiyo, mahato rukkhassa tiṭṭhato sāravato mūlampi aniccaṃ vipariṇāmadhammaṃ, khandhopi anicco vipariṇāmadhammo, sākhāpalāsampi aniccaṃ vipariṇāmadhammaṃ, chāyāpi aniccā vipariṇāmadhammā. Yo nu kho, bhaginiyo, evaṃ vadeyya – ‘amussa mahato rukkhassa tiṭṭhato sāravato mūlampi aniccaṃ vipariṇāmadhammaṃ, khandhopi anicco vipariṇāmadhammo, sākhāpalāsampi aniccaṃ vipariṇāmadhammaṃ, yā ca khvāssa chāyā sā niccā dhuvā sassatā avipariṇāmadhammā’ti; sammā nu kho so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Amussa hi, bhante, mahato rukkhassa tiṭṭhato sāravato mūlampi aniccaṃ vipariṇāmadhammaṃ, khandhopi anicco vipariṇāmadhammo, sākhāpalāsampi aniccaṃ vipariṇāmadhammaṃ; pagevassa chāyā aniccā vipariṇāmadhammā’’ti. ‘‘Evameva kho, bhaginiyo, yo nu kho evaṃ vadeyya – ‘cha khome bāhirā āyatanā ",
      " aniccā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[aniccā vipariṇāmadhammā (sī. pī.)]"
      },
      ". Yañca kho cha bāhire āyatane paṭicca paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā taṃ niccaṃ dhuvaṃ sassataṃ avipariṇāmadhamma’nti; sammā nu kho so, bhaginiyo, vadamāno ",
      " vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Tajjaṃ tajjaṃ, bhante, paccayaṃ paṭicca tajjā tajjā vedanā uppajjanti. Tajjassa tajjassa paccayassa nirodhā tajjā tajjā vedanā nirujjhantī’’ti. ‘‘Sādhu, sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
    ],
    "innerText": "403. ‘‘Seyyathāpi, bhaginiyo, mahato rukkhassa tiṭṭhato sāravato mūlampi aniccaṃ vipariṇāmadhammaṃ, khandhopi anicco vipariṇāmadhammo, sākhāpalāsampi aniccaṃ vipariṇāmadhammaṃ, chāyāpi aniccā vipariṇāmadhammā. Yo nu kho, bhaginiyo, evaṃ vadeyya – ‘amussa mahato rukkhassa tiṭṭhato sāravato mūlampi aniccaṃ vipariṇāmadhammaṃ, khandhopi anicco vipariṇāmadhammo, sākhāpalāsampi aniccaṃ vipariṇāmadhammaṃ, yā ca khvāssa chāyā sā niccā dhuvā sassatā avipariṇāmadhammā’ti; sammā nu kho so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Amussa hi, bhante, mahato rukkhassa tiṭṭhato sāravato mūlampi aniccaṃ vipariṇāmadhammaṃ, khandhopi anicco vipariṇāmadhammo, sākhāpalāsampi aniccaṃ vipariṇāmadhammaṃ; pagevassa chāyā aniccā vipariṇāmadhammā’’ti. ‘‘Evameva kho, bhaginiyo, yo nu kho evaṃ vadeyya – ‘cha khome bāhirā āyatanā aniccā [aniccā vipariṇāmadhammā (sī. pī.)]. Yañca kho cha bāhire āyatane paṭicca paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā taṃ niccaṃ dhuvaṃ sassataṃ avipariṇāmadhamma’nti; sammā nu kho so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Tajjaṃ tajjaṃ, bhante, paccayaṃ paṭicca tajjā tajjā vedanā uppajjanti. Tajjassa tajjassa paccayassa nirodhā tajjā tajjā vedanā nirujjhantī’’ti. ‘‘Sādhu, sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "404"
      },
      ". ‘‘Seyyathāpi, bhaginiyo, dakkho goghātako vā goghātakantevāsī vā gāviṃ vadhitvā tiṇhena govikantanena gāviṃ saṅkanteyya anupahacca antaraṃ maṃsakāyaṃ anupahacca bāhiraṃ cammakāyaṃ. Yaṃ yadeva tattha antarā vilimaṃsaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vilimaṃ (sī. pī. ka.)]"
      },
      " antarā nhāru antarā bandhanaṃ taṃ tadeva tiṇhena govikantanena ",
      " sañchindeyya saṅkanteyya sampakanteyya samparikanteyya. Sañchinditvā saṅkantitvā sampakantitvā samparikantitvā vidhunitvā bāhiraṃ cammakāyaṃ teneva cammena taṃ gāviṃ paṭicchādetvā evaṃ vadeyya – ‘tathevāyaṃ gāvī saṃyuttā imināva cammenā’ti; sammā nu kho ",
      " so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Amu hi, bhante, dakkho goghātako vā goghātakantevāsī vā gāviṃ vadhitvā tiṇhena govikantanena gāviṃ saṅkanteyya anupahacca antaraṃ maṃsakāyaṃ anupahacca bāhiraṃ cammakāyaṃ. Yaṃ yadeva tattha antarā vilimaṃsaṃ antarā nhāru antarā bandhanaṃ taṃ tadeva tiṇhena govikantanena sañchindeyya saṅkanteyya sampakanteyya samparikanteyya. Sañchinditvā saṅkantitvā sampakantitvā samparikantitvā vidhunitvā bāhiraṃ cammakāyaṃ teneva ",
      " cammena taṃ gāviṃ paṭicchādetvā kiñcāpi so evaṃ vadeyya – ‘tathevāyaṃ gāvī saṃyuttā imināva cammenā’ti; atha kho sā gāvī visaṃyuttā teneva cammenā’’ti."
    ],
    "innerText": "404. ‘‘Seyyathāpi, bhaginiyo, dakkho goghātako vā goghātakantevāsī vā gāviṃ vadhitvā tiṇhena govikantanena gāviṃ saṅkanteyya anupahacca antaraṃ maṃsakāyaṃ anupahacca bāhiraṃ cammakāyaṃ. Yaṃ yadeva tattha antarā vilimaṃsaṃ [vilimaṃ (sī. pī. ka.)] antarā nhāru antarā bandhanaṃ taṃ tadeva tiṇhena govikantanena sañchindeyya saṅkanteyya sampakanteyya samparikanteyya. Sañchinditvā saṅkantitvā sampakantitvā samparikantitvā vidhunitvā bāhiraṃ cammakāyaṃ teneva cammena taṃ gāviṃ paṭicchādetvā evaṃ vadeyya – ‘tathevāyaṃ gāvī saṃyuttā imināva cammenā’ti; sammā nu kho so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Amu hi, bhante, dakkho goghātako vā goghātakantevāsī vā gāviṃ vadhitvā tiṇhena govikantanena gāviṃ saṅkanteyya anupahacca antaraṃ maṃsakāyaṃ anupahacca bāhiraṃ cammakāyaṃ. Yaṃ yadeva tattha antarā vilimaṃsaṃ antarā nhāru antarā bandhanaṃ taṃ tadeva tiṇhena govikantanena sañchindeyya saṅkanteyya sampakanteyya samparikanteyya. Sañchinditvā saṅkantitvā sampakantitvā samparikantitvā vidhunitvā bāhiraṃ cammakāyaṃ teneva cammena taṃ gāviṃ paṭicchādetvā kiñcāpi so evaṃ vadeyya – ‘tathevāyaṃ gāvī saṃyuttā imināva cammenā’ti; atha kho sā gāvī visaṃyuttā teneva cammenā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Upamā kho me ayaṃ, bhaginiyo, katā atthassa viññāpanāya. Ayamevettha attho; ‘antarā maṃsakāyo’ti kho, bhaginiyo, channetaṃ ajjhattikānaṃ āyatanānaṃ adhivacanaṃ; ‘bāhiro cammakāyo’ti kho bhaginiyo, channetaṃ bāhirānaṃ āyatanānaṃ adhivacanaṃ; ‘antarā vilimaṃsaṃ, antarā nhāru, antarā bandhana’nti kho, bhaginiyo, nandīrāgassetaṃ adhivacanaṃ; ‘tiṇhaṃ ",
      " govikantana’nti kho, bhaginiyo, ariyāyetaṃ paññāya adhivacanaṃ; yāyaṃ ariyā paññā antarā kilesaṃ antarā saṃyojanaṃ antarā bandhanaṃ sañchindati saṅkantati sampakantati samparikantati."
    ],
    "innerText": "‘‘Upamā kho me ayaṃ, bhaginiyo, katā atthassa viññāpanāya. Ayamevettha attho; ‘antarā maṃsakāyo’ti kho, bhaginiyo, channetaṃ ajjhattikānaṃ āyatanānaṃ adhivacanaṃ; ‘bāhiro cammakāyo’ti kho bhaginiyo, channetaṃ bāhirānaṃ āyatanānaṃ adhivacanaṃ; ‘antarā vilimaṃsaṃ, antarā nhāru, antarā bandhana’nti kho, bhaginiyo, nandīrāgassetaṃ adhivacanaṃ; ‘tiṇhaṃ govikantana’nti kho, bhaginiyo, ariyāyetaṃ paññāya adhivacanaṃ; yāyaṃ ariyā paññā antarā kilesaṃ antarā saṃyojanaṃ antarā bandhanaṃ sañchindati saṅkantati sampakantati samparikantati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "405"
      },
      ". ‘‘Satta kho panime, bhaginiyo, bojjhaṅgā, yesaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Katame satta? Idha, bhaginiyo, bhikkhu satisambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ, dhammavicayasambojjhaṅgaṃ bhāveti…pe… vīriyasambojjhaṅgaṃ bhāveti… pītisambojjhaṅgaṃ bhāveti… passaddhisambojjhaṅgaṃ bhāveti… samādhisambojjhaṅgaṃ bhāveti… upekkhāsambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ ",
      " nirodhanissitaṃ vossaggapariṇāmiṃ. Ime kho, bhaginiyo, satta bojjhaṅgā, yesaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti."
    ],
    "innerText": "405. ‘‘Satta kho panime, bhaginiyo, bojjhaṅgā, yesaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Katame satta? Idha, bhaginiyo, bhikkhu satisambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ, dhammavicayasambojjhaṅgaṃ bhāveti…pe… vīriyasambojjhaṅgaṃ bhāveti… pītisambojjhaṅgaṃ bhāveti… passaddhisambojjhaṅgaṃ bhāveti… samādhisambojjhaṅgaṃ bhāveti… upekkhāsambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Ime kho, bhaginiyo, satta bojjhaṅgā, yesaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "406"
      },
      ". Atha ",
      " kho āyasmā nandako tā bhikkhuniyo iminā ovādena ovaditvā uyyojesi – ‘‘gacchatha, bhaginiyo; kālo’’ti. Atha kho tā bhikkhuniyo āyasmato nandakassa bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā āyasmantaṃ nandakaṃ abhivādetvā padakkhiṇaṃ katvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho tā bhikkhuniyo bhagavā etadavoca – ‘‘gacchatha, bhikkhuniyo; kālo’’ti. Atha kho tā bhikkhuniyo bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkamiṃsu. Atha kho bhagavā acirapakkantīsu tāsu bhikkhunīsu bhikkhū āmantesi – ‘‘seyyathāpi, bhikkhave, tadahuposathe cātuddase na hoti bahunojanassa kaṅkhā vā vimati vā – ‘ūno nu kho cando, puṇṇo nu kho cando’ti, atha kho ūno candotveva hoti. Evameva kho, bhikkhave, tā bhikkhuniyo nandakassa dhammadesanāya attamanā honti no ca kho paripuṇṇasaṅkappā’’ti."
    ],
    "innerText": "406. Atha kho āyasmā nandako tā bhikkhuniyo iminā ovādena ovaditvā uyyojesi – ‘‘gacchatha, bhaginiyo; kālo’’ti. Atha kho tā bhikkhuniyo āyasmato nandakassa bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā āyasmantaṃ nandakaṃ abhivādetvā padakkhiṇaṃ katvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho tā bhikkhuniyo bhagavā etadavoca – ‘‘gacchatha, bhikkhuniyo; kālo’’ti. Atha kho tā bhikkhuniyo bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkamiṃsu. Atha kho bhagavā acirapakkantīsu tāsu bhikkhunīsu bhikkhū āmantesi – ‘‘seyyathāpi, bhikkhave, tadahuposathe cātuddase na hoti bahunojanassa kaṅkhā vā vimati vā – ‘ūno nu kho cando, puṇṇo nu kho cando’ti, atha kho ūno candotveva hoti. Evameva kho, bhikkhave, tā bhikkhuniyo nandakassa dhammadesanāya attamanā honti no ca kho paripuṇṇasaṅkappā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "407"
      },
      ". Atha kho bhagavā āyasmantaṃ nandakaṃ āmantesi – ‘‘tena hi tvaṃ, nandaka, svepi tā bhikkhuniyo tenevovādena ovadeyyāsī’’ti. ‘‘Evaṃ ",
      ", bhante’’ti kho āyasmā nandako ",
      " bhagavato paccassosi. Atha kho āyasmā nandako tassā rattiyā accayena pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi. Sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto attadutiyo yena rājakārāmo tenupasaṅkami. Addasaṃsu kho tā bhikkhuniyo āyasmantaṃ nandakaṃ dūratova āgacchantaṃ. Disvāna āsanaṃ paññāpesuṃ, udakañca pādānaṃ upaṭṭhapesuṃ. Nisīdi kho āyasmā nandako paññatte āsane. Nisajja pāde pakkhālesi. Tāpi kho bhikkhuniyo āyasmantaṃ nandakaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho tā bhikkhuniyo āyasmā nandako etadavoca – ‘‘paṭipucchakathā kho, bhaginiyo, bhavissati. Tattha ājānantīhi ‘ājānāmā’ tissa vacanīyaṃ, na ājānantīhi ‘na ājānāmā’ tissa vacanīyaṃ. Yassā vā panassa kaṅkhā vā vimati vā, ahameva tattha paṭipucchitabbo ",
      " – ‘idaṃ, bhante, kathaṃ; imassa kvattho’’’ti. ‘‘Ettakenapi mayaṃ, bhante, ayyassa nandakassa attamanā abhiraddhā yaṃ no ayyo nandako pavāretī’’ti."
    ],
    "innerText": "407. Atha kho bhagavā āyasmantaṃ nandakaṃ āmantesi – ‘‘tena hi tvaṃ, nandaka, svepi tā bhikkhuniyo tenevovādena ovadeyyāsī’’ti. ‘‘Evaṃ , bhante’’ti kho āyasmā nandako bhagavato paccassosi. Atha kho āyasmā nandako tassā rattiyā accayena pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi. Sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto attadutiyo yena rājakārāmo tenupasaṅkami. Addasaṃsu kho tā bhikkhuniyo āyasmantaṃ nandakaṃ dūratova āgacchantaṃ. Disvāna āsanaṃ paññāpesuṃ, udakañca pādānaṃ upaṭṭhapesuṃ. Nisīdi kho āyasmā nandako paññatte āsane. Nisajja pāde pakkhālesi. Tāpi kho bhikkhuniyo āyasmantaṃ nandakaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho tā bhikkhuniyo āyasmā nandako etadavoca – ‘‘paṭipucchakathā kho, bhaginiyo, bhavissati. Tattha ājānantīhi ‘ājānāmā’ tissa vacanīyaṃ, na ājānantīhi ‘na ājānāmā’ tissa vacanīyaṃ. Yassā vā panassa kaṅkhā vā vimati vā, ahameva tattha paṭipucchitabbo – ‘idaṃ, bhante, kathaṃ; imassa kvattho’’’ti. ‘‘Ettakenapi mayaṃ, bhante, ayyassa nandakassa attamanā abhiraddhā yaṃ no ayyo nandako pavāretī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "408"
      },
      ". ‘‘Taṃ kiṃ maññatha, bhaginiyo, cakkhu niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me ",
      " attā’’’ti? ‘‘No hetaṃ ",
      ", bhante’’. ‘‘Taṃ kiṃ maññatha, bhaginiyo, sotaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… ghānaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante… jivhā… kāyo… mano nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Pubbeva no etaṃ, bhante, yathābhūtaṃ sammappaññāya sudiṭṭhaṃ – ‘itipime cha ajjhattikā āyatanā aniccā’’’ti. ‘‘Sādhu sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
    ],
    "innerText": "408. ‘‘Taṃ kiṃ maññatha, bhaginiyo, cakkhu niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ , bhante’’. ‘‘Taṃ kiṃ maññatha, bhaginiyo, sotaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… ghānaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante… jivhā… kāyo… mano nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Pubbeva no etaṃ, bhante, yathābhūtaṃ sammappaññāya sudiṭṭhaṃ – ‘itipime cha ajjhattikā āyatanā aniccā’’’ti. ‘‘Sādhu sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "409"
      },
      ". ‘‘Taṃ kiṃ maññatha, bhaginiyo, rūpā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso ",
      " me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, bhaginiyo, saddā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante…pe… gandhā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante… rasā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante… phoṭṭhabbā niccā vā aniccā vā’’ti ",
      "? ‘‘Aniccā, bhante… dhammā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Pubbeva no etaṃ, bhante, yathābhūtaṃ sammappaññāya sudiṭṭhaṃ – ‘itipime cha bāhirā āyatanā aniccā’’’ti. ‘‘Sādhu sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
    ],
    "innerText": "409. ‘‘Taṃ kiṃ maññatha, bhaginiyo, rūpā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, bhaginiyo, saddā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante…pe… gandhā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante… rasā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante… phoṭṭhabbā niccā vā aniccā vā’’ti ? ‘‘Aniccā, bhante… dhammā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Pubbeva no etaṃ, bhante, yathābhūtaṃ sammappaññāya sudiṭṭhaṃ – ‘itipime cha bāhirā āyatanā aniccā’’’ti. ‘‘Sādhu sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "410"
      },
      ". ‘‘Taṃ kiṃ maññatha, bhaginiyo, cakkhuviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… sotaviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante… ghānaviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante… jivhāviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante… kāyaviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante… manoviññāṇaṃ niccaṃ ",
      " vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Pubbeva no etaṃ, bhante, yathābhūtaṃ sammappaññāya ",
      " sudiṭṭhaṃ – ‘itipime cha viññāṇakāyā aniccā’’’ti. ‘‘Sādhu sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
    ],
    "innerText": "410. ‘‘Taṃ kiṃ maññatha, bhaginiyo, cakkhuviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… sotaviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante… ghānaviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante… jivhāviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante… kāyaviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante… manoviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Pubbeva no etaṃ, bhante, yathābhūtaṃ sammappaññāya sudiṭṭhaṃ – ‘itipime cha viññāṇakāyā aniccā’’’ti. ‘‘Sādhu sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "411"
      },
      ". ‘‘Seyyathāpi, bhaginiyo, telappadīpassa jhāyato telampi aniccaṃ vipariṇāmadhammaṃ, vaṭṭipi aniccā vipariṇāmadhammā, accipi aniccā vipariṇāmadhammā, ābhāpi aniccā vipariṇāmadhammā. Yo nu kho, bhaginiyo, evaṃ vadeyya – ‘amussa telappadīpassa jhāyato telampi aniccaṃ vipariṇāmadhammaṃ, vaṭṭipi aniccā vipariṇāmadhammā, accipi aniccā vipariṇāmadhammā; yā ca khvāssa ābhā sā niccā dhuvā sassatā avipariṇāmadhammā’ti; sammā nu kho so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Amussa hi, bhante, telappadīpassa jhāyato telampi aniccaṃ vipariṇāmadhammaṃ, vaṭṭipi aniccā vipariṇāmadhammā, accipi aniccā vipariṇāmadhammā ",
      "; pagevassa ābhā aniccā vipariṇāmadhammā’’ti. ‘‘Evameva kho, bhaginiyo, yo nu kho evaṃ vadeyya – ‘cha khome ajjhattikā āyatanā aniccā. Yañca kho cha ajjhattike āyatane ",
      " paṭicca paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā taṃ niccaṃ dhuvaṃ sassataṃ avipariṇāmadhamma’nti; sammā nu kho so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Tajjaṃ tajjaṃ, bhante, paccayaṃ paṭicca tajjā tajjā vedanā uppajjanti. Tajjassa tajjassa paccayassa nirodhā tajjā tajjā vedanā nirujjhantī’’ti. ‘‘Sādhu sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
    ],
    "innerText": "411. ‘‘Seyyathāpi, bhaginiyo, telappadīpassa jhāyato telampi aniccaṃ vipariṇāmadhammaṃ, vaṭṭipi aniccā vipariṇāmadhammā, accipi aniccā vipariṇāmadhammā, ābhāpi aniccā vipariṇāmadhammā. Yo nu kho, bhaginiyo, evaṃ vadeyya – ‘amussa telappadīpassa jhāyato telampi aniccaṃ vipariṇāmadhammaṃ, vaṭṭipi aniccā vipariṇāmadhammā, accipi aniccā vipariṇāmadhammā; yā ca khvāssa ābhā sā niccā dhuvā sassatā avipariṇāmadhammā’ti; sammā nu kho so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Amussa hi, bhante, telappadīpassa jhāyato telampi aniccaṃ vipariṇāmadhammaṃ, vaṭṭipi aniccā vipariṇāmadhammā, accipi aniccā vipariṇāmadhammā ; pagevassa ābhā aniccā vipariṇāmadhammā’’ti. ‘‘Evameva kho, bhaginiyo, yo nu kho evaṃ vadeyya – ‘cha khome ajjhattikā āyatanā aniccā. Yañca kho cha ajjhattike āyatane paṭicca paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā taṃ niccaṃ dhuvaṃ sassataṃ avipariṇāmadhamma’nti; sammā nu kho so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Tajjaṃ tajjaṃ, bhante, paccayaṃ paṭicca tajjā tajjā vedanā uppajjanti. Tajjassa tajjassa paccayassa nirodhā tajjā tajjā vedanā nirujjhantī’’ti. ‘‘Sādhu sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "412"
      },
      ". ‘‘Seyyathāpi, bhaginiyo, mahato rukkhassa tiṭṭhato sāravato mūlampi aniccaṃ vipariṇāmadhammaṃ, khandhopi anicco vipariṇāmadhammo, sākhāpalāsampi aniccaṃ vipariṇāmadhammaṃ, chāyāpi aniccā vipariṇāmadhammā. Yo nu kho, bhaginiyo, evaṃ vadeyya – ‘amussa mahato rukkhassa tiṭṭhato sāravato mūlampi aniccaṃ vipariṇāmadhammaṃ, khandhopi anicco vipariṇāmadhammo, sākhāpalāsampi aniccaṃ vipariṇāmadhammaṃ; yā ca khvāssa chāyā sā niccā dhuvā sassatā avipariṇāmadhammā’ti; sammā nu kho so bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Amussa hi, bhante, mahato rukkhassa tiṭṭhato sāravato mūlampi aniccaṃ vipariṇāmadhammaṃ, khandhopi anicco vipariṇāmadhammo, sākhāpalāsampi aniccaṃ vipariṇāmadhammaṃ; pagevassa chāyā aniccā vipariṇāmadhammā’’ti. ‘‘Evameva kho, bhaginiyo, yo nu kho evaṃ vadeyya – ‘cha khome ",
      " bāhirā āyatanā aniccā. Yañca kho bāhire āyatane paṭicca paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā taṃ niccaṃ dhuvaṃ ",
      " sassataṃ avipariṇāmadhamma’nti; sammā nu kho so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Tajjaṃ tajjaṃ, bhante, paccayaṃ paṭicca tajjā tajjā vedanā uppajjanti. Tajjassa tajjassa paccayassa nirodhā tajjā tajjā vedanā nirujjhantī’’ti. ‘‘Sādhu sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
    ],
    "innerText": "412. ‘‘Seyyathāpi, bhaginiyo, mahato rukkhassa tiṭṭhato sāravato mūlampi aniccaṃ vipariṇāmadhammaṃ, khandhopi anicco vipariṇāmadhammo, sākhāpalāsampi aniccaṃ vipariṇāmadhammaṃ, chāyāpi aniccā vipariṇāmadhammā. Yo nu kho, bhaginiyo, evaṃ vadeyya – ‘amussa mahato rukkhassa tiṭṭhato sāravato mūlampi aniccaṃ vipariṇāmadhammaṃ, khandhopi anicco vipariṇāmadhammo, sākhāpalāsampi aniccaṃ vipariṇāmadhammaṃ; yā ca khvāssa chāyā sā niccā dhuvā sassatā avipariṇāmadhammā’ti; sammā nu kho so bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Amussa hi, bhante, mahato rukkhassa tiṭṭhato sāravato mūlampi aniccaṃ vipariṇāmadhammaṃ, khandhopi anicco vipariṇāmadhammo, sākhāpalāsampi aniccaṃ vipariṇāmadhammaṃ; pagevassa chāyā aniccā vipariṇāmadhammā’’ti. ‘‘Evameva kho, bhaginiyo, yo nu kho evaṃ vadeyya – ‘cha khome bāhirā āyatanā aniccā. Yañca kho bāhire āyatane paṭicca paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā taṃ niccaṃ dhuvaṃ sassataṃ avipariṇāmadhamma’nti; sammā nu kho so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Tajjaṃ tajjaṃ, bhante, paccayaṃ paṭicca tajjā tajjā vedanā uppajjanti. Tajjassa tajjassa paccayassa nirodhā tajjā tajjā vedanā nirujjhantī’’ti. ‘‘Sādhu sādhu, bhaginiyo! Evañhetaṃ, bhaginiyo, hoti ariyasāvakassa yathābhūtaṃ sammappaññāya passato’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "413"
      },
      ". ‘‘Seyyathāpi, bhaginiyo, dakkho goghātako vā goghātakantevāsī vā gāviṃ vadhitvā tiṇhena govikantanena gāviṃ saṅkanteyya anupahacca ",
      " antaraṃ maṃsakāyaṃ anupahacca bāhiraṃ cammakāyaṃ. Yaṃ yadeva tattha antarā vilimaṃsaṃ antarā nhāru antarā bandhanaṃ taṃ tadeva tiṇhena govikantanena sañchindeyya saṅkanteyya sampakanteyya samparikanteyya. Sañchinditvā saṅkantitvā sampakantitvā samparikantitvā vidhunitvā bāhiraṃ cammakāyaṃ teneva cammena taṃ gāviṃ paṭicchādetvā evaṃ vadeyya – ‘tathevāyaṃ gāvī saṃyuttā imināva cammenā’ti; sammā nu kho so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Amu hi, bhante, dakkho goghātako vā goghātakantevāsī vā gāviṃ vadhitvā tiṇhena govikantanena gāviṃ saṅkanteyya anupahacca antaraṃ maṃsakāyaṃ anupahacca bāhiraṃ cammakāyaṃ. Yaṃ yadeva tattha antarā vilimaṃsaṃ antarā ",
      " nhāru antarā bandhanaṃ taṃ tadeva tiṇhena govikantanena sañchindeyya saṅkanteyya sampakanteyya samparikanteyya. Sañchinditvā saṅkantitvā sampakantitvā samparikantitvā vidhunitvā bāhiraṃ cammakāyaṃ teneva cammena taṃ gāviṃ paṭicchādetvā kiñcāpi so evaṃ vadeyya – ‘tathevāyaṃ gāvī saṃyuttā imināva cammenā’ti; atha kho sā gāvī visaṃyuttā teneva cammenā’’ti."
    ],
    "innerText": "413. ‘‘Seyyathāpi, bhaginiyo, dakkho goghātako vā goghātakantevāsī vā gāviṃ vadhitvā tiṇhena govikantanena gāviṃ saṅkanteyya anupahacca antaraṃ maṃsakāyaṃ anupahacca bāhiraṃ cammakāyaṃ. Yaṃ yadeva tattha antarā vilimaṃsaṃ antarā nhāru antarā bandhanaṃ taṃ tadeva tiṇhena govikantanena sañchindeyya saṅkanteyya sampakanteyya samparikanteyya. Sañchinditvā saṅkantitvā sampakantitvā samparikantitvā vidhunitvā bāhiraṃ cammakāyaṃ teneva cammena taṃ gāviṃ paṭicchādetvā evaṃ vadeyya – ‘tathevāyaṃ gāvī saṃyuttā imināva cammenā’ti; sammā nu kho so, bhaginiyo, vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Amu hi, bhante, dakkho goghātako vā goghātakantevāsī vā gāviṃ vadhitvā tiṇhena govikantanena gāviṃ saṅkanteyya anupahacca antaraṃ maṃsakāyaṃ anupahacca bāhiraṃ cammakāyaṃ. Yaṃ yadeva tattha antarā vilimaṃsaṃ antarā nhāru antarā bandhanaṃ taṃ tadeva tiṇhena govikantanena sañchindeyya saṅkanteyya sampakanteyya samparikanteyya. Sañchinditvā saṅkantitvā sampakantitvā samparikantitvā vidhunitvā bāhiraṃ cammakāyaṃ teneva cammena taṃ gāviṃ paṭicchādetvā kiñcāpi so evaṃ vadeyya – ‘tathevāyaṃ gāvī saṃyuttā imināva cammenā’ti; atha kho sā gāvī visaṃyuttā teneva cammenā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Upamā kho me ayaṃ, bhaginiyo, katā atthassa viññāpanāya ayamevettha attho. ‘Antarā maṃsakāyo’ti kho, bhaginiyo, channetaṃ ajjhattikānaṃ āyatanānaṃ adhivacanaṃ; ‘bāhiro cammakāyo’ti kho, bhaginiyo, channetaṃ bāhirānaṃ āyatanānaṃ adhivacanaṃ; ‘antarā vilimaṃsaṃ antarā nhāru antarā bandhana’nti kho, bhaginiyo, nandīrāgassetaṃ adhivacanaṃ; ‘tiṇhaṃ govikantana’nti kho, bhaginiyo, ariyāyetaṃ paññāya adhivacanaṃ; yāyaṃ ariyā paññā antarā kilesaṃ antarā saṃyojanaṃ antarā bandhanaṃ sañchindati saṅkantati sampakantati samparikantati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "414"
      },
      ". ‘‘Satta kho panime, bhaginiyo, bojjhaṅgā, yesaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja ",
      " viharati. Katame satta? Idha, bhaginiyo, bhikkhu satisambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Dhammavicayasambojjhaṅgaṃ bhāveti…pe… vīriyasambojjhaṅgaṃ bhāveti… pītisambojjhaṅgaṃ bhāveti… passaddhisambojjhaṅgaṃ ",
      " bhāveti… samādhisambojjhaṅgaṃ bhāveti… upekkhāsambojjhaṅgaṃ ",
      " bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Ime kho, bhaginiyo, satta bojjhaṅgā yesaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti."
    ],
    "innerText": "414. ‘‘Satta kho panime, bhaginiyo, bojjhaṅgā, yesaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Katame satta? Idha, bhaginiyo, bhikkhu satisambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Dhammavicayasambojjhaṅgaṃ bhāveti…pe… vīriyasambojjhaṅgaṃ bhāveti… pītisambojjhaṅgaṃ bhāveti… passaddhisambojjhaṅgaṃ bhāveti… samādhisambojjhaṅgaṃ bhāveti… upekkhāsambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Ime kho, bhaginiyo, satta bojjhaṅgā yesaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "415"
      },
      ". Atha kho āyasmā nandako tā bhikkhuniyo iminā ovādena ovaditvā uyyojesi – ‘‘gacchatha, bhaginiyo; kālo’’ti. Atha kho tā bhikkhuniyo āyasmato nandakassa bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā āyasmantaṃ nandakaṃ abhivādetvā padakkhiṇaṃ katvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho tā bhikkhuniyo bhagavā etadavoca –‘‘gacchatha, bhikkhuniyo; kālo’’ti. Atha kho tā bhikkhuniyo bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkamiṃsu. Atha kho bhagavā acirapakkantīsu tāsu bhikkhunīsu bhikkhū āmantesi – ‘‘seyyathāpi, bhikkhave, tadahuposathe pannarase na hoti bahuno janassa kaṅkhā vā vimati vā – ‘ūno nu kho cando, puṇṇo nu kho cando’ti, atha kho puṇṇo candotveva hoti; evameva kho, bhikkhave, tā bhikkhuniyo nandakassa dhammadesanāya attamanā ceva paripuṇṇasaṅkappā ca. Tāsaṃ, bhikkhave, pañcannaṃ bhikkhunisatānaṃ yā ",
      " pacchimitā bhikkhunī sā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yā pacchimā bhikkhunī, sā (sī. syā. kaṃ. pī.), yā pacchimikā, tā bhikkhuniyo (ka.)]"
      },
      " sotāpannā avinipātadhammā niyatā sambodhiparāyanā’’ti."
    ],
    "innerText": "415. Atha kho āyasmā nandako tā bhikkhuniyo iminā ovādena ovaditvā uyyojesi – ‘‘gacchatha, bhaginiyo; kālo’’ti. Atha kho tā bhikkhuniyo āyasmato nandakassa bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā āyasmantaṃ nandakaṃ abhivādetvā padakkhiṇaṃ katvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho tā bhikkhuniyo bhagavā etadavoca –‘‘gacchatha, bhikkhuniyo; kālo’’ti. Atha kho tā bhikkhuniyo bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkamiṃsu. Atha kho bhagavā acirapakkantīsu tāsu bhikkhunīsu bhikkhū āmantesi – ‘‘seyyathāpi, bhikkhave, tadahuposathe pannarase na hoti bahuno janassa kaṅkhā vā vimati vā – ‘ūno nu kho cando, puṇṇo nu kho cando’ti, atha kho puṇṇo candotveva hoti; evameva kho, bhikkhave, tā bhikkhuniyo nandakassa dhammadesanāya attamanā ceva paripuṇṇasaṅkappā ca. Tāsaṃ, bhikkhave, pañcannaṃ bhikkhunisatānaṃ yā pacchimitā bhikkhunī sā [yā pacchimā bhikkhunī, sā (sī. syā. kaṃ. pī.), yā pacchimikā, tā bhikkhuniyo (ka.)] sotāpannā avinipātadhammā niyatā sambodhiparāyanā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nandakovādasuttaṃ niṭṭhitaṃ catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Cūḷarāhulovādasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "416"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho bhagavato rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘paripakkā kho ",
      " rāhulassa vimuttiparipācanīyā dhammā. Yaṃnūnāhaṃ rāhulaṃ uttariṃ āsavānaṃ khaye vineyya’’nti. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi. Sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto āyasmantaṃ rāhulaṃ āmantesi – ‘‘gaṇhāhi, rāhula, nisīdanaṃ; yena andhavanaṃ tenupasaṅkamissāma divāvihārāyā’’ti ",
      ". ‘‘Evaṃ, bhante’’ti kho āyasmā rāhulo bhagavato paṭissutvā nisīdanaṃ ādāya bhagavantaṃ piṭṭhito piṭṭhito anubandhi."
    ],
    "innerText": "416. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho bhagavato rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘paripakkā kho rāhulassa vimuttiparipācanīyā dhammā. Yaṃnūnāhaṃ rāhulaṃ uttariṃ āsavānaṃ khaye vineyya’’nti. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi. Sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto āyasmantaṃ rāhulaṃ āmantesi – ‘‘gaṇhāhi, rāhula, nisīdanaṃ; yena andhavanaṃ tenupasaṅkamissāma divāvihārāyā’’ti . ‘‘Evaṃ, bhante’’ti kho āyasmā rāhulo bhagavato paṭissutvā nisīdanaṃ ādāya bhagavantaṃ piṭṭhito piṭṭhito anubandhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena anekāni devatāsahassāni bhagavantaṃ anubandhāni honti – ‘‘ajja bhagavā āyasmantaṃ rāhulaṃ uttariṃ āsavānaṃ khaye vinessatī’’ti. Atha kho bhagavā andhavanaṃ ajjhogāhetvā aññatarasmiṃ rukkhamūle paññatte āsane nisīdi. Āyasmāpi kho rāhulo bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rāhulaṃ bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "417"
      },
      ". ‘‘Taṃ kiṃ maññasi, rāhula, cakkhu niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante ",
      "’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, rāhula, rūpā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ ",
      " samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, rāhula, cakkhuviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, rāhula, cakkhusamphasso nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No ",
      " hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, rāhula, yamidaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yampidaṃ (sī. ka.)]"
      },
      " cakkhusamphassapaccayā uppajjati ",
      " vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ tampi niccaṃ vā aniccaṃ vā’’ti ",
      "? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’."
    ],
    "innerText": "417. ‘‘Taṃ kiṃ maññasi, rāhula, cakkhu niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante ’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, rāhula, rūpā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, rāhula, cakkhuviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, rāhula, cakkhusamphasso nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, rāhula, yamidaṃ [yampidaṃ (sī. ka.)] cakkhusamphassapaccayā uppajjati vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ tampi niccaṃ vā aniccaṃ vā’’ti ? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "418"
      },
      ". ‘‘Taṃ kiṃ maññasi rāhula, sotaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… ghānaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… jivhā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante…pe… kāyo nicco vā anicco vā’’ti? ‘‘Anicco, bhante…pe… mano nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ –‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi rāhula, dhammā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ ",
      " kiṃ maññasi rāhula, manoviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi rāhula, manosamphasso nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, rāhula, yamidaṃ manosamphassapaccayā uppajjati vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ, tampi niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ ",
      " panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’."
    ],
    "innerText": "418. ‘‘Taṃ kiṃ maññasi rāhula, sotaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… ghānaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… jivhā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante…pe… kāyo nicco vā anicco vā’’ti? ‘‘Anicco, bhante…pe… mano nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ –‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi rāhula, dhammā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi rāhula, manoviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi rāhula, manosamphasso nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, rāhula, yamidaṃ manosamphassapaccayā uppajjati vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ, tampi niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "419"
      },
      ". ‘‘Evaṃ passaṃ, rāhula, sutavā ariyasāvako cakkhusmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cakkhusmimpi (syā. kaṃ.) evamitaresupi]"
      },
      " nibbindati, rūpesu nibbindati, cakkhuviññāṇe nibbindati, cakkhusamphasse nibbindati, yamidaṃ cakkhusamphassapaccayā uppajjati vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ tasmimpi nibbindati. Sotasmiṃ ",
      " nibbindati, saddesu nibbindati…pe… ",
      ", ghānasmiṃ nibbindati, gandhesu nibbindati… jivhāya nibbindati, rasesu nibbindati… kāyasmiṃ nibbindati, phoṭṭhabbesu nibbindati… manasmiṃ nibbindati, dhammesu nibbindati, manoviññāṇe nibbindati, manosamphasse nibbindati, yamidaṃ manosamphassapaccayā ",
      " uppajjati vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ tasmimpi nibbindati. Nibbindaṃ virajjati, virāgā vimuccati. Vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānātī’’ti."
    ],
    "innerText": "419. ‘‘Evaṃ passaṃ, rāhula, sutavā ariyasāvako cakkhusmiṃ [cakkhusmimpi (syā. kaṃ.) evamitaresupi] nibbindati, rūpesu nibbindati, cakkhuviññāṇe nibbindati, cakkhusamphasse nibbindati, yamidaṃ cakkhusamphassapaccayā uppajjati vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ tasmimpi nibbindati. Sotasmiṃ nibbindati, saddesu nibbindati…pe… , ghānasmiṃ nibbindati, gandhesu nibbindati… jivhāya nibbindati, rasesu nibbindati… kāyasmiṃ nibbindati, phoṭṭhabbesu nibbindati… manasmiṃ nibbindati, dhammesu nibbindati, manoviññāṇe nibbindati, manosamphasse nibbindati, yamidaṃ manosamphassapaccayā uppajjati vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ tasmimpi nibbindati. Nibbindaṃ virajjati, virāgā vimuccati. Vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānātī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Attamano āyasmā rāhulo bhagavato bhāsitaṃ abhinandīti. Imasmiñca pana veyyākaraṇasmiṃ bhaññamāne āyasmato rāhulassa anupādāya āsavehi cittaṃ vimucci. Tāsañca anekānaṃ devatāsahassānaṃ virajaṃ vītamalaṃ dhammacakkhuṃ udapādi – ‘yaṃ kiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhamma’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cūḷarāhulovādasuttaṃ niṭṭhitaṃ pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Chachakkasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "420"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘dhammaṃ vo, bhikkhave, desessāmi ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsessāmi, yadidaṃ – cha chakkāni. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "420. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘dhammaṃ vo, bhikkhave, desessāmi ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsessāmi, yadidaṃ – cha chakkāni. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Cha ajjhattikāni āyatanāni veditabbāni, cha bāhirāni āyatanāni veditabbāni, cha viññāṇakāyā veditabbā, cha phassakāyā veditabbā, cha vedanākāyā veditabbā, cha taṇhākāyā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "421"
      },
      ". ‘‘‘Cha ajjhattikāni āyatanāni veditabbānī’ti – iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Cakkhāyatanaṃ, sotāyatanaṃ, ghānāyatanaṃ, jivhāyatanaṃ ",
      ", kāyāyatanaṃ, manāyatanaṃ. ‘Cha ajjhattikāni āyatanāni veditabbānī’ti – iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. Idaṃ paṭhamaṃ chakkaṃ."
    ],
    "innerText": "421. ‘‘‘Cha ajjhattikāni āyatanāni veditabbānī’ti – iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Cakkhāyatanaṃ, sotāyatanaṃ, ghānāyatanaṃ, jivhāyatanaṃ , kāyāyatanaṃ, manāyatanaṃ. ‘Cha ajjhattikāni āyatanāni veditabbānī’ti – iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. Idaṃ paṭhamaṃ chakkaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Cha ",
      " bāhirāni āyatanāni veditabbānī’ti – iti kho panetaṃ vuttaṃ ",
      ". Kiñcetaṃ paṭicca vuttaṃ? Rūpāyatanaṃ, saddāyatanaṃ, gandhāyatanaṃ, rasāyatanaṃ, phoṭṭhabbāyatanaṃ, dhammāyatanaṃ. ‘Cha bāhirāni āyatanāni veditabbānī’ti – iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. Idaṃ dutiyaṃ chakkaṃ."
    ],
    "innerText": "‘‘‘Cha bāhirāni āyatanāni veditabbānī’ti – iti kho panetaṃ vuttaṃ . Kiñcetaṃ paṭicca vuttaṃ? Rūpāyatanaṃ, saddāyatanaṃ, gandhāyatanaṃ, rasāyatanaṃ, phoṭṭhabbāyatanaṃ, dhammāyatanaṃ. ‘Cha bāhirāni āyatanāni veditabbānī’ti – iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. Idaṃ dutiyaṃ chakkaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Cha viññāṇakāyā veditabbā’ti – iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ, sotañca paṭicca sadde ca uppajjati ",
      " sotaviññāṇaṃ, ghānañca paṭicca gandhe ca uppajjati ghānaviññāṇaṃ, jivhañca paṭicca rase ca uppajjati jivhāviññāṇaṃ, kāyañca paṭicca phoṭṭhabbe ca uppajjati kāyaviññāṇaṃ, manañca paṭicca dhamme ca uppajjati manoviññāṇaṃ. ‘Cha viññāṇakāyā veditabbā’ti – iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. Idaṃ tatiyaṃ chakkaṃ."
    ],
    "innerText": "‘‘‘Cha viññāṇakāyā veditabbā’ti – iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ, sotañca paṭicca sadde ca uppajjati sotaviññāṇaṃ, ghānañca paṭicca gandhe ca uppajjati ghānaviññāṇaṃ, jivhañca paṭicca rase ca uppajjati jivhāviññāṇaṃ, kāyañca paṭicca phoṭṭhabbe ca uppajjati kāyaviññāṇaṃ, manañca paṭicca dhamme ca uppajjati manoviññāṇaṃ. ‘Cha viññāṇakāyā veditabbā’ti – iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. Idaṃ tatiyaṃ chakkaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Cha phassakāyā veditabbā’ti – iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ, tiṇṇaṃ saṅgati phasso; sotañca paṭicca sadde ca uppajjati sotaviññāṇaṃ, tiṇṇaṃ saṅgati phasso; ghānañca paṭicca gandhe ca uppajjati ghānaviññāṇaṃ, tiṇṇaṃ saṅgati phasso; jivhañca paṭicca rase ca uppajjati jivhāviññāṇaṃ, tiṇṇaṃ saṅgati phasso; kāyañca paṭicca phoṭṭhabbe ca uppajjati kāyaviññāṇaṃ, tiṇṇaṃ saṅgati phasso; manañca paṭicca dhamme ca ",
      " uppajjati manoviññāṇaṃ, tiṇṇaṃ saṅgati phasso. ‘Cha phassakāyā veditabbā’ti – iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. Idaṃ catutthaṃ chakkaṃ."
    ],
    "innerText": "‘‘‘Cha phassakāyā veditabbā’ti – iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ, tiṇṇaṃ saṅgati phasso; sotañca paṭicca sadde ca uppajjati sotaviññāṇaṃ, tiṇṇaṃ saṅgati phasso; ghānañca paṭicca gandhe ca uppajjati ghānaviññāṇaṃ, tiṇṇaṃ saṅgati phasso; jivhañca paṭicca rase ca uppajjati jivhāviññāṇaṃ, tiṇṇaṃ saṅgati phasso; kāyañca paṭicca phoṭṭhabbe ca uppajjati kāyaviññāṇaṃ, tiṇṇaṃ saṅgati phasso; manañca paṭicca dhamme ca uppajjati manoviññāṇaṃ, tiṇṇaṃ saṅgati phasso. ‘Cha phassakāyā veditabbā’ti – iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. Idaṃ catutthaṃ chakkaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Cha vedanākāyā veditabbā’ti – iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā; sotañca paṭicca sadde ca uppajjati sotaviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā; ghānañca paṭicca gandhe ca uppajjati ghānaviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā; jivhañca paṭicca rase ca uppajjati jivhāviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā; kāyañca paṭicca phoṭṭhabbe ca uppajjati kāyaviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā ",
      " vedanā; manañca paṭicca dhamme ",
      " ca uppajjati manoviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā. ‘Cha vedanākāyā veditabbā’ti – iti yaṃ taṃ ",
      " vuttaṃ, idametaṃ paṭicca vuttaṃ. Idaṃ pañcamaṃ chakkaṃ."
    ],
    "innerText": "‘‘‘Cha vedanākāyā veditabbā’ti – iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā; sotañca paṭicca sadde ca uppajjati sotaviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā; ghānañca paṭicca gandhe ca uppajjati ghānaviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā; jivhañca paṭicca rase ca uppajjati jivhāviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā; kāyañca paṭicca phoṭṭhabbe ca uppajjati kāyaviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā; manañca paṭicca dhamme ca uppajjati manoviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā. ‘Cha vedanākāyā veditabbā’ti – iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. Idaṃ pañcamaṃ chakkaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Cha taṇhākāyā veditabbā’ti – iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā; sotañca paṭicca sadde ca uppajjati sotaviññāṇaṃ…pe… ghānañca paṭicca gandhe ca uppajjati ghānaviññāṇaṃ… jivhañca paṭicca rase ca uppajjati ",
      " jivhāviññāṇaṃ… kāyañca paṭicca phoṭṭhabbe ca uppajjati kāyaviññāṇaṃ… manañca paṭicca dhamme ca uppajjati manoviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā. ‘Cha taṇhākāyā veditabbā’ti – iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. Idaṃ chaṭṭhaṃ chakkaṃ."
    ],
    "innerText": "‘‘‘Cha taṇhākāyā veditabbā’ti – iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Cakkhuñca paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā; sotañca paṭicca sadde ca uppajjati sotaviññāṇaṃ…pe… ghānañca paṭicca gandhe ca uppajjati ghānaviññāṇaṃ… jivhañca paṭicca rase ca uppajjati jivhāviññāṇaṃ… kāyañca paṭicca phoṭṭhabbe ca uppajjati kāyaviññāṇaṃ… manañca paṭicca dhamme ca uppajjati manoviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā. ‘Cha taṇhākāyā veditabbā’ti – iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. Idaṃ chaṭṭhaṃ chakkaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "422"
      },
      ". ‘‘‘Cakkhu attā’ti yo vadeyya taṃ na upapajjati. Cakkhussa uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘cakkhu attā’ti yo vadeyya. Iti cakkhu anattā."
    ],
    "innerText": "422. ‘‘‘Cakkhu attā’ti yo vadeyya taṃ na upapajjati. Cakkhussa uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘cakkhu attā’ti yo vadeyya. Iti cakkhu anattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Rūpā attā’ti yo vadeyya taṃ na upapajjati. Rūpānaṃ uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘rūpā attā’ti yo vadeyya. Iti cakkhu anattā, rūpā anattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Cakkhuviññāṇaṃ attā’ti yo vadeyya taṃ na upapajjati. Cakkhuviññāṇassa uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘cakkhuviññāṇaṃ attā’ti yo vadeyya. Iti cakkhu anattā, rūpā anattā, cakkhuviññāṇaṃ anattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Cakkhusamphasso attā’ti yo vadeyya taṃ na upapajjati. Cakkhusamphassassa uppādopi vayopi paññāyati ",
      ". Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘cakkhusamphasso attā’ti yo ",
      " vadeyya. Iti cakkhu anattā, rūpā anattā, cakkhuviññāṇaṃ anattā, cakkhusamphasso anattā."
    ],
    "innerText": "‘‘‘Cakkhusamphasso attā’ti yo vadeyya taṃ na upapajjati. Cakkhusamphassassa uppādopi vayopi paññāyati . Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘cakkhusamphasso attā’ti yo vadeyya. Iti cakkhu anattā, rūpā anattā, cakkhuviññāṇaṃ anattā, cakkhusamphasso anattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Vedanā ",
      " attā’ti yo vadeyya taṃ ",
      " na upapajjati. Vedanāya uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘vedanā attā’ti yo vadeyya. Iti cakkhu anattā, rūpā anattā, cakkhuviññāṇaṃ anattā, cakkhusamphasso anattā, vedanā anattā."
    ],
    "innerText": "‘‘‘Vedanā attā’ti yo vadeyya taṃ na upapajjati. Vedanāya uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘vedanā attā’ti yo vadeyya. Iti cakkhu anattā, rūpā anattā, cakkhuviññāṇaṃ anattā, cakkhusamphasso anattā, vedanā anattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Taṇhā attā’ti yo vadeyya taṃ na upapajjati. Taṇhāya uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘taṇhā attā’ti yo vadeyya. Iti cakkhu anattā, rūpā anattā, cakkhuviññāṇaṃ anattā, cakkhusamphasso anattā, vedanā anattā, taṇhā anattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "423"
      },
      ". ‘‘‘Sotaṃ attā’ti yo vadeyya…pe… ‘ghānaṃ attā’ti yo vadeyya… ‘jivhā attā’ti yo vadeyya… ‘kāyo attā’ti yo vadeyya… ‘mano attā’ti yo vadeyya taṃ na upapajjati. Manassa uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi ",
      " paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘mano attā’ti yo vadeyya. Iti mano anattā."
    ],
    "innerText": "423. ‘‘‘Sotaṃ attā’ti yo vadeyya…pe… ‘ghānaṃ attā’ti yo vadeyya… ‘jivhā attā’ti yo vadeyya… ‘kāyo attā’ti yo vadeyya… ‘mano attā’ti yo vadeyya taṃ na upapajjati. Manassa uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘mano attā’ti yo vadeyya. Iti mano anattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Dhammā attā’ti yo vadeyya taṃ na upapajjati. Dhammānaṃ uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘dhammā attā’ti yo vadeyya. Iti mano anattā, dhammā anattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Manoviññāṇaṃ attā’ti yo vadeyya taṃ na upapajjati. Manoviññāṇassa uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘manoviññāṇaṃ attā’ti ",
      " yo vadeyya. Iti mano anattā, dhammā anattā, manoviññāṇaṃ anattā."
    ],
    "innerText": "‘‘‘Manoviññāṇaṃ attā’ti yo vadeyya taṃ na upapajjati. Manoviññāṇassa uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘manoviññāṇaṃ attā’ti yo vadeyya. Iti mano anattā, dhammā anattā, manoviññāṇaṃ anattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Manosamphasso ",
      " attā’ti yo vadeyya taṃ na upapajjati. Manosamphassassa uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘manosamphasso attā’ti yo vadeyya. Iti mano anattā, dhammā anattā, manoviññāṇaṃ anattā, manosamphasso anattā."
    ],
    "innerText": "‘‘‘Manosamphasso attā’ti yo vadeyya taṃ na upapajjati. Manosamphassassa uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘manosamphasso attā’ti yo vadeyya. Iti mano anattā, dhammā anattā, manoviññāṇaṃ anattā, manosamphasso anattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Vedanā attā’ti yo vadeyya taṃ na upapajjati. Vedanāya uppādopi vayopi paññāyati. Yassa kho ",
      " pana uppādopi ",
      " vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘vedanā attā’ti yo vadeyya. Iti mano anattā, dhammā anattā, manoviññāṇaṃ anattā, manosamphasso anattā, vedanā anattā."
    ],
    "innerText": "‘‘‘Vedanā attā’ti yo vadeyya taṃ na upapajjati. Vedanāya uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘vedanā attā’ti yo vadeyya. Iti mano anattā, dhammā anattā, manoviññāṇaṃ anattā, manosamphasso anattā, vedanā anattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Taṇhā attā’ti yo vadeyya taṃ na upapajjati. Taṇhāya uppādopi vayopi paññāyati. Yassa kho pana uppādopi vayopi paññāyati, ‘attā me uppajjati ca veti cā’ti iccassa evamāgataṃ hoti. Tasmā taṃ na upapajjati – ‘taṇhā attā’ti yo vadeyya. Iti mano anattā, dhammā anattā, manoviññāṇaṃ anattā, manosamphasso anattā, vedanā anattā, taṇhā anattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "424"
      },
      ". ‘‘Ayaṃ kho pana, bhikkhave, sakkāyasamudayagāminī paṭipadā – cakkhuṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati; rūpe ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati; cakkhuviññāṇaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati; cakkhusamphassaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati; vedanaṃ ‘etaṃ mama ",
      ", esohamasmi, eso me attā’ti samanupassati; taṇhaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati; sotaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati…pe… ghānaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati…pe… jivhaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti ",
      " samanupassati…pe… kāyaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati…pe… manaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati, dhamme ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati, manoviññāṇaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati, manosamphassaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati, vedanaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati, taṇhaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati."
    ],
    "innerText": "424. ‘‘Ayaṃ kho pana, bhikkhave, sakkāyasamudayagāminī paṭipadā – cakkhuṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati; rūpe ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati; cakkhuviññāṇaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati; cakkhusamphassaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati; vedanaṃ ‘etaṃ mama , esohamasmi, eso me attā’ti samanupassati; taṇhaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati; sotaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati…pe… ghānaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati…pe… jivhaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati…pe… kāyaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati…pe… manaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati, dhamme ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati, manoviññāṇaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati, manosamphassaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati, vedanaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati, taṇhaṃ ‘etaṃ mama, esohamasmi, eso me attā’ti samanupassati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ayaṃ ",
      " kho pana, bhikkhave, sakkāyanirodhagāminī paṭipadā – cakkhuṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Rūpe ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Cakkhuviññāṇaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Cakkhusamphassaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Vedanaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Taṇhaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Sotaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati…pe… ghānaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati… jivhaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati… kāyaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati… manaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Dhamme ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Manoviññāṇaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Manosamphassaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Vedanaṃ ‘netaṃ ",
      " mama, nesohamasmi, na meso attā’ti samanupassati. Taṇhaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati."
    ],
    "innerText": "‘‘Ayaṃ kho pana, bhikkhave, sakkāyanirodhagāminī paṭipadā – cakkhuṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Rūpe ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Cakkhuviññāṇaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Cakkhusamphassaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Vedanaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Taṇhaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Sotaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati…pe… ghānaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati… jivhaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati… kāyaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati… manaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Dhamme ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Manoviññāṇaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Manosamphassaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Vedanaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati. Taṇhaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti samanupassati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "425"
      },
      ". ‘‘Cakkhuñca, bhikkhave, paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ, tiṇṇaṃ saṅgati ",
      " phasso, phassapaccayā uppajjati vedayitaṃ sukhaṃ ",
      " vā dukkhaṃ vā adukkhamasukhaṃ vā. So sukhāya vedanāya phuṭṭho samāno abhinandati abhivadati ajjhosāya tiṭṭhati. Tassa rāgānusayo anuseti. Dukkhāya vedanāya phuṭṭho samāno socati kilamati paridevati urattāḷiṃ ",
      " kandati sammohaṃ āpajjati. Tassa paṭighānusayo anuseti. Adukkhamasukhāya vedanāya phuṭṭho samāno tassā vedanāya samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānāti. Tassa avijjānusayo anuseti. So vata, bhikkhave, sukhāya vedanāya rāgānusayaṃ appahāya dukkhāya vedanāya paṭighānusayaṃ appaṭivinodetvā adukkhamasukhāya vedanāya avijjānusayaṃ asamūhanitvā avijjaṃ appahāya vijjaṃ anuppādetvā diṭṭheva dhamme dukkhassantakaro bhavissatīti – netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "425. ‘‘Cakkhuñca, bhikkhave, paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā. So sukhāya vedanāya phuṭṭho samāno abhinandati abhivadati ajjhosāya tiṭṭhati. Tassa rāgānusayo anuseti. Dukkhāya vedanāya phuṭṭho samāno socati kilamati paridevati urattāḷiṃ kandati sammohaṃ āpajjati. Tassa paṭighānusayo anuseti. Adukkhamasukhāya vedanāya phuṭṭho samāno tassā vedanāya samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānāti. Tassa avijjānusayo anuseti. So vata, bhikkhave, sukhāya vedanāya rāgānusayaṃ appahāya dukkhāya vedanāya paṭighānusayaṃ appaṭivinodetvā adukkhamasukhāya vedanāya avijjānusayaṃ asamūhanitvā avijjaṃ appahāya vijjaṃ anuppādetvā diṭṭheva dhamme dukkhassantakaro bhavissatīti – netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sotañca, bhikkhave, paṭicca sadde ca uppajjati sotaviññāṇaṃ…pe… ghānañca, bhikkhave, paṭicca gandhe ca uppajjati ghānaviññāṇaṃ…pe… jivhañca, bhikkhave, paṭicca rase ca uppajjati jivhāviññāṇaṃ…pe… kāyañca, bhikkhave, paṭicca phoṭṭhabbe ca uppajjati kāyaviññāṇaṃ…pe… manañca, bhikkhave, paṭicca dhamme ca uppajjati manoviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā. So sukhāya vedanāya phuṭṭho samāno abhinandati abhivadati ajjhosāya tiṭṭhati. Tassa rāgānusayo anuseti. Dukkhāya vedanāya phuṭṭho samāno socati kilamati paridevati urattāḷiṃ ",
      " kandati sammohaṃ āpajjati. Tassa paṭighānusayo anuseti. Adukkhamasukhāya vedanāya phuṭṭho samāno tassā vedanāya samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānāti. Tassa avijjānusayo anuseti. So vata, bhikkhave, sukhāya vedanāya rāgānusayaṃ appahāya dukkhāya vedanāya paṭighānusayaṃ appaṭivinodetvā adukkhamasukhāya vedanāya avijjānusayaṃ asamūhanitvā avijjaṃ appahāya vijjaṃ anuppādetvā diṭṭheva dhamme dukkhassantakaro bhavissatīti – netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "‘‘Sotañca, bhikkhave, paṭicca sadde ca uppajjati sotaviññāṇaṃ…pe… ghānañca, bhikkhave, paṭicca gandhe ca uppajjati ghānaviññāṇaṃ…pe… jivhañca, bhikkhave, paṭicca rase ca uppajjati jivhāviññāṇaṃ…pe… kāyañca, bhikkhave, paṭicca phoṭṭhabbe ca uppajjati kāyaviññāṇaṃ…pe… manañca, bhikkhave, paṭicca dhamme ca uppajjati manoviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā. So sukhāya vedanāya phuṭṭho samāno abhinandati abhivadati ajjhosāya tiṭṭhati. Tassa rāgānusayo anuseti. Dukkhāya vedanāya phuṭṭho samāno socati kilamati paridevati urattāḷiṃ kandati sammohaṃ āpajjati. Tassa paṭighānusayo anuseti. Adukkhamasukhāya vedanāya phuṭṭho samāno tassā vedanāya samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānāti. Tassa avijjānusayo anuseti. So vata, bhikkhave, sukhāya vedanāya rāgānusayaṃ appahāya dukkhāya vedanāya paṭighānusayaṃ appaṭivinodetvā adukkhamasukhāya vedanāya avijjānusayaṃ asamūhanitvā avijjaṃ appahāya vijjaṃ anuppādetvā diṭṭheva dhamme dukkhassantakaro bhavissatīti – netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "426"
      },
      ". ‘‘Cakkhuñca ",
      ", bhikkhave, paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā. So sukhāya vedanāya phuṭṭho samāno nābhinandati nābhivadati nājjhosāya tiṭṭhati. Tassa rāgānusayo nānuseti. Dukkhāya vedanāya phuṭṭho samāno na socati na kilamati paridevati na urattāḷiṃ kandati ",
      " na sammohaṃ āpajjati. Tassa paṭighānusayo nānuseti. Adukkhamasukhāya vedanāya phuṭṭho samāno tassā ",
      " vedanāya samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti. Tassa avijjānusayo nānuseti. So vata, bhikkhave, sukhāya vedanāya rāgānusayaṃ pahāya dukkhāya vedanāya paṭighānusayaṃ paṭivinodetvā adukkhamasukhāya vedanāya avijjānusayaṃ samūhanitvā avijjaṃ pahāya vijjaṃ uppādetvā diṭṭheva dhamme ",
      " dukkhassantakaro bhavissatīti – ṭhānametaṃ vijjati."
    ],
    "innerText": "426. ‘‘Cakkhuñca , bhikkhave, paṭicca rūpe ca uppajjati cakkhuviññāṇaṃ, tiṇṇaṃ saṅgati phasso, phassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā. So sukhāya vedanāya phuṭṭho samāno nābhinandati nābhivadati nājjhosāya tiṭṭhati. Tassa rāgānusayo nānuseti. Dukkhāya vedanāya phuṭṭho samāno na socati na kilamati paridevati na urattāḷiṃ kandati na sammohaṃ āpajjati. Tassa paṭighānusayo nānuseti. Adukkhamasukhāya vedanāya phuṭṭho samāno tassā vedanāya samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti. Tassa avijjānusayo nānuseti. So vata, bhikkhave, sukhāya vedanāya rāgānusayaṃ pahāya dukkhāya vedanāya paṭighānusayaṃ paṭivinodetvā adukkhamasukhāya vedanāya avijjānusayaṃ samūhanitvā avijjaṃ pahāya vijjaṃ uppādetvā diṭṭheva dhamme dukkhassantakaro bhavissatīti – ṭhānametaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sotañca, bhikkhave, paṭicca sadde ca uppajjati sotaviññāṇaṃ…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ghānañca, bhikkhave, paṭicca gandhe ca uppajjati ghānaviññāṇaṃ…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Jivhañca, bhikkhave, paṭicca rase ca uppajjati jivhāviññāṇaṃ…pe… ",
      "."
    ],
    "innerText": "‘‘Jivhañca, bhikkhave, paṭicca rase ca uppajjati jivhāviññāṇaṃ…pe… ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kāyañca, bhikkhave, paṭicca phoṭṭhabbe ca uppajjati kāyaviññāṇaṃ…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Manañca, bhikkhave, paṭicca dhamme ca uppajjati manoviññāṇaṃ tiṇṇaṃ saṅgati phasso, phassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā. So sukhāya vedanāya phuṭṭho samāno nābhinandati nābhivadati nājjhosāya tiṭṭhati. Tassa rāgānusayo nānuseti. Dukkhāya vedanāya phuṭṭho samāno na socati na kilamati na paridevati na urattāḷiṃ kandati na sammohaṃ āpajjati. Tassa paṭighānusayo nānuseti. Adukkhamasukhāya vedanāya phuṭṭho samāno tassā vedanāya samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti. Tassa avijjānusayo nānuseti. So vata, bhikkhave, sukhāya vedanāya rāgānusayaṃ pahāya dukkhāya vedanāya paṭighānusayaṃ paṭivinodetvā adukkhamasukhāya vedanāya avijjānusayaṃ samūhanitvā avijjaṃ pahāya vijjaṃ uppādetvā diṭṭheva dhamme dukkhassantakaro bhavissatīti – ṭhānametaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "427"
      },
      ". ‘‘Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako cakkhusmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cakkhusmimpi (syā. kaṃ.) evamitaresupi]"
      },
      " nibbindati, rūpesu nibbindati, cakkhuviññāṇe nibbindati, cakkhusamphasse ",
      " nibbindati, vedanāya nibbindati, taṇhāya nibbindati. Sotasmiṃ nibbindati, saddesu nibbindati…pe… ",
      " ghānasmiṃ nibbindati, gandhesu nibbindati… jivhāya nibbindati, rasesu nibbindati… kāyasmiṃ nibbindati, phoṭṭhabbesu nibbindati… manasmiṃ nibbindati, dhammesu nibbindati, manoviññāṇe nibbindati, manosamphasse nibbindati, vedanāya nibbindati, taṇhāya nibbindati. Nibbindaṃ virajjati ",
      ", virāgā vimuccati. Vimuttasmiṃ vimuttamiti ñāṇaṃ ",
      " hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānātī’’ti."
    ],
    "innerText": "427. ‘‘Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako cakkhusmiṃ [cakkhusmimpi (syā. kaṃ.) evamitaresupi] nibbindati, rūpesu nibbindati, cakkhuviññāṇe nibbindati, cakkhusamphasse nibbindati, vedanāya nibbindati, taṇhāya nibbindati. Sotasmiṃ nibbindati, saddesu nibbindati…pe… ghānasmiṃ nibbindati, gandhesu nibbindati… jivhāya nibbindati, rasesu nibbindati… kāyasmiṃ nibbindati, phoṭṭhabbesu nibbindati… manasmiṃ nibbindati, dhammesu nibbindati, manoviññāṇe nibbindati, manosamphasse nibbindati, vedanāya nibbindati, taṇhāya nibbindati. Nibbindaṃ virajjati , virāgā vimuccati. Vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānātī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Imasmiṃ kho pana veyyākaraṇasmiṃ bhaññamāne saṭṭhimattānaṃ bhikkhūnaṃ anupādāya āsavehi cittāni vimucciṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Chachakkasuttaṃ niṭṭhitaṃ chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Mahāsaḷāyatanikasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "428"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘mahāsaḷāyatanikaṃ vo, bhikkhave, desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "428. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘mahāsaḷāyatanikaṃ vo, bhikkhave, desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "429"
      },
      ". ‘‘Cakkhuṃ, bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ, rūpe ajānaṃ apassaṃ yathābhūtaṃ, cakkhuviññāṇaṃ ajānaṃ apassaṃ yathābhūtaṃ, cakkhusamphassaṃ ajānaṃ apassaṃ yathābhūtaṃ, yamidaṃ cakkhusamphassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā tampi ajānaṃ apassaṃ yathābhūtaṃ, cakkhusmiṃ sārajjati, rūpesu sārajjati, cakkhuviññāṇe sārajjati, cakkhusamphasse sārajjati, yamidaṃ cakkhusamphassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā tasmimpi sārajjati."
    ],
    "innerText": "429. ‘‘Cakkhuṃ, bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ, rūpe ajānaṃ apassaṃ yathābhūtaṃ, cakkhuviññāṇaṃ ajānaṃ apassaṃ yathābhūtaṃ, cakkhusamphassaṃ ajānaṃ apassaṃ yathābhūtaṃ, yamidaṃ cakkhusamphassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā tampi ajānaṃ apassaṃ yathābhūtaṃ, cakkhusmiṃ sārajjati, rūpesu sārajjati, cakkhuviññāṇe sārajjati, cakkhusamphasse sārajjati, yamidaṃ cakkhusamphassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā tasmimpi sārajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tassa sārattassa saṃyuttassa sammūḷhassa assādānupassino viharato āyatiṃ pañcupādānakkhandhā upacayaṃ gacchanti. Taṇhā cassa ponobbhavikā nandīrāgasahagatā tatratatrābhinandinī, sā cassa pavaḍḍhati. Tassa kāyikāpi darathā pavaḍḍhanti, cetasikāpi ",
      " darathā pavaḍḍhanti; kāyikāpi santāpā pavaḍḍhanti ",
      ", cetasikāpi santāpā pavaḍḍhanti; kāyikāpi pariḷāhā pavaḍḍhanti, cetasikāpi pariḷāhā pavaḍḍhanti. So kāyadukkhampi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kāyikadukkhampi (syā. kaṃ.), kāyikaṃ dukkhampi (ka.)]"
      },
      " cetodukkhampi paṭisaṃvedeti."
    ],
    "innerText": "‘‘Tassa sārattassa saṃyuttassa sammūḷhassa assādānupassino viharato āyatiṃ pañcupādānakkhandhā upacayaṃ gacchanti. Taṇhā cassa ponobbhavikā nandīrāgasahagatā tatratatrābhinandinī, sā cassa pavaḍḍhati. Tassa kāyikāpi darathā pavaḍḍhanti, cetasikāpi darathā pavaḍḍhanti; kāyikāpi santāpā pavaḍḍhanti , cetasikāpi santāpā pavaḍḍhanti; kāyikāpi pariḷāhā pavaḍḍhanti, cetasikāpi pariḷāhā pavaḍḍhanti. So kāyadukkhampi [kāyikadukkhampi (syā. kaṃ.), kāyikaṃ dukkhampi (ka.)] cetodukkhampi paṭisaṃvedeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sotaṃ ",
      ", bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ…pe… ghānaṃ, bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ…pe… jivhaṃ, bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ…pe… kāyaṃ, bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ…pe… manaṃ, bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ, dhamme, bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ, manoviññāṇaṃ, bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ ",
      ", manosamphassaṃ, bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ, yamidaṃ manosamphassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā tampi ajānaṃ apassaṃ yathābhūtaṃ, manasmiṃ sārajjati, dhammesu sārajjati, manoviññāṇe sārajjati, manosamphasse sārajjati, yamidaṃ manosamphassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā tasmimpi sārajjati."
    ],
    "innerText": "‘‘Sotaṃ , bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ…pe… ghānaṃ, bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ…pe… jivhaṃ, bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ…pe… kāyaṃ, bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ…pe… manaṃ, bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ, dhamme, bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ, manoviññāṇaṃ, bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ , manosamphassaṃ, bhikkhave, ajānaṃ apassaṃ yathābhūtaṃ, yamidaṃ manosamphassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā tampi ajānaṃ apassaṃ yathābhūtaṃ, manasmiṃ sārajjati, dhammesu sārajjati, manoviññāṇe sārajjati, manosamphasse sārajjati, yamidaṃ manosamphassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā tasmimpi sārajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tassa sārattassa saṃyuttassa sammūḷhassa assādānupassino viharato āyatiṃ pañcupādānakkhandhā upacayaṃ gacchanti. Taṇhā cassa ponobbhavikā nandīrāgasahagatā tatratatrābhinandinī, sā cassa pavaḍḍhati. Tassa kāyikāpi darathā pavaḍḍhanti, cetasikāpi darathā pavaḍḍhanti; kāyikāpi santāpā pavaḍḍhanti, cetasikāpi santāpā pavaḍḍhanti; kāyikāpi pariḷāhā pavaḍḍhanti, cetasikāpi pariḷāhā pavaḍḍhanti. So kāyadukkhampi cetodukkhampi paṭisaṃvedeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "430"
      },
      ". ‘‘Cakkhuñca ",
      " kho, bhikkhave, jānaṃ passaṃ yathābhūtaṃ, rūpe jānaṃ passaṃ yathābhūtaṃ, cakkhuviññāṇaṃ jānaṃ passaṃ yathābhūtaṃ, cakkhusamphassaṃ jānaṃ passaṃ yathābhūtaṃ, yamidaṃ cakkhusamphassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā tampi jānaṃ passaṃ yathābhūtaṃ, cakkhusmiṃ na sārajjati, rūpesu na sārajjati, cakkhuviññāṇe na sārajjati, cakkhusamphasse na sārajjati, yamidaṃ cakkhusamphassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā tasmimpi na sārajjati."
    ],
    "innerText": "430. ‘‘Cakkhuñca kho, bhikkhave, jānaṃ passaṃ yathābhūtaṃ, rūpe jānaṃ passaṃ yathābhūtaṃ, cakkhuviññāṇaṃ jānaṃ passaṃ yathābhūtaṃ, cakkhusamphassaṃ jānaṃ passaṃ yathābhūtaṃ, yamidaṃ cakkhusamphassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā tampi jānaṃ passaṃ yathābhūtaṃ, cakkhusmiṃ na sārajjati, rūpesu na sārajjati, cakkhuviññāṇe na sārajjati, cakkhusamphasse na sārajjati, yamidaṃ cakkhusamphassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā tasmimpi na sārajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tassa asārattassa asaṃyuttassa asammūḷhassa ādīnavānupassino viharato āyatiṃ pañcupādānakkhandhā apacayaṃ gacchanti. Taṇhā cassa ponobbhavikā nandīrāgasahagatā tatratatrābhinandinī, sā cassa pahīyati. Tassa kāyikāpi darathā pahīyanti, cetasikāpi darathā pahīyanti; kāyikāpi santāpā pahīyanti, cetasikāpi santāpā pahīyanti; kāyikāpi pariḷāhā pahīyanti ",
      ", cetasikāpi pariḷāhā pahīyanti. So kāyasukhampi cetosukhampi paṭisaṃvedeti."
    ],
    "innerText": "‘‘Tassa asārattassa asaṃyuttassa asammūḷhassa ādīnavānupassino viharato āyatiṃ pañcupādānakkhandhā apacayaṃ gacchanti. Taṇhā cassa ponobbhavikā nandīrāgasahagatā tatratatrābhinandinī, sā cassa pahīyati. Tassa kāyikāpi darathā pahīyanti, cetasikāpi darathā pahīyanti; kāyikāpi santāpā pahīyanti, cetasikāpi santāpā pahīyanti; kāyikāpi pariḷāhā pahīyanti , cetasikāpi pariḷāhā pahīyanti. So kāyasukhampi cetosukhampi paṭisaṃvedeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "431"
      },
      ". ‘‘Yā ",
      " tathābhūtassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathābhūtassa (sī. pī.)]"
      },
      " diṭṭhi sāssa hoti sammādiṭṭhi; yo tathābhūtassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathābhūtassa (sī. pī.)]"
      },
      " saṅkappo svāssa hoti ",
      " sammāsaṅkappo; yo tathābhūtassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathābhūtassa (sī. pī.)]"
      },
      " vāyāmo svāssa hoti sammāvāyāmo; yā tathābhūtassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathābhūtassa (sī. pī.)]"
      },
      " sati sāssa hoti sammāsati; yo tathābhūtassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathābhūtassa (sī. pī.)]"
      },
      " samādhi svāssa hoti sammāsamādhi. Pubbeva kho panassa kāyakammaṃ vacīkammaṃ ājīvo suparisuddho hoti. Evamassāyaṃ ariyo aṭṭhaṅgiko maggo bhāvanāpāripūriṃ gacchati."
    ],
    "innerText": "431. ‘‘Yā tathābhūtassa [yathābhūtassa (sī. pī.)] diṭṭhi sāssa hoti sammādiṭṭhi; yo tathābhūtassa [yathābhūtassa (sī. pī.)] saṅkappo svāssa hoti sammāsaṅkappo; yo tathābhūtassa [yathābhūtassa (sī. pī.)] vāyāmo svāssa hoti sammāvāyāmo; yā tathābhūtassa [yathābhūtassa (sī. pī.)] sati sāssa hoti sammāsati; yo tathābhūtassa [yathābhūtassa (sī. pī.)] samādhi svāssa hoti sammāsamādhi. Pubbeva kho panassa kāyakammaṃ vacīkammaṃ ājīvo suparisuddho hoti. Evamassāyaṃ ariyo aṭṭhaṅgiko maggo bhāvanāpāripūriṃ gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tassa ",
      " evaṃ imaṃ ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāvayato cattāropi satipaṭṭhānā bhāvanāpāripūriṃ gacchanti, cattāropi sammappadhānā bhāvanāpāripūriṃ gacchanti, cattāropi iddhipādā bhāvanāpāripūriṃ gacchanti, pañcapi indriyāni bhāvanāpāripūriṃ gacchanti, pañcapi balāni bhāvanāpāripūriṃ gacchanti, sattapi bojjhaṅgā bhāvanāpāripūriṃ gacchanti."
    ],
    "innerText": "‘‘Tassa evaṃ imaṃ ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāvayato cattāropi satipaṭṭhānā bhāvanāpāripūriṃ gacchanti, cattāropi sammappadhānā bhāvanāpāripūriṃ gacchanti, cattāropi iddhipādā bhāvanāpāripūriṃ gacchanti, pañcapi indriyāni bhāvanāpāripūriṃ gacchanti, pañcapi balāni bhāvanāpāripūriṃ gacchanti, sattapi bojjhaṅgā bhāvanāpāripūriṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tassime dve dhammā yuganandhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yuganaddhā (sī. syā. kaṃ.)]"
      },
      " vattanti – samatho ca vipassanā ca. So ye dhammā abhiññā pariññeyyā te dhamme abhiññā parijānāti. Ye dhammā abhiññā pahātabbā te dhamme abhiññā pajahati. Ye dhammā abhiññā bhāvetabbā te dhamme abhiññā bhāveti. Ye dhammā abhiññā sacchikātabbā te dhamme abhiññā sacchikaroti."
    ],
    "innerText": "‘‘Tassime dve dhammā yuganandhā [yuganaddhā (sī. syā. kaṃ.)] vattanti – samatho ca vipassanā ca. So ye dhammā abhiññā pariññeyyā te dhamme abhiññā parijānāti. Ye dhammā abhiññā pahātabbā te dhamme abhiññā pajahati. Ye dhammā abhiññā bhāvetabbā te dhamme abhiññā bhāveti. Ye dhammā abhiññā sacchikātabbā te dhamme abhiññā sacchikaroti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame ca, bhikkhave, dhammā abhiññā pariññeyyā? ‘Pañcupādānakkhandhā’ tissa vacanīyaṃ, seyyathidaṃ – rūpupādānakkhandho, vedanupādānakkhandho, saññupādānakkhandho, saṅkhārupādānakkhandho, viññāṇupādānakkhandho. Ime dhammā abhiññā pariññeyyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame ca, bhikkhave, dhammā abhiññā pahātabbā? Avijjā ca bhavataṇhā ca – ime dhammā abhiññā pahātabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame ca, bhikkhave, dhammā abhiññā bhāvetabbā? Samatho ca vipassanā ca – ime dhammā abhiññā bhāvetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame ",
      ", bhikkhave, dhammā abhiññā sacchikātabbā? Vijjā ca vimutti ca – ime dhammā abhiññā sacchikātabbā."
    ],
    "innerText": "‘‘Katame , bhikkhave, dhammā abhiññā sacchikātabbā? Vijjā ca vimutti ca – ime dhammā abhiññā sacchikātabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "432"
      },
      ". ‘‘Sotaṃ ",
      ", bhikkhave, jānaṃ passaṃ yathābhūtaṃ…pe… ghānaṃ bhikkhave, jānaṃ ",
      " passaṃ yathābhūtaṃ…pe… jivhaṃ, bhikkhave, jānaṃ passaṃ yathābhūtaṃ… kāyaṃ, bhikkhave, jānaṃ passaṃ yathābhūtaṃ… manaṃ, bhikkhave, jānaṃ passaṃ yathābhūtaṃ, dhamme jānaṃ passaṃ yathābhūtaṃ, manoviññāṇaṃ jānaṃ passaṃ yathābhūtaṃ, manosamphassaṃ jānaṃ passaṃ yathābhūtaṃ, yamidaṃ manosamphassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā tampi jānaṃ passaṃ yathābhūtaṃ, manasmiṃ na sārajjati, dhammesu na sārajjati, manoviññāṇe na sārajjati, manosamphasse na sārajjati, yamidaṃ manosamphassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā tasmimpi na sārajjati."
    ],
    "innerText": "432. ‘‘Sotaṃ , bhikkhave, jānaṃ passaṃ yathābhūtaṃ…pe… ghānaṃ bhikkhave, jānaṃ passaṃ yathābhūtaṃ…pe… jivhaṃ, bhikkhave, jānaṃ passaṃ yathābhūtaṃ… kāyaṃ, bhikkhave, jānaṃ passaṃ yathābhūtaṃ… manaṃ, bhikkhave, jānaṃ passaṃ yathābhūtaṃ, dhamme jānaṃ passaṃ yathābhūtaṃ, manoviññāṇaṃ jānaṃ passaṃ yathābhūtaṃ, manosamphassaṃ jānaṃ passaṃ yathābhūtaṃ, yamidaṃ manosamphassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā tampi jānaṃ passaṃ yathābhūtaṃ, manasmiṃ na sārajjati, dhammesu na sārajjati, manoviññāṇe na sārajjati, manosamphasse na sārajjati, yamidaṃ manosamphassapaccayā uppajjati vedayitaṃ sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā tasmimpi na sārajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tassa asārattassa asaṃyuttassa asammūḷhassa ādīnavānupassino viharato āyatiṃ pañcupādānakkhandhā apacayaṃ gacchanti. Taṇhā cassa ponobbhavikā nandīrāgasahagatā tatratatrābhinandinī ",
      ", sā cassa pahīyati. Tassa kāyikāpi darathā pahīyanti, cetasikāpi darathā pahīyanti; kāyikāpi santāpā pahīyanti, cetasikāpi santāpā pahīyanti; kāyikāpi pariḷāhā pahīyanti, cetasikāpi pariḷāhā pahīyanti. So kāyasukhampi cetosukhampi paṭisaṃvedeti."
    ],
    "innerText": "‘‘Tassa asārattassa asaṃyuttassa asammūḷhassa ādīnavānupassino viharato āyatiṃ pañcupādānakkhandhā apacayaṃ gacchanti. Taṇhā cassa ponobbhavikā nandīrāgasahagatā tatratatrābhinandinī , sā cassa pahīyati. Tassa kāyikāpi darathā pahīyanti, cetasikāpi darathā pahīyanti; kāyikāpi santāpā pahīyanti, cetasikāpi santāpā pahīyanti; kāyikāpi pariḷāhā pahīyanti, cetasikāpi pariḷāhā pahīyanti. So kāyasukhampi cetosukhampi paṭisaṃvedeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "433"
      },
      ". ‘‘Yā tathābhūtassa diṭṭhi sāssa hoti sammādiṭṭhi; yo tathābhūtassa saṅkappo svāssa hoti sammāsaṅkappo; yo tathābhūtassa vāyāmo svāssa hoti sammāvāyāmo; yā tathābhūtassa sati sāssa hoti sammāsati; yo tathābhūtassa samādhi svāssa hoti sammāsamādhi. Pubbeva kho panassa kāyakammaṃ vacīkammaṃ ājīvo suparisuddho hoti. Evamassāyaṃ ",
      " ariyo aṭṭhaṅgiko maggo bhāvanāpāripūriṃ gacchati."
    ],
    "innerText": "433. ‘‘Yā tathābhūtassa diṭṭhi sāssa hoti sammādiṭṭhi; yo tathābhūtassa saṅkappo svāssa hoti sammāsaṅkappo; yo tathābhūtassa vāyāmo svāssa hoti sammāvāyāmo; yā tathābhūtassa sati sāssa hoti sammāsati; yo tathābhūtassa samādhi svāssa hoti sammāsamādhi. Pubbeva kho panassa kāyakammaṃ vacīkammaṃ ājīvo suparisuddho hoti. Evamassāyaṃ ariyo aṭṭhaṅgiko maggo bhāvanāpāripūriṃ gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tassa evaṃ imaṃ ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāvayato cattāropi satipaṭṭhānā bhāvanāpāripūriṃ gacchanti, cattāropi sammappadhānā bhāvanāpāripūriṃ gacchanti, cattāropi iddhipādā bhāvanāpāripūriṃ gacchanti, pañcapi indriyāni bhāvanāpāripūriṃ gacchanti, pañcapi balāni bhāvanāpāripūriṃ gacchanti, sattapi bojjhaṅgā bhāvanāpāripūriṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tassime dve dhammā yuganandhā vattanti – samatho ca vipassanā ca. So ye dhammā abhiññā pariññeyyā te dhamme abhiññā parijānāti. Ye ",
      " dhammā abhiññā pahātabbā te dhamme abhiññā pajahati. Ye dhammā abhiññā bhāvetabbā te dhamme abhiññā bhāveti. Ye dhammā abhiññā sacchikātabbā te dhamme abhiññā sacchikaroti."
    ],
    "innerText": "‘‘Tassime dve dhammā yuganandhā vattanti – samatho ca vipassanā ca. So ye dhammā abhiññā pariññeyyā te dhamme abhiññā parijānāti. Ye dhammā abhiññā pahātabbā te dhamme abhiññā pajahati. Ye dhammā abhiññā bhāvetabbā te dhamme abhiññā bhāveti. Ye dhammā abhiññā sacchikātabbā te dhamme abhiññā sacchikaroti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame ca, bhikkhave, dhammā abhiññā pariññeyyā? ‘Pañcupādānakkhandhā’ tissa vacanīyaṃ, seyyathidaṃ – rūpupādānakkhandho, vedanupādānakkhandho, saññupādānakkhandho, saṅkhārupādānakkhandho, viññāṇupādānakkhandho. Ime dhammā abhiññā pariññeyyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame ca, bhikkhave, dhammā abhiññā pahātabbā? Avijjā ca bhavataṇhā ca – ime dhammā abhiññā pahātabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame ca, bhikkhave, dhammā abhiññā bhāvetabbā? Samatho ca vipassanā ca – ime dhammā abhiññā bhāvetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame ",
      " ca, bhikkhave, dhammā abhiññā sacchikātabbā? Vijjā ca vimutti ca – ime dhammā abhiññā sacchikātabbā’’ti."
    ],
    "innerText": "‘‘Katame ca, bhikkhave, dhammā abhiññā sacchikātabbā? Vijjā ca vimutti ca – ime dhammā abhiññā sacchikātabbā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idamavoca ",
      " bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti."
    ],
    "innerText": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahāsaḷāyatanikasuttaṃ niṭṭhitaṃ sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Nagaravindeyyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "434"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ yena nagaravindaṃ nāma kosalānaṃ brāhmaṇānaṃ gāmo tadavasari. Assosuṃ kho nagaravindeyyakā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nagaravindeyyā (ka.)]"
      },
      " brāhmaṇagahapatikā – ‘‘samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ ",
      " nagaravindaṃ anuppatto. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. So ",
      " imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’ti."
    ],
    "innerText": "434. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ yena nagaravindaṃ nāma kosalānaṃ brāhmaṇānaṃ gāmo tadavasari. Assosuṃ kho nagaravindeyyakā [nagaravindeyyā (ka.)] brāhmaṇagahapatikā – ‘‘samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ nagaravindaṃ anuppatto. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho nagaravindeyyakā brāhmaṇagahapatikā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā appekacce bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Appekacce bhagavatā saddhiṃ sammodiṃsu; sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Appekacce yena bhagavā tenañjaliṃ paṇāmetvā ekamantaṃ nisīdiṃsu. Appekacce bhagavato santike nāmagottaṃ sāvetvā ekamantaṃ nisīdiṃsu. Appekacce tuṇhībhūtā ekamantaṃ nisīdiṃsu. Ekamantaṃ ",
      " nisinne kho nagaravindeyyake brāhmaṇagahapatike bhagavā etadavoca –"
    ],
    "innerText": "Atha kho nagaravindeyyakā brāhmaṇagahapatikā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā appekacce bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Appekacce bhagavatā saddhiṃ sammodiṃsu; sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Appekacce yena bhagavā tenañjaliṃ paṇāmetvā ekamantaṃ nisīdiṃsu. Appekacce bhagavato santike nāmagottaṃ sāvetvā ekamantaṃ nisīdiṃsu. Appekacce tuṇhībhūtā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinne kho nagaravindeyyake brāhmaṇagahapatike bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "435"
      },
      ". ‘‘Sace vo, gahapatayo, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘kathaṃbhūtā, gahapatayo, samaṇabrāhmaṇā na sakkātabbā na garukātabbā na mānetabbā na pūjetabbā’ti? Evaṃ puṭṭhā tumhe, gahapatayo, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyātha – ‘ye te samaṇabrāhmaṇā cakkhuviññeyyesu rūpesu avītarāgā avītadosā avītamohā, ajjhattaṃ avūpasantacittā, samavisamaṃ caranti kāyena vācāya manasā, evarūpā samaṇabrāhmaṇā na sakkātabbā na garukātabbā na mānetabbā na pūjetabbā. Taṃ kissa hetu? Mayampi hi cakkhuviññeyyesu ",
      " rūpesu avītarāgā avītadosā avītamohā, ajjhattaṃ avūpasantacittā, samavisamaṃ carāma kāyena vācāya manasā, tesaṃ no samacariyampi hetaṃ uttari apassataṃ. Tasmā te bhonto samaṇabrāhmaṇā na sakkātabbā na garukātabbā na mānetabbā na pūjetabbā. Ye te samaṇabrāhmaṇā sotaviññeyyesu saddesu… ghānaviññeyyesu gandhesu… jivhāviññeyyesu rasesu… kāyaviññeyyesu phoṭṭhabbesu… manoviññeyyesu dhammesu avītarāgā avītadosā avītamohā, ajjhattaṃ avūpasantacittā, samavisamaṃ caranti kāyena vācāya manasā, evarūpā samaṇabrāhmaṇā na sakkātabbā na garukātabbā na mānetabbā na pūjetabbā. Taṃ kissa hetu? Mayampi hi manoviññeyyesu dhammesu ",
      " avītarāgā avītadosā avītamohā ",
      ", ajjhattaṃ ",
      " avūpasantacittā, samavisamaṃ carāma kāyena vācāya manasā, tesaṃ no samacariyampi hetaṃ uttari apassataṃ. Tasmā te bhonto samaṇabrāhmaṇā na sakkātabbā na garukātabbā na mānetabbā na pūjetabbā’ti. Evaṃ puṭṭhā tumhe, gahapatayo, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyātha."
    ],
    "innerText": "435. ‘‘Sace vo, gahapatayo, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘kathaṃbhūtā, gahapatayo, samaṇabrāhmaṇā na sakkātabbā na garukātabbā na mānetabbā na pūjetabbā’ti? Evaṃ puṭṭhā tumhe, gahapatayo, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyātha – ‘ye te samaṇabrāhmaṇā cakkhuviññeyyesu rūpesu avītarāgā avītadosā avītamohā, ajjhattaṃ avūpasantacittā, samavisamaṃ caranti kāyena vācāya manasā, evarūpā samaṇabrāhmaṇā na sakkātabbā na garukātabbā na mānetabbā na pūjetabbā. Taṃ kissa hetu? Mayampi hi cakkhuviññeyyesu rūpesu avītarāgā avītadosā avītamohā, ajjhattaṃ avūpasantacittā, samavisamaṃ carāma kāyena vācāya manasā, tesaṃ no samacariyampi hetaṃ uttari apassataṃ. Tasmā te bhonto samaṇabrāhmaṇā na sakkātabbā na garukātabbā na mānetabbā na pūjetabbā. Ye te samaṇabrāhmaṇā sotaviññeyyesu saddesu… ghānaviññeyyesu gandhesu… jivhāviññeyyesu rasesu… kāyaviññeyyesu phoṭṭhabbesu… manoviññeyyesu dhammesu avītarāgā avītadosā avītamohā, ajjhattaṃ avūpasantacittā, samavisamaṃ caranti kāyena vācāya manasā, evarūpā samaṇabrāhmaṇā na sakkātabbā na garukātabbā na mānetabbā na pūjetabbā. Taṃ kissa hetu? Mayampi hi manoviññeyyesu dhammesu avītarāgā avītadosā avītamohā , ajjhattaṃ avūpasantacittā, samavisamaṃ carāma kāyena vācāya manasā, tesaṃ no samacariyampi hetaṃ uttari apassataṃ. Tasmā te bhonto samaṇabrāhmaṇā na sakkātabbā na garukātabbā na mānetabbā na pūjetabbā’ti. Evaṃ puṭṭhā tumhe, gahapatayo, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyātha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "436"
      },
      ". ‘‘Sace pana vo, gahapatayo, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘kathaṃbhūtā, gahapatayo, samaṇabrāhmaṇā sakkātabbā garukātabbā mānetabbā pūjetabbā’ti? Evaṃ puṭṭhā tumhe, gahapatayo, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyātha – ‘ye te samaṇabrāhmaṇā cakkhuviññeyyesu rūpesu vītarāgā vītadosā vītamohā, ajjhattaṃ vūpasantacittā, samacariyaṃ caranti kāyena vācāya manasā, evarūpā samaṇabrāhmaṇā sakkātabbā garukātabbā mānetabbā pūjetabbā. Taṃ kissa hetu? Mayampi hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mayaṃ hi (?)]"
      },
      " cakkhuviññeyyesu rūpesu avītarāgā avītadosā avītamohā, ajjhattaṃ avūpasantacittā, samavisamaṃ carāma kāyena vācāya manasā, tesaṃ no samacariyampi hetaṃ uttari passataṃ. Tasmā te bhonto samaṇabrāhmaṇā sakkātabbā garukātabbā mānetabbā pūjetabbā. Ye te samaṇabrāhmaṇā sotaviññeyyesu saddesu… ghānaviññeyyesu gandhesu… jivhāviññeyyesu rasesu… kāyaviññeyyesu phoṭṭhabbesu… manoviññeyyesu ",
      " dhammesu vītarāgā vītadosā vītamohā, ajjhattaṃ vūpasantacittā, samacariyaṃ caranti kāyena vācāya manasā, evarūpā samaṇabrāhmaṇā sakkātabbā garukātabbā mānetabbā pūjetabbā. Taṃ kissa hetu? Mayampi hi manoviññeyyesu dhammesu avītarāgā avītadosā avītamohā ajjhattaṃ avūpasantacittā, samavisamaṃ carāma kāyena vācāya manasā, tesaṃ no samacariyampi hetaṃ uttari passataṃ. Tasmā te bhonto samaṇabrāhmaṇā sakkātabbā garukātabbā mānetabbā pūjetabbā’ti ",
      ". Evaṃ puṭṭhā tumhe, gahapatayo, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyātha."
    ],
    "innerText": "436. ‘‘Sace pana vo, gahapatayo, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘kathaṃbhūtā, gahapatayo, samaṇabrāhmaṇā sakkātabbā garukātabbā mānetabbā pūjetabbā’ti? Evaṃ puṭṭhā tumhe, gahapatayo, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyātha – ‘ye te samaṇabrāhmaṇā cakkhuviññeyyesu rūpesu vītarāgā vītadosā vītamohā, ajjhattaṃ vūpasantacittā, samacariyaṃ caranti kāyena vācāya manasā, evarūpā samaṇabrāhmaṇā sakkātabbā garukātabbā mānetabbā pūjetabbā. Taṃ kissa hetu? Mayampi hi [mayaṃ hi (?)] cakkhuviññeyyesu rūpesu avītarāgā avītadosā avītamohā, ajjhattaṃ avūpasantacittā, samavisamaṃ carāma kāyena vācāya manasā, tesaṃ no samacariyampi hetaṃ uttari passataṃ. Tasmā te bhonto samaṇabrāhmaṇā sakkātabbā garukātabbā mānetabbā pūjetabbā. Ye te samaṇabrāhmaṇā sotaviññeyyesu saddesu… ghānaviññeyyesu gandhesu… jivhāviññeyyesu rasesu… kāyaviññeyyesu phoṭṭhabbesu… manoviññeyyesu dhammesu vītarāgā vītadosā vītamohā, ajjhattaṃ vūpasantacittā, samacariyaṃ caranti kāyena vācāya manasā, evarūpā samaṇabrāhmaṇā sakkātabbā garukātabbā mānetabbā pūjetabbā. Taṃ kissa hetu? Mayampi hi manoviññeyyesu dhammesu avītarāgā avītadosā avītamohā ajjhattaṃ avūpasantacittā, samavisamaṃ carāma kāyena vācāya manasā, tesaṃ no samacariyampi hetaṃ uttari passataṃ. Tasmā te bhonto samaṇabrāhmaṇā sakkātabbā garukātabbā mānetabbā pūjetabbā’ti . Evaṃ puṭṭhā tumhe, gahapatayo, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyātha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "437"
      },
      ". ‘‘Sace pana vo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sace te (syā. kaṃ. pī. ka.)]"
      },
      ", gahapatayo, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘ke panāyasmantānaṃ ākārā, ke anvayā, yena tumhe āyasmanto ",
      " evaṃ vadetha? Addhā te āyasmanto vītarāgā ",
      " vā rāgavinayāya vā paṭipannā, vītadosā vā dosavinayāya vā paṭipannā, vītamohā vā mohavinayāya vā paṭipannā’ti? Evaṃ puṭṭhā tumhe, gahapatayo, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyātha – ‘tathā hi te āyasmanto araññavanapatthāni pantāni senāsanāni paṭisevanti. Natthi kho pana tattha tathārūpā cakkhuviññeyyā rūpā ye disvā disvā abhirameyyuṃ, natthi kho pana tattha tathārūpā sotaviññeyyā saddā ye sutvā sutvā abhirameyyuṃ, natthi kho pana tattha tathārūpā ghānaviññeyyā gandhā ye ghāyitvā ghāyitvā abhirameyyuṃ ",
      ", natthi kho pana tattha tathārūpā jivhāviññeyyā rasā ye sāyitvā sāyitvā abhirameyyuṃ, natthi kho pana tattha tathārūpā kāyaviññeyyā phoṭṭhabbā ye phusitvā phusitvā abhirameyyuṃ. Ime kho no, āvuso, ākārā, ime anvayā, yena mayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yena mayaṃ āyasmanto (sī. pī.), yena mayaṃ āyasmante (syā. kaṃ.)]"
      },
      " evaṃ vadema – addhā te āyasmanto vītarāgā vā rāgavinayāya vā paṭipannā, vītadosā vā dosavinayāya vā paṭipannā, vītamohā vā mohavinayāya vā paṭipannā’ti. Evaṃ puṭṭhā tumhe, gahapatayo, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyāthā’’ti."
    ],
    "innerText": "437. ‘‘Sace pana vo [sace te (syā. kaṃ. pī. ka.)], gahapatayo, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘ke panāyasmantānaṃ ākārā, ke anvayā, yena tumhe āyasmanto evaṃ vadetha? Addhā te āyasmanto vītarāgā vā rāgavinayāya vā paṭipannā, vītadosā vā dosavinayāya vā paṭipannā, vītamohā vā mohavinayāya vā paṭipannā’ti? Evaṃ puṭṭhā tumhe, gahapatayo, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyātha – ‘tathā hi te āyasmanto araññavanapatthāni pantāni senāsanāni paṭisevanti. Natthi kho pana tattha tathārūpā cakkhuviññeyyā rūpā ye disvā disvā abhirameyyuṃ, natthi kho pana tattha tathārūpā sotaviññeyyā saddā ye sutvā sutvā abhirameyyuṃ, natthi kho pana tattha tathārūpā ghānaviññeyyā gandhā ye ghāyitvā ghāyitvā abhirameyyuṃ , natthi kho pana tattha tathārūpā jivhāviññeyyā rasā ye sāyitvā sāyitvā abhirameyyuṃ, natthi kho pana tattha tathārūpā kāyaviññeyyā phoṭṭhabbā ye phusitvā phusitvā abhirameyyuṃ. Ime kho no, āvuso, ākārā, ime anvayā, yena mayaṃ [yena mayaṃ āyasmanto (sī. pī.), yena mayaṃ āyasmante (syā. kaṃ.)] evaṃ vadema – addhā te āyasmanto vītarāgā vā rāgavinayāya vā paṭipannā, vītadosā vā dosavinayāya vā paṭipannā, vītamohā vā mohavinayāya vā paṭipannā’ti. Evaṃ puṭṭhā tumhe, gahapatayo, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyāthā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ vutte, nagaravindeyyakā brāhmaṇagahapatikā bhagavantaṃ etadavocuṃ – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Ete mayaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāma dhammañca bhikkhusaṅghañca. Upāsake no bhavaṃ gotamo dhāretu ajjatagge pāṇupete saraṇaṃ gate’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nagaravindeyyasuttaṃ niṭṭhitaṃ aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Piṇḍapātapārisuddhisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "438"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho āyasmā sāriputto sāyanhasamayaṃ paṭisallānā ",
      " vuṭṭhito yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ sāriputtaṃ bhagavā etadavoca –"
    ],
    "innerText": "438. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho āyasmā sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ sāriputtaṃ bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Vippasannāni ",
      " kho te, sāriputta, indriyāni, parisuddho chavivaṇṇo pariyodāto. Katamena kho tvaṃ, sāriputta, vihārena etarahi bahulaṃ viharasī’’ti? ‘‘Suññatāvihārena kho ahaṃ, bhante, etarahi bahulaṃ viharāmī’’ti. ‘‘Sādhu, sādhu, sāriputta! Mahāpurisavihārena kira tvaṃ, sāriputta, etarahi bahulaṃ viharasi. Mahāpurisavihāro eso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[hesa (sī. syā. kaṃ. pī.)]"
      },
      ", sāriputta, yadidaṃ – suññatā. Tasmātiha, sāriputta, bhikkhu sace ākaṅkheyya – ‘suññatāvihārena bahulaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[etarahi bahulaṃ (sī. pī.)]"
      },
      " vihareyya’nti, tena, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘yena cāhaṃ maggena gāmaṃ piṇḍāya pāvisiṃ, yasmiñca padese piṇḍāya acariṃ, yena ca maggena gāmato piṇḍāya paṭikkamiṃ, atthi nu kho me tattha cakkhuviññeyyesu rūpesu chando vā rāgo vā doso vā moho vā paṭighaṃ vāpi cetaso’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘yena cāhaṃ maggena gāmaṃ piṇḍāya pāvisiṃ, yasmiñca padese piṇḍāya acariṃ, yena ca maggena gāmato piṇḍāya paṭikkamiṃ, atthi me tattha cakkhuviññeyyesu rūpesu chando vā rāgo vā doso vā moho vā paṭighaṃ vāpi cetaso’ti, tena, sāriputta, bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘yena cāhaṃ maggena gāmaṃ piṇḍāya pāvisiṃ, yasmiñca padese piṇḍāya acariṃ, yena ",
      " ca maggena gāmato piṇḍāya paṭikkamiṃ, natthi me tattha cakkhuviññeyyesu rūpesu chando vā rāgo vā doso vā moho vā paṭighaṃ vāpi cetaso’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
    ],
    "innerText": "‘‘Vippasannāni kho te, sāriputta, indriyāni, parisuddho chavivaṇṇo pariyodāto. Katamena kho tvaṃ, sāriputta, vihārena etarahi bahulaṃ viharasī’’ti? ‘‘Suññatāvihārena kho ahaṃ, bhante, etarahi bahulaṃ viharāmī’’ti. ‘‘Sādhu, sādhu, sāriputta! Mahāpurisavihārena kira tvaṃ, sāriputta, etarahi bahulaṃ viharasi. Mahāpurisavihāro eso [hesa (sī. syā. kaṃ. pī.)], sāriputta, yadidaṃ – suññatā. Tasmātiha, sāriputta, bhikkhu sace ākaṅkheyya – ‘suññatāvihārena bahulaṃ [etarahi bahulaṃ (sī. pī.)] vihareyya’nti, tena, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘yena cāhaṃ maggena gāmaṃ piṇḍāya pāvisiṃ, yasmiñca padese piṇḍāya acariṃ, yena ca maggena gāmato piṇḍāya paṭikkamiṃ, atthi nu kho me tattha cakkhuviññeyyesu rūpesu chando vā rāgo vā doso vā moho vā paṭighaṃ vāpi cetaso’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘yena cāhaṃ maggena gāmaṃ piṇḍāya pāvisiṃ, yasmiñca padese piṇḍāya acariṃ, yena ca maggena gāmato piṇḍāya paṭikkamiṃ, atthi me tattha cakkhuviññeyyesu rūpesu chando vā rāgo vā doso vā moho vā paṭighaṃ vāpi cetaso’ti, tena, sāriputta, bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘yena cāhaṃ maggena gāmaṃ piṇḍāya pāvisiṃ, yasmiñca padese piṇḍāya acariṃ, yena ca maggena gāmato piṇḍāya paṭikkamiṃ, natthi me tattha cakkhuviññeyyesu rūpesu chando vā rāgo vā doso vā moho vā paṭighaṃ vāpi cetaso’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "439"
      },
      ". ‘‘Puna ",
      " caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘yena cāhaṃ maggena gāmaṃ piṇḍāya pāvisiṃ, yasmiñca padese piṇḍāya acariṃ, yena ca maggena gāmato piṇḍāya paṭikkamiṃ, atthi nu kho me tattha sotaviññeyyesu saddesu…pe… ghānaviññeyyesu gandhesu… jivhāviññeyyesu rasesu ",
      "… kāyaviññeyyesu phoṭṭhabbesu… manoviññeyyesu dhammesu chando vā rāgo vā doso vā moho vā paṭighaṃ vāpi cetaso’ti? Sace ",
      ", sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘yena cāhaṃ maggena gāmaṃ piṇḍāya pāvisiṃ, yasmiñca padese piṇḍāya acariṃ, yena ca maggena gāmato piṇḍāya paṭikkamiṃ, atthi me tattha manoviññeyyesu dhammesu chando vā rāgo vā doso ",
      " vā moho vā paṭighaṃ vāpi cetaso’ti, tena, sāriputta, bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘yena cāhaṃ maggena gāmaṃ piṇḍāya pāvisiṃ, yasmiñca padese piṇḍāya acariṃ, yena ca maggena gāmato piṇḍāya paṭikkamiṃ, natthi me tattha manoviññeyyesu dhammesu chando vā rāgo vā doso vā moho vā paṭighaṃ vāpi cetaso’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
    ],
    "innerText": "439. ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘yena cāhaṃ maggena gāmaṃ piṇḍāya pāvisiṃ, yasmiñca padese piṇḍāya acariṃ, yena ca maggena gāmato piṇḍāya paṭikkamiṃ, atthi nu kho me tattha sotaviññeyyesu saddesu…pe… ghānaviññeyyesu gandhesu… jivhāviññeyyesu rasesu … kāyaviññeyyesu phoṭṭhabbesu… manoviññeyyesu dhammesu chando vā rāgo vā doso vā moho vā paṭighaṃ vāpi cetaso’ti? Sace , sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘yena cāhaṃ maggena gāmaṃ piṇḍāya pāvisiṃ, yasmiñca padese piṇḍāya acariṃ, yena ca maggena gāmato piṇḍāya paṭikkamiṃ, atthi me tattha manoviññeyyesu dhammesu chando vā rāgo vā doso vā moho vā paṭighaṃ vāpi cetaso’ti, tena, sāriputta, bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘yena cāhaṃ maggena gāmaṃ piṇḍāya pāvisiṃ, yasmiñca padese piṇḍāya acariṃ, yena ca maggena gāmato piṇḍāya paṭikkamiṃ, natthi me tattha manoviññeyyesu dhammesu chando vā rāgo vā doso vā moho vā paṭighaṃ vāpi cetaso’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "440"
      },
      ". ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘pahīnā nu kho me pañca kāmaguṇā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘appahīnā kho me pañca kāmaguṇā’ti, tena, sāriputta, bhikkhunā pañcannaṃ kāmaguṇānaṃ pahānāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘pahīnā kho me pañca kāmaguṇā’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
    ],
    "innerText": "440. ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘pahīnā nu kho me pañca kāmaguṇā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘appahīnā kho me pañca kāmaguṇā’ti, tena, sāriputta, bhikkhunā pañcannaṃ kāmaguṇānaṃ pahānāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘pahīnā kho me pañca kāmaguṇā’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "441"
      },
      ". ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘pahīnā nu kho me pañca nīvaraṇā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘appahīnā kho me pañca nīvaraṇā’ti, tena, sāriputta, bhikkhunā pañcannaṃ nīvaraṇānaṃ pahānāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘pahīnā kho ",
      " me pañca nīvaraṇā’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
    ],
    "innerText": "441. ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘pahīnā nu kho me pañca nīvaraṇā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘appahīnā kho me pañca nīvaraṇā’ti, tena, sāriputta, bhikkhunā pañcannaṃ nīvaraṇānaṃ pahānāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘pahīnā kho me pañca nīvaraṇā’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "442"
      },
      ". ‘‘Puna ",
      " caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘pariññātā nu kho me pañcupādānakkhandhā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘apariññātā kho me pañcupādānakkhandhā’ti, tena, sāriputta, bhikkhunā ",
      " pañcannaṃ upādānakkhandhānaṃ pariññāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno ",
      " evaṃ jānāti – ‘pariññātā kho me pañcupādānakkhandhā’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
    ],
    "innerText": "442. ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘pariññātā nu kho me pañcupādānakkhandhā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘apariññātā kho me pañcupādānakkhandhā’ti, tena, sāriputta, bhikkhunā pañcannaṃ upādānakkhandhānaṃ pariññāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘pariññātā kho me pañcupādānakkhandhā’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "443"
      },
      ". ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘bhāvitā nu kho me cattāro satipaṭṭhānā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhāvitā kho me cattāro satipaṭṭhānā’ti, tena, sāriputta, bhikkhunā catunnaṃ satipaṭṭhānānaṃ bhāvanāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhāvitā kho me cattāro satipaṭṭhānā’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
    ],
    "innerText": "443. ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘bhāvitā nu kho me cattāro satipaṭṭhānā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhāvitā kho me cattāro satipaṭṭhānā’ti, tena, sāriputta, bhikkhunā catunnaṃ satipaṭṭhānānaṃ bhāvanāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhāvitā kho me cattāro satipaṭṭhānā’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "444"
      },
      ". ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘bhāvitā nu kho me cattāro sammappadhānā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhāvitā kho me cattāro sammappadhānā’ti, tena, sāriputta, bhikkhunā catunnaṃ sammappadhānānaṃ bhāvanāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhāvitā kho me cattāro sammappadhānā’ti ",
      ", tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
    ],
    "innerText": "444. ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘bhāvitā nu kho me cattāro sammappadhānā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhāvitā kho me cattāro sammappadhānā’ti, tena, sāriputta, bhikkhunā catunnaṃ sammappadhānānaṃ bhāvanāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhāvitā kho me cattāro sammappadhānā’ti , tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "445"
      },
      ". ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘bhāvitā nu kho me cattāro iddhipādā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhāvitā kho me cattāro iddhipādā’ti, tena, sāriputta, bhikkhunā catunnaṃ iddhipādānaṃ bhāvanāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhāvitā kho me cattāro iddhipādā’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
    ],
    "innerText": "445. ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘bhāvitā nu kho me cattāro iddhipādā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhāvitā kho me cattāro iddhipādā’ti, tena, sāriputta, bhikkhunā catunnaṃ iddhipādānaṃ bhāvanāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhāvitā kho me cattāro iddhipādā’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "446"
      },
      ". ‘‘Puna ",
      " caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘bhāvitāni nu kho me pañcindriyānī’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhāvitāni kho me pañcindriyānī’ti, tena, sāriputta, bhikkhunā pañcannaṃ indriyānaṃ bhāvanāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno ",
      " evaṃ jānāti – ‘bhāvitāni kho me pañcindriyānī’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
    ],
    "innerText": "446. ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘bhāvitāni nu kho me pañcindriyānī’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhāvitāni kho me pañcindriyānī’ti, tena, sāriputta, bhikkhunā pañcannaṃ indriyānaṃ bhāvanāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhāvitāni kho me pañcindriyānī’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "447"
      },
      ". ‘‘Puna ",
      " caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘bhāvitāni nu kho me pañca balānī’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhāvitāni kho me pañca balānī’ti, tena, sāriputta, bhikkhunā pañcannaṃ balānaṃ bhāvanāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhāvitāni kho me pañca balānī’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
    ],
    "innerText": "447. ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘bhāvitāni nu kho me pañca balānī’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhāvitāni kho me pañca balānī’ti, tena, sāriputta, bhikkhunā pañcannaṃ balānaṃ bhāvanāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhāvitāni kho me pañca balānī’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "448"
      },
      ". ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘bhāvitā nu kho me satta bojjhaṅgā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhāvitā kho me satta bojjhaṅgā’ti, tena, sāriputta, bhikkhunā sattannaṃ bojjhaṅgānaṃ bhāvanāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhāvitā kho me satta bojjhaṅgā’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
    ],
    "innerText": "448. ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘bhāvitā nu kho me satta bojjhaṅgā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhāvitā kho me satta bojjhaṅgā’ti, tena, sāriputta, bhikkhunā sattannaṃ bojjhaṅgānaṃ bhāvanāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhāvitā kho me satta bojjhaṅgā’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "449"
      },
      ". ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘bhāvito nu kho me ariyo aṭṭhaṅgiko maggo’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhāvito kho me ariyo aṭṭhaṅgiko maggo’ti, tena, sāriputta, bhikkhunā ariyassa aṭṭhaṅgikassa maggassa bhāvanāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhāvito kho me ariyo aṭṭhaṅgiko ",
      " maggo’ti ",
      ", tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
    ],
    "innerText": "449. ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘bhāvito nu kho me ariyo aṭṭhaṅgiko maggo’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhāvito kho me ariyo aṭṭhaṅgiko maggo’ti, tena, sāriputta, bhikkhunā ariyassa aṭṭhaṅgikassa maggassa bhāvanāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhāvito kho me ariyo aṭṭhaṅgiko maggo’ti , tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "450"
      },
      ". ‘‘Puna ",
      " caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘bhāvitā nu kho me samatho ca vipassanā cā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhāvitā kho me samatho ca vipassanā cā’ti, tena, sāriputta, bhikkhunā samathavipassanānaṃ bhāvanāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhāvitā kho ",
      " me samatho ca vipassanā cā’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
    ],
    "innerText": "450. ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘bhāvitā nu kho me samatho ca vipassanā cā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhāvitā kho me samatho ca vipassanā cā’ti, tena, sāriputta, bhikkhunā samathavipassanānaṃ bhāvanāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhāvitā kho me samatho ca vipassanā cā’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "451"
      },
      ". ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘sacchikatā nu kho me vijjā ca vimutti cā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘asacchikatā kho me vijjā ca vimutti cā’ti, tena, sāriputta, bhikkhunā vijjāya vimuttiyā sacchikiriyāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘sacchikatā kho me vijjā ca vimutti cā’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
    ],
    "innerText": "451. ‘‘Puna caparaṃ, sāriputta, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘sacchikatā nu kho me vijjā ca vimutti cā’ti? Sace, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘asacchikatā kho me vijjā ca vimutti cā’ti, tena, sāriputta, bhikkhunā vijjāya vimuttiyā sacchikiriyāya vāyamitabbaṃ. Sace pana, sāriputta, bhikkhu paccavekkhamāno evaṃ jānāti – ‘sacchikatā kho me vijjā ca vimutti cā’ti, tena, sāriputta, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "452"
      },
      ". ‘‘Ye hi keci, sāriputta, atītamaddhānaṃ samaṇā vā brāhmaṇā vā piṇḍapātaṃ parisodhesuṃ, sabbe te evameva paccavekkhitvā ",
      " paccavekkhitvā piṇḍapātaṃ parisodhesuṃ. Yepi hi keci, sāriputta, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā piṇḍapātaṃ parisodhessanti, sabbe te evameva paccavekkhitvā paccavekkhitvā piṇḍapātaṃ parisodhessanti. Yepi hi keci, sāriputta, etarahi samaṇā vā brāhmaṇā vā piṇḍapātaṃ parisodhenti, sabbe te evameva paccavekkhitvā paccavekkhitvā piṇḍapātaṃ parisodhenti. Tasmātiha, sāriputta ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vo sāriputta evaṃ sikkhitabbaṃ (sī. pī.)]"
      },
      ", ‘paccavekkhitvā paccavekkhitvā piṇḍapātaṃ parisodhessāmā’ti – evañhi vo, sāriputta, sikkhitabba’’nti."
    ],
    "innerText": "452. ‘‘Ye hi keci, sāriputta, atītamaddhānaṃ samaṇā vā brāhmaṇā vā piṇḍapātaṃ parisodhesuṃ, sabbe te evameva paccavekkhitvā paccavekkhitvā piṇḍapātaṃ parisodhesuṃ. Yepi hi keci, sāriputta, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā piṇḍapātaṃ parisodhessanti, sabbe te evameva paccavekkhitvā paccavekkhitvā piṇḍapātaṃ parisodhessanti. Yepi hi keci, sāriputta, etarahi samaṇā vā brāhmaṇā vā piṇḍapātaṃ parisodhenti, sabbe te evameva paccavekkhitvā paccavekkhitvā piṇḍapātaṃ parisodhenti. Tasmātiha, sāriputta [vo sāriputta evaṃ sikkhitabbaṃ (sī. pī.)], ‘paccavekkhitvā paccavekkhitvā piṇḍapātaṃ parisodhessāmā’ti – evañhi vo, sāriputta, sikkhitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Attamano āyasmā sāriputto bhagavato bhāsitaṃ abhinandīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Piṇḍapātapārisuddhisuttaṃ niṭṭhitaṃ navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Indriyabhāvanāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "453"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā gajaṅgalāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kajaṅgalāyaṃ (sī. pī.), kajjaṅgalāyaṃ (syā. kaṃ.)]"
      },
      " viharati suveḷuvane ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[veḷuvane (syā. kaṃ.), mukheluvane (sī. pī.)]"
      },
      ". Atha kho uttaro māṇavo pārāsiviyantevāsī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pārāsariyantevāsī (sī. pī.), pārāsiriyantevāsī (syā. kaṃ.)]"
      },
      " yena bhagavā ",
      " tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho uttaraṃ māṇavaṃ pārāsiviyantevāsiṃ bhagavā etadavoca – ‘‘deseti, uttara, pārāsiviyo brāhmaṇo sāvakānaṃ indriyabhāvana’’nti? ‘‘Deseti, bho gotama, pārāsiviyo brāhmaṇo sāvakānaṃ indriyabhāvana’’nti. ‘‘Yathā kathaṃ pana, uttara, deseti pārāsiviyo brāhmaṇo sāvakānaṃ indriyabhāvana’’nti? ‘‘Idha, bho gotama, cakkhunā rūpaṃ na passati, sotena saddaṃ na suṇāti – evaṃ kho, bho gotama, deseti pārāsiviyo brāhmaṇo sāvakānaṃ indriyabhāvana’’nti. ‘‘Evaṃ sante kho, uttara, andho bhāvitindriyo bhavissati, badhiro bhāvitindriyo bhavissati; yathā pārāsiviyassa brāhmaṇassa vacanaṃ. Andho hi, uttara, cakkhunā rūpaṃ na passati, badhiro sotena saddaṃ na suṇātī’’ti. Evaṃ vutte, uttaro māṇavo pārāsiviyantevāsī tuṇhībhūto maṅkubhūto pattakkhandho adhomukho pajjhāyanto appaṭibhāno nisīdi."
    ],
    "innerText": "453. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā gajaṅgalāyaṃ [kajaṅgalāyaṃ (sī. pī.), kajjaṅgalāyaṃ (syā. kaṃ.)] viharati suveḷuvane [veḷuvane (syā. kaṃ.), mukheluvane (sī. pī.)]. Atha kho uttaro māṇavo pārāsiviyantevāsī [pārāsariyantevāsī (sī. pī.), pārāsiriyantevāsī (syā. kaṃ.)] yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho uttaraṃ māṇavaṃ pārāsiviyantevāsiṃ bhagavā etadavoca – ‘‘deseti, uttara, pārāsiviyo brāhmaṇo sāvakānaṃ indriyabhāvana’’nti? ‘‘Deseti, bho gotama, pārāsiviyo brāhmaṇo sāvakānaṃ indriyabhāvana’’nti. ‘‘Yathā kathaṃ pana, uttara, deseti pārāsiviyo brāhmaṇo sāvakānaṃ indriyabhāvana’’nti? ‘‘Idha, bho gotama, cakkhunā rūpaṃ na passati, sotena saddaṃ na suṇāti – evaṃ kho, bho gotama, deseti pārāsiviyo brāhmaṇo sāvakānaṃ indriyabhāvana’’nti. ‘‘Evaṃ sante kho, uttara, andho bhāvitindriyo bhavissati, badhiro bhāvitindriyo bhavissati; yathā pārāsiviyassa brāhmaṇassa vacanaṃ. Andho hi, uttara, cakkhunā rūpaṃ na passati, badhiro sotena saddaṃ na suṇātī’’ti. Evaṃ vutte, uttaro māṇavo pārāsiviyantevāsī tuṇhībhūto maṅkubhūto pattakkhandho adhomukho pajjhāyanto appaṭibhāno nisīdi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā uttaraṃ māṇavaṃ pārāsiviyantevāsiṃ tuṇhībhūtaṃ ",
      " maṅkubhūtaṃ pattakkhandhaṃ adhomukhaṃ pajjhāyantaṃ appaṭibhānaṃ viditvā āyasmantaṃ ānandaṃ āmantesi – ‘‘aññathā kho, ānanda, deseti pārāsiviyo brāhmaṇo sāvakānaṃ indriyabhāvanaṃ, aññathā ca panānanda, ariyassa vinaye anuttarā indriyabhāvanā hotī’’ti. ‘‘Etassa, bhagavā, kālo; etassa, sugata, kālo yaṃ bhagavā ariyassa ",
      " vinaye anuttaraṃ indriyabhāvanaṃ deseyya. Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tenahānanda, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paccassosi. Bhagavā etadavoca –"
    ],
    "innerText": "Atha kho bhagavā uttaraṃ māṇavaṃ pārāsiviyantevāsiṃ tuṇhībhūtaṃ maṅkubhūtaṃ pattakkhandhaṃ adhomukhaṃ pajjhāyantaṃ appaṭibhānaṃ viditvā āyasmantaṃ ānandaṃ āmantesi – ‘‘aññathā kho, ānanda, deseti pārāsiviyo brāhmaṇo sāvakānaṃ indriyabhāvanaṃ, aññathā ca panānanda, ariyassa vinaye anuttarā indriyabhāvanā hotī’’ti. ‘‘Etassa, bhagavā, kālo; etassa, sugata, kālo yaṃ bhagavā ariyassa vinaye anuttaraṃ indriyabhāvanaṃ deseyya. Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tenahānanda, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paccassosi. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "454"
      },
      ". ‘‘Kathañcānanda, ariyassa vinaye anuttarā indriyabhāvanā hoti? Idhānanda, bhikkhuno cakkhunā rūpaṃ disvā uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ manāpaṃ, uppannaṃ amanāpaṃ, uppannaṃ manāpāmanāpaṃ ",
      ". Tañca kho saṅkhataṃ oḷārikaṃ paṭiccasamuppannaṃ. Etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ – upekkhā’ti. Tassa taṃ uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati; upekkhā saṇṭhāti. Seyyathāpi, ānanda, cakkhumā puriso ummīletvā vā nimīleyya, nimīletvā vā ummīleyya; evameva kho, ānanda, yassa kassaci evaṃsīghaṃ evaṃtuvaṭaṃ ",
      " evaṃappakasirena uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati, upekkhā saṇṭhāti – ayaṃ vuccatānanda, ariyassa ",
      " vinaye anuttarā indriyabhāvanā cakkhuviññeyyesu rūpesu."
    ],
    "innerText": "454. ‘‘Kathañcānanda, ariyassa vinaye anuttarā indriyabhāvanā hoti? Idhānanda, bhikkhuno cakkhunā rūpaṃ disvā uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ manāpaṃ, uppannaṃ amanāpaṃ, uppannaṃ manāpāmanāpaṃ . Tañca kho saṅkhataṃ oḷārikaṃ paṭiccasamuppannaṃ. Etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ – upekkhā’ti. Tassa taṃ uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati; upekkhā saṇṭhāti. Seyyathāpi, ānanda, cakkhumā puriso ummīletvā vā nimīleyya, nimīletvā vā ummīleyya; evameva kho, ānanda, yassa kassaci evaṃsīghaṃ evaṃtuvaṭaṃ evaṃappakasirena uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati, upekkhā saṇṭhāti – ayaṃ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā cakkhuviññeyyesu rūpesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "455"
      },
      ". ‘‘Puna caparaṃ, ānanda, bhikkhuno sotena saddaṃ sutvā uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ manāpaṃ, uppannaṃ amanāpaṃ, uppannaṃ manāpāmanāpaṃ. Tañca kho saṅkhataṃ oḷārikaṃ paṭiccasamuppannaṃ. Etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ – upekkhā’ti. Tassa taṃ uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati; upekkhā saṇṭhāti. Seyyathāpi, ānanda, balavā puriso appakasireneva accharaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[accharikaṃ (syā. kaṃ. pī. ka.)]"
      },
      " pahareyya; evameva kho, ānanda, yassa kassaci evaṃsīghaṃ evaṃtuvaṭaṃ evaṃappakasirena uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati, upekkhā saṇṭhāti – ayaṃ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā sotaviññeyyesu saddesu."
    ],
    "innerText": "455. ‘‘Puna caparaṃ, ānanda, bhikkhuno sotena saddaṃ sutvā uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ manāpaṃ, uppannaṃ amanāpaṃ, uppannaṃ manāpāmanāpaṃ. Tañca kho saṅkhataṃ oḷārikaṃ paṭiccasamuppannaṃ. Etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ – upekkhā’ti. Tassa taṃ uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati; upekkhā saṇṭhāti. Seyyathāpi, ānanda, balavā puriso appakasireneva accharaṃ [accharikaṃ (syā. kaṃ. pī. ka.)] pahareyya; evameva kho, ānanda, yassa kassaci evaṃsīghaṃ evaṃtuvaṭaṃ evaṃappakasirena uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati, upekkhā saṇṭhāti – ayaṃ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā sotaviññeyyesu saddesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "456"
      },
      ". ‘‘Puna caparaṃ, ānanda, bhikkhuno ghānena gandhaṃ ghāyitvā uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ manāpaṃ, uppannaṃ amanāpaṃ, uppannaṃ manāpāmanāpaṃ. Tañca kho saṅkhataṃ oḷārikaṃ paṭiccasamuppannaṃ. Etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ – upekkhā’ti. Tassa taṃ uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati; upekkhā saṇṭhāti. Seyyathāpi, ānanda ",
      ", īsakaṃpoṇe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[īsakapoṇe (sī. syā. kaṃ. pī.), īsakaphaṇe (sī. aṭṭha.), ‘‘majjhe uccaṃ hutvā’’ti ṭīkāya saṃsanditabbā]"
      },
      " padumapalāse ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paduminipatte (sī. syā. kaṃ. pī.)]"
      },
      " udakaphusitāni pavattanti, na saṇṭhanti; evameva kho, ānanda, yassa kassaci evaṃsīghaṃ evaṃtuvaṭaṃ evaṃappakasirena uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati, upekkhā saṇṭhāti – ayaṃ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā ghānaviññeyyesu gandhesu."
    ],
    "innerText": "456. ‘‘Puna caparaṃ, ānanda, bhikkhuno ghānena gandhaṃ ghāyitvā uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ manāpaṃ, uppannaṃ amanāpaṃ, uppannaṃ manāpāmanāpaṃ. Tañca kho saṅkhataṃ oḷārikaṃ paṭiccasamuppannaṃ. Etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ – upekkhā’ti. Tassa taṃ uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati; upekkhā saṇṭhāti. Seyyathāpi, ānanda , īsakaṃpoṇe [īsakapoṇe (sī. syā. kaṃ. pī.), īsakaphaṇe (sī. aṭṭha.), ‘‘majjhe uccaṃ hutvā’’ti ṭīkāya saṃsanditabbā] padumapalāse [paduminipatte (sī. syā. kaṃ. pī.)] udakaphusitāni pavattanti, na saṇṭhanti; evameva kho, ānanda, yassa kassaci evaṃsīghaṃ evaṃtuvaṭaṃ evaṃappakasirena uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati, upekkhā saṇṭhāti – ayaṃ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā ghānaviññeyyesu gandhesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "457"
      },
      ". ‘‘Puna caparaṃ, ānanda, bhikkhuno jivhāya rasaṃ sāyitvā uppajjati manāpaṃ, uppajjati ",
      " amanāpaṃ, uppajjati manāpāmanāpaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ manāpaṃ, uppannaṃ amanāpaṃ, uppannaṃ manāpāmanāpaṃ. Tañca kho saṅkhataṃ oḷārikaṃ paṭiccasamuppannaṃ. Etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ – upekkhā’ti. Tassa taṃ uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati; upekkhā saṇṭhāti ",
      ". Seyyathāpi, ānanda, balavā puriso jivhagge kheḷapiṇḍaṃ saṃyūhitvā appakasirena vameyya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sandhameyya (ka.)]"
      },
      "; evameva kho, ānanda, yassa kassaci evaṃsīghaṃ evaṃtuvaṭaṃ evaṃappakasirena uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati, upekkhā saṇṭhāti – ayaṃ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā jivhāviññeyyesu rasesu."
    ],
    "innerText": "457. ‘‘Puna caparaṃ, ānanda, bhikkhuno jivhāya rasaṃ sāyitvā uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ manāpaṃ, uppannaṃ amanāpaṃ, uppannaṃ manāpāmanāpaṃ. Tañca kho saṅkhataṃ oḷārikaṃ paṭiccasamuppannaṃ. Etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ – upekkhā’ti. Tassa taṃ uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati; upekkhā saṇṭhāti . Seyyathāpi, ānanda, balavā puriso jivhagge kheḷapiṇḍaṃ saṃyūhitvā appakasirena vameyya [sandhameyya (ka.)]; evameva kho, ānanda, yassa kassaci evaṃsīghaṃ evaṃtuvaṭaṃ evaṃappakasirena uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati, upekkhā saṇṭhāti – ayaṃ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā jivhāviññeyyesu rasesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "458"
      },
      ". ‘‘Puna caparaṃ, ānanda, bhikkhuno kāyena phoṭṭhabbaṃ phusitvā uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ manāpaṃ, uppannaṃ amanāpaṃ, uppannaṃ ",
      " manāpāmanāpaṃ. Tañca kho saṅkhataṃ oḷārikaṃ paṭiccasamuppannaṃ. Etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ – upekkhā’ti. Tassa taṃ uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati; upekkhā saṇṭhāti. Seyyathāpi, ānanda, balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya; evameva kho, ānanda, yassa kassaci evaṃsīghaṃ evaṃtuvaṭaṃ evaṃappakasirena uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati, upekkhā saṇṭhāti – ayaṃ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā kāyaviññeyyesu phoṭṭhabbesu."
    ],
    "innerText": "458. ‘‘Puna caparaṃ, ānanda, bhikkhuno kāyena phoṭṭhabbaṃ phusitvā uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ manāpaṃ, uppannaṃ amanāpaṃ, uppannaṃ manāpāmanāpaṃ. Tañca kho saṅkhataṃ oḷārikaṃ paṭiccasamuppannaṃ. Etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ – upekkhā’ti. Tassa taṃ uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati; upekkhā saṇṭhāti. Seyyathāpi, ānanda, balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya; evameva kho, ānanda, yassa kassaci evaṃsīghaṃ evaṃtuvaṭaṃ evaṃappakasirena uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati, upekkhā saṇṭhāti – ayaṃ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā kāyaviññeyyesu phoṭṭhabbesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "459"
      },
      ". ‘‘Puna caparaṃ, ānanda, bhikkhuno manasā dhammaṃ viññāya uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ manāpaṃ, uppannaṃ amanāpaṃ, uppannaṃ manāpāmanāpaṃ. Tañca kho saṅkhataṃ oḷārikaṃ paṭiccasamuppannaṃ. Etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ – upekkhā’ti. Tassa taṃ uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati; upekkhā saṇṭhāti. Seyyathāpi, ānanda, balavā puriso divasaṃsantatte ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[divasasantette (sī.)]"
      },
      " ayokaṭāhe dve vā tīṇi vā udakaphusitāni nipāteyya. Dandho, ānanda, udakaphusitānaṃ nipāto, atha kho naṃ khippameva parikkhayaṃ pariyādānaṃ gaccheyya; evameva kho, ānanda, yassa kassaci evaṃsīghaṃ evaṃtuvaṭaṃ evaṃappakasirena uppannaṃ manāpaṃ uppannaṃ ",
      " amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati, upekkhā saṇṭhāti – ayaṃ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā manoviññeyyesu dhammesu. Evaṃ kho, ānanda, ariyassa vinaye anuttarā indriyabhāvanā hoti."
    ],
    "innerText": "459. ‘‘Puna caparaṃ, ānanda, bhikkhuno manasā dhammaṃ viññāya uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ manāpaṃ, uppannaṃ amanāpaṃ, uppannaṃ manāpāmanāpaṃ. Tañca kho saṅkhataṃ oḷārikaṃ paṭiccasamuppannaṃ. Etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ – upekkhā’ti. Tassa taṃ uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati; upekkhā saṇṭhāti. Seyyathāpi, ānanda, balavā puriso divasaṃsantatte [divasasantette (sī.)] ayokaṭāhe dve vā tīṇi vā udakaphusitāni nipāteyya. Dandho, ānanda, udakaphusitānaṃ nipāto, atha kho naṃ khippameva parikkhayaṃ pariyādānaṃ gaccheyya; evameva kho, ānanda, yassa kassaci evaṃsīghaṃ evaṃtuvaṭaṃ evaṃappakasirena uppannaṃ manāpaṃ uppannaṃ amanāpaṃ uppannaṃ manāpāmanāpaṃ nirujjhati, upekkhā saṇṭhāti – ayaṃ vuccatānanda, ariyassa vinaye anuttarā indriyabhāvanā manoviññeyyesu dhammesu. Evaṃ kho, ānanda, ariyassa vinaye anuttarā indriyabhāvanā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "460"
      },
      ". ‘‘Kathañcānanda ",
      ", sekho hoti pāṭipado? Idhānanda, bhikkhuno cakkhunā rūpaṃ disvā uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So ",
      " tena uppannena manāpena uppannena amanāpena uppannena manāpāmanāpena aṭṭīyati harāyati jigucchati. Sotena saddaṃ ",
      " sutvā…pe… ghānena gandhaṃ ghāyitvā…, jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So tena uppannena manāpena uppannena amanāpena uppannena manāpāmanāpena aṭṭīyati harāyati jigucchati. Evaṃ kho, ānanda, sekho hoti pāṭipado."
    ],
    "innerText": "460. ‘‘Kathañcānanda , sekho hoti pāṭipado? Idhānanda, bhikkhuno cakkhunā rūpaṃ disvā uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So tena uppannena manāpena uppannena amanāpena uppannena manāpāmanāpena aṭṭīyati harāyati jigucchati. Sotena saddaṃ sutvā…pe… ghānena gandhaṃ ghāyitvā…, jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So tena uppannena manāpena uppannena amanāpena uppannena manāpāmanāpena aṭṭīyati harāyati jigucchati. Evaṃ kho, ānanda, sekho hoti pāṭipado."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "461"
      },
      ". ‘‘Kathañcānanda, ariyo hoti bhāvitindriyo? Idhānanda, bhikkhuno cakkhunā rūpaṃ disvā uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So sace ākaṅkhati – ‘paṭikūle ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṭikkūle (sabbattha)]"
      },
      " appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘appaṭikūle paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūle ca appaṭikūle ca appaṭikūlasaññī ",
      " vihareyya’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘appaṭikūle ca paṭikūle ca paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūlañca appaṭikūlañca tadubhayaṃ abhinivajjetvā upekkhako vihareyyaṃ sato sampajāno’ti, upekkhako tattha viharati sato sampajāno."
    ],
    "innerText": "461. ‘‘Kathañcānanda, ariyo hoti bhāvitindriyo? Idhānanda, bhikkhuno cakkhunā rūpaṃ disvā uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So sace ākaṅkhati – ‘paṭikūle [paṭikkūle (sabbattha)] appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘appaṭikūle paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūle ca appaṭikūle ca appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘appaṭikūle ca paṭikūle ca paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūlañca appaṭikūlañca tadubhayaṃ abhinivajjetvā upekkhako vihareyyaṃ sato sampajāno’ti, upekkhako tattha viharati sato sampajāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "462"
      },
      ". ‘‘Puna caparaṃ, ānanda, bhikkhuno sotena saddaṃ sutvā…pe… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So sace ākaṅkhati – ‘paṭikūle appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘appaṭikūle paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūle ca appaṭikūle ca appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘appaṭikūle ca paṭikūle ca paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūlañca appaṭikūlañca tadubhayampi ",
      " abhinivajjetvā upekkhako vihareyyaṃ sato sampajāno’ti, upekkhako tattha viharati sato sampajāno. Evaṃ kho, ānanda, ariyo hoti bhāvitindriyo."
    ],
    "innerText": "462. ‘‘Puna caparaṃ, ānanda, bhikkhuno sotena saddaṃ sutvā…pe… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya uppajjati manāpaṃ, uppajjati amanāpaṃ, uppajjati manāpāmanāpaṃ. So sace ākaṅkhati – ‘paṭikūle appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘appaṭikūle paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūle ca appaṭikūle ca appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘appaṭikūle ca paṭikūle ca paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūlañca appaṭikūlañca tadubhayampi abhinivajjetvā upekkhako vihareyyaṃ sato sampajāno’ti, upekkhako tattha viharati sato sampajāno. Evaṃ kho, ānanda, ariyo hoti bhāvitindriyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "463"
      },
      ". ‘‘Iti ",
      " kho, ānanda, desitā mayā ariyassa vinaye anuttarā indriyabhāvanā, desito sekho pāṭipado, desito ariyo bhāvitindriyo ",
      ". Yaṃ kho, ānanda, satthārā karaṇīyaṃ sāvakānaṃ hitesinā anukampakena anukampaṃ upādāya, kataṃ vo taṃ mayā. Etāni, ānanda, rukkhamūlāni, etāni suññāgārāni, jhāyathānanda, mā pamādattha, mā pacchā vippaṭisārino ahuvattha. Ayaṃ vo amhākaṃ anusāsanī’’ti."
    ],
    "innerText": "463. ‘‘Iti kho, ānanda, desitā mayā ariyassa vinaye anuttarā indriyabhāvanā, desito sekho pāṭipado, desito ariyo bhāvitindriyo . Yaṃ kho, ānanda, satthārā karaṇīyaṃ sāvakānaṃ hitesinā anukampakena anukampaṃ upādāya, kataṃ vo taṃ mayā. Etāni, ānanda, rukkhamūlāni, etāni suññāgārāni, jhāyathānanda, mā pamādattha, mā pacchā vippaṭisārino ahuvattha. Ayaṃ vo amhākaṃ anusāsanī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Attamano āyasmā ānando bhagavato bhāsitaṃ abhinandīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Indriyabhāvanāsuttaṃ niṭṭhitaṃ dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saḷāyatanavaggo niṭṭhito pañcamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Anāthapiṇḍiko channo, puṇṇo nandakarāhulā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Chachakkaṃ saḷāyatanikaṃ, nagaravindeyyasuddhikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Indriyabhāvanā cāpi, vaggo ovādapañcamoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idaṃ vaggānamuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Devadahonupado ca, suññato ca vibhaṅgako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saḷāyatanoti vaggā, uparipaṇṇāsake ṭhitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Uparipaṇṇāsakaṃ samattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tīhi paṇṇāsakehi paṭimaṇḍito sakalo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Majjhimanikāyo samatto."
  }
]