[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Bhikkhuvaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Ambalaṭṭhikarāhulovādasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "107"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti ambalaṭṭhikarāhulovādasuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ambalaṭṭhikāyaṃ viharatī"
      },
      "ti veḷuvanavihārassa paccante padhānagharasaṅkhepe vivekakāmānaṃ vasanatthāya kate ambalaṭṭhikāti evaṃnāmake pāsāde pavivekaṃ brūhayanto viharati. Kaṇṭako nāma jātakālato paṭṭhāya tikhiṇova hoti, evamevaṃ ayampi āyasmā sattavassikasāmaṇerakāleyeva pavivekaṃ brūhayamāno tattha vihāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisallānā vuṭṭhito"
      },
      "ti phalasamāpattito vuṭṭhāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsana"
      },
      "nti pakatipaññattamevettha āsanaṃ atthi, taṃ papphoṭetvā ṭhapesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Udakādhāne"
      },
      "ti ",
      " udakabhājane. ‘‘Udakaṭṭhāne’’tipi pāṭho."
    ],
    "innerText": "107.Evaṃme sutanti ambalaṭṭhikarāhulovādasuttaṃ. Tattha ambalaṭṭhikāyaṃ viharatīti veḷuvanavihārassa paccante padhānagharasaṅkhepe vivekakāmānaṃ vasanatthāya kate ambalaṭṭhikāti evaṃnāmake pāsāde pavivekaṃ brūhayanto viharati. Kaṇṭako nāma jātakālato paṭṭhāya tikhiṇova hoti, evamevaṃ ayampi āyasmā sattavassikasāmaṇerakāleyeva pavivekaṃ brūhayamāno tattha vihāsi. Paṭisallānā vuṭṭhitoti phalasamāpattito vuṭṭhāya. Āsananti pakatipaññattamevettha āsanaṃ atthi, taṃ papphoṭetvā ṭhapesi. Udakādhāneti udakabhājane. ‘‘Udakaṭṭhāne’’tipi pāṭho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āyasmantaṃ rāhulaṃ āmantesī"
      },
      "ti ovādadānatthaṃ āmantesi. Bhagavatā hi rāhulattherassa sambahulā dhammadesanā katā. Sāmaṇerapañhaṃ therasseva vuttaṃ. Tathā rāhulasaṃyuttaṃ mahārāhulovādasuttaṃ cūḷarāhulovādasuttamidaṃ ambalaṭṭhikarāhulovādasuttanti."
    ],
    "innerText": "Āyasmantaṃ rāhulaṃ āmantesīti ovādadānatthaṃ āmantesi. Bhagavatā hi rāhulattherassa sambahulā dhammadesanā katā. Sāmaṇerapañhaṃ therasseva vuttaṃ. Tathā rāhulasaṃyuttaṃ mahārāhulovādasuttaṃ cūḷarāhulovādasuttamidaṃ ambalaṭṭhikarāhulovādasuttanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayañhi āyasmā sattavassikakāle bhagavantaṃ cīvarakaṇṇe gahetvā ‘‘dāyajjaṃ me samaṇa dehī’’ti dāyajjaṃ yācamāno bhagavatā dhammasenāpatisāriputtattherassa niyyādetvā pabbājito. Atha bhagavā daharakumārā nāma yuttāyuttaṃ kathaṃ kathenti, ovādamassa demīti rāhulakumāraṃ āmantetvā ‘‘sāmaṇerena nāma, rāhula, tiracchānakathaṃ kathetuṃ na vaṭṭati, tvaṃ kathayamāno evarūpaṃ kathaṃ katheyyāsī’’ti sabbabuddhehi avijahitaṃ dasapucchaṃ pañcapaṇṇāsavissajjanaṃ – ‘‘eko pañho eko uddeso ekaṃ veyyākaraṇaṃ dve pañhā…pe… dasa pañhā dasa uddesā dasa ",
      " veyyākaraṇāti. Ekaṃ nāma kiṃ? Sabbe sattā āhāraṭṭhitikā…pe… dasa nāma kiṃ? Dasahaṅgehi samannāgato arahāti vuccatī’’ti (khu. pā. 4.10) imaṃ sāmaṇerapañhaṃ kathesi. Puna cintesi ‘‘daharakumārā nāma piyamusāvādā honti, adiṭṭhameva ",
      " diṭṭhaṃ amhehi, diṭṭhameva na diṭṭhaṃ amhehīti vadanti ovādamassa demī’’ti akkhīhi oloketvāpi sukhasañjānanatthaṃ paṭhamameva catasso udakādhānūpamāyo ",
      ", tato dve hatthiupamāyo ekaṃ ādāsūpamañca dassetvā imaṃ suttaṃ kathesi. Catūsu pana paccayesu taṇhāvivaṭṭanaṃ pañcasu kāmaguṇesu chandarāgappahānaṃ kalyāṇamittupanissayassa mahantabhāvañca dassetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rāhulasuttaṃ"
      },
      " (su. ni. rāhulasutta) kathesi. Āgatāgataṭṭhāne bhavesu chandarāgo na kattabboti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rāhulasaṃyuttaṃ"
      },
      " (saṃ. ni. 2.188 ādayo) kathesi. ‘‘Ahaṃ sobhāmi, mama vaṇṇāyatanaṃ pasanna’’nti attabhāvaṃ nissāya gehassitachandarāgo na kattabboti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahārāhulovādasuttaṃ"
      },
      " kathesi."
    ],
    "innerText": "Ayañhi āyasmā sattavassikakāle bhagavantaṃ cīvarakaṇṇe gahetvā ‘‘dāyajjaṃ me samaṇa dehī’’ti dāyajjaṃ yācamāno bhagavatā dhammasenāpatisāriputtattherassa niyyādetvā pabbājito. Atha bhagavā daharakumārā nāma yuttāyuttaṃ kathaṃ kathenti, ovādamassa demīti rāhulakumāraṃ āmantetvā ‘‘sāmaṇerena nāma, rāhula, tiracchānakathaṃ kathetuṃ na vaṭṭati, tvaṃ kathayamāno evarūpaṃ kathaṃ katheyyāsī’’ti sabbabuddhehi avijahitaṃ dasapucchaṃ pañcapaṇṇāsavissajjanaṃ – ‘‘eko pañho eko uddeso ekaṃ veyyākaraṇaṃ dve pañhā…pe… dasa pañhā dasa uddesā dasa veyyākaraṇāti. Ekaṃ nāma kiṃ? Sabbe sattā āhāraṭṭhitikā…pe… dasa nāma kiṃ? Dasahaṅgehi samannāgato arahāti vuccatī’’ti (khu. pā. 4.10) imaṃ sāmaṇerapañhaṃ kathesi. Puna cintesi ‘‘daharakumārā nāma piyamusāvādā honti, adiṭṭhameva diṭṭhaṃ amhehi, diṭṭhameva na diṭṭhaṃ amhehīti vadanti ovādamassa demī’’ti akkhīhi oloketvāpi sukhasañjānanatthaṃ paṭhamameva catasso udakādhānūpamāyo , tato dve hatthiupamāyo ekaṃ ādāsūpamañca dassetvā imaṃ suttaṃ kathesi. Catūsu pana paccayesu taṇhāvivaṭṭanaṃ pañcasu kāmaguṇesu chandarāgappahānaṃ kalyāṇamittupanissayassa mahantabhāvañca dassetvā rāhulasuttaṃ (su. ni. rāhulasutta) kathesi. Āgatāgataṭṭhāne bhavesu chandarāgo na kattabboti dassetuṃ rāhulasaṃyuttaṃ (saṃ. ni. 2.188 ādayo) kathesi. ‘‘Ahaṃ sobhāmi, mama vaṇṇāyatanaṃ pasanna’’nti attabhāvaṃ nissāya gehassitachandarāgo na kattabboti mahārāhulovādasuttaṃ kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha rāhulasuttaṃ imasmiṃ nāma kāle vuttanti na vattabbaṃ. Tañhi abhiṇhovādavasena vuttaṃ. Rāhulasaṃyuttaṃ sattavassikakālato paṭṭhāya yāva avassikabhikkhukālā vuttaṃ. Mahārāhulovādasuttaṃ aṭṭhārasa vassasāmaṇerakāle vuttaṃ. Cūḷarāhulovādasuttaṃ avassikabhikkhukāle vuttaṃ. Kumārakapañhañca idañca ambalaṭṭhikarāhulovādasuttaṃ sattavassikasāmaṇerakāle vuttaṃ. Tesu rāhulasuttaṃ abhiṇhovādatthaṃ, rāhulasaṃyuttaṃ, therassa vipassanāgabbhagahaṇatthaṃ, mahārāhulovādaṃ gehassitachandarāgavinodanatthaṃ, cūḷarāhulovādaṃ therassa pañcadasa-vimuttiparipācanīya-dhammaparipākakāle arahattagāhāpanatthaṃ vuttaṃ. Idañca ",
      " pana sandhāya rāhulatthero bhikkhusaṅghamajjhe tathāgatassa guṇaṃ kathento idamāha –"
    ],
    "innerText": "Tattha rāhulasuttaṃ imasmiṃ nāma kāle vuttanti na vattabbaṃ. Tañhi abhiṇhovādavasena vuttaṃ. Rāhulasaṃyuttaṃ sattavassikakālato paṭṭhāya yāva avassikabhikkhukālā vuttaṃ. Mahārāhulovādasuttaṃ aṭṭhārasa vassasāmaṇerakāle vuttaṃ. Cūḷarāhulovādasuttaṃ avassikabhikkhukāle vuttaṃ. Kumārakapañhañca idañca ambalaṭṭhikarāhulovādasuttaṃ sattavassikasāmaṇerakāle vuttaṃ. Tesu rāhulasuttaṃ abhiṇhovādatthaṃ, rāhulasaṃyuttaṃ, therassa vipassanāgabbhagahaṇatthaṃ, mahārāhulovādaṃ gehassitachandarāgavinodanatthaṃ, cūḷarāhulovādaṃ therassa pañcadasa-vimuttiparipācanīya-dhammaparipākakāle arahattagāhāpanatthaṃ vuttaṃ. Idañca pana sandhāya rāhulatthero bhikkhusaṅghamajjhe tathāgatassa guṇaṃ kathento idamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kikīva bījaṃ rakkheyya, cāmarī vālamuttamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nipako sīlasampanno, mamaṃ rakkhi tathāgato’’ti. (apa. 1.2.83);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sāmaṇerapañhaṃ ayuttavacanapahānatthaṃ, idaṃ ambalaṭṭhikarāhulovādasuttaṃ sampajānamusāvādassa akaraṇatthaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "passasi no"
      },
      "ti passasi nu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paritta"
      },
      "nti thokaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāmañña"
      },
      "nti samaṇadhammo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nikkujjitvā"
      },
      "ti adhomukhaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ukkujjitvā"
      },
      "ti uttānaṃ katvā."
    ],
    "innerText": "Tattha passasi noti passasi nu. Parittanti thokaṃ. Sāmaññanti samaṇadhammo. Nikkujjitvāti adhomukhaṃ katvā. Ukkujjitvāti uttānaṃ katvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "108"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seyyathāpi, rāhula, rañño nāgo"
      },
      "ti ayaṃ upamā sampajānamusāvāde saṃvararahitassa opammadassanatthaṃ vuttā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "īsādanto"
      },
      "ti rathīsāsadisadanto ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uruḷhavā"
      },
      "ti abhivaḍḍhito ārohasampanno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhijāto"
      },
      "ti sujāto jātisampanno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅgāmāvacaro"
      },
      "ti saṅgāmaṃ otiṇṇapubbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammaṃ karotī"
      },
      "ti āgatāgate pavaṭṭento ghāteti. Puratthimakāyādīsu pana puratthimakāyena tāva paṭisenāya phalakakoṭṭhakamuṇḍapākārādayo pāteti, tathā pacchimakāyena. Sīsena kammaṃ nāma niyametvā etaṃ padesaṃ maddissāmīti nivattitvā oloketi, ettakena satampi sahassampi dvedhā bhijjati. Kaṇṇehi kammaṃ nāma āgatāgate sare kaṇṇehi paharitvā pātanaṃ. Dantehi kammaṃ nāma paṭihatthiassahatthārohaassārohapadādīnaṃ vijjhanaṃ. Naṅguṭṭhena kammaṃ ",
      " nāma naṅguṭṭhe bandhāya dīghāsilaṭṭhiyā vā ayamusalena vā chedanabhedanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rakkhateva soṇḍa"
      },
      "nti soṇḍaṃ pana mukhe pakkhipitvā rakkhati."
    ],
    "innerText": "108.Seyyathāpi, rāhula, rañño nāgoti ayaṃ upamā sampajānamusāvāde saṃvararahitassa opammadassanatthaṃ vuttā. Tattha īsādantoti rathīsāsadisadanto . Uruḷhavāti abhivaḍḍhito ārohasampanno. Abhijātoti sujāto jātisampanno. Saṅgāmāvacaroti saṅgāmaṃ otiṇṇapubbo. Kammaṃ karotīti āgatāgate pavaṭṭento ghāteti. Puratthimakāyādīsu pana puratthimakāyena tāva paṭisenāya phalakakoṭṭhakamuṇḍapākārādayo pāteti, tathā pacchimakāyena. Sīsena kammaṃ nāma niyametvā etaṃ padesaṃ maddissāmīti nivattitvā oloketi, ettakena satampi sahassampi dvedhā bhijjati. Kaṇṇehi kammaṃ nāma āgatāgate sare kaṇṇehi paharitvā pātanaṃ. Dantehi kammaṃ nāma paṭihatthiassahatthārohaassārohapadādīnaṃ vijjhanaṃ. Naṅguṭṭhena kammaṃ nāma naṅguṭṭhe bandhāya dīghāsilaṭṭhiyā vā ayamusalena vā chedanabhedanaṃ. Rakkhateva soṇḍanti soṇḍaṃ pana mukhe pakkhipitvā rakkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti tasmiṃ tassa hatthino karaṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apariccatta"
      },
      "nti anissaṭṭhaṃ, paresaṃ jayaṃ amhākañca parājayaṃ passīti maññati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Soṇḍāyapi kammaṃ karotī"
      },
      "ti ayamuggaraṃ vā khadiramusalaṃ vā gahetvā samantā aṭṭhārasahatthaṭṭhānaṃ maddati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariccatta"
      },
      "nti vissaṭṭhaṃ, idāni hatthiyodhādīsu na kutoci bhāyati, amhākaṃ jayaṃ paresañca parājayaṃ passīti maññati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāhaṃ tassa kiñci pāpa"
      },
      "nti tassa dukkaṭādiāpattivītikkame vā mātughātakādikammesu vā kiñci pāpaṃ akattabbaṃ nāma natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā tiha te"
      },
      "ti yasmā sampajānamusāvādino akattabbaṃ pāpaṃ nāma natthi, tasmā tayā hasāyapi davakamyatāyapi musā na bhaṇissāmīti sikkhitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccavekkhaṇattho"
      },
      "ti olokanattho, yaṃ mukhe vajjaṃ hoti, tassa dassanatthoti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccavekkhitvā paccavekkhitvā"
      },
      "ti oloketvā oloketvā."
    ],
    "innerText": "Tatthāti tasmiṃ tassa hatthino karaṇe. Apariccattanti anissaṭṭhaṃ, paresaṃ jayaṃ amhākañca parājayaṃ passīti maññati. Soṇḍāyapi kammaṃ karotīti ayamuggaraṃ vā khadiramusalaṃ vā gahetvā samantā aṭṭhārasahatthaṭṭhānaṃ maddati. Pariccattanti vissaṭṭhaṃ, idāni hatthiyodhādīsu na kutoci bhāyati, amhākaṃ jayaṃ paresañca parājayaṃ passīti maññati. Nāhaṃ tassa kiñci pāpanti tassa dukkaṭādiāpattivītikkame vā mātughātakādikammesu vā kiñci pāpaṃ akattabbaṃ nāma natthi. Tasmā tiha teti yasmā sampajānamusāvādino akattabbaṃ pāpaṃ nāma natthi, tasmā tayā hasāyapi davakamyatāyapi musā na bhaṇissāmīti sikkhitabbaṃ. Paccavekkhaṇatthoti olokanattho, yaṃ mukhe vajjaṃ hoti, tassa dassanatthoti vuttaṃ hoti. Paccavekkhitvā paccavekkhitvāti oloketvā oloketvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "109"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sasakkaṃ na karaṇīya"
      },
      "nti ekaṃseneva na kātabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisaṃhareyyāsī"
      },
      "ti nivatteyyāsi mā kareyyāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupadajjeyyāsī"
      },
      "ti anupadeyyāsi upatthambheyyāsi punappunaṃ kareyyāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahorattānusikkhī"
      },
      "ti rattiñca divañca sikkhamāno."
    ],
    "innerText": "109.Sasakkaṃ na karaṇīyanti ekaṃseneva na kātabbaṃ. Paṭisaṃhareyyāsīti nivatteyyāsi mā kareyyāsi. Anupadajjeyyāsīti anupadeyyāsi upatthambheyyāsi punappunaṃ kareyyāsi. Ahorattānusikkhīti rattiñca divañca sikkhamāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "111"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭīyitabba"
      },
      "nti ",
      " aṭṭena pīḷitena bhavitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Harāyitabba"
      },
      "nti lajjitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jigucchitabba"
      },
      "nti gūthaṃ disvā viya jigucchā uppādetabbā. Manokammassa pana adesanāvatthukattā idha desetabbanti na vuttaṃ. Kittake pana ṭhāne kāyakammavacīkammāni ",
      " sodhetabbāni, kittake manokammanti. Kāyakammavacīkammāni tāva ekasmiṃ purebhatteyeva sodhetabbāni. Bhattakiccaṃ katvā divāṭṭhāne nisinnena hi paccavekkhitabbaṃ ‘‘aruṇuggamanato paṭṭhāya yāva imasmiṃ ṭhāne nisajjā atthi nu kho me imasmiṃ antare paresaṃ appiyaṃ kāyakammaṃ vā vacīkammaṃ vā’’ti. Sace atthīti jānāti, desanāyuttaṃ desetabbaṃ, āvikaraṇayuttaṃ āvikātabbaṃ. Sace natthi, teneva pītipāmojjena vihātabbaṃ. Manokammaṃ pana etasmiṃ piṇḍapātapariyesanaṭṭhāne sodhetabbaṃ. Kathaṃ? ‘‘Atthi nu kho me ajja piṇḍapātapariyesanaṭṭhāne rūpādīsu chando vā rāgo vā paṭighaṃ vā’’ti? Sace atthi, ‘‘puna na evaṃ karissāmī’’ti citteneva adhiṭṭhātabbaṃ. Sace natthi, teneva pītipāmojjena vihātabbaṃ."
    ],
    "innerText": "111.Aṭṭīyitabbanti aṭṭena pīḷitena bhavitabbaṃ. Harāyitabbanti lajjitabbaṃ. Jigucchitabbanti gūthaṃ disvā viya jigucchā uppādetabbā. Manokammassa pana adesanāvatthukattā idha desetabbanti na vuttaṃ. Kittake pana ṭhāne kāyakammavacīkammāni sodhetabbāni, kittake manokammanti. Kāyakammavacīkammāni tāva ekasmiṃ purebhatteyeva sodhetabbāni. Bhattakiccaṃ katvā divāṭṭhāne nisinnena hi paccavekkhitabbaṃ ‘‘aruṇuggamanato paṭṭhāya yāva imasmiṃ ṭhāne nisajjā atthi nu kho me imasmiṃ antare paresaṃ appiyaṃ kāyakammaṃ vā vacīkammaṃ vā’’ti. Sace atthīti jānāti, desanāyuttaṃ desetabbaṃ, āvikaraṇayuttaṃ āvikātabbaṃ. Sace natthi, teneva pītipāmojjena vihātabbaṃ. Manokammaṃ pana etasmiṃ piṇḍapātapariyesanaṭṭhāne sodhetabbaṃ. Kathaṃ? ‘‘Atthi nu kho me ajja piṇḍapātapariyesanaṭṭhāne rūpādīsu chando vā rāgo vā paṭighaṃ vā’’ti? Sace atthi, ‘‘puna na evaṃ karissāmī’’ti citteneva adhiṭṭhātabbaṃ. Sace natthi, teneva pītipāmojjena vihātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "112"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaṇā vā brāhmaṇā vā"
      },
      "ti buddhā vā paccekabuddhā vā tathāgatasāvakā vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmātihā"
      },
      "ti yasmā atītepi evaṃ parisodhesuṃ, anāgatepi parisodhessanti, etarahipi parisodhenti, tasmā tumhehipi tesaṃ anusikkhantehi evaṃ sikkhitabbanti attho. Sesaṃ sabbattha uttānameva. Imaṃ pana desanaṃ bhagavā yāva bhavaggā ussitassa ratanarāsino yojaniyamaṇikkhandhena kūṭaṃ gaṇhanto viya neyyapuggalavasena pariniṭṭhāpesīti."
    ],
    "innerText": "112.Samaṇā vā brāhmaṇā vāti buddhā vā paccekabuddhā vā tathāgatasāvakā vā. Tasmātihāti yasmā atītepi evaṃ parisodhesuṃ, anāgatepi parisodhessanti, etarahipi parisodhenti, tasmā tumhehipi tesaṃ anusikkhantehi evaṃ sikkhitabbanti attho. Sesaṃ sabbattha uttānameva. Imaṃ pana desanaṃ bhagavā yāva bhavaggā ussitassa ratanarāsino yojaniyamaṇikkhandhena kūṭaṃ gaṇhanto viya neyyapuggalavasena pariniṭṭhāpesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ambalaṭṭhikarāhulovādasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Mahārāhulovādasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "113"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti mahārāhulovādasuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "piṭṭhito piṭṭhito anubandhī"
      },
      "ti dassanaṃ avijahitvā gamanaṃ abbocchinnaṃ katvā pacchato pacchato iriyāpathānubandhanena anubandhi. Tadā hi bhagavā pade padaṃ nikkhipanto vilāsitagamanena purato purato gacchati, rāhulatthero dasabalassa padānupadiko hutvā pacchato pacchato."
    ],
    "innerText": "113.Evaṃme sutanti mahārāhulovādasuttaṃ. Tattha piṭṭhito piṭṭhito anubandhīti dassanaṃ avijahitvā gamanaṃ abbocchinnaṃ katvā pacchato pacchato iriyāpathānubandhanena anubandhi. Tadā hi bhagavā pade padaṃ nikkhipanto vilāsitagamanena purato purato gacchati, rāhulatthero dasabalassa padānupadiko hutvā pacchato pacchato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha bhagavā supupphitasālavanamajjhagato subhūmiotaraṇatthāya nikkhantamattavaravāraṇo viya virocittha, rāhulabhaddo ca varavāraṇassa pacchato ",
      " nikkhantagajapotako viya. Bhagavā sāyanhasamaye maṇiguhato nikkhamitvā gocaraṃ paṭipanno kesarasīho viya, rāhulabhaddo ca sīhamigarājānaṃ anubandhanto nikkhantasīhapotako viya. Bhagavā maṇipabbatasassirikavanasaṇḍato dāṭhabalo mahābyaggho viya, rāhulabhaddo ca byaggharājānaṃ anubandhabyagghapotako viya. Bhagavā simbalidāyato nikkhantasupaṇṇarājā viya, rāhulabhaddo ca supaṇṇarājassa pacchato nikkhantasupaṇṇapotako viya. Bhagavā cittakūṭapabbatato gaganatalaṃ pakkhandasuvaṇṇahaṃsarājā viya, rāhulabhaddo ca haṃsādhipatiṃ anupakkhandahaṃsapotako viya. Bhagavā ",
      " mahāsaraṃ ajjhogāḷhā suvaṇṇamahānāvā viya, rāhulabhaddo ca suvaṇṇanāvaṃ pacchā anubandhanāvāpotako viya. Bhagavā cakkaratanānubhāvena gaganatale sampayātacakkavattirājā viya, rāhulabhaddo ca rājānaṃ anusampayātapariṇāyakaratanaṃ viya. Bhagavā vigatavalāhakaṃ nabhaṃ paṭipannatārakarājā viya, rāhulabhaddo ca tārakādhipatino anumaggapaṭipannā parisuddhaosadhitārakā viya."
    ],
    "innerText": "Tattha bhagavā supupphitasālavanamajjhagato subhūmiotaraṇatthāya nikkhantamattavaravāraṇo viya virocittha, rāhulabhaddo ca varavāraṇassa pacchato nikkhantagajapotako viya. Bhagavā sāyanhasamaye maṇiguhato nikkhamitvā gocaraṃ paṭipanno kesarasīho viya, rāhulabhaddo ca sīhamigarājānaṃ anubandhanto nikkhantasīhapotako viya. Bhagavā maṇipabbatasassirikavanasaṇḍato dāṭhabalo mahābyaggho viya, rāhulabhaddo ca byaggharājānaṃ anubandhabyagghapotako viya. Bhagavā simbalidāyato nikkhantasupaṇṇarājā viya, rāhulabhaddo ca supaṇṇarājassa pacchato nikkhantasupaṇṇapotako viya. Bhagavā cittakūṭapabbatato gaganatalaṃ pakkhandasuvaṇṇahaṃsarājā viya, rāhulabhaddo ca haṃsādhipatiṃ anupakkhandahaṃsapotako viya. Bhagavā mahāsaraṃ ajjhogāḷhā suvaṇṇamahānāvā viya, rāhulabhaddo ca suvaṇṇanāvaṃ pacchā anubandhanāvāpotako viya. Bhagavā cakkaratanānubhāvena gaganatale sampayātacakkavattirājā viya, rāhulabhaddo ca rājānaṃ anusampayātapariṇāyakaratanaṃ viya. Bhagavā vigatavalāhakaṃ nabhaṃ paṭipannatārakarājā viya, rāhulabhaddo ca tārakādhipatino anumaggapaṭipannā parisuddhaosadhitārakā viya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhagavāpi mahāsammatapaveṇiyaṃ okkākarājavaṃse jāto, rāhulabhaddopi. Bhagavāpi saṅkhe pakkhittakhīrasadiso suparisuddhajātikhattiyakule jāto, rāhulabhaddopi. Bhagavāpi rajjaṃ pahāya pabbajito, rāhulabhaddopi. Bhagavatopi sarīraṃ dvattiṃsamahāpurisalakkhaṇapaṭimaṇḍitaṃ devanagaresu samussitaratanatoraṇaṃ viya sabbapāliphullo pāricchattako viya ca atimanoharaṇaṃ, rāhulabhaddassāpi. Iti dvepi abhinīhārasampannā, dvepi rājapabbajitā, dvepi khattiyasukhumālā, dvepi ",
      " suvaṇṇavaṇṇā, dvepi lakkhaṇasampannā ekamaggaṃ paṭipannā paṭipāṭiyā gacchantānaṃ dvinnaṃ candamaṇḍalānaṃ dvinnaṃ sūriyamaṇḍalānaṃ dvinnaṃ sakkasuyāmasantusitasunimmitavasavattimahābrahmādīnaṃ siriyā siriṃ abhibhavamānā viya virociṃsu."
    ],
    "innerText": "Bhagavāpi mahāsammatapaveṇiyaṃ okkākarājavaṃse jāto, rāhulabhaddopi. Bhagavāpi saṅkhe pakkhittakhīrasadiso suparisuddhajātikhattiyakule jāto, rāhulabhaddopi. Bhagavāpi rajjaṃ pahāya pabbajito, rāhulabhaddopi. Bhagavatopi sarīraṃ dvattiṃsamahāpurisalakkhaṇapaṭimaṇḍitaṃ devanagaresu samussitaratanatoraṇaṃ viya sabbapāliphullo pāricchattako viya ca atimanoharaṇaṃ, rāhulabhaddassāpi. Iti dvepi abhinīhārasampannā, dvepi rājapabbajitā, dvepi khattiyasukhumālā, dvepi suvaṇṇavaṇṇā, dvepi lakkhaṇasampannā ekamaggaṃ paṭipannā paṭipāṭiyā gacchantānaṃ dvinnaṃ candamaṇḍalānaṃ dvinnaṃ sūriyamaṇḍalānaṃ dvinnaṃ sakkasuyāmasantusitasunimmitavasavattimahābrahmādīnaṃ siriyā siriṃ abhibhavamānā viya virociṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyasmā rāhulo bhagavato piṭṭhito piṭṭhito gacchantova pādatalato yāva upari kesantā tathāgataṃ ālokesi. So bhagavato buddhavesavilāsaṃ disvā ‘‘sobhati bhagavā dvattiṃsamahāpurisalakkhaṇavicittasarīro byāmappabhāparikkhittatāya vippakiṇṇasuvaṇṇacuṇṇamajjhagato viya, vijjulatāparikkhitto ",
      " kanakapabbato viya, yantasuttasamākaḍḍhitaratanavicittaṃ suvaṇṇaagghikaṃ viya, rattapaṃsukūlacīvarapaṭicchannopi rattakambalaparikkhittakanakapabbato viya, pavāḷalatāpaṭimaṇḍitaṃ suvaṇṇaagghikaṃ viya ",
      ", cīnapiṭṭhacuṇṇapūjitaṃ suvaṇṇacetiyaṃ viya, lākhārasānulitto kanakayūpo viya, rattavalāhakantarato taṅkhaṇabbhuggatapuṇṇacando viya, aho samatiṃsapāramitānubhāvasajjitassa attabhāvassa sirīsampattī’’ti cintesi. Tato attānampi oloketvā – ‘‘ahampi sobhāmi. Sace bhagavā catūsu mahādīpesu cakkavattirajjaṃ akarissā, mayhaṃ pariṇāyakaṭṭhānantaraṃ adassā. Evaṃ sante ativiya jambudīpatalaṃ asobhissā’’ti attabhāvaṃ nissāya gehassitaṃ chandarāgaṃ uppādesi."
    ],
    "innerText": "Tatrāyasmā rāhulo bhagavato piṭṭhito piṭṭhito gacchantova pādatalato yāva upari kesantā tathāgataṃ ālokesi. So bhagavato buddhavesavilāsaṃ disvā ‘‘sobhati bhagavā dvattiṃsamahāpurisalakkhaṇavicittasarīro byāmappabhāparikkhittatāya vippakiṇṇasuvaṇṇacuṇṇamajjhagato viya, vijjulatāparikkhitto kanakapabbato viya, yantasuttasamākaḍḍhitaratanavicittaṃ suvaṇṇaagghikaṃ viya, rattapaṃsukūlacīvarapaṭicchannopi rattakambalaparikkhittakanakapabbato viya, pavāḷalatāpaṭimaṇḍitaṃ suvaṇṇaagghikaṃ viya , cīnapiṭṭhacuṇṇapūjitaṃ suvaṇṇacetiyaṃ viya, lākhārasānulitto kanakayūpo viya, rattavalāhakantarato taṅkhaṇabbhuggatapuṇṇacando viya, aho samatiṃsapāramitānubhāvasajjitassa attabhāvassa sirīsampattī’’ti cintesi. Tato attānampi oloketvā – ‘‘ahampi sobhāmi. Sace bhagavā catūsu mahādīpesu cakkavattirajjaṃ akarissā, mayhaṃ pariṇāyakaṭṭhānantaraṃ adassā. Evaṃ sante ativiya jambudīpatalaṃ asobhissā’’ti attabhāvaṃ nissāya gehassitaṃ chandarāgaṃ uppādesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhagavāpi purato gacchantova cintesi – ‘‘paripuṇṇacchavimaṃsalohito dāni rāhulassa attabhāvo. Rajanīyesu rūpārammaṇādīsu hi cittassa pakkhandanakālo jāto, kiṃ bahulatāya nu kho rāhulo vītināmetī’’ti. Atha sahāvajjaneneva pasannaudake macchaṃ viya, parisuddhe ādāsamaṇḍale mukhanimittaṃ viya ca tassa taṃ cittuppādaṃ addasa. Disvāva – ‘‘ayaṃ rāhulo mayhaṃ atrajo hutvā mama pacchato āgacchanto ‘ahaṃ sobhāmi, mayhaṃ vaṇṇāyatanaṃ pasanna’nti attabhāvaṃ nissāya gehassitachandarāgaṃ uppādeti, atitthe pakkhando uppathaṃ paṭipanno agocare carati, disāmūḷhaaddhiko viya agantabbaṃ disaṃ gacchati. Ayaṃ kho panassa kileso abbhantare vaḍḍhanto attatthampi yathābhūtaṃ passituṃ na dassati, paratthampi, ubhayatthampi. Tato nirayepi paṭisandhiṃ gaṇhāpessati, tiracchānayoniyampi, pettivisayepi, asurakāyepi, sambādhepi mātukucchisminti anamatagge saṃsāravaṭṭe paripātessati. Ayañhi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Anatthajanano ",
      " lobho, lobho cittappakopano;"
    ],
    "innerText": "Anatthajanano lobho, lobho cittappakopano;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhayamantarato jātaṃ, taṃ jano nāvabujjhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Luddho atthaṃ na jānāti, luddho dhammaṃ na passati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Andhatamaṃ tadā hoti, yaṃ lobho sahate naraṃ. (itivu. 88) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Yathā kho pana anekaratanapūrā mahānāvā bhinnaphalakantarena udakaṃ ādiyamānā muhuttampi na ajjhupekkhitabbā hoti, vegenassā vivaraṃ pidahituṃ vaṭṭati, evamevaṃ ayampi na ajjhupekkhitabbo. Yāvassa ayaṃ kileso abbhantare sīlaratanādīni na vināseti, tāvadeva naṃ niggaṇhissāmī’’ti ajjhāsayamakāsi. Evarūpesu pana ṭhānesu buddhānaṃ nāgavilokanaṃ ",
      " nāma hoti. Tasmā yantena parivattitasuvaṇṇapaṭimā viya sakalakāyeneva parivattetvā ṭhito rāhulabhaddaṃ āmantesi. Taṃ sandhāya ‘‘atha kho bhagavā apaloketvā’’tiādi vuttaṃ."
    ],
    "innerText": "Yathā kho pana anekaratanapūrā mahānāvā bhinnaphalakantarena udakaṃ ādiyamānā muhuttampi na ajjhupekkhitabbā hoti, vegenassā vivaraṃ pidahituṃ vaṭṭati, evamevaṃ ayampi na ajjhupekkhitabbo. Yāvassa ayaṃ kileso abbhantare sīlaratanādīni na vināseti, tāvadeva naṃ niggaṇhissāmī’’ti ajjhāsayamakāsi. Evarūpesu pana ṭhānesu buddhānaṃ nāgavilokanaṃ nāma hoti. Tasmā yantena parivattitasuvaṇṇapaṭimā viya sakalakāyeneva parivattetvā ṭhito rāhulabhaddaṃ āmantesi. Taṃ sandhāya ‘‘atha kho bhagavā apaloketvā’’tiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yaṃkiñci rūpa"
      },
      "ntiādīni sabbākārena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visuddhimagge"
      },
      " khandhaniddese vitthāritāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Netaṃ mamā"
      },
      "tiādīni mahāhatthipadopame vuttāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpameva nu kho bhagavā"
      },
      "ti kasmā pucchati? Tassa kira – ‘‘sabbaṃ rūpaṃ netaṃ mama, nesohamasmi na meso attā’’ti sutvā – ‘‘bhagavā sabbaṃ rūpaṃ vipassanāpaññāya evaṃ daṭṭhabbanti vadati, vedanādīsu nu kho kathaṃ paṭipajjitabba’’nti nayo udapādi. Tasmā tasmiṃ naye ṭhito pucchati. Nayakusalo hesa āyasmā rāhulo, idaṃ na kattabbanti ",
      " vutte idampi na kattabbaṃ idampi na kattabbamevāti nayasatenapi nayasahassenapi paṭivijjhati. Idaṃ kattabbanti vuttepi eseva nayo."
    ],
    "innerText": "Tattha yaṃkiñci rūpantiādīni sabbākārena visuddhimagge khandhaniddese vitthāritāni. Netaṃ mamātiādīni mahāhatthipadopame vuttāni. Rūpameva nu kho bhagavāti kasmā pucchati? Tassa kira – ‘‘sabbaṃ rūpaṃ netaṃ mama, nesohamasmi na meso attā’’ti sutvā – ‘‘bhagavā sabbaṃ rūpaṃ vipassanāpaññāya evaṃ daṭṭhabbanti vadati, vedanādīsu nu kho kathaṃ paṭipajjitabba’’nti nayo udapādi. Tasmā tasmiṃ naye ṭhito pucchati. Nayakusalo hesa āyasmā rāhulo, idaṃ na kattabbanti vutte idampi na kattabbaṃ idampi na kattabbamevāti nayasatenapi nayasahassenapi paṭivijjhati. Idaṃ kattabbanti vuttepi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sikkhākāmo hi ayaṃ āyasmā, pātova gandhakuṭipariveṇe patthamattaṃ vālikaṃ okirati – ‘‘ajja sammāsambuddhassa santikā mayhaṃ upajjhāyassa santikā ettakaṃ ovādaṃ ettakaṃ paribhāsaṃ labhāmī’’ti. Sammāsambuddhopi naṃ etadagge ṭhapento – ‘‘etadaggaṃ, bhikkhave, mama sāvakānaṃ bhikkhūnaṃ sikkhākāmānaṃ yadidaṃ rāhulo’’ti (a. ni. 1.209) sikkhāyameva aggaṃ katvā ṭhapesi. Sopi āyasmā bhikkhusaṅghamajjhe tameva sīhanādaṃ nadi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Sabbametaṃ ",
      " abhiññāya, dhammarājā pitā mama;"
    ],
    "innerText": "‘‘Sabbametaṃ abhiññāya, dhammarājā pitā mama;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sammukhā bhikkhusaṅghassa, etadagge ṭhapesi maṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sikkhākāmānahaṃ aggo, dhammarājena thomito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saddhāpabbajitānañca, sahāyo pavaro mama."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dhammarājā pitā mayhaṃ, dhammārakkho ca pettiyo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sāriputto upajjhāyo, sabbaṃ me jinasāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassa bhagavā yasmā na kevalaṃ rūpameva, vedanādayopi evaṃ daṭṭhabbā, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpampi rāhulā"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ko najjā"
      },
      "ti ko nu ajja. Therassa kira etadahosi ‘‘sammāsambuddho mayhaṃ attabhāvanissitaṃ chandarāgaṃ ñatvā ‘samaṇena nāma evarūpo vitakko na vitakkitabbo’ti neva pariyāyena kathaṃ kathesi, gaccha bhikkhu rāhulaṃ vadehi ",
      " ‘mā puna evarūpaṃ vitakkaṃ vitakkesī’ti na dūtaṃ pesesi. Maṃ sammukkhe ṭhatvāyeva pana sabhaṇḍakaṃ coraṃ cūḷāya gaṇhanto viya sammukhā sugatovādaṃ adāsi. Sugatovādo ca nāma asaṅkheyyehipi kappehi dullabho. Evarūpassa buddhassa sammukhā ovādaṃ labhitvā ko nu ",
      " viññū paṇḍitajātiko ajja gāmaṃ piṇḍāya pavisissatī’’ti. Athesa āyasmā āhārakiccaṃ pahāya yasmiṃ nisinnaṭṭhāne ṭhitena ovādo laddho, tatova paṭinivattetvā aññatarasmiṃ rukkhamūle nisīdi. Bhagavāpi taṃ āyasmantaṃ nivattamānaṃ disvā na evamāha – ‘‘mā nivatta tāva, rāhula, bhikkhācārakālo te’’ti. Kasmā? Evaṃ kirassa ahosi – ‘‘ajja tāva kāyagatāsatiamatabhojanaṃ bhuñjatū’’ti."
    ],
    "innerText": "Athassa bhagavā yasmā na kevalaṃ rūpameva, vedanādayopi evaṃ daṭṭhabbā, tasmā rūpampi rāhulātiādimāha. Ko najjāti ko nu ajja. Therassa kira etadahosi ‘‘sammāsambuddho mayhaṃ attabhāvanissitaṃ chandarāgaṃ ñatvā ‘samaṇena nāma evarūpo vitakko na vitakkitabbo’ti neva pariyāyena kathaṃ kathesi, gaccha bhikkhu rāhulaṃ vadehi ‘mā puna evarūpaṃ vitakkaṃ vitakkesī’ti na dūtaṃ pesesi. Maṃ sammukkhe ṭhatvāyeva pana sabhaṇḍakaṃ coraṃ cūḷāya gaṇhanto viya sammukhā sugatovādaṃ adāsi. Sugatovādo ca nāma asaṅkheyyehipi kappehi dullabho. Evarūpassa buddhassa sammukhā ovādaṃ labhitvā ko nu viññū paṇḍitajātiko ajja gāmaṃ piṇḍāya pavisissatī’’ti. Athesa āyasmā āhārakiccaṃ pahāya yasmiṃ nisinnaṭṭhāne ṭhitena ovādo laddho, tatova paṭinivattetvā aññatarasmiṃ rukkhamūle nisīdi. Bhagavāpi taṃ āyasmantaṃ nivattamānaṃ disvā na evamāha – ‘‘mā nivatta tāva, rāhula, bhikkhācārakālo te’’ti. Kasmā? Evaṃ kirassa ahosi – ‘‘ajja tāva kāyagatāsatiamatabhojanaṃ bhuñjatū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Addasā kho āyasmā sāriputto"
      },
      "ti bhagavati gate pacchā gacchanto addasa. Etassa kirāyasmato ekakassa viharato aññaṃ vattaṃ, bhagavatā saddhiṃ viharato aññaṃ. Yadā hi dve aggasāvakā ekākino vasanti, tadā pātova senāsanaṃ sammajjitvā sarīrapaṭijagganaṃ katvā samāpattiṃ appetvā sannisinnā attano cittaruciyā bhikkhācāraṃ gacchanti. Bhagavatā saddhiṃ viharantā pana therā evaṃ na karonti. Tadā hi bhagavā bhikkhusaṅghaparivāro paṭhamaṃ bhikkhācāraṃ gacchati. Tasmiṃ gate thero attano senāsanā nikkhamitvā – ‘‘bahūnaṃ vasanaṭṭhāne nāma sabbeva pāsādikaṃ ",
      " kātuṃ sakkonti vā, na vā sakkontī’’ti tattha tattha gantvā asammaṭṭhaṃ ṭhānaṃ sammajjati. Sace kacavaro achaḍḍito hoti, taṃ chaḍḍeti. Pānīyaṭṭhapetabbaṭṭhānamhi pānīyakūṭe asati pānīyaghaṭaṃ ṭhapeti. Gilānānaṃ santikaṃ gantvā, ‘‘āvuso, tumhākaṃ kiṃ āharāmi, kiṃ vo icchitabba’’nti? Pucchati. Avassikadaharānaṃ santikaṃ gantvā – ‘‘abhiramatha, āvuso, mā ukkaṇṭhittha, paṭipattisārakaṃ buddhasāsana’’nti ovadati. Evaṃ katvā sabbapacchā bhikkhācāraṃ gacchati. Yathā ",
      " hi cakkavatti kuhiñci gantukāmo senāya parivārito paṭhamaṃ nikkhamati, pariṇāyakaratanaṃ senaṅgāni saṃvidhāya pacchā nikkhamati, evaṃ saddhammacakkavatti bhagavā bhikkhusaṅghaparivāro paṭhamaṃ nikkhamati, tassa bhagavato pariṇāyakaratanabhūto dhammasenāpati imaṃ kiccaṃ katvā sabbapacchā nikkhamati. So evaṃ nikkhanto tasmiṃ divase aññatarasmiṃ rukkhamūle nisinnaṃ rāhulabhaddaṃ addasa. Tena vuttaṃ ‘‘pacchā gacchanto addasā’’ti."
    ],
    "innerText": "Addasā kho āyasmā sāriputtoti bhagavati gate pacchā gacchanto addasa. Etassa kirāyasmato ekakassa viharato aññaṃ vattaṃ, bhagavatā saddhiṃ viharato aññaṃ. Yadā hi dve aggasāvakā ekākino vasanti, tadā pātova senāsanaṃ sammajjitvā sarīrapaṭijagganaṃ katvā samāpattiṃ appetvā sannisinnā attano cittaruciyā bhikkhācāraṃ gacchanti. Bhagavatā saddhiṃ viharantā pana therā evaṃ na karonti. Tadā hi bhagavā bhikkhusaṅghaparivāro paṭhamaṃ bhikkhācāraṃ gacchati. Tasmiṃ gate thero attano senāsanā nikkhamitvā – ‘‘bahūnaṃ vasanaṭṭhāne nāma sabbeva pāsādikaṃ kātuṃ sakkonti vā, na vā sakkontī’’ti tattha tattha gantvā asammaṭṭhaṃ ṭhānaṃ sammajjati. Sace kacavaro achaḍḍito hoti, taṃ chaḍḍeti. Pānīyaṭṭhapetabbaṭṭhānamhi pānīyakūṭe asati pānīyaghaṭaṃ ṭhapeti. Gilānānaṃ santikaṃ gantvā, ‘‘āvuso, tumhākaṃ kiṃ āharāmi, kiṃ vo icchitabba’’nti? Pucchati. Avassikadaharānaṃ santikaṃ gantvā – ‘‘abhiramatha, āvuso, mā ukkaṇṭhittha, paṭipattisārakaṃ buddhasāsana’’nti ovadati. Evaṃ katvā sabbapacchā bhikkhācāraṃ gacchati. Yathā hi cakkavatti kuhiñci gantukāmo senāya parivārito paṭhamaṃ nikkhamati, pariṇāyakaratanaṃ senaṅgāni saṃvidhāya pacchā nikkhamati, evaṃ saddhammacakkavatti bhagavā bhikkhusaṅghaparivāro paṭhamaṃ nikkhamati, tassa bhagavato pariṇāyakaratanabhūto dhammasenāpati imaṃ kiccaṃ katvā sabbapacchā nikkhamati. So evaṃ nikkhanto tasmiṃ divase aññatarasmiṃ rukkhamūle nisinnaṃ rāhulabhaddaṃ addasa. Tena vuttaṃ ‘‘pacchā gacchanto addasā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kasmā ānāpānassatiyaṃ niyojesi? Nisajjānucchavikattā. Thero kira ‘‘etassa bhagavatā rūpakammaṭṭhānaṃ kathita’’nti anāvajjitvāva yenākārena ayaṃ acalo anobaddho hutvā nisinno, idamassa etissā nisajjāya kammaṭṭhānaṃ anucchavikanti cintetvā evamāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānāpānassati"
      },
      "nti assāsapassāse pariggahetvā tattha catukkapañcakajjhānaṃ nibbattetvā vipassanaṃ vaḍḍhetvā arahattaṃ gaṇhāhīti dasseti."
    ],
    "innerText": "Atha kasmā ānāpānassatiyaṃ niyojesi? Nisajjānucchavikattā. Thero kira ‘‘etassa bhagavatā rūpakammaṭṭhānaṃ kathita’’nti anāvajjitvāva yenākārena ayaṃ acalo anobaddho hutvā nisinno, idamassa etissā nisajjāya kammaṭṭhānaṃ anucchavikanti cintetvā evamāha. Tattha ānāpānassatinti assāsapassāse pariggahetvā tattha catukkapañcakajjhānaṃ nibbattetvā vipassanaṃ vaḍḍhetvā arahattaṃ gaṇhāhīti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahapphalā hotī"
      },
      "ti kīvamahapphalā hoti? Idha bhikkhu ānāpānassatiṃ anuyutto ekāsane nisinnova sabbāsave khepetvā arahattaṃ pāpuṇāti, tathā asakkonto maraṇakāle samasīsī hoti, tathā asakkonto devaloke nibbattitvā dhammakathikadevaputtassa dhammaṃ sutvā arahattaṃ pāpuṇāti, tato viraddho anuppanne buddhuppāde paccekabodhiṃ sacchikaroti, taṃ asacchikaronto buddhānaṃ sammukhībhāve bāhiyattherādayo viya khippābhiñño hoti, evaṃ mahapphalā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahānisaṃsā"
      },
      "ti tasseva vevacanaṃ. Vuttampi cetaṃ –"
    ],
    "innerText": "Mahapphalā hotīti kīvamahapphalā hoti? Idha bhikkhu ānāpānassatiṃ anuyutto ekāsane nisinnova sabbāsave khepetvā arahattaṃ pāpuṇāti, tathā asakkonto maraṇakāle samasīsī hoti, tathā asakkonto devaloke nibbattitvā dhammakathikadevaputtassa dhammaṃ sutvā arahattaṃ pāpuṇāti, tato viraddho anuppanne buddhuppāde paccekabodhiṃ sacchikaroti, taṃ asacchikaronto buddhānaṃ sammukhībhāve bāhiyattherādayo viya khippābhiñño hoti, evaṃ mahapphalā. Mahānisaṃsāti tasseva vevacanaṃ. Vuttampi cetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Ānāpānassatī ",
      " yassa, paripuṇṇā subhāvitā;"
    ],
    "innerText": "‘‘Ānāpānassatī yassa, paripuṇṇā subhāvitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Anupubbaṃ paricitā, yathā buddhena desitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Somaṃ lokaṃ pabhāseti, abbhā muttova candimā’’ti. (theragā. 548; paṭi. ma. 1.1.60) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imaṃ ",
      " mahapphalataṃ sampassamāno thero saddhivihārikaṃ tattha niyojeti."
    ],
    "innerText": "Imaṃ mahapphalataṃ sampassamāno thero saddhivihārikaṃ tattha niyojeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iti bhagavā rūpakammaṭṭhānaṃ, thero ānāpānassatinti ubhopi kammaṭṭhānaṃ ācikkhitvā gatā, rāhulabhaddo vihāreyeva ohīno. Bhagavā tassa ohīnabhāvaṃ jānantopi neva attanā khādanīyaṃ bhojanīyaṃ gahetvā agamāsi, na ānandattherassa hatthe pesesi, na pasenadimahārājaanāthapiṇḍikādīnaṃ saññaṃ adāsi. Saññāmattakañhi labhitvā te kājabhattaṃ abhihareyyuṃ. Yathā ca bhagavā, evaṃ sāriputtattheropi na kiñci akāsi. Rāhulatthero nirāhāro chinnabhatto ahosi. Tassa panāyasmato – ‘‘bhagavā maṃ vihāre ohīnaṃ jānantopi attanā laddhapiṇḍapātaṃ nāpi sayaṃ gahetvā āgato, na aññassa hatthe pahiṇi ",
      ", na manussānaṃ saññaṃ adāsi, upajjhāyopi me ohīnabhāvaṃ jānanto tatheva na kiñci akāsī’’ti cittampi na uppannaṃ, kuto tappaccayā omānaṃ vā atimānaṃ vā janessati. Bhagavatā pana ācikkhitakammaṭṭhānameva purebhattampi pacchābhattampi – ‘‘itipi rūpaṃ aniccaṃ, itipi dukkhaṃ, itipi asubhaṃ, itipi anattā’’ti aggiṃ abhimatthento viya nirantaraṃ manasikatvā sāyanhasamaye cintesi – ‘‘ahaṃ upajjhāyena ānāpānassatiṃ bhāvehīti vutto ",
      ", tassa vacanaṃ na karissāmi. Ācariyupajjhāyānañhi vacanaṃ akaronto dubbaco nāma hoti. ‘Dubbaco rāhulo, upajjhāyassapi vacanaṃ na karotī’ti ca garahuppattito kakkhaḷatarā pīḷā nāma natthī’’ti bhāvanāvidhānaṃ pucchitukāmo bhagavato santikaṃ agamāsi. Taṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atha kho āyasmā rāhulo"
      },
      "tiādi vuttaṃ."
    ],
    "innerText": "Iti bhagavā rūpakammaṭṭhānaṃ, thero ānāpānassatinti ubhopi kammaṭṭhānaṃ ācikkhitvā gatā, rāhulabhaddo vihāreyeva ohīno. Bhagavā tassa ohīnabhāvaṃ jānantopi neva attanā khādanīyaṃ bhojanīyaṃ gahetvā agamāsi, na ānandattherassa hatthe pesesi, na pasenadimahārājaanāthapiṇḍikādīnaṃ saññaṃ adāsi. Saññāmattakañhi labhitvā te kājabhattaṃ abhihareyyuṃ. Yathā ca bhagavā, evaṃ sāriputtattheropi na kiñci akāsi. Rāhulatthero nirāhāro chinnabhatto ahosi. Tassa panāyasmato – ‘‘bhagavā maṃ vihāre ohīnaṃ jānantopi attanā laddhapiṇḍapātaṃ nāpi sayaṃ gahetvā āgato, na aññassa hatthe pahiṇi , na manussānaṃ saññaṃ adāsi, upajjhāyopi me ohīnabhāvaṃ jānanto tatheva na kiñci akāsī’’ti cittampi na uppannaṃ, kuto tappaccayā omānaṃ vā atimānaṃ vā janessati. Bhagavatā pana ācikkhitakammaṭṭhānameva purebhattampi pacchābhattampi – ‘‘itipi rūpaṃ aniccaṃ, itipi dukkhaṃ, itipi asubhaṃ, itipi anattā’’ti aggiṃ abhimatthento viya nirantaraṃ manasikatvā sāyanhasamaye cintesi – ‘‘ahaṃ upajjhāyena ānāpānassatiṃ bhāvehīti vutto , tassa vacanaṃ na karissāmi. Ācariyupajjhāyānañhi vacanaṃ akaronto dubbaco nāma hoti. ‘Dubbaco rāhulo, upajjhāyassapi vacanaṃ na karotī’ti ca garahuppattito kakkhaḷatarā pīḷā nāma natthī’’ti bhāvanāvidhānaṃ pucchitukāmo bhagavato santikaṃ agamāsi. Taṃ dassetuṃ atha kho āyasmā rāhulotiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "114"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisallānā"
      },
      "ti ekībhāvato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃkiñci rāhulā"
      },
      "ti kasmā? Bhagavā ānāpānassatiṃ puṭṭho rūpakammaṭṭhānaṃ kathetīti. Rūpe chandarāgappahānatthaṃ. Evaṃ kirassa ahosi – ‘‘rāhulassa attabhāvaṃ nissāya chandarāgo uppanno, heṭṭhā cassa saṅkhepena rūpakammaṭṭhānaṃ kathitaṃ. Idānissāpi dvicattālīsāya ākārehi attabhāvaṃ virājetvā visaṅkharitvā taṃnissitaṃ chandarāgaṃ anuppattidhammataṃ āpādessāmī’’ti. Atha ākāsadhātuṃ kasmā vitthāresīti? Upādārūpadassanatthaṃ. Heṭṭhā hi cattāri mahābhūtāneva kathitāni, na upādārūpaṃ. Tasmā iminā mukhena taṃ dassetuṃ ākāsadhātuṃ vitthāresi. Apica ajjhattikena ākāsena paricchinnarūpampi pākaṭaṃ hoti."
    ],
    "innerText": "114. Tattha paṭisallānāti ekībhāvato. Yaṃkiñci rāhulāti kasmā? Bhagavā ānāpānassatiṃ puṭṭho rūpakammaṭṭhānaṃ kathetīti. Rūpe chandarāgappahānatthaṃ. Evaṃ kirassa ahosi – ‘‘rāhulassa attabhāvaṃ nissāya chandarāgo uppanno, heṭṭhā cassa saṅkhepena rūpakammaṭṭhānaṃ kathitaṃ. Idānissāpi dvicattālīsāya ākārehi attabhāvaṃ virājetvā visaṅkharitvā taṃnissitaṃ chandarāgaṃ anuppattidhammataṃ āpādessāmī’’ti. Atha ākāsadhātuṃ kasmā vitthāresīti? Upādārūpadassanatthaṃ. Heṭṭhā hi cattāri mahābhūtāneva kathitāni, na upādārūpaṃ. Tasmā iminā mukhena taṃ dassetuṃ ākāsadhātuṃ vitthāresi. Apica ajjhattikena ākāsena paricchinnarūpampi pākaṭaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Ākāsena ",
      " paricchinnaṃ, rūpaṃ yāti vibhūtataṃ;"
    ],
    "innerText": "Ākāsena paricchinnaṃ, rūpaṃ yāti vibhūtataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tassevaṃ āvibhāvatthaṃ, taṃ pakāsesi nāyako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Ettha ",
      " pana purimāsu tāva catūsu dhātūsu yaṃ vattabbaṃ, taṃ mahāhatthipadopame vuttameva."
    ],
    "innerText": "Ettha pana purimāsu tāva catūsu dhātūsu yaṃ vattabbaṃ, taṃ mahāhatthipadopame vuttameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "118"
      },
      ". Ākāsadhātuyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ākāsagata"
      },
      "nti ākāsabhāvaṃ gataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upādinna"
      },
      "ntiādinnaṃ gahitaṃ parāmaṭṭhaṃ, sarīraṭṭhakanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṇṇacchidda"
      },
      "nti maṃsalohitādīhi asamphuṭṭhakaṇṇavivaraṃ. Nāsacchiddādīsupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cā"
      },
      "ti yena chiddena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhoharatī"
      },
      "ti anto paveseti, jivhābandhanato hi yāva udarapaṭalā manussānaṃ vidatthicaturaṅgulaṃ chiddaṭṭhānaṃ hoti. Taṃ sandhāyetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yattha cā"
      },
      "ti yasmiṃ okāse. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santiṭṭhatī"
      },
      "ti patiṭṭhāti. Manussānañhi mahantaṃ paṭaparissāvanamattañca udarapaṭalaṃ nāma hoti. Taṃ sandhāyetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhobhāgaṃ nikkhamatī"
      },
      "ti yena heṭṭhā nikkhamati. Dvattiṃsahatthamattaṃ ekavīsatiyā ṭhānesu vaṅkaṃ antaṃ nāma hoti. Taṃ sandhāyetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ vā panaññampī"
      },
      "ti iminā sukhumasukhumaṃ cammamaṃsādiantaragatañceva lomakūpabhāvena ca ṭhitaṃ ākāsaṃ dasseti. Sesametthāpi pathavīdhātuādīsu vuttanayeneva veditabbaṃ."
    ],
    "innerText": "118. Ākāsadhātuyaṃ ākāsagatanti ākāsabhāvaṃ gataṃ. Upādinnantiādinnaṃ gahitaṃ parāmaṭṭhaṃ, sarīraṭṭhakanti attho. Kaṇṇacchiddanti maṃsalohitādīhi asamphuṭṭhakaṇṇavivaraṃ. Nāsacchiddādīsupi eseva nayo. Yenacāti yena chiddena. Ajjhoharatīti anto paveseti, jivhābandhanato hi yāva udarapaṭalā manussānaṃ vidatthicaturaṅgulaṃ chiddaṭṭhānaṃ hoti. Taṃ sandhāyetaṃ vuttaṃ. Yattha cāti yasmiṃ okāse. Santiṭṭhatīti patiṭṭhāti. Manussānañhi mahantaṃ paṭaparissāvanamattañca udarapaṭalaṃ nāma hoti. Taṃ sandhāyetaṃ vuttaṃ. Adhobhāgaṃ nikkhamatīti yena heṭṭhā nikkhamati. Dvattiṃsahatthamattaṃ ekavīsatiyā ṭhānesu vaṅkaṃ antaṃ nāma hoti. Taṃ sandhāyetaṃ vuttaṃ. Yaṃ vā panaññampīti iminā sukhumasukhumaṃ cammamaṃsādiantaragatañceva lomakūpabhāvena ca ṭhitaṃ ākāsaṃ dasseti. Sesametthāpi pathavīdhātuādīsu vuttanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "119"
      },
      ". Idānissa tādibhāvalakkhaṇaṃ ācikkhanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pathavīsama"
      },
      "ntiādimāha. Iṭṭhāniṭṭhesu hi arajjanto adussanto tādī nāma hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manāpāmanāpā"
      },
      "ti ",
      " ettha aṭṭha lobhasahagatacittasampayuttā manāpā nāma, dve domanassacittasampayuttā amanāpā nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittaṃ na pariyādāya ṭhassantī"
      },
      "ti ete phassā uppajjitvā tava cittaṃ antomuṭṭhigataṃ karonto viya pariyādāya gahetvā ṭhātuṃ na sakkhissanti ‘‘ahaṃ sobhāmi, mayhaṃ vaṇṇāyatanaṃ pasanna’’nti puna attabhāvaṃ nissāya chandarāgo nuppajjissati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gūthagata"
      },
      "ntiādīsu gūthameva gūthagataṃ. Evaṃ sabbattha."
    ],
    "innerText": "119. Idānissa tādibhāvalakkhaṇaṃ ācikkhanto pathavīsamantiādimāha. Iṭṭhāniṭṭhesu hi arajjanto adussanto tādī nāma hoti. Manāpāmanāpāti ettha aṭṭha lobhasahagatacittasampayuttā manāpā nāma, dve domanassacittasampayuttā amanāpā nāma. Cittaṃ na pariyādāya ṭhassantīti ete phassā uppajjitvā tava cittaṃ antomuṭṭhigataṃ karonto viya pariyādāya gahetvā ṭhātuṃ na sakkhissanti ‘‘ahaṃ sobhāmi, mayhaṃ vaṇṇāyatanaṃ pasanna’’nti puna attabhāvaṃ nissāya chandarāgo nuppajjissati. Gūthagatantiādīsu gūthameva gūthagataṃ. Evaṃ sabbattha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na katthaci patiṭṭhito"
      },
      "ti pathavīpabbatarukkhādīsu ekasmimpi na patiṭṭhito, yadi hi pathaviyaṃ patiṭṭhito bhaveyya, pathaviyā bhijjamānāya saheva bhijjeyya, pabbate patamāne saheva pateyya, rukkhe chijjamāne saheva chijjeyya."
    ],
    "innerText": "Na katthaci patiṭṭhitoti pathavīpabbatarukkhādīsu ekasmimpi na patiṭṭhito, yadi hi pathaviyaṃ patiṭṭhito bhaveyya, pathaviyā bhijjamānāya saheva bhijjeyya, pabbate patamāne saheva pateyya, rukkhe chijjamāne saheva chijjeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "120"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mettaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rāhulā"
      },
      "ti kasmā ārabhi? Tādibhāvassa kāraṇadassanatthaṃ. Heṭṭhā hi tādibhāvalakkhaṇaṃ dassitaṃ, na ca sakkā ahaṃ tādī homīti akāraṇā bhavituṃ, napi ‘‘ahaṃ uccākulappasuto bahussuto lābhī, maṃ rājarājamahāmattādayo bhajanti, ahaṃ tādī homī’’ti imehi kāraṇehi koci tādī nāma hoti, mettādibhāvanāya pana hotīti tādibhāvassa kāraṇadassanatthaṃ imaṃ desanaṃ ārabhi."
    ],
    "innerText": "120.Mettaṃrāhulāti kasmā ārabhi? Tādibhāvassa kāraṇadassanatthaṃ. Heṭṭhā hi tādibhāvalakkhaṇaṃ dassitaṃ, na ca sakkā ahaṃ tādī homīti akāraṇā bhavituṃ, napi ‘‘ahaṃ uccākulappasuto bahussuto lābhī, maṃ rājarājamahāmattādayo bhajanti, ahaṃ tādī homī’’ti imehi kāraṇehi koci tādī nāma hoti, mettādibhāvanāya pana hotīti tādibhāvassa kāraṇadassanatthaṃ imaṃ desanaṃ ārabhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhāvayato"
      },
      "ti upacāraṃ vā appanaṃ vā pāpentassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo byāpādo"
      },
      "ti yo satte kopo, so pahīyissati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vihesā"
      },
      "ti pāṇiādīhi sattānaṃ vihiṃsanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aratī"
      },
      "ti pantasenāsanesu ceva adhikusaladhammesu ca ukkaṇṭhitatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭigho"
      },
      "ti yattha katthaci sattesu saṅkhāresu ca paṭihaññanakileso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asubha"
      },
      "nti ",
      " uddhumātakādīsu upacārappanaṃ. Uddhumātakādīsu asubhabhāvanā ca nāmesā vitthārato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visuddhimagge"
      },
      " kathitāva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rāgo"
      },
      "ti pañcakāmaguṇikarāgo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniccasañña"
      },
      "nti aniccānupassanāya sahajātasaññaṃ. Vipassanā eva vā esā asaññāpi saññāsīsena saññāti vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asmimāno"
      },
      "ti rūpādīsu asmīti māno."
    ],
    "innerText": "Tattha bhāvayatoti upacāraṃ vā appanaṃ vā pāpentassa. Yo byāpādoti yo satte kopo, so pahīyissati. Vihesāti pāṇiādīhi sattānaṃ vihiṃsanaṃ. Aratīti pantasenāsanesu ceva adhikusaladhammesu ca ukkaṇṭhitatā. Paṭighoti yattha katthaci sattesu saṅkhāresu ca paṭihaññanakileso. Asubhanti uddhumātakādīsu upacārappanaṃ. Uddhumātakādīsu asubhabhāvanā ca nāmesā vitthārato visuddhimagge kathitāva. Rāgoti pañcakāmaguṇikarāgo. Aniccasaññanti aniccānupassanāya sahajātasaññaṃ. Vipassanā eva vā esā asaññāpi saññāsīsena saññāti vuttā. Asmimānoti rūpādīsu asmīti māno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "121"
      },
      ". Idāni therena pucchitaṃ pañhaṃ vitthārento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānāpānassati"
      },
      "ntiādimāha. Tattha idaṃ kammaṭṭhānañca kammaṭṭhānabhāvanā ca pāḷiattho ca saddhiṃ ānisaṃsakathāya sabbo sabbākārena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visuddhimagge"
      },
      " anussatiniddese vitthāritoyeva. Imaṃ desanaṃ bhagavā neyyapuggalavaseneva pariniṭṭhāpesīti."
    ],
    "innerText": "121. Idāni therena pucchitaṃ pañhaṃ vitthārento ānāpānassatintiādimāha. Tattha idaṃ kammaṭṭhānañca kammaṭṭhānabhāvanā ca pāḷiattho ca saddhiṃ ānisaṃsakathāya sabbo sabbākārena visuddhimagge anussatiniddese vitthāritoyeva. Imaṃ desanaṃ bhagavā neyyapuggalavaseneva pariniṭṭhāpesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Māhārāhulovādasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Cūḷamālukyasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "122"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti mālukyasuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mālukyaputtassā"
      },
      "ti evaṃnāmakassa therassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhapitāni paṭikkhittānī"
      },
      "ti diṭṭhigatāni nāma na byākātabbānīti evaṃ ṭhapitāni ceva paṭikkhittāni ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathāgato"
      },
      "ti satto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ me na ruccatī"
      },
      "ti taṃ abyākaraṇaṃ mayhaṃ na ruccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikkhaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccakkhāyā"
      },
      "ti sikkhaṃ paṭikkhipitvā."
    ],
    "innerText": "122.Evaṃme sutanti mālukyasuttaṃ. Tattha mālukyaputtassāti evaṃnāmakassa therassa. Ṭhapitāni paṭikkhittānīti diṭṭhigatāni nāma na byākātabbānīti evaṃ ṭhapitāni ceva paṭikkhittāni ca. Tathāgatoti satto. Taṃ me na ruccatīti taṃ abyākaraṇaṃ mayhaṃ na ruccati. Sikkhaṃpaccakkhāyāti sikkhaṃ paṭikkhipitvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "125"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ko santo kaṃ paccācikkhasī"
      },
      "ti yācako vā hi yācitakaṃ paccācikkheyya, yācitako vā yācakaṃ. Tvaṃ neva yācako na yācitako, so dāni tvaṃ ko santo kaṃ paccācikkhasīti attho."
    ],
    "innerText": "125.Ko santo kaṃ paccācikkhasīti yācako vā hi yācitakaṃ paccācikkheyya, yācitako vā yācakaṃ. Tvaṃ neva yācako na yācitako, so dāni tvaṃ ko santo kaṃ paccācikkhasīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "126"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viddho"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "assā"
      },
      "ti parasenāya ṭhitena viddho bhaveyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gāḷhapalepanenā"
      },
      "ti bahalalepanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhisakka"
      },
      "nti vejjaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sallakatta"
      },
      "nti sallakantanaṃ sallakantiyasuttavācakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akkassā"
      },
      "ti akkavāke gahetvā jiyaṃ karonti. Tena vuttaṃ ‘‘akkassā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṇhassā"
      },
      "ti veṇuvilīvassa. Maruvākhīrapaṇṇīnampi vākehiyeva karonti. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yadi vā maruvāya yadi vā khīrapaṇṇino"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gaccha"
      },
      "nti pabbatagacchanadīgacchādīsu jātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ropima"
      },
      "nti ropetvā vaḍḍhitaṃ saravanato saraṃ gahetvā kataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sithilahanuno"
      },
      "ti evaṃnāmakassa pakkhino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bheravassā"
      },
      "ti kāḷasīhassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Semhārassā"
      },
      "ti makkaṭassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ no"
      },
      "ti etāya diṭṭhiyā sati na hotīti attho."
    ],
    "innerText": "126.Viddhoassāti parasenāya ṭhitena viddho bhaveyya. Gāḷhapalepanenāti bahalalepanena. Bhisakkanti vejjaṃ. Sallakattanti sallakantanaṃ sallakantiyasuttavācakaṃ. Akkassāti akkavāke gahetvā jiyaṃ karonti. Tena vuttaṃ ‘‘akkassā’’ti. Saṇhassāti veṇuvilīvassa. Maruvākhīrapaṇṇīnampi vākehiyeva karonti. Tena vuttaṃ yadi vā maruvāya yadi vā khīrapaṇṇinoti. Gacchanti pabbatagacchanadīgacchādīsu jātaṃ. Ropimanti ropetvā vaḍḍhitaṃ saravanato saraṃ gahetvā kataṃ. Sithilahanunoti evaṃnāmakassa pakkhino. Bheravassāti kāḷasīhassa. Semhārassāti makkaṭassa. Evaṃ noti etāya diṭṭhiyā sati na hotīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "127"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attheva jātī"
      },
      "ti etāya diṭṭhiyā sati brahmacariyavāsova natthi, jāti pana atthiyeva. Tathā jarāmaraṇādīnīti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yesāha"
      },
      "nti yesaṃ ahaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nighāta"
      },
      "nti upaghātaṃ vināsaṃ. Mama sāvakā hi etesu nibbinnā idheva nibbānaṃ pāpuṇantīti adhippāyo."
    ],
    "innerText": "127.Attheva jātīti etāya diṭṭhiyā sati brahmacariyavāsova natthi, jāti pana atthiyeva. Tathā jarāmaraṇādīnīti dasseti. Yesāhanti yesaṃ ahaṃ. Nighātanti upaghātaṃ vināsaṃ. Mama sāvakā hi etesu nibbinnā idheva nibbānaṃ pāpuṇantīti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "128"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmātihā"
      },
      "ti ",
      " yasmā abyākatametaṃ, catusaccameva mayā byākataṃ, tasmāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na hetaṃ mālukyaputta atthasaṃhita"
      },
      "nti etaṃ diṭṭhigataṃ vā etaṃ byākaraṇaṃ vā kāraṇanissitaṃ ",
      " na hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ādibrahmacariyaka"
      },
      "nti brahmacariyassa ādimattampi pubbabhāgasīlamattampi na hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na nibbidāyā"
      },
      "tiādīsu vaṭṭe nibbindanatthāya vā virajjhanatthāya vā vaṭṭanirodhāya vā rāgādivūpasamanatthāya vā abhiññeyye dhamme abhijānanatthāya vā catumaggasaṅkhātasambodhatthāya vā asaṅkhatanibbānasacchikiriyatthāya vā na hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etaṃ hī"
      },
      "ti etaṃ catusaccabyākaraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādibrahmacariyaka"
      },
      "nti brahmacariyassa ādibhūtaṃ pubbapadaṭṭhānaṃ. Sesaṃ vuttapaṭivipakkhanayena veditabbaṃ. Imampi desanaṃ bhagavā neyyapuggalavasena niṭṭhāpesīti."
    ],
    "innerText": "128.Tasmātihāti yasmā abyākatametaṃ, catusaccameva mayā byākataṃ, tasmāti attho. Na hetaṃ mālukyaputta atthasaṃhitanti etaṃ diṭṭhigataṃ vā etaṃ byākaraṇaṃ vā kāraṇanissitaṃ na hoti. Na ādibrahmacariyakanti brahmacariyassa ādimattampi pubbabhāgasīlamattampi na hoti. Na nibbidāyātiādīsu vaṭṭe nibbindanatthāya vā virajjhanatthāya vā vaṭṭanirodhāya vā rāgādivūpasamanatthāya vā abhiññeyye dhamme abhijānanatthāya vā catumaggasaṅkhātasambodhatthāya vā asaṅkhatanibbānasacchikiriyatthāya vā na hoti. Etaṃ hīti etaṃ catusaccabyākaraṇaṃ. Ādibrahmacariyakanti brahmacariyassa ādibhūtaṃ pubbapadaṭṭhānaṃ. Sesaṃ vuttapaṭivipakkhanayena veditabbaṃ. Imampi desanaṃ bhagavā neyyapuggalavasena niṭṭhāpesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cūḷamālukyasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Mahāmālukyasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "129"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti mahāmālukyasuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "orambhāgiyānī"
      },
      "ti heṭṭhā koṭṭhāsikāni kāmabhave nibbattisaṃvattanikāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃyojanānī"
      },
      "ti bandhanāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kho nāmā"
      },
      "ti kassa devassa vā manussassa vā desitāni dhāresi, kiṃ tvameveko assosi, na añño kocīti? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anusetī"
      },
      "ti appahīnatāya anuseti. Anusayamāno saṃyojanaṃ nāma hoti."
    ],
    "innerText": "129.Evaṃme sutanti mahāmālukyasuttaṃ. Tattha orambhāgiyānīti heṭṭhā koṭṭhāsikāni kāmabhave nibbattisaṃvattanikāni. Saṃyojanānīti bandhanāni. Kassakho nāmāti kassa devassa vā manussassa vā desitāni dhāresi, kiṃ tvameveko assosi, na añño kocīti? Anusetīti appahīnatāya anuseti. Anusayamāno saṃyojanaṃ nāma hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha ca bhagavatā saṃyojanaṃ pucchitaṃ, therenapi saṃyojanameva byākataṃ. Evaṃ santepi tassa vāde bhagavatā doso āropito. So kasmāti ce? Therassa tathāladdhikattā. Ayañhi tassa laddhi ‘‘samudācārakkhaṇeyeva kilesehi saṃyutto nāma hoti, itarasmiṃ khaṇe asaṃyutto’’ti. Tenassa bhagavatā doso āropito. Athāyasmā ānando cintesi – ‘‘bhagavatā bhikkhusaṅghassa dhammaṃ desessāmīti attano dhammatāyeva ayaṃ dhammadesanā āraddhā, sā iminā apaṇḍitena bhikkhunā visaṃvāditā. Handāhaṃ bhagavantaṃ yācitvā bhikkhūnaṃ dhammaṃ desessāmī’’ti. So evamakāsi. Taṃ dassetuṃ ‘‘evaṃ vutte āyasmā ānando’’tiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sakkāyadiṭṭhipariyuṭṭhitenā"
      },
      "ti sakkāyadiṭṭhiyā gahitena abhibhūtena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakkāyadiṭṭhiparetenā"
      },
      "ti sakkāyadiṭṭhiyā anugatena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nissaraṇa"
      },
      "nti diṭṭhinissaraṇaṃ nāma nibbānaṃ, taṃ yathābhūtaṃ nappajānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaṭivinītā"
      },
      "ti avinoditā anīhaṭā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Orambhāgiyaṃ saṃyojana"
      },
      "nti heṭṭhābhāgiyasaṃyojanaṃ nāma hoti. Sesapadesupi eseva nayo. Sukkapakkho uttānatthoyeva. ‘‘Sānusayā pahīyatī’’ti vacanato panettha ekacce ‘‘aññaṃ saṃyojanaṃ añño anusayo’’ti vadanti. ‘‘Yathā hi sabyañjanaṃ bhatta’’nti vutte bhattato aññaṃ byañjanaṃ hoti, evaṃ ‘‘sānusayā’’ti vacanato pariyuṭṭhānasakkāyadiṭṭhito aññena anusayena bhavitabbanti tesaṃ laddhi. Te ‘‘sasīsaṃ pārupitvā’’tiādīhi ",
      " paṭikkhipitabbā. Na hi sīsato añño puriso atthi. Athāpi siyā – ‘‘yadi tadeva saṃyojanaṃ so anusayo, evaṃ sante bhagavatā therassa ",
      " taruṇūpamo upārambho duāropito hotī’’ti. Na duāropito, kasmā? Evaṃladdhikattāti ",
      " vitthāritametaṃ. Tasmā soyeva kileso bandhanaṭṭhena saṃyojanaṃ, appahīnaṭṭhena anusayoti imamatthaṃ sandhāya bhagavatā ‘‘sānusayā pahīyatī’’ti evaṃ vuttanti veditabbaṃ."
    ],
    "innerText": "Tattha sakkāyadiṭṭhipariyuṭṭhitenāti sakkāyadiṭṭhiyā gahitena abhibhūtena. Sakkāyadiṭṭhiparetenāti sakkāyadiṭṭhiyā anugatena. Nissaraṇanti diṭṭhinissaraṇaṃ nāma nibbānaṃ, taṃ yathābhūtaṃ nappajānāti. Appaṭivinītāti avinoditā anīhaṭā. Orambhāgiyaṃ saṃyojananti heṭṭhābhāgiyasaṃyojanaṃ nāma hoti. Sesapadesupi eseva nayo. Sukkapakkho uttānatthoyeva. ‘‘Sānusayā pahīyatī’’ti vacanato panettha ekacce ‘‘aññaṃ saṃyojanaṃ añño anusayo’’ti vadanti. ‘‘Yathā hi sabyañjanaṃ bhatta’’nti vutte bhattato aññaṃ byañjanaṃ hoti, evaṃ ‘‘sānusayā’’ti vacanato pariyuṭṭhānasakkāyadiṭṭhito aññena anusayena bhavitabbanti tesaṃ laddhi. Te ‘‘sasīsaṃ pārupitvā’’tiādīhi paṭikkhipitabbā. Na hi sīsato añño puriso atthi. Athāpi siyā – ‘‘yadi tadeva saṃyojanaṃ so anusayo, evaṃ sante bhagavatā therassa taruṇūpamo upārambho duāropito hotī’’ti. Na duāropito, kasmā? Evaṃladdhikattāti vitthāritametaṃ. Tasmā soyeva kileso bandhanaṭṭhena saṃyojanaṃ, appahīnaṭṭhena anusayoti imamatthaṃ sandhāya bhagavatā ‘‘sānusayā pahīyatī’’ti evaṃ vuttanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "132"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tacaṃ chetvā"
      },
      "tiādīsu idaṃ opammasaṃsandanaṃ – tacacchedo viya hi samāpatti daṭṭhabbā, pheggucchedo viya vipassanā, sāracchedo viya maggo. Paṭipadā pana lokiyalokuttaramissakāva vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evamete daṭṭhabbā"
      },
      "ti evarūpā puggalā evaṃ daṭṭhabbā."
    ],
    "innerText": "132.Tacaṃ chetvātiādīsu idaṃ opammasaṃsandanaṃ – tacacchedo viya hi samāpatti daṭṭhabbā, pheggucchedo viya vipassanā, sāracchedo viya maggo. Paṭipadā pana lokiyalokuttaramissakāva vaṭṭati. Evamete daṭṭhabbāti evarūpā puggalā evaṃ daṭṭhabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "133"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upadhivivekā"
      },
      "ti upadhivivekena. Iminā pañcakāmaguṇaviveko kathito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akusalānaṃ dhammānaṃ pahānā"
      },
      "ti iminā nīvaraṇappahānaṃ kathitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyaduṭṭhullānaṃ paṭippassaddhiyā"
      },
      "ti iminā kāyālasiyapaṭippassaddhi kathitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivicceva kāmehī"
      },
      "ti upadhivivekena kāmehi vinā hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivicca akusalehī"
      },
      "ti akusalānaṃ dhammānaṃ pahānena kāyaduṭṭhullānaṃ paṭippassaddhiyā ca akusalehi vinā hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadeva tattha hotī"
      },
      "ti yaṃ tattha antosamāpattikkhaṇeyeva samāpattisamuṭṭhitañca rūpādidhammajātaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhamme"
      },
      "ti te rūpagatantiādinā nayena vutte rūpādayo dhamme. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniccato"
      },
      "ti na niccato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhato"
      },
      "ti na sukhato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rogato"
      },
      "tiādīsu ābādhaṭṭhena rogato, antodosaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gaṇḍato,"
      },
      " anupaviddhaṭṭhena dukkhajananaṭṭhena ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sallato,"
      },
      " dukkhaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aghato,"
      },
      " rogaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ābādhato,"
      },
      " asakaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parato,"
      },
      " palujjanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "palokato,"
      },
      " nissattaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suññato,"
      },
      " na attaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anattato."
      },
      " Tattha aniccato, palokatoti dvīhi padehi aniccalakkhaṇaṃ kathitaṃ, dukkhatotiādīhi chahi dukkhalakkhaṇaṃ, parato suññato anattatoti tīhi anattalakkhaṇaṃ."
    ],
    "innerText": "133.Upadhivivekāti upadhivivekena. Iminā pañcakāmaguṇaviveko kathito. Akusalānaṃ dhammānaṃ pahānāti iminā nīvaraṇappahānaṃ kathitaṃ. Kāyaduṭṭhullānaṃ paṭippassaddhiyāti iminā kāyālasiyapaṭippassaddhi kathitā. Vivicceva kāmehīti upadhivivekena kāmehi vinā hutvā. Vivicca akusalehīti akusalānaṃ dhammānaṃ pahānena kāyaduṭṭhullānaṃ paṭippassaddhiyā ca akusalehi vinā hutvā. Yadeva tattha hotīti yaṃ tattha antosamāpattikkhaṇeyeva samāpattisamuṭṭhitañca rūpādidhammajātaṃ hoti. Tedhammeti te rūpagatantiādinā nayena vutte rūpādayo dhamme. Aniccatoti na niccato. Dukkhatoti na sukhato. Rogatotiādīsu ābādhaṭṭhena rogato, antodosaṭṭhena gaṇḍato, anupaviddhaṭṭhena dukkhajananaṭṭhena ca sallato, dukkhaṭṭhena aghato, rogaṭṭhena ābādhato, asakaṭṭhena parato, palujjanaṭṭhena palokato, nissattaṭṭhena suññato, na attaṭṭhena anattato. Tattha aniccato, palokatoti dvīhi padehi aniccalakkhaṇaṃ kathitaṃ, dukkhatotiādīhi chahi dukkhalakkhaṇaṃ, parato suññato anattatoti tīhi anattalakkhaṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So tehi dhammehī"
      },
      "ti so tehi evaṃ tilakkhaṇaṃ āropetvā diṭṭhehi antosamāpattiyaṃ pañcakkhandhadhammehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittaṃ paṭivāpetī"
      },
      "ti cittaṃ paṭisaṃharati moceti apaneti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasaṃharatī"
      },
      "ti vipassanācittaṃ tāva savanavasena ",
      " thutivasena pariyattivasena paññattivasena ca etaṃ santaṃ nibbānanti evaṃ asaṅkhatāya amatāya dhātuyā upasaṃharati. Maggacittaṃ nibbānaṃ ārammaṇakaraṇavaseneva etaṃ santametaṃ paṇītanti na evaṃ vadati, iminā pana ākārena taṃ paṭivijjhanto tattha cittaṃ upasaṃharatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So tattha ṭhito"
      },
      "ti tāya tilakkhaṇārammaṇāya vipassanāya ṭhito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsavānaṃ khayaṃ pāpuṇātī"
      },
      "ti anukkamena cattāro magge bhāvetvā pāpuṇāti ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Teneva dhammarāgenā"
      },
      "ti samathavipassanādhamme chandarāgena. Samathavipassanāsu hi sabbaso chandarāgaṃ pariyādātuṃ sakkonto arahattaṃ pāpuṇāti, asakkonto anāgāmī hoti."
    ],
    "innerText": "So tehi dhammehīti so tehi evaṃ tilakkhaṇaṃ āropetvā diṭṭhehi antosamāpattiyaṃ pañcakkhandhadhammehi. Cittaṃ paṭivāpetīti cittaṃ paṭisaṃharati moceti apaneti. Upasaṃharatīti vipassanācittaṃ tāva savanavasena thutivasena pariyattivasena paññattivasena ca etaṃ santaṃ nibbānanti evaṃ asaṅkhatāya amatāya dhātuyā upasaṃharati. Maggacittaṃ nibbānaṃ ārammaṇakaraṇavaseneva etaṃ santametaṃ paṇītanti na evaṃ vadati, iminā pana ākārena taṃ paṭivijjhanto tattha cittaṃ upasaṃharatīti attho. So tattha ṭhitoti tāya tilakkhaṇārammaṇāya vipassanāya ṭhito. Āsavānaṃ khayaṃ pāpuṇātīti anukkamena cattāro magge bhāvetvā pāpuṇāti . Teneva dhammarāgenāti samathavipassanādhamme chandarāgena. Samathavipassanāsu hi sabbaso chandarāgaṃ pariyādātuṃ sakkonto arahattaṃ pāpuṇāti, asakkonto anāgāmī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadeva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha hoti vedanāgata"
      },
      "nti idha pana rūpaṃ na gahitaṃ. Kasmā? Samatikkantattā. Ayañhi heṭṭhā rūpāvacarajjhānaṃ samāpajjitvā rūpaṃ atikkamitvā arūpāvacarasamāpattiṃ samāpannoti samathavasenapinena rūpaṃ atikkantaṃ, heṭṭhā rūpaṃ sammadeva sammasitvā taṃ atikkamma idāni arūpaṃ sammasatīti vipassanāvasenapinena rūpaṃ atikkantaṃ. Arūpe pana sabbasopi rūpaṃ natthīti taṃ sandhāyapi idha rūpaṃ na gahitaṃ."
    ],
    "innerText": "Yadevatattha hoti vedanāgatanti idha pana rūpaṃ na gahitaṃ. Kasmā? Samatikkantattā. Ayañhi heṭṭhā rūpāvacarajjhānaṃ samāpajjitvā rūpaṃ atikkamitvā arūpāvacarasamāpattiṃ samāpannoti samathavasenapinena rūpaṃ atikkantaṃ, heṭṭhā rūpaṃ sammadeva sammasitvā taṃ atikkamma idāni arūpaṃ sammasatīti vipassanāvasenapinena rūpaṃ atikkantaṃ. Arūpe pana sabbasopi rūpaṃ natthīti taṃ sandhāyapi idha rūpaṃ na gahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha kiñcarahī"
      },
      "ti kiṃ pucchāmīti pucchati? Samathavasena gacchato cittekaggatā dhuraṃ hoti, so cetovimutto nāma. Vipassanāvasena gacchato paññā dhuraṃ hoti, so paññāvimutto nāmāti ettha therassa kaṅkhā natthi. Ayaṃ sabhāvadhammoyeva, samathavaseneva pana gacchantesu eko cetovimutto nāma hoti, eko paññāvimutto. Vipassanāvasena gacchantesupi eko paññāvimutto nāma hoti, eko cetovimuttoti ettha kiṃ kāraṇanti pucchati."
    ],
    "innerText": "Atha kiñcarahīti kiṃ pucchāmīti pucchati? Samathavasena gacchato cittekaggatā dhuraṃ hoti, so cetovimutto nāma. Vipassanāvasena gacchato paññā dhuraṃ hoti, so paññāvimutto nāmāti ettha therassa kaṅkhā natthi. Ayaṃ sabhāvadhammoyeva, samathavaseneva pana gacchantesu eko cetovimutto nāma hoti, eko paññāvimutto. Vipassanāvasena gacchantesupi eko paññāvimutto nāma hoti, eko cetovimuttoti ettha kiṃ kāraṇanti pucchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Indriyavemattataṃ vadāmī"
      },
      "ti indriyanānattataṃ vadāmi. Idaṃ vuttaṃ hoti, na tvaṃ, ānanda, dasa pāramiyo pūretvā sabbaññutaṃ paṭivijjhi, tena te etaṃ apākaṭaṃ. Ahaṃ pana paṭivijjhiṃ, tena me etaṃ pākaṭaṃ. Ettha hi indriyanānattatā kāraṇaṃ. Samathavaseneva hi gacchantesu ekassa bhikkhuno cittekaggatā dhuraṃ hoti, so cetovimutto nāma hoti. Ekassa paññā dhuraṃ hoti, so paññāvimutto nāma hoti. Vipassanāvaseneva ca gacchantesu ekassa paññā dhuraṃ hoti, so paññāvimutto ",
      " nāma hoti. Ekassa cittekaggatā dhuraṃ hoti, so cetovimutto nāma ",
      " hoti. Dve aggasāvakā samathavipassanādhurena arahattaṃ pattā. Tesu dhammasenāpati paññāvimutto jāto, mahāmoggallānatthero cetovimutto. Iti indriyavemattamettha kāraṇanti veditabbaṃ. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "Indriyavemattataṃ vadāmīti indriyanānattataṃ vadāmi. Idaṃ vuttaṃ hoti, na tvaṃ, ānanda, dasa pāramiyo pūretvā sabbaññutaṃ paṭivijjhi, tena te etaṃ apākaṭaṃ. Ahaṃ pana paṭivijjhiṃ, tena me etaṃ pākaṭaṃ. Ettha hi indriyanānattatā kāraṇaṃ. Samathavaseneva hi gacchantesu ekassa bhikkhuno cittekaggatā dhuraṃ hoti, so cetovimutto nāma hoti. Ekassa paññā dhuraṃ hoti, so paññāvimutto nāma hoti. Vipassanāvaseneva ca gacchantesu ekassa paññā dhuraṃ hoti, so paññāvimutto nāma hoti. Ekassa cittekaggatā dhuraṃ hoti, so cetovimutto nāma hoti. Dve aggasāvakā samathavipassanādhurena arahattaṃ pattā. Tesu dhammasenāpati paññāvimutto jāto, mahāmoggallānatthero cetovimutto. Iti indriyavemattamettha kāraṇanti veditabbaṃ. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahāmālukyasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Bhaddālisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "134"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti bhaddālisuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekāsanabhojana"
      },
      "nti ekasmiṃ purebhatte asanabhojanaṃ, bhuñjitabbabhattanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appābādhata"
      },
      "ntiādīni kakacopame vitthāritāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ussahāmī"
      },
      "ti na sakkomi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siyā kukkuccaṃ siyā vippaṭisāro"
      },
      "ti evaṃ bhuñjanto yāvajīvaṃ brahmacariyaṃ carituṃ sakkhissāmi nu kho, na nu khoti iti me vippaṭisārakukkuccaṃ bhaveyyāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekadesaṃ bhuñjitvā"
      },
      "ti porāṇakattherā kira patte bhattaṃ pakkhipitvā sappimhi dinne sappinā uṇhameva thokaṃ bhuñjitvā hatthe dhovitvā avasesaṃ bahi nīharitvā chāyūdakaphāsuke ṭhāne nisīditvā bhuñjanti. Etaṃ sandhāya satthā āha. Bhaddāli, pana cintesi – ‘‘sace sakiṃ pattaṃ pūretvā dinnaṃ bhattaṃ bhuñjitvā puna pattaṃ dhovitvā odanassa pūretvā laddhaṃ ",
      " bahi nīharitvā chāyūdakaphāsuke ṭhāne bhuñjeyya, iti evaṃ vaṭṭeyya, itarathā ko sakkotī’’ti. Tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "evampi kho ahaṃ, bhante, na ussahāmī"
      },
      "ti āha. Ayaṃ kira atīte anantarāya jātiyā kākayoniyaṃ nibbatti. Kākā ca nāma mahāchātakā honti. Tasmā chātakatthero nāma ahosi. Tassa pana viravantasseva bhagavā taṃ madditvā ajjhottharitvā – ‘‘yo pana bhikkhu vikāle khādanīyaṃ vā bhojanīyaṃ vā khādeyya vā bhuñjeyya vā pācittiya’’nti (pāci. 248) sikkhāpadaṃ paññapesi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atha kho āyasmā, bhaddāli,…pe… anussāhaṃ pavedesī"
      },
      "ti."
    ],
    "innerText": "134.Evaṃme sutanti bhaddālisuttaṃ. Tattha ekāsanabhojananti ekasmiṃ purebhatte asanabhojanaṃ, bhuñjitabbabhattanti attho. Appābādhatantiādīni kakacopame vitthāritāni. Na ussahāmīti na sakkomi. Siyā kukkuccaṃ siyā vippaṭisāroti evaṃ bhuñjanto yāvajīvaṃ brahmacariyaṃ carituṃ sakkhissāmi nu kho, na nu khoti iti me vippaṭisārakukkuccaṃ bhaveyyāti attho. Ekadesaṃ bhuñjitvāti porāṇakattherā kira patte bhattaṃ pakkhipitvā sappimhi dinne sappinā uṇhameva thokaṃ bhuñjitvā hatthe dhovitvā avasesaṃ bahi nīharitvā chāyūdakaphāsuke ṭhāne nisīditvā bhuñjanti. Etaṃ sandhāya satthā āha. Bhaddāli, pana cintesi – ‘‘sace sakiṃ pattaṃ pūretvā dinnaṃ bhattaṃ bhuñjitvā puna pattaṃ dhovitvā odanassa pūretvā laddhaṃ bahi nīharitvā chāyūdakaphāsuke ṭhāne bhuñjeyya, iti evaṃ vaṭṭeyya, itarathā ko sakkotī’’ti. Tasmā evampi kho ahaṃ, bhante, na ussahāmīti āha. Ayaṃ kira atīte anantarāya jātiyā kākayoniyaṃ nibbatti. Kākā ca nāma mahāchātakā honti. Tasmā chātakatthero nāma ahosi. Tassa pana viravantasseva bhagavā taṃ madditvā ajjhottharitvā – ‘‘yo pana bhikkhu vikāle khādanīyaṃ vā bhojanīyaṃ vā khādeyya vā bhuñjeyya vā pācittiya’’nti (pāci. 248) sikkhāpadaṃ paññapesi. Tena vuttaṃ atha kho āyasmā, bhaddāli,…pe… anussāhaṃ pavedesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ta"
      },
      "nti yathā aññopi sikkhāya na paripūrakārī ekavihārepi vasanto satthu sammukhībhāvaṃ na dadeyya, tatheva na adāsīti attho. Neva bhagavato upaṭṭhānaṃ agamāsi, na dhammadesanaṭṭhānaṃ na vitakkamāḷakaṃ, na ekaṃ bhikkhācāramaggaṃ paṭipajji. Yasmiṃ kule bhagavā nisīdati, tassa dvārepi na aṭṭhāsi. Sacassa vasanaṭṭhānaṃ bhagavā gacchati, so puretarameva ñatvā aññattha gacchati. Saddhāpabbajito kiresa kulaputto parisuddhasīlo. Tenassa na añño vitakko ahosi, – ‘‘mayā nāma udarakāraṇā bhagavato sikkhāpadapaññāpanaṃ paṭibāhitaṃ, ananucchavikaṃ ",
      " me kata’’nti ayameva vitakko ahosi. Tasmā ekavihāre vasantopi lajjāya satthu sammukhībhāvaṃ nādāsi."
    ],
    "innerText": "Yathātanti yathā aññopi sikkhāya na paripūrakārī ekavihārepi vasanto satthu sammukhībhāvaṃ na dadeyya, tatheva na adāsīti attho. Neva bhagavato upaṭṭhānaṃ agamāsi, na dhammadesanaṭṭhānaṃ na vitakkamāḷakaṃ, na ekaṃ bhikkhācāramaggaṃ paṭipajji. Yasmiṃ kule bhagavā nisīdati, tassa dvārepi na aṭṭhāsi. Sacassa vasanaṭṭhānaṃ bhagavā gacchati, so puretarameva ñatvā aññattha gacchati. Saddhāpabbajito kiresa kulaputto parisuddhasīlo. Tenassa na añño vitakko ahosi, – ‘‘mayā nāma udarakāraṇā bhagavato sikkhāpadapaññāpanaṃ paṭibāhitaṃ, ananucchavikaṃ me kata’’nti ayameva vitakko ahosi. Tasmā ekavihāre vasantopi lajjāya satthu sammukhībhāvaṃ nādāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "135"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cīvarakammaṃ karontī"
      },
      "ti manussā bhagavato cīvarasāṭakaṃ adaṃsu, taṃ gahetvā cīvaraṃ karonti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etaṃ dosaka"
      },
      "nti etaṃ okāsametaṃ aparādhaṃ, satthu sikkhāpadaṃ paññapentassa paṭibāhitakāraṇaṃ sādhukaṃ manasi karohīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkaratara"
      },
      "nti ",
      " vassañhi vasitvā disāpakkante bhikkhū kuhiṃ vasitthāti pucchanti, tehi jetavane vasimhāti vutte, ‘‘āvuso, bhagavā imasmiṃ antovasse kataraṃ jātakaṃ kathesi, kataraṃ suttantaṃ, kataraṃ sikkhāpadaṃ paññapesī’’ti pucchitāro honti. Tato ‘‘vikālabhojanasikkhāpadaṃ paññapesi, bhaddāli, nāma naṃ eko thero paṭibāhī’’ti vakkhanti. Taṃ sutvā bhikkhū – ‘‘bhagavatopi nāma sikkhāpadaṃ paññapentassa paṭibāhitaṃ ayuttaṃ akāraṇa’’nti vadanti. Evaṃ te ayaṃ doso mahājanantare pākaṭo hutvā duppaṭikārataṃ āpajjissatīti maññamānā evamāhaṃsu. Apica aññepi bhikkhū pavāretvā satthu santikaṃ āgamissanti. Atha tvaṃ ‘‘ethāvuso, mama satthāraṃ khamāpentassa sahāyā hothā’’ti saṅghaṃ sannipātessasi. Tattha āgantukā pucchissanti, ‘‘āvuso, kiṃ imināpi bhikkhunā kata’’nti. Tato etamatthaṃ sutvā ‘‘bhāriyaṃ kataṃ bhikkhunā, dasabalaṃ nāma paṭibāhissatīti ayuttameta’’nti vakkhanti. Evampi te ayaṃ aparādho mahājanantare pākaṭo hutvā duppaṭikārataṃ āpajjissatīti maññamānāpi evamāhaṃsu. Atha vā bhagavā pavāretvā cārikaṃ pakkamissati, atha tvaṃ gatagataṭṭhāne bhagavato khamāpanatthāya saṅghaṃ sannipātessasi. Tatra disāvāsino ",
      " bhikkhū pucchissanti, ‘‘āvuso, kiṃ iminā bhikkhunā kata’’nti…pe… duppaṭikārataṃ āpajjissatīti maññamānāpi evamāhaṃsu."
    ],
    "innerText": "135.Cīvarakammaṃ karontīti manussā bhagavato cīvarasāṭakaṃ adaṃsu, taṃ gahetvā cīvaraṃ karonti. Etaṃ dosakanti etaṃ okāsametaṃ aparādhaṃ, satthu sikkhāpadaṃ paññapentassa paṭibāhitakāraṇaṃ sādhukaṃ manasi karohīti attho. Dukkarataranti vassañhi vasitvā disāpakkante bhikkhū kuhiṃ vasitthāti pucchanti, tehi jetavane vasimhāti vutte, ‘‘āvuso, bhagavā imasmiṃ antovasse kataraṃ jātakaṃ kathesi, kataraṃ suttantaṃ, kataraṃ sikkhāpadaṃ paññapesī’’ti pucchitāro honti. Tato ‘‘vikālabhojanasikkhāpadaṃ paññapesi, bhaddāli, nāma naṃ eko thero paṭibāhī’’ti vakkhanti. Taṃ sutvā bhikkhū – ‘‘bhagavatopi nāma sikkhāpadaṃ paññapentassa paṭibāhitaṃ ayuttaṃ akāraṇa’’nti vadanti. Evaṃ te ayaṃ doso mahājanantare pākaṭo hutvā duppaṭikārataṃ āpajjissatīti maññamānā evamāhaṃsu. Apica aññepi bhikkhū pavāretvā satthu santikaṃ āgamissanti. Atha tvaṃ ‘‘ethāvuso, mama satthāraṃ khamāpentassa sahāyā hothā’’ti saṅghaṃ sannipātessasi. Tattha āgantukā pucchissanti, ‘‘āvuso, kiṃ imināpi bhikkhunā kata’’nti. Tato etamatthaṃ sutvā ‘‘bhāriyaṃ kataṃ bhikkhunā, dasabalaṃ nāma paṭibāhissatīti ayuttameta’’nti vakkhanti. Evampi te ayaṃ aparādho mahājanantare pākaṭo hutvā duppaṭikārataṃ āpajjissatīti maññamānāpi evamāhaṃsu. Atha vā bhagavā pavāretvā cārikaṃ pakkamissati, atha tvaṃ gatagataṭṭhāne bhagavato khamāpanatthāya saṅghaṃ sannipātessasi. Tatra disāvāsino bhikkhū pucchissanti, ‘‘āvuso, kiṃ iminā bhikkhunā kata’’nti…pe… duppaṭikārataṃ āpajjissatīti maññamānāpi evamāhaṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etadavocā"
      },
      "ti appatirūpaṃ mayā kataṃ, bhagavā pana mahantepi aguṇe alaggitvā mayhaṃ accayaṃ paṭiggaṇhissatīti maññamāno etaṃ ‘‘accayo maṃ, bhante,’’tiādivacanaṃ avoca. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "accayo"
      },
      "ti aparādho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maṃ accagamā"
      },
      "ti maṃ atikkamma abhibhavitvā pavatto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭiggaṇhātū"
      },
      "ti khamatu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āyatiṃ saṃvarāyā"
      },
      "ti anāgate saṃvaraṇatthāya, puna evarūpassa aparādhassa dosassa khalitassa akaraṇatthāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tagghā"
      },
      "ti ekaṃsena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samayopi kho te, bhaddālī"
      },
      "ti, bhaddāli, tayā paṭivijjhitabbayuttakaṃ ekaṃ kāraṇaṃ atthi, tampi te na paṭividdhaṃ na sallakkhitanti dasseti."
    ],
    "innerText": "Etadavocāti appatirūpaṃ mayā kataṃ, bhagavā pana mahantepi aguṇe alaggitvā mayhaṃ accayaṃ paṭiggaṇhissatīti maññamāno etaṃ ‘‘accayo maṃ, bhante,’’tiādivacanaṃ avoca. Tattha accayoti aparādho. Maṃ accagamāti maṃ atikkamma abhibhavitvā pavatto. Paṭiggaṇhātūti khamatu. Āyatiṃ saṃvarāyāti anāgate saṃvaraṇatthāya, puna evarūpassa aparādhassa dosassa khalitassa akaraṇatthāya. Tagghāti ekaṃsena. Samayopi kho te, bhaddālīti, bhaddāli, tayā paṭivijjhitabbayuttakaṃ ekaṃ kāraṇaṃ atthi, tampi te na paṭividdhaṃ na sallakkhitanti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "136"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubhatobhāgavimutto"
      },
      "tiādīsu ",
      " dhammānusārī, saddhānusārīti dve ekacittakkhaṇikā maggasamaṅgipuggalā. Ete pana sattapi ariyapuggale bhagavatāpi evaṃ āṇāpetuṃ na yuttaṃ, bhagavatā āṇatte tesampi evaṃ kātuṃ na yuttaṃ. Aṭṭhānaparikappavasena pana ariyapuggalānaṃ suvacabhāvadassanatthaṃ ",
      " bhaddālittherassa ca dubbacabhāvadassanatthametaṃ vuttaṃ."
    ],
    "innerText": "136.Ubhatobhāgavimuttotiādīsu dhammānusārī, saddhānusārīti dve ekacittakkhaṇikā maggasamaṅgipuggalā. Ete pana sattapi ariyapuggale bhagavatāpi evaṃ āṇāpetuṃ na yuttaṃ, bhagavatā āṇatte tesampi evaṃ kātuṃ na yuttaṃ. Aṭṭhānaparikappavasena pana ariyapuggalānaṃ suvacabhāvadassanatthaṃ bhaddālittherassa ca dubbacabhāvadassanatthametaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Api nu tvaṃ tasmiṃ samaye ubhatobhāgavimutto"
      },
      "ti desanaṃ kasmā ārabhi? Bhaddālissa niggahaṇatthaṃ. Ayañhettha adhippāyo – bhaddāli, ime satta ariyapuggalā loke dakkhiṇeyyā mama sāsane sāmino, mayi sikkhāpadaṃ paññapente paṭibāhitabbayutte kāraṇe sati etesaṃ paṭibāhituṃ yuttaṃ. Tvaṃ pana mama sāsanato bāhirako, mayi sikkhāpadaṃ paññapente tuyhaṃ paṭibāhituṃ na yuttanti."
    ],
    "innerText": "Api nu tvaṃ tasmiṃ samaye ubhatobhāgavimuttoti desanaṃ kasmā ārabhi? Bhaddālissa niggahaṇatthaṃ. Ayañhettha adhippāyo – bhaddāli, ime satta ariyapuggalā loke dakkhiṇeyyā mama sāsane sāmino, mayi sikkhāpadaṃ paññapente paṭibāhitabbayutte kāraṇe sati etesaṃ paṭibāhituṃ yuttaṃ. Tvaṃ pana mama sāsanato bāhirako, mayi sikkhāpadaṃ paññapente tuyhaṃ paṭibāhituṃ na yuttanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ritto tuccho"
      },
      "ti anto ariyaguṇānaṃ abhāvena rittako tucchako, issaravacane kiñci na hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathādhammaṃ paṭikarosī"
      },
      "ti yathā dhammo ṭhito, tatheva karosi, khamāpesīti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ te mayaṃ paṭiggaṇhāmā"
      },
      "ti taṃ tava aparādhaṃ mayaṃ khamāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuḍḍhi hesā, bhaddāli, ariyassa vinaye"
      },
      "ti esā, bhaddāli, ariyassa vinaye buddhassa bhagavato sāsane vuḍḍhi nāma. Katamā? Accayaṃ accayato disvā yathādhammaṃ paṭikaritvā āyatiṃ saṃvarāpajjanā. Desanaṃ pana puggalādhiṭṭhānaṃ karonto ‘‘yo accayaṃ accayato disvā yathādhammaṃ paṭikaroti, āyatiṃ saṃvaraṃ āpajjatī’’ti āha."
    ],
    "innerText": "Ritto tucchoti anto ariyaguṇānaṃ abhāvena rittako tucchako, issaravacane kiñci na hoti. Yathādhammaṃ paṭikarosīti yathā dhammo ṭhito, tatheva karosi, khamāpesīti vuttaṃ hoti. Taṃ te mayaṃ paṭiggaṇhāmāti taṃ tava aparādhaṃ mayaṃ khamāma. Vuḍḍhi hesā, bhaddāli, ariyassa vinayeti esā, bhaddāli, ariyassa vinaye buddhassa bhagavato sāsane vuḍḍhi nāma. Katamā? Accayaṃ accayato disvā yathādhammaṃ paṭikaritvā āyatiṃ saṃvarāpajjanā. Desanaṃ pana puggalādhiṭṭhānaṃ karonto ‘‘yo accayaṃ accayato disvā yathādhammaṃ paṭikaroti, āyatiṃ saṃvaraṃ āpajjatī’’ti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "137"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satthāpi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upavadatī"
      },
      "ti ‘‘asukavihāravāsī asukassa therassa saddhivihāriko asukassa antevāsiko itthannāmo nāma bhikkhu lokuttaradhammaṃ nibbattetuṃ araññaṃ paviṭṭho’’ti sutvā – ‘‘kiṃ tassa araññavāsena, yo mayhaṃ pana sāsane sikkhāya aparipūrakārī’’ti evaṃ upavadati, sesapadesupi eseva nayo, apicettha devatā na kevalaṃ upavadanti, bheravārammaṇaṃ dassetvā palāyanākārampi karonti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attanāpi attāna"
      },
      "nti sīlaṃ āvajjantassa saṃkiliṭṭhaṭṭhānaṃ pākaṭaṃ hoti, cittaṃ vidhāvati, na kammaṭṭhānaṃ allīyati. So ‘‘kiṃ mādisassa araññavāsenā’’ti vippaṭisārī uṭṭhāya pakkamati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attāpi attānaṃ upavadito"
      },
      "ti attanāpi ",
      " attā upavadito, ayameva vā pāṭho. Sukkapakkho vuttapaccanīkanayena veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vivicceva kāmehī"
      },
      "tiādi evaṃ sacchikarotīti dassanatthaṃ vuttaṃ."
    ],
    "innerText": "137.Satthāpiupavadatīti ‘‘asukavihāravāsī asukassa therassa saddhivihāriko asukassa antevāsiko itthannāmo nāma bhikkhu lokuttaradhammaṃ nibbattetuṃ araññaṃ paviṭṭho’’ti sutvā – ‘‘kiṃ tassa araññavāsena, yo mayhaṃ pana sāsane sikkhāya aparipūrakārī’’ti evaṃ upavadati, sesapadesupi eseva nayo, apicettha devatā na kevalaṃ upavadanti, bheravārammaṇaṃ dassetvā palāyanākārampi karonti. Attanāpi attānanti sīlaṃ āvajjantassa saṃkiliṭṭhaṭṭhānaṃ pākaṭaṃ hoti, cittaṃ vidhāvati, na kammaṭṭhānaṃ allīyati. So ‘‘kiṃ mādisassa araññavāsenā’’ti vippaṭisārī uṭṭhāya pakkamati. Attāpi attānaṃ upavaditoti attanāpi attā upavadito, ayameva vā pāṭho. Sukkapakkho vuttapaccanīkanayena veditabbo. Sovivicceva kāmehītiādi evaṃ sacchikarotīti dassanatthaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "140"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pasayha pasayha kāraṇaṃ karontī"
      },
      "ti appamattakepi dose niggahetvā punappunaṃ kārenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "No tathā"
      },
      "ti mahantepi aparādhe yathā itaraṃ, evaṃ pasayha na kārenti. So kira, ‘‘āvuso, bhaddāli, mā cintayittha, evarūpaṃ nāma hoti, ehi satthāraṃ khamāpehī’’ti bhikkhusaṅghatopi, kañci bhikkhuṃ pesetvā attano santikaṃ pakkosāpetvā, ‘‘bhaddāli, mā cintayittha, evarūpaṃ nāma hotī’’ti evaṃ satthusantikāpi anuggahaṃ paccāsīsati. Tato ‘‘bhikkhusaṅghenāpi na samassāsito, satthārāpī’’ti cintetvā evamāha."
    ],
    "innerText": "140.Pasayha pasayha kāraṇaṃ karontīti appamattakepi dose niggahetvā punappunaṃ kārenti. No tathāti mahantepi aparādhe yathā itaraṃ, evaṃ pasayha na kārenti. So kira, ‘‘āvuso, bhaddāli, mā cintayittha, evarūpaṃ nāma hoti, ehi satthāraṃ khamāpehī’’ti bhikkhusaṅghatopi, kañci bhikkhuṃ pesetvā attano santikaṃ pakkosāpetvā, ‘‘bhaddāli, mā cintayittha, evarūpaṃ nāma hotī’’ti evaṃ satthusantikāpi anuggahaṃ paccāsīsati. Tato ‘‘bhikkhusaṅghenāpi na samassāsito, satthārāpī’’ti cintetvā evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha bhagavā bhikkhusaṅghopi satthāpi ovaditabbayuttameva ovadati, na itaranti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "idha, bhaddāli, ekacco"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññenāñña"
      },
      "ntiādīni anumānasutte vitthāritāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na sammā vattatī"
      },
      "ti sammā vattampi na vattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na lomaṃ pātetī"
      },
      "ti anulomavatte na vattati, vilomameva gaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na nitthāraṃ vattatī"
      },
      "ti nitthāraṇakavattamhi na vattati, āpattivuṭṭhānatthaṃ turitaturito chandajāto na hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatrā"
      },
      "ti tasmiṃ tassa dubbacakaraṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhiṇhāpattiko"
      },
      "ti nirantarāpattiko. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āpattibahulo"
      },
      "ti sāpattikakālovassa bahu, suddho nirāpattikakālo appoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na khippameva vūpasammatī"
      },
      "ti khippaṃ na vūpasammati, dīghasuttaṃ hoti. Vinayadharā ",
      " pādadhovanakāle āgataṃ ",
      " ‘‘gacchāvuso, vattavelā’’ti vadanti. Puna kālaṃ maññitvā āgataṃ ‘‘gacchāvuso, tuyhaṃ vihāravelā, gacchāvuso, sāmaṇerādīnaṃ uddesadānavelā, amhākaṃ nhānavelā, therūpaṭṭhānavelā, mukhadhovanavelā’’tiādīni vatvā divasabhāgepi rattibhāgepi āgataṃ uyyojentiyeva. ‘‘Kāya velāya, bhante, okāso bhavissatī’’ti vuttepi ‘‘gacchāvuso, tvaṃ imameva ṭhānaṃ jānāsi, asuko nāma vinayadharatthero sinehapānaṃ pivati, asuko virecanaṃ kāreti, kasmā turitosī’’tiādīni vatvā dīghasuttameva karonti."
    ],
    "innerText": "Atha bhagavā bhikkhusaṅghopi satthāpi ovaditabbayuttameva ovadati, na itaranti dassetuṃ idha, bhaddāli, ekaccotiādimāha. Tattha aññenāññantiādīni anumānasutte vitthāritāni. Na sammā vattatīti sammā vattampi na vattati. Na lomaṃ pātetīti anulomavatte na vattati, vilomameva gaṇhāti. Na nitthāraṃ vattatīti nitthāraṇakavattamhi na vattati, āpattivuṭṭhānatthaṃ turitaturito chandajāto na hoti. Tatrāti tasmiṃ tassa dubbacakaraṇe. Abhiṇhāpattikoti nirantarāpattiko. Āpattibahuloti sāpattikakālovassa bahu, suddho nirāpattikakālo appoti attho. Na khippameva vūpasammatīti khippaṃ na vūpasammati, dīghasuttaṃ hoti. Vinayadharā pādadhovanakāle āgataṃ ‘‘gacchāvuso, vattavelā’’ti vadanti. Puna kālaṃ maññitvā āgataṃ ‘‘gacchāvuso, tuyhaṃ vihāravelā, gacchāvuso, sāmaṇerādīnaṃ uddesadānavelā, amhākaṃ nhānavelā, therūpaṭṭhānavelā, mukhadhovanavelā’’tiādīni vatvā divasabhāgepi rattibhāgepi āgataṃ uyyojentiyeva. ‘‘Kāya velāya, bhante, okāso bhavissatī’’ti vuttepi ‘‘gacchāvuso, tvaṃ imameva ṭhānaṃ jānāsi, asuko nāma vinayadharatthero sinehapānaṃ pivati, asuko virecanaṃ kāreti, kasmā turitosī’’tiādīni vatvā dīghasuttameva karonti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "141"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khippameva vūpasammatī"
      },
      "ti lahuṃ vūpasammati, na dīghasuttaṃ hoti. Ussukkāpannā bhikkhū – ‘‘āvuso, ayaṃ subbaco bhikkhu, janapadavāsino nāma gāmantasenāsane vasanaṭṭhānanisajjanādīni ",
      " na phāsukāni honti, bhikkhācāropi dukkho hoti, sīghamassa adhikaraṇaṃ vūpasamemā’’ti sannipatitvā āpattito vuṭṭhāpetvā suddhante patiṭṭhāpenti."
    ],
    "innerText": "141.Khippameva vūpasammatīti lahuṃ vūpasammati, na dīghasuttaṃ hoti. Ussukkāpannā bhikkhū – ‘‘āvuso, ayaṃ subbaco bhikkhu, janapadavāsino nāma gāmantasenāsane vasanaṭṭhānanisajjanādīni na phāsukāni honti, bhikkhācāropi dukkho hoti, sīghamassa adhikaraṇaṃ vūpasamemā’’ti sannipatitvā āpattito vuṭṭhāpetvā suddhante patiṭṭhāpenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "142"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhiccāpattiko"
      },
      "ti kadāci kadāci āpattiṃ āpajjati. So kiñcāpi lajjī hoti pakatatto, dubbacattā panassa bhikkhū tatheva paṭipajjanti."
    ],
    "innerText": "142.Adhiccāpattikoti kadāci kadāci āpattiṃ āpajjati. So kiñcāpi lajjī hoti pakatatto, dubbacattā panassa bhikkhū tatheva paṭipajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "144"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhāmattakena vahati pemamattakenā"
      },
      "ti ācariyupajjhāyesu appamattikāya gehassitasaddhāya appamattakena gehassitapemena yāpeti. Paṭisandhiggahaṇasadisā hi ayaṃ pabbajjā nāma, navapabbajito pabbajjāya guṇaṃ ajānanto ācariyupajjhāyesu pemamattena yāpeti, tasmā evarūpā saṅgaṇhitabbā. Appamattakampi hi saṅgahaṃ labhitvā pabbajjāya ṭhitā abhiññāpattā mahāsamaṇā bhavissanti. Ettakena kathāmaggena ‘‘ovaditabbayuttakaṃ ovadanti, na itara’’nti imameva bhagavatā dassitaṃ."
    ],
    "innerText": "144.Saddhāmattakena vahati pemamattakenāti ācariyupajjhāyesu appamattikāya gehassitasaddhāya appamattakena gehassitapemena yāpeti. Paṭisandhiggahaṇasadisā hi ayaṃ pabbajjā nāma, navapabbajito pabbajjāya guṇaṃ ajānanto ācariyupajjhāyesu pemamattena yāpeti, tasmā evarūpā saṅgaṇhitabbā. Appamattakampi hi saṅgahaṃ labhitvā pabbajjāya ṭhitā abhiññāpattā mahāsamaṇā bhavissanti. Ettakena kathāmaggena ‘‘ovaditabbayuttakaṃ ovadanti, na itara’’nti imameva bhagavatā dassitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "145"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññāya"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṇṭhahiṃsū"
      },
      "ti arahatte patiṭṭhahiṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattesu hāyamānesū"
      },
      "ti paṭipattiyā hāyamānāya sattā hāyanti nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhamme antaradhāyamāne"
      },
      "ti paṭipattisaddhamme antaradhāyamāne. Paṭipattisaddhammopi hi paṭipattipūrakesu sattesu asati antaradhāyati nāma ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsavaṭṭhānīyā"
      },
      "ti āsavā tiṭṭhanti etesūti āsavaṭṭhānīyā. Yesu diṭṭhadhammikasamparāyikā parūpavādavippaṭisāravadhabandhanādayo ceva apāyadukkhavisesabhūtā ca āsavā tiṭṭhantiyeva. Yasmā nesaṃ te kāraṇaṃ hontīti attho. Te āsavaṭṭhānīyā vītikkamadhammā yāva na saṅghe pātubhavanti, na tāva satthā sāvakānaṃ sikkhāpadaṃ paññapetīti ayamettha yojanā."
    ],
    "innerText": "145.Aññāyasaṇṭhahiṃsūti arahatte patiṭṭhahiṃsu. Sattesu hāyamānesūti paṭipattiyā hāyamānāya sattā hāyanti nāma. Saddhamme antaradhāyamāneti paṭipattisaddhamme antaradhāyamāne. Paṭipattisaddhammopi hi paṭipattipūrakesu sattesu asati antaradhāyati nāma . Āsavaṭṭhānīyāti āsavā tiṭṭhanti etesūti āsavaṭṭhānīyā. Yesu diṭṭhadhammikasamparāyikā parūpavādavippaṭisāravadhabandhanādayo ceva apāyadukkhavisesabhūtā ca āsavā tiṭṭhantiyeva. Yasmā nesaṃ te kāraṇaṃ hontīti attho. Te āsavaṭṭhānīyā vītikkamadhammā yāva na saṅghe pātubhavanti, na tāva satthā sāvakānaṃ sikkhāpadaṃ paññapetīti ayamettha yojanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ akālaṃ dassetvā puna kālaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yato ca kho, bhaddālī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yato"
      },
      "ti yadā, yasmiṃ kāleti vuttaṃ hoti. Sesaṃ vuttānusāreneva veditabbaṃ. Ayaṃ vā ettha saṅkhepattho – yasmiṃ kāle āsavaṭṭhānīyā dhammāti saṅkhaṃ gatā vītikkamadosā saṅghe pātubhavanti, tadā satthā sāvakānaṃ sikkhāpadaṃ paññapeti. Kasmā? Tesaṃyeva āsavaṭṭhānīyadhammasaṅkhātānaṃ vītikkamadosānaṃ paṭighātāya."
    ],
    "innerText": "Evaṃ akālaṃ dassetvā puna kālaṃ dassetuṃ yato ca kho, bhaddālītiādimāha. Tattha yatoti yadā, yasmiṃ kāleti vuttaṃ hoti. Sesaṃ vuttānusāreneva veditabbaṃ. Ayaṃ vā ettha saṅkhepattho – yasmiṃ kāle āsavaṭṭhānīyā dhammāti saṅkhaṃ gatā vītikkamadosā saṅghe pātubhavanti, tadā satthā sāvakānaṃ sikkhāpadaṃ paññapeti. Kasmā? Tesaṃyeva āsavaṭṭhānīyadhammasaṅkhātānaṃ vītikkamadosānaṃ paṭighātāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " āsavaṭṭhānīyānaṃ dhammānaṃ anuppattiṃ sikkhāpadapaññattiyā akālaṃ, uppattiñca kālanti vatvā idāni tesaṃ dhammānaṃ anuppattikālañca uppattikālañca dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na tāva, bhaddāli, idhekacce’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahatta"
      },
      "nti mahantabhāvaṃ. Saṅgho hi yāva na theranavamajjhimānaṃ vasena mahattaṃ patto hoti, tāva senāsanāni pahonti, sāsane ekacce āsavaṭṭhānīyā dhammā ",
      " na uppajjanti. Mahattaṃ patte pana te uppajjanti, atha satthā sikkhāpadaṃ paññapeti. Tattha mahattaṃ patte saṅghe paññattasikkhāpadāni –"
    ],
    "innerText": "Evaṃ āsavaṭṭhānīyānaṃ dhammānaṃ anuppattiṃ sikkhāpadapaññattiyā akālaṃ, uppattiñca kālanti vatvā idāni tesaṃ dhammānaṃ anuppattikālañca uppattikālañca dassetuṃ ‘‘na tāva, bhaddāli, idhekacce’’tiādimāha. Tattha mahattanti mahantabhāvaṃ. Saṅgho hi yāva na theranavamajjhimānaṃ vasena mahattaṃ patto hoti, tāva senāsanāni pahonti, sāsane ekacce āsavaṭṭhānīyā dhammā na uppajjanti. Mahattaṃ patte pana te uppajjanti, atha satthā sikkhāpadaṃ paññapeti. Tattha mahattaṃ patte saṅghe paññattasikkhāpadāni –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yo pana bhikkhu anupasampannena uttaridvirattatirattaṃ sahaseyyaṃ kappeyya pācittiyaṃ (pāci. 51). Yā pana bhikkhunī anuvassaṃ vuṭṭhāpeyya pācittiyaṃ (pāci. 1171). Yā pana bhikkhunī ekavassaṃ dve vuṭṭhāpeyya pācittiya’’nti (pāci. 1175)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iminā nayena veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lābhagga"
      },
      "nti lābhassa aggaṃ. Saṅgho hi yāva na lābhaggapatto hoti, na tāva lābhaṃ paṭicca āsavaṭṭhānīyā dhammā uppajjanti. Patte pana uppajjanti, atha satthā sikkhāpadaṃ paññapeti –"
    ],
    "innerText": "Lābhagganti lābhassa aggaṃ. Saṅgho hi yāva na lābhaggapatto hoti, na tāva lābhaṃ paṭicca āsavaṭṭhānīyā dhammā uppajjanti. Patte pana uppajjanti, atha satthā sikkhāpadaṃ paññapeti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo ",
      " pana bhikkhu acelakassa vā paribbājakassa vā paribbājikāya vā sahatthā khādanīyaṃ vā bhojanīyaṃ vā dadeyya pācittiya’’nti (pāci. 270)."
    ],
    "innerText": "‘‘Yo pana bhikkhu acelakassa vā paribbājakassa vā paribbājikāya vā sahatthā khādanīyaṃ vā bhojanīyaṃ vā dadeyya pācittiya’’nti (pāci. 270)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idañhi lābhaggapatte saṅghe sikkhāpadaṃ paññattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yasagga"
      },
      "nti yasassa aggaṃ. Saṅgho hi yāva na yasaggapatto hoti, na tāva yasaṃ paṭicca āsavaṭṭhānīyā dhammā uppajjanti. Patte pana uppajjanti, atha satthā sikkhāpadaṃ paññapeti ‘‘surāmerayapāne pācittiya’’nti (pāci. 327). Idañhi yasaggapatte saṅghe sikkhāpadaṃ paññattaṃ."
    ],
    "innerText": "Yasagganti yasassa aggaṃ. Saṅgho hi yāva na yasaggapatto hoti, na tāva yasaṃ paṭicca āsavaṭṭhānīyā dhammā uppajjanti. Patte pana uppajjanti, atha satthā sikkhāpadaṃ paññapeti ‘‘surāmerayapāne pācittiya’’nti (pāci. 327). Idañhi yasaggapatte saṅghe sikkhāpadaṃ paññattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bāhusacca"
      },
      "nti ",
      " bahussutabhāvaṃ. Saṅgho hi yāva na bāhusaccapatto hoti, na tāva āsavaṭṭhānīyā dhammā uppajjanti. Bāhusaccapatte pana yasmā ekaṃ nikāyaṃ dve nikāye pañcapi nikāye uggahetvā ayoniso ummujjamānā ",
      " puggalā rasena rasaṃ saṃsandetvā uddhammaṃ ubbinayaṃ satthu sāsanaṃ dīpenti, atha satthā – ‘‘yo pana bhikkhu evaṃ vadeyya tathāhaṃ bhagavatā dhammaṃ desitaṃ ājānāmi (pāci. 418)…pe… samaṇuddesopi ce evaṃ vadeyyā’’tiādinā (pāci. 429) nayena sikkhāpadaṃ paññapeti."
    ],
    "innerText": "Bāhusaccanti bahussutabhāvaṃ. Saṅgho hi yāva na bāhusaccapatto hoti, na tāva āsavaṭṭhānīyā dhammā uppajjanti. Bāhusaccapatte pana yasmā ekaṃ nikāyaṃ dve nikāye pañcapi nikāye uggahetvā ayoniso ummujjamānā puggalā rasena rasaṃ saṃsandetvā uddhammaṃ ubbinayaṃ satthu sāsanaṃ dīpenti, atha satthā – ‘‘yo pana bhikkhu evaṃ vadeyya tathāhaṃ bhagavatā dhammaṃ desitaṃ ājānāmi (pāci. 418)…pe… samaṇuddesopi ce evaṃ vadeyyā’’tiādinā (pāci. 429) nayena sikkhāpadaṃ paññapeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rattaññutaṃ patto"
      },
      "ti ettha rattiyo jānantīti rattaññū. Attano pabbajitadivasato paṭṭhāya bahū rattiyo jānanti, cirapabbajitāti vuttaṃ hoti. Rattaññūnaṃ bhāvaṃ rattaññutaṃ. Tatra rattaññutaṃ patte saṅghe upasenaṃ vaṅgantaputtaṃ ārabbha sikkhāpadaṃ paññattanti veditabbaṃ. So hāyasmā ūnadasavasse bhikkhū upasampādente disvā ekavasso saddhivihārikaṃ upasampādesi. Atha bhagavā sikkhāpadaṃ paññapesi – ‘‘na, bhikkhave, ūnadasavassena upasampādetabbo, yo upasampādeyya āpatti dukkaṭassā’’ti (mahāva. 75). Evaṃ paññatte sikkhāpade puna bhikkhū ‘‘dasavassamhā dasavassamhā’’ti bālā abyattā upasampādenti. Atha bhagavā aparampi sikkhāpadaṃ paññapesi – ‘‘na, bhikkhave, bālena abyattena upasampādetabbo, yo upasampādeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, byattena bhikkhunā paṭibalena dasavassena vā atirekadasavassena vā upasampādetu’’nti. Iti rattaññutaṃ pattakāle dve sikkhāpadāni paññattāni."
    ],
    "innerText": "Rattaññutaṃ pattoti ettha rattiyo jānantīti rattaññū. Attano pabbajitadivasato paṭṭhāya bahū rattiyo jānanti, cirapabbajitāti vuttaṃ hoti. Rattaññūnaṃ bhāvaṃ rattaññutaṃ. Tatra rattaññutaṃ patte saṅghe upasenaṃ vaṅgantaputtaṃ ārabbha sikkhāpadaṃ paññattanti veditabbaṃ. So hāyasmā ūnadasavasse bhikkhū upasampādente disvā ekavasso saddhivihārikaṃ upasampādesi. Atha bhagavā sikkhāpadaṃ paññapesi – ‘‘na, bhikkhave, ūnadasavassena upasampādetabbo, yo upasampādeyya āpatti dukkaṭassā’’ti (mahāva. 75). Evaṃ paññatte sikkhāpade puna bhikkhū ‘‘dasavassamhā dasavassamhā’’ti bālā abyattā upasampādenti. Atha bhagavā aparampi sikkhāpadaṃ paññapesi – ‘‘na, bhikkhave, bālena abyattena upasampādetabbo, yo upasampādeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, byattena bhikkhunā paṭibalena dasavassena vā atirekadasavassena vā upasampādetu’’nti. Iti rattaññutaṃ pattakāle dve sikkhāpadāni paññattāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "146"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ājānīyasusūpamaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammapariyāyaṃ desesi"
      },
      "nti taruṇājānīyaupamaṃ katvā dhammaṃ desayiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatrā"
      },
      "ti tasmiṃ asaraṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na kho, bhaddāli, eseva hetū"
      },
      "ti na esa sikkhāya aparipūrakārībhāvoyeva eko hetu."
    ],
    "innerText": "146.Ājānīyasusūpamaṃdhammapariyāyaṃ desesinti taruṇājānīyaupamaṃ katvā dhammaṃ desayiṃ. Tatrāti tasmiṃ asaraṇe. Na kho, bhaddāli, eseva hetūti na esa sikkhāya aparipūrakārībhāvoyeva eko hetu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "147"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mukhādhāne kāraṇaṃ kāretī"
      },
      "ti khalīnabandhādīhi mukhaṭṭhapane sādhukaṃ gīvaṃ paggaṇhāpetuṃ kāraṇaṃ kāreti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visūkāyitānī"
      },
      "tiādīhi visevanācāraṃ kathesi. Sabbāneva hetāni aññamaññavevacanāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmiṃ ṭhāne"
      },
      "ti tasmiṃ visevanācāre. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parinibbāyatī"
      },
      "ti nibbisevano hoti, taṃ visevanaṃ jahatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yugādhāne"
      },
      "ti yugaṭṭhapane yugassa sādhukaṃ gahaṇatthaṃ."
    ],
    "innerText": "147.Mukhādhāne kāraṇaṃ kāretīti khalīnabandhādīhi mukhaṭṭhapane sādhukaṃ gīvaṃ paggaṇhāpetuṃ kāraṇaṃ kāreti. Visūkāyitānītiādīhi visevanācāraṃ kathesi. Sabbāneva hetāni aññamaññavevacanāni. Tasmiṃ ṭhāneti tasmiṃ visevanācāre. Parinibbāyatīti nibbisevano hoti, taṃ visevanaṃ jahatīti attho. Yugādhāneti yugaṭṭhapane yugassa sādhukaṃ gahaṇatthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anukkame"
      },
      "ti ",
      " cattāropi pāde ekappahāreneva ukkhipane ca nikkhipane ca. Parasenāya hi āvāṭe ṭhatvā asiṃ gahetvā āgacchantassa assassa pāde chindanti. Tasmiṃ samaye esa ekappahāreneva cattāropi pāde ukkhipissatīti rajjubandhanavidhānena etaṃ kāraṇaṃ karonti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maṇḍale"
      },
      "ti yathā asse nisinnoyeva bhūmiyaṃ patitaṃ āvudhaṃ gahetuṃ sakkoti, evaṃ karaṇatthaṃ maṇḍale kāraṇaṃ kāreti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khurakāse"
      },
      "ti ",
      " aggaggakhurehi pathavīkamane. Rattiṃ okkantakaraṇasmiñhi yathā padasaddo na suyyati, tadatthaṃ ekasmiṃ ṭhāne saññaṃ datvā aggaggakhurehiyeva gamanaṃ sikkhāpenti. Taṃ sandhāyetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jave"
      },
      "ti sīghavāhane. ‘‘Dhāve’’tipi pāṭho. Attano parājaye sati palāyanatthaṃ, paraṃ palāyantaṃ anubandhitvā gahaṇatthañca etaṃ kāraṇaṃ kāreti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Davatte"
      },
      "ti davattāya, yuddhakālasmiñhi hatthīsu vā koñcanādaṃ karontesu assesu vā hasantesu rathesu vā nighosantesu yodhesu vā ukkuṭṭhiṃ karontesu tassa ravassa abhāyitvā parasenapavesanatthaṃ ayaṃ kāraṇā karīyati."
    ],
    "innerText": "Anukkameti cattāropi pāde ekappahāreneva ukkhipane ca nikkhipane ca. Parasenāya hi āvāṭe ṭhatvā asiṃ gahetvā āgacchantassa assassa pāde chindanti. Tasmiṃ samaye esa ekappahāreneva cattāropi pāde ukkhipissatīti rajjubandhanavidhānena etaṃ kāraṇaṃ karonti. Maṇḍaleti yathā asse nisinnoyeva bhūmiyaṃ patitaṃ āvudhaṃ gahetuṃ sakkoti, evaṃ karaṇatthaṃ maṇḍale kāraṇaṃ kāreti. Khurakāseti aggaggakhurehi pathavīkamane. Rattiṃ okkantakaraṇasmiñhi yathā padasaddo na suyyati, tadatthaṃ ekasmiṃ ṭhāne saññaṃ datvā aggaggakhurehiyeva gamanaṃ sikkhāpenti. Taṃ sandhāyetaṃ vuttaṃ. Javeti sīghavāhane. ‘‘Dhāve’’tipi pāṭho. Attano parājaye sati palāyanatthaṃ, paraṃ palāyantaṃ anubandhitvā gahaṇatthañca etaṃ kāraṇaṃ kāreti. Davatteti davattāya, yuddhakālasmiñhi hatthīsu vā koñcanādaṃ karontesu assesu vā hasantesu rathesu vā nighosantesu yodhesu vā ukkuṭṭhiṃ karontesu tassa ravassa abhāyitvā parasenapavesanatthaṃ ayaṃ kāraṇā karīyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājaguṇe"
      },
      "ti raññā jānitabbaguṇe. Kūṭakaṇṇarañño kira guḷavaṇṇo nāma asso ahosi. Rājā pācīnadvārena nikkhamitvā cetiyapabbataṃ gamissāmīti ",
      " kalambanadītīraṃ sampatto. Asso tīre ṭhatvā udakaṃ otarituṃ na icchati, rājā assācariyaṃ āmantetvā – ‘‘aho tayā asso sikkhāpito udakaṃ otarituṃ na icchatī’’ti āha. Ācariyo – ‘‘susikkhāpito deva asso, evamassa hi cittaṃ ‘sacāhaṃ udakaṃ otarissāmi, vālaṃ temissati, vāle tinte rañño aṅge udakaṃ pāteyyā’ti evaṃ tumhākaṃ sarīre udakapātanabhayena na otarati, vālaṃ gaṇhāpethā’’ti ",
      " āha. Rājā tathā kāresi. Asso vegena otaritvā pāraṃ gato. Etadatthaṃ ayaṃ kāraṇā karīyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājavaṃse"
      },
      "ti assarājavaṃse. Vaṃso ceso assarājānaṃ, tathārūpena pahārena chinnabhinnasarīrāpi assārohaṃ parasenāya apātetvā bahi nīharantiyeva. Etadatthaṃ kāraṇaṃ kāretīti attho."
    ],
    "innerText": "Rājaguṇeti raññā jānitabbaguṇe. Kūṭakaṇṇarañño kira guḷavaṇṇo nāma asso ahosi. Rājā pācīnadvārena nikkhamitvā cetiyapabbataṃ gamissāmīti kalambanadītīraṃ sampatto. Asso tīre ṭhatvā udakaṃ otarituṃ na icchati, rājā assācariyaṃ āmantetvā – ‘‘aho tayā asso sikkhāpito udakaṃ otarituṃ na icchatī’’ti āha. Ācariyo – ‘‘susikkhāpito deva asso, evamassa hi cittaṃ ‘sacāhaṃ udakaṃ otarissāmi, vālaṃ temissati, vāle tinte rañño aṅge udakaṃ pāteyyā’ti evaṃ tumhākaṃ sarīre udakapātanabhayena na otarati, vālaṃ gaṇhāpethā’’ti āha. Rājā tathā kāresi. Asso vegena otaritvā pāraṃ gato. Etadatthaṃ ayaṃ kāraṇā karīyati. Rājavaṃseti assarājavaṃse. Vaṃso ceso assarājānaṃ, tathārūpena pahārena chinnabhinnasarīrāpi assārohaṃ parasenāya apātetvā bahi nīharantiyeva. Etadatthaṃ kāraṇaṃ kāretīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttame jave"
      },
      "ti javasampattiyaṃ, yathā uttamajavo hoti, evaṃ kāraṇaṃ kāretīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttame haye"
      },
      "ti uttamahayabhāve, yathā uttamahayo hoti, evaṃ kāraṇaṃ kāretīti attho. Tattha pakatiyā uttamahayova uttamahayakāraṇaṃ arahati, na añño. Uttamahayakāraṇāya eva ca hayo uttamajavaṃ paṭipajjati, na aññoti."
    ],
    "innerText": "Uttame javeti javasampattiyaṃ, yathā uttamajavo hoti, evaṃ kāraṇaṃ kāretīti attho. Uttame hayeti uttamahayabhāve, yathā uttamahayo hoti, evaṃ kāraṇaṃ kāretīti attho. Tattha pakatiyā uttamahayova uttamahayakāraṇaṃ arahati, na añño. Uttamahayakāraṇāya eva ca hayo uttamajavaṃ paṭipajjati, na aññoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatridaṃ ",
      " vatthu – eko kira rājā ekaṃ sindhavapotakaṃ labhitvā sindhavabhāvaṃ ajānitvāva imaṃ sikkhāpehīti ācariyassa adāsi. Ācariyopi tassa sindhavabhāvaṃ ajānanto taṃ māsakhādakaghoṭakānaṃ kāraṇāsu upaneti. So attano ananucchavikattā kāraṇaṃ na paṭipajjati. So taṃ dametuṃ asakkonto ‘‘kūṭasso ayaṃ mahārājā’’ti vissajjāpesi."
    ],
    "innerText": "Tatridaṃ vatthu – eko kira rājā ekaṃ sindhavapotakaṃ labhitvā sindhavabhāvaṃ ajānitvāva imaṃ sikkhāpehīti ācariyassa adāsi. Ācariyopi tassa sindhavabhāvaṃ ajānanto taṃ māsakhādakaghoṭakānaṃ kāraṇāsu upaneti. So attano ananucchavikattā kāraṇaṃ na paṭipajjati. So taṃ dametuṃ asakkonto ‘‘kūṭasso ayaṃ mahārājā’’ti vissajjāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athekadivasaṃ eko assācariyapubbako daharo upajjhāyassa bhaṇḍakaṃ gahetvā gacchanto taṃ parikhāpiṭṭhe carantaṃ disvā – ‘‘anaggho, bhante, sindhavapotako’’ti upajjhāyassa kathesi. Sace rājā jāneyya, maṅgalassaṃ naṃ kareyyāti. Thero āha – ‘‘micchādiṭṭhiko, tāta, rājā appeva nāma buddhasāsane pasīdeyya rañño kathehī’’ti. So gantvā, – ‘‘mahārāja, anaggho sindhavapotako atthī’’ti ",
      " kathesi. Tayā diṭṭho ",
      ", tātāti? Āma, mahārājāti. Kiṃ laddhuṃ vaṭṭatīti? Tumhākaṃ bhuñjanakasuvaṇṇathāle tumhākaṃ bhuñjanakabhattaṃ tumhākaṃ pivanakaraso tumhākaṃ gandhā tumhākaṃ mālāti. Rājā sabbaṃ dāpesi. Daharo gāhāpetvā agamāsi."
    ],
    "innerText": "Athekadivasaṃ eko assācariyapubbako daharo upajjhāyassa bhaṇḍakaṃ gahetvā gacchanto taṃ parikhāpiṭṭhe carantaṃ disvā – ‘‘anaggho, bhante, sindhavapotako’’ti upajjhāyassa kathesi. Sace rājā jāneyya, maṅgalassaṃ naṃ kareyyāti. Thero āha – ‘‘micchādiṭṭhiko, tāta, rājā appeva nāma buddhasāsane pasīdeyya rañño kathehī’’ti. So gantvā, – ‘‘mahārāja, anaggho sindhavapotako atthī’’ti kathesi. Tayā diṭṭho , tātāti? Āma, mahārājāti. Kiṃ laddhuṃ vaṭṭatīti? Tumhākaṃ bhuñjanakasuvaṇṇathāle tumhākaṃ bhuñjanakabhattaṃ tumhākaṃ pivanakaraso tumhākaṃ gandhā tumhākaṃ mālāti. Rājā sabbaṃ dāpesi. Daharo gāhāpetvā agamāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Asso gandhaṃ ghāyitvāva ‘‘mayhaṃ guṇajānanakaācariyo atthi maññe’’ti sīsaṃ ukkhipitvā olokento aṭṭhāsi. Daharo gantvā ‘‘bhattaṃ bhuñjā’’ti accharaṃ pahari. Asso āgantvā suvaṇṇathāle bhattaṃ bhuñji, rasaṃ pivi. Atha naṃ gandhehi vilimpitvā rājapiḷandhanaṃ piḷandhitvā ‘‘purato purato gacchā’’ti accharaṃ pahari. So daharassa purato purato gantvā maṅgalassaṭṭhāne aṭṭhāsi. Daharo – ‘‘ayaṃ te, mahārāja, anaggho sindhavapotako, imināva naṃ niyāmena katipāhaṃ paṭijaggāpehī’’ti vatvā nikkhami."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha katipāhassa accayena āgantvā assassa ānubhāvaṃ passissasi, mahārājāti. Sādhu ācariya kuhiṃ ṭhatvā passāmāti? Uyyānaṃ gaccha, mahārājāti. Rājā assaṃ gāhāpetvā agamāsi. Daharo accharaṃ paharitvā ‘‘etaṃ rukkhaṃ anupariyāhī’’ti assassa saññaṃ adāsi. Asso pakkhanditvā rukkhaṃ anuparigantvā āgato. Rājā neva gacchantaṃ na āgacchantaṃ addasa. Diṭṭho te, mahārājāti? Na diṭṭho, tātāti. Valañjakadaṇḍaṃ etaṃ rukkhaṃ nissāya ṭhapethāti vatvā accharaṃ pahari ‘‘valañjakadaṇḍaṃ gahetvā ehī’’ti. Asso pakkhanditvā mukhena gahetvā āgato. Diṭṭhaṃ, mahārājāti. Diṭṭhaṃ, tātāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna ",
      " accharaṃ pahari ‘‘uyyānassa pākāramatthakena caritvā ehī’’ti. Asso tathā akāsi. Diṭṭho, mahārājāti. Na diṭṭho, tātāti. Rattakambalaṃ āharāpetvā assassa pāde bandhāpetvā tatheva saññaṃ adāsi. Asso ullaṅghitvā pākāramatthakena anupariyāyi. Balavatā purisena āviñchanaalātaggisikhā ",
      " viya uyyānapākāramatthake paññāyittha. Asso gantvā samīpe ṭhito. Diṭṭhaṃ, mahārājāti. Diṭṭhaṃ, tātāti. Maṅgalapokkharaṇipākāramatthake anupariyāhīti saññaṃ adāsi."
    ],
    "innerText": "Puna accharaṃ pahari ‘‘uyyānassa pākāramatthakena caritvā ehī’’ti. Asso tathā akāsi. Diṭṭho, mahārājāti. Na diṭṭho, tātāti. Rattakambalaṃ āharāpetvā assassa pāde bandhāpetvā tatheva saññaṃ adāsi. Asso ullaṅghitvā pākāramatthakena anupariyāyi. Balavatā purisena āviñchanaalātaggisikhā viya uyyānapākāramatthake paññāyittha. Asso gantvā samīpe ṭhito. Diṭṭhaṃ, mahārājāti. Diṭṭhaṃ, tātāti. Maṅgalapokkharaṇipākāramatthake anupariyāhīti saññaṃ adāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna ‘‘pokkharaṇiṃ otaritvā padumapattesu cārikaṃ carāhī’’ti saññaṃ adāsi. Pokkharaṇiṃ otaritvā sabbapadumapatte caritvā agamāsi, ekaṃ pattampi ",
      " anakkantaṃ vā phālitaṃ vā chinditaṃ vā khaṇḍitaṃ vā nāhosi. Diṭṭhaṃ, mahārājāti. Diṭṭhaṃ, tātāti. Accharaṃ paharitvā taṃ hatthatalaṃ upanāmesi. Dhātūpatthaddho laṅghitvā hatthatale aṭṭhāsi. Diṭṭhaṃ, mahārājāti? Diṭṭhaṃ, tātāti. Evaṃ uttamahayo eva uttamakāraṇāya uttamajavaṃ paṭipajjati."
    ],
    "innerText": "Puna ‘‘pokkharaṇiṃ otaritvā padumapattesu cārikaṃ carāhī’’ti saññaṃ adāsi. Pokkharaṇiṃ otaritvā sabbapadumapatte caritvā agamāsi, ekaṃ pattampi anakkantaṃ vā phālitaṃ vā chinditaṃ vā khaṇḍitaṃ vā nāhosi. Diṭṭhaṃ, mahārājāti. Diṭṭhaṃ, tātāti. Accharaṃ paharitvā taṃ hatthatalaṃ upanāmesi. Dhātūpatthaddho laṅghitvā hatthatale aṭṭhāsi. Diṭṭhaṃ, mahārājāti? Diṭṭhaṃ, tātāti. Evaṃ uttamahayo eva uttamakāraṇāya uttamajavaṃ paṭipajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttame sākhalye"
      },
      "ti muduvācāya. Muduvācāya hi, ‘‘tāta, tvaṃ mā cintayi, rañño maṅgalasso bhavissasi, rājabhojanādīni labhissasī’’ti uttamahayakāraṇaṃ kāretabbo. Tena vuttaṃ ‘‘uttame sākhalye’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājabhoggo"
      },
      "ti rañño upabhogo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rañño aṅganteva saṅkhaṃ gacchatī"
      },
      "ti yattha katthaci gacchantena hatthaṃ viya pādaṃ viya anohāyeva gantabbaṃ hoti. Tasmā aṅganti saṅkhaṃ gacchati, catūsu vā senaṅgesu ekaṃ aṅgaṃ hoti."
    ],
    "innerText": "Uttame sākhalyeti muduvācāya. Muduvācāya hi, ‘‘tāta, tvaṃ mā cintayi, rañño maṅgalasso bhavissasi, rājabhojanādīni labhissasī’’ti uttamahayakāraṇaṃ kāretabbo. Tena vuttaṃ ‘‘uttame sākhalye’’ti. Rājabhoggoti rañño upabhogo. Rañño aṅganteva saṅkhaṃ gacchatīti yattha katthaci gacchantena hatthaṃ viya pādaṃ viya anohāyeva gantabbaṃ hoti. Tasmā aṅganti saṅkhaṃ gacchati, catūsu vā senaṅgesu ekaṃ aṅgaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asekhāya sammādiṭṭhiyā"
      },
      "ti arahattaphalasammādiṭṭhiyā. Sammāsaṅkappādayopi taṃsampayuttāva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammāñāṇaṃ"
      },
      " pubbe vuttasammādiṭṭhiyeva. Ṭhapetvā pana aṭṭha ",
      " phalaṅgāni sesā dhammā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimuttī"
      },
      "ti veditabbā. Sesaṃ sabbattha uttānameva. Ayaṃ pana desanā ugghaṭitaññūpuggalassa vasena arahattanikūṭaṃ gahetvā niṭṭhāpitāti."
    ],
    "innerText": "Asekhāya sammādiṭṭhiyāti arahattaphalasammādiṭṭhiyā. Sammāsaṅkappādayopi taṃsampayuttāva. Sammāñāṇaṃ pubbe vuttasammādiṭṭhiyeva. Ṭhapetvā pana aṭṭha phalaṅgāni sesā dhammā vimuttīti veditabbā. Sesaṃ sabbattha uttānameva. Ayaṃ pana desanā ugghaṭitaññūpuggalassa vasena arahattanikūṭaṃ gahetvā niṭṭhāpitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhaddālisuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Laṭukikopamasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "148"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti laṭukikopamasuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yena so vanasaṇḍo"
      },
      "ti ayampi mahāudāyitthero bhagavatā saddhiṃyeva piṇḍāya pavisitvā saddhiṃ paṭikkami. Tasmā yena so bhagavatā upasaṅkamanto vanasaṇḍo tenupasaṅkamīti veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apahattā"
      },
      "ti apahārako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upahattā"
      },
      "ti upahārako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisallānā vuṭṭhito"
      },
      "ti phalasamāpattito vuṭṭhito."
    ],
    "innerText": "148.Evaṃme sutanti laṭukikopamasuttaṃ. Tattha yena so vanasaṇḍoti ayampi mahāudāyitthero bhagavatā saddhiṃyeva piṇḍāya pavisitvā saddhiṃ paṭikkami. Tasmā yena so bhagavatā upasaṅkamanto vanasaṇḍo tenupasaṅkamīti veditabbo. Apahattāti apahārako. Upahattāti upahārako. Paṭisallānā vuṭṭhitoti phalasamāpattito vuṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "149"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhagavā"
      },
      "ti yasmiṃ samaye bhagavā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iṅghā"
      },
      "ti āṇattiyaṃ nipāto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññathatta"
      },
      "nti cittassa aññathattaṃ. Tañca kho na bhagavantaṃ paṭicca, evarūpaṃ pana paṇītabhojanaṃ alabhantā kathaṃ yāpessāmāti evaṃ paṇītabhojanaṃ paṭicca ahosīti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūtapubba"
      },
      "nti iminā rattibhojanassa paṇītabhāvaṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sūpeyya"
      },
      "nti ",
      " sūpena upanetabbaṃ macchamaṃsakaḷīrādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaggā bhuñjissāmā"
      },
      "ti ekato bhuñjissāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhatiyo"
      },
      "ti abhisaṅkhārikakhādanīyāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbā tā ratti"
      },
      "nti sabbā tā saṅkhatiyo rattiṃyeva honti, divā pana appā parittā thokikā hontīti. Manussā hi divā yāgukañjiyādīhi yāpetvāpi rattiṃ yathāsatti yathāpaṇītameva bhuñjanti."
    ],
    "innerText": "149.Yaṃbhagavāti yasmiṃ samaye bhagavā. Iṅghāti āṇattiyaṃ nipāto. Aññathattanti cittassa aññathattaṃ. Tañca kho na bhagavantaṃ paṭicca, evarūpaṃ pana paṇītabhojanaṃ alabhantā kathaṃ yāpessāmāti evaṃ paṇītabhojanaṃ paṭicca ahosīti veditabbaṃ. Bhūtapubbanti iminā rattibhojanassa paṇītabhāvaṃ dasseti. Sūpeyyanti sūpena upanetabbaṃ macchamaṃsakaḷīrādi. Samaggā bhuñjissāmāti ekato bhuñjissāma. Saṅkhatiyoti abhisaṅkhārikakhādanīyāni. Sabbā tā rattinti sabbā tā saṅkhatiyo rattiṃyeva honti, divā pana appā parittā thokikā hontīti. Manussā hi divā yāgukañjiyādīhi yāpetvāpi rattiṃ yathāsatti yathāpaṇītameva bhuñjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhūtapubba"
      },
      "nti iminā ratti vikālabhojane ādīnavaṃ dasseti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "andhakāratimisāya"
      },
      "nti bahalandhakāre. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Māṇavehī"
      },
      "ti corehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katakammehī"
      },
      "ti katacorakammehi. Corā kira katakammā yaṃ nesaṃ devataṃ āyācitvā kammaṃ nipphannaṃ, tassa upahāratthāya manusse māretvā galalohitādīni gaṇhanti. Te aññesu manussesu māriyamānesu kolāhalā uppajjissanti, pabbajitaṃ pariyesanto nāma natthīti maññamānā bhikkhū gahetvā mārenti. Taṃ sandhāyetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akatakammehī"
      },
      "ti aṭavito gāmaṃ āgamanakāle kammanipphannatthaṃ puretaraṃ balikammaṃ kātukāmehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaddhammena nimantetī"
      },
      "ti ‘‘ehi bhikkhu ajjekarattiṃ idheva bhuñjitvā idha vasitvā sampattiṃ anubhavitvā sve gamissasī’’ti methunadhammena nimanteti."
    ],
    "innerText": "Puna bhūtapubbanti iminā ratti vikālabhojane ādīnavaṃ dasseti. Tattha andhakāratimisāyanti bahalandhakāre. Māṇavehīti corehi. Katakammehīti katacorakammehi. Corā kira katakammā yaṃ nesaṃ devataṃ āyācitvā kammaṃ nipphannaṃ, tassa upahāratthāya manusse māretvā galalohitādīni gaṇhanti. Te aññesu manussesu māriyamānesu kolāhalā uppajjissanti, pabbajitaṃ pariyesanto nāma natthīti maññamānā bhikkhū gahetvā mārenti. Taṃ sandhāyetaṃ vuttaṃ. Akatakammehīti aṭavito gāmaṃ āgamanakāle kammanipphannatthaṃ puretaraṃ balikammaṃ kātukāmehi. Asaddhammena nimantetīti ‘‘ehi bhikkhu ajjekarattiṃ idheva bhuñjitvā idha vasitvā sampattiṃ anubhavitvā sve gamissasī’’ti methunadhammena nimanteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhūtapubba"
      },
      "nti iminā attanā diṭṭhakāraṇaṃ katheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijjantarikāyā"
      },
      "ti ",
      " vijjuvijjotanakkhaṇe ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissaramakāsī"
      },
      "ti mahāsaddamakāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhumme"
      },
      "ti bhū’ti vaḍḍhi, abhū’ti avaḍḍhi, vināso mayhanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pisāco vata ma"
      },
      "nti pisāco maṃ khādituṃ āgato vata. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ātumārī mātumārī"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ātū"
      },
      "ti pitā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mātū"
      },
      "ti mātā. Idaṃ vuttaṃ hoti – yassa pitā vā mātā vā atthi, taṃ mātāpitaro amhākaṃ puttakoti yathā tathā vā uppādetvā yaṃkiñci khādanīyabhojanīyaṃ datvā ekasmiṃ ṭhāne sayāpenti. So evaṃ rattiṃ piṇḍāya na carati. Tuyhaṃ pana mātāpitaro matā maññe, tena evaṃ carasīti."
    ],
    "innerText": "Puna bhūtapubbanti iminā attanā diṭṭhakāraṇaṃ katheti. Vijjantarikāyāti vijjuvijjotanakkhaṇe . Vissaramakāsīti mahāsaddamakāsi. Abhummeti bhū’ti vaḍḍhi, abhū’ti avaḍḍhi, vināso mayhanti attho. Pisāco vata manti pisāco maṃ khādituṃ āgato vata. Ātumārī mātumārīti ettha ātūti pitā, mātūti mātā. Idaṃ vuttaṃ hoti – yassa pitā vā mātā vā atthi, taṃ mātāpitaro amhākaṃ puttakoti yathā tathā vā uppādetvā yaṃkiñci khādanīyabhojanīyaṃ datvā ekasmiṃ ṭhāne sayāpenti. So evaṃ rattiṃ piṇḍāya na carati. Tuyhaṃ pana mātāpitaro matā maññe, tena evaṃ carasīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "150"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evamevā"
      },
      "ti ",
      " evameva kiñci ānisaṃsaṃ apassantā nikkāraṇeneva. Evamāhaṃsūti garahanto āha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āhaṃsū"
      },
      "ti vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiṃ panimassā"
      },
      "ti imassa appamattakassa hetu kiṃ vattabbaṃ nāma, nanu apassantena viya asuṇantena viya bhavitabbanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Oramattakassā"
      },
      "ti parittamattakassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhisallikhatevāya"
      },
      "nti ayaṃ samaṇo navanītaṃ pisanto viya padumanāḷasuttaṃ kakacena okkantanto viya atisallekhati, ativāyāmaṃ karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikkhākāmā"
      },
      "ti sāriputtamoggallānādayo viya sikkhākāmā, tesu ca appaccayaṃ upaṭṭhapenti. Tesañhi evaṃ hoti ‘‘sace ",
      " ete ‘appamattakametaṃ, haratha bhagavā’ti vadeyyuṃ, kiṃ satthā na hareyya. Evaṃ pana avatvā bhagavantaṃ parivāretvā nisinnā ‘evaṃ bhagavā, sādhu bhagavā, paññapetha bhagavā’ti atirekataraṃ ussāhaṃ paṭilabhantī’’ti. Tasmā tesu appaccayaṃ upaṭṭhapenti."
    ],
    "innerText": "150.Evamevāti evameva kiñci ānisaṃsaṃ apassantā nikkāraṇeneva. Evamāhaṃsūti garahanto āha. Tattha āhaṃsūti vadanti. Kiṃ panimassāti imassa appamattakassa hetu kiṃ vattabbaṃ nāma, nanu apassantena viya asuṇantena viya bhavitabbanti. Oramattakassāti parittamattakassa. Adhisallikhatevāyanti ayaṃ samaṇo navanītaṃ pisanto viya padumanāḷasuttaṃ kakacena okkantanto viya atisallekhati, ativāyāmaṃ karoti. Sikkhākāmāti sāriputtamoggallānādayo viya sikkhākāmā, tesu ca appaccayaṃ upaṭṭhapenti. Tesañhi evaṃ hoti ‘‘sace ete ‘appamattakametaṃ, haratha bhagavā’ti vadeyyuṃ, kiṃ satthā na hareyya. Evaṃ pana avatvā bhagavantaṃ parivāretvā nisinnā ‘evaṃ bhagavā, sādhu bhagavā, paññapetha bhagavā’ti atirekataraṃ ussāhaṃ paṭilabhantī’’ti. Tasmā tesu appaccayaṃ upaṭṭhapenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesa"
      },
      "nti tesaṃ ekaccānaṃ moghapurisānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ta"
      },
      "nti taṃ appamattakaṃ pahātabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thūlo kaliṅgaro"
      },
      "ti gale baddhaṃ mahākaṭṭhaṃ viya hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Laṭukikā sakuṇikā"
      },
      "ti cātakasakuṇikā. Sā kira ravasataṃ ravitvā naccasataṃ naccitvā sakiṃ gocaraṃ gaṇhāti. Ākāsato bhūmiyaṃ patiṭṭhitaṃ pana naṃ disvā vacchapālakādayo kīḷanatthaṃ pūtilatāya bandhanti. Taṃ sandhāyetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āgametī"
      },
      "ti upeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tañhi tassā"
      },
      "ti taṃ pūtilatābandhanaṃ tassā appasarīratāya ceva appathāmatāya ca balavabandhanaṃ nāma, mahantaṃ nāḷikerarajju viya ducchijjaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesa"
      },
      "nti tesaṃ moghapurisānaṃ saddhāmandatāya ca paññāmandatāya ca balavaṃ bandhanaṃ nāma, dukkaṭavatthumattakampi mahantaṃ pārājikavatthu viya duppajahaṃ hoti."
    ],
    "innerText": "Tesanti tesaṃ ekaccānaṃ moghapurisānaṃ. Tanti taṃ appamattakaṃ pahātabbaṃ. Thūlo kaliṅgaroti gale baddhaṃ mahākaṭṭhaṃ viya hoti. Laṭukikā sakuṇikāti cātakasakuṇikā. Sā kira ravasataṃ ravitvā naccasataṃ naccitvā sakiṃ gocaraṃ gaṇhāti. Ākāsato bhūmiyaṃ patiṭṭhitaṃ pana naṃ disvā vacchapālakādayo kīḷanatthaṃ pūtilatāya bandhanti. Taṃ sandhāyetaṃ vuttaṃ. Āgametīti upeti. Tañhi tassāti taṃ pūtilatābandhanaṃ tassā appasarīratāya ceva appathāmatāya ca balavabandhanaṃ nāma, mahantaṃ nāḷikerarajju viya ducchijjaṃ hoti. Tesanti tesaṃ moghapurisānaṃ saddhāmandatāya ca paññāmandatāya ca balavaṃ bandhanaṃ nāma, dukkaṭavatthumattakampi mahantaṃ pārājikavatthu viya duppajahaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "151"
      },
      ". Sukkapakkhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pahātabbassā"
      },
      "ti kiṃ imassa appamattakassa pahātabbassa hetu bhagavatā ",
      " vattabbaṃ atthi, yassa no bhagavā pahānamāha. Nanu evaṃ bhagavato adhippāyaṃ ñatvāpi pahātabbamevāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appossukkā"
      },
      "ti anussukkā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pannalomā"
      },
      "ti ",
      " patitalomā, na tassa pahātabbabhayena uddhaggalomā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paradattavuttā"
      },
      "ti parehi dinnavuttino, parato laddhena yāpentāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Migabhūtena cetasā viharantī"
      },
      "ti apaccāsīsanapakkhe ",
      " ṭhitā hutvā viharanti. Migo hi pahāraṃ labhitvā manussāvāsaṃ gantvā bhesajjaṃ vā vaṇatelaṃ vā labhissāmīti ajjhāsayaṃ akatvā pahāraṃ labhitvāva agāmakaṃ araññaṃ pavisitvā pahaṭaṭṭhānaṃ heṭṭhā katvā nipatitvā phāsubhūtakāle uṭṭhāya gacchati. Evaṃ migā apaccāsīsanapakkhe ṭhitā. Idaṃ sandhāya vuttaṃ ‘‘migabhūtena cetasā viharantī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tañhi tassā"
      },
      "ti taṃ varattabandhanaṃ tassa hatthināgassa mahāsarīratāya ceva mahāthāmatāya ca dubbalabandhanaṃ nāma. Pūtilatā viya suchijjaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesaṃ ta"
      },
      "nti tesaṃ taṃ kulaputtānaṃ saddhāmahantatāya ca paññāmahantatāya ca mahantaṃ pārājikavatthupi dukkaṭavatthumattakaṃ viya suppajahaṃ hoti."
    ],
    "innerText": "151. Sukkapakkhe pahātabbassāti kiṃ imassa appamattakassa pahātabbassa hetu bhagavatā vattabbaṃ atthi, yassa no bhagavā pahānamāha. Nanu evaṃ bhagavato adhippāyaṃ ñatvāpi pahātabbamevāti attho. Appossukkāti anussukkā. Pannalomāti patitalomā, na tassa pahātabbabhayena uddhaggalomā. Paradattavuttāti parehi dinnavuttino, parato laddhena yāpentāti attho. Migabhūtena cetasā viharantīti apaccāsīsanapakkhe ṭhitā hutvā viharanti. Migo hi pahāraṃ labhitvā manussāvāsaṃ gantvā bhesajjaṃ vā vaṇatelaṃ vā labhissāmīti ajjhāsayaṃ akatvā pahāraṃ labhitvāva agāmakaṃ araññaṃ pavisitvā pahaṭaṭṭhānaṃ heṭṭhā katvā nipatitvā phāsubhūtakāle uṭṭhāya gacchati. Evaṃ migā apaccāsīsanapakkhe ṭhitā. Idaṃ sandhāya vuttaṃ ‘‘migabhūtena cetasā viharantī’’ti. Tañhi tassāti taṃ varattabandhanaṃ tassa hatthināgassa mahāsarīratāya ceva mahāthāmatāya ca dubbalabandhanaṃ nāma. Pūtilatā viya suchijjaṃ hoti. Tesaṃ tanti tesaṃ taṃ kulaputtānaṃ saddhāmahantatāya ca paññāmahantatāya ca mahantaṃ pārājikavatthupi dukkaṭavatthumattakaṃ viya suppajahaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "152"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Daliddo"
      },
      "ti dāliddiyena samannāgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assako"
      },
      "ti nissako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāḷhiyo"
      },
      "ti anaḍḍho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Agāraka"
      },
      "nti khuddakagehaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Oluggavilugga"
      },
      "nti yassa gehayaṭṭhiyo piṭṭhivaṃsato muccitvā maṇḍale laggā, maṇḍalato muccitvā bhūmiyaṃ laggā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kākātidāyi"
      },
      "nti yattha kiñcideva bhuñjissāmāti anto nisinnakāle visuṃ dvārakiccaṃ nāma natthi, tato tato kākā ",
      " pavisitvā parivārenti. Sūrakākā hi palāyanakāle ca yathāsammukhaṭṭhāneneva nikkhamitvā palāyanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Naparamarūpa"
      },
      "nti na puññavantānaṃ gehaṃ viya uttamarūpaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khaṭopikā"
      },
      "ti vilīvamañcako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Oluggaviluggā"
      },
      "ti oṇatuṇṇatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhaññasamavāpaka"
      },
      "nti dhaññañca samavāpakañca. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhaññaṃ"
      },
      " nāma kudrūsako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samavāpaka"
      },
      "nti lābubījakumbhaṇḍabījakādi bījajātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Naparamarūpa"
      },
      "nti yathā puññavantānaṃ gandhasālibījādi parisuddhaṃ bījaṃ, na evarūpaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jāyikā"
      },
      "ti kapaṇajāyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Naparamarūpā"
      },
      "ti pacchisīsā lambatthanī mahodarā pisācā viya bībhacchā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāmañña"
      },
      "nti samaṇabhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So vatassaṃ, yoha"
      },
      "nti so vatāhaṃ puriso nāma assaṃ, yo kesamassuṃ ohāretvā pabbajeyyanti."
    ],
    "innerText": "152.Daliddoti dāliddiyena samannāgato. Assakoti nissako. Anāḷhiyoti anaḍḍho. Agārakanti khuddakagehaṃ. Oluggavilugganti yassa gehayaṭṭhiyo piṭṭhivaṃsato muccitvā maṇḍale laggā, maṇḍalato muccitvā bhūmiyaṃ laggā. Kākātidāyinti yattha kiñcideva bhuñjissāmāti anto nisinnakāle visuṃ dvārakiccaṃ nāma natthi, tato tato kākā pavisitvā parivārenti. Sūrakākā hi palāyanakāle ca yathāsammukhaṭṭhāneneva nikkhamitvā palāyanti. Naparamarūpanti na puññavantānaṃ gehaṃ viya uttamarūpaṃ. Khaṭopikāti vilīvamañcako. Oluggaviluggāti oṇatuṇṇatā. Dhaññasamavāpakanti dhaññañca samavāpakañca. Tattha dhaññaṃ nāma kudrūsako. Samavāpakanti lābubījakumbhaṇḍabījakādi bījajātaṃ. Naparamarūpanti yathā puññavantānaṃ gandhasālibījādi parisuddhaṃ bījaṃ, na evarūpaṃ. Jāyikāti kapaṇajāyā. Naparamarūpāti pacchisīsā lambatthanī mahodarā pisācā viya bībhacchā. Sāmaññanti samaṇabhāvo. So vatassaṃ, yohanti so vatāhaṃ puriso nāma assaṃ, yo kesamassuṃ ohāretvā pabbajeyyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So na sakkuṇeyyāti"
      },
      " so evaṃ cintetvāpi gehaṃ gantvā – ‘‘pabbajjā nāma lābhagarukā dukkarā durāsadā, sattapi aṭṭhapi gāme piṇḍāya caritvā yathādhoteneva pattena āgantabbampi hoti ",
      ", evaṃ yāpetuṃ asakkontassa ",
      " me puna āgatassa vasanaṭṭhānaṃ icchitabbaṃ, tiṇavallidabbasambhārā nāma dussamodhāniyā, kinti karomī’’ti vīmaṃsati. Athassa taṃ agārakaṃ vejayantapāsādo viya upaṭṭhāti. Athassa khaṭopikaṃ oloketvā – ‘‘mayi gate imaṃ visaṅkharitvā uddhanālātaṃ karissanti, puna aṭṭanipādavilīvādīni laddhabbāni honti, kinti ",
      " karissāmī’’ti cinteti. Athassa sā sirisayanaṃ viya upaṭṭhāti. Tato dhaññakumbhiṃ oloketvā – ‘‘mayi gate ayaṃ gharaṇī imaṃ dhaññaṃ tena tena saddhiṃ bhuñjissati. Puna āgatena jīvitavutti nāma laddhabbā hoti, kinti karissāmī’’ti cinteti. Athassa sā aḍḍhateḷasāni koṭṭhāgārasatāni viya upaṭṭhāti. Tato mātugāmaṃ oloketvā – ‘‘mayi gate imaṃ hatthigopako vā assagopako vā yo koci palobhessati, puna āgatena bhattapācikā nāma laddhabbā hoti, kinti karissāmī’’ti cinteti. Athassa sā rūpinī devī viya upaṭṭhāti. Idaṃ sandhāya ‘‘so na sakkuṇeyyā’’tiādi vuttaṃ."
    ],
    "innerText": "So na sakkuṇeyyāti so evaṃ cintetvāpi gehaṃ gantvā – ‘‘pabbajjā nāma lābhagarukā dukkarā durāsadā, sattapi aṭṭhapi gāme piṇḍāya caritvā yathādhoteneva pattena āgantabbampi hoti , evaṃ yāpetuṃ asakkontassa me puna āgatassa vasanaṭṭhānaṃ icchitabbaṃ, tiṇavallidabbasambhārā nāma dussamodhāniyā, kinti karomī’’ti vīmaṃsati. Athassa taṃ agārakaṃ vejayantapāsādo viya upaṭṭhāti. Athassa khaṭopikaṃ oloketvā – ‘‘mayi gate imaṃ visaṅkharitvā uddhanālātaṃ karissanti, puna aṭṭanipādavilīvādīni laddhabbāni honti, kinti karissāmī’’ti cinteti. Athassa sā sirisayanaṃ viya upaṭṭhāti. Tato dhaññakumbhiṃ oloketvā – ‘‘mayi gate ayaṃ gharaṇī imaṃ dhaññaṃ tena tena saddhiṃ bhuñjissati. Puna āgatena jīvitavutti nāma laddhabbā hoti, kinti karissāmī’’ti cinteti. Athassa sā aḍḍhateḷasāni koṭṭhāgārasatāni viya upaṭṭhāti. Tato mātugāmaṃ oloketvā – ‘‘mayi gate imaṃ hatthigopako vā assagopako vā yo koci palobhessati, puna āgatena bhattapācikā nāma laddhabbā hoti, kinti karissāmī’’ti cinteti. Athassa sā rūpinī devī viya upaṭṭhāti. Idaṃ sandhāya ‘‘so na sakkuṇeyyā’’tiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "153"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nikkhagaṇāna"
      },
      "nti suvaṇṇanikkhasatānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cayo"
      },
      "ti santānato katasannicayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhaññagaṇāna"
      },
      "nti dhaññasakaṭasatānaṃ."
    ],
    "innerText": "153.Nikkhagaṇānanti suvaṇṇanikkhasatānaṃ. Cayoti santānato katasannicayo. Dhaññagaṇānanti dhaññasakaṭasatānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "154"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattārome, udāyi, puggalā"
      },
      "ti idha kiṃ dasseti? Heṭṭhā ‘‘te tañceva pajahanti, te tañceva nappajahantī’’ti pajahanakā ca appajahanakā ca rāsivasena dassitā, na pāṭiyekkaṃ vibhattā. Idāni yathā nāma dabbasambhāratthaṃ gato puriso paṭipāṭiyā rukkhe chinditvā puna nivattitvā vaṅkañca pahāya kamme upanetabbayuttakameva gaṇhāti, evameva appajahanake chaḍḍetvā abbohārike katvā pajahanakapuggalā cattāro hontīti dassetuṃ imaṃ desanaṃ ārabhi."
    ],
    "innerText": "154.Cattārome, udāyi, puggalāti idha kiṃ dasseti? Heṭṭhā ‘‘te tañceva pajahanti, te tañceva nappajahantī’’ti pajahanakā ca appajahanakā ca rāsivasena dassitā, na pāṭiyekkaṃ vibhattā. Idāni yathā nāma dabbasambhāratthaṃ gato puriso paṭipāṭiyā rukkhe chinditvā puna nivattitvā vaṅkañca pahāya kamme upanetabbayuttakameva gaṇhāti, evameva appajahanake chaḍḍetvā abbohārike katvā pajahanakapuggalā cattāro hontīti dassetuṃ imaṃ desanaṃ ārabhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upadhipahānāyā"
      },
      "ti khandhupadhikilesupadhiabhisaṅkhārupadhikāmaguṇūpadhīti imesaṃ upadhīnaṃ pahānāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upadhipaṭisaṃyuttā"
      },
      "ti upadhianudhāvanakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sarasaṅkappā"
      },
      "ti ettha saranti dhāvantīti sarā. Saṅkappentīti ",
      " saṅkappā. Padadvayenapi vitakkāyeva vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samudācarantī"
      },
      "ti abhibhavanti ajjhottharitvā vattanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃyutto"
      },
      "ti kilesehi saṃyutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Indriyavemattatā"
      },
      "ti indriyanānattatā ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kadāci karahacī"
      },
      "ti bahukālaṃ vītivattetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satisammosā"
      },
      "ti satisammosena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nipāto"
      },
      "ti ayokaṭāhamhi ",
      " patanaṃ. Ettāvatā ‘‘nappajahati, pajahati, khippaṃ pajahatī’’ti tayo rāsayo dassitā. Tesu cattāro janā nappajahanti nāma, cattāro pajahanti nāma, cattāro khippaṃ pajahanti nāma."
    ],
    "innerText": "Upadhipahānāyāti khandhupadhikilesupadhiabhisaṅkhārupadhikāmaguṇūpadhīti imesaṃ upadhīnaṃ pahānāya. Upadhipaṭisaṃyuttāti upadhianudhāvanakā. Sarasaṅkappāti ettha saranti dhāvantīti sarā. Saṅkappentīti saṅkappā. Padadvayenapi vitakkāyeva vuttā. Samudācarantīti abhibhavanti ajjhottharitvā vattanti. Saṃyuttoti kilesehi saṃyutto. Indriyavemattatāti indriyanānattatā . Kadāci karahacīti bahukālaṃ vītivattetvā. Satisammosāti satisammosena. Nipātoti ayokaṭāhamhi patanaṃ. Ettāvatā ‘‘nappajahati, pajahati, khippaṃ pajahatī’’ti tayo rāsayo dassitā. Tesu cattāro janā nappajahanti nāma, cattāro pajahanti nāma, cattāro khippaṃ pajahanti nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha puthujjano sotāpanno sakadāgāmī anāgāmīti ime cattāro janā nappajahanti nāma. Puthujjanādayo tāva mā pajahantu, anāgāmī kathaṃ na pajahatīti? Sopi hi yāvadevassa bhavalobho atthi, tāva ahosukhaṃ ahosukhanti abhinandati. Tasmā nappajahati nāma. Eteyeva pana cattāro janā pajahanti nāma. Sotāpannādayo tāva pajahantu, puthujjano kathaṃ pajahatīti? Āraddhavipassako hi satisammosena sahasā kilese uppanne ‘‘mādisassa nāma bhikkhuno kileso uppanno’’ti saṃvegaṃ katvā vīriyaṃ paggayha vipassanaṃ vaḍḍhetvā maggena kilese samugghāteti. Iti so pajahati nāma. Teyeva cattāro khippaṃ pajahanti nāma. Tattha imasmiṃ sutte, mahāhatthipadopame (ma. ni. 1.288 ādayo), indriyabhāvaneti (ma. ni. 3.453 ādayo) imesu suttesu kiñcāpi tatiyavāro gahito, pañho pana dutiyavāreneva kathitoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upadhi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhassa mūla"
      },
      "nti ettha pañca khandhā upadhi nāma. Taṃ dukkhassa mūlanti iti viditvā kilesupadhinā nirupadhi hoti, niggahaṇo nitaṇhoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upadhisaṅkhaye vimutto"
      },
      "ti taṇhakkhaye nibbāne ārammaṇato vimutto."
    ],
    "innerText": "Upadhidukkhassa mūlanti ettha pañca khandhā upadhi nāma. Taṃ dukkhassa mūlanti iti viditvā kilesupadhinā nirupadhi hoti, niggahaṇo nitaṇhoti attho. Upadhisaṅkhaye vimuttoti taṇhakkhaye nibbāne ārammaṇato vimutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "155"
      },
      ". Evaṃ cattāro puggale vitthāretvā idāni ye pajahanti, te ‘‘ime nāma ettake kilese pajahanti’’. Ye nappajahanti, tepi ‘‘ime nāma ettake kilese nappajahantī’’ti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañca kho ime udāyi kāmaguṇā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "miḷhasukha"
      },
      "nti asucisukhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anariyasukha"
      },
      "nti anariyehi sevitasukhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāyitabba"
      },
      "nti etassa sukhassa paṭilābhatopi vipākatopi bhāyitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nekkhammasukha"
      },
      "nti kāmato nikkhantasukhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavivekasukha"
      },
      "nti gaṇatopi kilesatopi pavivittasukhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasamasukha"
      },
      "nti rāgādivūpasamatthāya sukhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sambodhasukha"
      },
      "nti maggasaṅkhātassa sambodhassa nibbattanatthāya ",
      " sukhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na bhāyitabba"
      },
      "nti etassa sukhassa paṭilābhatopi vipākatopi na bhāyitabbaṃ, bhāvetabbamevetaṃ."
    ],
    "innerText": "155. Evaṃ cattāro puggale vitthāretvā idāni ye pajahanti, te ‘‘ime nāma ettake kilese pajahanti’’. Ye nappajahanti, tepi ‘‘ime nāma ettake kilese nappajahantī’’ti dassetuṃ pañca kho ime udāyi kāmaguṇātiādimāha. Tattha miḷhasukhanti asucisukhaṃ. Anariyasukhanti anariyehi sevitasukhaṃ. Bhāyitabbanti etassa sukhassa paṭilābhatopi vipākatopi bhāyitabbaṃ. Nekkhammasukhanti kāmato nikkhantasukhaṃ. Pavivekasukhanti gaṇatopi kilesatopi pavivittasukhaṃ. Upasamasukhanti rāgādivūpasamatthāya sukhaṃ. Sambodhasukhanti maggasaṅkhātassa sambodhassa nibbattanatthāya sukhaṃ. Na bhāyitabbanti etassa sukhassa paṭilābhatopi vipākatopi na bhāyitabbaṃ, bhāvetabbamevetaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "156"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iñjitasmiṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vadāmī"
      },
      "ti iñjanaṃ calanaṃ phandananti vadāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiñca tattha iñjitasmi"
      },
      "nti kiñca tattha iñjitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idaṃ tattha iñjitasmi"
      },
      "nti ye ete aniruddhā vitakkavicārā, idaṃ tattha iñjitaṃ. Dutiyatatiyajjhānesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniñjitasmiṃ vadāmī"
      },
      "ti idaṃ catutthajjhānaṃ aniñjanaṃ acalanaṃ nipphandananti vadāmi."
    ],
    "innerText": "156.Iñjitasmiṃvadāmīti iñjanaṃ calanaṃ phandananti vadāmi. Kiñca tattha iñjitasminti kiñca tattha iñjitaṃ. Idaṃ tattha iñjitasminti ye ete aniruddhā vitakkavicārā, idaṃ tattha iñjitaṃ. Dutiyatatiyajjhānesupi eseva nayo. Aniñjitasmiṃ vadāmīti idaṃ catutthajjhānaṃ aniñjanaṃ acalanaṃ nipphandananti vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Analanti vadāmī"
      },
      "ti akattabbaālayanti vadāmi, taṇhālayo ",
      " ettha na uppādetabboti dasseti. Atha vā analaṃ apariyattaṃ, na ettāvatā alametanti sanniṭṭhānaṃ kātabbanti vadāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nevasaññānāsaññāyatanassāpī"
      },
      "ti evarūpāyapi santāya samāpattiyā pahānameva vadāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṇuṃ vā thūlaṃ vā"
      },
      "ti khuddakaṃ vā mahantaṃ vā appasāvajjaṃ vā mahāsāvajjaṃ vā. Sesaṃ sabbattha uttānameva. Desanā pana neyyapuggalassa vasena arahattanikūṭeneva niṭṭhāpitāti."
    ],
    "innerText": "Analanti vadāmīti akattabbaālayanti vadāmi, taṇhālayo ettha na uppādetabboti dasseti. Atha vā analaṃ apariyattaṃ, na ettāvatā alametanti sanniṭṭhānaṃ kātabbanti vadāmi. Nevasaññānāsaññāyatanassāpīti evarūpāyapi santāya samāpattiyā pahānameva vadāmi. Aṇuṃ vā thūlaṃ vāti khuddakaṃ vā mahantaṃ vā appasāvajjaṃ vā mahāsāvajjaṃ vā. Sesaṃ sabbattha uttānameva. Desanā pana neyyapuggalassa vasena arahattanikūṭeneva niṭṭhāpitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Laṭukikopamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Cātumasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "157"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti cātumasuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cātumāya"
      },
      "nti evaṃnāmake gāme. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcamattāni bhikkhusatānī"
      },
      "ti adhunā pabbajitānaṃ bhikkhūnaṃ pañca satāni. Therā kira cintesuṃ – ‘‘ime kulaputtā dasabalaṃ adisvāva pabbajitā, etesaṃ bhagavantaṃ dassessāma, bhagavato santike dhammaṃ sutvā attano attano yathāupanissayena patiṭṭhahissantī’’ti. Tasmā te bhikkhū gahetvā āgatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisammodamānā"
      },
      "ti ‘‘kaccāvuso, khamanīya’’ntiādiṃ paṭisanthārakathaṃ kurumānā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Senāsanāni paññāpayamānā"
      },
      "ti attano attano ācariyupajjhāyānaṃ vasanaṭṭhānāni pucchitvā dvāravātapānāni ",
      " vivaritvā mañcapīṭhakaṭasārakādīni nīharitvā papphoṭetvā yathāṭṭhāne saṇṭhāpayamānā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pattacīvarāni paṭisāmayamānā"
      },
      "ti, bhante, idaṃ ",
      " me pattaṃ ṭhapetha, idaṃ cīvaraṃ, idaṃ thālakaṃ, idaṃ udakatumbaṃ, imaṃ kattarayaṭṭhinti evaṃ samaṇaparikkhāre saṅgopayamānā."
    ],
    "innerText": "157.Evaṃme sutanti cātumasuttaṃ. Tattha cātumāyanti evaṃnāmake gāme. Pañcamattāni bhikkhusatānīti adhunā pabbajitānaṃ bhikkhūnaṃ pañca satāni. Therā kira cintesuṃ – ‘‘ime kulaputtā dasabalaṃ adisvāva pabbajitā, etesaṃ bhagavantaṃ dassessāma, bhagavato santike dhammaṃ sutvā attano attano yathāupanissayena patiṭṭhahissantī’’ti. Tasmā te bhikkhū gahetvā āgatā. Paṭisammodamānāti ‘‘kaccāvuso, khamanīya’’ntiādiṃ paṭisanthārakathaṃ kurumānā. Senāsanāni paññāpayamānāti attano attano ācariyupajjhāyānaṃ vasanaṭṭhānāni pucchitvā dvāravātapānāni vivaritvā mañcapīṭhakaṭasārakādīni nīharitvā papphoṭetvā yathāṭṭhāne saṇṭhāpayamānā. Pattacīvarāni paṭisāmayamānāti, bhante, idaṃ me pattaṃ ṭhapetha, idaṃ cīvaraṃ, idaṃ thālakaṃ, idaṃ udakatumbaṃ, imaṃ kattarayaṭṭhinti evaṃ samaṇaparikkhāre saṅgopayamānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uccāsaddā mahāsaddā"
      },
      "ti uddhaṃ uggatattā uccaṃ, patthaṭattā mahantaṃ avinibbhogasaddaṃ karontā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kevaṭṭā maññe macchavilope"
      },
      "ti kevaṭṭānaṃ macchapacchiṭhapitaṭṭhāne mahājano sannipatitvā – ‘‘idha aññaṃ ekaṃ macchaṃ dehi, ekaṃ macchaphālaṃ dehi, etassa te mahā dinno, mayhaṃ khuddako’’ti evaṃ uccāsaddaṃ mahāsaddaṃ karonti. Taṃ sandhāyetaṃ vuttaṃ. Macchagahaṇatthaṃ jāle pakkhittepi tasmiṃ ṭhāne kevaṭṭā ceva aññe ca ‘‘paviṭṭho na paviṭṭho, gahito na gahito’’ti mahāsaddaṃ karonti. Tampi sandhāyetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇāmemī"
      },
      "ti nīharāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na vo mama santike vatthabba"
      },
      "nti tumhe mādisassa buddhassa vasanaṭṭhānaṃ āgantvā evaṃ mahāsaddaṃ karotha, attano dhammatāya vasantā kiṃ nāma sāruppaṃ karissatha, tumhādisānaṃ mama santike vasanakiccaṃ natthīti dīpeti. Tesu ekabhikkhupi ‘‘bhagavā tumhe mahāsaddamattakena amhe paṇāmethā’’ti vā aññaṃ vā kiñci vattuṃ nāsakkhi, sabbe bhagavato vacanaṃ sampaṭicchantā ‘‘evaṃ, bhante,’’ti vatvā nikkhamiṃsu. Evaṃ pana tesaṃ ahosi ‘‘mayaṃ satthāraṃ passissāma, dhammakathaṃ sossāma, satthu santike vasissāmāti ",
      " āgatā. Evarūpassa pana garuno satthu santikaṃ āgantvā mahāsaddaṃ karimhā, amhākameva dosoyaṃ, paṇāmitamhā, na no laddhaṃ bhagavato santike vatthuṃ, na ",
      " suvaṇṇavaṇṇasarīraṃ oloketuṃ, na madhurassarena dhammaṃ sotu’’nti. Te balavadomanassajātā hutvā pakkamiṃsu."
    ],
    "innerText": "Uccāsaddā mahāsaddāti uddhaṃ uggatattā uccaṃ, patthaṭattā mahantaṃ avinibbhogasaddaṃ karontā. Kevaṭṭā maññe macchavilopeti kevaṭṭānaṃ macchapacchiṭhapitaṭṭhāne mahājano sannipatitvā – ‘‘idha aññaṃ ekaṃ macchaṃ dehi, ekaṃ macchaphālaṃ dehi, etassa te mahā dinno, mayhaṃ khuddako’’ti evaṃ uccāsaddaṃ mahāsaddaṃ karonti. Taṃ sandhāyetaṃ vuttaṃ. Macchagahaṇatthaṃ jāle pakkhittepi tasmiṃ ṭhāne kevaṭṭā ceva aññe ca ‘‘paviṭṭho na paviṭṭho, gahito na gahito’’ti mahāsaddaṃ karonti. Tampi sandhāyetaṃ vuttaṃ. Paṇāmemīti nīharāmi. Na vo mama santike vatthabbanti tumhe mādisassa buddhassa vasanaṭṭhānaṃ āgantvā evaṃ mahāsaddaṃ karotha, attano dhammatāya vasantā kiṃ nāma sāruppaṃ karissatha, tumhādisānaṃ mama santike vasanakiccaṃ natthīti dīpeti. Tesu ekabhikkhupi ‘‘bhagavā tumhe mahāsaddamattakena amhe paṇāmethā’’ti vā aññaṃ vā kiñci vattuṃ nāsakkhi, sabbe bhagavato vacanaṃ sampaṭicchantā ‘‘evaṃ, bhante,’’ti vatvā nikkhamiṃsu. Evaṃ pana tesaṃ ahosi ‘‘mayaṃ satthāraṃ passissāma, dhammakathaṃ sossāma, satthu santike vasissāmāti āgatā. Evarūpassa pana garuno satthu santikaṃ āgantvā mahāsaddaṃ karimhā, amhākameva dosoyaṃ, paṇāmitamhā, na no laddhaṃ bhagavato santike vatthuṃ, na suvaṇṇavaṇṇasarīraṃ oloketuṃ, na madhurassarena dhammaṃ sotu’’nti. Te balavadomanassajātā hutvā pakkamiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "158"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tenupasaṅkamiṃsū"
      },
      "ti te kira sakyā āgamanasamayepi te bhikkhū tattheva nisinnā passiṃsu. Atha nesaṃ etadahosi – ‘‘kiṃ nu kho ete bhikkhū pavisitvāva paṭinivattā, jānissāma taṃ kāraṇa’’nti cintetvā yena te bhikkhū tenupasaṅkamiṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Handā"
      },
      "ti vavassaggatthe nipāto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kahaṃ pana tumhe"
      },
      "ti tumhe idāneva āgantvā kahaṃ gacchatha, kiṃ tumhākaṃ koci upaddavo, udāhu dasabalassāti? Tesaṃ pana bhikkhūnaṃ, – ‘‘āvuso, mayaṃ bhagavantaṃ dassanāya āgatā, diṭṭho no bhagavā, idāni attano vasanaṭṭhānaṃ gacchāmā’’ti kiñcāpi evaṃ vacanaparihāro atthi, evarūpaṃ pana lesakappaṃ ",
      " akatvā yathābhūtameva ārocetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhagavatā kho, āvuso, bhikkhusaṅgho paṇāmito"
      },
      "ti āhaṃsu. Te pana rājāno sāsane dhuravahā, tasmā cintesuṃ – ‘‘dvīhi aggasāvakehi saddhiṃ pañcasu bhikkhusatesu gacchantesu bhagavato pādamūlaṃ vigacchissati, imesaṃ nivattanākāraṃ karissāmā’’ti. Evaṃ cintetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tena hāyasmanto"
      },
      "tiādimāhaṃsu. Tesupi ",
      " bhikkhūsu ‘‘mayaṃ mahāsaddamattakena paṇāmitā, na mayaṃ jīvituṃ asakkontā pabbajitā’’ti ekabhikkhupi paṭippharito nāma nāhosi, sabbe pana samakaṃyeva, ‘‘evamāvuso,’’ti sampaṭicchiṃsu."
    ],
    "innerText": "158.Tenupasaṅkamiṃsūti te kira sakyā āgamanasamayepi te bhikkhū tattheva nisinnā passiṃsu. Atha nesaṃ etadahosi – ‘‘kiṃ nu kho ete bhikkhū pavisitvāva paṭinivattā, jānissāma taṃ kāraṇa’’nti cintetvā yena te bhikkhū tenupasaṅkamiṃsu. Handāti vavassaggatthe nipāto. Kahaṃ pana tumheti tumhe idāneva āgantvā kahaṃ gacchatha, kiṃ tumhākaṃ koci upaddavo, udāhu dasabalassāti? Tesaṃ pana bhikkhūnaṃ, – ‘‘āvuso, mayaṃ bhagavantaṃ dassanāya āgatā, diṭṭho no bhagavā, idāni attano vasanaṭṭhānaṃ gacchāmā’’ti kiñcāpi evaṃ vacanaparihāro atthi, evarūpaṃ pana lesakappaṃ akatvā yathābhūtameva ārocetvā bhagavatā kho, āvuso, bhikkhusaṅgho paṇāmitoti āhaṃsu. Te pana rājāno sāsane dhuravahā, tasmā cintesuṃ – ‘‘dvīhi aggasāvakehi saddhiṃ pañcasu bhikkhusatesu gacchantesu bhagavato pādamūlaṃ vigacchissati, imesaṃ nivattanākāraṃ karissāmā’’ti. Evaṃ cintetvā tena hāyasmantotiādimāhaṃsu. Tesupi bhikkhūsu ‘‘mayaṃ mahāsaddamattakena paṇāmitā, na mayaṃ jīvituṃ asakkontā pabbajitā’’ti ekabhikkhupi paṭippharito nāma nāhosi, sabbe pana samakaṃyeva, ‘‘evamāvuso,’’ti sampaṭicchiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "159"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhinandatū"
      },
      "ti bhikkhusaṅghassa āgamanaṃ icchanto abhinandatu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhivadatū"
      },
      "ti etu bhikkhusaṅghoti evaṃ cittaṃ uppādento abhivadatu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuggahito"
      },
      "ti āmisānuggahena ca dhammānuggahena ca anuggahito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññathatta"
      },
      "nti dasabalassa dassanaṃ na labhāmāti pasādaññathattaṃ bhaveyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipariṇāmo"
      },
      "ti pasādaññathattena vibbhamantānaṃ vipariṇāmaññathattaṃ bhaveyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bījānaṃ taruṇāna"
      },
      "nti taruṇasassānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siyā aññathatta"
      },
      "nti udakavārakāle udakaṃ alabhantānaṃ milātabhāvena aññathattaṃ bhaveyya, sussitvā milātabhāvaṃ āpajjanena vipariṇāmo bhaveyya. Vacchakassa pana khīrapipāsāya sussanaṃ aññathattaṃ nāma, sussitvā kālakiriyā vipariṇāmo nāma."
    ],
    "innerText": "159.Abhinandatūti bhikkhusaṅghassa āgamanaṃ icchanto abhinandatu. Abhivadatūti etu bhikkhusaṅghoti evaṃ cittaṃ uppādento abhivadatu. Anuggahitoti āmisānuggahena ca dhammānuggahena ca anuggahito. Aññathattanti dasabalassa dassanaṃ na labhāmāti pasādaññathattaṃ bhaveyya. Vipariṇāmoti pasādaññathattena vibbhamantānaṃ vipariṇāmaññathattaṃ bhaveyya. Bījānaṃ taruṇānanti taruṇasassānaṃ. Siyā aññathattanti udakavārakāle udakaṃ alabhantānaṃ milātabhāvena aññathattaṃ bhaveyya, sussitvā milātabhāvaṃ āpajjanena vipariṇāmo bhaveyya. Vacchakassa pana khīrapipāsāya sussanaṃ aññathattaṃ nāma, sussitvā kālakiriyā vipariṇāmo nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "160"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pasādito bhagavā"
      },
      "ti thero kira tattha nisinnova dibbacakkhunā brahmānaṃ āgataṃ addasa ",
      ", dibbāya sotadhātuyā ca āyācanasaddaṃ suṇi, cetopariyañāṇena bhagavato pasannabhāvaṃ aññāsi. Tasmā – ‘‘kañci bhikkhuṃ pesetvā pakkosiyamānānaṃ gamanaṃ nāma na phāsukaṃ, yāva satthā na peseti, tāvadeva gamissāmā’’ti maññamāno evamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appossukko"
      },
      "ti aññesu kiccesu anussukko hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhadhammasukhavihāra"
      },
      "nti phalasamāpattivihāraṃ anuyutto maññe bhagavā viharitukāmo, so idāni yathāruciyā viharissatīti evaṃ me ahosīti vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mayampi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dānī"
      },
      "ti mayaṃ paraṃ ovadamānā vihārato nikkaḍḍhitā, kiṃ amhākaṃ parovādena. Idāni mayampi diṭṭhadhammasukhavihāreneva viharissāmāti dīpeti. Thero imasmiṃ ṭhāne viraddho attano bhārabhāvaṃ na aññāsi. Ayañhi bhikkhusaṅgho dvinnampi mahātherānaṃ bhāro, tena ",
      " naṃ paṭisedhento bhagavā",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": " āgamehī"
      },
      "tiādimāha. Mahāmoggallānatthero pana attano bhārabhāvaṃ aññāsi. Tenassa bhagavā sādhukāraṃ adāsi."
    ],
    "innerText": "160.Pasādito bhagavāti thero kira tattha nisinnova dibbacakkhunā brahmānaṃ āgataṃ addasa , dibbāya sotadhātuyā ca āyācanasaddaṃ suṇi, cetopariyañāṇena bhagavato pasannabhāvaṃ aññāsi. Tasmā – ‘‘kañci bhikkhuṃ pesetvā pakkosiyamānānaṃ gamanaṃ nāma na phāsukaṃ, yāva satthā na peseti, tāvadeva gamissāmā’’ti maññamāno evamāha. Appossukkoti aññesu kiccesu anussukko hutvā. Diṭṭhadhammasukhavihāranti phalasamāpattivihāraṃ anuyutto maññe bhagavā viharitukāmo, so idāni yathāruciyā viharissatīti evaṃ me ahosīti vadati. Mayampidānīti mayaṃ paraṃ ovadamānā vihārato nikkaḍḍhitā, kiṃ amhākaṃ parovādena. Idāni mayampi diṭṭhadhammasukhavihāreneva viharissāmāti dīpeti. Thero imasmiṃ ṭhāne viraddho attano bhārabhāvaṃ na aññāsi. Ayañhi bhikkhusaṅgho dvinnampi mahātherānaṃ bhāro, tena naṃ paṭisedhento bhagavā āgamehītiādimāha. Mahāmoggallānatthero pana attano bhārabhāvaṃ aññāsi. Tenassa bhagavā sādhukāraṃ adāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "161"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattārimāni, bhikkhave"
      },
      "ti kasmā ārabhi? Imasmiṃ sāsane cattāri bhayāni. Yo tāni abhīto hoti, so imasmiṃ sāsane patiṭṭhātuṃ sakkoti. Itaro pana na sakkotīti dassetuṃ imaṃ desanaṃ ārabhi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "udakorohante"
      },
      "ti udakaṃ orohante puggale. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kumbhīlabhaya"
      },
      "nti suṃsumārabhayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Susukābhaya"
      },
      "nti caṇḍamacchabhayaṃ."
    ],
    "innerText": "161.Cattārimāni, bhikkhaveti kasmā ārabhi? Imasmiṃ sāsane cattāri bhayāni. Yo tāni abhīto hoti, so imasmiṃ sāsane patiṭṭhātuṃ sakkoti. Itaro pana na sakkotīti dassetuṃ imaṃ desanaṃ ārabhi. Tattha udakorohanteti udakaṃ orohante puggale. Kumbhīlabhayanti suṃsumārabhayaṃ. Susukābhayanti caṇḍamacchabhayaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "162"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kodhupāyāsassetaṃ adhivacana"
      },
      "nti yathā hi bāhiraṃ udakaṃ otiṇṇo ūmīsu osīditvā marati, evaṃ imasmiṃ sāsane kodhupāyāse osīditvā vibbhamati. Tasmā kodhupāyāso ‘‘ūmibhaya’’nti vutto."
    ],
    "innerText": "162.Kodhupāyāsassetaṃ adhivacananti yathā hi bāhiraṃ udakaṃ otiṇṇo ūmīsu osīditvā marati, evaṃ imasmiṃ sāsane kodhupāyāse osīditvā vibbhamati. Tasmā kodhupāyāso ‘‘ūmibhaya’’nti vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "163"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Odarikattassetaṃ adhivacana"
      },
      "nti yathā hi bāhiraṃ udakaṃ otiṇṇo kumbhīlena khādito marati, evaṃ imasmiṃ sāsane odarikattena khādito vibbhamati. Tasmā odarikattaṃ ‘‘kumbhīlabhaya’’nti vuttaṃ."
    ],
    "innerText": "163.Odarikattassetaṃ adhivacananti yathā hi bāhiraṃ udakaṃ otiṇṇo kumbhīlena khādito marati, evaṃ imasmiṃ sāsane odarikattena khādito vibbhamati. Tasmā odarikattaṃ ‘‘kumbhīlabhaya’’nti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "164"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arakkhiteneva kāyenā"
      },
      "ti sīsappacālakādikaraṇena arakkhitakāyo hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arakkhitāya vācāyā"
      },
      "ti duṭṭhullabhāsanādivasena arakkhitavāco hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupaṭṭhitāya"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satiyā"
      },
      "ti kāyagatāsatiṃ anupaṭṭhāpetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaṃvutehī"
      },
      "ti apihitehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcannetaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmaguṇānaṃ adhivacana"
      },
      "nti yathā ",
      " hi bāhiraṃ udakaṃ otiṇṇo āvaṭṭe nimujjitvā marati, evaṃ imasmiṃ sāsane pabbajito pañcakāmaguṇāvaṭṭe nimujjitvā vibbhamati. Tasmā pañca kāmaguṇā ‘‘āvaṭṭabhaya’’nti vuttā."
    ],
    "innerText": "164.Arakkhiteneva kāyenāti sīsappacālakādikaraṇena arakkhitakāyo hutvā. Arakkhitāya vācāyāti duṭṭhullabhāsanādivasena arakkhitavāco hutvā. Anupaṭṭhitāyasatiyāti kāyagatāsatiṃ anupaṭṭhāpetvā. Asaṃvutehīti apihitehi. Pañcannetaṃkāmaguṇānaṃ adhivacananti yathā hi bāhiraṃ udakaṃ otiṇṇo āvaṭṭe nimujjitvā marati, evaṃ imasmiṃ sāsane pabbajito pañcakāmaguṇāvaṭṭe nimujjitvā vibbhamati. Tasmā pañca kāmaguṇā ‘‘āvaṭṭabhaya’’nti vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "165"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuddhaṃsetī"
      },
      "ti kilameti milāpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rāgānuddhaṃsenā"
      },
      "ti rāgānuddhaṃsitena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mātugāmassetaṃ adhivacana"
      },
      "nti yathā hi bāhiraṃ udakaṃ otiṇṇo caṇḍamacchaṃ āgamma laddhappahāro marati, evaṃ imasmiṃ sāsane mātugāmaṃ āgamma uppannakāmarāgo vibbhamati. Tasmā mātugāmo ‘‘susukābhaya’’nti vutto."
    ],
    "innerText": "165.Anuddhaṃsetīti kilameti milāpeti. Rāgānuddhaṃsenāti rāgānuddhaṃsitena. Mātugāmassetaṃ adhivacananti yathā hi bāhiraṃ udakaṃ otiṇṇo caṇḍamacchaṃ āgamma laddhappahāro marati, evaṃ imasmiṃ sāsane mātugāmaṃ āgamma uppannakāmarāgo vibbhamati. Tasmā mātugāmo ‘‘susukābhaya’’nti vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imāni ",
      " pana cattāri bhayāni bhāyitvā yathā udakaṃ anorohantassa udakaṃ nissāya ānisaṃso natthi, udakapipāsāya pipāsito ca hoti rajojallena kiliṭṭhasarīro ca, evamevaṃ imāni cattāri bhayāni bhāyitvā sāsane apabbajantassāpi imaṃ sāsanaṃ nissāya ānisaṃso natthi, taṇhāpipāsāya pipāsito ca hoti kilesarajena saṃkiliṭṭhacitto ca. Yathā pana imāni cattāri bhayāni abhāyitvā udakaṃ orohantassa vuttappakāro ānisaṃso hoti, evaṃ imāni abhāyitvā sāsane pabbajitassāpi vuttappakāro ānisaṃso hoti. Thero panāha – ‘‘cattāri bhayāni bhāyitvā udakaṃ anotaranto sotaṃ chinditvā paratīraṃ pāpuṇituṃ na sakkoti, abhāyitvā otaranto sakkoti, evamevaṃ bhāyitvā sāsane apabbajantopi taṇhāsotaṃ ",
      " chinditvā nibbānapāraṃ daṭṭhuṃ na sakkoti, abhāyitvā pabbajanto pana sakkotī’’ti. Sesaṃ sabbattha uttānameva. Ayaṃ pana desanā neyyapuggalassa vasena niṭṭhāpitāti."
    ],
    "innerText": "Imāni pana cattāri bhayāni bhāyitvā yathā udakaṃ anorohantassa udakaṃ nissāya ānisaṃso natthi, udakapipāsāya pipāsito ca hoti rajojallena kiliṭṭhasarīro ca, evamevaṃ imāni cattāri bhayāni bhāyitvā sāsane apabbajantassāpi imaṃ sāsanaṃ nissāya ānisaṃso natthi, taṇhāpipāsāya pipāsito ca hoti kilesarajena saṃkiliṭṭhacitto ca. Yathā pana imāni cattāri bhayāni abhāyitvā udakaṃ orohantassa vuttappakāro ānisaṃso hoti, evaṃ imāni abhāyitvā sāsane pabbajitassāpi vuttappakāro ānisaṃso hoti. Thero panāha – ‘‘cattāri bhayāni bhāyitvā udakaṃ anotaranto sotaṃ chinditvā paratīraṃ pāpuṇituṃ na sakkoti, abhāyitvā otaranto sakkoti, evamevaṃ bhāyitvā sāsane apabbajantopi taṇhāsotaṃ chinditvā nibbānapāraṃ daṭṭhuṃ na sakkoti, abhāyitvā pabbajanto pana sakkotī’’ti. Sesaṃ sabbattha uttānameva. Ayaṃ pana desanā neyyapuggalassa vasena niṭṭhāpitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cātumasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Naḷakapānasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "166"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti naḷakapānasuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "naḷakapāne"
      },
      "ti evaṃnāmake gāme. Pubbe kira amhākaṃ bodhisatto vānarayoniyaṃ nibbatto, mahākāyo kapirājā anekavānarasahassaparivuto pabbatapāde vicarati. Paññavā kho pana hoti mahāpuñño. So parisaṃ evaṃ ovadati – ‘‘imasmiṃ pabbatapāde tātā, visaphalāni nāma honti, amanussapariggahitā pokkharaṇiyo nāma honti, tumhe pubbe khāditapubbāneva phalāni khādatha, pītapubbāneva pānīyāni ca pivatha, ettha vo maṃ paṭipucchitabbakiccaṃ natthi, akhāditapubbāni pana phalāni apītapubbāni ca pānīyāni maṃ apucchitvā mā khādittha mā pivitthā’’ti."
    ],
    "innerText": "166.Evaṃme sutanti naḷakapānasuttaṃ. Tattha naḷakapāneti evaṃnāmake gāme. Pubbe kira amhākaṃ bodhisatto vānarayoniyaṃ nibbatto, mahākāyo kapirājā anekavānarasahassaparivuto pabbatapāde vicarati. Paññavā kho pana hoti mahāpuñño. So parisaṃ evaṃ ovadati – ‘‘imasmiṃ pabbatapāde tātā, visaphalāni nāma honti, amanussapariggahitā pokkharaṇiyo nāma honti, tumhe pubbe khāditapubbāneva phalāni khādatha, pītapubbāneva pānīyāni ca pivatha, ettha vo maṃ paṭipucchitabbakiccaṃ natthi, akhāditapubbāni pana phalāni apītapubbāni ca pānīyāni maṃ apucchitvā mā khādittha mā pivitthā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Te ",
      " ekadivasaṃ caramānā aññaṃ pabbatapādaṃ gantvā gocaraṃ gahetvā pānīyaṃ olokentā ekaṃ amanussapariggahitaṃ pokkharaṇiṃ disvā sahasā apivitvā samantā parivāretvā mahāsattassa āgamanaṃ olokayamānā nisīdiṃsu. Mahāsatto āgantvā ‘‘kiṃ tātā pānīyaṃ na pivathā’’ti āha. Tumhākaṃ ",
      " āgamanaṃ olokemāti. Sādhu tātāti samantā padaṃ pariyesamāno otiṇṇapadaṃyeva addasa, na uttiṇṇapadaṃ, disvā saparissayāti aññāsi. Tāvadeva ca tattha abhinibbattaamanusso udakaṃ dvedhā katvā uṭṭhāsi setamukho nīlakucchi rattahatthapādo mahādāṭhiko vaṅkadāṭho virūpo bībhaccho udakarakkhaso. So evamāha – ‘‘kasmā pānīyaṃ na pivatha, madhuraṃ udakaṃ pivatha, kiṃ tumhe etassa vacanaṃ suṇāthā’’ti? Mahāsatto āha – ‘‘tvaṃ idha adhivattho amanusso’’ti? Āmāhanti. Tvaṃ idha otiṇṇe labhasīti? Āma labhāmi, tumhe pana sabbe khādissāmīti. Na sakkhissasi, yakkhāti. Pānīyaṃ pana pivissathāti? Āma pivissāmāti. Evaṃ sante ekopi vo na muccissatīti. Pānīyañca pivissāma, na ca te vasaṃ gamissāmāti ekanaḷaṃ āharāpetvā koṭiyaṃ gahetvā dhami, sabbo ekacchiddo ahosi, tīre nisīditvāva pānīyaṃ pivi, sesavānarānaṃ pāṭiyekke naḷe āharāpetvā ",
      " dhamitvā adāsi. Sabbe yakkhassa passantasseva pānīyaṃ piviṃsu. Vuttampi cetaṃ –"
    ],
    "innerText": "Te ekadivasaṃ caramānā aññaṃ pabbatapādaṃ gantvā gocaraṃ gahetvā pānīyaṃ olokentā ekaṃ amanussapariggahitaṃ pokkharaṇiṃ disvā sahasā apivitvā samantā parivāretvā mahāsattassa āgamanaṃ olokayamānā nisīdiṃsu. Mahāsatto āgantvā ‘‘kiṃ tātā pānīyaṃ na pivathā’’ti āha. Tumhākaṃ āgamanaṃ olokemāti. Sādhu tātāti samantā padaṃ pariyesamāno otiṇṇapadaṃyeva addasa, na uttiṇṇapadaṃ, disvā saparissayāti aññāsi. Tāvadeva ca tattha abhinibbattaamanusso udakaṃ dvedhā katvā uṭṭhāsi setamukho nīlakucchi rattahatthapādo mahādāṭhiko vaṅkadāṭho virūpo bībhaccho udakarakkhaso. So evamāha – ‘‘kasmā pānīyaṃ na pivatha, madhuraṃ udakaṃ pivatha, kiṃ tumhe etassa vacanaṃ suṇāthā’’ti? Mahāsatto āha – ‘‘tvaṃ idha adhivattho amanusso’’ti? Āmāhanti. Tvaṃ idha otiṇṇe labhasīti? Āma labhāmi, tumhe pana sabbe khādissāmīti. Na sakkhissasi, yakkhāti. Pānīyaṃ pana pivissathāti? Āma pivissāmāti. Evaṃ sante ekopi vo na muccissatīti. Pānīyañca pivissāma, na ca te vasaṃ gamissāmāti ekanaḷaṃ āharāpetvā koṭiyaṃ gahetvā dhami, sabbo ekacchiddo ahosi, tīre nisīditvāva pānīyaṃ pivi, sesavānarānaṃ pāṭiyekke naḷe āharāpetvā dhamitvā adāsi. Sabbe yakkhassa passantasseva pānīyaṃ piviṃsu. Vuttampi cetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Disvā padamanuttiṇṇaṃ, disvāno’ taritaṃ padaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Naḷena vāriṃ pissāma, neva maṃ tvaṃ vadhissasī’’ti. (jā. 1.1.20);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato paṭṭhāya yāva ajjadivasā tasmiṃ ṭhāne naḷā ekacchiddāva honti. Iminā hi saddhiṃ imasmiṃ kappe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cattāri kappaṭṭhiyapāṭihāriyāni"
      },
      " nāma – cande sasabimbaṃ ",
      ", vaṭṭakajātakamhi saccakiriyaṭṭhāne aggissa gamanupacchedo, ghaṭikārakumbhakārassa mātāpitūnaṃ vasanaṭṭhāne devassa avassanaṃ, tassā pokkharaṇiyā tīre naḷānaṃ ekacchiddabhāvoti. Iti sā pokkharaṇī naḷena pānīyassa pītattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "naḷakapānā"
      },
      "ti nāmaṃ labhi. Aparabhāge taṃ pokkharaṇiṃ nissāya gāmo patiṭṭhāsi, tassāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "naḷakapānanteva"
      },
      " nāmaṃ jātaṃ. Taṃ sandhāya vuttaṃ ‘‘naḷakapāne’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Palāsavane"
      },
      "ti kiṃsukavane."
    ],
    "innerText": "Tato paṭṭhāya yāva ajjadivasā tasmiṃ ṭhāne naḷā ekacchiddāva honti. Iminā hi saddhiṃ imasmiṃ kappe cattāri kappaṭṭhiyapāṭihāriyāni nāma – cande sasabimbaṃ , vaṭṭakajātakamhi saccakiriyaṭṭhāne aggissa gamanupacchedo, ghaṭikārakumbhakārassa mātāpitūnaṃ vasanaṭṭhāne devassa avassanaṃ, tassā pokkharaṇiyā tīre naḷānaṃ ekacchiddabhāvoti. Iti sā pokkharaṇī naḷena pānīyassa pītattā naḷakapānāti nāmaṃ labhi. Aparabhāge taṃ pokkharaṇiṃ nissāya gāmo patiṭṭhāsi, tassāpi naḷakapānanteva nāmaṃ jātaṃ. Taṃ sandhāya vuttaṃ ‘‘naḷakapāne’’ti. Palāsavaneti kiṃsukavane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "167"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taggha"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mayaṃ, bhante"
      },
      "ti ekaṃseneva mayaṃ, bhante, abhiratā. Aññepi ye tumhākaṃ sāsane abhiramanti, te amhehi sadisāva hutvā abhiramantīti dīpenti."
    ],
    "innerText": "167.Tagghamayaṃ, bhanteti ekaṃseneva mayaṃ, bhante, abhiratā. Aññepi ye tumhākaṃ sāsane abhiramanti, te amhehi sadisāva hutvā abhiramantīti dīpenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Neva rājābhinītā"
      },
      "tiādīsu eko rañño aparādhaṃ katvā palāyati. Rājā kuhiṃ, bho, asukoti? Palāto devāti. Palātaṭṭhānepi me na muccissati, sace pana pabbajeyya, mucceyyāti vadati. Tassa kocideva suhado gantvā taṃ pavattiṃ ārocetvā tvaṃ sace jīvitumicchasi, pabbajāhīti. So pabbajitvā jīvitaṃ rakkhamāno carati. Ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rājābhinīto"
      },
      " nāma."
    ],
    "innerText": "Neva rājābhinītātiādīsu eko rañño aparādhaṃ katvā palāyati. Rājā kuhiṃ, bho, asukoti? Palāto devāti. Palātaṭṭhānepi me na muccissati, sace pana pabbajeyya, mucceyyāti vadati. Tassa kocideva suhado gantvā taṃ pavattiṃ ārocetvā tvaṃ sace jīvitumicchasi, pabbajāhīti. So pabbajitvā jīvitaṃ rakkhamāno carati. Ayaṃ rājābhinīto nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Eko pana corānaṃ mūlaṃ chindanto carati. Corā sutvā ‘‘purisānaṃ atthikabhāvaṃ na jānāti, jānāpessāma na’’nti vadanti. So taṃ pavattiṃ sutvā palāyati. Corā palātoti sutvā ‘‘palātaṭṭhānepi no na muccissati, sace pana pabbajeyya, mucceyyā’’ti vadanti. So taṃ pavattiṃ sutvā pabbajati. Ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "corābhinīto"
      },
      " nāma."
    ],
    "innerText": "Eko pana corānaṃ mūlaṃ chindanto carati. Corā sutvā ‘‘purisānaṃ atthikabhāvaṃ na jānāti, jānāpessāma na’’nti vadanti. So taṃ pavattiṃ sutvā palāyati. Corā palātoti sutvā ‘‘palātaṭṭhānepi no na muccissati, sace pana pabbajeyya, mucceyyā’’ti vadanti. So taṃ pavattiṃ sutvā pabbajati. Ayaṃ corābhinīto nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Eko ",
      " pana bahuṃ iṇaṃ khāditvā tena iṇena aṭṭo pīḷito tamhā gāmā palāyati. Iṇasāmikā sutvā ‘‘palātaṭṭhānepi no na muccissati, sace pana pabbajeyya, mucceyyā’’ti vadanti. So taṃ pavattiṃ sutvā pabbajati. Ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iṇaṭṭo"
      },
      " nāma."
    ],
    "innerText": "Eko pana bahuṃ iṇaṃ khāditvā tena iṇena aṭṭo pīḷito tamhā gāmā palāyati. Iṇasāmikā sutvā ‘‘palātaṭṭhānepi no na muccissati, sace pana pabbajeyya, mucceyyā’’ti vadanti. So taṃ pavattiṃ sutvā pabbajati. Ayaṃ iṇaṭṭo nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rājabhayādīnaṃ ",
      " pana aññatarena bhayena bhīto aṭṭo āturo hutvā nikkhamma pabbajito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhayaṭṭo"
      },
      " nāma. Dubbhikkhādīsu jīvituṃ asakkonto pabbajito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ājīvikāpakato"
      },
      " nāma, ājīvikāya pakato abhibhūtoti attho. Imesu pana ekopi imehi kāraṇehi pabbajito nāma natthi, tasmā ‘‘neva rājābhinīto’’tiādimāha."
    ],
    "innerText": "Rājabhayādīnaṃ pana aññatarena bhayena bhīto aṭṭo āturo hutvā nikkhamma pabbajito bhayaṭṭo nāma. Dubbhikkhādīsu jīvituṃ asakkonto pabbajito ājīvikāpakato nāma, ājīvikāya pakato abhibhūtoti attho. Imesu pana ekopi imehi kāraṇehi pabbajito nāma natthi, tasmā ‘‘neva rājābhinīto’’tiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viveka"
      },
      "nti vivicca vivitto hutvā. Idaṃ vuttaṃ hoti – yaṃ kāmehi ca akusaladhammehi ca vivittena paṭhamadutiyajjhānasaṅkhātaṃ pītisukhaṃ adhigantabbaṃ, sace taṃ vivicca kāmehi vivicca akusalehi dhammehi pītisukhaṃ nādhigacchati, aññaṃ vā upari dvinnaṃ jhānānaṃ catunnañca maggānaṃ vasena santataraṃ sukhaṃ nādhigacchati, tassa ime abhijjhādayo cittaṃ pariyādāya tiṭṭhantīti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aratī"
      },
      "ti adhikusalesu dhammesu ukkaṇṭhitatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tandī"
      },
      "ti ālasiyabhāvo. Evaṃ yo pabbajitvā pabbajitakiccaṃ kātuṃ na sakkoti, tassa ime satta pāpadhammā uppajjitvā ",
      " cittaṃ pariyādiyantīti dassetvā idāni yassa te dhammā cittaṃ pariyādāya tiṭṭhanti, soyeva samaṇakiccampi kātuṃ na sakkotīti puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vivekaṃ anuruddhā…pe… aññaṃ vā tato santatara"
      },
      "nti āha."
    ],
    "innerText": "Vivekanti vivicca vivitto hutvā. Idaṃ vuttaṃ hoti – yaṃ kāmehi ca akusaladhammehi ca vivittena paṭhamadutiyajjhānasaṅkhātaṃ pītisukhaṃ adhigantabbaṃ, sace taṃ vivicca kāmehi vivicca akusalehi dhammehi pītisukhaṃ nādhigacchati, aññaṃ vā upari dvinnaṃ jhānānaṃ catunnañca maggānaṃ vasena santataraṃ sukhaṃ nādhigacchati, tassa ime abhijjhādayo cittaṃ pariyādāya tiṭṭhantīti. Tattha aratīti adhikusalesu dhammesu ukkaṇṭhitatā. Tandīti ālasiyabhāvo. Evaṃ yo pabbajitvā pabbajitakiccaṃ kātuṃ na sakkoti, tassa ime satta pāpadhammā uppajjitvā cittaṃ pariyādiyantīti dassetvā idāni yassa te dhammā cittaṃ pariyādāya tiṭṭhanti, soyeva samaṇakiccampi kātuṃ na sakkotīti puna vivekaṃ anuruddhā…pe… aññaṃ vā tato santataranti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ kaṇhapakkhaṃ dassetvā idāni teneva nayena sukkapakkhaṃ dassetuṃ puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viveka"
      },
      "ntiādimāha. Tassattho vuttanayeneva veditabbo."
    ],
    "innerText": "Evaṃ kaṇhapakkhaṃ dassetvā idāni teneva nayena sukkapakkhaṃ dassetuṃ puna vivekantiādimāha. Tassattho vuttanayeneva veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "168"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhāyā"
      },
      "ti jānitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eka"
      },
      "nti ",
      " ekaccaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisevatī"
      },
      "ti sevitabbayuttakaṃ sevati. Sesapadesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upapattīsu byākarotī"
      },
      "ti sappaṭisandhike tāva byākarotu, appaṭisandhike kathaṃ byākarotīti. Appaṭisandhikassa puna bhave paṭisandhi natthīti vadanto upapattīsu byākaroti nāma."
    ],
    "innerText": "168.Saṅkhāyāti jānitvā. Ekanti ekaccaṃ. Paṭisevatīti sevitabbayuttakaṃ sevati. Sesapadesupi eseva nayo. Upapattīsu byākarotīti sappaṭisandhike tāva byākarotu, appaṭisandhike kathaṃ byākarotīti. Appaṭisandhikassa puna bhave paṭisandhi natthīti vadanto upapattīsu byākaroti nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Janakuhanattha"
      },
      "nti ",
      " janavimhāpanatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Janalapanattha"
      },
      "nti mahājanassa upalāpanatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na iti maṃ jano jānātū"
      },
      "ti evaṃ maṃ mahājano jānissati, evaṃ me mahājanassa antare kittisaddo uggacchissatīti imināpi kāraṇena na byākarotīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uḷāravedā"
      },
      "ti mahantatuṭṭhino."
    ],
    "innerText": "Janakuhanatthanti janavimhāpanatthaṃ. Janalapanatthanti mahājanassa upalāpanatthaṃ. Na iti maṃ jano jānātūti evaṃ maṃ mahājano jānissati, evaṃ me mahājanassa antare kittisaddo uggacchissatīti imināpi kāraṇena na byākarotīti attho. Uḷāravedāti mahantatuṭṭhino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "169"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So kho panassa āyasmā"
      },
      "ti so parinibbuto āyasmā imassa ṭhitassa āyasmato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃsīlo"
      },
      "tiādīsu lokiyalokuttaramissakāva sīlādayo veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃdhammo"
      },
      "ti ettha pana samādhipakkhikā dhammā dhammāti adhippetā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phāsuvihāro hotī"
      },
      "ti tena bhikkhunā pūritapaṭipattiṃ pūrentassa arahattaphalaṃ sacchikatvā phalasamāpattivihārena phāsuvihāro hoti, arahattaṃ pattumasakkontassa paṭipattiṃ pūrayamānassa caratopi phāsuvihāroyeva nāma hoti. Iminā nayena sabbavāresu attho veditabboti."
    ],
    "innerText": "169.So kho panassa āyasmāti so parinibbuto āyasmā imassa ṭhitassa āyasmato. Evaṃsīlotiādīsu lokiyalokuttaramissakāva sīlādayo veditabbo. Evaṃdhammoti ettha pana samādhipakkhikā dhammā dhammāti adhippetā. Phāsuvihāro hotīti tena bhikkhunā pūritapaṭipattiṃ pūrentassa arahattaphalaṃ sacchikatvā phalasamāpattivihārena phāsuvihāro hoti, arahattaṃ pattumasakkontassa paṭipattiṃ pūrayamānassa caratopi phāsuvihāroyeva nāma hoti. Iminā nayena sabbavāresu attho veditabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Naḷakapānasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Goliyānisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "173"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti goliyānisuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padasamācāro"
      },
      "ti dubbalasamācāro oḷārikācāro, paccayesu sāpekkho mahārakkhitatthero ",
      " viya. Taṃ kira upaṭṭhākakule nisinnaṃ upaṭṭhāko āha ‘‘asukattherassa me, bhante, cīvaraṃ dinna’’nti. Sādhu te kataṃ taṃyeva takketvā viharantassa cīvaraṃ dentenāti. Tumhākampi, bhante, dassāmīti. Sādhu karissasi taṃyeva takkentassāti āha. Ayampi evarūpo oḷārikācāro ahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sappatissenā"
      },
      "ti sajeṭṭhakena, na attānaṃ jeṭṭhakaṃ katvā viharitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Serivihārenā"
      },
      "ti sacchandavihārena niraṅkusavihārena."
    ],
    "innerText": "173.Evaṃme sutanti goliyānisuttaṃ. Tattha padasamācāroti dubbalasamācāro oḷārikācāro, paccayesu sāpekkho mahārakkhitatthero viya. Taṃ kira upaṭṭhākakule nisinnaṃ upaṭṭhāko āha ‘‘asukattherassa me, bhante, cīvaraṃ dinna’’nti. Sādhu te kataṃ taṃyeva takketvā viharantassa cīvaraṃ dentenāti. Tumhākampi, bhante, dassāmīti. Sādhu karissasi taṃyeva takkentassāti āha. Ayampi evarūpo oḷārikācāro ahosi. Sappatissenāti sajeṭṭhakena, na attānaṃ jeṭṭhakaṃ katvā viharitabbaṃ. Serivihārenāti sacchandavihārena niraṅkusavihārena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānūpakhajjā"
      },
      "ti na anupakhajja na anupavisitvā. Tattha yo dvīsu mahātheresu ubhato nisinnesu te anāpucchitvāva cīvarena vā jāṇunā vā ghaṭṭento nisīdati, ayaṃ anupakhajja nisīdati nāma. Evaṃ akatvā pana attano pattaāsanasantike ṭhatvā nisīdāvusoti vutte nisīditabbaṃ. Sace na vadanti, nisīdāmi, bhanteti āpucchitvā nisīditabbaṃ āpucchitakālato paṭṭhāya nisīdāti vuttepi avuttepi nisīdituṃ vaṭṭatiyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na paṭibāhissāmī"
      },
      "ti ettha yo attano pattāsanaṃ atikkamitvā navakānaṃ pāpuṇanaṭṭhāne nisīdati, ayaṃ nave bhikkhū ",
      " āsanena paṭibāhati nāma. Tasmiñhi tathā nisinne navā bhikkhū ‘‘amhākaṃ nisīdituṃ na detī’’ti ujjhāyantā tiṭṭhanti vā āsanaṃ vā pariyesantā āhiṇḍanti. Tasmā attano pattāsaneyeva nisīditabbaṃ. Evaṃ na paṭibāhati nāma."
    ],
    "innerText": "Nānūpakhajjāti na anupakhajja na anupavisitvā. Tattha yo dvīsu mahātheresu ubhato nisinnesu te anāpucchitvāva cīvarena vā jāṇunā vā ghaṭṭento nisīdati, ayaṃ anupakhajja nisīdati nāma. Evaṃ akatvā pana attano pattaāsanasantike ṭhatvā nisīdāvusoti vutte nisīditabbaṃ. Sace na vadanti, nisīdāmi, bhanteti āpucchitvā nisīditabbaṃ āpucchitakālato paṭṭhāya nisīdāti vuttepi avuttepi nisīdituṃ vaṭṭatiyeva. Na paṭibāhissāmīti ettha yo attano pattāsanaṃ atikkamitvā navakānaṃ pāpuṇanaṭṭhāne nisīdati, ayaṃ nave bhikkhū āsanena paṭibāhati nāma. Tasmiñhi tathā nisinne navā bhikkhū ‘‘amhākaṃ nisīdituṃ na detī’’ti ujjhāyantā tiṭṭhanti vā āsanaṃ vā pariyesantā āhiṇḍanti. Tasmā attano pattāsaneyeva nisīditabbaṃ. Evaṃ na paṭibāhati nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ābhisamācārikampi dhamma"
      },
      "nti abhisamācārikaṃ vattapaṭipattimattampi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nātikālenā"
      },
      "ti na atipāto pavisitabbaṃ, na atidivā paṭikkamitabbaṃ, bhikkhusaṅghena saddhiṃyeva pavisitabbañca nikkhamitabbañca. Atipāto pavisitvā atidivā nikkhamantassa hi cetiyaṅgaṇabodhiyaṅgaṇavattādīni parihāyanti. Kālasseva mukhaṃ dhovitvā makkaṭakasuttāni chindantena ussāvabindū nipātentena gāmaṃ pavisitvā yāguṃ pariyesitvā yāva bhikkhākālā antogāmeyeva nānappakāraṃ tiracchānakathaṃ kathentena nisīditvā bhattakiccaṃ katvā divā nikkhamma ",
      " bhikkhūnaṃ pādadhovanavelāya vihāraṃ paccāgantabbaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na purebhattaṃ pacchābhattaṃ kulesu cārittaṃ āpajjitabba"
      },
      "nti ‘‘yo pana bhikkhu nimantito sabhatto samāno santaṃ bhikkhuṃ anāpucchā purebhattaṃ vā pacchābhattaṃ vā kulesu cārittaṃ āpajjeyya, aññatra samayā pācittiya’’nti (pāci. 299) imaṃ sikkhāpadaṃ rakkhantena tassa ",
      " vibhaṅge vuttaṃ purebhattañca pacchābhattañca cārittaṃ na āpajjitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddhato hoti capalo"
      },
      "ti uddhaccapakatiko ceva hoti cīvaramaṇḍana-pattamaṇḍana-senāsanamaṇḍanā imassa vā pūtikāyassa kelāyanā maṇḍanāti evaṃ vuttena ca taruṇadārakāvacāpalyena samannāgato."
    ],
    "innerText": "Ābhisamācārikampi dhammanti abhisamācārikaṃ vattapaṭipattimattampi. Nātikālenāti na atipāto pavisitabbaṃ, na atidivā paṭikkamitabbaṃ, bhikkhusaṅghena saddhiṃyeva pavisitabbañca nikkhamitabbañca. Atipāto pavisitvā atidivā nikkhamantassa hi cetiyaṅgaṇabodhiyaṅgaṇavattādīni parihāyanti. Kālasseva mukhaṃ dhovitvā makkaṭakasuttāni chindantena ussāvabindū nipātentena gāmaṃ pavisitvā yāguṃ pariyesitvā yāva bhikkhākālā antogāmeyeva nānappakāraṃ tiracchānakathaṃ kathentena nisīditvā bhattakiccaṃ katvā divā nikkhamma bhikkhūnaṃ pādadhovanavelāya vihāraṃ paccāgantabbaṃ hoti. Na purebhattaṃ pacchābhattaṃ kulesu cārittaṃ āpajjitabbanti ‘‘yo pana bhikkhu nimantito sabhatto samāno santaṃ bhikkhuṃ anāpucchā purebhattaṃ vā pacchābhattaṃ vā kulesu cārittaṃ āpajjeyya, aññatra samayā pācittiya’’nti (pāci. 299) imaṃ sikkhāpadaṃ rakkhantena tassa vibhaṅge vuttaṃ purebhattañca pacchābhattañca cārittaṃ na āpajjitabbaṃ. Uddhato hoti capaloti uddhaccapakatiko ceva hoti cīvaramaṇḍana-pattamaṇḍana-senāsanamaṇḍanā imassa vā pūtikāyassa kelāyanā maṇḍanāti evaṃ vuttena ca taruṇadārakāvacāpalyena samannāgato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññavatā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhavitabba"
      },
      "nti cīvarakammādīsu itikattabbesu upāyapaññāya samannāgatena bhavitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhidhamme abhivinaye"
      },
      "ti abhidhammapiṭake ceva vinayapiṭake ca pāḷivasena ceva aṭṭhakathāvasena ca yogo karaṇīyo. Sabbantimena hi paricchedena abhidhamme dukatikamātikāhi saddhiṃ dhammahadayavibhaṅgaṃ vinā na vaṭṭati. Vinaye pana kammākammavinicchayena saddhiṃ suvinicchitāni dve pātimokkhāni vinā na vaṭṭati."
    ],
    "innerText": "Paññavatābhavitabbanti cīvarakammādīsu itikattabbesu upāyapaññāya samannāgatena bhavitabbaṃ. Abhidhamme abhivinayeti abhidhammapiṭake ceva vinayapiṭake ca pāḷivasena ceva aṭṭhakathāvasena ca yogo karaṇīyo. Sabbantimena hi paricchedena abhidhamme dukatikamātikāhi saddhiṃ dhammahadayavibhaṅgaṃ vinā na vaṭṭati. Vinaye pana kammākammavinicchayena saddhiṃ suvinicchitāni dve pātimokkhāni vinā na vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āruppā"
      },
      "ti ettāvatā aṭṭhapi samāpattiyo vuttā honti. Tā pana sabbena sabbaṃ asakkontena sattasupi yogo karaṇīyo, chasupi…pe… pañcasupi. Sabbantimena paricchedena ekaṃ kasiṇe parikammakammaṭṭhānaṃ paguṇaṃ katvā ādāya vicaritabbaṃ, ettakaṃ vinā na vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttarimanussadhamme"
      },
      "ti iminā sabbepi lokuttaradhamme dasseti. Tasmā arahantena hutvā vihātabbaṃ, arahattaṃ anabhisambhuṇantena anāgāmiphale sakadāgāmiphale sotāpattiphale vā patiṭṭhātabbaṃ. Sabbantimena pariyāyena ekaṃ vipassanāmukhaṃ yāva arahattā paguṇaṃ katvā ādāya vicaritabbaṃ. Sesaṃ sabbattha uttānameva. Imaṃ pana desanaṃ āyasmā sāriputto neyyapuggalassa vasena ābhisamācārikavattato paṭṭhāya anupubbena arahattaṃ pāpetvā niṭṭhāpesīti."
    ],
    "innerText": "Āruppāti ettāvatā aṭṭhapi samāpattiyo vuttā honti. Tā pana sabbena sabbaṃ asakkontena sattasupi yogo karaṇīyo, chasupi…pe… pañcasupi. Sabbantimena paricchedena ekaṃ kasiṇe parikammakammaṭṭhānaṃ paguṇaṃ katvā ādāya vicaritabbaṃ, ettakaṃ vinā na vaṭṭati. Uttarimanussadhammeti iminā sabbepi lokuttaradhamme dasseti. Tasmā arahantena hutvā vihātabbaṃ, arahattaṃ anabhisambhuṇantena anāgāmiphale sakadāgāmiphale sotāpattiphale vā patiṭṭhātabbaṃ. Sabbantimena pariyāyena ekaṃ vipassanāmukhaṃ yāva arahattā paguṇaṃ katvā ādāya vicaritabbaṃ. Sesaṃ sabbattha uttānameva. Imaṃ pana desanaṃ āyasmā sāriputto neyyapuggalassa vasena ābhisamācārikavattato paṭṭhāya anupubbena arahattaṃ pāpetvā niṭṭhāpesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Goliyānisuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Kīṭāgirisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "174"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti kīṭāgirisuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāsīsū"
      },
      "ti evaṃnāmake janapade. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etha tumhepi, bhikkhave"
      },
      "ti etha tumhepi, bhikkhave, ime pañca ānisaṃse ",
      " sampassamānā aññatreva rattibhojanā bhuñjatha. Iti bhagavā rattiṃ vikālabhojanaṃ, divā vikālabhojananti imāni dve bhojanāni ekappahārena ajahāpetvā ekasmiṃ samaye divā vikālabhojanameva jahāpesi, puna kālaṃ atināmetvā rattiṃ vikālabhojanaṃ jahāpento evamāha. Kasmā? Imāni hi dve bhojanāni vattamānāni vaṭṭe āciṇṇāni samāciṇṇāni nadiṃ otiṇṇaudakaṃ viya anupakkhandāni, nivātesu ca gharesu subhojanāni bhuñjitvā vaḍḍhitā sukhumālā kulaputtā dve bhojanāni ekappahārena pajahantā kilamanti. Tasmā ekappahārena ajahāpetvā bhaddālisutte divā vikālabhojanaṃ jahāpesi, idha rattiṃ vikālabhojanaṃ. Jahāpento pana na tajjitvā vā niggaṇhitvā vā, tesaṃ pahānapaccayā pana appābādhatañca sañjānissathāti evaṃ ānisaṃsaṃ dassetvāva jahāpesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kīṭāgirī"
      },
      "ti tassa nigamassa nāmaṃ."
    ],
    "innerText": "174.Evaṃme sutanti kīṭāgirisuttaṃ. Tattha kāsīsūti evaṃnāmake janapade. Etha tumhepi, bhikkhaveti etha tumhepi, bhikkhave, ime pañca ānisaṃse sampassamānā aññatreva rattibhojanā bhuñjatha. Iti bhagavā rattiṃ vikālabhojanaṃ, divā vikālabhojananti imāni dve bhojanāni ekappahārena ajahāpetvā ekasmiṃ samaye divā vikālabhojanameva jahāpesi, puna kālaṃ atināmetvā rattiṃ vikālabhojanaṃ jahāpento evamāha. Kasmā? Imāni hi dve bhojanāni vattamānāni vaṭṭe āciṇṇāni samāciṇṇāni nadiṃ otiṇṇaudakaṃ viya anupakkhandāni, nivātesu ca gharesu subhojanāni bhuñjitvā vaḍḍhitā sukhumālā kulaputtā dve bhojanāni ekappahārena pajahantā kilamanti. Tasmā ekappahārena ajahāpetvā bhaddālisutte divā vikālabhojanaṃ jahāpesi, idha rattiṃ vikālabhojanaṃ. Jahāpento pana na tajjitvā vā niggaṇhitvā vā, tesaṃ pahānapaccayā pana appābādhatañca sañjānissathāti evaṃ ānisaṃsaṃ dassetvāva jahāpesi. Kīṭāgirīti tassa nigamassa nāmaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "175"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assajipunabbasukā"
      },
      "ti assaji ca punabbasuko ca chasu chabbaggiyesu dve gaṇācariyā. Paṇḍuko lohitako mettiyo bhummajako ",
      " assaji punabbasukoti ime cha janā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chabbaggiyā"
      },
      " nāma. Tesu paṇḍukalohitakā attano parisaṃ gahetvā sāvatthiyaṃ vasanti, mettiyabhummajakā rājagahe, ime dve janā kīṭāgirismiṃ āvāsikā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvāsikā"
      },
      "ti nibaddhavāsino, taṃnibandhā akataṃ senāsanaṃ karonti, jiṇṇaṃ paṭisaṅkharonti, kate issarā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kālika"
      },
      "nti anāgate kāle pattabbaṃ ānisaṃsaṃ."
    ],
    "innerText": "175.Assajipunabbasukāti assaji ca punabbasuko ca chasu chabbaggiyesu dve gaṇācariyā. Paṇḍuko lohitako mettiyo bhummajako assaji punabbasukoti ime cha janā chabbaggiyā nāma. Tesu paṇḍukalohitakā attano parisaṃ gahetvā sāvatthiyaṃ vasanti, mettiyabhummajakā rājagahe, ime dve janā kīṭāgirismiṃ āvāsikā honti. Āvāsikāti nibaddhavāsino, taṃnibandhā akataṃ senāsanaṃ karonti, jiṇṇaṃ paṭisaṅkharonti, kate issarā honti. Kālikanti anāgate kāle pattabbaṃ ānisaṃsaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "178"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mayā cetaṃ, bhikkhave"
      },
      "ti idha kiṃ dasseti? Bhikkhave, divasassa tayo vāre bhuñjitvā sukhavedanaṃyeva uppādento na imasmiṃ sāsane kiccakārī nāma hoti, ettakā pana vedanā sevitabbā, ettakā na sevitabbāti etamatthaṃ dassetuṃ imaṃ desanaṃ ārabhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evarūpaṃ sukhavedanaṃ pajahathā"
      },
      "ti idañca gehassitasomanassavasena vuttaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upasampajja viharathā"
      },
      "ti idañca nekkhammasitasomanassavasena ",
      ". Ito paresupi dvīsu vāresu gehassitanekkhammasitānaṃyeva domanassānañca upekkhānañca vasena attho veditabbo."
    ],
    "innerText": "178.Mayā cetaṃ, bhikkhaveti idha kiṃ dasseti? Bhikkhave, divasassa tayo vāre bhuñjitvā sukhavedanaṃyeva uppādento na imasmiṃ sāsane kiccakārī nāma hoti, ettakā pana vedanā sevitabbā, ettakā na sevitabbāti etamatthaṃ dassetuṃ imaṃ desanaṃ ārabhi. Evarūpaṃ sukhavedanaṃ pajahathāti idañca gehassitasomanassavasena vuttaṃ, upasampajja viharathāti idañca nekkhammasitasomanassavasena . Ito paresupi dvīsu vāresu gehassitanekkhammasitānaṃyeva domanassānañca upekkhānañca vasena attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "181"
      },
      ". Evaṃ sevitabbāsevitabbavedanaṃ dassetvā idāni yesaṃ appamādena kiccaṃ kattabbaṃ, yesañca na kattabbaṃ, te dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāhaṃ, bhikkhave"
      },
      ", ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbesaṃyevā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kataṃ tesaṃ appamādenā"
      },
      "ti tesaṃ yaṃ appamādena kattabbaṃ, taṃ kataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anulomikānī"
      },
      "ti paṭipattianulomāni kammaṭṭhānasappāyāni, yattha vasantena sakkā honti maggaphalāni pāpuṇituṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Indriyāni"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samannānayamānā"
      },
      "ti saddhādīni indriyāni samānaṃ kurumānā."
    ],
    "innerText": "181. Evaṃ sevitabbāsevitabbavedanaṃ dassetvā idāni yesaṃ appamādena kiccaṃ kattabbaṃ, yesañca na kattabbaṃ, te dassetuṃ nāhaṃ, bhikkhave, sabbesaṃyevātiādimāha. Tattha kataṃ tesaṃ appamādenāti tesaṃ yaṃ appamādena kattabbaṃ, taṃ kataṃ. Anulomikānīti paṭipattianulomāni kammaṭṭhānasappāyāni, yattha vasantena sakkā honti maggaphalāni pāpuṇituṃ. Indriyānisamannānayamānāti saddhādīni indriyāni samānaṃ kurumānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "182"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattime, bhikkhave, puggalā"
      },
      "ti idha kiṃ dasseti? Yesaṃ appamādena karaṇīyaṃ natthi, te dve honti. Yesaṃ atthi, te pañcāti evaṃ sabbepi ime satta puggalā hontīti imamatthaṃ dasseti."
    ],
    "innerText": "182.Sattime, bhikkhave, puggalāti idha kiṃ dasseti? Yesaṃ appamādena karaṇīyaṃ natthi, te dve honti. Yesaṃ atthi, te pañcāti evaṃ sabbepi ime satta puggalā hontīti imamatthaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ubhatobhāgavimutto"
      },
      "ti dvīhi bhāgehi vimutto. Arūpasamāpattiyā rūpakāyato vimutto, maggena nāmakāyato. So catunnaṃ arūpasamāpattīnaṃ ekekato vuṭṭhāya saṅkhāre sammasitvā arahattaṃ pattānaṃ catunnaṃ, nirodhā vuṭṭhāya arahattaṃ pattaanāgāmino ca vasena pañcavidho hoti. Pāḷi panettha – ‘‘katamo ca puggalo ubhatobhāgavimutto, idhekacco puggalo aṭṭha vimokkhe kāyena phusitvā viharati, paññāya cassa disvā āsavā parikkhīṇā hontī’’ti (pu. pa. 208) evaṃ abhidhamme aṭṭhavimokkhalābhino vasena āgatā."
    ],
    "innerText": "Tattha ubhatobhāgavimuttoti dvīhi bhāgehi vimutto. Arūpasamāpattiyā rūpakāyato vimutto, maggena nāmakāyato. So catunnaṃ arūpasamāpattīnaṃ ekekato vuṭṭhāya saṅkhāre sammasitvā arahattaṃ pattānaṃ catunnaṃ, nirodhā vuṭṭhāya arahattaṃ pattaanāgāmino ca vasena pañcavidho hoti. Pāḷi panettha – ‘‘katamo ca puggalo ubhatobhāgavimutto, idhekacco puggalo aṭṭha vimokkhe kāyena phusitvā viharati, paññāya cassa disvā āsavā parikkhīṇā hontī’’ti (pu. pa. 208) evaṃ abhidhamme aṭṭhavimokkhalābhino vasena āgatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāvimutto"
      },
      "ti paññāya vimutto. So sukkhavipassako, catūhi jhānehi vuṭṭhāya arahattaṃ pattā cattāro cāti imesaṃ vasena pañcavidhova hoti. Pāḷi panettha aṭṭhavimokkhapaṭikkhepavaseneva āgatā. Yathāha – ‘‘na heva kho aṭṭha vimokkhe kāyena phusitvā viharati, paññāya cassa disvā āsavā parikkhīṇā honti. Ayaṃ vuccati puggalo paññāvimutto’’ti."
    ],
    "innerText": "Paññāvimuttoti paññāya vimutto. So sukkhavipassako, catūhi jhānehi vuṭṭhāya arahattaṃ pattā cattāro cāti imesaṃ vasena pañcavidhova hoti. Pāḷi panettha aṭṭhavimokkhapaṭikkhepavaseneva āgatā. Yathāha – ‘‘na heva kho aṭṭha vimokkhe kāyena phusitvā viharati, paññāya cassa disvā āsavā parikkhīṇā honti. Ayaṃ vuccati puggalo paññāvimutto’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Phuṭṭhantaṃ ",
      " sacchikarotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyasakkhī"
      },
      ". Yo jhānaphassaṃ paṭhamaṃ phusati, pacchā nirodhaṃ nibbānaṃ ",
      " sacchikaroti, so sotāpattiphalaṭṭhaṃ ādiṃ katvā yāva arahattamaggaṭṭhā chabbidho hontīti veditabbo. Tenevāha – ‘‘idhekacco puggalo aṭṭha vimokkhe kāyena phusitvā viharati, paññāya cassa disvā ekacce āsavā parikkhīṇā honti. Ayaṃ vuccati puggalo kāyasakkhī’’ti."
    ],
    "innerText": "Phuṭṭhantaṃ sacchikarotīti kāyasakkhī. Yo jhānaphassaṃ paṭhamaṃ phusati, pacchā nirodhaṃ nibbānaṃ sacchikaroti, so sotāpattiphalaṭṭhaṃ ādiṃ katvā yāva arahattamaggaṭṭhā chabbidho hontīti veditabbo. Tenevāha – ‘‘idhekacco puggalo aṭṭha vimokkhe kāyena phusitvā viharati, paññāya cassa disvā ekacce āsavā parikkhīṇā honti. Ayaṃ vuccati puggalo kāyasakkhī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Diṭṭhantaṃ ",
      " pattoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭhippatto"
      },
      ". Tatridaṃ saṅkhepalakkhaṇaṃ – dukkhā saṅkhārā, sukho nirodhoti ñātaṃ hoti diṭṭhaṃ viditaṃ sacchikataṃ phusitaṃ paññāyāti diṭṭhippatto. Vitthārato panesopi kāyasakkhi viya chabbidho hoti. Tenevāha – ‘‘idhekacco puggalo idaṃ dukkhanti yathābhūtaṃ pajānāti…pe… ayaṃ dukkhanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti, tathāgatappaveditā cassa dhammā paññāya vodiṭṭhā honti vocaritā…pe… ayaṃ vuccati puggalo diṭṭhippatto’’ti (pu. pa. 208)."
    ],
    "innerText": "Diṭṭhantaṃ pattoti diṭṭhippatto. Tatridaṃ saṅkhepalakkhaṇaṃ – dukkhā saṅkhārā, sukho nirodhoti ñātaṃ hoti diṭṭhaṃ viditaṃ sacchikataṃ phusitaṃ paññāyāti diṭṭhippatto. Vitthārato panesopi kāyasakkhi viya chabbidho hoti. Tenevāha – ‘‘idhekacco puggalo idaṃ dukkhanti yathābhūtaṃ pajānāti…pe… ayaṃ dukkhanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti, tathāgatappaveditā cassa dhammā paññāya vodiṭṭhā honti vocaritā…pe… ayaṃ vuccati puggalo diṭṭhippatto’’ti (pu. pa. 208)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhāvimutto"
      },
      "ti saddhāya vimutto. Sopi vuttanayeneva chabbidho hoti. Tenevāha – ‘‘idhekacco puggalo idaṃ dukkhanti – yathābhūtaṃ pajānāti…pe… ayaṃ dukkhanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti ",
      ". Tathāgatappaveditā cassa dhammā paññāya vodiṭṭhā honti vocaritā…pe… no ca kho yathā diṭṭhippattassa. Ayaṃ vuccati puggalo saddhāvimutto’’ti (pu. pa. 208). Etesu hi saddhāvimuttassa pubbabhāgamaggakkhaṇe saddahantassa viya okappentassa viya adhimuccantassa viya ca kilesakkhayo hoti, diṭṭhippattassa pubbabhāgamaggakkhaṇe kilesacchedakañāṇaṃ adandhaṃ tikhiṇaṃ sūraṃ hutvā vahati. Tasmā yathā nāma nātitikhiṇena asinā kadaliṃ chindantassa chinnaṭṭhānaṃ na maṭṭhaṃ hoti, asi na sīghaṃ vahati, saddo suyyati, balavataro vāyāmo kātabbo hoti, evarūpā saddhāvimuttassa pubbabhāgamaggabhāvanā. Yathā pana nisitaasinā kadaliṃ chindantassa chinnaṭṭhānaṃ maṭṭhaṃ hoti, asi sīghaṃ vahati, saddo na suyyati, balavavāyāmakiccaṃ na hoti, evarūpā paññāvimuttassa pubbabhāgamaggabhāvanā veditabbā."
    ],
    "innerText": "Saddhāvimuttoti saddhāya vimutto. Sopi vuttanayeneva chabbidho hoti. Tenevāha – ‘‘idhekacco puggalo idaṃ dukkhanti – yathābhūtaṃ pajānāti…pe… ayaṃ dukkhanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti . Tathāgatappaveditā cassa dhammā paññāya vodiṭṭhā honti vocaritā…pe… no ca kho yathā diṭṭhippattassa. Ayaṃ vuccati puggalo saddhāvimutto’’ti (pu. pa. 208). Etesu hi saddhāvimuttassa pubbabhāgamaggakkhaṇe saddahantassa viya okappentassa viya adhimuccantassa viya ca kilesakkhayo hoti, diṭṭhippattassa pubbabhāgamaggakkhaṇe kilesacchedakañāṇaṃ adandhaṃ tikhiṇaṃ sūraṃ hutvā vahati. Tasmā yathā nāma nātitikhiṇena asinā kadaliṃ chindantassa chinnaṭṭhānaṃ na maṭṭhaṃ hoti, asi na sīghaṃ vahati, saddo suyyati, balavataro vāyāmo kātabbo hoti, evarūpā saddhāvimuttassa pubbabhāgamaggabhāvanā. Yathā pana nisitaasinā kadaliṃ chindantassa chinnaṭṭhānaṃ maṭṭhaṃ hoti, asi sīghaṃ vahati, saddo na suyyati, balavavāyāmakiccaṃ na hoti, evarūpā paññāvimuttassa pubbabhāgamaggabhāvanā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dhammaṃ anussaratīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammānusārī"
      },
      ". Dhammoti paññā, paññāpubbaṅgamaṃ maggaṃ bhāvetīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhānusārimhi"
      },
      " ca eseva nayo. Ubho panete sotāpattimaggaṭṭhāyeva. Vuttampi cetaṃ – ‘‘yassa ",
      " puggalassa sotāpattiphalasacchikiriyāya paṭipannassa paññindriyaṃ adhimattaṃ hoti, paññāvāhiṃ paññāpubbaṅgamaṃ ariyamaggaṃ bhāveti ",
      ". Ayaṃ vuccati puggalo dhammānusārī’’ti (pu. pa. 208). Tathā – ‘‘yassa puggalassa sotāpattiphalasacchikiriyāya paṭipannassa saddhindriyaṃ adhimattaṃ hoti, saddhāvāhiṃ saddhāpubbaṅgamaṃ ariyamaggaṃ bhāveti. Ayaṃ vuccati puggalo saddhānusārī’’ti. Ayamettha saṅkhepo. Vitthārato ",
      " panesā ubhatobhāgavimuttādikathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visuddhimagge"
      },
      " paññābhāvanādhikāre vuttā. Tasmā tattha vuttanayeneva veditabbā. Yā panesā etesaṃ vibhāgadassanatthaṃ idha pāḷi āgatā, tattha yasmā rūpasamāpattiyā vinā arūpasamāpattiyo nāma natthi, tasmā āruppāti vuttepi aṭṭha vimokkhā vuttāva hontīti veditabbā."
    ],
    "innerText": "Dhammaṃ anussaratīti dhammānusārī. Dhammoti paññā, paññāpubbaṅgamaṃ maggaṃ bhāvetīti attho. Saddhānusārimhi ca eseva nayo. Ubho panete sotāpattimaggaṭṭhāyeva. Vuttampi cetaṃ – ‘‘yassa puggalassa sotāpattiphalasacchikiriyāya paṭipannassa paññindriyaṃ adhimattaṃ hoti, paññāvāhiṃ paññāpubbaṅgamaṃ ariyamaggaṃ bhāveti . Ayaṃ vuccati puggalo dhammānusārī’’ti (pu. pa. 208). Tathā – ‘‘yassa puggalassa sotāpattiphalasacchikiriyāya paṭipannassa saddhindriyaṃ adhimattaṃ hoti, saddhāvāhiṃ saddhāpubbaṅgamaṃ ariyamaggaṃ bhāveti. Ayaṃ vuccati puggalo saddhānusārī’’ti. Ayamettha saṅkhepo. Vitthārato panesā ubhatobhāgavimuttādikathā visuddhimagge paññābhāvanādhikāre vuttā. Tasmā tattha vuttanayeneva veditabbā. Yā panesā etesaṃ vibhāgadassanatthaṃ idha pāḷi āgatā, tattha yasmā rūpasamāpattiyā vinā arūpasamāpattiyo nāma natthi, tasmā āruppāti vuttepi aṭṭha vimokkhā vuttāva hontīti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyena phusitvā"
      },
      "ti sahajātanāmakāyena phusitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāya cassa disvā"
      },
      "ti paññāya ca etassa ariyasaccadhamme disvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekacce āsavā"
      },
      "ti paṭhamamaggādīhi pahātabbā ekadesaāsavā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathāgatappaveditā"
      },
      "ti tathāgatena paveditā catusaccadhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāya vodiṭṭhā hontī"
      },
      "ti imasmiṃ ṭhāne sīlaṃ kathitaṃ, imasmiṃ samādhi, imasmiṃ vipassanā, imasmiṃ maggo, imasmiṃ phalanti evaṃ atthena atthe kāraṇena kāraṇe ciṇṇacaritattā maggapaññāya sudiṭṭhā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vocaritā"
      },
      "ti vicaritā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhā niviṭṭhā hotī"
      },
      "ti okappanasaddhā patiṭṭhitā hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mattaso nijjhānaṃ khamantī"
      },
      "ti mattāya olokanaṃ khamanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhāmatta"
      },
      "nti saddhāyeva, itaraṃ tasseva vevacanaṃ "
    ],
    "innerText": "Kāyena phusitvāti sahajātanāmakāyena phusitvā. Paññāya cassa disvāti paññāya ca etassa ariyasaccadhamme disvā. Ekacce āsavāti paṭhamamaggādīhi pahātabbā ekadesaāsavā. Tathāgatappaveditāti tathāgatena paveditā catusaccadhammā. Paññāya vodiṭṭhā hontīti imasmiṃ ṭhāne sīlaṃ kathitaṃ, imasmiṃ samādhi, imasmiṃ vipassanā, imasmiṃ maggo, imasmiṃ phalanti evaṃ atthena atthe kāraṇena kāraṇe ciṇṇacaritattā maggapaññāya sudiṭṭhā honti. Vocaritāti vicaritā. Saddhā niviṭṭhā hotīti okappanasaddhā patiṭṭhitā hoti. Mattaso nijjhānaṃ khamantīti mattāya olokanaṃ khamanti. Saddhāmattanti saddhāyeva, itaraṃ tasseva vevacanaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iti imesu appamādena karaṇīyesu puggalesu tayo paṭividdhamaggaphalā sekhā. Tesu anulomasenāsanaṃ sevamānā kalyāṇamitte bhajamānā indriyāni samannānayamānā anupubbena arahattaṃ gaṇhanti. Tasmā tesaṃ yathāṭhitova pāḷiattho. Avasāne pana dve sotāpattimaggasamaṅgino. Tehi tassa maggassa anulomasenāsanaṃ sevitaṃ, kalyāṇamittā bhajitā, indriyāni samannānītāni. Upari pana tiṇṇaṃ maggānaṃ atthāya sevamānā bhajamānā samannānayamānā anupubbena arahattaṃ pāpuṇissantīti ayamettha pāḷiattho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vitaṇḍavādī pana imameva pāḷiṃ gahetvā – ‘‘lokuttaramaggo na ekacittakkhaṇiko, bahucittakkhaṇiko’’ti vadati. So vattabbo – ‘‘yadi aññena cittena senāsanaṃ paṭisevati, aññena ",
      " kalyāṇamitte bhajati, aññena indriyāni samannāneti, aññaṃ maggacittanti sandhāya tvaṃ ‘na ekacittakkhaṇiko maggo, bahucittakkhaṇiko’ti vadasi, evaṃ sante senāsanaṃ sevamāno nīlobhāsaṃ pabbataṃ passati, vanaṃ passati, migapakkhīnaṃ ",
      " saddaṃ suṇāti, pupphaphalānaṃ gandhaṃ ghāyati, pānīyaṃ pivanto rasaṃ sāyati, nisīdanto nipajjanto phassaṃ phusati. Evaṃ te pañcaviññāṇasamaṅgīpi lokuttaradhammasamaṅgīyeva bhavissati. Sace panetaṃ sampaṭicchasi, satthārā saddhiṃ paṭivirujjhasi. Satthārā hi pañcaviññāṇakāyā ekantaṃ abyākatāva vuttā, taṃsamaṅgissa kusalākusalaṃ paṭikkhittaṃ, lokuttaramaggo ca ekantakusalo. Tasmā pajahetaṃ vāda’’nti paññapetabbo. Sace paññattiṃ na upagacchati, ‘‘gaccha pātova vihāraṃ pavisitvā yāguṃ pivāhī’’ti uyyojetabbo."
    ],
    "innerText": "Vitaṇḍavādī pana imameva pāḷiṃ gahetvā – ‘‘lokuttaramaggo na ekacittakkhaṇiko, bahucittakkhaṇiko’’ti vadati. So vattabbo – ‘‘yadi aññena cittena senāsanaṃ paṭisevati, aññena kalyāṇamitte bhajati, aññena indriyāni samannāneti, aññaṃ maggacittanti sandhāya tvaṃ ‘na ekacittakkhaṇiko maggo, bahucittakkhaṇiko’ti vadasi, evaṃ sante senāsanaṃ sevamāno nīlobhāsaṃ pabbataṃ passati, vanaṃ passati, migapakkhīnaṃ saddaṃ suṇāti, pupphaphalānaṃ gandhaṃ ghāyati, pānīyaṃ pivanto rasaṃ sāyati, nisīdanto nipajjanto phassaṃ phusati. Evaṃ te pañcaviññāṇasamaṅgīpi lokuttaradhammasamaṅgīyeva bhavissati. Sace panetaṃ sampaṭicchasi, satthārā saddhiṃ paṭivirujjhasi. Satthārā hi pañcaviññāṇakāyā ekantaṃ abyākatāva vuttā, taṃsamaṅgissa kusalākusalaṃ paṭikkhittaṃ, lokuttaramaggo ca ekantakusalo. Tasmā pajahetaṃ vāda’’nti paññapetabbo. Sace paññattiṃ na upagacchati, ‘‘gaccha pātova vihāraṃ pavisitvā yāguṃ pivāhī’’ti uyyojetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "183"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāhaṃ"
      },
      ", ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhikkhave, ādikenevā"
      },
      "ti ahaṃ, bhikkhave, paṭhamameva maṇḍūkassa uppatitvā gamanaṃ viya aññārādhanaṃ arahatte patiṭṭhānaṃ na vadāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupubbasikkhā"
      },
      "ti karaṇatthe paccattavacanaṃ. Parato padadvayepi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhājāto"
      },
      "ti okappaniyasaddhāya jātasaddho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasaṅkamatī"
      },
      "ti garūnaṃ samīpaṃ gacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Payirupāsatī"
      },
      "ti santike nisīdati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhāretī"
      },
      "ti sādhukaṃ katvā dhāreti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chando jāyatī"
      },
      "ti kattukamyatākusalacchando jāyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ussahatī"
      },
      "ti vīriyaṃ karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tuletī"
      },
      "ti aniccaṃ dukkhaṃ anattāti tulayati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tulayitvā padahatī"
      },
      "ti evaṃ tīraṇavipassanāya tulayanto maggapadhānaṃ padahati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pahitatto"
      },
      "ti pesitacitto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyena ceva paramasacca"
      },
      "nti nāmakāyena nibbānasaccaṃ sacchikaroti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāya cā"
      },
      "ti nāmakāyasampayuttāya maggapaññāya paṭivijjhati passati."
    ],
    "innerText": "183.Nāhaṃ, bhikkhave, ādikenevāti ahaṃ, bhikkhave, paṭhamameva maṇḍūkassa uppatitvā gamanaṃ viya aññārādhanaṃ arahatte patiṭṭhānaṃ na vadāmi. Anupubbasikkhāti karaṇatthe paccattavacanaṃ. Parato padadvayepi eseva nayo. Saddhājātoti okappaniyasaddhāya jātasaddho. Upasaṅkamatīti garūnaṃ samīpaṃ gacchati. Payirupāsatīti santike nisīdati. Dhāretīti sādhukaṃ katvā dhāreti. Chando jāyatīti kattukamyatākusalacchando jāyati. Ussahatīti vīriyaṃ karoti. Tuletīti aniccaṃ dukkhaṃ anattāti tulayati. Tulayitvā padahatīti evaṃ tīraṇavipassanāya tulayanto maggapadhānaṃ padahati. Pahitattoti pesitacitto. Kāyena ceva paramasaccanti nāmakāyena nibbānasaccaṃ sacchikaroti. Paññāya cāti nāmakāyasampayuttāya maggapaññāya paṭivijjhati passati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni yasmā te satthu āgamanaṃ sutvā paccuggamanamattampi na akaṃsu, tasmā tesaṃ cariyaṃ garahanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāpi nāma, bhikkhave, saddhā nāhosī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kīvadūrevime"
      },
      "ti kittakaṃ dūre ṭhāne. Yojanasatampi yojanasahassampi apakkantāti vattuṃ vaṭṭati, na pana kiñci āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catuppadaṃ veyyākaraṇa"
      },
      "nti catusaccabyākaraṇaṃ sandhāya vuttaṃ."
    ],
    "innerText": "Idāni yasmā te satthu āgamanaṃ sutvā paccuggamanamattampi na akaṃsu, tasmā tesaṃ cariyaṃ garahanto sāpi nāma, bhikkhave, saddhā nāhosītiādimāha. Tattha kīvadūrevimeti kittakaṃ dūre ṭhāne. Yojanasatampi yojanasahassampi apakkantāti vattuṃ vaṭṭati, na pana kiñci āha. Catuppadaṃ veyyākaraṇanti catusaccabyākaraṇaṃ sandhāya vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "184"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassuddiṭṭhassā"
      },
      "ti yassa uddiṭṭhassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yopi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "so, bhikkhave, satthā"
      },
      "ti bāhirakasatthāraṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evarūpī"
      },
      "ti evaṃjātikā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇopaṇaviyā"
      },
      "ti paṇaviyā ca opaṇaviyā ca ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na upetī"
      },
      "ti na hoti. Kayavikkayakāle viya agghavaḍḍhanahāpanaṃ na hotīti attho. Ayaṃ goṇo ",
      " kiṃ agghati, vīsati agghatīti bhaṇanto paṇati nāma. Na vīsati agghati, dasa agghatīti bhaṇanto opaṇati nāma. Idaṃ paṭisedhento āha ‘‘paṇopaṇaviyā na upetī’’ti. Idāni taṃ paṇopaṇaviyaṃ dassetuṃ evañca no assa, atha naṃ kareyyāma, na ca no evamassa, na naṃ kareyyāmāti āha."
    ],
    "innerText": "184.Yassuddiṭṭhassāti yassa uddiṭṭhassa. Yopiso, bhikkhave, satthāti bāhirakasatthāraṃ dasseti. Evarūpīti evaṃjātikā. Paṇopaṇaviyāti paṇaviyā ca opaṇaviyā ca . Na upetīti na hoti. Kayavikkayakāle viya agghavaḍḍhanahāpanaṃ na hotīti attho. Ayaṃ goṇo kiṃ agghati, vīsati agghatīti bhaṇanto paṇati nāma. Na vīsati agghati, dasa agghatīti bhaṇanto opaṇati nāma. Idaṃ paṭisedhento āha ‘‘paṇopaṇaviyā na upetī’’ti. Idāni taṃ paṇopaṇaviyaṃ dassetuṃ evañca no assa, atha naṃ kareyyāma, na ca no evamassa, na naṃ kareyyāmāti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiṃ pana, bhikkhave"
      },
      "ti, bhikkhave, yaṃ tathāgato sabbaso āmisehi visaṃsaṭṭho viharati, evaṃ visaṃsaṭṭhassa satthuno evarūpā paṇopaṇaviyā kiṃ yujjissati? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyogāhiya vattato"
      },
      "ti pariyogāhitvā ukkhipitvā gahetvā vattantassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayamanudhammo"
      },
      "ti ayaṃ sabhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jānāti bhagavā, nāhaṃ jānāmī"
      },
      "ti bhagavā ekāsanabhojane ānisaṃsaṃ jānāti, ahaṃ na jānāmīti mayi saddhāya divasassa tayo vāre bhojanaṃ pahāya ekāsanabhojanaṃ bhuñjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ruḷahanīya"
      },
      "nti rohanīyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ojavanta"
      },
      "nti sinehavantaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmaṃ taco cā"
      },
      "ti iminā caturaṅgavīriyaṃ dasseti. Ettha hi taco ekaṃ aṅgaṃ, nhāru ekaṃ, aṭṭhi ekaṃ, maṃsalohitaṃ ekanti evaṃ caturaṅgasamannāgataṃ vīriyaṃ adhiṭṭhahitvā arahattaṃ appatvā na vuṭṭhahissāmīti evaṃ paṭipajjatīti ",
      " dasseti. Sesaṃ sabbattha uttānameva. Desanaṃ pana bhagavā neyyapuggalassa vasena arahattanikūṭena niṭṭhāpesīti."
    ],
    "innerText": "Kiṃ pana, bhikkhaveti, bhikkhave, yaṃ tathāgato sabbaso āmisehi visaṃsaṭṭho viharati, evaṃ visaṃsaṭṭhassa satthuno evarūpā paṇopaṇaviyā kiṃ yujjissati? Pariyogāhiya vattatoti pariyogāhitvā ukkhipitvā gahetvā vattantassa. Ayamanudhammoti ayaṃ sabhāvo. Jānāti bhagavā, nāhaṃ jānāmīti bhagavā ekāsanabhojane ānisaṃsaṃ jānāti, ahaṃ na jānāmīti mayi saddhāya divasassa tayo vāre bhojanaṃ pahāya ekāsanabhojanaṃ bhuñjati. Ruḷahanīyanti rohanīyaṃ. Ojavantanti sinehavantaṃ. Kāmaṃ taco cāti iminā caturaṅgavīriyaṃ dasseti. Ettha hi taco ekaṃ aṅgaṃ, nhāru ekaṃ, aṭṭhi ekaṃ, maṃsalohitaṃ ekanti evaṃ caturaṅgasamannāgataṃ vīriyaṃ adhiṭṭhahitvā arahattaṃ appatvā na vuṭṭhahissāmīti evaṃ paṭipajjatīti dasseti. Sesaṃ sabbattha uttānameva. Desanaṃ pana bhagavā neyyapuggalassa vasena arahattanikūṭena niṭṭhāpesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kīṭāgirisuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyavaggavaṇṇanā niṭṭhitā."
  }
]