[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammāsambuddhassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "nikaya"
    },
    "innerText": "Majjhimanikāye"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "book"
    },
    "innerText": "Mūlapaṇṇāsa-ṭīkā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(Paṭhamo bhāgo)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subsubhead"
    },
    "innerText": "Ganthārambhakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Saṃvaṇṇanārambhe ",
      " ratanattayavandanā saṃvaṇṇetabbassa dhammassa pabhavanissayavisuddhipaṭivedanatthaṃ, taṃ pana dhammasaṃvaṇṇanāsu viññūnaṃ bahumānuppādanatthaṃ, taṃ sammadeva tesaṃ uggahadhāraṇādikkamaladdhabbāya sammāpaṭipattiyā sabbahitasukhanipphādanatthaṃ. Atha vā maṅgalabhāvato, sabbakiriyāsu pubbakiccabhāvato, paṇḍitehi samācaritabhāvato, āyatiṃ paresaṃ diṭṭhānugatiāpajjanato ca saṃvaṇṇanāyaṃ ratanattayapaṇāmakiriyā. Atha vā ratanattayapaṇāmakaraṇaṃ pūjanīyapūjāpuññavisesanibbattanatthaṃ. Taṃ attano yathāladdhasampattinimittakassa kammassa balānuppadānatthaṃ. Antarā ca tassa asaṅkocanatthaṃ. Tadubhayaṃ anantarāyena aṭṭhakathāya parisamāpanatthaṃ. Idameva ca payojanaṃ ācariyena idhādhippetaṃ. Tathā hi vakkhati ‘‘iti me pasannamatino…pe… tassānubhāvenā’’ti. Vatthuttayapūjāhi niratisayapuññakkhettasaṃbuddhiyā aparimeyyapabhāvo puññātisayoti bahuvidhantarāyepi lokasannivāse ",
      " antarāyanibandhanasakalasaṃkilesaviddhaṃsanāya pahoti. Bhayādiupaddavañca nivāreti. Yathāha –"
    ],
    "innerText": "1. Saṃvaṇṇanārambhe ratanattayavandanā saṃvaṇṇetabbassa dhammassa pabhavanissayavisuddhipaṭivedanatthaṃ, taṃ pana dhammasaṃvaṇṇanāsu viññūnaṃ bahumānuppādanatthaṃ, taṃ sammadeva tesaṃ uggahadhāraṇādikkamaladdhabbāya sammāpaṭipattiyā sabbahitasukhanipphādanatthaṃ. Atha vā maṅgalabhāvato, sabbakiriyāsu pubbakiccabhāvato, paṇḍitehi samācaritabhāvato, āyatiṃ paresaṃ diṭṭhānugatiāpajjanato ca saṃvaṇṇanāyaṃ ratanattayapaṇāmakiriyā. Atha vā ratanattayapaṇāmakaraṇaṃ pūjanīyapūjāpuññavisesanibbattanatthaṃ. Taṃ attano yathāladdhasampattinimittakassa kammassa balānuppadānatthaṃ. Antarā ca tassa asaṅkocanatthaṃ. Tadubhayaṃ anantarāyena aṭṭhakathāya parisamāpanatthaṃ. Idameva ca payojanaṃ ācariyena idhādhippetaṃ. Tathā hi vakkhati ‘‘iti me pasannamatino…pe… tassānubhāvenā’’ti. Vatthuttayapūjāhi niratisayapuññakkhettasaṃbuddhiyā aparimeyyapabhāvo puññātisayoti bahuvidhantarāyepi lokasannivāse antarāyanibandhanasakalasaṃkilesaviddhaṃsanāya pahoti. Bhayādiupaddavañca nivāreti. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pūjārahe pūjayato. Buddhe yadi va sāvake’’tiādi (dha. pa. 195; apa. 1.10.1), tathā ",
      " –"
    ],
    "innerText": "‘‘Pūjārahe pūjayato. Buddhe yadi va sāvake’’tiādi (dha. pa. 195; apa. 1.10.1), tathā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ye, bhikkhave, buddhe pasannā, agge te pasannā, agge kho pana pasannānaṃ aggo vipāko hotī’’tiādi (itivu. 90, 91),"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Buddhoti kittayantassa, kāye bhavati yā pīti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Varameva hi sā pīti, kasiṇenapi jambudīpassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dhammoti kittayantassa…pe… kasiṇenapi jambudīpassa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saṅghoti kittayantassa…pe… kasiṇenapi jambudīpassā’’ti. (itivu. aṭṭha. 90),"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tathā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yasmiṃ mahānāma samaye ariyasāvako tathāgataṃ anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosa…pe… na mohapariyuṭṭhitaṃ cittaṃ hotī’’tiādi (a. ni. 6.10; 11.11),"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Araññe rukkhamūle vā…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Bhayaṃ vā chambhitattaṃ vā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Lomahaṃso na hessatī’’ti ca. (saṃ. ni. 2.249);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yassa vatthuttayassa vandanaṃ kattukāmo, tassa guṇātisayayogasandassanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘karuṇāsītalahadaya’’"
      },
      "ntiādinā gāthāttayamāha. Guṇātisayayogena hi vandanārahabhāvo, vandanārahe ca katā vandanā yathādhippetaṃ payojanaṃ sādhetīti. Tattha yassā desanāya saṃvaṇṇanaṃ kattukāmo. Sā na vinayadesanā viya karuṇāppadhānā, nāpi abhidhammadesanā viya paññāppadhānā ",
      ", atha kho karuṇāpaññāppadhānāti tadubhayappadhānameva tāva sammāsambuddhassa thomanaṃ kātuṃ tammūlakattā sesaratanānaṃ ‘‘karuṇāsītalahadaya’’ntiādi vuttaṃ. Tattha kiratīti karuṇā, paradukkhaṃ vikkhipati apanetīti attho. Atha vā kiṇātīti karuṇā, paradukkhe sati kāruṇikaṃ hiṃsati vibādhatīti attho. Paradukkhe sati sādhūnaṃ kampanaṃ hadayakhedaṃ karotīti vā karuṇā. Atha vā kamiti sukhaṃ, taṃ rundhatīti karuṇā. Esā hi paradukkhāpanayanakāmatālakkhaṇā attasukhanirapekkhatāya kāruṇikānaṃ sukhaṃ rundhati vibandhatīti attho ",
      ". Karuṇāya sītalaṃ karuṇāsītalaṃ, karuṇāsītalaṃ hadayaṃ assāti karuṇāsītalahadayo, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karuṇāsītalahadayaṃ"
      },
      "."
    ],
    "innerText": "Tattha yassa vatthuttayassa vandanaṃ kattukāmo, tassa guṇātisayayogasandassanatthaṃ ‘‘karuṇāsītalahadaya’’ntiādinā gāthāttayamāha. Guṇātisayayogena hi vandanārahabhāvo, vandanārahe ca katā vandanā yathādhippetaṃ payojanaṃ sādhetīti. Tattha yassā desanāya saṃvaṇṇanaṃ kattukāmo. Sā na vinayadesanā viya karuṇāppadhānā, nāpi abhidhammadesanā viya paññāppadhānā , atha kho karuṇāpaññāppadhānāti tadubhayappadhānameva tāva sammāsambuddhassa thomanaṃ kātuṃ tammūlakattā sesaratanānaṃ ‘‘karuṇāsītalahadaya’’ntiādi vuttaṃ. Tattha kiratīti karuṇā, paradukkhaṃ vikkhipati apanetīti attho. Atha vā kiṇātīti karuṇā, paradukkhe sati kāruṇikaṃ hiṃsati vibādhatīti attho. Paradukkhe sati sādhūnaṃ kampanaṃ hadayakhedaṃ karotīti vā karuṇā. Atha vā kamiti sukhaṃ, taṃ rundhatīti karuṇā. Esā hi paradukkhāpanayanakāmatālakkhaṇā attasukhanirapekkhatāya kāruṇikānaṃ sukhaṃ rundhati vibandhatīti attho . Karuṇāya sītalaṃ karuṇāsītalaṃ, karuṇāsītalaṃ hadayaṃ assāti karuṇāsītalahadayo, taṃ karuṇāsītalahadayaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha kiñcāpi paresaṃ hitopasaṃhārasukhādiaparihānicchanasabhāvatāya, byāpādāratīnaṃ ujuvipaccanīkatāya ca parasattasantānagatasantāpavicchedanākārappavattiyā mettāmuditānampi cittasītalabhāvakāraṇatā upalabbhati, tathāpi paradukkhāpanayanākārappavattiyā parūpatāpāsahanarasā avihiṃsābhūtā karuṇāva visesena bhagavato cittassa cittapassaddhi viya sītibhāvanimittanti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘karuṇāsītalahadaya’’"
      },
      "nti. Karuṇāmukhena vā mettāmuditānampi hadayasītalabhāvakāraṇatā vuttāti daṭṭhabbaṃ. Atha vā asādhāraṇañāṇavisesanibandhanabhūtā sātisayaṃ niravasesañca sabbaññutaññāṇaṃ viya savisayabyāpitāya mahākaruṇābhāvaṃ upagatā karuṇāva bhagavato atisayena hadayasītalabhāvahetūti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘karuṇāsītalahadaya’’"
      },
      "nti. Atha vā satipi mettāmuditānaṃ sātisaye hadayasītibhāvanibandhanatte sakalabuddhaguṇavisesakāraṇatāya tāsampi kāraṇanti karuṇāva bhagavato ‘‘hadayasītalabhāvakāraṇa’’nti vuttā. Karuṇānidānā hi sabbepi buddhaguṇā. Karuṇānubhāvanibbāpiyamānasaṃsāradukkhasantāpassa hi bhagavato paradukkhāpanayanakāmatāya anekānipi asaṅkhyeyyāni kappānaṃ akilantarūpasseva niravasesabuddhakaradhammasambharaṇaniratassa samadhigatadhammādhipateyyassa ca sannihitesupi sattasaṅkhārasamupanītahadayūpatāpanimittesu na īsakampi cittasītibhāvassa aññathattamahosīti. Etasmiñca atthavikappe tīsupi avatthāsu bhagavato karuṇā saṅgahitāti daṭṭhabbaṃ."
    ],
    "innerText": "Tattha kiñcāpi paresaṃ hitopasaṃhārasukhādiaparihānicchanasabhāvatāya, byāpādāratīnaṃ ujuvipaccanīkatāya ca parasattasantānagatasantāpavicchedanākārappavattiyā mettāmuditānampi cittasītalabhāvakāraṇatā upalabbhati, tathāpi paradukkhāpanayanākārappavattiyā parūpatāpāsahanarasā avihiṃsābhūtā karuṇāva visesena bhagavato cittassa cittapassaddhi viya sītibhāvanimittanti vuttaṃ ‘‘karuṇāsītalahadaya’’nti. Karuṇāmukhena vā mettāmuditānampi hadayasītalabhāvakāraṇatā vuttāti daṭṭhabbaṃ. Atha vā asādhāraṇañāṇavisesanibandhanabhūtā sātisayaṃ niravasesañca sabbaññutaññāṇaṃ viya savisayabyāpitāya mahākaruṇābhāvaṃ upagatā karuṇāva bhagavato atisayena hadayasītalabhāvahetūti āha ‘‘karuṇāsītalahadaya’’nti. Atha vā satipi mettāmuditānaṃ sātisaye hadayasītibhāvanibandhanatte sakalabuddhaguṇavisesakāraṇatāya tāsampi kāraṇanti karuṇāva bhagavato ‘‘hadayasītalabhāvakāraṇa’’nti vuttā. Karuṇānidānā hi sabbepi buddhaguṇā. Karuṇānubhāvanibbāpiyamānasaṃsāradukkhasantāpassa hi bhagavato paradukkhāpanayanakāmatāya anekānipi asaṅkhyeyyāni kappānaṃ akilantarūpasseva niravasesabuddhakaradhammasambharaṇaniratassa samadhigatadhammādhipateyyassa ca sannihitesupi sattasaṅkhārasamupanītahadayūpatāpanimittesu na īsakampi cittasītibhāvassa aññathattamahosīti. Etasmiñca atthavikappe tīsupi avatthāsu bhagavato karuṇā saṅgahitāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pajānātīti paññā, yathāsabhāvaṃ pakārehi paṭivijjhatīti attho. Paññāva ñeyyāvaraṇappahānato pakārehi dhammasabhāvajotanaṭṭhena pajjototi paññāpajjoto. Savāsanappahānato visesena hataṃ samugghātitaṃ vihataṃ, paññāpajjotena vihataṃ paññāpajjotavihataṃ. Muyhanti tena, sayaṃ vā muyhati, mohanamattameva vā tanti moho, avijjā, sveva visayasabhāvapaṭicchādanato andhakārasarikkhatāya tamo viyāti tamo, paññāpajjotavihato ",
      " mohatamo etassāti paññāpajjotavihatamohatamo, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāpajjotavihatamohatamaṃ"
      },
      ". Sabbesampi ",
      " hi khīṇāsavānaṃ satipi paññāpajjotena avijjandhakārassa vihatabhāve saddhāvimuttehi viya diṭṭhippattānaṃ sāvakehi paccekasambuddhehi ca savāsanappahānena sammāsambuddhānaṃ kilesappahānassa viseso vijjatīti sātisayena avijjāpahānena bhagavantaṃ thomento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paññāpajjotavihatamohatama’’"
      },
      "nti."
    ],
    "innerText": "Pajānātīti paññā, yathāsabhāvaṃ pakārehi paṭivijjhatīti attho. Paññāva ñeyyāvaraṇappahānato pakārehi dhammasabhāvajotanaṭṭhena pajjototi paññāpajjoto. Savāsanappahānato visesena hataṃ samugghātitaṃ vihataṃ, paññāpajjotena vihataṃ paññāpajjotavihataṃ. Muyhanti tena, sayaṃ vā muyhati, mohanamattameva vā tanti moho, avijjā, sveva visayasabhāvapaṭicchādanato andhakārasarikkhatāya tamo viyāti tamo, paññāpajjotavihato mohatamo etassāti paññāpajjotavihatamohatamo, taṃ paññāpajjotavihatamohatamaṃ. Sabbesampi hi khīṇāsavānaṃ satipi paññāpajjotena avijjandhakārassa vihatabhāve saddhāvimuttehi viya diṭṭhippattānaṃ sāvakehi paccekasambuddhehi ca savāsanappahānena sammāsambuddhānaṃ kilesappahānassa viseso vijjatīti sātisayena avijjāpahānena bhagavantaṃ thomento āha ‘‘paññāpajjotavihatamohatama’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā antarena paropadesaṃ attano santāne accantaṃ avijjandhakāravigamassa nibbattitattā, tathā sabbaññutāya balesu ca vasībhāvassa samadhigatattā, parasantatiyañca dhammadesanātisayānubhāvena sammadeva tassa pavattitattā bhagavāva visesato mohatamavigamena thometabboti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paññāpajjotavihatamohatama’’"
      },
      "nti. Imasmiñca atthavikappe ‘‘paññāpajjoto’’ti padena bhagavato paṭivedhapaññā viya desanāpaññāpi sāmaññaniddesena, ekasesanayena vā saṅgahitāti daṭṭhabbaṃ."
    ],
    "innerText": "Atha vā antarena paropadesaṃ attano santāne accantaṃ avijjandhakāravigamassa nibbattitattā, tathā sabbaññutāya balesu ca vasībhāvassa samadhigatattā, parasantatiyañca dhammadesanātisayānubhāvena sammadeva tassa pavattitattā bhagavāva visesato mohatamavigamena thometabboti āha ‘‘paññāpajjotavihatamohatama’’nti. Imasmiñca atthavikappe ‘‘paññāpajjoto’’ti padena bhagavato paṭivedhapaññā viya desanāpaññāpi sāmaññaniddesena, ekasesanayena vā saṅgahitāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā bhagavato ñāṇassa ñeyyapariyantikattā sakalañeyyadhammasabhāvāvabodhanasamatthena anāvaraṇañāṇasaṅkhātena paññāpajjotena sabbañeyyadhammasabhāvacchādakassa mohandhakārassa vidhamitattā anaññasādhāraṇo bhagavato mohatamavināsoti katvā vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paññāpajjotavihatamohatama’’"
      },
      "nti. Ettha ca mohatamavidhamanante adhigatattā anāvaraṇañāṇaṃ kāraṇūpacārena sasantāne mohatamavidhamananti daṭṭhabbaṃ. Abhinīhārasampattiyā savāsanappahānameva hi kilesānaṃ ñeyyāvaraṇappahānanti, parasantāne pana mohatamavidhamanassa kāraṇabhāvato anāvaraṇañāṇaṃ ‘‘mohatamavidhamana’’nti vuccatīti."
    ],
    "innerText": "Atha vā bhagavato ñāṇassa ñeyyapariyantikattā sakalañeyyadhammasabhāvāvabodhanasamatthena anāvaraṇañāṇasaṅkhātena paññāpajjotena sabbañeyyadhammasabhāvacchādakassa mohandhakārassa vidhamitattā anaññasādhāraṇo bhagavato mohatamavināsoti katvā vuttaṃ ‘‘paññāpajjotavihatamohatama’’nti. Ettha ca mohatamavidhamanante adhigatattā anāvaraṇañāṇaṃ kāraṇūpacārena sasantāne mohatamavidhamananti daṭṭhabbaṃ. Abhinīhārasampattiyā savāsanappahānameva hi kilesānaṃ ñeyyāvaraṇappahānanti, parasantāne pana mohatamavidhamanassa kāraṇabhāvato anāvaraṇañāṇaṃ ‘‘mohatamavidhamana’’nti vuccatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kiṃ pana kāraṇaṃ avijjāsamugghātoyeveko pahānasampattivasena bhagavato thomanānimittaṃ gayhati, na pana sātisayaṃ niravasesakilesappahānanti? Tappahānavacaneneva tadekaṭṭhatāya sakalasaṃkilesagaṇasamugghātassa jotitabhāvato. Na hi so tādiso kileso atthi, yo niravasesaavijjāppahānena na pahīyatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā vijjā viya sakalakusaladhammasamuppattiyā niravasesākusaladhammanibbattiyā saṃsārappavattiyā ca avijjā padhānakāraṇanti tabbighātavacanena ",
      " sakalasaṃkilesagaṇasamugghāto vuttoyeva hotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paññāpajjotavihatamohatama’’"
      },
      "nti."
    ],
    "innerText": "Atha vā vijjā viya sakalakusaladhammasamuppattiyā niravasesākusaladhammanibbattiyā saṃsārappavattiyā ca avijjā padhānakāraṇanti tabbighātavacanena sakalasaṃkilesagaṇasamugghāto vuttoyeva hotīti vuttaṃ ‘‘paññāpajjotavihatamohatama’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Narā ",
      " ca amarā ca narāmarā, saha narāmarehīti sanarāmaro, sanarāmaro ca so loko cāti sanarāmaraloko. Tassa garūti sanarāmaralokagaru, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sanarāmaralokagaruṃ"
      },
      ". Etena devamanussānaṃ viya tadavasiṭṭhasattānampi yathārahaṃ guṇavisesāvahatāya bhagavato upakāritaṃ dasseti. Na cettha padhānāppadhānabhāvo codetabbo. Añño hi saddakkamo, añño atthakkamo. Edisesu hi samāsapadesu padhānampi appadhānaṃ viya niddisīyati yathā ‘‘sarājikāya parisāyā’’ti (cūḷava. 336). Kāmañcettha sattasaṅkhārokāsavasena tividho loko, garubhāvassa pana adhippetattā garukaraṇasamatthasseva yujjanato sattalokassa vasena attho gahetabbo. So hi lokīyanti ettha puññapāpāni tabbipāko cāti ‘‘loko’’ti vuccati. Amaraggahaṇena cettha upapattidevā adhippetā."
    ],
    "innerText": "Narā ca amarā ca narāmarā, saha narāmarehīti sanarāmaro, sanarāmaro ca so loko cāti sanarāmaraloko. Tassa garūti sanarāmaralokagaru, taṃ sanarāmaralokagaruṃ. Etena devamanussānaṃ viya tadavasiṭṭhasattānampi yathārahaṃ guṇavisesāvahatāya bhagavato upakāritaṃ dasseti. Na cettha padhānāppadhānabhāvo codetabbo. Añño hi saddakkamo, añño atthakkamo. Edisesu hi samāsapadesu padhānampi appadhānaṃ viya niddisīyati yathā ‘‘sarājikāya parisāyā’’ti (cūḷava. 336). Kāmañcettha sattasaṅkhārokāsavasena tividho loko, garubhāvassa pana adhippetattā garukaraṇasamatthasseva yujjanato sattalokassa vasena attho gahetabbo. So hi lokīyanti ettha puññapāpāni tabbipāko cāti ‘‘loko’’ti vuccati. Amaraggahaṇena cettha upapattidevā adhippetā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā samūhattho lokasaddo samudāyavasena lokīyati paññāpīyatīti. Saha narehīti sanarā, sanarā ca te amarā cāti sanarāmarā, tesaṃ lokoti sanarāmaralokoti purimanayeneva yojetabbaṃ. Amarasaddena cettha visuddhidevāpi saṅgayhanti. Te hi maraṇābhāvato paramatthato amarā. Narāmarānaṃyeva ca gahaṇaṃ ukkaṭṭhaniddesavasena yathā ‘‘satthā devamanussāna’’nti (dī. ni. 1.157). Tathā hi sabbānatthaparihārapubbaṅgamāya niravasesahitasukhavidhānatapparāya niratisayāya payogasampattiyā sadevamanussāya pajāya accantūpakāritāya aparimitanirupamappabhāvaguṇavisesasamaṅgitāya ca sabbasattuttamo bhagavā aparimāṇāsu lokadhātūsu aparimāṇānaṃ sattānaṃ uttamagāravaṭṭhānaṃ. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sanarāmaralokagaru’’"
      },
      "nti."
    ],
    "innerText": "Atha vā samūhattho lokasaddo samudāyavasena lokīyati paññāpīyatīti. Saha narehīti sanarā, sanarā ca te amarā cāti sanarāmarā, tesaṃ lokoti sanarāmaralokoti purimanayeneva yojetabbaṃ. Amarasaddena cettha visuddhidevāpi saṅgayhanti. Te hi maraṇābhāvato paramatthato amarā. Narāmarānaṃyeva ca gahaṇaṃ ukkaṭṭhaniddesavasena yathā ‘‘satthā devamanussāna’’nti (dī. ni. 1.157). Tathā hi sabbānatthaparihārapubbaṅgamāya niravasesahitasukhavidhānatapparāya niratisayāya payogasampattiyā sadevamanussāya pajāya accantūpakāritāya aparimitanirupamappabhāvaguṇavisesasamaṅgitāya ca sabbasattuttamo bhagavā aparimāṇāsu lokadhātūsu aparimāṇānaṃ sattānaṃ uttamagāravaṭṭhānaṃ. Tena vuttaṃ ‘‘sanarāmaralokagaru’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sobhanaṃ gataṃ gamanaṃ etassāti sugato. Bhagavato hi veneyyajanupasaṅkamanaṃ ekantena tesaṃ hitasukhanipphādanato sobhanaṃ, tathā ",
      " lakkhaṇānubyañjanapaṭimaṇḍitarūpakāyatāya dutavilambita-khalitānukaḍḍhana-nippīḷanukkuṭika-kuṭilākulatādi-dosarahita-mavahasita-rājahaṃsa- vasabhavāraṇa-migarājagamanaṃ kāyagamanaṃ ñāṇagamanañca vipulanimmalakaruṇā-sativīriyādi-guṇavisesasahitamabhinīhārato yāva mahābodhiṃ anavajjatāya sobhanamevāti. Atha vā sayambhuñāṇena sakalamapi lokaṃ pariññābhisamayavasena parijānanto ñāṇena sammā gato avagatoti sugato. Tathā lokasamudayaṃ pahānābhisamayavasena pajahanto anuppattidhammataṃ āpādento sammā gato atītoti sugato, lokanirodhaṃ nibbānaṃ sacchikiriyābhisamayavasena sammā gato adhigatoti sugato, lokanirodhagāminiṃ paṭipadaṃ bhāvanābhisamayavasena sammā gato paṭipannoti sugato. ‘‘Sotāpattimaggena ye kilesā pahīnā, te kilese na puneti na pacceti na paccāgacchatīti sugato’’tiādinā (mahāni. 38; cūḷani. 27) nayena ayamattho ",
      " vibhāvetabbo. Atha vā sundaraṃ ṭhānaṃ sammāsambodhiṃ, nibbānameva vā gato adhigatoti sugato. Yasmā vā bhūtaṃ tacchaṃ atthasaṃhitaṃ veneyyānaṃ yathārahaṃ kālayuttameva ca dhammaṃ bhāsati, tasmā sammā gadati vadatīti sugato da-kārassa ta-kāraṃ katvā. Iti sobhanagamanatādīhi sugato, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugataṃ"
      },
      "."
    ],
    "innerText": "Sobhanaṃ gataṃ gamanaṃ etassāti sugato. Bhagavato hi veneyyajanupasaṅkamanaṃ ekantena tesaṃ hitasukhanipphādanato sobhanaṃ, tathā lakkhaṇānubyañjanapaṭimaṇḍitarūpakāyatāya dutavilambita-khalitānukaḍḍhana-nippīḷanukkuṭika-kuṭilākulatādi-dosarahita-mavahasita-rājahaṃsa- vasabhavāraṇa-migarājagamanaṃ kāyagamanaṃ ñāṇagamanañca vipulanimmalakaruṇā-sativīriyādi-guṇavisesasahitamabhinīhārato yāva mahābodhiṃ anavajjatāya sobhanamevāti. Atha vā sayambhuñāṇena sakalamapi lokaṃ pariññābhisamayavasena parijānanto ñāṇena sammā gato avagatoti sugato. Tathā lokasamudayaṃ pahānābhisamayavasena pajahanto anuppattidhammataṃ āpādento sammā gato atītoti sugato, lokanirodhaṃ nibbānaṃ sacchikiriyābhisamayavasena sammā gato adhigatoti sugato, lokanirodhagāminiṃ paṭipadaṃ bhāvanābhisamayavasena sammā gato paṭipannoti sugato. ‘‘Sotāpattimaggena ye kilesā pahīnā, te kilese na puneti na pacceti na paccāgacchatīti sugato’’tiādinā (mahāni. 38; cūḷani. 27) nayena ayamattho vibhāvetabbo. Atha vā sundaraṃ ṭhānaṃ sammāsambodhiṃ, nibbānameva vā gato adhigatoti sugato. Yasmā vā bhūtaṃ tacchaṃ atthasaṃhitaṃ veneyyānaṃ yathārahaṃ kālayuttameva ca dhammaṃ bhāsati, tasmā sammā gadati vadatīti sugato da-kārassa ta-kāraṃ katvā. Iti sobhanagamanatādīhi sugato, taṃ sugataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puññapāpakammehi upapajjanavasena gantabbato gatiyo, upapattibhavavisesā. Tā pana nirayādivasena pañcavidhā. Tāhi sakalassapi bhavagāmikammassa ariyamaggādhigamena avipākārahabhāvakaraṇena nivattitattā bhagavā pañcahipi gatīhi suṭṭhu mutto visaṃyuttoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘gativimutta’’"
      },
      "nti. Etena bhagavato katthacipi gatiyā apariyāpannataṃ dasseti, yato bhagavā ‘‘devātidevo’’ti vuccati. Tenevāha –"
    ],
    "innerText": "Puññapāpakammehi upapajjanavasena gantabbato gatiyo, upapattibhavavisesā. Tā pana nirayādivasena pañcavidhā. Tāhi sakalassapi bhavagāmikammassa ariyamaggādhigamena avipākārahabhāvakaraṇena nivattitattā bhagavā pañcahipi gatīhi suṭṭhu mutto visaṃyuttoti āha ‘‘gativimutta’’nti. Etena bhagavato katthacipi gatiyā apariyāpannataṃ dasseti, yato bhagavā ‘‘devātidevo’’ti vuccati. Tenevāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yena devūpapatyassa, gandhabbo vā vihaṅgamo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Yakkhattaṃ yena gaccheyyaṃ, manussattañca abbaje;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Te mayhaṃ āsavā khīṇā, viddhastā vinaḷīkatā’’ti. (a. ni. 4.36);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Taṃtaṃgatisaṃvattanakānañhi kammakilesānaṃ aggamaggena bodhimūleyeva suppahīnattā natthi bhagavato gatipariyāpannatāti accantameva bhagavā sabbabhavayonigati-viññāṇaṭṭhiti-sattāvāsa-sattanikāyehi parimutto, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gativimuttaṃ. Vande"
      },
      "ti namāmi, thomemīti vā attho."
    ],
    "innerText": "Taṃtaṃgatisaṃvattanakānañhi kammakilesānaṃ aggamaggena bodhimūleyeva suppahīnattā natthi bhagavato gatipariyāpannatāti accantameva bhagavā sabbabhavayonigati-viññāṇaṭṭhiti-sattāvāsa-sattanikāyehi parimutto, taṃ gativimuttaṃ. Vandeti namāmi, thomemīti vā attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gativimutta"
      },
      "nti anupādisesanibbānadhātuppattiyā bhagavantaṃ thometi. Ettha hi dvīhi ākārehi bhagavato thomanā veditabbā attahitasampattito parahitapaṭipattito ca. Tesu attahitasampatti anāvaraṇañāṇādhigamato savāsanānaṃ sabbesaṃ kilesānaṃ accantappahānato anupādisesanibbānappattito ca veditabbā, parahitapaṭipatti lābhasakkārādinirapekkhacittassa sabbadukkhaniyyānikadhammadesanato viruddhesupi niccaṃ hitajjhāsayato ñāṇaparipākakālāgamanato ca. Sā panettha āsayato payogato ca duvidhā parahitapaṭipatti, tividhā ca attahitasampatti pakāsitā hoti. Kathaṃ? ‘‘Karuṇāsītalahadaya’’nti etena āsayato parahitapaṭipatti, sammāgadanatthena sugatasaddena payogato parahitapaṭipatti, ‘‘paññāpajjotavihatamohatamaṃ gativimutta’’nti etehi catusaccapaṭivedhatthena ca sugatasaddena tividhāpi attahitasampatti, avasiṭṭhaṭṭhena ",
      " tena ‘‘paññāpajjotavihatamohatama’’nti etena cāpi sabbāpi attahitasampattiparahitapaṭipatti pakāsitā hotīti."
    ],
    "innerText": "Atha vā gativimuttanti anupādisesanibbānadhātuppattiyā bhagavantaṃ thometi. Ettha hi dvīhi ākārehi bhagavato thomanā veditabbā attahitasampattito parahitapaṭipattito ca. Tesu attahitasampatti anāvaraṇañāṇādhigamato savāsanānaṃ sabbesaṃ kilesānaṃ accantappahānato anupādisesanibbānappattito ca veditabbā, parahitapaṭipatti lābhasakkārādinirapekkhacittassa sabbadukkhaniyyānikadhammadesanato viruddhesupi niccaṃ hitajjhāsayato ñāṇaparipākakālāgamanato ca. Sā panettha āsayato payogato ca duvidhā parahitapaṭipatti, tividhā ca attahitasampatti pakāsitā hoti. Kathaṃ? ‘‘Karuṇāsītalahadaya’’nti etena āsayato parahitapaṭipatti, sammāgadanatthena sugatasaddena payogato parahitapaṭipatti, ‘‘paññāpajjotavihatamohatamaṃ gativimutta’’nti etehi catusaccapaṭivedhatthena ca sugatasaddena tividhāpi attahitasampatti, avasiṭṭhaṭṭhena tena ‘‘paññāpajjotavihatamohatama’’nti etena cāpi sabbāpi attahitasampattiparahitapaṭipatti pakāsitā hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā tīhi ākārehi bhagavato thomanā veditabbā – hetuto phalato upakārato ca. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetu"
      },
      " mahākaruṇā, sā paṭhamapadena dassitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phalaṃ"
      },
      " catubbidhaṃ ñāṇasampadā pahānasampadā ānubhāvasampadā rūpakāyasampadā cāti. Tāsu ñāṇapahānasampadā dutiyapadena saccapaṭivedhatthena ca sugatasaddena pakāsitā honti, ānubhāvasampadā pana tatiyapadena, rūpakāyasampadā yathāvuttakāyagamanasobhanatthena sugatasaddena lakkhaṇānubyañjanapāripūriyā vinā tadabhāvato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upakāro"
      },
      " anantaraṃ abāhiraṃ karitvā tividhayānamukhena vimuttidhammadesanā. So sammāgadanatthena sugatasaddena pakāsito hotīti veditabbaṃ."
    ],
    "innerText": "Atha vā tīhi ākārehi bhagavato thomanā veditabbā – hetuto phalato upakārato ca. Tattha hetu mahākaruṇā, sā paṭhamapadena dassitā. Phalaṃ catubbidhaṃ ñāṇasampadā pahānasampadā ānubhāvasampadā rūpakāyasampadā cāti. Tāsu ñāṇapahānasampadā dutiyapadena saccapaṭivedhatthena ca sugatasaddena pakāsitā honti, ānubhāvasampadā pana tatiyapadena, rūpakāyasampadā yathāvuttakāyagamanasobhanatthena sugatasaddena lakkhaṇānubyañjanapāripūriyā vinā tadabhāvato. Upakāro anantaraṃ abāhiraṃ karitvā tividhayānamukhena vimuttidhammadesanā. So sammāgadanatthena sugatasaddena pakāsito hotīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ‘‘karuṇāsītalahadaya’’nti etena sammāsambodhiyā mūlaṃ dasseti. Mahākaruṇāsañcoditamānaso hi bhagavā saṃsārapaṅkato sattānaṃ samuddharaṇatthaṃ katābhinīhāro anupubbena pāramiyo pūretvā anuttaraṃ sammāsambodhiṃ adhigatoti karuṇā sammāsambodhiyā mūlaṃ. ‘‘Paññāpajjotavihatamohatama’’nti etena sammāsambodhiṃ dasseti ",
      ". Anāvaraṇañāṇapadaṭṭhānañhi maggañāṇaṃ, maggañāṇapadaṭṭhānañca anāvaraṇañāṇaṃ ‘‘sammāsambodhī’’ti vuccatīti. Sammāgamanatthena sugatasaddena sammāsambodhiyā paṭipattiṃ dasseti līnuddhaccapatiṭṭhānāyūhanakāmasukhallikattakilamathānuyogasassatucchedābhinivesādi antadvayarahitāya karuṇāpaññāpariggahitāya majjhimāya paṭipattiyā pakāsanato sugatasaddassa. Itarehi sammāsambodhiyā padhānāppadhānabhedaṃ payojanaṃ dasseti. Saṃsāramahoghato sattasantāraṇañhettha padhānaṃ payojanaṃ, tadaññamappadhānaṃ. Tesu padhānena parahitapaṭipattiṃ dasseti, itarena attahitasampattiṃ, tadubhayena attahitāya paṭipannādīsu catūsu puggalesu bhagavato catutthapuggalabhāvaṃ dasseti. Tena ca anuttaradakkhiṇeyyabhāvaṃ uttamavandanīyabhāvaṃ attano ca vandanakiriyāya khettaṅgatabhāvaṃ dasseti."
    ],
    "innerText": "Tattha ‘‘karuṇāsītalahadaya’’nti etena sammāsambodhiyā mūlaṃ dasseti. Mahākaruṇāsañcoditamānaso hi bhagavā saṃsārapaṅkato sattānaṃ samuddharaṇatthaṃ katābhinīhāro anupubbena pāramiyo pūretvā anuttaraṃ sammāsambodhiṃ adhigatoti karuṇā sammāsambodhiyā mūlaṃ. ‘‘Paññāpajjotavihatamohatama’’nti etena sammāsambodhiṃ dasseti . Anāvaraṇañāṇapadaṭṭhānañhi maggañāṇaṃ, maggañāṇapadaṭṭhānañca anāvaraṇañāṇaṃ ‘‘sammāsambodhī’’ti vuccatīti. Sammāgamanatthena sugatasaddena sammāsambodhiyā paṭipattiṃ dasseti līnuddhaccapatiṭṭhānāyūhanakāmasukhallikattakilamathānuyogasassatucchedābhinivesādi antadvayarahitāya karuṇāpaññāpariggahitāya majjhimāya paṭipattiyā pakāsanato sugatasaddassa. Itarehi sammāsambodhiyā padhānāppadhānabhedaṃ payojanaṃ dasseti. Saṃsāramahoghato sattasantāraṇañhettha padhānaṃ payojanaṃ, tadaññamappadhānaṃ. Tesu padhānena parahitapaṭipattiṃ dasseti, itarena attahitasampattiṃ, tadubhayena attahitāya paṭipannādīsu catūsu puggalesu bhagavato catutthapuggalabhāvaṃ dasseti. Tena ca anuttaradakkhiṇeyyabhāvaṃ uttamavandanīyabhāvaṃ attano ca vandanakiriyāya khettaṅgatabhāvaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca karuṇāgahaṇena lokiyesu mahaggatabhāvappattāsādhāraṇaguṇadīpanato bhagavato sabbalokiyaguṇasampatti dassitā hoti, paññāgahaṇena sabbaññutaññāṇapadaṭṭhānamaggañāṇadīpanato sabbalokuttaraguṇasampatti. Tadubhayaggahaṇasiddho hi attho ‘‘sanarāmaralokagaru’’ntiādinā vipañcīyatīti. Karuṇāgahaṇena ca upagamanaṃ nirupakkilesaṃ dasseti, paññāgahaṇena apagamanaṃ. Tathā karuṇāgahaṇena lokasamaññānurūpaṃ bhagavato pavattiṃ dasseti lokavohāravisayattā ",
      " karuṇāya, paññāgahaṇena samaññāya anatidhāvanaṃ sabhāvānavabodhena hi dhammānaṃ samaññaṃ atidhāvitvā sattādiparāmasanaṃ hotīti. Tathā karuṇāgahaṇena mahākaruṇāsamāpattivihāraṃ dasseti, paññāgahaṇena tīsu kālesu appaṭihatañāṇaṃ catusaccañāṇaṃ catupaṭisambhidāñāṇaṃ catuvesārajjañāṇaṃ."
    ],
    "innerText": "Ettha ca karuṇāgahaṇena lokiyesu mahaggatabhāvappattāsādhāraṇaguṇadīpanato bhagavato sabbalokiyaguṇasampatti dassitā hoti, paññāgahaṇena sabbaññutaññāṇapadaṭṭhānamaggañāṇadīpanato sabbalokuttaraguṇasampatti. Tadubhayaggahaṇasiddho hi attho ‘‘sanarāmaralokagaru’’ntiādinā vipañcīyatīti. Karuṇāgahaṇena ca upagamanaṃ nirupakkilesaṃ dasseti, paññāgahaṇena apagamanaṃ. Tathā karuṇāgahaṇena lokasamaññānurūpaṃ bhagavato pavattiṃ dasseti lokavohāravisayattā karuṇāya, paññāgahaṇena samaññāya anatidhāvanaṃ sabhāvānavabodhena hi dhammānaṃ samaññaṃ atidhāvitvā sattādiparāmasanaṃ hotīti. Tathā karuṇāgahaṇena mahākaruṇāsamāpattivihāraṃ dasseti, paññāgahaṇena tīsu kālesu appaṭihatañāṇaṃ catusaccañāṇaṃ catupaṭisambhidāñāṇaṃ catuvesārajjañāṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Karuṇāgahaṇena mahākaruṇāsamāpattiñāṇassa gahitattā sesāsādhāraṇañāṇāni, cha abhiññā, aṭṭhasu parisāsu akampanañāṇāni, dasa balāni, cuddasa buddhañāṇāni, soḷasa ñāṇacariyā, aṭṭhārasa buddhadhammā, catucattālīsa ñāṇavatthūni, sattasattatiñāṇavatthūnīti evamādīnaṃ anekesaṃ paññāpabhedānaṃ vasena ñāṇacāraṃ dasseti. Tathā karuṇāgahaṇena caraṇasampattiṃ, paññāgahaṇena vijjāsampattiṃ. Karuṇāgahaṇena attādhipatitā, paññāgahaṇena dhammādhipatitā. Karuṇāgahaṇena lokanāthabhāvo, paññāgahaṇena ",
      " attanāthabhāvo. Tathā karuṇāgahaṇena pubbakāribhāvo, paññāgahaṇena kataññutā. Tathā karuṇāgahaṇena aparantapatā, paññāgahaṇena anattantapatā. Karuṇāgahaṇena vā buddhakaradhammasiddhi, paññāgahaṇena buddhabhāvasiddhi. Tathā karuṇāgahaṇena paresaṃ tāraṇaṃ, paññāgahaṇena sayaṃ taraṇaṃ. Tathā karuṇāgahaṇena sabbasattesu anuggahacittatā, paññāgahaṇena sabbadhammesu virattacittatā dassitā hoti."
    ],
    "innerText": "Karuṇāgahaṇena mahākaruṇāsamāpattiñāṇassa gahitattā sesāsādhāraṇañāṇāni, cha abhiññā, aṭṭhasu parisāsu akampanañāṇāni, dasa balāni, cuddasa buddhañāṇāni, soḷasa ñāṇacariyā, aṭṭhārasa buddhadhammā, catucattālīsa ñāṇavatthūni, sattasattatiñāṇavatthūnīti evamādīnaṃ anekesaṃ paññāpabhedānaṃ vasena ñāṇacāraṃ dasseti. Tathā karuṇāgahaṇena caraṇasampattiṃ, paññāgahaṇena vijjāsampattiṃ. Karuṇāgahaṇena attādhipatitā, paññāgahaṇena dhammādhipatitā. Karuṇāgahaṇena lokanāthabhāvo, paññāgahaṇena attanāthabhāvo. Tathā karuṇāgahaṇena pubbakāribhāvo, paññāgahaṇena kataññutā. Tathā karuṇāgahaṇena aparantapatā, paññāgahaṇena anattantapatā. Karuṇāgahaṇena vā buddhakaradhammasiddhi, paññāgahaṇena buddhabhāvasiddhi. Tathā karuṇāgahaṇena paresaṃ tāraṇaṃ, paññāgahaṇena sayaṃ taraṇaṃ. Tathā karuṇāgahaṇena sabbasattesu anuggahacittatā, paññāgahaṇena sabbadhammesu virattacittatā dassitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sabbesañca buddhaguṇānaṃ karuṇā ādi tannidānabhāvato, paññā pariyosānaṃ tato uttari karaṇīyābhāvato. Iti ādipariyosānadassanena sabbe buddhaguṇā dassitā honti. Tathā karuṇāgahaṇena sīlakkhandhapubbaṅgamo samādhikkhandho dassito hoti. Karuṇānidānañhi sīlaṃ tato pāṇātipātādiviratippavattito, sā ca jhānattayasampayoginīti. Paññāvacanena paññākkhandho. Sīlañca sabbabuddhaguṇānaṃ ādi, samādhi majjhe, paññā pariyosānanti evampi ādimajjhapariyosānakalyāṇadassanena sabbe buddhaguṇā dassitā honti nayato dassitattā. Eso eva hi niravasesato buddhaguṇānaṃ dassanupāyo, yadidaṃ nayaggāhaṇaṃ. Aññathā ko nāma samattho bhagavato guṇe anupadaṃ niravasesato dassetuṃ. Tenevāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Buddhopi buddhassa bhaṇeyya vaṇṇaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kappampi ce aññamabhāsamāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Khīyetha ",
      " kappo ciradīghamantare;"
    ],
    "innerText": "Khīyetha kappo ciradīghamantare;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vaṇṇo na khīyetha tathāgatassā’’ti. (dī. ni. aṭṭha. 1.305; 3.141; ma. ni. aṭṭha. 2.425; udā. aṭṭha. 53; apa. aṭṭha. 2.7.20; bu. vaṃ. aṭṭha. 4.4; cariyā. aṭṭha. 3.122 pakiṇṇakakathā);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Teneva ca āyasmatā sāriputtattherenapi buddhaguṇaparicchedanaṃ pati anuyuttena ‘‘no hetaṃ, bhante’’ti paṭikkhipitvā ‘‘apica me, bhante, dhammanvayo vidito’’ti (dī. ni. 2.146) vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Evaṃ saṅkhepena sakalasabbaññuguṇehi bhagavantaṃ abhitthavitvā idāni saddhammaṃ thometuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘buddhopī’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddho"
      },
      "ti kattuniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddhabhāva"
      },
      "nti kammaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvetvā sacchikatvā"
      },
      "ti ca pubbakālakiriyāniddeso ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ya"
      },
      "nti aniyamato kammaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upagato"
      },
      "ti aparakālakiriyāniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vande"
      },
      "ti kiriyāniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ta"
      },
      "nti niyamanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhamma"
      },
      "nti vandanakiriyāya kammaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gatamalaṃ anuttara"
      },
      "nti ca tabbisesanaṃ."
    ],
    "innerText": "2. Evaṃ saṅkhepena sakalasabbaññuguṇehi bhagavantaṃ abhitthavitvā idāni saddhammaṃ thometuṃ ‘‘buddhopī’’tiādimāha. Tattha buddhoti kattuniddeso. Buddhabhāvanti kammaniddeso. Bhāvetvā sacchikatvāti ca pubbakālakiriyāniddeso . Yanti aniyamato kammaniddeso. Upagatoti aparakālakiriyāniddeso. Vandeti kiriyāniddeso. Tanti niyamanaṃ. Dhammanti vandanakiriyāya kammaniddeso. Gatamalaṃ anuttaranti ca tabbisesanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha buddhasaddassa tāva ‘‘bujjhitā saccānīti buddho, bodhetā pajāyāti buddho’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niddesanayena"
      },
      " (mahāni. 192; cūḷani. 97) attho veditabbo. Atha vā savāsanāya aññāṇaniddāya accantavigamato, buddhiyā vā vikasitabhāvato buddhavāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddho"
      },
      " jāgaraṇavikasanatthavasena. Atha vā kassacipi ñeyyadhammassa anavabuddhassa abhāvena ñeyyavisesassa kammabhāvena aggahaṇato kammavacanicchāya abhāvena avagamanatthavaseneva kattuniddeso labbhatīti buddhavāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddho"
      },
      " yathā ‘‘dikkhito na dadātī’’ti. Atthato pana pāramitāparibhāvito sayambhuñāṇena saha vāsanāya vihataviddhastaniravasesakileso mahākaruṇāsabbaññutaññāṇādiaparimeyyaguṇagaṇādhāro khandhasantāno buddho. Yathāha –"
    ],
    "innerText": "Tattha buddhasaddassa tāva ‘‘bujjhitā saccānīti buddho, bodhetā pajāyāti buddho’’tiādinā niddesanayena (mahāni. 192; cūḷani. 97) attho veditabbo. Atha vā savāsanāya aññāṇaniddāya accantavigamato, buddhiyā vā vikasitabhāvato buddhavāti buddho jāgaraṇavikasanatthavasena. Atha vā kassacipi ñeyyadhammassa anavabuddhassa abhāvena ñeyyavisesassa kammabhāvena aggahaṇato kammavacanicchāya abhāvena avagamanatthavaseneva kattuniddeso labbhatīti buddhavāti buddho yathā ‘‘dikkhito na dadātī’’ti. Atthato pana pāramitāparibhāvito sayambhuñāṇena saha vāsanāya vihataviddhastaniravasesakileso mahākaruṇāsabbaññutaññāṇādiaparimeyyaguṇagaṇādhāro khandhasantāno buddho. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Buddhoti yo so bhagavā sayambhū. Anācariyako pubbe ananussutesu dhammesu sāmaṃ saccāni abhisambujjhi, tattha ca sabbaññutaṃ patto balesu ca vasībhāva’’nti (mahāni. 192; cūḷani. 97; paṭi. ma. 3.161)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Api"
      },
      "-saddo ",
      " sambhāvane. Tena ‘‘evaṃ guṇavisesayutto sopi nāma bhagavā’’ti vakkhamānaguṇe dhamme sambhāvanaṃ dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddhabhāva"
      },
      "nti sammāsambodhiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvetvā"
      },
      "ti uppādetvā vaḍḍhetvā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacchikatvā"
      },
      "ti paccakkhaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upagato"
      },
      "ti patto, adhigatoti attho. Etassa ‘‘buddhabhāva’’nti etena sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gatamala"
      },
      "nti vigatamalaṃ, niddosanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vande"
      },
      "ti paṇamāmi, thomemi vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuttara"
      },
      "nti uttararahitaṃ, lokuttaranti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhamma"
      },
      "nti yathānusiṭṭhaṃ paṭipajjamāne apāyato ca saṃsārato ca apatamāne katvā dhāretīti dhammo. Ayañhettha saṅkhepattho – evaṃ vividhaguṇagaṇasamannāgato buddhopi bhagavā yaṃ ariyamaggasaṅkhātaṃ dhammaṃ bhāvetvā, phalanibbānasaṅkhātaṃ pana sacchikatvā anuttaraṃ sammāsambodhiṃ adhigato, tametaṃ buddhānampi buddhabhāvahetubhūtaṃ sabbadosamalarahitaṃ attano uttaritarābhāvena anuttaraṃ paṭivedhasaddhammaṃ namāmīti. Pariyattisaddhammassāpi tappakāsanattā idha saṅgaho daṭṭhabbo."
    ],
    "innerText": "Api-saddo sambhāvane. Tena ‘‘evaṃ guṇavisesayutto sopi nāma bhagavā’’ti vakkhamānaguṇe dhamme sambhāvanaṃ dīpeti. Buddhabhāvanti sammāsambodhiṃ. Bhāvetvāti uppādetvā vaḍḍhetvā ca. Sacchikatvāti paccakkhaṃ katvā. Upagatoti patto, adhigatoti attho. Etassa ‘‘buddhabhāva’’nti etena sambandho. Gatamalanti vigatamalaṃ, niddosanti attho. Vandeti paṇamāmi, thomemi vā. Anuttaranti uttararahitaṃ, lokuttaranti attho. Dhammanti yathānusiṭṭhaṃ paṭipajjamāne apāyato ca saṃsārato ca apatamāne katvā dhāretīti dhammo. Ayañhettha saṅkhepattho – evaṃ vividhaguṇagaṇasamannāgato buddhopi bhagavā yaṃ ariyamaggasaṅkhātaṃ dhammaṃ bhāvetvā, phalanibbānasaṅkhātaṃ pana sacchikatvā anuttaraṃ sammāsambodhiṃ adhigato, tametaṃ buddhānampi buddhabhāvahetubhūtaṃ sabbadosamalarahitaṃ attano uttaritarābhāvena anuttaraṃ paṭivedhasaddhammaṃ namāmīti. Pariyattisaddhammassāpi tappakāsanattā idha saṅgaho daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " vā ‘‘abhidhammanayasamuddaṃ adhigacchi, tīṇi piṭakāni sammasī’’ti ca aṭṭhakathāyaṃ vuttattā pariyattidhammassapi sacchikiriyāsammasanapariyāyo labbhatīti sopi idha vutto evāti daṭṭhabbaṃ. Tathā ‘‘yaṃ dhammaṃ bhāvetvā saccikatvā’’ti ca vuttattā buddhakaradhammabhūtāhi pāramitāhi saha pubbabhāge adhisīlasikkhādayopi idha dhammasaddena saṅgahitāti veditabbaṃ. Tāpi hi malapaṭipakkhatāya gatamalā anaññasādhāraṇatāya anuttarā cāti. Tathā hi sattānaṃ sakalavaṭṭadukkhanissaraṇatthāya katamahābhinīhāro mahākaruṇādhivāsapesalajjhāsayo paññāvisesaparidhotanimmalānaṃ dānadamasaṃyamādīnaṃ uttamadhammānaṃ satasahassādhikāni kappānaṃ cattāri asaṅkhyeyyāni sakkaccaṃ nirantaraṃ niravasesānaṃ bhāvanāpaccakkhakaraṇehi kammādīsu adhigatavasībhāvo acchariyācinteyyamahānubhāvo adhisīlādhicittānaṃ paramukkaṃsapāramippatto bhagavā paccayākāre catuvīsatikoṭisatasahassamukhena mahāvajirañāṇaṃ pesetvā anuttaraṃ sammāsambodhiṃ abhisambuddhoti."
    ],
    "innerText": "Atha vā ‘‘abhidhammanayasamuddaṃ adhigacchi, tīṇi piṭakāni sammasī’’ti ca aṭṭhakathāyaṃ vuttattā pariyattidhammassapi sacchikiriyāsammasanapariyāyo labbhatīti sopi idha vutto evāti daṭṭhabbaṃ. Tathā ‘‘yaṃ dhammaṃ bhāvetvā saccikatvā’’ti ca vuttattā buddhakaradhammabhūtāhi pāramitāhi saha pubbabhāge adhisīlasikkhādayopi idha dhammasaddena saṅgahitāti veditabbaṃ. Tāpi hi malapaṭipakkhatāya gatamalā anaññasādhāraṇatāya anuttarā cāti. Tathā hi sattānaṃ sakalavaṭṭadukkhanissaraṇatthāya katamahābhinīhāro mahākaruṇādhivāsapesalajjhāsayo paññāvisesaparidhotanimmalānaṃ dānadamasaṃyamādīnaṃ uttamadhammānaṃ satasahassādhikāni kappānaṃ cattāri asaṅkhyeyyāni sakkaccaṃ nirantaraṃ niravasesānaṃ bhāvanāpaccakkhakaraṇehi kammādīsu adhigatavasībhāvo acchariyācinteyyamahānubhāvo adhisīlādhicittānaṃ paramukkaṃsapāramippatto bhagavā paccayākāre catuvīsatikoṭisatasahassamukhena mahāvajirañāṇaṃ pesetvā anuttaraṃ sammāsambodhiṃ abhisambuddhoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca ‘‘bhāvetvā’’ti etena vijjāsampadāya dhammaṃ thometi, ‘‘sacchikatvā’’ti etena vimuttisampadāya. Tathā paṭhamena jhānasampadāya, dutiyena vimokkhasampadāya. Paṭhamena vā samādhisampadāya, dutiyena samāpattisampadāya. Atha vā paṭhamena khayeñāṇabhāvena, dutiyena anuppādeñāṇabhāvena. Purimena vā vijjūpamatāya, dutiyena vajirūpamatāya. Purimena vā virāgasampattiyā, dutiyena nirodhasampattiyā. Tathā paṭhamena niyyānabhāvena, dutiyena nisssaraṇabhāvena. Paṭhamena vā hetubhāvena, dutiyena asaṅkhatabhāvena. Paṭhamena vā dassanabhāvena, dutiyena vivekabhāvena. Paṭhamena vā adhipatibhāvena, dutiyena amatabhāvena dhammaṃ ",
      " thometi. Atha vā ‘‘yaṃ dhammaṃ bhāvetvā buddhabhāvaṃ upagato’’ti etena svākkhātatāya dhammaṃ thometi. ‘‘Sacchikatvā’’ti etena sandiṭṭhikatāya. Tathā purimena akālikatāya, pacchimena ehipassikatāya. Purimena vā opaneyyikatāya, pacchimena paccattaṃ veditabbatāya dhammaṃ thometi. ‘‘Gatamala’’nti iminā saṃkilesābhāvadīpanena dhammassa parisuddhataṃ dasseti, ‘‘anuttara’’nti etena aññassa visiṭṭhassa abhāvadīpanena vipulaparipuṇṇataṃ. Paṭhamena vā pahānasampadaṃ dhammassa dasseti, dutiyena sabhāvasampadaṃ. Bhāvetabbatāya vā dhammassa gatamalabhāvo yojetabbo ",
      ". Bhāvanāguṇena hi so dosānaṃ samugghātako hotīti. Sacchikātabbabhāvena anuttarabhāvo yojetabbo. Sacchikiriyānibbattito hi taduttarikaraṇīyābhāvato anaññasādhāraṇatāya anuttaroti. Tathā ‘‘bhāvetvā’’ti etena saha pubbabhāgasīlādīhi sekkhā sīlasamādhipaññākkhandhā dassitā honti, ‘‘sacchikatvā’’ti etena saha asaṅkhatāya dhātuyā asekkhā sīlasamādhipaññākkhandhā dassitā hontīti."
    ],
    "innerText": "Ettha ca ‘‘bhāvetvā’’ti etena vijjāsampadāya dhammaṃ thometi, ‘‘sacchikatvā’’ti etena vimuttisampadāya. Tathā paṭhamena jhānasampadāya, dutiyena vimokkhasampadāya. Paṭhamena vā samādhisampadāya, dutiyena samāpattisampadāya. Atha vā paṭhamena khayeñāṇabhāvena, dutiyena anuppādeñāṇabhāvena. Purimena vā vijjūpamatāya, dutiyena vajirūpamatāya. Purimena vā virāgasampattiyā, dutiyena nirodhasampattiyā. Tathā paṭhamena niyyānabhāvena, dutiyena nisssaraṇabhāvena. Paṭhamena vā hetubhāvena, dutiyena asaṅkhatabhāvena. Paṭhamena vā dassanabhāvena, dutiyena vivekabhāvena. Paṭhamena vā adhipatibhāvena, dutiyena amatabhāvena dhammaṃ thometi. Atha vā ‘‘yaṃ dhammaṃ bhāvetvā buddhabhāvaṃ upagato’’ti etena svākkhātatāya dhammaṃ thometi. ‘‘Sacchikatvā’’ti etena sandiṭṭhikatāya. Tathā purimena akālikatāya, pacchimena ehipassikatāya. Purimena vā opaneyyikatāya, pacchimena paccattaṃ veditabbatāya dhammaṃ thometi. ‘‘Gatamala’’nti iminā saṃkilesābhāvadīpanena dhammassa parisuddhataṃ dasseti, ‘‘anuttara’’nti etena aññassa visiṭṭhassa abhāvadīpanena vipulaparipuṇṇataṃ. Paṭhamena vā pahānasampadaṃ dhammassa dasseti, dutiyena sabhāvasampadaṃ. Bhāvetabbatāya vā dhammassa gatamalabhāvo yojetabbo . Bhāvanāguṇena hi so dosānaṃ samugghātako hotīti. Sacchikātabbabhāvena anuttarabhāvo yojetabbo. Sacchikiriyānibbattito hi taduttarikaraṇīyābhāvato anaññasādhāraṇatāya anuttaroti. Tathā ‘‘bhāvetvā’’ti etena saha pubbabhāgasīlādīhi sekkhā sīlasamādhipaññākkhandhā dassitā honti, ‘‘sacchikatvā’’ti etena saha asaṅkhatāya dhātuyā asekkhā sīlasamādhipaññākkhandhā dassitā hontīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Evaṃ saṅkhepeneva sabbadhammaguṇehi saddhammaṃ abhitthavitvā idāni ariyasaṅghaṃ thometuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sugatassā’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugatassā"
      },
      "ti sambandhaniddeso, tassa ‘‘puttāna’’nti etena sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Orasāna"
      },
      "nti puttavisesanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mārasenamathanāna"
      },
      "nti orasaputtabhāve kāraṇaniddeso. Tena kilesappahānameva bhagavato orasaputtabhāve kāraṇaṃ anujānātīti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhanna"
      },
      "nti gaṇanaparicchedaniddeso. Tena satipi tesaṃ sattavisesabhāvena anekasahassasaṅkhābhāve imaṃ gaṇanaparicchedaṃ nātivattantīti dasseti maggaṭṭhaphalaṭṭhabhāvānātivattanato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samūha"
      },
      "nti samudāyaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ariyasaṅgha"
      },
      "nti guṇavisiṭṭhasaṅghāṭabhāvaniddeso. Tena asabhipi ariyapuggalānaṃ kāyasāmaggiyaṃ ariyasaṅghabhāvaṃ dasseti diṭṭhisīlasāmaññena saṃhatabhāvato."
    ],
    "innerText": "3. Evaṃ saṅkhepeneva sabbadhammaguṇehi saddhammaṃ abhitthavitvā idāni ariyasaṅghaṃ thometuṃ ‘‘sugatassā’’tiādimāha. Tattha sugatassāti sambandhaniddeso, tassa ‘‘puttāna’’nti etena sambandho. Orasānanti puttavisesanaṃ. Mārasenamathanānanti orasaputtabhāve kāraṇaniddeso. Tena kilesappahānameva bhagavato orasaputtabhāve kāraṇaṃ anujānātīti dasseti. Aṭṭhannanti gaṇanaparicchedaniddeso. Tena satipi tesaṃ sattavisesabhāvena anekasahassasaṅkhābhāve imaṃ gaṇanaparicchedaṃ nātivattantīti dasseti maggaṭṭhaphalaṭṭhabhāvānātivattanato. Samūhanti samudāyaniddeso. Ariyasaṅghanti guṇavisiṭṭhasaṅghāṭabhāvaniddeso. Tena asabhipi ariyapuggalānaṃ kāyasāmaggiyaṃ ariyasaṅghabhāvaṃ dasseti diṭṭhisīlasāmaññena saṃhatabhāvato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha urasi bhavā jātā saṃvaddhā ca orasā. Yathā hi sattānaṃ orasaputtā attajātatāya pitu santakassa dāyajjassa visesena bhāgino honti, evameva tepi ariyapuggalā sammāsambuddhassa dhammassavanante ariyāya jātiyā jātatāya bhagavato santakassa vimuttisukhassa ariyadhammaratanassa ca ekantabhāginoti orasā viya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "orasā"
      },
      ". Atha vā bhagavato dhammadesanānubhāvena ariyabhūmiṃ okkamamānā okkantā ca ariyasāvakā bhagavato urena vāyāmajanitābhijātitāya nippariyāyena ‘‘orasaputtā’’ti vattabbataṃ arahanti. Sāvakehi pavattiyamānāpi hi dhammadesanā ‘‘bhagavato dhammadesanā’’icceva vuccati taṃmūlikattā lakkhaṇādivisesābhāvato ca."
    ],
    "innerText": "Tattha urasi bhavā jātā saṃvaddhā ca orasā. Yathā hi sattānaṃ orasaputtā attajātatāya pitu santakassa dāyajjassa visesena bhāgino honti, evameva tepi ariyapuggalā sammāsambuddhassa dhammassavanante ariyāya jātiyā jātatāya bhagavato santakassa vimuttisukhassa ariyadhammaratanassa ca ekantabhāginoti orasā viya orasā. Atha vā bhagavato dhammadesanānubhāvena ariyabhūmiṃ okkamamānā okkantā ca ariyasāvakā bhagavato urena vāyāmajanitābhijātitāya nippariyāyena ‘‘orasaputtā’’ti vattabbataṃ arahanti. Sāvakehi pavattiyamānāpi hi dhammadesanā ‘‘bhagavato dhammadesanā’’icceva vuccati taṃmūlikattā lakkhaṇādivisesābhāvato ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadipi ",
      " ariyasāvakānaṃ ariyamaggādhigamasamaye bhagavato viya tadantarāya karaṇatthaṃ devaputtamāro, māravāhinī vā na ekantena apasādeti, tehi pana apasādetabbatāya kāraṇe vimathite tepi vimathitā eva nāma hontīti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘mārasenamathanāna’’"
      },
      "nti. Imasmiṃ panatthe ‘‘māramārasenamathanāna’’nti vattabbe ‘‘mārasenamathanāna’’nti ekadesasarūpekaseso katoti daṭṭhabbaṃ. Atha vā khandhābhisaṅkhāramārānaṃ viya devaputtamārassapi guṇamāraṇe sahāyabhāvūpagamanato kilesabalakāyo ‘‘senā’’ti vuccati. Yathāha ‘‘kāmā te paṭhamā senā’’tiādi (su. ni. 438; mahāni. 28, 68, 149). Sā ca tehi diyaḍḍhasahassabhedā anantabhedā vā kilesavāhinī satidhammavicayavīriyasamathādiguṇapaharaṇehi odhiso vimathitā vihatā viddhastā cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mārasenamathanā,"
      },
      " ariyasāvakā. Etena tesaṃ bhagavato anujātaputtataṃ dasseti."
    ],
    "innerText": "Yadipi ariyasāvakānaṃ ariyamaggādhigamasamaye bhagavato viya tadantarāya karaṇatthaṃ devaputtamāro, māravāhinī vā na ekantena apasādeti, tehi pana apasādetabbatāya kāraṇe vimathite tepi vimathitā eva nāma hontīti āha – ‘‘mārasenamathanāna’’nti. Imasmiṃ panatthe ‘‘māramārasenamathanāna’’nti vattabbe ‘‘mārasenamathanāna’’nti ekadesasarūpekaseso katoti daṭṭhabbaṃ. Atha vā khandhābhisaṅkhāramārānaṃ viya devaputtamārassapi guṇamāraṇe sahāyabhāvūpagamanato kilesabalakāyo ‘‘senā’’ti vuccati. Yathāha ‘‘kāmā te paṭhamā senā’’tiādi (su. ni. 438; mahāni. 28, 68, 149). Sā ca tehi diyaḍḍhasahassabhedā anantabhedā vā kilesavāhinī satidhammavicayavīriyasamathādiguṇapaharaṇehi odhiso vimathitā vihatā viddhastā cāti mārasenamathanā, ariyasāvakā. Etena tesaṃ bhagavato anujātaputtataṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ārakattā kilesehi, anaye na iriyanato, aye ca iriyanato ariyā niruttinayena. Atha vā sadevakena lokena ‘‘saraṇa’’nti araṇīyato upagantabbato upagatānañca tadatthasiddhito ariyā, ariyānaṃ saṅghoti ariyasaṅgho, ariyo ca so saṅgho cāti vā ariyasaṅgho, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyasaṅghaṃ"
      },
      ". Bhagavato aparabhāge buddhadhammaratanānampi samadhigamo saṅgharatanādhīnoti ariyasaṅghassa bahūpakārataṃ dassetuṃ idheva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sirasā vande’’"
      },
      "ti vuttanti daṭṭhabbaṃ."
    ],
    "innerText": "Ārakattā kilesehi, anaye na iriyanato, aye ca iriyanato ariyā niruttinayena. Atha vā sadevakena lokena ‘‘saraṇa’’nti araṇīyato upagantabbato upagatānañca tadatthasiddhito ariyā, ariyānaṃ saṅghoti ariyasaṅgho, ariyo ca so saṅgho cāti vā ariyasaṅgho, taṃ ariyasaṅghaṃ. Bhagavato aparabhāge buddhadhammaratanānampi samadhigamo saṅgharatanādhīnoti ariyasaṅghassa bahūpakārataṃ dassetuṃ idheva ‘‘sirasā vande’’ti vuttanti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca ‘‘sugatassa orasānaṃ puttāna’’nti etena ariyasaṅghassa pabhavasampadaṃ dasseti, ‘‘mārasenamathanāna’’nti etena pahānasampadaṃ sakalasaṃkilesappahānadīpanato. ‘‘Aṭṭhannampi samūha’’nti etena ñāṇasampadaṃ maggaṭṭhaphalaṭṭhabhāvadīpanato. ‘‘Ariyasaṅgha’’nti etena pabhāvasampadaṃ dasseti sabbasaṅghānaṃ aggabhāvadīpanato. Atha vā ‘‘sugatassa orasānaṃ puttāna’’nti ariyasaṅghassa visuddhanissayabhāvadīpanaṃ, ‘‘mārasenamathanāna’’nti sammāujuñāyasāmīcippaṭipannabhāvadīpanaṃ, ‘‘aṭṭhannampi samūha’’nti āhuneyyādibhāvadīpanaṃ, ‘‘ariyasaṅgha’’nti anuttarapuññakkhettabhāvadīpanaṃ. Tathā ‘‘sugatassa orasānaṃ puttāna’’nti etena ariyasaṅghassa lokuttarasaraṇagamanasabbhāvaṃ dīpeti. Lokuttarasaraṇagamanena hi te bhagavato orasaputtā jātā. ‘‘Mārasenamathanāna’’nti etena abhinīhārasampadāsiddhaṃ ",
      " pubbabhāge sammāpaṭipattiṃ dasseti. Katābhinīhārā hi sammāpaṭipannā māraṃ māraparisaṃ vā abhivijinanti. ‘‘Aṭṭhannampi samūha’’nti etena paṭividdhastavipakkhe sekkhāsekkhadhamme dasseti puggalādhiṭṭhānena maggaphaladhammānaṃ pakāsitattā. ‘‘Ariyasaṅgha’’nti aggadakkhiṇeyyabhāvaṃ dasseti. Saraṇagamanañca sāvakānaṃ sabbaguṇānaṃ ādi, sapubbabhāgapaṭipadā sekkhā sīlakkhandhādayo majjhe, asekkhā sīlakkhandhādayo ",
      " pariyosānanti ādimajjhapariyosānakalyāṇā saṅkhepato sabbe ariyasaṅghaguṇā pakāsitā honti."
    ],
    "innerText": "Ettha ca ‘‘sugatassa orasānaṃ puttāna’’nti etena ariyasaṅghassa pabhavasampadaṃ dasseti, ‘‘mārasenamathanāna’’nti etena pahānasampadaṃ sakalasaṃkilesappahānadīpanato. ‘‘Aṭṭhannampi samūha’’nti etena ñāṇasampadaṃ maggaṭṭhaphalaṭṭhabhāvadīpanato. ‘‘Ariyasaṅgha’’nti etena pabhāvasampadaṃ dasseti sabbasaṅghānaṃ aggabhāvadīpanato. Atha vā ‘‘sugatassa orasānaṃ puttāna’’nti ariyasaṅghassa visuddhanissayabhāvadīpanaṃ, ‘‘mārasenamathanāna’’nti sammāujuñāyasāmīcippaṭipannabhāvadīpanaṃ, ‘‘aṭṭhannampi samūha’’nti āhuneyyādibhāvadīpanaṃ, ‘‘ariyasaṅgha’’nti anuttarapuññakkhettabhāvadīpanaṃ. Tathā ‘‘sugatassa orasānaṃ puttāna’’nti etena ariyasaṅghassa lokuttarasaraṇagamanasabbhāvaṃ dīpeti. Lokuttarasaraṇagamanena hi te bhagavato orasaputtā jātā. ‘‘Mārasenamathanāna’’nti etena abhinīhārasampadāsiddhaṃ pubbabhāge sammāpaṭipattiṃ dasseti. Katābhinīhārā hi sammāpaṭipannā māraṃ māraparisaṃ vā abhivijinanti. ‘‘Aṭṭhannampi samūha’’nti etena paṭividdhastavipakkhe sekkhāsekkhadhamme dasseti puggalādhiṭṭhānena maggaphaladhammānaṃ pakāsitattā. ‘‘Ariyasaṅgha’’nti aggadakkhiṇeyyabhāvaṃ dasseti. Saraṇagamanañca sāvakānaṃ sabbaguṇānaṃ ādi, sapubbabhāgapaṭipadā sekkhā sīlakkhandhādayo majjhe, asekkhā sīlakkhandhādayo pariyosānanti ādimajjhapariyosānakalyāṇā saṅkhepato sabbe ariyasaṅghaguṇā pakāsitā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Evaṃ gāthāttayena saṅkhepato sakalaguṇasaṃkittanamukhena ratanattayassa paṇāmaṃ katvā idāni taṃnipaccakāraṃ yathādhippete payojane pariṇāmento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘iti me’’"
      },
      "tiādimāha. Tattha ratijananaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ratanaṃ,"
      },
      " buddhadhammasaṅghā. Tesañhi ‘‘itipi so bhagavā’’tiādinā yathābhūtaguṇe āvajjentassa amatādhigamahetubhūtaṃ anappakaṃ pītipāmojjaṃ uppajjati. Yathāha –"
    ],
    "innerText": "4. Evaṃ gāthāttayena saṅkhepato sakalaguṇasaṃkittanamukhena ratanattayassa paṇāmaṃ katvā idāni taṃnipaccakāraṃ yathādhippete payojane pariṇāmento ‘‘iti me’’tiādimāha. Tattha ratijananaṭṭhena ratanaṃ, buddhadhammasaṅghā. Tesañhi ‘‘itipi so bhagavā’’tiādinā yathābhūtaguṇe āvajjentassa amatādhigamahetubhūtaṃ anappakaṃ pītipāmojjaṃ uppajjati. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Yasmiṃ mahānāma, samaye ariyasāvako tathāgataṃ anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosa…pe… na mohapariyuṭṭhitaṃ cittaṃ hoti…pe… ujugatacitto kho mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ, pamuditassa pīti jāyatī’’tiādi (a. ni. 6.10; 11.11)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Cittīkatādibhāvo vā ratanaṭṭho. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Cittīkataṃ mahagghañca, atulaṃ dullabhadassanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anomasattaparibhogaṃ, ratanaṃ tena vuccatī’’ti. (dī. ni. aṭṭha. 2.33; saṃ. ni. aṭṭha. 3.5.223; khu. pā. aṭṭha. 6.3; su. ni. aṭṭha. 1.226; mahāni. aṭṭha. 50);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Cittikatabhāvādayo ca anaññasādhāraṇā buddhādīsu eva labbhantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vandanāva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vandanāmayaṃ"
      },
      " yathā ‘‘dānamayaṃ sīlamaya’’nti (dī. ni. 3.305; itivu. 60). Vandanā cettha kāyavācācittehi tiṇṇaṃ ratanānaṃ guṇaninnatā, thomanā vā. Pujjabhavaphalanibbattanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puññaṃ,"
      },
      " attano santānaṃ punātīti vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvihatantarāyo"
      },
      "ti suṭṭhu vihatantarāyo. Etena attano pasādasampattiyā ratanattayassa ca khettabhāvasampattiyā taṃ puññaṃ atthappakāsanassa upaghātakaupaddavānaṃ vihanane samatthanti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hutvā"
      },
      "ti pubbakālakiriyā. Tassa ‘‘atthaṃ pakāsayissāmī’’ti etena sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā"
      },
      "ti yaṃ ratanattayavandanāmayaṃ puññaṃ, tassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ānubhāvenā"
      },
      "ti balena."
    ],
    "innerText": "Vandanāva vandanāmayaṃ yathā ‘‘dānamayaṃ sīlamaya’’nti (dī. ni. 3.305; itivu. 60). Vandanā cettha kāyavācācittehi tiṇṇaṃ ratanānaṃ guṇaninnatā, thomanā vā. Pujjabhavaphalanibbattanato puññaṃ, attano santānaṃ punātīti vā. Suvihatantarāyoti suṭṭhu vihatantarāyo. Etena attano pasādasampattiyā ratanattayassa ca khettabhāvasampattiyā taṃ puññaṃ atthappakāsanassa upaghātakaupaddavānaṃ vihanane samatthanti dasseti. Hutvāti pubbakālakiriyā. Tassa ‘‘atthaṃ pakāsayissāmī’’ti etena sambandho. Tassāti yaṃ ratanattayavandanāmayaṃ puññaṃ, tassa. Ānubhāvenāti balena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". Evaṃ ",
      " ratanattayassa nipaccakāre payojanaṃ dassetvā idāni yassā dhammadesanāya atthaṃ saṃvaṇṇetukāmo, tassā tāva guṇābhitthavanavasena upaññāpanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘majjhimapamāṇasuttaṅkitassā’’"
      },
      "tiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "majjhimapamāṇasuttaṅkitassā"
      },
      "ti nātidīghanātikhuddakapamāṇehi suttantehi lakkhitassa. Yathā hi dīghāgame dīghapamāṇāni suttāni, yathā ca saṃyuttaṅguttarāgamesu dvīsu khuddakapamāṇāni, na evaṃ idha. Idha pana pamāṇato majjhimāni suttāni. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘majjhimapamāṇasuttaṅkitassā"
      },
      "ti nātidīghanātikhuddakapamāṇehi suttantehi lakkhitassati attho’’ti. Etena ‘‘majjhimo’’ti ayaṃ imassa atthānugatasamaññāti dasseti. Nanu ca suttāni eva āgamo, kassa pana suttehi aṅkananti? Saccametaṃ paramatthato, suttāni pana upādāya paññatto āgamo. Yatheva hi atthabyañjanasamudāye ‘‘sutta’’nti vohāro, evaṃ suttasamudāye ayaṃ ‘‘āgamo’’ti vohāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti imasmiṃ sāsane. Āgamissanti ettha, etena etasmā vā attatthaparatthādayoti āgamo, ādikalyāṇādiguṇasampattiyā uttamaṭṭhena taṃtaṃabhipatthitasamiddhihetutāya paṇḍitehi varitabbato varo, āgamo ca so varo cāti āgamavaro. Āgamasammatehi vā varoti āgamavaro, majjhimo ca so āgamavaro cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "majjhimāgamavaro,"
      },
      " tassa."
    ],
    "innerText": "5. Evaṃ ratanattayassa nipaccakāre payojanaṃ dassetvā idāni yassā dhammadesanāya atthaṃ saṃvaṇṇetukāmo, tassā tāva guṇābhitthavanavasena upaññāpanatthaṃ ‘‘majjhimapamāṇasuttaṅkitassā’’tiādi vuttaṃ. Tattha majjhimapamāṇasuttaṅkitassāti nātidīghanātikhuddakapamāṇehi suttantehi lakkhitassa. Yathā hi dīghāgame dīghapamāṇāni suttāni, yathā ca saṃyuttaṅguttarāgamesu dvīsu khuddakapamāṇāni, na evaṃ idha. Idha pana pamāṇato majjhimāni suttāni. Tena vuttaṃ ‘‘majjhimapamāṇasuttaṅkitassāti nātidīghanātikhuddakapamāṇehi suttantehi lakkhitassati attho’’ti. Etena ‘‘majjhimo’’ti ayaṃ imassa atthānugatasamaññāti dasseti. Nanu ca suttāni eva āgamo, kassa pana suttehi aṅkananti? Saccametaṃ paramatthato, suttāni pana upādāya paññatto āgamo. Yatheva hi atthabyañjanasamudāye ‘‘sutta’’nti vohāro, evaṃ suttasamudāye ayaṃ ‘‘āgamo’’ti vohāro. Idhāti imasmiṃ sāsane. Āgamissanti ettha, etena etasmā vā attatthaparatthādayoti āgamo, ādikalyāṇādiguṇasampattiyā uttamaṭṭhena taṃtaṃabhipatthitasamiddhihetutāya paṇḍitehi varitabbato varo, āgamo ca so varo cāti āgamavaro. Āgamasammatehi vā varoti āgamavaro, majjhimo ca so āgamavaro cāti majjhimāgamavaro, tassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Buddhānaṃ anubuddhānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddhānubuddhā,"
      },
      " buddhānaṃ saccapaṭivedhaṃ anugamma paṭividdhasaccā aggasāvakādayo ariyā. Tehi atthasaṃvaṇṇanāguṇasaṃvaṇṇanānaṃ vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃvaṇṇitassa"
      },
      ". Atha vā buddhā ca anubuddhā ca buddhānubuddhāti yojetabbaṃ. Sammāsambuddheneva hi vinayasuttābhidhammānaṃ pakiṇṇakadesanādivasena yo paṭhamaṃ attho vibhatto, so eva pacchā tassa tassa saṃvaṇṇanāvasena saṅgītikārehi saṅgahaṃ āropitoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paravādamathanassā"
      },
      "ti aññatitthiyānaṃ vādanimmathanassa, tesaṃ diṭṭhigatabhañjanassāti attho. Ayañhi ",
      " āgamo mūlapariyāyasuttasabbāsavasuttādīsu diṭṭhigatikānaṃ diṭṭhigatadosavibhāvanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saccakasuttaṃ"
      },
      " (ma. ni. 1.353) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upālisuttā"
      },
      "dīsu (ma. ni. 2.56) saccakādīnaṃ micchāvādanimmathanadīpanato visesato ‘‘paravādamathano’’ti thomitoti. Saṃvaṇṇanāsu cāyaṃ ācariyassa pakati, yā taṃtaṃsaṃvaṇṇanāsu ādito tassa tassa saṃvaṇṇetabbassa dhammassa visesaguṇakittanena thomanā. Tathā hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sumaṅgalavilāsinīsāratthapakāsinīmanorathapūraṇīsu aṭṭhasālinīādīsu"
      },
      " ca yathākkamaṃ ‘‘saddhāvahaguṇassa, ñāṇappabhedajananassa, dhammakathikapuṅgavānaṃ vicittapaṭibhānajananassa, tassa gambhīrañāṇehi ogāḷhassa abhiṇhaso nānānayavicittassa abhidhammassā’’tiādinā thomanā katā."
    ],
    "innerText": "Buddhānaṃ anubuddhānaṃ buddhānubuddhā, buddhānaṃ saccapaṭivedhaṃ anugamma paṭividdhasaccā aggasāvakādayo ariyā. Tehi atthasaṃvaṇṇanāguṇasaṃvaṇṇanānaṃ vasena saṃvaṇṇitassa. Atha vā buddhā ca anubuddhā ca buddhānubuddhāti yojetabbaṃ. Sammāsambuddheneva hi vinayasuttābhidhammānaṃ pakiṇṇakadesanādivasena yo paṭhamaṃ attho vibhatto, so eva pacchā tassa tassa saṃvaṇṇanāvasena saṅgītikārehi saṅgahaṃ āropitoti. Paravādamathanassāti aññatitthiyānaṃ vādanimmathanassa, tesaṃ diṭṭhigatabhañjanassāti attho. Ayañhi āgamo mūlapariyāyasuttasabbāsavasuttādīsu diṭṭhigatikānaṃ diṭṭhigatadosavibhāvanato saccakasuttaṃ (ma. ni. 1.353) upālisuttādīsu (ma. ni. 2.56) saccakādīnaṃ micchāvādanimmathanadīpanato visesato ‘‘paravādamathano’’ti thomitoti. Saṃvaṇṇanāsu cāyaṃ ācariyassa pakati, yā taṃtaṃsaṃvaṇṇanāsu ādito tassa tassa saṃvaṇṇetabbassa dhammassa visesaguṇakittanena thomanā. Tathā hi sumaṅgalavilāsinīsāratthapakāsinīmanorathapūraṇīsu aṭṭhasālinīādīsu ca yathākkamaṃ ‘‘saddhāvahaguṇassa, ñāṇappabhedajananassa, dhammakathikapuṅgavānaṃ vicittapaṭibhānajananassa, tassa gambhīrañāṇehi ogāḷhassa abhiṇhaso nānānayavicittassa abhidhammassā’’tiādinā thomanā katā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". Attho ",
      " kathīyati etāyāti atthakathā, sā eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathā"
      },
      " ttha-kārassa ṭṭha-kāraṃ katvā yathā ‘‘dukkhassa pīḷanaṭṭho’’ti (paṭi. ma. 1.17; 2.8) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādito"
      },
      "tiādimhi paṭhamasaṅgītiyaṃ. Chaḷabhiññatāya paramena cittissariyabhāvena samannāgatattā jhānādīsu pañcavidhavasitāsabbhāvato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vasino,"
      },
      " therā mahākassapādayo. Tesaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satehi pañcahi. Yā"
      },
      "ti yā aṭṭhakathā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅgītā"
      },
      "ti atthaṃ pakāsetuṃ yuttaṭṭhāne ‘‘ayaṃ etassa attho, ayaṃ etassa attho’’ti saṅgahetvā vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anusaṅgītā ca"
      },
      " yasattherādīhi pacchāpi dutiyatatiyasaṅgītīsu. Iminā attano saṃvaṇṇanāya āgamanasuddhiṃ dasseti."
    ],
    "innerText": "6. Attho kathīyati etāyāti atthakathā, sā eva aṭṭhakathā ttha-kārassa ṭṭha-kāraṃ katvā yathā ‘‘dukkhassa pīḷanaṭṭho’’ti (paṭi. ma. 1.17; 2.8) āditotiādimhi paṭhamasaṅgītiyaṃ. Chaḷabhiññatāya paramena cittissariyabhāvena samannāgatattā jhānādīsu pañcavidhavasitāsabbhāvato ca vasino, therā mahākassapādayo. Tesaṃ satehi pañcahi. Yāti yā aṭṭhakathā. Saṅgītāti atthaṃ pakāsetuṃ yuttaṭṭhāne ‘‘ayaṃ etassa attho, ayaṃ etassa attho’’ti saṅgahetvā vuttā. Anusaṅgītā ca yasattherādīhi pacchāpi dutiyatatiyasaṅgītīsu. Iminā attano saṃvaṇṇanāya āgamanasuddhiṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". Sīhassa lānato gahaṇato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīhaḷo,"
      },
      " sīhakumāro. Taṃvaṃsajātatāya tambapaṇṇidīpe khattiyānaṃ, tesaṃ nivāsatāya tambapaṇṇidīpassa ca sīhaḷabhāvo veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ābhatā"
      },
      "ti jambudīpato ānītā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Athā"
      },
      "ti pacchā. Aparabhāge hi nikāyantaraladdhīhi asaṅkaratthaṃ sīhaḷabhāsāya aṭṭhakathā ṭhapitāti. Tena mūlaṭṭhakathā sabbasādhāraṇā na hotīti idaṃ atthappakāsanaṃ ekantena karaṇīyanti dasseti. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dīpavāsīnamatthāyā’’"
      },
      "ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dīpavāsīna"
      },
      "nti jambudīpavāsīnaṃ, sīhaḷadīpavāsīnaṃ vā atthāya sīhaḷabhāsāya ṭhapitāti yojanā."
    ],
    "innerText": "7. Sīhassa lānato gahaṇato sīhaḷo, sīhakumāro. Taṃvaṃsajātatāya tambapaṇṇidīpe khattiyānaṃ, tesaṃ nivāsatāya tambapaṇṇidīpassa ca sīhaḷabhāvo veditabbo. Ābhatāti jambudīpato ānītā. Athāti pacchā. Aparabhāge hi nikāyantaraladdhīhi asaṅkaratthaṃ sīhaḷabhāsāya aṭṭhakathā ṭhapitāti. Tena mūlaṭṭhakathā sabbasādhāraṇā na hotīti idaṃ atthappakāsanaṃ ekantena karaṇīyanti dasseti. Tenevāha ‘‘dīpavāsīnamatthāyā’’ti. Tattha dīpavāsīnanti jambudīpavāsīnaṃ, sīhaḷadīpavāsīnaṃ vā atthāya sīhaḷabhāsāya ṭhapitāti yojanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apanetvānā"
      },
      "ti ",
      " kañcukasadisaṃ sīhaḷabhāsaṃ apanetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato"
      },
      "ti aṭṭhakathāto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aha"
      },
      "nti attānaṃ niddisati, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manoramaṃ bhāsa"
      },
      "nti māgadhabhāsaṃ. Sā hi sabhāvaniruttibhūtā paṇḍitānaṃ manaṃ ramayatīti. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tantinayānucchavika’’"
      },
      "nti, pāḷigatiyā anulomikaṃ pāḷibhāsāyānuvidhāyininti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vigatadosa"
      },
      "nti asabhāvaniruttibhāsantararahitaṃ."
    ],
    "innerText": "8.Apanetvānāti kañcukasadisaṃ sīhaḷabhāsaṃ apanetvā. Tatoti aṭṭhakathāto. Ahanti attānaṃ niddisati, manoramaṃ bhāsanti māgadhabhāsaṃ. Sā hi sabhāvaniruttibhūtā paṇḍitānaṃ manaṃ ramayatīti. Tenevāha ‘‘tantinayānucchavika’’nti, pāḷigatiyā anulomikaṃ pāḷibhāsāyānuvidhāyininti attho. Vigatadosanti asabhāvaniruttibhāsantararahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samayaṃ avilomento"
      },
      "ti siddhantaṃ avirodhento. Etena atthadosābhāvamāha. Aviruddhattā eva hi theravādāpi idha pakāsīyissanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Theravaṃsadīpāna"
      },
      "nti thirehi sīlakkhandhādīhi samannāgatattā therā, mahākassapādayo. Tehi āgatā ācariyaparamparā theravaṃso, tappariyāpannā hutvā āgamādhigamasampannattā paññāpajjotena tassa samujjalanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "theravaṃsadīpā,"
      },
      " mahāvihāravāsino, tesaṃ. Vividhehi ākārehi nicchīyatīti vinicchayo, gaṇṭhiṭṭhānesu khīlamaddanākārena pavattā vimaticchedanī kathā. Suṭṭhu nipuṇo saṇho vinicchayo etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sunipuṇavinicchayā."
      },
      " Atha vā vinicchinotīti vinicchayo, yathāvuttatthavisayaṃ ñāṇaṃ. Suṭṭhu nipuṇo cheko vinicchayo etesanti yojetabbaṃ. Etena mahākassapāditheraparamparābhato, tato eva ca aviparīto saṇho sukhumo mahāvihāravāsīnaṃ vinicchayoti tassa pamāṇabhūtataṃ dasseti."
    ],
    "innerText": "9.Samayaṃ avilomentoti siddhantaṃ avirodhento. Etena atthadosābhāvamāha. Aviruddhattā eva hi theravādāpi idha pakāsīyissanti. Theravaṃsadīpānanti thirehi sīlakkhandhādīhi samannāgatattā therā, mahākassapādayo. Tehi āgatā ācariyaparamparā theravaṃso, tappariyāpannā hutvā āgamādhigamasampannattā paññāpajjotena tassa samujjalanato theravaṃsadīpā, mahāvihāravāsino, tesaṃ. Vividhehi ākārehi nicchīyatīti vinicchayo, gaṇṭhiṭṭhānesu khīlamaddanākārena pavattā vimaticchedanī kathā. Suṭṭhu nipuṇo saṇho vinicchayo etesanti sunipuṇavinicchayā. Atha vā vinicchinotīti vinicchayo, yathāvuttatthavisayaṃ ñāṇaṃ. Suṭṭhu nipuṇo cheko vinicchayo etesanti yojetabbaṃ. Etena mahākassapāditheraparamparābhato, tato eva ca aviparīto saṇho sukhumo mahāvihāravāsīnaṃ vinicchayoti tassa pamāṇabhūtataṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sujanassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca"
      },
      "-saddo sampiṇḍanattho. Tena ‘‘na kevalaṃ jambudīpavāsīnameva atthāya, atha kho sādhujanatosanatthañcā’’ti dasseti. Tena ca ‘‘tambapaṇṇidīpavāsīnampi atthāyā’’ti ayamattho siddho hoti uggahaṇādisukaratāya tesampi bahukārattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ciraṭṭhitattha"
      },
      "nti ciraṭṭhitiatthaṃ, cirakālaṭṭhitiyāti attho. Idañhi atthappakāsanaṃ aviparītapadabyañjanasunikkhepassa atthasunayassa ca upāyabhāvato saddhammassa ciraṭṭhitiyā saṃvattati. Vuttañhetaṃ bhagavatā ‘‘dveme, bhikkhave, dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattanti. Katame dve? Sunnikkhittañca padabyañjanaṃ attho ca sunīto’’ti (a. ni. 2.20)."
    ],
    "innerText": "10.Sujanassacāti ca-saddo sampiṇḍanattho. Tena ‘‘na kevalaṃ jambudīpavāsīnameva atthāya, atha kho sādhujanatosanatthañcā’’ti dasseti. Tena ca ‘‘tambapaṇṇidīpavāsīnampi atthāyā’’ti ayamattho siddho hoti uggahaṇādisukaratāya tesampi bahukārattā. Ciraṭṭhitatthanti ciraṭṭhitiatthaṃ, cirakālaṭṭhitiyāti attho. Idañhi atthappakāsanaṃ aviparītapadabyañjanasunikkhepassa atthasunayassa ca upāyabhāvato saddhammassa ciraṭṭhitiyā saṃvattati. Vuttañhetaṃ bhagavatā ‘‘dveme, bhikkhave, dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattanti. Katame dve? Sunnikkhittañca padabyañjanaṃ attho ca sunīto’’ti (a. ni. 2.20)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". Yaṃ ",
      " atthavaṇṇanaṃ kattukāmo, tassā mahattaṃ pariharituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sīlakathā’’"
      },
      "tiādi vuttaṃ. Tenevāha ‘‘na taṃ idha vicārayissāmī’’ti. Atha vā yaṃ aṭṭhakathaṃ kattukāmo, tadekadesabhāvena visuddhimaggo gahetabboti kathikānaṃ upadesaṃ karonto tattha vicāritadhamme uddesavasena dasseti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sīlakathā’’"
      },
      "tiādinā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīlakathā"
      },
      "ti cārittavārittādivasena sīlassa vitthārakathā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhutadhammā"
      },
      "ti piṇḍapātikaṅgādayo terasa kilesadhunanakadhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammaṭṭhānāni sabbānī"
      },
      "ti pāḷiyaṃ āgatāni aṭṭhatiṃsa, aṭṭhakathāyaṃ dveti niravasesāni yogakammassa bhāvanāya pavattiṭṭhānāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cariyāvidhānasahito"
      },
      "ti rāgacaritādīnaṃ sabhāvādividhānena sahito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhānāni"
      },
      " cattāri rūpāvacarajjhānāni, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāpattiyo"
      },
      " catasso arūpasamāpattiyo. Aṭṭhapi vā paṭiladdhamattāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānāni,"
      },
      " samāpajjanavasībhāvappattiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāpattiyo. Jhānāni"
      },
      " vā rūpārūpāvacarajjhānāni, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāpattiyo"
      },
      " phalasamāpattinirodhasamāpattiyo."
    ],
    "innerText": "11. Yaṃ atthavaṇṇanaṃ kattukāmo, tassā mahattaṃ pariharituṃ ‘‘sīlakathā’’tiādi vuttaṃ. Tenevāha ‘‘na taṃ idha vicārayissāmī’’ti. Atha vā yaṃ aṭṭhakathaṃ kattukāmo, tadekadesabhāvena visuddhimaggo gahetabboti kathikānaṃ upadesaṃ karonto tattha vicāritadhamme uddesavasena dasseti ‘‘sīlakathā’’tiādinā. Tattha sīlakathāti cārittavārittādivasena sīlassa vitthārakathā. Dhutadhammāti piṇḍapātikaṅgādayo terasa kilesadhunanakadhammā. Kammaṭṭhānāni sabbānīti pāḷiyaṃ āgatāni aṭṭhatiṃsa, aṭṭhakathāyaṃ dveti niravasesāni yogakammassa bhāvanāya pavattiṭṭhānāni. Cariyāvidhānasahitoti rāgacaritādīnaṃ sabhāvādividhānena sahito. Jhānāni cattāri rūpāvacarajjhānāni, samāpattiyo catasso arūpasamāpattiyo. Aṭṭhapi vā paṭiladdhamattāni jhānāni, samāpajjanavasībhāvappattiyā samāpattiyo. Jhānāni vā rūpārūpāvacarajjhānāni, samāpattiyo phalasamāpattinirodhasamāpattiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ". Lokiyalokuttarabhedā cha abhiññāyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbā abhiññāyo"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāṇavibhaṅgā"
      },
      "dīsu (vibha. 751) āgatanayena ekavidhādinā paññāya saṃkaletvā sampiṇḍetvā nicchayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāsaṅkalananicchayo"
      },
      "."
    ],
    "innerText": "12. Lokiyalokuttarabhedā cha abhiññāyo sabbā abhiññāyo. Ñāṇavibhaṅgādīsu (vibha. 751) āgatanayena ekavidhādinā paññāya saṃkaletvā sampiṇḍetvā nicchayo paññāsaṅkalananicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". Paccayadhammānaṃ hetādīnaṃ paccayuppannadhammānaṃ hetupaccayādibhāvo paccayākāro, tassa desanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccayākāradesanā,"
      },
      " paṭiccasamuppādakathāti attho. Sā pana nikāyantaraladdhisaṅkararahitatāya suṭṭhu parisuddhā, ghanavinibbhogassa sudukkaratāya nipuṇā saṇhasukhumā, ekattanayādisahitā ca tattha vicāritāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘suparisuddhanipuṇanayā’’"
      },
      "ti. Paṭisambhidādīsu āgatanayaṃ avissajjetvāva vicāritattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avimuttatantimaggā"
      },
      "."
    ],
    "innerText": "13. Paccayadhammānaṃ hetādīnaṃ paccayuppannadhammānaṃ hetupaccayādibhāvo paccayākāro, tassa desanā paccayākāradesanā, paṭiccasamuppādakathāti attho. Sā pana nikāyantaraladdhisaṅkararahitatāya suṭṭhu parisuddhā, ghanavinibbhogassa sudukkaratāya nipuṇā saṇhasukhumā, ekattanayādisahitā ca tattha vicāritāti āha ‘‘suparisuddhanipuṇanayā’’ti. Paṭisambhidādīsu āgatanayaṃ avissajjetvāva vicāritattā avimuttatantimaggā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iti"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pana sabba"
      },
      "nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iti"
      },
      "-saddo parisamāpane, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pana"
      },
      "-saddo vacanālaṅkāre, etaṃ sabbanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti imissā aṭṭhakathāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na taṃ vicārayissāmi"
      },
      " punaruttibhāvatoti adhippāyo."
    ],
    "innerText": "14.Itipana sabbanti iti-saddo parisamāpane, pana-saddo vacanālaṅkāre, etaṃ sabbanti attho. Idhāti imissā aṭṭhakathāya. Na taṃ vicārayissāmi punaruttibhāvatoti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". Idāni tasseva avicāraṇassa ekantakāraṇaṃ niddhārento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘majjhe visuddhimaggo’’"
      },
      "tiādimāha. Tattha ‘‘majjhe ṭhatvā’’ti etena majjhaṭṭhabhāvadīpanena ",
      " visesato catunnaṃ āgamānaṃ sādhāraṇaṭṭhakathā visuddhimaggo, na ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sumaṅgalavilāsinī"
      },
      "ādayo viya asādhāraṇaṭṭhakathāti dasseti. ‘‘Visesato’’ti ca idaṃ vinayābhidhammānampi visuddhimaggo yathārahaṃ atthavaṇṇanā hoti evāti katvā vuttaṃ."
    ],
    "innerText": "15. Idāni tasseva avicāraṇassa ekantakāraṇaṃ niddhārento ‘‘majjhe visuddhimaggo’’tiādimāha. Tattha ‘‘majjhe ṭhatvā’’ti etena majjhaṭṭhabhāvadīpanena visesato catunnaṃ āgamānaṃ sādhāraṇaṭṭhakathā visuddhimaggo, na sumaṅgalavilāsinīādayo viya asādhāraṇaṭṭhakathāti dasseti. ‘‘Visesato’’ti ca idaṃ vinayābhidhammānampi visuddhimaggo yathārahaṃ atthavaṇṇanā hoti evāti katvā vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iccevā"
      },
      "ti iti eva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tampī"
      },
      "ti visuddhimaggampi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etāyā"
      },
      "ti papañcasūdaniyā. Ettha ca ‘‘sīhaḷadīpaṃ ābhatā’’tiādinā aṭṭhakathākaraṇassa nimittaṃ dasseti, ‘‘dīpavāsīnamatthāya, sujanassa ca tuṭṭhatthaṃ, ciraṭṭhitatthañca dhammassā’’ti etena payojanaṃ, ‘‘majjhimāgamavarassa atthaṃ pakāsayissāmī’’ti etena piṇḍatthaṃ, ‘‘apanetvāna tatohaṃ sīhaḷabhāsa’’ntiādinā, ‘‘sīlakathā’’tiādinā ca karaṇappakāraṃ. Sīlakathādīnaṃ avicāraṇampi hi idha karaṇappakāro evāti."
    ],
    "innerText": "16.Iccevāti iti eva. Tampīti visuddhimaggampi. Etāyāti papañcasūdaniyā. Ettha ca ‘‘sīhaḷadīpaṃ ābhatā’’tiādinā aṭṭhakathākaraṇassa nimittaṃ dasseti, ‘‘dīpavāsīnamatthāya, sujanassa ca tuṭṭhatthaṃ, ciraṭṭhitatthañca dhammassā’’ti etena payojanaṃ, ‘‘majjhimāgamavarassa atthaṃ pakāsayissāmī’’ti etena piṇḍatthaṃ, ‘‘apanetvāna tatohaṃ sīhaḷabhāsa’’ntiādinā, ‘‘sīlakathā’’tiādinā ca karaṇappakāraṃ. Sīlakathādīnaṃ avicāraṇampi hi idha karaṇappakāro evāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ganthārambhakathāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subsubhead"
    },
    "innerText": "Nidānakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Vibhāgavantānaṃ ",
      " sabhāvavibhāvanaṃ vibhāgadassanamukheneva hotīti paṭhamaṃ tāva paṇṇāsavaggasuttādivasena majjhimāgamassa vibhāgaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tattha majjhimasaṅgīti nāmā’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatthā"
      },
      "ti yaṃ vuttaṃ ‘‘majjhimāgamavarassa atthaṃ pakāsayissāmī’’ti, tasmiṃ vacane. Yā majjhimāgamapariyāyena majjhimasaṅgīti vuttā, sā paṇṇāsādito edisāti dasseti ‘‘majjhimasaṅgīti nāmā’’tiādinā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti vā ‘‘etāya aṭṭhakathāya vijānātha majjhimasaṅgītiyā attha’’nti ettha yassā majjhimasaṅgītiyā atthaṃ vijānāthāti vuttaṃ, sā majjhimasaṅgīti nāma paṇṇāsādito edisāti dasseti. Pañca dasakā paṇṇāsā, mūle ādimhi paṇṇāsā, mūlabhūtā vā paṇṇāsā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mūlapaṇṇāsā"
      },
      ". Majjhe bhavā majjhimā, majjhimā ca sā paṇṇāsā cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "majjhimapaṇṇāsā"
      },
      ". Upari uddhaṃ paṇṇāsā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uparipaṇṇāsā"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇṇāsattayasaṅgahā"
      },
      "ti paṇṇāsattayaparigaṇanā."
    ],
    "innerText": "1. Vibhāgavantānaṃ sabhāvavibhāvanaṃ vibhāgadassanamukheneva hotīti paṭhamaṃ tāva paṇṇāsavaggasuttādivasena majjhimāgamassa vibhāgaṃ dassetuṃ ‘‘tattha majjhimasaṅgīti nāmā’’tiādimāha. Tattha tatthāti yaṃ vuttaṃ ‘‘majjhimāgamavarassa atthaṃ pakāsayissāmī’’ti, tasmiṃ vacane. Yā majjhimāgamapariyāyena majjhimasaṅgīti vuttā, sā paṇṇāsādito edisāti dasseti ‘‘majjhimasaṅgīti nāmā’’tiādinā. Tatthāti vā ‘‘etāya aṭṭhakathāya vijānātha majjhimasaṅgītiyā attha’’nti ettha yassā majjhimasaṅgītiyā atthaṃ vijānāthāti vuttaṃ, sā majjhimasaṅgīti nāma paṇṇāsādito edisāti dasseti. Pañca dasakā paṇṇāsā, mūle ādimhi paṇṇāsā, mūlabhūtā vā paṇṇāsā mūlapaṇṇāsā. Majjhe bhavā majjhimā, majjhimā ca sā paṇṇāsā cāti majjhimapaṇṇāsā. Upari uddhaṃ paṇṇāsā uparipaṇṇāsā. Paṇṇāsattayasaṅgahāti paṇṇāsattayaparigaṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayaṃ saṅgaho nāma jātisañjātikiriyāgaṇanavasena catubbidho. Tattha ‘‘yā cāvuso visākha, sammāvācā, yo ca sammākammanto, yo ca sammāājīvo ",
      ", ime dhammā sīlakkhandhe saṅgahitā’’ti (ma. ni. 1.462) ayaṃ jātisaṅgaho. ‘‘Yo cāvuso visākha, sammāvāyāmo. Yā ca sammāsati, yo ca sammāsamādhi, ime dhammā samādhikkhandhe saṅgahitā’’ti ayaṃ sañjātisaṅgaho. ‘‘Yā cāvuso visākha, sammādiṭṭhi, yo ca sammāsaṅkappo, ime dhammā paññākkhandhe saṅgahitā’’ti ayaṃ kiriyāsaṅgaho. ‘‘Hañci cakkhāyatanaṃ rūpakkhandhagaṇanaṃ gacchati, tena vata re vattabbe cakkhāyatanaṃ rūpakkhandhena saṅgahita’’nti (kathā. 471) ayaṃ gaṇanasaṅgaho. Ayameva ca idhādhippeto. Tena vuttaṃ ‘‘paṇṇāsattayasaṅgahāti paṇṇāsattayaparigaṇanā’’ti."
    ],
    "innerText": "Ayaṃ saṅgaho nāma jātisañjātikiriyāgaṇanavasena catubbidho. Tattha ‘‘yā cāvuso visākha, sammāvācā, yo ca sammākammanto, yo ca sammāājīvo , ime dhammā sīlakkhandhe saṅgahitā’’ti (ma. ni. 1.462) ayaṃ jātisaṅgaho. ‘‘Yo cāvuso visākha, sammāvāyāmo. Yā ca sammāsati, yo ca sammāsamādhi, ime dhammā samādhikkhandhe saṅgahitā’’ti ayaṃ sañjātisaṅgaho. ‘‘Yā cāvuso visākha, sammādiṭṭhi, yo ca sammāsaṅkappo, ime dhammā paññākkhandhe saṅgahitā’’ti ayaṃ kiriyāsaṅgaho. ‘‘Hañci cakkhāyatanaṃ rūpakkhandhagaṇanaṃ gacchati, tena vata re vattabbe cakkhāyatanaṃ rūpakkhandhena saṅgahita’’nti (kathā. 471) ayaṃ gaṇanasaṅgaho. Ayameva ca idhādhippeto. Tena vuttaṃ ‘‘paṇṇāsattayasaṅgahāti paṇṇāsattayaparigaṇanā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaggato"
      },
      "ti samūhato, so panettha dasakavasena veditabbo. Yebhuyyena hi sāsane dasake vaggavohāro. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ekekāya paṇṇāsāya pañca pañca vagge katvā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pannarasavaggasamāyogā"
      },
      "ti pannarasavaggasaṃyogāti attho. Keci pana samāyogasaddaṃ samudāyatthaṃ vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padato"
      },
      "ti ettha aṭṭhakkharo gāthāpādo ‘‘pada’’nti adhippeto, tasmā ‘‘akkharato cha akkharasatasahassāni caturāsītuttarasatādhikāni catucattālīsa sahassāni ca akkharānī’’ti pāṭhena ",
      " bhavitabbanti vadanti. Yasmā pana navakkharo yāva dvādasakkharo ca gāthāpādo saṃvijjati, tasmā tādisānampi gāthānaṃ vasena aḍḍhateyyagāthāsataṃ bhāṇavāro hotīti katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘akkharato satta akkharasatasahassāni cattālīsañca sahassāni tepaññāsañca akkharānī’’"
      },
      "ti vuttaṃ. Evañhi padabhāṇavāragaṇanāhi akkharagaṇanā saṃsandati, netarathā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāṇavāro"
      },
      "ti ca dvattiṃsakkharānaṃ gāthānaṃ vasena aḍḍhateyyagāthāsataṃ, ayañca akkharagaṇanā bhāṇavāragaṇanā ca padagaṇanānusārena laddhāti veditabbā. Imameva hi atthaṃ ñāpetuṃ suttagaṇanānantaraṃ bhāṇavāre agaṇetvā padāni gaṇitāni. Tatridaṃ vuccati –"
    ],
    "innerText": "Vaggatoti samūhato, so panettha dasakavasena veditabbo. Yebhuyyena hi sāsane dasake vaggavohāro. Tenevāha ‘‘ekekāya paṇṇāsāya pañca pañca vagge katvā’’ti. Pannarasavaggasamāyogāti pannarasavaggasaṃyogāti attho. Keci pana samāyogasaddaṃ samudāyatthaṃ vadanti. Padatoti ettha aṭṭhakkharo gāthāpādo ‘‘pada’’nti adhippeto, tasmā ‘‘akkharato cha akkharasatasahassāni caturāsītuttarasatādhikāni catucattālīsa sahassāni ca akkharānī’’ti pāṭhena bhavitabbanti vadanti. Yasmā pana navakkharo yāva dvādasakkharo ca gāthāpādo saṃvijjati, tasmā tādisānampi gāthānaṃ vasena aḍḍhateyyagāthāsataṃ bhāṇavāro hotīti katvā ‘‘akkharato satta akkharasatasahassāni cattālīsañca sahassāni tepaññāsañca akkharānī’’ti vuttaṃ. Evañhi padabhāṇavāragaṇanāhi akkharagaṇanā saṃsandati, netarathā. Bhāṇavāroti ca dvattiṃsakkharānaṃ gāthānaṃ vasena aḍḍhateyyagāthāsataṃ, ayañca akkharagaṇanā bhāṇavāragaṇanā ca padagaṇanānusārena laddhāti veditabbā. Imameva hi atthaṃ ñāpetuṃ suttagaṇanānantaraṃ bhāṇavāre agaṇetvā padāni gaṇitāni. Tatridaṃ vuccati –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Bhāṇavārā yathāpi hi, majjhimassa pakāsitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upaḍḍhabhāṇavāro ca, tevīsatipadādhiko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Satta satasahassāni, akkharānaṃ vibhāvaye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cattālīsa sahassāni, tepaññāsañca akkhara’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anusandhito"
      },
      "ti ",
      " desanānusandhito. Ekasmiṃ eva hi sutte purimapacchimānaṃ desanābhāgānaṃ sambandho anusandhānato anusandhi. Ettha ca attajjhāsayānusandhi parajjhāsayānusandhīti duvidho ajjhāsayānusandhi. So pana katthaci desanāya vippakatāya dhammaṃ suṇantānaṃ pucchāvasena, katthaci desentassa satthu sāvakassa dhammapaṭiggāhakānañca ajjhāsayavasena, katthaci desetabbassa dhammassa vasena hotīti samāsato tippakāro. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pucchānusandhiajjhāsayānusandhiyathānusandhivasena saṅkhepato tividho anusandhī’’"
      },
      "ti. Saṅkhepeneva ca catubbidho anusandhi veditabbo. Tattha ‘‘evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca ‘kiṃ nu kho, bhante, orimaṃ tīraṃ, kiṃ pārimaṃ tīraṃ, ko majjhe saṃsīdo, ko thale ussādo, ko manussaggāho, ko amanussaggāho, ko āvattaggāho, ko antopūtibhāvo’ti’’ (saṃ. ni. 4.241)? Evaṃ pucchantānaṃ vissajjentena bhagavatā pavattitadesanāvasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pucchānusandhī"
      },
      " veditabbo. ‘‘Atha kho aññatarassa bhikkhuno evaṃ cetaso parivitakko udapādi ‘iti kira bho rūpaṃ anattā… vedanā… saññā… saṅkhārā… viññāṇaṃ anattā, anattakatāni kammāni kamattānaṃ phusissantī’ti. Atha kho bhagavā tassa bhikkhuno cetasā cetoparivitakkamaññāya bhikkhū āmantesi ṭhānaṃ kho panetaṃ, bhikkhave, vijjati, yaṃ idhekacco moghapuriso avidvā avijjāgato taṇhādhipateyyena cetasā satthusāsanaṃ atidhāvitabbaṃ maññeyya ‘iti kira bho rūpaṃ anattā…pe… phusissantī’ti. Taṃ kiṃ maññatha ",
      ", bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti (ma. ni. 3.90) evaṃ paresaṃ ajjhāsayaṃ viditvā bhagavatā pavattitadesanāvasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parajjhāsayānusandhi"
      },
      " veditabbo."
    ],
    "innerText": "Anusandhitoti desanānusandhito. Ekasmiṃ eva hi sutte purimapacchimānaṃ desanābhāgānaṃ sambandho anusandhānato anusandhi. Ettha ca attajjhāsayānusandhi parajjhāsayānusandhīti duvidho ajjhāsayānusandhi. So pana katthaci desanāya vippakatāya dhammaṃ suṇantānaṃ pucchāvasena, katthaci desentassa satthu sāvakassa dhammapaṭiggāhakānañca ajjhāsayavasena, katthaci desetabbassa dhammassa vasena hotīti samāsato tippakāro. Tena vuttaṃ ‘‘pucchānusandhiajjhāsayānusandhiyathānusandhivasena saṅkhepato tividho anusandhī’’ti. Saṅkhepeneva ca catubbidho anusandhi veditabbo. Tattha ‘‘evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca ‘kiṃ nu kho, bhante, orimaṃ tīraṃ, kiṃ pārimaṃ tīraṃ, ko majjhe saṃsīdo, ko thale ussādo, ko manussaggāho, ko amanussaggāho, ko āvattaggāho, ko antopūtibhāvo’ti’’ (saṃ. ni. 4.241)? Evaṃ pucchantānaṃ vissajjentena bhagavatā pavattitadesanāvasena pucchānusandhī veditabbo. ‘‘Atha kho aññatarassa bhikkhuno evaṃ cetaso parivitakko udapādi ‘iti kira bho rūpaṃ anattā… vedanā… saññā… saṅkhārā… viññāṇaṃ anattā, anattakatāni kammāni kamattānaṃ phusissantī’ti. Atha kho bhagavā tassa bhikkhuno cetasā cetoparivitakkamaññāya bhikkhū āmantesi ṭhānaṃ kho panetaṃ, bhikkhave, vijjati, yaṃ idhekacco moghapuriso avidvā avijjāgato taṇhādhipateyyena cetasā satthusāsanaṃ atidhāvitabbaṃ maññeyya ‘iti kira bho rūpaṃ anattā…pe… phusissantī’ti. Taṃ kiṃ maññatha , bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti (ma. ni. 3.90) evaṃ paresaṃ ajjhāsayaṃ viditvā bhagavatā pavattitadesanāvasena parajjhāsayānusandhi veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tassa mayhaṃ brāhmaṇa etadahosi ‘yaṃnūnāhaṃ yā tā rattiyo abhiññātā abhilakkhitā cātuddasī pañcadasī aṭṭhamī ca pakkhassa, tathārūpāsu rattīsu yāni tāni ārāmacetiyāni vanacetiyāni rukkhacetiyāni bhiṃsanakāni salomahaṃsāni, tathārūpesu senāsanesu vihareyyaṃ appeva nāmāhaṃ bhayabheravaṃ passeyya’nti’’ (ma. ni. 1.49) evaṃ bhagavatā, ‘‘tatrāvuso lobho ca pāpako doso ca pāpako lobhassa ca pahānāya dosassa ca pahānāya atthi majjhimā paṭipadā, cakkhukaraṇī ",
      " ñāṇakaraṇī upasamāya abhiññāya sambodhāya nibbānāya saṃvattatī’’ti (ma. ni. 1.33) evaṃ dhammasenāpatinā ca attano ajjhāsayeneva pavattitadesanāvasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attajjhāsayānusandhi"
      },
      " veditabbo. Yena pana dhammena ādimhi desanā uṭṭhitā, tassa anurūpadhammavasena vā paṭipakkhadhammavasena vā yesu suttesu upari desanā āgacchati, tesaṃ vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathānusandhi"
      },
      " veditabbo. Seyyathidaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ākaṅkheyyasutte"
      },
      " (ma. ni. 1.65) heṭṭhā sīlena desanā uṭṭhitā, upari abhiññā āgatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthusutte"
      },
      " (ma. ni. 1.70) heṭṭhā kilesena desanā uṭṭhitā, upari brahmavihārā āgatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kosambakasutte"
      },
      " (ma. ni. 1.491) heṭṭhā bhaṇḍanena desanā uṭṭhitā, upari sāraṇīyadhammā āgatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kakacūpame"
      },
      " (ma. ni. 1.222) heṭṭhā akkhantiyā vasena desanā uṭṭhitā, upari kakacūpamā āgatāti."
    ],
    "innerText": "‘‘Tassa mayhaṃ brāhmaṇa etadahosi ‘yaṃnūnāhaṃ yā tā rattiyo abhiññātā abhilakkhitā cātuddasī pañcadasī aṭṭhamī ca pakkhassa, tathārūpāsu rattīsu yāni tāni ārāmacetiyāni vanacetiyāni rukkhacetiyāni bhiṃsanakāni salomahaṃsāni, tathārūpesu senāsanesu vihareyyaṃ appeva nāmāhaṃ bhayabheravaṃ passeyya’nti’’ (ma. ni. 1.49) evaṃ bhagavatā, ‘‘tatrāvuso lobho ca pāpako doso ca pāpako lobhassa ca pahānāya dosassa ca pahānāya atthi majjhimā paṭipadā, cakkhukaraṇī ñāṇakaraṇī upasamāya abhiññāya sambodhāya nibbānāya saṃvattatī’’ti (ma. ni. 1.33) evaṃ dhammasenāpatinā ca attano ajjhāsayeneva pavattitadesanāvasena attajjhāsayānusandhi veditabbo. Yena pana dhammena ādimhi desanā uṭṭhitā, tassa anurūpadhammavasena vā paṭipakkhadhammavasena vā yesu suttesu upari desanā āgacchati, tesaṃ vasena yathānusandhi veditabbo. Seyyathidaṃ ākaṅkheyyasutte (ma. ni. 1.65) heṭṭhā sīlena desanā uṭṭhitā, upari abhiññā āgatā. Vatthusutte (ma. ni. 1.70) heṭṭhā kilesena desanā uṭṭhitā, upari brahmavihārā āgatā. Kosambakasutte (ma. ni. 1.491) heṭṭhā bhaṇḍanena desanā uṭṭhitā, upari sāraṇīyadhammā āgatā. Kakacūpame (ma. ni. 1.222) heṭṭhā akkhantiyā vasena desanā uṭṭhitā, upari kakacūpamā āgatāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitthārato panetthā"
      },
      "ti evaṃ saṅkhepato tividho catubbidho ca anusandhi ettha etasmiṃ majjhimanikāye tasmiṃ tasmiṃ sutte yathārahaṃ vitthārato vibhajitvā viññāyamānā navasatādhikāni tīṇi anusandhisahassāni honti. Yathā cetaṃ paṇṇāsādivibhāgavacanaṃ majjhimasaṅgītiyā sarūpadassanatthaṃ hoti, evaṃ pakkhepadosapariharaṇatthañca hoti. Evañhi paṇṇāsādīsu vavatthitesu tabbinimuttaṃ kiñci suttaṃ yāva ekaṃ padampi ānetvā imaṃ majjhimasaṅgītiyāti kassaci vattuṃ okāso na siyāti."
    ],
    "innerText": "Vitthārato panetthāti evaṃ saṅkhepato tividho catubbidho ca anusandhi ettha etasmiṃ majjhimanikāye tasmiṃ tasmiṃ sutte yathārahaṃ vitthārato vibhajitvā viññāyamānā navasatādhikāni tīṇi anusandhisahassāni honti. Yathā cetaṃ paṇṇāsādivibhāgavacanaṃ majjhimasaṅgītiyā sarūpadassanatthaṃ hoti, evaṃ pakkhepadosapariharaṇatthañca hoti. Evañhi paṇṇāsādīsu vavatthitesu tabbinimuttaṃ kiñci suttaṃ yāva ekaṃ padampi ānetvā imaṃ majjhimasaṅgītiyāti kassaci vattuṃ okāso na siyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ paṇṇāsavaggasuttabhāṇavārānusandhibyañjanato majjhimasaṅgītiṃ vavatthapetvā idāni naṃ ādito paṭṭhāya saṃvaṇṇetukāmo attano saṃvaṇṇanāya tassā paṭhamamahāsaṅgītiyaṃ nikkhittānukkameneva pavattabhāvaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tattha paṇṇāsāsu mūlapaṇṇāsā ādī’’"
      },
      "tiādimāha. Tattha yathāpaccayaṃ tattha tattha desitattā paññattattā ca vippakiṇṇānaṃ dhammavinayānaṃ saṅgahetvā gāyanaṃ ",
      " kathanaṃ saṅgīti, mahāvisayattā pūjanīyattā ca mahatī saṅgītīti mahāsaṅgīti, paṭhamā mahāsaṅgīti paṭhamamahāsaṅgīti, tassā pavattitakālo paṭhamamahāsaṅgītikālo, tasmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭhamamahāsaṅgītikāle"
      },
      ". Nidadāti desanaṃ desakālādivasena aviditaṃ viditaṃ katvā nidassetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nidānaṃ,"
      },
      " yo lokiyehi ‘‘upogghāto’’ti ",
      " vuccati, svāyamettha ‘‘evaṃ me suta’’ntiādiko gantho veditabbo, na pana ‘‘sanidānāhaṃ, bhikkhave, dhammaṃ desemī’’tiādīsu (a. ni. 3.126) viya ajjhāsayādidesanuppattihetu. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evaṃ me sutantiādikaṃ āyasmatā ānandena paṭhamamahāsaṅgītikāle vuttaṃ nidānamādī’’"
      },
      "ti. Kāmañcettha yassaṃ paṭhamamahāsaṅgītiyaṃ nikkhittānukkamena saṃvaṇṇanaṃ kattukāmo, sā vitthārato vattabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sumaṅgalavilāsiniyaṃ"
      },
      " (dī. ni. ṭī. 1.nidānakathāvaṇṇanā) pana attanā vitthāritattā tattheva gahetabbāti imissā saṃvaṇṇanāya mahantataṃ pariharanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sā panesā’’"
      },
      "tiādimāha."
    ],
    "innerText": "Evaṃ paṇṇāsavaggasuttabhāṇavārānusandhibyañjanato majjhimasaṅgītiṃ vavatthapetvā idāni naṃ ādito paṭṭhāya saṃvaṇṇetukāmo attano saṃvaṇṇanāya tassā paṭhamamahāsaṅgītiyaṃ nikkhittānukkameneva pavattabhāvaṃ dassetuṃ ‘‘tattha paṇṇāsāsu mūlapaṇṇāsā ādī’’tiādimāha. Tattha yathāpaccayaṃ tattha tattha desitattā paññattattā ca vippakiṇṇānaṃ dhammavinayānaṃ saṅgahetvā gāyanaṃ kathanaṃ saṅgīti, mahāvisayattā pūjanīyattā ca mahatī saṅgītīti mahāsaṅgīti, paṭhamā mahāsaṅgīti paṭhamamahāsaṅgīti, tassā pavattitakālo paṭhamamahāsaṅgītikālo, tasmiṃ paṭhamamahāsaṅgītikāle. Nidadāti desanaṃ desakālādivasena aviditaṃ viditaṃ katvā nidassetīti nidānaṃ, yo lokiyehi ‘‘upogghāto’’ti vuccati, svāyamettha ‘‘evaṃ me suta’’ntiādiko gantho veditabbo, na pana ‘‘sanidānāhaṃ, bhikkhave, dhammaṃ desemī’’tiādīsu (a. ni. 3.126) viya ajjhāsayādidesanuppattihetu. Tenevāha ‘‘evaṃ me sutantiādikaṃ āyasmatā ānandena paṭhamamahāsaṅgītikāle vuttaṃ nidānamādī’’ti. Kāmañcettha yassaṃ paṭhamamahāsaṅgītiyaṃ nikkhittānukkamena saṃvaṇṇanaṃ kattukāmo, sā vitthārato vattabbā. Sumaṅgalavilāsiniyaṃ (dī. ni. ṭī. 1.nidānakathāvaṇṇanā) pana attanā vitthāritattā tattheva gahetabbāti imissā saṃvaṇṇanāya mahantataṃ pariharanto ‘‘sā panesā’’tiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nidānakathāvaṇṇanā niṭṭhitā."
  }
]