[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Anupadavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Anupadasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "93"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti anupadasuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "etadavocā"
      },
      "ti etaṃ (paṭi. ma. 3.4) ‘‘paṇḍito’’tiādinā nayena dhammasenāpatisāriputtattherassa guṇakathaṃ avoca. Kasmā? Avasesattheresu hi mahāmoggallānattherassa iddhimāti guṇo pākaṭo, mahākassapassa dhutavādoti, anuruddhattherassa dibbacakkhukoti, upālittherassa vinayadharoti, revatattherassa jhāyī jhānābhiratoti, ānandattherassa bahussutoti. Evaṃ tesaṃ tesaṃ therānaṃ te te guṇā pākaṭā, sāriputtattherassa pana apākaṭā. Kasmā? Paññavato hi guṇā na sakkā akathitā jānituṃ. Iti bhagavā ‘‘sāriputtassa guṇe kathessāmī’’ti sabhāgaparisāya sannipātaṃ āgamesi. Visabhāgapuggalānañhi santike vaṇṇaṃ kathetuṃ na vaṭṭati, te vaṇṇe kathiyamāne avaṇṇameva kathenti. Imasmiṃ pana divase therassa sabhāgaparisā sannipati, tassā sannipatitabhāvaṃ disvā satthā vaṇṇaṃ kathento imaṃ desanaṃ ārabhi."
    ],
    "innerText": "93.Evaṃme sutanti anupadasuttaṃ. Tattha etadavocāti etaṃ (paṭi. ma. 3.4) ‘‘paṇḍito’’tiādinā nayena dhammasenāpatisāriputtattherassa guṇakathaṃ avoca. Kasmā? Avasesattheresu hi mahāmoggallānattherassa iddhimāti guṇo pākaṭo, mahākassapassa dhutavādoti, anuruddhattherassa dibbacakkhukoti, upālittherassa vinayadharoti, revatattherassa jhāyī jhānābhiratoti, ānandattherassa bahussutoti. Evaṃ tesaṃ tesaṃ therānaṃ te te guṇā pākaṭā, sāriputtattherassa pana apākaṭā. Kasmā? Paññavato hi guṇā na sakkā akathitā jānituṃ. Iti bhagavā ‘‘sāriputtassa guṇe kathessāmī’’ti sabhāgaparisāya sannipātaṃ āgamesi. Visabhāgapuggalānañhi santike vaṇṇaṃ kathetuṃ na vaṭṭati, te vaṇṇe kathiyamāne avaṇṇameva kathenti. Imasmiṃ pana divase therassa sabhāgaparisā sannipati, tassā sannipatitabhāvaṃ disvā satthā vaṇṇaṃ kathento imaṃ desanaṃ ārabhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇḍito"
      },
      "ti dhātukusalatā āyatanakusalatā paṭiccasamuppādakusalatā ṭhānāṭṭhānakusalatāti imehi catūhi kāraṇehi paṇḍito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāpañño"
      },
      "tiādīsu mahāpaññādīhi samannāgatoti ",
      " attho."
    ],
    "innerText": "Tattha paṇḍitoti dhātukusalatā āyatanakusalatā paṭiccasamuppādakusalatā ṭhānāṭṭhānakusalatāti imehi catūhi kāraṇehi paṇḍito. Mahāpaññotiādīsu mahāpaññādīhi samannāgatoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatridaṃ mahāpaññādīnaṃ nānattaṃ – tattha katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāpaññā"
      },
      "? Mahante sīlakkhandhe pariggaṇhātīti mahāpaññā, mahante samādhikkhandhe, paññākkhandhe, vimuttikkhandhe, vimuttiñāṇadassanakkhandhe pariggaṇhātīti mahāpaññā, mahantāni ṭhānāṭṭhānāni, mahantā vihārasamāpattiyo ",
      ", mahantāni ariyasaccāni, mahante satipaṭṭhāne, sammappadhāne, iddhipāde, mahantāni indriyāni, balāni, bojjhaṅgāni, mahante ariyamagge, mahantāni sāmaññaphalāni, mahantā abhiññāyo, mahantaṃ paramatthaṃ nibbānaṃ pariggaṇhātīti mahāpaññā."
    ],
    "innerText": "Tatridaṃ mahāpaññādīnaṃ nānattaṃ – tattha katamā mahāpaññā? Mahante sīlakkhandhe pariggaṇhātīti mahāpaññā, mahante samādhikkhandhe, paññākkhandhe, vimuttikkhandhe, vimuttiñāṇadassanakkhandhe pariggaṇhātīti mahāpaññā, mahantāni ṭhānāṭṭhānāni, mahantā vihārasamāpattiyo , mahantāni ariyasaccāni, mahante satipaṭṭhāne, sammappadhāne, iddhipāde, mahantāni indriyāni, balāni, bojjhaṅgāni, mahante ariyamagge, mahantāni sāmaññaphalāni, mahantā abhiññāyo, mahantaṃ paramatthaṃ nibbānaṃ pariggaṇhātīti mahāpaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puthupaññā,"
      },
      " puthu nānākhandhesu ñāṇaṃ pavattatīti puthupaññā. Puthu nānādhātūsu, puthu nānāāyatanesu, puthu nānāatthesu, puthu nānāpaṭiccasamuppādesu, puthu nānāsuññatamanupalabbhesu, puthu nānāatthesu, dhammesu, niruttīsu, paṭibhānesu, puthu nānāsīlakkhandhesu, puthu nānāsamādhi-paññā-vimutti-vimuttiñāṇadassanakkhandhesu, puthu nānāṭhānāṭṭhānesu, puthu nānāvihārasamāpattīsu, puthu nānāariyasaccesu, puthu nānāsatipaṭṭhānesu, sammappadhānesu, iddhipādesu, indriyesu, balesu, bojjhaṅgesu, puthu nānāariyamaggesu, sāmaññaphalesu, abhiññāsu, puthu nānājanasādhāraṇe dhamme samatikkamma paramatthe nibbāne ñāṇaṃ pavattatīti puthupaññā."
    ],
    "innerText": "Katamā puthupaññā, puthu nānākhandhesu ñāṇaṃ pavattatīti puthupaññā. Puthu nānādhātūsu, puthu nānāāyatanesu, puthu nānāatthesu, puthu nānāpaṭiccasamuppādesu, puthu nānāsuññatamanupalabbhesu, puthu nānāatthesu, dhammesu, niruttīsu, paṭibhānesu, puthu nānāsīlakkhandhesu, puthu nānāsamādhi-paññā-vimutti-vimuttiñāṇadassanakkhandhesu, puthu nānāṭhānāṭṭhānesu, puthu nānāvihārasamāpattīsu, puthu nānāariyasaccesu, puthu nānāsatipaṭṭhānesu, sammappadhānesu, iddhipādesu, indriyesu, balesu, bojjhaṅgesu, puthu nānāariyamaggesu, sāmaññaphalesu, abhiññāsu, puthu nānājanasādhāraṇe dhamme samatikkamma paramatthe nibbāne ñāṇaṃ pavattatīti puthupaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hāsapaññā,"
      },
      " idhekacco hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo sīlaṃ paripūreti, indriyasaṃvaraṃ paripūreti, bhojane mattaññutaṃ, jāgariyānuyogaṃ, sīlakkhandhaṃ, samādhikkhandhaṃ, paññākkhandhaṃ, vimuttikkhandhaṃ, vimuttiñāṇadassanakkhandhaṃ paripūretīti hāsapaññā. Hāsabahulo pāmojjabahulo ṭhānāṭṭhānaṃ paṭivijjhati, hāsabahulo vihārasamāpattiyo paripūretīti hāsapaññā, hāsabahulo ariyasaccāni paṭivijjhati. Satipaṭṭhāne, sammappadhāne, iddhipāde, indriyāni, balāni, bojjhaṅgāni, ariyamaggaṃ bhāvetīti hāsapaññā, hāsabahulo sāmaññaphalāni sacchikaroti, abhiññāyo paṭivijjhatīti hāsapaññā, hāsabahulo vedatuṭṭhipāmojjabahulo paramatthaṃ nibbānaṃ sacchikarotīti hāsapaññā."
    ],
    "innerText": "Katamā hāsapaññā, idhekacco hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo sīlaṃ paripūreti, indriyasaṃvaraṃ paripūreti, bhojane mattaññutaṃ, jāgariyānuyogaṃ, sīlakkhandhaṃ, samādhikkhandhaṃ, paññākkhandhaṃ, vimuttikkhandhaṃ, vimuttiñāṇadassanakkhandhaṃ paripūretīti hāsapaññā. Hāsabahulo pāmojjabahulo ṭhānāṭṭhānaṃ paṭivijjhati, hāsabahulo vihārasamāpattiyo paripūretīti hāsapaññā, hāsabahulo ariyasaccāni paṭivijjhati. Satipaṭṭhāne, sammappadhāne, iddhipāde, indriyāni, balāni, bojjhaṅgāni, ariyamaggaṃ bhāvetīti hāsapaññā, hāsabahulo sāmaññaphalāni sacchikaroti, abhiññāyo paṭivijjhatīti hāsapaññā, hāsabahulo vedatuṭṭhipāmojjabahulo paramatthaṃ nibbānaṃ sacchikarotīti hāsapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "javanapaññā,"
      },
      " yaṃkiñci rūpaṃ atītānāgatapaccuppannaṃ…pe… yaṃ dūre santike vā, sabbaṃ rūpaṃ aniccato khippaṃ javatīti javanapaññā. Dukkhato khippaṃ… anattato khippaṃ javatīti javanapaññā. Yā kāci vedanā…pe… yaṃkiñci viññāṇaṃ atītānāgatapaccuppannaṃ…pe… sabbaṃ viññāṇaṃ aniccato dukkhato anattato khippaṃ javatīti javanapaññā. Cakkhu…pe… jarāmaraṇaṃ atītānāgatapaccuppannaṃ aniccato dukkhato ",
      " anattato khippaṃ javatīti javanapaññā. Rūpaṃ atītānāgatapaccuppannaṃ aniccaṃ khayaṭṭhena, dukkhaṃ bhayaṭṭhena, anattā asārakaṭṭhenāti tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā rūpanirodhe nibbāne khippaṃ ",
      " javatīti javanapaññā. Vedanā, saññā, saṅkhārā, viññāṇaṃ ",
      ", cakkhu…pe… jarāmaraṇaṃ atītānāgatapaccuppannaṃ aniccaṃ khayaṭṭhena…pe… vibhūtaṃ katvā jarāmaraṇanirodhe nibbāne khippaṃ javatīti javanapaññā. Rūpaṃ atītānāgatapaccuppannaṃ…pe… viññāṇaṃ. Cakkhu…pe… jarāmaraṇaṃ atītānāgatapaccuppannaṃ aniccaṃ saṅkhataṃ paṭiccasamuppannaṃ khayadhammaṃ vayadhammaṃ virāgadhammaṃ nirodhadhammanti tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā jarāmaraṇanirodhe nibbāne khippaṃ javatīti javanapaññā."
    ],
    "innerText": "Katamā javanapaññā, yaṃkiñci rūpaṃ atītānāgatapaccuppannaṃ…pe… yaṃ dūre santike vā, sabbaṃ rūpaṃ aniccato khippaṃ javatīti javanapaññā. Dukkhato khippaṃ… anattato khippaṃ javatīti javanapaññā. Yā kāci vedanā…pe… yaṃkiñci viññāṇaṃ atītānāgatapaccuppannaṃ…pe… sabbaṃ viññāṇaṃ aniccato dukkhato anattato khippaṃ javatīti javanapaññā. Cakkhu…pe… jarāmaraṇaṃ atītānāgatapaccuppannaṃ aniccato dukkhato anattato khippaṃ javatīti javanapaññā. Rūpaṃ atītānāgatapaccuppannaṃ aniccaṃ khayaṭṭhena, dukkhaṃ bhayaṭṭhena, anattā asārakaṭṭhenāti tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā rūpanirodhe nibbāne khippaṃ javatīti javanapaññā. Vedanā, saññā, saṅkhārā, viññāṇaṃ , cakkhu…pe… jarāmaraṇaṃ atītānāgatapaccuppannaṃ aniccaṃ khayaṭṭhena…pe… vibhūtaṃ katvā jarāmaraṇanirodhe nibbāne khippaṃ javatīti javanapaññā. Rūpaṃ atītānāgatapaccuppannaṃ…pe… viññāṇaṃ. Cakkhu…pe… jarāmaraṇaṃ atītānāgatapaccuppannaṃ aniccaṃ saṅkhataṃ paṭiccasamuppannaṃ khayadhammaṃ vayadhammaṃ virāgadhammaṃ nirodhadhammanti tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā jarāmaraṇanirodhe nibbāne khippaṃ javatīti javanapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikkhapaññā,"
      },
      " khippaṃ kilese chindatīti tikkhapaññā. Uppannaṃ kāmavitakkaṃ nādhivāseti, uppannaṃ byāpādavitakkaṃ, uppannaṃ vihiṃsāvitakkaṃ, uppannuppanne pāpake akusale dhamme, uppannaṃ rāgaṃ, dosaṃ, mohaṃ, kodhaṃ, upanāhaṃ, makkhaṃ, paḷāsaṃ, issaṃ, macchariyaṃ, māyaṃ, sāṭheyyaṃ, thambhaṃ, sārambhaṃ, mānaṃ, atimānaṃ, madaṃ, pamādaṃ, sabbe kilese, sabbe duccarite, sabbe abhisaṅkhāre, sabbe bhavagāmikamme nādhivāseti pajahati vinodeti byantīkaroti anabhāvaṃ gametīti tikkhapaññā. Ekasmiṃ āsane cattāro ariyamaggā, cattāri sāmaññaphalāni, catasso paṭisambhidāyo, cha ca abhiññāyo adhigatā honti sacchikatā passitā paññāyāti tikkhapaññā."
    ],
    "innerText": "Katamā tikkhapaññā, khippaṃ kilese chindatīti tikkhapaññā. Uppannaṃ kāmavitakkaṃ nādhivāseti, uppannaṃ byāpādavitakkaṃ, uppannaṃ vihiṃsāvitakkaṃ, uppannuppanne pāpake akusale dhamme, uppannaṃ rāgaṃ, dosaṃ, mohaṃ, kodhaṃ, upanāhaṃ, makkhaṃ, paḷāsaṃ, issaṃ, macchariyaṃ, māyaṃ, sāṭheyyaṃ, thambhaṃ, sārambhaṃ, mānaṃ, atimānaṃ, madaṃ, pamādaṃ, sabbe kilese, sabbe duccarite, sabbe abhisaṅkhāre, sabbe bhavagāmikamme nādhivāseti pajahati vinodeti byantīkaroti anabhāvaṃ gametīti tikkhapaññā. Ekasmiṃ āsane cattāro ariyamaggā, cattāri sāmaññaphalāni, catasso paṭisambhidāyo, cha ca abhiññāyo adhigatā honti sacchikatā passitā paññāyāti tikkhapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nibbedhikapaññā,"
      },
      " idhekacco sabbasaṅkhāresu ubbegabahulo hoti uttāsabahulo ukkaṇṭhanabahulo aratibahulo ",
      " anabhiratibahulo bahimukho na ramati sabbasaṅkhāresu, anibbiddhapubbaṃ appadālitapubbaṃ lobhakkhandhaṃ nibbijjhati padāletīti nibbedhikapaññā. Anibbiddhapubbaṃ appadālitapubbaṃ dosakkhandhaṃ, mohakkhandhaṃ, kodhaṃ, upanāhaṃ…pe… sabbe bhavagāmikamme nibbijjhati padāletīti nibbedhikapaññā."
    ],
    "innerText": "Katamā nibbedhikapaññā, idhekacco sabbasaṅkhāresu ubbegabahulo hoti uttāsabahulo ukkaṇṭhanabahulo aratibahulo anabhiratibahulo bahimukho na ramati sabbasaṅkhāresu, anibbiddhapubbaṃ appadālitapubbaṃ lobhakkhandhaṃ nibbijjhati padāletīti nibbedhikapaññā. Anibbiddhapubbaṃ appadālitapubbaṃ dosakkhandhaṃ, mohakkhandhaṃ, kodhaṃ, upanāhaṃ…pe… sabbe bhavagāmikamme nibbijjhati padāletīti nibbedhikapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupadadhammavipassana"
      },
      "nti samāpattivasena vā jhānaṅgavasena vā anupaṭipāṭiyā dhammavipassanaṃ vipassati, evaṃ vipassanto addhamāsena arahattaṃ patto. Mahāmoggallānatthero pana ",
      " sattahi divasehi. Evaṃ santepi sāriputtatthero mahāpaññavantataro. Mahāmoggallānatthero hi sāvakānaṃ sammasanacāraṃ yaṭṭhikoṭiyā uppīḷento viya ekadesameva sammasanto satta divase vāyamitvā arahattaṃ patto. Sāriputtatthero ṭhapetvā buddhānaṃ paccekabuddhānañca sammasanacāraṃ sāvakānaṃ sammasanacāraṃ nippadesaṃ sammasi. Evaṃ sammasanto addhamāsaṃ vāyami. Arahattañca kira patvā aññāsi – ‘‘ṭhapetvā buddhe ca paccekabuddhe ca añño sāvako nāma paññāya ",
      " mayā pattabbaṃ pattuṃ samattho nāma na bhavissatī’’ti. Yathā hi puriso veḷuyaṭṭhiṃ gaṇhissāmīti mahājaṭaṃ veḷuṃ disvā jaṭaṃ chindantassa papañco bhavissatīti antarena hatthaṃ pavesetvā sampattameva yaṭṭhiṃ mūle ca agge ca chinditvā ādāya pakkameyya, so kiñcāpi paṭhamataraṃ gacchati, yaṭṭhiṃ pana sāraṃ vā ujuṃ vā na labhati. Aparo ca tathārūpameva veṇuṃ disvā ‘‘sace sampattaṃ yaṭṭhiṃ gaṇhissāmi, sāraṃ vā ujuṃ vā na labhissāmī’’ti kacchaṃ bandhitvā ",
      " mahantena satthena veṇujaṭaṃ chinditvā sārā ceva ujū ca yaṭṭhiyo uccinitvā ādāya pakkameyya. Ayaṃ kiñcāpi pacchā gacchati, yaṭṭhiyo pana sārā ceva ujū ca labhati. Evaṃsampadamidaṃ veditabbaṃ imesaṃ dvinnaṃ therānaṃ padhānaṃ."
    ],
    "innerText": "Anupadadhammavipassananti samāpattivasena vā jhānaṅgavasena vā anupaṭipāṭiyā dhammavipassanaṃ vipassati, evaṃ vipassanto addhamāsena arahattaṃ patto. Mahāmoggallānatthero pana sattahi divasehi. Evaṃ santepi sāriputtatthero mahāpaññavantataro. Mahāmoggallānatthero hi sāvakānaṃ sammasanacāraṃ yaṭṭhikoṭiyā uppīḷento viya ekadesameva sammasanto satta divase vāyamitvā arahattaṃ patto. Sāriputtatthero ṭhapetvā buddhānaṃ paccekabuddhānañca sammasanacāraṃ sāvakānaṃ sammasanacāraṃ nippadesaṃ sammasi. Evaṃ sammasanto addhamāsaṃ vāyami. Arahattañca kira patvā aññāsi – ‘‘ṭhapetvā buddhe ca paccekabuddhe ca añño sāvako nāma paññāya mayā pattabbaṃ pattuṃ samattho nāma na bhavissatī’’ti. Yathā hi puriso veḷuyaṭṭhiṃ gaṇhissāmīti mahājaṭaṃ veḷuṃ disvā jaṭaṃ chindantassa papañco bhavissatīti antarena hatthaṃ pavesetvā sampattameva yaṭṭhiṃ mūle ca agge ca chinditvā ādāya pakkameyya, so kiñcāpi paṭhamataraṃ gacchati, yaṭṭhiṃ pana sāraṃ vā ujuṃ vā na labhati. Aparo ca tathārūpameva veṇuṃ disvā ‘‘sace sampattaṃ yaṭṭhiṃ gaṇhissāmi, sāraṃ vā ujuṃ vā na labhissāmī’’ti kacchaṃ bandhitvā mahantena satthena veṇujaṭaṃ chinditvā sārā ceva ujū ca yaṭṭhiyo uccinitvā ādāya pakkameyya. Ayaṃ kiñcāpi pacchā gacchati, yaṭṭhiyo pana sārā ceva ujū ca labhati. Evaṃsampadamidaṃ veditabbaṃ imesaṃ dvinnaṃ therānaṃ padhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ pana addhamāsaṃ vāyamitvā dhammasenāpati sāriputtatthero sūkarakhataleṇadvāre bhāgineyyassa dīghanakhaparibbājakassa vedanāpariggahasuttante desiyamāne dasabalaṃ bījayamāno ṭhito desanānusārena ñāṇaṃ pesetvā pabbajitadivasato pannarasame divase sāvakapāramiñāṇassa matthakaṃ patvā sattasaṭṭhi ñāṇāni paṭivijjhitvā soḷasavidhaṃ paññaṃ anuppatto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatridaṃ, bhikkhave, sāriputtassa anupadadhammavipassanāyā"
      },
      "ti yā anupadadhammavipassanaṃ vipassatīti anupadadhammavipassanā vuttā, tatra anupadadhammavipassanāya sāriputtassa idaṃ hoti. Idāni vattabbaṃ taṃ taṃ vipassanākoṭṭhāsaṃ sandhāyetaṃ vuttaṃ."
    ],
    "innerText": "Tatridaṃ, bhikkhave, sāriputtassa anupadadhammavipassanāyāti yā anupadadhammavipassanaṃ vipassatīti anupadadhammavipassanā vuttā, tatra anupadadhammavipassanāya sāriputtassa idaṃ hoti. Idāni vattabbaṃ taṃ taṃ vipassanākoṭṭhāsaṃ sandhāyetaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "94"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhame jhāne"
      },
      "ti ye paṭhame jhāne antosamāpattiyaṃ dhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tyāssā"
      },
      "ti te assa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupadavavatthitā hontī"
      },
      "ti anupaṭipāṭiyā vavatthitā paricchinnā ñātā viditā honti. Kathaṃ? Thero hi te dhamme olokento abhiniropanalakkhaṇo vitakko vattatīti jānāti. Tathā anumajjanalakkhaṇo vicāro, pharaṇalakkhaṇā pīti, sātalakkhaṇaṃ sukhaṃ, avikkhepalakkhaṇā ",
      " cittekaggatā, phusanalakkhaṇo phasso vedayitalakkhaṇā vedanā, sañjānanalakkhaṇā saññā, cetayitalakkhaṇā cetanā, vijānanalakkhaṇaṃ ",
      " viññāṇaṃ, kattukamyatālakkhaṇo chando, adhimokkhalakkhaṇo adhimokkho, paggāhalakkhaṇaṃ vīriyaṃ ",
      " upaṭṭhānalakkhaṇā sati, majjhattalakkhaṇā upekkhā, anunayamanasikāralakkhaṇo manasikāro vattatīti jānāti. Evaṃ jānaṃ abhiniropanaṭṭhena vitakkaṃ sabhāvato vavatthapeti…pe… anunayamanasikāraṇaṭṭhena manasikāraṃ sabhāvabhāvato vavatthapeti. Tena vuttaṃ ‘‘tyāssa dhammā anupadavavatthitā hontī’’ti."
    ],
    "innerText": "94.Paṭhame jhāneti ye paṭhame jhāne antosamāpattiyaṃ dhammā. Tyāssāti te assa. Anupadavavatthitā hontīti anupaṭipāṭiyā vavatthitā paricchinnā ñātā viditā honti. Kathaṃ? Thero hi te dhamme olokento abhiniropanalakkhaṇo vitakko vattatīti jānāti. Tathā anumajjanalakkhaṇo vicāro, pharaṇalakkhaṇā pīti, sātalakkhaṇaṃ sukhaṃ, avikkhepalakkhaṇā cittekaggatā, phusanalakkhaṇo phasso vedayitalakkhaṇā vedanā, sañjānanalakkhaṇā saññā, cetayitalakkhaṇā cetanā, vijānanalakkhaṇaṃ viññāṇaṃ, kattukamyatālakkhaṇo chando, adhimokkhalakkhaṇo adhimokkho, paggāhalakkhaṇaṃ vīriyaṃ upaṭṭhānalakkhaṇā sati, majjhattalakkhaṇā upekkhā, anunayamanasikāralakkhaṇo manasikāro vattatīti jānāti. Evaṃ jānaṃ abhiniropanaṭṭhena vitakkaṃ sabhāvato vavatthapeti…pe… anunayamanasikāraṇaṭṭhena manasikāraṃ sabhāvabhāvato vavatthapeti. Tena vuttaṃ ‘‘tyāssa dhammā anupadavavatthitā hontī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viditā uppajjantī"
      },
      "ti uppajjamānā viditā pākaṭāva hutvā uppajjanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viditā upaṭṭhahantī"
      },
      "ti tiṭṭhamānāpi viditā pākaṭāva hutvā tiṭṭhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viditā abbhatthaṃ gacchantī"
      },
      "ti nirujjhamānāpi viditā pākaṭāva hutvā nirujjhanti. Ettha pana taṃñāṇatā ceva ñāṇabahutā ca mocetabbā. Yathā hi teneva aṅgulaggena taṃ aṅgulaggaṃ na sakkā phusituṃ, evameva teneva cittena tassa cittassa uppādo vā ṭhiti vā bhaṅgo vā na sakkā jānitunti. Evaṃ tāva taṃñāṇatā mocetabbā. Yadi pana dve cittāni ekato uppajjeyyuṃ, ekena cittena ekassa uppādo vā ṭhiti vā bhaṅgo vā sakkā bhaveyya jānituṃ. Dve pana phassā vā vedanā vā saññā vā cetanā vā cittāni vā ekato uppajjanakāni nāma natthi, ekekameva uppajjati. Evaṃ ñāṇabahutā mocetabbā. Evaṃ sante kathaṃ? Mahātherassa antosamāpattiyaṃ soḷasa dhammā viditā pākaṭā hontīti. Vatthārammaṇānaṃ pariggahitatāya. Therena hi vatthu ceva ārammaṇañca pariggahitaṃ, tenassa tesaṃ dhammānaṃ uppādaṃ āvajjantassa uppādo pākaṭo hoti, ṭhānaṃ āvajjantassa ṭhānaṃ pākaṭaṃ hoti, bhedaṃ āvajjantassa ",
      " bhedo pākaṭo hoti. Tena vuttaṃ ‘‘viditā uppajjanti viditā upaṭṭhahanti viditā abbhatthaṃ gacchantī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahutvā sambhontī"
      },
      "ti iminā udayaṃ passati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hutvā paṭiventī"
      },
      "ti iminā vayaṃ passati."
    ],
    "innerText": "Viditā uppajjantīti uppajjamānā viditā pākaṭāva hutvā uppajjanti. Viditā upaṭṭhahantīti tiṭṭhamānāpi viditā pākaṭāva hutvā tiṭṭhanti. Viditā abbhatthaṃ gacchantīti nirujjhamānāpi viditā pākaṭāva hutvā nirujjhanti. Ettha pana taṃñāṇatā ceva ñāṇabahutā ca mocetabbā. Yathā hi teneva aṅgulaggena taṃ aṅgulaggaṃ na sakkā phusituṃ, evameva teneva cittena tassa cittassa uppādo vā ṭhiti vā bhaṅgo vā na sakkā jānitunti. Evaṃ tāva taṃñāṇatā mocetabbā. Yadi pana dve cittāni ekato uppajjeyyuṃ, ekena cittena ekassa uppādo vā ṭhiti vā bhaṅgo vā sakkā bhaveyya jānituṃ. Dve pana phassā vā vedanā vā saññā vā cetanā vā cittāni vā ekato uppajjanakāni nāma natthi, ekekameva uppajjati. Evaṃ ñāṇabahutā mocetabbā. Evaṃ sante kathaṃ? Mahātherassa antosamāpattiyaṃ soḷasa dhammā viditā pākaṭā hontīti. Vatthārammaṇānaṃ pariggahitatāya. Therena hi vatthu ceva ārammaṇañca pariggahitaṃ, tenassa tesaṃ dhammānaṃ uppādaṃ āvajjantassa uppādo pākaṭo hoti, ṭhānaṃ āvajjantassa ṭhānaṃ pākaṭaṃ hoti, bhedaṃ āvajjantassa bhedo pākaṭo hoti. Tena vuttaṃ ‘‘viditā uppajjanti viditā upaṭṭhahanti viditā abbhatthaṃ gacchantī’’ti. Ahutvā sambhontīti iminā udayaṃ passati. Hutvā paṭiventīti iminā vayaṃ passati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupāyo"
      },
      "ti rāgavasena anupagamano hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anapāyo"
      },
      "ti paṭighavasena anapagato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anissito"
      },
      "ti taṇhādiṭṭhinissayehi anissito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaṭibaddho"
      },
      "ti chandarāgena abaddho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vippamutto"
      },
      "ti kāmarāgato vippamutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visaṃyutto"
      },
      "ti catūhi yogehi sabbakilesehi vā visaṃyutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimariyādīkatenā"
      },
      "ti nimmariyādīkatena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cetasā"
      },
      "ti evaṃvidhena cittena viharati."
    ],
    "innerText": "Anupāyoti rāgavasena anupagamano hutvā. Anapāyoti paṭighavasena anapagato. Anissitoti taṇhādiṭṭhinissayehi anissito. Appaṭibaddhoti chandarāgena abaddho. Vippamuttoti kāmarāgato vippamutto. Visaṃyuttoti catūhi yogehi sabbakilesehi vā visaṃyutto. Vimariyādīkatenāti nimmariyādīkatena. Cetasāti evaṃvidhena cittena viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " dve mariyādā kilesamariyādā ca ārammaṇamariyādā ca. Sace hissa antosamāpattiyaṃ pavatte soḷasa dhamme ārabbha rāgādayo uppajjeyyuṃ, kilesamariyādā tena katā bhaveyya, tesu panassa ekopi na uppannoti kilesamariyādā natthi. Sace panassa antosamāpattiyaṃ pavatte soḷasa dhamme āvajjantassa ekacce āpāthaṃ nāgaccheyyuṃ. Evamassa ārammaṇamariyādā bhaveyyuṃ. Te panassa soḷasa dhamme āvajjantassa āpāthaṃ anāgatadhammo nāma natthīti ārammaṇamariyādāpi natthi."
    ],
    "innerText": "Tattha dve mariyādā kilesamariyādā ca ārammaṇamariyādā ca. Sace hissa antosamāpattiyaṃ pavatte soḷasa dhamme ārabbha rāgādayo uppajjeyyuṃ, kilesamariyādā tena katā bhaveyya, tesu panassa ekopi na uppannoti kilesamariyādā natthi. Sace panassa antosamāpattiyaṃ pavatte soḷasa dhamme āvajjantassa ekacce āpāthaṃ nāgaccheyyuṃ. Evamassa ārammaṇamariyādā bhaveyyuṃ. Te panassa soḷasa dhamme āvajjantassa āpāthaṃ anāgatadhammo nāma natthīti ārammaṇamariyādāpi natthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Aparāpi dve mariyādā vikkhambhanamariyādā ca samucchedamariyādā ca. Tāsu samucchedamariyādā upari āgamissati, imasmiṃ pana ṭhāne vikkhambhanamariyādā adhippetā. Tassa vikkhambhitapaccanīkattā natthīti vimariyādikatena cetasā viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttari"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissaraṇa"
      },
      "nti ito uttari nissaraṇaṃ. Aññesu ca suttesu ‘‘uttari nissaraṇa’’nti nibbānaṃ vuttaṃ, idha pana anantaro viseso adhippetoti veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tabbahulīkārā"
      },
      "ti tassa pajānanassa bahulīkaraṇena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthitvevassa hotī"
      },
      "ti tassa therassa atthītiyeva daḷhataraṃ hoti. Iminā nayena sesavāresupi attho veditabbo."
    ],
    "innerText": "Uttarinissaraṇanti ito uttari nissaraṇaṃ. Aññesu ca suttesu ‘‘uttari nissaraṇa’’nti nibbānaṃ vuttaṃ, idha pana anantaro viseso adhippetoti veditabbo. Tabbahulīkārāti tassa pajānanassa bahulīkaraṇena. Atthitvevassa hotīti tassa therassa atthītiyeva daḷhataraṃ hoti. Iminā nayena sesavāresupi attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiyavāre pana sampasādanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampasādo"
      },
      ". Sabhāvato vavatthapeti."
    ],
    "innerText": "Dutiyavāre pana sampasādanaṭṭhena sampasādo. Sabhāvato vavatthapeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catutthavāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upekkhā"
      },
      "ti sukhaṭṭhāne vedanupekkhāva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passaddhattā cetaso anābhogo"
      },
      "ti yo so ‘‘yadeva tattha sukha’’nti cetaso ābhogo, etenetaṃ oḷārikamakkhāyatīti evaṃ passaddhattā cetaso anābhogo vutto, tassa abhāvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satipārisuddhī"
      },
      "ti parisuddhāsatiyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upekkhāpi"
      },
      " pārisuddhiupekkhā."
    ],
    "innerText": "Catutthavāre upekkhāti sukhaṭṭhāne vedanupekkhāva. Passaddhattā cetaso anābhogoti yo so ‘‘yadeva tattha sukha’’nti cetaso ābhogo, etenetaṃ oḷārikamakkhāyatīti evaṃ passaddhattā cetaso anābhogo vutto, tassa abhāvāti attho. Satipārisuddhīti parisuddhāsatiyeva. Upekkhāpi pārisuddhiupekkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "95"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sato vuṭṭhahatī"
      },
      "ti satiyā samannāgato ñāṇena sampajāno hutvā vuṭṭhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te dhamme samanupassatī"
      },
      "ti yasmā nevasaññānāsaññāyatane buddhānaṃyeva anupadadhammavipassanā hoti, na sāvakānaṃ, tasmā ettha kalāpavipassanaṃ dassento evamāha."
    ],
    "innerText": "95.Sato vuṭṭhahatīti satiyā samannāgato ñāṇena sampajāno hutvā vuṭṭhāti. Te dhamme samanupassatīti yasmā nevasaññānāsaññāyatane buddhānaṃyeva anupadadhammavipassanā hoti, na sāvakānaṃ, tasmā ettha kalāpavipassanaṃ dassento evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāya"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cassa disvā āsavā parikkhīṇā hontī"
      },
      "ti maggapaññāya cattāri saccāni disvā cattāro āsavā khīṇā honti. Sāriputtattherassa samathavipassanaṃ yuganaddhaṃ āharitvā ",
      " arahattaṃ pattavāropi atthi, nirodhasamāpattisamāpannavāropi. Arahattaṃ pattavāro idha gahito, nirodhaṃ pana ciṇṇavasitāya aparāparaṃ samāpajjissatīti vadanti."
    ],
    "innerText": "Paññāyacassa disvā āsavā parikkhīṇā hontīti maggapaññāya cattāri saccāni disvā cattāro āsavā khīṇā honti. Sāriputtattherassa samathavipassanaṃ yuganaddhaṃ āharitvā arahattaṃ pattavāropi atthi, nirodhasamāpattisamāpannavāropi. Arahattaṃ pattavāro idha gahito, nirodhaṃ pana ciṇṇavasitāya aparāparaṃ samāpajjissatīti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatthassa yasmiṃ kāle nirodhasamāpatti sīsaṃ hoti, nirodhassa vāro āgacchati, phalasamāpatti gūḷhā hoti. Yasmiṃ kāle phalasamāpatti sīsaṃ hoti, phalasamāpattiyā vāro āgacchati, nirodhasamāpatti gūḷhā hoti. Jambudīpavāsino therā pana vadanti ‘‘sāriputtatthero samathavipassanaṃ yuganaddhaṃ āharitvā anāgāmiphalaṃ sacchikatvā nirodhaṃ samāpajji, nirodhā vuṭṭhāya arahattaṃ patto’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te dhamme"
      },
      "ti antosamāpattiyaṃ pavatte tisamuṭṭhānikarūpadhamme, heṭṭhā nevasaññānāsaññāyatanasamāpattiyaṃ pavattadhamme vā. Tepi hi imasmiṃ vāre vipassitabbadhammāva, tasmā te vā vipassatīti dassetuṃ idaṃ vuttanti veditabbaṃ."
    ],
    "innerText": "Tatthassa yasmiṃ kāle nirodhasamāpatti sīsaṃ hoti, nirodhassa vāro āgacchati, phalasamāpatti gūḷhā hoti. Yasmiṃ kāle phalasamāpatti sīsaṃ hoti, phalasamāpattiyā vāro āgacchati, nirodhasamāpatti gūḷhā hoti. Jambudīpavāsino therā pana vadanti ‘‘sāriputtatthero samathavipassanaṃ yuganaddhaṃ āharitvā anāgāmiphalaṃ sacchikatvā nirodhaṃ samāpajji, nirodhā vuṭṭhāya arahattaṃ patto’’ti. Te dhammeti antosamāpattiyaṃ pavatte tisamuṭṭhānikarūpadhamme, heṭṭhā nevasaññānāsaññāyatanasamāpattiyaṃ pavattadhamme vā. Tepi hi imasmiṃ vāre vipassitabbadhammāva, tasmā te vā vipassatīti dassetuṃ idaṃ vuttanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "97"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vasippato"
      },
      "ti ciṇṇavasitaṃ patto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāramippatto"
      },
      "ti nipphattiṃ patto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Oraso"
      },
      "tiādīsu thero bhagavato ure nibbattasaddaṃ sutvā jātoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "oraso,"
      },
      " mukhena pabhāvitaṃ saddaṃ sutvā jātoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mukhato jāto,"
      },
      " dhammena pana jātattā nimmitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammajo dhammanimmito,"
      },
      " dhammadāyassa ādiyanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammadāyādo,"
      },
      " āmisadāyassa anādiyanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "no āmisadāyādo"
      },
      "ti veditabbo. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "97.Vasippatoti ciṇṇavasitaṃ patto. Pāramippattoti nipphattiṃ patto. Orasotiādīsu thero bhagavato ure nibbattasaddaṃ sutvā jātoti oraso, mukhena pabhāvitaṃ saddaṃ sutvā jātoti mukhato jāto, dhammena pana jātattā nimmitattā dhammajo dhammanimmito, dhammadāyassa ādiyanato dhammadāyādo, āmisadāyassa anādiyanato no āmisadāyādoti veditabbo. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anupadasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Chabbisodhanasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "98"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti chabbisodhanasuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khīṇā jātī"
      },
      "tiādīsu ekenāpi padena aññā byākatāva hoti, dvīhipi. Idha pana catūhi padehi aññabyākaraṇaṃ āgataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhe diṭṭhavāditā"
      },
      "tiādīsu yāya ",
      " cetanāya diṭṭhe diṭṭhaṃ meti vadati, sā diṭṭhe diṭṭhavāditā nāma. Sesapadesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayamanudhammo"
      },
      "ti ayaṃ sabhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhinanditabba"
      },
      "nti na kevalaṃ abhinanditabbaṃ, parinibbutassa panassa sabbopi khīṇāsavassa sakkāro kātabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttariṃ pañho"
      },
      "ti sace panassa veyyākaraṇena asantuṭṭhā hotha, uttarimpi ayaṃ pañho pucchitabboti dasseti. Ito paresupi tīsu vāresu ayameva nayo."
    ],
    "innerText": "98.Evaṃme sutanti chabbisodhanasuttaṃ. Tattha khīṇā jātītiādīsu ekenāpi padena aññā byākatāva hoti, dvīhipi. Idha pana catūhi padehi aññabyākaraṇaṃ āgataṃ. Diṭṭhe diṭṭhavāditātiādīsu yāya cetanāya diṭṭhe diṭṭhaṃ meti vadati, sā diṭṭhe diṭṭhavāditā nāma. Sesapadesupi eseva nayo. Ayamanudhammoti ayaṃ sabhāvo. Abhinanditabbanti na kevalaṃ abhinanditabbaṃ, parinibbutassa panassa sabbopi khīṇāsavassa sakkāro kātabbo. Uttariṃ pañhoti sace panassa veyyākaraṇena asantuṭṭhā hotha, uttarimpi ayaṃ pañho pucchitabboti dasseti. Ito paresupi tīsu vāresu ayameva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "99"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abala"
      },
      "nti dubbalaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Virāguna"
      },
      "nti vigacchanasabhāvaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anassāsika"
      },
      "nti assāsavirahitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upāyūpādānā"
      },
      "ti taṇhādiṭṭhīnametaṃ adhivacanaṃ. Taṇhādiṭṭhiyo hi tebhūmakadhamme upentīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upāyā,"
      },
      " upādiyantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upādānā. Cetaso adiṭṭhānābhinivesānusayā"
      },
      "tipi tāsaṃyeva nāmaṃ. Cittañhi taṇhādiṭṭhīhi sakkāyadhammesu tiṭṭhati adhitiṭṭhatīti taṇhādiṭṭhiyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cetaso adhiṭṭhānā,"
      },
      " tāhi taṃ abhinivisatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhinivesā,"
      },
      " tāhiyeva taṃ anusetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anusayā"
      },
      "ti vuccanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khayā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "virāgā"
      },
      "tiādīsu khayena virāgenāti attho. Sabbāni cetāni aññamaññavevacanāneva."
    ],
    "innerText": "99.Abalanti dubbalaṃ. Virāgunanti vigacchanasabhāvaṃ. Anassāsikanti assāsavirahitaṃ. Upāyūpādānāti taṇhādiṭṭhīnametaṃ adhivacanaṃ. Taṇhādiṭṭhiyo hi tebhūmakadhamme upentīti upāyā, upādiyantīti upādānā. Cetaso adiṭṭhānābhinivesānusayātipi tāsaṃyeva nāmaṃ. Cittañhi taṇhādiṭṭhīhi sakkāyadhammesu tiṭṭhati adhitiṭṭhatīti taṇhādiṭṭhiyo cetaso adhiṭṭhānā, tāhi taṃ abhinivisatīti abhinivesā, tāhiyeva taṃ anusetīti anusayāti vuccanti. Khayāvirāgātiādīsu khayena virāgenāti attho. Sabbāni cetāni aññamaññavevacanāneva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "100"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pathavīdhātū"
      },
      "ti patiṭṭhānadhātu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āpodhātū"
      },
      "ti ābandhanadhātu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tejodhātū"
      },
      "ti paripācanadhātu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vāyodhātū"
      },
      "ti vitthambhanadhātu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākāsadhātū"
      },
      "ti asamphuṭṭhadhātu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viññāṇadhātū"
      },
      "ti vijānanadhātu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na anattato upagacchi"
      },
      "nti ahaṃ attāti attakoṭṭhāsena na upagamiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ca pathavīdhātunissita"
      },
      "nti pathavīdhātunissitā sesadhātuyo ca upādārūpañca arūpakkhandhā ca. Tepi hi nissitavatthurūpānaṃ pathavīdhātunissitattā ekena pariyāyena pathavīdhātunissitāva. Tasmā ‘‘na ca pathavīdhātunissita’’nti vadanto sesarūpārūpadhammepi attato na upagacchinti vadati. Ākāsadhātunissitapade pana avinibbhogavasena sabbampi bhūtupādārūpaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ākāsadhātunissitaṃ"
      },
      " nāma ",
      ", tathā taṃnissitarūpavatthukā arūpakkhandhā. Evaṃ idhāpi rūpārūpaṃ gahitameva hoti. Viññāṇadhātunissitapade pana sahajātā tayo khandhā cittasamuṭṭhānarūpañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viññāṇadhātunissita"
      },
      "nti rūpārūpaṃ gahitameva hoti."
    ],
    "innerText": "100.Pathavīdhātūti patiṭṭhānadhātu. Āpodhātūti ābandhanadhātu. Tejodhātūti paripācanadhātu. Vāyodhātūti vitthambhanadhātu. Ākāsadhātūti asamphuṭṭhadhātu. Viññāṇadhātūti vijānanadhātu. Na anattato upagacchinti ahaṃ attāti attakoṭṭhāsena na upagamiṃ. Na ca pathavīdhātunissitanti pathavīdhātunissitā sesadhātuyo ca upādārūpañca arūpakkhandhā ca. Tepi hi nissitavatthurūpānaṃ pathavīdhātunissitattā ekena pariyāyena pathavīdhātunissitāva. Tasmā ‘‘na ca pathavīdhātunissita’’nti vadanto sesarūpārūpadhammepi attato na upagacchinti vadati. Ākāsadhātunissitapade pana avinibbhogavasena sabbampi bhūtupādārūpaṃ ākāsadhātunissitaṃ nāma , tathā taṃnissitarūpavatthukā arūpakkhandhā. Evaṃ idhāpi rūpārūpaṃ gahitameva hoti. Viññāṇadhātunissitapade pana sahajātā tayo khandhā cittasamuṭṭhānarūpañca viññāṇadhātunissitanti rūpārūpaṃ gahitameva hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "101"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpe cakkhuviññāṇe cakkhuviññāṇaviññātabbesu dhammesū"
      },
      "ti ettha yaṃ atīte cakkhudvārassa āpāthaṃ āgantvā niruddhaṃ, yañca anāgate āpāthaṃ ",
      " āgantvā nirujjhissati, yampi etarahi āgantvā niruddhaṃ, taṃ sabbaṃ rūpaṃ nāma. Yaṃ pana atītepi āpāthaṃ anāgantvā niruddhaṃ, anāgatepi anāgantvā nirujjhissati, etarahipi anāgantvā niruddhaṃ, taṃ cakkhuviññāṇaviññātabbadhammesu saṅgahitanti vutte tipiṭakacūḷābhayatthero ",
      " āha – ‘‘imasmiṃ ṭhāne dvidhā karotha, upari chandovāre kinti karissatha, nayidaṃ labbhatī’’ti. Tasmā tīsu kālesu āpāthaṃ āgataṃ vā anāgataṃ vā sabbampi taṃ rūpameva, cakkhuviññāṇasampayuttā pana tayo khandhā cakkhuviññāṇaviññātabbadhammāti veditabbā. Ayañhettha attho ‘‘cakkhuviññāṇena saddhiṃ viññātabbesu dhammesū’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chando"
      },
      "ti taṇhāchando. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rāgo"
      },
      "ti sveva rajjanavasena rāgo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nandī"
      },
      "ti sveva abhinandanavasena nandī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhā"
      },
      "ti sveva taṇhāyanavasena taṇhā. Sesadvāresupi eseva nayo."
    ],
    "innerText": "101.Rūpe cakkhuviññāṇe cakkhuviññāṇaviññātabbesu dhammesūti ettha yaṃ atīte cakkhudvārassa āpāthaṃ āgantvā niruddhaṃ, yañca anāgate āpāthaṃ āgantvā nirujjhissati, yampi etarahi āgantvā niruddhaṃ, taṃ sabbaṃ rūpaṃ nāma. Yaṃ pana atītepi āpāthaṃ anāgantvā niruddhaṃ, anāgatepi anāgantvā nirujjhissati, etarahipi anāgantvā niruddhaṃ, taṃ cakkhuviññāṇaviññātabbadhammesu saṅgahitanti vutte tipiṭakacūḷābhayatthero āha – ‘‘imasmiṃ ṭhāne dvidhā karotha, upari chandovāre kinti karissatha, nayidaṃ labbhatī’’ti. Tasmā tīsu kālesu āpāthaṃ āgataṃ vā anāgataṃ vā sabbampi taṃ rūpameva, cakkhuviññāṇasampayuttā pana tayo khandhā cakkhuviññāṇaviññātabbadhammāti veditabbā. Ayañhettha attho ‘‘cakkhuviññāṇena saddhiṃ viññātabbesu dhammesū’’ti. Chandoti taṇhāchando. Rāgoti sveva rajjanavasena rāgo. Nandīti sveva abhinandanavasena nandī. Taṇhāti sveva taṇhāyanavasena taṇhā. Sesadvāresupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "102"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahaṅkāramamaṅkāramānānusayā"
      },
      "ti ettha ahaṅkāro māno, mamaṅkāro taṇhā, sveva mānānusayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsavānaṃ khayañāṇāyā"
      },
      "ti idaṃ pubbenivāsaṃ dibbacakkhuñca avatvā kasmā vuttaṃ? Bhikkhū lokiyadhammaṃ na pucchanti, lokuttarameva pucchanti, tasmā pucchitapañhaṃyeva kathento evamāha. Ekavissajjitasuttaṃ nāmetaṃ, chabbisodhanantipissa nāmaṃ. Ettha hi cattāro vohārā pañca khandhā cha dhātuyo cha ajjhattikabāhirāni āyatanāni attano saviññāṇakakāyo paresaṃ saviññāṇakakāyoti ime cha koṭṭhāsā visuddhā, tasmā ‘‘chabbisodhaniya’’nti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parasamuddavāsittherā"
      },
      " pana attano ca parassa ca viññāṇakakāyaṃ ekameva katvā catūhi ",
      " āhārehi saddhinti cha koṭṭhāse vadanti."
    ],
    "innerText": "102.Ahaṅkāramamaṅkāramānānusayāti ettha ahaṅkāro māno, mamaṅkāro taṇhā, sveva mānānusayo. Āsavānaṃ khayañāṇāyāti idaṃ pubbenivāsaṃ dibbacakkhuñca avatvā kasmā vuttaṃ? Bhikkhū lokiyadhammaṃ na pucchanti, lokuttarameva pucchanti, tasmā pucchitapañhaṃyeva kathento evamāha. Ekavissajjitasuttaṃ nāmetaṃ, chabbisodhanantipissa nāmaṃ. Ettha hi cattāro vohārā pañca khandhā cha dhātuyo cha ajjhattikabāhirāni āyatanāni attano saviññāṇakakāyo paresaṃ saviññāṇakakāyoti ime cha koṭṭhāsā visuddhā, tasmā ‘‘chabbisodhaniya’’nti vuttaṃ. Parasamuddavāsittherā pana attano ca parassa ca viññāṇakakāyaṃ ekameva katvā catūhi āhārehi saddhinti cha koṭṭhāse vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ime pana cha koṭṭhāsā ‘‘kiṃ te adhigataṃ, kinti te adhigataṃ, kadā te adhigataṃ, kattha ",
      " te adhigataṃ, katame te kilesā pahīnā, katamesaṃ tvaṃ dhammānaṃ lābhī’’ti (pārā. 198) evaṃ vinayaniddesapariyāyena sodhetabbā."
    ],
    "innerText": "Ime pana cha koṭṭhāsā ‘‘kiṃ te adhigataṃ, kinti te adhigataṃ, kadā te adhigataṃ, kattha te adhigataṃ, katame te kilesā pahīnā, katamesaṃ tvaṃ dhammānaṃ lābhī’’ti (pārā. 198) evaṃ vinayaniddesapariyāyena sodhetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiṃ te adhigata"
      },
      "nti adhigamapucchā, jhānavimokkhādīsu sotāpattimaggādīsu vā kiṃ tayā adhigataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kinti te adhigata"
      },
      "nti upāyapucchā. Ayañhi etthādhippāyo – kiṃ tayā aniccalakkhaṇaṃ dhuraṃ katvā adhigataṃ, dukkhānattalakkhaṇesu aññataraṃ vā, kiṃ vā samādhivasena abhinivisitvā ",
      ", udāhu vipassanāvasena, tathā kiṃ rūpe abhinivisitvā, udāhu arūpe, kiṃ vā ajjhattaṃ abhinivisitvā, udāhu bahiddhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kadā te adhigata"
      },
      "nti kālapucchā, pubbaṇhamajjhanhikādīsu katarasmiṃ kāleti vuttaṃ hoti."
    ],
    "innerText": "Ettha hi kiṃ te adhigatanti adhigamapucchā, jhānavimokkhādīsu sotāpattimaggādīsu vā kiṃ tayā adhigataṃ. Kinti te adhigatanti upāyapucchā. Ayañhi etthādhippāyo – kiṃ tayā aniccalakkhaṇaṃ dhuraṃ katvā adhigataṃ, dukkhānattalakkhaṇesu aññataraṃ vā, kiṃ vā samādhivasena abhinivisitvā , udāhu vipassanāvasena, tathā kiṃ rūpe abhinivisitvā, udāhu arūpe, kiṃ vā ajjhattaṃ abhinivisitvā, udāhu bahiddhāti. Kadā te adhigatanti kālapucchā, pubbaṇhamajjhanhikādīsu katarasmiṃ kāleti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kattha te adhigata"
      },
      "nti okāsapucchā, kismiṃ okāse, kiṃ rattiṭṭhāne divāṭṭhāne rukkhamūle maṇḍape katarasmiṃ vā vihāreti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katame te kilesā pahīnā"
      },
      "ti pahīnakilese pucchati, kataramaggavajjhā tava kilesā pahīnāti vuttaṃ hoti."
    ],
    "innerText": "Kattha te adhigatanti okāsapucchā, kismiṃ okāse, kiṃ rattiṭṭhāne divāṭṭhāne rukkhamūle maṇḍape katarasmiṃ vā vihāreti vuttaṃ hoti. Katame te kilesā pahīnāti pahīnakilese pucchati, kataramaggavajjhā tava kilesā pahīnāti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katamesaṃ tvaṃ dhammānaṃ lābhī"
      },
      "ti paṭiladdhadhammapucchā, paṭhamamaggādīsu katamesaṃ tvaṃ dhammānaṃ lābhīti vuttaṃ hoti."
    ],
    "innerText": "Katamesaṃ tvaṃ dhammānaṃ lābhīti paṭiladdhadhammapucchā, paṭhamamaggādīsu katamesaṃ tvaṃ dhammānaṃ lābhīti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmā idāni cepi koci bhikkhu uttarimanussadhammādhigamaṃ byākareyya, na so ettāvatāva sakkātabbo. Imesu pana chasu ṭhānesu sodhanatthaṃ vattabbo ‘‘kiṃ te adhigataṃ, kiṃ jhānaṃ udāhu vimokkhādīsu aññatara’’nti? Yo hi yena adhigato dhammo, so tassa pākaṭo hoti. Sace ‘‘idaṃ nāma me adhigata’’nti vadati, tato ‘‘kinti te adhigata’’nti pucchitabbo. Aniccalakkhaṇādīsu kiṃ dhuraṃ katvā, aṭṭhatiṃsāya vā ārammaṇesu ",
      " rūpārūpaajjhattabahiddhādibhedesu vā dhammesu kena mukhena abhinivisitvāti? Yo hi yassābhiniveso, so tassa pākaṭo hoti."
    ],
    "innerText": "Tasmā idāni cepi koci bhikkhu uttarimanussadhammādhigamaṃ byākareyya, na so ettāvatāva sakkātabbo. Imesu pana chasu ṭhānesu sodhanatthaṃ vattabbo ‘‘kiṃ te adhigataṃ, kiṃ jhānaṃ udāhu vimokkhādīsu aññatara’’nti? Yo hi yena adhigato dhammo, so tassa pākaṭo hoti. Sace ‘‘idaṃ nāma me adhigata’’nti vadati, tato ‘‘kinti te adhigata’’nti pucchitabbo. Aniccalakkhaṇādīsu kiṃ dhuraṃ katvā, aṭṭhatiṃsāya vā ārammaṇesu rūpārūpaajjhattabahiddhādibhedesu vā dhammesu kena mukhena abhinivisitvāti? Yo hi yassābhiniveso, so tassa pākaṭo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sace pana ‘‘ayaṃ nāma me abhiniveso, evaṃ mayā adhigata’’nti vadati, tato ‘‘kadā te adhigata’’nti pucchitabbo, ‘‘kiṃ pubbaṇhe, udāhu majjhanhikādīsu aññatarasmiṃ kāle’’ti ",
      "? Sabbesañhi attanā adhigatakālo pākaṭo hoti. Sace ‘‘amukasmiṃ nāma me kāle adhigata’’nti vadati, tato ‘‘kattha te adhigata’’nti pucchitabbo, ‘‘kiṃ divāṭṭhāne, udāhu rattiṭṭhānādīsu aññatarasmiṃ okāse’’ti? Sabbesañhi attanā adhigatokāso pākaṭo hoti. Sace ‘‘amukasmiṃ nāma me okāse adhigata’’nti vadati, tato ‘‘katame te kilesā pahīnā’’ti pucchitabbo, ‘‘kiṃ paṭhamamaggavajjhā, udāhu dutiyādimaggavajjhā’’ti? Sabbesañhi attanā adhigatamaggena pahīnakilesā pākaṭā honti."
    ],
    "innerText": "Sace pana ‘‘ayaṃ nāma me abhiniveso, evaṃ mayā adhigata’’nti vadati, tato ‘‘kadā te adhigata’’nti pucchitabbo, ‘‘kiṃ pubbaṇhe, udāhu majjhanhikādīsu aññatarasmiṃ kāle’’ti ? Sabbesañhi attanā adhigatakālo pākaṭo hoti. Sace ‘‘amukasmiṃ nāma me kāle adhigata’’nti vadati, tato ‘‘kattha te adhigata’’nti pucchitabbo, ‘‘kiṃ divāṭṭhāne, udāhu rattiṭṭhānādīsu aññatarasmiṃ okāse’’ti? Sabbesañhi attanā adhigatokāso pākaṭo hoti. Sace ‘‘amukasmiṃ nāma me okāse adhigata’’nti vadati, tato ‘‘katame te kilesā pahīnā’’ti pucchitabbo, ‘‘kiṃ paṭhamamaggavajjhā, udāhu dutiyādimaggavajjhā’’ti? Sabbesañhi attanā adhigatamaggena pahīnakilesā pākaṭā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sace ",
      " ‘‘ime nāma me kilesā pahīnā’’ti vadati, tato ‘‘katamesaṃ tvaṃ dhammānaṃ lābhī’’ti pucchitabbo, ‘‘kiṃ sotāpattimaggassa, udāhu sakadāgāmimaggādīsu aññatarassā’’ti? Sabbesañhi attanā adhigatadhammo pākaṭo hoti. Sace ‘‘imesaṃ nāmāhaṃ dhammānaṃ lābhī’’ti vadati, ettāvatāpissa vacanaṃ na saddhātabbaṃ. Bahussutā hi uggahaparipucchākusalā bhikkhū imāni cha ṭhānāni sodhetuṃ sakkonti. Imassa bhikkhuno āgamanapaṭipadā sodhetabbā, yadi āgamanapaṭipadā na sujjhati, ‘‘imāya paṭipadāya lokuttaradhammā nāma na labbhantī’’ti apanetabbo."
    ],
    "innerText": "Sace ‘‘ime nāma me kilesā pahīnā’’ti vadati, tato ‘‘katamesaṃ tvaṃ dhammānaṃ lābhī’’ti pucchitabbo, ‘‘kiṃ sotāpattimaggassa, udāhu sakadāgāmimaggādīsu aññatarassā’’ti? Sabbesañhi attanā adhigatadhammo pākaṭo hoti. Sace ‘‘imesaṃ nāmāhaṃ dhammānaṃ lābhī’’ti vadati, ettāvatāpissa vacanaṃ na saddhātabbaṃ. Bahussutā hi uggahaparipucchākusalā bhikkhū imāni cha ṭhānāni sodhetuṃ sakkonti. Imassa bhikkhuno āgamanapaṭipadā sodhetabbā, yadi āgamanapaṭipadā na sujjhati, ‘‘imāya paṭipadāya lokuttaradhammā nāma na labbhantī’’ti apanetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadi panassa āgamanapaṭipadā sujjhati, ‘‘dīgharattaṃ tīsu sikkhāsu appamatto jāgariyamanuyutto catūsu paccayesu alaggo ākāse pāṇisamena cetasā viharatī’’ti paññāyati, tassa bhikkhuno byākaraṇaṃ paṭipadāya ",
      " saddhiṃ saṃsandati sameti. ‘‘Seyyathāpi nāma gaṅgodakaṃ yamunodakena saddhiṃ saṃsandati sameti, evameva supaññattā tena bhagavatā sāvakānaṃ nibbānagāminī paṭipadā saṃsandati sameti nibbānañca paṭipadā cā’’ti (dī. ni. 2.296) vuttasadisaṃ hoti."
    ],
    "innerText": "Yadi panassa āgamanapaṭipadā sujjhati, ‘‘dīgharattaṃ tīsu sikkhāsu appamatto jāgariyamanuyutto catūsu paccayesu alaggo ākāse pāṇisamena cetasā viharatī’’ti paññāyati, tassa bhikkhuno byākaraṇaṃ paṭipadāya saddhiṃ saṃsandati sameti. ‘‘Seyyathāpi nāma gaṅgodakaṃ yamunodakena saddhiṃ saṃsandati sameti, evameva supaññattā tena bhagavatā sāvakānaṃ nibbānagāminī paṭipadā saṃsandati sameti nibbānañca paṭipadā cā’’ti (dī. ni. 2.296) vuttasadisaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Apica kho ettakenāpi sakkāro na kātabbo. Kasmā? Ekaccassa hi puthujjanassāpi sato khīṇāsavapaṭipattisadisā paṭipadā hoti. Tasmā so bhikkhu tehi tehi upāyehi uttāsetabbo. Khīṇāsavassa nāma asaniyāpi matthake patamānāya bhayaṃ vā chambhitattaṃ vā lomahaṃso vā na hoti, puthujjanassa appamattakenāpi hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrimāni ",
      " vatthūni – dīghabhāṇakaabhayatthero kira ekaṃ piṇḍapātikaṃ pariggahetuṃ asakkonto daharassa saññaṃ adāsi. So taṃ nhāyamānaṃ kalyāṇīnadīmukhadvāre nimujjitvā pāde aggahesi. Piṇḍapātiko kumbhīloti saññāya mahāsaddamakāsi, tadā naṃ puthujjanoti sañjāniṃsu. Candamukhatissarājakāle pana mahāvihāre saṅghatthero khīṇāsavo dubbalacakkhuko vihāreyeva acchi. Rājā theraṃ pariggaṇhissāmīti bhikkhūsu bhikkhācāraṃ gatesu appasaddo upasaṅkamitvā sappo viya pāde aggahesi. Thero silāthambho viya niccalo hutvā ko etthāti āha ",
      "? Ahaṃ, bhante, tissoti. Sugandhaṃ vāyasi no tissāti? Evaṃ khīṇāsavassa bhayaṃ nāma natthīti."
    ],
    "innerText": "Tatrimāni vatthūni – dīghabhāṇakaabhayatthero kira ekaṃ piṇḍapātikaṃ pariggahetuṃ asakkonto daharassa saññaṃ adāsi. So taṃ nhāyamānaṃ kalyāṇīnadīmukhadvāre nimujjitvā pāde aggahesi. Piṇḍapātiko kumbhīloti saññāya mahāsaddamakāsi, tadā naṃ puthujjanoti sañjāniṃsu. Candamukhatissarājakāle pana mahāvihāre saṅghatthero khīṇāsavo dubbalacakkhuko vihāreyeva acchi. Rājā theraṃ pariggaṇhissāmīti bhikkhūsu bhikkhācāraṃ gatesu appasaddo upasaṅkamitvā sappo viya pāde aggahesi. Thero silāthambho viya niccalo hutvā ko etthāti āha ? Ahaṃ, bhante, tissoti. Sugandhaṃ vāyasi no tissāti? Evaṃ khīṇāsavassa bhayaṃ nāma natthīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekacco pana puthujjanopi atisūro hoti nibbhayo. So rañjanīyena ārammaṇena pariggaṇhitabbo. Vasabharājāpi hi ekaṃ theraṃ pariggaṇhamāno ghare nisīdāpetvā tassa ",
      " santike badarasāḷavaṃ maddamāno nisīdi. Mahātherassa kheḷo cali, tato therassa puthujjanabhāvo āvibhūto. Khīṇāsavassa hi rasataṇhā nāma suppahīnā, dibbesupi rasesu nikanti nāma na hoti. Tasmā imehi upāyehi pariggahetvā sacassa bhayaṃ vā chambhitattaṃ vā lomahaṃso vā rasataṇhā vā uppajjati, na tvaṃ arahāti apanetabbo. Sace pana abhīrū acchambhī anutrāsī hutvā sīho viya nisīdati, dibbārammaṇepi nikantiṃ na janeti. Ayaṃ bhikkhu sampannaveyyākaraṇo samantā rājarājamahāmattādīhi pesitaṃ sakkāraṃ arahatīti."
    ],
    "innerText": "Ekacco pana puthujjanopi atisūro hoti nibbhayo. So rañjanīyena ārammaṇena pariggaṇhitabbo. Vasabharājāpi hi ekaṃ theraṃ pariggaṇhamāno ghare nisīdāpetvā tassa santike badarasāḷavaṃ maddamāno nisīdi. Mahātherassa kheḷo cali, tato therassa puthujjanabhāvo āvibhūto. Khīṇāsavassa hi rasataṇhā nāma suppahīnā, dibbesupi rasesu nikanti nāma na hoti. Tasmā imehi upāyehi pariggahetvā sacassa bhayaṃ vā chambhitattaṃ vā lomahaṃso vā rasataṇhā vā uppajjati, na tvaṃ arahāti apanetabbo. Sace pana abhīrū acchambhī anutrāsī hutvā sīho viya nisīdati, dibbārammaṇepi nikantiṃ na janeti. Ayaṃ bhikkhu sampannaveyyākaraṇo samantā rājarājamahāmattādīhi pesitaṃ sakkāraṃ arahatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Chabbisodhanasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Sappurisadhammasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "105"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti sappurisadhammasuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sappurisadhamma"
      },
      "nti sappurisānaṃ dhammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asappurisadhamma"
      },
      "nti pāpapurisānaṃ dhammaṃ. Evaṃ mātikaṃ ṭhapetvāpi puna yathā nāma maggakusalo puriso vāmaṃ muñcitvā dakkhiṇaṃ gaṇhāti. Paṭhamaṃ muñcitabbaṃ katheti, evaṃ pahātabbaṃ dhammaṃ paṭhamaṃ desento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "katamo ca, bhikkhave, asappurisadhammo"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uccākulā"
      },
      "ti khattiyakulā vā brāhmaṇakulā vā. Etadeva hi kuladvayaṃ ‘‘uccākula’’nti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So tattha pujjo"
      },
      "ti so bhikkhu tesu bhikkhūsu pūjāraho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antaraṃ karitvā"
      },
      "ti abbhantaraṃ katvā."
    ],
    "innerText": "105.Evaṃme sutanti sappurisadhammasuttaṃ. Tattha sappurisadhammanti sappurisānaṃ dhammaṃ. Asappurisadhammanti pāpapurisānaṃ dhammaṃ. Evaṃ mātikaṃ ṭhapetvāpi puna yathā nāma maggakusalo puriso vāmaṃ muñcitvā dakkhiṇaṃ gaṇhāti. Paṭhamaṃ muñcitabbaṃ katheti, evaṃ pahātabbaṃ dhammaṃ paṭhamaṃ desento katamo ca, bhikkhave, asappurisadhammotiādimāha. Tattha uccākulāti khattiyakulā vā brāhmaṇakulā vā. Etadeva hi kuladvayaṃ ‘‘uccākula’’nti vuccati. So tattha pujjoti so bhikkhu tesu bhikkhūsu pūjāraho. Antaraṃ karitvāti abbhantaraṃ katvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahākulā"
      },
      "ti khattiyakulā vā brāhmaṇakulā vā vessakulā ",
      " vā. Idameva hi kulattayaṃ ‘‘mahākula’’nti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahābhogakulā"
      },
      "ti mahantehi ",
      " bhogehi samannāgatā kulā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uḷārabhogakulā"
      },
      "ti uḷārehi paṇītehi bhogehi sampannakulā. Imasmiṃ padadvaye cattāripi kulāni labbhanti. Yattha katthaci kule jāto hi puññabalehi mahābhogopi uḷārabhogopi hotiyeva."
    ],
    "innerText": "Mahākulāti khattiyakulā vā brāhmaṇakulā vā vessakulā vā. Idameva hi kulattayaṃ ‘‘mahākula’’nti vuccati. Mahābhogakulāti mahantehi bhogehi samannāgatā kulā. Uḷārabhogakulāti uḷārehi paṇītehi bhogehi sampannakulā. Imasmiṃ padadvaye cattāripi kulāni labbhanti. Yattha katthaci kule jāto hi puññabalehi mahābhogopi uḷārabhogopi hotiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "106"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yasassī"
      },
      "ti parivārasampanno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaññātā"
      },
      "ti rattiṃ khittasarā viya saṅghamajjhādīsu na paññāyanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appesakkhā"
      },
      "ti appaparivārā."
    ],
    "innerText": "106.Yasassīti parivārasampanno. Appaññātāti rattiṃ khittasarā viya saṅghamajjhādīsu na paññāyanti. Appesakkhāti appaparivārā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "107"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āraññiko"
      },
      "ti samādinnaāraññikadhutaṅgo. Sesadhutaṅgesupi eseva nayo. Imasmiñca sutte pāḷiyaṃ naveva dhutaṅgāni āgatāni, vitthārena panetāni terasa honti. Tesu yaṃ vattabbaṃ, taṃ sabbaṃ sabbākārena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visuddhimagge"
      },
      " dhutaṅganiddese vuttameva."
    ],
    "innerText": "107.Āraññikoti samādinnaāraññikadhutaṅgo. Sesadhutaṅgesupi eseva nayo. Imasmiñca sutte pāḷiyaṃ naveva dhutaṅgāni āgatāni, vitthārena panetāni terasa honti. Tesu yaṃ vattabbaṃ, taṃ sabbaṃ sabbākārena visuddhimagge dhutaṅganiddese vuttameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "108"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atammayatā"
      },
      "ti tammayatā vuccati taṇhā, nittaṇhāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atammayataññeva antaraṃ karitvā"
      },
      "ti nittaṇhataṃyeva kāraṇaṃ katvā abbhantaraṃ vā katvā, citte uppādetvāti attho."
    ],
    "innerText": "108.Atammayatāti tammayatā vuccati taṇhā, nittaṇhāti attho. Atammayataññeva antaraṃ karitvāti nittaṇhataṃyeva kāraṇaṃ katvā abbhantaraṃ vā katvā, citte uppādetvāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nirodhavāre ",
      " yasmā anāgāmikhīṇāsavāva taṃ samāpattiṃ samāpajjanti, puthujjanassa sā natthi, tasmā asappurisavāro parihīno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na kañci maññatī"
      },
      "ti kañci puggalaṃ tīhi maññanāhi na maññati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kuhiñci maññatī"
      },
      "ti kismiñci okāse na maññati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na kenaci maññatī"
      },
      "ti kenaci vatthunāpi taṃ puggalaṃ na maññati. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "Nirodhavāre yasmā anāgāmikhīṇāsavāva taṃ samāpattiṃ samāpajjanti, puthujjanassa sā natthi, tasmā asappurisavāro parihīno. Na kañci maññatīti kañci puggalaṃ tīhi maññanāhi na maññati. Nakuhiñci maññatīti kismiñci okāse na maññati. Na kenaci maññatīti kenaci vatthunāpi taṃ puggalaṃ na maññati. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sappurisadhammasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Sevitabbāsevitabbasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "109"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti sevitabbāsevitabbasuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tañca aññamaññaṃ kāyasamācāra"
      },
      "nti aññaṃ sevitabbaṃ kāyasamācāraṃ, aññaṃ asevitabbaṃ vadāmi, sevitabbameva kenaci pariyāyena asevitabbanti, asevitabbaṃ vā sevitabbanti ca na vadāmīti attho. Vacīsamācārādīsu eseva nayo. Iti ",
      " bhagavā sattahi padehi mātikaṃ ṭhapetvā vitthārato avibhajitvāva desanaṃ niṭṭhāpesi. Kasmā? Sāriputtattherassa okāsakaraṇatthaṃ."
    ],
    "innerText": "109.Evaṃme sutanti sevitabbāsevitabbasuttaṃ. Tattha tañca aññamaññaṃ kāyasamācāranti aññaṃ sevitabbaṃ kāyasamācāraṃ, aññaṃ asevitabbaṃ vadāmi, sevitabbameva kenaci pariyāyena asevitabbanti, asevitabbaṃ vā sevitabbanti ca na vadāmīti attho. Vacīsamācārādīsu eseva nayo. Iti bhagavā sattahi padehi mātikaṃ ṭhapetvā vitthārato avibhajitvāva desanaṃ niṭṭhāpesi. Kasmā? Sāriputtattherassa okāsakaraṇatthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "113"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manosamācāre"
      },
      " micchādiṭṭhisammādiṭṭhiyo diṭṭhipaṭilābhavasena visuṃ aṅgaṃ hutvā ṭhitāti na gahitā."
    ],
    "innerText": "113.Manosamācāre micchādiṭṭhisammādiṭṭhiyo diṭṭhipaṭilābhavasena visuṃ aṅgaṃ hutvā ṭhitāti na gahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "114"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittuppāde"
      },
      " akammapathappattā abhijjhādayo veditabbā."
    ],
    "innerText": "114.Cittuppāde akammapathappattā abhijjhādayo veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "115"
      },
      ". Saññāpaṭilābhavāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhijjhāsahagatāya saññāyā"
      },
      "tiādīni kāmasaññādīnaṃ dassanatthaṃ vuttāni."
    ],
    "innerText": "115. Saññāpaṭilābhavāre abhijjhāsahagatāya saññāyātiādīni kāmasaññādīnaṃ dassanatthaṃ vuttāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "117"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabyābajjha"
      },
      "nti sadukkhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apariniṭṭhitabhāvāyā"
      },
      "ti bhavānaṃ apariniṭṭhitabhāvāya. Ettha ca sabyābajjhattabhāvā nāma cattāro honti. Puthujjanopi hi yo tenattabhāvena bhavaṃ pariniṭṭhāpetuṃ na sakkoti, tassa paṭisandhito paṭṭhāya akusalā dhammā vaḍḍhanti, kusalā dhammā ca parihāyanti, sadukkhameva ",
      " attabhāvaṃ abhinibbatteti nāma. Tathā sotāpannasakadāgāmianāgāmino. Puthujjanādayo tāva hontu, anāgāmī kathaṃ sabyābajjhaṃ attabhāvaṃ abhinibbatteti, kathañcassa akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantīti. Anāgāmīpi hi suddhāvāse nibbatto uyyānavimānakapparukkhe oloketvā ‘‘aho sukhaṃ aho sukha’’nti udānaṃ udāneti, anāgāmino bhavalobho bhavataṇhā appahīnāva honti, tassa appahīnataṇhatāya akusalā vaḍḍhanti nāma, kusalā parihāyanti nāma, sadukkhameva attabhāvaṃ abhinibbatteti, apariniṭṭhitabhavoyeva hotīti veditabbo."
    ],
    "innerText": "117.Sabyābajjhanti sadukkhaṃ. Apariniṭṭhitabhāvāyāti bhavānaṃ apariniṭṭhitabhāvāya. Ettha ca sabyābajjhattabhāvā nāma cattāro honti. Puthujjanopi hi yo tenattabhāvena bhavaṃ pariniṭṭhāpetuṃ na sakkoti, tassa paṭisandhito paṭṭhāya akusalā dhammā vaḍḍhanti, kusalā dhammā ca parihāyanti, sadukkhameva attabhāvaṃ abhinibbatteti nāma. Tathā sotāpannasakadāgāmianāgāmino. Puthujjanādayo tāva hontu, anāgāmī kathaṃ sabyābajjhaṃ attabhāvaṃ abhinibbatteti, kathañcassa akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantīti. Anāgāmīpi hi suddhāvāse nibbatto uyyānavimānakapparukkhe oloketvā ‘‘aho sukhaṃ aho sukha’’nti udānaṃ udāneti, anāgāmino bhavalobho bhavataṇhā appahīnāva honti, tassa appahīnataṇhatāya akusalā vaḍḍhanti nāma, kusalā parihāyanti nāma, sadukkhameva attabhāvaṃ abhinibbatteti, apariniṭṭhitabhavoyeva hotīti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abyābajjha"
      },
      "nti ",
      " adukkhaṃ. Ayampi catunnaṃ janānaṃ vasena veditabbo. Yo hi puthujjanopi tenattabhāvena bhavaṃ pariniṭṭhāpetuṃ sakkoti, puna paṭisandhiṃ na gaṇhāti, tassa paṭisandhiggahaṇato paṭṭhāya akusalā parihāyanti, kusalāyeva vaḍḍhanti, adukkhameva attabhāvaṃ nibbatteti, pariniṭṭhitabhavoyeva nāma hoti. Tathā sotāpannasakadāgāmianāgāmino. Sotāpannādayo tāva hontu, puthujjano kathaṃ abyābajjhaattabhāvaṃ nibbatteti, kathañcassa akusalaparihāniādīni hontīti. Puthujjanopi pacchimabhaviko tenattabhāvena bhavaṃ pariniṭṭhāpetuṃ samattho hoti. Tassa ",
      " aṅgulimālassa viya ekenūnapāṇasahassaṃ ghātentassāpi attabhāvo abyābajjhoyeva nāma, bhavaṃ pariniṭṭhāpetiyeva nāma. Akusalameva hāyati, vipassanameva gabbhaṃ gaṇhāpeti nāma."
    ],
    "innerText": "Abyābajjhanti adukkhaṃ. Ayampi catunnaṃ janānaṃ vasena veditabbo. Yo hi puthujjanopi tenattabhāvena bhavaṃ pariniṭṭhāpetuṃ sakkoti, puna paṭisandhiṃ na gaṇhāti, tassa paṭisandhiggahaṇato paṭṭhāya akusalā parihāyanti, kusalāyeva vaḍḍhanti, adukkhameva attabhāvaṃ nibbatteti, pariniṭṭhitabhavoyeva nāma hoti. Tathā sotāpannasakadāgāmianāgāmino. Sotāpannādayo tāva hontu, puthujjano kathaṃ abyābajjhaattabhāvaṃ nibbatteti, kathañcassa akusalaparihāniādīni hontīti. Puthujjanopi pacchimabhaviko tenattabhāvena bhavaṃ pariniṭṭhāpetuṃ samattho hoti. Tassa aṅgulimālassa viya ekenūnapāṇasahassaṃ ghātentassāpi attabhāvo abyābajjhoyeva nāma, bhavaṃ pariniṭṭhāpetiyeva nāma. Akusalameva hāyati, vipassanameva gabbhaṃ gaṇhāpeti nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "119"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhuviññeyya"
      },
      "ntiādīsu yasmā ekaccassa tasmiṃyeva rūpe rāgādayo uppajjanti, abhinandati assādeti, abhinandanto ",
      " assādento anayabyasanaṃ pāpuṇāti, ekaccassa nuppajjanti, nibbindati virajjati, nibbindanto virajjanto nibbutiṃ pāpuṇāti, tasmā ‘‘tañca aññamañña’’nti na vuttaṃ. Esa nayo sabbattha."
    ],
    "innerText": "119.Cakkhuviññeyyantiādīsu yasmā ekaccassa tasmiṃyeva rūpe rāgādayo uppajjanti, abhinandati assādeti, abhinandanto assādento anayabyasanaṃ pāpuṇāti, ekaccassa nuppajjanti, nibbindati virajjati, nibbindanto virajjanto nibbutiṃ pāpuṇāti, tasmā ‘‘tañca aññamañña’’nti na vuttaṃ. Esa nayo sabbattha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ vitthārena atthaṃ ājāneyyu"
      },
      "nti ettha ke bhagavato imassa bhāsitassa atthaṃ ājānanti, ke na ājānantīti? Ye tāva imassa suttassa pāḷiñca aṭṭhakathañca uggaṇhitvā takkarā na honti, yathāvuttaṃ anulomapaṭipadaṃ na paṭipajjanti, te na ājānanti nāma. Ye pana takkarā honti, yathāvuttaṃ anulomapaṭipadaṃ paṭipajjanti, te ājānanti nāma. Evaṃ santepi sapaṭisandhikānaṃ tāva dīgharattaṃ hitāya sukhāya hotu, appaṭisandhikānaṃ kathaṃ hotīti. Appaṭisandhikā anupādānā viya jātavedā parinibbāyanti, kappasatasahassānampi accayena tesaṃ puna dukkhaṃ nāma natthi. Iti ekaṃsena tesaṃyeva dīgharattaṃ hitāya sukhāya hoti. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "Evaṃ vitthārena atthaṃ ājāneyyunti ettha ke bhagavato imassa bhāsitassa atthaṃ ājānanti, ke na ājānantīti? Ye tāva imassa suttassa pāḷiñca aṭṭhakathañca uggaṇhitvā takkarā na honti, yathāvuttaṃ anulomapaṭipadaṃ na paṭipajjanti, te na ājānanti nāma. Ye pana takkarā honti, yathāvuttaṃ anulomapaṭipadaṃ paṭipajjanti, te ājānanti nāma. Evaṃ santepi sapaṭisandhikānaṃ tāva dīgharattaṃ hitāya sukhāya hotu, appaṭisandhikānaṃ kathaṃ hotīti. Appaṭisandhikā anupādānā viya jātavedā parinibbāyanti, kappasatasahassānampi accayena tesaṃ puna dukkhaṃ nāma natthi. Iti ekaṃsena tesaṃyeva dīgharattaṃ hitāya sukhāya hoti. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sevitabbāsevitabbasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Bahudhātukasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "124"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti bahudhātukasuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhayānī"
      },
      "tiādīsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhaya"
      },
      "nti cittutrāso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upaddavo"
      },
      "ti anekaggatākāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasaggo"
      },
      "ti upasaṭṭhākāro tattha tattha lagganākāro. Tesaṃ evaṃ nānattaṃ veditabbaṃ – pabbatādivisamanissitā corā janapadavāsīnaṃ pesenti ‘‘mayaṃ asukadivase nāma tumhākaṃ gāmaṃ paharissāmā’’ti. Taṃ pavattiṃ sutakālato ",
      " paṭṭhāya bhayaṃ santāsaṃ āpajjanti. Ayaṃ cittutrāso nāma. ‘‘Idha no corā kupitā anatthampi āvaheyyu’’nti hatthasāraṃ gahetvā dvipadacatuppadehi saddhiṃ araññaṃ pavisitvā tattha tattha bhūmiyaṃ nipajjanti, ḍaṃsamakasādīhi khajjamānā gumbantarāni pavisanti, khāṇukaṇṭake maddanti. Tesaṃ evaṃ vicarantānaṃ vikkhittabhāvo anekaggatākāro nāma. Tato coresu yathāvutte divase anāgacchantesu ‘‘tucchakasāsanaṃ taṃ bhavissati, gāmaṃ pavisissāmā’’ti saparikkhārā gāmaṃ pavisanti, atha tesaṃ paviṭṭhabhāvaṃ ñatvā gāmaṃ parivāretvā dvāre aggiṃ datvā manusse ghātetvā corā sabbaṃ vibhavaṃ vilumpetvā gacchanti. Tesu ghātitāvasesā aggiṃ nibbāpetvā koṭṭhacchāyabhitticchāyādīsu tattha tattha laggitvā nisīdanti naṭṭhaṃ anusocamānā. Ayaṃ upasaṭṭhākāro lagganākāro nāma."
    ],
    "innerText": "124.Evaṃme sutanti bahudhātukasuttaṃ. Tattha bhayānītiādīsu bhayanti cittutrāso. Upaddavoti anekaggatākāro. Upasaggoti upasaṭṭhākāro tattha tattha lagganākāro. Tesaṃ evaṃ nānattaṃ veditabbaṃ – pabbatādivisamanissitā corā janapadavāsīnaṃ pesenti ‘‘mayaṃ asukadivase nāma tumhākaṃ gāmaṃ paharissāmā’’ti. Taṃ pavattiṃ sutakālato paṭṭhāya bhayaṃ santāsaṃ āpajjanti. Ayaṃ cittutrāso nāma. ‘‘Idha no corā kupitā anatthampi āvaheyyu’’nti hatthasāraṃ gahetvā dvipadacatuppadehi saddhiṃ araññaṃ pavisitvā tattha tattha bhūmiyaṃ nipajjanti, ḍaṃsamakasādīhi khajjamānā gumbantarāni pavisanti, khāṇukaṇṭake maddanti. Tesaṃ evaṃ vicarantānaṃ vikkhittabhāvo anekaggatākāro nāma. Tato coresu yathāvutte divase anāgacchantesu ‘‘tucchakasāsanaṃ taṃ bhavissati, gāmaṃ pavisissāmā’’ti saparikkhārā gāmaṃ pavisanti, atha tesaṃ paviṭṭhabhāvaṃ ñatvā gāmaṃ parivāretvā dvāre aggiṃ datvā manusse ghātetvā corā sabbaṃ vibhavaṃ vilumpetvā gacchanti. Tesu ghātitāvasesā aggiṃ nibbāpetvā koṭṭhacchāyabhitticchāyādīsu tattha tattha laggitvā nisīdanti naṭṭhaṃ anusocamānā. Ayaṃ upasaṭṭhākāro lagganākāro nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Naḷāgārā"
      },
      "ti naḷehi paricchannā agārā, sesasambhārā panettha rukkhamayā honti. Tiṇāgārepi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bālato uppajjantī"
      },
      "ti bālameva nissāya uppajjanti. Bālo hi apaṇḍitapuriso rajjaṃ vā uparajjaṃ vā aññaṃ vā pana mahantaṃ ṭhānaṃ patthento katipaye attanā sadise vidhavāputte mahādhutte gahetvā ‘‘etha ahaṃ tumhe issare karissāmī’’ti pabbatagahanādīni nissāya antante gāme paharanto dāmarikabhāvaṃ jānāpetvā anupubbena nigamepi janapadepi paharati, manussā gehāni chaḍḍetvā khemantaṭṭhānaṃ patthayamānā pakkamanti, te nissāya vasantā bhikkhūpi bhikkhuniyopi attano attano vasanaṭṭhānāni pahāya pakkamanti. Gatagataṭṭhāne bhikkhāpi senāsanampi ",
      " dullabhaṃ hoti. Evaṃ catunnaṃ parisānaṃ bhayaṃ āgatameva hoti. Pabbajitesupi dve bālā bhikkhū aññamaññaṃ vivādaṃ paṭṭhapetvā codanaṃ ārabhanti ",
      ". Iti kosambivāsikānaṃ viya mahākalaho uppajjati, catunnaṃ parisānaṃ bhayaṃ āgatameva hotīti evaṃ yāni kānici bhayāni uppajjanti, sabbāni tāni bālato uppajjantīti veditabbāni."
    ],
    "innerText": "Naḷāgārāti naḷehi paricchannā agārā, sesasambhārā panettha rukkhamayā honti. Tiṇāgārepi eseva nayo. Bālato uppajjantīti bālameva nissāya uppajjanti. Bālo hi apaṇḍitapuriso rajjaṃ vā uparajjaṃ vā aññaṃ vā pana mahantaṃ ṭhānaṃ patthento katipaye attanā sadise vidhavāputte mahādhutte gahetvā ‘‘etha ahaṃ tumhe issare karissāmī’’ti pabbatagahanādīni nissāya antante gāme paharanto dāmarikabhāvaṃ jānāpetvā anupubbena nigamepi janapadepi paharati, manussā gehāni chaḍḍetvā khemantaṭṭhānaṃ patthayamānā pakkamanti, te nissāya vasantā bhikkhūpi bhikkhuniyopi attano attano vasanaṭṭhānāni pahāya pakkamanti. Gatagataṭṭhāne bhikkhāpi senāsanampi dullabhaṃ hoti. Evaṃ catunnaṃ parisānaṃ bhayaṃ āgatameva hoti. Pabbajitesupi dve bālā bhikkhū aññamaññaṃ vivādaṃ paṭṭhapetvā codanaṃ ārabhanti . Iti kosambivāsikānaṃ viya mahākalaho uppajjati, catunnaṃ parisānaṃ bhayaṃ āgatameva hotīti evaṃ yāni kānici bhayāni uppajjanti, sabbāni tāni bālato uppajjantīti veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etadavocā"
      },
      "ti bhagavatā dhammadesanā matthakaṃ apāpetvāva niṭṭhāpitā. Yaṃnūnāhaṃ dasabalaṃ pucchitvā sabbaññutaññāṇenevassa desanāya pāripūriṃ kareyyanti ",
      " cintetvā etaṃ ‘‘kittāvatā nu kho, bhante’’tiādivacanaṃ avoca."
    ],
    "innerText": "Etadavocāti bhagavatā dhammadesanā matthakaṃ apāpetvāva niṭṭhāpitā. Yaṃnūnāhaṃ dasabalaṃ pucchitvā sabbaññutaññāṇenevassa desanāya pāripūriṃ kareyyanti cintetvā etaṃ ‘‘kittāvatā nu kho, bhante’’tiādivacanaṃ avoca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "125"
      },
      ". Aṭṭhārasasu dhātūsu aḍḍhekādasadhātuyo rūpapariggaho, aḍḍhaṭṭhamakadhātuyo arūpapariggahoti rūpārūpapariggahova kathito. Sabbāpi khandhavasena pañcakkhandhā honti. Pañcapi khandhā dukkhasaccaṃ, tesaṃ samuṭṭhāpikā taṇhā samudayasaccaṃ, ubhinnaṃ appavatti nirodhasaccaṃ, nirodhapajānanā paṭipadā maggasaccaṃ. Iti catusaccakammaṭṭhānaṃ ekassa bhikkhuno niggamanaṃ matthakaṃ pāpetvā kathitaṃ hoti. Ayamettha saṅkhepo, vitthārato panetā dhātuyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visuddhimagge"
      },
      " kathitāva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jānāti passatī"
      },
      "ti saha vipassanāya maggo vutto."
    ],
    "innerText": "125. Aṭṭhārasasu dhātūsu aḍḍhekādasadhātuyo rūpapariggaho, aḍḍhaṭṭhamakadhātuyo arūpapariggahoti rūpārūpapariggahova kathito. Sabbāpi khandhavasena pañcakkhandhā honti. Pañcapi khandhā dukkhasaccaṃ, tesaṃ samuṭṭhāpikā taṇhā samudayasaccaṃ, ubhinnaṃ appavatti nirodhasaccaṃ, nirodhapajānanā paṭipadā maggasaccaṃ. Iti catusaccakammaṭṭhānaṃ ekassa bhikkhuno niggamanaṃ matthakaṃ pāpetvā kathitaṃ hoti. Ayamettha saṅkhepo, vitthārato panetā dhātuyo visuddhimagge kathitāva. Jānāti passatīti saha vipassanāya maggo vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pathavīdhātuādayo saviññāṇakakāyaṃ suññato nissattato dassetuṃ vuttā. Tāpi purimāhi aṭṭhārasahi dhātūhi pūretabbā. Pūrentena viññāṇadhātuto nīharitvā pūretabbā. Viññāṇadhātu hesā cakkhuviññāṇādivasena chabbidhā hoti. Tattha cakkhuviññāṇadhātuyā pariggahitāya tassā vatthu cakkhudhātu, ārammaṇaṃ rūpadhātūti dve dhātuyo pariggahitāva ",
      " honti. Esa nayo sabbattha. Manoviññāṇadhātuyā pana pariggahitāya tassā purimapacchimavasena manodhātu, ārammaṇavasena dhammadhātūti dve dhātuyo pariggahitāva honti. Iti imāsu aṭṭhārasasu dhātūsu aḍḍhekādasadhātuyo rūpapariggahoti purimanayeneva idampi ekassa bhikkhuno niggamanaṃ matthakaṃ pāpetvā kathitaṃ hoti."
    ],
    "innerText": "Pathavīdhātuādayo saviññāṇakakāyaṃ suññato nissattato dassetuṃ vuttā. Tāpi purimāhi aṭṭhārasahi dhātūhi pūretabbā. Pūrentena viññāṇadhātuto nīharitvā pūretabbā. Viññāṇadhātu hesā cakkhuviññāṇādivasena chabbidhā hoti. Tattha cakkhuviññāṇadhātuyā pariggahitāya tassā vatthu cakkhudhātu, ārammaṇaṃ rūpadhātūti dve dhātuyo pariggahitāva honti. Esa nayo sabbattha. Manoviññāṇadhātuyā pana pariggahitāya tassā purimapacchimavasena manodhātu, ārammaṇavasena dhammadhātūti dve dhātuyo pariggahitāva honti. Iti imāsu aṭṭhārasasu dhātūsu aḍḍhekādasadhātuyo rūpapariggahoti purimanayeneva idampi ekassa bhikkhuno niggamanaṃ matthakaṃ pāpetvā kathitaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhadhātū"
      },
      "tiādīsu sukhañca taṃ nissattasuññataṭṭhena dhātu cāti sukhadhātu. Esa nayo sabbattha. Ettha ca purimā catasso dhātuyo sappaṭipakkhavasena gahitā, pacchimā dve sarikkhakavasena. Avibhūtabhāvena hi upekkhādhātu avijjādhātuyā sarikkhā. Ettha ca sukhadukkhadhātūsu ",
      " pariggahitāsu kāyaviññāṇadhātu pariggahitāva hoti, sesāsu pariggahitāsu manoviññāṇadhātu pariggahitāva hoti. Imāpi cha dhātuyo heṭṭhā aṭṭhārasahiyeva pūretabbā. Pūrentena upekkhādhātuto nīharitvā pūretabbā. Iti imāsu aṭṭhārasasu dhātūsu aḍḍhekādasadhātuyo rūpapariggahoti ",
      " purimanayeneva idampi ekassa bhikkhuno niggamanaṃ matthakaṃ pāpetvā kathitaṃ hoti."
    ],
    "innerText": "Sukhadhātūtiādīsu sukhañca taṃ nissattasuññataṭṭhena dhātu cāti sukhadhātu. Esa nayo sabbattha. Ettha ca purimā catasso dhātuyo sappaṭipakkhavasena gahitā, pacchimā dve sarikkhakavasena. Avibhūtabhāvena hi upekkhādhātu avijjādhātuyā sarikkhā. Ettha ca sukhadukkhadhātūsu pariggahitāsu kāyaviññāṇadhātu pariggahitāva hoti, sesāsu pariggahitāsu manoviññāṇadhātu pariggahitāva hoti. Imāpi cha dhātuyo heṭṭhā aṭṭhārasahiyeva pūretabbā. Pūrentena upekkhādhātuto nīharitvā pūretabbā. Iti imāsu aṭṭhārasasu dhātūsu aḍḍhekādasadhātuyo rūpapariggahoti purimanayeneva idampi ekassa bhikkhuno niggamanaṃ matthakaṃ pāpetvā kathitaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kāmadhātuādīnaṃ dvedhāvitakke (ma. ni. 1.206) kāmavitakkādīsu vuttanayeneva attho veditabbo. Abhidhammepi ‘‘tattha katamā kāmadhātu, kāmapaṭisaṃyutto takko vitakko’’tiādinā (vibha. 182) nayeneva etāsaṃ vitthāro āgatoyeva. Imāpi cha dhātuyo heṭṭhā aṭṭhārasahiyeva pūretabbā. Pūrentena kāmadhātuto nīharitvā pūretabbā. Iti imāsu aṭṭhārasasu dhātūsu aḍḍhekādasadhātuyo rūpapariggahoti purimanayeneva idampi ekassa bhikkhuno niggamanaṃ matthakaṃ pāpetvā kathitaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kāmadhātuādīsu pañca kāmāvacarakkhandhā ",
      " kāmadhātu nāma, pañca rūpāvacarakkhandhā rūpadhātu nāma, cattāro arūpāvacarakkhandhā arūpadhātu nāma. Abhidhamme pana ‘‘tattha katamā kāmadhātu, heṭṭhato avīcinirayaṃ pariyantaṃ karitvā’’tiādinā (vibha. 182) nayena etāsaṃ vitthāro āgatoyeva. Imāpi tisso dhātuyo heṭṭhā aṭṭhārasahiyeva pūretabbā. Pūrentena kāmadhātuto nīharitvā pūretabbā. Iti imāsu aṭṭhārasasu dhātūsu aḍḍhekādasadhātuyo rūpapariggahoti purimanayeneva idampi ekassa bhikkhuno niggamanaṃ matthakaṃ pāpetvā kathitaṃ hoti."
    ],
    "innerText": "Kāmadhātuādīsu pañca kāmāvacarakkhandhā kāmadhātu nāma, pañca rūpāvacarakkhandhā rūpadhātu nāma, cattāro arūpāvacarakkhandhā arūpadhātu nāma. Abhidhamme pana ‘‘tattha katamā kāmadhātu, heṭṭhato avīcinirayaṃ pariyantaṃ karitvā’’tiādinā (vibha. 182) nayena etāsaṃ vitthāro āgatoyeva. Imāpi tisso dhātuyo heṭṭhā aṭṭhārasahiyeva pūretabbā. Pūrentena kāmadhātuto nīharitvā pūretabbā. Iti imāsu aṭṭhārasasu dhātūsu aḍḍhekādasadhātuyo rūpapariggahoti purimanayeneva idampi ekassa bhikkhuno niggamanaṃ matthakaṃ pāpetvā kathitaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhatā"
      },
      "ti paccayehi samāgantvā katā, pañcannaṃ khandhānametaṃ adhivacanaṃ. Na saṅkhatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asaṅkhatā"
      },
      ". Nibbānassetaṃ adhivacanaṃ. Imāpi dve dhātuyo heṭṭhā aṭṭhārasahiyeva pūretabbā. Pūrentena saṅkhatadhātuto nīharitvā pūretabbā. Iti imāsu aṭṭhārasasu dhātūsu aḍḍhekādasadhātuyo rūpapariggahoti purimanayeneva idampi ekassa bhikkhuno niggamanaṃ matthakaṃ pāpetvā kathitaṃ hoti."
    ],
    "innerText": "Saṅkhatāti paccayehi samāgantvā katā, pañcannaṃ khandhānametaṃ adhivacanaṃ. Na saṅkhatā asaṅkhatā. Nibbānassetaṃ adhivacanaṃ. Imāpi dve dhātuyo heṭṭhā aṭṭhārasahiyeva pūretabbā. Pūrentena saṅkhatadhātuto nīharitvā pūretabbā. Iti imāsu aṭṭhārasasu dhātūsu aḍḍhekādasadhātuyo rūpapariggahoti purimanayeneva idampi ekassa bhikkhuno niggamanaṃ matthakaṃ pāpetvā kathitaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "126"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhattikabāhirānī"
      },
      "ti ajjhattikāni ca bāhirāni ca. Ettha hi cakkhuādīni ajjhattikāni cha, rūpādīni bāhirāni cha. Idhāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jānāti passatī"
      },
      "ti saha vipassanāya maggo kathito."
    ],
    "innerText": "126.Ajjhattikabāhirānīti ajjhattikāni ca bāhirāni ca. Ettha hi cakkhuādīni ajjhattikāni cha, rūpādīni bāhirāni cha. Idhāpi jānāti passatīti saha vipassanāya maggo kathito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imasmiṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sati ida"
      },
      "ntiādi mahātaṇhāsaṅkhaye vitthāritameva."
    ],
    "innerText": "Imasmiṃsati idantiādi mahātaṇhāsaṅkhaye vitthāritameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "127"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhāna"
      },
      "nti ",
      " hetupaṭikkhepo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anavakāso"
      },
      "ti paccayapaṭikkhepo. Ubhayenāpi kāraṇameva paṭikkhipati. Kāraṇañhi tadāyattavuttitāya attano phalassa ṭhānanti ca avakāsoti ca vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ya"
      },
      "nti yena kāraṇena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhisampanno"
      },
      "ti ",
      " maggadiṭṭhiyā sampanno sotāpanno ariyasāvako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kañci saṅkhāra"
      },
      "nti catubhūmakesu saṅkhatasaṅkhāresu kañci ekasaṅkhārampi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niccato upagaccheyyā"
      },
      "ti niccoti gaṇheyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Netaṃ ṭhānaṃ vijjatī"
      },
      "ti etaṃ kāraṇaṃ natthi na upalabbhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ puthujjano"
      },
      "ti yena kāraṇena puthujjano. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhānametaṃ vijjatī"
      },
      "ti etaṃ kāraṇaṃ atthi. Sassatadiṭṭhiyā hi so tebhūmakesu saṅkhatasaṅkhāresu kañci saṅkhāraṃ niccato gaṇheyyāti attho. Catutthabhūmakasaṅkhārā pana tejussadattā divasaṃ santatto ayoguḷo viya makkhikānaṃ diṭṭhiyā vā aññesaṃ vā akusalānaṃ ārammaṇaṃ na honti. Iminā nayena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kañci saṅkhāraṃ sukhato"
      },
      "tiādīsupi attho veditabbo."
    ],
    "innerText": "127.Aṭṭhānanti hetupaṭikkhepo. Anavakāsoti paccayapaṭikkhepo. Ubhayenāpi kāraṇameva paṭikkhipati. Kāraṇañhi tadāyattavuttitāya attano phalassa ṭhānanti ca avakāsoti ca vuccati. Yanti yena kāraṇena. Diṭṭhisampannoti maggadiṭṭhiyā sampanno sotāpanno ariyasāvako. Kañci saṅkhāranti catubhūmakesu saṅkhatasaṅkhāresu kañci ekasaṅkhārampi. Niccato upagaccheyyāti niccoti gaṇheyya. Netaṃ ṭhānaṃ vijjatīti etaṃ kāraṇaṃ natthi na upalabbhati. Yaṃ puthujjanoti yena kāraṇena puthujjano. Ṭhānametaṃ vijjatīti etaṃ kāraṇaṃ atthi. Sassatadiṭṭhiyā hi so tebhūmakesu saṅkhatasaṅkhāresu kañci saṅkhāraṃ niccato gaṇheyyāti attho. Catutthabhūmakasaṅkhārā pana tejussadattā divasaṃ santatto ayoguḷo viya makkhikānaṃ diṭṭhiyā vā aññesaṃ vā akusalānaṃ ārammaṇaṃ na honti. Iminā nayena kañci saṅkhāraṃ sukhatotiādīsupi attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhato upagaccheyyā"
      },
      "ti ‘‘ekantasukhī attā hoti arogo paraṃ maraṇā’’ti (ma. ni. 3.21, 22) evaṃ attadiṭṭhivasena sukhato gāhaṃ sandhāyetaṃ vuttaṃ. Diṭṭhivippayuttacittena pana ariyasāvako pariḷāhābhibhūto pariḷāhavūpasamatthaṃ mattahatthiṃ parittāsito viya, cokkhabrāhmaṇo viya ca gūthaṃ kañci saṅkhāraṃ sukhato upagacchati. Attavāre kasiṇādipaṇṇattisaṅgahatthaṃ saṅkhāranti avatvā kañci dhammanti vuttaṃ. Idhāpi ariyasāvakassa catubhūmakavasena veditabbo, puthujjanassa tebhūmakavasena. Sabbavāresu ariyasāvakassāpi tebhūmakavaseneva paricchedo vaṭṭati. Yaṃ yañhi puthujjano ",
      " gaṇhāti, tato tato ariyasāvako gāhaṃ viniveṭheti. Puthujjano hi yaṃ yaṃ niccaṃ sukhaṃ attāti gaṇhāti, taṃ taṃ ariyasāvako aniccaṃ dukkhaṃ anattāti gaṇhanto taṃ gāhaṃ viniveṭheti."
    ],
    "innerText": "Sukhato upagaccheyyāti ‘‘ekantasukhī attā hoti arogo paraṃ maraṇā’’ti (ma. ni. 3.21, 22) evaṃ attadiṭṭhivasena sukhato gāhaṃ sandhāyetaṃ vuttaṃ. Diṭṭhivippayuttacittena pana ariyasāvako pariḷāhābhibhūto pariḷāhavūpasamatthaṃ mattahatthiṃ parittāsito viya, cokkhabrāhmaṇo viya ca gūthaṃ kañci saṅkhāraṃ sukhato upagacchati. Attavāre kasiṇādipaṇṇattisaṅgahatthaṃ saṅkhāranti avatvā kañci dhammanti vuttaṃ. Idhāpi ariyasāvakassa catubhūmakavasena veditabbo, puthujjanassa tebhūmakavasena. Sabbavāresu ariyasāvakassāpi tebhūmakavaseneva paricchedo vaṭṭati. Yaṃ yañhi puthujjano gaṇhāti, tato tato ariyasāvako gāhaṃ viniveṭheti. Puthujjano hi yaṃ yaṃ niccaṃ sukhaṃ attāti gaṇhāti, taṃ taṃ ariyasāvako aniccaṃ dukkhaṃ anattāti gaṇhanto taṃ gāhaṃ viniveṭheti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "128"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mātara"
      },
      "ntiādīsu janikāva mātā, janako pitā, manussabhūtova khīṇāsavo arahāti adhippeto. Kiṃ pana ariyasāvako aññaṃ jīvitā voropeyyāti? Etampi aṭṭhānaṃ. Sacepi hi bhavantaragataṃ ariyasāvakaṃ ",
      " attano ariyabhāvaṃ ajānantampi koci evaṃ vadeyya ‘‘imaṃ kunthakipillikaṃ jīvitā voropetvā sakalacakkavāḷagabbhe cakkavattirajjaṃ paṭipajjāhī’’ti ",
      ", neva so taṃ jīvitā voropeyya. Athāpi naṃ evaṃ vadeyya ‘‘sace imaṃ na ghātessasi, sīsaṃ te chindissāmā’’ti. Sīsamevassa chindeyya, na ca so taṃ ghāteyya. Puthujjanabhāvassa pana mahāsāvajjabhāvadassanatthaṃ ariyasāvakassa ca baladīpanatthametaṃ vuttaṃ. Ayañhettha adhippāyo – sāvajjo puthujjanabhāvo, yatra hi nāma puthujjano mātughātādīnipi ānantariyāni karissati. Mahābalo ca ariyasāvako, yo etāni kammāni na karotīti."
    ],
    "innerText": "128.Mātarantiādīsu janikāva mātā, janako pitā, manussabhūtova khīṇāsavo arahāti adhippeto. Kiṃ pana ariyasāvako aññaṃ jīvitā voropeyyāti? Etampi aṭṭhānaṃ. Sacepi hi bhavantaragataṃ ariyasāvakaṃ attano ariyabhāvaṃ ajānantampi koci evaṃ vadeyya ‘‘imaṃ kunthakipillikaṃ jīvitā voropetvā sakalacakkavāḷagabbhe cakkavattirajjaṃ paṭipajjāhī’’ti , neva so taṃ jīvitā voropeyya. Athāpi naṃ evaṃ vadeyya ‘‘sace imaṃ na ghātessasi, sīsaṃ te chindissāmā’’ti. Sīsamevassa chindeyya, na ca so taṃ ghāteyya. Puthujjanabhāvassa pana mahāsāvajjabhāvadassanatthaṃ ariyasāvakassa ca baladīpanatthametaṃ vuttaṃ. Ayañhettha adhippāyo – sāvajjo puthujjanabhāvo, yatra hi nāma puthujjano mātughātādīnipi ānantariyāni karissati. Mahābalo ca ariyasāvako, yo etāni kammāni na karotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duṭṭhacitto"
      },
      "ti vadhakacittena paduṭṭhacitto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lohitaṃ uppādeyyā"
      },
      "ti jīvamānakasarīre khuddakamakkhikāya pivanamattampi lohitaṃ uppādeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghaṃ bhindeyyā"
      },
      "ti samānasaṃvāsakaṃ samānasīmāya ṭhitaṃ pañcahi kāraṇehi saṅghaṃ bhindeyya. Vuttañhetaṃ ‘‘pañcahupāli ākārehi saṅgho bhijjati. Kammena uddesena voharanto anussāvanena salākaggāhenā’’ti (pari. 458)."
    ],
    "innerText": "Duṭṭhacittoti vadhakacittena paduṭṭhacitto. Lohitaṃ uppādeyyāti jīvamānakasarīre khuddakamakkhikāya pivanamattampi lohitaṃ uppādeyya. Saṅghaṃ bhindeyyāti samānasaṃvāsakaṃ samānasīmāya ṭhitaṃ pañcahi kāraṇehi saṅghaṃ bhindeyya. Vuttañhetaṃ ‘‘pañcahupāli ākārehi saṅgho bhijjati. Kammena uddesena voharanto anussāvanena salākaggāhenā’’ti (pari. 458)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammenā"
      },
      "ti apalokanādīsu catūsu kammesu aññatarena kammena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddesenā"
      },
      "ti pañcasu pātimokkhuddesesu aññatarena uddesena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Voharanto"
      },
      "ti kathayanto, tāhi tāhi uppattīhi adhammaṃ dhammotiādīni aṭṭhārasa bhedakaravatthūni dīpento. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anussāvanenā"
      },
      "ti nanu tumhe jānātha mayhaṃ uccākulā pabbajitabhāvaṃ bahussutabhāvañca, mādiso nāma uddhammaṃ ubbinayaṃ satthusāsanaṃ gāheyyāti cittampi uppādetuṃ tumhākaṃ yuttaṃ, kiṃ mayhaṃ avīci nīluppalavanaṃ viya sītalo, kiṃ ahaṃ apāyato na bhāyāmītiādinā nayena kaṇṇamūle vacībhedaṃ katvā anussāvanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Salākaggāhenā"
      },
      "ti evaṃ anussāvetvā tesaṃ cittaṃ upatthambhetvā anivattidhamme katvā ‘‘gaṇhatha imaṃ salāka’’nti salākaggāhena."
    ],
    "innerText": "Tattha kammenāti apalokanādīsu catūsu kammesu aññatarena kammena. Uddesenāti pañcasu pātimokkhuddesesu aññatarena uddesena. Voharantoti kathayanto, tāhi tāhi uppattīhi adhammaṃ dhammotiādīni aṭṭhārasa bhedakaravatthūni dīpento. Anussāvanenāti nanu tumhe jānātha mayhaṃ uccākulā pabbajitabhāvaṃ bahussutabhāvañca, mādiso nāma uddhammaṃ ubbinayaṃ satthusāsanaṃ gāheyyāti cittampi uppādetuṃ tumhākaṃ yuttaṃ, kiṃ mayhaṃ avīci nīluppalavanaṃ viya sītalo, kiṃ ahaṃ apāyato na bhāyāmītiādinā nayena kaṇṇamūle vacībhedaṃ katvā anussāvanena. Salākaggāhenāti evaṃ anussāvetvā tesaṃ cittaṃ upatthambhetvā anivattidhamme katvā ‘‘gaṇhatha imaṃ salāka’’nti salākaggāhena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca kammameva uddeso vā pamāṇaṃ, vohārānussāvanasalākaggāhā pana pubbabhāgā. Aṭṭhārasavatthudīpanavasena hi voharantena tattha rucijananatthaṃ anussāvetvā salākāya gāhitāyapi abhinnova hoti saṅgho. Yadā pana evaṃ cattāro vā atirekā vā salākaṃ gāhetvā āveṇikaṃ ",
      " kammaṃ vā uddesaṃ vā karonti, tadā saṅgho bhinno nāma hoti. Evaṃ diṭṭhisampanno puggalo saṅghaṃ bhindeyyāti netaṃ ṭhānaṃ vijjati. Ettāvatā mātughātādīni pañca ānantariyakammāni dassitāni honti, yāni puthujjano karoti, na ariyasāvako, tesaṃ āvibhāvatthaṃ –"
    ],
    "innerText": "Ettha ca kammameva uddeso vā pamāṇaṃ, vohārānussāvanasalākaggāhā pana pubbabhāgā. Aṭṭhārasavatthudīpanavasena hi voharantena tattha rucijananatthaṃ anussāvetvā salākāya gāhitāyapi abhinnova hoti saṅgho. Yadā pana evaṃ cattāro vā atirekā vā salākaṃ gāhetvā āveṇikaṃ kammaṃ vā uddesaṃ vā karonti, tadā saṅgho bhinno nāma hoti. Evaṃ diṭṭhisampanno puggalo saṅghaṃ bhindeyyāti netaṃ ṭhānaṃ vijjati. Ettāvatā mātughātādīni pañca ānantariyakammāni dassitāni honti, yāni puthujjano karoti, na ariyasāvako, tesaṃ āvibhāvatthaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Kammato ",
      " dvārato ceva, kappaṭṭhitiyato tathā;"
    ],
    "innerText": "Kammato dvārato ceva, kappaṭṭhitiyato tathā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pākasādhāraṇādīhi, viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammato"
      },
      " tāva – ettha hi manussabhūtasseva manussabhūtaṃ mātaraṃ vā pitaraṃ vā api parivattaliṅgaṃ jīvitā voropentassa kammaṃ ānantariyaṃ hoti, tassa vipākaṃ paṭibāhissāmīti sakalacakkavāḷaṃ mahācetiyappamāṇehi ",
      " kañcanathūpehi pūretvāpi sakalacakkavāḷaṃ pūretvā nisinnabhikkhusaṅghassa mahādānaṃ datvāpi buddhassa bhagavato saṅghāṭikaṇṇaṃ amuñcanto vicaritvāpi kāyassa bhedā nirayameva upapajjati. Yo pana sayaṃ manussabhūto tiracchānabhūtaṃ mātaraṃ vā pitaraṃ vā, sayaṃ vā tiracchānabhūto manussabhūtaṃ, tiracchānoyeva vā tiracchānabhūtaṃ jīvitā voropeti, tassa kammaṃ ānantariyaṃ na hoti, bhāriyaṃ pana hoti, ānantariyaṃ āhacceva tiṭṭhati. Manussajātikānaṃ pana vasena ayaṃ pañho kathito."
    ],
    "innerText": "Tattha kammato tāva – ettha hi manussabhūtasseva manussabhūtaṃ mātaraṃ vā pitaraṃ vā api parivattaliṅgaṃ jīvitā voropentassa kammaṃ ānantariyaṃ hoti, tassa vipākaṃ paṭibāhissāmīti sakalacakkavāḷaṃ mahācetiyappamāṇehi kañcanathūpehi pūretvāpi sakalacakkavāḷaṃ pūretvā nisinnabhikkhusaṅghassa mahādānaṃ datvāpi buddhassa bhagavato saṅghāṭikaṇṇaṃ amuñcanto vicaritvāpi kāyassa bhedā nirayameva upapajjati. Yo pana sayaṃ manussabhūto tiracchānabhūtaṃ mātaraṃ vā pitaraṃ vā, sayaṃ vā tiracchānabhūto manussabhūtaṃ, tiracchānoyeva vā tiracchānabhūtaṃ jīvitā voropeti, tassa kammaṃ ānantariyaṃ na hoti, bhāriyaṃ pana hoti, ānantariyaṃ āhacceva tiṭṭhati. Manussajātikānaṃ pana vasena ayaṃ pañho kathito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha eḷakacatukkaṃ saṅgāmacatukkaṃ coracatukkañca kathetabbaṃ. Eḷakaṃ māremīti abhisandhināpi hi eḷakaṭṭhāne ṭhitaṃ manusso manussabhūtaṃ mātaraṃ vā pitaraṃ vā mārento ānantariyaṃ phusati. Eḷakābhisandhinā pana mātāpitāabhisandhinā vā eḷakaṃ mārento ānantariyaṃ na phusati. Mātāpitāabhisandhinā mātāpitaro mārento phusateva. Eseva nayo itarasmimpi catukkadvaye. Yathā ca mātāpitūsu, evaṃ arahantepi etāni catukkāni veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Manussaarahantameva māretvā ānantariyaṃ phusati, na yakkhabhūtaṃ. Kammaṃ pana bhāriyaṃ, ānantariyasadisameva. Manussaarahantassa ca puthujjanakāleyeva satthappahāre vā vise vā dinnepi yadi so arahattaṃ patvā teneva marati, arahantaghāto hotiyeva. Yaṃ pana puthujjanakāle dinnaṃ dānaṃ arahattaṃ patvā paribhuñjati, puthujjanasseva dinnaṃ hoti. Sesaariyapuggale ",
      " mārentassa ānantariyaṃ natthi. Kammaṃ pana bhāriyaṃ, ānantariyasadisameva."
    ],
    "innerText": "Manussaarahantameva māretvā ānantariyaṃ phusati, na yakkhabhūtaṃ. Kammaṃ pana bhāriyaṃ, ānantariyasadisameva. Manussaarahantassa ca puthujjanakāleyeva satthappahāre vā vise vā dinnepi yadi so arahattaṃ patvā teneva marati, arahantaghāto hotiyeva. Yaṃ pana puthujjanakāle dinnaṃ dānaṃ arahattaṃ patvā paribhuñjati, puthujjanasseva dinnaṃ hoti. Sesaariyapuggale mārentassa ānantariyaṃ natthi. Kammaṃ pana bhāriyaṃ, ānantariyasadisameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lohituppāde"
      },
      " tathāgatassa abhejjakāyatāya parūpakkamena cammacchedaṃ katvā lohitapaggharaṇaṃ nāma natthi. Sarīrassa pana antoyeva ekasmiṃyeva ṭhāne lohitaṃ samosarati. Devadattena paviddhasilato ",
      " bhijjitvā gatā sakalikāpi ",
      " tathāgatassa pādantaṃ pahari, pharasunā pahaṭo viya pādo antolohitoyeva ahosi. Tathā karontassa ānantariyaṃ hoti. Jīvako pana tathāgatassa ruciyā satthakena cammaṃ chinditvā tamhā ṭhānā duṭṭhalohitaṃ nīharitvā phāsumakāsi, tathā karontassa puññakammameva hoti."
    ],
    "innerText": "Lohituppāde tathāgatassa abhejjakāyatāya parūpakkamena cammacchedaṃ katvā lohitapaggharaṇaṃ nāma natthi. Sarīrassa pana antoyeva ekasmiṃyeva ṭhāne lohitaṃ samosarati. Devadattena paviddhasilato bhijjitvā gatā sakalikāpi tathāgatassa pādantaṃ pahari, pharasunā pahaṭo viya pādo antolohitoyeva ahosi. Tathā karontassa ānantariyaṃ hoti. Jīvako pana tathāgatassa ruciyā satthakena cammaṃ chinditvā tamhā ṭhānā duṭṭhalohitaṃ nīharitvā phāsumakāsi, tathā karontassa puññakammameva hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha ye ca parinibbute tathāgate cetiyaṃ bhindanti, bodhiṃ chindanti dhātumhi upakkamanti, tesaṃ kiṃ hotīti? Bhāriyaṃ kammaṃ hoti ānantariyasadisaṃ. Sadhātukaṃ pana thūpaṃ vā paṭimaṃ vā bādhamānaṃ bodhisākhaṃ chindituṃ vaṭṭati. Sacepi tattha nilīnā sakuṇā cetiye vaccaṃ pātenti, chindituṃ vaṭṭatiyeva. Paribhogacetiyato hi sarīracetiyaṃ mahantataraṃ. Cetiyavatthuṃ bhinditvā gacchantaṃ bodhimūlampi chinditvā harituṃ vaṭṭati. Yā pana bodhisākhā bodhigharaṃ bādhati, taṃ geharakkhaṇatthaṃ chindituṃ na labhati, bodhiatthañhi gehaṃ, na gehatthāya bodhi. Āsanagharepi eseva nayo. Yasmiṃ pana āsanaghare dhātu nihitā hoti, tassa rakkhaṇatthāya bodhisākhaṃ chindituṃ vaṭṭati. Bodhijagganatthaṃ ojoharaṇasākhaṃ vā pūtiṭṭhānaṃ vā chindituṃ vaṭṭatiyeva, bhagavato sarīrapaṭijaggane viya puññampi hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Saṅghabhede sīmaṭṭhakasaṅghe asannipatite visuṃ parisaṃ gahetvā katavohārānussāvana-salākaggāhassa kammaṃ vā karontassa, uddesaṃ vā uddisantassa bhedo ca hoti ānantariyakammañca. Samaggasaññāya pana vaṭṭatīti kammaṃ karontassa bhedova hoti, na ānantariyakammaṃ, tathā navato ūnaparisāyaṃ. Sabbantimena paricchedena ",
      " navannaṃ janānaṃ yo saṅghaṃ bhindati ",
      ", tassa ānantariyakammaṃ hoti. Anuvattakānaṃ adhammavādīnaṃ mahāsāvajjakammaṃ. Dhammavādino pana anavajjā."
    ],
    "innerText": "Saṅghabhede sīmaṭṭhakasaṅghe asannipatite visuṃ parisaṃ gahetvā katavohārānussāvana-salākaggāhassa kammaṃ vā karontassa, uddesaṃ vā uddisantassa bhedo ca hoti ānantariyakammañca. Samaggasaññāya pana vaṭṭatīti kammaṃ karontassa bhedova hoti, na ānantariyakammaṃ, tathā navato ūnaparisāyaṃ. Sabbantimena paricchedena navannaṃ janānaṃ yo saṅghaṃ bhindati , tassa ānantariyakammaṃ hoti. Anuvattakānaṃ adhammavādīnaṃ mahāsāvajjakammaṃ. Dhammavādino pana anavajjā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha navannameva saṅghabhede idaṃ suttaṃ – ‘‘ekato upāli cattāro honti, ekato cattāro, navamo anussāveti, salākaṃ gāheti ‘ayaṃ dhammo ayaṃ vinayo idaṃ satthusāsanaṃ, idaṃ gaṇhatha, imaṃ rocethā’ti, evaṃ kho, upāli, saṅgharāji ceva hoti saṅghabhedo ca. Navannaṃ vā, upāli, atirekanavannaṃ vā saṅgharāji ceva hoti saṅghabhedo cā’’ti (cūḷava. 351). Etesu pana pañcasu ",
      " saṅghabhedo vacīkammaṃ, sesāni kāyakammānīti. Evaṃ kammato viññātabbo vinicchayo."
    ],
    "innerText": "Tattha navannameva saṅghabhede idaṃ suttaṃ – ‘‘ekato upāli cattāro honti, ekato cattāro, navamo anussāveti, salākaṃ gāheti ‘ayaṃ dhammo ayaṃ vinayo idaṃ satthusāsanaṃ, idaṃ gaṇhatha, imaṃ rocethā’ti, evaṃ kho, upāli, saṅgharāji ceva hoti saṅghabhedo ca. Navannaṃ vā, upāli, atirekanavannaṃ vā saṅgharāji ceva hoti saṅghabhedo cā’’ti (cūḷava. 351). Etesu pana pañcasu saṅghabhedo vacīkammaṃ, sesāni kāyakammānīti. Evaṃ kammato viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvārato"
      },
      "ti sabbāneva cetāni kāyadvāratopi vacīdvāratopi samuṭṭhahanti. Purimāni panettha cattāri āṇattikavijjāmayapayogavasena vacīdvārato samuṭṭhahitvāpi kāyadvārameva pūrenti, saṅghabhedo hatthamuddāya bhedaṃ karontassa kāyadvārato samuṭṭhahitvāpi vacīdvārameva pūretīti. Evamettha dvāratopi viññātabbo vinicchayo."
    ],
    "innerText": "Dvāratoti sabbāneva cetāni kāyadvāratopi vacīdvāratopi samuṭṭhahanti. Purimāni panettha cattāri āṇattikavijjāmayapayogavasena vacīdvārato samuṭṭhahitvāpi kāyadvārameva pūrenti, saṅghabhedo hatthamuddāya bhedaṃ karontassa kāyadvārato samuṭṭhahitvāpi vacīdvārameva pūretīti. Evamettha dvāratopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappaṭṭhitiyato"
      },
      "ti saṅghabhedoyeva cettha kappaṭṭhitiyo. Saṇṭhahante hi kappe kappavemajjhe vā saṅghabhedaṃ katvā kappavināseyeva muccati. Sacepi hi sveva kappo vinassissatīti ajja saṅghabhedaṃ karoti, sveva muccati, ekadivasameva niraye paccati. Evaṃ karaṇaṃ pana natthi. Sesāni cattāri kammāni ānantariyāneva honti, na kappaṭṭhitiyānīti evamettha kappaṭṭhitiyatopi viññātabbo vinicchayo."
    ],
    "innerText": "Kappaṭṭhitiyatoti saṅghabhedoyeva cettha kappaṭṭhitiyo. Saṇṭhahante hi kappe kappavemajjhe vā saṅghabhedaṃ katvā kappavināseyeva muccati. Sacepi hi sveva kappo vinassissatīti ajja saṅghabhedaṃ karoti, sveva muccati, ekadivasameva niraye paccati. Evaṃ karaṇaṃ pana natthi. Sesāni cattāri kammāni ānantariyāneva honti, na kappaṭṭhitiyānīti evamettha kappaṭṭhitiyatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pākato"
      },
      "ti ",
      " yena ca pañcape’tāni kammāni katāni honti, tassa saṅghabhedoyeva paṭisandhivasena vipaccati, sesāni ‘‘ahosikammaṃ, nāhosi kammavipāko’’ti evamādīsu saṅkhyaṃ gacchanti. Saṅghassa bhedābhāve lohituppādo, tadabhāve arahantaghāto, tadabhāve ca sace pitā sīlavā hoti, mātā dussīlā, no vā tathā sīlavatī, pitughāto paṭisandhivasena vipaccati. Sace mātāpitughāto, dvīsupi sīlena vā dussīlena vā samānesu mātughātova paṭisandhivasena vipaccati ",
      ". Mātā hi dukkarakārinī bahūpakārā ca puttānanti evamettha pākatopi viññātabbo vinicchayo."
    ],
    "innerText": "Pākatoti yena ca pañcape’tāni kammāni katāni honti, tassa saṅghabhedoyeva paṭisandhivasena vipaccati, sesāni ‘‘ahosikammaṃ, nāhosi kammavipāko’’ti evamādīsu saṅkhyaṃ gacchanti. Saṅghassa bhedābhāve lohituppādo, tadabhāve arahantaghāto, tadabhāve ca sace pitā sīlavā hoti, mātā dussīlā, no vā tathā sīlavatī, pitughāto paṭisandhivasena vipaccati. Sace mātāpitughāto, dvīsupi sīlena vā dussīlena vā samānesu mātughātova paṭisandhivasena vipaccati . Mātā hi dukkarakārinī bahūpakārā ca puttānanti evamettha pākatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhāraṇādīhī"
      },
      "ti purimāni cattāri sabbesampi gahaṭṭhapabbajitānaṃ sādhāraṇāni. Saṅghabhedo pana ‘‘na kho, upāli bhikkhunī, saṅghaṃ bhindati, na sikkhamānā, na sāmaṇero, na sāmaṇerī, na upāsako, na upāsikā saṅghaṃ bhindati, bhikkhu kho, upāli, pakatatto samānasaṃvāsako samānasīmāyaṃ ṭhito saṅghaṃ bhindatī’’ti (cūḷava. 351) vacanato vuttappakārassa bhikkhunova hoti, na aññassa, tasmā asādhāraṇo. Ādisaddena sabbepi te dukkhavedanāsahagatā ",
      " dosamohasampayuttā cāti evamettha sādhāraṇādīhipi viññātabbo vinicchayo."
    ],
    "innerText": "Sādhāraṇādīhīti purimāni cattāri sabbesampi gahaṭṭhapabbajitānaṃ sādhāraṇāni. Saṅghabhedo pana ‘‘na kho, upāli bhikkhunī, saṅghaṃ bhindati, na sikkhamānā, na sāmaṇero, na sāmaṇerī, na upāsako, na upāsikā saṅghaṃ bhindati, bhikkhu kho, upāli, pakatatto samānasaṃvāsako samānasīmāyaṃ ṭhito saṅghaṃ bhindatī’’ti (cūḷava. 351) vacanato vuttappakārassa bhikkhunova hoti, na aññassa, tasmā asādhāraṇo. Ādisaddena sabbepi te dukkhavedanāsahagatā dosamohasampayuttā cāti evamettha sādhāraṇādīhipi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññaṃ satthāra"
      },
      "nti ‘‘ayaṃ me satthā satthukiccaṃ kātuṃ asamattho’’ti bhavantarepi aññaṃ titthakaraṃ ‘‘ayaṃ me satthā’’ti evaṃ gaṇheyya, netaṃ ṭhānaṃ vijjatīti attho."
    ],
    "innerText": "Aññaṃ satthāranti ‘‘ayaṃ me satthā satthukiccaṃ kātuṃ asamattho’’ti bhavantarepi aññaṃ titthakaraṃ ‘‘ayaṃ me satthā’’ti evaṃ gaṇheyya, netaṃ ṭhānaṃ vijjatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "129"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekissā lokadhātuyā"
      },
      "ti dasasahassilokadhātuyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tīṇi"
      },
      " hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khettāni"
      },
      " jātikhettaṃ āṇākhettaṃ visayakhettaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jātikhettaṃ"
      },
      " nāma dasasahassī lokadhātu. Sā hi tathāgatassa mātukucchiokkamanakāle nikkhamanakāle sambodhikāle dhammacakkappavattane āyusaṅkhārossajjane parinibbāne ca kampati. Koṭisatasahassacakkavāḷaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āṇākhettaṃ"
      },
      " nāma. Āṭānāṭiyamoraparittadhajaggaparittaratanaparittādīnañhi ettha āṇā vattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visayakhettassa"
      },
      " pana parimāṇaṃ natthi. Buddhānañhi ‘‘yāvatakaṃ ñāṇaṃ tāvatakaṃ neyyaṃ, yāvatakaṃ neyyaṃ tāvatakaṃ ñāṇaṃ, ñāṇapariyantikaṃ neyyaṃ neyyapariyantikaṃ ñāṇa’’nti (paṭi. ma. 3.5) vacanato avisayo nāma natthi."
    ],
    "innerText": "129.Ekissā lokadhātuyāti dasasahassilokadhātuyā. Tīṇi hi khettāni jātikhettaṃ āṇākhettaṃ visayakhettaṃ. Tattha jātikhettaṃ nāma dasasahassī lokadhātu. Sā hi tathāgatassa mātukucchiokkamanakāle nikkhamanakāle sambodhikāle dhammacakkappavattane āyusaṅkhārossajjane parinibbāne ca kampati. Koṭisatasahassacakkavāḷaṃ pana āṇākhettaṃ nāma. Āṭānāṭiyamoraparittadhajaggaparittaratanaparittādīnañhi ettha āṇā vattati. Visayakhettassa pana parimāṇaṃ natthi. Buddhānañhi ‘‘yāvatakaṃ ñāṇaṃ tāvatakaṃ neyyaṃ, yāvatakaṃ neyyaṃ tāvatakaṃ ñāṇaṃ, ñāṇapariyantikaṃ neyyaṃ neyyapariyantikaṃ ñāṇa’’nti (paṭi. ma. 3.5) vacanato avisayo nāma natthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesu pana tīsu khettesu ṭhapetvā imaṃ cakkavāḷaṃ aññasmiṃ cakkavāḷe buddhā uppajjantīti suttaṃ natthi, na uppajjantīti pana atthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tīṇi piṭakāni"
      },
      " vinayapiṭakaṃ suttantapiṭakaṃ abhidhammapiṭakaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tisso saṅgītiyo"
      },
      " mahākassapattherassa saṅgīti, yasattherassa saṅgīti, moggaliputtatissattherassa saṅgītīti. Imā tisso saṅgītiyo āruḷhe tepiṭake buddhavacane imaṃ ",
      " cakkavāḷaṃ muñcitvā aññattha buddhā uppajjantīti suttaṃ natthi, na uppajjantīti pana atthi."
    ],
    "innerText": "Imesu pana tīsu khettesu ṭhapetvā imaṃ cakkavāḷaṃ aññasmiṃ cakkavāḷe buddhā uppajjantīti suttaṃ natthi, na uppajjantīti pana atthi. Tīṇi piṭakāni vinayapiṭakaṃ suttantapiṭakaṃ abhidhammapiṭakaṃ, tisso saṅgītiyo mahākassapattherassa saṅgīti, yasattherassa saṅgīti, moggaliputtatissattherassa saṅgītīti. Imā tisso saṅgītiyo āruḷhe tepiṭake buddhavacane imaṃ cakkavāḷaṃ muñcitvā aññattha buddhā uppajjantīti suttaṃ natthi, na uppajjantīti pana atthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apubbaṃ acarima"
      },
      "nti apure apacchā. Ekato na uppajjanti, pure vā pacchā vā uppajjantīti vuttaṃ hoti. Tattha hi bodhipallaṅke bodhiṃ appatvā na uṭṭhahissāmīti nisinnakālato ",
      " paṭṭhāya yāva mātukucchismiṃ paṭisandhiggahaṇaṃ, tāva pubbeti na veditabbaṃ. Bodhisattassa hi paṭisandhiggahaṇena dasasahassacakkavāḷakampaneneva khettapariggaho kato, aññassa buddhassa uppatti nivāritāva hoti. Parinibbānakālato paṭṭhāya yāva sāsapamattā dhātu ",
      " tiṭṭhati, tāva pacchāti na veditabbaṃ. Dhātūsu hi ṭhitāsu buddhā ṭhitāva honti. Tasmā etthantare aññassa buddhassa uppatti nivāritāva hoti. Dhātuparinibbāne pana jāte aññassa buddhassa uppatti na nivāritā."
    ],
    "innerText": "Apubbaṃ acarimanti apure apacchā. Ekato na uppajjanti, pure vā pacchā vā uppajjantīti vuttaṃ hoti. Tattha hi bodhipallaṅke bodhiṃ appatvā na uṭṭhahissāmīti nisinnakālato paṭṭhāya yāva mātukucchismiṃ paṭisandhiggahaṇaṃ, tāva pubbeti na veditabbaṃ. Bodhisattassa hi paṭisandhiggahaṇena dasasahassacakkavāḷakampaneneva khettapariggaho kato, aññassa buddhassa uppatti nivāritāva hoti. Parinibbānakālato paṭṭhāya yāva sāsapamattā dhātu tiṭṭhati, tāva pacchāti na veditabbaṃ. Dhātūsu hi ṭhitāsu buddhā ṭhitāva honti. Tasmā etthantare aññassa buddhassa uppatti nivāritāva hoti. Dhātuparinibbāne pana jāte aññassa buddhassa uppatti na nivāritā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tīṇi hi antaradhānāni"
      },
      " nāma pariyattiantaradhānaṃ, paṭivedhaantaradhānaṃ, paṭipattiantaradhānanti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariyattī"
      },
      "ti tīṇi piṭakāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭivedho"
      },
      "ti saccapaṭivedho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭipattī"
      },
      "ti paṭipadā. Tattha paṭivedho ca paṭipatti ca hotipi na hotipi. Ekasmiñhi kāle paṭivedhadharā bhikkhū bahū honti, eso bhikkhu puthujjanoti aṅguliṃ pasāretvā dassetabbo hoti. Imasmiṃyeva dīpe ekavāre puthujjanabhikkhu nāma nāhosi. Paṭipattipūrikāpi kadāci bahū honti kadāci appā. Iti paṭivedho ca paṭipatti ca hotipi na hotipi, sāsanaṭṭhitiyā pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariyatti pamāṇaṃ"
      },
      "."
    ],
    "innerText": "Tīṇi hi antaradhānāni nāma pariyattiantaradhānaṃ, paṭivedhaantaradhānaṃ, paṭipattiantaradhānanti. Tattha pariyattīti tīṇi piṭakāni. Paṭivedhoti saccapaṭivedho. Paṭipattīti paṭipadā. Tattha paṭivedho ca paṭipatti ca hotipi na hotipi. Ekasmiñhi kāle paṭivedhadharā bhikkhū bahū honti, eso bhikkhu puthujjanoti aṅguliṃ pasāretvā dassetabbo hoti. Imasmiṃyeva dīpe ekavāre puthujjanabhikkhu nāma nāhosi. Paṭipattipūrikāpi kadāci bahū honti kadāci appā. Iti paṭivedho ca paṭipatti ca hotipi na hotipi, sāsanaṭṭhitiyā pana pariyatti pamāṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṇḍito hi tepiṭakaṃ sutvā dvepi pūreti. Yathā amhākaṃ bodhisatto āḷārassa santike pañcābhiññā satta ca samāpattiyo nibbattetvā nevasaññānāsaññāyatanasamāpattiyā parikammaṃ pucchi, so na jānāmīti āha. Tato udakassa santikaṃ gantvā adhigataṃ visesaṃ saṃsandetvā nevasaññānāsaññāyatanassa parikammaṃ pucchi, so ācikkhi, tassa vacanasamanantarameva mahāsatto taṃ sampādesi, evameva paññavā bhikkhu pariyattiṃ sutvā dvepi pūreti. Tasmā ",
      " pariyattiyā ṭhitāya sāsanaṃ ṭhitaṃ hoti."
    ],
    "innerText": "Paṇḍito hi tepiṭakaṃ sutvā dvepi pūreti. Yathā amhākaṃ bodhisatto āḷārassa santike pañcābhiññā satta ca samāpattiyo nibbattetvā nevasaññānāsaññāyatanasamāpattiyā parikammaṃ pucchi, so na jānāmīti āha. Tato udakassa santikaṃ gantvā adhigataṃ visesaṃ saṃsandetvā nevasaññānāsaññāyatanassa parikammaṃ pucchi, so ācikkhi, tassa vacanasamanantarameva mahāsatto taṃ sampādesi, evameva paññavā bhikkhu pariyattiṃ sutvā dvepi pūreti. Tasmā pariyattiyā ṭhitāya sāsanaṃ ṭhitaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadā ",
      " pana sā antaradhāyati, tadā paṭhamaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhidhammapiṭakaṃ"
      },
      " nassati. Tattha paṭṭhānaṃ sabbapaṭhamaṃ antaradhāyati, anukkamena pacchā dhammasaṅgaho, tasmiṃ antarahite itaresu dvīsu piṭakesu ṭhitesu sāsanaṃ ṭhitameva hoti. Tattha suttantapiṭake antaradhāyamāne paṭhamaṃ aṅguttaranikāyo ekādasakato paṭṭhāya yāva ekakā antaradhāyati, tadanantaraṃ saṃyuttanikāyo cakkapeyyālato paṭṭhāya yāva oghataraṇā antaradhāyati, tadanantaraṃ majjhimanikāyo indriyabhāvanato paṭṭhāya yāva mūlapariyāyā antaradhāyati, tadanantaraṃ dīghanikāyo dasuttarato paṭṭhāya yāva brahmajālā antaradhāyati. Ekissāpi dvinnampi gāthānaṃ pucchā addhānaṃ gacchati, sāsanaṃ dhāretuṃ na sakkoti sabhiyapucchā (su. ni. sabhiyasuttaṃ) viya āḷavakapucchā (su. ni. āḷavakasuttaṃ; saṃ. ni. 1.246) ",
      " viya ca. Etā kira kassapabuddhakālikā antarā sāsanaṃ dhāretuṃ nāsakkhiṃsu."
    ],
    "innerText": "Yadā pana sā antaradhāyati, tadā paṭhamaṃ abhidhammapiṭakaṃ nassati. Tattha paṭṭhānaṃ sabbapaṭhamaṃ antaradhāyati, anukkamena pacchā dhammasaṅgaho, tasmiṃ antarahite itaresu dvīsu piṭakesu ṭhitesu sāsanaṃ ṭhitameva hoti. Tattha suttantapiṭake antaradhāyamāne paṭhamaṃ aṅguttaranikāyo ekādasakato paṭṭhāya yāva ekakā antaradhāyati, tadanantaraṃ saṃyuttanikāyo cakkapeyyālato paṭṭhāya yāva oghataraṇā antaradhāyati, tadanantaraṃ majjhimanikāyo indriyabhāvanato paṭṭhāya yāva mūlapariyāyā antaradhāyati, tadanantaraṃ dīghanikāyo dasuttarato paṭṭhāya yāva brahmajālā antaradhāyati. Ekissāpi dvinnampi gāthānaṃ pucchā addhānaṃ gacchati, sāsanaṃ dhāretuṃ na sakkoti sabhiyapucchā (su. ni. sabhiyasuttaṃ) viya āḷavakapucchā (su. ni. āḷavakasuttaṃ; saṃ. ni. 1.246) viya ca. Etā kira kassapabuddhakālikā antarā sāsanaṃ dhāretuṃ nāsakkhiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dvīsu pana piṭakesu antarahitesupi vinayapiṭake ṭhite sāsanaṃ tiṭṭhati, parivārakhandhakesu antarahitesu ubhatovibhaṅge ṭhite ṭhitameva hoti. Ubhatovibhaṅge antarahite mātikāya ṭhitāyapi ṭhitameva hoti. Mātikāya antarahitāya pātimokkhapabbajjaupasampadāsu ṭhitāsu sāsanaṃ tiṭṭhati. Liṅgamaddhānaṃ gacchati, setavatthasamaṇavaṃso pana kassapabuddhakālato paṭṭhāya sāsanaṃ dhāretuṃ nāsakkhi. Pacchimakassa pana saccapaṭivedhato pacchimakassa sīlabhedato ca paṭṭhāya sāsanaṃ osakkitaṃ nāma hoti. Tato paṭṭhāya aññassa buddhassa uppatti na vāritāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tīṇi parinibbānāni"
      },
      " nāma kilesaparinibbānaṃ khandhaparinibbānaṃ dhātuparinibbānanti. Tattha kilesaparinibbānaṃ bodhipallaṅke ahosi, khandhaparinibbānaṃ kusinārāyaṃ, dhātuparinibbānaṃ anāgate bhavissati. Sāsanassa kira osakkanakāle imasmiṃ tambapaṇṇidīpe dhātuyo ",
      " sannipatitvā mahācetiyaṃ gamissanti, mahācetiyato nāgadīpe rājāyatanacetiyaṃ, tato mahābodhipallaṅkaṃ gamissanti, nāgabhavanatopi devalokatopi brahmalokatopi dhātuyo mahābodhipallaṅkameva gamissanti. Sāsapamattāpi dhātu antarā na nassissati. Sabbā dhātuyo mahābodhipallaṅke rāsibhūtā suvaṇṇakkhandho viya ekagghanā hutvā chabbaṇṇarasmiyo vissajjessanti, tā dasasahassilokadhātuṃ pharissanti."
    ],
    "innerText": "Tīṇi parinibbānāni nāma kilesaparinibbānaṃ khandhaparinibbānaṃ dhātuparinibbānanti. Tattha kilesaparinibbānaṃ bodhipallaṅke ahosi, khandhaparinibbānaṃ kusinārāyaṃ, dhātuparinibbānaṃ anāgate bhavissati. Sāsanassa kira osakkanakāle imasmiṃ tambapaṇṇidīpe dhātuyo sannipatitvā mahācetiyaṃ gamissanti, mahācetiyato nāgadīpe rājāyatanacetiyaṃ, tato mahābodhipallaṅkaṃ gamissanti, nāgabhavanatopi devalokatopi brahmalokatopi dhātuyo mahābodhipallaṅkameva gamissanti. Sāsapamattāpi dhātu antarā na nassissati. Sabbā dhātuyo mahābodhipallaṅke rāsibhūtā suvaṇṇakkhandho viya ekagghanā hutvā chabbaṇṇarasmiyo vissajjessanti, tā dasasahassilokadhātuṃ pharissanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato ",
      " dasasahassacakkavāḷe devatā yo sannipatitvā ‘‘ajja satthā parinibbāyati, ajja sāsanaṃ osakkati, pacchimadassanaṃ dāni idaṃ amhāka’’nti dasabalassa parinibbutadivasato mahantataraṃ kāruññaṃ karissanti. Ṭhapetvā anāgāmikhīṇāsave avasesā sakabhāvena saṇṭhātuṃ na sakkhissanti. Dhātūsu tejodhātu uṭṭhahitvā yāva brahmalokā uggacchissati, sāsapamattāyapi dhātuyā sati ekajālāva bhavissati, dhātūsu pariyādānaṃ gatāsu pacchijjissati. Evaṃ mahantaṃ ānubhāvaṃ dassetvā dhātūsu antarahitāsu sāsanaṃ antarahitaṃ ",
      " nāma hoti. Yāva evaṃ na anantaradhāyati, tāva acarimaṃ nāma hoti. Evaṃ apubbaṃ acarimaṃ uppajjeyyunti netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "Tato dasasahassacakkavāḷe devatā yo sannipatitvā ‘‘ajja satthā parinibbāyati, ajja sāsanaṃ osakkati, pacchimadassanaṃ dāni idaṃ amhāka’’nti dasabalassa parinibbutadivasato mahantataraṃ kāruññaṃ karissanti. Ṭhapetvā anāgāmikhīṇāsave avasesā sakabhāvena saṇṭhātuṃ na sakkhissanti. Dhātūsu tejodhātu uṭṭhahitvā yāva brahmalokā uggacchissati, sāsapamattāyapi dhātuyā sati ekajālāva bhavissati, dhātūsu pariyādānaṃ gatāsu pacchijjissati. Evaṃ mahantaṃ ānubhāvaṃ dassetvā dhātūsu antarahitāsu sāsanaṃ antarahitaṃ nāma hoti. Yāva evaṃ na anantaradhāyati, tāva acarimaṃ nāma hoti. Evaṃ apubbaṃ acarimaṃ uppajjeyyunti netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kasmā pana apubbaṃ acarimaṃ na uppajjantīti. Anacchariyattā. Buddhā hi acchariyamanussā. Yathāha – ‘‘ekapuggalo, bhikkhave, loke uppajjamāno uppajjati acchariyamanusso, katamo ekapuggalo, tathāgato arahaṃ sammāsambuddho’’ti (a. ni. 1.171-174)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadi ca dve vā cattāro vā aṭṭha vā soḷasa vā ekato uppajjeyyuṃ, na acchariyā bhaveyyuṃ. Ekasmiñhi vihāre dvinnaṃ cetiyānampi lābhasakkāro uḷāro na hoti bhikkhūpi bahutāya na acchariyā ",
      " jātā, evaṃ buddhāpi bhaveyyuṃ. Tasmā na uppajjanti."
    ],
    "innerText": "Yadi ca dve vā cattāro vā aṭṭha vā soḷasa vā ekato uppajjeyyuṃ, na acchariyā bhaveyyuṃ. Ekasmiñhi vihāre dvinnaṃ cetiyānampi lābhasakkāro uḷāro na hoti bhikkhūpi bahutāya na acchariyā jātā, evaṃ buddhāpi bhaveyyuṃ. Tasmā na uppajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāya ca visesābhāvato. Yañhi satipaṭṭhānādibhedaṃ dhammaṃ eko deseti, aññena uppajjitvāpi sova desetabbo siyā. Tato na acchariyo siyā, ekasmiṃ pana dhammaṃ desente desanāpi acchariyā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vivādābhāvato ca. Bahūsu ca buddhesu uppajjantesu bahūnaṃ ācariyānaṃ antevāsikā viya ‘‘amhākaṃ buddho pāsādiko, amhākaṃ buddho madhurassaro lābhī puññavā’’ti vivadeyyuṃ, tasmāpi evaṃ na uppajjanti. Apicetaṃ kāraṇaṃ milindaraññā puṭṭhena nāgasenattherena vitthāritameva. Vuttañhi (mi. pa. 5.1.1) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tattha, bhante nāgasena, bhāsitampetaṃ bhagavatā ‘aṭṭhānametaṃ, bhikkhave, anavakāso, yaṃ ekissā lokadhātuyā dve arahanto sammāsambuddhā ",
      " apubbaṃ acarimaṃ uppajjeyyuṃ, netaṃ ṭhānaṃ vijjatī’ti. Desentā ca, bhante nāgasena, sabbepi tathāgatā sattatiṃsa bodhipakkhiyadhamme desenti, kathayamānā ca cattāri ariyasaccāni kathenti, sikkhāpentā ca tīsu sikkhāsu sikkhāpenti, anusāsamānā ca appamādapaṭipattiyaṃ anusāsanti. Yadi, bhante nāgasena, sabbesampi tathāgatānaṃ ekā desanā ekā kathā ekā sikkhā ekā anusiṭṭhi, kena kāraṇena ",
      " dve tathāgatā ekakkhaṇe nuppajjanti? Ekenapi tāva buddhuppādena ayaṃ loko obhāsajāto. Yadi dutiyo buddho bhaveyya, dvinnaṃ ",
      " pabhāya ayaṃ loko bhiyyosomattāya obhāsajāto bhaveyya. Ovadamānā ca dve tathāgatā sukhaṃ ovadeyyuṃ, anusāsamānā ca sukhaṃ anusāseyyuṃ, tattha me kāraṇaṃ brūhi, yathāhaṃ nissaṃsayo bhaveyyanti."
    ],
    "innerText": "‘‘Tattha, bhante nāgasena, bhāsitampetaṃ bhagavatā ‘aṭṭhānametaṃ, bhikkhave, anavakāso, yaṃ ekissā lokadhātuyā dve arahanto sammāsambuddhā apubbaṃ acarimaṃ uppajjeyyuṃ, netaṃ ṭhānaṃ vijjatī’ti. Desentā ca, bhante nāgasena, sabbepi tathāgatā sattatiṃsa bodhipakkhiyadhamme desenti, kathayamānā ca cattāri ariyasaccāni kathenti, sikkhāpentā ca tīsu sikkhāsu sikkhāpenti, anusāsamānā ca appamādapaṭipattiyaṃ anusāsanti. Yadi, bhante nāgasena, sabbesampi tathāgatānaṃ ekā desanā ekā kathā ekā sikkhā ekā anusiṭṭhi, kena kāraṇena dve tathāgatā ekakkhaṇe nuppajjanti? Ekenapi tāva buddhuppādena ayaṃ loko obhāsajāto. Yadi dutiyo buddho bhaveyya, dvinnaṃ pabhāya ayaṃ loko bhiyyosomattāya obhāsajāto bhaveyya. Ovadamānā ca dve tathāgatā sukhaṃ ovadeyyuṃ, anusāsamānā ca sukhaṃ anusāseyyuṃ, tattha me kāraṇaṃ brūhi, yathāhaṃ nissaṃsayo bhaveyyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ mahārāja dasasahassī lokadhātu ekabuddhadhāraṇī, ekasseva tathāgatassa guṇaṃ dhāreti, yadi dutiyo buddho uppajjeyya, nāyaṃ dasasahassī lokadhātu dhāreyya, caleyya kampeyya nameyya onameyya vinameyya vikireyya vidhameyya viddhaṃseyya, na ṭhānamupagaccheyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathā, mahārāja, nāvā ekapurisasandhāraṇī bhaveyya. Ekasmiṃ purise abhirūḷhe sā nāvā samupādikā bhaveyya. Atha dutiyo puriso āgaccheyya tādiso āyunā vaṇṇena vayena pamāṇena kisathūlena sabbaṅgapaccaṅgena, so taṃ nāvaṃ abhirūheyya. Apinu sā mahārāja, nāvā dvinnampi dhāreyyāti? Na hi, bhante, caleyya kampeyya nameyya onameyya vinameyya vikireyya vidhameyya viddhaṃseyya, na ṭhānamupagaccheyya, osīdeyya udaketi. Evameva kho, mahārāja, ayaṃ dasasahassī lokadhātu ekabuddhadhāraṇī, ekasseva tathāgatassa guṇaṃ dhāreti, yadi dutiyo buddho uppajjeyya, nāyaṃ dasasahassī lokadhātu dhāreyya, caleyya…pe… na ṭhānamupagaccheyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā vā pana mahārāja puriso yāvadatthaṃ bhojanaṃ bhuñjeyya chādentaṃ yāvakaṇṭhamabhipūrayitvā, so dhāto pīṇito paripuṇṇo nirantaro tandikato anonamitadaṇḍajāto punadeva tattakaṃ bhojanaṃ ",
      " bhuñjeyya, apinu kho, mahārāja, puriso sukhito bhaveyyāti? Na hi, bhante, sakiṃ bhuttova mareyyāti. Evameva kho, mahārāja, ayaṃ dasasahassī lokadhātu ekabuddhadhāraṇī ",
      "…pe… na ṭhānamupagaccheyyāti."
    ],
    "innerText": "Yathā vā pana mahārāja puriso yāvadatthaṃ bhojanaṃ bhuñjeyya chādentaṃ yāvakaṇṭhamabhipūrayitvā, so dhāto pīṇito paripuṇṇo nirantaro tandikato anonamitadaṇḍajāto punadeva tattakaṃ bhojanaṃ bhuñjeyya, apinu kho, mahārāja, puriso sukhito bhaveyyāti? Na hi, bhante, sakiṃ bhuttova mareyyāti. Evameva kho, mahārāja, ayaṃ dasasahassī lokadhātu ekabuddhadhāraṇī …pe… na ṭhānamupagaccheyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kiṃ nu kho, bhante nāgasena, atidhammabhārena pathavī calatīti? Idha, mahārāja, dve sakaṭā ratanaparipūritā bhaveyyuṃ yāva mukhasamā. Ekasmā sakaṭato ratanaṃ gahetvā ekasmiṃ sakaṭe ākireyyuṃ, apinu kho taṃ, mahārāja, sakaṭaṃ dvinnampi sakaṭānaṃ ratanaṃ dhāreyyāti? Na hi, bhante, nābhipi tassa phaleyya, arāpi tassa bhijjeyyuṃ, nemipi tassa opateyya, akkhopi ",
      " tassa bhijjeyyāti. Kiṃ nu kho, mahārāja, atiratanabhārena sakaṭaṃ bhijjatīti? Āma, bhanteti. Evameva kho, mahārāja, atidhammabhārena pathavī calatīti."
    ],
    "innerText": "Kiṃ nu kho, bhante nāgasena, atidhammabhārena pathavī calatīti? Idha, mahārāja, dve sakaṭā ratanaparipūritā bhaveyyuṃ yāva mukhasamā. Ekasmā sakaṭato ratanaṃ gahetvā ekasmiṃ sakaṭe ākireyyuṃ, apinu kho taṃ, mahārāja, sakaṭaṃ dvinnampi sakaṭānaṃ ratanaṃ dhāreyyāti? Na hi, bhante, nābhipi tassa phaleyya, arāpi tassa bhijjeyyuṃ, nemipi tassa opateyya, akkhopi tassa bhijjeyyāti. Kiṃ nu kho, mahārāja, atiratanabhārena sakaṭaṃ bhijjatīti? Āma, bhanteti. Evameva kho, mahārāja, atidhammabhārena pathavī calatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Apica mahārāja imaṃ kāraṇaṃ buddhabalaparidīpanāya osāritaṃ, aññampi tattha abhirūpaṃ kāraṇaṃ suṇohi, yena kāraṇena dve sammāsambuddhā ekakkhaṇe nuppajjanti. Yadi, mahārāja, dve sammāsambuddhā ekakkhaṇe uppajjeyyuṃ, tesaṃ parisāya vivādo uppajjeyya – ‘‘tumhākaṃ buddho amhākaṃ buddho’’ti ubhatopakkhajātā bhaveyyuṃ. Yathā, mahārāja, dvinnaṃ balavāmaccānaṃ parisāya vivādo uppajjeyya ‘tumhākaṃ amacco amhākaṃ amacco’ti ubhatopakkhajātā honti, evameva kho, mahārāja, yadi, dve sammāsambuddhā ekakkhaṇe uppajjeyyuṃ, tesaṃ parisāya vivādo uppajjeyya ‘tumhākaṃ buddho amhākaṃ buddho’ti ubhatopakkhajātā bhaveyyuṃ. Idaṃ tāva, mahārāja, ekaṃ kāraṇaṃ, yena kāraṇena dve sammāsambuddhā ekakkhaṇe nuppajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi, yena kāraṇena dve sammāsambuddhā ekakkhaṇe nuppajjanti. Yadi, mahārāja, dve sammāsambuddhā ekakkhaṇe uppajjeyyuṃ, aggo buddhoti yaṃ vacanaṃ, taṃ micchā bhaveyya. Jeṭṭho buddhoti yaṃ vacanaṃ, taṃ micchā bhaveyya. Seṭṭho buddhoti, visiṭṭho buddhoti, uttamo buddhoti, pavaro buddhoti, asamo buddhoti, asamasamo buddhoti, appaṭisamo buddhoti, appaṭibhāgo buddhoti, appaṭipuggalo buddhoti yaṃ vacanaṃ ",
      ", taṃ micchā bhaveyya. Idampi kho tvaṃ, mahārāja ",
      ", kāraṇaṃ atthato sampaṭiccha, yena kāraṇena dve sammāsambuddhā ekakkhaṇe nuppajjanti."
    ],
    "innerText": "Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi, yena kāraṇena dve sammāsambuddhā ekakkhaṇe nuppajjanti. Yadi, mahārāja, dve sammāsambuddhā ekakkhaṇe uppajjeyyuṃ, aggo buddhoti yaṃ vacanaṃ, taṃ micchā bhaveyya. Jeṭṭho buddhoti yaṃ vacanaṃ, taṃ micchā bhaveyya. Seṭṭho buddhoti, visiṭṭho buddhoti, uttamo buddhoti, pavaro buddhoti, asamo buddhoti, asamasamo buddhoti, appaṭisamo buddhoti, appaṭibhāgo buddhoti, appaṭipuggalo buddhoti yaṃ vacanaṃ , taṃ micchā bhaveyya. Idampi kho tvaṃ, mahārāja , kāraṇaṃ atthato sampaṭiccha, yena kāraṇena dve sammāsambuddhā ekakkhaṇe nuppajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica kho mahārāja buddhānaṃ bhagavantānaṃ sabhāvapakati esā, yaṃ ekoyeva buddho loke uppajjati. Kasmā kāraṇā? Mahantatāya sabbaññubuddhaguṇānaṃ. Aññampi mahārāja yaṃ loke mahantaṃ, taṃ ekaṃyeva hoti. Pathavī, mahārāja, mahantī, sā ekāyeva. Sāgaro mahanto, so ekoyeva. Sineru girirājā mahanto, so ekoyeva. Ākāso mahanto, so ekoyeva. Sakko mahanto, so ekoyeva. Māro mahanto, so ekoyeva. Brahmā mahanto, so ekoyeva. Tathāgato arahaṃ sammāsambuddho mahanto, so ekoyeva lokasmiṃ. Yattha te uppajjanti, tattha aññassa ",
      " okāso na hoti. Tasmā, mahārāja, tathāgato arahaṃ sammāsambuddho ekoyeva lokasmiṃ uppajjatīti. Sukathito, bhante nāgasena, pañho opammehi kāraṇehī’’ti."
    ],
    "innerText": "Apica kho mahārāja buddhānaṃ bhagavantānaṃ sabhāvapakati esā, yaṃ ekoyeva buddho loke uppajjati. Kasmā kāraṇā? Mahantatāya sabbaññubuddhaguṇānaṃ. Aññampi mahārāja yaṃ loke mahantaṃ, taṃ ekaṃyeva hoti. Pathavī, mahārāja, mahantī, sā ekāyeva. Sāgaro mahanto, so ekoyeva. Sineru girirājā mahanto, so ekoyeva. Ākāso mahanto, so ekoyeva. Sakko mahanto, so ekoyeva. Māro mahanto, so ekoyeva. Brahmā mahanto, so ekoyeva. Tathāgato arahaṃ sammāsambuddho mahanto, so ekoyeva lokasmiṃ. Yattha te uppajjanti, tattha aññassa okāso na hoti. Tasmā, mahārāja, tathāgato arahaṃ sammāsambuddho ekoyeva lokasmiṃ uppajjatīti. Sukathito, bhante nāgasena, pañho opammehi kāraṇehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekissā lokadhātuyā"
      },
      "ti ekasmiṃ cakkavāḷe. Heṭṭhā imināva padena dasacakkavāḷasahassāni gahitāni tānipi, ekacakkavāḷeneva paricchindituṃ vaṭṭanti. Buddhā hi uppajjamānā imasmiṃyeva cakkavāḷe uppajjanti, uppajjanaṭṭhāne pana vārite ito aññesu cakkavāḷesu nuppajjantīti vāritameva hoti."
    ],
    "innerText": "Ekissā lokadhātuyāti ekasmiṃ cakkavāḷe. Heṭṭhā imināva padena dasacakkavāḷasahassāni gahitāni tānipi, ekacakkavāḷeneva paricchindituṃ vaṭṭanti. Buddhā hi uppajjamānā imasmiṃyeva cakkavāḷe uppajjanti, uppajjanaṭṭhāne pana vārite ito aññesu cakkavāḷesu nuppajjantīti vāritameva hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apubbaṃ acarima"
      },
      "nti ettha cakkaratanapātubhāvato pubbe pubbaṃ, tasseva antaradhānato pacchā carimaṃ. Tattha dvidhā cakkaratanassa antaradhānaṃ hoti, cakkavattino kālaṃkiriyato vā pabbajjāya vā. Antaradhāyamānañca pana taṃ kālaṃkiriyato vā pabbajjato vā sattame divase antaradhāyati, tato paraṃ cakkavattino pātubhāvo avārito."
    ],
    "innerText": "Apubbaṃ acarimanti ettha cakkaratanapātubhāvato pubbe pubbaṃ, tasseva antaradhānato pacchā carimaṃ. Tattha dvidhā cakkaratanassa antaradhānaṃ hoti, cakkavattino kālaṃkiriyato vā pabbajjāya vā. Antaradhāyamānañca pana taṃ kālaṃkiriyato vā pabbajjato vā sattame divase antaradhāyati, tato paraṃ cakkavattino pātubhāvo avārito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kasmā pana ekacakkavāḷe dve cakkavattino nuppajjantīti ",
      ". Vivādupacchedato acchariyabhāvato cakkaratanassa mahānubhāvato ca. Dvīsu hi uppajjantesu ‘‘amhākaṃ rājā mahanto amhākaṃ rājā mahanto’’ti vivādo uppajjeyya. Ekasmiṃ dīpe cakkavattīti ca ekasmiṃ dīpe cakkavattīti ca anacchariyā bhaveyyuṃ ",
      ". Yo cāyaṃ cakkaratanassa dvisahassadīpaparivāresu catūsu mahādīpesu issariyānuppadānasamattho mahānubhāvo, so parihāyetha. Iti vivādupacchedato acchariyabhāvato cakkaratanassa mahānubhāvato ca na ekacakkavāḷe dve uppajjanti."
    ],
    "innerText": "Kasmā pana ekacakkavāḷe dve cakkavattino nuppajjantīti . Vivādupacchedato acchariyabhāvato cakkaratanassa mahānubhāvato ca. Dvīsu hi uppajjantesu ‘‘amhākaṃ rājā mahanto amhākaṃ rājā mahanto’’ti vivādo uppajjeyya. Ekasmiṃ dīpe cakkavattīti ca ekasmiṃ dīpe cakkavattīti ca anacchariyā bhaveyyuṃ . Yo cāyaṃ cakkaratanassa dvisahassadīpaparivāresu catūsu mahādīpesu issariyānuppadānasamattho mahānubhāvo, so parihāyetha. Iti vivādupacchedato acchariyabhāvato cakkaratanassa mahānubhāvato ca na ekacakkavāḷe dve uppajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "130"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ itthī assa arahaṃ sammāsambuddho"
      },
      "ti ettha tiṭṭhatu tāva sabbaññuguṇe nibbattetvā lokuttāraṇasamattho buddhabhāvo, paṇidhānamattampi itthiyā na sampajjati."
    ],
    "innerText": "130.Yaṃ itthī assa arahaṃ sammāsambuddhoti ettha tiṭṭhatu tāva sabbaññuguṇe nibbattetvā lokuttāraṇasamattho buddhabhāvo, paṇidhānamattampi itthiyā na sampajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Manussattaṃ liṅgasampatti, hetu satthāradassanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Pabbajjā guṇasampatti, adhikāro ca chandatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aṭṭhadhammasamodhānā, abhinīhāro samijjhatīti. (bu. vaṃ. 2.59) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imāni ",
      " hi paṇidhānasampattikāraṇāni. Iti paṇidhānampi sampādetuṃ asamatthāya itthiyā kuto buddhabhāvoti ‘‘aṭṭhānametaṃ anavakāso yaṃ itthī assa arahaṃ sammāsambuddho’’ti vuttaṃ. Sabbākāraparipūro ca puññussayo sabbākāraparipūrameva attabhāvaṃ nibbattetīti purisova arahaṃ hoti sammāsambuddho."
    ],
    "innerText": "Imāni hi paṇidhānasampattikāraṇāni. Iti paṇidhānampi sampādetuṃ asamatthāya itthiyā kuto buddhabhāvoti ‘‘aṭṭhānametaṃ anavakāso yaṃ itthī assa arahaṃ sammāsambuddho’’ti vuttaṃ. Sabbākāraparipūro ca puññussayo sabbākāraparipūrameva attabhāvaṃ nibbattetīti purisova arahaṃ hoti sammāsambuddho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ itthī rājā assa cakkavattī"
      },
      "tiādīsupi yasmā itthiyā ",
      " kosohitavatthaguyhatādīnaṃ abhāvena lakkhaṇāni na paripūrenti, itthiratanābhāvena sattaratanasamaṅgitā na sampajjati, sabbamanussehi ca adhiko attabhāvo na hoti, tasmā ‘‘aṭṭhānametaṃ anavakāso yaṃ itthī rājā assa cakkavattī’’ti vuttaṃ. Yasmā ca sakkattādīni tīṇi ṭhānāni uttamāni, itthiliṅgañca hīnaṃ, tasmā tassā sakkattādīnipi paṭisiddhāni."
    ],
    "innerText": "Yaṃ itthī rājā assa cakkavattītiādīsupi yasmā itthiyā kosohitavatthaguyhatādīnaṃ abhāvena lakkhaṇāni na paripūrenti, itthiratanābhāvena sattaratanasamaṅgitā na sampajjati, sabbamanussehi ca adhiko attabhāvo na hoti, tasmā ‘‘aṭṭhānametaṃ anavakāso yaṃ itthī rājā assa cakkavattī’’ti vuttaṃ. Yasmā ca sakkattādīni tīṇi ṭhānāni uttamāni, itthiliṅgañca hīnaṃ, tasmā tassā sakkattādīnipi paṭisiddhāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nanu ca yathā itthiliṅgaṃ, evaṃ purisaliṅgampi brahmaloke natthi? Tasmā ‘‘yaṃ puriso brahmattaṃ kareyya, ṭhānametaṃ vijjatī’’tipi na vattabbaṃ siyāti. No na vattabbaṃ. Kasmā? Idha purisassa tattha nibbattanato. Brahmattanti hi mahābrahmattaṃ adhippetaṃ. Itthī ca idha jhānaṃ bhāvetvā kālaṃ katvā brahmapārisajjānaṃ sahabyataṃ upapajjati, na mahābrahmānaṃ, puriso pana tattha na uppajjatīti na vattabbo. Samānepi cettha ubhayaliṅgābhāve purisasaṇṭhānāva brahmāno, na itthisaṇṭhānā, tasmā suvuttamevetaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "131"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyaduccaritassā"
      },
      "tiādīsu ",
      " yathā nimbabījakosātakībījādīni madhuraphalaṃ na nibbattenti, asātaṃ amadhurameva nibbattenti, evaṃ kāyaduccaritādīni madhuravipākaṃ na nibbattenti, amadhurameva vipākaṃ nibbattenti. Yathā ca ucchubījasālibījādīni madhuraṃ sādurasameva phalaṃ nibbattenti, na asātaṃ kaṭukaṃ, evaṃ ",
      " kāyasucaritādīni madhurameva vipākaṃ nibbattenti, na amadhuraṃ. Vuttampi cetaṃ –"
    ],
    "innerText": "131.Kāyaduccaritassātiādīsu yathā nimbabījakosātakībījādīni madhuraphalaṃ na nibbattenti, asātaṃ amadhurameva nibbattenti, evaṃ kāyaduccaritādīni madhuravipākaṃ na nibbattenti, amadhurameva vipākaṃ nibbattenti. Yathā ca ucchubījasālibījādīni madhuraṃ sādurasameva phalaṃ nibbattenti, na asātaṃ kaṭukaṃ, evaṃ kāyasucaritādīni madhurameva vipākaṃ nibbattenti, na amadhuraṃ. Vuttampi cetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yādisaṃ vapate bījaṃ, tādisaṃ harate phalaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kalyāṇakārī kalyāṇaṃ, pāpakārī ca pāpaka’’nti. (saṃ. ni. 1.256);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmā ",
      " ‘‘aṭṭhānametaṃ anavakāso yaṃ kāyaduccaritassā’’tiādi vuttaṃ."
    ],
    "innerText": "Tasmā ‘‘aṭṭhānametaṃ anavakāso yaṃ kāyaduccaritassā’’tiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyaduccaritasamaṅgī"
      },
      "tiādīsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samaṅgī"
      },
      "ti pañcavidhā samaṅgitā āyūhanasamaṅgitā cetanāsamaṅgitā kammasamaṅgitā vipākasamaṅgitā, upaṭṭhānasamaṅgitāti. Tattha kusalākusalakammāyūhanakkhaṇe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āyūhanasamaṅgitā"
      },
      "ti vuccati. Tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cetanāsamaṅgitā"
      },
      ". Yāva pana arahattaṃ na pāpuṇanti, tāva sabbepi sattā pubbe upacitaṃ vipākārahaṃ kammaṃ sandhāya ‘‘kammasamaṅgino’’ti vuccanti, esā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammasamaṅgitā. Vipākasamaṅgitā"
      },
      " vipākakkhaṇeyeva veditabbā. Yāva pana sattā arahattaṃ na pāpuṇanti, tāva nesaṃ tato tato cavitvā niraye tāva uppajjamānānaṃ aggijālalohakumbhiādīhi upaṭṭhānākārehi nirayo, gabbhaseyyakattaṃ āpajjamānānaṃ mātukucchi, devesu uppajjamānānaṃ kapparukkhavimānādīhi upaṭṭhānākārehi devalokoti evaṃ uppattinimittaṃ upaṭṭhāti, iti nesaṃ iminā uppattinimittaupaṭṭhānena aparimuttatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upaṭṭhānasamaṅgitā"
      },
      " nāma. Sā calati sesā niccalā. Niraye hi upaṭṭhitepi devaloko upaṭṭhāti, devaloke upaṭṭhitepi nirayo upaṭṭhāti, manussaloke upaṭṭhitepi tiracchānayoni upaṭṭhāti, tiracchānayoniyā ca upaṭṭhitāyapi manussaloko upaṭṭhātiyeva."
    ],
    "innerText": "Kāyaduccaritasamaṅgītiādīsu samaṅgīti pañcavidhā samaṅgitā āyūhanasamaṅgitā cetanāsamaṅgitā kammasamaṅgitā vipākasamaṅgitā, upaṭṭhānasamaṅgitāti. Tattha kusalākusalakammāyūhanakkhaṇe āyūhanasamaṅgitāti vuccati. Tathā cetanāsamaṅgitā. Yāva pana arahattaṃ na pāpuṇanti, tāva sabbepi sattā pubbe upacitaṃ vipākārahaṃ kammaṃ sandhāya ‘‘kammasamaṅgino’’ti vuccanti, esā kammasamaṅgitā. Vipākasamaṅgitā vipākakkhaṇeyeva veditabbā. Yāva pana sattā arahattaṃ na pāpuṇanti, tāva nesaṃ tato tato cavitvā niraye tāva uppajjamānānaṃ aggijālalohakumbhiādīhi upaṭṭhānākārehi nirayo, gabbhaseyyakattaṃ āpajjamānānaṃ mātukucchi, devesu uppajjamānānaṃ kapparukkhavimānādīhi upaṭṭhānākārehi devalokoti evaṃ uppattinimittaṃ upaṭṭhāti, iti nesaṃ iminā uppattinimittaupaṭṭhānena aparimuttatā upaṭṭhānasamaṅgitā nāma. Sā calati sesā niccalā. Niraye hi upaṭṭhitepi devaloko upaṭṭhāti, devaloke upaṭṭhitepi nirayo upaṭṭhāti, manussaloke upaṭṭhitepi tiracchānayoni upaṭṭhāti, tiracchānayoniyā ca upaṭṭhitāyapi manussaloko upaṭṭhātiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatridaṃ ",
      " vatthu – soṇagiripāde kira acelavihāre soṇatthero nāma eko dhammakathiko, tassa pitā sunakhajīviko ahosi. Thero taṃ paṭibāhantopi saṃvare ṭhapetuṃ asakkonto ‘‘mā nassi jarako’’ti ",
      " mahallakakāle akāmakaṃ pabbājesi. Tassa gilānaseyyāya nipannassa nirayo upaṭṭhāti, soṇagiripādato mahantā mahantā sunakhā āgantvā khāditukāmā viya samparivāresuṃ. So mahābhayabhīto – ‘‘vārehi, tāta soṇa, vārehi, tāta soṇā’’ti āha. Kiṃ mahātherāti. Na passasi tātāti taṃ pavattiṃ ācikkhi. Soṇatthero – ‘‘kathañhi nāma mādisassa pitā niraye nibbattissati, patiṭṭhā’ssa bhavissāmī’’ti sāmaṇerehi nānāpupphāni āharāpetvā cetiyaṅgaṇabodhiyaṅgaṇesu talasantharaṇapūjaṃ āsanapūjañca kāretvā pitaraṃ mañcena cetiyaṅgaṇaṃ āharitvā mañce nisīdāpetvā – ‘‘ayaṃ mahāthera-pūjā tumhākaṃ atthāya katā ‘ayaṃ me bhagavā duggatapaṇṇākāro’ti vatvā bhagavantaṃ vanditvā cittaṃ pasādehī’’ti āha. So mahāthero pūjaṃ disvā tathā karonto cittaṃ pasādesi, tāvadevassa devaloko upaṭṭhāsi, nandanavana-cittalatāvana-missakavana-phārusakavanavimānāni ceva nāṭakāni ca parivāretvā ṭhitāni ",
      " viya ahesuṃ. So ‘‘apetha apetha soṇā’’ti āha. Kimidaṃ therāti? Etā te, tāta, mātaro āgacchantīti ",
      ". Thero ‘‘saggo upaṭṭhito mahātherassā’’ti cintesi. Evaṃ upaṭṭhānasamaṅgitā calatīti veditabbā. Etāsu samaṅgitāsu idha āyūhanacetanākammasamaṅgitāvasena kāyaduccaritasamaṅgītiādi vuttaṃ."
    ],
    "innerText": "Tatridaṃ vatthu – soṇagiripāde kira acelavihāre soṇatthero nāma eko dhammakathiko, tassa pitā sunakhajīviko ahosi. Thero taṃ paṭibāhantopi saṃvare ṭhapetuṃ asakkonto ‘‘mā nassi jarako’’ti mahallakakāle akāmakaṃ pabbājesi. Tassa gilānaseyyāya nipannassa nirayo upaṭṭhāti, soṇagiripādato mahantā mahantā sunakhā āgantvā khāditukāmā viya samparivāresuṃ. So mahābhayabhīto – ‘‘vārehi, tāta soṇa, vārehi, tāta soṇā’’ti āha. Kiṃ mahātherāti. Na passasi tātāti taṃ pavattiṃ ācikkhi. Soṇatthero – ‘‘kathañhi nāma mādisassa pitā niraye nibbattissati, patiṭṭhā’ssa bhavissāmī’’ti sāmaṇerehi nānāpupphāni āharāpetvā cetiyaṅgaṇabodhiyaṅgaṇesu talasantharaṇapūjaṃ āsanapūjañca kāretvā pitaraṃ mañcena cetiyaṅgaṇaṃ āharitvā mañce nisīdāpetvā – ‘‘ayaṃ mahāthera-pūjā tumhākaṃ atthāya katā ‘ayaṃ me bhagavā duggatapaṇṇākāro’ti vatvā bhagavantaṃ vanditvā cittaṃ pasādehī’’ti āha. So mahāthero pūjaṃ disvā tathā karonto cittaṃ pasādesi, tāvadevassa devaloko upaṭṭhāsi, nandanavana-cittalatāvana-missakavana-phārusakavanavimānāni ceva nāṭakāni ca parivāretvā ṭhitāni viya ahesuṃ. So ‘‘apetha apetha soṇā’’ti āha. Kimidaṃ therāti? Etā te, tāta, mātaro āgacchantīti . Thero ‘‘saggo upaṭṭhito mahātherassā’’ti cintesi. Evaṃ upaṭṭhānasamaṅgitā calatīti veditabbā. Etāsu samaṅgitāsu idha āyūhanacetanākammasamaṅgitāvasena kāyaduccaritasamaṅgītiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "132"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ vutte āyasmā ānando"
      },
      "ti ‘‘evaṃ bhagavatā imasmiṃ sutte vutte thero ādito paṭṭhāya sabbasuttaṃ samannāharitvā evaṃ sassirikaṃ katvā desitasuttassa nāma bhagavatā nāmaṃ na gahitaṃ. Handassa nāmaṃ gaṇhāpessāmī’’ti cintetvā bhagavantaṃ etadavoca."
    ],
    "innerText": "132.Evaṃ vutte āyasmā ānandoti ‘‘evaṃ bhagavatā imasmiṃ sutte vutte thero ādito paṭṭhāya sabbasuttaṃ samannāharitvā evaṃ sassirikaṃ katvā desitasuttassa nāma bhagavatā nāmaṃ na gahitaṃ. Handassa nāmaṃ gaṇhāpessāmī’’ti cintetvā bhagavantaṃ etadavoca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā tiha tva"
      },
      "ntiādīsu ayaṃ atthayojanā –"
    ],
    "innerText": "Tasmā tiha tvantiādīsu ayaṃ atthayojanā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ānanda, yasmā imasmiṃ dhammapariyāye ‘‘aṭṭhārasa kho imā, ānanda, dhātuyo, cha imā, ānanda, dhātuyo’’ti evaṃ bahudhātuyo vibhattā, tasmā tiha tvaṃ imaṃ dhammapariyāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahudhātuko"
      },
      "tipi naṃ dhārehi. Yasmā panettha dhātuāyatanapaṭiccasamuppādaṭṭhānāṭṭhānavasena cattāro parivaṭṭā kathitā ",
      ", tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catuparivaṭṭo"
      },
      "tipi naṃ dhārehi. Yasmā ca ādāsaṃ olokentassa mukhanimittaṃ viya imaṃ dhammapariyāyaṃ olokentassa ete dhātuādayo atthā pākaṭā honti, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammādāso"
      },
      "tipi naṃ dhārehi. Yasmā ca yathā nāma parasenamaddanā yodhā saṅgāmatūriyaṃ paggahetvā parasenaṃ pavisitvā sapatte madditvā attano jayaṃ gaṇhanti, evameva kilesasenamaddanā yogino idha vuttavasena vipassanaṃ paggahetvā kilese madditvā attano arahattajayaṃ gaṇhanti, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "amatadundubhī"
      },
      "tipi naṃ dhārehi. Yasmā ca yathā saṅgāmayodhā ",
      " pañcāvudhaṃ gahetvā parasenaṃ viddhaṃsetvā jayaṃ gaṇhanti, evaṃ yoginopi idha vuttaṃ vipassanāvudhaṃ gahetvā kilesasenaṃ viddhaṃsetvā arahattajayaṃ gaṇhanti. Tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anuttaro saṅgāmavijayo"
      },
      "tipi naṃ dhārehīti."
    ],
    "innerText": "Ānanda, yasmā imasmiṃ dhammapariyāye ‘‘aṭṭhārasa kho imā, ānanda, dhātuyo, cha imā, ānanda, dhātuyo’’ti evaṃ bahudhātuyo vibhattā, tasmā tiha tvaṃ imaṃ dhammapariyāyaṃ bahudhātukotipi naṃ dhārehi. Yasmā panettha dhātuāyatanapaṭiccasamuppādaṭṭhānāṭṭhānavasena cattāro parivaṭṭā kathitā , tasmā catuparivaṭṭotipi naṃ dhārehi. Yasmā ca ādāsaṃ olokentassa mukhanimittaṃ viya imaṃ dhammapariyāyaṃ olokentassa ete dhātuādayo atthā pākaṭā honti, tasmā dhammādāsotipi naṃ dhārehi. Yasmā ca yathā nāma parasenamaddanā yodhā saṅgāmatūriyaṃ paggahetvā parasenaṃ pavisitvā sapatte madditvā attano jayaṃ gaṇhanti, evameva kilesasenamaddanā yogino idha vuttavasena vipassanaṃ paggahetvā kilese madditvā attano arahattajayaṃ gaṇhanti, tasmā amatadundubhītipi naṃ dhārehi. Yasmā ca yathā saṅgāmayodhā pañcāvudhaṃ gahetvā parasenaṃ viddhaṃsetvā jayaṃ gaṇhanti, evaṃ yoginopi idha vuttaṃ vipassanāvudhaṃ gahetvā kilesasenaṃ viddhaṃsetvā arahattajayaṃ gaṇhanti. Tasmā anuttaro saṅgāmavijayotipi naṃ dhārehīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bahudhātukasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Isigilisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "133"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti isigilisuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññāva samaññā ahosī"
      },
      "ti isigilissa isigilīti samaññāya uppannakāle vebhāro na vebhāroti paññāyittha, aññāyevassa samaññā ahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññā paññattī"
      },
      "ti idaṃ purimapadasseva vevacanaṃ. Sesesupi eseva nayo."
    ],
    "innerText": "133.Evaṃme sutanti isigilisuttaṃ. Tattha aññāva samaññā ahosīti isigilissa isigilīti samaññāya uppannakāle vebhāro na vebhāroti paññāyittha, aññāyevassa samaññā ahosi. Aññā paññattīti idaṃ purimapadasseva vevacanaṃ. Sesesupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tadā kira bhagavā sāyanhasamaye samāpattito vuṭṭhāya gandhakuṭito nikkhamitvā yasmiṃ ṭhāne nisinnānaṃ pañca pabbatā paññāyanti, tattha bhikkhusaṅghaparivuto nisīditvā ime pañca pabbate paṭipāṭiyā ācikkhi. Tattha na bhagavato pabbatehi attho atthi, iti imesu pana pabbatesu paṭipāṭiyā kathiyamānesu isigilissa isigilibhāvo kathetabbo hoti. Tasmiṃ kathiyamāne padumavatiyā puttānaṃ pañcasatānaṃ paccekabuddhānaṃ nāmāni ceva padumavatiyā ca patthanā kathetabbā bhavissatīti bhagavā imaṃ pañca pabbatapaṭipāṭiṃ ācikkhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavisantā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dissanti paviṭṭhā na dissantī"
      },
      "ti yathāphāsukaṭṭhāne piṇḍāya caritvā katabhattakiccā āgantvā cetiyagabbhe yamakamahādvāraṃ vivarantā viya taṃ pabbataṃ dvedhā katvā anto pavisitvā ",
      " rattiṭṭhānadivāṭṭhānāni māpetvā tattha vasiṃsu, tasmā evamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ime isī"
      },
      "ti ime paccekabuddhaisī."
    ],
    "innerText": "Pavisantādissanti paviṭṭhā na dissantīti yathāphāsukaṭṭhāne piṇḍāya caritvā katabhattakiccā āgantvā cetiyagabbhe yamakamahādvāraṃ vivarantā viya taṃ pabbataṃ dvedhā katvā anto pavisitvā rattiṭṭhānadivāṭṭhānāni māpetvā tattha vasiṃsu, tasmā evamāha. Ime isīti ime paccekabuddhaisī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kadā pana te tattha vasiṃsu? Atīte kira anuppanne tathāgate bārāṇasiṃ upanissāya ekasmiṃ gāmake ekā kuladhītā khettaṃ rakkhamānā ekassa paccekabuddhassa pañcahi lājāsatehi saddhiṃ ekaṃ padumapupphaṃ datvā pañca puttasatāni patthesi. Tasmiṃyeva ca khaṇe pañcasatā migaluddakā madhuramaṃsaṃ datvā ‘‘etissā puttā bhaveyyāmā’’ti patthayiṃsu. Sā yāvatāyukaṃ ṭhatvā devaloke nibbattā, tato cutā jātassare padumagabbhe nibbatti. Tameko tāpaso disvā paṭijaggi, tassā vicarantiyāva pāduddhāre pāduddhāre bhūmito padumāni uṭṭhahanti. Eko vanacarako disvā bārāṇasirañño ārocesi. Rājā naṃ āharāpetvā aggamahesiṃ ",
      " akāsi, tassā gabbho saṇṭhāsi. Mahāpadumakumāro mātukucchiyaṃ vasi, sesā gabbhamalaṃ nissā nibbattā. Vayappattā uyyāne padumassare kīḷantā ekekasmiṃ padume nisīditvā khayavayaṃ paṭṭhapetvā paccekabodhiñāṇaṃ nibbattayiṃsu. Ayaṃ tesaṃ byākaraṇagāthā ahosi –"
    ],
    "innerText": "Kadā pana te tattha vasiṃsu? Atīte kira anuppanne tathāgate bārāṇasiṃ upanissāya ekasmiṃ gāmake ekā kuladhītā khettaṃ rakkhamānā ekassa paccekabuddhassa pañcahi lājāsatehi saddhiṃ ekaṃ padumapupphaṃ datvā pañca puttasatāni patthesi. Tasmiṃyeva ca khaṇe pañcasatā migaluddakā madhuramaṃsaṃ datvā ‘‘etissā puttā bhaveyyāmā’’ti patthayiṃsu. Sā yāvatāyukaṃ ṭhatvā devaloke nibbattā, tato cutā jātassare padumagabbhe nibbatti. Tameko tāpaso disvā paṭijaggi, tassā vicarantiyāva pāduddhāre pāduddhāre bhūmito padumāni uṭṭhahanti. Eko vanacarako disvā bārāṇasirañño ārocesi. Rājā naṃ āharāpetvā aggamahesiṃ akāsi, tassā gabbho saṇṭhāsi. Mahāpadumakumāro mātukucchiyaṃ vasi, sesā gabbhamalaṃ nissā nibbattā. Vayappattā uyyāne padumassare kīḷantā ekekasmiṃ padume nisīditvā khayavayaṃ paṭṭhapetvā paccekabodhiñāṇaṃ nibbattayiṃsu. Ayaṃ tesaṃ byākaraṇagāthā ahosi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Saroruhaṃ padumapalāsapattajaṃ, supupphitaṃ bhamaragaṇānuciṇṇaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aniccatāyupagataṃ viditvā, eko care khaggavisāṇakappo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmiṃ ",
      " kāle te tattha vasiṃsu, tadā cassa pabbatassa isigilīti samaññā udapādi."
    ],
    "innerText": "Tasmiṃ kāle te tattha vasiṃsu, tadā cassa pabbatassa isigilīti samaññā udapādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "135"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye sattasārā"
      },
      "ti ariṭṭho upariṭṭho tagarasikhī yasassī sudassano piyadassī gandhāro piṇḍolo upāsabho nīto tatho sutavā bhāvitattoti terasannaṃ paccekabuddhānaṃ nāmāni vatvā idāni tesañca aññesañca gāthābandhena nāmāni ācikkhanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ye sattasārā"
      },
      "tiādimāha ",
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sattasārā"
      },
      "ti sattānaṃ sārabhūtā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anīghā"
      },
      "ti niddukkhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nirāsā"
      },
      "ti nittaṇhā."
    ],
    "innerText": "135.Ye sattasārāti ariṭṭho upariṭṭho tagarasikhī yasassī sudassano piyadassī gandhāro piṇḍolo upāsabho nīto tatho sutavā bhāvitattoti terasannaṃ paccekabuddhānaṃ nāmāni vatvā idāni tesañca aññesañca gāthābandhena nāmāni ācikkhanto ye sattasārātiādimāha . Tattha sattasārāti sattānaṃ sārabhūtā. Anīghāti niddukkhā. Nirāsāti nittaṇhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve jālino"
      },
      "ti cūḷajāli mahājālīti dve jālināmakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santacitto"
      },
      "ti idampi ekassa nāmameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passi jahi upadhidukkhamūla"
      },
      "nti ettha passi nāma so paccekabuddho, dukkhassa pana mūlaṃ upadhiṃ jahīti ayamassa thuti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aparājito"
      },
      "tipi ekassa nāmameva."
    ],
    "innerText": "Dve jālinoti cūḷajāli mahājālīti dve jālināmakā. Santacittoti idampi ekassa nāmameva. Passi jahi upadhidukkhamūlanti ettha passi nāma so paccekabuddho, dukkhassa pana mūlaṃ upadhiṃ jahīti ayamassa thuti. Aparājitotipi ekassa nāmameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satthā pavattā sarabhaṅgo lomahaṃso uccaṅgamāyo"
      },
      "ti ime pañca janā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asito anāsavo manomayo"
      },
      "ti imepi tayo janā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mānacchido ca bandhumā"
      },
      "ti bandhumā nāma eko, mānassa pana chinnattā mānacchidoti vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadādhimutto"
      },
      "tipi nāmameva."
    ],
    "innerText": "Satthā pavattā sarabhaṅgo lomahaṃso uccaṅgamāyoti ime pañca janā. Asito anāsavo manomayoti imepi tayo janā. Mānacchido ca bandhumāti bandhumā nāma eko, mānassa pana chinnattā mānacchidoti vutto. Tadādhimuttotipi nāmameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ketumbharāgo ca mātaṅgo ariyo"
      },
      "ti ime tayo janā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Athaccuto"
      },
      "ti atha accuto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Accutagāmabyāmaṅko"
      },
      "ti ime dve janā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khemābhirato ca sorato"
      },
      "ti ime dveyeva."
    ],
    "innerText": "Ketumbharāgo ca mātaṅgo ariyoti ime tayo janā. Athaccutoti atha accuto. Accutagāmabyāmaṅkoti ime dve janā. Khemābhirato ca soratoti ime dveyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sayho anomanikkamo"
      },
      "ti sayho nāma so buddho, anomavīriyattā pana anomanikkamoti ",
      " vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ānando nando upanando dvādasā"
      },
      "ti cattāro ānandā, cattāro nandā cattāro upanandāti evaṃ dvādasa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāradvājo"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "antimadehadhārī"
      },
      "ti bhāradvājo nāma so buddho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antimadehadhārī"
      },
      "ti thuti."
    ],
    "innerText": "Sayho anomanikkamoti sayho nāma so buddho, anomavīriyattā pana anomanikkamoti vutto. Ānando nando upanando dvādasāti cattāro ānandā, cattāro nandā cattāro upanandāti evaṃ dvādasa. Bhāradvājoantimadehadhārīti bhāradvājo nāma so buddho. Antimadehadhārīti thuti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhacchido"
      },
      "ti sikharissāyaṃ thuti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vītarāgo"
      },
      "ti maṅgalassa thuti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Usabhacchidā jāliniṃ dukkhamūla"
      },
      "nti usabho nāma so buddho dukkhamūlabhūtaṃ jāliniṃ acchidāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santaṃ padaṃ ajjhagamopanīto"
      },
      "ti upanīto nāma so buddho santaṃ padaṃ ajjhagamā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vītarāgo"
      },
      "tipi ekassa nāmameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvimuttacitto"
      },
      "ti ayaṃ kaṇhassa thuti."
    ],
    "innerText": "Taṇhacchidoti sikharissāyaṃ thuti. Vītarāgoti maṅgalassa thuti. Usabhacchidā jāliniṃ dukkhamūlanti usabho nāma so buddho dukkhamūlabhūtaṃ jāliniṃ acchidāti attho. Santaṃ padaṃ ajjhagamopanītoti upanīto nāma so buddho santaṃ padaṃ ajjhagamā. Vītarāgotipi ekassa nāmameva. Suvimuttacittoti ayaṃ kaṇhassa thuti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ete ca aññe cā"
      },
      "ti ete pāḷiyaṃ āgatā ca pāḷiyaṃ anāgatā aññe ca etesaṃ ekanāmakāyeva. Imesu hi pañcasu paccekabuddhasatesu dvepi tayopi dasapi dvādasapi ānandādayo viya ekanāmakā ahesuṃ. Iti pāḷiyaṃ āgatanāmeheva sabbesaṃ nāmāni vuttāni ",
      " hontīti ito paraṃ visuṃ visuṃ avatvā ‘‘ete ca aññe cā’’ti āha. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "Ete ca aññe cāti ete pāḷiyaṃ āgatā ca pāḷiyaṃ anāgatā aññe ca etesaṃ ekanāmakāyeva. Imesu hi pañcasu paccekabuddhasatesu dvepi tayopi dasapi dvādasapi ānandādayo viya ekanāmakā ahesuṃ. Iti pāḷiyaṃ āgatanāmeheva sabbesaṃ nāmāni vuttāni hontīti ito paraṃ visuṃ visuṃ avatvā ‘‘ete ca aññe cā’’ti āha. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Isigilisuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Mahācattārīsakasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "136"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti mahācattārīsakasuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariya"
      },
      "nti niddosaṃ lokuttaraṃ, niddosañhi ‘‘ariya’’nti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammāsamādhi"
      },
      "nti maggasamādhiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saupanisa"
      },
      "nti sapaccayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saparikkhāra"
      },
      "nti saparivāraṃ."
    ],
    "innerText": "136.Evaṃme sutanti mahācattārīsakasuttaṃ. Tattha ariyanti niddosaṃ lokuttaraṃ, niddosañhi ‘‘ariya’’nti vuccati. Sammāsamādhinti maggasamādhiṃ. Saupanisanti sapaccayaṃ. Saparikkhāranti saparivāraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parikkhatā"
      },
      "ti parivāritā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammādiṭṭhi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pubbaṅgamā hotī"
      },
      "ti dvidhā sammādiṭṭhi pubbaṅgamā hoti purecārikā vipassanāsammādiṭṭhi ca maggasammādiṭṭhi ca. Vipassanāsammādiṭṭhi tebhūmakasaṅkhāre aniccādivasena parivīmaṃsati; maggasammādiṭṭhi pana parivīmaṃsanapariyosāne bhūmiladdhaṃ vaṭṭaṃ samugghāṭayamānā vūpasamayamānā sītudakaghaṭasahassaṃ matthake āsiñcamānā viya uppajjati. Yathā hi khettaṃ kurumāno kassako paṭhamaṃ araññe rukkhe chindati, pacchā aggiṃ deti, so aggi paṭhamaṃ chinne rukkhe anavasese jhāpeti, evameva vipassanāsammādiṭṭhi paṭhamaṃ aniccādivasena saṅkhāre vīmaṃsati, maggasammādiṭṭhi tāya vīmaṃsanatthaṃ saṅkhāre puna appavattivasena samugghāṭayamānā uppajjati, sā duvidhāpi idha adhippetā."
    ],
    "innerText": "Parikkhatāti parivāritā. Sammādiṭṭhipubbaṅgamā hotīti dvidhā sammādiṭṭhi pubbaṅgamā hoti purecārikā vipassanāsammādiṭṭhi ca maggasammādiṭṭhi ca. Vipassanāsammādiṭṭhi tebhūmakasaṅkhāre aniccādivasena parivīmaṃsati; maggasammādiṭṭhi pana parivīmaṃsanapariyosāne bhūmiladdhaṃ vaṭṭaṃ samugghāṭayamānā vūpasamayamānā sītudakaghaṭasahassaṃ matthake āsiñcamānā viya uppajjati. Yathā hi khettaṃ kurumāno kassako paṭhamaṃ araññe rukkhe chindati, pacchā aggiṃ deti, so aggi paṭhamaṃ chinne rukkhe anavasese jhāpeti, evameva vipassanāsammādiṭṭhi paṭhamaṃ aniccādivasena saṅkhāre vīmaṃsati, maggasammādiṭṭhi tāya vīmaṃsanatthaṃ saṅkhāre puna appavattivasena samugghāṭayamānā uppajjati, sā duvidhāpi idha adhippetā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Micchādiṭṭhīti pajānātī"
      },
      "ti micchādiṭṭhiṃ aniccaṃ dukkhaṃ anattāti lakkhaṇapaṭivedhena ārammaṇato pajānāti, sammādiṭṭhiṃ kiccato asammohato pajānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāssa hoti sammādiṭṭhī"
      },
      "ti sā evaṃ pajānanā assa sammādiṭṭhi nāma hoti."
    ],
    "innerText": "Micchādiṭṭhīti pajānātīti micchādiṭṭhiṃ aniccaṃ dukkhaṃ anattāti lakkhaṇapaṭivedhena ārammaṇato pajānāti, sammādiṭṭhiṃ kiccato asammohato pajānāti. Sāssa hoti sammādiṭṭhīti sā evaṃ pajānanā assa sammādiṭṭhi nāma hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvāyaṃ vadāmī"
      },
      "ti dvayaṃ vadāmi, duvidhakoṭṭhāsaṃ vadāmīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puññabhāgiyā"
      },
      "ti puññakoṭṭhāsabhūtā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upadhivepakkā"
      },
      "ti upadhisaṅkhātassa vipākassa dāyikā."
    ],
    "innerText": "Dvāyaṃ vadāmīti dvayaṃ vadāmi, duvidhakoṭṭhāsaṃ vadāmīti attho. Puññabhāgiyāti puññakoṭṭhāsabhūtā. Upadhivepakkāti upadhisaṅkhātassa vipākassa dāyikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññā paññindriya"
      },
      "ntiādīsu vibhajitvā vibhajitvā amatadvāraṃ paññapeti dassetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññā"
      },
      ". Tasmiṃ atthe indattaṃ karotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññindriyaṃ"
      },
      ". Avijjāya na ",
      " kampatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññābalaṃ"
      },
      ". Bojjhaṅgappattā ",
      " hutvā catusaccadhamme vicinātīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammavicayasambojjhaṅgo"
      },
      ". Maggasampattiyā pasaṭṭhā sobhanā ",
      " diṭṭhīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammādiṭṭhi"
      },
      ". Ariyamaggassa aṅganti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "maggaṅgaṃ. So"
      },
      "ti so bhikkhu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pahānāyā"
      },
      "ti pajahanatthāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasampadāyā"
      },
      "ti paṭilābhatthāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammāvāyāmo"
      },
      "ti niyyāniko kusalavāyāmo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sato"
      },
      "ti satiyā samannāgato hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuparidhāvanti anuparivattantī"
      },
      "ti sahajātā ca purejātā ca hutvā parivārenti. Ettha hi sammāvāyāmo ca sammāsati ca lokuttarasammādiṭṭhiṃ sahajātā parivārenti rājānaṃ viya ekarathe ṭhitā asiggāhachattaggāhā. Vipassanāsammādiṭṭhi pana purejātā hutvā parivāreti rathassa purato pattikādayo viya. Dutiyapabbato paṭṭhāya pana sammāsaṅkappādīnaṃ tayopi sahajātaparivārāva hontīti veditabbā."
    ],
    "innerText": "Paññā paññindriyantiādīsu vibhajitvā vibhajitvā amatadvāraṃ paññapeti dassetīti paññā. Tasmiṃ atthe indattaṃ karotīti paññindriyaṃ. Avijjāya na kampatīti paññābalaṃ. Bojjhaṅgappattā hutvā catusaccadhamme vicinātīti dhammavicayasambojjhaṅgo. Maggasampattiyā pasaṭṭhā sobhanā diṭṭhīti sammādiṭṭhi. Ariyamaggassa aṅganti maggaṅgaṃ. Soti so bhikkhu. Pahānāyāti pajahanatthāya. Upasampadāyāti paṭilābhatthāya. Sammāvāyāmoti niyyāniko kusalavāyāmo. Satoti satiyā samannāgato hutvā. Anuparidhāvanti anuparivattantīti sahajātā ca purejātā ca hutvā parivārenti. Ettha hi sammāvāyāmo ca sammāsati ca lokuttarasammādiṭṭhiṃ sahajātā parivārenti rājānaṃ viya ekarathe ṭhitā asiggāhachattaggāhā. Vipassanāsammādiṭṭhi pana purejātā hutvā parivāreti rathassa purato pattikādayo viya. Dutiyapabbato paṭṭhāya pana sammāsaṅkappādīnaṃ tayopi sahajātaparivārāva hontīti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "137"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Micchāsaṅkappoti pajānātī"
      },
      "ti micchāsaṅkappaṃ aniccaṃ dukkhaṃ anattāti lakkhaṇapaṭivedhena ārammaṇato pajānāti sammāsaṅkappaṃ kiccato asammohato pajānāti. Ito aparesu sammāvācādīsupi evameva yojanā veditabbā. Kāmasaṅkappādayo dvedhāvitakkasutte (ma. ni. 1.206) vuttāyeva."
    ],
    "innerText": "137.Micchāsaṅkappoti pajānātīti micchāsaṅkappaṃ aniccaṃ dukkhaṃ anattāti lakkhaṇapaṭivedhena ārammaṇato pajānāti sammāsaṅkappaṃ kiccato asammohato pajānāti. Ito aparesu sammāvācādīsupi evameva yojanā veditabbā. Kāmasaṅkappādayo dvedhāvitakkasutte (ma. ni. 1.206) vuttāyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Takko"
      },
      "tiādīsu takkanavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "takko"
      },
      ". Sveva ca upasaggena padaṃ vaḍḍhetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vitakko"
      },
      "ti vutto, sveva saṅkappanavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅkappo"
      },
      ". Ekaggo hutvā ārammaṇe appetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appanā"
      },
      ". Upasaggena pana padaṃ vaḍḍhetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "byappanā"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cetaso abhiniropanā"
      },
      "ti cittassa abhiniropanā. Vitakkasmiñhi sati vitakko ārammaṇe cittaṃ abhiniropeti vitakke pana asati attanoyeva dhammatāya cittaṃ ārammaṇaṃ abhiruhati jātisampanno abhiññātapuriso viya rājagehaṃ. Anabhiññātassa hi paṭihārena vā dovārikena vā attho hoti, abhiññātaṃ jātisampannaṃ sabbe rājarājamahāmattā jānantīti attanova dhammatāya nikkhamati ceva pavisati ca, evaṃsampadamidaṃ veditabbaṃ. Vācaṃ saṅkharotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vacīsaṅkhāro"
      },
      ". Ettha ca lokiyavitakko vācaṃ saṅkharoti, na lokuttaro. Kiñcāpi na saṅkharoti, vacīsaṅkhārotveva ca panassa nāmaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammāsaṅkappaṃ anuparidhāvantī"
      },
      "ti lokuttarasammāsaṅkappaṃ parivārenti. Ettha ca tayopi nekkhammasaṅkappādayo ",
      " pubbabhāge nānācittesu labbhanti, maggakkhaṇe pana tiṇṇampi kāmasaṅkappādīnañca padacchedaṃ samugghātaṃ karonto maggaṅgaṃ pūrayamāno ekova sammāsaṅkappo uppajjitvā nekkhammasaṅkappādivasena tīṇi nāmāni labhati. Parato sammāvācādīsupi eseva nayo."
    ],
    "innerText": "Takkotiādīsu takkanavasena takko. Sveva ca upasaggena padaṃ vaḍḍhetvā vitakkoti vutto, sveva saṅkappanavasena saṅkappo. Ekaggo hutvā ārammaṇe appetīti appanā. Upasaggena pana padaṃ vaḍḍhetvā byappanāti vuttaṃ. Cetaso abhiniropanāti cittassa abhiniropanā. Vitakkasmiñhi sati vitakko ārammaṇe cittaṃ abhiniropeti vitakke pana asati attanoyeva dhammatāya cittaṃ ārammaṇaṃ abhiruhati jātisampanno abhiññātapuriso viya rājagehaṃ. Anabhiññātassa hi paṭihārena vā dovārikena vā attho hoti, abhiññātaṃ jātisampannaṃ sabbe rājarājamahāmattā jānantīti attanova dhammatāya nikkhamati ceva pavisati ca, evaṃsampadamidaṃ veditabbaṃ. Vācaṃ saṅkharotīti vacīsaṅkhāro. Ettha ca lokiyavitakko vācaṃ saṅkharoti, na lokuttaro. Kiñcāpi na saṅkharoti, vacīsaṅkhārotveva ca panassa nāmaṃ hoti. Sammāsaṅkappaṃ anuparidhāvantīti lokuttarasammāsaṅkappaṃ parivārenti. Ettha ca tayopi nekkhammasaṅkappādayo pubbabhāge nānācittesu labbhanti, maggakkhaṇe pana tiṇṇampi kāmasaṅkappādīnañca padacchedaṃ samugghātaṃ karonto maggaṅgaṃ pūrayamāno ekova sammāsaṅkappo uppajjitvā nekkhammasaṅkappādivasena tīṇi nāmāni labhati. Parato sammāvācādīsupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "138"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Musāvādā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "veramaṇī"
      },
      "tiādīsu viratipi cetanāpi vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āratī"
      },
      "tiādīsu vacīduccaritehi ārakā ramatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārati"
      },
      ". Vinā tehi ramatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "virati"
      },
      ". Tato tato paṭinivattāva hutvā tehi vinā ramatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭivirati"
      },
      ". Upasaggavasena vā padaṃ vaḍḍhitaṃ, sabbamidaṃ oramanabhāvasseva adhivacanaṃ. Veraṃ maṇati vināsetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "veramaṇi"
      },
      ". Idampi oramanasseva vevacanaṃ."
    ],
    "innerText": "138.Musāvādāveramaṇītiādīsu viratipi cetanāpi vaṭṭati. Āratītiādīsu vacīduccaritehi ārakā ramatīti ārati. Vinā tehi ramatīti virati. Tato tato paṭinivattāva hutvā tehi vinā ramatīti paṭivirati. Upasaggavasena vā padaṃ vaḍḍhitaṃ, sabbamidaṃ oramanabhāvasseva adhivacanaṃ. Veraṃ maṇati vināsetīti veramaṇi. Idampi oramanasseva vevacanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "139"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṇātipātā veramaṇī"
      },
      "tiādīsupi cetanā viratīti ubhayampi vaṭṭatiyeva."
    ],
    "innerText": "139.Pāṇātipātā veramaṇītiādīsupi cetanā viratīti ubhayampi vaṭṭatiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "140"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kuhanā"
      },
      "tiādīsu ",
      " tividhena kuhanavatthunā lokaṃ etāya kuhayanti vimhāpayantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kuhanā"
      },
      ". Lābhasakkāratthikā hutvā etāya lapantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lapanā"
      },
      ". Nimittaṃ sīlametesanti nemittikā, tesaṃ bhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nemittikatā"
      },
      ". Nippeso sīlametesanti nippesikā, tesaṃ bhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nippesikatā"
      },
      ". Lābhena lābhaṃ nijigīsanti magganti pariyesantīti lābhena lābhaṃ nijigīsanā, tesaṃ bhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lābhena lābhaṃ nijigīsanatā"
      },
      ". Ayamettha saṅkhepo, vitthārena panetā kuhanādikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visuddhimagge"
      },
      " sīlaniddeseyeva pāḷiñca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathañca"
      },
      " āharitvā pakāsitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Micchāājīvassa pahānāyā"
      },
      "ti ettha na kevalaṃ pāḷiyaṃ āgatova micchāājīvo, ājīvahetu pana pavattitā pāṇātipātādayo sattakammapathacetanāpi micchāājīvova. Tāsaṃyeva sattannaṃ cetanānaṃ padapacchedaṃ samugghātaṃ kurumānaṃ maggaṅgaṃ pūrayamānā uppannā virati sammāājīvo nāma."
    ],
    "innerText": "140.Kuhanātiādīsu tividhena kuhanavatthunā lokaṃ etāya kuhayanti vimhāpayantīti kuhanā. Lābhasakkāratthikā hutvā etāya lapantīti lapanā. Nimittaṃ sīlametesanti nemittikā, tesaṃ bhāvo nemittikatā. Nippeso sīlametesanti nippesikā, tesaṃ bhāvo nippesikatā. Lābhena lābhaṃ nijigīsanti magganti pariyesantīti lābhena lābhaṃ nijigīsanā, tesaṃ bhāvo lābhena lābhaṃ nijigīsanatā. Ayamettha saṅkhepo, vitthārena panetā kuhanādikā visuddhimagge sīlaniddeseyeva pāḷiñca aṭṭhakathañca āharitvā pakāsitā. Micchāājīvassa pahānāyāti ettha na kevalaṃ pāḷiyaṃ āgatova micchāājīvo, ājīvahetu pana pavattitā pāṇātipātādayo sattakammapathacetanāpi micchāājīvova. Tāsaṃyeva sattannaṃ cetanānaṃ padapacchedaṃ samugghātaṃ kurumānaṃ maggaṅgaṃ pūrayamānā uppannā virati sammāājīvo nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "141"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammādiṭṭhissā"
      },
      "ti maggasammādiṭṭhiyaṃ ṭhitassa puggalassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammāsaṅkappo pahotī"
      },
      "ti maggasammāsaṅkappo pahoti, phalasammādiṭṭhissapi phalasammāsaṅkappo pahotīti evaṃ sabbapadesu attho veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammāñāṇassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammāvimuttī"
      },
      "ti ettha pana maggasammāsamādhimhi ṭhitassa maggapaccavekkhaṇaṃ sammāñāṇaṃ pahoti, phalasammāsamādhimhi ṭhitassa phalapaccavekkhaṇaṃ sammāñāṇaṃ pahoti. Maggapaccavekkhaṇasammāñāṇe ca ṭhitassa maggasammāvimutti pahoti, phalapaccavekkhaṇasammāñāṇe ",
      " ṭhitassa phalasammāvimutti pahotīti attho. Ettha ca ṭhapetvā aṭṭha phalaṅgāni sammāñāṇaṃ paccavekkhaṇaṃ katvā sammāvimuttiṃ phalaṃ kātuṃ vaṭṭatīti vuttaṃ."
    ],
    "innerText": "141.Sammādiṭṭhissāti maggasammādiṭṭhiyaṃ ṭhitassa puggalassa. Sammāsaṅkappo pahotīti maggasammāsaṅkappo pahoti, phalasammādiṭṭhissapi phalasammāsaṅkappo pahotīti evaṃ sabbapadesu attho veditabbo. Sammāñāṇassasammāvimuttīti ettha pana maggasammāsamādhimhi ṭhitassa maggapaccavekkhaṇaṃ sammāñāṇaṃ pahoti, phalasammāsamādhimhi ṭhitassa phalapaccavekkhaṇaṃ sammāñāṇaṃ pahoti. Maggapaccavekkhaṇasammāñāṇe ca ṭhitassa maggasammāvimutti pahoti, phalapaccavekkhaṇasammāñāṇe ṭhitassa phalasammāvimutti pahotīti attho. Ettha ca ṭhapetvā aṭṭha phalaṅgāni sammāñāṇaṃ paccavekkhaṇaṃ katvā sammāvimuttiṃ phalaṃ kātuṃ vaṭṭatīti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "142"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammādiṭṭhissa"
      },
      ", ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhikkhave, micchādiṭṭhi nijjiṇṇā hotī"
      },
      "tiādīsu avasesanikāyabhāṇakā phalaṃ kathitanti vadanti, majjhimabhāṇakā pana dasannaṃ nijjaravatthūnaṃ āgataṭṭhāne maggo kathitoti vadanti. Tattha dassanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammādiṭṭhi"
      },
      " veditabbā, viditakaraṇaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammāñāṇaṃ,"
      },
      " tadadhimuttaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammāvimutti."
      }
    ],
    "innerText": "142.Sammādiṭṭhissa, bhikkhave, micchādiṭṭhi nijjiṇṇā hotītiādīsu avasesanikāyabhāṇakā phalaṃ kathitanti vadanti, majjhimabhāṇakā pana dasannaṃ nijjaravatthūnaṃ āgataṭṭhāne maggo kathitoti vadanti. Tattha dassanaṭṭhena sammādiṭṭhi veditabbā, viditakaraṇaṭṭhena sammāñāṇaṃ, tadadhimuttaṭṭhena sammāvimutti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vīsati kusalapakkhā"
      },
      "ti sammādiṭṭhiādayo dasa, ‘‘sammādiṭṭhipaccayā ca aneke kusalā dhammā’’tiādinā nayena vuttā dasāti evaṃ vīsati kusalapakkhā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vīsati akusalapakkhā"
      },
      "ti ‘‘micchādiṭṭhi nijjiṇṇā hotī’’tiādinā nayena vuttā micchādiṭṭhiādayo dasa, ‘‘ye ca micchādiṭṭhipaccayā aneke pāpakā’’tiādinā vuttā dasa cāti evaṃ vīsati akusalapakkhā veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahācattārīsako"
      },
      "ti mahāvipākadānena mahantānaṃ kusalapakkhikānañceva akusalapakkhikānañca cattārīsāya dhammānaṃ pakāsitattā mahācattārīsakoti."
    ],
    "innerText": "Vīsati kusalapakkhāti sammādiṭṭhiādayo dasa, ‘‘sammādiṭṭhipaccayā ca aneke kusalā dhammā’’tiādinā nayena vuttā dasāti evaṃ vīsati kusalapakkhā honti. Vīsati akusalapakkhāti ‘‘micchādiṭṭhi nijjiṇṇā hotī’’tiādinā nayena vuttā micchādiṭṭhiādayo dasa, ‘‘ye ca micchādiṭṭhipaccayā aneke pāpakā’’tiādinā vuttā dasa cāti evaṃ vīsati akusalapakkhā veditabbā. Mahācattārīsakoti mahāvipākadānena mahantānaṃ kusalapakkhikānañceva akusalapakkhikānañca cattārīsāya dhammānaṃ pakāsitattā mahācattārīsakoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Imasmiñca pana sutte pañca sammādiṭṭhiyo kathitā vipassanāsammādiṭṭhi kammassakatāsammādiṭṭhi maggasammādiṭṭhi phalasammādiṭṭhi paccavekkhaṇāsammādiṭṭhīti. Tattha ‘‘micchādiṭṭhiṃ micchādiṭṭhīti pajānātī’’tiādinā nayena vuttā vipassanāsammādiṭṭhi nāma. ‘‘Atthi dinna’’ntiādinā nayena vuttā kammassakatāsammādiṭṭhi nāma. ‘‘Sammādiṭṭhissa, bhikkhave, sammāsaṅkappo pahotī’’ti ettha pana maggasammādiṭṭhi phalasammādiṭṭhīti dvepi kathitā. ‘‘Sammāñāṇaṃ pahotī’’ti. Ettha pana paccavekkhaṇāsammādiṭṭhi kathitāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "143"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammādiṭṭhiṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ce bhavaṃ garahatī"
      },
      "ti micchādiṭṭhi nāmāyaṃ sobhanāti vadantopi sammādiṭṭhi nāmāyaṃ na sobhanāti vadantopi sammādiṭṭhiṃ garahati nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Okkalā"
      },
      "ti okkalajanapadavāsino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vassabhaññā"
      },
      "ti vasso ca bhañño cāti dve janā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahetuvādā"
      },
      "ti natthi hetu natthi paccayo sattānaṃ visuddhiyāti evamādivādino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akiriyavādā"
      },
      "ti karoto na karīyati pāpanti evaṃ kiriyapaṭikkhepavādino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Natthikavādā"
      },
      "ti natthi dinnantiādivādino. Te imesu tīsupi dassanesu okkantaniyāmā ahesuṃ. Kathaṃ panetesu niyāmo hotīti. Yo hi evarūpaṃ laddhiṃ gahetvā rattiṭṭhānadivāṭṭhāne nisinno sajjhāyati vīmaṃsati, tassa ‘‘natthi hetu ",
      " natthi paccayo karoto na karīyati pāpaṃ, natthi dinnaṃ, kāyassa bhedā ucchijjatī’’ti tasmiṃ ārammaṇe micchāsati santiṭṭhati, cittaṃ ekaggaṃ hoti, javanāni javanti. Paṭhamajavane satekiccho hoti, tathā dutiyādīsu. Sattame buddhānampi atekiccho anivattī ariṭṭhakaṇḍakasadiso hoti."
    ],
    "innerText": "143.Sammādiṭṭhiṃce bhavaṃ garahatīti micchādiṭṭhi nāmāyaṃ sobhanāti vadantopi sammādiṭṭhi nāmāyaṃ na sobhanāti vadantopi sammādiṭṭhiṃ garahati nāma. Okkalāti okkalajanapadavāsino. Vassabhaññāti vasso ca bhañño cāti dve janā. Ahetuvādāti natthi hetu natthi paccayo sattānaṃ visuddhiyāti evamādivādino. Akiriyavādāti karoto na karīyati pāpanti evaṃ kiriyapaṭikkhepavādino. Natthikavādāti natthi dinnantiādivādino. Te imesu tīsupi dassanesu okkantaniyāmā ahesuṃ. Kathaṃ panetesu niyāmo hotīti. Yo hi evarūpaṃ laddhiṃ gahetvā rattiṭṭhānadivāṭṭhāne nisinno sajjhāyati vīmaṃsati, tassa ‘‘natthi hetu natthi paccayo karoto na karīyati pāpaṃ, natthi dinnaṃ, kāyassa bhedā ucchijjatī’’ti tasmiṃ ārammaṇe micchāsati santiṭṭhati, cittaṃ ekaggaṃ hoti, javanāni javanti. Paṭhamajavane satekiccho hoti, tathā dutiyādīsu. Sattame buddhānampi atekiccho anivattī ariṭṭhakaṇḍakasadiso hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha koci ekaṃ dassanaṃ okkamati, koci dve, koci tīṇipi, niyatamicchādiṭṭhikova hoti, patto saggamaggāvaraṇañceva mokkhamaggāvaraṇañca. Abhabbo tassa attabhāvassa anantaraṃ saggampi gantuṃ, pageva mokkhaṃ, vaṭṭakhāṇu nāmesa satto pathavīgopako, yebhuyyena ",
      " evarūpassa bhavato vuṭṭhānaṃ natthi. Vassabhaññāpi edisā ahesuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nindābyārosaupārambhabhayā"
      },
      "ti attano nindābhayena ghaṭṭanabhayena upavādabhayena cāti attho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "Tattha koci ekaṃ dassanaṃ okkamati, koci dve, koci tīṇipi, niyatamicchādiṭṭhikova hoti, patto saggamaggāvaraṇañceva mokkhamaggāvaraṇañca. Abhabbo tassa attabhāvassa anantaraṃ saggampi gantuṃ, pageva mokkhaṃ, vaṭṭakhāṇu nāmesa satto pathavīgopako, yebhuyyena evarūpassa bhavato vuṭṭhānaṃ natthi. Vassabhaññāpi edisā ahesuṃ. Nindābyārosaupārambhabhayāti attano nindābhayena ghaṭṭanabhayena upavādabhayena cāti attho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahācattārīsakasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Ānāpānassatisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "144"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti ānāpānassatisuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññehi cā"
      },
      "ti ṭhapetvā pāḷiyaṃ āgate dasa there aññehipi abhiññātehi bahūhi ",
      " sāvakehi saddhiṃ. Tadā kira mahā bhikkhusaṅgho ahosi aparicchinnagaṇano."
    ],
    "innerText": "144.Evaṃme sutanti ānāpānassatisuttaṃ. Tattha aññehi cāti ṭhapetvā pāḷiyaṃ āgate dasa there aññehipi abhiññātehi bahūhi sāvakehi saddhiṃ. Tadā kira mahā bhikkhusaṅgho ahosi aparicchinnagaṇano."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ovadanti anusāsantī"
      },
      "ti āmisasaṅgahena dhammasaṅgahena cāti dvīhi saṅgahehi saṅgaṇhitvā kammaṭṭhānovādānusāsanīhi ovadanti ca anusāsanti ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te cā"
      },
      "ti cakāro āgamasandhimattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uḷāraṃ pubbenāparaṃ visesaṃ jānantī"
      },
      "ti sīlaparipūraṇādito pubbavisesato uḷārataraṃ aparaṃ kasiṇaparikammādivisesaṃ jānantīti attho."
    ],
    "innerText": "Ovadanti anusāsantīti āmisasaṅgahena dhammasaṅgahena cāti dvīhi saṅgahehi saṅgaṇhitvā kammaṭṭhānovādānusāsanīhi ovadanti ca anusāsanti ca. Te cāti cakāro āgamasandhimattaṃ. Uḷāraṃ pubbenāparaṃ visesaṃ jānantīti sīlaparipūraṇādito pubbavisesato uḷārataraṃ aparaṃ kasiṇaparikammādivisesaṃ jānantīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "145"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āraddho"
      },
      "ti tuṭṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appattassa pattiyā"
      },
      "ti appattassa arahattassa pāpuṇanatthaṃ. Sesapadadvayepi ayameva attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Komudiṃ cātumāsini"
      },
      "nti pacchimakattikacātumāsapuṇṇamaṃ. Sā hi kumudānaṃ atthitāya komudī, catunnaṃ vassikānaṃ māsānaṃ pariyosānattā cātumāsinīti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āgamessāmī"
      },
      "ti udikkhissāmi, ajja apavāretvā yāva sā āgacchati, tāva katthaci agantvā idheva vasissāmīti attho. Iti bhikkhūnaṃ pavāraṇasaṅgahaṃ anujānanto evamāha."
    ],
    "innerText": "145.Āraddhoti tuṭṭho. Appattassa pattiyāti appattassa arahattassa pāpuṇanatthaṃ. Sesapadadvayepi ayameva attho. Komudiṃ cātumāsininti pacchimakattikacātumāsapuṇṇamaṃ. Sā hi kumudānaṃ atthitāya komudī, catunnaṃ vassikānaṃ māsānaṃ pariyosānattā cātumāsinīti vuccati. Āgamessāmīti udikkhissāmi, ajja apavāretvā yāva sā āgacchati, tāva katthaci agantvā idheva vasissāmīti attho. Iti bhikkhūnaṃ pavāraṇasaṅgahaṃ anujānanto evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavāraṇasaṅgaho"
      },
      " nāma ñattidutiyena kammena diyyati kassa ",
      " panesa diyyati, kassa na diyyatīti. Akārakassa tāva bālaputhujjanassa na diyyati, tathā āraddhavipassakassa ceva ariyasāvakassa ca. Yassa pana samatho vā taruṇo hoti vipassanā vā, tassa diyyati. Bhagavāpi tadā bhikkhūnaṃ cittācāraṃ parivīmaṃsanto samathavipassanānaṃ taruṇabhāvaṃ ñatvā – ‘‘mayi ajja pavārente disāsu vassaṃvuṭṭhā bhikkhū idha osarissanti. Tato ime bhikkhū vuḍḍhatarehi bhikkhūhi senāsane gahite visesaṃ nibbattetuṃ na sakkhissanti. Sacepi cārikaṃ pakkamissāmi, imesaṃ vasanaṭṭhānaṃ dullabhameva bhavissati. Mayi pana apavārente bhikkhūpi imaṃ ",
      " sāvatthiṃ na osarissanti, ahampi cārikaṃ na pakkamissāmi, evaṃ imesaṃ bhikkhūnaṃ vasanaṭṭhānaṃ apalibuddhaṃ bhavissati. Te attano attano vasanaṭṭhāne phāsu viharantā samathavipassanā thāmajātā katvā visesaṃ nibbattetuṃ sakkhissantī’’ti so taṃdivasaṃ apavāretvā kattikapuṇṇamāyaṃ pavāressāmīti bhikkhūnaṃ pavāraṇasaṅgahaṃ ",
      " anujāni. Pavāraṇasaṅgahasmiñhi laddhe yassa nissayapaṭipannassa ācariyupajjhāyā pakkamanti, sopi ‘‘sace patirūpo nissayadāyako āgamissati, tassa santike nissayaṃ gaṇhissāmī’’ti yāva gimhānaṃ pacchimamāsā vasituṃ labhati. Sacepi saṭṭhivassā bhikkhū āgacchanti, tassa senāsanaṃ gahetuṃ na labhanti. Ayañca pana pavāraṇasaṅgaho ekassa dinnopi sabbesaṃ dinnoyeva hoti."
    ],
    "innerText": "Pavāraṇasaṅgaho nāma ñattidutiyena kammena diyyati kassa panesa diyyati, kassa na diyyatīti. Akārakassa tāva bālaputhujjanassa na diyyati, tathā āraddhavipassakassa ceva ariyasāvakassa ca. Yassa pana samatho vā taruṇo hoti vipassanā vā, tassa diyyati. Bhagavāpi tadā bhikkhūnaṃ cittācāraṃ parivīmaṃsanto samathavipassanānaṃ taruṇabhāvaṃ ñatvā – ‘‘mayi ajja pavārente disāsu vassaṃvuṭṭhā bhikkhū idha osarissanti. Tato ime bhikkhū vuḍḍhatarehi bhikkhūhi senāsane gahite visesaṃ nibbattetuṃ na sakkhissanti. Sacepi cārikaṃ pakkamissāmi, imesaṃ vasanaṭṭhānaṃ dullabhameva bhavissati. Mayi pana apavārente bhikkhūpi imaṃ sāvatthiṃ na osarissanti, ahampi cārikaṃ na pakkamissāmi, evaṃ imesaṃ bhikkhūnaṃ vasanaṭṭhānaṃ apalibuddhaṃ bhavissati. Te attano attano vasanaṭṭhāne phāsu viharantā samathavipassanā thāmajātā katvā visesaṃ nibbattetuṃ sakkhissantī’’ti so taṃdivasaṃ apavāretvā kattikapuṇṇamāyaṃ pavāressāmīti bhikkhūnaṃ pavāraṇasaṅgahaṃ anujāni. Pavāraṇasaṅgahasmiñhi laddhe yassa nissayapaṭipannassa ācariyupajjhāyā pakkamanti, sopi ‘‘sace patirūpo nissayadāyako āgamissati, tassa santike nissayaṃ gaṇhissāmī’’ti yāva gimhānaṃ pacchimamāsā vasituṃ labhati. Sacepi saṭṭhivassā bhikkhū āgacchanti, tassa senāsanaṃ gahetuṃ na labhanti. Ayañca pana pavāraṇasaṅgaho ekassa dinnopi sabbesaṃ dinnoyeva hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāvatthiṃ osarantī"
      },
      "ti bhagavatā pavāraṇasaṅgaho dinnoti sutasutaṭṭhāneyeva yathāsabhāvena ekaṃ māsaṃ vasitvā kattikapuṇṇamāya uposathaṃ katvā osarante sandhāya idaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbenāpara"
      },
      "nti idha taruṇasamathavipassanāsu kammaṃ ",
      " katvā samathavipassanā thāmajātā akaṃsu, ayaṃ pubbe viseso nāma. Tato samāhitena cittena saṅkhāre sammasitvā keci sotāpattiphalaṃ…pe… keci arahattaṃ sacchikariṃsu. Ayaṃ aparo uḷāro viseso nāma."
    ],
    "innerText": "Sāvatthiṃ osarantīti bhagavatā pavāraṇasaṅgaho dinnoti sutasutaṭṭhāneyeva yathāsabhāvena ekaṃ māsaṃ vasitvā kattikapuṇṇamāya uposathaṃ katvā osarante sandhāya idaṃ vuttaṃ. Pubbenāparanti idha taruṇasamathavipassanāsu kammaṃ katvā samathavipassanā thāmajātā akaṃsu, ayaṃ pubbe viseso nāma. Tato samāhitena cittena saṅkhāre sammasitvā keci sotāpattiphalaṃ…pe… keci arahattaṃ sacchikariṃsu. Ayaṃ aparo uḷāro viseso nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "146"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ala"
      },
      "nti yuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yojanagaṇanānī"
      },
      "ti ekaṃ yojanaṃ yojanameva, dasapi yojanāni yojanāneva, tato uddhaṃ yojanagaṇanānīti vuccanti. Idha pana yojanasatampi yojanasahassampi adhippetaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puṭosenāpī"
      },
      "ti puṭosaṃ vuccati pātheyyaṃ. taṃ pātheyyaṃ gahetvāpi upasaṅkamituṃ yuttamevāti attho. ‘‘Puṭaṃsenā’’tipi pāṭho, tassattho – puṭo aṃse assāti puṭaṃso, tena puṭaṃsena, aṃse pātheyyapuṭaṃ vahantenāpīti vuttaṃ hoti."
    ],
    "innerText": "146.Alanti yuttaṃ. Yojanagaṇanānīti ekaṃ yojanaṃ yojanameva, dasapi yojanāni yojanāneva, tato uddhaṃ yojanagaṇanānīti vuccanti. Idha pana yojanasatampi yojanasahassampi adhippetaṃ. Puṭosenāpīti puṭosaṃ vuccati pātheyyaṃ. taṃ pātheyyaṃ gahetvāpi upasaṅkamituṃ yuttamevāti attho. ‘‘Puṭaṃsenā’’tipi pāṭho, tassattho – puṭo aṃse assāti puṭaṃso, tena puṭaṃsena, aṃse pātheyyapuṭaṃ vahantenāpīti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "147"
      },
      ". Idāni evarūpehi caraṇehi samannāgatā ettha bhikkhū atthīti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "santi, bhikkhave"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catunnaṃ satipaṭṭhānāna"
      },
      "ntiādīni tesaṃ bhikkhūnaṃ abhiniviṭṭhakammaṭṭhānadassanatthaṃ vuttāni. Tattha sattatiṃsa bodhipakkhiyadhammā lokiyalokuttarā kathitā. Tatra hi ye bhikkhū tasmiṃ khaṇe maggaṃ bhāventi, tesaṃ lokuttarā honti. Āraddhavipassakānaṃ lokiyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniccasaññābhāvanānuyoga"
      },
      "nti ettha saññāsīsena vipassanā kathitā ",
      ". Yasmā panettha ānāpānakammaṭṭhānavasena abhiniviṭṭhāva ",
      " bahū bhikkhū, tasmā sesakammaṭṭhānāni saṅkhepena kathetvā ānāpānakammaṭṭhānaṃ vitthārena kathento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ānāpānassati, bhikkhave"
      },
      "tiādimāha. Idaṃ pana ānāpānakammaṭṭhānaṃ sabbākārena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visuddhimagge"
      },
      " vitthāritaṃ, tasmā tattha vuttanayenevassa pāḷittho ca bhāvanānayo ca veditabbo."
    ],
    "innerText": "147. Idāni evarūpehi caraṇehi samannāgatā ettha bhikkhū atthīti dassetuṃ santi, bhikkhavetiādimāha. Tattha catunnaṃ satipaṭṭhānānantiādīni tesaṃ bhikkhūnaṃ abhiniviṭṭhakammaṭṭhānadassanatthaṃ vuttāni. Tattha sattatiṃsa bodhipakkhiyadhammā lokiyalokuttarā kathitā. Tatra hi ye bhikkhū tasmiṃ khaṇe maggaṃ bhāventi, tesaṃ lokuttarā honti. Āraddhavipassakānaṃ lokiyā. Aniccasaññābhāvanānuyoganti ettha saññāsīsena vipassanā kathitā . Yasmā panettha ānāpānakammaṭṭhānavasena abhiniviṭṭhāva bahū bhikkhū, tasmā sesakammaṭṭhānāni saṅkhepena kathetvā ānāpānakammaṭṭhānaṃ vitthārena kathento ānāpānassati, bhikkhavetiādimāha. Idaṃ pana ānāpānakammaṭṭhānaṃ sabbākārena visuddhimagge vitthāritaṃ, tasmā tattha vuttanayenevassa pāḷittho ca bhāvanānayo ca veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "149"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyaññatara"
      },
      "nti ",
      " pathavīkāyādīsu catūsu kāyesu aññataraṃ vadāmi, vāyo kāyaṃ vadāmīti attho. Atha vā rūpāyatanaṃ…pe… kabaḷīkāro āhāroti pañcavīsati rūpakoṭṭhāsā rūpakāyo nāma. Tesu ānāpānaṃ phoṭṭhabbāyatane saṅgahitattā kāyaññataraṃ hoti, tasmāpi evamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmātihā"
      },
      "ti yasmā catūsu kāyesu aññataraṃ vāyokāyaṃ, pañcavīsatirūpakoṭṭhāse vā rūpakāye aññataraṃ ānāpānaṃ anupassati, tasmā kāye kāyānupassīti attho. Evaṃ sabbattha attho veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vedanāññatara"
      },
      "nti tīsu vedanāsu aññataraṃ, sukhavedanaṃ sandhāyetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhukaṃ manasikāra"
      },
      "nti pītipaṭisaṃveditādivasena uppannaṃ sundaramanasikāraṃ. Kiṃ pana manasikāro sukhavedanā hotīti. Na hoti, desanāsīsaṃ panetaṃ. Yatheva hi ‘‘aniccasaññābhāvanānuyogamanuyuttā’’ti ettha saññānāmena paññā vuttā, evamidhāpi manasikāranāmena vedanā vuttāti veditabbā. Etasmiṃ catukke paṭhamapade pītisīsena vedanā vuttā, dutiyapade sukhanti sarūpeneva vuttā. Cittasaṅkhārapadadvaye ‘‘saññā ca vedanā ca cetasikā, ete dhammā cittapaṭibaddhā cittasaṅkhārā’’ti (paṭi. ma. 1.174) vacanato ‘‘vitakkavicāre ṭhapetvā sabbepi cittasampayuttakā dhammā cittasaṅkhāre saṅgahitā’’ti vacanato cittasaṅkhāranāmena vedanā vuttā. Taṃ sabbaṃ manasikāranāmena saṅgahetvā idha ‘‘sādhukaṃ manasikāra’’nti āha."
    ],
    "innerText": "149.Kāyaññataranti pathavīkāyādīsu catūsu kāyesu aññataraṃ vadāmi, vāyo kāyaṃ vadāmīti attho. Atha vā rūpāyatanaṃ…pe… kabaḷīkāro āhāroti pañcavīsati rūpakoṭṭhāsā rūpakāyo nāma. Tesu ānāpānaṃ phoṭṭhabbāyatane saṅgahitattā kāyaññataraṃ hoti, tasmāpi evamāha. Tasmātihāti yasmā catūsu kāyesu aññataraṃ vāyokāyaṃ, pañcavīsatirūpakoṭṭhāse vā rūpakāye aññataraṃ ānāpānaṃ anupassati, tasmā kāye kāyānupassīti attho. Evaṃ sabbattha attho veditabbo. Vedanāññataranti tīsu vedanāsu aññataraṃ, sukhavedanaṃ sandhāyetaṃ vuttaṃ. Sādhukaṃ manasikāranti pītipaṭisaṃveditādivasena uppannaṃ sundaramanasikāraṃ. Kiṃ pana manasikāro sukhavedanā hotīti. Na hoti, desanāsīsaṃ panetaṃ. Yatheva hi ‘‘aniccasaññābhāvanānuyogamanuyuttā’’ti ettha saññānāmena paññā vuttā, evamidhāpi manasikāranāmena vedanā vuttāti veditabbā. Etasmiṃ catukke paṭhamapade pītisīsena vedanā vuttā, dutiyapade sukhanti sarūpeneva vuttā. Cittasaṅkhārapadadvaye ‘‘saññā ca vedanā ca cetasikā, ete dhammā cittapaṭibaddhā cittasaṅkhārā’’ti (paṭi. ma. 1.174) vacanato ‘‘vitakkavicāre ṭhapetvā sabbepi cittasampayuttakā dhammā cittasaṅkhāre saṅgahitā’’ti vacanato cittasaṅkhāranāmena vedanā vuttā. Taṃ sabbaṃ manasikāranāmena saṅgahetvā idha ‘‘sādhukaṃ manasikāra’’nti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ santepi yasmā esā vedanā ārammaṇaṃ na hoti, tasmā vedanānupassanā na yujjatīti. No na yujjati, satipaṭṭhānavaṇṇanāyampi hi ‘‘taṃtaṃsukhādīnaṃ ",
      " vatthuṃ ārammaṇaṃ katvā vedanāva vedayati, taṃ pana vedanāpavattiṃ upādāya ‘ahaṃ vedayāmī’ti vohāramattaṃ hotī’’ti vuttaṃ ",
      ". Apica pītipaṭisaṃvedītiādīnaṃ atthavaṇṇanāyametassa parihāro vuttoyeva. Vuttañhetaṃ visuddhimagge –"
    ],
    "innerText": "Evaṃ santepi yasmā esā vedanā ārammaṇaṃ na hoti, tasmā vedanānupassanā na yujjatīti. No na yujjati, satipaṭṭhānavaṇṇanāyampi hi ‘‘taṃtaṃsukhādīnaṃ vatthuṃ ārammaṇaṃ katvā vedanāva vedayati, taṃ pana vedanāpavattiṃ upādāya ‘ahaṃ vedayāmī’ti vohāramattaṃ hotī’’ti vuttaṃ . Apica pītipaṭisaṃvedītiādīnaṃ atthavaṇṇanāyametassa parihāro vuttoyeva. Vuttañhetaṃ visuddhimagge –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dvīhākārehi ",
      " pīti paṭisaṃviditā hoti ārammaṇato ca asammohato ca. Kathaṃ ārammaṇato pīti paṭisaṃviditā hoti? Sappītike dve jhāne samāpajjati, tassa samāpattikkhaṇe jhānapaṭilābhena ārammaṇato pīti paṭisaṃviditā hoti ārammaṇassa paṭisaṃviditattā. Kathaṃ asammohato (pīti paṭisaṃviditā hoti)? Sappītike dve jhāne samāpajjitvā vuṭṭhāya jhānasampayuttaṃ pītiṃ khayato vayato sammasati, tassa vipassanākkhaṇe lakkhaṇapaṭivedhā asammohato pīti paṭisaṃviditā hoti. Vuttampi cetaṃ paṭisambhidāyaṃ ‘dīghaṃ assāsavasena cittassa ekaggataṃ avikkhepaṃ pajānato sati upaṭṭhitā hoti, tāya satiyā, tena ñāṇena sā pīti paṭisaṃviditā hotī’ti. Eteneva nayena avasesapadānipi atthato veditabbānī’’ti."
    ],
    "innerText": "‘‘Dvīhākārehi pīti paṭisaṃviditā hoti ārammaṇato ca asammohato ca. Kathaṃ ārammaṇato pīti paṭisaṃviditā hoti? Sappītike dve jhāne samāpajjati, tassa samāpattikkhaṇe jhānapaṭilābhena ārammaṇato pīti paṭisaṃviditā hoti ārammaṇassa paṭisaṃviditattā. Kathaṃ asammohato (pīti paṭisaṃviditā hoti)? Sappītike dve jhāne samāpajjitvā vuṭṭhāya jhānasampayuttaṃ pītiṃ khayato vayato sammasati, tassa vipassanākkhaṇe lakkhaṇapaṭivedhā asammohato pīti paṭisaṃviditā hoti. Vuttampi cetaṃ paṭisambhidāyaṃ ‘dīghaṃ assāsavasena cittassa ekaggataṃ avikkhepaṃ pajānato sati upaṭṭhitā hoti, tāya satiyā, tena ñāṇena sā pīti paṭisaṃviditā hotī’ti. Eteneva nayena avasesapadānipi atthato veditabbānī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iti yatheva jhānapaṭilābhena ārammaṇato pītisukhacittasaṅkhārā paṭisaṃviditā honti, evaṃ imināpi jhānasampayuttena vedanāsaṅkhātamanasikārapaṭilābhena ārammaṇato vedanā paṭisaṃviditā hoti. Tasmā suvuttametaṃ hoti ‘‘vedanāsu vedanānupassī tasmiṃ samaye bhikkhu viharatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāhaṃ, bhikkhave, muṭṭhassatissa asampajānassā"
      },
      "ti ettha ayamadhippāyo – yasmā cittapaṭisaṃvedī assasissāmītiādinā nayena pavatto bhikkhu kiñcāpi assāsapassāsanimittaṃ ārammaṇaṃ karoti, tassa pana cittassa ārammaṇe satiñca sampajaññañca upaṭṭhapetvā pavattanato citte cittānupassīyeva nāmesa hoti. Na hi muṭṭhassatissa asampajānassa ",
      " ānāpānassatibhāvanā atthi. Tasmā ārammaṇato cittapaṭisaṃviditādivasena citte cittānupassī tasmiṃ samaye bhikkhu viharatīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So yaṃ taṃ abhijjhādomanassānaṃ pahānaṃ, taṃ paññāya disvā sādhukaṃ ajjhupekkhitā hotī"
      },
      "ti ettha abhijjhāya kāmacchandanīvaraṇaṃ, domanassavasena byāpādanīvaraṇaṃ ",
      " dassitaṃ. Idañhi catukkaṃ vipassanāvaseneva vuttaṃ, dhammānupassanā ca nīvaraṇapabbādivasena chabbidhā hoti, tassā nīvaraṇapabbaṃ ādi, tassapi idaṃ nīvaraṇadvayaṃ ādi, iti dhammānupassanāya ādiṃ dassetuṃ ‘‘abhijjhādomanassāna’’nti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pahāna"
      },
      "nti aniccānupassanāya niccasaññaṃ pajahatīti evaṃ pahānakarañāṇaṃ adhippetaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ paññāya disvā"
      },
      "ti taṃ aniccavirāganirodhapaṭinissaggāñāṇasaṅkhātaṃ pahānañāṇaṃ ",
      " aparāya vipassanāpaññāya, tampi aparāyāti evaṃ vipassanāparamparaṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhupekkhitā hotī"
      },
      "ti yañca samathapaṭipannaṃ ajjhupekkhati, yañca ekato upaṭṭhānaṃ ajjhupekkhatīti dvidhā ajjhupekkhati nāma. Tattha sahajātānampi ajjhupekkhanā hoti ārammaṇassapi ajjhupekkhanā, idha ārammaṇaajjhupekkhanā adhippetā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmātiha, bhikkhave"
      },
      "ti yasmā aniccānupassī assasissāmītiādinā nayena pavatto na kevalaṃ nīvaraṇādidhamme, abhijjhādomanassasīsena pana vuttānaṃ dhammānaṃ pahānañāṇampi paññāya disvā ajjhupekkhitā hoti, tasmā ‘‘dhammesu dhammānupassī tasmiṃ samaye bhikkhu viharatī’’ti veditabbo."
    ],
    "innerText": "Nāhaṃ, bhikkhave, muṭṭhassatissa asampajānassāti ettha ayamadhippāyo – yasmā cittapaṭisaṃvedī assasissāmītiādinā nayena pavatto bhikkhu kiñcāpi assāsapassāsanimittaṃ ārammaṇaṃ karoti, tassa pana cittassa ārammaṇe satiñca sampajaññañca upaṭṭhapetvā pavattanato citte cittānupassīyeva nāmesa hoti. Na hi muṭṭhassatissa asampajānassa ānāpānassatibhāvanā atthi. Tasmā ārammaṇato cittapaṭisaṃviditādivasena citte cittānupassī tasmiṃ samaye bhikkhu viharatīti. So yaṃ taṃ abhijjhādomanassānaṃ pahānaṃ, taṃ paññāya disvā sādhukaṃ ajjhupekkhitā hotīti ettha abhijjhāya kāmacchandanīvaraṇaṃ, domanassavasena byāpādanīvaraṇaṃ dassitaṃ. Idañhi catukkaṃ vipassanāvaseneva vuttaṃ, dhammānupassanā ca nīvaraṇapabbādivasena chabbidhā hoti, tassā nīvaraṇapabbaṃ ādi, tassapi idaṃ nīvaraṇadvayaṃ ādi, iti dhammānupassanāya ādiṃ dassetuṃ ‘‘abhijjhādomanassāna’’nti āha. Pahānanti aniccānupassanāya niccasaññaṃ pajahatīti evaṃ pahānakarañāṇaṃ adhippetaṃ. Taṃ paññāya disvāti taṃ aniccavirāganirodhapaṭinissaggāñāṇasaṅkhātaṃ pahānañāṇaṃ aparāya vipassanāpaññāya, tampi aparāyāti evaṃ vipassanāparamparaṃ dasseti. Ajjhupekkhitā hotīti yañca samathapaṭipannaṃ ajjhupekkhati, yañca ekato upaṭṭhānaṃ ajjhupekkhatīti dvidhā ajjhupekkhati nāma. Tattha sahajātānampi ajjhupekkhanā hoti ārammaṇassapi ajjhupekkhanā, idha ārammaṇaajjhupekkhanā adhippetā. Tasmātiha, bhikkhaveti yasmā aniccānupassī assasissāmītiādinā nayena pavatto na kevalaṃ nīvaraṇādidhamme, abhijjhādomanassasīsena pana vuttānaṃ dhammānaṃ pahānañāṇampi paññāya disvā ajjhupekkhitā hoti, tasmā ‘‘dhammesu dhammānupassī tasmiṃ samaye bhikkhu viharatī’’ti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "150"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavicinatī"
      },
      "ti aniccādivasena pavicinati. Itaraṃ padadvayaṃ etasseva vevacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nirāmisā"
      },
      "ti ",
      " nikkilesā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passambhatī"
      },
      "ti kāyikacetasikadarathapaṭippassaddhiyā kāyopi cittampi passambhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādhiyatī"
      },
      "ti sammā ṭhapiyati, appanāpattaṃ viya hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhupekkhitā hotī"
      },
      "ti sahajātaajjhupekkhanāya ajjhupekkhitā hoti."
    ],
    "innerText": "150.Pavicinatīti aniccādivasena pavicinati. Itaraṃ padadvayaṃ etasseva vevacanaṃ. Nirāmisāti nikkilesā. Passambhatīti kāyikacetasikadarathapaṭippassaddhiyā kāyopi cittampi passambhati. Samādhiyatīti sammā ṭhapiyati, appanāpattaṃ viya hoti. Ajjhupekkhitā hotīti sahajātaajjhupekkhanāya ajjhupekkhitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ cuddasavidhena kāyapariggāhakassa bhikkhuno tasmiṃ kāye sati satisambojjhaṅgo, satiyā sampayuttaṃ ñāṇaṃ dhammavicayasambojjhaṅgo, taṃsampayuttameva kāyikacetasikavīriyaṃ vīriyasambojjhaṅgo, pīti, passaddhi, cittekaggatā samādhisambojjhaṅgo, imesaṃ channaṃ sambojjhaṅgānaṃ anosakkanaanativattanasaṅkhāto majjhattākāro upekkhāsambojjhaṅgo. Yatheva hi samappavattesu assesu sārathino ‘‘ayaṃ olīyatī’’ti tudanaṃ vā, ‘‘ayaṃ atidhāvatī’’ti ākaḍḍhanaṃ vā natthi, kevalaṃ evaṃ passamānassa ṭhitākārova hoti, evameva imesaṃ channaṃ sambojjhaṅgānaṃ anosakkanaanativattanasaṅkhāto majjhattākāro upekkhāsambojjhaṅgo nāma hoti. Ettāvatā kiṃ kathitaṃ? Ekacittakkhaṇikā nānārasalakkhaṇā vipassanāsambojjhaṅgā nāma kathitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "152"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivekanissita"
      },
      "ntiādīni ",
      " vuttatthāneva. Ettha pana ānāpānapariggāhikā sati lokiyā hoti, lokiyā ānāpānā lokiyasatipaṭṭhānaṃ paripūrenti, lokiyā satipaṭṭhānā lokuttarabojjhaṅge paripūrenti, lokuttarā bojjhaṅgā vijjāvimuttiphalanibbānaṃ ",
      " paripūrenti. Iti lokiyassa ",
      " āgataṭṭhāne lokiyaṃ kathitaṃ, lokuttarassa āgataṭṭhāne lokuttaraṃ kathitanti. Thero panāha ‘‘aññattha evaṃ hoti, imasmiṃ pana sutte lokuttaraṃ upari āgataṃ, lokiyā ānāpānā lokiyasatipaṭṭhāne paripūrenti, lokiyā satipaṭṭhānā lokiye bojjhaṅge paripūrenti, lokiyā bojjhaṅgā lokuttaraṃ vijjāvimuttiphalanibbānaṃ paripūrenti, vijjāvimuttipadena hi idha vijjāvimuttiphalanibbānaṃ adhippeta’’nti."
    ],
    "innerText": "152.Vivekanissitantiādīni vuttatthāneva. Ettha pana ānāpānapariggāhikā sati lokiyā hoti, lokiyā ānāpānā lokiyasatipaṭṭhānaṃ paripūrenti, lokiyā satipaṭṭhānā lokuttarabojjhaṅge paripūrenti, lokuttarā bojjhaṅgā vijjāvimuttiphalanibbānaṃ paripūrenti. Iti lokiyassa āgataṭṭhāne lokiyaṃ kathitaṃ, lokuttarassa āgataṭṭhāne lokuttaraṃ kathitanti. Thero panāha ‘‘aññattha evaṃ hoti, imasmiṃ pana sutte lokuttaraṃ upari āgataṃ, lokiyā ānāpānā lokiyasatipaṭṭhāne paripūrenti, lokiyā satipaṭṭhānā lokiye bojjhaṅge paripūrenti, lokiyā bojjhaṅgā lokuttaraṃ vijjāvimuttiphalanibbānaṃ paripūrenti, vijjāvimuttipadena hi idha vijjāvimuttiphalanibbānaṃ adhippeta’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ānāpānassatisuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Kāyagatāsatisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "153-4"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti kāyagatāsatisuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gehasitā"
      },
      "ti pañcakāmaguṇanissitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sarasaṅkappā"
      },
      "ti dhāvanasaṅkappā. Sarantīti hi sarā, dhāvantīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhattamevā"
      },
      "ti gocarajjhattasmiṃyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyagatāsati"
      },
      "nti kāyapariggāhikampi kāyārammaṇampi satiṃ. Kāyapariggāhikanti vutte samatho kathito hoti, kāyārammaṇanti vutte vipassanā. Ubhayena samathavipassanā kathitā honti."
    ],
    "innerText": "153-4.Evaṃme sutanti kāyagatāsatisuttaṃ. Tattha gehasitāti pañcakāmaguṇanissitā. Sarasaṅkappāti dhāvanasaṅkappā. Sarantīti hi sarā, dhāvantīti attho. Ajjhattamevāti gocarajjhattasmiṃyeva. Kāyagatāsatinti kāyapariggāhikampi kāyārammaṇampi satiṃ. Kāyapariggāhikanti vutte samatho kathito hoti, kāyārammaṇanti vutte vipassanā. Ubhayena samathavipassanā kathitā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puna caparaṃ…pe… evampi, bhikkhave, bhikkhu kāyagatāsatiṃ bhāvetī"
      },
      "ti satipaṭṭhāne cuddasavidhena kāyānupassanā kathitā."
    ],
    "innerText": "Puna caparaṃ…pe… evampi, bhikkhave, bhikkhu kāyagatāsatiṃ bhāvetīti satipaṭṭhāne cuddasavidhena kāyānupassanā kathitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "156"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antogadhāvāssā"
      },
      "ti tassa bhikkhuno bhāvanāya abbhantaragatāva honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijjābhāgiyā"
      },
      "ti ettha sampayogavasena vijjaṃ bhajantīti ",
      " vijjābhāgiyā. Vijjābhāge vijjākoṭṭhāse vattantītipi vijjābhāgiyā. Tattha ",
      " vipassanāñāṇaṃ, manomayiddhi, cha abhiññāti aṭṭha vijjā. Purimena atthena tāhi sampayuttadhammāpi vijjābhāgiyā. Pacchimena atthena tāsu yā kāci ekā vijjā vijjā, sesā vijjābhāgiyāti evaṃ vijjāpi vijjāya sampayuttā dhammāpi vijjābhāgiyāteva veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cetasā phuṭo"
      },
      "ti ettha duvidhaṃ pharaṇaṃ āpopharaṇañca, dibbacakkhupharaṇañca, tattha āpokasiṇaṃ samāpajjitvā āpena pharaṇaṃ āpopharaṇaṃ nāma. Evaṃ phuṭepi mahāsamudde sabbā samuddaṅgamā kunnadiyo antogadhāva honti, ālokaṃ pana vaḍḍhetvā dibbacakkhunā sakalasamuddassa dassanaṃ dibbacakkhupharaṇaṃ nāma. Evaṃ pharaṇepi mahāsamudde sabbā samuddaṅgamā kunnadiyo antogadhāva honti."
    ],
    "innerText": "156.Antogadhāvāssāti tassa bhikkhuno bhāvanāya abbhantaragatāva honti. Vijjābhāgiyāti ettha sampayogavasena vijjaṃ bhajantīti vijjābhāgiyā. Vijjābhāge vijjākoṭṭhāse vattantītipi vijjābhāgiyā. Tattha vipassanāñāṇaṃ, manomayiddhi, cha abhiññāti aṭṭha vijjā. Purimena atthena tāhi sampayuttadhammāpi vijjābhāgiyā. Pacchimena atthena tāsu yā kāci ekā vijjā vijjā, sesā vijjābhāgiyāti evaṃ vijjāpi vijjāya sampayuttā dhammāpi vijjābhāgiyāteva veditabbā. Cetasā phuṭoti ettha duvidhaṃ pharaṇaṃ āpopharaṇañca, dibbacakkhupharaṇañca, tattha āpokasiṇaṃ samāpajjitvā āpena pharaṇaṃ āpopharaṇaṃ nāma. Evaṃ phuṭepi mahāsamudde sabbā samuddaṅgamā kunnadiyo antogadhāva honti, ālokaṃ pana vaḍḍhetvā dibbacakkhunā sakalasamuddassa dassanaṃ dibbacakkhupharaṇaṃ nāma. Evaṃ pharaṇepi mahāsamudde sabbā samuddaṅgamā kunnadiyo antogadhāva honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Otāra"
      },
      "nti vivaraṃ chiddaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇa"
      },
      "nti kilesuppattipaccayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Labhetha otāra"
      },
      "nti labheyya pavesanaṃ, vinivijjhitvā yāva pariyosānā gaccheyyāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nikkhepana"
      },
      "nti nikkhipanaṭṭhānaṃ."
    ],
    "innerText": "Otāranti vivaraṃ chiddaṃ. Ārammaṇanti kilesuppattipaccayaṃ. Labhetha otāranti labheyya pavesanaṃ, vinivijjhitvā yāva pariyosānā gaccheyyāti attho. Nikkhepananti nikkhipanaṭṭhānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "157"
      },
      ". Evaṃ ",
      " abhāvitakāyagatāsatiṃ puggalaṃ allamattikapuñjādīhi upametvā idāni bhāvitakāyagatāsatiṃ sāraphalakādīhi upametuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "seyyathāpī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aggaḷaphalaka"
      },
      "nti kavāṭaṃ."
    ],
    "innerText": "157. Evaṃ abhāvitakāyagatāsatiṃ puggalaṃ allamattikapuñjādīhi upametvā idāni bhāvitakāyagatāsatiṃ sāraphalakādīhi upametuṃ seyyathāpītiādimāha. Tattha aggaḷaphalakanti kavāṭaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "158"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kākapeyyo"
      },
      "ti mukhavaṭṭiyaṃ nisīditvā kākena gīvaṃ anāmetvāva pātabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhiññāsacchikaraṇīyassā"
      },
      "ti abhiññāya sacchikātabbassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakkhibhabbataṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāpuṇātī"
      },
      "ti paccakkhabhāvaṃ pāpuṇāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sati sati āyatane"
      },
      "ti satisati kāraṇe. Kiṃ panettha kāraṇanti? Abhiññāva kāraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āḷibandhā"
      },
      "ti mariyādabaddhā."
    ],
    "innerText": "158.Kākapeyyoti mukhavaṭṭiyaṃ nisīditvā kākena gīvaṃ anāmetvāva pātabbo. Abhiññāsacchikaraṇīyassāti abhiññāya sacchikātabbassa. Sakkhibhabbataṃpāpuṇātīti paccakkhabhāvaṃ pāpuṇāti. Sati sati āyataneti satisati kāraṇe. Kiṃ panettha kāraṇanti? Abhiññāva kāraṇaṃ. Āḷibandhāti mariyādabaddhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yānīkatāyā"
      },
      "ti yuttayānaṃ viya katāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthukatāyā"
      },
      "ti patiṭṭhākatāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuṭṭhitāyā"
      },
      "ti anuppavattitāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paricitāyā"
      },
      "ti paricayakatāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Susamāraddhāyā"
      },
      "ti suṭṭhu samāraddhāya susampaggahitāya. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "Yānīkatāyāti yuttayānaṃ viya katāya. Vatthukatāyāti patiṭṭhākatāya. Anuṭṭhitāyāti anuppavattitāya. Paricitāyāti paricayakatāya. Susamāraddhāyāti suṭṭhu samāraddhāya susampaggahitāya. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kāyagatāsatisuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Saṅkhārupapattisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "160"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "me suta"
      },
      "nti saṅkhārupapattisuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅkhārupapatti"
      },
      "nti saṅkhārānaṃyeva upapattiṃ, na sattassa, na posassa, puññābhisaṅkhārena vā bhavūpagakkhandhānaṃ upapattiṃ."
    ],
    "innerText": "160.Evaṃme sutanti saṅkhārupapattisuttaṃ. Tattha saṅkhārupapattinti saṅkhārānaṃyeva upapattiṃ, na sattassa, na posassa, puññābhisaṅkhārena vā bhavūpagakkhandhānaṃ upapattiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "161"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhāya samannāgato"
      },
      "ti saddhādayo pañca dhammā lokikā vaṭṭanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dahatī"
      },
      "ti ṭhapeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhiṭṭhātī"
      },
      "ti patiṭṭhāpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhārā ca vihārā cā"
      },
      "ti saha patthanāya saddhādayova pañca dhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatrupapattiyā"
      },
      "ti tasmiṃ ṭhāne nibbattanatthāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ maggo ayaṃ paṭipadā"
      },
      "ti saha patthanāya pañca ",
      " dhammāva. Yassa hi pañca dhammā atthi, na patthanā, tassa gati anibaddhā. Yassa patthanā atthi, na pañca dhammā, tassapi anibaddhā. Yesaṃ ubhayaṃ atthi, tesaṃ gati nibaddhā. Yathā hi ākāse khittadaṇḍo aggena vā majjhena vā mūlena vā nipatissatīti niyamo natthi, evaṃ sattānaṃ paṭisandhiggahaṇaṃ aniyataṃ. Tasmā kusalaṃ kammaṃ katvā ekasmiṃ ṭhāne patthanaṃ kātuṃ vaṭṭati."
    ],
    "innerText": "161.Saddhāya samannāgatoti saddhādayo pañca dhammā lokikā vaṭṭanti. Dahatīti ṭhapeti. Adhiṭṭhātīti patiṭṭhāpeti. Saṅkhārā ca vihārā cāti saha patthanāya saddhādayova pañca dhammā. Tatrupapattiyāti tasmiṃ ṭhāne nibbattanatthāya. Ayaṃ maggo ayaṃ paṭipadāti saha patthanāya pañca dhammāva. Yassa hi pañca dhammā atthi, na patthanā, tassa gati anibaddhā. Yassa patthanā atthi, na pañca dhammā, tassapi anibaddhā. Yesaṃ ubhayaṃ atthi, tesaṃ gati nibaddhā. Yathā hi ākāse khittadaṇḍo aggena vā majjhena vā mūlena vā nipatissatīti niyamo natthi, evaṃ sattānaṃ paṭisandhiggahaṇaṃ aniyataṃ. Tasmā kusalaṃ kammaṃ katvā ekasmiṃ ṭhāne patthanaṃ kātuṃ vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "165"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āmaṇḍa"
      },
      "nti āmalakaṃ. Yathā taṃ parisuddhacakkhussa purisassa sabbasova pākaṭaṃ hoti, evaṃ tassa brahmuno saddhiṃ tattha nibbattasattehi sahassī lokadhātu. Esa nayo sabbattha."
    ],
    "innerText": "165.Āmaṇḍanti āmalakaṃ. Yathā taṃ parisuddhacakkhussa purisassa sabbasova pākaṭaṃ hoti, evaṃ tassa brahmuno saddhiṃ tattha nibbattasattehi sahassī lokadhātu. Esa nayo sabbattha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "167"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Subho"
      },
      "ti sundaro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jātimā"
      },
      "ti ākarasampanno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suparikammakato"
      },
      "ti dhovanādīhi suṭṭhukataparikammo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇḍukambale nikkhitto"
      },
      "ti rattakambale ṭhapito."
    ],
    "innerText": "167.Subhoti sundaro. Jātimāti ākarasampanno. Suparikammakatoti dhovanādīhi suṭṭhukataparikammo. Paṇḍukambale nikkhittoti rattakambale ṭhapito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "168"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satasahasso"
      },
      "ti lokadhātusatasahassamhi ālokapharaṇabrahmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nikkha"
      },
      "nti nikkhena kataṃ piḷandhanaṃ, nikkhaṃ nāma pañcasuvaṇṇaṃ, ūnakanikkhena kataṃ pasādhanañhi ghaṭṭanamajjanakkhamaṃ na hoti, atirekena kataṃ ghaṭṭanamajjanaṃ khamati, vaṇṇavantaṃ pana na hoti, pharusadhātukaṃ khāyati. Nikkhena kataṃ ghaṭṭanamajjanañceva khamati, vaṇṇavantañca hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jambonada"
      },
      "nti jambunadiyaṃ nibbattaṃ. Mahājamburukkhassa hi ekekā sākhā paṇṇāsa paṇṇāsa yojanāni ",
      " vaḍḍhitā, tāsu mahantā nadiyo sandanti, tāsaṃ nadīnaṃ ",
      " ubhayatīresu jambupakkānaṃ patitaṭṭhāne suvaṇṇaṅkurā uṭṭhahanti, te nadījalena vuyhamānā ",
      " anupubbena mahāsamuddaṃ pavisanti. Taṃ sandhāya jambonadanti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dakkhakammāraputtaukkāmukhasukusalasampahaṭṭha"
      },
      "nti dakkhena sukusalena kammāraputtena ukkāmukhe pacitvā sampahaṭṭhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ukkāmukhe"
      },
      "ti uddhane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampahaṭṭha"
      },
      "nti dhotaghaṭṭitamajjitaṃ. Vatthopame (ma. ni. 1.75-76) ca dhātuvibhaṅge (ma. ni. 3.357-360) ca piṇḍasodhanaṃ vuttaṃ. Imasmiṃ sutte katabhaṇḍasodhanaṃ vuttaṃ."
    ],
    "innerText": "168.Satasahassoti lokadhātusatasahassamhi ālokapharaṇabrahmā. Nikkhanti nikkhena kataṃ piḷandhanaṃ, nikkhaṃ nāma pañcasuvaṇṇaṃ, ūnakanikkhena kataṃ pasādhanañhi ghaṭṭanamajjanakkhamaṃ na hoti, atirekena kataṃ ghaṭṭanamajjanaṃ khamati, vaṇṇavantaṃ pana na hoti, pharusadhātukaṃ khāyati. Nikkhena kataṃ ghaṭṭanamajjanañceva khamati, vaṇṇavantañca hoti. Jambonadanti jambunadiyaṃ nibbattaṃ. Mahājamburukkhassa hi ekekā sākhā paṇṇāsa paṇṇāsa yojanāni vaḍḍhitā, tāsu mahantā nadiyo sandanti, tāsaṃ nadīnaṃ ubhayatīresu jambupakkānaṃ patitaṭṭhāne suvaṇṇaṅkurā uṭṭhahanti, te nadījalena vuyhamānā anupubbena mahāsamuddaṃ pavisanti. Taṃ sandhāya jambonadanti vuttaṃ. Dakkhakammāraputtaukkāmukhasukusalasampahaṭṭhanti dakkhena sukusalena kammāraputtena ukkāmukhe pacitvā sampahaṭṭhaṃ. Ukkāmukheti uddhane. Sampahaṭṭhanti dhotaghaṭṭitamajjitaṃ. Vatthopame (ma. ni. 1.75-76) ca dhātuvibhaṅge (ma. ni. 3.357-360) ca piṇḍasodhanaṃ vuttaṃ. Imasmiṃ sutte katabhaṇḍasodhanaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yaṃ pana sabbavāresu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pharitvā adhimuccitvā"
      },
      "ti vuttaṃ, tattha pañcavidhaṃ pharaṇaṃ cetopharaṇaṃ kasiṇapharaṇaṃ dibbacakkhupharaṇaṃ ālokapharaṇaṃ sarīrapharaṇanti. Tattha cetopharaṇaṃ nāma lokadhātusahasse sattānaṃ cittajānanaṃ. Kasiṇapharaṇaṃ nāma lokadhātusahasse kasiṇapattharaṇaṃ. Dibbacakkhupharaṇaṃ nāma ālokaṃ vaḍḍhetvā dibbena cakkhunā sahassalokadhātudassanaṃ. Ālokapharaṇampi etadeva. Sarīrapharaṇaṃ nāma lokadhātusahasse sarīrapabhāya pattharaṇaṃ. Sabbattha imāni pañca pharaṇāni avināsentena kathetabbanti."
    ],
    "innerText": "Yaṃ pana sabbavāresu pharitvā adhimuccitvāti vuttaṃ, tattha pañcavidhaṃ pharaṇaṃ cetopharaṇaṃ kasiṇapharaṇaṃ dibbacakkhupharaṇaṃ ālokapharaṇaṃ sarīrapharaṇanti. Tattha cetopharaṇaṃ nāma lokadhātusahasse sattānaṃ cittajānanaṃ. Kasiṇapharaṇaṃ nāma lokadhātusahasse kasiṇapattharaṇaṃ. Dibbacakkhupharaṇaṃ nāma ālokaṃ vaḍḍhetvā dibbena cakkhunā sahassalokadhātudassanaṃ. Ālokapharaṇampi etadeva. Sarīrapharaṇaṃ nāma lokadhātusahasse sarīrapabhāya pattharaṇaṃ. Sabbattha imāni pañca pharaṇāni avināsentena kathetabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tipiṭakacūḷābhayatthero panāha – ‘‘maṇiopamme kasiṇapharaṇaṃ viya nikkhopamme sarīrapharaṇaṃ viya dissatī’’ti. Tassa vādaṃ viya aṭṭhakathā nāma natthīti paṭikkhitvā sarīrapharaṇaṃ na sabbakālikaṃ, cattārimāni ",
      " pharaṇāni avināsetvāva kathetabbanti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhimuccatī"
      },
      "ti padaṃ pharaṇapadasseva vevacanaṃ, atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pharatī"
      },
      "ti pattharati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhimuccatī"
      },
      "ti jānāti."
    ],
    "innerText": "Tipiṭakacūḷābhayatthero panāha – ‘‘maṇiopamme kasiṇapharaṇaṃ viya nikkhopamme sarīrapharaṇaṃ viya dissatī’’ti. Tassa vādaṃ viya aṭṭhakathā nāma natthīti paṭikkhitvā sarīrapharaṇaṃ na sabbakālikaṃ, cattārimāni pharaṇāni avināsetvāva kathetabbanti vuttaṃ. Adhimuccatīti padaṃ pharaṇapadasseva vevacanaṃ, atha vā pharatīti pattharati. Adhimuccatīti jānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "169"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ābhā"
      },
      "tiādīsu ābhādayo nāma pāṭiyekkā devā natthi, tayo parittābhādayo devā ābhā nāma, parittāsubhādayo ca. Subhakiṇhādayo ca subhā nāma. Vehapphalādivārā pākaṭāyeva."
    ],
    "innerText": "169.Ābhātiādīsu ābhādayo nāma pāṭiyekkā devā natthi, tayo parittābhādayo devā ābhā nāma, parittāsubhādayo ca. Subhakiṇhādayo ca subhā nāma. Vehapphalādivārā pākaṭāyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ime tāva pañca dhamme bhāvetvā kāmāvacaresu nibbattatu. Brahmaloke nibbattaṃ pana āsavakkhayañca kathaṃ pāpuṇātīti? Ime pañca dhammā sīlaṃ, so imasmiṃ sīle patiṭṭhāya kasiṇaparikammaṃ katvā tā tā samāpattiyo bhāvetvā rūpībrahmaloke nibbattati, arūpajjhānāni ",
      " nibbattetvā ",
      " arūpībrahmaloke, samāpattipadaṭṭhānaṃ vipassanaṃ vaḍḍhetvā anāgāmiphalaṃ sacchikatvā pañcasu suddhāvāsesu nibbattati. Uparimaggaṃ bhāvetvā āsavakkhayaṃ pāpuṇātīti."
    ],
    "innerText": "Ime tāva pañca dhamme bhāvetvā kāmāvacaresu nibbattatu. Brahmaloke nibbattaṃ pana āsavakkhayañca kathaṃ pāpuṇātīti? Ime pañca dhammā sīlaṃ, so imasmiṃ sīle patiṭṭhāya kasiṇaparikammaṃ katvā tā tā samāpattiyo bhāvetvā rūpībrahmaloke nibbattati, arūpajjhānāni nibbattetvā arūpībrahmaloke, samāpattipadaṭṭhānaṃ vipassanaṃ vaḍḍhetvā anāgāmiphalaṃ sacchikatvā pañcasu suddhāvāsesu nibbattati. Uparimaggaṃ bhāvetvā āsavakkhayaṃ pāpuṇātīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Papañcasūdaniyā majjhimanikāyaṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṅkhārupapattisuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyavaggavaṇṇanā niṭṭhitā."
  }
]