[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "5. Sammappadhānasaṃyuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Gaṅgāpeyyālavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1-12. Pācīnādisuttadvādasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "651-662"
      },
      ". Sāvatthinidānaṃ ",
      ". Tatra kho bhagavā etadavoca – ‘‘cattārome, bhikkhave, sammappadhānā. Katame cattāro? Idha, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ ",
      " dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ime kho, bhikkhave, cattāro sammappadhānāti’’."
    ],
    "innerText": "651-662. Sāvatthinidānaṃ . Tatra kho bhagavā etadavoca – ‘‘cattārome, bhikkhave, sammappadhānā. Katame cattāro? Idha, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ime kho, bhikkhave, cattāro sammappadhānāti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā; evameva kho, bhikkhave, bhikkhu cattāro sammappadhāne bhāvento cattāro sammappadhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro. Kathañca, bhikkhave, bhikkhu cattāro sammappadhāne bhāvento cattāro sammappadhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro? Idha ",
      ", bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya ",
      " vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Evaṃ kho, bhikkhave, bhikkhu cattāro sammappadhāne bhāvento cattāro sammappadhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro’’ti. Dvādasamaṃ. (Sammappadhānasaṃyuttassa gaṅgāpeyyālī sammappadhānavasena vitthāretabbā)."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā; evameva kho, bhikkhave, bhikkhu cattāro sammappadhāne bhāvento cattāro sammappadhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro. Kathañca, bhikkhave, bhikkhu cattāro sammappadhāne bhāvento cattāro sammappadhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro? Idha , bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Evaṃ kho, bhikkhave, bhikkhu cattāro sammappadhāne bhāvento cattāro sammappadhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro’’ti. Dvādasamaṃ. (Sammappadhānasaṃyuttassa gaṅgāpeyyālī sammappadhānavasena vitthāretabbā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Gaṅgāpeyyālavaggo paṭhamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Cha ",
      " pācīnato ninnā, cha ninnā ca samuddato;"
    ],
    "innerText": "Cha pācīnato ninnā, cha ninnā ca samuddato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dvete cha dvādasa honti, vaggo tena pavuccatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Appamādavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "(Appamādavaggo sammappadhānavasena vitthāretabbo)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tathāgataṃ padaṃ kūṭaṃ, mūlaṃ sārena vassikaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rājā candimasūriyā, vatthena dasamaṃ padanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Balakaraṇīyavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1-12. Balakaraṇīyādisuttadvādasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "673-684"
      },
      ". ‘‘Seyyathāpi ",
      ", bhikkhave, ye keci balakaraṇīyā kammantā kayiranti, sabbe ",
      " te pathaviṃ nissāya pathaviyaṃ patiṭṭhāya evamete balakaraṇīyā kammantā kayiranti; evameva kho, bhikkhave, bhikkhu sīlaṃ ",
      " nissāya sīle patiṭṭhāya cattāro sammappadhāne bhāveti, cattāro sammappadhāne bahulīkaroti. Kathañca, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya cattāro sammappadhāne bhāveti, cattāro sammappadhāne bahulīkaroti? Idha, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Evaṃ kho, bhikkhave, bhikkhu sīlaṃ nissāya ",
      " sīle patiṭṭhāya cattāro sammappadhāne bhāveti, cattāro sammappadhāne bahulīkarotī’’ti. (Evaṃ balakaraṇīyavaggo sammappadhānavasena vitthāretabbo). Dvādasamaṃ."
    ],
    "innerText": "673-684. ‘‘Seyyathāpi , bhikkhave, ye keci balakaraṇīyā kammantā kayiranti, sabbe te pathaviṃ nissāya pathaviyaṃ patiṭṭhāya evamete balakaraṇīyā kammantā kayiranti; evameva kho, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya cattāro sammappadhāne bhāveti, cattāro sammappadhāne bahulīkaroti. Kathañca, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya cattāro sammappadhāne bhāveti, cattāro sammappadhāne bahulīkaroti? Idha, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Evaṃ kho, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya cattāro sammappadhāne bhāveti, cattāro sammappadhāne bahulīkarotī’’ti. (Evaṃ balakaraṇīyavaggo sammappadhānavasena vitthāretabbo). Dvādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Balakaraṇīyavaggo tatiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Balaṃ bījañca nāgo ca, rukkho kumbhena sūkiyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ākāsena ca dve meghā, nāvā āgantukā nadīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4. Esanāvaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1-10. Esanādisuttadasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "685-694"
      },
      ". ‘‘Tisso imā, bhikkhave, esanā. Katamā tisso? Kāmesanā, bhavesanā, brahmacariyesanā – imā kho, bhikkhave, tisso esanā. Imāsaṃ ",
      " kho, bhikkhave, tissannaṃ esanānaṃ abhiññāya pariññāya parikkhayāya pahānāya cattāro sammappadhānā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu anuppannānaṃ…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati ",
      " cittaṃ paggaṇhāti padahati. Imāsaṃ kho, bhikkhave, tissannaṃ esanānaṃ ",
      " abhiññāya pariññāya parikkhayāya pahānāya ime cattāro sammappadhānā bhāvetabbā’’ti. (Vitthāretabbaṃ). Dasamaṃ."
    ],
    "innerText": "685-694. ‘‘Tisso imā, bhikkhave, esanā. Katamā tisso? Kāmesanā, bhavesanā, brahmacariyesanā – imā kho, bhikkhave, tisso esanā. Imāsaṃ kho, bhikkhave, tissannaṃ esanānaṃ abhiññāya pariññāya parikkhayāya pahānāya cattāro sammappadhānā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu anuppannānaṃ…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Imāsaṃ kho, bhikkhave, tissannaṃ esanānaṃ abhiññāya pariññāya parikkhayāya pahānāya ime cattāro sammappadhānā bhāvetabbā’’ti. (Vitthāretabbaṃ). Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Esanāvaggo catuttho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Esanā vidhā āsavo, bhavo ca dukkhatā tisso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khilaṃ malañca nīgho ca, vedanā taṇhā tasinā cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "5. Oghavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1-10. Oghādisuttadasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "695-704"
      },
      ". ‘‘Pañcimāni ",
      ", bhikkhave, uddhambhāgiyāni saṃyojanāni. Katamāni pañca? Rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā – imāni kho, bhikkhave, pañcuddhambhāgiyāni saṃyojanāni. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya cattāro sammappadhānā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu anuppannānaṃ…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti ",
      " vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya ime cattāro sammappadhānā bhāvetabbā’’ti. (Vitthāretabbā). Dasamaṃ."
    ],
    "innerText": "695-704. ‘‘Pañcimāni , bhikkhave, uddhambhāgiyāni saṃyojanāni. Katamāni pañca? Rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā – imāni kho, bhikkhave, pañcuddhambhāgiyāni saṃyojanāni. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya cattāro sammappadhānā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu anuppannānaṃ…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya ime cattāro sammappadhānā bhāvetabbā’’ti. (Vitthāretabbā). Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Oghavaggo pañcamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ogho yogo upādānaṃ, ganthā anusayena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kāmaguṇā nīvaraṇā, khandhā oruddhambhāgiyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sammappadhānasaṃyuttaṃ pañcamaṃ."
  }
]