[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "10. Bhikkhusaṃyuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Kolitasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "235"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho āyasmā mahāmoggallāno bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato mahāmoggallānassa paccassosuṃ."
    ],
    "innerText": "235. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho āyasmā mahāmoggallāno bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato mahāmoggallānassa paccassosuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Āyasmā mahāmoggallāno etadavoca – ‘‘idha mayhaṃ, āvuso, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘ariyo tuṇhībhāvo, ariyo tuṇhībhāvoti vuccati. Katamo nu kho ariyo tuṇhībhāvo’ti? Tassa mayhaṃ āvuso, etadahosi – ‘idha bhikkhu vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Ayaṃ vuccati ariyo tuṇhībhāvo’ti. So khvāhaṃ, āvuso, vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja vihariṃ. Tassa mayhaṃ, āvuso, iminā vihārena viharato vitakkasahagatā saññā manasikārā samudācaranti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna, mā, brāhmaṇa, ariyaṃ tuṇhībhāvaṃ pamādo, ariye tuṇhībhāve cittaṃ saṇṭhapehi, ariye tuṇhībhāve cittaṃ ekodibhāvaṃ karohi, ariye tuṇhībhāve cittaṃ ",
      " samādahā’ti. So khvāhaṃ, āvuso, aparena samayena vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharāmi. Yañhi ",
      " taṃ, āvuso ",
      ", sammā vadamāno vadeyya – ‘satthārā anuggahito sāvako mahābhiññataṃ patto’ti, mamaṃ taṃ sammā vadamāno vadeyya – ‘satthārā anuggahito sāvako mahābhiññataṃ patto’’’ti. Paṭhamaṃ."
    ],
    "innerText": "‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna, mā, brāhmaṇa, ariyaṃ tuṇhībhāvaṃ pamādo, ariye tuṇhībhāve cittaṃ saṇṭhapehi, ariye tuṇhībhāve cittaṃ ekodibhāvaṃ karohi, ariye tuṇhībhāve cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharāmi. Yañhi taṃ, āvuso , sammā vadamāno vadeyya – ‘satthārā anuggahito sāvako mahābhiññataṃ patto’ti, mamaṃ taṃ sammā vadamāno vadeyya – ‘satthārā anuggahito sāvako mahābhiññataṃ patto’’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Upatissasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "236"
      },
      ". Sāvatthiyaṃ ",
      " viharati. Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca –"
    ],
    "innerText": "236. Sāvatthiyaṃ viharati. Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha mayhaṃ, āvuso, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘atthi nu kho taṃ kiñci lokasmiṃ yassa me vipariṇāmaññathābhāvā uppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’ti? Tassa mayhaṃ, āvuso, etadahosi – ‘natthi kho taṃ kiñci lokasmiṃ yassa me vipariṇāmaññathābhāvā uppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vutte, āyasmā ānando āyasmantaṃ sāriputtaṃ etadavoca – ‘‘satthupi kho te, āvuso sāriputta, vipariṇāmaññathābhāvā nuppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’’ti? ‘‘Satthupi kho me, āvuso, vipariṇāmaññathābhāvā nuppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā, api ca me evamassa – ‘mahesakkho vata, bho, satthā ",
      " antarahito mahiddhiko mahānubhāvo. Sace hi bhagavā ciraṃ dīghamaddhānaṃ tiṭṭheyya tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’nti. Tathā ",
      " hi panāyasmato sāriputtassa dīgharattaṃ ahaṅkāramamaṅkāramānānusayā susamūhatā. Tasmā āyasmato sāriputtassa satthupi vipariṇāmaññathābhāvā nuppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’’ti. Dutiyaṃ."
    ],
    "innerText": "Evaṃ vutte, āyasmā ānando āyasmantaṃ sāriputtaṃ etadavoca – ‘‘satthupi kho te, āvuso sāriputta, vipariṇāmaññathābhāvā nuppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’’ti? ‘‘Satthupi kho me, āvuso, vipariṇāmaññathābhāvā nuppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā, api ca me evamassa – ‘mahesakkho vata, bho, satthā antarahito mahiddhiko mahānubhāvo. Sace hi bhagavā ciraṃ dīghamaddhānaṃ tiṭṭheyya tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’nti. Tathā hi panāyasmato sāriputtassa dīgharattaṃ ahaṅkāramamaṅkāramānānusayā susamūhatā. Tasmā āyasmato sāriputtassa satthupi vipariṇāmaññathābhāvā nuppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Ghaṭasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "237"
      },
      ". Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āyasmā ca sāriputto āyasmā ca mahāmoggallāno ",
      " rājagahe viharanti veḷuvane kalandakanivāpe ekavihāre. Atha kho āyasmā sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmatā mahāmoggallānena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ ",
      " nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ mahāmoggallānaṃ etadavoca –"
    ],
    "innerText": "237. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āyasmā ca sāriputto āyasmā ca mahāmoggallāno rājagahe viharanti veḷuvane kalandakanivāpe ekavihāre. Atha kho āyasmā sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmatā mahāmoggallānena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ mahāmoggallānaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Vippasannāni kho te, āvuso moggallāna, indriyāni; parisuddho mukhavaṇṇo pariyodāto santena nūnāyasmā mahāmoggallāno ajja vihārena vihāsī’’ti. ‘‘Oḷārikena khvāhaṃ, āvuso, ajja vihārena vihāsiṃ. Api ca, me ahosi dhammī kathā’’ti. ‘‘Kena saddhiṃ panāyasmato mahāmoggallānassa ahosi dhammī kathā’’ti? ‘‘Bhagavatā ",
      " kho me, āvuso, saddhiṃ ahosi dhammī kathā’’ti. ‘‘Dūre kho, āvuso, bhagavā etarahi sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Kiṃ nu kho, āyasmā, mahāmoggallāno bhagavantaṃ iddhiyā upasaṅkami; udāhu bhagavā āyasmantaṃ mahāmoggallānaṃ iddhiyā upasaṅkamī’’ti? ‘‘Na ",
      " khvāhaṃ, āvuso, bhagavantaṃ iddhiyā upasaṅkamiṃ; napi maṃ bhagavā iddhiyā upasaṅkami. Api ca, me yāvatā bhagavā ettāvatā dibbacakkhu visujjhi dibbā ca sotadhātu. Bhagavatopi yāvatāhaṃ ettāvatā dibbacakkhu visujjhi dibbā ca sotadhātū’’ti. ‘‘Yathākathaṃ panāyasmato mahāmoggallānassa bhagavatā saddhiṃ ahosi dhammī kathā’’ti?"
    ],
    "innerText": "‘‘Vippasannāni kho te, āvuso moggallāna, indriyāni; parisuddho mukhavaṇṇo pariyodāto santena nūnāyasmā mahāmoggallāno ajja vihārena vihāsī’’ti. ‘‘Oḷārikena khvāhaṃ, āvuso, ajja vihārena vihāsiṃ. Api ca, me ahosi dhammī kathā’’ti. ‘‘Kena saddhiṃ panāyasmato mahāmoggallānassa ahosi dhammī kathā’’ti? ‘‘Bhagavatā kho me, āvuso, saddhiṃ ahosi dhammī kathā’’ti. ‘‘Dūre kho, āvuso, bhagavā etarahi sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Kiṃ nu kho, āyasmā, mahāmoggallāno bhagavantaṃ iddhiyā upasaṅkami; udāhu bhagavā āyasmantaṃ mahāmoggallānaṃ iddhiyā upasaṅkamī’’ti? ‘‘Na khvāhaṃ, āvuso, bhagavantaṃ iddhiyā upasaṅkamiṃ; napi maṃ bhagavā iddhiyā upasaṅkami. Api ca, me yāvatā bhagavā ettāvatā dibbacakkhu visujjhi dibbā ca sotadhātu. Bhagavatopi yāvatāhaṃ ettāvatā dibbacakkhu visujjhi dibbā ca sotadhātū’’ti. ‘‘Yathākathaṃ panāyasmato mahāmoggallānassa bhagavatā saddhiṃ ahosi dhammī kathā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idhāhaṃ, āvuso, bhagavantaṃ etadavocaṃ – ‘āraddhavīriyo āraddhavīriyoti, bhante, vuccati. Kittāvatā nu kho, bhante, āraddhavīriyo hotī’ti? Evaṃ vutte, maṃ, āvuso, bhagavā etadavoca – ‘idha, moggallāna, bhikkhu āraddhavīriyo viharati – kāmaṃ taco ca nhāru ca aṭṭhī ca avasissatu, sarīre upasussatu maṃsalohitaṃ, yaṃ taṃ purisathāmena purisavīriyena purisaparakkamena pattabbaṃ na taṃ apāpuṇitvā vīriyassa saṇṭhānaṃ bhavissatīti. Evaṃ kho, moggallāna, āraddhavīriyo hotī’ti. Evaṃ kho me, āvuso, bhagavatā saddhiṃ ahosi dhammī kathā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, āvuso, himavato pabbatarājassa parittā pāsāṇasakkharā ",
      " yāvadeva upanikkhepanamattāya ",
      "; evameva kho mayaṃ āyasmato mahāmoggallānassa yāvadeva upanikkhepanamattāya. Āyasmā hi mahāmoggallāno mahiddhiko mahānubhāvo ākaṅkhamāno kappaṃ tiṭṭheyyā’’ti."
    ],
    "innerText": "‘‘Seyyathāpi, āvuso, himavato pabbatarājassa parittā pāsāṇasakkharā yāvadeva upanikkhepanamattāya ; evameva kho mayaṃ āyasmato mahāmoggallānassa yāvadeva upanikkhepanamattāya. Āyasmā hi mahāmoggallāno mahiddhiko mahānubhāvo ākaṅkhamāno kappaṃ tiṭṭheyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi ",
      ", āvuso, mahatiyā loṇaghaṭāya parittā loṇasakkharāya yāvadeva upanikkhepanamattāya; evameva kho mayaṃ āyasmato sāriputtassa yāvadeva upanikkhepanamattāya. Āyasmā ",
      " hi sāriputto bhagavatā anekapariyāyena thomito vaṇṇito pasattho –"
    ],
    "innerText": "‘‘Seyyathāpi , āvuso, mahatiyā loṇaghaṭāya parittā loṇasakkharāya yāvadeva upanikkhepanamattāya; evameva kho mayaṃ āyasmato sāriputtassa yāvadeva upanikkhepanamattāya. Āyasmā hi sāriputto bhagavatā anekapariyāyena thomito vaṇṇito pasattho –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sāriputtova paññāya, sīlena upasamena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yopi pāraṅgato bhikkhu, etāvaparamo siyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Itiha te ubho mahānāgā aññamaññassa subhāsitaṃ sulapitaṃ samanumodiṃsūti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Navasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "238"
      },
      ". Sāvatthiyaṃ viharati. Tena kho pana samayena aññataro navo bhikkhu pacchābhattaṃ piṇḍapātapaṭikkanto vihāraṃ pavisitvā appossukko tuṇhībhūto saṅkasāyati, na bhikkhūnaṃ veyyāvaccaṃ karoti cīvarakārasamaye. Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha ",
      ", bhante, aññataro navo bhikkhu pacchābhattaṃ piṇḍapātapaṭikkanto vihāraṃ pavisitvā appossukko tuṇhībhūto saṅkasāyati, na bhikkhūnaṃ veyyāvaccaṃ karoti cīvarakārasamaye’’ti."
    ],
    "innerText": "238. Sāvatthiyaṃ viharati. Tena kho pana samayena aññataro navo bhikkhu pacchābhattaṃ piṇḍapātapaṭikkanto vihāraṃ pavisitvā appossukko tuṇhībhūto saṅkasāyati, na bhikkhūnaṃ veyyāvaccaṃ karoti cīvarakārasamaye. Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha , bhante, aññataro navo bhikkhu pacchābhattaṃ piṇḍapātapaṭikkanto vihāraṃ pavisitvā appossukko tuṇhībhūto saṅkasāyati, na bhikkhūnaṃ veyyāvaccaṃ karoti cīvarakārasamaye’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā aññataraṃ bhikkhuṃ āmantesi – ‘‘ehi tvaṃ, bhikkhu, mama vacanena taṃ bhikkhuṃ āmantehi ‘satthā taṃ, āvuso, āmantetī’’’ti. ‘‘Evaṃ bhante’’ti kho so bhikkhu bhagavato paṭissutvā yena so bhikkhu tenupasaṅkami; upasaṅkamitvā taṃ bhikkhuṃ etadavoca – ‘‘satthā taṃ, āvuso, āmantetī’’ti. ‘‘Evamāvuso’’ti kho so bhikkhu tassa bhikkhuno paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi ",
      ". Ekamantaṃ ",
      " nisinnaṃ kho taṃ bhikkhuṃ bhagavā etadavoca – ‘‘saccaṃ kira tvaṃ, bhikkhu, pacchābhattaṃ piṇḍapātapaṭikkanto vihāraṃ pavisitvā appossukko tuṇhībhūto saṅkasāyasi, na bhikkhūnaṃ veyyāvaccaṃ karosi cīvarakārasamaye’’ti? ‘‘Ahampi kho, bhante, sakaṃ kiccaṃ karomī’’ti."
    ],
    "innerText": "Atha kho bhagavā aññataraṃ bhikkhuṃ āmantesi – ‘‘ehi tvaṃ, bhikkhu, mama vacanena taṃ bhikkhuṃ āmantehi ‘satthā taṃ, āvuso, āmantetī’’’ti. ‘‘Evaṃ bhante’’ti kho so bhikkhu bhagavato paṭissutvā yena so bhikkhu tenupasaṅkami; upasaṅkamitvā taṃ bhikkhuṃ etadavoca – ‘‘satthā taṃ, āvuso, āmantetī’’ti. ‘‘Evamāvuso’’ti kho so bhikkhu tassa bhikkhuno paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi . Ekamantaṃ nisinnaṃ kho taṃ bhikkhuṃ bhagavā etadavoca – ‘‘saccaṃ kira tvaṃ, bhikkhu, pacchābhattaṃ piṇḍapātapaṭikkanto vihāraṃ pavisitvā appossukko tuṇhībhūto saṅkasāyasi, na bhikkhūnaṃ veyyāvaccaṃ karosi cīvarakārasamaye’’ti? ‘‘Ahampi kho, bhante, sakaṃ kiccaṃ karomī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho bhagavā tassa bhikkhuno cetasā cetoparivitakkamaññāya bhikkhū āmantesi – ‘‘mā kho tumhe, bhikkhave, etassa bhikkhuno ujjhāyittha. Eso kho, bhikkhave, bhikkhu catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī, yassa catthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā ",
      " sacchikatvā upasampajja viharatī’’ti."
    ],
    "innerText": "Atha kho bhagavā tassa bhikkhuno cetasā cetoparivitakkamaññāya bhikkhū āmantesi – ‘‘mā kho tumhe, bhikkhave, etassa bhikkhuno ujjhāyittha. Eso kho, bhikkhave, bhikkhu catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī, yassa catthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nayidaṃ sithilamārabbha, nayidaṃ appena thāmasā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nibbānaṃ adhigantabbaṃ, sabbadukkhappamocanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ayañca daharo bhikkhu, ayamuttamapuriso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhāreti antimaṃ dehaṃ, jetvā māraṃ savāhini’’nti. catutthaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Sujātasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "239"
      },
      ". Sāvatthiyaṃ viharati. Atha kho āyasmā sujāto yena bhagavā tenupasaṅkami. Addasā kho bhagavā āyasmantaṃ sujātaṃ dūratova āgacchantaṃ. Disvāna bhikkhū āmantesi – ‘‘ubhayenevāyaṃ, bhikkhave, kulaputto sobhati – yañca ",
      " abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato, yassa catthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajjanti tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Idamavoca bhagavā…pe… satthā –"
    ],
    "innerText": "239. Sāvatthiyaṃ viharati. Atha kho āyasmā sujāto yena bhagavā tenupasaṅkami. Addasā kho bhagavā āyasmantaṃ sujātaṃ dūratova āgacchantaṃ. Disvāna bhikkhū āmantesi – ‘‘ubhayenevāyaṃ, bhikkhave, kulaputto sobhati – yañca abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato, yassa catthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajjanti tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Idamavoca bhagavā…pe… satthā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Sobhati ",
      " vatāyaṃ bhikkhu, ujubhūtena cetasā;"
    ],
    "innerText": "‘‘Sobhati vatāyaṃ bhikkhu, ujubhūtena cetasā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Vippayutto visaṃyutto, anupādāya nibbuto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhāreti antimaṃ dehaṃ, jetvā māraṃ savāhini’’nti. pañcamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Lakuṇḍakabhaddiyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "240"
      },
      ". Sāvatthiyaṃ ",
      " viharati. Atha kho āyasmā lakuṇḍakabhaddiyo yena bhagavā tenupasaṅkami. Addasā kho bhagavā āyasmantaṃ lakuṇḍakabhaddiyaṃ dūratova āgacchantaṃ. Disvāna bhikkhū āmantesi – ‘‘passatha no tumhe, bhikkhave, etaṃ bhikkhuṃ āgacchantaṃ dubbaṇṇaṃ duddasikaṃ okoṭimakaṃ bhikkhūnaṃ paribhūtarūpa’’nti? ‘‘Evaṃ, bhante’’. ‘‘Eso kho, bhikkhave, bhikkhu mahiddhiko mahānubhāvo, na ca sā samāpatti sulabharūpā yā tena bhikkhunā asamāpannapubbā. Yassa catthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Idamavoca bhagavā…pe… satthā –"
    ],
    "innerText": "240. Sāvatthiyaṃ viharati. Atha kho āyasmā lakuṇḍakabhaddiyo yena bhagavā tenupasaṅkami. Addasā kho bhagavā āyasmantaṃ lakuṇḍakabhaddiyaṃ dūratova āgacchantaṃ. Disvāna bhikkhū āmantesi – ‘‘passatha no tumhe, bhikkhave, etaṃ bhikkhuṃ āgacchantaṃ dubbaṇṇaṃ duddasikaṃ okoṭimakaṃ bhikkhūnaṃ paribhūtarūpa’’nti? ‘‘Evaṃ, bhante’’. ‘‘Eso kho, bhikkhave, bhikkhu mahiddhiko mahānubhāvo, na ca sā samāpatti sulabharūpā yā tena bhikkhunā asamāpannapubbā. Yassa catthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Idamavoca bhagavā…pe… satthā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Haṃsā koñcā mayūrā ca, hatthayo pasadā migā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbe sīhassa bhāyanti, natthi kāyasmiṃ tulyatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Evameva manussesu, daharo cepi paññavā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "So hi tattha mahā hoti, neva bālo sarīravā’’ti. chaṭṭhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Visākhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "241"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Tena kho pana samayena āyasmā visākho pañcālaputto upaṭṭhānasālāyaṃ bhikkhū dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti, poriyā vācāya vissaṭṭhāya ",
      " anelagalāya atthassa viññāpaniyā pariyāpannāya anissitāya."
    ],
    "innerText": "241. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Tena kho pana samayena āyasmā visākho pañcālaputto upaṭṭhānasālāyaṃ bhikkhū dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti, poriyā vācāya vissaṭṭhāya anelagalāya atthassa viññāpaniyā pariyāpannāya anissitāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena upaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā ",
      " paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘ko nu kho, bhikkhave, upaṭṭhānasālāyaṃ bhikkhū dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti poriyā vācāya vissaṭṭhāya anelagalāya atthassa viññāpaniyā pariyāpannāya anissitāyā’’ti? ‘‘Āyasmā, bhante, visākho ",
      " pañcālaputto upaṭṭhānasālāyaṃ bhikkhū dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti, poriyā vācāya vissaṭṭhāya anelagalāya atthassa viññāpaniyā pariyāpannāya anissitāyā’’ti."
    ],
    "innerText": "Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena upaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘ko nu kho, bhikkhave, upaṭṭhānasālāyaṃ bhikkhū dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti poriyā vācāya vissaṭṭhāya anelagalāya atthassa viññāpaniyā pariyāpannāya anissitāyā’’ti? ‘‘Āyasmā, bhante, visākho pañcālaputto upaṭṭhānasālāyaṃ bhikkhū dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti, poriyā vācāya vissaṭṭhāya anelagalāya atthassa viññāpaniyā pariyāpannāya anissitāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho bhagavā āyasmantaṃ visākhaṃ pañcālaputtaṃ āmantesi – ‘‘sādhu sādhu, visākha, sādhu kho tvaṃ, visākha, bhikkhū dhammiyā kathāya sandassesi…pe… atthassa viññāpaniyā pariyāpannāya anissitāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nābhāsamānaṃ jānanti, missaṃ bālehi paṇḍitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhāsamānañca jānanti, desentaṃ amataṃ padaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Bhāsaye jotaye dhammaṃ, paggaṇhe isinaṃ dhajaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Subhāsitadhajā isayo, dhammo hi isinaṃ dhajo’’ti. sattamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Nandasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "242"
      },
      ". Sāvatthiyaṃ ",
      " viharati. Atha kho āyasmā nando bhagavato mātucchāputto ākoṭitapaccākoṭitāni cīvarāni pārupitvā akkhīni añjetvā acchaṃ pattaṃ gahetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ nandaṃ bhagavā etadavoca – ‘‘na kho te taṃ, nanda, patirūpaṃ kulaputtassa saddhā agārasmā anagāriyaṃ pabbajitassa, yaṃ tvaṃ ākoṭitapaccākoṭitāni cīvarāni pārupeyyāsi, akkhīni ca añjeyyāsi, acchañca pattaṃ dhāreyyāsi. Etaṃ kho te, nanda, patirūpaṃ kulaputtassa saddhā agārasmā anagāriyaṃ pabbajitassa, yaṃ tvaṃ āraññiko ",
      " ca assasi, piṇḍapātiko ca paṃsukuliko ca kāmesu ca anapekkho vihareyyāsī’’ti. Idamavoca bhagavā…pe… satthā –"
    ],
    "innerText": "242. Sāvatthiyaṃ viharati. Atha kho āyasmā nando bhagavato mātucchāputto ākoṭitapaccākoṭitāni cīvarāni pārupitvā akkhīni añjetvā acchaṃ pattaṃ gahetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ nandaṃ bhagavā etadavoca – ‘‘na kho te taṃ, nanda, patirūpaṃ kulaputtassa saddhā agārasmā anagāriyaṃ pabbajitassa, yaṃ tvaṃ ākoṭitapaccākoṭitāni cīvarāni pārupeyyāsi, akkhīni ca añjeyyāsi, acchañca pattaṃ dhāreyyāsi. Etaṃ kho te, nanda, patirūpaṃ kulaputtassa saddhā agārasmā anagāriyaṃ pabbajitassa, yaṃ tvaṃ āraññiko ca assasi, piṇḍapātiko ca paṃsukuliko ca kāmesu ca anapekkho vihareyyāsī’’ti. Idamavoca bhagavā…pe… satthā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kadāhaṃ nandaṃ passeyyaṃ, āraññaṃ paṃsukūlikaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aññātuñchena yāpentaṃ, kāmesu anapekkhina’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho āyasmā nando aparena samayena āraññiko ca piṇḍapātiko ca paṃsukūliko ca kāmesu ca anapekkho vihāsīti. Aṭṭhamaṃ."
    ],
    "innerText": "Atha kho āyasmā nando aparena samayena āraññiko ca piṇḍapātiko ca paṃsukūliko ca kāmesu ca anapekkho vihāsīti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Tissasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "243"
      },
      ". Sāvatthiyaṃ viharati. Atha ",
      " kho āyasmā tisso bhagavato pitucchāputto yena bhagavā tenupasaṅkami ",
      "; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi dukkhī dummano assūni pavattayamāno. Atha kho bhagavā āyasmantaṃ tissaṃ etadavoca – ‘‘kiṃ nu kho tvaṃ, tissa, ekamantaṃ nisinno dukkhī dummano assūni pavattayamāno’’ti? ‘‘Tathā hi pana maṃ, bhante, bhikkhū samantā vācāsannitodakena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vācāya sannitodakena (ka.)]"
      },
      " sañjambharimakaṃsū’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sañjabbharimakaṃsūti (?)]"
      },
      ". ‘‘Tathāhi pana tvaṃ, tissa, vattā no ca vacanakkhamo; na kho te taṃ, tissa, patirūpaṃ kulaputtassa saddhā agārasmā anagāriyaṃ pabbajitassa, yaṃ tvaṃ vattā no ca vacanakkhamo. Etaṃ kho te, tissa, patirūpaṃ kulaputtassa saddhā agārasmā anagāriyaṃ pabbajitassa – ‘yaṃ tvaṃ vattā ca assa vacanakkhamo cā’’’ti."
    ],
    "innerText": "243. Sāvatthiyaṃ viharati. Atha kho āyasmā tisso bhagavato pitucchāputto yena bhagavā tenupasaṅkami ; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi dukkhī dummano assūni pavattayamāno. Atha kho bhagavā āyasmantaṃ tissaṃ etadavoca – ‘‘kiṃ nu kho tvaṃ, tissa, ekamantaṃ nisinno dukkhī dummano assūni pavattayamāno’’ti? ‘‘Tathā hi pana maṃ, bhante, bhikkhū samantā vācāsannitodakena [vācāya sannitodakena (ka.)] sañjambharimakaṃsū’’ti [sañjabbharimakaṃsūti (?)]. ‘‘Tathāhi pana tvaṃ, tissa, vattā no ca vacanakkhamo; na kho te taṃ, tissa, patirūpaṃ kulaputtassa saddhā agārasmā anagāriyaṃ pabbajitassa, yaṃ tvaṃ vattā no ca vacanakkhamo. Etaṃ kho te, tissa, patirūpaṃ kulaputtassa saddhā agārasmā anagāriyaṃ pabbajitassa – ‘yaṃ tvaṃ vattā ca assa vacanakkhamo cā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kiṃ nu kujjhasi mā kujjhi, akkodho tissa te varaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kodhamānamakkhavinayatthañhi, tissa brahmacariyaṃ vussatī’’ti. navamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Theranāmakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "244"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena aññataro bhikkhu theranāmako ekavihārī ceva hoti ekavihārassa ca vaṇṇavādī. So eko gāmaṃ piṇḍāya pavisati eko paṭikkamati eko raho nisīdati eko caṅkamaṃ adhiṭṭhāti. Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu ",
      "; ",
      " upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho ",
      " te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, aññataro bhikkhu theranāmako ekavihārī ekavihārassa ca vaṇṇavādī’’ti."
    ],
    "innerText": "244. Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena aññataro bhikkhu theranāmako ekavihārī ceva hoti ekavihārassa ca vaṇṇavādī. So eko gāmaṃ piṇḍāya pavisati eko paṭikkamati eko raho nisīdati eko caṅkamaṃ adhiṭṭhāti. Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu ; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, aññataro bhikkhu theranāmako ekavihārī ekavihārassa ca vaṇṇavādī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho bhagavā aññataraṃ bhikkhuṃ āmantesi – ‘‘ehi tvaṃ, bhikkhu, mama vacanena theraṃ bhikkhuṃ āmantehi – ‘satthā taṃ, āvuso thera, āmantetī’’’ti. ‘‘Evaṃ, bhante’’ti kho so bhikkhu bhagavato paṭissutvā yenāyasmā thero tenupasaṅkami; upasaṅkamitvā āyasmantaṃ theraṃ etadavoca – ‘‘satthā taṃ, āvuso thera, āmantetī’’ti. ‘‘Evamāvuso’’ti kho āyasmā thero tassa bhikkhuno paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ theraṃ bhagavā etadavoca – ‘‘saccaṃ kira tvaṃ, thera, ekavihārī ekavihārassa ca vaṇṇavādī’’ti? ‘‘Evaṃ, bhante’’. ‘‘Yathā kathaṃ pana tvaṃ, thera, ekavihārī ekavihārassa ca vaṇṇavādī’’ti? ‘‘Idhāhaṃ, bhante, eko gāmaṃ piṇḍāya pavisāmi eko paṭikkamāmi eko raho nisīdāmi eko caṅkamaṃ adhiṭṭhāmi. Evaṃ khvāhaṃ, bhante, ekavihārī ekavihārassa ca vaṇṇavādī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Attheso, thera, ekavihāro neso natthīti vadāmi. Api ca, thera, yathā ekavihāro vitthārena paripuṇṇo hoti taṃ suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho…pe…. ‘‘Kathañca ",
      ", thera, ekavihāro vitthārena paripuṇṇo hoti. Idha, thera, yaṃ atītaṃ taṃ pahīnaṃ, yaṃ anāgataṃ taṃ paṭinissaṭṭhaṃ, paccuppannesu ca attabhāvapaṭilābhesu chandarāgo suppaṭivinīto. Evaṃ kho, thera, ekavihāro vitthārena paripuṇṇo hotī’’ti."
    ],
    "innerText": "‘‘Attheso, thera, ekavihāro neso natthīti vadāmi. Api ca, thera, yathā ekavihāro vitthārena paripuṇṇo hoti taṃ suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho…pe…. ‘‘Kathañca , thera, ekavihāro vitthārena paripuṇṇo hoti. Idha, thera, yaṃ atītaṃ taṃ pahīnaṃ, yaṃ anāgataṃ taṃ paṭinissaṭṭhaṃ, paccuppannesu ca attabhāvapaṭilābhesu chandarāgo suppaṭivinīto. Evaṃ kho, thera, ekavihāro vitthārena paripuṇṇo hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idamavoca ",
      " bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā –"
    ],
    "innerText": "Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Sabbābhibhuṃ ",
      " sabbaviduṃ sumedhaṃ,"
    ],
    "innerText": "‘‘Sabbābhibhuṃ sabbaviduṃ sumedhaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sabbesu dhammesu anūpalittaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Sabbañjahaṃ taṇhākkhaye vimuttaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tamahaṃ naraṃ ekavihārīti brūmī’’ti. dasamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Mahākappinasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "245"
      },
      ". Sāvatthiyaṃ ",
      " viharati. Atha kho āyasmā mahākappino yena bhagavā tenupasaṅkami. Addasā kho bhagavā āyasmantaṃ mahākappinaṃ dūratova āgacchantaṃ. Disvāna bhikkhū āmantesi – ‘‘passatha no tumhe bhikkhave, etaṃ bhikkhuṃ āgacchantaṃ odātakaṃ tanukaṃ tuṅganāsika’’nti? ‘‘Evaṃ, bhante’’. ‘‘Eso kho, bhikkhave, bhikkhu mahiddhiko mahānubhāvo. Na ca sā samāpatti sulabharūpā yā tena bhikkhunā asamāpannapubbā. Yassa catthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti tadanuttaraṃ brahmacariyapariyosānaṃ ",
      " diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti."
    ],
    "innerText": "245. Sāvatthiyaṃ viharati. Atha kho āyasmā mahākappino yena bhagavā tenupasaṅkami. Addasā kho bhagavā āyasmantaṃ mahākappinaṃ dūratova āgacchantaṃ. Disvāna bhikkhū āmantesi – ‘‘passatha no tumhe bhikkhave, etaṃ bhikkhuṃ āgacchantaṃ odātakaṃ tanukaṃ tuṅganāsika’’nti? ‘‘Evaṃ, bhante’’. ‘‘Eso kho, bhikkhave, bhikkhu mahiddhiko mahānubhāvo. Na ca sā samāpatti sulabharūpā yā tena bhikkhunā asamāpannapubbā. Yassa catthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Khattiyo seṭṭho janetasmiṃ, ye gottapaṭisārino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vijjācaraṇasampanno, so seṭṭho devamānuse."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Divā tapati ādicco, rattimābhāti candimā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sannaddho khattiyo tapati, jhāyī tapati brāhmaṇo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Atha sabbamahorattiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[atha sabbamahorattaṃ (sī. syā. kaṃ.)]"
      },
      ", buddho tapati tejasā’’ti. ekādasamaṃ;"
    ],
    "innerText": "Atha sabbamahorattiṃ [atha sabbamahorattaṃ (sī. syā. kaṃ.)], buddho tapati tejasā’’ti. ekādasamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "12. Sahāyakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "246"
      },
      ". Sāvatthiyaṃ ",
      " viharati. Atha kho dve bhikkhū sahāyakā āyasmato mahākappinassa saddhivihārino yena bhagavā tenupasaṅkamiṃsu. Addasā kho bhagavā te bhikkhū dūratova ",
      " āgacchante. Disvāna bhikkhū āmantesi – ‘‘passatha no tumhe, bhikkhave, ete bhikkhū sahāyake āgacchante kappinassa saddhivihārino’’ti? ‘‘Evaṃ, bhante’’. ‘‘Ete kho te bhikkhū mahiddhikā mahānubhāvā. Na ca sā samāpatti sulabharūpā, yā tehi bhikkhūhi asamāpannapubbā. Yassa catthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā ",
      " upasampajja viharantī’’ti."
    ],
    "innerText": "246. Sāvatthiyaṃ viharati. Atha kho dve bhikkhū sahāyakā āyasmato mahākappinassa saddhivihārino yena bhagavā tenupasaṅkamiṃsu. Addasā kho bhagavā te bhikkhū dūratova āgacchante. Disvāna bhikkhū āmantesi – ‘‘passatha no tumhe, bhikkhave, ete bhikkhū sahāyake āgacchante kappinassa saddhivihārino’’ti? ‘‘Evaṃ, bhante’’. ‘‘Ete kho te bhikkhū mahiddhikā mahānubhāvā. Na ca sā samāpatti sulabharūpā, yā tehi bhikkhūhi asamāpannapubbā. Yassa catthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idamavoca ",
      " bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā –"
    ],
    "innerText": "Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sahāyā vatime bhikkhū, cirarattaṃ sametikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sameti nesaṃ saddhammo, dhamme buddhappavedite."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Suvinītā kappinena, dhamme ariyappavedite;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhārenti antimaṃ dehaṃ, jetvā māraṃ savāhini’’nti. dvādasamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhikkhusaṃyuttaṃ samattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kolito upatisso ca, ghaṭo cāpi pavuccati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "children": [
      "Navo ",
      " sujāto bhaddi ca, visākho nando tisso ca;"
    ],
    "innerText": "Navo sujāto bhaddi ca, visākho nando tisso ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Theranāmo ca kappino, sahāyena ca dvādasāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nidānavaggo dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nidānābhisamayadhātu, anamataggena kassapaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sakkārarāhulalakkhaṇo, opamma-bhikkhunā vaggo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyo tena pavuccatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nidānavaggasaṃyuttapāḷi niṭṭhitā."
  }
]