[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "11. Sakkasaṃyuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paṭhamavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Suvīrasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "247"
      },
      ". Sakkasaṃyuttassa ",
      " paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhiyaṃsū"
      },
      "ti kadā abhiyaṃsu? Yadā balavanto ahesuṃ, tadā. Tatrāyaṃ anupubbikathā – sakko kira magadharaṭṭhe macalagāmake magho nāma māṇavo hutvā tettiṃsa purise gahetvā kalyāṇakammaṃ karonto satta vatapadāni pūretvā tattha kālaṅkato devaloke nibbatti. Taṃ balavakammānubhāvena saparisaṃ sesadevatā dasahi ṭhānehi adhigaṇhantaṃ disvā ‘‘āgantukadevaputtā āgatā’’ti nevāsikā gandhapānaṃ sajjayiṃsu. Sakko sakaparisāya saññaṃ adāsi – ‘‘mārisā mā gandhapānaṃ pivittha, pivanākāramattameva dassethā’’ti. Te tattha akaṃsu. Nevāsikadevatā suvaṇṇasarakehi upanītaṃ gandhapānaṃ yāvadatthaṃ pivitvā mattā tattha tattha suvaṇṇapathaviyaṃ patitvā sayiṃsu. Sakko ‘‘gaṇhatha puttahatāya putte’’ti te pādesu gahetvā sinerupāde khipāpesi. Sakkassa puññatejena tadanuvattakāpi sabbe tattheva patiṃsu. Te sineruvemajjhakāle saññaṃ labhitvā, ‘‘tātā na suraṃ pivimha, na suraṃ pivimhā’’ti āhaṃsu. Tato paṭṭhāya asurā nāma jātā. Atha nesaṃ kammapaccayautusamuṭṭhānaṃ sinerussa heṭṭhimatale dasayojanasahassaṃ asurabhavanaṃ nibbatti. Sakko tesaṃ nivattetvā ",
      " anāgamanatthāya ārakkhaṃ ṭhapesi, yaṃ sandhāya vuttaṃ –"
    ],
    "innerText": "247. Sakkasaṃyuttassa paṭhame abhiyaṃsūti kadā abhiyaṃsu? Yadā balavanto ahesuṃ, tadā. Tatrāyaṃ anupubbikathā – sakko kira magadharaṭṭhe macalagāmake magho nāma māṇavo hutvā tettiṃsa purise gahetvā kalyāṇakammaṃ karonto satta vatapadāni pūretvā tattha kālaṅkato devaloke nibbatti. Taṃ balavakammānubhāvena saparisaṃ sesadevatā dasahi ṭhānehi adhigaṇhantaṃ disvā ‘‘āgantukadevaputtā āgatā’’ti nevāsikā gandhapānaṃ sajjayiṃsu. Sakko sakaparisāya saññaṃ adāsi – ‘‘mārisā mā gandhapānaṃ pivittha, pivanākāramattameva dassethā’’ti. Te tattha akaṃsu. Nevāsikadevatā suvaṇṇasarakehi upanītaṃ gandhapānaṃ yāvadatthaṃ pivitvā mattā tattha tattha suvaṇṇapathaviyaṃ patitvā sayiṃsu. Sakko ‘‘gaṇhatha puttahatāya putte’’ti te pādesu gahetvā sinerupāde khipāpesi. Sakkassa puññatejena tadanuvattakāpi sabbe tattheva patiṃsu. Te sineruvemajjhakāle saññaṃ labhitvā, ‘‘tātā na suraṃ pivimha, na suraṃ pivimhā’’ti āhaṃsu. Tato paṭṭhāya asurā nāma jātā. Atha nesaṃ kammapaccayautusamuṭṭhānaṃ sinerussa heṭṭhimatale dasayojanasahassaṃ asurabhavanaṃ nibbatti. Sakko tesaṃ nivattetvā anāgamanatthāya ārakkhaṃ ṭhapesi, yaṃ sandhāya vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Antarā dvinnaṃ ayujjhapurānaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Pañcavidhā ṭhapitā abhirakkhā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Udakaṃ karoṭi-payassa ca hārī,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Madanayutā caturo ca mahatthā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dve ",
      " nagarāni hi yuddhena gahetuṃ asakkuṇeyyatāya ayujjhapurāni nāma jātāni devanagarañca asuranagarañca. Yadā hi asurā balavanto honti, atha devehi palāyitvā devanagaraṃ pavisitvā dvāre pidahite asurānaṃ satasahassampi kiñci kātuṃ na sakkoti. Yadā devā balavanto honti, athāsurehi palāyitvā asuranagarassa dvāre pidahite sakkānaṃ satasahassampi kiñci kātuṃ na sakkoti. Iti imāni dve nagarāni ayujjhapurāni nāma. Nesaṃ antarā etesu udakādīsu pañcasu ṭhānesu sakkena ārakkhā ṭhapitā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "udaka"
      },
      "saddena nāgā gahitā. Te hi udake balavanto honti. Tasmā sinerussa paṭhamālinde tesaṃ ārakkhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Karoṭi"
      },
      "saddena supaṇṇā gahitā. Tesaṃ kira karoṭi nāma pānabhojanaṃ, tena taṃ nāmaṃ labhiṃsu. Dutiyālinde tesaṃ ārakkhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Payassahārī"
      },
      "saddena kumbhaṇḍā gahitā. Dānavarakkhasā kira te. Tatiyālinde tesaṃ ārakkhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Madanayuta"
      },
      "saddena yakkhā gahitā. Visamacārino kirate yujjhasoṇḍā. Catutthālinde tesaṃ ārakkhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Caturo ca mahantā"
      },
      "ti cattāro mahārājāno vuttā. Pañcamālinde tesaṃ ārakkhā. Tasmā yadi asurā kupitāvilacittā devapuraṃ upayanti yuddhesū, yaṃ girino paṭhamaṃ paribhaṇḍaṃ, taṃ uragā paṭibāhanti evaṃ sesesu sesā."
    ],
    "innerText": "Dve nagarāni hi yuddhena gahetuṃ asakkuṇeyyatāya ayujjhapurāni nāma jātāni devanagarañca asuranagarañca. Yadā hi asurā balavanto honti, atha devehi palāyitvā devanagaraṃ pavisitvā dvāre pidahite asurānaṃ satasahassampi kiñci kātuṃ na sakkoti. Yadā devā balavanto honti, athāsurehi palāyitvā asuranagarassa dvāre pidahite sakkānaṃ satasahassampi kiñci kātuṃ na sakkoti. Iti imāni dve nagarāni ayujjhapurāni nāma. Nesaṃ antarā etesu udakādīsu pañcasu ṭhānesu sakkena ārakkhā ṭhapitā. Tattha udakasaddena nāgā gahitā. Te hi udake balavanto honti. Tasmā sinerussa paṭhamālinde tesaṃ ārakkhā. Karoṭisaddena supaṇṇā gahitā. Tesaṃ kira karoṭi nāma pānabhojanaṃ, tena taṃ nāmaṃ labhiṃsu. Dutiyālinde tesaṃ ārakkhā. Payassahārīsaddena kumbhaṇḍā gahitā. Dānavarakkhasā kira te. Tatiyālinde tesaṃ ārakkhā. Madanayutasaddena yakkhā gahitā. Visamacārino kirate yujjhasoṇḍā. Catutthālinde tesaṃ ārakkhā. Caturo ca mahantāti cattāro mahārājāno vuttā. Pañcamālinde tesaṃ ārakkhā. Tasmā yadi asurā kupitāvilacittā devapuraṃ upayanti yuddhesū, yaṃ girino paṭhamaṃ paribhaṇḍaṃ, taṃ uragā paṭibāhanti evaṃ sesesu sesā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Te pana asurā āyuvaṇṇarasaissariyasampattīhi tāvatiṃsasadisāva. Tasmā antarā attānaṃ ajānitvā pāṭaliyā pupphitāya, ‘‘na idaṃ devanagaraṃ, tattha pāricchattako pupphati, idha pana cittapāṭalī, jarasakkenāmhākaṃ ",
      " suraṃ pāyetvā vañcitā, devanagarañca no gahitaṃ, gacchāma tena saddhiṃ yujjhissāmā’’ti hatthiassarathe āruyha suvaṇṇarajatamaṇiphalakāni gahetvā, yuddhasajjā hutvā, asurabheriyo vādentā mahāsamudde udakaṃ dvidhā bhetvā uṭṭhahanti. Te deve vuṭṭhe vammikamakkhikā vammikaṃ viya sineruṃ abhiruhitu ārabhanti. Atha nesaṃ paṭhamaṃ nāgehi saddhiṃ yuddhaṃ hoti. Tasmiṃ kho pana yuddhe na kassaci chavi vā cammaṃ vā chijjati, na lohitaṃ uppajjati, kevalaṃ kumārakānaṃ dārumeṇḍakayuddhaṃ viya aññamaññaṃ santāsanamattameva ",
      " hoti. Koṭisatāpi koṭisahassāpi nāgā tehi saddhiṃ yujjhitvā te asurapuraṃyeva pavesetvā nivattanti."
    ],
    "innerText": "Te pana asurā āyuvaṇṇarasaissariyasampattīhi tāvatiṃsasadisāva. Tasmā antarā attānaṃ ajānitvā pāṭaliyā pupphitāya, ‘‘na idaṃ devanagaraṃ, tattha pāricchattako pupphati, idha pana cittapāṭalī, jarasakkenāmhākaṃ suraṃ pāyetvā vañcitā, devanagarañca no gahitaṃ, gacchāma tena saddhiṃ yujjhissāmā’’ti hatthiassarathe āruyha suvaṇṇarajatamaṇiphalakāni gahetvā, yuddhasajjā hutvā, asurabheriyo vādentā mahāsamudde udakaṃ dvidhā bhetvā uṭṭhahanti. Te deve vuṭṭhe vammikamakkhikā vammikaṃ viya sineruṃ abhiruhitu ārabhanti. Atha nesaṃ paṭhamaṃ nāgehi saddhiṃ yuddhaṃ hoti. Tasmiṃ kho pana yuddhe na kassaci chavi vā cammaṃ vā chijjati, na lohitaṃ uppajjati, kevalaṃ kumārakānaṃ dārumeṇḍakayuddhaṃ viya aññamaññaṃ santāsanamattameva hoti. Koṭisatāpi koṭisahassāpi nāgā tehi saddhiṃ yujjhitvā te asurapuraṃyeva pavesetvā nivattanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadā pana asurā balavanto honti, atha nāgā osakkitvā dutiye ālinde supaṇṇehi saddhiṃ ekatova hutvā yujjhanti. Esa nayo supaṇṇādīsūpi. Yadā pana tāni pañcapi ",
      " ṭhānāni asurā maddanti, tadā ekato sampiṇḍitānipi pañca balāni osakkanti. Atha cattāro mahārājāno gantvā sakkassa taṃ pavattiṃ ārocenti. Sakko tesaṃ vacanaṃ sutvā diyaḍḍhayojanasatikaṃ vejayantarathaṃ āruyha sayaṃ vā nikkhamati, ekaṃ vā puttaṃ peseti. Imasmiṃ pana kāle puttaṃ pesetukāmo, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tāta suvīrā"
      },
      "tiādimāha."
    ],
    "innerText": "Yadā pana asurā balavanto honti, atha nāgā osakkitvā dutiye ālinde supaṇṇehi saddhiṃ ekatova hutvā yujjhanti. Esa nayo supaṇṇādīsūpi. Yadā pana tāni pañcapi ṭhānāni asurā maddanti, tadā ekato sampiṇḍitānipi pañca balāni osakkanti. Atha cattāro mahārājāno gantvā sakkassa taṃ pavattiṃ ārocenti. Sakko tesaṃ vacanaṃ sutvā diyaḍḍhayojanasatikaṃ vejayantarathaṃ āruyha sayaṃ vā nikkhamati, ekaṃ vā puttaṃ peseti. Imasmiṃ pana kāle puttaṃ pesetukāmo, tāta suvīrātiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ bhaddantavāti kho"
      },
      "ti evaṃ hotu bhaddaṃ tava iti kho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pamādaṃ āpādesī"
      },
      "ti pamādaṃ akāsi. Accharāsaṅghaparivuto saṭṭhiyojanaṃ vitthārena suvaṇṇamahāvīthiṃ otaritvā nakkhattaṃ kīḷanto nandanavanādīsu vicaratīti attho."
    ],
    "innerText": "Evaṃ bhaddantavāti khoti evaṃ hotu bhaddaṃ tava iti kho. Pamādaṃ āpādesīti pamādaṃ akāsi. Accharāsaṅghaparivuto saṭṭhiyojanaṃ vitthārena suvaṇṇamahāvīthiṃ otaritvā nakkhattaṃ kīḷanto nandanavanādīsu vicaratīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuṭṭhaha"
      },
      "nti anuṭṭhahanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avāyāma"
      },
      "nti avāyamanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alasvassā"
      },
      "ti alaso assa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ca kiccāni kāraye"
      },
      "ti kiñci kiccaṃ nāma na kareyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbakāmasamiddhassā"
      },
      "ti sabbakāmehi samiddho assa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ me, sakka, varaṃ disā"
      },
      "ti, sakka devaseṭṭha, taṃ me varaṃ uttamaṃ ṭhānaṃ okāsaṃ disaṃ ācikkha kathehīti vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibbānassa hi so maggo"
      },
      "ti kammaṃ akatvā jīvitaṭṭhānaṃ nāma nibbānassa maggo. Paṭhamaṃ."
    ],
    "innerText": "Anuṭṭhahanti anuṭṭhahanto. Avāyāmanti avāyamanto. Alasvassāti alaso assa. Na ca kiccāni kārayeti kiñci kiccaṃ nāma na kareyya. Sabbakāmasamiddhassāti sabbakāmehi samiddho assa. Taṃ me, sakka, varaṃ disāti, sakka devaseṭṭha, taṃ me varaṃ uttamaṃ ṭhānaṃ okāsaṃ disaṃ ācikkha kathehīti vadati. Nibbānassa hi so maggoti kammaṃ akatvā jīvitaṭṭhānaṃ nāma nibbānassa maggo. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Susīmasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "248"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "susīma"
      },
      "nti attano puttasahassassa antare evaṃnāmakaṃ ekaṃ puttameva. Dutiyaṃ."
    ],
    "innerText": "248. Dutiye susīmanti attano puttasahassassa antare evaṃnāmakaṃ ekaṃ puttameva. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Dhajaggasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "249"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samupabyūḷho"
      },
      "ti sampiṇḍito rāsibhūto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhajaggaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ullokeyyathā"
      },
      "ti sakkassa kira diyaḍḍhayojanasatāyāmo ratho ",
      ". Tassa hi pacchimanto paṇṇāsayojano, majjhe rathapañjaro paṇṇāsayojano, rathasandhito yāva rathasīsā paṇṇāsayojanāni. Tadeva pamāṇaṃ diguṇaṃ katvā tiyojanasatāyāmotipi vadantiyeva. Tasmiṃ yojanikapallaṅko atthato, tiyojanikaṃ setacchattaṃ matthake ṭhapitaṃ, ekasmiṃyeva yuge sahassaājaññā yuttā, sesālaṅkārassa pamāṇaṃ natthi. Dhajo panassa aḍḍhatiyāni yojanasatāni uggato, yassa vātāhatassa pañcaṅgikatūriyasseva ",
      " saddo niccharati, taṃ ullokeyyāthāti vadati. Kasmā? Taṃ passantānañhi rājā no āgantvā parisapariyante nikhātathambho viya ṭhito, kassa mayaṃ bhāyāmāti bhayaṃ na hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pajāpatissā"
      },
      "ti so kira sakkena samānavaṇṇo samānāyuko dutiyaṃ āsanaṃ labhati. Tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "varuṇo īsāno"
      },
      " ca. Varuṇo pana tatiyaṃ āsanaṃ labhati, īsāno catutthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Palāyī"
      },
      "ti asurehi parājito tasmiṃ rathe ṭhito appamattakampi rajadhajaṃ disvā palāyanadhammo."
    ],
    "innerText": "249. Tatiye samupabyūḷhoti sampiṇḍito rāsibhūto. Dhajaggaṃullokeyyathāti sakkassa kira diyaḍḍhayojanasatāyāmo ratho . Tassa hi pacchimanto paṇṇāsayojano, majjhe rathapañjaro paṇṇāsayojano, rathasandhito yāva rathasīsā paṇṇāsayojanāni. Tadeva pamāṇaṃ diguṇaṃ katvā tiyojanasatāyāmotipi vadantiyeva. Tasmiṃ yojanikapallaṅko atthato, tiyojanikaṃ setacchattaṃ matthake ṭhapitaṃ, ekasmiṃyeva yuge sahassaājaññā yuttā, sesālaṅkārassa pamāṇaṃ natthi. Dhajo panassa aḍḍhatiyāni yojanasatāni uggato, yassa vātāhatassa pañcaṅgikatūriyasseva saddo niccharati, taṃ ullokeyyāthāti vadati. Kasmā? Taṃ passantānañhi rājā no āgantvā parisapariyante nikhātathambho viya ṭhito, kassa mayaṃ bhāyāmāti bhayaṃ na hoti. Pajāpatissāti so kira sakkena samānavaṇṇo samānāyuko dutiyaṃ āsanaṃ labhati. Tathā varuṇo īsāno ca. Varuṇo pana tatiyaṃ āsanaṃ labhati, īsāno catutthaṃ. Palāyīti asurehi parājito tasmiṃ rathe ṭhito appamattakampi rajadhajaṃ disvā palāyanadhammo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itipi so bhagavā"
      },
      "tiādīni visuddhimagge vitthāritāneva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idamavocā"
      },
      "ti idaṃ dhajaggaparittaṃ nāma bhagavā avoca, yassa āṇākhette koṭisatasahassacakkavāḷe ānubhāvo vattati. Idaṃ āvajjetvā hi yakkhabhayacorabhayādīhi dukkhehi muttānaṃ anto natthi. Tiṭṭhatu aññadukkhavūpasamo, idaṃ āvajjamāno hi pasannacitto ākāsepi patiṭṭhaṃ labhati."
    ],
    "innerText": "Itipi so bhagavātiādīni visuddhimagge vitthāritāneva. Idamavocāti idaṃ dhajaggaparittaṃ nāma bhagavā avoca, yassa āṇākhette koṭisatasahassacakkavāḷe ānubhāvo vattati. Idaṃ āvajjetvā hi yakkhabhayacorabhayādīhi dukkhehi muttānaṃ anto natthi. Tiṭṭhatu aññadukkhavūpasamo, idaṃ āvajjamāno hi pasannacitto ākāsepi patiṭṭhaṃ labhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatridaṃ vatthu – dīghavāpicetiyamhi kira sudhākamme ",
      " kayiramāne eko daharo muddhavedikāpādato patitvā cetiyakucchiyā bhassati. Heṭṭhā ṭhito bhikkhusaṅgho ‘‘dhajaggaparittaṃ, āvuso, āvajjāhī’’ti āha. So maraṇabhayena tajjito ‘‘dhajaggaparittaṃ maṃ rakkhatū’’ti āha. Tāvadevassa cetiyakucchito dve iṭṭhakā nikkhamitvā sopānaṃ hutvā aṭṭhaṃsu, upariṭṭhito vallinisseṇiṃ otāresuṃ. Tasmiṃ nisseṇiyaṃ ṭhite iṭṭhakā yathāṭṭhāneyeva aṭṭhaṃsu. Tatiyaṃ."
    ],
    "innerText": "Tatridaṃ vatthu – dīghavāpicetiyamhi kira sudhākamme kayiramāne eko daharo muddhavedikāpādato patitvā cetiyakucchiyā bhassati. Heṭṭhā ṭhito bhikkhusaṅgho ‘‘dhajaggaparittaṃ, āvuso, āvajjāhī’’ti āha. So maraṇabhayena tajjito ‘‘dhajaggaparittaṃ maṃ rakkhatū’’ti āha. Tāvadevassa cetiyakucchito dve iṭṭhakā nikkhamitvā sopānaṃ hutvā aṭṭhaṃsu, upariṭṭhito vallinisseṇiṃ otāresuṃ. Tasmiṃ nisseṇiyaṃ ṭhite iṭṭhakā yathāṭṭhāneyeva aṭṭhaṃsu. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Vepacittisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "250"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vepacittī"
      },
      "ti so kira asurānaṃ sabbajeṭṭhako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yenā"
      },
      "ti nipātamattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na"
      },
      "nti ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṇṭhapañcamehī"
      },
      "ti dvīsu hatthesu pādesu kaṇṭhe cāti evaṃ pañcahi bandhanehi. Tāni pana naḷinasuttaṃ viya makkaṭakasuttaṃ viya ca cakkhussāpāthaṃ āgacchanti, iriyāpathaṃ rujjhanti. Tehi pana citteneva bajjhati, citteneva muccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akkosatī"
      },
      "ti corosi bālosi mūḷhosi thenosi oṭṭhosi goṇosi gadrabhosi nerayikosi tiracchānagatosi, natthi tuyhaṃ sugati, duggatiyeva tuyhaṃ pāṭikaṅkhāti imehi dasahi akkosavatthūhi akkosati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paribhāsatī"
      },
      "ti, jarasakka, na tvaṃ sabbakālaṃ jinissasi, yadā asurānaṃ jayo bhavissati, tadā tampi evaṃ bandhitvā asurabhavanassa dvāre nipajjāpetvā pothāpessāmīti ādīni vatvā tajjeti. Sakko vijitavijayo na taṃ manasi karoti, mahāpaṭiggahaṇaṃ panassa matthake vidhunanto sudhammadevasabhaṃ pavisati ",
      " ceva nikkhamati ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhabhāsī"
      },
      "ti ‘‘kiṃ nu kho esa sakko imāni pharusavacanāni bhayena titikkhati, udāhu adhivāsanakhantiyā samannāgatattā’’ti? Vīmaṃsanto abhāsi."
    ],
    "innerText": "250. Catutthe vepacittīti so kira asurānaṃ sabbajeṭṭhako. Yenāti nipātamattaṃ nanti ca. Kaṇṭhapañcamehīti dvīsu hatthesu pādesu kaṇṭhe cāti evaṃ pañcahi bandhanehi. Tāni pana naḷinasuttaṃ viya makkaṭakasuttaṃ viya ca cakkhussāpāthaṃ āgacchanti, iriyāpathaṃ rujjhanti. Tehi pana citteneva bajjhati, citteneva muccati. Akkosatīti corosi bālosi mūḷhosi thenosi oṭṭhosi goṇosi gadrabhosi nerayikosi tiracchānagatosi, natthi tuyhaṃ sugati, duggatiyeva tuyhaṃ pāṭikaṅkhāti imehi dasahi akkosavatthūhi akkosati. Paribhāsatīti, jarasakka, na tvaṃ sabbakālaṃ jinissasi, yadā asurānaṃ jayo bhavissati, tadā tampi evaṃ bandhitvā asurabhavanassa dvāre nipajjāpetvā pothāpessāmīti ādīni vatvā tajjeti. Sakko vijitavijayo na taṃ manasi karoti, mahāpaṭiggahaṇaṃ panassa matthake vidhunanto sudhammadevasabhaṃ pavisati ceva nikkhamati ca. Ajjhabhāsīti ‘‘kiṃ nu kho esa sakko imāni pharusavacanāni bhayena titikkhati, udāhu adhivāsanakhantiyā samannāgatattā’’ti? Vīmaṃsanto abhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dubbalyā no"
      },
      "ti dubbalabhāvena nu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisaṃyuje"
      },
      "ti paṭisaṃyujeyya paṭipphareyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhijjeyyu"
      },
      "nti virajjeyyuṃ. Pakujjheyyuntipi pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Para"
      },
      "nti paccatthikaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo sato upasammatī"
      },
      "ti yo satimā hutvā upasammati, tassa upasamaṃyevāhaṃ ",
      " bālassa paṭisedhanaṃ maññeti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadā naṃ maññatī"
      },
      "ti yasmā taṃ maññati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhāruhatī"
      },
      "ti ajjhottharati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gova bhiyyo palāyina"
      },
      "nti yathā goyuddhe tāvadeva dve gāvo yujjhante gogaṇo olokento tiṭṭhati, yadā pana eko palāyati, atha naṃ palāyantaṃ sabbo gogaṇo bhiyyo ajjhottharati. Evaṃ dummedho khamantaṃ bhiyyo ajjhottharatīti attho."
    ],
    "innerText": "Dubbalyā noti dubbalabhāvena nu. Paṭisaṃyujeti paṭisaṃyujeyya paṭipphareyya. Pabhijjeyyunti virajjeyyuṃ. Pakujjheyyuntipi pāṭho. Paranti paccatthikaṃ. Yo sato upasammatīti yo satimā hutvā upasammati, tassa upasamaṃyevāhaṃ bālassa paṭisedhanaṃ maññeti attho. Yadā naṃ maññatīti yasmā taṃ maññati. Ajjhāruhatīti ajjhottharati. Gova bhiyyo palāyinanti yathā goyuddhe tāvadeva dve gāvo yujjhante gogaṇo olokento tiṭṭhati, yadā pana eko palāyati, atha naṃ palāyantaṃ sabbo gogaṇo bhiyyo ajjhottharati. Evaṃ dummedho khamantaṃ bhiyyo ajjhottharatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sadatthaparamā"
      },
      "ti sakatthaparamā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khantyā bhiyyo na vijjatī"
      },
      "ti tesu sakaatthaparamesu atthesu khantito uttaritaro añño attho na vijjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tamāhu paramaṃ khanti"
      },
      "nti yo balavā titikkhati, tassa taṃ khantiṃ paramaṃ āhu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bālabalaṃ"
      },
      " nāma aññāṇabalaṃ. Taṃ yassa balaṃ, abalameva ",
      " taṃ balanti āhu kathentīti dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammaguttassā"
      },
      "ti dhammena rakkhitassa, dhammaṃ vā rakkhantassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭivattā"
      },
      "ti paṭippharitvā vattā, paṭippharitvā vā bālabalanti vadeyyāpi, dhammaṭṭhaṃ pana cāletuṃ samattho nāma natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasseva tena pāpiyo"
      },
      "ti tena kodhena tasseva puggalassa pāpaṃ. Katarassa? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo kuddhaṃ paṭikujjhati. Tikicchantāna"
      },
      "nti ekavacane bahuvacanaṃ, tikicchantanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Janā maññantī"
      },
      "ti evarūpaṃ attano ca parassa cāti ubhinnaṃ atthaṃ tikicchantaṃ nipphādentaṃ puggalaṃ ‘‘andhabālo aya’’nti andhabālaputhujjanāva evaṃ maññanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammassa akovidā"
      },
      "ti catusaccadhamme achekā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti imasmiṃ sāsane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kho"
      },
      "ti nipātamattaṃ. Catutthaṃ."
    ],
    "innerText": "Sadatthaparamāti sakatthaparamā. Khantyā bhiyyo na vijjatīti tesu sakaatthaparamesu atthesu khantito uttaritaro añño attho na vijjati. Tamāhu paramaṃ khantinti yo balavā titikkhati, tassa taṃ khantiṃ paramaṃ āhu. Bālabalaṃ nāma aññāṇabalaṃ. Taṃ yassa balaṃ, abalameva taṃ balanti āhu kathentīti dīpeti. Dhammaguttassāti dhammena rakkhitassa, dhammaṃ vā rakkhantassa. Paṭivattāti paṭippharitvā vattā, paṭippharitvā vā bālabalanti vadeyyāpi, dhammaṭṭhaṃ pana cāletuṃ samattho nāma natthi. Tasseva tena pāpiyoti tena kodhena tasseva puggalassa pāpaṃ. Katarassa? Yo kuddhaṃ paṭikujjhati. Tikicchantānanti ekavacane bahuvacanaṃ, tikicchantanti attho. Janā maññantīti evarūpaṃ attano ca parassa cāti ubhinnaṃ atthaṃ tikicchantaṃ nipphādentaṃ puggalaṃ ‘‘andhabālo aya’’nti andhabālaputhujjanāva evaṃ maññanti. Dhammassa akovidāti catusaccadhamme achekā. Idhāti imasmiṃ sāsane. Khoti nipātamattaṃ. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Subhāsitajayasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "251"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asurindaṃ etadavocā"
      },
      "ti chekatāya etaṃ avoca. Evaṃ kirassa ahosi ‘‘parassa nāma gāhaṃ mocetvā paṭhamaṃ vattuṃ garu. Parassa vacanaṃ anugantvā pana pacchā sukhaṃ ",
      " vattu’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbadevā"
      },
      "ti devaloke ciranivāsino pubbasāmikā, tumhākaṃ tāva paveṇiāgataṃ bhaṇathāti ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adaṇḍāvacarā"
      },
      "ti daṇḍāvacaraṇarahitā, daṇḍaṃ vā satthaṃ vā gahetabbanti evamettha natthīti attho. Pañcamaṃ."
    ],
    "innerText": "251. Pañcame asurindaṃ etadavocāti chekatāya etaṃ avoca. Evaṃ kirassa ahosi ‘‘parassa nāma gāhaṃ mocetvā paṭhamaṃ vattuṃ garu. Parassa vacanaṃ anugantvā pana pacchā sukhaṃ vattu’’nti. Pubbadevāti devaloke ciranivāsino pubbasāmikā, tumhākaṃ tāva paveṇiāgataṃ bhaṇathāti . Adaṇḍāvacarāti daṇḍāvacaraṇarahitā, daṇḍaṃ vā satthaṃ vā gahetabbanti evamettha natthīti attho. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Kulāvakasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "252"
      },
      ". Chaṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhabhāsī"
      },
      "ti tassa kira simbalivanābhimukhassa jātassa rathasaddo ca ājānīyasaddo dhajasaddo ca samantā asanipātasaddo viya ahosi. Taṃ sutvā simbalivane balavasupaṇṇā palāyiṃsu, jarājiṇṇā ceva rogadubbalā ca asañjātapakkhapotakā ca palāyituṃ asakkontā, maraṇabhayena tajjitā ekappahāreneva mahāviravaṃ viraviṃsu. Sakko taṃ sutvā ‘‘kassa saddo, tātā’’ti? Mātaliṃ pucchi. Rathasaddaṃ, te deva, sutvā supaṇṇā palāyituṃ asakkontā viravantīti. Taṃ sutvā karuṇāsamāvajjitahadayo abhāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Īsāmukhenā"
      },
      "ti rathassa īsāmukhena. Yathā kulāvake īsāmukhaṃ na sañcuṇṇeti, evaṃ iminā īsāmukhena te parivajjaya. So hi ratho puññapaccayanibbatto cakkavāḷapabbatepi ",
      " sinerumhipi sammukhībhūte vinivijjhitvāva gacchati na sajjati, ākāsagatasadiseneva gacchati. Sace tena simbalivanena gato bhaveyya, yathā mahāsakaṭe kadalivanamajjhena vā eraṇḍavanamajjhena vā gacchante sabbavanaṃ vibhaggaṃ nimmathitaṃ hoti, evaṃ tampi simbalivanaṃ bhaveyya. Chaṭṭhaṃ."
    ],
    "innerText": "252. Chaṭṭhe ajjhabhāsīti tassa kira simbalivanābhimukhassa jātassa rathasaddo ca ājānīyasaddo dhajasaddo ca samantā asanipātasaddo viya ahosi. Taṃ sutvā simbalivane balavasupaṇṇā palāyiṃsu, jarājiṇṇā ceva rogadubbalā ca asañjātapakkhapotakā ca palāyituṃ asakkontā, maraṇabhayena tajjitā ekappahāreneva mahāviravaṃ viraviṃsu. Sakko taṃ sutvā ‘‘kassa saddo, tātā’’ti? Mātaliṃ pucchi. Rathasaddaṃ, te deva, sutvā supaṇṇā palāyituṃ asakkontā viravantīti. Taṃ sutvā karuṇāsamāvajjitahadayo abhāsi. Īsāmukhenāti rathassa īsāmukhena. Yathā kulāvake īsāmukhaṃ na sañcuṇṇeti, evaṃ iminā īsāmukhena te parivajjaya. So hi ratho puññapaccayanibbatto cakkavāḷapabbatepi sinerumhipi sammukhībhūte vinivijjhitvāva gacchati na sajjati, ākāsagatasadiseneva gacchati. Sace tena simbalivanena gato bhaveyya, yathā mahāsakaṭe kadalivanamajjhena vā eraṇḍavanamajjhena vā gacchante sabbavanaṃ vibhaggaṃ nimmathitaṃ hoti, evaṃ tampi simbalivanaṃ bhaveyya. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Nadubbhiyasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "253"
      },
      ". Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upasaṅkamī"
      },
      "ti ‘‘ayaṃ sakko ‘yopi me assa supaccatthiko, tassa pāhaṃ na dubbheyya’nti cinteti, mayā tassa paccatthikataro nāma natthi, vīmaṃsissāmi tāva naṃ, kiṃ nu kho maṃ passitvā dubbhati, na dubbhatī’’ti cintetvā upasaṅkami. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiṭṭha vepacitti gahitosī"
      },
      "ti vepacitti, ettheva tiṭṭha, gahito tvaṃ mayāti vadati. Saha vacanenevassa ",
      " so kaṇṭhapañcamehi bandhanehi baddhova ahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sapassu ca me"
      },
      "ti mayi adubbhatthāya sapathaṃ karohīti vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ musābhaṇato pāpa"
      },
      "nti imasmiṃ kappe paṭhamakappikesu cetiyarañño pāpaṃ sandhāyāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ariyūpavādino"
      },
      "ti kokalikassa viya pāpaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mittadduno ca yaṃ pāpanti mahākapijātake"
      },
      " mahāsatte duṭṭhacittassa ",
      " pāpaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akataññuno"
      },
      "ti devadattasadisassa akataññuno pāpaṃ. Imāni kira imasmiṃ kappe cattāri mahāpāpāni. Sattamaṃ."
    ],
    "innerText": "253. Sattame upasaṅkamīti ‘‘ayaṃ sakko ‘yopi me assa supaccatthiko, tassa pāhaṃ na dubbheyya’nti cinteti, mayā tassa paccatthikataro nāma natthi, vīmaṃsissāmi tāva naṃ, kiṃ nu kho maṃ passitvā dubbhati, na dubbhatī’’ti cintetvā upasaṅkami. Tiṭṭha vepacitti gahitosīti vepacitti, ettheva tiṭṭha, gahito tvaṃ mayāti vadati. Saha vacanenevassa so kaṇṭhapañcamehi bandhanehi baddhova ahosi. Sapassu ca meti mayi adubbhatthāya sapathaṃ karohīti vadati. Yaṃ musābhaṇato pāpanti imasmiṃ kappe paṭhamakappikesu cetiyarañño pāpaṃ sandhāyāha. Ariyūpavādinoti kokalikassa viya pāpaṃ. Mittadduno ca yaṃ pāpanti mahākapijātake mahāsatte duṭṭhacittassa pāpaṃ. Akataññunoti devadattasadisassa akataññuno pāpaṃ. Imāni kira imasmiṃ kappe cattāri mahāpāpāni. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Verocanaasurindasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "254"
      },
      ". Aṭṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhaṃsū"
      },
      "ti dvārapālarūpakāni viya ṭhitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nipphadā"
      },
      "ti nipphatti, yāva attho nipphajjati, tāva vāyamethevāti vadati. Dutiyagāthā sakkassa. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khantyā bhiyyo"
      },
      "ti nipphannasobhanesu atthesu khantito uttaritaro attho nāma natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthajātā"
      },
      "ti kiccajātā. Soṇasiṅgālādayopi hi upādāya akiccajāto satto nāma natthi. Ito etto gamanamattampi kiccameva hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃyogaparamā tveva, sambhogā sabbapāṇina"
      },
      "nti pārivāsikaodanādīni hi asambhogārahāni honti, tāni puna uṇhāpetvā bhajjitvā sappimadhuphāṇitādīhi saṃyojitāni sambhogārahāni honti. Tenāha ‘‘saṃyogaparamā tveva, sambhogā sabbapāṇina’’nti ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nipphannasobhano attho"
      },
      "ti ime atthā nāma nipphannāva sobhanti. Puna catutthagāthā sakkassa. Tatthāpi vuttanayeneva attho veditabbo. Aṭṭhamaṃ."
    ],
    "innerText": "254. Aṭṭhame aṭṭhaṃsūti dvārapālarūpakāni viya ṭhitā. Nipphadāti nipphatti, yāva attho nipphajjati, tāva vāyamethevāti vadati. Dutiyagāthā sakkassa. Tattha khantyā bhiyyoti nipphannasobhanesu atthesu khantito uttaritaro attho nāma natthi. Atthajātāti kiccajātā. Soṇasiṅgālādayopi hi upādāya akiccajāto satto nāma natthi. Ito etto gamanamattampi kiccameva hoti. Saṃyogaparamā tveva, sambhogā sabbapāṇinanti pārivāsikaodanādīni hi asambhogārahāni honti, tāni puna uṇhāpetvā bhajjitvā sappimadhuphāṇitādīhi saṃyojitāni sambhogārahāni honti. Tenāha ‘‘saṃyogaparamā tveva, sambhogā sabbapāṇina’’nti . Nipphannasobhano atthoti ime atthā nāma nipphannāva sobhanti. Puna catutthagāthā sakkassa. Tatthāpi vuttanayeneva attho veditabbo. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Araññāyatanaisisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "255"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇṇakuṭīsu sammantī"
      },
      "ti himavantapadese ramaṇīye araññāyatane rattiṭṭhānadivāṭṭhānacaṅkamanādīhi sampannāsu paṇṇasālāsu vasanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakko ca devānamindo vepacitti cā"
      },
      "ti ime dve janā jāmātikasasurā kālena kalahaṃ karonti, kālena ekato caranti, imasmiṃ pana kāle ekato ",
      " caranti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭaliyo"
      },
      "ti gaṇaṅgaṇūpāhanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khaggaṃ olaggetvā"
      },
      "ti khaggaṃ aṃse olaggetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chattenā"
      },
      "ti dibbasetacchattena matthake dhārayamānena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apabyāmato karitvā"
      },
      "ti byāmato akatvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ciradikkhitāna"
      },
      "nti cirasamādiṇṇavatānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ito paṭikkammā"
      },
      "ti ‘‘ito pakkama parivajjaya, mā uparivāte tiṭṭhā’’ti vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na hettha devā"
      },
      "ti etasmiṃ sīlavantānaṃ gandhe devā na paṭikkūlasaññino, iṭṭhakantamanāpasaññinoyevāti dīpeti. Navamaṃ."
    ],
    "innerText": "255. Navame paṇṇakuṭīsu sammantīti himavantapadese ramaṇīye araññāyatane rattiṭṭhānadivāṭṭhānacaṅkamanādīhi sampannāsu paṇṇasālāsu vasanti. Sakko ca devānamindo vepacitti cāti ime dve janā jāmātikasasurā kālena kalahaṃ karonti, kālena ekato caranti, imasmiṃ pana kāle ekato caranti. Paṭaliyoti gaṇaṅgaṇūpāhanā. Khaggaṃ olaggetvāti khaggaṃ aṃse olaggetvā. Chattenāti dibbasetacchattena matthake dhārayamānena. Apabyāmato karitvāti byāmato akatvā. Ciradikkhitānanti cirasamādiṇṇavatānaṃ. Ito paṭikkammāti ‘‘ito pakkama parivajjaya, mā uparivāte tiṭṭhā’’ti vadanti. Na hettha devāti etasmiṃ sīlavantānaṃ gandhe devā na paṭikkūlasaññino, iṭṭhakantamanāpasaññinoyevāti dīpeti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Samuddakasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "256"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samuddatīre paṇṇakuṭīsū"
      },
      "ti cakkavāḷamahāsamuddapiṭṭhiyaṃ rajatapaṭṭavaṇṇe vālukapuḷine vuttappakārāsu paṇṇasālāsu vasanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siyāpi no"
      },
      "ti siyāpi amhākaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhayadakkhiṇaṃ yāceyyāmā"
      },
      "ti abhayadānaṃ yāceyyāma. Yebhuyyena kira devāsurasaṅgāmo mahāsamuddapiṭṭhe hoti. Asurānaṃ na sabbakālaṃ jayo hoti, bahuvāre parājayova hoti. Te devehi parājitā palāyantā isīnaṃ assamapadena gacchantā ‘‘sakko imehi saddhiṃ mantetvā amhe nāseti, gaṇhatha puttahatāya putte’’ti kupitā assamapade pānīyaghaṭacaṅkamanasālādīni viddhaṃsenti. Isayo araññato phalāphalaṃ ādāya āgatā naṃ disvā puna dukkhena paṭipākatikaṃ ",
      " karonti. Tepi punappunaṃ tatheva vināsenti. Tasmā ‘‘idāni tesaṃ saṅgāmo paccupaṭṭhito’’ti sutvā evaṃ cintayiṃsu."
    ],
    "innerText": "256. Dasame samuddatīre paṇṇakuṭīsūti cakkavāḷamahāsamuddapiṭṭhiyaṃ rajatapaṭṭavaṇṇe vālukapuḷine vuttappakārāsu paṇṇasālāsu vasanti. Siyāpi noti siyāpi amhākaṃ. Abhayadakkhiṇaṃ yāceyyāmāti abhayadānaṃ yāceyyāma. Yebhuyyena kira devāsurasaṅgāmo mahāsamuddapiṭṭhe hoti. Asurānaṃ na sabbakālaṃ jayo hoti, bahuvāre parājayova hoti. Te devehi parājitā palāyantā isīnaṃ assamapadena gacchantā ‘‘sakko imehi saddhiṃ mantetvā amhe nāseti, gaṇhatha puttahatāya putte’’ti kupitā assamapade pānīyaghaṭacaṅkamanasālādīni viddhaṃsenti. Isayo araññato phalāphalaṃ ādāya āgatā naṃ disvā puna dukkhena paṭipākatikaṃ karonti. Tepi punappunaṃ tatheva vināsenti. Tasmā ‘‘idāni tesaṃ saṅgāmo paccupaṭṭhito’’ti sutvā evaṃ cintayiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmaṃkaro"
      },
      "ti ",
      " icchitakaro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhayassa abhayassa vā"
      },
      "ti bhayaṃ vā abhayaṃ vā. Idaṃ vuttaṃ hoti – sace tvaṃ abhayaṃ dātukāmo, abhayaṃ dātuṃ pahosi. Sace bhayaṃ dātukāmo. Bhayaṃ dātuṃ pahosi. Amhākaṃ pana abhayadānaṃ dehīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duṭṭhāna"
      },
      "nti viruddhānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavutta"
      },
      "nti khette patiṭṭhāpitaṃ."
    ],
    "innerText": "Kāmaṃkaroti icchitakaro. Bhayassa abhayassa vāti bhayaṃ vā abhayaṃ vā. Idaṃ vuttaṃ hoti – sace tvaṃ abhayaṃ dātukāmo, abhayaṃ dātuṃ pahosi. Sace bhayaṃ dātukāmo. Bhayaṃ dātuṃ pahosi. Amhākaṃ pana abhayadānaṃ dehīti. Duṭṭhānanti viruddhānaṃ. Pavuttanti khette patiṭṭhāpitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tikkhattuṃ ubbijjī"
      },
      "ti sāyamāsabhattaṃ bhuñjitvā sayanaṃ abhiruyha nipanno niddāya okkantamattāya samantā ṭhatvā sattisatena pahaṭo viya viravanto uṭṭhahati, dasayojanasahassaṃ asurabhavanaṃ ‘‘kimida’’nti saṅkhobhaṃ āpajjati. Atha naṃ āgantvā ‘‘kimida’’nti pucchanti. So ‘‘na kiñcī’’ti vadati. Dutiyayāmādīsupi eseva nayo. Iti asurānaṃ ‘‘mā bhāyi, mahārājā’’ti taṃ assāsentānaṃyeva aruṇaṃ uggacchati. Evamassa tato paṭṭhāya gelaññajātaṃ cittaṃ vepati. Teneva cassa ‘‘vepacittī’’ti aparaṃ nāmaṃ udapādīti. Dasamaṃ."
    ],
    "innerText": "Tikkhattuṃ ubbijjīti sāyamāsabhattaṃ bhuñjitvā sayanaṃ abhiruyha nipanno niddāya okkantamattāya samantā ṭhatvā sattisatena pahaṭo viya viravanto uṭṭhahati, dasayojanasahassaṃ asurabhavanaṃ ‘‘kimida’’nti saṅkhobhaṃ āpajjati. Atha naṃ āgantvā ‘‘kimida’’nti pucchanti. So ‘‘na kiñcī’’ti vadati. Dutiyayāmādīsupi eseva nayo. Iti asurānaṃ ‘‘mā bhāyi, mahārājā’’ti taṃ assāsentānaṃyeva aruṇaṃ uggacchati. Evamassa tato paṭṭhāya gelaññajātaṃ cittaṃ vepati. Teneva cassa ‘‘vepacittī’’ti aparaṃ nāmaṃ udapādīti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamo vaggo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Dutiyavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Vatapadasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "257"
      },
      ". Dutiyavaggassa ",
      " paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vatapadānī"
      },
      "ti vatakoṭṭhāsāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samattānī"
      },
      "ti paripuṇṇāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādinnānī"
      },
      "ti gahitāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kule jeṭṭhāpacāyī"
      },
      "ti kulajeṭṭhakānaṃ mahāpitā mahāmātā cūḷapitā cūḷamātā mātulo mātulānītiādīnaṃ apacitikārako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṇhavāco"
      },
      "ti piyamudumadhuravāco. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muttacāgo"
      },
      "ti vissaṭṭhacāgo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Payatapāṇī"
      },
      "ti deyyadhammadānatthāya sadā dhotahattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vossaggarato"
      },
      "ti vossajjane rato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yācayogo"
      },
      "ti parehi yācitabbāraho, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yācayogo"
      },
      "ti vā yācayogeneva yutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dānasaṃvibhāgarato"
      },
      "ti dāne ca saṃvibhāge ca rato. Paṭhamaṃ."
    ],
    "innerText": "257. Dutiyavaggassa paṭhame vatapadānīti vatakoṭṭhāsāni. Samattānīti paripuṇṇāni. Samādinnānīti gahitāni. Kule jeṭṭhāpacāyīti kulajeṭṭhakānaṃ mahāpitā mahāmātā cūḷapitā cūḷamātā mātulo mātulānītiādīnaṃ apacitikārako. Saṇhavācoti piyamudumadhuravāco. Muttacāgoti vissaṭṭhacāgo. Payatapāṇīti deyyadhammadānatthāya sadā dhotahattho. Vossaggaratoti vossajjane rato. Yācayogoti parehi yācitabbāraho, yācayogoti vā yācayogeneva yutto. Dānasaṃvibhāgaratoti dāne ca saṃvibhāge ca rato. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Sakkanāmasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "258"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manussabhūto"
      },
      "ti magadharaṭṭhe macalagāme manussabhūto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvasathaṃ adāsī"
      },
      "ti catumahāpathe mahājanassa āvasathaṃ kāretvā adāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahassampi atthāna"
      },
      "nti sahassampi kāraṇānaṃ, janasahassena vā vacanasahassena vā osārite ‘‘ayaṃ imassa attho, ayaṃ imassa attho’’ti ekapade ṭhitova vinicchinati. Dutiyaṃ."
    ],
    "innerText": "258. Dutiye manussabhūtoti magadharaṭṭhe macalagāme manussabhūto. Āvasathaṃ adāsīti catumahāpathe mahājanassa āvasathaṃ kāretvā adāsi. Sahassampi atthānanti sahassampi kāraṇānaṃ, janasahassena vā vacanasahassena vā osārite ‘‘ayaṃ imassa attho, ayaṃ imassa attho’’ti ekapade ṭhitova vinicchinati. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Mahālisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "259"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upasaṅkamī"
      },
      "ti ‘‘sakko devarājāti kathenti, atthi nu kho so sakko, yena so diṭṭhapubboti imamatthaṃ dasabalaṃ pucchissāmī’’ti upasaṅkami. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tañca pajānāmī"
      },
      "ti bahuvacane ekavacanaṃ, te ca dhamme pajānāmīti attho. Sakko kira anantare attabhāve magadharaṭṭhe macalagāme magho nāma māṇavo ahosi paṇḍito byatto, bodhisattacariyā viya ca tassa cariyā ahosi. So tettiṃsa purise gahetvā kalyāṇamakāsi. Ekadivasaṃ attanova paññāya upaparikkhitvā gāmamajjhe mahājanassa sannipatitaṭṭhāne kacavaraṃ ubhatopassesu apabyūhitvā taṃ ṭhānaṃ ramaṇīyaṃ akāsi. Puna tattheva maṇḍapaṃ kāresi. Puna gacchante kāle sālaṃ ",
      " kāresi. Gāmato ca nikkhamitvā gāvutampi aḍḍhayojanampi tigāvutampi yojanampi vicaritvā tehi sahāyehi saddhiṃ visamaṃ samaṃ akāsi. Te sabbeva ekacchandā tattha tattha setuyuttaṭṭhāne setuṃ, maṇḍapasālāpokkharaṇimālāvaccharopanapadīnaṃ yuttaṭṭhānesu maṇḍapasālāpokkharaṇimālāvaccharopanādīni karontā bahuṃ puññamakaṃsu. Magho satta vatapadāni pūretvā kāyassa bhedā saddhiṃ sahāyehi tāvatiṃsabhavane nibbatti. Taṃ sabbaṃ bhagavā jānāti. Tenāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yesaṃ dhammānaṃ samādinnattā sakko sakkattaṃ ajjhagā, tañca pajānāmī"
      },
      "ti. Ayaṃ sakkassa sakkattādhigame saṅkhepakathā, vitthāro pana sumaṅgalavilāsiniyā dīghanikāyaṭṭhakathāya sakkapaṇhavaṇṇanāyaṃ vutto. Tatiyaṃ."
    ],
    "innerText": "259. Tatiye upasaṅkamīti ‘‘sakko devarājāti kathenti, atthi nu kho so sakko, yena so diṭṭhapubboti imamatthaṃ dasabalaṃ pucchissāmī’’ti upasaṅkami. Tañca pajānāmīti bahuvacane ekavacanaṃ, te ca dhamme pajānāmīti attho. Sakko kira anantare attabhāve magadharaṭṭhe macalagāme magho nāma māṇavo ahosi paṇḍito byatto, bodhisattacariyā viya ca tassa cariyā ahosi. So tettiṃsa purise gahetvā kalyāṇamakāsi. Ekadivasaṃ attanova paññāya upaparikkhitvā gāmamajjhe mahājanassa sannipatitaṭṭhāne kacavaraṃ ubhatopassesu apabyūhitvā taṃ ṭhānaṃ ramaṇīyaṃ akāsi. Puna tattheva maṇḍapaṃ kāresi. Puna gacchante kāle sālaṃ kāresi. Gāmato ca nikkhamitvā gāvutampi aḍḍhayojanampi tigāvutampi yojanampi vicaritvā tehi sahāyehi saddhiṃ visamaṃ samaṃ akāsi. Te sabbeva ekacchandā tattha tattha setuyuttaṭṭhāne setuṃ, maṇḍapasālāpokkharaṇimālāvaccharopanapadīnaṃ yuttaṭṭhānesu maṇḍapasālāpokkharaṇimālāvaccharopanādīni karontā bahuṃ puññamakaṃsu. Magho satta vatapadāni pūretvā kāyassa bhedā saddhiṃ sahāyehi tāvatiṃsabhavane nibbatti. Taṃ sabbaṃ bhagavā jānāti. Tenāha – yesaṃ dhammānaṃ samādinnattā sakko sakkattaṃ ajjhagā, tañca pajānāmīti. Ayaṃ sakkassa sakkattādhigame saṅkhepakathā, vitthāro pana sumaṅgalavilāsiniyā dīghanikāyaṭṭhakathāya sakkapaṇhavaṇṇanāyaṃ vutto. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Daliddasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "260"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manussadaliddo"
      },
      "ti manussaadhano. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manussakapaṇo"
      },
      "ti manussakāruññataṃ patto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manussavarāko"
      },
      "ti manussalāmako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatrā"
      },
      "ti tasmiṃ ṭhāne, tasmiṃ vā atirocane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ujjhāyantī"
      },
      "ti avajjhāyanti lāmakato cintenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khiyantī"
      },
      "ti kathenti pakāsenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipācentī"
      },
      "ti tattha tattha kathenti vitthārenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eso kho mārisā"
      },
      "ti ettha ayamanupubbikathā – so kira anuppanne buddhe kāsiraṭṭhe bārāṇasirājā hutvā samussitaddhajapaṭākanānālaṅkārena suṭṭhu alaṅkataṃ nagaraṃ padakkhiṇaṃ akāsi attano sirisampattiyā samākaḍḍhitanettena janakāyena samullokiyamāno. Tasmiñca samaye eko paccekabuddho gandhamādanapabbatā āgamma tasmiṃ nagare piṇḍāya carati, santindriyo santamānaso uttamadamathasamannāgato. Mahājanopi rājagataṃ cittīkāraṃ pahāya paccekabuddhameva olokesi. Rājā – ‘‘idāni imasmiṃ janakāye ekopi maṃ na oloketi. Kiṃ nu kho eta’’nti? Olokento paccekabuddhaṃ addasa. Sopi paccekabuddho mahallako hoti pacchimavaye ṭhito. Cīvarānipissa jiṇṇāni, tato tato suttāni gaḷanti. Rañño satasahassādhikāni dve asaṅkhyeyyāni pūritapāramiṃ paccekabuddhaṃ disvā cittapasādamattaṃ vā hatthaṃ pasāretvā vandanamattaṃ vā nāhosi. So rājā ‘‘pabbajito maññe esa usūyāya maṃ na oloketī’’ti kujjhitvā ‘‘kvāyaṃ kuṭṭhicīvarāni pāruto’’ti niṭṭhubhitvā pakkāmi. Tassa kammassa vipākena mahāniraye nibbattitvā vipākāvasesena manussalokaṃ āgacchanto rājagahe paramakapaṇāya itthiyā kucchimhi paṭisandhiṃ gaṇhi. Gahitakālato paṭṭhāya sā itthī kañjikamattampi ",
      " udarapūraṃ nālattha. Tassa kucchigatasseva kaṇṇanāsā vilīnā, saṅkhapalitakuṭṭhī hutvā mātukucchito nikkhanto. Mātāpitaro ",
      " nāma dukkarakārikā honti, tenassa mātā yāva kapālaṃ gahetvā carituṃ na sakkoti, tāvassa kañjikampi udakampi āharitvā adāsi. Bhikkhāya carituṃ samatthakāle panassa kapālaṃ hatthe datvā ‘‘paññāyissasi sakena kammenā’’ti pakkāmi."
    ],
    "innerText": "260. Catutthe manussadaliddoti manussaadhano. Manussakapaṇoti manussakāruññataṃ patto. Manussavarākoti manussalāmako. Tatrāti tasmiṃ ṭhāne, tasmiṃ vā atirocane. Ujjhāyantīti avajjhāyanti lāmakato cintenti. Khiyantīti kathenti pakāsenti. Vipācentīti tattha tattha kathenti vitthārenti. Eso kho mārisāti ettha ayamanupubbikathā – so kira anuppanne buddhe kāsiraṭṭhe bārāṇasirājā hutvā samussitaddhajapaṭākanānālaṅkārena suṭṭhu alaṅkataṃ nagaraṃ padakkhiṇaṃ akāsi attano sirisampattiyā samākaḍḍhitanettena janakāyena samullokiyamāno. Tasmiñca samaye eko paccekabuddho gandhamādanapabbatā āgamma tasmiṃ nagare piṇḍāya carati, santindriyo santamānaso uttamadamathasamannāgato. Mahājanopi rājagataṃ cittīkāraṃ pahāya paccekabuddhameva olokesi. Rājā – ‘‘idāni imasmiṃ janakāye ekopi maṃ na oloketi. Kiṃ nu kho eta’’nti? Olokento paccekabuddhaṃ addasa. Sopi paccekabuddho mahallako hoti pacchimavaye ṭhito. Cīvarānipissa jiṇṇāni, tato tato suttāni gaḷanti. Rañño satasahassādhikāni dve asaṅkhyeyyāni pūritapāramiṃ paccekabuddhaṃ disvā cittapasādamattaṃ vā hatthaṃ pasāretvā vandanamattaṃ vā nāhosi. So rājā ‘‘pabbajito maññe esa usūyāya maṃ na oloketī’’ti kujjhitvā ‘‘kvāyaṃ kuṭṭhicīvarāni pāruto’’ti niṭṭhubhitvā pakkāmi. Tassa kammassa vipākena mahāniraye nibbattitvā vipākāvasesena manussalokaṃ āgacchanto rājagahe paramakapaṇāya itthiyā kucchimhi paṭisandhiṃ gaṇhi. Gahitakālato paṭṭhāya sā itthī kañjikamattampi udarapūraṃ nālattha. Tassa kucchigatasseva kaṇṇanāsā vilīnā, saṅkhapalitakuṭṭhī hutvā mātukucchito nikkhanto. Mātāpitaro nāma dukkarakārikā honti, tenassa mātā yāva kapālaṃ gahetvā carituṃ na sakkoti, tāvassa kañjikampi udakampi āharitvā adāsi. Bhikkhāya carituṃ samatthakāle panassa kapālaṃ hatthe datvā ‘‘paññāyissasi sakena kammenā’’ti pakkāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassa ",
      " tato paṭṭhāya sakalasarīrato maṃsāni chijjitvā chijjitvā patanti, yūsaṃ paggharati, mahāvedanā vattanti. Yaṃ yaṃ racchaṃ nissāya sayati, sabbarattiṃ mahāravena ravati. Tassa kāruññaparidevitasaddena sakalavīthiyaṃ manussā sabbarattiṃ niddaṃ na labhanti. Tassa tato paṭṭhāya sukhasayite pabodhetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suppabuddho"
      },
      "tveva nāmaṃ udapādi. Athāparena samayena bhagavati rājagahaṃ sampatte nāgarā satthāraṃ nimantetvā nagaramajjhe mahāmaṇḍapaṃ katvā dānaṃ adaṃsu. Suppabuddhopi kuṭṭhī gantvā dānaggamaṇḍapassa avidūre nisīdi. Nāgarā buddhappamukhaṃ bhikkhusaṅghaṃ paṇītena khādanīyena bhojanīyena parivisantā tassāpi yāgubhattaṃ adaṃsu. Tassa paṇītabhojanaṃ bhuttassa cittaṃ ekaggaṃ ahosi. Satthā bhattakiccāvasāne anumodanaṃ katvā saccāni dīpesi, suppabuddho nisinnaṭṭhāne nisinnova desanānusārena ñāṇaṃ pesetvā sotāpattiphale patiṭṭhito. Satthā uṭṭhāya vihāraṃ gato. Sopi cumbaṭaṃ āruyha kapālamādāya daṇḍamolubbha attano vasanaṭṭhānaṃ gacchanto vibbhantāya gāviyā jīvitā voropito mattikapātiṃ bhinditvā suvaṇṇapātiṃ paṭilabhanto viya dutiyacittavāre devaloke nibbatto attano puññaṃ nissāya aññe deve atikkamma virocittha. Taṃ kāraṇaṃ dassento sakko devānamindo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "eso kho mārisā"
      },
      "tiādimāha."
    ],
    "innerText": "Athassa tato paṭṭhāya sakalasarīrato maṃsāni chijjitvā chijjitvā patanti, yūsaṃ paggharati, mahāvedanā vattanti. Yaṃ yaṃ racchaṃ nissāya sayati, sabbarattiṃ mahāravena ravati. Tassa kāruññaparidevitasaddena sakalavīthiyaṃ manussā sabbarattiṃ niddaṃ na labhanti. Tassa tato paṭṭhāya sukhasayite pabodhetīti suppabuddhotveva nāmaṃ udapādi. Athāparena samayena bhagavati rājagahaṃ sampatte nāgarā satthāraṃ nimantetvā nagaramajjhe mahāmaṇḍapaṃ katvā dānaṃ adaṃsu. Suppabuddhopi kuṭṭhī gantvā dānaggamaṇḍapassa avidūre nisīdi. Nāgarā buddhappamukhaṃ bhikkhusaṅghaṃ paṇītena khādanīyena bhojanīyena parivisantā tassāpi yāgubhattaṃ adaṃsu. Tassa paṇītabhojanaṃ bhuttassa cittaṃ ekaggaṃ ahosi. Satthā bhattakiccāvasāne anumodanaṃ katvā saccāni dīpesi, suppabuddho nisinnaṭṭhāne nisinnova desanānusārena ñāṇaṃ pesetvā sotāpattiphale patiṭṭhito. Satthā uṭṭhāya vihāraṃ gato. Sopi cumbaṭaṃ āruyha kapālamādāya daṇḍamolubbha attano vasanaṭṭhānaṃ gacchanto vibbhantāya gāviyā jīvitā voropito mattikapātiṃ bhinditvā suvaṇṇapātiṃ paṭilabhanto viya dutiyacittavāre devaloke nibbatto attano puññaṃ nissāya aññe deve atikkamma virocittha. Taṃ kāraṇaṃ dassento sakko devānamindo eso kho mārisātiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhā"
      },
      "ti maggenāgatasaddhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlañca yassa kalyāṇa"
      },
      "nti kalyāṇasīlaṃ nāma ariyasāvakassa ariyakantasīlaṃ vuccati. Tattha kiñcāpi ariyasāvakassa ekasīlampi akantaṃ nāma natthi, imasmiṃ panatthe bhavantarepi appahīnaṃ pañcasīlaṃ adhippetaṃ. Catutthaṃ."
    ],
    "innerText": "Saddhāti maggenāgatasaddhā. Sīlañca yassa kalyāṇanti kalyāṇasīlaṃ nāma ariyasāvakassa ariyakantasīlaṃ vuccati. Tattha kiñcāpi ariyasāvakassa ekasīlampi akantaṃ nāma natthi, imasmiṃ panatthe bhavantarepi appahīnaṃ pañcasīlaṃ adhippetaṃ. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Rāmaṇeyyakasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "261"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārāmacetyā"
      },
      "ti ārāmacetiyāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vanacetyā"
      },
      "ti vanacetiyāni. Ubhayatthāpi ",
      " cittīkataṭṭhena cetyaṃ veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manussarāmaṇeyyassā"
      },
      "ti manussaramaṇīyabhāvassa. Idāni manussaramaṇīyakavasena bhūmiramaṇīyakaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gāme vā"
      },
      "tiādimāha. Pañcamaṃ."
    ],
    "innerText": "261. Pañcame ārāmacetyāti ārāmacetiyāni. Vanacetyāti vanacetiyāni. Ubhayatthāpi cittīkataṭṭhena cetyaṃ veditabbaṃ. Manussarāmaṇeyyassāti manussaramaṇīyabhāvassa. Idāni manussaramaṇīyakavasena bhūmiramaṇīyakaṃ dassento gāme vātiādimāha. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Yajamānasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "262"
      },
      ". Chaṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yajamānāna"
      },
      "nti yajantānaṃ. Tadā kira aṅgamagadhavāsikā manussā anusaṃvaccharaṃ sappimadhuphāṇitādīsu aggaṃ gahetvā ekasmiṃ ṭhāne dārūnaṃ saṭṭhimatte sakaṭabhāre rāsiṃ katvā aggiṃ datvā pajjalitakāle ‘‘mahābrahmuno yajāmā’’ti taṃ sabbaṃ pakkhipanti. ‘‘Ekavāraṃ pakkhittaṃ sahassaguṇaphalaṃ detī’’ti nesaṃ laddhi. Sakko devarājā ‘‘sabbepime sabbaaggāni gahetvā ‘mahābrahmuno yajāmā’ti aggimhi jhāpenti. Aphalaṃ karonti, mayi passante mā nassantu, yathā buddhassa ceva saṅghassa ca datvā bahuṃ puññaṃ pasavanti, evaṃ karissāmī’’ti dārurāsiṃ jalāpetvā olokentesu manussesu puṇṇamadivase brahmattabhāvaṃ māpetvā mahājanassa passantasseva candamaṇḍalaṃ bhinditvā nikkhanto viya ahosi. Mahājano disvā ‘‘imaṃ yaññaṃ paṭiggahetuṃ mahābrahmā āgacchatī’’ti jaṇṇukehi bhūmiyaṃ patiṭṭhāya, añjaliṃ paggayha namassamāno aṭṭhāsi. Brāhmaṇā āhaṃsu ‘‘tumhe ‘mayaṃ takkena kathemā’ti maññatha, idāni passatha, ayaṃ vo brahmā sahatthā yaññaṃ paṭiggahetuṃ āgacchatī’’ti. Sakko āgantvā dārucitakamatthake ākāse ṭhatvā ‘‘kassāyaṃ sakkāro’’ti pucchi? Tumhākaṃ, bhante, paṭiggaṇhatha no yaññanti. Tena hi āgacchatha, mā tulaṃ chaḍḍetvā hatthena tulayittha, ayaṃ satthā dhuravihāre vasati, taṃ pucchissāma ‘‘kassa dinnaṃ mahapphalaṃ hotī’’ti ",
      "? Ubhayaraṭṭhavāsino gahetvā satthu santikaṃ gantvā pucchanto evamāha."
    ],
    "innerText": "262. Chaṭṭhe yajamānānanti yajantānaṃ. Tadā kira aṅgamagadhavāsikā manussā anusaṃvaccharaṃ sappimadhuphāṇitādīsu aggaṃ gahetvā ekasmiṃ ṭhāne dārūnaṃ saṭṭhimatte sakaṭabhāre rāsiṃ katvā aggiṃ datvā pajjalitakāle ‘‘mahābrahmuno yajāmā’’ti taṃ sabbaṃ pakkhipanti. ‘‘Ekavāraṃ pakkhittaṃ sahassaguṇaphalaṃ detī’’ti nesaṃ laddhi. Sakko devarājā ‘‘sabbepime sabbaaggāni gahetvā ‘mahābrahmuno yajāmā’ti aggimhi jhāpenti. Aphalaṃ karonti, mayi passante mā nassantu, yathā buddhassa ceva saṅghassa ca datvā bahuṃ puññaṃ pasavanti, evaṃ karissāmī’’ti dārurāsiṃ jalāpetvā olokentesu manussesu puṇṇamadivase brahmattabhāvaṃ māpetvā mahājanassa passantasseva candamaṇḍalaṃ bhinditvā nikkhanto viya ahosi. Mahājano disvā ‘‘imaṃ yaññaṃ paṭiggahetuṃ mahābrahmā āgacchatī’’ti jaṇṇukehi bhūmiyaṃ patiṭṭhāya, añjaliṃ paggayha namassamāno aṭṭhāsi. Brāhmaṇā āhaṃsu ‘‘tumhe ‘mayaṃ takkena kathemā’ti maññatha, idāni passatha, ayaṃ vo brahmā sahatthā yaññaṃ paṭiggahetuṃ āgacchatī’’ti. Sakko āgantvā dārucitakamatthake ākāse ṭhatvā ‘‘kassāyaṃ sakkāro’’ti pucchi? Tumhākaṃ, bhante, paṭiggaṇhatha no yaññanti. Tena hi āgacchatha, mā tulaṃ chaḍḍetvā hatthena tulayittha, ayaṃ satthā dhuravihāre vasati, taṃ pucchissāma ‘‘kassa dinnaṃ mahapphalaṃ hotī’’ti ? Ubhayaraṭṭhavāsino gahetvā satthu santikaṃ gantvā pucchanto evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puññapekkhāna"
      },
      "nti puññaṃ icchantānaṃ puññatthikānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Opadhikaṃ puñña"
      },
      "nti upadhivipākaṃ puññaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghe dinnaṃ mahapphala"
      },
      "nti ariyasaṅghe dinnaṃ vipphāravantaṃ hoti. Desanāvasāne caturāsītipāṇasahassāni amatapānaṃ piviṃsu. Tato paṭṭhāya manussā sabbāni aggadānāni bhikkhusaṅghassa adaṃsu. Chaṭṭhaṃ."
    ],
    "innerText": "Tattha puññapekkhānanti puññaṃ icchantānaṃ puññatthikānaṃ. Opadhikaṃ puññanti upadhivipākaṃ puññaṃ. Saṅghe dinnaṃ mahapphalanti ariyasaṅghe dinnaṃ vipphāravantaṃ hoti. Desanāvasāne caturāsītipāṇasahassāni amatapānaṃ piviṃsu. Tato paṭṭhāya manussā sabbāni aggadānāni bhikkhusaṅghassa adaṃsu. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Buddhavandanāsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "263"
      },
      ". Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uṭṭhehī"
      },
      "ti uṭṭhaha, ghaṭa, vāyama. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijitasaṅgāmā"
      },
      "ti rāgādīnañceva dvādasayojanikassa ca mārabalassa jitattā bhagavantaṃ evaṃ ālapati ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pannabhārā"
      },
      "ti oropitakhandhakilesābhisaṅkhārabhāra. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pannarasāya ratti"
      },
      "nti pannarasāya puṇṇamāya rattiṃ. Sattamaṃ."
    ],
    "innerText": "263. Sattame uṭṭhehīti uṭṭhaha, ghaṭa, vāyama. Vijitasaṅgāmāti rāgādīnañceva dvādasayojanikassa ca mārabalassa jitattā bhagavantaṃ evaṃ ālapati . Pannabhārāti oropitakhandhakilesābhisaṅkhārabhāra. Pannarasāya rattinti pannarasāya puṇṇamāya rattiṃ. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Gahaṭṭhavandanāsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "264"
      },
      ". Aṭṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puthuddisā"
      },
      "ti catasso disā catasso anudisā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhummā"
      },
      "ti bhūmivāsino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cirarattasamāhite"
      },
      "ti upacārappanāhi cirarattasamāhitacitte. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vande"
      },
      "ti vandāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brahmacariyaparāyaṇe"
      },
      "ti dasapi vassāni vīsatipi vassāni…pe… saṭṭhipi vassāni āpāṇakoṭikaṃ ekaseyyaṃ ekabhattantiādikaṃ seṭṭhacariyaṃ brahmacariyaṃ caramāneti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puññakarā"
      },
      "ti catupaccayadānaṃ kusumbhasumanapūjā dīpasahassajālanti evamādipuññakārakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlavanto"
      },
      "ti upāsakatte patiṭṭhāya pañcahipi dasahipi sīlehi samannāgatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammena dāraṃ posentī"
      },
      "ti umaṅgabhindanādīni akatvā dhammikehi kasigorakkhavaṇijjādīhi puttadāraṃ posenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pamukho rathamāruhī"
      },
      "ti devānaṃ pamukho seṭṭho rathaṃ āruhi. Aṭṭhamaṃ."
    ],
    "innerText": "264. Aṭṭhame puthuddisāti catasso disā catasso anudisā ca. Bhummāti bhūmivāsino. Cirarattasamāhiteti upacārappanāhi cirarattasamāhitacitte. Vandeti vandāmi. Brahmacariyaparāyaṇeti dasapi vassāni vīsatipi vassāni…pe… saṭṭhipi vassāni āpāṇakoṭikaṃ ekaseyyaṃ ekabhattantiādikaṃ seṭṭhacariyaṃ brahmacariyaṃ caramāneti attho. Puññakarāti catupaccayadānaṃ kusumbhasumanapūjā dīpasahassajālanti evamādipuññakārakā. Sīlavantoti upāsakatte patiṭṭhāya pañcahipi dasahipi sīlehi samannāgatā. Dhammena dāraṃ posentīti umaṅgabhindanādīni akatvā dhammikehi kasigorakkhavaṇijjādīhi puttadāraṃ posenti. Pamukho rathamāruhīti devānaṃ pamukho seṭṭho rathaṃ āruhi. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Satthāravandanāsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "265"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhagavantaṃ namassatī"
      },
      "ti ekaṃsaṃ uttariyaṃ dukulaṃ katvā, brahmajāṇuko hutvā sirasi añjaliṃ ṭhapetvā namassati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So yakkho"
      },
      "ti so sakko. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anomanāma"
      },
      "nti sabbaguṇehi omakabhāvassa natthitāya sabbaguṇanemittakehi nāmehi anomanāmaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avijjāsamatikkamā"
      },
      "ti catusaccapaṭicchādikāya vaṭṭamūlakaavijjāya samatikkamena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sekkhā"
      },
      "ti satta sekkhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apacayārāmā"
      },
      "ti vaṭṭaviddhaṃsane ratā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikkhare"
      },
      "ti sikkhanti. Navamaṃ."
    ],
    "innerText": "265. Navame bhagavantaṃ namassatīti ekaṃsaṃ uttariyaṃ dukulaṃ katvā, brahmajāṇuko hutvā sirasi añjaliṃ ṭhapetvā namassati. So yakkhoti so sakko. Anomanāmanti sabbaguṇehi omakabhāvassa natthitāya sabbaguṇanemittakehi nāmehi anomanāmaṃ. Avijjāsamatikkamāti catusaccapaṭicchādikāya vaṭṭamūlakaavijjāya samatikkamena. Sekkhāti satta sekkhā. Apacayārāmāti vaṭṭaviddhaṃsane ratā. Sikkhareti sikkhanti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Saṅghavandanāsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "266"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhabhāsī"
      },
      "ti kasmā esa punappunaṃ evaṃ bhāsatīti? Sakkassa kira devarañño ",
      " saddo madhuro, suphasitaṃ dantāvaraṇaṃ, kathanakāle suvaṇṇakiṅkiṇikasaddo viya niccharati. Taṃ punappunaṃ sotuṃ labhissāmīti bhāsati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pūtidehasayā"
      },
      "ti pūtimhi mātusarīre vā, attanoyeva vā sarīraṃ avattharitvā sayanato pūtidehasayā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nimuggā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kuṇapamhete"
      },
      "ti dasamāse mātukucchisaṅkhāte kuṇapasmiṃ ete nimuggā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etaṃ tesaṃ pihayāmī"
      },
      "ti etesaṃ etaṃ pihayāmi patthayāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na te saṃ koṭṭhe opentī"
      },
      "ti na te saṃ santakaṃ dhaññaṃ koṭṭhe pakkhipanti. Na hi etesaṃ dhaññaṃ atthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na kumbhī"
      },
      "ti na kumbhiyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na kaḷopiya"
      },
      "nti na pacchiyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paraniṭṭhitamesānā"
      },
      "ti paresaṃ niṭṭhitaṃ paraghare pakkaṃ bhikkhācāravattena esamānā gavesamānā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tenā"
      },
      "ti evaṃ pariyiṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Subbatā"
      },
      "ti dasapi…pe… saṭṭhipi vassāni susamādinnasundaravatā."
    ],
    "innerText": "266. Dasame ajjhabhāsīti kasmā esa punappunaṃ evaṃ bhāsatīti? Sakkassa kira devarañño saddo madhuro, suphasitaṃ dantāvaraṇaṃ, kathanakāle suvaṇṇakiṅkiṇikasaddo viya niccharati. Taṃ punappunaṃ sotuṃ labhissāmīti bhāsati. Pūtidehasayāti pūtimhi mātusarīre vā, attanoyeva vā sarīraṃ avattharitvā sayanato pūtidehasayā. Nimuggākuṇapamheteti dasamāse mātukucchisaṅkhāte kuṇapasmiṃ ete nimuggā. Etaṃ tesaṃ pihayāmīti etesaṃ etaṃ pihayāmi patthayāmi. Na te saṃ koṭṭhe opentīti na te saṃ santakaṃ dhaññaṃ koṭṭhe pakkhipanti. Na hi etesaṃ dhaññaṃ atthi. Na kumbhīti na kumbhiyaṃ. Na kaḷopiyanti na pacchiyaṃ. Paraniṭṭhitamesānāti paresaṃ niṭṭhitaṃ paraghare pakkaṃ bhikkhācāravattena esamānā gavesamānā. Tenāti evaṃ pariyiṭṭhena. Subbatāti dasapi…pe… saṭṭhipi vassāni susamādinnasundaravatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sumantamantino"
      },
      "ti dhammaṃ sajjhāyissāma, dhutaṅgaṃ samādiyissāma, amataṃ paribhuñjissāma, samaṇadhammaṃ karissāmāti evaṃ subhāsitabhāsino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tuṇhībhūtā samañcarā"
      },
      "ti tiyāmarattiṃ asanighosena ",
      " ghositā viya dhammaṃ kathentāpi tuṇhībhūtā samaṃ carantiyeva nāma. Kasmā? Niratthakavacanassābhāvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puthumaccā cā"
      },
      "ti bahusattā ca aññamaññaṃ viruddhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attadaṇḍesu nibbutā"
      },
      "ti paraviheṭhanatthaṃ gahitadaṇḍesu sattesu nibbutā vissaṭṭhadaṇḍā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādānesu anādānā"
      },
      "ti sagahaṇesu sattesu ca bhavayoniādīnaṃ ekakoṭṭhāsassāpi agahitattā agahaṇā. Dasamaṃ."
    ],
    "innerText": "Sumantamantinoti dhammaṃ sajjhāyissāma, dhutaṅgaṃ samādiyissāma, amataṃ paribhuñjissāma, samaṇadhammaṃ karissāmāti evaṃ subhāsitabhāsino. Tuṇhībhūtā samañcarāti tiyāmarattiṃ asanighosena ghositā viya dhammaṃ kathentāpi tuṇhībhūtā samaṃ carantiyeva nāma. Kasmā? Niratthakavacanassābhāvā. Puthumaccā cāti bahusattā ca aññamaññaṃ viruddhā. Attadaṇḍesu nibbutāti paraviheṭhanatthaṃ gahitadaṇḍesu sattesu nibbutā vissaṭṭhadaṇḍā. Sādānesu anādānāti sagahaṇesu sattesu ca bhavayoniādīnaṃ ekakoṭṭhāsassāpi agahitattā agahaṇā. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyo vaggo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Tatiyavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Chetvāsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "267"
      },
      ". Tatiyavaggassa paṭhamaṃ vuttatthameva. Paṭhamaṃ."
    ],
    "innerText": "267. Tatiyavaggassa paṭhamaṃ vuttatthameva. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Dubbaṇṇiyasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "268"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dubbaṇṇo"
      },
      "ti jhāmakhāṇuvaṇṇo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Okoṭimako"
      },
      "ti lakuṇḍako mahodaro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsane"
      },
      "ti paṇḍukambalasilāyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kodhabhakkho"
      },
      "ti sakkena gahitanāmamevetaṃ. So pana eko rūpāvacarabrahmā, ‘‘sakko kira khantibalena samannāgato’’ti sutvā vīmaṃsanatthaṃ āgato ",
      ". Avaruddhakayakkhā pana evarūpaṃ saṃvihitārakkhaṃ ṭhānaṃ pavisituṃ na sakkonti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasaṅkamī"
      },
      "ti devānaṃ sutvā ‘‘na sakkā esa pharusena cāletuṃ, nīcavuttinā pana khantiyaṃ ṭhitena sakkā palāpetu’’nti tathā palāpetukāmo upasaṅkami. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antaradhāyī"
      },
      "ti khantiyaṃ ṭhatvā balavacittīkāraṃ paccupaṭṭhapetvā nīcavuttiyā dassiyamānāya sakkāsane ṭhātuṃ asakkonto antaradhāyi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na sūpahatacittomhī"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sū"
      },
      "ti nipātamattaṃ, upahatacittomhīti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāvattena suvānayo"
      },
      "ti na kodhāvattena suānayo, kodhavase vattetuṃ na sukaromhīti vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na vo cirāha"
      },
      "nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vo"
      },
      "ti nipātamattaṃ, ahaṃ ciraṃ na kujjhāmīti vadati. Dutiyaṃ."
    ],
    "innerText": "268. Dutiye dubbaṇṇoti jhāmakhāṇuvaṇṇo. Okoṭimakoti lakuṇḍako mahodaro. Āsaneti paṇḍukambalasilāyaṃ. Kodhabhakkhoti sakkena gahitanāmamevetaṃ. So pana eko rūpāvacarabrahmā, ‘‘sakko kira khantibalena samannāgato’’ti sutvā vīmaṃsanatthaṃ āgato . Avaruddhakayakkhā pana evarūpaṃ saṃvihitārakkhaṃ ṭhānaṃ pavisituṃ na sakkonti. Upasaṅkamīti devānaṃ sutvā ‘‘na sakkā esa pharusena cāletuṃ, nīcavuttinā pana khantiyaṃ ṭhitena sakkā palāpetu’’nti tathā palāpetukāmo upasaṅkami. Antaradhāyīti khantiyaṃ ṭhatvā balavacittīkāraṃ paccupaṭṭhapetvā nīcavuttiyā dassiyamānāya sakkāsane ṭhātuṃ asakkonto antaradhāyi. Na sūpahatacittomhīti ettha sūti nipātamattaṃ, upahatacittomhīti āha. Nāvattena suvānayoti na kodhāvattena suānayo, kodhavase vattetuṃ na sukaromhīti vadati. Na vo cirāhanti voti nipātamattaṃ, ahaṃ ciraṃ na kujjhāmīti vadati. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Sambarimāyāsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "269"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ābādhiko"
      },
      "ti isigaṇena abhisapakāle uppannābādhena ābādhiko. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vācehi ma"
      },
      "nti sace maṃ sambarimāyaṃ vācesi, evamahaṃ tampi tikicchissāmīti vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mā kho tvaṃ, mārisa, vācesī"
      },
      "ti vināpi tāva sambarimāyaṃ sakko amhe bādhati, yadi pana taṃ jānissati, naṭṭhā mayaṃ, mā attano ekassa atthāya amhe nāsehīti vatvā nivārayiṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sambarova sataṃ sama"
      },
      "nti yathā sambaro asurindo māyāvī māyaṃ payojetvā vassasataṃ niraye pakko, evaṃ paccati. Tumhe dhammikāva, alaṃ vo māyāyāti vadati. Kiṃ pana sakko tassa kodhaṃ tikicchituṃ sakkuṇeyyāti? Āma sakkuṇeyya. Kathaṃ? Tadā kira so isigaṇo dharatiyeva, tasmā naṃ isīnaṃ santikaṃ netvā khamāpeyya, evamassa phāsu bhaveyya. Tena pana vañcitattā tathā akatvā pakkantova. Tatiyaṃ."
    ],
    "innerText": "269. Tatiye ābādhikoti isigaṇena abhisapakāle uppannābādhena ābādhiko. Vācehi manti sace maṃ sambarimāyaṃ vācesi, evamahaṃ tampi tikicchissāmīti vadati. Mā kho tvaṃ, mārisa, vācesīti vināpi tāva sambarimāyaṃ sakko amhe bādhati, yadi pana taṃ jānissati, naṭṭhā mayaṃ, mā attano ekassa atthāya amhe nāsehīti vatvā nivārayiṃsu. Sambarova sataṃ samanti yathā sambaro asurindo māyāvī māyaṃ payojetvā vassasataṃ niraye pakko, evaṃ paccati. Tumhe dhammikāva, alaṃ vo māyāyāti vadati. Kiṃ pana sakko tassa kodhaṃ tikicchituṃ sakkuṇeyyāti? Āma sakkuṇeyya. Kathaṃ? Tadā kira so isigaṇo dharatiyeva, tasmā naṃ isīnaṃ santikaṃ netvā khamāpeyya, evamassa phāsu bhaveyya. Tena pana vañcitattā tathā akatvā pakkantova. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Accayasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "270"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampayojesu"
      },
      "nti kalahaṃ akaṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Accasarā"
      },
      "ti atikkami, eko bhikkhu ekaṃ ",
      " bhikkhuṃ atikkamma vacanaṃ avocāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathādhammaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nappaṭiggaṇhātī"
      },
      "ti na khamati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kodho vo vasamāyātū"
      },
      "ti kodho tumhākaṃ vasaṃ āgacchatu, mā tumhe kodhavasaṃ gamitthāti dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mā ca mitte hi vo jarā"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hī"
      },
      "ti nipātamattaṃ, tumhākaṃ mittadhamme jarā nāma mā nibbatti. Bhummatthe vā karaṇavacanaṃ, mittesu vo jarā mā nibbatti, mittabhāvato aññathābhāvo mā hotūti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Agarahiyaṃ mā garahitthā"
      },
      "ti agārayhaṃ khīṇāsavapuggalaṃ mā garahittha. Catutthaṃ."
    ],
    "innerText": "270. Catutthe sampayojesunti kalahaṃ akaṃsu. Accasarāti atikkami, eko bhikkhu ekaṃ bhikkhuṃ atikkamma vacanaṃ avocāti attho. Yathādhammaṃnappaṭiggaṇhātīti na khamati. Kodho vo vasamāyātūti kodho tumhākaṃ vasaṃ āgacchatu, mā tumhe kodhavasaṃ gamitthāti dīpeti. Mā ca mitte hi vo jarāti ettha hīti nipātamattaṃ, tumhākaṃ mittadhamme jarā nāma mā nibbatti. Bhummatthe vā karaṇavacanaṃ, mittesu vo jarā mā nibbatti, mittabhāvato aññathābhāvo mā hotūti attho. Agarahiyaṃ mā garahitthāti agārayhaṃ khīṇāsavapuggalaṃ mā garahittha. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Akkodhasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "271"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mā vo kodho ajjhabhavī"
      },
      "ti kodho tumhe mā abhibhavi, tumheva kodhaṃ abhibhavatha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mā ca kujjhittha kujjhita"
      },
      "nti kujjhantānaṃ mā paṭikujjhittha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akkodho"
      },
      "ti mettā ",
      " ca mettāpubbabhāgo ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avihiṃsā"
      },
      "ti karuṇā ca karuṇāpubbabhāgo ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha pāpajanaṃ kodho, pabbatovābhimaddatī"
      },
      "ti lāmakajanaṃ pabbato viya kodho abhimaddatīti. Pañcamaṃ."
    ],
    "innerText": "271. Pañcame mā vo kodho ajjhabhavīti kodho tumhe mā abhibhavi, tumheva kodhaṃ abhibhavatha. Mā ca kujjhittha kujjhitanti kujjhantānaṃ mā paṭikujjhittha. Akkodhoti mettā ca mettāpubbabhāgo ca. Avihiṃsāti karuṇā ca karuṇāpubbabhāgo ca. Atha pāpajanaṃ kodho, pabbatovābhimaddatīti lāmakajanaṃ pabbato viya kodho abhimaddatīti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tatiyo vaggo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sakkasaṃyuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti sāratthappakāsiniyā saṃyuttanikāya-aṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sagāthāvaggavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṃyuttanikāya-aṭṭhakathāya paṭhamo bhāgo."
  }
]