[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Kosalasaṃyuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paṭhamavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Daharasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "112"
      },
      ". Kosalasaṃyuttassa ",
      " paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhagavatā saddhiṃ sammodī"
      },
      "ti yathā khamanīyādīni pucchanto bhagavā tena, evaṃ sopi bhagavatā saddhiṃ samappavattamodo ahosi. Sītodakaṃ viya uṇhodakena sammoditaṃ ekībhāvaṃ agamāsi. Yāya ca – ‘‘kacci, bho gotama, khamanīyaṃ, kacci yāpanīyaṃ, kacci bhoto ca gotamassa sāvakānañca appābādhaṃ appātaṅkaṃ lahuṭṭhānaṃ balaṃ phāsuvihāro’’tiādikāya kathāya sammodi, taṃ pītipāmojjasaṅkhātasammodajananato sammodituṃ yuttabhāvato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammodanīyaṃ,"
      },
      " atthabyañjanamadhuratāya cirampi kālaṃ sāretuṃ nirantaraṃ pavattetuṃ araharūpato saritabbabhāvato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāraṇīyaṃ"
      },
      ". Suyyamānasukhato ca sammodanīyaṃ, anussariyamānasukhato sāraṇīyaṃ. Tathā byañjanaparisuddhatāya sammodanīyaṃ, atthaparisuddhatāya sāraṇīyanti evaṃ anekehi pariyāyehi sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā pariyosāpetvā niṭṭhapetvā ito pubbe tathāgatassa adiṭṭhattā guṇāguṇavasena gambhīrabhāvaṃ vā uttānabhāvaṃ vā ajānanto ekamantaṃ nisīdi, ekamantaṃ nisinno kho yaṃ ovaṭṭikasāraṃ katvā āgato lokanissaraṇabhavokkantipañhaṃ satthu sammāsambuddhataṃ pucchituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhavampi no"
      },
      "tiādimāha."
    ],
    "innerText": "112. Kosalasaṃyuttassa paṭhame bhagavatā saddhiṃ sammodīti yathā khamanīyādīni pucchanto bhagavā tena, evaṃ sopi bhagavatā saddhiṃ samappavattamodo ahosi. Sītodakaṃ viya uṇhodakena sammoditaṃ ekībhāvaṃ agamāsi. Yāya ca – ‘‘kacci, bho gotama, khamanīyaṃ, kacci yāpanīyaṃ, kacci bhoto ca gotamassa sāvakānañca appābādhaṃ appātaṅkaṃ lahuṭṭhānaṃ balaṃ phāsuvihāro’’tiādikāya kathāya sammodi, taṃ pītipāmojjasaṅkhātasammodajananato sammodituṃ yuttabhāvato ca sammodanīyaṃ, atthabyañjanamadhuratāya cirampi kālaṃ sāretuṃ nirantaraṃ pavattetuṃ araharūpato saritabbabhāvato ca sāraṇīyaṃ. Suyyamānasukhato ca sammodanīyaṃ, anussariyamānasukhato sāraṇīyaṃ. Tathā byañjanaparisuddhatāya sammodanīyaṃ, atthaparisuddhatāya sāraṇīyanti evaṃ anekehi pariyāyehi sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā pariyosāpetvā niṭṭhapetvā ito pubbe tathāgatassa adiṭṭhattā guṇāguṇavasena gambhīrabhāvaṃ vā uttānabhāvaṃ vā ajānanto ekamantaṃ nisīdi, ekamantaṃ nisinno kho yaṃ ovaṭṭikasāraṃ katvā āgato lokanissaraṇabhavokkantipañhaṃ satthu sammāsambuddhataṃ pucchituṃ bhavampi notiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhavampī"
      },
      "ti pi-kāro sampiṇḍanatthe nipāto, tena ca cha satthāre sampiṇḍeti. Yathā pūraṇādayo ‘‘sammāsambuddhamhā’’ti paṭijānanti, evaṃ bhavampi nu paṭijānātīti attho. Idaṃ pana rājā na attano laddhiyā, loke mahājanena ",
      " gahitapaṭiññāvasena pucchati. Atha bhagavā buddhasīhanādaṃ nadanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yaṃ hi taṃ mahārājā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ahaṃ hi mahārājā"
      },
      "ti anuttaraṃ sabbaseṭṭhaṃ sabbaññutaññāṇasaṅkhātaṃ sammāsambodhiṃ ahaṃ abhisambuddhoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaṇabrāhmaṇā"
      },
      "ti ",
      " pabbajjūpagamanena ",
      " samaṇā, jātivasena brāhmaṇā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghino"
      },
      "tiādīsu pabbajitasamūhasaṅkhāto saṅgho etesaṃ atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅghino"
      },
      ". Sveva gaṇo etesaṃ atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gaṇino"
      },
      ". Ācārasikkhāpanavasena tassa gaṇassa ācariyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gaṇācariyā. Ñātā"
      },
      "ti paññātā pākaṭā. ‘‘Appicchā santuṭṭhā appicchatāya vatthampi na nivāsentī’’ti evaṃ samuggato yaso etesaṃ atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yasassino. Titthakarā"
      },
      "ti laddhikarā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhusammatā"
      },
      "ti ‘‘santo sappurisā’’ti evaṃ sammatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahujanassā"
      },
      "ti assutavato andhabālaputhujjanassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pūraṇo"
      },
      "tiādīni tesaṃ nāmagottāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pūraṇo"
      },
      "ti hi nāmameva. Tathā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "makkhalī"
      },
      "ti. So pana gosālāya jātattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gosālo"
      },
      "ti vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāṭaputto"
      },
      "ti nāṭassa putto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Belaṭṭhaputto"
      },
      "ti belaṭṭhassa putto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaccāyano"
      },
      "ti pakudhassa gottaṃ. Kesakambalassa dhāraṇato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajito kesakambalo"
      },
      "ti vutto."
    ],
    "innerText": "Tattha bhavampīti pi-kāro sampiṇḍanatthe nipāto, tena ca cha satthāre sampiṇḍeti. Yathā pūraṇādayo ‘‘sammāsambuddhamhā’’ti paṭijānanti, evaṃ bhavampi nu paṭijānātīti attho. Idaṃ pana rājā na attano laddhiyā, loke mahājanena gahitapaṭiññāvasena pucchati. Atha bhagavā buddhasīhanādaṃ nadanto yaṃ hi taṃ mahārājātiādimāha. Tattha ahaṃ hi mahārājāti anuttaraṃ sabbaseṭṭhaṃ sabbaññutaññāṇasaṅkhātaṃ sammāsambodhiṃ ahaṃ abhisambuddhoti attho. Samaṇabrāhmaṇāti pabbajjūpagamanena samaṇā, jātivasena brāhmaṇā. Saṅghinotiādīsu pabbajitasamūhasaṅkhāto saṅgho etesaṃ atthīti saṅghino. Sveva gaṇo etesaṃ atthīti gaṇino. Ācārasikkhāpanavasena tassa gaṇassa ācariyāti gaṇācariyā. Ñātāti paññātā pākaṭā. ‘‘Appicchā santuṭṭhā appicchatāya vatthampi na nivāsentī’’ti evaṃ samuggato yaso etesaṃ atthīti yasassino. Titthakarāti laddhikarā. Sādhusammatāti ‘‘santo sappurisā’’ti evaṃ sammatā. Bahujanassāti assutavato andhabālaputhujjanassa. Pūraṇotiādīni tesaṃ nāmagottāni. Pūraṇoti hi nāmameva. Tathā, makkhalīti. So pana gosālāya jātattā gosāloti vutto. Nāṭaputtoti nāṭassa putto. Belaṭṭhaputtoti belaṭṭhassa putto. Kaccāyanoti pakudhassa gottaṃ. Kesakambalassa dhāraṇato ajito kesakambaloti vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tepi mayā"
      },
      "ti kappakolāhalaṃ buddhakolāhalaṃ cakkavattikolāhalanti tīṇi kolāhalāni. Tattha ‘‘vassasatasahassamatthake kappuṭṭhānaṃ bhavissatī’’ti kappakolāhalaṃ nāma hoti – ‘‘ito vassasatasahassamatthake loko vinassissati, mettaṃ mārisā, bhāvetha, karuṇaṃ muditaṃ upekkha’’nti manussappathe devatā ghosentiyo vicaranti. ‘‘Vassasahassamatthake pana buddho uppajjissatī’’ti buddhakolāhalaṃ nāma hoti – ‘‘ito vassasahassamatthake buddho uppajjitvā dhammānudhammapaṭipadaṃ paṭipannena saṅgharatanena parivārito dhammaṃ desento vicarissatī’’ti devatā ugghosenti. ‘‘Vassasatamatthake pana cakkavattī uppajjissatī’’ti cakkavattikolāhalaṃ nāma hoti – ‘‘ito vassasatamatthake sattaratanasampanno catuddīpissaro ",
      " sahassa puttaparivāro vehāsaṅgamo cakkavattirājā uppajjissatī’’ti devatā ugghosenti."
    ],
    "innerText": "Tepi mayāti kappakolāhalaṃ buddhakolāhalaṃ cakkavattikolāhalanti tīṇi kolāhalāni. Tattha ‘‘vassasatasahassamatthake kappuṭṭhānaṃ bhavissatī’’ti kappakolāhalaṃ nāma hoti – ‘‘ito vassasatasahassamatthake loko vinassissati, mettaṃ mārisā, bhāvetha, karuṇaṃ muditaṃ upekkha’’nti manussappathe devatā ghosentiyo vicaranti. ‘‘Vassasahassamatthake pana buddho uppajjissatī’’ti buddhakolāhalaṃ nāma hoti – ‘‘ito vassasahassamatthake buddho uppajjitvā dhammānudhammapaṭipadaṃ paṭipannena saṅgharatanena parivārito dhammaṃ desento vicarissatī’’ti devatā ugghosenti. ‘‘Vassasatamatthake pana cakkavattī uppajjissatī’’ti cakkavattikolāhalaṃ nāma hoti – ‘‘ito vassasatamatthake sattaratanasampanno catuddīpissaro sahassa puttaparivāro vehāsaṅgamo cakkavattirājā uppajjissatī’’ti devatā ugghosenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesu tīsu kolāhalesu ime cha satthāro buddhakolāhalaṃ sutvā ācariye payirupāsitvā cintāmāṇivijjādīni uggaṇhitvā – ‘‘mayaṃ buddhamhā’’ti paṭiññaṃ katvā mahājanaparivutā janapadaṃ vicarantā anupubbena sāvatthiyaṃ pattā. Tesaṃ upaṭṭhākā rājānaṃ upasaṅkamitvā, ‘‘mahārāja, pūraṇo kassapo…pe… ajito kesakambalo buddho kira sabbaññū kirā’’ti ārocesuṃ. Rājā ‘‘tumheva ne nimantetvā ānethā’’ti āha ",
      ". Te gantvā tehi, ‘‘rājā vo nimanteti. Rañño gehe bhikkhaṃ gaṇhathā’’ti vuttā gantuṃ na ussahanti, punappunaṃ vuccamānā upaṭṭhākānaṃ cittānurakkhaṇatthāya adhivāsetvā sabbe ekatova agamaṃsu. Rājā āsanāni paññāpetvā ",
      " ‘‘nisīdantū’’ti āha. Nigguṇānaṃ attabhāve rājusmā nāma pharati, te mahārahesu āsanesu nisīdituṃ asakkontā phalakesu ceva bhūmiyaṃ ca nisīdiṃsu."
    ],
    "innerText": "Imesu tīsu kolāhalesu ime cha satthāro buddhakolāhalaṃ sutvā ācariye payirupāsitvā cintāmāṇivijjādīni uggaṇhitvā – ‘‘mayaṃ buddhamhā’’ti paṭiññaṃ katvā mahājanaparivutā janapadaṃ vicarantā anupubbena sāvatthiyaṃ pattā. Tesaṃ upaṭṭhākā rājānaṃ upasaṅkamitvā, ‘‘mahārāja, pūraṇo kassapo…pe… ajito kesakambalo buddho kira sabbaññū kirā’’ti ārocesuṃ. Rājā ‘‘tumheva ne nimantetvā ānethā’’ti āha . Te gantvā tehi, ‘‘rājā vo nimanteti. Rañño gehe bhikkhaṃ gaṇhathā’’ti vuttā gantuṃ na ussahanti, punappunaṃ vuccamānā upaṭṭhākānaṃ cittānurakkhaṇatthāya adhivāsetvā sabbe ekatova agamaṃsu. Rājā āsanāni paññāpetvā ‘‘nisīdantū’’ti āha. Nigguṇānaṃ attabhāve rājusmā nāma pharati, te mahārahesu āsanesu nisīdituṃ asakkontā phalakesu ceva bhūmiyaṃ ca nisīdiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rājā ‘‘ettakeneva natthi tesaṃ anto sukkadhammo’’ti vatvā āhāraṃ adatvāva tālato patitaṃ muggarena pothento viya ‘‘tumhe buddhā, na buddhā’’ti pañhaṃ pucchi. Te cintayiṃsu – ‘‘sace ‘buddhamhā’ti vakkhāma, rājā buddhavisaye pañhaṃ pucchitvā kathetuṃ asakkonte ‘tumhe mayaṃ buddhāti mahājanaṃ vañcetvā āhiṇḍathā’ti jivhampi chindāpeyya, aññampi anatthaṃ kareyyā’’ti sakapaṭiññāya eva ‘na mayaṃ buddhā’ti vadiṃsu. Atha ne rājā gehato nikaḍḍhāpesi. Te rājagharato nikkhante upaṭṭhākā pucchiṃsu – ‘‘kiṃ ācariyā rājā tumhe pañhaṃ pucchitvā sakkārasammānaṃ akāsī’’ti? Rājā ‘‘buddhā tumhe’’ti pucchi, tato mayaṃ – ‘‘sace ayaṃ rājā buddhavisaye pañhaṃ kathiyamānaṃ ajānanto amhesu manaṃ padosessati, bahuṃ apuññaṃ pasavissatī’’ti rañño anukampāya ‘na mayaṃ buddhā’ti vadimhā, mayaṃ pana buddhā eva, amhākaṃ buddhabhāvo, udakena dhovitvāpi harituṃ na sakkāti. Iti bahiddhā ‘buddhamhā’ti ",
      " āhaṃsu – rañño santike ‘na mayaṃ buddhā’ti vadiṃsūti, idaṃ gahetvā rājā evamāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiṃ pana bhavaṃ gotamo daharo ceva jātiyā, navo ca pabbajjāyā"
      },
      "ti idaṃ attano paṭiññaṃ gahetvā vadati. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ki"
      },
      "nti paṭikkhepavacanaṃ. Ete jātimahallakā ca cirapabbajitā ca ‘‘buddhamhā’’ti na paṭijānanti, bhavaṃ gotamo jātiyā ca daharo pabbajjāya ca navo kiṃ paṭijānāti? Mā paṭijānāhīti attho."
    ],
    "innerText": "Rājā ‘‘ettakeneva natthi tesaṃ anto sukkadhammo’’ti vatvā āhāraṃ adatvāva tālato patitaṃ muggarena pothento viya ‘‘tumhe buddhā, na buddhā’’ti pañhaṃ pucchi. Te cintayiṃsu – ‘‘sace ‘buddhamhā’ti vakkhāma, rājā buddhavisaye pañhaṃ pucchitvā kathetuṃ asakkonte ‘tumhe mayaṃ buddhāti mahājanaṃ vañcetvā āhiṇḍathā’ti jivhampi chindāpeyya, aññampi anatthaṃ kareyyā’’ti sakapaṭiññāya eva ‘na mayaṃ buddhā’ti vadiṃsu. Atha ne rājā gehato nikaḍḍhāpesi. Te rājagharato nikkhante upaṭṭhākā pucchiṃsu – ‘‘kiṃ ācariyā rājā tumhe pañhaṃ pucchitvā sakkārasammānaṃ akāsī’’ti? Rājā ‘‘buddhā tumhe’’ti pucchi, tato mayaṃ – ‘‘sace ayaṃ rājā buddhavisaye pañhaṃ kathiyamānaṃ ajānanto amhesu manaṃ padosessati, bahuṃ apuññaṃ pasavissatī’’ti rañño anukampāya ‘na mayaṃ buddhā’ti vadimhā, mayaṃ pana buddhā eva, amhākaṃ buddhabhāvo, udakena dhovitvāpi harituṃ na sakkāti. Iti bahiddhā ‘buddhamhā’ti āhaṃsu – rañño santike ‘na mayaṃ buddhā’ti vadiṃsūti, idaṃ gahetvā rājā evamāha. Tattha kiṃ pana bhavaṃ gotamo daharo ceva jātiyā, navo ca pabbajjāyāti idaṃ attano paṭiññaṃ gahetvā vadati. Tattha kinti paṭikkhepavacanaṃ. Ete jātimahallakā ca cirapabbajitā ca ‘‘buddhamhā’’ti na paṭijānanti, bhavaṃ gotamo jātiyā ca daharo pabbajjāya ca navo kiṃ paṭijānāti? Mā paṭijānāhīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na uññātabbā"
      },
      "ti na avajānitabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na paribhotabbā"
      },
      "ti na paribhavitabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katame cattāro"
      },
      "ti kathetukamyatāpucchā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khattiyo"
      },
      "ti rājakumāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Urago"
      },
      "ti āsīviso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aggī"
      },
      "ti aggiyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhū"
      },
      "ti imasmiṃ pana pade desanākusalatāya attānaṃ abbhantaraṃ katvā sīlavantaṃ pabbajitaṃ dasseti. Ettha ",
      " ca daharaṃ rājakumāraṃ disvā, ukkamitvā maggaṃ adento, pārupanaṃ anapanento, nisinnāsanato anuṭṭhahanto, hatthipiṭṭhādīhi anotaranto, heṭṭhā katvā maññanavasena aññampi evarūpaṃ anācāraṃ karonto khattiyaṃ avajānāti nāma. ‘‘Bhaddako vatāyaṃ rājakumāro, mahākaṇḍo mahodaro – kiṃ nāma yaṃkiñci corūpaddavaṃ vūpasametuṃ yattha katthaci ṭhāne rajjaṃ anusāsituṃ sakkhissatī’’tiādīni vadanto paribhoti nāma. Añjanisalākamattampi āsīvisapotakaṃ kaṇṇādīsu piḷandhanto aṅgulimpi jivhampi ḍaṃsāpento uragaṃ avajānāti nāma ",
      ". ‘‘Bhaddako vatāyaṃ āsīviso udakadeḍḍubho viya kiṃ nāma kiñcideva ḍaṃsituṃ kassacideva kāye visaṃ pharituṃ sakkhissatī’’tiādīni vadanto paribhoti nāma. Khajjopanakamattampi aggiṃ gahetvā hatthena kīḷanto bhaṇḍukkhalikāya khipanto cūḷāya vā sayanapiṭṭhasāṭakapasibbakādīsu vā ṭhapento aggiṃ avajānāti nāma. ‘‘Bhaddako vatāyaṃ aggi kataraṃ nu kho yāgubhattaṃ pacissati, kataraṃ macchamaṃsaṃ, kassa sītaṃ vinodessatī’’tiādīni vadanto paribhoti nāma. Daharasāmaṇerampi pana disvā ukkamitvā maggaṃ adentoti ",
      " rājakumāre vuttaṃ anācāraṃ karonto bhikkhuṃ avajānāti nāma. ‘‘Bhaddako vatāyaṃ sāmaṇero mahākaṇṭho mahodaro yaṃkiñci buddhavacanaṃ uggahetuṃ yaṃkiñci araññaṃ ajjhogāhetvā vasituṃ sakkhissati, saṅghattherakāle manāpo bhavissatī’’tiādīni vadanto paribhoti nāma. Taṃ sabbampi na kātabbanti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na uññātabbo na paribhotabbo"
      },
      "ti āha."
    ],
    "innerText": "Na uññātabbāti na avajānitabbā. Na paribhotabbāti na paribhavitabbā. Katame cattāroti kathetukamyatāpucchā. Khattiyoti rājakumāro. Uragoti āsīviso. Aggīti aggiyeva. Bhikkhūti imasmiṃ pana pade desanākusalatāya attānaṃ abbhantaraṃ katvā sīlavantaṃ pabbajitaṃ dasseti. Ettha ca daharaṃ rājakumāraṃ disvā, ukkamitvā maggaṃ adento, pārupanaṃ anapanento, nisinnāsanato anuṭṭhahanto, hatthipiṭṭhādīhi anotaranto, heṭṭhā katvā maññanavasena aññampi evarūpaṃ anācāraṃ karonto khattiyaṃ avajānāti nāma. ‘‘Bhaddako vatāyaṃ rājakumāro, mahākaṇḍo mahodaro – kiṃ nāma yaṃkiñci corūpaddavaṃ vūpasametuṃ yattha katthaci ṭhāne rajjaṃ anusāsituṃ sakkhissatī’’tiādīni vadanto paribhoti nāma. Añjanisalākamattampi āsīvisapotakaṃ kaṇṇādīsu piḷandhanto aṅgulimpi jivhampi ḍaṃsāpento uragaṃ avajānāti nāma . ‘‘Bhaddako vatāyaṃ āsīviso udakadeḍḍubho viya kiṃ nāma kiñcideva ḍaṃsituṃ kassacideva kāye visaṃ pharituṃ sakkhissatī’’tiādīni vadanto paribhoti nāma. Khajjopanakamattampi aggiṃ gahetvā hatthena kīḷanto bhaṇḍukkhalikāya khipanto cūḷāya vā sayanapiṭṭhasāṭakapasibbakādīsu vā ṭhapento aggiṃ avajānāti nāma. ‘‘Bhaddako vatāyaṃ aggi kataraṃ nu kho yāgubhattaṃ pacissati, kataraṃ macchamaṃsaṃ, kassa sītaṃ vinodessatī’’tiādīni vadanto paribhoti nāma. Daharasāmaṇerampi pana disvā ukkamitvā maggaṃ adentoti rājakumāre vuttaṃ anācāraṃ karonto bhikkhuṃ avajānāti nāma. ‘‘Bhaddako vatāyaṃ sāmaṇero mahākaṇṭho mahodaro yaṃkiñci buddhavacanaṃ uggahetuṃ yaṃkiñci araññaṃ ajjhogāhetvā vasituṃ sakkhissati, saṅghattherakāle manāpo bhavissatī’’tiādīni vadanto paribhoti nāma. Taṃ sabbampi na kātabbanti dassento na uññātabbo na paribhotabboti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etadavocā"
      },
      "ti etaṃ gāthābandhaṃ avoca. Gāthā ca nāmetā tadatthadīpanāpi honti visesatthadīpanāpi, tatrimā tadatthampi visesatthampi dīpentiyeva. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khattiya"
      },
      "nti khettānaṃ adhipatiṃ. Vuttañhetaṃ ‘‘khettānaṃ adhipatīti kho, vāseṭṭha, ‘khattiyo khattiyo’tveva dutiyaṃ akkharaṃ upanibbatta’’nti (dī. ni. 3.131). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jātisampanna"
      },
      "nti tāyeva khattiyajātiyā jātisampannaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhijāta"
      },
      "nti tīṇi kulāni atikkamitvā jātaṃ."
    ],
    "innerText": "Etadavocāti etaṃ gāthābandhaṃ avoca. Gāthā ca nāmetā tadatthadīpanāpi honti visesatthadīpanāpi, tatrimā tadatthampi visesatthampi dīpentiyeva. Tattha khattiyanti khettānaṃ adhipatiṃ. Vuttañhetaṃ ‘‘khettānaṃ adhipatīti kho, vāseṭṭha, ‘khattiyo khattiyo’tveva dutiyaṃ akkharaṃ upanibbatta’’nti (dī. ni. 3.131). Jātisampannanti tāyeva khattiyajātiyā jātisampannaṃ. Abhijātanti tīṇi kulāni atikkamitvā jātaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhānaṃ hī"
      },
      "ti kāraṇaṃ vijjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manujindo"
      },
      "ti manussajeṭṭhako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājadaṇḍenā"
      },
      "ti rañño uddhaṭadaṇḍena, so appako nāma na hoti, dasasahassavīsatisahassappamāṇo hotiyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmiṃ pakkamate bhusa"
      },
      "nti ",
      " tasmiṃ puggale balavaupakkamaṃ upakkamati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rakkhaṃ jīvitamattano"
      },
      "ti attano jīvitaṃ rakkhamāno taṃ khattiyaṃ parivajjeyya na ghaṭṭeyya."
    ],
    "innerText": "Ṭhānaṃ hīti kāraṇaṃ vijjati. Manujindoti manussajeṭṭhako. Rājadaṇḍenāti rañño uddhaṭadaṇḍena, so appako nāma na hoti, dasasahassavīsatisahassappamāṇo hotiyeva. Tasmiṃ pakkamate bhusanti tasmiṃ puggale balavaupakkamaṃ upakkamati. Rakkhaṃ jīvitamattanoti attano jīvitaṃ rakkhamāno taṃ khattiyaṃ parivajjeyya na ghaṭṭeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uccāvacehī"
      },
      "ti nānāvidhehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaṇṇehī"
      },
      "ti saṇṭhānehi. Yena yena hi vaṇṇena caranto gocaraṃ labhati, yadi sappavaṇṇena, yadi deḍḍubhavaṇṇena, yadi dhamanivaṇṇena, antamaso kalandakavaṇṇenapi caratiyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsajjā"
      },
      "ti patvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bāla"
      },
      "nti yena bālena ghaṭṭito, taṃ bālaṃ naraṃ vā nāriṃ vā ḍaṃseyya."
    ],
    "innerText": "Uccāvacehīti nānāvidhehi. Vaṇṇehīti saṇṭhānehi. Yena yena hi vaṇṇena caranto gocaraṃ labhati, yadi sappavaṇṇena, yadi deḍḍubhavaṇṇena, yadi dhamanivaṇṇena, antamaso kalandakavaṇṇenapi caratiyeva. Āsajjāti patvā. Bālanti yena bālena ghaṭṭito, taṃ bālaṃ naraṃ vā nāriṃ vā ḍaṃseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pahūtabhakkha"
      },
      "nti bahubhakkhaṃ. Aggissa hi abhakkhaṃ nāma natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jālina"
      },
      "nti jālavantaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāvaka"
      },
      "nti ",
      " aggiṃ. Pāvagantipi pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṇhavattani"
      },
      "nti vattanīti maggo, agginā gatamaggo kaṇho hoti kāḷako, tasmā ‘‘kaṇhavattanī’’ti vuccati."
    ],
    "innerText": "Pahūtabhakkhanti bahubhakkhaṃ. Aggissa hi abhakkhaṃ nāma natthi. Jālinanti jālavantaṃ. Pāvakanti aggiṃ. Pāvagantipi pāṭho. Kaṇhavattaninti vattanīti maggo, agginā gatamaggo kaṇho hoti kāḷako, tasmā ‘‘kaṇhavattanī’’ti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahā hutvānā"
      },
      "ti mahanto hutvā. Aggi hi ekadā yāvabrahmalokappamāṇopi hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jāyanti"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha pārohā"
      },
      "ti tattha agginā daḍḍhavane pārohā jāyanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pārohā"
      },
      "ti tiṇarukkhādayo vuccanti. Te hi agginā daḍḍhaṭṭhāne mūlamattepi avasiṭṭhe pādato rohanti jāyanti vaḍḍhanti, tasmā ‘‘pārohā’’ti vuccanti. Puna rohanatthena vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pārohā. Ahorattānamaccaye"
      },
      "ti rattindivānaṃ atikkame. Nidāghepi deve vuṭṭhamatte jāyanti."
    ],
    "innerText": "Mahā hutvānāti mahanto hutvā. Aggi hi ekadā yāvabrahmalokappamāṇopi hoti. Jāyantitattha pārohāti tattha agginā daḍḍhavane pārohā jāyanti. Pārohāti tiṇarukkhādayo vuccanti. Te hi agginā daḍḍhaṭṭhāne mūlamattepi avasiṭṭhe pādato rohanti jāyanti vaḍḍhanti, tasmā ‘‘pārohā’’ti vuccanti. Puna rohanatthena vā pārohā. Ahorattānamaccayeti rattindivānaṃ atikkame. Nidāghepi deve vuṭṭhamatte jāyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhu ḍahati tejasā"
      },
      "ti ettha akkosantaṃ paccakkosanto bhaṇḍantaṃ paṭibhaṇḍanto paharantaṃ paṭipaharanto bhikkhu nāma kiñci bhikkhutejasā ḍahituṃ na sakkoti. Yo pana akkosantaṃ na paccakkosati, bhaṇḍantaṃ na paṭibhaṇḍati. Paharantaṃ na paṭipaharati, tasmiṃ vippaṭipanno tassa sīlatejena ḍayhati. Tenevetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na tassa puttā pasavo"
      },
      "ti tassa puttadhītaropi gomahiṃsakukkuṭasūkarādayo pasavopi na bhavanti, vinassantīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dāyādā vindare dhana"
      },
      "nti tassa dāyādāpi dhanaṃ na vindanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tālāvatthū bhavanti te"
      },
      "ti te bhikkhutejasā daḍḍhā vatthumattāvasiṭṭho matthakacchinnatālo viya bhavanti, puttadhītādivasena na vaḍḍhantīti attho."
    ],
    "innerText": "Bhikkhu ḍahati tejasāti ettha akkosantaṃ paccakkosanto bhaṇḍantaṃ paṭibhaṇḍanto paharantaṃ paṭipaharanto bhikkhu nāma kiñci bhikkhutejasā ḍahituṃ na sakkoti. Yo pana akkosantaṃ na paccakkosati, bhaṇḍantaṃ na paṭibhaṇḍati. Paharantaṃ na paṭipaharati, tasmiṃ vippaṭipanno tassa sīlatejena ḍayhati. Tenevetaṃ vuttaṃ. Na tassa puttā pasavoti tassa puttadhītaropi gomahiṃsakukkuṭasūkarādayo pasavopi na bhavanti, vinassantīti attho. Dāyādā vindare dhananti tassa dāyādāpi dhanaṃ na vindanti. Tālāvatthū bhavanti teti te bhikkhutejasā daḍḍhā vatthumattāvasiṭṭho matthakacchinnatālo viya bhavanti, puttadhītādivasena na vaḍḍhantīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      "ti ",
      " yasmā samaṇatejena daḍḍhā matthakacchinnatālo viya aviruḷhidhammā bhavanti, tasmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammadeva samācare"
      },
      "ti sammā samācareyya. Sammā samācarantena pana kiṃ kātabbanti? Khattiyaṃ tāva nissāya laddhabbaṃ gāmanigamayānavāhanādiānisaṃsaṃ, uragaṃ nissāya tassa kīḷāpanena laddhabbaṃ vatthahiraññasuvaṇṇādiānisaṃsaṃ aggiṃ nissāya tassānubhāvena pattabbaṃ yāgubhattapacanasītavinodanādiānisaṃsaṃ, bhikkhuṃ nissāya tassa vasena pattabbaṃ asutasavanasutapariyodapana-saggamaggādhigamādiānisaṃsaṃ sampassamānena ‘‘ete nissāya pubbe vuttappakāro ādīnavo atthi. Kiṃ imehī’’ti? Na sabbaso pahātabbā. Issariyatthikena pana vuttappakāraṃ avajānanañca paribhavanañca akatvā pubbuṭṭhāyipacchānipātitādīhi ",
      " upāyehi khattiyakumāro tosetabbo, evaṃ tato issariyaṃ adhigamissati. Ahituṇḍikena urage vissāsaṃ akatvā nāgavijjaṃ parivattetvā ajapadena daṇḍena gīvāya gahetvā visaharena mūlena dāṭhā dhovitvā peḷāyaṃ pakkhipitvā kīḷāpentena caritabbaṃ. Evaṃ taṃ nissāya ghāsacchādanādīni labhissati. Yāgupacanādīni ",
      " kattukāmena aggiṃ vissāsena bhaṇḍukkhalikādīsu apakkhipitvā hatthehi anāmasantena gomayacuṇṇādīhi jāletvā yāgupacanādīni kattabbāni, evaṃ taṃ nissāya ānisaṃsaṃ labhissati. Asutasavanādīni patthayantenapi bhikkhuṃ ativissāsena vejjakammanavakammādīsu ayojetvā catūhi paccayehi sakkaccaṃ upaṭṭhātabbo, evaṃ taṃ nissāya asutapubbaṃ buddhavacanaṃ asutapubbaṃ pañhāvinicchayaṃ diṭṭhadhammikasamparāyikaṃ atthaṃ tisso kulasampattiyo cha kāmasaggāni nava ca brahmaloke patvā amatamahānibbānadassanampi labhissatīti imamatthaṃ sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammadeva samācare"
      },
      "ti āha."
    ],
    "innerText": "Tasmāti yasmā samaṇatejena daḍḍhā matthakacchinnatālo viya aviruḷhidhammā bhavanti, tasmā. Sammadeva samācareti sammā samācareyya. Sammā samācarantena pana kiṃ kātabbanti? Khattiyaṃ tāva nissāya laddhabbaṃ gāmanigamayānavāhanādiānisaṃsaṃ, uragaṃ nissāya tassa kīḷāpanena laddhabbaṃ vatthahiraññasuvaṇṇādiānisaṃsaṃ aggiṃ nissāya tassānubhāvena pattabbaṃ yāgubhattapacanasītavinodanādiānisaṃsaṃ, bhikkhuṃ nissāya tassa vasena pattabbaṃ asutasavanasutapariyodapana-saggamaggādhigamādiānisaṃsaṃ sampassamānena ‘‘ete nissāya pubbe vuttappakāro ādīnavo atthi. Kiṃ imehī’’ti? Na sabbaso pahātabbā. Issariyatthikena pana vuttappakāraṃ avajānanañca paribhavanañca akatvā pubbuṭṭhāyipacchānipātitādīhi upāyehi khattiyakumāro tosetabbo, evaṃ tato issariyaṃ adhigamissati. Ahituṇḍikena urage vissāsaṃ akatvā nāgavijjaṃ parivattetvā ajapadena daṇḍena gīvāya gahetvā visaharena mūlena dāṭhā dhovitvā peḷāyaṃ pakkhipitvā kīḷāpentena caritabbaṃ. Evaṃ taṃ nissāya ghāsacchādanādīni labhissati. Yāgupacanādīni kattukāmena aggiṃ vissāsena bhaṇḍukkhalikādīsu apakkhipitvā hatthehi anāmasantena gomayacuṇṇādīhi jāletvā yāgupacanādīni kattabbāni, evaṃ taṃ nissāya ānisaṃsaṃ labhissati. Asutasavanādīni patthayantenapi bhikkhuṃ ativissāsena vejjakammanavakammādīsu ayojetvā catūhi paccayehi sakkaccaṃ upaṭṭhātabbo, evaṃ taṃ nissāya asutapubbaṃ buddhavacanaṃ asutapubbaṃ pañhāvinicchayaṃ diṭṭhadhammikasamparāyikaṃ atthaṃ tisso kulasampattiyo cha kāmasaggāni nava ca brahmaloke patvā amatamahānibbānadassanampi labhissatīti imamatthaṃ sandhāya sammadeva samācareti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etadavocā"
      },
      "ti dhammadesanaṃ sutvā pasanno pasādaṃ āvikaronto etaṃ ‘‘abhikkanta’’ntiādivacanaṃ avoca. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhikkanta"
      },
      "nti abhikantaṃ atiiṭṭhaṃ atimanāpaṃ, atisundaranti attho. Ettha ekena abhikkantasaddena desanaṃ thometi ‘‘abhikkantaṃ, bhante, yadidaṃ bhagavato dhammadesanā’’ti. Ekena attano ",
      " pasādaṃ ‘‘abhikkantaṃ, bhante, yadidaṃ bhagavato dhammadesanaṃ āgamma mama pasādo’’ti."
    ],
    "innerText": "Etadavocāti dhammadesanaṃ sutvā pasanno pasādaṃ āvikaronto etaṃ ‘‘abhikkanta’’ntiādivacanaṃ avoca. Tattha abhikkantanti abhikantaṃ atiiṭṭhaṃ atimanāpaṃ, atisundaranti attho. Ettha ekena abhikkantasaddena desanaṃ thometi ‘‘abhikkantaṃ, bhante, yadidaṃ bhagavato dhammadesanā’’ti. Ekena attano pasādaṃ ‘‘abhikkantaṃ, bhante, yadidaṃ bhagavato dhammadesanaṃ āgamma mama pasādo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato paraṃ catūhi upamāhi desanaṃyeva thometi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nikkujjita"
      },
      "nti adhomukhaṭhapitaṃ, heṭṭhāmukhajātaṃ vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ukkujjeyyā"
      },
      "ti uparimukhaṃ kareyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭicchanna"
      },
      "nti tiṇapaṇṇādichāditaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivareyyā"
      },
      "ti ugghāṭeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mūḷhassā"
      },
      "ti disāmūḷhassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maggaṃ ācikkheyyā"
      },
      "ti ",
      " hatthe gahetvā ‘‘esa maggo’’ti vadeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Andhakāre"
      },
      "ti kāḷapakkhacātuddasī aḍḍharattaghanavanasaṇḍa meghapaṭalehi caturaṅge tame. Idaṃ vuttaṃ hoti – yathā koci nikkujjitaṃ ukkujjeyya, evaṃ saddhammavimukhaṃ asaddhamme patitaṃ maṃ asaddhammā vuṭṭhāpentena, yathā paṭicchannaṃ vivareyya, evaṃ kassapassa bhagavato sāsanantaradhānā pabhuti micchādiṭṭhigahanapaṭicchannaṃ sāsanaṃ vivarantena, yathā mūḷhassa maggaṃ ācikkheyya, evaṃ kummaggamicchāmaggapaṭipannassa me saggamokkhamaggaṃ āvikarontena, yathā andhakāre telapajjotaṃ dhāreyya, evaṃ mohandhakāre nimuggassa me buddhādiratanarūpāni apassato tappaṭicchādakamohandhakāraviddhaṃsakadesanāpajjotaṃ dhārentena mayhaṃ bhagavatā etehi pariyāyehi pakāsitattā anekapariyāyena dhammo pakāsitoti."
    ],
    "innerText": "Tato paraṃ catūhi upamāhi desanaṃyeva thometi. Tattha nikkujjitanti adhomukhaṭhapitaṃ, heṭṭhāmukhajātaṃ vā. Ukkujjeyyāti uparimukhaṃ kareyya. Paṭicchannanti tiṇapaṇṇādichāditaṃ. Vivareyyāti ugghāṭeyya. Mūḷhassāti disāmūḷhassa. Maggaṃ ācikkheyyāti hatthe gahetvā ‘‘esa maggo’’ti vadeyya. Andhakāreti kāḷapakkhacātuddasī aḍḍharattaghanavanasaṇḍa meghapaṭalehi caturaṅge tame. Idaṃ vuttaṃ hoti – yathā koci nikkujjitaṃ ukkujjeyya, evaṃ saddhammavimukhaṃ asaddhamme patitaṃ maṃ asaddhammā vuṭṭhāpentena, yathā paṭicchannaṃ vivareyya, evaṃ kassapassa bhagavato sāsanantaradhānā pabhuti micchādiṭṭhigahanapaṭicchannaṃ sāsanaṃ vivarantena, yathā mūḷhassa maggaṃ ācikkheyya, evaṃ kummaggamicchāmaggapaṭipannassa me saggamokkhamaggaṃ āvikarontena, yathā andhakāre telapajjotaṃ dhāreyya, evaṃ mohandhakāre nimuggassa me buddhādiratanarūpāni apassato tappaṭicchādakamohandhakāraviddhaṃsakadesanāpajjotaṃ dhārentena mayhaṃ bhagavatā etehi pariyāyehi pakāsitattā anekapariyāyena dhammo pakāsitoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ desanaṃ thometvā imāya desanāya ratanattaye pasannacitto pasannākāraṃ karonto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "esāha"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "esāha"
      },
      "nti eso ahaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavantaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañcā"
      },
      "ti ",
      " bhagavantañca dhammañca bhikkhusaṅghañcāti imaṃ ratanattayaṃ saraṇaṃ gacchāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upāsakaṃ maṃ, bhante, bhagavā dhāretū"
      },
      "ti maṃ bhagavā ‘upāsako aya’nti evaṃ dhāretu, jānātūti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjatagge"
      },
      "ti ajjataṃ ādiṃ katvā. Ajjadaggeti vā pāṭho, da-kāro padasandhikaro, ajja aggaṃ katvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṇupeta"
      },
      "nti pāṇehi upetaṃ yāva me jīvitaṃ pavattati, tāva upetaṃ anaññasatthukaṃ tīhi saraṇagamanehi saraṇaṃ gataṃ upāsakaṃ kappiyakārakaṃ maṃ bhagavā dhāretūti ayamettha saṅkhepo, vitthāro pana sumaṅgalavilāsiniyā dīghanikāyaṭṭhakathāya sāmaññaphalasutte sabbākārena vuttoti. Paṭhamaṃ."
    ],
    "innerText": "Evaṃ desanaṃ thometvā imāya desanāya ratanattaye pasannacitto pasannākāraṃ karonto esāhantiādimāha. Tattha esāhanti eso ahaṃ. Bhagavantaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañcāti bhagavantañca dhammañca bhikkhusaṅghañcāti imaṃ ratanattayaṃ saraṇaṃ gacchāmi. Upāsakaṃ maṃ, bhante, bhagavā dhāretūti maṃ bhagavā ‘upāsako aya’nti evaṃ dhāretu, jānātūti attho. Ajjataggeti ajjataṃ ādiṃ katvā. Ajjadaggeti vā pāṭho, da-kāro padasandhikaro, ajja aggaṃ katvāti attho. Pāṇupetanti pāṇehi upetaṃ yāva me jīvitaṃ pavattati, tāva upetaṃ anaññasatthukaṃ tīhi saraṇagamanehi saraṇaṃ gataṃ upāsakaṃ kappiyakārakaṃ maṃ bhagavā dhāretūti ayamettha saṅkhepo, vitthāro pana sumaṅgalavilāsiniyā dīghanikāyaṭṭhakathāya sāmaññaphalasutte sabbākārena vuttoti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Purisasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "113"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhivādetvā"
      },
      "ti purimasutte saraṇagatattā idha abhivādesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhatta"
      },
      "nti niyakajjhattaṃ, attano santāne uppajjantīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lobhā"
      },
      "dīsu lubbhanalakkhaṇo lobho, dussanalakkhaṇo doso, muyhanalakkhaṇo mohoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hiṃsantī"
      },
      "ti viheṭhenti nāsenti vināsenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attasambhūtā"
      },
      "ti attani sambhūtā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tacasāraṃva samphala"
      },
      "nti yathā tacasāraṃ veḷuṃ vā naḷaṃ vā attano phalaṃ hiṃsati vināseti, evaṃ hiṃsanti vināsentīti. Dutiyaṃ."
    ],
    "innerText": "113. Dutiye abhivādetvāti purimasutte saraṇagatattā idha abhivādesi. Ajjhattanti niyakajjhattaṃ, attano santāne uppajjantīti attho. Lobhādīsu lubbhanalakkhaṇo lobho, dussanalakkhaṇo doso, muyhanalakkhaṇo mohoti. Hiṃsantīti viheṭhenti nāsenti vināsenti. Attasambhūtāti attani sambhūtā. Tacasāraṃva samphalanti yathā tacasāraṃ veḷuṃ vā naḷaṃ vā attano phalaṃ hiṃsati vināseti, evaṃ hiṃsanti vināsentīti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Jarāmaraṇasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "114"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññatra jarāmaraṇā"
      },
      "ti jarāmaraṇato mutto nāma atthīti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khattiyamahāsālā"
      },
      "ti khattiyamahāsālā nāma mahāsārappattā khattiyā. Yesaṃ hi khattiyānaṃ heṭṭhimantena koṭisataṃ nidhānagataṃ hoti, tayo kahāpaṇakumbhā valañjanatthāya gehamajjhe rāsiṃ katvā ṭhapitā honti, te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khattiyamahāsālā"
      },
      " nāma. Yesaṃ brāhmaṇānaṃ asītikoṭidhanaṃ nihitaṃ hoti, diyaḍḍho kahāpaṇakumbho valañjanatthāya gehamajjhe rāsiṃ katvā ṭhapito hoti, te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brāhmaṇamahāsālā"
      },
      " nāma. Yesaṃ gahapatīnaṃ cattālīsakoṭidhanaṃ nihitaṃ hoti, kahāpaṇakumbho valañjanatthāya gehamajjhe rāsiṃ katvā ṭhapito hoti, te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gahapatimahāsālā"
      },
      " nāma."
    ],
    "innerText": "114. Tatiye aññatra jarāmaraṇāti jarāmaraṇato mutto nāma atthīti vuccati. Khattiyamahāsālāti khattiyamahāsālā nāma mahāsārappattā khattiyā. Yesaṃ hi khattiyānaṃ heṭṭhimantena koṭisataṃ nidhānagataṃ hoti, tayo kahāpaṇakumbhā valañjanatthāya gehamajjhe rāsiṃ katvā ṭhapitā honti, te khattiyamahāsālā nāma. Yesaṃ brāhmaṇānaṃ asītikoṭidhanaṃ nihitaṃ hoti, diyaḍḍho kahāpaṇakumbho valañjanatthāya gehamajjhe rāsiṃ katvā ṭhapito hoti, te brāhmaṇamahāsālā nāma. Yesaṃ gahapatīnaṃ cattālīsakoṭidhanaṃ nihitaṃ hoti, kahāpaṇakumbho valañjanatthāya gehamajjhe rāsiṃ katvā ṭhapito hoti, te gahapatimahāsālā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aḍḍhā"
      },
      "ti issarā. Nidhānagatadhanassa mahantatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahaddhanā"
      },
      ". Suvaṇṇarajatabhājanādīnaṃ upabhogabhaṇḍānaṃ mahantatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahābhogā"
      },
      ". Anidhānagatassa jātarūparajatassa pahūtatāya, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pahūtajātarūparajatā"
      },
      ". Vittūpakaraṇassa tuṭṭhikaraṇassa pahūtatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pahūtavittūpakaraṇā"
      },
      ". Godhanādīnañca sattavidhadhaññānañca pahūtatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pahūtadhanadhaññā. Tesampi jātānaṃ natthi aññatra jarāmaraṇā"
      },
      "ti tesampi evaṃ issarānaṃ jātānaṃ nibbattānaṃ natthi aññatra jarāmaraṇā, jātattāyeva jarāmaraṇato mokkho nāma natthi, antojarāmaraṇeyeva hoti."
    ],
    "innerText": "Aḍḍhāti issarā. Nidhānagatadhanassa mahantatāya mahaddhanā. Suvaṇṇarajatabhājanādīnaṃ upabhogabhaṇḍānaṃ mahantatāya mahābhogā. Anidhānagatassa jātarūparajatassa pahūtatāya, pahūtajātarūparajatā. Vittūpakaraṇassa tuṭṭhikaraṇassa pahūtatāya pahūtavittūpakaraṇā. Godhanādīnañca sattavidhadhaññānañca pahūtatāya pahūtadhanadhaññā. Tesampi jātānaṃ natthi aññatra jarāmaraṇāti tesampi evaṃ issarānaṃ jātānaṃ nibbattānaṃ natthi aññatra jarāmaraṇā, jātattāyeva jarāmaraṇato mokkho nāma natthi, antojarāmaraṇeyeva hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arahanto"
      },
      "tiādīsu ",
      " ārakā kilesehīti arahanto. Khīṇā etesaṃ cattāro āsavāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khīṇāsavā"
      },
      ". Brahmacariyavāsaṃ vuṭṭhā pariniṭṭhitavāsāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vusitavanto"
      },
      ". Catūhi maggehi karaṇīyaṃ etesaṃ katanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "katakaraṇīyā"
      },
      ". Khandhabhāro kilesabhāro abhisaṅkhārabhāro kāmaguṇabhāroti, ime ohitā bhārā etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ohitabhārā"
      },
      ". Anuppatto arahattasaṅkhāto sako attho etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anuppattasadatthā"
      },
      ". Dasavidhampi parikkhīṇaṃ bhavasaṃyojanaṃ etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parikkhīṇabhavasaṃyojanā"
      },
      ". Sammā kāraṇehi jānitvā vimuttāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammadaññāvimuttā"
      },
      ". Maggapaññāya catusaccadhammaṃ ñatvā phalavimuttiyā vimuttāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhedanadhammo"
      },
      "ti bhijjanasabhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nikkhepanadhammo"
      },
      "ti nikkhipitabbasabhāvo. Khīṇāsavassa hi ajīraṇadhammopi atthi, ārammaṇato paṭividdhaṃ nibbānaṃ, taṃ hi na jīrati. Idha panassa jīraṇadhammaṃ dassento evamāha. Atthuppattiko kirassa suttassa nikkhepo. Sivikasālāya nisīditvā kathitanti vadanti. Tattha bhagavā citrāni rathayānādīni disvā diṭṭhameva upamaṃ katvā, ‘‘jīranti ve rājarathā’’ti gāthamāha."
    ],
    "innerText": "Arahantotiādīsu ārakā kilesehīti arahanto. Khīṇā etesaṃ cattāro āsavāti khīṇāsavā. Brahmacariyavāsaṃ vuṭṭhā pariniṭṭhitavāsāti vusitavanto. Catūhi maggehi karaṇīyaṃ etesaṃ katanti katakaraṇīyā. Khandhabhāro kilesabhāro abhisaṅkhārabhāro kāmaguṇabhāroti, ime ohitā bhārā etesanti ohitabhārā. Anuppatto arahattasaṅkhāto sako attho etesanti anuppattasadatthā. Dasavidhampi parikkhīṇaṃ bhavasaṃyojanaṃ etesanti parikkhīṇabhavasaṃyojanā. Sammā kāraṇehi jānitvā vimuttāti sammadaññāvimuttā. Maggapaññāya catusaccadhammaṃ ñatvā phalavimuttiyā vimuttāti attho. Bhedanadhammoti bhijjanasabhāvo. Nikkhepanadhammoti nikkhipitabbasabhāvo. Khīṇāsavassa hi ajīraṇadhammopi atthi, ārammaṇato paṭividdhaṃ nibbānaṃ, taṃ hi na jīrati. Idha panassa jīraṇadhammaṃ dassento evamāha. Atthuppattiko kirassa suttassa nikkhepo. Sivikasālāya nisīditvā kathitanti vadanti. Tattha bhagavā citrāni rathayānādīni disvā diṭṭhameva upamaṃ katvā, ‘‘jīranti ve rājarathā’’ti gāthamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jīrantī"
      },
      "ti jaraṃ pāpuṇanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājarathā"
      },
      "ti rañño abhirūhanarathā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sucittā"
      },
      "ti suvaṇṇarajatādīhi suṭṭhu cittitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atho sarīrampi jaraṃ upetī"
      },
      "ti evarūpesu anupādiṇṇakesu sāradārumayesu rathesu jīrantesu imasmiṃ ajjhattike upādiṇṇake maṃsalohitādimaye sarīre kiṃ vattabbaṃ? Sarīrampi jaraṃ upetiyevāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santo have sabbhi pavedayantī"
      },
      "ti santo sabbhīhi saddhiṃ sataṃ dhammo na jaraṃ upetīti evaṃ pavedayanti. ‘‘Sataṃ dhammo nāma nibbānaṃ, taṃ na jīrati, ajaraṃ amatanti evaṃ kathentī’’ti attho. Yasmā vā nibbānaṃ āgamma sīdanasabhāvā kilesā bhijjanti, tasmā taṃ sabbhīti vuccati. Iti purimapadassa kāraṇaṃ dassento ‘‘santo have sabbhi pavedayantī’’ti āha. Idaṃ hi vuttaṃ hoti – sataṃ dhammo na jaraṃ upeti, tasmā santo sabbhi pavedayanti. Ajaraṃ nibbānaṃ sataṃ dhammoti ",
      " ācikkhantīti attho. Sundarādhivacanaṃ vā etaṃ sabbhīti. Yaṃ sabbhidhammabhūtaṃ nibbānaṃ santo pavedayanti kathayanti, so sataṃ dhammo na jaraṃ upetītipi attho. Tatiyaṃ."
    ],
    "innerText": "Tattha jīrantīti jaraṃ pāpuṇanti. Rājarathāti rañño abhirūhanarathā. Sucittāti suvaṇṇarajatādīhi suṭṭhu cittitā. Atho sarīrampi jaraṃ upetīti evarūpesu anupādiṇṇakesu sāradārumayesu rathesu jīrantesu imasmiṃ ajjhattike upādiṇṇake maṃsalohitādimaye sarīre kiṃ vattabbaṃ? Sarīrampi jaraṃ upetiyevāti attho. Santo have sabbhi pavedayantīti santo sabbhīhi saddhiṃ sataṃ dhammo na jaraṃ upetīti evaṃ pavedayanti. ‘‘Sataṃ dhammo nāma nibbānaṃ, taṃ na jīrati, ajaraṃ amatanti evaṃ kathentī’’ti attho. Yasmā vā nibbānaṃ āgamma sīdanasabhāvā kilesā bhijjanti, tasmā taṃ sabbhīti vuccati. Iti purimapadassa kāraṇaṃ dassento ‘‘santo have sabbhi pavedayantī’’ti āha. Idaṃ hi vuttaṃ hoti – sataṃ dhammo na jaraṃ upeti, tasmā santo sabbhi pavedayanti. Ajaraṃ nibbānaṃ sataṃ dhammoti ācikkhantīti attho. Sundarādhivacanaṃ vā etaṃ sabbhīti. Yaṃ sabbhidhammabhūtaṃ nibbānaṃ santo pavedayanti kathayanti, so sataṃ dhammo na jaraṃ upetītipi attho. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Piyasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "115"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rahogatassā"
      },
      "ti rahasi gatassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisallīnassā"
      },
      "ti nilīnassa ekībhūtassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evametaṃ, mahārājā"
      },
      "ti idha bhagavā imaṃ suttaṃ sabbaññubhāsitaṃ karonto āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antakenādhipannassā"
      },
      "ti maraṇena ajjhotthaṭassa. Catutthaṃ."
    ],
    "innerText": "115. Catutthe rahogatassāti rahasi gatassa. Paṭisallīnassāti nilīnassa ekībhūtassa. Evametaṃ, mahārājāti idha bhagavā imaṃ suttaṃ sabbaññubhāsitaṃ karonto āha. Antakenādhipannassāti maraṇena ajjhotthaṭassa. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Attarakkhitasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "116"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hatthikāyo"
      },
      "ti hatthighaṭā. Sesesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃvaro"
      },
      "ti pidahanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhu sabbattha saṃvaro"
      },
      "ti iminā kammapathabhedaṃ apattassa kammassa saṃvaraṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lajjī"
      },
      "ti hirimā. Lajjīgahaṇena cettha ottappampi gahitameva hoti. Pañcamaṃ."
    ],
    "innerText": "116. Pañcame hatthikāyoti hatthighaṭā. Sesesupi eseva nayo. Saṃvaroti pidahanaṃ. Sādhu sabbattha saṃvaroti iminā kammapathabhedaṃ apattassa kammassa saṃvaraṃ dasseti. Lajjīti hirimā. Lajjīgahaṇena cettha ottappampi gahitameva hoti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Appakasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "117"
      },
      ". Chaṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uḷāre uḷāre"
      },
      "ti paṇīte ca bahuke ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjantī"
      },
      "ti mānamajjanena majjanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atisāra"
      },
      "nti atikkamaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kūṭa"
      },
      "nti pāsaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchāsa"
      },
      "nti pacchā tesaṃ. Chaṭṭhaṃ."
    ],
    "innerText": "117. Chaṭṭhe uḷāre uḷāreti paṇīte ca bahuke ca. Majjantīti mānamajjanena majjanti. Atisāranti atikkamaṃ. Kūṭanti pāsaṃ. Pacchāsanti pacchā tesaṃ. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Aḍḍakaraṇasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "118"
      },
      ". Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmahetū"
      },
      "ti kāmamūlakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmanidāna"
      },
      "nti kāmapaccayā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmādhikaraṇa"
      },
      "nti kāmakāraṇā. Sabbāni hetāni aññamaññavevacanāneva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhadramukho"
      },
      "ti sundaramukho. Ekadivasaṃ kira rājā aḍḍakaraṇe nisīdi. Tattha paṭhamataraṃ lañjaṃ gahetvā nisinnā amaccā assāmikepi sāmike kariṃsu. Rājā taṃ ñatvā – ‘‘mayhaṃ tāva pathavissarassa sammukhāpete evaṃ karonti, parammukhā kiṃ nāma na karissanti? Paññāyissati dāni viṭaṭūbho senāpati sakena ",
      " rajjena, kiṃ mayhaṃ evarūpehi lañjakhādakehi musāvādīhi saddhiṃ ekaṭṭhāne nisajjāyā’’ti cintesi. Tasmā evamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khippaṃva oḍḍita"
      },
      "nti kuminaṃ viya oḍḍitaṃ. Yathā macchā oḍḍitaṃ kuminaṃ pavisantā na jānanti, evaṃ sattā kilesakāmena vatthukāmaṃ vītikkamantā na jānantīti attho. Sattamaṃ."
    ],
    "innerText": "118. Sattame kāmahetūti kāmamūlakaṃ. Kāmanidānanti kāmapaccayā. Kāmādhikaraṇanti kāmakāraṇā. Sabbāni hetāni aññamaññavevacanāneva. Bhadramukhoti sundaramukho. Ekadivasaṃ kira rājā aḍḍakaraṇe nisīdi. Tattha paṭhamataraṃ lañjaṃ gahetvā nisinnā amaccā assāmikepi sāmike kariṃsu. Rājā taṃ ñatvā – ‘‘mayhaṃ tāva pathavissarassa sammukhāpete evaṃ karonti, parammukhā kiṃ nāma na karissanti? Paññāyissati dāni viṭaṭūbho senāpati sakena rajjena, kiṃ mayhaṃ evarūpehi lañjakhādakehi musāvādīhi saddhiṃ ekaṭṭhāne nisajjāyā’’ti cintesi. Tasmā evamāha. Khippaṃva oḍḍitanti kuminaṃ viya oḍḍitaṃ. Yathā macchā oḍḍitaṃ kuminaṃ pavisantā na jānanti, evaṃ sattā kilesakāmena vatthukāmaṃ vītikkamantā na jānantīti attho. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Mallikāsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "119"
      },
      ". Aṭṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthi nu kho te mallike"
      },
      "ti kasmā pucchati? Ayaṃ kira mallikā duggatamālākārassa dhītā, ekadivasaṃ āpaṇato pūvaṃ gahetvā ‘‘mālārāmaṃ gantvāva khādissāmī’’ti gacchantī paṭipathe bhikkhusaṅghaparivāraṃ bhagavantaṃ bhikkhācāraṃ pavisantaṃ disvā pasannacittā taṃ bhagavato adāsi. Satthā nisīdanākāraṃ dassesi. Ānandatthero cīvaraṃ paññāpetvā adāsi. Bhagavā tattha nisīditvā taṃ pūvaṃ paribhuñjitvā mukhaṃ vikkhāletvā sitaṃ pātvākāsi. Thero ‘‘imissā, bhante, ko vipāko bhavissatī’’ti pucchi. Ānanda, ajjesā tathāgatassa paṭhamabhojanaṃ adāsi, ajjeva kosalarañño aggamahesī bhavissatīti. Taṃdivasameva ca rājā kāsigāme bhāgineyyena yuddhena parājito palāyitvā nagaraṃ āgacchanto mālārāmaṃ pavisitvā balakāyassa āgamanaṃ āgamesi. Tassa sā vattaṃ akāsi. So tāya vatte pasīditvā taṃ antepūraṃ atihārāpetvā taṃ aggamahesiṭṭhāne ṭhapesi."
    ],
    "innerText": "119. Aṭṭhame atthi nu kho te malliketi kasmā pucchati? Ayaṃ kira mallikā duggatamālākārassa dhītā, ekadivasaṃ āpaṇato pūvaṃ gahetvā ‘‘mālārāmaṃ gantvāva khādissāmī’’ti gacchantī paṭipathe bhikkhusaṅghaparivāraṃ bhagavantaṃ bhikkhācāraṃ pavisantaṃ disvā pasannacittā taṃ bhagavato adāsi. Satthā nisīdanākāraṃ dassesi. Ānandatthero cīvaraṃ paññāpetvā adāsi. Bhagavā tattha nisīditvā taṃ pūvaṃ paribhuñjitvā mukhaṃ vikkhāletvā sitaṃ pātvākāsi. Thero ‘‘imissā, bhante, ko vipāko bhavissatī’’ti pucchi. Ānanda, ajjesā tathāgatassa paṭhamabhojanaṃ adāsi, ajjeva kosalarañño aggamahesī bhavissatīti. Taṃdivasameva ca rājā kāsigāme bhāgineyyena yuddhena parājito palāyitvā nagaraṃ āgacchanto mālārāmaṃ pavisitvā balakāyassa āgamanaṃ āgamesi. Tassa sā vattaṃ akāsi. So tāya vatte pasīditvā taṃ antepūraṃ atihārāpetvā taṃ aggamahesiṭṭhāne ṭhapesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athekadivasaṃ cintesi – ‘‘mayā imissā duggatakulassa dhītuyā mahantaṃ issariyaṃ dinnaṃ, yaṃnūnāhaṃ imaṃ puccheyyaṃ ‘ko te piyo’ti? Sā ‘tvaṃ me, mahārāja, piyo’ti vatvā puna maṃ pucchissati. Athassāhaṃ ‘mayhampi tvaṃyeva piyā’ti vakkhāmī’’ti. Iti so aññamaññaṃ vissāsajananatthaṃ sammodanīyaṃ kathaṃ kathento pucchati. Sā pana devī paṇḍitā buddhupaṭṭhāyikā dhammupaṭṭhāyikā saṅghupaṭṭhāyikā mahāpaññā ",
      ", tasmā evaṃ cintesi – ‘‘nāyaṃ pañho rañño mukhaṃ oloketvā kathetabbo’’ti. Sā saraseneva kathetvā rājānaṃ pucchi. Rājā tāya sarasena kathitattā nivattituṃ alabhanto sayampi saraseneva kathetvā ‘‘sakāraṇaṃ idaṃ, tathāgatassa naṃ ārocessāmī’’ti gantvā bhagavato ārocesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nevajjhagā"
      },
      "ti nādhigacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ piyo puthu attā paresa"
      },
      "nti yathā ekassa attā piyo, evaṃ paresaṃ puthusattānampi attā piyoti attho. Aṭṭhamaṃ."
    ],
    "innerText": "Athekadivasaṃ cintesi – ‘‘mayā imissā duggatakulassa dhītuyā mahantaṃ issariyaṃ dinnaṃ, yaṃnūnāhaṃ imaṃ puccheyyaṃ ‘ko te piyo’ti? Sā ‘tvaṃ me, mahārāja, piyo’ti vatvā puna maṃ pucchissati. Athassāhaṃ ‘mayhampi tvaṃyeva piyā’ti vakkhāmī’’ti. Iti so aññamaññaṃ vissāsajananatthaṃ sammodanīyaṃ kathaṃ kathento pucchati. Sā pana devī paṇḍitā buddhupaṭṭhāyikā dhammupaṭṭhāyikā saṅghupaṭṭhāyikā mahāpaññā , tasmā evaṃ cintesi – ‘‘nāyaṃ pañho rañño mukhaṃ oloketvā kathetabbo’’ti. Sā saraseneva kathetvā rājānaṃ pucchi. Rājā tāya sarasena kathitattā nivattituṃ alabhanto sayampi saraseneva kathetvā ‘‘sakāraṇaṃ idaṃ, tathāgatassa naṃ ārocessāmī’’ti gantvā bhagavato ārocesi. Nevajjhagāti nādhigacchati. Evaṃ piyo puthu attā paresanti yathā ekassa attā piyo, evaṃ paresaṃ puthusattānampi attā piyoti attho. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Yaññasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "120"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "thūṇūpanītānī"
      },
      "ti thūṇaṃ upanītāni, thūṇāya baddhāni honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parikammāni karontī"
      },
      "ti ettāvatā tehi bhikkhūhi rañño āraddhayañño tathāgatassa ārocito. Kasmā pana raññā ayaṃ yañño āraddho? Dussupinapaṭighātāya. Ekadivasaṃ kira rājā sabbālaṅkārappaṭimaṇḍito ",
      " hatthikkhandhavaragato nagaraṃ anusañcaranto vātapānaṃ vivaritvā olokayamānaṃ ekaṃ itthiṃ disvā tassā paṭibaddhacitto tatova paṭinivattitvā antepuraṃ pavisitvā ekassa purisassa tamatthaṃ ārocetvā ‘‘gaccha tassā sassāmikabhāvaṃ vā assāmikabhāvaṃ vā jānāhī’’ti pesesi. So gantvā pucchi. Sā ‘‘eso me sāmiko āpaṇe nisinno’’ti dassesi. Rājapuriso rañño tamatthaṃ ācikkhi. Rājā taṃ purisaṃ pakkosāpetvā ‘‘maṃ upaṭṭhahā’’ti āha. ‘‘Nāhaṃ, deva, upaṭṭhahituṃ jānāmī’’ti ca vutte ‘‘upaṭṭhānaṃ nāma na ācariyassa santike uggahetabba’’nti balakkārena āvudhaphalakaṃ gāhāpetvā upaṭṭhākaṃ akāsi. Upaṭṭhahitvā gehaṃ gatamattameva ca naṃ puna pakkosāpetvā ‘‘upaṭṭhākena nāma rañño vacanaṃ kattabbaṃ, gaccha ito yojanamatte amhākaṃ sīsadhovanapokkharaṇī atthi, tato aruṇamattikañca lohituppalamālañca gaṇhitvā ehi. Sace ajjeva nāgacchasi, rājadaṇḍaṃ karissāmī’’ti vatvā pesesi. So rājabhayena nikkhamitvā ",
      " gato."
    ],
    "innerText": "120. Navame thūṇūpanītānīti thūṇaṃ upanītāni, thūṇāya baddhāni honti. Parikammāni karontīti ettāvatā tehi bhikkhūhi rañño āraddhayañño tathāgatassa ārocito. Kasmā pana raññā ayaṃ yañño āraddho? Dussupinapaṭighātāya. Ekadivasaṃ kira rājā sabbālaṅkārappaṭimaṇḍito hatthikkhandhavaragato nagaraṃ anusañcaranto vātapānaṃ vivaritvā olokayamānaṃ ekaṃ itthiṃ disvā tassā paṭibaddhacitto tatova paṭinivattitvā antepuraṃ pavisitvā ekassa purisassa tamatthaṃ ārocetvā ‘‘gaccha tassā sassāmikabhāvaṃ vā assāmikabhāvaṃ vā jānāhī’’ti pesesi. So gantvā pucchi. Sā ‘‘eso me sāmiko āpaṇe nisinno’’ti dassesi. Rājapuriso rañño tamatthaṃ ācikkhi. Rājā taṃ purisaṃ pakkosāpetvā ‘‘maṃ upaṭṭhahā’’ti āha. ‘‘Nāhaṃ, deva, upaṭṭhahituṃ jānāmī’’ti ca vutte ‘‘upaṭṭhānaṃ nāma na ācariyassa santike uggahetabba’’nti balakkārena āvudhaphalakaṃ gāhāpetvā upaṭṭhākaṃ akāsi. Upaṭṭhahitvā gehaṃ gatamattameva ca naṃ puna pakkosāpetvā ‘‘upaṭṭhākena nāma rañño vacanaṃ kattabbaṃ, gaccha ito yojanamatte amhākaṃ sīsadhovanapokkharaṇī atthi, tato aruṇamattikañca lohituppalamālañca gaṇhitvā ehi. Sace ajjeva nāgacchasi, rājadaṇḍaṃ karissāmī’’ti vatvā pesesi. So rājabhayena nikkhamitvā gato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Rājāpi tasmiṃ gate dovārikaṃ pakkosāpetvā, ‘‘ajja sāyanheyeva dvāraṃ pidahitvā ‘ahaṃ rājadūto’ti vā ‘uparājadūto’ti vā bhaṇantānampi mā vivarī’’ti āha. So puriso mattikañca uppalāni ca gahetvā dvāre pihitamatte āgantvā bahuṃ vadantopi dvāraṃ alabhitvā parissayabhayena jetavanaṃ gato. Rājāpi rāgapariḷāhena abhibhūto kāle nisīdati, kāle tiṭṭhati, kāle nipajjati, sanniṭṭhānaṃ alabhanto yattha katthaci nisinnakova makkaṭaniddāya niddāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pubbe ",
      " ca tasmiṃyeva nagare cattāro seṭṭhiputtā paradārikakammaṃ katvā nandopanandāya nāma lohakumbhiyā nibbattiṃsu. Te pheṇuddehakaṃ paccamānā tiṃsavassasahassāni heṭṭhā gacchantā kumbhiyā talaṃ pāpuṇanti, tiṃsavassasahassāni upari gacchantā matthakaṃ pāpuṇanti. Te taṃ divasaṃ ālokaṃ oloketvā attano dukkaṭabhayena ekekaṃ gāthaṃ vattukāmā vattuṃ asakkontā ekekaṃ akkharameva āhaṃsu. Eko sa-kāraṃ, eko so-kāraṃ, eko na-kāraṃ, eko du-kāraṃ āha. Rājā tesaṃ nerayikasattānaṃ saddaṃ sutakālato paṭṭhāya sukhaṃ avindamānova taṃrattāvasesaṃ vītināmesi."
    ],
    "innerText": "Pubbe ca tasmiṃyeva nagare cattāro seṭṭhiputtā paradārikakammaṃ katvā nandopanandāya nāma lohakumbhiyā nibbattiṃsu. Te pheṇuddehakaṃ paccamānā tiṃsavassasahassāni heṭṭhā gacchantā kumbhiyā talaṃ pāpuṇanti, tiṃsavassasahassāni upari gacchantā matthakaṃ pāpuṇanti. Te taṃ divasaṃ ālokaṃ oloketvā attano dukkaṭabhayena ekekaṃ gāthaṃ vattukāmā vattuṃ asakkontā ekekaṃ akkharameva āhaṃsu. Eko sa-kāraṃ, eko so-kāraṃ, eko na-kāraṃ, eko du-kāraṃ āha. Rājā tesaṃ nerayikasattānaṃ saddaṃ sutakālato paṭṭhāya sukhaṃ avindamānova taṃrattāvasesaṃ vītināmesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aruṇe uṭṭhite purohito āgantvā taṃ sukhaseyyaṃ pucchi. So ‘‘kuto me, ācariya, sukha’’nti ",
      "? Vatvā, ‘‘supine evarūpe sadde assosi’’nti ācikkhi. Brāhmaṇo – ‘‘imassa rañño iminā supinena vuḍḍhi vā hāni vā natthi, apica kho pana yaṃ imassa gehe atthi, taṃ samaṇassa gotamassa hoti, gotamasāvakānaṃ hoti, brāhmaṇā kiñci na labhanti, brāhmaṇānaṃ bhikkhaṃ uppādessāmī’’ti, ‘‘bhāriyo ayaṃ, mahārāja, supino tīsu jānīsu ekā paññāyati, rajjantarāyo vā bhavissati jīvitantarāyo vā, devo vā na vassissatī’’ti āha. Kathaṃ sotthi bhaveyya ācariyāti? ‘‘Mantetvā ñātuṃ sakkā, mahārājāti. Gacchatha ācariyehi saddhiṃ mantetvā amhākaṃ sotthiṃ karothā’’ti."
    ],
    "innerText": "Aruṇe uṭṭhite purohito āgantvā taṃ sukhaseyyaṃ pucchi. So ‘‘kuto me, ācariya, sukha’’nti ? Vatvā, ‘‘supine evarūpe sadde assosi’’nti ācikkhi. Brāhmaṇo – ‘‘imassa rañño iminā supinena vuḍḍhi vā hāni vā natthi, apica kho pana yaṃ imassa gehe atthi, taṃ samaṇassa gotamassa hoti, gotamasāvakānaṃ hoti, brāhmaṇā kiñci na labhanti, brāhmaṇānaṃ bhikkhaṃ uppādessāmī’’ti, ‘‘bhāriyo ayaṃ, mahārāja, supino tīsu jānīsu ekā paññāyati, rajjantarāyo vā bhavissati jīvitantarāyo vā, devo vā na vassissatī’’ti āha. Kathaṃ sotthi bhaveyya ācariyāti? ‘‘Mantetvā ñātuṃ sakkā, mahārājāti. Gacchatha ācariyehi saddhiṃ mantetvā amhākaṃ sotthiṃ karothā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So sivikasālāyaṃ brāhmaṇe sannipātetvā tamatthaṃ ārocetvā, ‘‘visuṃ visuṃ gantvā evaṃ vadathā’’ti tayo vagge akāsi ",
      ". Brāhmaṇā pavisitvā rājānaṃ sukhaseyyaṃ pucchiṃsu. Rājā purohitassa kathitaniyāmeneva kathetvā ‘‘kathaṃ sotthi bhaveyyā’’ti pucchi. Mahābrāhmaṇā – ‘‘sabbapañcasataṃ yaññaṃ yajitvā etassa kammassa sotthi bhaveyya, evaṃ, mahārāja, ācariyā kathentī’’ti āhaṃsu. Rājā tesaṃ sutvā anabhinanditvā appaṭikkositvā tuṇhī ahosi. Atha dutiyavaggabrāhmaṇāpi āgantvā tattheva kathesuṃ. Tathā tatiyavaggabrāhmaṇāpi. Atha rājā ‘‘yaññaṃ karontū’’ti āṇāpesi. Tato paṭṭhāya brāhmaṇā usabhādayo pāṇe āharāpesuṃ. Nagare mahāsaddo udapādi ",
      ". Taṃ pavattiṃ ñatvā mallikā rājānaṃ tathāgatassa santikaṃ pesesi. So gantvā bhagavantaṃ vanditvā ekamantaṃ nisīdi. Atha naṃ bhagavā – ‘‘handa kuto nu tvaṃ, mahārāja, āgacchasi divādivassā’’ti āha. Rājā – ‘‘ajja me, bhante, supinake cattāro saddā sutā, sohaṃ brāhmaṇe pucchiṃ. Brāhmaṇā ‘bhāriyo, mahārāja, supino, sabbapañcasataṃ yaññaṃ yajitvā paṭikammaṃ karomāti āraddhā’’’ti āha. Kinti te, mahārāja, saddā sutāti. So yathāsutaṃ ārocesi. Atha naṃ bhagavā āha – pubbe, mahārāja, imasmiṃyeva nagare cattāro seṭṭhiputtā paradārikā hutvā nandopanandāya lohakumbhiyā nibbattā saṭṭhivassasahassamatthake uggacchiṃsu."
    ],
    "innerText": "So sivikasālāyaṃ brāhmaṇe sannipātetvā tamatthaṃ ārocetvā, ‘‘visuṃ visuṃ gantvā evaṃ vadathā’’ti tayo vagge akāsi . Brāhmaṇā pavisitvā rājānaṃ sukhaseyyaṃ pucchiṃsu. Rājā purohitassa kathitaniyāmeneva kathetvā ‘‘kathaṃ sotthi bhaveyyā’’ti pucchi. Mahābrāhmaṇā – ‘‘sabbapañcasataṃ yaññaṃ yajitvā etassa kammassa sotthi bhaveyya, evaṃ, mahārāja, ācariyā kathentī’’ti āhaṃsu. Rājā tesaṃ sutvā anabhinanditvā appaṭikkositvā tuṇhī ahosi. Atha dutiyavaggabrāhmaṇāpi āgantvā tattheva kathesuṃ. Tathā tatiyavaggabrāhmaṇāpi. Atha rājā ‘‘yaññaṃ karontū’’ti āṇāpesi. Tato paṭṭhāya brāhmaṇā usabhādayo pāṇe āharāpesuṃ. Nagare mahāsaddo udapādi . Taṃ pavattiṃ ñatvā mallikā rājānaṃ tathāgatassa santikaṃ pesesi. So gantvā bhagavantaṃ vanditvā ekamantaṃ nisīdi. Atha naṃ bhagavā – ‘‘handa kuto nu tvaṃ, mahārāja, āgacchasi divādivassā’’ti āha. Rājā – ‘‘ajja me, bhante, supinake cattāro saddā sutā, sohaṃ brāhmaṇe pucchiṃ. Brāhmaṇā ‘bhāriyo, mahārāja, supino, sabbapañcasataṃ yaññaṃ yajitvā paṭikammaṃ karomāti āraddhā’’’ti āha. Kinti te, mahārāja, saddā sutāti. So yathāsutaṃ ārocesi. Atha naṃ bhagavā āha – pubbe, mahārāja, imasmiṃyeva nagare cattāro seṭṭhiputtā paradārikā hutvā nandopanandāya lohakumbhiyā nibbattā saṭṭhivassasahassamatthake uggacchiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha eko –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Saṭṭhivassasahassāni, paripuṇṇāni sabbaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Niraye paccamānānaṃ, kadā anto bhavissatī’’ti.(pe. va. 802; jā. 1.4.54) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imaṃ ",
      " gāthaṃ vatthukāmo ahosi. Dutiyo –"
    ],
    "innerText": "Imaṃ gāthaṃ vatthukāmo ahosi. Dutiyo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sohaṃ nūna ito gantvā, yoniṃ laddhāna mānusiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vadaññū sīlasampanno, kāhāmi kusalaṃ bahu’’nti. (pe. va. 805; jā. 1.4.56) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Imaṃ gāthaṃ vatthukāmo ahosi. Tatiyo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Natthi anto kuto anto, na anto paṭidissati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tadā hi pakataṃ pāpaṃ, mama tuyhañca mārisā’’ti. (pe. va. 803; jā. 1.4.55) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Imaṃ gāthaṃ vatthukāmo ahosi. Catuttho –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dujjīvitamajīvimhā, ye sante na dadamhase;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vijjamānesu bhogesu, dīpaṃ nākamha attano’’ti. (pe. va. 804; jā. 1.4.53) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imaṃ ",
      ". Te imā gāthā vattuṃ asakkontā ekekaṃ akkharaṃ vatvā tattheva nimuggā. Iti, mahārāja, te nerayikasattā yathākammena viraviṃsu. Tassa saddassa sutapaccayā tuyhaṃ hāni vā vuḍḍhi vā natthi. Ettakānaṃ pana pasūnaṃ ghātanakammaṃ nāma bhāriyanti nirayabhayena tajjetvā dhammakathaṃ ",
      " kathesi. Rājā dasabale pasīditvā, ‘‘muñcāmi, nesaṃ jīvitaṃ dadāmi, haritāni ceva tiṇāni khādantu, sītalāni ca pānīyāni pivantu, sīto ca nesaṃ vāto upavāyatū’’ti vatvā, ‘‘gacchatha hārethā’’ti manusse āṇāpesi. Te gantvā brāhmaṇe palāpetvā taṃ pāṇasaṅghaṃ bandhanato mocetvā nagare dhammabheriṃ carāpesuṃ."
    ],
    "innerText": "Imaṃ . Te imā gāthā vattuṃ asakkontā ekekaṃ akkharaṃ vatvā tattheva nimuggā. Iti, mahārāja, te nerayikasattā yathākammena viraviṃsu. Tassa saddassa sutapaccayā tuyhaṃ hāni vā vuḍḍhi vā natthi. Ettakānaṃ pana pasūnaṃ ghātanakammaṃ nāma bhāriyanti nirayabhayena tajjetvā dhammakathaṃ kathesi. Rājā dasabale pasīditvā, ‘‘muñcāmi, nesaṃ jīvitaṃ dadāmi, haritāni ceva tiṇāni khādantu, sītalāni ca pānīyāni pivantu, sīto ca nesaṃ vāto upavāyatū’’ti vatvā, ‘‘gacchatha hārethā’’ti manusse āṇāpesi. Te gantvā brāhmaṇe palāpetvā taṃ pāṇasaṅghaṃ bandhanato mocetvā nagare dhammabheriṃ carāpesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha rājā dasabalassa santike nisinno āha – ‘‘bhante, ekaratti nāma tiyāmā hoti, mayhaṃ pana ajja dve rattiyo ekato ghaṭitā viya ahesu’’nti. Sopi puriso tattheva nisinno ",
      " āha – ‘‘bhante, yojanaṃ nāma catugāvutaṃ hoti, mayhaṃ pana ajja dve yojanāni ekato katāni viya ahesu’’nti. Atha bhagavā – ‘‘jāgarassa tāva rattiyā dīghabhāvo pākaṭo, santassa yojanassa dīghabhāvo pākaṭo, vaṭṭapatitassa pana bālaputhujjanassa anamataggasaṃsāravaṭṭaṃ ekantadīghamevā’’ti rājānañca tañca purisaṃ nerayikasatte ca ārabbha dhammapade imaṃ gāthaṃ abhāsi –"
    ],
    "innerText": "Atha rājā dasabalassa santike nisinno āha – ‘‘bhante, ekaratti nāma tiyāmā hoti, mayhaṃ pana ajja dve rattiyo ekato ghaṭitā viya ahesu’’nti. Sopi puriso tattheva nisinno āha – ‘‘bhante, yojanaṃ nāma catugāvutaṃ hoti, mayhaṃ pana ajja dve yojanāni ekato katāni viya ahesu’’nti. Atha bhagavā – ‘‘jāgarassa tāva rattiyā dīghabhāvo pākaṭo, santassa yojanassa dīghabhāvo pākaṭo, vaṭṭapatitassa pana bālaputhujjanassa anamataggasaṃsāravaṭṭaṃ ekantadīghamevā’’ti rājānañca tañca purisaṃ nerayikasatte ca ārabbha dhammapade imaṃ gāthaṃ abhāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dīghā jāgarato ratti, dīghaṃ santassa yojanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dīgho bālānaṃ saṃsāro, saddhammaṃ avijānata’’nti. (dha. pa. 60);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāthāpariyosāne so itthisāmiko puriso sotāpattiphale patiṭṭhahi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ viditvā"
      },
      "ti etaṃ kāraṇaṃ jānitvā."
    ],
    "innerText": "Gāthāpariyosāne so itthisāmiko puriso sotāpattiphale patiṭṭhahi. Etamatthaṃ viditvāti etaṃ kāraṇaṃ jānitvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assamedha"
      },
      "ntiādīsu – porāṇarājakāle kira sassamedhaṃ purisamedhaṃ sammāpāsaṃ vācāpeyyanti cattāri saṅgahavatthūni ahesuṃ, yehi rājāno lokaṃ saṅgaṇhiṃsu. Tattha nipphannasassato ",
      " dasamabhāgaggahaṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sassamedhaṃ"
      },
      " nāma, sassasampādane medhāvitāti attho. Mahāyodhānaṃ chamāsikaṃ bhatta-vetanānuppadānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purisamedhaṃ"
      },
      " nāma, purisasaṅgaṇhane medhāvitāti attho. Daliddamanussānaṃ hatthato lekhaṃ gahetvā tīṇi vassāni vināva vaḍḍhiyā sahassadvisahassamattadhanānuppadānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammāpāsaṃ"
      },
      " nāma. Tañhi sammā manusse pāseti, hadaye bandhitvā viya ṭhapeti, tasmā sammāpāsanti vuccati. ‘‘Tāta mātulā’’tiādinā nayena saṇhavācābhaṇanaṃ vācāpeyyaṃ nāma, piyavācāti attho. Evaṃ catūhi saṅgahavatthūhi saṅgahitaṃ raṭṭhaṃ iddhañceva ",
      " hoti phītañca pahūtaannapānaṃ khemaṃ nirabbudaṃ. Manussā mudā modamānā ure putte naccentā apārutagharadvārā viharanti. Idaṃ gharadvāresu aggaḷānaṃ abhāvato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niraggaḷa"
      },
      "nti vuccati. Ayaṃ porāṇikā paveṇī."
    ],
    "innerText": "Assamedhantiādīsu – porāṇarājakāle kira sassamedhaṃ purisamedhaṃ sammāpāsaṃ vācāpeyyanti cattāri saṅgahavatthūni ahesuṃ, yehi rājāno lokaṃ saṅgaṇhiṃsu. Tattha nipphannasassato dasamabhāgaggahaṇaṃ sassamedhaṃ nāma, sassasampādane medhāvitāti attho. Mahāyodhānaṃ chamāsikaṃ bhatta-vetanānuppadānaṃ purisamedhaṃ nāma, purisasaṅgaṇhane medhāvitāti attho. Daliddamanussānaṃ hatthato lekhaṃ gahetvā tīṇi vassāni vināva vaḍḍhiyā sahassadvisahassamattadhanānuppadānaṃ sammāpāsaṃ nāma. Tañhi sammā manusse pāseti, hadaye bandhitvā viya ṭhapeti, tasmā sammāpāsanti vuccati. ‘‘Tāta mātulā’’tiādinā nayena saṇhavācābhaṇanaṃ vācāpeyyaṃ nāma, piyavācāti attho. Evaṃ catūhi saṅgahavatthūhi saṅgahitaṃ raṭṭhaṃ iddhañceva hoti phītañca pahūtaannapānaṃ khemaṃ nirabbudaṃ. Manussā mudā modamānā ure putte naccentā apārutagharadvārā viharanti. Idaṃ gharadvāresu aggaḷānaṃ abhāvato niraggaḷanti vuccati. Ayaṃ porāṇikā paveṇī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparabhāge pana okkākarājakāle brāhmaṇā imāni cattāri saṅgahavatthūni imañca raṭṭhasampattiṃ parivattetvā uddhaṃmūlakaṃ katvā assamedhaṃ purisamedhanti ādike pañca yaññe nāma akaṃsu. Tesu assamettha medhanti vadhantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "assamedho"
      },
      ". Dvīhi pariyaññehi yajitabbassa ekavīsatiyūpassa ekasmiṃ majjhimadivaseyeva sattanavutipañcapasusataghātabhiṃsanassa ṭhapetvā bhūmiñca ",
      " purise ca avasesasabbavibhavadakkhiṇassa yaññassetaṃ adhivacanaṃ. Purisamettha medhantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purisamedho"
      },
      ". Catūhi pariyaññehi yajitabbassa saddhiṃ bhūmiyā assamedhe vuttavibhavadakkhiṇassa yaññassetaṃ adhivacanaṃ. Sammamettha pāsentīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammāpāso"
      },
      ". Divase divase sammaṃ khipitvā tassa ",
      " patitokāse vediṃ katvā saṃhārimehi yūpādīhi sarassatinadiyā nimuggokāsato pabhuti paṭilomaṃ gacchantena yajitabbassa satrayāgassetaṃ adhivacanaṃ. Vājamettha pivantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vājapeyyo"
      },
      ". Ekena pariyaññena sattarasahi pasūhi yajitabbassa beluvayūpassa sattarasakadakkhiṇassa yaññassetaṃ adhivacanaṃ. Natthi ettha aggaḷāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niraggaḷo"
      },
      ". Navahi pariyaññehi yajitabbassa saddhiṃ bhūmiyā ca purisehi ca assamedhe vuttavibhavadakkhiṇassa sabbamedhapariyāyanāmassa assamedhavikappassevetaṃ adhivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahārambhā"
      },
      "ti mahākiccā mahākaraṇīyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammaggatā"
      },
      "ti sammā paṭipannā buddhādayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nirārambhā"
      },
      "ti appatthā appakiccā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yajanti anukula"
      },
      "nti anukulesu yajanti, yaṃ niccabhattādi pubbapurisehi paṭṭhapitaṃ, taṃ aparāparaṃ anupacchinnattā manussā dadantīti attho. Navamaṃ."
    ],
    "innerText": "Aparabhāge pana okkākarājakāle brāhmaṇā imāni cattāri saṅgahavatthūni imañca raṭṭhasampattiṃ parivattetvā uddhaṃmūlakaṃ katvā assamedhaṃ purisamedhanti ādike pañca yaññe nāma akaṃsu. Tesu assamettha medhanti vadhantīti assamedho. Dvīhi pariyaññehi yajitabbassa ekavīsatiyūpassa ekasmiṃ majjhimadivaseyeva sattanavutipañcapasusataghātabhiṃsanassa ṭhapetvā bhūmiñca purise ca avasesasabbavibhavadakkhiṇassa yaññassetaṃ adhivacanaṃ. Purisamettha medhantīti purisamedho. Catūhi pariyaññehi yajitabbassa saddhiṃ bhūmiyā assamedhe vuttavibhavadakkhiṇassa yaññassetaṃ adhivacanaṃ. Sammamettha pāsentīti sammāpāso. Divase divase sammaṃ khipitvā tassa patitokāse vediṃ katvā saṃhārimehi yūpādīhi sarassatinadiyā nimuggokāsato pabhuti paṭilomaṃ gacchantena yajitabbassa satrayāgassetaṃ adhivacanaṃ. Vājamettha pivantīti vājapeyyo. Ekena pariyaññena sattarasahi pasūhi yajitabbassa beluvayūpassa sattarasakadakkhiṇassa yaññassetaṃ adhivacanaṃ. Natthi ettha aggaḷāti niraggaḷo. Navahi pariyaññehi yajitabbassa saddhiṃ bhūmiyā ca purisehi ca assamedhe vuttavibhavadakkhiṇassa sabbamedhapariyāyanāmassa assamedhavikappassevetaṃ adhivacanaṃ. Mahārambhāti mahākiccā mahākaraṇīyā. Sammaggatāti sammā paṭipannā buddhādayo. Nirārambhāti appatthā appakiccā. Yajanti anukulanti anukulesu yajanti, yaṃ niccabhattādi pubbapurisehi paṭṭhapitaṃ, taṃ aparāparaṃ anupacchinnattā manussā dadantīti attho. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Bandhanasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "121"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "idha, bhante, raññā"
      },
      "ti idaṃ te bhikkhū tesu manussesu ānandattherassa sukatakāraṇaṃ ārocentā ārocesuṃ. Rañño kira sakkena kusarājassa dinno aṭṭhavaṅko maṇi paveṇiyā āgato. Rājā alaṅkaraṇakāle taṃ maṇiṃ āharathāti āha. Manussā ‘‘ṭhapitaṭṭhāne ",
      " na passāmā’’ti ārocesuṃ. Rājā antogharacārino ‘‘maṇiṃ pariyesitvā dethā’’ti bandhāpesi. Ānandatthero te disvā maṇipaṭisāmakānaṃ ekaṃ upāyaṃ ācikkhi ",
      ". Te rañño ārocesuṃ. Rājā ‘‘paṇḍito thero, therassa vacanaṃ karothā’’ti. Paṭisāmakamanussā rājaṅgaṇe udakacāṭiṃ ṭhapetvā sāṇiyā parikkhipāpetvā te manusse āhaṃsu – ‘‘sāṭakaṃ pārupitvā ettha gantvā hatthaṃ otārethā’’ti. Maṇicoro cintesi – ‘‘rājabhaṇḍaṃ vissajjetuṃ vā valañjetuṃ vā na sakkā’’ti. So gehaṃ gantvā maṇiṃ upakacchake ṭhapetvā sāṭakaṃ pārupitvā āgamma udakacāṭiyaṃ pakkhipitvā pakkāmi. Mahājane paṭikkante rājamanussā cāṭiyaṃ hatthaṃ otāretvā maṇiṃ disvā āharitvā rañño adaṃsu. ‘‘Ānandattherena kira dassitanayena maṇi diṭṭho’’ti mahājano kolāhalaṃ akāsi. Te bhikkhū taṃ kāraṇaṃ tathāgatassa ārocentā imaṃ pavattiṃ ārocesuṃ. Satthā – ‘‘anacchariyaṃ, bhikkhave, yaṃ ānando manussānaṃ hatthāruḷhamaṇiṃ āharāpeyya ",
      ", yattha pubbe paṇḍitā attano ñāṇe ṭhatvā ahetukapaṭisandhiyaṃ nibbattānaṃ tiracchānagatānampi hatthāruḷhaṃ bhaṇḍaṃ āharāpetvā rañño adaṃsū’’ti vatvā –"
    ],
    "innerText": "121. Dasame idha, bhante, raññāti idaṃ te bhikkhū tesu manussesu ānandattherassa sukatakāraṇaṃ ārocentā ārocesuṃ. Rañño kira sakkena kusarājassa dinno aṭṭhavaṅko maṇi paveṇiyā āgato. Rājā alaṅkaraṇakāle taṃ maṇiṃ āharathāti āha. Manussā ‘‘ṭhapitaṭṭhāne na passāmā’’ti ārocesuṃ. Rājā antogharacārino ‘‘maṇiṃ pariyesitvā dethā’’ti bandhāpesi. Ānandatthero te disvā maṇipaṭisāmakānaṃ ekaṃ upāyaṃ ācikkhi . Te rañño ārocesuṃ. Rājā ‘‘paṇḍito thero, therassa vacanaṃ karothā’’ti. Paṭisāmakamanussā rājaṅgaṇe udakacāṭiṃ ṭhapetvā sāṇiyā parikkhipāpetvā te manusse āhaṃsu – ‘‘sāṭakaṃ pārupitvā ettha gantvā hatthaṃ otārethā’’ti. Maṇicoro cintesi – ‘‘rājabhaṇḍaṃ vissajjetuṃ vā valañjetuṃ vā na sakkā’’ti. So gehaṃ gantvā maṇiṃ upakacchake ṭhapetvā sāṭakaṃ pārupitvā āgamma udakacāṭiyaṃ pakkhipitvā pakkāmi. Mahājane paṭikkante rājamanussā cāṭiyaṃ hatthaṃ otāretvā maṇiṃ disvā āharitvā rañño adaṃsu. ‘‘Ānandattherena kira dassitanayena maṇi diṭṭho’’ti mahājano kolāhalaṃ akāsi. Te bhikkhū taṃ kāraṇaṃ tathāgatassa ārocentā imaṃ pavattiṃ ārocesuṃ. Satthā – ‘‘anacchariyaṃ, bhikkhave, yaṃ ānando manussānaṃ hatthāruḷhamaṇiṃ āharāpeyya , yattha pubbe paṇḍitā attano ñāṇe ṭhatvā ahetukapaṭisandhiyaṃ nibbattānaṃ tiracchānagatānampi hatthāruḷhaṃ bhaṇḍaṃ āharāpetvā rañño adaṃsū’’ti vatvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ukkaṭṭhe sūramicchanti, mantīsu akutūhalaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Piyañca annapānamhi, atthe jāte ca paṇḍita’’nti. (jā. 1.1.92) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Mahāsārajātakaṃ kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na taṃ daḷha"
      },
      "nti taṃ bandhanaṃ thiranti na kathenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadāyasa"
      },
      "nti yaṃ āyasā kataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sārattarattā"
      },
      "ti suṭṭhu rattarattā, sārattena vā rattā sārattarattā, sāraṃ idanti maññanāya rattāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apekkhā"
      },
      "ti ālayo nikanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āhū"
      },
      "ti kathenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ohārina"
      },
      "nti catūsu apāyesu ākaḍḍhanakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sithila"
      },
      "nti na āyasādibandhanaṃ viya iriyāpathaṃ nivāretvā ṭhitaṃ. Tena hi bandhanena baddhā paradesampi gacchantiyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duppamuñca"
      },
      "nti aññatra lokuttarañāṇena muñcituṃ asakkuṇeyyanti. Dasamaṃ."
    ],
    "innerText": "Na taṃ daḷhanti taṃ bandhanaṃ thiranti na kathenti. Yadāyasanti yaṃ āyasā kataṃ. Sārattarattāti suṭṭhu rattarattā, sārattena vā rattā sārattarattā, sāraṃ idanti maññanāya rattāti attho. Apekkhāti ālayo nikanti. Āhūti kathenti. Ohārinanti catūsu apāyesu ākaḍḍhanakaṃ. Sithilanti na āyasādibandhanaṃ viya iriyāpathaṃ nivāretvā ṭhitaṃ. Tena hi bandhanena baddhā paradesampi gacchantiyeva. Duppamuñcanti aññatra lokuttarañāṇena muñcituṃ asakkuṇeyyanti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamo vaggo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Dutiyavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Sattajaṭilasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "122"
      },
      ". Dutiyavaggassa ",
      " paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pubbārāme migāramātupāsāde"
      },
      "ti pubbārāmasaṅkhāte vihāre migāramātuyā pāsāde. Tatrāyaṃ anupubbikathā – atīte satasahassakappamatthake ekā upāsikā padumuttaraṃ bhagavantaṃ nimantetvā buddhappamukhassa bhikkhusaṅghassa satasahassadānaṃ datvā bhagavato pādamūle nipajjitvā – ‘‘anāgate tumhādisassa buddhassa aggupaṭṭhāyikā homī’’ti patthanaṃ akāsi. Sā kappasatasahassaṃ devesu ca manussesu ca saṃsaritvā amhākaṃ bhagavato kāle bhaddiyanagare meṇḍakaputtassa dhanañcayaseṭṭhino gehe sumanadeviyā kucchismiṃ paṭisandhiṃ gaṇhi ",
      ". Jātakāle cassā visākhāti nāmaṃ akaṃsu. Sā yadā bhagavā bhaddiyanagaraṃ agamāsi, tadā pañcahi dārikāsatehi saddhiṃ bhagavato paccuggamanaṃ gatā paṭhamadassanamhiyeva sotāpannā ahosi. Aparabhāge sāvatthiyaṃ migāraseṭṭhiputtassa puṇṇavaḍḍhanakumārassa gehaṃ gatā. Tattha naṃ migāraseṭṭhi mātiṭṭhāne ṭhapesi, tasmā migāramātāti vuccati. Tāya kārite pāsāde."
    ],
    "innerText": "122. Dutiyavaggassa paṭhame pubbārāme migāramātupāsādeti pubbārāmasaṅkhāte vihāre migāramātuyā pāsāde. Tatrāyaṃ anupubbikathā – atīte satasahassakappamatthake ekā upāsikā padumuttaraṃ bhagavantaṃ nimantetvā buddhappamukhassa bhikkhusaṅghassa satasahassadānaṃ datvā bhagavato pādamūle nipajjitvā – ‘‘anāgate tumhādisassa buddhassa aggupaṭṭhāyikā homī’’ti patthanaṃ akāsi. Sā kappasatasahassaṃ devesu ca manussesu ca saṃsaritvā amhākaṃ bhagavato kāle bhaddiyanagare meṇḍakaputtassa dhanañcayaseṭṭhino gehe sumanadeviyā kucchismiṃ paṭisandhiṃ gaṇhi . Jātakāle cassā visākhāti nāmaṃ akaṃsu. Sā yadā bhagavā bhaddiyanagaraṃ agamāsi, tadā pañcahi dārikāsatehi saddhiṃ bhagavato paccuggamanaṃ gatā paṭhamadassanamhiyeva sotāpannā ahosi. Aparabhāge sāvatthiyaṃ migāraseṭṭhiputtassa puṇṇavaḍḍhanakumārassa gehaṃ gatā. Tattha naṃ migāraseṭṭhi mātiṭṭhāne ṭhapesi, tasmā migāramātāti vuccati. Tāya kārite pāsāde."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahi dvārakoṭṭhake"
      },
      "ti pāsādadvārakoṭṭhakassa bahi, na vihāradvārakoṭṭhakassa. So kira pāsādo lohapāsādo viya samantā catudvārakoṭṭhakayuttena pākārena parikkhitto. Tesu pācīnadvārakoṭṭhakassa bahi pāsādacchāyāyaṃ pācīnalokadhātuṃ olokento paññatte varabuddhāsane nisinno hoti."
    ],
    "innerText": "Bahi dvārakoṭṭhaketi pāsādadvārakoṭṭhakassa bahi, na vihāradvārakoṭṭhakassa. So kira pāsādo lohapāsādo viya samantā catudvārakoṭṭhakayuttena pākārena parikkhitto. Tesu pācīnadvārakoṭṭhakassa bahi pāsādacchāyāyaṃ pācīnalokadhātuṃ olokento paññatte varabuddhāsane nisinno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parūḷhakacchanakhalomā"
      },
      "ti parūḷhakacchā parūḷhanakhā parūḷhalomā, kacchādīsu dīghalomā dīghanakhā cāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khārivividha"
      },
      "nti vividhakhāriṃ nānappakārakaṃ pabbajitaparikkhārabhaṇḍakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avidūre atikkamantī"
      },
      "ti avidūramaggena nagaraṃ pavisanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājāhaṃ"
      },
      ", ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhante"
      },
      "ti ahaṃ, bhante, rājā pasenadi kosalo, mayhaṃ nāmaṃ tumhe jānāthāti. Kasmā pana rājā loke aggapuggalassa santike nisinno evarūpānaṃ naggabhogganissirikānaṃ añjaliṃ paggaṇhātīti. Saṅgaṇhanatthāya. Evaṃ hissa ahosi – ‘‘sacāhaṃ ettakampi etesaṃ na karissāmi ",
      ", ‘mayaṃ puttadāraṃ pahāya etassatthāya dubbhojanadukkhaseyyādīni anubhoma, ayaṃ amhākaṃ añjalimattampi na karotī’ti attanā diṭṭhaṃ sutaṃ paṭicchādetvā na katheyyuṃ. Evaṃ kate pana anigūhitvā kathessantī’’ti. Tasmā evamakāsi. Apica satthu ajjhāsayajānanatthaṃ evamakāsi."
    ],
    "innerText": "Parūḷhakacchanakhalomāti parūḷhakacchā parūḷhanakhā parūḷhalomā, kacchādīsu dīghalomā dīghanakhā cāti attho. Khārivividhanti vividhakhāriṃ nānappakārakaṃ pabbajitaparikkhārabhaṇḍakaṃ. Avidūre atikkamantīti avidūramaggena nagaraṃ pavisanti. Rājāhaṃ, bhanteti ahaṃ, bhante, rājā pasenadi kosalo, mayhaṃ nāmaṃ tumhe jānāthāti. Kasmā pana rājā loke aggapuggalassa santike nisinno evarūpānaṃ naggabhogganissirikānaṃ añjaliṃ paggaṇhātīti. Saṅgaṇhanatthāya. Evaṃ hissa ahosi – ‘‘sacāhaṃ ettakampi etesaṃ na karissāmi , ‘mayaṃ puttadāraṃ pahāya etassatthāya dubbhojanadukkhaseyyādīni anubhoma, ayaṃ amhākaṃ añjalimattampi na karotī’ti attanā diṭṭhaṃ sutaṃ paṭicchādetvā na katheyyuṃ. Evaṃ kate pana anigūhitvā kathessantī’’ti. Tasmā evamakāsi. Apica satthu ajjhāsayajānanatthaṃ evamakāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāsikacandana"
      },
      "nti saṇhacandanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mālāgandhavilepana"
      },
      "nti vaṇṇagandhatthāya mālaṃ, sugandhabhāvatthāya gandhaṃ, vaṇṇagandhatthāya vilepanañca dhārentena."
    ],
    "innerText": "Kāsikacandananti saṇhacandanaṃ. Mālāgandhavilepananti vaṇṇagandhatthāya mālaṃ, sugandhabhāvatthāya gandhaṃ, vaṇṇagandhatthāya vilepanañca dhārentena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃvāsenā"
      },
      "ti sahavāsena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlaṃ veditabba"
      },
      "nti ayaṃ susīlo vā dussīlo vāti saṃvasantena upasaṅkamantena jānitabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tañca kho dīghena addhunā na ittara"
      },
      "nti tañca sīlaṃ dīghena kālena veditabbaṃ, na ittarena. Dvīhatīhañhi saṃyatākāro ca saṃvutindriyākāro ca na sakkā dassetuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manasikarotā"
      },
      "ti sīlamassa pariggahessāmīti manasikarontena paccavekkhanteneva sakkā ",
      " jānituṃ, na itarena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññavatā"
      },
      "ti tampi sappaññeneva paṇḍitena. Bālo hi manasikarontopi jānituṃ na sakkoti."
    ],
    "innerText": "Saṃvāsenāti sahavāsena. Sīlaṃ veditabbanti ayaṃ susīlo vā dussīlo vāti saṃvasantena upasaṅkamantena jānitabbo. Tañca kho dīghena addhunā na ittaranti tañca sīlaṃ dīghena kālena veditabbaṃ, na ittarena. Dvīhatīhañhi saṃyatākāro ca saṃvutindriyākāro ca na sakkā dassetuṃ. Manasikarotāti sīlamassa pariggahessāmīti manasikarontena paccavekkhanteneva sakkā jānituṃ, na itarena. Paññavatāti tampi sappaññeneva paṇḍitena. Bālo hi manasikarontopi jānituṃ na sakkoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃvohārenā"
      },
      "ti kathanena."
    ],
    "innerText": "Saṃvohārenāti kathanena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo hi koci manussesu, vohāraṃ upajīvati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evaṃ vāseṭṭha jānāhi, vāṇijo so na brāhmaṇo’’ti. (ma. ni. 2.457) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Ettha hi byavahāro vohāro nāma. ‘‘Cattāro ariyavohārā cattāro anariyavohārā’’ti (dī. ni. 3.313) ettha cetanā. ‘‘Saṅkhā samaññā paññatti vohāro’’ti (dha. sa. 1313-1315) ettha paññatti. ‘‘Vohāramattena so vohareyyā’’ti (saṃ. ni. 1.25) ettha kathā vohāro. Idhāpi esova adhippeto. Ekaccassa hi sammukhā kathā parammukhāya kathāya na sameti, parammukhā ",
      " kathā ca sammukhāya kathāya, tathā purimakathā ca pacchimakathāya, pacchimakathā ca purimakathāya. So kathenteneva sakkā jānituṃ ‘‘asuci eso puggalo’’ti. Sucisīlassa pana purimaṃ pacchimena, pacchimañca purimena sameti, sammukhākathitaṃ parammukhākathitena, parammukhākathitañca sammukhākathitena, tasmā kathentena sakkā sucibhāvo jānitunti pakāsento evamāha."
    ],
    "innerText": "Ettha hi byavahāro vohāro nāma. ‘‘Cattāro ariyavohārā cattāro anariyavohārā’’ti (dī. ni. 3.313) ettha cetanā. ‘‘Saṅkhā samaññā paññatti vohāro’’ti (dha. sa. 1313-1315) ettha paññatti. ‘‘Vohāramattena so vohareyyā’’ti (saṃ. ni. 1.25) ettha kathā vohāro. Idhāpi esova adhippeto. Ekaccassa hi sammukhā kathā parammukhāya kathāya na sameti, parammukhā kathā ca sammukhāya kathāya, tathā purimakathā ca pacchimakathāya, pacchimakathā ca purimakathāya. So kathenteneva sakkā jānituṃ ‘‘asuci eso puggalo’’ti. Sucisīlassa pana purimaṃ pacchimena, pacchimañca purimena sameti, sammukhākathitaṃ parammukhākathitena, parammukhākathitañca sammukhākathitena, tasmā kathentena sakkā sucibhāvo jānitunti pakāsento evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thāmo"
      },
      "ti ",
      " ñāṇathāmo. Yassa hi ñāṇathāmo natthi, so uppannesu upaddavesu gahetabbaggahaṇaṃ katabbakiccaṃ apassanto advāragharaṃ paviṭṭho viya carati. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āpadāsu kho, mahārāja, thāmo veditabbo"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sākacchāyā"
      },
      "ti saṃkathāya. Duppaññassa hi kathā udake geṇḍu viya uppalavati, paññavato kathentassa paṭibhānaṃ anantaraṃ hoti. Udakavipphanditeneva hi maccho khuddako vā mahanto vāti ñāyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ocarakā"
      },
      "ti heṭṭhācarakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Carā"
      },
      " hi pabbatamatthakena carantāpi heṭṭhā – carakāva honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ocaritvā"
      },
      "ti avacaritvā vīmaṃsitvā, taṃ taṃ pavattiṃ ñatvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rajojalla"
      },
      "nti rajañca jallañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaṇṇarūpenā"
      },
      "ti vaṇṇasaṇṭhānena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ittaradassanenā"
      },
      "ti lahukadassanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viyañjanenā"
      },
      "ti parikkhārabhaṇḍakena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patirūpako mattikākuṇḍalovā"
      },
      "ti suvaṇṇakuṇḍalapatirūpako mattikākuṇḍalova. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lohaḍḍhamāso"
      },
      "ti lohaḍḍhamāsako. Paṭhamaṃ."
    ],
    "innerText": "Thāmoti ñāṇathāmo. Yassa hi ñāṇathāmo natthi, so uppannesu upaddavesu gahetabbaggahaṇaṃ katabbakiccaṃ apassanto advāragharaṃ paviṭṭho viya carati. Tenāha āpadāsu kho, mahārāja, thāmo veditabboti. Sākacchāyāti saṃkathāya. Duppaññassa hi kathā udake geṇḍu viya uppalavati, paññavato kathentassa paṭibhānaṃ anantaraṃ hoti. Udakavipphanditeneva hi maccho khuddako vā mahanto vāti ñāyati. Ocarakāti heṭṭhācarakā. Carā hi pabbatamatthakena carantāpi heṭṭhā – carakāva honti. Ocaritvāti avacaritvā vīmaṃsitvā, taṃ taṃ pavattiṃ ñatvāti attho. Rajojallanti rajañca jallañca. Vaṇṇarūpenāti vaṇṇasaṇṭhānena. Ittaradassanenāti lahukadassanena. Viyañjanenāti parikkhārabhaṇḍakena. Patirūpako mattikākuṇḍalovāti suvaṇṇakuṇḍalapatirūpako mattikākuṇḍalova. Lohaḍḍhamāsoti lohaḍḍhamāsako. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Pañcarājasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "123"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpā"
      },
      "ti nīlapītādibhedaṃ rūpārammaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmānaṃ agga"
      },
      "nti etaṃ kāmānaṃ uttamaṃ seṭṭhanti rūpagaruko āha. Sesesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yato"
      },
      "ti yadā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manāpapariyanta"
      },
      "nti ",
      " manāpanipphattikaṃ manāpakoṭikaṃ. Tattha dve manāpāni puggalamanāpaṃ sammutimanāpañca. Puggalamanāpaṃ nāma yaṃ ekassa puggalassa iṭṭhaṃ kantaṃ hoti, tadeva aññassa aniṭṭhaṃ akantaṃ. Paccantavāsīnañhi gaṇḍuppādāpi iṭṭhā honti kantā manāpā, majjhimadesavāsīnaṃ atijegucchā. Tesañca moramaṃsādīni iṭṭhāni honti, itaresaṃ tāni atijegucchāni. Idaṃ puggalamanāpaṃ. Itaraṃ sammutimanāpaṃ."
    ],
    "innerText": "123. Dutiye rūpāti nīlapītādibhedaṃ rūpārammaṇaṃ. Kāmānaṃ agganti etaṃ kāmānaṃ uttamaṃ seṭṭhanti rūpagaruko āha. Sesesupi eseva nayo. Yatoti yadā. Manāpapariyantanti manāpanipphattikaṃ manāpakoṭikaṃ. Tattha dve manāpāni puggalamanāpaṃ sammutimanāpañca. Puggalamanāpaṃ nāma yaṃ ekassa puggalassa iṭṭhaṃ kantaṃ hoti, tadeva aññassa aniṭṭhaṃ akantaṃ. Paccantavāsīnañhi gaṇḍuppādāpi iṭṭhā honti kantā manāpā, majjhimadesavāsīnaṃ atijegucchā. Tesañca moramaṃsādīni iṭṭhāni honti, itaresaṃ tāni atijegucchāni. Idaṃ puggalamanāpaṃ. Itaraṃ sammutimanāpaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iṭṭhāniṭṭhārammaṇaṃ nāma loke paṭivibhattaṃ natthi, vibhajitvā pana dassetabbaṃ. Vibhajantena ca na atiissarānaṃ mahāsammatamahāsudassanadhammāsokādīnaṃ vasena vibhajitabbaṃ. Tesañhi dippakappampi ārammaṇaṃ amanāpaṃ upaṭṭhāti. Atiduggatānaṃ dullabhannapānānaṃ vasenapi na vibhajitabbaṃ. Tesañhi kaṇājakabhattasitthānipi pūtimaṃsassa rasopi atimadhuro amatasadiso hoti. Majjhimānaṃ pana gaṇakamahāmattaseṭṭhi kuṭumbikavāṇijādīnaṃ kālena ",
      " iṭṭhaṃ kālena aniṭṭhaṃ labhamānānaṃ vasena vibhajitabbaṃ. Tañca panetaṃ ārammaṇaṃ javanaṃ paricchindituṃ na sakkoti. Javanañhi iṭṭhepi rajjati aniṭṭhepi, iṭṭhepi dussati aniṭṭhepi. Ekantato pana vipākacittaṃ iṭṭhāniṭṭhaṃ paricchindati. Kiñcāpi hi micchādiṭṭhikā buddhaṃ vā saṅghaṃ vā mahācetiyādīni vā uḷārāni ārammaṇāni disvā akkhīni pidahanti domanassaṃ āpajjanti, dhammasaddaṃ sutvā kaṇṇe thakenti, cakkhuviññāṇasotaviññāṇāni pana tesaṃ kusalavipākāneva honti. Kiñcāpi gūthasūkarādayo gūthagandhaṃ ghāyitvā khādituṃ labhissāmāti somanassajātā honti, gūthadassane pana nesaṃ cakkhuviññāṇaṃ, tassa gandhaghāyane ghānaviññāṇaṃ, rasasāyane jivhāviññāṇañca akusalavipākameva hoti. Bhagavā pana puggalamanāpataṃ sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "te ca, mahārāja, rūpā"
      },
      "tiādimāha."
    ],
    "innerText": "Iṭṭhāniṭṭhārammaṇaṃ nāma loke paṭivibhattaṃ natthi, vibhajitvā pana dassetabbaṃ. Vibhajantena ca na atiissarānaṃ mahāsammatamahāsudassanadhammāsokādīnaṃ vasena vibhajitabbaṃ. Tesañhi dippakappampi ārammaṇaṃ amanāpaṃ upaṭṭhāti. Atiduggatānaṃ dullabhannapānānaṃ vasenapi na vibhajitabbaṃ. Tesañhi kaṇājakabhattasitthānipi pūtimaṃsassa rasopi atimadhuro amatasadiso hoti. Majjhimānaṃ pana gaṇakamahāmattaseṭṭhi kuṭumbikavāṇijādīnaṃ kālena iṭṭhaṃ kālena aniṭṭhaṃ labhamānānaṃ vasena vibhajitabbaṃ. Tañca panetaṃ ārammaṇaṃ javanaṃ paricchindituṃ na sakkoti. Javanañhi iṭṭhepi rajjati aniṭṭhepi, iṭṭhepi dussati aniṭṭhepi. Ekantato pana vipākacittaṃ iṭṭhāniṭṭhaṃ paricchindati. Kiñcāpi hi micchādiṭṭhikā buddhaṃ vā saṅghaṃ vā mahācetiyādīni vā uḷārāni ārammaṇāni disvā akkhīni pidahanti domanassaṃ āpajjanti, dhammasaddaṃ sutvā kaṇṇe thakenti, cakkhuviññāṇasotaviññāṇāni pana tesaṃ kusalavipākāneva honti. Kiñcāpi gūthasūkarādayo gūthagandhaṃ ghāyitvā khādituṃ labhissāmāti somanassajātā honti, gūthadassane pana nesaṃ cakkhuviññāṇaṃ, tassa gandhaghāyane ghānaviññāṇaṃ, rasasāyane jivhāviññāṇañca akusalavipākameva hoti. Bhagavā pana puggalamanāpataṃ sandhāya te ca, mahārāja, rūpātiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Candanaṅgaliko"
      },
      "ti idaṃ tassa upāsakassa nāmaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭibhāti maṃ bhagavā"
      },
      "ti bhagavā mayhaṃ ekaṃ kāraṇaṃ upaṭṭhāti paññāyati. Tassa te pañca rājāno āmuttamaṇikuṇḍale sajjitāya ",
      " āpānabhūmiyā nisinnavaseneva mahatā rājānubhāvena paramena issariyavibhavena āgantvāpi dasabalassa ",
      " santike ṭhitakālato paṭṭhāya divā padīpe viya udakābhisitte aṅgāre viya sūriyuṭṭhāne khajjopanake viya ca hatappabhe hatasobhe taṃ tathāgatañca tehi sataguṇena sahassaguṇena virocamānaṃ disvā, ‘‘mahantā vata bho buddhā nāmā’’ti paṭibhānaṃ udapādi. Tasmā evamāha."
    ],
    "innerText": "Candanaṅgalikoti idaṃ tassa upāsakassa nāmaṃ. Paṭibhāti maṃ bhagavāti bhagavā mayhaṃ ekaṃ kāraṇaṃ upaṭṭhāti paññāyati. Tassa te pañca rājāno āmuttamaṇikuṇḍale sajjitāya āpānabhūmiyā nisinnavaseneva mahatā rājānubhāvena paramena issariyavibhavena āgantvāpi dasabalassa santike ṭhitakālato paṭṭhāya divā padīpe viya udakābhisitte aṅgāre viya sūriyuṭṭhāne khajjopanake viya ca hatappabhe hatasobhe taṃ tathāgatañca tehi sataguṇena sahassaguṇena virocamānaṃ disvā, ‘‘mahantā vata bho buddhā nāmā’’ti paṭibhānaṃ udapādi. Tasmā evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kokanada"
      },
      "nti padumassevetaṃ vevacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāto"
      },
      "ti kālasseva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siyā"
      },
      "ti bhaveyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avītagandha"
      },
      "nti avigatagandhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṅgīrasa"
      },
      "nti sammāsambuddhaṃ. Bhagavato hi aṅgato rasmiyo nikkhamanti, tasmā aṅgīrasoti vuccati. Yathā kokanadasaṅkhātaṃ padumaṃ pātova phullaṃ avītagandhaṃ siyā, evameva bhagavantaṃ aṅgīrasaṃ tapantaṃ ādiccamiva antalikkhe virocamānaṃ passāti ayamettha saṅkhepattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavantaṃ acchādesī"
      },
      "ti bhagavato adāsīti attho. Lokavohārato panettha īdisaṃ vacanaṃ hoti. So kira upāsako – ‘‘ete tathāgatassa guṇesu pasīditvā mayhaṃ pañca uttarāsaṅge ",
      " denti, ahampi te bhagavatova dassāmī’’ti cintetvā adāsi. Dutiyaṃ."
    ],
    "innerText": "Kokanadanti padumassevetaṃ vevacanaṃ. Pātoti kālasseva. Siyāti bhaveyya. Avītagandhanti avigatagandhaṃ. Aṅgīrasanti sammāsambuddhaṃ. Bhagavato hi aṅgato rasmiyo nikkhamanti, tasmā aṅgīrasoti vuccati. Yathā kokanadasaṅkhātaṃ padumaṃ pātova phullaṃ avītagandhaṃ siyā, evameva bhagavantaṃ aṅgīrasaṃ tapantaṃ ādiccamiva antalikkhe virocamānaṃ passāti ayamettha saṅkhepattho. Bhagavantaṃ acchādesīti bhagavato adāsīti attho. Lokavohārato panettha īdisaṃ vacanaṃ hoti. So kira upāsako – ‘‘ete tathāgatassa guṇesu pasīditvā mayhaṃ pañca uttarāsaṅge denti, ahampi te bhagavatova dassāmī’’ti cintetvā adāsi. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Doṇapākasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "124"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "doṇapākakura"
      },
      "nti doṇapākaṃ kuraṃ, doṇassa taṇḍulānaṃ pakkabhattaṃ tadūpiyañca sūpabyañjanaṃ bhuñjatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhuttāvī"
      },
      "ti pubbe bhattasammadaṃ vinodetvā muhuttaṃ vissamitvā buddhupaṭṭhānaṃ gacchati, taṃdivasaṃ pana bhuñjantova dasabalaṃ saritvā hatthe dhovitvā agamāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahassāsī"
      },
      "ti tassa gacchato balavā bhattaparīḷāho udapādi, tasmā mahantehi assāsehi assasati, gattatopissa sedabindūni muccanti, tamenaṃ ubhosu passesu ṭhatvā yamakatālavaṇṭehi bījanti, buddhagāravena pana nipajjituṃ na ussahatīti idaṃ sandhāya ‘‘mahassāsī’’ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imaṃ gāthaṃ abhāsī"
      },
      "ti, rājā bhojane ",
      " amattaññutāya kilamati, phāsu vihāraṃ dānissa karissāmīti cintetvā abhāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manujassā"
      },
      "ti sattassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kahāpaṇasata"
      },
      "nti pātarāse paṇṇāsaṃ sāyamāse paṇṇāsanti evaṃ kahāpaṇasataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyāpuṇitvā"
      },
      "ti raññā saddhiṃ thokaṃ gantvā ‘‘imaṃ maṅgalaasiṃ kassa dammi, mahārājā’’ti? Asukassa nāma dehīti so taṃ asiṃ datvā dasabalassa santikaṃ āgamma vanditvā ṭhitakova ‘‘gāthaṃ vadatha, bho gotamā’’ti vatvā bhagavatā vuttaṃ pariyāpuṇitvāti attho."
    ],
    "innerText": "124. Tatiye doṇapākakuranti doṇapākaṃ kuraṃ, doṇassa taṇḍulānaṃ pakkabhattaṃ tadūpiyañca sūpabyañjanaṃ bhuñjatīti attho. Bhuttāvīti pubbe bhattasammadaṃ vinodetvā muhuttaṃ vissamitvā buddhupaṭṭhānaṃ gacchati, taṃdivasaṃ pana bhuñjantova dasabalaṃ saritvā hatthe dhovitvā agamāsi. Mahassāsīti tassa gacchato balavā bhattaparīḷāho udapādi, tasmā mahantehi assāsehi assasati, gattatopissa sedabindūni muccanti, tamenaṃ ubhosu passesu ṭhatvā yamakatālavaṇṭehi bījanti, buddhagāravena pana nipajjituṃ na ussahatīti idaṃ sandhāya ‘‘mahassāsī’’ti vuttaṃ. Imaṃ gāthaṃ abhāsīti, rājā bhojane amattaññutāya kilamati, phāsu vihāraṃ dānissa karissāmīti cintetvā abhāsi. Manujassāti sattassa. Kahāpaṇasatanti pātarāse paṇṇāsaṃ sāyamāse paṇṇāsanti evaṃ kahāpaṇasataṃ. Pariyāpuṇitvāti raññā saddhiṃ thokaṃ gantvā ‘‘imaṃ maṅgalaasiṃ kassa dammi, mahārājā’’ti? Asukassa nāma dehīti so taṃ asiṃ datvā dasabalassa santikaṃ āgamma vanditvā ṭhitakova ‘‘gāthaṃ vadatha, bho gotamā’’ti vatvā bhagavatā vuttaṃ pariyāpuṇitvāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhattābhihāre"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sudaṃ bhāsatī"
      },
      "ti kathaṃ bhāsati? Bhagavatā anusiṭṭhiniyāmena. Bhagavā hi naṃ evaṃ anusāsi – ‘‘māṇava, imaṃ gāthaṃ naṭo viya pattapattaṭṭhāne mā avaca, rañño bhuñjanaṭṭhāne ṭhatvā paṭhamapiṇḍādīsupi avatvā vosānapiṇḍe gahite vadeyyāsi, rājā sutvāva bhattapiṇḍaṃ chaḍḍessati. Atha rañño hatthesu dhotesu pātiṃ apanetvā sitthāni gaṇetvā tadupiyaṃ byañjanaṃ ñatvā punadivase tāvatake taṇḍule hāreyyāsi, pātarāse ca vatvā sāyamāse mā vadeyyāsī’’ti. So sādhūti paṭissuṇitvā taṃdivasaṃ rañño pātarāsaṃ bhutvā gatattā sāyamāse bhagavato anusiṭṭhiniyāmena gāthaṃ abhāsi ",
      ". Rājā dasabalassa vacanaṃ saritvā bhattapiṇḍaṃ pātiyaṃyeva chaḍḍesi. Rañño hatthesu dhotesu pātiṃ apanetvā sitthāni gaṇetvā tadupiyaṃ byañjanaṃ ñatvā punadivase tattake taṇḍule hariṃsu."
    ],
    "innerText": "Bhattābhihāresudaṃ bhāsatīti kathaṃ bhāsati? Bhagavatā anusiṭṭhiniyāmena. Bhagavā hi naṃ evaṃ anusāsi – ‘‘māṇava, imaṃ gāthaṃ naṭo viya pattapattaṭṭhāne mā avaca, rañño bhuñjanaṭṭhāne ṭhatvā paṭhamapiṇḍādīsupi avatvā vosānapiṇḍe gahite vadeyyāsi, rājā sutvāva bhattapiṇḍaṃ chaḍḍessati. Atha rañño hatthesu dhotesu pātiṃ apanetvā sitthāni gaṇetvā tadupiyaṃ byañjanaṃ ñatvā punadivase tāvatake taṇḍule hāreyyāsi, pātarāse ca vatvā sāyamāse mā vadeyyāsī’’ti. So sādhūti paṭissuṇitvā taṃdivasaṃ rañño pātarāsaṃ bhutvā gatattā sāyamāse bhagavato anusiṭṭhiniyāmena gāthaṃ abhāsi . Rājā dasabalassa vacanaṃ saritvā bhattapiṇḍaṃ pātiyaṃyeva chaḍḍesi. Rañño hatthesu dhotesu pātiṃ apanetvā sitthāni gaṇetvā tadupiyaṃ byañjanaṃ ñatvā punadivase tattake taṇḍule hariṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāḷikodanaparamatāya saṇṭhāsī"
      },
      "ti so kira māṇavo divase divase tathāgatassa santikaṃ gacchati, dasabalassa vissāsiko ahosi. Atha naṃ ekadivasaṃ pucchi ‘‘rājā kittakaṃ bhuñjatī’’ti? So ‘‘nāḷikodana’’nti āha. Vaṭṭissati ettāvatā purisabhāgo esa, ito paṭṭhāya gāthaṃ mā vadīti. Iti rājā tattheva saṇṭhāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhadhammikena ceva atthena samparāyikena cā"
      },
      "ti ettha sallikhitasarīratā diṭṭhadhammikattho nāma, sīlaṃ samparāyikattho. Bhojane mattaññutā hi sīlaṅgaṃ nāma hotīti. Tatiyaṃ."
    ],
    "innerText": "Nāḷikodanaparamatāya saṇṭhāsīti so kira māṇavo divase divase tathāgatassa santikaṃ gacchati, dasabalassa vissāsiko ahosi. Atha naṃ ekadivasaṃ pucchi ‘‘rājā kittakaṃ bhuñjatī’’ti? So ‘‘nāḷikodana’’nti āha. Vaṭṭissati ettāvatā purisabhāgo esa, ito paṭṭhāya gāthaṃ mā vadīti. Iti rājā tattheva saṇṭhāsi. Diṭṭhadhammikena ceva atthena samparāyikena cāti ettha sallikhitasarīratā diṭṭhadhammikattho nāma, sīlaṃ samparāyikattho. Bhojane mattaññutā hi sīlaṅgaṃ nāma hotīti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Paṭhamasaṅgāmasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "125"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedehiputto"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedehī"
      },
      "ti paṇḍitādhivacanametaṃ, paṇḍititthiyā puttoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Caturaṅgini"
      },
      "nti hatthiassarathapattisaṅkhātehi catūhi aṅgehi samannāgataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sannayhitvā"
      },
      "ti cammapaṭimuñcanādīhi sannāhaṃ kāretvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅgāmesu"
      },
      "nti yujjhiṃsu. Kena kāraṇena? Mahākosalaraññā kira bimbisārassa dhītaraṃ dentena dvinnaṃ rajjānaṃ antare satasahassuṭṭhāno kāsigāmo nāma dhītu dinno. Ajātasattunā ca pitari mārite mātāpissa rañño viyogasokena nacirasseva matā. Tato rājā pasenadi kosalo – ‘‘ajātasattunā mātāpitaro māritā, mayhaṃ pitu santako gāmo’’ti tassatthāya aḍḍaṃ karoti. Ajātasattupi ‘‘mayhaṃ mātu santako’’ti tassa gāmassatthāya dvepi mātulabhāgineyyā yujjhiṃsu."
    ],
    "innerText": "125. Catutthe vedehiputtoti vedehīti paṇḍitādhivacanametaṃ, paṇḍititthiyā puttoti attho. Caturaṅgininti hatthiassarathapattisaṅkhātehi catūhi aṅgehi samannāgataṃ. Sannayhitvāti cammapaṭimuñcanādīhi sannāhaṃ kāretvā. Saṅgāmesunti yujjhiṃsu. Kena kāraṇena? Mahākosalaraññā kira bimbisārassa dhītaraṃ dentena dvinnaṃ rajjānaṃ antare satasahassuṭṭhāno kāsigāmo nāma dhītu dinno. Ajātasattunā ca pitari mārite mātāpissa rañño viyogasokena nacirasseva matā. Tato rājā pasenadi kosalo – ‘‘ajātasattunā mātāpitaro māritā, mayhaṃ pitu santako gāmo’’ti tassatthāya aḍḍaṃ karoti. Ajātasattupi ‘‘mayhaṃ mātu santako’’ti tassa gāmassatthāya dvepi mātulabhāgineyyā yujjhiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pāpā ",
      " devadattādayo mittā assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāpamitto"
      },
      ". Teyevassa sahāyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāpasahāyo"
      },
      ". Tesvevassa cittaṃ ninnaṃ sampavaṅkanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāpasampavaṅko"
      },
      ". Pasenadissa sāriputtattherādīnaṃ vasena kalyāṇamittāditā veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhaṃ setī"
      },
      "ti jitāni hatthiādīni anusocanto dukkhaṃ sayissati. Idaṃ bhagavā puna tassa jayakāraṇaṃ disvā āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jayaṃ veraṃ pasavatī"
      },
      "ti jinanto veraṃ pasavati, veripuggalaṃ labhati. Catutthaṃ."
    ],
    "innerText": "Pāpā devadattādayo mittā assāti pāpamitto. Teyevassa sahāyāti pāpasahāyo. Tesvevassa cittaṃ ninnaṃ sampavaṅkanti pāpasampavaṅko. Pasenadissa sāriputtattherādīnaṃ vasena kalyāṇamittāditā veditabbā. Dukkhaṃ setīti jitāni hatthiādīni anusocanto dukkhaṃ sayissati. Idaṃ bhagavā puna tassa jayakāraṇaṃ disvā āha. Jayaṃ veraṃ pasavatīti jinanto veraṃ pasavati, veripuggalaṃ labhati. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Dutiyasaṅgāmasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "126"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abbhuyyāsī"
      },
      "ti parājaye garahappatto ‘‘ārāmaṃ gantvā bhikkhūnaṃ kathāsallāpaṃ suṇāthā’’ti rattibhāge buddharakkhitena nāma vuḍḍhapabbajitena dhammarakkhitassa vuḍḍhapabbajitassa ‘‘sace rājā imañca upāyaṃ katvā gaccheyya, puna jineyyā’’ti vuttajayakāraṇaṃ sutvā abhiuyyāsi."
    ],
    "innerText": "126. Pañcame abbhuyyāsīti parājaye garahappatto ‘‘ārāmaṃ gantvā bhikkhūnaṃ kathāsallāpaṃ suṇāthā’’ti rattibhāge buddharakkhitena nāma vuḍḍhapabbajitena dhammarakkhitassa vuḍḍhapabbajitassa ‘‘sace rājā imañca upāyaṃ katvā gaccheyya, puna jineyyā’’ti vuttajayakāraṇaṃ sutvā abhiuyyāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāvassa upakappatī"
      },
      "ti yāva tassa upakappati sayhaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadā caññe"
      },
      "ti yadā aññe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vilumpantī"
      },
      "ti taṃ vilumpitvā ",
      " ṭhitapuggalaṃ vilumpanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vilumpatī"
      },
      "ti vilumpiyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhānaṃ hi maññatī"
      },
      "ti ‘‘kāraṇa’’nti hi maññati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadā"
      },
      "ti yasmiṃ kāle. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jetāraṃ labhate jaya"
      },
      "nti jayanto puggalo pacchā jetārampi labhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rosetāra"
      },
      "nti ghaṭṭetāraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rosako"
      },
      "ti ghaṭṭako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammavivaṭṭenā"
      },
      "ti kammapariṇāmena, tassa vilumpanakammassa vipākadānena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So vilutto viluppatī"
      },
      "ti so vilumpako vilumpiyati. Pañcamaṃ."
    ],
    "innerText": "Yāvassa upakappatīti yāva tassa upakappati sayhaṃ hoti. Yadā caññeti yadā aññe. Vilumpantīti taṃ vilumpitvā ṭhitapuggalaṃ vilumpanti. Vilumpatīti vilumpiyati. Ṭhānaṃ hi maññatīti ‘‘kāraṇa’’nti hi maññati. Yadāti yasmiṃ kāle. Jetāraṃ labhate jayanti jayanto puggalo pacchā jetārampi labhati. Rosetāranti ghaṭṭetāraṃ. Rosakoti ghaṭṭako. Kammavivaṭṭenāti kammapariṇāmena, tassa vilumpanakammassa vipākadānena. So vilutto viluppatīti so vilumpako vilumpiyati. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Mallikāsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "127"
      },
      ". Chaṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upasaṅkamī"
      },
      "ti mallikāya deviyā gabbhavuṭṭhānakāle sūtigharaṃ paṭijaggāpetvā ārakkhaṃ datvā upasaṅkami. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anattamano ahosī"
      },
      "ti, ‘‘duggatakulassa me dhītu mahantaṃ issariyaṃ dinnaṃ, sace puttaṃ alabhissa, mahantaṃ sakkāraṃ adhigamissa, tato dāni parihīnā’’ti anattamano ahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seyyā"
      },
      "ti dandhapaññasmā elamūgaputtato ekaccā itthīyeva seyyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Posā"
      },
      "ti posehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Janādhipā"
      },
      "ti janādhibhuṃ rājānaṃ ālapati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sassudevā"
      },
      "ti sassusasuradevatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Disampatī"
      },
      "ti disājeṭṭhakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tādisā subhagiyā"
      },
      "ti tādisāya subhariyāya. Chaṭṭhaṃ."
    ],
    "innerText": "127. Chaṭṭhe upasaṅkamīti mallikāya deviyā gabbhavuṭṭhānakāle sūtigharaṃ paṭijaggāpetvā ārakkhaṃ datvā upasaṅkami. Anattamano ahosīti, ‘‘duggatakulassa me dhītu mahantaṃ issariyaṃ dinnaṃ, sace puttaṃ alabhissa, mahantaṃ sakkāraṃ adhigamissa, tato dāni parihīnā’’ti anattamano ahosi. Seyyāti dandhapaññasmā elamūgaputtato ekaccā itthīyeva seyyā. Posāti posehi. Janādhipāti janādhibhuṃ rājānaṃ ālapati. Sassudevāti sassusasuradevatā. Disampatīti disājeṭṭhakā. Tādisā subhagiyāti tādisāya subhariyāya. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Appamādasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "128"
      },
      ". Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samadhiggayhā"
      },
      "ti samadhiggaṇhitvā, ādiyitvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appamādo"
      },
      "ti kārāpakaappamādo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samodhāna"
      },
      "nti samavadhānaṃ upakkhepaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evameva kho"
      },
      "ti hatthipadaṃ viya hi kārāpakaappamādo, sesapadajātāni viya avasesā catubhūmakā kusaladhammā. Te hatthipade sesapadāni viya ",
      " appamāde samodhānaṃ gacchanti, appamādassa anto parivattanti. Yathā ca hatthipadaṃ sesapadānaṃ aggaṃ seṭṭhaṃ, evaṃ appamādo sesadhammānanti dasseti. Mahaggatalokuttaradhammānampi hesa paṭilābhakaṭṭhena lokiyopi samāno aggova hoti."
    ],
    "innerText": "128. Sattame samadhiggayhāti samadhiggaṇhitvā, ādiyitvāti attho. Appamādoti kārāpakaappamādo. Samodhānanti samavadhānaṃ upakkhepaṃ. Evameva khoti hatthipadaṃ viya hi kārāpakaappamādo, sesapadajātāni viya avasesā catubhūmakā kusaladhammā. Te hatthipade sesapadāni viya appamāde samodhānaṃ gacchanti, appamādassa anto parivattanti. Yathā ca hatthipadaṃ sesapadānaṃ aggaṃ seṭṭhaṃ, evaṃ appamādo sesadhammānanti dasseti. Mahaggatalokuttaradhammānampi hesa paṭilābhakaṭṭhena lokiyopi samāno aggova hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appamādaṃ pasaṃsantī"
      },
      "ti ‘‘etāni āyuādīni patthayantena appamādova kātabbo’’ti appamādameva pasaṃsanti. Yasmā vā puññakiriyāsu paṇḍitā appamādaṃ pasaṃsanti, tasmā āyuādīni patthayantena appamādova kātabboti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthābhisamayā"
      },
      "ti atthapaṭilābhā. Sattamaṃ."
    ],
    "innerText": "Appamādaṃ pasaṃsantīti ‘‘etāni āyuādīni patthayantena appamādova kātabbo’’ti appamādameva pasaṃsanti. Yasmā vā puññakiriyāsu paṇḍitā appamādaṃ pasaṃsanti, tasmā āyuādīni patthayantena appamādova kātabboti attho. Atthābhisamayāti atthapaṭilābhā. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Kalyāṇamittasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "129"
      },
      ". Aṭṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "so ca kho kalyāṇamittassā"
      },
      "ti so cāyaṃ dhammo kalyāṇamittasseva svākkhāto nāma hoti, na pāpamittassāti. Kiñcāpi hi dhammo sabbesampi svākkhātova, kalyāṇamittassa pana sussūsantassa saddahantassa atthaṃ pūreti bhesajjaṃ viya vaḷañjantassa na itarassāti. Tenetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammo"
      },
      "ti cettha desanādhammo veditabbo."
    ],
    "innerText": "129. Aṭṭhame so ca kho kalyāṇamittassāti so cāyaṃ dhammo kalyāṇamittasseva svākkhāto nāma hoti, na pāpamittassāti. Kiñcāpi hi dhammo sabbesampi svākkhātova, kalyāṇamittassa pana sussūsantassa saddahantassa atthaṃ pūreti bhesajjaṃ viya vaḷañjantassa na itarassāti. Tenetaṃ vuttaṃ. Dhammoti cettha desanādhammo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upaḍḍhamida"
      },
      "nti thero kira rahogato cintesi – ‘‘ayaṃ samaṇadhammo nāma ovādake anusāsake kalyāṇamitte sati paccattapurisakāre ṭhitassa sampajjati, upaḍḍhaṃ kalyāṇamittato hoti, upaḍḍhaṃ paccattapurisakārato’’ti. Athassa etadahosi – ‘‘ahaṃ padesañāṇe ṭhito nippadesaṃ cintetuṃ na sakkomi, satthāraṃ pucchitvā nikkaṅkho bhavissāmī’’ti. Tasmā satthāraṃ upasaṅkamitvā evamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brahmacariyassā"
      },
      "ti ariyamaggassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadidaṃ kalyāṇamittatā"
      },
      "ti yā esā kalyāṇamittatā nāma, sā upaḍḍhaṃ, tato upaḍḍhaṃ āgacchatīti attho. Iti therena ‘‘upaḍḍhupaḍḍhā sammādiṭṭhiādayo kalyāṇamittato āgacchanti, upaḍḍhupaḍḍhā paccattapurisakārato’’ti vuttaṃ. Kiñcāpi ",
      " therassa ayaṃ manoratho, yathā pana bahūhi silāthambhe ussāpite, ‘‘ettakaṃ ṭhānaṃ asukena ussāpitaṃ, ettakaṃ asukenā’’ti vinibbhogo natthi, yathā ca mātāpitaro nissāya uppannesu puttesu ‘‘ettakaṃ mātito ",
      " nibbattaṃ, ettakaṃ pitito’’ti vinibbhogo natthi, evaṃ idhāpi avinibbhogadhammo hesa, ‘‘ettakaṃ sammādiṭṭhiādīnaṃ ",
      " kalyāṇamittato nibbattaṃ, ettakaṃ paccattapurisakārato’’ti na sakkā laddhuṃ, kalyāṇamittatāya pana upaḍḍhaguṇo labbhatīti therassa ajjhāsayena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upaḍḍhaṃ"
      },
      " nāma jātaṃ, sakalaguṇo paṭilabbhatīti bhagavato ajjhāsayena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sakalaṃ"
      },
      " nāma jātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kalyāṇamittatā"
      },
      "ti cetaṃ pubbabhāgapaṭilābhaṅgaṃ nāmāti gahitaṃ. Atthato kalyāṇamittaṃ nissāya laddhā sīlasamādhivipassanāvasena cattāro khandhā. Saṅkhārakkhandhotipi vadantiyeva."
    ],
    "innerText": "Upaḍḍhamidanti thero kira rahogato cintesi – ‘‘ayaṃ samaṇadhammo nāma ovādake anusāsake kalyāṇamitte sati paccattapurisakāre ṭhitassa sampajjati, upaḍḍhaṃ kalyāṇamittato hoti, upaḍḍhaṃ paccattapurisakārato’’ti. Athassa etadahosi – ‘‘ahaṃ padesañāṇe ṭhito nippadesaṃ cintetuṃ na sakkomi, satthāraṃ pucchitvā nikkaṅkho bhavissāmī’’ti. Tasmā satthāraṃ upasaṅkamitvā evamāha. Brahmacariyassāti ariyamaggassa. Yadidaṃ kalyāṇamittatāti yā esā kalyāṇamittatā nāma, sā upaḍḍhaṃ, tato upaḍḍhaṃ āgacchatīti attho. Iti therena ‘‘upaḍḍhupaḍḍhā sammādiṭṭhiādayo kalyāṇamittato āgacchanti, upaḍḍhupaḍḍhā paccattapurisakārato’’ti vuttaṃ. Kiñcāpi therassa ayaṃ manoratho, yathā pana bahūhi silāthambhe ussāpite, ‘‘ettakaṃ ṭhānaṃ asukena ussāpitaṃ, ettakaṃ asukenā’’ti vinibbhogo natthi, yathā ca mātāpitaro nissāya uppannesu puttesu ‘‘ettakaṃ mātito nibbattaṃ, ettakaṃ pitito’’ti vinibbhogo natthi, evaṃ idhāpi avinibbhogadhammo hesa, ‘‘ettakaṃ sammādiṭṭhiādīnaṃ kalyāṇamittato nibbattaṃ, ettakaṃ paccattapurisakārato’’ti na sakkā laddhuṃ, kalyāṇamittatāya pana upaḍḍhaguṇo labbhatīti therassa ajjhāsayena upaḍḍhaṃ nāma jātaṃ, sakalaguṇo paṭilabbhatīti bhagavato ajjhāsayena sakalaṃ nāma jātaṃ. Kalyāṇamittatāti cetaṃ pubbabhāgapaṭilābhaṅgaṃ nāmāti gahitaṃ. Atthato kalyāṇamittaṃ nissāya laddhā sīlasamādhivipassanāvasena cattāro khandhā. Saṅkhārakkhandhotipi vadantiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mā hevaṃ, ānandā"
      },
      "ti, ānanda, mā evaṃ abhaṇi, bahussuto tvaṃ sekhapaṭisambhidappatto aṭṭha vare gahetvā maṃ upaṭṭhahasi, catūhi acchariyabbhutadhammehi samannāgato, tādisassa evaṃ kathetuṃ na vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakalameva hidaṃ, ānanda, brahmacariyaṃ, yadidaṃ kalyāṇamittatā"
      },
      "ti idaṃ bhagavā – ‘‘cattāro maggā cattāri phalāni tisso vijjā cha abhiññā sabbaṃ kalyāṇamittamūlakameva hotī’’ti sandhāyāha. Idāni vacībhedeneva kāraṇaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kalyāṇamittasseta"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāṭikaṅkha"
      },
      "nti pāṭikaṅkhitabbaṃ icchitabbaṃ, avassaṃbhāvīti attho."
    ],
    "innerText": "Mā hevaṃ, ānandāti, ānanda, mā evaṃ abhaṇi, bahussuto tvaṃ sekhapaṭisambhidappatto aṭṭha vare gahetvā maṃ upaṭṭhahasi, catūhi acchariyabbhutadhammehi samannāgato, tādisassa evaṃ kathetuṃ na vaṭṭati. Sakalameva hidaṃ, ānanda, brahmacariyaṃ, yadidaṃ kalyāṇamittatāti idaṃ bhagavā – ‘‘cattāro maggā cattāri phalāni tisso vijjā cha abhiññā sabbaṃ kalyāṇamittamūlakameva hotī’’ti sandhāyāha. Idāni vacībhedeneva kāraṇaṃ dassento kalyāṇamittassetantiādimāha. Tattha pāṭikaṅkhanti pāṭikaṅkhitabbaṃ icchitabbaṃ, avassaṃbhāvīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti imasmiṃ sāsane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammādiṭṭhiṃ bhāvetī"
      },
      "tiādīsu aṭṭhannaṃ ādipadānaṃyeva tāva ayaṃ saṅkhepavaṇṇanā – sammā dassanalakkhaṇā sammādiṭṭhi. Sammā abhiniropanalakkhaṇo sammāsaṅkappo. Sammā pariggahaṇalakkhaṇā sammāvācā. Sammā samuṭṭhāpanalakkhaṇo sammākammanto. Sammā vodāpanalakkhaṇā sammāājīvo. Sammā paggahalakkhaṇo sammāvāyāmo. Sammā upaṭṭhānalakkhaṇā sammāsati. Sammā samādhānalakkhaṇo sammāsamādhi."
    ],
    "innerText": "Idhāti imasmiṃ sāsane. Sammādiṭṭhiṃ bhāvetītiādīsu aṭṭhannaṃ ādipadānaṃyeva tāva ayaṃ saṅkhepavaṇṇanā – sammā dassanalakkhaṇā sammādiṭṭhi. Sammā abhiniropanalakkhaṇo sammāsaṅkappo. Sammā pariggahaṇalakkhaṇā sammāvācā. Sammā samuṭṭhāpanalakkhaṇo sammākammanto. Sammā vodāpanalakkhaṇā sammāājīvo. Sammā paggahalakkhaṇo sammāvāyāmo. Sammā upaṭṭhānalakkhaṇā sammāsati. Sammā samādhānalakkhaṇo sammāsamādhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesu ekekassa tīṇi kiccāni honti. Seyyāthidaṃ – sammādiṭṭhi tāva aññehipi attano paccanīkakilesehi saddhiṃ micchādiṭṭhiṃ pajahati, nirodhaṃ ārammaṇaṃ karoti, sampayuttadhamme ca passati tappaṭicchādakamohavidhamanavasena asammohato. Sammāsaṅkappādayopi tatheva micchāsaṅkappādīni ca pajahanti, nirodhañca ārammaṇaṃ karonti. Visesato panettha sammādiṭṭhi sahajātadhamme sammā dasseti ",
      ". Sammāsaṅkappo sahajātadhamme abhiniropeti, sammāvācā sammā pariggaṇhāti, sammākammanto sammā ",
      " samuṭṭhāpeti, sammāājīvo sammā vodāpeti ",
      ", sammāvāyāmo sammā paggaṇhāti, sammāsati sammā upaṭṭhāpeti, sammāsamādhi sammā dahati."
    ],
    "innerText": "Tesu ekekassa tīṇi kiccāni honti. Seyyāthidaṃ – sammādiṭṭhi tāva aññehipi attano paccanīkakilesehi saddhiṃ micchādiṭṭhiṃ pajahati, nirodhaṃ ārammaṇaṃ karoti, sampayuttadhamme ca passati tappaṭicchādakamohavidhamanavasena asammohato. Sammāsaṅkappādayopi tatheva micchāsaṅkappādīni ca pajahanti, nirodhañca ārammaṇaṃ karonti. Visesato panettha sammādiṭṭhi sahajātadhamme sammā dasseti . Sammāsaṅkappo sahajātadhamme abhiniropeti, sammāvācā sammā pariggaṇhāti, sammākammanto sammā samuṭṭhāpeti, sammāājīvo sammā vodāpeti , sammāvāyāmo sammā paggaṇhāti, sammāsati sammā upaṭṭhāpeti, sammāsamādhi sammā dahati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Apicesā sammādiṭṭhi nāma pubbabhāge nānākhaṇā nānārammaṇā hoti, maggakāle ekakkhaṇā ekārammaṇā. Kiccato pana sammādiṭṭhi dukkhe ñāṇantiādīni cattāri nāmāni labhati. Sammāsaṅkappādayopi pubbabhāge nānākhaṇā nānārammaṇā honti, maggakāle ekakkhaṇā ekārammaṇā. Tesu sammāsaṅkappo kiccato nekkhammasaṅkappotiādīni tīṇi nāmāni labhati. Sammāvācādayo tayo viratiyopi honti cetanāyopi, maggakkhaṇe pana viratiyova. Sammāvāyāmo sammāsatīti idampi dvayaṃ kiccato sammappadhānasatipaṭṭhānavasena cattāri nāmāni labhati. Sammāsamādhi pana pubbabhāgepi maggakkhaṇepi sammāsamādhiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ tāva ‘‘sammādiṭṭhi’’ntiādinā nayena vuttānaṃ aṭṭhannaṃ ādipadānaṃyeva atthavaṇṇanaṃ ñatvā idāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhāveti vivekanissita"
      },
      "ntiādīsu evaṃ ñātabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvetī"
      },
      "ti vaḍḍheti, attano cittasantāne punappunaṃ janeti, abhinibbattetīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivekanissita"
      },
      "nti vivekaṃ nissitaṃ, viveke vā nissitanti vivekanissitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viveko"
      },
      "ti vivittatā. Vivittatā cāyaṃ tadaṅgaviveko, vikkhambhana-samuccheda-paṭippassaddhi-nissaraṇavivekoti pañcavidho. Evametasmiṃ pañcavidhe viveke. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivekanissita"
      },
      "nti tadaṅgavivekanissitaṃ samucchedavivekanissitaṃ nissaraṇavivekanissitañca sammādiṭṭhiṃ bhāvetīti ayamattho veditabbo. Tathā hi ayaṃ ariyamaggabhāvanānuyutto yogī vipassanākkhaṇe kiccato tadaṅgavivekanissitaṃ, ajjhāsayato nissaraṇavivekanissitaṃ, maggakāle pana kiccato samucchedavivekanissitaṃ, ārammaṇato nissaraṇavivekanissitaṃ sammādiṭṭhiṃ bhāveti. Esa nayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "virāganissitā"
      },
      "dīsu. Vivekatthā eva hi virāgādayo ",
      "."
    ],
    "innerText": "Evaṃ tāva ‘‘sammādiṭṭhi’’ntiādinā nayena vuttānaṃ aṭṭhannaṃ ādipadānaṃyeva atthavaṇṇanaṃ ñatvā idāni bhāveti vivekanissitantiādīsu evaṃ ñātabbo. Bhāvetīti vaḍḍheti, attano cittasantāne punappunaṃ janeti, abhinibbattetīti attho. Vivekanissitanti vivekaṃ nissitaṃ, viveke vā nissitanti vivekanissitaṃ. Vivekoti vivittatā. Vivittatā cāyaṃ tadaṅgaviveko, vikkhambhana-samuccheda-paṭippassaddhi-nissaraṇavivekoti pañcavidho. Evametasmiṃ pañcavidhe viveke. Vivekanissitanti tadaṅgavivekanissitaṃ samucchedavivekanissitaṃ nissaraṇavivekanissitañca sammādiṭṭhiṃ bhāvetīti ayamattho veditabbo. Tathā hi ayaṃ ariyamaggabhāvanānuyutto yogī vipassanākkhaṇe kiccato tadaṅgavivekanissitaṃ, ajjhāsayato nissaraṇavivekanissitaṃ, maggakāle pana kiccato samucchedavivekanissitaṃ, ārammaṇato nissaraṇavivekanissitaṃ sammādiṭṭhiṃ bhāveti. Esa nayo virāganissitādīsu. Vivekatthā eva hi virāgādayo ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kevalañcettha vossaggo duvidho pariccāgavossaggo ca pakkhandanavossaggo cāti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariccāgavossaggo"
      },
      "ti vipassanākkhaṇe ca tadaṅgavasena, maggakkhaṇe ca samucchedavasena kilesappahānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakkhandanavossaggo"
      },
      "ti vipassanākkhaṇe tanninnabhāvena, maggakkhaṇe pana ārammaṇakaraṇena nibbānapakkhandanaṃ, tadubhayampi imasmiṃ lokiyalokuttaramissake ",
      " atthavaṇṇanānaye ",
      " vaṭṭati. Tathā hi ayaṃ sammādiṭṭhi yathāvuttena pakārena kilese ca pariccajati, nibbānañca pakkhandati."
    ],
    "innerText": "Kevalañcettha vossaggo duvidho pariccāgavossaggo ca pakkhandanavossaggo cāti. Tattha pariccāgavossaggoti vipassanākkhaṇe ca tadaṅgavasena, maggakkhaṇe ca samucchedavasena kilesappahānaṃ. Pakkhandanavossaggoti vipassanākkhaṇe tanninnabhāvena, maggakkhaṇe pana ārammaṇakaraṇena nibbānapakkhandanaṃ, tadubhayampi imasmiṃ lokiyalokuttaramissake atthavaṇṇanānaye vaṭṭati. Tathā hi ayaṃ sammādiṭṭhi yathāvuttena pakārena kilese ca pariccajati, nibbānañca pakkhandati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vossaggapariṇāmi"
      },
      "nti iminā pana sakalena vacanena vossaggatthaṃ pariṇamantaṃ pariṇatañca, paripaccantaṃ paripakkañcāti idaṃ vuttaṃ hoti. Ayañhi ariyamaggabhāvanānuyutto bhikkhu yathā sammādiṭṭhi kilesapariccāgavossaggatthaṃ nibbānapakkhandanavossaggatthañca paripaccati, yathā ca paripakkā hoti, tathā naṃ bhāvetīti. Esa nayo sesamaggaṅgesu."
    ],
    "innerText": "Vossaggapariṇāminti iminā pana sakalena vacanena vossaggatthaṃ pariṇamantaṃ pariṇatañca, paripaccantaṃ paripakkañcāti idaṃ vuttaṃ hoti. Ayañhi ariyamaggabhāvanānuyutto bhikkhu yathā sammādiṭṭhi kilesapariccāgavossaggatthaṃ nibbānapakkhandanavossaggatthañca paripaccati, yathā ca paripakkā hoti, tathā naṃ bhāvetīti. Esa nayo sesamaggaṅgesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āgammā"
      },
      "ti ārabbha sandhāya paṭicca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jātidhammā"
      },
      "ti jātisabhāvā jātipakatikā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      "ti yasmā sakalo ariyamaggopi kalyāṇamittaṃ nissāya labbhati, tasmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Handā"
      },
      "ti vavassaggatthe nipāto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appamādaṃ pasaṃsantī"
      },
      "ti appamādaṃ vaṇṇayanti, tasmā appamādo kātabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthābhisamayā"
      },
      "ti atthapaṭilābhā. Aṭṭhamaṃ."
    ],
    "innerText": "Āgammāti ārabbha sandhāya paṭicca. Jātidhammāti jātisabhāvā jātipakatikā. Tasmāti yasmā sakalo ariyamaggopi kalyāṇamittaṃ nissāya labbhati, tasmā. Handāti vavassaggatthe nipāto. Appamādaṃ pasaṃsantīti appamādaṃ vaṇṇayanti, tasmā appamādo kātabbo. Atthābhisamayāti atthapaṭilābhā. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Paṭhamaaputtakasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "130"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "divā divassā"
      },
      "ti divasassa divā, majjhanhikasamayeti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāpateyya"
      },
      "nti dhanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ko pana vādo rūpiyassā"
      },
      "ti suvaṇṇarajatatambalohakāḷalohaphālakacchapakādibhedassa ghanakatassa ceva paribhogabhājanādibhedassa ca rūpiyabhaṇḍassa pana ko vādo? ‘‘Ettakaṃ nāmā’’ti kā paricchedakathāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṇājaka"
      },
      "nti sakuṇḍakabhattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bilaṅgadutiya"
      },
      "nti kañjikadutiyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāṇa"
      },
      "nti sāṇavākamayaṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tipakkhavasana"
      },
      "nti tīṇi khaṇḍāni dvīsu ṭhānesu sibbitvā katanivāsanaṃ."
    ],
    "innerText": "130. Navame divā divassāti divasassa divā, majjhanhikasamayeti attho. Sāpateyyanti dhanaṃ. Ko pana vādo rūpiyassāti suvaṇṇarajatatambalohakāḷalohaphālakacchapakādibhedassa ghanakatassa ceva paribhogabhājanādibhedassa ca rūpiyabhaṇḍassa pana ko vādo? ‘‘Ettakaṃ nāmā’’ti kā paricchedakathāti attho. Kaṇājakanti sakuṇḍakabhattaṃ. Bilaṅgadutiyanti kañjikadutiyaṃ. Sāṇanti sāṇavākamayaṃ . Tipakkhavasananti tīṇi khaṇḍāni dvīsu ṭhānesu sibbitvā katanivāsanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asappuriso"
      },
      "ti lāmakapuriso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddhaggika"
      },
      "ntiādīsu uparūparibhūmīsu phaladānavasena uddhaṃ aggamassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddhaggikā"
      },
      ". Saggassa hitā tatrupapattijananatoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sovaggikā"
      },
      ". Nibbattaṭṭhānesu sukho vipāko assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhavipākā"
      },
      ". Suṭṭhu aggānaṃ dibbavaṇṇādīnaṃ visesānaṃ nibbattanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saggasaṃvattanikā"
      },
      ". Evarūpaṃ dakkhiṇadānaṃ na patiṭṭhāpetīti."
    ],
    "innerText": "Asappurisoti lāmakapuriso. Uddhaggikantiādīsu uparūparibhūmīsu phaladānavasena uddhaṃ aggamassāti uddhaggikā. Saggassa hitā tatrupapattijananatoti sovaggikā. Nibbattaṭṭhānesu sukho vipāko assāti sukhavipākā. Suṭṭhu aggānaṃ dibbavaṇṇādīnaṃ visesānaṃ nibbattanato saggasaṃvattanikā. Evarūpaṃ dakkhiṇadānaṃ na patiṭṭhāpetīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sātodakā"
      },
      "ti madhurodakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Settodakā"
      },
      "ti vīcīnaṃ bhinnaṭṭhāne udakassa setatāya setodakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Supatitthā"
      },
      "ti ",
      " sundaratitthā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ jano"
      },
      "ti ",
      " yena udakena sātodakā, taṃ udakaṃ jano bhājanāni pūretvā neva hareyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na yathāpaccayaṃ vā kareyyā"
      },
      "ti, yaṃ yaṃ udakena udakakiccaṃ kātabbaṃ, taṃ taṃ na kareyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadapeyyamāna"
      },
      "nti taṃ apeyyamānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiccakaro ca hotī"
      },
      "ti attanā kattabbakiccakaro ceva kusalakiccakaro ca, bhuñjati ca, kammante ca payojeti, dānañca detīti attho. Navamaṃ."
    ],
    "innerText": "Sātodakāti madhurodakā. Settodakāti vīcīnaṃ bhinnaṭṭhāne udakassa setatāya setodakā. Supatitthāti sundaratitthā. Taṃ janoti yena udakena sātodakā, taṃ udakaṃ jano bhājanāni pūretvā neva hareyya. Na yathāpaccayaṃ vā kareyyāti, yaṃ yaṃ udakena udakakiccaṃ kātabbaṃ, taṃ taṃ na kareyya. Tadapeyyamānanti taṃ apeyyamānaṃ. Kiccakaro ca hotīti attanā kattabbakiccakaro ceva kusalakiccakaro ca, bhuñjati ca, kammante ca payojeti, dānañca detīti attho. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Dutiyaaputtakasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "131"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "piṇḍapātena paṭipādesī"
      },
      "ti piṇḍapātena saddhiṃ saṃyojesi, piṇḍapātaṃ adāsīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakkāmī"
      },
      "ti kenacideva rājupaṭṭhānādinā kiccena gato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchā vippaṭisārī ahosī"
      },
      "ti so kira aññesupi divasesu taṃ paccekasambuddhaṃ passati, dātuṃ panassa cittaṃ na uppajjati. Tasmiṃ pana divase ayaṃ padumavatideviyā tatiyaputto taggarasikhī paccekabuddho gandhamādanapabbate phalasamāpattisukhena vītināmetvā pubbaṇhasamaye vuṭṭhāya anotattadahe mukhaṃ dhovitvā manosilātale nivāsetvā kāyabandhanaṃ bandhitvā pattacīvaramādāya abhiññāpādakaṃ catutthajjhānaṃ samāpajjitvā iddhiyā vehāsaṃ abbhuggantvā nagaradvāre oruyha cīvaraṃ pārupitvā pattamādāya nagaravāsīnaṃ gharadvāresu sahassabhaṇḍikaṃ ṭhapento viya pāsādikehi abhikkantādīhi anupubbena seṭṭhino gharadvāraṃ sampatto. Taṃdivasañca ",
      " seṭṭhi pātova uṭṭhāya paṇītabhojanaṃ bhuñjitvā, gharadvārakoṭṭhake āsanaṃ paññāpetvā, dantantarāni sodhento nisinno hoti. So paccekabuddhaṃ disvā, taṃdivasaṃ pāto bhutvā nisinnattā dānacittaṃ uppādetvā, bhariyaṃ pakkosāpetvā, ‘‘imassa samaṇassa piṇḍapātaṃ dehī’’ti vatvā pakkāmi."
    ],
    "innerText": "131. Dasame piṇḍapātena paṭipādesīti piṇḍapātena saddhiṃ saṃyojesi, piṇḍapātaṃ adāsīti attho. Pakkāmīti kenacideva rājupaṭṭhānādinā kiccena gato. Pacchā vippaṭisārī ahosīti so kira aññesupi divasesu taṃ paccekasambuddhaṃ passati, dātuṃ panassa cittaṃ na uppajjati. Tasmiṃ pana divase ayaṃ padumavatideviyā tatiyaputto taggarasikhī paccekabuddho gandhamādanapabbate phalasamāpattisukhena vītināmetvā pubbaṇhasamaye vuṭṭhāya anotattadahe mukhaṃ dhovitvā manosilātale nivāsetvā kāyabandhanaṃ bandhitvā pattacīvaramādāya abhiññāpādakaṃ catutthajjhānaṃ samāpajjitvā iddhiyā vehāsaṃ abbhuggantvā nagaradvāre oruyha cīvaraṃ pārupitvā pattamādāya nagaravāsīnaṃ gharadvāresu sahassabhaṇḍikaṃ ṭhapento viya pāsādikehi abhikkantādīhi anupubbena seṭṭhino gharadvāraṃ sampatto. Taṃdivasañca seṭṭhi pātova uṭṭhāya paṇītabhojanaṃ bhuñjitvā, gharadvārakoṭṭhake āsanaṃ paññāpetvā, dantantarāni sodhento nisinno hoti. So paccekabuddhaṃ disvā, taṃdivasaṃ pāto bhutvā nisinnattā dānacittaṃ uppādetvā, bhariyaṃ pakkosāpetvā, ‘‘imassa samaṇassa piṇḍapātaṃ dehī’’ti vatvā pakkāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Seṭṭhibhariyā cintesi – ‘‘mayā ettakena kālena imassa ‘dethā’ti vacanaṃ na sutapubbaṃ, dāpentopi ca ajja na yassa vā tassa vā dāpeti, vītarāgadosamohassa vantakilesassa ohitabhārassa paccekabuddhassa dāpeti, yaṃ vā taṃ vā adatvā paṇītaṃ piṇḍapātaṃ dassāmī’’ti, gharā nikkhamma paccekabuddhaṃ pañcapatiṭṭhitena vanditvā pattaṃ ādāya antonivesane paññattāsane nisīdāpetvā suparisuddhehi sālitaṇḍulehi bhattaṃ sampādetvā tadanurūpaṃ khādanīyaṃ byañjanaṃ supeyyañca sallakkhetvā pattaṃ pūretvā bahi gandhehi samalaṅkaritvā paccekabuddhassa hatthesu ",
      " patiṭṭhapetvā vandi. Paccekabuddho – ‘‘aññesampi paccekabuddhānaṃ saṅgahaṃ karissāmī’’ti ",
      " aparibhuñjitvāva anumodanaṃ katvā pakkāmi. Sopi kho seṭṭhi bāhirato āgacchanto paccekabuddhaṃ disvā mayaṃ ‘‘tumhākaṃ piṇḍapātaṃ dethā’’ti vatvā pakkantā, api vo laddhoti? Āma, seṭṭhi laddhoti. ‘‘Passāmī’’ti gīvaṃ ukkhipitvā olokesi. Athassa piṇḍapātagandho uṭṭhahitvā nāsāpuṭaṃ pahari. So cittaṃ saṃyametuṃ asakkonto pacchā vippaṭisārī āhosīti."
    ],
    "innerText": "Seṭṭhibhariyā cintesi – ‘‘mayā ettakena kālena imassa ‘dethā’ti vacanaṃ na sutapubbaṃ, dāpentopi ca ajja na yassa vā tassa vā dāpeti, vītarāgadosamohassa vantakilesassa ohitabhārassa paccekabuddhassa dāpeti, yaṃ vā taṃ vā adatvā paṇītaṃ piṇḍapātaṃ dassāmī’’ti, gharā nikkhamma paccekabuddhaṃ pañcapatiṭṭhitena vanditvā pattaṃ ādāya antonivesane paññattāsane nisīdāpetvā suparisuddhehi sālitaṇḍulehi bhattaṃ sampādetvā tadanurūpaṃ khādanīyaṃ byañjanaṃ supeyyañca sallakkhetvā pattaṃ pūretvā bahi gandhehi samalaṅkaritvā paccekabuddhassa hatthesu patiṭṭhapetvā vandi. Paccekabuddho – ‘‘aññesampi paccekabuddhānaṃ saṅgahaṃ karissāmī’’ti aparibhuñjitvāva anumodanaṃ katvā pakkāmi. Sopi kho seṭṭhi bāhirato āgacchanto paccekabuddhaṃ disvā mayaṃ ‘‘tumhākaṃ piṇḍapātaṃ dethā’’ti vatvā pakkantā, api vo laddhoti? Āma, seṭṭhi laddhoti. ‘‘Passāmī’’ti gīvaṃ ukkhipitvā olokesi. Athassa piṇḍapātagandho uṭṭhahitvā nāsāpuṭaṃ pahari. So cittaṃ saṃyametuṃ asakkonto pacchā vippaṭisārī āhosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Varameta"
      },
      "ntiādi vippaṭisārassa uppannākāradassanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhātu ca pana ekaputtakaṃ sāpateyyassa kāraṇā jīvitā voropesī"
      },
      "ti tadā kirassa avibhatteyeva kuṭumbe mātāpitaro ca jeṭṭhabhātā ca kālamakaṃsu. So bhātujāyāya saddhiṃyeva saṃvāsaṃ kappesi. Bhātu panassa eko putto hoti, taṃ vīthiyā kīḷantaṃ manussā vadanti – ‘‘ayaṃ dāso ayaṃ dāsī idaṃ yānaṃ idaṃ dhanaṃ tava santaka’’nti. So tesaṃ kathaṃ gahetvā – ‘‘ayaṃ dāso mayhaṃ santaka’’ntiādīni katheti."
    ],
    "innerText": "Varametantiādi vippaṭisārassa uppannākāradassanaṃ. Bhātu ca pana ekaputtakaṃ sāpateyyassa kāraṇā jīvitā voropesīti tadā kirassa avibhatteyeva kuṭumbe mātāpitaro ca jeṭṭhabhātā ca kālamakaṃsu. So bhātujāyāya saddhiṃyeva saṃvāsaṃ kappesi. Bhātu panassa eko putto hoti, taṃ vīthiyā kīḷantaṃ manussā vadanti – ‘‘ayaṃ dāso ayaṃ dāsī idaṃ yānaṃ idaṃ dhanaṃ tava santaka’’nti. So tesaṃ kathaṃ gahetvā – ‘‘ayaṃ dāso mayhaṃ santaka’’ntiādīni katheti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassa cūḷapitā cintesi – ‘‘ayaṃ dārako idāneva evaṃ kathesi, mahallakakāle kuṭumbaṃ majjhe bhindāpeyya, idānevassa kattabbaṃ karissāmī’’ti ekadivasaṃ vāsiṃ ādāya – ‘‘ehi putta, araññaṃ gacchāmā’’ti taṃ araññaṃ netvā viravantaṃ viravantaṃ māretvā āvāṭe ",
      " pakkhipitvā paṃsunā paṭicchādesi. Idaṃ sandhāyetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattakkhattu"
      },
      "nti sattavāre. Pubbapacchimacetanāvasena cettha attho veditabbo. Ekapiṇḍapātadānasmiñhi ekāva cetanā dve paṭisandhiyo na deti, pubbapacchimacetanāhi panesa sattakkhattuṃ sagge, sattakkhattuṃ seṭṭhikule nibbatto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purāṇa"
      },
      "nti paccekasambuddhassa dinnapiṇḍapātacetanākammaṃ."
    ],
    "innerText": "Athassa cūḷapitā cintesi – ‘‘ayaṃ dārako idāneva evaṃ kathesi, mahallakakāle kuṭumbaṃ majjhe bhindāpeyya, idānevassa kattabbaṃ karissāmī’’ti ekadivasaṃ vāsiṃ ādāya – ‘‘ehi putta, araññaṃ gacchāmā’’ti taṃ araññaṃ netvā viravantaṃ viravantaṃ māretvā āvāṭe pakkhipitvā paṃsunā paṭicchādesi. Idaṃ sandhāyetaṃ vuttaṃ. Sattakkhattunti sattavāre. Pubbapacchimacetanāvasena cettha attho veditabbo. Ekapiṇḍapātadānasmiñhi ekāva cetanā dve paṭisandhiyo na deti, pubbapacchimacetanāhi panesa sattakkhattuṃ sagge, sattakkhattuṃ seṭṭhikule nibbatto. Purāṇanti paccekasambuddhassa dinnapiṇḍapātacetanākammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariggaha"
      },
      "nti pariggahitavatthu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anujīvino"
      },
      "ti ekaṃ mahākulaṃ nissāya paṇṇāsampi saṭṭhipi kulāni jīvanti, te manusse sandhāyetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaṃ nādāya gantabba"
      },
      "nti sabbametaṃ na ādiyitvā gantabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaṃ nikkhippagāmina"
      },
      "nti sabbametaṃ nikkhippasabhāvaṃ, pariccajitabbasabhāvamevāti attho. Dasamaṃ."
    ],
    "innerText": "Pariggahanti pariggahitavatthu. Anujīvinoti ekaṃ mahākulaṃ nissāya paṇṇāsampi saṭṭhipi kulāni jīvanti, te manusse sandhāyetaṃ vuttaṃ. Sabbaṃ nādāya gantabbanti sabbametaṃ na ādiyitvā gantabbaṃ. Sabbaṃ nikkhippagāminanti sabbametaṃ nikkhippasabhāvaṃ, pariccajitabbasabhāvamevāti attho. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyo vaggo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Tatiyavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Puggalasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "132"
      },
      ". Tatiyavaggassa ",
      " paṭhame ‘‘nīce kule paccājāto’’tiādikena tamena yuttoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tamo"
      },
      ". Kāyaduccaritādīhi puna nirayatamūpagamanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tamaparāyaṇo"
      },
      ". Iti ubhayenapi khandhatamova kathito hoti. ‘‘Ucce kule paccājāto’’tiādikena jotinā yuttato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "joti,"
      },
      " ālokībhūtoti vuttaṃ hoti. Kāyasucaritādīhi puna saggūpapattijotibhāvūpagamanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jotiparāyaṇo"
      },
      ". Iminā nayena itarepi dve veditabbā."
    ],
    "innerText": "132. Tatiyavaggassa paṭhame ‘‘nīce kule paccājāto’’tiādikena tamena yuttoti tamo. Kāyaduccaritādīhi puna nirayatamūpagamanato tamaparāyaṇo. Iti ubhayenapi khandhatamova kathito hoti. ‘‘Ucce kule paccājāto’’tiādikena jotinā yuttato joti, ālokībhūtoti vuttaṃ hoti. Kāyasucaritādīhi puna saggūpapattijotibhāvūpagamanato jotiparāyaṇo. Iminā nayena itarepi dve veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Venakule"
      },
      "ti vilīvakārakule. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nesādakule"
      },
      "ti migaluddakādīnaṃ kule. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rathakārakule"
      },
      "ti cammakārakule. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pukkusakule"
      },
      "ti pupphachaḍḍakakule. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kasiravuttike"
      },
      "ti dukkhavuttike. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dubbaṇṇo"
      },
      "ti paṃsupisācako viya jhāmakhāṇuvaṇṇo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duddasiko"
      },
      "ti vijātamātuyāpi amanāpadassano ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Okoṭimako"
      },
      "ti lakuṇḍako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāṇo"
      },
      "ti ekakkhikāṇo vā ubhayakkhikāṇo vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kuṇī"
      },
      "ti ekahatthakuṇī vā ubhayahatthakuṇī vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khañjo"
      },
      "ti ekapādakhañjo vā ubhayapādakhañjo vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakkhahato"
      },
      "ti hatapakkho pīṭhasappī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padīpeyyassā"
      },
      "ti telakapallakādino padīpaupakaraṇassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ kho, mahārājā"
      },
      "ti ettha eko puggalo bahiddhā ālokaṃ adisvā mātukucchismiṃyeva kālaṃ katvā apāyesu nibbattanto sakalaṃ kappampi saṃsarati, sopi tamotamaparāyaṇova. So pana kuhakapuggalo bhaveyya. Kuhakassa hi evarūpā nibbatti hotīti vuttaṃ."
    ],
    "innerText": "Venakuleti vilīvakārakule. Nesādakuleti migaluddakādīnaṃ kule. Rathakārakuleti cammakārakule. Pukkusakuleti pupphachaḍḍakakule. Kasiravuttiketi dukkhavuttike. Dubbaṇṇoti paṃsupisācako viya jhāmakhāṇuvaṇṇo. Duddasikoti vijātamātuyāpi amanāpadassano . Okoṭimakoti lakuṇḍako. Kāṇoti ekakkhikāṇo vā ubhayakkhikāṇo vā. Kuṇīti ekahatthakuṇī vā ubhayahatthakuṇī vā. Khañjoti ekapādakhañjo vā ubhayapādakhañjo vā. Pakkhahatoti hatapakkho pīṭhasappī. Padīpeyyassāti telakapallakādino padīpaupakaraṇassa. Evaṃ kho, mahārājāti ettha eko puggalo bahiddhā ālokaṃ adisvā mātukucchismiṃyeva kālaṃ katvā apāyesu nibbattanto sakalaṃ kappampi saṃsarati, sopi tamotamaparāyaṇova. So pana kuhakapuggalo bhaveyya. Kuhakassa hi evarūpā nibbatti hotīti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca ‘‘nīce kule paccājāto hoti caṇḍālakule vā’’tiādīhi āgamanavipatti ceva pubbuppannapaccayavipatti ca dassitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dalidde"
      },
      "tiādīhi pavattapaccayavipatti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kasiravuttike"
      },
      "tiādīhi ājīvupāyavipatti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dubbaṇṇo"
      },
      "tiādīhi ",
      " attabhāvavipatti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bavhābādho"
      },
      "tiādīhi dukkhakāraṇasamāyogo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na lābhī"
      },
      "tiādīhi sukhakāraṇavipatti ceva upabhogavipatti ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyena duccarita"
      },
      "ntiādīhi tamaparāyaṇabhāvassa kāraṇasamāyogo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyassa bhedā"
      },
      "tiādīhi samparāyikatamūpagamo. Sukkapakkho vuttapaṭipakkhanayena veditabbo."
    ],
    "innerText": "Ettha ca ‘‘nīce kule paccājāto hoti caṇḍālakule vā’’tiādīhi āgamanavipatti ceva pubbuppannapaccayavipatti ca dassitā. Daliddetiādīhi pavattapaccayavipatti. Kasiravuttiketiādīhi ājīvupāyavipatti. Dubbaṇṇotiādīhi attabhāvavipatti. Bavhābādhotiādīhi dukkhakāraṇasamāyogo. Na lābhītiādīhi sukhakāraṇavipatti ceva upabhogavipatti ca. Kāyena duccaritantiādīhi tamaparāyaṇabhāvassa kāraṇasamāyogo. Kāyassa bhedātiādīhi samparāyikatamūpagamo. Sukkapakkho vuttapaṭipakkhanayena veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akkosatī"
      },
      "ti ",
      " dasahi akkosavatthūhi akkosati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paribhāsatī"
      },
      "ti, ‘‘kasmā tiṭṭhatha? Kiṃ tumhehi amhākaṃ kasikammādīni katānī’’tiādīhi? Paribhavavacanehi paribhāsati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rosako"
      },
      "ti ghaṭṭako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abyaggamanaso"
      },
      "ti ekaggacitto. Paṭhamaṃ."
    ],
    "innerText": "Akkosatīti dasahi akkosavatthūhi akkosati. Paribhāsatīti, ‘‘kasmā tiṭṭhatha? Kiṃ tumhehi amhākaṃ kasikammādīni katānī’’tiādīhi? Paribhavavacanehi paribhāsati. Rosakoti ghaṭṭako. Abyaggamanasoti ekaggacitto. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Ayyikāsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "133"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jiṇṇā"
      },
      "ti jarājiṇṇā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuḍḍhā"
      },
      "ti vayovuḍḍhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahallikā"
      },
      "ti jātimahallikā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Addhagatā"
      },
      "ti addhaṃ cirakālaṃ atikkantā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vayoanuppattā"
      },
      "ti pacchimavayaṃ sampattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piyā manāpā"
      },
      "ti rañño kira mātari matāya ayyikā mātuṭṭhāne ṭhatvā paṭijaggi, tenassa ayyikāya balavapemaṃ uppajji. Tasmā evamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hatthiratanenā"
      },
      "ti ",
      " satasahassagghanako hatthī satasahassagghanakena alaṅkārena alaṅkato hatthiratanaṃ nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assaratanepi"
      },
      " eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gāmavaro"
      },
      "pi satasahassuṭṭhānakagāmova. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbāni tāni bhedanadhammānī"
      },
      "ti tesu hi kiñci kariyamānameva bhijjati, kiñci katapariyositaṃ cakkato anapanītameva, kiñci apanetvā bhūmiyaṃ ṭhapitamattaṃ, kiñci tato paraṃ, evameva sattesupi koci paṭisandhiṃ gahetvā marati, koci mūḷhagabbhāya mātari mātukucchito anikkhantova, koci nikkhantamatto, koci tato paranti. Tasmā evamāha. Dutiyaṃ."
    ],
    "innerText": "133. Dutiye jiṇṇāti jarājiṇṇā. Vuḍḍhāti vayovuḍḍhā. Mahallikāti jātimahallikā. Addhagatāti addhaṃ cirakālaṃ atikkantā. Vayoanuppattāti pacchimavayaṃ sampattā. Piyā manāpāti rañño kira mātari matāya ayyikā mātuṭṭhāne ṭhatvā paṭijaggi, tenassa ayyikāya balavapemaṃ uppajji. Tasmā evamāha. Hatthiratanenāti satasahassagghanako hatthī satasahassagghanakena alaṅkārena alaṅkato hatthiratanaṃ nāma. Assaratanepi eseva nayo. Gāmavaropi satasahassuṭṭhānakagāmova. Sabbāni tāni bhedanadhammānīti tesu hi kiñci kariyamānameva bhijjati, kiñci katapariyositaṃ cakkato anapanītameva, kiñci apanetvā bhūmiyaṃ ṭhapitamattaṃ, kiñci tato paraṃ, evameva sattesupi koci paṭisandhiṃ gahetvā marati, koci mūḷhagabbhāya mātari mātukucchito anikkhantova, koci nikkhantamatto, koci tato paranti. Tasmā evamāha. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "134"
      },
      ". Tatiye sabbaṃ uttānameva. Tatiyaṃ."
    ],
    "innerText": "134. Tatiye sabbaṃ uttānameva. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Issattasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "135"
      },
      ". Catutthassa aṭṭhuppattiko nikkhepo. Bhagavato kira paṭhamabodhiyaṃ mahālābhasakkāro udapādi bhikkhusaṅghassa ca. Titthiyā hatalābhasakkārā hutvā kulesu evaṃ kanthentā vicaranti – ‘‘samaṇo gotamo ",
      " evamāha, ‘mayhameva dānaṃ dātabbaṃ, na aññesaṃ dānaṃ dātabbaṃ. Mayhameva sāvakānaṃ dānaṃ dātabbaṃ, na aññesaṃ sāvakānaṃ dānaṃ dātabbaṃ. Mayhameva dinnaṃ mahapphalaṃ, na aññesaṃ dinnaṃ mahapphalaṃ. Mayhameva sāvakānaṃ dinnaṃ mahapphalaṃ, na aññesaṃ sāvakānaṃ dinnaṃ mahapphala’nti. Yuttaṃ nu kho sayampi bhikkhācāranissitena paresaṃ bhikkhācāranissitānaṃ catunnaṃ paccayānaṃ antarāyaṃ kātuṃ, ayuttaṃ karoti ananucchavika’’nti. Sā ",
      " kathā pattharamānā rājakulaṃ sampattā. Rājā sutvā cintesi – ‘‘aṭṭhānametaṃ yaṃ tathāgato paresaṃ lābhantarāyaṃ kareyya. Ete tathāgatassa alābhāya ayasāya parisakkanti. Sacāhaṃ idheva ṭhatvā ‘mā evaṃ avocuttha, na satthā evaṃ kathetī’ti vadeyyaṃ, evaṃ sā kathā nijjhattiṃ na gaccheyya, imassa mahājanassa sannipatitakāleyeva naṃ nijjhāpessāmī’’ti ekaṃ chaṇadivasaṃ āgamento tuṇhī ahosi."
    ],
    "innerText": "135. Catutthassa aṭṭhuppattiko nikkhepo. Bhagavato kira paṭhamabodhiyaṃ mahālābhasakkāro udapādi bhikkhusaṅghassa ca. Titthiyā hatalābhasakkārā hutvā kulesu evaṃ kanthentā vicaranti – ‘‘samaṇo gotamo evamāha, ‘mayhameva dānaṃ dātabbaṃ, na aññesaṃ dānaṃ dātabbaṃ. Mayhameva sāvakānaṃ dānaṃ dātabbaṃ, na aññesaṃ sāvakānaṃ dānaṃ dātabbaṃ. Mayhameva dinnaṃ mahapphalaṃ, na aññesaṃ dinnaṃ mahapphalaṃ. Mayhameva sāvakānaṃ dinnaṃ mahapphalaṃ, na aññesaṃ sāvakānaṃ dinnaṃ mahapphala’nti. Yuttaṃ nu kho sayampi bhikkhācāranissitena paresaṃ bhikkhācāranissitānaṃ catunnaṃ paccayānaṃ antarāyaṃ kātuṃ, ayuttaṃ karoti ananucchavika’’nti. Sā kathā pattharamānā rājakulaṃ sampattā. Rājā sutvā cintesi – ‘‘aṭṭhānametaṃ yaṃ tathāgato paresaṃ lābhantarāyaṃ kareyya. Ete tathāgatassa alābhāya ayasāya parisakkanti. Sacāhaṃ idheva ṭhatvā ‘mā evaṃ avocuttha, na satthā evaṃ kathetī’ti vadeyyaṃ, evaṃ sā kathā nijjhattiṃ na gaccheyya, imassa mahājanassa sannipatitakāleyeva naṃ nijjhāpessāmī’’ti ekaṃ chaṇadivasaṃ āgamento tuṇhī ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparena ",
      " samayena mahāchaṇe sampatte ‘‘ayaṃ imassa kālo’’ti nagare bheriṃ carāpesi – ‘‘saddhā vā assaddhā vā sammādiṭṭhikā vā micchādiṭṭhikā vā geharakkhake dārake vā mātugāme vā ṭhapetvā avasesā ye vihāraṃ nāgacchanti, paññāsaṃ daṇḍo’’ti. Sayampi pātova nhatvā katapātarāso sabbābharaṇapaṭimaṇḍito mahatā balakāyena saddhiṃ vihāraṃ agamāsi. Gacchanto ca cintesi – ‘‘bhagavā tumhe kira evaṃ vadatha ‘mayhameva dānaṃ dātabbaṃ…pe… na aññesaṃ sāvakānaṃ dinnaṃ mahapphala’nti evaṃ pucchituṃ ayuttaṃ, pañhameva pucchissāmi, pañhaṃ kathento ca me bhagavā avasāne titthiyānaṃ vādaṃ bhañjissatī’’ti. So pañhaṃ pucchanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kattha nu kho, bhante, dānaṃ dātabba"
      },
      "nti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yatthā"
      },
      "ti yasmiṃ puggale cittaṃ pasīdati, tasmiṃ dātabbaṃ, tassa vā dātabbanti attho."
    ],
    "innerText": "Aparena samayena mahāchaṇe sampatte ‘‘ayaṃ imassa kālo’’ti nagare bheriṃ carāpesi – ‘‘saddhā vā assaddhā vā sammādiṭṭhikā vā micchādiṭṭhikā vā geharakkhake dārake vā mātugāme vā ṭhapetvā avasesā ye vihāraṃ nāgacchanti, paññāsaṃ daṇḍo’’ti. Sayampi pātova nhatvā katapātarāso sabbābharaṇapaṭimaṇḍito mahatā balakāyena saddhiṃ vihāraṃ agamāsi. Gacchanto ca cintesi – ‘‘bhagavā tumhe kira evaṃ vadatha ‘mayhameva dānaṃ dātabbaṃ…pe… na aññesaṃ sāvakānaṃ dinnaṃ mahapphala’nti evaṃ pucchituṃ ayuttaṃ, pañhameva pucchissāmi, pañhaṃ kathento ca me bhagavā avasāne titthiyānaṃ vādaṃ bhañjissatī’’ti. So pañhaṃ pucchanto kattha nu kho, bhante, dānaṃ dātabbanti āha. Yatthāti yasmiṃ puggale cittaṃ pasīdati, tasmiṃ dātabbaṃ, tassa vā dātabbanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vutte rājā yehi manussehi titthiyānaṃ vacanaṃ ārocitaṃ, te olokesi. Te raññā olokitamattāva maṅkubhūtā adhomukhā pādaṅguṭṭhakena bhūmiṃ lekhamānā aṭṭhaṃsu. Rājā – ‘‘ekapadeneva, bhante, hatā titthiyā’’ti mahājanaṃ sāvento mahāsaddena abhāsi. Evañca pana bhāsitvā – ‘‘bhagavā cittaṃ nāma nigaṇṭhācelakaparibbājakādīsu yattha katthaci pasīdati ",
      ", kattha pana, bhante, dinnaṃ mahapphala’’nti pucchi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññaṃ kho eta"
      },
      "nti, ‘‘mahārāja, aññaṃ tayā paṭhamaṃ pucchitaṃ, aññaṃ pacchā, sallakkhehi etaṃ, pañhākathanaṃ pana mayhaṃ bhāro’’ti vatvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīlavato kho"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "idha tyassā"
      },
      "ti idha te assa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samupabyūḷho"
      },
      "ti rāsibhūto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asikkhito"
      },
      "ti dhanusippe asikkhito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akatahattho"
      },
      "ti muṭṭhibandhādivasena asampāditahattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akatayoggo"
      },
      "ti tiṇapuñjamattikāpuñjādīsu akataparicayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akatūpāsano"
      },
      "ti rājarājamahāmattānaṃ adassitasarakkhepo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chambhī"
      },
      "ti pavedhitakāyo."
    ],
    "innerText": "Evaṃ vutte rājā yehi manussehi titthiyānaṃ vacanaṃ ārocitaṃ, te olokesi. Te raññā olokitamattāva maṅkubhūtā adhomukhā pādaṅguṭṭhakena bhūmiṃ lekhamānā aṭṭhaṃsu. Rājā – ‘‘ekapadeneva, bhante, hatā titthiyā’’ti mahājanaṃ sāvento mahāsaddena abhāsi. Evañca pana bhāsitvā – ‘‘bhagavā cittaṃ nāma nigaṇṭhācelakaparibbājakādīsu yattha katthaci pasīdati , kattha pana, bhante, dinnaṃ mahapphala’’nti pucchi. Aññaṃ kho etanti, ‘‘mahārāja, aññaṃ tayā paṭhamaṃ pucchitaṃ, aññaṃ pacchā, sallakkhehi etaṃ, pañhākathanaṃ pana mayhaṃ bhāro’’ti vatvā sīlavato khotiādimāha. Tattha idha tyassāti idha te assa. Samupabyūḷhoti rāsibhūto. Asikkhitoti dhanusippe asikkhito. Akatahatthoti muṭṭhibandhādivasena asampāditahattho. Akatayoggoti tiṇapuñjamattikāpuñjādīsu akataparicayo. Akatūpāsanoti rājarājamahāmattānaṃ adassitasarakkhepo. Chambhīti pavedhitakāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmacchando pahīno"
      },
      "tiādīsu arahattamaggena kāmacchando pahīno hoti, anāgāmimaggena byāpādo ",
      ", arahattamaggeneva thinamiddhaṃ, tathā uddhaccaṃ, tatiyeneva kukkuccaṃ, paṭhamamaggena vicikicchā pahīnā hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asekkhena"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīlakkhandhenā"
      },
      "ti asekkhassa sīlakkhandho asekkho sīlakkhandho nāma. Esa nayo sabbattha. Ettha ca purimehi catūhi padehi lokiyalokuttarasīlasamādhipaññāvimuttiyo kathitā. Vimuttiñāṇadassanaṃ paccavekkhaṇañāṇaṃ hoti, taṃ lokiyameva."
    ],
    "innerText": "Kāmacchando pahīnotiādīsu arahattamaggena kāmacchando pahīno hoti, anāgāmimaggena byāpādo , arahattamaggeneva thinamiddhaṃ, tathā uddhaccaṃ, tatiyeneva kukkuccaṃ, paṭhamamaggena vicikicchā pahīnā hoti. Asekkhenasīlakkhandhenāti asekkhassa sīlakkhandho asekkho sīlakkhandho nāma. Esa nayo sabbattha. Ettha ca purimehi catūhi padehi lokiyalokuttarasīlasamādhipaññāvimuttiyo kathitā. Vimuttiñāṇadassanaṃ paccavekkhaṇañāṇaṃ hoti, taṃ lokiyameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Issatta"
      },
      "nti ususippaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Balavīriya"
      },
      "nti ettha balaṃ nāma vāyodhātu, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vīriyaṃ"
      },
      " kāyikacetasikavīriyameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhare"
      },
      "ti bhareyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāsūraṃ jātipaccayā"
      },
      "ti, ‘‘ayaṃ jātisampanno’’ti evaṃ jātikāraṇā asūraṃ na bhareyya."
    ],
    "innerText": "Issattanti ususippaṃ. Balavīriyanti ettha balaṃ nāma vāyodhātu, vīriyaṃ kāyikacetasikavīriyameva. Bhareti bhareyya. Nāsūraṃ jātipaccayāti, ‘‘ayaṃ jātisampanno’’ti evaṃ jātikāraṇā asūraṃ na bhareyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khantisoracca"
      },
      "nti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khantī"
      },
      "ti adhivāsanakhanti, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "soracca"
      },
      "nti arahattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammā"
      },
      "ti ete dve dhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assame"
      },
      "ti āvasathe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivane"
      },
      "ti araññaṭṭhāne, nirudake araññe caturassapokkharaṇiādīni kārayeti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dugge"
      },
      "ti visamaṭṭhāne. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkamanānī"
      },
      "ti paṇṇāsahatthasaṭṭhihatthāni samokiṇṇaparisuddhavālikāni saṅkamanāni kareyya."
    ],
    "innerText": "Khantisoraccanti ettha khantīti adhivāsanakhanti, soraccanti arahattaṃ. Dhammāti ete dve dhammā. Assameti āvasathe. Vivaneti araññaṭṭhāne, nirudake araññe caturassapokkharaṇiādīni kārayeti attho. Duggeti visamaṭṭhāne. Saṅkamanānīti paṇṇāsahatthasaṭṭhihatthāni samokiṇṇaparisuddhavālikāni saṅkamanāni kareyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni etesu araññasenāsanesu vasantānaṃ bhikkhūnaṃ bhikkhācāravattaṃ ācikkhanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "annaṃ pāna"
      },
      "ntiādimāha. Tattha",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": " senāsanānī"
      },
      "ti mañcapīṭhādīni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vippasannenā"
      },
      "ti khīṇāsavassa dentopi sakaṅkhena kilesamalinena cittena adatvā vippasanneneva cittena dadeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thanaya"
      },
      "nti gajjanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satakkakū"
      },
      "ti satasikharo, anekakūṭoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhisaṅkhaccā"
      },
      "ti abhisaṅkharitvā samodhānetvā rāsiṃ katvā."
    ],
    "innerText": "Idāni etesu araññasenāsanesu vasantānaṃ bhikkhūnaṃ bhikkhācāravattaṃ ācikkhanto annaṃ pānantiādimāha. Tattha senāsanānīti mañcapīṭhādīni. Vippasannenāti khīṇāsavassa dentopi sakaṅkhena kilesamalinena cittena adatvā vippasanneneva cittena dadeyya. Thanayanti gajjanto. Satakkakūti satasikharo, anekakūṭoti attho. Abhisaṅkhaccāti abhisaṅkharitvā samodhānetvā rāsiṃ katvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āmodamāno"
      },
      "ti ",
      " tuṭṭhamānaso hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakiretī"
      },
      "ti dānagge vicirati, pakiranto viya vā dānaṃ deti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puññadhārā"
      },
      "ti anekadānacetanāmayā puññadhārā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dātāraṃ abhivassatī"
      },
      "ti yathā ākāse samuṭṭhitameghato nikkhantā udakadhārā pathaviṃ sinehayantī tementī kiledayantī abhivassati, evameva ayampi dāyakassa abbhantare uppannā puññadhārā tameva dātāraṃ anto sineheti pūreti abhisandeti. Tena vuttaṃ ‘‘dātāraṃ abhivassatī’’ti. Catutthaṃ."
    ],
    "innerText": "Āmodamānoti tuṭṭhamānaso hutvā. Pakiretīti dānagge vicirati, pakiranto viya vā dānaṃ deti. Puññadhārāti anekadānacetanāmayā puññadhārā. Dātāraṃ abhivassatīti yathā ākāse samuṭṭhitameghato nikkhantā udakadhārā pathaviṃ sinehayantī tementī kiledayantī abhivassati, evameva ayampi dāyakassa abbhantare uppannā puññadhārā tameva dātāraṃ anto sineheti pūreti abhisandeti. Tena vuttaṃ ‘‘dātāraṃ abhivassatī’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Pabbatūpamasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "136"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "muddhāvasittāna"
      },
      "nti khattiyābhisekena muddhani avasittānaṃ katābhisekānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmagedhapariyuṭṭhitāna"
      },
      "nti kāmesu gedhena pariyuṭṭhitānaṃ abhibhūtānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Janapadatthāvariyappattāna"
      },
      "nti ",
      " janapade thirabhāvappattānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājakaraṇīyānī"
      },
      "ti rājakammāni rājūhi kattabbakiccāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesu khvāha"
      },
      "nti tesu ahaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Usukkamāpanno"
      },
      "ti byāpāraṃ āpanno. Esa kira rājā divasassa tikkhattuṃ bhagavato upaṭṭhānaṃ gacchati, antarāgamanāni bahūnipi honti. Tassa nibaddhaṃ gacchato balakāyo mahāpi hoti appopi. Athekadivasaṃ pañcasatā corā cintayiṃsu – ‘‘ayaṃ rājā avelāya appena balena samaṇassa gotamassa upaṭṭhānaṃ gacchati, antarāmagge naṃ gahetvā rajjaṃ gaṇhissāmā’’ti. Te andhavane nilīyiṃsu. Rājāno ca nāma mahāpuññā honti. Atha tesaṃyeva abbhantarato eko puriso nikkhamitvā rañño ārocesi. Rājā mahantaṃ balakāyaṃ ādāya andhavanaṃ parivāretvā te sabbe gahetvā andhavanato yāva nagaradvārā maggassa ubhosu passesu yathā aññamaññaṃ cakkhunā cakkhuṃ upanibandhitvā olokenti, evaṃ āsannāni sūlāni ropāpetvā sūlesu uttāsesi. Idaṃ sandhāya evamāha."
    ],
    "innerText": "136. Pañcame muddhāvasittānanti khattiyābhisekena muddhani avasittānaṃ katābhisekānaṃ. Kāmagedhapariyuṭṭhitānanti kāmesu gedhena pariyuṭṭhitānaṃ abhibhūtānaṃ. Janapadatthāvariyappattānanti janapade thirabhāvappattānaṃ. Rājakaraṇīyānīti rājakammāni rājūhi kattabbakiccāni. Tesu khvāhanti tesu ahaṃ. Usukkamāpannoti byāpāraṃ āpanno. Esa kira rājā divasassa tikkhattuṃ bhagavato upaṭṭhānaṃ gacchati, antarāgamanāni bahūnipi honti. Tassa nibaddhaṃ gacchato balakāyo mahāpi hoti appopi. Athekadivasaṃ pañcasatā corā cintayiṃsu – ‘‘ayaṃ rājā avelāya appena balena samaṇassa gotamassa upaṭṭhānaṃ gacchati, antarāmagge naṃ gahetvā rajjaṃ gaṇhissāmā’’ti. Te andhavane nilīyiṃsu. Rājāno ca nāma mahāpuññā honti. Atha tesaṃyeva abbhantarato eko puriso nikkhamitvā rañño ārocesi. Rājā mahantaṃ balakāyaṃ ādāya andhavanaṃ parivāretvā te sabbe gahetvā andhavanato yāva nagaradvārā maggassa ubhosu passesu yathā aññamaññaṃ cakkhunā cakkhuṃ upanibandhitvā olokenti, evaṃ āsannāni sūlāni ropāpetvā sūlesu uttāsesi. Idaṃ sandhāya evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha satthā cintesi – ‘‘sacāhaṃ vakkhāmi, ‘mahārāja, mādise nāma sammāsambuddhe dhuravihāre vasante tayā evarūpaṃ dāruṇaṃ kammaṃ kataṃ, ayuttaṃ te kata’nti, athāyaṃ rājā maṅku hutvā santhambhituṃ na sakkuṇeyya, pariyāyena dhammaṃ kathentasseva me sallakkhessatī’’ti dhammadesanaṃ ārabhanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṃ kiṃ maññasī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddhāyiko"
      },
      "ti saddhātabbo, yassa tvaṃ vacanaṃ saddahasīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccayiko"
      },
      "ti tasseva vevacanaṃ, yassa vacanaṃ pattiyāyasīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abbhasama"
      },
      "nti ākāsasamaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nippothento āgacchatī"
      },
      "ti pathavitalato yāva akaniṭṭhabrahmalokā sabbe satte saṇhakaraṇīyaṃ tiṇacuṇṇaṃ viya karonto pisanto āgacchati."
    ],
    "innerText": "Atha satthā cintesi – ‘‘sacāhaṃ vakkhāmi, ‘mahārāja, mādise nāma sammāsambuddhe dhuravihāre vasante tayā evarūpaṃ dāruṇaṃ kammaṃ kataṃ, ayuttaṃ te kata’nti, athāyaṃ rājā maṅku hutvā santhambhituṃ na sakkuṇeyya, pariyāyena dhammaṃ kathentasseva me sallakkhessatī’’ti dhammadesanaṃ ārabhanto taṃ kiṃ maññasītiādimāha. Tattha saddhāyikoti saddhātabbo, yassa tvaṃ vacanaṃ saddahasīti attho. Paccayikoti tasseva vevacanaṃ, yassa vacanaṃ pattiyāyasīti attho. Abbhasamanti ākāsasamaṃ. Nippothento āgacchatīti pathavitalato yāva akaniṭṭhabrahmalokā sabbe satte saṇhakaraṇīyaṃ tiṇacuṇṇaṃ viya karonto pisanto āgacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññatra dhammacariyāyā"
      },
      "ti ṭhapetvā dhammacariyaṃ aññaṃ kātabbaṃ natthi, dasakusalakammapathasaṅkhātā dhammacariyāva kattabbā, bhanteti – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samacariyā"
      },
      "dīni tasseva vevacanāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārocemī"
      },
      "ti ācikkhāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭivedayāmī"
      },
      "ti jānāpemi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhivattatī"
      },
      "ti ",
      " ajjhottharati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hatthiyuddhānī"
      },
      "ti nāḷāgirisadise hemakappane nāge abhiruyha yujjhitabbayuddhāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gatī"
      },
      "ti nipphatti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visayo"
      },
      "ti okāso, samatthabhāvo vā. Na hi sakkā tehi jarāmaraṇaṃ paṭibāhituṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mantino mahāmattā"
      },
      "ti mantasampannā mahosadhavidhurapaṇḍitādisadisā mahāamaccā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūmigata"
      },
      "nti mahālohakumbhiyo pūretvā bhūmiyaṃ ṭhapitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vehāsaṭṭha"
      },
      "nti cammapasibbake pūretvā tulāsaṅghāṭādīsu laggetvā ceva niyyuhādīsu ca pūretvā ṭhapitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upalāpetu"
      },
      "nti aññamaññaṃ bhindituṃ. Yathā dve janā ekena maggena na gacchanti evaṃ kātuṃ."
    ],
    "innerText": "Aññatra dhammacariyāyāti ṭhapetvā dhammacariyaṃ aññaṃ kātabbaṃ natthi, dasakusalakammapathasaṅkhātā dhammacariyāva kattabbā, bhanteti – samacariyādīni tasseva vevacanāni. Ārocemīti ācikkhāmi. Paṭivedayāmīti jānāpemi. Adhivattatīti ajjhottharati. Hatthiyuddhānīti nāḷāgirisadise hemakappane nāge abhiruyha yujjhitabbayuddhāni. Gatīti nipphatti. Visayoti okāso, samatthabhāvo vā. Na hi sakkā tehi jarāmaraṇaṃ paṭibāhituṃ . Mantino mahāmattāti mantasampannā mahosadhavidhurapaṇḍitādisadisā mahāamaccā. Bhūmigatanti mahālohakumbhiyo pūretvā bhūmiyaṃ ṭhapitaṃ. Vehāsaṭṭhanti cammapasibbake pūretvā tulāsaṅghāṭādīsu laggetvā ceva niyyuhādīsu ca pūretvā ṭhapitaṃ. Upalāpetunti aññamaññaṃ bhindituṃ. Yathā dve janā ekena maggena na gacchanti evaṃ kātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nabhaṃ āhaccā"
      },
      "ti ākāsaṃ pūretvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ jarā ca maccu cā"
      },
      "ti idha dveyeva pabbatā gahitā, rājovāde pana ‘‘jarā āgacchati sabbayobbanaṃ vilumpamānā’’ti evaṃ jarā maraṇaṃ byādhi vipattīti cattāropete āgatāva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      "ti yasmā hatthiyuddhādīhi jarāmaraṇaṃ jinituṃ na sakkā, tasmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhaṃ nivesaye"
      },
      "ti saddhaṃ niveseyya, patiṭṭhāpeyyāti. Pañcamaṃ."
    ],
    "innerText": "Nabhaṃ āhaccāti ākāsaṃ pūretvā. Evaṃ jarā ca maccu cāti idha dveyeva pabbatā gahitā, rājovāde pana ‘‘jarā āgacchati sabbayobbanaṃ vilumpamānā’’ti evaṃ jarā maraṇaṃ byādhi vipattīti cattāropete āgatāva. Tasmāti yasmā hatthiyuddhādīhi jarāmaraṇaṃ jinituṃ na sakkā, tasmā. Saddhaṃ nivesayeti saddhaṃ niveseyya, patiṭṭhāpeyyāti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tatiyo vaggo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti sāratthappakāsiniyā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saṃyuttanikāya-aṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kosalasaṃyuttavaṇṇanā niṭṭhitā."
  }
]