[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Satipaṭṭhānasaṃyuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Ambapālivaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Ambapālisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "367"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā vesāliyaṃ viharati ambapālivane. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "367. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā vesāliyaṃ viharati ambapālivane. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ekāyano ayaṃ, bhikkhave, maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ – cattāro satipaṭṭhānā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu vedanānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; citte cittānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ekāyano ayaṃ, bhikkhave, maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ – cattāro satipaṭṭhānā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idamavoca ",
      " bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Paṭhamaṃ."
    ],
    "innerText": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Satisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "368"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā vesāliyaṃ viharati ambapālivane. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "368. Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati ambapālivane. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sato, bhikkhave, bhikkhu vihareyya sampajāno. Ayaṃ vo amhākaṃ anusāsanī. Kathañca, bhikkhave, bhikkhu sato hoti? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya ",
      " loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Evaṃ kho, bhikkhave, bhikkhu sato hoti."
    ],
    "innerText": "‘‘Sato, bhikkhave, bhikkhu vihareyya sampajāno. Ayaṃ vo amhākaṃ anusāsanī. Kathañca, bhikkhave, bhikkhu sato hoti? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Evaṃ kho, bhikkhave, bhikkhu sato hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu sampajāno hoti? Idha, bhikkhave, bhikkhu abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti. Evaṃ kho, bhikkhave, bhikkhu sampajānakārī hoti. Sato, bhikkhave, bhikkhu vihareyya sampajāno. Ayaṃ vo amhākaṃ anusāsanī’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Bhikkhusuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "369"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho ",
      " appamatto ātāpī ",
      " pahitatto vihareyya’’nti. ‘‘Evameva panidhekacce moghapurisā mañceva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mameva (sī.)]"
      },
      " ajjhesanti, dhamme ca bhāsite mameva anubandhitabbaṃ maññantī’’ti. ‘‘Desetu me, bhante, bhagavā saṃkhittena dhammaṃ, desetu sugato saṃkhittena dhammaṃ. Appeva nāmāhaṃ bhagavato bhāsitassa atthaṃ jāneyyaṃ, appeva nāmāhaṃ bhagavato bhāsitassa dāyādo assa’’nti. ‘‘Tasmātiha tvaṃ, bhikkhu, ādimeva visodhehi kusalesu dhammesu. Ko cādi kusalānaṃ dhammānaṃ? Sīlañca suvisuddhaṃ, diṭṭhi ca ujukā. Yato kho te, bhikkhu, sīlañca suvisuddhaṃ bhavissati diṭṭhi ca ujukā, tato tvaṃ, bhikkhu, sīlaṃ nissāya sīle patiṭṭhāya cattāro satipaṭṭhāne tividhena bhāveyyāsi."
    ],
    "innerText": "369. Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Evameva panidhekacce moghapurisā mañceva [mameva (sī.)] ajjhesanti, dhamme ca bhāsite mameva anubandhitabbaṃ maññantī’’ti. ‘‘Desetu me, bhante, bhagavā saṃkhittena dhammaṃ, desetu sugato saṃkhittena dhammaṃ. Appeva nāmāhaṃ bhagavato bhāsitassa atthaṃ jāneyyaṃ, appeva nāmāhaṃ bhagavato bhāsitassa dāyādo assa’’nti. ‘‘Tasmātiha tvaṃ, bhikkhu, ādimeva visodhehi kusalesu dhammesu. Ko cādi kusalānaṃ dhammānaṃ? Sīlañca suvisuddhaṃ, diṭṭhi ca ujukā. Yato kho te, bhikkhu, sīlañca suvisuddhaṃ bhavissati diṭṭhi ca ujukā, tato tvaṃ, bhikkhu, sīlaṃ nissāya sīle patiṭṭhāya cattāro satipaṭṭhāne tividhena bhāveyyāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katame ",
      " cattāro? Idha tvaṃ, bhikkhu, ajjhattaṃ vā kāye kāyānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; bahiddhā vā kāye kāyānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; ajjhattabahiddhā ",
      " vā kāye kāyānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ajjhattaṃ vā vedanāsu…pe… bahiddhā vā vedanāsu…pe… ajjhattabahiddhā vā vedanāsu vedanānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ajjhattaṃ vā citte…pe… bahiddhā vā citte…pe… ajjhattabahiddhā vā citte cittānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ajjhattaṃ vā dhammesu…pe… bahiddhā vā dhammesu…pe… ajjhattabahiddhā vā dhammesu dhammānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Yato kho tvaṃ, bhikkhu, sīlaṃ nissāya sīle patiṭṭhāya ime cattāro satipaṭṭhāne evaṃ tividhena bhāvessasi, tato tuyhaṃ, bhikkhu, yā ratti vā divaso vā āgamissati vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihānī’’ti."
    ],
    "innerText": "Katame cattāro? Idha tvaṃ, bhikkhu, ajjhattaṃ vā kāye kāyānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; bahiddhā vā kāye kāyānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; ajjhattabahiddhā vā kāye kāyānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ajjhattaṃ vā vedanāsu…pe… bahiddhā vā vedanāsu…pe… ajjhattabahiddhā vā vedanāsu vedanānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ajjhattaṃ vā citte…pe… bahiddhā vā citte…pe… ajjhattabahiddhā vā citte cittānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ajjhattaṃ vā dhammesu…pe… bahiddhā vā dhammesu…pe… ajjhattabahiddhā vā dhammesu dhammānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Yato kho tvaṃ, bhikkhu, sīlaṃ nissāya sīle patiṭṭhāya ime cattāro satipaṭṭhāne evaṃ tividhena bhāvessasi, tato tuyhaṃ, bhikkhu, yā ratti vā divaso vā āgamissati vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihānī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho so bhikkhu bhagavato bhāsitaṃ abhinanditvā ",
      " anumoditvā uṭṭhāyāsanā bhagavantaṃ ",
      " abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho so bhikkhu eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati ",
      ". ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca pana so bhikkhu arahataṃ ahosīti. Tatiyaṃ."
    ],
    "innerText": "Atha kho so bhikkhu bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho so bhikkhu eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati . ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca pana so bhikkhu arahataṃ ahosīti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Sālasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "370"
      },
      ". Ekaṃ samayaṃ bhagavā kosalesu viharati sālāya brāhmaṇagāme. Tatra kho bhagavā bhikkhū āmantesi…pe… etadavoca –"
    ],
    "innerText": "370. Ekaṃ samayaṃ bhagavā kosalesu viharati sālāya brāhmaṇagāme. Tatra kho bhagavā bhikkhū āmantesi…pe… etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye te, bhikkhave, bhikkhū navā acirapabbajitā adhunāgatā imaṃ dhammavinayaṃ, te vo, bhikkhave, bhikkhū catunnaṃ satipaṭṭhānānaṃ bhāvanāya samādapetabbā nivesetabbā patiṭṭhāpetabbā. Katamesaṃ catunnaṃ? Etha tumhe, āvuso, kāye ",
      " kāyānupassino viharatha ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, kāyassa yathābhūtaṃ ñāṇāya; vedanāsu vedanānupassino viharatha ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, vedanānaṃ yathābhūtaṃ ñāṇāya; citte cittānupassino viharatha ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, cittassa yathābhūtaṃ ñāṇāya; dhammesu dhammānupassino viharatha ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, dhammānaṃ yathābhūtaṃ ñāṇāya. Yepi ",
      " te, bhikkhave, bhikkhū sekhā appattamānasā anuttaraṃ yogakkhemaṃ patthayamānā viharanti, tepi kāye kāyānupassino viharanti ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā ",
      ", kāyassa pariññāya; vedanāsu vedanānupassino viharanti ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, vedanānaṃ pariññāya; citte cittānupassino viharanti ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, cittassa pariññāya; dhammesu dhammānupassino viharanti ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, dhammānaṃ pariññāya."
    ],
    "innerText": "‘‘Ye te, bhikkhave, bhikkhū navā acirapabbajitā adhunāgatā imaṃ dhammavinayaṃ, te vo, bhikkhave, bhikkhū catunnaṃ satipaṭṭhānānaṃ bhāvanāya samādapetabbā nivesetabbā patiṭṭhāpetabbā. Katamesaṃ catunnaṃ? Etha tumhe, āvuso, kāye kāyānupassino viharatha ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, kāyassa yathābhūtaṃ ñāṇāya; vedanāsu vedanānupassino viharatha ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, vedanānaṃ yathābhūtaṃ ñāṇāya; citte cittānupassino viharatha ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, cittassa yathābhūtaṃ ñāṇāya; dhammesu dhammānupassino viharatha ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, dhammānaṃ yathābhūtaṃ ñāṇāya. Yepi te, bhikkhave, bhikkhū sekhā appattamānasā anuttaraṃ yogakkhemaṃ patthayamānā viharanti, tepi kāye kāyānupassino viharanti ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā , kāyassa pariññāya; vedanāsu vedanānupassino viharanti ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, vedanānaṃ pariññāya; citte cittānupassino viharanti ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, cittassa pariññāya; dhammesu dhammānupassino viharanti ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, dhammānaṃ pariññāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yepi ",
      " te, bhikkhave, bhikkhū arahanto khīṇāsavā vusitavanto katakaraṇīyā ohitabhārā anuppattasadatthā parikkhīṇabhavasaṃyojanā sammadaññā vimuttā, tepi kāye kāyānupassino viharanti ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, kāyena visaṃyuttā; vedanāsu vedanānupassino viharanti ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, vedanāhi visaṃyuttā; citte cittānupassino viharanti ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, cittena visaṃyuttā; dhammesu dhammānupassino viharanti ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, dhammehi visaṃyuttā."
    ],
    "innerText": "‘‘Yepi te, bhikkhave, bhikkhū arahanto khīṇāsavā vusitavanto katakaraṇīyā ohitabhārā anuppattasadatthā parikkhīṇabhavasaṃyojanā sammadaññā vimuttā, tepi kāye kāyānupassino viharanti ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, kāyena visaṃyuttā; vedanāsu vedanānupassino viharanti ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, vedanāhi visaṃyuttā; citte cittānupassino viharanti ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, cittena visaṃyuttā; dhammesu dhammānupassino viharanti ātāpino sampajānā ekodibhūtā vippasannacittā samāhitā ekaggacittā, dhammehi visaṃyuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yepi te, bhikkhave, bhikkhū navā acirapabbajitā adhunāgatā imaṃ dhammavinayaṃ, te vo, bhikkhave, bhikkhū imesaṃ catunnaṃ satipaṭṭhānānaṃ bhāvanāya ",
      " samādapetabbā nivesetabbā patiṭṭhāpetabbā’’ti. Catutthaṃ."
    ],
    "innerText": "‘‘Yepi te, bhikkhave, bhikkhū navā acirapabbajitā adhunāgatā imaṃ dhammavinayaṃ, te vo, bhikkhave, bhikkhū imesaṃ catunnaṃ satipaṭṭhānānaṃ bhāvanāya samādapetabbā nivesetabbā patiṭṭhāpetabbā’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Akusalarāsisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "371"
      },
      ". Sāvatthinidānaṃ ",
      ". Tatra kho bhagavā etadavoca – ‘‘‘akusalarāsī’ti, bhikkhave, vadamāno pañca nīvaraṇe sammā vadamāno vadeyya. Kevalo hāyaṃ, bhikkhave, akusalarāsi, yadidaṃ – pañca nīvaraṇā. Katame pañca? Kāmacchandanīvaraṇaṃ ",
      ", byāpādanīvaraṇaṃ, thinamiddhanīvaraṇaṃ, uddhaccakukkuccanīvaraṇaṃ, vicikicchānīvaraṇaṃ. ‘Akusalarāsī’ti, bhikkhave, vadamāno ime pañca nīvaraṇe sammā vadamāno vadeyya. Kevalo hāyaṃ, bhikkhave, akusalarāsi, yadidaṃ – pañca nīvaraṇā."
    ],
    "innerText": "371. Sāvatthinidānaṃ . Tatra kho bhagavā etadavoca – ‘‘‘akusalarāsī’ti, bhikkhave, vadamāno pañca nīvaraṇe sammā vadamāno vadeyya. Kevalo hāyaṃ, bhikkhave, akusalarāsi, yadidaṃ – pañca nīvaraṇā. Katame pañca? Kāmacchandanīvaraṇaṃ , byāpādanīvaraṇaṃ, thinamiddhanīvaraṇaṃ, uddhaccakukkuccanīvaraṇaṃ, vicikicchānīvaraṇaṃ. ‘Akusalarāsī’ti, bhikkhave, vadamāno ime pañca nīvaraṇe sammā vadamāno vadeyya. Kevalo hāyaṃ, bhikkhave, akusalarāsi, yadidaṃ – pañca nīvaraṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Kusalarāsī’ti, bhikkhave, vadamāno cattāro satipaṭṭhāne sammā vadamāno vadeyya. Kevalo hāyaṃ, bhikkhave, kusalarāsi, yadidaṃ – cattāro satipaṭṭhānā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ ",
      ". ‘Kusalarāsī’ti, bhikkhave, vadamāno ime cattāro satipaṭṭhāne sammā vadamāno vadeyya. Kevalo hāyaṃ, bhikkhave, kusalarāsi, yadidaṃ – cattāro satipaṭṭhānā’’ti. Pañcamaṃ."
    ],
    "innerText": "‘‘‘Kusalarāsī’ti, bhikkhave, vadamāno cattāro satipaṭṭhāne sammā vadamāno vadeyya. Kevalo hāyaṃ, bhikkhave, kusalarāsi, yadidaṃ – cattāro satipaṭṭhānā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ . ‘Kusalarāsī’ti, bhikkhave, vadamāno ime cattāro satipaṭṭhāne sammā vadamāno vadeyya. Kevalo hāyaṃ, bhikkhave, kusalarāsi, yadidaṃ – cattāro satipaṭṭhānā’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Sakuṇagghisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "372"
      },
      ". ‘‘Bhūtapubbaṃ, bhikkhave, sakuṇagghi lāpaṃ sakuṇaṃ sahasā ajjhappattā aggahesi. Atha kho, bhikkhave, lāpo sakuṇo sakuṇagghiyā hariyamāno evaṃ paridevasi – ‘mayamevamha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mayamevāmha (ka.)]"
      },
      " alakkhikā, mayaṃ ",
      " appapuññā, ye mayaṃ agocare carimha paravisaye. Sacejja mayaṃ gocare careyyāma sake pettike visaye, na myāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na cāyaṃ (sī.)]"
      },
      ", sakuṇagghi, alaṃ abhavissa, yadidaṃ – yuddhāyā’ti. ‘Ko pana te, lāpa, gocaro sako pettiko visayo’ti? ‘Yadidaṃ – naṅgalakaṭṭhakaraṇaṃ leḍḍuṭṭhāna’’’nti. ‘‘Atha ",
      " kho, bhikkhave, sakuṇagghi sake bale apatthaddhā sake bale asaṃvadamānā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[avacamānā (sī.)]"
      },
      " lāpaṃ sakuṇaṃ pamuñci – ‘gaccha kho tvaṃ, lāpa, tatrapi me gantvā na mokkhasī’’’ti."
    ],
    "innerText": "372. ‘‘Bhūtapubbaṃ, bhikkhave, sakuṇagghi lāpaṃ sakuṇaṃ sahasā ajjhappattā aggahesi. Atha kho, bhikkhave, lāpo sakuṇo sakuṇagghiyā hariyamāno evaṃ paridevasi – ‘mayamevamha [mayamevāmha (ka.)] alakkhikā, mayaṃ appapuññā, ye mayaṃ agocare carimha paravisaye. Sacejja mayaṃ gocare careyyāma sake pettike visaye, na myāyaṃ [na cāyaṃ (sī.)], sakuṇagghi, alaṃ abhavissa, yadidaṃ – yuddhāyā’ti. ‘Ko pana te, lāpa, gocaro sako pettiko visayo’ti? ‘Yadidaṃ – naṅgalakaṭṭhakaraṇaṃ leḍḍuṭṭhāna’’’nti. ‘‘Atha kho, bhikkhave, sakuṇagghi sake bale apatthaddhā sake bale asaṃvadamānā [avacamānā (sī.)] lāpaṃ sakuṇaṃ pamuñci – ‘gaccha kho tvaṃ, lāpa, tatrapi me gantvā na mokkhasī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha ",
      " kho, bhikkhave, lāpo sakuṇo naṅgalakaṭṭhakaraṇaṃ leḍḍuṭṭhānaṃ gantvā mahantaṃ leḍḍuṃ abhiruhitvā sakuṇagghiṃ vadamāno aṭṭhāsi – ‘ehi kho dāni me, sakuṇagghi, ehi kho dāni me, sakuṇagghī’ti. Atha kho sā, bhikkhave, sakuṇagghi sake bale apatthaddhā sake bale asaṃvadamānā ubho pakkhe sannayha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sandhāya (sī. syā.)]"
      },
      " lāpaṃ sakuṇaṃ sahasā ajjhappattā. Yadā kho, bhikkhave, aññāsi lāpo sakuṇo ‘bahuāgato kho myāyaṃ sakuṇagghī’ti, atha tasseva leḍḍussa antaraṃ paccupādi. Atha kho, bhikkhave, sakuṇagghi tattheva uraṃ paccatāḷesi. Evañhi taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[evaṃ hetaṃ (sī.)]"
      },
      ", bhikkhave, hoti yo agocare carati paravisaye."
    ],
    "innerText": "‘‘Atha kho, bhikkhave, lāpo sakuṇo naṅgalakaṭṭhakaraṇaṃ leḍḍuṭṭhānaṃ gantvā mahantaṃ leḍḍuṃ abhiruhitvā sakuṇagghiṃ vadamāno aṭṭhāsi – ‘ehi kho dāni me, sakuṇagghi, ehi kho dāni me, sakuṇagghī’ti. Atha kho sā, bhikkhave, sakuṇagghi sake bale apatthaddhā sake bale asaṃvadamānā ubho pakkhe sannayha [sandhāya (sī. syā.)] lāpaṃ sakuṇaṃ sahasā ajjhappattā. Yadā kho, bhikkhave, aññāsi lāpo sakuṇo ‘bahuāgato kho myāyaṃ sakuṇagghī’ti, atha tasseva leḍḍussa antaraṃ paccupādi. Atha kho, bhikkhave, sakuṇagghi tattheva uraṃ paccatāḷesi. Evañhi taṃ [evaṃ hetaṃ (sī.)], bhikkhave, hoti yo agocare carati paravisaye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tasmātiha, bhikkhave, mā agocare carittha paravisaye. Agocare, bhikkhave, carataṃ paravisaye lacchati māro otāraṃ, lacchati māro ārammaṇaṃ. Ko ca, bhikkhave, bhikkhuno agocaro paravisayo? Yadidaṃ – pañca kāmaguṇā. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā, sotaviññeyyā ",
      " saddā…pe… ghānaviññeyyā ",
      " gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā – ayaṃ, bhikkhave, bhikkhuno agocaro paravisayo."
    ],
    "innerText": "‘‘Tasmātiha, bhikkhave, mā agocare carittha paravisaye. Agocare, bhikkhave, carataṃ paravisaye lacchati māro otāraṃ, lacchati māro ārammaṇaṃ. Ko ca, bhikkhave, bhikkhuno agocaro paravisayo? Yadidaṃ – pañca kāmaguṇā. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā, sotaviññeyyā saddā…pe… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā – ayaṃ, bhikkhave, bhikkhuno agocaro paravisayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Gocare, bhikkhave, caratha sake pettike visaye. Gocare, bhikkhave, carataṃ sake pettike visaye na lacchati māro otāraṃ, na lacchati māro ārammaṇaṃ. Ko ",
      " ca, bhikkhave, bhikkhuno gocaro sako pettiko visayo? Yadidaṃ – cattāro satipaṭṭhānā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ – ayaṃ, bhikkhave, bhikkhuno gocaro sako pettiko visayo’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Gocare, bhikkhave, caratha sake pettike visaye. Gocare, bhikkhave, carataṃ sake pettike visaye na lacchati māro otāraṃ, na lacchati māro ārammaṇaṃ. Ko ca, bhikkhave, bhikkhuno gocaro sako pettiko visayo? Yadidaṃ – cattāro satipaṭṭhānā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ – ayaṃ, bhikkhave, bhikkhuno gocaro sako pettiko visayo’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Makkaṭasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "373"
      },
      ". ‘‘Atthi, bhikkhave, himavato pabbatarājassa duggā visamā desā, yattha neva makkaṭānaṃ cārī na manussānaṃ. Atthi, bhikkhave, himavato pabbatarājassa ",
      " duggā visamā desā, yattha makkaṭānañhi kho cārī, na manussānaṃ. Atthi, bhikkhave, himavato pabbatarājassa samā bhūmibhāgā ramaṇīyā, yattha makkaṭānañceva cārī manussānañca. Tatra, bhikkhave, luddā makkaṭavīthīsu lepaṃ oḍḍenti makkaṭānaṃ bādhanāya."
    ],
    "innerText": "373. ‘‘Atthi, bhikkhave, himavato pabbatarājassa duggā visamā desā, yattha neva makkaṭānaṃ cārī na manussānaṃ. Atthi, bhikkhave, himavato pabbatarājassa duggā visamā desā, yattha makkaṭānañhi kho cārī, na manussānaṃ. Atthi, bhikkhave, himavato pabbatarājassa samā bhūmibhāgā ramaṇīyā, yattha makkaṭānañceva cārī manussānañca. Tatra, bhikkhave, luddā makkaṭavīthīsu lepaṃ oḍḍenti makkaṭānaṃ bādhanāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, ye te makkaṭā abālajātikā alolajātikā, te taṃ lepaṃ disvā ārakā parivajjanti. Yo pana so hoti ",
      " makkaṭo bālajātiko lolajātiko, so taṃ lepaṃ upasaṅkamitvā hatthena gaṇhāti. So tattha bajjhati. ‘Hatthaṃ mocessāmī’ti dutiyena hatthena gaṇhāti. So tattha bajjhati. ‘Ubho hatthe mocessāmī’ti pādena gaṇhāti. So tattha bajjhati. ‘Ubho hatthe mocessāmi pādañcā’ti dutiyena pādena gaṇhāti. So tattha bajjhati. ‘Ubho hatthe mocessāmi pāde cā’ti tuṇḍena gaṇhāti. So tattha bajjhati. Evañhi so, bhikkhave, makkaṭo pañcoḍḍito thunaṃ seti anayaṃ āpanno byasanaṃ āpanno yathākāmakaraṇīyo ",
      " luddassa. Tamenaṃ, bhikkhave, luddo vijjhitvā tasmiṃyeva kaṭṭhakataṅgāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tasmiṃyeva makkaṭaṃ uddharitvā (sī. syā.)]"
      },
      " avassajjetvā yena kāmaṃ pakkamati. Evaṃ so taṃ, bhikkhave, hoti yo agocare carati paravisaye."
    ],
    "innerText": "‘‘Tatra, bhikkhave, ye te makkaṭā abālajātikā alolajātikā, te taṃ lepaṃ disvā ārakā parivajjanti. Yo pana so hoti makkaṭo bālajātiko lolajātiko, so taṃ lepaṃ upasaṅkamitvā hatthena gaṇhāti. So tattha bajjhati. ‘Hatthaṃ mocessāmī’ti dutiyena hatthena gaṇhāti. So tattha bajjhati. ‘Ubho hatthe mocessāmī’ti pādena gaṇhāti. So tattha bajjhati. ‘Ubho hatthe mocessāmi pādañcā’ti dutiyena pādena gaṇhāti. So tattha bajjhati. ‘Ubho hatthe mocessāmi pāde cā’ti tuṇḍena gaṇhāti. So tattha bajjhati. Evañhi so, bhikkhave, makkaṭo pañcoḍḍito thunaṃ seti anayaṃ āpanno byasanaṃ āpanno yathākāmakaraṇīyo luddassa. Tamenaṃ, bhikkhave, luddo vijjhitvā tasmiṃyeva kaṭṭhakataṅgāre [tasmiṃyeva makkaṭaṃ uddharitvā (sī. syā.)] avassajjetvā yena kāmaṃ pakkamati. Evaṃ so taṃ, bhikkhave, hoti yo agocare carati paravisaye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tasmātiha, bhikkhave, mā agocare carittha paravisaye. Agocare, bhikkhave, carataṃ paravisaye lacchati māro otāraṃ, lacchati māro ārammaṇaṃ. Ko ca, bhikkhave, bhikkhuno agocaro paravisayo? Yadidaṃ – pañca kāmaguṇā. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā, sotaviññeyyā saddā…pe… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Ayaṃ, bhikkhave, bhikkhuno agocaro paravisayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Gocare, bhikkhave, caratha sake pettike visaye. Gocare, bhikkhave ",
      ", carataṃ sake pettike visaye na lacchati māro otāraṃ, na lacchati māro ārammaṇaṃ. Ko ca, bhikkhave, bhikkhuno gocaro sako pettiko visayo? Yadidaṃ – cattāro satipaṭṭhānā. Katame cattāro ",
      "? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ayaṃ, bhikkhave, bhikkhuno gocaro sako pettiko visayo’’ti. Sattamaṃ."
    ],
    "innerText": "‘‘Gocare, bhikkhave, caratha sake pettike visaye. Gocare, bhikkhave , carataṃ sake pettike visaye na lacchati māro otāraṃ, na lacchati māro ārammaṇaṃ. Ko ca, bhikkhave, bhikkhuno gocaro sako pettiko visayo? Yadidaṃ – cattāro satipaṭṭhānā. Katame cattāro ? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ayaṃ, bhikkhave, bhikkhuno gocaro sako pettiko visayo’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Sūdasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "374"
      },
      ". ‘‘Seyyathāpi, bhikkhave, bālo abyatto akusalo sūdo rājānaṃ vā rājamahāmattaṃ vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[rājamahāmattānaṃ vā (sī.)]"
      },
      " nānaccayehi sūpehi paccupaṭṭhito assa – ambilaggehipi, tittakaggehipi, kaṭukaggehipi, madhuraggehipi, khārikehipi, akhārikehipi, loṇikehipi, aloṇikehipi."
    ],
    "innerText": "374. ‘‘Seyyathāpi, bhikkhave, bālo abyatto akusalo sūdo rājānaṃ vā rājamahāmattaṃ vā [rājamahāmattānaṃ vā (sī.)] nānaccayehi sūpehi paccupaṭṭhito assa – ambilaggehipi, tittakaggehipi, kaṭukaggehipi, madhuraggehipi, khārikehipi, akhārikehipi, loṇikehipi, aloṇikehipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sa ",
      " kho so, bhikkhave, bālo abyatto akusalo sūdo sakassa bhattu nimittaṃ na uggaṇhāti – ‘idaṃ vā me ajja bhattu sūpeyyaṃ ruccati, imassa vā abhiharati, imassa vā bahuṃ gaṇhāti, imassa vā vaṇṇaṃ bhāsati. Ambilaggaṃ vā me ajja bhattu sūpeyyaṃ ruccati ",
      ", ambilaggassa vā abhiharati, ambilaggassa vā bahuṃ gaṇhāti, ambilaggassa vā vaṇṇaṃ bhāsati. Tittakaggaṃ vā me ajja… kaṭukaggaṃ vā me ajja… madhuraggaṃ vā me ajja… khārikaṃ vā me ajja… akhārikaṃ vā me ajja… loṇikaṃ ",
      " vā me ajja… aloṇikaṃ vā me ajja bhattu sūpeyyaṃ ruccati, aloṇikassa vā abhiharati, aloṇikassa vā bahuṃ gaṇhāti, aloṇikassa vā vaṇṇaṃ bhāsatī’’’ti."
    ],
    "innerText": "‘‘Sa kho so, bhikkhave, bālo abyatto akusalo sūdo sakassa bhattu nimittaṃ na uggaṇhāti – ‘idaṃ vā me ajja bhattu sūpeyyaṃ ruccati, imassa vā abhiharati, imassa vā bahuṃ gaṇhāti, imassa vā vaṇṇaṃ bhāsati. Ambilaggaṃ vā me ajja bhattu sūpeyyaṃ ruccati , ambilaggassa vā abhiharati, ambilaggassa vā bahuṃ gaṇhāti, ambilaggassa vā vaṇṇaṃ bhāsati. Tittakaggaṃ vā me ajja… kaṭukaggaṃ vā me ajja… madhuraggaṃ vā me ajja… khārikaṃ vā me ajja… akhārikaṃ vā me ajja… loṇikaṃ vā me ajja… aloṇikaṃ vā me ajja bhattu sūpeyyaṃ ruccati, aloṇikassa vā abhiharati, aloṇikassa vā bahuṃ gaṇhāti, aloṇikassa vā vaṇṇaṃ bhāsatī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sa kho so, bhikkhave, bālo abyatto akusalo sūdo na ceva lābhī hoti acchādanassa, na lābhī vetanassa, na lābhī abhihārānaṃ. Taṃ kissa hetu? Tathā hi so, bhikkhave, bālo abyatto akusalo sūdo sakassa bhattu nimittaṃ na uggaṇhāti. Evameva kho, bhikkhave, idhekacco bālo abyatto akusalo bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa kāye kāyānupassino viharato cittaṃ na samādhiyati, upakkilesā na pahīyanti. So taṃ nimittaṃ na uggaṇhāti. Vedanāsu vedanānupassī viharati…pe… citte cittānupassī viharati ",
      " …pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa dhammesu dhammānupassino viharato cittaṃ na samādhiyati, upakkilesā na pahīyanti. So taṃ nimittaṃ na uggaṇhāti."
    ],
    "innerText": "‘‘Sa kho so, bhikkhave, bālo abyatto akusalo sūdo na ceva lābhī hoti acchādanassa, na lābhī vetanassa, na lābhī abhihārānaṃ. Taṃ kissa hetu? Tathā hi so, bhikkhave, bālo abyatto akusalo sūdo sakassa bhattu nimittaṃ na uggaṇhāti. Evameva kho, bhikkhave, idhekacco bālo abyatto akusalo bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa kāye kāyānupassino viharato cittaṃ na samādhiyati, upakkilesā na pahīyanti. So taṃ nimittaṃ na uggaṇhāti. Vedanāsu vedanānupassī viharati…pe… citte cittānupassī viharati …pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa dhammesu dhammānupassino viharato cittaṃ na samādhiyati, upakkilesā na pahīyanti. So taṃ nimittaṃ na uggaṇhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sa kho so, bhikkhave, bālo abyatto akusalo bhikkhu na ceva lābhī hoti diṭṭheva dhamme sukhavihārānaṃ, na lābhī satisampajaññassa ",
      ". Taṃ kissa hetu? Tathā hi so, bhikkhave, bālo abyatto akusalo bhikkhu sakassa cittassa nimittaṃ na uggaṇhāti."
    ],
    "innerText": "‘‘Sa kho so, bhikkhave, bālo abyatto akusalo bhikkhu na ceva lābhī hoti diṭṭheva dhamme sukhavihārānaṃ, na lābhī satisampajaññassa . Taṃ kissa hetu? Tathā hi so, bhikkhave, bālo abyatto akusalo bhikkhu sakassa cittassa nimittaṃ na uggaṇhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, paṇḍito byatto kusalo sūdo rājānaṃ ",
      " vā rājamahāmattaṃ vā nānaccayehi sūpehi paccupaṭṭhito assa – ambilaggehipi, tittakaggehipi, kaṭukaggehipi, madhuraggehipi, khārikehipi, akhārikehipi, loṇikehipi, aloṇikehipi."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, paṇḍito byatto kusalo sūdo rājānaṃ vā rājamahāmattaṃ vā nānaccayehi sūpehi paccupaṭṭhito assa – ambilaggehipi, tittakaggehipi, kaṭukaggehipi, madhuraggehipi, khārikehipi, akhārikehipi, loṇikehipi, aloṇikehipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sa kho so, bhikkhave, paṇḍito byatto kusalo sūdo sakassa bhattu nimittaṃ uggaṇhāti – ‘idaṃ vā me ajja bhattu sūpeyyaṃ ruccati, imassa vā abhiharati, imassa vā bahuṃ gaṇhāti, imassa vā vaṇṇaṃ bhāsati. Ambilaggaṃ vā me ajja bhattu sūpeyyaṃ ruccati ",
      ", ambilaggassa vā abhiharati, ambilaggassa vā bahuṃ gaṇhāti, ambilaggassa vā vaṇṇaṃ bhāsati. Tittakaggaṃ vā me ajja… kaṭukaggaṃ vā me ajja… madhuraggaṃ vā me ajja… khārikaṃ vā me ajja… akhārikaṃ vā me ajja… loṇikaṃ vā me ajja… aloṇikaṃ vā me ajja bhattu sūpeyyaṃ ruccati, aloṇikassa vā abhiharati, aloṇikassa vā bahuṃ gaṇhāti, aloṇikassa vā vaṇṇaṃ bhāsatī’’’ti."
    ],
    "innerText": "‘‘Sa kho so, bhikkhave, paṇḍito byatto kusalo sūdo sakassa bhattu nimittaṃ uggaṇhāti – ‘idaṃ vā me ajja bhattu sūpeyyaṃ ruccati, imassa vā abhiharati, imassa vā bahuṃ gaṇhāti, imassa vā vaṇṇaṃ bhāsati. Ambilaggaṃ vā me ajja bhattu sūpeyyaṃ ruccati , ambilaggassa vā abhiharati, ambilaggassa vā bahuṃ gaṇhāti, ambilaggassa vā vaṇṇaṃ bhāsati. Tittakaggaṃ vā me ajja… kaṭukaggaṃ vā me ajja… madhuraggaṃ vā me ajja… khārikaṃ vā me ajja… akhārikaṃ vā me ajja… loṇikaṃ vā me ajja… aloṇikaṃ vā me ajja bhattu sūpeyyaṃ ruccati, aloṇikassa vā abhiharati, aloṇikassa vā bahuṃ gaṇhāti, aloṇikassa vā vaṇṇaṃ bhāsatī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sa kho so, bhikkhave, paṇḍito byatto kusalo sūdo lābhī ceva hoti acchādanassa, lābhī vetanassa, lābhī abhihārānaṃ. Taṃ kissa hetu? Tathā hi so, bhikkhave, paṇḍito byatto kusalo sūdo sakassa bhattu nimittaṃ uggaṇhāti. Evameva kho, bhikkhave, idhekacco paṇḍito byatto kusalo bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa kāye kāyānupassino viharato ",
      " cittaṃ samādhiyati, upakkilesā pahīyanti ",
      ". So taṃ nimittaṃ uggaṇhāti. Vedanāsu vedanānupassī viharati…pe… citte cittānupassī viharati…pe… dhammesu dhammānupassī viharati ",
      " ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa dhammesu dhammānupassino viharato cittaṃ samādhiyati, upakkilesā pahīyanti. So taṃ nimittaṃ uggaṇhāti."
    ],
    "innerText": "‘‘Sa kho so, bhikkhave, paṇḍito byatto kusalo sūdo lābhī ceva hoti acchādanassa, lābhī vetanassa, lābhī abhihārānaṃ. Taṃ kissa hetu? Tathā hi so, bhikkhave, paṇḍito byatto kusalo sūdo sakassa bhattu nimittaṃ uggaṇhāti. Evameva kho, bhikkhave, idhekacco paṇḍito byatto kusalo bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa kāye kāyānupassino viharato cittaṃ samādhiyati, upakkilesā pahīyanti . So taṃ nimittaṃ uggaṇhāti. Vedanāsu vedanānupassī viharati…pe… citte cittānupassī viharati…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa dhammesu dhammānupassino viharato cittaṃ samādhiyati, upakkilesā pahīyanti. So taṃ nimittaṃ uggaṇhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sa kho so, bhikkhave, paṇḍito byatto kusalo bhikkhu lābhī ceva hoti diṭṭheva dhamme sukhavihārānaṃ, lābhī hoti satisampajaññassa. Taṃ kissa hetu? Tathā hi so, bhikkhave, paṇḍito byatto kusalo bhikkhu sakassa cittassa nimittaṃ uggaṇhātī’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Gilānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "375"
      },
      ". Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā vesāliyaṃ viharati veḷuvagāmake ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[beluvagāmake (sī. syā. kaṃ. pī.)]"
      },
      ". Tatra kho bhagavā bhikkhū āmantesi – ‘‘etha tumhe, bhikkhave, samantā vesāliyā yathāmittaṃ yathāsandiṭṭhaṃ yathāsambhattaṃ vassaṃ upetha. Idhevāhaṃ veḷuvagāmake vassaṃ upagacchāmī’’ti. ‘‘Evaṃ, bhante’’ti ",
      " kho te bhikkhū bhagavato paṭissutvā samantā vesāliyā yathāmittaṃ yathāsandiṭṭhaṃ yathāsambhattaṃ vassaṃ upagacchuṃ. Bhagavā pana tattheva veḷuvagāmake vassaṃ upagacchi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[upagañchi (sī. pī.)]"
      },
      "."
    ],
    "innerText": "375. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā vesāliyaṃ viharati veḷuvagāmake [beluvagāmake (sī. syā. kaṃ. pī.)]. Tatra kho bhagavā bhikkhū āmantesi – ‘‘etha tumhe, bhikkhave, samantā vesāliyā yathāmittaṃ yathāsandiṭṭhaṃ yathāsambhattaṃ vassaṃ upetha. Idhevāhaṃ veḷuvagāmake vassaṃ upagacchāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paṭissutvā samantā vesāliyā yathāmittaṃ yathāsandiṭṭhaṃ yathāsambhattaṃ vassaṃ upagacchuṃ. Bhagavā pana tattheva veḷuvagāmake vassaṃ upagacchi [upagañchi (sī. pī.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavato vassūpagatassa kharo ābādho uppajji, bāḷhā vedanā vattanti māraṇantikā. Tatra sudaṃ bhagavā sato sampajāno adhivāsesi avihaññamāno. Atha kho bhagavato etadahosi – ‘‘na kho ",
      " me taṃ patirūpaṃ, yohaṃ anāmantetvā upaṭṭhāke anapaloketvā bhikkhusaṅghaṃ parinibbāyeyyaṃ. Yaṃnūnāhaṃ imaṃ ābādhaṃ vīriyena paṭipaṇāmetvā jīvitasaṅkhāraṃ adhiṭṭhāya ",
      " vihareyya’’nti. Atha kho bhagavā taṃ ābādhaṃ vīriyena paṭipaṇāmetvā jīvitasaṅkhāraṃ adhiṭṭhāya vihāsi. (Atha kho bhagavato so ābādho paṭippassambhi) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[( ) dī. ni. 2.164 dissati]"
      },
      "."
    ],
    "innerText": "Atha kho bhagavato vassūpagatassa kharo ābādho uppajji, bāḷhā vedanā vattanti māraṇantikā. Tatra sudaṃ bhagavā sato sampajāno adhivāsesi avihaññamāno. Atha kho bhagavato etadahosi – ‘‘na kho me taṃ patirūpaṃ, yohaṃ anāmantetvā upaṭṭhāke anapaloketvā bhikkhusaṅghaṃ parinibbāyeyyaṃ. Yaṃnūnāhaṃ imaṃ ābādhaṃ vīriyena paṭipaṇāmetvā jīvitasaṅkhāraṃ adhiṭṭhāya vihareyya’’nti. Atha kho bhagavā taṃ ābādhaṃ vīriyena paṭipaṇāmetvā jīvitasaṅkhāraṃ adhiṭṭhāya vihāsi. (Atha kho bhagavato so ābādho paṭippassambhi) [( ) dī. ni. 2.164 dissati]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā gilānā vuṭṭhito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gilānavuṭṭhito (saddanīti)]"
      },
      " aciravuṭṭhito gelaññā vihārā nikkhamitvā vihārapacchāyāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vihārapacchāchāyāyaṃ (bahūsu)]"
      },
      " paññatte āsane nisīdi. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ ",
      " etadavoca – ‘‘diṭṭho me, bhante, bhagavato phāsu; diṭṭhaṃ, bhante, bhagavato khamanīyaṃ; diṭṭhaṃ, bhante, bhagavato yāpanīyaṃ. Api ca me, bhante, madhurakajāto viya kāyo, disāpi me na pakkhāyanti, dhammāpi maṃ nappaṭibhanti bhagavato gelaññena. Api ca me, bhante, ahosi kācideva assāsamattā – ‘na tāva bhagavā parinibbāyissati, na yāva bhagavā bhikkhusaṅghaṃ ārabbha kiñcideva udāharatī’’’ti."
    ],
    "innerText": "Atha kho bhagavā gilānā vuṭṭhito [gilānavuṭṭhito (saddanīti)] aciravuṭṭhito gelaññā vihārā nikkhamitvā vihārapacchāyāyaṃ [vihārapacchāchāyāyaṃ (bahūsu)] paññatte āsane nisīdi. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘diṭṭho me, bhante, bhagavato phāsu; diṭṭhaṃ, bhante, bhagavato khamanīyaṃ; diṭṭhaṃ, bhante, bhagavato yāpanīyaṃ. Api ca me, bhante, madhurakajāto viya kāyo, disāpi me na pakkhāyanti, dhammāpi maṃ nappaṭibhanti bhagavato gelaññena. Api ca me, bhante, ahosi kācideva assāsamattā – ‘na tāva bhagavā parinibbāyissati, na yāva bhagavā bhikkhusaṅghaṃ ārabbha kiñcideva udāharatī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiṃ pana dāni, ānanda, bhikkhusaṅgho mayi paccāsīsati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paccāsiṃsati (sī. syā. kaṃ. pī.)]"
      },
      "? Desito, ānanda, mayā dhammo anantaraṃ abāhiraṃ karitvā. Natthānanda, tathāgatassa dhammesu ācariyamuṭṭhi. Yassa nūna, ānanda, evamassa – ‘ahaṃ bhikkhusaṅghaṃ pariharissāmī’ti vā, ‘mamuddesiko bhikkhusaṅgho’ti vā, so nūna, ānanda, bhikkhusaṅghaṃ ārabbha kiñcideva udāhareyya. Tathāgatassa kho, ānanda, na evaṃ hoti – ‘ahaṃ bhikkhusaṅghaṃ pariharissāmī’ti vā ",
      ", ‘mamuddesiko bhikkhusaṅgho’ti vā. Sa kiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[so nūna (sī. pī.)]"
      },
      ", ānanda, tathāgato bhikkhusaṅghaṃ ārabbha kiñcideva udāharissati! Etarahi kho panāhaṃ, ānanda, jiṇṇo vuddho mahallako addhagato vayoanuppatto. Āsītiko me vayo vattati. Seyyathāpi, ānanda, jajjarasakaṭaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[jarasakaṭaṃ (sabbattha)]"
      },
      " veḷamissakena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vegamissakena (sī.), veḷumissakena (syā. kaṃ.), vedhamissakena (pī. ka.), vekhamissakena (ka.)]"
      },
      " yāpeti; evameva kho, ānanda, vedhamissakena maññe tathāgatassa kāyo yāpeti."
    ],
    "innerText": "‘‘Kiṃ pana dāni, ānanda, bhikkhusaṅgho mayi paccāsīsati [paccāsiṃsati (sī. syā. kaṃ. pī.)]? Desito, ānanda, mayā dhammo anantaraṃ abāhiraṃ karitvā. Natthānanda, tathāgatassa dhammesu ācariyamuṭṭhi. Yassa nūna, ānanda, evamassa – ‘ahaṃ bhikkhusaṅghaṃ pariharissāmī’ti vā, ‘mamuddesiko bhikkhusaṅgho’ti vā, so nūna, ānanda, bhikkhusaṅghaṃ ārabbha kiñcideva udāhareyya. Tathāgatassa kho, ānanda, na evaṃ hoti – ‘ahaṃ bhikkhusaṅghaṃ pariharissāmī’ti vā , ‘mamuddesiko bhikkhusaṅgho’ti vā. Sa kiṃ [so nūna (sī. pī.)], ānanda, tathāgato bhikkhusaṅghaṃ ārabbha kiñcideva udāharissati! Etarahi kho panāhaṃ, ānanda, jiṇṇo vuddho mahallako addhagato vayoanuppatto. Āsītiko me vayo vattati. Seyyathāpi, ānanda, jajjarasakaṭaṃ [jarasakaṭaṃ (sabbattha)] veḷamissakena [vegamissakena (sī.), veḷumissakena (syā. kaṃ.), vedhamissakena (pī. ka.), vekhamissakena (ka.)] yāpeti; evameva kho, ānanda, vedhamissakena maññe tathāgatassa kāyo yāpeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yasmiṃ ",
      ", ānanda, samaye tathāgato sabbanimittānaṃ amanasikārā ekaccānaṃ vedanānaṃ nirodhā animittaṃ cetosamādhiṃ upasampajja viharati, phāsutaro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[phāsutaraṃ (sabbattha)]"
      },
      ", ānanda, tasmiṃ samaye tathāgatassa kāyo hoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tathāgatassa hoti (bahūsu)]"
      },
      ". Tasmātihānanda, attadīpā viharatha attasaraṇā anaññasaraṇā, dhammadīpā dhammasaraṇā anaññasaraṇā."
    ],
    "innerText": "‘‘Yasmiṃ , ānanda, samaye tathāgato sabbanimittānaṃ amanasikārā ekaccānaṃ vedanānaṃ nirodhā animittaṃ cetosamādhiṃ upasampajja viharati, phāsutaro [phāsutaraṃ (sabbattha)], ānanda, tasmiṃ samaye tathāgatassa kāyo hoti [tathāgatassa hoti (bahūsu)]. Tasmātihānanda, attadīpā viharatha attasaraṇā anaññasaraṇā, dhammadīpā dhammasaraṇā anaññasaraṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañcānanda, bhikkhu attadīpo viharati attasaraṇo anaññasaraṇo, dhammadīpo dhammasaraṇo anaññasaraṇo? Idhānanda, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno ",
      " satimā, vineyya loke abhijjhādomanassaṃ. Evaṃ kho, ānanda, bhikkhu attadīpo viharati attasaraṇo anaññasaraṇo, dhammadīpo dhammasaraṇo anaññasaraṇo. Ye hi keci, ānanda, etarahi vā mamaccaye vā attadīpā viharissanti attasaraṇā anaññasaraṇā, dhammadīpā dhammasaraṇā anaññasaraṇā ",
      "; tamatagge mete, ānanda, bhikkhū bhavissanti ye keci sikkhākāmā’’ti. Navamaṃ."
    ],
    "innerText": "‘‘Kathañcānanda, bhikkhu attadīpo viharati attasaraṇo anaññasaraṇo, dhammadīpo dhammasaraṇo anaññasaraṇo? Idhānanda, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Evaṃ kho, ānanda, bhikkhu attadīpo viharati attasaraṇo anaññasaraṇo, dhammadīpo dhammasaraṇo anaññasaraṇo. Ye hi keci, ānanda, etarahi vā mamaccaye vā attadīpā viharissanti attasaraṇā anaññasaraṇā, dhammadīpā dhammasaraṇā anaññasaraṇā ; tamatagge mete, ānanda, bhikkhū bhavissanti ye keci sikkhākāmā’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Bhikkhunupassayasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "376"
      },
      ". Atha kho āyasmā ānando pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena aññataro bhikkhunupassayo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho sambahulā bhikkhuniyo yenāyasmā ānando tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho tā bhikkhuniyo āyasmantaṃ ānandaṃ etadavocuṃ –"
    ],
    "innerText": "376. Atha kho āyasmā ānando pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena aññataro bhikkhunupassayo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho sambahulā bhikkhuniyo yenāyasmā ānando tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho tā bhikkhuniyo āyasmantaṃ ānandaṃ etadavocuṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha, bhante ānanda, sambahulā bhikkhuniyo catūsu satipaṭṭhānesu suppatiṭṭhitacittā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[supaṭṭhitacittā (sī. pī. ka.)]"
      },
      " viharantiyo uḷāraṃ pubbenāparaṃ visesaṃ sañjānantī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sampajānantīti (ka.)]"
      },
      ". ‘‘Evametaṃ ",
      ", bhaginiyo, evametaṃ, bhaginiyo! Yo hi koci, bhaginiyo, bhikkhu vā bhikkhunī vā catūsu satipaṭṭhānesu suppatiṭṭhitacitto viharati, tassetaṃ pāṭikaṅkhaṃ – ‘uḷāraṃ pubbenāparaṃ visesaṃ sañjānissatī’’’ti."
    ],
    "innerText": "‘‘Idha, bhante ānanda, sambahulā bhikkhuniyo catūsu satipaṭṭhānesu suppatiṭṭhitacittā [supaṭṭhitacittā (sī. pī. ka.)] viharantiyo uḷāraṃ pubbenāparaṃ visesaṃ sañjānantī’’ti [sampajānantīti (ka.)]. ‘‘Evametaṃ , bhaginiyo, evametaṃ, bhaginiyo! Yo hi koci, bhaginiyo, bhikkhu vā bhikkhunī vā catūsu satipaṭṭhānesu suppatiṭṭhitacitto viharati, tassetaṃ pāṭikaṅkhaṃ – ‘uḷāraṃ pubbenāparaṃ visesaṃ sañjānissatī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho āyasmā ānando tā bhikkhuniyo dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā uṭṭhāyāsanā pakkāmi. Atha kho āyasmā ānando sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto yena bhagavā tenupasaṅkamiṃ; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃ. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca –"
    ],
    "innerText": "Atha kho āyasmā ānando tā bhikkhuniyo dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā uṭṭhāyāsanā pakkāmi. Atha kho āyasmā ānando sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto yena bhagavā tenupasaṅkamiṃ; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃ. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idhāhaṃ, bhante, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena aññataro bhikkhunupassayo ",
      " tenupasaṅkamiṃ; upasaṅkamitvā paññatte āsane nisīdiṃ. Atha kho, bhante, sambahulā bhikkhuniyo yenāhaṃ tenupasaṅkamiṃsu; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ ",
      " nisinnā kho, bhante, tā bhikkhuniyo maṃ etadavocuṃ – ‘idha, bhante ānanda, sambahulā bhikkhuniyo catūsu satipaṭṭhānesu suppatiṭṭhitacittā viharantiyo uḷāraṃ pubbenāparaṃ visesaṃ sañjānantī’ti. Evaṃ vuttāhaṃ, bhante, tā bhikkhuniyo etadavocaṃ – ‘evametaṃ, bhaginiyo, evametaṃ, bhaginiyo! Yo hi koci, bhaginiyo, bhikkhu vā bhikkhunī vā catūsu satipaṭṭhānesu suppatiṭṭhitacitto viharati, tassetaṃ pāṭikaṅkhaṃ – uḷāraṃ pubbenāparaṃ visesaṃ sañjānissatī’’’ti."
    ],
    "innerText": "‘‘Idhāhaṃ, bhante, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena aññataro bhikkhunupassayo tenupasaṅkamiṃ; upasaṅkamitvā paññatte āsane nisīdiṃ. Atha kho, bhante, sambahulā bhikkhuniyo yenāhaṃ tenupasaṅkamiṃsu; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho, bhante, tā bhikkhuniyo maṃ etadavocuṃ – ‘idha, bhante ānanda, sambahulā bhikkhuniyo catūsu satipaṭṭhānesu suppatiṭṭhitacittā viharantiyo uḷāraṃ pubbenāparaṃ visesaṃ sañjānantī’ti. Evaṃ vuttāhaṃ, bhante, tā bhikkhuniyo etadavocaṃ – ‘evametaṃ, bhaginiyo, evametaṃ, bhaginiyo! Yo hi koci, bhaginiyo, bhikkhu vā bhikkhunī vā catūsu satipaṭṭhānesu suppatiṭṭhitacitto viharati, tassetaṃ pāṭikaṅkhaṃ – uḷāraṃ pubbenāparaṃ visesaṃ sañjānissatī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evametaṃ, ānanda, evametaṃ, ānanda! Yo hi koci, ānanda, bhikkhu vā bhikkhunī vā catūsu satipaṭṭhānesu suppatiṭṭhitacitto viharati, tassetaṃ pāṭikaṅkhaṃ – ‘uḷāraṃ pubbenāparaṃ visesaṃ sañjānissati’’’ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sañjānissatīti (bahūsu)]"
      },
      "."
    ],
    "innerText": "‘‘Evametaṃ, ānanda, evametaṃ, ānanda! Yo hi koci, ānanda, bhikkhu vā bhikkhunī vā catūsu satipaṭṭhānesu suppatiṭṭhitacitto viharati, tassetaṃ pāṭikaṅkhaṃ – ‘uḷāraṃ pubbenāparaṃ visesaṃ sañjānissati’’’ [sañjānissatīti (bahūsu)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamesu catūsu? Idhānanda, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa ",
      " kāye kāyānupassino viharato kāyārammaṇo vā uppajjati kāyasmiṃ pariḷāho, cetaso vā līnattaṃ, bahiddhā vā cittaṃ vikkhipati. Tenānanda ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tenahānanda (sī.)]"
      },
      ", bhikkhunā kismiñcideva pasādanīye nimitte cittaṃ paṇidahitabbaṃ. Tassa kismiñcideva pasādanīye nimitte cittaṃ paṇidahato ",
      " pāmojjaṃ jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedayati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vediyati (sī.)]"
      },
      ". Sukhino cittaṃ samādhiyati. So iti paṭisañcikkhati – ‘yassa khvāhaṃ atthāya cittaṃ paṇidahiṃ, so me attho ",
      " abhinipphanno. Handa, dāni paṭisaṃharāmī’ti. So paṭisaṃharati ceva na ca vitakketi na ca vicāreti. ‘Avitakkomhi avicāro, ajjhattaṃ satimā sukhamasmī’ti pajānāti’’."
    ],
    "innerText": "‘‘Katamesu catūsu? Idhānanda, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa kāye kāyānupassino viharato kāyārammaṇo vā uppajjati kāyasmiṃ pariḷāho, cetaso vā līnattaṃ, bahiddhā vā cittaṃ vikkhipati. Tenānanda [tenahānanda (sī.)], bhikkhunā kismiñcideva pasādanīye nimitte cittaṃ paṇidahitabbaṃ. Tassa kismiñcideva pasādanīye nimitte cittaṃ paṇidahato pāmojjaṃ jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedayati [vediyati (sī.)]. Sukhino cittaṃ samādhiyati. So iti paṭisañcikkhati – ‘yassa khvāhaṃ atthāya cittaṃ paṇidahiṃ, so me attho abhinipphanno. Handa, dāni paṭisaṃharāmī’ti. So paṭisaṃharati ceva na ca vitakketi na ca vicāreti. ‘Avitakkomhi avicāro, ajjhattaṃ satimā sukhamasmī’ti pajānāti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, ānanda, bhikkhu vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa dhammesu dhammānupassino viharato dhammārammaṇo vā uppajjati kāyasmiṃ pariḷāho, cetaso vā līnattaṃ, bahiddhā vā cittaṃ vikkhipati. Tenānanda, bhikkhunā kismiñcideva pasādanīye nimitte cittaṃ paṇidahitabbaṃ. Tassa kismiñcideva pasādanīye nimitte cittaṃ paṇidahato pāmojjaṃ jāyati ",
      ". Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedayati. Sukhino cittaṃ samādhiyati. So iti paṭisañcikkhati – ‘yassa khvāhaṃ atthāya cittaṃ paṇidahiṃ, so me attho abhinipphanno. Handa, dāni paṭisaṃharāmī’ti. So paṭisaṃharati ceva na ca vitakketi na ca vicāreti. ‘Avitakkomhi avicāro, ajjhattaṃ satimā sukhamasmī’ti pajānāti. Evaṃ kho, ānanda, paṇidhāya bhāvanā hoti."
    ],
    "innerText": "‘‘Puna caparaṃ, ānanda, bhikkhu vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa dhammesu dhammānupassino viharato dhammārammaṇo vā uppajjati kāyasmiṃ pariḷāho, cetaso vā līnattaṃ, bahiddhā vā cittaṃ vikkhipati. Tenānanda, bhikkhunā kismiñcideva pasādanīye nimitte cittaṃ paṇidahitabbaṃ. Tassa kismiñcideva pasādanīye nimitte cittaṃ paṇidahato pāmojjaṃ jāyati . Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedayati. Sukhino cittaṃ samādhiyati. So iti paṭisañcikkhati – ‘yassa khvāhaṃ atthāya cittaṃ paṇidahiṃ, so me attho abhinipphanno. Handa, dāni paṭisaṃharāmī’ti. So paṭisaṃharati ceva na ca vitakketi na ca vicāreti. ‘Avitakkomhi avicāro, ajjhattaṃ satimā sukhamasmī’ti pajānāti. Evaṃ kho, ānanda, paṇidhāya bhāvanā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañcānanda ",
      ", appaṇidhāya bhāvanā hoti? Bahiddhā ",
      ", ānanda, bhikkhu cittaṃ appaṇidhāya ‘appaṇihitaṃ me bahiddhā citta’nti pajānāti. Atha pacchāpure ‘asaṃkhittaṃ vimuttaṃ appaṇihita’nti pajānāti. Atha ca pana ‘kāye kāyānupassī viharāmi ātāpī sampajāno satimā sukhamasmī’ti pajānāti. Bahiddhā, ānanda, bhikkhu cittaṃ appaṇidhāya ‘appaṇihitaṃ me bahiddhā citta’nti pajānāti. Atha pacchāpure ‘asaṃkhittaṃ vimuttaṃ appaṇihita’nti pajānāti. Atha ca pana ‘vedanāsu vedanānupassī viharāmi ātāpī sampajāno satimā sukhamasmī’ti pajānāti. Bahiddhā, ānanda, bhikkhu cittaṃ appaṇidhāya ‘appaṇihitaṃ me bahiddhā citta’nti pajānāti. Atha pacchāpure ‘asaṃkhittaṃ vimuttaṃ appaṇihita’nti pajānāti. Atha ca pana ‘citte cittānupassī viharāmi ātāpī sampajāno satimā sukhamasmī’ti pajānāti. Bahiddhā, ānanda, bhikkhu cittaṃ appaṇidhāya ‘appaṇihitaṃ me bahiddhā citta’nti pajānāti. Atha pacchāpure ‘asaṃkhittaṃ vimuttaṃ appaṇihita’nti pajānāti. Atha ca pana ‘dhammesu dhammānupassī viharāmi ātāpī sampajāno satimā sukhamasmī’ti pajānāti. Evaṃ kho, ānanda, appaṇidhāya bhāvanā hoti."
    ],
    "innerText": "‘‘Kathañcānanda , appaṇidhāya bhāvanā hoti? Bahiddhā , ānanda, bhikkhu cittaṃ appaṇidhāya ‘appaṇihitaṃ me bahiddhā citta’nti pajānāti. Atha pacchāpure ‘asaṃkhittaṃ vimuttaṃ appaṇihita’nti pajānāti. Atha ca pana ‘kāye kāyānupassī viharāmi ātāpī sampajāno satimā sukhamasmī’ti pajānāti. Bahiddhā, ānanda, bhikkhu cittaṃ appaṇidhāya ‘appaṇihitaṃ me bahiddhā citta’nti pajānāti. Atha pacchāpure ‘asaṃkhittaṃ vimuttaṃ appaṇihita’nti pajānāti. Atha ca pana ‘vedanāsu vedanānupassī viharāmi ātāpī sampajāno satimā sukhamasmī’ti pajānāti. Bahiddhā, ānanda, bhikkhu cittaṃ appaṇidhāya ‘appaṇihitaṃ me bahiddhā citta’nti pajānāti. Atha pacchāpure ‘asaṃkhittaṃ vimuttaṃ appaṇihita’nti pajānāti. Atha ca pana ‘citte cittānupassī viharāmi ātāpī sampajāno satimā sukhamasmī’ti pajānāti. Bahiddhā, ānanda, bhikkhu cittaṃ appaṇidhāya ‘appaṇihitaṃ me bahiddhā citta’nti pajānāti. Atha pacchāpure ‘asaṃkhittaṃ vimuttaṃ appaṇihita’nti pajānāti. Atha ca pana ‘dhammesu dhammānupassī viharāmi ātāpī sampajāno satimā sukhamasmī’ti pajānāti. Evaṃ kho, ānanda, appaṇidhāya bhāvanā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Iti ",
      " kho, ānanda, desitā mayā paṇidhāya bhāvanā, desitā appaṇidhāya bhāvanā. Yaṃ, ānanda, satthārā karaṇīyaṃ sāvakānaṃ hitesinā ",
      " anukampakena anukampaṃ upādāya, kataṃ vo taṃ mayā. Etāni, ānanda, rukkhamūlāni, etāni suññāgārāni! Jhāyathānanda, mā pamādattha; mā pacchā vippaṭisārino ahuvattha! Ayaṃ vo amhākaṃ anusāsanī’’ti."
    ],
    "innerText": "‘‘Iti kho, ānanda, desitā mayā paṇidhāya bhāvanā, desitā appaṇidhāya bhāvanā. Yaṃ, ānanda, satthārā karaṇīyaṃ sāvakānaṃ hitesinā anukampakena anukampaṃ upādāya, kataṃ vo taṃ mayā. Etāni, ānanda, rukkhamūlāni, etāni suññāgārāni! Jhāyathānanda, mā pamādattha; mā pacchā vippaṭisārino ahuvattha! Ayaṃ vo amhākaṃ anusāsanī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Attamano āyasmā ānando bhagavato bhāsitaṃ abhinandīti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ambapālivaggo paṭhamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Ambapāli ",
      " sato bhikkhu, sālā kusalarāsi ca;"
    ],
    "innerText": "Ambapāli sato bhikkhu, sālā kusalarāsi ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sakuṇagdhi makkaṭo sūdo, gilāno bhikkhunupassayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Nālandavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Mahāpurisasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "377"
      },
      ". Sāvatthinidānaṃ ",
      ". Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘‘mahāpuriso, mahāpuriso’ti, bhante, vuccati. Kittāvatā nu kho, bhante, mahāpuriso hotī’’ti? ‘‘Vimuttacittattā khvāhaṃ, sāriputta, ‘mahāpuriso’ti vadāmi. Avimuttacittattā ‘no mahāpuriso’ti vadāmi’’."
    ],
    "innerText": "377. Sāvatthinidānaṃ . Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘‘mahāpuriso, mahāpuriso’ti, bhante, vuccati. Kittāvatā nu kho, bhante, mahāpuriso hotī’’ti? ‘‘Vimuttacittattā khvāhaṃ, sāriputta, ‘mahāpuriso’ti vadāmi. Avimuttacittattā ‘no mahāpuriso’ti vadāmi’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, sāriputta, vimuttacitto hoti? Idha, sāriputta, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa kāye kāyānupassino viharato cittaṃ virajjati, vimuccati anupādāya āsavehi. Vedanāsu…pe… citte…pe… ",
      " dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa dhammesu dhammānupassino viharato cittaṃ virajjati, vimuccati anupādāya āsavehi. Evaṃ kho, sāriputta, vimuttacitto hoti. Vimuttacittattā khvāhaṃ, sāriputta, ‘mahāpuriso’ti vadāmi. Avimuttacittattā ‘no mahāpuriso’ti vadāmī’’ti. Paṭhamaṃ."
    ],
    "innerText": "‘‘Kathañca, sāriputta, vimuttacitto hoti? Idha, sāriputta, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa kāye kāyānupassino viharato cittaṃ virajjati, vimuccati anupādāya āsavehi. Vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa dhammesu dhammānupassino viharato cittaṃ virajjati, vimuccati anupādāya āsavehi. Evaṃ kho, sāriputta, vimuttacitto hoti. Vimuttacittattā khvāhaṃ, sāriputta, ‘mahāpuriso’ti vadāmi. Avimuttacittattā ‘no mahāpuriso’ti vadāmī’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Nālandasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "378"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā nālandāyaṃ viharati pāvārikambavane. Atha ",
      " kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘evaṃpasanno ahaṃ, bhante, bhagavati! Na cāhu, na ",
      " ca bhavissati, na cetarahi vijjati añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro, yadidaṃ – sambodhiya’’nti. ‘‘Uḷārā kho tyāyaṃ, sāriputta, āsabhī vācā bhāsitā, ekaṃso gahito, sīhanādo nadito – ‘evaṃpasanno ahaṃ, bhante, bhagavati! Na cāhu, na ca bhavissati na cetarahi vijjati añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro, yadidaṃ – sambodhiya’’’nti."
    ],
    "innerText": "378. Ekaṃ samayaṃ bhagavā nālandāyaṃ viharati pāvārikambavane. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘evaṃpasanno ahaṃ, bhante, bhagavati! Na cāhu, na ca bhavissati, na cetarahi vijjati añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro, yadidaṃ – sambodhiya’’nti. ‘‘Uḷārā kho tyāyaṃ, sāriputta, āsabhī vācā bhāsitā, ekaṃso gahito, sīhanādo nadito – ‘evaṃpasanno ahaṃ, bhante, bhagavati! Na cāhu, na ca bhavissati na cetarahi vijjati añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro, yadidaṃ – sambodhiya’’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kiṃ nu te, sāriputta, ye te ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto cetasā ceto paricca viditā – ‘evaṃsīlā te bhagavanto ahesuṃ’ iti vā, ‘evaṃdhammā te bhagavanto ahesuṃ’ iti vā, ‘evaṃpaññā te bhagavanto ahesuṃ’ iti vā, ‘evaṃvihārino te bhagavanto ahesuṃ’ iti vā, ‘evaṃvimuttā te bhagavanto ahesuṃ’ iti vā’’ti? ‘‘No hetaṃ, bhante’’!"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiṃ pana te, sāriputta, ye te bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto cetasā ceto paricca viditā – ‘evaṃsīlā te bhagavanto bhavissanti’ iti vā, ‘evaṃdhammā te bhagavanto bhavissanti’ iti vā, ‘evaṃpaññā te bhagavanto bhavissanti’ iti vā, ‘evaṃvihārino te bhagavanto bhavissanti’ iti ",
      " vā, ‘evaṃvimuttā te bhagavanto bhavissanti’ iti vā’’ti? ‘‘No ",
      " hetaṃ, bhante’’."
    ],
    "innerText": "‘‘Kiṃ pana te, sāriputta, ye te bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto cetasā ceto paricca viditā – ‘evaṃsīlā te bhagavanto bhavissanti’ iti vā, ‘evaṃdhammā te bhagavanto bhavissanti’ iti vā, ‘evaṃpaññā te bhagavanto bhavissanti’ iti vā, ‘evaṃvihārino te bhagavanto bhavissanti’ iti vā, ‘evaṃvimuttā te bhagavanto bhavissanti’ iti vā’’ti? ‘‘No hetaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiṃ ",
      " pana tyāhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kiṃ pana te (sī.)]"
      },
      ", sāriputta, etarahi, arahaṃ sammāsambuddho cetasā ceto paricca vidito – ‘evaṃsīlo bhagavā’ iti vā, ‘evaṃdhammo bhagavā’ iti vā, ‘evaṃpañño bhagavā’ iti vā, ‘evaṃvihārī bhagavā’ iti vā, ‘evaṃvimutto bhagavā’ iti vā’’ti? ‘‘No hetaṃ, bhante’’."
    ],
    "innerText": "‘‘Kiṃ pana tyāhaṃ [kiṃ pana te (sī.)], sāriputta, etarahi, arahaṃ sammāsambuddho cetasā ceto paricca vidito – ‘evaṃsīlo bhagavā’ iti vā, ‘evaṃdhammo bhagavā’ iti vā, ‘evaṃpañño bhagavā’ iti vā, ‘evaṃvihārī bhagavā’ iti vā, ‘evaṃvimutto bhagavā’ iti vā’’ti? ‘‘No hetaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ettha ca te, sāriputta, atītānāgatapaccuppannesu arahantesu sammāsambuddhesu cetopariyañāṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cetopariyāyañāṇaṃ (bahūsu)]"
      },
      " natthi. Atha kiñcarahi tyāyaṃ, sāriputta, uḷārā āsabhī vācā bhāsitā, ekaṃso gahito, sīhanādo nadito – ‘evaṃpasanno ahaṃ, bhante, bhagavati! Na cāhu, na ca bhavissati, na cetarahi vijjati añño samaṇo vā brāhmaṇo vā bhagavatā’ bhiyyobhiññataro, yadidaṃ – sambodhiya’’nti?"
    ],
    "innerText": "‘‘Ettha ca te, sāriputta, atītānāgatapaccuppannesu arahantesu sammāsambuddhesu cetopariyañāṇaṃ [cetopariyāyañāṇaṃ (bahūsu)] natthi. Atha kiñcarahi tyāyaṃ, sāriputta, uḷārā āsabhī vācā bhāsitā, ekaṃso gahito, sīhanādo nadito – ‘evaṃpasanno ahaṃ, bhante, bhagavati! Na cāhu, na ca bhavissati, na cetarahi vijjati añño samaṇo vā brāhmaṇo vā bhagavatā’ bhiyyobhiññataro, yadidaṃ – sambodhiya’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na ",
      " kho me ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na kho me taṃ (syā. kaṃ. ka.)]"
      },
      ", bhante, atītānāgatapaccuppannesu arahantesu sammāsambuddhesu cetopariyañāṇaṃ atthi, api ca me dhammanvayo vidito. Seyyathāpi, bhante, rañño paccantimaṃ nagaraṃ daḷhuddhāpaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[daḷhuddāpaṃ (sī. pī. ka.), daḷhaddhāpaṃ (syā. kaṃ.)]"
      },
      " daḷhapākāratoraṇaṃ ekadvāraṃ. Tatrassa dovāriko paṇḍito byatto medhāvī aññātānaṃ nivāretā ñātānaṃ pavesetā. So tassa nagarassa samantā anupariyāyapathaṃ anukkamamāno na passeyya pākārasandhiṃ ",
      " vā pākāravivaraṃ vā, antamaso biḷāranikkhamanamattampi. Tassa evamassa – ‘ye kho keci oḷārikā pāṇā imaṃ nagaraṃ pavisanti vā nikkhamanti vā, sabbe te imināva dvārena pavisanti vā nikkhamanti vā’ti. Evameva kho me, bhante, dhammanvayo vidito – ‘yepi te, bhante, ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto pañca nīvaraṇe pahāya, cetaso upakkilese paññāya dubbalīkaraṇe, catūsu satipaṭṭhānesu suppatiṭṭhitacittā, satta bojjhaṅge yathābhūtaṃ bhāvetvā, anuttaraṃ sammāsambodhiṃ abhisambujjhiṃsu. Yepi te, bhante, bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto pañca nīvaraṇe pahāya, cetaso upakkilese paññāya dubbalīkaraṇe, catūsu satipaṭṭhānesu suppatiṭṭhitacittā, satta bojjhaṅge yathābhūtaṃ ",
      " bhāvetvā, anuttaraṃ sammāsambodhiṃ abhisambujjhissanti. Bhagavāpi, bhante, etarahi arahaṃ sammāsambuddho pañca nīvaraṇe pahāya, cetaso upakkilese paññāya dubbalīkaraṇe, catūsu satipaṭṭhānesu suppatiṭṭhitacitto, satta bojjhaṅge yathābhūtaṃ bhāvetvā, anuttaraṃ sammāsambodhiṃ abhisambuddho’’’ti."
    ],
    "innerText": "‘‘Na kho me [na kho me taṃ (syā. kaṃ. ka.)], bhante, atītānāgatapaccuppannesu arahantesu sammāsambuddhesu cetopariyañāṇaṃ atthi, api ca me dhammanvayo vidito. Seyyathāpi, bhante, rañño paccantimaṃ nagaraṃ daḷhuddhāpaṃ [daḷhuddāpaṃ (sī. pī. ka.), daḷhaddhāpaṃ (syā. kaṃ.)] daḷhapākāratoraṇaṃ ekadvāraṃ. Tatrassa dovāriko paṇḍito byatto medhāvī aññātānaṃ nivāretā ñātānaṃ pavesetā. So tassa nagarassa samantā anupariyāyapathaṃ anukkamamāno na passeyya pākārasandhiṃ vā pākāravivaraṃ vā, antamaso biḷāranikkhamanamattampi. Tassa evamassa – ‘ye kho keci oḷārikā pāṇā imaṃ nagaraṃ pavisanti vā nikkhamanti vā, sabbe te imināva dvārena pavisanti vā nikkhamanti vā’ti. Evameva kho me, bhante, dhammanvayo vidito – ‘yepi te, bhante, ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto pañca nīvaraṇe pahāya, cetaso upakkilese paññāya dubbalīkaraṇe, catūsu satipaṭṭhānesu suppatiṭṭhitacittā, satta bojjhaṅge yathābhūtaṃ bhāvetvā, anuttaraṃ sammāsambodhiṃ abhisambujjhiṃsu. Yepi te, bhante, bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto pañca nīvaraṇe pahāya, cetaso upakkilese paññāya dubbalīkaraṇe, catūsu satipaṭṭhānesu suppatiṭṭhitacittā, satta bojjhaṅge yathābhūtaṃ bhāvetvā, anuttaraṃ sammāsambodhiṃ abhisambujjhissanti. Bhagavāpi, bhante, etarahi arahaṃ sammāsambuddho pañca nīvaraṇe pahāya, cetaso upakkilese paññāya dubbalīkaraṇe, catūsu satipaṭṭhānesu suppatiṭṭhitacitto, satta bojjhaṅge yathābhūtaṃ bhāvetvā, anuttaraṃ sammāsambodhiṃ abhisambuddho’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu ",
      " sādhu, sāriputta! Tasmātiha tvaṃ, sāriputta, imaṃ dhammapariyāyaṃ abhikkhaṇaṃ bhāseyyāsi bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ. Yesampi hi, sāriputta, moghapurisānaṃ bhavissati tathāgate kaṅkhā ",
      " vā vimati vā, tesampimaṃ dhammapariyāyaṃ sutvā yā tathāgate kaṅkhā vā vimati vā sā pahīyissatī’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Sādhu sādhu, sāriputta! Tasmātiha tvaṃ, sāriputta, imaṃ dhammapariyāyaṃ abhikkhaṇaṃ bhāseyyāsi bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ. Yesampi hi, sāriputta, moghapurisānaṃ bhavissati tathāgate kaṅkhā vā vimati vā, tesampimaṃ dhammapariyāyaṃ sutvā yā tathāgate kaṅkhā vā vimati vā sā pahīyissatī’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Cundasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "379"
      },
      ". Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āyasmā sāriputto magadhesu ",
      " viharati nālakagāmake ābādhiko dukkhito bāḷhagilāno. Cundo ca samaṇuddeso āyasmato sāriputtassa upaṭṭhāko hoti."
    ],
    "innerText": "379. Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āyasmā sāriputto magadhesu viharati nālakagāmake ābādhiko dukkhito bāḷhagilāno. Cundo ca samaṇuddeso āyasmato sāriputtassa upaṭṭhāko hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmā sāriputto teneva ābādhena parinibbāyi. Atha kho cundo samaṇuddeso āyasmato sāriputtassa pattacīvaramādāya yena sāvatthi jetavanaṃ anāthapiṇḍikassa ārāmo yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho cundo samaṇuddeso ",
      " āyasmantaṃ ānandaṃ etadavoca – ‘‘āyasmā, bhante, sāriputto parinibbuto. Idamassa pattacīvara’’nti."
    ],
    "innerText": "Atha kho āyasmā sāriputto teneva ābādhena parinibbāyi. Atha kho cundo samaṇuddeso āyasmato sāriputtassa pattacīvaramādāya yena sāvatthi jetavanaṃ anāthapiṇḍikassa ārāmo yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho cundo samaṇuddeso āyasmantaṃ ānandaṃ etadavoca – ‘‘āyasmā, bhante, sāriputto parinibbuto. Idamassa pattacīvara’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Atthi kho idaṃ, āvuso cunda, kathāpābhataṃ bhagavantaṃ dassanāya. Āyāmāvuso cunda, yena bhagavā tenupasaṅkamissāma; upasaṅkamitvā bhagavato etamatthaṃ ārocessāmā’’ti. ‘‘Evaṃ, bhante’’ti kho cundo samaṇuddeso āyasmato ānandassa paccassosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmā ca ānando cundo ca samaṇuddeso yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ ",
      " etadavoca – ‘‘ayaṃ, bhante, cundo samaṇuddeso evamāha – ‘āyasmā, bhante, sāriputto parinibbuto; idamassa pattacīvara’nti. Api ca me, bhante, madhurakajāto viya kāyo, disāpi me na pakkhāyanti, dhammāpi maṃ nappaṭibhanti ‘āyasmā sāriputto parinibbuto’ti sutvā’’."
    ],
    "innerText": "Atha kho āyasmā ca ānando cundo ca samaṇuddeso yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘ayaṃ, bhante, cundo samaṇuddeso evamāha – ‘āyasmā, bhante, sāriputto parinibbuto; idamassa pattacīvara’nti. Api ca me, bhante, madhurakajāto viya kāyo, disāpi me na pakkhāyanti, dhammāpi maṃ nappaṭibhanti ‘āyasmā sāriputto parinibbuto’ti sutvā’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiṃ ",
      " nu kho te, ānanda, sāriputto sīlakkhandhaṃ vā ādāya parinibbuto, samādhikkhandhaṃ vā ādāya parinibbuto, paññākkhandhaṃ vā ādāya parinibbuto, vimuttikkhandhaṃ vā ādāya parinibbuto, vimuttiñāṇadassanakkhandhaṃ vā ādāya parinibbuto’’ti? ‘‘Na ca kho me, bhante, āyasmā sāriputto sīlakkhandhaṃ vā ādāya parinibbuto, samādhikkhandhaṃ vā…pe… paññākkhandhaṃ vā… vimuttikkhandhaṃ vā… vimuttiñāṇadassanakkhandhaṃ vā ādāya parinibbuto. Api ca me, bhante, āyasmā sāriputto ovādako ahosi otiṇṇo viññāpako sandassako samādapako samuttejako sampahaṃsako, akilāsu dhammadesanāya, anuggāhako sabrahmacārīnaṃ. Taṃ mayaṃ āyasmato sāriputtassa dhammojaṃ dhammabhogaṃ dhammānuggahaṃ anussarāmā’’ti."
    ],
    "innerText": "‘‘Kiṃ nu kho te, ānanda, sāriputto sīlakkhandhaṃ vā ādāya parinibbuto, samādhikkhandhaṃ vā ādāya parinibbuto, paññākkhandhaṃ vā ādāya parinibbuto, vimuttikkhandhaṃ vā ādāya parinibbuto, vimuttiñāṇadassanakkhandhaṃ vā ādāya parinibbuto’’ti? ‘‘Na ca kho me, bhante, āyasmā sāriputto sīlakkhandhaṃ vā ādāya parinibbuto, samādhikkhandhaṃ vā…pe… paññākkhandhaṃ vā… vimuttikkhandhaṃ vā… vimuttiñāṇadassanakkhandhaṃ vā ādāya parinibbuto. Api ca me, bhante, āyasmā sāriputto ovādako ahosi otiṇṇo viññāpako sandassako samādapako samuttejako sampahaṃsako, akilāsu dhammadesanāya, anuggāhako sabrahmacārīnaṃ. Taṃ mayaṃ āyasmato sāriputtassa dhammojaṃ dhammabhogaṃ dhammānuggahaṃ anussarāmā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Nanu ",
      " taṃ, ānanda, mayā paṭikacceva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṭigacceva (sī. pī.)]"
      },
      " akkhātaṃ – ‘sabbehi piyehi manāpehi nānābhāvo vinābhāvo aññathābhāvo ",
      ". Taṃ kutettha, ānanda, labbhā! Yaṃ taṃ jātaṃ bhūtaṃ saṅkhataṃ palokadhammaṃ, taṃ vata mā palujjīti – netaṃ ṭhānaṃ vijjati. Seyyathāpi, ānanda, mahato rukkhassa tiṭṭhato sāravato yo ",
      " mahantataro khandho so palujjeyya; evameva kho ānanda, mahato bhikkhusaṅghassa tiṭṭhato sāravato sāriputto parinibbuto. Taṃ kutettha, ānanda, labbhā! Yaṃ taṃ jātaṃ bhūtaṃ saṅkhataṃ palokadhammaṃ, taṃ vata mā palujjī’ti – netaṃ ṭhānaṃ vijjati. Tasmātihānanda, attadīpā viharatha attasaraṇā anaññasaraṇā, dhammadīpā dhammasaraṇā anaññasaraṇā."
    ],
    "innerText": "‘‘Nanu taṃ, ānanda, mayā paṭikacceva [paṭigacceva (sī. pī.)] akkhātaṃ – ‘sabbehi piyehi manāpehi nānābhāvo vinābhāvo aññathābhāvo . Taṃ kutettha, ānanda, labbhā! Yaṃ taṃ jātaṃ bhūtaṃ saṅkhataṃ palokadhammaṃ, taṃ vata mā palujjīti – netaṃ ṭhānaṃ vijjati. Seyyathāpi, ānanda, mahato rukkhassa tiṭṭhato sāravato yo mahantataro khandho so palujjeyya; evameva kho ānanda, mahato bhikkhusaṅghassa tiṭṭhato sāravato sāriputto parinibbuto. Taṃ kutettha, ānanda, labbhā! Yaṃ taṃ jātaṃ bhūtaṃ saṅkhataṃ palokadhammaṃ, taṃ vata mā palujjī’ti – netaṃ ṭhānaṃ vijjati. Tasmātihānanda, attadīpā viharatha attasaraṇā anaññasaraṇā, dhammadīpā dhammasaraṇā anaññasaraṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañcānanda, bhikkhu attadīpo viharati attasaraṇo anaññasaraṇo, dhammadīpo dhammasaraṇo anaññasaraṇo? Idhānanda, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Evaṃ kho, ānanda, bhikkhu attadīpo viharati attasaraṇo anaññasaraṇo, dhammadīpo dhammasaraṇo anaññasaraṇo. Ye hi keci, ānanda, etarahi vā mamaccaye vā attadīpā viharissanti attasaraṇā anaññasaraṇā, dhammadīpā dhammasaraṇā anaññasaraṇā; tamatagge mete, ānanda, bhikkhū bhavissanti ye keci sikkhākāmā’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Ukkacelasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "380"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā vajjīsu viharati ukkacelāyaṃ gaṅgāya nadiyā tīre mahatā bhikkhusaṅghena saddhiṃ aciraparinibbutesu sāriputtamoggallānesu. Tena kho pana samayena bhagavā bhikkhusaṅghaparivuto ajjhokāse ",
      " nisinno hoti."
    ],
    "innerText": "380. Ekaṃ samayaṃ bhagavā vajjīsu viharati ukkacelāyaṃ gaṅgāya nadiyā tīre mahatā bhikkhusaṅghena saddhiṃ aciraparinibbutesu sāriputtamoggallānesu. Tena kho pana samayena bhagavā bhikkhusaṅghaparivuto ajjhokāse nisinno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā tuṇhībhūtaṃ bhikkhusaṅghaṃ anuviloketvā bhikkhū āmantesi – ‘‘api ",
      " myāyaṃ, bhikkhave, parisā suññā viya khāyati parinibbutesu sāriputtamoggallānesu. Asuññā me, bhikkhave, parisā hoti ",
      ", anapekkhā tassaṃ disāyaṃ hoti, yassaṃ disāyaṃ sāriputtamoggallānā viharanti. Ye hi te, bhikkhave, ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā, tesampi bhagavantānaṃ etapparamaṃyeva sāvakayugaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[etaparamaṃyeva (sī. syā. kaṃ. pī.)]"
      },
      " ahosi – seyyathāpi mayhaṃ sāriputtamoggallānā. Yepi te, bhikkhave, bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā, tesampi bhagavantānaṃ etapparamaṃyeva sāvakayugaṃ bhavissati – seyyathāpi mayhaṃ sāriputtamoggallānā. Acchariyaṃ, bhikkhave, sāvakānaṃ! Abbhutaṃ, bhikkhave, sāvakānaṃ! Satthu ca nāma sāsanakarā bhavissanti ovādappaṭikarā, catunnañca parisānaṃ piyā bhavissanti manāpā garubhāvanīyā ca! Acchariyaṃ, bhikkhave, tathāgatassa, abbhutaṃ, bhikkhave, tathāgatassa! Evarūpepi nāma sāvakayuge parinibbute natthi tathāgatassa soko vā paridevo vā! Taṃ kutettha, bhikkhave, labbhā! Yaṃ taṃ jātaṃ bhūtaṃ saṅkhataṃ palokadhammaṃ, taṃ vata mā palujjīti – netaṃ ṭhānaṃ vijjati. Seyyathāpi, bhikkhave, mahato rukkhassa tiṭṭhato sāravato ye mahantatarā khandhā te palujjeyyuṃ; evameva kho, bhikkhave, mahato ",
      " bhikkhusaṅghassa tiṭṭhato sāravato sāriputtamoggallānā parinibbutā. Taṃ kutettha, bhikkhave, labbhā! Yaṃ taṃ jātaṃ bhūtaṃ saṅkhataṃ palokadhammaṃ, taṃ vata mā palujjīti – netaṃ ṭhānaṃ vijjati. Tasmātiha, bhikkhave, attadīpā viharatha attasaraṇā anaññasaraṇā, dhammadīpā dhammasaraṇā anaññasaraṇā."
    ],
    "innerText": "Atha kho bhagavā tuṇhībhūtaṃ bhikkhusaṅghaṃ anuviloketvā bhikkhū āmantesi – ‘‘api myāyaṃ, bhikkhave, parisā suññā viya khāyati parinibbutesu sāriputtamoggallānesu. Asuññā me, bhikkhave, parisā hoti , anapekkhā tassaṃ disāyaṃ hoti, yassaṃ disāyaṃ sāriputtamoggallānā viharanti. Ye hi te, bhikkhave, ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā, tesampi bhagavantānaṃ etapparamaṃyeva sāvakayugaṃ [etaparamaṃyeva (sī. syā. kaṃ. pī.)] ahosi – seyyathāpi mayhaṃ sāriputtamoggallānā. Yepi te, bhikkhave, bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā, tesampi bhagavantānaṃ etapparamaṃyeva sāvakayugaṃ bhavissati – seyyathāpi mayhaṃ sāriputtamoggallānā. Acchariyaṃ, bhikkhave, sāvakānaṃ! Abbhutaṃ, bhikkhave, sāvakānaṃ! Satthu ca nāma sāsanakarā bhavissanti ovādappaṭikarā, catunnañca parisānaṃ piyā bhavissanti manāpā garubhāvanīyā ca! Acchariyaṃ, bhikkhave, tathāgatassa, abbhutaṃ, bhikkhave, tathāgatassa! Evarūpepi nāma sāvakayuge parinibbute natthi tathāgatassa soko vā paridevo vā! Taṃ kutettha, bhikkhave, labbhā! Yaṃ taṃ jātaṃ bhūtaṃ saṅkhataṃ palokadhammaṃ, taṃ vata mā palujjīti – netaṃ ṭhānaṃ vijjati. Seyyathāpi, bhikkhave, mahato rukkhassa tiṭṭhato sāravato ye mahantatarā khandhā te palujjeyyuṃ; evameva kho, bhikkhave, mahato bhikkhusaṅghassa tiṭṭhato sāravato sāriputtamoggallānā parinibbutā. Taṃ kutettha, bhikkhave, labbhā! Yaṃ taṃ jātaṃ bhūtaṃ saṅkhataṃ palokadhammaṃ, taṃ vata mā palujjīti – netaṃ ṭhānaṃ vijjati. Tasmātiha, bhikkhave, attadīpā viharatha attasaraṇā anaññasaraṇā, dhammadīpā dhammasaraṇā anaññasaraṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu attadīpo viharati attasaraṇo anaññasaraṇo, dhammadīpo dhammasaraṇo anaññasaraṇo? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī ",
      " viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Evaṃ kho, bhikkhave, bhikkhu attadīpo viharati attasaraṇo anaññasaraṇo, dhammadīpo dhammasaraṇo anaññasaraṇo. Ye ",
      " hi keci, bhikkhave, etarahi vā mamaccaye vā attadīpā viharissanti attasaraṇā anaññasaraṇā, dhammadīpā dhammasaraṇā anaññasaraṇā; tamatagge mete, bhikkhave, bhikkhū bhavissanti ye keci sikkhākāmā’’ti. Catutthaṃ."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu attadīpo viharati attasaraṇo anaññasaraṇo, dhammadīpo dhammasaraṇo anaññasaraṇo? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Evaṃ kho, bhikkhave, bhikkhu attadīpo viharati attasaraṇo anaññasaraṇo, dhammadīpo dhammasaraṇo anaññasaraṇo. Ye hi keci, bhikkhave, etarahi vā mamaccaye vā attadīpā viharissanti attasaraṇā anaññasaraṇā, dhammadīpā dhammasaraṇā anaññasaraṇā; tamatagge mete, bhikkhave, bhikkhū bhavissanti ye keci sikkhākāmā’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Bāhiyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "381"
      },
      ". Sāvatthinidānaṃ ",
      ". Atha kho āyasmā bāhiyo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā bāhiyo bhagavantaṃ etadavoca – ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ ",
      " sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Tasmātiha tvaṃ, bāhiya, ādimeva visodhehi kusalesu dhammesu. Ko cādi kusalānaṃ dhammānaṃ? Sīlañca suvisuddhaṃ, diṭṭhi ca ujukā. Yato ca kho te, bāhiya, sīlañca suvisuddhaṃ bhavissati, diṭṭhi ca ujukā, tato tvaṃ, bāhiya, sīlaṃ nissāya sīle patiṭṭhāya cattāro satipaṭṭhāne bhāveyyāsi’’."
    ],
    "innerText": "381. Sāvatthinidānaṃ . Atha kho āyasmā bāhiyo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā bāhiyo bhagavantaṃ etadavoca – ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Tasmātiha tvaṃ, bāhiya, ādimeva visodhehi kusalesu dhammesu. Ko cādi kusalānaṃ dhammānaṃ? Sīlañca suvisuddhaṃ, diṭṭhi ca ujukā. Yato ca kho te, bāhiya, sīlañca suvisuddhaṃ bhavissati, diṭṭhi ca ujukā, tato tvaṃ, bāhiya, sīlaṃ nissāya sīle patiṭṭhāya cattāro satipaṭṭhāne bhāveyyāsi’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame cattāro? Idha, tvaṃ, bāhiya, kāye kāyānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Yato kho tvaṃ, bāhiya, sīlaṃ nissāya sīle patiṭṭhāya ime cattāro satipaṭṭhāne evaṃ bhāvessasi, tato tuyhaṃ, bāhiya, yā ratti vā divaso vā āgamissati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihānī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho āyasmā bāhiyo bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho āyasmā bāhiyo eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva ",
      " agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi ",
      ". ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā bāhiyo arahataṃ ahosīti. Pañcamaṃ."
    ],
    "innerText": "Atha kho āyasmā bāhiyo bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho āyasmā bāhiyo eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi . ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā bāhiyo arahataṃ ahosīti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Uttiyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "382"
      },
      ". Sāvatthinidānaṃ. Atha kho āyasmā uttiyo yena bhagavā tenupasaṅkami…pe… ekamantaṃ nisinno kho āyasmā uttiyo bhagavantaṃ etadavoca – ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato ",
      " dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Tasmātiha tvaṃ, uttiya, ādimeva visodhehi kusalesu dhammesu. Ko cādi kusalānaṃ dhammānaṃ? Sīlañca suvisuddhaṃ, diṭṭhi ca ujukā. Yato ca kho te, uttiya, sīlañca suvisuddhaṃ bhavissati, diṭṭhi ca ujukā, tato tvaṃ, uttiya, sīlaṃ nissāya sīle patiṭṭhāya cattāro satipaṭṭhāne bhāveyyāsi’’."
    ],
    "innerText": "382. Sāvatthinidānaṃ. Atha kho āyasmā uttiyo yena bhagavā tenupasaṅkami…pe… ekamantaṃ nisinno kho āyasmā uttiyo bhagavantaṃ etadavoca – ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Tasmātiha tvaṃ, uttiya, ādimeva visodhehi kusalesu dhammesu. Ko cādi kusalānaṃ dhammānaṃ? Sīlañca suvisuddhaṃ, diṭṭhi ca ujukā. Yato ca kho te, uttiya, sīlañca suvisuddhaṃ bhavissati, diṭṭhi ca ujukā, tato tvaṃ, uttiya, sīlaṃ nissāya sīle patiṭṭhāya cattāro satipaṭṭhāne bhāveyyāsi’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame cattāro? Idha tvaṃ, uttiya, kāye kāyānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Yato kho tvaṃ, uttiya, sīlaṃ nissāya sīle patiṭṭhāya ime cattāro satipaṭṭhāne evaṃ bhāvessasi, tato tvaṃ, uttiya, gamissasi maccudheyyassa pāra’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmā uttiyo bhagavato bhāsitaṃ abhinanditvā anumoditvā ",
      " uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho āyasmā uttiyo eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā uttiyo arahataṃ ahosīti. Chaṭṭhaṃ."
    ],
    "innerText": "Atha kho āyasmā uttiyo bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho āyasmā uttiyo eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā uttiyo arahataṃ ahosīti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Ariyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "383"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave, satipaṭṭhānā bhāvitā bahulīkatā ariyā niyyānikā niyyanti takkarassa sammā dukkhakkhayāya. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ime ",
      " kho, bhikkhave, cattāro satipaṭṭhānā bhāvitā bahulīkatā ariyā niyyānikā niyyanti takkarassa sammā dukkhakkhayāyā’’ti. Sattamaṃ."
    ],
    "innerText": "383. ‘‘Cattārome , bhikkhave, satipaṭṭhānā bhāvitā bahulīkatā ariyā niyyānikā niyyanti takkarassa sammā dukkhakkhayāya. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ime kho, bhikkhave, cattāro satipaṭṭhānā bhāvitā bahulīkatā ariyā niyyānikā niyyanti takkarassa sammā dukkhakkhayāyā’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Brahmasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "384"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā uruvelāyaṃ viharati najjā nerañjarāya tīre ajapālanigrodhe paṭhamābhisambuddho. Atha kho bhagavato rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘ekāyano ayaṃ maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ ",
      " atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ – cattāro satipaṭṭhānā’’."
    ],
    "innerText": "384. Ekaṃ samayaṃ bhagavā uruvelāyaṃ viharati najjā nerañjarāya tīre ajapālanigrodhe paṭhamābhisambuddho. Atha kho bhagavato rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘ekāyano ayaṃ maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ – cattāro satipaṭṭhānā’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame cattāro? Kāye vā bhikkhu kāyānupassī vihareyya ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu vā bhikkhu…pe… citte vā bhikkhu…pe… dhammesu vā bhikkhu dhammānupassī vihareyya ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ekāyano ayaṃ maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ – cattāro satipaṭṭhānā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho brahmā sahampati bhagavato cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā ",
      " puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva – brahmaloke antarahito bhagavato purato pāturahosi. Atha kho brahmā sahampati ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘evametaṃ, bhagavā, evametaṃ, sugata! Ekāyano ayaṃ, bhante, maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ – cattāro satipaṭṭhānā’’ ",
      "."
    ],
    "innerText": "Atha kho brahmā sahampati bhagavato cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva – brahmaloke antarahito bhagavato purato pāturahosi. Atha kho brahmā sahampati ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘evametaṃ, bhagavā, evametaṃ, sugata! Ekāyano ayaṃ, bhante, maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ – cattāro satipaṭṭhānā’’ ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame cattāro? Kāye vā, bhante, bhikkhu kāyānupassī vihareyya ātāpī sampajāno satimā ",
      ", vineyya loke abhijjhādomanassaṃ; vedanāsu vā, bhante, bhikkhu…pe… citte vā, bhante, bhikkhu…pe… dhammesu vā, bhante, bhikkhu dhammānupassī vihareyya ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ekāyano ayaṃ, bhante, maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ",
      " ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ – cattāro satipaṭṭhānā’’ti."
    ],
    "innerText": "‘‘Katame cattāro? Kāye vā, bhante, bhikkhu kāyānupassī vihareyya ātāpī sampajāno satimā , vineyya loke abhijjhādomanassaṃ; vedanāsu vā, bhante, bhikkhu…pe… citte vā, bhante, bhikkhu…pe… dhammesu vā, bhante, bhikkhu dhammānupassī vihareyya ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ekāyano ayaṃ, bhante, maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ – cattāro satipaṭṭhānā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca brahmā sahampati. Idaṃ vatvā athāparaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ekāyanaṃ jātikhayantadassī, maggaṃ pajānāti hitānukampī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etena maggena tariṃsu pubbe, tarissanti ye ca taranti ogha’’nti. aṭṭhamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Sedakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "385"
      },
      ". Ekaṃ samayaṃ bhagavā sumbhesu viharati sedakaṃ nāma sumbhānaṃ nigamo. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhūtapubbaṃ, bhikkhave, caṇḍālavaṃsiko caṇḍālavaṃsaṃ ussāpetvā medakathālikaṃ antevāsiṃ āmantesi – ‘ehi tvaṃ, samma medakathālike, caṇḍālavaṃsaṃ abhiruhitvā mama uparikhandhe tiṭṭhāhī’ti. ‘Evaṃ, ācariyā’ti kho, bhikkhave, medakathālikā antevāsī caṇḍālavaṃsikassa paṭissutvā caṇḍālavaṃsaṃ abhiruhitvā ācariyassa uparikhandhe aṭṭhāsi. Atha kho, bhikkhave, caṇḍālavaṃsiko medakathālikaṃ antevāsiṃ etadavoca – ‘tvaṃ, samma ",
      " medakathālike, mamaṃ rakkha, ahaṃ taṃ rakkhissāmi. Evaṃ mayaṃ aññamaññaṃ ",
      " guttā aññamaññaṃ rakkhitā ",
      " sippāni ceva dassessāma, lābhañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[lābhe ca (sī.)]"
      },
      " lacchāma, sotthinā ca caṇḍālavaṃsā orohissāmā’ti. Evaṃ vutte, bhikkhave, medakathālikā antevāsī caṇḍālavaṃsikaṃ etadavoca – ‘na kho panetaṃ, ācariya, evaṃ bhavissati. Tvaṃ, ācariya, attānaṃ rakkha, ahaṃ attānaṃ rakkhissāmi. Evaṃ mayaṃ attaguttā attarakkhitā sippāni ceva dassessāma, lābhañca lacchāma, sotthinā ca caṇḍālavaṃsā orohissāmā’’’ti. ‘‘So tattha ñāyo’’ti bhagavā etadavoca, ‘‘yathā medakathālikā antevāsī ācariyaṃ avoca. Attānaṃ, bhikkhave, rakkhissāmīti satipaṭṭhānaṃ sevitabbaṃ; paraṃ rakkhissāmīti satipaṭṭhānaṃ sevitabbaṃ. Attānaṃ, bhikkhave, rakkhanto paraṃ rakkhati, paraṃ rakkhanto attānaṃ rakkhati’’."
    ],
    "innerText": "385. Ekaṃ samayaṃ bhagavā sumbhesu viharati sedakaṃ nāma sumbhānaṃ nigamo. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhūtapubbaṃ, bhikkhave, caṇḍālavaṃsiko caṇḍālavaṃsaṃ ussāpetvā medakathālikaṃ antevāsiṃ āmantesi – ‘ehi tvaṃ, samma medakathālike, caṇḍālavaṃsaṃ abhiruhitvā mama uparikhandhe tiṭṭhāhī’ti. ‘Evaṃ, ācariyā’ti kho, bhikkhave, medakathālikā antevāsī caṇḍālavaṃsikassa paṭissutvā caṇḍālavaṃsaṃ abhiruhitvā ācariyassa uparikhandhe aṭṭhāsi. Atha kho, bhikkhave, caṇḍālavaṃsiko medakathālikaṃ antevāsiṃ etadavoca – ‘tvaṃ, samma medakathālike, mamaṃ rakkha, ahaṃ taṃ rakkhissāmi. Evaṃ mayaṃ aññamaññaṃ guttā aññamaññaṃ rakkhitā sippāni ceva dassessāma, lābhañca [lābhe ca (sī.)] lacchāma, sotthinā ca caṇḍālavaṃsā orohissāmā’ti. Evaṃ vutte, bhikkhave, medakathālikā antevāsī caṇḍālavaṃsikaṃ etadavoca – ‘na kho panetaṃ, ācariya, evaṃ bhavissati. Tvaṃ, ācariya, attānaṃ rakkha, ahaṃ attānaṃ rakkhissāmi. Evaṃ mayaṃ attaguttā attarakkhitā sippāni ceva dassessāma, lābhañca lacchāma, sotthinā ca caṇḍālavaṃsā orohissāmā’’’ti. ‘‘So tattha ñāyo’’ti bhagavā etadavoca, ‘‘yathā medakathālikā antevāsī ācariyaṃ avoca. Attānaṃ, bhikkhave, rakkhissāmīti satipaṭṭhānaṃ sevitabbaṃ; paraṃ rakkhissāmīti satipaṭṭhānaṃ sevitabbaṃ. Attānaṃ, bhikkhave, rakkhanto paraṃ rakkhati, paraṃ rakkhanto attānaṃ rakkhati’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, attānaṃ rakkhanto paraṃ rakkhati? Āsevanāya, bhāvanāya, bahulīkammena – evaṃ kho, bhikkhave, attānaṃ rakkhanto paraṃ rakkhati. Kathañca, bhikkhave, paraṃ rakkhanto attānaṃ rakkhati? Khantiyā, avihiṃsāya, mettacittatāya, anudayatāya – evaṃ kho, bhikkhave, paraṃ rakkhanto attānaṃ rakkhati. Attānaṃ, bhikkhave, rakkhissāmīti satipaṭṭhānaṃ sevitabbaṃ; paraṃ rakkhissāmīti satipaṭṭhānaṃ sevitabbaṃ. Attānaṃ, bhikkhave, rakkhanto paraṃ rakkhati, paraṃ rakkhanto attānaṃ rakkhatī’’ti. Navamaṃ."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, attānaṃ rakkhanto paraṃ rakkhati? Āsevanāya, bhāvanāya, bahulīkammena – evaṃ kho, bhikkhave, attānaṃ rakkhanto paraṃ rakkhati. Kathañca, bhikkhave, paraṃ rakkhanto attānaṃ rakkhati? Khantiyā, avihiṃsāya, mettacittatāya, anudayatāya – evaṃ kho, bhikkhave, paraṃ rakkhanto attānaṃ rakkhati. Attānaṃ, bhikkhave, rakkhissāmīti satipaṭṭhānaṃ sevitabbaṃ; paraṃ rakkhissāmīti satipaṭṭhānaṃ sevitabbaṃ. Attānaṃ, bhikkhave, rakkhanto paraṃ rakkhati, paraṃ rakkhanto attānaṃ rakkhatī’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Janapadakalyāṇīsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "386"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sumbhesu viharati sedakaṃ nāma sumbhānaṃ nigamo. Tatra ",
      " kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "386. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sumbhesu viharati sedakaṃ nāma sumbhānaṃ nigamo. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, ‘janapadakalyāṇī, janapadakalyāṇī’ti kho, bhikkhave, mahājanakāyo sannipateyya. ‘Sā kho panassa janapadakalyāṇī paramapāsāvinī nacce, paramapāsāvinī gīte. Janapadakalyāṇī naccati gāyatī’ti kho, bhikkhave, bhiyyosomattāya mahājanakāyo ",
      " sannipateyya. Atha puriso āgaccheyya jīvitukāmo amaritukāmo sukhakāmo dukkhappaṭikūlo. Tamenaṃ evaṃ vadeyya – ‘ayaṃ te, ambho purisa, samatittiko telapatto antarena ca mahāsamajjaṃ antarena ca janapadakalyāṇiyā pariharitabbo. Puriso ca te ukkhittāsiko piṭṭhito piṭṭhito anubandhissati. Yattheva naṃ thokampi chaḍḍessati tattheva te siro pātessatī’ti. Taṃ kiṃ maññatha, bhikkhave, api nu so puriso amuṃ telapattaṃ amanasikaritvā bahiddhā pamādaṃ āhareyyā’’ti? ‘‘No hetaṃ, bhante’’."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, ‘janapadakalyāṇī, janapadakalyāṇī’ti kho, bhikkhave, mahājanakāyo sannipateyya. ‘Sā kho panassa janapadakalyāṇī paramapāsāvinī nacce, paramapāsāvinī gīte. Janapadakalyāṇī naccati gāyatī’ti kho, bhikkhave, bhiyyosomattāya mahājanakāyo sannipateyya. Atha puriso āgaccheyya jīvitukāmo amaritukāmo sukhakāmo dukkhappaṭikūlo. Tamenaṃ evaṃ vadeyya – ‘ayaṃ te, ambho purisa, samatittiko telapatto antarena ca mahāsamajjaṃ antarena ca janapadakalyāṇiyā pariharitabbo. Puriso ca te ukkhittāsiko piṭṭhito piṭṭhito anubandhissati. Yattheva naṃ thokampi chaḍḍessati tattheva te siro pātessatī’ti. Taṃ kiṃ maññatha, bhikkhave, api nu so puriso amuṃ telapattaṃ amanasikaritvā bahiddhā pamādaṃ āhareyyā’’ti? ‘‘No hetaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Upamā kho myāyaṃ, bhikkhave, katā atthassa viññāpanāya. Ayaṃ cevettha attho – samatittiko telapattoti kho, bhikkhave, kāyagatāya etaṃ satiyā adhivacanaṃ. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘kāyagatā sati no bhāvitā ",
      " bhavissati bahulīkatā yānīkatā vatthukatā ",
      " anuṭṭhitā paricitā susamāraddhā’ti. Evañhi kho, bhikkhave, sikkhitabba’’nti. Dasamaṃ."
    ],
    "innerText": "‘‘Upamā kho myāyaṃ, bhikkhave, katā atthassa viññāpanāya. Ayaṃ cevettha attho – samatittiko telapattoti kho, bhikkhave, kāyagatāya etaṃ satiyā adhivacanaṃ. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘kāyagatā sati no bhāvitā bhavissati bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā’ti. Evañhi kho, bhikkhave, sikkhitabba’’nti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nālandavaggo dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Mahāpuriso ",
      " nālandaṃ, cundo celañca bāhiyo;"
    ],
    "innerText": "Mahāpuriso nālandaṃ, cundo celañca bāhiyo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uttiyo ariyo brahmā, sedakaṃ janapadena cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Sīlaṭṭhitivaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Sīlasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "387"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ āyasmā ca ānando āyasmā ca bhaddo pāṭaliputte viharanti kukkuṭārāme. Atha kho āyasmā bhaddo sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā bhaddo ",
      " āyasmantaṃ ānandaṃ etadavoca – ‘‘yānimāni, āvuso ānanda, kusalāni sīlāni vuttāni bhagavatā, imāni kusalāni sīlāni kimatthiyāni vuttāni bhagavatā’’ti?"
    ],
    "innerText": "387. Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā ca ānando āyasmā ca bhaddo pāṭaliputte viharanti kukkuṭārāme. Atha kho āyasmā bhaddo sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā bhaddo āyasmantaṃ ānandaṃ etadavoca – ‘‘yānimāni, āvuso ānanda, kusalāni sīlāni vuttāni bhagavatā, imāni kusalāni sīlāni kimatthiyāni vuttāni bhagavatā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu sādhu, āvuso bhadda! Bhaddako kho te, āvuso bhadda, ummaṅgo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ummaggo (sī. syā. kaṃ.)]"
      },
      ", bhaddakaṃ paṭibhānaṃ, kalyāṇī paripucchā. Evañhi tvaṃ, āvuso bhadda, pucchasi – ‘yānimāni āvuso ānanda, kusalāni sīlāni vuttāni bhagavatā, imāni kusalāni sīlāni kimatthiyāni vuttāni bhagavatā’’’ti? ‘‘Evamāvuso’’ti. ‘‘Yānimāni, āvuso bhadda, kusalāni sīlāni vuttāni bhagavatā, imāni kusalāni sīlāni yāvadeva catunnaṃ satipaṭṭhānānaṃ bhāvanāya vuttāni bhagavatā’’."
    ],
    "innerText": "‘‘Sādhu sādhu, āvuso bhadda! Bhaddako kho te, āvuso bhadda, ummaṅgo [ummaggo (sī. syā. kaṃ.)], bhaddakaṃ paṭibhānaṃ, kalyāṇī paripucchā. Evañhi tvaṃ, āvuso bhadda, pucchasi – ‘yānimāni āvuso ānanda, kusalāni sīlāni vuttāni bhagavatā, imāni kusalāni sīlāni kimatthiyāni vuttāni bhagavatā’’’ti? ‘‘Evamāvuso’’ti. ‘‘Yānimāni, āvuso bhadda, kusalāni sīlāni vuttāni bhagavatā, imāni kusalāni sīlāni yāvadeva catunnaṃ satipaṭṭhānānaṃ bhāvanāya vuttāni bhagavatā’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamesaṃ catunnaṃ? Idhāvuso, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ ",
      "; vedanāsu…pe… ",
      " citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Yānimāni ",
      ", āvuso bhadda, kusalāni sīlāni vuttāni bhagavatā, imāni kusalāni sīlāni yāvadeva imesaṃ catunnaṃ satipaṭṭhānānaṃ bhāvanāya vuttāni bhagavatā’’ti. Paṭhamaṃ."
    ],
    "innerText": "‘‘Katamesaṃ catunnaṃ? Idhāvuso, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Yānimāni , āvuso bhadda, kusalāni sīlāni vuttāni bhagavatā, imāni kusalāni sīlāni yāvadeva imesaṃ catunnaṃ satipaṭṭhānānaṃ bhāvanāya vuttāni bhagavatā’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Ciraṭṭhitisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "388"
      },
      ". Taṃyeva nidānaṃ. Ekamantaṃ nisinno kho āyasmā bhaddo āyasmantaṃ ānandaṃ etadavoca – ‘‘ko nu kho, āvuso ānanda, hetu, ko paccayo yena tathāgate parinibbute saddhammo na ciraṭṭhitiko hoti? Ko panāvuso ānanda, hetu, ko paccayo yena tathāgate parinibbute saddhammo ciraṭṭhitiko hotī’’ti?"
    ],
    "innerText": "388. Taṃyeva nidānaṃ. Ekamantaṃ nisinno kho āyasmā bhaddo āyasmantaṃ ānandaṃ etadavoca – ‘‘ko nu kho, āvuso ānanda, hetu, ko paccayo yena tathāgate parinibbute saddhammo na ciraṭṭhitiko hoti? Ko panāvuso ānanda, hetu, ko paccayo yena tathāgate parinibbute saddhammo ciraṭṭhitiko hotī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu sādhu, āvuso bhadda! Bhaddako kho te, āvuso bhadda, ummaṅgo, bhaddakaṃ paṭibhānaṃ, kalyāṇī paripucchā. Evañhi tvaṃ, āvuso bhadda, pucchasi – ‘ko nu kho, āvuso ānanda, hetu, ko paccayo yena tathāgate parinibbute saddhammo na ciraṭṭhitiko hoti? Ko panāvuso ānanda, hetu, ko paccayo yena tathāgate parinibbute saddhammo ciraṭṭhitiko ",
      " hotī’’’ti? ‘‘Evamāvuso’’ti. ‘‘Catunnaṃ kho, āvuso, satipaṭṭhānānaṃ abhāvitattā abahulīkatattā tathāgate parinibbute saddhammo na ciraṭṭhitiko hoti. Catunnañca kho, āvuso, satipaṭṭhānānaṃ bhāvitattā bahulīkatattā tathāgate parinibbute saddhammo ciraṭṭhitiko hoti’’."
    ],
    "innerText": "‘‘Sādhu sādhu, āvuso bhadda! Bhaddako kho te, āvuso bhadda, ummaṅgo, bhaddakaṃ paṭibhānaṃ, kalyāṇī paripucchā. Evañhi tvaṃ, āvuso bhadda, pucchasi – ‘ko nu kho, āvuso ānanda, hetu, ko paccayo yena tathāgate parinibbute saddhammo na ciraṭṭhitiko hoti? Ko panāvuso ānanda, hetu, ko paccayo yena tathāgate parinibbute saddhammo ciraṭṭhitiko hotī’’’ti? ‘‘Evamāvuso’’ti. ‘‘Catunnaṃ kho, āvuso, satipaṭṭhānānaṃ abhāvitattā abahulīkatattā tathāgate parinibbute saddhammo na ciraṭṭhitiko hoti. Catunnañca kho, āvuso, satipaṭṭhānānaṃ bhāvitattā bahulīkatattā tathāgate parinibbute saddhammo ciraṭṭhitiko hoti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamesaṃ catunnaṃ? Idhāvuso ",
      ", bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesaṃ kho, āvuso, catunnaṃ satipaṭṭhānānaṃ abhāvitattā abahulīkatattā tathāgate parinibbute saddhammo na ciraṭṭhitiko hoti. Imesañca kho, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā tathāgate parinibbute saddhammo ciraṭṭhitiko hotī’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Katamesaṃ catunnaṃ? Idhāvuso , bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesaṃ kho, āvuso, catunnaṃ satipaṭṭhānānaṃ abhāvitattā abahulīkatattā tathāgate parinibbute saddhammo na ciraṭṭhitiko hoti. Imesañca kho, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā tathāgate parinibbute saddhammo ciraṭṭhitiko hotī’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Parihānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "389"
      },
      ". Ekaṃ ",
      " samayaṃ āyasmā ca ānando āyasmā ca bhaddo pāṭaliputte ",
      " viharanti kukkuṭārāme. Atha kho āyasmā bhaddo sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā bhaddo āyasmantaṃ ānandaṃ etadavoca – ‘‘ko nu kho, āvuso ānanda, hetu, ko paccayo yena saddhammaparihānaṃ hoti? Ko nu kho, āvuso ānanda, hetu, ko paccayo yena saddhammaaparihānaṃ hotī’’ti?"
    ],
    "innerText": "389. Ekaṃ samayaṃ āyasmā ca ānando āyasmā ca bhaddo pāṭaliputte viharanti kukkuṭārāme. Atha kho āyasmā bhaddo sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā bhaddo āyasmantaṃ ānandaṃ etadavoca – ‘‘ko nu kho, āvuso ānanda, hetu, ko paccayo yena saddhammaparihānaṃ hoti? Ko nu kho, āvuso ānanda, hetu, ko paccayo yena saddhammaaparihānaṃ hotī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu sādhu, āvuso bhadda! Bhaddako kho te, āvuso bhadda, ummaṅgo, bhaddakaṃ paṭibhānaṃ, kalyāṇī paripucchā. Evañhi tvaṃ, āvuso bhadda, pucchasi – ‘ko nu kho, āvuso ānanda, hetu, ko paccayo yena saddhammaparihānaṃ ",
      " hoti? Ko panāvuso ānanda, hetu, ko paccayo yena saddhammaaparihānaṃ hotī’’’ti? ‘‘Evamāvuso’’ti. ‘‘Catunnaṃ kho, āvuso ",
      ", satipaṭṭhānānaṃ abhāvitattā abahulīkatattā saddhammaparihānaṃ hoti. Catunnañca kho, āvuso, satipaṭṭhānānaṃ bhāvitattā bahulīkatattā saddhammaaparihānaṃ hoti’’."
    ],
    "innerText": "‘‘Sādhu sādhu, āvuso bhadda! Bhaddako kho te, āvuso bhadda, ummaṅgo, bhaddakaṃ paṭibhānaṃ, kalyāṇī paripucchā. Evañhi tvaṃ, āvuso bhadda, pucchasi – ‘ko nu kho, āvuso ānanda, hetu, ko paccayo yena saddhammaparihānaṃ hoti? Ko panāvuso ānanda, hetu, ko paccayo yena saddhammaaparihānaṃ hotī’’’ti? ‘‘Evamāvuso’’ti. ‘‘Catunnaṃ kho, āvuso , satipaṭṭhānānaṃ abhāvitattā abahulīkatattā saddhammaparihānaṃ hoti. Catunnañca kho, āvuso, satipaṭṭhānānaṃ bhāvitattā bahulīkatattā saddhammaaparihānaṃ hoti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamesaṃ catunnaṃ? Idhāvuso, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesaṃ kho, āvuso, catunnaṃ satipaṭṭhānānaṃ abhāvitattā abahulīkatattā saddhammaparihānaṃ hoti. Imesañca kho, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā saddhammaaparihānaṃ hotī’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Suddhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "390"
      },
      ". Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, satipaṭṭhānā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu ",
      " …pe… citte ",
      " …pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ime kho, bhikkhave, cattāro satipaṭṭhānā’’ti. Catutthaṃ."
    ],
    "innerText": "390. Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, satipaṭṭhānā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu …pe… citte …pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ime kho, bhikkhave, cattāro satipaṭṭhānā’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Aññatarabrāhmaṇasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "391"
      },
      ". Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho aññataro brāhmaṇo yena ",
      " bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so brāhmaṇo bhagavantaṃ etadavoca – ‘‘ko nu kho, bho gotama, hetu, ko paccayo yena tathāgate parinibbute saddhammo na ciraṭṭhitiko hoti? Ko pana, bho gotama, hetu, ko paccayo yena tathāgate parinibbute saddhammo ciraṭṭhitiko hotī’’ti?"
    ],
    "innerText": "391. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho aññataro brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so brāhmaṇo bhagavantaṃ etadavoca – ‘‘ko nu kho, bho gotama, hetu, ko paccayo yena tathāgate parinibbute saddhammo na ciraṭṭhitiko hoti? Ko pana, bho gotama, hetu, ko paccayo yena tathāgate parinibbute saddhammo ciraṭṭhitiko hotī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Catunnaṃ ",
      " kho, brāhmaṇa, satipaṭṭhānānaṃ abhāvitattā abahulīkatattā tathāgate parinibbute saddhammo na ciraṭṭhitiko hoti. Catunnañca kho, brāhmaṇa, satipaṭṭhānānaṃ bhāvitattā bahulīkatattā tathāgate parinibbute saddhammo ciraṭṭhitiko hoti."
    ],
    "innerText": "‘‘Catunnaṃ kho, brāhmaṇa, satipaṭṭhānānaṃ abhāvitattā abahulīkatattā tathāgate parinibbute saddhammo na ciraṭṭhitiko hoti. Catunnañca kho, brāhmaṇa, satipaṭṭhānānaṃ bhāvitattā bahulīkatattā tathāgate parinibbute saddhammo ciraṭṭhitiko hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamesaṃ catunnaṃ? Idha, brāhmaṇa, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesaṃ kho, brāhmaṇa, catunnaṃ satipaṭṭhānānaṃ abhāvitattā abahulīkatattā tathāgate parinibbute saddhammo na ciraṭṭhitiko hoti. Imesañca kho, brāhmaṇa, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā tathāgate parinibbute saddhammo ciraṭṭhitiko hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vutte so brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ ",
      ", bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Pañcamaṃ."
    ],
    "innerText": "Evaṃ vutte so brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ , bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Padesasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "392"
      },
      ". Ekaṃ ",
      " samayaṃ āyasmā ca sāriputto āyasmā ca mahāmoggallāno āyasmā ca anuruddho sākete viharanti kaṇḍakīvane ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kaṇṭakīvane (sī. syā. kaṃ. pī.)]"
      },
      ". Atha kho āyasmā ca sāriputto āyasmā ca mahāmoggallāno sāyanhasamayaṃ paṭisallānā vuṭṭhitā yenāyasmā aniruddho tenupasaṅkamiṃsu; upasaṅkamitvā āyasmatā anuruddhena saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ ",
      " sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ anuruddhaṃ etadavoca – ‘‘‘sekho, sekho’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sekkho sekkhoti (syā. kaṃ.)]"
      },
      ", āvuso anuruddha, vuccati. Kittāvatā nu kho, āvuso, sekho hotī’’ti? ‘‘Catunnaṃ kho, āvuso, satipaṭṭhānānaṃ padesaṃ bhāvitattā sekho hoti’’."
    ],
    "innerText": "392. Ekaṃ samayaṃ āyasmā ca sāriputto āyasmā ca mahāmoggallāno āyasmā ca anuruddho sākete viharanti kaṇḍakīvane [kaṇṭakīvane (sī. syā. kaṃ. pī.)]. Atha kho āyasmā ca sāriputto āyasmā ca mahāmoggallāno sāyanhasamayaṃ paṭisallānā vuṭṭhitā yenāyasmā aniruddho tenupasaṅkamiṃsu; upasaṅkamitvā āyasmatā anuruddhena saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ anuruddhaṃ etadavoca – ‘‘‘sekho, sekho’ti [sekkho sekkhoti (syā. kaṃ.)], āvuso anuruddha, vuccati. Kittāvatā nu kho, āvuso, sekho hotī’’ti? ‘‘Catunnaṃ kho, āvuso, satipaṭṭhānānaṃ padesaṃ bhāvitattā sekho hoti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamesaṃ catunnaṃ? Idhāvuso, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… ",
      " citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesaṃ kho, āvuso, catunnaṃ satipaṭṭhānānaṃ padesaṃ bhāvitattā sekho hotī’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Katamesaṃ catunnaṃ? Idhāvuso, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesaṃ kho, āvuso, catunnaṃ satipaṭṭhānānaṃ padesaṃ bhāvitattā sekho hotī’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Samattasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "393"
      },
      ". Taṃyeva nidānaṃ. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ anuruddhaṃ etadavoca – ‘‘‘asekho ",
      ", asekho’ti, āvuso anuruddha, vuccati. Kittāvatā nu kho, āvuso, asekho hotī’’ti? ‘‘Catunnaṃ kho, āvuso, satipaṭṭhānānaṃ samattaṃ bhāvitattā asekho hoti’’."
    ],
    "innerText": "393. Taṃyeva nidānaṃ. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ anuruddhaṃ etadavoca – ‘‘‘asekho , asekho’ti, āvuso anuruddha, vuccati. Kittāvatā nu kho, āvuso, asekho hotī’’ti? ‘‘Catunnaṃ kho, āvuso, satipaṭṭhānānaṃ samattaṃ bhāvitattā asekho hoti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamesaṃ catunnaṃ? Idhāvuso, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesaṃ kho ",
      ", āvuso, catunnaṃ satipaṭṭhānānaṃ samattaṃ bhāvitattā asekho hotī’’ti. Sattamaṃ."
    ],
    "innerText": "‘‘Katamesaṃ catunnaṃ? Idhāvuso, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesaṃ kho , āvuso, catunnaṃ satipaṭṭhānānaṃ samattaṃ bhāvitattā asekho hotī’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Lokasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "394"
      },
      ". Taṃyeva nidānaṃ. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ anuruddhaṃ etadavoca – ‘‘katamesaṃ, āvuso anuruddha, dhammānaṃ bhāvitattā bahulīkatattā mahābhiññataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahābhiññātaṃ (pī.)]"
      },
      " patto’’ti? ‘‘Catunnaṃ ",
      ", āvuso, satipaṭṭhānānaṃ bhāvitattā bahulīkatattā mahābhiññataṃ patto’’."
    ],
    "innerText": "394. Taṃyeva nidānaṃ. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ anuruddhaṃ etadavoca – ‘‘katamesaṃ, āvuso anuruddha, dhammānaṃ bhāvitattā bahulīkatattā mahābhiññataṃ [mahābhiññātaṃ (pī.)] patto’’ti? ‘‘Catunnaṃ , āvuso, satipaṭṭhānānaṃ bhāvitattā bahulīkatattā mahābhiññataṃ patto’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamesaṃ catunnaṃ? Idhāhaṃ, āvuso, kāye kāyānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesaṃ khvāhaṃ, āvuso ",
      ", catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā mahābhiññataṃ patto. Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā sahassaṃ lokaṃ ",
      " abhijānāmī’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "‘‘Katamesaṃ catunnaṃ? Idhāhaṃ, āvuso, kāye kāyānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesaṃ khvāhaṃ, āvuso , catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā mahābhiññataṃ patto. Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā sahassaṃ lokaṃ abhijānāmī’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Sirivaḍḍhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "395"
      },
      ". Ekaṃ samayaṃ āyasmā ānando rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena sirivaḍḍho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sirīvaḍḍho (ka.)]"
      },
      " gahapati ābādhiko hoti dukkhito bāḷhagilāno. Atha kho sirivaḍḍho gahapati aññataraṃ purisaṃ āmantesi – ‘‘ehi tvaṃ, ambho purisa, yenāyasmā ānando tenupasaṅkama; upasaṅkamitvā mama vacanena āyasmato ānandassa pāde sirasā vanda – ‘sirivaḍḍho, bhante, gahapati ābādhiko dukkhito bāḷhagilāno. So āyasmato ānandassa pāde sirasā vandatī’ti. Evañca vadehi – ‘sādhu kira, bhante, āyasmā ānando yena sirivaḍḍhassa gahapatissa nivesanaṃ tenupasaṅkamatu anukampaṃ upādāyā’’’ti. ‘‘Evaṃ, bhante’’ti kho so puriso sirivaḍḍhassa gahapatissa paṭissutvā yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho ",
      " so puriso āyasmantaṃ ānandaṃ etadavoca – ‘‘sirivaḍḍho, bhante, gahapati ābādhiko dukkhito bāḷhagilāno, so āyasmato ānandassa pāde sirasā vandati. Evañca vadeti – ‘sādhu kira, bhante, āyasmā ānando yena sirivaḍḍhassa gahapatissa nivesanaṃ tenupasaṅkamatu anukampaṃ upādāyā’’’ti. Adhivāsesi ",
      " kho āyasmā ānando tuṇhībhāvena."
    ],
    "innerText": "395. Ekaṃ samayaṃ āyasmā ānando rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena sirivaḍḍho [sirīvaḍḍho (ka.)] gahapati ābādhiko hoti dukkhito bāḷhagilāno. Atha kho sirivaḍḍho gahapati aññataraṃ purisaṃ āmantesi – ‘‘ehi tvaṃ, ambho purisa, yenāyasmā ānando tenupasaṅkama; upasaṅkamitvā mama vacanena āyasmato ānandassa pāde sirasā vanda – ‘sirivaḍḍho, bhante, gahapati ābādhiko dukkhito bāḷhagilāno. So āyasmato ānandassa pāde sirasā vandatī’ti. Evañca vadehi – ‘sādhu kira, bhante, āyasmā ānando yena sirivaḍḍhassa gahapatissa nivesanaṃ tenupasaṅkamatu anukampaṃ upādāyā’’’ti. ‘‘Evaṃ, bhante’’ti kho so puriso sirivaḍḍhassa gahapatissa paṭissutvā yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so puriso āyasmantaṃ ānandaṃ etadavoca – ‘‘sirivaḍḍho, bhante, gahapati ābādhiko dukkhito bāḷhagilāno, so āyasmato ānandassa pāde sirasā vandati. Evañca vadeti – ‘sādhu kira, bhante, āyasmā ānando yena sirivaḍḍhassa gahapatissa nivesanaṃ tenupasaṅkamatu anukampaṃ upādāyā’’’ti. Adhivāsesi kho āyasmā ānando tuṇhībhāvena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmā ānando pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya ",
      " yena sirivaḍḍhassa gahapatissa nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho āyasmā ānando sirivaḍḍhaṃ gahapatiṃ etadavoca – ‘‘kacci te, gahapati, khamanīyaṃ kacci yāpanīyaṃ, kacci dukkhā vedanā paṭikkamanti, no abhikkamanti; paṭikkamosānaṃ paññāyati, no abhikkamo’’ti? ‘‘Na me, bhante, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo’’ti."
    ],
    "innerText": "Atha kho āyasmā ānando pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena sirivaḍḍhassa gahapatissa nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho āyasmā ānando sirivaḍḍhaṃ gahapatiṃ etadavoca – ‘‘kacci te, gahapati, khamanīyaṃ kacci yāpanīyaṃ, kacci dukkhā vedanā paṭikkamanti, no abhikkamanti; paṭikkamosānaṃ paññāyati, no abhikkamo’’ti? ‘‘Na me, bhante, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘kāye kāyānupassī viharissāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… ",
      " citte…pe… dhammesu dhammānupassī viharissāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassa’nti. Evañhi te, gahapati, sikkhitabba’’nti."
    ],
    "innerText": "‘‘Tasmātiha te, gahapati, evaṃ sikkhitabbaṃ – ‘kāye kāyānupassī viharissāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharissāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassa’nti. Evañhi te, gahapati, sikkhitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yeme, bhante, bhagavatā cattāro satipaṭṭhānā desitā saṃvijjanti, te dhammā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṃvijjante ratanadhammā (sī.)]"
      },
      " mayi, ahañca tesu dhammesu sandissāmi. Ahañhi, bhante, kāye kāyānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Yāni cimāni, bhante, bhagavatā pañcorambhāgiyāni saṃyojanāni ",
      " desitāni, nāhaṃ, bhante, tesaṃ kiñci attani appahīnaṃ samanupassāmī’’ti. ‘‘Lābhā te, gahapati, suladdhaṃ te, gahapati! Anāgāmiphalaṃ tayā, gahapati, byākata’’nti. Navamaṃ."
    ],
    "innerText": "‘‘Yeme, bhante, bhagavatā cattāro satipaṭṭhānā desitā saṃvijjanti, te dhammā [saṃvijjante ratanadhammā (sī.)] mayi, ahañca tesu dhammesu sandissāmi. Ahañhi, bhante, kāye kāyānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Yāni cimāni, bhante, bhagavatā pañcorambhāgiyāni saṃyojanāni desitāni, nāhaṃ, bhante, tesaṃ kiñci attani appahīnaṃ samanupassāmī’’ti. ‘‘Lābhā te, gahapati, suladdhaṃ te, gahapati! Anāgāmiphalaṃ tayā, gahapati, byākata’’nti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Mānadinnasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "396"
      },
      ". Taṃyeva ",
      " nidānaṃ. Tena kho pana samayena mānadinno gahapati ābādhiko hoti dukkhito bāḷhagilāno. Atha kho mānadinno gahapati aññataraṃ purisaṃ āmantesi – ‘‘ehi tvaṃ, ambho purisa…pe… na me, bhante, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamoti. Evarūpāya cāhaṃ, bhante, dukkhāya vedanāya phuṭṭho samāno kāye kāyānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Yāni cimāni, bhante, bhagavatā pañcorambhāgiyāni saṃyojanāni desitāni, nāhaṃ, bhante, tesaṃ kiñci attani appahīnaṃ samanupassāmī’’ti. ‘‘Lābhā te, gahapati, suladdhaṃ te, gahapati! Anāgāmiphalaṃ tayā, gahapati, byākata’’nti. Dasamaṃ."
    ],
    "innerText": "396. Taṃyeva nidānaṃ. Tena kho pana samayena mānadinno gahapati ābādhiko hoti dukkhito bāḷhagilāno. Atha kho mānadinno gahapati aññataraṃ purisaṃ āmantesi – ‘‘ehi tvaṃ, ambho purisa…pe… na me, bhante, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamoti. Evarūpāya cāhaṃ, bhante, dukkhāya vedanāya phuṭṭho samāno kāye kāyānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Yāni cimāni, bhante, bhagavatā pañcorambhāgiyāni saṃyojanāni desitāni, nāhaṃ, bhante, tesaṃ kiñci attani appahīnaṃ samanupassāmī’’ti. ‘‘Lābhā te, gahapati, suladdhaṃ te, gahapati! Anāgāmiphalaṃ tayā, gahapati, byākata’’nti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sīlaṭṭhitivaggo tatiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Sīlaṃ ",
      " ṭhiti parihānaṃ, suddhaṃ brāhmaṇapadesaṃ;"
    ],
    "innerText": "Sīlaṃ ṭhiti parihānaṃ, suddhaṃ brāhmaṇapadesaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Samattaṃ loko sirivaḍḍho, mānadinnena te dasāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4. Ananussutavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Ananussutasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "397"
      },
      ". Sāvatthinidānaṃ ",
      ". ‘‘‘Ayaṃ kāye kāyānupassanā’ti me, bhikkhave, pubbe ananussutesu ",
      " dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘Sā kho panāyaṃ kāye kāyānupassanā bhāvetabbā’ti me, bhikkhave…pe… bhāvitā’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi’’."
    ],
    "innerText": "397. Sāvatthinidānaṃ . ‘‘‘Ayaṃ kāye kāyānupassanā’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘Sā kho panāyaṃ kāye kāyānupassanā bhāvetabbā’ti me, bhikkhave…pe… bhāvitā’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Ayaṃ ",
      " vedanāsu vedanānupassanā’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘Sā kho panāyaṃ vedanāsu vedanānupassanā bhāvetabbā’ti me, bhikkhave…pe… bhāvitā’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi."
    ],
    "innerText": "‘‘‘Ayaṃ vedanāsu vedanānupassanā’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘Sā kho panāyaṃ vedanāsu vedanānupassanā bhāvetabbā’ti me, bhikkhave…pe… bhāvitā’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Ayaṃ citte cittānupassanā’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘Sā kho panāyaṃ citte cittānupassanā bhāvetabbā’ti me, bhikkhave…pe… bhāvitā’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Ayaṃ ",
      " dhammesu dhammānupassanā’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘Sā kho panāyaṃ dhammesu dhammānupassanā bhāvetabbā’ti me, bhikkhave…pe… bhāvitā’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādī’’ti. Paṭhamaṃ."
    ],
    "innerText": "‘‘‘Ayaṃ dhammesu dhammānupassanā’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘Sā kho panāyaṃ dhammesu dhammānupassanā bhāvetabbā’ti me, bhikkhave…pe… bhāvitā’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādī’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Virāgasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "398"
      },
      ". ‘‘Cattārome, bhikkhave, satipaṭṭhānā bhāvitā bahulīkatā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattanti."
    ],
    "innerText": "398. ‘‘Cattārome, bhikkhave, satipaṭṭhānā bhāvitā bahulīkatā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ime kho, bhikkhave, cattāro satipaṭṭhānā bhāvitā bahulīkatā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattantī’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Viraddhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "399"
      },
      ". ‘‘Yesaṃ ",
      " kesañci, bhikkhave, cattāro satipaṭṭhānā viraddhā, viraddho tesaṃ ariyo maggo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ariyo aṭṭhaṅkiko maggo (ka.) imasmiṃ yeva sutte dissati aṭṭhaṅgikotipadaṃ, na panāññattha iddhipāda anuruddhādīsu]"
      },
      " sammā dukkhakkhayagāmī. Yesaṃ ",
      " kesañci, bhikkhave, cattāro satipaṭṭhānā āraddhā, āraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī."
    ],
    "innerText": "399. ‘‘Yesaṃ kesañci, bhikkhave, cattāro satipaṭṭhānā viraddhā, viraddho tesaṃ ariyo maggo [ariyo aṭṭhaṅkiko maggo (ka.) imasmiṃ yeva sutte dissati aṭṭhaṅgikotipadaṃ, na panāññattha iddhipāda anuruddhādīsu] sammā dukkhakkhayagāmī. Yesaṃ kesañci, bhikkhave, cattāro satipaṭṭhānā āraddhā, āraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno ",
      " satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Yesaṃ kesañci ",
      ", bhikkhave, ime cattāro satipaṭṭhānā viraddhā, viraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī. Yesaṃ kesañci, bhikkhave, ime cattāro satipaṭṭhānā āraddhā, āraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī’’ti. Tatiyaṃ."
    ],
    "innerText": "‘‘Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Yesaṃ kesañci , bhikkhave, ime cattāro satipaṭṭhānā viraddhā, viraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī. Yesaṃ kesañci, bhikkhave, ime cattāro satipaṭṭhānā āraddhā, āraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Bhāvitasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "400"
      },
      ". ‘‘Cattārome, bhikkhave, satipaṭṭhānā bhāvitā bahulīkatā apārā pāraṃ gamanāya saṃvattanti."
    ],
    "innerText": "400. ‘‘Cattārome, bhikkhave, satipaṭṭhānā bhāvitā bahulīkatā apārā pāraṃ gamanāya saṃvattanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ime kho, bhikkhave, cattāro satipaṭṭhānā bhāvitā bahulīkatā apārā pāraṃ gamanāya saṃvattantī’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Satisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "401"
      },
      ". Sāvatthinidānaṃ. ‘‘Sato, bhikkhave, bhikkhu vihareyya sampajāno. Ayaṃ vo amhākaṃ anusāsanī’’."
    ],
    "innerText": "401. Sāvatthinidānaṃ. ‘‘Sato, bhikkhave, bhikkhu vihareyya sampajāno. Ayaṃ vo amhākaṃ anusāsanī’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu sato hoti? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ ",
      "; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Evaṃ kho, bhikkhave, bhikkhu sato hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu sato hoti? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Evaṃ kho, bhikkhave, bhikkhu sato hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, bhikkhu sampajāno hoti? Idha, bhikkhave, bhikkhuno viditā vedanā uppajjanti, viditā upaṭṭhahanti ",
      ", viditā abbhatthaṃ gacchanti. Viditā vitakkā uppajjanti ",
      ", viditā upaṭṭhahanti, viditā abbhatthaṃ gacchanti. Viditā saññā uppajjanti, viditā upaṭṭhahanti, viditā abbhatthaṃ gacchanti. Evaṃ kho, bhikkhave, bhikkhu sampajāno hoti. Sato, bhikkhave, bhikkhu vihareyya sampajāno. Ayaṃ vo amhākaṃ anusāsanī’’ti. Pañcamaṃ."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, bhikkhu sampajāno hoti? Idha, bhikkhave, bhikkhuno viditā vedanā uppajjanti, viditā upaṭṭhahanti , viditā abbhatthaṃ gacchanti. Viditā vitakkā uppajjanti , viditā upaṭṭhahanti, viditā abbhatthaṃ gacchanti. Viditā saññā uppajjanti, viditā upaṭṭhahanti, viditā abbhatthaṃ gacchanti. Evaṃ kho, bhikkhave, bhikkhu sampajāno hoti. Sato, bhikkhave, bhikkhu vihareyya sampajāno. Ayaṃ vo amhākaṃ anusāsanī’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Aññāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "402"
      },
      ". ‘‘Cattārome, bhikkhave, satipaṭṭhānā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ime kho, bhikkhave, cattāro satipaṭṭhānā. Imesaṃ kho, bhikkhave, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ – diṭṭheva dhamme aññā, sati vā upādisese anāgāmitā’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "402. ‘‘Cattārome, bhikkhave, satipaṭṭhānā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ime kho, bhikkhave, cattāro satipaṭṭhānā. Imesaṃ kho, bhikkhave, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ – diṭṭheva dhamme aññā, sati vā upādisese anāgāmitā’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Chandasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "403"
      },
      ". ‘‘Cattārome, bhikkhave, satipaṭṭhānā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa kāye kāyānupassino viharato yo kāyasmiṃ chando so pahīyati. Chandassa pahānā amataṃ sacchikataṃ hoti."
    ],
    "innerText": "403. ‘‘Cattārome, bhikkhave, satipaṭṭhānā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa kāye kāyānupassino viharato yo kāyasmiṃ chando so pahīyati. Chandassa pahānā amataṃ sacchikataṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Vedanāsu ",
      " vedanānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa vedanāsu vedanānupassino viharato yo vedanāsu chando so pahīyati. Chandassa pahānā amataṃ sacchikataṃ hoti."
    ],
    "innerText": "‘‘Vedanāsu vedanānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa vedanāsu vedanānupassino viharato yo vedanāsu chando so pahīyati. Chandassa pahānā amataṃ sacchikataṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Citte ",
      " cittānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa citte cittānupassino viharato yo cittamhi chando so pahīyati. Chandassa pahānā amataṃ sacchikataṃ hoti."
    ],
    "innerText": "‘‘Citte cittānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa citte cittānupassino viharato yo cittamhi chando so pahīyati. Chandassa pahānā amataṃ sacchikataṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dhammesu ",
      " dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa dhammesu dhammānupassino viharato yo dhammesu chando so pahīyati. Chandassa pahānā amataṃ sacchikataṃ hotī’’ti. Sattamaṃ."
    ],
    "innerText": "‘‘Dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa dhammesu dhammānupassino viharato yo dhammesu chando so pahīyati. Chandassa pahānā amataṃ sacchikataṃ hotī’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Pariññātasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "404"
      },
      ". ‘‘Cattārome, bhikkhave, satipaṭṭhānā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa kāye kāyānupassino viharato kāyo pariññāto hoti. Kāyassa pariññātattā amataṃ sacchikataṃ hoti."
    ],
    "innerText": "404. ‘‘Cattārome, bhikkhave, satipaṭṭhānā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa kāye kāyānupassino viharato kāyo pariññāto hoti. Kāyassa pariññātattā amataṃ sacchikataṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Vedanāsu vedanānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa vedanāsu vedanānupassino viharato vedanā pariññātā honti. Vedanānaṃ pariññātattā ",
      " amataṃ sacchikataṃ hoti."
    ],
    "innerText": "‘‘Vedanāsu vedanānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa vedanāsu vedanānupassino viharato vedanā pariññātā honti. Vedanānaṃ pariññātattā amataṃ sacchikataṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Citte cittānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa citte cittānupassino viharato cittaṃ pariññātaṃ hoti. Cittassa pariññātattā amataṃ sacchikataṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Tassa dhammesu dhammānupassino viharato dhammā pariññātā honti. Dhammānaṃ pariññātattā amataṃ sacchikataṃ hotī’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Bhāvanāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "405"
      },
      ". ‘‘Catunnaṃ ",
      ", bhikkhave, satipaṭṭhānānaṃ bhāvanaṃ desessāmi. Taṃ suṇātha’’. ‘‘Katamā, bhikkhave, catunnaṃ satipaṭṭhānānaṃ bhāvanā? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī ",
      " viharati ātāpī ",
      " sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ayaṃ kho, bhikkhave, catunnaṃ satipaṭṭhānānaṃ bhāvanā’’ti. Navamaṃ."
    ],
    "innerText": "405. ‘‘Catunnaṃ , bhikkhave, satipaṭṭhānānaṃ bhāvanaṃ desessāmi. Taṃ suṇātha’’. ‘‘Katamā, bhikkhave, catunnaṃ satipaṭṭhānānaṃ bhāvanā? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ayaṃ kho, bhikkhave, catunnaṃ satipaṭṭhānānaṃ bhāvanā’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Vibhaṅgasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "406"
      },
      ". ‘‘Satipaṭṭhānañca vo, bhikkhave, desessāmi satipaṭṭhānabhāvanañca satipaṭṭhānabhāvanāgāminiñca paṭipadaṃ. Taṃ suṇātha’’. ‘‘Katamañca, bhikkhave, satipaṭṭhānaṃ? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu vedanānupassī viharati…pe… citte cittānupassī viharati…pe… dhammesu dhammānupassī viharati ātāpī ",
      " sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Idaṃ vuccati, bhikkhave, satipaṭṭhānaṃ’’."
    ],
    "innerText": "406. ‘‘Satipaṭṭhānañca vo, bhikkhave, desessāmi satipaṭṭhānabhāvanañca satipaṭṭhānabhāvanāgāminiñca paṭipadaṃ. Taṃ suṇātha’’. ‘‘Katamañca, bhikkhave, satipaṭṭhānaṃ? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu vedanānupassī viharati…pe… citte cittānupassī viharati…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Idaṃ vuccati, bhikkhave, satipaṭṭhānaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, satipaṭṭhānabhāvanā? Idha, bhikkhave, bhikkhu samudayadhammānupassī kāyasmiṃ viharati, vayadhammānupassī kāyasmiṃ viharati, samudayavayadhammānupassī kāyasmiṃ viharati, ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Samudayadhammānupassī vedanāsu viharati…pe… samudayadhammānupassī citte viharati… samudayadhammānupassī dhammesu viharati, vayadhammānupassī dhammesu viharati, samudayavayadhammānupassī dhammesu viharati, ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ayaṃ vuccati, bhikkhave, satipaṭṭhānabhāvanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, satipaṭṭhānabhāvanāgāminī paṭipadā? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi. Ayaṃ vuccati, bhikkhave, satipaṭṭhānabhāvanāgāminī paṭipadā’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ananussutavaggo catuttho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Ananussutaṃ ",
      " virāgo, viraddho bhāvanā sati;"
    ],
    "innerText": "Ananussutaṃ virāgo, viraddho bhāvanā sati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aññā chandaṃ pariññāya, bhāvanā vibhaṅgena cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "5. Amatavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Amatasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "407"
      },
      ". Sāvatthinidānaṃ ",
      ". ‘‘Catūsu, bhikkhave, satipaṭṭhānesu suppatiṭṭhitacittā viharatha. Mā vo amataṃ panassa. Katamesu catūsu? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesu, bhikkhave, catūsu satipaṭṭhānesu suppatiṭṭhitacittā viharatha. Mā vo amataṃ panassā’’ti. Paṭhamaṃ."
    ],
    "innerText": "407. Sāvatthinidānaṃ . ‘‘Catūsu, bhikkhave, satipaṭṭhānesu suppatiṭṭhitacittā viharatha. Mā vo amataṃ panassa. Katamesu catūsu? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesu, bhikkhave, catūsu satipaṭṭhānesu suppatiṭṭhitacittā viharatha. Mā vo amataṃ panassā’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Samudayasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "408"
      },
      ". ‘‘Catunnaṃ, bhikkhave, satipaṭṭhānānaṃ samudayañca atthaṅgamañca desessāmi. Taṃ suṇātha. Ko ca, bhikkhave, kāyassa samudayo? Āhārasamudayā kāyassa samudayo; āhāranirodhā kāyassa atthaṅgamo. Phassasamudayā vedanānaṃ samudayo; phassanirodhā vedanānaṃ atthaṅgamo. Nāmarūpasamudayā cittassa samudayo; nāmarūpanirodhā cittassa atthaṅgamo. Manasikārasamudayā dhammānaṃ samudayo; manasikāranirodhā dhammānaṃ atthaṅgamo’’ti. Dutiyaṃ."
    ],
    "innerText": "408. ‘‘Catunnaṃ, bhikkhave, satipaṭṭhānānaṃ samudayañca atthaṅgamañca desessāmi. Taṃ suṇātha. Ko ca, bhikkhave, kāyassa samudayo? Āhārasamudayā kāyassa samudayo; āhāranirodhā kāyassa atthaṅgamo. Phassasamudayā vedanānaṃ samudayo; phassanirodhā vedanānaṃ atthaṅgamo. Nāmarūpasamudayā cittassa samudayo; nāmarūpanirodhā cittassa atthaṅgamo. Manasikārasamudayā dhammānaṃ samudayo; manasikāranirodhā dhammānaṃ atthaṅgamo’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Maggasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "409"
      },
      ". Sāvatthinidānaṃ ",
      ". Tatra kho bhagavā bhikkhū āmantesi – ‘‘ekamidāhaṃ, bhikkhave, samayaṃ uruvelāyaṃ viharāmi najjā nerañjarāya tīre ajapālanigrodhe paṭhamābhisambuddho. Tassa mayhaṃ, bhikkhave, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘ekāyano ",
      " ayaṃ maggo sattānaṃ ",
      " visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ – cattāro satipaṭṭhānā’’’."
    ],
    "innerText": "409. Sāvatthinidānaṃ . Tatra kho bhagavā bhikkhū āmantesi – ‘‘ekamidāhaṃ, bhikkhave, samayaṃ uruvelāyaṃ viharāmi najjā nerañjarāya tīre ajapālanigrodhe paṭhamābhisambuddho. Tassa mayhaṃ, bhikkhave, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘ekāyano ayaṃ maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ – cattāro satipaṭṭhānā’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame cattāro? Kāye vā bhikkhu kāyānupassī vihareyya ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu vā bhikkhu vedanānupassī vihareyya…pe… citte vā bhikkhu cittānupassī vihareyya…pe… dhammesu vā bhikkhu dhammānupassī vihareyya ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ekāyano ayaṃ maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ – cattāro satipaṭṭhānā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha kho, bhikkhave, brahmā sahampati mama cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva – brahmaloke antarahito mama purato pāturahosi. Atha kho, bhikkhave, brahmā sahampati ekaṃsaṃ uttarāsaṅgaṃ karitvā yenāhaṃ tenañjaliṃ paṇāmetvā maṃ etadavoca – ‘evametaṃ, bhagavā, evametaṃ, sugata! Ekāyano ayaṃ, bhante, maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ – cattāro ",
      " satipaṭṭhānā’’’."
    ],
    "innerText": "‘‘Atha kho, bhikkhave, brahmā sahampati mama cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva – brahmaloke antarahito mama purato pāturahosi. Atha kho, bhikkhave, brahmā sahampati ekaṃsaṃ uttarāsaṅgaṃ karitvā yenāhaṃ tenañjaliṃ paṇāmetvā maṃ etadavoca – ‘evametaṃ, bhagavā, evametaṃ, sugata! Ekāyano ayaṃ, bhante, maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ – cattāro satipaṭṭhānā’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame cattāro? Kāye ",
      " vā, bhante, bhikkhu kāyānupassī vihareyya ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu vā…pe… citte vā ",
      " …pe… dhammesu vā, bhante, bhikkhu dhammānupassī vihareyya ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ekāyano ayaṃ, bhante, maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ – cattāro satipaṭṭhānā’’ti."
    ],
    "innerText": "‘‘Katame cattāro? Kāye vā, bhante, bhikkhu kāyānupassī vihareyya ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu vā…pe… citte vā …pe… dhammesu vā, bhante, bhikkhu dhammānupassī vihareyya ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ekāyano ayaṃ, bhante, maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ – cattāro satipaṭṭhānā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idamavoca, bhikkhave, brahmā sahampati. Idaṃ vatvā athāparaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘Ekāyanaṃ jātikhayantadassī, maggaṃ pajānāti hitānukampī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etena maggena tariṃsu pubbe, tarissanti ye ca taranti ogha’’’nti. tatiyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Satisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "410"
      },
      ". ‘‘Sato ",
      ", bhikkhave, bhikkhu vihareyya. Ayaṃ vo amhākaṃ anusāsanī. Kathañca, bhikkhave, bhikkhu sato hoti? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Evaṃ kho, bhikkhave, bhikkhu sato hoti. Sato, bhikkhave, bhikkhu vihareyya. Ayaṃ vo amhākaṃ anusāsanī’’ti. Catutthaṃ."
    ],
    "innerText": "410. ‘‘Sato , bhikkhave, bhikkhu vihareyya. Ayaṃ vo amhākaṃ anusāsanī. Kathañca, bhikkhave, bhikkhu sato hoti? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Evaṃ kho, bhikkhave, bhikkhu sato hoti. Sato, bhikkhave, bhikkhu vihareyya. Ayaṃ vo amhākaṃ anusāsanī’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Kusalarāsisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "411"
      },
      ". ‘‘‘Kusalarāsī’ti, bhikkhave, vadamāno cattāro satipaṭṭhāne sammā vadamāno vadeyya. Kevalo hāyaṃ, bhikkhave, kusalarāsi, yadidaṃ – cattāro satipaṭṭhānā."
    ],
    "innerText": "411. ‘‘‘Kusalarāsī’ti, bhikkhave, vadamāno cattāro satipaṭṭhāne sammā vadamāno vadeyya. Kevalo hāyaṃ, bhikkhave, kusalarāsi, yadidaṃ – cattāro satipaṭṭhānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame cattāro? Idha ",
      ", bhikkhave, bhikkhu ",
      " kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… cittānupassī…pe… dhammesu dhammānupassī ",
      " viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘Kusalarāsī’ti, bhikkhave, vadamāno ime cattāro satipaṭṭhāne sammā vadamāno vadeyya. Kevalo hāyaṃ, bhikkhave, kusalarāsi, yadidaṃ – cattāro satipaṭṭhānā’’ti. Pañcamaṃ."
    ],
    "innerText": "‘‘Katame cattāro? Idha , bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… cittānupassī…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘Kusalarāsī’ti, bhikkhave, vadamāno ime cattāro satipaṭṭhāne sammā vadamāno vadeyya. Kevalo hāyaṃ, bhikkhave, kusalarāsi, yadidaṃ – cattāro satipaṭṭhānā’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Pātimokkhasaṃvarasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "412"
      },
      ". Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami…pe… ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca –"
    ],
    "innerText": "412. Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami…pe… ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Tasmātiha tvaṃ, bhikkhu, ādimeva visodhehi kusalesu dhammesu. Ko cādi kusalānaṃ dhammānaṃ? Idha tvaṃ, bhikkhu, pātimokkhasaṃvarasaṃvuto viharāhi ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhassu sikkhāpadesu. Yato kho tvaṃ, bhikkhu, pātimokkhasaṃvarasaṃvuto viharissasi ācāragocarasampanno aṇumattesu vajjesu ",
      " bhayadassāvī samādāya sikkhissu sikkhāpadesu; tato tvaṃ, bhikkhu, sīlaṃ nissāya sīle patiṭṭhāya cattāro satipaṭṭhāne bhāveyyāsi’’."
    ],
    "innerText": "‘‘Sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Tasmātiha tvaṃ, bhikkhu, ādimeva visodhehi kusalesu dhammesu. Ko cādi kusalānaṃ dhammānaṃ? Idha tvaṃ, bhikkhu, pātimokkhasaṃvarasaṃvuto viharāhi ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhassu sikkhāpadesu. Yato kho tvaṃ, bhikkhu, pātimokkhasaṃvarasaṃvuto viharissasi ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī samādāya sikkhissu sikkhāpadesu; tato tvaṃ, bhikkhu, sīlaṃ nissāya sīle patiṭṭhāya cattāro satipaṭṭhāne bhāveyyāsi’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame cattāro? Idha tvaṃ, bhikkhu, kāye kāyānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ ",
      ". Yato kho tvaṃ, bhikkhu, sīlaṃ nissāya sīle patiṭṭhāya ime cattāro satipaṭṭhāne evaṃ bhāvessasi, tato tuyhaṃ, bhikkhu, yā ratti vā divaso vā āgamissati vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihānī’’ti."
    ],
    "innerText": "‘‘Katame cattāro? Idha tvaṃ, bhikkhu, kāye kāyānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ . Yato kho tvaṃ, bhikkhu, sīlaṃ nissāya sīle patiṭṭhāya ime cattāro satipaṭṭhāne evaṃ bhāvessasi, tato tuyhaṃ, bhikkhu, yā ratti vā divaso vā āgamissati vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihānī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho so bhikkhu bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha ",
      " kho so bhikkhu eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ ",
      " pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca pana so bhikkhu arahataṃ ahosīti. Chaṭṭhaṃ."
    ],
    "innerText": "Atha kho so bhikkhu bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho so bhikkhu eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca pana so bhikkhu arahataṃ ahosīti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Duccaritasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "413"
      },
      ". Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami…pe… ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Tasmātiha tvaṃ, bhikkhu, ādimeva visodhehi kusalesu dhammesu. Ko cādi kusalānaṃ dhammānaṃ? Idha tvaṃ, bhikkhu, kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāvessasi. Vacīduccaritaṃ pahāya vacīsucaritaṃ ",
      " bhāvessasi. Manoduccaritaṃ pahāya manosucaritaṃ bhāvessasi. Yato kho tvaṃ, bhikkhu, kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāvessasi, vacīduccaritaṃ pahāya vacīsucaritaṃ bhāvessasi, manoduccaritaṃ pahāya manosucaritaṃ bhāvessasi, tato tvaṃ, bhikkhu, sīlaṃ nissāya sīle patiṭṭhāya cattāro satipaṭṭhāne bhāveyyāsi’’."
    ],
    "innerText": "413. Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami…pe… ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Tasmātiha tvaṃ, bhikkhu, ādimeva visodhehi kusalesu dhammesu. Ko cādi kusalānaṃ dhammānaṃ? Idha tvaṃ, bhikkhu, kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāvessasi. Vacīduccaritaṃ pahāya vacīsucaritaṃ bhāvessasi. Manoduccaritaṃ pahāya manosucaritaṃ bhāvessasi. Yato kho tvaṃ, bhikkhu, kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāvessasi, vacīduccaritaṃ pahāya vacīsucaritaṃ bhāvessasi, manoduccaritaṃ pahāya manosucaritaṃ bhāvessasi, tato tvaṃ, bhikkhu, sīlaṃ nissāya sīle patiṭṭhāya cattāro satipaṭṭhāne bhāveyyāsi’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame ",
      " cattāro? Idha tvaṃ, bhikkhu, kāye kāyānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Yato kho tvaṃ, bhikkhu, sīlaṃ nissāya sīle patiṭṭhāya ime cattāro satipaṭṭhāne evaṃ bhāvessasi, tato tuyhaṃ, bhikkhu, yā ratti vā divaso vā āgamissati vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihānī’’ti…pe… aññataro ca pana so bhikkhu arahataṃ ahosīti. Sattamaṃ."
    ],
    "innerText": "‘‘Katame cattāro? Idha tvaṃ, bhikkhu, kāye kāyānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāhi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Yato kho tvaṃ, bhikkhu, sīlaṃ nissāya sīle patiṭṭhāya ime cattāro satipaṭṭhāne evaṃ bhāvessasi, tato tuyhaṃ, bhikkhu, yā ratti vā divaso vā āgamissati vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihānī’’ti…pe… aññataro ca pana so bhikkhu arahataṃ ahosīti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Mittasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "414"
      },
      ". ‘‘Ye ",
      ", bhikkhave, anukampeyyātha, ye ca kho sotabbaṃ maññeyyuṃ mittā vā amaccā ",
      " vā ñātī vā sālohitā vā, te vo, bhikkhave, catunnaṃ satipaṭṭhānānaṃ bhāvanāya samādapetabbā nivesetabbā patiṭṭhāpetabbā."
    ],
    "innerText": "414. ‘‘Ye , bhikkhave, anukampeyyātha, ye ca kho sotabbaṃ maññeyyuṃ mittā vā amaccā vā ñātī vā sālohitā vā, te vo, bhikkhave, catunnaṃ satipaṭṭhānānaṃ bhāvanāya samādapetabbā nivesetabbā patiṭṭhāpetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamesaṃ, catunnaṃ? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ye, bhikkhave, anukampeyyātha, ye ca sotabbaṃ maññeyyuṃ mittā vā ",
      " amaccā vā ñātī vā sālohitā vā, te vo, bhikkhave, imesaṃ catunnaṃ satipaṭṭhānānaṃ bhāvanāya samādapetabbā nivesetabbā patiṭṭhāpetabbā’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "‘‘Katamesaṃ, catunnaṃ? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ye, bhikkhave, anukampeyyātha, ye ca sotabbaṃ maññeyyuṃ mittā vā amaccā vā ñātī vā sālohitā vā, te vo, bhikkhave, imesaṃ catunnaṃ satipaṭṭhānānaṃ bhāvanāya samādapetabbā nivesetabbā patiṭṭhāpetabbā’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Vedanāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "415"
      },
      ". ‘‘Tisso imā, bhikkhave, vedanā. Katamā tisso? Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā kho, bhikkhave, tisso vedanā. Imāsaṃ kho, bhikkhave, tissannaṃ vedanānaṃ pariññāya cattāro satipaṭṭhānā bhāvetabbā."
    ],
    "innerText": "415. ‘‘Tisso imā, bhikkhave, vedanā. Katamā tisso? Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā kho, bhikkhave, tisso vedanā. Imāsaṃ kho, bhikkhave, tissannaṃ vedanānaṃ pariññāya cattāro satipaṭṭhānā bhāvetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame cattāro? Idha bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imāsaṃ kho, bhikkhave, tissannaṃ vedanānaṃ pariññāya ime cattāro satipaṭṭhānā bhāvetabbā’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Āsavasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "416"
      },
      ". ‘‘Tayome ",
      ", bhikkhave āsavā. Katame tayo? Kāmāsavo, bhavāsavo, avijjāsavo ",
      " – ime kho, bhikkhave, tayo āsavā. Imesaṃ ",
      " kho, bhikkhave, tiṇṇannaṃ āsavānaṃ pahānāya cattāro satipaṭṭhānā bhāvetabbā."
    ],
    "innerText": "416. ‘‘Tayome , bhikkhave āsavā. Katame tayo? Kāmāsavo, bhavāsavo, avijjāsavo – ime kho, bhikkhave, tayo āsavā. Imesaṃ kho, bhikkhave, tiṇṇannaṃ āsavānaṃ pahānāya cattāro satipaṭṭhānā bhāvetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke ",
      " abhijjhādomanassaṃ. Imesaṃ kho, bhikkhave, tiṇṇannaṃ āsavānaṃ pahānāya ime cattāro satipaṭṭhānā bhāvetabbā’’ti. Dasamaṃ."
    ],
    "innerText": "‘‘Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesaṃ kho, bhikkhave, tiṇṇannaṃ āsavānaṃ pahānāya ime cattāro satipaṭṭhānā bhāvetabbā’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Amatavaggo pañcamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Amataṃ samudayo maggo, sati kusalarāsi ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pātimokkhaṃ duccaritaṃ, mittavedanā āsavena cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "6. Gaṅgāpeyyālavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1-12. Gaṅgānadīādisuttadvādasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "417-428"
      },
      ". ‘‘Seyyathāpi ",
      ", bhikkhave, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā; evameva kho, bhikkhave, bhikkhu cattāro satipaṭṭhāne bhāvento cattāro satipaṭṭhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro."
    ],
    "innerText": "417-428. ‘‘Seyyathāpi , bhikkhave, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā; evameva kho, bhikkhave, bhikkhu cattāro satipaṭṭhāne bhāvento cattāro satipaṭṭhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu cattāro satipaṭṭhāne bhāvento cattāro satipaṭṭhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu ",
      " …pe… citte ",
      " …pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Evaṃ kho, bhikkhave, bhikkhu cattāro satipaṭṭhāne bhāvento cattāro satipaṭṭhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro’’ti vitthāretabbaṃ."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu cattāro satipaṭṭhāne bhāvento cattāro satipaṭṭhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu …pe… citte …pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Evaṃ kho, bhikkhave, bhikkhu cattāro satipaṭṭhāne bhāvento cattāro satipaṭṭhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro’’ti vitthāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Gaṅgāpeyyālavaggo chaṭṭho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Cha pācīnato ninnā, cha ninnā ca samuddato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ete dve cha dvādasa honti, vaggo tena pavuccatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "7. Appamādavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1-10. Tathāgatādisuttadasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "429-438"
      },
      ". Yāvatā, bhikkhave, sattā apadā vā dvipadā vā catuppadā vā bahuppadā vāti vitthāretabbaṃ."
    ],
    "innerText": "429-438. Yāvatā, bhikkhave, sattā apadā vā dvipadā vā catuppadā vā bahuppadā vāti vitthāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Appamādavaggo sattamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Tathāgataṃ ",
      " padaṃ kūṭaṃ, mūlaṃ sāro ca vassikaṃ;"
    ],
    "innerText": "Tathāgataṃ padaṃ kūṭaṃ, mūlaṃ sāro ca vassikaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rājā candimasūriyā, vatthena dasamaṃ padanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "8. Balakaraṇīyavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1-12. Balādisuttadvādasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "439-450"
      },
      ". Seyyathāpi ",
      ", bhikkhave, ye keci balakaraṇīyā kammantā karīyantīti vitthāretabbaṃ."
    ],
    "innerText": "439-450. Seyyathāpi , bhikkhave, ye keci balakaraṇīyā kammantā karīyantīti vitthāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Balakaraṇīyavaggo aṭṭhamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Balaṃ ",
      " bījañca nāgo ca, rukkho kumbhena sūkiyā;"
    ],
    "innerText": "Balaṃ bījañca nāgo ca, rukkho kumbhena sūkiyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ākāsena ca dve meghā, nāvā āgantukā nadīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "9. Esanāvaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1-10. Esanādisuttadasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "451-460"
      },
      ". Tisso imā, bhikkhave, esanā. Katamā tisso? Kāmesanā, bhavesanā, brahmacariyesanāti vitthāretabbaṃ."
    ],
    "innerText": "451-460. Tisso imā, bhikkhave, esanā. Katamā tisso? Kāmesanā, bhavesanā, brahmacariyesanāti vitthāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Esanāvaggo navamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Esanā vidhā āsavo, bhavo ca dukkhatā tisso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khilaṃ malañca nīgho ca, vedanā taṇhā tasināya cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "10. Oghavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1-10. Uddhambhāgiyādisuttadasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "461-470"
      },
      ". ‘‘Pañcimāni ",
      ", bhikkhave, uddhambhāgiyāni saṃyojanāni. Katamāni pañca? Rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā ",
      " – imāni kho, bhikkhave, pañcuddhambhāgiyāni saṃyojanāni. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya cattāro satipaṭṭhānā bhāvetabbā."
    ],
    "innerText": "461-470. ‘‘Pañcimāni , bhikkhave, uddhambhāgiyāni saṃyojanāni. Katamāni pañca? Rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā – imāni kho, bhikkhave, pañcuddhambhāgiyāni saṃyojanāni. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya cattāro satipaṭṭhānā bhāvetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame ",
      " cattāro? Idha, bhikkhave, bhikkhu kāye ",
      " kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya ime cattāro satipaṭṭhānā bhāvetabbā’’ti."
    ],
    "innerText": "‘‘Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya ime cattāro satipaṭṭhānā bhāvetabbā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Yathā maggasaṃyuttaṃ tathā satipaṭṭhānasaṃyuttaṃ vitthāretabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Oghavaggo dasamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ogho yogo upādānaṃ, ganthā anusayena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kāmaguṇā nīvaraṇā, khandhā oruddhambhāgiyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Satipaṭṭhānasaṃyuttaṃ tatiyaṃ."
  }
]