[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "13. Jhānasaṃyuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Samādhimūlakasamāpattisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "662"
      },
      ". Sāvatthinidānaṃ ",
      ". ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha ",
      ", bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ samāpattikusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ samāpattikusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pāmokkho (syā. kaṃ.) evamuparipi]"
      },
      " ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo tatra aggamakkhāyati; evameva kho, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ samāpattikusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro cā’’ti. Paṭhamaṃ."
    ],
    "innerText": "662. Sāvatthinidānaṃ . ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha , bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ samāpattikusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ samāpattikusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho [pāmokkho (syā. kaṃ.) evamuparipi] ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo tatra aggamakkhāyati; evameva kho, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ samāpattikusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro cā’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Samādhimūlakaṭhitisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "663"
      },
      ". Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ ṭhitikusalo. Idha pana, bhikkhave, ekacco ",
      " jhāyī samādhismiṃ ṭhitikusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ ṭhitikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti ",
      ", samādhismiṃ ṭhitikusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ ṭhitikusalo ca ayaṃ imesaṃ ",
      " catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā ",
      " sappi, sappimhā sappimaṇḍo tatra aggamakkhāyati; evameva kho, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ ṭhitikusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro cā’’ti. Dutiyaṃ."
    ],
    "innerText": "663. Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ ṭhitikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ ṭhitikusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ ṭhitikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti , samādhismiṃ ṭhitikusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ ṭhitikusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo tatra aggamakkhāyati; evameva kho, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ ṭhitikusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro cā’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Samādhimūlakavuṭṭhānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "664"
      },
      ". Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ vuṭṭhānakusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ vuṭṭhānakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ vuṭṭhānakusalo ca ayaṃ imesaṃ catunnaṃ ",
      " jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Tatiyaṃ."
    ],
    "innerText": "664. Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ vuṭṭhānakusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ vuṭṭhānakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ vuṭṭhānakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Samādhimūlakakallitasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "665"
      },
      ". Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ kallitakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ kallitakusalo hoti, na samādhismiṃ samādhikusalo. Idha ",
      " pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ kallitakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ kallitakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ kallitakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca ",
      " mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Catutthaṃ."
    ],
    "innerText": "665. Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ kallitakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ kallitakusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ kallitakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ kallitakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ kallitakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Samādhimūlakaārammaṇasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "666"
      },
      ". Sāvatthinidānaṃ ",
      ". ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ ārammaṇakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ ārammaṇakusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ ārammaṇakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ",
      " ca hoti, samādhismiṃ ārammaṇakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ ārammaṇakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Pañcamaṃ."
    ],
    "innerText": "666. Sāvatthinidānaṃ . ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ ārammaṇakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ ārammaṇakusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ ārammaṇakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ ārammaṇakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ ārammaṇakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Samādhimūlakagocarasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "667"
      },
      ". Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ gocarakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ gocarakusalo hoti, na samādhismiṃ samādhikusalo. Idha ",
      " pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ gocarakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ gocarakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ gocarakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "667. Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ gocarakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ gocarakusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ gocarakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ gocarakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ gocarakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Samādhimūlakaabhinīhārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "668"
      },
      ". Sāvatthinidānaṃ ",
      ". ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ abhinīhārakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ abhinīhārakusalo hoti, na samādhismiṃ samādhikusalo. Idha ",
      " pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ abhinīhārakusalo ",
      ". Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ abhinīhārakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ abhinīhārakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Sattamaṃ."
    ],
    "innerText": "668. Sāvatthinidānaṃ . ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ abhinīhārakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ abhinīhārakusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ abhinīhārakusalo . Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ abhinīhārakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ abhinīhārakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Samādhimūlakasakkaccakārīsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "669"
      },
      ". Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ sakkaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sakkaccakārī hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ sakkaccakārī. Idha ",
      " pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ sakkaccakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ sakkaccakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "669. Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ sakkaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sakkaccakārī hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ sakkaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ sakkaccakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ sakkaccakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Samādhimūlakasātaccakārīsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "670"
      },
      ". Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ sātaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sātaccakārī hoti, na samādhismiṃ samādhikusalo. Idha pana ",
      ", bhikkhave, ekacco jhāyī neva ",
      " samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ sātaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ sātaccakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ sātaccakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Navamaṃ."
    ],
    "innerText": "670. Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ sātaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sātaccakārī hoti, na samādhismiṃ samādhikusalo. Idha pana , bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ sātaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ sātaccakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ sātaccakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Samādhimūlakasappāyakārīsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "671"
      },
      ". Sāvatthinidānaṃ ",
      ". ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ sappāyakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sappāyakārī hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ sappāyakārī. Idha ",
      " pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ sappāyakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ sappāyakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Dasamaṃ. (Samādhimūlakaṃ.)"
    ],
    "innerText": "671. Sāvatthinidānaṃ . ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ sappāyakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sappāyakārī hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ sappāyakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ sappāyakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ sappāyakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Dasamaṃ. (Samādhimūlakaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Samāpattimūlakaṭhitisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "672"
      },
      ". Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ ṭhitikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ ṭhitikusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco ",
      " jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ ṭhitikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ ṭhitikusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ ṭhitikusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Ekādasamaṃ."
    ],
    "innerText": "672. Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ ṭhitikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ ṭhitikusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ ṭhitikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ ṭhitikusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ ṭhitikusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Ekādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "12. Samāpattimūlakavuṭṭhānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "673"
      },
      ". Sāvatthinidānaṃ ",
      ". ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ vuṭṭhānakusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca ",
      " samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ",
      " ca hoti, samādhismiṃ vuṭṭhānakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī …pe… pavaro cā’’ti. Dvādasamaṃ."
    ],
    "innerText": "673. Sāvatthinidānaṃ . ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ vuṭṭhānakusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ vuṭṭhānakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī …pe… pavaro cā’’ti. Dvādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "13. Samāpattimūlakakallitasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "674"
      },
      ". Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ kallitakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ kallitakusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ kallitakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ",
      " ca hoti, samādhismiṃ kallitakusalo ca. Tatra…pe… pavaro cā’’ti. Terasamaṃ."
    ],
    "innerText": "674. Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ kallitakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ kallitakusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ kallitakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ kallitakusalo ca. Tatra…pe… pavaro cā’’ti. Terasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "14. Samāpattimūlakaārammaṇasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "675"
      },
      ". Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ ārammaṇakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ ārammaṇakusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ ārammaṇakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ ārammaṇakusalo ca. Tatra…pe… pavaro cā’’ti. Cuddasamaṃ."
    ],
    "innerText": "675. Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ ārammaṇakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ ārammaṇakusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ ārammaṇakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ ārammaṇakusalo ca. Tatra…pe… pavaro cā’’ti. Cuddasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "15. Samāpattimūlakagocarasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "676"
      },
      ". Sāvatthinidānaṃ ",
      ". ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ",
      " hoti, na samādhismiṃ gocarakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ gocarakusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ gocarakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ",
      " ca hoti, samādhismiṃ gocarakusalo ca. Tatra…pe… pavaro cā’’ti. Pannarasamaṃ."
    ],
    "innerText": "676. Sāvatthinidānaṃ . ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ gocarakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ gocarakusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ gocarakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ gocarakusalo ca. Tatra…pe… pavaro cā’’ti. Pannarasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "16. Samāpattimūlakaabhinīhārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "677"
      },
      ". Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ ",
      " abhinīhārakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ abhinīhārakusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ abhinīhārakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ abhinīhārakusalo ca. Tatra…pe… pavaro cā’’ti. Soḷasamaṃ."
    ],
    "innerText": "677. Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ abhinīhārakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ abhinīhārakusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ abhinīhārakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ abhinīhārakusalo ca. Tatra…pe… pavaro cā’’ti. Soḷasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "17. Samāpattimūlakasakkaccasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "678"
      },
      ". Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ sakkaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sakkaccakārī hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ sakkaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ sakkaccakārī ca. Tatra…pe… pavaro cā’’ti. Sattarasamaṃ."
    ],
    "innerText": "678. Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ sakkaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sakkaccakārī hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ sakkaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ sakkaccakārī ca. Tatra…pe… pavaro cā’’ti. Sattarasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "18. Samāpattimūlakasātaccasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "679"
      },
      ". Sāvatthinidānaṃ ",
      ". ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ sātaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sātaccakārī hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ sātaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ",
      " ca hoti, samādhismiṃ sātaccakārī ca. Tatra…pe… pavaro cā’’ti. Aṭṭhārasamaṃ."
    ],
    "innerText": "679. Sāvatthinidānaṃ . ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ sātaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sātaccakārī hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ sātaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ sātaccakārī ca. Tatra…pe… pavaro cā’’ti. Aṭṭhārasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "19. Samāpattimūlakasappāyakārīsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "680"
      },
      ". Sāvatthinidānaṃ ",
      ". ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha ",
      ", bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ sappāyakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sappāyakārī hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ sappāyakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ sappāyakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samāpattikusalo ca hoti samādhismiṃ sappāyakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo tatra aggamakkhāyati; evameva kho, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samāpattikusalo ca hoti samādhismiṃ sappāyakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro cā’’ti. Ekūnavīsatimaṃ. (Samāpattimūlakaṃ.)"
    ],
    "innerText": "680. Sāvatthinidānaṃ . ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha , bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ sappāyakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sappāyakārī hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ sappāyakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ sappāyakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samāpattikusalo ca hoti samādhismiṃ sappāyakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo tatra aggamakkhāyati; evameva kho, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samāpattikusalo ca hoti samādhismiṃ sappāyakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro cā’’ti. Ekūnavīsatimaṃ. (Samāpattimūlakaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "20-27. Ṭhitimūlakavuṭṭhānasuttādiaṭṭhakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "681-688"
      },
      ". Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave ",
      ", ekacco jhāyī samādhismiṃ ṭhitikusalo hoti, na samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ vuṭṭhānakusalo hoti, na samādhismiṃ ṭhitikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ ṭhitikusalo hoti, na ca samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco ",
      " jhāyī samādhismiṃ ṭhitikusalo ca hoti, samādhismiṃ vuṭṭhānakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī…pe… uttamo ca pavaro cā’’ti. Vīsatimaṃ. (Purimamūlakāni viya yāva sattavīsatimā ṭhitimūlakasappāyakārīsuttā aṭṭha suttāni pūretabbāni. Ṭhitimūlakaṃ ",
      ".)"
    ],
    "innerText": "681-688. Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave , ekacco jhāyī samādhismiṃ ṭhitikusalo hoti, na samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ vuṭṭhānakusalo hoti, na samādhismiṃ ṭhitikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ ṭhitikusalo hoti, na ca samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ ṭhitikusalo ca hoti, samādhismiṃ vuṭṭhānakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī…pe… uttamo ca pavaro cā’’ti. Vīsatimaṃ. (Purimamūlakāni viya yāva sattavīsatimā ṭhitimūlakasappāyakārīsuttā aṭṭha suttāni pūretabbāni. Ṭhitimūlakaṃ .)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "28-34. Vuṭṭhānamūlakakallitasuttādisattakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "689-695"
      },
      ". Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ vuṭṭhānakusalo hoti, na ",
      " samādhismiṃ kallitakusalo… samādhismiṃ ",
      " kallitakusalo hoti, na samādhismiṃ vuṭṭhānakusalo… neva samādhismiṃ vuṭṭhānakusalo hoti, na ca samādhismiṃ kallitakusalo… samādhismiṃ vuṭṭhānakusalo ca hoti samādhismiṃ kallitakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī…pe… uttamo ca pavaro cā’’ti. Aṭṭhavīsatimaṃ. (Purimamūlakāni viya yāva catuttiṃsatimā vuṭṭhānamūlakasappāyakārīsuttā satta suttāni pūretabbāni. Vuṭṭhānamūlakaṃ.)"
    ],
    "innerText": "689-695. Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ vuṭṭhānakusalo hoti, na samādhismiṃ kallitakusalo… samādhismiṃ kallitakusalo hoti, na samādhismiṃ vuṭṭhānakusalo… neva samādhismiṃ vuṭṭhānakusalo hoti, na ca samādhismiṃ kallitakusalo… samādhismiṃ vuṭṭhānakusalo ca hoti samādhismiṃ kallitakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī…pe… uttamo ca pavaro cā’’ti. Aṭṭhavīsatimaṃ. (Purimamūlakāni viya yāva catuttiṃsatimā vuṭṭhānamūlakasappāyakārīsuttā satta suttāni pūretabbāni. Vuṭṭhānamūlakaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "35-40. Kallitamūlakaārammaṇasuttādichakkaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "696-701"
      },
      ". Sāvatthinidānaṃ ",
      "… ‘‘samādhismiṃ kallitakusalo hoti, na samādhismiṃ ārammaṇakusalo… samādhismiṃ ārammaṇakusalo hoti, na samādhismiṃ kallitakusalo… neva samādhismiṃ kallitakusalo hoti, na ca samādhismiṃ ārammaṇakusalo… samādhismiṃ kallitakusalo ca hoti, samādhismiṃ ārammaṇakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī…pe… uttamo ca pavaro cā’’ti. Pañcatiṃsatimaṃ. (Purimamūlakāni viya yāva cattālīsamā kallitamūlakasappāyakārīsuttā cha suttāni pūretabbāni. Kallitamūlakaṃ.)"
    ],
    "innerText": "696-701. Sāvatthinidānaṃ … ‘‘samādhismiṃ kallitakusalo hoti, na samādhismiṃ ārammaṇakusalo… samādhismiṃ ārammaṇakusalo hoti, na samādhismiṃ kallitakusalo… neva samādhismiṃ kallitakusalo hoti, na ca samādhismiṃ ārammaṇakusalo… samādhismiṃ kallitakusalo ca hoti, samādhismiṃ ārammaṇakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī…pe… uttamo ca pavaro cā’’ti. Pañcatiṃsatimaṃ. (Purimamūlakāni viya yāva cattālīsamā kallitamūlakasappāyakārīsuttā cha suttāni pūretabbāni. Kallitamūlakaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "41-45. Ārammaṇamūlakagocarasuttādipañcakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "702-706"
      },
      ". Sāvatthinidānaṃ ",
      "… ‘‘samādhismiṃ ārammaṇakusalo hoti, na samādhismiṃ gocarakusalo… samādhismiṃ gocarakusalo hoti, na samādhismiṃ ārammaṇakusalo… neva samādhismiṃ ārammaṇakusalo hoti, na ca samādhismiṃ ",
      " gocarakusalo… samādhismiṃ ārammaṇakusalo ca hoti, samādhismiṃ gocarakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī…pe… uttamo ca pavaro cā’’ti. Ekacattālīsamaṃ. (Purimamūlakāni viya yāva pañcacattālīsamā ārammaṇamūlakasappāyakārīsuttā pañca suttāni pūretabbāni. Ārammaṇamūlakaṃ ",
      ".)"
    ],
    "innerText": "702-706. Sāvatthinidānaṃ … ‘‘samādhismiṃ ārammaṇakusalo hoti, na samādhismiṃ gocarakusalo… samādhismiṃ gocarakusalo hoti, na samādhismiṃ ārammaṇakusalo… neva samādhismiṃ ārammaṇakusalo hoti, na ca samādhismiṃ gocarakusalo… samādhismiṃ ārammaṇakusalo ca hoti, samādhismiṃ gocarakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī…pe… uttamo ca pavaro cā’’ti. Ekacattālīsamaṃ. (Purimamūlakāni viya yāva pañcacattālīsamā ārammaṇamūlakasappāyakārīsuttā pañca suttāni pūretabbāni. Ārammaṇamūlakaṃ .)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "46-49. Gocaramūlakaabhinīhārasuttādicatukkaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "707"
      },
      ". Sāvatthinidānaṃ… ‘‘samādhismiṃ gocarakusalo hoti, na samādhismiṃ abhinīhārakusalo… samādhismiṃ abhinīhārakusalo hoti ",
      ", na samādhismiṃ gocarakusalo… neva samādhismiṃ gocarakusalo hoti, na ca samādhismiṃ abhinīhārakusalo… samādhismiṃ gocarakusalo ca hoti, samādhismiṃ abhinīhārakusalo ca… seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo tatra aggamakkhāyati; evameva kho, bhikkhave, yvāyaṃ jhāyī samādhismiṃ gocarakusalo ca hoti samādhismiṃ abhinīhārakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ…pe… uttamo ca pavaro cā’’ti. Chacattālīsamaṃ."
    ],
    "innerText": "707. Sāvatthinidānaṃ… ‘‘samādhismiṃ gocarakusalo hoti, na samādhismiṃ abhinīhārakusalo… samādhismiṃ abhinīhārakusalo hoti , na samādhismiṃ gocarakusalo… neva samādhismiṃ gocarakusalo hoti, na ca samādhismiṃ abhinīhārakusalo… samādhismiṃ gocarakusalo ca hoti, samādhismiṃ abhinīhārakusalo ca… seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo tatra aggamakkhāyati; evameva kho, bhikkhave, yvāyaṃ jhāyī samādhismiṃ gocarakusalo ca hoti samādhismiṃ abhinīhārakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ…pe… uttamo ca pavaro cā’’ti. Chacattālīsamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "708"
      },
      ". Samādhismiṃ gocarakusalo hoti, na samādhismiṃ sakkaccakārī…pe…. Vitthāretabbaṃ. Sattacattālīsamaṃ."
    ],
    "innerText": "708. Samādhismiṃ gocarakusalo hoti, na samādhismiṃ sakkaccakārī…pe…. Vitthāretabbaṃ. Sattacattālīsamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "709"
      },
      ". Samādhismiṃ gocarakusalo hoti, na samādhismiṃ sātaccakārī…pe…. Aṭṭhacattālīsamaṃ."
    ],
    "innerText": "709. Samādhismiṃ gocarakusalo hoti, na samādhismiṃ sātaccakārī…pe…. Aṭṭhacattālīsamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "710"
      },
      ". Samādhismiṃ gocarakusalo hoti, na samādhismiṃ sappāyakārī…pe…. Ekūnapaññāsamaṃ. (Gocaramūlakaṃ.)"
    ],
    "innerText": "710. Samādhismiṃ gocarakusalo hoti, na samādhismiṃ sappāyakārī…pe…. Ekūnapaññāsamaṃ. (Gocaramūlakaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "50-52. Abhinīhāramūlakasakkaccasuttāditikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "711"
      },
      ". Sāvatthinidānaṃ ",
      "… ‘‘samādhismiṃ abhinīhārakusalo hoti, na ",
      " samādhismiṃ sakkaccakārī… samādhismiṃ sakkaccakārī hoti, na samādhismiṃ abhinīhārakusalo… neva samādhismiṃ abhinīhārakusalo hoti, na ca samādhismiṃ sakkaccakārī… samādhismiṃ abhinīhārakusalo ca hoti, samādhismiṃ sakkaccakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī…pe… uttamo ca pavaro cā’’ti. Paññāsamaṃ."
    ],
    "innerText": "711. Sāvatthinidānaṃ … ‘‘samādhismiṃ abhinīhārakusalo hoti, na samādhismiṃ sakkaccakārī… samādhismiṃ sakkaccakārī hoti, na samādhismiṃ abhinīhārakusalo… neva samādhismiṃ abhinīhārakusalo hoti, na ca samādhismiṃ sakkaccakārī… samādhismiṃ abhinīhārakusalo ca hoti, samādhismiṃ sakkaccakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī…pe… uttamo ca pavaro cā’’ti. Paññāsamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "712"
      },
      ". Samādhismiṃ abhinīhārakusalo hoti, na samādhismiṃ sātaccakārī…pe…. Ekapaññāsamaṃ."
    ],
    "innerText": "712. Samādhismiṃ abhinīhārakusalo hoti, na samādhismiṃ sātaccakārī…pe…. Ekapaññāsamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "713"
      },
      ". Samādhismiṃ abhinīhārakusalo hoti, na samādhismiṃ sappāyakārī…pe…. Dvepaññāsamaṃ. (Abhinīhāramūlakaṃ.)"
    ],
    "innerText": "713. Samādhismiṃ abhinīhārakusalo hoti, na samādhismiṃ sappāyakārī…pe…. Dvepaññāsamaṃ. (Abhinīhāramūlakaṃ.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "53-54. Sakkaccamūlakasātaccakārīsuttādidukaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "714"
      },
      ". Sāvatthinidānaṃ ",
      "… ‘‘samādhismiṃ sakkaccakārī hoti, na samādhismiṃ sātaccakārī… samādhismiṃ sātaccakārī hoti, na samādhismiṃ sakkaccakārī ",
      "… neva samādhismiṃ sakkaccakārī hoti, na ca samādhismiṃ sātaccakārī… samādhismiṃ sakkaccakārī ca hoti, samādhismiṃ sātaccakārī ca. Tatra, bhikkhave, yvāyaṃ…pe… uttamo ca pavaro cā’’ti. Tepaññāsamaṃ."
    ],
    "innerText": "714. Sāvatthinidānaṃ … ‘‘samādhismiṃ sakkaccakārī hoti, na samādhismiṃ sātaccakārī… samādhismiṃ sātaccakārī hoti, na samādhismiṃ sakkaccakārī … neva samādhismiṃ sakkaccakārī hoti, na ca samādhismiṃ sātaccakārī… samādhismiṃ sakkaccakārī ca hoti, samādhismiṃ sātaccakārī ca. Tatra, bhikkhave, yvāyaṃ…pe… uttamo ca pavaro cā’’ti. Tepaññāsamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "715"
      },
      ". Samādhismiṃ sakkaccakārī hoti, na samādhismiṃ sappāyakārī…pe…. Catupaññāsamaṃ."
    ],
    "innerText": "715. Samādhismiṃ sakkaccakārī hoti, na samādhismiṃ sappāyakārī…pe…. Catupaññāsamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "55. Sātaccamūlakasappāyakārīsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "716"
      },
      ". Sāvatthinidānaṃ. ‘‘Catārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave ",
      ", ekacco jhāyī samādhismiṃ sātaccakārī hoti, na samādhismiṃ sappāyakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sappāyakārī hoti, na samādhismiṃ sātaccakārī. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ sātaccakārī hoti, na ca samādhismiṃ sappāyakārī. Idha ",
      " pana, bhikkhave, ekacco jhāyī samādhismiṃ sātaccakārī ca hoti, samādhismiṃ sappāyakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ sātaccakārī ca hoti samādhismiṃ sappāyakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo tatra aggamakkhāyati; evameva kho, bhikkhave, yvāyaṃ jhāyī samādhismiṃ sātaccakārī ca hoti, samādhismiṃ sappāyakārī ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro cā’’ti. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Pañcapaññāsamaṃ. (Yathā pañcapaññāsaṃ veyyākaraṇāni honti tathā vitthāretabbāni.)"
    ],
    "innerText": "716. Sāvatthinidānaṃ. ‘‘Catārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave , ekacco jhāyī samādhismiṃ sātaccakārī hoti, na samādhismiṃ sappāyakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sappāyakārī hoti, na samādhismiṃ sātaccakārī. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ sātaccakārī hoti, na ca samādhismiṃ sappāyakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sātaccakārī ca hoti, samādhismiṃ sappāyakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ sātaccakārī ca hoti samādhismiṃ sappāyakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo tatra aggamakkhāyati; evameva kho, bhikkhave, yvāyaṃ jhāyī samādhismiṃ sātaccakārī ca hoti, samādhismiṃ sappāyakārī ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro cā’’ti. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Pañcapaññāsamaṃ. (Yathā pañcapaññāsaṃ veyyākaraṇāni honti tathā vitthāretabbāni.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      "Jhānasaṃyuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samādhisaṃyuttaṃ (syā. kaṃ.)]"
      },
      " samattaṃ."
    ],
    "innerText": "Jhānasaṃyuttaṃ [samādhisaṃyuttaṃ (syā. kaṃ.)] samattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Samādhi ",
      " samāpatti ṭhiti ca, vuṭṭhānaṃ kallitārammaṇena ca;"
    ],
    "innerText": "Samādhi samāpatti ṭhiti ca, vuṭṭhānaṃ kallitārammaṇena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gocarā abhinīhāro sakkacca, sātacca athopi sappāyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Khandhavaggo tatiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Khandha rādhasaṃyuttañca, diṭṭhiokkanta ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[okkanti (sabbattha)]"
      },
      " uppādā;"
    ],
    "innerText": "Khandha rādhasaṃyuttañca, diṭṭhiokkanta [okkanti (sabbattha)] uppādā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Kilesa sāriputtā ca, nāgā supaṇṇa gandhabbā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Valāha vacchajhānanti ",
      ", khandhavaggamhi terasāti."
    ],
    "innerText": "Valāha vacchajhānanti , khandhavaggamhi terasāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Khandhavaggasaṃyuttapāḷi niṭṭhitā."
  }
]