[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "11. Valāhakasaṃyuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "550-606"
      },
      ". Valāhakasaṃyutte ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "valāhakakāyikā"
      },
      "ti valāhakanāmake devakāye uppannā ākāsacārikadevā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sītavalāhakā"
      },
      "ti sītakaraṇavalāhakā. Sesapadesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cetopaṇidhimanvāyā"
      },
      "ti cittaṭṭhapanaṃ āgamma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sītaṃ hotī"
      },
      "ti yaṃ vassāne vā hemante ",
      " vā sītaṃ hoti, taṃ utusamuṭṭhānameva. Yaṃ pana sītepi atisītaṃ, gimhe ca uppannaṃ sītaṃ, taṃ devatānubhāvena nibbattaṃ sītaṃ nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uṇhaṃ hotī"
      },
      "ti yaṃ gimhāne uṇhaṃ, taṃ utusamuṭṭhānikaṃ pākatikameva. Yaṃ pana uṇhepi atiuṇhaṃ, sītakāle ca uppannaṃ uṇhaṃ, taṃ devatānubhāvena nibbattaṃ uṇhaṃ nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abbhaṃ hotī"
      },
      "ti abbhamaṇḍapo hoti. Idhāpi yaṃ vassāne ca sisire ca abbhaṃ uppajjati, taṃ utusamuṭṭhānikaṃ pākatikameva. Yaṃ pana abbheyeva atiabbhaṃ, sattasattāhampi candasūriye chādetvā ekandhakāraṃ karoti, yañca cittavesākhamāsesu abbhaṃ, taṃ devatānubhāvena uppannaṃ abbhaṃ nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vāto hotī"
      },
      "ti yo tasmiṃ tasmiṃ utumhi uttaradakkhiṇādipakativāto hoti, ayaṃ utusamuṭṭhānova. Yopi pana rukkhakkhandhādipadālano ativāto nāma atthi, ayañceva, yo ca aññopi akālavāto, ayaṃ devatānubhāvanibbatto nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devo vassatī"
      },
      "ti yaṃ vassike cattāro māse vassaṃ, taṃ utusamuṭṭhānameva. Yaṃ pana vasseyeva ativassaṃ, yañca cittavesākhamāsesu vassaṃ, taṃ devatānubhāvanibbattaṃ nāma."
    ],
    "innerText": "550-606. Valāhakasaṃyutte valāhakakāyikāti valāhakanāmake devakāye uppannā ākāsacārikadevā. Sītavalāhakāti sītakaraṇavalāhakā. Sesapadesupi eseva nayo. Cetopaṇidhimanvāyāti cittaṭṭhapanaṃ āgamma. Sītaṃ hotīti yaṃ vassāne vā hemante vā sītaṃ hoti, taṃ utusamuṭṭhānameva. Yaṃ pana sītepi atisītaṃ, gimhe ca uppannaṃ sītaṃ, taṃ devatānubhāvena nibbattaṃ sītaṃ nāma. Uṇhaṃ hotīti yaṃ gimhāne uṇhaṃ, taṃ utusamuṭṭhānikaṃ pākatikameva. Yaṃ pana uṇhepi atiuṇhaṃ, sītakāle ca uppannaṃ uṇhaṃ, taṃ devatānubhāvena nibbattaṃ uṇhaṃ nāma. Abbhaṃ hotīti abbhamaṇḍapo hoti. Idhāpi yaṃ vassāne ca sisire ca abbhaṃ uppajjati, taṃ utusamuṭṭhānikaṃ pākatikameva. Yaṃ pana abbheyeva atiabbhaṃ, sattasattāhampi candasūriye chādetvā ekandhakāraṃ karoti, yañca cittavesākhamāsesu abbhaṃ, taṃ devatānubhāvena uppannaṃ abbhaṃ nāma. Vāto hotīti yo tasmiṃ tasmiṃ utumhi uttaradakkhiṇādipakativāto hoti, ayaṃ utusamuṭṭhānova. Yopi pana rukkhakkhandhādipadālano ativāto nāma atthi, ayañceva, yo ca aññopi akālavāto, ayaṃ devatānubhāvanibbatto nāma. Devo vassatīti yaṃ vassike cattāro māse vassaṃ, taṃ utusamuṭṭhānameva. Yaṃ pana vasseyeva ativassaṃ, yañca cittavesākhamāsesu vassaṃ, taṃ devatānubhāvanibbattaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatridaṃ vatthu – eko kira vassavalāhakadevaputto talakūṭakavāsi khīṇāsavattherassa santikaṃ gantvā vanditvā aṭṭhāsi. Thero ‘‘kosi tva’’nti pucchi. ‘‘Ahaṃ, bhante, vassavalāhakadevaputto’’ti. ‘‘Tumhākaṃ kira cittena devo vassatī’’ti? ‘‘Āma, bhante’’ti. ‘‘Passitukāmā maya’’nti ",
      ". ‘‘Temissatha, bhante’’ti. ‘‘Meghasīsaṃ vā gajjitaṃ vā na paññāyati, kathaṃ temissāmā’’ti? ‘‘Bhante, amhākaṃcittena devo vassati, tumhe paṇṇasālaṃ pavisathā’’ti ",
      ". ‘‘Sādhu devaputtā’’ti so pāde dhovitvā paṇṇasālaṃ pāvisi. Devaputto tasmiṃ pavisanteyeva ekaṃ gītaṃ gāyitvā hatthaṃ ukkhipi. Samantā tiyojanaṭṭhānaṃ ekameghaṃ ahosi. Thero addhatinto paṇṇasālaṃ paviṭṭhoti. Apica devo nāmesa aṭṭhahi kāraṇehi vassati nāgānubhāvena supaṇṇānubhāvena devatānubhāvena saccakiriyāya utusamuṭṭhānena mārāvaṭṭanena iddhibalena vināsameghenāti."
    ],
    "innerText": "Tatridaṃ vatthu – eko kira vassavalāhakadevaputto talakūṭakavāsi khīṇāsavattherassa santikaṃ gantvā vanditvā aṭṭhāsi. Thero ‘‘kosi tva’’nti pucchi. ‘‘Ahaṃ, bhante, vassavalāhakadevaputto’’ti. ‘‘Tumhākaṃ kira cittena devo vassatī’’ti? ‘‘Āma, bhante’’ti. ‘‘Passitukāmā maya’’nti . ‘‘Temissatha, bhante’’ti. ‘‘Meghasīsaṃ vā gajjitaṃ vā na paññāyati, kathaṃ temissāmā’’ti? ‘‘Bhante, amhākaṃcittena devo vassati, tumhe paṇṇasālaṃ pavisathā’’ti . ‘‘Sādhu devaputtā’’ti so pāde dhovitvā paṇṇasālaṃ pāvisi. Devaputto tasmiṃ pavisanteyeva ekaṃ gītaṃ gāyitvā hatthaṃ ukkhipi. Samantā tiyojanaṭṭhānaṃ ekameghaṃ ahosi. Thero addhatinto paṇṇasālaṃ paviṭṭhoti. Apica devo nāmesa aṭṭhahi kāraṇehi vassati nāgānubhāvena supaṇṇānubhāvena devatānubhāvena saccakiriyāya utusamuṭṭhānena mārāvaṭṭanena iddhibalena vināsameghenāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Valāhakasaṃyuttavaṇṇanā niṭṭhitā."
  }
]