[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammāsambuddhassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "nikaya"
    },
    "innerText": "Saṃyuttanikāye"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "book"
    },
    "innerText": "Sagāthāvaggaṭīkā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subsubhead"
    },
    "innerText": "Ganthārambhakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Saṃvaṇṇanārambhe ",
      " ratanattayavandanā saṃvaṇṇetabbassa dhammassa pabhavanissayavisuddhipaṭivedanatthaṃ, taṃ pana dhammasaṃvaṇṇanāsu viññūnaṃ bahumānuppādanatthaṃ, taṃ sammadeva tesaṃ uggahaṇadhāraṇādikkamaladdhabbāya sammāpaṭipattiyā sabbahitasukhanipphādanatthanti. Atha vā maṅgalabhāvato, sabbakiriyāsu pubbakiccabhāvato, paṇḍitehi samācaritabhāvato, āyatiṃ paresaṃ diṭṭhānugatiāpajjanato ca saṃvaṇṇanāyaṃ ratanattayapaṇāmakiriyāti. Atha vā ratanattayapaṇāmakaraṇaṃ pūjanīyapūjāpuññavisesanibbattanatthaṃ, taṃ attano yathāladdhasampattinimittakassa kammassa balānuppadānatthaṃ, antarā ca tassa asaṃkocāpanatthaṃ, tadubhayaṃ anantarāyena aṭṭhakathāya parisamāpanatthanti idameva ca payojanaṃ ācariyena idhādhippetaṃ. Tathā hi vakkhati ‘‘iti me pasannamatino…pe… tassānubhāvenā’’ti. Vatthuttayapūjā hi niratisayapuññakkhettasaṃbuddhiyā aparimeyyapabhāvo puññātisayoti bahuvidhantarāyepi lokasannivāse ",
      " antarāyanibandhanasakalasaṃkilesaviddhaṃsanāya pahoti, bhayādiupaddavañca nivāreti. Yathāha ‘‘pūjārahe pūjayato’’tiādi (dha. pa. 195; apa. thera 1.10.1), tathā ‘‘ye, bhikkhave, buddhe pasannā, agge te pasannā, agge kho pana pasannānaṃ aggo vipāko hotī’’tiādi (itivu. 90)."
    ],
    "innerText": "1. Saṃvaṇṇanārambhe ratanattayavandanā saṃvaṇṇetabbassa dhammassa pabhavanissayavisuddhipaṭivedanatthaṃ, taṃ pana dhammasaṃvaṇṇanāsu viññūnaṃ bahumānuppādanatthaṃ, taṃ sammadeva tesaṃ uggahaṇadhāraṇādikkamaladdhabbāya sammāpaṭipattiyā sabbahitasukhanipphādanatthanti. Atha vā maṅgalabhāvato, sabbakiriyāsu pubbakiccabhāvato, paṇḍitehi samācaritabhāvato, āyatiṃ paresaṃ diṭṭhānugatiāpajjanato ca saṃvaṇṇanāyaṃ ratanattayapaṇāmakiriyāti. Atha vā ratanattayapaṇāmakaraṇaṃ pūjanīyapūjāpuññavisesanibbattanatthaṃ, taṃ attano yathāladdhasampattinimittakassa kammassa balānuppadānatthaṃ, antarā ca tassa asaṃkocāpanatthaṃ, tadubhayaṃ anantarāyena aṭṭhakathāya parisamāpanatthanti idameva ca payojanaṃ ācariyena idhādhippetaṃ. Tathā hi vakkhati ‘‘iti me pasannamatino…pe… tassānubhāvenā’’ti. Vatthuttayapūjā hi niratisayapuññakkhettasaṃbuddhiyā aparimeyyapabhāvo puññātisayoti bahuvidhantarāyepi lokasannivāse antarāyanibandhanasakalasaṃkilesaviddhaṃsanāya pahoti, bhayādiupaddavañca nivāreti. Yathāha ‘‘pūjārahe pūjayato’’tiādi (dha. pa. 195; apa. thera 1.10.1), tathā ‘‘ye, bhikkhave, buddhe pasannā, agge te pasannā, agge kho pana pasannānaṃ aggo vipāko hotī’’tiādi (itivu. 90)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Buddhoti ",
      " kittayantassa, kāye bhavati yā pīti;"
    ],
    "innerText": "‘‘Buddhoti kittayantassa, kāye bhavati yā pīti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Varameva hi sā pīti, kasiṇenapi jambudīpassa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammoti…pe…, saṅghoti…pe…, jambudīpassā’’ti. (dī. ni. aṭṭha. 1.6);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Tathā ‘‘yasmiṃ, mahānāma, samaye ariyasāvako tathāgataṃ anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosa…pe… na mohapariyuṭṭhitaṃ cittaṃ hotī’’tiādi (a. ni. 6.10; 11.11). ‘‘Araññe rukkhamūle vā…pe… bhayaṃ vā chambhitattaṃ vā lomahaṃso na hessatī’’ti (saṃ. ni. 1.249) ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yassa vatthuttayassa vandanaṃ kattukāmo, tassa guṇātisayayogasandassanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘karuṇāsītalahadaya’’"
      },
      "ntiādinā gāthattayamāha. Guṇātisayayogena hi vandanārahabhāvo, vandanārahe ca katā vandanā yathādhippetaṃ payojanaṃ sādhetīti. Tattha yassā desanāya saṃvaṇṇanaṃ kattukāmo, sā na vinayadesanā viya karuṇāppadhānā, nāpi abhidhammadesanā viya paññāppadhānā, atha kho karuṇāpaññāppadhānāti tadubhayappadhānameva tāva sammāsambuddhassa thomanaṃ kātuṃ tammūlakattā sesaratanānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘karuṇāsītalahadaya’’"
      },
      "ntiādi vuttaṃ. Tattha kiratīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karuṇā,"
      },
      " paradukkhaṃ vikkhipati apanetīti attho. Atha vā kiṇātīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karuṇā,"
      },
      " paradukkhe sati kāruṇikaṃ hiṃsati vibādhatīti attho. Paradukkhe sati sādhūnaṃ kampanaṃ hadayakhedaṃ karotīti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karuṇā"
      },
      ". Atha vā kamiti sukhaṃ, taṃ rundhatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karuṇā"
      },
      ". Esā hi paradukkhāpanayanakāmatālakkhaṇā attasukhanirapekkhatāya kāruṇikānaṃ sukhaṃ rundhati vibandhatīti attho. Karuṇāya sītalaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karuṇāsītalaṃ,"
      },
      " karuṇāsītalaṃ hadayaṃ assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karuṇāsītalahadayo,"
      },
      " taṃ karuṇāsītalahadayaṃ."
    ],
    "innerText": "Tattha yassa vatthuttayassa vandanaṃ kattukāmo, tassa guṇātisayayogasandassanatthaṃ ‘‘karuṇāsītalahadaya’’ntiādinā gāthattayamāha. Guṇātisayayogena hi vandanārahabhāvo, vandanārahe ca katā vandanā yathādhippetaṃ payojanaṃ sādhetīti. Tattha yassā desanāya saṃvaṇṇanaṃ kattukāmo, sā na vinayadesanā viya karuṇāppadhānā, nāpi abhidhammadesanā viya paññāppadhānā, atha kho karuṇāpaññāppadhānāti tadubhayappadhānameva tāva sammāsambuddhassa thomanaṃ kātuṃ tammūlakattā sesaratanānaṃ ‘‘karuṇāsītalahadaya’’ntiādi vuttaṃ. Tattha kiratīti karuṇā, paradukkhaṃ vikkhipati apanetīti attho. Atha vā kiṇātīti karuṇā, paradukkhe sati kāruṇikaṃ hiṃsati vibādhatīti attho. Paradukkhe sati sādhūnaṃ kampanaṃ hadayakhedaṃ karotīti vā karuṇā. Atha vā kamiti sukhaṃ, taṃ rundhatīti karuṇā. Esā hi paradukkhāpanayanakāmatālakkhaṇā attasukhanirapekkhatāya kāruṇikānaṃ sukhaṃ rundhati vibandhatīti attho. Karuṇāya sītalaṃ karuṇāsītalaṃ, karuṇāsītalaṃ hadayaṃ assāti karuṇāsītalahadayo, taṃ karuṇāsītalahadayaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha kiñcāpi paresaṃ hitopasaṃhārasukhādiaparihānicchanasabhāvatāya, byāpādāratīnaṃ ujuvipaccanīkatāya ca sattasantānagatasantāpavicchedanākārapavattiyā mettāmuditānampi cittasītalabhāvakāraṇatā upalabbhati, tathāpi paradukkhāpanayanākārappavattiyā parūpatāpāsahanarasā avihiṃsābhūtā ",
      " karuṇāva visesena bhagavato cittassa cittapassaddhi viya sītibhāvanimittanti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘karuṇāsītalahadaya’’"
      },
      "nti. Karuṇāmukhena vā mettāmuditānampi hadayasītalabhāvakāraṇatā vuttāti daṭṭhabbā ",
      "."
    ],
    "innerText": "Tattha kiñcāpi paresaṃ hitopasaṃhārasukhādiaparihānicchanasabhāvatāya, byāpādāratīnaṃ ujuvipaccanīkatāya ca sattasantānagatasantāpavicchedanākārapavattiyā mettāmuditānampi cittasītalabhāvakāraṇatā upalabbhati, tathāpi paradukkhāpanayanākārappavattiyā parūpatāpāsahanarasā avihiṃsābhūtā karuṇāva visesena bhagavato cittassa cittapassaddhi viya sītibhāvanimittanti vuttaṃ ‘‘karuṇāsītalahadaya’’nti. Karuṇāmukhena vā mettāmuditānampi hadayasītalabhāvakāraṇatā vuttāti daṭṭhabbā ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā chaasādhāraṇañāṇavisesanibandhanabhūtā sātisayaṃ niravasesañca sabbaññutaññāṇaṃ viya savisayabyāpitāya mahākaruṇābhāvamupagatā karuṇāva bhagavato abhisayena hadayasītalabhāvahetūti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘karuṇāsītalahadaya’’"
      },
      "nti."
    ],
    "innerText": "Atha vā chaasādhāraṇañāṇavisesanibandhanabhūtā sātisayaṃ niravasesañca sabbaññutaññāṇaṃ viya savisayabyāpitāya mahākaruṇābhāvamupagatā karuṇāva bhagavato abhisayena hadayasītalabhāvahetūti āha ‘‘karuṇāsītalahadaya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha vā satipi mettāmuditānaṃ sātisaye hadayasītibhāvanibandhanatte sakalabuddhaguṇavisesakāraṇatāya tāsampi kāraṇanti karuṇāva bhagavato ‘‘hadayasītalabhāvakāraṇa’’nti vuttā. Karuṇānidānā hi sabbepi buddhaguṇā, karuṇānubhāvanibbāpiyamānasaṃsāradukkhasantāpassa hi bhagavato paradukkhāpanayanakāmatāya anekānipi asaṅkhyeyyāni kappānaṃ akilantarūpasseva niravasesabuddhakaradhammasambharaṇaniyatassa samadhigatadhammādhipateyyassa ca sannihitesupi sattasaṅghāṭasamupanītahadayūpatāpanimittesu na īsakampi cittasītibhāvassa aññathattamahosīti. Etasmiñca atthavikappe tīsupi avatthāsu bhagavato karuṇā saṅgahitāti daṭṭhabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pajānātīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññā,"
      },
      " yathāsabhāvaṃ pakārehi paṭivijjhatīti attho. Paññāva ñeyyāvaraṇappahānato pakārehi dhammasabhāvajotanaṭṭhena pajjototi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāpajjoto"
      },
      ". Savāsanappahānato visesena hataṃ samugghāṭitaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vihataṃ"
      },
      ". Paññāpajjotena vihataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāpajjotavihataṃ"
      },
      ". Muyhanti tena, sayaṃ vā muyhati, mohanamattameva vā tanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "moho,"
      },
      " avijjā. Sveva visayasabhāvapaṭicchādanakaraṇato andhakārasarikkhatāya tamo viyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tamo"
      },
      ". Paññāpajjotavihato mohatamo etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāpajjotavihatamohatamo,"
      },
      " taṃ paññāpajjotavihatamohatamaṃ. Sabbesampi hi khīṇāsavānaṃ satipi paññāpajjotena avijjandhakārassa vihatabhāve saddhādhimuttehi viya diṭṭhippattānaṃ sāvakehi paccekasambuddhehi ca savāsanappahānena sammāsambuddhānaṃ kilesappahānassa viseso vijjatīti sātisayena avijjāppahānena bhagavantaṃ thomento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paññāpajjotavihatamohatama’’"
      },
      "nti."
    ],
    "innerText": "Pajānātīti paññā, yathāsabhāvaṃ pakārehi paṭivijjhatīti attho. Paññāva ñeyyāvaraṇappahānato pakārehi dhammasabhāvajotanaṭṭhena pajjototi paññāpajjoto. Savāsanappahānato visesena hataṃ samugghāṭitaṃ vihataṃ. Paññāpajjotena vihataṃ paññāpajjotavihataṃ. Muyhanti tena, sayaṃ vā muyhati, mohanamattameva vā tanti moho, avijjā. Sveva visayasabhāvapaṭicchādanakaraṇato andhakārasarikkhatāya tamo viyāti tamo. Paññāpajjotavihato mohatamo etassāti paññāpajjotavihatamohatamo, taṃ paññāpajjotavihatamohatamaṃ. Sabbesampi hi khīṇāsavānaṃ satipi paññāpajjotena avijjandhakārassa vihatabhāve saddhādhimuttehi viya diṭṭhippattānaṃ sāvakehi paccekasambuddhehi ca savāsanappahānena sammāsambuddhānaṃ kilesappahānassa viseso vijjatīti sātisayena avijjāppahānena bhagavantaṃ thomento āha ‘‘paññāpajjotavihatamohatama’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā antarena paropadesaṃ attano santāne accantaṃ avijjandhakāravigamassa nibbattitattā, tathā sabbaññutāya balesu ca vasībhāvassa samadhigatattā, parasantatiyañca dhammadesanātisayānubhāvena sammadeva tassa ",
      " pavattitattā bhagavāva visesato mohatamavigamena thometabboti ",
      " āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paññāpajjotavihatamohatama’’"
      },
      "nti. Imasmiñca atthavikappe ‘‘paññāpajjoto’’ti padena bhagavato paṭivedhapaññā viya desanāpaññāpi sāmaññaniddesena, ekasesanayena vā saṅgahitāti daṭṭhabbā."
    ],
    "innerText": "Atha vā antarena paropadesaṃ attano santāne accantaṃ avijjandhakāravigamassa nibbattitattā, tathā sabbaññutāya balesu ca vasībhāvassa samadhigatattā, parasantatiyañca dhammadesanātisayānubhāvena sammadeva tassa pavattitattā bhagavāva visesato mohatamavigamena thometabboti āha ‘‘paññāpajjotavihatamohatama’’nti. Imasmiñca atthavikappe ‘‘paññāpajjoto’’ti padena bhagavato paṭivedhapaññā viya desanāpaññāpi sāmaññaniddesena, ekasesanayena vā saṅgahitāti daṭṭhabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā bhagavato ñāṇassa ñeyyapariyantikattā sakalañeyyadhammasabhāvāvabodhanasamatthena anāvaraṇañāṇasaṅkhātena paññāpajjotena sabbañeyyadhammasabhāvacchādakassa mohandhakārassa vidhamitattā anaññasādhāraṇo bhagavato mohatamavināsoti katvā vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paññāpajjotavihatamohatama’’"
      },
      "nti. Ettha ca mohatamavidhamanante adhigatattā anāvaraṇañāṇaṃ kāraṇūpacārena sasantāne mohatamavidhamananti daṭṭhabbaṃ. Abhinīhārasampattiyā savāsanappahānameva hi kilesānaṃ ñeyyāvaraṇapahānanti, parasantāne pana mohatamavidhamanassa kāraṇabhāvato phalūpacārena anāvaraṇañāṇaṃ ‘‘mohatamavidhamana’’nti vuccatīti."
    ],
    "innerText": "Atha vā bhagavato ñāṇassa ñeyyapariyantikattā sakalañeyyadhammasabhāvāvabodhanasamatthena anāvaraṇañāṇasaṅkhātena paññāpajjotena sabbañeyyadhammasabhāvacchādakassa mohandhakārassa vidhamitattā anaññasādhāraṇo bhagavato mohatamavināsoti katvā vuttaṃ ‘‘paññāpajjotavihatamohatama’’nti. Ettha ca mohatamavidhamanante adhigatattā anāvaraṇañāṇaṃ kāraṇūpacārena sasantāne mohatamavidhamananti daṭṭhabbaṃ. Abhinīhārasampattiyā savāsanappahānameva hi kilesānaṃ ñeyyāvaraṇapahānanti, parasantāne pana mohatamavidhamanassa kāraṇabhāvato phalūpacārena anāvaraṇañāṇaṃ ‘‘mohatamavidhamana’’nti vuccatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kiṃ pana kāraṇaṃ avijjāsamugghātoyeveko pahānasampattivasena bhagavato thomanānimittaṃ gayhati, na pana sātisayaṃ niravasesakilesapahānanti? Tappahānavacaneneva tadekaṭṭhatāya sakalasaṃkilesagaṇasamugghātassa jotitabhāvato. Na hi so tādiso kileso atthi, yo niravasesaavijjāppahānena na pahīyatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā vijjā viya sakalakusaladhammasamuppattiyā niravasesākusaladhammanibbattiyā saṃsārappavattiyā ca avijjā padhānakāraṇanti tabbighātavacanena sakalasaṃkilesagaṇasamugghāto vutto eva hotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paññāpajjotavihatamohatama’’"
      },
      "nti."
    ],
    "innerText": "Atha vā vijjā viya sakalakusaladhammasamuppattiyā niravasesākusaladhammanibbattiyā saṃsārappavattiyā ca avijjā padhānakāraṇanti tabbighātavacanena sakalasaṃkilesagaṇasamugghāto vutto eva hotīti vuttaṃ ‘‘paññāpajjotavihatamohatama’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Narā ca amarā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "narāmarā,"
      },
      " saha narāmarehīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sanarāmaro,"
      },
      " sanarāmaro ca so loko cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sanarāmaraloko,"
      },
      " tassa garūti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sanarāmaralokagaru,"
      },
      " taṃ sanarāmaralokagaruṃ. Etena devamanussānaṃ viya tadavasiṭṭhasattānampi yathārahaṃ guṇavisesāvahatāya bhagavato upakārataṃ dasseti. Na cettha padhānāppadhānabhāvo codetabbo. Añño hi saddakkamo, añño atthakkamo. Edisesu hi samāsapadesu padhānampi appadhānaṃ viya niddisīyati yathā ‘‘sarājikāya parisāyā’’ti ",
      " (apa. aṭṭha. 1.1.82). Kāmañcettha sattasaṅkhārokāsavasena tividho loko, garubhāvassa pana adhippetattā garukaraṇasamatthasseva sattalokassa vasena attho gahetabbo. So hi lokīyanti ettha puññapāpāni tabbipāko cāti ‘‘loko’’ti vuccati. Amaraggahaṇena cettha upapattidevā adhippetā."
    ],
    "innerText": "Narā ca amarā ca narāmarā, saha narāmarehīti sanarāmaro, sanarāmaro ca so loko cāti sanarāmaraloko, tassa garūti sanarāmaralokagaru, taṃ sanarāmaralokagaruṃ. Etena devamanussānaṃ viya tadavasiṭṭhasattānampi yathārahaṃ guṇavisesāvahatāya bhagavato upakārataṃ dasseti. Na cettha padhānāppadhānabhāvo codetabbo. Añño hi saddakkamo, añño atthakkamo. Edisesu hi samāsapadesu padhānampi appadhānaṃ viya niddisīyati yathā ‘‘sarājikāya parisāyā’’ti (apa. aṭṭha. 1.1.82). Kāmañcettha sattasaṅkhārokāsavasena tividho loko, garubhāvassa pana adhippetattā garukaraṇasamatthasseva sattalokassa vasena attho gahetabbo. So hi lokīyanti ettha puññapāpāni tabbipāko cāti ‘‘loko’’ti vuccati. Amaraggahaṇena cettha upapattidevā adhippetā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " vā samūhattho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "loka"
      },
      "-saddo samudāyavasena lokīyati paññāpīyatīti. Saha narehīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sanarā,"
      },
      " sanarā ca te amarā cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sanarāmarā,"
      },
      " tesaṃ lokoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sanarāmaraloko"
      },
      "ti purimanayeneva yojetabbaṃ. Amara-saddena cettha visuddhidevāpi saṅgayhanti. Te hi maraṇābhāvato paramatthato amarā, narāmarānaṃyeva gahaṇaṃ ukkaṭṭhaniddesavasena yathā ‘‘satthā devamanussāna’’nti (dī. ni. 1.157). Tathā hi sabbānatthapariharaṇapubbaṅgamāya niravasesahitasukhavidhānatapparāya niratisayāya payogasampattiyā sadevamanussāya pajāya accantamupakāritāya aparimitanirupamappabhāvaguṇavisesasamaṅgitāya ca sabbasattuttamo bhagavā aparimāṇāsu lokadhātūsu aparimāṇānaṃ sattānaṃ uttamaṃ gāravaṭṭhānaṃ. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sanarāmaralokagaru’’"
      },
      "nti."
    ],
    "innerText": "Atha vā samūhattho loka-saddo samudāyavasena lokīyati paññāpīyatīti. Saha narehīti sanarā, sanarā ca te amarā cāti sanarāmarā, tesaṃ lokoti sanarāmaralokoti purimanayeneva yojetabbaṃ. Amara-saddena cettha visuddhidevāpi saṅgayhanti. Te hi maraṇābhāvato paramatthato amarā, narāmarānaṃyeva gahaṇaṃ ukkaṭṭhaniddesavasena yathā ‘‘satthā devamanussāna’’nti (dī. ni. 1.157). Tathā hi sabbānatthapariharaṇapubbaṅgamāya niravasesahitasukhavidhānatapparāya niratisayāya payogasampattiyā sadevamanussāya pajāya accantamupakāritāya aparimitanirupamappabhāvaguṇavisesasamaṅgitāya ca sabbasattuttamo bhagavā aparimāṇāsu lokadhātūsu aparimāṇānaṃ sattānaṃ uttamaṃ gāravaṭṭhānaṃ. Tena vuttaṃ ‘‘sanarāmaralokagaru’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sobhanaṃ gataṃ gamanaṃ etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugato"
      },
      ". Bhagavato hi veneyyajanupasaṅkamanaṃ ekantena tesaṃ hitasukhanipphādanato sobhanaṃ, tathā lakkhaṇānubyañjanapaṭimaṇḍitarūpakāyatāya dutavilambitakhalitānukaḍḍhananippīḷanukkuṭikakuṭilākulatādi- dosarahitamavahasitarājahaṃsavasabhavāraṇamigarājagamanaṃ kāyagamanaṃ ñāṇagamanañca vipulanimmalakaruṇāsativīriyādiguṇavisesasahitamabhinīhārato yāva mahābodhi niravajjatāya sobhanamevāti."
    ],
    "innerText": "Sobhanaṃ gataṃ gamanaṃ etassāti sugato. Bhagavato hi veneyyajanupasaṅkamanaṃ ekantena tesaṃ hitasukhanipphādanato sobhanaṃ, tathā lakkhaṇānubyañjanapaṭimaṇḍitarūpakāyatāya dutavilambitakhalitānukaḍḍhananippīḷanukkuṭikakuṭilākulatādi- dosarahitamavahasitarājahaṃsavasabhavāraṇamigarājagamanaṃ kāyagamanaṃ ñāṇagamanañca vipulanimmalakaruṇāsativīriyādiguṇavisesasahitamabhinīhārato yāva mahābodhi niravajjatāya sobhanamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā sayambhūñāṇena sakalamapi lokaṃ pariññābhisamayavasena parijānanto ñāṇena sammā gato avagatoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugato,"
      },
      " tathā lokasamudayaṃ pahānābhisamayavasena pajahanto anuppattidhammataṃ āpādento sammā gato atītoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugato,"
      },
      " lokanirodhaṃ nibbānaṃ sacchikiriyābhisamayavasena sammā gato adhigatoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugato,"
      },
      " lokanirodhagāminiṃ paṭipadaṃ bhāvanābhisamayavasena sammā ",
      " gato paṭipannoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugato"
      },
      ". ‘‘Sotāpattimaggena ye kilesā pahīnā, te kilese na puneti na pacceti na paccāgacchatīti sugato’’tiādinā nayena (mahāni. 38) ayamattho vibhāvetabboti."
    ],
    "innerText": "Atha vā sayambhūñāṇena sakalamapi lokaṃ pariññābhisamayavasena parijānanto ñāṇena sammā gato avagatoti sugato, tathā lokasamudayaṃ pahānābhisamayavasena pajahanto anuppattidhammataṃ āpādento sammā gato atītoti sugato, lokanirodhaṃ nibbānaṃ sacchikiriyābhisamayavasena sammā gato adhigatoti sugato, lokanirodhagāminiṃ paṭipadaṃ bhāvanābhisamayavasena sammā gato paṭipannoti sugato. ‘‘Sotāpattimaggena ye kilesā pahīnā, te kilese na puneti na pacceti na paccāgacchatīti sugato’’tiādinā nayena (mahāni. 38) ayamattho vibhāvetabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā sundaraṃ ṭhānaṃ sammāsambodhiṃ, nibbānameva vā gato adhigatoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugato"
      },
      ". Yasmā vā bhūtaṃ tacchaṃ atthasaṃhitaṃ veneyyānaṃ yathārahaṃ kālayuttameva ca dhammaṃ bhāsati, tasmā sammā gadati vadatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugato"
      },
      " da-kārassa ta-kāraṃ katvā. Iti sobhanagamanatādīhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugato,"
      },
      " taṃ sugataṃ."
    ],
    "innerText": "Atha vā sundaraṃ ṭhānaṃ sammāsambodhiṃ, nibbānameva vā gato adhigatoti sugato. Yasmā vā bhūtaṃ tacchaṃ atthasaṃhitaṃ veneyyānaṃ yathārahaṃ kālayuttameva ca dhammaṃ bhāsati, tasmā sammā gadati vadatīti sugato da-kārassa ta-kāraṃ katvā. Iti sobhanagamanatādīhi sugato, taṃ sugataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puññapāpakehi upapajjanavasena gantabbato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gatiyo,"
      },
      " upapattibhavavisesā. Tā pana nirayādivasena pañcavidhā. Tā hi sakalassapi bhavagāmikammassa ariyamaggādhigamena avipākārahabhāvakaraṇena ",
      " nivattitattā bhagavā pañcahipi gatīhi suṭṭhu mutto visaṃyuttoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘gativimutta’’"
      },
      "nti. Etena bhagavato katthacipi apariyāpannataṃ dasseti, yato bhagavā ‘‘devātidevo’’ti vuccati. Tenāha –"
    ],
    "innerText": "Puññapāpakehi upapajjanavasena gantabbato gatiyo, upapattibhavavisesā. Tā pana nirayādivasena pañcavidhā. Tā hi sakalassapi bhavagāmikammassa ariyamaggādhigamena avipākārahabhāvakaraṇena nivattitattā bhagavā pañcahipi gatīhi suṭṭhu mutto visaṃyuttoti āha ‘‘gativimutta’’nti. Etena bhagavato katthacipi apariyāpannataṃ dasseti, yato bhagavā ‘‘devātidevo’’ti vuccati. Tenāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yena devūpapatyassa, gandhabbo vā vihaṅgamo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Yakkhattaṃ yena gaccheyyaṃ, manussattañca abbaje;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Te mayhaṃ āsavā khīṇā, viddhastā vinaḷīkatā’’ti. (a. ni. 4.36);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Taṃtaṃgatisaṃvattanakānañhi kammakilesānaṃ aggamaggena bodhimūleyeva suppahīnattā natthi bhagavato gatipariyāpannatāti accantameva bhagavā sabbabhavayonigativiññāṇaṭṭhitisattāvāsasattanikāyehi suparimutto. Taṃ gativimuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vande"
      },
      "ti namāmi, thomemīti vā attho."
    ],
    "innerText": "Taṃtaṃgatisaṃvattanakānañhi kammakilesānaṃ aggamaggena bodhimūleyeva suppahīnattā natthi bhagavato gatipariyāpannatāti accantameva bhagavā sabbabhavayonigativiññāṇaṭṭhitisattāvāsasattanikāyehi suparimutto. Taṃ gativimuttaṃ. Vandeti namāmi, thomemīti vā attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gativimutta"
      },
      "nti anupādisesanibbānadhātuppattiyā bhagavantaṃ thometi. Ettha hi dvīhi ākārehi bhagavato thomanā veditabbā attahitasampattito parahitapaṭipattito ca. Tesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attahitasampatti"
      },
      " anāvaraṇañāṇādhigamato, savāsanānaṃ sabbesaṃ kilesānaṃ accantapahānato, anupādisesanibbānappattito ca veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parahitapaṭipatti"
      },
      " lābhasakkārādinirapekkhacittassa sabbadukkhaniyyānikadhammadesanato, viruddhesupi niccaṃ hitajjhāsayavasena ñāṇaparipākakālāgamanato ca. Sā panettha āsayato payogato ca duvidhā parahitapaṭipatti, tividhā ",
      " ca attahitasampatti pakāsitā hoti, kathaṃ? ‘‘Karuṇāsītalahadaya’’nti etena āsayato parahitapaṭipatti, sammāgadanatthena sugata-saddena payogato parahitapaṭipatti, ‘‘paññāpajjotavihatamohatamaṃ gativimutta’’nti etehi catusaccapaṭivedhatthena ca sugata-saddena tividhāpi attahitasampatti, avasiṭṭhatthena tena ‘‘paññāpajjotavihatamohatama’’nti etena ca sabbāpi attahitasampatti parahitapaṭipatti pakāsitā hotīti."
    ],
    "innerText": "Atha vā gativimuttanti anupādisesanibbānadhātuppattiyā bhagavantaṃ thometi. Ettha hi dvīhi ākārehi bhagavato thomanā veditabbā attahitasampattito parahitapaṭipattito ca. Tesu attahitasampatti anāvaraṇañāṇādhigamato, savāsanānaṃ sabbesaṃ kilesānaṃ accantapahānato, anupādisesanibbānappattito ca veditabbā. Parahitapaṭipatti lābhasakkārādinirapekkhacittassa sabbadukkhaniyyānikadhammadesanato, viruddhesupi niccaṃ hitajjhāsayavasena ñāṇaparipākakālāgamanato ca. Sā panettha āsayato payogato ca duvidhā parahitapaṭipatti, tividhā ca attahitasampatti pakāsitā hoti, kathaṃ? ‘‘Karuṇāsītalahadaya’’nti etena āsayato parahitapaṭipatti, sammāgadanatthena sugata-saddena payogato parahitapaṭipatti, ‘‘paññāpajjotavihatamohatamaṃ gativimutta’’nti etehi catusaccapaṭivedhatthena ca sugata-saddena tividhāpi attahitasampatti, avasiṭṭhatthena tena ‘‘paññāpajjotavihatamohatama’’nti etena ca sabbāpi attahitasampatti parahitapaṭipatti pakāsitā hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā tīhi ākārehi bhagavato thomanā veditabbā – hetuto phalato upakārato ca. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetu"
      },
      " mahākaruṇā, sā paṭhamapadena dassitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phalaṃ"
      },
      " catubbidhaṃ ñāṇasampadā pahānasampadā ānubhāvasampadā rūpakāyasampadā cāti. Tāsu ñāṇapahānasampadā dutiyapadena saccapaṭivedhatthena ca sugata-saddena pakāsitā honti, ānubhāvasampadā pana tatiyapadena, rūpakāyasampadā yathāvuttakāyagamanasobhanatthena sugata-saddena lakkhaṇānubyañjanapāripūriyā vinā tadabhāvato ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upakāro"
      },
      " anantaraṃ abāhiraṃ karitvā tividhayānamukhena vimuttidhammadesanā. So sammāgadanatthena sugata-saddena pakāsito hotīti veditabbaṃ."
    ],
    "innerText": "Atha vā tīhi ākārehi bhagavato thomanā veditabbā – hetuto phalato upakārato ca. Tattha hetu mahākaruṇā, sā paṭhamapadena dassitā. Phalaṃ catubbidhaṃ ñāṇasampadā pahānasampadā ānubhāvasampadā rūpakāyasampadā cāti. Tāsu ñāṇapahānasampadā dutiyapadena saccapaṭivedhatthena ca sugata-saddena pakāsitā honti, ānubhāvasampadā pana tatiyapadena, rūpakāyasampadā yathāvuttakāyagamanasobhanatthena sugata-saddena lakkhaṇānubyañjanapāripūriyā vinā tadabhāvato . Upakāro anantaraṃ abāhiraṃ karitvā tividhayānamukhena vimuttidhammadesanā. So sammāgadanatthena sugata-saddena pakāsito hotīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ‘‘karuṇāsītalahadaya’’nti etena sammāsambodhiyā mūlaṃ dasseti. Mahākaruṇāya sañcoditamānaso hi bhagavā saṃsārapaṅkato sattānaṃ samuddharaṇatthaṃ katābhinīhāro anupubbena pāramiyo pūretvā anuttaraṃ sammāsambodhiṃ adhigatoti karuṇā sammāsambodhiyā mūlaṃ. ‘‘Paññāpajjotavihatamohatama’’nti etena sammāsambodhiṃ dasseti. Anāvaraṇañāṇapadaṭṭhānañhi maggañāṇaṃ, maggañāṇapadaṭṭhānañca anāvaraṇañāṇaṃ sammāsambodhīti vuccatīti. Sammāgamanatthena sugata-saddena sammāsambodhiyā paṭipattiṃ dasseti līnuddhaccapatiṭṭhānāyūhanakāmasukhallikattakilamathānuyoga-sassatucchedābhinivesādi-antadvayarahitāya karuṇāpaññāpariggahitāya majjhimāya paṭipattiyā pakāsanato sugata-saddassa. Itarehi sammāsambodhiyā padhānāppadhānabhedaṃ payojanaṃ dasseti. Saṃsāramahoghato sattasantāraṇañhettha padhānaṃ payojanaṃ, tadaññamappadhānaṃ. Tesu padhānena parahitapaṭipattiṃ dasseti, itarena attahitasampattiṃ, tadubhayena attahitāya paṭipannādīsu catūsu puggalesu bhagavato ",
      " catutthapuggalabhāvaṃ dasseti. Tena ca anuttaradakkhiṇeyyabhāvaṃ, uttamavandanīyabhāvaṃ, attano ca vandanakiriyāya khettaṅgatabhāvaṃ dasseti."
    ],
    "innerText": "Tattha ‘‘karuṇāsītalahadaya’’nti etena sammāsambodhiyā mūlaṃ dasseti. Mahākaruṇāya sañcoditamānaso hi bhagavā saṃsārapaṅkato sattānaṃ samuddharaṇatthaṃ katābhinīhāro anupubbena pāramiyo pūretvā anuttaraṃ sammāsambodhiṃ adhigatoti karuṇā sammāsambodhiyā mūlaṃ. ‘‘Paññāpajjotavihatamohatama’’nti etena sammāsambodhiṃ dasseti. Anāvaraṇañāṇapadaṭṭhānañhi maggañāṇaṃ, maggañāṇapadaṭṭhānañca anāvaraṇañāṇaṃ sammāsambodhīti vuccatīti. Sammāgamanatthena sugata-saddena sammāsambodhiyā paṭipattiṃ dasseti līnuddhaccapatiṭṭhānāyūhanakāmasukhallikattakilamathānuyoga-sassatucchedābhinivesādi-antadvayarahitāya karuṇāpaññāpariggahitāya majjhimāya paṭipattiyā pakāsanato sugata-saddassa. Itarehi sammāsambodhiyā padhānāppadhānabhedaṃ payojanaṃ dasseti. Saṃsāramahoghato sattasantāraṇañhettha padhānaṃ payojanaṃ, tadaññamappadhānaṃ. Tesu padhānena parahitapaṭipattiṃ dasseti, itarena attahitasampattiṃ, tadubhayena attahitāya paṭipannādīsu catūsu puggalesu bhagavato catutthapuggalabhāvaṃ dasseti. Tena ca anuttaradakkhiṇeyyabhāvaṃ, uttamavandanīyabhāvaṃ, attano ca vandanakiriyāya khettaṅgatabhāvaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca karuṇāgahaṇena lokiyesu mahaggatabhāvappattāsādhāraṇaguṇadīpanato bhagavato sabbalokiyaguṇasampatti dassitā hoti, paññāgahaṇena sabbaññutaññāṇapadaṭṭhānamaggañāṇadīpanato sabbalokuttaraguṇasampatti. Tadubhayaggahaṇasiddho hi attho ‘‘sanarāmaralokagaru’’ntiādinā vipañcīyatīti. Karuṇāgahaṇena ca upagamanaṃ nirupakkilesaṃ dasseti, paññāgahaṇena apagamanaṃ. Tathā karuṇāgahaṇena lokasamaññānurūpaṃ bhagavato pavattiṃ dasseti lokavohāravisayattā karuṇāya, paññāgahaṇena samaññāya anatidhāvanaṃ. Sabhāvānavabodhena hi dhammānaṃ samaññaṃ atidhāvitvā sattādiparāmasanaṃ hotīti. Tathā karuṇāgahaṇena mahākaruṇāsamāpattivihāraṃ dasseti, paññāgahaṇena tīsu kālesu appaṭihatañāṇaṃ catusaccañāṇaṃ catupaṭisambhidāñāṇaṃ catuvesārajjañāṇaṃ, karuṇāgahaṇena mahākaruṇāsamāpattiñāṇassa gahitattā sesādhāraṇañāṇāni cha abhiññā aṭṭhasu parisāsu akampanañāṇāni dasa balāni cuddasa buddhañāṇāni soḷasa ñāṇacariyā aṭṭhārasa buddhadhammā catucattālīsa ñāṇavatthūni sattasattati ñāṇavatthūnīti evamādīnaṃ anekesaṃ paññāpabhedānaṃ vasena ñāṇacāraṃ dasseti. Tathā karuṇāgahaṇena caraṇasampattiṃ, paññāgahaṇena vijjāsampattiṃ. Karuṇāgahaṇena ",
      " attādhipatitā, paññāgahaṇena dhammādhipatitā. Karuṇāgahaṇena lokanāthabhāvo, paññāgahaṇena attanāthabhāvo. Tathā karuṇāgahaṇena pubbakāribhāvo, paññāgahaṇena kataññutā. Karuṇāgahaṇena aparantapatā, paññāgahaṇena anattantapatā. Karuṇāgahaṇena vā buddhakaradhammasiddhi, paññāgahaṇena buddhabhāvasiddhi. Tathā karuṇāgahaṇena paresaṃ tāraṇaṃ, paññāgahaṇena sayaṃ tāraṇaṃ. Tathā karuṇāgahaṇena sabbasattesu anuggahacittatā, paññāgahaṇena sabbadhammesu virattacittatā dassitā hoti."
    ],
    "innerText": "Ettha ca karuṇāgahaṇena lokiyesu mahaggatabhāvappattāsādhāraṇaguṇadīpanato bhagavato sabbalokiyaguṇasampatti dassitā hoti, paññāgahaṇena sabbaññutaññāṇapadaṭṭhānamaggañāṇadīpanato sabbalokuttaraguṇasampatti. Tadubhayaggahaṇasiddho hi attho ‘‘sanarāmaralokagaru’’ntiādinā vipañcīyatīti. Karuṇāgahaṇena ca upagamanaṃ nirupakkilesaṃ dasseti, paññāgahaṇena apagamanaṃ. Tathā karuṇāgahaṇena lokasamaññānurūpaṃ bhagavato pavattiṃ dasseti lokavohāravisayattā karuṇāya, paññāgahaṇena samaññāya anatidhāvanaṃ. Sabhāvānavabodhena hi dhammānaṃ samaññaṃ atidhāvitvā sattādiparāmasanaṃ hotīti. Tathā karuṇāgahaṇena mahākaruṇāsamāpattivihāraṃ dasseti, paññāgahaṇena tīsu kālesu appaṭihatañāṇaṃ catusaccañāṇaṃ catupaṭisambhidāñāṇaṃ catuvesārajjañāṇaṃ, karuṇāgahaṇena mahākaruṇāsamāpattiñāṇassa gahitattā sesādhāraṇañāṇāni cha abhiññā aṭṭhasu parisāsu akampanañāṇāni dasa balāni cuddasa buddhañāṇāni soḷasa ñāṇacariyā aṭṭhārasa buddhadhammā catucattālīsa ñāṇavatthūni sattasattati ñāṇavatthūnīti evamādīnaṃ anekesaṃ paññāpabhedānaṃ vasena ñāṇacāraṃ dasseti. Tathā karuṇāgahaṇena caraṇasampattiṃ, paññāgahaṇena vijjāsampattiṃ. Karuṇāgahaṇena attādhipatitā, paññāgahaṇena dhammādhipatitā. Karuṇāgahaṇena lokanāthabhāvo, paññāgahaṇena attanāthabhāvo. Tathā karuṇāgahaṇena pubbakāribhāvo, paññāgahaṇena kataññutā. Karuṇāgahaṇena aparantapatā, paññāgahaṇena anattantapatā. Karuṇāgahaṇena vā buddhakaradhammasiddhi, paññāgahaṇena buddhabhāvasiddhi. Tathā karuṇāgahaṇena paresaṃ tāraṇaṃ, paññāgahaṇena sayaṃ tāraṇaṃ. Tathā karuṇāgahaṇena sabbasattesu anuggahacittatā, paññāgahaṇena sabbadhammesu virattacittatā dassitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbesañca buddhaguṇānaṃ karuṇā ādi tannidānabhāvato, paññā pariyosānaṃ tato uttari karaṇīyābhāvato. Iti ādipariyosānadassanena sabbe buddhaguṇā dassitā honti. Tathā karuṇāgahaṇena sīlakkhandhapubbaṅgamo ",
      " samādhikkhandho dassito hoti. Karuṇānidānañhi sīlaṃ tato pāṇātipātādiviratippavattito, sā ca jhānattayasampayoginīti. Paññāvacanena paññākkhandho. Sīlañca sabbabuddhaguṇānaṃ ādi, samādhi majjhe, paññā pariyosānanti evampi ādimajjhapariyosānakalyāṇadassanena sabbe buddhaguṇā dassitā honti nayato dassitattā. Eso eva hi niravasesato buddhaguṇānaṃ dassanupāyo, yadidaṃ nayaggahaṇaṃ, aññathā ko nāma samattho bhagavato guṇe anupadaṃ niravasesato dassetuṃ. Tenevāha –"
    ],
    "innerText": "Sabbesañca buddhaguṇānaṃ karuṇā ādi tannidānabhāvato, paññā pariyosānaṃ tato uttari karaṇīyābhāvato. Iti ādipariyosānadassanena sabbe buddhaguṇā dassitā honti. Tathā karuṇāgahaṇena sīlakkhandhapubbaṅgamo samādhikkhandho dassito hoti. Karuṇānidānañhi sīlaṃ tato pāṇātipātādiviratippavattito, sā ca jhānattayasampayoginīti. Paññāvacanena paññākkhandho. Sīlañca sabbabuddhaguṇānaṃ ādi, samādhi majjhe, paññā pariyosānanti evampi ādimajjhapariyosānakalyāṇadassanena sabbe buddhaguṇā dassitā honti nayato dassitattā. Eso eva hi niravasesato buddhaguṇānaṃ dassanupāyo, yadidaṃ nayaggahaṇaṃ, aññathā ko nāma samattho bhagavato guṇe anupadaṃ niravasesato dassetuṃ. Tenevāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Buddhopi buddhassa bhaṇeyya vaṇṇaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Kappampi ce aññamabhāsamāno;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Khīyetha kappo ciradīghamantare,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vaṇṇo na khīyetha tathāgatassā’’ti. (dī. ni. aṭṭha. 1.304; 3.141; ma. ni. aṭṭha. 3.425; udā. 53; bu. vaṃ. aṭṭha. 4.5; cariyā. aṭṭha. nidānakathā, pakiṇṇakakathā; apa. 2.7.20) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Teneva ca āyasmatā sāriputtattherenapi buddaguṇaparicchedanaṃ pati anuyuttena ‘‘no hetaṃ, bhante’’ti paṭikkhipitvā ‘‘api ca me, bhante, dhammanvayo vidito’’ti (dī. ni. 2.146) vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Evaṃ saṅkhepena sakalasabbaññuguṇehi bhagavantaṃ abhitthavitvā idāni saddhammaṃ thometuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘buddhopī’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddho"
      },
      "ti kattuniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddhabhāva"
      },
      "nti kammaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvetvā sacchikatvā"
      },
      "ti ",
      " ca pubbakālakiriyāniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ya"
      },
      "nti aniyamato kammaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upagato"
      },
      "ti aparakālakiriyāniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vande"
      },
      "ti kiriyāniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ta"
      },
      "nti niyamanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhamma"
      },
      "nti vandanakiriyāya kammaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gatamalaṃ anuttaranti"
      },
      " ca tabbisesanaṃ."
    ],
    "innerText": "2. Evaṃ saṅkhepena sakalasabbaññuguṇehi bhagavantaṃ abhitthavitvā idāni saddhammaṃ thometuṃ ‘‘buddhopī’’tiādimāha. Tattha buddhoti kattuniddeso. Buddhabhāvanti kammaniddeso. Bhāvetvā sacchikatvāti ca pubbakālakiriyāniddeso. Yanti aniyamato kammaniddeso. Upagatoti aparakālakiriyāniddeso. Vandeti kiriyāniddeso. Tanti niyamanaṃ. Dhammanti vandanakiriyāya kammaniddeso. Gatamalaṃ anuttaranti ca tabbisesanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha buddhasaddassa tāva – ‘‘bujjhitā saccānīti buddho, bodhetā pajāyāti buddho’’tiādinā niddesanayena (mahāni. 192; cūḷani. pārāyanatthutigāthāniddesa 97) attho veditabbo. Atha vā savāsanāya aññāṇaniddāya accantavigamato, buddhiyā vā vikasitabhāvato buddhavāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddho"
      },
      " jāgaraṇavikasanatthavasena. Atha vā kassacipi ñeyyadhammassa anavabuddhassa abhāvena ñeyyavisesassa kammabhāvena ",
      " aggahaṇato kammavacanicchāya abhāvena avagamanatthavaseneva kattuniddeso labbhatīti buddhavāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddho"
      },
      " yathā ‘‘dikkhito na dadātī’’ti. Atthato pana pāramitāparibhāvito sayambhūñāṇena saha vāsanāya vihataviddhastaniravasesakileso mahākaruṇā sabbaññutaññāṇādiaparimeyyaguṇagaṇādhāro khandhasantāno buddho. Yathāha – ‘‘buddhoti yo so bhagavā sayambhū anācariyako pubbe ananussutesu dhammesu sāmaṃ saccāni abhisambujjhi. Tattha ca sabbaññutaṃ patto balesu ca vasībhāva’’nti (mahāni. 192). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Api"
      },
      "-saddo sambhāvane. Tena ‘‘evaṃ guṇavisesayutto sopi nāma bhagavā’’ti vakkhamānaguṇe dhamme sambhāvanaṃ dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddhabhāva"
      },
      "nti sammāsambodhiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvetvā"
      },
      "ti uppādetvā vaḍḍhetvā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacchikatvā"
      },
      "ti paccakkhaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upagato"
      },
      "ti patto, adhigatoti attho. Etassa ‘‘buddhabhāva’’nti etena sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gatamala"
      },
      "nti vigatamalaṃ, niddosanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vande"
      },
      "ti paṇamāmi, thomemi vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuttara"
      },
      "nti uttararahitaṃ, lokuttaranti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhamma"
      },
      "nti yathānusiṭṭhaṃ paṭipajjamāne apāyato saṃsārato ca apatamāne dhāretīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammo"
      },
      "."
    ],
    "innerText": "Tattha buddhasaddassa tāva – ‘‘bujjhitā saccānīti buddho, bodhetā pajāyāti buddho’’tiādinā niddesanayena (mahāni. 192; cūḷani. pārāyanatthutigāthāniddesa 97) attho veditabbo. Atha vā savāsanāya aññāṇaniddāya accantavigamato, buddhiyā vā vikasitabhāvato buddhavāti buddho jāgaraṇavikasanatthavasena. Atha vā kassacipi ñeyyadhammassa anavabuddhassa abhāvena ñeyyavisesassa kammabhāvena aggahaṇato kammavacanicchāya abhāvena avagamanatthavaseneva kattuniddeso labbhatīti buddhavāti buddho yathā ‘‘dikkhito na dadātī’’ti. Atthato pana pāramitāparibhāvito sayambhūñāṇena saha vāsanāya vihataviddhastaniravasesakileso mahākaruṇā sabbaññutaññāṇādiaparimeyyaguṇagaṇādhāro khandhasantāno buddho. Yathāha – ‘‘buddhoti yo so bhagavā sayambhū anācariyako pubbe ananussutesu dhammesu sāmaṃ saccāni abhisambujjhi. Tattha ca sabbaññutaṃ patto balesu ca vasībhāva’’nti (mahāni. 192). Api-saddo sambhāvane. Tena ‘‘evaṃ guṇavisesayutto sopi nāma bhagavā’’ti vakkhamānaguṇe dhamme sambhāvanaṃ dīpeti. Buddhabhāvanti sammāsambodhiṃ. Bhāvetvāti uppādetvā vaḍḍhetvā ca. Sacchikatvāti paccakkhaṃ katvā. Upagatoti patto, adhigatoti attho. Etassa ‘‘buddhabhāva’’nti etena sambandho. Gatamalanti vigatamalaṃ, niddosanti attho. Vandeti paṇamāmi, thomemi vā. Anuttaranti uttararahitaṃ, lokuttaranti attho. Dhammanti yathānusiṭṭhaṃ paṭipajjamāne apāyato saṃsārato ca apatamāne dhāretīti dhammo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayañhettha saṅkhepattho – evaṃ vividhaguṇagaṇasamannāgato buddhopi bhagavā yaṃ ariyamaggasaṅkhātaṃ dhammaṃ bhāvetvā phalanibbānasaṅkhātaṃ pana dhammaṃ sacchikatvā anuttaraṃ sammāsambodhiṃ adhigato, tametaṃ buddhānampi buddhabhāvahetubhūtaṃ sabbadosamalarahitaṃ attano uttaritarābhāvena anuttaraṃ paṭivedhasaddhammaṃ namāmīti. Pariyattisaddhammassapi tappakāsanattā idha saṅgaho daṭṭhabbo. Atha vā ‘‘abhidhammanayasamuddaṃ adhigacchi, tīṇi piṭakāni sammasī’’ti ca aṭṭhakathāyaṃ vuttattā pariyattidhammassapi sacchikiriyasammasanapariyāyo labbhatīti sopi idha vutto evāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā ‘‘yaṃ dhammaṃ bhāvetvā sacchikatvā’’ti ca vuttattā buddhakaradhammabhūtāhi pāramitāhi saha ",
      " pubbabhāge adhisīlasikkhādayopi idha dhamma-saddena saṅgahitāti veditabbaṃ. Tāpi hi malapaṭipakkhatāya gatamalā anaññasādhāraṇatāya anuttarā cāti. Tathā hi sattānaṃ sakalavaṭṭadukkhanissaraṇatthāya katamahābhinīhāro mahākaruṇādhivāsapesalajjhāsayo paññāvisesaparidhotanimmalānaṃ dānadamasaññamādīnaṃ uttamadhammānaṃ ",
      " satasahassādhikāni kappānaṃ cattāri asaṅkhyeyyāni sakkaccaṃ nirantaraṃ niravasesānaṃ bhāvanāpaccakkhakaraṇehi kammādīsu adhigatavasibhāvo acchariyācinteyyamahānubhāvo adhisīlādhicittānaṃ paramukkaṃsapāramippatto bhagavā paccayākāre catuvīsatikoṭisatasahassamukhena mahāvajirañāṇaṃ pesetvā anuttaraṃ sammāsambodhiṃ abhisambuddhoti."
    ],
    "innerText": "Tathā ‘‘yaṃ dhammaṃ bhāvetvā sacchikatvā’’ti ca vuttattā buddhakaradhammabhūtāhi pāramitāhi saha pubbabhāge adhisīlasikkhādayopi idha dhamma-saddena saṅgahitāti veditabbaṃ. Tāpi hi malapaṭipakkhatāya gatamalā anaññasādhāraṇatāya anuttarā cāti. Tathā hi sattānaṃ sakalavaṭṭadukkhanissaraṇatthāya katamahābhinīhāro mahākaruṇādhivāsapesalajjhāsayo paññāvisesaparidhotanimmalānaṃ dānadamasaññamādīnaṃ uttamadhammānaṃ satasahassādhikāni kappānaṃ cattāri asaṅkhyeyyāni sakkaccaṃ nirantaraṃ niravasesānaṃ bhāvanāpaccakkhakaraṇehi kammādīsu adhigatavasibhāvo acchariyācinteyyamahānubhāvo adhisīlādhicittānaṃ paramukkaṃsapāramippatto bhagavā paccayākāre catuvīsatikoṭisatasahassamukhena mahāvajirañāṇaṃ pesetvā anuttaraṃ sammāsambodhiṃ abhisambuddhoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha ca ‘‘bhāvetvā’’ti etena vijjāsampadāya dhammaṃ thometi, ‘‘sacchikatvā’’ti etena vimuttisampadāya. Tathā paṭhamena jhānasampadāya, dutiyena vimokkhasampadāya. Paṭhamena vā samādhisampadāya, dutiyena samāpattisampadāya. Atha vā paṭhamena khayeñāṇabhāvena, dutiyena anuppādeñāṇabhāvena. Purimena vā vijjūpamatāya, dutiyena vajirupamatāya. Purimena vā virāgasampattiyā, dutiyena nirodhasampattiyā. Tathā paṭhamena niyyānabhāvena, dutiyena nissaraṇabhāvena. Paṭhamena vā hetubhāvena, dutiyena asaṅkhatabhāvena. Paṭhamena vā dassanabhāvena, dutiyena vivekabhāvena. Paṭhamena vā adhipatibhāvena, dutiyena amatabhāvena dhammaṃ thometi. Atha vā ‘‘yaṃ dhammaṃ bhāvetvā buddhabhāvaṃ upagato’’ti etena svākkhātatāya dhammaṃ thometi, ‘‘sacchikatvā’’ti etena sandiṭṭhikatāya. Tathā purimena akālikatāya, pacchimena ehipassikatāya. Purimena vā opaneyyikatāya, pacchimena paccattaṃ veditabbatāya dhammaṃ thometi. ‘‘Gatamala’’nti iminā saṃkilesābhāvadīpanena dhammassa parisuddhataṃ dasseti. ‘‘Anuttara’’nti etena aññassa visiṭṭhassa abhāvadīpanena vipulaparipuṇṇataṃ. Paṭhamena vā pahānasampadaṃ dhammassa dasseti, dutiyena sabhāvasampadaṃ. Bhāvetabbatāya vā dhammassa gatamalabhāvo yojetabbo. Bhāvanābalena hi so dosānaṃ samugghātako hotīti. Sacchikātabbabhāvena anuttarabhāvo yojetabbo. Sacchikiriyānibbattito hi tatuttarikaraṇīyābhāvato anaññasādhāraṇatāya anuttaroti. Tathā ‘‘bhāvetvā’’ti etena saha pubbabhāgasīlādīhi sekkhā sīlasamādhipaññākkhandhā dassitā honti. ‘‘Sacchikatvā’’ti etena saha asaṅkhatāya dhātuyā asekkhā sīlasamādhipaññākkhandhā dassitā hontīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Evaṃ saṅkhepeneva sabbadhammaguṇehi saddhammaṃ abhitthavitvā idāni ariyasaṅghaṃ thometuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sugatassā’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugatassā"
      },
      "ti sambandhaniddeso ",
      ". Tassa ‘‘puttāna’’nti etena sambandho ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Orasāna"
      },
      "nti puttavisesanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mārasenamathanāna"
      },
      "nti orasaputtabhāve kāraṇaniddeso. Tena kilesapahānameva bhagavato orasaputtabhāve kāraṇaṃ anujānātīti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhanna"
      },
      "nti gaṇanaparicchedaniddeso. Tena ca satipi tesaṃ sattavisesabhāvena anekasahassasaṅkhābhāve imaṃ gaṇanaparicchedaṃ nātivattantīti dasseti maggaṭṭhaphalaṭṭhabhāvānativattanato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samūha"
      },
      "nti samudāyaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ariyasaṅgha"
      },
      "nti guṇavisiṭṭhasaṅghātabhāvaniddeso. Tena asatipi ariyapuggalānaṃ kāyasāmaggiyaṃ ariyasaṅghabhāvaṃ dasseti diṭṭhisīlasāmaññena saṃhatabhāvato."
    ],
    "innerText": "3. Evaṃ saṅkhepeneva sabbadhammaguṇehi saddhammaṃ abhitthavitvā idāni ariyasaṅghaṃ thometuṃ ‘‘sugatassā’’tiādimāha. Tattha sugatassāti sambandhaniddeso . Tassa ‘‘puttāna’’nti etena sambandho . Orasānanti puttavisesanaṃ. Mārasenamathanānanti orasaputtabhāve kāraṇaniddeso. Tena kilesapahānameva bhagavato orasaputtabhāve kāraṇaṃ anujānātīti dasseti. Aṭṭhannanti gaṇanaparicchedaniddeso. Tena ca satipi tesaṃ sattavisesabhāvena anekasahassasaṅkhābhāve imaṃ gaṇanaparicchedaṃ nātivattantīti dasseti maggaṭṭhaphalaṭṭhabhāvānativattanato. Samūhanti samudāyaniddeso. Ariyasaṅghanti guṇavisiṭṭhasaṅghātabhāvaniddeso. Tena asatipi ariyapuggalānaṃ kāyasāmaggiyaṃ ariyasaṅghabhāvaṃ dasseti diṭṭhisīlasāmaññena saṃhatabhāvato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha urasi bhavā jātā saṃbaddhā ca orasā. Yathā hi sattānaṃ orasaputtā attajātatāya pitu santakassa dāyajjassa visesena bhāgino honti, evametepi ariyapuggalā sammāsambuddhassa dhammassavanante ariyāya jātiyā jātatāya bhagavato santakassa vimuttisukhassa ariyadhammaratanassa ca ekantabhāginoti orasā viya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "orasā"
      },
      ". Atha vā bhagavato dhammadesanānubhāveneva ariyabhūmiṃ okkamamānā okkantā ca ariyasāvakā bhagavato urena vāyāmajanitābhijātitāya nippariyāyena orasā puttāti vattabbataṃ arahanti. Sāvakehi pavattiyamānāpi hi dhammadesanā ‘‘bhagavato dhammadesanā’’icceva vuccati tammūlikattā lakkhaṇādivisesābhāvato ca."
    ],
    "innerText": "Tattha urasi bhavā jātā saṃbaddhā ca orasā. Yathā hi sattānaṃ orasaputtā attajātatāya pitu santakassa dāyajjassa visesena bhāgino honti, evametepi ariyapuggalā sammāsambuddhassa dhammassavanante ariyāya jātiyā jātatāya bhagavato santakassa vimuttisukhassa ariyadhammaratanassa ca ekantabhāginoti orasā viya orasā. Atha vā bhagavato dhammadesanānubhāveneva ariyabhūmiṃ okkamamānā okkantā ca ariyasāvakā bhagavato urena vāyāmajanitābhijātitāya nippariyāyena orasā puttāti vattabbataṃ arahanti. Sāvakehi pavattiyamānāpi hi dhammadesanā ‘‘bhagavato dhammadesanā’’icceva vuccati tammūlikattā lakkhaṇādivisesābhāvato ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadipi ariyasāvakānaṃ ariyamaggādhigamasamaye bhagavato viya tadantarāyakaraṇatthaṃ devaputtamāro, māravāhinī vā na ekantena apasādeti, tehi pana apasādetabbatāya kāraṇe vimathite tepi vimathitā eva nāma hontīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘mārasenamathanāna’’"
      },
      "nti. Imasmiṃ panatthe ‘‘māramārasenamathanāna’’nti vattabbe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mārasenamathanāna"
      },
      "nti ekadesasarūpekaseso katoti daṭṭhabbaṃ. Atha vā khandhābhisaṅkhāramārānaṃ viya devaputtamārassapi guṇamāraṇe sahāyabhāvūpagamanato kilesabalakāyo ‘‘senā’’ti vuccati. Yathāha ‘‘kāmā te paṭhamā senā’’tiādi (su. ni. 438). Sā ca tehi diyaḍḍhasahassabhedā, anantabhedā vā kilesavāhinī satidhammavicayavīriyasamathādiguṇapaharaṇehi odhiso vimathitā ",
      " vihatā viddhastā cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mārasenamathanā,"
      },
      " ariyasāvakā. Etena tesaṃ bhagavato anujātaputtataṃ dasseti."
    ],
    "innerText": "Yadipi ariyasāvakānaṃ ariyamaggādhigamasamaye bhagavato viya tadantarāyakaraṇatthaṃ devaputtamāro, māravāhinī vā na ekantena apasādeti, tehi pana apasādetabbatāya kāraṇe vimathite tepi vimathitā eva nāma hontīti āha ‘‘mārasenamathanāna’’nti. Imasmiṃ panatthe ‘‘māramārasenamathanāna’’nti vattabbe mārasenamathanānanti ekadesasarūpekaseso katoti daṭṭhabbaṃ. Atha vā khandhābhisaṅkhāramārānaṃ viya devaputtamārassapi guṇamāraṇe sahāyabhāvūpagamanato kilesabalakāyo ‘‘senā’’ti vuccati. Yathāha ‘‘kāmā te paṭhamā senā’’tiādi (su. ni. 438). Sā ca tehi diyaḍḍhasahassabhedā, anantabhedā vā kilesavāhinī satidhammavicayavīriyasamathādiguṇapaharaṇehi odhiso vimathitā vihatā viddhastā cāti mārasenamathanā, ariyasāvakā. Etena tesaṃ bhagavato anujātaputtataṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ārakattā kilesehi, anaye na iriyanato, aye ca iriyanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyā"
      },
      " niruttinayena. Atha vā sadevakena lokena saraṇanti araṇīyato upagantabbato, upagatānañca tadatthasiddhito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyā"
      },
      ". Ariyānaṃ saṅghoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyasaṅgho"
      },
      ". Ariyo ca so saṅgho cāti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyasaṅgho"
      },
      ". Bhagavato ",
      " aparabhāge buddhadhammaratanānampi samadhigamo saṅgharatanādhīnoti assa ariyasaṅghassa bahūpakārataṃ dassetuṃ idheva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sirasā vande’’"
      },
      "ti vuttanti daṭṭhabbaṃ."
    ],
    "innerText": "Ārakattā kilesehi, anaye na iriyanato, aye ca iriyanato ariyā niruttinayena. Atha vā sadevakena lokena saraṇanti araṇīyato upagantabbato, upagatānañca tadatthasiddhito ariyā. Ariyānaṃ saṅghoti ariyasaṅgho. Ariyo ca so saṅgho cāti vā ariyasaṅgho. Bhagavato aparabhāge buddhadhammaratanānampi samadhigamo saṅgharatanādhīnoti assa ariyasaṅghassa bahūpakārataṃ dassetuṃ idheva ‘‘sirasā vande’’ti vuttanti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca ‘‘sugatassa orasānaṃ puttāna’’nti etena ariyasaṅghassa pabhavasampadaṃ dasseti, ‘‘mārasenamathanāna’’nti etena pahānasampadaṃ sakalasaṃkilesapahānadīpanato, ‘‘aṭṭhannampi samūha’’nti etena ñāṇasampadaṃ maggaṭṭhaphalaṭṭhabhāvadīpanato. ‘‘Ariyasaṅgha’’nti etena pabhavasampadaṃ dasseti sabbasaṅghānaṃ aggabhāvadīpanato. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugatassa orasānaṃ puttāna"
      },
      "nti ariyasaṅghassa visuddhanissayabhāvadīpanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mārasenamathanāna"
      },
      "nti sammāujuñāyasāmīcippaṭipannabhāvadīpanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhannampi samūha"
      },
      "nti āhuneyyādibhāvadīpanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ariyasaṅgha"
      },
      "nti anuttarapuññakhettabhāvadīpanaṃ. Tathā ‘‘sugatassa orasānaṃ puttāna’’nti etena ariyasaṅghassa lokuttarasaraṇagamanasabhāvaṃ dīpeti. Lokuttarasaraṇagamanena hi te bhagavato orasaputtā jātā. ‘‘Mārasenamathanāna’’nti etena abhinīhārasampadāya siddhaṃ pubbabhāge sammāpaṭipattiṃ dasseti. Katābhinīhārā hi sammāpaṭipannā māraṃ māraparisaṃ vā abhivijinanti. ‘‘Aṭṭhannampi samūha’’nti etena paṭividdhastavipakkhe sekkhāsekkhadhamme dasseti puggalādhiṭṭhānena maggaphaladhammānaṃ pakāsitattā. ‘‘Ariyasaṅgha’’nti aggadakkhiṇeyyabhāvaṃ dasseti. Saraṇagamanañca sāvakānaṃ sabbaguṇānaṃ ādi, sapubbabhāgapaṭipadā sekkhā sīlakkhandhādayo majjhe, asekkhā sīlakkhandhādayo pariyosānanti ādimajjhapariyosānakalyāṇā saṅkhepato sabbe ariyasaṅghaguṇā pakāsitā honti."
    ],
    "innerText": "Ettha ca ‘‘sugatassa orasānaṃ puttāna’’nti etena ariyasaṅghassa pabhavasampadaṃ dasseti, ‘‘mārasenamathanāna’’nti etena pahānasampadaṃ sakalasaṃkilesapahānadīpanato, ‘‘aṭṭhannampi samūha’’nti etena ñāṇasampadaṃ maggaṭṭhaphalaṭṭhabhāvadīpanato. ‘‘Ariyasaṅgha’’nti etena pabhavasampadaṃ dasseti sabbasaṅghānaṃ aggabhāvadīpanato. Atha vā sugatassa orasānaṃ puttānanti ariyasaṅghassa visuddhanissayabhāvadīpanaṃ. Mārasenamathanānanti sammāujuñāyasāmīcippaṭipannabhāvadīpanaṃ. Aṭṭhannampi samūhanti āhuneyyādibhāvadīpanaṃ. Ariyasaṅghanti anuttarapuññakhettabhāvadīpanaṃ. Tathā ‘‘sugatassa orasānaṃ puttāna’’nti etena ariyasaṅghassa lokuttarasaraṇagamanasabhāvaṃ dīpeti. Lokuttarasaraṇagamanena hi te bhagavato orasaputtā jātā. ‘‘Mārasenamathanāna’’nti etena abhinīhārasampadāya siddhaṃ pubbabhāge sammāpaṭipattiṃ dasseti. Katābhinīhārā hi sammāpaṭipannā māraṃ māraparisaṃ vā abhivijinanti. ‘‘Aṭṭhannampi samūha’’nti etena paṭividdhastavipakkhe sekkhāsekkhadhamme dasseti puggalādhiṭṭhānena maggaphaladhammānaṃ pakāsitattā. ‘‘Ariyasaṅgha’’nti aggadakkhiṇeyyabhāvaṃ dasseti. Saraṇagamanañca sāvakānaṃ sabbaguṇānaṃ ādi, sapubbabhāgapaṭipadā sekkhā sīlakkhandhādayo majjhe, asekkhā sīlakkhandhādayo pariyosānanti ādimajjhapariyosānakalyāṇā saṅkhepato sabbe ariyasaṅghaguṇā pakāsitā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Evaṃ gāthāttayena saṅkhepato sakalaguṇasaṃkittanamukhena ratanattayassa paṇāmaṃ katvā idāni taṃ nipaccakāraṃ yathādhippete payojane pariṇāmento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘iti me’’"
      },
      "tiādimāha. Tattha ratijananaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ratanaṃ,"
      },
      " buddhadhammasaṅghā. Tesañhi ‘‘itipi so bhagavā’’tiādinā yathābhūtaguṇe āvajjentassa amatādhigamahetubhūtaṃ anappakaṃ pītipāmojjaṃ uppajjati. Yathāha –"
    ],
    "innerText": "4. Evaṃ gāthāttayena saṅkhepato sakalaguṇasaṃkittanamukhena ratanattayassa paṇāmaṃ katvā idāni taṃ nipaccakāraṃ yathādhippete payojane pariṇāmento ‘‘iti me’’tiādimāha. Tattha ratijananaṭṭhena ratanaṃ, buddhadhammasaṅghā. Tesañhi ‘‘itipi so bhagavā’’tiādinā yathābhūtaguṇe āvajjentassa amatādhigamahetubhūtaṃ anappakaṃ pītipāmojjaṃ uppajjati. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Yasmiṃ, mahānāma, samaye ariyasāvako tathāgataṃ anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti, ujugatamevassa tasmiṃ samaye cittaṃ hoti tathāgataṃ ārabbha. Ujugatacitto kho pana, mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ, pamuditassa pīti jāyatī’’tiādi (a. ni. 6.10; 11.11)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cittīkatādibhāvo ",
      " vā ratanaṭṭho. Vuttañhetaṃ –"
    ],
    "innerText": "Cittīkatādibhāvo vā ratanaṭṭho. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Cittīkataṃ mahagghañca, atulaṃ dullabhadassanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anomasattaparibhogaṃ, ratanaṃ tena vuccatī’’ti. (dī. ni. aṭṭha. 2.33; khu. pā. aṭṭha. 6.3; su. ni. aṭṭha. 226; mahāni. aṭṭha. 50) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Cittīkatabhāvādayo ca anaññasādhāraṇā buddhādīsu eva labbhantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vandanāva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vandanāmayaṃ"
      },
      " yathā ‘‘dānamayaṃ sīlamaya’’nti. Vandanā cettha kāyavācācittehi tiṇṇaṃ ratanānaṃ guṇaninnatā, thomanā vā. Pujjabhavaphalanibbattanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puññaṃ,"
      },
      " attano santānaṃ punātīti vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvihatantarāyo"
      },
      "ti. Suṭṭhu vihatantarāyo. Etena attano pasādasampattiyā, ratanattayassa ca khettabhāvasampattiyā taṃ puññaṃ atthappakāsanassa upaghātakaupaddavānaṃ vihanane samatthanti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hutvā"
      },
      "ti pubbakālakiriyā. Tassa ‘‘atthaṃ pakāsayissāmī’’ti etena sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā"
      },
      "ti yaṃ ratanattayavandanāmayaṃ puññaṃ, tassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ānubhāvenā"
      },
      "ti balena."
    ],
    "innerText": "Vandanāva vandanāmayaṃ yathā ‘‘dānamayaṃ sīlamaya’’nti. Vandanā cettha kāyavācācittehi tiṇṇaṃ ratanānaṃ guṇaninnatā, thomanā vā. Pujjabhavaphalanibbattanato puññaṃ, attano santānaṃ punātīti vā. Suvihatantarāyoti. Suṭṭhu vihatantarāyo. Etena attano pasādasampattiyā, ratanattayassa ca khettabhāvasampattiyā taṃ puññaṃ atthappakāsanassa upaghātakaupaddavānaṃ vihanane samatthanti dasseti. Hutvāti pubbakālakiriyā. Tassa ‘‘atthaṃ pakāsayissāmī’’ti etena sambandho. Tassāti yaṃ ratanattayavandanāmayaṃ puññaṃ, tassa. Ānubhāvenāti balena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". Evaṃ ratanattayassa nipaccakāre payojanaṃ dassetvā idāni yassā dhammadesanāya atthaṃ saṃvaṇṇetukāmo, tassā tāva guṇābhitthavanavasena upaññāpanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘saṃyuttavaggapaṭimaṇḍitassā’’"
      },
      "tiādi vuttaṃ, devatāsaṃyuttādisaṃyuttehi ceva naḷavaggādivaggehi ca vibhūsitassāti attho. Tattha ",
      " ‘‘saṃyutta’’nti ‘‘saṃyogo’’ti ca atthato ekaṃ. Kesaṃ saṃyuttaṃ? Suttavaggānaṃ. Yathā hi byañjanasamudāyo padaṃ, evaṃ atthesu ca katāvadhiko padasamudāyo vākyaṃ, vākyasamudāyo suttaṃ, suttasamudāye vaggoti samaññā, tathā suttavaggasamudāye saṃyuttasamaññā. Saṃyujjantīti ettha suttavaggāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃyuttaṃ"
      },
      ". Yadipi avayavavinimutto samudāyo nāma paramatthato natthi, avayave eva taṃtaṃsannivesavisiṭṭhe upādāya padādisamaññā viya suttavaggasamaññā saṃyuttasamaññā āgamasamaññā ca, tathāpi paramatthato avijjamānopi samudāyo buddhiparikappitarūpena vijjamāno viya gayhamāno avayavānaṃ adhiṭṭhānabhāvena voharīyati yathā ‘‘rukkhe sākhā’’ti, tasmā vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘saṃyuttavaggapaṭimaṇḍitassā’’"
      },
      "ti."
    ],
    "innerText": "5. Evaṃ ratanattayassa nipaccakāre payojanaṃ dassetvā idāni yassā dhammadesanāya atthaṃ saṃvaṇṇetukāmo, tassā tāva guṇābhitthavanavasena upaññāpanatthaṃ ‘‘saṃyuttavaggapaṭimaṇḍitassā’’tiādi vuttaṃ, devatāsaṃyuttādisaṃyuttehi ceva naḷavaggādivaggehi ca vibhūsitassāti attho. Tattha ‘‘saṃyutta’’nti ‘‘saṃyogo’’ti ca atthato ekaṃ. Kesaṃ saṃyuttaṃ? Suttavaggānaṃ. Yathā hi byañjanasamudāyo padaṃ, evaṃ atthesu ca katāvadhiko padasamudāyo vākyaṃ, vākyasamudāyo suttaṃ, suttasamudāye vaggoti samaññā, tathā suttavaggasamudāye saṃyuttasamaññā. Saṃyujjantīti ettha suttavaggāti saṃyuttaṃ. Yadipi avayavavinimutto samudāyo nāma paramatthato natthi, avayave eva taṃtaṃsannivesavisiṭṭhe upādāya padādisamaññā viya suttavaggasamaññā saṃyuttasamaññā āgamasamaññā ca, tathāpi paramatthato avijjamānopi samudāyo buddhiparikappitarūpena vijjamāno viya gayhamāno avayavānaṃ adhiṭṭhānabhāvena voharīyati yathā ‘‘rukkhe sākhā’’ti, tasmā vuttaṃ ‘‘saṃyuttavaggapaṭimaṇḍitassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nanu saṃyuttavaggo eva āgamo, tassa pana kehi maṇḍananti? Na codetabbametaṃ. Bhavati hi abhinnepi vatthusmiṃ yathādhippetavisesāvabodhanato bhedakasamudācāro yathā ‘‘silāputtakassa ",
      " sarīra’’nti. Āgamissanti ettha, etena, etasmā vā attatthaparatthādayoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āgamo,"
      },
      " ādikalyāṇādiguṇasampattiyā uttamaṭṭhena taṃtaṃabhipatthitasamiddhihetutāya paṇḍitehi varitabbato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "varo,"
      },
      " āgamo ca so varo cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āgamavaro"
      },
      ". Āgamasammatehi vā varoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āgamavaro,"
      },
      " saṃyutto ca so āgamavaro cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃyuttāgamavaro,"
      },
      " tassa. Buddhānaṃ anubuddhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddhānubuddhā,"
      },
      " buddhānaṃ saccapaṭivedhaṃ anugamma paṭividdhasaccā aggasāvakādayo ariyā. Tehi atthasaṃvaṇṇanāguṇasaṃvaṇṇanānaṃ vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃvaṇṇitassa"
      },
      "."
    ],
    "innerText": "Nanu saṃyuttavaggo eva āgamo, tassa pana kehi maṇḍananti? Na codetabbametaṃ. Bhavati hi abhinnepi vatthusmiṃ yathādhippetavisesāvabodhanato bhedakasamudācāro yathā ‘‘silāputtakassa sarīra’’nti. Āgamissanti ettha, etena, etasmā vā attatthaparatthādayoti āgamo, ādikalyāṇādiguṇasampattiyā uttamaṭṭhena taṃtaṃabhipatthitasamiddhihetutāya paṇḍitehi varitabbato varo, āgamo ca so varo cāti āgamavaro. Āgamasammatehi vā varoti āgamavaro, saṃyutto ca so āgamavaro cāti saṃyuttāgamavaro, tassa. Buddhānaṃ anubuddhā buddhānubuddhā, buddhānaṃ saccapaṭivedhaṃ anugamma paṭividdhasaccā aggasāvakādayo ariyā. Tehi atthasaṃvaṇṇanāguṇasaṃvaṇṇanānaṃ vasena saṃvaṇṇitassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā buddhā ca anubuddhā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddhānubuddhā"
      },
      "ti yojetabbaṃ. Sammāsambuddheneva hi vinayasuttaabhidhammānaṃ pakiṇṇakadesanādivasena yo paṭhamaṃ attho vibhatto, so eva pacchā tesaṃ atthavaṇṇanāvasena saṅgītikārehi saṅgahaṃ āropitoti. Ettha ca saṃyuttānaṃ vaggā samūhāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃyuttavaggā,"
      },
      " sagāthāvaggādayo. Tappariyāpannatāya saṃyuttesu vaggā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃyuttavaggā,"
      },
      " naḷavaggādayo. Saṃyuttāva vaggā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃyuttavaggā"
      },
      ". Tividhepi te ekasesanayena gahetvā vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘saṃyuttavaggapaṭimaṇḍitassā’’"
      },
      "ti."
    ],
    "innerText": "Atha vā buddhā ca anubuddhā ca buddhānubuddhāti yojetabbaṃ. Sammāsambuddheneva hi vinayasuttaabhidhammānaṃ pakiṇṇakadesanādivasena yo paṭhamaṃ attho vibhatto, so eva pacchā tesaṃ atthavaṇṇanāvasena saṅgītikārehi saṅgahaṃ āropitoti. Ettha ca saṃyuttānaṃ vaggā samūhāti saṃyuttavaggā, sagāthāvaggādayo. Tappariyāpannatāya saṃyuttesu vaggā saṃyuttavaggā, naḷavaggādayo. Saṃyuttāva vaggā saṃyuttavaggā. Tividhepi te ekasesanayena gahetvā vuttaṃ ‘‘saṃyuttavaggapaṭimaṇḍitassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha sagāthāvagge tāva ekādasa saṃyuttāni aṭṭhatiṃsa vaggā. Nidānavagge nava saṃyuttāni ekūnacattālīsa vaggā. Khandhavagge ekādasa saṃyuttāni ",
      " ekūnasaṭṭhi vaggā. Saḷāyatanavagge nava saṃyuttāni aṭṭhatiṃsa vaggā. Mahāvagge dvādasa saṃyuttāni aṭṭhacattālīsa vaggā. Idamettha saṃyuttantaravaggānaṃ parimāṇaṃ."
    ],
    "innerText": "Tattha sagāthāvagge tāva ekādasa saṃyuttāni aṭṭhatiṃsa vaggā. Nidānavagge nava saṃyuttāni ekūnacattālīsa vaggā. Khandhavagge ekādasa saṃyuttāni ekūnasaṭṭhi vaggā. Saḷāyatanavagge nava saṃyuttāni aṭṭhatiṃsa vaggā. Mahāvagge dvādasa saṃyuttāni aṭṭhacattālīsa vaggā. Idamettha saṃyuttantaravaggānaṃ parimāṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāṇappabhedajananassā"
      },
      "ti paṭiccasamuppādakhandhāyatanādikathābahulatāya gambhīrañāṇacariyāvibhāvanato paññāvibhāgasamuppādakassa. Idha pana ‘‘paññāppabhedajananassā’’ti svāyamāgamo thomito, saṃvaṇṇanāsu cāyaṃ ācariyassa pakati, yadidaṃ taṃtaṃsaṃvaṇṇanānaṃ ādito tassa tassa saṃvaṇṇetabbassa dhammassa visesaguṇakittanena thomanā. Tathā hi sumaṅgalavilāsinīpapañcasūdanīmanorathapūraṇīaṭṭhasālinīādīsu ca yathākkamaṃ ‘‘saddhāvahaguṇassa, paravādamathanassa, dhammakathikapuṅgavānaṃ vicittapaṭibhānajananassa, tassa gambhīrañāṇehi ogāḷhassa abhiṇhaso nānānayavicittassa abhidhammassā’’tiādinā thomanā katā."
    ],
    "innerText": "Ñāṇappabhedajananassāti paṭiccasamuppādakhandhāyatanādikathābahulatāya gambhīrañāṇacariyāvibhāvanato paññāvibhāgasamuppādakassa. Idha pana ‘‘paññāppabhedajananassā’’ti svāyamāgamo thomito, saṃvaṇṇanāsu cāyaṃ ācariyassa pakati, yadidaṃ taṃtaṃsaṃvaṇṇanānaṃ ādito tassa tassa saṃvaṇṇetabbassa dhammassa visesaguṇakittanena thomanā. Tathā hi sumaṅgalavilāsinīpapañcasūdanīmanorathapūraṇīaṭṭhasālinīādīsu ca yathākkamaṃ ‘‘saddhāvahaguṇassa, paravādamathanassa, dhammakathikapuṅgavānaṃ vicittapaṭibhānajananassa, tassa gambhīrañāṇehi ogāḷhassa abhiṇhaso nānānayavicittassa abhidhammassā’’tiādinā thomanā katā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". Attho kathīyati etāyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthakathā,"
      },
      " atthakathāva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathā"
      },
      " ttha-kārassa ṭṭha-kāraṃ katvā yathā ‘‘dukkhassa pīḷanaṭṭho’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādito"
      },
      "ti ādimhi paṭhamasaṅgītiyaṃ. Chaḷabhiññatāya paramena cittavasibhāvena samannāgatattā jhānādīsu pañcavidhavasitāsambhāvato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vasino,"
      },
      " therā mahākassapādayo ",
      ". Tesaṃ satehi pañcahi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yā"
      },
      "ti yā aṭṭhakathā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅgītā"
      },
      "ti atthaṃ kathetuṃ yuttaṭṭhāne ‘‘ayaṃ etassa attho, ayaṃ etassa attho’’ti saṅgahetvā vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anusaṅgītā ca"
      },
      " yasattherādīhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pacchāpi"
      },
      " dutiyatatiyasaṅgītīsu. Iminā attano saṃvaṇṇanāya āgamanavisuddhiṃ dasseti."
    ],
    "innerText": "6. Attho kathīyati etāyāti atthakathā, atthakathāva aṭṭhakathā ttha-kārassa ṭṭha-kāraṃ katvā yathā ‘‘dukkhassa pīḷanaṭṭho’’ti. Āditoti ādimhi paṭhamasaṅgītiyaṃ. Chaḷabhiññatāya paramena cittavasibhāvena samannāgatattā jhānādīsu pañcavidhavasitāsambhāvato ca vasino, therā mahākassapādayo . Tesaṃ satehi pañcahi. Yāti yā aṭṭhakathā. Saṅgītāti atthaṃ kathetuṃ yuttaṭṭhāne ‘‘ayaṃ etassa attho, ayaṃ etassa attho’’ti saṅgahetvā vuttā. Anusaṅgītā ca yasattherādīhi pacchāpi dutiyatatiyasaṅgītīsu. Iminā attano saṃvaṇṇanāya āgamanavisuddhiṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". Sīhassa lānato gahaṇato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīhaḷo,"
      },
      " sīhakumāro, tabbaṃsajātatāya tambapaṇṇidīpe khattiyā, tesaṃ nivāsatāya tambapaṇṇidīpassa ca sīhaḷabhāvo veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ābhatā"
      },
      "ti jambudīpato ānītā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Athā"
      },
      "ti pacchā. Aparabhāge hi nikāyantaraladdhīhi asaṅkaratthaṃ sīhaḷabhāsāya aṭṭhakathā ṭhapitāti. Tena mūlaṭṭhakathā sabbasādhāraṇā na hotīti idaṃ atthappakāsanaṃ ekantena karaṇīyanti dasseti. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dīpavāsīnamatthāyā’’"
      },
      "ti. Ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dīpavāsīna"
      },
      "nti jambudīpavāsīnaṃ, sīhaḷadīpavāsīnaṃ vā atthāya sīhaḷabhāsāya ṭhapitāti yojanā."
    ],
    "innerText": "7. Sīhassa lānato gahaṇato sīhaḷo, sīhakumāro, tabbaṃsajātatāya tambapaṇṇidīpe khattiyā, tesaṃ nivāsatāya tambapaṇṇidīpassa ca sīhaḷabhāvo veditabbo. Ābhatāti jambudīpato ānītā. Athāti pacchā. Aparabhāge hi nikāyantaraladdhīhi asaṅkaratthaṃ sīhaḷabhāsāya aṭṭhakathā ṭhapitāti. Tena mūlaṭṭhakathā sabbasādhāraṇā na hotīti idaṃ atthappakāsanaṃ ekantena karaṇīyanti dasseti. Tenevāha ‘‘dīpavāsīnamatthāyā’’ti. Ettha dīpavāsīnanti jambudīpavāsīnaṃ, sīhaḷadīpavāsīnaṃ vā atthāya sīhaḷabhāsāya ṭhapitāti yojanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apanetvā"
      },
      "ti ",
      " kañcukasadisaṃ sīhaḷabhāsaṃ apanetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato"
      },
      "ti aṭṭhakathāto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aha"
      },
      "nti attānaṃ niddisati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manoramaṃ bhāsa"
      },
      "nti māgadhabhāsaṃ. Sā hi sabhāvaniruttibhūtā paṇḍitamanaṃ ramayati. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tantinayānucchavika’’"
      },
      "nti, pāḷigatiyā anulomikaṃ pāḷichāyānuvidhāyininti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vigatadosa"
      },
      "nti asabhāvaniruttibhāsantararahitaṃ."
    ],
    "innerText": "8.Apanetvāti kañcukasadisaṃ sīhaḷabhāsaṃ apanetvā. Tatoti aṭṭhakathāto. Ahanti attānaṃ niddisati. Manoramaṃ bhāsanti māgadhabhāsaṃ. Sā hi sabhāvaniruttibhūtā paṇḍitamanaṃ ramayati. Tenevāha ‘‘tantinayānucchavika’’nti, pāḷigatiyā anulomikaṃ pāḷichāyānuvidhāyininti attho. Vigatadosanti asabhāvaniruttibhāsantararahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samayaṃ avilomento"
      },
      "ti siddhantaṃ avirodhento. Etena atthadosābhāvamāha. Aviruddhattā eva hi theravādāpi idha pakāsīyissanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Theravaṃsadīpāna"
      },
      "nti thirehi sīlakkhandhādīhi samannāgatattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "therā,"
      },
      " mahākassapādayo. Tehi āgatā ācariyaparamparā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "theravaṃso,"
      },
      " tappariyāpannā hutvā āgamādhigamasampannattā paññāpajjotena tassa samujjalanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "theravaṃsadīpā,"
      },
      " mahāvihāravāsino, tesaṃ. Vividhehi ākārehi nicchīyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinicchayo,"
      },
      " gaṇṭhiṭṭhānesu khilamaddanākārena pavattā vimaticchedanī kathā. Suṭṭhunipuṇo saṇho vinicchayo etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sunipuṇavinicchayā"
      },
      ". Atha vā vinicchinotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinicchayo"
      },
      " vuttappakāravisayaṃ ñāṇaṃ. Suṭṭhu nipuṇo cheko vinicchayo etesanti yojetabbaṃ. Etena mahākassapāditheraparamparāgato, tato eva ca aviparīto saṇho sukhumo mahāvihāravāsīnaṃ vinicchayo, tassa pamāṇabhūtataṃ dasseti."
    ],
    "innerText": "9.Samayaṃ avilomentoti siddhantaṃ avirodhento. Etena atthadosābhāvamāha. Aviruddhattā eva hi theravādāpi idha pakāsīyissanti. Theravaṃsadīpānanti thirehi sīlakkhandhādīhi samannāgatattā therā, mahākassapādayo. Tehi āgatā ācariyaparamparā theravaṃso, tappariyāpannā hutvā āgamādhigamasampannattā paññāpajjotena tassa samujjalanato theravaṃsadīpā, mahāvihāravāsino, tesaṃ. Vividhehi ākārehi nicchīyatīti vinicchayo, gaṇṭhiṭṭhānesu khilamaddanākārena pavattā vimaticchedanī kathā. Suṭṭhunipuṇo saṇho vinicchayo etesanti sunipuṇavinicchayā. Atha vā vinicchinotīti vinicchayo vuttappakāravisayaṃ ñāṇaṃ. Suṭṭhu nipuṇo cheko vinicchayo etesanti yojetabbaṃ. Etena mahākassapāditheraparamparāgato, tato eva ca aviparīto saṇho sukhumo mahāvihāravāsīnaṃ vinicchayo, tassa pamāṇabhūtataṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sujanassa cā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca"
      },
      "-saddo sampiṇḍanattho. Tena ‘‘na kevalaṃ jambudīpavāsīnameva atthāya ",
      ", atha kho sādhujanatosanatthañcā’’ti dasseti. Tena ca ‘‘tambapaṇṇidīpavāsīnampi atthāyā’’ti ayamattho siddho hoti uggahaṇādisukaratāya tesampi bahukārattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ciraṭṭhitattha"
      },
      "nti ciraṭṭhitiatthaṃ, cirakālappavattanāyāti attho. Idañhi atthappakāsanaṃ aviparītapadabyañjanasunikkhepassa atthasunayassa ca upāyabhāvato saddhammassa ciraṭṭhitiyā pavattati. Vuttañhetaṃ bhagavatā ‘‘dveme, bhikkhave, dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattanti. Katame dve? Sunikkhittañca padabyañjanaṃ attho ca sunīto’’ti (a. ni. 2.20)."
    ],
    "innerText": "10.Sujanassa cāti ca-saddo sampiṇḍanattho. Tena ‘‘na kevalaṃ jambudīpavāsīnameva atthāya , atha kho sādhujanatosanatthañcā’’ti dasseti. Tena ca ‘‘tambapaṇṇidīpavāsīnampi atthāyā’’ti ayamattho siddho hoti uggahaṇādisukaratāya tesampi bahukārattā. Ciraṭṭhitatthanti ciraṭṭhitiatthaṃ, cirakālappavattanāyāti attho. Idañhi atthappakāsanaṃ aviparītapadabyañjanasunikkhepassa atthasunayassa ca upāyabhāvato saddhammassa ciraṭṭhitiyā pavattati. Vuttañhetaṃ bhagavatā ‘‘dveme, bhikkhave, dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattanti. Katame dve? Sunikkhittañca padabyañjanaṃ attho ca sunīto’’ti (a. ni. 2.20)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11-12"
      },
      ". Yaṃ atthavaṇṇanaṃ kattukāmo, tassā mahattaṃ pariharituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sāvatthipabhūtīna’’"
      },
      "ntiādi vuttaṃ. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na idha bhiyyo vitthārakathaṃ karissāmi, na taṃ idha vicārayissāmī’’"
      },
      "ti ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅgītīnaṃ dvinna"
      },
      "nti dīghamajjhimanikāyānaṃ."
    ],
    "innerText": "11-12. Yaṃ atthavaṇṇanaṃ kattukāmo, tassā mahattaṃ pariharituṃ ‘‘sāvatthipabhūtīna’’ntiādi vuttaṃ. Tenevāha – ‘‘na idha bhiyyo vitthārakathaṃ karissāmi, na taṃ idha vicārayissāmī’’ti ca. Saṅgītīnaṃ dvinnanti dīghamajjhimanikāyānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". ‘‘Na idha bhiyyo vitthārakathaṃ karissāmī’’ti sāmaññato vuttassa atthassa avassayaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘suttānaṃ panā’’"
      },
      "tiādi vuttaṃ."
    ],
    "innerText": "13. ‘‘Na idha bhiyyo vitthārakathaṃ karissāmī’’ti sāmaññato vuttassa atthassa avassayaṃ dassetuṃ ‘‘suttānaṃ panā’’tiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Yaṃ aṭṭhakathaṃ kattukāmo, tadekadesabhāvena visuddhimaggo gahetabboti kathikānaṃ upadesaṃ karonto tatta vicāritadhamme uddesavasena dasseti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sīlakathā’’"
      },
      "tiādinā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīlakathā"
      },
      "ti cārittavārittādivasena sīlassa vitthārakathā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhutadhammā"
      },
      "ti piṇḍapātikaṅgādayo terasa kilesadhunanakadhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammaṭṭhānāni sabbānī"
      },
      "ti pāḷiyaṃ āgatāni aṭṭhattiṃsa, aṭṭhakathāyaṃ dveti niravasesāni yogakammassa bhāvanāya pavattiṭṭhānāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cariyāvidhānasahito"
      },
      "ti rāgacariyādīnaṃ sabhāgādividhānena sahito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhānāni"
      },
      " cattāri rūpāvacarajjhānāni, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāpattiyo"
      },
      " catasso arūpasamāpattiyo. Aṭṭhapi vā paṭiladdhamattāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhānāni,"
      },
      " samāpajjanavasibhāvappattiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāpattiyo. Jhānāni"
      },
      " vā rūpārūpāvacarajjhānāni, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāpattiyo"
      },
      " phalasamāpattinirodhasamāpattiyo."
    ],
    "innerText": "14. Yaṃ aṭṭhakathaṃ kattukāmo, tadekadesabhāvena visuddhimaggo gahetabboti kathikānaṃ upadesaṃ karonto tatta vicāritadhamme uddesavasena dasseti ‘‘sīlakathā’’tiādinā. Tattha sīlakathāti cārittavārittādivasena sīlassa vitthārakathā. Dhutadhammāti piṇḍapātikaṅgādayo terasa kilesadhunanakadhammā. Kammaṭṭhānāni sabbānīti pāḷiyaṃ āgatāni aṭṭhattiṃsa, aṭṭhakathāyaṃ dveti niravasesāni yogakammassa bhāvanāya pavattiṭṭhānāni. Cariyāvidhānasahitoti rāgacariyādīnaṃ sabhāgādividhānena sahito. Jhānāni cattāri rūpāvacarajjhānāni, samāpattiyo catasso arūpasamāpattiyo. Aṭṭhapi vā paṭiladdhamattāni jhānāni, samāpajjanavasibhāvappattiyā samāpattiyo. Jhānāni vā rūpārūpāvacarajjhānāni, samāpattiyo phalasamāpattinirodhasamāpattiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". Lokiyalokuttarabhedā cha abhiññāyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbā abhiññāyo"
      },
      ". Ñāṇavibhaṅgādīsu āgatanayena ekavidhādinā paññāya saṅkaletvā sampiṇḍetvā nicchayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāsaṅkalananicchayo"
      },
      "."
    ],
    "innerText": "15. Lokiyalokuttarabhedā cha abhiññāyo sabbā abhiññāyo. Ñāṇavibhaṅgādīsu āgatanayena ekavidhādinā paññāya saṅkaletvā sampiṇḍetvā nicchayo paññāsaṅkalananicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". Paccayadhammānaṃ hetuādīnaṃ paccayuppannadhammānaṃ hetupaccayādibhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccayākāro,"
      },
      " tassa desanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccayākāradesanā,"
      },
      " paṭiccasamuppādakathāti attho. Sā pana nikāyantaraladdhisaṅkararahitatāya suṭṭhuparisuddhā, ghanavinibbhogassa ca sudukkaratāya nipuṇā saṇhasukhumā, ekattanayādisahitā ",
      " ca tattha vicāritāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘suparisuddhanipuṇanayā’’"
      },
      "ti. Paṭisambhidādīsu āgatanayaṃ avisajjetvāva vicāritattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avimuttatantimaggā"
      },
      "."
    ],
    "innerText": "16. Paccayadhammānaṃ hetuādīnaṃ paccayuppannadhammānaṃ hetupaccayādibhāvo paccayākāro, tassa desanā paccayākāradesanā, paṭiccasamuppādakathāti attho. Sā pana nikāyantaraladdhisaṅkararahitatāya suṭṭhuparisuddhā, ghanavinibbhogassa ca sudukkaratāya nipuṇā saṇhasukhumā, ekattanayādisahitā ca tattha vicāritāti āha ‘‘suparisuddhanipuṇanayā’’ti. Paṭisambhidādīsu āgatanayaṃ avisajjetvāva vicāritattā avimuttatantimaggā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iti pana sabba"
      },
      "nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iti"
      },
      "-saddo parisamāpane, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pana"
      },
      "-saddo vacanālaṅkāre, etaṃ sabbanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti imissā aṭṭhakathāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na taṃ vicārayissāmi"
      },
      " punaruttibhāvatoti adhippāyo."
    ],
    "innerText": "17.Iti pana sabbanti iti-saddo parisamāpane, pana-saddo vacanālaṅkāre, etaṃ sabbanti attho. Idhāti imissā aṭṭhakathāya. Na taṃ vicārayissāmi punaruttibhāvatoti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". Idāni ",
      " tasseva avicāraṇassa ekantakāraṇaṃ niddhārento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘majjhe visuddhimaggo’’"
      },
      "tiādimāha. Tattha ‘‘majjhe ṭhatvā’’ti etena majjhaṭṭhabhāvadīpanena visesato catunnaṃ āgamānaṃ sādhāraṇaṭṭhakathā visuddhimaggo, na sumaṅgalavilāsiniādayo viya asādhāraṇaṭṭhakathāti dasseti. ‘‘Visesato’’ti ca idaṃ vinayābhidhammānampi visuddhimaggo yathārahaṃ atthavaṇṇanā hoti evāti katvā vuttaṃ."
    ],
    "innerText": "18. Idāni tasseva avicāraṇassa ekantakāraṇaṃ niddhārento ‘‘majjhe visuddhimaggo’’tiādimāha. Tattha ‘‘majjhe ṭhatvā’’ti etena majjhaṭṭhabhāvadīpanena visesato catunnaṃ āgamānaṃ sādhāraṇaṭṭhakathā visuddhimaggo, na sumaṅgalavilāsiniādayo viya asādhāraṇaṭṭhakathāti dasseti. ‘‘Visesato’’ti ca idaṃ vinayābhidhammānampi visuddhimaggo yathārahaṃ atthavaṇṇanā hoti evāti katvā vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iccevā"
      },
      "ti iti eva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tampī"
      },
      "ti visuddhimaggampi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etāyā"
      },
      "ti sāratthappakāsiniyā."
    ],
    "innerText": "19.Iccevāti iti eva. Tampīti visuddhimaggampi. Etāyāti sāratthappakāsiniyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha ca ‘‘sīhaḷadīpaṃ ābhatā’’tiādinā aṭṭhakathākaraṇassa nimittaṃ dasseti, ‘‘dīpavāsīnamatthāya sujanassa ca tuṭṭhatthaṃ ciraṭṭhitatthañca dhammassā’’ti etehi payojanaṃ, ‘‘saṃyuttāgamavarassa atthaṃ pakāsayissāmī’’ti etena piṇḍatthaṃ, ‘‘apanetvāna tatohaṃ sīhaḷabhāsa’’ntiādinā ‘‘sāvatthipabhūtīna’’ntiādinā ‘‘sīlakathā’’tiādinā ca karaṇappakāraṃ. Heṭṭhimanikāyesu visuddhimagge ca vicāritānaṃ atthānaṃ avicāraṇampi hi idha karaṇappakāro evāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ganthārambhakathāvaṇṇanā niṭṭhitā."
  }
]