[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "10. Yakkhasaṃyuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Indakasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "235"
      },
      ". Yakkhasaṃyuttassa ",
      " paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "indakassā"
      },
      "ti indakūṭanivāsino yakkhassa. Yakkhato hi kūṭena, kūṭato ca yakkhena nāmaṃ laddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpaṃ na jīvanti vadantī"
      },
      "ti yadi buddhā rūpaṃ jīvanti na vadanti, yadi rūpaṃ satto puggaloti evaṃ na vadantīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathaṃ nvaya"
      },
      "nti kathaṃ nu ayaṃ? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kutassa aṭṭhīyakapiṇḍametī"
      },
      "ti assa sattassa aṭṭhiyakapiṇḍañca kuto āgacchati? Ettha ca aṭṭhiggahaṇena tīṇi aṭṭhisatāni, yakapiṇḍaggahaṇena nava maṃsapesisatāni gahitāni. Yadi rūpaṃ na jīvo, athassa imāni ca aṭṭhīni imā ca maṃsapesiyo kuto āgacchantīti pucchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathaṃ nvayaṃ sajjati gabbharasmi"
      },
      "nti kena nu kāraṇena ayaṃ satto mātukucchismiṃ sajjati laggati, tiṭṭhatīti? Puggalavādī kiresa yakkho, ‘‘ekappahāreneva satto mātukucchismiṃ nibbattatī’’ti gahetvā gabbhaseyyakasattassa mātā macchamaṃsādīni khādati, sabbāni ekarattivāsena pacitvā pheṇaṃ viya vilīyanti. Yadi rūpaṃ satto na bhaveyya, evameva vilīyeyyāti laddhiyā evamāha. Athassa bhagavā – ‘‘na mātukucchismiṃ ekappahāreneva nibbattati, anupubbena pana vaḍḍhatī’’ti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭhamaṃ kalalaṃ hotī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭhama"
      },
      "nti paṭhamena paṭisandhiviññāṇena saddhiṃ tissoti vā phussoti vā nāmaṃ natthi, atha kho tīhi jātiuṇṇaṃsūhi katasuttagge saṇṭhitatelabinduppamāṇaṃ kalalaṃ hoti, yaṃ sandhāya vuttaṃ –"
    ],
    "innerText": "235. Yakkhasaṃyuttassa paṭhame indakassāti indakūṭanivāsino yakkhassa. Yakkhato hi kūṭena, kūṭato ca yakkhena nāmaṃ laddhaṃ. Rūpaṃ na jīvanti vadantīti yadi buddhā rūpaṃ jīvanti na vadanti, yadi rūpaṃ satto puggaloti evaṃ na vadantīti attho. Kathaṃ nvayanti kathaṃ nu ayaṃ? Kutassa aṭṭhīyakapiṇḍametīti assa sattassa aṭṭhiyakapiṇḍañca kuto āgacchati? Ettha ca aṭṭhiggahaṇena tīṇi aṭṭhisatāni, yakapiṇḍaggahaṇena nava maṃsapesisatāni gahitāni. Yadi rūpaṃ na jīvo, athassa imāni ca aṭṭhīni imā ca maṃsapesiyo kuto āgacchantīti pucchati. Kathaṃ nvayaṃ sajjati gabbharasminti kena nu kāraṇena ayaṃ satto mātukucchismiṃ sajjati laggati, tiṭṭhatīti? Puggalavādī kiresa yakkho, ‘‘ekappahāreneva satto mātukucchismiṃ nibbattatī’’ti gahetvā gabbhaseyyakasattassa mātā macchamaṃsādīni khādati, sabbāni ekarattivāsena pacitvā pheṇaṃ viya vilīyanti. Yadi rūpaṃ satto na bhaveyya, evameva vilīyeyyāti laddhiyā evamāha. Athassa bhagavā – ‘‘na mātukucchismiṃ ekappahāreneva nibbattati, anupubbena pana vaḍḍhatī’’ti dassento paṭhamaṃ kalalaṃ hotītiādimāha. Tattha paṭhamanti paṭhamena paṭisandhiviññāṇena saddhiṃ tissoti vā phussoti vā nāmaṃ natthi, atha kho tīhi jātiuṇṇaṃsūhi katasuttagge saṇṭhitatelabinduppamāṇaṃ kalalaṃ hoti, yaṃ sandhāya vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tilatelassa yathā bindu, sappimaṇḍo anāvilo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evaṃ vaṇṇappaṭibhāgaṃ, kalalaṃ sampavuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kalalā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hoti abbuda"
      },
      "nti tasmā kalalā sattāhaccayena maṃsadhovanaudakavaṇṇaṃ abbudaṃ nāma hoti, kalalanti nāmaṃ antaradhāyati. Vuttampi cetaṃ –"
    ],
    "innerText": "Kalalāhoti abbudanti tasmā kalalā sattāhaccayena maṃsadhovanaudakavaṇṇaṃ abbudaṃ nāma hoti, kalalanti nāmaṃ antaradhāyati. Vuttampi cetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sattāhaṃ kalalaṃ hoti, paripakkaṃ samūhataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vivaṭṭamānaṃ tabbhāvaṃ, abbudaṃ nāma jāyatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abbudā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jāyate pesī"
      },
      "ti tasmāpi abbudā sattāhaccayena vilīnatipusadisā pesi nāma sañjāyati. Sā maricaphāṇitena dīpetabbā. Gāmadārikā hi supakkāni maricāni gahetvā sāṭakante bhaṇḍikaṃ katvā pīḷetvā maṇḍaṃ ādāya kapāle pakkhipitvā ātape ṭhapenti, taṃ sukkhamānaṃ sabbabhāgehi muccati. Evarūpā pesi hoti, abbudanti nāmaṃ antaradhāyati. Vuttampi cetaṃ –"
    ],
    "innerText": "Abbudājāyate pesīti tasmāpi abbudā sattāhaccayena vilīnatipusadisā pesi nāma sañjāyati. Sā maricaphāṇitena dīpetabbā. Gāmadārikā hi supakkāni maricāni gahetvā sāṭakante bhaṇḍikaṃ katvā pīḷetvā maṇḍaṃ ādāya kapāle pakkhipitvā ātape ṭhapenti, taṃ sukkhamānaṃ sabbabhāgehi muccati. Evarūpā pesi hoti, abbudanti nāmaṃ antaradhāyati. Vuttampi cetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sattāhaṃ abbudaṃ hoti, paripakkaṃ samūhataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vivaṭṭamānaṃ tabbhāvaṃ, pesi nāma pajāyatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pesi nibbattatī ghano"
      },
      "ti tato pesito sattāhaccayena kukkuṭaṇḍasaṇṭhāno ghano nāma maṃsapiṇḍo nibbattati, pesīti nāmaṃ antaradhāyati. Vuttampi cetaṃ –"
    ],
    "innerText": "Pesi nibbattatī ghanoti tato pesito sattāhaccayena kukkuṭaṇḍasaṇṭhāno ghano nāma maṃsapiṇḍo nibbattati, pesīti nāmaṃ antaradhāyati. Vuttampi cetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sattāhaṃ pesi bhavati, paripakkaṃ samūhataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vivaṭṭamānaṃ tabbhāvaṃ, ghanoti nāma jāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yathā kukkuṭiyā aṇḍaṃ, samantā parimaṇḍalaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evaṃ ghanassa saṇṭhānaṃ, nibbattaṃ kammapaccayā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ghanā pasākhā jāyantī"
      },
      "ti pañcame sattāhe dvinnaṃ hatthapādānaṃ sīsassa catthāya pañca pīḷakā jāyanti, yaṃ sandhāyetaṃ vuttaṃ ‘‘pañcame, bhikkhave, sattāhe pañca pīḷakā saṇṭhahanti kammato’’ti."
    ],
    "innerText": "Ghanā pasākhā jāyantīti pañcame sattāhe dvinnaṃ hatthapādānaṃ sīsassa catthāya pañca pīḷakā jāyanti, yaṃ sandhāyetaṃ vuttaṃ ‘‘pañcame, bhikkhave, sattāhe pañca pīḷakā saṇṭhahanti kammato’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ito ",
      " paraṃ chaṭṭhasattamādīni sattāhāni atikkamma desanaṃ saṅkhipitvā dvācattālīse sattāhe pariṇatakālaṃ gahetvā dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kesā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kesā lomā nakhāpi cā"
      },
      "ti dvācattālīse sattāhe etāni jāyanti."
    ],
    "innerText": "Ito paraṃ chaṭṭhasattamādīni sattāhāni atikkamma desanaṃ saṅkhipitvā dvācattālīse sattāhe pariṇatakālaṃ gahetvā dassento kesātiādimāha. Tattha kesā lomā nakhāpi cāti dvācattālīse sattāhe etāni jāyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena so tattha yāpetī"
      },
      "ti tassa hi nābhito uṭṭhito nāḷo mātu udarapaṭalena ekābaddho hoti, so uppaladaṇḍako viya chiddo, tena āhāraraso saṃsaritvā āhārasamuṭṭhānarūpaṃ samuṭṭhāpeti. Evaṃ so dasa māse yāpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mātukucchigato naro"
      },
      "ti mātuyā tirokucchigato, kucchiyā abbhantaragatoti attho. Iti bhagavā ",
      " ‘‘evaṃ kho, yakkha, ayaṃ satto anupubbena mātukucchiyaṃ vaḍḍhati, na ekappahāreneva nibbattatī’’ti dasseti. Paṭhamaṃ."
    ],
    "innerText": "Tena so tattha yāpetīti tassa hi nābhito uṭṭhito nāḷo mātu udarapaṭalena ekābaddho hoti, so uppaladaṇḍako viya chiddo, tena āhāraraso saṃsaritvā āhārasamuṭṭhānarūpaṃ samuṭṭhāpeti. Evaṃ so dasa māse yāpeti. Mātukucchigato naroti mātuyā tirokucchigato, kucchiyā abbhantaragatoti attho. Iti bhagavā ‘‘evaṃ kho, yakkha, ayaṃ satto anupubbena mātukucchiyaṃ vaḍḍhati, na ekappahāreneva nibbattatī’’ti dasseti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Sakkanāmasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "236"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sakkanāmako"
      },
      "ti evaṃ nāmako eko yakkho, so kira mārapakkhikayakkho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vippamuttassā"
      },
      "ti tīhi bhavehi vippamuttassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadañña"
      },
      "nti yaṃ aññaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaṇṇenā"
      },
      "ti kāraṇena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃvāso"
      },
      "ti ekato vāso, sakkhidhammo mittadhammoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sappañño"
      },
      "ti supañño sambuddho. Dutiyaṃ."
    ],
    "innerText": "236. Dutiye sakkanāmakoti evaṃ nāmako eko yakkho, so kira mārapakkhikayakkho. Vippamuttassāti tīhi bhavehi vippamuttassa. Yadaññanti yaṃ aññaṃ. Vaṇṇenāti kāraṇena. Saṃvāsoti ekato vāso, sakkhidhammo mittadhammoti attho. Sappaññoti supañño sambuddho. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Sūcilomasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "237"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gayāya"
      },
      "nti gayāgāme, gayāya avidūre niviṭṭhagāmaṃ upanissāyāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭaṅkitamañce"
      },
      "ti dīghamañce pādamajjhe vijjhitvā aṭaniyo pavesetvā katamañce. Tassa ‘‘idaṃ upari, idaṃ heṭṭhā’’ti natthi, parivattetvā atthatopi tādisova hoti, taṃ devaṭṭhāne ṭhapenti. Catunnaṃ pāsāṇānaṃ upari pāsāṇaṃ attharitvā katagehampi ‘‘ṭaṅkitamañco’’ti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sūcilomassā"
      },
      "ti kathinasūcisadisalomassa. So kira kassapassa bhagavato sāsane pabbajitvā dūraṭṭhānato āgato sedamalaggahitena gattena supaññattaṃ saṅghikamañcaṃ anādarena apaccattharitvā nipajji, tassa parisuddhasīlassa taṃ kammaṃ suddhavatthe kāḷakaṃ viya ahosi. So tasmiṃ attabhāve visesaṃ nibbattetuṃ asakkonto kālaṃkatvā gayāgāmadvāre saṅkāraṭṭhāne yakkho hutvā nibbatti. Nibbattamattasseva cassa sakalasarīraṃ kathinasūcīhi gavicchivijjhitaṃ viya jātaṃ."
    ],
    "innerText": "237. Tatiye gayāyanti gayāgāme, gayāya avidūre niviṭṭhagāmaṃ upanissāyāti attho. Ṭaṅkitamañceti dīghamañce pādamajjhe vijjhitvā aṭaniyo pavesetvā katamañce. Tassa ‘‘idaṃ upari, idaṃ heṭṭhā’’ti natthi, parivattetvā atthatopi tādisova hoti, taṃ devaṭṭhāne ṭhapenti. Catunnaṃ pāsāṇānaṃ upari pāsāṇaṃ attharitvā katagehampi ‘‘ṭaṅkitamañco’’ti vuccati. Sūcilomassāti kathinasūcisadisalomassa. So kira kassapassa bhagavato sāsane pabbajitvā dūraṭṭhānato āgato sedamalaggahitena gattena supaññattaṃ saṅghikamañcaṃ anādarena apaccattharitvā nipajji, tassa parisuddhasīlassa taṃ kammaṃ suddhavatthe kāḷakaṃ viya ahosi. So tasmiṃ attabhāve visesaṃ nibbattetuṃ asakkonto kālaṃkatvā gayāgāmadvāre saṅkāraṭṭhāne yakkho hutvā nibbatti. Nibbattamattasseva cassa sakalasarīraṃ kathinasūcīhi gavicchivijjhitaṃ viya jātaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athekadivasaṃ ",
      " bhagavā paccūsasamaye lokaṃ olokento taṃ yakkhaṃ paṭhamāvajjanasseva āpāthaṃ āgataṃ disvā – ‘‘ayaṃ ekaṃ buddhantaraṃ mahādukkhaṃ anubhavi. Kiṃ nu khvāssa maṃ āgamma sotthikāraṇaṃ bhaveyyā’’ti? Āvajjento ",
      " paṭhamamaggassa upanissayaṃ addasa. Athassa saṅgahaṃ kātukāmo surattadupaṭṭaṃ nivāsetvā sugatamahācīvaraṃ pārupitvā devavimānakappaṃ gandhakuṭiṃ pahāya hatthigavāssamanussakukkurādikuṇapaduggandhaṃ saṅkāraṭṭhānaṃ gantvā tattha mahāgandhakuṭiyaṃ viya nisīdi. Taṃ sandhāya vuttaṃ ‘‘sūcilomassa yakkhassa bhavane’’ti."
    ],
    "innerText": "Athekadivasaṃ bhagavā paccūsasamaye lokaṃ olokento taṃ yakkhaṃ paṭhamāvajjanasseva āpāthaṃ āgataṃ disvā – ‘‘ayaṃ ekaṃ buddhantaraṃ mahādukkhaṃ anubhavi. Kiṃ nu khvāssa maṃ āgamma sotthikāraṇaṃ bhaveyyā’’ti? Āvajjento paṭhamamaggassa upanissayaṃ addasa. Athassa saṅgahaṃ kātukāmo surattadupaṭṭaṃ nivāsetvā sugatamahācīvaraṃ pārupitvā devavimānakappaṃ gandhakuṭiṃ pahāya hatthigavāssamanussakukkurādikuṇapaduggandhaṃ saṅkāraṭṭhānaṃ gantvā tattha mahāgandhakuṭiyaṃ viya nisīdi. Taṃ sandhāya vuttaṃ ‘‘sūcilomassa yakkhassa bhavane’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kharo"
      },
      "ti ",
      " suṃsumārapiṭṭhi viya chadaniṭṭhakāhi visamacchadanapiṭṭhi viya ca kharasarīro. So kira kassapasammāsambuddhakāle sīlasampanno upāsako ekadivase vihāre cittattharaṇādīhi atthatāya bhūmiyā saṅghike attharaṇe attano uttarāsaṅgaṃ apaccattharitvā nipajji. Saṅghikaṃ telaṃ abhājetvā attano uttarāsaṅgaṃ apaccattharitvā nipajji. Saṅghikaṃ telaṃ abhājetvā attano hatthehi sarīraṃ makkhesītipi vadanti. So tena kammena sagge nibbattituṃ asakkonto tasseva gāmassa dvāre saṅkāraṭṭhāne yakkho hutvā nibbatti. Nibbattamattassa cassa sakalasarīraṃ vuttappakāraṃ ahosi. Te ubhopi sahāyā jātā. Iti kharassa kharabhāvo veditabbo."
    ],
    "innerText": "Kharoti suṃsumārapiṭṭhi viya chadaniṭṭhakāhi visamacchadanapiṭṭhi viya ca kharasarīro. So kira kassapasammāsambuddhakāle sīlasampanno upāsako ekadivase vihāre cittattharaṇādīhi atthatāya bhūmiyā saṅghike attharaṇe attano uttarāsaṅgaṃ apaccattharitvā nipajji. Saṅghikaṃ telaṃ abhājetvā attano uttarāsaṅgaṃ apaccattharitvā nipajji. Saṅghikaṃ telaṃ abhājetvā attano hatthehi sarīraṃ makkhesītipi vadanti. So tena kammena sagge nibbattituṃ asakkonto tasseva gāmassa dvāre saṅkāraṭṭhāne yakkho hutvā nibbatti. Nibbattamattassa cassa sakalasarīraṃ vuttappakāraṃ ahosi. Te ubhopi sahāyā jātā. Iti kharassa kharabhāvo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avidūre atikkamantī"
      },
      "ti gocaraṃ pariyesantā samāgamaṭṭhānaṃ vā gacchantā āsanne ṭhāne gacchanti. Tesu sūcilomo satthāraṃ na passati, kharalomo paṭhamataraṃ disvā sūcilomaṃ yakkhaṃ etadavoca – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘eso samaṇo’’"
      },
      "ti, samma, esa tava bhavanaṃ pavisitvā nisinno eko samaṇoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Neso samaṇo, samaṇako eso"
      },
      "ti so kira yo maṃ passitvā bhīto palāyati, taṃ samaṇakoti vadati. Yo na bhāyati, taṃ samaṇoti. Tasmā ‘‘ayaṃ maṃ disvā bhīto palāyissatī’’ti maññamāno evamāha."
    ],
    "innerText": "Avidūre atikkamantīti gocaraṃ pariyesantā samāgamaṭṭhānaṃ vā gacchantā āsanne ṭhāne gacchanti. Tesu sūcilomo satthāraṃ na passati, kharalomo paṭhamataraṃ disvā sūcilomaṃ yakkhaṃ etadavoca – ‘‘eso samaṇo’’ti, samma, esa tava bhavanaṃ pavisitvā nisinno eko samaṇoti. Neso samaṇo, samaṇako esoti so kira yo maṃ passitvā bhīto palāyati, taṃ samaṇakoti vadati. Yo na bhāyati, taṃ samaṇoti. Tasmā ‘‘ayaṃ maṃ disvā bhīto palāyissatī’’ti maññamāno evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyaṃ upanāmesī"
      },
      "ti bheravarūpaṃ nimminitvā mahāmukhaṃ vivaritvā sakalasarīre lomāni uṭṭhāpetvā kāyaṃ upanāmesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apanāmesī"
      },
      "ti ratanasatikaṃ suvaṇṇagghanikaṃ viya thokaṃ apanāmesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpako"
      },
      "ti lāmako amanuñño. So gūthaṃ viya aggi viya kaṇhasappo viya ca parivajjetabbo, na iminā suvaṇṇavaṇṇena sarīrena sampaṭicchitabbo. Evaṃ vutte pana sūcilomo ‘‘pāpako kira me samphasso’’ti kuddho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañhaṃ taṃ, samaṇā"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittaṃ vā te khipissāmī"
      },
      "ti yesañhi amanussā cittaṃ ",
      " khipitukāmā honti, tesaṃ setamukhaṃ nīlodaraṃ surattahatthapādaṃ ",
      " mahāsīsaṃ pajjalitanettaṃ bheravaṃ vā attabhāvaṃ nimminitvā dassenti, bheravaṃ vā saddaṃ sāventi, kathentānaṃyeva vā mukhe hatthaṃ pakkhipitvā hadayaṃ maddanti, tena te sattā ummattakā honti khittacittā. Taṃ sandhāyevamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāragaṅgāyā"
      },
      "ti dvīsu pādesu gahetvā ",
      " taṃ āviñchetvā yathā na punāgacchasi, evaṃ pāraṃ vā gaṅgāya khipissāmīti vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sadevake"
      },
      "tiādi vuttatthameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puccha yadākaṅkhasī"
      },
      "ti yaṃkiñci ākaṅkhasi, taṃ sabbaṃ puccha, asesaṃ te byākarissāmīti sabbaññupavāraṇaṃ pavāreti."
    ],
    "innerText": "Kāyaṃ upanāmesīti bheravarūpaṃ nimminitvā mahāmukhaṃ vivaritvā sakalasarīre lomāni uṭṭhāpetvā kāyaṃ upanāmesi. Apanāmesīti ratanasatikaṃ suvaṇṇagghanikaṃ viya thokaṃ apanāmesi. Pāpakoti lāmako amanuñño. So gūthaṃ viya aggi viya kaṇhasappo viya ca parivajjetabbo, na iminā suvaṇṇavaṇṇena sarīrena sampaṭicchitabbo. Evaṃ vutte pana sūcilomo ‘‘pāpako kira me samphasso’’ti kuddho pañhaṃ taṃ, samaṇātiādimāha. Cittaṃ vā te khipissāmīti yesañhi amanussā cittaṃ khipitukāmā honti, tesaṃ setamukhaṃ nīlodaraṃ surattahatthapādaṃ mahāsīsaṃ pajjalitanettaṃ bheravaṃ vā attabhāvaṃ nimminitvā dassenti, bheravaṃ vā saddaṃ sāventi, kathentānaṃyeva vā mukhe hatthaṃ pakkhipitvā hadayaṃ maddanti, tena te sattā ummattakā honti khittacittā. Taṃ sandhāyevamāha. Pāragaṅgāyāti dvīsu pādesu gahetvā taṃ āviñchetvā yathā na punāgacchasi, evaṃ pāraṃ vā gaṅgāya khipissāmīti vadati. Sadevaketiādi vuttatthameva. Puccha yadākaṅkhasīti yaṃkiñci ākaṅkhasi, taṃ sabbaṃ puccha, asesaṃ te byākarissāmīti sabbaññupavāraṇaṃ pavāreti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kutonidānā"
      },
      "ti kiṃnidānā, kiṃpaccayāti attho? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kumārakā dhaṅkamivossajantī"
      },
      "ti yathā kumārakā kākaṃ gahetvā ossajanti khipanti, evaṃ pāpavitakkā kuto samuṭṭhāya cittaṃ ossajantīti pucchati?"
    ],
    "innerText": "Kutonidānāti kiṃnidānā, kiṃpaccayāti attho? Kumārakā dhaṅkamivossajantīti yathā kumārakā kākaṃ gahetvā ossajanti khipanti, evaṃ pāpavitakkā kuto samuṭṭhāya cittaṃ ossajantīti pucchati?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itonidānā"
      },
      "ti ayaṃ attabhāvo nidānaṃ etesanti ito nidānā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itojā"
      },
      "ti ito attabhāvato jātā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ito samuṭṭhāya manovitakkā"
      },
      "ti yathā dīghasuttakena pāde baddhaṃ kākaṃ kumārakā tassa suttapariyantaṃ aṅguliyaṃ veṭhetvā ossajanti, so dūraṃ gantvāpi puna tesaṃ pādamūleyeva patati, evameva ito attabhāvato samuṭṭhāya pāpavitakkā cittaṃ ossajanti."
    ],
    "innerText": "Itonidānāti ayaṃ attabhāvo nidānaṃ etesanti ito nidānā. Itojāti ito attabhāvato jātā. Ito samuṭṭhāya manovitakkāti yathā dīghasuttakena pāde baddhaṃ kākaṃ kumārakā tassa suttapariyantaṃ aṅguliyaṃ veṭhetvā ossajanti, so dūraṃ gantvāpi puna tesaṃ pādamūleyeva patati, evameva ito attabhāvato samuṭṭhāya pāpavitakkā cittaṃ ossajanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Snehajā"
      },
      "ti taṇhāsinehato jātā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attasambhūtā"
      },
      "ti attani sambhūtā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nigrodhasseva khandhajā"
      },
      "ti nigrodhakhandhe jātā pārohā viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puthū"
      },
      "ti bahū anekappakārā pāpavitakkā taṃsampayuttakilesā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visattā"
      },
      "ti laggā laggitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmesū"
      },
      "ti vatthukāmesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Māluvāva vitatā vane"
      },
      "ti yathā vane māluvā latā yaṃ rukkhaṃ nissāya jāyati, taṃ mūlato yāva aggā, aggato yāva mūlā punappunaṃ saṃsibbitvā ajjhottharitvā otatavitatā tiṭṭhati. Evaṃ vatthukāmesu puthū kilesakāmā visattā, puthū vā sattā tehi kilesakāmehi vatthukāmesu visattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye naṃ pajānantī"
      },
      "ti ye ‘‘attasambhūtā’’ti ettha vuttaṃ attabhāvaṃ jānanti."
    ],
    "innerText": "Snehajāti taṇhāsinehato jātā. Attasambhūtāti attani sambhūtā. Nigrodhasseva khandhajāti nigrodhakhandhe jātā pārohā viya. Puthūti bahū anekappakārā pāpavitakkā taṃsampayuttakilesā ca. Visattāti laggā laggitā. Kāmesūti vatthukāmesu. Māluvāva vitatā vaneti yathā vane māluvā latā yaṃ rukkhaṃ nissāya jāyati, taṃ mūlato yāva aggā, aggato yāva mūlā punappunaṃ saṃsibbitvā ajjhottharitvā otatavitatā tiṭṭhati. Evaṃ vatthukāmesu puthū kilesakāmā visattā, puthū vā sattā tehi kilesakāmehi vatthukāmesu visattā. Ye naṃ pajānantīti ye ‘‘attasambhūtā’’ti ettha vuttaṃ attabhāvaṃ jānanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yatonidāna"
      },
      "nti ",
      " yaṃ nidānamassa attabhāvassa tañca jānanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te naṃ vinodentī"
      },
      "ti te evaṃ attabhāvasaṅkhātassa dukkhasaccassa nidānabhūtaṃ samudayasaccaṃ maggasaccena vinodenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te duttara"
      },
      "nti te samudayasaccaṃ nīharantā idaṃ duttaraṃ kilesoghaṃ taranti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atiṇṇapubba"
      },
      "nti anamatagge saṃsāre supinantepi na tiṇṇapubbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apunabbhavāyā"
      },
      "ti apunabbhavasaṅkhātassa nirodhasaccassatthāya. Iti ",
      " imāya gāthāya cattāri saccāni pakāsento arahattanikūṭena ",
      " desanaṃ niṭṭhapesi. Desanāvasāne sūcilomo tasmiṃyeva padese ṭhito desanānusārena ñāṇaṃ pesetvā sotāpattiphale patiṭṭhito. Sotāpannā ca nāma na kiliṭṭhattabhāve tiṭṭhantīti saha phalapaṭilābhenassa sarīre setakaṇḍupīḷakasūciyo sabbā patitā. So dibbavatthanivattho dibbavaradukūluttarāsaṅgo dibbaveṭhanaveṭhito dibbābharaṇagandhamāladharo suvaṇṇavaṇṇo hutvā bhummadevatāparihāraṃ paṭilabhīti. Tatiyaṃ."
    ],
    "innerText": "Yatonidānanti yaṃ nidānamassa attabhāvassa tañca jānanti. Te naṃ vinodentīti te evaṃ attabhāvasaṅkhātassa dukkhasaccassa nidānabhūtaṃ samudayasaccaṃ maggasaccena vinodenti. Te duttaranti te samudayasaccaṃ nīharantā idaṃ duttaraṃ kilesoghaṃ taranti. Atiṇṇapubbanti anamatagge saṃsāre supinantepi na tiṇṇapubbaṃ. Apunabbhavāyāti apunabbhavasaṅkhātassa nirodhasaccassatthāya. Iti imāya gāthāya cattāri saccāni pakāsento arahattanikūṭena desanaṃ niṭṭhapesi. Desanāvasāne sūcilomo tasmiṃyeva padese ṭhito desanānusārena ñāṇaṃ pesetvā sotāpattiphale patiṭṭhito. Sotāpannā ca nāma na kiliṭṭhattabhāve tiṭṭhantīti saha phalapaṭilābhenassa sarīre setakaṇḍupīḷakasūciyo sabbā patitā. So dibbavatthanivattho dibbavaradukūluttarāsaṅgo dibbaveṭhanaveṭhito dibbābharaṇagandhamāladharo suvaṇṇavaṇṇo hutvā bhummadevatāparihāraṃ paṭilabhīti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Maṇibhaddasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "238"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhamedhatī"
      },
      "ti, sukhaṃ paṭilabhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suve seyyo"
      },
      "ti suve suve seyyo, niccameva seyyoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Verā na parimuccatī"
      },
      "ti ahaṃ satimāti ettakena verato na muccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassā"
      },
      "ti yassa arahato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahiṃsāyā"
      },
      "ti karuṇāya ceva karuṇāpubbabhāge ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mettaṃso"
      },
      "ti so mettañceva mettāpubbabhāgañca bhāveti. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṃso"
      },
      "ti koṭṭhāso vuccati. Mettā aṃso etassāti mettaṃso. Idaṃ vuttaṃ hoti – yassa arahato sabbakālaṃ ahiṃsāya rato mano, yassa ca sabbabhūtesu mettākoṭṭhāso atthi, tassa kenaci puggalena saddhiṃ veraṃ nāma natthi yakkhāti. Catutthaṃ."
    ],
    "innerText": "238. Catutthe sukhamedhatīti, sukhaṃ paṭilabhati. Suve seyyoti suve suve seyyo, niccameva seyyoti attho. Verā na parimuccatīti ahaṃ satimāti ettakena verato na muccati. Yassāti yassa arahato. Ahiṃsāyāti karuṇāya ceva karuṇāpubbabhāge ca. Mettaṃsoti so mettañceva mettāpubbabhāgañca bhāveti. Atha vā aṃsoti koṭṭhāso vuccati. Mettā aṃso etassāti mettaṃso. Idaṃ vuttaṃ hoti – yassa arahato sabbakālaṃ ahiṃsāya rato mano, yassa ca sabbabhūtesu mettākoṭṭhāso atthi, tassa kenaci puggalena saddhiṃ veraṃ nāma natthi yakkhāti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Sānusuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "239"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yakkhena gahito hotī"
      },
      "ti so kira tassā upāsikāya ekaputtako. Atha naṃ sā daharakāleyeva pabbājesi. So pabbajitakālato paṭṭhāya sīlavā ahosi vattasampanno, ācariyupajjhāyaāgantukādīnaṃ ",
      " vattaṃ katameva hoti, māsassa aṭṭhamīdivase pāto vuṭṭhāya udakamāḷake udakaṃ upaṭṭhāpetvā dhammassavanaggaṃ sammajjitvā dīpaṃ jāletvā madhurassarena dhammassavanaṃ ghoseti. Bhikkhū tassa thāmaṃ ñatvā ‘‘sarabhāṇaṃ bhaṇa, sāmaṇerā’’ti ajjhesanti. So ‘‘mayhaṃ hadayavāto rujati, kāso vā bādhatī’’ti kiñci paccāhāraṃ akatvā dhammāsanaṃ ",
      " abhiruhitvā ākāsagaṅgaṃ otārento viya sarabhāṇaṃ vatvā otaranto – ‘‘mayhaṃ mātāpitūnampi imasmiṃ sarabhaññe pattī’’ti vadati. Tassa manussā mātāpitaro pattiyā dinnabhāvaṃ na jānanti. Anantarattabhāve panassa mātā yakkhinī jātā. Sā devatāhi saddhiṃ āgatā ",
      ", dhammaṃ sutvā – ‘‘sāmaṇerena dinnapattiṃ anumodāmi, tātā’’ti vadati. Sīlasampannā ca nāma bhikkhū sadevakassa lokassa piyā hontīti tasmiṃ sāmaṇere devatā salajjā sagāravā mahābrahmaṃ viya aggikkhandhaṃ viya ca naṃ maññanti. Sāmaṇere gāravena taṃ yakkhiniṃ garuṃ katvā passanti. Dhammassavanayakkhasamāgamādīsu ‘‘sānumātā sānumātā’’ti yakkhiniyā aggāsanaṃ aggodakaṃ aggapiṇḍaṃ denti. Mahesakkhāpi yakkhā taṃ disvā maggā okkamanti, āsanā vuṭṭhahanti."
    ],
    "innerText": "239. Pañcame yakkhena gahito hotīti so kira tassā upāsikāya ekaputtako. Atha naṃ sā daharakāleyeva pabbājesi. So pabbajitakālato paṭṭhāya sīlavā ahosi vattasampanno, ācariyupajjhāyaāgantukādīnaṃ vattaṃ katameva hoti, māsassa aṭṭhamīdivase pāto vuṭṭhāya udakamāḷake udakaṃ upaṭṭhāpetvā dhammassavanaggaṃ sammajjitvā dīpaṃ jāletvā madhurassarena dhammassavanaṃ ghoseti. Bhikkhū tassa thāmaṃ ñatvā ‘‘sarabhāṇaṃ bhaṇa, sāmaṇerā’’ti ajjhesanti. So ‘‘mayhaṃ hadayavāto rujati, kāso vā bādhatī’’ti kiñci paccāhāraṃ akatvā dhammāsanaṃ abhiruhitvā ākāsagaṅgaṃ otārento viya sarabhāṇaṃ vatvā otaranto – ‘‘mayhaṃ mātāpitūnampi imasmiṃ sarabhaññe pattī’’ti vadati. Tassa manussā mātāpitaro pattiyā dinnabhāvaṃ na jānanti. Anantarattabhāve panassa mātā yakkhinī jātā. Sā devatāhi saddhiṃ āgatā , dhammaṃ sutvā – ‘‘sāmaṇerena dinnapattiṃ anumodāmi, tātā’’ti vadati. Sīlasampannā ca nāma bhikkhū sadevakassa lokassa piyā hontīti tasmiṃ sāmaṇere devatā salajjā sagāravā mahābrahmaṃ viya aggikkhandhaṃ viya ca naṃ maññanti. Sāmaṇere gāravena taṃ yakkhiniṃ garuṃ katvā passanti. Dhammassavanayakkhasamāgamādīsu ‘‘sānumātā sānumātā’’ti yakkhiniyā aggāsanaṃ aggodakaṃ aggapiṇḍaṃ denti. Mahesakkhāpi yakkhā taṃ disvā maggā okkamanti, āsanā vuṭṭhahanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho sāmaṇero vuḍḍhimanvāya paripakkindriyo anabhiratipīḷito anabhiratiṃ vinodetuṃ asakkonto parūḷhakesanakho kiliṭṭhanivāsanapārupano kassaci anārocetvā pattacīvaramādāya ekakova mātu gharaṃ gato. Upāsikā puttaṃ disvā, vanditvā āha – ‘‘tāta, tvaṃ pubbe ācariyupajjhāyehi vā daharasāmaṇerehi vā saddhiṃ idhāgacchasi. Kasmā ekakova ajja āgato’’ti? So ukkaṇṭhitabhāvaṃ ārocesi. Saddhā upāsikā nānappakārena gharāvāse ādīnavaṃ dassetvā puttaṃ ovadamānāpi taṃ saññāpetuṃ asakkontī, ‘‘appeva nāma attano dhammatāyapi sallakkhessatī’’ti anuyojetvāva – ‘‘tiṭṭha, tāta, yāva te yāgubhattaṃ sampādemi, yāguṃ pivitvā katabhattakiccassa te manāpāni vatthāni nīharitvā dassāmī’’ti vatvā āsanaṃ paññāpetvā adāsi. Nisīdi sāmaṇero. Upāsikā muhutteneva yāgukhajjakaṃ sampādetvā adāsi. Tato ‘‘bhattaṃ sampādessāmī’’ti avidūre nisinnā taṇḍule dhovati. Tasmiṃ samaye sā yakkhinī ‘‘kahaṃ nu kho sāmaṇero? Kiñci bhikkhāhāraṃ labhati ",
      ", udāhu no’’ti? Āvajjamānā tassa vibbhamitukāmatāya nisinnabhāvaṃ ñatvā, ‘‘mā heva kho me devatānaṃ antare lajjaṃ uppādeyya, gacchāmissa ",
      " vibbhamane antarāyaṃ karomī’’ti āgantvā sarīre adhimuccitvā gīvaṃ parivattetvā bhūmiyaṃ pātesi. So akkhīhi viparivattehi kheḷena paggharantena bhūmiyaṃ vipphandati. Tena vuttaṃ ‘‘yakkhena gahito hotī’’ti."
    ],
    "innerText": "Atha kho sāmaṇero vuḍḍhimanvāya paripakkindriyo anabhiratipīḷito anabhiratiṃ vinodetuṃ asakkonto parūḷhakesanakho kiliṭṭhanivāsanapārupano kassaci anārocetvā pattacīvaramādāya ekakova mātu gharaṃ gato. Upāsikā puttaṃ disvā, vanditvā āha – ‘‘tāta, tvaṃ pubbe ācariyupajjhāyehi vā daharasāmaṇerehi vā saddhiṃ idhāgacchasi. Kasmā ekakova ajja āgato’’ti? So ukkaṇṭhitabhāvaṃ ārocesi. Saddhā upāsikā nānappakārena gharāvāse ādīnavaṃ dassetvā puttaṃ ovadamānāpi taṃ saññāpetuṃ asakkontī, ‘‘appeva nāma attano dhammatāyapi sallakkhessatī’’ti anuyojetvāva – ‘‘tiṭṭha, tāta, yāva te yāgubhattaṃ sampādemi, yāguṃ pivitvā katabhattakiccassa te manāpāni vatthāni nīharitvā dassāmī’’ti vatvā āsanaṃ paññāpetvā adāsi. Nisīdi sāmaṇero. Upāsikā muhutteneva yāgukhajjakaṃ sampādetvā adāsi. Tato ‘‘bhattaṃ sampādessāmī’’ti avidūre nisinnā taṇḍule dhovati. Tasmiṃ samaye sā yakkhinī ‘‘kahaṃ nu kho sāmaṇero? Kiñci bhikkhāhāraṃ labhati , udāhu no’’ti? Āvajjamānā tassa vibbhamitukāmatāya nisinnabhāvaṃ ñatvā, ‘‘mā heva kho me devatānaṃ antare lajjaṃ uppādeyya, gacchāmissa vibbhamane antarāyaṃ karomī’’ti āgantvā sarīre adhimuccitvā gīvaṃ parivattetvā bhūmiyaṃ pātesi. So akkhīhi viparivattehi kheḷena paggharantena bhūmiyaṃ vipphandati. Tena vuttaṃ ‘‘yakkhena gahito hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhāsī"
      },
      "ti upāsikā puttassa taṃ vippakāraṃ disvā vegena gantvā puttaṃ āliṅgetvā ūrūsu nipajjāpesi. Sakalagāmavāsino āgantvā balikammādīni karonti. Upāsikā paridevamānā imā gāthāyo abhāsi."
    ],
    "innerText": "Abhāsīti upāsikā puttassa taṃ vippakāraṃ disvā vegena gantvā puttaṃ āliṅgetvā ūrūsu nipajjāpesi. Sakalagāmavāsino āgantvā balikammādīni karonti. Upāsikā paridevamānā imā gāthāyo abhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṭihāriyapakkhañcā"
      },
      "ti manussā ‘‘aṭṭhamīuposathassa paccuggamanañca anuggamanañca karissāmā’’ti ",
      " sattamiyāpi navamiyāpi uposathaṅgāni samādiyanti, cātuddasīpannarasīnaṃ paccuggamanānuggamanaṃ karontā terasiyāpi pāṭipadepi samādiyanti, ‘‘vassāvāsassa anuggamanaṃ karissāmā’’ti dvinnaṃ pavāraṇānaṃ antare aḍḍhamāsaṃ nibaddhuposathikā bhavanti. Idaṃ sandhāya vuttaṃ ‘‘pāṭihāriyapakkhañcā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhaṅgasusamāgata"
      },
      "nti aṭṭhaṅgehi suṭṭhu samāgataṃ, sampayuttanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brahmacariya"
      },
      "nti seṭṭhacariyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na te hi yakkhā kīḷantī"
      },
      "ti na te gahetvā yakkhā kilamenti."
    ],
    "innerText": "Pāṭihāriyapakkhañcāti manussā ‘‘aṭṭhamīuposathassa paccuggamanañca anuggamanañca karissāmā’’ti sattamiyāpi navamiyāpi uposathaṅgāni samādiyanti, cātuddasīpannarasīnaṃ paccuggamanānuggamanaṃ karontā terasiyāpi pāṭipadepi samādiyanti, ‘‘vassāvāsassa anuggamanaṃ karissāmā’’ti dvinnaṃ pavāraṇānaṃ antare aḍḍhamāsaṃ nibaddhuposathikā bhavanti. Idaṃ sandhāya vuttaṃ ‘‘pāṭihāriyapakkhañcā’’ti. Aṭṭhaṅgasusamāgatanti aṭṭhaṅgehi suṭṭhu samāgataṃ, sampayuttanti attho. Brahmacariyanti seṭṭhacariyaṃ. Na te hi yakkhā kīḷantīti na te gahetvā yakkhā kilamenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cātuddasi"
      },
      "nti imāya gāthāya sāmaṇerassa kāye adhimuttā yakkhinī āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvi vā yadi vā raho"
      },
      "ti kassaci sammukhe vā parammukhe vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pamutyatthī"
      },
      "ti pamutti atthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppaccāpī"
      },
      "ti uppatitvāpi. Sacepi sakuṇo viya uppatitvā palāyasi, tathāpi te mokkho natthīti vadati. Evañca pana vatvā sāmaṇeraṃ muñci. Sāmaṇero akkhīni ummīlesi, mātā kese pakiriya assasantī passasantī rodati. So ‘‘amanussena gahitomhī’’ti na jānāti. Olokento pana ‘‘ahaṃ pubbe pīṭhe nisinno. Mātā me avidūre nisīditvā taṇḍule dhovati. Idāni panamhi bhūmiyaṃ ",
      " nisinno, mātāpi me assasantī passasantī rodati, sakalagāmavāsinopi sannipatitā. Kiṃ nu kho eta’’nti? Nipannakova ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mataṃ vā ammā"
      },
      "ti gāthamāha."
    ],
    "innerText": "Puna cātuddasinti imāya gāthāya sāmaṇerassa kāye adhimuttā yakkhinī āha. Āvi vā yadi vā rahoti kassaci sammukhe vā parammukhe vā. Pamutyatthīti pamutti atthi. Uppaccāpīti uppatitvāpi. Sacepi sakuṇo viya uppatitvā palāyasi, tathāpi te mokkho natthīti vadati. Evañca pana vatvā sāmaṇeraṃ muñci. Sāmaṇero akkhīni ummīlesi, mātā kese pakiriya assasantī passasantī rodati. So ‘‘amanussena gahitomhī’’ti na jānāti. Olokento pana ‘‘ahaṃ pubbe pīṭhe nisinno. Mātā me avidūre nisīditvā taṇḍule dhovati. Idāni panamhi bhūmiyaṃ nisinno, mātāpi me assasantī passasantī rodati, sakalagāmavāsinopi sannipatitā. Kiṃ nu kho eta’’nti? Nipannakova mataṃ vā ammāti gāthamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāme"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cajitvānā"
      },
      "ti duvidhepi kāme pahāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Punarāgacchate"
      },
      "ti vibbhamanavasena āgacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puna jīvaṃ mato hi so"
      },
      "ti uppabbajitvā puna jīvantopi so matakova, tasmā tampi rodantīti vadati."
    ],
    "innerText": "Kāmecajitvānāti duvidhepi kāme pahāya. Punarāgacchateti vibbhamanavasena āgacchati. Puna jīvaṃ mato hi soti uppabbajitvā puna jīvantopi so matakova, tasmā tampi rodantīti vadati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idānissa gharāvāse ādīnavaṃ dassentī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kukkuḷā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kukkuḷā"
      },
      "ti gharāvāso kira uṇhaṭṭhena kukkuḷā nāma hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kassa ujjhāpayāmase"
      },
      "ti – ‘‘abhidhāvatha, bhaddaṃ te hotū’’ti evaṃ vatvā – ‘‘yaṃ tvaṃ vibbhamitukāmo yakkhena pāpito, imaṃ vippakāraṃ kassa mayaṃ ujjhāpayāma nijjhāpayāma ārocayāmā’’ti vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puna ḍayhitumicchasī"
      },
      "tiādittagharato nīhaṭabhaṇḍaṃ viya gharā nīharitvā buddhasāsane pabbajito puna mahāḍāhasadise gharāvāse ḍayhituṃ icchasīti attho. So mātari kathentiyā kathentiyā sallakkhetvā hirottappaṃ paṭilabhitvā, ‘‘natthi mayhaṃ gihibhāvena attho’’ti āha. Athassa mātā ‘‘sādhu, tātā’’ti tuṭṭhā ",
      " paṇītabhojanaṃ bhojetvā, ‘‘kati vassosi, tātā’’ti pucchi. Paripuṇṇavassomhi upāsiketi. ‘‘Tena hi, tāta, upasampadaṃ karohī’’ti cīvarasāṭake adāsi. So ticīvaraṃ kārāpetvā upasampanno buddhavacanaṃ uggaṇhanto tepiṭako hutvā sīlādīnaṃ āgataṭṭhāne taṃ taṃ pūrento nacirasseva arahattaṃ patvā mahādhammakathiko hutvā vīsavassasataṃ ṭhatvā sakalajambudīpaṃ khobhetvā parinibbāyi. Pañcamaṃ."
    ],
    "innerText": "Idānissa gharāvāse ādīnavaṃ dassentī kukkuḷātiādimāha. Tattha kukkuḷāti gharāvāso kira uṇhaṭṭhena kukkuḷā nāma hoti. Kassa ujjhāpayāmaseti – ‘‘abhidhāvatha, bhaddaṃ te hotū’’ti evaṃ vatvā – ‘‘yaṃ tvaṃ vibbhamitukāmo yakkhena pāpito, imaṃ vippakāraṃ kassa mayaṃ ujjhāpayāma nijjhāpayāma ārocayāmā’’ti vadati. Puna ḍayhitumicchasītiādittagharato nīhaṭabhaṇḍaṃ viya gharā nīharitvā buddhasāsane pabbajito puna mahāḍāhasadise gharāvāse ḍayhituṃ icchasīti attho. So mātari kathentiyā kathentiyā sallakkhetvā hirottappaṃ paṭilabhitvā, ‘‘natthi mayhaṃ gihibhāvena attho’’ti āha. Athassa mātā ‘‘sādhu, tātā’’ti tuṭṭhā paṇītabhojanaṃ bhojetvā, ‘‘kati vassosi, tātā’’ti pucchi. Paripuṇṇavassomhi upāsiketi. ‘‘Tena hi, tāta, upasampadaṃ karohī’’ti cīvarasāṭake adāsi. So ticīvaraṃ kārāpetvā upasampanno buddhavacanaṃ uggaṇhanto tepiṭako hutvā sīlādīnaṃ āgataṭṭhāne taṃ taṃ pūrento nacirasseva arahattaṃ patvā mahādhammakathiko hutvā vīsavassasataṃ ṭhatvā sakalajambudīpaṃ khobhetvā parinibbāyi. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Piyaṅkarasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "240"
      },
      ". Chaṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jetavane"
      },
      "ti jetavanassa paccante kosambakakuṭi nāma atthi, tattha viharati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammapadānī"
      },
      "ti idha pāṭiyekkaṃ saṅgahaṃ āruḷhā chabbīsativaggā tanti adhippetā ",
      ". Tatra thero tasmiṃ samaye antovihāre nisinno madhurassarena sarabhaññaṃ katvā appamādavaggaṃ bhāsati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ tosesī"
      },
      "ti sā kira puttaṃ piyaṅkaraṃ aṅkenādāya jetavanassa pacchimabhāgato paṭṭhāya gocaraṃ pariyesantī anupubbena nagarābhimukhī hutvā uccārapassāvakheḷasiṅghāṇikadubbhojanāni pariyesamānā therassa vasanaṭṭhānaṃ patvā madhurassaraṃ assosi. Tassā so saddo chaviādīni chetvā ",
      " aṭṭhimiñjaṃ āhacca hadayaṅgamanīyo hutvā aṭṭhāsi. Athassā gocarapariyesane cittampi na uppajji, ohitasotā dhammameva suṇantī ṭhitā. Yakkhadārakassa pana daharatāya dhammassavane cittaṃ natthi. So jighacchāya pīḷitattā, ‘‘kasmā ammā gatagataṭṭhāne khāṇuko viya tiṭṭhasi? Na mayhaṃ khādanīyaṃ vā bhojanīyaṃ vā pariyesasī’’ti punappunaṃ mātaraṃ codeti. Sā ‘‘dhammassavanassa me antarāyaṃ karotī’’ti puttakaṃ ‘‘mā saddaṃ kari, piyaṅkarā’’ti evaṃ tosesi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mā saddaṃ karī"
      },
      "ti saddaṃ mā kari."
    ],
    "innerText": "240. Chaṭṭhe jetavaneti jetavanassa paccante kosambakakuṭi nāma atthi, tattha viharati. Dhammapadānīti idha pāṭiyekkaṃ saṅgahaṃ āruḷhā chabbīsativaggā tanti adhippetā . Tatra thero tasmiṃ samaye antovihāre nisinno madhurassarena sarabhaññaṃ katvā appamādavaggaṃ bhāsati. Evaṃ tosesīti sā kira puttaṃ piyaṅkaraṃ aṅkenādāya jetavanassa pacchimabhāgato paṭṭhāya gocaraṃ pariyesantī anupubbena nagarābhimukhī hutvā uccārapassāvakheḷasiṅghāṇikadubbhojanāni pariyesamānā therassa vasanaṭṭhānaṃ patvā madhurassaraṃ assosi. Tassā so saddo chaviādīni chetvā aṭṭhimiñjaṃ āhacca hadayaṅgamanīyo hutvā aṭṭhāsi. Athassā gocarapariyesane cittampi na uppajji, ohitasotā dhammameva suṇantī ṭhitā. Yakkhadārakassa pana daharatāya dhammassavane cittaṃ natthi. So jighacchāya pīḷitattā, ‘‘kasmā ammā gatagataṭṭhāne khāṇuko viya tiṭṭhasi? Na mayhaṃ khādanīyaṃ vā bhojanīyaṃ vā pariyesasī’’ti punappunaṃ mātaraṃ codeti. Sā ‘‘dhammassavanassa me antarāyaṃ karotī’’ti puttakaṃ ‘‘mā saddaṃ kari, piyaṅkarā’’ti evaṃ tosesi. Tattha mā saddaṃ karīti saddaṃ mā kari."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṇesu cā"
      },
      "ti gāthāya sā attano dhammatāya samādiṇṇaṃ pañcasīlaṃ dasseti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃyamāmase"
      },
      "ti saṃyamāma saṃyatā homa. Iminā pāṇātipātā virati gahitā, dutiyapadena musāvādā virati, tatiyapadena sesā tisso viratiyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Api muccema pisācayoniyā"
      },
      "ti api nāma yakkhaloke uppannāni pañca verāni pahāya, yoniso paṭipajjitvā imāya chātakadubbhikkhāya pisācayakkhayoniyā muccema, tātāti vadati. Chaṭṭhaṃ."
    ],
    "innerText": "Pāṇesu cāti gāthāya sā attano dhammatāya samādiṇṇaṃ pañcasīlaṃ dasseti. Tattha saṃyamāmaseti saṃyamāma saṃyatā homa. Iminā pāṇātipātā virati gahitā, dutiyapadena musāvādā virati, tatiyapadena sesā tisso viratiyo. Api muccema pisācayoniyāti api nāma yakkhaloke uppannāni pañca verāni pahāya, yoniso paṭipajjitvā imāya chātakadubbhikkhāya pisācayakkhayoniyā muccema, tātāti vadati. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Punabbasusuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "241"
      },
      ". Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tena kho pana samayenā"
      },
      "ti katarasamayena? Sūriyassa atthaṅgamanasamayena. Tadā kira bhagavā pacchābhatte mahājanassa dhammaṃ desetvā mahājanaṃ uyyojetvā nhānakoṭṭhake nhatvā gandhakuṭipariveṇe paññattavarabuddhāsane puratthimalokadhātuṃ olokayamāno nisīdi. Athekacārikadvicārikādayo paṃsukūlikapiṇḍapātikabhikkhū attano ",
      " attano vasanaṭṭhānehi nikkhamitvā āgamma dasabalaṃ vanditvā rattasāṇiyā parikkhipamānā viya nisīdiṃsu. Atha nesaṃ ajjhāsayaṃ viditvā satthā nibbānapaṭisaṃyuttaṃ dhammakathaṃ kathesi."
    ],
    "innerText": "241. Sattame tena kho pana samayenāti katarasamayena? Sūriyassa atthaṅgamanasamayena. Tadā kira bhagavā pacchābhatte mahājanassa dhammaṃ desetvā mahājanaṃ uyyojetvā nhānakoṭṭhake nhatvā gandhakuṭipariveṇe paññattavarabuddhāsane puratthimalokadhātuṃ olokayamāno nisīdi. Athekacārikadvicārikādayo paṃsukūlikapiṇḍapātikabhikkhū attano attano vasanaṭṭhānehi nikkhamitvā āgamma dasabalaṃ vanditvā rattasāṇiyā parikkhipamānā viya nisīdiṃsu. Atha nesaṃ ajjhāsayaṃ viditvā satthā nibbānapaṭisaṃyuttaṃ dhammakathaṃ kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ tosesī"
      },
      "ti sā kira dhītaraṃ aṅkenādāya puttaṃ aṅguliyā gahetvā jetavanapiṭṭhiyaṃ pākāraparikkhepasamīpe uccārapassāvakheḷasiṅghāṇikaṃ pariyesamānā anupubbena jetavanadvārakoṭṭhakaṃ sampattā. Bhagavato ca, ‘‘ānanda, pattaṃ āhara, cīvaraṃ āhara, vighāsādānaṃ dānaṃ dehī’’ti kathentassa saddo samantā dvādasahatthamattameva gaṇhāti. Dhammaṃ desentassa ",
      " sacepi cakkavāḷapariyantaṃ katvā parisā nisīdati, yathā parisaṃ gacchati, bahiparisāya ekaṅgulimattampi na niggacchati, ‘‘mā akāraṇā madhurasaddo nassī’’ti. Tatrāyaṃ yakkhinī bahiparisāya ṭhitā saddaṃ na suṇāti, dvārakoṭṭhake ṭhitāya panassā mahatiyā buddhavīthiyā abhimukhe ṭhitā gandhakuṭi paññāyi. Sā nivāte dīpasikhā viya buddhagāravena hatthakukkuccādirahitaṃ niccalaṃ parisaṃ disvā – ‘‘nūna mettha kiñci bhājanīyabhaṇḍaṃ bhavissati, yato ahaṃ sappitelamadhuphāṇitādīsu kiñcideva pattato vā hatthato vā paggharantaṃ bhūmiyaṃ vā pana patitaṃ labhissāmī’’ti antovihāraṃ pāvisi. Dvārakoṭṭhake avaruddhakānaṃ nivāraṇatthāya ṭhitā ārakkhadevatā yakkhiniyā upanissayaṃ disvā na nivāresi. Tassā saha parisāya ekībhāvagamanena madhurassaro chaviādīni chinditvā aṭṭhimiñjaṃ āhacca aṭṭhāsi. Taṃ dhammassavanatthāya niccalaṃ ṭhitaṃ purimanayeneva puttakā codayiṃsu. Sā ‘‘dhammassavanassa me antarāyaṃ karontī’’ti puttake ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tuṇhī uttarike hohī"
      },
      "ti evaṃ tosesi."
    ],
    "innerText": "Evaṃ tosesīti sā kira dhītaraṃ aṅkenādāya puttaṃ aṅguliyā gahetvā jetavanapiṭṭhiyaṃ pākāraparikkhepasamīpe uccārapassāvakheḷasiṅghāṇikaṃ pariyesamānā anupubbena jetavanadvārakoṭṭhakaṃ sampattā. Bhagavato ca, ‘‘ānanda, pattaṃ āhara, cīvaraṃ āhara, vighāsādānaṃ dānaṃ dehī’’ti kathentassa saddo samantā dvādasahatthamattameva gaṇhāti. Dhammaṃ desentassa sacepi cakkavāḷapariyantaṃ katvā parisā nisīdati, yathā parisaṃ gacchati, bahiparisāya ekaṅgulimattampi na niggacchati, ‘‘mā akāraṇā madhurasaddo nassī’’ti. Tatrāyaṃ yakkhinī bahiparisāya ṭhitā saddaṃ na suṇāti, dvārakoṭṭhake ṭhitāya panassā mahatiyā buddhavīthiyā abhimukhe ṭhitā gandhakuṭi paññāyi. Sā nivāte dīpasikhā viya buddhagāravena hatthakukkuccādirahitaṃ niccalaṃ parisaṃ disvā – ‘‘nūna mettha kiñci bhājanīyabhaṇḍaṃ bhavissati, yato ahaṃ sappitelamadhuphāṇitādīsu kiñcideva pattato vā hatthato vā paggharantaṃ bhūmiyaṃ vā pana patitaṃ labhissāmī’’ti antovihāraṃ pāvisi. Dvārakoṭṭhake avaruddhakānaṃ nivāraṇatthāya ṭhitā ārakkhadevatā yakkhiniyā upanissayaṃ disvā na nivāresi. Tassā saha parisāya ekībhāvagamanena madhurassaro chaviādīni chinditvā aṭṭhimiñjaṃ āhacca aṭṭhāsi. Taṃ dhammassavanatthāya niccalaṃ ṭhitaṃ purimanayeneva puttakā codayiṃsu. Sā ‘‘dhammassavanassa me antarāyaṃ karontī’’ti puttake tuṇhī uttarike hohīti evaṃ tosesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yāvā"
      },
      "ti yāva dhammaṃ suṇāmi, tāva tuṇhī hohīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaganthappamocana"
      },
      "nti nibbānaṃ āgamma sabbe ganthā pamuccanti, tasmā taṃ sabbaganthappamocananti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ativelā"
      },
      "ti velātikkantā pamāṇātikkantā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piyāyanā"
      },
      "ti magganā patthanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato piyatara"
      },
      "nti yā ",
      " ayaṃ assa dhammassa magganā patthanā, idaṃ mayhaṃ tato piyataranti attho. Piyatarāti vā pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṇina"
      },
      "nti yathā ",
      " pāṇīnaṃ dukkhā moceti. Ke mocetīti? Pāṇineti āharitvā vattabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ dhammaṃ abhisambuddha"
      },
      "nti, yaṃ dhammaṃ bhagavā abhisambuddho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tuṇhībhūtāyamuttarā"
      },
      "ti na kevalaṃ ahameva, ayaṃ me bhaginī uttarāpi tuṇhībhūtāti vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhammassa anaññāyā"
      },
      "ti, amma, mayaṃ pubbepi imaṃ saddhammameva ajānitvā idāni idaṃ khuppipāsādidukkhaṃ anubhavantā dukkhaṃ carāma viharāma."
    ],
    "innerText": "Tattha yāvāti yāva dhammaṃ suṇāmi, tāva tuṇhī hohīti attho. Sabbaganthappamocananti nibbānaṃ āgamma sabbe ganthā pamuccanti, tasmā taṃ sabbaganthappamocananti vuccati. Ativelāti velātikkantā pamāṇātikkantā. Piyāyanāti magganā patthanā. Tato piyataranti yā ayaṃ assa dhammassa magganā patthanā, idaṃ mayhaṃ tato piyataranti attho. Piyatarāti vā pāṭho. Pāṇinanti yathā pāṇīnaṃ dukkhā moceti. Ke mocetīti? Pāṇineti āharitvā vattabbaṃ. Yaṃ dhammaṃ abhisambuddhanti, yaṃ dhammaṃ bhagavā abhisambuddho. Tuṇhībhūtāyamuttarāti na kevalaṃ ahameva, ayaṃ me bhaginī uttarāpi tuṇhībhūtāti vadati. Saddhammassa anaññāyāti, amma, mayaṃ pubbepi imaṃ saddhammameva ajānitvā idāni idaṃ khuppipāsādidukkhaṃ anubhavantā dukkhaṃ carāma viharāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhumā"
      },
      "ti pañcahi cakkhūhi cakkhumā. Dhammaṃ desentoyeva bhagavā parisaṃ sallakkhayamāno tassā yakkhiniyā ceva yakkhadārakassa ca sotāpattiphalassa upanissayaṃ disvā desanaṃ vinivaṭṭetvā catusaccakathaṃ dīpeti, taṃ sutvā tasmiṃyeva dese ṭhitā yakkhinī saddhiṃ puttena ",
      " sotāpattiphale patiṭṭhitā. Dhītuyāpi panassā upanissayo atthi, atidaharattā pana desanaṃ sampaṭicchituṃ nāsakkhi."
    ],
    "innerText": "Cakkhumāti pañcahi cakkhūhi cakkhumā. Dhammaṃ desentoyeva bhagavā parisaṃ sallakkhayamāno tassā yakkhiniyā ceva yakkhadārakassa ca sotāpattiphalassa upanissayaṃ disvā desanaṃ vinivaṭṭetvā catusaccakathaṃ dīpeti, taṃ sutvā tasmiṃyeva dese ṭhitā yakkhinī saddhiṃ puttena sotāpattiphale patiṭṭhitā. Dhītuyāpi panassā upanissayo atthi, atidaharattā pana desanaṃ sampaṭicchituṃ nāsakkhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni sā yakkhinī puttassa anumodanaṃ karontī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sādhu kho paṇḍito nāmā"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjāhamhi samuggatā"
      },
      "ti ahamhi ajja vaṭṭato uggatā samuggatā sāsane vā uggatā samuggatā, tvampi sukhī hohīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhānī"
      },
      "ti mayā ca tayā ca diṭṭhāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttarāpi suṇātu me"
      },
      "ti, ‘‘amhākaṃ catusaccapaṭivedhabhāvaṃ, dhītā me uttarāpi, suṇātū’’ti vadati. Saha saccapaṭivedheneva sāpi sūcilomo viya sabbaṃ setakaṇḍukacchuādibhāvaṃ pahāya dibbasampattiṃ paṭilabhati saddhiṃ puttena. Dhītā panassā yathā nāma loke mātāpitūhi issariye laddhe puttānampi taṃ hoti, evaṃ mātu-ānubhāveneva sampattiṃ labhi. Tato paṭṭhāya ca sā saddhiṃ puttakehi gandhakuṭisamīparukkheyeva nivāsarukkhaṃ labhitvā sāyaṃ pātaṃ buddhadassanaṃ labhamānā dhammaṃ suṇamānā dīgharattaṃ tattheva vasi. Sattamaṃ."
    ],
    "innerText": "Idāni sā yakkhinī puttassa anumodanaṃ karontī sādhu kho paṇḍito nāmātiādimāha. Ajjāhamhi samuggatāti ahamhi ajja vaṭṭato uggatā samuggatā sāsane vā uggatā samuggatā, tvampi sukhī hohīti. Diṭṭhānīti mayā ca tayā ca diṭṭhāni. Uttarāpi suṇātu meti, ‘‘amhākaṃ catusaccapaṭivedhabhāvaṃ, dhītā me uttarāpi, suṇātū’’ti vadati. Saha saccapaṭivedheneva sāpi sūcilomo viya sabbaṃ setakaṇḍukacchuādibhāvaṃ pahāya dibbasampattiṃ paṭilabhati saddhiṃ puttena. Dhītā panassā yathā nāma loke mātāpitūhi issariye laddhe puttānampi taṃ hoti, evaṃ mātu-ānubhāveneva sampattiṃ labhi. Tato paṭṭhāya ca sā saddhiṃ puttakehi gandhakuṭisamīparukkheyeva nivāsarukkhaṃ labhitvā sāyaṃ pātaṃ buddhadassanaṃ labhamānā dhammaṃ suṇamānā dīgharattaṃ tattheva vasi. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Sudattasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "242"
      },
      ". Aṭṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kenacideva karaṇīyenā"
      },
      "ti vāṇijjakammaṃ adhippetaṃ. Anāthapiṇḍiko ca rājagahaseṭṭhi ca aññamaññaṃ bhaginipatikā honti. Yadā rājagahe uṭṭhānakabhaṇḍakaṃ mahagghaṃ hoti, tadā rājagahaseṭṭhi taṃ gahetvā ",
      " pañcasakaṭasatehi sāvatthiṃ gantvā yojanamatte ṭhito attano ",
      " āgatabhāvaṃ jānāpeti. Anāthapiṇḍiko paccuggantvā tassa mahāsakkāraṃ katvā ekayānaṃ āropetvā sāvatthiṃ pavisati. So sace bhaṇḍaṃ lahukaṃ vikkīyati, vikkiṇāti. No ce, bhaginighare ṭhapetvā pakkamati. Anāthapiṇḍikopi tatheva karoti. Svāyaṃ tadāpi teneva karaṇīyena agamāsi. Taṃ sandhāyetaṃ vuttaṃ."
    ],
    "innerText": "242. Aṭṭhame kenacideva karaṇīyenāti vāṇijjakammaṃ adhippetaṃ. Anāthapiṇḍiko ca rājagahaseṭṭhi ca aññamaññaṃ bhaginipatikā honti. Yadā rājagahe uṭṭhānakabhaṇḍakaṃ mahagghaṃ hoti, tadā rājagahaseṭṭhi taṃ gahetvā pañcasakaṭasatehi sāvatthiṃ gantvā yojanamatte ṭhito attano āgatabhāvaṃ jānāpeti. Anāthapiṇḍiko paccuggantvā tassa mahāsakkāraṃ katvā ekayānaṃ āropetvā sāvatthiṃ pavisati. So sace bhaṇḍaṃ lahukaṃ vikkīyati, vikkiṇāti. No ce, bhaginighare ṭhapetvā pakkamati. Anāthapiṇḍikopi tatheva karoti. Svāyaṃ tadāpi teneva karaṇīyena agamāsi. Taṃ sandhāyetaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Taṃ divasaṃ pana rājagahaseṭṭhi yojanamatte ṭhitena anāthapiṇḍikena āgatabhāvajānanatthaṃ pesitaṃ paṇṇaṃ na suṇi, dhammassavanatthāya vihāraṃ agamāsi. So dhammakathaṃ sutvā svātanāya buddhappamukhaṃ bhikkhusaṅghaṃ nimantetvā attano ghare uddhanakhaṇāpanadāruphālanādīni kāresi. Anāthapiṇḍikopi ‘‘idāni mayhaṃ paccuggamanaṃ karissati, idāni karissatī’’ti gharadvārepi paccuggamanaṃ alabhitvā ",
      " antogharaṃ paviṭṭho paṭisanthārampi na bahuṃ alattha. ‘‘Kiṃ, mahāseṭṭhi, kusalaṃ dārakarūpānaṃ? Nasi magge kilanto’’ti? Ettakova paṭisanthāro ahosi. So tassa mahābyāpāraṃ disvā, ‘‘kiṃ nu te, gahapati, āvāho vā bhavissatī’’ti? Khandhake (cūḷava. 304) āgatanayeneva kathaṃ pavattetvā tassa mukhato buddhasaddaṃ sutvā pañcavaṇṇaṃ pītiṃ paṭilabhi. Sā tassa sīsena uṭṭhāya yāva pādapiṭṭhiyā, pādapiṭṭhiyā uṭṭhāya yāva sīsā gacchati, ubhato uṭṭhāya majjhe osarati, majjhe uṭṭhāya ubhato gacchati. So pītiyā nirantaraṃ phuṭṭho, ‘‘buddhoti tvaṃ, gahapati, vadesi? Buddho tāhaṃ, gahapati, vadāmī’’ti evaṃ tikkhattuṃ pucchitvā, ‘‘ghosopi kho eso dullabho lokasmiṃ yadidaṃ buddho’’ti āha. Idaṃ sandhāya vuttaṃ ‘‘assosi kho anāthapiṇḍiko, gahapati, buddho kira loke uppanno’’ti."
    ],
    "innerText": "Taṃ divasaṃ pana rājagahaseṭṭhi yojanamatte ṭhitena anāthapiṇḍikena āgatabhāvajānanatthaṃ pesitaṃ paṇṇaṃ na suṇi, dhammassavanatthāya vihāraṃ agamāsi. So dhammakathaṃ sutvā svātanāya buddhappamukhaṃ bhikkhusaṅghaṃ nimantetvā attano ghare uddhanakhaṇāpanadāruphālanādīni kāresi. Anāthapiṇḍikopi ‘‘idāni mayhaṃ paccuggamanaṃ karissati, idāni karissatī’’ti gharadvārepi paccuggamanaṃ alabhitvā antogharaṃ paviṭṭho paṭisanthārampi na bahuṃ alattha. ‘‘Kiṃ, mahāseṭṭhi, kusalaṃ dārakarūpānaṃ? Nasi magge kilanto’’ti? Ettakova paṭisanthāro ahosi. So tassa mahābyāpāraṃ disvā, ‘‘kiṃ nu te, gahapati, āvāho vā bhavissatī’’ti? Khandhake (cūḷava. 304) āgatanayeneva kathaṃ pavattetvā tassa mukhato buddhasaddaṃ sutvā pañcavaṇṇaṃ pītiṃ paṭilabhi. Sā tassa sīsena uṭṭhāya yāva pādapiṭṭhiyā, pādapiṭṭhiyā uṭṭhāya yāva sīsā gacchati, ubhato uṭṭhāya majjhe osarati, majjhe uṭṭhāya ubhato gacchati. So pītiyā nirantaraṃ phuṭṭho, ‘‘buddhoti tvaṃ, gahapati, vadesi? Buddho tāhaṃ, gahapati, vadāmī’’ti evaṃ tikkhattuṃ pucchitvā, ‘‘ghosopi kho eso dullabho lokasmiṃ yadidaṃ buddho’’ti āha. Idaṃ sandhāya vuttaṃ ‘‘assosi kho anāthapiṇḍiko, gahapati, buddho kira loke uppanno’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etadahosi akālo kho ajjā"
      },
      "ti so kira taṃ seṭṭhiṃ pucchi, ‘‘kuhiṃ gahapati satthā viharatī’’ti? Athassa so – ‘‘buddhā ",
      " nāma durāsadā āsīvisasadisā honti, satthā sivathikāya vasati, na sakkā tattha tumhādisehi imāya velāya gantu’’nti ācikkhi. Athassa etadahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddhagatāya satiyā nipajjī"
      },
      "ti taṃdivasaṃ kirassa bhaṇḍasakaṭesu vā upaṭṭhākesu vā cittampi na uppajji, sāyamāsampi na akāsi, sattabhūmikaṃ pana pāsādaṃ āruyha supaññattālaṅkatavarasayane ‘‘buddho buddho’’ti sajjhāyaṃ karontova nipajjitvā niddaṃ okkami. Tena vuttaṃ ‘‘buddhagatāya satiyā nipajjī’’ti."
    ],
    "innerText": "Etadahosi akālo kho ajjāti so kira taṃ seṭṭhiṃ pucchi, ‘‘kuhiṃ gahapati satthā viharatī’’ti? Athassa so – ‘‘buddhā nāma durāsadā āsīvisasadisā honti, satthā sivathikāya vasati, na sakkā tattha tumhādisehi imāya velāya gantu’’nti ācikkhi. Athassa etadahosi. Buddhagatāya satiyā nipajjīti taṃdivasaṃ kirassa bhaṇḍasakaṭesu vā upaṭṭhākesu vā cittampi na uppajji, sāyamāsampi na akāsi, sattabhūmikaṃ pana pāsādaṃ āruyha supaññattālaṅkatavarasayane ‘‘buddho buddho’’ti sajjhāyaṃ karontova nipajjitvā niddaṃ okkami. Tena vuttaṃ ‘‘buddhagatāya satiyā nipajjī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rattiyā sudaṃ tikkhattuṃ uṭṭhāsi pabhātanti maññamāno"
      },
      "ti paṭhamayāme tāva vītivatte uṭṭhāya buddhaṃ ",
      " anussari, athassa balavappasādo udapādi, pītiāloko ahosi, sabbatamaṃ vigacchi, dīpasahassujjalaṃ viya canduṭṭhānaṃ sūriyuṭṭhānaṃ viya ca jātaṃ. So ‘‘papādaṃ āpanno vatamhi, sūriyo uggato’’ti uṭṭhāya ākāsatale ṭhitaṃ candaṃ ulloketvā ‘‘ekova yāmo gato, aññe dve atthī’’ti puna pavisitvā nipajji. Etenupāyena majjhimayāmāvasānepi pacchimayāmāvasānepīti tikkhattuṃ uṭṭhāsi. Pacchimayāmāvasāne pana balavapaccūseyeva uṭṭhāya ākāsatalaṃ āgantvā ",
      " mahādvārābhimukhova ahosi, sattabhūmikadvāraṃ sayameva vivaṭaṃ ahosi. So pāsādā oruyha antaravīthiṃ paṭipajji."
    ],
    "innerText": "Rattiyā sudaṃ tikkhattuṃ uṭṭhāsi pabhātanti maññamānoti paṭhamayāme tāva vītivatte uṭṭhāya buddhaṃ anussari, athassa balavappasādo udapādi, pītiāloko ahosi, sabbatamaṃ vigacchi, dīpasahassujjalaṃ viya canduṭṭhānaṃ sūriyuṭṭhānaṃ viya ca jātaṃ. So ‘‘papādaṃ āpanno vatamhi, sūriyo uggato’’ti uṭṭhāya ākāsatale ṭhitaṃ candaṃ ulloketvā ‘‘ekova yāmo gato, aññe dve atthī’’ti puna pavisitvā nipajji. Etenupāyena majjhimayāmāvasānepi pacchimayāmāvasānepīti tikkhattuṃ uṭṭhāsi. Pacchimayāmāvasāne pana balavapaccūseyeva uṭṭhāya ākāsatalaṃ āgantvā mahādvārābhimukhova ahosi, sattabhūmikadvāraṃ sayameva vivaṭaṃ ahosi. So pāsādā oruyha antaravīthiṃ paṭipajji."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivariṃsū"
      },
      "ti ‘‘ayaṃ mahāseṭṭhi ‘buddhupaṭṭhānaṃ gamissāmī’ti nikkhanto, paṭhamadassaneneva sotāpattiphale patiṭṭhāya tiṇṇaṃ ratanānaṃ aggupaṭṭhāko hutvā asadisaṃ saṅghārāmaṃ katvā cātuddisassa ariyagaṇassa anāvaṭadvāro bhavissati, na yuttamassa dvāraṃ pidahitu’’nti cintetvā vivariṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antaradhāyī"
      },
      "ti rājagahaṃ kira ākiṇṇamanussaṃ antonagare nava koṭiyo, bahinagare navāti taṃ upanissāya aṭṭhārasa manussakoṭiyo vasanti. Avelāya matamanusse bahi nīharituṃ asakkontā aṭṭālake ṭhatvā bahidvāre khipanti. Mahāseṭṭhi nagarato bahinikkhantamattova allasarīraṃ pādena akkami, aparampi piṭṭhipādena pahari. Makkhikā uppatitvā parikiriṃsu. Duggandho nāsapuṭaṃ abhihani. Buddhappasādo tanuttaṃ gato. Tenassa ",
      " āloko antaradhāyi, andhakāro pāturahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddamanussāvesī"
      },
      "ti ‘‘seṭṭhissa ussāhaṃ janessāmī’’ti suvaṇṇakiṅkiṇikaṃ ghaṭṭento viya madhurassarena saddaṃ anussāvesi."
    ],
    "innerText": "Vivariṃsūti ‘‘ayaṃ mahāseṭṭhi ‘buddhupaṭṭhānaṃ gamissāmī’ti nikkhanto, paṭhamadassaneneva sotāpattiphale patiṭṭhāya tiṇṇaṃ ratanānaṃ aggupaṭṭhāko hutvā asadisaṃ saṅghārāmaṃ katvā cātuddisassa ariyagaṇassa anāvaṭadvāro bhavissati, na yuttamassa dvāraṃ pidahitu’’nti cintetvā vivariṃsu. Antaradhāyīti rājagahaṃ kira ākiṇṇamanussaṃ antonagare nava koṭiyo, bahinagare navāti taṃ upanissāya aṭṭhārasa manussakoṭiyo vasanti. Avelāya matamanusse bahi nīharituṃ asakkontā aṭṭālake ṭhatvā bahidvāre khipanti. Mahāseṭṭhi nagarato bahinikkhantamattova allasarīraṃ pādena akkami, aparampi piṭṭhipādena pahari. Makkhikā uppatitvā parikiriṃsu. Duggandho nāsapuṭaṃ abhihani. Buddhappasādo tanuttaṃ gato. Tenassa āloko antaradhāyi, andhakāro pāturahosi. Saddamanussāvesīti ‘‘seṭṭhissa ussāhaṃ janessāmī’’ti suvaṇṇakiṅkiṇikaṃ ghaṭṭento viya madhurassarena saddaṃ anussāvesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sataṃ kaññāsahassānī"
      },
      "ti purimapadānipi imināva sahassapadena saddhiṃ sambandhanīyāni. Yatheva hi sataṃ kaññāsahassāni, sataṃ sahassāni hatthī, sataṃ sahassāni assā, sataṃ sahassāni rathāti ayamettha attho. Iti ekekasatasahassameva dīpitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padavītihārassā"
      },
      "ti padavītihāro nāma samagamane dvinnaṃ padānaṃ antare muṭṭhiratanamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kalaṃ nāgghanti soḷasi"
      },
      "nti taṃ ekaṃ padavītihāraṃ soḷasabhāge katvā tato eko koṭṭhāso puna soḷasadhā, tato eko soḷasadhāti evaṃ soḷasa vāre soḷasadhā bhinnassa eko koṭṭhāso soḷasikalā nāma, taṃ soḷasikalaṃ etāni cattāri satasahassāni na agghanti. Idaṃ vuttaṃ hoti – sataṃ hatthisahassāni sataṃ assasahassāni sataṃ rathasahassāni sataṃ kaññāsahassāni, tā ca kho āmukkamaṇikuṇḍalā sakalajambudīparājadhītaro vāti imasmā ettakā lābhā vihāraṃ gacchantassa ",
      " tasmiṃ soḷasikalasaṅkhāte padese pavattacetanāva uttaritarāti. Idaṃ pana vihāragamanaṃ kassa vasena gahitanti? Vihāraṃ gantvā anantarāyena sotāpattiphale patiṭṭhahantassa. ‘‘Gandhamālādīhi pūjaṃ karissāmi ",
      ", cetiyaṃ vandissāmi, dhammaṃ sossāmi, dīpapūjaṃ karissāmi, saṅghaṃ nimantetvā dānaṃ dassāmi, sikkhāpadesu vā saraṇesu vā patiṭṭhahissāmī’’ti gacchatopi vasena vaṭṭatiyeva."
    ],
    "innerText": "Sataṃ kaññāsahassānīti purimapadānipi imināva sahassapadena saddhiṃ sambandhanīyāni. Yatheva hi sataṃ kaññāsahassāni, sataṃ sahassāni hatthī, sataṃ sahassāni assā, sataṃ sahassāni rathāti ayamettha attho. Iti ekekasatasahassameva dīpitaṃ. Padavītihārassāti padavītihāro nāma samagamane dvinnaṃ padānaṃ antare muṭṭhiratanamattaṃ. Kalaṃ nāgghanti soḷasinti taṃ ekaṃ padavītihāraṃ soḷasabhāge katvā tato eko koṭṭhāso puna soḷasadhā, tato eko soḷasadhāti evaṃ soḷasa vāre soḷasadhā bhinnassa eko koṭṭhāso soḷasikalā nāma, taṃ soḷasikalaṃ etāni cattāri satasahassāni na agghanti. Idaṃ vuttaṃ hoti – sataṃ hatthisahassāni sataṃ assasahassāni sataṃ rathasahassāni sataṃ kaññāsahassāni, tā ca kho āmukkamaṇikuṇḍalā sakalajambudīparājadhītaro vāti imasmā ettakā lābhā vihāraṃ gacchantassa tasmiṃ soḷasikalasaṅkhāte padese pavattacetanāva uttaritarāti. Idaṃ pana vihāragamanaṃ kassa vasena gahitanti? Vihāraṃ gantvā anantarāyena sotāpattiphale patiṭṭhahantassa. ‘‘Gandhamālādīhi pūjaṃ karissāmi , cetiyaṃ vandissāmi, dhammaṃ sossāmi, dīpapūjaṃ karissāmi, saṅghaṃ nimantetvā dānaṃ dassāmi, sikkhāpadesu vā saraṇesu vā patiṭṭhahissāmī’’ti gacchatopi vasena vaṭṭatiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Andhakāro antaradhāyī"
      },
      "ti so kira cintesi – ‘‘ahaṃ ekakoti saññaṃ karomi, anuyuttāpi me atthi, kasmā bhāyāmī’’ti sūro ahosi. Athassa balavā buddhappasādo udapādi. Tasmā andhakāro antaradhāyīti. Sesavāresupi eseva nayo. Apica purato purato gacchanto bhiṃsanake susānamagge aṭṭhikasaṅkhalikasamaṃsalohitantiādīni anekavidhāni kuṇapāni addasa ",
      ". Soṇasiṅgālādīnaṃ saddaṃ assosi. Taṃ sabbaṃ parissayaṃ punappunaṃ buddhagataṃ pasādaṃ vaḍḍhetvā maddanto agamāsiyeva."
    ],
    "innerText": "Andhakāro antaradhāyīti so kira cintesi – ‘‘ahaṃ ekakoti saññaṃ karomi, anuyuttāpi me atthi, kasmā bhāyāmī’’ti sūro ahosi. Athassa balavā buddhappasādo udapādi. Tasmā andhakāro antaradhāyīti. Sesavāresupi eseva nayo. Apica purato purato gacchanto bhiṃsanake susānamagge aṭṭhikasaṅkhalikasamaṃsalohitantiādīni anekavidhāni kuṇapāni addasa . Soṇasiṅgālādīnaṃ saddaṃ assosi. Taṃ sabbaṃ parissayaṃ punappunaṃ buddhagataṃ pasādaṃ vaḍḍhetvā maddanto agamāsiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ehi sudattā"
      },
      "ti so kira seṭṭhi gacchamānova cintesi – ‘‘imasmiṃ loke bahū pūraṇakassapādayo titthiyā ‘mayaṃ buddhā mayaṃ buddhā’ti vadanti, kathaṃ nu kho ahaṃ satthu buddhabhāvaṃ jāneyya’’nti? Athassa etadahosi – ‘‘mayhaṃ guṇavasena uppannaṃ nāmaṃ mahājano jānāti, kuladattiyaṃ pana me nāmaṃ aññatra mayā na koci jānāti. Sace buddho bhavissati, kuladattikanāmena maṃ ālapissatī’’ti. Satthā tassa cittaṃ ñatvā evamāha."
    ],
    "innerText": "Ehi sudattāti so kira seṭṭhi gacchamānova cintesi – ‘‘imasmiṃ loke bahū pūraṇakassapādayo titthiyā ‘mayaṃ buddhā mayaṃ buddhā’ti vadanti, kathaṃ nu kho ahaṃ satthu buddhabhāvaṃ jāneyya’’nti? Athassa etadahosi – ‘‘mayhaṃ guṇavasena uppannaṃ nāmaṃ mahājano jānāti, kuladattiyaṃ pana me nāmaṃ aññatra mayā na koci jānāti. Sace buddho bhavissati, kuladattikanāmena maṃ ālapissatī’’ti. Satthā tassa cittaṃ ñatvā evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parinibbuto"
      },
      "ti kilesaparinibbānena parinibbuto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsattiyo"
      },
      "ti taṇhāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santi"
      },
      "nti kilesavūpasamaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pappuyyā"
      },
      "ti patvā. Idañca pana vatvā satthā tassa anupubbikathaṃ kathetvā matthake cattāri saccāni pakāsesi. Seṭṭhi dhammadesanaṃ sutvā sotāpattiphale patiṭṭhāya buddhappamukhaṃ bhikkhusaṅghaṃ nimantetvā punadivasato paṭṭhāya mahādānaṃ dātuṃ ārabhi. Bimbisārādayo seṭṭhissa sāsanaṃ pesenti – ‘‘tvaṃ āgantuko, yaṃ nappahoti, taṃ ito āharāpehī’’ti. So ‘‘alaṃ tumhe bahukiccā’’ti sabbe paṭikkhipitvā pañcahi sakaṭasatehi ānītavibhavena sattāhaṃ mahādānaṃ adāsi. Dānapariyosāne ca bhagavantaṃ sāvatthiyaṃ vassāvāsaṃ paṭijānāpetvā rājagahassa ca sāvatthiyā ",
      " ca antare yojane yojane satasahassaṃ datvā pañcacattālīsa ",
      " vihāre kārento sāvatthiṃ gantvā jetavanamahāvihāraṃ kāretvā buddhappamukhassa bhikkhusaṅghassa niyyādesīti. Aṭṭhamaṃ."
    ],
    "innerText": "Parinibbutoti kilesaparinibbānena parinibbuto. Āsattiyoti taṇhāyo. Santinti kilesavūpasamaṃ. Pappuyyāti patvā. Idañca pana vatvā satthā tassa anupubbikathaṃ kathetvā matthake cattāri saccāni pakāsesi. Seṭṭhi dhammadesanaṃ sutvā sotāpattiphale patiṭṭhāya buddhappamukhaṃ bhikkhusaṅghaṃ nimantetvā punadivasato paṭṭhāya mahādānaṃ dātuṃ ārabhi. Bimbisārādayo seṭṭhissa sāsanaṃ pesenti – ‘‘tvaṃ āgantuko, yaṃ nappahoti, taṃ ito āharāpehī’’ti. So ‘‘alaṃ tumhe bahukiccā’’ti sabbe paṭikkhipitvā pañcahi sakaṭasatehi ānītavibhavena sattāhaṃ mahādānaṃ adāsi. Dānapariyosāne ca bhagavantaṃ sāvatthiyaṃ vassāvāsaṃ paṭijānāpetvā rājagahassa ca sāvatthiyā ca antare yojane yojane satasahassaṃ datvā pañcacattālīsa vihāre kārento sāvatthiṃ gantvā jetavanamahāvihāraṃ kāretvā buddhappamukhassa bhikkhusaṅghassa niyyādesīti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Paṭhamasukkāsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "243"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rathikāya rathika"
      },
      "nti ekaṃ rathikaṃ gahetvā tato aparaṃ gacchanto rathikāya rathikaṃ upasaṅkamanto nāma hoti. Siṅghāṭakepi eseva nayo. Ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rathikā"
      },
      "ti racchā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siṅghāṭaka"
      },
      "nti catukkaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiṃ me katā"
      },
      "ti kiṃ ime katā? Kiṃ karontīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Madhupītāva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "seyare"
      },
      "ti gandhamadhupānaṃ pītā viya sayanti. Gandhamadhupānaṃ pīto kira sīsaṃ ukkhipituṃ na sakkoti, asaññī hutvā sayateva. Tasmā evamāha."
    ],
    "innerText": "243. Navame rathikāya rathikanti ekaṃ rathikaṃ gahetvā tato aparaṃ gacchanto rathikāya rathikaṃ upasaṅkamanto nāma hoti. Siṅghāṭakepi eseva nayo. Ettha ca rathikāti racchā. Siṅghāṭakanti catukkaṃ. Kiṃ me katāti kiṃ ime katā? Kiṃ karontīti attho. Madhupītāvaseyareti gandhamadhupānaṃ pītā viya sayanti. Gandhamadhupānaṃ pīto kira sīsaṃ ukkhipituṃ na sakkoti, asaññī hutvā sayateva. Tasmā evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tañca pana appaṭivānīya"
      },
      "nti tañca pana dhammaṃ appaṭivānīyaṃ deseti. Bāhirakañhi sumadhurampi bhojanaṃ punappunaṃ bhuñjantassa na ruccati, ‘‘apanetha, kiṃ iminā’’ti? Paṭivānetabbaṃ apanetabbaṃ hoti, na evamayaṃ dhammo. Imaṃ hi dhammaṃ paṇḍitā vassasatampi vassasahassampi suṇantā tittiṃ na gacchanti. Tenāha ‘‘appaṭivānīya’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asecanakamojava"
      },
      "nti anāsittakaṃ ojavantaṃ. Yathā hi bāhirāni asambhinnapāyāsādīnipi sappimadhusakkharāhi āsittāni yojitāneva madhurāni ojavantāni honti, na evamayaṃ dhammo. Ayaṃ hi attano dhammatāya madhuro ceva ojavā ca, na aññena upasitto. Tenāha ‘‘asecanakamojava’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pivanti maññe sappaññā"
      },
      "ti paṇḍitapurisā pivanti viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Valāhakameva panthagū"
      },
      "ti valāhakantarato nikkhantaudakaṃ ghammābhitattā pathikā viya. Navamaṃ."
    ],
    "innerText": "Tañca pana appaṭivānīyanti tañca pana dhammaṃ appaṭivānīyaṃ deseti. Bāhirakañhi sumadhurampi bhojanaṃ punappunaṃ bhuñjantassa na ruccati, ‘‘apanetha, kiṃ iminā’’ti? Paṭivānetabbaṃ apanetabbaṃ hoti, na evamayaṃ dhammo. Imaṃ hi dhammaṃ paṇḍitā vassasatampi vassasahassampi suṇantā tittiṃ na gacchanti. Tenāha ‘‘appaṭivānīya’’nti. Asecanakamojavanti anāsittakaṃ ojavantaṃ. Yathā hi bāhirāni asambhinnapāyāsādīnipi sappimadhusakkharāhi āsittāni yojitāneva madhurāni ojavantāni honti, na evamayaṃ dhammo. Ayaṃ hi attano dhammatāya madhuro ceva ojavā ca, na aññena upasitto. Tenāha ‘‘asecanakamojava’’nti. Pivanti maññe sappaññāti paṇḍitapurisā pivanti viya. Valāhakameva panthagūti valāhakantarato nikkhantaudakaṃ ghammābhitattā pathikā viya. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10-11. Dutiyasukkāsuttādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "244"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puññaṃ vata pasavi bahu"
      },
      "nti bahuṃ vata puññaṃ pasavatīti. Dasamaṃ."
    ],
    "innerText": "244. Dasame puññaṃ vata pasavi bahunti bahuṃ vata puññaṃ pasavatīti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "245"
      },
      ". Ekādasamaṃ uttānameva. Ekādasamaṃ."
    ],
    "innerText": "245. Ekādasamaṃ uttānameva. Ekādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "12. Āḷavakasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "246"
      },
      ". Dvādasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āḷaviya"
      },
      "nti āḷavīti taṃ raṭṭhampi nagarampi. Tañca bhavanaṃ nagarassa avidūre gāvutamatte ṭhitaṃ. Bhagavā tattha viharanto taṃ nagaraṃ upanissāya ",
      " āḷaviyaṃ viharatīti ",
      " vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āḷavakassa yakkhassa bhavane"
      },
      "ti ettha pana ayamanupubbikathā – āḷavako kira rājā vividhanāṭakūpabhogaṃ chaḍḍetvā corapaṭibāhanatthaṃ paṭirājanisedhanatthaṃ byāyāmakaraṇatthañca sattame sattame divase migavaṃ gacchanto ekadivasaṃ balakāyena saddhiṃ katikaṃ akāsi – ‘‘yassa passena migo palāyati, tasseva so bhāro’’ti. Atha tasseva passena migo palāyi, javasampanno rājā dhanuṃ gahetvā pattikova tiyojanaṃ taṃ migaṃ anubandhi. Eṇimigā ca tiyojanavegā eva honti. Atha parikkhīṇajavaṃ taṃ udakaṃ viya pavisitvā ṭhitaṃ vadhitvā dvidhā chetvā anatthikopi maṃsena ‘‘nāsakkhi migaṃ gahetu’’nti apavādamocanatthaṃ kājenādāya āgacchanto nagarassāvidūre bahalapattapalāsaṃ mahānigrodhaṃ disvā parissamavinodanatthaṃ tassa mūlamupagato. Tasmiñca nigrodhe āḷavako yakkho mahārājasantikā bhavanaṃ labhitvā majjhanhikasamaye tassa rukkhassa chāyāya phuṭṭhokāsaṃ paviṭṭhe pāṇino khādanto paṭivasati. So taṃ disvā khādituṃ upagato. Rājā tena saddhiṃ katikaṃ akāsi – ‘‘muñca maṃ, ahaṃ te divase divase manussañca thālipākañca pesessāmī’’ti. Yakkho – ‘‘tvaṃ rājūpabhogena pamatto na sarissasi, ahaṃ pana bhavanaṃ anupagatañca ananuññātañca khādituṃ na labhāmi, svāhaṃ bhavantampi jīyeyya’’nti na muñci. Rājā ‘‘yaṃ divasaṃ na pesemi, taṃ divasaṃ maṃ gahetvā khādā’’ti attānaṃ anujānitvā tena mutto nagarābhimukho agamāsi."
    ],
    "innerText": "246. Dvādasame āḷaviyanti āḷavīti taṃ raṭṭhampi nagarampi. Tañca bhavanaṃ nagarassa avidūre gāvutamatte ṭhitaṃ. Bhagavā tattha viharanto taṃ nagaraṃ upanissāya āḷaviyaṃ viharatīti vutto. Āḷavakassa yakkhassa bhavaneti ettha pana ayamanupubbikathā – āḷavako kira rājā vividhanāṭakūpabhogaṃ chaḍḍetvā corapaṭibāhanatthaṃ paṭirājanisedhanatthaṃ byāyāmakaraṇatthañca sattame sattame divase migavaṃ gacchanto ekadivasaṃ balakāyena saddhiṃ katikaṃ akāsi – ‘‘yassa passena migo palāyati, tasseva so bhāro’’ti. Atha tasseva passena migo palāyi, javasampanno rājā dhanuṃ gahetvā pattikova tiyojanaṃ taṃ migaṃ anubandhi. Eṇimigā ca tiyojanavegā eva honti. Atha parikkhīṇajavaṃ taṃ udakaṃ viya pavisitvā ṭhitaṃ vadhitvā dvidhā chetvā anatthikopi maṃsena ‘‘nāsakkhi migaṃ gahetu’’nti apavādamocanatthaṃ kājenādāya āgacchanto nagarassāvidūre bahalapattapalāsaṃ mahānigrodhaṃ disvā parissamavinodanatthaṃ tassa mūlamupagato. Tasmiñca nigrodhe āḷavako yakkho mahārājasantikā bhavanaṃ labhitvā majjhanhikasamaye tassa rukkhassa chāyāya phuṭṭhokāsaṃ paviṭṭhe pāṇino khādanto paṭivasati. So taṃ disvā khādituṃ upagato. Rājā tena saddhiṃ katikaṃ akāsi – ‘‘muñca maṃ, ahaṃ te divase divase manussañca thālipākañca pesessāmī’’ti. Yakkho – ‘‘tvaṃ rājūpabhogena pamatto na sarissasi, ahaṃ pana bhavanaṃ anupagatañca ananuññātañca khādituṃ na labhāmi, svāhaṃ bhavantampi jīyeyya’’nti na muñci. Rājā ‘‘yaṃ divasaṃ na pesemi, taṃ divasaṃ maṃ gahetvā khādā’’ti attānaṃ anujānitvā tena mutto nagarābhimukho agamāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Balakāyo magge khandhāvāraṃ bandhitvā ṭhito rājānaṃ disvā, ‘‘kiṃ, mahārāja, ayasamattabhayā evaṃ kilantosī’’ti? Vadanto paccuggantvā paṭiggahesi. Rājā taṃ pavattiṃ anārocetvā nagaraṃ gantvā katapātarāso nagaraguttikaṃ āmantetvā etamatthaṃ ārocesi. Nagaraguttiko – ‘‘kiṃ, deva ",
      ", kālaparicchedo kato’’ti āha? Na kato bhaṇeti. Duṭṭhu kataṃ, deva, amanussā hi paricchinnamattameva labhanti, aparicchinne pana janapadassābādho bhavissati, hotu deva, kiñcāpi evamakāsi, appossukko tvaṃ rajjasukhamanubhohi, ahamettha kātabbaṃ karissāmīti. So kālasseva vuṭṭhāya bandhanāgāradvāre ṭhatvā ye ye vajjhā honti, te te sandhāya ‘‘yo jīvitatthiko, so nikkhamatū’’ti ",
      " bhaṇati. Yo paṭhamaṃ nikkhamati, taṃ gehaṃ ",
      " netvā nhāpetvā bhojetvā ca ‘‘imaṃ thālipākaṃ yakkhassa dehī’’ti peseti. Taṃ rukkhamūlaṃ paviṭṭhamattaṃyeva yakkho bheravaṃ attabhāvaṃ nimminitvā mūlakandaṃ viya khādi. Yakkhānubhāvena kira manussānaṃ kesādīni upādāya sakalasarīraṃ navanītapiṇḍaṃ viya hoti, yakkhassa bhattaṃ gāhāpetuṃ gatapurisā taṃ disvā bhītā yathāmittaṃ ārocesuṃ. Tato pabhuti ‘‘rājā core gahetvā yakkhassa detī’’ti manussā corakammato paṭiviratā. Tato aparena samayena navacorānaṃ abhāvena purāṇacorānañca parikkhayena bandhanāgārāni suññāni ahesuṃ."
    ],
    "innerText": "Balakāyo magge khandhāvāraṃ bandhitvā ṭhito rājānaṃ disvā, ‘‘kiṃ, mahārāja, ayasamattabhayā evaṃ kilantosī’’ti? Vadanto paccuggantvā paṭiggahesi. Rājā taṃ pavattiṃ anārocetvā nagaraṃ gantvā katapātarāso nagaraguttikaṃ āmantetvā etamatthaṃ ārocesi. Nagaraguttiko – ‘‘kiṃ, deva , kālaparicchedo kato’’ti āha? Na kato bhaṇeti. Duṭṭhu kataṃ, deva, amanussā hi paricchinnamattameva labhanti, aparicchinne pana janapadassābādho bhavissati, hotu deva, kiñcāpi evamakāsi, appossukko tvaṃ rajjasukhamanubhohi, ahamettha kātabbaṃ karissāmīti. So kālasseva vuṭṭhāya bandhanāgāradvāre ṭhatvā ye ye vajjhā honti, te te sandhāya ‘‘yo jīvitatthiko, so nikkhamatū’’ti bhaṇati. Yo paṭhamaṃ nikkhamati, taṃ gehaṃ netvā nhāpetvā bhojetvā ca ‘‘imaṃ thālipākaṃ yakkhassa dehī’’ti peseti. Taṃ rukkhamūlaṃ paviṭṭhamattaṃyeva yakkho bheravaṃ attabhāvaṃ nimminitvā mūlakandaṃ viya khādi. Yakkhānubhāvena kira manussānaṃ kesādīni upādāya sakalasarīraṃ navanītapiṇḍaṃ viya hoti, yakkhassa bhattaṃ gāhāpetuṃ gatapurisā taṃ disvā bhītā yathāmittaṃ ārocesuṃ. Tato pabhuti ‘‘rājā core gahetvā yakkhassa detī’’ti manussā corakammato paṭiviratā. Tato aparena samayena navacorānaṃ abhāvena purāṇacorānañca parikkhayena bandhanāgārāni suññāni ahesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha nagaraguttiko rañño ārocesi. Rājā attano dhanaṃ nagararacchāsu chaḍḍāpesi ‘‘appeva nāma koci lobhena gaṇheyyā’’ti. Taṃ pādenapi koci nacchupi. So core alabhanto amaccānaṃ ārocesi. Amaccā ‘‘kulapaṭipāṭiyā ekamekaṃ jiṇṇakaṃ pesema, so pakatiyāpi maccupathe vattatī’’ti āhaṃsu. Rājā ‘‘amhākaṃ pitaraṃ amhākaṃ pitāmahaṃ pesetīti manussā khobhaṃ karissanti, mā vo etaṃ ruccī’’ti vāresi. ‘‘Tena hi, deva, dārakaṃ pesema uttānaseyyakaṃ, tathāvidhassa hi ‘mātā me’ti ‘pitā me’ti sineho natthī’’ti āhaṃsu. Rājā anujāni. Te tathā akaṃsu. Nagare dārakamātaro ca dārake gahetvā gabbhiniyo ca palāyitvā parajanapade dārake saṃvaḍḍhetvā ānenti. Evaṃ dvādasa vassāni gatāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato ekadivasaṃ sakalanagaraṃ vicinitvā ",
      " ekampi dārakaṃ alabhitvā amaccā rañño ārocesuṃ – ‘‘natthi, deva, nagare dārako ṭhapetvā antepure tava puttaṃ āḷavakakumāra’’nti. Rājā ‘‘yathā mama putto piyo, evaṃ sabbalokassa, attanā pana piyataraṃ natthi, gacchatha tampi datvā mama jīvitaṃ rakkhathā’’ti. Tena ca samayena āḷavakassa mātā puttaṃ nhāpetvā maṇḍetvā dukūlacumbaṭake katvā aṅke sayāpetvā nisinnā hoti. Rājapurisā rañño āṇāya tattha gantvā vippalapantiyā tassā soḷasannañca devisahassānaṃ saddhiṃ dhātiyā taṃ ādāya pakkamiṃsu, ‘‘sve yakkhabhakkho bhavissatī’’ti. Taṃdivasañca bhagavā paccūsasamayaṃ paccuṭṭhāya ",
      " jetavanavihāre gandhakuṭiyaṃ mahākaruṇāsamāpattiṃ samāpajjitvā buddhacakkhunā lokaṃ olokento addasa āḷavakassa kumārassa anāgāmiphaluppattiyā upanissayaṃ yakkhassa ca sotāpattiphaluppattiyā, desanāpariyosāne ca caturāsītipāṇasahassānaṃ dhammacakkhupaṭilābhassāti. So vibhātāya rattiyā purimabhattakiccaṃ katvā suniṭṭhitapacchābhattakicco kāḷapakkhūposathadivase vattamāne oggate sūriye eko adutiyo pattacīvaramādāya pādamaggeneva sāvatthito tiṃsa yojanāni ",
      " gantvā tassa yakkhassa bhavanaṃ pāvisi. Tena vuttaṃ ‘‘āḷavakassa yakkhassa bhavane’’ti."
    ],
    "innerText": "Tato ekadivasaṃ sakalanagaraṃ vicinitvā ekampi dārakaṃ alabhitvā amaccā rañño ārocesuṃ – ‘‘natthi, deva, nagare dārako ṭhapetvā antepure tava puttaṃ āḷavakakumāra’’nti. Rājā ‘‘yathā mama putto piyo, evaṃ sabbalokassa, attanā pana piyataraṃ natthi, gacchatha tampi datvā mama jīvitaṃ rakkhathā’’ti. Tena ca samayena āḷavakassa mātā puttaṃ nhāpetvā maṇḍetvā dukūlacumbaṭake katvā aṅke sayāpetvā nisinnā hoti. Rājapurisā rañño āṇāya tattha gantvā vippalapantiyā tassā soḷasannañca devisahassānaṃ saddhiṃ dhātiyā taṃ ādāya pakkamiṃsu, ‘‘sve yakkhabhakkho bhavissatī’’ti. Taṃdivasañca bhagavā paccūsasamayaṃ paccuṭṭhāya jetavanavihāre gandhakuṭiyaṃ mahākaruṇāsamāpattiṃ samāpajjitvā buddhacakkhunā lokaṃ olokento addasa āḷavakassa kumārassa anāgāmiphaluppattiyā upanissayaṃ yakkhassa ca sotāpattiphaluppattiyā, desanāpariyosāne ca caturāsītipāṇasahassānaṃ dhammacakkhupaṭilābhassāti. So vibhātāya rattiyā purimabhattakiccaṃ katvā suniṭṭhitapacchābhattakicco kāḷapakkhūposathadivase vattamāne oggate sūriye eko adutiyo pattacīvaramādāya pādamaggeneva sāvatthito tiṃsa yojanāni gantvā tassa yakkhassa bhavanaṃ pāvisi. Tena vuttaṃ ‘‘āḷavakassa yakkhassa bhavane’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kiṃ pana bhagavā yasmiṃ nigrodhe āḷavakassa bhavanaṃ, tassa mūle vihāsi, udāhu bhavaneyevāti? Bhavaneyeva. Yatheva hi yakkhā attano bhavanaṃ passanti, tathā bhagavāpi. So tattha gantvā bhavanadvāre aṭṭhāsi. Tadā āḷavako himavante yakkhasamāgamaṃ gato hoti. Tato āḷavakassa dvārapālo gadrabho nāma yakkho bhagavantaṃ upasaṅkamitvā vanditvā, ‘‘kiṃ, bhante, bhagavā vikāle āgato’’ti āha. Āma, gadrabha, āgatomhi, sace te agaru, vihareyyāmekarattaṃ āḷavakassa bhavaneti ",
      ". Na me, bhante, garu, apica kho so yakkho kakkhaḷo pharuso, mātāpitūnampi abhivādanādīni na karoti, mā rucci bhagavato idha vāsoti. Jānāmi, gadrabha, tassa sabhāvaṃ, na koci mamantarāyo bhavissati. Sace te agaru, vihareyyāmekarattanti."
    ],
    "innerText": "Kiṃ pana bhagavā yasmiṃ nigrodhe āḷavakassa bhavanaṃ, tassa mūle vihāsi, udāhu bhavaneyevāti? Bhavaneyeva. Yatheva hi yakkhā attano bhavanaṃ passanti, tathā bhagavāpi. So tattha gantvā bhavanadvāre aṭṭhāsi. Tadā āḷavako himavante yakkhasamāgamaṃ gato hoti. Tato āḷavakassa dvārapālo gadrabho nāma yakkho bhagavantaṃ upasaṅkamitvā vanditvā, ‘‘kiṃ, bhante, bhagavā vikāle āgato’’ti āha. Āma, gadrabha, āgatomhi, sace te agaru, vihareyyāmekarattaṃ āḷavakassa bhavaneti . Na me, bhante, garu, apica kho so yakkho kakkhaḷo pharuso, mātāpitūnampi abhivādanādīni na karoti, mā rucci bhagavato idha vāsoti. Jānāmi, gadrabha, tassa sabhāvaṃ, na koci mamantarāyo bhavissati. Sace te agaru, vihareyyāmekarattanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiyampi gadrabho yakkho bhagavantaṃ etadavoca – ‘‘aggitattakapālasadiso, bhante, āḷavako, mātāpitaroti vā samaṇabrāhmaṇāti vā dhammoti vā na jānāti, idhāgatānaṃ pana cittakkhepampi karoti, hadayampi phāleti, pādepi gahetvā parasamuddaṃ vā paracakkavāḷaṃ vā khipatī’’ti. Dutiyampi bhagavā āha – ‘‘jānāmi, gadrabha, sacepi te agaru, vihareyyāmekaratta’’nti. Na me, bhante, garu, apica kho so yakkho attano anārocetvā anujānantaṃ maṃ jīvitāpi voropeyya, ārocemi, bhante, tassāti. Yathāsukhaṃ ",
      ", gadrabha, ārocehīti. ‘‘Tena hi, bhante, tvameva jānāhī’’ti bhagavantaṃ abhivādetvā himavantābhimukho pakkāmi. Bhavanadvārampi sayameva bhagavato vivaramadāsi. Bhagavā antobhavanaṃ pavisitvā yattha abhilakkhitesu maṅgaladivasādīsu nisīditvā āḷavako siriṃ anubhoti, tasmiṃyeva dibbaratanamaye pallaṅke nisīditvā suvaṇṇābhaṃ muñci. Taṃ disvā yakkhassa itthiyo āgantvā bhagavantaṃ vanditvā samparivāretvā nisīdiṃsu. Bhagavā ‘‘pubbe tumhe dānaṃ datvā sīlaṃ samādiyitvā pūjaneyyaṃ pūjetvā imaṃ sampattiṃ pattā, idānipi tatheva karotha, mā aññamaññaṃ issāmacchariyābhibhūtā viharathā’’tiādinā nayena tāsaṃ pakiṇṇakadhammakathaṃ kathesi. Tā bhagavato madhuranigghosaṃ sutvā sādhukārasahassāni datvā bhagavantaṃ samparivāretvā nisīdiṃsuyeva. Gadrabhopi himavantaṃ gantvā āḷavakassārocesi – ‘‘yagghe ",
      ", mārisa, jāneyyāsi vimāne te bhagavā nisinno’’ti. So gadrabhassa saññaṃ akāsi ‘‘tuṇhī hohi, gantvā kattabbaṃ karissāmī’’ti. Purisamānena kira lajjito ahosi, tasmā ‘‘mā koci parisamajjhe suṇeyyā’’ti evamakāsi."
    ],
    "innerText": "Dutiyampi gadrabho yakkho bhagavantaṃ etadavoca – ‘‘aggitattakapālasadiso, bhante, āḷavako, mātāpitaroti vā samaṇabrāhmaṇāti vā dhammoti vā na jānāti, idhāgatānaṃ pana cittakkhepampi karoti, hadayampi phāleti, pādepi gahetvā parasamuddaṃ vā paracakkavāḷaṃ vā khipatī’’ti. Dutiyampi bhagavā āha – ‘‘jānāmi, gadrabha, sacepi te agaru, vihareyyāmekaratta’’nti. Na me, bhante, garu, apica kho so yakkho attano anārocetvā anujānantaṃ maṃ jīvitāpi voropeyya, ārocemi, bhante, tassāti. Yathāsukhaṃ , gadrabha, ārocehīti. ‘‘Tena hi, bhante, tvameva jānāhī’’ti bhagavantaṃ abhivādetvā himavantābhimukho pakkāmi. Bhavanadvārampi sayameva bhagavato vivaramadāsi. Bhagavā antobhavanaṃ pavisitvā yattha abhilakkhitesu maṅgaladivasādīsu nisīditvā āḷavako siriṃ anubhoti, tasmiṃyeva dibbaratanamaye pallaṅke nisīditvā suvaṇṇābhaṃ muñci. Taṃ disvā yakkhassa itthiyo āgantvā bhagavantaṃ vanditvā samparivāretvā nisīdiṃsu. Bhagavā ‘‘pubbe tumhe dānaṃ datvā sīlaṃ samādiyitvā pūjaneyyaṃ pūjetvā imaṃ sampattiṃ pattā, idānipi tatheva karotha, mā aññamaññaṃ issāmacchariyābhibhūtā viharathā’’tiādinā nayena tāsaṃ pakiṇṇakadhammakathaṃ kathesi. Tā bhagavato madhuranigghosaṃ sutvā sādhukārasahassāni datvā bhagavantaṃ samparivāretvā nisīdiṃsuyeva. Gadrabhopi himavantaṃ gantvā āḷavakassārocesi – ‘‘yagghe , mārisa, jāneyyāsi vimāne te bhagavā nisinno’’ti. So gadrabhassa saññaṃ akāsi ‘‘tuṇhī hohi, gantvā kattabbaṃ karissāmī’’ti. Purisamānena kira lajjito ahosi, tasmā ‘‘mā koci parisamajjhe suṇeyyā’’ti evamakāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tadā sātāgirahemavatā bhagavantaṃ jetavaneyeva vanditvā ‘‘yakkhasamāgamaṃ gamissāmā’’ti saparivārā nānāyānehi ",
      " ākāsena gacchanti. Ākāse ca yakkhānaṃ sabbattha maggo natthi, ākāsaṭṭhāni vimānāni pariharitvā maggaṭṭhāneneva maggo hoti. Āḷavakassa pana vimānaṃ bhūmaṭṭhaṃ suguttaṃ pākāraparikkhittaṃ susaṃvihitadvāraaṭṭālakagopuraṃ upari kaṃsajālasañchannaṃ mañjūsasadisaṃ tiyojanaṃ ubbedhena, tassa upari maggo hoti. Te taṃ padesamāgamma gantuṃ nāsakkhiṃsu. Buddhānaṃ hi nisinnokāsassa uparibhāgena yāva bhavaggā koci gantuṃ na sakkoti. Te ‘‘kimida’’nti? Āvajjetvā bhagavantaṃ disvā ākāse khittaleḍḍu viya oruyha vanditvā dhammaṃ sutvā padakkhiṇaṃ katvā, ‘‘yakkhasamāgamaṃ gacchāma bhagavā’’ti tīṇi vatthūni pasaṃsantā yakkhasamāgamaṃ agamaṃsu. Āḷavako te disvā, ‘‘idha nisīdathā’’ti paṭikkamma okāsamadāsi. Te āḷavakassa nivedesuṃ – ‘‘lābhā te, āḷavaka, yassa te bhavane bhagavā viharati, gacchāvuso, bhagavantaṃ payirupāsassū’’ti. Evaṃ bhagavā bhavaneyeva vihāsi, na yasmiṃ nigrodhe ",
      " āḷavakassa bhavanaṃ, tassa mūleti. Tena vuttaṃ – ‘‘ekaṃ samayaṃ bhagavā āḷaviyaṃ viharati āḷavakassa yakkhassa bhavane’’ti."
    ],
    "innerText": "Tadā sātāgirahemavatā bhagavantaṃ jetavaneyeva vanditvā ‘‘yakkhasamāgamaṃ gamissāmā’’ti saparivārā nānāyānehi ākāsena gacchanti. Ākāse ca yakkhānaṃ sabbattha maggo natthi, ākāsaṭṭhāni vimānāni pariharitvā maggaṭṭhāneneva maggo hoti. Āḷavakassa pana vimānaṃ bhūmaṭṭhaṃ suguttaṃ pākāraparikkhittaṃ susaṃvihitadvāraaṭṭālakagopuraṃ upari kaṃsajālasañchannaṃ mañjūsasadisaṃ tiyojanaṃ ubbedhena, tassa upari maggo hoti. Te taṃ padesamāgamma gantuṃ nāsakkhiṃsu. Buddhānaṃ hi nisinnokāsassa uparibhāgena yāva bhavaggā koci gantuṃ na sakkoti. Te ‘‘kimida’’nti? Āvajjetvā bhagavantaṃ disvā ākāse khittaleḍḍu viya oruyha vanditvā dhammaṃ sutvā padakkhiṇaṃ katvā, ‘‘yakkhasamāgamaṃ gacchāma bhagavā’’ti tīṇi vatthūni pasaṃsantā yakkhasamāgamaṃ agamaṃsu. Āḷavako te disvā, ‘‘idha nisīdathā’’ti paṭikkamma okāsamadāsi. Te āḷavakassa nivedesuṃ – ‘‘lābhā te, āḷavaka, yassa te bhavane bhagavā viharati, gacchāvuso, bhagavantaṃ payirupāsassū’’ti. Evaṃ bhagavā bhavaneyeva vihāsi, na yasmiṃ nigrodhe āḷavakassa bhavanaṃ, tassa mūleti. Tena vuttaṃ – ‘‘ekaṃ samayaṃ bhagavā āḷaviyaṃ viharati āḷavakassa yakkhassa bhavane’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha kho āḷavako…pe… etadavoca – ‘‘nikkhama, samaṇā’’"
      },
      "ti kasmā panāyaṃ etadavoca? Rosetukāmatāya. Tatrevaṃ ādito pabhuti sambandho veditabbo – ayaṃ hi yasmā assaddhassa saddhākathā dukkathā hoti dussīlādīnaṃ sīlādikathā viya, tasmā tesaṃ yakkhānaṃ santikā bhagavato pasaṃsaṃ sutvāyeva aggimhi pakkhittaloṇasakkharā viya abbhantare kopena taṭataṭāyamānahadayo hutvā ‘‘ko so bhagavā nāma, yo mama bhavanaṃ paviṭṭho’’ti āha. Te ahaṃsu – ‘‘na tvaṃ, āvuso, jānāsi bhagavantaṃ amhākaṃ satthāraṃ, yo tusitabhavane ṭhito pañcamahāvilokitaṃ viloketvā’’tiādinā nayena yāva dhammacakkapavattanā kathentā paṭisandhiādīsu dvattiṃsa pubbanimittāni vatvā, ‘‘imānipi tvaṃ, āvuso, acchariyāni nāddasā’’ti? Codesuṃ. So disvāpi kodhavasena ‘‘nāddasa’’nti āha. Āvuso āḷavaka, passeyyāsi vā tvaṃ, na vā, ko tayā attho passatā vā apassatā ",
      " vā? Kiṃ tvaṃ karissasi ",
      " amhākaṃ satthuno, yo tvaṃ taṃ upanidhāya calakkakudha-mahāusabhasamīpe tadahujātavacchako viya, tidhā pabhinnamattavāraṇasamīpe bhiṅkapotako viya, bhāsuravilambitakesarasobhitakkhandhassa migarañño samīpe jarasiṅgālo viya, diyaḍḍhayojanasatapavaḍḍhakāyasupaṇṇarājasamīpe chinnapakkhakākapotako viya khāyasi, gaccha yaṃ te karaṇīyaṃ, taṃ karohīti. Evaṃ vutte duṭṭho āḷavako uṭṭhahitvā manosilātale vāmapādena ṭhatvā – ‘‘passatha dāni tumhākaṃ vā satthā mahānubhāvo, ahaṃ vā’’ti dakkhiṇapādena saṭṭhiyojanamattaṃ kelāsapabbatakūṭaṃ akkami. Taṃ ayokūṭapahaṭo viya niddhantaayopiṇḍo papaṭikāyo muñci, so tatra ṭhatvā, ‘‘ahaṃ āḷavako’’ti ugghosesi. Sakalajambudīpaṃ saddo phari."
    ],
    "innerText": "Atha kho āḷavako…pe… etadavoca – ‘‘nikkhama, samaṇā’’ti kasmā panāyaṃ etadavoca? Rosetukāmatāya. Tatrevaṃ ādito pabhuti sambandho veditabbo – ayaṃ hi yasmā assaddhassa saddhākathā dukkathā hoti dussīlādīnaṃ sīlādikathā viya, tasmā tesaṃ yakkhānaṃ santikā bhagavato pasaṃsaṃ sutvāyeva aggimhi pakkhittaloṇasakkharā viya abbhantare kopena taṭataṭāyamānahadayo hutvā ‘‘ko so bhagavā nāma, yo mama bhavanaṃ paviṭṭho’’ti āha. Te ahaṃsu – ‘‘na tvaṃ, āvuso, jānāsi bhagavantaṃ amhākaṃ satthāraṃ, yo tusitabhavane ṭhito pañcamahāvilokitaṃ viloketvā’’tiādinā nayena yāva dhammacakkapavattanā kathentā paṭisandhiādīsu dvattiṃsa pubbanimittāni vatvā, ‘‘imānipi tvaṃ, āvuso, acchariyāni nāddasā’’ti? Codesuṃ. So disvāpi kodhavasena ‘‘nāddasa’’nti āha. Āvuso āḷavaka, passeyyāsi vā tvaṃ, na vā, ko tayā attho passatā vā apassatā vā? Kiṃ tvaṃ karissasi amhākaṃ satthuno, yo tvaṃ taṃ upanidhāya calakkakudha-mahāusabhasamīpe tadahujātavacchako viya, tidhā pabhinnamattavāraṇasamīpe bhiṅkapotako viya, bhāsuravilambitakesarasobhitakkhandhassa migarañño samīpe jarasiṅgālo viya, diyaḍḍhayojanasatapavaḍḍhakāyasupaṇṇarājasamīpe chinnapakkhakākapotako viya khāyasi, gaccha yaṃ te karaṇīyaṃ, taṃ karohīti. Evaṃ vutte duṭṭho āḷavako uṭṭhahitvā manosilātale vāmapādena ṭhatvā – ‘‘passatha dāni tumhākaṃ vā satthā mahānubhāvo, ahaṃ vā’’ti dakkhiṇapādena saṭṭhiyojanamattaṃ kelāsapabbatakūṭaṃ akkami. Taṃ ayokūṭapahaṭo viya niddhantaayopiṇḍo papaṭikāyo muñci, so tatra ṭhatvā, ‘‘ahaṃ āḷavako’’ti ugghosesi. Sakalajambudīpaṃ saddo phari."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattāro kira saddā"
      },
      " sakalajambudīpe sūyiṃsu – yañca puṇṇako yakkhasenāpati dhanañjayakorabyarājānaṃ jūtaṃ jinitvā apphoṭetvā ‘‘ahaṃ jini’’nti ugghosesi; yañca sakko devānamindo kassapabhagavato sāsane osakkante vissakammadevaputtaṃ sunakhaṃ karitvā – ‘‘ahaṃ pāpabhikkhū ca ",
      " pāpabhikkhuniyo ca upāsake ca upāsikāyo ca sabbeva ca adhammavādino khādāmī’’ti ugghosāpesi; yañca kusajātake pabhāvatihetu sattahi rājūhi nagare uparuddhe pabhāvatiṃ attanā saha hatthikkhandhe āropetvā nagarā nikkhamma – ‘‘ahaṃ sīhassaramahākusarājā’’ti mahāpuriso ugghosesi; yañca kelāsamuddhani ṭhatvā āḷavakoti. Tadā hi sakalajambudīpe dvāre ṭhatvā ugghositasadisaṃ ahosi. Tiyojanasahassavitthato ca himavāpi saṅkampi yakkhassānubhāvena."
    ],
    "innerText": "Cattāro kira saddā sakalajambudīpe sūyiṃsu – yañca puṇṇako yakkhasenāpati dhanañjayakorabyarājānaṃ jūtaṃ jinitvā apphoṭetvā ‘‘ahaṃ jini’’nti ugghosesi; yañca sakko devānamindo kassapabhagavato sāsane osakkante vissakammadevaputtaṃ sunakhaṃ karitvā – ‘‘ahaṃ pāpabhikkhū ca pāpabhikkhuniyo ca upāsake ca upāsikāyo ca sabbeva ca adhammavādino khādāmī’’ti ugghosāpesi; yañca kusajātake pabhāvatihetu sattahi rājūhi nagare uparuddhe pabhāvatiṃ attanā saha hatthikkhandhe āropetvā nagarā nikkhamma – ‘‘ahaṃ sīhassaramahākusarājā’’ti mahāpuriso ugghosesi; yañca kelāsamuddhani ṭhatvā āḷavakoti. Tadā hi sakalajambudīpe dvāre ṭhatvā ugghositasadisaṃ ahosi. Tiyojanasahassavitthato ca himavāpi saṅkampi yakkhassānubhāvena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vātamaṇḍalaṃ"
      },
      " samuṭṭhāpesi – ‘‘eteneva samaṇaṃ palāpessāmī’’ti ",
      ". Te puratthimādibhedā vātā samuṭṭhahitvā aḍḍhayojanayojanadviyojanatiyojanappamāṇāni pabbatakūṭāni padāletvā vanagaccharukkhādīni ummūlaṃ katvā, āḷavinagaraṃ pakkhantā jiṇṇahatthisālādīni cuṇṇentā chadaniṭṭhakā ākāse vidhamentā. Bhagavā ‘‘mā kassaci uparodho hotū’’ti adhiṭṭhāsi. Te vātā dasabalaṃ patvā cīvarakaṇṇamattampi cāletuṃ nāsakkhiṃsu. Tato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāvassaṃ"
      },
      " samuṭṭhāpesi. ‘‘Udakena ajjhottharitvā samaṇaṃ māressāmī’’ti. Tassānubhāvena uparūpari satapaṭalasahassapaṭalādibhedā valāhakā uṭṭhahitvā pavassiṃsu. Vuṭṭhidhārāvegena pathavī chiddā ahosi. Vanarukkhādīnaṃ upari mahogho āgantvā dasabalassa cīvare ussāvabindumattampi temetuṃ nāsakkhi. Tato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāsāṇavassaṃ"
      },
      " samuṭṭhāpesi. Mahantāni mahantāni pabbatakūṭāni dhūmāyantāni ",
      " pajjalantāni ākāsenāgantvā dasabalaṃ patvā dibbamālāguḷāni sampajjiṃsu. Tato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paharaṇavassaṃ"
      },
      " samuṭṭhāpesi. Ekatodhārāubhatodhārāasisattikhurappādayo dhūmāyantā pajjalantā ākāsenāgantvā dasabalaṃ patvā dibbapupphāni ahesuṃ. Tato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṅgāravassaṃ"
      },
      " samuṭṭhāpesi. Kiṃsuka vaṇṇā aṅgārā ākāsenāgantvā dasabalassa pādamūle dibbapupphāni hutvā vikīrayiṃsu. Tato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kukkulavassaṃ"
      },
      " samuṭṭhāpesi. Accuṇhā kukkulā ākāsenāgantvā dasabalassa pādamūle candanacuṇṇaṃ hutvā nipatiṃsu. Tato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vālikavassaṃ"
      },
      " samuṭṭhāpesi. Atisukhumavālikā dhūmāyantā pajjalantā ākāsenāgantvā dasabalassa pādamūle dibbapupphāni hutvā nipatiṃsu. Tato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kalalavassaṃ"
      },
      " samuṭṭhāpesi. Taṃ kalalavassaṃ dhūmāyantaṃ pajjalantaṃ ākāsenāgantvā dasabalassa pādamūle dibbagandhaṃ hutvā nipati. Tato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "andhakāraṃ"
      },
      " samuṭṭhāpesi ‘‘bhiṃsetvā samaṇaṃ palāpessāmī’’ti. Taṃ caturaṅgasamannāgataṃ andhakārasadisaṃ hutvā dasabalaṃ patvā sūriyappabhāvihatamiva andhakāraṃ antaradhāyi."
    ],
    "innerText": "So vātamaṇḍalaṃ samuṭṭhāpesi – ‘‘eteneva samaṇaṃ palāpessāmī’’ti . Te puratthimādibhedā vātā samuṭṭhahitvā aḍḍhayojanayojanadviyojanatiyojanappamāṇāni pabbatakūṭāni padāletvā vanagaccharukkhādīni ummūlaṃ katvā, āḷavinagaraṃ pakkhantā jiṇṇahatthisālādīni cuṇṇentā chadaniṭṭhakā ākāse vidhamentā. Bhagavā ‘‘mā kassaci uparodho hotū’’ti adhiṭṭhāsi. Te vātā dasabalaṃ patvā cīvarakaṇṇamattampi cāletuṃ nāsakkhiṃsu. Tato mahāvassaṃ samuṭṭhāpesi. ‘‘Udakena ajjhottharitvā samaṇaṃ māressāmī’’ti. Tassānubhāvena uparūpari satapaṭalasahassapaṭalādibhedā valāhakā uṭṭhahitvā pavassiṃsu. Vuṭṭhidhārāvegena pathavī chiddā ahosi. Vanarukkhādīnaṃ upari mahogho āgantvā dasabalassa cīvare ussāvabindumattampi temetuṃ nāsakkhi. Tato pāsāṇavassaṃ samuṭṭhāpesi. Mahantāni mahantāni pabbatakūṭāni dhūmāyantāni pajjalantāni ākāsenāgantvā dasabalaṃ patvā dibbamālāguḷāni sampajjiṃsu. Tato paharaṇavassaṃ samuṭṭhāpesi. Ekatodhārāubhatodhārāasisattikhurappādayo dhūmāyantā pajjalantā ākāsenāgantvā dasabalaṃ patvā dibbapupphāni ahesuṃ. Tato aṅgāravassaṃ samuṭṭhāpesi. Kiṃsuka vaṇṇā aṅgārā ākāsenāgantvā dasabalassa pādamūle dibbapupphāni hutvā vikīrayiṃsu. Tato kukkulavassaṃ samuṭṭhāpesi. Accuṇhā kukkulā ākāsenāgantvā dasabalassa pādamūle candanacuṇṇaṃ hutvā nipatiṃsu. Tato vālikavassaṃ samuṭṭhāpesi. Atisukhumavālikā dhūmāyantā pajjalantā ākāsenāgantvā dasabalassa pādamūle dibbapupphāni hutvā nipatiṃsu. Tato kalalavassaṃ samuṭṭhāpesi. Taṃ kalalavassaṃ dhūmāyantaṃ pajjalantaṃ ākāsenāgantvā dasabalassa pādamūle dibbagandhaṃ hutvā nipati. Tato andhakāraṃ samuṭṭhāpesi ‘‘bhiṃsetvā samaṇaṃ palāpessāmī’’ti. Taṃ caturaṅgasamannāgataṃ andhakārasadisaṃ hutvā dasabalaṃ patvā sūriyappabhāvihatamiva andhakāraṃ antaradhāyi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ yakkho imāhi navahi vātavassapāsāṇapaharaṇaṅgārakukkulavālikakalalandhakāravuṭṭhīhi ",
      " bhagavantaṃ palāpetuṃ asakkonto nānāvidhapaharaṇahatthāya anekappakārarūpabhūtagaṇasamākulāya caturaṅginiyā senāya sayameva bhagavantaṃ abhigato. Te bhūtagaṇā anekappakāre vikāre katvā ‘‘gaṇhatha hanathā’’ti bhagavato upari āgacchantā viya honti. Apica kho niddhantalohapiṇḍaṃ viya makkhikā, bhagavantaṃ allīyituṃ asamatthāva ahesuṃ. Evaṃ santepi yathā bodhimaṇḍe māro āgatavelāyameva nivatto, tathā anivattetvā upaḍḍharattimattaṃ byākulamakaṃsu. Evaṃ upaḍḍharattimattaṃ anekappakāravibhiṃsanakadassanenapi bhagavantaṃ cāletuṃ asakkonto āḷavako cintesi – ‘‘yaṃnūnāhaṃ kenaci ajeyyaṃ dussāvudhaṃ muñceyya’’nti."
    ],
    "innerText": "Evaṃ yakkho imāhi navahi vātavassapāsāṇapaharaṇaṅgārakukkulavālikakalalandhakāravuṭṭhīhi bhagavantaṃ palāpetuṃ asakkonto nānāvidhapaharaṇahatthāya anekappakārarūpabhūtagaṇasamākulāya caturaṅginiyā senāya sayameva bhagavantaṃ abhigato. Te bhūtagaṇā anekappakāre vikāre katvā ‘‘gaṇhatha hanathā’’ti bhagavato upari āgacchantā viya honti. Apica kho niddhantalohapiṇḍaṃ viya makkhikā, bhagavantaṃ allīyituṃ asamatthāva ahesuṃ. Evaṃ santepi yathā bodhimaṇḍe māro āgatavelāyameva nivatto, tathā anivattetvā upaḍḍharattimattaṃ byākulamakaṃsu. Evaṃ upaḍḍharattimattaṃ anekappakāravibhiṃsanakadassanenapi bhagavantaṃ cāletuṃ asakkonto āḷavako cintesi – ‘‘yaṃnūnāhaṃ kenaci ajeyyaṃ dussāvudhaṃ muñceyya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattāri kira āvudhāni"
      },
      " loke seṭṭhāni – sakkassa vajirāvudhaṃ, vessavaṇassa gadāvudhaṃ, yamassa nayanāvudhaṃ, āḷavakassa dussāvudhanti. Yadi hi sakko duṭṭho vajirāvudhaṃ sinerumatthake pahareyya, aṭṭhasaṭṭhisahassādhikayojanasatasahassaṃ vinivijjhitvā heṭṭhato gaccheyya. Vessavaṇena kujjhanakāle vissajjitaṃ gadāvudhaṃ bahūnaṃ yakkhasahassānaṃ sīsaṃ pātetvā puna hatthapāsaṃ āgantvā tiṭṭhati. Yamena duṭṭhena nayanāvudhena olokitamatte anekāni kumbhaṇḍasahassāni tattakapāle tilā viya pharantāni vinassanti. Āḷavako duṭṭho sace ākāse dussāvudhaṃ muñceyya, dvādasa vassāni devo na vasseyya. Sace pathaviyaṃ muñceyya. Sabbarukkhatiṇādīni sussitvā ",
      " dvādasavassantare na puna viruheyyuṃ. Sace samudde muñceyya, tattakapāle udakabindu viya sabbamudakaṃ susseyya. Sace sinerusadisepi pabbate muñceyya, khaṇḍākhaṇḍaṃ hutvā vikireyya. So evaṃ mahānubhāvaṃ dussāvudhaṃ uttarisāṭakaṃ muñcitvā aggahesi. Yebhuyyena dasasahassīlokadhātudevatā vegena sannipatiṃsu ‘‘ajja ",
      " bhagavā āḷavakaṃ damessati, tattha dhammaṃ sossāmā’’ti yuddhadassanakāmāpi devatā sannipatiṃsu. Evaṃ sakalampi ākāsaṃ devatāhi paripuṇṇamahosi."
    ],
    "innerText": "Cattāri kira āvudhāni loke seṭṭhāni – sakkassa vajirāvudhaṃ, vessavaṇassa gadāvudhaṃ, yamassa nayanāvudhaṃ, āḷavakassa dussāvudhanti. Yadi hi sakko duṭṭho vajirāvudhaṃ sinerumatthake pahareyya, aṭṭhasaṭṭhisahassādhikayojanasatasahassaṃ vinivijjhitvā heṭṭhato gaccheyya. Vessavaṇena kujjhanakāle vissajjitaṃ gadāvudhaṃ bahūnaṃ yakkhasahassānaṃ sīsaṃ pātetvā puna hatthapāsaṃ āgantvā tiṭṭhati. Yamena duṭṭhena nayanāvudhena olokitamatte anekāni kumbhaṇḍasahassāni tattakapāle tilā viya pharantāni vinassanti. Āḷavako duṭṭho sace ākāse dussāvudhaṃ muñceyya, dvādasa vassāni devo na vasseyya. Sace pathaviyaṃ muñceyya. Sabbarukkhatiṇādīni sussitvā dvādasavassantare na puna viruheyyuṃ. Sace samudde muñceyya, tattakapāle udakabindu viya sabbamudakaṃ susseyya. Sace sinerusadisepi pabbate muñceyya, khaṇḍākhaṇḍaṃ hutvā vikireyya. So evaṃ mahānubhāvaṃ dussāvudhaṃ uttarisāṭakaṃ muñcitvā aggahesi. Yebhuyyena dasasahassīlokadhātudevatā vegena sannipatiṃsu ‘‘ajja bhagavā āḷavakaṃ damessati, tattha dhammaṃ sossāmā’’ti yuddhadassanakāmāpi devatā sannipatiṃsu. Evaṃ sakalampi ākāsaṃ devatāhi paripuṇṇamahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha āḷavako bhagavato samīpe uparūpari vicaritvā vatthāvudhaṃ muñci. Taṃ asanivicakkaṃ viya ākāse bheravasaddaṃ karontaṃ dhūmāyantaṃ pajjalantaṃ bhagavantaṃ patvā yakkhamānamaddanatthaṃ pādapuñchanacoḷaṃ hutvā pādamūle nipati. Āḷavako taṃ disvā chinnavisāṇo viya usabho uddhatadāṭho viya sappo nittejo nimmado nipatitamānaddhajo hutvā cintesi – ‘‘dussāvudhampi me samaṇaṃ nābhibhosi. Kiṃ nu kho kāraṇa’’nti? ‘‘Idaṃ kāraṇaṃ, mettāvihārayutto samaṇo, handa naṃ rosetvā mettāya viyojemī’’ti iminā sambandhenetaṃ vuttaṃ – atha kho āḷavako yakkho yena bhagavā…pe… nikkhama samaṇāti. Tatthāyamadhippāyo – kasmā mayā ananuññāto mama bhavanaṃ pavisitvā gharasāmiko viya itthāgārassa majjhe nisinnosi? Ananuyuttametaṃ samaṇassa yadidaṃ adinnaparibhogo itthisaṃsaggo ca? Tasmā yadi tvaṃ samaṇadhamme ṭhito, nikkhama samaṇāti. Eke pana – ‘‘etāni aññāni ca pharusavacanāni vatvā evāyaṃ etadavocā’’ti bhaṇanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha bhagavā – ‘‘yasmā thaddho paṭithaddhabhāvena vinetuṃ na sakkā, so hi paṭithaddhabhāve kayiramāne, seyyathāpi caṇḍassa kukkurassa nāsāya pittaṃ bhindeyya, so bhiyyosomattāya caṇḍataro assa, evaṃ thaddhataro hoti, mudunā pana so sakkā vinetu’’nti ñatvā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sādhāvuso"
      },
      "ti piyavacanena tassa vacanaṃ sampaṭicchitvā nikkhami. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sādhāvusoti bhagavā nikkhamī"
      },
      "ti."
    ],
    "innerText": "Atha bhagavā – ‘‘yasmā thaddho paṭithaddhabhāvena vinetuṃ na sakkā, so hi paṭithaddhabhāve kayiramāne, seyyathāpi caṇḍassa kukkurassa nāsāya pittaṃ bhindeyya, so bhiyyosomattāya caṇḍataro assa, evaṃ thaddhataro hoti, mudunā pana so sakkā vinetu’’nti ñatvā, sādhāvusoti piyavacanena tassa vacanaṃ sampaṭicchitvā nikkhami. Tena vuttaṃ sādhāvusoti bhagavā nikkhamīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato āḷavako – ‘‘subbaco vatāyaṃ samaṇo ekavacaneneva nikkhanto, evaṃ nāma nikkhametuṃ sukhaṃ samaṇaṃ akāraṇenevāhaṃ sakalarattiṃ yuddhena abbhuyyāsi’’nti muducitto hutvā puna cintesi – ‘‘idānipi na sakkā jānituṃ, kiṃ nu kho subbacatāya nikkhanto udāhu kodhano ",
      ". Handāhaṃ ",
      " vīmaṃsāmī’’ti. Tato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pavisa, samaṇā"
      },
      "ti āha. Atha subbacoti mudubhūtacittavavatthānakaraṇatthaṃ puna piyavacanaṃ vadanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sādhāvuso"
      },
      "ti bhagavā ",
      " pāvisi. Āḷavako punappunaṃ tameva subbacabhāvaṃ vīmaṃsanto dutiyampi tatiyampi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nikkhama pavisā"
      },
      "ti āha. Bhagavāpi tathā akāsi. Yadi na kareyya, pakatiyāpi thaddhayakkhassa cittaṃ thaddhataraṃ hutvā dhammakathāya bhājanaṃ na bhaveyya. Tasmā yathā nāma mātā rodantaṃ puttakaṃ yaṃ so icchati, taṃ datvā vā katvā vā saññāpesi tathā bhagavā kilesarodanena rodantaṃ yakkhaṃ saññāpetuṃ yaṃ so bhaṇati, taṃ akāsi. Yathā ca dhātī thaññaṃ apivantaṃ dārakaṃ kiñci datvā upalāḷetvā pāyeti, tathā bhagavā yakkhaṃ lokuttaradhammakhīraṃ pāyetuṃ tassa patthitavacanakaraṇena upalāḷento evamakāsi. Yathā ca puriso lābumhi catumadhuraṃ pūretukāmo tassabbhantaraṃ sodheti, evaṃ bhagavā yakkhassa citte lokuttaracatumadhuraṃ pūretukāmo tassabbhantare kodhamalaṃ sodhetuṃ yāva tatiyaṃ nikkhamanapavisanaṃ akāsi."
    ],
    "innerText": "Tato āḷavako – ‘‘subbaco vatāyaṃ samaṇo ekavacaneneva nikkhanto, evaṃ nāma nikkhametuṃ sukhaṃ samaṇaṃ akāraṇenevāhaṃ sakalarattiṃ yuddhena abbhuyyāsi’’nti muducitto hutvā puna cintesi – ‘‘idānipi na sakkā jānituṃ, kiṃ nu kho subbacatāya nikkhanto udāhu kodhano . Handāhaṃ vīmaṃsāmī’’ti. Tato pavisa, samaṇāti āha. Atha subbacoti mudubhūtacittavavatthānakaraṇatthaṃ puna piyavacanaṃ vadanto sādhāvusoti bhagavā pāvisi. Āḷavako punappunaṃ tameva subbacabhāvaṃ vīmaṃsanto dutiyampi tatiyampi nikkhama pavisāti āha. Bhagavāpi tathā akāsi. Yadi na kareyya, pakatiyāpi thaddhayakkhassa cittaṃ thaddhataraṃ hutvā dhammakathāya bhājanaṃ na bhaveyya. Tasmā yathā nāma mātā rodantaṃ puttakaṃ yaṃ so icchati, taṃ datvā vā katvā vā saññāpesi tathā bhagavā kilesarodanena rodantaṃ yakkhaṃ saññāpetuṃ yaṃ so bhaṇati, taṃ akāsi. Yathā ca dhātī thaññaṃ apivantaṃ dārakaṃ kiñci datvā upalāḷetvā pāyeti, tathā bhagavā yakkhaṃ lokuttaradhammakhīraṃ pāyetuṃ tassa patthitavacanakaraṇena upalāḷento evamakāsi. Yathā ca puriso lābumhi catumadhuraṃ pūretukāmo tassabbhantaraṃ sodheti, evaṃ bhagavā yakkhassa citte lokuttaracatumadhuraṃ pūretukāmo tassabbhantare kodhamalaṃ sodhetuṃ yāva tatiyaṃ nikkhamanapavisanaṃ akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha āḷavako ‘‘subbaco ayaṃ samaṇo ‘nikkhamā’ti vutto nikkhamati, ‘pavisā’ti vutto pavisati. Yaṃnūnāhaṃ imaṃ samaṇaṃ evameva sakalarattiṃ kilametvā pāde gahetvā pāragaṅgāya khipeyya’’nti? Pāpakaṃ cittaṃ uppādetvā catutthavāraṃ āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nikkhama, samaṇā"
      },
      "ti. Taṃ ñatvā bhagavā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na khvāhaṃ ta"
      },
      "nti āha. Evaṃ vā vutte taduttarikaraṇīyaṃ pariyesamāno pañhaṃ pucchitabbaṃ maññissati. Taṃ dhammakathāya mukhaṃ bhavissatīti ñatvā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na khvāhaṃ ta"
      },
      "nti āha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na"
      },
      "-iti paṭikkhepe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kho"
      },
      "ti avadhāraṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aha"
      },
      "nti attanidassanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ta"
      },
      "nti hetuvacanaṃ. Tenevettha ‘‘yasmā tvaṃ evaṃ cintesi, tasmā ahaṃ, āvuso, neva nikkhamissāmi, yaṃ te karaṇīyaṃ, taṃ karohī’’ti evamattho daṭṭhabbo."
    ],
    "innerText": "Atha āḷavako ‘‘subbaco ayaṃ samaṇo ‘nikkhamā’ti vutto nikkhamati, ‘pavisā’ti vutto pavisati. Yaṃnūnāhaṃ imaṃ samaṇaṃ evameva sakalarattiṃ kilametvā pāde gahetvā pāragaṅgāya khipeyya’’nti? Pāpakaṃ cittaṃ uppādetvā catutthavāraṃ āha nikkhama, samaṇāti. Taṃ ñatvā bhagavā na khvāhaṃ tanti āha. Evaṃ vā vutte taduttarikaraṇīyaṃ pariyesamāno pañhaṃ pucchitabbaṃ maññissati. Taṃ dhammakathāya mukhaṃ bhavissatīti ñatvā, na khvāhaṃ tanti āha. Tattha na-iti paṭikkhepe. Khoti avadhāraṇe. Ahanti attanidassanaṃ. Tanti hetuvacanaṃ. Tenevettha ‘‘yasmā tvaṃ evaṃ cintesi, tasmā ahaṃ, āvuso, neva nikkhamissāmi, yaṃ te karaṇīyaṃ, taṃ karohī’’ti evamattho daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato āḷavako yasmā pubbepi ākāsena gamanavelāya – ‘‘kiṃ nu kho etaṃ suvaṇṇavimānaṃ, udāhu rajatamaṇivimānānaṃ aññataraṃ, handa naṃ passāmā’’ti evaṃ attano vimānaṃ āgate iddhimante tāpasaparibbājake pañhaṃ pucchitvā vissajjetuṃ ",
      " asakkonte cittakkhepādīhi viheṭheti, tasmā bhagavantampi tathā viheṭhessāmīti maññamāno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañhaṃ ta"
      },
      "ntiādimāha."
    ],
    "innerText": "Tato āḷavako yasmā pubbepi ākāsena gamanavelāya – ‘‘kiṃ nu kho etaṃ suvaṇṇavimānaṃ, udāhu rajatamaṇivimānānaṃ aññataraṃ, handa naṃ passāmā’’ti evaṃ attano vimānaṃ āgate iddhimante tāpasaparibbājake pañhaṃ pucchitvā vissajjetuṃ asakkonte cittakkhepādīhi viheṭheti, tasmā bhagavantampi tathā viheṭhessāmīti maññamāno pañhaṃ tantiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kuto panassa pañhāti ",
      "? Tassa kira mātāpitaro kassapaṃ bhagavantaṃ payirupāsitvā aṭṭha ",
      " pañhe saha vissajjanena uggahesuṃ. Te daharakāle āḷavakaṃ pariyāpuṇāpesuṃ; so kālaccayena vissajjanaṃ sammussi. Tato ‘‘ime pañhāpi mā vinassantū’’ti suvaṇṇapaṭṭhe jātihiṅgulakena lekhāpetvā vimāne nikkhipi. Evamete puṭṭhapañhā buddhavisayāva honti. Bhagavā taṃ sutvā yasmā buddhānaṃ pariccattalābhantarāyo vā jīvitantarāyo vā sabbaññutaññāṇabyāmappabhādipaṭighāto vā na sakkā kenaci kātuṃ, tasmā naṃ loke asādhāraṇaṃ buddhānubhāvaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na khvāhaṃ taṃ, āvuso, passāmi sadevake loke"
      },
      "tiādimāha."
    ],
    "innerText": "Kuto panassa pañhāti ? Tassa kira mātāpitaro kassapaṃ bhagavantaṃ payirupāsitvā aṭṭha pañhe saha vissajjanena uggahesuṃ. Te daharakāle āḷavakaṃ pariyāpuṇāpesuṃ; so kālaccayena vissajjanaṃ sammussi. Tato ‘‘ime pañhāpi mā vinassantū’’ti suvaṇṇapaṭṭhe jātihiṅgulakena lekhāpetvā vimāne nikkhipi. Evamete puṭṭhapañhā buddhavisayāva honti. Bhagavā taṃ sutvā yasmā buddhānaṃ pariccattalābhantarāyo vā jīvitantarāyo vā sabbaññutaññāṇabyāmappabhādipaṭighāto vā na sakkā kenaci kātuṃ, tasmā naṃ loke asādhāraṇaṃ buddhānubhāvaṃ dassento na khvāhaṃ taṃ, āvuso, passāmi sadevake loketiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhagavā tassa bādhanacittaṃ paṭisedhetvā pañhāpucchane ussāhaṃ janento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apica tvaṃ, āvuso, puccha, yadākaṅkhasī"
      },
      "ti. Tassattho – puccha, yadi ākāṅkhasi, na me pañhāvissajjane bhāro atthi. Atha vā puccha, yaṃ ākaṅkhasi. Sabbaṃ te vissajjessāmīti sabbaññupavāraṇaṃ pavāresi asādhāraṇaṃ paccekabuddhaaggasāvakamahāsāvakehi. Evaṃ bhagavato sabbaññupavāraṇāya pavāritāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atha kho āḷavako yakkho bhagavantaṃ gāthāya ajjhabhāsi"
      },
      "."
    ],
    "innerText": "Evaṃ bhagavā tassa bādhanacittaṃ paṭisedhetvā pañhāpucchane ussāhaṃ janento āha apica tvaṃ, āvuso, puccha, yadākaṅkhasīti. Tassattho – puccha, yadi ākāṅkhasi, na me pañhāvissajjane bhāro atthi. Atha vā puccha, yaṃ ākaṅkhasi. Sabbaṃ te vissajjessāmīti sabbaññupavāraṇaṃ pavāresi asādhāraṇaṃ paccekabuddhaaggasāvakamahāsāvakehi. Evaṃ bhagavato sabbaññupavāraṇāya pavāritāya atha kho āḷavako yakkho bhagavantaṃ gāthāya ajjhabhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiṃ sūdha vitta"
      },
      "nti, kiṃ su idha vittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitta"
      },
      "nti dhanaṃ. Taṃ hi pītisaṅkhātaṃ vittiṃ karoti, tasmā ‘‘vitta’’nti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suciṇṇa"
      },
      "nti sukataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukha"
      },
      "nti kāyikacetasikaṃ sātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvahātī"
      },
      "ti āvahati āneti deti appeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Have"
      },
      "-iti daḷhatthe nipāto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādutara"
      },
      "nti atisayena sādu. ‘‘Sādhutara’’ntipi pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rasāna"
      },
      "nti rasasaññitānaṃ dhammānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katha"
      },
      "nti kena pakārena. Kathaṃjīvino jīvitaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kathaṃjīviṃjīvitaṃ"
      },
      ". Gāthābandhasukhatthaṃ pana sānunāsikaṃ ",
      " vuccati. Kathaṃjīviṃ jīvatanti vā pāṭho, tassa ‘‘jīvantānaṃ kathaṃjīvi’’nti attho. Evaṃ imāya gāthāya ‘‘kiṃ su idha loke purisassa vittaṃ seṭṭhaṃ? Kiṃ su suciṇṇaṃ sukhamāvahāti? Kiṃ rasānaṃ sādutaraṃ? Kathaṃjīviṃ jīvitaṃ seṭṭhamāhū’’ti? Ime cattāro pañhe pucchi."
    ],
    "innerText": "Tattha kiṃ sūdha vittanti, kiṃ su idha vittaṃ. Vittanti dhanaṃ. Taṃ hi pītisaṅkhātaṃ vittiṃ karoti, tasmā ‘‘vitta’’nti vuccati. Suciṇṇanti sukataṃ. Sukhanti kāyikacetasikaṃ sātaṃ. Āvahātīti āvahati āneti deti appeti. Have-iti daḷhatthe nipāto. Sādutaranti atisayena sādu. ‘‘Sādhutara’’ntipi pāṭho. Rasānanti rasasaññitānaṃ dhammānaṃ. Kathanti kena pakārena. Kathaṃjīvino jīvitaṃ kathaṃjīviṃjīvitaṃ. Gāthābandhasukhatthaṃ pana sānunāsikaṃ vuccati. Kathaṃjīviṃ jīvatanti vā pāṭho, tassa ‘‘jīvantānaṃ kathaṃjīvi’’nti attho. Evaṃ imāya gāthāya ‘‘kiṃ su idha loke purisassa vittaṃ seṭṭhaṃ? Kiṃ su suciṇṇaṃ sukhamāvahāti? Kiṃ rasānaṃ sādutaraṃ? Kathaṃjīviṃ jīvitaṃ seṭṭhamāhū’’ti? Ime cattāro pañhe pucchi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassa bhagavā kassapadasabalena vissajjitanayeneva vissajjento imaṃ gāthamāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddhīdha vitta"
      },
      "nti. Tattha yathā hiraññasuvaṇṇādi vittaṃ upabhogasukhaṃ ",
      " āvahati, khuppipāsādidukkhaṃ paṭibāhati, dāliddiyaṃ vūpasameti, muttādiratanapaṭilābhahetu hoti, lokasantatiñca āvahati, evaṃ lokiyalokuttarā saddhāpi yathāsambhavaṃ lokiyalokuttaraṃ vipākaṃ sukhamāvahati, saddhādhurena paṭipannānaṃ jātijarādidukkhaṃ paṭibāhati, guṇadāliddiyaṃ vūpasameti, satisambojjhaṅgādiratanapaṭilābhahetu hoti."
    ],
    "innerText": "Athassa bhagavā kassapadasabalena vissajjitanayeneva vissajjento imaṃ gāthamāha saddhīdha vittanti. Tattha yathā hiraññasuvaṇṇādi vittaṃ upabhogasukhaṃ āvahati, khuppipāsādidukkhaṃ paṭibāhati, dāliddiyaṃ vūpasameti, muttādiratanapaṭilābhahetu hoti, lokasantatiñca āvahati, evaṃ lokiyalokuttarā saddhāpi yathāsambhavaṃ lokiyalokuttaraṃ vipākaṃ sukhamāvahati, saddhādhurena paṭipannānaṃ jātijarādidukkhaṃ paṭibāhati, guṇadāliddiyaṃ vūpasameti, satisambojjhaṅgādiratanapaṭilābhahetu hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Saddho ",
      " sīlena sampanno, yaso bhogasamappito;"
    ],
    "innerText": "‘‘Saddho sīlena sampanno, yaso bhogasamappito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yaṃ yaṃ padesaṃ bhajati, tattha tattheva pūjito’’ti. (dha. pa. 303) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Vacanato lokasantatiñca āvahatīti katvā ‘‘vitta’’nti vuttaṃ. Yasmā pana tesaṃ saddhāvittaṃ anugāmikaṃ anaññasādhāraṇaṃ sabbasampattihetu, lokiyassa hiraññasuvaṇṇādivittassāpi nidānaṃ. Saddhoyeva hi dānādīni puññāni katvā vittaṃ adhigacchati, assaddhassa pana vittaṃ yāvadeva anatthāya hoti, tasmā seṭṭhanti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purisassā"
      },
      "ti ukkaṭṭhaparicchedadesanā. Tasmā na kevalaṃ purisassa, itthiādīnampi saddhāvittameva seṭṭhanti veditabbaṃ."
    ],
    "innerText": "Vacanato lokasantatiñca āvahatīti katvā ‘‘vitta’’nti vuttaṃ. Yasmā pana tesaṃ saddhāvittaṃ anugāmikaṃ anaññasādhāraṇaṃ sabbasampattihetu, lokiyassa hiraññasuvaṇṇādivittassāpi nidānaṃ. Saddhoyeva hi dānādīni puññāni katvā vittaṃ adhigacchati, assaddhassa pana vittaṃ yāvadeva anatthāya hoti, tasmā seṭṭhanti vuttaṃ. Purisassāti ukkaṭṭhaparicchedadesanā. Tasmā na kevalaṃ purisassa, itthiādīnampi saddhāvittameva seṭṭhanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammo"
      },
      "ti dasakusaladhammo, dānasīlabhāvanādhammo vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suciṇṇo"
      },
      "ti sukato sucarito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhamāvahatī"
      },
      "ti soṇaseṭṭhiputtaraṭṭhapālādīnaṃ viya manussasukhaṃ, sakkādīnaṃ viya dibbasukhaṃ, pariyosāne mahāpadumādīnaṃ viya nibbānasukhañca āvahati."
    ],
    "innerText": "Dhammoti dasakusaladhammo, dānasīlabhāvanādhammo vā. Suciṇṇoti sukato sucarito. Sukhamāvahatīti soṇaseṭṭhiputtaraṭṭhapālādīnaṃ viya manussasukhaṃ, sakkādīnaṃ viya dibbasukhaṃ, pariyosāne mahāpadumādīnaṃ viya nibbānasukhañca āvahati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacca"
      },
      "nti ayaṃ saccasaddo anekesu atthesu dissati. Seyyathidaṃ – ‘‘saccaṃ bhaṇe na kujjheyyā ",
      "’’ tiādīsu (dha. pa. 224) vācāsacce. ‘‘Sacce ṭhitā samaṇabrāhmaṇā cā’’tiādīsu (jā. 2.21.433) viratisacce. ‘‘Kasmā nu saccāni vadanti nānā, pavādiyāse kusalā vadānā’’tiādīsu (su. ni. 891) diṭṭhisacce. ‘‘Cattārimāni, bhikkhave, brāhmaṇasaccānī’’tiādīsu (a. ni. 4.185) brāhmaṇasacce. ‘‘Ekaṃ hi saccaṃ na dutiyamatthī’’tiādīsu (su. ni. 890; mahāni. 119) paramatthasacce. ‘‘Catunnaṃ saccānaṃ kati kusalā’’tiādīsu (vibha. 216) ariyasacce. Idha pana paramatthasaccaṃ nibbānaṃ viratisaccañca abbhantaraṃ katvā ",
      " vācāsaccaṃ adhippetaṃ, yassānubhāvena udakādīni vase vattenti, jātijarāmaraṇapāraṃ taranti. Yathāha –"
    ],
    "innerText": "Saccanti ayaṃ saccasaddo anekesu atthesu dissati. Seyyathidaṃ – ‘‘saccaṃ bhaṇe na kujjheyyā ’’ tiādīsu (dha. pa. 224) vācāsacce. ‘‘Sacce ṭhitā samaṇabrāhmaṇā cā’’tiādīsu (jā. 2.21.433) viratisacce. ‘‘Kasmā nu saccāni vadanti nānā, pavādiyāse kusalā vadānā’’tiādīsu (su. ni. 891) diṭṭhisacce. ‘‘Cattārimāni, bhikkhave, brāhmaṇasaccānī’’tiādīsu (a. ni. 4.185) brāhmaṇasacce. ‘‘Ekaṃ hi saccaṃ na dutiyamatthī’’tiādīsu (su. ni. 890; mahāni. 119) paramatthasacce. ‘‘Catunnaṃ saccānaṃ kati kusalā’’tiādīsu (vibha. 216) ariyasacce. Idha pana paramatthasaccaṃ nibbānaṃ viratisaccañca abbhantaraṃ katvā vācāsaccaṃ adhippetaṃ, yassānubhāvena udakādīni vase vattenti, jātijarāmaraṇapāraṃ taranti. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Saccena vācenudakamhi dhāvati,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Visampi saccena hananti paṇḍitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Saccena devo thanayaṃ pavassati,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sace ṭhitā nibbutiṃ patthayanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Ye ",
      " kecime atthi rasā pathabyā,"
    ],
    "innerText": "‘‘Ye kecime atthi rasā pathabyā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Saccaṃ tesaṃ sādutaraṃ rasānaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Sacce ṭhitā samaṇabrāhmaṇā ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Taranti jātimaraṇassa pāra’’nti. (jā. 2.21.433);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādutara"
      },
      "nti madhurataraṃ paṇītataraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rasāna"
      },
      "nti ye ime ‘‘mūlaraso khandharaso’’tiādinā (dha. sa. 628-630) nayena sāyanīyadhammā, yecime ‘‘anujānāmi, bhikkhave, sabbaṃ phalarasaṃ (mahāva. 300), arasarūpo bhavaṃ gotamo, ye te, brāhmaṇa, rūparasā saddarasā (pārā. 3; a. ni. 8.11), anāpatti rasarase (pāci. 605-611), ayaṃ dhammavinayo ekaraso vimuttiraso (cūḷava. 385; a. ni. 8.19), bhāgī vā bhagavā attharasassa dhammarasassā’’tiādinā (mahāni. 149) nayena rūpācārarasupavajjā avasesā byañjanādayo ‘‘dhammarasā’’ti vuccanti ",
      ". Tesaṃ rasānaṃ saccaṃ have sādutaraṃ saccameva sādutaraṃ. Sādhutaraṃ vā, seṭṭhataraṃ, uttamataraṃ. Mūlarasādayo hi sarīramupabrūhenti, saṃkilesikañca sukhamāvahanti. Saccarase viratisaccavācāsaccarasā samathavipassanādīhi cittaṃ upabrūheti, asaṃkilesikañca sukhamāvahati. Vimuttiraso paramatthasaccarasaparibhāvitattā sādu, attharasadhammarasā ca tadadhigamūpāyabhūtaṃ atthañca dhammañca nissāya pavattitoti."
    ],
    "innerText": "Sādutaranti madhurataraṃ paṇītataraṃ. Rasānanti ye ime ‘‘mūlaraso khandharaso’’tiādinā (dha. sa. 628-630) nayena sāyanīyadhammā, yecime ‘‘anujānāmi, bhikkhave, sabbaṃ phalarasaṃ (mahāva. 300), arasarūpo bhavaṃ gotamo, ye te, brāhmaṇa, rūparasā saddarasā (pārā. 3; a. ni. 8.11), anāpatti rasarase (pāci. 605-611), ayaṃ dhammavinayo ekaraso vimuttiraso (cūḷava. 385; a. ni. 8.19), bhāgī vā bhagavā attharasassa dhammarasassā’’tiādinā (mahāni. 149) nayena rūpācārarasupavajjā avasesā byañjanādayo ‘‘dhammarasā’’ti vuccanti . Tesaṃ rasānaṃ saccaṃ have sādutaraṃ saccameva sādutaraṃ. Sādhutaraṃ vā, seṭṭhataraṃ, uttamataraṃ. Mūlarasādayo hi sarīramupabrūhenti, saṃkilesikañca sukhamāvahanti. Saccarase viratisaccavācāsaccarasā samathavipassanādīhi cittaṃ upabrūheti, asaṃkilesikañca sukhamāvahati. Vimuttiraso paramatthasaccarasaparibhāvitattā sādu, attharasadhammarasā ca tadadhigamūpāyabhūtaṃ atthañca dhammañca nissāya pavattitoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññājīviṃjīvita"
      },
      "nti ettha pana yvāyaṃ andhekacakkhudvicakkhukesu dvicakkhupuggalo gahaṭṭho vā kammantānuṭṭhāna-saraṇagamanadāna-saṃvibhāga-sīlasamādānuposathakammādi gahaṭṭhapaṭipadaṃ, pabbajito vā avippaṭisārakarasīlasaṅkhātaṃ taduttaricittavisuddhiādibhedampi pabbajitapaṭipadaṃ paññāya ārādhetvā jīvati, tassa ",
      " paññāya jīvino jīvitaṃ, taṃ vā paññājīvitaṃ seṭṭhamāhūti evamattho daṭṭhabbo."
    ],
    "innerText": "Paññājīviṃjīvitanti ettha pana yvāyaṃ andhekacakkhudvicakkhukesu dvicakkhupuggalo gahaṭṭho vā kammantānuṭṭhāna-saraṇagamanadāna-saṃvibhāga-sīlasamādānuposathakammādi gahaṭṭhapaṭipadaṃ, pabbajito vā avippaṭisārakarasīlasaṅkhātaṃ taduttaricittavisuddhiādibhedampi pabbajitapaṭipadaṃ paññāya ārādhetvā jīvati, tassa paññāya jīvino jīvitaṃ, taṃ vā paññājīvitaṃ seṭṭhamāhūti evamattho daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhagavatā vissajjite cattāropi pañhe sutvā attamano yakkho avasesepi cattāro pañhe pucchanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kathaṃsu tarati ogha"
      },
      "nti gāthamāha. Athassa bhagavā purimanayeneva vissajjento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddhāya taratī"
      },
      "ti gāthamāha. Tattha kiñcāpi yo catubbidhamoghaṃ tarati, so saṃsāraṇṇavampi tarati, vaṭṭadukkhampi acceti, kilesamalāpi parisujjhati, evaṃ santepi pana yasmā assaddho oghataraṇaṃ asaddahanto na pakkhandati, pañcasu kāmaguṇesu cittavossaggena pamatto ",
      " tattheva visattattā saṃsāraṇṇavaṃ na tarati, kusīto dukkhaṃ viharati vokiṇṇo akusalehi dhammehi, appañño suddhimaggaṃ ajānanto na parisujjhati, tasmā tappaṭipakkhaṃ dassentena bhagavatā ayaṃ gāthā vuttā."
    ],
    "innerText": "Evaṃ bhagavatā vissajjite cattāropi pañhe sutvā attamano yakkho avasesepi cattāro pañhe pucchanto kathaṃsu tarati oghanti gāthamāha. Athassa bhagavā purimanayeneva vissajjento saddhāya taratīti gāthamāha. Tattha kiñcāpi yo catubbidhamoghaṃ tarati, so saṃsāraṇṇavampi tarati, vaṭṭadukkhampi acceti, kilesamalāpi parisujjhati, evaṃ santepi pana yasmā assaddho oghataraṇaṃ asaddahanto na pakkhandati, pañcasu kāmaguṇesu cittavossaggena pamatto tattheva visattattā saṃsāraṇṇavaṃ na tarati, kusīto dukkhaṃ viharati vokiṇṇo akusalehi dhammehi, appañño suddhimaggaṃ ajānanto na parisujjhati, tasmā tappaṭipakkhaṃ dassentena bhagavatā ayaṃ gāthā vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vuttāya cetāya yasmā sotāpattiyaṅgapadaṭṭhānaṃ saddhindriyaṃ, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddhāya tarati ogha"
      },
      "nti iminā padena diṭṭhoghataraṇaṃ sotāpattimaggaṃ sotāpannañca pakāseti. Yasmā pana sotāpanno kusalānaṃ dhammānaṃ bhāvanāya sātaccakiriyasaṅkhatena appamādena samannāgato dutiyamaggaṃ ārādhetvā ṭhapetvā sakidevimaṃ ",
      " lokaṃ āgamanamaggaṃ avasesaṃ sotāpattimaggena atiṇṇaṃ bhavoghavatthuṃ saṃsāraṇṇavaṃ tarati, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appamādena aṇṇava"
      },
      "nti iminā padena bhavoghataraṇaṃ sakadāgāmimaggaṃ sakadāgāmiñca pakāseti. Yasmā ca sakadāgāmī vīriyena tatiyamaggaṃ ārādhetvā sakadāgāmimaggena anatītaṃ kāmoghavatthuṃ kāmoghasaññitañca kāmadukkhamacceti, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vīriyena dukkhamaccetī"
      },
      "ti iminā padena kāmoghataraṇaṃ anāgāmimaggaṃ anāgāmiñca pakāseti. Yasmā pana anāgāmī vigatakāmasaññāya parisuddhāya paññāya ekantaparisuddhaṃ catutthamaggapaññaṃ ārādhetvā anāgāmimaggena appahīnaṃ avijjāsaṅkhātaṃ paramamalaṃ pajahati, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāya parisujjhatī"
      },
      "ti, iminā padena avijjoghataraṇaṃ arahattamaggañca arahattañca pakāseti. Imāya ca arahattanikūṭena kathitāya gāthāya pariyosāne yakkho sotāpattiphale patiṭṭhāsi."
    ],
    "innerText": "Evaṃ vuttāya cetāya yasmā sotāpattiyaṅgapadaṭṭhānaṃ saddhindriyaṃ, tasmā saddhāya tarati oghanti iminā padena diṭṭhoghataraṇaṃ sotāpattimaggaṃ sotāpannañca pakāseti. Yasmā pana sotāpanno kusalānaṃ dhammānaṃ bhāvanāya sātaccakiriyasaṅkhatena appamādena samannāgato dutiyamaggaṃ ārādhetvā ṭhapetvā sakidevimaṃ lokaṃ āgamanamaggaṃ avasesaṃ sotāpattimaggena atiṇṇaṃ bhavoghavatthuṃ saṃsāraṇṇavaṃ tarati, tasmā appamādena aṇṇavanti iminā padena bhavoghataraṇaṃ sakadāgāmimaggaṃ sakadāgāmiñca pakāseti. Yasmā ca sakadāgāmī vīriyena tatiyamaggaṃ ārādhetvā sakadāgāmimaggena anatītaṃ kāmoghavatthuṃ kāmoghasaññitañca kāmadukkhamacceti, tasmā vīriyena dukkhamaccetīti iminā padena kāmoghataraṇaṃ anāgāmimaggaṃ anāgāmiñca pakāseti. Yasmā pana anāgāmī vigatakāmasaññāya parisuddhāya paññāya ekantaparisuddhaṃ catutthamaggapaññaṃ ārādhetvā anāgāmimaggena appahīnaṃ avijjāsaṅkhātaṃ paramamalaṃ pajahati, tasmā paññāya parisujjhatīti, iminā padena avijjoghataraṇaṃ arahattamaggañca arahattañca pakāseti. Imāya ca arahattanikūṭena kathitāya gāthāya pariyosāne yakkho sotāpattiphale patiṭṭhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " tameva ‘‘paññāya parisujjhatī’’ti ettha vuttaṃ paññāpadaṃ gahetvā attano paṭibhānena lokiyalokuttaramissakaṃ pañhaṃ pucchanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kathaṃsu labhate pañña"
      },
      "nti imaṃ chappadaṃ gāthamāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kathaṃsū"
      },
      "ti sabbattheva atthayuttipucchā honti. Ayaṃ hi paññādiatthaṃ ñatvā tassa yuttiṃ pucchati – ‘‘kathaṃ, kāya yuttiyā, kena kāraṇena paññaṃ labhatī’’ti? Esa nayo dhanādīsu."
    ],
    "innerText": "Idāni tameva ‘‘paññāya parisujjhatī’’ti ettha vuttaṃ paññāpadaṃ gahetvā attano paṭibhānena lokiyalokuttaramissakaṃ pañhaṃ pucchanto kathaṃsu labhate paññanti imaṃ chappadaṃ gāthamāha. Tattha kathaṃsūti sabbattheva atthayuttipucchā honti. Ayaṃ hi paññādiatthaṃ ñatvā tassa yuttiṃ pucchati – ‘‘kathaṃ, kāya yuttiyā, kena kāraṇena paññaṃ labhatī’’ti? Esa nayo dhanādīsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassa bhagavā catūhi kāraṇehi paññālābhaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddahāno"
      },
      "tiādimāha. Tassattho – yena pubbabhāge kāyasucaritādibhedena aparabhāge ca sattatiṃsabodhipakkhiyabhedena dhammena arahanto buddhapaccekabuddhasāvakā nibbānaṃ pattā, taṃ saddahāno arahataṃ dhammaṃ nibbānapattiyā lokiyalokuttarapaññaṃ labhati, tañca kho na saddhāmattakeneva. Yasmā pana saddhājāto upasaṅkamati ",
      ", upasaṅkamanto payirupāsati, payirupāsanto sotaṃ odahati, ohitasoto dhammaṃ suṇāti, tasmā upasaṅkamanato pabhuti yāva dhammassavanena sussūsaṃ labhati. Kiṃ vuttaṃ hoti – taṃ dhammaṃ saddahitvāpi ācariyupajjhāye kālena upasaṅkamitvā ",
      " vattakaraṇena payirupāsitvā yadā payirupāsanāya ārādhitacittā kiñci vattukāmā honti. Atha adhigatāya sotukāmatāya sotaṃ odahitvā suṇanto labhatīti. Evaṃ sussūsampi ca satiavippavāsena appamatto subhāsitadubbhāsitaññutāya vicakkhaṇo eva labhati, na itaro. Tenāha ‘‘appamatto vicakkhaṇo’’ti."
    ],
    "innerText": "Athassa bhagavā catūhi kāraṇehi paññālābhaṃ dassento saddahānotiādimāha. Tassattho – yena pubbabhāge kāyasucaritādibhedena aparabhāge ca sattatiṃsabodhipakkhiyabhedena dhammena arahanto buddhapaccekabuddhasāvakā nibbānaṃ pattā, taṃ saddahāno arahataṃ dhammaṃ nibbānapattiyā lokiyalokuttarapaññaṃ labhati, tañca kho na saddhāmattakeneva. Yasmā pana saddhājāto upasaṅkamati , upasaṅkamanto payirupāsati, payirupāsanto sotaṃ odahati, ohitasoto dhammaṃ suṇāti, tasmā upasaṅkamanato pabhuti yāva dhammassavanena sussūsaṃ labhati. Kiṃ vuttaṃ hoti – taṃ dhammaṃ saddahitvāpi ācariyupajjhāye kālena upasaṅkamitvā vattakaraṇena payirupāsitvā yadā payirupāsanāya ārādhitacittā kiñci vattukāmā honti. Atha adhigatāya sotukāmatāya sotaṃ odahitvā suṇanto labhatīti. Evaṃ sussūsampi ca satiavippavāsena appamatto subhāsitadubbhāsitaññutāya vicakkhaṇo eva labhati, na itaro. Tenāha ‘‘appamatto vicakkhaṇo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ yasmā saddhāya paññalābhasaṃvattanikaṃ paṭipadaṃ paṭipajjati, sussūsāya sakkaccaṃ paññādhigamūpāyaṃ suṇāti, appamādena gahitaṃ na pamussati. Vicakkhaṇatāya anūnādhikaṃ aviparītañca gahetvā vitthārikaṃ karoti. Sussūsāya vā ohitasoto paññāpaṭilābhahetuṃ dhammaṃ suṇāti, appamādena sutadhammaṃ dhāreti, vicakkhaṇatāya dhatānaṃ dhammānaṃ atthamupaparikkhati, athānupubbena paramatthasaccaṃ sacchikaroti, tasmāssa bhagavā ‘‘kathaṃsu labhate pañña’’nti puṭṭho imāni cattāri kāraṇāni dassento imaṃ gāthamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " tato pare tayo pañhe vissajjento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "patirūpakārī"
      },
      "ti imaṃ gāthamāha. Tattha desakālādīni ahāpetvā lokiyassa lokuttarassa vā dhanassa patirūpaṃ adhigamūpāyaṃ karotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "patirūpakārī. Dhuravā"
      },
      "ti cetasikavīriyavasena anikkhittadhuro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uṭṭhātā"
      },
      "ti, ‘‘yo ca sītañca uṇhañca, tiṇā bhiyyo na maññatī’’tiādinā (theragā. 232) nayena kāyikavīrīyavasena uṭṭhānasampanno asithilaparakkamo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vindate dhana"
      },
      "nti ekamūsikāya nacirasseva catusatasahassasaṅkhaṃ cūḷantevāsī viya lokiyadhanañca, mahallakamahātissatthero viya lokuttaradhanañca labhati. So ‘‘tīhiyeva iriyāpathehi viharissāmī’’ti vattaṃ katvā thinamiddhāgamanavelāya palālacumbaṭakaṃ temetvā sīse katvā galappamāṇaṃ udakaṃ pavisitvā thinamiddhaṃ paṭibāhanto dasahi vassehi arahattaṃ ",
      " pāpuṇi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saccenā"
      },
      "ti vacīsaccenāpi ‘‘saccavādī bhūtavādī’’ti, paramatthasaccenāpi ‘‘buddho paccekabuddho ariyasāvako’’ti evaṃ kittiṃ pappoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dada"
      },
      "nti yaṃkiñci icchitapatthitaṃ dadanto mittāni ganthati, sampādeti karotīti attho. Duddadaṃ vā dadaṃ taṃ ganthati. Dānamukhena vā cattāripi saṅgahavatthūni gahitānīti veditabbāni, tehi mittāni karotīti vuttaṃ hoti."
    ],
    "innerText": "Idāni tato pare tayo pañhe vissajjento patirūpakārīti imaṃ gāthamāha. Tattha desakālādīni ahāpetvā lokiyassa lokuttarassa vā dhanassa patirūpaṃ adhigamūpāyaṃ karotīti patirūpakārī. Dhuravāti cetasikavīriyavasena anikkhittadhuro. Uṭṭhātāti, ‘‘yo ca sītañca uṇhañca, tiṇā bhiyyo na maññatī’’tiādinā (theragā. 232) nayena kāyikavīrīyavasena uṭṭhānasampanno asithilaparakkamo. Vindate dhananti ekamūsikāya nacirasseva catusatasahassasaṅkhaṃ cūḷantevāsī viya lokiyadhanañca, mahallakamahātissatthero viya lokuttaradhanañca labhati. So ‘‘tīhiyeva iriyāpathehi viharissāmī’’ti vattaṃ katvā thinamiddhāgamanavelāya palālacumbaṭakaṃ temetvā sīse katvā galappamāṇaṃ udakaṃ pavisitvā thinamiddhaṃ paṭibāhanto dasahi vassehi arahattaṃ pāpuṇi. Saccenāti vacīsaccenāpi ‘‘saccavādī bhūtavādī’’ti, paramatthasaccenāpi ‘‘buddho paccekabuddho ariyasāvako’’ti evaṃ kittiṃ pappoti. Dadanti yaṃkiñci icchitapatthitaṃ dadanto mittāni ganthati, sampādeti karotīti attho. Duddadaṃ vā dadaṃ taṃ ganthati. Dānamukhena vā cattāripi saṅgahavatthūni gahitānīti veditabbāni, tehi mittāni karotīti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " gahaṭṭhapabbajitānaṃ sādhāraṇena lokiyalokuttaramissakena nayena cattāro pañhe vissajjetvā idāni ‘‘kathaṃ pecca na socatī’’ti imaṃ pañcamaṃ pañhaṃ gahaṭṭhavasena vissajjento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yassete"
      },
      "tiādīmāha. Tassattho – yassa ‘‘saddahāno arahata’’nti ettha vuttāya sabbakalyāṇadhammuppādikāya saddhāya samannāgatattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddhassa, gharamesino"
      },
      "ti gharāvāsaṃ pañca vā kāmaguṇe esantassa gavesantassa kāmabhogino gahaṭṭhassa ‘‘saccena kittiṃ pappotī’’ti ettha vuttappakāraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saccaṃ"
      },
      ". ‘‘Sussūsaṃ labhate pañña’’nti ettha sussūsapaññānāmena vuttova ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "damo"
      },
      ". ‘‘Dhuravā uṭṭhātā’’ti ettha dhuranāmena uṭṭhānanāmena ca vuttā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhiti"
      },
      ". ‘‘Dadaṃ mittāni ganthatī’’ti ettha vuttappakāro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cāgo"
      },
      " cāti ete caturo dhammā santi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sa ve pecca na socatī"
      },
      "ti idhalokā paralokaṃ gantvā sa ve na socatīti."
    ],
    "innerText": "Evaṃ gahaṭṭhapabbajitānaṃ sādhāraṇena lokiyalokuttaramissakena nayena cattāro pañhe vissajjetvā idāni ‘‘kathaṃ pecca na socatī’’ti imaṃ pañcamaṃ pañhaṃ gahaṭṭhavasena vissajjento yassetetiādīmāha. Tassattho – yassa ‘‘saddahāno arahata’’nti ettha vuttāya sabbakalyāṇadhammuppādikāya saddhāya samannāgatattā saddhassa, gharamesinoti gharāvāsaṃ pañca vā kāmaguṇe esantassa gavesantassa kāmabhogino gahaṭṭhassa ‘‘saccena kittiṃ pappotī’’ti ettha vuttappakāraṃ saccaṃ. ‘‘Sussūsaṃ labhate pañña’’nti ettha sussūsapaññānāmena vuttova damo. ‘‘Dhuravā uṭṭhātā’’ti ettha dhuranāmena uṭṭhānanāmena ca vuttā dhiti. ‘‘Dadaṃ mittāni ganthatī’’ti ettha vuttappakāro cāgo cāti ete caturo dhammā santi. Sa ve pecca na socatīti idhalokā paralokaṃ gantvā sa ve na socatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " bhagavā pañcamampi pañhaṃ vissajjetvā taṃ yakkhaṃ codento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iṅgha aññepī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iṅghā"
      },
      "ti codanatthe nipāto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññepī"
      },
      "ti aññepi dhamme puthū samaṇabrāhmaṇe pucchassu. Aññepi vā pūraṇādayo sabbaññupaṭiññe puthū samaṇabrāhmaṇe pucchassu. Yadi amhehi ‘‘saccena kittiṃ pappotī’’ti ettha vuttappakārā saccā bhiyyo kittippattikāraṇaṃ vā, ‘‘sussūsaṃ labhate pañña’’nti ettha sussūsāti paññāpadesena vuttā dammā bhiyyo ",
      " lokiyalokuttarapaññāpaṭilābhakāraṇaṃ vā, ‘‘dadaṃ mittāni ganthatī’’ti ettha vuttappakārā cāgā bhiyyo mittaganthanakāraṇaṃ vā, ‘‘dhuravā uṭṭhātā’’ti ettha taṃ taṃ atthavasaṃ paṭicca dhuranāmena uṭṭhānanāmena ca vuttāya mahābhārasahanatthena ussoḷhibhāvappattāya vīriyasaṅkhātāya khantyā bhiyyo lokiyalokuttaradhanavindanakāraṇaṃ vā, ‘‘saccaṃ dammo dhiti cāgo’’ti evaṃ vuttehi imeheva catūhi dhammehi bhiyyo asmā lokā paraṃ lokaṃ pecca asocanakāraṇaṃ vā idha vijjatīti ayamettha saddhiṃ saṅkhepayojanāya atthavaṇṇanā. Vitthārato pana ekamekaṃ padaṃ atthuddhārapaduddhārapadavaṇṇanānayehi vibhajitvā veditabbā."
    ],
    "innerText": "Evaṃ bhagavā pañcamampi pañhaṃ vissajjetvā taṃ yakkhaṃ codento iṅgha aññepītiādimāha. Tattha iṅghāti codanatthe nipāto. Aññepīti aññepi dhamme puthū samaṇabrāhmaṇe pucchassu. Aññepi vā pūraṇādayo sabbaññupaṭiññe puthū samaṇabrāhmaṇe pucchassu. Yadi amhehi ‘‘saccena kittiṃ pappotī’’ti ettha vuttappakārā saccā bhiyyo kittippattikāraṇaṃ vā, ‘‘sussūsaṃ labhate pañña’’nti ettha sussūsāti paññāpadesena vuttā dammā bhiyyo lokiyalokuttarapaññāpaṭilābhakāraṇaṃ vā, ‘‘dadaṃ mittāni ganthatī’’ti ettha vuttappakārā cāgā bhiyyo mittaganthanakāraṇaṃ vā, ‘‘dhuravā uṭṭhātā’’ti ettha taṃ taṃ atthavasaṃ paṭicca dhuranāmena uṭṭhānanāmena ca vuttāya mahābhārasahanatthena ussoḷhibhāvappattāya vīriyasaṅkhātāya khantyā bhiyyo lokiyalokuttaradhanavindanakāraṇaṃ vā, ‘‘saccaṃ dammo dhiti cāgo’’ti evaṃ vuttehi imeheva catūhi dhammehi bhiyyo asmā lokā paraṃ lokaṃ pecca asocanakāraṇaṃ vā idha vijjatīti ayamettha saddhiṃ saṅkhepayojanāya atthavaṇṇanā. Vitthārato pana ekamekaṃ padaṃ atthuddhārapaduddhārapadavaṇṇanānayehi vibhajitvā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vutte yakkho yena saṃsayena aññe puccheyya, tassa pahīnattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kathaṃ nu dāni puccheyyaṃ, puthū samaṇabrāhmaṇe"
      },
      "ti vatvā yepissa apucchanakāraṇaṃ na jānanti, tepi jānāpento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yohaṃ ajjapajānāmi, yo attho samparāyiko"
      },
      "ti āha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjā"
      },
      "ti ajjādiṃ katvāti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pajānāmī"
      },
      "ti yathāvuttena pakārena jānāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo attho"
      },
      "ti ettāvatā ‘‘sussūsaṃ labhate pañña’’ntiādinā nayena vuttaṃ diṭṭhadhammikaṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samparāyiko"
      },
      "ti iminā ‘‘yassete caturo ",
      " dhammā’’ti vuttaṃ pecca sokābhāvakāraṇaṃ samparāyikaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attho"
      },
      "ti ca kāraṇassetaṃ adhivacanaṃ. Ayaṃ hi atthasaddo ‘‘sātthaṃ sabyañjana’’nti evamādīsu (pārā. 1; dī. ni. 1.255) pāṭhatthe vattati. ‘‘Attho me, gahapati, hiraññasuvaṇṇenā’’tiādīsu (dī. ni. 2.250; ma. ni. 3.258) vicakkhaṇe. ‘‘Hoti sīlavataṃ attho’’tiādīsu (jā. 1.1.11) vuḍḍhimhi. ‘‘Bahujano bhajate atthahetū’’tiādīsu dhane. ‘‘Ubhinnamatthaṃ caratī’’tiādīsu (jā. 1.7.66; saṃ. ni. 1.250; theragā. 443) hite ",
      ". ‘‘Atthe jāte ca paṇḍita’’ntiādīsu (jā. 1.1.92) kāraṇe. Idha pana kāraṇe. Tasmā yaṃ paññādilābhādīnaṃ kāraṇaṃ diṭṭhadhammikaṃ, yañca pecca sokābhāvassa kāraṇaṃ samparāyikaṃ, taṃ yohaṃ ajja bhagavatā vuttanayena ",
      " sāmaṃyeva pajānāmi, so kathaṃ nu dāni puccheyyaṃ puthū samaṇabrāhmaṇeti evamettha saṅkhepato attho veditabbo."
    ],
    "innerText": "Evaṃ vutte yakkho yena saṃsayena aññe puccheyya, tassa pahīnattā kathaṃ nu dāni puccheyyaṃ, puthū samaṇabrāhmaṇeti vatvā yepissa apucchanakāraṇaṃ na jānanti, tepi jānāpento yohaṃ ajjapajānāmi, yo attho samparāyikoti āha. Tattha ajjāti ajjādiṃ katvāti adhippāyo. Pajānāmīti yathāvuttena pakārena jānāmi. Yo atthoti ettāvatā ‘‘sussūsaṃ labhate pañña’’ntiādinā nayena vuttaṃ diṭṭhadhammikaṃ dasseti. Samparāyikoti iminā ‘‘yassete caturo dhammā’’ti vuttaṃ pecca sokābhāvakāraṇaṃ samparāyikaṃ. Atthoti ca kāraṇassetaṃ adhivacanaṃ. Ayaṃ hi atthasaddo ‘‘sātthaṃ sabyañjana’’nti evamādīsu (pārā. 1; dī. ni. 1.255) pāṭhatthe vattati. ‘‘Attho me, gahapati, hiraññasuvaṇṇenā’’tiādīsu (dī. ni. 2.250; ma. ni. 3.258) vicakkhaṇe. ‘‘Hoti sīlavataṃ attho’’tiādīsu (jā. 1.1.11) vuḍḍhimhi. ‘‘Bahujano bhajate atthahetū’’tiādīsu dhane. ‘‘Ubhinnamatthaṃ caratī’’tiādīsu (jā. 1.7.66; saṃ. ni. 1.250; theragā. 443) hite . ‘‘Atthe jāte ca paṇḍita’’ntiādīsu (jā. 1.1.92) kāraṇe. Idha pana kāraṇe. Tasmā yaṃ paññādilābhādīnaṃ kāraṇaṃ diṭṭhadhammikaṃ, yañca pecca sokābhāvassa kāraṇaṃ samparāyikaṃ, taṃ yohaṃ ajja bhagavatā vuttanayena sāmaṃyeva pajānāmi, so kathaṃ nu dāni puccheyyaṃ puthū samaṇabrāhmaṇeti evamettha saṅkhepato attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ yakkho ‘‘pajānāmi yo attho samparāyiko’’ti vatvā tassa ñāṇassa bhagavaṃmūlakattaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthāya vata me buddho"
      },
      "ti āha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthāyā"
      },
      "ti hitāya vuḍḍhiyā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yattha dinnaṃ mahapphala"
      },
      "nti ‘‘yassete caturo dhammā’’ti ettha vuttacāgena yattha dinnaṃ mahapphalaṃ, taṃ aggadakkhiṇeyyaṃ buddhaṃ pajānāmīti attho. Keci pana ‘‘saṅghaṃ sandhāya evamāhā’’ti bhaṇanti."
    ],
    "innerText": "Evaṃ yakkho ‘‘pajānāmi yo attho samparāyiko’’ti vatvā tassa ñāṇassa bhagavaṃmūlakattaṃ dassento atthāya vata me buddhoti āha. Tattha atthāyāti hitāya vuḍḍhiyā ca. Yattha dinnaṃ mahapphalanti ‘‘yassete caturo dhammā’’ti ettha vuttacāgena yattha dinnaṃ mahapphalaṃ, taṃ aggadakkhiṇeyyaṃ buddhaṃ pajānāmīti attho. Keci pana ‘‘saṅghaṃ sandhāya evamāhā’’ti bhaṇanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ imāya gāthāya attano hitādhigamaṃ dassetvā idāni sahitapaṭipattiṃ dīpento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "so ahaṃ vicarissāmī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gāmā gāma"
      },
      "nti devagāmā devagāmaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purā pura"
      },
      "nti devanagarato devanagaraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Namassamāno sambuddhaṃ, dhammassa ca sudhammata"
      },
      "nti ‘‘sammāsambuddho vata bhagavā, svākkhāto vata bhagavato dhammo’’tiādinā nayena buddhasubodhitañca dhammasudhammatañca ca-saddena ‘‘suppaṭipanno vata bhagavato sāvakasaṅgho’’tiādinā saṅghasuppaṭipattiñca abhitthavitvā namassamāno dhammaghosako hutvā vicarissāmīti vuttaṃ hoti."
    ],
    "innerText": "Evaṃ imāya gāthāya attano hitādhigamaṃ dassetvā idāni sahitapaṭipattiṃ dīpento so ahaṃ vicarissāmītiādimāha. Tattha gāmā gāmanti devagāmā devagāmaṃ. Purā puranti devanagarato devanagaraṃ. Namassamāno sambuddhaṃ, dhammassa ca sudhammatanti ‘‘sammāsambuddho vata bhagavā, svākkhāto vata bhagavato dhammo’’tiādinā nayena buddhasubodhitañca dhammasudhammatañca ca-saddena ‘‘suppaṭipanno vata bhagavato sāvakasaṅgho’’tiādinā saṅghasuppaṭipattiñca abhitthavitvā namassamāno dhammaghosako hutvā vicarissāmīti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evamimāya gāthāya pariyosānañca rattivibhāvanañca sādhukārasadduṭṭhānañca āḷavakakumārassa yakkhabhavanaṃ ānayanañca ekakkhaṇeyeva ahosi. Rājapurisā sādhukārasaddaṃ sutvā – ‘‘evarūpo sādhukārasaddo ṭhapetvā buddhe na aññesaṃ abbhuggacchati, āgato nu kho bhagavā’’ti āvajjentā bhagavato sarīrappabhaṃ disvā pubbe viya bahi aṭṭhatvā nibbisaṅkā antoyeva pavisitvā addasaṃsu bhagavantaṃ yakkhassa bhavane nisinnaṃ, yakkhañca añjaliṃ paggahetvā ",
      " ṭhitaṃ. Disvāna yakkhaṃ āhaṃsu – ‘‘ayaṃ te, mahāyakkha, rājakumāro balikammāya ānīto, handa naṃ khāda vā bhuñja vā, yathāpaccayaṃ vā karohī’’ti. So sotāpannattā lajjito visesena ",
      " ca bhagavato purato evaṃ vuccamāno atha taṃ kumāraṃ ubhohi hatthehi paṭiggahetvā bhagavato ",
      " upanāmesi ‘‘ayaṃ, bhante, kumāro mayhaṃ pesito, imāhaṃ bhagavato dammi, hitānukampakā buddhā, paṭiggaṇhātu, bhante, bhagavā imaṃ dārakaṃ imassa hitatthāya sukhatthāyā’’ti imañca gāthamāha –"
    ],
    "innerText": "Evamimāya gāthāya pariyosānañca rattivibhāvanañca sādhukārasadduṭṭhānañca āḷavakakumārassa yakkhabhavanaṃ ānayanañca ekakkhaṇeyeva ahosi. Rājapurisā sādhukārasaddaṃ sutvā – ‘‘evarūpo sādhukārasaddo ṭhapetvā buddhe na aññesaṃ abbhuggacchati, āgato nu kho bhagavā’’ti āvajjentā bhagavato sarīrappabhaṃ disvā pubbe viya bahi aṭṭhatvā nibbisaṅkā antoyeva pavisitvā addasaṃsu bhagavantaṃ yakkhassa bhavane nisinnaṃ, yakkhañca añjaliṃ paggahetvā ṭhitaṃ. Disvāna yakkhaṃ āhaṃsu – ‘‘ayaṃ te, mahāyakkha, rājakumāro balikammāya ānīto, handa naṃ khāda vā bhuñja vā, yathāpaccayaṃ vā karohī’’ti. So sotāpannattā lajjito visesena ca bhagavato purato evaṃ vuccamāno atha taṃ kumāraṃ ubhohi hatthehi paṭiggahetvā bhagavato upanāmesi ‘‘ayaṃ, bhante, kumāro mayhaṃ pesito, imāhaṃ bhagavato dammi, hitānukampakā buddhā, paṭiggaṇhātu, bhante, bhagavā imaṃ dārakaṃ imassa hitatthāya sukhatthāyā’’ti imañca gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Imaṃ kumāraṃ satapuññalakkhaṇaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sabbaṅgupetaṃ paripuṇṇabyañjanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Udaggacitto sumano dadāmi te,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paṭiggaha lokahitāya cakkhumā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paṭiggahesi bhagavā kumāraṃ. Paṭiggaṇhanto ca yakkhassa ca kumārassa ca maṅgalakaraṇatthaṃ pādūnagāthaṃ abhāsi. Taṃ yakkho kumāraṃ saraṇaṃ gamento tikkhattuṃ catutthapādena pūresi. Seyyathidaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dīghāyuko hotu ayaṃ kumāro,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Tuvañca yakkha sukhito bhavāhi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Abyādhitā lokahitāya tiṭṭhatha,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Ayaṃ kumāro saraṇamupeti buddhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Ayaṃ kumāro saraṇamupeti dhammaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ayaṃ kumāro saraṇamupeti saṅgha’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha bhagavā kumāraṃ rājapurisānaṃ adāsi – ‘‘imaṃ vaḍḍhetvā puna mameva dethā’’ti. Evaṃ so kumāro rājapurisānaṃ hatthato yakkhassa hatthaṃ, yakkhassa hatthato bhagavato hatthaṃ, bhagavato hatthato puna rājapurisānaṃ hatthaṃ gatattā nāmato ‘‘hatthako āḷavako’’ti jāto. Taṃ ādāya paṭinivatte rājapurise disvā kassakavanakammikādayo ‘‘kiṃ yakkho kumāraṃ atidaharattā na icchī’’ti? Bhītā pucchiṃsu. Rājapurisā ‘‘mā bhāyatha. Khemaṃ kataṃ bhagavatā’’ti sabbamārocesuṃ ",
      ". Tato ‘‘sādhu sādhū’’ti sakalaṃ āḷavinagaraṃ ekakolāhalena yakkhābhimukhaṃ ahosi. Yakkhopi bhagavato bhikkhācārakāle anuppatte pattacīvaraṃ gahetvā upaḍḍhamaggaṃ anugantvā nivatti."
    ],
    "innerText": "Atha bhagavā kumāraṃ rājapurisānaṃ adāsi – ‘‘imaṃ vaḍḍhetvā puna mameva dethā’’ti. Evaṃ so kumāro rājapurisānaṃ hatthato yakkhassa hatthaṃ, yakkhassa hatthato bhagavato hatthaṃ, bhagavato hatthato puna rājapurisānaṃ hatthaṃ gatattā nāmato ‘‘hatthako āḷavako’’ti jāto. Taṃ ādāya paṭinivatte rājapurise disvā kassakavanakammikādayo ‘‘kiṃ yakkho kumāraṃ atidaharattā na icchī’’ti? Bhītā pucchiṃsu. Rājapurisā ‘‘mā bhāyatha. Khemaṃ kataṃ bhagavatā’’ti sabbamārocesuṃ . Tato ‘‘sādhu sādhū’’ti sakalaṃ āḷavinagaraṃ ekakolāhalena yakkhābhimukhaṃ ahosi. Yakkhopi bhagavato bhikkhācārakāle anuppatte pattacīvaraṃ gahetvā upaḍḍhamaggaṃ anugantvā nivatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha bhagavā nagare piṇḍāya caritvā katabhattakicco nagaradvāre aññatarasmiṃ vivitte rukkhamūle paññattabuddhāsane nisīdi. Tato mahājanakāyena saddhiṃ rājā ca nāgarā ca ekato sampiṇḍitvā bhagavantaṃ upasaṅkamma ",
      " vanditvā parivāretvā ",
      " nisinnā – ‘‘kathaṃ, bhante, evaṃ dāruṇaṃ yakkhaṃ damayitthā’’ti pucchiṃsu. Tesaṃ bhagavā yuddhamādiṃ katvā ‘‘evaṃ navavidhaṃ vassaṃ vassetvā evaṃ vibhiṃsanakaṃ akāsi, evaṃ pañhaṃ pucchi. Tassāhaṃ evaṃ vissajjesi’’nti tamevāḷavakasuttaṃ kathesi. Kathāpariyosāne caturāsītipāṇasahassānaṃ dhammābhisamayo ahosi. Tato rājā ceva nāgarā ca vessavaṇamahārājassa bhavanasamīpe yakkhassa bhavanaṃ katvā pupphagandhādisakkārupetaṃ niccabaliṃ pavattesuṃ. Tañca kumāraṃ viññutaṃ pattaṃ ‘‘tvaṃ bhagavantaṃ nissāya jīvitaṃ labhi, gaccha bhagavantaṃyeva payirupāsassu bhikkhusaṅghañcā’’ti vissajjesuṃ. So bhagavantañca bhikkhusaṅghañca payirupāsamāno nacirasseva anāgāmiphale patiṭṭhāya sabbaṃ buddhavacanaṃ uggahetvā pañcasataupāsakaparivāro ahosi. Bhagavā ca naṃ etadagge niddisi – ‘‘etadaggaṃ, bhikkhave, mama sāvakānaṃ upāsakānaṃ catūhi saṅgahavatthūhi parisaṃ saṅgaṇhantānaṃ yadidaṃ hatthako āḷavako’’ti (a. ni. 1.251). Dvādasamaṃ."
    ],
    "innerText": "Atha bhagavā nagare piṇḍāya caritvā katabhattakicco nagaradvāre aññatarasmiṃ vivitte rukkhamūle paññattabuddhāsane nisīdi. Tato mahājanakāyena saddhiṃ rājā ca nāgarā ca ekato sampiṇḍitvā bhagavantaṃ upasaṅkamma vanditvā parivāretvā nisinnā – ‘‘kathaṃ, bhante, evaṃ dāruṇaṃ yakkhaṃ damayitthā’’ti pucchiṃsu. Tesaṃ bhagavā yuddhamādiṃ katvā ‘‘evaṃ navavidhaṃ vassaṃ vassetvā evaṃ vibhiṃsanakaṃ akāsi, evaṃ pañhaṃ pucchi. Tassāhaṃ evaṃ vissajjesi’’nti tamevāḷavakasuttaṃ kathesi. Kathāpariyosāne caturāsītipāṇasahassānaṃ dhammābhisamayo ahosi. Tato rājā ceva nāgarā ca vessavaṇamahārājassa bhavanasamīpe yakkhassa bhavanaṃ katvā pupphagandhādisakkārupetaṃ niccabaliṃ pavattesuṃ. Tañca kumāraṃ viññutaṃ pattaṃ ‘‘tvaṃ bhagavantaṃ nissāya jīvitaṃ labhi, gaccha bhagavantaṃyeva payirupāsassu bhikkhusaṅghañcā’’ti vissajjesuṃ. So bhagavantañca bhikkhusaṅghañca payirupāsamāno nacirasseva anāgāmiphale patiṭṭhāya sabbaṃ buddhavacanaṃ uggahetvā pañcasataupāsakaparivāro ahosi. Bhagavā ca naṃ etadagge niddisi – ‘‘etadaggaṃ, bhikkhave, mama sāvakānaṃ upāsakānaṃ catūhi saṅgahavatthūhi parisaṃ saṅgaṇhantānaṃ yadidaṃ hatthako āḷavako’’ti (a. ni. 1.251). Dvādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti sāratthappakāsiniyā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saṃyuttanikāya-aṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Yakkhasaṃyuttavaṇṇanā niṭṭhitā."
  }
]