[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "5. Kassapasaṃyuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Santuṭṭhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "144"
      },
      ". Sāvatthiyaṃ ",
      " viharati…pe… ‘‘santuṭṭhāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[santuṭṭhoyaṃ (sī.)]"
      },
      ", bhikkhave, kassapo itarītarena cīvarena, itarītaracīvarasantuṭṭhiyā ca vaṇṇavādī; na ca cīvarahetu anesanaṃ appatirūpaṃ āpajjati; aladdhā ca cīvaraṃ na paritassati; laddhā ca cīvaraṃ agadhito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[agathito (sī.)]"
      },
      " amucchito anajjhāpanno ādīnavadassāvī nissaraṇapañño paribhuñjati’’."
    ],
    "innerText": "144. Sāvatthiyaṃ viharati…pe… ‘‘santuṭṭhāyaṃ [santuṭṭhoyaṃ (sī.)], bhikkhave, kassapo itarītarena cīvarena, itarītaracīvarasantuṭṭhiyā ca vaṇṇavādī; na ca cīvarahetu anesanaṃ appatirūpaṃ āpajjati; aladdhā ca cīvaraṃ na paritassati; laddhā ca cīvaraṃ agadhito [agathito (sī.)] amucchito anajjhāpanno ādīnavadassāvī nissaraṇapañño paribhuñjati’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Santuṭṭhāyaṃ, bhikkhave, kassapo itarītarena piṇḍapātena, itarītarapiṇḍapātasantuṭṭhiyā ca vaṇṇavādī; na ca piṇḍapātahetu anesanaṃ appatirūpaṃ āpajjati; aladdhā ca piṇḍapātaṃ na paritassati; laddhā ca piṇḍapātaṃ agadhito amucchito anajjhāpanno ādīnavadassāvī nissaraṇapañño paribhuñjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Santuṭṭhāyaṃ, bhikkhave, kassapo itarītarena senāsanena, itarītarasenāsanasantuṭṭhiyā ca vaṇṇavādī; na ca senāsanahetu anesanaṃ appatirūpaṃ āpajjati; aladdhā ca senāsanaṃ na paritassati; laddhā ca senāsanaṃ agadhito amucchito anajjhāpanno ādīnavadassāvī nissaraṇapañño paribhuñjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Santuṭṭhāyaṃ, bhikkhave, kassapo itarītarena gilānappaccayabhesajjaparikkhārena, itarītaragilānappaccayabhesajjaparikkhārasantuṭṭhiyā ca vaṇṇavādī; na ca gilānappaccayabhesajjaparikkhārahetu anesanaṃ appatirūpaṃ āpajjati; aladdhā ca gilānappaccayabhesajjaparikkhāraṃ na paritassati; laddhā ca gilānappaccayabhesajjaparikkhāraṃ agadhito amucchito ",
      " anajjhāpanno ādīnavadassāvī nissaraṇapañño paribhuñjati."
    ],
    "innerText": "‘‘Santuṭṭhāyaṃ, bhikkhave, kassapo itarītarena gilānappaccayabhesajjaparikkhārena, itarītaragilānappaccayabhesajjaparikkhārasantuṭṭhiyā ca vaṇṇavādī; na ca gilānappaccayabhesajjaparikkhārahetu anesanaṃ appatirūpaṃ āpajjati; aladdhā ca gilānappaccayabhesajjaparikkhāraṃ na paritassati; laddhā ca gilānappaccayabhesajjaparikkhāraṃ agadhito amucchito anajjhāpanno ādīnavadassāvī nissaraṇapañño paribhuñjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tasmātiha ",
      ", bhikkhave, evaṃ sikkhitabbaṃ – ‘santuṭṭhā bhavissāma itarītarena cīvarena, itarītaracīvarasantuṭṭhiyā ca ",
      " vaṇṇavādino; na ca cīvarahetu anesanaṃ appatirūpaṃ āpajjissāma; aladdhā ca cīvaraṃ na ca paritassissāma; laddhā ca cīvaraṃ agadhitā amucchitā anajjhāpannā ādīnavadassāvino nissaraṇapaññā paribhuñjissāma’’’. (Evaṃ sabbaṃ kātabbaṃ)."
    ],
    "innerText": "‘‘Tasmātiha , bhikkhave, evaṃ sikkhitabbaṃ – ‘santuṭṭhā bhavissāma itarītarena cīvarena, itarītaracīvarasantuṭṭhiyā ca vaṇṇavādino; na ca cīvarahetu anesanaṃ appatirūpaṃ āpajjissāma; aladdhā ca cīvaraṃ na ca paritassissāma; laddhā ca cīvaraṃ agadhitā amucchitā anajjhāpannā ādīnavadassāvino nissaraṇapaññā paribhuñjissāma’’’. (Evaṃ sabbaṃ kātabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Santuṭṭhā ",
      " bhavissāma itarītarena piṇḍapātena…pe… santuṭṭhā bhavissāma itarītarena senāsanena…pe… santuṭṭhā bhavissāma itarītarena gilānappaccayabhesajjaparikkhārena, itarītaragilānappaccayabhesajjaparikkhārasantuṭṭhiyā ca vaṇṇavādino; na ca gilānappaccayabhesajjaparikkhārahetu anesanaṃ appatirūpaṃ āpajjissāma aladdhā ca gilānappaccayabhesajjaparikkhāraṃ na paritassissāma; laddhā ca gilānappaccayabhesajjaparikkhāraṃ agadhitā amucchitā anajjhāpannā ādīnavadassāvino nissaraṇapaññā paribhuñjissāmā’ti. Evañhi vo, bhikkhave, sikkhitabbaṃ. Kassapena vā hi vo, bhikkhave, ovadissāmi yo vā panassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yo vā pana (sī.), yo vā (pī.)]"
      },
      " kassapasadiso, ovaditehi ca pana vo tathattāya paṭipajjitabba’’nti. Paṭhamaṃ."
    ],
    "innerText": "‘‘‘Santuṭṭhā bhavissāma itarītarena piṇḍapātena…pe… santuṭṭhā bhavissāma itarītarena senāsanena…pe… santuṭṭhā bhavissāma itarītarena gilānappaccayabhesajjaparikkhārena, itarītaragilānappaccayabhesajjaparikkhārasantuṭṭhiyā ca vaṇṇavādino; na ca gilānappaccayabhesajjaparikkhārahetu anesanaṃ appatirūpaṃ āpajjissāma aladdhā ca gilānappaccayabhesajjaparikkhāraṃ na paritassissāma; laddhā ca gilānappaccayabhesajjaparikkhāraṃ agadhitā amucchitā anajjhāpannā ādīnavadassāvino nissaraṇapaññā paribhuñjissāmā’ti. Evañhi vo, bhikkhave, sikkhitabbaṃ. Kassapena vā hi vo, bhikkhave, ovadissāmi yo vā panassa [yo vā pana (sī.), yo vā (pī.)] kassapasadiso, ovaditehi ca pana vo tathattāya paṭipajjitabba’’nti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Anottappīsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "145"
      },
      ". Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā ca mahākassapo āyasmā ca sāriputto bārāṇasiyaṃ viharanti isipatane migadāye. Atha ",
      " kho āyasmā sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā mahākassapo tenupasaṅkami; upasaṅkamitvā āyasmatā mahākassapena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ mahākassapaṃ etadavoca – ‘‘vuccati hidaṃ, āvuso kassapa, anātāpī anottappī abhabbo sambodhāya abhabbo nibbānāya abhabbo anuttarassa yogakkhemassa adhigamāya; ātāpī ca kho ottappī ",
      " bhabbo sambodhāya bhabbo nibbānāya bhabbo anuttarassa yogakkhemassa adhigamāyā’’ti."
    ],
    "innerText": "145. Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā ca mahākassapo āyasmā ca sāriputto bārāṇasiyaṃ viharanti isipatane migadāye. Atha kho āyasmā sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā mahākassapo tenupasaṅkami; upasaṅkamitvā āyasmatā mahākassapena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ mahākassapaṃ etadavoca – ‘‘vuccati hidaṃ, āvuso kassapa, anātāpī anottappī abhabbo sambodhāya abhabbo nibbānāya abhabbo anuttarassa yogakkhemassa adhigamāya; ātāpī ca kho ottappī bhabbo sambodhāya bhabbo nibbānāya bhabbo anuttarassa yogakkhemassa adhigamāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kittāvatā nu kho, āvuso, anātāpī hoti anottappī abhabbo sambodhāya abhabbo nibbānāya abhabbo anuttarassa yogakkhemassa adhigamāya; kittāvatā ca panāvuso, ātāpī ",
      " hoti ottappī bhabbo sambodhāya bhabbo nibbānāya bhabbo anuttarassa yogakkhemassa adhigamāyā’’ti? ‘‘Idhāvuso, bhikkhu ‘anuppannā me pāpakā akusalā dhammā uppajjamānā anatthāya saṃvatteyyu’nti ",
      " na ātappaṃ karoti, ‘uppannā me pāpakā akusalā dhammā appahīyamānā anatthāya saṃvatteyyu’nti na ātappaṃ karoti, ‘anuppannā me kusalā dhammānuppajjamānā anatthāya saṃvatteyyu’nti na ātappaṃ karoti, ‘uppannā me kusalā dhammā nirujjhamānā anatthāya saṃvatteyyu’nti na ",
      " ātappaṃ karoti. Evaṃ kho, āvuso, anātāpī hoti’’."
    ],
    "innerText": "‘‘Kittāvatā nu kho, āvuso, anātāpī hoti anottappī abhabbo sambodhāya abhabbo nibbānāya abhabbo anuttarassa yogakkhemassa adhigamāya; kittāvatā ca panāvuso, ātāpī hoti ottappī bhabbo sambodhāya bhabbo nibbānāya bhabbo anuttarassa yogakkhemassa adhigamāyā’’ti? ‘‘Idhāvuso, bhikkhu ‘anuppannā me pāpakā akusalā dhammā uppajjamānā anatthāya saṃvatteyyu’nti na ātappaṃ karoti, ‘uppannā me pāpakā akusalā dhammā appahīyamānā anatthāya saṃvatteyyu’nti na ātappaṃ karoti, ‘anuppannā me kusalā dhammānuppajjamānā anatthāya saṃvatteyyu’nti na ātappaṃ karoti, ‘uppannā me kusalā dhammā nirujjhamānā anatthāya saṃvatteyyu’nti na ātappaṃ karoti. Evaṃ kho, āvuso, anātāpī hoti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañcāvuso, anottappī hoti? Idhāvuso, bhikkhu ‘anuppannā me pāpakā akusalā dhammā uppajjamānā anatthāya saṃvatteyyu’nti na ottappati, ‘uppannā me pāpakā akusalā dhammā appahīyamānā anatthāya saṃvatteyyu’nti na ottappati, ‘anuppannā me kusalā dhammānuppajjamānā anatthāya saṃvatteyyu’nti na ottappati, ‘uppannā me kusalā dhammā nirujjhamānā anatthāya saṃvatteyyu’nti na ottappati. Evaṃ ",
      " kho, āvuso, anottappī hoti. Evaṃ kho, āvuso, anātāpī anottappī abhabbo sambodhāya abhabbo nibbānāya abhabbo anuttarassa yogakkhemassa adhigamāya."
    ],
    "innerText": "‘‘Kathañcāvuso, anottappī hoti? Idhāvuso, bhikkhu ‘anuppannā me pāpakā akusalā dhammā uppajjamānā anatthāya saṃvatteyyu’nti na ottappati, ‘uppannā me pāpakā akusalā dhammā appahīyamānā anatthāya saṃvatteyyu’nti na ottappati, ‘anuppannā me kusalā dhammānuppajjamānā anatthāya saṃvatteyyu’nti na ottappati, ‘uppannā me kusalā dhammā nirujjhamānā anatthāya saṃvatteyyu’nti na ottappati. Evaṃ kho, āvuso, anottappī hoti. Evaṃ kho, āvuso, anātāpī anottappī abhabbo sambodhāya abhabbo nibbānāya abhabbo anuttarassa yogakkhemassa adhigamāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañcāvuso, ātāpī hoti? Idhāvuso, bhikkhu ‘anuppannā me pāpakā akusalā dhammā uppajjamānā anatthāya saṃvatteyyu’nti ātappaṃ karoti, ‘uppannā me pāpakā akusalā dhammā appahīyamānā anatthāya saṃvatteyyu’nti ātappaṃ karoti, anuppannā me kusalā dhammā…pe… ātappaṃ karoti. Evaṃ kho, āvuso, ātāpī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañcāvuso, ottappī hoti? Idhāvuso, bhikkhu ‘anuppannā ",
      " me pāpakā akusalā dhammā uppajjamānā anatthāya saṃvatteyyu’nti ottappati, ‘uppannā me pāpakā akusalā dhammā appahīyamānā anatthāya saṃvatteyyu’nti ottappati, ‘anuppannā me kusalā dhammā anuppajjamānā anatthāya saṃvatteyyu’nti ottappati, ‘uppannā me kusalā dhammā nirujjhamānā anatthāya saṃvatteyyu’nti ottappati. Evaṃ kho, āvuso, ottappī hoti. Evaṃ kho, āvuso, ātāpī ottappī bhabbo sambodhāya bhabbo nibbānāya bhabbo anuttarassa yogakkhemassa adhigamāyā’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Kathañcāvuso, ottappī hoti? Idhāvuso, bhikkhu ‘anuppannā me pāpakā akusalā dhammā uppajjamānā anatthāya saṃvatteyyu’nti ottappati, ‘uppannā me pāpakā akusalā dhammā appahīyamānā anatthāya saṃvatteyyu’nti ottappati, ‘anuppannā me kusalā dhammā anuppajjamānā anatthāya saṃvatteyyu’nti ottappati, ‘uppannā me kusalā dhammā nirujjhamānā anatthāya saṃvatteyyu’nti ottappati. Evaṃ kho, āvuso, ottappī hoti. Evaṃ kho, āvuso, ātāpī ottappī bhabbo sambodhāya bhabbo nibbānāya bhabbo anuttarassa yogakkhemassa adhigamāyā’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Candūpamasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "146"
      },
      ". Sāvatthiyaṃ ",
      " viharati…pe… ‘‘candūpamā, bhikkhave, kulāni upasaṅkamatha – apakasseva ",
      " kāyaṃ, apakassa cittaṃ, niccanavakā kulesu appagabbhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[appagabbā (ka.)]"
      },
      ". Seyyathāpi ",
      ", bhikkhave, puriso jarudapānaṃ vā olokeyya pabbatavisamaṃ vā nadīviduggaṃ vā – apakasseva kāyaṃ, apakassa cittaṃ; evameva kho, bhikkhave, candūpamā kulāni upasaṅkamatha – apakasseva kāyaṃ, apakassa cittaṃ, niccanavakā kulesu appagabbhā’’."
    ],
    "innerText": "146. Sāvatthiyaṃ viharati…pe… ‘‘candūpamā, bhikkhave, kulāni upasaṅkamatha – apakasseva kāyaṃ, apakassa cittaṃ, niccanavakā kulesu appagabbhā [appagabbā (ka.)]. Seyyathāpi , bhikkhave, puriso jarudapānaṃ vā olokeyya pabbatavisamaṃ vā nadīviduggaṃ vā – apakasseva kāyaṃ, apakassa cittaṃ; evameva kho, bhikkhave, candūpamā kulāni upasaṅkamatha – apakasseva kāyaṃ, apakassa cittaṃ, niccanavakā kulesu appagabbhā’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kassapo, bhikkhave, candūpamo kulāni upasaṅkamati – apakasseva kāyaṃ, apakassa cittaṃ, niccanavako kulesu appagabbho. Taṃ kiṃ maññatha, bhikkhave, kathaṃrūpo bhikkhu arahati kulāni upasaṅkamitu’’nti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho. Bhagavato sutvā bhikkhū dhāressantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho ",
      " bhagavā ākāse pāṇiṃ cālesi. ‘‘Seyyathāpi, bhikkhave, ayaṃ ākāse pāṇi na sajjati na gayhati na bajjhati; evameva kho, bhikkhave, yassa kassaci bhikkhuno kulāni upasaṅkamato kulesu cittaṃ na sajjati na gayhati na bajjhati – ‘labhantu lābhakāmā, puññakāmā karontu puññānī’ti; yathāsakena lābhena attamano hoti sumano, evaṃ paresaṃ lābhena attamano hoti sumano; evarūpo kho, bhikkhave, bhikkhu arahati kulāni upasaṅkamituṃ."
    ],
    "innerText": "Atha kho bhagavā ākāse pāṇiṃ cālesi. ‘‘Seyyathāpi, bhikkhave, ayaṃ ākāse pāṇi na sajjati na gayhati na bajjhati; evameva kho, bhikkhave, yassa kassaci bhikkhuno kulāni upasaṅkamato kulesu cittaṃ na sajjati na gayhati na bajjhati – ‘labhantu lābhakāmā, puññakāmā karontu puññānī’ti; yathāsakena lābhena attamano hoti sumano, evaṃ paresaṃ lābhena attamano hoti sumano; evarūpo kho, bhikkhave, bhikkhu arahati kulāni upasaṅkamituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kassapassa, bhikkhave, kulāni upasaṅkamato kulesu cittaṃ na sajjati na gayhati na bajjhati – ‘labhantu lābhakāmā, puññakāmā karontu puññānī’ti; yathāsakena lābhena attamano hoti sumano; evaṃ paresaṃ lābhena attamano hoti sumano."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ ",
      " kiṃ maññatha, bhikkhave, kathaṃrūpassa bhikkhuno aparisuddhā dhammadesanā hoti, kathaṃrūpassa bhikkhuno parisuddhā dhammadesanā hotī’’ti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho ",
      ". Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "‘‘Taṃ kiṃ maññatha, bhikkhave, kathaṃrūpassa bhikkhuno aparisuddhā dhammadesanā hoti, kathaṃrūpassa bhikkhuno parisuddhā dhammadesanā hotī’’ti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho . Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo hi koci, bhikkhave, bhikkhu evaṃcitto paresaṃ dhammaṃ deseti – ‘aho vata me dhammaṃ suṇeyyuṃ, sutvā ca pana dhammaṃ pasīdeyyuṃ, pasannā ca ",
      " me pasannākāraṃ ",
      " kareyyu’nti; evarūpassa kho, bhikkhave, bhikkhuno aparisuddhā dhammadesanā hoti."
    ],
    "innerText": "‘‘Yo hi koci, bhikkhave, bhikkhu evaṃcitto paresaṃ dhammaṃ deseti – ‘aho vata me dhammaṃ suṇeyyuṃ, sutvā ca pana dhammaṃ pasīdeyyuṃ, pasannā ca me pasannākāraṃ kareyyu’nti; evarūpassa kho, bhikkhave, bhikkhuno aparisuddhā dhammadesanā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo ca kho, bhikkhave, bhikkhu evaṃcitto paresaṃ dhammaṃ deseti – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[viññūhi (?)]"
      },
      ". Aho, vata me dhammaṃ suṇeyyuṃ, sutvā ca pana dhammaṃ ājāneyyuṃ, ājānitvā ca pana tathattāya paṭipajjeyyu’nti. Iti dhammasudhammataṃ paṭicca paresaṃ dhammaṃ deseti, kāruññaṃ paṭicca anuddayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anudayaṃ (bahūsu) dvittakāraṇaṃ pana gavesitabbaṃ]"
      },
      " paṭicca anukampaṃ upādāya paresaṃ dhammaṃ deseti. Evarūpassa kho, bhikkhave, bhikkhuno parisuddhā dhammadesanā hoti."
    ],
    "innerText": "‘‘Yo ca kho, bhikkhave, bhikkhu evaṃcitto paresaṃ dhammaṃ deseti – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhīti [viññūhi (?)]. Aho, vata me dhammaṃ suṇeyyuṃ, sutvā ca pana dhammaṃ ājāneyyuṃ, ājānitvā ca pana tathattāya paṭipajjeyyu’nti. Iti dhammasudhammataṃ paṭicca paresaṃ dhammaṃ deseti, kāruññaṃ paṭicca anuddayaṃ [anudayaṃ (bahūsu) dvittakāraṇaṃ pana gavesitabbaṃ] paṭicca anukampaṃ upādāya paresaṃ dhammaṃ deseti. Evarūpassa kho, bhikkhave, bhikkhuno parisuddhā dhammadesanā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kassapo, bhikkhave, evaṃcitto paresaṃ dhammaṃ deseti – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhīti. Aho, vata ",
      " me dhammaṃ suṇeyyuṃ, sutvā ca pana dhammaṃ ājāneyyuṃ, ājānitvā ca pana tathattāya paṭipajjeyyu’nti. Iti dhammasudhammataṃ paṭicca paresaṃ dhammaṃ deseti, kāruññaṃ paṭicca anuddayaṃ paṭicca anukampaṃ upādāya paresaṃ dhammaṃ deseti. Kassapena vā hi vo, bhikkhave, ovadissāmi yo vā panassa kassapasadiso, ovaditehi ca pana vo tathattāya paṭipajjitabba’’nti. Tatiyaṃ."
    ],
    "innerText": "‘‘Kassapo, bhikkhave, evaṃcitto paresaṃ dhammaṃ deseti – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhīti. Aho, vata me dhammaṃ suṇeyyuṃ, sutvā ca pana dhammaṃ ājāneyyuṃ, ājānitvā ca pana tathattāya paṭipajjeyyu’nti. Iti dhammasudhammataṃ paṭicca paresaṃ dhammaṃ deseti, kāruññaṃ paṭicca anuddayaṃ paṭicca anukampaṃ upādāya paresaṃ dhammaṃ deseti. Kassapena vā hi vo, bhikkhave, ovadissāmi yo vā panassa kassapasadiso, ovaditehi ca pana vo tathattāya paṭipajjitabba’’nti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Kulūpakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "147"
      },
      ". Sāvatthiyaṃ viharati…pe… ‘‘taṃ kiṃ maññatha, bhikkhave, kathaṃrūpo bhikkhu ",
      " arahati kulūpako hotuṃ, kathaṃrūpo bhikkhu na arahati kulūpako hotu’’nti? Bhagavaṃmūlakā no, bhante, dhammā…pe… bhagavā etadavoca –"
    ],
    "innerText": "147. Sāvatthiyaṃ viharati…pe… ‘‘taṃ kiṃ maññatha, bhikkhave, kathaṃrūpo bhikkhu arahati kulūpako hotuṃ, kathaṃrūpo bhikkhu na arahati kulūpako hotu’’nti? Bhagavaṃmūlakā no, bhante, dhammā…pe… bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo ",
      " hi koci, bhikkhave, bhikkhu evaṃcitto kulāni upasaṅkamati – ‘dentuyeva me, mā nādaṃsu; bahukaññeva me dentu, mā thokaṃ; paṇītaññeva me dentu, mā lūkhaṃ; sīghaññeva me dentu, mā dandhaṃ; sakkaccaññeva me dentu, mā asakkacca’nti. Tassa ce, bhikkhave, bhikkhuno evaṃcittassa kulāni upasaṅkamato na denti, tena bhikkhu sandīyati; so tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Thokaṃ denti, no bahukaṃ…pe… lūkhaṃ denti, no paṇītaṃ… dandhaṃ denti, no sīghaṃ, tena bhikkhu sandīyati; so tatonidānaṃ ",
      " dukkhaṃ domanassaṃ paṭisaṃvedayati. Asakkaccaṃ denti, no sakkaccaṃ; tena bhikkhu sandīyati; so ",
      " tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Evarūpo kho, bhikkhave, bhikkhu na arahati kūlūpako hotuṃ."
    ],
    "innerText": "‘‘Yo hi koci, bhikkhave, bhikkhu evaṃcitto kulāni upasaṅkamati – ‘dentuyeva me, mā nādaṃsu; bahukaññeva me dentu, mā thokaṃ; paṇītaññeva me dentu, mā lūkhaṃ; sīghaññeva me dentu, mā dandhaṃ; sakkaccaññeva me dentu, mā asakkacca’nti. Tassa ce, bhikkhave, bhikkhuno evaṃcittassa kulāni upasaṅkamato na denti, tena bhikkhu sandīyati; so tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Thokaṃ denti, no bahukaṃ…pe… lūkhaṃ denti, no paṇītaṃ… dandhaṃ denti, no sīghaṃ, tena bhikkhu sandīyati; so tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Asakkaccaṃ denti, no sakkaccaṃ; tena bhikkhu sandīyati; so tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Evarūpo kho, bhikkhave, bhikkhu na arahati kūlūpako hotuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo ca kho, bhikkhave, bhikkhu evaṃcitto kulāni upasaṅkamati – ‘taṃ kutettha labbhā parakulesu – dentuyeva me, mā nādaṃsu; bahukaññeva me dentu, mā thokaṃ; paṇītaññeva me dentu, mā lūkhaṃ; dīghaññeva me dentu, mā dandhaṃ; sakkaccaññeva me dentu, mā asakkacca’nti. Tassa ce, bhikkhave, bhikkhuno evaṃcittassa kulāni upasaṅkamato na denti; tena bhikkhu na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ ",
      " paṭisaṃvedayati. Thokaṃ denti, no bahukaṃ; tena bhikkhu na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Lūkhaṃ denti, no paṇītaṃ; tena bhikkhu na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Dandhaṃ denti, no sīghaṃ; tena bhikkhu na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Asakkaccaṃ denti, no sakkaccaṃ; tena bhikkhu na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Evarūpo kho, bhikkhave, bhikkhu arahati kulūpako hotuṃ."
    ],
    "innerText": "‘‘Yo ca kho, bhikkhave, bhikkhu evaṃcitto kulāni upasaṅkamati – ‘taṃ kutettha labbhā parakulesu – dentuyeva me, mā nādaṃsu; bahukaññeva me dentu, mā thokaṃ; paṇītaññeva me dentu, mā lūkhaṃ; dīghaññeva me dentu, mā dandhaṃ; sakkaccaññeva me dentu, mā asakkacca’nti. Tassa ce, bhikkhave, bhikkhuno evaṃcittassa kulāni upasaṅkamato na denti; tena bhikkhu na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Thokaṃ denti, no bahukaṃ; tena bhikkhu na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Lūkhaṃ denti, no paṇītaṃ; tena bhikkhu na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Dandhaṃ denti, no sīghaṃ; tena bhikkhu na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Asakkaccaṃ denti, no sakkaccaṃ; tena bhikkhu na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Evarūpo kho, bhikkhave, bhikkhu arahati kulūpako hotuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kassapo, bhikkhave, evaṃcitto kulāni upasaṅkamati – ‘taṃ kutettha labbhā parakulesu – dentuyeva me, mā nādaṃsu; bahukaññeva me dentu, mā thokaṃ; paṇītaññeva me dentu, mā lūkhaṃ; sīghaññeva me dentu, mā dandhaṃ; sakkaccaññeva me dentu, mā asakkacca’nti. Tassa ce, bhikkhave, kassapassa evaṃcittassa kulāni upasaṅkamato na denti; tena kassapo na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Thokaṃ denti, no bahukaṃ; tena kassapo na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Lūkhaṃ denti ",
      ", no paṇītaṃ; tena kassapo na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Dandhaṃ denti, no sīghaṃ; tena kassapo na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Asakkaccaṃ denti, no sakkaccaṃ; tena kassapo na sandīyati ",
      "; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Kassapena vā hi vo, bhikkhave, ovadissāmi yo vā panassa kassapasadiso. Ovaditehi ca pana vo tathattāya paṭipajjitabba’’nti. Catutthaṃ."
    ],
    "innerText": "‘‘Kassapo, bhikkhave, evaṃcitto kulāni upasaṅkamati – ‘taṃ kutettha labbhā parakulesu – dentuyeva me, mā nādaṃsu; bahukaññeva me dentu, mā thokaṃ; paṇītaññeva me dentu, mā lūkhaṃ; sīghaññeva me dentu, mā dandhaṃ; sakkaccaññeva me dentu, mā asakkacca’nti. Tassa ce, bhikkhave, kassapassa evaṃcittassa kulāni upasaṅkamato na denti; tena kassapo na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Thokaṃ denti, no bahukaṃ; tena kassapo na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Lūkhaṃ denti , no paṇītaṃ; tena kassapo na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Dandhaṃ denti, no sīghaṃ; tena kassapo na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Asakkaccaṃ denti, no sakkaccaṃ; tena kassapo na sandīyati ; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Kassapena vā hi vo, bhikkhave, ovadissāmi yo vā panassa kassapasadiso. Ovaditehi ca pana vo tathattāya paṭipajjitabba’’nti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Jiṇṇasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "148"
      },
      ". Evaṃ ",
      " me sutaṃ…pe… rājagahe veḷuvane. Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ mahākassapaṃ bhagavā etadavoca – ‘‘jiṇṇosi dāni tvaṃ, kassapa, garukāni ca te imāni sāṇāni paṃsukūlāni nibbasanāni. Tasmātiha tvaṃ, kassapa, gahapatāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gahapatikāni (sī.)]"
      },
      " ceva cīvarāni dhārehi, nimantanāni ca bhuñjāhi, mama ca santike viharāhī’’ti."
    ],
    "innerText": "148. Evaṃ me sutaṃ…pe… rājagahe veḷuvane. Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ mahākassapaṃ bhagavā etadavoca – ‘‘jiṇṇosi dāni tvaṃ, kassapa, garukāni ca te imāni sāṇāni paṃsukūlāni nibbasanāni. Tasmātiha tvaṃ, kassapa, gahapatāni [gahapatikāni (sī.)] ceva cīvarāni dhārehi, nimantanāni ca bhuñjāhi, mama ca santike viharāhī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahaṃ kho, bhante, dīgharattaṃ āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva piṇḍapātikattassa ca vaṇṇavādī, paṃsukūliko ceva paṃsukūlikattassa ca vaṇṇavādī, tecīvariko ceva tecīvarikattassa ca vaṇṇavādī, appiccho ceva appicchatāya ca vaṇṇavādī, santuṭṭho ceva santuṭṭhiyā ca vaṇṇavādī, pavivitto ceva pavivekassa ca vaṇṇavādī, asaṃsaṭṭho ceva asaṃsaggassa ca vaṇṇavādī, āraddhavīriyo ceva vīriyārambhassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vīriyārabbhassa (ka.)]"
      },
      " ca vaṇṇavādī’’ti."
    ],
    "innerText": "‘‘Ahaṃ kho, bhante, dīgharattaṃ āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva piṇḍapātikattassa ca vaṇṇavādī, paṃsukūliko ceva paṃsukūlikattassa ca vaṇṇavādī, tecīvariko ceva tecīvarikattassa ca vaṇṇavādī, appiccho ceva appicchatāya ca vaṇṇavādī, santuṭṭho ceva santuṭṭhiyā ca vaṇṇavādī, pavivitto ceva pavivekassa ca vaṇṇavādī, asaṃsaṭṭho ceva asaṃsaggassa ca vaṇṇavādī, āraddhavīriyo ceva vīriyārambhassa [vīriyārabbhassa (ka.)] ca vaṇṇavādī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kaṃ (ka.)]"
      },
      " pana tvaṃ, kassapa, atthavasaṃ sampassamāno dīgharattaṃ āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva…pe… paṃsukūliko ceva… tecīvariko ceva… appiccho ceva… santuṭṭho ceva… pavivitto ceva… asaṃsaṭṭho ceva… āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī’’ti?"
    ],
    "innerText": "‘‘Kiṃ [kaṃ (ka.)] pana tvaṃ, kassapa, atthavasaṃ sampassamāno dīgharattaṃ āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva…pe… paṃsukūliko ceva… tecīvariko ceva… appiccho ceva… santuṭṭho ceva… pavivitto ceva… asaṃsaṭṭho ceva… āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dve ",
      " khvāhaṃ, bhante, atthavase sampassamāno dīgharattaṃ āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ",
      " ceva…pe… paṃsukūliko ceva… tecīvariko ceva… appiccho ceva… santuṭṭho ceva… pavivitto ceva… asaṃsaṭṭho ceva… āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī. Attano ca diṭṭhadhammasukhavihāraṃ sampassamāno, pacchimañca janataṃ anukampamāno – ‘appeva nāma pacchimā janatā diṭṭhānugatiṃ āpajjeyyuṃ’ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āpajjeyya (sī. syā. kaṃ.)]"
      },
      ". ‘Ye kira te ahesuṃ buddhānubuddhasāvakā te dīgharattaṃ āraññikā ceva ahesuṃ āraññikattassa ca vaṇṇavādino…pe… piṇḍapātikā ceva ahesuṃ ",
      " …pe… paṃsukūlikā ceva ahesuṃ… tecīvarikā ceva ahesuṃ… appicchā ceva ahesuṃ… santuṭṭhā ceva ahesuṃ… pavivittā ceva ahesuṃ… asaṃsaṭṭhā ceva ahesuṃ… āraddhavīriyā ceva ahesuṃ vīriyārambhassa ca vaṇṇavādino’ti. Te tathattāya paṭipajjissanti, tesaṃ taṃ bhavissati dīgharattaṃ hitāya sukhāya."
    ],
    "innerText": "‘‘Dve khvāhaṃ, bhante, atthavase sampassamāno dīgharattaṃ āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva…pe… paṃsukūliko ceva… tecīvariko ceva… appiccho ceva… santuṭṭho ceva… pavivitto ceva… asaṃsaṭṭho ceva… āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī. Attano ca diṭṭhadhammasukhavihāraṃ sampassamāno, pacchimañca janataṃ anukampamāno – ‘appeva nāma pacchimā janatā diṭṭhānugatiṃ āpajjeyyuṃ’ [āpajjeyya (sī. syā. kaṃ.)]. ‘Ye kira te ahesuṃ buddhānubuddhasāvakā te dīgharattaṃ āraññikā ceva ahesuṃ āraññikattassa ca vaṇṇavādino…pe… piṇḍapātikā ceva ahesuṃ …pe… paṃsukūlikā ceva ahesuṃ… tecīvarikā ceva ahesuṃ… appicchā ceva ahesuṃ… santuṭṭhā ceva ahesuṃ… pavivittā ceva ahesuṃ… asaṃsaṭṭhā ceva ahesuṃ… āraddhavīriyā ceva ahesuṃ vīriyārambhassa ca vaṇṇavādino’ti. Te tathattāya paṭipajjissanti, tesaṃ taṃ bhavissati dīgharattaṃ hitāya sukhāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ime khvāhaṃ, bhante, dve atthavase sampassamāno dīgharattaṃ āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva…pe… paṃsukūliko ceva… tecīvariko ceva… appiccho ceva… santuṭṭho ceva… pavivitto ceva… asaṃsaṭṭho ceva… āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu sādhu, kassapa. Bahujanahitāya kira tvaṃ, kassapa, paṭipanno ",
      " bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. Tasmātiha tvaṃ, kassapa, sāṇāni ceva paṃsukūlāni dhārehi nibbasanāni, piṇḍāya ca carāhi, araññe ca viharāhī’’ti. Pañcamaṃ."
    ],
    "innerText": "‘‘Sādhu sādhu, kassapa. Bahujanahitāya kira tvaṃ, kassapa, paṭipanno bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. Tasmātiha tvaṃ, kassapa, sāṇāni ceva paṃsukūlāni dhārehi nibbasanāni, piṇḍāya ca carāhi, araññe ca viharāhī’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Ovādasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "149"
      },
      ". Rājagahe veḷuvane. Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ mahākassapaṃ bhagavā etadavoca – ‘‘ovada, kassapa, bhikkhū; karohi, kassapa, bhikkhūnaṃ dhammiṃ kathaṃ. Ahaṃ vā, kassapa ",
      ", bhikkhū ovadeyyaṃ tvaṃ vā; ahaṃ vā bhikkhūnaṃ dhammiṃ kathaṃ kareyyaṃ tvaṃ vā’’ti."
    ],
    "innerText": "149. Rājagahe veḷuvane. Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ mahākassapaṃ bhagavā etadavoca – ‘‘ovada, kassapa, bhikkhū; karohi, kassapa, bhikkhūnaṃ dhammiṃ kathaṃ. Ahaṃ vā, kassapa , bhikkhū ovadeyyaṃ tvaṃ vā; ahaṃ vā bhikkhūnaṃ dhammiṃ kathaṃ kareyyaṃ tvaṃ vā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dubbacā ",
      " kho, bhante, etarahi bhikkhū, dovacassakaraṇehi dhammehi samannāgatā, akkhamā, appadakkhiṇaggāhino anusāsaniṃ. Idhāhaṃ, bhante, addasaṃ bhaṇḍañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhaṇḍuñca (sī.)]"
      },
      " nāma bhikkhuṃ ānandassa saddhivihāriṃ abhijikañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ābhiñjikañca (sī. ka.), ābhijjikañca (syā. kaṃ.)]"
      },
      " nāma bhikkhuṃ anuruddhassa saddhivihāriṃ aññamaññaṃ sutena accāvadante – ‘ehi, bhikkhu, ko bahutaraṃ bhāsissati, ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’’’ti."
    ],
    "innerText": "‘‘Dubbacā kho, bhante, etarahi bhikkhū, dovacassakaraṇehi dhammehi samannāgatā, akkhamā, appadakkhiṇaggāhino anusāsaniṃ. Idhāhaṃ, bhante, addasaṃ bhaṇḍañca [bhaṇḍuñca (sī.)] nāma bhikkhuṃ ānandassa saddhivihāriṃ abhijikañca [ābhiñjikañca (sī. ka.), ābhijjikañca (syā. kaṃ.)] nāma bhikkhuṃ anuruddhassa saddhivihāriṃ aññamaññaṃ sutena accāvadante – ‘ehi, bhikkhu, ko bahutaraṃ bhāsissati, ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho bhagavā aññataraṃ bhikkhuṃ āmantesi – ‘‘ehi tvaṃ, bhikkhu, mama vacanena bhaṇḍañca bhikkhuṃ ānandassa saddhivihāriṃ abhijikañca bhikkhuṃ anuruddhassa saddhivihāriṃ āmantehi – ‘satthā āyasmante āmantetī’’’ti. ‘‘Evaṃ, bhante’’ti kho so bhikkhu bhagavato paṭissutvā yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū ",
      " etadavoca – ‘‘satthā āyasmante āmantetī’’ti."
    ],
    "innerText": "Atha kho bhagavā aññataraṃ bhikkhuṃ āmantesi – ‘‘ehi tvaṃ, bhikkhu, mama vacanena bhaṇḍañca bhikkhuṃ ānandassa saddhivihāriṃ abhijikañca bhikkhuṃ anuruddhassa saddhivihāriṃ āmantehi – ‘satthā āyasmante āmantetī’’’ti. ‘‘Evaṃ, bhante’’ti kho so bhikkhu bhagavato paṭissutvā yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū etadavoca – ‘‘satthā āyasmante āmantetī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamāvuso’’ti kho te bhikkhū tassa bhikkhuno paṭissutvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinne kho te bhikkhū bhagavā etadavoca – ‘‘saccaṃ kira tumhe, bhikkhave, aññamaññaṃ sutena accāvadatha – ‘ehi, bhikkhu, ko bahutaraṃ bhāsissati, ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Kiṃ nu kho me tumhe, bhikkhave, evaṃ dhammaṃ desitaṃ ājānātha – ‘etha tumhe, bhikkhave, aññamaññaṃ sutena accāvadatha – ehi, bhikkhu, ko bahutaraṃ bhāsissati, ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’’’ti? ‘‘No ",
      " hetaṃ, bhante’’. ‘‘No ce kira me tumhe, bhikkhave, evaṃ dhammaṃ desitaṃ ājānātha, atha kiṃ carahi tumhe, moghapurisā, kiṃ jānantā kiṃ passantā evaṃ svākkhāte dhammavinaye pabbajitā samānā aññamaññaṃ sutena accāvadatha – ‘ehi, bhikkhu, ko bahutaraṃ bhāsissati, ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’’’ti."
    ],
    "innerText": "‘‘Evamāvuso’’ti kho te bhikkhū tassa bhikkhuno paṭissutvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinne kho te bhikkhū bhagavā etadavoca – ‘‘saccaṃ kira tumhe, bhikkhave, aññamaññaṃ sutena accāvadatha – ‘ehi, bhikkhu, ko bahutaraṃ bhāsissati, ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Kiṃ nu kho me tumhe, bhikkhave, evaṃ dhammaṃ desitaṃ ājānātha – ‘etha tumhe, bhikkhave, aññamaññaṃ sutena accāvadatha – ehi, bhikkhu, ko bahutaraṃ bhāsissati, ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘No ce kira me tumhe, bhikkhave, evaṃ dhammaṃ desitaṃ ājānātha, atha kiṃ carahi tumhe, moghapurisā, kiṃ jānantā kiṃ passantā evaṃ svākkhāte dhammavinaye pabbajitā samānā aññamaññaṃ sutena accāvadatha – ‘ehi, bhikkhu, ko bahutaraṃ bhāsissati, ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho te bhikkhū bhagavato pādesu sirasā nipatitvā bhagavantaṃ etadavocuṃ – ‘‘accayo no, bhante, accagamā, yathābāle yathāmūḷhe yathāakusale ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathā bāle yathā mūḷhe yathā akusale (pī.), yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ (?)]"
      },
      ", ye mayaṃ evaṃ svākkhāte dhammavinaye pabbajitā samānā aññamaññaṃ sutena accāvadimha – ‘ehi, bhikkhu, ko bahutaraṃ bhāsissati ",
      ", ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’ti. Tesaṃ ",
      " no, bhante, bhagavā accayaṃ accayato paṭiggaṇhātu āyatiṃ saṃvarāyā’’ti."
    ],
    "innerText": "Atha kho te bhikkhū bhagavato pādesu sirasā nipatitvā bhagavantaṃ etadavocuṃ – ‘‘accayo no, bhante, accagamā, yathābāle yathāmūḷhe yathāakusale [yathā bāle yathā mūḷhe yathā akusale (pī.), yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ (?)], ye mayaṃ evaṃ svākkhāte dhammavinaye pabbajitā samānā aññamaññaṃ sutena accāvadimha – ‘ehi, bhikkhu, ko bahutaraṃ bhāsissati , ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’ti. Tesaṃ no, bhante, bhagavā accayaṃ accayato paṭiggaṇhātu āyatiṃ saṃvarāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taggha tumhe, bhikkhave, accayo accagamā yathābāle yathāmūḷhe yathāakusale, ye tumhe evaṃ svākkhāte dhammavinaye pabbajitā samānā aññamaññaṃ sutena accāvadittha – ‘ehi, bhikkhu, ko bahutaraṃ bhāsissati, ko ",
      " sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’ti. Yato ca kho tumhe, bhikkhave, accayaṃ accayato disvā yathādhammaṃ paṭikarotha, taṃ vo mayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mayaṃ accayaṃ (sī.)]"
      },
      " paṭiggaṇhāma. Vuddhi hesā, bhikkhave, ariyassa vinaye yo accayaṃ accayato disvā yathādhammaṃ paṭikaroti āyatiñca saṃvaraṃ āpajjatī’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Taggha tumhe, bhikkhave, accayo accagamā yathābāle yathāmūḷhe yathāakusale, ye tumhe evaṃ svākkhāte dhammavinaye pabbajitā samānā aññamaññaṃ sutena accāvadittha – ‘ehi, bhikkhu, ko bahutaraṃ bhāsissati, ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’ti. Yato ca kho tumhe, bhikkhave, accayaṃ accayato disvā yathādhammaṃ paṭikarotha, taṃ vo mayaṃ [mayaṃ accayaṃ (sī.)] paṭiggaṇhāma. Vuddhi hesā, bhikkhave, ariyassa vinaye yo accayaṃ accayato disvā yathādhammaṃ paṭikaroti āyatiñca saṃvaraṃ āpajjatī’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Dutiyaovādasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "150"
      },
      ". Rājagahe viharati veḷuvane ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sāvatthi, tatra-etadavoca (sī.)]"
      },
      ". Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami…pe… ekamantaṃ nisinnaṃ kho āyasmantaṃ mahākassapaṃ bhagavā etadavoca – ‘‘ovada, kassapa, bhikkhū; karohi, kassapa, bhikkhūnaṃ dhammiṃ kathaṃ. Ahaṃ vā, kassapa ",
      ", bhikkhū ovadeyyaṃ tvaṃ vā; ahaṃ vā bhikkhūnaṃ dhammiṃ kathaṃ kareyyaṃ tvaṃ vā’’ti."
    ],
    "innerText": "150. Rājagahe viharati veḷuvane [sāvatthi, tatra-etadavoca (sī.)]. Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami…pe… ekamantaṃ nisinnaṃ kho āyasmantaṃ mahākassapaṃ bhagavā etadavoca – ‘‘ovada, kassapa, bhikkhū; karohi, kassapa, bhikkhūnaṃ dhammiṃ kathaṃ. Ahaṃ vā, kassapa , bhikkhū ovadeyyaṃ tvaṃ vā; ahaṃ vā bhikkhūnaṃ dhammiṃ kathaṃ kareyyaṃ tvaṃ vā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dubbacā kho, bhante, etarahi bhikkhū, dovacassakaraṇehi dhammehi samannāgatā akkhamā appadakkhiṇaggāhino anusāsaniṃ. Yassa kassaci, bhante, saddhā natthi kusalesu dhammesu, hirī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[hiri (sabbattha)]"
      },
      " natthi kusalesu dhammesu, ottappaṃ natthi kusalesu dhammesu, vīriyaṃ natthi kusalesu dhammesu, paññā natthi kusalesu dhammesu, tassa yā ",
      " ratti vā divaso vā āgacchati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āgacchanti (sī.)]"
      },
      ", hāniyeva pāṭikaṅkhā kusalesu dhammesu, no vuddhi."
    ],
    "innerText": "‘‘Dubbacā kho, bhante, etarahi bhikkhū, dovacassakaraṇehi dhammehi samannāgatā akkhamā appadakkhiṇaggāhino anusāsaniṃ. Yassa kassaci, bhante, saddhā natthi kusalesu dhammesu, hirī [hiri (sabbattha)] natthi kusalesu dhammesu, ottappaṃ natthi kusalesu dhammesu, vīriyaṃ natthi kusalesu dhammesu, paññā natthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati [āgacchanti (sī.)], hāniyeva pāṭikaṅkhā kusalesu dhammesu, no vuddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhante, kāḷapakkhe candassa yā ratti vā divaso vā āgacchati, hāyateva vaṇṇena, hāyati maṇḍalena, hāyati ābhāya, hāyati ārohapariṇāhena. Evameva kho, bhante, yassa kassaci saddhā natthi kusalesu dhammesu…pe… hirī natthi… ottappaṃ natthi ",
      "… vīriyaṃ natthi… paññā natthi… kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, hāniyeva pāṭikaṅkhā kusalesu dhammesu, no vuddhi."
    ],
    "innerText": "‘‘Seyyathāpi, bhante, kāḷapakkhe candassa yā ratti vā divaso vā āgacchati, hāyateva vaṇṇena, hāyati maṇḍalena, hāyati ābhāya, hāyati ārohapariṇāhena. Evameva kho, bhante, yassa kassaci saddhā natthi kusalesu dhammesu…pe… hirī natthi… ottappaṃ natthi … vīriyaṃ natthi… paññā natthi… kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, hāniyeva pāṭikaṅkhā kusalesu dhammesu, no vuddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Assaddho purisapuggalo’ti, bhante, parihānametaṃ; ‘ahiriko purisapuggalo’ti, bhante, parihānametaṃ; ‘anottappī purisapuggalo’ti, bhante, parihānametaṃ; ‘kusīto purisapuggalo’ti, bhante, parihānametaṃ; ‘duppañño purisapuggalo’ti, bhante, parihānametaṃ; ‘kodhano ",
      " purisapuggalo’ti, bhante, parihānametaṃ; ‘upanāhī purisapuggalo’ti, bhante, parihānametaṃ; ‘na santi bhikkhū ovādakā’ti, bhante, parihānametaṃ."
    ],
    "innerText": "‘‘‘Assaddho purisapuggalo’ti, bhante, parihānametaṃ; ‘ahiriko purisapuggalo’ti, bhante, parihānametaṃ; ‘anottappī purisapuggalo’ti, bhante, parihānametaṃ; ‘kusīto purisapuggalo’ti, bhante, parihānametaṃ; ‘duppañño purisapuggalo’ti, bhante, parihānametaṃ; ‘kodhano purisapuggalo’ti, bhante, parihānametaṃ; ‘upanāhī purisapuggalo’ti, bhante, parihānametaṃ; ‘na santi bhikkhū ovādakā’ti, bhante, parihānametaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yassa kassaci, bhante, saddhā atthi kusalesu dhammesu, hirī atthi kusalesu dhammesu, ottappaṃ atthi kusalesu dhammesu, vīriyaṃ atthi kusalesu dhammesu, paññā atthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhante, juṇhapakkhe candassa yā ratti vā divaso vā āgacchati, vaḍḍhateva vaṇṇena, vaḍḍhati maṇḍalena ",
      ", vaḍḍhati ābhāya, vaḍḍhati ārohapariṇāhena. Evameva ",
      " kho, bhante, yassa kassaci saddhā atthi kusalesu dhammesu… hirī atthi…pe… ottappaṃ atthi… vīriyaṃ atthi… paññā atthi kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni."
    ],
    "innerText": "‘‘Seyyathāpi, bhante, juṇhapakkhe candassa yā ratti vā divaso vā āgacchati, vaḍḍhateva vaṇṇena, vaḍḍhati maṇḍalena , vaḍḍhati ābhāya, vaḍḍhati ārohapariṇāhena. Evameva kho, bhante, yassa kassaci saddhā atthi kusalesu dhammesu… hirī atthi…pe… ottappaṃ atthi… vīriyaṃ atthi… paññā atthi kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Saddho purisapuggalo’ti, bhante, aparihānametaṃ; ‘hirimā purisapuggalo’ti, bhante, aparihānametaṃ; ‘ottappī purisapuggalo’ti, bhante, aparihānametaṃ; ‘āraddhavīriyo purisapuggalo’ti, bhante, aparihānametaṃ; ‘paññavā purisapuggalo’ti, bhante, aparihānametaṃ; ‘akkodhano purisapuggalo’ti, bhante, aparihānametaṃ; ‘anupanāhī purisapuggalo’ti, bhante, aparihānametaṃ; ‘santi bhikkhū ovādakā’ti, bhante, aparihānameta’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu sādhu, kassapa. Yassa kassaci, kassapa, saddhā natthi kusalesu dhammesu…pe… hirī ",
      " natthi… ottappaṃ natthi… vīriyaṃ natthi… paññā natthi kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, hāniyeva pāṭikaṅkhā kusalesu dhammesu, no vuddhi."
    ],
    "innerText": "‘‘Sādhu sādhu, kassapa. Yassa kassaci, kassapa, saddhā natthi kusalesu dhammesu…pe… hirī natthi… ottappaṃ natthi… vīriyaṃ natthi… paññā natthi kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, hāniyeva pāṭikaṅkhā kusalesu dhammesu, no vuddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, kassapa, kāḷapakkhe candassa yā ratti vā divaso vā āgacchati, hāyateva vaṇṇena…pe… hāyati ārohapariṇāhena. Evameva kho, kassapa, yassa kassaci saddhā natthi kusalesu dhammesu…pe… hirī natthi… ottappaṃ natthi… vīriyaṃ natthi… paññā natthi kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, hāniyeva pāṭikaṅkhā kusalesu dhammesu, no vuddhi. ‘Assaddho ",
      " purisapuggalo’ti, kassapa, parihānametaṃ ",
      "; ahiriko…pe… anottappī… kusīto… duppañño… kodhano… ‘upanāhī purisapuggalo’ti, kassapa, parihānametaṃ; ‘na santi bhikkhū ovādakā’ti, kassapa, parihānametaṃ."
    ],
    "innerText": "‘‘Seyyathāpi, kassapa, kāḷapakkhe candassa yā ratti vā divaso vā āgacchati, hāyateva vaṇṇena…pe… hāyati ārohapariṇāhena. Evameva kho, kassapa, yassa kassaci saddhā natthi kusalesu dhammesu…pe… hirī natthi… ottappaṃ natthi… vīriyaṃ natthi… paññā natthi kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, hāniyeva pāṭikaṅkhā kusalesu dhammesu, no vuddhi. ‘Assaddho purisapuggalo’ti, kassapa, parihānametaṃ ; ahiriko…pe… anottappī… kusīto… duppañño… kodhano… ‘upanāhī purisapuggalo’ti, kassapa, parihānametaṃ; ‘na santi bhikkhū ovādakā’ti, kassapa, parihānametaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yassa kassaci, kassapa, saddhā atthi kusalesu dhammesu…pe… hirī atthi… ottappaṃ atthi… vīriyaṃ atthi… paññā atthi kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, kassapa, juṇhapakkhe candassa yā ratti vā divaso ",
      " vā āgacchati, vaḍḍhateva vaṇṇena, vaḍḍhati maṇḍalena, vaḍḍhati ābhāya, vaḍḍhati ārohapariṇāhena. Evameva kho, kassapa, yassa kassaci saddhā atthi kusalesu dhammesu hirī atthi… ottappaṃ atthi… vīriyaṃ atthi… paññā atthi kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni."
    ],
    "innerText": "‘‘Seyyathāpi, kassapa, juṇhapakkhe candassa yā ratti vā divaso vā āgacchati, vaḍḍhateva vaṇṇena, vaḍḍhati maṇḍalena, vaḍḍhati ābhāya, vaḍḍhati ārohapariṇāhena. Evameva kho, kassapa, yassa kassaci saddhā atthi kusalesu dhammesu hirī atthi… ottappaṃ atthi… vīriyaṃ atthi… paññā atthi kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Saddho purisapuggalo’ti, kassapa, aparihānametaṃ; hirimā…pe… ottappī… āraddhavīriyo… paññavā… akkodhano… ‘anupanāhī purisapuggalo’ti, kassapa, aparihānametaṃ; ‘santi bhikkhū ovādakā’ti, kassapa, aparihānameta’’nti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Tatiyaovādasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "151"
      },
      ". Rājagahe kalandakanivāpe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sāvatthi, ārāme (sī.)]"
      },
      ". Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami ",
      "; upasaṅkamitvā bhagavantaṃ ",
      " abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ mahākassapaṃ bhagavā etadavoca – ‘‘ovada, kassapa, bhikkhū; karohi, kassapa, bhikkhūnaṃ dhammiṃ kathaṃ. Ahaṃ vā, kassapa, bhikkhūnaṃ ovadeyyaṃ tvaṃ vā; ahaṃ vā bhikkhūnaṃ dhammiṃ kathaṃ kareyyaṃ tvaṃ vā’’ti."
    ],
    "innerText": "151. Rājagahe kalandakanivāpe [sāvatthi, ārāme (sī.)]. Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami ; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ mahākassapaṃ bhagavā etadavoca – ‘‘ovada, kassapa, bhikkhū; karohi, kassapa, bhikkhūnaṃ dhammiṃ kathaṃ. Ahaṃ vā, kassapa, bhikkhūnaṃ ovadeyyaṃ tvaṃ vā; ahaṃ vā bhikkhūnaṃ dhammiṃ kathaṃ kareyyaṃ tvaṃ vā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dubbacā kho, bhante, etarahi bhikkhū, dovacassakaraṇehi dhammehi samannāgatā, akkhamā, appadakkhiṇaggāhino anusāsanī’’nti. ‘‘Tathā hi pana, kassapa, pubbe therā bhikkhū āraññikā ceva ahesuṃ āraññikattassa ca vaṇṇavādino, piṇḍapātikā ceva ahesuṃ piṇḍapātikattassa ca vaṇṇavādino ",
      ", paṃsukūlikā ceva ahesuṃ paṃsukūlikattassa ca vaṇṇavādino, tecīvarikā ceva ahesuṃ tecīvarikattassa ca vaṇṇavādino, appicchā ceva ahesuṃ appicchatāya ca vaṇṇavādino, santuṭṭhā ceva ahesuṃ santuṭṭhiyā ca vaṇṇavādino, pavivittā ceva ahesuṃ pavivekassa ca vaṇṇavādino, asaṃsaṭṭhā ceva ahesuṃ ",
      " asaṃsaggassa ca vaṇṇavādino, āraddhavīriyā ceva ahesuṃ vīriyārambhassa ca vaṇṇavādino."
    ],
    "innerText": "‘‘Dubbacā kho, bhante, etarahi bhikkhū, dovacassakaraṇehi dhammehi samannāgatā, akkhamā, appadakkhiṇaggāhino anusāsanī’’nti. ‘‘Tathā hi pana, kassapa, pubbe therā bhikkhū āraññikā ceva ahesuṃ āraññikattassa ca vaṇṇavādino, piṇḍapātikā ceva ahesuṃ piṇḍapātikattassa ca vaṇṇavādino , paṃsukūlikā ceva ahesuṃ paṃsukūlikattassa ca vaṇṇavādino, tecīvarikā ceva ahesuṃ tecīvarikattassa ca vaṇṇavādino, appicchā ceva ahesuṃ appicchatāya ca vaṇṇavādino, santuṭṭhā ceva ahesuṃ santuṭṭhiyā ca vaṇṇavādino, pavivittā ceva ahesuṃ pavivekassa ca vaṇṇavādino, asaṃsaṭṭhā ceva ahesuṃ asaṃsaggassa ca vaṇṇavādino, āraddhavīriyā ceva ahesuṃ vīriyārambhassa ca vaṇṇavādino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra yo hoti bhikkhu āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva piṇḍapātikattassa ca vaṇṇavādī, paṃsukūliko ceva paṃsukūlikattassa ca vaṇṇavādī, tecīvariko ceva tecīvarikattassa ca vaṇṇavādī, appiccho ceva appicchatāya ca vaṇṇavādī, santuṭṭho ceva santuṭṭhiyā ca vaṇṇavādī, pavivitto ceva pavivekassa ca vaṇṇavādī, asaṃsaṭṭho ",
      " ceva asaṃsaggassa ca vaṇṇavādī, āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī, taṃ therā bhikkhū āsanena nimantenti – ‘ehi, bhikkhu, ko nāmāyaṃ bhikkhu, bhaddako vatāyaṃ bhikkhu, sikkhākāmo vatāyaṃ bhikkhu; ehi, bhikkhu, idaṃ āsanaṃ nisīdāhī’’’ti."
    ],
    "innerText": "‘‘Tatra yo hoti bhikkhu āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva piṇḍapātikattassa ca vaṇṇavādī, paṃsukūliko ceva paṃsukūlikattassa ca vaṇṇavādī, tecīvariko ceva tecīvarikattassa ca vaṇṇavādī, appiccho ceva appicchatāya ca vaṇṇavādī, santuṭṭho ceva santuṭṭhiyā ca vaṇṇavādī, pavivitto ceva pavivekassa ca vaṇṇavādī, asaṃsaṭṭho ceva asaṃsaggassa ca vaṇṇavādī, āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī, taṃ therā bhikkhū āsanena nimantenti – ‘ehi, bhikkhu, ko nāmāyaṃ bhikkhu, bhaddako vatāyaṃ bhikkhu, sikkhākāmo vatāyaṃ bhikkhu; ehi, bhikkhu, idaṃ āsanaṃ nisīdāhī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, kassapa, navānaṃ bhikkhūnaṃ evaṃ hoti – ‘yo kira so hoti bhikkhu āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva…pe… paṃsukūliko ceva… tecīvariko ceva… appiccho ceva… santuṭṭho ceva… pavivitto ceva… asaṃsaṭṭho ceva… āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī, taṃ therā bhikkhū āsanena nimantenti – ehi, bhikkhu, ko nāmāyaṃ bhikkhu, bhaddako vatāyaṃ bhikkhu, sikkhākāmo vatāyaṃ ",
      " bhikkhu; ehi, bhikkhu, idaṃ āsanaṃ nisīdāhī’ti. Te tathattāya paṭipajjanti; tesaṃ taṃ hoti dīgharattaṃ hitāya sukhāya."
    ],
    "innerText": "‘‘Tatra, kassapa, navānaṃ bhikkhūnaṃ evaṃ hoti – ‘yo kira so hoti bhikkhu āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva…pe… paṃsukūliko ceva… tecīvariko ceva… appiccho ceva… santuṭṭho ceva… pavivitto ceva… asaṃsaṭṭho ceva… āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī, taṃ therā bhikkhū āsanena nimantenti – ehi, bhikkhu, ko nāmāyaṃ bhikkhu, bhaddako vatāyaṃ bhikkhu, sikkhākāmo vatāyaṃ bhikkhu; ehi, bhikkhu, idaṃ āsanaṃ nisīdāhī’ti. Te tathattāya paṭipajjanti; tesaṃ taṃ hoti dīgharattaṃ hitāya sukhāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Etarahi pana, kassapa, therā bhikkhū na ceva āraññikā na ca āraññikattassa vaṇṇavādino, na ceva piṇḍapātikā na ca piṇḍapātikattassa vaṇṇavādino, na ceva paṃsukūlikā na ca paṃsukūlikattassa vaṇṇavādino, na ceva tecīvarikā na ca tecīvarikattassa vaṇṇavādino, na ceva appicchā na ca appicchatāya vaṇṇavādino, na ceva santuṭṭhā na ca santuṭṭhiyā vaṇṇavādino, na ceva pavivittā na ca pavivekassa vaṇṇavādino, na ceva asaṃsaṭṭhā na ca asaṃsaggassa vaṇṇavādino ",
      ", na ceva āraddhavīriyā na ",
      " ca vīriyārambhassa vaṇṇavādino."
    ],
    "innerText": "‘‘Etarahi pana, kassapa, therā bhikkhū na ceva āraññikā na ca āraññikattassa vaṇṇavādino, na ceva piṇḍapātikā na ca piṇḍapātikattassa vaṇṇavādino, na ceva paṃsukūlikā na ca paṃsukūlikattassa vaṇṇavādino, na ceva tecīvarikā na ca tecīvarikattassa vaṇṇavādino, na ceva appicchā na ca appicchatāya vaṇṇavādino, na ceva santuṭṭhā na ca santuṭṭhiyā vaṇṇavādino, na ceva pavivittā na ca pavivekassa vaṇṇavādino, na ceva asaṃsaṭṭhā na ca asaṃsaggassa vaṇṇavādino , na ceva āraddhavīriyā na ca vīriyārambhassa vaṇṇavādino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra ",
      " yo hoti bhikkhu ñāto yasassī lābhī cīvara-piṇḍapāta-senāsanagilānappaccayabhesajjaparikkhārānaṃ taṃ therā bhikkhū āsanena nimantenti – ‘ehi, bhikkhu, ko nāmāyaṃ bhikkhu, bhaddako vatāyaṃ bhikkhu, sabrahmacārikāmo vatāyaṃ bhikkhu; ehi, bhikkhu, idaṃ āsanaṃ nisīdāhī’’’ti."
    ],
    "innerText": "‘‘Tatra yo hoti bhikkhu ñāto yasassī lābhī cīvara-piṇḍapāta-senāsanagilānappaccayabhesajjaparikkhārānaṃ taṃ therā bhikkhū āsanena nimantenti – ‘ehi, bhikkhu, ko nāmāyaṃ bhikkhu, bhaddako vatāyaṃ bhikkhu, sabrahmacārikāmo vatāyaṃ bhikkhu; ehi, bhikkhu, idaṃ āsanaṃ nisīdāhī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, kassapa, navānaṃ bhikkhūnaṃ evaṃ hoti – ‘yo kira so hoti bhikkhu ñāto yasassī lābhī cīvara-piṇḍapāta-senāsana-gilānappaccayabhesajjaparikkhārānaṃ taṃ therā bhikkhū āsanena nimantenti – ehi, bhikkhu, ko nāmāyaṃ bhikkhu, bhaddako vatāyaṃ bhikkhu, sabrahmacārikāmo vatāyaṃ bhikkhu; ehi, bhikkhu, idaṃ āsanaṃ nisīdāhī’ti. Te tathattāya paṭipajjanti. Tesaṃ taṃ hoti dīgharattaṃ ahitāya dukkhāya. Yañhi taṃ, kassapa, sammā vadamāno vadeyya – ‘upaddutā brahmacārī brahmacārūpaddavena abhipatthanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhibhavanā (sī.)]"
      },
      " brahmacārī brahmacāriabhipatthanenā’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[brahmacāriabhibhavanenāti (sī.)]"
      },
      ", etarahi taṃ, kassapa, sammā vadamāno vadeyya – ‘upaddutā brahmacārī brahmacārūpaddavena abhipatthanā brahmacārī brahmacāriabhipatthanenā’’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "‘‘Tatra, kassapa, navānaṃ bhikkhūnaṃ evaṃ hoti – ‘yo kira so hoti bhikkhu ñāto yasassī lābhī cīvara-piṇḍapāta-senāsana-gilānappaccayabhesajjaparikkhārānaṃ taṃ therā bhikkhū āsanena nimantenti – ehi, bhikkhu, ko nāmāyaṃ bhikkhu, bhaddako vatāyaṃ bhikkhu, sabrahmacārikāmo vatāyaṃ bhikkhu; ehi, bhikkhu, idaṃ āsanaṃ nisīdāhī’ti. Te tathattāya paṭipajjanti. Tesaṃ taṃ hoti dīgharattaṃ ahitāya dukkhāya. Yañhi taṃ, kassapa, sammā vadamāno vadeyya – ‘upaddutā brahmacārī brahmacārūpaddavena abhipatthanā [abhibhavanā (sī.)] brahmacārī brahmacāriabhipatthanenā’ti [brahmacāriabhibhavanenāti (sī.)], etarahi taṃ, kassapa, sammā vadamāno vadeyya – ‘upaddutā brahmacārī brahmacārūpaddavena abhipatthanā brahmacārī brahmacāriabhipatthanenā’’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Jhānābhiññasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "152"
      },
      ". Sāvatthiyaṃ viharati…pe… ‘‘ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi vivicceva kāmehi ",
      " vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi. Kassapopi ",
      ", bhikkhave, yāvadeva ākaṅkhati vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati’’."
    ],
    "innerText": "152. Sāvatthiyaṃ viharati…pe… ‘‘ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi. Kassapopi , bhikkhave, yāvadeva ākaṅkhati vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahaṃ ",
      ", bhikkhave, yāvadeva ākaṅkhāmi vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharati."
    ],
    "innerText": "‘‘Ahaṃ , bhikkhave, yāvadeva ākaṅkhāmi vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi pītiyā ca virāgā upekkhako ca viharāmi sato ca sampajāno sukhañca kāyena paṭisaṃvedemi, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati pītiyā ",
      " ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati."
    ],
    "innerText": "‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi pītiyā ca virāgā upekkhako ca viharāmi sato ca sampajāno sukhañca kāyena paṭisaṃvedemi, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati sukhassa ca pahānā …pe… catutthaṃ jhānaṃ upasampajja viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ananto ākāsoti ākāsānañcāyatanaṃ upasampajja viharāmi. Kassapopi ",
      ", bhikkhave, yāvadeva ākaṅkhati sabbaso rūpasaññānaṃ samatikkamā…pe… ākāsānañcāyatanaṃ upasampajja viharati."
    ],
    "innerText": "‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ananto ākāsoti ākāsānañcāyatanaṃ upasampajja viharāmi. Kassapopi , bhikkhave, yāvadeva ākaṅkhati sabbaso rūpasaññānaṃ samatikkamā…pe… ākāsānañcāyatanaṃ upasampajja viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ ",
      " viññāṇanti viññāṇañcāyatanaṃ upasampajja viharāmi. Kassapopi ",
      ", bhikkhave, yāvadeva ākaṅkhati sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ viññāṇanti viññāṇañcāyatanaṃ upasampajja viharati."
    ],
    "innerText": "‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ viññāṇanti viññāṇañcāyatanaṃ upasampajja viharāmi. Kassapopi , bhikkhave, yāvadeva ākaṅkhati sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ viññāṇanti viññāṇañcāyatanaṃ upasampajja viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati…pe… ākiñcaññāyatanaṃ upasampajja viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati…pe… nevasaññānāsaññāyatanaṃ upasampajja viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharāmi. Kassapopi, bhikkhave…pe… saññāvedayitanirodhaṃ upasampajja viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahaṃ ",
      ", bhikkhave, yāvadeva ākaṅkhāmi anekavihitaṃ iddhividhaṃ paccanubhomi ",
      " – ekopi hutvā bahudhā homi, bahudhāpi hutvā eko homi; āvibhāvaṃ, tirobhāvaṃ, tirokuṭṭaṃ, tiropākāraṃ, tiropabbataṃ, asajjamāno gacchāmi, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karomi, seyyathāpi udake; udakepi abhijjamāne gacchāmi, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamāmi, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasāmi parimajjāmi; yāva brahmalokāpi kāyena vasaṃ vattemi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati anekavihitaṃ iddhividhaṃ paccanubhoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti."
    ],
    "innerText": "‘‘Ahaṃ , bhikkhave, yāvadeva ākaṅkhāmi anekavihitaṃ iddhividhaṃ paccanubhomi – ekopi hutvā bahudhā homi, bahudhāpi hutvā eko homi; āvibhāvaṃ, tirobhāvaṃ, tirokuṭṭaṃ, tiropākāraṃ, tiropabbataṃ, asajjamāno gacchāmi, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karomi, seyyathāpi udake; udakepi abhijjamāne gacchāmi, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamāmi, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasāmi parimajjāmi; yāva brahmalokāpi kāyena vasaṃ vattemi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati anekavihitaṃ iddhividhaṃ paccanubhoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāmi, dibbe ca mānuse ca, ye dūre santike ca. Kassapopi, bhikkhave, yāvadeva ākaṅkhati dibbāya sotadhātuyā…pe… dūre santike ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahaṃ ",
      ", bhikkhave, yāvadeva ākaṅkhāmi parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajānāmi – sarāgaṃ vā cittaṃ sarāgaṃ cittanti pajānāmi, vītarāgaṃ vā cittaṃ vītarāgaṃ cittanti pajānāmi, sadosaṃ vā cittaṃ…pe… vītadosaṃ vā cittaṃ… samohaṃ vā cittaṃ… vītamohaṃ vā cittaṃ… saṃkhittaṃ vā cittaṃ… vikkhittaṃ vā cittaṃ… mahaggataṃ vā cittaṃ… amahaggataṃ vā cittaṃ… sauttaraṃ vā cittaṃ… anuttaraṃ vā cittaṃ… samāhitaṃ vā cittaṃ… asamāhitaṃ vā cittaṃ… vimuttaṃ vā cittaṃ… avimuttaṃ vā cittaṃ avimuttaṃ cittanti pajānāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati parasattānaṃ ",
      " parapuggalānaṃ cetasā ceto paricca pajānāti – sarāgaṃ vā cittaṃ sarāgaṃ cittanti pajānāti…pe… avimuttaṃ vā cittaṃ avimuttaṃ cittanti pajānāti."
    ],
    "innerText": "‘‘Ahaṃ , bhikkhave, yāvadeva ākaṅkhāmi parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajānāmi – sarāgaṃ vā cittaṃ sarāgaṃ cittanti pajānāmi, vītarāgaṃ vā cittaṃ vītarāgaṃ cittanti pajānāmi, sadosaṃ vā cittaṃ…pe… vītadosaṃ vā cittaṃ… samohaṃ vā cittaṃ… vītamohaṃ vā cittaṃ… saṃkhittaṃ vā cittaṃ… vikkhittaṃ vā cittaṃ… mahaggataṃ vā cittaṃ… amahaggataṃ vā cittaṃ… sauttaraṃ vā cittaṃ… anuttaraṃ vā cittaṃ… samāhitaṃ vā cittaṃ… asamāhitaṃ vā cittaṃ… vimuttaṃ vā cittaṃ… avimuttaṃ vā cittaṃ avimuttaṃ cittanti pajānāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajānāti – sarāgaṃ vā cittaṃ sarāgaṃ cittanti pajānāti…pe… avimuttaṃ vā cittaṃ avimuttaṃ cittanti pajānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi anekavihitaṃ pubbenivāsaṃ anussarāmi, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi, anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto ",
      ", so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati."
    ],
    "innerText": "‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi anekavihitaṃ pubbenivāsaṃ anussarāmi, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi, anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto , so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi dibbena cakkhunā visuddhena atikkantamānusakena satte passāmi cavamāne ",
      " upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte ",
      " pajānāmi – ‘ime vata, bhonto, sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā; te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā, ime vā pana, bhonto, sattā kāyasucaritena samannāgatā vacīsucaritena ",
      " samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā; te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passāmi cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne…pe… yathākammūpage satte pajānāti."
    ],
    "innerText": "‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi dibbena cakkhunā visuddhena atikkantamānusakena satte passāmi cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāmi – ‘ime vata, bhonto, sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā; te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā, ime vā pana, bhonto, sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā; te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passāmi cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne…pe… yathākammūpage satte pajānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ahaṃ, bhikkhave, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharāmi. Kassapopi, bhikkhave, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Upassayasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "153"
      },
      ". Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā mahākassapo sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā ",
      " ānando pubbaṇhasamayaṃ nivāsetvā ",
      " pattacīvaramādāya yenāyasmā ",
      " mahākassapo tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahākassapaṃ etadavoca – ‘‘āyāma, bhante kassapa, yena aññataro bhikkhunupassayo tenupasaṅkamissāmā’’ti. ‘‘Gaccha tvaṃ, āvuso ānanda, bahukicco tvaṃ bahukaraṇīyo’’ti. Dutiyampi kho āyasmā ānando āyasmantaṃ mahākassapaṃ etadavoca – ‘‘āyāma, bhante kassapa, yena aññataro bhikkhunupassayo tenupasaṅkamissāmā’’ti. ‘‘Gaccha tvaṃ, āvuso ānanda, bahukicco tvaṃ bahukaraṇīyo’’ti. Tatiyampi kho āyasmā ānando āyasmantaṃ mahākassapaṃ etadavoca – ‘‘āyāma, bhante kassapa, yena aññataro bhikkhunupassayo tenupasaṅkamissāmā’’ti."
    ],
    "innerText": "153. Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā mahākassapo sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā ānando pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yenāyasmā mahākassapo tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahākassapaṃ etadavoca – ‘‘āyāma, bhante kassapa, yena aññataro bhikkhunupassayo tenupasaṅkamissāmā’’ti. ‘‘Gaccha tvaṃ, āvuso ānanda, bahukicco tvaṃ bahukaraṇīyo’’ti. Dutiyampi kho āyasmā ānando āyasmantaṃ mahākassapaṃ etadavoca – ‘‘āyāma, bhante kassapa, yena aññataro bhikkhunupassayo tenupasaṅkamissāmā’’ti. ‘‘Gaccha tvaṃ, āvuso ānanda, bahukicco tvaṃ bahukaraṇīyo’’ti. Tatiyampi kho āyasmā ānando āyasmantaṃ mahākassapaṃ etadavoca – ‘‘āyāma, bhante kassapa, yena aññataro bhikkhunupassayo tenupasaṅkamissāmā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmā mahākassapo pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya āyasmatā ānandena pacchāsamaṇena yena aññataro bhikkhunupassayo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho sambahulā bhikkhuniyo yenāyasmā mahākassapo tenupasaṅkamiṃsu; upasaṅkamitvā ",
      " āyasmantaṃ mahākassapaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho tā bhikkhuniyo āyasmā mahākassapo dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi. Atha kho āyasmā mahākassapo tā bhikkhuniyo dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā uṭṭhāyāsanā pakkāmi."
    ],
    "innerText": "Atha kho āyasmā mahākassapo pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya āyasmatā ānandena pacchāsamaṇena yena aññataro bhikkhunupassayo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho sambahulā bhikkhuniyo yenāyasmā mahākassapo tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ mahākassapaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho tā bhikkhuniyo āyasmā mahākassapo dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi. Atha kho āyasmā mahākassapo tā bhikkhuniyo dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā uṭṭhāyāsanā pakkāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho thullatissā bhikkhunī anattamanā anattamanavācaṃ nicchāresi – ‘‘kiṃ pana ayyo mahākassapo, ayyassa ānandassa vedehamunino sammukhā dhammaṃ bhāsitabbaṃ maññati? Seyyathāpi nāma sūcivāṇijako sūcikārassa ",
      " santike sūciṃ vikketabbaṃ maññeyya; evameva ayyo mahākassapo ayyassa ānandassa vedehamunino sammukhā dhammaṃ bhāsitabbaṃ maññatī’’ti."
    ],
    "innerText": "Atha kho thullatissā bhikkhunī anattamanā anattamanavācaṃ nicchāresi – ‘‘kiṃ pana ayyo mahākassapo, ayyassa ānandassa vedehamunino sammukhā dhammaṃ bhāsitabbaṃ maññati? Seyyathāpi nāma sūcivāṇijako sūcikārassa santike sūciṃ vikketabbaṃ maññeyya; evameva ayyo mahākassapo ayyassa ānandassa vedehamunino sammukhā dhammaṃ bhāsitabbaṃ maññatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Assosi kho āyasmā mahākassapo thullatissāya bhikkhuniyā imaṃ vācaṃ bhāsamānāya. Atha kho āyasmā mahākassapo āyasmantaṃ ānandaṃ etadavoca – ‘‘kiṃ nu kho, āvuso ānanda, ahaṃ sūcivāṇijako, tvaṃ sūcikāro; udāhu ahaṃ sūcikāro, tvaṃ sūcivāṇijako’’ti? ‘‘Khama ",
      ", bhante kassapa, bālo mātugāmo’’ti. ‘‘Āgamehi tvaṃ, āvuso ānanda, mā te saṅgho uttari upaparikkhi’’."
    ],
    "innerText": "Assosi kho āyasmā mahākassapo thullatissāya bhikkhuniyā imaṃ vācaṃ bhāsamānāya. Atha kho āyasmā mahākassapo āyasmantaṃ ānandaṃ etadavoca – ‘‘kiṃ nu kho, āvuso ānanda, ahaṃ sūcivāṇijako, tvaṃ sūcikāro; udāhu ahaṃ sūcikāro, tvaṃ sūcivāṇijako’’ti? ‘‘Khama , bhante kassapa, bālo mātugāmo’’ti. ‘‘Āgamehi tvaṃ, āvuso ānanda, mā te saṅgho uttari upaparikkhi’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Taṃ kiṃ maññasi, āvuso ānanda, api nu tvaṃ bhagavato sammukhā bhikkhusaṅghe upanīto – ‘ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi. Ānandopi, bhikkhave, yāvadeva ākaṅkhati vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharatī’’’ti? ‘‘No hetaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahaṃ kho, āvuso, bhagavato sammukhā bhikkhusaṅghe upanīto – ‘ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi vivicceva kāmehi ",
      " vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati vivicceva kāmehi vivicca akusalehi dhammehi…pe… paṭhamaṃ jhānaṃ upasampajja viharatī’ti…pe… ",
      ". (Navannaṃ anupubbavihārasamāpattīnaṃ pañcannañca abhiññānaṃ evaṃ vitthāro veditabbo.)"
    ],
    "innerText": "‘‘Ahaṃ kho, āvuso, bhagavato sammukhā bhikkhusaṅghe upanīto – ‘ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati vivicceva kāmehi vivicca akusalehi dhammehi…pe… paṭhamaṃ jhānaṃ upasampajja viharatī’ti…pe… . (Navannaṃ anupubbavihārasamāpattīnaṃ pañcannañca abhiññānaṃ evaṃ vitthāro veditabbo.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ ",
      " kiṃ maññasi, āvuso ānanda, api nu tvaṃ bhagavato sammukhā bhikkhusaṅghe upanīto – ‘ahaṃ, bhikkhave, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharāmi. Ānandopi, bhikkhave, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’’ti? ‘‘No hetaṃ, bhante’’."
    ],
    "innerText": "‘‘Taṃ kiṃ maññasi, āvuso ānanda, api nu tvaṃ bhagavato sammukhā bhikkhusaṅghe upanīto – ‘ahaṃ, bhikkhave, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharāmi. Ānandopi, bhikkhave, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’’ti? ‘‘No hetaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ahaṃ kho, āvuso, bhagavato sammukhā bhikkhusaṅghe upanīto – ‘ahaṃ, bhikkhave, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharāmi. Kassapopi, bhikkhave, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sattaratanaṃ vā, āvuso, nāgaṃ aḍḍhaṭṭhamaratanaṃ vā tālapattikāya chādetabbaṃ maññeyya, yo me cha abhiññā chādetabbaṃ maññeyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Cavittha ca pana thullatissā bhikkhunī brahmacariyamhāti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Cīvarasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "154"
      },
      ". Ekaṃ ",
      " samayaṃ āyasmā mahākassapo rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena āyasmā ānando dakkhiṇagirismiṃ cārikaṃ carati mahatā bhikkhusaṅghena saddhiṃ."
    ],
    "innerText": "154. Ekaṃ samayaṃ āyasmā mahākassapo rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena āyasmā ānando dakkhiṇagirismiṃ cārikaṃ carati mahatā bhikkhusaṅghena saddhiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena āyasmato ānandassa tiṃsamattā saddhivihārino bhikkhū sikkhaṃ paccakkhāya hīnāyāvattā bhavanti yebhuyyena kumārabhūtā. Atha ",
      " kho āyasmā ānando dakkhiṇagirismiṃ yathābhirantaṃ cārikaṃ caritvā yena rājagahaṃ veḷuvanaṃ kalandakanivāpo yenāyasmā mahākassapo tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahākassapaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ āyasmā mahākassapo ",
      " etadavoca – ‘‘kati nu kho, āvuso ānanda, atthavase paṭicca bhagavatā kulesu tikabhojanaṃ paññatta’’nti?"
    ],
    "innerText": "Tena kho pana samayena āyasmato ānandassa tiṃsamattā saddhivihārino bhikkhū sikkhaṃ paccakkhāya hīnāyāvattā bhavanti yebhuyyena kumārabhūtā. Atha kho āyasmā ānando dakkhiṇagirismiṃ yathābhirantaṃ cārikaṃ caritvā yena rājagahaṃ veḷuvanaṃ kalandakanivāpo yenāyasmā mahākassapo tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahākassapaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ āyasmā mahākassapo etadavoca – ‘‘kati nu kho, āvuso ānanda, atthavase paṭicca bhagavatā kulesu tikabhojanaṃ paññatta’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tayo kho, bhante kassapa, atthavase paṭicca bhagavatā kulesu tikabhojanaṃ paññattaṃ – dummaṅkūnaṃ puggalānaṃ niggahāya pesalānaṃ bhikkhūnaṃ phāsuvihārāya, mā pāpicchā pakkhaṃ nissāya saṅghaṃ bhindeyyuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vinayapiṭake cūḷavagge saṃghabhedakakkhandhake vajirabuddhiyaṃ aññathā sambandho dassito]"
      },
      ", kulānuddayatāya ca. Ime kho, bhante kassapa, tayo atthavase paṭicca bhagavatā kulesu tikabhojanaṃ paññatta’’nti."
    ],
    "innerText": "‘‘Tayo kho, bhante kassapa, atthavase paṭicca bhagavatā kulesu tikabhojanaṃ paññattaṃ – dummaṅkūnaṃ puggalānaṃ niggahāya pesalānaṃ bhikkhūnaṃ phāsuvihārāya, mā pāpicchā pakkhaṃ nissāya saṅghaṃ bhindeyyuṃ [vinayapiṭake cūḷavagge saṃghabhedakakkhandhake vajirabuddhiyaṃ aññathā sambandho dassito], kulānuddayatāya ca. Ime kho, bhante kassapa, tayo atthavase paṭicca bhagavatā kulesu tikabhojanaṃ paññatta’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha kiñcarahi tvaṃ, āvuso ānanda, imehi navehi bhikkhūhi indriyesu aguttadvārehi bhojane amattaññūhi jāgariyaṃ ananuyuttehi saddhiṃ cārikaṃ carasi? Sassaghātaṃ maññe carasi, kulūpaghātaṃ maññe carasi. Olujjati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ullujjati (sī. aṭṭhakathāsu ca)]"
      },
      " kho te, āvuso ānanda, parisā; palujjanti kho ",
      " te, āvuso, navappāyā. Na vāyaṃ kumārako mattamaññāsī’’ti."
    ],
    "innerText": "‘‘Atha kiñcarahi tvaṃ, āvuso ānanda, imehi navehi bhikkhūhi indriyesu aguttadvārehi bhojane amattaññūhi jāgariyaṃ ananuyuttehi saddhiṃ cārikaṃ carasi? Sassaghātaṃ maññe carasi, kulūpaghātaṃ maññe carasi. Olujjati [ullujjati (sī. aṭṭhakathāsu ca)] kho te, āvuso ānanda, parisā; palujjanti kho te, āvuso, navappāyā. Na vāyaṃ kumārako mattamaññāsī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Api me, bhante kassapa, sirasmiṃ palitāni jātāni. Atha ca pana mayaṃ ajjāpi āyasmato mahākassapassa kumārakavādā na muccāmā’’ti. ‘‘Tathā ",
      " hi pana tvaṃ, āvuso ānanda, imehi navehi bhikkhūhi indriyesu aguttadvārehi bhojane amattaññūhi jāgariyaṃ ananuyuttehi saddhiṃ cārikaṃ carasi, sassaghātaṃ maññe carasi, kulūpaghātaṃ maññe carasi. Olujjati ",
      " kho te, āvuso ānanda, parisā; palujjanti kho te, āvuso, navappāyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[palujjati kho te āvuso ānanda parisā (ka. sī.)]"
      },
      " Na vāyaṃ kumārako mattamaññāsī’’ti."
    ],
    "innerText": "‘‘Api me, bhante kassapa, sirasmiṃ palitāni jātāni. Atha ca pana mayaṃ ajjāpi āyasmato mahākassapassa kumārakavādā na muccāmā’’ti. ‘‘Tathā hi pana tvaṃ, āvuso ānanda, imehi navehi bhikkhūhi indriyesu aguttadvārehi bhojane amattaññūhi jāgariyaṃ ananuyuttehi saddhiṃ cārikaṃ carasi, sassaghātaṃ maññe carasi, kulūpaghātaṃ maññe carasi. Olujjati kho te, āvuso ānanda, parisā; palujjanti kho te, āvuso, navappāyā. [palujjati kho te āvuso ānanda parisā (ka. sī.)] Na vāyaṃ kumārako mattamaññāsī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Assosi kho thullanandā bhikkhunī – ‘‘ayyena kira mahākassapena ayyo ānando vedehamuni kumārakavādena apasādito’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho thullanandā bhikkhunī anattamanā anattamanavācaṃ nicchāresi – ‘‘kiṃ pana ayyo mahākassapo aññatitthiyapubbo samāno ayyaṃ ānandaṃ vedehamuniṃ kumārakavādena apasādetabbaṃ maññatī’’ti! Assosi kho āyasmā mahākassapo thullanandāya bhikkhuniyā imaṃ vācaṃ bhāsamānāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho āyasmā mahākassapo āyasmantaṃ ānandaṃ etadavoca – ‘‘tagghāvuso ānanda, thullanandāya bhikkhuniyā sahasā appaṭisaṅkhā vācā bhāsitā. Yatvāhaṃ, āvuso, kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajito, nābhijānāmi aññaṃ satthāraṃ uddisitā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[uddisituṃ (sī. pī. ka.)]"
      },
      ", aññatra tena bhagavatā arahatā ",
      " sammāsambuddhena. Pubbe me, āvuso, agārikabhūtassa sato etadahosi – ‘sambādho gharāvāso rajāpatho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[rajopatho (sī.)]"
      },
      ", abbhokāso pabbajjā. Nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ. Yaṃnūnāhaṃ kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajeyya’nti. So khvāhaṃ, āvuso, aparena samayena paṭapilotikānaṃ ",
      " saṅghāṭiṃ kāretvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[karitvā (sī. syā. kaṃ. pī.)]"
      },
      " ye loke arahanto te uddissa kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajiṃ."
    ],
    "innerText": "Atha kho āyasmā mahākassapo āyasmantaṃ ānandaṃ etadavoca – ‘‘tagghāvuso ānanda, thullanandāya bhikkhuniyā sahasā appaṭisaṅkhā vācā bhāsitā. Yatvāhaṃ, āvuso, kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajito, nābhijānāmi aññaṃ satthāraṃ uddisitā [uddisituṃ (sī. pī. ka.)], aññatra tena bhagavatā arahatā sammāsambuddhena. Pubbe me, āvuso, agārikabhūtassa sato etadahosi – ‘sambādho gharāvāso rajāpatho [rajopatho (sī.)], abbhokāso pabbajjā. Nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ. Yaṃnūnāhaṃ kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajeyya’nti. So khvāhaṃ, āvuso, aparena samayena paṭapilotikānaṃ saṅghāṭiṃ kāretvā [karitvā (sī. syā. kaṃ. pī.)] ye loke arahanto te uddissa kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So evaṃ pabbajito samāno addhānamaggappaṭipanno addasaṃ bhagavantaṃ antarā ca rājagahaṃ antarā ca nāḷandaṃ bahuputte cetiye nisinnaṃ. Disvāna me etadahosi – ‘satthārañca vatāhaṃ passeyyaṃ, bhagavantameva passeyyaṃ; sugatañca vatāhaṃ passeyyaṃ, bhagavantameva passeyyaṃ; sammāsambuddhañca vatāhaṃ passeyyaṃ; bhagavantameva passeyya’nti. So khvāhaṃ, āvuso, tattheva bhagavato pādesu sirasā nipatitvā bhagavantaṃ etadavocaṃ – ‘satthā me, bhante, bhagavā, sāvakohamasmi; satthā me, bhante, bhagavā, sāvakohamasmī’ti ",
      ". Evaṃ vutte maṃ, āvuso, bhagavā etadavoca – ‘yo kho, kassapa, evaṃ sabbacetasā samannāgataṃ sāvakaṃ ajānaññeva vadeyya jānāmīti, apassaññeva vadeyya passāmīti, muddhāpi tassa vipateyya. Ahaṃ kho pana, kassapa, jānaññeva vadāmi jānāmīti, passaññeva ",
      " vadāmi passāmī’ti."
    ],
    "innerText": "So evaṃ pabbajito samāno addhānamaggappaṭipanno addasaṃ bhagavantaṃ antarā ca rājagahaṃ antarā ca nāḷandaṃ bahuputte cetiye nisinnaṃ. Disvāna me etadahosi – ‘satthārañca vatāhaṃ passeyyaṃ, bhagavantameva passeyyaṃ; sugatañca vatāhaṃ passeyyaṃ, bhagavantameva passeyyaṃ; sammāsambuddhañca vatāhaṃ passeyyaṃ; bhagavantameva passeyya’nti. So khvāhaṃ, āvuso, tattheva bhagavato pādesu sirasā nipatitvā bhagavantaṃ etadavocaṃ – ‘satthā me, bhante, bhagavā, sāvakohamasmi; satthā me, bhante, bhagavā, sāvakohamasmī’ti . Evaṃ vutte maṃ, āvuso, bhagavā etadavoca – ‘yo kho, kassapa, evaṃ sabbacetasā samannāgataṃ sāvakaṃ ajānaññeva vadeyya jānāmīti, apassaññeva vadeyya passāmīti, muddhāpi tassa vipateyya. Ahaṃ kho pana, kassapa, jānaññeva vadāmi jānāmīti, passaññeva vadāmi passāmī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmātiha te, kassapa, evaṃ sikkhitabbaṃ – ‘tibbaṃ me hirottappaṃ paccupaṭṭhitaṃ bhavissati theresu navesu majjhimesū’ti. Evañhi te, kassapa, sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmātiha te, kassapa, evaṃ sikkhitabbaṃ – ‘yaṃ kiñci dhammaṃ suṇissāmi kusalūpasaṃhitaṃ sabbaṃ taṃ aṭṭhiṃ katvā manasi karitvā sabbacetasā samannāharitvā ohitasoto dhammaṃ suṇissāmī’ti. Evañhi te, kassapa, sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmātiha ",
      " te, kassapa, evaṃ sikkhitabbaṃ – ‘sātasahagatā ca me kāyagatāsati na vijahissatī’ti. Evañhi te, kassapa, sikkhitabbanti."
    ],
    "innerText": "Tasmātiha te, kassapa, evaṃ sikkhitabbaṃ – ‘sātasahagatā ca me kāyagatāsati na vijahissatī’ti. Evañhi te, kassapa, sikkhitabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha kho maṃ, āvuso, bhagavā iminā ovādena ovaditvā uṭṭhāyāsanā pakkāmi. Sattāhameva ",
      " khvāhaṃ, āvuso, saraṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sāṇo (sī.)]"
      },
      " raṭṭhapiṇḍaṃ bhuñjiṃ’’. Aṭṭhamiyā aññā udapādi."
    ],
    "innerText": "‘‘Atha kho maṃ, āvuso, bhagavā iminā ovādena ovaditvā uṭṭhāyāsanā pakkāmi. Sattāhameva khvāhaṃ, āvuso, saraṇo [sāṇo (sī.)] raṭṭhapiṇḍaṃ bhuñjiṃ’’. Aṭṭhamiyā aññā udapādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha kho, āvuso, bhagavā maggā okkamma yena aññataraṃ rukkhamūlaṃ tenupasaṅkami. Atha khvāhaṃ, āvuso, paṭapilotikānaṃ saṅghāṭiṃ catugguṇaṃ paññapetvā bhagavantaṃ etadavocaṃ – ‘idha, bhante, bhagavā nisīdatu, yaṃ mamassa dīgharattaṃ hitāya sukhāyā’ti. Nisīdi kho, āvuso, bhagavā paññatte āsane. Nisajja kho maṃ, āvuso, bhagavā etadavoca – ‘mudukā kho tyāyaṃ, kassapa, paṭapilotikānaṃ saṅghāṭī’ti. ‘Paṭiggaṇhātu me, bhante, bhagavā paṭapilotikānaṃ saṅghāṭiṃ anukampaṃ upādāyā’ti. ‘Dhāressasi pana me tvaṃ, kassapa, sāṇāni paṃsukūlāni nibbasanānī’ti. ‘Dhāressāmahaṃ, bhante, bhagavato sāṇāni paṃsukūlāni nibbasanānī’ti. ‘‘So ",
      " khvāhaṃ, āvuso, paṭapilotikānaṃ saṅghāṭiṃ bhagavato pādāsiṃ. Ahaṃ pana bhagavato sāṇāni paṃsukūlāni nibbasanāni paṭipajjiṃ’’."
    ],
    "innerText": "‘‘Atha kho, āvuso, bhagavā maggā okkamma yena aññataraṃ rukkhamūlaṃ tenupasaṅkami. Atha khvāhaṃ, āvuso, paṭapilotikānaṃ saṅghāṭiṃ catugguṇaṃ paññapetvā bhagavantaṃ etadavocaṃ – ‘idha, bhante, bhagavā nisīdatu, yaṃ mamassa dīgharattaṃ hitāya sukhāyā’ti. Nisīdi kho, āvuso, bhagavā paññatte āsane. Nisajja kho maṃ, āvuso, bhagavā etadavoca – ‘mudukā kho tyāyaṃ, kassapa, paṭapilotikānaṃ saṅghāṭī’ti. ‘Paṭiggaṇhātu me, bhante, bhagavā paṭapilotikānaṃ saṅghāṭiṃ anukampaṃ upādāyā’ti. ‘Dhāressasi pana me tvaṃ, kassapa, sāṇāni paṃsukūlāni nibbasanānī’ti. ‘Dhāressāmahaṃ, bhante, bhagavato sāṇāni paṃsukūlāni nibbasanānī’ti. ‘‘So khvāhaṃ, āvuso, paṭapilotikānaṃ saṅghāṭiṃ bhagavato pādāsiṃ. Ahaṃ pana bhagavato sāṇāni paṃsukūlāni nibbasanāni paṭipajjiṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yañhi taṃ, āvuso, sammā vadamāno vadeyya – ‘bhagavato putto oraso mukhato jāto dhammajo dhammanimmito dhammadāyādo, paṭiggahitāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṭiggahetā (sī.)]"
      },
      " sāṇāni paṃsukūlāni nibbasanānī’ti, mamaṃ taṃ sammā vadamāno vadeyya – ‘bhagavato putto oraso mukhato jāto dhammajo dhammanimmito dhammadāyādo, paṭiggahitāni sāṇāni paṃsukūlāni nibbasanānī’’’ti."
    ],
    "innerText": "‘‘Yañhi taṃ, āvuso, sammā vadamāno vadeyya – ‘bhagavato putto oraso mukhato jāto dhammajo dhammanimmito dhammadāyādo, paṭiggahitāni [paṭiggahetā (sī.)] sāṇāni paṃsukūlāni nibbasanānī’ti, mamaṃ taṃ sammā vadamāno vadeyya – ‘bhagavato putto oraso mukhato jāto dhammajo dhammanimmito dhammadāyādo, paṭiggahitāni sāṇāni paṃsukūlāni nibbasanānī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahaṃ kho, āvuso, yāvadeva ākaṅkhāmi vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ ",
      " pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi. Ahaṃ kho, āvuso, yāvade ākaṅkhāmi…pe… (navannaṃ anupubbavihārasamāpattinaṃ pañcannañca abhiññānaṃ evaṃ vitthāro veditabbo) ",
      "."
    ],
    "innerText": "‘‘Ahaṃ kho, āvuso, yāvadeva ākaṅkhāmi vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi. Ahaṃ kho, āvuso, yāvade ākaṅkhāmi…pe… (navannaṃ anupubbavihārasamāpattinaṃ pañcannañca abhiññānaṃ evaṃ vitthāro veditabbo) ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ahaṃ kho, āvuso, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharāmi; sattaratanaṃ vā, āvuso, nāgaṃ aḍḍhaṭṭhamaratanaṃ vā tālapattikāya chādetabbaṃ maññeyya, yo me cha abhiññā chādetabbaṃ maññeyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Cavittha ca pana thullanandā bhikkhunī brahmacariyamhāti. Ekādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "12. Paraṃmaraṇasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "155"
      },
      ". Ekaṃ samayaṃ āyasmā ca mahākassapo āyasmā ca sāriputto ",
      " bārāṇasiyaṃ viharanti isipatane migadāye. Atha kho āyasmā sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā mahākassapo tenupasaṅkami; upasaṅkamitvā āyasmatā mahākassapena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ mahākassapaṃ etadavoca – ‘‘kiṃ nu kho, āvuso kassapa, hoti tathāgato paraṃ maraṇā’’ti? ‘‘Abyākataṃ kho etaṃ, āvuso, bhagavatā – ‘hoti tathāgato paraṃ maraṇā’’’ti. ‘‘Kiṃ panāvuso, na hoti tathāgato paraṃ maraṇā’’ti? ‘‘Evampi kho, āvuso, abyākataṃ bhagavatā – ‘na hoti tathāgato paraṃ maraṇā’’’ti. ‘‘Kiṃ ",
      " nu kho, āvuso, hoti ca na ca hoti tathāgato paraṃ maraṇā’’ti? ‘‘Abyākataṃ kho etaṃ, āvuso, bhagavatā – ‘hoti ca na ca hoti tathāgato paraṃ maraṇā’’’ti. ‘‘Kiṃ panāvuso, neva hoti, na na hoti tathāgato paraṃ maraṇā’’ti? ‘‘Evampi kho, āvuso, abyākataṃ bhagavatā – ‘neva hoti na na hoti tathāgato ",
      " paraṃ maraṇā’’’ti. ‘‘Kasmā cetaṃ, āvuso ",
      ", abyākataṃ bhagavatā’’ti? ‘‘Na hetaṃ, āvuso, atthasaṃhitaṃ nādibrahmacariyakaṃ na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati. Tasmā taṃ abyākataṃ bhagavatā’’ti."
    ],
    "innerText": "155. Ekaṃ samayaṃ āyasmā ca mahākassapo āyasmā ca sāriputto bārāṇasiyaṃ viharanti isipatane migadāye. Atha kho āyasmā sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā mahākassapo tenupasaṅkami; upasaṅkamitvā āyasmatā mahākassapena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ mahākassapaṃ etadavoca – ‘‘kiṃ nu kho, āvuso kassapa, hoti tathāgato paraṃ maraṇā’’ti? ‘‘Abyākataṃ kho etaṃ, āvuso, bhagavatā – ‘hoti tathāgato paraṃ maraṇā’’’ti. ‘‘Kiṃ panāvuso, na hoti tathāgato paraṃ maraṇā’’ti? ‘‘Evampi kho, āvuso, abyākataṃ bhagavatā – ‘na hoti tathāgato paraṃ maraṇā’’’ti. ‘‘Kiṃ nu kho, āvuso, hoti ca na ca hoti tathāgato paraṃ maraṇā’’ti? ‘‘Abyākataṃ kho etaṃ, āvuso, bhagavatā – ‘hoti ca na ca hoti tathāgato paraṃ maraṇā’’’ti. ‘‘Kiṃ panāvuso, neva hoti, na na hoti tathāgato paraṃ maraṇā’’ti? ‘‘Evampi kho, āvuso, abyākataṃ bhagavatā – ‘neva hoti na na hoti tathāgato paraṃ maraṇā’’’ti. ‘‘Kasmā cetaṃ, āvuso , abyākataṃ bhagavatā’’ti? ‘‘Na hetaṃ, āvuso, atthasaṃhitaṃ nādibrahmacariyakaṃ na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati. Tasmā taṃ abyākataṃ bhagavatā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha kiñcarahāvuso, byākataṃ bhagavatā’’ti? ‘‘Idaṃ ‘dukkha’nti kho ",
      ", āvuso, byākataṃ bhagavatā; ayaṃ ‘dukkhasamudayo’ti byākataṃ bhagavatā; ayaṃ ‘dukkhanirodho’ti byākataṃ bhagavatā; ayaṃ ‘dukkhanirodhagāminī paṭipadā’ti byākataṃ bhagavatā’’ti. ‘‘Kasmā cetaṃ, āvuso, byākataṃ bhagavatā’’ti? ‘‘Etañhi, āvuso, atthasaṃhitaṃ etaṃ ādibrahmacariyakaṃ etaṃ nibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati. Tasmā taṃ byākataṃ bhagavatā’’ti. Dvādasamaṃ."
    ],
    "innerText": "‘‘Atha kiñcarahāvuso, byākataṃ bhagavatā’’ti? ‘‘Idaṃ ‘dukkha’nti kho , āvuso, byākataṃ bhagavatā; ayaṃ ‘dukkhasamudayo’ti byākataṃ bhagavatā; ayaṃ ‘dukkhanirodho’ti byākataṃ bhagavatā; ayaṃ ‘dukkhanirodhagāminī paṭipadā’ti byākataṃ bhagavatā’’ti. ‘‘Kasmā cetaṃ, āvuso, byākataṃ bhagavatā’’ti? ‘‘Etañhi, āvuso, atthasaṃhitaṃ etaṃ ādibrahmacariyakaṃ etaṃ nibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati. Tasmā taṃ byākataṃ bhagavatā’’ti. Dvādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "13. Saddhammappatirūpakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "156"
      },
      ". Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ ",
      " nisinno kho āyasmā mahākassapo bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu ko paccayo, yena pubbe appatarāni ceva sikkhāpadāni ahesuṃ bahutarā ca bhikkhū aññāya saṇṭhahiṃsu? Ko pana, bhante, hetu ko paccayo, yenetarahi bahutarāni ceva sikkhāpadāni appatarā ca bhikkhū aññāya saṇṭhahantī’’ti? ‘‘Evañcetaṃ, kassapa, hoti sattesu hāyamānesu saddhamme antaradhāyamāne, bahutarāni ceva sikkhāpadāni honti appatarā ca bhikkhū aññāya saṇṭhahanti. Na tāva, kassapa, saddhammassa antaradhānaṃ hoti yāva na saddhammappatirūpakaṃ loke uppajjati. Yato ca kho, kassapa, saddhammappatirūpakaṃ loke uppajjati, atha saddhammassa antaradhānaṃ hoti’’."
    ],
    "innerText": "156. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mahākassapo bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu ko paccayo, yena pubbe appatarāni ceva sikkhāpadāni ahesuṃ bahutarā ca bhikkhū aññāya saṇṭhahiṃsu? Ko pana, bhante, hetu ko paccayo, yenetarahi bahutarāni ceva sikkhāpadāni appatarā ca bhikkhū aññāya saṇṭhahantī’’ti? ‘‘Evañcetaṃ, kassapa, hoti sattesu hāyamānesu saddhamme antaradhāyamāne, bahutarāni ceva sikkhāpadāni honti appatarā ca bhikkhū aññāya saṇṭhahanti. Na tāva, kassapa, saddhammassa antaradhānaṃ hoti yāva na saddhammappatirūpakaṃ loke uppajjati. Yato ca kho, kassapa, saddhammappatirūpakaṃ loke uppajjati, atha saddhammassa antaradhānaṃ hoti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, kassapa, na tāva jātarūpassa antaradhānaṃ ",
      " hoti yāva na jātarūpappatirūpakaṃ loke uppajjati. Yato ca kho, kassapa, jātarūpappatirūpakaṃ loke uppajjati, atha jātarūpassa antaradhānaṃ hoti. Evameva kho, kassapa, na tāva saddhammassa antaradhānaṃ hoti yāva ",
      " na saddhammappatirūpakaṃ loke uppajjati. Yato ca kho, kassapa, saddhammappatirūpakaṃ loke uppajjati, atha saddhammassa antaradhānaṃ hoti."
    ],
    "innerText": "‘‘Seyyathāpi, kassapa, na tāva jātarūpassa antaradhānaṃ hoti yāva na jātarūpappatirūpakaṃ loke uppajjati. Yato ca kho, kassapa, jātarūpappatirūpakaṃ loke uppajjati, atha jātarūpassa antaradhānaṃ hoti. Evameva kho, kassapa, na tāva saddhammassa antaradhānaṃ hoti yāva na saddhammappatirūpakaṃ loke uppajjati. Yato ca kho, kassapa, saddhammappatirūpakaṃ loke uppajjati, atha saddhammassa antaradhānaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na kho, kassapa, pathavīdhātu saddhammaṃ antaradhāpeti, na āpodhātu saddhammaṃ antaradhāpeti, na tejodhātu saddhammaṃ antaradhāpeti, na vāyodhātu saddhammaṃ antaradhāpeti; atha kho idheva te uppajjanti moghapurisā ye imaṃ saddhammaṃ antaradhāpenti. Seyyathāpi, kassapa, nāvā ādikeneva opilavati; na kho, kassapa, evaṃ saddhammassa antaradhānaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañca khome, kassapa, okkamaniyā dhammā saddhammassa sammosāya antaradhānāya saṃvattanti. Katame pañca? Idha, kassapa, bhikkhū bhikkhuniyo upāsakā upāsikāyo satthari agāravā viharanti appatissā, dhamme agāravā viharanti appatissā, saṅghe agāravā viharanti appatissā, sikkhāya ",
      " agāravā viharanti appatissā, samādhismiṃ agāravā viharanti appatissā – ime kho, kassapa, pañca okkamaniyā dhammā saddhammassa sammosāya antaradhānāya saṃvattanti."
    ],
    "innerText": "‘‘Pañca khome, kassapa, okkamaniyā dhammā saddhammassa sammosāya antaradhānāya saṃvattanti. Katame pañca? Idha, kassapa, bhikkhū bhikkhuniyo upāsakā upāsikāyo satthari agāravā viharanti appatissā, dhamme agāravā viharanti appatissā, saṅghe agāravā viharanti appatissā, sikkhāya agāravā viharanti appatissā, samādhismiṃ agāravā viharanti appatissā – ime kho, kassapa, pañca okkamaniyā dhammā saddhammassa sammosāya antaradhānāya saṃvattanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañca khome, kassapa, dhammā saddhammassa ṭhitiyā asammosāya ",
      " anantaradhānāya saṃvattanti. Katame pañca? Idha, kassapa, bhikkhū bhikkhuniyo upāsakā upāsikāyo satthari sagāravā viharanti sappatissā, dhamme sagāravā viharanti sappatissā, saṅghe sagāravā viharanti sappatissā, sikkhāya sagāravā viharanti sappatissā, samādhismiṃ sagāravā viharanti sappatissā – ime kho, kassapa, pañca dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattantī’’ti. Terasamaṃ."
    ],
    "innerText": "‘‘Pañca khome, kassapa, dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattanti. Katame pañca? Idha, kassapa, bhikkhū bhikkhuniyo upāsakā upāsikāyo satthari sagāravā viharanti sappatissā, dhamme sagāravā viharanti sappatissā, saṅghe sagāravā viharanti sappatissā, sikkhāya sagāravā viharanti sappatissā, samādhismiṃ sagāravā viharanti sappatissā – ime kho, kassapa, pañca dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattantī’’ti. Terasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kassapasaṃyuttaṃ samattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Santuṭṭhañca anottappī, candūpamaṃ kulūpakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Jiṇṇaṃ tayo ca ovādā, jhānābhiññā upassayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cīvaraṃ paraṃmaraṇaṃ, saddhammappatirūpakanti."
  }
]