[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "6. Moggallānasaṃyuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Paṭhamajhānapañhāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "332"
      },
      ". Ekaṃ ",
      " samayaṃ āyasmā mahāmoggallāno sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra ",
      " kho āyasmā mahāmoggallāno bhikkhū āmantesi – ‘‘āvuso, bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato mahāmoggallānassa paccassosuṃ. Āyasmā mahāmoggallāno etadavoca –"
    ],
    "innerText": "332. Ekaṃ samayaṃ āyasmā mahāmoggallāno sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho āyasmā mahāmoggallāno bhikkhū āmantesi – ‘‘āvuso, bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato mahāmoggallānassa paccassosuṃ. Āyasmā mahāmoggallāno etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha mayhaṃ, āvuso, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘paṭhamaṃ jhānaṃ, paṭhamaṃ jhāna’nti vuccati. Katamaṃ nu kho paṭhamaṃ jhānanti? Tassa mayhaṃ, āvuso, etadahosi – ‘idha bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Idaṃ vuccati paṭhamaṃ jhāna’nti. So khvāhaṃ, āvuso, vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi. Tassa mayhaṃ, āvuso, iminā vihārena viharato kāmasahagatā saññāmanasikārā samudācaranti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna! Mā, brāhmaṇa, paṭhamaṃ jhānaṃ pamādo, paṭhame jhāne cittaṃ saṇṭhapehi, paṭhame jhāne cittaṃ ekodiṃ karohi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ekodikarohi (pī.)]"
      },
      ", paṭhame jhāne cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena vivicceva kāmehi vivicca akusalehi dhammehi ",
      " savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja vihāsiṃ. Yañhi taṃ, āvuso, sammā vadamāno vadeyya – ‘satthārānuggahito sāvako mahābhiññataṃ patto’ti, mamaṃ taṃ sammā vadamāno vadeyya – ‘satthārānuggahito sāvako mahābhiññataṃ patto’’’ti. Paṭhamaṃ."
    ],
    "innerText": "‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna! Mā, brāhmaṇa, paṭhamaṃ jhānaṃ pamādo, paṭhame jhāne cittaṃ saṇṭhapehi, paṭhame jhāne cittaṃ ekodiṃ karohi [ekodikarohi (pī.)], paṭhame jhāne cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja vihāsiṃ. Yañhi taṃ, āvuso, sammā vadamāno vadeyya – ‘satthārānuggahito sāvako mahābhiññataṃ patto’ti, mamaṃ taṃ sammā vadamāno vadeyya – ‘satthārānuggahito sāvako mahābhiññataṃ patto’’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Dutiyajhānapañhāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "333"
      },
      ". ‘‘‘Dutiyaṃ ",
      " jhānaṃ, dutiyaṃ jhāna’nti vuccati. Katamaṃ nu kho dutiyaṃ jhānanti? Tassa mayhaṃ, āvuso, etadahosi – ‘idha bhikkhu vitakkavicārānaṃ ",
      " vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Idaṃ vuccati dutiyaṃ jhāna’nti. So khvāhaṃ, āvuso, vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharāmi. Tassa mayhaṃ, āvuso, iminā vihārena viharato vitakkasahagatā saññāmanasikārā samudācaranti."
    ],
    "innerText": "333. ‘‘‘Dutiyaṃ jhānaṃ, dutiyaṃ jhāna’nti vuccati. Katamaṃ nu kho dutiyaṃ jhānanti? Tassa mayhaṃ, āvuso, etadahosi – ‘idha bhikkhu vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Idaṃ vuccati dutiyaṃ jhāna’nti. So khvāhaṃ, āvuso, vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharāmi. Tassa mayhaṃ, āvuso, iminā vihārena viharato vitakkasahagatā saññāmanasikārā samudācaranti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna! Mā, brāhmaṇa, dutiyaṃ jhānaṃ pamādo, dutiye jhāne cittaṃ saṇṭhapehi, dutiye jhāne cittaṃ ekodiṃ karohi, dutiye jhāne cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja vihāsiṃ. Yañhi taṃ, āvuso, sammā vadamāno vadeyya – ‘satthārānuggahito sāvako mahābhiññataṃ patto’ti, mamaṃ taṃ ",
      " sammā vadamāno vadeyya – ‘satthārānuggahito sāvako mahābhiññataṃ patto’’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna! Mā, brāhmaṇa, dutiyaṃ jhānaṃ pamādo, dutiye jhāne cittaṃ saṇṭhapehi, dutiye jhāne cittaṃ ekodiṃ karohi, dutiye jhāne cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja vihāsiṃ. Yañhi taṃ, āvuso, sammā vadamāno vadeyya – ‘satthārānuggahito sāvako mahābhiññataṃ patto’ti, mamaṃ taṃ sammā vadamāno vadeyya – ‘satthārānuggahito sāvako mahābhiññataṃ patto’’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Tatiyajhānapañhāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "334"
      },
      ". ‘‘‘Tatiyaṃ jhānaṃ, tatiyaṃ jhāna’nti vuccati. Katamaṃ nu kho tatiyaṃ jhānanti? Tassa mayhaṃ, āvuso, etadahosi – idha bhikkhu pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. Idaṃ vuccati tatiyaṃ jhānanti. So khvāhaṃ, āvuso, pītiyā ca virāgā upekkhako ca viharāmi sato ca sampajāno sukhañca kāyena paṭisaṃvedemi. Yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharāmi. Tassa mayhaṃ, āvuso, iminā vihārena viharato pītisahagatā saññāmanasikārā samudācaranti."
    ],
    "innerText": "334. ‘‘‘Tatiyaṃ jhānaṃ, tatiyaṃ jhāna’nti vuccati. Katamaṃ nu kho tatiyaṃ jhānanti? Tassa mayhaṃ, āvuso, etadahosi – idha bhikkhu pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. Idaṃ vuccati tatiyaṃ jhānanti. So khvāhaṃ, āvuso, pītiyā ca virāgā upekkhako ca viharāmi sato ca sampajāno sukhañca kāyena paṭisaṃvedemi. Yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharāmi. Tassa mayhaṃ, āvuso, iminā vihārena viharato pītisahagatā saññāmanasikārā samudācaranti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha ",
      " kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna! Mā, brāhmaṇa, tatiyaṃ jhānaṃ pamādo, tatiye jhāne cittaṃ saṇṭhapehi, tatiye jhāne cittaṃ ekodiṃ karohi, tatiye jhāne cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena pītiyā ca virāgā upekkhako ca viharāmi sato ca sampajāno sukhañca kāyena paṭisaṃvedemi, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja vihāsiṃ. Yañhi taṃ āvuso sammā vadamāno vadeyya…pe… mahābhiññataṃ patto’’ti. Tatiyaṃ."
    ],
    "innerText": "‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna! Mā, brāhmaṇa, tatiyaṃ jhānaṃ pamādo, tatiye jhāne cittaṃ saṇṭhapehi, tatiye jhāne cittaṃ ekodiṃ karohi, tatiye jhāne cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena pītiyā ca virāgā upekkhako ca viharāmi sato ca sampajāno sukhañca kāyena paṭisaṃvedemi, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja vihāsiṃ. Yañhi taṃ āvuso sammā vadamāno vadeyya…pe… mahābhiññataṃ patto’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Catutthajhānapañhāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "335"
      },
      ". ‘‘‘Catutthaṃ jhānaṃ ",
      ", catutthaṃ jhāna’nti vuccati. Katamaṃ nu kho catutthaṃ jhānanti? Tassa mayhaṃ, āvuso, etadahosi – ‘idha bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. Idaṃ vuccati catutthaṃ jhāna’nti. So khvāhaṃ, āvuso, sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharāmi. Tassa mayhaṃ, āvuso, iminā vihārena viharato sukhasahagatā saññāmanasikārā samudācaranti."
    ],
    "innerText": "335. ‘‘‘Catutthaṃ jhānaṃ , catutthaṃ jhāna’nti vuccati. Katamaṃ nu kho catutthaṃ jhānanti? Tassa mayhaṃ, āvuso, etadahosi – ‘idha bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. Idaṃ vuccati catutthaṃ jhāna’nti. So khvāhaṃ, āvuso, sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharāmi. Tassa mayhaṃ, āvuso, iminā vihārena viharato sukhasahagatā saññāmanasikārā samudācaranti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna! Mā, brāhmaṇa, catutthaṃ jhānaṃ pamādo, catutthe jhāne cittaṃ saṇṭhapehi, catutthe jhāne cittaṃ ekodiṃ karohi, catutthe jhāne cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ ",
      " atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja vihāsiṃ. Yañhi taṃ, āvuso, sammā vadamāno vadeyya…pe… mahābhiññataṃ patto’’ti. Catutthaṃ."
    ],
    "innerText": "‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna! Mā, brāhmaṇa, catutthaṃ jhānaṃ pamādo, catutthe jhāne cittaṃ saṇṭhapehi, catutthe jhāne cittaṃ ekodiṃ karohi, catutthe jhāne cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja vihāsiṃ. Yañhi taṃ, āvuso, sammā vadamāno vadeyya…pe… mahābhiññataṃ patto’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Ākāsānañcāyatanapañhāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "336"
      },
      ". ‘‘‘Ākāsānañcāyatanaṃ, ākāsānañcāyatana’nti vuccati. Katamaṃ nu kho ākāsānañcāyatananti ",
      "? Tassa mayhaṃ, āvuso, etadahosi – ‘idha ",
      " bhikkhu sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ ",
      " amanasikārā ananto ākāsoti ākāsānañcāyatanaṃ upasampajja viharati. Idaṃ vuccati ākāsānañcāyatana’nti. So khvāhaṃ, āvuso, sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ananto ākāsoti ākāsānañcāyatanaṃ upasampajja viharāmi. Tassa mayhaṃ, āvuso, iminā vihārena viharato rūpasahagatā saññāmanasikārā samudācaranti."
    ],
    "innerText": "336. ‘‘‘Ākāsānañcāyatanaṃ, ākāsānañcāyatana’nti vuccati. Katamaṃ nu kho ākāsānañcāyatananti ? Tassa mayhaṃ, āvuso, etadahosi – ‘idha bhikkhu sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ananto ākāsoti ākāsānañcāyatanaṃ upasampajja viharati. Idaṃ vuccati ākāsānañcāyatana’nti. So khvāhaṃ, āvuso, sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ananto ākāsoti ākāsānañcāyatanaṃ upasampajja viharāmi. Tassa mayhaṃ, āvuso, iminā vihārena viharato rūpasahagatā saññāmanasikārā samudācaranti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna! Mā, brāhmaṇa, ākāsānañcāyatanaṃ pamādo, ākāsānañcāyatane cittaṃ saṇṭhapehi, ākāsānañcāyatane cittaṃ ekodiṃ karohi, ākāsānañcāyatane cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ananto ākāsoti ākāsānañcāyatanaṃ upasampajja vihāsiṃ. Yañhi taṃ, āvuso, sammā vadamāno vadeyya…pe… mahābhiññataṃ patto’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Viññāṇañcāyatanapañhāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "337"
      },
      ". ‘‘‘Viññāṇañcāyatanaṃ, viññāṇañcāyatana’nti vuccati. Katamaṃ nu kho viññāṇañcāyatananti? Tassa ",
      " mayhaṃ, āvuso, etadahosi – ‘idha bhikkhu sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ viññāṇanti viññāṇañcāyatanaṃ upasampajja viharati. Idaṃ vuccati viññāṇañcāyatana’nti. So khvāhaṃ, āvuso, sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ viññāṇanti viññāṇañcāyatanaṃ upasampajja viharāmi ",
      ". Tassa mayhaṃ, āvuso, iminā vihārena viharato ākāsānañcāyatanasahagatā saññāmanasikārā samudācaranti."
    ],
    "innerText": "337. ‘‘‘Viññāṇañcāyatanaṃ, viññāṇañcāyatana’nti vuccati. Katamaṃ nu kho viññāṇañcāyatananti? Tassa mayhaṃ, āvuso, etadahosi – ‘idha bhikkhu sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ viññāṇanti viññāṇañcāyatanaṃ upasampajja viharati. Idaṃ vuccati viññāṇañcāyatana’nti. So khvāhaṃ, āvuso, sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ viññāṇanti viññāṇañcāyatanaṃ upasampajja viharāmi . Tassa mayhaṃ, āvuso, iminā vihārena viharato ākāsānañcāyatanasahagatā saññāmanasikārā samudācaranti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna! Mā, brāhmaṇa, viññāṇañcāyatanaṃ pamādo, viññāṇañcāyatane ",
      " cittaṃ saṇṭhapehi, viññāṇañcāyatane cittaṃ ekodiṃ karohi, viññāṇañcāyatane cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ viññāṇanti ",
      " viññāṇañcāyatanaṃ upasampajja vihāsiṃ. Yañhi taṃ, āvuso, sammā vadamāno vadeyya…pe… mahābhiññataṃ patto’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna! Mā, brāhmaṇa, viññāṇañcāyatanaṃ pamādo, viññāṇañcāyatane cittaṃ saṇṭhapehi, viññāṇañcāyatane cittaṃ ekodiṃ karohi, viññāṇañcāyatane cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ viññāṇanti viññāṇañcāyatanaṃ upasampajja vihāsiṃ. Yañhi taṃ, āvuso, sammā vadamāno vadeyya…pe… mahābhiññataṃ patto’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Ākiñcaññāyatanapañhāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "338"
      },
      ". ‘‘‘Ākiñcaññāyatanaṃ, ākiñcaññāyatana’nti vuccati. Katamaṃ nu kho ākiñcaññāyatananti? Tassa mayhaṃ, āvuso, etadahosi – ‘idha bhikkhu sabbaso viññāṇañcāyatanaṃ samatikkamma natthi kiñcīti ākiñcaññāyatanaṃ upasampajja viharati. Idaṃ vuccati ākiñcaññāyatana’nti. So khvāhaṃ, āvuso, sabbaso viññāṇañcāyatanaṃ samatikkamma natthi kiñcīti ākiñcaññāyatanaṃ upasampajja viharāmi. Tassa mayhaṃ, āvuso, iminā vihārena viharato viññāṇañcāyatanasahagatā saññāmanasikārā samudācaranti."
    ],
    "innerText": "338. ‘‘‘Ākiñcaññāyatanaṃ, ākiñcaññāyatana’nti vuccati. Katamaṃ nu kho ākiñcaññāyatananti? Tassa mayhaṃ, āvuso, etadahosi – ‘idha bhikkhu sabbaso viññāṇañcāyatanaṃ samatikkamma natthi kiñcīti ākiñcaññāyatanaṃ upasampajja viharati. Idaṃ vuccati ākiñcaññāyatana’nti. So khvāhaṃ, āvuso, sabbaso viññāṇañcāyatanaṃ samatikkamma natthi kiñcīti ākiñcaññāyatanaṃ upasampajja viharāmi. Tassa mayhaṃ, āvuso, iminā vihārena viharato viññāṇañcāyatanasahagatā saññāmanasikārā samudācaranti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna! Mā, brāhmaṇa, ākiñcaññāyatanaṃ pamādo, ākiñcaññāyatane cittaṃ saṇṭhapehi, ākiñcaññāyatane ",
      " cittaṃ ekodiṃ karohi, ākiñcaññāyatane ",
      " cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena sabbaso viññāṇañcāyatanaṃ samatikkamma natthi kiñcīti ākiñcaññāyatanaṃ upasampajja vihāsiṃ. Yañhi taṃ, āvuso, sammā vadamāno vadeyya…pe… mahābhiññataṃ patto’’ti. Sattamaṃ."
    ],
    "innerText": "‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna! Mā, brāhmaṇa, ākiñcaññāyatanaṃ pamādo, ākiñcaññāyatane cittaṃ saṇṭhapehi, ākiñcaññāyatane cittaṃ ekodiṃ karohi, ākiñcaññāyatane cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena sabbaso viññāṇañcāyatanaṃ samatikkamma natthi kiñcīti ākiñcaññāyatanaṃ upasampajja vihāsiṃ. Yañhi taṃ, āvuso, sammā vadamāno vadeyya…pe… mahābhiññataṃ patto’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Nevasaññānāsaññāyatanapañhāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "339"
      },
      ". ‘‘‘Nevasaññānāsaññāyatanaṃ, nevasaññānāsaññāyatana’nti vuccati. Katamaṃ nu kho nevasaññānāsaññāyatananti? Tassa mayhaṃ, āvuso, etadahosi – ‘idha bhikkhu sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Idaṃ vuccati nevasaññānāsaññāyatana’nti. So khvāhaṃ, āvuso, sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ ",
      " upasampajja viharāmi. Tassa mayhaṃ, āvuso, iminā vihārena viharato ākiñcaññāyatanasahagatā saññāmanasikārā samudācaranti."
    ],
    "innerText": "339. ‘‘‘Nevasaññānāsaññāyatanaṃ, nevasaññānāsaññāyatana’nti vuccati. Katamaṃ nu kho nevasaññānāsaññāyatananti? Tassa mayhaṃ, āvuso, etadahosi – ‘idha bhikkhu sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Idaṃ vuccati nevasaññānāsaññāyatana’nti. So khvāhaṃ, āvuso, sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharāmi. Tassa mayhaṃ, āvuso, iminā vihārena viharato ākiñcaññāyatanasahagatā saññāmanasikārā samudācaranti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha ",
      " kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna! Mā, brāhmaṇa, nevasaññānāsaññāyatanaṃ pamādo, nevasaññānāsaññāyatane cittaṃ saṇṭhapehi, nevasaññānāsaññāyatane cittaṃ ekodiṃ karohi, nevasaññānāsaññāyatane cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja vihāsiṃ. Yañhi taṃ, āvuso, sammā vadamāno vadeyya…pe… mahābhiññataṃ patto’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna! Mā, brāhmaṇa, nevasaññānāsaññāyatanaṃ pamādo, nevasaññānāsaññāyatane cittaṃ saṇṭhapehi, nevasaññānāsaññāyatane cittaṃ ekodiṃ karohi, nevasaññānāsaññāyatane cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja vihāsiṃ. Yañhi taṃ, āvuso, sammā vadamāno vadeyya…pe… mahābhiññataṃ patto’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Animittapañhāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "340"
      },
      ". ‘‘‘Animitto ",
      " cetosamādhi, animitto cetosamādhī’ti vuccati. Katamo nu kho animitto cetosamādhīti? Tassa mayhaṃ, āvuso, etadahosi – ‘idha bhikkhu sabbanimittānaṃ ",
      " amanasikārā animittaṃ cetosamādhiṃ upasampajja viharati. Ayaṃ vuccati animitto cetosamādhī’ti. So khvāhaṃ, āvuso, sabbanimittānaṃ amanasikārā animittaṃ cetosamādhiṃ upasampajja viharāmi. Tassa mayhaṃ, āvuso, iminā vihārena viharato nimittānusāri viññāṇaṃ hoti."
    ],
    "innerText": "340. ‘‘‘Animitto cetosamādhi, animitto cetosamādhī’ti vuccati. Katamo nu kho animitto cetosamādhīti? Tassa mayhaṃ, āvuso, etadahosi – ‘idha bhikkhu sabbanimittānaṃ amanasikārā animittaṃ cetosamādhiṃ upasampajja viharati. Ayaṃ vuccati animitto cetosamādhī’ti. So khvāhaṃ, āvuso, sabbanimittānaṃ amanasikārā animittaṃ cetosamādhiṃ upasampajja viharāmi. Tassa mayhaṃ, āvuso, iminā vihārena viharato nimittānusāri viññāṇaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna! Mā, brāhmaṇa, animittaṃ cetosamādhiṃ pamādo, animitte cetosamādhismiṃ cittaṃ saṇṭhapehi, animitte cetosamādhismiṃ cittaṃ ekodiṃ karohi, animitte cetosamādhismiṃ cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena sabbanimittānaṃ amanasikārā animittaṃ cetosamādhiṃ upasampajja vihāsiṃ. Yañhi taṃ, āvuso, sammā vadamāno vadeyya – ‘satthārānuggahito sāvako mahābhiññataṃ patto’ti, mamaṃ taṃ sammā vadamāno vadeyya – ‘satthārānuggahito sāvako mahābhiññataṃ patto’’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Sakkasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "341"
      },
      ". Atha ",
      " kho āyasmā mahāmoggallāno – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya; evameva – jetavane antarahito devesu tāvatiṃsesu pāturahosi ",
      ". Atha kho sakko devānamindo pañcahi devatāsatehi saddhiṃ ",
      " yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā ",
      " āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho sakkaṃ devānamindaṃ āyasmā mahāmoggallāno etadavoca –"
    ],
    "innerText": "341. Atha kho āyasmā mahāmoggallāno – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya; evameva – jetavane antarahito devesu tāvatiṃsesu pāturahosi . Atha kho sakko devānamindo pañcahi devatāsatehi saddhiṃ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho sakkaṃ devānamindaṃ āyasmā mahāmoggallāno etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, devānaminda, buddhasaraṇagamanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[buddhaṃ saraṇagamanaṃ (sī.)]"
      },
      " hoti. Buddhasaraṇagamanahetu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[buddhaṃ saraṇagamanahetu (sī.)]"
      },
      " kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Sādhu kho, devānaminda, dhammasaraṇagamanaṃ hoti. Dhammasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Sādhu kho, devānaminda, saṅghasaraṇagamanaṃ hoti. Saṅghasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti."
    ],
    "innerText": "‘‘Sādhu kho, devānaminda, buddhasaraṇagamanaṃ [buddhaṃ saraṇagamanaṃ (sī.)] hoti. Buddhasaraṇagamanahetu [buddhaṃ saraṇagamanahetu (sī.)] kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Sādhu kho, devānaminda, dhammasaraṇagamanaṃ hoti. Dhammasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Sādhu kho, devānaminda, saṅghasaraṇagamanaṃ hoti. Saṅghasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, buddhasaraṇagamanaṃ hoti. Buddhasaraṇagamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Sādhu kho, mārisa moggallāna, dhammasaraṇagamanaṃ hoti. Dhammasaraṇagamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Sādhu kho, mārisa moggallāna, saṅgha…pe… sugatiṃ saggaṃ lokaṃ upapajjantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho sakko devānamindo chahi devatāsatehi saddhiṃ…pe… atha kho sakko devānamindo sattahi devatāsatehi saddhiṃ…pe… atha ",
      " kho sakko devānamindo aṭṭhahi devatāsatehi saddhiṃ…pe… atha kho sakko devānamindo asītiyā devatāsahassehi saddhiṃ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ",
      " ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho sakkaṃ devānamindaṃ āyasmā ",
      " mahāmoggallāno etadavoca –"
    ],
    "innerText": "Atha kho sakko devānamindo chahi devatāsatehi saddhiṃ…pe… atha kho sakko devānamindo sattahi devatāsatehi saddhiṃ…pe… atha kho sakko devānamindo aṭṭhahi devatāsatehi saddhiṃ…pe… atha kho sakko devānamindo asītiyā devatāsahassehi saddhiṃ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho sakkaṃ devānamindaṃ āyasmā mahāmoggallāno etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, devānaminda, buddhasaraṇagamanaṃ hoti. Buddhasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Sādhu kho, devānaminda, dhammasaraṇagamanaṃ hoti. Dhammasaraṇagamanahetu ",
      " kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Sādhu kho, devānaminda, saṅghasaraṇagamanaṃ hoti. Saṅghasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti."
    ],
    "innerText": "‘‘Sādhu kho, devānaminda, buddhasaraṇagamanaṃ hoti. Buddhasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Sādhu kho, devānaminda, dhammasaraṇagamanaṃ hoti. Dhammasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Sādhu kho, devānaminda, saṅghasaraṇagamanaṃ hoti. Saṅghasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, buddhasaraṇagamanaṃ hoti. Buddhasaraṇagamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Sādhu kho, mārisa moggallāna, dhammasaraṇagamanaṃ hoti…pe… sādhu kho, mārisa moggallāna, saṅghasaraṇagamanaṃ hoti. Saṅghasaraṇagamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho sakko devānamindo pañcahi devatāsatehi saddhiṃ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho sakkaṃ devānamindaṃ āyasmā mahāmoggallāno etadavoca –"
    ],
    "innerText": "Atha kho sakko devānamindo pañcahi devatāsatehi saddhiṃ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho sakkaṃ devānamindaṃ āyasmā mahāmoggallāno etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, devānaminda, buddhe aveccappasādena samannāgamanaṃ hoti – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, devānaminda, dhamme aveccappasādena samannāgamanaṃ hoti – ‘svākkhāto ",
      " bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti ",
      ". Dhamme aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
    ],
    "innerText": "‘‘Sādhu kho, devānaminda, dhamme aveccappasādena samannāgamanaṃ hoti – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti . Dhamme aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, devānaminda, saṅghe aveccappasādena samannāgamanaṃ hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho, ujuppaṭipanno bhagavato sāvakasaṅgho ",
      ", ñāyappaṭipanno bhagavato sāvakasaṅgho, sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ ",
      " lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
    ],
    "innerText": "‘‘Sādhu kho, devānaminda, saṅghe aveccappasādena samannāgamanaṃ hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho, ujuppaṭipanno bhagavato sāvakasaṅgho , ñāyappaṭipanno bhagavato sāvakasaṅgho, sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, devānaminda, ariyakantehi sīlehi samannāgamanaṃ hoti akhaṇḍehi acchiddehi asabalehi akammāsehi bhujissehi viññuppasatthehi aparāmaṭṭhehi samādhisaṃvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, buddhe aveccappasādena samannāgamanaṃ hoti – ‘itipi so…pe… satthā devamanussānaṃ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, dhamme aveccappasādena samannāgamanaṃ hoti – ‘svākkhāto bhagavatā dhammo…pe… paccattaṃ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, mārisa moggallāna, saṅghe aveccappasādena samannāgamanaṃ hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho…pe… anuttaraṃ puññakkhettaṃ ",
      " lokassā’ti. Saṅghe aveccappasādena ",
      " samannāgamanahetu kho, mārisa moggallāna, evamidhekacce ",
      " sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
    ],
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, saṅghe aveccappasādena samannāgamanaṃ hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho…pe… anuttaraṃ puññakkhettaṃ lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, ariyakantehi sīlehi samannāgamanaṃ hoti akhaṇḍehi…pe… samādhisaṃvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho sakko devānamindo chahi devatāsatehi saddhiṃ…pe…. Atha kho sakko devānamindo sattahi devatāsatehi saddhiṃ…pe…. Atha kho sakko devānamindo aṭṭhahi devatāsatehi saddhiṃ…pe…. Atha kho sakko devānamindo asītiyā devatāsahassehi saddhiṃ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho sakkaṃ devānamindaṃ āyasmā mahāmoggallāno etadavoca –"
    ],
    "innerText": "Atha kho sakko devānamindo chahi devatāsatehi saddhiṃ…pe…. Atha kho sakko devānamindo sattahi devatāsatehi saddhiṃ…pe…. Atha kho sakko devānamindo aṭṭhahi devatāsatehi saddhiṃ…pe…. Atha kho sakko devānamindo asītiyā devatāsahassehi saddhiṃ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho sakkaṃ devānamindaṃ āyasmā mahāmoggallāno etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, devānaminda, buddhe aveccappasādena samannāgamanaṃ hoti – ‘itipi so bhagavā…pe… satthā devamanussānaṃ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, devānaminda, dhamme aveccappasādena samannāgamanaṃ hoti – ‘svākkhāto bhagavatā dhammo…pe… paccattaṃ ",
      " veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
    ],
    "innerText": "‘‘Sādhu kho, devānaminda, dhamme aveccappasādena samannāgamanaṃ hoti – ‘svākkhāto bhagavatā dhammo…pe… paccattaṃ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, devānaminda, saṅghe aveccappasādena samannāgamanaṃ hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho…pe… anuttaraṃ puññakkhettaṃ lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu ",
      " kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti ",
      "."
    ],
    "innerText": "‘‘Sādhu kho, devānaminda, saṅghe aveccappasādena samannāgamanaṃ hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho…pe… anuttaraṃ puññakkhettaṃ lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, devānaminda, ariyakantehi sīlehi samannāgamanaṃ hoti akhaṇḍehi…pe… samādhisaṃvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, buddhe aveccappasādena samannāgamanaṃ hoti – ‘itipi so bhagavā…pe… satthā devamanussānaṃ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu ",
      " kho, mārisa moggallāna, dhamme aveccappasādena samannāgamanaṃ hoti – ‘svākkhāto bhagavatā dhammo…pe… paccattaṃ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
    ],
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, dhamme aveccappasādena samannāgamanaṃ hoti – ‘svākkhāto bhagavatā dhammo…pe… paccattaṃ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, mārisa ",
      " moggallāna, saṅghe aveccappasādena samannāgamanaṃ hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho…pe… anuttaraṃ puññakkhettaṃ lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
    ],
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, saṅghe aveccappasādena samannāgamanaṃ hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho…pe… anuttaraṃ puññakkhettaṃ lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, ariyakantehi sīlehi samannāgamanaṃ hoti akhaṇḍehi…pe… samādhisaṃvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho sakko devānamindo pañcahi devatāsatehi saddhiṃ yenāyasmā mahāmoggallāno tenupasaṅkami ",
      " …pe… ekamantaṃ ṭhitaṃ kho sakkaṃ devānamindaṃ āyasmā mahāmoggallāno etadavoca –"
    ],
    "innerText": "Atha kho sakko devānamindo pañcahi devatāsatehi saddhiṃ yenāyasmā mahāmoggallāno tenupasaṅkami …pe… ekamantaṃ ṭhitaṃ kho sakkaṃ devānamindaṃ āyasmā mahāmoggallāno etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, devānaminda, buddhasaraṇagamanaṃ hoti. Buddhasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā ",
      " paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehi."
    ],
    "innerText": "‘‘Sādhu kho, devānaminda, buddhasaraṇagamanaṃ hoti. Buddhasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, devānaminda, dhammasaraṇagamanaṃ hoti. Dhammasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa ",
      " bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehi."
    ],
    "innerText": "‘‘Sādhu kho, devānaminda, dhammasaraṇagamanaṃ hoti. Dhammasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu ",
      " kho, devānaminda, saṅghasaraṇagamanaṃ hoti. Saṅghasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī’’ti."
    ],
    "innerText": "‘‘Sādhu kho, devānaminda, saṅghasaraṇagamanaṃ hoti. Saṅghasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, buddhasaraṇagamanaṃ hoti. Buddhasaraṇagamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, dhammasaraṇagamanaṃ hoti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu ",
      " kho, mārisa moggallāna, saṅghasaraṇagamanaṃ hoti. Saṅghasaraṇagamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena ",
      " yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī’’ti."
    ],
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, saṅghasaraṇagamanaṃ hoti. Saṅghasaraṇagamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho sakko devānamindo chahi devatāsatehi saddhiṃ…pe… atha kho sakko devānamindo sattahi devatāsatehi saddhiṃ…pe… atha ",
      " kho sakko devānamindo aṭṭhahi devatāsatehi saddhiṃ…pe… atha kho sakko devānamindo asītiyā devatāsahassehi saddhiṃ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho sakkaṃ devānamindaṃ āyasmā mahāmoggallāno etadavoca –"
    ],
    "innerText": "Atha kho sakko devānamindo chahi devatāsatehi saddhiṃ…pe… atha kho sakko devānamindo sattahi devatāsatehi saddhiṃ…pe… atha kho sakko devānamindo aṭṭhahi devatāsatehi saddhiṃ…pe… atha kho sakko devānamindo asītiyā devatāsahassehi saddhiṃ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho sakkaṃ devānamindaṃ āyasmā mahāmoggallāno etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, devānaminda, buddhasaraṇagamanaṃ hoti. Buddhasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, devānaminda, dhammasaraṇagamanaṃ hoti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu ",
      " kho, devānaminda, saṅghasaraṇagamanaṃ hoti. Saṅghasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi ",
      ", dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī’’ti."
    ],
    "innerText": "‘‘Sādhu kho, devānaminda, saṅghasaraṇagamanaṃ hoti. Saṅghasaraṇagamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi , dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, mārisa moggallāna, buddhasaraṇagamanaṃ hoti…pe… sādhu kho, mārisa moggallāna, dhammasaraṇagamanaṃ hoti…pe… sādhu kho mārisa moggallāna, saṅghasaraṇagamanaṃ hoti. Saṅghasaraṇagamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā ",
      " sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī’’ti."
    ],
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, buddhasaraṇagamanaṃ hoti…pe… sādhu kho, mārisa moggallāna, dhammasaraṇagamanaṃ hoti…pe… sādhu kho mārisa moggallāna, saṅghasaraṇagamanaṃ hoti. Saṅghasaraṇagamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho sakko devānamindo pañcahi devatāsatehi saddhiṃ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ",
      " ṭhitaṃ kho sakkaṃ devānamindaṃ āyasmā mahāmoggallāno etadavoca –"
    ],
    "innerText": "Atha kho sakko devānamindo pañcahi devatāsatehi saddhiṃ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho sakkaṃ devānamindaṃ āyasmā mahāmoggallāno etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, devānaminda, buddhe aveccappasādena samannāgamanaṃ hoti – ‘itipi so bhagavā…pe… satthā devamanussānaṃ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, devānaminda ",
      ", dhamme aveccappasādena samannāgamanaṃ hoti – ‘svākkhāto bhagavatā dhammo…pe… paccattaṃ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti…pe…."
    ],
    "innerText": "‘‘Sādhu kho, devānaminda , dhamme aveccappasādena samannāgamanaṃ hoti – ‘svākkhāto bhagavatā dhammo…pe… paccattaṃ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, devānaminda, saṅghe aveccappasādena samannāgamanaṃ hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho…pe… lokassā’ti. Saṅghe aveccappasādena ",
      " samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti…pe…."
    ],
    "innerText": "‘‘Sādhu kho, devānaminda, saṅghe aveccappasādena samannāgamanaṃ hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho…pe… lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, devānaminda, ariyakantehi sīlehi samannāgamanaṃ hoti akhaṇḍehi…pe… samādhisaṃvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā…pe… dibbehi phoṭṭhabbehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu ",
      " kho, mārisa moggallāna, buddhe aveccappasādena samannāgamanaṃ hoti – ‘itipi so bhagavā…pe… satthā devamanussānaṃ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi."
    ],
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, buddhe aveccappasādena samannāgamanaṃ hoti – ‘itipi so bhagavā…pe… satthā devamanussānaṃ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, dhamme aveccappasādena samannāgamanaṃ hoti – ‘svākkhāto bhagavatā dhammo…pe… paccattaṃ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, mārisa moggallāna, saṅghe ",
      " aveccappasādena samannāgamanaṃ hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho…pe… lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, mārisa moggallāna ",
      ", evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti…pe…."
    ],
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, saṅghe aveccappasādena samannāgamanaṃ hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho…pe… lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, mārisa moggallāna , evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, ariyakantehi sīlehi samannāgamanaṃ hoti akhaṇḍehi…pe… samādhisaṃvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā…pe… dibbehi phoṭṭhabbehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho sakko devānamindo chahi devatāsatehi saddhiṃ…pe… atha kho sakko devānamindo sattahi devatāsatehi saddhiṃ…pe… atha kho sakko devānamindo aṭṭhahi devatāsatehi saddhiṃ…pe… atha kho sakko devānamindo asītiyā devatāsahassehi saddhiṃ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ",
      " ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho sakkaṃ devānamindaṃ āyasmā mahāmoggallāno etadavoca ",
      " –"
    ],
    "innerText": "Atha kho sakko devānamindo chahi devatāsatehi saddhiṃ…pe… atha kho sakko devānamindo sattahi devatāsatehi saddhiṃ…pe… atha kho sakko devānamindo aṭṭhahi devatāsatehi saddhiṃ…pe… atha kho sakko devānamindo asītiyā devatāsahassehi saddhiṃ yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho sakkaṃ devānamindaṃ āyasmā mahāmoggallāno etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, devānaminda, buddhe aveccappasādena samannāgamanaṃ hoti – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, devānaminda, dhamme aveccappasādena samannāgamanaṃ hoti – ‘svākkhāto bhagavatā ",
      " dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi."
    ],
    "innerText": "‘‘Sādhu kho, devānaminda, dhamme aveccappasādena samannāgamanaṃ hoti – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, devānaminda, saṅghe aveccappasādena samannāgamanaṃ hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho, ujuppaṭipanno bhagavato sāvakasaṅgho, ñāyappaṭipanno bhagavato sāvakasaṅgho, sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo ",
      " añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te ",
      " aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi."
    ],
    "innerText": "‘‘Sādhu kho, devānaminda, saṅghe aveccappasādena samannāgamanaṃ hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho, ujuppaṭipanno bhagavato sāvakasaṅgho, ñāyappaṭipanno bhagavato sāvakasaṅgho, sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, devānaminda, ariyakantehi sīlehi samannāgamanaṃ hoti akhaṇḍehi acchiddehi asabalehi akammāsehi bhujissehi viññuppasatthehi aparāmaṭṭhehi samādhisaṃvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, devānaminda, evamidhekacce sattā ",
      " kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī’’ti."
    ],
    "innerText": "‘‘Sādhu kho, devānaminda, ariyakantehi sīlehi samannāgamanaṃ hoti akhaṇḍehi acchiddehi asabalehi akammāsehi bhujissehi viññuppasatthehi aparāmaṭṭhehi samādhisaṃvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, devānaminda, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, buddhe aveccappasādena samannāgamanaṃ hoti – ‘itipi so bhagavā…pe… satthā devamanussānaṃ buddho bhagavā’ti. Buddhe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, mārisa moggallāna, dhamme aveccappasādena samannāgamanaṃ hoti – ‘svākkhāto ",
      " bhagavatā dhammo…pe… paccattaṃ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce ",
      " sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi."
    ],
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, dhamme aveccappasādena samannāgamanaṃ hoti – ‘svākkhāto bhagavatā dhammo…pe… paccattaṃ veditabbo viññūhī’ti. Dhamme aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, saṅghe aveccappasādena samannāgamanaṃ hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho…pe… anuttaraṃ puññakkhettaṃ lokassā’ti. Saṅghe aveccappasādena samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu kho, mārisa moggallāna, ariyakantehi sīlehi samannāgamanaṃ hoti akhaṇḍehi…pe… samādhisaṃvattanikehi. Ariyakantehi sīlehi samannāgamanahetu ",
      " kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena ",
      ", dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī’’ti. Dasamaṃ."
    ],
    "innerText": "‘‘Sādhu kho, mārisa moggallāna, ariyakantehi sīlehi samannāgamanaṃ hoti akhaṇḍehi…pe… samādhisaṃvattanikehi. Ariyakantehi sīlehi samannāgamanahetu kho, mārisa moggallāna, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Te aññe deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena , dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehī’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Candanasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "342"
      },
      ". Atha kho candano ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nandano (sī.)]"
      },
      " devaputto…pe…."
    ],
    "innerText": "342. Atha kho candano [nandano (sī.)] devaputto…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho suyāmo devaputto…pe… ",
      "."
    ],
    "innerText": "Atha kho suyāmo devaputto…pe… ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho santusito devaputto…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho sunimmito devaputto…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho vasavatti devaputto…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Yathā sakkasuttaṃ tathā ime pañca peyyālā vitthāretabbā). Ekādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      "Moggallānasaṃyuttaṃ ",
      " samattaṃ."
    ],
    "innerText": "Moggallānasaṃyuttaṃ samattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Savitakkāvitakkañca, sukhena ca upekkhako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Ākāsañceva viññāṇaṃ, ākiñcaṃ nevasaññinā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Animitto ca sakko ca, candanekādasena cāti."
  }
]