[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "9. Supaṇṇasaṃyuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "392-437"
      },
      ". Supaṇṇasaṃyutte ",
      " pattānaṃ vaṇṇavantatāya garuḷā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "supaṇṇā"
      },
      "ti vuttā. Idhāpi paṭhamasuttaṃ purimanayeneva aṭṭhuppattiyaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Harantī"
      },
      "ti uddharanti. Uddharamānā ca pana te attanā hīne vā same vā uddharituṃ sakkonti, na ",
      " attanā paṇītatare. Sattavidhā hi anuddharaṇīyanāgā nāma paṇītatarā kambalassatarā dhataraṭṭhā sattasīdantaravāsino pathaviṭṭhakā pabbataṭṭhakā vimānaṭṭhakāti. Tatra aṇḍajādīnaṃ jalābujādayo paṇītatarā ",
      ", te tehi anuddharaṇīyā. Kambalassatarā pana nāgasenāpatino, te yattha katthaci disvā yo koci supaṇṇo uddharituṃ na sakkoti. Dhataraṭṭhā pana nāgarājāno, tepi koci uddharituṃ na sakkoti. Ye pana sattasīdantare mahāsamudde vasanti, te yasmā katthaci vikampanaṃ kātuṃ na sakkā, tasmā koci uddharituṃ na sakkoti. Pathaviṭṭhakādīnaṃ nilīyanokāso atthi, tasmā tepi uddharituṃ na sakkoti. Ye pana mahāsamudde ūmipiṭṭhe vasanti, te yo koci samo vā paṇītataro vā supaṇṇo uddharituṃ sakkoti. Sesaṃ nāgasaṃyutte vuttanayamevāti."
    ],
    "innerText": "392-437. Supaṇṇasaṃyutte pattānaṃ vaṇṇavantatāya garuḷā supaṇṇāti vuttā. Idhāpi paṭhamasuttaṃ purimanayeneva aṭṭhuppattiyaṃ vuttaṃ. Harantīti uddharanti. Uddharamānā ca pana te attanā hīne vā same vā uddharituṃ sakkonti, na attanā paṇītatare. Sattavidhā hi anuddharaṇīyanāgā nāma paṇītatarā kambalassatarā dhataraṭṭhā sattasīdantaravāsino pathaviṭṭhakā pabbataṭṭhakā vimānaṭṭhakāti. Tatra aṇḍajādīnaṃ jalābujādayo paṇītatarā , te tehi anuddharaṇīyā. Kambalassatarā pana nāgasenāpatino, te yattha katthaci disvā yo koci supaṇṇo uddharituṃ na sakkoti. Dhataraṭṭhā pana nāgarājāno, tepi koci uddharituṃ na sakkoti. Ye pana sattasīdantare mahāsamudde vasanti, te yasmā katthaci vikampanaṃ kātuṃ na sakkā, tasmā koci uddharituṃ na sakkoti. Pathaviṭṭhakādīnaṃ nilīyanokāso atthi, tasmā tepi uddharituṃ na sakkoti. Ye pana mahāsamudde ūmipiṭṭhe vasanti, te yo koci samo vā paṇītataro vā supaṇṇo uddharituṃ sakkoti. Sesaṃ nāgasaṃyutte vuttanayamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Supaṇṇasaṃyuttavaṇṇanā niṭṭhitā."
  }
]