[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "7. Iddhipādasaṃyuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Cāpālavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Apārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "813"
      },
      ". ‘‘Cattārome ",
      " bhikkhave, iddhipādā bhāvitā bahulīkatā apārā pāraṃ gamanāya saṃvattanti. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, cittasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ime kho, bhikkhave, cattāro iddhipādā bhāvitā bahulīkatā apārā pāraṃ gamanāya saṃvattantī’’ti. Paṭhamaṃ."
    ],
    "innerText": "813. ‘‘Cattārome bhikkhave, iddhipādā bhāvitā bahulīkatā apārā pāraṃ gamanāya saṃvattanti. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, cittasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ime kho, bhikkhave, cattāro iddhipādā bhāvitā bahulīkatā apārā pāraṃ gamanāya saṃvattantī’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Viraddhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "814"
      },
      ". ‘‘Yesaṃ kesañci, bhikkhave, cattāro iddhipādā viraddhā, viraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī. Yesaṃ kesañci, bhikkhave, cattāro iddhipādā āraddhā, āraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Yesaṃ ",
      " kesañci, bhikkhave, ime cattāro iddhipādā viraddhā, viraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī. Yesaṃ kesañci, bhikkhave, ime cattāro iddhipādā āraddhā, āraddho tesaṃ ariyo ",
      " maggo sammā dukkhakkhayagāmī’’ti. Dutiyaṃ."
    ],
    "innerText": "814. ‘‘Yesaṃ kesañci, bhikkhave, cattāro iddhipādā viraddhā, viraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī. Yesaṃ kesañci, bhikkhave, cattāro iddhipādā āraddhā, āraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Yesaṃ kesañci, bhikkhave, ime cattāro iddhipādā viraddhā, viraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī. Yesaṃ kesañci, bhikkhave, ime cattāro iddhipādā āraddhā, āraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Ariyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "815"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave, iddhipādā bhāvitā bahulīkatā ariyā niyyānikā niyyanti takkarassa sammā dukkhakkhayāya. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… iddhipādaṃ bhāveti, vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ime kho, bhikkhave, cattāro iddhipādā bhāvitā ",
      " bahulīkatā ariyā niyyānikā niyyanti takkarassa sammā dukkhakkhayāyā’’ti. Tatiyaṃ."
    ],
    "innerText": "815. ‘‘Cattārome , bhikkhave, iddhipādā bhāvitā bahulīkatā ariyā niyyānikā niyyanti takkarassa sammā dukkhakkhayāya. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… iddhipādaṃ bhāveti, vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ime kho, bhikkhave, cattāro iddhipādā bhāvitā bahulīkatā ariyā niyyānikā niyyanti takkarassa sammā dukkhakkhayāyā’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Nibbidāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "816"
      },
      ". ‘‘Cattārome, bhikkhave, iddhipādā bhāvitā bahulīkatā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattanti. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ime kho, bhikkhave, cattāro iddhipādā bhāvitā bahulīkatā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattantī’’ti. Catutthaṃ."
    ],
    "innerText": "816. ‘‘Cattārome, bhikkhave, iddhipādā bhāvitā bahulīkatā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattanti. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ime kho, bhikkhave, cattāro iddhipādā bhāvitā bahulīkatā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattantī’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Iddhipadesasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "817"
      },
      ". ‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādesuṃ sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci ",
      ", bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādessanti sabbe te ",
      " catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādenti sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā."
    ],
    "innerText": "817. ‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādesuṃ sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci , bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādessanti sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādenti sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamesaṃ ",
      " catunnaṃ? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādesuṃ, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādessanti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādenti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā’’ti. Pañcamaṃ."
    ],
    "innerText": "‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādesuṃ, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādessanti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādenti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Samattasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "818"
      },
      ". ‘‘Ye ",
      " hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā samattaṃ iddhiṃ abhinipphādesuṃ, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā samattaṃ iddhiṃ abhinipphādessanti, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā samattaṃ iddhiṃ abhinipphādenti ",
      ", sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā."
    ],
    "innerText": "818. ‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā samattaṃ iddhiṃ abhinipphādesuṃ, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā samattaṃ iddhiṃ abhinipphādessanti, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā samattaṃ iddhiṃ abhinipphādenti , sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā samattaṃ iddhiṃ abhinipphādesuṃ, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā samattaṃ iddhiṃ abhinipphādessanti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā samattaṃ iddhiṃ abhinipphādenti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Bhikkhusuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "819"
      },
      ". ‘‘Ye ",
      " hi keci, bhikkhave, atītamaddhānaṃ bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihariṃsu, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissanti, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ ",
      " diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā."
    ],
    "innerText": "819. ‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihariṃsu, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissanti, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamesaṃ ",
      " catunnaṃ? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ye hi keci, bhikkhave, atītamaddhānaṃ bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihariṃsu sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissanti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā’’ti. Sattamaṃ."
    ],
    "innerText": "‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ye hi keci, bhikkhave, atītamaddhānaṃ bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihariṃsu sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissanti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Buddhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "820"
      },
      ". ‘‘Cattārome, bhikkhave, iddhipādā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ime kho, bhikkhave, cattāro iddhipādā ",
      ". Imesaṃ ",
      " kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā tathāgato ‘arahaṃ sammāsambuddho’ti vuccatī’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "820. ‘‘Cattārome, bhikkhave, iddhipādā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ime kho, bhikkhave, cattāro iddhipādā . Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā tathāgato ‘arahaṃ sammāsambuddho’ti vuccatī’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Ñāṇasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "821"
      },
      ". ‘‘‘Ayaṃ ",
      " chandasamādhippadhānasaṅkhārasamannāgato iddhipādo’ti me bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘So kho panāyaṃ chandasamādhippadhānasaṅkhārasamannāgato iddhipādo bhāvetabbo’ti me, bhikkhave…pe… ‘bhāvito’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi."
    ],
    "innerText": "821. ‘‘‘Ayaṃ chandasamādhippadhānasaṅkhārasamannāgato iddhipādo’ti me bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘So kho panāyaṃ chandasamādhippadhānasaṅkhārasamannāgato iddhipādo bhāvetabbo’ti me, bhikkhave…pe… ‘bhāvito’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Ayaṃ ",
      " vīriyasamādhippadhānasaṅkhārasamannāgato iddhipādo’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘So kho panāyaṃ vīriyasamādhippadhānasaṅkhārasamannāgato iddhipādo bhāvetabbo’ti me, bhikkhave…pe… ‘bhāvito’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi."
    ],
    "innerText": "‘‘‘Ayaṃ vīriyasamādhippadhānasaṅkhārasamannāgato iddhipādo’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘So kho panāyaṃ vīriyasamādhippadhānasaṅkhārasamannāgato iddhipādo bhāvetabbo’ti me, bhikkhave…pe… ‘bhāvito’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Ayaṃ cittasamādhippadhānasaṅkhārasamannāgato iddhipādo’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘So kho panāyaṃ cittasamādhippadhānasaṅkhārasamannāgato iddhipādo bhāvetabbo’ti ",
      " me, bhikkhave…pe… ‘bhāvito’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi."
    ],
    "innerText": "‘‘‘Ayaṃ cittasamādhippadhānasaṅkhārasamannāgato iddhipādo’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘So kho panāyaṃ cittasamādhippadhānasaṅkhārasamannāgato iddhipādo bhāvetabbo’ti me, bhikkhave…pe… ‘bhāvito’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Ayaṃ vīmaṃsāsamādhippadhānasaṅkhārasamannāgato iddhipādo’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘So kho panāyaṃ vīmaṃsāsamādhippadhānasaṅkhārasamannāgato iddhipādo bhāvetabbo’ti me, bhikkhave…pe… ‘bhāvito’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ ",
      " udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādī’’ti. Navamaṃ."
    ],
    "innerText": "‘‘‘Ayaṃ vīmaṃsāsamādhippadhānasaṅkhārasamannāgato iddhipādo’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘So kho panāyaṃ vīmaṃsāsamādhippadhānasaṅkhārasamannāgato iddhipādo bhāvetabbo’ti me, bhikkhave…pe… ‘bhāvito’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādī’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Cetiyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "822"
      },
      ". Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha ",
      " kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya vesāliṃ piṇḍāya pāvisi. Vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto āyasmantaṃ ānandaṃ āmantesi – ‘‘gaṇhāhi, ānanda, nisīdanaṃ. Yena cāpālaṃ cetiyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pāvālacetiyaṃ (syā. kaṃ.)]"
      },
      " tenupasaṅkamissāma divāvihārāyā’’ti. ‘‘Evaṃ bhante’’ti kho āyasmā ānando bhagavato paṭissutvā nisīdanaṃ ādāya bhagavantaṃ piṭṭhito piṭṭhito anubandhi. Atha kho bhagavā yena cāpālaṃ cetiyaṃ tenupasaṅkami; upasaṅkamitvā ",
      " paññatte āsane nisīdi. Āyasmāpi kho ānando bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca –"
    ],
    "innerText": "822. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya vesāliṃ piṇḍāya pāvisi. Vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto āyasmantaṃ ānandaṃ āmantesi – ‘‘gaṇhāhi, ānanda, nisīdanaṃ. Yena cāpālaṃ cetiyaṃ [pāvālacetiyaṃ (syā. kaṃ.)] tenupasaṅkamissāma divāvihārāyā’’ti. ‘‘Evaṃ bhante’’ti kho āyasmā ānando bhagavato paṭissutvā nisīdanaṃ ādāya bhagavantaṃ piṭṭhito piṭṭhito anubandhi. Atha kho bhagavā yena cāpālaṃ cetiyaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Āyasmāpi kho ānando bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ramaṇīyā, ānanda, vesālī, ramaṇīyaṃ udenaṃ cetiyaṃ, ramaṇīyaṃ gotamakaṃ cetiyaṃ, ramaṇīyaṃ sattambaṃ cetiyaṃ, ramaṇīyaṃ bahuputtaṃ cetiyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bahuputtakacetiyaṃ (syā. kaṃ. pī. ka.)]"
      },
      ", ramaṇīyaṃ sārandadaṃ cetiyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ānandacetiyaṃ (ka.), sānandaraṃ (ka.)]"
      },
      ", ramaṇīyaṃ cāpālaṃ cetiyaṃ. Yassa kassaci, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, so ākaṅkhamāno kappaṃ vā tiṭṭheyya kappāvasesaṃ vā. Tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā. Ākaṅkhamāno, ānanda, tathāgato kappaṃ vā tiṭṭheyya kappāvasesaṃ vā’’ti."
    ],
    "innerText": "‘‘Ramaṇīyā, ānanda, vesālī, ramaṇīyaṃ udenaṃ cetiyaṃ, ramaṇīyaṃ gotamakaṃ cetiyaṃ, ramaṇīyaṃ sattambaṃ cetiyaṃ, ramaṇīyaṃ bahuputtaṃ cetiyaṃ [bahuputtakacetiyaṃ (syā. kaṃ. pī. ka.)], ramaṇīyaṃ sārandadaṃ cetiyaṃ [ānandacetiyaṃ (ka.), sānandaraṃ (ka.)], ramaṇīyaṃ cāpālaṃ cetiyaṃ. Yassa kassaci, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, so ākaṅkhamāno kappaṃ vā tiṭṭheyya kappāvasesaṃ vā. Tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā. Ākaṅkhamāno, ānanda, tathāgato kappaṃ vā tiṭṭheyya kappāvasesaṃ vā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evampi kho āyasmā ānando bhagavatā oḷārike nimitte kayiramāne oḷārike obhāse kayiramāne nāsakkhi paṭivijjhituṃ; na bhagavantaṃ yāci – ‘‘tiṭṭhatu, bhante, bhagavā kappaṃ, tiṭṭhatu sugato kappaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sugato kappāvasesaṃ (pī. ka.) dī. ni. 2.167]"
      },
      " bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’’nti yathā taṃ mārena pariyuṭṭhitacitto."
    ],
    "innerText": "Evampi kho āyasmā ānando bhagavatā oḷārike nimitte kayiramāne oḷārike obhāse kayiramāne nāsakkhi paṭivijjhituṃ; na bhagavantaṃ yāci – ‘‘tiṭṭhatu, bhante, bhagavā kappaṃ, tiṭṭhatu sugato kappaṃ [sugato kappāvasesaṃ (pī. ka.) dī. ni. 2.167] bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’’nti yathā taṃ mārena pariyuṭṭhitacitto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiyampi ",
      " kho bhagavā…pe… tatiyampi ",
      " kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘ramaṇīyā, ānanda, vesālī, ramaṇīyaṃ udenaṃ cetiyaṃ, ramaṇīyaṃ gotamakaṃ cetiyaṃ, ramaṇīyaṃ sattambaṃ cetiyaṃ, ramaṇīyaṃ ",
      " bahuputtaṃ cetiyaṃ, ramaṇīyaṃ sārandadaṃ cetiyaṃ, ramaṇīyaṃ cāpālaṃ cetiyaṃ. Yassa kassaci, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, so ākaṅkhamāno kappaṃ vā tiṭṭheyya kappāvasesaṃ vā. Tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā. Ākaṅkhamāno, ānanda, tathāgato kappaṃ vā tiṭṭheyya kappāvasesaṃ vā’’ti."
    ],
    "innerText": "Dutiyampi kho bhagavā…pe… tatiyampi kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘ramaṇīyā, ānanda, vesālī, ramaṇīyaṃ udenaṃ cetiyaṃ, ramaṇīyaṃ gotamakaṃ cetiyaṃ, ramaṇīyaṃ sattambaṃ cetiyaṃ, ramaṇīyaṃ bahuputtaṃ cetiyaṃ, ramaṇīyaṃ sārandadaṃ cetiyaṃ, ramaṇīyaṃ cāpālaṃ cetiyaṃ. Yassa kassaci, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, so ākaṅkhamāno kappaṃ vā tiṭṭheyya kappāvasesaṃ vā. Tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā. Ākaṅkhamāno, ānanda, tathāgato kappaṃ vā tiṭṭheyya kappāvasesaṃ vā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evampi ",
      " kho āyasmā ānando bhagavatā oḷārike nimitte kayiramāne oḷārike obhāse kayiramāne nāsakkhi paṭivijjhituṃ; na bhagavantaṃ yāci – ‘‘tiṭṭhatu, bhante, bhagavā kappaṃ, tiṭṭhatu sugato kappaṃ bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’’nti yathā taṃ mārena pariyuṭṭhitacitto."
    ],
    "innerText": "Evampi kho āyasmā ānando bhagavatā oḷārike nimitte kayiramāne oḷārike obhāse kayiramāne nāsakkhi paṭivijjhituṃ; na bhagavantaṃ yāci – ‘‘tiṭṭhatu, bhante, bhagavā kappaṃ, tiṭṭhatu sugato kappaṃ bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’’nti yathā taṃ mārena pariyuṭṭhitacitto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘gaccha kho tvaṃ, ānanda, yassa dāni kālaṃ maññasī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paṭissutvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā avidūre aññatarasmiṃ rukkhamūle nisīdi. Atha kho māro pāpimā, acirapakkante āyasmante ānande, yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘parinibbātu ",
      " dāni, bhante, bhagavā, parinibbātu dāni sugato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[parinibbātu sugato (sī. syā. kaṃ.) evamuparipi]"
      },
      "! Parinibbānakālo dāni, bhante, bhagavato. Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima ",
      ", parinibbāyissāmi yāva me bhikkhū na sāvakā bhavissanti viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacārino, sakaṃ ācariyakaṃ uggahetvā ācikkhissanti desessanti paññapessanti paṭṭhapessanti vivarissanti vibhajissanti uttānīkarissanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[uttāniṃ karissanti (ka.), uttānikarissanti (pī.)]"
      },
      ", uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desessantī’’’ti."
    ],
    "innerText": "Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘gaccha kho tvaṃ, ānanda, yassa dāni kālaṃ maññasī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paṭissutvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā avidūre aññatarasmiṃ rukkhamūle nisīdi. Atha kho māro pāpimā, acirapakkante āyasmante ānande, yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘parinibbātu dāni, bhante, bhagavā, parinibbātu dāni sugato [parinibbātu sugato (sī. syā. kaṃ.) evamuparipi]! Parinibbānakālo dāni, bhante, bhagavato. Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima , parinibbāyissāmi yāva me bhikkhū na sāvakā bhavissanti viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacārino, sakaṃ ācariyakaṃ uggahetvā ācikkhissanti desessanti paññapessanti paṭṭhapessanti vivarissanti vibhajissanti uttānīkarissanti [uttāniṃ karissanti (ka.), uttānikarissanti (pī.)], uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desessantī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Santi kho pana, bhante, etarahi bhikkhū bhagavato sāvakā viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacārino, sakaṃ ācariyakaṃ uggahetvā ",
      " ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti uttānīkaronti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desenti. Parinibbātu dāni, bhante, bhagavā, parinibbātu dāni, sugato! Parinibbānakālo dāni, bhante, bhagavato."
    ],
    "innerText": "Santi kho pana, bhante, etarahi bhikkhū bhagavato sāvakā viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacārino, sakaṃ ācariyakaṃ uggahetvā ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti uttānīkaronti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desenti. Parinibbātu dāni, bhante, bhagavā, parinibbātu dāni, sugato! Parinibbānakālo dāni, bhante, bhagavato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me bhikkhuniyo na sāvikā bhavissanti viyattā vinītā ",
      " visāradā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacāriniyo, sakaṃ ācariyakaṃ uggahetvā ācikkhissanti desessanti paññapessanti paṭṭhapessanti vivarissanti vibhajissanti ",
      " uttānīkarissanti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desessantī’’’ti."
    ],
    "innerText": "‘‘Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me bhikkhuniyo na sāvikā bhavissanti viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacāriniyo, sakaṃ ācariyakaṃ uggahetvā ācikkhissanti desessanti paññapessanti paṭṭhapessanti vivarissanti vibhajissanti uttānīkarissanti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desessantī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Santi kho pana, bhante, etarahi bhikkhuniyo bhagavato sāvikā viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacāriniyo, sakaṃ ācariyakaṃ uggahetvā ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti uttānīkaronti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desenti. Parinibbātu dāni, bhante, bhagavā, parinibbātu dāni, sugato! Parinibbānakālo dāni, bhante, bhagavato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me upāsakā…pe… yāva me upāsikā na sāvikā bhavissanti viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacāriniyo, sakaṃ ācariyakaṃ uggahetvā ācikkhissanti desessanti paññapessanti paṭṭhapessanti vivarissanti vibhajissanti uttānīkarissanti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desessantī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Santi kho pana, bhante, etarahi upāsakā…pe… upāsikā bhagavato sāvikā viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā ",
      " sāmīcippaṭipannā anudhammacāriniyo ",
      ", sakaṃ ācariyakaṃ uggahetvā ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti ",
      " uttānīkaronti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desenti. Parinibbātu dāni, bhante, bhagavā, parinibbātu dāni, sugato! Parinibbānakālo dāni, bhante, bhagavato."
    ],
    "innerText": "‘‘Santi kho pana, bhante, etarahi upāsakā…pe… upāsikā bhagavato sāvikā viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacāriniyo , sakaṃ ācariyakaṃ uggahetvā ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti uttānīkaronti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desenti. Parinibbātu dāni, bhante, bhagavā, parinibbātu dāni, sugato! Parinibbānakālo dāni, bhante, bhagavato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me idaṃ brahmacariyaṃ na iddhañceva bhavissati phītañca vitthāritaṃ bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsita’nti. Tayidaṃ, bhante, bhagavato brahmacariyaṃ iddhañceva phītañca vitthāritaṃ bāhujaññaṃ puthubhūtaṃ ",
      " yāva devamanussehi suppakāsitaṃ. Parinibbātu dāni, bhante, bhagavā, parinibbātu dāni sugato. Parinibbānakālo dāni, bhante, bhagavato’’ti."
    ],
    "innerText": "‘‘Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me idaṃ brahmacariyaṃ na iddhañceva bhavissati phītañca vitthāritaṃ bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsita’nti. Tayidaṃ, bhante, bhagavato brahmacariyaṃ iddhañceva phītañca vitthāritaṃ bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsitaṃ. Parinibbātu dāni, bhante, bhagavā, parinibbātu dāni sugato. Parinibbānakālo dāni, bhante, bhagavato’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vutte bhagavā māraṃ pāpimantaṃ etadavoca – ‘‘appossukko tvaṃ, pāpima, hohi. Na ciraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nacirasseva (ka.)]"
      },
      " tathāgatassa parinibbānaṃ bhavissati. Ito tiṇṇaṃ māsānaṃ accayena tathāgato parinibbāyissatī’’ti. Atha kho bhagavā cāpāle cetiye sato sampajāno āyusaṅkhāraṃ ossaji. Ossaṭṭhe ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[osajje pana (ka.)]"
      },
      " bhagavatā āyusaṅkhāre mahābhūmicālo ahosi bhiṃsanako lomahaṃso, devadundubhiyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[devadudrabhiyo (ka.)]"
      },
      " ca phaliṃsu. Atha kho bhagavā etamatthaṃ viditvā tāyaṃ velāyaṃ imaṃ udānaṃ udānesi –"
    ],
    "innerText": "Evaṃ vutte bhagavā māraṃ pāpimantaṃ etadavoca – ‘‘appossukko tvaṃ, pāpima, hohi. Na ciraṃ [nacirasseva (ka.)] tathāgatassa parinibbānaṃ bhavissati. Ito tiṇṇaṃ māsānaṃ accayena tathāgato parinibbāyissatī’’ti. Atha kho bhagavā cāpāle cetiye sato sampajāno āyusaṅkhāraṃ ossaji. Ossaṭṭhe ca [osajje pana (ka.)] bhagavatā āyusaṅkhāre mahābhūmicālo ahosi bhiṃsanako lomahaṃso, devadundubhiyo [devadudrabhiyo (ka.)] ca phaliṃsu. Atha kho bhagavā etamatthaṃ viditvā tāyaṃ velāyaṃ imaṃ udānaṃ udānesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Tulamatulañca ",
      " sambhavaṃ, bhavasaṅkhāramavassaji muni;"
    ],
    "innerText": "‘‘Tulamatulañca sambhavaṃ, bhavasaṅkhāramavassaji muni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ajjhattarato samāhito, abhindi kavacamivattasambhava’’nti. dasamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cāpālavaggo paṭhamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Apārāpi viraddho ca, ariyā nibbidāpi ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Padesaṃ samattaṃ bhikkhu, buddhaṃ ñāṇañca cetiyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Pāsādakampanavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Pubbasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "823"
      },
      ". Sāvatthinidānaṃ ",
      ". ‘‘Pubbeva me, bhikkhave, sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi – ‘ko nu kho hetu, ko paccayo iddhipādabhāvanāyā’ti? Tassa mayhaṃ, bhikkhave, etadahosi – ‘idha bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā ",
      " adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti’’’."
    ],
    "innerText": "823. Sāvatthinidānaṃ . ‘‘Pubbeva me, bhikkhave, sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi – ‘ko nu kho hetu, ko paccayo iddhipādabhāvanāyā’ti? Tassa mayhaṃ, bhikkhave, etadahosi – ‘idha bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Vīriyasamādhippadhānasaṅkhārasamannāgataṃ ",
      " iddhipādaṃ bhāveti – iti me vīriyaṃ na ca atilīnaṃ bhavissati, na ca atippaggahitaṃ bhavissati, na ca ajjhattaṃ saṃkhittaṃ bhavissati, na ca bahiddhā vikkhittaṃ bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
    ],
    "innerText": "‘‘Vīriyasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – iti me vīriyaṃ na ca atilīnaṃ bhavissati, na ca atippaggahitaṃ bhavissati, na ca ajjhattaṃ saṃkhittaṃ bhavissati, na ca bahiddhā vikkhittaṃ bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cittasamādhippadhānasaṅkhārasamannāgataṃ ",
      " iddhipādaṃ bhāveti – iti me cittaṃ na ca atilīnaṃ bhavissati, na ca atippaggahitaṃ bhavissati, na ca ajjhattaṃ saṃkhittaṃ bhavissati, na ca bahiddhā vikkhittaṃ bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
    ],
    "innerText": "‘‘Cittasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – iti me cittaṃ na ca atilīnaṃ bhavissati, na ca atippaggahitaṃ bhavissati, na ca ajjhattaṃ saṃkhittaṃ bhavissati, na ca bahiddhā vikkhittaṃ bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati ",
      ", na ca bahiddhā vikkhittā bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
    ],
    "innerText": "‘‘Vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati , na ca bahiddhā vikkhittā bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṃ bahulīkatesu, anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karoti, seyyathāpi udake; udakepi abhijjamāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhijjamāno (sī. pī. ka.)]"
      },
      " gacchati, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena ",
      " kamati, seyyathāpi ",
      " pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[parāmasati (sī. syā. kaṃ.)]"
      },
      " parimajjati; yāva brahmalokāpi kāyena vasaṃ vatteti."
    ],
    "innerText": "‘‘Evaṃ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṃ bahulīkatesu, anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karoti, seyyathāpi udake; udakepi abhijjamāne [abhijjamāno (sī. pī. ka.)] gacchati, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamati, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasati [parāmasati (sī. syā. kaṃ.)] parimajjati; yāva brahmalokāpi kāyena vasaṃ vatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Evaṃ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṃ bahulīkatesu dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti – dibbe ca mānuse ca, dūre santike cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Evaṃ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṃ bahulīkatesu, parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajānāti. Sarāgaṃ vā cittaṃ ‘sarāgaṃ citta’nti pajānāti; vītarāgaṃ vā cittaṃ ‘vītarāgaṃ citta’nti pajānāti; sadosaṃ vā cittaṃ ‘sadosaṃ citta’nti pajānāti; vītadosaṃ vā cittaṃ ‘vītadosaṃ citta’nti pajānāti; samohaṃ vā cittaṃ ‘samohaṃ citta’nti pajānāti; vītamohaṃ vā cittaṃ ‘vītamohaṃ citta’nti pajānāti; saṃkhittaṃ vā cittaṃ ‘saṃkhittaṃ citta’nti pajānāti; vikkhittaṃ vā cittaṃ ‘vikkhittaṃ citta’nti pajānāti; mahaggataṃ vā cittaṃ ‘mahaggataṃ citta’nti pajānāti; amahaggataṃ vā cittaṃ ‘amahaggataṃ citta’nti pajānāti; sauttaraṃ vā cittaṃ ‘sauttaraṃ citta’nti pajānāti; anuttaraṃ vā cittaṃ ‘anuttaraṃ citta’nti pajānāti; samāhitaṃ vā cittaṃ ‘samāhitaṃ citta’nti pajānāti; asamāhitaṃ vā cittaṃ ‘asamāhitaṃ citta’nti pajānāti; vimuttaṃ vā cittaṃ ‘vimuttaṃ citta’nti pajānāti; avimuttaṃ vā cittaṃ ‘avimuttaṃ citta’nti pajānāti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ ",
      " bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṃ bahulīkatesu, anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi ",
      " jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[uppādiṃ (sī.)]"
      },
      "; tatrāpāsiṃ evaṃnāmo ",
      " evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati."
    ],
    "innerText": "‘‘Evaṃ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṃ bahulīkatesu, anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ [uppādiṃ (sī.)]; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ bhāvitesu kho bhikkhu, catūsu iddhipādesu evaṃ bahulīkatesu, dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti – ‘ime vata, bhonto, sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā; te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Ime vā pana, bhonto, sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ ",
      " anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā; te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti."
    ],
    "innerText": "‘‘Evaṃ bhāvitesu kho bhikkhu, catūsu iddhipādesu evaṃ bahulīkatesu, dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti – ‘ime vata, bhonto, sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā; te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Ime vā pana, bhonto, sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā; te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Evaṃ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṃ bahulīkatesu, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Mahapphalasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "824"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave, iddhipādā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā. Kathaṃ bhāvitā ca, bhikkhave, cattāro iddhipādā kathaṃ bahulīkatā mahapphalā honti ",
      " mahānisaṃsā? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati’. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā ",
      " divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
    ],
    "innerText": "824. ‘‘Cattārome , bhikkhave, iddhipādā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā. Kathaṃ bhāvitā ca, bhikkhave, cattāro iddhipādā kathaṃ bahulīkatā mahapphalā honti mahānisaṃsā? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati’. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā ",
      " bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati’. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Evaṃ bhāvitā kho, bhikkhave, cattāro iddhipādā evaṃ bahulīkatā mahapphalā honti mahānisaṃsā."
    ],
    "innerText": "‘‘Vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati’. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Evaṃ bhāvitā kho, bhikkhave, cattāro iddhipādā evaṃ bahulīkatā mahapphalā honti mahānisaṃsā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Evaṃ bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ bahulīkatesu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ ",
      " bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ bahulīkatesu, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Evaṃ bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ bahulīkatesu, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Chandasamādhisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "825"
      },
      ". ‘‘Chandaṃ ce, bhikkhave, bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ – ayaṃ vuccati chandasamādhi. So anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ pāpakānaṃ ",
      " akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ ",
      " kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ime vuccanti ‘padhānasaṅkhārā’ti. Iti ayañca chando, ayañca chandasamādhi, ime ca padhānasaṅkhārā – ayaṃ vuccati, bhikkhave, ‘chandasamādhippadhānasaṅkhārasamannāgato iddhipādo’’’."
    ],
    "innerText": "825. ‘‘Chandaṃ ce, bhikkhave, bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ – ayaṃ vuccati chandasamādhi. So anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ime vuccanti ‘padhānasaṅkhārā’ti. Iti ayañca chando, ayañca chandasamādhi, ime ca padhānasaṅkhārā – ayaṃ vuccati, bhikkhave, ‘chandasamādhippadhānasaṅkhārasamannāgato iddhipādo’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Vīriyaṃ ",
      " ce, bhikkhave, bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ – ayaṃ vuccati ‘vīriyasamādhi’. So anuppannānaṃ…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ime vuccanti ‘padhānasaṅkhārā’ti. Iti idañca vīriyaṃ, ayañca vīriyasamādhi, ime ca padhānasaṅkhārā – ayaṃ vuccati, bhikkhave, ‘vīriyasamādhippadhānasaṅkhārasamannāgato iddhipādo’’’."
    ],
    "innerText": "‘‘Vīriyaṃ ce, bhikkhave, bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ – ayaṃ vuccati ‘vīriyasamādhi’. So anuppannānaṃ…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ime vuccanti ‘padhānasaṅkhārā’ti. Iti idañca vīriyaṃ, ayañca vīriyasamādhi, ime ca padhānasaṅkhārā – ayaṃ vuccati, bhikkhave, ‘vīriyasamādhippadhānasaṅkhārasamannāgato iddhipādo’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cittaṃ ",
      " ce, bhikkhave, bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ – ayaṃ vuccati ‘cittasamādhi’. So anuppannānaṃ pāpakānaṃ…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ime vuccanti ‘padhānasaṅkhārā’ti. Iti idañca cittaṃ, ayañca cittasamādhi, ime ca padhānasaṅkhārā – ayaṃ vuccati, bhikkhave, ‘cittasamādhippadhānasaṅkhārasamannāgato ",
      " iddhipādo’’’."
    ],
    "innerText": "‘‘Cittaṃ ce, bhikkhave, bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ – ayaṃ vuccati ‘cittasamādhi’. So anuppannānaṃ pāpakānaṃ…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ime vuccanti ‘padhānasaṅkhārā’ti. Iti idañca cittaṃ, ayañca cittasamādhi, ime ca padhānasaṅkhārā – ayaṃ vuccati, bhikkhave, ‘cittasamādhippadhānasaṅkhārasamannāgato iddhipādo’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Vīmaṃsaṃ ce, bhikkhave, bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ – ayaṃ vuccati ‘vīmaṃsāsamādhi’. So anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ime vuccanti ‘padhānasaṅkhārā’ti ",
      ". Iti ayañca vīmaṃsā, ayañca vīmaṃsāsamādhi, ime ca padhānasaṅkhārā – ayaṃ vuccati, bhikkhave, ‘vīmaṃsāsamādhippadhānasaṅkhārasamannāgato iddhipādo’’’ti. Tatiyaṃ."
    ],
    "innerText": "‘‘Vīmaṃsaṃ ce, bhikkhave, bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ – ayaṃ vuccati ‘vīmaṃsāsamādhi’. So anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ime vuccanti ‘padhānasaṅkhārā’ti . Iti ayañca vīmaṃsā, ayañca vīmaṃsāsamādhi, ime ca padhānasaṅkhārā – ayaṃ vuccati, bhikkhave, ‘vīmaṃsāsamādhippadhānasaṅkhārasamannāgato iddhipādo’’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Moggallānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "826"
      },
      ". Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Tena kho pana samayena sambahulā bhikkhū heṭṭhāmigāramātupāsāde viharanti uddhatā unnaḷā capalā mukharā vikiṇṇavācā muṭṭhassatino asampajānā asamāhitā bhantacittā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vibbhantacittā (sī. syā. kaṃ.)]"
      },
      " pākatindriyā."
    ],
    "innerText": "826. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Tena kho pana samayena sambahulā bhikkhū heṭṭhāmigāramātupāsāde viharanti uddhatā unnaḷā capalā mukharā vikiṇṇavācā muṭṭhassatino asampajānā asamāhitā bhantacittā [vibbhantacittā (sī. syā. kaṃ.)] pākatindriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho bhagavā āyasmantaṃ mahāmoggallānaṃ āmantesi – ‘‘ete kho, moggallāna, sabrahmacārino heṭṭhāmigāramātupāsāde ",
      " viharanti uddhatā unnaḷā capalā mukharā vikiṇṇavācā muṭṭhassatino asampajānā asamāhitā bhantacittā pākatindriyā. Gaccha, moggallāna, te bhikkhū saṃvejehī’’ti."
    ],
    "innerText": "Atha kho bhagavā āyasmantaṃ mahāmoggallānaṃ āmantesi – ‘‘ete kho, moggallāna, sabrahmacārino heṭṭhāmigāramātupāsāde viharanti uddhatā unnaḷā capalā mukharā vikiṇṇavācā muṭṭhassatino asampajānā asamāhitā bhantacittā pākatindriyā. Gaccha, moggallāna, te bhikkhū saṃvejehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ, bhante’’ti kho āyasmā mahāmoggallāno ",
      " bhagavato paṭissutvā tathārūpaṃ iddhābhisaṅkhāraṃ abhisaṅkhāresi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhisaṅkharesi (syā. pī. ka.)]"
      },
      " yathā pādaṅguṭṭhakena migāramātupāsādaṃ saṅkampesi sampakampesi sampacālesi. Atha kho te bhikkhū saṃviggā lomahaṭṭhajātā ekamantaṃ aṭṭhaṃsu – ‘‘acchariyaṃ vata, bho, abbhutaṃ vata, bho! Nivātañca vata ayañca migāramātupāsādo gambhīranemo sunikhāto acalo asampakampī, atha ca pana saṅkampito sampakampito sampacālito’’ti!"
    ],
    "innerText": "‘‘Evaṃ, bhante’’ti kho āyasmā mahāmoggallāno bhagavato paṭissutvā tathārūpaṃ iddhābhisaṅkhāraṃ abhisaṅkhāresi [abhisaṅkharesi (syā. pī. ka.)] yathā pādaṅguṭṭhakena migāramātupāsādaṃ saṅkampesi sampakampesi sampacālesi. Atha kho te bhikkhū saṃviggā lomahaṭṭhajātā ekamantaṃ aṭṭhaṃsu – ‘‘acchariyaṃ vata, bho, abbhutaṃ vata, bho! Nivātañca vata ayañca migāramātupāsādo gambhīranemo sunikhāto acalo asampakampī, atha ca pana saṅkampito sampakampito sampacālito’’ti!"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū bhagavā etadavoca – ‘‘kiṃ nu tumhe, bhikkhave, saṃviggā lomahaṭṭhajātā ekamantaṃ ṭhitā’’ti? ‘‘Acchariyaṃ, bhante, abbhutaṃ bhante! Nivātañca vata ayañca migāramātupāsādo gambhīranemo sunikhāto acalo asampakampī, atha ca pana saṅkampito sampakampito sampacālito’’ti! ‘‘Tumheva kho, bhikkhave, saṃvejetukāmena moggallānena bhikkhunā pādaṅguṭṭhakena migāramātupāsādo, saṅkampito sampakampito sampacālito. Taṃ kiṃ maññatha, bhikkhave, katamesaṃ dhammānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo’’ti ",
      "? ‘‘Bhagavaṃmūlakā no, bhante, dhammā, bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho. Bhagavato sutvā bhikkhū dhāressantī’’ti."
    ],
    "innerText": "Atha kho bhagavā yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū bhagavā etadavoca – ‘‘kiṃ nu tumhe, bhikkhave, saṃviggā lomahaṭṭhajātā ekamantaṃ ṭhitā’’ti? ‘‘Acchariyaṃ, bhante, abbhutaṃ bhante! Nivātañca vata ayañca migāramātupāsādo gambhīranemo sunikhāto acalo asampakampī, atha ca pana saṅkampito sampakampito sampacālito’’ti! ‘‘Tumheva kho, bhikkhave, saṃvejetukāmena moggallānena bhikkhunā pādaṅguṭṭhakena migāramātupāsādo, saṅkampito sampakampito sampacālito. Taṃ kiṃ maññatha, bhikkhave, katamesaṃ dhammānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo’’ti ? ‘‘Bhagavaṃmūlakā no, bhante, dhammā, bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho. Bhagavato sutvā bhikkhū dhāressantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tena ",
      " hi, bhikkhave, suṇātha. Catunnaṃ kho, bhikkhave, iddhipādānaṃ ",
      " bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo. Katamesaṃ catunnaṃ? Idha, bhikkhave, moggallāno bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me vīmaṃsā na ca ",
      " atilīnā bhavissati, na ca atippaggahitā bhavissati; na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati’. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo. Imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti…pe… imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Catutthaṃ."
    ],
    "innerText": "‘‘Tena hi, bhikkhave, suṇātha. Catunnaṃ kho, bhikkhave, iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo. Katamesaṃ catunnaṃ? Idha, bhikkhave, moggallāno bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati; na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati’. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo. Imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti…pe… imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Uṇṇābhabrāhmaṇasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "827"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ āyasmā ānando kosambiyaṃ viharati ghositārāme. Atha ",
      " kho uṇṇābho brāhmaṇo yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho uṇṇābho brāhmaṇo āyasmantaṃ ānandaṃ etadavoca – ‘‘kimatthiyaṃ nu kho, bho ānanda, samaṇe gotame brahmacariyaṃ vussatī’’ti? ‘‘Chandappahānatthaṃ kho, brāhmaṇa, bhagavati brahmacariyaṃ vussatī’’ti."
    ],
    "innerText": "827. Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā ānando kosambiyaṃ viharati ghositārāme. Atha kho uṇṇābho brāhmaṇo yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho uṇṇābho brāhmaṇo āyasmantaṃ ānandaṃ etadavoca – ‘‘kimatthiyaṃ nu kho, bho ānanda, samaṇe gotame brahmacariyaṃ vussatī’’ti? ‘‘Chandappahānatthaṃ kho, brāhmaṇa, bhagavati brahmacariyaṃ vussatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atthi ",
      " pana, bho ānanda, maggo atthi paṭipadā etassa chandassa pahānāyā’’ti? ‘‘Atthi kho, brāhmaṇa, maggo atthi paṭipadā etassa chandassa pahānāyā’’ti."
    ],
    "innerText": "‘‘Atthi pana, bho ānanda, maggo atthi paṭipadā etassa chandassa pahānāyā’’ti? ‘‘Atthi kho, brāhmaṇa, maggo atthi paṭipadā etassa chandassa pahānāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo pana, bho ānanda, maggo katamā paṭipadā etassa chandassa pahānāyā’’ti? ‘‘Idha, brāhmaṇa, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ayaṃ kho, brāhmaṇa, maggo ayaṃ paṭipadā etassa chandassa pahānāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ ",
      " sante, bho ānanda, santakaṃ hoti no asantakaṃ. Chandeneva chandaṃ pajahissatīti – netaṃ ṭhānaṃ vijjati’’. ‘‘Tena hi, brāhmaṇa, taññevettha paṭipucchissāmi. Yathā te khameyya tathā taṃ byākareyyāsi. Taṃ ",
      " kiṃ maññasi, brāhmaṇa, ahosi te pubbe chando ‘ārāmaṃ gamissāmī’ti? Tassa te ārāmagatassa yo tajjo chando so paṭippassaddho’’ti? ‘‘Evaṃ ",
      ", bho’’. ‘‘Ahosi te pubbe vīriyaṃ ‘ārāmaṃ gamissāmī’ti? Tassa te ārāmagatassa yaṃ tajjaṃ vīriyaṃ taṃ paṭippassaddha’’nti? ‘‘Evaṃ, bho’’. ‘‘Ahosi te pubbe cittaṃ ‘ārāmaṃ gamissāmī’ti? Tassa te ārāmagatassa yaṃ tajjaṃ cittaṃ taṃ paṭippassaddha’’nti? ‘‘Evaṃ, bho’’. ‘‘Ahosi te pubbe vīmaṃsā ‘ārāmaṃ gamissāmī’ti? Tassa te ārāmagatassa yā tajjā vīmaṃsā sā paṭippassaddhā’’ti? ‘‘Evaṃ, bho’’."
    ],
    "innerText": "‘‘Evaṃ sante, bho ānanda, santakaṃ hoti no asantakaṃ. Chandeneva chandaṃ pajahissatīti – netaṃ ṭhānaṃ vijjati’’. ‘‘Tena hi, brāhmaṇa, taññevettha paṭipucchissāmi. Yathā te khameyya tathā taṃ byākareyyāsi. Taṃ kiṃ maññasi, brāhmaṇa, ahosi te pubbe chando ‘ārāmaṃ gamissāmī’ti? Tassa te ārāmagatassa yo tajjo chando so paṭippassaddho’’ti? ‘‘Evaṃ , bho’’. ‘‘Ahosi te pubbe vīriyaṃ ‘ārāmaṃ gamissāmī’ti? Tassa te ārāmagatassa yaṃ tajjaṃ vīriyaṃ taṃ paṭippassaddha’’nti? ‘‘Evaṃ, bho’’. ‘‘Ahosi te pubbe cittaṃ ‘ārāmaṃ gamissāmī’ti? Tassa te ārāmagatassa yaṃ tajjaṃ cittaṃ taṃ paṭippassaddha’’nti? ‘‘Evaṃ, bho’’. ‘‘Ahosi te pubbe vīmaṃsā ‘ārāmaṃ gamissāmī’ti? Tassa te ārāmagatassa yā tajjā vīmaṃsā sā paṭippassaddhā’’ti? ‘‘Evaṃ, bho’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evameva kho, brāhmaṇa, yo so bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto, tassa yo pubbe chando ahosi arahattappattiyā, arahattappatte ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[arahatte patte (sī. syā. kaṃ.)]"
      },
      " yo tajjo chando so paṭippassaddho; yaṃ pubbe vīriyaṃ ahosi arahattappattiyā, arahattappatte yaṃ tajjaṃ vīriyaṃ taṃ paṭippassaddhaṃ; yaṃ pubbe cittaṃ ahosi arahattappattiyā, arahattappatte yaṃ tajjaṃ cittaṃ taṃ paṭippassaddhaṃ; yā pubbe vīmaṃsā ahosi arahattappattiyā, arahattappatte yā tajjā vīmaṃsā sā paṭippassaddhā. Taṃ kiṃ maññasi, brāhmaṇa, iti evaṃ sante, santakaṃ vā hoti no asantakaṃ vā’’ti?"
    ],
    "innerText": "‘‘Evameva kho, brāhmaṇa, yo so bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto, tassa yo pubbe chando ahosi arahattappattiyā, arahattappatte [arahatte patte (sī. syā. kaṃ.)] yo tajjo chando so paṭippassaddho; yaṃ pubbe vīriyaṃ ahosi arahattappattiyā, arahattappatte yaṃ tajjaṃ vīriyaṃ taṃ paṭippassaddhaṃ; yaṃ pubbe cittaṃ ahosi arahattappattiyā, arahattappatte yaṃ tajjaṃ cittaṃ taṃ paṭippassaddhaṃ; yā pubbe vīmaṃsā ahosi arahattappattiyā, arahattappatte yā tajjā vīmaṃsā sā paṭippassaddhā. Taṃ kiṃ maññasi, brāhmaṇa, iti evaṃ sante, santakaṃ vā hoti no asantakaṃ vā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Addhā, bho ānanda, evaṃ sante, santakaṃ hoti ",
      " no asantakaṃ. Abhikkantaṃ, bho ānanda, abhikkantaṃ, bho ānanda! Seyyathāpi, bho ānanda, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ ",
      " vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – cakkhumanto rūpāni dakkhantīti; evamevaṃ bhotā ānandena anekapariyāyena dhammo pakāsito. Esāhaṃ, bho ānanda, taṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ ānando dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Pañcamaṃ."
    ],
    "innerText": "‘‘Addhā, bho ānanda, evaṃ sante, santakaṃ hoti no asantakaṃ. Abhikkantaṃ, bho ānanda, abhikkantaṃ, bho ānanda! Seyyathāpi, bho ānanda, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – cakkhumanto rūpāni dakkhantīti; evamevaṃ bhotā ānandena anekapariyāyena dhammo pakāsito. Esāhaṃ, bho ānanda, taṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ ānando dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Paṭhamasamaṇabrāhmaṇasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "828"
      },
      ". ‘‘Ye ",
      " hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā mahiddhikā ahesuṃ mahānubhāvā, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā mahiddhikā bhavissanti mahānubhāvā, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā mahiddhikā mahānubhāvā, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā."
    ],
    "innerText": "828. ‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā mahiddhikā ahesuṃ mahānubhāvā, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā mahiddhikā bhavissanti mahānubhāvā, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā mahiddhikā mahānubhāvā, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamesaṃ catunnaṃ? Idha ",
      ", bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā ",
      " mahiddhikā ahesuṃ mahānubhāvā, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā mahiddhikā bhavissanti mahānubhāvā, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā mahiddhikā mahānubhāvā, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Katamesaṃ catunnaṃ? Idha , bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā mahiddhikā ahesuṃ mahānubhāvā, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā mahiddhikā bhavissanti mahānubhāvā, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā mahiddhikā mahānubhāvā, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Dutiyasamaṇabrāhmaṇasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "829"
      },
      ". ‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhosuṃ – ekopi hutvā bahudhā ahesuṃ, bahudhāpi hutvā eko ahesuṃ; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamānā agamaṃsu, seyyathāpi ",
      " ākāse; pathaviyāpi ummujjanimujjaṃ akaṃsu, seyyathāpi udake; udakepi abhijjamāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhijjamānā (sī. pī. ka.)]"
      },
      " agamaṃsu, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamiṃsu, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasiṃsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[parāmasiṃsu (syā. kaṃ. ka.)]"
      },
      " parimajjiṃsu; yāva brahmalokāpi kāyena vasaṃ vattesuṃ, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā."
    ],
    "innerText": "829. ‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhosuṃ – ekopi hutvā bahudhā ahesuṃ, bahudhāpi hutvā eko ahesuṃ; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamānā agamaṃsu, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ akaṃsu, seyyathāpi udake; udakepi abhijjamāne [abhijjamānā (sī. pī. ka.)] agamaṃsu, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamiṃsu, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasiṃsu [parāmasiṃsu (syā. kaṃ. ka.)] parimajjiṃsu; yāva brahmalokāpi kāyena vasaṃ vattesuṃ, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye ",
      " hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhossanti – ekopi hutvā bahudhā bhavissanti, bahudhāpi hutvā eko bhavissanti; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamānā gamissanti ",
      ", seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karissanti, seyyathāpi ",
      " udake; udakepi abhijjamāne gamissanti, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamissanti, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasissanti parimajjissanti; yāva brahmalokāpi kāyena vasaṃ vattissanti, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā."
    ],
    "innerText": "‘‘Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhossanti – ekopi hutvā bahudhā bhavissanti, bahudhāpi hutvā eko bhavissanti; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamānā gamissanti , seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karissanti, seyyathāpi udake; udakepi abhijjamāne gamissanti, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamissanti, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasissanti parimajjissanti; yāva brahmalokāpi kāyena vasaṃ vattissanti, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhonti – ekopi hutvā bahudhā honti, bahudhāpi hutvā eko honti; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamānā gacchanti, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karonti, seyyathāpi udake; udakepi abhijjamāne gacchanti, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamanti, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[parāmasanti (syā. kaṃ.)]"
      },
      " parimajjanti; yāva brahmalokāpi kāyena vasaṃ vattenti, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattāti."
    ],
    "innerText": "‘‘Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhonti – ekopi hutvā bahudhā honti, bahudhāpi hutvā eko honti; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamānā gacchanti, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karonti, seyyathāpi udake; udakepi abhijjamāne gacchanti, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamanti, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasanti [parāmasanti (syā. kaṃ.)] parimajjanti; yāva brahmalokāpi kāyena vasaṃ vattenti, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhosuṃ – ekopi hutvā bahudhā ahesuṃ…pe… ",
      " yāva brahmalokāpi kāyena vasaṃ vattesuṃ, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā."
    ],
    "innerText": "‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhosuṃ – ekopi hutvā bahudhā ahesuṃ…pe… yāva brahmalokāpi kāyena vasaṃ vattesuṃ, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye ",
      " hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhossanti – ekopi hutvā bahudhā bhavissanti…pe… yāva brahmalokāpi kāyena vasaṃ vattissanti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā."
    ],
    "innerText": "‘‘Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhossanti – ekopi hutvā bahudhā bhavissanti…pe… yāva brahmalokāpi kāyena vasaṃ vattissanti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye ",
      " hi keci bhikkhave etarahi samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhonti – ekopi hutvā bahudhā honti…pe… yāva brahmalokāpi kāyena vasaṃ vattenti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā’’ti. Sattamaṃ."
    ],
    "innerText": "‘‘Ye hi keci bhikkhave etarahi samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhonti – ekopi hutvā bahudhā honti…pe… yāva brahmalokāpi kāyena vasaṃ vattenti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Bhikkhusuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "830"
      },
      ". ‘‘Catunnaṃ, bhikkhave, iddhipādānaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati."
    ],
    "innerText": "830. ‘‘Catunnaṃ, bhikkhave, iddhipādānaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā ",
      " anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Iddhādidesanāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "831"
      },
      ". ‘‘Iddhiṃ vo, bhikkhave, desessāmi iddhipādañca iddhipādabhāvanañca ",
      " iddhipādabhāvanāgāminiñca paṭipadaṃ. Taṃ suṇātha."
    ],
    "innerText": "831. ‘‘Iddhiṃ vo, bhikkhave, desessāmi iddhipādañca iddhipādabhāvanañca iddhipādabhāvanāgāminiñca paṭipadaṃ. Taṃ suṇātha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, iddhi? Idha, bhikkhave, bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti – ayaṃ vuccati, bhikkhave, iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ",
      " ca, bhikkhave, iddhipādo? Yo so, bhikkhave, maggo yā paṭipadā iddhilābhāya iddhipaṭilābhāya saṃvattati – ayaṃ vuccati, bhikkhave, iddhipādo."
    ],
    "innerText": "‘‘Katamo ca, bhikkhave, iddhipādo? Yo so, bhikkhave, maggo yā paṭipadā iddhilābhāya iddhipaṭilābhāya saṃvattati – ayaṃ vuccati, bhikkhave, iddhipādo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, iddhipādabhāvanā? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ayaṃ vuccati, bhikkhave, iddhipādabhāvanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ",
      " ca, bhikkhave, iddhipādabhāvanāgāminī paṭipadā? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi – ayaṃ vuccati, bhikkhave, iddhipādabhāvanāgāminī paṭipadā’’ti. Navamaṃ."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, iddhipādabhāvanāgāminī paṭipadā? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi – ayaṃ vuccati, bhikkhave, iddhipādabhāvanāgāminī paṭipadā’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Vibhaṅgasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "832"
      },
      ". ‘‘Cattārome, bhikkhave, iddhipādā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā’’."
    ],
    "innerText": "832. ‘‘Cattārome, bhikkhave, iddhipādā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathaṃ bhāvitā ca, bhikkhave, cattāro iddhipādā kathaṃ bahulīkatā mahapphalā honti mahānisaṃsā? Idha, bhikkhave ",
      ", bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me chando na ",
      " ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati’. Pacchāpuresaññī ca viharati – ‘yathā pure tathā pacchā, yathā pacchā ",
      " tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ yathā rattiṃ tathā divā’. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati’. Pacchāpuresaññī ca viharati – ‘yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā’. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
    ],
    "innerText": "‘‘Kathaṃ bhāvitā ca, bhikkhave, cattāro iddhipādā kathaṃ bahulīkatā mahapphalā honti mahānisaṃsā? Idha, bhikkhave , bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati’. Pacchāpuresaññī ca viharati – ‘yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ yathā rattiṃ tathā divā’. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati’. Pacchāpuresaññī ca viharati – ‘yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā’. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, atilīno chando? Yo, bhikkhave, chando kosajjasahagato kosajjasampayutto – ayaṃ vuccati, bhikkhave, atilīno chando."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, atippaggahito chando? Yo, bhikkhave, chando uddhaccasahagato uddhaccasampayutto – ayaṃ vuccati, bhikkhave, atippaggahito chando."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ",
      " ca, bhikkhave, ajjhattaṃ saṃkhitto chando? Yo, bhikkhave, chando thinamiddhasahagato thinamiddhasampayutto – ayaṃ vuccati, bhikkhave, ajjhattaṃ saṃkhitto chando."
    ],
    "innerText": "‘‘Katamo ca, bhikkhave, ajjhattaṃ saṃkhitto chando? Yo, bhikkhave, chando thinamiddhasahagato thinamiddhasampayutto – ayaṃ vuccati, bhikkhave, ajjhattaṃ saṃkhitto chando."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, bahiddhā vikkhitto chando? Yo, bhikkhave, chando bahiddhā pañca kāmaguṇe ārabbha anuvikkhitto anuvisaṭo – ayaṃ vuccati, bhikkhave, bahiddhā vikkhitto chando."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure? Idha ",
      ", bhikkhave, bhikkhuno pacchāpuresaññā suggahitā hoti sumanasikatā sūpadhāritā suppaṭividdhā paññāya. Evaṃ kho, bhikkhave, bhikkhu pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure? Idha , bhikkhave, bhikkhuno pacchāpuresaññā suggahitā hoti sumanasikatā sūpadhāritā suppaṭividdhā paññāya. Evaṃ kho, bhikkhave, bhikkhu pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho viharati? Idha, bhikkhave, bhikkhu imameva kāyaṃ uddhaṃ pādatalā adho kesamatthakā tacapariyantaṃ pūraṃ nānappakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā lomā nakhā dantā taco maṃsaṃ nhāru aṭṭhi aṭṭhimiñjaṃ vakkaṃ hadayaṃ yakanaṃ kilomakaṃ pihakaṃ papphāsaṃ antaṃ antaguṇaṃ udariyaṃ karīsaṃ pittaṃ semhaṃ pubbo lohitaṃ sedo medo assu vasā kheḷo siṅghāṇikā lasikā mutta’nti. Evaṃ kho, bhikkhave, bhikkhu yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, bhikkhu yathā divā tathā rattiṃ, yathā rattiṃ tathā divā viharati? Idha, bhikkhave, bhikkhu yehi ākārehi yehi liṅgehi yehi nimittehi divā chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, so tehi ākārehi tehi liṅgehi tehi nimittehi rattiṃ chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti; yehi vā pana ākārehi yehi liṅgehi yehi nimittehi rattiṃ chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, so tehi ākārehi tehi liṅgehi tehi nimittehi divā chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Evaṃ kho, bhikkhave, bhikkhu yathā divā tathā rattiṃ, yathā rattiṃ tathā divā viharati."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, bhikkhu yathā divā tathā rattiṃ, yathā rattiṃ tathā divā viharati? Idha, bhikkhave, bhikkhu yehi ākārehi yehi liṅgehi yehi nimittehi divā chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, so tehi ākārehi tehi liṅgehi tehi nimittehi rattiṃ chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti; yehi vā pana ākārehi yehi liṅgehi yehi nimittehi rattiṃ chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, so tehi ākārehi tehi liṅgehi tehi nimittehi divā chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Evaṃ kho, bhikkhave, bhikkhu yathā divā tathā rattiṃ, yathā rattiṃ tathā divā viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti? Idha, bhikkhave, bhikkhuno ālokasaññā suggahitā hoti divāsaññā svādhiṭṭhitā. Evaṃ kho, bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti? Idha, bhikkhave, bhikkhuno ālokasaññā suggahitā hoti divāsaññā svādhiṭṭhitā. Evaṃ kho, bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamañca ",
      ", bhikkhave, atilīnaṃ vīriyaṃ? Yaṃ, bhikkhave, vīriyaṃ kosajjasahagataṃ kosajjasampayuttaṃ – idaṃ vuccati, bhikkhave, atilīnaṃ vīriyaṃ."
    ],
    "innerText": "‘‘Katamañca , bhikkhave, atilīnaṃ vīriyaṃ? Yaṃ, bhikkhave, vīriyaṃ kosajjasahagataṃ kosajjasampayuttaṃ – idaṃ vuccati, bhikkhave, atilīnaṃ vīriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamañca, bhikkhave, atippaggahitaṃ vīriyaṃ? Yaṃ, bhikkhave, vīriyaṃ uddhaccasahagataṃ uddhaccasampayuttaṃ – idaṃ vuccati, bhikkhave, atippaggahitaṃ vīriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamañca, bhikkhave, ajjhattaṃ saṃkhittaṃ vīriyaṃ? Yaṃ, bhikkhave, vīriyaṃ ",
      " thinamiddhasahagataṃ thinamiddhasampayuttaṃ – idaṃ vuccati, bhikkhave, ajjhattaṃ saṃkhittaṃ vīriyaṃ."
    ],
    "innerText": "‘‘Katamañca, bhikkhave, ajjhattaṃ saṃkhittaṃ vīriyaṃ? Yaṃ, bhikkhave, vīriyaṃ thinamiddhasahagataṃ thinamiddhasampayuttaṃ – idaṃ vuccati, bhikkhave, ajjhattaṃ saṃkhittaṃ vīriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamañca, bhikkhave, bahiddhā vikkhittaṃ vīriyaṃ? Yaṃ, bhikkhave, vīriyaṃ bahiddhā pañca kāmaguṇe ārabbha anuvikkhittaṃ anuvisaṭaṃ – idaṃ vuccati, bhikkhave, bahiddhā vikkhittaṃ vīriyaṃ…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti ",
      "? Idha, bhikkhave, bhikkhuno ālokasaññā suggahitā hoti divāsaññā svādhiṭṭhitā. Evaṃ kho, bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti ? Idha, bhikkhave, bhikkhuno ālokasaññā suggahitā hoti divāsaññā svādhiṭṭhitā. Evaṃ kho, bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamañca, bhikkhave, atilīnaṃ cittaṃ? Yaṃ, bhikkhave, cittaṃ kosajjasahagataṃ kosajjasampayuttaṃ – idaṃ vuccati, bhikkhave, atilīnaṃ cittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamañca, bhikkhave, atippaggahitaṃ cittaṃ? Yaṃ, bhikkhave, cittaṃ uddhaccasahagataṃ uddhaccasampayuttaṃ – idaṃ vuccati, bhikkhave, atippaggahitaṃ cittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamañca, bhikkhave, ajjhattaṃ saṃkhittaṃ cittaṃ? Yaṃ, bhikkhave, cittaṃ thinamiddhasahagataṃ thinamiddhasampayuttaṃ – idaṃ vuccati, bhikkhave, ajjhattaṃ saṃkhittaṃ cittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamañca ",
      ", bhikkhave, bahiddhā vikkhittaṃ cittaṃ? Yaṃ, bhikkhave, cittaṃ bahiddhā pañca kāmaguṇe ārabbha anuvikkhittaṃ anuvisaṭaṃ – idaṃ vuccati, bhikkhave, bahiddhā vikkhittaṃ cittaṃ…pe… evaṃ ",
      " kho, bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
    ],
    "innerText": "‘‘Katamañca , bhikkhave, bahiddhā vikkhittaṃ cittaṃ? Yaṃ, bhikkhave, cittaṃ bahiddhā pañca kāmaguṇe ārabbha anuvikkhittaṃ anuvisaṭaṃ – idaṃ vuccati, bhikkhave, bahiddhā vikkhittaṃ cittaṃ…pe… evaṃ kho, bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, atilīnā vīmaṃsā? Yā, bhikkhave, vīmaṃsā kosajjasahagatā kosajjasampayuttā – ayaṃ vuccati, bhikkhave, atilīnā vīmaṃsā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ",
      " ca, bhikkhave, atippaggahitā vīmaṃsā? Yā, bhikkhave, vīmaṃsā uddhaccasahagatā uddhaccasampayuttā – ayaṃ vuccati, bhikkhave, atippaggahitā vīmaṃsā."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, atippaggahitā vīmaṃsā? Yā, bhikkhave, vīmaṃsā uddhaccasahagatā uddhaccasampayuttā – ayaṃ vuccati, bhikkhave, atippaggahitā vīmaṃsā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, ajjhattaṃ saṃkhittā vīmaṃsā? Yā, bhikkhave, vīmaṃsā thinamiddhasahagatā thinamiddhasampayuttā – ayaṃ vuccati, bhikkhave, ajjhattaṃ saṃkhittā vīmaṃsā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca, bhikkhave, bahiddhā vikkhittā vīmaṃsā? Yā, bhikkhave, vīmaṃsā bahiddhā pañca kāmaguṇe ārabbha anuvikkhittā anuvisaṭā – ayaṃ vuccati, bhikkhave, bahiddhā ",
      " vikkhittā vīmaṃsā…pe… evaṃ kho, bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Evaṃ bhāvitā kho, bhikkhave, cattāro iddhipādā evaṃ bahulīkatā mahapphalā honti mahānisaṃsā."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, bahiddhā vikkhittā vīmaṃsā? Yā, bhikkhave, vīmaṃsā bahiddhā pañca kāmaguṇe ārabbha anuvikkhittā anuvisaṭā – ayaṃ vuccati, bhikkhave, bahiddhā vikkhittā vīmaṃsā…pe… evaṃ kho, bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Evaṃ bhāvitā kho, bhikkhave, cattāro iddhipādā evaṃ bahulīkatā mahapphalā honti mahānisaṃsā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ bahulīkatesu, anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti…pe… yāva brahmalokāpi ",
      " kāyena vasaṃ vatteti. Evaṃ bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ bahulīkatesu, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ ",
      " paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Dasamaṃ."
    ],
    "innerText": "‘‘Evaṃ bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ bahulīkatesu, anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti. Evaṃ bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ bahulīkatesu, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pāsādakampanavaggo dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pubbaṃ mahapphalaṃ chandaṃ, moggallānañca uṇṇābhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dve samaṇabrāhmaṇā bhikkhu, desanā vibhaṅgena cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Ayoguḷavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Maggasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "833"
      },
      ". Sāvatthinidānaṃ ",
      ". ‘‘Pubbeva me, bhikkhave, sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi – ‘ko nu kho maggo, kā paṭipadā iddhipādabhāvanāyā’ti ",
      "? Tassa mayhaṃ, bhikkhave, etadahosi – ‘idha bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti ",
      ". Vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ yathā rattiṃ tathā divā’ – iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
    ],
    "innerText": "833. Sāvatthinidānaṃ . ‘‘Pubbeva me, bhikkhave, sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi – ‘ko nu kho maggo, kā paṭipadā iddhipādabhāvanāyā’ti ? Tassa mayhaṃ, bhikkhave, etadahosi – ‘idha bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti . Vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ yathā rattiṃ tathā divā’ – iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ ",
      " bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ ",
      " bahulīkatesu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti. Evaṃ bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ bahulīkatesu, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Paṭhamaṃ."
    ],
    "innerText": "‘‘Evaṃ bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ bahulīkatesu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti. Evaṃ bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ bahulīkatesu, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Chapi abhiññāyo vitthāretabbā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Ayoguḷasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "834"
      },
      ". Sāvatthinidānaṃ. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘abhijānāti nu kho, bhante, bhagavā iddhiyā manomayena kāyena brahmalokaṃ upasaṅkamitā’’ti? ‘‘Abhijānāmi khvāhaṃ, ānanda, iddhiyā manomayena kāyena brahmalokaṃ upasaṅkamitā’’ti. ‘‘Abhijānāti pana, bhante, bhagavā iminā cātumahābhūtikena kāyena iddhiyā brahmalokaṃ upasaṅkamitā’’ti ",
      "? ‘‘Abhijānāmi khvāhaṃ, ānanda, iminā cātumahābhūtikena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cātummahābhūtikena (sī. syā. kaṃ.)]"
      },
      " kāyena iddhiyā brahmalokaṃ upasaṅkamitā’’ti."
    ],
    "innerText": "834. Sāvatthinidānaṃ. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘abhijānāti nu kho, bhante, bhagavā iddhiyā manomayena kāyena brahmalokaṃ upasaṅkamitā’’ti? ‘‘Abhijānāmi khvāhaṃ, ānanda, iddhiyā manomayena kāyena brahmalokaṃ upasaṅkamitā’’ti. ‘‘Abhijānāti pana, bhante, bhagavā iminā cātumahābhūtikena kāyena iddhiyā brahmalokaṃ upasaṅkamitā’’ti ? ‘‘Abhijānāmi khvāhaṃ, ānanda, iminā cātumahābhūtikena [cātummahābhūtikena (sī. syā. kaṃ.)] kāyena iddhiyā brahmalokaṃ upasaṅkamitā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yañca kho, omāti, bhante, bhagavā iddhiyā manomayena kāyena brahmalokaṃ upasaṅkamituṃ, yañca ",
      " kho abhijānāti, bhante, bhagavā iminā cātumahābhūtikena kāyena iddhiyā brahmalokaṃ upasaṅkamitā ",
      ", tayidaṃ, bhante, bhagavato acchariyañceva abbhutañcā’’ti. ‘‘Acchariyā ",
      " ceva, ānanda, tathāgatā acchariyadhammasamannāgatā ca, abbhutā ceva, ānanda, tathāgatā abbhutadhammasamannāgatā ca’’."
    ],
    "innerText": "‘‘Yañca kho, omāti, bhante, bhagavā iddhiyā manomayena kāyena brahmalokaṃ upasaṅkamituṃ, yañca kho abhijānāti, bhante, bhagavā iminā cātumahābhūtikena kāyena iddhiyā brahmalokaṃ upasaṅkamitā , tayidaṃ, bhante, bhagavato acchariyañceva abbhutañcā’’ti. ‘‘Acchariyā ceva, ānanda, tathāgatā acchariyadhammasamannāgatā ca, abbhutā ceva, ānanda, tathāgatā abbhutadhammasamannāgatā ca’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yasmiṃ, ānanda, samaye tathāgato kāyampi citte samodahati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samādahati (sī. syā. pī.)]"
      },
      " cittampi kāye samodahati, sukhasaññañca lahusaññañca kāye okkamitvā viharati; tasmiṃ, ānanda, samaye tathāgatassa kāyo lahutaro ceva hoti mudutaro ca kammaniyataro ca pabhassarataro ca."
    ],
    "innerText": "‘‘Yasmiṃ, ānanda, samaye tathāgato kāyampi citte samodahati [samādahati (sī. syā. pī.)] cittampi kāye samodahati, sukhasaññañca lahusaññañca kāye okkamitvā viharati; tasmiṃ, ānanda, samaye tathāgatassa kāyo lahutaro ceva hoti mudutaro ca kammaniyataro ca pabhassarataro ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Seyyathāpi, ānanda, ayoguḷo divasaṃ santatto lahutaro ceva hoti mudutaro ca kammaniyataro ca pabhassarataro ca; evameva kho, ānanda, yasmiṃ samaye tathāgato kāyampi citte samodahati, cittampi kāye samodahati, sukhasaññañca lahusaññañca kāye okkamitvā viharati; tasmiṃ, ānanda, samaye tathāgatassa kāyo lahutaro ceva hoti mudutaro ca kammaniyataro ca pabhassarataro ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yasmiṃ, ānanda, samaye tathāgato kāyampi citte samodahati, cittampi kāye samodahati, sukhasaññañca lahusaññañca kāye okkamitvā viharati; tasmiṃ, ānanda, samaye tathāgatassa kāyo appakasireneva pathaviyā vehāsaṃ abbhuggacchati, so anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi ",
      ", ānanda, tūlapicu vā kappāsapicu vā lahuko vātūpādāno appakasireneva pathaviyā vehāsaṃ abbhuggacchati; evameva kho, ānanda, yasmiṃ samaye tathāgato kāyampi citte samodahati, cittampi ",
      " kāye samodahati, sukhasaññañca lahusaññañca kāye okkamitvā viharati; tasmiṃ, ānanda, samaye tathāgatassa kāyo appakasireneva pathaviyā vehāsaṃ abbhuggacchati, so anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti…pe… yāva brahmalokāpi kāyena vasaṃ vattetī’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Seyyathāpi , ānanda, tūlapicu vā kappāsapicu vā lahuko vātūpādāno appakasireneva pathaviyā vehāsaṃ abbhuggacchati; evameva kho, ānanda, yasmiṃ samaye tathāgato kāyampi citte samodahati, cittampi kāye samodahati, sukhasaññañca lahusaññañca kāye okkamitvā viharati; tasmiṃ, ānanda, samaye tathāgatassa kāyo appakasireneva pathaviyā vehāsaṃ abbhuggacchati, so anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti…pe… yāva brahmalokāpi kāyena vasaṃ vattetī’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Bhikkhusuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "835"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave, iddhipādā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ime kho, bhikkhave, cattāro iddhipādā. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Tatiyaṃ."
    ],
    "innerText": "835. ‘‘Cattārome , bhikkhave, iddhipādā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ime kho, bhikkhave, cattāro iddhipādā. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Suddhikasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "836"
      },
      ". ‘‘Cattārome, bhikkhave, iddhipādā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ ",
      " iddhipādaṃ bhāveti – ime kho, bhikkhave, cattāro iddhipādā’’ti. Catutthaṃ."
    ],
    "innerText": "836. ‘‘Cattārome, bhikkhave, iddhipādā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ime kho, bhikkhave, cattāro iddhipādā’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Paṭhamaphalasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "837"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave, iddhipādā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ime kho, bhikkhave, cattāro iddhipādā. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā bhikkhunā dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ – diṭṭheva dhamme aññā, sati vā upādisese anāgāmitā’’ti. Pañcamaṃ."
    ],
    "innerText": "837. ‘‘Cattārome , bhikkhave, iddhipādā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ime kho, bhikkhave, cattāro iddhipādā. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā bhikkhunā dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ – diṭṭheva dhamme aññā, sati vā upādisese anāgāmitā’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Dutiyaphalasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "838"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave, iddhipādā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ ",
      " iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ime kho, bhikkhave, cattāro iddhipādā. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā satta phalā sattānisaṃsā pāṭikaṅkhā."
    ],
    "innerText": "838. ‘‘Cattārome , bhikkhave, iddhipādā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ime kho, bhikkhave, cattāro iddhipādā. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā satta phalā sattānisaṃsā pāṭikaṅkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame satta phalā sattānisaṃsā? Diṭṭheva dhamme paṭikacca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṭigacca (sī.), paṭihacca (pī.)]"
      },
      " aññaṃ ārādheti no ce diṭṭheva dhamme paṭikacca aññaṃ ārādheti; atha maraṇakāle aññaṃ ārādheti, no ce diṭṭheva dhamme paṭikacca aññaṃ ārādheti, no ce maraṇakāle aññaṃ ārādheti; atha pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā antarāparinibbāyī hoti, upahaccaparinibbāyī hoti, asaṅkhāraparinibbāyī hoti, sasaṅkhāraparinibbāyī hoti, uddhaṃsoto hoti akaniṭṭhagāmī. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā ime satta phalā sattānisaṃsā pāṭikaṅkhā’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Katame satta phalā sattānisaṃsā? Diṭṭheva dhamme paṭikacca [paṭigacca (sī.), paṭihacca (pī.)] aññaṃ ārādheti no ce diṭṭheva dhamme paṭikacca aññaṃ ārādheti; atha maraṇakāle aññaṃ ārādheti, no ce diṭṭheva dhamme paṭikacca aññaṃ ārādheti, no ce maraṇakāle aññaṃ ārādheti; atha pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā antarāparinibbāyī hoti, upahaccaparinibbāyī hoti, asaṅkhāraparinibbāyī hoti, sasaṅkhāraparinibbāyī hoti, uddhaṃsoto hoti akaniṭṭhagāmī. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā ime satta phalā sattānisaṃsā pāṭikaṅkhā’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Paṭhamaānandasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "839"
      },
      ". Sāvatthinidānaṃ. Atha kho āyasmā ānando yena bhagavā ",
      " tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca –"
    ],
    "innerText": "839. Sāvatthinidānaṃ. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā nu kho, bhante ",
      ", iddhi, katamo iddhipādo, katamā iddhipādabhāvanā, katamā iddhipādabhāvanāgāminī paṭipadā’’ti? ‘‘Idhānanda, bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti – ayaṃ vuccatānanda, iddhi’’."
    ],
    "innerText": "‘‘Katamā nu kho, bhante , iddhi, katamo iddhipādo, katamā iddhipādabhāvanā, katamā iddhipādabhāvanāgāminī paṭipadā’’ti? ‘‘Idhānanda, bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti – ayaṃ vuccatānanda, iddhi’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo cānanda, iddhipādo? Yo, ānanda, maggo yā paṭipadā iddhilābhāya iddhipaṭilābhāya saṃvattati – ayaṃ vuccatānanda, iddhipādo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ",
      " cānanda, iddhipādabhāvanā? Idhānanda, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ ",
      " bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ayaṃ vuccatānanda, iddhipādabhāvanā."
    ],
    "innerText": "‘‘Katamā cānanda, iddhipādabhāvanā? Idhānanda, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ayaṃ vuccatānanda, iddhipādabhāvanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā cānanda, iddhipādabhāvanāgāminī paṭipadā? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi – ayaṃ vuccatānanda, iddhipādabhāvanāgāminī paṭipadā’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Dutiyaānandasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "840"
      },
      ". Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘katamā nu kho, ānanda, iddhi, katamo iddhipādo, katamā ",
      " iddhipādabhāvanā, katamā iddhipādabhāvanāgāminī paṭipadā’’ti? Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā…pe…."
    ],
    "innerText": "840. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘katamā nu kho, ānanda, iddhi, katamo iddhipādo, katamā iddhipādabhāvanā, katamā iddhipādabhāvanāgāminī paṭipadā’’ti? Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idhānanda, bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti – ayaṃ vuccatānanda, iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo cānanda, iddhipādo? Yo, ānanda, maggo yā paṭipadā iddhilābhāya iddhipaṭilābhāya saṃvattati – ayaṃ vuccatānanda, iddhipādo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā cānanda, iddhipādabhāvanā? Idhānanda, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ayaṃ vuccatānanda, iddhipādabhāvanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā cānanda, iddhipādabhāvanāgāminī paṭipadā? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi – ayaṃ vuccatānanda, iddhipādabhāvanāgāminī paṭipadā’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Paṭhamabhikkhusuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "841"
      },
      ". Atha ",
      " kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho ",
      " te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘katamā nu kho, bhante, iddhi, katamo iddhipādo, katamā iddhipādabhāvanā, katamā iddhipādabhāvanāgāminī ",
      " paṭipadā’’ti?"
    ],
    "innerText": "841. Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘katamā nu kho, bhante, iddhi, katamo iddhipādo, katamā iddhipādabhāvanā, katamā iddhipādabhāvanāgāminī paṭipadā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha, bhikkhave, bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti – ayaṃ vuccati, bhikkhave, iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, iddhipādo? Yo, bhikkhave, maggo, yā paṭipadā iddhilābhāya iddhipaṭilābhāya saṃvattati – ayaṃ vuccati, bhikkhave, iddhipādo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, iddhipādabhāvanā? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ayaṃ vuccati, bhikkhave, iddhipādabhāvanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, iddhipādabhāvanāgāminī paṭipadā? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi – ayaṃ vuccati, bhikkhave, iddhipādabhāvanāgāminī paṭipadā’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Dutiyabhikkhusuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "842"
      },
      ". Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu…pe… ekamantaṃ nisinne kho te bhikkhū bhagavā etadavoca – ‘‘katamā nu kho, bhikkhave, iddhi, katamo iddhipādo, katamā iddhipādabhāvanā, katamā iddhipādabhāvanāgāminī paṭipadā’’ti? Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā…pe…."
    ],
    "innerText": "842. Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu…pe… ekamantaṃ nisinne kho te bhikkhū bhagavā etadavoca – ‘‘katamā nu kho, bhikkhave, iddhi, katamo iddhipādo, katamā iddhipādabhāvanā, katamā iddhipādabhāvanāgāminī paṭipadā’’ti? Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ",
      " ca, bhikkhave, iddhi? Idha, bhikkhave, bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti – ayaṃ vuccati, bhikkhave, iddhi."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, iddhi? Idha, bhikkhave, bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti – ayaṃ vuccati, bhikkhave, iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, iddhipādo? Yo, bhikkhave, maggo, yā paṭipadā iddhilābhāya iddhipaṭilābhāya saṃvattati – ayaṃ vuccati, bhikkhave, iddhipādo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca, bhikkhave, iddhipādabhāvanā? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ ",
      " iddhipādaṃ bhāveti – ayaṃ vuccati, bhikkhave, iddhipādabhāvanā."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, iddhipādabhāvanā? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ayaṃ vuccati, bhikkhave, iddhipādabhāvanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ",
      " ca, bhikkhave, iddhipādabhāvanāgāminī paṭipadā? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi. Ayaṃ vuccati, bhikkhave, iddhipādabhāvanāgāminī paṭipadā’’ti. Dasamaṃ."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, iddhipādabhāvanāgāminī paṭipadā? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi. Ayaṃ vuccati, bhikkhave, iddhipādabhāvanāgāminī paṭipadā’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Moggallānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "843"
      },
      ". Tatra kho bhagavā bhikkhū āmantesi – ‘‘taṃ kiṃ maññatha, bhikkhave, katamesaṃ dhammānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo’’ti? Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā…pe… ‘‘catunnaṃ kho, bhikkhave, iddhipādānaṃ bhāvitattā bahulīkatattā ",
      " moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo’’."
    ],
    "innerText": "843. Tatra kho bhagavā bhikkhū āmantesi – ‘‘taṃ kiṃ maññatha, bhikkhave, katamesaṃ dhammānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo’’ti? Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā…pe… ‘‘catunnaṃ kho, bhikkhave, iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, moggallāno bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati’. Pacchāpuresaññī ca viharati – ‘yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā’. Iti ",
      " vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati’…pe… iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo."
    ],
    "innerText": "‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, moggallāno bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati’. Pacchāpuresaññī ca viharati – ‘yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā’. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati’…pe… iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggalāno bhikkhu evaṃ anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti…pe… yāva ",
      " brahmalokāpi kāyena vasaṃ vatteti. Imesañca ",
      " pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā ",
      " moggallāno bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Ekādasamaṃ."
    ],
    "innerText": "‘‘Imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggalāno bhikkhu evaṃ anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti. Imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Ekādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "12. Tathāgatasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "844"
      },
      ". Tatra kho bhagavā bhikkhū āmantesi – ‘‘taṃ kiṃ maññatha, bhikkhave, katamesaṃ dhammānaṃ bhāvitattā bahulīkatattā tathāgato evaṃmahiddhiko evaṃmahānubhāvo’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘catunnaṃ kho, bhikkhave, iddhipādānaṃ bhāvitattā bahulīkatattā tathāgato evaṃmahiddhiko evaṃmahānubhāvo’’."
    ],
    "innerText": "844. Tatra kho bhagavā bhikkhū āmantesi – ‘‘taṃ kiṃ maññatha, bhikkhave, katamesaṃ dhammānaṃ bhāvitattā bahulīkatattā tathāgato evaṃmahiddhiko evaṃmahānubhāvo’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘catunnaṃ kho, bhikkhave, iddhipādānaṃ bhāvitattā bahulīkatattā tathāgato evaṃmahiddhiko evaṃmahānubhāvo’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, tathāgato chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati’. Pacchāpuresaññī ca viharati – ‘yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā’. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me vīmaṃsā ",
      " na ca atilīnā bhavissati, na ca atipaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati’. Pacchāpuresaññī ca viharati – ‘yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā’. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā tathāgato evaṃmahiddhiko ",
      " evaṃmahānubhāvo."
    ],
    "innerText": "‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, tathāgato chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati’. Pacchāpuresaññī ca viharati – ‘yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā’. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me vīmaṃsā na ca atilīnā bhavissati, na ca atipaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati’. Pacchāpuresaññī ca viharati – ‘yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā’. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā tathāgato evaṃmahiddhiko evaṃmahānubhāvo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā tathāgato anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti…pe… ",
      " yāva brahmalokāpi kāyena vasaṃ vatteti. Imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā tathāgato āsavānaṃ ",
      " khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Dvādasamaṃ."
    ],
    "innerText": "‘‘Imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā tathāgato anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti. Imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā tathāgato āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Dvādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "(Chapi abhiññāyo vitthāretabbā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ayoguḷavaggo tatiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Maggo ayoguḷo bhikkhu, suddhikañcāpi dve phalā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dve cānandā duve bhikkhū, moggallāno tathāgatoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4. Gaṅgāpeyyālavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1-12. Gaṅgānadīādisuttadvādasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "845-856"
      },
      ". ‘‘Seyyathāpi ",
      ", bhikkhave, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā; evameva kho, bhikkhave, bhikkhu cattāro iddhipāde bhāvento cattāro iddhipāde bahulīkaronto ",
      " nibbānaninno hoti nibbānapoṇo nibbānapabbhāro. Kathañca, bhikkhave, bhikkhu cattāro iddhipāde bhāvento cattāro iddhipāde bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti."
    ],
    "innerText": "845-856. ‘‘Seyyathāpi , bhikkhave, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā; evameva kho, bhikkhave, bhikkhu cattāro iddhipāde bhāvento cattāro iddhipāde bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro. Kathañca, bhikkhave, bhikkhu cattāro iddhipāde bhāvento cattāro iddhipāde bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ kho, bhikkhave, bhikkhu cattāro iddhipāde ",
      " bhāvento cattāro iddhipāde bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro’’ti. Dvādasamaṃ."
    ],
    "innerText": "‘‘Evaṃ kho, bhikkhave, bhikkhu cattāro iddhipāde bhāvento cattāro iddhipāde bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro’’ti. Dvādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Gaṅgāpeyyālavaggo catuttho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Cha pācīnato ninnā, cha ninnā ca samuddato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dvete cha dvādasa honti, vaggo tena pavuccatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Appamādavaggo vitthāretabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Tathāgataṃ ",
      " padaṃ kūṭaṃ, mūlaṃ sāro ca vassikaṃ;"
    ],
    "innerText": "Tathāgataṃ padaṃ kūṭaṃ, mūlaṃ sāro ca vassikaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rājā candimasūriyā, vatthena dasamaṃ padanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      "Balakaraṇīyavaggo ",
      " vitthāretabbo."
    ],
    "innerText": "Balakaraṇīyavaggo vitthāretabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Balaṃ bījañca nāgo ca, rukkho kumbhena sūkiyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ākāsena ca dve meghā, nāvā āgantukā nadīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Esanāvaggo vitthāretabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Esanā ",
      " vidhā āsavo, bhavo ca dukkhatā tisso;"
    ],
    "innerText": "Esanā vidhā āsavo, bhavo ca dukkhatā tisso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khilaṃ malañca nīgho ca, vedanā taṇhā tasinā cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "8. Oghavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1-10. Oghādisuttadasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "889-898"
      },
      ". ‘‘Pañcimāni, bhikkhave, uddhambhāgiyāni saṃyojanāni. Katamāni pañca ",
      "? Rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā – imāni kho, bhikkhave, pañcuddhambhāgiyāni saṃyojanāni. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya cattāro iddhipādā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ ",
      " iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi ",
      " …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya ime cattāro iddhipādā bhāvetabbā’’ti."
    ],
    "innerText": "889-898. ‘‘Pañcimāni, bhikkhave, uddhambhāgiyāni saṃyojanāni. Katamāni pañca ? Rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā – imāni kho, bhikkhave, pañcuddhambhāgiyāni saṃyojanāni. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya cattāro iddhipādā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya ime cattāro iddhipādā bhāvetabbā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "(Yathā ",
      " maggasaṃyuttaṃ tathā vitthāretabbaṃ)."
    ],
    "innerText": "(Yathā maggasaṃyuttaṃ tathā vitthāretabbaṃ)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Oghavaggo aṭṭhamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ogho yogo upādānaṃ, ganthā anusayena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kāmaguṇā nīvaraṇā, khandhā oruddhambhāgiyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iddhipādasaṃyuttaṃ sattamaṃ."
  }
]