[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "8. Lakkhaṇasaṃyuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paṭhamavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Aṭṭhisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "202"
      },
      ". Lakkhaṇasaṃyutte ",
      " yvāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āyasmā ca lakkhaṇo"
      },
      "ti lakkhaṇatthero vutto, esa jaṭilasahassabbhantare ehibhikkhūpasampadāya upasampanno ādittapariyāyāvasāne arahattaṃ patto eko mahāsāvakoti veditabbo. Yasmā panesa lakkhaṇasampannena sabbākāraparipūrena brahmasamena attabhāvena samannāgato, tasmā ‘‘lakkhaṇo’’ti saṅkhaṃ gato. Mahāmoggallāno pana pabbajitadivasato sattame divase arahattaṃ patto dutiyo aggasāvako."
    ],
    "innerText": "202. Lakkhaṇasaṃyutte yvāyaṃ āyasmā ca lakkhaṇoti lakkhaṇatthero vutto, esa jaṭilasahassabbhantare ehibhikkhūpasampadāya upasampanno ādittapariyāyāvasāne arahattaṃ patto eko mahāsāvakoti veditabbo. Yasmā panesa lakkhaṇasampannena sabbākāraparipūrena brahmasamena attabhāvena samannāgato, tasmā ‘‘lakkhaṇo’’ti saṅkhaṃ gato. Mahāmoggallāno pana pabbajitadivasato sattame divase arahattaṃ patto dutiyo aggasāvako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sitaṃ pātvākāsī"
      },
      "ti mandahasitaṃ pātuakāsi, pakāsayi dassesīti vuttaṃ hoti. Kiṃ pana disvā thero sitaṃ pātvākāsīti? Upari pāḷiyaṃ āgataṃ aṭṭhikasaṅkhalikaṃ ekaṃ petaloke nibbattaṃ sattaṃ disvā. Tañca kho dibbena cakkhunā, na pasādacakkhunā. Pasādacakkhussa hi ete attabhāvā na āpāthaṃ āgacchanti. Evarūpaṃ pana attabhāvaṃ disvā kāruññe kattabbe kasmā sitaṃ pātvākāsīti? Attano ca buddhañāṇassa ca sampattiṃ samanussaraṇato. Tañhi disvā thero ‘‘adiṭṭhasaccena nāma puggalena paṭilabhitabbā evarūpā attabhāvā mutto ahaṃ, lābhā vata me, suladdhaṃ vata me’’ti attano ca sampattiṃ anussaritvā – ‘‘aho buddhassa bhagavato ñāṇasampatti, ‘yo kammavipāko, bhikkhave, acinteyyo na cintetabbo’ti desesi, paccakkhaṃ vata katvā buddhā desenti, suppaṭividdhā buddhānaṃ dhammadhātū’’ti evaṃ buddhañāṇasampattiñca anussaritvā sitaṃ pātvākāsīti."
    ],
    "innerText": "Sitaṃ pātvākāsīti mandahasitaṃ pātuakāsi, pakāsayi dassesīti vuttaṃ hoti. Kiṃ pana disvā thero sitaṃ pātvākāsīti? Upari pāḷiyaṃ āgataṃ aṭṭhikasaṅkhalikaṃ ekaṃ petaloke nibbattaṃ sattaṃ disvā. Tañca kho dibbena cakkhunā, na pasādacakkhunā. Pasādacakkhussa hi ete attabhāvā na āpāthaṃ āgacchanti. Evarūpaṃ pana attabhāvaṃ disvā kāruññe kattabbe kasmā sitaṃ pātvākāsīti? Attano ca buddhañāṇassa ca sampattiṃ samanussaraṇato. Tañhi disvā thero ‘‘adiṭṭhasaccena nāma puggalena paṭilabhitabbā evarūpā attabhāvā mutto ahaṃ, lābhā vata me, suladdhaṃ vata me’’ti attano ca sampattiṃ anussaritvā – ‘‘aho buddhassa bhagavato ñāṇasampatti, ‘yo kammavipāko, bhikkhave, acinteyyo na cintetabbo’ti desesi, paccakkhaṃ vata katvā buddhā desenti, suppaṭividdhā buddhānaṃ dhammadhātū’’ti evaṃ buddhañāṇasampattiñca anussaritvā sitaṃ pātvākāsīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " lakkhaṇatthero kasmā na addasa, kimassa dibbacakkhu natthīti? No natthi, mahāmoggallāno ",
      " pana āvajjento addasa, itaro pana anāvajjanena na addasa. Yasmā pana khīṇāsavā nāma na akāraṇā sitaṃ karonti, tasmā taṃ lakkhaṇatthero pucchi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ko nu kho, āvuso moggallāna, hetu, ko paccayo sitassa pātukammāyā"
      },
      "ti? Thero pana ",
      " yasmā yehi ayaṃ upapatti sāmaṃ adiṭṭhā, te dussaddhāpayā honti, tasmā bhagavantaṃ sakkhiṃ katvā byākātukāmatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akālo kho, āvuso"
      },
      "tiādimāha. Tato bhagavato santike puṭṭho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "idhāhaṃ, āvuso"
      },
      "tiādinā nayena byākāsi."
    ],
    "innerText": "Atha lakkhaṇatthero kasmā na addasa, kimassa dibbacakkhu natthīti? No natthi, mahāmoggallāno pana āvajjento addasa, itaro pana anāvajjanena na addasa. Yasmā pana khīṇāsavā nāma na akāraṇā sitaṃ karonti, tasmā taṃ lakkhaṇatthero pucchi ko nu kho, āvuso moggallāna, hetu, ko paccayo sitassa pātukammāyāti? Thero pana yasmā yehi ayaṃ upapatti sāmaṃ adiṭṭhā, te dussaddhāpayā honti, tasmā bhagavantaṃ sakkhiṃ katvā byākātukāmatāya akālo kho, āvusotiādimāha. Tato bhagavato santike puṭṭho idhāhaṃ, āvusotiādinā nayena byākāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhikasaṅkhalika"
      },
      "nti setaṃ nimmaṃsalohitaṃ aṭṭhisaṅghātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gijjhāpi kākāpi kulalāpī"
      },
      "ti etepi yakkhagijjhā ceva yakkhakākā ca yakkhakulalā ca paccetabbā. Pākatikānaṃ pana gijjhādīnaṃ āpāthampi etaṃ rūpaṃ nāgacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupatitvā anupatitvā"
      },
      "ti anubandhitvā anubandhitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitudentī"
      },
      "ti asidhārūpamehi tikhiṇehi lohatuṇḍakehi vijjhitvā vijjhitvā ito cito ca caranti gacchanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sā sudaṃ aṭṭassaraṃ karotī"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suda"
      },
      "nti nipāto, sā aṭṭhikasaṅkhalikā aṭṭassaraṃ āturassaraṃ karotīti attho. Akusalavipākānubhavanatthaṃ kira yojanappamāṇāpi tādisā attabhāvā nibbattanti, pasādussadā ca honti pakkagaṇḍasadisā. Tasmā sā aṭṭhikasaṅkhalikā balavavedanāturā tādisaṃ saddamakāsīti."
    ],
    "innerText": "Tattha aṭṭhikasaṅkhalikanti setaṃ nimmaṃsalohitaṃ aṭṭhisaṅghātaṃ. Gijjhāpi kākāpi kulalāpīti etepi yakkhagijjhā ceva yakkhakākā ca yakkhakulalā ca paccetabbā. Pākatikānaṃ pana gijjhādīnaṃ āpāthampi etaṃ rūpaṃ nāgacchati. Anupatitvā anupatitvāti anubandhitvā anubandhitvā. Vitudentīti asidhārūpamehi tikhiṇehi lohatuṇḍakehi vijjhitvā vijjhitvā ito cito ca caranti gacchanti. Sā sudaṃ aṭṭassaraṃ karotīti ettha sudanti nipāto, sā aṭṭhikasaṅkhalikā aṭṭassaraṃ āturassaraṃ karotīti attho. Akusalavipākānubhavanatthaṃ kira yojanappamāṇāpi tādisā attabhāvā nibbattanti, pasādussadā ca honti pakkagaṇḍasadisā. Tasmā sā aṭṭhikasaṅkhalikā balavavedanāturā tādisaṃ saddamakāsīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evañca pana vatvā puna āyasmā mahāmoggallāno ‘‘vaṭṭagāmisattā nāma evarūpā attabhāvā na muccantī’’ti sattesu kāruññaṃ paṭicca uppannaṃ dhammasaṃvegaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tassa mayhaṃ, āvuso, etadahosi acchariyaṃ vata bho"
      },
      "tiādimāha. Tato bhagavā therassa ānubhāvaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhubhūtā vata, bhikkhave"
      },
      ", ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāvakā viharantī"
      },
      "tiādimāha. Tattha cakkhu bhūtaṃ jātaṃ uppannaṃ etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhubhūtā,"
      },
      " bhūtacakkhukā uppannacakkhukā cakkhuṃ uppādetvā viharantīti attho. Dutiyapadepi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yatra hi nāmā"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yatrā"
      },
      "ti kāraṇavacanaṃ. Tatrāyaṃ atthayojanā – yasmā nāma sāvakopi evarūpaṃ ñassati vā dakkhati vā sakkhiṃ vā karissati, tasmā avocumha – ‘‘cakkhubhūtā vata, bhikkhave, sāvakā viharanti, ñāṇabhūtā vata, bhikkhave, sāvakā viharantī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbeva me so, bhikkhave, satto diṭṭho"
      },
      "ti bodhimaṇḍe sabbaññutaññāṇapaṭivedhena appamāṇesu cakkavāḷesu appamāṇe sattanikāye bhavagatiyoniṭhitinivāse ca paccakkhaṃ karontena mayā pubbeva so satto diṭṭhoti vadati."
    ],
    "innerText": "Evañca pana vatvā puna āyasmā mahāmoggallāno ‘‘vaṭṭagāmisattā nāma evarūpā attabhāvā na muccantī’’ti sattesu kāruññaṃ paṭicca uppannaṃ dhammasaṃvegaṃ dassento tassa mayhaṃ, āvuso, etadahosi acchariyaṃ vata bhotiādimāha. Tato bhagavā therassa ānubhāvaṃ pakāsento cakkhubhūtā vata, bhikkhave, sāvakā viharantītiādimāha. Tattha cakkhu bhūtaṃ jātaṃ uppannaṃ etesanti cakkhubhūtā, bhūtacakkhukā uppannacakkhukā cakkhuṃ uppādetvā viharantīti attho. Dutiyapadepi eseva nayo. Yatra hi nāmāti ettha yatrāti kāraṇavacanaṃ. Tatrāyaṃ atthayojanā – yasmā nāma sāvakopi evarūpaṃ ñassati vā dakkhati vā sakkhiṃ vā karissati, tasmā avocumha – ‘‘cakkhubhūtā vata, bhikkhave, sāvakā viharanti, ñāṇabhūtā vata, bhikkhave, sāvakā viharantī’’ti. Pubbeva me so, bhikkhave, satto diṭṭhoti bodhimaṇḍe sabbaññutaññāṇapaṭivedhena appamāṇesu cakkavāḷesu appamāṇe sattanikāye bhavagatiyoniṭhitinivāse ca paccakkhaṃ karontena mayā pubbeva so satto diṭṭhoti vadati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Goghātako"
      },
      "ti ",
      " gāvo vadhitvā aṭṭhito maṃsaṃ mocetvā vikkiṇitvā jīvikaṃ kappanakasatto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasseva kammassa vipākāvasesenā"
      },
      "ti tassa nānācetanāhi āyūhitassa aparāpariyakammassa. Tatra hi yāya cetanāya narake paṭisandhi janitā, tassā vipāke parikkhīṇe avasesakammaṃ vā kammanimittaṃ vā ārammaṇaṃ katvā puna petādīsu paṭisandhi nibbattati, tasmā sā paṭisandhi kammasabhāgatāya ārammaṇasabhāgatāya vā ‘‘tasseva kammassa vipākāvaseso’’ti vuccati. Ayañca satto evaṃ uppanno. Tenāha – ‘‘tasseva kammassa vipākāvasesenā’’ti. Tassa kira narakā cavanakāle nimmaṃsakatānaṃ gunnaṃ aṭṭhirāsiyeva nimittaṃ ahosi. So paṭicchannampi taṃ kammaṃ viññūnaṃ pākaṭaṃ viya karonto aṭṭhisaṅkhalikapeto jāto. Paṭhamaṃ."
    ],
    "innerText": "Goghātakoti gāvo vadhitvā aṭṭhito maṃsaṃ mocetvā vikkiṇitvā jīvikaṃ kappanakasatto. Tasseva kammassa vipākāvasesenāti tassa nānācetanāhi āyūhitassa aparāpariyakammassa. Tatra hi yāya cetanāya narake paṭisandhi janitā, tassā vipāke parikkhīṇe avasesakammaṃ vā kammanimittaṃ vā ārammaṇaṃ katvā puna petādīsu paṭisandhi nibbattati, tasmā sā paṭisandhi kammasabhāgatāya ārammaṇasabhāgatāya vā ‘‘tasseva kammassa vipākāvaseso’’ti vuccati. Ayañca satto evaṃ uppanno. Tenāha – ‘‘tasseva kammassa vipākāvasesenā’’ti. Tassa kira narakā cavanakāle nimmaṃsakatānaṃ gunnaṃ aṭṭhirāsiyeva nimittaṃ ahosi. So paṭicchannampi taṃ kammaṃ viññūnaṃ pākaṭaṃ viya karonto aṭṭhisaṅkhalikapeto jāto. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Pesisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "203"
      },
      ". Maṃsapesivatthusmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "goghātako"
      },
      "ti gomaṃsapesiyo katvā sukkhāpetvā vallūravikkayena anekāni vassāni jīvikaṃ kappesi, tenassa narakā cavanakāle maṃsapesiyeva nimittaṃ ahosi. So maṃsapesipeto jāto. Dutiyaṃ."
    ],
    "innerText": "203. Maṃsapesivatthusmiṃ goghātakoti gomaṃsapesiyo katvā sukkhāpetvā vallūravikkayena anekāni vassāni jīvikaṃ kappesi, tenassa narakā cavanakāle maṃsapesiyeva nimittaṃ ahosi. So maṃsapesipeto jāto. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Piṇḍasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "204"
      },
      ". Maṃsapiṇḍavatthusmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sākuṇiko"
      },
      "ti sakuṇe gahetvā vikkiṇanakāle nippakkhacamme maṃsapiṇḍamatte katvā vikkiṇanto jīvikaṃ kappesi, tenassa narakā cavanakāle maṃsapiṇḍova nimittaṃ ahosi. So maṃsapiṇḍapeto jāto. Tatiyaṃ."
    ],
    "innerText": "204. Maṃsapiṇḍavatthusmiṃ sākuṇikoti sakuṇe gahetvā vikkiṇanakāle nippakkhacamme maṃsapiṇḍamatte katvā vikkiṇanto jīvikaṃ kappesi, tenassa narakā cavanakāle maṃsapiṇḍova nimittaṃ ahosi. So maṃsapiṇḍapeto jāto. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Nicchavisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "205"
      },
      ". Nicchavivatthusmiṃ tassa orabbhikassa eḷake vadhitvā vadhitvā niccamme katvā kappitajīvikassa purimanayeneva niccammaṃ eḷakasarīraṃ nimittaṃ ahosi. So nicchavipeto jāto. Catutthaṃ."
    ],
    "innerText": "205. Nicchavivatthusmiṃ tassa orabbhikassa eḷake vadhitvā vadhitvā niccamme katvā kappitajīvikassa purimanayeneva niccammaṃ eḷakasarīraṃ nimittaṃ ahosi. So nicchavipeto jāto. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Asilomasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "206"
      },
      ". Asilomavatthusmiṃ ",
      " so sūkariko dīgharattaṃ nivāpapuṭṭhe sūkare asinā vadhitvā vadhitvā dīgharattaṃ jīvikaṃ kappesi, tassa ukkhittāsikabhāvova nimittaṃ ahosi. Tasmā asilomapeto jāto. Pañcamaṃ."
    ],
    "innerText": "206. Asilomavatthusmiṃ so sūkariko dīgharattaṃ nivāpapuṭṭhe sūkare asinā vadhitvā vadhitvā dīgharattaṃ jīvikaṃ kappesi, tassa ukkhittāsikabhāvova nimittaṃ ahosi. Tasmā asilomapeto jāto. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Sattisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "207"
      },
      ". Sattilomavatthusmiṃ so māgaviko ekaṃ migañca sattiñca gahetvā vanaṃ gantvā tassa migassa samīpaṃ āgatāgate mige sattiyā vijjhitvā māresi, tassa sattiyā vijjhanakabhāvoyeva nimittaṃ ahosi. Tasmā sattilomapeto jāto. Chaṭṭhaṃ."
    ],
    "innerText": "207. Sattilomavatthusmiṃ so māgaviko ekaṃ migañca sattiñca gahetvā vanaṃ gantvā tassa migassa samīpaṃ āgatāgate mige sattiyā vijjhitvā māresi, tassa sattiyā vijjhanakabhāvoyeva nimittaṃ ahosi. Tasmā sattilomapeto jāto. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Usulomasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "208"
      },
      ". Usulomavatthusmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāraṇiko"
      },
      "ti rājāparādhike anekāhi kāraṇāhi pīḷetvā avasāne kaṇḍena vijjhitvā māraṇakapuriso. So kira ‘‘amukasmiṃ padese viddho maratī’’ti ñatvāva vijjhati. Tassevaṃ jīvikaṃ kappetvā narake uppannassa tato pakkāvasesena idhūpapattikāle usunā vijjhanabhāvoyeva nimittaṃ ahosi. Tasmā usulomapeto jāto. Sattamaṃ."
    ],
    "innerText": "208. Usulomavatthusmiṃ kāraṇikoti rājāparādhike anekāhi kāraṇāhi pīḷetvā avasāne kaṇḍena vijjhitvā māraṇakapuriso. So kira ‘‘amukasmiṃ padese viddho maratī’’ti ñatvāva vijjhati. Tassevaṃ jīvikaṃ kappetvā narake uppannassa tato pakkāvasesena idhūpapattikāle usunā vijjhanabhāvoyeva nimittaṃ ahosi. Tasmā usulomapeto jāto. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Sūcilomasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "209"
      },
      ". Sūcilomavatthusmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sūto"
      },
      "ti assadamako. Godamakotipi vadantiyeva. Tassa patodasūciyā vijjhanabhāvoyeva nimittaṃ ahosi. Tasmā sūcilomapeto jāto. Aṭṭhamaṃ."
    ],
    "innerText": "209. Sūcilomavatthusmiṃ sūtoti assadamako. Godamakotipi vadantiyeva. Tassa patodasūciyā vijjhanabhāvoyeva nimittaṃ ahosi. Tasmā sūcilomapeto jāto. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Dutiyasūcilomasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "210"
      },
      ". Dutiye sūcilomavatthusmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sūcako"
      },
      "ti pesuññakārako. So kira manusse aññamaññañca bhindi, rājakule ca ‘‘imassa imaṃ nāma atthi, iminā idaṃ nāma kata’’nti sūcetvā ",
      " sūcetvā anayabyasanaṃ pāpesi. Tasmā yathā tena sūcetvā manussā bhinnā, tathā sūcīhi bhedanadukkhaṃ ",
      " paccanubhotuṃ kammameva nimittaṃ katvā sūcilomapeto jāto. Navamaṃ."
    ],
    "innerText": "210. Dutiye sūcilomavatthusmiṃ sūcakoti pesuññakārako. So kira manusse aññamaññañca bhindi, rājakule ca ‘‘imassa imaṃ nāma atthi, iminā idaṃ nāma kata’’nti sūcetvā sūcetvā anayabyasanaṃ pāpesi. Tasmā yathā tena sūcetvā manussā bhinnā, tathā sūcīhi bhedanadukkhaṃ paccanubhotuṃ kammameva nimittaṃ katvā sūcilomapeto jāto. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Kumbhaṇḍasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "211"
      },
      ". Aṇḍabhārivatthusmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gāmakūṭako"
      },
      "ti vinicchayāmacco. Tassa kammasabhāgatāya kumbhamattā mahāghaṭappamāṇā aṇḍā ahesuṃ. So hi yasmā raho paṭicchanne ṭhāne lañjaṃ gahetvā kūṭavinicchayena pākaṭaṃ dosaṃ karonto sāmike assāmike akāsi, tasmāssa rahassaṃ aṅgaṃ pākaṭaṃ nibbattaṃ. Yasmā daṇḍaṃ paṭṭhapento paresaṃ asayhaṃ bhāraṃ āropesi, tasmāssa rahassaṃ aṅgaṃ asayhabhāro hutvā nibbattaṃ. Yasmā yasmiṃ ṭhāne ṭhitena samena bhavitabbaṃ, tasmiṃ ṭhatvā visamo ahosi, tasmāssa rahassaṅge visamā nisajjāva ahosīti. Dasamaṃ."
    ],
    "innerText": "211. Aṇḍabhārivatthusmiṃ gāmakūṭakoti vinicchayāmacco. Tassa kammasabhāgatāya kumbhamattā mahāghaṭappamāṇā aṇḍā ahesuṃ. So hi yasmā raho paṭicchanne ṭhāne lañjaṃ gahetvā kūṭavinicchayena pākaṭaṃ dosaṃ karonto sāmike assāmike akāsi, tasmāssa rahassaṃ aṅgaṃ pākaṭaṃ nibbattaṃ. Yasmā daṇḍaṃ paṭṭhapento paresaṃ asayhaṃ bhāraṃ āropesi, tasmāssa rahassaṃ aṅgaṃ asayhabhāro hutvā nibbattaṃ. Yasmā yasmiṃ ṭhāne ṭhitena samena bhavitabbaṃ, tasmiṃ ṭhatvā visamo ahosi, tasmāssa rahassaṅge visamā nisajjāva ahosīti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamo vaggo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Dutiyavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Sasīsakasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "212"
      },
      ". Pāradārikavatthusmiṃ so satto parassa rakkhitagopitaṃ sassāmikaṃ phassaṃ phusanto mīḷhasukhena kāmasukhena cittaṃ ramayitvā kammasabhāgatāya gūthaphassaṃ phusanto dukkhamanubhavituṃ tattha nibbatto. Paṭhamaṃ."
    ],
    "innerText": "212. Pāradārikavatthusmiṃ so satto parassa rakkhitagopitaṃ sassāmikaṃ phassaṃ phusanto mīḷhasukhena kāmasukhena cittaṃ ramayitvā kammasabhāgatāya gūthaphassaṃ phusanto dukkhamanubhavituṃ tattha nibbatto. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Gūthakhādasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "213"
      },
      ". Duṭṭhabrāhmaṇavatthu ",
      " pākaṭameva. Dutiyaṃ."
    ],
    "innerText": "213. Duṭṭhabrāhmaṇavatthu pākaṭameva. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Nicchavitthisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "214"
      },
      ". Nicchavitthivatthusmiṃ ",
      " yasmā mātugāmo nāma attano phasse anissaro, sā ca taṃ sāmikassa santakaṃ phassaṃ thenetvā paresaṃ abhiratiṃ uppādesi, tasmā kammasabhāgatāya sukhasamphassā vaṭṭitvā dukkhasamphassaṃ anubhavituṃ nicchavitthī hutvā uppannā. Tatiyaṃ."
    ],
    "innerText": "214. Nicchavitthivatthusmiṃ yasmā mātugāmo nāma attano phasse anissaro, sā ca taṃ sāmikassa santakaṃ phassaṃ thenetvā paresaṃ abhiratiṃ uppādesi, tasmā kammasabhāgatāya sukhasamphassā vaṭṭitvā dukkhasamphassaṃ anubhavituṃ nicchavitthī hutvā uppannā. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Maṅgulitthisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "215"
      },
      ". Maṅgulitthivatthusmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "maṅguli"
      },
      "nti virūpaṃ duddasikaṃ bībhacchaṃ. Sā kira yakkhadāsikammaṃ karontī ‘‘iminā ca iminā ca evaṃ balikamme kate ayaṃ nāma tumhākaṃ vaḍḍhi bhavissatī’’ti mahājanassa gandhapupphādīni vañcanāya gahetvā mahājanaṃ duddiṭṭhiṃ micchādiṭṭhiṃ gaṇhāpesi, tasmā tāya kammasabhāgatāya gandhapupphādīnaṃ thenitattā duggandhā, duddassanassa gāhitattā duddasikā virūpā bībhacchā hutvā nibbattā. Catutthaṃ."
    ],
    "innerText": "215. Maṅgulitthivatthusmiṃ maṅgulinti virūpaṃ duddasikaṃ bībhacchaṃ. Sā kira yakkhadāsikammaṃ karontī ‘‘iminā ca iminā ca evaṃ balikamme kate ayaṃ nāma tumhākaṃ vaḍḍhi bhavissatī’’ti mahājanassa gandhapupphādīni vañcanāya gahetvā mahājanaṃ duddiṭṭhiṃ micchādiṭṭhiṃ gaṇhāpesi, tasmā tāya kammasabhāgatāya gandhapupphādīnaṃ thenitattā duggandhā, duddassanassa gāhitattā duddasikā virūpā bībhacchā hutvā nibbattā. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Okilinīsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "216"
      },
      ". Okilinīvatthusmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uppakkaṃ okiliniṃ okirini"
      },
      "nti sā kira aṅgāracitake nipannā vipphandamānā viparivattamānā paccati, tasmā uppakkā ceva hoti uṇhena agginā pakkasarīrā, okilinī ca kilinnasarīrā, bindūnissā sarīrato paggharanti, okirinī ca aṅgārasamparikiṇṇā. Tassā hi heṭṭhatopi kiṃsukapupphavaṇṇā aṅgārā, ubhayapassesupi, ākāsatopissā upari patanti. Tena vuttaṃ – ‘‘uppakkaṃ okiliniṃ ",
      " okirini’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sā issāpakatā sapattiṃ aṅgārakaṭāhena okirī"
      },
      "ti tassa kira rañño ekā nāṭakinī aṅgārakaṭāhaṃ samīpe ṭhapetvā gattato udakaṃ puñchati, pāṇinā ca sedaṃ karoti. Rājāpi tāya saddhiṃ kathañca karoti, parituṭṭhākārañca dasseti. Aggamahesī taṃ asahamānā issāpakatā hutvā acirapakkantassa rañño taṃ aṅgārakaṭāhaṃ gahetvā tassā upari aṅgāre okiri. Sā taṃ kammaṃ katvā tādisaṃyeva vipākaṃ paccanubhavituṃ petaloke nibbattā. Pañcamaṃ."
    ],
    "innerText": "216. Okilinīvatthusmiṃ uppakkaṃ okiliniṃ okirininti sā kira aṅgāracitake nipannā vipphandamānā viparivattamānā paccati, tasmā uppakkā ceva hoti uṇhena agginā pakkasarīrā, okilinī ca kilinnasarīrā, bindūnissā sarīrato paggharanti, okirinī ca aṅgārasamparikiṇṇā. Tassā hi heṭṭhatopi kiṃsukapupphavaṇṇā aṅgārā, ubhayapassesupi, ākāsatopissā upari patanti. Tena vuttaṃ – ‘‘uppakkaṃ okiliniṃ okirini’’nti. Sā issāpakatā sapattiṃ aṅgārakaṭāhena okirīti tassa kira rañño ekā nāṭakinī aṅgārakaṭāhaṃ samīpe ṭhapetvā gattato udakaṃ puñchati, pāṇinā ca sedaṃ karoti. Rājāpi tāya saddhiṃ kathañca karoti, parituṭṭhākārañca dasseti. Aggamahesī taṃ asahamānā issāpakatā hutvā acirapakkantassa rañño taṃ aṅgārakaṭāhaṃ gahetvā tassā upari aṅgāre okiri. Sā taṃ kammaṃ katvā tādisaṃyeva vipākaṃ paccanubhavituṃ petaloke nibbattā. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Asīsakasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "217"
      },
      ". Coraghātavatthusmiṃ ",
      " so rañño āṇāya dīgharattaṃ corānaṃ sīsāni chinditvā petaloke nibbattanto asīsakaṃ kabandhaṃ hutvā nibbatti. Chaṭṭhaṃ."
    ],
    "innerText": "217. Coraghātavatthusmiṃ so rañño āṇāya dīgharattaṃ corānaṃ sīsāni chinditvā petaloke nibbattanto asīsakaṃ kabandhaṃ hutvā nibbatti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7-11. Pāpabhikkhusuttādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "218-222"
      },
      ". Bhikkhuvatthusmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāpabhikkhū"
      },
      "ti lāmakabhikkhu. So kira lokassa saddhādeyye cattāro paccaye paribhuñjitvā kāyavacīdvārehi asaṃyato bhinnājīvo cittakeḷiṃ kīḷanto vicari. Tato ekaṃ buddhantaraṃ niraye paccitvā petaloke nibbattanto bhikkhusadiseneva attabhāvena nibbatti. Bhikkhunīsikkhamānāsāmaṇerasāmaṇerīvatthūsupi ayameva vinicchayo. Sattamādīni."
    ],
    "innerText": "218-222. Bhikkhuvatthusmiṃ pāpabhikkhūti lāmakabhikkhu. So kira lokassa saddhādeyye cattāro paccaye paribhuñjitvā kāyavacīdvārehi asaṃyato bhinnājīvo cittakeḷiṃ kīḷanto vicari. Tato ekaṃ buddhantaraṃ niraye paccitvā petaloke nibbattanto bhikkhusadiseneva attabhāvena nibbatti. Bhikkhunīsikkhamānāsāmaṇerasāmaṇerīvatthūsupi ayameva vinicchayo. Sattamādīni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Lakkhaṇasaṃyuttavaṇṇanā niṭṭhitā."
  }
]