[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "4. Upālivaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Upālisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ". Atha ",
      " kho āyasmā upāli yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upāli bhagavantaṃ etadavoca – ‘‘kati nu kho, bhante, atthavase paṭicca tathāgatena sāvakānaṃ sikkhāpadaṃ paññattaṃ, pātimokkhaṃ uddiṭṭha’’nti?"
    ],
    "innerText": "31. Atha kho āyasmā upāli yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upāli bhagavantaṃ etadavoca – ‘‘kati nu kho, bhante, atthavase paṭicca tathāgatena sāvakānaṃ sikkhāpadaṃ paññattaṃ, pātimokkhaṃ uddiṭṭha’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dasa kho, upāli, atthavase paṭicca tathāgatena sāvakānaṃ sikkhāpadaṃ paññattaṃ, pātimokkhaṃ uddiṭṭhaṃ. Katame dasa? Saṅghasuṭṭhutāya, saṅghaphāsutāya, dummaṅkūnaṃ puggalānaṃ niggahāya, pesalānaṃ bhikkhūnaṃ phāsuvihārāya, diṭṭhadhammikānaṃ āsavānaṃ saṃvarāya, samparāyikānaṃ āsavānaṃ paṭighātāya, appasannānaṃ pasādāya, pasannānaṃ bhiyyobhāvāya, saddhammaṭṭhitiyā, vinayānuggahāya – ime kho, upāli, dasa atthavase paṭicca tathāgatena sāvakānaṃ sikkhāpadaṃ paññattaṃ, pātimokkhaṃ uddiṭṭha’’nti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Pātimokkhaṭṭhapanāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "32"
      },
      ". ‘‘Kati ",
      " nu kho, bhante, pātimokkhaṭṭhapanā’’ti? ‘‘Dasa kho, upāli, pātimokkhaṭṭhapanā. Katame dasa? Pārājiko tassaṃ parisāyaṃ nisinno hoti ",
      ", pārājikakathā vippakatā hoti, anupasampanno tassaṃ parisāyaṃ nisinno ",
      " hoti, anupasampannakathā vippakatā hoti, sikkhaṃ paccakkhātako tassaṃ parisāyaṃ nisinno hoti, sikkhaṃ paccakkhātakakathā vippakatā hoti, paṇḍako tassaṃ parisāyaṃ nisinno hoti, paṇḍakakathā vippakatā hoti, bhikkhunidūsako tassaṃ parisāyaṃ nisinno hoti, bhikkhunidūsakakathā vippakatā hoti – ime kho, upāli, dasa pātimokkhaṭṭhapanā’’ti. Dutiyaṃ."
    ],
    "innerText": "32. ‘‘Kati nu kho, bhante, pātimokkhaṭṭhapanā’’ti? ‘‘Dasa kho, upāli, pātimokkhaṭṭhapanā. Katame dasa? Pārājiko tassaṃ parisāyaṃ nisinno hoti , pārājikakathā vippakatā hoti, anupasampanno tassaṃ parisāyaṃ nisinno hoti, anupasampannakathā vippakatā hoti, sikkhaṃ paccakkhātako tassaṃ parisāyaṃ nisinno hoti, sikkhaṃ paccakkhātakakathā vippakatā hoti, paṇḍako tassaṃ parisāyaṃ nisinno hoti, paṇḍakakathā vippakatā hoti, bhikkhunidūsako tassaṃ parisāyaṃ nisinno hoti, bhikkhunidūsakakathā vippakatā hoti – ime kho, upāli, dasa pātimokkhaṭṭhapanā’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Ubbāhikāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "33"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cūḷava. 231]"
      },
      " ‘‘Katihi ",
      " nu kho, bhante, dhammehi samannāgato bhikkhu ubbāhikāya sammannitabbo’’ti? ‘‘Dasahi kho, upāli, dhammehi samannāgato bhikkhu ubbāhikāya sammannitabbo. Katamehi dasahi? Idhupāli, bhikkhu sīlavā hoti; pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[satthā sabyañjanā (sī.) evamuparipi]"
      },
      " kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā; ubhayāni kho panassa pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso; vinaye kho pana ṭhito hoti asaṃhīro; paṭibalo hoti ubho atthapaccatthike saññāpetuṃ paññāpetuṃ nijjhāpetuṃ pekkhetuṃ pasādetuṃ; adhikaraṇasamuppādavūpasamakusalo ",
      " hoti – adhikaraṇaṃ jānāti; adhikaraṇasamudayaṃ jānāti; adhikaraṇanirodhaṃ ",
      " jānāti; adhikaraṇanirodhagāminiṃ paṭipadaṃ jānāti. Imehi kho, upāli, dasahi dhammehi samannāgato bhikkhu ubbāhikāya sammannitabbo’’ti. Tatiyaṃ."
    ],
    "innerText": "33.[cūḷava. 231] ‘‘Katihi nu kho, bhante, dhammehi samannāgato bhikkhu ubbāhikāya sammannitabbo’’ti? ‘‘Dasahi kho, upāli, dhammehi samannāgato bhikkhu ubbāhikāya sammannitabbo. Katamehi dasahi? Idhupāli, bhikkhu sīlavā hoti; pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ [satthā sabyañjanā (sī.) evamuparipi] kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā; ubhayāni kho panassa pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso; vinaye kho pana ṭhito hoti asaṃhīro; paṭibalo hoti ubho atthapaccatthike saññāpetuṃ paññāpetuṃ nijjhāpetuṃ pekkhetuṃ pasādetuṃ; adhikaraṇasamuppādavūpasamakusalo hoti – adhikaraṇaṃ jānāti; adhikaraṇasamudayaṃ jānāti; adhikaraṇanirodhaṃ jānāti; adhikaraṇanirodhagāminiṃ paṭipadaṃ jānāti. Imehi kho, upāli, dasahi dhammehi samannāgato bhikkhu ubbāhikāya sammannitabbo’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Upasampadāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "34"
      },
      ". ‘‘Katihi ",
      " nu kho, bhante, dhammehi samannāgatena bhikkhunā upasampādetabba’’nti? ‘‘Dasahi kho, upāli, dhammehi samannāgatena bhikkhunā upasampādetabbaṃ. Katamehi dasahi? Idhupāli, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā; pātimokkhaṃ kho panassa vitthārena svāgataṃ hoti suvibhattaṃ suppavattaṃ suvinicchitaṃ suttaso anubyañjanaso; paṭibalo hoti gilānaṃ upaṭṭhātuṃ vā upaṭṭhāpetuṃ vā; paṭibalo hoti anabhiratiṃ vūpakāsetuṃ vā ",
      " vūpakāsāpetuṃ vā; paṭibalo hoti uppannaṃ kukkuccaṃ dhammato vinodetuṃ; paṭibalo hoti uppannaṃ diṭṭhigataṃ dhammato vivecetuṃ; paṭibalo hoti adhisīle samādapetuṃ; paṭibalo hoti adhicitte samādapetuṃ; paṭibalo hoti adhipaññāya samādapetuṃ. Imehi kho, upāli, dasahi dhammehi samannāgatena bhikkhunā upasampādetabba’’nti. Catutthaṃ."
    ],
    "innerText": "34. ‘‘Katihi nu kho, bhante, dhammehi samannāgatena bhikkhunā upasampādetabba’’nti? ‘‘Dasahi kho, upāli, dhammehi samannāgatena bhikkhunā upasampādetabbaṃ. Katamehi dasahi? Idhupāli, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā; pātimokkhaṃ kho panassa vitthārena svāgataṃ hoti suvibhattaṃ suppavattaṃ suvinicchitaṃ suttaso anubyañjanaso; paṭibalo hoti gilānaṃ upaṭṭhātuṃ vā upaṭṭhāpetuṃ vā; paṭibalo hoti anabhiratiṃ vūpakāsetuṃ vā vūpakāsāpetuṃ vā; paṭibalo hoti uppannaṃ kukkuccaṃ dhammato vinodetuṃ; paṭibalo hoti uppannaṃ diṭṭhigataṃ dhammato vivecetuṃ; paṭibalo hoti adhisīle samādapetuṃ; paṭibalo hoti adhicitte samādapetuṃ; paṭibalo hoti adhipaññāya samādapetuṃ. Imehi kho, upāli, dasahi dhammehi samannāgatena bhikkhunā upasampādetabba’’nti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Nissayasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ". ‘‘Katihi ",
      " nu kho, bhante, dhammehi samannāgatena bhikkhunā nissayo ",
      " dātabbo’’ti? ‘‘Dasahi kho, upāli, dhammehi samannāgatena bhikkhunā nissayo dātabbo. Katamehi dasahi? Idhupāli, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; pātimokkhaṃ kho panassa vitthārena svāgataṃ hoti suvibhattaṃ suppavattaṃ suvinicchitaṃ suttaso anubyañjanaso; paṭibalo hoti gilānaṃ upaṭṭhātuṃ vā upaṭṭhāpetuṃ vā; paṭibalo hoti anabhiratiṃ vūpakāsetuṃ vā vūpakāsāpetuṃ vā; paṭibalo hoti uppannaṃ kukkuccaṃ dhammato vinodetuṃ; paṭibalo hoti uppannaṃ diṭṭhigataṃ dhammato vivecetuṃ; paṭibalo hoti adhisīle…pe… adhicitte… adhipaññāya samādapetuṃ. Imehi kho, upāli, dasahi dhammehi samannāgatena bhikkhunā nissayo dātabbo’’ti. Pañcamaṃ."
    ],
    "innerText": "35. ‘‘Katihi nu kho, bhante, dhammehi samannāgatena bhikkhunā nissayo dātabbo’’ti? ‘‘Dasahi kho, upāli, dhammehi samannāgatena bhikkhunā nissayo dātabbo. Katamehi dasahi? Idhupāli, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; pātimokkhaṃ kho panassa vitthārena svāgataṃ hoti suvibhattaṃ suppavattaṃ suvinicchitaṃ suttaso anubyañjanaso; paṭibalo hoti gilānaṃ upaṭṭhātuṃ vā upaṭṭhāpetuṃ vā; paṭibalo hoti anabhiratiṃ vūpakāsetuṃ vā vūpakāsāpetuṃ vā; paṭibalo hoti uppannaṃ kukkuccaṃ dhammato vinodetuṃ; paṭibalo hoti uppannaṃ diṭṭhigataṃ dhammato vivecetuṃ; paṭibalo hoti adhisīle…pe… adhicitte… adhipaññāya samādapetuṃ. Imehi kho, upāli, dasahi dhammehi samannāgatena bhikkhunā nissayo dātabbo’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Sāmaṇerasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ". ‘‘Katihi ",
      " nu kho, bhante, dhammehi samannāgatena bhikkhunā sāmaṇero upaṭṭhāpetabbo’’ti? ‘‘Dasahi kho, upāli, dhammehi samannāgatena bhikkhunā sāmaṇero upaṭṭhāpetabbo. Katamehi dasahi? Idhupāli, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; pātimokkhaṃ kho panassa vitthārena svāgataṃ hoti suvibhattaṃ suppavattaṃ suvinicchitaṃ suttaso anubyañjanaso; paṭibalo hoti gilānaṃ upaṭṭhātuṃ vā upaṭṭhāpetuṃ vā; paṭibalo hoti anabhiratiṃ vūpakāsetuṃ vā vūpakāsāpetuṃ vā; paṭibalo hoti uppannaṃ kukkuccaṃ dhammato vinodetuṃ; paṭibalo hoti uppannaṃ diṭṭhigataṃ dhammato vivecetuṃ; paṭibalo hoti adhisīle samādapetuṃ; paṭibalo hoti adhicitte ",
      " samādapetuṃ; paṭibalo hoti adhipaññāya samādapetuṃ. Imehi kho, upāli, dasahi dhammehi samannāgatena bhikkhunā sāmaṇero upaṭṭhāpetabbo’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "36. ‘‘Katihi nu kho, bhante, dhammehi samannāgatena bhikkhunā sāmaṇero upaṭṭhāpetabbo’’ti? ‘‘Dasahi kho, upāli, dhammehi samannāgatena bhikkhunā sāmaṇero upaṭṭhāpetabbo. Katamehi dasahi? Idhupāli, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; pātimokkhaṃ kho panassa vitthārena svāgataṃ hoti suvibhattaṃ suppavattaṃ suvinicchitaṃ suttaso anubyañjanaso; paṭibalo hoti gilānaṃ upaṭṭhātuṃ vā upaṭṭhāpetuṃ vā; paṭibalo hoti anabhiratiṃ vūpakāsetuṃ vā vūpakāsāpetuṃ vā; paṭibalo hoti uppannaṃ kukkuccaṃ dhammato vinodetuṃ; paṭibalo hoti uppannaṃ diṭṭhigataṃ dhammato vivecetuṃ; paṭibalo hoti adhisīle samādapetuṃ; paṭibalo hoti adhicitte samādapetuṃ; paṭibalo hoti adhipaññāya samādapetuṃ. Imehi kho, upāli, dasahi dhammehi samannāgatena bhikkhunā sāmaṇero upaṭṭhāpetabbo’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Saṅghabhedasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ". ‘‘‘Saṅghabhedo saṅghabhedo’ti, bhante, vuccati. Kittāvatā nu kho, bhante, saṅgho bhinno hotī’’ti? ‘‘Idhupāli, bhikkhū adhammaṃ dhammoti dīpenti, dhammaṃ adhammoti dīpenti, avinayaṃ vinayoti ",
      " dīpenti, vinayaṃ avinayoti dīpenti, abhāsitaṃ alapitaṃ tathāgatena bhāsitaṃ lapitaṃ tathāgatenāti dīpenti, bhāsitaṃ lapitaṃ tathāgatena abhāsitaṃ alapitaṃ tathāgatenāti dīpenti, anāciṇṇaṃ tathāgatena āciṇṇaṃ tathāgatenāti dīpenti, āciṇṇaṃ tathāgatena anāciṇṇaṃ tathāgatenāti dīpenti, apaññattaṃ tathāgatena paññattaṃ tathāgatenāti dīpenti ",
      ", paññattaṃ tathāgatena apaññattaṃ tathāgatenāti dīpenti. Te imehi dasahi vatthūhi avakassanti apakassanti āveni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āveniṃ (cūḷava. 352) āveṇi, āveṇikaṃ (tattheva adholipi)]"
      },
      " kammāni karonti āveni pātimokkhaṃ uddisanti. Ettāvatā kho, upāli, saṅgho bhinno hotī’’ti. Sattamaṃ."
    ],
    "innerText": "37. ‘‘‘Saṅghabhedo saṅghabhedo’ti, bhante, vuccati. Kittāvatā nu kho, bhante, saṅgho bhinno hotī’’ti? ‘‘Idhupāli, bhikkhū adhammaṃ dhammoti dīpenti, dhammaṃ adhammoti dīpenti, avinayaṃ vinayoti dīpenti, vinayaṃ avinayoti dīpenti, abhāsitaṃ alapitaṃ tathāgatena bhāsitaṃ lapitaṃ tathāgatenāti dīpenti, bhāsitaṃ lapitaṃ tathāgatena abhāsitaṃ alapitaṃ tathāgatenāti dīpenti, anāciṇṇaṃ tathāgatena āciṇṇaṃ tathāgatenāti dīpenti, āciṇṇaṃ tathāgatena anāciṇṇaṃ tathāgatenāti dīpenti, apaññattaṃ tathāgatena paññattaṃ tathāgatenāti dīpenti , paññattaṃ tathāgatena apaññattaṃ tathāgatenāti dīpenti. Te imehi dasahi vatthūhi avakassanti apakassanti āveni [āveniṃ (cūḷava. 352) āveṇi, āveṇikaṃ (tattheva adholipi)] kammāni karonti āveni pātimokkhaṃ uddisanti. Ettāvatā kho, upāli, saṅgho bhinno hotī’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Saṅghasāmaggīsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "38"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cūḷava. 353]"
      },
      " ‘‘‘Saṅghasāmaggī ",
      " saṅghasāmaggī’ti, bhante, vuccati. Kittāvatā nu kho, bhante, saṅgho samaggo hotī’’ti? ‘‘Idhupāli, bhikkhū adhammaṃ adhammoti dīpenti, dhammaṃ dhammoti dīpenti, avinayaṃ avinayoti dīpenti, vinayaṃ vinayoti dīpenti, abhāsitaṃ alapitaṃ tathāgatena abhāsitaṃ alapitaṃ tathāgatenāti dīpenti, bhāsitaṃ lapitaṃ tathāgatena bhāsitaṃ lapitaṃ tathāgatenāti dīpenti, anāciṇṇaṃ tathāgatena anāciṇṇaṃ tathāgatenāti dīpenti, āciṇṇaṃ tathāgatena āciṇṇaṃ tathāgatenāti dīpenti, apaññattaṃ tathāgatena apaññattaṃ tathāgatenāti dīpenti, paññattaṃ tathāgatena paññattaṃ tathāgatenāti dīpenti. Te imehi dasahi vatthūhi na avakassanti na apakassanti na āveni kammāni karonti na āveni pātimokkhaṃ uddisanti. Ettāvatā kho, upāli, saṅgho samaggo hotī’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "38.[cūḷava. 353] ‘‘‘Saṅghasāmaggī saṅghasāmaggī’ti, bhante, vuccati. Kittāvatā nu kho, bhante, saṅgho samaggo hotī’’ti? ‘‘Idhupāli, bhikkhū adhammaṃ adhammoti dīpenti, dhammaṃ dhammoti dīpenti, avinayaṃ avinayoti dīpenti, vinayaṃ vinayoti dīpenti, abhāsitaṃ alapitaṃ tathāgatena abhāsitaṃ alapitaṃ tathāgatenāti dīpenti, bhāsitaṃ lapitaṃ tathāgatena bhāsitaṃ lapitaṃ tathāgatenāti dīpenti, anāciṇṇaṃ tathāgatena anāciṇṇaṃ tathāgatenāti dīpenti, āciṇṇaṃ tathāgatena āciṇṇaṃ tathāgatenāti dīpenti, apaññattaṃ tathāgatena apaññattaṃ tathāgatenāti dīpenti, paññattaṃ tathāgatena paññattaṃ tathāgatenāti dīpenti. Te imehi dasahi vatthūhi na avakassanti na apakassanti na āveni kammāni karonti na āveni pātimokkhaṃ uddisanti. Ettāvatā kho, upāli, saṅgho samaggo hotī’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Paṭhamaānandasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "39"
      },
      ". Atha ",
      " kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘‘saṅghabhedo saṅghabhedo’ti, bhante, vuccati. Kittāvatā nu kho, bhante, saṅgho bhinno hotī’’ti ",
      "? ‘‘Idhānanda, bhikkhū adhammaṃ dhammoti dīpenti, dhammaṃ adhammoti dīpenti, avinayaṃ vinayoti dīpenti…pe… paññattaṃ tathāgatena apaññattaṃ tathāgatenāti dīpenti. Te imehi dasahi vatthūhi avakassanti apakassanti āveni kammāni karonti āveni pātimokkhaṃ uddisanti. Ettāvatā kho, ānanda, saṅgho bhinno hotī’’ti."
    ],
    "innerText": "39. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘‘saṅghabhedo saṅghabhedo’ti, bhante, vuccati. Kittāvatā nu kho, bhante, saṅgho bhinno hotī’’ti ? ‘‘Idhānanda, bhikkhū adhammaṃ dhammoti dīpenti, dhammaṃ adhammoti dīpenti, avinayaṃ vinayoti dīpenti…pe… paññattaṃ tathāgatena apaññattaṃ tathāgatenāti dīpenti. Te imehi dasahi vatthūhi avakassanti apakassanti āveni kammāni karonti āveni pātimokkhaṃ uddisanti. Ettāvatā kho, ānanda, saṅgho bhinno hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samaggaṃ pana, bhante, saṅghaṃ bhinditvā kiṃ so pasavatī’’ti? ‘‘Kappaṭṭhikaṃ, ānanda, kibbisaṃ pasavatī’’ti. ‘‘Kiṃ pana, bhante, kappaṭṭhikaṃ kibbisa’’nti? ‘‘Kappaṃ, ānanda, nirayamhi paccatīti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Āpāyiko ",
      " nerayiko, kappaṭṭho saṅghabhedako;"
    ],
    "innerText": "‘‘Āpāyiko nerayiko, kappaṭṭho saṅghabhedako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Vaggarato adhammaṭṭho, yogakkhemā padhaṃsati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Saṅghaṃ samaggaṃ bhinditvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhetvāna (sī. syā.), bhitvāna (ka.) cūḷava. 354; itivu. 18; kathāva. 657]"
      },
      " kappaṃ nirayamhi paccatī’’ti. navamaṃ;"
    ],
    "innerText": "Saṅghaṃ samaggaṃ bhinditvā [bhetvāna (sī. syā.), bhitvāna (ka.) cūḷava. 354; itivu. 18; kathāva. 657] kappaṃ nirayamhi paccatī’’ti. navamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Dutiyaānandasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ". ‘‘‘Saṅghasāmaggī ",
      " saṅghasāmaggī’ti, bhante, vuccati. Kittāvatā nu kho, bhante, saṅgho samaggo hotī’’ti? ‘‘Idhānanda, bhikkhū adhammaṃ adhammoti dīpenti, dhammaṃ dhammoti dīpenti, avinayaṃ avinayoti dīpenti ",
      ", vinayaṃ vinayoti dīpenti, abhāsitaṃ alapitaṃ tathāgatena abhāsitaṃ alapitaṃ tathāgatenāti dīpenti, bhāsitaṃ lapitaṃ tathāgatena bhāsitaṃ lapitaṃ tathāgatenāti dīpenti, anāciṇṇaṃ tathāgatena anāciṇṇaṃ tathāgatenāti dīpenti, āciṇṇaṃ tathāgatena āciṇṇaṃ tathāgatenāti dīpenti, apaññattaṃ tathāgatena apaññattaṃ tathāgatenāti dīpenti, paññattaṃ tathāgatena paññattaṃ tathāgatenāti dīpenti. Te imehi dasahi vatthūhi ",
      " na avakassanti na apakassanti na āveni kammāni karonti na āveni pātimokkhaṃ uddisanti. Ettāvatā kho, ānanda, saṅgho samaggo hotī’’ti."
    ],
    "innerText": "40. ‘‘‘Saṅghasāmaggī saṅghasāmaggī’ti, bhante, vuccati. Kittāvatā nu kho, bhante, saṅgho samaggo hotī’’ti? ‘‘Idhānanda, bhikkhū adhammaṃ adhammoti dīpenti, dhammaṃ dhammoti dīpenti, avinayaṃ avinayoti dīpenti , vinayaṃ vinayoti dīpenti, abhāsitaṃ alapitaṃ tathāgatena abhāsitaṃ alapitaṃ tathāgatenāti dīpenti, bhāsitaṃ lapitaṃ tathāgatena bhāsitaṃ lapitaṃ tathāgatenāti dīpenti, anāciṇṇaṃ tathāgatena anāciṇṇaṃ tathāgatenāti dīpenti, āciṇṇaṃ tathāgatena āciṇṇaṃ tathāgatenāti dīpenti, apaññattaṃ tathāgatena apaññattaṃ tathāgatenāti dīpenti, paññattaṃ tathāgatena paññattaṃ tathāgatenāti dīpenti. Te imehi dasahi vatthūhi na avakassanti na apakassanti na āveni kammāni karonti na āveni pātimokkhaṃ uddisanti. Ettāvatā kho, ānanda, saṅgho samaggo hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Bhinnaṃ pana, bhante, saṅghaṃ samaggaṃ katvā kiṃ so pasavatī’’ti? ‘‘Brahmaṃ, ānanda, puññaṃ pasavatī’’ti. ‘‘Kiṃ pana, bhante, brahmaṃ puñña’’nti? ‘‘Kappaṃ, ānanda, saggamhi modatīti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Sukhā ",
      " saṅghassa sāmaggī, samaggānañca anuggaho;"
    ],
    "innerText": "‘‘Sukhā saṅghassa sāmaggī, samaggānañca anuggaho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Samaggarato dhammaṭṭho, yogakkhemā na dhaṃsati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saṅghaṃ samaggaṃ katvāna, kappaṃ saggamhi modatī’’ti. dasamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Upālivaggo catuttho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Upāli ṭhapanā ubbāho, upasampadanissayā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sāmaṇero ca dve bhedā, ānandehi pare duveti."
  }
]