[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Sīhanādavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Sīhanādasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘vuttho ",
      " me, bhante, sāvatthiyaṃ vassāvāso. Icchāmahaṃ, bhante, janapadacārikaṃ pakkamitu’’nti. ‘‘Yassadāni tvaṃ, sāriputta, kālaṃ maññasī’’ti. Atha kho āyasmā sāriputto uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha ",
      " kho aññataro bhikkhu acirapakkante āyasmante sāriputte bhagavantaṃ etadavoca – ‘‘āyasmā maṃ, bhante, sāriputto āsajja appaṭinissajja cārikaṃ pakkanto’’ti. Atha kho bhagavā aññataraṃ bhikkhuṃ āmantesi – ‘‘ehi ",
      " tvaṃ, bhikkhu, mama vacanena sāriputtaṃ āmantehi – ‘satthā taṃ, āvuso sāriputta, āmantetī’’’ti. ‘‘Evaṃ, bhante’’ti kho so bhikkhu bhagavato paṭissutvā yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmantaṃ sāriputtaṃ etadavoca – ‘‘satthā taṃ, āvuso sāriputta, āmantetī’’ti. ‘‘Evamāvuso’’ti kho āyasmā sāriputto tassa bhikkhuno paccassosi."
    ],
    "innerText": "11. Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘vuttho me, bhante, sāvatthiyaṃ vassāvāso. Icchāmahaṃ, bhante, janapadacārikaṃ pakkamitu’’nti. ‘‘Yassadāni tvaṃ, sāriputta, kālaṃ maññasī’’ti. Atha kho āyasmā sāriputto uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho aññataro bhikkhu acirapakkante āyasmante sāriputte bhagavantaṃ etadavoca – ‘‘āyasmā maṃ, bhante, sāriputto āsajja appaṭinissajja cārikaṃ pakkanto’’ti. Atha kho bhagavā aññataraṃ bhikkhuṃ āmantesi – ‘‘ehi tvaṃ, bhikkhu, mama vacanena sāriputtaṃ āmantehi – ‘satthā taṃ, āvuso sāriputta, āmantetī’’’ti. ‘‘Evaṃ, bhante’’ti kho so bhikkhu bhagavato paṭissutvā yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmantaṃ sāriputtaṃ etadavoca – ‘‘satthā taṃ, āvuso sāriputta, āmantetī’’ti. ‘‘Evamāvuso’’ti kho āyasmā sāriputto tassa bhikkhuno paccassosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena āyasmā ca mahāmoggallāno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahāmoggalāno (ka.)]"
      },
      " āyasmā ca ānando avāpuraṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[apāpuraṇaṃ (syā. ka.)]"
      },
      " ādāya vihāre āhiṇḍanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vihārena vihāraṃ anvāhiṇḍanti (sī. pī.), vihāraṃ āhiṇḍanti (syā.)]"
      },
      " – ‘‘abhikkamathāyasmanto, abhikkamathāyasmanto! Idānāyasmā sāriputto bhagavato sammukhā sīhanādaṃ nadissatī’’ti. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ sāriputtaṃ bhagavā etadavoca – ‘‘idha te, sāriputta, aññataro sabrahmacārī khīyanadhammaṃ āpanno – ‘āyasmā maṃ, bhante, sāriputto āsajja ",
      " appaṭinissajjacārikaṃ pakkanto’’’ti."
    ],
    "innerText": "Tena kho pana samayena āyasmā ca mahāmoggallāno [mahāmoggalāno (ka.)] āyasmā ca ānando avāpuraṇaṃ [apāpuraṇaṃ (syā. ka.)] ādāya vihāre āhiṇḍanti [vihārena vihāraṃ anvāhiṇḍanti (sī. pī.), vihāraṃ āhiṇḍanti (syā.)] – ‘‘abhikkamathāyasmanto, abhikkamathāyasmanto! Idānāyasmā sāriputto bhagavato sammukhā sīhanādaṃ nadissatī’’ti. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ sāriputtaṃ bhagavā etadavoca – ‘‘idha te, sāriputta, aññataro sabrahmacārī khīyanadhammaṃ āpanno – ‘āyasmā maṃ, bhante, sāriputto āsajja appaṭinissajjacārikaṃ pakkanto’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yassa ",
      " nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
    ],
    "innerText": "‘‘Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhante, pathaviyaṃ sucimpi nikkhipanti asucimpi nikkhipanti gūthagatampi nikkhipanti muttagatampi nikkhipanti kheḷagatampi nikkhipanti pubbagatampi nikkhipanti lohitagatampi nikkhipanti, na ca tena pathavī aṭṭīyati vā harāyati vā jigucchati vā; evamevaṃ ",
      " kho ahaṃ, bhante, pathavīsamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
    ],
    "innerText": "‘‘Seyyathāpi, bhante, pathaviyaṃ sucimpi nikkhipanti asucimpi nikkhipanti gūthagatampi nikkhipanti muttagatampi nikkhipanti kheḷagatampi nikkhipanti pubbagatampi nikkhipanti lohitagatampi nikkhipanti, na ca tena pathavī aṭṭīyati vā harāyati vā jigucchati vā; evamevaṃ kho ahaṃ, bhante, pathavīsamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhante, āpasmiṃ sucimpi dhovanti asucimpi dhovanti gūthagatampi… muttagatampi… kheḷagatampi… pubbagatampi… lohitagatampi dhovanti, na ca tena āpo aṭṭīyati vā harāyati vā jigucchati vā; evamevaṃ kho ahaṃ, bhante, āposamena cetasā viharāmi vipulena mahaggatena appamāṇena ",
      " averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
    ],
    "innerText": "‘‘Seyyathāpi, bhante, āpasmiṃ sucimpi dhovanti asucimpi dhovanti gūthagatampi… muttagatampi… kheḷagatampi… pubbagatampi… lohitagatampi dhovanti, na ca tena āpo aṭṭīyati vā harāyati vā jigucchati vā; evamevaṃ kho ahaṃ, bhante, āposamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhante, tejo sucimpi ḍahati asucimpi ḍahati gūthagatampi… muttagatampi… kheḷagatampi… pubbagatampi… lohitagatampi ḍahati, na ca tena tejo aṭṭīyati vā harāyati vā jigucchati vā; evamevaṃ kho ahaṃ ",
      ", bhante, tejosamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
    ],
    "innerText": "‘‘Seyyathāpi, bhante, tejo sucimpi ḍahati asucimpi ḍahati gūthagatampi… muttagatampi… kheḷagatampi… pubbagatampi… lohitagatampi ḍahati, na ca tena tejo aṭṭīyati vā harāyati vā jigucchati vā; evamevaṃ kho ahaṃ , bhante, tejosamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhante, vāyo sucimpi upavāyati asucimpi upavāyati gūthagatampi… muttagatampi… kheḷagatampi… pubbagatampi… lohitagatampi upavāyati, na ca tena vāyo aṭṭīyati vā harāyati vā jigucchati vā; evamevaṃ kho ahaṃ, bhante, vāyosamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati ",
      " anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
    ],
    "innerText": "‘‘Seyyathāpi, bhante, vāyo sucimpi upavāyati asucimpi upavāyati gūthagatampi… muttagatampi… kheḷagatampi… pubbagatampi… lohitagatampi upavāyati, na ca tena vāyo aṭṭīyati vā harāyati vā jigucchati vā; evamevaṃ kho ahaṃ, bhante, vāyosamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi ",
      ", bhante, rajoharaṇaṃ sucimpi puñchati asucimpi puñchati gūthagatampi… muttagatampi… kheḷagatampi… pubbagatampi… lohitagatampi puñchati, na ca tena rajoharaṇaṃ aṭṭīyati vā harāyati vā jigucchati vā; evamevaṃ kho ahaṃ, bhante, rajoharaṇasamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
    ],
    "innerText": "‘‘Seyyathāpi , bhante, rajoharaṇaṃ sucimpi puñchati asucimpi puñchati gūthagatampi… muttagatampi… kheḷagatampi… pubbagatampi… lohitagatampi puñchati, na ca tena rajoharaṇaṃ aṭṭīyati vā harāyati vā jigucchati vā; evamevaṃ kho ahaṃ, bhante, rajoharaṇasamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhante, caṇḍālakumārako vā caṇḍālakumārikā vā kaḷopihattho nantakavāsī gāmaṃ vā nigamaṃ vā pavisanto nīcacittaṃyeva upaṭṭhapetvā ",
      " pavisati; evamevaṃ kho ahaṃ, bhante, caṇḍālakumārakacaṇḍālakumārikāsamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati ",
      " anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
    ],
    "innerText": "‘‘Seyyathāpi, bhante, caṇḍālakumārako vā caṇḍālakumārikā vā kaḷopihattho nantakavāsī gāmaṃ vā nigamaṃ vā pavisanto nīcacittaṃyeva upaṭṭhapetvā pavisati; evamevaṃ kho ahaṃ, bhante, caṇḍālakumārakacaṇḍālakumārikāsamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Seyyathāpi, bhante, usabho chinnavisāṇo sūrato sudanto suvinīto rathiyāya rathiyaṃ siṅghāṭakena siṅghāṭakaṃ anvāhiṇḍanto na kiñci hiṃsati pādena vā visāṇena vā; evamevaṃ kho ahaṃ, bhante, usabhachinnavisāṇasamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhante, itthī vā puriso vā daharo yuvā maṇḍanakajātiko sīsaṃnhāto ahikuṇapena vā kukkurakuṇapena ",
      " vā manussakuṇapena vā kaṇṭhe āsattena aṭṭīyeyya harāyeyya jiguccheyya; evamevaṃ kho ahaṃ, bhante, iminā pūtikāyena aṭṭīyāmi harāyāmi jigucchāmi. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
    ],
    "innerText": "‘‘Seyyathāpi, bhante, itthī vā puriso vā daharo yuvā maṇḍanakajātiko sīsaṃnhāto ahikuṇapena vā kukkurakuṇapena vā manussakuṇapena vā kaṇṭhe āsattena aṭṭīyeyya harāyeyya jiguccheyya; evamevaṃ kho ahaṃ, bhante, iminā pūtikāyena aṭṭīyāmi harāyāmi jigucchāmi. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi ",
      ", bhante, puriso medakathālikaṃ parihareyya chiddāvachiddaṃ uggharantaṃ paggharantaṃ; evamevaṃ kho ahaṃ, bhante, imaṃ kāyaṃ pariharāmi chiddāvachiddaṃ ",
      " uggharantaṃ paggharantaṃ. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyyā’’ti."
    ],
    "innerText": "‘‘Seyyathāpi , bhante, puriso medakathālikaṃ parihareyya chiddāvachiddaṃ uggharantaṃ paggharantaṃ; evamevaṃ kho ahaṃ, bhante, imaṃ kāyaṃ pariharāmi chiddāvachiddaṃ uggharantaṃ paggharantaṃ. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho so bhikkhu uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā bhagavato pādesu sirasā nipatitvā bhagavantaṃ etadavoca – ‘‘accayo maṃ, bhante, accagamā yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ, yo ahaṃ āyasmantaṃ sāriputtaṃ asatā tucchā musā abhūtena abbhācikkhiṃ. Tassa me, bhante, bhagavā accayaṃ accayato paṭiggaṇhatu āyatiṃ saṃvarāyā’’ti. ‘‘Taggha taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tvaṃ (sī. pī.)]"
      },
      ", bhikkhu, accayo accagamā yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ, yo tvaṃ sāriputtaṃ asatā tucchā musā abhūtena abbhācikkhi. Yato ca kho tvaṃ, bhikkhu, accayaṃ accayato disvā yathādhammaṃ ",
      " paṭikarosi, taṃ te mayaṃ paṭiggaṇhāma. Vuḍḍhihesā, bhikkhu, ariyassa vinaye yo accayaṃ accayato disvā yathādhammaṃ paṭikaroti āyatiṃ saṃvaraṃ āpajjatī’’ti."
    ],
    "innerText": "Atha kho so bhikkhu uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā bhagavato pādesu sirasā nipatitvā bhagavantaṃ etadavoca – ‘‘accayo maṃ, bhante, accagamā yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ, yo ahaṃ āyasmantaṃ sāriputtaṃ asatā tucchā musā abhūtena abbhācikkhiṃ. Tassa me, bhante, bhagavā accayaṃ accayato paṭiggaṇhatu āyatiṃ saṃvarāyā’’ti. ‘‘Taggha taṃ [tvaṃ (sī. pī.)], bhikkhu, accayo accagamā yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ, yo tvaṃ sāriputtaṃ asatā tucchā musā abhūtena abbhācikkhi. Yato ca kho tvaṃ, bhikkhu, accayaṃ accayato disvā yathādhammaṃ paṭikarosi, taṃ te mayaṃ paṭiggaṇhāma. Vuḍḍhihesā, bhikkhu, ariyassa vinaye yo accayaṃ accayato disvā yathādhammaṃ paṭikaroti āyatiṃ saṃvaraṃ āpajjatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho bhagavā āyasmantaṃ sāriputtaṃ āmantesi – ‘‘khama, sāriputta, imassa moghapurisassa, purā tassa tattheva sattadhā muddhā phalatī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[phalissatīti (ka. sī. syā. pī. ka.) aṭṭhakathāsu pana ‘‘phalatīti’’ itveva dissati]"
      },
      ". ‘‘Khamāmahaṃ, bhante, tassa āyasmato sace maṃ so āyasmā evamāha – ‘khamatu ca me so āyasmā’’’ti. Paṭhamaṃ."
    ],
    "innerText": "Atha kho bhagavā āyasmantaṃ sāriputtaṃ āmantesi – ‘‘khama, sāriputta, imassa moghapurisassa, purā tassa tattheva sattadhā muddhā phalatī’’ti [phalissatīti (ka. sī. syā. pī. ka.) aṭṭhakathāsu pana ‘‘phalatīti’’ itveva dissati]. ‘‘Khamāmahaṃ, bhante, tassa āyasmato sace maṃ so āyasmā evamāha – ‘khamatu ca me so āyasmā’’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Saupādisesasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ". Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā sāriputto pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya ",
      " sāvatthiṃ piṇḍāya pāvisi. Atha kho āyasmato sāriputtassa etadahosi – ‘‘atippago kho tāva sāvatthiyaṃ piṇḍāya carituṃ, yaṃnūnāhaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyya’’nti. Atha kho āyasmā sāriputto yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkami; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi."
    ],
    "innerText": "12. Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā sāriputto pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi. Atha kho āyasmato sāriputtassa etadahosi – ‘‘atippago kho tāva sāvatthiyaṃ piṇḍāya carituṃ, yaṃnūnāhaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyya’’nti. Atha kho āyasmā sāriputto yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkami; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena tesaṃ aññatitthiyānaṃ paribbājakānaṃ sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘‘yo hi koci, āvuso, saupādiseso kālaṃ karoti, sabbo so aparimutto nirayā aparimutto tiracchānayoniyā aparimutto pettivisayā aparimutto apāyaduggativinipātā’’ti. Atha kho āyasmā sāriputto tesaṃ aññatitthiyānaṃ paribbājakānaṃ bhāsitaṃ neva abhinandi nappaṭikkosi. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā pakkāmi – ‘‘bhagavato santike etassa bhāsitassa atthaṃ ājānissāmī’’ti. Atha kho āyasmā sāriputto sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ ",
      " piṇḍapātapaṭikkanto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ",
      " ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca –"
    ],
    "innerText": "Tena kho pana samayena tesaṃ aññatitthiyānaṃ paribbājakānaṃ sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘‘yo hi koci, āvuso, saupādiseso kālaṃ karoti, sabbo so aparimutto nirayā aparimutto tiracchānayoniyā aparimutto pettivisayā aparimutto apāyaduggativinipātā’’ti. Atha kho āyasmā sāriputto tesaṃ aññatitthiyānaṃ paribbājakānaṃ bhāsitaṃ neva abhinandi nappaṭikkosi. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā pakkāmi – ‘‘bhagavato santike etassa bhāsitassa atthaṃ ājānissāmī’’ti. Atha kho āyasmā sāriputto sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idhāhaṃ, bhante, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisiṃ. Tassa mayhaṃ, bhante, etadahosi – ‘atippago kho tāva sāvatthiyaṃ ",
      " piṇḍāya carituṃ; yaṃnūnāhaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyya’nti. Atha kho ahaṃ, bhante, yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkamiṃ; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṃ sammodiṃ. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃ. Tena kho pana samayena tesaṃ aññatitthiyānaṃ paribbājakānaṃ sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘yo hi koci, āvuso, saupādiseso kālaṃ karoti, sabbo so aparimutto nirayā aparimutto tiracchānayoniyā aparimutto pettivisayā aparimutto apāyaduggativinipātā’ti. Atha kho ahaṃ, bhante, tesaṃ aññatitthiyānaṃ paribbājakānaṃ bhāsitaṃ neva abhinandiṃ nappaṭikkosiṃ. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā pakkamiṃ – ‘bhagavato santike etassa bhāsitassa atthaṃ ājānissāmī’’’ti."
    ],
    "innerText": "‘‘Idhāhaṃ, bhante, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisiṃ. Tassa mayhaṃ, bhante, etadahosi – ‘atippago kho tāva sāvatthiyaṃ piṇḍāya carituṃ; yaṃnūnāhaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyya’nti. Atha kho ahaṃ, bhante, yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkamiṃ; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṃ sammodiṃ. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃ. Tena kho pana samayena tesaṃ aññatitthiyānaṃ paribbājakānaṃ sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘yo hi koci, āvuso, saupādiseso kālaṃ karoti, sabbo so aparimutto nirayā aparimutto tiracchānayoniyā aparimutto pettivisayā aparimutto apāyaduggativinipātā’ti. Atha kho ahaṃ, bhante, tesaṃ aññatitthiyānaṃ paribbājakānaṃ bhāsitaṃ neva abhinandiṃ nappaṭikkosiṃ. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā pakkamiṃ – ‘bhagavato santike etassa bhāsitassa atthaṃ ājānissāmī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ke ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[keci (syā. pī.), te ca (ka.)]"
      },
      ", sāriputta, aññatitthiyā paribbājakā bālā abyattā, ke ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[keci (syā. pī. ka.) a. ni. 6.44 pāḷiyā saṃsandetabbaṃ]"
      },
      " saupādisesaṃ vā ‘saupādiseso’ti jānissanti, anupādisesaṃ vā ‘anupādiseso’ti jānissanti’’!"
    ],
    "innerText": "‘‘Ke ca [keci (syā. pī.), te ca (ka.)], sāriputta, aññatitthiyā paribbājakā bālā abyattā, ke ca [keci (syā. pī. ka.) a. ni. 6.44 pāḷiyā saṃsandetabbaṃ] saupādisesaṃ vā ‘saupādiseso’ti jānissanti, anupādisesaṃ vā ‘anupādiseso’ti jānissanti’’!"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Navayime, sāriputta, puggalā saupādisesā kālaṃ kurumānā parimuttā nirayā parimuttā tiracchānayoniyā parimuttā pettivisayā parimuttā apāyaduggativinipātā. Katame nava? Idha ",
      ", sāriputta, ekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ paripūrakārī ",
      ", paññāya mattaso kārī. So pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā antarāparinibbāyī hoti. Ayaṃ, sāriputta ",
      ", paṭhamo puggalo saupādiseso kālaṃ kurumāno parimutto nirayā parimutto tiracchānayoniyā ",
      " parimutto pettivisayā parimutto apāyaduggativinipātā."
    ],
    "innerText": "‘‘Navayime, sāriputta, puggalā saupādisesā kālaṃ kurumānā parimuttā nirayā parimuttā tiracchānayoniyā parimuttā pettivisayā parimuttā apāyaduggativinipātā. Katame nava? Idha , sāriputta, ekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ paripūrakārī , paññāya mattaso kārī. So pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā antarāparinibbāyī hoti. Ayaṃ, sāriputta , paṭhamo puggalo saupādiseso kālaṃ kurumāno parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ paripūrakārī, paññāya mattaso kārī. So pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā upahaccaparinibbāyī hoti…pe… asaṅkhāraparinibbāyī hoti…pe… sasaṅkhāraparinibbāyī hoti…pe… uddhaṃsoto hoti akaniṭṭhagāmī. Ayaṃ, sāriputta, pañcamo puggalo saupādiseso kālaṃ kurumāno parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ mattaso kārī, paññāya mattaso kārī. So tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmī hoti, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karoti. Ayaṃ, sāriputta, chaṭṭho puggalo saupādiseso kālaṃ kurumāno parimutto nirayā…pe… parimutto apāyaduggativinipātā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ mattaso kārī, paññāya mattaso kārī. So tiṇṇaṃ saṃyojanānaṃ parikkhayā ekabījī hoti, ekaṃyeva mānusakaṃ bhavaṃ nibbattetvā dukkhassantaṃ ",
      " karoti. Ayaṃ, sāriputta, sattamo puggalo saupādiseso ",
      " kālaṃ kurumāno parimutto nirayā…pe… parimutto apāyaduggativinipātā."
    ],
    "innerText": "‘‘Puna caparaṃ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ mattaso kārī, paññāya mattaso kārī. So tiṇṇaṃ saṃyojanānaṃ parikkhayā ekabījī hoti, ekaṃyeva mānusakaṃ bhavaṃ nibbattetvā dukkhassantaṃ karoti. Ayaṃ, sāriputta, sattamo puggalo saupādiseso kālaṃ kurumāno parimutto nirayā…pe… parimutto apāyaduggativinipātā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ mattaso kārī, paññāya mattaso kārī. So tiṇṇaṃ saṃyojanānaṃ parikkhayā kolaṃkolo hoti, dve vā tīṇi vā kulāni sandhāvitvā saṃsaritvā dukkhassantaṃ karoti. Ayaṃ, sāriputta, aṭṭhamo puggalo saupādiseso kālaṃ kurumāno parimutto nirayā…pe… parimutto apāyaduggativinipātā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ mattaso kārī, paññāya mattaso kārī. So tiṇṇaṃ ",
      " saṃyojanānaṃ parikkhayā sattakkhattuparamo hoti, sattakkhattuparamaṃ deve ca manusse ca sandhāvitvā saṃsaritvā dukkhassantaṃ karoti. Ayaṃ, sāriputta, navamo puggalo saupādiseso kālaṃ kurumāno parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā."
    ],
    "innerText": "‘‘Puna caparaṃ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ mattaso kārī, paññāya mattaso kārī. So tiṇṇaṃ saṃyojanānaṃ parikkhayā sattakkhattuparamo hoti, sattakkhattuparamaṃ deve ca manusse ca sandhāvitvā saṃsaritvā dukkhassantaṃ karoti. Ayaṃ, sāriputta, navamo puggalo saupādiseso kālaṃ kurumāno parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ke ca, sāriputta, aññatitthiyā paribbājakā bālā abyattā, ke ca saupādisesaṃ vā ‘saupādiseso’ti jānissanti, anupādisesaṃ vā ‘anupādiseso’ti jānissanti! Ime kho, sāriputta, nava puggalā saupādisesā kālaṃ kurumānā parimuttā nirayā parimuttā tiracchānayoniyā parimuttā pettivisayā parimuttā apāyaduggativinipātā. Na tāvāyaṃ, sāriputta, dhammapariyāyo paṭibhāsi bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ. Taṃ kissa ",
      " hetu? Māyimaṃ dhammapariyāyaṃ sutvā pamādaṃ āhariṃsūti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āhariṃsu (sī. pī.)]"
      },
      ". Api ",
      " ca mayā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[api cāyaṃ (?)]"
      },
      ", sāriputta, dhammapariyāyo pañhādhippāyena bhāsito’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Ke ca, sāriputta, aññatitthiyā paribbājakā bālā abyattā, ke ca saupādisesaṃ vā ‘saupādiseso’ti jānissanti, anupādisesaṃ vā ‘anupādiseso’ti jānissanti! Ime kho, sāriputta, nava puggalā saupādisesā kālaṃ kurumānā parimuttā nirayā parimuttā tiracchānayoniyā parimuttā pettivisayā parimuttā apāyaduggativinipātā. Na tāvāyaṃ, sāriputta, dhammapariyāyo paṭibhāsi bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ. Taṃ kissa hetu? Māyimaṃ dhammapariyāyaṃ sutvā pamādaṃ āhariṃsūti [āhariṃsu (sī. pī.)]. Api ca mayā [api cāyaṃ (?)], sāriputta, dhammapariyāyo pañhādhippāyena bhāsito’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Koṭṭhikasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". Atha kho āyasmā mahākoṭṭhiko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahākoṭṭhito (sī. syā. pī.)]"
      },
      " yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mahākoṭṭhiko āyasmantaṃ sāriputtaṃ etadavoca – ‘‘kiṃ nu kho, āvuso sāriputta, ‘yaṃ kammaṃ diṭṭhadhammavedanīyaṃ, taṃ me kammaṃ samparāyavedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’."
    ],
    "innerText": "13. Atha kho āyasmā mahākoṭṭhiko [mahākoṭṭhito (sī. syā. pī.)] yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mahākoṭṭhiko āyasmantaṃ sāriputtaṃ etadavoca – ‘‘kiṃ nu kho, āvuso sāriputta, ‘yaṃ kammaṃ diṭṭhadhammavedanīyaṃ, taṃ me kammaṃ samparāyavedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiṃ nu kho, āvuso sāriputta, ‘yaṃ kammaṃ sukhavedanīyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sukhavedaniyaṃ (ka.) ma. ni. 3.8 passitabbaṃ]"
      },
      ", taṃ me kammaṃ dukkhavedanīyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dukkhavedaniyaṃ (ka.)]"
      },
      " hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’."
    ],
    "innerText": "‘‘Kiṃ nu kho, āvuso sāriputta, ‘yaṃ kammaṃ sukhavedanīyaṃ [sukhavedaniyaṃ (ka.) ma. ni. 3.8 passitabbaṃ], taṃ me kammaṃ dukkhavedanīyaṃ [dukkhavedaniyaṃ (ka.)] hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiṃ nu kho, āvuso sāriputta, ‘yaṃ kammaṃ sukhavedanīyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sukhavedaniyaṃ (ka.) ma. ni. 3.8 passitabbaṃ]"
      },
      ", taṃ me kammaṃ dukkhavedanīyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dukkhavedaniyaṃ (ka.)]"
      },
      " hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’."
    ],
    "innerText": "‘‘Kiṃ nu kho, āvuso sāriputta, ‘yaṃ kammaṃ sukhavedanīyaṃ [sukhavedaniyaṃ (ka.) ma. ni. 3.8 passitabbaṃ], taṃ me kammaṃ dukkhavedanīyaṃ [dukkhavedaniyaṃ (ka.)] hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiṃ ",
      " panāvuso, sāriputta, ‘yaṃ kammaṃ dukkhavedanīyaṃ, taṃ me kammaṃ sukhavedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’."
    ],
    "innerText": "‘‘Kiṃ panāvuso, sāriputta, ‘yaṃ kammaṃ dukkhavedanīyaṃ, taṃ me kammaṃ sukhavedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiṃ nu kho, āvuso sāriputta, ‘yaṃ kammaṃ paripakkavedanīyaṃ, taṃ me kammaṃ aparipakkavedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No ",
      " hidaṃ, āvuso’’."
    ],
    "innerText": "‘‘Kiṃ nu kho, āvuso sāriputta, ‘yaṃ kammaṃ paripakkavedanīyaṃ, taṃ me kammaṃ aparipakkavedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kiṃ panāvuso sāriputta, ‘yaṃ kammaṃ aparipakkavedanīyaṃ, taṃ me kammaṃ paripakkavedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kiṃ nu kho, āvuso sāriputta, ‘yaṃ kammaṃ bahuvedanīyaṃ, taṃ me kammaṃ appavedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiṃ panāvuso sāriputta ",
      ", ‘yaṃ kammaṃ appavedanīyaṃ, taṃ me kammaṃ bahuvedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’."
    ],
    "innerText": "‘‘Kiṃ panāvuso sāriputta , ‘yaṃ kammaṃ appavedanīyaṃ, taṃ me kammaṃ bahuvedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kiṃ nu kho, āvuso sāriputta, ‘yaṃ kammaṃ vedanīyaṃ, taṃ me kammaṃ avedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kiṃ panāvuso sāriputta, ‘yaṃ kammaṃ avedanīyaṃ, taṃ me kammaṃ vedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Kiṃ nu kho, āvuso sāriputta, yaṃ kammaṃ diṭṭhadhammavedanīyaṃ taṃ me kammaṃ samparāyavedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Kiṃ panāvuso sāriputta, yaṃ kammaṃ samparāyavedanīyaṃ taṃ me kammaṃ diṭṭhadhammavedanīyaṃ hotūti ",
      ", etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi."
    ],
    "innerText": "‘‘‘Kiṃ panāvuso sāriputta, yaṃ kammaṃ samparāyavedanīyaṃ taṃ me kammaṃ diṭṭhadhammavedanīyaṃ hotūti , etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Kiṃ ",
      " nu kho, āvuso sāriputta, yaṃ kammaṃ sukhavedanīyaṃ taṃ me kammaṃ dukkhavedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi."
    ],
    "innerText": "‘‘‘Kiṃ nu kho, āvuso sāriputta, yaṃ kammaṃ sukhavedanīyaṃ taṃ me kammaṃ dukkhavedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Kiṃ panāvuso sāriputta, yaṃ kammaṃ dukkhavedanīyaṃ taṃ me kammaṃ sukhavedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti ",
      " puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi."
    ],
    "innerText": "‘‘‘Kiṃ panāvuso sāriputta, yaṃ kammaṃ dukkhavedanīyaṃ taṃ me kammaṃ sukhavedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Kiṃ nu kho, āvuso sāriputta, yaṃ kammaṃ paripakkavedanīyaṃ taṃ me kammaṃ aparipakkavedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Kiṃ panāvuso sāriputta, yaṃ kammaṃ aparipakkavedanīyaṃ taṃ me kammaṃ paripakkavedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ ",
      " vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi."
    ],
    "innerText": "‘‘‘Kiṃ panāvuso sāriputta, yaṃ kammaṃ aparipakkavedanīyaṃ taṃ me kammaṃ paripakkavedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Kiṃ nu kho, āvuso sāriputta, yaṃ kammaṃ bahuvedanīyaṃ taṃ me kammaṃ appavedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Kiṃ panāvuso sāriputta, yaṃ kammaṃ appavedanīyaṃ taṃ me kammaṃ bahuvedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Kiṃ nu kho, āvuso sāriputta, yaṃ kammaṃ vedanīyaṃ taṃ me kammaṃ avedanīyaṃ hotūti ",
      ", etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi."
    ],
    "innerText": "‘‘‘Kiṃ nu kho, āvuso sāriputta, yaṃ kammaṃ vedanīyaṃ taṃ me kammaṃ avedanīyaṃ hotūti , etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Kiṃ panāvuso sāriputta, yaṃ kammaṃ avedanīyaṃ taṃ me kammaṃ vedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi. Atha kimatthaṃ carahāvuso, bhagavati brahmacariyaṃ vussatī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yaṃ khvassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yaṃ kho (ka.)]"
      },
      ", āvuso, aññātaṃ adiṭṭhaṃ appattaṃ asacchikataṃ anabhisametaṃ, tassa ñāṇāya dassanāya pattiyā sacchikiriyāya abhisamayāya bhagavati ",
      " brahmacariyaṃ vussatī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vussati (syā.)]"
      },
      ". (‘‘Kiṃ panassāvuso, aññātaṃ ",
      " adiṭṭhaṃ appattaṃ asacchikataṃ anabhisametaṃ, yassa ñāṇāya dassanāya pattiyā sacchikiriyāya abhisamayāya bhagavati brahmacariyaṃ vussatī’’ti?) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[( ) syā. ka. potthakesu natthi]"
      },
      " ‘‘‘Idaṃ dukkha’nti khvassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kho yaṃ (ka.)]"
      },
      ", āvuso, aññātaṃ adiṭṭhaṃ appattaṃ asacchikataṃ anabhisametaṃ. Tassa ñāṇāya dassanāya pattiyā sacchikiriyāya abhisamayāya bhagavati brahmacariyaṃ vussati. Ayaṃ ",
      " ‘dukkhasamudayo’ti khvassa, āvuso…pe… ‘ayaṃ dukkhanirodho’ti khvassa, āvuso…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti khvassa, āvuso, aññātaṃ adiṭṭhaṃ appattaṃ asacchikataṃ anabhisametaṃ. Tassa ñāṇāya dassanāya pattiyā sacchikiriyāya abhisamayāya bhagavati brahmacariyaṃ vussati. Idaṃ khvassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[iti kho yaṃ (ka.)]"
      },
      ", āvuso, aññātaṃ adiṭṭhaṃ appattaṃ asacchikataṃ anabhisametaṃ. Tassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yassa (?)]"
      },
      " ñāṇāya dassanāya pattiyā sacchikiriyāya abhisamayāya bhagavati brahmacariyaṃ vussatī’’ti. Tatiyaṃ."
    ],
    "innerText": "‘‘Yaṃ khvassa [yaṃ kho (ka.)], āvuso, aññātaṃ adiṭṭhaṃ appattaṃ asacchikataṃ anabhisametaṃ, tassa ñāṇāya dassanāya pattiyā sacchikiriyāya abhisamayāya bhagavati brahmacariyaṃ vussatī’’ti [vussati (syā.)]. (‘‘Kiṃ panassāvuso, aññātaṃ adiṭṭhaṃ appattaṃ asacchikataṃ anabhisametaṃ, yassa ñāṇāya dassanāya pattiyā sacchikiriyāya abhisamayāya bhagavati brahmacariyaṃ vussatī’’ti?) [( ) syā. ka. potthakesu natthi] ‘‘‘Idaṃ dukkha’nti khvassa [kho yaṃ (ka.)], āvuso, aññātaṃ adiṭṭhaṃ appattaṃ asacchikataṃ anabhisametaṃ. Tassa ñāṇāya dassanāya pattiyā sacchikiriyāya abhisamayāya bhagavati brahmacariyaṃ vussati. Ayaṃ ‘dukkhasamudayo’ti khvassa, āvuso…pe… ‘ayaṃ dukkhanirodho’ti khvassa, āvuso…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti khvassa, āvuso, aññātaṃ adiṭṭhaṃ appattaṃ asacchikataṃ anabhisametaṃ. Tassa ñāṇāya dassanāya pattiyā sacchikiriyāya abhisamayāya bhagavati brahmacariyaṃ vussati. Idaṃ khvassa [iti kho yaṃ (ka.)], āvuso, aññātaṃ adiṭṭhaṃ appattaṃ asacchikataṃ anabhisametaṃ. Tassa [yassa (?)] ñāṇāya dassanāya pattiyā sacchikiriyāya abhisamayāya bhagavati brahmacariyaṃ vussatī’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Samiddhisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Atha kho āyasmā samiddhi yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmantaṃ sāriputtaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ samiddhiṃ āyasmā sāriputto etadavoca – ‘‘kimārammaṇā, samiddhi, purisassa saṅkappavitakkā uppajjantī’’ti? ‘‘Nāmarūpārammaṇā, bhante’’ti. ‘‘Te pana, samiddhi, kva nānattaṃ gacchantī’’ti? ‘‘Dhātūsu, bhante’’ti. ‘‘Te pana, samiddhi, kiṃsamudayā’’ti? ‘‘Phassasamudayā, bhante’’ti. ‘‘Te pana, samiddhi, kiṃsamosaraṇā’’ti? ‘‘Vedanāsamosaraṇā, bhante’’ti. ‘‘Te pana ",
      ", samiddhi, kiṃpamukhā’’ti? ‘‘Samādhippamukhā, bhante’’ti. ‘‘Te pana, samiddhi, kiṃadhipateyyā’’ti? ‘‘Satādhipateyyā, bhante’’ti. ‘‘Te pana, samiddhi, kiṃuttarā’’ti? ‘‘Paññuttarā, bhante’’ti. ‘‘Te pana, samiddhi, kiṃsārā’’ti? ‘‘Vimuttisārā, bhante’’ti. ‘‘Te pana, samiddhi, kiṃogadhā’’ti? ‘‘Amatogadhā, bhante’’ti."
    ],
    "innerText": "14. Atha kho āyasmā samiddhi yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmantaṃ sāriputtaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ samiddhiṃ āyasmā sāriputto etadavoca – ‘‘kimārammaṇā, samiddhi, purisassa saṅkappavitakkā uppajjantī’’ti? ‘‘Nāmarūpārammaṇā, bhante’’ti. ‘‘Te pana, samiddhi, kva nānattaṃ gacchantī’’ti? ‘‘Dhātūsu, bhante’’ti. ‘‘Te pana, samiddhi, kiṃsamudayā’’ti? ‘‘Phassasamudayā, bhante’’ti. ‘‘Te pana, samiddhi, kiṃsamosaraṇā’’ti? ‘‘Vedanāsamosaraṇā, bhante’’ti. ‘‘Te pana , samiddhi, kiṃpamukhā’’ti? ‘‘Samādhippamukhā, bhante’’ti. ‘‘Te pana, samiddhi, kiṃadhipateyyā’’ti? ‘‘Satādhipateyyā, bhante’’ti. ‘‘Te pana, samiddhi, kiṃuttarā’’ti? ‘‘Paññuttarā, bhante’’ti. ‘‘Te pana, samiddhi, kiṃsārā’’ti? ‘‘Vimuttisārā, bhante’’ti. ‘‘Te pana, samiddhi, kiṃogadhā’’ti? ‘‘Amatogadhā, bhante’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Kimārammaṇā, samiddhi, purisassa saṅkappavitakkā uppajjantī’ti, iti puṭṭho samāno ‘nāmarūpārammaṇā, bhante’ti vadesi. ‘Te pana, samiddhi, kva ",
      " nānattaṃ gacchantī’ti, iti ",
      " puṭṭho samāno ‘dhātūsu, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃsamudayā’ti, iti puṭṭho samāno ‘phassasamudayā, bhante’ti ",
      " vadesi. ‘Te pana, samiddhi, kiṃsamosaraṇā’ti, iti puṭṭho samāno ‘vedanāsamosaraṇā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃpamukhā’ti, iti puṭṭho samāno ‘samādhippamukhā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃadhipateyyā’ti, iti puṭṭho samāno ‘satādhipateyyā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃuttarā’ti, iti puṭṭho samāno ‘paññuttarā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃsārā’ti, iti puṭṭho samāno ‘vimuttisārā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃogadhā’ti, iti puṭṭho samāno ‘amatogadhā, bhante’ti vadesi. Sādhu sādhu, samiddhi! Sādhu kho tvaṃ, samiddhi, puṭṭho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pañhaṃ (sī. syā. pī.)]"
      },
      " puṭṭho vissajjesi, tena ca mā maññī’’ti. Catutthaṃ."
    ],
    "innerText": "‘‘‘Kimārammaṇā, samiddhi, purisassa saṅkappavitakkā uppajjantī’ti, iti puṭṭho samāno ‘nāmarūpārammaṇā, bhante’ti vadesi. ‘Te pana, samiddhi, kva nānattaṃ gacchantī’ti, iti puṭṭho samāno ‘dhātūsu, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃsamudayā’ti, iti puṭṭho samāno ‘phassasamudayā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃsamosaraṇā’ti, iti puṭṭho samāno ‘vedanāsamosaraṇā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃpamukhā’ti, iti puṭṭho samāno ‘samādhippamukhā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃadhipateyyā’ti, iti puṭṭho samāno ‘satādhipateyyā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃuttarā’ti, iti puṭṭho samāno ‘paññuttarā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃsārā’ti, iti puṭṭho samāno ‘vimuttisārā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃogadhā’ti, iti puṭṭho samāno ‘amatogadhā, bhante’ti vadesi. Sādhu sādhu, samiddhi! Sādhu kho tvaṃ, samiddhi, puṭṭho [pañhaṃ (sī. syā. pī.)] puṭṭho vissajjesi, tena ca mā maññī’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Gaṇḍasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". ‘‘Seyyathāpi, bhikkhave, gaṇḍo anekavassagaṇiko. Tassassu gaṇḍassa nava vaṇamukhāni nava abhedanamukhāni. Tato yaṃ kiñci pagghareyya – asuciyeva pagghareyya, duggandhaṃyeva pagghareyya, jegucchiyaṃyeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[jegucchiyeva (ka.)]"
      },
      " pagghareyya; yaṃ kiñci pasaveyya – asuciyeva pasaveyya, duggandhaṃyeva pasaveyya, jegucchiyaṃyeva pasaveyya."
    ],
    "innerText": "15. ‘‘Seyyathāpi, bhikkhave, gaṇḍo anekavassagaṇiko. Tassassu gaṇḍassa nava vaṇamukhāni nava abhedanamukhāni. Tato yaṃ kiñci pagghareyya – asuciyeva pagghareyya, duggandhaṃyeva pagghareyya, jegucchiyaṃyeva [jegucchiyeva (ka.)] pagghareyya; yaṃ kiñci pasaveyya – asuciyeva pasaveyya, duggandhaṃyeva pasaveyya, jegucchiyaṃyeva pasaveyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Gaṇḍoti kho, bhikkhave, imassetaṃ cātumahābhūtikassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cātummahābhūtikassa (sī. syā. pī.)]"
      },
      " kāyassa adhivacanaṃ mātāpettikasambhavassa odanakummāsūpacayassa aniccucchādanaparimaddanabhedanaviddhaṃsanadhammassa. Tassassu gaṇḍassa nava vaṇamukhāni nava abhedanamukhāni. Tato yaṃ kiñci paggharati – asuciyeva paggharati, duggandhaṃyeva paggharati, jegucchiyaṃyeva ",
      " paggharati; yaṃ kiñci pasavati ",
      " – asuciyeva ",
      " pasavati, duggandhaṃyeva pasavati, jegucchiyaṃyeva pasavati. Tasmātiha, bhikkhave, imasmiṃ kāye nibbindathā’’ti. Pañcamaṃ."
    ],
    "innerText": "‘‘Gaṇḍoti kho, bhikkhave, imassetaṃ cātumahābhūtikassa [cātummahābhūtikassa (sī. syā. pī.)] kāyassa adhivacanaṃ mātāpettikasambhavassa odanakummāsūpacayassa aniccucchādanaparimaddanabhedanaviddhaṃsanadhammassa. Tassassu gaṇḍassa nava vaṇamukhāni nava abhedanamukhāni. Tato yaṃ kiñci paggharati – asuciyeva paggharati, duggandhaṃyeva paggharati, jegucchiyaṃyeva paggharati; yaṃ kiñci pasavati – asuciyeva pasavati, duggandhaṃyeva pasavati, jegucchiyaṃyeva pasavati. Tasmātiha, bhikkhave, imasmiṃ kāye nibbindathā’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Saññāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". ‘‘Navayimā, bhikkhave, saññā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā. Katamā nava ",
      "? Asubhasaññā, maraṇasaññā, āhāre paṭikūlasaññā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṭikkūlasaññā (sī. syā. pī.)]"
      },
      ", sabbaloke anabhiratasaññā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anabhiratisaññā (ka.) a. ni. 5.121-122]"
      },
      ", aniccasaññā, anicce dukkhasaññā, dukkhe anattasaññā, pahānasaññā, virāgasaññā – imā kho, bhikkhave, nava saññā, bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "16. ‘‘Navayimā, bhikkhave, saññā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā. Katamā nava ? Asubhasaññā, maraṇasaññā, āhāre paṭikūlasaññā [paṭikkūlasaññā (sī. syā. pī.)], sabbaloke anabhiratasaññā [anabhiratisaññā (ka.) a. ni. 5.121-122], aniccasaññā, anicce dukkhasaññā, dukkhe anattasaññā, pahānasaññā, virāgasaññā – imā kho, bhikkhave, nava saññā, bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Kulasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ". ‘‘Navahi, bhikkhave, aṅgehi samannāgataṃ kulaṃ anupagantvā vā nālaṃ upagantuṃ, upagantvā vā nālaṃ nisīdituṃ. Katamehi navahi? Na manāpena paccuṭṭhenti, na manāpena abhivādenti, na manāpena āsanaṃ denti, santamassa pariguhanti, bahukampi thokaṃ denti, paṇītampi lūkhaṃ denti, asakkaccaṃ denti no sakkaccaṃ, na upanisīdanti dhammassavanāya, bhāsitamassa na sussūsanti. Imehi kho, bhikkhave, navahaṅgehi samannāgataṃ kulaṃ anupagantvā vā nālaṃ upagantuṃ upagantvā vā nālaṃ nisīdituṃ."
    ],
    "innerText": "17. ‘‘Navahi, bhikkhave, aṅgehi samannāgataṃ kulaṃ anupagantvā vā nālaṃ upagantuṃ, upagantvā vā nālaṃ nisīdituṃ. Katamehi navahi? Na manāpena paccuṭṭhenti, na manāpena abhivādenti, na manāpena āsanaṃ denti, santamassa pariguhanti, bahukampi thokaṃ denti, paṇītampi lūkhaṃ denti, asakkaccaṃ denti no sakkaccaṃ, na upanisīdanti dhammassavanāya, bhāsitamassa na sussūsanti. Imehi kho, bhikkhave, navahaṅgehi samannāgataṃ kulaṃ anupagantvā vā nālaṃ upagantuṃ upagantvā vā nālaṃ nisīdituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Navahi, bhikkhave, aṅgehi samannāgataṃ kulaṃ anupagantvā vā alaṃ upagantuṃ, upagantvā vā alaṃ nisīdituṃ. Katamehi navahi? Manāpena paccuṭṭhenti, manāpena abhivādenti, manāpena āsanaṃ denti, santamassa ",
      " na pariguhanti, bahukampi ",
      " bahukaṃ denti, paṇītampi paṇītaṃ denti, sakkaccaṃ denti no asakkaccaṃ, upanisīdanti dhammassavanāya, bhāsitamassa sussūsanti. Imehi kho, bhikkhave, navahaṅgehi samannāgataṃ kulaṃ anupagantvā vā alaṃ upagantuṃ, upagantvā vā alaṃ nisīditu’’nti. Sattamaṃ."
    ],
    "innerText": "‘‘Navahi, bhikkhave, aṅgehi samannāgataṃ kulaṃ anupagantvā vā alaṃ upagantuṃ, upagantvā vā alaṃ nisīdituṃ. Katamehi navahi? Manāpena paccuṭṭhenti, manāpena abhivādenti, manāpena āsanaṃ denti, santamassa na pariguhanti, bahukampi bahukaṃ denti, paṇītampi paṇītaṃ denti, sakkaccaṃ denti no asakkaccaṃ, upanisīdanti dhammassavanāya, bhāsitamassa sussūsanti. Imehi kho, bhikkhave, navahaṅgehi samannāgataṃ kulaṃ anupagantvā vā alaṃ upagantuṃ, upagantvā vā alaṃ nisīditu’’nti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Navaṅguposathasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". ‘‘Navahi ",
      ", bhikkhave, aṅgehi samannāgato uposatho upavuttho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. Kathaṃ upavuttho ca, bhikkhave, navahaṅgehi samannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro? Idha, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yāvajīvaṃ arahanto pāṇātipātaṃ pahāya pāṇātipātā paṭiviratā nihitadaṇḍā nihitasatthā lajjī ",
      " dayāpannā sabbapāṇabhūtahitānukampino viharanti; ahampajja imañca rattiṃ imañca divasaṃ pāṇātipātaṃ pahāya pāṇātipātā paṭivirato nihitadaṇḍo nihitasattho lajjī dayāpanno sabbapāṇabhūtahitānukampī viharāmi. Imināpaṅgena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[imināpi aṅgena (ka. sī.)]"
      },
      " arahataṃ anukaromi; uposatho ca me upavuttho bhavissatī’ti. Iminā paṭhamena aṅgena samannāgato hoti…pe. ",
      "…."
    ],
    "innerText": "18. ‘‘Navahi , bhikkhave, aṅgehi samannāgato uposatho upavuttho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. Kathaṃ upavuttho ca, bhikkhave, navahaṅgehi samannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro? Idha, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yāvajīvaṃ arahanto pāṇātipātaṃ pahāya pāṇātipātā paṭiviratā nihitadaṇḍā nihitasatthā lajjī dayāpannā sabbapāṇabhūtahitānukampino viharanti; ahampajja imañca rattiṃ imañca divasaṃ pāṇātipātaṃ pahāya pāṇātipātā paṭivirato nihitadaṇḍo nihitasattho lajjī dayāpanno sabbapāṇabhūtahitānukampī viharāmi. Imināpaṅgena [imināpi aṅgena (ka. sī.)] arahataṃ anukaromi; uposatho ca me upavuttho bhavissatī’ti. Iminā paṭhamena aṅgena samannāgato hoti…pe. …."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Yāvajīvaṃ arahanto uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭiviratā nīcaseyyaṃ kappenti ",
      " – mañcake vā tiṇasanthārake vā; ahampajja imañca rattiṃ imañca divasaṃ uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭivirato nīcaseyyaṃ kappemi – mañcake vā tiṇasanthārake vā. Imināpaṅgena arahataṃ ",
      " anukaromi; uposatho ca me upavuttho bhavissatī’ti. Iminā aṭṭhamena aṅgena samannāgato hoti."
    ],
    "innerText": "‘‘‘Yāvajīvaṃ arahanto uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭiviratā nīcaseyyaṃ kappenti – mañcake vā tiṇasanthārake vā; ahampajja imañca rattiṃ imañca divasaṃ uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭivirato nīcaseyyaṃ kappemi – mañcake vā tiṇasanthārake vā. Imināpaṅgena arahataṃ anukaromi; uposatho ca me upavuttho bhavissatī’ti. Iminā aṭṭhamena aṅgena samannāgato hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abyāpajjhena (ka.), abyābajjhena (?)]"
      },
      " pharitvā viharati. Iminā navamena aṅgena samannāgato hoti. Evaṃ upavuttho kho, bhikkhave, navahaṅgehi samannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "‘‘Mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena [abyāpajjhena (ka.), abyābajjhena (?)] pharitvā viharati. Iminā navamena aṅgena samannāgato hoti. Evaṃ upavuttho kho, bhikkhave, navahaṅgehi samannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Devatāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ". ‘‘Imañca, bhikkhave, rattiṃ sambahulā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ jetavanaṃ obhāsetvā yenāhaṃ tenupasaṅkamiṃsu; upasaṅkamitvā maṃ abhivādetvā ",
      " ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho, bhikkhave, tā devatā maṃ etadavocuṃ – ‘upasaṅkamiṃsu no, bhante, pubbe manussabhūtānaṃ pabbajitā agārāni. Te mayaṃ, bhante, paccuṭṭhimha, no ca kho abhivādimha. Tā mayaṃ, bhante, aparipuṇṇakammantā vippaṭisāriniyo paccānutāpiniyo hīnaṃ kāyaṃ upapannā’’’ti."
    ],
    "innerText": "19. ‘‘Imañca, bhikkhave, rattiṃ sambahulā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ jetavanaṃ obhāsetvā yenāhaṃ tenupasaṅkamiṃsu; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho, bhikkhave, tā devatā maṃ etadavocuṃ – ‘upasaṅkamiṃsu no, bhante, pubbe manussabhūtānaṃ pabbajitā agārāni. Te mayaṃ, bhante, paccuṭṭhimha, no ca kho abhivādimha. Tā mayaṃ, bhante, aparipuṇṇakammantā vippaṭisāriniyo paccānutāpiniyo hīnaṃ kāyaṃ upapannā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparāpi ",
      " maṃ, bhikkhave, sambahulā devatā upasaṅkamitvā etadavocuṃ – ‘upasaṅkamiṃsu no, bhante, pubbe manussabhūtānaṃ pabbajitā agārāni. Te mayaṃ, bhante, paccuṭṭhimha abhivādimha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paccuṭṭhimha ca abhivādimha ca (syā.)]"
      },
      ", no ca tesaṃ āsanaṃ adamha. Tā mayaṃ, bhante, aparipuṇṇakammantā vippaṭisāriniyo paccānutāpiniyo hīnaṃ kāyaṃ upapannā’’’ti."
    ],
    "innerText": "‘‘Aparāpi maṃ, bhikkhave, sambahulā devatā upasaṅkamitvā etadavocuṃ – ‘upasaṅkamiṃsu no, bhante, pubbe manussabhūtānaṃ pabbajitā agārāni. Te mayaṃ, bhante, paccuṭṭhimha abhivādimha [paccuṭṭhimha ca abhivādimha ca (syā.)], no ca tesaṃ āsanaṃ adamha. Tā mayaṃ, bhante, aparipuṇṇakammantā vippaṭisāriniyo paccānutāpiniyo hīnaṃ kāyaṃ upapannā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparāpi maṃ, bhikkhave, sambahulā devatā upasaṅkamitvā ",
      " etadavocuṃ – ‘upasaṅkamiṃsu no, bhante, pubbe manussabhūtānaṃ pabbajitā agārāni. Te mayaṃ, bhante, paccuṭṭhimha abhivādimha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paccuṭṭhimha ca abhivādimha ca (syā.)]"
      },
      " āsanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āsanañca (sī. syā.)]"
      },
      " adamha, no ca kho yathāsatti yathābalaṃ saṃvibhajimha…pe… yathāsatti yathābalaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathābalaṃ ca (?)]"
      },
      " saṃvibhajimha, no ca kho upanisīdimha dhammassavanāya…pe… upanisīdimha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[upanisīdimha ca (syā.)]"
      },
      " dhammassavanāya, no ca kho ohitasotā dhammaṃ suṇimha…pe… ohitasotā ca dhammaṃ suṇimha, no ca kho sutvā dhammaṃ dhārayimha…pe… sutvā ca dhammaṃ dhārayimha, no ca kho dhātānaṃ dhammānaṃ atthaṃ upaparikkhimha…pe… dhātānañca dhammānaṃ atthaṃ upaparikkhimha, no ca kho atthamaññāya dhammamaññāya dhammānudhammaṃ paṭipajjimha. Tā mayaṃ, bhante, aparipuṇṇakammantā vippaṭisāriniyo paccānutāpiniyo hīnaṃ kāyaṃ upapannā’’’ti."
    ],
    "innerText": "‘‘Aparāpi maṃ, bhikkhave, sambahulā devatā upasaṅkamitvā etadavocuṃ – ‘upasaṅkamiṃsu no, bhante, pubbe manussabhūtānaṃ pabbajitā agārāni. Te mayaṃ, bhante, paccuṭṭhimha abhivādimha [paccuṭṭhimha ca abhivādimha ca (syā.)] āsanaṃ [āsanañca (sī. syā.)] adamha, no ca kho yathāsatti yathābalaṃ saṃvibhajimha…pe… yathāsatti yathābalaṃ [yathābalaṃ ca (?)] saṃvibhajimha, no ca kho upanisīdimha dhammassavanāya…pe… upanisīdimha [upanisīdimha ca (syā.)] dhammassavanāya, no ca kho ohitasotā dhammaṃ suṇimha…pe… ohitasotā ca dhammaṃ suṇimha, no ca kho sutvā dhammaṃ dhārayimha…pe… sutvā ca dhammaṃ dhārayimha, no ca kho dhātānaṃ dhammānaṃ atthaṃ upaparikkhimha…pe… dhātānañca dhammānaṃ atthaṃ upaparikkhimha, no ca kho atthamaññāya dhammamaññāya dhammānudhammaṃ paṭipajjimha. Tā mayaṃ, bhante, aparipuṇṇakammantā vippaṭisāriniyo paccānutāpiniyo hīnaṃ kāyaṃ upapannā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparāpi maṃ, bhikkhave, sambahulā devatā upasaṅkamitvā etadavocuṃ – ‘upasaṅkamiṃsu no, bhante, pubbe manussabhūtānaṃ pabbajitā agārāni. Te mayaṃ, bhante, paccuṭṭhimha abhivādimha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paccuṭṭhimha ca abhivādimha ca (syā.)]"
      },
      ", āsanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āsanañca (sī. syā.)]"
      },
      " adamha, yathāsatti ",
      " yathābalaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathābalaṃ ca (?)]"
      },
      " saṃvibhajimha, upanisīdimha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[upanisīdimha ca (syā.)]"
      },
      " dhammassavanāya, ohitasotā ca dhammaṃ suṇimha, sutvā ca dhammaṃ dhārayimha, dhātānañca dhammānaṃ atthaṃ upaparikkhimha, atthamaññāya dhammamaññāya dhammānudhammaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dhammānudhammañca (?)]"
      },
      " paṭipajjimha. Tā mayaṃ, bhante, paripuṇṇakammantā avippaṭisāriniyo apaccānutāpiniyo paṇītaṃ kāyaṃ upapannā’ti. Etāni, bhikkhave, rukkhamūlāni etāni suññāgārāni. Jhāyatha, bhikkhave, mā pamādattha, mā pacchā vippaṭisārino ahuvattha seyyathāpi tā purimikā devatā’’ti. Navamaṃ."
    ],
    "innerText": "‘‘Aparāpi maṃ, bhikkhave, sambahulā devatā upasaṅkamitvā etadavocuṃ – ‘upasaṅkamiṃsu no, bhante, pubbe manussabhūtānaṃ pabbajitā agārāni. Te mayaṃ, bhante, paccuṭṭhimha abhivādimha [paccuṭṭhimha ca abhivādimha ca (syā.)], āsanaṃ [āsanañca (sī. syā.)] adamha, yathāsatti yathābalaṃ [yathābalaṃ ca (?)] saṃvibhajimha, upanisīdimha [upanisīdimha ca (syā.)] dhammassavanāya, ohitasotā ca dhammaṃ suṇimha, sutvā ca dhammaṃ dhārayimha, dhātānañca dhammānaṃ atthaṃ upaparikkhimha, atthamaññāya dhammamaññāya dhammānudhammaṃ [dhammānudhammañca (?)] paṭipajjimha. Tā mayaṃ, bhante, paripuṇṇakammantā avippaṭisāriniyo apaccānutāpiniyo paṇītaṃ kāyaṃ upapannā’ti. Etāni, bhikkhave, rukkhamūlāni etāni suññāgārāni. Jhāyatha, bhikkhave, mā pamādattha, mā pacchā vippaṭisārino ahuvattha seyyathāpi tā purimikā devatā’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Velāmasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca –"
    ],
    "innerText": "20. Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Api nu te, gahapati, kule dānaṃ dīyatī’’ti? ‘‘Dīyati me, bhante, kule dānaṃ; tañca kho lūkhaṃ kaṇājakaṃ biḷaṅgadutiya’’nti. ‘‘Lūkhañcepi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[lūkhaṃ vāpi (syā.), lūkhañcāpi (ka.)]"
      },
      ", gahapati, dānaṃ deti paṇītaṃ vā; tañca asakkaccaṃ deti, acittīkatvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[acittiṃ katvā (ka.), apacittiṃ katvā (syā.), acittikatvā (pī.)]"
      },
      " deti, asahatthā deti, apaviddhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[apaviṭṭhaṃ (syā.)]"
      },
      " deti, anāgamanadiṭṭhiko deti. Yattha yattha tassa tassa dānassa vipāko nibbattati, na uḷārāya bhattabhogāya cittaṃ namati, na uḷārāya vatthabhogāya cittaṃ namati, na uḷārāya yānabhogāya cittaṃ namati, na uḷāresu pañcasu kāmaguṇesu bhogāya cittaṃ namati. Yepissa te honti ",
      " puttāti vā dārāti vā dāsāti vā pessāti vā kammakarāti vā, tepi na sussūsanti na sotaṃ odahanti na aññā cittaṃ upaṭṭhapenti. Taṃ kissa hetu? Evañhetaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[evañcetaṃ (syā. ka.)]"
      },
      ", gahapati, hoti asakkaccaṃ katānaṃ kammānaṃ vipāko’’."
    ],
    "innerText": "‘‘Api nu te, gahapati, kule dānaṃ dīyatī’’ti? ‘‘Dīyati me, bhante, kule dānaṃ; tañca kho lūkhaṃ kaṇājakaṃ biḷaṅgadutiya’’nti. ‘‘Lūkhañcepi [lūkhaṃ vāpi (syā.), lūkhañcāpi (ka.)], gahapati, dānaṃ deti paṇītaṃ vā; tañca asakkaccaṃ deti, acittīkatvā [acittiṃ katvā (ka.), apacittiṃ katvā (syā.), acittikatvā (pī.)] deti, asahatthā deti, apaviddhaṃ [apaviṭṭhaṃ (syā.)] deti, anāgamanadiṭṭhiko deti. Yattha yattha tassa tassa dānassa vipāko nibbattati, na uḷārāya bhattabhogāya cittaṃ namati, na uḷārāya vatthabhogāya cittaṃ namati, na uḷārāya yānabhogāya cittaṃ namati, na uḷāresu pañcasu kāmaguṇesu bhogāya cittaṃ namati. Yepissa te honti puttāti vā dārāti vā dāsāti vā pessāti vā kammakarāti vā, tepi na sussūsanti na sotaṃ odahanti na aññā cittaṃ upaṭṭhapenti. Taṃ kissa hetu? Evañhetaṃ [evañcetaṃ (syā. ka.)], gahapati, hoti asakkaccaṃ katānaṃ kammānaṃ vipāko’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Lūkhañcepi, gahapati, dānaṃ deti paṇītaṃ vā; tañca sakkaccaṃ deti, cittīkatvā deti, sahatthā deti, anapaviddhaṃ deti, āgamanadiṭṭhiko deti. Yattha yattha tassa tassa dānassa vipāko nibbattati, uḷārāya bhattabhogāya cittaṃ namati, uḷārāya vatthabhogāya cittaṃ namati, uḷārāya yānabhogāya cittaṃ namati, uḷāresu pañcasu kāmaguṇesu bhogāya cittaṃ namati. Yepissa te honti puttāti ",
      " vā dārāti vā dāsāti vā pessāti vā kammakarāti vā, tepi sussūsanti sotaṃ odahanti aññā cittaṃ upaṭṭhapenti. Taṃ kissa hetu? Evañhetaṃ, gahapati, hoti sakkaccaṃ katānaṃ kammānaṃ vipāko."
    ],
    "innerText": "‘‘Lūkhañcepi, gahapati, dānaṃ deti paṇītaṃ vā; tañca sakkaccaṃ deti, cittīkatvā deti, sahatthā deti, anapaviddhaṃ deti, āgamanadiṭṭhiko deti. Yattha yattha tassa tassa dānassa vipāko nibbattati, uḷārāya bhattabhogāya cittaṃ namati, uḷārāya vatthabhogāya cittaṃ namati, uḷārāya yānabhogāya cittaṃ namati, uḷāresu pañcasu kāmaguṇesu bhogāya cittaṃ namati. Yepissa te honti puttāti vā dārāti vā dāsāti vā pessāti vā kammakarāti vā, tepi sussūsanti sotaṃ odahanti aññā cittaṃ upaṭṭhapenti. Taṃ kissa hetu? Evañhetaṃ, gahapati, hoti sakkaccaṃ katānaṃ kammānaṃ vipāko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhūtapubbaṃ, gahapati, velāmo nāma brāhmaṇo ahosi. So evarūpaṃ dānaṃ adāsi mahādānaṃ. Caturāsīti suvaṇṇapātisahassāni adāsi rūpiyapūrāni ",
      ", caturāsīti rūpiyapātisahassāni adāsi suvaṇṇapūrāni, caturāsīti kaṃsapātisahassāni adāsi hiraññapūrāni ",
      ", caturāsīti hatthisahassāni adāsi sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālappaṭicchannāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[hemajālasañchannāni (sī. pī.)]"
      },
      ", caturāsīti rathasahassāni adāsi sīhacammaparivārāni byagghacammaparivārāni dīpicammaparivārāni paṇḍukambalaparivārāni sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālappaṭicchannāni, caturāsīti dhenusahassāni adāsi dukūlasandhanāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dukūlasandassanāni (sī.), dukūlasaṇṭhanāni (syā.), dukūlasanthanāni (pī.), duhasandanāni (dī. ni. 2.263), dukūlasandanāni (tattha pāṭhantaraṃ)]"
      },
      " kaṃsūpadhāraṇāni, caturāsīti kaññāsahassāni adāsi āmuttamaṇikuṇḍalāyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āmukkamaṇikuṇḍalāyo (?)]"
      },
      ", caturāsīti pallaṅkasahassāni adāsi gonakatthatāni ",
      " paṭikatthatāni paṭalikatthatāni kadalimigapavarapaccattharaṇāni sauttaracchadāni ubhatolohitakūpadhānāni, caturāsīti vatthakoṭisahassāni adāsi khomasukhumānaṃ koseyyasukhumānaṃ kambalasukhumānaṃ kappāsikasukhumānaṃ, ko pana vādo annassa pānassa khajjassa bhojjassa leyyassa peyyassa, najjo maññe vissandanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vissandati (sī. pī.)]"
      },
      "."
    ],
    "innerText": "‘‘Bhūtapubbaṃ, gahapati, velāmo nāma brāhmaṇo ahosi. So evarūpaṃ dānaṃ adāsi mahādānaṃ. Caturāsīti suvaṇṇapātisahassāni adāsi rūpiyapūrāni , caturāsīti rūpiyapātisahassāni adāsi suvaṇṇapūrāni, caturāsīti kaṃsapātisahassāni adāsi hiraññapūrāni , caturāsīti hatthisahassāni adāsi sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālappaṭicchannāni [hemajālasañchannāni (sī. pī.)], caturāsīti rathasahassāni adāsi sīhacammaparivārāni byagghacammaparivārāni dīpicammaparivārāni paṇḍukambalaparivārāni sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālappaṭicchannāni, caturāsīti dhenusahassāni adāsi dukūlasandhanāni [dukūlasandassanāni (sī.), dukūlasaṇṭhanāni (syā.), dukūlasanthanāni (pī.), duhasandanāni (dī. ni. 2.263), dukūlasandanāni (tattha pāṭhantaraṃ)] kaṃsūpadhāraṇāni, caturāsīti kaññāsahassāni adāsi āmuttamaṇikuṇḍalāyo [āmukkamaṇikuṇḍalāyo (?)], caturāsīti pallaṅkasahassāni adāsi gonakatthatāni paṭikatthatāni paṭalikatthatāni kadalimigapavarapaccattharaṇāni sauttaracchadāni ubhatolohitakūpadhānāni, caturāsīti vatthakoṭisahassāni adāsi khomasukhumānaṃ koseyyasukhumānaṃ kambalasukhumānaṃ kappāsikasukhumānaṃ, ko pana vādo annassa pānassa khajjassa bhojjassa leyyassa peyyassa, najjo maññe vissandanti [vissandati (sī. pī.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Siyā kho pana te, gahapati, evamassa – ‘añño nūna tena samayena velāmo brāhmaṇo ahosi, so ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yo (?)]"
      },
      " taṃ dānaṃ adāsi mahādāna’nti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Ahaṃ tena samayena velāmo brāhmaṇo ",
      " ahosiṃ. Ahaṃ taṃ dānaṃ adāsiṃ mahādānaṃ. Tasmiṃ kho pana, gahapati, dāne na koci dakkhiṇeyyo ahosi, na taṃ koci dakkhiṇaṃ visodheti."
    ],
    "innerText": "‘‘Siyā kho pana te, gahapati, evamassa – ‘añño nūna tena samayena velāmo brāhmaṇo ahosi, so [yo (?)] taṃ dānaṃ adāsi mahādāna’nti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Ahaṃ tena samayena velāmo brāhmaṇo ahosiṃ. Ahaṃ taṃ dānaṃ adāsiṃ mahādānaṃ. Tasmiṃ kho pana, gahapati, dāne na koci dakkhiṇeyyo ahosi, na taṃ koci dakkhiṇaṃ visodheti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yaṃ, gahapati, velāmo brāhmaṇo dānaṃ adāsi mahādānaṃ, yo cekaṃ diṭṭhisampannaṃ bhojeyya, idaṃ tato mahapphalataraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "( ) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[(yañca gahapati velāmo brāhmaṇo dānaṃ adāsi mahādānaṃ) (sī. pī.)]"
      },
      " ‘‘Yo ca sataṃ diṭṭhisampannānaṃ bhojeyya, yo cekaṃ sakadāgāmiṃ bhojeyya, idaṃ tato mahapphalataraṃ."
    ],
    "innerText": "( ) [(yañca gahapati velāmo brāhmaṇo dānaṃ adāsi mahādānaṃ) (sī. pī.)] ‘‘Yo ca sataṃ diṭṭhisampannānaṃ bhojeyya, yo cekaṃ sakadāgāmiṃ bhojeyya, idaṃ tato mahapphalataraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "( ) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[(yañca gahapati velāmo brāhmaṇo dānaṃ adāsi mahādānaṃ) (sī. pī.)]"
      },
      " ‘‘Yo ca sataṃ sakadāgāmīnaṃ bhojeyya, yo cekaṃ anāgāmiṃ bhojeyya…pe… yo ca sataṃ anāgāmīnaṃ bhojeyya, yo cekaṃ ",
      " arahantaṃ bhojeyya… yo ca sataṃ arahantānaṃ bhojeyya, yo cekaṃ paccekabuddhaṃ bhojeyya ",
      "… yo ca sataṃ paccekabuddhānaṃ bhojeyya, yo ca tathāgataṃ arahantaṃ sammāsambuddhaṃ bhojeyya… yo ca buddhappamukhaṃ bhikkhusaṅghaṃ bhojeyya… yo ca cātuddisaṃ saṅghaṃ uddissa vihāraṃ kārāpeyya… yo ca pasannacitto buddhañca dhammañca saṅghañca saraṇaṃ gaccheyya… yo ca pasannacitto sikkhāpadāni samādiyeyya – pāṇātipātā veramaṇiṃ, adinnādānā ",
      " veramaṇiṃ, kāmesumicchācārā veramaṇiṃ, musāvādā veramaṇiṃ, surāmerayamajjapamādaṭṭhānā veramaṇiṃ, yo ca antamaso gandhohanamattampi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gandhūhanamattampi (sī.), gaddūhanamattampi (syā. pī.) ma. ni. 3.211]"
      },
      " mettacittaṃ bhāveyya, ( ) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[(yo ca accharāsaṅghātamattampi aniccasaññaṃ bhāveyya) (ka.)]"
      },
      " idaṃ tato mahapphalataraṃ."
    ],
    "innerText": "( ) [(yañca gahapati velāmo brāhmaṇo dānaṃ adāsi mahādānaṃ) (sī. pī.)] ‘‘Yo ca sataṃ sakadāgāmīnaṃ bhojeyya, yo cekaṃ anāgāmiṃ bhojeyya…pe… yo ca sataṃ anāgāmīnaṃ bhojeyya, yo cekaṃ arahantaṃ bhojeyya… yo ca sataṃ arahantānaṃ bhojeyya, yo cekaṃ paccekabuddhaṃ bhojeyya … yo ca sataṃ paccekabuddhānaṃ bhojeyya, yo ca tathāgataṃ arahantaṃ sammāsambuddhaṃ bhojeyya… yo ca buddhappamukhaṃ bhikkhusaṅghaṃ bhojeyya… yo ca cātuddisaṃ saṅghaṃ uddissa vihāraṃ kārāpeyya… yo ca pasannacitto buddhañca dhammañca saṅghañca saraṇaṃ gaccheyya… yo ca pasannacitto sikkhāpadāni samādiyeyya – pāṇātipātā veramaṇiṃ, adinnādānā veramaṇiṃ, kāmesumicchācārā veramaṇiṃ, musāvādā veramaṇiṃ, surāmerayamajjapamādaṭṭhānā veramaṇiṃ, yo ca antamaso gandhohanamattampi [gandhūhanamattampi (sī.), gaddūhanamattampi (syā. pī.) ma. ni. 3.211] mettacittaṃ bhāveyya, ( ) [(yo ca accharāsaṅghātamattampi aniccasaññaṃ bhāveyya) (ka.)] idaṃ tato mahapphalataraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yañca, gahapati, velāmo brāhmaṇo dānaṃ adāsi mahādānaṃ, yo cekaṃ diṭṭhisampannaṃ bhojeyya… yo ca sataṃ diṭṭhisampannānaṃ bhojeyya, yo cekaṃ sakadāgāmiṃ bhojeyya… yo ca sataṃ sakadāgāmīnaṃ bhojeyya, yo ",
      " cekaṃ anāgāmiṃ bhojeyya… yo ca sataṃ anāgāmīnaṃ bhojeyya, yo cekaṃ arahantaṃ bhojeyya… yo ca sataṃ arahantānaṃ bhojeyya, yo cekaṃ paccekabuddhaṃ bhojeyya… yo ca sataṃ paccekabuddhānaṃ bhojeyya, yo ca tathāgataṃ arahantaṃ sammāsambuddhaṃ bhojeyya… yo ca buddhappamukhaṃ bhikkhusaṅghaṃ bhojeyya, yo ca cātuddisaṃ saṅghaṃ uddissa vihāraṃ kārāpeyya… yo ca pasannacitto buddhañca dhammañca saṅghañca saraṇaṃ gaccheyya, yo ca pasannacitto sikkhāpadāni samādiyeyya – pāṇātipātā veramaṇiṃ… surāmerayamajjapamādaṭṭhānā veramaṇiṃ, yo ca antamaso gandhohanamattampi mettacittaṃ bhāveyya ",
      ", yo ca accharāsaṅghātamattampi aniccasaññaṃ bhāveyya, idaṃ tato mahapphalatara’’nti. Dasamaṃ."
    ],
    "innerText": "‘‘Yañca, gahapati, velāmo brāhmaṇo dānaṃ adāsi mahādānaṃ, yo cekaṃ diṭṭhisampannaṃ bhojeyya… yo ca sataṃ diṭṭhisampannānaṃ bhojeyya, yo cekaṃ sakadāgāmiṃ bhojeyya… yo ca sataṃ sakadāgāmīnaṃ bhojeyya, yo cekaṃ anāgāmiṃ bhojeyya… yo ca sataṃ anāgāmīnaṃ bhojeyya, yo cekaṃ arahantaṃ bhojeyya… yo ca sataṃ arahantānaṃ bhojeyya, yo cekaṃ paccekabuddhaṃ bhojeyya… yo ca sataṃ paccekabuddhānaṃ bhojeyya, yo ca tathāgataṃ arahantaṃ sammāsambuddhaṃ bhojeyya… yo ca buddhappamukhaṃ bhikkhusaṅghaṃ bhojeyya, yo ca cātuddisaṃ saṅghaṃ uddissa vihāraṃ kārāpeyya… yo ca pasannacitto buddhañca dhammañca saṅghañca saraṇaṃ gaccheyya, yo ca pasannacitto sikkhāpadāni samādiyeyya – pāṇātipātā veramaṇiṃ… surāmerayamajjapamādaṭṭhānā veramaṇiṃ, yo ca antamaso gandhohanamattampi mettacittaṃ bhāveyya , yo ca accharāsaṅghātamattampi aniccasaññaṃ bhāveyya, idaṃ tato mahapphalatara’’nti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sīhanādavaggo dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nādo saupādiseso ca, koṭṭhikena samiddhinā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gaṇḍasaññā kulaṃ mettā, devatā velāmena cāti."
  }
]