[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "1. Rūpādivaggavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nidānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vibhāgavantānaṃ ",
      " sabhāvavibhāvanaṃ vibhāgadassanavaseneva hotīti paṭhamaṃ tāva nipātasuttavasena vibhāgaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tattha aṅguttarāgamo nāmā’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatthā"
      },
      "ti ‘‘aṅguttarāgamassa atthaṃ pakāsayissāmī’’ti yadidaṃ vuttaṃ, tasmiṃ vacane, ‘‘yassa atthaṃ pakāsayissāmī’’ti paṭiññātaṃ, so aṅguttarāgamo nāma nipātasuttavasena evaṃ vibhāgoti attho. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatthā"
      },
      "ti ‘‘aṅguttaranissitaṃ attha’’nti etasmiṃ vacane yo aṅguttarāgamo vutto, so nipātasuttādivasena edisoti attho."
    ],
    "innerText": "Vibhāgavantānaṃ sabhāvavibhāvanaṃ vibhāgadassanavaseneva hotīti paṭhamaṃ tāva nipātasuttavasena vibhāgaṃ dassetuṃ ‘‘tattha aṅguttarāgamo nāmā’’tiādimāha. Tattha tatthāti ‘‘aṅguttarāgamassa atthaṃ pakāsayissāmī’’ti yadidaṃ vuttaṃ, tasmiṃ vacane, ‘‘yassa atthaṃ pakāsayissāmī’’ti paṭiññātaṃ, so aṅguttarāgamo nāma nipātasuttavasena evaṃ vibhāgoti attho. Atha vā tatthāti ‘‘aṅguttaranissitaṃ attha’’nti etasmiṃ vacane yo aṅguttarāgamo vutto, so nipātasuttādivasena edisoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni taṃ ādito paṭṭhāya saṃvaṇṇitukāmo attano saṃvaṇṇanāya paṭhamamahāsaṅgītiyaṃ nikkhittānukkamena pavattabhāvadassanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tassa nipātesu…pe… vuttaṃ nidānamādī’’"
      },
      "tiādimāha. Tattha yathāpaccayaṃ tattha tattha desitattā paññattattā ca vippakiṇṇānaṃ dhammavinayānaṃ saṅgahetvā gāyanaṃ kathanaṃ saṅgīti. Etena taṃtaṃsikkhāpadānaṃ suttānañca ādipariyosānesu ",
      " antarantarā ca sambandhavasena ṭhapitaṃ saṅgītikāravacanaṃ saṅgahitaṃ hoti. Saṅgīyamānassa atthassa mahantatāya pūjanīyatāya ca mahatī saṅgīti mahāsaṅgīti, paṭhamā mahāsaṅgīti paṭhamamahāsaṅgīti, tassā pavattikālo paṭhamamahāsaṅgītikālo, tasmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭhamamahāsaṅgītikāle"
      },
      ". Nidadāti desanaṃ desakālādivasena aviditaṃ viditaṃ katvā nidassetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nidānaṃ"
      },
      ". Yo lokiyehi upogghātoti vuccati, svāyamettha ‘‘evaṃ me suta’’ntiādiko gantho veditabbo. Na ‘‘sanidānāhaṃ, bhikkhave, dhammaṃ desemī’’tiādīsu (a. ni. 3.126) viya ajjhāsayādidesanuppattihetu. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evaṃ me sutantiādikaṃ āyasmatā ānandena paṭhamamahāsaṅgītikāle vuttaṃ nidānamādī’’"
      },
      "ti."
    ],
    "innerText": "Idāni taṃ ādito paṭṭhāya saṃvaṇṇitukāmo attano saṃvaṇṇanāya paṭhamamahāsaṅgītiyaṃ nikkhittānukkamena pavattabhāvadassanatthaṃ ‘‘tassa nipātesu…pe… vuttaṃ nidānamādī’’tiādimāha. Tattha yathāpaccayaṃ tattha tattha desitattā paññattattā ca vippakiṇṇānaṃ dhammavinayānaṃ saṅgahetvā gāyanaṃ kathanaṃ saṅgīti. Etena taṃtaṃsikkhāpadānaṃ suttānañca ādipariyosānesu antarantarā ca sambandhavasena ṭhapitaṃ saṅgītikāravacanaṃ saṅgahitaṃ hoti. Saṅgīyamānassa atthassa mahantatāya pūjanīyatāya ca mahatī saṅgīti mahāsaṅgīti, paṭhamā mahāsaṅgīti paṭhamamahāsaṅgīti, tassā pavattikālo paṭhamamahāsaṅgītikālo, tasmiṃ paṭhamamahāsaṅgītikāle. Nidadāti desanaṃ desakālādivasena aviditaṃ viditaṃ katvā nidassetīti nidānaṃ. Yo lokiyehi upogghātoti vuccati, svāyamettha ‘‘evaṃ me suta’’ntiādiko gantho veditabbo. Na ‘‘sanidānāhaṃ, bhikkhave, dhammaṃ desemī’’tiādīsu (a. ni. 3.126) viya ajjhāsayādidesanuppattihetu. Tenevāha – ‘‘evaṃ me sutantiādikaṃ āyasmatā ānandena paṭhamamahāsaṅgītikāle vuttaṃ nidānamādī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". ‘‘Sā panesā’’tiādinā bāhiranidāne vattabbaṃ atidisitvā idāni abbhantaranidānaṃ ādito paṭṭhāya saṃvaṇṇituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yaṃ paneta’’"
      },
      "nti vuttaṃ. Tattha yasmā saṃvaṇṇanaṃ karontena saṃvaṇṇetabbe dhamme padāni padavibhāgaṃ tadatthañca dassetvā tato paraṃ piṇḍatthādinidassanavasena ca saṃvaṇṇanā kātabbā, tasmā padāni tāva dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evanti nipātapada’’"
      },
      "ntiādimāha ",
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padavibhāgo"
      },
      "ti padānaṃ viseso, na padaviggaho. Atha vā padāni ca padavibhāgo ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padavibhāgo,"
      },
      " padaviggaho ca padavibhāgo ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padavibhāgo"
      },
      "ti vā ekasesavasena padapadaviggahā padavibhāgasaddena vuttāti veditabbaṃ. Tattha padaviggaho ‘‘jetassa vanaṃ jetavana’’ntiādinā samāsapadesu daṭṭhabbo."
    ],
    "innerText": "1. ‘‘Sā panesā’’tiādinā bāhiranidāne vattabbaṃ atidisitvā idāni abbhantaranidānaṃ ādito paṭṭhāya saṃvaṇṇituṃ ‘‘yaṃ paneta’’nti vuttaṃ. Tattha yasmā saṃvaṇṇanaṃ karontena saṃvaṇṇetabbe dhamme padāni padavibhāgaṃ tadatthañca dassetvā tato paraṃ piṇḍatthādinidassanavasena ca saṃvaṇṇanā kātabbā, tasmā padāni tāva dassento ‘‘evanti nipātapada’’ntiādimāha . Tattha padavibhāgoti padānaṃ viseso, na padaviggaho. Atha vā padāni ca padavibhāgo ca padavibhāgo, padaviggaho ca padavibhāgo ca padavibhāgoti vā ekasesavasena padapadaviggahā padavibhāgasaddena vuttāti veditabbaṃ. Tattha padaviggaho ‘‘jetassa vanaṃ jetavana’’ntiādinā samāsapadesu daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthato"
      },
      "ti padatthato. Taṃ pana padatthaṃ atthuddhārakkamena paṭhamaṃ evaṃ-saddassa dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evaṃ-saddo tāvā’’"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avadhāraṇādī"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena idamatthapucchāparimāṇādiatthānaṃ saṅgaho daṭṭhabbo. Tathā hi ‘‘evaṃgatāni puthusippāyatanāni, evamādīnī’’tiādīsu idaṃ-saddassa atthe evaṃ-saddo. Gata-saddo hi pakārapariyāyo, tathā vidhākāra-saddā ca. Tathā hi vidhayuttagatasadde lokiyā pakāratthe vadanti. ‘‘Evaṃ su te sunhātā suvilittā kappitakesamassū āmukkamaṇikuṇḍalābharaṇā odātavatthavasanā pañcahi kāmaguṇehi samappitā samaṅgībhūtā paricārenti seyyathāpi tvaṃ etarahi ",
      " sācariyakoti. No hidaṃ, bho gotamā’’tiādīsu (dī. ni. 1.286) pucchāyaṃ. ‘‘Evaṃ lahuparivattaṃ (a. ni. 1.48), evamāyupariyanto’’ti (dī. ni. 1.244; pārā. 12) ca ādīsu parimāṇe."
    ],
    "innerText": "Atthatoti padatthato. Taṃ pana padatthaṃ atthuddhārakkamena paṭhamaṃ evaṃ-saddassa dassento ‘‘evaṃ-saddo tāvā’’tiādimāha. Avadhāraṇādīti ettha ādi-saddena idamatthapucchāparimāṇādiatthānaṃ saṅgaho daṭṭhabbo. Tathā hi ‘‘evaṃgatāni puthusippāyatanāni, evamādīnī’’tiādīsu idaṃ-saddassa atthe evaṃ-saddo. Gata-saddo hi pakārapariyāyo, tathā vidhākāra-saddā ca. Tathā hi vidhayuttagatasadde lokiyā pakāratthe vadanti. ‘‘Evaṃ su te sunhātā suvilittā kappitakesamassū āmukkamaṇikuṇḍalābharaṇā odātavatthavasanā pañcahi kāmaguṇehi samappitā samaṅgībhūtā paricārenti seyyathāpi tvaṃ etarahi sācariyakoti. No hidaṃ, bho gotamā’’tiādīsu (dī. ni. 1.286) pucchāyaṃ. ‘‘Evaṃ lahuparivattaṃ (a. ni. 1.48), evamāyupariyanto’’ti (dī. ni. 1.244; pārā. 12) ca ādīsu parimāṇe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nanu ca ‘‘evaṃ su te sunhātā suvilittā evamāyupariyanto’’ti ettha evaṃ-saddena pucchanākāraparimāṇākārānaṃ vuttattā ākārattho eva evaṃ-saddoti? Na, visesasabbhāvato. Ākāramattavācako hi evaṃ-saddo ākāratthoti adhippeto yathā ‘‘evaṃ byākho’’tiādīsu (ma. ni. 1.234; pāci. 417; cūḷava. 65), na pana ākāravisesavācako. Evañca katvā ‘‘evaṃ jātena maccenā’’tiādīni (dha. pa. 53) upamādiudāharaṇāni upapannāni honti. Tathā hi ‘‘yathā hi…pe… bahu’’nti (dha. pa. 53) ettha puppharāsiṭṭhāniyato manussūpapattisappurisūpanissayasaddhammassavanayonisomanasikārabhogasampatti- ādidānādipuññakiriyāhetusamudāyato sobhāsugandhatādiguṇayogato mālāguṇasadisiyo pahūtā puññakiriyā maritabbasabhāvatāya maccena sattena kattabbāti jotitattā puppharāsimālāguṇāva upamā. Tesaṃ upamākāro yathā-saddena aniyamato vuttoti ‘‘evaṃ-saddo upamākāranigamanattho’’ti vattuṃ yuttaṃ, so pana upamākāro niyamiyamāno atthato upamāva hotīti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘upamāyaṃ āgato’’"
      },
      "ti. Tathā ‘‘evaṃ iminā ākārena abhikkamitabba’’ntiādinā upadisiyamānāya samaṇasāruppāya ākappasampattiyā yo tattha upadisanākāro, so atthato upadeso evāti vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evaṃ te…pe… upadese’’"
      },
      "ti. Tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "evametaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhagavā, evametaṃ sugatā"
      },
      "ti ettha bhagavatā yathāvuttamatthaṃ aviparītato jānantehi kataṃ tattha saṃvijjamānaguṇānaṃ pakārehi haṃsanaṃ udaggatākaraṇaṃ sampahaṃsanaṃ, yo tattha sampahaṃsanākāroti yojetabbaṃ."
    ],
    "innerText": "Nanu ca ‘‘evaṃ su te sunhātā suvilittā evamāyupariyanto’’ti ettha evaṃ-saddena pucchanākāraparimāṇākārānaṃ vuttattā ākārattho eva evaṃ-saddoti? Na, visesasabbhāvato. Ākāramattavācako hi evaṃ-saddo ākāratthoti adhippeto yathā ‘‘evaṃ byākho’’tiādīsu (ma. ni. 1.234; pāci. 417; cūḷava. 65), na pana ākāravisesavācako. Evañca katvā ‘‘evaṃ jātena maccenā’’tiādīni (dha. pa. 53) upamādiudāharaṇāni upapannāni honti. Tathā hi ‘‘yathā hi…pe… bahu’’nti (dha. pa. 53) ettha puppharāsiṭṭhāniyato manussūpapattisappurisūpanissayasaddhammassavanayonisomanasikārabhogasampatti- ādidānādipuññakiriyāhetusamudāyato sobhāsugandhatādiguṇayogato mālāguṇasadisiyo pahūtā puññakiriyā maritabbasabhāvatāya maccena sattena kattabbāti jotitattā puppharāsimālāguṇāva upamā. Tesaṃ upamākāro yathā-saddena aniyamato vuttoti ‘‘evaṃ-saddo upamākāranigamanattho’’ti vattuṃ yuttaṃ, so pana upamākāro niyamiyamāno atthato upamāva hotīti āha – ‘‘upamāyaṃ āgato’’ti. Tathā ‘‘evaṃ iminā ākārena abhikkamitabba’’ntiādinā upadisiyamānāya samaṇasāruppāya ākappasampattiyā yo tattha upadisanākāro, so atthato upadeso evāti vuttaṃ – ‘‘evaṃ te…pe… upadese’’ti. Tathā evametaṃbhagavā, evametaṃ sugatāti ettha bhagavatā yathāvuttamatthaṃ aviparītato jānantehi kataṃ tattha saṃvijjamānaguṇānaṃ pakārehi haṃsanaṃ udaggatākaraṇaṃ sampahaṃsanaṃ, yo tattha sampahaṃsanākāroti yojetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evamevaṃ panāya"
      },
      "nti ettha garahaṇākāroti yojetabbaṃ, so ca garahaṇākāro ‘‘vasalī’’tiādikhuṃsanasaddasannidhānato idha evaṃ-saddena pakāsitoti viññāyati. Yathā cettha, evaṃ upamākārādayopi upamādivasena vuttānaṃ puppharāsiādisaddānaṃ sannidhānatoti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ, bhanteti kho"
      },
      "tiādīsu pana dhammassa sādhukaṃ savanamanasikārena niyojitehi bhikkhūhi attano tattha ṭhitabhāvassa paṭijānanavasena vuttattā ",
      " ettha evaṃ-saddo vacanasampaṭicchanattho vutto, tena ‘‘evaṃ, bhante, sādhu bhante, suṭṭhu bhante’’ti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evañca vadehī"
      },
      "ti ‘‘yathāhaṃ vadāmi, evaṃ samaṇaṃ ānandaṃ vadehī’’ti vadanākāro idāni vattabbo evaṃ-saddena nidassīyatīti nidassanattho vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ no"
      },
      "ti etthāpi tesaṃ yathāvuttadhammānaṃ ahitadukkhāvahabhāve sanniṭṭhānajananatthaṃ anumatiggahaṇavasena ‘‘no vā, kathaṃ vo ettha hotī’’ti pucchāya katāya ‘‘evaṃ no ettha hotī’’ti vuttattā tadākārasanniṭṭhānaṃ evaṃ-saddena vibhāvitanti viññāyati. So pana tesaṃ dhammānaṃ ahitāya dukkhāya saṃvattanākāro niyamiyamāno avadhāraṇattho hotīti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evaṃ no ettha hotītiādīsu avadhāraṇe’’"
      },
      "ti."
    ],
    "innerText": "Evamevaṃ panāyanti ettha garahaṇākāroti yojetabbaṃ, so ca garahaṇākāro ‘‘vasalī’’tiādikhuṃsanasaddasannidhānato idha evaṃ-saddena pakāsitoti viññāyati. Yathā cettha, evaṃ upamākārādayopi upamādivasena vuttānaṃ puppharāsiādisaddānaṃ sannidhānatoti daṭṭhabbaṃ. Evaṃ, bhanteti khotiādīsu pana dhammassa sādhukaṃ savanamanasikārena niyojitehi bhikkhūhi attano tattha ṭhitabhāvassa paṭijānanavasena vuttattā ettha evaṃ-saddo vacanasampaṭicchanattho vutto, tena ‘‘evaṃ, bhante, sādhu bhante, suṭṭhu bhante’’ti vuttaṃ hoti. Evañca vadehīti ‘‘yathāhaṃ vadāmi, evaṃ samaṇaṃ ānandaṃ vadehī’’ti vadanākāro idāni vattabbo evaṃ-saddena nidassīyatīti nidassanattho vutto. Evaṃ noti etthāpi tesaṃ yathāvuttadhammānaṃ ahitadukkhāvahabhāve sanniṭṭhānajananatthaṃ anumatiggahaṇavasena ‘‘no vā, kathaṃ vo ettha hotī’’ti pucchāya katāya ‘‘evaṃ no ettha hotī’’ti vuttattā tadākārasanniṭṭhānaṃ evaṃ-saddena vibhāvitanti viññāyati. So pana tesaṃ dhammānaṃ ahitāya dukkhāya saṃvattanākāro niyamiyamāno avadhāraṇattho hotīti āha – ‘‘evaṃ no ettha hotītiādīsu avadhāraṇe’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānānayanipuṇa"
      },
      "nti ekattanānattaabyāpāraevaṃdhammatāsaṅkhātā, nandiyāvaṭṭatipukkhalasīhavikkīḷitaaṅkusadisālocanasaṅkhātā vā ādhārādibhedavasena nānāvidhā nayā nānānayā. Nayā vā pāḷigatiyo, tā ca paññattiādivasena saṃkilesabhāgiyādilokiyāditadubhayavomissakatādivasena kusalādivasena khandhādivasena saṅgahādivasena samayavimuttādivasena padhānādivasena kusalamūlādivasena tikapaṭṭhānādivasena ca nānappakārāti nānānayā, tehi nipuṇaṃ saṇhaṃ sukhumanti nānānayanipuṇaṃ. Āsayova ajjhāsayo, te ca sassatādibhedena tattha ca apparajakkhatādibhedena ca aneke, attajjhāsayādayo eva vā samuṭṭhānaṃ uppattihetu etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anekajjhāsayasamuṭṭhānaṃ. Atthabyañjanasampanna"
      },
      "nti atthabyañjanaparipuṇṇaṃ upanetabbābhāvato. Saṅkāsanapakāsanavivaraṇavibhajanauttānīkaraṇapaññattivasena chahi atthapadehi akkharapadabyañjanākāraniruttiniddesavasena chahi byañjanapadehi ca samannāgatanti vā attho daṭṭhabbo."
    ],
    "innerText": "Nānānayanipuṇanti ekattanānattaabyāpāraevaṃdhammatāsaṅkhātā, nandiyāvaṭṭatipukkhalasīhavikkīḷitaaṅkusadisālocanasaṅkhātā vā ādhārādibhedavasena nānāvidhā nayā nānānayā. Nayā vā pāḷigatiyo, tā ca paññattiādivasena saṃkilesabhāgiyādilokiyāditadubhayavomissakatādivasena kusalādivasena khandhādivasena saṅgahādivasena samayavimuttādivasena padhānādivasena kusalamūlādivasena tikapaṭṭhānādivasena ca nānappakārāti nānānayā, tehi nipuṇaṃ saṇhaṃ sukhumanti nānānayanipuṇaṃ. Āsayova ajjhāsayo, te ca sassatādibhedena tattha ca apparajakkhatādibhedena ca aneke, attajjhāsayādayo eva vā samuṭṭhānaṃ uppattihetu etassāti anekajjhāsayasamuṭṭhānaṃ. Atthabyañjanasampannanti atthabyañjanaparipuṇṇaṃ upanetabbābhāvato. Saṅkāsanapakāsanavivaraṇavibhajanauttānīkaraṇapaññattivasena chahi atthapadehi akkharapadabyañjanākāraniruttiniddesavasena chahi byañjanapadehi ca samannāgatanti vā attho daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vividhapāṭihāriya"
      },
      "nti ettha pāṭihāriyapadassa vacanatthaṃ ‘‘paṭipakkhaharaṇato rāgādikilesāpanayanato ca pāṭihāriya’’nti vadanti. Bhagavato pana paṭipakkhā rāgādayo na santi ",
      ", ye haritabbā. Puthujjanānampi vigatūpakkilese aṭṭhaguṇasamannāgate citte hatapaṭipakkhe iddhividhaṃ pavattati, tasmā tattha pavattavohārena ca na sakkā idha ‘‘pāṭihāriya’’nti vatthuṃ. Sace pana mahākāruṇikassa bhagavato veneyyagatā ca kilesā ",
      " paṭipakkhā, tesaṃ haraṇato ‘‘pāṭihāriya’’nti vuttaṃ, evaṃ sati yuttametaṃ. Atha vā bhagavato ca sāsanassa ca paṭipakkhā titthiyā, tesaṃ haraṇato pāṭihāriyaṃ. Te hi diṭṭhiharaṇavasena ca diṭṭhippakāsane asamatthabhāvena ca iddhiādesanānusāsanīhi haritā apanītā hontīti. ‘‘Paṭī’’ti vā ayaṃ saddo ‘‘pacchā’’ti etassa atthaṃ bodheti ‘‘tasmiṃ paṭipaviṭṭhamhi, añño āgañchi brāhmaṇo’’tiādīsu (su. ni. 985; cūḷani. pārāyanavaggo, vatthugāthā 4) viya, tasmā samāhite citte vigatūpakkilese katakiccena pacchā haritabbaṃ pavattetabbanti paṭihāriyaṃ, attano vā upakkilesesu catutthajjhānamaggehi haritesu pacchā haraṇaṃ paṭihāriyaṃ, iddhiādesanānusāsaniyo ca vigatūpakkilesena katakiccena ca sattahitatthaṃ puna pavattetabbā, haritesu ca attano upakkilesesu parasattānaṃ upakkilesaharaṇāni hontīti paṭihāriyāni bhavanti. Paṭihāriyameva pāṭihāriyaṃ, paṭihāriye vā iddhiādesanānusāsanisamudāye bhavaṃ ekamekaṃ pāṭihāriyanti vuccati. Paṭihāriyaṃ vā catutthajjhānaṃ maggo ca paṭipakkhaharaṇato, tattha jātaṃ, tasmiṃ vā nimittabhūte, tato vā āgatanti pāṭihāriyaṃ. Tassa pana iddhiādibhedena visayabhedena ca bahuvidhassa bhagavato desanāyaṃ labbhamānattā āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vividhapāṭihāriya’’"
      },
      "nti."
    ],
    "innerText": "Vividhapāṭihāriyanti ettha pāṭihāriyapadassa vacanatthaṃ ‘‘paṭipakkhaharaṇato rāgādikilesāpanayanato ca pāṭihāriya’’nti vadanti. Bhagavato pana paṭipakkhā rāgādayo na santi , ye haritabbā. Puthujjanānampi vigatūpakkilese aṭṭhaguṇasamannāgate citte hatapaṭipakkhe iddhividhaṃ pavattati, tasmā tattha pavattavohārena ca na sakkā idha ‘‘pāṭihāriya’’nti vatthuṃ. Sace pana mahākāruṇikassa bhagavato veneyyagatā ca kilesā paṭipakkhā, tesaṃ haraṇato ‘‘pāṭihāriya’’nti vuttaṃ, evaṃ sati yuttametaṃ. Atha vā bhagavato ca sāsanassa ca paṭipakkhā titthiyā, tesaṃ haraṇato pāṭihāriyaṃ. Te hi diṭṭhiharaṇavasena ca diṭṭhippakāsane asamatthabhāvena ca iddhiādesanānusāsanīhi haritā apanītā hontīti. ‘‘Paṭī’’ti vā ayaṃ saddo ‘‘pacchā’’ti etassa atthaṃ bodheti ‘‘tasmiṃ paṭipaviṭṭhamhi, añño āgañchi brāhmaṇo’’tiādīsu (su. ni. 985; cūḷani. pārāyanavaggo, vatthugāthā 4) viya, tasmā samāhite citte vigatūpakkilese katakiccena pacchā haritabbaṃ pavattetabbanti paṭihāriyaṃ, attano vā upakkilesesu catutthajjhānamaggehi haritesu pacchā haraṇaṃ paṭihāriyaṃ, iddhiādesanānusāsaniyo ca vigatūpakkilesena katakiccena ca sattahitatthaṃ puna pavattetabbā, haritesu ca attano upakkilesesu parasattānaṃ upakkilesaharaṇāni hontīti paṭihāriyāni bhavanti. Paṭihāriyameva pāṭihāriyaṃ, paṭihāriye vā iddhiādesanānusāsanisamudāye bhavaṃ ekamekaṃ pāṭihāriyanti vuccati. Paṭihāriyaṃ vā catutthajjhānaṃ maggo ca paṭipakkhaharaṇato, tattha jātaṃ, tasmiṃ vā nimittabhūte, tato vā āgatanti pāṭihāriyaṃ. Tassa pana iddhiādibhedena visayabhedena ca bahuvidhassa bhagavato desanāyaṃ labbhamānattā āha – ‘‘vividhapāṭihāriya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na aññathā"
      },
      "ti bhagavato sammukhā sutākārato na aññathāti attho, na pana bhagavato desitākārato. Acinteyyānubhāvā hi bhagavato desanā. Evañca katvā ‘‘sabbappakārena ko samattho viññātu’’nti idaṃ vacanaṃ samatthitaṃ bhavati, dhāraṇabaladassanañca na virujjhati sutākārāvirujjhanassa adhippetattā. Na hettha atthantaratāparihāro dvinnaṃ atthānaṃ ekavisayattā, itarathā thero bhagavato desanāya sabbathā paṭiggahaṇe samattho asamattho cāti āpajjeyyāti."
    ],
    "innerText": "Na aññathāti bhagavato sammukhā sutākārato na aññathāti attho, na pana bhagavato desitākārato. Acinteyyānubhāvā hi bhagavato desanā. Evañca katvā ‘‘sabbappakārena ko samattho viññātu’’nti idaṃ vacanaṃ samatthitaṃ bhavati, dhāraṇabaladassanañca na virujjhati sutākārāvirujjhanassa adhippetattā. Na hettha atthantaratāparihāro dvinnaṃ atthānaṃ ekavisayattā, itarathā thero bhagavato desanāya sabbathā paṭiggahaṇe samattho asamattho cāti āpajjeyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo paro na hoti, so attā’’ti evaṃ vuttāya niyakajjhattasaṅkhātāya sasantatiyaṃ vattanato tividhopi me-saddo kiñcāpi ekasmiṃyeva atthe dissati, karaṇasampadānasāminiddesavasena pana vijjamānabhedaṃ sandhāyāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘me-saddo tīsu atthesu dissatī’’"
      },
      "ti."
    ],
    "innerText": "‘‘Yo paro na hoti, so attā’’ti evaṃ vuttāya niyakajjhattasaṅkhātāya sasantatiyaṃ vattanato tividhopi me-saddo kiñcāpi ekasmiṃyeva atthe dissati, karaṇasampadānasāminiddesavasena pana vijjamānabhedaṃ sandhāyāha – ‘‘me-saddo tīsu atthesu dissatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kiñcāpi ",
      " upasaggo kiriyaṃ viseseti, jotakabhāvato pana satipi tasmiṃ suta-saddo eva taṃ tamatthaṃ vadatīti anupasaggassa suta-saddassa atthuddhāre saupasaggassa gahaṇaṃ na virujjhatīti ",
      " dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘saupasaggo ca anupasaggo cā’’"
      },
      "ti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assā"
      },
      "ti sutasaddassa. Kammabhāvasādhanāni idha sutasadde sambhavantīti vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘upadhāritanti vā upadhāraṇanti vā attho’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mayāti atthe satī"
      },
      "ti yadā me-saddassa kattuvasena karaṇaniddeso, tadāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mamāti atthe satī"
      },
      "ti yadā sambandhavasena sāminiddeso, tadā."
    ],
    "innerText": "Kiñcāpi upasaggo kiriyaṃ viseseti, jotakabhāvato pana satipi tasmiṃ suta-saddo eva taṃ tamatthaṃ vadatīti anupasaggassa suta-saddassa atthuddhāre saupasaggassa gahaṇaṃ na virujjhatīti dassento ‘‘saupasaggo ca anupasaggo cā’’ti āha. Assāti sutasaddassa. Kammabhāvasādhanāni idha sutasadde sambhavantīti vuttaṃ – ‘‘upadhāritanti vā upadhāraṇanti vā attho’’ti. Mayāti atthe satīti yadā me-saddassa kattuvasena karaṇaniddeso, tadāti attho. Mamāti atthe satīti yadā sambandhavasena sāminiddeso, tadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sutasaddasanniṭṭhāne payuttena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "evaṃ"
      },
      "-saddena savanakiriyājotakena bhavitabbanti vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evanti sotaviññāṇādiviññāṇakiccanidassana’’"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādi"
      },
      "-saddena sampaṭicchanādīnaṃ sotadvārikaviññāṇānaṃ tadabhinīhaṭānañca manodvārikaviññāṇānaṃ gahaṇaṃ veditabbaṃ. Sabbesampi vākyānaṃ evakāratthasahitattā ‘‘suta’’nti etassa sutamevāti ayamattho labbhatīti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘assavanabhāvappaṭikkhepato’’"
      },
      "ti. Etena avadhāraṇena niyāmataṃ dasseti. Yathā ca sutaṃ sutamevāti niyāmetabbaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṃ"
      },
      " sammā sutaṃ hotīti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘anūnādhikāviparītaggahaṇanidassana’’"
      },
      "nti. Atha vā saddantaratthāpohanavasena saddo atthaṃ vadatīti sutanti assutaṃ na hotīti ayametassa atthoti vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘assavanabhāvappaṭikkhepato’’"
      },
      "ti. Iminā diṭṭhādivinivattanaṃ karoti. Idaṃ vuttaṃ hoti – na idaṃ mayā diṭṭhaṃ, na sayambhuñāṇena sacchikataṃ, atha kho sutaṃ, tañca sammadevāti. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘anūnādhikāviparītaggahaṇanidassana’’"
      },
      "nti. Avadhāraṇatthe vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "evaṃ"
      },
      "-sadde ayamatthayojanā – ‘‘karīyatī’’ti tadapekkhassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suta"
      },
      "-saddassa ayamattho vutto ‘‘assavanabhāvappaṭikkhepato’’ti. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘anūnādhikāviparītaggahaṇanidassana’’"
      },
      "nti. Savana-saddo cettha kammattho veditabbo ‘‘suyyatī’’ti."
    ],
    "innerText": "Sutasaddasanniṭṭhāne payuttena evaṃ-saddena savanakiriyājotakena bhavitabbanti vuttaṃ – ‘‘evanti sotaviññāṇādiviññāṇakiccanidassana’’nti. Ādi-saddena sampaṭicchanādīnaṃ sotadvārikaviññāṇānaṃ tadabhinīhaṭānañca manodvārikaviññāṇānaṃ gahaṇaṃ veditabbaṃ. Sabbesampi vākyānaṃ evakāratthasahitattā ‘‘suta’’nti etassa sutamevāti ayamattho labbhatīti āha – ‘‘assavanabhāvappaṭikkhepato’’ti. Etena avadhāraṇena niyāmataṃ dasseti. Yathā ca sutaṃ sutamevāti niyāmetabbaṃ, taṃ sammā sutaṃ hotīti āha – ‘‘anūnādhikāviparītaggahaṇanidassana’’nti. Atha vā saddantaratthāpohanavasena saddo atthaṃ vadatīti sutanti assutaṃ na hotīti ayametassa atthoti vuttaṃ – ‘‘assavanabhāvappaṭikkhepato’’ti. Iminā diṭṭhādivinivattanaṃ karoti. Idaṃ vuttaṃ hoti – na idaṃ mayā diṭṭhaṃ, na sayambhuñāṇena sacchikataṃ, atha kho sutaṃ, tañca sammadevāti. Tenevāha – ‘‘anūnādhikāviparītaggahaṇanidassana’’nti. Avadhāraṇatthe vā evaṃ-sadde ayamatthayojanā – ‘‘karīyatī’’ti tadapekkhassa suta-saddassa ayamattho vutto ‘‘assavanabhāvappaṭikkhepato’’ti. Tenevāha – ‘‘anūnādhikāviparītaggahaṇanidassana’’nti. Savana-saddo cettha kammattho veditabbo ‘‘suyyatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ savanahetusavanavisesavasena padattayassa ekena pakārena atthayojanaṃ dassetvā idāni pakārantarehi taṃ dassetuṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tathā eva’’"
      },
      "ntiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tassā"
      },
      "ti yā sā bhagavato sammukhā dhammassavanākārena pavattā manodvāraviññāṇavīthi, tassā. Sā hi nānappakārena ārammaṇe pavattituṃ samatthā. Tathā ca vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sotadvārānusārenā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānappakārenā"
      },
      "ti vakkhamānānaṃ anekavihitānaṃ ",
      " byañjanatthaggahaṇānaṃ nānākārena. Etena imissā yojanāya ākārattho evaṃ-saddo gahitoti dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavattibhāvappakāsana"
      },
      "nti pavattiyā atthibhāvappakāsanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sutanti dhammappakāsana"
      },
      "nti yasmiṃ ārammaṇe vuttappakārā viññāṇavīthi nānappakārena pavattā, tassa dhammattā vuttaṃ, na sutasaddassa dhammatthattā. Vuttassevatthassa pākaṭīkaraṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ayañhetthā’’"
      },
      "tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viññāṇavīthiyā"
      },
      "ti karaṇatthe karaṇavacanaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mayā"
      },
      "ti kattuatthe."
    ],
    "innerText": "Evaṃ savanahetusavanavisesavasena padattayassa ekena pakārena atthayojanaṃ dassetvā idāni pakārantarehi taṃ dassetuṃ – ‘‘tathā eva’’ntiādi vuttaṃ. Tattha tassāti yā sā bhagavato sammukhā dhammassavanākārena pavattā manodvāraviññāṇavīthi, tassā. Sā hi nānappakārena ārammaṇe pavattituṃ samatthā. Tathā ca vuttaṃ – ‘‘sotadvārānusārenā’’ti. Nānappakārenāti vakkhamānānaṃ anekavihitānaṃ byañjanatthaggahaṇānaṃ nānākārena. Etena imissā yojanāya ākārattho evaṃ-saddo gahitoti dīpeti. Pavattibhāvappakāsananti pavattiyā atthibhāvappakāsanaṃ. Sutanti dhammappakāsananti yasmiṃ ārammaṇe vuttappakārā viññāṇavīthi nānappakārena pavattā, tassa dhammattā vuttaṃ, na sutasaddassa dhammatthattā. Vuttassevatthassa pākaṭīkaraṇaṃ ‘‘ayañhetthā’’tiādi. Tattha viññāṇavīthiyāti karaṇatthe karaṇavacanaṃ, mayāti kattuatthe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evanti niddisitabbappakāsana"
      },
      "nti nidassanatthaṃ evaṃ-saddaṃ gahetvā vuttaṃ nidassetabbassa nidassitabbattābhāvābhāvato ",
      ". Tena evaṃ-saddena sakalampi suttaṃ paccāmaṭṭhanti dasseti. Sutasaddassa kiriyāsaddattā savanakiriyāya ca sādhāraṇaviññāṇappabandhappaṭibaddhattā tattha ca puggalavohāroti vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sutanti puggalakiccappakāsana’’"
      },
      "nti. Na hi puggalavohārarahite dhammappabandhe savanakiriyā labbhatīti."
    ],
    "innerText": "Evanti niddisitabbappakāsananti nidassanatthaṃ evaṃ-saddaṃ gahetvā vuttaṃ nidassetabbassa nidassitabbattābhāvābhāvato . Tena evaṃ-saddena sakalampi suttaṃ paccāmaṭṭhanti dasseti. Sutasaddassa kiriyāsaddattā savanakiriyāya ca sādhāraṇaviññāṇappabandhappaṭibaddhattā tattha ca puggalavohāroti vuttaṃ – ‘‘sutanti puggalakiccappakāsana’’nti. Na hi puggalavohārarahite dhammappabandhe savanakiriyā labbhatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa cittasantānassā"
      },
      "tiādipi ākāratthameva evaṃ-saddaṃ gahetvā purimayojanāya aññathā atthayojanaṃ dassetuṃ vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ākārapaññattī"
      },
      "ti upādāpaññatti eva dhammānaṃ pavattiākārupādānavasena tathā vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sutanti visayaniddeso"
      },
      "ti sotabbabhūto dhammo savanakiriyākattupuggalassa savanakiriyāvasena pavattiṭṭhānanti katvā vuttaṃ. Cittasantānavinimuttassa paramatthato kassaci kattuabhāvepi saddavohārena buddhiparikappitabhedavacanicchāya cittasantānato aññaṃ viya taṃsamaṅgiṃ katvā vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cittasantānena taṃsamaṅgīno’’"
      },
      "ti. Savanakiriyāvisayopi sotabbadhammo savanakiriyāvasena pavattacittasantānassa idha paramatthato kattubhāvato, savanavasena cittapavattiyā eva vā savanakiriyābhāvato taṃkiriyākattu ca visayo hotīti katvā vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘taṃsamaṅgīno kattuvisaye’’"
      },
      "ti. Sutākārassa ca therassa sammānicchitabhāvato āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘gahaṇasanniṭṭhāna’’"
      },
      "nti. Etena vā avadhāraṇatthaṃ evaṃ-saddaṃ gahetvā ayamatthayojanā katāti daṭṭhabbaṃ."
    ],
    "innerText": "Yassa cittasantānassātiādipi ākāratthameva evaṃ-saddaṃ gahetvā purimayojanāya aññathā atthayojanaṃ dassetuṃ vuttaṃ. Tattha ākārapaññattīti upādāpaññatti eva dhammānaṃ pavattiākārupādānavasena tathā vuttā. Sutanti visayaniddesoti sotabbabhūto dhammo savanakiriyākattupuggalassa savanakiriyāvasena pavattiṭṭhānanti katvā vuttaṃ. Cittasantānavinimuttassa paramatthato kassaci kattuabhāvepi saddavohārena buddhiparikappitabhedavacanicchāya cittasantānato aññaṃ viya taṃsamaṅgiṃ katvā vuttaṃ – ‘‘cittasantānena taṃsamaṅgīno’’ti. Savanakiriyāvisayopi sotabbadhammo savanakiriyāvasena pavattacittasantānassa idha paramatthato kattubhāvato, savanavasena cittapavattiyā eva vā savanakiriyābhāvato taṃkiriyākattu ca visayo hotīti katvā vuttaṃ – ‘‘taṃsamaṅgīno kattuvisaye’’ti. Sutākārassa ca therassa sammānicchitabhāvato āha – ‘‘gahaṇasanniṭṭhāna’’nti. Etena vā avadhāraṇatthaṃ evaṃ-saddaṃ gahetvā ayamatthayojanā katāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pubbe sutānaṃ nānāvihitānaṃ suttasaṅkhātānaṃ atthabyañjanānaṃ upadhāritarūpassa ākārassa nidassanassa, avadhāraṇassa vā pakāsanasabhāvo ",
      " evaṃ-saddoti tadākārādiupadhāraṇassa puggalapaññattiyā upādānabhūtadhammappabandhabyāpāratāya vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evanti puggalakiccaniddeso’’"
      },
      "ti. Savanakiriyā pana puggalavādinopi viññāṇanirapekkhā natthīti visesato viññāṇabyāpāroti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sutanti viññāṇakiccaniddeso’’"
      },
      "ti. Meti saddappavattiyā ekanteneva sattavisayattā viññāṇakiccassa ca tattheva samodahitabbato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘meti ubhayakiccayuttapuggalaniddeso’’"
      },
      "ti vuttaṃ. Avijjamānapaññattivijjamānapaññattisabhāvā yathākkamaṃ evaṃsaddasutasaddānaṃ atthāti te tathārūpapaññattiupādānabyāpārabhāvena dassento āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evanti puggalakiccaniddeso, sutanti viññāṇakiccaniddeso’’"
      },
      "ti. Ettha ca karaṇakiriyākattukammavisesappakāsanavasena puggalabyāpāravisayapuggalabyāpāranidassanavasena gahaṇākāraggāhakatabbisayavisesaniddesavasena kattukaraṇabyāpārakattuniddesavasena ca dutiyādayo catasso atthayojanā dassitāti daṭṭhabbaṃ."
    ],
    "innerText": "Pubbe sutānaṃ nānāvihitānaṃ suttasaṅkhātānaṃ atthabyañjanānaṃ upadhāritarūpassa ākārassa nidassanassa, avadhāraṇassa vā pakāsanasabhāvo evaṃ-saddoti tadākārādiupadhāraṇassa puggalapaññattiyā upādānabhūtadhammappabandhabyāpāratāya vuttaṃ – ‘‘evanti puggalakiccaniddeso’’ti. Savanakiriyā pana puggalavādinopi viññāṇanirapekkhā natthīti visesato viññāṇabyāpāroti āha – ‘‘sutanti viññāṇakiccaniddeso’’ti. Meti saddappavattiyā ekanteneva sattavisayattā viññāṇakiccassa ca tattheva samodahitabbato ‘‘meti ubhayakiccayuttapuggalaniddeso’’ti vuttaṃ. Avijjamānapaññattivijjamānapaññattisabhāvā yathākkamaṃ evaṃsaddasutasaddānaṃ atthāti te tathārūpapaññattiupādānabyāpārabhāvena dassento āha – ‘‘evanti puggalakiccaniddeso, sutanti viññāṇakiccaniddeso’’ti. Ettha ca karaṇakiriyākattukammavisesappakāsanavasena puggalabyāpāravisayapuggalabyāpāranidassanavasena gahaṇākāraggāhakatabbisayavisesaniddesavasena kattukaraṇabyāpārakattuniddesavasena ca dutiyādayo catasso atthayojanā dassitāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbassapi saddādhigamanīyassa atthassa paññattimukheneva paṭipajjitabbattā sabbapaññattīnañca ",
      " vijjamānādivasena chasu paññattibhedesu antogadhattā tesu ‘‘eva’’ntiādīnaṃ paññattīnaṃ sarūpaṃ niddhārento āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evanti ca meti cā’’"
      },
      "tiādi. Tattha evanti ca meti ca vuccamānassatthassa ākārādino dhammānaṃ asallakkhaṇabhāvato avijjamānapaññattibhāvoti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘saccikaṭṭhaparamatthavasena avijjamānapaññattī’’"
      },
      "ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saccikaṭṭhaparamatthavasenā"
      },
      "ti bhūtatthauttamatthavasena. Idaṃ vuttaṃ hoti – yo māyāmarīciādayo viya abhūtattho, anussavādīhi gahetabbo viya anuttamattho ca na hoti, so rūpasaddādisabhāvo, ruppanānubhavanādisabhāvo vā attho saccikaṭṭho paramattho cāti vuccati, na tathā ‘‘evaṃ me’’tipadānaṃ atthoti. Etamevatthaṃ pākaṭataraṃ kātuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kiñhettha ta’’"
      },
      "ntiādi vuttaṃ. Sutanti pana saddāyatanaṃ sandhāyāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vijjamānapaññattī’’"
      },
      "ti. Teneva hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yañhi taṃ ettha sotena upaladdha’’"
      },
      "nti vuttaṃ. ‘‘Sotadvārānusārena upaladdha’’nti pana vutte atthabyañjanādi sabbaṃ labbhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ taṃ upādāya vattabbato"
      },
      "ti sotapathamāgate dhamme upādāya tesaṃ upadhāritākārādino paccāmasanavasena evanti, sasantatipariyāpanne khandhe upādāya meti vattabbattāti attho. Diṭṭhādisabhāvarahite saddāyatane pavattamānopi ",
      " sutavohāro ‘‘dutiyaṃ tatiya’’ntiādiko viya paṭhamādīni diṭṭhamutaviññāte apekkhitvā pavattoti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘diṭṭhādīni upanidhāya vattabbato’’"
      },
      "ti. Assutaṃ na hotīti hi sutanti pakāsito ayamatthoti."
    ],
    "innerText": "Sabbassapi saddādhigamanīyassa atthassa paññattimukheneva paṭipajjitabbattā sabbapaññattīnañca vijjamānādivasena chasu paññattibhedesu antogadhattā tesu ‘‘eva’’ntiādīnaṃ paññattīnaṃ sarūpaṃ niddhārento āha – ‘‘evanti ca meti cā’’tiādi. Tattha evanti ca meti ca vuccamānassatthassa ākārādino dhammānaṃ asallakkhaṇabhāvato avijjamānapaññattibhāvoti āha – ‘‘saccikaṭṭhaparamatthavasena avijjamānapaññattī’’ti. Tattha saccikaṭṭhaparamatthavasenāti bhūtatthauttamatthavasena. Idaṃ vuttaṃ hoti – yo māyāmarīciādayo viya abhūtattho, anussavādīhi gahetabbo viya anuttamattho ca na hoti, so rūpasaddādisabhāvo, ruppanānubhavanādisabhāvo vā attho saccikaṭṭho paramattho cāti vuccati, na tathā ‘‘evaṃ me’’tipadānaṃ atthoti. Etamevatthaṃ pākaṭataraṃ kātuṃ ‘‘kiñhettha ta’’ntiādi vuttaṃ. Sutanti pana saddāyatanaṃ sandhāyāha – ‘‘vijjamānapaññattī’’ti. Teneva hi ‘‘yañhi taṃ ettha sotena upaladdha’’nti vuttaṃ. ‘‘Sotadvārānusārena upaladdha’’nti pana vutte atthabyañjanādi sabbaṃ labbhati. Taṃ taṃ upādāya vattabbatoti sotapathamāgate dhamme upādāya tesaṃ upadhāritākārādino paccāmasanavasena evanti, sasantatipariyāpanne khandhe upādāya meti vattabbattāti attho. Diṭṭhādisabhāvarahite saddāyatane pavattamānopi sutavohāro ‘‘dutiyaṃ tatiya’’ntiādiko viya paṭhamādīni diṭṭhamutaviññāte apekkhitvā pavattoti āha – ‘‘diṭṭhādīni upanidhāya vattabbato’’ti. Assutaṃ na hotīti hi sutanti pakāsito ayamatthoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Attanā paṭividdhā suttassa pakāravisesā evanti therena paccāmaṭṭhāti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘asammohaṃ dīpetī’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānappakārappaṭivedhasamattho hotī"
      },
      "ti etena vakkhamānassa suttassa nānappakārataṃ duppaṭivijjhatañca dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sutassa asammosaṃ dīpetī"
      },
      "ti sutākārassa yāthāvato dassiyamānattā vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asammohenā"
      },
      "ti sammohābhāvena, paññāya eva vā savanakālasambhūtāya taduttarikālapaññāsiddhi. Evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asammosenā"
      },
      "ti etthāpi vattabbaṃ. Byañjanānaṃ paṭivijjhitabbo ākāro nātigambhīro, yathāsutadhāraṇameva tattha karaṇīyanti satiyā byāpāro adhiko, paññā tattha guṇībhūtāti vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paññāpubbaṅgamāyā’’"
      },
      "tiādi ‘‘paññāya pubbaṅgamā’’ti katvā. Pubbaṅgamatā cettha padhānabhāvo ‘‘manopubbaṅgamā’’tiādīsu (dha. pa. 1, 2) viya, pubbaṅgamatāya vā cakkhuviññāṇādīsu āvajjanādīnaṃ viya appadhānatte paññā pubbaṅgamā etissāti ayampi attho yujjati, evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satipubbaṅgamāyā"
      },
      "ti etthāpi vuttanayānusārena yathāsambhavamattho veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthabyañjanasampannassā"
      },
      "ti atthabyañjanaparipuṇṇassa, saṅkāsanappakāsanavivaraṇavibhajanauttānīkaraṇapaññattivasena chahi atthapadehi akkharapadabyañjanākāraniruttiniddesavasena chahi byañjanapadehi ca samannāgatassāti vā attho daṭṭhabbo."
    ],
    "innerText": "Attanā paṭividdhā suttassa pakāravisesā evanti therena paccāmaṭṭhāti āha – ‘‘asammohaṃ dīpetī’’ti. Nānappakārappaṭivedhasamattho hotīti etena vakkhamānassa suttassa nānappakārataṃ duppaṭivijjhatañca dasseti. Sutassa asammosaṃ dīpetīti sutākārassa yāthāvato dassiyamānattā vuttaṃ. Asammohenāti sammohābhāvena, paññāya eva vā savanakālasambhūtāya taduttarikālapaññāsiddhi. Evaṃ asammosenāti etthāpi vattabbaṃ. Byañjanānaṃ paṭivijjhitabbo ākāro nātigambhīro, yathāsutadhāraṇameva tattha karaṇīyanti satiyā byāpāro adhiko, paññā tattha guṇībhūtāti vuttaṃ – ‘‘paññāpubbaṅgamāyā’’tiādi ‘‘paññāya pubbaṅgamā’’ti katvā. Pubbaṅgamatā cettha padhānabhāvo ‘‘manopubbaṅgamā’’tiādīsu (dha. pa. 1, 2) viya, pubbaṅgamatāya vā cakkhuviññāṇādīsu āvajjanādīnaṃ viya appadhānatte paññā pubbaṅgamā etissāti ayampi attho yujjati, evaṃ satipubbaṅgamāyāti etthāpi vuttanayānusārena yathāsambhavamattho veditabbo. Atthabyañjanasampannassāti atthabyañjanaparipuṇṇassa, saṅkāsanappakāsanavivaraṇavibhajanauttānīkaraṇapaññattivasena chahi atthapadehi akkharapadabyañjanākāraniruttiniddesavasena chahi byañjanapadehi ca samannāgatassāti vā attho daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yonisomanasikāraṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dīpeti"
      },
      " evaṃ-saddena vuccamānānaṃ ākāranidassanāvadhāraṇatthānaṃ aviparītasaddhammavisayattāti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avikkhepaṃ dīpetī"
      },
      "ti ‘‘cittapariyādānaṃ kattha bhāsita’’ntiādipucchāvase pakaraṇappattassa vakkhamānassa suttassa savanaṃ samādhānamantarena na sambhavatīti katvā vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vikkhittacittassā"
      },
      "tiādi tassevatthassa samatthanavasena vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbasampattiyā"
      },
      "ti atthabyañjanadesakappayojanādisampattiyā. Aviparītasaddhammavisayehi viya ākāranidassanāvadhāraṇatthehi yonisomanasikārassa, saddhammassavanena viya ca avikkhepassa yathā yonisomanasikārena phalabhūtena attasammāpaṇidhipubbekatapuññatānaṃ siddhi vuttā ",
      " tadavinābhāvato. Evaṃ avikkhepena phalabhūtena kāraṇabhūtānaṃ saddhammassavanasappurisūpanissayānaṃ siddhi dassetabbā siyā assutavato sappurisūpanissayarahitassa ca tadabhāvato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na hi vikkhittacitto"
      },
      "tiādinā samatthanavacanena pana avikkhepena kāraṇabhūtena sappurisūpanissayena ca phalabhūtassa saddhammassavanassa siddhi dassitā. Ayaṃ panettha adhippāyo yutto siyā, saddhammassavanasappurisūpanissayā na ekantena avikkhepassa kāraṇaṃ bāhiraṅgattā, avikkhepo pana sappurisūpanissayo viya saddhammassavanassa ekantakāraṇanti. Evampi avikkhepena sappurisūpanissayasiddhijotanā na samatthitāva. No na samatthitā vikkhittacittānaṃ sappurisapayirupāsanābhāvassa atthasiddhattā. Ettha ca purimaṃ phalena kāraṇassa siddhidassanaṃ nadīpūrena viya upari vuṭṭhisabbhāvassa, dutiyaṃ kāraṇena phalassa siddhidassanaṃ daṭṭhabbaṃ ekantavassinā viya meghavuṭṭhānena vuṭṭhippavattiyā."
    ],
    "innerText": "Yonisomanasikāraṃdīpeti evaṃ-saddena vuccamānānaṃ ākāranidassanāvadhāraṇatthānaṃ aviparītasaddhammavisayattāti adhippāyo. Avikkhepaṃ dīpetīti ‘‘cittapariyādānaṃ kattha bhāsita’’ntiādipucchāvase pakaraṇappattassa vakkhamānassa suttassa savanaṃ samādhānamantarena na sambhavatīti katvā vuttaṃ. Vikkhittacittassātiādi tassevatthassa samatthanavasena vuttaṃ. Sabbasampattiyāti atthabyañjanadesakappayojanādisampattiyā. Aviparītasaddhammavisayehi viya ākāranidassanāvadhāraṇatthehi yonisomanasikārassa, saddhammassavanena viya ca avikkhepassa yathā yonisomanasikārena phalabhūtena attasammāpaṇidhipubbekatapuññatānaṃ siddhi vuttā tadavinābhāvato. Evaṃ avikkhepena phalabhūtena kāraṇabhūtānaṃ saddhammassavanasappurisūpanissayānaṃ siddhi dassetabbā siyā assutavato sappurisūpanissayarahitassa ca tadabhāvato. Na hi vikkhittacittotiādinā samatthanavacanena pana avikkhepena kāraṇabhūtena sappurisūpanissayena ca phalabhūtassa saddhammassavanassa siddhi dassitā. Ayaṃ panettha adhippāyo yutto siyā, saddhammassavanasappurisūpanissayā na ekantena avikkhepassa kāraṇaṃ bāhiraṅgattā, avikkhepo pana sappurisūpanissayo viya saddhammassavanassa ekantakāraṇanti. Evampi avikkhepena sappurisūpanissayasiddhijotanā na samatthitāva. No na samatthitā vikkhittacittānaṃ sappurisapayirupāsanābhāvassa atthasiddhattā. Ettha ca purimaṃ phalena kāraṇassa siddhidassanaṃ nadīpūrena viya upari vuṭṭhisabbhāvassa, dutiyaṃ kāraṇena phalassa siddhidassanaṃ daṭṭhabbaṃ ekantavassinā viya meghavuṭṭhānena vuṭṭhippavattiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhagavato vacanassa atthabyañjanappabhedaparicchedavasena sakalasāsanasampattiogāhanākāro niravasesaparahitapāripūritākāraṇanti vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evaṃ bhaddako ākāro’’"
      },
      "ti. Yasmā na hotīti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchimacakkadvayasampatti"
      },
      "nti attasammāpaṇidhipubbekatapuññatāsaṅkhātaguṇadvayaṃ. Aparāparaṃ vuttiyā cettha cakkabhāvo, caranti etehi sattā sampattibhavesūti vā. Ye sandhāya vuttaṃ – ‘‘cattārimāni, bhikkhave, cakkāni, yehi samannāgatānaṃ devamanussānaṃ catucakkaṃ vattatī’’tiādi (a. ni. 4.31). Purimapacchimabhāvo cettha desanākkamavasena daṭṭhabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchimacakkadvayasiddhiyā"
      },
      "ti pacchimacakkadvayassa atthitāya. Sammāpaṇihitatto pubbe ca katapuñño suddhāsayo hoti tadasiddhihetūnaṃ kilesānaṃ dūrībhāvatoti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āsayasuddhi siddhā hotī’’"
      },
      "ti. Tathā hi vuttaṃ – ‘‘sammāpaṇihitaṃ cittaṃ, seyyaso naṃ tato kare’’ti (dha. pa. 43), ‘‘katapuññosi tvaṃ, ānanda, padhānamanuyuñja, khippaṃ hohisi anāsavo’’ti (dī. ni. 2.207) ca. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āsayasuddhiyā adhigamabyattisiddhī’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Payogasuddhiyā"
      },
      "ti yonisomanasikārapubbaṅgamassa dhammassavanappayogassa visadabhāvena. Tathā cāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āgamabyattisiddhī’’"
      },
      "ti ",
      ", sabbassa vā kāyavacīpayogassa niddosabhāvena. Parisuddhakāyavacīpayogo hi vippaṭisārābhāvato avikkhittacitto pariyattiyaṃ visārado hotīti."
    ],
    "innerText": "Bhagavato vacanassa atthabyañjanappabhedaparicchedavasena sakalasāsanasampattiogāhanākāro niravasesaparahitapāripūritākāraṇanti vuttaṃ – ‘‘evaṃ bhaddako ākāro’’ti. Yasmā na hotīti sambandho. Pacchimacakkadvayasampattinti attasammāpaṇidhipubbekatapuññatāsaṅkhātaguṇadvayaṃ. Aparāparaṃ vuttiyā cettha cakkabhāvo, caranti etehi sattā sampattibhavesūti vā. Ye sandhāya vuttaṃ – ‘‘cattārimāni, bhikkhave, cakkāni, yehi samannāgatānaṃ devamanussānaṃ catucakkaṃ vattatī’’tiādi (a. ni. 4.31). Purimapacchimabhāvo cettha desanākkamavasena daṭṭhabbo. Pacchimacakkadvayasiddhiyāti pacchimacakkadvayassa atthitāya. Sammāpaṇihitatto pubbe ca katapuñño suddhāsayo hoti tadasiddhihetūnaṃ kilesānaṃ dūrībhāvatoti āha – ‘‘āsayasuddhi siddhā hotī’’ti. Tathā hi vuttaṃ – ‘‘sammāpaṇihitaṃ cittaṃ, seyyaso naṃ tato kare’’ti (dha. pa. 43), ‘‘katapuññosi tvaṃ, ānanda, padhānamanuyuñja, khippaṃ hohisi anāsavo’’ti (dī. ni. 2.207) ca. Tenevāha – ‘‘āsayasuddhiyā adhigamabyattisiddhī’’ti. Payogasuddhiyāti yonisomanasikārapubbaṅgamassa dhammassavanappayogassa visadabhāvena. Tathā cāha – ‘‘āgamabyattisiddhī’’ti , sabbassa vā kāyavacīpayogassa niddosabhāvena. Parisuddhakāyavacīpayogo hi vippaṭisārābhāvato avikkhittacitto pariyattiyaṃ visārado hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānappakārapaṭivedhadīpakenā"
      },
      "tiādinā ",
      " atthabyañjanesu therassa evaṃ-saddasuta-saddānaṃ asammohadīpanato catuppaṭisambhidāvasena atthayojanaṃ dasseti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sotappabhedapaṭivedhadīpakenā"
      },
      "ti etena ayaṃ suta-saddo evaṃ-saddasannidhānato, vakkhamānāpekkhāya vā sāmaññeneva sotabbadhammavisesaṃ āmasatīti dasseti. Manodiṭṭhikaraṇānaṃ pariyattidhammānaṃ anupekkhanasuppaṭivedhā visesato manasikārappaṭibaddhāti te vuttanayena yonisomanasikāradīpakena evaṃ-saddena yojetvā, savanadhāraṇavacīparicayā pariyattidhammā visesena sotāvadhānappaṭibaddhāti te avikkhepadīpakena suta-saddena yojetvā dassento sāsanasampattiyā dhammassavane ussāhaṃ janeti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammā"
      },
      "ti pariyattidhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manasā anupekkhitā"
      },
      "ti ‘‘idha sīlaṃ kathitaṃ, idha samādhi, idha paññā, ettakā ettha anusandhayo’’tiādinā nayena manasā anu anu pekkhitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhiyā suppaṭividdhā"
      },
      "ti nijjhānakkhanti bhūtāya, ñātapariññāsaṅkhātāya vā diṭṭhiyā tattha tattha vuttarūpārūpadhamme ‘‘iti rūpaṃ, ettakaṃ rūpa’’ntiādinā suṭṭhu vavatthapetvā paṭividdhā."
    ],
    "innerText": "Nānappakārapaṭivedhadīpakenātiādinā atthabyañjanesu therassa evaṃ-saddasuta-saddānaṃ asammohadīpanato catuppaṭisambhidāvasena atthayojanaṃ dasseti. Tattha sotappabhedapaṭivedhadīpakenāti etena ayaṃ suta-saddo evaṃ-saddasannidhānato, vakkhamānāpekkhāya vā sāmaññeneva sotabbadhammavisesaṃ āmasatīti dasseti. Manodiṭṭhikaraṇānaṃ pariyattidhammānaṃ anupekkhanasuppaṭivedhā visesato manasikārappaṭibaddhāti te vuttanayena yonisomanasikāradīpakena evaṃ-saddena yojetvā, savanadhāraṇavacīparicayā pariyattidhammā visesena sotāvadhānappaṭibaddhāti te avikkhepadīpakena suta-saddena yojetvā dassento sāsanasampattiyā dhammassavane ussāhaṃ janeti. Tattha dhammāti pariyattidhammā. Manasā anupekkhitāti ‘‘idha sīlaṃ kathitaṃ, idha samādhi, idha paññā, ettakā ettha anusandhayo’’tiādinā nayena manasā anu anu pekkhitā. Diṭṭhiyā suppaṭividdhāti nijjhānakkhanti bhūtāya, ñātapariññāsaṅkhātāya vā diṭṭhiyā tattha tattha vuttarūpārūpadhamme ‘‘iti rūpaṃ, ettakaṃ rūpa’’ntiādinā suṭṭhu vavatthapetvā paṭividdhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakalena vacanenā"
      },
      "ti pubbe tīhi padehi visuṃ visuṃ yojitattā vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asappurisabhūmi"
      },
      "nti akataññutaṃ, ‘‘idhekacco pāpabhikkhu tathāgatappaveditaṃ dhammavinayaṃ pariyāpuṇitvā attano dahatī’’ti (pārā. 195) evaṃ vuttaṃ anariyavohārāvatthaṃ. Sā eva anariyavohārāvatthā asaddhammo. Nanu ca ānandattherassa ‘‘mamedaṃ vacana’’nti adhimānassa, mahākassapattherādīnañca tadāsaṅkāya abhāvato asappurisabhūmisamatikkamādivacanaṃ niratthakanti? Nayidamevaṃ, ‘‘evaṃ me suta’’nti vadantena ayampi attho vibhāvitoti dassanato. Keci pana ‘‘devatānaṃ parivitakkāpekkhaṃ tathāvacananti edisī codanā anavakāsā’’ti vadanti. Tasmiṃ kira khaṇe ekaccānaṃ devatānaṃ evaṃ cetaso parivitakko udapādi ‘‘bhagavā parinibbuto, ayañca āyasmā desanākusalo idāni dhammaṃ deseti, sakyakulappasuto tathāgatassa bhātā cūḷapituputto, kiṃ nu kho sayaṃ sacchikataṃ dhammaṃ deseti, udāhu bhagavato eva vacanaṃ yathāsuta’’nti, evaṃ tadāsaṅkitappakārato asappurisabhūmisamokkamādito atikkamādi vibhāvitanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attano adahanto"
      },
      "ti ‘‘mameda’’nti attani aṭṭhapento. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appetī"
      },
      "ti ",
      " nidasseti. Diṭṭhadhammikasamparāyikaparamatthesu yathārahaṃ satte netīti netti, dhammoyeva netti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammanetti"
      },
      "."
    ],
    "innerText": "Sakalena vacanenāti pubbe tīhi padehi visuṃ visuṃ yojitattā vuttaṃ. Asappurisabhūminti akataññutaṃ, ‘‘idhekacco pāpabhikkhu tathāgatappaveditaṃ dhammavinayaṃ pariyāpuṇitvā attano dahatī’’ti (pārā. 195) evaṃ vuttaṃ anariyavohārāvatthaṃ. Sā eva anariyavohārāvatthā asaddhammo. Nanu ca ānandattherassa ‘‘mamedaṃ vacana’’nti adhimānassa, mahākassapattherādīnañca tadāsaṅkāya abhāvato asappurisabhūmisamatikkamādivacanaṃ niratthakanti? Nayidamevaṃ, ‘‘evaṃ me suta’’nti vadantena ayampi attho vibhāvitoti dassanato. Keci pana ‘‘devatānaṃ parivitakkāpekkhaṃ tathāvacananti edisī codanā anavakāsā’’ti vadanti. Tasmiṃ kira khaṇe ekaccānaṃ devatānaṃ evaṃ cetaso parivitakko udapādi ‘‘bhagavā parinibbuto, ayañca āyasmā desanākusalo idāni dhammaṃ deseti, sakyakulappasuto tathāgatassa bhātā cūḷapituputto, kiṃ nu kho sayaṃ sacchikataṃ dhammaṃ deseti, udāhu bhagavato eva vacanaṃ yathāsuta’’nti, evaṃ tadāsaṅkitappakārato asappurisabhūmisamokkamādito atikkamādi vibhāvitanti. Attano adahantoti ‘‘mameda’’nti attani aṭṭhapento. Appetīti nidasseti. Diṭṭhadhammikasamparāyikaparamatthesu yathārahaṃ satte netīti netti, dhammoyeva netti dhammanetti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Daḷhataraniviṭṭhā ",
      " vicikicchā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kaṅkhā"
      },
      ". Nātisaṃsappanaṃ matibhedamattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimati. Assaddhiyaṃ vināseti"
      },
      " bhagavatā bhāsitattā sammukhā cassa paṭiggahitattā khalitaduruttādiggahaṇadosābhāvato ca. Ettha ca pañcamādayo tisso atthayojanā ākārādiatthesu aggahitavisesameva evaṃ-saddaṃ gahetvā dassitā, tato parā catasso ākāratthameva evaṃ-saddaṃ gahetvā vibhāvitā, pacchimā pana tisso yathākkamaṃ ākāratthaṃ nidassanatthaṃ avadhāraṇatthañca evaṃ-saddaṃ gahetvā yojitāti daṭṭhabbaṃ."
    ],
    "innerText": "Daḷhataraniviṭṭhā vicikicchā kaṅkhā. Nātisaṃsappanaṃ matibhedamattaṃ vimati. Assaddhiyaṃ vināseti bhagavatā bhāsitattā sammukhā cassa paṭiggahitattā khalitaduruttādiggahaṇadosābhāvato ca. Ettha ca pañcamādayo tisso atthayojanā ākārādiatthesu aggahitavisesameva evaṃ-saddaṃ gahetvā dassitā, tato parā catasso ākāratthameva evaṃ-saddaṃ gahetvā vibhāvitā, pacchimā pana tisso yathākkamaṃ ākāratthaṃ nidassanatthaṃ avadhāraṇatthañca evaṃ-saddaṃ gahetvā yojitāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Eka-saddo aññaseṭṭhaasahāyasaṅkhādīsu dissati. Tathā hesa ‘‘sassato attā ca loko ca, idameva saccaṃ moghamaññanti ittheke abhivadantī’’tiādīsu (ma. ni. 3.27) aññatthe dissati, ‘‘cetaso ekodibhāva’’ntiādīsu (dī. ni. 1.228; pārā. 11) seṭṭhe, ‘‘eko vūpakaṭṭho’’tiādīsu (dī. ni. 1.405; 2.215; ma. ni. 1.80; saṃ. ni. 3.63; cūḷava. 445) asahāye ‘‘ekova kho, bhikkhave, khaṇo ca samayo ca brahmacariyavāsāyā’’tiādīsu (a. ni. 8.29) saṅkhāyaṃ. Idhāpi saṅkhāyanti dassento āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ekanti gaṇanaparicchedaniddeso’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kālañca samayañcā"
      },
      "ti yuttakālañca paccayasāmaggiñca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khaṇo"
      },
      "ti okāso. Tathāgatuppādādiko hi maggabrahmacariyassa okāso tappaccayappaṭilābhahetuttā. Khaṇo eva ca samayo. Yo khaṇoti ca samayoti ca vuccati, so eko evāti hi attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāsamayo"
      },
      "ti mahāsamūho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samayopi kho"
      },
      "ti sikkhāpadapūraṇassa hetupi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samayappavādake"
      },
      "ti diṭṭhippavādake. Tattha hi nisinnā titthiyā attano attano samayaṃ pavadantīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthābhisamayā"
      },
      "ti hitappaṭilābhā. Abhisametabboti abhisamayo, abhisamayo attho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhisamayaṭṭho"
      },
      "ti pīḷanādīni abhisametabbabhāvena ekībhāvaṃ upanetvā vuttāni. Abhisamayassa vā paṭivedhassa visayabhūto attho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhisamayaṭṭho"
      },
      "ti tāneva tathā ekattena vuttāni. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pīḷanaṃ"
      },
      " dukkhasaccassa taṃsamaṅgino hiṃsanaṃ avipphārikatākaraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santāpo"
      },
      " dukkhadukkhatādivasena santapanaṃ paridahanaṃ."
    ],
    "innerText": "Eka-saddo aññaseṭṭhaasahāyasaṅkhādīsu dissati. Tathā hesa ‘‘sassato attā ca loko ca, idameva saccaṃ moghamaññanti ittheke abhivadantī’’tiādīsu (ma. ni. 3.27) aññatthe dissati, ‘‘cetaso ekodibhāva’’ntiādīsu (dī. ni. 1.228; pārā. 11) seṭṭhe, ‘‘eko vūpakaṭṭho’’tiādīsu (dī. ni. 1.405; 2.215; ma. ni. 1.80; saṃ. ni. 3.63; cūḷava. 445) asahāye ‘‘ekova kho, bhikkhave, khaṇo ca samayo ca brahmacariyavāsāyā’’tiādīsu (a. ni. 8.29) saṅkhāyaṃ. Idhāpi saṅkhāyanti dassento āha – ‘‘ekanti gaṇanaparicchedaniddeso’’ti. Kālañca samayañcāti yuttakālañca paccayasāmaggiñca. Khaṇoti okāso. Tathāgatuppādādiko hi maggabrahmacariyassa okāso tappaccayappaṭilābhahetuttā. Khaṇo eva ca samayo. Yo khaṇoti ca samayoti ca vuccati, so eko evāti hi attho. Mahāsamayoti mahāsamūho. Samayopi khoti sikkhāpadapūraṇassa hetupi. Samayappavādaketi diṭṭhippavādake. Tattha hi nisinnā titthiyā attano attano samayaṃ pavadantīti. Atthābhisamayāti hitappaṭilābhā. Abhisametabboti abhisamayo, abhisamayo attho abhisamayaṭṭhoti pīḷanādīni abhisametabbabhāvena ekībhāvaṃ upanetvā vuttāni. Abhisamayassa vā paṭivedhassa visayabhūto attho abhisamayaṭṭhoti tāneva tathā ekattena vuttāni. Tattha pīḷanaṃ dukkhasaccassa taṃsamaṅgino hiṃsanaṃ avipphārikatākaraṇaṃ. Santāpo dukkhadukkhatādivasena santapanaṃ paridahanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha sahakārikāraṇe sanijjhaṃ sameti samavetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samayo,"
      },
      " samavāyo. Sameti samāgacchati ettha maggabrahmacariyaṃ tadādhārapuggalehīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samayo,"
      },
      " khaṇo. Sameti ettha, etena vā saṃgacchati satto, sabhāvadhammo vā sahajātādīhi, uppādādīhi vāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samayo,"
      },
      " kālo. Dhammappavattimattatāya atthato abhūtopi hi kālo dhammappavattiyā adhikaraṇaṃ karaṇaṃ viya ca kappanāmattasiddhena rūpena voharīyatīti. Samaṃ, saha vā avayavānaṃ ayanaṃ pavatti avaṭṭhānanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samayo,"
      },
      " samūho yathā ‘‘samudāyo’’ti. Avayavasahāvaṭṭhānameva hi samūhoti. Avasesapaccayānaṃ ",
      " samāgame eti phalaṃ etasmā uppajjati pavattati cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samayo,"
      },
      " hetu yathā ‘‘samudayo’’ti. Sameti saṃyojanabhāvato sambaddho eti attano visaye pavattati, daḷhaggahaṇabhāvato vā saṃyuttā ayanti pavattanti sattā yathābhinivesaṃ etenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samayo,"
      },
      " diṭṭhi. Diṭṭhisaṃyojanena hi sattā ativiya bajjhantīti. Samiti saṅgati samodhānanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samayo,"
      },
      " paṭilābho. Samassa yānaṃ, sammā vā yānaṃ apagamoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samayo,"
      },
      " pahānaṃ. Abhimukhaṃ ñāṇena sammā etabbo abhisametabboti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhisamayo,"
      },
      " dhammānaṃ aviparīto sabhāvo. Abhimukhabhāvena sammā eti gacchati bujjhatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhisamayo,"
      },
      " dhammānaṃ aviparītasabhāvāvabodho. Evaṃ tasmiṃ tasmiṃ atthe samayasaddassa pavatti veditabbā. Samayasaddassa atthuddhāre abhisamayasaddassa udāharaṇaṃ vuttanayena veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assā"
      },
      "ti samayasaddassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kālo attho"
      },
      " samavāyādīnaṃ atthānaṃ idha asambhavato, desadesakaparisānaṃ viya suttassa nidānabhāvena kālassa apadisitabbato ca."
    ],
    "innerText": "Tattha sahakārikāraṇe sanijjhaṃ sameti samavetīti samayo, samavāyo. Sameti samāgacchati ettha maggabrahmacariyaṃ tadādhārapuggalehīti samayo, khaṇo. Sameti ettha, etena vā saṃgacchati satto, sabhāvadhammo vā sahajātādīhi, uppādādīhi vāti samayo, kālo. Dhammappavattimattatāya atthato abhūtopi hi kālo dhammappavattiyā adhikaraṇaṃ karaṇaṃ viya ca kappanāmattasiddhena rūpena voharīyatīti. Samaṃ, saha vā avayavānaṃ ayanaṃ pavatti avaṭṭhānanti samayo, samūho yathā ‘‘samudāyo’’ti. Avayavasahāvaṭṭhānameva hi samūhoti. Avasesapaccayānaṃ samāgame eti phalaṃ etasmā uppajjati pavattati cāti samayo, hetu yathā ‘‘samudayo’’ti. Sameti saṃyojanabhāvato sambaddho eti attano visaye pavattati, daḷhaggahaṇabhāvato vā saṃyuttā ayanti pavattanti sattā yathābhinivesaṃ etenāti samayo, diṭṭhi. Diṭṭhisaṃyojanena hi sattā ativiya bajjhantīti. Samiti saṅgati samodhānanti samayo, paṭilābho. Samassa yānaṃ, sammā vā yānaṃ apagamoti samayo, pahānaṃ. Abhimukhaṃ ñāṇena sammā etabbo abhisametabboti abhisamayo, dhammānaṃ aviparīto sabhāvo. Abhimukhabhāvena sammā eti gacchati bujjhatīti abhisamayo, dhammānaṃ aviparītasabhāvāvabodho. Evaṃ tasmiṃ tasmiṃ atthe samayasaddassa pavatti veditabbā. Samayasaddassa atthuddhāre abhisamayasaddassa udāharaṇaṃ vuttanayena veditabbaṃ. Assāti samayasaddassa. Kālo attho samavāyādīnaṃ atthānaṃ idha asambhavato, desadesakaparisānaṃ viya suttassa nidānabhāvena kālassa apadisitabbato ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kasmā panettha aniyamitavaseneva kālo niddiṭṭho, na utusaṃvaccharādivasena niyametvāti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tattha kiñcāpī’’"
      },
      "tiādi. Utusaṃvaccharādivasena niyamaṃ akatvā samayasaddassa vacane ayampi guṇo laddho hotīti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ye vā ime’’"
      },
      "tiādimāha. Sāmaññajotanā hi visese avatiṭṭhatīti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭhadhammasukhavihārasamayo"
      },
      " devasikaṃ jhānasamāpattīhi vītināmanakālo, visesato sattasattāhāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suppakāsā"
      },
      "ti dasasahassilokadhātuyā pakampanaobhāsapātubhāvādīhi ",
      " pākaṭā. Yathāvuttabhedesu eva samayesu ekadesaṃ pakārantarehi saṅgahetvā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yo cāya’’"
      },
      "ntiādimāha. Tathā hi ñāṇakiccasamayo attahitappaṭipattisamayo ca abhisambodhisamayo, ariyatuṇhībhāvasamayo diṭṭhadhammasukhavihārasamayo, karuṇākiccaparahitappaṭipattidhammikathāsamayo desanāsamayoyeva."
    ],
    "innerText": "Kasmā panettha aniyamitavaseneva kālo niddiṭṭho, na utusaṃvaccharādivasena niyametvāti āha – ‘‘tattha kiñcāpī’’tiādi. Utusaṃvaccharādivasena niyamaṃ akatvā samayasaddassa vacane ayampi guṇo laddho hotīti dassento ‘‘ye vā ime’’tiādimāha. Sāmaññajotanā hi visese avatiṭṭhatīti. Tattha diṭṭhadhammasukhavihārasamayo devasikaṃ jhānasamāpattīhi vītināmanakālo, visesato sattasattāhāni. Suppakāsāti dasasahassilokadhātuyā pakampanaobhāsapātubhāvādīhi pākaṭā. Yathāvuttabhedesu eva samayesu ekadesaṃ pakārantarehi saṅgahetvā dassetuṃ ‘‘yo cāya’’ntiādimāha. Tathā hi ñāṇakiccasamayo attahitappaṭipattisamayo ca abhisambodhisamayo, ariyatuṇhībhāvasamayo diṭṭhadhammasukhavihārasamayo, karuṇākiccaparahitappaṭipattidhammikathāsamayo desanāsamayoyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Karaṇavacanena niddeso katoti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti abhidhammavinayesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathā"
      },
      "ti bhummakaraṇehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhikaraṇattho"
      },
      " ādhārattho. Bhāvo nāma kiriyā, kiriyāya kiriyantaralakkhaṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhāvenabhāvalakkhaṇaṃ"
      },
      ". Tattha yathā kālo sabhāvadhammaparicchinno sayaṃ paramatthato avijjamānopi ādhārabhāvena paññāto taṅkhaṇappavattānaṃ tato pubbe parato ca abhāvato ‘‘pubbaṇhe jāto, sāyanhe gacchatī’’ti ca ādīsu, samūho ca avayavavinimutto avijjamānopi kappanāmattasiddho avayavānaṃ ādhārabhāvena paññāpīyati ‘‘rukkhe sākhā, yavarāsiyaṃ sambhūto’’tiādīsu, evaṃ idhāpīti dassento āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘adhikaraṇaṃ…pe… dhammāna’’"
      },
      "nti. Yasmiṃ kāle, dhammapuñje vā kāmāvacaraṃ kusalaṃ cittaṃ uppannaṃ hoti, tasmiṃ eva kāle, dhammapuñje ",
      " ca phassādayopi hontīti ayañhi tattha attho. Yathā ‘‘gāvīsu duyhamānāsu gato, duddhāsu āgato’’ti dohanakiriyāya gamanakiriyā lakkhīyati, evaṃ idhāpi ‘‘yasmiṃ samaye, tasmiṃ samaye’’ti ca vutte ‘‘satī’’ti ayamattho viññāyamāno eva hoti padatthassa sattāvirahābhāvatoti samayassa sattākiriyāya cittassa uppādakiriyā, phassādīnaṃ bhavanakiriyā ca lakkhīyatīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yasmiṃ samaye"
      },
      "ti yasmiṃ navame khaṇe, yasmiṃ yonisomanasikārādihetumhi, paccayasamavāye vā sati kāmāvacaraṃ kusalaṃ cittaṃ uppannaṃ hoti, tasmiṃyeva khaṇe hetumhi paccayasamavāye ca phassādayopi hontīti ubhayattha samayasadde bhummaniddeso kato lakkhaṇabhūtabhāvayuttoti dassento āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘khaṇa…pe… lakkhīyatī’’"
      },
      "ti."
    ],
    "innerText": "Karaṇavacanena niddeso katoti sambandho. Tatthāti abhidhammavinayesu. Tathāti bhummakaraṇehi. Adhikaraṇattho ādhārattho. Bhāvo nāma kiriyā, kiriyāya kiriyantaralakkhaṇaṃ bhāvenabhāvalakkhaṇaṃ. Tattha yathā kālo sabhāvadhammaparicchinno sayaṃ paramatthato avijjamānopi ādhārabhāvena paññāto taṅkhaṇappavattānaṃ tato pubbe parato ca abhāvato ‘‘pubbaṇhe jāto, sāyanhe gacchatī’’ti ca ādīsu, samūho ca avayavavinimutto avijjamānopi kappanāmattasiddho avayavānaṃ ādhārabhāvena paññāpīyati ‘‘rukkhe sākhā, yavarāsiyaṃ sambhūto’’tiādīsu, evaṃ idhāpīti dassento āha – ‘‘adhikaraṇaṃ…pe… dhammāna’’nti. Yasmiṃ kāle, dhammapuñje vā kāmāvacaraṃ kusalaṃ cittaṃ uppannaṃ hoti, tasmiṃ eva kāle, dhammapuñje ca phassādayopi hontīti ayañhi tattha attho. Yathā ‘‘gāvīsu duyhamānāsu gato, duddhāsu āgato’’ti dohanakiriyāya gamanakiriyā lakkhīyati, evaṃ idhāpi ‘‘yasmiṃ samaye, tasmiṃ samaye’’ti ca vutte ‘‘satī’’ti ayamattho viññāyamāno eva hoti padatthassa sattāvirahābhāvatoti samayassa sattākiriyāya cittassa uppādakiriyā, phassādīnaṃ bhavanakiriyā ca lakkhīyatīti. Yasmiṃ samayeti yasmiṃ navame khaṇe, yasmiṃ yonisomanasikārādihetumhi, paccayasamavāye vā sati kāmāvacaraṃ kusalaṃ cittaṃ uppannaṃ hoti, tasmiṃyeva khaṇe hetumhi paccayasamavāye ca phassādayopi hontīti ubhayattha samayasadde bhummaniddeso kato lakkhaṇabhūtabhāvayuttoti dassento āha – ‘‘khaṇa…pe… lakkhīyatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hetuattho karaṇattho ca sambhavati"
      },
      " ‘‘annena vasati, ajjhenena vasati, pharasunā chindati, kudālena khaṇatī’’tiādīsu viya. Vītikkamañhi sutvā bhikkhusaṅghaṃ sannipātāpetvā otiṇṇe vatthusmiṃ taṃ puggalaṃ paṭipucchitvā ",
      " vigarahitvā ca taṃ taṃ vatthuṃ otiṇṇakālaṃ anatikkamitvā teneva kālena sikkhāpadāni paññāpento bhagavā viharati sikkhāpadapaññattihetuñca apekkhamāno tatiyapārājikādīsu viya."
    ],
    "innerText": "Hetuattho karaṇattho ca sambhavati ‘‘annena vasati, ajjhenena vasati, pharasunā chindati, kudālena khaṇatī’’tiādīsu viya. Vītikkamañhi sutvā bhikkhusaṅghaṃ sannipātāpetvā otiṇṇe vatthusmiṃ taṃ puggalaṃ paṭipucchitvā vigarahitvā ca taṃ taṃ vatthuṃ otiṇṇakālaṃ anatikkamitvā teneva kālena sikkhāpadāni paññāpento bhagavā viharati sikkhāpadapaññattihetuñca apekkhamāno tatiyapārājikādīsu viya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Accantameva"
      },
      " ārambhato paṭṭhāya yāva desanāniṭṭhānaṃ parahitappaṭipattisaṅkhātena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karuṇāvihārena. Tadatthajotanattha"
      },
      "nti accantasaṃyogatthajotanatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upayogavacananiddeso kato"
      },
      " yathā ‘‘māsaṃ ajjhetī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Porāṇā"
      },
      "ti aṭṭhakathācariyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhilāpamattabhedo"
      },
      "ti vacanamattena viseso. Tena suttavinayesu vibhattibyattayo katoti dasseti."
    ],
    "innerText": "Accantameva ārambhato paṭṭhāya yāva desanāniṭṭhānaṃ parahitappaṭipattisaṅkhātena karuṇāvihārena. Tadatthajotanatthanti accantasaṃyogatthajotanatthaṃ. Upayogavacananiddeso kato yathā ‘‘māsaṃ ajjhetī’’ti. Porāṇāti aṭṭhakathācariyā. Abhilāpamattabhedoti vacanamattena viseso. Tena suttavinayesu vibhattibyattayo katoti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ‘‘bhagavā’’ti imassa atthaṃ dassento āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bhagavāti garū’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavāti vacanaṃ seṭṭha"
      },
      "nti seṭṭhavācakaṃ vacanaṃ, seṭṭhaguṇasahacaraṇaṃ seṭṭhanti vuttaṃ. Atha vā vuccatīti vacanaṃ, attho. Yasmā yo ‘‘bhagavā’’ti vacanena vacanīyo attho, so seṭṭhoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavāti vacanamuttama"
      },
      "nti etthāpi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gāravayutto"
      },
      "ti garubhāvayutto garuguṇayogato. Garukaraṇaṃ vā sātisayaṃ arahatīti gāravayutto, gāravārahoti attho. Sippādisikkhāpakā garū honti, na ca gāravayuttā, ayaṃ pana tādiso na hoti, tasmā garūti vatvā gāravayuttoti vuttanti keci. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuttoyeva,"
      },
      " na idha vattabbo visuddhimaggassa imissā aṭṭhakathāya ekadesabhāvatoti adhippāyo."
    ],
    "innerText": "Idāni ‘‘bhagavā’’ti imassa atthaṃ dassento āha – ‘‘bhagavāti garū’’tiādi. Bhagavāti vacanaṃ seṭṭhanti seṭṭhavācakaṃ vacanaṃ, seṭṭhaguṇasahacaraṇaṃ seṭṭhanti vuttaṃ. Atha vā vuccatīti vacanaṃ, attho. Yasmā yo ‘‘bhagavā’’ti vacanena vacanīyo attho, so seṭṭhoti attho. Bhagavāti vacanamuttamanti etthāpi eseva nayo. Gāravayuttoti garubhāvayutto garuguṇayogato. Garukaraṇaṃ vā sātisayaṃ arahatīti gāravayutto, gāravārahoti attho. Sippādisikkhāpakā garū honti, na ca gāravayuttā, ayaṃ pana tādiso na hoti, tasmā garūti vatvā gāravayuttoti vuttanti keci. Vuttoyeva, na idha vattabbo visuddhimaggassa imissā aṭṭhakathāya ekadesabhāvatoti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammasarīraṃ paccakkhaṃ karotī"
      },
      "ti ‘‘yo vo, ānanda, mayā dhammo ca vinayo ca desito paññatto ",
      ", so vo mamaccayena satthā’’ti (dī. ni. 2.216) vacanato dhammassa satthubhāvapariyāyo vijjatīti katvā vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vajirasaṅghātasamānakāyo"
      },
      " parehi abhejjasarīrattā. Na hi bhagavato rūpakāye kenaci sakkā antarāyo kātunti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Desanāsampattiṃ niddisati"
      },
      " vakkhamānassa sakalasuttassa evanti niddisanato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāvakasampattiṃ niddisati"
      },
      " paṭisambhidāpattena pañcasu ṭhānesu bhagavatā etadagge ṭhapitena mayā mahāsāvakena sutaṃ, tañca kho mayā sutaṃ, na anussutikaṃ, na paramparābhatanti imassa atthassa dīpanato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kālasampattiṃ niddisati"
      },
      " ‘‘bhagavā’’ti padassa sannidhāne payuttassa samayasaddassa kālassa buddhuppādappaṭimaṇḍitabhāvadīpanato ",
      ". Buddhuppādaparamā hi kālasampadā. Tenetaṃ vuccati –"
    ],
    "innerText": "Dhammasarīraṃ paccakkhaṃ karotīti ‘‘yo vo, ānanda, mayā dhammo ca vinayo ca desito paññatto , so vo mamaccayena satthā’’ti (dī. ni. 2.216) vacanato dhammassa satthubhāvapariyāyo vijjatīti katvā vuttaṃ. Vajirasaṅghātasamānakāyo parehi abhejjasarīrattā. Na hi bhagavato rūpakāye kenaci sakkā antarāyo kātunti. Desanāsampattiṃ niddisati vakkhamānassa sakalasuttassa evanti niddisanato. Sāvakasampattiṃ niddisati paṭisambhidāpattena pañcasu ṭhānesu bhagavatā etadagge ṭhapitena mayā mahāsāvakena sutaṃ, tañca kho mayā sutaṃ, na anussutikaṃ, na paramparābhatanti imassa atthassa dīpanato. Kālasampattiṃ niddisati ‘‘bhagavā’’ti padassa sannidhāne payuttassa samayasaddassa kālassa buddhuppādappaṭimaṇḍitabhāvadīpanato . Buddhuppādaparamā hi kālasampadā. Tenetaṃ vuccati –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kappakasāye kaliyuge, buddhuppādo aho mahacchariyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Hutāvahamajjhe jātaṃ, samuditamakarandamaravinda’’nti. (dī. ni. ṭī. 1.1; saṃ. ni. ṭī. 1.1.1 devatāsaṃyutta);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavāti desakasampattiṃ niddisati"
      },
      " guṇavisiṭṭhasattuttamagarugāravādhivacanabhāvato."
    ],
    "innerText": "Bhagavāti desakasampattiṃ niddisati guṇavisiṭṭhasattuttamagarugāravādhivacanabhāvato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃnāmake nagare"
      },
      "ti kathaṃ panetaṃ nagaraṃ evaṃnāmakaṃ jātanti? Vuccate, yathā kākandassa isino nivāsaṭṭhāne māpitā nagarī kākandī, mākandassa nivāsaṭṭhāne māpitā mākandī, kusambassa nivāsaṭṭhāne māpitā kosambīti vuccati, evaṃ savatthassa isino nivāsaṭṭhāne māpitā nagarī sāvatthīti vuccati. Evaṃ tāva akkharacintakā vadanti. Aṭṭhakathācariyā pana bhaṇanti – ‘‘yaṃ kiñci manussānaṃ upabhogaparibhogaṃ, sabbamettha atthī’’ti sāvatthi. Satthasamāyoge ca ‘kiṃ bhaṇḍamatthī’ti pucchite ‘sabbamatthī’ti vacanamupādāya sāvatthi."
    ],
    "innerText": "Evaṃnāmake nagareti kathaṃ panetaṃ nagaraṃ evaṃnāmakaṃ jātanti? Vuccate, yathā kākandassa isino nivāsaṭṭhāne māpitā nagarī kākandī, mākandassa nivāsaṭṭhāne māpitā mākandī, kusambassa nivāsaṭṭhāne māpitā kosambīti vuccati, evaṃ savatthassa isino nivāsaṭṭhāne māpitā nagarī sāvatthīti vuccati. Evaṃ tāva akkharacintakā vadanti. Aṭṭhakathācariyā pana bhaṇanti – ‘‘yaṃ kiñci manussānaṃ upabhogaparibhogaṃ, sabbamettha atthī’’ti sāvatthi. Satthasamāyoge ca ‘kiṃ bhaṇḍamatthī’ti pucchite ‘sabbamatthī’ti vacanamupādāya sāvatthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sabbadā sabbūpakaraṇaṃ, sāvatthiyaṃ samohitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā sabbamupādāya, sāvatthīti pavuccati. (ma. ni. aṭṭha. 1.14; khu. pā. aṭṭha. 5.maṅgalasuttavaṇṇanā; udā. aṭṭha. 5; paṭi. ma. 2.1.184);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kosalānaṃ puraṃ rammaṃ, dassaneyyaṃ manoramaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dasahi saddehi avivittaṃ, annapānasamāyutaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Vuddhiṃ ",
      " vepullataṃ pattaṃ, iddhaṃ phītaṃ manoramaṃ;"
    ],
    "innerText": "‘‘Vuddhiṃ vepullataṃ pattaṃ, iddhaṃ phītaṃ manoramaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āḷakamandāva devānaṃ, sāvatthipuramuttama’’nti. (ma. ni. aṭṭha. 1.14; khu. pā. aṭṭha. 5.maṅgalasuttavaṇṇanā);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avisesenā"
      },
      "ti na visesena, vihārabhāvasāmaññenāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iriyāpathavihāro…pe… vihāresū"
      },
      "ti iriyāpathavihāro dibbavihāro brahmavihāro ariyavihāroti etesu catūsu vihāresu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaṅgiparidīpana"
      },
      "nti samaṅgibhāvaparidīpanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eta"
      },
      "nti viharatīti etaṃ padaṃ. Tathā hi taṃ ‘‘idhekacco gihisaṃsaṭṭho viharati sahanandī sahasokī’’tiādīsu (saṃ. ni. 4.241) iriyāpathavihāre āgataṃ, ‘‘yasmiṃ samaye, bhikkhave, bhikkhu vivicceva kāmehi ",
      "… paṭhamaṃ jhānaṃ upasampajja viharatī’’tiādīsu (dha. sa. 499; vibha. 624) dibbavihāre, ‘‘so mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharatī’’tiādīsu (dī. ni. 1.556; 3.308; ma. ni. 1.77, 459, 509; 2.309, 315, 451, 471; 3.230, vibha. 642, 643) brahmavihāre, ‘‘so khohaṃ, aggivessana, tassāyeva kathāya pariyosāne tasmiṃyeva purimasmiṃ samādhinimitte ajjhattameva cittaṃ saṇṭhapemi sannisādemi ekodiṃ karomi, samādahāmi, yena sudaṃ niccakappaṃ viharāmī’’tiādīsu (ma. ni. 1.387) ariyavihāre."
    ],
    "innerText": "Avisesenāti na visesena, vihārabhāvasāmaññenāti attho. Iriyāpathavihāro…pe… vihāresūti iriyāpathavihāro dibbavihāro brahmavihāro ariyavihāroti etesu catūsu vihāresu. Samaṅgiparidīpananti samaṅgibhāvaparidīpanaṃ. Etanti viharatīti etaṃ padaṃ. Tathā hi taṃ ‘‘idhekacco gihisaṃsaṭṭho viharati sahanandī sahasokī’’tiādīsu (saṃ. ni. 4.241) iriyāpathavihāre āgataṃ, ‘‘yasmiṃ samaye, bhikkhave, bhikkhu vivicceva kāmehi … paṭhamaṃ jhānaṃ upasampajja viharatī’’tiādīsu (dha. sa. 499; vibha. 624) dibbavihāre, ‘‘so mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharatī’’tiādīsu (dī. ni. 1.556; 3.308; ma. ni. 1.77, 459, 509; 2.309, 315, 451, 471; 3.230, vibha. 642, 643) brahmavihāre, ‘‘so khohaṃ, aggivessana, tassāyeva kathāya pariyosāne tasmiṃyeva purimasmiṃ samādhinimitte ajjhattameva cittaṃ saṇṭhapemi sannisādemi ekodiṃ karomi, samādahāmi, yena sudaṃ niccakappaṃ viharāmī’’tiādīsu (ma. ni. 1.387) ariyavihāre."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha iriyanaṃ pavattanaṃ iriyā, kāyappayogo. Tassā pavattanūpāyabhāvato ṭhānādi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iriyāpatho"
      },
      ". Ṭhānasamaṅgī vā hi kāyena kiñci kareyya gamanādīsu aññatarasamaṅgī vā. Atha vā iriyati pavattati etena attabhāvo, kāyakiccaṃ vāti iriyā, tassā pavattiyā upāyabhāvato pathoti iriyāpatho, ṭhānādi eva. So ca atthato gatinivattiādiākārena pavatto catusantatirūpappabandho eva. Viharaṇaṃ, viharati etenāti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vihāro"
      },
      ". Divi bhavo dibbo, tattha bahulappavattiyā brahmapārisajjādidevaloke bhavoti attho. Tattha yo dibbānubhāvo, tadatthāya saṃvattatīti vā dibbo, abhiññābhinīhāravasena mahāgatikattā vā dibbo, dibbo ca so vihāro cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dibbavihāro,"
      },
      " catasso rūpāvacarasamāpattiyo. Arūpasamāpattiyopi ettheva saṅgahaṃ gacchanti. Brahmānaṃ, brahmāno vā vihārā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmavihārā,"
      },
      " catasso appamaññāyo. Ariyo, ariyānaṃ vā vihāro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyavihāro,"
      },
      " cattāri sāmaññaphalāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So hi ekaṃ iriyāpathabādhana"
      },
      "ntiādi yadipi bhagavā ekenapi iriyāpathena cirataraṃ kālaṃ attabhāvaṃ pavattetuṃ sakkoti, tathāpi upādinnakasarīrassa ayaṃ sabhāvoti dassetuṃ vuttaṃ. Yasmā vā bhagavā yattha katthaci vasanto veneyyānaṃ dhammaṃ desento nānāsamāpattīhi ",
      " ca kālaṃ vītināmento vasatīti sattānaṃ attano ca vividhahitasukhaṃ harati upaneti uppādeti, tasmā vividhaṃ haratīti viharatīti evamettha attho veditabbo."
    ],
    "innerText": "Tattha iriyanaṃ pavattanaṃ iriyā, kāyappayogo. Tassā pavattanūpāyabhāvato ṭhānādi iriyāpatho. Ṭhānasamaṅgī vā hi kāyena kiñci kareyya gamanādīsu aññatarasamaṅgī vā. Atha vā iriyati pavattati etena attabhāvo, kāyakiccaṃ vāti iriyā, tassā pavattiyā upāyabhāvato pathoti iriyāpatho, ṭhānādi eva. So ca atthato gatinivattiādiākārena pavatto catusantatirūpappabandho eva. Viharaṇaṃ, viharati etenāti vā vihāro. Divi bhavo dibbo, tattha bahulappavattiyā brahmapārisajjādidevaloke bhavoti attho. Tattha yo dibbānubhāvo, tadatthāya saṃvattatīti vā dibbo, abhiññābhinīhāravasena mahāgatikattā vā dibbo, dibbo ca so vihāro cāti dibbavihāro, catasso rūpāvacarasamāpattiyo. Arūpasamāpattiyopi ettheva saṅgahaṃ gacchanti. Brahmānaṃ, brahmāno vā vihārā brahmavihārā, catasso appamaññāyo. Ariyo, ariyānaṃ vā vihāro ariyavihāro, cattāri sāmaññaphalāni. So hi ekaṃ iriyāpathabādhanantiādi yadipi bhagavā ekenapi iriyāpathena cirataraṃ kālaṃ attabhāvaṃ pavattetuṃ sakkoti, tathāpi upādinnakasarīrassa ayaṃ sabhāvoti dassetuṃ vuttaṃ. Yasmā vā bhagavā yattha katthaci vasanto veneyyānaṃ dhammaṃ desento nānāsamāpattīhi ca kālaṃ vītināmento vasatīti sattānaṃ attano ca vividhahitasukhaṃ harati upaneti uppādeti, tasmā vividhaṃ haratīti viharatīti evamettha attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jetassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rājakumārassā"
      },
      "ti ettha attano paccatthikajanaṃ jinātīti jeto. Sotasaddo viya hi kattusādhano jetasaddo. Atha vā raññā pasenadikosalena attano paccatthikajane jite jātoti jeto. Rañño hi jayaṃ āropetvā kumāro jitavāti jetoti vutto. Maṅgalakāmatāya vā tassa evaṃnāmameva katanti jeto. Maṅgalakāmatāya hi jeyyoti etasmiṃ atthe jetoti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitthāro panā"
      },
      "tiādinā ‘‘anāthapiṇḍikassa ārāme’’ti ettha sudatto nāma so, gahapati, mātāpitūhi katanāmavasena, sabbakāmasamiddhatāya pana vigatamaccheratāya karuṇādiguṇasamaṅgitāya ca niccakālaṃ anāthānaṃ piṇḍamadāsi. Tena anāthapiṇḍikoti saṅkhaṃ gato. Āramanti ettha pāṇino, visesena vā pabbajitāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārāmo,"
      },
      " tassa pupphaphalādisobhāya nātidūranaccāsannatādipañcavidhasenāsanaṅgasampattiyā ca tato tato āgamma ramanti abhiramanti, anukkaṇṭhitā hutvā nivasantīti attho. Vuttappakārāya vā sampattiyā tattha tattha gatepi attano abbhantaraṃyeva ānetvā rametīti ārāmo. So hi anāthapiṇḍikena gahapatinā jetassa rājakumārassa hatthato aṭṭhārasahiraññakoṭīhi santhārena kiṇitvā aṭṭhārasahiraññakoṭīhi senāsanāni kārāpetvā aṭṭhārasahiraññakoṭīhi vihāramahaṃ niṭṭhāpetvā evaṃ catupaññāsahiraññakoṭipariccāgena buddhappamukhassa bhikkhusaṅghassa niyyātito, tasmā ‘‘anāthapiṇḍikassa ārāmo’’ti vuccatīti imamatthaṃ nidasseti."
    ],
    "innerText": "Jetassarājakumārassāti ettha attano paccatthikajanaṃ jinātīti jeto. Sotasaddo viya hi kattusādhano jetasaddo. Atha vā raññā pasenadikosalena attano paccatthikajane jite jātoti jeto. Rañño hi jayaṃ āropetvā kumāro jitavāti jetoti vutto. Maṅgalakāmatāya vā tassa evaṃnāmameva katanti jeto. Maṅgalakāmatāya hi jeyyoti etasmiṃ atthe jetoti vuttaṃ. Vitthāro panātiādinā ‘‘anāthapiṇḍikassa ārāme’’ti ettha sudatto nāma so, gahapati, mātāpitūhi katanāmavasena, sabbakāmasamiddhatāya pana vigatamaccheratāya karuṇādiguṇasamaṅgitāya ca niccakālaṃ anāthānaṃ piṇḍamadāsi. Tena anāthapiṇḍikoti saṅkhaṃ gato. Āramanti ettha pāṇino, visesena vā pabbajitāti ārāmo, tassa pupphaphalādisobhāya nātidūranaccāsannatādipañcavidhasenāsanaṅgasampattiyā ca tato tato āgamma ramanti abhiramanti, anukkaṇṭhitā hutvā nivasantīti attho. Vuttappakārāya vā sampattiyā tattha tattha gatepi attano abbhantaraṃyeva ānetvā rametīti ārāmo. So hi anāthapiṇḍikena gahapatinā jetassa rājakumārassa hatthato aṭṭhārasahiraññakoṭīhi santhārena kiṇitvā aṭṭhārasahiraññakoṭīhi senāsanāni kārāpetvā aṭṭhārasahiraññakoṭīhi vihāramahaṃ niṭṭhāpetvā evaṃ catupaññāsahiraññakoṭipariccāgena buddhappamukhassa bhikkhusaṅghassa niyyātito, tasmā ‘‘anāthapiṇḍikassa ārāmo’’ti vuccatīti imamatthaṃ nidasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti ‘‘ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme’’ti yaṃ vuttaṃ vākyaṃ, tattha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siyā"
      },
      "ti kassaci evaṃ parivitakko siyā, vakkhamānākārena kadāci codeyya vāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha tattha viharatī"
      },
      "ti yadi jetavane anāthapiṇḍikassa ārāme viharati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na vattabba"
      },
      "nti nānāṭhānabhūtattā sāvatthijetavanānaṃ, ‘‘ekaṃ samaya’’nti ca vuttattāti adhippāyo. Idāni codako tameva attano adhippāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na hi sakkā’’"
      },
      "tiādinā vivarati. Itaro sabbametaṃ aviparītaṃ atthaṃ ajānantena tayā vuttanti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na kho panetaṃ evaṃ daṭṭhabba’’"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "eta"
      },
      "nti ‘‘sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme’’ti etaṃ vacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eva"
      },
      "nti ‘‘yadi tāva bhagavā’’tiādinā ",
      " yaṃ taṃ bhavatā coditaṃ, taṃ atthato evaṃ na kho pana daṭṭhabbaṃ, na ubhayattha apubbaṃ acarimaṃ vihāradassanatthanti attho. Idāni attanā yathādhippetaṃ aviparītamatthaṃ, tassa ca paṭikacceva vuttabhāvaṃ, tena ca appaṭividdhataṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘nanu avocumha…pe… jetavane’’"
      },
      "ti āha. Evampi ",
      " ‘‘jetavane anāthapiṇḍikassa ārāme viharati’’cceva vattabbaṃ, na ‘‘sāvatthiya’’nti codanaṃ manasi katvā vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘gocaragāmanidassanattha’’"
      },
      "ntiādi."
    ],
    "innerText": "Tatthāti ‘‘ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme’’ti yaṃ vuttaṃ vākyaṃ, tattha. Siyāti kassaci evaṃ parivitakko siyā, vakkhamānākārena kadāci codeyya vāti attho. Atha tattha viharatīti yadi jetavane anāthapiṇḍikassa ārāme viharati. Na vattabbanti nānāṭhānabhūtattā sāvatthijetavanānaṃ, ‘‘ekaṃ samaya’’nti ca vuttattāti adhippāyo. Idāni codako tameva attano adhippāyaṃ ‘‘na hi sakkā’’tiādinā vivarati. Itaro sabbametaṃ aviparītaṃ atthaṃ ajānantena tayā vuttanti dassento ‘‘na kho panetaṃ evaṃ daṭṭhabba’’ntiādimāha. Tattha etanti ‘‘sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme’’ti etaṃ vacanaṃ. Evanti ‘‘yadi tāva bhagavā’’tiādinā yaṃ taṃ bhavatā coditaṃ, taṃ atthato evaṃ na kho pana daṭṭhabbaṃ, na ubhayattha apubbaṃ acarimaṃ vihāradassanatthanti attho. Idāni attanā yathādhippetaṃ aviparītamatthaṃ, tassa ca paṭikacceva vuttabhāvaṃ, tena ca appaṭividdhataṃ pakāsento ‘‘nanu avocumha…pe… jetavane’’ti āha. Evampi ‘‘jetavane anāthapiṇḍikassa ārāme viharati’’cceva vattabbaṃ, na ‘‘sāvatthiya’’nti codanaṃ manasi katvā vuttaṃ – ‘‘gocaragāmanidassanattha’’ntiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Avassañcettha gocaragāmakittanaṃ kattabbaṃ. Tathā hi taṃ yathā jetavanādikittanaṃ pabbajitānuggahakaraṇādianekappayojanaṃ, evaṃ gocaragāmakittanampi gahaṭṭhānuggahakaraṇādivividhapayojananti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sāvatthivacanenā’’"
      },
      "tiādimāha. Tattha paccayaggahaṇena upasaṅkamapayirupāsanānaṃ okāsadānena dhammadesanāya saraṇesu sīlesu ca patiṭṭhāpanena yathūpanissayaṃ uparivisesādhigamāvahanena ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gahaṭṭhānuggahakaraṇaṃ,"
      },
      " uggahaparipucchānaṃ kammaṭṭhānānuyogassa ca anurūpavasanaṭṭhānapariggahenettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pabbajitānuggahakaraṇaṃ"
      },
      " veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Karuṇāya upagamanaṃ,"
      },
      " na lābhādinimittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāya apagamanaṃ,"
      },
      " na virodhādinimittanti upagamanāpagamanānaṃ nirupakkilesataṃ vibhāveti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammikasukhaṃ"
      },
      " nāma anavajjasukhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devatānaṃ upakārabahulatā"
      },
      " janavivittatāya. Pacurajanavivittañhi ṭhānaṃ devā upasaṅkamitabbaṃ maññanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadatthaparinipphādana"
      },
      "nti lokatthanipphādanaṃ, buddhakiccasampādananti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evamādinā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena sāvatthikittanena rūpakāyassa anuggaṇhanaṃ dasseti, jetavanādikittanena dhammakāyassa. Tathā purimena parādhīnakiriyākaraṇaṃ, dutiyena attādhīnakiriyākaraṇaṃ. Purimena vā karuṇākiccaṃ, itarena paññākiccaṃ. Purimena cassa paramāya anukampāya samannāgamaṃ, pacchimena paramāya upekkhāya samannāgamaṃ dīpeti. Bhagavā hi sabbasatte paramāya anukampāya anukampati, na ca tattha sinehadosānupatito paramupekkhakabhāvato. Upekkhako ca na parahitasukhakaraṇe appossukko mahākāruṇikabhāvato. Tassa mahākāruṇikatāya lokanāthatā, upekkhakatāya attanāthatā."
    ],
    "innerText": "Avassañcettha gocaragāmakittanaṃ kattabbaṃ. Tathā hi taṃ yathā jetavanādikittanaṃ pabbajitānuggahakaraṇādianekappayojanaṃ, evaṃ gocaragāmakittanampi gahaṭṭhānuggahakaraṇādivividhapayojananti dassento ‘‘sāvatthivacanenā’’tiādimāha. Tattha paccayaggahaṇena upasaṅkamapayirupāsanānaṃ okāsadānena dhammadesanāya saraṇesu sīlesu ca patiṭṭhāpanena yathūpanissayaṃ uparivisesādhigamāvahanena ca gahaṭṭhānuggahakaraṇaṃ, uggahaparipucchānaṃ kammaṭṭhānānuyogassa ca anurūpavasanaṭṭhānapariggahenettha pabbajitānuggahakaraṇaṃ veditabbaṃ. Karuṇāya upagamanaṃ, na lābhādinimittaṃ. Paññāya apagamanaṃ, na virodhādinimittanti upagamanāpagamanānaṃ nirupakkilesataṃ vibhāveti. Dhammikasukhaṃ nāma anavajjasukhaṃ. Devatānaṃ upakārabahulatā janavivittatāya. Pacurajanavivittañhi ṭhānaṃ devā upasaṅkamitabbaṃ maññanti. Tadatthaparinipphādananti lokatthanipphādanaṃ, buddhakiccasampādananti attho. Evamādināti ādi-saddena sāvatthikittanena rūpakāyassa anuggaṇhanaṃ dasseti, jetavanādikittanena dhammakāyassa. Tathā purimena parādhīnakiriyākaraṇaṃ, dutiyena attādhīnakiriyākaraṇaṃ. Purimena vā karuṇākiccaṃ, itarena paññākiccaṃ. Purimena cassa paramāya anukampāya samannāgamaṃ, pacchimena paramāya upekkhāya samannāgamaṃ dīpeti. Bhagavā hi sabbasatte paramāya anukampāya anukampati, na ca tattha sinehadosānupatito paramupekkhakabhāvato. Upekkhako ca na parahitasukhakaraṇe appossukko mahākāruṇikabhāvato. Tassa mahākāruṇikatāya lokanāthatā, upekkhakatāya attanāthatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā hesa bodhisattabhūto mahākaruṇāya sañcoditamānaso sakalalokahitāya ussukkamāpanno mahābhinīhārato paṭṭhāya ",
      " tadatthanipphādanatthaṃ puññañāṇasambhāre sampādento aparimitaṃ kālaṃ anappakaṃ dukkhamanubhosi, upekkhakatāya sammā patitehi dukkhehi na vikampitatā. Mahākāruṇikatāya saṃsārābhimukhatā, upekkhakatāya tato nibbindanā. Tathā upekkhakatāya nibbānābhimukhatā, mahākāruṇikatāya tadadhigamo. Tathā mahākāruṇikatāya paresaṃ ahiṃsāpanaṃ, upekkhakatāya sayaṃ parehi abhāyanaṃ. Mahākāruṇikatāya paraṃ rakkhato attano rakkhaṇaṃ, upekkhakatāya attānaṃ rakkhato paresaṃ rakkhaṇaṃ. Tenassa attahitāya paṭipannādīsu catutthapuggalabhāvo siddho hoti. Tathā mahākāruṇikatāya saccādhiṭṭhānassa ca cāgādhiṭṭhānassa ca pāripūrī, upekkhakatāya upasamādhiṭṭhānassa ca paññādhiṭṭhānassa ca pāripūrī ",
      ". Evaṃ purisuddhāsayappayogassa mahākāruṇikatāya lokahitatthameva rajjasampadādibhavasampattiyā upagamanaṃ, upekkhakatāya tiṇāyapi amaññamānassa tato apagamanaṃ. Iti suvisuddhaupagamāpagamassa mahākāruṇikatāya lokahitatthameva dānavasena sampattīnaṃ pariccajanā, upekkhakatāya cassa phalassa attano apaccāsīsanā. Evaṃ samudāgamanato paṭṭhāya acchariyabbhutaguṇasamannāgatassa mahākāruṇikatāya paresaṃ hitasukhatthaṃ atidukkarakāritā, upekkhakatāya kāyampi analaṅkāritā."
    ],
    "innerText": "Tathā hesa bodhisattabhūto mahākaruṇāya sañcoditamānaso sakalalokahitāya ussukkamāpanno mahābhinīhārato paṭṭhāya tadatthanipphādanatthaṃ puññañāṇasambhāre sampādento aparimitaṃ kālaṃ anappakaṃ dukkhamanubhosi, upekkhakatāya sammā patitehi dukkhehi na vikampitatā. Mahākāruṇikatāya saṃsārābhimukhatā, upekkhakatāya tato nibbindanā. Tathā upekkhakatāya nibbānābhimukhatā, mahākāruṇikatāya tadadhigamo. Tathā mahākāruṇikatāya paresaṃ ahiṃsāpanaṃ, upekkhakatāya sayaṃ parehi abhāyanaṃ. Mahākāruṇikatāya paraṃ rakkhato attano rakkhaṇaṃ, upekkhakatāya attānaṃ rakkhato paresaṃ rakkhaṇaṃ. Tenassa attahitāya paṭipannādīsu catutthapuggalabhāvo siddho hoti. Tathā mahākāruṇikatāya saccādhiṭṭhānassa ca cāgādhiṭṭhānassa ca pāripūrī, upekkhakatāya upasamādhiṭṭhānassa ca paññādhiṭṭhānassa ca pāripūrī . Evaṃ purisuddhāsayappayogassa mahākāruṇikatāya lokahitatthameva rajjasampadādibhavasampattiyā upagamanaṃ, upekkhakatāya tiṇāyapi amaññamānassa tato apagamanaṃ. Iti suvisuddhaupagamāpagamassa mahākāruṇikatāya lokahitatthameva dānavasena sampattīnaṃ pariccajanā, upekkhakatāya cassa phalassa attano apaccāsīsanā. Evaṃ samudāgamanato paṭṭhāya acchariyabbhutaguṇasamannāgatassa mahākāruṇikatāya paresaṃ hitasukhatthaṃ atidukkarakāritā, upekkhakatāya kāyampi analaṅkāritā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā mahākāruṇikatāya carimattabhāve jiṇṇāturamatadassanena sañjātasaṃvego, upekkhakatāya uḷāresu devabhogasadisesu bhogesu nirapekkho mahābhinikkhamanaṃ nikkhami. Tathā mahākāruṇikatāya ‘‘kicchaṃ vatāyaṃ loko āpanno’’tiādinā (dī. ni. 2.57; saṃ. ni. 2.4, 10) karuṇāmukheneva vipassanārambho, upekkhakatāya buddhabhūtassa satta sattāhāni vivekasukheneva vītināmanaṃ. Mahākāruṇikatāya dhammagambhīrataṃ paccavekkhitvā dhammadesanāya appossukkanaṃ āpajjitvāpi mahābrahmuno ajjhesanāpadesena okāsakaraṇaṃ, upekkhakatāya pañcavaggiyādiveneyyānaṃ ananurūpasamudācārepi anaññathābhāvo. Mahākāruṇikatāya katthaci paṭighātābhāvenassa sabbattha amittasaññābhāvo, upekkhakatāya katthacipi anurodhābhāvena sabbattha sinehasanthavābhāvo. Mahākāruṇikatāya paresaṃ pasādanā, upekkhakatāya ",
      " pasannākārehi na vikampanā. Mahākāruṇikatāya dhammānurāgābhāvena tattha ācariyamuṭṭhiabhāvo, upekkhakatāya sāvakānurāgābhāvena parivāraparikammatābhāvo. Mahākāruṇikatāya dhammaṃ desetuṃ parehi saṃsaggamupagacchatopi upekkhakatāya na tattha abhirati. Mahākāruṇikatāya gāmādīnaṃ āsannaṭṭhāne vasatopi upekkhakatāya araññaṭṭhāne eva viharaṇaṃ. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘purimenassa paramāya anukampāya samannāgamaṃ dīpetī’’"
      },
      "ti."
    ],
    "innerText": "Tathā mahākāruṇikatāya carimattabhāve jiṇṇāturamatadassanena sañjātasaṃvego, upekkhakatāya uḷāresu devabhogasadisesu bhogesu nirapekkho mahābhinikkhamanaṃ nikkhami. Tathā mahākāruṇikatāya ‘‘kicchaṃ vatāyaṃ loko āpanno’’tiādinā (dī. ni. 2.57; saṃ. ni. 2.4, 10) karuṇāmukheneva vipassanārambho, upekkhakatāya buddhabhūtassa satta sattāhāni vivekasukheneva vītināmanaṃ. Mahākāruṇikatāya dhammagambhīrataṃ paccavekkhitvā dhammadesanāya appossukkanaṃ āpajjitvāpi mahābrahmuno ajjhesanāpadesena okāsakaraṇaṃ, upekkhakatāya pañcavaggiyādiveneyyānaṃ ananurūpasamudācārepi anaññathābhāvo. Mahākāruṇikatāya katthaci paṭighātābhāvenassa sabbattha amittasaññābhāvo, upekkhakatāya katthacipi anurodhābhāvena sabbattha sinehasanthavābhāvo. Mahākāruṇikatāya paresaṃ pasādanā, upekkhakatāya pasannākārehi na vikampanā. Mahākāruṇikatāya dhammānurāgābhāvena tattha ācariyamuṭṭhiabhāvo, upekkhakatāya sāvakānurāgābhāvena parivāraparikammatābhāvo. Mahākāruṇikatāya dhammaṃ desetuṃ parehi saṃsaggamupagacchatopi upekkhakatāya na tattha abhirati. Mahākāruṇikatāya gāmādīnaṃ āsannaṭṭhāne vasatopi upekkhakatāya araññaṭṭhāne eva viharaṇaṃ. Tena vuttaṃ – ‘‘purimenassa paramāya anukampāya samannāgamaṃ dīpetī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ta"
      },
      "nti tatrāti padaṃ. ‘‘Desakālaparidīpana’’nti ye desakālā idha viharaṇakiriyāvisesanabhāvena vuttā, tesaṃ paridīpananti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yaṃ samayaṃ…pe… dīpetī’’"
      },
      "ti āha. Taṃ-saddo hi vuttassa atthassa paṭiniddeso, tasmā idha kālassa desassa vā paṭiniddeso bhavitumarahati, na aññassa. Ayaṃ tāva tatra-saddassa paṭiniddesabhāve atthavibhāvanā. Yasmā pana īdisesu ṭhānesu tatra-saddo dhammadesanāvisiṭṭhaṃ desakālañca vibhāveti, tasmā vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bhāsitabbayutte vā desakāle dīpetī’’"
      },
      "ti. Tena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatrā"
      },
      "ti yatra bhagavā dhammadesanatthaṃ bhikkhū ālapati bhāsati, tādise dese, kāle vāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na hī"
      },
      "tiādinā tamevatthaṃ samattheti. Nanu ca yattha ṭhito bhagavā ‘‘akālo kho tāvā’’tiādinā ",
      " bāhiyassa dhammadesanaṃ paṭikkhipi, tattheva antaravīthiyaṃ ṭhito tassa dhammaṃ desesīti? Saccametaṃ, adesetabbakāle adesanāya idaṃ udāharaṇaṃ. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘akālo kho tāvā’’"
      },
      "ti."
    ],
    "innerText": "Tanti tatrāti padaṃ. ‘‘Desakālaparidīpana’’nti ye desakālā idha viharaṇakiriyāvisesanabhāvena vuttā, tesaṃ paridīpananti dassento ‘‘yaṃ samayaṃ…pe… dīpetī’’ti āha. Taṃ-saddo hi vuttassa atthassa paṭiniddeso, tasmā idha kālassa desassa vā paṭiniddeso bhavitumarahati, na aññassa. Ayaṃ tāva tatra-saddassa paṭiniddesabhāve atthavibhāvanā. Yasmā pana īdisesu ṭhānesu tatra-saddo dhammadesanāvisiṭṭhaṃ desakālañca vibhāveti, tasmā vuttaṃ – ‘‘bhāsitabbayutte vā desakāle dīpetī’’ti. Tena tatrāti yatra bhagavā dhammadesanatthaṃ bhikkhū ālapati bhāsati, tādise dese, kāle vāti attho. Na hītiādinā tamevatthaṃ samattheti. Nanu ca yattha ṭhito bhagavā ‘‘akālo kho tāvā’’tiādinā bāhiyassa dhammadesanaṃ paṭikkhipi, tattheva antaravīthiyaṃ ṭhito tassa dhammaṃ desesīti? Saccametaṃ, adesetabbakāle adesanāya idaṃ udāharaṇaṃ. Tenevāha – ‘‘akālo kho tāvā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yaṃ pana tattha vuttaṃ – ‘‘antaragharaṃ paviṭṭhamhā’’ti, tampi tassa akālabhāvasseva pariyāyena dassanatthaṃ vuttaṃ. Tassa hi tadā addhānaparissamena rūpakāye akammaññatā ahosi, balavapītivegena nāmakāye. Tadubhayassa vūpasamaṃ āgamento papañcaparihāratthaṃ bhagavā ‘‘akālo kho’’ti pariyāyena paṭikkhipi. Adesetabbadese adesanāya pana udāharaṇaṃ ‘‘atha kho bhagavā maggā okkamma aññatarasmiṃ rukkhamūle nisīdi (saṃ. ni. 2.154), vihārapacchāyāyaṃ paññatte āsane nisīdī’’ti (dī. ni. 1.363) ca evamādikaṃ idha ādisaddena saṅgahitaṃ. ‘‘Atha kho so, bhikkhave, bālo idha pubbe nesādo idha pāpāni kammāni karitvā’’tiādīsu (ma. ni. 3.251) padapūraṇamatte kho-saddo, ‘‘dukkhaṃ kho agāravo viharati ",
      " appatisso’’tiādīsu (a. ni. 4.21) avadhāraṇe, ‘‘kittāvatā nu kho, āvuso, satthu pavivittassa viharato sāvakā vivekaṃ nānusikkhantī’’tiādīsu (ma. ni. 1.31) ādikālatthe, vākyārambheti attho. Tattha padapūraṇena vacanālaṅkāramattaṃ kataṃ hoti, ādikālatthena vākyassa upaññāsamattaṃ. Avadhāraṇatthena pana niyamadassanaṃ, tasmā āmantesi evāti āmantane niyamo dassito hoti."
    ],
    "innerText": "Yaṃ pana tattha vuttaṃ – ‘‘antaragharaṃ paviṭṭhamhā’’ti, tampi tassa akālabhāvasseva pariyāyena dassanatthaṃ vuttaṃ. Tassa hi tadā addhānaparissamena rūpakāye akammaññatā ahosi, balavapītivegena nāmakāye. Tadubhayassa vūpasamaṃ āgamento papañcaparihāratthaṃ bhagavā ‘‘akālo kho’’ti pariyāyena paṭikkhipi. Adesetabbadese adesanāya pana udāharaṇaṃ ‘‘atha kho bhagavā maggā okkamma aññatarasmiṃ rukkhamūle nisīdi (saṃ. ni. 2.154), vihārapacchāyāyaṃ paññatte āsane nisīdī’’ti (dī. ni. 1.363) ca evamādikaṃ idha ādisaddena saṅgahitaṃ. ‘‘Atha kho so, bhikkhave, bālo idha pubbe nesādo idha pāpāni kammāni karitvā’’tiādīsu (ma. ni. 3.251) padapūraṇamatte kho-saddo, ‘‘dukkhaṃ kho agāravo viharati appatisso’’tiādīsu (a. ni. 4.21) avadhāraṇe, ‘‘kittāvatā nu kho, āvuso, satthu pavivittassa viharato sāvakā vivekaṃ nānusikkhantī’’tiādīsu (ma. ni. 1.31) ādikālatthe, vākyārambheti attho. Tattha padapūraṇena vacanālaṅkāramattaṃ kataṃ hoti, ādikālatthena vākyassa upaññāsamattaṃ. Avadhāraṇatthena pana niyamadassanaṃ, tasmā āmantesi evāti āmantane niyamo dassito hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavāti lokagarudīpana"
      },
      "nti kasmā vuttaṃ, nanu pubbepi bhagavāsaddassa attho vuttoti? Yadipi vutto, taṃ panassa yathāvutte ṭhāne viharaṇakiriyāya kattu visesadassanatthaṃ kataṃ, na āmantanakiriyāya, idha pana āmantanakiriyāya, tasmā tadatthaṃ puna ‘‘bhagavā’’ti pāḷiyaṃ vuttanti tassatthaṃ dassetuṃ ‘‘bhagavāti lokagarudīpana’’nti āha. Tena lokagarubhāvato tadanurūpaṃ paṭipattiṃ patthento attano santikaṃ upagatānaṃ bhikkhūnaṃ ajjhāsayānurūpaṃ dhammaṃ desetuṃ te āmantesīti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathāsavanayuttapuggalavacana"
      },
      "nti vakkhamānāya cittapariyādānadesanāya savanayoggapuggalavacanaṃ. Catūsupi parisāsu bhikkhū eva edisānaṃ desanānaṃ visesena bhājanabhūtāti sātisayaṃ sāsanasampaṭiggāhakabhāvadassanatthaṃ idha bhikkhuggahaṇanti dassetvā idāni saddatthaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘apicā’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhikkhakoti bhikkhū"
      },
      "ti bhikkhanadhammatāya bhikkhūti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhācariyaṃ ajjhupagato"
      },
      "ti buddhādīhi ajjhupagataṃ bhikkhācariyaṃ, uñchācariyaṃ, ajjhupagatattā anuṭṭhitattā bhikkhu. Yo hi appaṃ vā mahantaṃ vā bhogakkhandhaṃ pahāya agārasmā anagāriyaṃ pabbajito, so kasigorakkhādijīvikākappanaṃ hitvā liṅgasampaṭicchaneneva ",
      " bhikkhācariyaṃ ajjhupagatattā bhikkhu, parappaṭibaddhajīvikattā vā vihāramajjhe kājabhattaṃ bhuñjamānopi bhikkhācariyaṃ ajjhupagatoti bhikkhu, piṇḍiyālopabhojanaṃ nissāya pabbajjāya ussāhajātattā vā bhikkhācariyaṃ ajjhupagatoti bhikkhūti evamettha attho daṭṭhabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādinā nayenā"
      },
      "ti ‘‘chinnabhinnapaṭadharoti bhikkhu, bhindati pāpake akusale dhammeti bhikkhu, bhinnattā pāpakānaṃ akusalānaṃ dhammānaṃ bhikkhū’’tiādinā (vibha. 510) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhaṅge"
      },
      " āgatanayena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāpane"
      },
      "ti avabodhane, paṭivedaneti attho."
    ],
    "innerText": "Bhagavāti lokagarudīpananti kasmā vuttaṃ, nanu pubbepi bhagavāsaddassa attho vuttoti? Yadipi vutto, taṃ panassa yathāvutte ṭhāne viharaṇakiriyāya kattu visesadassanatthaṃ kataṃ, na āmantanakiriyāya, idha pana āmantanakiriyāya, tasmā tadatthaṃ puna ‘‘bhagavā’’ti pāḷiyaṃ vuttanti tassatthaṃ dassetuṃ ‘‘bhagavāti lokagarudīpana’’nti āha. Tena lokagarubhāvato tadanurūpaṃ paṭipattiṃ patthento attano santikaṃ upagatānaṃ bhikkhūnaṃ ajjhāsayānurūpaṃ dhammaṃ desetuṃ te āmantesīti dasseti. Kathāsavanayuttapuggalavacananti vakkhamānāya cittapariyādānadesanāya savanayoggapuggalavacanaṃ. Catūsupi parisāsu bhikkhū eva edisānaṃ desanānaṃ visesena bhājanabhūtāti sātisayaṃ sāsanasampaṭiggāhakabhāvadassanatthaṃ idha bhikkhuggahaṇanti dassetvā idāni saddatthaṃ dassetuṃ ‘‘apicā’’tiādimāha. Tattha bhikkhakoti bhikkhūti bhikkhanadhammatāya bhikkhūti attho. Bhikkhācariyaṃ ajjhupagatoti buddhādīhi ajjhupagataṃ bhikkhācariyaṃ, uñchācariyaṃ, ajjhupagatattā anuṭṭhitattā bhikkhu. Yo hi appaṃ vā mahantaṃ vā bhogakkhandhaṃ pahāya agārasmā anagāriyaṃ pabbajito, so kasigorakkhādijīvikākappanaṃ hitvā liṅgasampaṭicchaneneva bhikkhācariyaṃ ajjhupagatattā bhikkhu, parappaṭibaddhajīvikattā vā vihāramajjhe kājabhattaṃ bhuñjamānopi bhikkhācariyaṃ ajjhupagatoti bhikkhu, piṇḍiyālopabhojanaṃ nissāya pabbajjāya ussāhajātattā vā bhikkhācariyaṃ ajjhupagatoti bhikkhūti evamettha attho daṭṭhabbo. Ādinā nayenāti ‘‘chinnabhinnapaṭadharoti bhikkhu, bhindati pāpake akusale dhammeti bhikkhu, bhinnattā pāpakānaṃ akusalānaṃ dhammānaṃ bhikkhū’’tiādinā (vibha. 510) vibhaṅge āgatanayena. Ñāpaneti avabodhane, paṭivedaneti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhanasīlatā"
      },
      "ti ",
      " bhikkhanena jīvanasīlatā, na kasivāṇijjādinā jīvanasīlatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhanadhammatā"
      },
      "ti ‘‘uddissa ariyā tiṭṭhantī’’ti (jā. 1.7.59) evaṃ vuttā bhikkhanasabhāvatā, na yācanakohaññasabhāvatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhane sādhukāritā"
      },
      "ti ‘‘uttiṭṭhe nappamajjeyyā’’ti (dha. pa. 168) vacanaṃ anussaritvā tattha appamajjanā. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīlaṃ"
      },
      " nāma pakatisabhāvo, idha pana tadadhiṭṭhānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammo"
      },
      "ti vataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhukāritā"
      },
      "ti sakkaccakāritā ādarakiriyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hīnādhikajanasevita"
      },
      "nti ye bhikkhubhāve ṭhitāpi jātimadādivasena uddhatā unnaḷā, ye ca gihibhāve paresaṃ adhikabhāvampi anupagatattā bhikkhācariyaṃ paramakāruññataṃ maññanti, tesaṃ ubhayesampi yathākkamaṃ ‘‘bhikkhavo’’ti vacanena hīnajanehi daliddehi paramakāruññataṃ pattehi parakulesu bhikkhācariyāya jīvikaṃ kappentehi sevitaṃ vuttiṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddhatabhāvaniggahaṃ karoti"
      },
      ". Adhikajanehi uḷārabhogakhattiyakulādito pabbajitehi buddhādīhi ājīvavisodhanatthaṃ sevitaṃ vuttiṃ pakāsento dīnabhāvaniggahaṃ karotīti yojetabbaṃ. Yasmā ‘‘bhikkhavo’’ti vacanaṃ āmantanabhāvato abhimukhīkaraṇaṃ, pakaraṇato sāmatthiyato ca sussusājananaṃ sakkaccasavanamanasikāraniyojanañca hoti, tasmā tamatthaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bhikkhavoti iminā’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sādhukaṃ savanamanasikāre"
      },
      "ti sādhukasavane sādhukamanasikāre ca. Kathaṃ pana pavattitā savanādayo sādhukaṃ pavattitā hontīti? ‘‘Addhā imāya sammāpaṭipattiyā sakalasāsanasampatti hatthagatā bhavissatī’’ti ādaragāravayogena kathādīsu aparibhavādinā ca. Vuttañhi ‘‘pañcahi, bhikkhave, dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi pañcahi? Kathaṃ na paribhoti, kathitaṃ na paribhoti, na attānaṃ paribhoti, avikkhittacitto dhammaṃ suṇāti ekaggacitto, yoniso ca manasikaroti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammatta’’nti (a. ni. 5.151). Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sādhukaṃ savanamanasikārāyattā hi sāsanasampattī’’"
      },
      "ti."
    ],
    "innerText": "Bhikkhanasīlatāti bhikkhanena jīvanasīlatā, na kasivāṇijjādinā jīvanasīlatā. Bhikkhanadhammatāti ‘‘uddissa ariyā tiṭṭhantī’’ti (jā. 1.7.59) evaṃ vuttā bhikkhanasabhāvatā, na yācanakohaññasabhāvatā. Bhikkhane sādhukāritāti ‘‘uttiṭṭhe nappamajjeyyā’’ti (dha. pa. 168) vacanaṃ anussaritvā tattha appamajjanā. Atha vā sīlaṃ nāma pakatisabhāvo, idha pana tadadhiṭṭhānaṃ. Dhammoti vataṃ. Sādhukāritāti sakkaccakāritā ādarakiriyā. Hīnādhikajanasevitanti ye bhikkhubhāve ṭhitāpi jātimadādivasena uddhatā unnaḷā, ye ca gihibhāve paresaṃ adhikabhāvampi anupagatattā bhikkhācariyaṃ paramakāruññataṃ maññanti, tesaṃ ubhayesampi yathākkamaṃ ‘‘bhikkhavo’’ti vacanena hīnajanehi daliddehi paramakāruññataṃ pattehi parakulesu bhikkhācariyāya jīvikaṃ kappentehi sevitaṃ vuttiṃ pakāsento uddhatabhāvaniggahaṃ karoti. Adhikajanehi uḷārabhogakhattiyakulādito pabbajitehi buddhādīhi ājīvavisodhanatthaṃ sevitaṃ vuttiṃ pakāsento dīnabhāvaniggahaṃ karotīti yojetabbaṃ. Yasmā ‘‘bhikkhavo’’ti vacanaṃ āmantanabhāvato abhimukhīkaraṇaṃ, pakaraṇato sāmatthiyato ca sussusājananaṃ sakkaccasavanamanasikāraniyojanañca hoti, tasmā tamatthaṃ dassento ‘‘bhikkhavoti iminā’’tiādimāha. Tattha sādhukaṃ savanamanasikāreti sādhukasavane sādhukamanasikāre ca. Kathaṃ pana pavattitā savanādayo sādhukaṃ pavattitā hontīti? ‘‘Addhā imāya sammāpaṭipattiyā sakalasāsanasampatti hatthagatā bhavissatī’’ti ādaragāravayogena kathādīsu aparibhavādinā ca. Vuttañhi ‘‘pañcahi, bhikkhave, dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi pañcahi? Kathaṃ na paribhoti, kathitaṃ na paribhoti, na attānaṃ paribhoti, avikkhittacitto dhammaṃ suṇāti ekaggacitto, yoniso ca manasikaroti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammatta’’nti (a. ni. 5.151). Tenevāha – ‘‘sādhukaṃ savanamanasikārāyattā hi sāsanasampattī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pubbe ",
      " sabbaparisāsādhāraṇattepi bhagavato dhammadesanāya ‘‘jeṭṭhaseṭṭhā’’tiādinā bhikkhūnaṃ eva āmantane kāraṇaṃ dassetvā idāni bhikkhū ",
      " āmantetvāva dhammadesanāya payojanaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kimatthaṃ pana bhagavā’’"
      },
      "ti codanaṃ samuṭṭhāpeti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññaṃ cintentā"
      },
      "ti aññavihitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vikkhittacittā"
      },
      "ti asamāhitacittā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammaṃ paccavekkhantā"
      },
      "ti hiyyo tato paraṃ divasesu vā sutadhammaṃ pati pati manasā avekkhantā. Bhikkhū āmantetvā dhamme desiyamāne ādito paṭṭhāya desanaṃ sallakkhetuṃ sakkontīti imamatthaṃ byatirekamukhena dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘te anāmantetvā’’"
      },
      "tiādi vuttaṃ."
    ],
    "innerText": "Pubbe sabbaparisāsādhāraṇattepi bhagavato dhammadesanāya ‘‘jeṭṭhaseṭṭhā’’tiādinā bhikkhūnaṃ eva āmantane kāraṇaṃ dassetvā idāni bhikkhū āmantetvāva dhammadesanāya payojanaṃ dassetuṃ ‘‘kimatthaṃ pana bhagavā’’ti codanaṃ samuṭṭhāpeti. Tattha aññaṃ cintentāti aññavihitā. Vikkhittacittāti asamāhitacittā. Dhammaṃ paccavekkhantāti hiyyo tato paraṃ divasesu vā sutadhammaṃ pati pati manasā avekkhantā. Bhikkhū āmantetvā dhamme desiyamāne ādito paṭṭhāya desanaṃ sallakkhetuṃ sakkontīti imamatthaṃ byatirekamukhena dassetuṃ ‘‘te anāmantetvā’’tiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhavo"
      },
      "ti cettha sandhivasena i-kāralopo daṭṭhabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhavo itī"
      },
      "ti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iti"
      },
      "-saddo hetuparisamāpanādiatthapadatthavipariyāyapakārāvadhāraṇanidassanādianekatthappabhedo. Tathā hesa ‘‘ruppatīti kho, bhikkhave, tasmā rūpanti vuccatī’’tiādīsu (saṃ. ni. 3.79) hetvatthe dissati. ‘‘Tasmātiha me, bhikkhave, dhammadāyādā bhavatha, mā āmisadāyādā. Atthi me tumhesu anukampā. Kinti me sāvakā dhammadāyādā bhaveyyuṃ, no āmisadāyādā’’tiādīsu (ma. ni. 1.19) parisamāpane. ‘‘Iti vā iti evarūpā naccagītavāditavisūkadassanā paṭivirato’’tiādīsu (dī. ni. 1.13) ādiatthe. ‘‘Māgaṇḍiyoti tassa brāhmaṇassa saṅkhā samaññā paññatti vohāro nāmaṃ nāmakammaṃ nāmadheyyaṃ nirutti byañjanamabhilāpo’’tiādīsu (mahāni. 73, 75) padatthavipariyāye. ‘‘Iti kho, bhikkhave, sappaṭibhayo bālo, appaṭibhayo paṇḍito, saupaddavo bālo, anupaddavo paṇḍito, saupasaggo bālo, anupasaggo paṇḍito’’tiādīsu (ma. ni. 3.124) pakāre. ‘‘Atthi idappaccayā jarāmaraṇanti puṭṭhena satā, ‘ānanda, atthī’tissa vacanīyaṃ. ‘Kiṃ paccayā jarāmaraṇa’nti iti ce vadeyya. Jātipaccayā jarāmaraṇaṃ iccassa vacanīya’’ntiādīsu (dī. ni. 2.96) avadhāraṇe. ‘‘Atthīti kho, kaccāna, ayameko anto, natthīti kho, kaccāna, ayaṃ dutiyo anto’’tiādīsu (saṃ. ni. 2.15; saṃ. ni. 3.90) nidassane. Idhāpi nidassane eva daṭṭhabbo. Bhikkhavoti hi āmantanākāro. Tamesa iti-saddo nidasseti ‘‘bhikkhavoti āmantesī’’ti. Iminā nayena ‘‘bhaddante’’tiādīsupi yathārahaṃ iti-saddassa attho veditabbo. Pubbe ‘‘bhagavā āmantesī’’ti vuttattā ‘‘bhagavato paccassosu’’nti ",
      " idha ‘‘bhagavato’’ti sāmivacanaṃ āmantanameva sambandhiantaraṃ apekkhatīti iminā adhippāyena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bhagavato āmantanaṃ paṭiassosu’’"
      },
      "nti vuttaṃ. ‘‘Bhagavato’’ti pana idaṃ paṭissavasambandhena sampadānavacanaṃ yathā ‘‘devadattāya paṭissuṇotī’’ti. Yaṃ nidānaṃ bhāsitanti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imassa suttassa sukhāvagāhaṇattha"
      },
      "nti kamalakuvalayujjalavimalasādurasasalilāya pokkharaṇiyā ",
      " sukhāvataraṇatthaṃ nimmalasilātalaracanāvilāsasobhitaratanasopānaṃ vippakiṇṇamuttātalasadisavālukācuṇṇapaṇḍarabhūmibhāgaṃ titthaṃ viya suvibhattabhittivicitravedikāparikkhittassa nakkhattapathaṃ phusitukāmatāya viya paṭivijambhitasamussayassa pāsādavarassa sukhārohanatthaṃ dantamayasaṇhamuduphalakañcanalatāvinaddhamaṇigaṇappabhāsamudayujjalasobhaṃ sopānaṃ viya suvaṇṇavalayanūpurādisaṅghaṭṭanasaddasammissitassa kathitahasitamadhurassaragehajanavijambhitavicaritassa uḷāraissariyavibhavasobhitassa mahāgharassa sukhappavesanatthaṃ suvaṇṇarajatamaṇimuttāpavāḷādijutivissaravijjotitasuppatiṭṭhitavisāladvārabāhaṃ mahādvāraṃ viya ca atthabyañjanasampannassa buddhānaṃ desanāñāṇagambhīrabhāvasaṃsūcakassa imassa suttassa sukhāvagāhatthaṃ."
    ],
    "innerText": "Bhikkhavoti cettha sandhivasena i-kāralopo daṭṭhabbo. Bhikkhavo itīti ayaṃ iti-saddo hetuparisamāpanādiatthapadatthavipariyāyapakārāvadhāraṇanidassanādianekatthappabhedo. Tathā hesa ‘‘ruppatīti kho, bhikkhave, tasmā rūpanti vuccatī’’tiādīsu (saṃ. ni. 3.79) hetvatthe dissati. ‘‘Tasmātiha me, bhikkhave, dhammadāyādā bhavatha, mā āmisadāyādā. Atthi me tumhesu anukampā. Kinti me sāvakā dhammadāyādā bhaveyyuṃ, no āmisadāyādā’’tiādīsu (ma. ni. 1.19) parisamāpane. ‘‘Iti vā iti evarūpā naccagītavāditavisūkadassanā paṭivirato’’tiādīsu (dī. ni. 1.13) ādiatthe. ‘‘Māgaṇḍiyoti tassa brāhmaṇassa saṅkhā samaññā paññatti vohāro nāmaṃ nāmakammaṃ nāmadheyyaṃ nirutti byañjanamabhilāpo’’tiādīsu (mahāni. 73, 75) padatthavipariyāye. ‘‘Iti kho, bhikkhave, sappaṭibhayo bālo, appaṭibhayo paṇḍito, saupaddavo bālo, anupaddavo paṇḍito, saupasaggo bālo, anupasaggo paṇḍito’’tiādīsu (ma. ni. 3.124) pakāre. ‘‘Atthi idappaccayā jarāmaraṇanti puṭṭhena satā, ‘ānanda, atthī’tissa vacanīyaṃ. ‘Kiṃ paccayā jarāmaraṇa’nti iti ce vadeyya. Jātipaccayā jarāmaraṇaṃ iccassa vacanīya’’ntiādīsu (dī. ni. 2.96) avadhāraṇe. ‘‘Atthīti kho, kaccāna, ayameko anto, natthīti kho, kaccāna, ayaṃ dutiyo anto’’tiādīsu (saṃ. ni. 2.15; saṃ. ni. 3.90) nidassane. Idhāpi nidassane eva daṭṭhabbo. Bhikkhavoti hi āmantanākāro. Tamesa iti-saddo nidasseti ‘‘bhikkhavoti āmantesī’’ti. Iminā nayena ‘‘bhaddante’’tiādīsupi yathārahaṃ iti-saddassa attho veditabbo. Pubbe ‘‘bhagavā āmantesī’’ti vuttattā ‘‘bhagavato paccassosu’’nti idha ‘‘bhagavato’’ti sāmivacanaṃ āmantanameva sambandhiantaraṃ apekkhatīti iminā adhippāyena ‘‘bhagavato āmantanaṃ paṭiassosu’’nti vuttaṃ. ‘‘Bhagavato’’ti pana idaṃ paṭissavasambandhena sampadānavacanaṃ yathā ‘‘devadattāya paṭissuṇotī’’ti. Yaṃ nidānaṃ bhāsitanti sambandho. Imassa suttassa sukhāvagāhaṇatthanti kamalakuvalayujjalavimalasādurasasalilāya pokkharaṇiyā sukhāvataraṇatthaṃ nimmalasilātalaracanāvilāsasobhitaratanasopānaṃ vippakiṇṇamuttātalasadisavālukācuṇṇapaṇḍarabhūmibhāgaṃ titthaṃ viya suvibhattabhittivicitravedikāparikkhittassa nakkhattapathaṃ phusitukāmatāya viya paṭivijambhitasamussayassa pāsādavarassa sukhārohanatthaṃ dantamayasaṇhamuduphalakañcanalatāvinaddhamaṇigaṇappabhāsamudayujjalasobhaṃ sopānaṃ viya suvaṇṇavalayanūpurādisaṅghaṭṭanasaddasammissitassa kathitahasitamadhurassaragehajanavijambhitavicaritassa uḷāraissariyavibhavasobhitassa mahāgharassa sukhappavesanatthaṃ suvaṇṇarajatamaṇimuttāpavāḷādijutivissaravijjotitasuppatiṭṭhitavisāladvārabāhaṃ mahādvāraṃ viya ca atthabyañjanasampannassa buddhānaṃ desanāñāṇagambhīrabhāvasaṃsūcakassa imassa suttassa sukhāvagāhatthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Etthāha – ‘‘kimatthaṃ pana dhammavinayasaṅgahe kayiramāne nidānavacanaṃ, nanu bhagavatā bhāsitavacanasseva saṅgaho kātabbo’’ti? Vuccate, desanāya ṭhitiasammosasaddheyyabhāvasampādanatthaṃ. Kāladesadesakanimittaparisāpadesehi upanibandhitvā ṭhapitā hi desanā ciraṭṭhitikā hoti asammosadhammā saddheyyā ca. Desakālakattuhetunimittehi upanibaddho viya vohāravinicchayo. Teneva ca āyasmatā mahākassapena ‘‘cittapariyādānasuttaṃ, āvuso ānanda, kattha bhāsita’’ntiādinā desādipucchāsu katāsu tāsaṃ vissajjanaṃ karontena dhammabhaṇḍāgārikena ‘‘evaṃ me suta’’ntiādinā imassa suttassa nidānaṃ bhāsitaṃ. Apica satthusampattippakāsanatthaṃ nidānavacanaṃ. Tathāgatassa hi bhagavato pubbacaraṇānumānāgamatakkābhāvato sammāsambuddhabhāvasiddhi. Na hi sammāsambussa pubbacaraṇādīhi attho atthi sabbattha appaṭihatañāṇacāratāya ekappamāṇattā ca ñeyyadhammesu. Tathā ācariyamuṭṭhidhammamacchariyasāsanasāvakānānurāgābhāvato khīṇāsavabhāvasiddhi. Na hi sabbaso khīṇāsavassa te sambhavantīti suvisuddhassa parānuggahappavatti. Evaṃ ",
      " desakasaṃkilesabhūtānaṃ diṭṭhisīlasampadādūsakānaṃ avijjātaṇhānaṃ accantābhāvasaṃsūcakehi ñāṇappahānasampadābhibyañjanakehi ca sambuddhavisuddhabhāvehi purimavesārajjadvayasiddhi, tato ca antarāyikaniyyānikadhammesu sammohābhāvasiddhito pacchimavesārajjadvayasiddhīti bhagavato catuvesārajjasamannāgamo attahitaparahitappaṭipatti ca nidānavacanena pakāsitā hoti. Tattha tattha sampattaparisāya ajjhāsayānurūpaṃ ṭhānuppattikappaṭibhānena dhammadesanādīpanato, idha pana rūpagarukānaṃ puggalānaṃ ajjhāsayānurūpaṃ ṭhānuppattikappaṭibhānena dhammadesanādīpanatoti yojetabbaṃ. Tena vuttaṃ – ‘‘satthusampattippakāsanatthaṃ nidānavacana’’nti."
    ],
    "innerText": "Etthāha – ‘‘kimatthaṃ pana dhammavinayasaṅgahe kayiramāne nidānavacanaṃ, nanu bhagavatā bhāsitavacanasseva saṅgaho kātabbo’’ti? Vuccate, desanāya ṭhitiasammosasaddheyyabhāvasampādanatthaṃ. Kāladesadesakanimittaparisāpadesehi upanibandhitvā ṭhapitā hi desanā ciraṭṭhitikā hoti asammosadhammā saddheyyā ca. Desakālakattuhetunimittehi upanibaddho viya vohāravinicchayo. Teneva ca āyasmatā mahākassapena ‘‘cittapariyādānasuttaṃ, āvuso ānanda, kattha bhāsita’’ntiādinā desādipucchāsu katāsu tāsaṃ vissajjanaṃ karontena dhammabhaṇḍāgārikena ‘‘evaṃ me suta’’ntiādinā imassa suttassa nidānaṃ bhāsitaṃ. Apica satthusampattippakāsanatthaṃ nidānavacanaṃ. Tathāgatassa hi bhagavato pubbacaraṇānumānāgamatakkābhāvato sammāsambuddhabhāvasiddhi. Na hi sammāsambussa pubbacaraṇādīhi attho atthi sabbattha appaṭihatañāṇacāratāya ekappamāṇattā ca ñeyyadhammesu. Tathā ācariyamuṭṭhidhammamacchariyasāsanasāvakānānurāgābhāvato khīṇāsavabhāvasiddhi. Na hi sabbaso khīṇāsavassa te sambhavantīti suvisuddhassa parānuggahappavatti. Evaṃ desakasaṃkilesabhūtānaṃ diṭṭhisīlasampadādūsakānaṃ avijjātaṇhānaṃ accantābhāvasaṃsūcakehi ñāṇappahānasampadābhibyañjanakehi ca sambuddhavisuddhabhāvehi purimavesārajjadvayasiddhi, tato ca antarāyikaniyyānikadhammesu sammohābhāvasiddhito pacchimavesārajjadvayasiddhīti bhagavato catuvesārajjasamannāgamo attahitaparahitappaṭipatti ca nidānavacanena pakāsitā hoti. Tattha tattha sampattaparisāya ajjhāsayānurūpaṃ ṭhānuppattikappaṭibhānena dhammadesanādīpanato, idha pana rūpagarukānaṃ puggalānaṃ ajjhāsayānurūpaṃ ṭhānuppattikappaṭibhānena dhammadesanādīpanatoti yojetabbaṃ. Tena vuttaṃ – ‘‘satthusampattippakāsanatthaṃ nidānavacana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā sāsanasampattippakāsanatthaṃ nidānavacanaṃ. Ñāṇakaruṇāpariggahitasabbakiriyassa hi bhagavato ",
      " natthi niratthakā paṭipatti, attahitatthā vā. Tasmā paresaṃ eva atthāya pavattasabbakiriyassa sammāsambuddhassa sakalampi kāyavacīmanokammaṃ yathāpavattaṃ vuccamānaṃ diṭṭhadhammikasamparāyikaparamatthehi yathārahaṃ sattānaṃ anusāsanaṭṭhena sāsanaṃ, na kapparacanā. Tayidaṃ satthucaritaṃ kāladesadesakaparisāpadesehi saddhiṃ tattha tattha nidānavacanehi yathārahaṃ pakāsīyati. ‘‘Idha pana rūpagarukānaṃ puggalāna’’ntiādi sabbaṃ purimasadisameva. Tena vuttaṃ – ‘‘sāsanasampattippakāsanatthaṃ nidānavacana’’nti. Apica satthuno pamāṇabhāvappakāsanena vacanena sāsanassa pamāṇabhāvadassanatthaṃ nidānavacanaṃ, tañca desakappamāṇabhāvadassanaṃ heṭṭhā vuttanayānusārena ‘‘bhagavā’’ti ca iminā padena vibhāvitanti veditabbaṃ. Bhagavāti hi tathāgatassa rāgadosamohādisabbakilesamaladuccaritadosappahānadīpanena vacanena anaññasādhāraṇasuparisuddhañāṇakaruṇādiguṇavisesayogaparidīpanena tato eva sabbasattuttamabhāvadīpanena ayamattho sabbathā pakāsito hotīti. Idamettha nidānavacanappayojanassa mukhamattanidassanaṃ."
    ],
    "innerText": "Tathā sāsanasampattippakāsanatthaṃ nidānavacanaṃ. Ñāṇakaruṇāpariggahitasabbakiriyassa hi bhagavato natthi niratthakā paṭipatti, attahitatthā vā. Tasmā paresaṃ eva atthāya pavattasabbakiriyassa sammāsambuddhassa sakalampi kāyavacīmanokammaṃ yathāpavattaṃ vuccamānaṃ diṭṭhadhammikasamparāyikaparamatthehi yathārahaṃ sattānaṃ anusāsanaṭṭhena sāsanaṃ, na kapparacanā. Tayidaṃ satthucaritaṃ kāladesadesakaparisāpadesehi saddhiṃ tattha tattha nidānavacanehi yathārahaṃ pakāsīyati. ‘‘Idha pana rūpagarukānaṃ puggalāna’’ntiādi sabbaṃ purimasadisameva. Tena vuttaṃ – ‘‘sāsanasampattippakāsanatthaṃ nidānavacana’’nti. Apica satthuno pamāṇabhāvappakāsanena vacanena sāsanassa pamāṇabhāvadassanatthaṃ nidānavacanaṃ, tañca desakappamāṇabhāvadassanaṃ heṭṭhā vuttanayānusārena ‘‘bhagavā’’ti ca iminā padena vibhāvitanti veditabbaṃ. Bhagavāti hi tathāgatassa rāgadosamohādisabbakilesamaladuccaritadosappahānadīpanena vacanena anaññasādhāraṇasuparisuddhañāṇakaruṇādiguṇavisesayogaparidīpanena tato eva sabbasattuttamabhāvadīpanena ayamattho sabbathā pakāsito hotīti. Idamettha nidānavacanappayojanassa mukhamattanidassanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nikkhittassā"
      },
      "ti desitassa. Desanā hi desetabbassa sīlādiatthassa veneyyasantānesu nikkhipanato ‘‘nikkhepo’’ti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suttanikkhepaṃ vicāretvāva vuccamānā pākaṭā hotī"
      },
      "ti sāmaññato bhagavato desanāya samuṭṭhānassa vibhāgaṃ dassetvā ‘‘etthāyaṃ desanā evaṃsamuṭṭhānā’’ti desanāya samuṭṭhāne dassite suttassa sammadeva nidānaparijānanena vaṇṇanāya suviññeyyattā vuttaṃ. Tattha yathā ",
      " anekasataanekasahassabhedānipi suttantāni saṃkilesabhāgiyādipaṭṭhānanayavasena soḷasavidhataṃ nātivattanti, evaṃ attajjhāsayādisuttanikkhepavasena catubbidhabhāvanti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cattāro hi suttanikkhepā’’"
      },
      "ti. Ettha ca yathā attajjhāsayassa aṭṭhuppattiyā ca parajjhāsayapucchāhi saddhiṃ saṃsaggabhedo sambhavati ‘‘attajjhāsayo ca parajjhāsayo ca, attajjhāsayo ca pucchāvasiko ca, aṭṭhuppattiko ca parajjhāsayo ca, aṭṭhuppattiko ca pucchāvasiko cā’’ti ajjhāsayapucchānusandhisabbhāvato, evaṃ yadipi aṭṭhuppattiyā attajjhāsayenapi saṃsaggabhedo sambhavati, attajjhāsayādīhi pana purato ṭhitehi aṭṭhuppattiyā saṃsaggo natthīti na idha niravaseso vitthāranayo sambhavatīti ‘‘cattāro suttanikkhepā’’ti vuttaṃ. Tadantogadhattā vā sesanikkhepānaṃ mūlanikkhepavasena cattārova dassitā. Yathādassanañhettha ayaṃ saṃsaggabhedo gahetabboti."
    ],
    "innerText": "Nikkhittassāti desitassa. Desanā hi desetabbassa sīlādiatthassa veneyyasantānesu nikkhipanato ‘‘nikkhepo’’ti vuccati. Suttanikkhepaṃ vicāretvāva vuccamānā pākaṭā hotīti sāmaññato bhagavato desanāya samuṭṭhānassa vibhāgaṃ dassetvā ‘‘etthāyaṃ desanā evaṃsamuṭṭhānā’’ti desanāya samuṭṭhāne dassite suttassa sammadeva nidānaparijānanena vaṇṇanāya suviññeyyattā vuttaṃ. Tattha yathā anekasataanekasahassabhedānipi suttantāni saṃkilesabhāgiyādipaṭṭhānanayavasena soḷasavidhataṃ nātivattanti, evaṃ attajjhāsayādisuttanikkhepavasena catubbidhabhāvanti āha – ‘‘cattāro hi suttanikkhepā’’ti. Ettha ca yathā attajjhāsayassa aṭṭhuppattiyā ca parajjhāsayapucchāhi saddhiṃ saṃsaggabhedo sambhavati ‘‘attajjhāsayo ca parajjhāsayo ca, attajjhāsayo ca pucchāvasiko ca, aṭṭhuppattiko ca parajjhāsayo ca, aṭṭhuppattiko ca pucchāvasiko cā’’ti ajjhāsayapucchānusandhisabbhāvato, evaṃ yadipi aṭṭhuppattiyā attajjhāsayenapi saṃsaggabhedo sambhavati, attajjhāsayādīhi pana purato ṭhitehi aṭṭhuppattiyā saṃsaggo natthīti na idha niravaseso vitthāranayo sambhavatīti ‘‘cattāro suttanikkhepā’’ti vuttaṃ. Tadantogadhattā vā sesanikkhepānaṃ mūlanikkhepavasena cattārova dassitā. Yathādassanañhettha ayaṃ saṃsaggabhedo gahetabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ vacanattho – nikkhipīyatīti nikkhepo, suttaṃ eva nikkhepo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suttanikkhepo"
      },
      ". Atha vā nikkhipanaṃ nikkhepo, suttassa nikkhepo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suttanikkhepo,"
      },
      " suttadesanāti attho. Attano ajjhāsayo attajjhāsayo, so assa atthi kāraṇabhūtoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attajjhāsayo"
      },
      ". Attano ajjhāsayo etassāti ",
      " vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attajjhāsayo. Parajjhāsayepi"
      },
      " eseva nayo. Pucchāya vaso pucchāvaso, so etassa atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pucchāvasiko"
      },
      ". Suttadesanāvatthubhūtassa atthassa uppatti atthuppatti, atthuppattiyeva aṭṭhuppatti ttha-kārassa ṭṭha-kāraṃ katvā. Sā etassa atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhuppattiko"
      },
      ". Atha vā nikkhipīyati suttaṃ etenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suttanikkhepo,"
      },
      " attajjhāsayādi eva. Etasmiṃ atthavikappe attano ajjhāsayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attajjhāsayo"
      },
      ". Paresaṃ ajjhāsayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parajjhāsayo"
      },
      ". Pucchīyatīti pucchā, pucchitabbo attho. Pucchāvasena pavattaṃ dhammappaṭiggāhakānaṃ vacanaṃ pucchāvasikaṃ, tadeva nikkhepasaddāpekkhāya pulliṅgavasena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pucchāvasiko’’"
      },
      "ti. Tathā aṭṭhuppatti eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhuppattiko"
      },
      "ti evamettha attho veditabbo."
    ],
    "innerText": "Tatrāyaṃ vacanattho – nikkhipīyatīti nikkhepo, suttaṃ eva nikkhepo suttanikkhepo. Atha vā nikkhipanaṃ nikkhepo, suttassa nikkhepo suttanikkhepo, suttadesanāti attho. Attano ajjhāsayo attajjhāsayo, so assa atthi kāraṇabhūtoti attajjhāsayo. Attano ajjhāsayo etassāti vā attajjhāsayo. Parajjhāsayepi eseva nayo. Pucchāya vaso pucchāvaso, so etassa atthīti pucchāvasiko. Suttadesanāvatthubhūtassa atthassa uppatti atthuppatti, atthuppattiyeva aṭṭhuppatti ttha-kārassa ṭṭha-kāraṃ katvā. Sā etassa atthīti aṭṭhuppattiko. Atha vā nikkhipīyati suttaṃ etenāti suttanikkhepo, attajjhāsayādi eva. Etasmiṃ atthavikappe attano ajjhāsayo attajjhāsayo. Paresaṃ ajjhāsayo parajjhāsayo. Pucchīyatīti pucchā, pucchitabbo attho. Pucchāvasena pavattaṃ dhammappaṭiggāhakānaṃ vacanaṃ pucchāvasikaṃ, tadeva nikkhepasaddāpekkhāya pulliṅgavasena vuttaṃ – ‘‘pucchāvasiko’’ti. Tathā aṭṭhuppatti eva aṭṭhuppattikoti evamettha attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apicettha paresaṃ indriyaparipākādikāraṇanirapekkhattā attajjhāsayassa visuṃ suttanikkhepabhāvo yutto kevalaṃ attano ajjhāsayeneva dhammatantiṭṭhapanatthaṃ pavattitadesanattā. Parajjhāsayapucchāvasikānaṃ pana paresaṃ ajjhāsayapucchānaṃ desanāpavattihetubhūtānaṃ uppattiyaṃ pavattitānaṃ ",
      " kathamaṭṭhuppattiyā anavarodho, pucchāvasikaaṭṭhuppattikānaṃ vā parajjhāsayānurodhena pavattitānaṃ kathaṃ parajjhāsaye anavarodhoti? Na codetabbametaṃ. Paresañhi abhinīhāraparipucchādivinimuttasseva suttadesanākāraṇuppādassa aṭṭhuppattibhāvena gahitattā parajjhāsayapucchāvasikānaṃ visuṃ gahaṇaṃ. Tathā hi brahmajāladhammadāyādasuttādīnaṃ vaṇṇāvaṇṇaāmisuppādādidesanānimittaṃ ‘‘aṭṭhuppattī’’ti vuccati. Paresaṃ pucchaṃ vinā ajjhāsayaṃ eva nimittaṃ katvā desito parajjhāsayo, pucchāvasena desito pucchāvasikoti pākaṭoyamatthoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attano ajjhāsayeneva kathesī"
      },
      "ti dhammatantiṭṭhapanatthaṃ kathesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimuttiparipācanīyā dhammā"
      },
      " saddhindriyādayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhāsaya"
      },
      "nti adhimuttiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khanti"
      },
      "nti diṭṭhinijjhānakkhantiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mana"
      },
      "nti paññatticittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhinīhāra"
      },
      "nti paṇidhānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bujjhanabhāva"
      },
      "nti bujjhanasabhāvaṃ, paṭivijjhanākāraṃ vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpagarukāna"
      },
      "nti pañcasu ārammaṇesu rūpārammaṇagarukā rūpagarukā. Cittena rūpaninnā rūpapoṇā rūpapabbhārā rūpadassanappasutā rūpena ākaḍḍhitahadayā, tesaṃ rūpagarukānaṃ."
    ],
    "innerText": "Apicettha paresaṃ indriyaparipākādikāraṇanirapekkhattā attajjhāsayassa visuṃ suttanikkhepabhāvo yutto kevalaṃ attano ajjhāsayeneva dhammatantiṭṭhapanatthaṃ pavattitadesanattā. Parajjhāsayapucchāvasikānaṃ pana paresaṃ ajjhāsayapucchānaṃ desanāpavattihetubhūtānaṃ uppattiyaṃ pavattitānaṃ kathamaṭṭhuppattiyā anavarodho, pucchāvasikaaṭṭhuppattikānaṃ vā parajjhāsayānurodhena pavattitānaṃ kathaṃ parajjhāsaye anavarodhoti? Na codetabbametaṃ. Paresañhi abhinīhāraparipucchādivinimuttasseva suttadesanākāraṇuppādassa aṭṭhuppattibhāvena gahitattā parajjhāsayapucchāvasikānaṃ visuṃ gahaṇaṃ. Tathā hi brahmajāladhammadāyādasuttādīnaṃ vaṇṇāvaṇṇaāmisuppādādidesanānimittaṃ ‘‘aṭṭhuppattī’’ti vuccati. Paresaṃ pucchaṃ vinā ajjhāsayaṃ eva nimittaṃ katvā desito parajjhāsayo, pucchāvasena desito pucchāvasikoti pākaṭoyamatthoti. Attano ajjhāsayeneva kathesīti dhammatantiṭṭhapanatthaṃ kathesi. Vimuttiparipācanīyā dhammā saddhindriyādayo. Ajjhāsayanti adhimuttiṃ. Khantinti diṭṭhinijjhānakkhantiṃ. Mananti paññatticittaṃ. Abhinīhāranti paṇidhānaṃ. Bujjhanabhāvanti bujjhanasabhāvaṃ, paṭivijjhanākāraṃ vā. Rūpagarukānanti pañcasu ārammaṇesu rūpārammaṇagarukā rūpagarukā. Cittena rūpaninnā rūpapoṇā rūpapabbhārā rūpadassanappasutā rūpena ākaḍḍhitahadayā, tesaṃ rūpagarukānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisedhattho"
      },
      "ti paṭikkhepattho. Kassa pana paṭikkhepatthoti? Kiriyāpadhānañhi vākyaṃ, tasmā ‘‘na samanupassāmī’’ti samanupassanākiriyāpaṭisedhattho. Tenāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘imassa pana padassā’’"
      },
      "tiādi. Yo paro na hoti, so attāti lokasamaññāmattasiddhaṃ sattasantānaṃ sandhāya – ‘‘aha’’nti satthā vadati, na bāhirakaparikappitaṃ ahaṃkāravisayaṃ ahaṃkārassa bodhimūleyeva samucchinnattā. Lokasamaññānatikkamantā eva hi buddhānaṃ lokiye visaye desanāpavatti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhave"
      },
      "ti ālapane kāraṇaṃ heṭṭhā vuttameva. Aññanti apekkhāsiddhattā aññatthassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘idāni vattabbaitthirūpato añña’’"
      },
      "nti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekampi rūpa"
      },
      "nti ekaṃ vaṇṇāyatanaṃ. Samaṃ visamaṃ sammā yāthāvato anu anu passatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samanupassanā,"
      },
      " ñāṇaṃ. Saṃkilissanavasena anu anu passatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samanupassanā,"
      },
      " diṭṭhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "No niccato"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iti"
      },
      "-saddo ādiattho, evamādikoti attho. Tena ‘‘dukkhato samanupassatī’’ti evamādīni saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Olokentopī"
      },
      "ti devamanussavimānakapparukkhamaṇikanakādigatāni rūpāni anavasesaṃ sabbaññutaññāṇena olokentopi. Sāmaññavacanopi yaṃ-saddo ‘‘ekarūpampī’’ti rūpassa ",
      " adhigatattā rūpavisayo icchitoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yaṃ rūpa’’"
      },
      "nti vuttaṃ. Tathā purisasaddo pariyādiyitabbacittapuggalavisayoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpagarukassā"
      },
      "ti visesitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gahaṇaṃ"
      },
      " ‘‘khepana’’nti ca adhippetaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariyādānañca"
      },
      " uppattinivāraṇanti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘catubhūmakakusalacitta’’"
      },
      "nti. Tañhi rūpaṃ tādisassa parittakusalassapi uppattiṃ nivāreti, kimaṅgaṃ pana mahaggatānuttaracittassāti lokuttarakusalacittassapi uppattiyā nivāraṇaṃ hotuṃ samatthaṃ, lokiyakusaluppattiyā nivārakatte vattabbameva natthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘catubhūmakakusalacittaṃ pariyādiyitvā’’"
      },
      "ti vuttaṃ. Na hi kāmaguṇassādappasutassa purisassa dānādivasena savipphārikā kusaluppatti sambhavati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gaṇhitvā khepetvā"
      },
      "ti attānaṃ assādetvā pavattamānassa akusalacittassa paccayo hontaṃ pavattinivāraṇena muṭṭhigataṃ viya gahetvā anuppādanirodhena khepetvā viya tiṭṭhati. Tāva mahati lokasannivāse tassa pariyādiyaṭṭhānaṃ avicchedato labbhatīti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tiṭṭhatī’’"
      },
      "ti yathā ‘‘pabbatā tiṭṭhanti, najjo sandantī’’ti. Tenāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘idha ubhayampi vaṭṭatī’’"
      },
      "tiādi."
    ],
    "innerText": "Paṭisedhatthoti paṭikkhepattho. Kassa pana paṭikkhepatthoti? Kiriyāpadhānañhi vākyaṃ, tasmā ‘‘na samanupassāmī’’ti samanupassanākiriyāpaṭisedhattho. Tenāha – ‘‘imassa pana padassā’’tiādi. Yo paro na hoti, so attāti lokasamaññāmattasiddhaṃ sattasantānaṃ sandhāya – ‘‘aha’’nti satthā vadati, na bāhirakaparikappitaṃ ahaṃkāravisayaṃ ahaṃkārassa bodhimūleyeva samucchinnattā. Lokasamaññānatikkamantā eva hi buddhānaṃ lokiye visaye desanāpavatti. Bhikkhaveti ālapane kāraṇaṃ heṭṭhā vuttameva. Aññanti apekkhāsiddhattā aññatthassa ‘‘idāni vattabbaitthirūpato añña’’nti āha. Ekampi rūpanti ekaṃ vaṇṇāyatanaṃ. Samaṃ visamaṃ sammā yāthāvato anu anu passatīti samanupassanā, ñāṇaṃ. Saṃkilissanavasena anu anu passatīti samanupassanā, diṭṭhi. No niccatoti ettha iti-saddo ādiattho, evamādikoti attho. Tena ‘‘dukkhato samanupassatī’’ti evamādīni saṅgaṇhāti. Olokentopīti devamanussavimānakapparukkhamaṇikanakādigatāni rūpāni anavasesaṃ sabbaññutaññāṇena olokentopi. Sāmaññavacanopi yaṃ-saddo ‘‘ekarūpampī’’ti rūpassa adhigatattā rūpavisayo icchitoti ‘‘yaṃ rūpa’’nti vuttaṃ. Tathā purisasaddo pariyādiyitabbacittapuggalavisayoti rūpagarukassāti visesitaṃ. Gahaṇaṃ ‘‘khepana’’nti ca adhippetaṃ, pariyādānañca uppattinivāraṇanti āha – ‘‘catubhūmakakusalacitta’’nti. Tañhi rūpaṃ tādisassa parittakusalassapi uppattiṃ nivāreti, kimaṅgaṃ pana mahaggatānuttaracittassāti lokuttarakusalacittassapi uppattiyā nivāraṇaṃ hotuṃ samatthaṃ, lokiyakusaluppattiyā nivārakatte vattabbameva natthīti ‘‘catubhūmakakusalacittaṃ pariyādiyitvā’’ti vuttaṃ. Na hi kāmaguṇassādappasutassa purisassa dānādivasena savipphārikā kusaluppatti sambhavati. Gaṇhitvā khepetvāti attānaṃ assādetvā pavattamānassa akusalacittassa paccayo hontaṃ pavattinivāraṇena muṭṭhigataṃ viya gahetvā anuppādanirodhena khepetvā viya tiṭṭhati. Tāva mahati lokasannivāse tassa pariyādiyaṭṭhānaṃ avicchedato labbhatīti āha – ‘‘tiṭṭhatī’’ti yathā ‘‘pabbatā tiṭṭhanti, najjo sandantī’’ti. Tenāha – ‘‘idha ubhayampi vaṭṭatī’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathayida"
      },
      "nti sandhivasena ākārassa rassattaṃ yakārāgamo cāti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yathā ida’’"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itthiyā rūpa"
      },
      "nti itthisarīragataṃ tappaṭibaddhañca rūpāyatanaṃ. Paramatthassa niruḷho, paṭhamaṃ sādhāraṇato saddasatthalakkhaṇāni vibhāvetabbāni, pacchā asādhāraṇatoti tāni pāḷivasena vibhāvetuṃ – ‘‘ruppatīti kho…pe… veditabba’’nti āha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ruppatī"
      },
      "ti sītādivirodhipaccayehi vikāraṃ āpādīyati, āpajjatīti vā attho. Vikāruppatti ca virodhipaccayasannipāte visadisuppatti vibhūtatarā, kuto panāyaṃ visesoti ce? ‘‘Sītenā’’tiādivacanato. Evañca katvā vedanādīsu anavasesarūpasamaññā sāmaññalakkhaṇanti sabbarūpadhammasādhāraṇaṃ rūppanaṃ. Idāni atthuddhāranayena rūpasaddaṃ saṃvaṇṇento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ayaṃ panā’’"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpakkhandhe vattatī"
      },
      "ti ‘‘oḷārikaṃ vā sukhumaṃ vā’’tiādivacanato (ma. ni. 1.361; 2.113; 3.86, 89; vibha. 2). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpūpapattiyā"
      },
      "ti ettha rūpabhavo rūpaṃ uttarapadalopena. Rūpabhavūpapattiyāti ayañhettha attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kasiṇanimitte"
      },
      "ti pathavīkasiṇādisaññite paṭibhāganimitte. Rūppati attano phalassa sabhāvaṃ karotīti rūpaṃ, sabhāvahetūti ",
      " āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sarūpā…pe… ettha paccaye’’"
      },
      "ti. Karacaraṇādiavayavasaṅghātabhāvena rūpīyati nirūpīyatīti rūpaṃ, rūpakāyoti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ākāso…pe… ettha sarīre’’"
      },
      "ti."
    ],
    "innerText": "Yathayidanti sandhivasena ākārassa rassattaṃ yakārāgamo cāti āha – ‘‘yathā ida’’nti. Itthiyā rūpanti itthisarīragataṃ tappaṭibaddhañca rūpāyatanaṃ. Paramatthassa niruḷho, paṭhamaṃ sādhāraṇato saddasatthalakkhaṇāni vibhāvetabbāni, pacchā asādhāraṇatoti tāni pāḷivasena vibhāvetuṃ – ‘‘ruppatīti kho…pe… veditabba’’nti āha. Tattha ruppatīti sītādivirodhipaccayehi vikāraṃ āpādīyati, āpajjatīti vā attho. Vikāruppatti ca virodhipaccayasannipāte visadisuppatti vibhūtatarā, kuto panāyaṃ visesoti ce? ‘‘Sītenā’’tiādivacanato. Evañca katvā vedanādīsu anavasesarūpasamaññā sāmaññalakkhaṇanti sabbarūpadhammasādhāraṇaṃ rūppanaṃ. Idāni atthuddhāranayena rūpasaddaṃ saṃvaṇṇento ‘‘ayaṃ panā’’tiādimāha. Rūpakkhandhe vattatīti ‘‘oḷārikaṃ vā sukhumaṃ vā’’tiādivacanato (ma. ni. 1.361; 2.113; 3.86, 89; vibha. 2). Rūpūpapattiyāti ettha rūpabhavo rūpaṃ uttarapadalopena. Rūpabhavūpapattiyāti ayañhettha attho. Kasiṇanimitteti pathavīkasiṇādisaññite paṭibhāganimitte. Rūppati attano phalassa sabhāvaṃ karotīti rūpaṃ, sabhāvahetūti āha – ‘‘sarūpā…pe… ettha paccaye’’ti. Karacaraṇādiavayavasaṅghātabhāvena rūpīyati nirūpīyatīti rūpaṃ, rūpakāyoti āha – ‘‘ākāso…pe… ettha sarīre’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rūpayati vaṇṇavikāraṃ āpajjamānaṃ hadayaṅgatabhāvaṃ pakāsetīti rūpaṃ, vaṇṇāyatanaṃ. Ārohapariṇāhādibhedarūpagataṃ saṇṭhānasampattiṃ nissāya pasādaṃ āpajjamāno rūpappamāṇoti vuttoti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ettha saṇṭhāne’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piyarūpa"
      },
      "ntiādīsu sabhāvattho rūpasaddo. Ādisaddena rūpajjhānādīnaṃ saṅgaho. ‘‘Rūpī rūpāni passatī’’ti ettha ajjhattaṃ kesādīsu parikammasaññāvasena paṭiladdharūpajjhānaṃ rūpaṃ, taṃ assa atthīti rūpīti vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itthiyā catusamuṭṭhāne vaṇṇe"
      },
      "ti itthisarīrapariyāpannameva rūpaṃ gahitaṃ, tappaṭibaddhavatthālaṅkārādirūpampi pana purisacittassa pariyādāyakaṃ hotīti dassetuṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘apicā’’"
      },
      "tiādi vuttaṃ. Gandhavaṇṇaggahaṇena vilepanaṃ vuttaṃ. Kāmaṃ ‘‘asukāya itthiyā pasādhana’’nti sallakkhitassa akāyappaṭibaddhassapi vaṇṇo paṭibaddhacittassa purisassa cittaṃ pariyādāya tiṭṭheyya, taṃ pana na ekantikanti ekantikaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kāyappaṭibaddho’’"
      },
      "tiāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upakappatīti"
      },
      " cittassa pariyādānāya upakappati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purimassevā"
      },
      "ti pubbe vuttaatthasseva daḷhīkaraṇatthaṃ vuttaṃ yathā ‘‘dvikkhattuṃ bandhaṃ subandha’’nti. Nigamanavasena vā etaṃ vuttanti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Opammavasena vutta"
      },
      "nti ‘‘yaṃ evaṃ purisassa cittaṃ pariyādāya tiṭṭhatī’’ti sakalamevidaṃ purimavacanaṃ upamāvasena vuttaṃ, tattha pana upamābhūtaṃ atthaṃ dassetuṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yathayidaṃ…pe… itthirūpa’’"
      },
      "nti vuttaṃ. Pariyādāne ānubhāvo sambhavo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariyādānānubhāvo,"
      },
      " tassa dassanavasena vuttaṃ."
    ],
    "innerText": "Rūpayati vaṇṇavikāraṃ āpajjamānaṃ hadayaṅgatabhāvaṃ pakāsetīti rūpaṃ, vaṇṇāyatanaṃ. Ārohapariṇāhādibhedarūpagataṃ saṇṭhānasampattiṃ nissāya pasādaṃ āpajjamāno rūpappamāṇoti vuttoti āha – ‘‘ettha saṇṭhāne’’ti. Piyarūpantiādīsu sabhāvattho rūpasaddo. Ādisaddena rūpajjhānādīnaṃ saṅgaho. ‘‘Rūpī rūpāni passatī’’ti ettha ajjhattaṃ kesādīsu parikammasaññāvasena paṭiladdharūpajjhānaṃ rūpaṃ, taṃ assa atthīti rūpīti vutto. Itthiyā catusamuṭṭhāne vaṇṇeti itthisarīrapariyāpannameva rūpaṃ gahitaṃ, tappaṭibaddhavatthālaṅkārādirūpampi pana purisacittassa pariyādāyakaṃ hotīti dassetuṃ – ‘‘apicā’’tiādi vuttaṃ. Gandhavaṇṇaggahaṇena vilepanaṃ vuttaṃ. Kāmaṃ ‘‘asukāya itthiyā pasādhana’’nti sallakkhitassa akāyappaṭibaddhassapi vaṇṇo paṭibaddhacittassa purisassa cittaṃ pariyādāya tiṭṭheyya, taṃ pana na ekantikanti ekantikaṃ dassento ‘‘kāyappaṭibaddho’’tiāha. Upakappatīti cittassa pariyādānāya upakappati. Purimassevāti pubbe vuttaatthasseva daḷhīkaraṇatthaṃ vuttaṃ yathā ‘‘dvikkhattuṃ bandhaṃ subandha’’nti. Nigamanavasena vā etaṃ vuttanti daṭṭhabbaṃ. Opammavasena vuttanti ‘‘yaṃ evaṃ purisassa cittaṃ pariyādāya tiṭṭhatī’’ti sakalamevidaṃ purimavacanaṃ upamāvasena vuttaṃ, tattha pana upamābhūtaṃ atthaṃ dassetuṃ – ‘‘yathayidaṃ…pe… itthirūpa’’nti vuttaṃ. Pariyādāne ānubhāvo sambhavo pariyādānānubhāvo, tassa dassanavasena vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idaṃ"
      },
      " pana ‘‘itthirūpa’’ntiādivacanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariyādānānubhāve"
      },
      " sādhetabbe dīpetabbe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vatthu"
      },
      " kāraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāgo"
      },
      " nāma so rājā, dīghadāṭhikattā pana ‘‘mahādāṭhikanāgarājā’’ti vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaṃvaraniyāmenā"
      },
      "ti cakkhudvārikena asaṃvaranīhārena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nimittaṃ gahetvā"
      },
      "ti rāguppattihetubhūtaṃ rūpaṃ subhanimittaṃ gahetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visikādassanaṃ gantvā"
      },
      "ti sivathikadassanaṃ gantvā. Tattha hi ādīnavānupassanā ijjhati. Vatthulobhena kuto tādisāya maraṇanti asaddahanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘mukhaṃ tumhākaṃ dhūmavaṇṇa’’"
      },
      "nti te daharasāmaṇere uppaṇḍento vadati."
    ],
    "innerText": "Idaṃ pana ‘‘itthirūpa’’ntiādivacanaṃ pariyādānānubhāve sādhetabbe dīpetabbe vatthu kāraṇaṃ. Nāgo nāma so rājā, dīghadāṭhikattā pana ‘‘mahādāṭhikanāgarājā’’ti vutto. Asaṃvaraniyāmenāti cakkhudvārikena asaṃvaranīhārena. Nimittaṃ gahetvāti rāguppattihetubhūtaṃ rūpaṃ subhanimittaṃ gahetvā. Visikādassanaṃ gantvāti sivathikadassanaṃ gantvā. Tattha hi ādīnavānupassanā ijjhati. Vatthulobhena kuto tādisāya maraṇanti asaddahanto ‘‘mukhaṃ tumhākaṃ dhūmavaṇṇa’’nti te daharasāmaṇere uppaṇḍento vadati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ratanattaye suppasannattā kākavaṇṇatissādīhi visesanatthañca so tissamahārājā saddhāsaddena visesetvā vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Daharassa cittaṃ pariyādāya"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tiṭṭhatī"
      },
      "ti adhikāravasena vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niṭṭhituddesakicco"
      },
      "ti gāme asappāyarūpadassanaṃ imassa anatthāya siyāti ācariyena nivāritagāmappaveso pacchā niṭṭhituddesakicco hutvā ṭhito. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atthakāmānaṃ vacanaṃ aggahetvā’’"
      },
      "ti ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nivatthavatthaṃ sañjānitvā"
      },
      "ti attanā diṭṭhadivase nivatthavatthaṃ tassā matadivase sivathikadassanatthaṃ gatena laddhaṃ sañjānitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evampī"
      },
      "ti evaṃ maraṇasampāpanavasenapi. Ayaṃ tāvettha aṭṭhakathāya anuttānatthadīpanā."
    ],
    "innerText": "Ratanattaye suppasannattā kākavaṇṇatissādīhi visesanatthañca so tissamahārājā saddhāsaddena visesetvā vuccati. Daharassa cittaṃ pariyādāyatiṭṭhatīti adhikāravasena vuttaṃ. Niṭṭhituddesakiccoti gāme asappāyarūpadassanaṃ imassa anatthāya siyāti ācariyena nivāritagāmappaveso pacchā niṭṭhituddesakicco hutvā ṭhito. Tena vuttaṃ – ‘‘atthakāmānaṃ vacanaṃ aggahetvā’’ti . Nivatthavatthaṃ sañjānitvāti attanā diṭṭhadivase nivatthavatthaṃ tassā matadivase sivathikadassanatthaṃ gatena laddhaṃ sañjānitvā. Evampīti evaṃ maraṇasampāpanavasenapi. Ayaṃ tāvettha aṭṭhakathāya anuttānatthadīpanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nettinayavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni pakaraṇanayena pāḷiyā atthavaṇṇanaṃ karissāma. Sā pana atthasaṃvaṇṇanā yasmā desanāya samuṭṭhānappayojanabhājanesu piṇḍatthesu ca niddhāritesu sukarā hoti suviññeyyā ca, tasmā suttadesanāya samuṭṭhānādīni paṭhamaṃ niddhārayissāma. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samuṭṭhānaṃ"
      },
      " nāma desanānidānaṃ, taṃ sādhāraṇamasādhāraṇanti duvidhaṃ. Tattha sādhāraṇampi ajjhattikabāhirabhedato duvidhaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sādhāraṇaṃ ajjhattikasamuṭṭhānaṃ"
      },
      " nāma lokanāthassa mahākaruṇā. Tāya hi samussāhitassa bhagavato veneyyānaṃ dhammadesanāya cittaṃ udapādi, yaṃ sandhāya vuttaṃ – ‘‘sattesu ca kāruññataṃ paṭicca buddhacakkhunā lokaṃ volokesī’’tiādi (ma. ni. 1.283; mahāva. 9; saṃ. ni. 1.173). Ettha ca hetāvatthāyapi mahākaruṇāya saṅgaho daṭṭhabbo yāvadeva saṃsāramahoghato saddhammadesanāhatthadānehi sattasantāraṇatthaṃ taduppattito. Yathā ca mahākaruṇā, evaṃ sabbaññutaññāṇaṃ dasabalañāṇādayo ca desanāya abbhantarasamuṭṭhānabhāvena vattabbā. Sabbañhi ñeyyadhammaṃ tesaṃ desetabbākāraṃ sattānañca āsayānusayādiṃ yāthāvato jānanto bhagavā ṭhānāṭṭhānādīsu kosallena veneyyajjhāsayānurūpaṃ vicittanayadesanaṃ pavattesīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bāhiraṃ"
      },
      " pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sādhāraṇaṃ samuṭṭhānaṃ"
      },
      " dasasahassamahābrahmaparivārassa sahampatibrahmuno ajjhesanaṃ. Tadajjhesanuttarakālañhi dhammagambhīratāpaccavekkhaṇājanitaṃ appossukkataṃ paṭippassambhetvā dhammassāmī dhammadesanāya ussāhajāto ahosi. Asādhāraṇampi abbhantarabāhirabhedato duvidhameva. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abbhantaraṃ"
      },
      " yāya mahākaruṇāya yena ca desanāñāṇena ",
      " idaṃ suttaṃ pavattitaṃ, tadubhayaṃ veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bāhiraṃ"
      },
      " pana rūpagarukānaṃ puggalānaṃ ajjhāsayo. Svāyamattho aṭṭhakathāyaṃ vutto eva."
    ],
    "innerText": "Idāni pakaraṇanayena pāḷiyā atthavaṇṇanaṃ karissāma. Sā pana atthasaṃvaṇṇanā yasmā desanāya samuṭṭhānappayojanabhājanesu piṇḍatthesu ca niddhāritesu sukarā hoti suviññeyyā ca, tasmā suttadesanāya samuṭṭhānādīni paṭhamaṃ niddhārayissāma. Tattha samuṭṭhānaṃ nāma desanānidānaṃ, taṃ sādhāraṇamasādhāraṇanti duvidhaṃ. Tattha sādhāraṇampi ajjhattikabāhirabhedato duvidhaṃ. Tattha sādhāraṇaṃ ajjhattikasamuṭṭhānaṃ nāma lokanāthassa mahākaruṇā. Tāya hi samussāhitassa bhagavato veneyyānaṃ dhammadesanāya cittaṃ udapādi, yaṃ sandhāya vuttaṃ – ‘‘sattesu ca kāruññataṃ paṭicca buddhacakkhunā lokaṃ volokesī’’tiādi (ma. ni. 1.283; mahāva. 9; saṃ. ni. 1.173). Ettha ca hetāvatthāyapi mahākaruṇāya saṅgaho daṭṭhabbo yāvadeva saṃsāramahoghato saddhammadesanāhatthadānehi sattasantāraṇatthaṃ taduppattito. Yathā ca mahākaruṇā, evaṃ sabbaññutaññāṇaṃ dasabalañāṇādayo ca desanāya abbhantarasamuṭṭhānabhāvena vattabbā. Sabbañhi ñeyyadhammaṃ tesaṃ desetabbākāraṃ sattānañca āsayānusayādiṃ yāthāvato jānanto bhagavā ṭhānāṭṭhānādīsu kosallena veneyyajjhāsayānurūpaṃ vicittanayadesanaṃ pavattesīti. Bāhiraṃ pana sādhāraṇaṃ samuṭṭhānaṃ dasasahassamahābrahmaparivārassa sahampatibrahmuno ajjhesanaṃ. Tadajjhesanuttarakālañhi dhammagambhīratāpaccavekkhaṇājanitaṃ appossukkataṃ paṭippassambhetvā dhammassāmī dhammadesanāya ussāhajāto ahosi. Asādhāraṇampi abbhantarabāhirabhedato duvidhameva. Tattha abbhantaraṃ yāya mahākaruṇāya yena ca desanāñāṇena idaṃ suttaṃ pavattitaṃ, tadubhayaṃ veditabbaṃ. Bāhiraṃ pana rūpagarukānaṃ puggalānaṃ ajjhāsayo. Svāyamattho aṭṭhakathāyaṃ vutto eva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Payojanampi"
      },
      " sādhāraṇāsādhāraṇato duvidhaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sādhāraṇaṃ"
      },
      " yāva anupādāparinibbānaṃ vimuttirasattā bhagavato desanāya. Tenevāha – ‘‘etadatthā kathā, etadatthā mantanā’’tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asādhāraṇaṃ"
      },
      " pana tesaṃ rūpagarukānaṃ puggalānaṃ rūpe chandarāgassa jahāpanaṃ, ubhayampetaṃ bāhirameva. Sace pana veneyyasantānagatampi desanābalasiddhisaṅkhātaṃ payojanaṃ adhippāyasamijjhanabhāvato yathādhippetatthasiddhiyā mahākāruṇikassa bhagavatopi payojanamevāti gaṇheyya, iminā pariyāyenassa abbhantaratāpi siyā."
    ],
    "innerText": "Payojanampi sādhāraṇāsādhāraṇato duvidhaṃ. Tattha sādhāraṇaṃ yāva anupādāparinibbānaṃ vimuttirasattā bhagavato desanāya. Tenevāha – ‘‘etadatthā kathā, etadatthā mantanā’’tiādi. Asādhāraṇaṃ pana tesaṃ rūpagarukānaṃ puggalānaṃ rūpe chandarāgassa jahāpanaṃ, ubhayampetaṃ bāhirameva. Sace pana veneyyasantānagatampi desanābalasiddhisaṅkhātaṃ payojanaṃ adhippāyasamijjhanabhāvato yathādhippetatthasiddhiyā mahākāruṇikassa bhagavatopi payojanamevāti gaṇheyya, iminā pariyāyenassa abbhantaratāpi siyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica ",
      " tesaṃ rūpagarukānaṃ puggalānaṃ rūpasmiṃ vijjamānassa ādīnavassa yāthāvato anavabodho imissā desanāya samuṭṭhānaṃ, tadavabodho payojanaṃ. So hi imāya desanāya bhagavantaṃ payojeti tannipphādanaparāyaṃ desanāti katvā. Yañhi desanāya sādhetabbaṃ phalaṃ, taṃ ākaṅkhitabbattā desakaṃ desanāya payojetīti payojananti vuccati. Tathā tesaṃ puggalānaṃ tadaññesañca veneyyānaṃ rūpamukhena pañcasu upādānakkhandhesu ādīnavadassanañcettha payojanaṃ. Tathā saṃsāracakkanivattisaddhammacakkappavattisassatādimicchāvādanirākaraṇaṃ sammāvādapurekkhāro akusalamūlasamūhananaṃ kusalamūlasamāropanaṃ apāyadvārapidahanaṃ saggamaggadvāravivaraṇaṃ pariyuṭṭhānavūpasamanaṃ anusayasamugghātanaṃ ‘‘mutto mocessāmī’’ti purimapaṭiññāvisaṃvādanaṃ tappaṭipakkhamāramanorathavisaṃvādanaṃ titthiyadhammanimmathanaṃ buddhadhammapatiṭṭhāpananti evamādīnipi payojanāni idha veditabbāni."
    ],
    "innerText": "Apica tesaṃ rūpagarukānaṃ puggalānaṃ rūpasmiṃ vijjamānassa ādīnavassa yāthāvato anavabodho imissā desanāya samuṭṭhānaṃ, tadavabodho payojanaṃ. So hi imāya desanāya bhagavantaṃ payojeti tannipphādanaparāyaṃ desanāti katvā. Yañhi desanāya sādhetabbaṃ phalaṃ, taṃ ākaṅkhitabbattā desakaṃ desanāya payojetīti payojananti vuccati. Tathā tesaṃ puggalānaṃ tadaññesañca veneyyānaṃ rūpamukhena pañcasu upādānakkhandhesu ādīnavadassanañcettha payojanaṃ. Tathā saṃsāracakkanivattisaddhammacakkappavattisassatādimicchāvādanirākaraṇaṃ sammāvādapurekkhāro akusalamūlasamūhananaṃ kusalamūlasamāropanaṃ apāyadvārapidahanaṃ saggamaggadvāravivaraṇaṃ pariyuṭṭhānavūpasamanaṃ anusayasamugghātanaṃ ‘‘mutto mocessāmī’’ti purimapaṭiññāvisaṃvādanaṃ tappaṭipakkhamāramanorathavisaṃvādanaṃ titthiyadhammanimmathanaṃ buddhadhammapatiṭṭhāpananti evamādīnipi payojanāni idha veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā te puggalā rūpagarukā, evaṃ tadaññe ca sakkāyagarukā sakkāyasmiṃ allīnā saṅkhatadhammānaṃ sammāsambuddhassa ca paṭipattiṃ ajānantā asaddhammassavanasādhāraṇaparicariyamanasikāraparā saddhammassavanadhāraṇaparicayappaṭivedhavimukhā ca bhavavippamokkhesino veneyyā imissā desanāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhājanaṃ"
      },
      "."
    ],
    "innerText": "Yathā te puggalā rūpagarukā, evaṃ tadaññe ca sakkāyagarukā sakkāyasmiṃ allīnā saṅkhatadhammānaṃ sammāsambuddhassa ca paṭipattiṃ ajānantā asaddhammassavanasādhāraṇaparicariyamanasikāraparā saddhammassavanadhāraṇaparicayappaṭivedhavimukhā ca bhavavippamokkhesino veneyyā imissā desanāya bhājanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piṇḍattā"
      },
      " cettha rūpaggahaṇena rūpadhāturūpāyatanarūpakkhandhapariggaṇhanaṃ rūpamukhena catudhammānaṃ vaṭṭattayavicchedanūpāyo āsavoghādivivecanaṃ abhinandananivāraṇasaṅgatikkamo vivādamūlapariccāgo sikkhattayānuyogo pahānattayadīpanā samathavipassanānuṭṭhānaṃ bhāvanāsacchikiriyāsiddhīti evamādayo veditabbā."
    ],
    "innerText": "Piṇḍattā cettha rūpaggahaṇena rūpadhāturūpāyatanarūpakkhandhapariggaṇhanaṃ rūpamukhena catudhammānaṃ vaṭṭattayavicchedanūpāyo āsavoghādivivecanaṃ abhinandananivāraṇasaṅgatikkamo vivādamūlapariccāgo sikkhattayānuyogo pahānattayadīpanā samathavipassanānuṭṭhānaṃ bhāvanāsacchikiriyāsiddhīti evamādayo veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ito paraṃ pana soḷasa hārā dassetabbā. Tattha ‘‘rūpa’’nti sahajātā tassa nissayabhūtā tappaṭibaddhā ca sabbe rūpārūpadhammā taṇhāvajjā dukkhasaccaṃ. Taṃsamuṭṭhāpikā tadārammaṇā ca taṇhā samudayasaccaṃ. Tadubhayesaṃ appavatti nirodhasaccaṃ. Nirodhappajānanā paṭipadā maggasaccaṃ. Tattha samudayena assādo, dukkhena ādīnavo, magganirodhehi nissaraṇaṃ, rūpārammaṇassa akusalacittassa kusalacittassa ca pariyādānaṃ phalaṃ. Yañhi desanāya sādhetabbaṃ payojanaṃ, taṃ phalanti vuttovāyamattho. Tadatthaṃ hidaṃ suttaṃ bhagavatā desitanti. Yathā taṃ kusalacittaṃ na pariyādiyati, evaṃ paṭisaṅkhānabhāvanābalapariggahitā indriyesu guttadvāratā upāyo. Purisassa kusalacittapariyādānenassa rūpassa aññarūpāsādhāraṇatādassanāpadesena atthakāmehi ",
      " tato cittaṃ sādhukaṃ rakkhitabbaṃ. Ayamettha bhagavato āṇattīti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "desanāhāro"
      },
      ". Assādādisandassanavibhāvanalakkhaṇo hi desanāhāro. Vuttañhetaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nettippakaraṇe"
      },
      " –"
    ],
    "innerText": "Ito paraṃ pana soḷasa hārā dassetabbā. Tattha ‘‘rūpa’’nti sahajātā tassa nissayabhūtā tappaṭibaddhā ca sabbe rūpārūpadhammā taṇhāvajjā dukkhasaccaṃ. Taṃsamuṭṭhāpikā tadārammaṇā ca taṇhā samudayasaccaṃ. Tadubhayesaṃ appavatti nirodhasaccaṃ. Nirodhappajānanā paṭipadā maggasaccaṃ. Tattha samudayena assādo, dukkhena ādīnavo, magganirodhehi nissaraṇaṃ, rūpārammaṇassa akusalacittassa kusalacittassa ca pariyādānaṃ phalaṃ. Yañhi desanāya sādhetabbaṃ payojanaṃ, taṃ phalanti vuttovāyamattho. Tadatthaṃ hidaṃ suttaṃ bhagavatā desitanti. Yathā taṃ kusalacittaṃ na pariyādiyati, evaṃ paṭisaṅkhānabhāvanābalapariggahitā indriyesu guttadvāratā upāyo. Purisassa kusalacittapariyādānenassa rūpassa aññarūpāsādhāraṇatādassanāpadesena atthakāmehi tato cittaṃ sādhukaṃ rakkhitabbaṃ. Ayamettha bhagavato āṇattīti ayaṃ desanāhāro. Assādādisandassanavibhāvanalakkhaṇo hi desanāhāro. Vuttañhetaṃ nettippakaraṇe –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Assādādīnavatā, nissaraṇampi ca phalaṃ upāyo ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āṇattī ca bhagavato, yogīnaṃ desanāhāro’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Desīyati saṃvaṇṇīyati etāya suttatthoti desanā, desanāya sahacaraṇato vā desanā. Nanu ca aññepi hārā desanāsaṅkhātassa suttassa atthasaṃvaṇṇanāto desanāya sahacārino vāti? Saccametaṃ, ayaṃ pana hāro yebhuyyena yathārutavaseneva viññāyamāno desanāya saha caratīti vattabbataṃ arahati, na tathāpare. Na hi assādādīnavanissaraṇādisandassanarahitā suttadesanā atthi. Kiṃ pana tesaṃ assādādīnaṃ anavasesānaṃ vacanaṃ desanāhāro, udāhu ",
      " ekaccānanti? Niravasesānaṃyeva. Yasmiñhi sutte assādādīnavanissaraṇāni sarūpato āgatāni, tattha vattabbameva natthi. Yattha pana ekadesena āgatāni, na ca sarūpena, tattha anāgataṃ atthavasena niddhāretvā hāro yojetabbo."
    ],
    "innerText": "Desīyati saṃvaṇṇīyati etāya suttatthoti desanā, desanāya sahacaraṇato vā desanā. Nanu ca aññepi hārā desanāsaṅkhātassa suttassa atthasaṃvaṇṇanāto desanāya sahacārino vāti? Saccametaṃ, ayaṃ pana hāro yebhuyyena yathārutavaseneva viññāyamāno desanāya saha caratīti vattabbataṃ arahati, na tathāpare. Na hi assādādīnavanissaraṇādisandassanarahitā suttadesanā atthi. Kiṃ pana tesaṃ assādādīnaṃ anavasesānaṃ vacanaṃ desanāhāro, udāhu ekaccānanti? Niravasesānaṃyeva. Yasmiñhi sutte assādādīnavanissaraṇāni sarūpato āgatāni, tattha vattabbameva natthi. Yattha pana ekadesena āgatāni, na ca sarūpena, tattha anāgataṃ atthavasena niddhāretvā hāro yojetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sayaṃ samantacakkhubhāvato taṃdassanena sabhāvato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘aha’’"
      },
      "nti vuttaṃ. Bhikkhanasīlatādiguṇayogato abhimukhīkaraṇatthañca, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bhikkhave’’"
      },
      "ti vuttaṃ. Attābhāvato aparatādassanatthañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘añña’’"
      },
      "nti vuttaṃ. Ekassa anupalabbhadassanatthaṃ anekabhāvappaṭisedhanatthañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ekarūpampī’’"
      },
      "ti vuttaṃ. Tādisassa rūpassa abhāvato adassanato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na samanupassāmī’’"
      },
      "ti vuttaṃ. Tassa paccāmasanato aniyamato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ya’’"
      },
      "nti vuttaṃ. Idāni vuccamānākāraparāmasanato tadaññākāranisedhanato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘eva’’"
      },
      "nti vuttaṃ. Visabhāgindriyavatthuto sabhāgavatthusmiṃ tadabhāvato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘purisassā’’"
      },
      "ti vuttaṃ. Nimittaggāhassa vatthubhāvato tathā parikappitattā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cittaṃ pariyādāya tiṭṭhatī’’"
      },
      "ti vuttaṃ. Evanti vuttākāraparāmasanatthañceva nidassanatthañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yathā’’"
      },
      "ti vuttaṃ. Attano paccakkhabhāvato bhikkhūnaṃ paccakkhakaraṇatthañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ida’’"
      },
      "nti vuttaṃ. Itthisantānapariyāpannato tappaṭibaddhabhāvato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘itthirūpa’’"
      },
      "nti vuttanti evaṃ anupadavicayato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vicayo hāro"
      },
      ". Vicīyanti etena, ettha vā padapañhādayoti vicayo, viciti eva vā tesanti vicayo. Padapucchāvissajjanapubbāparānuggahanaṃ assādādīnañca visesaniddhāraṇavasena pavicayalakkhaṇo hi vicayo hāro. Vuttampi cetaṃ –"
    ],
    "innerText": "Sayaṃ samantacakkhubhāvato taṃdassanena sabhāvato ca ‘‘aha’’nti vuttaṃ. Bhikkhanasīlatādiguṇayogato abhimukhīkaraṇatthañca, ‘‘bhikkhave’’ti vuttaṃ. Attābhāvato aparatādassanatthañca ‘‘añña’’nti vuttaṃ. Ekassa anupalabbhadassanatthaṃ anekabhāvappaṭisedhanatthañca ‘‘ekarūpampī’’ti vuttaṃ. Tādisassa rūpassa abhāvato adassanato ca ‘‘na samanupassāmī’’ti vuttaṃ. Tassa paccāmasanato aniyamato ca ‘‘ya’’nti vuttaṃ. Idāni vuccamānākāraparāmasanato tadaññākāranisedhanato ca ‘‘eva’’nti vuttaṃ. Visabhāgindriyavatthuto sabhāgavatthusmiṃ tadabhāvato ca ‘‘purisassā’’ti vuttaṃ. Nimittaggāhassa vatthubhāvato tathā parikappitattā ca ‘‘cittaṃ pariyādāya tiṭṭhatī’’ti vuttaṃ. Evanti vuttākāraparāmasanatthañceva nidassanatthañca ‘‘yathā’’ti vuttaṃ. Attano paccakkhabhāvato bhikkhūnaṃ paccakkhakaraṇatthañca ‘‘ida’’nti vuttaṃ. Itthisantānapariyāpannato tappaṭibaddhabhāvato ca ‘‘itthirūpa’’nti vuttanti evaṃ anupadavicayato vicayo hāro. Vicīyanti etena, ettha vā padapañhādayoti vicayo, viciti eva vā tesanti vicayo. Padapucchāvissajjanapubbāparānuggahanaṃ assādādīnañca visesaniddhāraṇavasena pavicayalakkhaṇo hi vicayo hāro. Vuttampi cetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Yaṃ ",
      " pucchitañca vissajjitañca, suttassa yā ca anugīti;"
    ],
    "innerText": "‘‘Yaṃ pucchitañca vissajjitañca, suttassa yā ca anugīti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Suttassa yo pavicayo, hāro vicayoti niddiṭṭho’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anādimati saṃsāre itthipurisānaṃ aññamaññarūpābhirāmatāya ‘‘itthirūpaṃ purisassa cittaṃ pariyādāya tiṭṭhatī’’ti yujjatīti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yuttihāro"
      },
      ". Byañjanatthānaṃ yuttāyuttavibhāgavibhāvanalakkhaṇo hi yuttihāro. Vuttampi cetaṃ –"
    ],
    "innerText": "Anādimati saṃsāre itthipurisānaṃ aññamaññarūpābhirāmatāya ‘‘itthirūpaṃ purisassa cittaṃ pariyādāya tiṭṭhatī’’ti yujjatīti ayaṃ yuttihāro. Byañjanatthānaṃ yuttāyuttavibhāgavibhāvanalakkhaṇo hi yuttihāro. Vuttampi cetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sabbesaṃ hārānaṃ, yā bhūmī yo ca gocaro tesaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yuttāyuttiparikkhā, hāro yuttīti niddiṭṭho’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yuttī"
      },
      "ti ",
      " ca upapatti sādhanayutti, idha pana yuttivicāraṇā yutti uttarapadalopena ‘‘rūpabhavo rūpa’’nti yathā. Yuttisahacaraṇato vā yutti."
    ],
    "innerText": "Yuttīti ca upapatti sādhanayutti, idha pana yuttivicāraṇā yutti uttarapadalopena ‘‘rūpabhavo rūpa’’nti yathā. Yuttisahacaraṇato vā yutti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Itthirūpaṃ ayoniso olokiyamānaṃ indriyesu aguttadvāratāya padaṭṭhānaṃ, sā kusalānaṃ dhammānaṃ abhāvanāya padaṭṭhānaṃ, sā sabbassapi saṃkilesapakkhassa parivuddhiyā padaṭṭhānaṃ. Byatirekato pana itthirūpaṃ yoniso olokiyamānaṃ satipaṭṭhānabhāvanāya padaṭṭhānaṃ, sā bojjhaṅgānaṃ bhāvanāpāripūriyā padaṭṭhānaṃ, sā vijjāvimuttīnaṃ pāripūriyā padaṭṭhānaṃ, kusalassa cittassa pariyādānaṃ sammohābhinivesassa padaṭṭhānaṃ, so saṅkhārānaṃ padaṭṭhānaṃ, saṅkhārā viññāṇassāti sabbaṃ āvattati bhavacakkaṃ. Byatirekato pana kusalassa cittassa apariyādānaṃ tesaṃ tesaṃ kusalānaṃ dhammānaṃ uppādāya pāripūriyā padaṭṭhānanti ayaṃ tāva avisesato nayo. Visesato pana sīlassa apariyādānaṃ avippaṭisārassa padaṭṭhānaṃ, avippaṭisāro pāmojjassātiādinā yāva anupādāparinibbānaṃ netabbaṃ. Ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padaṭṭhāno hāro"
      },
      ". Sutte āgatadhammānaṃ padaṭṭhānabhūte dhamme tesañca padaṭṭhānabhūteti sambhavato padaṭṭhānabhūtadhammaniddhāraṇalakkhaṇo hi padaṭṭhāno hāro. Vuttañcetaṃ –"
    ],
    "innerText": "Itthirūpaṃ ayoniso olokiyamānaṃ indriyesu aguttadvāratāya padaṭṭhānaṃ, sā kusalānaṃ dhammānaṃ abhāvanāya padaṭṭhānaṃ, sā sabbassapi saṃkilesapakkhassa parivuddhiyā padaṭṭhānaṃ. Byatirekato pana itthirūpaṃ yoniso olokiyamānaṃ satipaṭṭhānabhāvanāya padaṭṭhānaṃ, sā bojjhaṅgānaṃ bhāvanāpāripūriyā padaṭṭhānaṃ, sā vijjāvimuttīnaṃ pāripūriyā padaṭṭhānaṃ, kusalassa cittassa pariyādānaṃ sammohābhinivesassa padaṭṭhānaṃ, so saṅkhārānaṃ padaṭṭhānaṃ, saṅkhārā viññāṇassāti sabbaṃ āvattati bhavacakkaṃ. Byatirekato pana kusalassa cittassa apariyādānaṃ tesaṃ tesaṃ kusalānaṃ dhammānaṃ uppādāya pāripūriyā padaṭṭhānanti ayaṃ tāva avisesato nayo. Visesato pana sīlassa apariyādānaṃ avippaṭisārassa padaṭṭhānaṃ, avippaṭisāro pāmojjassātiādinā yāva anupādāparinibbānaṃ netabbaṃ. Ayaṃ padaṭṭhāno hāro. Sutte āgatadhammānaṃ padaṭṭhānabhūte dhamme tesañca padaṭṭhānabhūteti sambhavato padaṭṭhānabhūtadhammaniddhāraṇalakkhaṇo hi padaṭṭhāno hāro. Vuttañcetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dhammaṃ deseti jino, tassa ca dhammassa yaṃ padaṭṭhānaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Iti yāva sabbadhammā, eso hāro padaṭṭhāno’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padaṭṭhāna"
      },
      "nti ",
      " āsannakāraṇaṃ. Idha pana padaṭṭhānavicāraṇā padaṭṭhānotiādi yuttihāre vuttanayeneva veditabbaṃ."
    ],
    "innerText": "Padaṭṭhānanti āsannakāraṇaṃ. Idha pana padaṭṭhānavicāraṇā padaṭṭhānotiādi yuttihāre vuttanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekarūpa"
      },
      "nti ca rūpāyatanaggahaṇena channampi bāhirānaṃ āyatanānaṃ gahaṇaṃ bāhirāyatanabhāvena ekalakkhaṇattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Citta"
      },
      "nti manāyatanaggahaṇena channampi ajjhattikānaṃ āyatanānaṃ gahaṇaṃ ajjhattikāyatanabhāvena ekalakkhaṇattā. Evaṃ khandhadhātādivasenapi ekalakkhaṇatā vattabbā. Ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lakkhaṇo hāro"
      },
      ". Lakkhīyanti etena, ettha vā ekalakkhaṇadhammā avuttāpi ekaccavacanenāti lakkhaṇo. Sutte anāgatepi dhamme vuttappakāre āgate viya niddhāretvā yā saṃvaṇṇanā, so lakkhaṇo hāro. Vuttampi cetaṃ –"
    ],
    "innerText": "Ekarūpanti ca rūpāyatanaggahaṇena channampi bāhirānaṃ āyatanānaṃ gahaṇaṃ bāhirāyatanabhāvena ekalakkhaṇattā. Cittanti manāyatanaggahaṇena channampi ajjhattikānaṃ āyatanānaṃ gahaṇaṃ ajjhattikāyatanabhāvena ekalakkhaṇattā. Evaṃ khandhadhātādivasenapi ekalakkhaṇatā vattabbā. Ayaṃ lakkhaṇo hāro. Lakkhīyanti etena, ettha vā ekalakkhaṇadhammā avuttāpi ekaccavacanenāti lakkhaṇo. Sutte anāgatepi dhamme vuttappakāre āgate viya niddhāretvā yā saṃvaṇṇanā, so lakkhaṇo hāro. Vuttampi cetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Vuttamhi ",
      " ekadhamme, ye dhammā ekalakkhaṇā keci;"
    ],
    "innerText": "‘‘Vuttamhi ekadhamme, ye dhammā ekalakkhaṇā keci;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vuttā bhavanti sabbe, so hāro lakkhaṇo nāmā’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nidāne imissā desanāya rūpagarukānaṃ puggalānaṃ rūpasmiṃ anādīnavadassitā vuttā, ‘‘kathaṃ nu kho ime imaṃ desanaṃ sutvā rūpe ādīnavadassanamukhena sabbasmimpi khandhapañcake sabbaso chandarāgaṃ pahāya sakalavaṭṭadukkhato mucceyyuṃ, pare ca tattha patiṭṭhāpeyyu’’nti ayamettha bhagavato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhippāyo"
      },
      ". Padanibbacanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niruttaṃ,"
      },
      " taṃ ‘‘eva’’ntiādinidānapadānaṃ ‘‘nāha’’ntiādipāḷipadānañca aṭṭhakathāyaṃ tassā līnatthavaṇṇanāya ca vuttanayānusārena sukarattā na vitthārayimha."
    ],
    "innerText": "Nidāne imissā desanāya rūpagarukānaṃ puggalānaṃ rūpasmiṃ anādīnavadassitā vuttā, ‘‘kathaṃ nu kho ime imaṃ desanaṃ sutvā rūpe ādīnavadassanamukhena sabbasmimpi khandhapañcake sabbaso chandarāgaṃ pahāya sakalavaṭṭadukkhato mucceyyuṃ, pare ca tattha patiṭṭhāpeyyu’’nti ayamettha bhagavato adhippāyo. Padanibbacanaṃ niruttaṃ, taṃ ‘‘eva’’ntiādinidānapadānaṃ ‘‘nāha’’ntiādipāḷipadānañca aṭṭhakathāyaṃ tassā līnatthavaṇṇanāya ca vuttanayānusārena sukarattā na vitthārayimha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Padapadatthadesanādesanānikkhepasuttasandhivasena pañcavidhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sandhi"
      },
      ". Tattha padassa padantarena sambandho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padasandhi"
      },
      ". Padatthassa padatthantarena sambandho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padatthasandhi,"
      },
      " yo ‘‘kiriyākārakasambandho’’ti vuccati. Nānānusandhikassa suttassa taṃtaṃanusandhīhi sambandho, ekānusandhikassa ca pubbāparasambandho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "desanāsandhi,"
      },
      " yā aṭṭhakathāyaṃ ‘‘pucchānusandhi, ajjhāsayānusandhi, yathānusandhī’’ti tidhā vibhattā. Ajjhāsayo cettha attajjhāsayo parajjhāsayoti dvidhā veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Desanānikkhepasandhi"
      },
      " catunnaṃ suttanikkhepānaṃ vasena veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suttasandhi"
      },
      " idha paṭhamanikkhepavaseneva veditabbā. ‘‘Kasmā panettha idameva cittapariyādānasuttaṃ paṭhamaṃ nikkhitta’’nti nāyamanuyogo katthaci na pavattati. Apica ime sattā anādimati saṃsāre paribbhamantā itthipurisā aññamaññesaṃ pañcakāmaguṇasaṅkhātarūpābhirāmā, tattha itthī purisassa rūpe sattā giddhā gadhitā laggā laggitā āsattā, sā cassā tattha āsatti dubbivecanīyā ",
      ". Tathā puriso itthiyā rūpe, tattha ca dassanasaṃsaggo garutaro itaresañca mūlabhūto. Teneva hi bhagavā ‘‘kathaṃ nu kho mātugāme paṭipajjitabba’’nti (dī. ni. 2.203) puṭṭho ‘‘adassanamevā’’ti avoca. Tasmā bhagavā pañcasu kāmaguṇesu rūpe chandarāgahāpanatthaṃ idameva suttaṃ paṭhamaṃ desesi. Nibbānādhigamāya paṭipattiyā ādi resā paṭipattīti. Yaṃ pana ekissā desanāya desanantarena saṃsandanaṃ, ayampi desanāsandhi. Sā idha evaṃ veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Nāhaṃ, bhikkhave…pe… tiṭṭhatī’’"
      },
      "ti ayaṃ desanā. ‘‘Ye kho, bhikkhave, cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā ",
      ", tañce bhikkhu abhinandati abhivadati ajjhosāya tiṭṭhati, tassa taṃ abhinandato abhivadato ajjhosāya tiṭṭhato uppajjanti aneke pāpakā akusalā dhammā’’ti (saṃ. ni. 4.118) imāya desanāya saṃsandati. Tathā ‘‘rūpe maññati, rūpesu maññati, rūpato maññati, rūpaṃ ‘me’ti maññati. Rūpaṃ, bhikkhave, anabhijānaṃ aparijānaṃ avirājayaṃ appajahaṃ abhabbo dukkhakkhayāyā’’ti (saṃ. ni. 4.112) evamādīhi desanāhi saṃsandatīti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catubyūho hāro"
      },
      ". Viyūhīyanti vibhāgena piṇḍīyanti etena, ettha vāti byūho, nibbacanādīnaṃ catunnaṃ byūhoti catubyūho, catunnaṃ vā byūho etthāti catubyūho. Nibbacanādhippāyādīnaṃ catunnaṃ vibhāgalakkhaṇo hi catubyūho hāro. Vuttañhetaṃ –"
    ],
    "innerText": "Padapadatthadesanādesanānikkhepasuttasandhivasena pañcavidhā sandhi. Tattha padassa padantarena sambandho padasandhi. Padatthassa padatthantarena sambandho padatthasandhi, yo ‘‘kiriyākārakasambandho’’ti vuccati. Nānānusandhikassa suttassa taṃtaṃanusandhīhi sambandho, ekānusandhikassa ca pubbāparasambandho desanāsandhi, yā aṭṭhakathāyaṃ ‘‘pucchānusandhi, ajjhāsayānusandhi, yathānusandhī’’ti tidhā vibhattā. Ajjhāsayo cettha attajjhāsayo parajjhāsayoti dvidhā veditabbo. Desanānikkhepasandhi catunnaṃ suttanikkhepānaṃ vasena veditabbā. Suttasandhi idha paṭhamanikkhepavaseneva veditabbā. ‘‘Kasmā panettha idameva cittapariyādānasuttaṃ paṭhamaṃ nikkhitta’’nti nāyamanuyogo katthaci na pavattati. Apica ime sattā anādimati saṃsāre paribbhamantā itthipurisā aññamaññesaṃ pañcakāmaguṇasaṅkhātarūpābhirāmā, tattha itthī purisassa rūpe sattā giddhā gadhitā laggā laggitā āsattā, sā cassā tattha āsatti dubbivecanīyā . Tathā puriso itthiyā rūpe, tattha ca dassanasaṃsaggo garutaro itaresañca mūlabhūto. Teneva hi bhagavā ‘‘kathaṃ nu kho mātugāme paṭipajjitabba’’nti (dī. ni. 2.203) puṭṭho ‘‘adassanamevā’’ti avoca. Tasmā bhagavā pañcasu kāmaguṇesu rūpe chandarāgahāpanatthaṃ idameva suttaṃ paṭhamaṃ desesi. Nibbānādhigamāya paṭipattiyā ādi resā paṭipattīti. Yaṃ pana ekissā desanāya desanantarena saṃsandanaṃ, ayampi desanāsandhi. Sā idha evaṃ veditabbā. ‘‘Nāhaṃ, bhikkhave…pe… tiṭṭhatī’’ti ayaṃ desanā. ‘‘Ye kho, bhikkhave, cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā , tañce bhikkhu abhinandati abhivadati ajjhosāya tiṭṭhati, tassa taṃ abhinandato abhivadato ajjhosāya tiṭṭhato uppajjanti aneke pāpakā akusalā dhammā’’ti (saṃ. ni. 4.118) imāya desanāya saṃsandati. Tathā ‘‘rūpe maññati, rūpesu maññati, rūpato maññati, rūpaṃ ‘me’ti maññati. Rūpaṃ, bhikkhave, anabhijānaṃ aparijānaṃ avirājayaṃ appajahaṃ abhabbo dukkhakkhayāyā’’ti (saṃ. ni. 4.112) evamādīhi desanāhi saṃsandatīti ayaṃ catubyūho hāro. Viyūhīyanti vibhāgena piṇḍīyanti etena, ettha vāti byūho, nibbacanādīnaṃ catunnaṃ byūhoti catubyūho, catunnaṃ vā byūho etthāti catubyūho. Nibbacanādhippāyādīnaṃ catunnaṃ vibhāgalakkhaṇo hi catubyūho hāro. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Neruttamadhippāyo, byañjanamatha desanānidānañca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pubbāparānusandhī, eso hāro catubyūho’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Nāhaṃ, bhikkhave, aññaṃ…pe… itthirūpa’’"
      },
      "nti etena ayonisomanasikāro dīpito. Yaṃ tattha cittaṃ pariyādiyati, tena yonisomanasikāro. Tattha ayonisomanasikaroto taṇhāvijjā parivaḍḍhanti, tāsu taṇhāgahaṇena nava taṇhāmūlakā dhammā āvaṭṭanti, avijjāgahaṇena avijjāmūlakaṃ sabbaṃ bhavacakkaṃ āvaṭṭati, yonisomanasikāraggahaṇena ca yonisomanasikāramūlakā dhammā āvaṭṭanti, catubbidhañca sampatticakkanti. Ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āvaṭṭo hāro"
      },
      ". Āvaṭṭayanti etena, ettha vā sabhāgavisabhāgā ca dhammā, tesaṃ vā āvaṭṭananti āvaṭṭo. Desanāya gahitadhammānaṃ sabhāgāsabhāgadhammavasena āvaṭṭanalakkhaṇo hi āvaṭṭo hāro. Vuttampi cetaṃ –"
    ],
    "innerText": "‘‘Nāhaṃ, bhikkhave, aññaṃ…pe… itthirūpa’’nti etena ayonisomanasikāro dīpito. Yaṃ tattha cittaṃ pariyādiyati, tena yonisomanasikāro. Tattha ayonisomanasikaroto taṇhāvijjā parivaḍḍhanti, tāsu taṇhāgahaṇena nava taṇhāmūlakā dhammā āvaṭṭanti, avijjāgahaṇena avijjāmūlakaṃ sabbaṃ bhavacakkaṃ āvaṭṭati, yonisomanasikāraggahaṇena ca yonisomanasikāramūlakā dhammā āvaṭṭanti, catubbidhañca sampatticakkanti. Ayaṃ āvaṭṭo hāro. Āvaṭṭayanti etena, ettha vā sabhāgavisabhāgā ca dhammā, tesaṃ vā āvaṭṭananti āvaṭṭo. Desanāya gahitadhammānaṃ sabhāgāsabhāgadhammavasena āvaṭṭanalakkhaṇo hi āvaṭṭo hāro. Vuttampi cetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ekamhi padaṭṭhāne, pariyesati sesakaṃ padaṭṭhānaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āvaṭṭati paṭipakkhe, āvaṭṭo nāma so hāro’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rūpaṃ ",
      " catubbidhaṃ kammasamuṭṭhānaṃ, cittasamuṭṭhānaṃ, utusamuṭṭhānaṃ, āhārasamuṭṭhānaṃ, tathā iṭṭhaṃ iṭṭhamajjhattaṃ aniṭṭhaṃ aniṭṭhamajjhattanti. Idha pana iṭṭhaṃ adhippetaṃ. Cittaṃ kusalacittamettha veditabbaṃ. Taṃ kāmāvacaraṃ, rūpāvacaraṃ, arūpāvacaraṃ, lokuttaranti catubbidhaṃ. Vedanādisampayuttadhammabhedato anekavidhanti ",
      " ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhattihāro"
      },
      ". Vibhajīyanti etena, ettha vā sādhāraṇāsādhāraṇānaṃ saṃkilesavodānadhammānaṃ bhūmiyoti vibhatti. Vibhajanaṃ vā etesaṃ bhūmiyoti vibhatti. Saṃkilesadhamme vodānadhamme ca sādhāraṇāsādhāraṇato padaṭṭhānato bhūmito vibhajanalakkhaṇo hi vibhattihāro. Vuttampi cetaṃ –"
    ],
    "innerText": "Rūpaṃ catubbidhaṃ kammasamuṭṭhānaṃ, cittasamuṭṭhānaṃ, utusamuṭṭhānaṃ, āhārasamuṭṭhānaṃ, tathā iṭṭhaṃ iṭṭhamajjhattaṃ aniṭṭhaṃ aniṭṭhamajjhattanti. Idha pana iṭṭhaṃ adhippetaṃ. Cittaṃ kusalacittamettha veditabbaṃ. Taṃ kāmāvacaraṃ, rūpāvacaraṃ, arūpāvacaraṃ, lokuttaranti catubbidhaṃ. Vedanādisampayuttadhammabhedato anekavidhanti ayaṃ vibhattihāro. Vibhajīyanti etena, ettha vā sādhāraṇāsādhāraṇānaṃ saṃkilesavodānadhammānaṃ bhūmiyoti vibhatti. Vibhajanaṃ vā etesaṃ bhūmiyoti vibhatti. Saṃkilesadhamme vodānadhamme ca sādhāraṇāsādhāraṇato padaṭṭhānato bhūmito vibhajanalakkhaṇo hi vibhattihāro. Vuttampi cetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dhammañca padaṭṭhānaṃ, bhūmiñca vibhajjate ayaṃ hāro;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sādhāraṇe asādhāraṇe ca neyyo vibhattī’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Itthirūpaṃ purisassa cittaṃ pariyādāya tiṭṭhati ayoniso manasikaroto, yoniso manasikaroto na pariyādiyati susaṃvutindriyattā sīlesu samāhitassāti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parivatto hāro"
      },
      ". Paṭipakkhavasena parivattīyanti iminā, ettha vā sutte vuttadhammā, parivattanaṃ vā tesanti parivatto. Niddiṭṭhānaṃ dhammānaṃ paṭipakkhato parivattanalakkhaṇo hi parivatto hāro. Vuttañhetaṃ –"
    ],
    "innerText": "Itthirūpaṃ purisassa cittaṃ pariyādāya tiṭṭhati ayoniso manasikaroto, yoniso manasikaroto na pariyādiyati susaṃvutindriyattā sīlesu samāhitassāti ayaṃ parivatto hāro. Paṭipakkhavasena parivattīyanti iminā, ettha vā sutte vuttadhammā, parivattanaṃ vā tesanti parivatto. Niddiṭṭhānaṃ dhammānaṃ paṭipakkhato parivattanalakkhaṇo hi parivatto hāro. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kusalākusale dhamme, niddiṭṭhe bhāvite pahīne ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Parivattati paṭipakkhe, hāro parivattano nāmā’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhikkhave, samaṇā pabbajitāti pariyāyavacanaṃ. Aññaṃ paraṃ kiñcīti pariyāyavacanaṃ. Rūpaṃ vaṇṇaṃ cakkhuviññeyyanti pariyāyavacanaṃ. Samanupassāmi olokessāmi jānāmīti pariyāyavacanaṃ. Evaṃ itthaṃ imaṃ pakāranti pariyāyavacanaṃ. Purisassa puggalassāti pariyāyavacanaṃ. Cittaṃ viññāṇaṃ manoti pariyāyavacanaṃ. Pariyādāya gahetvā khepetvāti pariyāyavacanaṃ. Tiṭṭhati dharati ṭhātīti pariyāyavacanaṃ. Yathā yena pakārena yenākārenāti pariyāyavacanaṃ. Itthī nārī mātugāmoti pariyāyavacananti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vevacano hāro"
      },
      ". Vividhaṃ vacanaṃ ekassevatthassa vācakametthāti vivacanaṃ, vivacanameva vevacanaṃ. Vividhaṃ vuccati etena atthoti vā vivacanaṃ, vivacanameva vevacanaṃ. Ekasmiṃ atthe anekapariyāyasaddappayojanalakkhaṇo hi vevacano hāro. Vuttañhetaṃ –"
    ],
    "innerText": "Bhikkhave, samaṇā pabbajitāti pariyāyavacanaṃ. Aññaṃ paraṃ kiñcīti pariyāyavacanaṃ. Rūpaṃ vaṇṇaṃ cakkhuviññeyyanti pariyāyavacanaṃ. Samanupassāmi olokessāmi jānāmīti pariyāyavacanaṃ. Evaṃ itthaṃ imaṃ pakāranti pariyāyavacanaṃ. Purisassa puggalassāti pariyāyavacanaṃ. Cittaṃ viññāṇaṃ manoti pariyāyavacanaṃ. Pariyādāya gahetvā khepetvāti pariyāyavacanaṃ. Tiṭṭhati dharati ṭhātīti pariyāyavacanaṃ. Yathā yena pakārena yenākārenāti pariyāyavacanaṃ. Itthī nārī mātugāmoti pariyāyavacananti ayaṃ vevacano hāro. Vividhaṃ vacanaṃ ekassevatthassa vācakametthāti vivacanaṃ, vivacanameva vevacanaṃ. Vividhaṃ vuccati etena atthoti vā vivacanaṃ, vivacanameva vevacanaṃ. Ekasmiṃ atthe anekapariyāyasaddappayojanalakkhaṇo hi vevacano hāro. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Vevacanāni ",
      " bahūni tu, sutte vuttāni ekadhammassa;"
    ],
    "innerText": "‘‘Vevacanāni bahūni tu, sutte vuttāni ekadhammassa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yo jānāti suttavidū, vevacano nāma so hāro’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rūpaṃ ",
      " kāḷasāmādivasena anekadhā paññattaṃ. Puriso khattiyādivasena anekadhā paññatto. Cittaṃ parittamahaggatādivasena anekadhā paññattaṃ. ‘‘Pariyādāyā’’ti ettha pariyādānaṃ pariyādāyakānaṃ pāpadhammānaṃ vasena vītikkamapariyuṭṭhānādinā ca anekadhā paññattaṃ. Ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññattihāro"
      },
      ". Pakārehi, pabhedato vā ñāpīyanti iminā, ettha vā atthāti paññatti. Ekekassa dhammassa anekāhi paññattīhi paññāpetabbākāravibhāvanalakkhaṇo hi paññattihāro. Vuttañhetaṃ –"
    ],
    "innerText": "Rūpaṃ kāḷasāmādivasena anekadhā paññattaṃ. Puriso khattiyādivasena anekadhā paññatto. Cittaṃ parittamahaggatādivasena anekadhā paññattaṃ. ‘‘Pariyādāyā’’ti ettha pariyādānaṃ pariyādāyakānaṃ pāpadhammānaṃ vasena vītikkamapariyuṭṭhānādinā ca anekadhā paññattaṃ. Ayaṃ paññattihāro. Pakārehi, pabhedato vā ñāpīyanti iminā, ettha vā atthāti paññatti. Ekekassa dhammassa anekāhi paññattīhi paññāpetabbākāravibhāvanalakkhaṇo hi paññattihāro. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ekaṃ bhagavā dhammaṃ, paññattīhi vividhāhi deseti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "So ākāro ñeyyo, paññattī nāma so hāro’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Virodhipaccayasamavāye visadisuppattiruppanavaṇṇavikārāpattiyā taṃsamaṅgino hadayaṅgatabhāvappakāsanaṃ rūpaṭṭhoti aniccatāmukhena otaraṇaṃ, aniccassa pana dukkhattā dukkhatāmukhena, dukkhassa ca anattakattā suññatāmukhena otaraṇaṃ. Cittaṃ manoviññāṇadhātu, tassā pariyādāyikā taṇhā tadekaṭṭhā ca pāpadhammā dhammadhātūti dhātumukhena otaraṇaṃ. Evaṃ khandhāyatanādimukhehipi otaraṇaṃ vattabbanti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "otaraṇo hāro"
      },
      ". Otārīyanti anuppavesīyanti etena, ettha vā suttāgatā dhammā paṭiccasamuppādādīsūti otaraṇo. Paṭiccasamuppādādimukhena suttatthassa otaraṇalakkhaṇo hi otaraṇo hāro. Vuttañhetaṃ –"
    ],
    "innerText": "Virodhipaccayasamavāye visadisuppattiruppanavaṇṇavikārāpattiyā taṃsamaṅgino hadayaṅgatabhāvappakāsanaṃ rūpaṭṭhoti aniccatāmukhena otaraṇaṃ, aniccassa pana dukkhattā dukkhatāmukhena, dukkhassa ca anattakattā suññatāmukhena otaraṇaṃ. Cittaṃ manoviññāṇadhātu, tassā pariyādāyikā taṇhā tadekaṭṭhā ca pāpadhammā dhammadhātūti dhātumukhena otaraṇaṃ. Evaṃ khandhāyatanādimukhehipi otaraṇaṃ vattabbanti ayaṃ otaraṇo hāro. Otārīyanti anuppavesīyanti etena, ettha vā suttāgatā dhammā paṭiccasamuppādādīsūti otaraṇo. Paṭiccasamuppādādimukhena suttatthassa otaraṇalakkhaṇo hi otaraṇo hāro. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo ca paṭiccuppādo, indriyakhandhā ca dhātuāyatanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etehi otarati yo, otaraṇo nāma so hāro’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāhaṃ, bhikkhave…pe… samanupassāmī"
      },
      "ti ārambho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ purisassa cittaṃ pariyādāya tiṭṭhatī"
      },
      "ti padasuddhi, na pana ārambhasuddhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathayida"
      },
      "ntiādi padasuddhi ceva ārambhasuddhi cāti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sodhano hāro"
      },
      ". Sodhīyanti samādhīyanti etena, ettha vā sutte padapadatthapañhārambhāti sodhano. Sutte padapadatthapañhārambhānaṃ sodhanalakkhaṇo hi sodhano hāro. Vuttañhetaṃ –"
    ],
    "innerText": "Nāhaṃ, bhikkhave…pe… samanupassāmīti ārambho. Evaṃ purisassa cittaṃ pariyādāya tiṭṭhatīti padasuddhi, na pana ārambhasuddhi. Yathayidantiādi padasuddhi ceva ārambhasuddhi cāti ayaṃ sodhano hāro. Sodhīyanti samādhīyanti etena, ettha vā sutte padapadatthapañhārambhāti sodhano. Sutte padapadatthapañhārambhānaṃ sodhanalakkhaṇo hi sodhano hāro. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Vissajjitamhi ",
      " pañhe, gāthāyaṃ pucchitāyamārabbha;"
    ],
    "innerText": "‘‘Vissajjitamhi pañhe, gāthāyaṃ pucchitāyamārabbha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Suddhāsuddhaparikkhā, hāro so sodhano nāmā’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Añña"
      },
      "nti ",
      " sāmaññato adhiṭṭhānaṃ kassaci visesassa anāmaṭṭhattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekarūpampī"
      },
      "ti taṃ avikappetvā visesavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathayida"
      },
      "nti sāmaññato adhiṭṭhānaṃ aniyamavacanabhāvato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itthirūpa"
      },
      "nti taṃ avikappetvā visesavacananti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhiṭṭhāno hāro"
      },
      ". Adhiṭṭhīyanti anuppavattīyanti etena, ettha vā sāmaññavisesabhūtā dhammā vinā vikappenāti adhiṭṭhāno. Suttāgatānaṃ dhammānaṃ avikappanavaseneva sāmaññavisesaniddhāraṇalakkhaṇo hi adhiṭṭhāno hāro. Vuttampi cetaṃ –"
    ],
    "innerText": "Aññanti sāmaññato adhiṭṭhānaṃ kassaci visesassa anāmaṭṭhattā. Ekarūpampīti taṃ avikappetvā visesavacanaṃ. Yathayidanti sāmaññato adhiṭṭhānaṃ aniyamavacanabhāvato. Itthirūpanti taṃ avikappetvā visesavacananti ayaṃ adhiṭṭhāno hāro. Adhiṭṭhīyanti anuppavattīyanti etena, ettha vā sāmaññavisesabhūtā dhammā vinā vikappenāti adhiṭṭhāno. Suttāgatānaṃ dhammānaṃ avikappanavaseneva sāmaññavisesaniddhāraṇalakkhaṇo hi adhiṭṭhāno hāro. Vuttampi cetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ekattatāya dhammā, yepi ca vemattatāya niddiṭṭhā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tena vikappayitabbā, eso hāro adhiṭṭhāno’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rūpassa kammāvijjādayo kammacittādayo ca hetu. Samanupassanāya āvajjanādayo. Kusalassa cittassa yoniso manasikārādayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyādāyā"
      },
      "ti ettha pariyādānassa ayonisomanasikārādayoti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parikkhāro hāro"
      },
      ". Parikaroti abhisaṅkharoti phalanti parikkhāro, hetu paccayo ca. Parikkhāraṃ ācikkhatīti parikkhāro, hāro. Parikkhāravisayattā, parikkhārasahacaraṇato vā parikkhāro. Sutte āgatadhammānaṃ parikkhārasaṅkhātahetupaccaye niddhāretvā saṃvaṇṇanālakkhaṇo hi parikkhāro hāro. Vuttañhetaṃ –"
    ],
    "innerText": "Rūpassa kammāvijjādayo kammacittādayo ca hetu. Samanupassanāya āvajjanādayo. Kusalassa cittassa yoniso manasikārādayo. Pariyādāyāti ettha pariyādānassa ayonisomanasikārādayoti ayaṃ parikkhāro hāro. Parikaroti abhisaṅkharoti phalanti parikkhāro, hetu paccayo ca. Parikkhāraṃ ācikkhatīti parikkhāro, hāro. Parikkhāravisayattā, parikkhārasahacaraṇato vā parikkhāro. Sutte āgatadhammānaṃ parikkhārasaṅkhātahetupaccaye niddhāretvā saṃvaṇṇanālakkhaṇo hi parikkhāro hāro. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ye dhammā yaṃ dhammaṃ, janayantippaccayā paramparato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Hetumavakaḍḍhayitvā, eso hāro parikkhāro’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purisassa cittaṃ pariyādāya tiṭṭhatī"
      },
      "ti ettha pariyādāyikā visesato taṇhāvijjā veditabbā tāsaṃ vasena pariyādānasambhavato. Tāsu taṇhāya rūpamadhiṭṭhānaṃ, avijjāya arūpaṃ. Visesato taṇhāya samatho paṭipakkho, avijjāya vipassanā. Samathassa cetovimutti, phalavipassanāya paññāvimutti. Tathā hi tā rāgavirāgā avijjāvirāgāti visesetvā vuccantīti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāropano hāro"
      },
      ". Samāropīyanti etena, ettha vā padaṭṭhānādimukhena dhammāti samāropano. Sutte āgatadhammānaṃ padaṭṭhānavevacanabhāvanāpahānasamāropanavicāraṇalakkhaṇo hi samāropano hāro. Vuttañhetaṃ –"
    ],
    "innerText": "Purisassa cittaṃ pariyādāya tiṭṭhatīti ettha pariyādāyikā visesato taṇhāvijjā veditabbā tāsaṃ vasena pariyādānasambhavato. Tāsu taṇhāya rūpamadhiṭṭhānaṃ, avijjāya arūpaṃ. Visesato taṇhāya samatho paṭipakkho, avijjāya vipassanā. Samathassa cetovimutti, phalavipassanāya paññāvimutti. Tathā hi tā rāgavirāgā avijjāvirāgāti visesetvā vuccantīti ayaṃ samāropano hāro. Samāropīyanti etena, ettha vā padaṭṭhānādimukhena dhammāti samāropano. Sutte āgatadhammānaṃ padaṭṭhānavevacanabhāvanāpahānasamāropanavicāraṇalakkhaṇo hi samāropano hāro. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Ye ",
      " dhammā yaṃ mūlā, ye cekatthā pakāsitā muninā;"
    ],
    "innerText": "‘‘Ye dhammā yaṃ mūlā, ye cekatthā pakāsitā muninā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Te samāropayitabbā, esa samāropano hāro’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettāvatā ca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Desanā vicayo yutti, padaṭṭhāno ca lakkhaṇo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Catubyūho ca āvaṭṭo, vibhatti parivattano."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vevacano ca paññatti, otaraṇo ca sodhano;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Adhiṭṭhāno parikkhāro, samāropano soḷaso’’ti. (netti. 1 uddesavāra) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Evaṃ vuttā soḷasa hārā dassitāti veditabbā. Harīyanti etehi, ettha vā suttageyyādivisayā aññāṇasaṃsayavipallāsāti hārā. Haranti vā sayaṃ tāni, haraṇamattameva vāti hārā phalūpacārena. Atha vā harīyanti voharīyanti dhammasaṃvaṇṇakadhammappaṭiggāhakehi dhammassa dānaggahaṇavasenāti hārā. Atha vā hārā viyāti hārā. Yathā hi anekaratanāvalisamūho hārasaṅkhāto attano avayavabhūtaratanasamphassehi samupajaniyamānahilādasukho hutvā tadupabhogijanasarīrasantāpaṃ nidāghapariḷāhūpajanitaṃ vūpasameti, evameva tepi nānāvidhaparamattharatanappabandhā saṃvaṇṇanāvisesā attano avayavabhūtaparamattharatanādhigamena samuppādiyamānanibbutisukhā dhammappaṭiggāhakajanahadayaparitāpaṃ kāmarāgādikilesahetukaṃ vūpasamentīti. Atha vā hārayanti aññāṇādinīhāraṃ apagamaṃ karonti ācikkhantīti vā hārā. Atha vā sotujanacittassa haraṇato ramaṇato ca hārā niruttinayena yathā ‘‘bhavesu vantagamano bhagavā’’ti (visuddhi. 1.144; pārā. aṭṭha. 1.verañjakaṇḍavaṇṇanā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ito paraṃ pana nandiyāvaṭṭādipañcavidhanayā veditabbā – tattha taṇhāvijjā samudayasaccaṃ, tāsaṃ adhiṭṭhānādibhūtā rūpadhammā dukkhasaccaṃ, tesaṃ appavatti nirodhasaccaṃ, nirodhappajānanā paṭipadā maggasaccaṃ. Taṇhāgahaṇena cettha māyāsāṭheyyamānātimānamadappamādapāpicchatāpāpamittatāahirikaanottappādivasena akusalapakkho netabbo. Avijjāgahaṇena viparītamanasikārakodhūpanāhamakkhapaḷāsaissāmacchariya- sārambhadovacassatābhavadiṭṭhivibhavadiṭṭhiādivasena akusalapakkho netabbo. Vuttavipariyāyato ",
      " kusalapakkho netabbo. Kathaṃ? Amāyāasāṭheyyādivasena aviparītamanasikārādivasena ca. Tathā samathapakkhiyānaṃ saddhindriyādīnaṃ ",
      ", vipassanāpakkhiyānaṃ aniccasaññādīnañca vasena vodānapakkho netabboti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nandiyāvaṭṭassa nayassa bhūmi"
      },
      ". Yo hi taṇhāavijjāhi saṃkilesapakkhassa suttatthassa samathavipassanāhi vodānapakkhassa ca catusaccayojanamukhena nayanalakkhaṇo saṃvaṇṇanāviseso, ayaṃ nandiyāvaṭṭanayo nāma. Vuttañhetaṃ –"
    ],
    "innerText": "Ito paraṃ pana nandiyāvaṭṭādipañcavidhanayā veditabbā – tattha taṇhāvijjā samudayasaccaṃ, tāsaṃ adhiṭṭhānādibhūtā rūpadhammā dukkhasaccaṃ, tesaṃ appavatti nirodhasaccaṃ, nirodhappajānanā paṭipadā maggasaccaṃ. Taṇhāgahaṇena cettha māyāsāṭheyyamānātimānamadappamādapāpicchatāpāpamittatāahirikaanottappādivasena akusalapakkho netabbo. Avijjāgahaṇena viparītamanasikārakodhūpanāhamakkhapaḷāsaissāmacchariya- sārambhadovacassatābhavadiṭṭhivibhavadiṭṭhiādivasena akusalapakkho netabbo. Vuttavipariyāyato kusalapakkho netabbo. Kathaṃ? Amāyāasāṭheyyādivasena aviparītamanasikārādivasena ca. Tathā samathapakkhiyānaṃ saddhindriyādīnaṃ , vipassanāpakkhiyānaṃ aniccasaññādīnañca vasena vodānapakkho netabboti ayaṃ nandiyāvaṭṭassa nayassa bhūmi. Yo hi taṇhāavijjāhi saṃkilesapakkhassa suttatthassa samathavipassanāhi vodānapakkhassa ca catusaccayojanamukhena nayanalakkhaṇo saṃvaṇṇanāviseso, ayaṃ nandiyāvaṭṭanayo nāma. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Taṇhañca avijjampi ca, samathena vipassanāya yo neti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saccehi yojayitvā, ayaṃ nayo nandiyāvaṭṭo’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nandiyāvaṭṭassa viya āvaṭṭo etassāti nandiyāvaṭṭo. Yathā hi nandiyāvaṭṭo anto ṭhitena padhānāvayavena bahiddhā āvaṭṭati, evamayampi nayoti attho. Atha vā nandiyā taṇhāya pamodassa vā āvaṭṭo etthāti nandiyāvaṭṭo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Heṭṭhā vuttanayena gahitesu taṇhāvijjātappakkhiyadhammesu taṇhā lobho, avijjā moho, avijjāya sampayutto lohite sati pubbo viya taṇhāya sati sijjhamāno āghāto doso iti tīhi akusalamūlehi gahitehi, tappaṭipakkhato kusalacittaggahaṇena ca tīṇi kusalamūlāni gahitāni eva honti. Idhāpi lobho sabbāni vā sāsavakusalamūlāni samudayasaccaṃ, tannibbattā tesaṃ adhiṭṭhānagocarabhūtā upādānakkhandhā dukkhasaccantiādinā saccayojanā veditabbā. Phalaṃ panettha vimokkhattayavasena niddhāretabbaṃ, tīhi akusalamūlehi tividhaduccaritasaṃkilesamalavisamaakusalasaññāvitakkādivasena akusalapakkho netabbo, tathā tīhi kusalamūlehi tividhasucaritasamakusalasaññāvitakkasaddhammasamādhivimokkhamukhādivasena vodānapakkho netabboti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tipukkhalassa nayassa bhūmi"
      },
      ". Yo hi akusalamūlehi saṃkilesapakkhassa kusalamūlehi vodānapakkhassa suttatthassa ca catusaccayojanāmukhena nayanalakkhaṇo saṃvaṇṇanāviseso, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tipukkhalanayo"
      },
      " nāma. Tīhi avayavehi ",
      " lobhādīhi saṃkilesapakkhe, alobhādīhi ca vodānapakkhe pukkhalo sobhanoti tipukkhalo. Vuttañhetaṃ –"
    ],
    "innerText": "Heṭṭhā vuttanayena gahitesu taṇhāvijjātappakkhiyadhammesu taṇhā lobho, avijjā moho, avijjāya sampayutto lohite sati pubbo viya taṇhāya sati sijjhamāno āghāto doso iti tīhi akusalamūlehi gahitehi, tappaṭipakkhato kusalacittaggahaṇena ca tīṇi kusalamūlāni gahitāni eva honti. Idhāpi lobho sabbāni vā sāsavakusalamūlāni samudayasaccaṃ, tannibbattā tesaṃ adhiṭṭhānagocarabhūtā upādānakkhandhā dukkhasaccantiādinā saccayojanā veditabbā. Phalaṃ panettha vimokkhattayavasena niddhāretabbaṃ, tīhi akusalamūlehi tividhaduccaritasaṃkilesamalavisamaakusalasaññāvitakkādivasena akusalapakkho netabbo, tathā tīhi kusalamūlehi tividhasucaritasamakusalasaññāvitakkasaddhammasamādhivimokkhamukhādivasena vodānapakkho netabboti ayaṃ tipukkhalassa nayassa bhūmi. Yo hi akusalamūlehi saṃkilesapakkhassa kusalamūlehi vodānapakkhassa suttatthassa ca catusaccayojanāmukhena nayanalakkhaṇo saṃvaṇṇanāviseso, ayaṃ tipukkhalanayo nāma. Tīhi avayavehi lobhādīhi saṃkilesapakkhe, alobhādīhi ca vodānapakkhe pukkhalo sobhanoti tipukkhalo. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo akusale samūlehi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Neti kusale ca kusalamūlehi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Bhūtaṃ tathaṃ avitathaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tipukkhalaṃ taṃ nayaṃ āhū’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vuttanayena ",
      " gahitesu taṇhāvijjātappakkhiyadhammesu visesato taṇhādiṭṭhīnaṃ vasena asubhe ‘‘subha’’nti, dukkhe ‘‘sukha’’nti ca vipallāsā, avijjādiṭṭhīnaṃ vasena anicce ‘‘nicca’’nti, anattani ‘‘attā’’ti vipallāsā veditabbā. Tesaṃ paṭipakkhato kusalacittaggahaṇena siddhehi sativīriyasamādhipaññindriyehi cattāri satipaṭṭhānāni siddhāniyeva honti."
    ],
    "innerText": "Vuttanayena gahitesu taṇhāvijjātappakkhiyadhammesu visesato taṇhādiṭṭhīnaṃ vasena asubhe ‘‘subha’’nti, dukkhe ‘‘sukha’’nti ca vipallāsā, avijjādiṭṭhīnaṃ vasena anicce ‘‘nicca’’nti, anattani ‘‘attā’’ti vipallāsā veditabbā. Tesaṃ paṭipakkhato kusalacittaggahaṇena siddhehi sativīriyasamādhipaññindriyehi cattāri satipaṭṭhānāni siddhāniyeva honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha catūhi indriyehi cattāro puggalā niddisitabbā. Kathaṃ? Duvidho hi taṇhācarito mudindriyo tikkhindriyoti, tathā diṭṭhicarito. Tesu paṭhamo asubhe ‘‘subha’’nti vipariyesaggāhī satibalena yathābhūtaṃ kāyasabhāvaṃ sallakkhento bhāvanābalena taṃ vipallāsaṃ samugghātetvā sammattaniyāmaṃ okkamati. Dutiyo asukhe ‘‘sukha’’nti vipariyesaggāhī ‘‘uppannaṃ kāmavitakkaṃ nādhivāsetī’’tiādinā (ma. ni. 1.26; a. ni. 4.14; 6.58) vuttena vīriyasaṃvarabhūtena vīriyabalena paṭipakkhaṃ vinodento bhāvanābalena taṃ vipallāsaṃ vidhametvā sammattaniyāmaṃ okkamati. Tatiyo anicce ‘‘nicca’’nti vipallāsaggāhī samathabalena samāhitacitto saṅkhārānaṃ khaṇikabhāvaṃ sallakkhento bhāvanābalena taṃ vipallāsaṃ samugghātetvā sammattaniyāmaṃ okkamati. Catuttho santatisamūhakiccārammaṇaghanavañcitatāya phassādidhammapuñjamatte anattani ‘‘attā’’ti micchābhinivesī catukoṭikasuññatāmanasikārena taṃ micchābhinivesaṃ viddhaṃsento sāmaññaphalaṃ sacchikaroti. Subhasaññādīhi catūhipi vā vipallāsehi samudayasaccaṃ, tesamadhiṭṭhānārammaṇabhūtā pañcupādānakkhandhā dukkhasaccantiādinā saccayojanā veditabbā. Phalaṃ panettha cattāri sāmaññaphalāni, catūhi cettha vipallāsehi caturāsavoghayogaganthaagatitaṇhupādānasallaviññāṇaṭṭhitiapariññādivasena akusalapakkho netabbo, tathā catūhi satipaṭṭhānehi ",
      " catubbidhajjhānavihārādhiṭṭhānasukhabhāgiyadhammaappamaññāsammappadhānaiddhipādādivasena vodānapakkho netabboti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīhavikkīḷitassa nayassa bhūmi"
      },
      ". Yo hi subhasaññādīhi vipallāsehi sakalassa saṃkilesapakkhassa saddhindriyādīhi ca vodānapakkhassa catusaccayojanāvasena nayanalakkhaṇo saṃvaṇṇanāviseso, ayaṃ sīhavikkīḷito nāma. Vuttañhetaṃ –"
    ],
    "innerText": "Tattha catūhi indriyehi cattāro puggalā niddisitabbā. Kathaṃ? Duvidho hi taṇhācarito mudindriyo tikkhindriyoti, tathā diṭṭhicarito. Tesu paṭhamo asubhe ‘‘subha’’nti vipariyesaggāhī satibalena yathābhūtaṃ kāyasabhāvaṃ sallakkhento bhāvanābalena taṃ vipallāsaṃ samugghātetvā sammattaniyāmaṃ okkamati. Dutiyo asukhe ‘‘sukha’’nti vipariyesaggāhī ‘‘uppannaṃ kāmavitakkaṃ nādhivāsetī’’tiādinā (ma. ni. 1.26; a. ni. 4.14; 6.58) vuttena vīriyasaṃvarabhūtena vīriyabalena paṭipakkhaṃ vinodento bhāvanābalena taṃ vipallāsaṃ vidhametvā sammattaniyāmaṃ okkamati. Tatiyo anicce ‘‘nicca’’nti vipallāsaggāhī samathabalena samāhitacitto saṅkhārānaṃ khaṇikabhāvaṃ sallakkhento bhāvanābalena taṃ vipallāsaṃ samugghātetvā sammattaniyāmaṃ okkamati. Catuttho santatisamūhakiccārammaṇaghanavañcitatāya phassādidhammapuñjamatte anattani ‘‘attā’’ti micchābhinivesī catukoṭikasuññatāmanasikārena taṃ micchābhinivesaṃ viddhaṃsento sāmaññaphalaṃ sacchikaroti. Subhasaññādīhi catūhipi vā vipallāsehi samudayasaccaṃ, tesamadhiṭṭhānārammaṇabhūtā pañcupādānakkhandhā dukkhasaccantiādinā saccayojanā veditabbā. Phalaṃ panettha cattāri sāmaññaphalāni, catūhi cettha vipallāsehi caturāsavoghayogaganthaagatitaṇhupādānasallaviññāṇaṭṭhitiapariññādivasena akusalapakkho netabbo, tathā catūhi satipaṭṭhānehi catubbidhajjhānavihārādhiṭṭhānasukhabhāgiyadhammaappamaññāsammappadhānaiddhipādādivasena vodānapakkho netabboti ayaṃ sīhavikkīḷitassa nayassa bhūmi. Yo hi subhasaññādīhi vipallāsehi sakalassa saṃkilesapakkhassa saddhindriyādīhi ca vodānapakkhassa catusaccayojanāvasena nayanalakkhaṇo saṃvaṇṇanāviseso, ayaṃ sīhavikkīḷito nāma. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo neti vipallāsehi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Kilese indriyehi saddhamme;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Etaṃ nayaṃ nayavidū,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sīhavikkīḷitaṃ āhū’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Asantāsanajavaparakkamādivisesayogena ",
      " sīho bhagavā, tassa vikkīḷitaṃ desanā vacīkammabhūto vihāroti katvā vipallāsatappaṭipakkhaparidīpanato sīhassa vikkīḷitaṃ etthāti sīhavikkīḷito, nayo. Balavisesayogadīpanato vā sīhavikkīḷitasadisattā nayo sīhavikkīḷito. Balaviseso cettha saddhādibalaṃ, dasabalāni eva vā."
    ],
    "innerText": "Asantāsanajavaparakkamādivisesayogena sīho bhagavā, tassa vikkīḷitaṃ desanā vacīkammabhūto vihāroti katvā vipallāsatappaṭipakkhaparidīpanato sīhassa vikkīḷitaṃ etthāti sīhavikkīḷito, nayo. Balavisesayogadīpanato vā sīhavikkīḷitasadisattā nayo sīhavikkīḷito. Balaviseso cettha saddhādibalaṃ, dasabalāni eva vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesaṃ pana tiṇṇaṃ atthanayānaṃ siddhiyā vohāranayadvayaṃ siddhameva hoti. Tathā hi atthanayattayadisābhāvena kusalādidhammānaṃ ālocanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "disālocanaṃ"
      },
      ". Vuttañhetaṃ –"
    ],
    "innerText": "Imesaṃ pana tiṇṇaṃ atthanayānaṃ siddhiyā vohāranayadvayaṃ siddhameva hoti. Tathā hi atthanayattayadisābhāvena kusalādidhammānaṃ ālocanaṃ disālocanaṃ. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Veyyākaraṇesu hi ye,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Kusalākusalā tahiṃ tahiṃ vuttā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Manasā olokayate,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Taṃ khu disālocanaṃ āhū’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā ālocitānaṃ tesaṃ dhammānaṃ atthanayattayayojane samānayanato aṅkuso viya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṅkuso"
      },
      ". Vuttañhetaṃ –"
    ],
    "innerText": "Tathā ālocitānaṃ tesaṃ dhammānaṃ atthanayattayayojane samānayanato aṅkuso viya aṅkuso. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Oloketvā disalocanena, ukkhipiya yaṃ samāneti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbe kusalākusale, ayaṃ nayo aṅkuso nāmā’’ti. (netti. 4 niddesavāra);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmā manasāva atthanayānaṃ disābhūtadhammānaṃ locanaṃ disālocanaṃ, tesaṃ samānayanaṃ aṅkusoti pañcapi nayāni yuttāni honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā ",
      " ca –"
    ],
    "innerText": "Ettāvatā ca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Paṭhamo nandiyāvaṭṭo, dutiyo ca tipukkhalo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sīhavikkīḷito nāma, tatiyo nayalañjako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Disālocanamāhaṃsu, catutthaṃ nayamuttamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pañcamo aṅkuso nāma, sabbe pañca nayā gatā’’ti. (netti. 1 uddesavāra) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ ",
      " vuttapañcanayāpi ettha dassitāti veditabbā. Nayati saṃkilesaṃ vodānañca vibhāgato ñāpetīti nayo, lañjeti pakāseti suttatthanti lañjako, nayo ca so lañjako cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nayalañjako"
      },
      ". Idañca suttaṃ soḷasavidhe suttantapaṭṭhāne saṃkilesabhāgiyaṃ byatirekamukhena nibbedhāsekkhabhāgiyanti daṭṭhabbaṃ. Aṭṭhavīsatividhe pana suttantapaṭṭhāne lokiyalokuttaraṃ sattadhammādhiṭṭhānaṃ ñāṇaññeyyaṃ dassanabhāvanaṃ sakavacanaṃ vissajjanīyaṃ kusalākusalaṃ anuññātaṃ paṭikkhittañcāti veditabbaṃ."
    ],
    "innerText": "Evaṃ vuttapañcanayāpi ettha dassitāti veditabbā. Nayati saṃkilesaṃ vodānañca vibhāgato ñāpetīti nayo, lañjeti pakāseti suttatthanti lañjako, nayo ca so lañjako cāti nayalañjako. Idañca suttaṃ soḷasavidhe suttantapaṭṭhāne saṃkilesabhāgiyaṃ byatirekamukhena nibbedhāsekkhabhāgiyanti daṭṭhabbaṃ. Aṭṭhavīsatividhe pana suttantapaṭṭhāne lokiyalokuttaraṃ sattadhammādhiṭṭhānaṃ ñāṇaññeyyaṃ dassanabhāvanaṃ sakavacanaṃ vissajjanīyaṃ kusalākusalaṃ anuññātaṃ paṭikkhittañcāti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha soḷasavidhasuttantaṃ paṭṭhānaṃ nāma ‘‘saṃkilesabhāgiyaṃ suttaṃ, vāsanābhāgiyaṃ suttaṃ, nibbedhabhāgiyaṃ suttaṃ, asekkhabhāgiyaṃ suttaṃ, saṃkilesabhāgiyañca vāsanābhāgiyañca suttaṃ, saṃkilesabhāgiyañca nibbedhabhāgiyañca suttaṃ, saṃkilesabhāgiyañca asekkhabhāgiyañca suttaṃ, vāsanābhāgiyañca nibbedhabhāgiyañca suttaṃ, vāsanābhāgiyañca asekkhabhāgiyañca suttaṃ, nibbedhabhāgiyañca asekkhabhāgiyañca suttaṃ, saṃkilesabhāgiyañca vāsanābhāgiyañca nibbedhabhāgiyañca suttaṃ, saṃkilesabhāgiyañca vāsanābhāgiyañca asekkhabhāgiyañca suttaṃ, saṃkilesabhāgiyañca nibbedhabhāgiyañca asekkhabhāgiyañca suttaṃ, vāsanābhāgiyañca nibbedhabhāgiyañca asekkhabhāgiyañca suttaṃ, saṃkilesabhāgiyañca vāsanābhāgiyañca nibbedhabhāgiyañca asekkhabhāgiyañca suttaṃ, neva saṃkilesabhāgiyaṃ na vāsanābhāgiyaṃ na nibbedhabhāgiyaṃ na asekkhabhāgiyaṃ sutta’’nti (netti. 89) evaṃ vuttasoḷasasāsanapaṭṭhānāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha saṃkilissanti etenāti saṃkileso, saṃkilesabhāge saṃkilesakoṭṭhāse pavattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃkilesabhāgiyaṃ"
      },
      ". Vāsanā puññabhāvanā, vāsanābhāge pavattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vāsanābhāgiyaṃ,"
      },
      " vāsanaṃ bhajāpetīti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vāsanābhāgiyaṃ"
      },
      ". Nibbijjhanaṃ lobhakkhandhādīnaṃ padālanaṃ nibbedho, nibbedhabhāge ",
      " pavattaṃ, nibbedhaṃ bhajāpetīti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nibbedhabhāgiyaṃ"
      },
      ". Pariniṭṭhitasikkhā dhammā asekkhā, asekkhabhāge pavattaṃ, asekkhe bhajāpetīti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asekkhabhāgiyaṃ"
      },
      ". Tesu yattha taṇhādisaṃkileso vibhatto, idaṃ saṃkilesabhāgiyaṃ. Yattha dānādipuññakiriyavatthu vibhattaṃ, idaṃ vāsanābhāgiyaṃ. Yattha sekkhā sīlakkhandhādayo vibhattā, idaṃ nibbedhabhāgiyaṃ. Yattha pana asekkhā sīlakkhandhādayo vibhattā, idaṃ asekkhabhāgiyaṃ. Itarāni tesaṃ vomissakanayavasena vuttāni. Sabbāsavasaṃvarapariyāyādīnaṃ vasena sabbabhāgiyaṃ veditabbaṃ. Tattha hi saṃkilesadhammā lokiyasucaritadhammā sekkhā dhammā asekkhā dhammā ca vibhattā. Sabbabhāgiyaṃ pana ‘‘passaṃ na passatī’’tiādikaṃ udakādianuvādavacanaṃ veditabbaṃ."
    ],
    "innerText": "Tattha saṃkilissanti etenāti saṃkileso, saṃkilesabhāge saṃkilesakoṭṭhāse pavattaṃ saṃkilesabhāgiyaṃ. Vāsanā puññabhāvanā, vāsanābhāge pavattaṃ vāsanābhāgiyaṃ, vāsanaṃ bhajāpetīti vā vāsanābhāgiyaṃ. Nibbijjhanaṃ lobhakkhandhādīnaṃ padālanaṃ nibbedho, nibbedhabhāge pavattaṃ, nibbedhaṃ bhajāpetīti vā nibbedhabhāgiyaṃ. Pariniṭṭhitasikkhā dhammā asekkhā, asekkhabhāge pavattaṃ, asekkhe bhajāpetīti vā asekkhabhāgiyaṃ. Tesu yattha taṇhādisaṃkileso vibhatto, idaṃ saṃkilesabhāgiyaṃ. Yattha dānādipuññakiriyavatthu vibhattaṃ, idaṃ vāsanābhāgiyaṃ. Yattha sekkhā sīlakkhandhādayo vibhattā, idaṃ nibbedhabhāgiyaṃ. Yattha pana asekkhā sīlakkhandhādayo vibhattā, idaṃ asekkhabhāgiyaṃ. Itarāni tesaṃ vomissakanayavasena vuttāni. Sabbāsavasaṃvarapariyāyādīnaṃ vasena sabbabhāgiyaṃ veditabbaṃ. Tattha hi saṃkilesadhammā lokiyasucaritadhammā sekkhā dhammā asekkhā dhammā ca vibhattā. Sabbabhāgiyaṃ pana ‘‘passaṃ na passatī’’tiādikaṃ udakādianuvādavacanaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aṭṭhavīsatividhaṃ ",
      " suttantapaṭṭhānaṃ pana ‘‘lokiyaṃ, lokuttaraṃ, lokiyañca lokuttarañca, sattādhiṭṭhānaṃ, dhammādhiṭṭhānaṃ, sattādhiṭṭhānañca dhammādhiṭṭhānañca, ñāṇaṃ, ñeyyaṃ, ñāṇañca ñeyyañca, dassanaṃ, bhāvanā, dassanañca bhāvanā ca, sakavacanaṃ, paravacanaṃ, sakavacanañca paravacanañca, vissajjanīyaṃ, avissajjanīyaṃ, vissajjanīyañca avissajjanīyañca, kammaṃ, vipāko, kammañca vipāko ca kusalaṃ, akusalaṃ, kusalañca akusalañca anuññātaṃ, paṭikkhittaṃ, anuññātañca paṭikkhittañca, thavo’’ti (netti. 112) evamāgatāni aṭṭhavīsati sāsanapaṭṭhānāni. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokiya"
      },
      "nti loke niyutto, loke vā vidito lokiyo. Idha pana lokiyo attho yasmiṃ sutte vutto, taṃ suttaṃ lokiyaṃ. Tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokuttaraṃ"
      },
      ". Yasmiṃ pana sutte padesena lokiyaṃ, padesena lokuttaraṃ vuttaṃ, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokiyañca lokuttarañca"
      },
      ". Sattaadhippāyasattapaññattimukhena desitaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sattādhiṭṭhānaṃ"
      },
      ". Dhammavasena desitaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammādhiṭṭhānaṃ"
      },
      ". Ubhayavasena desitaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sattādhiṭṭhānañca dhammādhiṭṭhānañca"
      },
      ". Iminā nayena sabbapadesu attho veditabbo. Buddhādīnaṃ pana guṇābhitthavanavasena pavattaṃ suttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "thavo"
      },
      " nāma –"
    ],
    "innerText": "Aṭṭhavīsatividhaṃ suttantapaṭṭhānaṃ pana ‘‘lokiyaṃ, lokuttaraṃ, lokiyañca lokuttarañca, sattādhiṭṭhānaṃ, dhammādhiṭṭhānaṃ, sattādhiṭṭhānañca dhammādhiṭṭhānañca, ñāṇaṃ, ñeyyaṃ, ñāṇañca ñeyyañca, dassanaṃ, bhāvanā, dassanañca bhāvanā ca, sakavacanaṃ, paravacanaṃ, sakavacanañca paravacanañca, vissajjanīyaṃ, avissajjanīyaṃ, vissajjanīyañca avissajjanīyañca, kammaṃ, vipāko, kammañca vipāko ca kusalaṃ, akusalaṃ, kusalañca akusalañca anuññātaṃ, paṭikkhittaṃ, anuññātañca paṭikkhittañca, thavo’’ti (netti. 112) evamāgatāni aṭṭhavīsati sāsanapaṭṭhānāni. Tattha lokiyanti loke niyutto, loke vā vidito lokiyo. Idha pana lokiyo attho yasmiṃ sutte vutto, taṃ suttaṃ lokiyaṃ. Tathā lokuttaraṃ. Yasmiṃ pana sutte padesena lokiyaṃ, padesena lokuttaraṃ vuttaṃ, taṃ lokiyañca lokuttarañca. Sattaadhippāyasattapaññattimukhena desitaṃ sattādhiṭṭhānaṃ. Dhammavasena desitaṃ dhammādhiṭṭhānaṃ. Ubhayavasena desitaṃ sattādhiṭṭhānañca dhammādhiṭṭhānañca. Iminā nayena sabbapadesu attho veditabbo. Buddhādīnaṃ pana guṇābhitthavanavasena pavattaṃ suttaṃ thavo nāma –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Maggānaṭṭhaṅgiko seṭṭho, saccānaṃ caturo padā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Virāgo seṭṭho dhammānaṃ, dvipadānañca cakkhumā’’ti. (dha. pa. 273; netti. 170; peṭako. 30) ādikaṃ viya –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nettinayavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddagarukādīna"
      },
      "nti ",
      " ādisaddena gandharasaphoṭṭhabbagaruke saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsayavasenā"
      },
      "ti ajjhāsayavasena. Utusamuṭṭhānopi itthisantānagato saddo labbhati, so idha nādhippetoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cittasamuṭṭhāno’’"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathitasaddo"
      },
      " ālāpādisaddo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gītasaddo"
      },
      " sarena gāyanasaddo. Itthiyā hasanasaddopettha saṅgahetabbo tassapi purisena assādetabbato. Tenāha – ‘‘apica kho mātugāmassa saddaṃ suṇāti tirokuṭṭā vā tiropākārā vā hasantiyā vā bhaṇantiyā vā gāyantiyā vā, so tadassādetī’’tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nivatthanivāsanassā"
      },
      "ti khalitthaddhassa nivāsanassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alaṅkārassā"
      },
      "ti nūpurādikassa alaṅkārassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itthisaddotveva veditabbo"
      },
      "ti itthipaṭibaddhabhāvato vuttaṃ. Tenāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sabbopī’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avidūraṭṭhāne"
      },
      "ti tassa hatthikulassa vasanaṭṭhānato avidūraṭṭhāne. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyūpapanno"
      },
      "ti sampannakāyo thirakathinamahākāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāhatthī"
      },
      "ti mahānubhāvo hatthī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jeṭṭhakaṃ katvā"
      },
      "ti yūthapatiṃ katvā."
    ],
    "innerText": "2.Saddagarukādīnanti ādisaddena gandharasaphoṭṭhabbagaruke saṅgaṇhāti. Āsayavasenāti ajjhāsayavasena. Utusamuṭṭhānopi itthisantānagato saddo labbhati, so idha nādhippetoti ‘‘cittasamuṭṭhāno’’ti vuttaṃ. Kathitasaddo ālāpādisaddo. Gītasaddo sarena gāyanasaddo. Itthiyā hasanasaddopettha saṅgahetabbo tassapi purisena assādetabbato. Tenāha – ‘‘apica kho mātugāmassa saddaṃ suṇāti tirokuṭṭā vā tiropākārā vā hasantiyā vā bhaṇantiyā vā gāyantiyā vā, so tadassādetī’’tiādi. Nivatthanivāsanassāti khalitthaddhassa nivāsanassa. Alaṅkārassāti nūpurādikassa alaṅkārassa. Itthisaddotveva veditabboti itthipaṭibaddhabhāvato vuttaṃ. Tenāha – ‘‘sabbopī’’tiādi. Avidūraṭṭhāneti tassa hatthikulassa vasanaṭṭhānato avidūraṭṭhāne. Kāyūpapannoti sampannakāyo thirakathinamahākāyo. Mahāhatthīti mahānubhāvo hatthī. Jeṭṭhakaṃ katvāti yūthapatiṃ katvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathinatikkhabhāvena ",
      " siṅgasadisattā aḷasaṅkhātāni siṅgāni etassa atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "siṅgī,"
      },
      " suvaṇṇavaṇṇatāya mahābalatāya ca sīhahatthiādimigasadisattā migo viyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "migo"
      },
      ". Tattha tattha kiccaṃ netubhāvena cakkhuyeva nettaṃ, taṃ uggataṭṭhena āyataṃ etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āyatacakkhunetto"
      },
      ". Aṭṭhi eva taco etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhittaco. Tenābhibhūto"
      },
      "ti tena migena abhibhūto ajjhotthaṭo niccalaggahito hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Karuṇaṃ rudāmī"
      },
      "ti kāruññapatto hutvā rodāmi viravāmi. Paccatthikabhayato mutti nāma yathā tathā sahāyavato hoti, na ekākinoti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘mā heva maṃ pāṇasamaṃ jaheyyā’’"
      },
      "ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mā heva ma"
      },
      "nti maṃ evarūpaṃ byasanaṃ pattaṃ attano pāṇasamaṃ piyasāmikaṃ tvaṃ māheva jahi."
    ],
    "innerText": "Kathinatikkhabhāvena siṅgasadisattā aḷasaṅkhātāni siṅgāni etassa atthīti siṅgī, suvaṇṇavaṇṇatāya mahābalatāya ca sīhahatthiādimigasadisattā migo viyāti migo. Tattha tattha kiccaṃ netubhāvena cakkhuyeva nettaṃ, taṃ uggataṭṭhena āyataṃ etassāti āyatacakkhunetto. Aṭṭhi eva taco etassāti aṭṭhittaco. Tenābhibhūtoti tena migena abhibhūto ajjhotthaṭo niccalaggahito hutvā. Karuṇaṃ rudāmīti kāruññapatto hutvā rodāmi viravāmi. Paccatthikabhayato mutti nāma yathā tathā sahāyavato hoti, na ekākinoti āha – ‘‘mā heva maṃ pāṇasamaṃ jaheyyā’’ti. Tattha mā heva manti maṃ evarūpaṃ byasanaṃ pattaṃ attano pāṇasamaṃ piyasāmikaṃ tvaṃ māheva jahi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kuñce girikūṭe ramati abhiramati, tattha vā vicarati, koñjanādaṃ nadanto vā vicarati, ku vā pathavī, tadabhighātena jīratīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kuñjaro. Saṭṭhihāyana"
      },
      "nti jātiyā saṭṭhivassakālasmiṃ kuñjarā thāmena parihāyanti, taṃ sandhāya evamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pathabyā cāturantāyā"
      },
      "ti catūsu disāsu samuddaṃ patvā ṭhitāya cāturantāya pathaviyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suppiyo"
      },
      "ti suṭṭhu piyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesaṃ tvaṃ vārijo seṭṭho"
      },
      "ti ye samudde vā gaṅgāya vā yamunāya vā nammadānadiyā vā kuḷīrā, tesaṃ sabbesaṃ vaṇṇasampattiyā mahantattena ca vārimhi ",
      " jātattā vārijo tvameva seṭṭho pasatthataro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muñca rodantiyā pati"
      },
      "nti sabbesaṃ seṭṭhattā tameva yācāmi, rodamānāya mayhaṃ sāmikaṃ muñca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Athā"
      },
      "ti gahaṇassa sithilakaraṇasamanantarameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etassā"
      },
      "ti paṭisattumaddanassa."
    ],
    "innerText": "Kuñce girikūṭe ramati abhiramati, tattha vā vicarati, koñjanādaṃ nadanto vā vicarati, ku vā pathavī, tadabhighātena jīratīti kuñjaro. Saṭṭhihāyananti jātiyā saṭṭhivassakālasmiṃ kuñjarā thāmena parihāyanti, taṃ sandhāya evamāha. Pathabyā cāturantāyāti catūsu disāsu samuddaṃ patvā ṭhitāya cāturantāya pathaviyā. Suppiyoti suṭṭhu piyo. Tesaṃ tvaṃ vārijo seṭṭhoti ye samudde vā gaṅgāya vā yamunāya vā nammadānadiyā vā kuḷīrā, tesaṃ sabbesaṃ vaṇṇasampattiyā mahantattena ca vārimhi jātattā vārijo tvameva seṭṭho pasatthataro. Muñca rodantiyā patinti sabbesaṃ seṭṭhattā tameva yācāmi, rodamānāya mayhaṃ sāmikaṃ muñca. Athāti gahaṇassa sithilakaraṇasamanantarameva. Etassāti paṭisattumaddanassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabbatagahanaṃ nissāyā"
      },
      "ti tisso pabbatarājiyo atikkamitvā catutthāya pabbatarājiyaṃ pabbatagahanaṃ upanissāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ vadatī"
      },
      "ti ‘‘udetayaṃ cakkhumā’’tiādinā (jā. 1.2.17) imaṃ buddhamantaṃ mantento vadati."
    ],
    "innerText": "Pabbatagahanaṃ nissāyāti tisso pabbatarājiyo atikkamitvā catutthāya pabbatarājiyaṃ pabbatagahanaṃ upanissāya. Evaṃ vadatīti ‘‘udetayaṃ cakkhumā’’tiādinā (jā. 1.2.17) imaṃ buddhamantaṃ mantento vadati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "udetī"
      },
      "ti pācīnalokadhātuto uggacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhumā"
      },
      "ti sakalacakkavāḷavāsīnaṃ andhakāraṃ vidhamitvā cakkhuppaṭilābhakaraṇena yantena tesaṃ dinnaṃ cakkhu, tena cakkhunā cakkhumā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekarājā"
      },
      "ti sakalacakkavāḷe ālokakarānaṃ antare seṭṭhaṭṭhena rañjanaṭṭhena ca ekarājā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Harissavaṇṇo"
      },
      "ti harisamānavaṇṇo, suvaṇṇavaṇṇoti attho. Pathaviṃ pabhāsetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pathavippabhāso. Taṃ taṃ namassāmī"
      },
      "ti tasmā taṃ evarūpaṃ bhavantaṃ namassāmi vandāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tayājja guttā viharemha divasa"
      },
      "nti tayā ajja rakkhitā hutvā imaṃ divasaṃ catuiriyāpathavihārena sukhaṃ vihareyyāma."
    ],
    "innerText": "Tattha udetīti pācīnalokadhātuto uggacchati. Cakkhumāti sakalacakkavāḷavāsīnaṃ andhakāraṃ vidhamitvā cakkhuppaṭilābhakaraṇena yantena tesaṃ dinnaṃ cakkhu, tena cakkhunā cakkhumā. Ekarājāti sakalacakkavāḷe ālokakarānaṃ antare seṭṭhaṭṭhena rañjanaṭṭhena ca ekarājā. Harissavaṇṇoti harisamānavaṇṇo, suvaṇṇavaṇṇoti attho. Pathaviṃ pabhāsetīti pathavippabhāso. Taṃ taṃ namassāmīti tasmā taṃ evarūpaṃ bhavantaṃ namassāmi vandāmi. Tayājja guttā viharemha divasanti tayā ajja rakkhitā hutvā imaṃ divasaṃ catuiriyāpathavihārena sukhaṃ vihareyyāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " bodhisatto imāya gāthāya sūriyaṃ namassitvā dutiyagāthāya atīte parinibbute buddhe ceva buddhaguṇe ca namassati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ye brāhmaṇā’’"
      },
      "tiādinā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ye brāhmaṇā"
      },
      "ti ye bāhitapāpā parisuddhā brāhmaṇā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vedagū"
      },
      "ti vedānaṃ pāraṃ gatā, vedehi pāraṃ gatāti vā vedagū. Idha pana sabbe saṅkhatadhamme vidite pākaṭe katvā katāti vedagū. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sabbadhamme’’"
      },
      "ti. Sabbe khandhāyatanadhātudhamme salakkhaṇasāmaññalakkhaṇavasena attano ñāṇassa vidite pākaṭe katvā tiṇṇaṃ mārānaṃ matthakaṃ madditvā sammāsambodhiṃ pattā, saṃsāraṃ vā atikkantāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te me namo"
      },
      "ti te mama imaṃ namakkāraṃ paṭicchantu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te ca maṃ pālayantū"
      },
      "ti evaṃ mayā namassitā ca te bhagavanto maṃ pālayantu rakkhantu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Namattu buddhānaṃ…pe… vimuttiyā"
      },
      "ti ayaṃ mama namakkāro atītānaṃ parinibbutānaṃ buddhānaṃ atthu, tesaṃyeva catūsu phalesu ñāṇasaṅkhātāya bodhiyā atthu, tathā tesaññeva arahattaphalavimuttiyā ",
      " vimuttānaṃ atthu, yā ca nesaṃ tadaṅgavikkhambhanasamucchedappaṭippassaddhinissaraṇasaṅkhātā pañcavidhā vimutti, tāya vimuttiyāpi ayaṃ mayhaṃ namakkāro atthūti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imaṃ so parittaṃ katvā, moro carati esanā"
      },
      "ti idaṃ pana padadvayaṃ satthā abhisambuddho hutvā āha. Tassattho – bhikkhave, so moro imaṃ parittaṃ imaṃ rakkhaṃ katvā attano gocarabhūmiyaṃ pupphaphalādīnaṃ atthāya nānappakārāya esanāya caratīti."
    ],
    "innerText": "Evaṃ bodhisatto imāya gāthāya sūriyaṃ namassitvā dutiyagāthāya atīte parinibbute buddhe ceva buddhaguṇe ca namassati ‘‘ye brāhmaṇā’’tiādinā. Tattha ye brāhmaṇāti ye bāhitapāpā parisuddhā brāhmaṇā. Vedagūti vedānaṃ pāraṃ gatā, vedehi pāraṃ gatāti vā vedagū. Idha pana sabbe saṅkhatadhamme vidite pākaṭe katvā katāti vedagū. Tenevāha – ‘‘sabbadhamme’’ti. Sabbe khandhāyatanadhātudhamme salakkhaṇasāmaññalakkhaṇavasena attano ñāṇassa vidite pākaṭe katvā tiṇṇaṃ mārānaṃ matthakaṃ madditvā sammāsambodhiṃ pattā, saṃsāraṃ vā atikkantāti attho. Te me namoti te mama imaṃ namakkāraṃ paṭicchantu. Te ca maṃ pālayantūti evaṃ mayā namassitā ca te bhagavanto maṃ pālayantu rakkhantu. Namattu buddhānaṃ…pe… vimuttiyāti ayaṃ mama namakkāro atītānaṃ parinibbutānaṃ buddhānaṃ atthu, tesaṃyeva catūsu phalesu ñāṇasaṅkhātāya bodhiyā atthu, tathā tesaññeva arahattaphalavimuttiyā vimuttānaṃ atthu, yā ca nesaṃ tadaṅgavikkhambhanasamucchedappaṭippassaddhinissaraṇasaṅkhātā pañcavidhā vimutti, tāya vimuttiyāpi ayaṃ mayhaṃ namakkāro atthūti attho. Imaṃ so parittaṃ katvā, moro carati esanāti idaṃ pana padadvayaṃ satthā abhisambuddho hutvā āha. Tassattho – bhikkhave, so moro imaṃ parittaṃ imaṃ rakkhaṃ katvā attano gocarabhūmiyaṃ pupphaphalādīnaṃ atthāya nānappakārāya esanāya caratīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ divasaṃ caritvā sāyaṃ pabbatamatthake nisīditvā atthaṃ gacchantaṃ sūriyaṃ olokento buddhaguṇe āvajjetvā nivāsaṭṭhāne rakkhāvaraṇatthāya puna brahmamantaṃ vadanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘apetaya’’"
      },
      "ntiādimāha. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘divasaṃ gocaraṃ gahetvā’’"
      },
      "tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apetī"
      },
      "ti apayāti atthaṃ gacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imaṃ so parittaṃ katvā moro vāsamakappayī"
      },
      "ti idampi abhisambuddho hutvā āha. Tassattho – bhikkhave, so moro imaṃ parittaṃ imaṃ rakkhaṃ katvā attano nivāsaṭṭhāne vāsaṃ saṃkappayitthāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parittakammato puretaramevā"
      },
      "ti parittakammakaraṇato puretarameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Morakukkuṭikāyā"
      },
      "ti kukkuṭikāsadisāya moracchāpikāya."
    ],
    "innerText": "Evaṃ divasaṃ caritvā sāyaṃ pabbatamatthake nisīditvā atthaṃ gacchantaṃ sūriyaṃ olokento buddhaguṇe āvajjetvā nivāsaṭṭhāne rakkhāvaraṇatthāya puna brahmamantaṃ vadanto ‘‘apetaya’’ntiādimāha. Tenevāha – ‘‘divasaṃ gocaraṃ gahetvā’’tiādi. Tattha apetīti apayāti atthaṃ gacchati. Imaṃ so parittaṃ katvā moro vāsamakappayīti idampi abhisambuddho hutvā āha. Tassattho – bhikkhave, so moro imaṃ parittaṃ imaṃ rakkhaṃ katvā attano nivāsaṭṭhāne vāsaṃ saṃkappayitthāti. Parittakammato puretaramevāti parittakammakaraṇato puretarameva. Morakukkuṭikāyāti kukkuṭikāsadisāya moracchāpikāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Tatiye rūpāyatanassa viya gandhāyatanassapi samuṭṭhāpakapaccayavasena viseso natthīti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘catusamuṭṭhānika’’"
      },
      "nti. Itthiyā sarīragandhassa kāyāruḷhaanulepanādigandhassa ca tappaṭibaddhabhāvato avisesena gahaṇappasaṅge idhādhippetagandhaṃ niddhārento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘svāya’’"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "itthiyā"
      },
      "ti pākatikāya itthiyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duggandho"
      },
      "ti pākatikāya itthiyā sarīragandhabhāvato duggandho hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhādhippeto"
      },
      "ti iṭṭhabhāvato assādetabbattā vuttaṃ. Kathaṃ pana itthiyā sarīragandhassa duggandhabhāvoti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ekaccā hī’’"
      },
      "tiādi. Tattha assassa viya gandho ",
      " assā atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "assagandhinī"
      },
      ". Meṇḍakassa viya gandho assā atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "meṇḍakagandhinī"
      },
      ". Sedassa viya gandho assā atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sedagandhinī"
      },
      ". Soṇitassa viya gandho assā atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "soṇitagandhinī. Rajjatevā"
      },
      "ti anādimati saṃsāre avijjādikilesavāsanāya parikaḍḍhitahadayattā phoṭṭhabbassādagadhitacittatāya ca andhabālo evarūpāyapi duggandhasarīrāya itthiyā rajjatiyeva. Pākatikāya itthiyā sarīragandhassa duggandhabhāvaṃ dassetvā idāni visiṭṭhāya ekaccāya itthiyā tadabhāvaṃ dassetuṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cakkavattino"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "panā’’"
      },
      "tiādimāha. Yadi evaṃ īdisāya itthiyā sarīragandhopi idha kasmā nādhippetoti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ayaṃ na sabbāsaṃ hotī’’"
      },
      "tiādi. Tiracchānagatāya itthiyā ekaccāya ca manussitthiyā sarīragandhassa ativiya assādetabbabhāvadassanato puna tampi avisesena anujānanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘itthikāye gandho vā hotū’’"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itthigandhotveva veditabbo"
      },
      "ti tappaṭibaddhabhāvato vuttaṃ."
    ],
    "innerText": "3. Tatiye rūpāyatanassa viya gandhāyatanassapi samuṭṭhāpakapaccayavasena viseso natthīti āha – ‘‘catusamuṭṭhānika’’nti. Itthiyā sarīragandhassa kāyāruḷhaanulepanādigandhassa ca tappaṭibaddhabhāvato avisesena gahaṇappasaṅge idhādhippetagandhaṃ niddhārento ‘‘svāya’’ntiādimāha. Tattha itthiyāti pākatikāya itthiyā. Duggandhoti pākatikāya itthiyā sarīragandhabhāvato duggandho hoti. Idhādhippetoti iṭṭhabhāvato assādetabbattā vuttaṃ. Kathaṃ pana itthiyā sarīragandhassa duggandhabhāvoti āha – ‘‘ekaccā hī’’tiādi. Tattha assassa viya gandho assā atthīti assagandhinī. Meṇḍakassa viya gandho assā atthīti meṇḍakagandhinī. Sedassa viya gandho assā atthīti sedagandhinī. Soṇitassa viya gandho assā atthīti soṇitagandhinī. Rajjatevāti anādimati saṃsāre avijjādikilesavāsanāya parikaḍḍhitahadayattā phoṭṭhabbassādagadhitacittatāya ca andhabālo evarūpāyapi duggandhasarīrāya itthiyā rajjatiyeva. Pākatikāya itthiyā sarīragandhassa duggandhabhāvaṃ dassetvā idāni visiṭṭhāya ekaccāya itthiyā tadabhāvaṃ dassetuṃ – ‘‘cakkavattinopanā’’tiādimāha. Yadi evaṃ īdisāya itthiyā sarīragandhopi idha kasmā nādhippetoti āha – ‘‘ayaṃ na sabbāsaṃ hotī’’tiādi. Tiracchānagatāya itthiyā ekaccāya ca manussitthiyā sarīragandhassa ativiya assādetabbabhāvadassanato puna tampi avisesena anujānanto ‘‘itthikāye gandho vā hotū’’tiādimāha. Itthigandhotveva veditabboti tappaṭibaddhabhāvato vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Catutthādīsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiṃ tenā"
      },
      "ti jivhāviññeyyarase idhādhippete kiṃ tena avayavarasādinā vuttena payojanaṃ. Oṭṭhamaṃsaṃ sammakkhetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "oṭṭhamaṃsasammakkhano,"
      },
      " kheḷādīni. Ādisaddena oṭṭhamaṃsamakkhano tambulamukhavāsādiraso gayhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbo so itthiraso"
      },
      "ti itthiyāvassa gahetabbattā."
    ],
    "innerText": "4. Catutthādīsu kiṃ tenāti jivhāviññeyyarase idhādhippete kiṃ tena avayavarasādinā vuttena payojanaṃ. Oṭṭhamaṃsaṃ sammakkhetīti oṭṭhamaṃsasammakkhano, kheḷādīni. Ādisaddena oṭṭhamaṃsamakkhano tambulamukhavāsādiraso gayhati. Sabbo so itthirasoti itthiyāvassa gahetabbattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itthiphoṭṭhabbo"
      },
      "ti etthāpi eseva nayo. Yadi panettha itthigatāni rūpārammaṇādīni avisesato purisassa cittaṃ pariyādāya tiṭṭhanti, atha kasmā bhagavatā tāni visuṃ visuṃ gahetvā desitānīti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘iti satthā’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā hī"
      },
      "tiādinā tamevatthaṃ samattheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gametī"
      },
      "ti vikkhepaṃ gameti, ayameva vā pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gametī"
      },
      "ti ca saṅgameti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na tathā sesā saddādayo, na tathā rūpādīni ārammaṇānī"
      },
      "ti etena sattesu rūpādigarukatā asaṃkiṇṇā viya dassitā, na kho panetaṃ evaṃ daṭṭhabbaṃ anekavidhattā sattānaṃ ajjhāsayassāti dassetuṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ekaccassa cā’’"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcagarukavasenā"
      },
      "ti pañcārammaṇagarukavasena. Ekaccassa hi purisassa yathāvuttesu pañcasupi ārammaṇesu garukatā hoti, ekaccassa tattha katipayesu, ekasmiṃ eva vā, te sabbepi pañcagarukātveva veditabbā yathā ‘‘sattisayo aṭṭhavimokkhā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na pañcagarukajātakavasena"
      },
      " ekekārammaṇe garukasseva nādhippetattā. Ekekārammaṇagarukānañhi pañcannaṃ puggalānaṃ tattha āgatattā taṃ jātakaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pañcagarukajātaka’’"
      },
      "nti vuttaṃ. Yadi evaṃ tena idha payojanaṃ natthīti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sakkhibhāvatthāyā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āharitvā kathetabba"
      },
      "nti rūpādigarukatāya ete anayabyasanaṃ pattāti dassetuṃ kathetabbaṃ."
    ],
    "innerText": "5.Itthiphoṭṭhabboti etthāpi eseva nayo. Yadi panettha itthigatāni rūpārammaṇādīni avisesato purisassa cittaṃ pariyādāya tiṭṭhanti, atha kasmā bhagavatā tāni visuṃ visuṃ gahetvā desitānīti āha – ‘‘iti satthā’’tiādi. Yathā hītiādinā tamevatthaṃ samattheti. Gametīti vikkhepaṃ gameti, ayameva vā pāṭho. Gametīti ca saṅgameti. Na tathā sesā saddādayo, na tathā rūpādīni ārammaṇānīti etena sattesu rūpādigarukatā asaṃkiṇṇā viya dassitā, na kho panetaṃ evaṃ daṭṭhabbaṃ anekavidhattā sattānaṃ ajjhāsayassāti dassetuṃ – ‘‘ekaccassa cā’’tiādi vuttaṃ. Pañcagarukavasenāti pañcārammaṇagarukavasena. Ekaccassa hi purisassa yathāvuttesu pañcasupi ārammaṇesu garukatā hoti, ekaccassa tattha katipayesu, ekasmiṃ eva vā, te sabbepi pañcagarukātveva veditabbā yathā ‘‘sattisayo aṭṭhavimokkhā’’ti. Na pañcagarukajātakavasena ekekārammaṇe garukasseva nādhippetattā. Ekekārammaṇagarukānañhi pañcannaṃ puggalānaṃ tattha āgatattā taṃ jātakaṃ ‘‘pañcagarukajātaka’’nti vuttaṃ. Yadi evaṃ tena idha payojanaṃ natthīti āha – ‘‘sakkhibhāvatthāyā’’ti. Āharitvā kathetabbanti rūpādigarukatāya ete anayabyasanaṃ pattāti dassetuṃ kathetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6-8"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesa"
      },
      "nti ",
      " suttānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppaṇḍetvā gaṇhituṃ na icchī"
      },
      "ti tassa thokaṃ virūpadhātukattā na icchi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anatikkamanto"
      },
      "ti saṃsandento. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve hatthaṃ pattānī"
      },
      "ti dve uppalāni hatthaṃ gatāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pahaṭṭhākāraṃ dassetvā"
      },
      "ti aparāhi itthīhi ekekaṃ laddhaṃ, mayā dve laddhānīti santuṭṭhākāraṃ dassetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parodī"
      },
      "ti tassā pubbasāmikassa mukhagandhaṃ saritvā. Tassa hi mukhato uppalagandho vāyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hāretvā"
      },
      "ti tasmā ṭhānā apanetvā, ‘‘harāpetvā’’ti vā pāṭho, ayamevattho."
    ],
    "innerText": "6-8.Tesanti suttānaṃ. Uppaṇḍetvā gaṇhituṃ na icchīti tassa thokaṃ virūpadhātukattā na icchi. Anatikkamantoti saṃsandento. Dve hatthaṃ pattānīti dve uppalāni hatthaṃ gatāni. Pahaṭṭhākāraṃ dassetvāti aparāhi itthīhi ekekaṃ laddhaṃ, mayā dve laddhānīti santuṭṭhākāraṃ dassetvā. Parodīti tassā pubbasāmikassa mukhagandhaṃ saritvā. Tassa hi mukhato uppalagandho vāyati. Hāretvāti tasmā ṭhānā apanetvā, ‘‘harāpetvā’’ti vā pāṭho, ayamevattho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhu sādhūti bhāsato"
      },
      "ti dhammakathāya anumodanavasena ‘‘sādhu sādhū’’ti bhāsato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppalaṃva yathodake"
      },
      "ti yathā uppalaṃ uppalagandho mukhato nibbattoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaṭṭameva kathita"
      },
      "nti yathārutavasena vuttaṃ. Yadipi evaṃ vuttaṃ, tathāpi yathārutamatthe avatvā vivaṭṭaṃ nīharitvā kathetabbaṃ vimuttirasattā bhagavato desanāya."
    ],
    "innerText": "Sādhu sādhūti bhāsatoti dhammakathāya anumodanavasena ‘‘sādhu sādhū’’ti bhāsato. Uppalaṃva yathodaketi yathā uppalaṃ uppalagandho mukhato nibbattoti. Vaṭṭameva kathitanti yathārutavasena vuttaṃ. Yadipi evaṃ vuttaṃ, tathāpi yathārutamatthe avatvā vivaṭṭaṃ nīharitvā kathetabbaṃ vimuttirasattā bhagavato desanāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Rūpādivaggavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti manorathapūraṇiyā aṅguttaranikāya-aṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamavaggavaṇṇanāya anuttānatthadīpanā niṭṭhitā."
  }
]