[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "5. Mahāyaññavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1-2. Sattaviññāṇaṭṭhitisuttādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44-45"
      },
      ". Pañcamassa ",
      " paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viññāṇaṭṭhitiyo"
      },
      "ti paṭisandhiviññāṇassa ṭhānāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seyyathāpī"
      },
      "ti nidassanatthe nipāto, yathā manussāti attho. Aparimāṇesu hi cakkavāḷesu aparimāṇānaṃ manussānaṃ vaṇṇasaṇṭhānādivasena dvepi ekasadisā natthi. Yepi hi katthaci yamakabhātaro vaṇṇena vā saṇṭhānena vā sadisā honti, tesampi ālokitavilokitakathitahasitagamanaṭṭhānādīhi viseso hotiyeva. Tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nānattakāyā"
      },
      "ti vuttā. Paṭisandhisaññā pana nesaṃ tihetukāpi dvihetukāpi ahetukāpi hoti. Tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nānattasaññino"
      },
      "ti vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekacce ca devā"
      },
      "ti cha kāmāvacaradevā. Tesu hi kesañci kāyo nīlo hoti, kesañci pītakādivaṇṇo. Saññā pana tesaṃ dvihetukāpi tihetukāpi hoti, ahetukā natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekacce"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca vinipātikā"
      },
      "ti catuapāyavinimuttā uttaramātā yakkhinī, piyaṅkaramātā, phussamittā, dhammaguttāti evamādikā aññe ca vemānikā petā. Etesañhi pītaodātakāḷamaṅguracchavisāmavaṇṇādivasena ceva kisa thūlarassadīghavasena ca kāyo nānā hoti, manussānaṃ viya dvihetukatihetukaahetukavasena saññāpi. Te pana devā viya na mahesakkhā, kapaṇamanussā viya appesakkhā dullabhaghāsacchādanā dukkhapīḷitā viharanti. Ekacce kāḷapakkhe dukkhitā juṇhapakkhe sukhitā honti. Tasmā sukhasamussayato vinipatitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinipātikā"
      },
      "ti vuttā. Ye panettha tihetukā, tesaṃ dhammābhisamayopi hoti piyaṅkaramātādīnaṃ viya."
    ],
    "innerText": "44-45. Pañcamassa paṭhame viññāṇaṭṭhitiyoti paṭisandhiviññāṇassa ṭhānāni. Seyyathāpīti nidassanatthe nipāto, yathā manussāti attho. Aparimāṇesu hi cakkavāḷesu aparimāṇānaṃ manussānaṃ vaṇṇasaṇṭhānādivasena dvepi ekasadisā natthi. Yepi hi katthaci yamakabhātaro vaṇṇena vā saṇṭhānena vā sadisā honti, tesampi ālokitavilokitakathitahasitagamanaṭṭhānādīhi viseso hotiyeva. Tasmā nānattakāyāti vuttā. Paṭisandhisaññā pana nesaṃ tihetukāpi dvihetukāpi ahetukāpi hoti. Tasmā nānattasaññinoti vuttā. Ekacce ca devāti cha kāmāvacaradevā. Tesu hi kesañci kāyo nīlo hoti, kesañci pītakādivaṇṇo. Saññā pana tesaṃ dvihetukāpi tihetukāpi hoti, ahetukā natthi. Ekacceca vinipātikāti catuapāyavinimuttā uttaramātā yakkhinī, piyaṅkaramātā, phussamittā, dhammaguttāti evamādikā aññe ca vemānikā petā. Etesañhi pītaodātakāḷamaṅguracchavisāmavaṇṇādivasena ceva kisa thūlarassadīghavasena ca kāyo nānā hoti, manussānaṃ viya dvihetukatihetukaahetukavasena saññāpi. Te pana devā viya na mahesakkhā, kapaṇamanussā viya appesakkhā dullabhaghāsacchādanā dukkhapīḷitā viharanti. Ekacce kāḷapakkhe dukkhitā juṇhapakkhe sukhitā honti. Tasmā sukhasamussayato vinipatitattā vinipātikāti vuttā. Ye panettha tihetukā, tesaṃ dhammābhisamayopi hoti piyaṅkaramātādīnaṃ viya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brahmakāyikā"
      },
      "ti ",
      " brahmapārisajjabrahmapurohitamahābrahmāno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamābhinibbattā"
      },
      "ti te sabbepi paṭhamajjhānena abhinibbattā. Brahmapārisajjā pana parittena abhinibbattā, tesaṃ kappassa tatiyo bhāgo āyuppamāṇaṃ. Brahmapurohitā majjhimena, tesaṃ upaḍḍhakappo āyuppamāṇaṃ, kāyo ca tesaṃ vipphārikataro hoti. Mahābrahmāno paṇītena, tesaṃ kappo āyuppamāṇaṃ, kāyo ca pana tesaṃ ativipphārikova hoti. Iti te kāyassa nānattā paṭhamajjhānavasena saññāya ekattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nānattakāyā ekattasaññino"
      },
      "ti veditabbā."
    ],
    "innerText": "Brahmakāyikāti brahmapārisajjabrahmapurohitamahābrahmāno. Paṭhamābhinibbattāti te sabbepi paṭhamajjhānena abhinibbattā. Brahmapārisajjā pana parittena abhinibbattā, tesaṃ kappassa tatiyo bhāgo āyuppamāṇaṃ. Brahmapurohitā majjhimena, tesaṃ upaḍḍhakappo āyuppamāṇaṃ, kāyo ca tesaṃ vipphārikataro hoti. Mahābrahmāno paṇītena, tesaṃ kappo āyuppamāṇaṃ, kāyo ca pana tesaṃ ativipphārikova hoti. Iti te kāyassa nānattā paṭhamajjhānavasena saññāya ekattā nānattakāyā ekattasaññinoti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā ",
      " ca te, evaṃ catūsu apāyesu sattā. Nirayesu hi kesañci gāvutaṃ, kesañci aḍḍhayojanaṃ, kesañci yojanaṃ attabhāvo hoti, devadattassa ",
      " pana yojanasatiko jāto. Tiracchānesupi keci khuddakā, keci mahantā. Pettivisayesupi keci saṭṭhihatthā, keci asītihatthā honti, keci suvaṇṇā, keci dubbaṇṇā. Tathā kālakañcikā asurā. Apicettha dīghapiṭṭhikapetā nāma saṭṭhiyojanikāpi honti. Saññā pana sabbesampi akusalavipākāhetukāva hoti. Iti āpāyikāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nānattakāyā ekattasaññino"
      },
      "tveva saṅkhyaṃ gacchanti."
    ],
    "innerText": "Yathā ca te, evaṃ catūsu apāyesu sattā. Nirayesu hi kesañci gāvutaṃ, kesañci aḍḍhayojanaṃ, kesañci yojanaṃ attabhāvo hoti, devadattassa pana yojanasatiko jāto. Tiracchānesupi keci khuddakā, keci mahantā. Pettivisayesupi keci saṭṭhihatthā, keci asītihatthā honti, keci suvaṇṇā, keci dubbaṇṇā. Tathā kālakañcikā asurā. Apicettha dīghapiṭṭhikapetā nāma saṭṭhiyojanikāpi honti. Saññā pana sabbesampi akusalavipākāhetukāva hoti. Iti āpāyikāpi nānattakāyā ekattasaññinotveva saṅkhyaṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ābhassarā"
      },
      "ti daṇḍaukkāya acci viya etesaṃ sarīrato ābhā chijjitvā chijjitvā patantī viya sarati vissaratīti ābhassarā. Tesu pañcakanaye dutiyatatiyajjhānadvayaṃ parittaṃ bhāvetvā upapannā parittābhā nāma honti, tesaṃ dve kappā āyuppamāṇaṃ. Majjhimaṃ bhāvetvā upapannā appamāṇābhā nāma honti, tesaṃ cattāro kappā āyuppamāṇaṃ. Paṇītaṃ bhāvetvā upapannā ābhassarā nāma honti, tesaṃ aṭṭha kappā āyuppamāṇaṃ. Idha pana ukkaṭṭhaparicchedavasena sabbeva te gahitā. Sabbesañhi tesaṃ kāyo ekavipphārova hoti, saññā pana avitakkavicāramattā vā avitakkaavicārā vāti nānā."
    ],
    "innerText": "Ābhassarāti daṇḍaukkāya acci viya etesaṃ sarīrato ābhā chijjitvā chijjitvā patantī viya sarati vissaratīti ābhassarā. Tesu pañcakanaye dutiyatatiyajjhānadvayaṃ parittaṃ bhāvetvā upapannā parittābhā nāma honti, tesaṃ dve kappā āyuppamāṇaṃ. Majjhimaṃ bhāvetvā upapannā appamāṇābhā nāma honti, tesaṃ cattāro kappā āyuppamāṇaṃ. Paṇītaṃ bhāvetvā upapannā ābhassarā nāma honti, tesaṃ aṭṭha kappā āyuppamāṇaṃ. Idha pana ukkaṭṭhaparicchedavasena sabbeva te gahitā. Sabbesañhi tesaṃ kāyo ekavipphārova hoti, saññā pana avitakkavicāramattā vā avitakkaavicārā vāti nānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Subhakiṇhā"
      },
      "ti subhena vokiṇṇā vikiṇṇā, subhena sarīrappabhāvaṇṇena ekagghanāti attho. Etesañhi na ābhassarānaṃ viya chijjitvā chijjitvā pabhā gacchati. Pañcakanaye pana parittamajjhimapaṇītassa catutthajjhānassa vasena soḷasabāttiṃsacatussaṭṭhikappāyukā parittaappamāṇasubhakiṇhā nāma hutvā nibbattanti. Iti sabbepi ",
      " te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekattakāyā"
      },
      " ceva catutthajjhānasaññāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekattasaññino"
      },
      " cāti veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vehapphalā"
      },
      "pi catutthaviññāṇaṭṭhitimeva bhajanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaññasattā"
      },
      " viññāṇābhāvā ettha saṅgahaṃ na gacchanti, sattāvāsesu gacchanti."
    ],
    "innerText": "Subhakiṇhāti subhena vokiṇṇā vikiṇṇā, subhena sarīrappabhāvaṇṇena ekagghanāti attho. Etesañhi na ābhassarānaṃ viya chijjitvā chijjitvā pabhā gacchati. Pañcakanaye pana parittamajjhimapaṇītassa catutthajjhānassa vasena soḷasabāttiṃsacatussaṭṭhikappāyukā parittaappamāṇasubhakiṇhā nāma hutvā nibbattanti. Iti sabbepi te ekattakāyā ceva catutthajjhānasaññāya ekattasaññino cāti veditabbā. Vehapphalāpi catutthaviññāṇaṭṭhitimeva bhajanti. Asaññasattā viññāṇābhāvā ettha saṅgahaṃ na gacchanti, sattāvāsesu gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suddhāvāsā"
      },
      " vivaṭṭapakkhe ṭhitā na sabbakālikā, kappasatasahassampi asaṅkheyyampi buddhasuññe loke na uppajjanti. Soḷasakappasahassaabbhantare buddhesu uppannesuyeva uppajjanti. Dhammacakkappavattissa bhagavato khandhāvāraṭṭhānasadisā honti. Tasmā neva viññāṇaṭṭhitiṃ na sattāvāsaṃ bhajanti. Mahāsīvatthero pana ‘‘na kho pana so, sāriputta, āvāso sulabharūpo, yo mayā anāvutthapubbo iminā dīghena addhunā aññatra suddhāvāsehi devehī’’ti ",
      " (ma. ni. 1.160) iminā suttena suddhāvāsāpi catutthaviññāṇaṭṭhitiṃ catutthasattāvāsañca bhajantīti vadati, taṃ appatibāhiyattā suttassa anuññātaṃ."
    ],
    "innerText": "Suddhāvāsā vivaṭṭapakkhe ṭhitā na sabbakālikā, kappasatasahassampi asaṅkheyyampi buddhasuññe loke na uppajjanti. Soḷasakappasahassaabbhantare buddhesu uppannesuyeva uppajjanti. Dhammacakkappavattissa bhagavato khandhāvāraṭṭhānasadisā honti. Tasmā neva viññāṇaṭṭhitiṃ na sattāvāsaṃ bhajanti. Mahāsīvatthero pana ‘‘na kho pana so, sāriputta, āvāso sulabharūpo, yo mayā anāvutthapubbo iminā dīghena addhunā aññatra suddhāvāsehi devehī’’ti (ma. ni. 1.160) iminā suttena suddhāvāsāpi catutthaviññāṇaṭṭhitiṃ catutthasattāvāsañca bhajantīti vadati, taṃ appatibāhiyattā suttassa anuññātaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nevasaññānāsaññāyatanaṃ yatheva saññāya, evaṃ viññāṇassāpi sukhumattā neva viññāṇaṃ nāviññāṇaṃ. Tasmā viññāṇaṭṭhitīsu na vuttaṃ. Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samādhiparikkhārā"
      },
      "ti maggasamādhissa sambhārā."
    ],
    "innerText": "Nevasaññānāsaññāyatanaṃ yatheva saññāya, evaṃ viññāṇassāpi sukhumattā neva viññāṇaṃ nāviññāṇaṃ. Tasmā viññāṇaṭṭhitīsu na vuttaṃ. Dutiye samādhiparikkhārāti maggasamādhissa sambhārā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Paṭhamaaggisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "46"
      },
      ". Tatiye sabbepi rāgādayo anuḍahanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aggī. Āhuneyyaggī"
      },
      "tiādīsu panettha āhunaṃ vuccati sakkāro, āhunaṃ arahantīti āhuneyyā. Mātāpitaro hi puttānaṃ bahupakārattā āhunaṃ arahanti, tesu vippaṭipajjamānā puttā nirayādīsu nibbattanti. Tasmā kiñcāpi mātāpitaro na ",
      " anuḍahanti, anuḍahanassa pana paccayā honti. Iti anuḍahanaṭṭheneva āhuneyyaggīti vuccanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gahapatī"
      },
      "ti pana gehasāmiko vuccati, so mātugāmassa sayanavatthālaṅkārādianuppadānena bahupakāro. Taṃ aticaranto mātugāmo nirayādīsu nibbattati. Tasmā sopi purimanayeneva anuḍahanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gahapataggī"
      },
      "ti vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dakkhiṇeyyaggī"
      },
      "ti ettha pana dakkhiṇāti cattāro paccayā, bhikkhusaṅgho dakkhiṇeyyo. So hi gihīnaṃ tīsu saraṇesu pañcasu sīlesu dasasu sīlesu mātāpitupaṭṭhāne dhammikasamaṇabrāhmaṇupaṭṭhāneti evamādīsu kalyāṇadhammesu niyojanena bahupakāro. Tasmiṃ micchāpaṭipannā gihī ",
      " bhikkhusaṅghaṃ akkositvā paribhāsitvā nirayādīsu nibbattanti. Tasmā sopi purimanayeneva anuḍahanaṭṭhena dakkhiṇeyyaggīti vutto. Kaṭṭhato nibbatto pākatikova aggi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kaṭṭhaggi"
      },
      " nāma."
    ],
    "innerText": "46. Tatiye sabbepi rāgādayo anuḍahanaṭṭhena aggī. Āhuneyyaggītiādīsu panettha āhunaṃ vuccati sakkāro, āhunaṃ arahantīti āhuneyyā. Mātāpitaro hi puttānaṃ bahupakārattā āhunaṃ arahanti, tesu vippaṭipajjamānā puttā nirayādīsu nibbattanti. Tasmā kiñcāpi mātāpitaro na anuḍahanti, anuḍahanassa pana paccayā honti. Iti anuḍahanaṭṭheneva āhuneyyaggīti vuccanti. Gahapatīti pana gehasāmiko vuccati, so mātugāmassa sayanavatthālaṅkārādianuppadānena bahupakāro. Taṃ aticaranto mātugāmo nirayādīsu nibbattati. Tasmā sopi purimanayeneva anuḍahanaṭṭhena gahapataggīti vutto. Dakkhiṇeyyaggīti ettha pana dakkhiṇāti cattāro paccayā, bhikkhusaṅgho dakkhiṇeyyo. So hi gihīnaṃ tīsu saraṇesu pañcasu sīlesu dasasu sīlesu mātāpitupaṭṭhāne dhammikasamaṇabrāhmaṇupaṭṭhāneti evamādīsu kalyāṇadhammesu niyojanena bahupakāro. Tasmiṃ micchāpaṭipannā gihī bhikkhusaṅghaṃ akkositvā paribhāsitvā nirayādīsu nibbattanti. Tasmā sopi purimanayeneva anuḍahanaṭṭhena dakkhiṇeyyaggīti vutto. Kaṭṭhato nibbatto pākatikova aggi kaṭṭhaggi nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Dutiyaaggisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "47"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uggatasarīrassā"
      },
      "ti so kira brāhmaṇamahāsālo attabhāvenapi bhogehipi uggato sārappatto ahosi, tasmā uggatasarīrotveva paññāyittha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upakkhaṭo"
      },
      "ti paccupaṭṭhito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thūṇūpanītānī"
      },
      "ti yūpasaṅkhātaṃ thūṇaṃ upanītāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaññatthāyā"
      },
      "ti vadhitvā yajanatthāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasaṅkamī"
      },
      "ti so ",
      " kira sabbaṃ taṃ yaññasambhāraṃ sajjetvā cintesi – ‘‘samaṇo kira gotamo mahāpañño, kiṃ nu kho me yaññassa vaṇṇaṃ kathessati udāhu avaṇṇaṃ, pucchitvā jānissāmī’’ti iminā kāraṇena yena bhagavā tenupasaṅkami. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aggissa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādāna"
      },
      "nti yaññayajanatthāya navassa maṅgalaggino ādiyanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbena sabba"
      },
      "nti sabbena sutena sabbaṃ sutaṃ sameti saṃsandati, ekasadisaṃ hotīti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satthānī"
      },
      "ti vihiṃsanaṭṭhena satthāni viyāti satthāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sayaṃ paṭhamaṃ samārambhatī"
      },
      "ti attanāva paṭhamataraṃ ārabhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hantu"
      },
      "nti hanituṃ."
    ],
    "innerText": "47. Catutthe uggatasarīrassāti so kira brāhmaṇamahāsālo attabhāvenapi bhogehipi uggato sārappatto ahosi, tasmā uggatasarīrotveva paññāyittha. Upakkhaṭoti paccupaṭṭhito. Thūṇūpanītānīti yūpasaṅkhātaṃ thūṇaṃ upanītāni. Yaññatthāyāti vadhitvā yajanatthāya. Upasaṅkamīti so kira sabbaṃ taṃ yaññasambhāraṃ sajjetvā cintesi – ‘‘samaṇo kira gotamo mahāpañño, kiṃ nu kho me yaññassa vaṇṇaṃ kathessati udāhu avaṇṇaṃ, pucchitvā jānissāmī’’ti iminā kāraṇena yena bhagavā tenupasaṅkami. Aggissaādānanti yaññayajanatthāya navassa maṅgalaggino ādiyanaṃ. Sabbena sabbanti sabbena sutena sabbaṃ sutaṃ sameti saṃsandati, ekasadisaṃ hotīti dasseti. Satthānīti vihiṃsanaṭṭhena satthāni viyāti satthāni. Sayaṃ paṭhamaṃ samārambhatīti attanāva paṭhamataraṃ ārabhati. Hantunti hanituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pahātabbā"
      },
      "ti pariharitabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atohaya"
      },
      "nti ato hi mātāpitito ayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āhuto"
      },
      "ti āgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sambhūto"
      },
      "ti uppanno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ vuccati, brāhmaṇa, gahapataggī"
      },
      "ti ayaṃ puttadārādigaṇo yasmā, gahapati, viya gehasāmiko viya hutvā aggati vicarati, tasmā gahapataggīti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attāna"
      },
      "nti cittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Damentī"
      },
      "ti indriyadamanena damenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samentī"
      },
      "ti rāgādisamanena samenti. Tesaññeva parinibbāpanena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parinibbāpenti. Nikkhipitabbo"
      },
      "ti yathā na vinassati, evaṃ ṭhapetabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upavāyata"
      },
      "nti upavāyatu. Evañca pana vatvā brāhmaṇo sabbesampi tesaṃ pāṇānaṃ jīvitaṃ datvā yaññasālaṃ viddhaṃsetvā satthu sāsane opānabhūto ahosīti."
    ],
    "innerText": "Pahātabbāti pariharitabbā. Atohayanti ato hi mātāpitito ayaṃ. Āhutoti āgato. Sambhūtoti uppanno. Ayaṃ vuccati, brāhmaṇa, gahapataggīti ayaṃ puttadārādigaṇo yasmā, gahapati, viya gehasāmiko viya hutvā aggati vicarati, tasmā gahapataggīti vuccati. Attānanti cittaṃ. Damentīti indriyadamanena damenti. Samentīti rāgādisamanena samenti. Tesaññeva parinibbāpanena parinibbāpenti. Nikkhipitabboti yathā na vinassati, evaṃ ṭhapetabbo. Upavāyatanti upavāyatu. Evañca pana vatvā brāhmaṇo sabbesampi tesaṃ pāṇānaṃ jīvitaṃ datvā yaññasālaṃ viddhaṃsetvā satthu sāsane opānabhūto ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5-6. Saññāsuttadvayavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "48-49"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "amatogadhā"
      },
      "ti nibbānapatiṭṭhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amatapariyosānā"
      },
      "ti nibbānāvasānā. Chaṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "methunadhammasamāpattiyā"
      },
      "ti methunadhammena samaṅgibhāvato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nhārudaddula"
      },
      "nti nhārukhaṇḍaṃ nhāruvilekhanaṃ vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anusandatī"
      },
      "ti ",
      " pavattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Natthi me pubbenāparaṃ viseso"
      },
      "ti natthi mayhaṃ pubbena abhāvitakālena saddhiṃ aparaṃ bhāvitakāle viseso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokacitresū"
      },
      "ti tidhātukalokasannivāsasaṅkhātesu lokacitresu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ālasye"
      },
      "ti ālasiyabhāve. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissaṭṭhiye"
      },
      "ti vissaṭṭhabhāve. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ananuyoge"
      },
      "ti yogassa ananuyuñjane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahaṅkāramamaṅkāramānāpagata"
      },
      "nti ahaṅkāradiṭṭhito ca mamaṅkārataṇhāto ca navavidhamānato ca apagataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vidhāsamatikkanta"
      },
      "nti tisso vidhā atikkantaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santa"
      },
      "nti tappaccanīkakilesehi santaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvimutta"
      },
      "nti pañcahi vimuttīhi suṭṭhu vimuttaṃ."
    ],
    "innerText": "48-49. Pañcame amatogadhāti nibbānapatiṭṭhā. Amatapariyosānāti nibbānāvasānā. Chaṭṭhe methunadhammasamāpattiyāti methunadhammena samaṅgibhāvato. Nhārudaddulanti nhārukhaṇḍaṃ nhāruvilekhanaṃ vā. Anusandatīti pavattati. Natthi me pubbenāparaṃ visesoti natthi mayhaṃ pubbena abhāvitakālena saddhiṃ aparaṃ bhāvitakāle viseso. Lokacitresūti tidhātukalokasannivāsasaṅkhātesu lokacitresu. Ālasyeti ālasiyabhāve. Vissaṭṭhiyeti vissaṭṭhabhāve. Ananuyogeti yogassa ananuyuñjane. Ahaṅkāramamaṅkāramānāpagatanti ahaṅkāradiṭṭhito ca mamaṅkārataṇhāto ca navavidhamānato ca apagataṃ. Vidhāsamatikkantanti tisso vidhā atikkantaṃ. Santanti tappaccanīkakilesehi santaṃ. Suvimuttanti pañcahi vimuttīhi suṭṭhu vimuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Methunasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50"
      },
      ". Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upasaṅkamī"
      },
      "ti bhuttapātarāso dāsakammakaraparivuto upasaṅkami. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavampino"
      },
      "ti bhavampi nu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brahmacārī paṭijānātī"
      },
      "ti ‘‘ahaṃ brahmacārī’’ti evaṃ brahmacariyavāsaṃ paṭijānātīti pucchati. Evaṃ kirassa ahosi – ‘‘brāhmaṇasamaye vedaṃ uggaṇhantā aṭṭhacattālīsa vassāni brahmacariyaṃ caranti. Samaṇo pana gotamo agāraṃ ajjhāvasanto tīsu pāsādesu tividhanāṭakaratiyā abhirami, idāni kiṃ nu kho vakkhatī’’ti imamatthaṃ sandhāyevaṃ pucchati. Tato bhagavā mantena kaṇhasappaṃ gaṇhanto viya amittaṃ gīvāya pādena akkamanto viya attano saṃkilesakāle chabbassāni padhānacariyāya rajjasukhaṃ vā pāsādesu nāṭakasampattiṃ vā ārabbha vitakkamattassāpi anuppannabhāvaṃ sandhāya sīhanādaṃ nadanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yañhi taṃ brāhmaṇā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvayaṃdvayasamāpatti"
      },
      "nti dvīhi dvīhi samāpajjitabbabhāvaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhasmā"
      },
      "ti sakalavaṭṭadukkhato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sañjagghatī"
      },
      "ti hasitakathaṃ katheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃkīḷatī"
      },
      "ti keḷiṃ karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃkeḷāyatī"
      },
      "ti mahāhasitaṃ hasati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhunā cakkhu"
      },
      "nti attano cakkhunā tassā cakkhuṃ paṭivijjhitvā upanijjhāyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tirokuṭṭaṃ vā tiropākāraṃ vā"
      },
      "ti parakuṭṭe vā parapākāre ",
      " vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devo"
      },
      "ti eko devarājā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devaññataro"
      },
      "ti aññataro devaputto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuttaraṃ sammāsambodhi"
      },
      "nti arahattañceva sabbaññutaññāṇañca."
    ],
    "innerText": "50. Sattame upasaṅkamīti bhuttapātarāso dāsakammakaraparivuto upasaṅkami. Bhavampinoti bhavampi nu. Brahmacārī paṭijānātīti ‘‘ahaṃ brahmacārī’’ti evaṃ brahmacariyavāsaṃ paṭijānātīti pucchati. Evaṃ kirassa ahosi – ‘‘brāhmaṇasamaye vedaṃ uggaṇhantā aṭṭhacattālīsa vassāni brahmacariyaṃ caranti. Samaṇo pana gotamo agāraṃ ajjhāvasanto tīsu pāsādesu tividhanāṭakaratiyā abhirami, idāni kiṃ nu kho vakkhatī’’ti imamatthaṃ sandhāyevaṃ pucchati. Tato bhagavā mantena kaṇhasappaṃ gaṇhanto viya amittaṃ gīvāya pādena akkamanto viya attano saṃkilesakāle chabbassāni padhānacariyāya rajjasukhaṃ vā pāsādesu nāṭakasampattiṃ vā ārabbha vitakkamattassāpi anuppannabhāvaṃ sandhāya sīhanādaṃ nadanto yañhi taṃ brāhmaṇātiādimāha. Tattha dvayaṃdvayasamāpattinti dvīhi dvīhi samāpajjitabbabhāvaṃ. Dukkhasmāti sakalavaṭṭadukkhato. Sañjagghatīti hasitakathaṃ katheti. Saṃkīḷatīti keḷiṃ karoti. Saṃkeḷāyatīti mahāhasitaṃ hasati. Cakkhunā cakkhunti attano cakkhunā tassā cakkhuṃ paṭivijjhitvā upanijjhāyati. Tirokuṭṭaṃ vā tiropākāraṃ vāti parakuṭṭe vā parapākāre vā. Devoti eko devarājā. Devaññataroti aññataro devaputto. Anuttaraṃ sammāsambodhinti arahattañceva sabbaññutaññāṇañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Saṃyogasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "51"
      },
      ". Aṭṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃyogavisaṃyoga"
      },
      "nti saṃyogavisaṃyogasādhakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammapariyāya"
      },
      "nti dhammakāraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhattaṃ itthindriya"
      },
      "nti niyakajjhatte itthibhāvaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itthikutta"
      },
      "nti itthikiriyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itthākappa"
      },
      "nti nivāsanapārupanādiitthiākappaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itthividha"
      },
      "nti itthiyā mānavidhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itthichanda"
      },
      "nti itthiyā ajjhāsayacchandaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itthissara"
      },
      "nti itthisaddaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itthālaṅkāra"
      },
      "nti itthiyā pasādhanabhaṇḍaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purisindriyā"
      },
      "dīsupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahiddhā saṃyoga"
      },
      "nti purisena saddhiṃ samāgamaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ativattatī"
      },
      "ti anabhiratāti evaṃ vuttāya balavavipassanāya ariyamaggaṃ patvā ativattati. Imasmiṃ ",
      " sutte vaṭṭavivaṭṭaṃ kathitaṃ."
    ],
    "innerText": "51. Aṭṭhame saṃyogavisaṃyoganti saṃyogavisaṃyogasādhakaṃ. Dhammapariyāyanti dhammakāraṇaṃ. Ajjhattaṃ itthindriyanti niyakajjhatte itthibhāvaṃ. Itthikuttanti itthikiriyaṃ. Itthākappanti nivāsanapārupanādiitthiākappaṃ. Itthividhanti itthiyā mānavidhaṃ. Itthichandanti itthiyā ajjhāsayacchandaṃ. Itthissaranti itthisaddaṃ. Itthālaṅkāranti itthiyā pasādhanabhaṇḍaṃ. Purisindriyādīsupi eseva nayo. Bahiddhā saṃyoganti purisena saddhiṃ samāgamaṃ. Ativattatīti anabhiratāti evaṃ vuttāya balavavipassanāya ariyamaggaṃ patvā ativattati. Imasmiṃ sutte vaṭṭavivaṭṭaṃ kathitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Dānamahapphalasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "52"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāpekho"
      },
      "ti sataṇho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭibaddhacitto"
      },
      "ti vipāke baddhacitto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sannidhipekho"
      },
      "ti nidhānapekho hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Peccā"
      },
      "ti paralokaṃ gantvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ kammaṃ khepetvā"
      },
      "ti taṃ kammavipākaṃ khepetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhi"
      },
      "nti vipākiddhiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yasa"
      },
      "nti parivārasampadaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādhipacca"
      },
      "nti jeṭṭhabhāvakāraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āgantā itthatta"
      },
      "nti itthabhāvaṃ ime pañcakkhandhe puna āgantā, na tatrūpapattiko na uparūpapattiko, heṭṭhāgāmīyeva hotīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāhu dāna"
      },
      "nti dānaṃ nāmetaṃ sādhu bhaddakaṃ sundaraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāni mahāyaññānī"
      },
      "ti tāni sappinavanītadadhimadhuphāṇitādīhi niṭṭhānaṃ gatāni mahādānāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittālaṅkāracittaparikkhāra"
      },
      "nti samathavipassanācittassa alaṅkārabhūtañceva parivārabhūtañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brahmakāyikānaṃ devānaṃ sahabyata"
      },
      "nti na sakkā tattha dānena upapajjituṃ. Yasmā pana taṃ samathavipassanācittassa alaṅkārabhūtaṃ, tasmā tena dānālaṅkatena cittena jhānañceva ariyamaggañca nibbattetvā jhānena tattha upapajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāgāmī hotī"
      },
      "ti jhānānāgāmī nāma hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāgantā itthatta"
      },
      "nti puna itthabhāvaṃ na āgantā, uparūpapattiko ",
      " vā tatrūpapattiko vā hutvā tattheva parinibbāyati. Iti imesu dānesu paṭhamaṃ taṇhuttariyadānaṃ, dutiyaṃ cittīkāradānaṃ, tatiyaṃ hirottappadānaṃ, catutthaṃ niravasesadānaṃ ",
      ", pañcamaṃ dakkhiṇeyyadānaṃ, chaṭṭhaṃ somanassupavicāradānaṃ, sattamaṃ alaṅkāraparivāradānaṃ nāmāti."
    ],
    "innerText": "52. Navame sāpekhoti sataṇho. Paṭibaddhacittoti vipāke baddhacitto. Sannidhipekhoti nidhānapekho hutvā. Peccāti paralokaṃ gantvā. Taṃ kammaṃ khepetvāti taṃ kammavipākaṃ khepetvā. Iddhinti vipākiddhiṃ. Yasanti parivārasampadaṃ. Ādhipaccanti jeṭṭhabhāvakāraṇaṃ. Āgantā itthattanti itthabhāvaṃ ime pañcakkhandhe puna āgantā, na tatrūpapattiko na uparūpapattiko, heṭṭhāgāmīyeva hotīti attho. Sāhu dānanti dānaṃ nāmetaṃ sādhu bhaddakaṃ sundaraṃ. Tāni mahāyaññānīti tāni sappinavanītadadhimadhuphāṇitādīhi niṭṭhānaṃ gatāni mahādānāni. Cittālaṅkāracittaparikkhāranti samathavipassanācittassa alaṅkārabhūtañceva parivārabhūtañca. Brahmakāyikānaṃ devānaṃ sahabyatanti na sakkā tattha dānena upapajjituṃ. Yasmā pana taṃ samathavipassanācittassa alaṅkārabhūtaṃ, tasmā tena dānālaṅkatena cittena jhānañceva ariyamaggañca nibbattetvā jhānena tattha upapajjati. Anāgāmī hotīti jhānānāgāmī nāma hoti. Anāgantā itthattanti puna itthabhāvaṃ na āgantā, uparūpapattiko vā tatrūpapattiko vā hutvā tattheva parinibbāyati. Iti imesu dānesu paṭhamaṃ taṇhuttariyadānaṃ, dutiyaṃ cittīkāradānaṃ, tatiyaṃ hirottappadānaṃ, catutthaṃ niravasesadānaṃ , pañcamaṃ dakkhiṇeyyadānaṃ, chaṭṭhaṃ somanassupavicāradānaṃ, sattamaṃ alaṅkāraparivāradānaṃ nāmāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Nandamātāsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "53"
      },
      ". Dasamaṃ atthuppattivasena desitaṃ. Satthā kira vutthavasso pavāretvā dve aggasāvake ohāya ‘‘dakkhiṇāgiriṃ cārikaṃ gamissāmī’’ti nikkhami, rājā pasenadi kosalo, anāthapiṇḍiko gahapati, visākhā mahāupāsikā, aññe ca bahujanā dasabalaṃ nivattetuṃ nāsakkhiṃsu. Anāthapiṇḍiko gahapati ‘‘satthāraṃ nivattetuṃ nāsakkhi’’nti raho cintayamāno nisīdi. Atha naṃ puṇṇā nāma dāsī disvā ‘‘kiṃ nu kho te, sāmi, na pubbe viya indriyāni vippasannānī’’ti pucchi. Āma, puṇṇe, satthā cārikaṃ pakkanto, tamahaṃ nivattetuṃ nāsakkhiṃ. Na kho pana sakkā jānituṃ puna sīghaṃ āgaccheyya vā na vā, tenāhaṃ cintayamāno nisinnoti. Sacāhaṃ dasabalaṃ nivatteyyaṃ, kiṃ me kareyyāsīti? Bhujissaṃ taṃ karissāmīti. Sā gantvā satthāraṃ vanditvā ‘‘nivattatha, bhante’’ti āha. Mama nivattanapaccayā ",
      " tvaṃ kiṃ karissasīti? Tumhe, bhante, mama parādhīnabhāvaṃ jānātha, aññaṃ kiñci kātuṃ na sakkomi, saraṇesu pana patiṭṭhāya pañca sīlāni rakkhissāmīti. Sādhu sādhu puṇṇeti, satthā dhammagāravena ekapadasmiññeva nivatti. Vuttañhetaṃ – ‘‘dhammagaru, bhikkhave, tathāgato dhammagāravo’’ti (a. ni. 5.99)."
    ],
    "innerText": "53. Dasamaṃ atthuppattivasena desitaṃ. Satthā kira vutthavasso pavāretvā dve aggasāvake ohāya ‘‘dakkhiṇāgiriṃ cārikaṃ gamissāmī’’ti nikkhami, rājā pasenadi kosalo, anāthapiṇḍiko gahapati, visākhā mahāupāsikā, aññe ca bahujanā dasabalaṃ nivattetuṃ nāsakkhiṃsu. Anāthapiṇḍiko gahapati ‘‘satthāraṃ nivattetuṃ nāsakkhi’’nti raho cintayamāno nisīdi. Atha naṃ puṇṇā nāma dāsī disvā ‘‘kiṃ nu kho te, sāmi, na pubbe viya indriyāni vippasannānī’’ti pucchi. Āma, puṇṇe, satthā cārikaṃ pakkanto, tamahaṃ nivattetuṃ nāsakkhiṃ. Na kho pana sakkā jānituṃ puna sīghaṃ āgaccheyya vā na vā, tenāhaṃ cintayamāno nisinnoti. Sacāhaṃ dasabalaṃ nivatteyyaṃ, kiṃ me kareyyāsīti? Bhujissaṃ taṃ karissāmīti. Sā gantvā satthāraṃ vanditvā ‘‘nivattatha, bhante’’ti āha. Mama nivattanapaccayā tvaṃ kiṃ karissasīti? Tumhe, bhante, mama parādhīnabhāvaṃ jānātha, aññaṃ kiñci kātuṃ na sakkomi, saraṇesu pana patiṭṭhāya pañca sīlāni rakkhissāmīti. Sādhu sādhu puṇṇeti, satthā dhammagāravena ekapadasmiññeva nivatti. Vuttañhetaṃ – ‘‘dhammagaru, bhikkhave, tathāgato dhammagāravo’’ti (a. ni. 5.99)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Satthā nivattitvā jetavanamahāvihāraṃ pāvisi. Mahājano puṇṇāya sādhukārasahassāni adāsi. Satthā tasmiṃ samāgame dhammaṃ desesi, caturāsītipāṇasahassāni ",
      " amatapānaṃ piviṃsu. Puṇṇāpi seṭṭhinā anuññātā bhikkhuniupassayaṃ gantvā pabbaji. Sammāsambuddho sāriputtamoggallāne āmantetvā ‘‘ahaṃ yaṃ disaṃ cārikāya nikkhanto, tattha na gacchāmi. Tumhe tumhākaṃ parisāya saddhiṃ taṃ disaṃ cārikaṃ gacchathā’’ti vatvā uyyojesi. Imissaṃ atthuppattiyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekaṃ samayaṃ āyasmā sāriputto"
      },
      "tiādi vuttaṃ."
    ],
    "innerText": "Satthā nivattitvā jetavanamahāvihāraṃ pāvisi. Mahājano puṇṇāya sādhukārasahassāni adāsi. Satthā tasmiṃ samāgame dhammaṃ desesi, caturāsītipāṇasahassāni amatapānaṃ piviṃsu. Puṇṇāpi seṭṭhinā anuññātā bhikkhuniupassayaṃ gantvā pabbaji. Sammāsambuddho sāriputtamoggallāne āmantetvā ‘‘ahaṃ yaṃ disaṃ cārikāya nikkhanto, tattha na gacchāmi. Tumhe tumhākaṃ parisāya saddhiṃ taṃ disaṃ cārikaṃ gacchathā’’ti vatvā uyyojesi. Imissaṃ atthuppattiyaṃ ekaṃ samayaṃ āyasmā sāriputtotiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "veḷukaṇḍakī"
      },
      "ti veḷukaṇṭakanagaravāsinī. Tassa kira nagarassa pākāraguttatthāya pākārapariyantena veḷū ropitā, tenassa veḷukaṇṭakanteva ",
      " nāmaṃ jātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pārāyana"
      },
      "nti nibbānasaṅkhātapāraṃ ayanato pārāyananti laddhavohāraṃ dhammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sarena bhāsatī"
      },
      "ti sattabhūmikassa pāsādassa uparimatale susaṃvihitārakkhaṭṭhāne nisinnā samāpattibalena rattibhāgaṃ vītināmetvā samāpattito vuṭṭhāya ‘‘imaṃ rattāvasesaṃ katarāya ratiyā vītināmessāmī’’ti cintetvā ‘‘dhammaratiyā’’ti katasanniṭṭhānā tīṇi phalāni pattā ariyasāvikā aḍḍhateyyagāthāsataparimāṇaṃ pārāyanasuttaṃ madhurena sarabhaññena bhāsati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assosi kho"
      },
      "ti ākāsaṭṭhakavimānāni pariharitvā tassa pāsādassa uparibhāgaṃ gatena maggena naravāhanayānaṃ āruyha gacchamāno assosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathāpariyosānaṃ āgamayamāno aṭṭhāsī"
      },
      "ti ‘‘kiṃ saddo esa bhaṇe’’ti pucchitvā ‘‘nandamātāya upāsikāya sarabhaññasaddo’’ti vutte otaritvā ‘‘idamavocā’’ti idaṃ desanāpariyosānaṃ olokento avidūraṭṭhāne ākāse aṭṭhāsi."
    ],
    "innerText": "Tattha veḷukaṇḍakīti veḷukaṇṭakanagaravāsinī. Tassa kira nagarassa pākāraguttatthāya pākārapariyantena veḷū ropitā, tenassa veḷukaṇṭakanteva nāmaṃ jātaṃ. Pārāyananti nibbānasaṅkhātapāraṃ ayanato pārāyananti laddhavohāraṃ dhammaṃ. Sarena bhāsatīti sattabhūmikassa pāsādassa uparimatale susaṃvihitārakkhaṭṭhāne nisinnā samāpattibalena rattibhāgaṃ vītināmetvā samāpattito vuṭṭhāya ‘‘imaṃ rattāvasesaṃ katarāya ratiyā vītināmessāmī’’ti cintetvā ‘‘dhammaratiyā’’ti katasanniṭṭhānā tīṇi phalāni pattā ariyasāvikā aḍḍhateyyagāthāsataparimāṇaṃ pārāyanasuttaṃ madhurena sarabhaññena bhāsati. Assosi khoti ākāsaṭṭhakavimānāni pariharitvā tassa pāsādassa uparibhāgaṃ gatena maggena naravāhanayānaṃ āruyha gacchamāno assosi. Kathāpariyosānaṃ āgamayamāno aṭṭhāsīti ‘‘kiṃ saddo esa bhaṇe’’ti pucchitvā ‘‘nandamātāya upāsikāya sarabhaññasaddo’’ti vutte otaritvā ‘‘idamavocā’’ti idaṃ desanāpariyosānaṃ olokento avidūraṭṭhāne ākāse aṭṭhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhu bhagini, sādhu bhaginī"
      },
      "ti ‘‘suggahitā te bhagini dhammadesanā ",
      " sukathitā, pāsāṇakacetiye nisīditvā soḷasannaṃ pārāyanikabrāhmaṇānaṃ sammāsambuddhena kathitadivase ca ajja ca na kiñci antaraṃ passāmi, majjhe bhinnasuvaṇṇaṃ viya te satthu kathitena saddhiṃ sadisameva kathita’’nti vatvā sādhukāraṃ dadanto evamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ko paneso bhadramukhā"
      },
      "ti imasmiṃ susaṃvihitārakkhaṭṭhāne ",
      " evaṃ mahantena saddena ko nāmesa, bhadramukha, laddhamukha, kiṃ nāgo supaṇṇo devo māro brahmāti suvaṇṇapaṭṭavaṇṇaṃ vātapānaṃ vivaritvā vigatasārajjā tīṇi phalāni pattā ariyasāvikā vessavaṇena saddhiṃ kathayamānā evamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahaṃ te bhagini bhātā"
      },
      "ti sayaṃ sotāpannattā anāgāmiariyasāvikaṃ jeṭṭhikaṃ maññamāno ‘‘bhaginī’’ti vatvā puna taṃ paṭhamavaye ṭhitattā attano kaniṭṭhaṃ, attānaṃ pana navutivassasatasahassāyukattā mahallakataraṃ maññamāno ‘‘bhātā’’ti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhu bhadramukhā"
      },
      "ti, bhadramukha, sādhu sundaraṃ, svāgamanaṃ te āgamanaṃ, āgantuṃ yuttaṭṭhānamevasi āgatoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idaṃ te hotu ātitheyya"
      },
      "nti idameva dhammabhaṇanaṃ tava atithipaṇṇākāro hotu, na hi te aññaṃ ito uttaritaraṃ dātabbaṃ passāmīti adhippāyo ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evañceva me bhavissati ātitheyya"
      },
      "nti evaṃ attano pattidānaṃ yācitvā ‘‘ayaṃ te dhammakathikasakkāro’’ti aḍḍhateḷasāni koṭṭhasatāni rattasālīnaṃ pūretvā ‘‘yāvāyaṃ upāsikā carati, tāva mā khayaṃ gamiṃsū’’ti adhiṭṭhahitvā pakkāmi. Yāva upāsikā aṭṭhāsi, tāva koṭṭhānaṃ heṭṭhimatalaṃ ",
      " nāma daṭṭhuṃ nāsakkhiṃsu. Tato paṭṭhāya ‘‘nandamātāya koṭṭhāgāraṃ viyā’’ti vohāro udapādi."
    ],
    "innerText": "Sādhu bhagini, sādhu bhaginīti ‘‘suggahitā te bhagini dhammadesanā sukathitā, pāsāṇakacetiye nisīditvā soḷasannaṃ pārāyanikabrāhmaṇānaṃ sammāsambuddhena kathitadivase ca ajja ca na kiñci antaraṃ passāmi, majjhe bhinnasuvaṇṇaṃ viya te satthu kathitena saddhiṃ sadisameva kathita’’nti vatvā sādhukāraṃ dadanto evamāha. Ko paneso bhadramukhāti imasmiṃ susaṃvihitārakkhaṭṭhāne evaṃ mahantena saddena ko nāmesa, bhadramukha, laddhamukha, kiṃ nāgo supaṇṇo devo māro brahmāti suvaṇṇapaṭṭavaṇṇaṃ vātapānaṃ vivaritvā vigatasārajjā tīṇi phalāni pattā ariyasāvikā vessavaṇena saddhiṃ kathayamānā evamāha. Ahaṃ te bhagini bhātāti sayaṃ sotāpannattā anāgāmiariyasāvikaṃ jeṭṭhikaṃ maññamāno ‘‘bhaginī’’ti vatvā puna taṃ paṭhamavaye ṭhitattā attano kaniṭṭhaṃ, attānaṃ pana navutivassasatasahassāyukattā mahallakataraṃ maññamāno ‘‘bhātā’’ti āha. Sādhu bhadramukhāti, bhadramukha, sādhu sundaraṃ, svāgamanaṃ te āgamanaṃ, āgantuṃ yuttaṭṭhānamevasi āgatoti attho. Idaṃ te hotu ātitheyyanti idameva dhammabhaṇanaṃ tava atithipaṇṇākāro hotu, na hi te aññaṃ ito uttaritaraṃ dātabbaṃ passāmīti adhippāyo . Evañceva me bhavissati ātitheyyanti evaṃ attano pattidānaṃ yācitvā ‘‘ayaṃ te dhammakathikasakkāro’’ti aḍḍhateḷasāni koṭṭhasatāni rattasālīnaṃ pūretvā ‘‘yāvāyaṃ upāsikā carati, tāva mā khayaṃ gamiṃsū’’ti adhiṭṭhahitvā pakkāmi. Yāva upāsikā aṭṭhāsi, tāva koṭṭhānaṃ heṭṭhimatalaṃ nāma daṭṭhuṃ nāsakkhiṃsu. Tato paṭṭhāya ‘‘nandamātāya koṭṭhāgāraṃ viyā’’ti vohāro udapādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akatapātarāso"
      },
      "ti abhuttapātarāso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puñña"
      },
      "nti pubbacetanā ca muñcanacetanā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puññamahī"
      },
      "ti aparacetanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhāya hotū"
      },
      "ti sukhatthāya hitatthāya hotu. Evaṃ attano dāne vessavaṇassa pattiṃ adāsi."
    ],
    "innerText": "Akatapātarāsoti abhuttapātarāso. Puññanti pubbacetanā ca muñcanacetanā ca. Puññamahīti aparacetanā. Sukhāya hotūti sukhatthāya hitatthāya hotu. Evaṃ attano dāne vessavaṇassa pattiṃ adāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakaraṇe"
      },
      "ti kāraṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Okkassa pasayhā"
      },
      "ti ākaḍḍhitvā abhibhavitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yakkhayoni"
      },
      "nti bhummadevatābhāvaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Teneva purimena attabhāvena uddassetī"
      },
      "ti purimasarīrasadisameva sarīraṃ māpetvā alaṅkatapaṭiyatto sirigabbhasayanatale attānaṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upāsikā paṭidesitā"
      },
      "ti upāsikā ahanti evaṃ upāsikābhāvaṃ desesiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāvade"
      },
      "ti yāvadeva. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "Pakaraṇeti kāraṇe. Okkassa pasayhāti ākaḍḍhitvā abhibhavitvā. Yakkhayoninti bhummadevatābhāvaṃ. Teneva purimena attabhāvena uddassetīti purimasarīrasadisameva sarīraṃ māpetvā alaṅkatapaṭiyatto sirigabbhasayanatale attānaṃ dasseti. Upāsikā paṭidesitāti upāsikā ahanti evaṃ upāsikābhāvaṃ desesiṃ. Yāvadeti yāvadeva. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahāyaññavaggo pañcamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṇṇāsakaṃ niṭṭhitaṃ."
  }
]