[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "5. Uposathavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Saṅkhittūposathasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "41. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aṭṭhaṅgasamannāgato, bhikkhave, uposatho upavuttho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. Kathaṃ upavuttho ca, bhikkhave, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro? Idha ",
      ", bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yāvajīvaṃ arahanto pāṇātipātaṃ pahāya pāṇātipātā paṭiviratā nihitadaṇḍā nihitasatthā lajjī dayāpannā, sabbapāṇabhūtahitānukampino viharanti. Ahaṃ pajja imañca rattiṃ imañca divasaṃ pāṇātipātaṃ pahāya pāṇātipātā paṭivirato nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī ",
      " viharāmi. Imināpaṅgena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[imināpi aṅgena (sī. pī.) a. ni. 3.71]"
      },
      " arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā paṭhamena aṅgena samannāgato hoti."
    ],
    "innerText": "‘‘Aṭṭhaṅgasamannāgato, bhikkhave, uposatho upavuttho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. Kathaṃ upavuttho ca, bhikkhave, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro? Idha , bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yāvajīvaṃ arahanto pāṇātipātaṃ pahāya pāṇātipātā paṭiviratā nihitadaṇḍā nihitasatthā lajjī dayāpannā, sabbapāṇabhūtahitānukampino viharanti. Ahaṃ pajja imañca rattiṃ imañca divasaṃ pāṇātipātaṃ pahāya pāṇātipātā paṭivirato nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharāmi. Imināpaṅgena [imināpi aṅgena (sī. pī.) a. ni. 3.71] arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā paṭhamena aṅgena samannāgato hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Yāvajīvaṃ arahanto adinnādānaṃ pahāya adinnādānā paṭiviratā dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharanti. Ahaṃ pajja imañca rattiṃ imañca divasaṃ adinnādānaṃ pahāya adinnādānā paṭivirato dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharāmi. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā dutiyena aṅgena samannāgato hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Yāvajīvaṃ arahanto abrahmacariyaṃ pahāya brahmacārino ārācārino viratā methunā gāmadhammā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ abrahmacariyaṃ pahāya brahmacārī ārācārī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anācārī (ka.)]"
      },
      " virato ",
      " methunā gāmadhammā. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā tatiyena aṅgena samannāgato hoti."
    ],
    "innerText": "‘‘‘Yāvajīvaṃ arahanto abrahmacariyaṃ pahāya brahmacārino ārācārino viratā methunā gāmadhammā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ abrahmacariyaṃ pahāya brahmacārī ārācārī [anācārī (ka.)] virato methunā gāmadhammā. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā tatiyena aṅgena samannāgato hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Yāvajīvaṃ ",
      " arahanto musāvādaṃ pahāya musāvādā paṭiviratā saccavādino saccasandhā thetā paccayikā avisaṃvādako lokassa. Ahaṃ pajja imañca rattiṃ imañca divasaṃ musāvādaṃ pahāya musāvādā paṭivirato saccavādī ",
      " saccasandho theto paccayiko avisaṃvādako lokassa. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā catutthena aṅgena samannāgato hoti."
    ],
    "innerText": "‘‘‘Yāvajīvaṃ arahanto musāvādaṃ pahāya musāvādā paṭiviratā saccavādino saccasandhā thetā paccayikā avisaṃvādako lokassa. Ahaṃ pajja imañca rattiṃ imañca divasaṃ musāvādaṃ pahāya musāvādā paṭivirato saccavādī saccasandho theto paccayiko avisaṃvādako lokassa. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā catutthena aṅgena samannāgato hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Yāvajīvaṃ arahanto surāmerayamajjapamādaṭṭhānaṃ pahāya surāmerayamajjapamādaṭṭhānā paṭiviratā. Ahaṃ ",
      " pajja imañca rattiṃ imañca divasaṃ surāmerayamajjapamādaṭṭhānaṃ pahāya surāmerayamajjapamādaṭṭhānā paṭivirato. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā pañcamena aṅgena samannāgato hoti."
    ],
    "innerText": "‘‘‘Yāvajīvaṃ arahanto surāmerayamajjapamādaṭṭhānaṃ pahāya surāmerayamajjapamādaṭṭhānā paṭiviratā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ surāmerayamajjapamādaṭṭhānaṃ pahāya surāmerayamajjapamādaṭṭhānā paṭivirato. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā pañcamena aṅgena samannāgato hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Yāvajīvaṃ arahanto ekabhattikā rattūparatā viratā vikālabhojanā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ ekabhattiko rattūparato virato vikālabhojanā. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā chaṭṭhena aṅgena samannāgato hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Yāvajīvaṃ arahanto naccagītavāditavisūkadassanamālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānaṃ pahāya naccagītavāditavisūkadassanamālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭiviratā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ naccagītavāditavisūkadassanamālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānaṃ pahāya naccagītavāditavisūkadassanamālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā sattamena aṅgena samannāgato hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Yāvajīvaṃ arahanto uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭiviratā nīcaseyyaṃ kappenti – mañcake vā tiṇasanthārake vā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ ",
      " uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭivirato nīcaseyyaṃ kappemi – mañcake vā tiṇasanthārake vā. Imināpaṅgena arahataṃ anukaromi ",
      ", uposatho ca me upavuttho bhavissatī’ti. Iminā aṭṭhamena aṅgena samannāgato hoti ",
      ". Evaṃ upavuttho kho, bhikkhave, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro’’ti. Paṭhamaṃ."
    ],
    "innerText": "‘‘‘Yāvajīvaṃ arahanto uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭiviratā nīcaseyyaṃ kappenti – mañcake vā tiṇasanthārake vā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭivirato nīcaseyyaṃ kappemi – mañcake vā tiṇasanthārake vā. Imināpaṅgena arahataṃ anukaromi , uposatho ca me upavuttho bhavissatī’ti. Iminā aṭṭhamena aṅgena samannāgato hoti . Evaṃ upavuttho kho, bhikkhave, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Vitthatūposathasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42"
      },
      ". ‘‘Aṭṭhaṅgasamannāgato ",
      ", bhikkhave, uposatho upavuttho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. Kathaṃ upavuttho ca, bhikkhave, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro? Idha, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yāvajīvaṃ arahanto pāṇātipātaṃ pahāya pāṇātipātā paṭiviratā nihitadaṇḍā nihitasatthā lajjī dayāpannā, sabbapāṇabhūtahitānukampino viharanti. Ahaṃ pajja imañca rattiṃ imañca divasaṃ pāṇātipātaṃ pahāya pāṇātipātā paṭivirato nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharāmi. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā paṭhamena aṅgena samannāgato hoti…pe…."
    ],
    "innerText": "42. ‘‘Aṭṭhaṅgasamannāgato , bhikkhave, uposatho upavuttho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. Kathaṃ upavuttho ca, bhikkhave, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro? Idha, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yāvajīvaṃ arahanto pāṇātipātaṃ pahāya pāṇātipātā paṭiviratā nihitadaṇḍā nihitasatthā lajjī dayāpannā, sabbapāṇabhūtahitānukampino viharanti. Ahaṃ pajja imañca rattiṃ imañca divasaṃ pāṇātipātaṃ pahāya pāṇātipātā paṭivirato nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharāmi. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā paṭhamena aṅgena samannāgato hoti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Yāvajīvaṃ arahanto uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭiviratā nīcaseyyaṃ kappenti – mañcake vā tiṇasanthārake vā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭivirato nīcaseyyaṃ kappemi – mañcake vā tiṇasanthārake vā. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā aṭṭhamena aṅgena samannāgato hoti. Evaṃ upavuttho kho, bhikkhave, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro ",
      "."
    ],
    "innerText": "‘‘‘Yāvajīvaṃ arahanto uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭiviratā nīcaseyyaṃ kappenti – mañcake vā tiṇasanthārake vā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭivirato nīcaseyyaṃ kappemi – mañcake vā tiṇasanthārake vā. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā aṭṭhamena aṅgena samannāgato hoti. Evaṃ upavuttho kho, bhikkhave, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kīvamahapphalo hoti kīvamahānisaṃso kīvamahājutiko kīvamahāvipphāro? Seyyathāpi, bhikkhave, yo imesaṃ soḷasannaṃ mahājanapadānaṃ pahūtarattaratanānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pahūtasattaratanānaṃ (sī. syā. kaṃ. pī.) a. ni. 3.71 pāḷiyā ṭīkāyaṃ dassitapāḷiyeva. tadaṭṭhakathāpi passitabbā]"
      },
      " issariyādhipaccaṃ rajjaṃ kāreyya, seyyathidaṃ – aṅgānaṃ magadhānaṃ kāsīnaṃ kosalānaṃ vajjīnaṃ mallānaṃ cetīnaṃ vaṅgānaṃ kurūnaṃ pañcālānaṃ macchānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[majjānaṃ (ka.)]"
      },
      " sūrasenānaṃ assakānaṃ avantīnaṃ gandhārānaṃ kambojānaṃ, aṭṭhaṅgasamannāgatassa ",
      " uposathassa etaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ekaṃ (ka.)]"
      },
      " kalaṃ nāgghati soḷasiṃ. Taṃ kissa hetu? Kapaṇaṃ, bhikkhave, mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya."
    ],
    "innerText": "‘‘Kīvamahapphalo hoti kīvamahānisaṃso kīvamahājutiko kīvamahāvipphāro? Seyyathāpi, bhikkhave, yo imesaṃ soḷasannaṃ mahājanapadānaṃ pahūtarattaratanānaṃ [pahūtasattaratanānaṃ (sī. syā. kaṃ. pī.) a. ni. 3.71 pāḷiyā ṭīkāyaṃ dassitapāḷiyeva. tadaṭṭhakathāpi passitabbā] issariyādhipaccaṃ rajjaṃ kāreyya, seyyathidaṃ – aṅgānaṃ magadhānaṃ kāsīnaṃ kosalānaṃ vajjīnaṃ mallānaṃ cetīnaṃ vaṅgānaṃ kurūnaṃ pañcālānaṃ macchānaṃ [majjānaṃ (ka.)] sūrasenānaṃ assakānaṃ avantīnaṃ gandhārānaṃ kambojānaṃ, aṭṭhaṅgasamannāgatassa uposathassa etaṃ [ekaṃ (ka.)] kalaṃ nāgghati soḷasiṃ. Taṃ kissa hetu? Kapaṇaṃ, bhikkhave, mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yāni, bhikkhave, mānusakāni paññāsa vassāni, cātumahārājikānaṃ devānaṃ eso eko rattindivo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[rattidivo (ka.)]"
      },
      ". Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni pañca vassasatāni cātumahārājikānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bhikkhave, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’."
    ],
    "innerText": "‘‘Yāni, bhikkhave, mānusakāni paññāsa vassāni, cātumahārājikānaṃ devānaṃ eso eko rattindivo [rattidivo (ka.)]. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni pañca vassasatāni cātumahārājikānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bhikkhave, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yāni, bhikkhave, mānusakāni vassasatāni, tāvatiṃsānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbaṃ vassasahassaṃ tāvatiṃsānaṃ devānaṃ ",
      " āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā tāvatiṃsānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bhikkhave, sandhāya bhāsitaṃ – ‘kapaṇaṃ ",
      " mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’."
    ],
    "innerText": "‘‘Yāni, bhikkhave, mānusakāni vassasatāni, tāvatiṃsānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbaṃ vassasahassaṃ tāvatiṃsānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā tāvatiṃsānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bhikkhave, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yāni, bhikkhave, mānusakāni dve vassasatāni, yāmānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni dve vassasahassāni yāmānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā yāmānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bhikkhave, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yāni, bhikkhave, mānusakāni cattāri vassasatāni, tusitānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni cattāri vassasahassāni ",
      " tusitānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa ",
      " bhedā paraṃ maraṇā tusitānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bhikkhave, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’."
    ],
    "innerText": "‘‘Yāni, bhikkhave, mānusakāni cattāri vassasatāni, tusitānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni cattāri vassasahassāni tusitānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā tusitānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bhikkhave, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yāni, bhikkhave, mānusakāni aṭṭha vassasatāni, nimmānaratīnaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni aṭṭha vassasahassāni nimmānaratīnaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ ",
      " uposathaṃ upavasitvā ",
      " kāyassa bhedā paraṃ maraṇā nimmānaratīnaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bhikkhave, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’."
    ],
    "innerText": "‘‘Yāni, bhikkhave, mānusakāni aṭṭha vassasatāni, nimmānaratīnaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni aṭṭha vassasahassāni nimmānaratīnaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā nimmānaratīnaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bhikkhave, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yāni, bhikkhave, mānusakāni soḷasa vassasatāni, paranimmitavasavattīnaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni soḷasa vassasahassāni paranimmitavasavattīnaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā paranimmitavasavattīnaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bhikkhave, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāyā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Pāṇaṃ na haññe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[hāne (sī.), hena (ka.) a. ni. 3.71]"
      },
      " na cadinnamādiye,"
    ],
    "innerText": "‘‘Pāṇaṃ na haññe [hāne (sī.), hena (ka.) a. ni. 3.71] na cadinnamādiye,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Musā na bhāse na ca majjapo siyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Abrahmacariyā virameyya methunā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rattiṃ na bhuñjeyya vikālabhojanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Mālaṃ na dhāre na ca gandhamācare ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gandhamādhare (ka.)]"
      },
      ","
    ],
    "innerText": "‘‘Mālaṃ na dhāre na ca gandhamācare [gandhamādhare (ka.)],"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Mañce chamāyaṃ va sayetha santhate;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Etañhi aṭṭhaṅgikamāhuposathaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Buddhena dukkhantagunā pakāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Cando ",
      " ca suriyo ca ubho sudassanā,"
    ],
    "innerText": "‘‘Cando ca suriyo ca ubho sudassanā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "children": [
      "Obhāsayaṃ ",
      " anupariyanti yāvatā;"
    ],
    "innerText": "Obhāsayaṃ anupariyanti yāvatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tamonudā te pana antalikkhagā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nabhe pabhāsanti disāvirocanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Etasmiṃ ",
      " yaṃ vijjati antare dhanaṃ,"
    ],
    "innerText": "‘‘Etasmiṃ yaṃ vijjati antare dhanaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Muttā maṇi veḷuriyañca bhaddakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Siṅgīsuvaṇṇaṃ atha vāpi kañcanaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yaṃ jātarūpaṃ haṭakanti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Aṭṭhaṅgupetassa uposathassa,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Kalampi te nānubhavanti soḷasiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Candappabhā tāragaṇā ca sabbe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tasmā hi nārī ca naro ca sīlavā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Aṭṭhaṅgupetaṃ upavassuposathaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Puññāni katvāna sukhudrayāni,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aninditā saggamupenti ṭhāna’’nti. dutiyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Visākhāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "43"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[a. ni. 3.71]"
      },
      " Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Atha kho visākhā migāramātā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho visākhaṃ migāramātaraṃ bhagavā etadavoca – ‘‘aṭṭhaṅgasamannāgato kho, visākhe, uposatho upavuttho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. Kathaṃ upavuttho ca, visākhe, aṭṭhaṅgasamannāgato uposatho ",
      " mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro? Idha, visākhe, ariyasāvako iti paṭisañcikkhati – ‘yāvajīvaṃ arahanto pāṇātipātaṃ pahāya pāṇātipātā paṭiviratā nihitadaṇḍā ",
      " nihitasatthā lajjī dayāpannā, sabbapāṇabhūtahitānukampino viharanti. Ahaṃ pajja imañca rattiṃ imañca divasaṃ pāṇātipātaṃ pahāya pāṇātipātā paṭivirato nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharāmi. Imināpaṅgena arahataṃ anukaromi ",
      ", uposatho ",
      " ca me upavuttho bhavissatī’’’ti. Iminā paṭhamena aṅgena samannāgato hoti…pe…."
    ],
    "innerText": "43.[a. ni. 3.71] Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Atha kho visākhā migāramātā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho visākhaṃ migāramātaraṃ bhagavā etadavoca – ‘‘aṭṭhaṅgasamannāgato kho, visākhe, uposatho upavuttho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. Kathaṃ upavuttho ca, visākhe, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro? Idha, visākhe, ariyasāvako iti paṭisañcikkhati – ‘yāvajīvaṃ arahanto pāṇātipātaṃ pahāya pāṇātipātā paṭiviratā nihitadaṇḍā nihitasatthā lajjī dayāpannā, sabbapāṇabhūtahitānukampino viharanti. Ahaṃ pajja imañca rattiṃ imañca divasaṃ pāṇātipātaṃ pahāya pāṇātipātā paṭivirato nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharāmi. Imināpaṅgena arahataṃ anukaromi , uposatho ca me upavuttho bhavissatī’’’ti. Iminā paṭhamena aṅgena samannāgato hoti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Yāvajīvaṃ arahanto uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭiviratā nīcaseyyaṃ kappenti – mañcake vā tiṇasanthārake vā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭivirato nīcaseyyaṃ kappemi – mañcake vā tiṇasanthārake vā. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā aṭṭhamena aṅgena samannāgato hoti. Evaṃ upavuttho kho, visākhe, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kīvamahapphalo hoti, kīvamahānisaṃso, kīvamahājutiko, kīvamahāvipphāro? Seyyathāpi, visākhe, yo imesaṃ soḷasannaṃ mahājanapadānaṃ pahūtarattaratanānaṃ issariyādhipaccaṃ rajjaṃ kāreyya, seyyathidaṃ – aṅgānaṃ magadhānaṃ kāsīnaṃ kosalānaṃ vajjīnaṃ mallānaṃ cetīnaṃ vaṅgānaṃ kurūnaṃ pañcālānaṃ macchānaṃ sūrasenānaṃ ",
      " assakānaṃ avantīnaṃ gandhārānaṃ kambojānaṃ, aṭṭhaṅgasamannāgatassa uposathassa etaṃ kalaṃ nāgghati soḷasiṃ. Taṃ kissa hetu? Kapaṇaṃ, visākhe, mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya."
    ],
    "innerText": "‘‘Kīvamahapphalo hoti, kīvamahānisaṃso, kīvamahājutiko, kīvamahāvipphāro? Seyyathāpi, visākhe, yo imesaṃ soḷasannaṃ mahājanapadānaṃ pahūtarattaratanānaṃ issariyādhipaccaṃ rajjaṃ kāreyya, seyyathidaṃ – aṅgānaṃ magadhānaṃ kāsīnaṃ kosalānaṃ vajjīnaṃ mallānaṃ cetīnaṃ vaṅgānaṃ kurūnaṃ pañcālānaṃ macchānaṃ sūrasenānaṃ assakānaṃ avantīnaṃ gandhārānaṃ kambojānaṃ, aṭṭhaṅgasamannāgatassa uposathassa etaṃ kalaṃ nāgghati soḷasiṃ. Taṃ kissa hetu? Kapaṇaṃ, visākhe, mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yāni, visākhe, mānusakāni paññāsa vassāni, cātumahārājikānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni pañca vassasatāni cātumahārājikānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, visākhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeyya ",
      ". Idaṃ kho panetaṃ, visākhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’."
    ],
    "innerText": "‘‘Yāni, visākhe, mānusakāni paññāsa vassāni, cātumahārājikānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni pañca vassasatāni cātumahārājikānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, visākhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeyya . Idaṃ kho panetaṃ, visākhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yaṃ ",
      ", visākhe, mānusakaṃ vassasataṃ, tāvatiṃsānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena vassasahassaṃ tāvatiṃsānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, visākhe, vijjati ",
      " yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā tāvatiṃsānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, visākhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’."
    ],
    "innerText": "‘‘Yaṃ , visākhe, mānusakaṃ vassasataṃ, tāvatiṃsānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena vassasahassaṃ tāvatiṃsānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, visākhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā tāvatiṃsānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, visākhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yāni, visākhe, mānusakāni dve vassasatāni…pe… cattāri vassasatāni…pe… aṭṭha vassasatāni…pe… soḷasa vassasatāni paranimmitavasavattīnaṃ devānaṃ eso eko rattindivo ",
      ". Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni soḷasa vassasahassāni paranimmitavasavattīnaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, visākhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā paranimmitavasavattīnaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, visākhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāyā’’’ti."
    ],
    "innerText": "‘‘Yāni, visākhe, mānusakāni dve vassasatāni…pe… cattāri vassasatāni…pe… aṭṭha vassasatāni…pe… soḷasa vassasatāni paranimmitavasavattīnaṃ devānaṃ eso eko rattindivo . Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni soḷasa vassasahassāni paranimmitavasavattīnaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, visākhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā paranimmitavasavattīnaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, visākhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāyā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pāṇaṃ na haññe na cadinnamādiye,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Musā na bhāse na ca majjapo siyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Abrahmacariyā virameyya methunā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rattiṃ na bhuñjeyya vikālabhojanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mālaṃ na dhāre na ca gandhamācare,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "children": [
      "Mañce ",
      " chamāyaṃ va sayetha santhate;"
    ],
    "innerText": "Mañce chamāyaṃ va sayetha santhate;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Etañhi aṭṭhaṅgikamāhuposathaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Buddhena dukkhantagunā pakāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Cando ca suriyo ca ubho sudassanā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Obhāsayaṃ anupariyanti yāvatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "children": [
      "Tamonudā ",
      " te pana antalikkhagā,"
    ],
    "innerText": "Tamonudā te pana antalikkhagā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nabhe pabhāsanti disāvirocanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Etasmiṃ yaṃ vijjati antare dhanaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "children": [
      "Muttā ",
      " maṇi veḷuriyañca bhaddakaṃ;"
    ],
    "innerText": "Muttā maṇi veḷuriyañca bhaddakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Siṅgīsuvaṇṇaṃ atha vāpi kañcanaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yaṃ jātarūpaṃ haṭakanti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Aṭṭhaṅgupetassa ",
      " uposathassa,"
    ],
    "innerText": "‘‘Aṭṭhaṅgupetassa uposathassa,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Kalampi te nānubhavanti soḷasiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Candappabhā tāragaṇā ca sabbe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tasmā hi nārī ca naro ca sīlavā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Aṭṭhaṅgupetaṃ upavassuposathaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Puññāni katvāna sukhudrayāni,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aninditā saggamupenti ṭhāna’’nti. tatiyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Vāseṭṭhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44"
      },
      ". Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho vāseṭṭho upāsako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho vāseṭṭhaṃ upāsakaṃ bhagavā etadavoca – ‘‘aṭṭhaṅgasamannāgato, vāseṭṭha, uposatho upavuttho mahapphalo hoti…pe… aninditā saggamupenti ṭhāna’’nti."
    ],
    "innerText": "44. Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho vāseṭṭho upāsako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho vāseṭṭhaṃ upāsakaṃ bhagavā etadavoca – ‘‘aṭṭhaṅgasamannāgato, vāseṭṭha, uposatho upavuttho mahapphalo hoti…pe… aninditā saggamupenti ṭhāna’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vutte vāseṭṭho upāsako bhagavantaṃ etadavoca – ‘‘piyā ",
      " me, bhante, ñātisālohitā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, piyānampi me assa ñātisālohitānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, bhante, khattiyā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, sabbesampissa ",
      " khattiyānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, bhante, brāhmaṇā…pe… vessā ",
      "… suddā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, sabbesampissa suddānaṃ dīgharattaṃ hitāya sukhāyā’’ti."
    ],
    "innerText": "Evaṃ vutte vāseṭṭho upāsako bhagavantaṃ etadavoca – ‘‘piyā me, bhante, ñātisālohitā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, piyānampi me assa ñātisālohitānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, bhante, khattiyā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, sabbesampissa khattiyānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, bhante, brāhmaṇā…pe… vessā … suddā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, sabbesampissa suddānaṃ dīgharattaṃ hitāya sukhāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evametaṃ, vāseṭṭha, evametaṃ, vāseṭṭha! Sabbe cepi, vāseṭṭha, khattiyā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, sabbesampissa khattiyānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, vāseṭṭha, brāhmaṇā…pe… vessā… suddā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, sabbesampissa suddānaṃ dīgharattaṃ hitāya sukhāya. Sadevako cepi, vāseṭṭha, loko samārako sabrahmako sassamaṇabrāhmaṇī pajā sadevamanussā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[upavaseyya (?)]"
      },
      ", sadevakassapissa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sadevakassa (sabbattha) a. ni. 4.193; ma. ni. 3.64 passitabbaṃ]"
      },
      " lokassa samārakassa ",
      " sabrahmakassa sassamaṇabrāhmaṇiyā pajāya sadevamanussāya dīgharattaṃ hitāya sukhāya. Ime cepi, vāseṭṭha, mahāsālā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, imesampissa mahāsālānaṃ dīgharattaṃ hitāya sukhāya ( ) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[(sace ceteyyuṃ) katthaci atthi. a. ni. 4.193 passitabbaṃ]"
      },
      ". Ko pana vādo manussabhūtassā’’ti! Catutthaṃ."
    ],
    "innerText": "‘‘Evametaṃ, vāseṭṭha, evametaṃ, vāseṭṭha! Sabbe cepi, vāseṭṭha, khattiyā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, sabbesampissa khattiyānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, vāseṭṭha, brāhmaṇā…pe… vessā… suddā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, sabbesampissa suddānaṃ dīgharattaṃ hitāya sukhāya. Sadevako cepi, vāseṭṭha, loko samārako sabrahmako sassamaṇabrāhmaṇī pajā sadevamanussā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ [upavaseyya (?)], sadevakassapissa [sadevakassa (sabbattha) a. ni. 4.193; ma. ni. 3.64 passitabbaṃ] lokassa samārakassa sabrahmakassa sassamaṇabrāhmaṇiyā pajāya sadevamanussāya dīgharattaṃ hitāya sukhāya. Ime cepi, vāseṭṭha, mahāsālā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, imesampissa mahāsālānaṃ dīgharattaṃ hitāya sukhāya ( ) [(sace ceteyyuṃ) katthaci atthi. a. ni. 4.193 passitabbaṃ]. Ko pana vādo manussabhūtassā’’ti! Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Bojjhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "45"
      },
      ". Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho bojjhā upāsikā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho bojjhaṃ upāsikaṃ bhagavā etadavoca –"
    ],
    "innerText": "45. Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho bojjhā upāsikā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho bojjhaṃ upāsikaṃ bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aṭṭhaṅgasamannāgato, bojjhe, uposatho upavuttho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. Kathaṃ ",
      " upavuttho ca, bojjhe, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro? Idha ",
      ", bojjhe, ariyasāvako iti paṭisañcikkhati – ‘yāvajīvaṃ arahanto pāṇātipātaṃ pahāya pāṇātipātā paṭiviratā nihitadaṇḍā nihitasatthā lajjī dayāpannā, sabbapāṇabhūtahitānukampino viharanti. Ahaṃ pajja imañca rattiṃ imañca divasaṃ pāṇātipātaṃ pahāya pāṇātipātā paṭivirato nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharāmi. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā paṭhamena aṅgena samannāgato hoti…pe…."
    ],
    "innerText": "‘‘Aṭṭhaṅgasamannāgato, bojjhe, uposatho upavuttho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. Kathaṃ upavuttho ca, bojjhe, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro? Idha , bojjhe, ariyasāvako iti paṭisañcikkhati – ‘yāvajīvaṃ arahanto pāṇātipātaṃ pahāya pāṇātipātā paṭiviratā nihitadaṇḍā nihitasatthā lajjī dayāpannā, sabbapāṇabhūtahitānukampino viharanti. Ahaṃ pajja imañca rattiṃ imañca divasaṃ pāṇātipātaṃ pahāya pāṇātipātā paṭivirato nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharāmi. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā paṭhamena aṅgena samannāgato hoti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Yāvajīvaṃ ",
      " arahanto uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭiviratā nīcaseyyaṃ kappenti – mañcake vā tiṇasanthārake vā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭivirato nīcaseyyaṃ kappemi – mañcake vā tiṇasanthārake vā. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā aṭṭhamena aṅgena samannāgato hoti. Evaṃ upavuttho kho, bojjhe, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro."
    ],
    "innerText": "‘‘‘Yāvajīvaṃ arahanto uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭiviratā nīcaseyyaṃ kappenti – mañcake vā tiṇasanthārake vā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭivirato nīcaseyyaṃ kappemi – mañcake vā tiṇasanthārake vā. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā aṭṭhamena aṅgena samannāgato hoti. Evaṃ upavuttho kho, bojjhe, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kīvamahapphalo ",
      " hoti, kīvamahānisaṃso, kīvamahājutiko, kīvamahāvipphāro? Seyyathāpi, bojjhe, yo imesaṃ soḷasannaṃ mahājanapadānaṃ pahūtarattaratanānaṃ issariyādhipaccaṃ rajjaṃ kāreyya, seyyathidaṃ – aṅgānaṃ magadhānaṃ kāsīnaṃ kosalānaṃ vajjīnaṃ mallānaṃ cetīnaṃ vaṅgānaṃ kurūnaṃ pañcālānaṃ macchānaṃ sūrasenānaṃ assakānaṃ ",
      " avantīnaṃ gandhārānaṃ kambojānaṃ, aṭṭhaṅgasamannāgatassa ",
      " uposathassa etaṃ kalaṃ nāgghati soḷasiṃ. Taṃ kissa hetu? Kapaṇaṃ, bojjhe, mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya."
    ],
    "innerText": "‘‘Kīvamahapphalo hoti, kīvamahānisaṃso, kīvamahājutiko, kīvamahāvipphāro? Seyyathāpi, bojjhe, yo imesaṃ soḷasannaṃ mahājanapadānaṃ pahūtarattaratanānaṃ issariyādhipaccaṃ rajjaṃ kāreyya, seyyathidaṃ – aṅgānaṃ magadhānaṃ kāsīnaṃ kosalānaṃ vajjīnaṃ mallānaṃ cetīnaṃ vaṅgānaṃ kurūnaṃ pañcālānaṃ macchānaṃ sūrasenānaṃ assakānaṃ avantīnaṃ gandhārānaṃ kambojānaṃ, aṭṭhaṅgasamannāgatassa uposathassa etaṃ kalaṃ nāgghati soḷasiṃ. Taṃ kissa hetu? Kapaṇaṃ, bojjhe, mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yāni, bojjhe, mānusakāni paññāsa vassāni, cātumahārājikānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni pañca vassasatāni cātumahārājikānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bojjhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bojjhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yaṃ, bojjhe, mānusakaṃ vassasataṃ…pe… tāni, bojjhe, mānusakāni dve vassasatāni…pe… cattāri vassasatāni…pe… aṭṭha vassasatāni…pe… soḷasa vassasatāni paranimmitavasavattīnaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni soḷasa vassasahassāni paranimmitavasavattīnaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bojjhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā ",
      " paraṃ maraṇā paranimmitavasavattīnaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bojjhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāyā’’’ti."
    ],
    "innerText": "‘‘Yaṃ, bojjhe, mānusakaṃ vassasataṃ…pe… tāni, bojjhe, mānusakāni dve vassasatāni…pe… cattāri vassasatāni…pe… aṭṭha vassasatāni…pe… soḷasa vassasatāni paranimmitavasavattīnaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni soḷasa vassasahassāni paranimmitavasavattīnaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bojjhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā paranimmitavasavattīnaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bojjhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāyā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Pāṇaṃ ",
      " na haññe na cadinnamādiye,"
    ],
    "innerText": "‘‘Pāṇaṃ na haññe na cadinnamādiye,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Musā na bhāse na ca majjapo siyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "children": [
      "Abrahmacariyā ",
      " virameyya methunā,"
    ],
    "innerText": "Abrahmacariyā virameyya methunā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rattiṃ na bhuñjeyya vikālabhojanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Mālaṃ ",
      " na dhāre na ca gandhamācare,"
    ],
    "innerText": "‘‘Mālaṃ na dhāre na ca gandhamācare,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Mañce chamāyaṃ va sayetha santhate;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Etañhi aṭṭhaṅgikamāhuposathaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Buddhena dukkhantagunā pakāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Cando ca suriyo ca ubho sudassanā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Obhāsayaṃ anupariyanti yāvatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tamonudā te pana antalikkhagā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nabhe pabhāsanti disāvirocanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Etasmiṃ yaṃ vijjati antare dhanaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Muttā maṇi veḷuriyañca bhaddakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Siṅgīsuvaṇṇaṃ atha vāpi kañcanaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yaṃ jātarūpaṃ haṭakanti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Aṭṭhaṅgupetassa uposathassa,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Kalampi te nānubhavanti soḷasiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Candappabhā tāragaṇā ca sabbe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Tasmā ",
      " hi nārī ca naro ca sīlavā,"
    ],
    "innerText": "‘‘Tasmā hi nārī ca naro ca sīlavā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Aṭṭhaṅgupetaṃ upavassuposathaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Puññāni katvāna sukhudrayāni,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aninditā saggamupenti ṭhāna’’nti. pañcamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Anuruddhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "46"
      },
      ". Ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Tena kho pana samayena āyasmā anuruddho divāvihāraṃ gato hoti paṭisallīno. Atha kho sambahulā manāpakāyikā devatā yenāyasmā anuruddho tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ anuruddhaṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho tā devatā āyasmantaṃ anuruddhaṃ etadavocuṃ – ‘‘mayaṃ, bhante ",
      " anuruddha, manāpakāyikā nāma devatā tīsu ṭhānesu issariyaṃ kārema vasaṃ vattema. Mayaṃ, bhante anuruddha, yādisakaṃ vaṇṇaṃ ākaṅkhāma tādisakaṃ vaṇṇaṃ ṭhānaso paṭilabhāma; yādisakaṃ saraṃ ākaṅkhāma ",
      " tādisakaṃ saraṃ ṭhānaso paṭilabhāma; yādisakaṃ sukhaṃ ākaṅkhāma tādisakaṃ sukhaṃ ṭhānaso paṭilabhāma. Mayaṃ, bhante anuruddha, manāpakāyikā nāma devatā imesu tīsu ṭhānesu issariyaṃ kārema vasaṃ vattemā’’ti."
    ],
    "innerText": "46. Ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Tena kho pana samayena āyasmā anuruddho divāvihāraṃ gato hoti paṭisallīno. Atha kho sambahulā manāpakāyikā devatā yenāyasmā anuruddho tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ anuruddhaṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho tā devatā āyasmantaṃ anuruddhaṃ etadavocuṃ – ‘‘mayaṃ, bhante anuruddha, manāpakāyikā nāma devatā tīsu ṭhānesu issariyaṃ kārema vasaṃ vattema. Mayaṃ, bhante anuruddha, yādisakaṃ vaṇṇaṃ ākaṅkhāma tādisakaṃ vaṇṇaṃ ṭhānaso paṭilabhāma; yādisakaṃ saraṃ ākaṅkhāma tādisakaṃ saraṃ ṭhānaso paṭilabhāma; yādisakaṃ sukhaṃ ākaṅkhāma tādisakaṃ sukhaṃ ṭhānaso paṭilabhāma. Mayaṃ, bhante anuruddha, manāpakāyikā nāma devatā imesu tīsu ṭhānesu issariyaṃ kārema vasaṃ vattemā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho āyasmato anuruddhassa etadahosi – ‘‘aho vatimā devatā sabbāva nīlā assu nīlavaṇṇā nīlavatthā nīlālaṅkārā’’ti. Atha kho tā devatā āyasmato anuruddhassa cittamaññāya sabbāva nīlā ahesuṃ nīlavaṇṇā nīlavatthā nīlālaṅkārā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmato anuruddhassa etadahosi – ‘‘aho vatimā devatā sabbāva pītā assu…pe… sabbāva lohitakā assu… sabbāva odātā ",
      " assu odātavaṇṇā odātavatthā odātālaṅkārā’’ti. Atha kho tā devatā āyasmato anuruddhassa cittamaññāya sabbāva odātā ahesuṃ odātavaṇṇā odātavatthā odātālaṅkārā."
    ],
    "innerText": "Atha kho āyasmato anuruddhassa etadahosi – ‘‘aho vatimā devatā sabbāva pītā assu…pe… sabbāva lohitakā assu… sabbāva odātā assu odātavaṇṇā odātavatthā odātālaṅkārā’’ti. Atha kho tā devatā āyasmato anuruddhassa cittamaññāya sabbāva odātā ahesuṃ odātavaṇṇā odātavatthā odātālaṅkārā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho tā devatā ekā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ko (sī.), ekāva (syā. pī.)]"
      },
      " gāyi ekā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ekā pana (sī.), ekāva (syā. pī.)]"
      },
      " nacci ekā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ekā (sī.), ekāva (syā. pī.)]"
      },
      " accharaṃ vādesi. Seyyathāpi nāma pañcaṅgikassa tūriyassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[turiyassa (sī. syā. pī.)]"
      },
      " suvinītassa suppaṭipatāḷitassa kusalehi susamannāhatassa ",
      " saddo hoti vaggu ca rajanīyo ca kamanīyo ca pemanīyo ca madanīyo ca; evamevaṃ ",
      " tāsaṃ devatānaṃ alaṅkārānaṃ saddo hoti vaggu ca rajanīyo ca kamanīyo ca pemanīyo ca madanīyo ca. Atha kho āyasmā anuruddho indriyāni okkhipi."
    ],
    "innerText": "Atha kho tā devatā ekā ca [ko (sī.), ekāva (syā. pī.)] gāyi ekā ca [ekā pana (sī.), ekāva (syā. pī.)] nacci ekā ca [ekā (sī.), ekāva (syā. pī.)] accharaṃ vādesi. Seyyathāpi nāma pañcaṅgikassa tūriyassa [turiyassa (sī. syā. pī.)] suvinītassa suppaṭipatāḷitassa kusalehi susamannāhatassa saddo hoti vaggu ca rajanīyo ca kamanīyo ca pemanīyo ca madanīyo ca; evamevaṃ tāsaṃ devatānaṃ alaṅkārānaṃ saddo hoti vaggu ca rajanīyo ca kamanīyo ca pemanīyo ca madanīyo ca. Atha kho āyasmā anuruddho indriyāni okkhipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho tā devatā ‘‘na khvayyo anuruddho sādiyatī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sādayatīti (saddanītidhātumālā)]"
      },
      " tatthevantaradhāyiṃsu. Atha kho āyasmā anuruddho sāyanhasamayaṃ paṭisallānā vuṭṭhito yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā anuruddho bhagavantaṃ etadavoca –"
    ],
    "innerText": "Atha kho tā devatā ‘‘na khvayyo anuruddho sādiyatī’’ti [sādayatīti (saddanītidhātumālā)] tatthevantaradhāyiṃsu. Atha kho āyasmā anuruddho sāyanhasamayaṃ paṭisallānā vuṭṭhito yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā anuruddho bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idhāhaṃ, bhante, divāvihāraṃ gato homi paṭisallīno. Atha kho, bhante, sambahulā manāpakāyikā devatā yenāhaṃ tenupasaṅkamiṃsu; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho, bhante, tā ",
      " devatā maṃ etadavocuṃ – ‘mayaṃ, bhante anuruddha, manāpakāyikā nāma devatā tīsu ṭhānesu issariyaṃ kārema vasaṃ vattema. Mayaṃ, bhante anuruddha, yādisakaṃ vaṇṇaṃ ākaṅkhāma tādisakaṃ vaṇṇaṃ ṭhānaso paṭilabhāma; yādisakaṃ saraṃ ākaṅkhāma tādisakaṃ saraṃ ṭhānaso ",
      " paṭilabhāma; yādisakaṃ sukhaṃ ākaṅkhāma tādisakaṃ sukhaṃ ṭhānaso paṭilabhāma. Mayaṃ, bhante anuruddha, manāpakāyikā nāma devatā imesu tīsu ṭhānesu issariyaṃ kārema vasaṃ vattemā’ti. Tassa mayhaṃ, bhante, etadahosi – ‘aho vatimā devatā sabbāva nīlā assu nīlavaṇṇā nīlavatthā nīlālaṅkārā’ti. Atha kho, bhante, tā devatā mama cittamaññāya sabbāva nīlā ahesuṃ nīlavaṇṇā nīlavatthā nīlālaṅkārā."
    ],
    "innerText": "‘‘Idhāhaṃ, bhante, divāvihāraṃ gato homi paṭisallīno. Atha kho, bhante, sambahulā manāpakāyikā devatā yenāhaṃ tenupasaṅkamiṃsu; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho, bhante, tā devatā maṃ etadavocuṃ – ‘mayaṃ, bhante anuruddha, manāpakāyikā nāma devatā tīsu ṭhānesu issariyaṃ kārema vasaṃ vattema. Mayaṃ, bhante anuruddha, yādisakaṃ vaṇṇaṃ ākaṅkhāma tādisakaṃ vaṇṇaṃ ṭhānaso paṭilabhāma; yādisakaṃ saraṃ ākaṅkhāma tādisakaṃ saraṃ ṭhānaso paṭilabhāma; yādisakaṃ sukhaṃ ākaṅkhāma tādisakaṃ sukhaṃ ṭhānaso paṭilabhāma. Mayaṃ, bhante anuruddha, manāpakāyikā nāma devatā imesu tīsu ṭhānesu issariyaṃ kārema vasaṃ vattemā’ti. Tassa mayhaṃ, bhante, etadahosi – ‘aho vatimā devatā sabbāva nīlā assu nīlavaṇṇā nīlavatthā nīlālaṅkārā’ti. Atha kho, bhante, tā devatā mama cittamaññāya sabbāva nīlā ahesuṃ nīlavaṇṇā nīlavatthā nīlālaṅkārā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tassa mayhaṃ, bhante, etadahosi – ‘aho vatimā devatā sabbāva pītā assu…pe… sabbāva lohitakā assu…pe… sabbāva odātā assu odātavaṇṇā odātavatthā odātālaṅkārā’ti ",
      ". Atha kho, bhante, tā devatā mama cittamaññāya sabbāva odātā ahesuṃ odātavaṇṇā odātavatthā odātālaṅkārā."
    ],
    "innerText": "‘‘Tassa mayhaṃ, bhante, etadahosi – ‘aho vatimā devatā sabbāva pītā assu…pe… sabbāva lohitakā assu…pe… sabbāva odātā assu odātavaṇṇā odātavatthā odātālaṅkārā’ti . Atha kho, bhante, tā devatā mama cittamaññāya sabbāva odātā ahesuṃ odātavaṇṇā odātavatthā odātālaṅkārā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha kho, bhante, tā devatā ekā ca gāyi ekā ca nacci ekā ca accharaṃ vādesi. Seyyathāpi nāma pañcaṅgikassa tūriyassa suvinītassa suppaṭipatāḷitassa kusalehi susamannāhatassa saddo hoti vaggu ca rajanīyo ca kamanīyo ca pemanīyo ca madanīyo ca; evamevaṃ ",
      " tāsaṃ devatānaṃ alaṅkārānaṃ saddo hoti vaggu ca rajanīyo ca kamanīyo ca pemanīyo ca madanīyo ca. Atha khvāhaṃ, bhante, indriyāni okkhipiṃ."
    ],
    "innerText": "‘‘Atha kho, bhante, tā devatā ekā ca gāyi ekā ca nacci ekā ca accharaṃ vādesi. Seyyathāpi nāma pañcaṅgikassa tūriyassa suvinītassa suppaṭipatāḷitassa kusalehi susamannāhatassa saddo hoti vaggu ca rajanīyo ca kamanīyo ca pemanīyo ca madanīyo ca; evamevaṃ tāsaṃ devatānaṃ alaṅkārānaṃ saddo hoti vaggu ca rajanīyo ca kamanīyo ca pemanīyo ca madanīyo ca. Atha khvāhaṃ, bhante, indriyāni okkhipiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Atha kho, bhante, tā devatā ‘na khvayyo anuruddho sādiyatī’ti tatthevantaradhāyiṃsu. Katihi nu kho, bhante, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjatī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aṭṭhahi ",
      " kho, anuruddha, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjati. Katamehi aṭṭhahi? Idha, anuruddha, mātugāmo yassa mātāpitaro bhattuno denti atthakāmā hitesino anukampakā anukampaṃ upādāya tassa ",
      " hoti pubbuṭṭhāyinī pacchānipātinī kiṅkārapaṭissāvinī manāpacārinī piyavādinī."
    ],
    "innerText": "‘‘Aṭṭhahi kho, anuruddha, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjati. Katamehi aṭṭhahi? Idha, anuruddha, mātugāmo yassa mātāpitaro bhattuno denti atthakāmā hitesino anukampakā anukampaṃ upādāya tassa hoti pubbuṭṭhāyinī pacchānipātinī kiṅkārapaṭissāvinī manāpacārinī piyavādinī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye te bhattu garuno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[guruno (ka.)]"
      },
      " honti – mātāti vā pitāti vā samaṇabrāhmaṇāti vā – te sakkaroti, garuṃ karoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[garukaroti (sī. syā. pī.)]"
      },
      ", māneti, pūjeti, abbhāgate ca āsanodakena paṭipūjeti."
    ],
    "innerText": "‘‘Ye te bhattu garuno [guruno (ka.)] honti – mātāti vā pitāti vā samaṇabrāhmaṇāti vā – te sakkaroti, garuṃ karoti [garukaroti (sī. syā. pī.)], māneti, pūjeti, abbhāgate ca āsanodakena paṭipūjeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye te bhattu abbhantarā kammantā – uṇṇāti vā kappāsāti vā – tattha dakkhā hoti analasā tatrupāyāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tatrūpāyāya (sī.), a. ni. 4.35; 11.14]"
      },
      " vīmaṃsāya samannāgatā alaṃ kātuṃ alaṃ saṃvidhātuṃ."
    ],
    "innerText": "‘‘Ye te bhattu abbhantarā kammantā – uṇṇāti vā kappāsāti vā – tattha dakkhā hoti analasā tatrupāyāya [tatrūpāyāya (sī.), a. ni. 4.35; 11.14] vīmaṃsāya samannāgatā alaṃ kātuṃ alaṃ saṃvidhātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo so bhattu abbhantaro antojano ",
      " – dāsāti vā pessāti vā kammakarāti vā – tesaṃ katañca katato jānāti akatañca akatato jānāti, gilānakānañca balābalaṃ jānāti khādanīyaṃ bhojanīyañcassa paccaṃsena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paccayena (syā.), paccattaṃsena (ka.) a. ni. 5.33]"
      },
      " saṃvibhajati."
    ],
    "innerText": "‘‘Yo so bhattu abbhantaro antojano – dāsāti vā pessāti vā kammakarāti vā – tesaṃ katañca katato jānāti akatañca akatato jānāti, gilānakānañca balābalaṃ jānāti khādanīyaṃ bhojanīyañcassa paccaṃsena [paccayena (syā.), paccattaṃsena (ka.) a. ni. 5.33] saṃvibhajati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yaṃ bhattu āharati dhanaṃ vā dhaññaṃ vā jātarūpaṃ vā taṃ ārakkhena guttiyā sampādeti, tattha ca hoti adhuttī athenī asoṇḍī avināsikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Upāsikā kho pana hoti buddhaṃ saraṇaṃ gatā dhammaṃ saraṇaṃ gatā saṅghaṃ saraṇaṃ gatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sīlavatī ",
      " kho pana hoti – pāṇātipātā paṭiviratā, adinnādānā paṭiviratā, kāmesumicchācārā paṭiviratā, musāvādā paṭiviratā, surāmerayamajjapamādaṭṭhānā paṭiviratā."
    ],
    "innerText": "‘‘Sīlavatī kho pana hoti – pāṇātipātā paṭiviratā, adinnādānā paṭiviratā, kāmesumicchācārā paṭiviratā, musāvādā paṭiviratā, surāmerayamajjapamādaṭṭhānā paṭiviratā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cāgavatī kho pana hoti. Vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[muttacāgī (syā.)]"
      },
      " payatapāṇinī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[payatapāṇi (sī.), payatapāṇī (syā. pī. ka.)]"
      },
      " vossaggaratā yācayogā dānasaṃvibhāgaratā."
    ],
    "innerText": "‘‘Cāgavatī kho pana hoti. Vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgā [muttacāgī (syā.)] payatapāṇinī [payatapāṇi (sī.), payatapāṇī (syā. pī. ka.)] vossaggaratā yācayogā dānasaṃvibhāgaratā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Imehi kho, anuruddha, aṭṭhahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Yo ",
      " naṃ bharati sabbadā, niccaṃ ātāpi ussuko;"
    ],
    "innerText": "‘‘Yo naṃ bharati sabbadā, niccaṃ ātāpi ussuko;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Taṃ sabbakāmadaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[taṃ sabbakāmaharaṃ (sī. syā. pī.) sabbakāmaharaṃ (a. ni. 5.33]"
      },
      " posaṃ, bhattāraṃ nātimaññati."
    ],
    "innerText": "Taṃ sabbakāmadaṃ [taṃ sabbakāmaharaṃ (sī. syā. pī.) sabbakāmaharaṃ (a. ni. 5.33] posaṃ, bhattāraṃ nātimaññati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Na cāpi sotthi bhattāraṃ, issāvādena rosaye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhattu ca garuno sabbe, paṭipūjeti paṇḍitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Uṭṭhāhikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[uṭṭhāyikā (ka.)]"
      },
      " analasā, saṅgahitaparijjanā;"
    ],
    "innerText": "‘‘Uṭṭhāhikā [uṭṭhāyikā (ka.)] analasā, saṅgahitaparijjanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhattu manāpaṃ carati, sambhataṃ anurakkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yā evaṃ vattati nārī, bhattu chandavasānugā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Manāpā nāma te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[manāpakāyikā (sī. ka.)]"
      },
      " devā, yattha sā upapajjatī’’ti. chaṭṭhaṃ;"
    ],
    "innerText": "Manāpā nāma te [manāpakāyikā (sī. ka.)] devā, yattha sā upapajjatī’’ti. chaṭṭhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Dutiyavisākhāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "47"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Atha kho visākhā migāramātā…pe… ekamantaṃ nisinnaṃ kho visākhaṃ migāramātaraṃ bhagavā etadavoca –"
    ],
    "innerText": "47. Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Atha kho visākhā migāramātā…pe… ekamantaṃ nisinnaṃ kho visākhaṃ migāramātaraṃ bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aṭṭhahi kho, visākhe, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ ",
      " devānaṃ sahabyataṃ upapajjati. Katamehi aṭṭhahi? Idha, visākhe, mātugāmo yassa mātāpitaro bhattuno denti atthakāmā hitesino anukampakā anukampaṃ upādāya tassa hoti pubbuṭṭhāyinī pacchānipātinī kiṅkārapaṭissāvinī manāpacārinī piyavādinī…pe…."
    ],
    "innerText": "‘‘Aṭṭhahi kho, visākhe, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjati. Katamehi aṭṭhahi? Idha, visākhe, mātugāmo yassa mātāpitaro bhattuno denti atthakāmā hitesino anukampakā anukampaṃ upādāya tassa hoti pubbuṭṭhāyinī pacchānipātinī kiṅkārapaṭissāvinī manāpacārinī piyavādinī…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cāgavatī kho ",
      " pana hoti. Vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgā payatapāṇinī vossaggaratā yācayogā dānasaṃvibhāgaratā. Imehi kho, visākhe, aṭṭhahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjatī’’ti."
    ],
    "innerText": "‘‘Cāgavatī kho pana hoti. Vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgā payatapāṇinī vossaggaratā yācayogā dānasaṃvibhāgaratā. Imehi kho, visākhe, aṭṭhahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo naṃ bharati sabbadā, niccaṃ ātāpi ussuko;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Taṃ sabbakāmadaṃ posaṃ, bhattāraṃ nātimaññati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Na ",
      " cāpi sotthi bhattāraṃ, issāvādena rosaye;"
    ],
    "innerText": "‘‘Na cāpi sotthi bhattāraṃ, issāvādena rosaye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhattu ca garuno sabbe, paṭipūjeti paṇḍitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Uṭṭhāhikā analasā, saṅgahitaparijjanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhattu manāpaṃ carati, sambhataṃ anurakkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yā evaṃ vattati nārī, bhattu chandavasānugā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Manāpā nāma te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[manāpakāyikā (sī. ka.)]"
      },
      " devā, yattha sā upapajjatī’’ti. sattamaṃ;"
    ],
    "innerText": "Manāpā nāma te [manāpakāyikā (sī. ka.)] devā, yattha sā upapajjatī’’ti. sattamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Nakulamātāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "48"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā bhaggesu viharati suṃsumāragire ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[suṃsumāragire (sī. syā. pī.)]"
      },
      " bhesakaḷāvane migadāye. Atha kho nakulamātā gahapatānī yena bhagavā tenupasaṅkami; upasaṅkamitvā…pe…. Ekamantaṃ nisinnaṃ kho nakulamātaraṃ gahapatāniṃ bhagavā etadavoca –"
    ],
    "innerText": "48. Ekaṃ samayaṃ bhagavā bhaggesu viharati suṃsumāragire [suṃsumāragire (sī. syā. pī.)] bhesakaḷāvane migadāye. Atha kho nakulamātā gahapatānī yena bhagavā tenupasaṅkami; upasaṅkamitvā…pe…. Ekamantaṃ nisinnaṃ kho nakulamātaraṃ gahapatāniṃ bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aṭṭhahi kho, nakulamāte, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ ",
      " devānaṃ sahabyataṃ upapajjati. Katamehi aṭṭhahi? Idha, nakulamāte, mātugāmo yassa mātāpitaro bhattuno denti atthakāmā hitesino anukampakā anukampaṃ upādāya tassa hoti pubbuṭṭhāyinī pacchānipātinī kiṅkārapaṭissāvinī ",
      " manāpacārinī piyavādinī."
    ],
    "innerText": "‘‘Aṭṭhahi kho, nakulamāte, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjati. Katamehi aṭṭhahi? Idha, nakulamāte, mātugāmo yassa mātāpitaro bhattuno denti atthakāmā hitesino anukampakā anukampaṃ upādāya tassa hoti pubbuṭṭhāyinī pacchānipātinī kiṅkārapaṭissāvinī manāpacārinī piyavādinī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ye te bhattu garuno honti – mātāti vā pitāti vā samaṇabrāhmaṇāti vā – te sakkaroti garuṃ karoti māneti pūjeti, abbhāgate ca āsanodakena paṭipūjeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ye te bhattu abbhantarā kammantā – uṇṇāti vā kappāsāti vā – tattha dakkhā hoti analasā tatrupāyāya vīmaṃsāya samannāgatā alaṃ kātuṃ alaṃ saṃvidhātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yo so bhattu abbhantaro antojano – dāsāti vā pessāti vā kammakarāti vā – tesaṃ katañca katato jānāti akatañca akatato jānāti, gilānakānañca balābalaṃ jānāti khādanīyaṃ bhojanīyañcassa paccaṃsena saṃvibhajati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yaṃ ",
      " bhattā āharati dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā taṃ ārakkhena guttiyā sampādeti, tattha ca hoti adhuttī athenī asoṇḍī avināsikā."
    ],
    "innerText": "‘‘Yaṃ bhattā āharati dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā taṃ ārakkhena guttiyā sampādeti, tattha ca hoti adhuttī athenī asoṇḍī avināsikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Upāsikā kho pana hoti buddhaṃ saraṇaṃ gatā dhammaṃ saraṇaṃ gatā saṅghaṃ saraṇaṃ gatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sīlavatī kho pana hoti – pāṇātipātā paṭiviratā…pe… surāmerayamajjapamādaṭṭhānā paṭiviratā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cāgavatī kho pana hoti vigatamalamaccherena cetasā ",
      " agāraṃ ajjhāvasati muttacāgā payatapāṇinī vossaggaratā yācayogā dānasaṃvibhāgaratā."
    ],
    "innerText": "‘‘Cāgavatī kho pana hoti vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgā payatapāṇinī vossaggaratā yācayogā dānasaṃvibhāgaratā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Imehi kho, nakulamāte, aṭṭhahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Yo ",
      " naṃ bharati sabbadā, niccaṃ ātāpi ussuko;"
    ],
    "innerText": "‘‘Yo naṃ bharati sabbadā, niccaṃ ātāpi ussuko;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Taṃ sabbakāmadaṃ posaṃ, bhattāraṃ nātimaññati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Na cāpi sotthi bhattāraṃ, issāvādena rosaye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhattu ca garuno sabbe, paṭipūjeti paṇḍitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Uṭṭhāhikā analasā, saṅgahitaparijjanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhattu manāpaṃ carati, sambhataṃ anurakkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yā evaṃ vattati nārī, bhattu chandavasānugā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Manāpā nāma te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[manāpakāyikā (sī.)]"
      },
      " devā, yattha sā upapajjatī’’ti. aṭṭhamaṃ;"
    ],
    "innerText": "Manāpā nāma te [manāpakāyikā (sī.)] devā, yattha sā upapajjatī’’ti. aṭṭhamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Paṭhamaidhalokikasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "49"
      },
      ". Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Atha kho visākhā migāramātā yena bhagavā tenupasaṅkami…pe…. Ekamantaṃ nisinnaṃ kho visākhaṃ migāramātaraṃ bhagavā etadavoca –"
    ],
    "innerText": "49. Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Atha kho visākhā migāramātā yena bhagavā tenupasaṅkami…pe…. Ekamantaṃ nisinnaṃ kho visākhaṃ migāramātaraṃ bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Catūhi ",
      " kho, visākhe, dhammehi samannāgato mātugāmo idhalokavijayāya paṭipanno hoti, ayaṃsa loko āraddho hoti. Katamehi catūhi? Idha, visākhe, mātugāmo susaṃvihitakammanto hoti, saṅgahitaparijano, bhattu manāpaṃ carati, sambhataṃ anurakkhati."
    ],
    "innerText": "‘‘Catūhi kho, visākhe, dhammehi samannāgato mātugāmo idhalokavijayāya paṭipanno hoti, ayaṃsa loko āraddho hoti. Katamehi catūhi? Idha, visākhe, mātugāmo susaṃvihitakammanto hoti, saṅgahitaparijano, bhattu manāpaṃ carati, sambhataṃ anurakkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", visākhe, mātugāmo susaṃvihitakammanto hoti? Idha, visākhe, mātugāmo ye te bhattu abbhantarā kammantā – uṇṇāti vā kappāsāti vā – tattha dakkhā hoti analasā tatrupāyāya vīmaṃsāya samannāgatā alaṃ kātuṃ alaṃ saṃvidhātuṃ. Evaṃ kho, visākhe, mātugāmo susaṃvihitakammanto ",
      " hoti."
    ],
    "innerText": "‘‘Kathañca , visākhe, mātugāmo susaṃvihitakammanto hoti? Idha, visākhe, mātugāmo ye te bhattu abbhantarā kammantā – uṇṇāti vā kappāsāti vā – tattha dakkhā hoti analasā tatrupāyāya vīmaṃsāya samannāgatā alaṃ kātuṃ alaṃ saṃvidhātuṃ. Evaṃ kho, visākhe, mātugāmo susaṃvihitakammanto hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, visākhe, mātugāmo saṅgahitaparijano hoti? Idha, visākhe, mātugāmo yo so ",
      " bhattu abbhantaro antojano – dāsāti vā pessāti vā kammakarāti vā – tesaṃ katañca katato jānāti akatañca akatato jānāti, gilānakānañca balābalaṃ jānāti khādanīyaṃ bhojanīyañcassa paccaṃsena saṃvibhajati. Evaṃ kho, visākhe, mātugāmo saṅgahitaparijano hoti."
    ],
    "innerText": "‘‘Kathañca, visākhe, mātugāmo saṅgahitaparijano hoti? Idha, visākhe, mātugāmo yo so bhattu abbhantaro antojano – dāsāti vā pessāti vā kammakarāti vā – tesaṃ katañca katato jānāti akatañca akatato jānāti, gilānakānañca balābalaṃ jānāti khādanīyaṃ bhojanīyañcassa paccaṃsena saṃvibhajati. Evaṃ kho, visākhe, mātugāmo saṅgahitaparijano hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, visākhe, mātugāmo bhattu manāpaṃ carati? Idha, visākhe, mātugāmo yaṃ bhattu amanāpasaṅkhātaṃ taṃ jīvitahetupi na ajjhācarati. Evaṃ kho, visākhe, mātugāmo bhattu manāpaṃ carati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, visākhe, mātugāmo sambhataṃ anurakkhati? Idha, visākhe, mātugāmo yaṃ bhattā āharati dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā taṃ ārakkhena guttiyā sampādeti, tattha ca hoti adhuttī athenī asoṇḍī avināsikā. Evaṃ kho, visākhe, mātugāmo sambhataṃ anurakkhati. Imehi kho, visākhe, catūhi dhammehi samannāgato mātugāmo idhalokavijayāya paṭipanno hoti, ayaṃsa loko āraddho hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Catūhi kho ",
      ", visākhe, dhammehi samannāgato mātugāmo paralokavijayāya paṭipanno hoti, paraloko āraddho hoti. Katamehi catūhi? Idha, visākhe, mātugāmo saddhāsampanno hoti, sīlasampanno hoti, cāgasampanno hoti, paññāsampanno hoti."
    ],
    "innerText": "‘‘Catūhi kho , visākhe, dhammehi samannāgato mātugāmo paralokavijayāya paṭipanno hoti, paraloko āraddho hoti. Katamehi catūhi? Idha, visākhe, mātugāmo saddhāsampanno hoti, sīlasampanno hoti, cāgasampanno hoti, paññāsampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", visākhe, mātugāmo saddhāsampanno hoti? Idha, visākhe, mātugāmo saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Evaṃ kho, visākhe, mātugāmo saddhāsampanno hoti."
    ],
    "innerText": "‘‘Kathañca , visākhe, mātugāmo saddhāsampanno hoti? Idha, visākhe, mātugāmo saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Evaṃ kho, visākhe, mātugāmo saddhāsampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, visākhe, mātugāmo sīlasampanno hoti? Idha ",
      ", visākhe, mātugāmo pāṇātipātā paṭivirato hoti…pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Evaṃ kho, visākhe, mātugāmo sīlasampanno hoti."
    ],
    "innerText": "‘‘Kathañca, visākhe, mātugāmo sīlasampanno hoti? Idha , visākhe, mātugāmo pāṇātipātā paṭivirato hoti…pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Evaṃ kho, visākhe, mātugāmo sīlasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", visākhe, mātugāmo cāgasampanno hoti? Idha, visākhe, mātugāmo vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgā payatapāṇinī vossaggaratā yācayogā dānasaṃvibhāgaratā. Evaṃ kho, visākhe, mātugāmo cāgasampanno hoti."
    ],
    "innerText": "‘‘Kathañca , visākhe, mātugāmo cāgasampanno hoti? Idha, visākhe, mātugāmo vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgā payatapāṇinī vossaggaratā yācayogā dānasaṃvibhāgaratā. Evaṃ kho, visākhe, mātugāmo cāgasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, visākhe, mātugāmo paññāsampanno hoti? Idha, visākhe, mātugāmo paññavā hoti…pe… evaṃ kho, visākhe, mātugāmo paññāsampanno hoti. Imehi kho, visākhe, catūhi ",
      " dhammehi samannāgato mātugāmo paralokavijayāya paṭipanno hoti, paraloko āraddho hotī’’ti."
    ],
    "innerText": "‘‘Kathañca, visākhe, mātugāmo paññāsampanno hoti? Idha, visākhe, mātugāmo paññavā hoti…pe… evaṃ kho, visākhe, mātugāmo paññāsampanno hoti. Imehi kho, visākhe, catūhi dhammehi samannāgato mātugāmo paralokavijayāya paṭipanno hoti, paraloko āraddho hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Susaṃvihitakammantā, saṅgahitaparijjanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhattu manāpaṃ carati, sambhataṃ anurakkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Saddhā sīlena sampannā, vadaññū vītamaccharā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Niccaṃ maggaṃ visodheti, sotthānaṃ samparāyikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Iccete aṭṭha dhammā ca, yassā vijjanti nāriyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tampi sīlavatiṃ āhu, dhammaṭṭhaṃ saccavādiniṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Soḷasākārasampannā, aṭṭhaṅgasusamāgatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Tādisī sīlavatī upāsikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upapajjati devalokaṃ manāpa’’nti. navamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Dutiyaidhalokikasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50"
      },
      ". ‘‘Catūhi ",
      ", bhikkhave, dhammehi samannāgato mātugāmo idhalokavijayāya paṭipanno hoti, ayaṃsa loko āraddho hoti. Katamehi catūhi? Idha ",
      ", bhikkhave, mātugāmo susaṃvihitakammanto hoti, saṅgahitaparijano, bhattu manāpaṃ carati, sambhataṃ anurakkhati."
    ],
    "innerText": "50. ‘‘Catūhi , bhikkhave, dhammehi samannāgato mātugāmo idhalokavijayāya paṭipanno hoti, ayaṃsa loko āraddho hoti. Katamehi catūhi? Idha , bhikkhave, mātugāmo susaṃvihitakammanto hoti, saṅgahitaparijano, bhattu manāpaṃ carati, sambhataṃ anurakkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, mātugāmo susaṃvihitakammanto hoti? Idha, bhikkhave, mātugāmo ye ",
      " te bhattu abbhantarā kammantā…pe… evaṃ kho, bhikkhave, mātugāmo susaṃvihitakammanto hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, mātugāmo susaṃvihitakammanto hoti? Idha, bhikkhave, mātugāmo ye te bhattu abbhantarā kammantā…pe… evaṃ kho, bhikkhave, mātugāmo susaṃvihitakammanto hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, mātugāmo saṅgahitaparijano hoti? Idha, bhikkhave, mātugāmo yo so bhattu abbhantaro antojano…pe… evaṃ kho, bhikkhave, mātugāmo saṅgahitaparijano hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, mātugāmo bhattu manāpaṃ carati? Idha, bhikkhave, mātugāmo yaṃ bhattu amanāpasaṅkhātaṃ taṃ jīvitahetupi na ajjhācarati. Evaṃ kho, bhikkhave, mātugāmo bhattu manāpaṃ carati."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, mātugāmo bhattu manāpaṃ carati? Idha, bhikkhave, mātugāmo yaṃ bhattu amanāpasaṅkhātaṃ taṃ jīvitahetupi na ajjhācarati. Evaṃ kho, bhikkhave, mātugāmo bhattu manāpaṃ carati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, mātugāmo sambhataṃ anurakkhati? Idha, bhikkhave, mātugāmo yaṃ bhattā āharati…pe… evaṃ kho, bhikkhave, mātugāmo sambhataṃ anurakkhati. Imehi kho, bhikkhave, catūhi dhammehi samannāgato mātugāmo idhalokavijayāya paṭipanno hoti, ayaṃsa loko āraddho hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Catūhi, bhikkhave, dhammehi samannāgato mātugāmo paralokavijayāya paṭipanno hoti, paraloko āraddho hoti. Katamehi catūhi? Idha, bhikkhave, mātugāmo saddhāsampanno hoti, sīlasampanno hoti, cāgasampanno hoti, paññāsampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, mātugāmo saddhāsampanno hoti? Idha, bhikkhave, mātugāmo saddho hoti…pe… evaṃ ",
      " kho, bhikkhave, mātugāmo saddhāsampanno hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, mātugāmo saddhāsampanno hoti? Idha, bhikkhave, mātugāmo saddho hoti…pe… evaṃ kho, bhikkhave, mātugāmo saddhāsampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, mātugāmo sīlasampanno hoti? Idha, bhikkhave, mātugāmo pāṇātipātā paṭivirato hoti…pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Evaṃ kho, bhikkhave, mātugāmo sīlasampanno hoti."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, mātugāmo sīlasampanno hoti? Idha, bhikkhave, mātugāmo pāṇātipātā paṭivirato hoti…pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Evaṃ kho, bhikkhave, mātugāmo sīlasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, mātugāmo cāgasampanno hoti? Idha, bhikkhave, mātugāmo vigatamalamaccherena ",
      " cetasā agāraṃ ajjhāvasati…pe… evaṃ kho ",
      ", bhikkhave, mātugāmo cāgasampanno hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, mātugāmo cāgasampanno hoti? Idha, bhikkhave, mātugāmo vigatamalamaccherena cetasā agāraṃ ajjhāvasati…pe… evaṃ kho , bhikkhave, mātugāmo cāgasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, mātugāmo paññāsampanno hoti? Idha, bhikkhave, mātugāmo paññavā hoti…pe… evaṃ kho, bhikkhave, mātugāmo paññāsampanno hoti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato mātugāmo paralokavijayāya paṭipanno hoti, paraloko āraddho hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Susaṃvihitakammantā, saṅgahitaparijjanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhattu manāpaṃ carati, sambhataṃ anurakkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Saddhā sīlena sampannā, vadaññū vītamaccharā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Niccaṃ maggaṃ visodheti, sotthānaṃ samparāyikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Iccete aṭṭha dhammā ca, yassā vijjanti nāriyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tampi sīlavatiṃ āhu, dhammaṭṭhaṃ saccavādiniṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Soḷasākārasampannā, aṭṭhaṅgasusamāgatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tādisī sīlavatī upāsikā, upapajjati devalokaṃ manāpa’’nti. dasamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Uposathavaggo pañcamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Saṃkhitte vitthate visākhe, vāseṭṭho bojjhāya pañcamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anuruddhaṃ puna visākhe, nakulā idhalokikā dveti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamapaṇṇāsakaṃ samattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Dutiyapaṇṇāsakaṃ"
  }
]