[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(12) 2. Āpāyikavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Āpāyikasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "114"
      },
      ". ‘‘Tayome ",
      ", bhikkhave, āpāyikā nerayikā idamappahāya. Katame tayo? Yo ",
      " ca abrahmacārī brahmacāripaṭiñño, yo ca suddhaṃ brahmacariyaṃ carantaṃ amūlakena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhūtena (ka.)]"
      },
      " abrahmacariyena anuddhaṃseti, yo cāyaṃ evaṃvādī evaṃdiṭṭhi – ‘natthi kāmesu doso’ti, so tāya kāmesu pātabyataṃ āpajjati. Ime kho, bhikkhave, tayo āpāyikā nerayikā idamappahāyā’’ti. Paṭhamaṃ."
    ],
    "innerText": "114. ‘‘Tayome , bhikkhave, āpāyikā nerayikā idamappahāya. Katame tayo? Yo ca abrahmacārī brahmacāripaṭiñño, yo ca suddhaṃ brahmacariyaṃ carantaṃ amūlakena [abhūtena (ka.)] abrahmacariyena anuddhaṃseti, yo cāyaṃ evaṃvādī evaṃdiṭṭhi – ‘natthi kāmesu doso’ti, so tāya kāmesu pātabyataṃ āpajjati. Ime kho, bhikkhave, tayo āpāyikā nerayikā idamappahāyā’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Dullabhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "115"
      },
      ". ‘‘Tiṇṇaṃ, bhikkhave, pātubhāvo dullabho lokasmiṃ. Katamesaṃ tiṇṇaṃ? Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pātubhāvo dullabho lokasmiṃ, tathāgatappaveditassa dhammavinayassa desetā puggalo dullabho lokasmiṃ, kataññū katavedī puggalo dullabho lokasmiṃ. Imesaṃ kho, bhikkhave, tiṇṇaṃ pātubhāvo dullabho lokasmi’’nti. Dutiyaṃ."
    ],
    "innerText": "115. ‘‘Tiṇṇaṃ, bhikkhave, pātubhāvo dullabho lokasmiṃ. Katamesaṃ tiṇṇaṃ? Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pātubhāvo dullabho lokasmiṃ, tathāgatappaveditassa dhammavinayassa desetā puggalo dullabho lokasmiṃ, kataññū katavedī puggalo dullabho lokasmiṃ. Imesaṃ kho, bhikkhave, tiṇṇaṃ pātubhāvo dullabho lokasmi’’nti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Appameyyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "116"
      },
      ". ‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Suppameyyo, duppameyyo, appameyyo. Katamo ca, bhikkhave, puggalo suppameyyo? Idha, bhikkhave, ekacco puggalo uddhato hoti unnaḷo capalo mukharo vikiṇṇavāco muṭṭhassati asampajāno asamāhito vibbhantacitto pākatindriyo. Ayaṃ vuccati, bhikkhave, puggalo suppameyyo."
    ],
    "innerText": "116. ‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Suppameyyo, duppameyyo, appameyyo. Katamo ca, bhikkhave, puggalo suppameyyo? Idha, bhikkhave, ekacco puggalo uddhato hoti unnaḷo capalo mukharo vikiṇṇavāco muṭṭhassati asampajāno asamāhito vibbhantacitto pākatindriyo. Ayaṃ vuccati, bhikkhave, puggalo suppameyyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ",
      " ca, bhikkhave, puggalo duppameyyo? Idha, bhikkhave, ekacco puggalo anuddhato hoti anunnaḷo acapalo amukharo avikiṇṇavāco upaṭṭhitassati sampajāno samāhito ekaggacitto saṃvutindriyo. Ayaṃ ",
      " vuccati, bhikkhave, puggalo duppameyyo."
    ],
    "innerText": "‘‘Katamo ca, bhikkhave, puggalo duppameyyo? Idha, bhikkhave, ekacco puggalo anuddhato hoti anunnaḷo acapalo amukharo avikiṇṇavāco upaṭṭhitassati sampajāno samāhito ekaggacitto saṃvutindriyo. Ayaṃ vuccati, bhikkhave, puggalo duppameyyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, puggalo appameyyo? Idha, bhikkhave, bhikkhu arahaṃ hoti khīṇāsavo. Ayaṃ vuccati, bhikkhave, puggalo appameyyo. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’nti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Āneñjasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "117"
      },
      ". ‘‘Tayome ",
      ", bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, bhikkhave, ekacco puggalo sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. So tadassādeti taṃ nikāmeti tena ca vittiṃ āpajjati, tatra ṭhito tadadhimutto tabbahulavihārī aparihīno kālaṃ kurumāno ākāsānañcāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjati. Ākāsānañcāyatanūpagānaṃ, bhikkhave, devānaṃ vīsati kappasahassāni āyuppamāṇaṃ. Tattha puthujjano yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā nirayampi gacchati tiracchānayonimpi gacchati pettivisayampi gacchati. Bhagavato pana sāvako tattha yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā tasmiṃyeva bhave parinibbāyati. Ayaṃ kho, bhikkhave, viseso ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanena, yadidaṃ gatiyā upapattiyā."
    ],
    "innerText": "117. ‘‘Tayome , bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, bhikkhave, ekacco puggalo sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. So tadassādeti taṃ nikāmeti tena ca vittiṃ āpajjati, tatra ṭhito tadadhimutto tabbahulavihārī aparihīno kālaṃ kurumāno ākāsānañcāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjati. Ākāsānañcāyatanūpagānaṃ, bhikkhave, devānaṃ vīsati kappasahassāni āyuppamāṇaṃ. Tattha puthujjano yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā nirayampi gacchati tiracchānayonimpi gacchati pettivisayampi gacchati. Bhagavato pana sāvako tattha yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā tasmiṃyeva bhave parinibbāyati. Ayaṃ kho, bhikkhave, viseso ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanena, yadidaṃ gatiyā upapattiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati. So tadassādeti taṃ ",
      " nikāmeti tena ca vittiṃ āpajjati, tatra ṭhito tadadhimutto tabbahulavihārī aparihīno kālaṃ kurumāno viññāṇañcāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjati. Viññāṇañcāyatanūpagānaṃ, bhikkhave, devānaṃ cattārīsaṃ kappasahassāni āyuppamāṇaṃ. Tattha ",
      " puthujjano ",
      " yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā nirayampi gacchati tiracchānayonimpi gacchati pettivisayampi gacchati. Bhagavato pana sāvako tattha yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā tasmiṃyeva bhave parinibbāyati. Ayaṃ kho, bhikkhave, viseso ayaṃ adhippayāso idaṃ nānākaraṇaṃ ",
      " sutavato ariyasāvakassa assutavatā puthujjanena, yadidaṃ gatiyā upapattiyā."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati. So tadassādeti taṃ nikāmeti tena ca vittiṃ āpajjati, tatra ṭhito tadadhimutto tabbahulavihārī aparihīno kālaṃ kurumāno viññāṇañcāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjati. Viññāṇañcāyatanūpagānaṃ, bhikkhave, devānaṃ cattārīsaṃ kappasahassāni āyuppamāṇaṃ. Tattha puthujjano yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā nirayampi gacchati tiracchānayonimpi gacchati pettivisayampi gacchati. Bhagavato pana sāvako tattha yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā tasmiṃyeva bhave parinibbāyati. Ayaṃ kho, bhikkhave, viseso ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanena, yadidaṃ gatiyā upapattiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. So tadassādeti taṃ nikāmeti tena ca vittiṃ āpajjati, tatra ṭhito tadadhimutto tabbahulavihārī aparihīno kālaṃ kurumāno ākiñcaññāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjati. Ākiñcaññāyatanūpagānaṃ, bhikkhave, devānaṃ saṭṭhi kappasahassāni āyuppamāṇaṃ. Tattha puthujjano yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā nirayampi gacchati tiracchānayonimpi gacchati pettivisayampi gacchati. Bhagavato pana sāvako tattha yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā tasmiṃyeva bhave parinibbāyati. Ayaṃ kho, bhikkhave, viseso ",
      ", ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanena, yadidaṃ gatiyā upapattiyā. ‘Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’’nti. Catutthaṃ."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. So tadassādeti taṃ nikāmeti tena ca vittiṃ āpajjati, tatra ṭhito tadadhimutto tabbahulavihārī aparihīno kālaṃ kurumāno ākiñcaññāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjati. Ākiñcaññāyatanūpagānaṃ, bhikkhave, devānaṃ saṭṭhi kappasahassāni āyuppamāṇaṃ. Tattha puthujjano yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā nirayampi gacchati tiracchānayonimpi gacchati pettivisayampi gacchati. Bhagavato pana sāvako tattha yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā tasmiṃyeva bhave parinibbāyati. Ayaṃ kho, bhikkhave, viseso , ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanena, yadidaṃ gatiyā upapattiyā. ‘Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’’nti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Vipattisampadāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "118"
      },
      ". ‘‘Tisso imā, bhikkhave, vipattiyo. Katamā tisso? Sīlavipatti, cittavipatti, diṭṭhivipatti. Katamā ca, bhikkhave, sīlavipatti? Idha, bhikkhave, ekacco pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, pisuṇavāco hoti, pharusavāco hoti, samphappalāpī hoti. Ayaṃ vuccati, bhikkhave, sīlavipatti."
    ],
    "innerText": "118. ‘‘Tisso imā, bhikkhave, vipattiyo. Katamā tisso? Sīlavipatti, cittavipatti, diṭṭhivipatti. Katamā ca, bhikkhave, sīlavipatti? Idha, bhikkhave, ekacco pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, pisuṇavāco hoti, pharusavāco hoti, samphappalāpī hoti. Ayaṃ vuccati, bhikkhave, sīlavipatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, cittavipatti? Idha, bhikkhave, ekacco abhijjhālu hoti byāpannacitto. Ayaṃ vuccati, bhikkhave, cittavipatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ",
      " ca, bhikkhave, diṭṭhivipatti? Idha, bhikkhave, ekacco micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ, natthi yiṭṭhaṃ, natthi hutaṃ, natthi sukatadukkaṭānaṃ ",
      ", kammānaṃ phalaṃ vipāko, natthi ayaṃ loko, natthi paro loko, natthi mātā, natthi pitā, natthi sattā opapātikā, natthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhivipatti. Sīlavipattihetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; cittavipattihetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; diṭṭhivipattihetu vā, bhikkhave, sattā ",
      " kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Imā kho, bhikkhave, tisso vipattiyoti."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, diṭṭhivipatti? Idha, bhikkhave, ekacco micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ, natthi yiṭṭhaṃ, natthi hutaṃ, natthi sukatadukkaṭānaṃ , kammānaṃ phalaṃ vipāko, natthi ayaṃ loko, natthi paro loko, natthi mātā, natthi pitā, natthi sattā opapātikā, natthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhivipatti. Sīlavipattihetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; cittavipattihetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; diṭṭhivipattihetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Imā kho, bhikkhave, tisso vipattiyoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tisso imā, bhikkhave, sampadā. Katamā tisso? Sīlasampadā, cittasampadā, diṭṭhisampadā. Katamā ca, bhikkhave, sīlasampadā? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti. Ayaṃ vuccati, bhikkhave, sīlasampadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, cittasampadā? Idha, bhikkhave, ekacco anabhijjhālu hoti abyāpannacitto. Ayaṃ vuccati, bhikkhave, cittasampadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca, bhikkhave, diṭṭhisampadā? Idha, bhikkhave, ekacco sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ, atthi yiṭṭhaṃ, atthi hutaṃ, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, atthi ayaṃ loko, atthi paro loko, atthi mātā, atthi pitā, atthi sattā opapātikā, atthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhisampadā. Sīlasampadāhetu ",
      " vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; cittasampadāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ ",
      " lokaṃ upapajjanti ",
      "; diṭṭhisampadāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ ",
      " lokaṃ upapajjanti. Imā kho, bhikkhave, tisso sampadā’’ti. Pañcamaṃ."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, diṭṭhisampadā? Idha, bhikkhave, ekacco sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ, atthi yiṭṭhaṃ, atthi hutaṃ, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, atthi ayaṃ loko, atthi paro loko, atthi mātā, atthi pitā, atthi sattā opapātikā, atthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhisampadā. Sīlasampadāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; cittasampadāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti ; diṭṭhisampadāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Imā kho, bhikkhave, tisso sampadā’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Apaṇṇakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "119"
      },
      ". ‘‘Tisso imā, bhikkhave, vipattiyo. Katamā tisso? Sīlavipatti, cittavipatti, diṭṭhivipatti. Katamā ca, bhikkhave, sīlavipatti? Idha, bhikkhave, ekacco pāṇātipātī hoti…pe… samphappalāpī hoti. Ayaṃ vuccati, bhikkhave, sīlavipatti."
    ],
    "innerText": "119. ‘‘Tisso imā, bhikkhave, vipattiyo. Katamā tisso? Sīlavipatti, cittavipatti, diṭṭhivipatti. Katamā ca, bhikkhave, sīlavipatti? Idha, bhikkhave, ekacco pāṇātipātī hoti…pe… samphappalāpī hoti. Ayaṃ vuccati, bhikkhave, sīlavipatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, cittavipatti? Idha, bhikkhave, ekacco abhijjhālu hoti byāpannacitto. Ayaṃ vuccati, bhikkhave, cittavipatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, diṭṭhivipatti? Idha, bhikkhave, ekacco micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ, natthi yiṭṭhaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhivipatti. Sīlavipattihetu vā, bhikkhave…pe… diṭṭhivipattihetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Seyyathāpi, bhikkhave, apaṇṇako maṇi uddhaṃ khitto yena yeneva patiṭṭhāti suppatiṭṭhitaṃyeva patiṭṭhāti; evamevaṃ kho, bhikkhave, sīlavipattihetu vā sattā…pe… upapajjanti. Imā kho, bhikkhave, tisso vipattiyoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tisso imā, bhikkhave, sampadā. Katamā tisso? Sīlasampadā, cittasampadā, diṭṭhisampadā ",
      ". Katamā ca, bhikkhave, sīlasampadā? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti…pe… ayaṃ vuccati, bhikkhave, sīlasampadā."
    ],
    "innerText": "‘‘Tisso imā, bhikkhave, sampadā. Katamā tisso? Sīlasampadā, cittasampadā, diṭṭhisampadā . Katamā ca, bhikkhave, sīlasampadā? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti…pe… ayaṃ vuccati, bhikkhave, sīlasampadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, cittasampadā? Idha, bhikkhave, ekacco anabhijjhālu hoti abyāpannacitto. Ayaṃ vuccati, bhikkhave, cittasampadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca, bhikkhave, diṭṭhisampadā? Idha, bhikkhave, ekacco sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ, atthi yiṭṭhaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhisampadā. Sīlasampadāhetu vā ",
      ", bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Cittasampadāhetu vā…pe… diṭṭhisampadāhetu ",
      " vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Seyyathāpi, bhikkhave, apaṇṇako maṇi uddhaṃ khitto yena yeneva patiṭṭhāti suppatiṭṭhitaṃyeva patiṭṭhāti; evamevaṃ kho, bhikkhave, sīlasampadāhetu vā sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti, cittasampadāhetu vā sattā…pe… diṭṭhisampadāhetu vā sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Imā kho, bhikkhave, tisso sampadā’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, diṭṭhisampadā? Idha, bhikkhave, ekacco sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ, atthi yiṭṭhaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhisampadā. Sīlasampadāhetu vā , bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Cittasampadāhetu vā…pe… diṭṭhisampadāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Seyyathāpi, bhikkhave, apaṇṇako maṇi uddhaṃ khitto yena yeneva patiṭṭhāti suppatiṭṭhitaṃyeva patiṭṭhāti; evamevaṃ kho, bhikkhave, sīlasampadāhetu vā sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti, cittasampadāhetu vā sattā…pe… diṭṭhisampadāhetu vā sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Imā kho, bhikkhave, tisso sampadā’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Kammantasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "120"
      },
      ". ‘‘Tisso imā, bhikkhave, vipattiyo. Katamā tisso? Kammantavipatti, ājīvavipatti, diṭṭhivipatti. Katamā ca, bhikkhave, kammantavipatti? Idha, bhikkhave, ekacco pāṇātipātī hoti…pe… samphappalāpī hoti ",
      ". Ayaṃ vuccati, bhikkhave, kammantavipatti."
    ],
    "innerText": "120. ‘‘Tisso imā, bhikkhave, vipattiyo. Katamā tisso? Kammantavipatti, ājīvavipatti, diṭṭhivipatti. Katamā ca, bhikkhave, kammantavipatti? Idha, bhikkhave, ekacco pāṇātipātī hoti…pe… samphappalāpī hoti . Ayaṃ vuccati, bhikkhave, kammantavipatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca, bhikkhave, ājīvavipatti? Idha, bhikkhave, ekacco micchāājīvo hoti, micchāājīvena jīvikaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[jīvitaṃ (syā. kaṃ. ka.)]"
      },
      " kappeti. Ayaṃ vuccati, bhikkhave, ājīvavipatti."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, ājīvavipatti? Idha, bhikkhave, ekacco micchāājīvo hoti, micchāājīvena jīvikaṃ [jīvitaṃ (syā. kaṃ. ka.)] kappeti. Ayaṃ vuccati, bhikkhave, ājīvavipatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca, bhikkhave, diṭṭhivipatti? Idha ",
      ", bhikkhave, ekacco micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ, natthi yiṭṭhaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhivipatti. Imā kho, bhikkhave, tisso vipattiyoti."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, diṭṭhivipatti? Idha , bhikkhave, ekacco micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ, natthi yiṭṭhaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhivipatti. Imā kho, bhikkhave, tisso vipattiyoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tisso imā, bhikkhave, sampadā. Katamā tisso? Kammantasampadā, ājīvasampadā, diṭṭhisampadā. Katamā ca, bhikkhave, kammantasampadā? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti…pe… samphappalāpā paṭivirato hoti. Ayaṃ vuccati, bhikkhave, kammantasampadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ",
      " ca, bhikkhave, ājīvasampadā? Idha, bhikkhave, ekacco sammāājīvo hoti, sammāājīvena jīvikaṃ kappeti. Ayaṃ vuccati, bhikkhave, ājīvasampadā."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, ājīvasampadā? Idha, bhikkhave, ekacco sammāājīvo hoti, sammāājīvena jīvikaṃ kappeti. Ayaṃ vuccati, bhikkhave, ājīvasampadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca, bhikkhave, diṭṭhisampadā? Idha, bhikkhave, ekacco sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ, atthi yiṭṭhaṃ…pe… ye imañca lokaṃ parañca ",
      " lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhisampadā. Imā kho, bhikkhave, tisso sampadā’’ti. Sattamaṃ."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, diṭṭhisampadā? Idha, bhikkhave, ekacco sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ, atthi yiṭṭhaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhisampadā. Imā kho, bhikkhave, tisso sampadā’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Paṭhamasoceyyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "121"
      },
      ". ‘‘Tīṇimāni, bhikkhave, soceyyāni. Katamāni tīṇi? Kāyasoceyyaṃ, vacīsoceyyaṃ, manosoceyyaṃ. Katamañca, bhikkhave, kāyasoceyyaṃ? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato ",
      " hoti, kāmesumicchācārā paṭivirato hoti. Idaṃ vuccati, bhikkhave, kāyasoceyyaṃ."
    ],
    "innerText": "121. ‘‘Tīṇimāni, bhikkhave, soceyyāni. Katamāni tīṇi? Kāyasoceyyaṃ, vacīsoceyyaṃ, manosoceyyaṃ. Katamañca, bhikkhave, kāyasoceyyaṃ? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti. Idaṃ vuccati, bhikkhave, kāyasoceyyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamañca, bhikkhave, vacīsoceyyaṃ? Idha, bhikkhave, ekacco musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti. Idaṃ vuccati bhikkhave, vacīsoceyyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamañca, bhikkhave, manosoceyyaṃ? Idha, bhikkhave, ekacco anabhijjhālu hoti abyāpannacitto sammādiṭṭhiko. Idaṃ ",
      " vuccati, bhikkhave, manosoceyyaṃ. Imāni kho, bhikkhave, tīṇi soceyyānī’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "‘‘Katamañca, bhikkhave, manosoceyyaṃ? Idha, bhikkhave, ekacco anabhijjhālu hoti abyāpannacitto sammādiṭṭhiko. Idaṃ vuccati, bhikkhave, manosoceyyaṃ. Imāni kho, bhikkhave, tīṇi soceyyānī’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Dutiyasoceyyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "122"
      },
      ". ‘‘Tīṇimāni, bhikkhave, soceyyāni. Katamāni tīṇi? Kāyasoceyyaṃ, vacīsoceyyaṃ, manosoceyyaṃ. Katamañca, bhikkhave, kāyasoceyyaṃ? Idha, bhikkhave, bhikkhu pāṇātipātā ",
      " paṭivirato hoti, adinnādānā paṭivirato hoti, abrahmacariyā paṭivirato hoti. Idaṃ vuccati, bhikkhave, kāyasoceyyaṃ."
    ],
    "innerText": "122. ‘‘Tīṇimāni, bhikkhave, soceyyāni. Katamāni tīṇi? Kāyasoceyyaṃ, vacīsoceyyaṃ, manosoceyyaṃ. Katamañca, bhikkhave, kāyasoceyyaṃ? Idha, bhikkhave, bhikkhu pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, abrahmacariyā paṭivirato hoti. Idaṃ vuccati, bhikkhave, kāyasoceyyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamañca, bhikkhave, vacīsoceyyaṃ? Idha, bhikkhave, bhikkhu musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti. Idaṃ vuccati, bhikkhave, vacīsoceyyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamañca, bhikkhave, manosoceyyaṃ? Idha, bhikkhave, bhikkhu santaṃ vā ajjhattaṃ kāmacchandaṃ – ‘atthi me ajjhattaṃ kāmacchando’ti pajānāti; asantaṃ vā ajjhattaṃ kāmacchandaṃ – ‘natthi me ajjhattaṃ kāmacchando’ti pajānāti; yathā ca anuppannassa kāmacchandassa ",
      " uppādo hoti, tañca pajānāti; yathā ca uppannassa kāmacchandassa pahānaṃ hoti ",
      ", tañca pajānāti; yathā ca pahīnassa kāmacchandassa āyatiṃ anuppādo hoti, tañca pajānāti; santaṃ vā ajjhattaṃ byāpādaṃ – ‘atthi me ajjhattaṃ byāpādo’ti pajānāti; asantaṃ vā ajjhattaṃ byāpādaṃ – ‘natthi me ajjhattaṃ byāpādo’ti pajānāti; yathā ca anuppannassa byāpādassa uppādo hoti, tañca pajānāti; yathā ca uppannassa byāpādassa pahānaṃ hoti, tañca pajānāti; yathā ca pahīnassa byāpādassa āyatiṃ anuppādo hoti, tañca pajānāti; santaṃ vā ajjhattaṃ thinamiddhaṃ – ‘atthi me ajjhattaṃ thinamiddha’nti pajānāti; asantaṃ vā ajjhattaṃ thinamiddhaṃ – ‘natthi me ajjhattaṃ thinamiddha’nti pajānāti; yathā ca anuppannassa thinamiddhassa uppādo hoti, tañca pajānāti; yathā ca uppannassa thinamiddhassa pahānaṃ hoti, tañca pajānāti; yathā ca pahīnassa thinamiddhassa āyatiṃ anuppādo hoti, tañca pajānāti; santaṃ vā ajjhattaṃ uddhaccakukkuccaṃ – ‘atthi me ajjhattaṃ uddhaccakukkucca’nti pajānāti; asantaṃ vā ajjhattaṃ ",
      " uddhaccakukkuccaṃ – ‘natthi me ajjhattaṃ uddhaccakukkucca’nti pajānāti; yathā ca anuppannassa uddhaccakukkuccassa uppādo hoti, tañca pajānāti; yathā ca uppannassa uddhaccakukkuccassa pahānaṃ hoti, tañca pajānāti; yathā ca pahīnassa uddhaccakukkuccassa āyatiṃ anuppādo hoti, tañca pajānāti; santaṃ vā ajjhattaṃ vicikicchaṃ – ‘atthi me ajjhattaṃ vicikicchā’ti pajānāti; asantaṃ vā ajjhattaṃ vicikicchaṃ – ‘natthi me ajjhattaṃ ",
      " vicikicchā’ti pajānāti; yathā ca anuppannāya vicikicchāya uppādo hoti, tañca pajānāti; yathā ca uppannāya vicikicchāya pahānaṃ hoti, tañca ",
      " pajānāti; yathā ca pahīnāya vicikicchāya āyatiṃ anuppādo hoti, tañca pajānāti. Idaṃ vuccati, bhikkhave, manosoceyyaṃ. Imāni kho, bhikkhave, tīṇi soceyyānīti."
    ],
    "innerText": "‘‘Katamañca, bhikkhave, manosoceyyaṃ? Idha, bhikkhave, bhikkhu santaṃ vā ajjhattaṃ kāmacchandaṃ – ‘atthi me ajjhattaṃ kāmacchando’ti pajānāti; asantaṃ vā ajjhattaṃ kāmacchandaṃ – ‘natthi me ajjhattaṃ kāmacchando’ti pajānāti; yathā ca anuppannassa kāmacchandassa uppādo hoti, tañca pajānāti; yathā ca uppannassa kāmacchandassa pahānaṃ hoti , tañca pajānāti; yathā ca pahīnassa kāmacchandassa āyatiṃ anuppādo hoti, tañca pajānāti; santaṃ vā ajjhattaṃ byāpādaṃ – ‘atthi me ajjhattaṃ byāpādo’ti pajānāti; asantaṃ vā ajjhattaṃ byāpādaṃ – ‘natthi me ajjhattaṃ byāpādo’ti pajānāti; yathā ca anuppannassa byāpādassa uppādo hoti, tañca pajānāti; yathā ca uppannassa byāpādassa pahānaṃ hoti, tañca pajānāti; yathā ca pahīnassa byāpādassa āyatiṃ anuppādo hoti, tañca pajānāti; santaṃ vā ajjhattaṃ thinamiddhaṃ – ‘atthi me ajjhattaṃ thinamiddha’nti pajānāti; asantaṃ vā ajjhattaṃ thinamiddhaṃ – ‘natthi me ajjhattaṃ thinamiddha’nti pajānāti; yathā ca anuppannassa thinamiddhassa uppādo hoti, tañca pajānāti; yathā ca uppannassa thinamiddhassa pahānaṃ hoti, tañca pajānāti; yathā ca pahīnassa thinamiddhassa āyatiṃ anuppādo hoti, tañca pajānāti; santaṃ vā ajjhattaṃ uddhaccakukkuccaṃ – ‘atthi me ajjhattaṃ uddhaccakukkucca’nti pajānāti; asantaṃ vā ajjhattaṃ uddhaccakukkuccaṃ – ‘natthi me ajjhattaṃ uddhaccakukkucca’nti pajānāti; yathā ca anuppannassa uddhaccakukkuccassa uppādo hoti, tañca pajānāti; yathā ca uppannassa uddhaccakukkuccassa pahānaṃ hoti, tañca pajānāti; yathā ca pahīnassa uddhaccakukkuccassa āyatiṃ anuppādo hoti, tañca pajānāti; santaṃ vā ajjhattaṃ vicikicchaṃ – ‘atthi me ajjhattaṃ vicikicchā’ti pajānāti; asantaṃ vā ajjhattaṃ vicikicchaṃ – ‘natthi me ajjhattaṃ vicikicchā’ti pajānāti; yathā ca anuppannāya vicikicchāya uppādo hoti, tañca pajānāti; yathā ca uppannāya vicikicchāya pahānaṃ hoti, tañca pajānāti; yathā ca pahīnāya vicikicchāya āyatiṃ anuppādo hoti, tañca pajānāti. Idaṃ vuccati, bhikkhave, manosoceyyaṃ. Imāni kho, bhikkhave, tīṇi soceyyānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[itivu. 66]"
      },
      " ‘‘Kāyasuciṃ vacīsuciṃ, cetosuciṃ anāsavaṃ;"
    ],
    "innerText": "[itivu. 66] ‘‘Kāyasuciṃ vacīsuciṃ, cetosuciṃ anāsavaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Suciṃ soceyyasampannaṃ, āhu ninhātapāpaka’’nti. navamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Moneyyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "123"
      },
      ". ‘‘Tīṇimāni, bhikkhave, moneyyāni. Katamāni tīṇi? Kāyamoneyyaṃ, vacīmoneyyaṃ, manomoneyyaṃ. Katamañca, bhikkhave, kāyamoneyyaṃ ",
      "? Idha, bhikkhave, bhikkhu pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, abrahmacariyā paṭivirato hoti. Idaṃ vuccati, bhikkhave, kāyamoneyyaṃ."
    ],
    "innerText": "123. ‘‘Tīṇimāni, bhikkhave, moneyyāni. Katamāni tīṇi? Kāyamoneyyaṃ, vacīmoneyyaṃ, manomoneyyaṃ. Katamañca, bhikkhave, kāyamoneyyaṃ ? Idha, bhikkhave, bhikkhu pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, abrahmacariyā paṭivirato hoti. Idaṃ vuccati, bhikkhave, kāyamoneyyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamañca, bhikkhave, vacīmoneyyaṃ? Idha, bhikkhave, bhikkhu musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti. Idaṃ vuccati, bhikkhave, vacīmoneyyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamañca, bhikkhave, manomoneyyaṃ? Idha, bhikkhave, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Idaṃ vuccati, bhikkhave, manomoneyyaṃ. Imāni kho, bhikkhave, tīṇi moneyyānī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kāyamuniṃ vacīmuniṃ, cetomuniṃ anāsavaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Muniṃ moneyyasampannaṃ, āhu sabbappahāyina’’nti. dasamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Āpāyikavaggo dvādasamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Āpāyiko ",
      " dullabho appameyyaṃ, āneñjavipattisampadā;"
    ],
    "innerText": "Āpāyiko dullabho appameyyaṃ, āneñjavipattisampadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Apaṇṇako ca kammanto, dve soceyyāni moneyyanti."
  }
]