[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(20) 5. Mahāvaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Sotānugatasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "191"
      },
      ". ‘‘Sotānugatānaṃ ",
      ", bhikkhave, dhammānaṃ, vacasā paricitānaṃ, manasānupekkhitānaṃ, diṭṭhiyā suppaṭividdhānaṃ cattāro ānisaṃsā pāṭikaṅkhā. Katame ",
      " cattāro? Idha, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[muṭṭhassatī (sī.)]"
      },
      " kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha sukhino dhammapadā plavanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pilapanti (sī. syā. kaṃ. pī.)]"
      },
      ". Dandho, bhikkhave, satuppādo; atha so satto khippaṃyeva visesagāmī hoti. Sotānugatānaṃ, bhikkhave, dhammānaṃ, vacasā paricitānaṃ, manasānupekkhitānaṃ, diṭṭhiyā suppaṭividdhānaṃ ayaṃ paṭhamo ānisaṃso pāṭikaṅkho."
    ],
    "innerText": "191. ‘‘Sotānugatānaṃ , bhikkhave, dhammānaṃ, vacasā paricitānaṃ, manasānupekkhitānaṃ, diṭṭhiyā suppaṭividdhānaṃ cattāro ānisaṃsā pāṭikaṅkhā. Katame cattāro? Idha, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati [muṭṭhassatī (sī.)] kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha sukhino dhammapadā plavanti [pilapanti (sī. syā. kaṃ. pī.)]. Dandho, bhikkhave, satuppādo; atha so satto khippaṃyeva visesagāmī hoti. Sotānugatānaṃ, bhikkhave, dhammānaṃ, vacasā paricitānaṃ, manasānupekkhitānaṃ, diṭṭhiyā suppaṭividdhānaṃ ayaṃ paṭhamo ānisaṃso pāṭikaṅkho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti; api ",
      " ca kho bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti. Tassa evaṃ hoti – ‘ayaṃ vā so dhammavinayo, yatthāhaṃ pubbe brahmacariyaṃ acari’nti. Dandho, bhikkhave, satuppādo; atha so satto khippameva visesagāmī hoti. Seyyathāpi, bhikkhave, puriso kusalo bherisaddassa. So addhānamaggappaṭipanno bherisaddaṃ suṇeyya. Tassa na heva kho assa kaṅkhā vā vimati vā – ‘bherisaddo nu kho, na nu kho bherisaddo’ti! Atha kho bherisaddotveva niṭṭhaṃ gaccheyya. Evamevaṃ kho, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti ",
      " – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti; api ca ",
      " kho bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti. Tassa evaṃ hoti – ‘ayaṃ vā so dhammavinayo, yatthāhaṃ pubbe brahmacariyaṃ acari’nti. Dandho, bhikkhave, satuppādo; atha so satto khippaṃyeva visesagāmī hoti. Sotānugatānaṃ, bhikkhave, dhammānaṃ ",
      ", vacasā paricitānaṃ, manasānupekkhitānaṃ, diṭṭhiyā suppaṭividdhānaṃ ayaṃ dutiyo ānisaṃso pāṭikaṅkho."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti; api ca kho bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti. Tassa evaṃ hoti – ‘ayaṃ vā so dhammavinayo, yatthāhaṃ pubbe brahmacariyaṃ acari’nti. Dandho, bhikkhave, satuppādo; atha so satto khippameva visesagāmī hoti. Seyyathāpi, bhikkhave, puriso kusalo bherisaddassa. So addhānamaggappaṭipanno bherisaddaṃ suṇeyya. Tassa na heva kho assa kaṅkhā vā vimati vā – ‘bherisaddo nu kho, na nu kho bherisaddo’ti! Atha kho bherisaddotveva niṭṭhaṃ gaccheyya. Evamevaṃ kho, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti; api ca kho bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti. Tassa evaṃ hoti – ‘ayaṃ vā so dhammavinayo, yatthāhaṃ pubbe brahmacariyaṃ acari’nti. Dandho, bhikkhave, satuppādo; atha so satto khippaṃyeva visesagāmī hoti. Sotānugatānaṃ, bhikkhave, dhammānaṃ , vacasā paricitānaṃ, manasānupekkhitānaṃ, diṭṭhiyā suppaṭividdhānaṃ ayaṃ dutiyo ānisaṃso pāṭikaṅkho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti, napi bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti; api ca kho devaputto devaparisāyaṃ dhammaṃ deseti. Tassa evaṃ hoti – ‘ayaṃ vā so dhammavinayo, yatthāhaṃ pubbe brahmacariyaṃ acari’nti. Dandho, bhikkhave, satuppādo; atha so satto khippaṃyeva visesagāmī hoti. Seyyathāpi, bhikkhave, puriso kusalo saṅkhasaddassa. So addhānamaggappaṭipanno saṅkhasaddaṃ suṇeyya. Tassa na heva kho assa kaṅkhā vā vimati ",
      " vā – ‘saṅkhasaddo nu kho, na nu kho saṅkhasaddo’ti! Atha kho saṅkhasaddotveva niṭṭhaṃ gaccheyya. Evamevaṃ kho, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti, napi bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti; api ca kho devaputto devaparisāyaṃ dhammaṃ deseti. Tassa evaṃ hoti – ‘ayaṃ vā so dhammavinayo, yatthāhaṃ pubbe brahmacariyaṃ acari’nti. Dandho, bhikkhave, satuppādo; atha so satto khippaṃyeva visesagāmī hoti. Sotānugatānaṃ, bhikkhave, dhammānaṃ, vacasā paricitānaṃ, manasānupekkhitānaṃ, diṭṭhiyā suppaṭividdhānaṃ ayaṃ tatiyo ānisaṃso pāṭikaṅkho."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti, napi bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti; api ca kho devaputto devaparisāyaṃ dhammaṃ deseti. Tassa evaṃ hoti – ‘ayaṃ vā so dhammavinayo, yatthāhaṃ pubbe brahmacariyaṃ acari’nti. Dandho, bhikkhave, satuppādo; atha so satto khippaṃyeva visesagāmī hoti. Seyyathāpi, bhikkhave, puriso kusalo saṅkhasaddassa. So addhānamaggappaṭipanno saṅkhasaddaṃ suṇeyya. Tassa na heva kho assa kaṅkhā vā vimati vā – ‘saṅkhasaddo nu kho, na nu kho saṅkhasaddo’ti! Atha kho saṅkhasaddotveva niṭṭhaṃ gaccheyya. Evamevaṃ kho, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti, napi bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti; api ca kho devaputto devaparisāyaṃ dhammaṃ deseti. Tassa evaṃ hoti – ‘ayaṃ vā so dhammavinayo, yatthāhaṃ pubbe brahmacariyaṃ acari’nti. Dandho, bhikkhave, satuppādo; atha so satto khippaṃyeva visesagāmī hoti. Sotānugatānaṃ, bhikkhave, dhammānaṃ, vacasā paricitānaṃ, manasānupekkhitānaṃ, diṭṭhiyā suppaṭividdhānaṃ ayaṃ tatiyo ānisaṃso pāṭikaṅkho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti, napi bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti, napi devaputto devaparisāyaṃ ",
      " dhammaṃ deseti; api ca kho opapātiko opapātikaṃ sāreti – ‘sarasi tvaṃ, mārisa, sarasi tvaṃ ",
      ", mārisa, yattha mayaṃ pubbe brahmacariyaṃ acarimhā’ti. So evamāha – ‘sarāmi, mārisa, sarāmi, mārisā’ti. Dandho, bhikkhave, satuppādo; atha so satto khippaṃyeva visesagāmī hoti. Seyyathāpi, bhikkhave, dve sahāyakā sahapaṃsukīḷikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sahapaṃsukīḷakā (syā. kaṃ.)]"
      },
      ". Te kadāci karahaci aññamaññaṃ samāgaccheyyuṃ. Añño pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samāgaccheyyuṃ, tamenaṃ (sī. syā. kaṃ. pī.)]"
      },
      " sahāyako sahāyakaṃ evaṃ vadeyya – ‘idampi, samma, sarasi, idampi, samma, sarasī’ti. So evaṃ vadeyya – ‘sarāmi ",
      ", samma, sarāmi, sammā’ti. Evamevaṃ kho, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti, napi bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti, napi devaputto devaparisāyaṃ dhammaṃ deseti; api ca kho opapātiko opapātikaṃ sāreti – ‘sarasi tvaṃ, mārisa, sarasi tvaṃ, mārisa, yattha mayaṃ pubbe brahmacariyaṃ acarimhā’ti. So evamāha – ‘sarāmi, mārisa, sarāmi, mārisā’ti. Dandho, bhikkhave, satuppādo; atha kho so satto khippaṃyeva ",
      " visesagāmī hoti. Sotānugatānaṃ, bhikkhave, dhammānaṃ, vacasā paricitānaṃ, manasānupekkhitānaṃ, diṭṭhiyā suppaṭividdhānaṃ ayaṃ catuttho ānisaṃso pāṭikaṅkho. Sotānugatānaṃ, bhikkhave, dhammānaṃ, vacasā paricitānaṃ, manasānupekkhitānaṃ diṭṭhiyā suppaṭividdhānaṃ ime cattāro ānisaṃsā pāṭikaṅkhā’’ti. Paṭhamaṃ."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti, napi bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti, napi devaputto devaparisāyaṃ dhammaṃ deseti; api ca kho opapātiko opapātikaṃ sāreti – ‘sarasi tvaṃ, mārisa, sarasi tvaṃ , mārisa, yattha mayaṃ pubbe brahmacariyaṃ acarimhā’ti. So evamāha – ‘sarāmi, mārisa, sarāmi, mārisā’ti. Dandho, bhikkhave, satuppādo; atha so satto khippaṃyeva visesagāmī hoti. Seyyathāpi, bhikkhave, dve sahāyakā sahapaṃsukīḷikā [sahapaṃsukīḷakā (syā. kaṃ.)]. Te kadāci karahaci aññamaññaṃ samāgaccheyyuṃ. Añño pana [samāgaccheyyuṃ, tamenaṃ (sī. syā. kaṃ. pī.)] sahāyako sahāyakaṃ evaṃ vadeyya – ‘idampi, samma, sarasi, idampi, samma, sarasī’ti. So evaṃ vadeyya – ‘sarāmi , samma, sarāmi, sammā’ti. Evamevaṃ kho, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti, napi bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti, napi devaputto devaparisāyaṃ dhammaṃ deseti; api ca kho opapātiko opapātikaṃ sāreti – ‘sarasi tvaṃ, mārisa, sarasi tvaṃ, mārisa, yattha mayaṃ pubbe brahmacariyaṃ acarimhā’ti. So evamāha – ‘sarāmi, mārisa, sarāmi, mārisā’ti. Dandho, bhikkhave, satuppādo; atha kho so satto khippaṃyeva visesagāmī hoti. Sotānugatānaṃ, bhikkhave, dhammānaṃ, vacasā paricitānaṃ, manasānupekkhitānaṃ, diṭṭhiyā suppaṭividdhānaṃ ayaṃ catuttho ānisaṃso pāṭikaṅkho. Sotānugatānaṃ, bhikkhave, dhammānaṃ, vacasā paricitānaṃ, manasānupekkhitānaṃ diṭṭhiyā suppaṭividdhānaṃ ime cattāro ānisaṃsā pāṭikaṅkhā’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Ṭhānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "192"
      },
      ". ‘‘Cattārimāni, bhikkhave, ṭhānāni catūhi ṭhānehi veditabbāni. Katamāni cattāri? Saṃvāsena, bhikkhave, sīlaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññena. Saṃvohārena, bhikkhave, soceyyaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññena. Āpadāsu, bhikkhave, thāmo veditabbo, so ca kho dīghena addhunā ",
      ", na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññena. Sākacchāya, bhikkhave, paññā veditabbā, sā ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenāti."
    ],
    "innerText": "192. ‘‘Cattārimāni, bhikkhave, ṭhānāni catūhi ṭhānehi veditabbāni. Katamāni cattāri? Saṃvāsena, bhikkhave, sīlaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññena. Saṃvohārena, bhikkhave, soceyyaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññena. Āpadāsu, bhikkhave, thāmo veditabbo, so ca kho dīghena addhunā , na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññena. Sākacchāya, bhikkhave, paññā veditabbā, sā ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṃ. ni. 1.122]"
      },
      " ‘‘‘Saṃvāsena ",
      ", bhikkhave, sīlaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, puggalo puggalena saddhiṃ saṃvasamāno evaṃ jānāti – ‘dīgharattaṃ kho ayamāyasmā khaṇḍakārī chiddakārī sabalakārī kammāsakārī, na santatakārī na santatavutti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[satatavutti (syā. kaṃ.)]"
      },
      "; sīlesu dussīlo ayamāyasmā, nāyamāyasmā ",
      " sīlavā’’’ti."
    ],
    "innerText": "[saṃ. ni. 1.122] ‘‘‘Saṃvāsena , bhikkhave, sīlaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, puggalo puggalena saddhiṃ saṃvasamāno evaṃ jānāti – ‘dīgharattaṃ kho ayamāyasmā khaṇḍakārī chiddakārī sabalakārī kammāsakārī, na santatakārī na santatavutti [satatavutti (syā. kaṃ.)]; sīlesu dussīlo ayamāyasmā, nāyamāyasmā sīlavā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Idha pana, bhikkhave, puggalo puggalena saddhiṃ saṃvasamāno evaṃ jānāti – ‘dīgharattaṃ kho ayamāyasmā akhaṇḍakārī acchiddakārī asabalakārī akammāsakārī santatakārī ",
      " santatavutti; sīlesu sīlavā ayamāyasmā, nāyamāyasmā dussīlo’ti. ‘Saṃvāsena, bhikkhave, sīlaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘‘Idha pana, bhikkhave, puggalo puggalena saddhiṃ saṃvasamāno evaṃ jānāti – ‘dīgharattaṃ kho ayamāyasmā akhaṇḍakārī acchiddakārī asabalakārī akammāsakārī santatakārī santatavutti; sīlesu sīlavā ayamāyasmā, nāyamāyasmā dussīlo’ti. ‘Saṃvāsena, bhikkhave, sīlaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Saṃvohārena, bhikkhave, soceyyaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, puggalo puggalena saddhiṃ saṃvoharamāno evaṃ jānāti – ‘aññathā kho ayamāyasmā ekena eko voharati, aññathā dvīhi, aññathā tīhi, aññathā sambahulehi; vokkamati ayamāyasmā purimavohārā pacchimavohāraṃ; aparisuddhavohāro ayamāyasmā, nāyamāyasmā parisuddhavohāro’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, puggalo puggalena saddhiṃ saṃvoharamāno evaṃ jānāti – ‘yatheva kho ayamāyasmā ekena eko voharati, tathā dvīhi, tathā tīhi, tathā sambahulehi. Nāyamāyasmā vokkamati purimavohārā pacchimavohāraṃ; parisuddhavohāro ayamāyasmā, nāyamāyasmā aparisuddhavohāro’ti ",
      ". ‘Saṃvohārena, bhikkhave, soceyyaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti yaṃ taṃ vuttaṃ ",
      " idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, puggalo puggalena saddhiṃ saṃvoharamāno evaṃ jānāti – ‘yatheva kho ayamāyasmā ekena eko voharati, tathā dvīhi, tathā tīhi, tathā sambahulehi. Nāyamāyasmā vokkamati purimavohārā pacchimavohāraṃ; parisuddhavohāro ayamāyasmā, nāyamāyasmā aparisuddhavohāro’ti . ‘Saṃvohārena, bhikkhave, soceyyaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Āpadāsu, bhikkhave, thāmo veditabbo, so ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ ",
      " paṭicca vuttaṃ? Idha, bhikkhave, ekacco ñātibyasanena vā phuṭṭho samāno, bhogabyasanena vā phuṭṭho samāno, rogabyasanena vā phuṭṭho samāno na iti paṭisañcikkhati – ‘tathābhūto kho ayaṃ lokasannivāso tathābhūto ayaṃ attabhāvapaṭilābho yathābhūte lokasannivāse yathābhūte attabhāvapaṭilābhe aṭṭha lokadhammā lokaṃ anuparivattanti loko ca aṭṭha lokadhamme anuparivattati – lābho ca, alābho ca, yaso ca, ayaso ca, nindā ca, pasaṃsā ca, sukhañca, dukkhañcā’ti. So ñātibyasanena vā phuṭṭho samāno bhogabyasanena vā phuṭṭho samāno rogabyasanena vā phuṭṭho samāno socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati."
    ],
    "innerText": "‘‘‘Āpadāsu, bhikkhave, thāmo veditabbo, so ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, ekacco ñātibyasanena vā phuṭṭho samāno, bhogabyasanena vā phuṭṭho samāno, rogabyasanena vā phuṭṭho samāno na iti paṭisañcikkhati – ‘tathābhūto kho ayaṃ lokasannivāso tathābhūto ayaṃ attabhāvapaṭilābho yathābhūte lokasannivāse yathābhūte attabhāvapaṭilābhe aṭṭha lokadhammā lokaṃ anuparivattanti loko ca aṭṭha lokadhamme anuparivattati – lābho ca, alābho ca, yaso ca, ayaso ca, nindā ca, pasaṃsā ca, sukhañca, dukkhañcā’ti. So ñātibyasanena vā phuṭṭho samāno bhogabyasanena vā phuṭṭho samāno rogabyasanena vā phuṭṭho samāno socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, ekacco ñātibyasanena vā phuṭṭho samāno bhogabyasanena vā phuṭṭho samāno rogabyasanena ",
      " vā phuṭṭho samāno iti paṭisañcikkhati – ‘tathābhūto kho ayaṃ lokasannivāso tathābhūto ayaṃ attabhāvapaṭilābho yathābhūte lokasannivāse yathābhūte attabhāvapaṭilābhe aṭṭha lokadhammā lokaṃ anuparivattanti loko ca aṭṭha lokadhamme anuparivattati – lābho ca, alābho ca, yaso ca, ayaso ca, nindā ca, pasaṃsā ca, sukhañca, dukkhañcā’ti. So ñātibyasanena vā phuṭṭho samāno bhogabyasanena vā ",
      " phuṭṭho samāno rogabyasanena vā phuṭṭho samāno na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. ‘Āpadāsu, bhikkhave, thāmo veditabbo, so ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, ekacco ñātibyasanena vā phuṭṭho samāno bhogabyasanena vā phuṭṭho samāno rogabyasanena vā phuṭṭho samāno iti paṭisañcikkhati – ‘tathābhūto kho ayaṃ lokasannivāso tathābhūto ayaṃ attabhāvapaṭilābho yathābhūte lokasannivāse yathābhūte attabhāvapaṭilābhe aṭṭha lokadhammā lokaṃ anuparivattanti loko ca aṭṭha lokadhamme anuparivattati – lābho ca, alābho ca, yaso ca, ayaso ca, nindā ca, pasaṃsā ca, sukhañca, dukkhañcā’ti. So ñātibyasanena vā phuṭṭho samāno bhogabyasanena vā phuṭṭho samāno rogabyasanena vā phuṭṭho samāno na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. ‘Āpadāsu, bhikkhave, thāmo veditabbo, so ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Sākacchāya, bhikkhave, paññā veditabbā, sā ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti ",
      ", iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, puggalo puggalena saddhiṃ sākacchāyamāno evaṃ jānāti – ‘yathā kho imassa āyasmato ummaggo yathā ca abhinīhāro yathā ca pañhāsamudāhāro, duppañño ayamāyasmā, nāyamāyasmā paññavā. Taṃ kissa hetu? Tathā hi ayamāyasmā na ceva gambhīraṃ atthapadaṃ udāharati santaṃ paṇītaṃ atakkāvacaraṃ nipuṇaṃ paṇḍitavedanīyaṃ. Yañca ayamāyasmā dhammaṃ bhāsati tassa ca nappaṭibalo saṃkhittena vā vitthārena ",
      " vā atthaṃ ācikkhituṃ desetuṃ paññāpetuṃ paṭṭhapetuṃ vivarituṃ vibhajituṃ uttānīkātuṃ. Duppañño ayamāyasmā, nāyamāyasmā paññavā’’’ti."
    ],
    "innerText": "‘‘‘Sākacchāya, bhikkhave, paññā veditabbā, sā ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti , iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, puggalo puggalena saddhiṃ sākacchāyamāno evaṃ jānāti – ‘yathā kho imassa āyasmato ummaggo yathā ca abhinīhāro yathā ca pañhāsamudāhāro, duppañño ayamāyasmā, nāyamāyasmā paññavā. Taṃ kissa hetu? Tathā hi ayamāyasmā na ceva gambhīraṃ atthapadaṃ udāharati santaṃ paṇītaṃ atakkāvacaraṃ nipuṇaṃ paṇḍitavedanīyaṃ. Yañca ayamāyasmā dhammaṃ bhāsati tassa ca nappaṭibalo saṃkhittena vā vitthārena vā atthaṃ ācikkhituṃ desetuṃ paññāpetuṃ paṭṭhapetuṃ vivarituṃ vibhajituṃ uttānīkātuṃ. Duppañño ayamāyasmā, nāyamāyasmā paññavā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, cakkhumā puriso udakarahadassa tīre ṭhito passeyya parittaṃ macchaṃ ummujjamānaṃ. Tassa evamassa – ‘yathā kho imassa macchassa ummaggo yathā ca ūmighāto yathā ca vegāyitattaṃ, paritto ayaṃ ",
      " maccho, nāyaṃ maccho mahanto’ti. Evamevaṃ kho, bhikkhave, puggalo puggalena saddhiṃ sākacchāyamāno evaṃ jānāti – ‘yathā kho imassa āyasmato ummaggo yathā ca abhinīhāro yathā ca pañhāsamudāhāro, duppañño ayamāyasmā, nāyamāyasmā paññavā. Taṃ kissa hetu? Tathā hi ayamāyasmā na ceva gambhīraṃ atthapadaṃ udāharati santaṃ paṇītaṃ atakkāvacaraṃ nipuṇaṃ paṇḍitavedanīyaṃ. Yañca ayamāyasmā dhammaṃ bhāsati, tassa ca na paṭibalo saṃkhittena vā vitthārena vā atthaṃ ācikkhituṃ desetuṃ paññāpetuṃ paṭṭhapetuṃ vivarituṃ vibhajituṃ uttānīkātuṃ. Duppañño ayamāyasmā, nāyamāyasmā paññavā’’’ti."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, cakkhumā puriso udakarahadassa tīre ṭhito passeyya parittaṃ macchaṃ ummujjamānaṃ. Tassa evamassa – ‘yathā kho imassa macchassa ummaggo yathā ca ūmighāto yathā ca vegāyitattaṃ, paritto ayaṃ maccho, nāyaṃ maccho mahanto’ti. Evamevaṃ kho, bhikkhave, puggalo puggalena saddhiṃ sākacchāyamāno evaṃ jānāti – ‘yathā kho imassa āyasmato ummaggo yathā ca abhinīhāro yathā ca pañhāsamudāhāro, duppañño ayamāyasmā, nāyamāyasmā paññavā. Taṃ kissa hetu? Tathā hi ayamāyasmā na ceva gambhīraṃ atthapadaṃ udāharati santaṃ paṇītaṃ atakkāvacaraṃ nipuṇaṃ paṇḍitavedanīyaṃ. Yañca ayamāyasmā dhammaṃ bhāsati, tassa ca na paṭibalo saṃkhittena vā vitthārena vā atthaṃ ācikkhituṃ desetuṃ paññāpetuṃ paṭṭhapetuṃ vivarituṃ vibhajituṃ uttānīkātuṃ. Duppañño ayamāyasmā, nāyamāyasmā paññavā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha pana, bhikkhave, puggalo puggalena saddhiṃ sākacchāyamāno evaṃ jānāti – ‘yathā kho imassa āyasmato ummaggo yathā ca abhinīhāro yathā ca pañhāsamudāhāro, paññavā ayamāyasmā, nāyamāyasmā duppañño. Taṃ kissa hetu? Tathā hi ayamāyasmā gambhīrañceva atthapadaṃ udāharati santaṃ paṇītaṃ atakkāvacaraṃ nipuṇaṃ paṇḍitavedanīyaṃ. Yañca ayamāyasmā dhammaṃ bhāsati, tassa ca paṭibalo saṃkhittena vā vitthārena vā atthaṃ ācikkhituṃ desetuṃ paññāpetuṃ paṭṭhapetuṃ vivarituṃ vibhajituṃ uttānīkātuṃ. Paññavā ayamāyasmā, nāyamāyasmā duppañño’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi ",
      ", bhikkhave, cakkhumā puriso udakarahadassa tīre ṭhito passeyya mahantaṃ macchaṃ ummujjamānaṃ. Tassa evamassa ",
      " – ‘yathā kho imassa macchassa ummaggo yathā ca ūmighāto yathā ca vegāyitattaṃ, mahanto ayaṃ maccho, nāyaṃ maccho paritto’ti. Evamevaṃ kho, bhikkhave, puggalo puggalena saddhiṃ sākacchāyamāno evaṃ jānāti – ‘yathā kho imassa āyasmato ummaggo yathā ca abhinīhāro yathā ca pañhāsamudāhāro, paññavā ayamāyasmā, nāyamāyasmā duppañño. Taṃ kissa hetu? Tathā hi ayamāyasmā gambhīrañceva atthapadaṃ udāharati ",
      " santaṃ paṇītaṃ atakkāvacaraṃ nipuṇaṃ paṇḍitavedanīyaṃ. Yañca ayamāyasmā dhammaṃ bhāsati, tassa ca paṭibalo saṃkhittena vā vitthārena vā atthaṃ ācikkhituṃ desetuṃ paññāpetuṃ paṭṭhapetuṃ vivarituṃ vibhajituṃ uttānīkātuṃ. Paññavā ayamāyasmā, nāyamāyasmā duppañño’ti."
    ],
    "innerText": "‘‘Seyyathāpi , bhikkhave, cakkhumā puriso udakarahadassa tīre ṭhito passeyya mahantaṃ macchaṃ ummujjamānaṃ. Tassa evamassa – ‘yathā kho imassa macchassa ummaggo yathā ca ūmighāto yathā ca vegāyitattaṃ, mahanto ayaṃ maccho, nāyaṃ maccho paritto’ti. Evamevaṃ kho, bhikkhave, puggalo puggalena saddhiṃ sākacchāyamāno evaṃ jānāti – ‘yathā kho imassa āyasmato ummaggo yathā ca abhinīhāro yathā ca pañhāsamudāhāro, paññavā ayamāyasmā, nāyamāyasmā duppañño. Taṃ kissa hetu? Tathā hi ayamāyasmā gambhīrañceva atthapadaṃ udāharati santaṃ paṇītaṃ atakkāvacaraṃ nipuṇaṃ paṇḍitavedanīyaṃ. Yañca ayamāyasmā dhammaṃ bhāsati, tassa ca paṭibalo saṃkhittena vā vitthārena vā atthaṃ ācikkhituṃ desetuṃ paññāpetuṃ paṭṭhapetuṃ vivarituṃ vibhajituṃ uttānīkātuṃ. Paññavā ayamāyasmā, nāyamāyasmā duppañño’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Sākacchāya, bhikkhave, paññā veditabbā, sā ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti ",
      ", iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. Imāni kho, bhikkhave, cattāri ṭhānāni imehi catūhi ṭhānehi veditabbānī’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘‘Sākacchāya, bhikkhave, paññā veditabbā, sā ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti , iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. Imāni kho, bhikkhave, cattāri ṭhānāni imehi catūhi ṭhānehi veditabbānī’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Bhaddiyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "193"
      },
      ". Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho bhaddiyo licchavi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho bhaddiyo licchavi bhagavantaṃ etadavoca –"
    ],
    "innerText": "193. Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho bhaddiyo licchavi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho bhaddiyo licchavi bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sutaṃ metaṃ, bhante – ‘māyāvī samaṇo gotamo āvaṭṭaniṃ māyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āvaṭṭanīmāyaṃ (sī.), āvaṭṭanimāyaṃ (syā. kaṃ. ka.) ma. ni. 2.60 passitabbaṃ]"
      },
      " jānāti yāya aññatitthiyānaṃ sāvake āvaṭṭetī’ti. Ye te, bhante, evamāhaṃsu – ‘māyāvī samaṇo gotamo āvaṭṭaniṃ māyaṃ jānāti yāya aññatitthiyānaṃ sāvake āvaṭṭetī’ti, kacci te, bhante, bhagavato vuttavādino, na ca bhagavantaṃ abhūtena abbhācikkhanti, dhammassa ca anudhammaṃ byākaronti, na ca koci sahadhammiko vādānupāto gārayhaṃ ṭhānaṃ āgacchati, anabbhakkhātukāmā hi mayaṃ, bhante, bhagavanta’’nti?"
    ],
    "innerText": "‘‘Sutaṃ metaṃ, bhante – ‘māyāvī samaṇo gotamo āvaṭṭaniṃ māyaṃ [āvaṭṭanīmāyaṃ (sī.), āvaṭṭanimāyaṃ (syā. kaṃ. ka.) ma. ni. 2.60 passitabbaṃ] jānāti yāya aññatitthiyānaṃ sāvake āvaṭṭetī’ti. Ye te, bhante, evamāhaṃsu – ‘māyāvī samaṇo gotamo āvaṭṭaniṃ māyaṃ jānāti yāya aññatitthiyānaṃ sāvake āvaṭṭetī’ti, kacci te, bhante, bhagavato vuttavādino, na ca bhagavantaṃ abhūtena abbhācikkhanti, dhammassa ca anudhammaṃ byākaronti, na ca koci sahadhammiko vādānupāto gārayhaṃ ṭhānaṃ āgacchati, anabbhakkhātukāmā hi mayaṃ, bhante, bhagavanta’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Etha ",
      " tumhe, bhaddiya, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā ‘samaṇo no garū’ti. Yadā tumhe, bhaddiya, attanāva jāneyyātha – ‘ime dhammā akusalā, ime dhammā sāvajjā, ime dhammā viññugarahitā, ime dhammā samattā samādinnā ahitāya dukkhāya saṃvattantī’ti, atha tumhe, bhaddiya, pajaheyyātha."
    ],
    "innerText": "‘‘Etha tumhe, bhaddiya, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā ‘samaṇo no garū’ti. Yadā tumhe, bhaddiya, attanāva jāneyyātha – ‘ime dhammā akusalā, ime dhammā sāvajjā, ime dhammā viññugarahitā, ime dhammā samattā samādinnā ahitāya dukkhāya saṃvattantī’ti, atha tumhe, bhaddiya, pajaheyyātha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ ",
      " kiṃ maññatha, bhaddiya, lobho purisassa ajjhattaṃ uppajjamāno uppajjati ",
      " hitāya vā ahitāya vā’’ti? ‘‘Ahitāya, bhante’’. ‘‘Luddho panāyaṃ, bhaddiya, purisapuggalo lobhena abhibhūto pariyādinnacitto pāṇampi hanati, adinnampi ādiyati, paradārampi gacchati, musāpi bhaṇati, parampi tathattāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tadatthāya (ka.) a. ni. 3.66]"
      },
      " samādapeti yaṃsa hoti dīgharattaṃ ahitāya dukkhāyā’’ti. ‘‘Evaṃ, bhante’’."
    ],
    "innerText": "‘‘Taṃ kiṃ maññatha, bhaddiya, lobho purisassa ajjhattaṃ uppajjamāno uppajjati hitāya vā ahitāya vā’’ti? ‘‘Ahitāya, bhante’’. ‘‘Luddho panāyaṃ, bhaddiya, purisapuggalo lobhena abhibhūto pariyādinnacitto pāṇampi hanati, adinnampi ādiyati, paradārampi gacchati, musāpi bhaṇati, parampi tathattāya [tadatthāya (ka.) a. ni. 3.66] samādapeti yaṃsa hoti dīgharattaṃ ahitāya dukkhāyā’’ti. ‘‘Evaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Taṃ kiṃ maññatha, bhaddiya, doso purisassa…pe… moho purisassa…pe… sārambho purisassa ajjhattaṃ uppajjamāno uppajjati hitāya vā ahitāya vā’’ti? ‘‘Ahitāya, bhante’’. ‘‘Sāraddho panāyaṃ, bhaddiya, purisapuggalo sārambhena abhibhūto pariyādinnacitto pāṇampi hanati, adinnampi ādiyati, paradārampi gacchati, musāpi bhaṇati, parampi tathattāya samādapeti yaṃsa hoti dīgharattaṃ ahitāya dukkhāyā’’ti. ‘‘Evaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Taṃ kiṃ maññatha, bhaddiya, ime dhammā kusalā vā akusalā vā’’ti? ‘‘Akusalā, bhante’’. ‘‘Sāvajjā vā anavajjā vā’’ti? ‘‘Sāvajjā, bhante’’. ‘‘Viññugarahitā vā viññuppasatthā vā’’ti? ‘‘Viññugarahitā, bhante’’. ‘‘Samattā samādinnā ahitāya dukkhāya saṃvattanti, no vā? Kathaṃ vā ettha hotī’’ti? ‘‘Samattā, bhante, samādinnā ahitāya dukkhāya saṃvattanti. Evaṃ no ettha hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Iti kho, bhaddiya, yaṃ taṃ te avocumhā – etha tumhe, bhaddiya, mā anussavena, mā paramparāya, mā itikirāya, mā ",
      " piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā ‘samaṇo no garū’ti. Yadā tumhe, bhaddiya, attanāva jāneyyātha ",
      " – ‘ime dhammā akusalā, ime ",
      " dhammā sāvajjā, ime dhammā viññugarahitā, ime dhammā samattā samādinnā ahitāya dukkhāya saṃvattantīti, atha tumhe, bhaddiya, pajaheyyāthā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘Iti kho, bhaddiya, yaṃ taṃ te avocumhā – etha tumhe, bhaddiya, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā ‘samaṇo no garū’ti. Yadā tumhe, bhaddiya, attanāva jāneyyātha – ‘ime dhammā akusalā, ime dhammā sāvajjā, ime dhammā viññugarahitā, ime dhammā samattā samādinnā ahitāya dukkhāya saṃvattantīti, atha tumhe, bhaddiya, pajaheyyāthā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Etha tumhe, bhaddiya, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā ‘samaṇo no garū’ti. Yadā tumhe, bhaddiya, attanāva ",
      " jāneyyātha – ‘ime dhammā kusalā, ime dhammā anavajjā, ime dhammā viññuppasatthā, ime dhammā samattā samādinnā hitāya sukhāya saṃvattantī’ti, atha tumhe, bhaddiya, upasampajja vihareyyāthā’’ti."
    ],
    "innerText": "‘‘Etha tumhe, bhaddiya, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā ‘samaṇo no garū’ti. Yadā tumhe, bhaddiya, attanāva jāneyyātha – ‘ime dhammā kusalā, ime dhammā anavajjā, ime dhammā viññuppasatthā, ime dhammā samattā samādinnā hitāya sukhāya saṃvattantī’ti, atha tumhe, bhaddiya, upasampajja vihareyyāthā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Taṃ kiṃ maññatha, bhaddiya, alobho purisassa ajjhattaṃ uppajjamāno uppajjati hitāya vā ahitāya vā’’ti? ‘‘Hitāya, bhante’’. ‘‘Aluddho panāyaṃ, bhaddiya, purisapuggalo lobhena anabhibhūto apariyādinnacitto neva pāṇaṃ hanati, na adinnaṃ ādiyati, na paradāraṃ gacchati, na musā bhaṇati, parampi tathattāya na samādapeti yaṃ’sa hoti dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Evaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ kiṃ maññatha, bhaddiya, adoso purisassa…pe… amoho purisassa…pe… asārambho purisassa ajjhattaṃ uppajjamāno uppajjati hitāya vā ahitāya vā’’ti? ‘‘Hitāya, bhante’’. ‘‘Asāraddho panāyaṃ, bhaddiya, purisapuggalo sārambhena anabhibhūto apariyādinnacitto neva pāṇaṃ hanati, na adinnaṃ ādiyati, na paradāraṃ gacchati, na musā bhaṇati ",
      ", parampi tathattāya na samādapeti yaṃ’sa hoti dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Evaṃ, bhante’’."
    ],
    "innerText": "‘‘Taṃ kiṃ maññatha, bhaddiya, adoso purisassa…pe… amoho purisassa…pe… asārambho purisassa ajjhattaṃ uppajjamāno uppajjati hitāya vā ahitāya vā’’ti? ‘‘Hitāya, bhante’’. ‘‘Asāraddho panāyaṃ, bhaddiya, purisapuggalo sārambhena anabhibhūto apariyādinnacitto neva pāṇaṃ hanati, na adinnaṃ ādiyati, na paradāraṃ gacchati, na musā bhaṇati , parampi tathattāya na samādapeti yaṃ’sa hoti dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Evaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ kiṃ maññatha, bhaddiya, ime dhammā kusalā vā akusalā vā’’ti? ‘‘Kusalā, bhante’’. ‘‘Sāvajjā vā anavajjā vā’’ti? ‘‘Anavajjā, bhante’’. ‘‘Viññugarahitā vā viññuppasatthā vā’’ti? ‘‘Viññuppasatthā, bhante’’. ‘‘Samattā ",
      " samādinnā hitāya sukhāya saṃvattanti no vā? Kathaṃ vā ettha hotī’’ti? ‘‘Samattā, bhante, samādinnā hitāya sukhāya saṃvattanti. Evaṃ no ettha hotī’’ti."
    ],
    "innerText": "‘‘Taṃ kiṃ maññatha, bhaddiya, ime dhammā kusalā vā akusalā vā’’ti? ‘‘Kusalā, bhante’’. ‘‘Sāvajjā vā anavajjā vā’’ti? ‘‘Anavajjā, bhante’’. ‘‘Viññugarahitā vā viññuppasatthā vā’’ti? ‘‘Viññuppasatthā, bhante’’. ‘‘Samattā samādinnā hitāya sukhāya saṃvattanti no vā? Kathaṃ vā ettha hotī’’ti? ‘‘Samattā, bhante, samādinnā hitāya sukhāya saṃvattanti. Evaṃ no ettha hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Iti ",
      " kho, bhaddiya, yaṃ taṃ te avocumhā – etha tumhe, bhaddiya, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā ‘samaṇo no garū’ti. Yadā tumhe, bhaddiya, attanāva jāneyyātha – ‘ime dhammā kusalā, ime dhammā anavajjā, ime dhammā viññuppasatthā, ime dhammā samattā samādinnā hitāya sukhāya saṃvattantīti ",
      ", atha tumhe, bhaddiya, upasampajja vihareyyāthā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘Iti kho, bhaddiya, yaṃ taṃ te avocumhā – etha tumhe, bhaddiya, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā ‘samaṇo no garū’ti. Yadā tumhe, bhaddiya, attanāva jāneyyātha – ‘ime dhammā kusalā, ime dhammā anavajjā, ime dhammā viññuppasatthā, ime dhammā samattā samādinnā hitāya sukhāya saṃvattantīti , atha tumhe, bhaddiya, upasampajja vihareyyāthā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye kho te, bhaddiya, loke santo sappurisā te sāvakaṃ evaṃ samādapenti – ‘ehi tvaṃ, ambho purisa, lobhaṃ vineyya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vineyya vineyya (sī. syā. kaṃ.)]"
      },
      " viharāhi. Lobhaṃ vineyya viharanto na lobhajaṃ kammaṃ karissasi kāyena vācāya manasā. Dosaṃ vineyya viharāhi. Dosaṃ vineyya viharanto na dosajaṃ kammaṃ ",
      " karissasi kāyena vācāya manasā. Mohaṃ vineyya viharāhi. Mohaṃ vineyya viharanto na mohajaṃ kammaṃ karissasi kāyena vācāya manasā. Sārambhaṃ vineyya viharāhi. Sārambhaṃ vineyya viharanto na sārambhajaṃ kammaṃ karissasi kāyena vācāya manasā’’’ti."
    ],
    "innerText": "‘‘Ye kho te, bhaddiya, loke santo sappurisā te sāvakaṃ evaṃ samādapenti – ‘ehi tvaṃ, ambho purisa, lobhaṃ vineyya [vineyya vineyya (sī. syā. kaṃ.)] viharāhi. Lobhaṃ vineyya viharanto na lobhajaṃ kammaṃ karissasi kāyena vācāya manasā. Dosaṃ vineyya viharāhi. Dosaṃ vineyya viharanto na dosajaṃ kammaṃ karissasi kāyena vācāya manasā. Mohaṃ vineyya viharāhi. Mohaṃ vineyya viharanto na mohajaṃ kammaṃ karissasi kāyena vācāya manasā. Sārambhaṃ vineyya viharāhi. Sārambhaṃ vineyya viharanto na sārambhajaṃ kammaṃ karissasi kāyena vācāya manasā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ vutte bhaddiyo licchavi bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bhante…pe… upāsakaṃ maṃ, bhante, bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Api nu tāhaṃ, bhaddiya, evaṃ avacaṃ – ‘ehi me tvaṃ, bhaddiya, sāvako hohi; ahaṃ satthā bhavissāmī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Evaṃvādiṃ kho maṃ, bhaddiya, evamakkhāyiṃ eke samaṇabrāhmaṇā asatā tucchā musā abhūtena abbhācikkhanti – ‘māyāvī samaṇo gotamo āvaṭṭaniṃ māyaṃ jānāti yāya aññatitthiyānaṃ sāvake āvaṭṭetī’’’ti. ‘‘Bhaddikā ",
      ", bhante, āvaṭṭanī māyā. Kalyāṇī, bhante, āvaṭṭanī māyā. Piyā me, bhante, ñātisālohitā imāya āvaṭṭaniyā āvaṭṭeyyuṃ, piyānampi me assa ñātisālohitānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, bhante, khattiyā imāya āvaṭṭaniyā āvaṭṭeyyuṃ, sabbesampissa khattiyānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, bhante, brāhmaṇā… vessā ",
      " … suddā imāya āvaṭṭaniyā āvaṭṭeyyuṃ, sabbesampissa suddānaṃ dīgharattaṃ hitāya sukhāyā’’ti."
    ],
    "innerText": "‘‘Api nu tāhaṃ, bhaddiya, evaṃ avacaṃ – ‘ehi me tvaṃ, bhaddiya, sāvako hohi; ahaṃ satthā bhavissāmī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Evaṃvādiṃ kho maṃ, bhaddiya, evamakkhāyiṃ eke samaṇabrāhmaṇā asatā tucchā musā abhūtena abbhācikkhanti – ‘māyāvī samaṇo gotamo āvaṭṭaniṃ māyaṃ jānāti yāya aññatitthiyānaṃ sāvake āvaṭṭetī’’’ti. ‘‘Bhaddikā , bhante, āvaṭṭanī māyā. Kalyāṇī, bhante, āvaṭṭanī māyā. Piyā me, bhante, ñātisālohitā imāya āvaṭṭaniyā āvaṭṭeyyuṃ, piyānampi me assa ñātisālohitānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, bhante, khattiyā imāya āvaṭṭaniyā āvaṭṭeyyuṃ, sabbesampissa khattiyānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, bhante, brāhmaṇā… vessā … suddā imāya āvaṭṭaniyā āvaṭṭeyyuṃ, sabbesampissa suddānaṃ dīgharattaṃ hitāya sukhāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evametaṃ, bhaddiya, evametaṃ, bhaddiya! Sabbe cepi, bhaddiya, khattiyā imāya āvaṭṭaniyā āvaṭṭeyyuṃ akusaladhammappahānāya kusaladhammūpasampadāya, sabbesampissa khattiyānaṃ dīgharattaṃ hitāya sukhāya. Sabbe ",
      " cepi, bhaddiya, brāhmaṇā… vessā… suddā āvaṭṭeyyuṃ akusaladhammappahānāya kusaladhammūpasampadāya, sabbesampissa suddānaṃ dīgharattaṃ hitāya sukhāya. Sadevako cepi, bhaddiya, loko samārako sabrahmako sassamaṇabrāhmaṇī pajā sadevamanussā imāya ",
      " āvaṭṭaniyā āvaṭṭeyyuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āvaṭṭeyya (?)]"
      },
      " akusaladhammappahānāya kusaladhammūpasampadāya, sadevakassapissa lokassa samārakassa sabrahmakassa sassamaṇabrāhmaṇiyā pajāya sadevamanussāya dīgharattaṃ hitāya sukhāya. Ime cepi, bhaddiya, mahāsālā imāya āvaṭṭaniyā āvaṭṭeyyuṃ akusaladhammappahānāya kusaladhammūpasampadāya, imesampissa mahāsālānaṃ dīgharattaṃ hitāya sukhāya ( ) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[(sace ceteyyuṃ) (sī. syā. kaṃ. pī.), (āvaṭṭeyyuṃ) (ka.) a. ni. 8.44]"
      },
      ". Ko pana vādo manussabhūtassā’’ti! Tatiyaṃ."
    ],
    "innerText": "‘‘Evametaṃ, bhaddiya, evametaṃ, bhaddiya! Sabbe cepi, bhaddiya, khattiyā imāya āvaṭṭaniyā āvaṭṭeyyuṃ akusaladhammappahānāya kusaladhammūpasampadāya, sabbesampissa khattiyānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, bhaddiya, brāhmaṇā… vessā… suddā āvaṭṭeyyuṃ akusaladhammappahānāya kusaladhammūpasampadāya, sabbesampissa suddānaṃ dīgharattaṃ hitāya sukhāya. Sadevako cepi, bhaddiya, loko samārako sabrahmako sassamaṇabrāhmaṇī pajā sadevamanussā imāya āvaṭṭaniyā āvaṭṭeyyuṃ [āvaṭṭeyya (?)] akusaladhammappahānāya kusaladhammūpasampadāya, sadevakassapissa lokassa samārakassa sabrahmakassa sassamaṇabrāhmaṇiyā pajāya sadevamanussāya dīgharattaṃ hitāya sukhāya. Ime cepi, bhaddiya, mahāsālā imāya āvaṭṭaniyā āvaṭṭeyyuṃ akusaladhammappahānāya kusaladhammūpasampadāya, imesampissa mahāsālānaṃ dīgharattaṃ hitāya sukhāya ( ) [(sace ceteyyuṃ) (sī. syā. kaṃ. pī.), (āvaṭṭeyyuṃ) (ka.) a. ni. 8.44]. Ko pana vādo manussabhūtassā’’ti! Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Sāmugiyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "194"
      },
      ". Ekaṃ samayaṃ āyasmā ānando koliyesu viharati sāmugaṃ nāma ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sāpūgaṃ nāma (sī. syā. kaṃ. pī.)]"
      },
      " koliyānaṃ nigamo. Atha kho sambahulā sāmugiyā koliyaputtā yenāyasmā ānando tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinne kho te sāmugiye koliyaputte āyasmā ānando etadavoca –"
    ],
    "innerText": "194. Ekaṃ samayaṃ āyasmā ānando koliyesu viharati sāmugaṃ nāma [sāpūgaṃ nāma (sī. syā. kaṃ. pī.)] koliyānaṃ nigamo. Atha kho sambahulā sāmugiyā koliyaputtā yenāyasmā ānando tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinne kho te sāmugiye koliyaputte āyasmā ānando etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cattārimāni, byagghapajjā, pārisuddhipadhāniyaṅgāni tena bhagavatā jānatā passatā arahatā sammāsambuddhena ",
      " sammadakkhātāni sattānaṃ visuddhiyā sokaparidevānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sokapariddavānaṃ (sī.)]"
      },
      " samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya. Katamāni cattāri? Sīlapārisuddhipadhāniyaṅgaṃ, cittapārisuddhipadhāniyaṅgaṃ ",
      ", diṭṭhipārisuddhipadhāniyaṅgaṃ, vimuttipārisuddhipadhāniyaṅgaṃ."
    ],
    "innerText": "‘‘Cattārimāni, byagghapajjā, pārisuddhipadhāniyaṅgāni tena bhagavatā jānatā passatā arahatā sammāsambuddhena sammadakkhātāni sattānaṃ visuddhiyā sokaparidevānaṃ [sokapariddavānaṃ (sī.)] samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya. Katamāni cattāri? Sīlapārisuddhipadhāniyaṅgaṃ, cittapārisuddhipadhāniyaṅgaṃ , diṭṭhipārisuddhipadhāniyaṅgaṃ, vimuttipārisuddhipadhāniyaṅgaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamañca ",
      ", byagghapajjā, sīlapārisuddhipadhāniyaṅgaṃ? Idha, byagghapajjā, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. Ayaṃ vuccati, byagghapajjā, sīlapārisuddhi. Iti evarūpiṃ sīlapārisuddhiṃ aparipūraṃ vā paripūressāmi paripūraṃ vā tattha tattha paññāya anuggahessāmīti, yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca, idaṃ vuccati, byagghapajjā, sīlapārisuddhipadhāniyaṅgaṃ."
    ],
    "innerText": "‘‘Katamañca , byagghapajjā, sīlapārisuddhipadhāniyaṅgaṃ? Idha, byagghapajjā, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. Ayaṃ vuccati, byagghapajjā, sīlapārisuddhi. Iti evarūpiṃ sīlapārisuddhiṃ aparipūraṃ vā paripūressāmi paripūraṃ vā tattha tattha paññāya anuggahessāmīti, yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca, idaṃ vuccati, byagghapajjā, sīlapārisuddhipadhāniyaṅgaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamañca, byagghapajjā, cittapārisuddhipadhāniyaṅgaṃ? Idha, byagghapajjā, bhikkhu vivicceva kāmehi…pe… ",
      " catutthaṃ jhānaṃ upasampajja viharati. Ayaṃ vuccati, byagghapajjā, cittapārisuddhi. Iti evarūpiṃ cittapārisuddhiṃ aparipūraṃ vā paripūressāmi paripūraṃ vā tattha tattha paññāya anuggahessāmīti, yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca, idaṃ vuccati, byagghapajjā, cittapārisuddhipadhāniyaṅgaṃ."
    ],
    "innerText": "‘‘Katamañca, byagghapajjā, cittapārisuddhipadhāniyaṅgaṃ? Idha, byagghapajjā, bhikkhu vivicceva kāmehi…pe… catutthaṃ jhānaṃ upasampajja viharati. Ayaṃ vuccati, byagghapajjā, cittapārisuddhi. Iti evarūpiṃ cittapārisuddhiṃ aparipūraṃ vā paripūressāmi paripūraṃ vā tattha tattha paññāya anuggahessāmīti, yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca, idaṃ vuccati, byagghapajjā, cittapārisuddhipadhāniyaṅgaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamañca, byagghapajjā, diṭṭhipārisuddhipadhāniyaṅgaṃ? Idha, byagghapajjā, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Ayaṃ vuccati, byagghapajjā, diṭṭhipārisuddhi. Iti evarūpiṃ diṭṭhipārisuddhiṃ aparipūraṃ vā…pe… tattha tattha paññāya anuggahessāmīti, yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca, idaṃ vuccati, byagghapajjā, diṭṭhipārisuddhipadhāniyaṅgaṃ ",
      "."
    ],
    "innerText": "‘‘Katamañca, byagghapajjā, diṭṭhipārisuddhipadhāniyaṅgaṃ? Idha, byagghapajjā, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Ayaṃ vuccati, byagghapajjā, diṭṭhipārisuddhi. Iti evarūpiṃ diṭṭhipārisuddhiṃ aparipūraṃ vā…pe… tattha tattha paññāya anuggahessāmīti, yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca, idaṃ vuccati, byagghapajjā, diṭṭhipārisuddhipadhāniyaṅgaṃ ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamañca, byagghapajjā, vimuttipārisuddhipadhāniyaṅgaṃ? Sa kho so, byagghapajjā, ariyasāvako iminā ca sīlapārisuddhipadhāniyaṅgena samannāgato iminā ca cittapārisuddhipadhāniyaṅgena ",
      " samannāgato iminā ca diṭṭhipārisuddhipadhāniyaṅgena samannāgato rajanīyesu dhammesu cittaṃ virājeti, vimocanīyesu dhammesu cittaṃ vimoceti. So rajanīyesu dhammesu cittaṃ virājetvā, vimocanīyesu dhammesu cittaṃ vimocetvā sammāvimuttiṃ phusati. Ayaṃ vuccati, byagghapajjā, vimuttipārisuddhi. Iti evarūpiṃ vimuttipārisuddhiṃ aparipūraṃ vā paripūressāmi paripūraṃ vā tattha tattha paññāya anuggahessāmīti, yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca, idaṃ vuccati, byagghapajjā, vimuttipārisuddhipadhāniyaṅgaṃ."
    ],
    "innerText": "‘‘Katamañca, byagghapajjā, vimuttipārisuddhipadhāniyaṅgaṃ? Sa kho so, byagghapajjā, ariyasāvako iminā ca sīlapārisuddhipadhāniyaṅgena samannāgato iminā ca cittapārisuddhipadhāniyaṅgena samannāgato iminā ca diṭṭhipārisuddhipadhāniyaṅgena samannāgato rajanīyesu dhammesu cittaṃ virājeti, vimocanīyesu dhammesu cittaṃ vimoceti. So rajanīyesu dhammesu cittaṃ virājetvā, vimocanīyesu dhammesu cittaṃ vimocetvā sammāvimuttiṃ phusati. Ayaṃ vuccati, byagghapajjā, vimuttipārisuddhi. Iti evarūpiṃ vimuttipārisuddhiṃ aparipūraṃ vā paripūressāmi paripūraṃ vā tattha tattha paññāya anuggahessāmīti, yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca, idaṃ vuccati, byagghapajjā, vimuttipārisuddhipadhāniyaṅgaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Imāni ",
      " kho, byagghapajjā, cattāri pārisuddhipadhāniyaṅgāni tena bhagavatā jānatā passatā arahatā sammāsambuddhena sammadakkhātāni sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya ",
      " dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāyā’’ti. Catutthaṃ."
    ],
    "innerText": "‘‘Imāni kho, byagghapajjā, cattāri pārisuddhipadhāniyaṅgāni tena bhagavatā jānatā passatā arahatā sammāsambuddhena sammadakkhātāni sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāyā’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Vappasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "195"
      },
      ". Ekaṃ samayaṃ bhagavā sakkesu viharati kapilavatthusmiṃ nigrodhārāme. Atha kho vappo sakko nigaṇṭhasāvako yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho vappaṃ sakkaṃ nigaṇṭhasāvakaṃ āyasmā mahāmoggallāno etadavoca –"
    ],
    "innerText": "195. Ekaṃ samayaṃ bhagavā sakkesu viharati kapilavatthusmiṃ nigrodhārāme. Atha kho vappo sakko nigaṇṭhasāvako yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho vappaṃ sakkaṃ nigaṇṭhasāvakaṃ āyasmā mahāmoggallāno etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idhassa ",
      ", vappa, kāyena saṃvuto vācāya saṃvuto manasā saṃvuto avijjāvirāgā vijjuppādā. Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anvāssaveyyuṃ (ka.)]"
      },
      " abhisamparāya’’nti? ‘‘Passāmahaṃ, bhante, taṃ ṭhānaṃ. Idhassa, bhante, pubbe pāpakammaṃ kataṃ avipakkavipākaṃ. Tatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’’nti. Ayañceva kho pana āyasmato mahāmoggallānassa vappena sakkena nigaṇṭhasāvakena saddhiṃ antarākathā vippakatā hoti."
    ],
    "innerText": "‘‘Idhassa , vappa, kāyena saṃvuto vācāya saṃvuto manasā saṃvuto avijjāvirāgā vijjuppādā. Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ [anvāssaveyyuṃ (ka.)] abhisamparāya’’nti? ‘‘Passāmahaṃ, bhante, taṃ ṭhānaṃ. Idhassa, bhante, pubbe pāpakammaṃ kataṃ avipakkavipākaṃ. Tatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’’nti. Ayañceva kho pana āyasmato mahāmoggallānassa vappena sakkena nigaṇṭhasāvakena saddhiṃ antarākathā vippakatā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito ",
      " yena upaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā āyasmantaṃ mahāmoggallānaṃ etadavoca –"
    ],
    "innerText": "Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena upaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā āyasmantaṃ mahāmoggallānaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kāya nuttha, moggallāna, etarahi kathāya sannisinnā; kā ca pana vo antarākathā vippakatā’’ti? ‘‘Idhāhaṃ, bhante, vappaṃ sakkaṃ nigaṇṭhasāvakaṃ etadavocaṃ – ‘idhassa, vappa, kāyena saṃvuto vācāya saṃvuto manasā saṃvuto avijjāvirāgā vijjuppādā. Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’nti? Evaṃ vutte, bhante, vappo sakko nigaṇṭhasāvako maṃ etadavoca – ‘passāmahaṃ, bhante, taṃ ṭhānaṃ. Idhassa, bhante, pubbe pāpakammaṃ kataṃ avipakkavipākaṃ. Tatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’nti ",
      ". Ayaṃ kho no, bhante ",
      ", vappena sakkena nigaṇṭhasāvakena saddhiṃ antarākathā vippakatā; atha bhagavā anuppatto’’ti."
    ],
    "innerText": "‘‘Kāya nuttha, moggallāna, etarahi kathāya sannisinnā; kā ca pana vo antarākathā vippakatā’’ti? ‘‘Idhāhaṃ, bhante, vappaṃ sakkaṃ nigaṇṭhasāvakaṃ etadavocaṃ – ‘idhassa, vappa, kāyena saṃvuto vācāya saṃvuto manasā saṃvuto avijjāvirāgā vijjuppādā. Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’nti? Evaṃ vutte, bhante, vappo sakko nigaṇṭhasāvako maṃ etadavoca – ‘passāmahaṃ, bhante, taṃ ṭhānaṃ. Idhassa, bhante, pubbe pāpakammaṃ kataṃ avipakkavipākaṃ. Tatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’nti . Ayaṃ kho no, bhante , vappena sakkena nigaṇṭhasāvakena saddhiṃ antarākathā vippakatā; atha bhagavā anuppatto’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā vappaṃ sakkaṃ nigaṇṭhasāvakaṃ etadavoca ",
      " – ‘‘sace me tvaṃ, vappa, anuññeyyañceva anujāneyyāsi, paṭikkositabbañca paṭikkoseyyāsi, yassa ca me bhāsitassa atthaṃ na jāneyyāsi mamevettha uttari paṭipuccheyyāsi – ‘idaṃ, bhante, kathaṃ, imassa ko attho’ti, siyā no ettha kathāsallāpo’’ti. ‘‘Anuññeyyañcevāhaṃ, bhante, bhagavato anujānissāmi, paṭikkositabbañca paṭikkosissāmi, yassa cāhaṃ bhagavato bhāsitassa atthaṃ na jānissāmi bhagavantaṃyevettha uttari paṭipucchissāmi – ‘idaṃ bhante, kathaṃ, imassa ko attho’ti? Hotu no ettha kathāsallāpo’’ti."
    ],
    "innerText": "Atha kho bhagavā vappaṃ sakkaṃ nigaṇṭhasāvakaṃ etadavoca – ‘‘sace me tvaṃ, vappa, anuññeyyañceva anujāneyyāsi, paṭikkositabbañca paṭikkoseyyāsi, yassa ca me bhāsitassa atthaṃ na jāneyyāsi mamevettha uttari paṭipuccheyyāsi – ‘idaṃ, bhante, kathaṃ, imassa ko attho’ti, siyā no ettha kathāsallāpo’’ti. ‘‘Anuññeyyañcevāhaṃ, bhante, bhagavato anujānissāmi, paṭikkositabbañca paṭikkosissāmi, yassa cāhaṃ bhagavato bhāsitassa atthaṃ na jānissāmi bhagavantaṃyevettha uttari paṭipucchissāmi – ‘idaṃ bhante, kathaṃ, imassa ko attho’ti? Hotu no ettha kathāsallāpo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ kiṃ maññasi, vappa, ye kāyasamārambhapaccayā uppajjanti āsavā vighātapariḷāhā, kāyasamārambhā paṭiviratassa evaṃsa te āsavā vighātapariḷāhā na honti. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa ",
      " byantīkaroti, sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[viññūhīti (sī. pī. ka.) saṃ. ni. 4.364 passitabbaṃ]"
      },
      ". Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’’nti? ‘‘No hetaṃ, bhante’’."
    ],
    "innerText": "‘‘Taṃ kiṃ maññasi, vappa, ye kāyasamārambhapaccayā uppajjanti āsavā vighātapariḷāhā, kāyasamārambhā paṭiviratassa evaṃsa te āsavā vighātapariḷāhā na honti. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti, sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhi [viññūhīti (sī. pī. ka.) saṃ. ni. 4.364 passitabbaṃ]. Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’’nti? ‘‘No hetaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ kiṃ maññasi, vappa, ye vacīsamārambhapaccayā uppajjanti āsavā vighātapariḷāhā, vacīsamārambhā paṭiviratassa evaṃsa te āsavā vighātapariḷāhā na honti. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhi. Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ ",
      " abhisamparāya’’nti? ‘‘No hetaṃ, bhante’’."
    ],
    "innerText": "‘‘Taṃ kiṃ maññasi, vappa, ye vacīsamārambhapaccayā uppajjanti āsavā vighātapariḷāhā, vacīsamārambhā paṭiviratassa evaṃsa te āsavā vighātapariḷāhā na honti. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhi. Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’’nti? ‘‘No hetaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ kiṃ maññasi, vappa, ye manosamārambhapaccayā uppajjanti āsavā vighātapariḷāhā, manosamārambhā paṭiviratassa evaṃsa te āsavā vighātapariḷāhā na honti. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti. Sandiṭṭhikā nijjarā akālikā ",
      " ehipassikā opaneyyikā ",
      " paccattaṃ veditabbā viññūhi. Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’’nti? ‘‘No hetaṃ, bhante’’."
    ],
    "innerText": "‘‘Taṃ kiṃ maññasi, vappa, ye manosamārambhapaccayā uppajjanti āsavā vighātapariḷāhā, manosamārambhā paṭiviratassa evaṃsa te āsavā vighātapariḷāhā na honti. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhi. Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’’nti? ‘‘No hetaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Taṃ kiṃ maññasi, vappa, ye avijjāpaccayā uppajjanti āsavā vighātapariḷāhā, avijjāvirāgā vijjuppādā evaṃsa te āsavā vighātapariḷāhā na honti. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhi. Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’’nti? ‘‘No hetaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ sammā vimuttacittassa kho, vappa, bhikkhuno cha satatavihārā adhigatā honti. So cakkhunā rūpaṃ disvā neva sumano hoti na dummano; upekkhako viharati sato sampajāno. Sotena saddaṃ sutvā…pe… ghānena gandhaṃ ghāyitvā…pe... jivhāya rasaṃ sāyitvā…pe… kāyena phoṭṭhabbaṃ phusitvā…pe… manasā dhammaṃ viññā neva sumano hoti na dummano; upekkhako viharati sato sampajāno. So kāyapariyantikaṃ vedanaṃ vediyamāno ‘kāyapariyantikaṃ ",
      " vedanaṃ vediyāmī’ti pajānāti; jīvitapariyantikaṃ vedanaṃ vediyamāno ‘jīvitapariyantikaṃ vedanaṃ vediyāmī’ti pajānāti; ‘kāyassa bhedā uddhaṃ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītī bhavissantī’ti pajānāti’’."
    ],
    "innerText": "‘‘Evaṃ sammā vimuttacittassa kho, vappa, bhikkhuno cha satatavihārā adhigatā honti. So cakkhunā rūpaṃ disvā neva sumano hoti na dummano; upekkhako viharati sato sampajāno. Sotena saddaṃ sutvā…pe… ghānena gandhaṃ ghāyitvā…pe... jivhāya rasaṃ sāyitvā…pe… kāyena phoṭṭhabbaṃ phusitvā…pe… manasā dhammaṃ viññā neva sumano hoti na dummano; upekkhako viharati sato sampajāno. So kāyapariyantikaṃ vedanaṃ vediyamāno ‘kāyapariyantikaṃ vedanaṃ vediyāmī’ti pajānāti; jīvitapariyantikaṃ vedanaṃ vediyamāno ‘jīvitapariyantikaṃ vedanaṃ vediyāmī’ti pajānāti; ‘kāyassa bhedā uddhaṃ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītī bhavissantī’ti pajānāti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, vappa, thūṇaṃ paṭicca chāyā paññāyati. Atha puriso ",
      " āgaccheyya kuddālapiṭakaṃ ādāya. So taṃ thūṇaṃ mūle chindeyya; mūle chinditvā palikhaṇeyya; palikhaṇitvā mūlāni uddhareyya, antamaso usīranāḷimattānipi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[usīranāḷamattānipi (sī.)]"
      },
      ". So taṃ thūṇaṃ khaṇḍākhaṇḍikaṃ chindeyya. Khaṇḍākhaṇḍikaṃ chetvā phāleyya. Phāletvā sakalikaṃ sakalikaṃ kareyya. Sakalikaṃ sakalikaṃ katvā vātātape visoseyya. Vātātape visosetvā agginā ḍaheyya. Agginā ḍahetvā masiṃ kareyya ",
      ". Masiṃ karitvā mahāvāte vā ophuṇeyya nadiyā vā sīghasotāya pavāheyya. Evaṃ ",
      " hissa, vappa, yā thūṇaṃ paṭicca chāyā sā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā."
    ],
    "innerText": "‘‘Seyyathāpi, vappa, thūṇaṃ paṭicca chāyā paññāyati. Atha puriso āgaccheyya kuddālapiṭakaṃ ādāya. So taṃ thūṇaṃ mūle chindeyya; mūle chinditvā palikhaṇeyya; palikhaṇitvā mūlāni uddhareyya, antamaso usīranāḷimattānipi [usīranāḷamattānipi (sī.)]. So taṃ thūṇaṃ khaṇḍākhaṇḍikaṃ chindeyya. Khaṇḍākhaṇḍikaṃ chetvā phāleyya. Phāletvā sakalikaṃ sakalikaṃ kareyya. Sakalikaṃ sakalikaṃ katvā vātātape visoseyya. Vātātape visosetvā agginā ḍaheyya. Agginā ḍahetvā masiṃ kareyya . Masiṃ karitvā mahāvāte vā ophuṇeyya nadiyā vā sīghasotāya pavāheyya. Evaṃ hissa, vappa, yā thūṇaṃ paṭicca chāyā sā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, vappa, evaṃ sammā vimuttacittassa bhikkhuno cha satatavihārā adhigatā honti. So cakkhunā rūpaṃ disvā neva sumano hoti na dummano; upekkhako viharati sato sampajāno. Sotena saddaṃ sutvā…pe… ghānena gandhaṃ ghāyitvā…pe… jivhāya rasaṃ sāyitvā…pe… kāyena phoṭṭhabbaṃ phusitvā…pe… manasā dhammaṃ viññāya neva sumano hoti na dummano; upekkhako viharati sato sampajāno. So kāyapariyantikaṃ vedanaṃ vediyamāno ‘kāyapariyantikaṃ vedanaṃ vediyāmī’ti pajānāti; jīvitapariyantikaṃ vedanaṃ vediyamāno ‘jīvitapariyantikaṃ vedanaṃ vediyāmī’ti ",
      " pajānāti; ‘kāyassa bhedā uddhaṃ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītī bhavissantī’ti pajānāti’’."
    ],
    "innerText": "‘‘Evamevaṃ kho, vappa, evaṃ sammā vimuttacittassa bhikkhuno cha satatavihārā adhigatā honti. So cakkhunā rūpaṃ disvā neva sumano hoti na dummano; upekkhako viharati sato sampajāno. Sotena saddaṃ sutvā…pe… ghānena gandhaṃ ghāyitvā…pe… jivhāya rasaṃ sāyitvā…pe… kāyena phoṭṭhabbaṃ phusitvā…pe… manasā dhammaṃ viññāya neva sumano hoti na dummano; upekkhako viharati sato sampajāno. So kāyapariyantikaṃ vedanaṃ vediyamāno ‘kāyapariyantikaṃ vedanaṃ vediyāmī’ti pajānāti; jīvitapariyantikaṃ vedanaṃ vediyamāno ‘jīvitapariyantikaṃ vedanaṃ vediyāmī’ti pajānāti; ‘kāyassa bhedā uddhaṃ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītī bhavissantī’ti pajānāti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vutte vappo sakko nigaṇṭhasāvako bhagavantaṃ etadavoca – ‘‘seyyathāpi, bhante, puriso udayatthiko assapaṇiyaṃ poseyya. So udayañceva nādhigaccheyya, uttariñca kilamathassa vighātassa bhāgī assa. Evamevaṃ kho ahaṃ, bhante, udayatthiko bāle nigaṇṭhe payirupāsiṃ. Svāhaṃ udayañceva nādhigacchiṃ, uttariñca kilamathassa vighātassa bhāgī ahosiṃ. Esāhaṃ, bhante, ajjatagge yo me bālesu nigaṇṭhesu pasādo taṃ mahāvāte vā ophuṇāmi nadiyā vā sīghasotāya pavāhemi. Abhikkantaṃ, bhante…pe… upāsakaṃ maṃ, bhante ",
      ", bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Pañcamaṃ."
    ],
    "innerText": "Evaṃ vutte vappo sakko nigaṇṭhasāvako bhagavantaṃ etadavoca – ‘‘seyyathāpi, bhante, puriso udayatthiko assapaṇiyaṃ poseyya. So udayañceva nādhigaccheyya, uttariñca kilamathassa vighātassa bhāgī assa. Evamevaṃ kho ahaṃ, bhante, udayatthiko bāle nigaṇṭhe payirupāsiṃ. Svāhaṃ udayañceva nādhigacchiṃ, uttariñca kilamathassa vighātassa bhāgī ahosiṃ. Esāhaṃ, bhante, ajjatagge yo me bālesu nigaṇṭhesu pasādo taṃ mahāvāte vā ophuṇāmi nadiyā vā sīghasotāya pavāhemi. Abhikkantaṃ, bhante…pe… upāsakaṃ maṃ, bhante , bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Sāḷhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "196"
      },
      ". Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho sāḷho ca licchavi abhayo ca licchavi yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ",
      " ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho sāḷho licchavi bhagavantaṃ etadavoca –"
    ],
    "innerText": "196. Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho sāḷho ca licchavi abhayo ca licchavi yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho sāḷho licchavi bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Santi, bhante, eke samaṇabrāhmaṇā dvayena oghassa nittharaṇaṃ paññapenti ",
      " – sīlavisuddhihetu ca tapojigucchāhetu ca. Idha, bhante, bhagavā kimāhā’’ti?"
    ],
    "innerText": "‘‘Santi, bhante, eke samaṇabrāhmaṇā dvayena oghassa nittharaṇaṃ paññapenti – sīlavisuddhihetu ca tapojigucchāhetu ca. Idha, bhante, bhagavā kimāhā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sīlavisuddhiṃ ",
      " kho ahaṃ, sāḷha, aññataraṃ sāmaññaṅganti vadāmi. Ye te, sāḷha, samaṇabrāhmaṇā tapojigucchāvādā tapojigucchāsārā tapojigucchāallīnā viharanti, abhabbā te oghassa nittharaṇāya. Yepi te, sāḷha, samaṇabrāhmaṇā aparisuddhakāyasamācārā aparisuddhavacīsamācārā aparisuddhamanosamācārā aparisuddhājīvā, abhabbā te ñāṇadassanāya anuttarāya sambodhāya."
    ],
    "innerText": "‘‘Sīlavisuddhiṃ kho ahaṃ, sāḷha, aññataraṃ sāmaññaṅganti vadāmi. Ye te, sāḷha, samaṇabrāhmaṇā tapojigucchāvādā tapojigucchāsārā tapojigucchāallīnā viharanti, abhabbā te oghassa nittharaṇāya. Yepi te, sāḷha, samaṇabrāhmaṇā aparisuddhakāyasamācārā aparisuddhavacīsamācārā aparisuddhamanosamācārā aparisuddhājīvā, abhabbā te ñāṇadassanāya anuttarāya sambodhāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, sāḷha, puriso nadiṃ taritukāmo tiṇhaṃ kuṭhāriṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kudhāriṃ (ka.)]"
      },
      " ādāya vanaṃ paviseyya. So tattha passeyya mahatiṃ sālalaṭṭhiṃ ujuṃ navaṃ akukkuccakajātaṃ. Tamenaṃ mūle chindeyya; mūle chetvā agge chindeyya; agge chetvā sākhāpalāsaṃ suvisodhitaṃ visodheyya; sākhāpalāsaṃ suvisodhitaṃ visodhetvā kuṭhārīhi taccheyya; kuṭhārīhi tacchetvā vāsīhi taccheyya; vāsīhi tacchetvā lekhaṇiyā likheyya; lekhaṇiyā likhitvā pāsāṇaguḷena dhoveyya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dhopeyya (sī. syā. kaṃ. pī.)]"
      },
      "; pāsāṇaguḷena dhovetvā nadiṃ patāreyya."
    ],
    "innerText": "‘‘Seyyathāpi, sāḷha, puriso nadiṃ taritukāmo tiṇhaṃ kuṭhāriṃ [kudhāriṃ (ka.)] ādāya vanaṃ paviseyya. So tattha passeyya mahatiṃ sālalaṭṭhiṃ ujuṃ navaṃ akukkuccakajātaṃ. Tamenaṃ mūle chindeyya; mūle chetvā agge chindeyya; agge chetvā sākhāpalāsaṃ suvisodhitaṃ visodheyya; sākhāpalāsaṃ suvisodhitaṃ visodhetvā kuṭhārīhi taccheyya; kuṭhārīhi tacchetvā vāsīhi taccheyya; vāsīhi tacchetvā lekhaṇiyā likheyya; lekhaṇiyā likhitvā pāsāṇaguḷena dhoveyya [dhopeyya (sī. syā. kaṃ. pī.)]; pāsāṇaguḷena dhovetvā nadiṃ patāreyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ kiṃ maññasi, sāḷha, bhabbo nu kho so puriso nadiṃ taritu’’nti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Asu hi, bhante, sālalaṭṭhi bahiddhā suparikammakatā ",
      " anto avisuddhā. Tassetaṃ pāṭikaṅkhaṃ – sālalaṭṭhi saṃsīdissati, puriso anayabyasanaṃ āpajjissatī’’ti."
    ],
    "innerText": "‘‘Taṃ kiṃ maññasi, sāḷha, bhabbo nu kho so puriso nadiṃ taritu’’nti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Asu hi, bhante, sālalaṭṭhi bahiddhā suparikammakatā anto avisuddhā. Tassetaṃ pāṭikaṅkhaṃ – sālalaṭṭhi saṃsīdissati, puriso anayabyasanaṃ āpajjissatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, sāḷha, ye te samaṇabrāhmaṇā tapojigucchāvādā tapojigucchāsārā tapojigucchāallīnā viharanti, abhabbā te oghassa nittharaṇāya. Yepi te, sāḷha, samaṇabrāhmaṇā aparisuddhakāyasamācārā aparisuddhavacīsamācārā aparisuddhamanosamācārā ",
      " aparisuddhājīvā, abhabbā te ñāṇadassanāya anuttarāya sambodhāya."
    ],
    "innerText": "‘‘Evamevaṃ kho, sāḷha, ye te samaṇabrāhmaṇā tapojigucchāvādā tapojigucchāsārā tapojigucchāallīnā viharanti, abhabbā te oghassa nittharaṇāya. Yepi te, sāḷha, samaṇabrāhmaṇā aparisuddhakāyasamācārā aparisuddhavacīsamācārā aparisuddhamanosamācārā aparisuddhājīvā, abhabbā te ñāṇadassanāya anuttarāya sambodhāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye ",
      " ca kho te, sāḷha, samaṇabrāhmaṇā na tapojigucchāvādā na tapojigucchāsārā na tapojigucchāallīnā viharanti, bhabbā te oghassa nittharaṇāya. Yepi te, sāḷha, samaṇabrāhmaṇā parisuddhakāyasamācārā parisuddhavacīsamācārā parisuddhamanosamācārā parisuddhājīvā, bhabbā te ñāṇadassanāya anuttarāya sambodhāya."
    ],
    "innerText": "‘‘Ye ca kho te, sāḷha, samaṇabrāhmaṇā na tapojigucchāvādā na tapojigucchāsārā na tapojigucchāallīnā viharanti, bhabbā te oghassa nittharaṇāya. Yepi te, sāḷha, samaṇabrāhmaṇā parisuddhakāyasamācārā parisuddhavacīsamācārā parisuddhamanosamācārā parisuddhājīvā, bhabbā te ñāṇadassanāya anuttarāya sambodhāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi ",
      ", sāḷha, puriso nadiṃ taritukāmo tiṇhaṃ kuṭhāriṃ ādāya vanaṃ paviseyya. So tattha passeyya mahatiṃ sālalaṭṭhiṃ ujuṃ navaṃ akukkuccakajātaṃ. Tamenaṃ mūle chindeyya; mūle chinditvā agge chindeyya; agge chinditvā sākhāpalāsaṃ suvisodhitaṃ visodheyya; sākhāpalāsaṃ suvisodhitaṃ visodhetvā kuṭhārīhi taccheyya; kuṭhārīhi tacchetvā vāsīhi taccheyya; vāsīhi tacchetvā nikhādanaṃ ādāya anto suvisodhitaṃ visodheyya; anto suvisodhitaṃ visodhetvā lekhaṇiyā likheyya; lekhaṇiyā likhitvā pāsāṇaguḷena dhoveyya; pāsāṇaguḷena dhovetvā nāvaṃ kareyya; nāvaṃ katvā phiyārittaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[piyārittaṃ (sī. pī.)]"
      },
      " bandheyya; phiyārittaṃ bandhitvā nadiṃ patāreyya."
    ],
    "innerText": "‘‘Seyyathāpi , sāḷha, puriso nadiṃ taritukāmo tiṇhaṃ kuṭhāriṃ ādāya vanaṃ paviseyya. So tattha passeyya mahatiṃ sālalaṭṭhiṃ ujuṃ navaṃ akukkuccakajātaṃ. Tamenaṃ mūle chindeyya; mūle chinditvā agge chindeyya; agge chinditvā sākhāpalāsaṃ suvisodhitaṃ visodheyya; sākhāpalāsaṃ suvisodhitaṃ visodhetvā kuṭhārīhi taccheyya; kuṭhārīhi tacchetvā vāsīhi taccheyya; vāsīhi tacchetvā nikhādanaṃ ādāya anto suvisodhitaṃ visodheyya; anto suvisodhitaṃ visodhetvā lekhaṇiyā likheyya; lekhaṇiyā likhitvā pāsāṇaguḷena dhoveyya; pāsāṇaguḷena dhovetvā nāvaṃ kareyya; nāvaṃ katvā phiyārittaṃ [piyārittaṃ (sī. pī.)] bandheyya; phiyārittaṃ bandhitvā nadiṃ patāreyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ kiṃ maññasi, sāḷha, bhabbo nu kho so puriso nadiṃ taritu’’nti? ‘‘Evaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Asu hi, bhante, sālalaṭṭhi bahiddhā suparikammakatā, anto suvisuddhā nāvākatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[suvisuddhakatā (ka.)]"
      },
      " phiyārittabaddhā. Tassetaṃ pāṭikaṅkhaṃ – ‘nāvā na saṃsīdissati, puriso sotthinā pāraṃ gamissatī’’’ti."
    ],
    "innerText": "‘‘Taṃ kiṃ maññasi, sāḷha, bhabbo nu kho so puriso nadiṃ taritu’’nti? ‘‘Evaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Asu hi, bhante, sālalaṭṭhi bahiddhā suparikammakatā, anto suvisuddhā nāvākatā [suvisuddhakatā (ka.)] phiyārittabaddhā. Tassetaṃ pāṭikaṅkhaṃ – ‘nāvā na saṃsīdissati, puriso sotthinā pāraṃ gamissatī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho ",
      ", sāḷha, ye te samaṇabrāhmaṇā na tapojigucchāvādā na tapojigucchāsārā na tapojigucchāallīnā viharanti, bhabbā te oghassa nittharaṇāya. Yepi te, sāḷha, samaṇabrāhmaṇā parisuddhakāyasamācārā ",
      " parisuddhavacīsamācārā parisuddhamanosamācārā parisuddhājīvā, bhabbā te ñāṇadassanāya anuttarāya sambodhāya. Seyyathāpi, sāḷha, yodhājīvo bahūni cepi kaṇḍacitrakāni jānāti; atha kho so tīhi ṭhānehi rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi tīhi? Dūrepātī ca, akkhaṇavedhī ca, mahato ca kāyassa padāletā."
    ],
    "innerText": "‘‘Evamevaṃ kho , sāḷha, ye te samaṇabrāhmaṇā na tapojigucchāvādā na tapojigucchāsārā na tapojigucchāallīnā viharanti, bhabbā te oghassa nittharaṇāya. Yepi te, sāḷha, samaṇabrāhmaṇā parisuddhakāyasamācārā parisuddhavacīsamācārā parisuddhamanosamācārā parisuddhājīvā, bhabbā te ñāṇadassanāya anuttarāya sambodhāya. Seyyathāpi, sāḷha, yodhājīvo bahūni cepi kaṇḍacitrakāni jānāti; atha kho so tīhi ṭhānehi rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi tīhi? Dūrepātī ca, akkhaṇavedhī ca, mahato ca kāyassa padāletā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, sāḷha, yodhājīvo dūrepātī; evamevaṃ kho, sāḷha, ariyasāvako sammāsamādhi hoti. Sammāsamādhi, sāḷha, ariyasāvako yaṃ kiñci rūpaṃ atītānāgatapaccuppannaṃ ",
      " ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā sabbaṃ rūpaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. Yā kāci vedanā…pe… yā kāci saññā… ye ",
      " keci saṅkhārā… yaṃ kiñci viññāṇaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ viññāṇaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati."
    ],
    "innerText": "‘‘Seyyathāpi, sāḷha, yodhājīvo dūrepātī; evamevaṃ kho, sāḷha, ariyasāvako sammāsamādhi hoti. Sammāsamādhi, sāḷha, ariyasāvako yaṃ kiñci rūpaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā sabbaṃ rūpaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. Yā kāci vedanā…pe… yā kāci saññā… ye keci saṅkhārā… yaṃ kiñci viññāṇaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ viññāṇaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, sāḷha, yodhājīvo akkhaṇavedhī; evamevaṃ kho, sāḷha, ariyasāvako sammādiṭṭhi hoti. Sammādiṭṭhi ",
      ", sāḷha, ariyasāvako ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti."
    ],
    "innerText": "‘‘Seyyathāpi, sāḷha, yodhājīvo akkhaṇavedhī; evamevaṃ kho, sāḷha, ariyasāvako sammādiṭṭhi hoti. Sammādiṭṭhi , sāḷha, ariyasāvako ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Seyyathāpi, sāḷha, yodhājīvo mahato kāyassa padāletā; evamevaṃ kho, sāḷha, ariyasāvako sammāvimutti hoti. Sammāvimutti, sāḷha, ariyasāvako mahantaṃ avijjākkhandhaṃ padāletī’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Mallikādevīsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "197"
      },
      ". Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho mallikā devī yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnā kho mallikā devī bhagavantaṃ etadavoca –"
    ],
    "innerText": "197. Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho mallikā devī yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnā kho mallikā devī bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ko ",
      " nu kho, bhante, hetu ko paccayo, yena midhekacco mātugāmo dubbaṇṇā ca hoti durūpā supāpikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[syā. pī. potthakesu ‘‘dubbaṇo ca hoti durūpo supāpako’’ti evamādinā pulliṅgikavasena dissati]"
      },
      " dassanāya; daliddā ca hoti appassakā appabhogā appesakkhā ca?"
    ],
    "innerText": "‘‘Ko nu kho, bhante, hetu ko paccayo, yena midhekacco mātugāmo dubbaṇṇā ca hoti durūpā supāpikā [syā. pī. potthakesu ‘‘dubbaṇo ca hoti durūpo supāpako’’ti evamādinā pulliṅgikavasena dissati] dassanāya; daliddā ca hoti appassakā appabhogā appesakkhā ca?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ko ",
      " pana, bhante, hetu ko paccayo, yena midhekacco mātugāmo dubbaṇṇā ca hoti durūpā supāpikā dassanāya; aḍḍhā ca hoti mahaddhanā mahābhogā mahesakkhā ca?"
    ],
    "innerText": "‘‘Ko pana, bhante, hetu ko paccayo, yena midhekacco mātugāmo dubbaṇṇā ca hoti durūpā supāpikā dassanāya; aḍḍhā ca hoti mahaddhanā mahābhogā mahesakkhā ca?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ko nu kho, bhante, hetu ko paccayo, yena midhekacco mātugāmo abhirūpā ca hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā; daliddā ca hoti appassakā appabhogā appesakkhā ca?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ko ",
      " pana, bhante, hetu ko paccayo, yena midhekacco mātugāmo abhirūpā ca hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā, aḍḍhā ca hoti mahaddhanā mahābhogā mahesakkhā cā’’ti?"
    ],
    "innerText": "‘‘Ko pana, bhante, hetu ko paccayo, yena midhekacco mātugāmo abhirūpā ca hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā, aḍḍhā ca hoti mahaddhanā mahābhogā mahesakkhā cā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha ",
      ", mallike, ekacco mātugāmo kodhanā hoti upāyāsabahulā. Appampi vuttā samānā abhisajjati kuppati byāpajjati patitthīyati, kopañca dosañca appaccayañca pātukaroti. Sā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[so (syā.)]"
      },
      " na dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Issāmanikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[issāmanako (syā.)]"
      },
      " kho pana hoti; paralābhasakkāragarukāramānanavandanapūjanāsu issati upadussati issaṃ bandhati. Sā ce tato cutā itthattaṃ āgacchati, sā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[so (syā.)]"
      },
      " yattha yattha paccājāyati dubbaṇṇā ca hoti durūpā supāpikā dassanāya; daliddā ca hoti appassakā appabhogā appesakkhā ca."
    ],
    "innerText": "‘‘Idha , mallike, ekacco mātugāmo kodhanā hoti upāyāsabahulā. Appampi vuttā samānā abhisajjati kuppati byāpajjati patitthīyati, kopañca dosañca appaccayañca pātukaroti. Sā [so (syā.)] na dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Issāmanikā [issāmanako (syā.)] kho pana hoti; paralābhasakkāragarukāramānanavandanapūjanāsu issati upadussati issaṃ bandhati. Sā ce tato cutā itthattaṃ āgacchati, sā [so (syā.)] yattha yattha paccājāyati dubbaṇṇā ca hoti durūpā supāpikā dassanāya; daliddā ca hoti appassakā appabhogā appesakkhā ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, mallike, ekacco mātugāmo kodhanā hoti upāyāsabahulā. Appampi vuttā samānā abhisajjati kuppati byāpajjati patitthīyati, kopañca dosañca appaccayañca pātukaroti. Sā dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Anissāmanikā kho pana hoti; paralābhasakkāragarukāramānanavandanapūjanāsu na issati na upadussati na issaṃ bandhati. Sā ce tato cutā itthattaṃ āgacchati, sā yattha yattha ",
      " paccājāyati dubbaṇṇā ca hoti durūpā supāpikā dassanāya; aḍḍhā ca hoti mahaddhanā mahābhogā mahesakkhā ca."
    ],
    "innerText": "‘‘Idha pana, mallike, ekacco mātugāmo kodhanā hoti upāyāsabahulā. Appampi vuttā samānā abhisajjati kuppati byāpajjati patitthīyati, kopañca dosañca appaccayañca pātukaroti. Sā dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Anissāmanikā kho pana hoti; paralābhasakkāragarukāramānanavandanapūjanāsu na issati na upadussati na issaṃ bandhati. Sā ce tato cutā itthattaṃ āgacchati, sā yattha yattha paccājāyati dubbaṇṇā ca hoti durūpā supāpikā dassanāya; aḍḍhā ca hoti mahaddhanā mahābhogā mahesakkhā ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, mallike, ekacco mātugāmo akkodhanā hoti anupāyāsabahulā. Bahumpi vuttā ",
      " samānā nābhisajjati na kuppati na byāpajjati na patitthīyati, na kopañca dosañca appaccayañca pātukaroti. Sā na dātā hoti samaṇassa ",
      " vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Issāmanikā kho pana hoti; paralābhasakkāragarukāramānanavandanapūjanāsu issati upadussati issaṃ bandhati. Sā ce tato cutā itthattaṃ āgacchati, sā yattha ",
      " yattha paccājāyati abhirūpā ca hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā; daliddā ca hoti appassakā appabhogā appesakkhā ca."
    ],
    "innerText": "‘‘Idha pana, mallike, ekacco mātugāmo akkodhanā hoti anupāyāsabahulā. Bahumpi vuttā samānā nābhisajjati na kuppati na byāpajjati na patitthīyati, na kopañca dosañca appaccayañca pātukaroti. Sā na dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Issāmanikā kho pana hoti; paralābhasakkāragarukāramānanavandanapūjanāsu issati upadussati issaṃ bandhati. Sā ce tato cutā itthattaṃ āgacchati, sā yattha yattha paccājāyati abhirūpā ca hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā; daliddā ca hoti appassakā appabhogā appesakkhā ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha pana, mallike, ekacco mātugāmo akkodhanā hoti anupāyāsabahulā. Bahumpi vuttā samānā nābhisajjati na kuppati na byāpajjati na patitthīyati, na kopañca dosañca appaccayañca pātukaroti. Sā dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Anissāmanikā kho pana hoti; paralābhasakkāragarukāramānanavandanapūjanāsu na issati na upadussati na issaṃ bandhati. Sā ce tato cutā itthattaṃ āgacchati, sā yattha yattha paccājāyati abhirūpā ca hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā; aḍḍhā ca hoti mahaddhanā mahābhogā mahesakkhā ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ayaṃ kho, mallike, hetu ayaṃ paccayo, yena midhekacco mātugāmo dubbaṇṇā ca hoti durūpā supāpikā dassanāya; daliddā ca hoti appassakā appabhogā appesakkhā ca. Ayaṃ pana, mallike, hetu ayaṃ paccayo, yena midhekacco mātugāmo dubbaṇṇā ca hoti durūpā supāpikā dassanāya; aḍḍhā ca hoti mahaddhanā mahābhogā ",
      " mahesakkhā ca. Ayaṃ kho, mallike, hetu ayaṃ paccayo, yena midhekacco mātugāmo abhirūpā ca hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā; daliddā ca hoti appassakā appabhogā appesakkhā ca. Ayaṃ pana, mallike, hetu ayaṃ paccayo, yena midhekacco mātugāmo abhirūpā ca hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā; aḍḍhā ca hoti mahaddhanā mahābhogā mahesakkhā cā’’ti."
    ],
    "innerText": "‘‘Ayaṃ kho, mallike, hetu ayaṃ paccayo, yena midhekacco mātugāmo dubbaṇṇā ca hoti durūpā supāpikā dassanāya; daliddā ca hoti appassakā appabhogā appesakkhā ca. Ayaṃ pana, mallike, hetu ayaṃ paccayo, yena midhekacco mātugāmo dubbaṇṇā ca hoti durūpā supāpikā dassanāya; aḍḍhā ca hoti mahaddhanā mahābhogā mahesakkhā ca. Ayaṃ kho, mallike, hetu ayaṃ paccayo, yena midhekacco mātugāmo abhirūpā ca hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā; daliddā ca hoti appassakā appabhogā appesakkhā ca. Ayaṃ pana, mallike, hetu ayaṃ paccayo, yena midhekacco mātugāmo abhirūpā ca hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā; aḍḍhā ca hoti mahaddhanā mahābhogā mahesakkhā cā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vutte mallikā devī bhagavantaṃ etadavoca – ‘‘yā nūnāhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sā nūnāhaṃ (syā.), yaṃ nūnāhaṃ (ka.)]"
      },
      " bhante, aññaṃ jātiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[aññāya jātiyā (syā.)]"
      },
      " kodhanā ",
      " ahosiṃ upāyāsabahulā, appampi vuttā samānā ",
      " abhisajjiṃ kuppiṃ byāpajjiṃ ",
      " patitthīyiṃ kopañca dosañca appaccayañca pātvākāsiṃ, sāhaṃ, bhante, etarahi dubbaṇṇā durūpā supāpikā dassanāya."
    ],
    "innerText": "Evaṃ vutte mallikā devī bhagavantaṃ etadavoca – ‘‘yā nūnāhaṃ [sā nūnāhaṃ (syā.), yaṃ nūnāhaṃ (ka.)] bhante, aññaṃ jātiṃ [aññāya jātiyā (syā.)] kodhanā ahosiṃ upāyāsabahulā, appampi vuttā samānā abhisajjiṃ kuppiṃ byāpajjiṃ patitthīyiṃ kopañca dosañca appaccayañca pātvākāsiṃ, sāhaṃ, bhante, etarahi dubbaṇṇā durūpā supāpikā dassanāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yā nūnāhaṃ, bhante, aññaṃ jātiṃ dātā ahosiṃ samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ, sāhaṃ, bhante, etarahi aḍḍhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[aḍḍhā ca (sī. pī. ka.)]"
      },
      " mahaddhanā mahābhogā."
    ],
    "innerText": "‘‘Yā nūnāhaṃ, bhante, aññaṃ jātiṃ dātā ahosiṃ samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ, sāhaṃ, bhante, etarahi aḍḍhā [aḍḍhā ca (sī. pī. ka.)] mahaddhanā mahābhogā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yā nūnāhaṃ, bhante, aññaṃ jātiṃ anissāmanikā ahosiṃ, paralābhasakkāragarukāramānanavandanapūjanāsu na issiṃ na upadussiṃ na issaṃ bandhiṃ, sāhaṃ, bhante, etarahi mahesakkhā. Santi kho pana, bhante, imasmiṃ rājakule khattiyakaññāpi brāhmaṇakaññāpi gahapatikaññāpi, tāsāhaṃ issarādhipaccaṃ kāremi. Esāhaṃ, bhante, ajjatagge akkodhanā bhavissāmi anupāyāsabahulā, bahumpi vuttā ",
      " samānā nābhisajjissāmi na kuppissāmi na byāpajjissāmi na patitthīyissāmi, kopañca dosañca appaccayañca na pātukarissāmi; dassāmi samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Anissāmanikā bhavissāmi, paralābhasakkāragarukāramānanavandanapūjanāsu na ississāmi na upadussissāmi na issaṃ bandhissāmi. Abhikkantaṃ, bhante…pe… upāsikaṃ maṃ, bhante, bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Sattamaṃ."
    ],
    "innerText": "‘‘Yā nūnāhaṃ, bhante, aññaṃ jātiṃ anissāmanikā ahosiṃ, paralābhasakkāragarukāramānanavandanapūjanāsu na issiṃ na upadussiṃ na issaṃ bandhiṃ, sāhaṃ, bhante, etarahi mahesakkhā. Santi kho pana, bhante, imasmiṃ rājakule khattiyakaññāpi brāhmaṇakaññāpi gahapatikaññāpi, tāsāhaṃ issarādhipaccaṃ kāremi. Esāhaṃ, bhante, ajjatagge akkodhanā bhavissāmi anupāyāsabahulā, bahumpi vuttā samānā nābhisajjissāmi na kuppissāmi na byāpajjissāmi na patitthīyissāmi, kopañca dosañca appaccayañca na pātukarissāmi; dassāmi samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Anissāmanikā bhavissāmi, paralābhasakkāragarukāramānanavandanapūjanāsu na ississāmi na upadussissāmi na issaṃ bandhissāmi. Abhikkantaṃ, bhante…pe… upāsikaṃ maṃ, bhante, bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Attantapasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "198"
      },
      ". ‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pu. pa. 174; ma. ni. 2.7; dī. ni. 3.314; a. ni. 3.157-163]"
      },
      " puggalo attantapo hoti attaparitāpanānuyogamanuyutto. Idha pana, bhikkhave, ekacco puggalo parantapo hoti paraparitāpanānuyogamanuyutto. Idha pana, bhikkhave, ekacco puggalo attantapo ca hoti attaparitāpanānuyogamanuyutto, parantapo ca paraparitāpanānuyogamanuyutto. Idha pana, bhikkhave, ekacco puggalo nevattantapo hoti nāttaparitāpanānuyogamanuyutto ",
      " na parantapo na paraparitāpanānuyogamanuyutto. So neva attantapo ",
      " na parantapo diṭṭheva dhamme nicchāto nibbuto sītībhūto sukhappaṭisaṃvedī brahmabhūtena attanā viharati."
    ],
    "innerText": "198. ‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco [pu. pa. 174; ma. ni. 2.7; dī. ni. 3.314; a. ni. 3.157-163] puggalo attantapo hoti attaparitāpanānuyogamanuyutto. Idha pana, bhikkhave, ekacco puggalo parantapo hoti paraparitāpanānuyogamanuyutto. Idha pana, bhikkhave, ekacco puggalo attantapo ca hoti attaparitāpanānuyogamanuyutto, parantapo ca paraparitāpanānuyogamanuyutto. Idha pana, bhikkhave, ekacco puggalo nevattantapo hoti nāttaparitāpanānuyogamanuyutto na parantapo na paraparitāpanānuyogamanuyutto. So neva attantapo na parantapo diṭṭheva dhamme nicchāto nibbuto sītībhūto sukhappaṭisaṃvedī brahmabhūtena attanā viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, puggalo attantapo hoti attaparitāpanānuyogamanuyutto? Idha, bhikkhave, ekacco acelako hoti muttācāro hatthāpalekhano naehibhaddantiko natiṭṭhabhaddantiko ",
      " nābhihaṭaṃ na uddissakataṃ na nimantanaṃ sādiyati. So na kumbhimukhā paṭiggaṇhāti, na kaḷopimukhā paṭiggaṇhāti, na eḷakamantaraṃ na daṇḍamantaraṃ na musalamantaraṃ na dvinnaṃ bhuñjamānānaṃ na gabbhiniyā na pāyamānāya na purisantaragatāya na saṅkittīsu na yattha sā upaṭṭhito hoti na yattha makkhikā saṇḍasaṇḍacārinī na macchaṃ na maṃsaṃ na suraṃ na merayaṃ na thusodakaṃ pivati. So ekāgāriko vā hoti ekālopiko dvāgāriko vā hoti dvālopiko…pe… sattāgāriko vā hoti sattālopiko; ekissāpi dattiyā yāpeti dvīhipi dattīhi yāpeti…pe… sattahipi dattīhi yāpeti; ekāhikampi āhāraṃ āhāreti dvāhikampi āhāraṃ āhāreti…pe… sattāhikampi āhāraṃ āhāreti. Iti evarūpaṃ aḍḍhamāsikampi pariyāyabhattabhojanānuyogamanuyutto viharati."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, puggalo attantapo hoti attaparitāpanānuyogamanuyutto? Idha, bhikkhave, ekacco acelako hoti muttācāro hatthāpalekhano naehibhaddantiko natiṭṭhabhaddantiko nābhihaṭaṃ na uddissakataṃ na nimantanaṃ sādiyati. So na kumbhimukhā paṭiggaṇhāti, na kaḷopimukhā paṭiggaṇhāti, na eḷakamantaraṃ na daṇḍamantaraṃ na musalamantaraṃ na dvinnaṃ bhuñjamānānaṃ na gabbhiniyā na pāyamānāya na purisantaragatāya na saṅkittīsu na yattha sā upaṭṭhito hoti na yattha makkhikā saṇḍasaṇḍacārinī na macchaṃ na maṃsaṃ na suraṃ na merayaṃ na thusodakaṃ pivati. So ekāgāriko vā hoti ekālopiko dvāgāriko vā hoti dvālopiko…pe… sattāgāriko vā hoti sattālopiko; ekissāpi dattiyā yāpeti dvīhipi dattīhi yāpeti…pe… sattahipi dattīhi yāpeti; ekāhikampi āhāraṃ āhāreti dvāhikampi āhāraṃ āhāreti…pe… sattāhikampi āhāraṃ āhāreti. Iti evarūpaṃ aḍḍhamāsikampi pariyāyabhattabhojanānuyogamanuyutto viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘So sākabhakkhopi hoti sāmākabhakkhopi hoti nīvārabhakkhopi hoti daddulabhakkhopi hoti haṭabhakkhopi hoti kaṇabhakkhopi hoti ācāmabhakkhopi hoti piññākabhakkhopi hoti tiṇabhakkhopi hoti gomayabhakkhopi hoti; vanamūlaphalāhāropi yāpeti pavattaphalabhojī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So sāṇānipi dhāreti masāṇānipi dhāreti chavadussānipi dhāreti paṃsukūlānipi dhāreti tirīṭānipi dhāreti ajinampi dhāreti ajinakkhipampi dhāreti kusacīrampi dhāreti vākacīrampi dhāreti phalakacīrampi dhāreti kesakambalampi dhāreti vāḷakambalampi dhāreti ulūkapakkhampi dhāreti; kesamassulocakopi hoti kesamassulocanānuyogamanuyutto; ubbhaṭṭhakopi hoti āsanappaṭikkhitto; ukkuṭikopi ",
      " hoti ukkuṭikappadhānamanuyutto; kaṇṭakāpassayikopi hoti kaṇṭakāpassaye seyyaṃ kappeti; sāyatatiyakampi udakorohanānuyogamanuyutto ",
      " viharati. Iti evarūpaṃ anekavihitaṃ kāyassa ātāpanaparitāpanānuyogamanuyutto ",
      " viharati. Evaṃ kho, bhikkhave, puggalo attantapo hoti attaparitāpanānuyogamanuyutto."
    ],
    "innerText": "‘‘So sāṇānipi dhāreti masāṇānipi dhāreti chavadussānipi dhāreti paṃsukūlānipi dhāreti tirīṭānipi dhāreti ajinampi dhāreti ajinakkhipampi dhāreti kusacīrampi dhāreti vākacīrampi dhāreti phalakacīrampi dhāreti kesakambalampi dhāreti vāḷakambalampi dhāreti ulūkapakkhampi dhāreti; kesamassulocakopi hoti kesamassulocanānuyogamanuyutto; ubbhaṭṭhakopi hoti āsanappaṭikkhitto; ukkuṭikopi hoti ukkuṭikappadhānamanuyutto; kaṇṭakāpassayikopi hoti kaṇṭakāpassaye seyyaṃ kappeti; sāyatatiyakampi udakorohanānuyogamanuyutto viharati. Iti evarūpaṃ anekavihitaṃ kāyassa ātāpanaparitāpanānuyogamanuyutto viharati. Evaṃ kho, bhikkhave, puggalo attantapo hoti attaparitāpanānuyogamanuyutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, puggalo parantapo hoti paraparitāpanānuyogamanuyutto? Idha, bhikkhave, ekacco puggalo orabbhiko hoti sūkariko sākuṇiko māgaviko luddo macchaghātako coro coraghātako goghātako bandhanāgāriko, ye vā panaññepi keci kurūrakammantā. Evaṃ kho, bhikkhave, puggalo parantapo hoti paraparitāpanānuyogamanuyutto."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, puggalo parantapo hoti paraparitāpanānuyogamanuyutto? Idha, bhikkhave, ekacco puggalo orabbhiko hoti sūkariko sākuṇiko māgaviko luddo macchaghātako coro coraghātako goghātako bandhanāgāriko, ye vā panaññepi keci kurūrakammantā. Evaṃ kho, bhikkhave, puggalo parantapo hoti paraparitāpanānuyogamanuyutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, puggalo attantapo ca hoti attaparitāpanānuyogamanuyutto parantapo ca paraparitāpanānuyogamanuyutto? Idha, bhikkhave, ekacco puggalo rājā vā hoti khattiyo muddhāvasitto, brāhmaṇo vā hoti mahāsālo. So puratthimena nagarassa navaṃ santhāgāraṃ kārāpetvā kesamassuṃ ohāretvā kharājinaṃ nivāsetvā sappitelena kāyaṃ abbhañjitvā magavisāṇena piṭṭhiṃ kaṇḍuvamāno navaṃ santhāgāraṃ pavisati, saddhiṃ mahesiyā brāhmaṇena ca purohitena. So tattha anantarahitāya bhūmiyā haritupalittāya seyyaṃ kappeti. Ekissāya gāviyā sarūpavacchāya yaṃ ekasmiṃ thane khīraṃ hoti tena rājā yāpeti; yaṃ dutiyasmiṃ thane khīraṃ hoti tena mahesī yāpeti; yaṃ tatiyasmiṃ thane khīraṃ hoti tena brāhmaṇo purohito yāpeti; yaṃ catutthasmiṃ thane ",
      " khīraṃ hoti tena aggiṃ juhati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[juhanti (sī. pī.)]"
      },
      "; avasesena vacchako yāpeti. So evamāha – ‘ettakā usabhā haññantu yaññatthāya, ettakā vacchatarā haññantu yaññatthāya, ettakā vacchatariyo haññantu yaññatthāya, ettakā ajā haññantu yaññatthāya, ettakā urabbhā haññantu yaññatthāya, (ettakā assā haññantu yaññatthāya,) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[( ) natthi sī. syā. kaṃ. pī. potthakesu]"
      },
      " ettakā rukkhā chijjantu yūpatthāya, ettakā dabbhā lūyantu barihisatthāyā’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[parikammatthāyāti (ka.)]"
      },
      ". Yepissa ",
      " te honti dāsāti vā pessāti vā kammakarāti vā tepi daṇḍatajjitā bhayatajjitā assumukhā rudamānā parikammāni karonti. Evaṃ kho, bhikkhave, puggalo attantapo ca hoti attaparitāpanānuyogamanuyutto parantapo ca paraparitāpanānuyogamanuyutto."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, puggalo attantapo ca hoti attaparitāpanānuyogamanuyutto parantapo ca paraparitāpanānuyogamanuyutto? Idha, bhikkhave, ekacco puggalo rājā vā hoti khattiyo muddhāvasitto, brāhmaṇo vā hoti mahāsālo. So puratthimena nagarassa navaṃ santhāgāraṃ kārāpetvā kesamassuṃ ohāretvā kharājinaṃ nivāsetvā sappitelena kāyaṃ abbhañjitvā magavisāṇena piṭṭhiṃ kaṇḍuvamāno navaṃ santhāgāraṃ pavisati, saddhiṃ mahesiyā brāhmaṇena ca purohitena. So tattha anantarahitāya bhūmiyā haritupalittāya seyyaṃ kappeti. Ekissāya gāviyā sarūpavacchāya yaṃ ekasmiṃ thane khīraṃ hoti tena rājā yāpeti; yaṃ dutiyasmiṃ thane khīraṃ hoti tena mahesī yāpeti; yaṃ tatiyasmiṃ thane khīraṃ hoti tena brāhmaṇo purohito yāpeti; yaṃ catutthasmiṃ thane khīraṃ hoti tena aggiṃ juhati [juhanti (sī. pī.)]; avasesena vacchako yāpeti. So evamāha – ‘ettakā usabhā haññantu yaññatthāya, ettakā vacchatarā haññantu yaññatthāya, ettakā vacchatariyo haññantu yaññatthāya, ettakā ajā haññantu yaññatthāya, ettakā urabbhā haññantu yaññatthāya, (ettakā assā haññantu yaññatthāya,) [( ) natthi sī. syā. kaṃ. pī. potthakesu] ettakā rukkhā chijjantu yūpatthāya, ettakā dabbhā lūyantu barihisatthāyā’ti [parikammatthāyāti (ka.)]. Yepissa te honti dāsāti vā pessāti vā kammakarāti vā tepi daṇḍatajjitā bhayatajjitā assumukhā rudamānā parikammāni karonti. Evaṃ kho, bhikkhave, puggalo attantapo ca hoti attaparitāpanānuyogamanuyutto parantapo ca paraparitāpanānuyogamanuyutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, puggalo nevattantapo hoti nāttaparitāpanānuyogamanuyutto na parantapo na paraparitāpanānuyogamanuyutto? So anattantapo aparantapo diṭṭheva dhamme nicchāto nibbuto sītībhūto sukhappaṭisaṃvedī brahmabhūtena attanā viharati. Idha, bhikkhave, tathāgato loke uppajjati arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ",
      " ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Taṃ dhammaṃ suṇāti gahapati vā gahapatiputto vā aññatarasmiṃ ",
      " vā kule paccājāto. So taṃ dhammaṃ sutvā tathāgate saddhaṃ paṭilabhati. So tena saddhāpaṭilābhena samannāgato iti paṭisañcikkhati – ‘sambādho gharāvāso rajāpatho, abbhokāso pabbajjā; nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ; yaṃnūnāhaṃ kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajeyya’nti. So aparena samayena appaṃ vā bhogakkhandhaṃ pahāya, mahantaṃ vā bhogakkhandhaṃ pahāya, appaṃ vā ñātiparivaṭṭaṃ pahāya, mahantaṃ vā ñātiparivaṭṭaṃ pahāya, kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajati."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, puggalo nevattantapo hoti nāttaparitāpanānuyogamanuyutto na parantapo na paraparitāpanānuyogamanuyutto? So anattantapo aparantapo diṭṭheva dhamme nicchāto nibbuto sītībhūto sukhappaṭisaṃvedī brahmabhūtena attanā viharati. Idha, bhikkhave, tathāgato loke uppajjati arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Taṃ dhammaṃ suṇāti gahapati vā gahapatiputto vā aññatarasmiṃ vā kule paccājāto. So taṃ dhammaṃ sutvā tathāgate saddhaṃ paṭilabhati. So tena saddhāpaṭilābhena samannāgato iti paṭisañcikkhati – ‘sambādho gharāvāso rajāpatho, abbhokāso pabbajjā; nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ; yaṃnūnāhaṃ kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajeyya’nti. So aparena samayena appaṃ vā bhogakkhandhaṃ pahāya, mahantaṃ vā bhogakkhandhaṃ pahāya, appaṃ vā ñātiparivaṭṭaṃ pahāya, mahantaṃ vā ñātiparivaṭṭaṃ pahāya, kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So evaṃ pabbajito samāno bhikkhūnaṃ sikkhāsājīvasamāpanno pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharati. Adinnādānaṃ pahāya adinnādānā paṭivirato ",
      " hoti dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharati. Abrahmacariyaṃ pahāya brahmacārī hoti ārācārī virato asaddhammā gāmadhammā. Musāvādaṃ pahāya musāvādā paṭivirato hoti saccavādī saccasandho theto paccayiko avisaṃvādako lokassa. Pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato hoti, na ito sutvā amutra akkhātā imesaṃ bhedāya, na amutra vā sutvā imesaṃ akkhātā amūsaṃ ",
      " bhedāya; iti bhinnānaṃ vā sandhātā, sahitānaṃ vā anuppadātā, samaggārāmo samaggarato ",
      " samagganandī samaggakaraṇiṃ vācaṃ bhāsitā hoti. Pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti; yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṃ vācaṃ bhāsitā hoti. Samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti kālavādī bhūtavādī attavādī dhammavādī vinayavādī; nidhānavatiṃ vācaṃ bhāsitā hoti kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ."
    ],
    "innerText": "‘‘So evaṃ pabbajito samāno bhikkhūnaṃ sikkhāsājīvasamāpanno pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharati. Adinnādānaṃ pahāya adinnādānā paṭivirato hoti dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharati. Abrahmacariyaṃ pahāya brahmacārī hoti ārācārī virato asaddhammā gāmadhammā. Musāvādaṃ pahāya musāvādā paṭivirato hoti saccavādī saccasandho theto paccayiko avisaṃvādako lokassa. Pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato hoti, na ito sutvā amutra akkhātā imesaṃ bhedāya, na amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya; iti bhinnānaṃ vā sandhātā, sahitānaṃ vā anuppadātā, samaggārāmo samaggarato samagganandī samaggakaraṇiṃ vācaṃ bhāsitā hoti. Pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti; yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṃ vācaṃ bhāsitā hoti. Samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti kālavādī bhūtavādī attavādī dhammavādī vinayavādī; nidhānavatiṃ vācaṃ bhāsitā hoti kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So bījagāmabhūtagāmasamārambhā paṭivirato hoti. Ekabhattiko hoti rattūparato virato vikālabhojanā. Naccagītavāditavisūkadassanā paṭivirato hoti. Mālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā ",
      " paṭivirato hoti. Uccāsayanamahāsayanā paṭivirato hoti. Jātarūparajatapaṭiggahaṇā paṭivirato hoti. Āmakadhaññapaṭiggahaṇā paṭivirato hoti. Āmakamaṃsapaṭiggahaṇā paṭivirato hoti. Itthikumārikapaṭiggahaṇā paṭivirato hoti. Dāsidāsapaṭiggahaṇā paṭivirato hoti. Ajeḷakapaṭiggahaṇā paṭivirato hoti. Kukkuṭasūkarapaṭiggahaṇā paṭivirato hoti. Hatthigavāssavaḷavapaṭiggahaṇā paṭivirato hoti. Khettavatthupaṭiggahaṇā paṭivirato hoti. Dūteyyapahiṇagamanānuyogā paṭivirato hoti. Kayavikkayā paṭivirato hoti. Tulākūṭakaṃsakūṭamānakūṭā paṭivirato hoti. Ukkoṭanavañcananikatisāciyogā paṭivirato hoti. Chedanavadhabandhanaviparāmosaālopasahasākārā paṭivirato hoti."
    ],
    "innerText": "‘‘So bījagāmabhūtagāmasamārambhā paṭivirato hoti. Ekabhattiko hoti rattūparato virato vikālabhojanā. Naccagītavāditavisūkadassanā paṭivirato hoti. Mālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato hoti. Uccāsayanamahāsayanā paṭivirato hoti. Jātarūparajatapaṭiggahaṇā paṭivirato hoti. Āmakadhaññapaṭiggahaṇā paṭivirato hoti. Āmakamaṃsapaṭiggahaṇā paṭivirato hoti. Itthikumārikapaṭiggahaṇā paṭivirato hoti. Dāsidāsapaṭiggahaṇā paṭivirato hoti. Ajeḷakapaṭiggahaṇā paṭivirato hoti. Kukkuṭasūkarapaṭiggahaṇā paṭivirato hoti. Hatthigavāssavaḷavapaṭiggahaṇā paṭivirato hoti. Khettavatthupaṭiggahaṇā paṭivirato hoti. Dūteyyapahiṇagamanānuyogā paṭivirato hoti. Kayavikkayā paṭivirato hoti. Tulākūṭakaṃsakūṭamānakūṭā paṭivirato hoti. Ukkoṭanavañcananikatisāciyogā paṭivirato hoti. Chedanavadhabandhanaviparāmosaālopasahasākārā paṭivirato hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati samādāyeva pakkamati. Seyyathāpi nāma pakkhī sakuṇo yena yeneva ",
      " ḍeti, sapattabhārova ḍeti; evamevaṃ bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati ",
      ", samādāyeva pakkamati. So iminā ariyena sīlakkhandhena samannāgato ajjhattaṃ anavajjasukhaṃ paṭisaṃvedeti."
    ],
    "innerText": "‘‘So santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati samādāyeva pakkamati. Seyyathāpi nāma pakkhī sakuṇo yena yeneva ḍeti, sapattabhārova ḍeti; evamevaṃ bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati , samādāyeva pakkamati. So iminā ariyena sīlakkhandhena samannāgato ajjhattaṃ anavajjasukhaṃ paṭisaṃvedeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā ",
      " dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati cakkhundriyaṃ; cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati manindriyaṃ; manindriye saṃvaraṃ āpajjati. So iminā ariyena indriyasaṃvarena samannāgato ajjhattaṃ abyāsekasukhaṃ paṭisaṃvedeti."
    ],
    "innerText": "‘‘So cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati cakkhundriyaṃ; cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati manindriyaṃ; manindriye saṃvaraṃ āpajjati. So iminā ariyena indriyasaṃvarena samannāgato ajjhattaṃ abyāsekasukhaṃ paṭisaṃvedeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī ",
      " hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti ",
      "."
    ],
    "innerText": "‘‘So abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So iminā ca ariyena sīlakkhandhena samannāgato, (imāya ca ariyāya santuṭṭhiyā samannāgato,) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[( ) natthi sī. syā. potthakesu. ma. ni. 1.296; ma. ni. 2.13 passitabbaṃ]"
      },
      " iminā ca ariyena indriyasaṃvarena samannāgato, iminā ca ariyena satisampajaññena samannāgato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samannāgato. so (ka.)]"
      },
      " vivittaṃ senāsanaṃ bhajati araññaṃ rukkhamūlaṃ pabbataṃ kandaraṃ giriguhaṃ susānaṃ vanappatthaṃ abbhokāsaṃ palālapuñjaṃ. So pacchābhattaṃ piṇḍapātapaṭikkanto nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So abhijjhaṃ loke pahāya vigatābhijjhena cetasā viharati, abhijjhāya cittaṃ parisodheti. Byāpādapadosaṃ pahāya abyāpannacitto viharati sabbapāṇabhūtahitānukampī, byāpādapadosā cittaṃ parisodheti. Thinamiddhaṃ pahāya ",
      " vigatathinamiddho viharati ālokasaññī sato sampajāno, thinamiddhā cittaṃ parisodheti. Uddhaccakukkuccaṃ pahāya anuddhato viharati ajjhattaṃ vūpasantacitto, uddhaccakukkuccā cittaṃ parisodheti. Vicikicchaṃ pahāya tiṇṇavicikiccho viharati akathaṃkathī kusalesu dhammesu, vicikicchāya cittaṃ parisodheti. So ime pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe vivicceva kāmehi…pe… catutthaṃ jhānaṃ upasampajja viharati."
    ],
    "innerText": "‘‘So iminā ca ariyena sīlakkhandhena samannāgato, (imāya ca ariyāya santuṭṭhiyā samannāgato,) [( ) natthi sī. syā. potthakesu. ma. ni. 1.296; ma. ni. 2.13 passitabbaṃ] iminā ca ariyena indriyasaṃvarena samannāgato, iminā ca ariyena satisampajaññena samannāgato [samannāgato. so (ka.)] vivittaṃ senāsanaṃ bhajati araññaṃ rukkhamūlaṃ pabbataṃ kandaraṃ giriguhaṃ susānaṃ vanappatthaṃ abbhokāsaṃ palālapuñjaṃ. So pacchābhattaṃ piṇḍapātapaṭikkanto nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So abhijjhaṃ loke pahāya vigatābhijjhena cetasā viharati, abhijjhāya cittaṃ parisodheti. Byāpādapadosaṃ pahāya abyāpannacitto viharati sabbapāṇabhūtahitānukampī, byāpādapadosā cittaṃ parisodheti. Thinamiddhaṃ pahāya vigatathinamiddho viharati ālokasaññī sato sampajāno, thinamiddhā cittaṃ parisodheti. Uddhaccakukkuccaṃ pahāya anuddhato viharati ajjhattaṃ vūpasantacitto, uddhaccakukkuccā cittaṃ parisodheti. Vicikicchaṃ pahāya tiṇṇavicikiccho viharati akathaṃkathī kusalesu dhammesu, vicikicchāya cittaṃ parisodheti. So ime pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe vivicceva kāmehi…pe… catutthaṃ jhānaṃ upasampajja viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So ",
      " evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya…pe… ",
      " sattānaṃ cutūpapātañāṇāya…pe… ",
      " (so evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte) āsavānaṃ khayañāṇāya cittaṃ abhininnāmeti. So ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. ‘Ime āsavā’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavasamudayo’ti yathābhūtaṃ pajānāti ",
      ", ‘ayaṃ āsavanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti."
    ],
    "innerText": "‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya…pe… sattānaṃ cutūpapātañāṇāya…pe… (so evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte) āsavānaṃ khayañāṇāya cittaṃ abhininnāmeti. So ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. ‘Ime āsavā’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavasamudayo’ti yathābhūtaṃ pajānāti , ‘ayaṃ āsavanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tassa evaṃ jānato evaṃ passato kāmāsavāpi cittaṃ vimuccati, bhavāsavāpi cittaṃ vimuccati, avijjāsavāpi cittaṃ vimuccati; vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāti. Evaṃ kho, bhikkhave, puggalo nevattantapo hoti nāttaparitāpanānuyogamanuyutto na parantapo na paraparitāpanānuyogamanuyutto. So na attantapo na parantapo diṭṭheva dhamme nicchāto nibbuto sītībhūto sukhappaṭisaṃvedī brahmabhūtena attanā viharati. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Taṇhāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "199"
      },
      ". Bhagavā etadavoca – ‘‘taṇhaṃ vo, bhikkhave, desessāmi jāliniṃ saritaṃ visaṭaṃ visattikaṃ, yāya ayaṃ loko uddhasto pariyonaddho tantākulakajāto gulāguṇṭhikajāto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kulāguṇṭhikajāto (sī. syā. kaṃ. pī.) a. ni. aṭṭha. 2.4.199]"
      },
      " muñjapabbajabhūto ",
      " apāyaṃ duggatiṃ vinipātaṃ saṃsāraṃ nātivattati. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "199. Bhagavā etadavoca – ‘‘taṇhaṃ vo, bhikkhave, desessāmi jāliniṃ saritaṃ visaṭaṃ visattikaṃ, yāya ayaṃ loko uddhasto pariyonaddho tantākulakajāto gulāguṇṭhikajāto [kulāguṇṭhikajāto (sī. syā. kaṃ. pī.) a. ni. aṭṭha. 2.4.199] muñjapabbajabhūto apāyaṃ duggatiṃ vinipātaṃ saṃsāraṃ nātivattati. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca sā, bhikkhave, taṇhā jālinī saritā visaṭā visattikā, yāya ayaṃ loko uddhasto pariyonaddho tantākulakajāto gulāguṇṭhikajāto muñjapabbajabhūto apāyaṃ duggatiṃ vinipātaṃ saṃsāraṃ nātivattati ",
      "? Aṭṭhārasa kho panimāni, bhikkhave, taṇhāvicaritāni ajjhattikassa upādāya, aṭṭhārasa taṇhāvicaritāni bāhirassa upādāya."
    ],
    "innerText": "‘‘Katamā ca sā, bhikkhave, taṇhā jālinī saritā visaṭā visattikā, yāya ayaṃ loko uddhasto pariyonaddho tantākulakajāto gulāguṇṭhikajāto muñjapabbajabhūto apāyaṃ duggatiṃ vinipātaṃ saṃsāraṃ nātivattati ? Aṭṭhārasa kho panimāni, bhikkhave, taṇhāvicaritāni ajjhattikassa upādāya, aṭṭhārasa taṇhāvicaritāni bāhirassa upādāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamāni aṭṭhārasa taṇhāvicaritāni ajjhattikassa upādāya? Asmīti, bhikkhave, sati itthasmīti hoti, evaṃsmīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[evamasmi (sī.), evasmi (syā. kaṃ. pī.) vibha. 973 passitabbaṃ]"
      },
      " hoti, aññathāsmīti hoti, asasmīti hoti, satasmīti hoti, santi hoti, itthaṃ santi hoti, evaṃ santi hoti, aññathā santi hoti, apihaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[apiha (sī. pī.), api (syā. kaṃ.)]"
      },
      " santi hoti, apihaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[api (sī. syā. kaṃ. pī.)]"
      },
      " itthaṃ santi hoti, apihaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[api (sī. syā. kaṃ. pī.)]"
      },
      " evaṃ santi hoti, apihaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[api (sī. syā. kaṃ. pī.)]"
      },
      " aññathā santi hoti ",
      ", bhavissanti hoti, itthaṃ bhavissanti hoti, evaṃ bhavissanti hoti, aññathā bhavissanti hoti. Imāni aṭṭhārasa taṇhāvicaritāni ajjhattikassa upādāya."
    ],
    "innerText": "‘‘Katamāni aṭṭhārasa taṇhāvicaritāni ajjhattikassa upādāya? Asmīti, bhikkhave, sati itthasmīti hoti, evaṃsmīti [evamasmi (sī.), evasmi (syā. kaṃ. pī.) vibha. 973 passitabbaṃ] hoti, aññathāsmīti hoti, asasmīti hoti, satasmīti hoti, santi hoti, itthaṃ santi hoti, evaṃ santi hoti, aññathā santi hoti, apihaṃ [apiha (sī. pī.), api (syā. kaṃ.)] santi hoti, apihaṃ [api (sī. syā. kaṃ. pī.)] itthaṃ santi hoti, apihaṃ [api (sī. syā. kaṃ. pī.)] evaṃ santi hoti, apihaṃ [api (sī. syā. kaṃ. pī.)] aññathā santi hoti , bhavissanti hoti, itthaṃ bhavissanti hoti, evaṃ bhavissanti hoti, aññathā bhavissanti hoti. Imāni aṭṭhārasa taṇhāvicaritāni ajjhattikassa upādāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamāni aṭṭhārasa taṇhāvicaritāni bāhirassa upādāya? Imināsmīti, bhikkhave, sati iminā itthasmīti hoti, iminā evaṃsmīti hoti, iminā aññathāsmīti hoti, iminā asasmīti hoti, iminā satasmīti hoti, iminā santi hoti, iminā ",
      " itthaṃ santi hoti, iminā evaṃ santi hoti, iminā aññathā santi hoti, iminā apihaṃ santi hoti, iminā apihaṃ itthaṃ santi hoti, iminā apihaṃ evaṃ santi hoti, iminā apihaṃ aññathā santi hoti, iminā bhavissanti hoti, iminā itthaṃ bhavissanti hoti, iminā evaṃ bhavissanti hoti, iminā aññathā bhavissanti hoti. Imāni aṭṭhārasa taṇhāvicaritāni bāhirassa upādāya."
    ],
    "innerText": "‘‘Katamāni aṭṭhārasa taṇhāvicaritāni bāhirassa upādāya? Imināsmīti, bhikkhave, sati iminā itthasmīti hoti, iminā evaṃsmīti hoti, iminā aññathāsmīti hoti, iminā asasmīti hoti, iminā satasmīti hoti, iminā santi hoti, iminā itthaṃ santi hoti, iminā evaṃ santi hoti, iminā aññathā santi hoti, iminā apihaṃ santi hoti, iminā apihaṃ itthaṃ santi hoti, iminā apihaṃ evaṃ santi hoti, iminā apihaṃ aññathā santi hoti, iminā bhavissanti hoti, iminā itthaṃ bhavissanti hoti, iminā evaṃ bhavissanti hoti, iminā aññathā bhavissanti hoti. Imāni aṭṭhārasa taṇhāvicaritāni bāhirassa upādāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Iti aṭṭhārasa taṇhāvicaritāni ajjhattikassa upādāya, aṭṭhārasa taṇhāvicaritāni bāhirassa upādāya. Imāni vuccanti, bhikkhave, chattiṃsa taṇhāvicaritāni. Iti evarūpāni atītāni chattiṃsa taṇhāvicaritāni, anāgatāni chattiṃsa taṇhāvicaritāni ",
      ", paccuppannāni chattiṃsa taṇhāvicaritāni. Evaṃ aṭṭhasataṃ taṇhāvicaritaṃ honti."
    ],
    "innerText": "‘‘Iti aṭṭhārasa taṇhāvicaritāni ajjhattikassa upādāya, aṭṭhārasa taṇhāvicaritāni bāhirassa upādāya. Imāni vuccanti, bhikkhave, chattiṃsa taṇhāvicaritāni. Iti evarūpāni atītāni chattiṃsa taṇhāvicaritāni, anāgatāni chattiṃsa taṇhāvicaritāni , paccuppannāni chattiṃsa taṇhāvicaritāni. Evaṃ aṭṭhasataṃ taṇhāvicaritaṃ honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ayaṃ ",
      " kho sā, bhikkhave, taṇhā jālinī saritā visaṭā visattikā, yāya ayaṃ loko uddhasto pariyonaddho tantākulakajāto gulāguṇṭhikajāto muñjapabbajabhūto apāyaṃ duggatiṃ vinipātaṃ saṃsāraṃ nātivattatī’’ti. Navamaṃ."
    ],
    "innerText": "‘‘Ayaṃ kho sā, bhikkhave, taṇhā jālinī saritā visaṭā visattikā, yāya ayaṃ loko uddhasto pariyonaddho tantākulakajāto gulāguṇṭhikajāto muñjapabbajabhūto apāyaṃ duggatiṃ vinipātaṃ saṃsāraṃ nātivattatī’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Pemasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "200"
      },
      ". ‘‘Cattārimāni, bhikkhave, (pemāni) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[( ) natthi sī. syā. kaṃ. pī. potthakesu]"
      },
      " jāyanti. Katamāni cattāri? Pemā pemaṃ jāyati, pemā doso jāyati, dosā pemaṃ jāyati, dosā doso jāyati."
    ],
    "innerText": "200. ‘‘Cattārimāni, bhikkhave, (pemāni) [( ) natthi sī. syā. kaṃ. pī. potthakesu] jāyanti. Katamāni cattāri? Pemā pemaṃ jāyati, pemā doso jāyati, dosā pemaṃ jāyati, dosā doso jāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, pemā pemaṃ jāyati? Idha, bhikkhave, puggalo puggalassa iṭṭho hoti kanto manāpo. Taṃ pare iṭṭhena kantena manāpena samudācaranti. Tassa evaṃ hoti – ‘yo ",
      " kho myāyaṃ puggalo iṭṭho kanto manāpo, taṃ pare iṭṭhena kantena manāpena samudācarantī’ti ",
      ". So tesu pemaṃ janeti. Evaṃ kho, bhikkhave, pemā pemaṃ jāyati."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, pemā pemaṃ jāyati? Idha, bhikkhave, puggalo puggalassa iṭṭho hoti kanto manāpo. Taṃ pare iṭṭhena kantena manāpena samudācaranti. Tassa evaṃ hoti – ‘yo kho myāyaṃ puggalo iṭṭho kanto manāpo, taṃ pare iṭṭhena kantena manāpena samudācarantī’ti . So tesu pemaṃ janeti. Evaṃ kho, bhikkhave, pemā pemaṃ jāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, pemā doso jāyati? Idha, bhikkhave, puggalo puggalassa iṭṭho hoti kanto manāpo. Taṃ pare aniṭṭhena akantena amanāpena samudācaranti. Tassa evaṃ hoti – ‘yo kho myāyaṃ puggalo iṭṭho kanto manāpo, taṃ pare aniṭṭhena akantena amanāpena samudācarantī’ti. So tesu dosaṃ janeti. Evaṃ kho, bhikkhave, pemā doso jāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, dosā pemaṃ jāyati? Idha, bhikkhave, puggalo puggalassa aniṭṭho hoti akanto amanāpo. Taṃ pare aniṭṭhena akantena amanāpena samudācaranti. Tassa evaṃ hoti – ‘yo kho myāyaṃ puggalo aniṭṭho akanto amanāpo, taṃ pare aniṭṭhena akantena amanāpena samudācarantī’ti. So tesu pemaṃ janeti. Evaṃ kho, bhikkhave, dosā pemaṃ jāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, dosā doso jāyati? Idha, bhikkhave, puggalo puggalassa aniṭṭho hoti akanto amanāpo ",
      ". Taṃ pare iṭṭhena kantena manāpena samudācaranti. Tassa evaṃ hoti – ‘yo kho myāyaṃ puggalo aniṭṭho ",
      " akanto amanāpo, taṃ pare iṭṭhena kantena manāpena samudācarantī’ti. So tesu dosaṃ janeti. Evaṃ kho, bhikkhave, dosā doso jāyati. Imāni kho, bhikkhave, cattāri pemāni jāyanti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, dosā doso jāyati? Idha, bhikkhave, puggalo puggalassa aniṭṭho hoti akanto amanāpo . Taṃ pare iṭṭhena kantena manāpena samudācaranti. Tassa evaṃ hoti – ‘yo kho myāyaṃ puggalo aniṭṭho akanto amanāpo, taṃ pare iṭṭhena kantena manāpena samudācarantī’ti. So tesu dosaṃ janeti. Evaṃ kho, bhikkhave, dosā doso jāyati. Imāni kho, bhikkhave, cattāri pemāni jāyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yasmiṃ, bhikkhave, samaye bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati, yampissa pemā pemaṃ jāyati tampissa tasmiṃ ",
      " samaye na hoti, yopissa pemā doso jāyati sopissa tasmiṃ samaye na hoti, yampissa dosā pemaṃ jāyati tampissa tasmiṃ samaye na hoti, yopissa dosā doso jāyati sopissa tasmiṃ samaye na hoti."
    ],
    "innerText": "‘‘Yasmiṃ, bhikkhave, samaye bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati, yampissa pemā pemaṃ jāyati tampissa tasmiṃ samaye na hoti, yopissa pemā doso jāyati sopissa tasmiṃ samaye na hoti, yampissa dosā pemaṃ jāyati tampissa tasmiṃ samaye na hoti, yopissa dosā doso jāyati sopissa tasmiṃ samaye na hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yasmiṃ, bhikkhave, samaye bhikkhu vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ ",
      " jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati, yampissa pemā pemaṃ jāyati tampissa tasmiṃ samaye na hoti, yopissa pemā doso jāyati sopissa tasmiṃ samaye na hoti, yampissa dosā pemaṃ jāyati tampissa tasmiṃ samaye na hoti, yopissa dosā doso jāyati sopissa tasmiṃ samaye na hoti."
    ],
    "innerText": "‘‘Yasmiṃ, bhikkhave, samaye bhikkhu vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati, yampissa pemā pemaṃ jāyati tampissa tasmiṃ samaye na hoti, yopissa pemā doso jāyati sopissa tasmiṃ samaye na hoti, yampissa dosā pemaṃ jāyati tampissa tasmiṃ samaye na hoti, yopissa dosā doso jāyati sopissa tasmiṃ samaye na hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yasmiṃ, bhikkhave, samaye bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati, yampissa pemā pemaṃ jāyati tampissa pahīnaṃ hoti ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṃkataṃ āyatiṃ anuppādadhammaṃ, yopissa pemā doso jāyati sopissa pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo, yampissa dosā pemaṃ jāyati tampissa pahīnaṃ hoti ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṃkataṃ āyatiṃ anuppādadhammaṃ, yopissa dosā doso jāyati sopissa pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Ayaṃ vuccati, bhikkhave, bhikkhu neva usseneti na paṭiseneti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na paṭisseneti (sī. pī.)]"
      },
      " na dhūpāyati na pajjalati na ",
      " sampajjhāyati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na apajjhāyati (sī.), na pajjhāyati (syā. kaṃ. pī.)]"
      },
      "."
    ],
    "innerText": "‘‘Yasmiṃ, bhikkhave, samaye bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati, yampissa pemā pemaṃ jāyati tampissa pahīnaṃ hoti ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṃkataṃ āyatiṃ anuppādadhammaṃ, yopissa pemā doso jāyati sopissa pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo, yampissa dosā pemaṃ jāyati tampissa pahīnaṃ hoti ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṃkataṃ āyatiṃ anuppādadhammaṃ, yopissa dosā doso jāyati sopissa pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Ayaṃ vuccati, bhikkhave, bhikkhu neva usseneti na paṭiseneti [na paṭisseneti (sī. pī.)] na dhūpāyati na pajjalati na sampajjhāyati [na apajjhāyati (sī.), na pajjhāyati (syā. kaṃ. pī.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu usseneti? Idha, bhikkhave, bhikkhu rūpaṃ attato samanupassati, rūpavantaṃ vā attānaṃ, attani vā rūpaṃ, rūpasmiṃ vā attānaṃ; vedanaṃ attato ",
      " samanupassati, vedanāvantaṃ vā attānaṃ ",
      ", attani vā vedanaṃ, vedanāya vā attānaṃ; saññaṃ attato samanupassati, saññāvantaṃ vā attānaṃ, attani vā saññaṃ, saññāya vā attānaṃ; saṅkhāre attato samanupassati, saṅkhāravantaṃ vā attānaṃ, attani vā saṅkhāre, saṅkhāresu vā attānaṃ; viññāṇaṃ attato samanupassati, viññāṇavantaṃ vā attānaṃ, attani vā viññāṇaṃ, viññāṇasmiṃ vā attānaṃ. Evaṃ kho, bhikkhave, bhikkhu usseneti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu usseneti? Idha, bhikkhave, bhikkhu rūpaṃ attato samanupassati, rūpavantaṃ vā attānaṃ, attani vā rūpaṃ, rūpasmiṃ vā attānaṃ; vedanaṃ attato samanupassati, vedanāvantaṃ vā attānaṃ , attani vā vedanaṃ, vedanāya vā attānaṃ; saññaṃ attato samanupassati, saññāvantaṃ vā attānaṃ, attani vā saññaṃ, saññāya vā attānaṃ; saṅkhāre attato samanupassati, saṅkhāravantaṃ vā attānaṃ, attani vā saṅkhāre, saṅkhāresu vā attānaṃ; viññāṇaṃ attato samanupassati, viññāṇavantaṃ vā attānaṃ, attani vā viññāṇaṃ, viññāṇasmiṃ vā attānaṃ. Evaṃ kho, bhikkhave, bhikkhu usseneti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu na usseneti? Idha, bhikkhave, bhikkhu na rūpaṃ attato samanupassati, na rūpavantaṃ vā attānaṃ, na attani vā rūpaṃ, na rūpasmiṃ vā attānaṃ; na vedanaṃ attato samanupassati, na vedanāvantaṃ vā attānaṃ, na attani vā vedanaṃ, na vedanāya vā attānaṃ; na saññaṃ attato samanupassati, na saññāvantaṃ vā attānaṃ, na attani vā saññaṃ ",
      ", na saññāya vā attānaṃ; na saṅkhāre attato samanupassati, na saṅkhāravantaṃ vā attānaṃ, na attani vā saṅkhāre, na saṅkhāresu vā attānaṃ; na viññāṇaṃ attato samanupassati, na viññāṇavantaṃ vā attānaṃ, na attani vā viññāṇaṃ, na viññāṇasmiṃ vā attānaṃ. Evaṃ kho, bhikkhave, bhikkhu na usseneti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu na usseneti? Idha, bhikkhave, bhikkhu na rūpaṃ attato samanupassati, na rūpavantaṃ vā attānaṃ, na attani vā rūpaṃ, na rūpasmiṃ vā attānaṃ; na vedanaṃ attato samanupassati, na vedanāvantaṃ vā attānaṃ, na attani vā vedanaṃ, na vedanāya vā attānaṃ; na saññaṃ attato samanupassati, na saññāvantaṃ vā attānaṃ, na attani vā saññaṃ , na saññāya vā attānaṃ; na saṅkhāre attato samanupassati, na saṅkhāravantaṃ vā attānaṃ, na attani vā saṅkhāre, na saṅkhāresu vā attānaṃ; na viññāṇaṃ attato samanupassati, na viññāṇavantaṃ vā attānaṃ, na attani vā viññāṇaṃ, na viññāṇasmiṃ vā attānaṃ. Evaṃ kho, bhikkhave, bhikkhu na usseneti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu paṭiseneti? Idha ",
      ", bhikkhave, bhikkhu akkosantaṃ paccakkosati, rosantaṃ paṭirosati, bhaṇḍantaṃ paṭibhaṇḍati. Evaṃ kho, bhikkhave, bhikkhu paṭiseneti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu paṭiseneti? Idha , bhikkhave, bhikkhu akkosantaṃ paccakkosati, rosantaṃ paṭirosati, bhaṇḍantaṃ paṭibhaṇḍati. Evaṃ kho, bhikkhave, bhikkhu paṭiseneti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu na paṭiseneti? Idha, bhikkhave, bhikkhu akkosantaṃ na paccakkosati, rosantaṃ na paṭirosati, bhaṇḍantaṃ na paṭibhaṇḍati. Evaṃ kho, bhikkhave, bhikkhu na paṭiseneti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu dhūpāyati? Asmīti, bhikkhave, sati itthasmīti hoti, evaṃsmīti hoti, aññathāsmīti hoti, asasmīti hoti, satasmīti hoti, santi hoti, itthaṃ santi hoti, evaṃ santi hoti, aññathā santi hoti, apihaṃ santi hoti, apihaṃ itthaṃ santi hoti, apihaṃ evaṃ santi hoti, apihaṃ aññathā santi hoti, bhavissanti hoti, itthaṃ bhavissanti hoti, evaṃ bhavissanti hoti, aññathā bhavissanti hoti. Evaṃ kho, bhikkhave, bhikkhu dhūpāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, bhikkhu na dhūpāyati? Asmīti, bhikkhave, asati itthasmīti na hoti, evaṃsmīti na hoti, aññathāsmīti na hoti, asasmīti na hoti, satasmīti na hoti, santi na hoti, itthaṃ santi na hoti, evaṃ santi na hoti, aññathā santi na hoti, apihaṃ santi na hoti, apihaṃ itthaṃ santi ",
      " na hoti, apihaṃ evaṃ santi na hoti, apihaṃ aññathā santi na hoti, bhavissanti na hoti, itthaṃ bhavissanti na hoti, evaṃ bhavissanti na hoti, aññathā bhavissanti na hoti. Evaṃ kho, bhikkhave, bhikkhu na dhūpāyati."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, bhikkhu na dhūpāyati? Asmīti, bhikkhave, asati itthasmīti na hoti, evaṃsmīti na hoti, aññathāsmīti na hoti, asasmīti na hoti, satasmīti na hoti, santi na hoti, itthaṃ santi na hoti, evaṃ santi na hoti, aññathā santi na hoti, apihaṃ santi na hoti, apihaṃ itthaṃ santi na hoti, apihaṃ evaṃ santi na hoti, apihaṃ aññathā santi na hoti, bhavissanti na hoti, itthaṃ bhavissanti na hoti, evaṃ bhavissanti na hoti, aññathā bhavissanti na hoti. Evaṃ kho, bhikkhave, bhikkhu na dhūpāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu pajjalati? Iminā asmīti, bhikkhave, sati iminā itthasmīti ",
      " hoti, iminā evaṃsmīti hoti, iminā aññathāsmīti hoti, iminā asasmīti hoti, iminā satasmīti hoti, iminā santi hoti, iminā itthaṃ santi hoti, iminā evaṃ santi hoti, iminā aññathā santi hoti, iminā apihaṃ santi hoti, iminā apihaṃ itthaṃ santi hoti, iminā apihaṃ evaṃ santi hoti, iminā apihaṃ aññathā santi hoti, iminā bhavissanti hoti, iminā itthaṃ bhavissanti hoti, iminā evaṃ bhavissanti hoti, iminā aññathā bhavissanti hoti. Evaṃ kho, bhikkhave, bhikkhu pajjalati."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu pajjalati? Iminā asmīti, bhikkhave, sati iminā itthasmīti hoti, iminā evaṃsmīti hoti, iminā aññathāsmīti hoti, iminā asasmīti hoti, iminā satasmīti hoti, iminā santi hoti, iminā itthaṃ santi hoti, iminā evaṃ santi hoti, iminā aññathā santi hoti, iminā apihaṃ santi hoti, iminā apihaṃ itthaṃ santi hoti, iminā apihaṃ evaṃ santi hoti, iminā apihaṃ aññathā santi hoti, iminā bhavissanti hoti, iminā itthaṃ bhavissanti hoti, iminā evaṃ bhavissanti hoti, iminā aññathā bhavissanti hoti. Evaṃ kho, bhikkhave, bhikkhu pajjalati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu na pajjalati? Iminā asmīti, bhikkhave, asati iminā itthasmīti na hoti, iminā evaṃsmīti na hoti, iminā aññathāsmīti na hoti, iminā asasmīti na hoti, iminā satasmīti na hoti, iminā santi na hoti, iminā itthaṃ santi na hoti, iminā evaṃ santi na hoti, iminā aññathā santi na hoti, iminā apihaṃ santi na hoti, iminā apihaṃ itthaṃ santi na hoti, iminā apihaṃ evaṃ santi na hoti, iminā apihaṃ aññathā santi na hoti, iminā bhavissanti na hoti, iminā itthaṃ bhavissanti na hoti, iminā evaṃ bhavissanti na hoti, iminā aññathā bhavissanti na hoti. Evaṃ kho, bhikkhave, bhikkhu na pajjalati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, bhikkhu sampajjhāyati? Idha, bhikkhave, bhikkhuno asmimāno pahīno na hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Evaṃ kho, bhikkhave, bhikkhu ",
      " sampajjhāyati."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, bhikkhu sampajjhāyati? Idha, bhikkhave, bhikkhuno asmimāno pahīno na hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Evaṃ kho, bhikkhave, bhikkhu sampajjhāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu na sampajjhāyati? Idha, bhikkhave, bhikkhuno asmimāno pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Evaṃ kho, bhikkhave, bhikkhu na sampajjhāyatī’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahāvaggo pañcamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sotānugataṃ ṭhānaṃ, bhaddiya sāmugiya vappa sāḷhā ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mallika attantāpo, taṇhā pemena ca dasā teti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catutthamahāpaṇṇāsakaṃ samattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "5. Pañcamapaṇṇāsakaṃ"
  }
]