[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Mahāvaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Sīhanādasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". ‘‘Sīho ",
      ", bhikkhave, migarājā sāyanhasamayaṃ āsayā nikkhamati. Āsayā nikkhamitvā vijambhati. Vijambhitvā samantā catuddisaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[catuddisā (syā. ka.) a. ni. 6.64]"
      },
      " anuviloketi. Samantā catuddisaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[catuddisā (syā. ka.) a. ni. 6.64]"
      },
      " anuviloketvā ",
      " tikkhattuṃ sīhanādaṃ nadati. Tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkamati. Taṃ kissa hetu? ‘Māhaṃ khuddake pāṇe visamagate saṅghātaṃ āpādesi’nti!"
    ],
    "innerText": "21. ‘‘Sīho , bhikkhave, migarājā sāyanhasamayaṃ āsayā nikkhamati. Āsayā nikkhamitvā vijambhati. Vijambhitvā samantā catuddisaṃ [catuddisā (syā. ka.) a. ni. 6.64] anuviloketi. Samantā catuddisaṃ [catuddisā (syā. ka.) a. ni. 6.64] anuviloketvā tikkhattuṃ sīhanādaṃ nadati. Tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkamati. Taṃ kissa hetu? ‘Māhaṃ khuddake pāṇe visamagate saṅghātaṃ āpādesi’nti!"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Sīho’ti, kho bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassa. Yaṃ kho, bhikkhave, tathāgato ",
      " parisāya dhammaṃ deseti, idamassa hoti sīhanādasmiṃ."
    ],
    "innerText": "‘‘‘Sīho’ti, kho bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassa. Yaṃ kho, bhikkhave, tathāgato parisāya dhammaṃ deseti, idamassa hoti sīhanādasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ma. ni. 1.148; vibha. 760; paṭi. ma. 2.44]"
      },
      " ‘‘Dasayimāni ",
      ", bhikkhave, tathāgatassa tathāgatabalāni, yehi balehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. Katamāni dasa? Idha, bhikkhave, tathāgato ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti."
    ],
    "innerText": "[ma. ni. 1.148; vibha. 760; paṭi. ma. 2.44] ‘‘Dasayimāni , bhikkhave, tathāgatassa tathāgatabalāni, yehi balehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. Katamāni dasa? Idha, bhikkhave, tathāgato ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, tathāgato atītānāgatapaccuppannānaṃ kammasamādānānaṃ ṭhānaso hetuso vipākaṃ yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato atītānāgatapaccuppannānaṃ kammasamādānānaṃ ṭhānaso hetuso vipākaṃ yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, tathāgato sabbatthagāminiṃ paṭipadaṃ yathābhūtaṃ pajānāti. Yampi, bhikkhave ",
      ", tathāgato sabbatthagāminiṃ paṭipadaṃ yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, tathāgato sabbatthagāminiṃ paṭipadaṃ yathābhūtaṃ pajānāti. Yampi, bhikkhave , tathāgato sabbatthagāminiṃ paṭipadaṃ yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, tathāgato anekadhātuṃ nānādhātuṃ ",
      " lokaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anekadhātunānādhātulokaṃ (sī. ka.)]"
      },
      " yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato anekadhātuṃ nānādhātuṃ lokaṃ yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ ",
      " hoti…pe… brahmacakkaṃ pavatteti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, tathāgato anekadhātuṃ nānādhātuṃ lokaṃ [anekadhātunānādhātulokaṃ (sī. ka.)] yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato anekadhātuṃ nānādhātuṃ lokaṃ yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti…pe… brahmacakkaṃ pavatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, tathāgato sattānaṃ nānādhimuttikataṃ yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato sattānaṃ nānādhimuttikataṃ yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti…pe… brahmacakkaṃ pavatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, tathāgato parasattānaṃ parapuggalānaṃ indriyaparopariyattaṃ yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato parasattānaṃ parapuggalānaṃ ",
      " indriyaparopariyattaṃ yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti…pe… brahmacakkaṃ pavatteti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, tathāgato parasattānaṃ parapuggalānaṃ indriyaparopariyattaṃ yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato parasattānaṃ parapuggalānaṃ indriyaparopariyattaṃ yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti…pe… brahmacakkaṃ pavatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, tathāgato jhānavimokkhasamādhisamāpattīnaṃ saṃkilesaṃ vodānaṃ vuṭṭhānaṃ yathābhūtaṃ pajānāti. Yampi…pe… pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti…pe… brahmacakkaṃ pavatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, tathāgato anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo ",
      " paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi ",
      " saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe, ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti, iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Yampi ",
      " bhikkhave, tathāgato anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, tathāgato anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe, ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti, iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Yampi bhikkhave, tathāgato anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, tathāgato dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā; ime vā pana bhonto sattā kāyasucaritena ",
      " samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ ",
      " upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti. Yampi ",
      ", bhikkhave, tathāgato dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, tathāgato dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā; ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti. Yampi , bhikkhave, tathāgato dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, tathāgato āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Yampi, bhikkhave, tathāgato āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Imāni kho, bhikkhave, dasa tathāgatassa tathāgatabalāni, yehi balehi samannāgato tathāgato ",
      " āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavattetī’’ti. Paṭhamaṃ."
    ],
    "innerText": "‘‘Imāni kho, bhikkhave, dasa tathāgatassa tathāgatabalāni, yehi balehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavattetī’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Adhivuttipadasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca –"
    ],
    "innerText": "22. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye te, ānanda, dhammā tesaṃ tesaṃ adhivuttipadānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[adhimuttipadānaṃ (ka.)]"
      },
      " abhiññā sacchikiriyāya saṃvattanti, visārado ahaṃ, ānanda, tattha paṭijānāmi. ‘Tesaṃ tesaṃ tathā tathā dhammaṃ desetuṃ ",
      " yathā yathā paṭipanno santaṃ vā atthīti ñassati, asantaṃ vā natthīti ñassati, hīnaṃ vā hīnanti ñassati ",
      ", paṇītaṃ vā paṇītanti ñassati, sauttaraṃ vā sauttaranti ñassati, anuttaraṃ vā anuttaranti ñassati; yathā yathā vā pana taṃ ñāteyyaṃ vā daṭṭheyyaṃ ",
      " vā sacchikareyyaṃ vā, tathā tathā ñassati vā dakkhati vā sacchikarissati vā’ti ṭhānametaṃ vijjati. Etadānuttariyaṃ, ānanda, ñāṇānaṃ yadidaṃ tattha tattha yathābhūtañāṇaṃ. Etasmā cāhaṃ, ānanda, ñāṇā aññaṃ ñāṇaṃ uttaritaraṃ vā paṇītataraṃ vā natthīti vadāmi."
    ],
    "innerText": "‘‘Ye te, ānanda, dhammā tesaṃ tesaṃ adhivuttipadānaṃ [adhimuttipadānaṃ (ka.)] abhiññā sacchikiriyāya saṃvattanti, visārado ahaṃ, ānanda, tattha paṭijānāmi. ‘Tesaṃ tesaṃ tathā tathā dhammaṃ desetuṃ yathā yathā paṭipanno santaṃ vā atthīti ñassati, asantaṃ vā natthīti ñassati, hīnaṃ vā hīnanti ñassati , paṇītaṃ vā paṇītanti ñassati, sauttaraṃ vā sauttaranti ñassati, anuttaraṃ vā anuttaranti ñassati; yathā yathā vā pana taṃ ñāteyyaṃ vā daṭṭheyyaṃ vā sacchikareyyaṃ vā, tathā tathā ñassati vā dakkhati vā sacchikarissati vā’ti ṭhānametaṃ vijjati. Etadānuttariyaṃ, ānanda, ñāṇānaṃ yadidaṃ tattha tattha yathābhūtañāṇaṃ. Etasmā cāhaṃ, ānanda, ñāṇā aññaṃ ñāṇaṃ uttaritaraṃ vā paṇītataraṃ vā natthīti vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dasayimāni, ānanda, tathāgatassa tathāgatabalāni, yehi balehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. Katamāni dasa? Idhānanda, tathāgato ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāti. Yampānanda, tathāgato ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāti, idampānanda, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, ānanda, tathāgato atītānāgatapaccuppannānaṃ kammasamādānānaṃ ṭhānaso hetuso vipākaṃ yathābhūtaṃ pajānāti. Yampānanda…pe… idampānanda…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, ānanda, tathāgato sabbatthagāminiṃ paṭipadaṃ yathābhūtaṃ pajānāti. Yampānanda…pe… idampānanda…pe…."
    ],
    "innerText": "‘‘Puna caparaṃ, ānanda, tathāgato sabbatthagāminiṃ paṭipadaṃ yathābhūtaṃ pajānāti. Yampānanda…pe… idampānanda…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, ānanda, tathāgato anekadhātuṃ nānādhātuṃ lokaṃ yathābhūtaṃ pajānāti. Yampānanda ",
      " …pe… idampānanda…pe…."
    ],
    "innerText": "‘‘Puna caparaṃ, ānanda, tathāgato anekadhātuṃ nānādhātuṃ lokaṃ yathābhūtaṃ pajānāti. Yampānanda …pe… idampānanda…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, ānanda, tathāgato sattānaṃ nānādhimuttikataṃ yathābhūtaṃ pajānāti. Yampānanda…pe… idampānanda…pe…."
    ],
    "innerText": "‘‘Puna caparaṃ, ānanda, tathāgato sattānaṃ nānādhimuttikataṃ yathābhūtaṃ pajānāti. Yampānanda…pe… idampānanda…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, ānanda, tathāgato parasattānaṃ parapuggalānaṃ indriyaparopariyattaṃ yathābhūtaṃ pajānāti. Yampānanda…pe… idampānanda…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, ānanda, tathāgato jhānavimokkhasamādhisamāpattīnaṃ saṃkilesaṃ vodānaṃ vuṭṭhānaṃ yathābhūtaṃ pajānāti. Yampānanda…pe… idampānanda…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, ānanda, tathāgato anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Yampānanda…pe… idampānanda…pe…."
    ],
    "innerText": "‘‘Puna caparaṃ, ānanda, tathāgato anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Yampānanda…pe… idampānanda…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, ānanda, tathāgato dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti. Yampānanda…pe… idampānanda…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, ānanda, tathāgato āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Yampānanda, tathāgato āsavānaṃ khayā anāsavaṃ cetovimuttiṃ…pe… sacchikatvā upasampajja viharati. Idampānanda, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Imāni ",
      " kho, ānanda, dasa tathāgatassa tathāgatabalāni, yehi balehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti ",
      ", parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavattetī’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Imāni kho, ānanda, dasa tathāgatassa tathāgatabalāni, yehi balehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti , parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavattetī’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Kāyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". ‘‘Atthi ",
      ", bhikkhave, dhammā kāyena pahātabbā, no vācāya. Atthi, bhikkhave, dhammā vācāya pahātabbā, no kāyena. Atthi, bhikkhave, dhammā neva kāyena pahātabbā no vācāya, paññāya disvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[disvā disvā (sī. syā.)]"
      },
      " pahātabbā."
    ],
    "innerText": "23. ‘‘Atthi , bhikkhave, dhammā kāyena pahātabbā, no vācāya. Atthi, bhikkhave, dhammā vācāya pahātabbā, no kāyena. Atthi, bhikkhave, dhammā neva kāyena pahātabbā no vācāya, paññāya disvā [disvā disvā (sī. syā.)] pahātabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame ca, bhikkhave, dhammā kāyena pahātabbā, no vācāya? Idha, bhikkhave, bhikkhu akusalaṃ āpanno hoti kiñci desaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kañci deva desaṃ (sī. syā.)]"
      },
      " kāyena. Tamenaṃ anuvicca viññū sabrahmacārī evamāhaṃsu – ‘āyasmā kho akusalaṃ āpanno kiñci desaṃ kāyena. Sādhu vatāyasmā kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāvetū’ti. So anuvicca viññūhi sabrahmacārīhi vuccamāno kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāveti. Ime vuccanti, bhikkhave, dhammā kāyena pahātabbā, no vācāya."
    ],
    "innerText": "‘‘Katame ca, bhikkhave, dhammā kāyena pahātabbā, no vācāya? Idha, bhikkhave, bhikkhu akusalaṃ āpanno hoti kiñci desaṃ [kañci deva desaṃ (sī. syā.)] kāyena. Tamenaṃ anuvicca viññū sabrahmacārī evamāhaṃsu – ‘āyasmā kho akusalaṃ āpanno kiñci desaṃ kāyena. Sādhu vatāyasmā kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāvetū’ti. So anuvicca viññūhi sabrahmacārīhi vuccamāno kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāveti. Ime vuccanti, bhikkhave, dhammā kāyena pahātabbā, no vācāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame ",
      " ca, bhikkhave, dhammā vācāya pahātabbā, no kāyena? Idha, bhikkhave, bhikkhu akusalaṃ āpanno hoti kiñci desaṃ vācāya. Tamenaṃ anuvicca viññū sabrahmacārī evamāhaṃsu – ‘āyasmā kho akusalaṃ āpanno kiñci desaṃ vācāya. Sādhu vatāyasmā vacīduccaritaṃ pahāya vacīsucaritaṃ bhāvetū’ti. So anuvicca viññūhi sabrahmacārīhi vuccamāno vacīduccaritaṃ pahāya vacīsucaritaṃ bhāveti. Ime vuccanti, bhikkhave, dhammā vācāya pahātabbā, no kāyena."
    ],
    "innerText": "‘‘Katame ca, bhikkhave, dhammā vācāya pahātabbā, no kāyena? Idha, bhikkhave, bhikkhu akusalaṃ āpanno hoti kiñci desaṃ vācāya. Tamenaṃ anuvicca viññū sabrahmacārī evamāhaṃsu – ‘āyasmā kho akusalaṃ āpanno kiñci desaṃ vācāya. Sādhu vatāyasmā vacīduccaritaṃ pahāya vacīsucaritaṃ bhāvetū’ti. So anuvicca viññūhi sabrahmacārīhi vuccamāno vacīduccaritaṃ pahāya vacīsucaritaṃ bhāveti. Ime vuccanti, bhikkhave, dhammā vācāya pahātabbā, no kāyena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame ca, bhikkhave, dhammā neva kāyena pahātabbā no vācāya, paññāya disvā pahātabbā? Lobho, bhikkhave, neva kāyena pahātabbo no vācāya, paññāya disvā pahātabbo. Doso ",
      ", bhikkhave…pe… moho… kodho… upanāho… makkho… paḷāso ",
      "… macchariyaṃ, bhikkhave, neva kāyena pahātabbaṃ no vācāya, paññāya disvā pahātabbaṃ."
    ],
    "innerText": "‘‘Katame ca, bhikkhave, dhammā neva kāyena pahātabbā no vācāya, paññāya disvā pahātabbā? Lobho, bhikkhave, neva kāyena pahātabbo no vācāya, paññāya disvā pahātabbo. Doso , bhikkhave…pe… moho… kodho… upanāho… makkho… paḷāso … macchariyaṃ, bhikkhave, neva kāyena pahātabbaṃ no vācāya, paññāya disvā pahātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pāpikā ",
      ", bhikkhave, issā neva kāyena pahātabbā no vācāya, paññāya disvā pahātabbā. Katamā ca, bhikkhave, pāpikā issā? Idha, bhikkhave, ijjhati gahapatissa vā gahapatiputtassa vā dhanena vā dhaññena vā rajatena vā jātarūpena vā. Tatrāññatarassa dāsassa vā upavāsassa vā evaṃ hoti – ‘aho vatimassa gahapatissa vā gahapatiputtassa vā na ijjheyya dhanena vā dhaññena vā rajatena vā jātarūpena vā’ti. Samaṇo vā pana brāhmaṇo vā lābhī hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Tatrāññatarassa samaṇassa vā brāhmaṇassa vā evaṃ hoti – ‘aho vata ayamāyasmā na lābhī assa cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’nti. Ayaṃ vuccati, bhikkhave, pāpikā issā."
    ],
    "innerText": "‘‘Pāpikā , bhikkhave, issā neva kāyena pahātabbā no vācāya, paññāya disvā pahātabbā. Katamā ca, bhikkhave, pāpikā issā? Idha, bhikkhave, ijjhati gahapatissa vā gahapatiputtassa vā dhanena vā dhaññena vā rajatena vā jātarūpena vā. Tatrāññatarassa dāsassa vā upavāsassa vā evaṃ hoti – ‘aho vatimassa gahapatissa vā gahapatiputtassa vā na ijjheyya dhanena vā dhaññena vā rajatena vā jātarūpena vā’ti. Samaṇo vā pana brāhmaṇo vā lābhī hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Tatrāññatarassa samaṇassa vā brāhmaṇassa vā evaṃ hoti – ‘aho vata ayamāyasmā na lābhī assa cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’nti. Ayaṃ vuccati, bhikkhave, pāpikā issā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pāpikā, bhikkhave, icchā neva kāyena pahātabbā no vācāya, paññāya disvā pahātabbā. Katamā ca, bhikkhave, pāpikā icchā? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vibha. 851]"
      },
      " Idha, bhikkhave, ekacco assaddho samāno ‘saddhoti maṃ jāneyyu’nti icchati; dussīlo samāno ‘sīlavāti maṃ jāneyyu’nti icchati; appassuto samāno ‘bahussutoti maṃ jāneyyu’nti icchati; saṅgaṇikārāmo samāno ‘pavivittoti ",
      " maṃ jāneyyu’nti icchati; kusīto samāno ‘āraddhavīriyoti maṃ jāneyyu’nti icchati; muṭṭhassati samāno ‘upaṭṭhitassatīti maṃ jāneyyu’nti icchati; asamāhito samāno ‘samāhitoti maṃ ",
      " jāneyyu’nti icchati; duppañño samāno ‘paññavāti maṃ jāneyyu’nti icchati; akhīṇāsavo samāno ‘khīṇāsavoti maṃ jāneyyu’nti icchati. Ayaṃ ",
      " vuccati, bhikkhave, pāpikā icchā. Ime vuccanti, bhikkhave, dhammā neva kāyena pahātabbā no vācāya, paññāya disvā pahātabbā."
    ],
    "innerText": "‘‘Pāpikā, bhikkhave, icchā neva kāyena pahātabbā no vācāya, paññāya disvā pahātabbā. Katamā ca, bhikkhave, pāpikā icchā? [vibha. 851] Idha, bhikkhave, ekacco assaddho samāno ‘saddhoti maṃ jāneyyu’nti icchati; dussīlo samāno ‘sīlavāti maṃ jāneyyu’nti icchati; appassuto samāno ‘bahussutoti maṃ jāneyyu’nti icchati; saṅgaṇikārāmo samāno ‘pavivittoti maṃ jāneyyu’nti icchati; kusīto samāno ‘āraddhavīriyoti maṃ jāneyyu’nti icchati; muṭṭhassati samāno ‘upaṭṭhitassatīti maṃ jāneyyu’nti icchati; asamāhito samāno ‘samāhitoti maṃ jāneyyu’nti icchati; duppañño samāno ‘paññavāti maṃ jāneyyu’nti icchati; akhīṇāsavo samāno ‘khīṇāsavoti maṃ jāneyyu’nti icchati. Ayaṃ vuccati, bhikkhave, pāpikā icchā. Ime vuccanti, bhikkhave, dhammā neva kāyena pahātabbā no vācāya, paññāya disvā pahātabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tañce, bhikkhave, bhikkhuṃ lobho abhibhuyya iriyati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā abhibhuyya iriyati. So evamassa veditabbo – ‘nāyamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho abhibhuyya iriyati; nāyamāyasmā tathā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā abhibhuyya iriyatī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tañce ",
      ", bhikkhave, bhikkhuṃ lobho nābhibhuyya iriyati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā nābhibhuyya iriyati, so evamassa veditabbo – ‘tathā ayamāyasmā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho nābhibhuyya iriyati; tathā ayamāyasmā pajānāti yathā pajānato doso na hoti… moho… kodho ",
      "… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā nābhibhuyya iriyatī’’’ti. Tatiyaṃ."
    ],
    "innerText": "‘‘Tañce , bhikkhave, bhikkhuṃ lobho nābhibhuyya iriyati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā nābhibhuyya iriyati, so evamassa veditabbo – ‘tathā ayamāyasmā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho nābhibhuyya iriyati; tathā ayamāyasmā pajānāti yathā pajānato doso na hoti… moho… kodho … upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā nābhibhuyya iriyatī’’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Mahācundasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ". Ekaṃ samayaṃ āyasmā mahācundo cetīsu viharati sahajātiyaṃ. Tatra kho āyasmā mahācundo bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū ",
      " āyasmato mahācundassa paccassosuṃ. Āyasmā mahācundo etadavoca –"
    ],
    "innerText": "24. Ekaṃ samayaṃ āyasmā mahācundo cetīsu viharati sahajātiyaṃ. Tatra kho āyasmā mahācundo bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato mahācundassa paccassosuṃ. Āyasmā mahācundo etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ñāṇavādaṃ, āvuso, bhikkhu vadamāno – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhamma’nti. Tañce, āvuso, bhikkhuṃ lobho abhibhuyya tiṭṭhati, doso… moho ",
      " … kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā abhibhuyya tiṭṭhati, so evamassa veditabbo – ‘nāyamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho abhibhuyya tiṭṭhati; nāyamāyasmā tathā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā abhibhuyya tiṭṭhatī’ti."
    ],
    "innerText": "‘‘Ñāṇavādaṃ, āvuso, bhikkhu vadamāno – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhamma’nti. Tañce, āvuso, bhikkhuṃ lobho abhibhuyya tiṭṭhati, doso… moho … kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā abhibhuyya tiṭṭhati, so evamassa veditabbo – ‘nāyamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho abhibhuyya tiṭṭhati; nāyamāyasmā tathā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā abhibhuyya tiṭṭhatī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhāvanāvādaṃ, āvuso, bhikkhu vadamāno – ‘bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Tañce, āvuso, bhikkhuṃ lobho abhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā abhibhuyya tiṭṭhati, so evamassa veditabbo – ‘nāyamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho abhibhuyya tiṭṭhati; nāyamāyasmā tathā pajānāti yathā pajānato doso ",
      " na hoti… moho… kodho… upanāho… makkho… paḷāso ",
      " … macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā abhibhuyya tiṭṭhatī’ti."
    ],
    "innerText": "‘‘Bhāvanāvādaṃ, āvuso, bhikkhu vadamāno – ‘bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Tañce, āvuso, bhikkhuṃ lobho abhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā abhibhuyya tiṭṭhati, so evamassa veditabbo – ‘nāyamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho abhibhuyya tiṭṭhati; nāyamāyasmā tathā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso … macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā abhibhuyya tiṭṭhatī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ñāṇavādañca, āvuso, bhikkhu vadamāno bhāvanāvādañca – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhammaṃ, bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Tañce, āvuso, bhikkhuṃ lobho abhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā abhibhuyya ",
      " tiṭṭhati, so evamassa veditabbo – ‘nāyamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho abhibhuyya tiṭṭhati; nāyamāyasmā tathā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā abhibhuyya tiṭṭhatī’ti."
    ],
    "innerText": "‘‘Ñāṇavādañca, āvuso, bhikkhu vadamāno bhāvanāvādañca – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhammaṃ, bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Tañce, āvuso, bhikkhuṃ lobho abhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā abhibhuyya tiṭṭhati, so evamassa veditabbo – ‘nāyamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho abhibhuyya tiṭṭhati; nāyamāyasmā tathā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā abhibhuyya tiṭṭhatī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi ",
      ", āvuso, puriso daliddova samāno aḍḍhavādaṃ vadeyya, adhanova samāno dhanavāvādaṃ vadeyya, abhogova samāno bhogavāvādaṃ vadeyya. So kismiñcideva dhanakaraṇīye samuppanne na sakkuṇeyya upanīhātuṃ dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā. Tamenaṃ evaṃ jāneyyuṃ – ‘daliddova ayamāyasmā samāno aḍḍhavādaṃ vadeti, adhanova ayamāyasmā samāno dhanavāvādaṃ vadeti, abhogavāva ayamāyasmā samāno bhogavāvādaṃ vadeti. Taṃ ",
      " kissa hetu? Tathā hi ayamāyasmā kismiñcideva dhanakaraṇīye samuppanne na sakkoti upanīhātuṃ dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā’ti."
    ],
    "innerText": "‘‘Seyyathāpi , āvuso, puriso daliddova samāno aḍḍhavādaṃ vadeyya, adhanova samāno dhanavāvādaṃ vadeyya, abhogova samāno bhogavāvādaṃ vadeyya. So kismiñcideva dhanakaraṇīye samuppanne na sakkuṇeyya upanīhātuṃ dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā. Tamenaṃ evaṃ jāneyyuṃ – ‘daliddova ayamāyasmā samāno aḍḍhavādaṃ vadeti, adhanova ayamāyasmā samāno dhanavāvādaṃ vadeti, abhogavāva ayamāyasmā samāno bhogavāvādaṃ vadeti. Taṃ kissa hetu? Tathā hi ayamāyasmā kismiñcideva dhanakaraṇīye samuppanne na sakkoti upanīhātuṃ dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, āvuso, ñāṇavādañca bhikkhu vadamāno bhāvanāvādañca – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhammaṃ, bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Taṃ ce, āvuso, bhikkhuṃ lobho abhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā abhibhuyya tiṭṭhati, so evamassa veditabbo – ‘nāyamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho abhibhuyya tiṭṭhati; nāyamāyasmā tathā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā ",
      " issā ",
      " … pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā abhibhuyya tiṭṭhatī’ti."
    ],
    "innerText": "‘‘Evamevaṃ kho, āvuso, ñāṇavādañca bhikkhu vadamāno bhāvanāvādañca – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhammaṃ, bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Taṃ ce, āvuso, bhikkhuṃ lobho abhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā abhibhuyya tiṭṭhati, so evamassa veditabbo – ‘nāyamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho abhibhuyya tiṭṭhati; nāyamāyasmā tathā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā … pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā abhibhuyya tiṭṭhatī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ñāṇavādaṃ, āvuso, bhikkhu vadamāno – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhamma’nti. Tañce, āvuso, bhikkhuṃ lobho nābhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā nābhibhuyya tiṭṭhati, so evamassa veditabbo – ‘ayamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho nābhibhuyya tiṭṭhati; tathā ayamāyasmā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ ",
      " pāpikā icchā nābhibhuyya tiṭṭhatī’ti."
    ],
    "innerText": "‘‘Ñāṇavādaṃ, āvuso, bhikkhu vadamāno – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhamma’nti. Tañce, āvuso, bhikkhuṃ lobho nābhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā nābhibhuyya tiṭṭhati, so evamassa veditabbo – ‘ayamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho nābhibhuyya tiṭṭhati; tathā ayamāyasmā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā nābhibhuyya tiṭṭhatī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhāvanāvādaṃ ",
      ", āvuso, bhikkhu vadamāno – ‘bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Tañce, āvuso, bhikkhuṃ lobho nābhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā nābhibhuyya tiṭṭhati, so evamassa veditabbo – ‘tathā ayamāyasmā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho nābhibhuyya tiṭṭhati; tathā ayamāyasmā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā nābhibhuyya tiṭṭhatī’ti."
    ],
    "innerText": "‘‘Bhāvanāvādaṃ , āvuso, bhikkhu vadamāno – ‘bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Tañce, āvuso, bhikkhuṃ lobho nābhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā nābhibhuyya tiṭṭhati, so evamassa veditabbo – ‘tathā ayamāyasmā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho nābhibhuyya tiṭṭhati; tathā ayamāyasmā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā nābhibhuyya tiṭṭhatī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ñāṇavādañca, āvuso, bhikkhu vadamāno bhāvanāvādañca – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhammaṃ, bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Tañce, āvuso, bhikkhuṃ lobho nābhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā nābhibhuyya tiṭṭhati, so evamassa veditabbo – ‘tathā ayamāyasmā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ ",
      " āyasmantaṃ lobho nābhibhuyya tiṭṭhati; tathā ayamāyasmā pajānāti yathā pajānato doso hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā nābhibhuyya tiṭṭhatī’ti."
    ],
    "innerText": "‘‘Ñāṇavādañca, āvuso, bhikkhu vadamāno bhāvanāvādañca – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhammaṃ, bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Tañce, āvuso, bhikkhuṃ lobho nābhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā nābhibhuyya tiṭṭhati, so evamassa veditabbo – ‘tathā ayamāyasmā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho nābhibhuyya tiṭṭhati; tathā ayamāyasmā pajānāti yathā pajānato doso hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā nābhibhuyya tiṭṭhatī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi ",
      ", āvuso, puriso aḍḍhova samāno aḍḍhavādaṃ ",
      " vadeyya, dhanavāva samāno dhanavāvādaṃ vadeyya, bhogavāva samāno bhogavāvādaṃ vadeyya. So kismiñcideva dhanakaraṇīye samuppanne sakkuṇeyya upanīhātuṃ dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā. Tamenaṃ evaṃ jāneyyuṃ – ‘aḍḍhova ayamāyasmā samāno aḍḍhavādaṃ vadeti, dhanavāva ayamāyasmā samāno dhanavāvādaṃ vadeti, bhogavāva ayamāyasmā samāno bhogavāvādaṃ vadeti. Taṃ kissa hetu? Tathā hi ayamāyasmā kismiñcideva dhanakaraṇīye samuppanne sakkoti upanīhātuṃ dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā’ti."
    ],
    "innerText": "‘‘Seyyathāpi , āvuso, puriso aḍḍhova samāno aḍḍhavādaṃ vadeyya, dhanavāva samāno dhanavāvādaṃ vadeyya, bhogavāva samāno bhogavāvādaṃ vadeyya. So kismiñcideva dhanakaraṇīye samuppanne sakkuṇeyya upanīhātuṃ dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā. Tamenaṃ evaṃ jāneyyuṃ – ‘aḍḍhova ayamāyasmā samāno aḍḍhavādaṃ vadeti, dhanavāva ayamāyasmā samāno dhanavāvādaṃ vadeti, bhogavāva ayamāyasmā samāno bhogavāvādaṃ vadeti. Taṃ kissa hetu? Tathā hi ayamāyasmā kismiñcideva dhanakaraṇīye samuppanne sakkoti upanīhātuṃ dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evamevaṃ ",
      " kho, āvuso, ñāṇavādañca bhikkhu vadamāno bhāvanāvādañca – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhammaṃ, bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Tañce, āvuso, bhikkhuṃ lobho nābhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā nābhibhuyya tiṭṭhati, so evamassa veditabbo – ‘tathā ayamāyasmā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho nābhibhuyya tiṭṭhati; tathā ayamāyasmā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā nābhibhuyya tiṭṭhatī’’’ti. Catutthaṃ."
    ],
    "innerText": "Evamevaṃ kho, āvuso, ñāṇavādañca bhikkhu vadamāno bhāvanāvādañca – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhammaṃ, bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Tañce, āvuso, bhikkhuṃ lobho nābhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā nābhibhuyya tiṭṭhati, so evamassa veditabbo – ‘tathā ayamāyasmā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho nābhibhuyya tiṭṭhati; tathā ayamāyasmā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā nābhibhuyya tiṭṭhatī’’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Kasiṇasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dī. ni. 3.346, 360; a. ni. 10.29]"
      },
      " ‘‘Dasayimāni ",
      ", bhikkhave, kasiṇāyatanāni. Katamāni dasa? Pathavīkasiṇameko sañjānāti uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ; āpokasiṇameko sañjānāti…pe… tejokasiṇameko sañjānāti… vāyokasiṇameko ",
      " sañjānāti… nīlakasiṇameko sañjānāti… pītakasiṇameko sañjānāti… lohitakasiṇameko sañjānāti… odātakasiṇameko sañjānāti… ākāsakasiṇameko sañjānāti… viññāṇakasiṇameko sañjānāti uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ. Imāni kho, bhikkhave, dasa kasiṇāyatanānī’’ti. Pañcamaṃ."
    ],
    "innerText": "25.[dī. ni. 3.346, 360; a. ni. 10.29] ‘‘Dasayimāni , bhikkhave, kasiṇāyatanāni. Katamāni dasa? Pathavīkasiṇameko sañjānāti uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ; āpokasiṇameko sañjānāti…pe… tejokasiṇameko sañjānāti… vāyokasiṇameko sañjānāti… nīlakasiṇameko sañjānāti… pītakasiṇameko sañjānāti… lohitakasiṇameko sañjānāti… odātakasiṇameko sañjānāti… ākāsakasiṇameko sañjānāti… viññāṇakasiṇameko sañjānāti uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ. Imāni kho, bhikkhave, dasa kasiṇāyatanānī’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Kāḷīsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". Ekaṃ ",
      " samayaṃ āyasmā mahākaccāno avantīsu viharati kuraraghare ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gulaghare (ka.) kururaghare mahāva. 257]"
      },
      " pavatte pabbate. Atha kho kāḷī upāsikā kuraragharikā yenāyasmā mahākaccāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahākaccānaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnā kho kāḷī upāsikā ",
      " kuraragharikā āyasmantaṃ mahākaccānaṃ etadavoca – ‘‘vuttamidaṃ, bhante, bhagavatā kumāripañhesu –"
    ],
    "innerText": "26. Ekaṃ samayaṃ āyasmā mahākaccāno avantīsu viharati kuraraghare [gulaghare (ka.) kururaghare mahāva. 257] pavatte pabbate. Atha kho kāḷī upāsikā kuraragharikā yenāyasmā mahākaccāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahākaccānaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnā kho kāḷī upāsikā kuraragharikā āyasmantaṃ mahākaccānaṃ etadavoca – ‘‘vuttamidaṃ, bhante, bhagavatā kumāripañhesu –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘Atthassa pattiṃ hadayassa santiṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Jetvāna senaṃ piyasātarūpaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "children": [
      "Ekohaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ekāhaṃ (ka.)]"
      },
      " jhāyaṃ sukhamanubodhiṃ,"
    ],
    "innerText": "Ekohaṃ [ekāhaṃ (ka.)] jhāyaṃ sukhamanubodhiṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "children": [
      "Tasmā janena na karomi sakkhiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sakhiṃ (ka.) saṃ. ni. 1.161 passitabbaṃ]"
      },
      ";"
    ],
    "innerText": "Tasmā janena na karomi sakkhiṃ [sakhiṃ (ka.) saṃ. ni. 1.161 passitabbaṃ];"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Sakkhī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sakhī (ka.)]"
      },
      " na sampajjati kenaci me’ti."
    ],
    "innerText": "Sakkhī [sakhī (ka.)] na sampajjati kenaci me’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Imassa ",
      " kho, bhante, bhagavatā saṃkhittena bhāsitassa kathaṃ vitthārena attho daṭṭhabbo’’ti?"
    ],
    "innerText": "‘‘Imassa kho, bhante, bhagavatā saṃkhittena bhāsitassa kathaṃ vitthārena attho daṭṭhabbo’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pathavīkasiṇasamāpattiparamā kho, bhagini, eke samaṇabrāhmaṇā ‘attho’ti abhinibbattesuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[atthābhinibbattesuṃ (sī. syā.)]"
      },
      ". Yāvatā kho, bhagini, pathavīkasiṇasamāpattiparamatā ",
      ", tadabhiññāsi bhagavā. Tadabhiññāya bhagavā assādamaddasa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ādimaddasa (sī. syā.)]"
      },
      " ādīnavamaddasa nissaraṇamaddasa maggāmaggañāṇadassanamaddasa. Tassa assādadassanahetu ādīnavadassanahetu nissaraṇadassanahetu maggāmaggañāṇadassanahetu atthassa patti hadayassa santi viditā hoti."
    ],
    "innerText": "‘‘Pathavīkasiṇasamāpattiparamā kho, bhagini, eke samaṇabrāhmaṇā ‘attho’ti abhinibbattesuṃ [atthābhinibbattesuṃ (sī. syā.)]. Yāvatā kho, bhagini, pathavīkasiṇasamāpattiparamatā , tadabhiññāsi bhagavā. Tadabhiññāya bhagavā assādamaddasa [ādimaddasa (sī. syā.)] ādīnavamaddasa nissaraṇamaddasa maggāmaggañāṇadassanamaddasa. Tassa assādadassanahetu ādīnavadassanahetu nissaraṇadassanahetu maggāmaggañāṇadassanahetu atthassa patti hadayassa santi viditā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Āpokasiṇasamāpattiparamā kho, bhagini…pe… tejokasiṇasamāpattiparamā kho, bhagini… vāyokasiṇasamāpattiparamā kho, bhagini… nīlakasiṇasamāpattiparamā kho, bhagini… pītakasiṇasamāpattiparamā kho, bhagini… lohitakasiṇasamāpattiparamā kho, bhagini… odātakasiṇasamāpattiparamā kho, bhagini… ākāsakasiṇasamāpattiparamā kho, bhagini… viññāṇakasiṇasamāpattiparamā kho, bhagini, eke samaṇabrāhmaṇā ‘attho’ti abhinibbattesuṃ ",
      ". Yāvatā kho, bhagini, viññāṇakasiṇasamāpattiparamatā, tadabhiññāsi bhagavā. Tadabhiññāya bhagavā assādamaddasa ādīnavamaddasa nissaraṇamaddasa maggāmaggañāṇadassanamaddasa. Tassa assādadassanahetu ādīnavadassanahetu nissaraṇadassanahetu maggāmaggañāṇadassanahetu atthassa patti hadayassa santi viditā hoti. Iti kho, bhagini, yaṃ taṃ vuttaṃ bhagavatā kumāripañhesu –"
    ],
    "innerText": "‘‘Āpokasiṇasamāpattiparamā kho, bhagini…pe… tejokasiṇasamāpattiparamā kho, bhagini… vāyokasiṇasamāpattiparamā kho, bhagini… nīlakasiṇasamāpattiparamā kho, bhagini… pītakasiṇasamāpattiparamā kho, bhagini… lohitakasiṇasamāpattiparamā kho, bhagini… odātakasiṇasamāpattiparamā kho, bhagini… ākāsakasiṇasamāpattiparamā kho, bhagini… viññāṇakasiṇasamāpattiparamā kho, bhagini, eke samaṇabrāhmaṇā ‘attho’ti abhinibbattesuṃ . Yāvatā kho, bhagini, viññāṇakasiṇasamāpattiparamatā, tadabhiññāsi bhagavā. Tadabhiññāya bhagavā assādamaddasa ādīnavamaddasa nissaraṇamaddasa maggāmaggañāṇadassanamaddasa. Tassa assādadassanahetu ādīnavadassanahetu nissaraṇadassanahetu maggāmaggañāṇadassanahetu atthassa patti hadayassa santi viditā hoti. Iti kho, bhagini, yaṃ taṃ vuttaṃ bhagavatā kumāripañhesu –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘Atthassa ",
      " pattiṃ hadayassa santiṃ,"
    ],
    "innerText": "‘Atthassa pattiṃ hadayassa santiṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Jetvāna senaṃ piyasātarūpaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Ekohaṃ jhāyaṃ sukhamanubodhiṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "children": [
      "Tasmā ",
      " janena na karomi sakkhiṃ;"
    ],
    "innerText": "Tasmā janena na karomi sakkhiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sakkhī na sampajjati kenaci me’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Imassa ",
      " kho, bhagini, bhagavatā saṃkhittena bhāsitassa evaṃ vitthārena attho daṭṭhabbo’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Imassa kho, bhagini, bhagavatā saṃkhittena bhāsitassa evaṃ vitthārena attho daṭṭhabbo’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Paṭhamamahāpañhāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      ". Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho sambahulā bhikkhū pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pavisiṃsu. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘atippago kho tāva sāvatthiyaṃ piṇḍāya carituṃ; yaṃnūna mayaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyyāmā’’ti."
    ],
    "innerText": "27. Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho sambahulā bhikkhū pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pavisiṃsu. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘atippago kho tāva sāvatthiyaṃ piṇḍāya carituṃ; yaṃnūna mayaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyyāmā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho te bhikkhū yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkamiṃsu; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinne kho te bhikkhū te aññatitthiyā paribbājakā etadavocuṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Samaṇo, āvuso, gotamo sāvakānaṃ evaṃ dhammaṃ deseti – ‘etha tumhe, bhikkhave, sabbaṃ dhammaṃ abhijānātha, sabbaṃ dhammaṃ abhiññāya viharathā’ti; mayampi kho, āvuso, sāvakānaṃ ",
      " evaṃ dhammaṃ desema – ‘etha tumhe, āvuso, sabbaṃ dhammaṃ abhijānātha, sabbaṃ dhammaṃ abhiññāya viharathā’ti. Idha no, āvuso, ko viseso ko adhippayāso kiṃ nānākaraṇaṃ samaṇassa vā gotamassa amhākaṃ vā, yadidaṃ dhammadesanāya ",
      " vā dhammadesanaṃ anusāsaniyā vā anusāsani’’nti?"
    ],
    "innerText": "‘‘Samaṇo, āvuso, gotamo sāvakānaṃ evaṃ dhammaṃ deseti – ‘etha tumhe, bhikkhave, sabbaṃ dhammaṃ abhijānātha, sabbaṃ dhammaṃ abhiññāya viharathā’ti; mayampi kho, āvuso, sāvakānaṃ evaṃ dhammaṃ desema – ‘etha tumhe, āvuso, sabbaṃ dhammaṃ abhijānātha, sabbaṃ dhammaṃ abhiññāya viharathā’ti. Idha no, āvuso, ko viseso ko adhippayāso kiṃ nānākaraṇaṃ samaṇassa vā gotamassa amhākaṃ vā, yadidaṃ dhammadesanāya vā dhammadesanaṃ anusāsaniyā vā anusāsani’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho te bhikkhū tesaṃ aññatitthiyānaṃ paribbājakānaṃ bhāsitaṃ neva abhinandiṃsu nappaṭikkosiṃsu. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā ",
      " pakkamiṃsu – ‘‘bhagavato ",
      " santike etassa bhāsitassa atthaṃ ājānissāmā’’ti."
    ],
    "innerText": "Atha kho te bhikkhū tesaṃ aññatitthiyānaṃ paribbājakānaṃ bhāsitaṃ neva abhinandiṃsu nappaṭikkosiṃsu. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā pakkamiṃsu – ‘‘bhagavato santike etassa bhāsitassa atthaṃ ājānissāmā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho te bhikkhū sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkantā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha mayaṃ, bhante, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pavisimhā. Tesaṃ no, bhante, amhākaṃ etadahosi – ‘atippago kho tāva sāvatthiyaṃ piṇḍāya carituṃ; yaṃnūna mayaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyyāmā’ti. Atha kho mayaṃ, bhante, yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkamimhā; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṃ sammodimhā. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdimhā. Ekamantaṃ nisinne kho, bhante, aññatitthiyā paribbājakā amhe etadavocuṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘Samaṇo, āvuso, gotamo sāvakānaṃ evaṃ dhammaṃ deseti – etha tumhe, bhikkhave, sabbaṃ dhammaṃ abhijānātha, sabbaṃ dhammaṃ abhiññāya viharathāti; mayampi kho, āvuso, sāvakānaṃ evaṃ dhammaṃ desema – etha tumhe, āvuso, sabbaṃ dhammaṃ abhijānātha, sabbaṃ dhammaṃ abhiññāya viharathāti. Idha no, āvuso, ko viseso ko adhippayāso kiṃ nānākaraṇaṃ samaṇassa vā gotamassa amhākaṃ vā, yadidaṃ dhammadesanāya vā dhammadesanaṃ anusāsaniyā vā anusāsani’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha ",
      " kho ",
      " mayaṃ, bhante, tesaṃ aññatitthiyānaṃ paribbājakānaṃ bhāsitaṃ ",
      " neva abhinandimhā nappaṭikkosimhā. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā pakkamimhā – ‘bhagavato santike etassa bhāsitassa atthaṃ ājānissāmā’’’ti."
    ],
    "innerText": "‘‘Atha kho mayaṃ, bhante, tesaṃ aññatitthiyānaṃ paribbājakānaṃ bhāsitaṃ neva abhinandimhā nappaṭikkosimhā. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā pakkamimhā – ‘bhagavato santike etassa bhāsitassa atthaṃ ājānissāmā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃvādino, bhikkhave, aññatitthiyā paribbājakā evamassu vacanīyā – ‘eko, āvuso, pañho eko uddeso ekaṃ veyyākaraṇaṃ, dve pañhā dve uddesā dve veyyākaraṇāni, tayo pañhā tayo uddesā tīṇi veyyākaraṇāni, cattāro pañhā cattāro uddesā cattāri veyyākaraṇāni, pañca pañhā pañcuddesā pañca veyyākaraṇāni, cha ",
      " pañhā cha uddesā cha veyyākaraṇāni, satta pañhā sattuddesā satta veyyākaraṇāni, aṭṭha pañhā aṭṭhuddesā aṭṭha veyyākaraṇāni, nava pañhā navuddesā nava veyyākaraṇāni, dasa pañhā dasuddesā dasa veyyākaraṇānī’ti. Evaṃ puṭṭhā, bhikkhave, aññatitthiyā paribbājakā na ceva sampāyissanti, uttari ca vighātaṃ āpajjissanti. Taṃ kissa hetu? Yathā taṃ, bhikkhave, avisayasmiṃ. Nāhaṃ taṃ, bhikkhave, passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya yo imesaṃ pañhānaṃ veyyākaraṇena cittaṃ ārādheyya, aññatra tathāgatena vā tathāgatasāvakena vā ito vā pana sutvā."
    ],
    "innerText": "‘‘Evaṃvādino, bhikkhave, aññatitthiyā paribbājakā evamassu vacanīyā – ‘eko, āvuso, pañho eko uddeso ekaṃ veyyākaraṇaṃ, dve pañhā dve uddesā dve veyyākaraṇāni, tayo pañhā tayo uddesā tīṇi veyyākaraṇāni, cattāro pañhā cattāro uddesā cattāri veyyākaraṇāni, pañca pañhā pañcuddesā pañca veyyākaraṇāni, cha pañhā cha uddesā cha veyyākaraṇāni, satta pañhā sattuddesā satta veyyākaraṇāni, aṭṭha pañhā aṭṭhuddesā aṭṭha veyyākaraṇāni, nava pañhā navuddesā nava veyyākaraṇāni, dasa pañhā dasuddesā dasa veyyākaraṇānī’ti. Evaṃ puṭṭhā, bhikkhave, aññatitthiyā paribbājakā na ceva sampāyissanti, uttari ca vighātaṃ āpajjissanti. Taṃ kissa hetu? Yathā taṃ, bhikkhave, avisayasmiṃ. Nāhaṃ taṃ, bhikkhave, passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya yo imesaṃ pañhānaṃ veyyākaraṇena cittaṃ ārādheyya, aññatra tathāgatena vā tathāgatasāvakena vā ito vā pana sutvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Eko pañho eko uddeso ekaṃ veyyākaraṇa’nti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Ekadhamme, bhikkhave, bhikkhu sammā nibbindamāno sammā ",
      " virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamasmiṃ ekadhamme? ‘Sabbe sattā āhāraṭṭhitikā’ – imasmiṃ ",
      " kho, bhikkhave, ekadhamme bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Eko pañho eko uddeso ekaṃ veyyākaraṇa’nti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘‘Eko pañho eko uddeso ekaṃ veyyākaraṇa’nti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Ekadhamme, bhikkhave, bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamasmiṃ ekadhamme? ‘Sabbe sattā āhāraṭṭhitikā’ – imasmiṃ kho, bhikkhave, ekadhamme bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Eko pañho eko uddeso ekaṃ veyyākaraṇa’nti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Dve pañhā dve uddesā dve veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Dvīsu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu dvīsu? Nāme ca rūpe ca – imesu kho, bhikkhave, dvīsu dhammesu ",
      " bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Dve pañhā dve uddesā dve veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘‘Dve pañhā dve uddesā dve veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Dvīsu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu dvīsu? Nāme ca rūpe ca – imesu kho, bhikkhave, dvīsu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Dve pañhā dve uddesā dve veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Tayo pañhā tayo uddesā tīṇi veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tīsu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti ",
      ". Katamesu tīsu? Tīsu vedanāsu ",
      " – imesu kho, bhikkhave, tīsu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Tayo pañhā tayo uddesā tīṇi veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘‘Tayo pañhā tayo uddesā tīṇi veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tīsu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti . Katamesu tīsu? Tīsu vedanāsu – imesu kho, bhikkhave, tīsu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Tayo pañhā tayo uddesā tīṇi veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Cattāro pañhā cattāro uddesā cattāri veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Catūsu ",
      ", bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu catūsu? Catūsu āhāresu – imesu kho, bhikkhave, catūsu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Cattāro pañhā cattāro uddesā cattāri veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘‘Cattāro pañhā cattāro uddesā cattāri veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Catūsu , bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu catūsu? Catūsu āhāresu – imesu kho, bhikkhave, catūsu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Cattāro pañhā cattāro uddesā cattāri veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Pañca pañhā pañcuddesā pañca veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Pañcasu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu pañcasu? Pañcasu upādānakkhandhesu – imesu kho, bhikkhave, pañcasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti ",
      ". ‘Pañca pañhā pañcuddesā pañca veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘‘Pañca pañhā pañcuddesā pañca veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Pañcasu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu pañcasu? Pañcasu upādānakkhandhesu – imesu kho, bhikkhave, pañcasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti . ‘Pañca pañhā pañcuddesā pañca veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Cha ",
      " pañhā cha uddesā cha veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Chasu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu chasu? Chasu ajjhattikesu āyatanesu – imesu kho, bhikkhave, chasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Cha ",
      " pañhā cha uddesā cha veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘‘Cha pañhā cha uddesā cha veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Chasu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu chasu? Chasu ajjhattikesu āyatanesu – imesu kho, bhikkhave, chasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Cha pañhā cha uddesā cha veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Satta ",
      " pañhā sattuddesā satta veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Sattasu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu sattasu? Sattasu viññāṇaṭṭhitīsu – imesu kho, bhikkhave, sattasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Satta pañhā sattuddesā satta veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘‘Satta pañhā sattuddesā satta veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Sattasu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu sattasu? Sattasu viññāṇaṭṭhitīsu – imesu kho, bhikkhave, sattasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Satta pañhā sattuddesā satta veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Aṭṭha pañhā aṭṭhuddesā aṭṭha veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Aṭṭhasu, bhikkhave ",
      ", dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu aṭṭhasu? Aṭṭhasu lokadhammesu – imesu kho, bhikkhave, aṭṭhasu dhammesu bhikkhu sammā nibbindamāno…pe… dukkhassantakaro hoti. ‘Aṭṭha pañhā aṭṭhuddesā aṭṭha veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘‘Aṭṭha pañhā aṭṭhuddesā aṭṭha veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Aṭṭhasu, bhikkhave , dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu aṭṭhasu? Aṭṭhasu lokadhammesu – imesu kho, bhikkhave, aṭṭhasu dhammesu bhikkhu sammā nibbindamāno…pe… dukkhassantakaro hoti. ‘Aṭṭha pañhā aṭṭhuddesā aṭṭha veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Nava pañhā navuddesā nava veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Navasu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu navasu? Navasu sattāvāsesu – imesu ",
      " kho, bhikkhave, navasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī ",
      " sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Nava pañhā navuddesā nava veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘‘Nava pañhā navuddesā nava veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Navasu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu navasu? Navasu sattāvāsesu – imesu kho, bhikkhave, navasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Nava pañhā navuddesā nava veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Dasa pañhā dasuddesā dasa veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Dasasu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu dasasu? Dasasu akusalesu kammapathesu ",
      " – imesu kho, bhikkhave, dasasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti ",
      ". ‘Dasa pañhā dasuddesā dasa veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vutta’’nti. Sattamaṃ."
    ],
    "innerText": "‘‘‘Dasa pañhā dasuddesā dasa veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Dasasu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu dasasu? Dasasu akusalesu kammapathesu – imesu kho, bhikkhave, dasasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti . ‘Dasa pañhā dasuddesā dasa veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vutta’’nti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Dutiyamahāpañhāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      ". Ekaṃ samayaṃ bhagavā kajaṅgalāyaṃ viharati veḷuvane. Atha kho sambahulā kajaṅgalakā upāsakā yena kajaṅgalikā bhikkhunī tenupasaṅkamiṃsu; upasaṅkamitvā kajaṅgalikaṃ bhikkhuniṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho kajaṅgalakā upāsakā kajaṅgalikaṃ bhikkhuniṃ etadavocuṃ –"
    ],
    "innerText": "28. Ekaṃ samayaṃ bhagavā kajaṅgalāyaṃ viharati veḷuvane. Atha kho sambahulā kajaṅgalakā upāsakā yena kajaṅgalikā bhikkhunī tenupasaṅkamiṃsu; upasaṅkamitvā kajaṅgalikaṃ bhikkhuniṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho kajaṅgalakā upāsakā kajaṅgalikaṃ bhikkhuniṃ etadavocuṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Vuttamidaṃ, ayye, bhagavatā mahāpañhesu – ‘eko pañho eko uddeso ekaṃ veyyākaraṇaṃ, dve pañhā dve uddesā dve veyyākaraṇāni, tayo pañhā tayo uddesā tīṇi veyyākaraṇāni, cattāro ",
      " pañhā cattāro uddesā cattāri veyyākaraṇāni, pañca pañhā pañcuddesā pañca veyyākaraṇāni, cha pañhā cha uddesā cha veyyākaraṇāni, satta pañhā sattuddesā satta veyyākaraṇāni, aṭṭha pañhā aṭṭhuddesā aṭṭha veyyākaraṇāni, nava pañhā navuddesā nava veyyākaraṇāni, dasa pañhā dasuddesā dasa veyyākaraṇānī’ti. Imassa nu kho, ayye, bhagavatā saṃkhittena bhāsitassa kathaṃ vitthārena attho daṭṭhabbo’’ti?"
    ],
    "innerText": "‘‘Vuttamidaṃ, ayye, bhagavatā mahāpañhesu – ‘eko pañho eko uddeso ekaṃ veyyākaraṇaṃ, dve pañhā dve uddesā dve veyyākaraṇāni, tayo pañhā tayo uddesā tīṇi veyyākaraṇāni, cattāro pañhā cattāro uddesā cattāri veyyākaraṇāni, pañca pañhā pañcuddesā pañca veyyākaraṇāni, cha pañhā cha uddesā cha veyyākaraṇāni, satta pañhā sattuddesā satta veyyākaraṇāni, aṭṭha pañhā aṭṭhuddesā aṭṭha veyyākaraṇāni, nava pañhā navuddesā nava veyyākaraṇāni, dasa pañhā dasuddesā dasa veyyākaraṇānī’ti. Imassa nu kho, ayye, bhagavatā saṃkhittena bhāsitassa kathaṃ vitthārena attho daṭṭhabbo’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na kho panetaṃ, āvuso, bhagavato sammukhā sutaṃ sammukhā paṭiggahitaṃ, napi manobhāvanīyānaṃ bhikkhūnaṃ sammukhā sutaṃ sammukhā paṭiggahitaṃ; api ca, yathā mettha khāyati taṃ ",
      " suṇātha, sādhukaṃ ",
      " manasi karotha, bhāsissāmī’’ti. ‘‘Evaṃ, ayye’’ti, kho kajaṅgalakā upāsakā kajaṅgalikāya bhikkhuniyā paccassosuṃ. Kajaṅgalikā bhikkhunī etadavoca –"
    ],
    "innerText": "‘‘Na kho panetaṃ, āvuso, bhagavato sammukhā sutaṃ sammukhā paṭiggahitaṃ, napi manobhāvanīyānaṃ bhikkhūnaṃ sammukhā sutaṃ sammukhā paṭiggahitaṃ; api ca, yathā mettha khāyati taṃ suṇātha, sādhukaṃ manasi karotha, bhāsissāmī’’ti. ‘‘Evaṃ, ayye’’ti, kho kajaṅgalakā upāsakā kajaṅgalikāya bhikkhuniyā paccassosuṃ. Kajaṅgalikā bhikkhunī etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Eko pañho eko uddeso ekaṃ veyyākaraṇa’nti, iti kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Ekadhamme, āvuso, bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamasmiṃ ekadhamme? Sabbe sattā āhāraṭṭhitikā – imasmiṃ kho, āvuso, ekadhamme bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme ",
      " dukkhassantakaro hoti. ‘Eko pañho eko uddeso ekaṃ veyyākaraṇanti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘‘Eko pañho eko uddeso ekaṃ veyyākaraṇa’nti, iti kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Ekadhamme, āvuso, bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamasmiṃ ekadhamme? Sabbe sattā āhāraṭṭhitikā – imasmiṃ kho, āvuso, ekadhamme bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Eko pañho eko uddeso ekaṃ veyyākaraṇanti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Dve ",
      " pañhā dve uddesā dve veyyākaraṇānī’ti iti, kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Dvīsu, āvuso, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu dvīsu? Nāme ca rūpe ca…pe… ",
      " katamesu tīsu? Tīsu vedanāsu – imesu kho, āvuso, tīsu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Tayo pañhā tayo uddesā tīṇi veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘‘Dve pañhā dve uddesā dve veyyākaraṇānī’ti iti, kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Dvīsu, āvuso, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu dvīsu? Nāme ca rūpe ca…pe… katamesu tīsu? Tīsu vedanāsu – imesu kho, āvuso, tīsu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Tayo pañhā tayo uddesā tīṇi veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Cattāro pañhā cattāro uddesā cattāri veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Catūsu, āvuso, dhammesu bhikkhu sammā subhāvitacitto sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu catūsu? Catūsu satipaṭṭhānesu – imesu kho, āvuso, catūsu dhammesu bhikkhu sammā subhāvitacitto sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Cattāro pañhā cattāro uddesā cattāri veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Pañca ",
      " pañhā pañcuddesā pañca veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Pañcasu, āvuso, dhammesu bhikkhu sammā subhāvitacitto sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu pañcasu? Pañcasu indriyesu…pe… katamesu chasu? Chasu ",
      " nissaraṇīyāsu dhātūsu…pe… katamesu sattasu? Sattasu bojjhaṅgesu…pe… katamesu aṭṭhasu? Aṭṭhasu ariyaaṭṭhaṅgikamaggesu – imesu kho, āvuso, aṭṭhasu dhammesu bhikkhu sammā subhāvitacitto sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Aṭṭha pañhā aṭṭhuddesā aṭṭha veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘‘Pañca pañhā pañcuddesā pañca veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Pañcasu, āvuso, dhammesu bhikkhu sammā subhāvitacitto sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu pañcasu? Pañcasu indriyesu…pe… katamesu chasu? Chasu nissaraṇīyāsu dhātūsu…pe… katamesu sattasu? Sattasu bojjhaṅgesu…pe… katamesu aṭṭhasu? Aṭṭhasu ariyaaṭṭhaṅgikamaggesu – imesu kho, āvuso, aṭṭhasu dhammesu bhikkhu sammā subhāvitacitto sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Aṭṭha pañhā aṭṭhuddesā aṭṭha veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Nava ",
      " pañhā navuddesā nava veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Navasu, āvuso, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu navasu? Navasu sattāvāsesu – imesu kho, āvuso, navasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Nava pañhā navuddesā nava veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘‘Nava pañhā navuddesā nava veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Navasu, āvuso, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu navasu? Navasu sattāvāsesu – imesu kho, āvuso, navasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Nava pañhā navuddesā nava veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Dasa pañhā dasuddesā dasa veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Dasasu, āvuso, dhammesu bhikkhu sammā subhāvitacitto sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu dasasu? Dasasu kusalesu kammapathesu – imesu ",
      " kho, āvuso, dasasu dhammesu bhikkhu sammā subhāvitacitto sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Dasa pañhā dasuddesā ",
      " dasa veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ."
    ],
    "innerText": "‘‘‘Dasa pañhā dasuddesā dasa veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Dasasu, āvuso, dhammesu bhikkhu sammā subhāvitacitto sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu dasasu? Dasasu kusalesu kammapathesu – imesu kho, āvuso, dasasu dhammesu bhikkhu sammā subhāvitacitto sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Dasa pañhā dasuddesā dasa veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Iti kho, āvuso, yaṃ taṃ vuttaṃ bhagavatā saṃkhittena bhāsitāsu mahāpañhāsu – ‘eko pañho eko uddeso ekaṃ veyyākaraṇaṃ…pe… dasa pañhā dasuddesā dasa veyyākaraṇānī’ti, imassa kho ahaṃ, āvuso, bhagavatā saṃkhittena bhāsitassa evaṃ vitthārena atthaṃ ",
      " ājānāmi. Ākaṅkhamānā ca pana tumhe, āvuso, bhagavantaññeva upasaṅkamitvā etamatthaṃ paṭipuccheyyātha. Yathā vo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathā kho (ka.), yathā no (bahūsu) a. ni. 10.115, 172 pana pāṭhabhedo natthi]"
      },
      " bhagavā byākaroti tathā naṃ dhāreyyāthā’’ti. ‘‘Evaṃ, ayye’’ti kho kajaṅgalakā upāsakā kajaṅgalikāya kho bhikkhuniyā bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā kajaṅgalikaṃ bhikkhuniṃ abhivādetvā padakkhiṇaṃ katvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho kajaṅgalakā upāsakā yāvatako ahosi kajaṅgalikāya bhikkhuniyā saddhiṃ kathāsallāpo, taṃ sabbaṃ bhagavato ārocesuṃ."
    ],
    "innerText": "‘‘Iti kho, āvuso, yaṃ taṃ vuttaṃ bhagavatā saṃkhittena bhāsitāsu mahāpañhāsu – ‘eko pañho eko uddeso ekaṃ veyyākaraṇaṃ…pe… dasa pañhā dasuddesā dasa veyyākaraṇānī’ti, imassa kho ahaṃ, āvuso, bhagavatā saṃkhittena bhāsitassa evaṃ vitthārena atthaṃ ājānāmi. Ākaṅkhamānā ca pana tumhe, āvuso, bhagavantaññeva upasaṅkamitvā etamatthaṃ paṭipuccheyyātha. Yathā vo [yathā kho (ka.), yathā no (bahūsu) a. ni. 10.115, 172 pana pāṭhabhedo natthi] bhagavā byākaroti tathā naṃ dhāreyyāthā’’ti. ‘‘Evaṃ, ayye’’ti kho kajaṅgalakā upāsakā kajaṅgalikāya kho bhikkhuniyā bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā kajaṅgalikaṃ bhikkhuniṃ abhivādetvā padakkhiṇaṃ katvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho kajaṅgalakā upāsakā yāvatako ahosi kajaṅgalikāya bhikkhuniyā saddhiṃ kathāsallāpo, taṃ sabbaṃ bhagavato ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu ",
      " sādhu, gahapatayo! Paṇḍitā, gahapatayo, kajaṅgalikā bhikkhunī. Mahāpaññā, gahapatayo, kajaṅgalikā bhikkhunī. Mañcepi tumhe, gahapatayo, upasaṅkamitvā etamatthaṃ paṭipuccheyyātha, ahampi cetaṃ evamevaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[evameva (ka.) ma. ni. 1.205 passitabbaṃ]"
      },
      " byākareyyaṃ yathā taṃ kajaṅgalikāya bhikkhuniyā byākataṃ. Eso ceva tassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[eso cevetassa (ma. ni. 1.205)]"
      },
      " attho. Evañca naṃ dhāreyyāthā’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "‘‘Sādhu sādhu, gahapatayo! Paṇḍitā, gahapatayo, kajaṅgalikā bhikkhunī. Mahāpaññā, gahapatayo, kajaṅgalikā bhikkhunī. Mañcepi tumhe, gahapatayo, upasaṅkamitvā etamatthaṃ paṭipuccheyyātha, ahampi cetaṃ evamevaṃ [evameva (ka.) ma. ni. 1.205 passitabbaṃ] byākareyyaṃ yathā taṃ kajaṅgalikāya bhikkhuniyā byākataṃ. Eso ceva tassa [eso cevetassa (ma. ni. 1.205)] attho. Evañca naṃ dhāreyyāthā’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Paṭhamakosalasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "29"
      },
      ". ‘‘Yāvatā, bhikkhave, kāsikosalā, yāvatā rañño pasenadissa kosalassa vijitaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vijite (sī. ka.)]"
      },
      ", rājā tattha pasenadi kosalo aggamakkhāyati. Raññopi ",
      " kho, bhikkhave, pasenadissa kosalassa attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ."
    ],
    "innerText": "29. ‘‘Yāvatā, bhikkhave, kāsikosalā, yāvatā rañño pasenadissa kosalassa vijitaṃ [vijite (sī. ka.)], rājā tattha pasenadi kosalo aggamakkhāyati. Raññopi kho, bhikkhave, pasenadissa kosalassa attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yāvatā, bhikkhave, candimasūriyā pariharanti disā bhanti virocamānā, tāva sahassadhā loko. Tasmiṃ sahassadhā loke sahassaṃ candānaṃ sahassaṃ sūriyānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[suriyānaṃ (sī. syā. kaṃ. pī.)]"
      },
      " sahassaṃ sinerupabbatarājānaṃ sahassaṃ jambudīpānaṃ sahassaṃ aparagoyānānaṃ sahassaṃ uttarakurūnaṃ sahassaṃ pubbavidehānaṃ cattāri mahāsamuddasahassāni cattāri mahārājasahassāni sahassaṃ cātumahārājikānaṃ sahassaṃ tāvatiṃsānaṃ sahassaṃ yāmānaṃ sahassaṃ tusitānaṃ sahassaṃ nimmānaratīnaṃ sahassaṃ paranimmitavasavattīnaṃ sahassaṃ brahmalokānaṃ. Yāvatā, bhikkhave, sahassī lokadhātu, mahābrahmā tattha ",
      " aggamakkhāyati. Mahābrahmunopi kho, bhikkhave, attheva aññathattaṃ atthi ",
      " vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ."
    ],
    "innerText": "‘‘Yāvatā, bhikkhave, candimasūriyā pariharanti disā bhanti virocamānā, tāva sahassadhā loko. Tasmiṃ sahassadhā loke sahassaṃ candānaṃ sahassaṃ sūriyānaṃ [suriyānaṃ (sī. syā. kaṃ. pī.)] sahassaṃ sinerupabbatarājānaṃ sahassaṃ jambudīpānaṃ sahassaṃ aparagoyānānaṃ sahassaṃ uttarakurūnaṃ sahassaṃ pubbavidehānaṃ cattāri mahāsamuddasahassāni cattāri mahārājasahassāni sahassaṃ cātumahārājikānaṃ sahassaṃ tāvatiṃsānaṃ sahassaṃ yāmānaṃ sahassaṃ tusitānaṃ sahassaṃ nimmānaratīnaṃ sahassaṃ paranimmitavasavattīnaṃ sahassaṃ brahmalokānaṃ. Yāvatā, bhikkhave, sahassī lokadhātu, mahābrahmā tattha aggamakkhāyati. Mahābrahmunopi kho, bhikkhave, attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Hoti so, bhikkhave, samayo yaṃ ayaṃ loko saṃvaṭṭati. Saṃvaṭṭamāne, bhikkhave, loke yebhuyyena sattā ābhassarasaṃvattanikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ābhassaravattanikā (sī. syā.)]"
      },
      " bhavanti. Te tattha honti manomayā pītibhakkhā sayaṃpabhā antalikkhecarā subhaṭṭhāyino ciraṃ dīghamaddhānaṃ tiṭṭhanti. Saṃvaṭṭamāne, bhikkhave, loke ābhassarā ",
      " devā aggamakkhāyanti. Ābhassarānampi kho, bhikkhave, devānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati ",
      ". Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ."
    ],
    "innerText": "‘‘Hoti so, bhikkhave, samayo yaṃ ayaṃ loko saṃvaṭṭati. Saṃvaṭṭamāne, bhikkhave, loke yebhuyyena sattā ābhassarasaṃvattanikā [ābhassaravattanikā (sī. syā.)] bhavanti. Te tattha honti manomayā pītibhakkhā sayaṃpabhā antalikkhecarā subhaṭṭhāyino ciraṃ dīghamaddhānaṃ tiṭṭhanti. Saṃvaṭṭamāne, bhikkhave, loke ābhassarā devā aggamakkhāyanti. Ābhassarānampi kho, bhikkhave, devānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati . Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[a. ni. 10.25]"
      },
      " ‘‘Dasayimāni, bhikkhave, kasiṇāyatanāni. Katamāni dasa? Pathavīkasiṇameko sañjānāti uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ; āpokasiṇameko sañjānāti…pe… tejokasiṇameko sañjānāti… vāyokasiṇameko sañjānāti… nīlakasiṇameko sañjānāti… pītakasiṇameko sañjānāti… lohitakasiṇameko sañjānāti… odātakasiṇameko sañjānāti… ākāsakasiṇameko sañjānāti… viññāṇakasiṇameko sañjānāti uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ. Imāni kho, bhikkhave, dasa kasiṇāyatanāni."
    ],
    "innerText": "[a. ni. 10.25] ‘‘Dasayimāni, bhikkhave, kasiṇāyatanāni. Katamāni dasa? Pathavīkasiṇameko sañjānāti uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ; āpokasiṇameko sañjānāti…pe… tejokasiṇameko sañjānāti… vāyokasiṇameko sañjānāti… nīlakasiṇameko sañjānāti… pītakasiṇameko sañjānāti… lohitakasiṇameko sañjānāti… odātakasiṇameko sañjānāti… ākāsakasiṇameko sañjānāti… viññāṇakasiṇameko sañjānāti uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ. Imāni kho, bhikkhave, dasa kasiṇāyatanāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Etadaggaṃ, bhikkhave, imesaṃ dasannaṃ kasiṇāyatanānaṃ yadidaṃ viññāṇakasiṇaṃ eko sañjānāti uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ. Evaṃsaññinopi kho, bhikkhave, santi sattā. Evaṃsaññīnampi kho, bhikkhave, sattānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ ",
      ", bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ."
    ],
    "innerText": "‘‘Etadaggaṃ, bhikkhave, imesaṃ dasannaṃ kasiṇāyatanānaṃ yadidaṃ viññāṇakasiṇaṃ eko sañjānāti uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ. Evaṃsaññinopi kho, bhikkhave, santi sattā. Evaṃsaññīnampi kho, bhikkhave, sattānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ , bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dī. ni. 3.338, 358; a. ni. 8.64]"
      },
      " ‘‘Aṭṭhimāni, bhikkhave, abhibhāyatanāni. Katamāni aṭṭha? Ajjhattaṃ rūpasaññī eko bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ paṭhamaṃ abhibhāyatanaṃ."
    ],
    "innerText": "[dī. ni. 3.338, 358; a. ni. 8.64] ‘‘Aṭṭhimāni, bhikkhave, abhibhāyatanāni. Katamāni aṭṭha? Ajjhattaṃ rūpasaññī eko bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ paṭhamaṃ abhibhāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ajjhattaṃ ",
      " rūpasaññī eko bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ dutiyaṃ abhibhāyatanaṃ."
    ],
    "innerText": "‘‘Ajjhattaṃ rūpasaññī eko bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ dutiyaṃ abhibhāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni; ‘tāni ",
      " abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ tatiyaṃ abhibhāyatanaṃ."
    ],
    "innerText": "‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ tatiyaṃ abhibhāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ajjhattaṃ ",
      " arūpasaññī eko bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ catutthaṃ abhibhāyatanaṃ."
    ],
    "innerText": "‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ catutthaṃ abhibhāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati nīlāni nīlavaṇṇāni nīlanidassanāni nīlanibhāsāni. Seyyathāpi nāma umāpupphaṃ nīlaṃ nīlavaṇṇaṃ nīlanidassanaṃ nīlanibhāsaṃ, seyyathā vā pana taṃ vatthaṃ bārāṇaseyyakaṃ ubhatobhāgavimaṭṭhaṃ nīlaṃ nīlavaṇṇaṃ nīlanidassanaṃ nīlanibhāsaṃ; evamevaṃ ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati nīlāni nīlavaṇṇāni nīlanidassanāni nīlanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ pañcamaṃ abhibhāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati pītāni pītavaṇṇāni pītanidassanāni pītanibhāsāni. Seyyathāpi nāma kaṇikārapupphaṃ pītaṃ pītavaṇṇaṃ pītanidassanaṃ pītanibhāsaṃ, seyyathā vā pana taṃ vatthaṃ bārāṇaseyyakaṃ ",
      " ubhatobhāgavimaṭṭhaṃ pītaṃ pītavaṇṇaṃ pītanidassanaṃ pītanibhāsaṃ; evamevaṃ ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati pītāni pītavaṇṇāni pītanidassanāni pītanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ chaṭṭhaṃ abhibhāyatanaṃ."
    ],
    "innerText": "‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati pītāni pītavaṇṇāni pītanidassanāni pītanibhāsāni. Seyyathāpi nāma kaṇikārapupphaṃ pītaṃ pītavaṇṇaṃ pītanidassanaṃ pītanibhāsaṃ, seyyathā vā pana taṃ vatthaṃ bārāṇaseyyakaṃ ubhatobhāgavimaṭṭhaṃ pītaṃ pītavaṇṇaṃ pītanidassanaṃ pītanibhāsaṃ; evamevaṃ ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati pītāni pītavaṇṇāni pītanidassanāni pītanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ chaṭṭhaṃ abhibhāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati lohitakāni lohitakavaṇṇāni lohitakanidassanāni lohitakanibhāsāni. Seyyathāpi nāma bandhujīvakapupphaṃ ",
      " lohitakaṃ lohitakavaṇṇaṃ lohitakanidassanaṃ lohitakanibhāsaṃ, seyyathā vā pana taṃ vatthaṃ bārāṇaseyyakaṃ ubhatobhāgavimaṭṭhaṃ lohitakaṃ lohitakavaṇṇaṃ lohitakanidassanaṃ lohitakanibhāsaṃ; evamevaṃ ajjhattaṃ ",
      " arūpasaññī eko bahiddhā rūpāni passati lohitakāni lohitakavaṇṇāni lohitakanidassanāni lohitakanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ sattamaṃ abhibhāyatanaṃ."
    ],
    "innerText": "‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati lohitakāni lohitakavaṇṇāni lohitakanidassanāni lohitakanibhāsāni. Seyyathāpi nāma bandhujīvakapupphaṃ lohitakaṃ lohitakavaṇṇaṃ lohitakanidassanaṃ lohitakanibhāsaṃ, seyyathā vā pana taṃ vatthaṃ bārāṇaseyyakaṃ ubhatobhāgavimaṭṭhaṃ lohitakaṃ lohitakavaṇṇaṃ lohitakanidassanaṃ lohitakanibhāsaṃ; evamevaṃ ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati lohitakāni lohitakavaṇṇāni lohitakanidassanāni lohitakanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ sattamaṃ abhibhāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni. Seyyathāpi nāma osadhitārakā odātā odātavaṇṇā odātanidassanā odātanibhāsā, seyyathā ",
      " vā pana taṃ vatthaṃ bārāṇaseyyakaṃ ubhatobhāgavimaṭṭhaṃ odātaṃ odātavaṇṇaṃ odātanidassanaṃ odātanibhāsaṃ; evamevaṃ ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ aṭṭhamaṃ abhibhāyatanaṃ. Imāni kho, bhikkhave, aṭṭha abhibhāyatanāni."
    ],
    "innerText": "‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni. Seyyathāpi nāma osadhitārakā odātā odātavaṇṇā odātanidassanā odātanibhāsā, seyyathā vā pana taṃ vatthaṃ bārāṇaseyyakaṃ ubhatobhāgavimaṭṭhaṃ odātaṃ odātavaṇṇaṃ odātanidassanaṃ odātanibhāsaṃ; evamevaṃ ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ aṭṭhamaṃ abhibhāyatanaṃ. Imāni kho, bhikkhave, aṭṭha abhibhāyatanāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Etadaggaṃ, bhikkhave, imesaṃ aṭṭhannaṃ abhibhāyatanānaṃ yadidaṃ ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Evaṃsaññinopi kho, bhikkhave, santi sattā. Evaṃsaññīnampi kho, bhikkhave, sattānaṃ attheva aññathattaṃ ",
      " atthi vipariṇāmo. Evaṃ ",
      " passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ."
    ],
    "innerText": "‘‘Etadaggaṃ, bhikkhave, imesaṃ aṭṭhannaṃ abhibhāyatanānaṃ yadidaṃ ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Evaṃsaññinopi kho, bhikkhave, santi sattā. Evaṃsaññīnampi kho, bhikkhave, sattānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā – imā kho, bhikkhave, catasso paṭipadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Etadaggaṃ, bhikkhave, imāsaṃ catunnaṃ paṭipadānaṃ yadidaṃ sukhā paṭipadā khippābhiññā. Evaṃpaṭipannāpi kho, bhikkhave, santi sattā. Evaṃpaṭipannānampi kho, bhikkhave, sattānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Catasso ",
      " imā, bhikkhave, saññā. Katamā catasso? Parittameko sañjānāti, mahaggatameko sañjānāti, appamāṇameko sañjānāti, ‘natthi kiñcī’ti ākiñcaññāyatanameko sañjānāti – imā kho, bhikkhave, catasso saññā."
    ],
    "innerText": "‘‘Catasso imā, bhikkhave, saññā. Katamā catasso? Parittameko sañjānāti, mahaggatameko sañjānāti, appamāṇameko sañjānāti, ‘natthi kiñcī’ti ākiñcaññāyatanameko sañjānāti – imā kho, bhikkhave, catasso saññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Etadaggaṃ, bhikkhave, imāsaṃ catunnaṃ saññānaṃ yadidaṃ ‘natthi kiñcī’ti ākiñcaññāyatanameko sañjānāti. Evaṃsaññinopi kho, bhikkhave, santi sattā. Evaṃsaññīnampi kho, bhikkhave, sattānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Etadaggaṃ ",
      ", bhikkhave, bāhirakānaṃ diṭṭhigatānaṃ yadidaṃ ‘no cassaṃ, no ca me siyā, na bhavissāmi, na me bhavissatī’ti. Evaṃdiṭṭhino, bhikkhave ",
      ", etaṃ pāṭikaṅkhaṃ – ‘yā cāyaṃ bhave appaṭikulyatā, sā cassa na ",
      " bhavissati; yā cāyaṃ bhavanirodhe pāṭikulyatā, sā cassa na bhavissatī’ti. Evaṃdiṭṭhinopi kho, bhikkhave, santi sattā. Evaṃdiṭṭhīnampi kho, bhikkhave, sattānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ."
    ],
    "innerText": "‘‘Etadaggaṃ , bhikkhave, bāhirakānaṃ diṭṭhigatānaṃ yadidaṃ ‘no cassaṃ, no ca me siyā, na bhavissāmi, na me bhavissatī’ti. Evaṃdiṭṭhino, bhikkhave , etaṃ pāṭikaṅkhaṃ – ‘yā cāyaṃ bhave appaṭikulyatā, sā cassa na bhavissati; yā cāyaṃ bhavanirodhe pāṭikulyatā, sā cassa na bhavissatī’ti. Evaṃdiṭṭhinopi kho, bhikkhave, santi sattā. Evaṃdiṭṭhīnampi kho, bhikkhave, sattānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā paramatthavisuddhiṃ paññāpenti. Etadaggaṃ, bhikkhave, paramatthavisuddhiṃ paññāpentānaṃ yadidaṃ sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Te tadabhiññāya tassa sacchikiriyāya dhammaṃ desenti. Evaṃvādinopi kho, bhikkhave, santi sattā. Evaṃvādīnampi kho, bhikkhave, sattānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā paramadiṭṭhadhammanibbānaṃ paññāpenti. Etadaggaṃ, bhikkhave, paramadiṭṭhadhammanibbānaṃ paññāpentānaṃ yadidaṃ channaṃ phassāyatanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādā vimokkho. Evaṃvādiṃ kho maṃ, bhikkhave, evamakkhāyiṃ eke samaṇabrāhmaṇā asatā tucchā musā abhūtena abbhācikkhanti – ‘samaṇo ",
      " gotamo na kāmānaṃ pariññaṃ paññāpeti, na ",
      " rūpānaṃ pariññaṃ paññāpeti, na vedanānaṃ pariññaṃ paññāpetī’ti. Kāmānañcāhaṃ ",
      ", bhikkhave, pariññaṃ paññāpemi, rūpānañca pariññaṃ paññāpemi, vedanānañca pariññaṃ paññāpemi, diṭṭheva dhamme nicchāto nibbuto sītibhūto anupādā parinibbānaṃ paññāpemī’’ti. Navamaṃ."
    ],
    "innerText": "‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā paramadiṭṭhadhammanibbānaṃ paññāpenti. Etadaggaṃ, bhikkhave, paramadiṭṭhadhammanibbānaṃ paññāpentānaṃ yadidaṃ channaṃ phassāyatanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādā vimokkho. Evaṃvādiṃ kho maṃ, bhikkhave, evamakkhāyiṃ eke samaṇabrāhmaṇā asatā tucchā musā abhūtena abbhācikkhanti – ‘samaṇo gotamo na kāmānaṃ pariññaṃ paññāpeti, na rūpānaṃ pariññaṃ paññāpeti, na vedanānaṃ pariññaṃ paññāpetī’ti. Kāmānañcāhaṃ , bhikkhave, pariññaṃ paññāpemi, rūpānañca pariññaṃ paññāpemi, vedanānañca pariññaṃ paññāpemi, diṭṭheva dhamme nicchāto nibbuto sītibhūto anupādā parinibbānaṃ paññāpemī’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Dutiyakosalasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ". Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena rājā pasenadi kosalo uyyodhikā nivatto hoti vijitasaṅgāmo laddhādhippāyo. Atha kho rājā pasenadi kosalo yena ārāmo tena pāyāsi. Yāvatikā yānassa bhūmi, yānena gantvā yānā paccorohitvā pattikova ārāmaṃ pāvisi. Tena kho pana samayena sambahulā bhikkhū ",
      " abbhokāse caṅkamanti. Atha kho rājā pasenadi kosalo yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū etadavoca – ‘‘kahaṃ nu kho, bhante, bhagavā etarahi viharati arahaṃ sammāsambuddho. Dassanakāmā hi mayaṃ, bhante, taṃ bhagavantaṃ arahantaṃ sammāsambuddha’’nti. ‘‘Eso, mahārāja, vihāro saṃvutadvāro. Tena appasaddo upasaṅkamitvā ataramāno ālindaṃ pavisitvā ukkāsitvā aggaḷaṃ ākoṭehi; vivarissati te bhagavā dvāra’’nti."
    ],
    "innerText": "30. Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena rājā pasenadi kosalo uyyodhikā nivatto hoti vijitasaṅgāmo laddhādhippāyo. Atha kho rājā pasenadi kosalo yena ārāmo tena pāyāsi. Yāvatikā yānassa bhūmi, yānena gantvā yānā paccorohitvā pattikova ārāmaṃ pāvisi. Tena kho pana samayena sambahulā bhikkhū abbhokāse caṅkamanti. Atha kho rājā pasenadi kosalo yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū etadavoca – ‘‘kahaṃ nu kho, bhante, bhagavā etarahi viharati arahaṃ sammāsambuddho. Dassanakāmā hi mayaṃ, bhante, taṃ bhagavantaṃ arahantaṃ sammāsambuddha’’nti. ‘‘Eso, mahārāja, vihāro saṃvutadvāro. Tena appasaddo upasaṅkamitvā ataramāno ālindaṃ pavisitvā ukkāsitvā aggaḷaṃ ākoṭehi; vivarissati te bhagavā dvāra’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho rājā pasenadi kosalo yena so vihāro saṃvutadvāro, tena appasaddo upasaṅkamitvā ataramāno ālindaṃ pavisitvā ukkāsitvā aggaḷaṃ ākoṭesi. Vivari bhagavā dvāraṃ. Atha kho rājā pasenadi kosalo vihāraṃ pavisitvā bhagavato pādesu sirasā nipatitvā bhagavato pādāni mukhena ",
      " ca paricumbati pāṇīhi ca parisambāhati nāmañca sāveti – ‘‘rājāhaṃ, bhante, pasenadi kosalo; rājāhaṃ, bhante ",
      ", pasenadi kosalo’’ti."
    ],
    "innerText": "Atha kho rājā pasenadi kosalo yena so vihāro saṃvutadvāro, tena appasaddo upasaṅkamitvā ataramāno ālindaṃ pavisitvā ukkāsitvā aggaḷaṃ ākoṭesi. Vivari bhagavā dvāraṃ. Atha kho rājā pasenadi kosalo vihāraṃ pavisitvā bhagavato pādesu sirasā nipatitvā bhagavato pādāni mukhena ca paricumbati pāṇīhi ca parisambāhati nāmañca sāveti – ‘‘rājāhaṃ, bhante, pasenadi kosalo; rājāhaṃ, bhante , pasenadi kosalo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kaṃ pana tvaṃ, mahārāja, atthavasaṃ sampassamāno imasmiṃ sarīre evarūpaṃ paramanipaccakāraṃ karosi, mettūpahāraṃ upadaṃsesī’’ti? ‘‘Kataññutaṃ kho ahaṃ, bhante, kataveditaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhagavā ",
      " hi, bhante, bahujanahitāya paṭipanno bahujanasukhāya bahuno janassa ariye ñāye patiṭṭhāpitā yadidaṃ kalyāṇadhammatāya kusaladhammatāya. Yampi, bhante, bhagavā bahujanahitāya paṭipanno bahujanasukhāya bahuno janassa ariye ñāye patiṭṭhāpitā yadidaṃ kalyāṇadhammatāya kusaladhammatāya, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
    ],
    "innerText": "‘‘Bhagavā hi, bhante, bahujanahitāya paṭipanno bahujanasukhāya bahuno janassa ariye ñāye patiṭṭhāpitā yadidaṃ kalyāṇadhammatāya kusaladhammatāya. Yampi, bhante, bhagavā bahujanahitāya paṭipanno bahujanasukhāya bahuno janassa ariye ñāye patiṭṭhāpitā yadidaṃ kalyāṇadhammatāya kusaladhammatāya, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhante, bhagavā sīlavā vuddhasīlo ariyasīlo kusalasīlo kusalasīlena samannāgato. Yampi, bhante, bhagavā sīlavā vuddhasīlo ariyasīlo kusalasīlo kusalasīlena samannāgato, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, bhante, bhagavā dīgharattaṃ āraññiko, araññavanapatthāni pantāni senāsanāni paṭisevati. Yampi, bhante, bhagavā dīgharattaṃ āraññiko, araññavanapatthāni ",
      " pantāni senāsanāni paṭisevati, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
    ],
    "innerText": "‘‘Puna caparaṃ, bhante, bhagavā dīgharattaṃ āraññiko, araññavanapatthāni pantāni senāsanāni paṭisevati. Yampi, bhante, bhagavā dīgharattaṃ āraññiko, araññavanapatthāni pantāni senāsanāni paṭisevati, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhante, bhagavā santuṭṭho ",
      " itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena. Yampi, bhante, bhagavā santuṭṭho itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi. ‘‘Puna caparaṃ, bhante, bhagavā āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Yampi, bhante, bhagavā āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
    ],
    "innerText": "‘‘Puna caparaṃ, bhante, bhagavā santuṭṭho itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena. Yampi, bhante, bhagavā santuṭṭho itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi. ‘‘Puna caparaṃ, bhante, bhagavā āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Yampi, bhante, bhagavā āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhante, bhagavā yāyaṃ kathā abhisallekhikā cetovivaraṇasappāyā, seyyathidaṃ – appicchakathā santuṭṭhikathā pavivekakathā asaṃsaggakathā vīriyārambhakathā sīlakathā samādhikathā ",
      " paññākathā vimuttikathā vimuttiñāṇadassanakathā, evarūpāya kathāya nikāmalābhī akicchalābhī akasiralābhī. Yampi, bhante, bhagavā yāyaṃ kathā abhisallekhikā cetovivaraṇasappāyā, seyyathidaṃ – appicchakathā…pe… vimuttiñāṇadassanakathā, evarūpāya kathāya nikāmalābhī akicchalābhī akasiralābhī, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
    ],
    "innerText": "‘‘Puna caparaṃ, bhante, bhagavā yāyaṃ kathā abhisallekhikā cetovivaraṇasappāyā, seyyathidaṃ – appicchakathā santuṭṭhikathā pavivekakathā asaṃsaggakathā vīriyārambhakathā sīlakathā samādhikathā paññākathā vimuttikathā vimuttiñāṇadassanakathā, evarūpāya kathāya nikāmalābhī akicchalābhī akasiralābhī. Yampi, bhante, bhagavā yāyaṃ kathā abhisallekhikā cetovivaraṇasappāyā, seyyathidaṃ – appicchakathā…pe… vimuttiñāṇadassanakathā, evarūpāya kathāya nikāmalābhī akicchalābhī akasiralābhī, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhante, bhagavā catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī ",
      " akicchalābhī akasiralābhī. Yampi, bhante, bhagavā catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ ",
      " nikāmalābhī akicchalābhī akasiralābhī, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
    ],
    "innerText": "‘‘Puna caparaṃ, bhante, bhagavā catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī. Yampi, bhante, bhagavā catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, bhante, bhagavā anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Yampi, bhante, bhagavā anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
    ],
    "innerText": "‘‘Puna caparaṃ, bhante, bhagavā anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Yampi, bhante, bhagavā anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhante, bhagavā dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā ",
      " vacīduccaritena samannāgatā ",
      " manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā ",
      " micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā; ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti, iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati…pe… yathākammūpage satte pajānāti. Yampi, bhante, bhagavā dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
    ],
    "innerText": "‘‘Puna caparaṃ, bhante, bhagavā dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā; ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti, iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati…pe… yathākammūpage satte pajānāti. Yampi, bhante, bhagavā dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, bhante, bhagavā āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Yampi, bhante, bhagavā āsavānaṃ khayā anāsavaṃ cetovimuttiṃ…pe… sacchikatvā upasampajja viharati, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
    ],
    "innerText": "‘‘Puna caparaṃ, bhante, bhagavā āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Yampi, bhante, bhagavā āsavānaṃ khayā anāsavaṃ cetovimuttiṃ…pe… sacchikatvā upasampajja viharati, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Handa ca dāni mayaṃ, bhante, gacchāma. Bahukiccā mayaṃ bahukaraṇīyā’’ti. ‘‘Yassa dāni tvaṃ, mahārāja, kālaṃ maññasī’’ti. Atha kho rājā pasenadi kosalo uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ ",
      " katvā pakkāmīti. Dasamaṃ."
    ],
    "innerText": "‘‘Handa ca dāni mayaṃ, bhante, gacchāma. Bahukiccā mayaṃ bahukaraṇīyā’’ti. ‘‘Yassa dāni tvaṃ, mahārāja, kālaṃ maññasī’’ti. Atha kho rājā pasenadi kosalo uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmīti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahāvaggo tatiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Sīhādhivutti ",
      " kāyena, cundena kasiṇena ca;"
    ],
    "innerText": "Sīhādhivutti kāyena, cundena kasiṇena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kāḷī ca dve mahāpañhā, kosalehi pare duveti."
  }
]